{"newsArray":[{"title":"Asia Cup 2022: \"He needs to focus more on cricket\" - Danish Kaneria on Virat Kohli's woes of late","link":"https://www.sportskeeda.com/cricket/news-asia-cup-2022-he-needs-focus-cricket-danish-kaneria-virat-kohli-s-woes-late?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Anuj Nitin Prabhu"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-19 13:09:25","image_url":"https://static.sportskeeda.com/editor/2022/08/7197e-16609110281154-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs South Africa LIVE: Cricket score from first Test as England lose two wickets before lunch","link":"https://www.independent.co.uk/sport/cricket/england-south-africa-live-stream-score-b2148388.html","keywords":["Cricket","Sport"],"creator":["Luke Baker"],"video_url":null,"description":"England finally end South Africa’s first innings on day three at Lord’s and look to close deficit with the bat","content":null,"pubDate":"2022-08-19 12:34:40","image_url":"https://static.independent.co.uk/2022/08/19/13/SEI120122638.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket - Crawley out again as England stutter against South Africa","link":"https://www.thestar.com.my/sport/cricket/2022/08/19/cricket---crawley-out-again-as-england-stutter-against-south-africa","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - South Africa spinner Keshav Maharaj grabbed two wickets while England opener Zak Crawley's batting woes continued when he was dismissed before lunch on Friday in a stuttering start to the second innings on the third day of the first test at Lord's. Read full story","content":"LONDON (Reuters) - South Africa spinner Keshav Maharaj grabbed two wickets while England opener Zak Crawley's batting woes continued when he was dismissed before lunch on Friday in a stuttering start to the second innings on the third day of the first test at Lord's. Crawley's immediate test future hangs in the balance after he was trapped leg before wicket by Maharaj for 13 before England went to lunch 38 for two wickets, trailing South Africa by 123 runs after having earlier on Friday dismissed the tourists for 326 in their first innings. Maharaj also claimed the wicket of Ollie Pope, who had top scored in England’s first innings, with the last ball of the morning session to leave the tourists holding the upper hand in the test. Alex Lees was 12 not out at lunch, with Joe Root next to join him. South Africa missed the chance for an even earlier breakthrough when Lees nicked to slip but a diving Keegan Petersen dropped the chance in the third over. Crawley’s future in the England team has been under a cloud and an average of 22.25 after 35 innings as test opener will have the selectors reconsidering his place in the team ahead of the next two tests in the series. Maharaj was brought on to bowl surprisingly early in the innings by South Africa captain Dean Elgar in what proved a clever tactic, despite the arsenal of fast bowlers at his disposal. Earlier, South Africa's lanky fast bowler Marco Jansen fell short of his half century before his side were bowled out, dismissed on 48 as South Africa moved from their overnight score of 289-7 in response to England's first innings tally of 165. Jansen added seven runs to his overnight score but helped keep England in the field for the first hour of play as he and Anrich Nortje added 29 runs for the ninth wicket before a thick edge saw him caught in the slips off Stuart Broad (3-71). Kagiso Rabada was out third ball of the day as he pulled the ball leg side, only for Broad to pluck it one-handed out of the air for a brilliant catch. Nortje was 28 not out off 42 balls. (Writing by Mark Gleeson in Cape Town; Editing by Christian Radnedge)","pubDate":"2022-08-19 12:33:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/19/1704208.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"“It rules me out of the India series”: Heather Knight to miss India series and WBBL due to hip surgery","link":"https://thesportsrush.com/cricket-news-it-rules-me-out-of-the-india-series-heather-knight-to-miss-india-series-and-wbbl-due-to-hip-surgety/","keywords":["Cricket","England Women","Heather Knight"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"English Women’s cricket team’s captain Heather Knight will miss the white-ball series against India and WBBL in October. After missing the podium finish at the Commonwealth Games in Birmingham, the English Women’s cricket will be on the road in September, when they will face India for a 3-match T20I and ODI series at home. The… The post “It rules me out of the India series”: Heather Knight to miss India series and WBBL due to hip surgery appeared first on The SportsRush.","content":"English Women’s cricket team’s captain Heather Knight will miss the white-ball series against India and WBBL in October. After missing the podium finish at the Commonwealth Games in Birmingham, the English Women’s cricket will be on the road in September, when they will face India for a 3-match T20I and ODI series at home. The ODI series will be a part of the ICC Championship. Ahead of the tournament, the English team suffered a blow when their captain Heather Knight was ruled out of the series. Knight was suffering a hip injury, and she underwent surgery for the same. Heather Knight ruled out of India series and WBBL English Women’s cricket team’s captain Heather Knight has undergone hip surgery, and she will be out of action for a few months now. Knight was set to captain London Spirit in the Hundred, but she was ruled out of the whole tournament earlier only. She has now posted an injury update via Twitter. Knight has confirmed that she will miss the upcoming home series against India in September, whereas she will also miss the upcoming Women’s Big Bash League in Australia in October. “Surgery (tick) I’ve had a little clean out of my hip to get me back and running soon,” Knight wrote on her Twitter. “Unfortunately, it rules me out of the India series and the WBBL, but I’m aiming to be back by the end of the year. Time to make the most of a bit of time away and bring on the rehab!.” Surgery I’ve had a little clean out of my hip to get me back and running soon. Unfortunately it rules me out of the India series and the WBBL, but I’m aiming to be back by the end of the year . Time to make the most of a bit of time away and bring on the rehab! pic.twitter.com/4Mcwjs2nwN — Heather Knight (@Heatherknight55) August 19, 2022 Heather Knight was a part of the English squad in the Commonwealth Games in Birmingham, but she missed the whole tournament due to an injury. Nat Sciver led the English team in the tournament, and they lost in the bronze medal match to New Zealand Women. Knight is one of the best players of the English Women’s team. She has scored 3548 ODI runs at 36.57, wheras she has scalped 55 wickets in bowling as well. The post “It rules me out of the India series”: Heather Knight to miss India series and WBBL due to hip surgery appeared first on The SportsRush.","pubDate":"2022-08-19 12:23:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Yes, we have chosen Sriram”: Sridharan Sriram appointed as Bangladesh’s coach for Asia Cup and T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-yes-we-have-chosen-sriram-sridharan-sriram-appointed-as-bangladeshs-coach-for-asia-cup-and-t20-world-cup-2022/","keywords":["Cricket","Bangladesh Cricket Board","Sridharan Sriram"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Bangladesh have appointed former Australian assistant coach Sridharan Sriram as their new coach for Asia Cup and T20 World Cup. Bangladesh cricket team recently suffered defeat against Zimbabwe in both ODIs and T20Is and that defeat has been not been taken lightly by anyone in Bangladesh. ODI captain Tamim Iqbal said that it was a… The post “Yes, we have chosen Sriram”: Sridharan Sriram appointed as Bangladesh’s coach for Asia Cup and T20 World Cup 2022 appeared first on The SportsRush.","content":"Bangladesh have appointed former Australian assistant coach Sridharan Sriram as their new coach for Asia Cup and T20 World Cup. Bangladesh cricket team recently suffered defeat against Zimbabwe in both ODIs and T20Is and that defeat has been not been taken lightly by anyone in Bangladesh. ODI captain Tamim Iqbal said that it was a heartbreaking loss as they lost against Zimbabwe, who are not that strong. Bangladesh’s next assignment is the Asia Cup, and then there is T20 World Cup as well this year. To improve the side’s performances, the board have roped in a new coach for the two big tournaments ahead. Bangladesh Cricket Board have appointed former Australian assistant coach and Indian all-rounder Sridharan Sriram as their coach for the upcoming Asia Cup and ICC T20 World Cup. BCB Director said that T20 World Cup is their main target, and the coach also needs some time to adapt as well. Sriram Sridharan just left his coaching role with the Australian team to pay attention with Royal Challengers Bangalore in IPL and to spend time with his family as well. Sriram has played 8 ODIs for India, where he has scalped 9 wickets at an economy of 5.07. He joined the Australian cricket team in 2016. ”Yes, we have chosen Sriram up until the World Cup,” BCB Director said as per Daily Star. ”As we are moving forward with a fresh mindset, the new coach will be seen from the Asia Cup onwards. And since the T20 World Cup is our main target, he ( the new coach) will not get time to adapt if he is not recruited from the Asia Cup.” Don’t believe in everything you see on the internet unless it’s from a reliable source or stay silent until it’s verified. Sridharan Sriram joining Bangladesh team as a TECHNICAL CONSULTANT. Russell Domingo remains in his position. pic.twitter.com/SgiIMXuDEz — Nazmus Sajid Chowdhury (@nazmussajid) August 19, 2022 Russell Domingo, the current coach of the team will stay with Bangladesh, and he will focus on guiding the test team now. The Bangladesh side will play a test match in November against India. ”Domingo would continue his role in guiding the Test team, for now, as we have a Test match against India in November.”","pubDate":"2022-08-19 11:59:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘Take a bow’ – Watch Stuart Broad take outrageous diving catch leaving England fans stunned against South Africa","link":"https://www.thesun.co.uk/sport/cricket/19557201/stuart-broad-england-cricket-diving-catch/","keywords":["Cricket"],"creator":["Joshua Mbu"],"video_url":null,"description":null,"content":"STUART BROAD left fans stunned with an outrageous diving catch against South Africa. England are taking on South Africa on day three of the first Test match at Lord’s. Sky SportsBroad pulled off a stunning one-handed catch[/caption] Sky SportsThe 36-year-old helped set the tone on day three[/caption] Sky SportsBroad left fans stunned and even fooled the camera[/caption] And Broad, 36, pulled off an outrageous one-handed catch to dismiss Kagiso Rabada. The catch even had the camera fooled, which followed along the ball’s flight path before realising it hand ended up in the hands of Broad. On England’s No8, one cricket fan said on Twitter: “On today’s episode of things that shouldn’t be allowed to happen on a cricket field.” Another said: “Oh my God, bloody brilliant, hope this sets the tone today.” READ MORE IN CRICKET STOKING THE FIRE Captain Stokes’ ferocious bowling gives England hope after batting tumble KO OFFER Get Anthony Joshua at 40/1 OR Oleksandr Usyk at 25/1 to win with William Hill England went into day three trailing the visitors by 124 runs. Ahead of the match Broad expressed his confidence that England could claw it back. And with the catch, he’s certainly leading by example. He said: “We’ve got a genuine feeling we’re still in this game. Most read in Cricket STOKING THE FIRE Captain Stokes’ ferocious bowling gives England hope after batting tumble RED FOR RUTH Who was Ruth Strauss and how long was she married to England cricketer Andrew? STRAUSS TRIBUTE Why are England players wearing red caps? ROOTING FOR YA Who is England cricket star Joe Root's wife Carrie? SILLY POINT Cricket fielding positions explained - What are the most common positions? NEW DUKES What is the new ball in Test cricket and when can bowlers use it? JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) “They were good batting conditions when the ball got softer today, and that’s something we’ll want to take forward. “We’ve got to make it a first-v-fourth-innings game. “It’s a relatively dry pitch, and Leachy was quite encouraged by the amount of spin he as getting. I think the game’s set up really nicely.”","pubDate":"2022-08-19 11:37:19","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket - South Africa have 161 run lead after being bowled out for 326 in first innings","link":"https://www.thestar.com.my/sport/cricket/2022/08/19/cricket---south-africa-have-161-run-lead-after-being-bowled-out-for-326-in-first-innings","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - South Africa's Marco Jansen fell short of his half century before his side were bowled out for 326 in their first innings on Friday, giving them a handy 161-run lead over England on the third day of the first test at Lord's. Read full story","content":null,"pubDate":"2022-08-19 11:21:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/19/1704120.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"'Just securing a place in the side..': Mohammad Kaif makes a BIG statement on Shikhar Dhawan, Cheteshwar Pujara","link":"https://zeenews.india.com/cricket/just-securing-a-place-in-the-side-mohammad-kaif-makes-a-big-statement-on-shikhar-dhawan-cheteshwar-pujara-2499114.html","keywords":null,"creator":null,"video_url":null,"description":"Former India batter Mohammad Kaif has been full of praise for both of these cricket veterans. Kaif wrote on Twitter that Dhawan and Pujara are not playing just for a place in the national side, you need pure love to bat so well and make runs so consistently.","content":null,"pubDate":"2022-08-19 10:33:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"WI vs NZ Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s New Zealand vs West Indies 2nd ODI match at Barbados, 11:30 PM IST, August 19","link":"https://zeenews.india.com/cricket/wi-vs-nz-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-new-zealand-vs-west-indies-2nd-odi-match-at-barbados-1130-pm-ist-august-19-2499104.html","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs New Zealand Dream11 Team Prediction West Indies vs New Zealand 2nd ODI match - Check My Dream11 Team, Best players list of WI vs NZ, West Indies Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips","content":null,"pubDate":"2022-08-19 10:04:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“100%”: Rashid Khan ardent on playing for Adelaide Strikers in BBL 2022-23","link":"https://thesportsrush.com/cricket-news-100-rashid-khan-ardent-on-playing-for-adelaide-strikers-in-bbl-2022-23/","keywords":["Cricket","Adelaide Strikers","BBL","Big Bash League","rashid khan"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Rashid Khan has just played for Adelaide Strikers in the Big Bash League, and this time he will go in the International players’ draft. The Big Bash League is set to start from 13 December 2022, and ahead of the tournament, there will be an international player’s draft for the very first time in the… The post “100%”: Rashid Khan ardent on playing for Adelaide Strikers in BBL 2022-23 appeared first on The SportsRush.","content":"Rashid Khan has just played for Adelaide Strikers in the Big Bash League, and this time he will go in the International players’ draft. The Big Bash League is set to start from 13 December 2022, and ahead of the tournament, there will be an international player’s draft for the very first time in the history of the competition. Some big names have registered for the draft, and Rashid Khan is one of them. Rashid is going to be a hot property in the draft as he is one of the biggest match winners in the shortest format of the game. He has just played for Adelaide Strikers in the BBL so far, and the Strikers will have an opportunity to sign him back by the use of the retention rule. In a recent Interview with the BBL, Rashid Khan was asked whether he would want to return to the Adelaide Strikers in the upcoming BBL season. He was clear about his choice and said that he just loves the Adelaide Strikers, and he wants to join them back 100%. “100%, Yeah. I love my time in Adelaide and I love Strikers, love the fans, love the ground and love the city,” Rashid Khan said. “I always have that kind of discussion with the players and with the friends that it’s a city that I would love to live in the future.” Rashid Khan has bowled his last ball of #BBL10 😢 Don’t they love him here in Adelaide! pic.twitter.com/5vE0LCMU7J — KFC Big Bash League (@BBL) January 11, 2021 Rashid was also asked about the other Afghan players that he wants to get picked in the upcoming BBL International draft. He said that he wants Rahmanullah Gurbaz and Hazratullah Zazai to get picked. Both of them are openers, and they are famous for playing an aggressive brand of cricket. “I’m looking forward to a couple of openers, Hazratullah Zazai and Rahmanullah Gurbaz. Both of them are destructive batsmen, especially in the short format of the game. They have done so so well so far,” Rashid added. Gurbaz was a part of Gujarat Titans in IPL 2022, whereas Hazratullah Zazai has also played in T20 leagues around the world. Both of them can make their BBL debuts this season.","pubDate":"2022-08-19 09:45:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ICC media rights tender: auction guidelines, major contenders and concerns","link":"https://sportstar.thehindu.com/cricket/icc-media-rights-auction-price-date-tender-star-viacom18-sony-zee/article65786779.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"ICC media rights tender: Here’s all you need to know about the International Cricket Council’s media rights auction.","content":"The International Cricket Council’s television and digital rights bundle for the Indian sub-continent will be up for sale and the ICC has asked for sealed tenders to be submitted by August 26. The bids are expected to be opened on August 26 in Dubai. Auction guidelines The ICC has unbundled the rights for the men’s and women’s matches and is seeking separate bids for the next cycle of eight years from 2024 to 2031. According to the guidelines set by the game’s governing body, if there is a tie between the bidders then an e-auction will be held to decide the successful bidder. Though several media giants have expressed concerns over the transparency of the process, quite a few top companies are in the fray to bag the rights. Who are the major players? Some of the potential bidders include Star, Viacom18, Sony, Zee, FanCode and Amazon. While Star and Viacom bagged the television and digital rights respectively in the IPL media rights auction, the Jeff Bezos-owned Amazon had pulled out of the auction despite initial interest. The controversy There has been a fair bit of controversy with a few companies alleging a conflict of interest against Indra Nooyi – the only female representative in the ICC’s Board of Directors. Nooyi is also part of the Amazon’s board. Is there a conflict? The answer is no. According to the ICC, Nooyi has recused herself from the upcoming media rights sale. She will not be part of the final ICC Board decision on the ITT. A former chairperson-CEO of PepsiCo, Nooyi is also a part of the ICC’s powerful financial and commercial affairs (F&CA) committee. The ICC has confirmed that Nooyi never violated its constitution and regulations on the ‘Conflict of Interest’ issue. The clause 2.2.4.1 of ICC constitution states that “When a Director, committee member or staff member has or may have an actual, apparent or potential Conflict of Interest in respect of his duties to the ICC, he/she must disclose the Conflict to the Ethics Officer without delay (and where possible make disclosure prior to his election or appointment as Director, staff member or committee member), or if such Conflict arises during meeting, he must disclose the Conflict to relevant chair of meeting.” What are the other concerns? Ever since the ICC announced its media rights auction, Indian companies have expressed concerns over the process, with some indicating a lack of transparency. However, the ICC had issued a long clarification, stating that the value of four and eight-year bids will remain undisclosed to protect the principle of ‘closed’ bidding. Concerns, however, remain on how the ICC will decide on the winners of the first round and how the successful candidates will be chosen for the second. The second round could be an e-auction if needed and could be held on August 29. The companies have sought more clarity. What is ICC’s stand? After the sealed bids are submitted by August 22, the ICC wants to do a check on the guarantees and other the due diligence to make sure that the process is ‘fool-proof’. The ICC has also clarified that the rights holders will have to bear a 20 per cent premium in case of an event being shifted to IST. However, there will be a discount of 20 percent if an event is relocated to a non-Indian time zone of more than four-hour difference. The ICC has clarified that there is no liability or responsibility for the broadcasters over withholding tax and the Indian companies can follow the law of the land on the broadcast fee when an event is held in India. Read more stories on Cricket.","pubDate":"2022-08-19 09:26:40","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Gautam Gambhir announces return to cricket field, will play THIS T20 league","link":"https://zeenews.india.com/cricket/gautam-gambhir-confirms-participation-in-legends-league-cricket-2-2499087.html","keywords":null,"creator":null,"video_url":null,"description":"Gautam Gambhir has been a part of India`s World Cup-winning teams in the inaugural edition of Men`s T20 World Cup in 2007 and Men`s ODI World Cup in 2011. Gambhir is also remembered for being the top-run scorer with 97 in the 2011 ODI World Cup final against Sri Lanka at the Wankhede Stadium in Mumbai.","content":"Former Indian captain Gautam Gambhir will take part in the second edition of Legends League Cricket (LLC), the organisers confirmed on Friday (August 19). The league will kickstart from September 17. The attacking left-handed batter, who helped India clinch T20 World Cup 2007 and ODI World Cup 2011, said that he is glad to be playing cricket again and cannot wait to be back on the field again. \"I am glad to share that I have committed to take part in the upcoming Legends League Cricket from September 17th onwards. I am excited in anticipation of being on a cricket field once again. It will be a privilege and an honour to rub shoulders once again with the glitterati of world cricket,\" said Gambhir on his association with LLC season two. He has been a part of India`s World Cup-winning teams in the inaugural edition of Men`s T20 World Cup in 2007 and Men`s ODI World Cup in 2011. Gambhir is also remembered for being the top-run scorer with 97 in the 2011 ODI World Cup final against Sri Lanka at the Wankhede Stadium in Mumbai. Gambhir represented India in 58 Tests, 147 ODIs and 37 T20Is, scoring 6,170 runs in limited-overs cricket apart from 4,154 Test runs. He also captained Kolkata Knight Riders to clinching two IPL titles in 2012 and 2014. #BossLogonKaGame welcomes a #Boss player whose contribution to India's 2007 T20 World Cup and 2011 ODI World Cup wins is legendary. Welcome #Legend @GautamGambhir for the new season of #LegendsLeagueCricket #BossLogonKaGame #LLCT20 #BossGame pic.twitter.com/RDXePIAmJ5 — Legends League Cricket (@llct20) August 19, 2022 In the previous weeks, the league has added iconic players like Chris Gayle, Harbhajan Singh, Virender Sehwag, Shane Watson, Brett Lee, Mohammad Kaif, Irfan Pathan, Muttiah Muralitharan, and Jacques Kallis amongst others. The upcoming season of Legends League Cricket is being scheduled to be played in six Indian cities: Kolkata, New Delhi, Cuttack, Lucknow, Jodhpur and Rajkot. The league had also announced that a special match between India Maharajas and World Giants will be played at Eden Gardens on September 16. Former India captain and current BCCI President Sourav Ganguly to lead India while the World Team will be captained by 2019 World Cup-winning skipper and England`s former white-ball captain Eoin Morgan. After this, the second season of LLC will commence from September 17 till October 8.","pubDate":"2022-08-19 09:19:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“The tour was bittersweet, obviously”: Will Pucovski talks about shoulder injury on Test debut vs India at SCG","link":"https://thesportsrush.com/cricket-news-the-tour-was-bittersweet-obviously-will-pucovski-talks-about-shoulder-injury-on-test-debut-vs-india-at-scg/","keywords":["Cricket","Will Pucovski"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Will Pucovski made his test debut against India in January 2021, but he injured his shoulder in the match while fielding. Australian batter Will Pucovski has always been called the next big thing in Australian cricket, but he has been very unlucky with the concussions. To everyone’s surprise, Pucovski has been through 11 concussions so… The post “The tour was bittersweet, obviously”: Will Pucovski talks about shoulder injury on Test debut vs India at SCG appeared first on The SportsRush.","content":"Will Pucovski made his test debut against India in January 2021, but he injured his shoulder in the match while fielding. Australian batter Will Pucovski has always been called the next big thing in Australian cricket, but he has been very unlucky with the concussions. To everyone’s surprise, Pucovski has been through 11 concussions so far in his small competitive career. He suffered nine concussions before making his debut against India at the Sydney Cricket Ground in 2021, but he injured his shoulder in that game. Pucovski scored a brilliant half-century in the game. The 10th concussion in November 2021 made him miss the Ashes 2021-22 for Australia. Earlier this year, Pucovski made his return , but he got hit on his head by a volleyball in warmups, and he suffered his 12th concussion. Pucovski has scored 1962 first-class runs at an astonishing average of 51.63, with the help of six centuries and eight half-centuries. Will Pucovski is currently in Chennai as a part of an exchange program with MRF Pace academy. In a recent interview with ESPNCricinfo, Will talked about various aspects of his physical and mental journey over the last few years. He also talked about his debut test against India. Pucovski called that a bittersweet series as he injured his shoulder while fielding in his debut match which ruled him out for a considerable amount of time. He insists that he was on Cloud nine when he was at the middle, but believes that he is just 24 at the moment, and he can kickstart his career yet again. “That first day when I was batting, after getting through the nerves, those ten-15 minutes felt like I was on cloud nine,” Pucovski said. “But yeah, the tour was bittersweet, obviously, getting injured. It’s just one of those things that you can’t help, with injuries. I am 24 years old and I have so much time.” “As I have said before, maybe it’s all a part of the beginning of the journey. I am going to be more ready to play again, hopefully, when I get an opportunity at some stage.” A maiden half-century for Will Pucovski! #AUSvIND pic.twitter.com/EATxx0nDGg — cricket.com.au (@cricketcomau) January 7, 2021 Pucovski played his last FC game in the Sheffield Shield final between Victoria and Western Australia in April this year. Victoria could not win the championship, but Will impressed everyone by scoring a brilliant half-century.","pubDate":"2022-08-19 08:49:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Indian all-rounder Sridharan Sriram appointed as Bangladesh's coach","link":"https://www.business-standard.com/article/sports/indian-all-rounder-sridharan-sriram-appointed-as-bangladesh-s-coach-122081900449_1.html","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh Cricket Board (BCB) has appointed former India all-rounder Sridharan Sriram as the coach for the national team for both the upcoming Asia Cup in the UAE and the T20 World Cup in Australia. A report in \"The Daily Star\" newspaper quoted a BCB director, who confirmed Sriram's appointment and said, \"Yes, we have chosen Sriram up until the World Cup.\" \"As we are moving forward with a fresh mindset, the new coach will be seen from the Asia Cup onwards. And since the T20 World Cup is our main target, he (a new coach) will not get time to adapt if he is not recruited from the Asia Cup. \"Many may say that there is not much left for the Asia Cup. However, as I said, our main focus is the T20 World Cup,\" he added. Sriram represented India in eight ODIs between 2000 and 2004 and also served as Australia's assistant and spin-bowling coach for a long time. It was under former Australian coach Darren Lehmann, Sriram was entrusted with the responsibility as a spin bowling coach in ...","content":"Bangladesh Cricket Board (BCB) has appointed former India all-rounder Sridharan Sriram as the coach for the national team for both the upcoming Asia Cup in the UAE and the T20 World Cup in Australia. A report in \"The Daily Star\" newspaper quoted a BCB director, who confirmed Sriram's appointment and said, \"Yes, we have chosen Sriram up until the World Cup.\" \"As we are moving forward with a fresh mindset, the new coach will be seen from the Asia Cup onwards. And since the T20 World Cup is our main target, he (a new coach) will not get time to adapt if he is not recruited from the Asia Cup . \"Many may say that there is not much left for the Asia Cup. However, as I said, our main focus is the T20 World Cup,\" he added. Sriram represented India in eight ODIs between 2000 and 2004 and also served as Australia's assistant and spin-bowling coach for a long time. It was under former Australian coach Darren Lehmann, Sriram was entrusted with the responsibility as a spin bowling coach in 2016. The 46-year-old recently stepped down from that position to focus on his role with the Indian Premier League (IPL) side, Royal Challengers Bangalore. The BCB official, however, also said, that South African Russell Dominigo would continue to be in charge of the Test side. \"Domingo would continue his role in guiding the Test team, for now, as we have a Test match against India in November . (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-08-19 08:48:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220819/thumb-122081900449.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Sridharan Sriram Appointed B'desh Coach For Asia Cup And T20 WC: Report","link":"https://sports.ndtv.com/cricket/sridharan-sriram-appointed-bangladesh-coach-for-asia-cup-and-t20-world-cup-report-3268046","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh Cricket Board (BCB) has appointed former India all-rounder Sridharan Sriram as the coach for the national team for both the upcoming Asia Cup in the UAE and the T20 World Cup in Australia","content":"Bangladesh Cricket Board (BCB) has appointed former India all-rounder Sridharan Sriram as the coach for the national team for both the upcoming Asia Cup in the UAE and the T20 World Cup in Australia. A report in \"The Daily Star\" newspaper quoted a BCB director, who confirmed Sriram's appointment and said, \"Yes, we have chosen Sriram up until the World Cup.\" \"As we are moving forward with a fresh mindset, the new coach will be seen from the Asia Cup onwards. And since the T20 World Cup is our main target, he (a new coach) will not get time to adapt if he is not recruited from the Asia Cup. \"Many may say that there is not much left for the Asia Cup. However, as I said, our main focus is the T20 World Cup,\" he added. Sriram represented India in eight ODIs between 2000 and 2004 and also served as Australia's assistant and spin-bowling coach for a long time. It was under former Australian coach Darren Lehmann , Sriram was entrusted with the responsibility as a spin bowling coach in 2016. The 46-year-old recently stepped down from that position to focus on his role with the Indian Premier League (IPL) side, Royal Challengers Bangalore. The BCB official, however, also said, that South African Russell Dominigo would continue to be in charge of the Test side. Promoted \"Domingo would continue his role in guiding the Test team, for now, as we have a Test match against India in November .\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-08-19 08:02:43","image_url":"https://c.ndtvimg.com/2022-07/rqu670bg_sridharan-sriram-afp_625x300_29_July_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England’s Heather Knight undergoes surgery, to miss India series","link":"https://sportstar.thehindu.com/cricket/womens-cricket/heather-knight-undergoes-hip-surgery-ruled-out-of-india-series/article65786737.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"England captain Heather Knight underwent a hip surgery on Friday. She aims to come back to competitive cricket by the end of the year.","content":"England captain Heather Knight ruled herself out of competitive cricket for the next few months to take necessary rest after a hip surgery. She aims to return to cricket by the end of the year. It means she won’t play for England during the ODI and T20I series against India in September. Surgery I've had a little clean out of my hip to get me back and running soon. Unfortunately it rules me out of the India series and the WBBL, but I'm aiming to be back by the end of the year. Time to make the most of a bit of time away and bring on the rehab! pic.twitter.com/4Mcwjs2nwN On Twitter , she wrote, “I’ve had a little clean out of my hip to get me back and running soon. Unfortunately it rules me out of the India series and the [Women’s Big Bash League), but I’m aiming to be back by the end of the year. Time to make the most of a bit of time away and bring on the rehab!” Knight was part of the England’s Commonwealth Games squad but didn’t play a single match due to her hip injury. She couldn’t participate in The Hundred either. She had to take injections to deal with the pain during the home series against South Africa. India plays three ODIs and three T20Is in a white-ball series starting in Chester-le-Street on September 10. Read more stories on Women's Cricket.","pubDate":"2022-08-19 07:45:26","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"SUR vs GLO Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Royal London One Day Cup 2022, Match 55","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sur-vs-glo-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-royal-london-one-day-cup-2022-match-55?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-19 07:29:48","image_url":"https://static.sportskeeda.com/editor/2022/08/a45f5-16608906297152-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs New Zealand 2nd ODI Livestream Details: When and where to watch WI vs NZ, cricket schedule, TV timing in India","link":"https://zeenews.india.com/cricket/west-indies-vs-new-zealand-2nd-odi-livestream-details-when-and-where-to-watch-wi-vs-nz-cricket-schedule-tv-timing-in-india-2499030.html","keywords":null,"creator":null,"video_url":null,"description":"Nicholas Pooran-led West Indies will take on Kane Williamson’s New Zealand in the second ODI series in Barbados on Friday (August 19). WI lead series 1-0.","content":null,"pubDate":"2022-08-19 07:18:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"'Rohit Sharma played reckless shots..': Dinesh Karthik makes a BIG statement on India captain ahead of Asia Cup 2022","link":"https://zeenews.india.com/cricket/rohit-sharma-played-reckless-shots-dinesh-karthik-makes-a-big-statement-on-india-captain-ahead-of-asia-cup-2022-2499021.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma's teammate and old friend Dinesh Karthik recently opened up on his struggles in Test side on docu-series on Cricbuzz. He said that Rohit always wanted to contribute to Test cricket and that he never quit thinking about it.","content":"India captain Rohit Sharma has had a tough time in Test cricket. Till 2019, he was not a part of the Test format even if he became a constant in the limited overs side. Rohit had struggled throughout his Test career untill he was given the responsibility to open the innings. When he started opening the innings, he started to become consistent, a series of hundreds followed and with time, he guranteed his p;ace in the XI. Today, Rohit captains the Indian national team in all 3 formats. His teammate and old friend Dinesh Karthik recently opened up on his struggles in Test side on docu-series on Cricbuzz. He said that Rohit always wanted to contribute to Test cricket and that he never quit thinking about it. \"He has found answers to some, and he has not found answers to some. Rohit always believed that he had something to contribute to Test cricket. In the conversations that I have had, he always felt that maybe certain things didn't go his way,\" Karthik said. \"Sometimes, he played a reckless shot or two but he believed that he will come back. Interestingly, he didn't come back at the speed that he would and he resigned to the fact that maybe it's just going to be white-ball cricket for him now.\" Rohit had a great start to his Test career in 2013 as he scored 177 and 111 not out vs West Indies in his first two Tests. Karthik feels those two hundreds put a burden of expectations on the shoulders of Rohit, who was seen as the next Sachin Tendulkar. But things didn't pan out exactly like that. Karthik said that Rohit was thrown many curve balls at him and he had to answer all of them. Rohit had certainly answered some of them.","pubDate":"2022-08-19 06:52:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“He is an automatic choice”: Chandu Borde believes Rishabh Pant is a sure starter for India in T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-he-is-an-automatic-choice-chandu-borde-believes-rishabh-pant-is-a-sure-starter-for-india-in-t20-world-cup-2022/","keywords":["Cricket","Chandu Borde","Indian Cricket team","rishabh pant"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Chandu Borde has said that there is no doubt about the place of Rishabh Pant in India’s playing 11 for the T20 World Cup. The rise of Rishabh Pant has been marvelous in the last few years. After the historic test series against Australia, he has sealed his place in the Indian side in all… The post “He is an automatic choice”: Chandu Borde believes Rishabh Pant is a sure starter for India in T20 World Cup 2022 appeared first on The SportsRush.","content":"Chandu Borde has said that there is no doubt about the place of Rishabh Pant in India’s playing 11 for the T20 World Cup. The rise of Rishabh Pant has been marvelous in the last few years. After the historic test series against Australia, he has sealed his place in the Indian side in all three formats of the game, whereas he also leads the IPL franchise Delhi Capitals. Pant’s performances in red-ball cricket have been excellent, but he has not been able to do that well with the white ball. However, in the last ODI series against England, he scored his maiden ODI century to lead the Indian team to a victory. The experts are divided on their opinions about Rishabh’s place in the playing eleven of India’s white-ball team. Some of them want Dinesh Karthik to play because of his form, whereas some want Rishabh to stay. Former Indian all-rounder Chandu Borde has also revealed his say on the same. Former Indian cricketer Chandu Borde believes that there is no competition for Rishabh Pant’s place in the Indian playing 11 for the T20 World Cup. Dinesh Karthik is a wicket-keeping option, and he is in brilliant form as well since the IPL 2022. Even KL Rahul can do the wicket-keeping duties. However, Borde believes that Pant is not just a finisher, and he has the ability to change the momentum of the game. He insists that Pant can play at any position, and he should be an automatic choice in the playing eleven of India. “I don’t think there is any competition for Rishabh Pant. He is an automatic choice and will continue to be an important part of the team,” Borde told India TV. “Rishabh Pant is a player who can change the momentum of the game in no time, and he is not just a finisher – he can play anywhere and anytime.” Rishabh Pant smashes his maiden ODI century, leading the Indian charge towards the finish line. 🔥 An absolute cracker of a knock under pressure! 💙 #PlayBold #ENGvsIND #TeamIndia pic.twitter.com/QGJaKmWQrE — Royal Challengers Bangalore (@RCBTweets) July 17, 2022 Borde said that Rishabh has just started his international career, and it is hard to believe that he has already won a lot of games for the Indian side. He said that the performances of Rishabh Pant will take him to newer heights in his career. “If you look at Rishabh Pant’s career span, he has just started out, but the way he has won matches for India—it’s unbelievable. With time, as he learns more, his performance will reach newer heights,” Borde added.","pubDate":"2022-08-19 06:31:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket World Cup 2023: डायरेक्ट एंट्री से चूक सकती हैं ये दो बड़ी टीमें, ऐसी है वर्ल्ड कप सुपर लीग की पॉइंट्स टेबल","link":"https://www.abplive.com/sports/cricket/icc-mens-cricket-world-cup-super-league-points-table-updates-wc-2023-qualification-format-2195518","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Cricket World Cup Super League: भारत में अगले साल क्रिकेट वर्ल्ड कप (Cricket World Cup 2023) का आयोजन होना है. इसमें 10 टीमें हिस्सा लेंगी. इन 10 में से 8 टीमें वर्ल्ड कप सुपर लीग पॉइंट्स टेबल (Cricket World Cup Super League Points Table) से तय होंगी, जबकि अन्य दो टीमें वर्ल्ड कप क्वालीफायर राउंड के सहारे शिरकत करेंगी. भारतीय टीम मेजबान होने के नाते पहले ही वर्ल्ड कप के लिए अपनी जगह पक्की कर चुकी हैं. ऐसे में अन्य स्पॉट के लिए टीमों के हाल क्या हैं? यहां देखें... श्रीलंका और दक्षिण अफ्रीका हैं टॉप-8 से बाहरक्रिकेट वर्ल्ड कप सुपर लीग में टॉप पर इंग्लैंड काबिज है. इंग्लैंड के साथ-साथ पाकिस्तान, न्यूजीलैंड, वेस्टइंडीज, ऑस्ट्रेलिया भी इस पॉइंट्स टेबल में टॉप-8 में मौजूद हैं. बांग्लादेश और अफगानिस्तान भी फिलहाल वर्ल्ड कप 2023 में डायरेक्ट एंट्री का दांवा ठोंक रही हैं. यहां दो बड़ी टीमें श्रीलंका और दक्षिण अफ्रीका टॉप-8 से बाहर हैं. ऐसे में यह दोनों टीमें वर्ल्ड कप के लिए डायरेक्ट एंट्री से चूक सकती हैं. इन्हें क्वालीफाइंग राउंड खेलने पड़ सकते हैं. रैंक टीम मैच जीते हारे पॉइंट्स 1 इंग्लैंड 18 12 5 125 2 बांग्लादेश 18 12 6 120 3 पाकिस्तान 17 11 6 110 4 अफगानिस्तान 12 10 2 100 5 न्यूजीलैंड 10 9 1 90 6 वेस्टइंडीज 22 9 13 90 7 इंडिया (Q) 13 9 4 89 8 ऑस्ट्रेलिया 12 7 5 70 9 आयरलैंड 21 6 13 68 10 श्रीलंका 18 6 11 62 11 दक्षिण अफ्रीका 13 4 7 49 12  जिम्बाब्वे 16 3 12 35 13 नीदरलैंड्स 18 2 15 25 ऐसा है वर्ल्ड कप सुपर लीग का फॉर्मेटवर्ल्ड कप सुपर लीग में 13 टीमों को रखा गया है. इन 13 टीमों के बीच साल 2020 से 2023 तक खेली जाने वाली कुछ द्विपक्षीय सीरीज वर्ल्ड कप सुपर लीग का हिस्सा हैं. इन सीरीज में खेले जाने वाले मैचों में टीमों के प्रदर्शन के आधार पर वर्ल्ड कप सुपर लीग में पॉइंट्स दिए जा रहे हैं. जीतने वाली टीम को 10 पॉइंट, हारने वाली टीम को जीरो पॉइंट और ड्रा/टाई/बेनतीजा मुकाबलों में दोनों टीमों को 5-5 पॉइंट्स दिए जाते हैं. यहां टॉप 8 टीमें वर्ल्ड कप 2023 में सीधे एंट्री करेंगी. बाकी टीमों को अन्य 5 एसोसिएट टीमों के साथ क्वालीफाइंग मुकाबले खेलने होंगे. यानी कुल 10 टीमों के बीच क्वालीफायर्स मुकाबले होंगे और इनमें से 2 टीमें वर्ल्ड कप 2023 में पहुंचेंगी. यह भी पढ़ें.. IND vs ZIM: हेनरी ओलोंगा का वो करिश्माई ओवर जिसने टीम इंडिया से छीन ली थी जीत, ऐसा था 1999 वर्ल्ड कप का सबसे रोमांचक मैच  Manchester United को खरीदने के इच्छुक हैं जिम रेटक्लिफ, जानिये कितना है इस फुटबॉल क्लब का मार्केट कैप","content":null,"pubDate":"2022-08-19 06:18:56","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Gautam Gambhir To Play In Second Edition Of Legends League Cricket","link":"https://sports.ndtv.com/cricket/gautam-gambhir-to-play-in-second-edition-of-legends-league-cricket-3267752","keywords":null,"creator":null,"video_url":null,"description":"Former India opening batter Gautam Gambhir on Friday confirmed his participation in the upcoming second edition of Legends League Cricket.","content":"Former India opening batter Gautam Gambhir on Friday confirmed his participation in the upcoming second edition of Legends League Cricket. Gambhir has been a part of two of India's World Cup winning team in 2007 (T20 World Cup) and 2011 (50-over World Cup). Gambhir's 97 in 2011 World Cup final still gives sense of joy to every Indian cricket fan. Having represented India in 147 ODIs and 37 T20Is, Gambhir has over 6000 runs to his name in limited-overs cricket. He had also led Kolkata Knight Riders to win two IPL Seasons in 2012 and 2014 which was a remarkable achievement. \"I am glad to share that I have committed to take part in the upcoming Legends League Cricket from September 17th onwards. I am excited in anticipation of being on a cricket field once again. It will be a privilege and an honour to rub shoulders once again with the glitterati of world cricket,\" said Gambhir in an official release. Raman Raheja, Co-Founder and CEO, Legends League Cricket said, \"Who will ever forget Gautam's match, winning 97 runs in the 2011 World Cup Finals?\" I am sure fans will be expecting to experience the same nerve-chilling performance from Gautam and other iconic players in Season 2.\" A special match between India Maharajas and World Giants will be played on September 16 at the Eden Gardens, Kolkata and from September 17, the second edition of the Legends League will begin. India Maharajas would be led by Sourav Ganguly while World Giants will be captained by former England skipper Eoin Morgan . Players from across 10 foreign countries will be participating in this match. The league will commence the next day, September 17, 2022, wherein 4 teams in franchise format will be competing in the Legends League Cricket Franchise format. Overall 15 matches will be played in this season.","pubDate":"2022-08-19 06:13:53","image_url":"https://c.ndtvimg.com/2022-03/f5uissh8_gautam-gambhir-afp_625x300_20_March_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“I’m definitely open to doing it myself”: Rachael Haynes ready to lead Australian women’s cricket team in the absence of Meg Lanning","link":"https://thesportsrush.com/cricket-news-im-definitely-open-to-doing-it-myself-rachael-haynes-ready-to-lead-australian-womens-cricket-team-in-the-absence-of-meg-lanning/","keywords":["Cricket","Australia Women's cricket team","Meg Lanning","Rachael Haynes"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Rachael Haynes has expressed her desire to lead the Australian Women’s cricket team in the absence of Meg Lanning. Australian women’s cricket team’s captain Meg Lanning surprised everyone when she took an indefinite break from cricket after winning the Gold medal with Australia in the Commonwealth Games 2022. The team did not lose a single… The post “I’m definitely open to doing it myself”: Rachael Haynes ready to lead Australian women’s cricket team in the absence of Meg Lanning appeared first on The SportsRush.","content":"Rachael Haynes has expressed her desire to lead the Australian Women’s cricket team in the absence of Meg Lanning. Australian women’s cricket team’s captain Meg Lanning surprised everyone when she took an indefinite break from cricket after winning the Gold medal with Australia in the Commonwealth Games 2022. The team did not lose a single game in the tournament and clinched the gold. Recently, the head coach of the side, Matthew Motts left the Australian women’s team to join England’s men’s white-ball team, and now the break of Meg Lanning has left a big void in the leadership unit of the team. The official captain of the team is not announced yet, but Rachael Haynes is the designated vice-captain. Rachael Haynes ready to lead Australian women’s cricket team Australian vice-captain Rachael Haynes looks the favourite to take the captaincy role in the absence of Meg Lanning. There are many seasoned campaigners in Alyssa Healy, Ellyse Perry, Beth Mooney, etc, but Haynes is the designated vice-captain, and she leads Sydney Thunder in the WBBL as well. Haynes said that she has taken the leadership role in the absence of Lanning earlier as well, and she will be open to doing that again as well. However, she has said that she will respect the decision taken by the management and the new head coach of the side. “I’ve stepped into that role before when Meg’s been injured and I’m current vice-captain so whoever the head coach is and whoever the national selectors think is the best person to do it (is up to them),” Haynes said. “I’m definitely open to doing it myself, or if there’s another person who they think is better suited, then they’d have my full support as well. “So that’s not my decision – it’s a few people who have to mark that off … I’m happy to do it moving forward, but that’s not in my hands.” Rach returns!! @ThunderBBL‘s champion skipper puts pen to paper ahead of #WBBL08 pic.twitter.com/Xix2biwSmH — Weber Women’s Big Bash League (@WBBL) August 17, 2022 Haynes is currently playing for Welsh Fire in the Hundred, and the next assignment of the Australian team will be against India in December. She said that there is no long break in between, and the decision will be taken accordingly. The post “I’m definitely open to doing it myself”: Rachael Haynes ready to lead Australian women’s cricket team in the absence of Meg Lanning appeared first on The SportsRush.","pubDate":"2022-08-19 05:33:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Bhuvneshwar Kumar Of Today\": Manjrekar Names Pacer Who Can Be An Asset","link":"https://sports.ndtv.com/cricket/your-bhuvneshwar-kumar-of-today-sanjay-manjrekar-names-pacer-who-can-be-an-asset-in-indian-t20i-team-3267648","keywords":null,"creator":null,"video_url":null,"description":"While several seniors are automatic choices for the squad, there are still some spots which may be up for grabs. Former Indian cricket team player Sanjay Manjrekar said Deepak Chahar can be a good...","content":"With the 2022 T20 World Cup starting in Australia in just over two months' time, the Indian team management is in its final stages of zeroing in on the squad. \"There are still about two-and-a-half months left for the T20 World Cup. Before that, we have the Asia Cup and two home series against Australia and South Africa. More or less, 80-90 per cent of your team is set. There could be three-four changes, if at all, depending on the conditions. We need to check what suits our team in Australia,\" Rohit Sharma, India captain, said in a press conference on Wednesday. While several seniors are automatic choices for the squad, there are still some spots which may be up for grabs. Former Indian cricket team player Sanjay Manjrekar said Deepak Chahar can be a good option for India. \"I think they're testing waters with Deepak Chahar more because of his fitness and if he has a sensational 50-overs series which is likely to happen. When you see him in T20 international cricket, I mean he's got some phenomenal numbers. So, he is your Bhuvneshwar Kumar of today,\" Manjrekar said on SPORTS18's daily show 'Sports Over The Top'. Promoted \"The younger version of Bhuvneshwar Kumar who can swing the ball both ways to begin with. Maybe not as consistent in the death but that's the aspect of bowling that's getting better and better. So, the only thing that will prevent Deepak Chahar from getting into that T20 World Cup playing 11 is (being) very similar to Bhuvneshwar Kumar and Bhuvneshwar Kumar has looked really good. So, they might look for other kinds of seam bowlers but Deepak Chahar is somebody they should keep in mind and he's got to do something sensational to put his hand up.\" The Super 12 stage T20 World Cup starts on October 22.","pubDate":"2022-08-19 05:27:08","image_url":"https://c.ndtvimg.com/2021-06/5rqs45io_sanjay-manjrekar-bcci_650x400_08_June_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"New Zealand Cricket announces their A squad for India Tour in September","link":"https://www.business-standard.com/article/sports/new-zealand-cricket-announces-their-a-squad-for-india-tour-in-september-122081900210_1.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand A squad featuring seven players with international experience has been selected to tour India for red and white ball fixtures in September","content":"New Zealand Cricket on Thursday announced the A squad for the India tour. The A squad featuring seven players with international experience has been selected to tour India for red and white ball fixtures in September. The matches, all against India A, will be the first time a New Zealand A side has played overseas since the 2018 tour to the United Arab Emirates to play Pakistan A. Alongside the players with full International experience, the squad also features five players with a chance to represent New Zealand A for the first time: Chad Bowes, Matt Fisher, Ben Lister, Robbie O'Donnell and Joe Walker. Wellington Firebirds pace-bowler Logan van Beek returns to the NZ A programme after stints with the Netherlands, with the ICC eligibility rules allowing him to play for both sides concurrently. Tom Bruce (Central Districts) and Robbie O'Donnell (Auckland) have been named co-captains for the tour which departs on Friday, August 26. New Zealand A last toured India in 2017 and this visit will feature a similar structure, with three four-day matches and three one-day matches in Bangalore and Chennai, respectively. New Zealand selector Gavin Larsen, who will head away with the side as part of the support staff, said the tour represents a huge development opportunity for the playing and coaching group. \"It's great to have A fixtures back on the touring calendar and even more exciting to have the team playing in foreign conditions,\" Larsen said. \"This programme and tours like these are vital in developing our people and giving them opportunities to test themselves against quality opposition. We have an exciting mix in this group, including players who dominated our last home season such as Robbie O'Donnell and Tom Bruce, alongside emerging talents in Matt Fisher and Joe Walker,\" he added. Larsen noted players such as Mark Chapman, Jacob Duffy and Dane Cleaver had experienced success with the BLACKCAPS during the recent series in Europe, and said their experience would be invaluable within this group. \"With a mix of red ball and white ball matches it's a great chance to see the players in a variety of situations against what we know will be a very strong home side. The conditions present a great opportunity for the spin bowling group in particular, ahead of future tours and ICC events in the subcontinent,\" said Larsen. \"It's exciting to welcome Logan back into the NZ A set-up. He's a proven performer on the domestic scene and has impressed in his recent stints playing for the Netherlands. Touring India is one of the great experiences for any cricketer and I know the players and staff are looking forward to the challenge,\" he further said. Central Stags Head Coach Rob Walter will lead the coaching group, supported by Canterbury Assistant Coach Brendon Donkers and NZC High-Performance Coach Paul Wiseman. Seam bowling all-rounders Henry Shipley (Canterbury) and Nathan Smith (Wellington) were ruled out of contention due to injury. New Zealand A Squad: Tom Bruce (captain), Robbie O'Donnell (captain), Chad Bowes, Joe Carter, Mark Chapman, Dane Cleaver (wk), Jacob Duffy, Matt Fisher, Cameron Fletcher (wk), Ben Lister, Rachin Ravindra, Michael Rippon, Sean Solia, Logan van Beek and Joe Walker. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-08-19 05:02:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220819/thumb-122081900210.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Roosters saying bye, not farewell to SCG","link":"https://thewest.com.au/sport/rugby-league/roosters-saying-bye-not-farewell-to-scg-c-7938000","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"As they prepare for the opening of Allianz Stadium, the Sydney Roosters are hoping they will have the chance to return to the Sydney Cricket Ground before long.","content":null,"pubDate":"2022-08-19 04:58:05","image_url":"https://images.thewest.com.au/publication/C-7938000/9d8e7c1a66e2a0f7237374abe22069c44e54be75-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Back with a bang but India&#039;s Chahar not taking T20 spot for granted","link":"https://www.thestar.com.my/sport/cricket/2022/08/19/cricket-back-with-a-bang-but-india039s-chahar-not-taking-t20-spot-for-granted","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - A fit-again Deepak Chahar marked his return to India's Twenty20 side with a match-winning spell in the first one-day international against Zimbabwe on Thursday but the 30-year-old is not taking his place in the World Cup squad for granted. Read full story","content":"(Reuters) - A fit-again Deepak Chahar marked his return to India's Twenty20 side with a match-winning spell in the first one-day international against Zimbabwe on Thursday but the 30-year-old is not taking his place in the World Cup squad for granted. Chahar has been a familiar face in the 20-overs squad, shouldering new ball duties and providing late cameos with the bat. But he was sidelined for six months after suffering a quadriceps tear in February and then hurting his back. There was no rustiness on his return as he claimed 3-27, dismissing Zimbabwe's top three batsmen to set up India's 10-wicket win in Harare. Chahar said he was not preoccupied with his selection for the World Cup in Australia in October-November. \"That is not in my hand,\" he said after collecting the man-of-the-match award. \"Skill-wise, though, I have worked really hard. There I can say I have probably started where I had left off. \"After the first over, rest whatever I bowled, I was happy. It was a seven-over spell, so the fitness is good.\" While Jasprit Bumrah remains India's automatic choice across formats, the emergence of fellow seamers Harshal Patel and Arshdeep Singh complicates Chahar's return to the 20-overs squad ahead of the World Cup. \"When you are away for a long time, others come in and perform well and make their place in the side,\" Chahar said. \"To make your place in the side again, you have to give good performances. \"So that pressure is always there on a returning player. I had the same expectation that I will do well when I come back because that is all a player has in his hand.\" The remaining two ODIs are scheduled on Saturday and Monday also in Harare. (Reporting by Amlan Chakraborty in New Delhi; editing by Peter Rutherford)","pubDate":"2022-08-19 04:48:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/19/1703539.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"\"Lot Of Curve Balls Thrown At Rohit Sharma\": Star Teammate On India Captain's Struggles In Tests - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2xvdC1vZi1jdXJ2ZS1iYWxscy10aHJvd24tYXQtcm9oaXQtc2hhcm1hLXN0YXItdGVhbW1hdGUtb24taW5kaWEtY2FwdGFpbnMtc3RydWdnbGVzLWluLXRlc3RzLTMyNjc1MTLSAYoBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vY3JpY2tldC9sb3Qtb2YtY3VydmUtYmFsbHMtdGhyb3duLWF0LXJvaGl0LXNoYXJtYS1zdGFyLXRlYW1tYXRlLW9uLWluZGlhLWNhcHRhaW5zLXN0cnVnZ2xlcy1pbi10ZXN0cy0zMjY3NTEyL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Lot Of Curve Balls Thrown At Rohit Sharma\": Star Teammate On India Captain's Struggles In Tests  NDTV Sports'When Sachin retired, we thought he will be the one...': Karthik on India batter  Hindustan TimesDinesh Karthik recalls Rohit Sharma's struggle in Test cricket: There were many curve balls thrown at him  India Today‘He’s resigned to the fact that it’s just going to be white-ball cricket’ – Dinesh Karthik on Rohit Sharma’s woes in Tests  CricTrackerEverybody Thought Rohit Sharma is Going to Answer All Those Questions After Sachin Tendulkar's Retirement:  News18View Full coverage on Google News","content":null,"pubDate":"2022-08-19 04:30:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"USA make Cricket World Cup move after win against Scotland","link":"https://www.sentinelassam.com/sports-news/usa-make-cricket-world-cup-move-after-win-against-scotland-608169","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The United States of America have given their Cricket World Cup qualification hopes a huge boost after a thrilling two-wicket win over Scotland in Aberdeen.","content":"ABERDEEN: The United States of America have given their Cricket World Cup qualification hopes a huge boost after a thrilling two-wicket win over Scotland in Aberdeen. Needing 22 off the final nine deliveries at Mannofield Park, Jaskaran Malhotra took charge, importantly keeping the strike for the final over to wrestle victory. Scurrying for a winning single off the penultimate ball, Malhotra's partner Jessy Singh won a footrace against Safyaan Sharif, with the Scottish quicks underarm throw not in time to run Singh out. The win moves the Americans above UAE in third place on the League 2 table, and in an automatic qualification spot for next year's Cricket World Cup Qualifier for India 2023. IANS Also Read: Cheteshwar Pujara enjoying phenomenal run in Royal London One-Day Cup Also Watch: Guwahati Police Seizes 20,000 Bottles of Anrex Cough Syrup, 2 Held","pubDate":"2022-08-19 04:11:07","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/19/376187-cricket.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Warwickshire Sign Pacer Mohammed Siraj For The Last Three Matches Of County Championship","link":"https://www.sentinelassam.com/sports-news/warwickshire-sign-pacer-mohammed-siraj-for-the-last-three-matches-of-county-championship-608166","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"English County side Warwickshire on Thursday announced it has signed India right-arm pacer Mohammed Siraj for its last three matches of the ongoing County Championship.","content":"BIRMINGHAM: English County side Warwickshire on Thursday announced it has signed India right-arm pacer Mohammed Siraj for its last three matches of the ongoing County Championship. Siraj will arrive at Edgbaston ahead of Warwickshire's home match against Somerset on September 12. Siraj took 4-66 in the first innings of the fifth and final rescheduled Test between England and India at Edgbaston in July. He went on to pick six wickets in the three-match ODI series against England later in the month. Currently, Siraj is with the India ODI side for three-match series against Zimbabwe from August 18-22. \"I can't wait to join up with the Bears squad. I have always enjoyed playing in England with India and I'm excited to experience County Cricket. Edgbaston is a world-class stadium and the atmosphere it created this year for the Test was special.\" \"I'm really looking forward to making it my home in September and hopefully helping the Bears end the season well. I would like to extend my gratitude to both Warwickshire County Cricket Club and BCCI for this opportunity,\" said Siraj after getting signed by Warwickshire. He becomes the sixth Indian player to sign up for the English domestic cricket season in 2022. IANS Also Read: India Bowl Out England For 284; Attain 132-Run Lead In The First Innings Also Watch: Assam: Major Boost For War Against Drugs, Cops Seize Huge Drugs Consignment","pubDate":"2022-08-19 04:05:16","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/19/376185-mohammed-siraj.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"}]}