{"newsArray":[{"title":"Scarborough Cricket Club teams suffer Bank Holiday Monday defeats","link":"https://www.thescarboroughnews.co.uk/sport/cricket/scarborough-cricket-club-teams-suffer-bank-holiday-monday-defeats-3823281","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"Scarborough CC's run of poor YPLN form continued as they suffered their sixth defeat in their last eight matches, losing at home by six wickets to bottom of the table Acomb in a disappointing performance.","content":null,"pubDate":"2022-08-29 19:36:59","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI2ODMwMDE2.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sharjah Cricket Stadium pitch report: Bangladesh vs Afghanistan Sharjah pitch report for Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-sharjah-cricket-stadium-pitch-report-bangladesh-vs-afghanistan-sharjah-pitch-report-for-asia-cup-2022/","keywords":["Cricket","Afghanistan","Asia Cup 2022","Bnagladesh","Sharjah"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Sharjah Cricket Stadium pitch report: High-in confidence Afghanistan will take on Bangladesh in the second match of ‘Group B’ today. Brimming high in confidence and self-belief, the Mohammad Nabi-led Afghanistan side will take on Bangladesh in the second ‘Group B’ match of the ongoing Asia Cup 2022, at the Sharjah Cricket Stadium today. The Afghans… The post Sharjah Cricket Stadium pitch report: Bangladesh vs Afghanistan Sharjah pitch report for Asia Cup 2022 appeared first on The SportsRush.","content":"Sharjah Cricket Stadium pitch report: High-in confidence Afghanistan will take on Bangladesh in the second match of ‘Group B’ today. Brimming high in confidence and self-belief, the Mohammad Nabi-led Afghanistan side will take on Bangladesh in the second ‘Group B’ match of the ongoing Asia Cup 2022 , at the Sharjah Cricket Stadium today. The Afghans nailed pretty much every aspect of their game during the Asia Cup 2022 opener versus Sri Lanka, as they decimated them by 8 wickets a couple of days ago. While the new ball fast-bowlers punctured the Sri Lankan top-order within the Powerplay itself, the experienced spin-bowling trio of Mujeeb, Rashid, and Nabi were up to the task during the middle Overs, to restrict them to just over the 100-run mark while batting first. In reply, the opening batting pair of Hazratullah Zazai and Rahmanullah Gurbaz nailed the chase with aggression and finesse in mere 10.1 Overs, to come up with a statement of sorts. Bangladesh, on the other hand, have very little good memories worth cherishing in the T20 format for some time now. During their previous four T20I series since last year, not once have they ended up as the series winners, while playing against the likes of Afghanistan, Zimbabwe, West Indies, and Pakistan in the period. Our Asia Cup Squad 🤩😍 #NewCoverPhoto #AfghanAtalan #AsiaCup2022 pic.twitter.com/m9VFKwvd0a — Afghanistan Cricket Board (@ACBofficials) August 29, 2022 The last T20I at the Sharjah Cricket stadium took place between Scotland and Pakistan in November last year, during the ICC T20 World Cup. Although the relatively smaller boundary dimensions in this venue, present the batters with a wonderful opportunity to clear the fence, the average score across the 25 T20Is here since 2013 has been mere 146.6 runs. In the past one year, spinners have trumped the pacers in terms of average, strike rate, and the economy rate. Thus, akin the first match of Asia Cup 2022, the Afghan experienced spin-bowling trio might well come into the game right from the get-go, while Bangladesh’s Shakib-al-Hasan and Mahedi Hasan will also pose a threat. All in all, the pitch at Sharjah today, is likely to assist the bowlers more than the batters.","pubDate":"2022-08-29 18:36:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rashid Khan pleads for more opportunities for Afghanistan cricket","link":"https://www.iol.co.za/sport/cricket/international/rashid-khan-pleads-for-more-opportunities-for-afghanistan-cricket-7cee56bf-5a67-453c-b5ef-5db852b0ad2f","keywords":null,"creator":["AFP"],"video_url":null,"description":"Rashid remains the brightest star in a galaxy of talented players many of whom have seen dark days in the war-torn nation, which witnessed another takeover by the Taliban last year.","content":null,"pubDate":"2022-08-29 17:29:28","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/9d5e4085-ded3-531b-80e8-e6aa996efde6&operation=CROP&offset=0x30&resize=1280x720","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"“I have a huge fan base in India”: Shoaib Akhtar schools Indian journalist post her attempt to draw adverse reactions from him regarding former Indian cricketers","link":"https://thesportsrush.com/cricket-news-i-have-a-huge-fan-base-in-india-shoaib-akhtar-schools-indian-journalist-post-her-attempt-to-draw-adverse-reactions-from-him-regarding-former-indian-cricketers/","keywords":["Cricket","India","Pakistan","Shoaib Akhtar"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shoaib Akhtar schools Indian journalist as latter’s attempt to fuel unwarranted tension between him and former India players take a backseat. A cricket match between arch-rivals India and Pakistan manage to attract eyeballs of even those in both the countries not interested in watching/following the sport at all. The two major reasons for it being… The post “I have a huge fan base in India”: Shoaib Akhtar schools Indian journalist post her attempt to draw adverse reactions from him regarding former Indian cricketers appeared first on The SportsRush.","content":"Shoaib Akhtar schools Indian journalist as latter’s attempt to fuel unwarranted tension between him and former India players take a backseat. A cricket match between arch-rivals India and Pakistan manage to attract eyeballs of even those in both the countries not interested in watching/following the sport at all. The two major reasons for it being such a big hit is because: 1) Barring the previous few encounters, the India-Pakistan matches generally go down to the wire, making people restless on the edge of their seats, and 2) The jingoistic fervour which unwarrantedly equates a mere game of Cricket to a war-like situation, backed by the ever-rising political tensions between the two countries for more than seven decades now. As India and Pakistan geared for their first match of the ongoing Asia Cup 2022 yesterday, the media houses from both sides of the border commenced with their leg-pulling and mudslinging of former Cricketers from their rival nations, despite inviting them as part of their guest panel. An Indian journalist named Aditi Tyagi from ‘Zee News’ attempted to draw an adverse reaction from the former Pakistan pacer Shoaib Akhtar, who was invited to the channel’s programme ahead of the India-Pakistan clash which took place on Sunday. Tyagi referred to a statement made by former India batter Virender Sehwag, where the latter was referring to a previous incident from his playing days, when he had allegedly hurt Akhtar with an unavoidable comment. Who better to revisit cricket’s #GreatestRivalry than @virendersehwag himself! 😍 #BelieveInBlue #INDvPAK #TeamIndia pic.twitter.com/eWMl9AxI9w — Star Sports (@StarSportsIndia) August 19, 2022 The anchor wished to know whether Akhtar too had some memory of a similar sort of incident where he might have given it back to an Indian player during his career, and which he might wish to expose via her show. The 47-year-old initially admitted to have enquired Sehwag and even Gautam Gambhir regarding the aforementioned claim made by the former, which, as per him, were denied by both the former Indian openers explicitly. However, instead of clinging to the nauseating bait, Akhtar gracefully schooled the anchor by stating that he has huge respect for the Indian team and he in fact has a decent Indian fan following as well. Thus, he would not only like to be respected by the anchor, but would also not wish to speak something which would escalate the differences between the two countries. Shoaib Akhtar is on fire 🔥🔥🔥 pic.twitter.com/A1XtrmveZN — Taimoor Zaman (@taimoorze) August 27, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-29 17:10:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Board gives BIG update on Shaheen Afridi's injury, set to make comeback after...","link":"https://zeenews.india.com/cricket/ind-vs-pak-asia-cup-2022-shaheen-afridi-leaves-for-london-for-rehab-set-to-join-pakistan-cricket-team-ahead-of-t20-world-cup-in-australia-2503187.html","keywords":null,"creator":null,"video_url":null,"description":"Whilst in London, Shaheen will remain under the supervision of the PCB Medical Advisory Panel, which also comprises London-based Dr Imtiaz Ahmed and Dr Zafar Iqbal.","content":"The Pakistan Cricket Board today announced Shaheen Afridi has departed for London where he will complete his rehabilitation. PCB Chief Medical Officer, Dr Najeebullah Soomro: “Shaheen Shah Afridi requires uninterrupted, dedicated knee specialist care and London offers some of the best sports medical and rehabilitation facilities in the world. In the best interest of the player, we have decided to send him there. Update on Shaheen Shah Afridi Details here https://t.co/KhYYXEtjpw — PCB Media (@TheRealPCBMedia) August 29, 2022 “The medical department will receive daily feedback on his progress whilst in London and we are confident Shaheen will return to full fitness before the ICC Men’s T20 World Cup.” Whilst in London, Shaheen will remain under the supervision of the PCB Medical Advisory Panel, which also comprises London-based Dr Imtiaz Ahmed and Dr Zafar Iqbal. Since 2016, Dr Imtiaz has been the Head of Medical Services at the Queens Park Rangers Football Club, while Dr Zafar is Head of Sports Medicine at the Crystal Palace Football Club since 2015 (having worked previously with Tottenham Hotspur FC, Liverpool FC and Kent County Cricket Club). Shaheen suffered a PCL injury in July whilst fielding during the first Test against Sri Lanka. He is expected to regain complete fitness before the ICC Men’s T20 World Cup 2022, though his return to competitive cricket will be decided upon by the PCB Medical Advisory Panel.","pubDate":"2022-08-29 15:33:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Kholi’s performance was good to watch” – Wasim Zafar","link":"https://thenewsglory.com/kholis-performance-was-good-to-watch-wasim-zafar/","keywords":["Sports","Cricket","game","India","Virat Kohli"],"creator":["The News Glory"],"video_url":null,"description":"Dubai: Former Indian cricketer Wasim Jafar said that Kohli’s innings against Pakistan was good to watch. Kohli scored 35 runs off 34 balls in this match. Former captain of Indian cricket team Virat Kohli stood his ground against Pakistan in the first round of the ongoing Asia Cup series. He was expected to score a […]","content":"Dubai: Former Indian cricketer Wasim Jafar said that Kohli’s innings against Pakistan was good to watch. Kohli scored 35 runs off 34 balls in this match. Former captain of Indian cricket team Virat Kohli stood his ground against Pakistan in the first round of the ongoing Asia Cup series. He was expected to score a half-century in this match. But he was only half way through it. He hit 3 fours and 1 six in his innings. He tried to hit another six and lost his wicket on spin. In this case, Wasim Jafar shared his opinion about his innings. “Those 35 runs were very important in the game. Because what we chased was not 170 or 180 runs. Just 148 runs. Chasing such targets, there is no slump in the batting line-up and victory is assured. So those runs are important. He has made a comeback after a big break. Now he has returned to the field and has added runs. A big player like Virat Kohli would be expected to score 60-70 runs anyway when playing in these kinds of chases. His record against Pakistan is also excellent. That is why this expectation is placed on him,” Jafar said.","pubDate":"2022-08-29 13:26:04","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Explainer - Why did India and Pakistan have five fielders inside the circle in the death overs? - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2FzaWEtY3VwLTIwMjItZXhwbGFpbmVyLXdoeS1kaWQtaW5kaWEtYW5kLXBha2lzdGFuLWhhdmUtZml2ZS1maWVsZGVycy1pbnNpZGUtdGhlLWNpcmNsZS1pbi10aGUtZGVhdGgtb3ZlcnMtMTMzMTQyNtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Explainer - Why did India and Pakistan have five fielders inside the circle in the death overs?  ESPNcricinfoAsia Cup 2022: Jay Shah refuses to hold India's flag after the country's win | Oneindia News*Cricket  Oneindia NewsIndia edges archrival Pakistan in Asia Cup cricket thriller | Daily Sabah  Daily SabahRecent Match Report - Pakistan vs India 2nd Match, Group A 2022  ESPNcricinfoFawad thinks imported govt to blame for Pakistans defeat against India  Geo NewsView Full Coverage on Google News","content":null,"pubDate":"2022-08-29 12:49:38","image_url":null,"source_id":"google","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022, IND vs PAK: Indian pacers create history in T20I as India defeats Pakistan","link":"https://www.indiatvnews.com/sports/cricket/asia-cup-2022-ind-vs-pak-indian-pacers-create-history-in-t20i-as-india-defeats-pakistan-india-vs-pakistan-2022-08-29-803803","keywords":null,"creator":null,"video_url":null,"description":"It was a super Sunday for the Indian team as they began their Asia Cup 2022 campaign on a high note after beating their arch-rivals Pakistan in the first match of Group A. The match was an absolute thriller that kept the players and fans from both nations right on the edges of their seats. In the end, it was Hardik Pandya and Ravindra Jadeja who helped India seal the contest by 5 wickets. In the process of this victory, the India fast bowlers also achieved a historic feat in T20I cricket as the pacers took all 10 wickets for the first time in a T20I game.","content":null,"pubDate":"2022-08-29 12:35:58","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India and Pakistan finally give us a thriller worthy of the hype - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXNpYS1jdXAtMjAyMi1pbmRpYS1hbmQtcGFraXN0YW4tZmluYWxseS1naXZlLXVzLWEtdGhyaWxsZXItd29ydGh5LW9mLXRoZS1oeXBlLTEzMzE0MTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India and Pakistan finally give us a thriller worthy of the hype  ESPNcricinfoIndia vs Pakistan Highlights, Asia Cup 2022 Updates | Cricket Weekly | Hindustan Times  Hindustan TimesAsia Cup 2022: Top Order Falters, Pace Attack Shines - Here're the Takeaways of India vs Pakistan Clash  News18Rohit Sharma overtakes Martin Guptill to become leading run-scorer in T20  Adda247'Get to 70-80 and then maybe…': Gavaskar blasts Kohli, Rohit over shot selection  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-08-29 12:26:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Will Kohli continue playing shortest format for India post T20 World Cup?","link":"https://www.business-standard.com/article/sports/will-kohli-continue-playing-shortest-format-for-india-post-t20-world-cup-122082900770_1.html","keywords":null,"creator":null,"video_url":null,"description":"Who will blink first? Will it be BCCI or will it be Virat Kohli? Kohli the T20 batter is playing from his memory but it is now quite evident that his methods are not working quite well enough for him in this short-duration-high impact game. Nor is it allowing the Indian team to make optimal use of its resources. The 20's or 35's are coming but not at a strike-rate of 150 (it was 102 plus against Pakistan on Sunday). So can Kohli be dropped from the T20 World Cup squad? Not even in your wildest of imagination even if he isn't scoring runs at a breakneck pace. But can Kohli continue playing for India in this format post the T20 World Cup in Australia? Well, even if the people, who are in decision making positions know the answer, they won't spell it out. That is a question that has been doing rounds of the corridors of Indian cricket since the 'Desert Debacle' last year when India made a pre-mature exit from the T20 World Cup . That was Kohli's last tournament as India's T20 captai","content":null,"pubDate":"2022-08-29 11:52:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220829/thumb-122082900770.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Eye-Opener\": Anushka Sharma On Playing Jhulan Goswami In 'Chakda Xpress'","link":"https://sports.ndtv.com/cricket/eye-opener-what-anushka-sharma-said-on-playing-indian-pace-great-jhulan-goswami-in-chakda-express-3296932","keywords":null,"creator":null,"video_url":null,"description":"Anushka Sharma's upcoming movie 'Chakda Xpress' is inspired by the life of former Indian cricket captain Jhulan Goswami.","content":"Bollywood star Anushka Sharma on Monday said her upcoming movie 'Chakda Xpress' is a special film as it introduced her to the world of women's cricket. Directed by Prosit Roy, the Netflix film is inspired by the life of former Indian cricket captain Jhulan Goswami . During Netflix's Films Day event in Mumbai, the streaming service shared a behind-the-scenes video of the sports drama and a special message from the lead star. In the video message, Sharma said she is in the UK training hard for the movie, in which she plays Goswami. \"Hi, I am Anushka Sharma, currently training at a cricket ground in Leeds in the United Kingdom for a very special film, called 'Chakda Xpress'. I am playing a role inspired by the life and times of the legendary pacer and former Indian captain Jhulan Goswami. \"I was absolutely blown away by the script, it was an eye-opener for me into the world of women's cricket as I am sure it will be for you all as well,\" the 34-year-old actor said. 'Chakda Xpress' traces Goswami's journey as she \"moves up the ladder despite the hindrances posed by misogynistic politics to fulfil her dream of playing cricket for India\". Sharma said she is looking forward to the film's release. \"I am sorry I couldn't be there personally to present this film. But here we are so that we can bring you this soon. I am so excited for you all to watch this amazing story onscreen. \"Now, I have to run quite literally because I am at my practice session but I cannot wait to bring this film to you all on Netflix,\" she said. Promoted 'Chakda Xpress' is produced by Anushka Sharma and her brother Karnesh Ssharma's Clean Slate Filmz. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-08-29 11:43:34","image_url":"https://c.ndtvimg.com/2022-08/rmavqj0o_anushka-sharma-instagram_120x90_29_August_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Opposition leaders slam Jay Shah over 'tricolour video'","link":"https://www.business-standard.com/article/sports/asia-cup-2022-opposition-leaders-slam-jay-shah-over-tricolour-video-122082900720_1.html","keywords":null,"creator":null,"video_url":null,"description":"Video footage of BCCI secretary Jay Shah appearing to turn down an offer to wave the national flag after India beat Pakistan in a thrilling cricket match at the Asia Cup in Dubai on Sunday has sparked a controversy, with Opposition leaders taking a dig at him. However, Shiv Sena's Priyanka Chaturvedi defended Shah in a tweet, saying \"staying neutral as ACC (Asian Cricket Council) president doesn't at any point mean being disrespectful to any nation's flag, especially your own. So trolls, sit down\". Chaturvedi's tweet came minutes after she herself attacked Shah on Twitter, saying the tricolour in hand is a symbol of the resolve and loyalty of Indians to the nation and to \"dismiss it in this way is an insult to the country's 133 crore population\". Several Congress leaders slammed Jay Shah, who is Union Home Minister Amit Shah's son. Tagging the video footage of the Board of Control for Cricket in India (BCCI) appearing to turn down an offer to wave the flag, Congress general secreta","content":"Video footage of BCCI secretary Jay Shah appearing to turn down an offer to wave the national flag after India beat Pakistan in a thrilling cricket match at the Asia Cup in Dubai on Sunday has sparked a controversy, with Opposition leaders taking a dig at him. However, Shiv Sena's Priyanka Chaturvedi defended Shah in a tweet, saying \"staying neutral as ACC (Asian Cricket Council) president doesn't at any point mean being disrespectful to any nation's flag, especially your own. So trolls, sit down\". Chaturvedi's tweet came minutes after she herself attacked Shah on Twitter, saying the tricolour in hand is a symbol of the resolve and loyalty of Indians to the nation and to \"dismiss it in this way is an insult to the country's 133 crore population\". Several Congress leaders slammed Jay Shah, who is Union Home Minister Amit Shah's son. Tagging the video footage of the Board of Control for Cricket in India (BCCI) appearing to turn down an offer to wave the flag, Congress general secretary Jairam Ramesh tweeted in Hindi: \"I have papa, keep the tricolour with you.\" Congress leader Ajoy Kumar also tweeted the footage and wrote in Hindi: \"Looks like the tricolour was of 'Khadi'... not of 'polyester'!\" The Congress has been strongly criticising an amendment of the flag code under which the national flag can now be made of polyester and with the help of machines. Tagging the video, Trinamool Congress (TMC) general secretary Abhishek Banerjee tweeted: \"The prodigal prince knows not of national pride. Jay Shah not wanting to hold the national flag is symptomatic of the larger hypocrisy of the ruling dispensation. They indulge in theatrics, lack values. Excel in jumlas, lack patriotism.\" Commenting on the video, TMC leader Derek O'Brien said: \"Dear Amit Shah, please tell the nation whether this act infuriates you? Whether the act hurts your nationalistic sentiments? Or, will this act be forgiven only because he's your son?\" \"We are not looking for excuses. We are looking for concrete answers. Sincerely, an angry Indian,\" he said. TMC spokesperson Saket Gokhale said the ruling Bharatiya Janata Party (BJP) has argued that Jay Shah did not hold the tricolour on Sunday night because he was there as the ACC president and was following protocol. \"The same BJP hounded former VP Hamid Ansari when he (correctly by protocol) didn't salute the flag during Republic Day parade as he wasn't wearing headgear,\" Gokhale said. Hardik Pandya came up with a special all-round effort as India held their nerves to pull off an exciting five-wicket win over Pakistan in the match. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-08-29 11:17:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220829/thumb-122082900720.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"The anticlimax of the BBL draft Big Bash League Bharat Sundaresan | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiSmh0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1uZXdzLzEyMzY0My90aGUtYW50aWNsaW1heC1vZi10aGUtYmJsLWRyYWZ00gF7aHR0cDovL20uY3JpY2J1enouY29tL2FtcC9jcmlja2V0LW5ld3MvMTIzNjQzL3RoZS1hbnRpY2xpbWF4LW9mLXRoZS1iYmwtZHJhZnQtYmlnLWJhc2gtbGVhZ3VlLWJoYXJhdC1zdW5kYXJlc2FuLWNyaWNidXp6Y29t?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The anticlimax of the BBL draft Big Bash League Bharat Sundaresan | Cricbuzz.com - Cricbuzz  CricbuzzColin de Grandhomme's presence in BBL draft catches NZC by surprise  ESPNcricinfoFull squads: How your club fared on BBL|12 Draft night  cricket.com.auAndre Russell, Kieron Pollard Among Big Names To Miss Out In The First-Ever Big Bash League Draft  Cricket AddictorBBL overseas draft: Livingstone to Renegades, Boult to Stars, du Plessis and Russell unpicked  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-08-29 09:58:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Welcome to the club”: Ross Taylor congratulates Virat Kohli on completing 100 T20I matches for India","link":"https://thesportsrush.com/cricket-news-welcome-to-the-club-ross-taylor-congratulates-virat-kohli-on-completing-100-t20i-matches-for-india/","keywords":["Cricket","Asia Cup 2022","Ross Taylor","Virat Kohli"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ross Taylor welcomes Virat Kohli to the elusive club of playing 100 international matches in all three formats of the game. The Asia Cup 2022 match between India and Pakistan brought up another milestone for former Indian captain Virat Kohli. Kohli became the 2nd Indian batter after Rohit Sharma to complete the milestone of 100… The post “Welcome to the club”: Ross Taylor congratulates Virat Kohli on completing 100 T20I matches for India appeared first on The SportsRush.","content":"Ross Taylor welcomes Virat Kohli to the elusive club of playing 100 international matches in all three formats of the game. The Asia Cup 2022 match between India and Pakistan brought up another milestone for former Indian captain Virat Kohli. Kohli became the 2nd Indian batter after Rohit Sharma to complete the milestone of 100 T20I matches. Virat could not perform that well, but India’s win compensated the same. The Indian bowlers were at their best, and they bundled out Pakistan for just 147 runs where Bhuvneshwar Kumar and Hardik Pandya combined for 7 wickets between them. India lost the wicket of KL Rahul very early, and Kohli got his opportunity in the very first over. ALSO READ: AB de Villiers congratulates Virat Kohli on 100 T20Is Virat had a bit of luck on his side when he was dropped by Fakhar Zaman on his very second delivery, he was at 0 runs at that time. Kohli played some brilliant shots in the innings but never looked that comfortable. He scored 35 runs in 34 balls and got out on the ball of Mohammad Nawaz. Ross Taylor congratulated Virat Kohli on completing 100 T20I games with the Indian cricket team. He said that he is looking forward to watching Virat in many more years to come. “Congratulations Virat Kohli on your 100th T20 game for India. Welcome to the club. I look forward to watching many more of your games in the years to come,” Ross Taylor tweeted. Congratulations @imVkohli on your 100th T20 game for India. Welcome to the club. I look forward to watching many more of your games in the years to come! — Ross Taylor (@RossLTaylor) August 29, 2022 Virat became just the first player from India and just 2nd in the world to complete the milestone of playing 100 matches in all formats of the game. Apart from Virat, only Ross Taylor has achieved this milestone in world cricket. Taylor has represented New Zealand in 112 tests, 236 ODIs and 102 T20Is. Taylor and Kohli have played together in the IPL as Taylor was a part of Royal Challengers Bangalore in the initial three seasons of the IPL. He was bought by the Rajasthan Royals in 2011.","pubDate":"2022-08-29 09:41:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Celeb Education: पढ़ाई के शौकीन नहीं थे हार्दिक पंड्या, बचपन से सिर्फ क्रिकेट में लगता था मन","link":"https://hindi.news18.com/photogallery/education/celeb-education-indian-cricket-team-player-hardik-pandya-educational-qualification-hardik-pandya-biography-4512943.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Celeb Education, Hardik Pandya Education: टीम इंडिया के स्टार ऑलराउंडर हार्दिक पंड्या गुजरात के रहने वाले हैं. उन्होंने काफी कम उम्र से क्रिकेट खेलना शुरू कर दिया था. पहले सिर्फ उनके बड़े भाई क्रुणाल पंड्या ही क्रिकेट खेला करते थे, फिर कोच के कहने पर हार्दिक ने भी अपनी ट्रेनिंग शुरू कर दी थी. क्रिकेट को अपनी ज़िंदगी बनाने के लिए हार्दिक ने स्कूल और पढ़ाई को गुडबाय कह दिया था (Hardik Pandya Biography). जानिए भारतीय क्रिकेट टीम (Indian Cricket Team) के मशहूर खिलाड़ी हार्दिक पंड्या की एजुकेशनल क्वालिफिकेशन (Hardik Pandya Educational Qualification).","content":null,"pubDate":"2022-08-29 09:17:01","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/08/Hardik-Pandya-Educational-Qualification-16617645113x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Match Preview - Afghanistan vs Bangladesh, Asia Cup 2022, 3rd Match, Group B - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMie2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL2FzaWEtY3VwLTIwMjItMTMyNzIzNy9hZmdoYW5pc3Rhbi12cy1iYW5nbGFkZXNoLTNyZC1tYXRjaC1ncm91cC1iLTEzMjcyNzEvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - Afghanistan vs Bangladesh, Asia Cup 2022, 3rd Match, Group B  ESPNcricinfoSL vs AFG Head to Head Records, Sri Lanka's Head-to-Head Record Against Afghanistan– Asia Cup 2022, Match 3  Cricket Addictor‘He eats a lot, has a massive appetite’ – Asghar Afghan’s hilarious revelation about Hazratullah Zazai  CricTrackerShanaka questions batters' preparation after demoralising loss to Afghanistan  ESPNcricinfoBAN vs AFG: Match Preview – Asia Cup 2022, Match 3  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-08-29 09:12:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Hardik is trying to emulate from MS”: Robin Uthappa draws parallel between MS Dhoni and Hardik Pandya after India vs Pakistan Asia Cup 2022 match","link":"https://thesportsrush.com/cricket-news-hardik-is-trying-to-emulate-from-ms-robin-uthappa-draws-parallel-between-ms-dhoni-and-hardik-pandya-after-india-vs-pakistan-asia-cup-2022-match/","keywords":["Cricket","Asia Cup 2022","Hardik Pandya","MS Dhoni"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Robin Uthappa believes that Hardik Pandya is emulating MS Dhoni, and these are great signs for the Indian Cricket Team. After India’s emphatic win over Pakistan in the Asia Cup 2022, all-rounder Hardik Pandya has been gaining a lot of praise from around the world for his terrific performance in the match. He scalped 3… The post “Hardik is trying to emulate from MS”: Robin Uthappa draws parallel between MS Dhoni and Hardik Pandya after India vs Pakistan Asia Cup 2022 match appeared first on The SportsRush.","content":"Robin Uthappa believes that Hardik Pandya is emulating MS Dhoni, and these are great signs for the Indian Cricket Team. After India’s emphatic win over Pakistan in the Asia Cup 2022, all-rounder Hardik Pandya has been gaining a lot of praise from around the world for his terrific performance in the match. He scalped 3 wickets by conceding just 25 runs, whereas he scored 33 runs in 17 balls at a strike-rate of 194.12. Chasing the target of 148 runs, the Indian batting had a mini-collapse in between, but Hardik kept his calm and sealed the game for India. He was awarded the player of the match award for his brilliant performance with both bat and the ball. Hardik Pandya kept his nerves when India needed 6 runs in the last three balls, and smashed a six in the next ball to seal the game for the Indian team. Former Indian batter Robin Uthappa has compared Hardik’s ability with former Indian captain MS Dhoni, who was the most reliable finisher of the Indian team. Uthappa said that Hardis is trying to emulate MS Dhoni as both of them are really good friends, and he has often said that he looks up to MS Dhoni. He also said that if Hardik continues to play like this, he can even play a leadership role in the Indian team in the future. We fought. We fought real hard! And we’ll keep fighting 🇮🇳 pic.twitter.com/7esrZxg74l — hardik pandya (@hardikpandya7) August 28, 2022 “Hardik is trying to emulate from MS because he is someone he really looks up to. You can see that there are things that he is trying to imbibe from him and they are really good friends as well. There is a sense of assuredness in his game that is very Dhoni-esque in that sense, you know?” Uthappa was quoted as saying to ESPNcricinfo. “We can only as Indians that he grows more into this and owns that spot a lot more. I can definitely see him play a leadership role if he continues in the same vein,” he added.","pubDate":"2022-08-29 08:39:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Watch: Shoaib Malik's video featuring injured Shaheen takes internet by storm - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMisAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93YXRjaC1zaG9haWItbWFsaWstcy1oaWxhcmlvdXMtdmlkZW8tZmVhdHVyaW5nLWluanVyZWQtc2hhaGVlbi1hZnJpZGktdGFrZXMtaW50ZXJuZXQtYnktc3Rvcm0td2UtcmUtbWlzc2luZy0xLXBlcnNvbi0xMDE2NjE3NjAwNDIzODcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Shoaib Malik's video featuring injured Shaheen takes internet by storm  Hindustan Times\"Was Actually Touched By The Way They...\": Babar Azam On Team India  NDTV SportsPakistan Have Not Handled Shaheen Shah Afridi Properly – Shahid Afridi Ahead Of India-Pakistan Asia Cup 2022 Game  Cricket AddictorShaheen Afridi Injury: Shaheen Afridi heads to London to complete rehab - Check out  InsideSport'Maine bas thoda masala...': Younis clears air on ‘Big relief for India’ tweet  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-08-29 08:21:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"League series that will boost the growth of Indian sports industry National Sports Day","link":"https://thenewsglory.com/league-series-that-will-boost-the-growth-of-indian-sports-industry-national-sports-day/","keywords":["Sports","Athlete","game","India","National Sports Day","online special","players:"],"creator":["The News Glory"],"video_url":null,"description":"Since 2012, ‘National Sports Day’ has been celebrated in India. On this day, the Government of India is taking steps to recognize the heroes of the field who are bringing pride to India internationally, give them awards and encourage them, and introduce sports-related programs on this special day. In 2018, the announcement of ‘Khelo India’ […]","content":"Since 2012, ‘National Sports Day’ has been celebrated in India. On this day, the Government of India is taking steps to recognize the heroes of the field who are bringing pride to India internationally, give them awards and encourage them, and introduce sports-related programs on this special day. In 2018, the announcement of ‘Khelo India’ was made on this same day. Who is Dayan Chand? – Born on 29 August 1905 in Allahabad, Uttar Pradesh. An incredible player who dominated hockey even when India was under British rule. He helped the Indian hockey team win a hat-trick of gold medals in 1928, 1932 and 1936 Olympics. He practiced hockey under the moonlight at night while serving in the British Army. Hence his original name Dayan Singh has changed to Dayan Chand. The moon is called Chand in Hindi. He played in the Indian hockey team from 1926 to 1949. He played 185 matches for the country and scored 570 goals. National Sports Awards: Major Dayan Chand Khel Ratna (earlier known as Rajiv Gandhi Khel Ratna) Arjuna Award, Dayan Chand Award, Dronacharya Award etc. are awarded to sportspersons on this day. Indian sports on the path to progress: Indian sportspersons are leaving their footprints deep at the global level. Not only hockey and cricket, Indian players and players have achieved success in various sports in the last decade. India has excelled in many sports like Boxing, Fencing, Archery, Volleyball, Wrestling, Women’s Cricket, Badminton, Table Tennis, Weightlifting, Athletics, Judo, Squash, Chess, Swimming, Golf, Lawn Bowls. This is mainly due to the fact that the government has established and developed sports-related infrastructure in the country and launched special projects. Through the ‘Target Olympic Podium’ program, the government is identifying talented athletes and providing them with everything from special training and diet. In this program foreign coaches are hired and the players are given special training. Inspire Institute of Sports (IIS): Not only the efforts of the government but also the efforts of private organizations is a reason for this. Inspire Institute of Sports is one of them. JSW management is running this training center. This is a private training center providing training to athletes in India. It has also been approved by the Sports Development Authority of India. IIS helps athletes in athletics, boxing, judo, swimming and wrestling. Promotional League Series: League series are being conducted for various sports in India for commercial purposes. However, it also helps identify talented players at the grassroots level. League series are conducted in India for sports like Cricket, Football, Kabaddi, Badminton, Table Tennis, Go-Go. It is noteworthy that league series are being conducted at the state level for some of these sports. Through this, the players who have proved their ability are also playing for the country in the international arena. The Government of Tamil Nadu has also announced various announcements related to the sports sector and related schemes. All these have been carried out depending on the development of Indian sports. We hope that through this, India’s flag will fly higher internationally. Today – August 29: National Sports Day","pubDate":"2022-08-29 08:21:06","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"“England are now that benchmark”: Glenn Maxwell aims to use England’s all-rounder heavy approach for World Cup success","link":"https://thesportsrush.com/cricket-news-england-are-now-that-benchmark-glenn-maxwell-aims-to-use-englands-all-rounder-heavy-approach-for-world-cup-success/","keywords":["Cricket","Glenn Maxwell","Zimbabwe tour of Australia 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australian all-rounder Glenn Maxwell has said that he wants Australia to follow England’s template in the 2023 World Cup. The emergence of Cameron Green in the Australian ODI setup has given the side a much-needed balance. Green scalped a fifer in the first ODI against Zimbabwe, whereas his ability to bat at the number 8… The post “England are now that benchmark”: Glenn Maxwell aims to use England’s all-rounder heavy approach for World Cup success appeared first on The SportsRush.","content":"Australian all-rounder Glenn Maxwell has said that he wants Australia to follow England’s template in the 2023 World Cup. The emergence of Cameron Green in the Australian ODI setup has given the side a much-needed balance. Green scalped a fifer in the first ODI against Zimbabwe, whereas his ability to bat at the number 8 position has also increased the batting options of the side. The aim of Australia will be to repeat the heroics of the 2015 World Cup in the next 2023 World Cup. Australia’s approach is clear for the world cup next year that they will rely on their all-rounders as the team will have 8 batting and 7 bowling options in their playing eleven. Glenn Maxwell wishes to repeat England’s template in the 2023 World Cup Australian all-rounder Glenn Maxwell has said that they want to use England’s all-rounder-heavy approach in the upcoming T20 World Cup. In 2019, England won the World Cup by beating New Zealand in the final of the tournament. The main USP of the team was the ability to bat deep. Ben Stokes, Chis Woakes and Moeen Ali were the all-rounders, whereas bowlers like Jofra Archer and Liam Plunkett were well versed with the bat. Australia also wants to use the same template with all-rounders like Mitchell Marsh, Marcus Stoinis, Glenn Maxwell and Cameron Green in playing 11. Glenn Maxwell believes that they want to use the same model of England, and this can give them success as well considering the quality of players they have in their ranks. “We’ve seen the success England have had in the one-day format by batting down to 10 and 11,” Maxwell said. “And having their bowlers as good options with the bat.” “In 2015 we probably set the standard of what a one-day side structure looked like and a lot of teams started to copy.” “England are now that benchmark that we’re sort of working towards.” What a way to win it! Glenn Maxwell was wasting no time #AUSvZIM pic.twitter.com/v2BoaKgTqc — cricket.com.au (@cricketcomau) August 28, 2022 The next ODI World Cup will be in India next year, and considering the number of all-rounders Australia are having in their ranks, they will certainly enjoy on the batting-friendly wickets. The post “England are now that benchmark”: Glenn Maxwell aims to use England’s all-rounder heavy approach for World Cup success appeared first on The SportsRush.","pubDate":"2022-08-29 08:07:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Both Teams Tried To Lose The Game\": Shoaib Akhtar On India-Pakistan Game","link":"https://sports.ndtv.com/cricket/both-teams-tried-to-lose-the-game-shoaib-akhtar-on-india-pakistan-asia-cup-match-3295990","keywords":null,"creator":null,"video_url":null,"description":"Shoaib Akhtar was not impressed by the cricket on display and he went on to say that both India and Pakistan tried to lose the game and it was a \"bad day of cricket\".","content":"India and Pakistan played out a thrilling match on Sunday at the Dubai International Stadium, and it was Rohit Sharma and co that came out on the right side of the result as they defeated their arch-rivals by five wickets in Asia Cup Group A clash. Hardik Pandya was the star of the show as he displayed an all-round performance to help India win the contest. Hardik first took three wickets, and then he played a match-winning knock of 33 runs of just 17 balls to take India over the line with two balls to spare. Former Pakistan pacer Shoaib Akhtar , however, was not impressed by the cricket on display and he went on to say that both teams tried to lose the game and it was a \"bad day of cricket\". \"I want to congratulate both India and Pakistan. Both teams tried to lose the game, India was almost successful in that. India were trying their best to lose the game but Hardik Pandya took them over the line. You only tell me, if Rizwan will score 45 of 45 balls, what to say? There were 19 dot balls in the first six overs when Pakistan were batting. If you play so many dot balls, you will be in trouble,\" Akhtar said on his YouTube channel. \"There was bad selection, both captains Babar Azam and Rohit Sharma made bad selection calls. India dropped Rishabh Pant and Pakistan played Iftikhar Ahmed at No.4. No disrespect to him. I have said so many times that Babar should not open, he should come one down and he anchors the innings. Fakhar and Rizwan should open,\" he stated further. Promoted Further criticising the selection calls made by both teams, Akhtar said: \"Both teams played bad cricket, Pakistan messed up their batting order. Even India sent Ravindra Jadeja at No.4, so you just think how bad the calls were from both sides.\" \"Pakistan then sent Shadab Khan ahead of Asif Ali , so I was not able to understand the thinking of Babar Azam. It is really really bad cricket. Pakistan did not do the calculation for the last over. It was a bad day of cricket. Both teams played poorly. I did not like it one bit, I don't care what others have to say,\" he added.","pubDate":"2022-08-29 07:54:12","image_url":"https://c.ndtvimg.com/2022-08/jsmd9icg_india-pakistan-afp-_625x300_29_August_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Disaster’: Cricket Australia’s $1.7m hell - news.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L2VnZy1vbi10aGVpci1mYWNlLTE3LW1pbGxpb24tZHJhZnQtc251YnMtZXhwb3NlLWJpZy1iYXNoLWxlYWd1ZS1wcm9ibGVtL25ld3Mtc3RvcnkvNzJhZDRlYjhiZmQzOGExNGVhNmQyMjVkYjNlN2Q3YWHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Disaster’: Cricket Australia’s $1.7m hell  news.com.auCricket superstars not selected in Big Bash League's first overseas draft  ABC NewsDraft bolters: The new faces set for maiden BBL stint  cricket.com.auPonting rolls dice in big ‘gamble’ as Scorchers stun with ‘massive’ call: BBL Draft Report Card  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2022-08-29 06:59:14","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"Lot Of Composure In Tight Situation\": Sourav Ganguly Lauds Team India","link":"https://sports.ndtv.com/cricket/lot-of-composure-in-tight-situation-bcci-chief-sourav-ganguly-lauds-team-india-after-win-vs-pakistan-3295800","keywords":null,"creator":null,"video_url":null,"description":"Sourav Ganguly, the President of Board of Control for Cricket in India (BCCI) on Monday congratulated Team India on winning against Pakistan in a Group A clash in the ongoing Asia Cup 2022.","content":"Sourav Ganguly , the President of Board of Control for Cricket in India (BCCI) on Monday congratulated Team India on winning against Pakistan in a Group A clash in the ongoing Asia Cup 2022. Team India led by Rohit Sharma defeated their arch-rivals by five wickets as they chased down 148 with 2 balls to spare. Hardik Pandya was the star of the show as he played an unbeaten knock of 33 off just 17 balls. \"Good result for india to start off..lot of composure in a tight situation .. @bcci @ImRo45 ,\" tweeted Ganguly. Good result for india to start off..lot of composure in a tight situation .. @bcci @ImRo45 Life came full circle for Hardik Pandya at the Dubai International Stadium on Sunday as he went on to play a match-winning knock against Pakistan, the same opponent, against whom he had gotten injured in 2018 during the Asia Cup and was forced to miss almost three years of cricket action. On Sunday, the all-rounder brought his A-game to the middle as he took three wickets before scoring a quickfire 33 to help India defeat Pakistan by five wickets. This knock helped the Rohit Sharma-led side chase down 148 with two balls to spare. In a video shared on the official website of BCCI, Hardik can be seen chatting with Ravindra Jadeja , and he speaks about how he had gotten injured in 2018. \"I was remembering it all. I was stretchered off at the same venue against the same opponent in the 2018 Asia Cup. You feel a sense of achievement because the things that have happened in the past, today I got an opportunity. The journey is beautiful. The fruits of our journey come to us, but behind the scenes, a lot of people do not get credit who walk along with us,\" said Hardik. India were in a spot of bother during their chase of 148, and it was then that Hardik joined hands with Ravindra Jadeja to form a 52-run stand for the fifth wicket. Jadeja perished after scoring 35, but Hardik ensured that the side walks away with a victory. Promoted","pubDate":"2022-08-29 06:48:08","image_url":"https://c.ndtvimg.com/2022-08/vqcguasg_hardik-pandya-afp-_625x300_29_August_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Huge win for Brahmaputra Boys by 10 wickets in the Assam Challengers Trophy","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/huge-win-for-brahmaputra-boys-by-10-wickets-in-the-assam-challengers-trophy-609928","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Brahmaputra Boys thrashed Manas Tiers by 10 wickets in the Assam Challengers Trophy match held at the Amingaon Cricket ground here today. Chasing 116 runs to win","content":"Our Sports Reporter GUWAHATI: Brahmaputra Boys thrashed Manas Tiers by 10 wickets in the Assam Challengers Trophy match held at the Amingaon Cricket ground here today. Chasing 116 runs to win, Brahmaputra reached the target in 10.3 overs without losing a wicket. Pallav Kumar Das scored (66) an unbeaten half century. In the other game of the day Barak Bravehearts defeated Subansiri Champs by 3 wickets. Brief scores: 1st game- Subansiri Champs 106 (19.3 overs), Muktar Hussain 36, Siddhartha Sankar Baruah 3-10, Barak Bravehearts 107-7 (19 overs), Subham Mandal 44. 2nd game: Manas Tigers 115 (19.2 overs), Dibash Hazarika 29, Krishna Das 3-14, Brahmaputra Boys 116-0 (10.3 overs), Pallav Kumar Das 66no, Rishav Das 34 (rtd hurt). Also Read: Brahmaputra Boys, Dihing Patkari Riders win in Assam Challenges Trophy Also Watch: Guwahati Police Seizes 20,000 Bottles of Anrex Cough Syrup, 2 Held","pubDate":"2022-08-29 06:45:51","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/29/380251-brahmaputra-boys.avif","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Team-by-team BBL draft analysis - who had the best night and what were the surprises? - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvdGVhbS1ieS10ZWFtLWJibC1kcmFmdC1hbmFseXNpcy13aG8taGFkLXRoZS1iZXN0LW5pZ2h0LWFuZC13aGF0LXdlcmUtdGhlLXN1cnByaXNlcy0xMzMxMzQ00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Team-by-team BBL draft analysis - who had the best night and what were the surprises?  ESPNcricinfoThe anticlimax of the BBL draft Big Bash League Bharat Sundaresan | Cricbuzz.com - Cricbuzz  CricbuzzAndre Russell, Kieron Pollard Among Big Names To Miss Out In The First-Ever Big Bash League Draft  Cricket AddictorBBL overseas draft: Livingstone to Renegades, Boult to Stars, du Plessis and Russell unpicked  ESPNcricinfoEngland players in demand at Big Bash draft  The CricketerView Full coverage on Google News","content":null,"pubDate":"2022-08-29 06:22:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England player Anderson feat","link":"https://thenewsglory.com/england-player-anderson-feat/","keywords":["Sports","achievement","Anderson","Cricket Bowler","Cricketer","England"],"creator":["The News Glory"],"video_url":null,"description":"England cricketer James Anderson has set a new record by taking 951 wickets in international cricket. In the 2nd Test between England and South Africa in Manchester, England, England won by an innings and 85 runs.","content":"England cricketer James Anderson has set a new record by taking 951 wickets in international cricket. In the 2nd Test between England and South Africa in Manchester, England, England won by an innings and 85 runs.","pubDate":"2022-08-29 06:19:05","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Hope It's Not Long-term...\": India Great Gautam Gambhir On Team Dropping Rishabh Pant Against Pakis.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9hc2lhLWN1cC0yMDIyL2hvcGUtaXRzLW5vdC1sb25nLXRlcm0taW5kaWEtZ3JlYXQtZ2F1dGFtLWdhbWJoaXItb24tdGVhbS1kcm9wcGluZy1yaXNoYWJoLXBhbnQtYWdhaW5zdC1wYWtpc3Rhbi0zMjk1Njgw0gGUAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvaG9wZS1pdHMtbm90LWxvbmctdGVybS1pbmRpYS1ncmVhdC1nYXV0YW0tZ2FtYmhpci1vbi10ZWFtLWRyb3BwaW5nLXJpc2hhYmgtcGFudC1hZ2FpbnN0LXBha2lzdGFuLTMyOTU2ODAvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Hope It's Not Long-term...\": India Great Gautam Gambhir On Team Dropping Rishabh Pant Against Pakis..  NDTV SportsRishabh Pant's 'Evil Smile' Goes Viral as Urvashi Rautela at India-Pakistan Match Sparks Memes  News18Ind vs Pak: Twitter Reacts As Rishabh Pant Misses Out From India's Playing XI  Cricket Addictor'Huge surprise': Gambhir slams Rohit for picking Karthik over Pant, Akram reacts  Hindustan TimesAsia Cup 2022: Former India Wicketkeeper Prefers Rishabh Pant Over Dinesh Karthik in India's XI  News18View Full coverage on Google News","content":null,"pubDate":"2022-08-29 06:09:13","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“We’re in discussions with Colin”: New Zealand cricket board shocked about Colin de Grandhomme’s selection in BBL draft for Adelaide Strikers","link":"https://thesportsrush.com/cricket-news-were-in-discussions-with-colin-new-zealand-cricket-board-shocked-about-colin-de-grandhommes-selection-in-bbl-draft-for-adelaide-strikers/","keywords":["Cricket","Adelaide Strikers","BBL","Colin De Grandhomme"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Adelaide Strikers signed New Zealand all-rounder Colin de Grandhomme in the BBL draft, but his availability is not confirmed. The first-ever International draft of the BBL took place on Sunday and every team selected three overseas players in their squad. Adelaide Strikers retained Rashid Khan, whereas they also signed New Zealand’s all-rounder Colin de Grandhomme… The post “We’re in discussions with Colin”: New Zealand cricket board shocked about Colin de Grandhomme’s selection in BBL draft for Adelaide Strikers appeared first on The SportsRush.","content":"Adelaide Strikers signed New Zealand all-rounder Colin de Grandhomme in the BBL draft, but his availability is not confirmed. The first-ever International draft of the BBL took place on Sunday and every team selected three overseas players in their squad. Adelaide Strikers retained Rashid Khan, whereas they also signed New Zealand’s all-rounder Colin de Grandhomme and English batter Adam Hose. Adelaide Strikers coach Jason Gillespie has said that the availability of the players has played a huge role in deciding his picks in the draft. de Grandhomme was a surprise pick as he was not a part of the draft list initially. He has scored 3817 T20 runs at a strike-rate of 157.92, whereas he has scalped 69 wickets in bowling. ALSO READ: Full squads of all eight BBL teams However, there is a doubt over his availability for the upcoming edition of the Big Bash League. He will require a NOC to participate in the tournament. Colin de Grandhomme’s participation for Adelaide Strikers is in doubt A member of the New Zealand cricket board has said that they are not aware of Colin de Grandhomme’s availability for the Big Bash League. He said that Colin de Grandhomme is a centrally contracted player, and he has still not asked for any kind of release to play in the competition. “As it stands, Colin is a centrally-contracted player and has not requested a release,” an NZC spokesperson told ESPNcricinfo. “We’re now in discussions with Colin to find the best possible way forward.” Colin is on the hunt for a Grand Homme in Adelaide this summer #StrikeShow #BBL12 pic.twitter.com/ztibslssja — Adelaide Strikers (@StrikersBBL) August 28, 2022 de Grandhomme is currently healing from an injury that he suffered during the recent England tour with New Zealand in June. It is interesting that de Grandhomme was not even in the final list of the BBL player’s draft, but according to ESPN Cricinfo, he has give his name at the very last time. The Blackcaps will tour Pakistan in December, and the schedule will collide with the BBL as well. If de Grandhomme gets selected, he will have to go to Pakistan, whereas even if he does not gets selected, he will require a NOC from the board to take part in the competition. The post “We’re in discussions with Colin”: New Zealand cricket board shocked about Colin de Grandhomme’s selection in BBL draft for Adelaide Strikers appeared first on The SportsRush.","pubDate":"2022-08-29 06:02:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Aussie cricket prodigy sparks horror collapse","link":"https://www.themercury.com.au/sport/cricket/australian-prodigy-cameron-green-claims-maiden-fivewicket-haul-in-season-opener-against-zimbabwe/news-story/db004633d009656547fd00a7b14f3055","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian prodigy Cameron Green has claimed his maiden five-wicket haul in international cricket, achieving the feat against Zimbabwe in the first ODI at Riverway Stadium.","content":"The 23-year-old finished with 5/33 from nine overs in Townsville, tearing through Zimbabwe’s lower-order to help roll the visitors for 200 on Sunday.It was also his first five-wicket haul in List A cricket — his previous best was 3/44 against the NSW Blues in September 2017.Watch Australia v Zimbabwe. Every ODI Live & Exclusive to Fox Sports on Kayo. New to Kayo? Start your free trial now >Green had effectively replaced Test captain Pat Cummins in the ODI team for Australia’s season opener in Townsville, joining a plethora of all-rounders in the starting XI.And the West Australian took advantage of the bouncy deck, removing Zimbabwe powerhouse Sikandar Raza for five before steaming through the tail.All five of Green’s wickets were caught in the outfield, with Zimbabwe’s batters hunting for quick runs and struggling to cope with the tall all-rounder’s added pace and bounce.“With Cameron Green, that five wickets he took - yes it was a little game in Townsville against Zimbabwe - but we are seeing the emergence of a tremendously significant player there,” NewsCorp reporter Robert Craddock told SEN Whateley on Monday morning.“He’s just gold, we’ve been looking for an all-rounder for 30 or 40 years like this, he’s good enough to be a specialist bowler and a specialist batsman and they are so rare. They’re the rarest commodity in cricket history.“He has the ability to reshape Australian cricket in his own self-effacing modest, don’t look at me sort of way.”Before the series opener in Queensland, Green had underwhelming career figures of 1/169 in seven one-day internationals.Best ODI bowling figures by an Australian against Zimbabwe5/22 — Brad Williams at Sydney, Jan 20045/32 — Jason Gillespie at Harare, May 20045/33 — Cameron Green at Townsville, Aug 2022“There’s a lot of potential there, we notice it in the change rooms as we watch him go about his business,” Australian teammate Glenn Maxwell said.“You face him at training, you watch him bat … the day before I arrived the boys were talking about how he batted in the centre wicket on a spicy pitch that was doing a bit of everything.“All the rest of the top order said they nicked and nudged it around while he went in there and started smacking them and was pretty brutal on some of our bowlers.“He’s got a lot of potential and a lot of skill — talent — and it helps being six foot ten or whatever he is. He’s enormous, he bowls a heavy ball, bats beautifully and was probably the best move in the field in that XI today.“It’s an exciting package when you look at it, but you don’t want to overburden him right now.“He’s got a lot of cricket ahead of him, we don’t want to burn him out at this stage of his career.”Although Green walked away with a bag of wickets, leg-spinner Adam Zampa was undeniably the pick of the Australian bowlers on Sunday, finishing with 3/57 from his 10 overs.The talented tweaker, who missed the recent white-ball tour of Sri Lanka due to the birth of his first child, dismissed Zimbabwe opener Tadiwanashe Marumani (45 off 61 balls) and No. 3 batter Wessly Madhevere (72 off balls) to stem the flow of runs in the middle overs.Since the start of 2020, Zampa has taken 41 ODI wickets at 23.60 to cement his status as Australia’s best white-ball spinner.After a promising start, Zimbabwe lost 6/15 in a dire collapse at the death to be bowled out in the 48th over.“The wheels fell off at the end,” former Zimbabwe seamer Ed Rainsford confessed on Fox Cricket.Earlier, Australian superstar Steve Smith pulled off a stunning outfield catch to remove Tony Munyonga, diving towards the boundary rope and catching the Kookaburra over his shoulder.","pubDate":"2022-08-29 05:52:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Pandya combines calmness and clarity to be more effective","link":"https://www.channelnewsasia.com/sport/cricket-pandya-combines-calmness-and-clarity-be-more-effective-2906591","keywords":null,"creator":null,"video_url":null,"description":null,"content":"DUBAI : Hardik Pandya's talent was never in doubt and the India all-rounder has now combined a calm mind with an uncluttered approach to emerge as a serious match-winner as he demonstrated in Sunday's Asia Cup thriller against Pakistan. Emotions run high whenever India and Pakistan clash in a cricket match and many a player has buckled under the pressure that accompanies these contests between the arch-rivals. Pandya appeared cut from a different cloth though as he defied the mounting pressure in the closing stages of India's nervy chase and secured victory with a nonchalant six with two balls to spare. The same calmness was evident in his muted celebration when he just did a fist bump with batting partner Dinesh Karthik, who bowed before Pandya. Pandya's 3-25 with the ball and 33 not out off 17 deliveries made him an obvious choice for the man-of-the-match award. \"In all these years I've understood that if I stay as calm as possible, it's going to help me to execute all my plans,\" the 28-year-old said after collecting the prize. \"The 50-50 chances which I take, if I'm calmer, it helps me to pull it off.\" Needing 21 runs from 12 balls, India looked in trouble but Pandya hit three boundaries in the penultimate over from Haris Rauf to ease the pressure. Spinner Mohammad Nawaz dismissed Ravindra Jadeja with the first ball of the final over but Pandya flat-batted the fourth delivery over long-on to give India a winning start to their title defence. Pandya said he was clear about how to accomplish the chase and knew the pressure was heavier on the bowler at that stage. \"The (target in) last over was seven runs, but even if it was 15, I'd have fancied my chances,\" Pandya said. \"I know it's (a matter of) one six, and I feel the bowler is much more under pressure bowling to me in 20th over.\"","pubDate":"2022-08-29 05:45:49","image_url":"https://onecms-res.cloudinary.com/image/upload/s--_tAi2vdV--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2022-08-29t054549z_1_lynxmpei7s050_rtroptp_3_cricket-asiancup-uae.jpg?itok=lUTsi9LV","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"}]}