{"newsArray":[{"article_id":"bd04b8e9a723f4a729791799e9e66d0d","title":"100वां मैच... चौथी सेंचुरी, ग्लेन मैक्सवेल ने यूं पलट दिया मैच","link":"https://hindi.news18.com/cricket/glenn-maxwell-hits-4th-hundred-his-100th-t20-match-equals-rohit-sharma-most-t20i-century-ind-vs-aus-here-are-turning-points-of-this-match-7861507.html","keywords":null,"creator":null,"video_url":null,"description":"ग्लेन मैक्सवेल (Glenn Maxwell) ने भारतीय तेज गेंदबाज प्रसिद्ध कृष्णा (Prasidh Krishna) के आखिरी ओवर की 4 गेंदों पर 18 रन ठोककर ऑस्ट्रेलिया (IND vs AUS) को यादगार जीत दिलाई. उन्होंने टी20 इंटरनेशनल क्रिकेट का अपना चौथा शतक पूरा किया. मैक्सवेल को उनकी शानदार पारी के लिए प्लेयर ऑफ द मैच चुना गया.","content":"ग्लेन मैक्सवेल ने रोहित शर्मा के वर्ल्ड रिकॉर्ड की बराबरी की. (AP) नई दिल्ली. ऑस्ट्र्रेलिया के स्टार ऑलराउंडर ग्लेन मैक्सवेल ने भारत के खिलाफ तीसरे टी20 इंटरनेशनल मैच में बैट से धमाल मचा दिया. मैक्सवेल ने गुवाहाटी टी20 मैच में 47 गेंदों पर शतक जड़कर कई रिकॉर्ड अपने नाम कर लिए. अपने 100वें टी20 इंटरनेशनल मैच में मैक्सवेल ने चौथी सेंचुरी जड़कर रोहित शर्मा के वर्ल्ड रिकॉर्ड की बराबरी कर ली. रोहित के नाम टी20 इंटरनेशनल क्रिकेट में सर्वाधिक शतक जड़ने का विश्व कीर्तिमान था. अब मैक्सवेल और रोहित के टी20 इंटरनेशनल क्रिकेट में एक समान 4-4 सेंचुरी हो गए हैं. मैक्सवेल के नाबाद शतक के दम पर ऑस्ट्रेलिया ने भारत को 5 विकेट से हरा दिया. ऑस्ट्रेलिया (IND vs AUS) को आखिरी 4 गेंदों पर जीत के लिए 16 रन की दरकार थी. भारत की ओर से मैच का आखिरी ओवर तेज गेंदबाज प्रसिद्ध कृष्णा (Prasidh Krishna) लेकर आए. मैक्सवेल ने कृष्णा के ओवर की आखिरी 4 गेंदों पर 6, 4, 4, 4 का स्कोर कर अपनी टीम को यादगार जीत दिला दी. टी20 इंटरनेशनल क्रिकेट में चेज करते हुए सर्वाधिक शतक जड़ने के मामले में मैक्सवेल (Glenn Maxwell) पाकिस्तान के पूर्व कप्तान बाबर आजम से आगे निकल गए हैं. बाबर ने टी20 में रन चेज करते हुए 2 शतक जड़े हैं जबकि मैक्सवेल का यह लक्ष्य का पीछा करते हुए तीसरी सेंचुरी है. IND vs AUS 3rd T20 Highlights: ऋतुराज के शतक पर मैक्सवेल की सेंचुरी भारी, ऑस्ट्रेलिया ने आखिरी गेंद पर दर्ज की जीत, ऑस्ट्रेलिया 20.0 ओवर के बाद 225/5 ऋतुराज गायकवाड़ ने किया वो कमाल जिसे कोहली और रोहित भी नहीं कर पाए, गुवाहाटी में लगाई रिकॉर्ड की झड़ी एरोन फिंच की बराबरी की ग्लेन मैक्सवेल ने टी20 इंटरनेशनल क्रिकेट में सबसे तेज शतक जड़ने के मामले में एरोन फिंच और जोश इंग्लिस की बराबरी कर ली है. फिंच और इंग्लिस टी20 इंटरनेशनल क्रिकेट में ऑस्ट्रेलिया की ओर से सबसे तेज शतक जड़ने वाले बैटर थे. अब मैक्सवेल ने इन दोनों बैटर्स की बराबरी कर ली है. तीनों के नाम एक सामन 47 गेंदों पर शतक जड़ने का रिकॉर्ड है. मैक्सवेल के भारत खिलाफ टी20 में 500 रन पूरे ग्लेन मैक्सवेल ने भारत के खिलाफ टी20 इंटरनेशनल क्रिकेट में अपने रनों की संख्या 554 पर पहुंचा दी है. इस लिस्ट में टॉप पर विंडीज के निकोलस पूरन हैं जिन्होंने अभी तक इंडिया के खिलाफ क्रिकेट के सबसे छोटे फॉर्मेट में 592 रन बनाए हैं. एरोन फिंच 500 रन के साथ तीसरे नंबर पर हैं. मैक्सवेल ने 21 दिन में खेली दूसरी बड़ी पारी ग्लेन मैक्सवेल ने वनडे वर्ल्ड कप 2023 में अफगानिस्तान के खिलाफ रनों का पीछा करते हुए 128 गेंदों पर नाबाद 201 रन की पारी खेलकर अपनी टीम को सेमीफाइनल में प्रवेश दिलाया था वहीं उसके ठीक 21 दिन बाद उन्होंने भारत के खिलाफ टी20 बाइलेटरल सीरीज में 48 गेंदों पर नाबाद 104 रन की पारी खेलकर अपनी टीम को जीत दिलाई. . Tags: Glenn Maxwell , IND vs AUS , India vs Australia आंखों में दिखें 5 संकेत तो समझ जाइए दिल पर हो चुका है हमला, सचेत होने के लिए यही है सटीक समय, ऐसे करें बचाव महाराष्ट्र के 3 डॉक्टर्स, एक्टिंग के लिए छोड़ी नौकरी, थिएटर आंदोलन का बने हिस्सा, अमिताभ जैसे एक्टर्स को देते थे टक्कर महंगा नहीं 4 सस्ती चीजों से लिवर को बनाएं मजबूत, प्रदूषण की गंदगी भी आ जाएगी बाहर, सर्दी में बीमारी से भी रहेंगे दूर","pubDate":"2023-11-29 00:31:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/11/Glenn-Maxwell-8-2023-11-c006d72cdd039adf17d0c87040e37ae7-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"ec236ee27e2192318f8eddbb48ff81e9","title":"Jaiswal, Rinku moving to next level","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/29/jaiswal-rinku-moving-to-next-level-2637168.html","keywords":null,"creator":null,"video_url":null,"description":"Duo making a strong case for themselves to be the first names in the T20I India team sheet CHENNAI: WHILE the needle has moved with respect to India’s 50-over approach, its T20s is still a work in progress. Previous regimes have tended to view it as a shortened ODI and its reflected in some heavy defeats at global events. After Rohit Sharma took over as skipper, he vowed to change the playing style. While his clarion call has resulted in a clear transformation in 50-over cricket, Rohit hasn’t had the same degree of success in the shortest format. In his first years of T20Is, he struck at 139.4 at an average of 32.4. Since he was elevated as skipper, he has been striking at 137.9 while averaging 27.1. Middling numbers. There is a school of thought that Rohit may step aside from this format. One player who will be a more than handy replacement is Yashasvi Jaiswal. Even if Rohit is going to be an option till the World Cup next year, Jaiswal’s name should be pencilled in as one of the two openers. Among openers, the southpaw is the leading light in that he looks to take the game on from the very first ball. One look at his metrics and you can see why. His strike-rate ate (170.49) and balls faced per fours or sixes (3.45) while averaging in excess of 30 is something Indian cricket hasn’t had for a long time. He marries intent with execution and that’s why he’s so successful. “His work ethic is second to none, it’s a boring answer but it’s also the truth,” is how a person who has worked closely with the 21-year-old explained his methods. “He’s a gym rat, all he wants is to keep batting. He maybe a slight guy but he is focused on packing some strength into those forearms. That’s where he gets his power from.” He may have failed in the third T20I against Australia on Tuesday — he came dancing down the track but nicked through to the keeper — but the team management should be pleased with what they have seen thus far. He doesn’t put a value on his wicket so the onus is on taking the game on. This much has been evident even while watching his games for Rajasthan Royals. With Jos Buttler playing in a different role, Jaiswal is the one who has take advantage of the field restriction. That he is a left-hander also helps his cause immensely. Another left-hander who should be a shoo-in in any full strength squad is Rinku Singh. He didn’t get a chance to bat on Tuesday but he has already showed what he can do at the back-end of an innings. His nine-ball 31 at Thiruvananthapuram caught the eye of skipper Suryakumar Yadav. In the first game, he maintained his calm to guide India home. “When I saw Rinku come in to bat in the last game, the composure he showed was brilliant,” Surya said of that innings. “It reminded me of someone (MS Dhoni). Everyone knows the answer.” Tuesday’s accolades, though, was reserved for Ruturaj Gaikwad, one among many who’s trying to rubber-stamp a place in the top-order. His unbeaten 57-ball 123 was laced with 20 hits to the fence, but it was not enough as Glenn Maxwell’s 104 not out took Australia across the line. Brief scores: India 222/3 in 20 ovs (Gaikwad 123 n.o, Suryakumar 39, Tilak 31 n.o) lost to Australia 225/5 in 20 ovs (Maxwell 104 n.o, Head 35; Bishnoi 2/32).","content":"CHENNAI: WHILE the needle has moved with respect to India’s 50-over approach, its T20s is still a work in progress. Previous regimes have tended to view it as a shortened ODI and its reflected in some heavy defeats at global events. After Rohit Sharma took over as skipper, he vowed to change the playing style. While his clarion call has resulted in a clear transformation in 50-over cricket, Rohit hasn’t had the same degree of success in the shortest format. In his first years of T20Is, he struck at 139.4 at an average of 32.4. Since he was elevated as skipper, he has been striking at 137.9 while averaging 27.1. Middling numbers. There is a school of thought that Rohit may step aside from this format. One player who will be a more than handy replacement is Yashasvi Jaiswal. Even if Rohit is going to be an option till the World Cup next year, Jaiswal’s name should be pencilled in as one of the two openers. Among openers, the southpaw is the leading light in that he looks to take the game on from the very first ball. One look at his metrics and you can see why. His strike-rate ate (170.49) and balls faced per fours or sixes (3.45) while averaging in excess of 30 is something Indian cricket hasn’t had for a long time. He marries intent with execution and that’s why he’s so successful. “His work ethic is second to none, it’s a boring answer but it’s also the truth,” is how a person who has worked closely with the 21-year-old explained his methods. “He’s a gym rat, all he wants is to keep batting. He maybe a slight guy but he is focused on packing some strength into those forearms. That’s where he gets his power from.” He may have failed in the third T20I against Australia on Tuesday — he came dancing down the track but nicked through to the keeper — but the team management should be pleased with what they have seen thus far. He doesn’t put a value on his wicket so the onus is on taking the game on. This much has been evident even while watching his games for Rajasthan Royals. With Jos Buttler playing in a different role, Jaiswal is the one who has take advantage of the field restriction. That he is a left-hander also helps his cause immensely. Another left-hander who should be a shoo-in in any full strength squad is Rinku Singh. He didn’t get a chance to bat on Tuesday but he has already showed what he can do at the back-end of an innings. His nine-ball 31 at Thiruvananthapuram caught the eye of skipper Suryakumar Yadav. In the first game, he maintained his calm to guide India home. “When I saw Rinku come in to bat in the last game, the composure he showed was brilliant,” Surya said of that innings. “It reminded me of someone (MS Dhoni). Everyone knows the answer.” Tuesday’s accolades, though, was reserved for Ruturaj Gaikwad, one among many who’s trying to rubber-stamp a place in the top-order. His unbeaten 57-ball 123 was laced with 20 hits to the fence, but it was not enough as Glenn Maxwell’s 104 not out took Australia across the line. : India 222/3 in 20 ovs (Gaikwad 123 n.o, Suryakumar 39, Tilak 31 n.o) lost to Australia 225/5 in 20 ovs (Maxwell 104 n.o, Head 35; Bishnoi 2/32).","pubDate":"2023-11-29 00:24:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/11/29/original/Jaiswal1.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2cc2f7716418f36a78a78302aeb24af0","title":"New Sports Minister Harin pledges to revive cricket, tackle corruption","link":"https://www.ft.lk/sports/New-Sports-Minister-Harin-pledges-to-revive-cricket--tackle-corruption/23-755735","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The newly appointed Minister of Sports, Harin Fernando, committed yesterday to revive Sri Lanka Cricket and implement necessary legal measures to eliminate corruption from the sport. Speaking to the media after assuming duties in his new post, Fernando invited all stakeholders to collaborate in achieving this goal. “This responsibility is crucial because the sport is a cherished aspect of our lives. Simultaneously, certain practices need to be followed when making these changes to the regulations,” he remarked. Fernando, who also serves as the Minister of Tourism, was appointed as the Minister of Sports on Monday by President Ranil Wickremesinghe. This decision followed the dismissal of the former Minister Roshan Ranasinghe. Fernando has previously held the position of Minister of Sports in 2018. Fernando acknowledged the challenges confronting Sri Lanka Cricket and referenced his previous tenure in the same role, where the sport faced serious issues related to corruption. Despite those challenges, he asserted his successful navigation of the organisation through those difficulties, highlighting his proven track record. “I am no stranger to challenges,” Minister Fernando said, expressing his preparedness to address the issues affecting Sri Lanka Cricket. He invited all stakeholders in cricket administration to join forces with him, emphasising the significance of unity and collective efforts in restoring the sport to its former glory. The Minister expressed his intention not to go against anyone and emphasised his desire to ‘clean up’ the sport of cricket, seeking collaboration from all, including former World Cup-winning Sri Lankan skipper Arjuna Ranatunga. He acknowledged the public’s expectation for the restoration of cricket in Sri Lanka, focusing on overturning the suspension imposed by the International Cricket Council (ICC). Highlighting the significance of swiftly reversing the ICC ban, he stressed the importance of accomplishing this within a few days.","pubDate":"2023-11-29 00:22:12","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ee0a70b29a7887073322838638cd4545","title":"Court case against interim committee postponed by a week","link":"https://www.ft.lk/sports/Court-case-against-interim-committee-postponed-by-a-week/23-755734","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Court of Appeal has decided to take up for hearing on 5 December, the motion seeking to revoke the stay order issued against the Interim Committee appointed for Sri Lanka Cricket (SLC). Taking up for consideration the motion yesterday, the court also informed the newly appointed Sports Minister, Harin Fernando to present his status on the matter on the fixed date. The case has been moved to a new panel of judges of the Court of Appeal after a total of three judges had earlier refused themselves from hearing the motion. In November, the Court of Appeal issued a stay order against the Gazette issued by Roshan Ranasinghe, in his capacity as the Sports Minister, on the appointment of an interim committee for Sri Lanka Cricket (SLC) headed by former cricketer Arjuna Ranatunga. The court issued the order suspending for 14 days the functions of the SLC interim committee after taking up for hearing a petition filed by SLC President Shammi Silva challenging the Gazette notification. A motion was later filed by Roshan Ranasinghe to revoke the stay order that was issued against the Interim Committee appointed by him for Sri Lanka Cricket.","pubDate":"2023-11-29 00:20:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"26550fe84aef38a50f9e28e95237ef35","title":"Alyssa Healy admits to reaching boiling point with Mitchell Starc after 2015 Cricket World Cup","link":"https://7news.com.au/sport/cricket/alyssa-healy-admits-to-reaching-boiling-point-with-mitchell-starc-after-2015-cricket-world-cup-c-12719852","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"‘This is it, I’m done, I don’t want to see him any more.’","content":"Australian captain Alyssa Healy has admitted she was on the brink of breaking up with her now husband, Aussie bowler Mitchell Starc, after he spearheaded his team’s triumph. Starc and Healy, both already greats of Australian cricket while still having years left in their respective careers, have formed a power couple of the highest order since they started dating in 2010 before their eventual marriage in 2016. Healy is one of Australia’s greatest ever keeper-batters, having scored 5500 international runs from 248 matches including six tons to go with 226 dismissals behind the stumps, while Starc has taken the fifth most wickets in Australian men’s Test history. The tearaway left-armer is also renowned as one of Australia’s greatest ever white-ball bowlers, especially at World Cups, where he has taken the third most wickets in the history of the men’s game, just six behind all-time leader Glenn McGrath despite playing 11 fewer games. And he was at the peak of his powers during the 2015 World Cup in Australia, winning player of the tournament honours to lead his side to a fifth world title in the one-day format. The 2015 World Cup final is also best remembered for Starc knocking New Zealand skipper Brendon McCullum’s stumps out of the ground in the first over of the match in front of almost 100,000 screaming Aussie fans at the MCG. After the famous win, the Aussie players let loose on a week of partying and celebrations, as Starc admitted on the Separate Bathrooms podcast. “We finished the 2015 World Cup and may have been on the ‘cordials’ for a week,” he said with a smile in his voice. But Starc also had other things on the horizon too, having booked a holiday with Healy, as he explained, where he had planned to ask his longtime girlfriend to be his wife. “We’d booked a little getaway to Hayman Island. It was April, so it was both of our time off from cricket, I had a couple of weeks before I had to jet over to India for the IPL, so we went away and I had these grand plans of (proposing there),” he said. Lucky he made it to the holiday too, because, speaking alongside Starc on the same podcast, Healy conceded she almost reached boiling point with their relationship during his week-long bender. “He was lucky, because by the fifth day on the beers with the boys after they finally won a World Cup — when we won about eight (women’s titles) before them — and on about the fifth night he was out, I thought, ‘This is it, I’m done, I don’t want to see him any more’,” she said. “And then next minute, we were going on a holiday that weekend (so) I was like, ‘I’ll give him one more chance, I suppose’. “But I was more grumpy at him because he didn’t tell me where he was going (the day before the holiday). He was like, ‘I’ve just got to go do some stuff this afternoon’. I was like, ‘Alright, well we’ve got to do this, we’ve got to do that’, and I didn’t hear from him for ages. I was like, ‘What is he doing? We’re going tomorrow’. “Low and behold, he’d driven all the way up to the central coast to ask my dad if it was OK that he ask me to marry him, and drove back. “So, by the time he got back, I was in some sort of a hell of a mood. And then looking back on it, I’m like, ‘He’s done really well to do that and then come back with me being grumpy and still want to propose’.” Healy detailed how serious that crossroads moment was, but it hasn’t been their only one. Although some have been more trivial than others. “We started watching Billions or something like that together. And we were like, ‘Oh, we’re at home. Let’s watch it together. This will be great’,” Healy went on. “Anyway, I went out, I reckon I went to hockey training or something and came home and there’s Mitch on the couch watching it without me. And I’ve never felt so betrayed in my life. “I think I literally said ‘I wished that I walked in and there was another woman here because I actually think this is so much worse’,” she joked. But they managed to get over that hurdle as well. “We’ve sort of put that aside. I was a little bit nervous to go there again, I thought, ‘You know what, I’m not going through this all over again’,” Healy said. “But we are. When we’re at home, we tend to watch similar sort of shows of an evening but we don’t watch Netflix or anything like that together, that’s for touring — touring life. We leave all that for tours and then we compare notes later.” Starc added: “We did get past it; we ended up watching The Last of Us together on tour, so we’ve gotten past it, we’ve made amends.” The pair first met as nine-year-old teammates in junior cricket where, for a period of time, they would share the wicketkeeping gloves before Starc grew in height and took up bowling. They describe their relationship as having started out as being “close mates” before realising their love for each other, which has since endured, despite rarely being home together while they play cricket on opposite sides of the globe throughout the year. “We’re lucky nowadays we have phones, right?” Healy said of how they cope with the separation. “We have the ability to FaceTime or WhatsApp or call one another basically any time of the day. And time zones don’t exactly help us all the time, especially when you know, I’m playing in one part of the world and he’s playing in the other, you end up missing one another, sort of halfway through the day. “But for us, it’s just keeping it really simple. I mean, we chat about the important things, what’s going on in our lives and then making sure that we’re supporting one another at the same time. I think that’s really important. “And we’re in touch every day. We don’t like call one another every day or FaceTime one another every day, but we still talk about the important things and I think that’s sort of what works and it makes the moments when you’re together, which is quite rare throughout the year, even more special. “You get to spend the time together but you still know what’s going on in the other person’s life. So I think it kind of makes it easy and it makes it more seamless I think.”","pubDate":"2023-11-29 00:19:10","image_url":"https://images.7news.com.au/publication/C-12719852/cf7a6bf109ef2a33233be2b38882bc9d38472dfb-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"9a4fb7add3df64e39e9dd1720be40cd9","title":"Athapaththu finishes off WBBL on a high for Sydney Thunder","link":"https://www.ft.lk/sports/Athapaththu-finishes-off-WBBL-on-a-high-for-Sydney-Thunder/23-755733","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Chamari Athapaththu Sri Lanka’s women’s team cricket captain Chamari Athapaththu ended her stint with Sydney Thunder in the Women’s Big Bash League (WBBL) on a high. By the time her Sydney Thunder side bowed out in Tuesday’s Eliminator, she was the tournament’s leading scorer with 552 runs at an average of 42.46 and strike rate of 127.18. She also had nine wickets at 27.22 and an economy rate of 6.83, including 3 for 20 with her off-spin in her opening match against cross-town rivals Sydney Sixers. Her 41 off 40 balls was her side’s best by far as Thunder exited with a 44-run defeat at the hands of Brisbane Heat and Athapaththu went into that match as Player of the Tournament. After being brought somewhat belatedly into the WBBL, again as an overseas replacement, Athapaththu has torn up the competition with her unique scoring ability. Initially overlooked in the overseas draft for the current WBBL, she was snapped up by Thunder as cover for the existing overseas contingent of Marizanne Kapp, Heather Knight and Lauren Bell. With Knight as captain, it took an illness to No.1 draft pick Kapp to make way for Athapaththu initially. Bell played just twice for Thunder and was recalled by England ahead of their upcoming tour of India, by which time Athapaththu had made herself indispensable. She scored five fifties in the tournament this year and crashed 18 sixes, third behind Grace Harris and Sophie Devine. In doing so, she helped Thunder to a vastly improved performance after they recorded just one win last season. The knock-on effect so far has been another deal, Athapaththu signing for Northern Brave, with whom she will link up for New Zealand’s Super Smash late next month. With the auction for the 2024 WPL due to take place on 9 December, she could be taking another significant step in her franchise career before long.","pubDate":"2023-11-29 00:15:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"71a0da84d7410e2f9d9f31d9a552bfd1","title":"Prima Under-15 Super League final","link":"https://www.ft.lk/sports/Prima-Under-15-Super-League-final/23-755732","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Led by Royal College’s Thevindu Wewelwala the unbeaten Colombo South outfit, are in a strong position to win the Prima Under-15 Super League Cricket Tournament when they take on Colombo North, led by Wesley College player Lithum Senuja at the Mercantile Cricket Association (MCA) ground today, 29 November. Half of the Colombo South outfit is from Royal College who looked poised to pull it off. Meanwhile Colombo North got two players each from Joes and Isipathana, is the dark horse of the tournament. With the weather conditions settling down fast, a good game of cricket plus future national youth stars could be identified from this grand finale today. The unbeaten Colombo South won all their four matches accumulating 11 points while the second placed Colombo North ended with seven points. Galle narrowly missed out the final by collecting only six points from their four games. Though much was expected from Kandy, they too were below their usual standards being inconsistent ending on 4th place with four points while Dambulla did not trouble the scorers at all as they did not earn any points. The leading nutrition company Prima is sponsoring this event for a record 16th year in tandem.","pubDate":"2023-11-29 00:10:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"spanish"},{"article_id":"af6a160325c7929f9a8870df0dd3d1f1","title":"Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying!","link":"https://www.dailymail.co.uk/sport/cricket/article-12801731/Will-Jacks-leading-Englands-reset-failing-central-contract-injury-flying.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Will Jacks speaks in a manner befitting the new breed of no fear batsmen charged with leading England out of their post-World Cup funk and into another explosive white-ball era.","content":"Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying! All-rounder Will Jacks is hoping to cement his England place in the Caribbean His incredible hitting brought him England debuts in all three formats last winter And he is challenging to open the batting in England's 50-over and T20 reset By Paul Newman for the Daily Mail Published: 17:30 EST, 28 November 2023 | Updated: 19:07 EST, 28 November 2023 e-mail View comments Will Jacks speaks in a manner befitting the new breed of no fear batsmen charged with leading England out of their post-World Cup funk and into another explosive white-ball era. 'I've never had a problem playing with freedom so the way the game has gone in the last few years is brilliant,' says a man challenging to open the batting in England's 50-over and T20 reset in the Caribbean starting this weekend. 'You can't think about getting caught on the boundary because if you did you'd start taking the safe option and this attitude is about winning games. 'It's the way you have to approach the game if you want to play for England and it suits me. If the game's there to win and you have to take risks you just have to do it because, if you get out, who cares? It's the risk and reward of the game these days.' It is a mind-set demonstrated when Jacks was caught on the boundary on 94 in one of his early one-day international appearances against Ireland at Trent Bridge last summer — he insists he has no regrets about missing out on a first England hundred —and one that has been integral to his attitude throughout his rise as a very modern batter. All-rounder Will Jacks (above) is hoping to cement his England place in the Caribbean Jacks showed his off-spin prowess by taking six wickets on Test debut against Pakistan Jacks announced himself with an extraordinary hundred off just 25 balls for Surrey against Lancashire in a T10 pre-season friendly in Dubai in 2019 and made the first century in the Hundred, off just 48 balls, for Oval Invincibles last year. His incredible hitting brought him debuts in all three formats for England last winter, and he showed his off-spin prowess by taking six wickets on Test debut against Pakistan in Rawalpindi. But his progress was checked by a hip injury earlier this year that was diagnosed as being a direct consequence of the amount of flying he does in pursuing his multi-format career and, having just turned 25, he journeys to the Caribbean needing a restart just as much as England. 'I'm really excited,' Jacks tells Mail Sport during a rare spell at home in London. 'I've been around a bit and been involved in a lot of squads without breaking through and been a mainstay of the teams but I'm experienced enough now and hopefully ready to take that next step. Is this a new era? Maybe yes, maybe no, but there will be new people there for the start of a 50-over World Cup cycle and a good mix of youth and experience.' He might have made that breakthrough before now, and provided a much-needed spark to England's World Cup capitulation in India, had he not been injured after rushing from the Test squad in New Zealand to the 50-over side in Bangladesh in late February. 'It was a tendon injury which is incredibly rare for a cricketer, especially a batsman, so what it came down to was a pure tiredness injury,' says Jacks. 'I'd had 40 flights last winter and my body was at its limit. Something had to give. So I learnt my lessons about recovery and I have to look after myself going forward. It's the before and after flying, the stretching, going in the pool and eating well. 'It was pretty disappointing. There would have been more opportunities in Bangladesh and, you never know, that might have helped me push my case more for the World Cup just gone. Then I missed the IPL. So, it was a setback but I like to think I bounced back and had a good summer and I'll use that to learn some lessons about travelling and looking after my body.' Now Jacks will be competing with Test openers Zak Crawley and Ben Duckett for his preferred spot at the top of the order in the new 50-over team while looking to prove he is one of the openers to launch their defence of the world T20 title back in the Caribbean in June. 'I've opened my whole career pretty much and that's where I've had my success, made my name and where all my good numbers have come so I'd love to go up there.' There is one potential cloud on the horizon. Jacks, surprisingly for a batter who epitomises the all-out aggressive approach England want to regain in white-ball cricket, was not among the 29 players awarded central contracts. The three-time County Championship winner with Surrey insists he is still committed to red-ball cricket, but he is not guaranteed to say yes should England want him to boost their depleted spin ranks on the five-Test tour of India starting in January. Jacks will compete with Zak Crawley and Ben Duckett (above) for a spot at the top of the order Jacks has signed up for a second season at the SA20, where he hit a competition-best 19 sixes last year, and makes it clear his priority is earning that place in England's T20 World Cup squad. 'I was very hopeful of getting a central contract but there are a lot of talented cricketers out there and I can understand why I didn't get one,' he insists. 'There are numerous fast bowlers and they want to look after them with injury worries. 'It was disappointing but it does give me freedom. There are a lot of franchises and while nobody likes to talk about it there can be a lot of money involved and it's a short career. Everything comes into play. The World Cup is a massive one so playing T20 cricket is really important to me at the moment. The way the game and the world is at the moment definitely suits me. I was always a kid who enjoyed whacking it.' And his ability to whack it will be crucial to England White-Ball Cricket 2.0. Share or comment on this article: Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying! e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-29 00:07:34","image_url":"https://i.dailymail.co.uk/1s/2023/11/28/20/78341599-0-image-a-43_1701202356687.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d5caeb0b0403d194d9f563d94899e301","title":"Percy: The Unusual Brand","link":"http://island.lk/percy-the-unusual-brand/","keywords":["Sports","Percy Abeysekara","Percy at the Murali Harmony Cup Cricket Tournament in the North"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Kushil Gunasekera If any student growing up wants to learn how to create a brand of your own, what Percy did can be an example, not necessarily replicating what he did which is his own unique benchmark- a hard act to follow. The point I’m trying to make is that one should not be […]","content":"If any student growing up wants to learn how to create a brand of your own, what Percy did can be an example, not necessarily replicating what he did which is his own unique benchmark- a hard act to follow. The point I’m trying to make is that one should not be afraid to establish one’s identity following their passion, but do it the way he did- relentlessly, which eventually became a global one-man-brand that is most extraordinary. It is time that we recognize such a personality, the one-man Sri Lankan flag bearer who has not only entertained all of us, but that he established long lasting friendships with internationally renowned cricketers whom we saw sending messages of condolence that had touched their heart with his unforgettable, witty, demonstrative art of engaging which others dare not even attempt. I have known that anyone can copy someone’s work or style, but definitely not the passion to pursue what one enjoys the most. He truly epitomized an unwavering and positive spirit- a remarkable character that lifted up the mood of the spectators- victory or defeat, and his presence on the field lit it up, like giving a heads up even when the odds were against us. There is no Sri Lankan, as one man, that I know of who has been waving the flag countless times even on a daily basis during a five day Test match, to showcase and highlight the colourful lion symbol of our country with pride which itself could really be a record worthy of the Guinness Book, having done what he did for at least 45 years- a hugely praiseworthy feat that should not go unnoticed, and matchless. We all know what he did to boost, enhance and motivate not only the fans but the National Team during this long period of association at every given opportunity but standing tall, rain or shine, covering -again hard to count- the many miles, walking at the venues which itself is another record-breaking effort that he did tirelessly. As someone who was acquainted with Percy for 44 years, since 1979, I have had the unique opportunity to see a different side of his passion for cricket- one that has been closely tied with bringing people and communities together in unity and harmony during the Murali Cup held in the North post-conflict for five consecutive years 2012 – 2016 where he played a pivotal role towards building reconciliation and goodwill through building bridges of friendship. People eagerly awaited his arrival at each venue where he would circle the grounds like no other which is phenomenal, notwithstanding the hot and humid climatic conditions even at his age- a rare gift of the ‘never-give-up’ attitude. In fact, when I told him in lighter vein that Sir Ian Botham was knighted for walking thousands of miles for charity, Percy responded promptly in his usual inimitable and hilarious manner that he has walked more miles across all of the grounds worldwide, “but not even a good night for me” which is typical of the man- never short of quick witted rhymes, such a statement can only come from him and no other. We salute and applaud his courageous life, to do what he did and just like any famous cricketer is recognized in this country there was no place that he wasn’t recognized either, even in the North, having had that experience of going along with him which was always an interesting journey, to be accorded a right-royal welcome even at boutiques on the way side with a free cup of ginger tea for his contribution, even by the villagers. His personality, a lively and vibrant character, cannot be erased from the Sri Lanka cricket arena that will be historically ingrained in the minds of cricket fans who will not see again another stadium ambassador for the spirit of cricket. May his good deeds benefit his Sansaric journey!","pubDate":"2023-11-29 00:00:12","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"49756c63115bee794c4fa9f3b27debb9","title":"Cricket watchers escape the sun at country club grateful for support","link":"https://www.bordermail.com.au/story/8439500/kiewa-cricket-clubs-retractable-awnings-add-to-spectator-comfort/?src=rss","keywords":null,"creator":["Janet Howie"],"video_url":null,"description":"More shade means more comfort under new retractable awnings.","content":"A day at the cricket is now far more pleasant for supporters of a North East country club. has installed new motorised retractable awnings to its rooms and Chairperson Annie Heffernan said the awnings extended the verandah over a grassed area where it was nice to sit but often was in full sunshine. \"So it allows a lot more people to sit in shade and be more comfortable while watching the cricket and it cools down the facility as well,\" she said. \"They're retractable, so there's more flexibility there.\" Mrs Heffernan said the club was \"extremely grateful\" for the sponsorship that made the $20,000 project possible. Saputo Dairy Australia, which contributed $10,000 through its legacy program, WAW and Indigo Shire provided funding. SDA's Kiewa site manager and head of operations Simon Cauchi said the awning installation marked the 11 project in Australia of the Saputo Legacy Program, which aimed to improve local sport and health facilities. \"The Kiewa Cricket Club is just one kilometre from our Kiewa processing facility, and we are pleased to support the ongoing safety, comfort and social needs of the club's members, players and spectators,\" he said. \"Delivering this project aligns with our ongoing promise to make meaningful contributions to local communities in the regions where our employees and farmers live and work. Kiewa Cricket Club will officially open its new clubrooms on Saturday, December 2, with people invited to watch the A grade team take on Dederang and stay for the festivities afterwards. There will be a barbecue tea and drinks at bar prices. RSVP is requested for catering purposes. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-11-29 00:00:00","image_url":"https://www.bordermail.com.au/images/transform/v1/crop/frm/zVtrQGhRGBmiD3RNa8bKgt/6b9bc8a7-213b-4e73-b8b4-f67c85cad00e.jpg/r0_363_5787_3623_w600_h338_fmax.jpg","source_id":"bordermail","source_priority":2185061,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"bd04b8e9a723f4a729791799e9e66d0d","title":"100वां मैच... चौथी सेंचुरी, ग्लेन मैक्सवेल ने यूं पलट दिया मैच","link":"https://hindi.news18.com/cricket/glenn-maxwell-hits-4th-hundred-his-100th-t20-match-equals-rohit-sharma-most-t20i-century-ind-vs-aus-here-are-turning-points-of-this-match-7861507.html","keywords":null,"creator":null,"video_url":null,"description":"ग्लेन मैक्सवेल (Glenn Maxwell) ने भारतीय तेज गेंदबाज प्रसिद्ध कृष्णा (Prasidh Krishna) के आखिरी ओवर की 4 गेंदों पर 18 रन ठोककर ऑस्ट्रेलिया (IND vs AUS) को यादगार जीत दिलाई. उन्होंने टी20 इंटरनेशनल क्रिकेट का अपना चौथा शतक पूरा किया. मैक्सवेल को उनकी शानदार पारी के लिए प्लेयर ऑफ द मैच चुना गया.","content":"ग्लेन मैक्सवेल ने रोहित शर्मा के वर्ल्ड रिकॉर्ड की बराबरी की. (AP) नई दिल्ली. ऑस्ट्र्रेलिया के स्टार ऑलराउंडर ग्लेन मैक्सवेल ने भारत के खिलाफ तीसरे टी20 इंटरनेशनल मैच में बैट से धमाल मचा दिया. मैक्सवेल ने गुवाहाटी टी20 मैच में 47 गेंदों पर शतक जड़कर कई रिकॉर्ड अपने नाम कर लिए. अपने 100वें टी20 इंटरनेशनल मैच में मैक्सवेल ने चौथी सेंचुरी जड़कर रोहित शर्मा के वर्ल्ड रिकॉर्ड की बराबरी कर ली. रोहित के नाम टी20 इंटरनेशनल क्रिकेट में सर्वाधिक शतक जड़ने का विश्व कीर्तिमान था. अब मैक्सवेल और रोहित के टी20 इंटरनेशनल क्रिकेट में एक समान 4-4 सेंचुरी हो गए हैं. मैक्सवेल के नाबाद शतक के दम पर ऑस्ट्रेलिया ने भारत को 5 विकेट से हरा दिया. ऑस्ट्रेलिया (IND vs AUS) को आखिरी 4 गेंदों पर जीत के लिए 16 रन की दरकार थी. भारत की ओर से मैच का आखिरी ओवर तेज गेंदबाज प्रसिद्ध कृष्णा (Prasidh Krishna) लेकर आए. मैक्सवेल ने कृष्णा के ओवर की आखिरी 4 गेंदों पर 6, 4, 4, 4 का स्कोर कर अपनी टीम को यादगार जीत दिला दी. टी20 इंटरनेशनल क्रिकेट में चेज करते हुए सर्वाधिक शतक जड़ने के मामले में मैक्सवेल (Glenn Maxwell) पाकिस्तान के पूर्व कप्तान बाबर आजम से आगे निकल गए हैं. बाबर ने टी20 में रन चेज करते हुए 2 शतक जड़े हैं जबकि मैक्सवेल का यह लक्ष्य का पीछा करते हुए तीसरी सेंचुरी है. IND vs AUS 3rd T20 Highlights: ऋतुराज के शतक पर मैक्सवेल की सेंचुरी भारी, ऑस्ट्रेलिया ने आखिरी गेंद पर दर्ज की जीत, ऑस्ट्रेलिया 20.0 ओवर के बाद 225/5 ऋतुराज गायकवाड़ ने किया वो कमाल जिसे कोहली और रोहित भी नहीं कर पाए, गुवाहाटी में लगाई रिकॉर्ड की झड़ी एरोन फिंच की बराबरी की ग्लेन मैक्सवेल ने टी20 इंटरनेशनल क्रिकेट में सबसे तेज शतक जड़ने के मामले में एरोन फिंच और जोश इंग्लिस की बराबरी कर ली है. फिंच और इंग्लिस टी20 इंटरनेशनल क्रिकेट में ऑस्ट्रेलिया की ओर से सबसे तेज शतक जड़ने वाले बैटर थे. अब मैक्सवेल ने इन दोनों बैटर्स की बराबरी कर ली है. तीनों के नाम एक सामन 47 गेंदों पर शतक जड़ने का रिकॉर्ड है. मैक्सवेल के भारत खिलाफ टी20 में 500 रन पूरे ग्लेन मैक्सवेल ने भारत के खिलाफ टी20 इंटरनेशनल क्रिकेट में अपने रनों की संख्या 554 पर पहुंचा दी है. इस लिस्ट में टॉप पर विंडीज के निकोलस पूरन हैं जिन्होंने अभी तक इंडिया के खिलाफ क्रिकेट के सबसे छोटे फॉर्मेट में 592 रन बनाए हैं. एरोन फिंच 500 रन के साथ तीसरे नंबर पर हैं. मैक्सवेल ने 21 दिन में खेली दूसरी बड़ी पारी ग्लेन मैक्सवेल ने वनडे वर्ल्ड कप 2023 में अफगानिस्तान के खिलाफ रनों का पीछा करते हुए 128 गेंदों पर नाबाद 201 रन की पारी खेलकर अपनी टीम को सेमीफाइनल में प्रवेश दिलाया था वहीं उसके ठीक 21 दिन बाद उन्होंने भारत के खिलाफ टी20 बाइलेटरल सीरीज में 48 गेंदों पर नाबाद 104 रन की पारी खेलकर अपनी टीम को जीत दिलाई. . Tags: Glenn Maxwell , IND vs AUS , India vs Australia आंखों में दिखें 5 संकेत तो समझ जाइए दिल पर हो चुका है हमला, सचेत होने के लिए यही है सटीक समय, ऐसे करें बचाव महाराष्ट्र के 3 डॉक्टर्स, एक्टिंग के लिए छोड़ी नौकरी, थिएटर आंदोलन का बने हिस्सा, अमिताभ जैसे एक्टर्स को देते थे टक्कर महंगा नहीं 4 सस्ती चीजों से लिवर को बनाएं मजबूत, प्रदूषण की गंदगी भी आ जाएगी बाहर, सर्दी में बीमारी से भी रहेंगे दूर","pubDate":"2023-11-29 00:31:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/11/Glenn-Maxwell-8-2023-11-c006d72cdd039adf17d0c87040e37ae7-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"ec236ee27e2192318f8eddbb48ff81e9","title":"Jaiswal, Rinku moving to next level","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/29/jaiswal-rinku-moving-to-next-level-2637168.html","keywords":null,"creator":null,"video_url":null,"description":"Duo making a strong case for themselves to be the first names in the T20I India team sheet CHENNAI: WHILE the needle has moved with respect to India’s 50-over approach, its T20s is still a work in progress. Previous regimes have tended to view it as a shortened ODI and its reflected in some heavy defeats at global events. After Rohit Sharma took over as skipper, he vowed to change the playing style. While his clarion call has resulted in a clear transformation in 50-over cricket, Rohit hasn’t had the same degree of success in the shortest format. In his first years of T20Is, he struck at 139.4 at an average of 32.4. Since he was elevated as skipper, he has been striking at 137.9 while averaging 27.1. Middling numbers. There is a school of thought that Rohit may step aside from this format. One player who will be a more than handy replacement is Yashasvi Jaiswal. Even if Rohit is going to be an option till the World Cup next year, Jaiswal’s name should be pencilled in as one of the two openers. Among openers, the southpaw is the leading light in that he looks to take the game on from the very first ball. One look at his metrics and you can see why. His strike-rate ate (170.49) and balls faced per fours or sixes (3.45) while averaging in excess of 30 is something Indian cricket hasn’t had for a long time. He marries intent with execution and that’s why he’s so successful. “His work ethic is second to none, it’s a boring answer but it’s also the truth,” is how a person who has worked closely with the 21-year-old explained his methods. “He’s a gym rat, all he wants is to keep batting. He maybe a slight guy but he is focused on packing some strength into those forearms. That’s where he gets his power from.” He may have failed in the third T20I against Australia on Tuesday — he came dancing down the track but nicked through to the keeper — but the team management should be pleased with what they have seen thus far. He doesn’t put a value on his wicket so the onus is on taking the game on. This much has been evident even while watching his games for Rajasthan Royals. With Jos Buttler playing in a different role, Jaiswal is the one who has take advantage of the field restriction. That he is a left-hander also helps his cause immensely. Another left-hander who should be a shoo-in in any full strength squad is Rinku Singh. He didn’t get a chance to bat on Tuesday but he has already showed what he can do at the back-end of an innings. His nine-ball 31 at Thiruvananthapuram caught the eye of skipper Suryakumar Yadav. In the first game, he maintained his calm to guide India home. “When I saw Rinku come in to bat in the last game, the composure he showed was brilliant,” Surya said of that innings. “It reminded me of someone (MS Dhoni). Everyone knows the answer.” Tuesday’s accolades, though, was reserved for Ruturaj Gaikwad, one among many who’s trying to rubber-stamp a place in the top-order. His unbeaten 57-ball 123 was laced with 20 hits to the fence, but it was not enough as Glenn Maxwell’s 104 not out took Australia across the line. Brief scores: India 222/3 in 20 ovs (Gaikwad 123 n.o, Suryakumar 39, Tilak 31 n.o) lost to Australia 225/5 in 20 ovs (Maxwell 104 n.o, Head 35; Bishnoi 2/32).","content":"CHENNAI: WHILE the needle has moved with respect to India’s 50-over approach, its T20s is still a work in progress. Previous regimes have tended to view it as a shortened ODI and its reflected in some heavy defeats at global events. After Rohit Sharma took over as skipper, he vowed to change the playing style. While his clarion call has resulted in a clear transformation in 50-over cricket, Rohit hasn’t had the same degree of success in the shortest format. In his first years of T20Is, he struck at 139.4 at an average of 32.4. Since he was elevated as skipper, he has been striking at 137.9 while averaging 27.1. Middling numbers. There is a school of thought that Rohit may step aside from this format. One player who will be a more than handy replacement is Yashasvi Jaiswal. Even if Rohit is going to be an option till the World Cup next year, Jaiswal’s name should be pencilled in as one of the two openers. Among openers, the southpaw is the leading light in that he looks to take the game on from the very first ball. One look at his metrics and you can see why. His strike-rate ate (170.49) and balls faced per fours or sixes (3.45) while averaging in excess of 30 is something Indian cricket hasn’t had for a long time. He marries intent with execution and that’s why he’s so successful. “His work ethic is second to none, it’s a boring answer but it’s also the truth,” is how a person who has worked closely with the 21-year-old explained his methods. “He’s a gym rat, all he wants is to keep batting. He maybe a slight guy but he is focused on packing some strength into those forearms. That’s where he gets his power from.” He may have failed in the third T20I against Australia on Tuesday — he came dancing down the track but nicked through to the keeper — but the team management should be pleased with what they have seen thus far. He doesn’t put a value on his wicket so the onus is on taking the game on. This much has been evident even while watching his games for Rajasthan Royals. With Jos Buttler playing in a different role, Jaiswal is the one who has take advantage of the field restriction. That he is a left-hander also helps his cause immensely. Another left-hander who should be a shoo-in in any full strength squad is Rinku Singh. He didn’t get a chance to bat on Tuesday but he has already showed what he can do at the back-end of an innings. His nine-ball 31 at Thiruvananthapuram caught the eye of skipper Suryakumar Yadav. In the first game, he maintained his calm to guide India home. “When I saw Rinku come in to bat in the last game, the composure he showed was brilliant,” Surya said of that innings. “It reminded me of someone (MS Dhoni). Everyone knows the answer.” Tuesday’s accolades, though, was reserved for Ruturaj Gaikwad, one among many who’s trying to rubber-stamp a place in the top-order. His unbeaten 57-ball 123 was laced with 20 hits to the fence, but it was not enough as Glenn Maxwell’s 104 not out took Australia across the line. : India 222/3 in 20 ovs (Gaikwad 123 n.o, Suryakumar 39, Tilak 31 n.o) lost to Australia 225/5 in 20 ovs (Maxwell 104 n.o, Head 35; Bishnoi 2/32).","pubDate":"2023-11-29 00:24:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/11/29/original/Jaiswal1.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2cc2f7716418f36a78a78302aeb24af0","title":"New Sports Minister Harin pledges to revive cricket, tackle corruption","link":"https://www.ft.lk/sports/New-Sports-Minister-Harin-pledges-to-revive-cricket--tackle-corruption/23-755735","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The newly appointed Minister of Sports, Harin Fernando, committed yesterday to revive Sri Lanka Cricket and implement necessary legal measures to eliminate corruption from the sport. Speaking to the media after assuming duties in his new post, Fernando invited all stakeholders to collaborate in achieving this goal. “This responsibility is crucial because the sport is a cherished aspect of our lives. Simultaneously, certain practices need to be followed when making these changes to the regulations,” he remarked. Fernando, who also serves as the Minister of Tourism, was appointed as the Minister of Sports on Monday by President Ranil Wickremesinghe. This decision followed the dismissal of the former Minister Roshan Ranasinghe. Fernando has previously held the position of Minister of Sports in 2018. Fernando acknowledged the challenges confronting Sri Lanka Cricket and referenced his previous tenure in the same role, where the sport faced serious issues related to corruption. Despite those challenges, he asserted his successful navigation of the organisation through those difficulties, highlighting his proven track record. “I am no stranger to challenges,” Minister Fernando said, expressing his preparedness to address the issues affecting Sri Lanka Cricket. He invited all stakeholders in cricket administration to join forces with him, emphasising the significance of unity and collective efforts in restoring the sport to its former glory. The Minister expressed his intention not to go against anyone and emphasised his desire to ‘clean up’ the sport of cricket, seeking collaboration from all, including former World Cup-winning Sri Lankan skipper Arjuna Ranatunga. He acknowledged the public’s expectation for the restoration of cricket in Sri Lanka, focusing on overturning the suspension imposed by the International Cricket Council (ICC). Highlighting the significance of swiftly reversing the ICC ban, he stressed the importance of accomplishing this within a few days.","pubDate":"2023-11-29 00:22:12","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ee0a70b29a7887073322838638cd4545","title":"Court case against interim committee postponed by a week","link":"https://www.ft.lk/sports/Court-case-against-interim-committee-postponed-by-a-week/23-755734","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Court of Appeal has decided to take up for hearing on 5 December, the motion seeking to revoke the stay order issued against the Interim Committee appointed for Sri Lanka Cricket (SLC). Taking up for consideration the motion yesterday, the court also informed the newly appointed Sports Minister, Harin Fernando to present his status on the matter on the fixed date. The case has been moved to a new panel of judges of the Court of Appeal after a total of three judges had earlier refused themselves from hearing the motion. In November, the Court of Appeal issued a stay order against the Gazette issued by Roshan Ranasinghe, in his capacity as the Sports Minister, on the appointment of an interim committee for Sri Lanka Cricket (SLC) headed by former cricketer Arjuna Ranatunga. The court issued the order suspending for 14 days the functions of the SLC interim committee after taking up for hearing a petition filed by SLC President Shammi Silva challenging the Gazette notification. A motion was later filed by Roshan Ranasinghe to revoke the stay order that was issued against the Interim Committee appointed by him for Sri Lanka Cricket.","pubDate":"2023-11-29 00:20:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"26550fe84aef38a50f9e28e95237ef35","title":"Alyssa Healy admits to reaching boiling point with Mitchell Starc after 2015 Cricket World Cup","link":"https://7news.com.au/sport/cricket/alyssa-healy-admits-to-reaching-boiling-point-with-mitchell-starc-after-2015-cricket-world-cup-c-12719852","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"‘This is it, I’m done, I don’t want to see him any more.’","content":"Australian captain Alyssa Healy has admitted she was on the brink of breaking up with her now husband, Aussie bowler Mitchell Starc, after he spearheaded his team’s triumph. Starc and Healy, both already greats of Australian cricket while still having years left in their respective careers, have formed a power couple of the highest order since they started dating in 2010 before their eventual marriage in 2016. Healy is one of Australia’s greatest ever keeper-batters, having scored 5500 international runs from 248 matches including six tons to go with 226 dismissals behind the stumps, while Starc has taken the fifth most wickets in Australian men’s Test history. The tearaway left-armer is also renowned as one of Australia’s greatest ever white-ball bowlers, especially at World Cups, where he has taken the third most wickets in the history of the men’s game, just six behind all-time leader Glenn McGrath despite playing 11 fewer games. And he was at the peak of his powers during the 2015 World Cup in Australia, winning player of the tournament honours to lead his side to a fifth world title in the one-day format. The 2015 World Cup final is also best remembered for Starc knocking New Zealand skipper Brendon McCullum’s stumps out of the ground in the first over of the match in front of almost 100,000 screaming Aussie fans at the MCG. After the famous win, the Aussie players let loose on a week of partying and celebrations, as Starc admitted on the Separate Bathrooms podcast. “We finished the 2015 World Cup and may have been on the ‘cordials’ for a week,” he said with a smile in his voice. But Starc also had other things on the horizon too, having booked a holiday with Healy, as he explained, where he had planned to ask his longtime girlfriend to be his wife. “We’d booked a little getaway to Hayman Island. It was April, so it was both of our time off from cricket, I had a couple of weeks before I had to jet over to India for the IPL, so we went away and I had these grand plans of (proposing there),” he said. Lucky he made it to the holiday too, because, speaking alongside Starc on the same podcast, Healy conceded she almost reached boiling point with their relationship during his week-long bender. “He was lucky, because by the fifth day on the beers with the boys after they finally won a World Cup — when we won about eight (women’s titles) before them — and on about the fifth night he was out, I thought, ‘This is it, I’m done, I don’t want to see him any more’,” she said. “And then next minute, we were going on a holiday that weekend (so) I was like, ‘I’ll give him one more chance, I suppose’. “But I was more grumpy at him because he didn’t tell me where he was going (the day before the holiday). He was like, ‘I’ve just got to go do some stuff this afternoon’. I was like, ‘Alright, well we’ve got to do this, we’ve got to do that’, and I didn’t hear from him for ages. I was like, ‘What is he doing? We’re going tomorrow’. “Low and behold, he’d driven all the way up to the central coast to ask my dad if it was OK that he ask me to marry him, and drove back. “So, by the time he got back, I was in some sort of a hell of a mood. And then looking back on it, I’m like, ‘He’s done really well to do that and then come back with me being grumpy and still want to propose’.” Healy detailed how serious that crossroads moment was, but it hasn’t been their only one. Although some have been more trivial than others. “We started watching Billions or something like that together. And we were like, ‘Oh, we’re at home. Let’s watch it together. This will be great’,” Healy went on. “Anyway, I went out, I reckon I went to hockey training or something and came home and there’s Mitch on the couch watching it without me. And I’ve never felt so betrayed in my life. “I think I literally said ‘I wished that I walked in and there was another woman here because I actually think this is so much worse’,” she joked. But they managed to get over that hurdle as well. “We’ve sort of put that aside. I was a little bit nervous to go there again, I thought, ‘You know what, I’m not going through this all over again’,” Healy said. “But we are. When we’re at home, we tend to watch similar sort of shows of an evening but we don’t watch Netflix or anything like that together, that’s for touring — touring life. We leave all that for tours and then we compare notes later.” Starc added: “We did get past it; we ended up watching The Last of Us together on tour, so we’ve gotten past it, we’ve made amends.” The pair first met as nine-year-old teammates in junior cricket where, for a period of time, they would share the wicketkeeping gloves before Starc grew in height and took up bowling. They describe their relationship as having started out as being “close mates” before realising their love for each other, which has since endured, despite rarely being home together while they play cricket on opposite sides of the globe throughout the year. “We’re lucky nowadays we have phones, right?” Healy said of how they cope with the separation. “We have the ability to FaceTime or WhatsApp or call one another basically any time of the day. And time zones don’t exactly help us all the time, especially when you know, I’m playing in one part of the world and he’s playing in the other, you end up missing one another, sort of halfway through the day. “But for us, it’s just keeping it really simple. I mean, we chat about the important things, what’s going on in our lives and then making sure that we’re supporting one another at the same time. I think that’s really important. “And we’re in touch every day. We don’t like call one another every day or FaceTime one another every day, but we still talk about the important things and I think that’s sort of what works and it makes the moments when you’re together, which is quite rare throughout the year, even more special. “You get to spend the time together but you still know what’s going on in the other person’s life. So I think it kind of makes it easy and it makes it more seamless I think.”","pubDate":"2023-11-29 00:19:10","image_url":"https://images.7news.com.au/publication/C-12719852/cf7a6bf109ef2a33233be2b38882bc9d38472dfb-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"9a4fb7add3df64e39e9dd1720be40cd9","title":"Athapaththu finishes off WBBL on a high for Sydney Thunder","link":"https://www.ft.lk/sports/Athapaththu-finishes-off-WBBL-on-a-high-for-Sydney-Thunder/23-755733","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Chamari Athapaththu Sri Lanka’s women’s team cricket captain Chamari Athapaththu ended her stint with Sydney Thunder in the Women’s Big Bash League (WBBL) on a high. By the time her Sydney Thunder side bowed out in Tuesday’s Eliminator, she was the tournament’s leading scorer with 552 runs at an average of 42.46 and strike rate of 127.18. She also had nine wickets at 27.22 and an economy rate of 6.83, including 3 for 20 with her off-spin in her opening match against cross-town rivals Sydney Sixers. Her 41 off 40 balls was her side’s best by far as Thunder exited with a 44-run defeat at the hands of Brisbane Heat and Athapaththu went into that match as Player of the Tournament. After being brought somewhat belatedly into the WBBL, again as an overseas replacement, Athapaththu has torn up the competition with her unique scoring ability. Initially overlooked in the overseas draft for the current WBBL, she was snapped up by Thunder as cover for the existing overseas contingent of Marizanne Kapp, Heather Knight and Lauren Bell. With Knight as captain, it took an illness to No.1 draft pick Kapp to make way for Athapaththu initially. Bell played just twice for Thunder and was recalled by England ahead of their upcoming tour of India, by which time Athapaththu had made herself indispensable. She scored five fifties in the tournament this year and crashed 18 sixes, third behind Grace Harris and Sophie Devine. In doing so, she helped Thunder to a vastly improved performance after they recorded just one win last season. The knock-on effect so far has been another deal, Athapaththu signing for Northern Brave, with whom she will link up for New Zealand’s Super Smash late next month. With the auction for the 2024 WPL due to take place on 9 December, she could be taking another significant step in her franchise career before long.","pubDate":"2023-11-29 00:15:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"71a0da84d7410e2f9d9f31d9a552bfd1","title":"Prima Under-15 Super League final","link":"https://www.ft.lk/sports/Prima-Under-15-Super-League-final/23-755732","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Led by Royal College’s Thevindu Wewelwala the unbeaten Colombo South outfit, are in a strong position to win the Prima Under-15 Super League Cricket Tournament when they take on Colombo North, led by Wesley College player Lithum Senuja at the Mercantile Cricket Association (MCA) ground today, 29 November. Half of the Colombo South outfit is from Royal College who looked poised to pull it off. Meanwhile Colombo North got two players each from Joes and Isipathana, is the dark horse of the tournament. With the weather conditions settling down fast, a good game of cricket plus future national youth stars could be identified from this grand finale today. The unbeaten Colombo South won all their four matches accumulating 11 points while the second placed Colombo North ended with seven points. Galle narrowly missed out the final by collecting only six points from their four games. Though much was expected from Kandy, they too were below their usual standards being inconsistent ending on 4th place with four points while Dambulla did not trouble the scorers at all as they did not earn any points. The leading nutrition company Prima is sponsoring this event for a record 16th year in tandem.","pubDate":"2023-11-29 00:10:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"spanish"},{"article_id":"af6a160325c7929f9a8870df0dd3d1f1","title":"Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying!","link":"https://www.dailymail.co.uk/sport/cricket/article-12801731/Will-Jacks-leading-Englands-reset-failing-central-contract-injury-flying.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Will Jacks speaks in a manner befitting the new breed of no fear batsmen charged with leading England out of their post-World Cup funk and into another explosive white-ball era.","content":"Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying! All-rounder Will Jacks is hoping to cement his England place in the Caribbean His incredible hitting brought him England debuts in all three formats last winter And he is challenging to open the batting in England's 50-over and T20 reset By Paul Newman for the Daily Mail Published: 17:30 EST, 28 November 2023 | Updated: 19:07 EST, 28 November 2023 e-mail View comments Will Jacks speaks in a manner befitting the new breed of no fear batsmen charged with leading England out of their post-World Cup funk and into another explosive white-ball era. 'I've never had a problem playing with freedom so the way the game has gone in the last few years is brilliant,' says a man challenging to open the batting in England's 50-over and T20 reset in the Caribbean starting this weekend. 'You can't think about getting caught on the boundary because if you did you'd start taking the safe option and this attitude is about winning games. 'It's the way you have to approach the game if you want to play for England and it suits me. If the game's there to win and you have to take risks you just have to do it because, if you get out, who cares? It's the risk and reward of the game these days.' It is a mind-set demonstrated when Jacks was caught on the boundary on 94 in one of his early one-day international appearances against Ireland at Trent Bridge last summer — he insists he has no regrets about missing out on a first England hundred —and one that has been integral to his attitude throughout his rise as a very modern batter. All-rounder Will Jacks (above) is hoping to cement his England place in the Caribbean Jacks showed his off-spin prowess by taking six wickets on Test debut against Pakistan Jacks announced himself with an extraordinary hundred off just 25 balls for Surrey against Lancashire in a T10 pre-season friendly in Dubai in 2019 and made the first century in the Hundred, off just 48 balls, for Oval Invincibles last year. His incredible hitting brought him debuts in all three formats for England last winter, and he showed his off-spin prowess by taking six wickets on Test debut against Pakistan in Rawalpindi. But his progress was checked by a hip injury earlier this year that was diagnosed as being a direct consequence of the amount of flying he does in pursuing his multi-format career and, having just turned 25, he journeys to the Caribbean needing a restart just as much as England. 'I'm really excited,' Jacks tells Mail Sport during a rare spell at home in London. 'I've been around a bit and been involved in a lot of squads without breaking through and been a mainstay of the teams but I'm experienced enough now and hopefully ready to take that next step. Is this a new era? Maybe yes, maybe no, but there will be new people there for the start of a 50-over World Cup cycle and a good mix of youth and experience.' He might have made that breakthrough before now, and provided a much-needed spark to England's World Cup capitulation in India, had he not been injured after rushing from the Test squad in New Zealand to the 50-over side in Bangladesh in late February. 'It was a tendon injury which is incredibly rare for a cricketer, especially a batsman, so what it came down to was a pure tiredness injury,' says Jacks. 'I'd had 40 flights last winter and my body was at its limit. Something had to give. So I learnt my lessons about recovery and I have to look after myself going forward. It's the before and after flying, the stretching, going in the pool and eating well. 'It was pretty disappointing. There would have been more opportunities in Bangladesh and, you never know, that might have helped me push my case more for the World Cup just gone. Then I missed the IPL. So, it was a setback but I like to think I bounced back and had a good summer and I'll use that to learn some lessons about travelling and looking after my body.' Now Jacks will be competing with Test openers Zak Crawley and Ben Duckett for his preferred spot at the top of the order in the new 50-over team while looking to prove he is one of the openers to launch their defence of the world T20 title back in the Caribbean in June. 'I've opened my whole career pretty much and that's where I've had my success, made my name and where all my good numbers have come so I'd love to go up there.' There is one potential cloud on the horizon. Jacks, surprisingly for a batter who epitomises the all-out aggressive approach England want to regain in white-ball cricket, was not among the 29 players awarded central contracts. The three-time County Championship winner with Surrey insists he is still committed to red-ball cricket, but he is not guaranteed to say yes should England want him to boost their depleted spin ranks on the five-Test tour of India starting in January. Jacks will compete with Zak Crawley and Ben Duckett (above) for a spot at the top of the order Jacks has signed up for a second season at the SA20, where he hit a competition-best 19 sixes last year, and makes it clear his priority is earning that place in England's T20 World Cup squad. 'I was very hopeful of getting a central contract but there are a lot of talented cricketers out there and I can understand why I didn't get one,' he insists. 'There are numerous fast bowlers and they want to look after them with injury worries. 'It was disappointing but it does give me freedom. There are a lot of franchises and while nobody likes to talk about it there can be a lot of money involved and it's a short career. Everything comes into play. The World Cup is a massive one so playing T20 cricket is really important to me at the moment. The way the game and the world is at the moment definitely suits me. I was always a kid who enjoyed whacking it.' And his ability to whack it will be crucial to England White-Ball Cricket 2.0. Share or comment on this article: Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying! e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-29 00:07:34","image_url":"https://i.dailymail.co.uk/1s/2023/11/28/20/78341599-0-image-a-43_1701202356687.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d5caeb0b0403d194d9f563d94899e301","title":"Percy: The Unusual Brand","link":"http://island.lk/percy-the-unusual-brand/","keywords":["Sports","Percy Abeysekara","Percy at the Murali Harmony Cup Cricket Tournament in the North"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Kushil Gunasekera If any student growing up wants to learn how to create a brand of your own, what Percy did can be an example, not necessarily replicating what he did which is his own unique benchmark- a hard act to follow. The point I’m trying to make is that one should not be […]","content":"If any student growing up wants to learn how to create a brand of your own, what Percy did can be an example, not necessarily replicating what he did which is his own unique benchmark- a hard act to follow. The point I’m trying to make is that one should not be afraid to establish one’s identity following their passion, but do it the way he did- relentlessly, which eventually became a global one-man-brand that is most extraordinary. It is time that we recognize such a personality, the one-man Sri Lankan flag bearer who has not only entertained all of us, but that he established long lasting friendships with internationally renowned cricketers whom we saw sending messages of condolence that had touched their heart with his unforgettable, witty, demonstrative art of engaging which others dare not even attempt. I have known that anyone can copy someone’s work or style, but definitely not the passion to pursue what one enjoys the most. He truly epitomized an unwavering and positive spirit- a remarkable character that lifted up the mood of the spectators- victory or defeat, and his presence on the field lit it up, like giving a heads up even when the odds were against us. There is no Sri Lankan, as one man, that I know of who has been waving the flag countless times even on a daily basis during a five day Test match, to showcase and highlight the colourful lion symbol of our country with pride which itself could really be a record worthy of the Guinness Book, having done what he did for at least 45 years- a hugely praiseworthy feat that should not go unnoticed, and matchless. We all know what he did to boost, enhance and motivate not only the fans but the National Team during this long period of association at every given opportunity but standing tall, rain or shine, covering -again hard to count- the many miles, walking at the venues which itself is another record-breaking effort that he did tirelessly. As someone who was acquainted with Percy for 44 years, since 1979, I have had the unique opportunity to see a different side of his passion for cricket- one that has been closely tied with bringing people and communities together in unity and harmony during the Murali Cup held in the North post-conflict for five consecutive years 2012 – 2016 where he played a pivotal role towards building reconciliation and goodwill through building bridges of friendship. People eagerly awaited his arrival at each venue where he would circle the grounds like no other which is phenomenal, notwithstanding the hot and humid climatic conditions even at his age- a rare gift of the ‘never-give-up’ attitude. In fact, when I told him in lighter vein that Sir Ian Botham was knighted for walking thousands of miles for charity, Percy responded promptly in his usual inimitable and hilarious manner that he has walked more miles across all of the grounds worldwide, “but not even a good night for me” which is typical of the man- never short of quick witted rhymes, such a statement can only come from him and no other. We salute and applaud his courageous life, to do what he did and just like any famous cricketer is recognized in this country there was no place that he wasn’t recognized either, even in the North, having had that experience of going along with him which was always an interesting journey, to be accorded a right-royal welcome even at boutiques on the way side with a free cup of ginger tea for his contribution, even by the villagers. His personality, a lively and vibrant character, cannot be erased from the Sri Lanka cricket arena that will be historically ingrained in the minds of cricket fans who will not see again another stadium ambassador for the spirit of cricket. May his good deeds benefit his Sansaric journey!","pubDate":"2023-11-29 00:00:12","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"49756c63115bee794c4fa9f3b27debb9","title":"Cricket watchers escape the sun at country club grateful for support","link":"https://www.bordermail.com.au/story/8439500/kiewa-cricket-clubs-retractable-awnings-add-to-spectator-comfort/?src=rss","keywords":null,"creator":["Janet Howie"],"video_url":null,"description":"More shade means more comfort under new retractable awnings.","content":"A day at the cricket is now far more pleasant for supporters of a North East country club. has installed new motorised retractable awnings to its rooms and Chairperson Annie Heffernan said the awnings extended the verandah over a grassed area where it was nice to sit but often was in full sunshine. \"So it allows a lot more people to sit in shade and be more comfortable while watching the cricket and it cools down the facility as well,\" she said. \"They're retractable, so there's more flexibility there.\" Mrs Heffernan said the club was \"extremely grateful\" for the sponsorship that made the $20,000 project possible. Saputo Dairy Australia, which contributed $10,000 through its legacy program, WAW and Indigo Shire provided funding. SDA's Kiewa site manager and head of operations Simon Cauchi said the awning installation marked the 11 project in Australia of the Saputo Legacy Program, which aimed to improve local sport and health facilities. \"The Kiewa Cricket Club is just one kilometre from our Kiewa processing facility, and we are pleased to support the ongoing safety, comfort and social needs of the club's members, players and spectators,\" he said. \"Delivering this project aligns with our ongoing promise to make meaningful contributions to local communities in the regions where our employees and farmers live and work. Kiewa Cricket Club will officially open its new clubrooms on Saturday, December 2, with people invited to watch the A grade team take on Dederang and stay for the festivities afterwards. There will be a barbecue tea and drinks at bar prices. RSVP is requested for catering purposes. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-11-29 00:00:00","image_url":"https://www.bordermail.com.au/images/transform/v1/crop/frm/zVtrQGhRGBmiD3RNa8bKgt/6b9bc8a7-213b-4e73-b8b4-f67c85cad00e.jpg/r0_363_5787_3623_w600_h338_fmax.jpg","source_id":"bordermail","source_priority":2185061,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"bd04b8e9a723f4a729791799e9e66d0d","title":"100वां मैच... चौथी सेंचुरी, ग्लेन मैक्सवेल ने यूं पलट दिया मैच","link":"https://hindi.news18.com/cricket/glenn-maxwell-hits-4th-hundred-his-100th-t20-match-equals-rohit-sharma-most-t20i-century-ind-vs-aus-here-are-turning-points-of-this-match-7861507.html","keywords":null,"creator":null,"video_url":null,"description":"ग्लेन मैक्सवेल (Glenn Maxwell) ने भारतीय तेज गेंदबाज प्रसिद्ध कृष्णा (Prasidh Krishna) के आखिरी ओवर की 4 गेंदों पर 18 रन ठोककर ऑस्ट्रेलिया (IND vs AUS) को यादगार जीत दिलाई. उन्होंने टी20 इंटरनेशनल क्रिकेट का अपना चौथा शतक पूरा किया. मैक्सवेल को उनकी शानदार पारी के लिए प्लेयर ऑफ द मैच चुना गया.","content":"ग्लेन मैक्सवेल ने रोहित शर्मा के वर्ल्ड रिकॉर्ड की बराबरी की. (AP) नई दिल्ली. ऑस्ट्र्रेलिया के स्टार ऑलराउंडर ग्लेन मैक्सवेल ने भारत के खिलाफ तीसरे टी20 इंटरनेशनल मैच में बैट से धमाल मचा दिया. मैक्सवेल ने गुवाहाटी टी20 मैच में 47 गेंदों पर शतक जड़कर कई रिकॉर्ड अपने नाम कर लिए. अपने 100वें टी20 इंटरनेशनल मैच में मैक्सवेल ने चौथी सेंचुरी जड़कर रोहित शर्मा के वर्ल्ड रिकॉर्ड की बराबरी कर ली. रोहित के नाम टी20 इंटरनेशनल क्रिकेट में सर्वाधिक शतक जड़ने का विश्व कीर्तिमान था. अब मैक्सवेल और रोहित के टी20 इंटरनेशनल क्रिकेट में एक समान 4-4 सेंचुरी हो गए हैं. मैक्सवेल के नाबाद शतक के दम पर ऑस्ट्रेलिया ने भारत को 5 विकेट से हरा दिया. ऑस्ट्रेलिया (IND vs AUS) को आखिरी 4 गेंदों पर जीत के लिए 16 रन की दरकार थी. भारत की ओर से मैच का आखिरी ओवर तेज गेंदबाज प्रसिद्ध कृष्णा (Prasidh Krishna) लेकर आए. मैक्सवेल ने कृष्णा के ओवर की आखिरी 4 गेंदों पर 6, 4, 4, 4 का स्कोर कर अपनी टीम को यादगार जीत दिला दी. टी20 इंटरनेशनल क्रिकेट में चेज करते हुए सर्वाधिक शतक जड़ने के मामले में मैक्सवेल (Glenn Maxwell) पाकिस्तान के पूर्व कप्तान बाबर आजम से आगे निकल गए हैं. बाबर ने टी20 में रन चेज करते हुए 2 शतक जड़े हैं जबकि मैक्सवेल का यह लक्ष्य का पीछा करते हुए तीसरी सेंचुरी है. IND vs AUS 3rd T20 Highlights: ऋतुराज के शतक पर मैक्सवेल की सेंचुरी भारी, ऑस्ट्रेलिया ने आखिरी गेंद पर दर्ज की जीत, ऑस्ट्रेलिया 20.0 ओवर के बाद 225/5 ऋतुराज गायकवाड़ ने किया वो कमाल जिसे कोहली और रोहित भी नहीं कर पाए, गुवाहाटी में लगाई रिकॉर्ड की झड़ी एरोन फिंच की बराबरी की ग्लेन मैक्सवेल ने टी20 इंटरनेशनल क्रिकेट में सबसे तेज शतक जड़ने के मामले में एरोन फिंच और जोश इंग्लिस की बराबरी कर ली है. फिंच और इंग्लिस टी20 इंटरनेशनल क्रिकेट में ऑस्ट्रेलिया की ओर से सबसे तेज शतक जड़ने वाले बैटर थे. अब मैक्सवेल ने इन दोनों बैटर्स की बराबरी कर ली है. तीनों के नाम एक सामन 47 गेंदों पर शतक जड़ने का रिकॉर्ड है. मैक्सवेल के भारत खिलाफ टी20 में 500 रन पूरे ग्लेन मैक्सवेल ने भारत के खिलाफ टी20 इंटरनेशनल क्रिकेट में अपने रनों की संख्या 554 पर पहुंचा दी है. इस लिस्ट में टॉप पर विंडीज के निकोलस पूरन हैं जिन्होंने अभी तक इंडिया के खिलाफ क्रिकेट के सबसे छोटे फॉर्मेट में 592 रन बनाए हैं. एरोन फिंच 500 रन के साथ तीसरे नंबर पर हैं. मैक्सवेल ने 21 दिन में खेली दूसरी बड़ी पारी ग्लेन मैक्सवेल ने वनडे वर्ल्ड कप 2023 में अफगानिस्तान के खिलाफ रनों का पीछा करते हुए 128 गेंदों पर नाबाद 201 रन की पारी खेलकर अपनी टीम को सेमीफाइनल में प्रवेश दिलाया था वहीं उसके ठीक 21 दिन बाद उन्होंने भारत के खिलाफ टी20 बाइलेटरल सीरीज में 48 गेंदों पर नाबाद 104 रन की पारी खेलकर अपनी टीम को जीत दिलाई. . Tags: Glenn Maxwell , IND vs AUS , India vs Australia आंखों में दिखें 5 संकेत तो समझ जाइए दिल पर हो चुका है हमला, सचेत होने के लिए यही है सटीक समय, ऐसे करें बचाव महाराष्ट्र के 3 डॉक्टर्स, एक्टिंग के लिए छोड़ी नौकरी, थिएटर आंदोलन का बने हिस्सा, अमिताभ जैसे एक्टर्स को देते थे टक्कर महंगा नहीं 4 सस्ती चीजों से लिवर को बनाएं मजबूत, प्रदूषण की गंदगी भी आ जाएगी बाहर, सर्दी में बीमारी से भी रहेंगे दूर","pubDate":"2023-11-29 00:31:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/11/Glenn-Maxwell-8-2023-11-c006d72cdd039adf17d0c87040e37ae7-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"ec236ee27e2192318f8eddbb48ff81e9","title":"Jaiswal, Rinku moving to next level","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/29/jaiswal-rinku-moving-to-next-level-2637168.html","keywords":null,"creator":null,"video_url":null,"description":"Duo making a strong case for themselves to be the first names in the T20I India team sheet CHENNAI: WHILE the needle has moved with respect to India’s 50-over approach, its T20s is still a work in progress. Previous regimes have tended to view it as a shortened ODI and its reflected in some heavy defeats at global events. After Rohit Sharma took over as skipper, he vowed to change the playing style. While his clarion call has resulted in a clear transformation in 50-over cricket, Rohit hasn’t had the same degree of success in the shortest format. In his first years of T20Is, he struck at 139.4 at an average of 32.4. Since he was elevated as skipper, he has been striking at 137.9 while averaging 27.1. Middling numbers. There is a school of thought that Rohit may step aside from this format. One player who will be a more than handy replacement is Yashasvi Jaiswal. Even if Rohit is going to be an option till the World Cup next year, Jaiswal’s name should be pencilled in as one of the two openers. Among openers, the southpaw is the leading light in that he looks to take the game on from the very first ball. One look at his metrics and you can see why. His strike-rate ate (170.49) and balls faced per fours or sixes (3.45) while averaging in excess of 30 is something Indian cricket hasn’t had for a long time. He marries intent with execution and that’s why he’s so successful. “His work ethic is second to none, it’s a boring answer but it’s also the truth,” is how a person who has worked closely with the 21-year-old explained his methods. “He’s a gym rat, all he wants is to keep batting. He maybe a slight guy but he is focused on packing some strength into those forearms. That’s where he gets his power from.” He may have failed in the third T20I against Australia on Tuesday — he came dancing down the track but nicked through to the keeper — but the team management should be pleased with what they have seen thus far. He doesn’t put a value on his wicket so the onus is on taking the game on. This much has been evident even while watching his games for Rajasthan Royals. With Jos Buttler playing in a different role, Jaiswal is the one who has take advantage of the field restriction. That he is a left-hander also helps his cause immensely. Another left-hander who should be a shoo-in in any full strength squad is Rinku Singh. He didn’t get a chance to bat on Tuesday but he has already showed what he can do at the back-end of an innings. His nine-ball 31 at Thiruvananthapuram caught the eye of skipper Suryakumar Yadav. In the first game, he maintained his calm to guide India home. “When I saw Rinku come in to bat in the last game, the composure he showed was brilliant,” Surya said of that innings. “It reminded me of someone (MS Dhoni). Everyone knows the answer.” Tuesday’s accolades, though, was reserved for Ruturaj Gaikwad, one among many who’s trying to rubber-stamp a place in the top-order. His unbeaten 57-ball 123 was laced with 20 hits to the fence, but it was not enough as Glenn Maxwell’s 104 not out took Australia across the line. Brief scores: India 222/3 in 20 ovs (Gaikwad 123 n.o, Suryakumar 39, Tilak 31 n.o) lost to Australia 225/5 in 20 ovs (Maxwell 104 n.o, Head 35; Bishnoi 2/32).","content":"CHENNAI: WHILE the needle has moved with respect to India’s 50-over approach, its T20s is still a work in progress. Previous regimes have tended to view it as a shortened ODI and its reflected in some heavy defeats at global events. After Rohit Sharma took over as skipper, he vowed to change the playing style. While his clarion call has resulted in a clear transformation in 50-over cricket, Rohit hasn’t had the same degree of success in the shortest format. In his first years of T20Is, he struck at 139.4 at an average of 32.4. Since he was elevated as skipper, he has been striking at 137.9 while averaging 27.1. Middling numbers. There is a school of thought that Rohit may step aside from this format. One player who will be a more than handy replacement is Yashasvi Jaiswal. Even if Rohit is going to be an option till the World Cup next year, Jaiswal’s name should be pencilled in as one of the two openers. Among openers, the southpaw is the leading light in that he looks to take the game on from the very first ball. One look at his metrics and you can see why. His strike-rate ate (170.49) and balls faced per fours or sixes (3.45) while averaging in excess of 30 is something Indian cricket hasn’t had for a long time. He marries intent with execution and that’s why he’s so successful. “His work ethic is second to none, it’s a boring answer but it’s also the truth,” is how a person who has worked closely with the 21-year-old explained his methods. “He’s a gym rat, all he wants is to keep batting. He maybe a slight guy but he is focused on packing some strength into those forearms. That’s where he gets his power from.” He may have failed in the third T20I against Australia on Tuesday — he came dancing down the track but nicked through to the keeper — but the team management should be pleased with what they have seen thus far. He doesn’t put a value on his wicket so the onus is on taking the game on. This much has been evident even while watching his games for Rajasthan Royals. With Jos Buttler playing in a different role, Jaiswal is the one who has take advantage of the field restriction. That he is a left-hander also helps his cause immensely. Another left-hander who should be a shoo-in in any full strength squad is Rinku Singh. He didn’t get a chance to bat on Tuesday but he has already showed what he can do at the back-end of an innings. His nine-ball 31 at Thiruvananthapuram caught the eye of skipper Suryakumar Yadav. In the first game, he maintained his calm to guide India home. “When I saw Rinku come in to bat in the last game, the composure he showed was brilliant,” Surya said of that innings. “It reminded me of someone (MS Dhoni). Everyone knows the answer.” Tuesday’s accolades, though, was reserved for Ruturaj Gaikwad, one among many who’s trying to rubber-stamp a place in the top-order. His unbeaten 57-ball 123 was laced with 20 hits to the fence, but it was not enough as Glenn Maxwell’s 104 not out took Australia across the line. : India 222/3 in 20 ovs (Gaikwad 123 n.o, Suryakumar 39, Tilak 31 n.o) lost to Australia 225/5 in 20 ovs (Maxwell 104 n.o, Head 35; Bishnoi 2/32).","pubDate":"2023-11-29 00:24:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/11/29/original/Jaiswal1.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"2cc2f7716418f36a78a78302aeb24af0","title":"New Sports Minister Harin pledges to revive cricket, tackle corruption","link":"https://www.ft.lk/sports/New-Sports-Minister-Harin-pledges-to-revive-cricket--tackle-corruption/23-755735","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The newly appointed Minister of Sports, Harin Fernando, committed yesterday to revive Sri Lanka Cricket and implement necessary legal measures to eliminate corruption from the sport. Speaking to the media after assuming duties in his new post, Fernando invited all stakeholders to collaborate in achieving this goal. “This responsibility is crucial because the sport is a cherished aspect of our lives. Simultaneously, certain practices need to be followed when making these changes to the regulations,” he remarked. Fernando, who also serves as the Minister of Tourism, was appointed as the Minister of Sports on Monday by President Ranil Wickremesinghe. This decision followed the dismissal of the former Minister Roshan Ranasinghe. Fernando has previously held the position of Minister of Sports in 2018. Fernando acknowledged the challenges confronting Sri Lanka Cricket and referenced his previous tenure in the same role, where the sport faced serious issues related to corruption. Despite those challenges, he asserted his successful navigation of the organisation through those difficulties, highlighting his proven track record. “I am no stranger to challenges,” Minister Fernando said, expressing his preparedness to address the issues affecting Sri Lanka Cricket. He invited all stakeholders in cricket administration to join forces with him, emphasising the significance of unity and collective efforts in restoring the sport to its former glory. The Minister expressed his intention not to go against anyone and emphasised his desire to ‘clean up’ the sport of cricket, seeking collaboration from all, including former World Cup-winning Sri Lankan skipper Arjuna Ranatunga. He acknowledged the public’s expectation for the restoration of cricket in Sri Lanka, focusing on overturning the suspension imposed by the International Cricket Council (ICC). Highlighting the significance of swiftly reversing the ICC ban, he stressed the importance of accomplishing this within a few days.","pubDate":"2023-11-29 00:22:12","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"ee0a70b29a7887073322838638cd4545","title":"Court case against interim committee postponed by a week","link":"https://www.ft.lk/sports/Court-case-against-interim-committee-postponed-by-a-week/23-755734","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Court of Appeal has decided to take up for hearing on 5 December, the motion seeking to revoke the stay order issued against the Interim Committee appointed for Sri Lanka Cricket (SLC). Taking up for consideration the motion yesterday, the court also informed the newly appointed Sports Minister, Harin Fernando to present his status on the matter on the fixed date. The case has been moved to a new panel of judges of the Court of Appeal after a total of three judges had earlier refused themselves from hearing the motion. In November, the Court of Appeal issued a stay order against the Gazette issued by Roshan Ranasinghe, in his capacity as the Sports Minister, on the appointment of an interim committee for Sri Lanka Cricket (SLC) headed by former cricketer Arjuna Ranatunga. The court issued the order suspending for 14 days the functions of the SLC interim committee after taking up for hearing a petition filed by SLC President Shammi Silva challenging the Gazette notification. A motion was later filed by Roshan Ranasinghe to revoke the stay order that was issued against the Interim Committee appointed by him for Sri Lanka Cricket.","pubDate":"2023-11-29 00:20:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"26550fe84aef38a50f9e28e95237ef35","title":"Alyssa Healy admits to reaching boiling point with Mitchell Starc after 2015 Cricket World Cup","link":"https://7news.com.au/sport/cricket/alyssa-healy-admits-to-reaching-boiling-point-with-mitchell-starc-after-2015-cricket-world-cup-c-12719852","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"‘This is it, I’m done, I don’t want to see him any more.’","content":"Australian captain Alyssa Healy has admitted she was on the brink of breaking up with her now husband, Aussie bowler Mitchell Starc, after he spearheaded his team’s triumph. Starc and Healy, both already greats of Australian cricket while still having years left in their respective careers, have formed a power couple of the highest order since they started dating in 2010 before their eventual marriage in 2016. Healy is one of Australia’s greatest ever keeper-batters, having scored 5500 international runs from 248 matches including six tons to go with 226 dismissals behind the stumps, while Starc has taken the fifth most wickets in Australian men’s Test history. The tearaway left-armer is also renowned as one of Australia’s greatest ever white-ball bowlers, especially at World Cups, where he has taken the third most wickets in the history of the men’s game, just six behind all-time leader Glenn McGrath despite playing 11 fewer games. And he was at the peak of his powers during the 2015 World Cup in Australia, winning player of the tournament honours to lead his side to a fifth world title in the one-day format. The 2015 World Cup final is also best remembered for Starc knocking New Zealand skipper Brendon McCullum’s stumps out of the ground in the first over of the match in front of almost 100,000 screaming Aussie fans at the MCG. After the famous win, the Aussie players let loose on a week of partying and celebrations, as Starc admitted on the Separate Bathrooms podcast. “We finished the 2015 World Cup and may have been on the ‘cordials’ for a week,” he said with a smile in his voice. But Starc also had other things on the horizon too, having booked a holiday with Healy, as he explained, where he had planned to ask his longtime girlfriend to be his wife. “We’d booked a little getaway to Hayman Island. It was April, so it was both of our time off from cricket, I had a couple of weeks before I had to jet over to India for the IPL, so we went away and I had these grand plans of (proposing there),” he said. Lucky he made it to the holiday too, because, speaking alongside Starc on the same podcast, Healy conceded she almost reached boiling point with their relationship during his week-long bender. “He was lucky, because by the fifth day on the beers with the boys after they finally won a World Cup — when we won about eight (women’s titles) before them — and on about the fifth night he was out, I thought, ‘This is it, I’m done, I don’t want to see him any more’,” she said. “And then next minute, we were going on a holiday that weekend (so) I was like, ‘I’ll give him one more chance, I suppose’. “But I was more grumpy at him because he didn’t tell me where he was going (the day before the holiday). He was like, ‘I’ve just got to go do some stuff this afternoon’. I was like, ‘Alright, well we’ve got to do this, we’ve got to do that’, and I didn’t hear from him for ages. I was like, ‘What is he doing? We’re going tomorrow’. “Low and behold, he’d driven all the way up to the central coast to ask my dad if it was OK that he ask me to marry him, and drove back. “So, by the time he got back, I was in some sort of a hell of a mood. And then looking back on it, I’m like, ‘He’s done really well to do that and then come back with me being grumpy and still want to propose’.” Healy detailed how serious that crossroads moment was, but it hasn’t been their only one. Although some have been more trivial than others. “We started watching Billions or something like that together. And we were like, ‘Oh, we’re at home. Let’s watch it together. This will be great’,” Healy went on. “Anyway, I went out, I reckon I went to hockey training or something and came home and there’s Mitch on the couch watching it without me. And I’ve never felt so betrayed in my life. “I think I literally said ‘I wished that I walked in and there was another woman here because I actually think this is so much worse’,” she joked. But they managed to get over that hurdle as well. “We’ve sort of put that aside. I was a little bit nervous to go there again, I thought, ‘You know what, I’m not going through this all over again’,” Healy said. “But we are. When we’re at home, we tend to watch similar sort of shows of an evening but we don’t watch Netflix or anything like that together, that’s for touring — touring life. We leave all that for tours and then we compare notes later.” Starc added: “We did get past it; we ended up watching The Last of Us together on tour, so we’ve gotten past it, we’ve made amends.” The pair first met as nine-year-old teammates in junior cricket where, for a period of time, they would share the wicketkeeping gloves before Starc grew in height and took up bowling. They describe their relationship as having started out as being “close mates” before realising their love for each other, which has since endured, despite rarely being home together while they play cricket on opposite sides of the globe throughout the year. “We’re lucky nowadays we have phones, right?” Healy said of how they cope with the separation. “We have the ability to FaceTime or WhatsApp or call one another basically any time of the day. And time zones don’t exactly help us all the time, especially when you know, I’m playing in one part of the world and he’s playing in the other, you end up missing one another, sort of halfway through the day. “But for us, it’s just keeping it really simple. I mean, we chat about the important things, what’s going on in our lives and then making sure that we’re supporting one another at the same time. I think that’s really important. “And we’re in touch every day. We don’t like call one another every day or FaceTime one another every day, but we still talk about the important things and I think that’s sort of what works and it makes the moments when you’re together, which is quite rare throughout the year, even more special. “You get to spend the time together but you still know what’s going on in the other person’s life. So I think it kind of makes it easy and it makes it more seamless I think.”","pubDate":"2023-11-29 00:19:10","image_url":"https://images.7news.com.au/publication/C-12719852/cf7a6bf109ef2a33233be2b38882bc9d38472dfb-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"9a4fb7add3df64e39e9dd1720be40cd9","title":"Athapaththu finishes off WBBL on a high for Sydney Thunder","link":"https://www.ft.lk/sports/Athapaththu-finishes-off-WBBL-on-a-high-for-Sydney-Thunder/23-755733","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Chamari Athapaththu Sri Lanka’s women’s team cricket captain Chamari Athapaththu ended her stint with Sydney Thunder in the Women’s Big Bash League (WBBL) on a high. By the time her Sydney Thunder side bowed out in Tuesday’s Eliminator, she was the tournament’s leading scorer with 552 runs at an average of 42.46 and strike rate of 127.18. She also had nine wickets at 27.22 and an economy rate of 6.83, including 3 for 20 with her off-spin in her opening match against cross-town rivals Sydney Sixers. Her 41 off 40 balls was her side’s best by far as Thunder exited with a 44-run defeat at the hands of Brisbane Heat and Athapaththu went into that match as Player of the Tournament. After being brought somewhat belatedly into the WBBL, again as an overseas replacement, Athapaththu has torn up the competition with her unique scoring ability. Initially overlooked in the overseas draft for the current WBBL, she was snapped up by Thunder as cover for the existing overseas contingent of Marizanne Kapp, Heather Knight and Lauren Bell. With Knight as captain, it took an illness to No.1 draft pick Kapp to make way for Athapaththu initially. Bell played just twice for Thunder and was recalled by England ahead of their upcoming tour of India, by which time Athapaththu had made herself indispensable. She scored five fifties in the tournament this year and crashed 18 sixes, third behind Grace Harris and Sophie Devine. In doing so, she helped Thunder to a vastly improved performance after they recorded just one win last season. The knock-on effect so far has been another deal, Athapaththu signing for Northern Brave, with whom she will link up for New Zealand’s Super Smash late next month. With the auction for the 2024 WPL due to take place on 9 December, she could be taking another significant step in her franchise career before long.","pubDate":"2023-11-29 00:15:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"71a0da84d7410e2f9d9f31d9a552bfd1","title":"Prima Under-15 Super League final","link":"https://www.ft.lk/sports/Prima-Under-15-Super-League-final/23-755732","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Led by Royal College’s Thevindu Wewelwala the unbeaten Colombo South outfit, are in a strong position to win the Prima Under-15 Super League Cricket Tournament when they take on Colombo North, led by Wesley College player Lithum Senuja at the Mercantile Cricket Association (MCA) ground today, 29 November. Half of the Colombo South outfit is from Royal College who looked poised to pull it off. Meanwhile Colombo North got two players each from Joes and Isipathana, is the dark horse of the tournament. With the weather conditions settling down fast, a good game of cricket plus future national youth stars could be identified from this grand finale today. The unbeaten Colombo South won all their four matches accumulating 11 points while the second placed Colombo North ended with seven points. Galle narrowly missed out the final by collecting only six points from their four games. Though much was expected from Kandy, they too were below their usual standards being inconsistent ending on 4th place with four points while Dambulla did not trouble the scorers at all as they did not earn any points. The leading nutrition company Prima is sponsoring this event for a record 16th year in tandem.","pubDate":"2023-11-29 00:10:00","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"spanish"},{"article_id":"af6a160325c7929f9a8870df0dd3d1f1","title":"Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying!","link":"https://www.dailymail.co.uk/sport/cricket/article-12801731/Will-Jacks-leading-Englands-reset-failing-central-contract-injury-flying.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Will Jacks speaks in a manner befitting the new breed of no fear batsmen charged with leading England out of their post-World Cup funk and into another explosive white-ball era.","content":"Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying! All-rounder Will Jacks is hoping to cement his England place in the Caribbean His incredible hitting brought him England debuts in all three formats last winter And he is challenging to open the batting in England's 50-over and T20 reset By Paul Newman for the Daily Mail Published: 17:30 EST, 28 November 2023 | Updated: 19:07 EST, 28 November 2023 e-mail View comments Will Jacks speaks in a manner befitting the new breed of no fear batsmen charged with leading England out of their post-World Cup funk and into another explosive white-ball era. 'I've never had a problem playing with freedom so the way the game has gone in the last few years is brilliant,' says a man challenging to open the batting in England's 50-over and T20 reset in the Caribbean starting this weekend. 'You can't think about getting caught on the boundary because if you did you'd start taking the safe option and this attitude is about winning games. 'It's the way you have to approach the game if you want to play for England and it suits me. If the game's there to win and you have to take risks you just have to do it because, if you get out, who cares? It's the risk and reward of the game these days.' It is a mind-set demonstrated when Jacks was caught on the boundary on 94 in one of his early one-day international appearances against Ireland at Trent Bridge last summer — he insists he has no regrets about missing out on a first England hundred —and one that has been integral to his attitude throughout his rise as a very modern batter. All-rounder Will Jacks (above) is hoping to cement his England place in the Caribbean Jacks showed his off-spin prowess by taking six wickets on Test debut against Pakistan Jacks announced himself with an extraordinary hundred off just 25 balls for Surrey against Lancashire in a T10 pre-season friendly in Dubai in 2019 and made the first century in the Hundred, off just 48 balls, for Oval Invincibles last year. His incredible hitting brought him debuts in all three formats for England last winter, and he showed his off-spin prowess by taking six wickets on Test debut against Pakistan in Rawalpindi. But his progress was checked by a hip injury earlier this year that was diagnosed as being a direct consequence of the amount of flying he does in pursuing his multi-format career and, having just turned 25, he journeys to the Caribbean needing a restart just as much as England. 'I'm really excited,' Jacks tells Mail Sport during a rare spell at home in London. 'I've been around a bit and been involved in a lot of squads without breaking through and been a mainstay of the teams but I'm experienced enough now and hopefully ready to take that next step. Is this a new era? Maybe yes, maybe no, but there will be new people there for the start of a 50-over World Cup cycle and a good mix of youth and experience.' He might have made that breakthrough before now, and provided a much-needed spark to England's World Cup capitulation in India, had he not been injured after rushing from the Test squad in New Zealand to the 50-over side in Bangladesh in late February. 'It was a tendon injury which is incredibly rare for a cricketer, especially a batsman, so what it came down to was a pure tiredness injury,' says Jacks. 'I'd had 40 flights last winter and my body was at its limit. Something had to give. So I learnt my lessons about recovery and I have to look after myself going forward. It's the before and after flying, the stretching, going in the pool and eating well. 'It was pretty disappointing. There would have been more opportunities in Bangladesh and, you never know, that might have helped me push my case more for the World Cup just gone. Then I missed the IPL. So, it was a setback but I like to think I bounced back and had a good summer and I'll use that to learn some lessons about travelling and looking after my body.' Now Jacks will be competing with Test openers Zak Crawley and Ben Duckett for his preferred spot at the top of the order in the new 50-over team while looking to prove he is one of the openers to launch their defence of the world T20 title back in the Caribbean in June. 'I've opened my whole career pretty much and that's where I've had my success, made my name and where all my good numbers have come so I'd love to go up there.' There is one potential cloud on the horizon. Jacks, surprisingly for a batter who epitomises the all-out aggressive approach England want to regain in white-ball cricket, was not among the 29 players awarded central contracts. The three-time County Championship winner with Surrey insists he is still committed to red-ball cricket, but he is not guaranteed to say yes should England want him to boost their depleted spin ranks on the five-Test tour of India starting in January. Jacks will compete with Zak Crawley and Ben Duckett (above) for a spot at the top of the order Jacks has signed up for a second season at the SA20, where he hit a competition-best 19 sixes last year, and makes it clear his priority is earning that place in England's T20 World Cup squad. 'I was very hopeful of getting a central contract but there are a lot of talented cricketers out there and I can understand why I didn't get one,' he insists. 'There are numerous fast bowlers and they want to look after them with injury worries. 'It was disappointing but it does give me freedom. There are a lot of franchises and while nobody likes to talk about it there can be a lot of money involved and it's a short career. Everything comes into play. The World Cup is a massive one so playing T20 cricket is really important to me at the moment. The way the game and the world is at the moment definitely suits me. I was always a kid who enjoyed whacking it.' And his ability to whack it will be crucial to England White-Ball Cricket 2.0. Share or comment on this article: Will Jacks on leading England's reset, failing to get a central contract… and his injury from too much flying! e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-29 00:07:34","image_url":"https://i.dailymail.co.uk/1s/2023/11/28/20/78341599-0-image-a-43_1701202356687.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d5caeb0b0403d194d9f563d94899e301","title":"Percy: The Unusual Brand","link":"http://island.lk/percy-the-unusual-brand/","keywords":["Sports","Percy Abeysekara","Percy at the Murali Harmony Cup Cricket Tournament in the North"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Kushil Gunasekera If any student growing up wants to learn how to create a brand of your own, what Percy did can be an example, not necessarily replicating what he did which is his own unique benchmark- a hard act to follow. The point I’m trying to make is that one should not be […]","content":"If any student growing up wants to learn how to create a brand of your own, what Percy did can be an example, not necessarily replicating what he did which is his own unique benchmark- a hard act to follow. The point I’m trying to make is that one should not be afraid to establish one’s identity following their passion, but do it the way he did- relentlessly, which eventually became a global one-man-brand that is most extraordinary. It is time that we recognize such a personality, the one-man Sri Lankan flag bearer who has not only entertained all of us, but that he established long lasting friendships with internationally renowned cricketers whom we saw sending messages of condolence that had touched their heart with his unforgettable, witty, demonstrative art of engaging which others dare not even attempt. I have known that anyone can copy someone’s work or style, but definitely not the passion to pursue what one enjoys the most. He truly epitomized an unwavering and positive spirit- a remarkable character that lifted up the mood of the spectators- victory or defeat, and his presence on the field lit it up, like giving a heads up even when the odds were against us. There is no Sri Lankan, as one man, that I know of who has been waving the flag countless times even on a daily basis during a five day Test match, to showcase and highlight the colourful lion symbol of our country with pride which itself could really be a record worthy of the Guinness Book, having done what he did for at least 45 years- a hugely praiseworthy feat that should not go unnoticed, and matchless. We all know what he did to boost, enhance and motivate not only the fans but the National Team during this long period of association at every given opportunity but standing tall, rain or shine, covering -again hard to count- the many miles, walking at the venues which itself is another record-breaking effort that he did tirelessly. As someone who was acquainted with Percy for 44 years, since 1979, I have had the unique opportunity to see a different side of his passion for cricket- one that has been closely tied with bringing people and communities together in unity and harmony during the Murali Cup held in the North post-conflict for five consecutive years 2012 – 2016 where he played a pivotal role towards building reconciliation and goodwill through building bridges of friendship. People eagerly awaited his arrival at each venue where he would circle the grounds like no other which is phenomenal, notwithstanding the hot and humid climatic conditions even at his age- a rare gift of the ‘never-give-up’ attitude. In fact, when I told him in lighter vein that Sir Ian Botham was knighted for walking thousands of miles for charity, Percy responded promptly in his usual inimitable and hilarious manner that he has walked more miles across all of the grounds worldwide, “but not even a good night for me” which is typical of the man- never short of quick witted rhymes, such a statement can only come from him and no other. We salute and applaud his courageous life, to do what he did and just like any famous cricketer is recognized in this country there was no place that he wasn’t recognized either, even in the North, having had that experience of going along with him which was always an interesting journey, to be accorded a right-royal welcome even at boutiques on the way side with a free cup of ginger tea for his contribution, even by the villagers. His personality, a lively and vibrant character, cannot be erased from the Sri Lanka cricket arena that will be historically ingrained in the minds of cricket fans who will not see again another stadium ambassador for the spirit of cricket. May his good deeds benefit his Sansaric journey!","pubDate":"2023-11-29 00:00:12","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"49756c63115bee794c4fa9f3b27debb9","title":"Cricket watchers escape the sun at country club grateful for support","link":"https://www.bordermail.com.au/story/8439500/kiewa-cricket-clubs-retractable-awnings-add-to-spectator-comfort/?src=rss","keywords":null,"creator":["Janet Howie"],"video_url":null,"description":"More shade means more comfort under new retractable awnings.","content":"A day at the cricket is now far more pleasant for supporters of a North East country club. has installed new motorised retractable awnings to its rooms and Chairperson Annie Heffernan said the awnings extended the verandah over a grassed area where it was nice to sit but often was in full sunshine. \"So it allows a lot more people to sit in shade and be more comfortable while watching the cricket and it cools down the facility as well,\" she said. \"They're retractable, so there's more flexibility there.\" Mrs Heffernan said the club was \"extremely grateful\" for the sponsorship that made the $20,000 project possible. Saputo Dairy Australia, which contributed $10,000 through its legacy program, WAW and Indigo Shire provided funding. SDA's Kiewa site manager and head of operations Simon Cauchi said the awning installation marked the 11 project in Australia of the Saputo Legacy Program, which aimed to improve local sport and health facilities. \"The Kiewa Cricket Club is just one kilometre from our Kiewa processing facility, and we are pleased to support the ongoing safety, comfort and social needs of the club's members, players and spectators,\" he said. \"Delivering this project aligns with our ongoing promise to make meaningful contributions to local communities in the regions where our employees and farmers live and work. Kiewa Cricket Club will officially open its new clubrooms on Saturday, December 2, with people invited to watch the A grade team take on Dederang and stay for the festivities afterwards. There will be a barbecue tea and drinks at bar prices. RSVP is requested for catering purposes. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-11-29 00:00:00","image_url":"https://www.bordermail.com.au/images/transform/v1/crop/frm/zVtrQGhRGBmiD3RNa8bKgt/6b9bc8a7-213b-4e73-b8b4-f67c85cad00e.jpg/r0_363_5787_3623_w600_h338_fmax.jpg","source_id":"bordermail","source_priority":2185061,"country":["australia"],"category":["sports"],"language":"english"}]}