{"newsArray":[{"title":"Live cricket updates: White Ferns v Bangladesh, third ODI","link":"https://www.nzherald.co.nz/sport/live-cricket-updates-white-ferns-v-bangladesh-third-odi/KEVVIXNFTZDLRHYNDB5HCE5M6A/","keywords":null,"creator":null,"video_url":null,"description":"Follow the action as the White Ferns take on Bangladesh.","content":"Follow the action as the White Ferns take on Bangladesh in their third ODI. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2022-12-17 00:36:25","image_url":"https://www.nzherald.co.nz/resizer/aq-iZFLUfpiARUV2J_ZzTfqqoiI=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/SMT5ECBXDFDM5FVBAR7SHB32RQ.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Veteran Ben Smith returns for Central Stags - Central Districts Cricket","link":"http://www.voxy.co.nz/sport/5/411350","keywords":["Sport"],"creator":null,"video_url":null,"description":"Ford Trophy joint leaders the Central Stags play their first Hawke’s Bay fixture of the summer this Sunday and are pleased to welcome back top order veteran Ben Smith (Whanganui) after his recovery from delicate repairs.","content":null,"pubDate":"2022-12-16 23:15:37","image_url":null,"source_id":"voxy","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Cricket stunned by ‘crazy’ world record","link":"https://www.cairnspost.com.au/sport/cricket/big-bash/cricket-stunned-by-crazy-night-as-adelaide-strikers-set-world-record/news-story/92833ccb4a3a84c69c518bafb4f662a2","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Adelaide Strikers obliterated Sydney Thunder at the Sydney Showground on Friday night, bowling out the home side for an embarrassing 15 runs.","content":null,"pubDate":"2022-12-16 20:01:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Never seen that’: World reacts to BBL farce","link":"https://www.cairnspost.com.au/sport/cricket/sydney-thunder-all-out-for-15-leaving-cricket-world-lost-for-words/news-story/14ae3dbe1ba25d4548e0fd24c18a3453","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"The cricket world has been left lost for words after the Sydney Thunder were bowled out for 15 in the worst T20 score ever witnessed in the sport.","content":null,"pubDate":"2022-12-16 19:42:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Inter-college Cricket, Kabbadi, Kho-Kho tournaments conclude at KU","link":"https://kashmirreader.com/2022/12/17/inter-college-cricket-kabbadi-kho-kho-tournaments-conclude-at-ku/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Srinagar: Three inter-college tournaments concluded at the University of Kashmir on Friday. Vice-Chancellor Prof Nilofer Khan chaired the prize-distribution ceremony of the Cricket tournament for women, Kabbadi tournament for men and Kho-Kho tournament for women, organised by the varsity’s Directorate of Physical Education and Sports (DPES). Congratulating the winners and the participants, Prof Nilofer encouraged […]","content":"Srinagar: Three inter-college tournaments concluded at the University of Kashmir on Friday. Vice-Chancellor Prof Nilofer Khan chaired the prize-distribution ceremony of the Cricket tournament for women, Kabbadi tournament for men and Kho-Kho tournament for women, organised by the varsity’s Directorate of Physical Education and Sports (DPES). Congratulating the winners and the participants, Prof Nilofer encouraged them to continue participating in sports activities of their interest with greater passion and determination. “I am always glad to see a noteworthy presence of our girl students in different sports activities. This trend must continue to inspire other girl students to come forward and play sports for their overall holistic development,” she said. Registrar Dr Nisar A Mir and Coordinator DPES Dr Mussavir Ahmad, besides officials and coaches from DPES, were also present on the occasion. 14 teams participated in the cricket tournament which was won by KU against GDC Ganderbal. Saima from Department of Physics was awarded as woman of the series, while Suriya from Department of Chemistry was awarded with woman of the match. 27 teams participated in the Kabbadi tournament, with GDC Sopore emerging as its winner and GDC Anantnag the runners-up. The DPES had for the first time conducted the matches on Kabbadi mats. In the Kho-Kho tournament, 21 teams participated, and it was won by Government College of Physical Education Ganderbal, while GDC Baramulla emerged as the runners-up. Shaista Bano from GDC Sumbal and Afifa from Physical College Ganderbal were declared as best players of the tournament. Inter-college Cricket, Kabbadi, Kho-Kho tournaments conclude at KU added by KR Desk on 12:13 am December 17, 2022 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-16 18:43:53","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Brabourne Stadium pitch report: IND vs AUS Women pitch report 4th T20 CCI Mumbai","link":"https://thesportsrush.com/cricket-news-brabourne-stadium-pitch-report-ind-vs-aus-women-pitch-report-4th-t20-cci-mumbai/","keywords":["Cricket","Australia Women tour of India 2022","Brabourne Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"In what continues to be a great advertisement for the imminent inaugural edition of the Women’s IPL in particular, and women’s Cricket in general, India and Australia will lock horns today during the penultimate contest of the five-match T20I series at the Brabourne Stadium in Mumbai. After suffering an agonizing Super Over loss during the… The post Brabourne Stadium pitch report: IND vs AUS Women pitch report 4th T20 CCI Mumbai appeared first on The SportsRush.","content":"In what continues to be a great advertisement for the imminent inaugural edition of the Women’s IPL in particular, and women’s Cricket in general, India and Australia will lock horns today during the penultimate contest of the five-match T20I series at the Brabourne Stadium in Mumbai. After suffering an agonizing Super Over loss during the second T20I in front of a jam-packed DY Patil Sports Academy crowd, world champions Australia bounced back in the way they know best during the third T20I at the Brabourne Stadium, to lead the series 2-1. After losing the in-form Alyssa Healy and the no.1 ranked T20I batter Tahlia McGrath cheaply, the experienced allrounded Ellyse Perry (75 off 47) stood tall to whack the Indian bowlers all across the ground, and perhaps come up with a statement of sorts as to how valuable she still can be in the Aussie T20 set-up. Resultantly, along with the contribution of Grace Harris (41 off 18), she took the Aussie total to 172/8. In reply, despite a Shafali Verma (52 off 41) show, India fell short of the target by 21 runs. Brabourne Stadium pitch report Akin the previous T20I, the pitch at the Brabourne Stadium on Saturday will turn out to be a batting paradise for the world class players from both the sides, thereby promising to be a run-fest yet again. “There is not much in it for the bowlers. We have one change. In place of Meghna, Rajeswari comes in,” remarked Indian skipper Harmanpreet Kaur during the Toss on Thursday with regards to the pitch, while deciding to play a spinner instead. The Red soil pitch will provide decent carry and bounce, which will thus allow the batters to play their strokes freely without any second guesses regarding the pitch behavior. Having said that, the pace bowlers will be able to generate swing and extract bounce on this surface, as was witnessed during both the innings in the previous T20I with the new ball. Expect the team batting first to eye on scoring anything around the 180-run mark, in order to challenge the opposition. The post Brabourne Stadium pitch report: IND vs AUS Women pitch report 4th T20 CCI Mumbai appeared first on The SportsRush.","pubDate":"2022-12-16 18:31:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Sydney Thunder claim unwanted slice of cricket history after being bowled out for 15 in Big Bash League","link":"https://www.nzherald.co.nz/sport/cricket-sydney-thunder-claim-unwanted-slice-of-cricket-history-after-being-bowled-out-for-15-in-big-bash-league/MMNKDAZKI5GSVALG5QDRTSYZKY/","keywords":null,"creator":null,"video_url":null,"description":"The Sydney Thunder posted the lowest-ever total in T20 cricket.","content":"The Sydney Thunder have claimed an unwanted piece of cricketing history after being bowled out for the lowest-ever score in a T20 match. Chasing 140 after being sent into the field at the toss, the Thunder were cleaned up for just 15 runs in their Big Bash clash against the Adelaide Strikers in Sydney on Friday night. No 10 batsman Brendan Doggett top-scored with four. Doggett sent the first ball he faced to the ropes to score the team’s only boundary, before being dismissed on the next delivery. Advertisement Advertise with NZME. Five batsmen were dismissed without scoring – including three of their top four in the order. Their 15-run total eclipsed the mark set by Turkey when they were dismissed for 21 against the Czech Republic in 2019. “I honestly cannot believe what just happened,” Adelaide bowler Henry Thornton said after finishing with figures of 5-3 from his 2.5 overs. “Everyone here probably doesn’t know what’s going on either. It was amazing. I thought they bowled really, really well considering what the wicket was doing and we just thought if we hung in there long enough we’d create chances. “That’s unbelievable; I’ve never had that in my life, to be honest.” Advertisement Advertise with NZME. The Strikers themselves didn’t get off to the greatest start with the bat and found themselves 24-2 inside four overs. However, a 66-run partnership between Chris Lynn and Colin de Grandhomme put them back on track to post a defendable score. Finishing up on 139-9 from their allotted overs, Thornton said the team were able 20 runs short of where they thought they would need to be to defend their total. “We tried to get to 150-plus. We thought if we could get over 150 we’d be really close, but we’d have to bowl well. “We just thought if we bowled to the top of the stumps and we were clear in what we wanted to execute then we’d be in the game.” It didn’t take long for the Strikers to make headway into defending their total, with the Thunder losing three wickets in their first 10 deliveries, before falling six down at the start of the fourth over. Advertisement Advertise with NZME. Thornton did the majority of the damage with his five wickets, while Wes Agar finished with figures of 4-6 and Matt Short picked up 1-5. “I feel like I need to retire now,” Thornton said. “I don’t think I’m getting better than that. Honestly, that was an amazing game of cricket.” Sydney Thunder scorecard Alex Hales 0 (2) - c Harry Neilsen (wk) b Wes Agar Matthew Gilkes 0 (2) - c Adam Hose b Matt Short Rilee Rossouw 3 (5) - c Short b Henry Thornton Advertisement Advertise with NZME. Jason Sangha 0 (2) - c Neilsen b Thornton Alex Ross 2 (4) - c Neilsen b Thornton Daniel Sams 1 (3) - b Agar Oliver Davies 1 (4) - c Neilsen b Thornton Chris Green 0 (6) - c Neilsen b Agar Gurinder Sandhu 0 (3) - c Short b Agar Advertisement Advertise with NZME. Brendan Doggett 4 (2) - c Thomas Kelly b Thornton Fazalhaq Farooqi 1 (2) - not out Total: 15 after 5.5 overs. Save share Share this article facebook copy link twitter linkedin reddit email","pubDate":"2022-12-16 18:08:39","image_url":"https://www.nzherald.co.nz/resizer/mxLQj2A684auHQpTfZDCAzW12PE=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/H3SOU3LV7NBUDHM7R2JXX72QLA.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps skipper Tim Southee unlikely to follow lead of Brendon McCullum’s England","link":"https://www.nzherald.co.nz/sport/cricket-black-caps-skipper-tim-southee-unlikely-to-follow-lead-of-brendon-mccullums-england/MVZZKHLIHNCKFGRUPFSGOAXZOI/","keywords":null,"creator":null,"video_url":null,"description":"Quizzed on what style his Black Caps test team would employ, Tim Southee was unequivocal.","content":null,"pubDate":"2022-12-16 17:00:00","image_url":"https://www.nzherald.co.nz/resizer/FpmFnNoEuhtqQQVDyr2-xlCZq7M=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/QCCTSU5UGZASRD2VLGQAUVWP5A.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Watch: कुलदीप यादव-मोहम्मद सिराज ने खोला अपनी सफलता का राज, बताया कैसे बांग्लादेशी बल्लेबाज़ों पर हुए थे हावी","link":"https://www.abplive.com/sports/cricket/watch-indian-bowling-coach-paras-mhambrey-interview-with-kuldeep-yadav-and-mohammed-siraj-see-video-2283871","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Kuldeep Yadav and Mohammed Siraj: भारत और बांग्लादेश के बीच खेले जा रहे पहले टेस्ट मैच में भारतीय टीम बल्लेबाज़ी और गेंदबाज़ी दोनों ही डिपार्टमेंट में शानदार दिखाई दी है. टीम ने पहले बल्लेबाज़ी करते हुए 404 रन बोर्ड पर लगाए. इसके बाद पहली पारी के लिए बल्लेबाज़ी करने उतरी बांग्लादेश की टीम को 150 रनों पर समेट दिया. इसमें कुलदीप यादव (Kuldeep Yadav) और मोहम्मद सिराज (Mohammed Siraj) का अहम योगदान रहा. कुलदीप यादव ने पांच विकेट लिए. वहीं मोहम्मद सिराज ने 3 विकेट अपने नाम किए. पहली पारी में गेंदबाज़ी के बाद दोनों ही गेंदबाज़ों ने टीम के बॉलिंग कोट पारस म्हाम्ब्रे से कास बातचीत की.  बताया कहां किया सुधार कुलदीप यादव और मोहम्मद सिराज ने शानदार परफॉर्मेंस के बाद टीम के बॉलिंग कोच पारस म्हाम्ब्रे से बात की. इसका वीडियो बीसीसीआई की तरफ से सोशल मीडिया पर शेयर किया गया. कोच पारस म्हाम्ब्रे ने कुलदीप यादव से बात की शुरुआत की. उन्होंने कुलदीप से सवाल पूछा, “आप काफी टाइम के बाद टेस्ट क्रिकेट खेल रहे हो, आपकी क्या तैयारी रही? कुलदीप ने जवाब देते हुए कहा, “सर्जरी के बाद लगा कि मुझे थोड़ी पेस बढ़ानी है. सबने बात की कैसे पेस बढ़ानी है, लेकिन असल में वो चीज़ आई नहीं. जब हम श्रीलंका में टी20 खेल रहे थे, तब आपसे बात हुई थी कि रिदम पर काम करेंगे तो ज़्यादा अच्छा रहेगा.” इसके बाद पारस म्हाम्ब्रे ने मोहम्मद सिराज से सवाल पूछा, “असल वो क्या चीज़ है जो टेस्ट क्रिकेट में एंजॉय करते हो.” सिराज ने इसका जवाब देते हुए कहा, “पार्टनरशिप (गेंदबाज़ी में) होती है, आप लंबे स्पेल डालते हो. उसके बाद कुछ टाइम मिलता हैं और फिर आपको बुलाते हैं. फिर आकर आप एक एरिया पर लगातार डालते हो, वो बहुत अच्छा लगता है.” यह पूरा इंटरव्यू देखने के लिए आपको बीसीसीआई द्वारा पोस्ट की गई लिंक पर क्लिक करना होगा. यहां से आप बीसीसीआई की वेबसाइट पर पहुंच जाएंगे, जहां पूरा इंटरव्यू देखने को मिल जाएगा.   From making a comeback to whites, claiming a fifer and enjoying Test cricket 🏏 🙌🏻#TeamIndia bowling coach Paras Mhambrey interviews star bowlers @imkuldeep18 and @mdsirajofficial 👌🏻👌🏻 - By @RajalArora Full Interview 🔽https://t.co/QGmNITKFa5 pic.twitter.com/IVR6fy07Y1 — BCCI (@BCCI) December 16, 2022         ये भी पढ़ें... IND vs BAN: पहले टेस्ट शतक के बाद शुभमन गिल का बयान, कहा- यह पारी कई मायनों में मेरे लिए बेहद खास, लेकिन...","content":null,"pubDate":"2022-12-16 16:19:38","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/16/915f0d70e66a2036124e447b9e681b781671205673043582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Thought I may never play cricket again: England’s Ollie Robinson opens up about struggles with form","link":"https://thenewsmill.com/2022/12/thought-i-may-never-play-cricket-again-englands-ollie-robinson-opens-up-about-struggles-with-form/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"England seamer Ollie Robinson said there was a time when he thought that he would not be able to play cricket again after struggling with injury and fitness problems earlier this year. England announced their playing XI for the final Test against Pakistan starting in Karachi on Saturday. The Three Lions make two changes as 18-year-old Rehan Ahmed makes his debut replacing Will Jacks, while Ben Foakes comes in for Jimmy Anderson. The Three Lions are 2-0 up in the series ahead of the final Test. The seamer has played a significant role in England’s tour of Pakistan, picking up eight wickets in the first two Test matches, including the tenth wicket in Multan that helped the visitors to win the three-game series. However, at the beginning of the year, it appeared unlikely that Robinson would play for England because he suffered an injury in the fifth Ashes Test in Hobart in January and was criticised by the former bowling coach Jon Lewis for his lack of professionalism and poor condition. However, at the beginning of the year, it appeared unlikely that Robinson would play for England because he suffered an injury in the fifth Ashes Test in Hobart in January and was criticised by the former bowling coach Jon Lewis for his lack of professionalism and poor condition. “I don’t think I’ve ever needed a kick up the backside, I’ve known what I have needed to do. County cricket is very different to international cricket. It took me maybe took long to get myself where I needed to be for international cricket and the other side of that, me and Jon Lewis had a very honest relationship,” Ollie Robinson was quoted as saying by Skysports.com. “I knew what he said was true before he came out in public and said it. It felt harsh at the time, but in reality it helped get me in the place that I am in now,” he further added. Robinson had many injury issues in the beginning of 2022, but he feels like he is now thriving in the current England lineup. “It was tough, there were days when I would think I wasn’t going to play cricket any more. I would get back to full fitness and play one game and my back would spasm again. I trained really hard in that period and was just unfortunate I couldn’t get back on the park. It took a lot of scans and a few injections to get myself back into the right place,” he said. “With the help of the England medical staff, Jimmy (James Anderson), Stokesy (Ben Stokes), Baz (Brendon McCullum), I have got myself into a really good place and now thriving in this environment,” said the England pacer. England Team: Zak Crawley, Ben Duckett, Ollie Pope, Joe Root, Harry Brook, Ben Stokes (c), Ben Foakes, Rehan Ahmed, Ollie Robinson, Mark Wood, Jack Leach. (ANI) ALSO READ: Iran conducts first known execution over nationwide protests sparked by Amini's death This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-16 15:31:18","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh, 1st Test, Day 3 Highlights: India In Control, Bangladesh 42/0 Chasing 513 At Stumps - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiggFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9iYW5nbGFkZXNoLXZzLWluZGlhLTIwMjItMjMvaW5kaWEtdnMtYmFuZ2xhZGVzaC0xc3QtdGVzdC1tYXRjaC1pbmQtdnMtYmFuLWRheS0zLWxpdmUtc2NvcmUtdXBkYXRlcy0zNjEwNDQ10gGIAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2JhbmdsYWRlc2gtdnMtaW5kaWEtMjAyMi0yMy9pbmRpYS12cy1iYW5nbGFkZXNoLTFzdC10ZXN0LW1hdGNoLWluZC12cy1iYW4tZGF5LTMtbGl2ZS1zY29yZS11cGRhdGVzLTM2MTA0NDUvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Bangladesh, 1st Test, Day 3 Highlights: India In Control, Bangladesh 42/0 Chasing 513 At Stumps  NDTV SportsHighlights India vs Bangladesh 1st Test, Chattogram, Score: BAN Openers Finish Day 3 On High Note  Cricket Country NewsPHOTOS: India set Bangladesh daunting target after Gill, Pujara tons  Rediff.comInd vs Ban 1st Test highlights: Bangladesh 42/0 at stumps on Day 3, need 471 runs to win vs India in Chattogram  Times of IndiaWatch: Kohli's reaction wins hearts as Pujara smashes his fastest Test century  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-12-16 15:08:17","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sydney Thunder bowled out for only 15 runs, lowest total in senior T20 cricket","link":"https://thenewsmill.com/2022/12/sydney-thunder-bowled-out-for-only-15-runs-lowest-total-in-senior-t20-cricket/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Sydney Thunder crumbled in remarkable style on Thursday against Adelaide Strikers as they recorded the lowest score ever seen in a men’s professional T20 cricket history. Playing a match in the Big Bash League, Henry Thornton and Wes Agar bowled sensational spells and ended up picking five wickets and four wickets respectively. Sydney Thunder lost a couple of early wickets due to some brilliance in the field by the Strikers fielders, but Thornton and Agar ripped them apart thereafter. Harry Nielsen ended with five catches and the Thunder batters literally had no answers against the new ball. Only 5.5 overs were needed to bowl out Thunder, the men’s T20 innings had never been shorter. They lost by 124 runs against Strikers, who had won the toss and chosen to bat first amassing 139 for 9. Between them, Thunder’s hitters recorded five ducks, with fast bowler Brendan Doggett leading the way with 4, thanks to an inside edge that raced to the rope. Opting to bat first, Adelaide Strikers scored 140 runs. Chris Lynn (36) and Colin de Grandhomme (33) scored the highest to guide their team to a competitive total. Chasing 140, five of the Sydney Thunder batters were unsuccessful in opening their run tally, while the other three players were dismissed after scoring just one run, Brendan Doggett (4) scored the highest in a never-seen-before collapse. Henry Thornton was the best bowler for Adelaide Strikers, taking up five wickets in 2.5 overs allowing three runs to be scored. As Strikers secured a 124-run victory inside the powerplay. Wes Agar claimed four wickets in his two overs, and Matthew Short also contributed to the wicket total. The 2015 match between the Melbourne Renegades and the Stars produced the lowest Big Bash total ever, which was 57. The Thunder’s 15 is also the lowest professional cricket score since 1983 and is tied for the seventh-lowest all-time. (ANI) ALSO READ: Manoj Prabhakar steps down as head coach of Nepal men's cricket team This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-16 14:31:18","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"Never felt that I didn’t play Test cricket for nearly two years: Kuldeep Yadav","link":"https://indianexpress.com/article/sports/cricket/never-felt-that-i-didnt-play-test-cricket-for-nearly-two-years-kuldeep-yadav-8328781/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-16 14:26:11","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"टी20 क्रिकेट के इतिहास में इन पांच टीमों ने बनाया है सबसे कम टोटल, सिडनी थंडर लिस्ट में नंबर वन","link":"https://www.abplive.com/sports/cricket/know-five-lowest-score-in-history-of-t20-cricket-in-big-bash-league-2022-23-sydney-thunder-made-record-with-15-runs-total-2283783","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Lowest score in T20 cricket: टी20 क्रिकेट में अक्सर बल्लेबाज़ों का राज होता है. इस फॉर्मेट में आपको ताबड़तोड़ बल्लेबाज़ी से लेकर बहुत कुछ देखने को मिलता है. यहां आपको 20 ओवरों में सर्वाधिक स्कोर से लेकर सबसे कम स्कोर भी दिखाई देगा. बिग बैश लीग के 2022-23 के सीज़न में एक ऐसा मैच देखने को मिला, जिसने टी20 क्रिकेट में इतिहास रच दिया. इस लीग में सिडनी थंडर और एडिलेड स्ट्राइकर्स के बीच खेले गए एक मैच में टी20 के इतिहास का सबसे कम टोटल बना. दोनों के बीच खेले गए मैच में रनों की पीछा करने उतरी सिडनी थंडर महज़ 15 रनों पर आलआउट हो गई. आइए जानते हैं टी20 क्रिकेट के इतिहास में बनने वाले पांच सबसे कम टोटोल. 1 थाईलैंड बनाम मलेशिया (2022) इसी साल थाइलैंड और मलेशिया के बीच खेले गए एक टी20 मैच में रिकॉर्ड टोटल में से एक बना था. इस मैच में पहले बल्लेबाज़ी करने उतरी थाईलैंड की टीम 13.1 ओवर में 30 रनों पर आलआउट हो गई थी.  2 टर्की बनाम लक्समबर्ग (2019) 2019 में टर्की और लक्समबर्ग के बीच खेले गए एक टी20 मैच में पहले बल्लेबाज़ी करने उतरी टर्की की टीम महज़ 28 रनों पर ही सिमट गई थी. लक्समबर्ग ने इस मैच को 8 विकटों से जीत लिया था.  3 लेसोथो बनाम युगांडा (2021) लेसोथो और युगांडा के बीच खेले गए एक टी20 मैच में पहले बल्लेबाज़ी करने उतरी लेसोथो की टीम 26 रनों पर ही ऑलआउट हो गई थी. इस मैच में युगांडा ने 10 विकटों से जीत दर्ज की थी.  4 टर्की बनाम चेक गणराज्य (2019) 2019 में टर्की और चेक गणराज्य के बीच खेले गए एक टी20 मैच में 278 रनों का पीछा करने उतरी टर्की की टीम महज़ 21 रनों पर ही सिमट गई थी. इसमें चेक गणराज्य ने 257 रनों से जीत हासिल की थी.  5 सिडनी थंडर्स बनाम एडिलेड स्ट्राइकर्स (2022) बिग बैश लीग (2022-23) में खेले गए सिडनी थंडर्स और एडिलेड स्ट्राइकर्स के बीच खेले गए एक मैच में 139 रनों का पीछा करने उतरी सिडनी थंडर्स महज़ 15 रनों पर सिमट गई. यह टी20 के इतिहास का सबसे कम टोटल बन गया. ","content":null,"pubDate":"2022-12-16 14:06:31","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/16/a49be0f82559587a164f6f2a87e5b08f1671199161835582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"'Embarrassing' Thunder slump to historic low","link":"https://wwos.nine.com.au/cricket/news-2022-big-bash-league-adelaide-strikers-sydney-thunder-collapse-reaction-comments/cb5d70f4-d88b-4998-ae43-4cccfbc6fcf0","keywords":null,"creator":["wwos"],"video_url":null,"description":"The Sydney Thunder have collapsed to the lowest score in professional T20 cricket after they were rolled for just 15 by the Adelaide Strikers.","content":"The Sydney Thunder have collapsed to the lowest score in professional T20 cricket after they were rolled for just 15 by the Adelaide Strikers in their BBL clash at Sydney Showgrounds on Friday night.Five Thunder stars - including England's one-day opener Alex Hales - made ducks, and top scorer Brendan Doggett made just 4﻿.The Strikers used just three bowlers - Matt Short took 1-1 from his single over. While Wes Agar also picked up 4-6 from his two overs.READ MORE: 'Rubbish' technical fault triggers champs 'chaos'﻿READ MORE: 'Spectacular' tradeoff in F1 calendar switch﻿READ MORE: Proteas skipper's ominous Gabba warning﻿But the day belonged to Henry Thornton, who on his 26th birthday ripped through the Thunder to take 5-3 from just 17 balls.The Thunder's 15 takes the mantle as lowest ever T20 ﻿score from the Turkish national side, who were rolled for 21 by the Czech Republic in 2019.The Thunders' woeful performance left commentators and pundits alike in total disbelief.﻿\"Take a screencap of that - because you'll never, ever see this again,\" Fox Cricket commentator Dan Ginnane said after the ninth wicket fell.As Fazalhaq Farooqi walked to the crease with the score at 14, the Thunder needed to make another 43 just to avoid the embarrassment of having the lowest Big Bash score in history, set by the Renegades in 2015.\"I've never seen a game of cricket like this ever,\" Brett Lee said in commentary for Fox Cricket.The game would end one ball after that statement, as Thornton took his fifth wicket - and the tenth of the innings.\"I don't know what they're going to say in the change rooms, but that's very, very embarrassing for the Sydney Thunder - they've been absolutely drilled,\" Lee said.\"The bowling from the Strikers was spot on.\"His old teammate Brad Haddin agreed.https://twitter.com/cricketcomau/status/1603724803940429825?ref_src=twsrc%5Etfwhttps://twitter.com/JofraArcher/status/1603719116153659394?ref_src=twsrc%5Etfwhttps://twitter.com/naveenjrazik/status/1603719633592520704?ref_src=twsrc%5Etfwhttps://twitter.com/DanielCherny/status/1603722123306237952?ref_src=twsrc%5Etfwhttps://twitter.com/BBL/status/1603720957818195968?ref_src=twsrc%5Etfwhttps://twitter.com/CzechCricket/status/1603730083272720385?ref_src=twsrc%5Etfw\"There was some poor dismissals in there, but what it was, it was just quality fast bowling - it was intimidating, they found the edges, and were backed up by the fielding,\" he said.It didn't start badly for the Thunder. After losing the toss and being thrown the ball, they restricted the Strikers to just 139 from their 20 overs.﻿Farooqi was the pick of the bowlers with 3-20 from his four overs, with Gurinder Sandhu, Daniel Sams and Doggett all picking up two each.But that was as good as it got.They lost Matt Gilkes in the first over. Rilee Rossouw and Sangha then fell in the second.In the third over, Hales and Sams were dismissed, before Alex Ross followed in the fourth.Chris Green and Sandhu departed in the fifth, before Ollie Davies and Doggett collapsed in the sixth to end a historic night.﻿ It was also the shortest completed innings - where a team had been bowled out - in T20 history.﻿For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-12-16 12:59:35","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/12/474244/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Fifteen all out: Sydney Thunder collapse to lowest ever Big Bash total - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2RlYy8xNi9maWZ0ZWVuLWFsbC1vdXQtc3lkbmV5LXRodW5kZXItY29sbGFwc2UtdG8tbG93ZXN0LWV2ZXItYmlnLWJhc2gtdG90YWzSAXNodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9kZWMvMTYvZmlmdGVlbi1hbGwtb3V0LXN5ZG5leS10aHVuZGVyLWNvbGxhcHNlLXRvLWxvd2VzdC1ldmVyLWJpZy1iYXNoLXRvdGFs?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Fifteen all out: Sydney Thunder collapse to lowest ever Big Bash total  The GuardianALL OUT FOR 15 ... and ‘it ain’t a misprint’: Historic cricket low in 35-ball BBL ‘carnage’  Fox Sports'Embarrassing' Sydney Thunder slump to historic low against Adelaide Strikers  Wide World of SportsStrikers obliterate Thunder for record-low total | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-12-16 12:30:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Downbeat Pakistan hope to avoid first-ever whitewash at home | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1uZXdzLzEyNDg1MS9kb3duYmVhdC1wYWtpc3Rhbi1ob3BlLXRvLWF2b2lkLWZpcnN0LWV2ZXItd2hpdGV3YXNoLWF0LWhvbWXSAXZodHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjQ4NTEvZG93bmJlYXQtcGFraXN0YW4taG9wZS10by1hdm9pZC1maXJzdC1ldmVyLXdoaXRld2FzaC1hdC1ob21lLWNyaWNidXp6Y29t?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Downbeat Pakistan hope to avoid first-ever whitewash at home | Cricbuzz.com - Cricbuzz  CricbuzzPAK vs ENG Live Telecast In India, PAK vs ENG Live Streaming In India, PAK vs ENG Broadcast Channel In India- Where To Watch Pakistan vs England Live? 3rd Test  Cricket AddictorUncapped Rehan Ahmed named in England XI for Karachi Test  ICC CricketPAK vs ENG: Full-strength Pakistan side starts training to make strategy ahead of Karachi Test  Geo SuperPAK vs ENG Dream11 Prediction 3rd Test: Team Captain, Vice-Captain And Probable XIs, Pakistan vs England 20  News18View Full coverage on Google News","content":null,"pubDate":"2022-12-16 12:29:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"All Out For 15 Runs: Sydney Thunder Record Lowest Team Total Ever In T20s","link":"https://sports.ndtv.com/cricket/sydney-thunder-bowled-out-for-15-runs-in-big-bash-league-match-against-adelaide-strikers-register-lowest-ever-team-total-in-t20-cricket-3613050","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Sydney Thunder recorded the lowest ever team total in the history of T20 cricket, when they were bowled out for 15 runs, while chasing a target of 140 against Adelaide Strikers in the Big Bash League...","content":null,"pubDate":"2022-12-16 12:29:01","image_url":"https://c.ndtvimg.com/2022-12/ednn16o8_sydney-thunder-15-all-out_120x90_16_December_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"5.5 overs, 15 all-out: Sydney Thunder register lowest-ever T20 total in history - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC81NS1vdmVycy0xNS1hbGwtb3V0LXR3aXR0ZXItZ29lcy1iZXJzZXJrLWFzLWJibC1zaWRlLXN5ZG5leS10aHVuZGVyLXJlZ2lzdGVyLWxvd2VzdC1ldmVyLXQyMC1zY29yZS1pbi1oaXN0b3J5LTEwMTY3MTE5MTQ2NzU2NC5odG1s0gGtAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9jcmlja2V0LzU1LW92ZXJzLTE1LWFsbC1vdXQtdHdpdHRlci1nb2VzLWJlcnNlcmstYXMtYmJsLXNpZGUtc3lkbmV5LXRodW5kZXItcmVnaXN0ZXItbG93ZXN0LWV2ZXItdDIwLXNjb3JlLWluLWhpc3RvcnktMTAxNjcxMTkxNDY3NTY0LWFtcC5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"5.5 overs, 15 all-out: Sydney Thunder register lowest-ever T20 total in history  Hindustan TimesSydney Thunder Bowled Out For 15 Runs In Big Bash League Match Against Adelaide Strikers, Register L..  NDTV SportsRecent Match Report - Strikers vs Thunder 5th Match 2022/23  ESPNcricinfoAll out 15!! Strikers sink Thunder to record T20 low | BBL|12  cricket.com.au15 all-out - Sydney Thunder register record low in loss to Strikers | Cricbuzz.com  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-12-16 12:19:12","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sydney Thunder dismissed for 15 in the powerplay, lowest total in men’s T20 cricket","link":"https://indianexpress.com/article/sports/cricket/sydney-thunder-dismissed-for-15-in-the-powerplay-lowest-total-in-senior-t20-cricket-8328622/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-16 12:18:08","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"SLC has a bright future thanks to LPL: Sanath Jayasuriya","link":"https://www.sentinelassam.com/sports/cricket/slc-has-a-bright-future-thanks-to-lpl-sanath-jayasuriya-628423","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"One of the most destructive batters of all-time ?Master Blaster Sanath Jayasuriya had taken up a new role as the Brand Ambassador of the Lanka Premier League 2022.","content":"COLOMBO: One of the most destructive batters of all-time ?Master Blaster Sanath Jayasuriya had taken up a new role as the Brand Ambassador of the Lanka Premier League 2022. He is also a mentor for the Kandy Falcons franchise and is now looking to give something back to the game and help nurture young talent.Sanath Jayasuriya said he is excited about the ongoing season of the LPL and said that it will help in finding and unearthing new talents. He said, \"This tournament is a great addition to the domestic cricket calendar and has found some great talents in Sri Lanka. It gives us an ideal platform to find and nurture the best cricketing talent. LPL is helping the country to build its T20I arsenal. I am sure that Sri Lanka national team will see many players from here, and I believe the national team has a bright future ahead of them.\" Discussing the positive impact of LPL 2022, Anil Mohan, Chairman and Managing Director of IPG Sports, the official promoter of LPL, said, \"The tournament has had a positive impact as we are getting good response from the audience who are coming to the see the matches every day. The atmosphere during the matches is ecstatic, which also lifts the players' spirit on the field and motivates them to give their best every time.\" Talking about the role of IPG in organising the league, the batter said, \"IPG has done a lot of hard work in organizing this league. It's not an easy thing to arrange a tournament of such a large scale like the LPL. We can see that several fans are coming to the stadium, which is a positive sign. I hope it goes from strength to strength.\" Kandy Falcons have won 5 out of 6 matches played and are top of the table. Speaking about the team, he said, \"The team has been performing exceptionally well. Players like Isuru, and Wanindu among others are giving their best. We have so many young players who have impressed. It's a learning curve for the domestic players playing along with international stars who have tons of experience.\" \"I am also talking to the players, giving them advice, whenever they come up to me. I am always there to help them. They are always looking to learn, which is a good thing as you become a better player by learning constantly,\" he concluded. IAN Also Read:  Former Sri Lanka skipper Jayasuriya, Pakistan legend Akram come on board as LPL brand ambassadorsAlso Watch:","pubDate":"2022-12-16 12:16:22","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/16/422051-jaya.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"International League T20 signs five-year title sponsorship deal with DP World","link":"https://www.sentinelassam.com/sports/cricket/international-league-t20-signs-five-year-title-sponsorship-deal-with-dp-world-628422","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The International League T20 (ILT20) on Thursday announced DP World as the title sponsor for its upcoming six-team league in the United Arab Emirates (UAE) for five years.","content":"DUBAI: The International League T20 (ILT20) on Thursday announced DP World as the title sponsor for its upcoming six-team league in the United Arab Emirates (UAE) for five years.The agreement comes as 84 international cricket stars from across the world, such as Andre Russell, Shimron Hetmyer, Moeen Ali, Kieron Pollard and Wanindu Hasaranga, and several shining Associate players, including Paul Stirling, Mark Watt and David Wiese get ready for the inaugural season of the league to held in January. UAE's home-grown T20 competition will be played in Dubai (Dubai International Stadium), Sharjah (Sharjah Cricket Stadium) and Abu Dhabi (Zayed Cricket Stadium) from January 13 to February 12, 2023. IANS Also Read:   Hasaranga, Gurbaz Look Forward To Shine In ILT20Also Watch:","pubDate":"2022-12-16 12:12:14","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/16/422048-dp.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Former Pakistan captain Sana Mir joins FICA Board as an independent director","link":"https://www.sentinelassam.com/sports/cricket/former-pakistan-captain-sana-mir-joins-fica-board-as-an-independent-director-628416","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Federation of International Cricketers’ Associations (FICA) on Thursday announced that former Pakistan captain Sana Mir has joined its Board as an independent director","content":"NEW DELHI: The Federation of International Cricketers' Associations (FICA) on Thursday announced that former Pakistan captain Sana Mir has joined its Board as an independent director, following a full Board meeting held via video conference. Sana, who is now a commentator, has extensive experience in cricket as a premier off-spinner and leader of the Pakistan women's team and is considered one of the greatest women cricketers to have emerged from the country. She has also held various ambassadorships and activist roles at not-for-profit organisations outside of cricket and holds degrees in Mathematics, Statistics and Economics. IANSAlso Read:  'With the conditions in mind, it is hard to look past Pakistan'Also Watch:","pubDate":"2022-12-16 11:58:11","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/16/422041-sanamireps.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"England's Freya Kemp ruled out of Women's T20 World Cup in South Africa","link":"https://www.sentinelassam.com/sports/cricket/englands-freya-kemp-ruled-out-of-womens-t20-world-cup-in-south-africa-628413","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England all-rounder Freya Kemp sustained a stress fracture in her back and has been ruled out of the ICC Women's T20 World Cup in South Africa in February next year","content":"LONDON: England all-rounder Freya Kemp sustained a stress fracture in her back and has been ruled out of the ICC Women's T20 World Cup in South Africa in February next year, the England and Wales Cricket Board (ECB) confirmed on Thursday.The left-arm quick and late-order batter had travelled with the squad to the Caribbean but flew back midway complaining of back pain. She missed the entire three-match ODI series in the West Indies, which England won 3-0. After flying home early, the scans revealed that the 17-year-old has been diagnosed with a stress fracture. \"After receiving further exploratory scans in the UK, it has been confirmed that England Women and Southern Vipers all-rounder Freya Kemp has sustained a stress fracture in her back,\" the ECB said in a statement. IANS Also Read:  T20I: India collapse to hand Australia 21-run winAlso Watch:","pubDate":"2022-12-16 11:51:42","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/16/422037-122.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"THH vs NLS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for ACPL Kenya T20 Cup, Match 12","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/thh-vs-nls-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-acpl-kenya-t20-cup-match-12?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-12-16 11:45:12","image_url":"https://static.sportskeeda.com/editor/2022/12/d4a58-16711729281002-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Report: After Julian Ward, Jürgen Klopp sees yet another Liverpool man leave as exodus continues","link":"https://www.hitc.com/en-gb/2022/12/16/report-after-julian-ward-jurgen-klopp-sees-yet-another-liverpool-man-leave-as-exodus-continues/?utm_source=rss&utm_medium=rss&utm_campaign=report-after-julian-ward-jurgen-klopp-sees-yet-another-liverpool-man-leave-as-exodus-continues","keywords":["Competitions","Football","Liverpool","Premier League","Teams","Ed Rice"],"creator":["Billy Meyers"],"video_url":null,"description":"Liverpool and Jürgen Klopp have waved goodbye to yet another employee in Ed Rice as the Anfield exodus continues, after Julian Ward resigned. What’s the... The post Report: After Julian Ward, Jürgen Klopp sees yet another Liverpool man leave as exodus continues appeared first on HITC.","content":"Liverpool and Jürgen Klopp have waved goodbye to yet another employee in Ed Rice as the Anfield exodus continues, after Julian Ward resigned. What’s the story? Well, there is plenty of uncertainty happening at Liverpool right now. Fenway Sports Group (FSG) have put the Reds up for sale – according to The Athletic. Ward – who took over from Michael Edwards as Director of Football in the summer – also resigned for unknown reasons, in addition to Liverpool’s Head of Research Ian Graham. Club Doctor Jim Moxon has also quit. Now – according to the Liverpool Echo – Partnerships Manager Rice has left Liverpool as well. On this day in 2018, Liverpool beat arch-rivals Manchester United 3-1 at Anfield Sadio Mane Xherdan Shaqiri Some cameo from the powercube that pic.twitter.com/BBik9IwsWN— The Redmen TV (@TheRedmenTV) December 16, 2022 Rice will join Glamorgan Cricket in January as the new Head of Commercial. Rarely have we seen so many resignations in such a short space of time at a Premier League club, so it certainly feels as if something is going on at Anfield. Liverpool eyeing another Rice as Ed departs Coincidentally, Liverpool could be signing Declan Rice in 2023 amid news of Ed Rice leaving. The Telegraph believe Klopp is keen to sign the West Ham No.41 at the end of the season, with the Hammers resigned to losing their captain if someone makes a £70m bid. Rice will only have 12 months remaining on his contract once the current campaign is over, and the Telegraph add that he has no intention of staying at the London Stadium. Photo by Marc Atkins/Getty Images The England international recently spoke of his desire to win major trophies and play Champions League football, suggesting he is keen to take on a bigger challenge in what is encouraging news for Liverpool. While in Qatar, the 23-year-old said: “I see my friends here playing Champions League, winning the big trophies, you only get one career. I’m ambitious and I want to do that.” Be sure to keep an eye on Rice, as he could be moving to Merseyside in 2023. The post Report: After Julian Ward, Jürgen Klopp sees yet another Liverpool man leave as exodus continues appeared first on HITC.","pubDate":"2022-12-16 11:40:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Australia gear-up for pace test from South Africa at Gabba","link":"https://www.sentinelassam.com/sports/cricket/australia-gear-up-for-pace-test-from-south-africa-at-gabba-628404","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Steve Smith and David Warner will be part of the squad when Australia take on South Africa as the two sides meet for the first time since the Sandpapergate scandal","content":"BRISBANE: Steve Smith and David Warner will be part of the squad when Australia take on South Africa as the two sides meet for the first time since the Sandpapergate scandal, the ball-tampering case at the Cape Town Test in 2018.Steve Smith was the captain of the side while Warner was the mind behind the Australian scheme to use sandpaper to change the condition of the ball, which was caught on the television screens. Both of them were handed lengthy punishments. The memories of the darkest period of Australian cricket came to the fore when Warner withdrew his application to lift the lifetime ban on his captaincy. While the Sandpapergate is sure to figure in the banter as the two sides go hard at each other, the immediate concern for Australia is the South African pace battery that their batters have not faced in Tests since 2018. Senior Australian batter Usman Khawaja has raised the issue of facing the South African attack on a track that is likely to support pace. Khawaja never before faced South Africa's fastest bowler, Anrich Nortje, who was clocked sending down the fastest delivery of last year's Indian Premier League (IPL) tournament at 156.2kph. Nortje made his Test debut in 2019, more than a year after Australia and South Africa last met at the Test level in the incendiary campaign of 2018. Khawaja said he has gained the best possible preparation for his maiden encounter by recently doing battle with Australia's own 'wild thing'. The 29-year-old Nortje has been the Proteas' second-most potent Test bowler with Kagiso Rabada in recent times and the pair is expected to provide a significant challenge to Australia's top-order than the modestly medium-paced West Indies, whom they played recently. While the focus will be on Nortje, the bigger threat could be Rabada, whose record of 38 wickets at an average of 20.5 from his seven Tests against Australia places in him rare company among compatriots who are renowned for the quality of their pace attack. Only Mike Procter (41 at 15.02) can claim to have taken Australia wickets at a meaner average (among South Africans to have claimed 20 or more), which puts Rabada ahead of quicks in the calibre of Allan Donald, Shaun Pollock, Dale Steyn and Vernon Philander. But speaking ahead of the opening first Test between the two teams at the Gabba starting on Saturday, Khawaja claimed there was no additional preparation needed to counter the sudden spike in speed he'll be facing, said a report on cricket.com.au. Khawaja was confident going into the match as he was recently part of a Sheffield Shield match playing for Queensland in which they faced a Western Australia bowling line-up led by Lance Morris, widely regarded as the quickest bowler currently operating in Australian domestic cricket and currently part of the national Test squad. \"You've faced express pace your whole life, so it's not about getting ready for it for this series,\" Khawaja said on Thursday when asked how he planned to prepare for the step-up in pace and intensity. \"I was facing Lance Morris a few weeks back and faced Woody (England' Mark Wood) last year. You face guys who bowl rockets all the time, it's just part of the game,\" he was quoted as saying in a release. Khawaja said facing the South Africans won't be a problem. IANS Also Read:   Former Australia skipper Clarke accuses CA of making David Warner a 'complete scapegoat' Also Watch:","pubDate":"2022-12-16 11:36:01","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/16/422017-aust.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"आइसलैंड क्रिकेट ने अश्विन की पूर्व दिग्गज रिचर्ड हेडली और शेन वॉर्न से तुलना कर माचाई खलबली, बताया क्यों हैं टेस्ट में अव्वल","link":"https://www.abplive.com/sports/cricket/iceland-cricket-told-r-ashwin-greatest-test-all-rounder-know-why-he-is-close-to-richard-hadlee-and-shane-warne-2283647","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Iceland cricket on R Ashwin: भारत और बांग्लादेश के बीच खेले जा रहे पहले टेस्ट मैच की पहली पारी में आर अश्विन (R Ashwin) ने अपने करियर का 13वां अर्धशतक जड़ा. उन्होंने 113 गेंदों में 58 रनों की पारी खेली. आर अश्विन ने यह पारी उस वक़्त खेली, जब टीम के सभी बल्लेबाज़ पवेलियन लौट चुके थे. अश्विन की इस पारी में गेंदबाज़ कुलदीप यादव ने भी साथ दिया. कुलदीप ने इस पहली पारी में 40 रन बनाए. दोनों की इस पारी की बदौलत भारतीय टीम पहली पारी में 404 रन बोर्ड पर लगाने में कामयाब हुई. अश्विन की इस पारी के बाद आइसलैंड क्रिकेट ने अश्विन के लिए एक ट्वीट किया, जिसके बाद चारो तरफ खलबली मच गई.  अश्विन की दिग्गजों से की तुलना आइसलैंड क्रिकेट ने ट्वीट करते हुए लिखा, जब लोग महानतम टेस्ट ऑलराउंडरों की सूची बनाते हैं, तो आर अश्विन का नाम शायद ही कभी मौजूद होता है. लेकिन उनके नाम हैडली के समान औसत से लगभग 3,000 रन हैं, जिसमें पांच शतक शामिल हैं. वॉर्न से कम औसत पर लगभग 450 विकेटों का उल्लेख नहीं है.” When people compile lists of the greatest Test all-rounders, Ravi Ashwin's name is rarely present. But he has nearly 3,000 runs at almost the same average as Hadlee, with five centuries. Not to mention nearly 450 wickets at a lower average than Warne. — Iceland Cricket (@icelandcricket) December 15, 2022   आर अश्विन ने अपने टेस्ट करियर में अब तक कुल 86 टेस्ट मैच खेले हैं, जिसमें उन्होंने गेंदबाज़ी कराते हुए 24.13 की औसत से 442 विकेट अपने नाम किए हैं. उनकी औसत दिग्गज शेन वॉर्न से कम है. वहीं बल्लेबाज़ी करते हुए उन्होंने 86 मैचों की 124 पारियों में 27.12 की औसत से 2989 रन बनाए हैं. बल्लेबाज़ी में उनकी औसत रिचर्ड हेडली के काफी करीब है. इसके अलावा अश्विन ने टेस्ट क्रिकेट में नंबर आठ पर बल्लेबाज़ी करते हुए 1700 रन भी पूरे कर लिए हैं. पूर्व भारतीय कप्तान ने सिर्फ यह आंकड़ा छुआ था. ऐसा रहा रिचर्ड हेडली और वॉर्न का करियर गौरतलब है कि न्यूज़ीलैंड के पूर्व दिग्गज ऑलराउंडर रिचर्ड हेडली ने अपने करियर के कुल 86 टेस्ट मैचों की 150 पारियों में 27.16 की औसत से 3124 रन बनाए हैं. वहीं गेंदबाज़ी करते हुए उन्होंने 27.16 की औसत से 431 विकेट झटके हैं. वहीं पूर्व ऑस्ट्रेलियाई फिरकीबाज़ शेन वॉर्न ने 145 टेस्ट मैचों में 25.41 की औसत से 708 विकेट झटके हैं.         ये भी पढ़ें... IND Vs BAN: चार साल के लंबे इंतजार के बाद पुजारा से बल्ले से निकली सेंचुरी, जड़ दिया सबसे तेज शतक","content":null,"pubDate":"2022-12-16 11:33:22","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/16/520ec0cfdc6481e60265517b8249d7e41671190269103582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Tim Southee to take charge as Williamson steps down as New Zealand captain","link":"https://www.sentinelassam.com/sports/cricket/tim-southee-to-take-charge-as-williamson-steps-down-as-new-zealand-captain-628395","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Tim Southee on Thursday joined Australia’s Pat Cummins as the second top pacer to become the captain of a Test side when Kane Williamson stepped down as captain of the New Zealand team.","content":"AUCKLAND: Tim Southee on Thursday joined Australia's Pat Cummins as the second top pacer to become the captain of a Test side when Kane Williamson stepped down as captain of the New Zealand team.Williamson, who captained the Black Caps in 40 Tests, winning 22, drawing eight and losing 10 matches (2 NR) after taking over from Brendon McCullum in 2016, has decided to relinquish the Test captaincy to concentrate on the white-ball game. \"Kane Williamson will step down as captain of the Black Caps Test side, with Tim Southee to take up the leadership mantle,\" the New Zealand Cricket announced on Thursday. Williamson said the time was right to step back. \"Captaining the Black Caps in Test cricket has been an incredibly special\"honour,\" he was quoted by NZC as saying in a release on Thursday. \"For me, Test cricket is the pinnacle of the game and I've enjoyed the challenges of leading the side in the format. Captaincy comes with an increased workload on and off the field and at this stage of my career, I feel the time is right for this decision. \"After discussions with NZC, we felt that continuing to captain the white-ball formats was preferable with two World Cups in the next two years,\" said Williamson. He will continue to be the country's ODI and T20I captain and will play all three formats and extend his full support to Southee. \"I'm excited to support Tim as captain and Tom (Latham) as vice-captain. Having played with both of them for most of my career, I'm confident they'll do a great job. \"Playing for the Black Caps and contributing in all three formats is my number one priority and I'm looking forward to the cricket we have ahead.\" Southee, who played 346 internationals and already captained the T20 side on 22 occasions, will become New Zealand's 31st Test captain when he leads the team on this month's Test tour to Pakistan. The two-Test series starts in Karachi on December 26 and concludes with the match starting in Multan on January 3. New Zealand coach Gary Stead said Williamson had been a fine Test captain. \"Kane's guided the Test team through an immensely successful period which is a testament to his ability to bring people together and work towards a common goal,\" he said. \"He's certainly led from the front with his own performances and that was very much the case during our push to win the World Test Championship. \"We hope by lessening his workload we can continue to see the best of Kane Williamson for longer on the international stage, and we know he will remain a key leader in this group.\" Stead said the decision to appoint Southee captain came down to the direction in which the Test team wanted to head, the NZC release said. \"Tim's a quality leader with a good cricket brain,\" Stead said. \"We've seen his captaincy skills on display with the T20 side and I'm sure he'll continue to bring an aggressive style, whilst still maintaining the core fundamentals of how this Black Caps team operates in the Test arena,\" he added. Southee said he is really excited to lead the Test in Tests as they are the ultimate challenge for a cricketer. \"It's been a surreal few days and it's just a massive honour to be appointed as Test captain. \"I love Test cricket, it's the ultimate challenge and I'm really excited by the opportunity to lead the team in this format. \"Kane's been an outstanding Test captain and I'm looking forward to working with Gary on how we can build on that.\" NZC CEO David White hailed Williamson for the way he's led the Test side. IANS Also Read:  Tim Southee, Trent Boult devastate West Indies battingAlso Watch:","pubDate":"2022-12-16 11:18:23","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/16/421999-nz-copy.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"NCH vs GRB Dream11 Prediction: Fantasy Cricket Tips, Today’s Playing XIs, Player Stats, Pitch Report for CSA One-Day Cup Division 2, Match 14","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nch-vs-grb-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-csa-one-day-cup-division-2-match-14?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-12-16 11:13:31","image_url":"https://static.sportskeeda.com/editor/2022/12/04474-16711707129861-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"}]}