{"newsArray":[{"title":"South Africa vs Netherlands LIVE Score, T20 World Cup 2022: SA aims semifinal berth, toss at 5:00 AM","link":"https://sportstar.thehindu.com/cricket/t20-world-cup/sa-vs-ned-live-score-t20-world-cup-2022-south-africa-netherlands-scorecard-streaming-info-highlights-super-12-adelaide/article66101404.ece","keywords":null,"creator":["\n        Team Sportstar  \n    "],"video_url":null,"description":"Live Score SA vs NED T20 WC Latest Updates: Get live cricket score and updates of the South Africa vs Netherlands T20 World Cup 2022 Super 12 match from Adelaide Oval, Adelaide.","content":null,"pubDate":"2022-11-05 23:26:24","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"England end Australia’s tournament in final over","link":"https://www.cairnspost.com.au/sport/cricket/england-end-australias-tournament-in-final-over/video/577d0a99aac65686136bbcdae84293a8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia is out of the T-20 World Cup after England downed Sri Lanka in a final over thriller, with England scoring the winning runs with 3 balls remaining to end Australia's finals hopes.","content":"Cricket: Australia is out of the T-20 World Cup after England downed Sri Lanka in a final over thriller, with England scoring the winning runs with 3 balls remaining to end Australia's finals hopes.","pubDate":"2022-11-05 21:36:22","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“I will nail it for sure”: Shikhar Dhawan open to doing more movies post retirement from all formats","link":"https://thesportsrush.com/cricket-news-i-will-nail-it-for-sure-shikhar-dhawan-open-to-doing-more-movies-post-retirement-from-all-formats/","keywords":["Cricket","Shikhar Dhawan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Veteran Indian left-handed batter Shikhar Dhawan seems to be quite open on entering the cinema industry as an option post retiring from Cricket altogether. For those unaware, Dhawan recently made his Bollywood debut by playing a cameo role in the movie Double XL, which released in cinema houses on November 4 (Friday), with renowned actresses… The post “I will nail it for sure”: Shikhar Dhawan open to doing more movies post retirement from all formats appeared first on The SportsRush.","content":"Veteran Indian left-handed batter Shikhar Dhawan seems to be quite open on entering the cinema industry as an option post retiring from Cricket altogether. For those unaware, Dhawan recently made by playing a cameo role in the movie , which released in cinema houses on November 4 (Friday), with renowned actresses Huma Qureshi and Sonakshi Sinha playing the lead roles. Huma, who plays the role of an aspiring sports journalist as per the movie trailer, dreams of dancing with Dhawan in a dream sequence. It was in fact Huma’s brother and actor Saqib Saleem, who managed to convince the opener batter to take up the role, to which the latter was more than ready and accepting. During an event organized by the media house named – “ON THE FRONT FOOT: LIFE ON AND OFF THE PITCH”, Shikhar Dhawan was the guest of honour with his picture on the cover page of the India Today magazine edition in the background. Veteran journalist Rajdeep Sardesai, who was hosting the event, listed out the name of a few former cricketers who had given a go to act in some movies in the past. Upon then enquiring Dhawan whether he would consider acting as full time career post retiring from Cricket, the Southpaw batter replied with a degree of certainty and exclaimed, “Absolutely. You never know, so many possibilities are out there and I won’t leave any stone unturned to grab any good opportunity out there. I will go for it, and will nail it for sure.” Earlier, the 36-year-old batter had also remarked that he always had a fond for dancing, particularly to Punjabi music, and that acting comes naturally to him as is evident from quite a few he keeps uploading on the photo-sharing app Instagram. A fun side of Shikhar Dhawan! What is more difficult? Opening for Team India or dancing for a film? responds | — IndiaToday (@IndiaToday) For more Cricket-related news, click","pubDate":"2022-11-05 19:07:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“The most courageous thing to do is walk away from that”: Ricky Ponting lauds Virat Kohli’s decision to take break off from Cricket to bring lost focus back in his game","link":"https://thesportsrush.com/cricket-news-the-most-courageous-thing-to-do-is-walk-away-from-that-ricky-ponting-lauds-virat-kohlis-decision-to-take-break-off-from-cricket-to-bring-lost-focus-back-in-his-game/","keywords":["Cricket","Ricky Ponting","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"As former India skipper Virat Kohli celebrates his 34th birthday today, the Cricket experts and fans in particular, most of who had even started questioning his place in the Indian T20 side not too long ago, sang words of his praises for being the legend that he is in the sport. Having said that, this… The post “The most courageous thing to do is walk away from that”: Ricky Ponting lauds Virat Kohli’s decision to take break off from Cricket to bring lost focus back in his game appeared first on The SportsRush.","content":"As former India skipper Virat Kohli celebrates his today, the Cricket experts and fans in particular, most of who had even started questioning his place in the Indian T20 side not too long ago, sang words of his praises for being the legend that he is in the sport. Having said that, this particular aspect of human nature is not something novel. When someone like a Virat Kohli goes century-less for across formats in international Cricket, nothing less, not even a half-century is accepted as a success as it still falls short of the standards he has set for himself. Thus, despite having the self-belief to trust his process and bank on his ability, Kohli took the bold decision to have around a month-long break from the sport. He spent some quality time with his family, went on a vacation, did not touch his bat all this while, and returned back on the field rejuvenated and with a new perspective and realization about his game, and himself at large. In an interaction with during the Asia Cup 2022 in August, Kohli even admitted to have been trying to fake his intensity on the field with all the talks around his dip in form and century drought as vocal as ever. Just a few days after his aforementioned interaction with the 34-year-old not only smashed his long-awaited , but also brought up his maiden T20I century during India’s last match of Asia Cup 2022 against Afghanistan. Post this knock, King Kohli has just not looked back. At present, he is the in the ongoing T20 World Cup 2022, batting at an unbelievable average of 220.0. Legendary Australian skipper and batter Ricky Ponting, who has dealt with similar reality checks in his international career as well, remarks Kohli’s decision to take break from the game for an entire month, a ‘courageous’ one. “When a certain formula has worked so well for so long, the most courageous thing you can to do is to walk away from that. And for Virat to do that, he also knew he needed to, but it certainly worked for him as well,” stated Ponting. Ponting also remarked that the usual reaction to a dip in form or when not batting the way one would like to is to put in much more hard work. But, that is not how, as Ponting explains, things work in Cricket. “One thing I’ve learnt about champion players, in this game in particular, is that you never write them off.” Ricky Ponting always believed in Virat Kohli’s excellence ✨ | — ICC (@ICC) For more Cricket-related news, click","pubDate":"2022-11-05 18:17:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Those who bemoan ‘irrelevance’ of white-ball cricket are missing point","link":"https://www.theage.com.au/sport/cricket/those-who-bemoan-irrelevance-of-white-ball-cricket-are-missing-point-20221105-p5bvtu.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Geoff Lawson"],"video_url":null,"description":"International T20 competition provides a way to grow the whole game in a way franchise cricket does not, as Ireland, Zimbabwe and Afghanistan have shown at this World Cup.","content":null,"pubDate":"2022-11-05 18:00:00","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"EDK vs MAR Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for ECS Malta 2022, Final","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/edk-vs-mar-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-ecs-malta-2022-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-05 17:54:29","image_url":"https://static.sportskeeda.com/editor/2022/11/d2029-16676513155416-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli’s giant face created by using 5,000 red cricket balls","link":"https://www.tribuneindia.com/news/sports/virat-kohlis-giant-face-created-by-using-5-000-red-cricket-balls-448020","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, November 5Bringing together thousands of Virat Kohli fans, leading sportswear brand Puma, in a unique birthday tribute, created a massive mural of the Indian batting maestro by using 5,000 red cricket balls at Mumbai's Carter Road Amphitheatre on Saturday.A 20ft-by-20ft mural of Kohli's face was created in a marathon nine-hour activity that began at 8 am.\"Virat Kohli is a modern-day cricket legend and has a special place in the fans' heart. He is an inspiration to not only a legion of fans but even the professionals associated with the game.\"It was our endeavour to bring them all together and make it a special birthday celebration for one of the most complete batsmen of this era,\" said Abhishek Ganguly, Managing Director, PUMA India and Southeast Asia.What made the celebration even more special was the presence of Kohli's childhood coach, Rajkumar Sharma.\"It looks amazing and very creative from team PUMA and I will definitely send it to Virat as well. It fills my heart with great pride to see him getting so much love,\" Sharma said.Several other sports personalities who were present at the event included inspirational 94-year-old sprinter Bhagwani Devi, footballer Glan Martins and Anwar Ali, cricketer Anuj Rawat and swimmer Srihari.","content":"PTI Mumbai, November 5 Bringing together thousands of Virat Kohli fans, leading sportswear brand Puma, in a unique birthday tribute, created a massive mural of the Indian batting maestro by using 5,000 red cricket balls at Mumbai’s Carter Road Amphitheatre on Saturday. A 20ft-by-20ft mural of Kohli’s face was created in a marathon nine-hour activity that began at 8 am. “Virat Kohli is a modern-day cricket legend and has a special place in the fans’ heart. He is an inspiration to not only a legion of fans but even the professionals associated with the game. “It was our endeavour to bring them all together and make it a special birthday celebration for one of the most complete batsmen of this era,” said Abhishek Ganguly, Managing Director, PUMA India and Southeast Asia. What made the celebration even more special was the presence of Kohli’s childhood coach, Rajkumar Sharma. “It looks amazing and very creative from team PUMA and I will definitely send it to Virat as well. It fills my heart with great pride to see him getting so much love,” Sharma said. Several other sports personalities who were present at the event included inspirational 94-year-old sprinter Bhagwani Devi, footballer Glan Martins and Anwar Ali, cricketer Anuj Rawat and swimmer Srihari.","pubDate":"2022-11-05 17:41:02","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_422358909.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM T20 World Cup 2022: Melbourne Cricket Ground, Melbourne pitch history and T20I records","link":"https://www.sportskeeda.com/cricket/ind-vs-zim-t20-world-cup-2022-melbourne-cricket-ground-melbourne-pitch-history-t20i-records?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-05 17:17:51","image_url":"https://static.sportskeeda.com/editor/2022/11/ced99-16676489191659-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Sportswear giant creates unique birthday tribute for Kohli","link":"https://www.business-standard.com/article/sports/sportswear-giant-creates-unique-birthday-tribute-for-kohli-122110501399_1.html","keywords":null,"creator":null,"video_url":null,"description":"Bringing together thousands of Virat Kohli fans, leading sportswear brand Puma, in a unique birthday tribute, created a massive mural of the Indian batting maestro by using 5000 red cricket balls at Mumbai's Carter Road Amphitheatre on Saturday. A 20ft-by-20ft mural of Kohli's face was created in a marathon nine-hour activity that began at 8:00 am. \"Virat Kohli is a modern-day cricket legend and has a special place in the fans' heart. He is an inspiration to not only a legion of fans but even the professionals associated with the game. \"It was our endeavour to bring them all together and make it a special birthday celebration for one of the most complete batsmen of this era,\" said Abhishek Ganguly, Managing Director, PUMA India and Southeast Asia. What made the celebration even more special was the presence of Kohli's childhood coach, Rajkumar Sharma. \"It looks amazing and very creative from team PUMA and I will definitely send it to Virat as well. It fills my heart with great pri","content":"Bringing together thousands of Virat Kohli fans, leading sportswear brand Puma, in a unique birthday tribute, created a massive mural of the Indian batting maestro by using 5000 red cricket balls at Mumbai's Carter Road Amphitheatre on Saturday. A 20ft-by-20ft mural of Kohli's face was created in a marathon nine-hour activity that began at 8:00 am. \" Virat Kohli is a modern-day cricket legend and has a special place in the fans' heart. He is an inspiration to not only a legion of fans but even the professionals associated with the game. \"It was our endeavour to bring them all together and make it a special birthday celebration for one of the most complete batsmen of this era,\" said Abhishek Ganguly, Managing Director, PUMA India and Southeast Asia. What made the celebration even more special was the presence of Kohli's childhood coach, Rajkumar Sharma. \"It looks amazing and very creative from team PUMA and I will definitely send it to Virat as well. It fills my heart with great pride to see him getting so much love,\" Sharma said. Several other sports personalities who were present at the event included inspirational 94-year-old sprinter Bhagwani Devi, footballer Glan Martins and Anwar Ali, cricketer Anuj Rawat and swimmer Srihari. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-11-05 17:07:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221105/thumb-122110501399.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM Live Streaming: When and how to watch the T20 WC match in India","link":"https://www.business-standard.com/article/sports/ind-vs-zim-live-streaming-when-and-how-to-watch-the-t20-wc-match-in-india-122110501061_1.html","keywords":null,"creator":null,"video_url":null,"description":"India vs Zimbabwe T20 World Cup 2022 Live Streaming: The Indian team would be looking to get back to winning ways when they take on Zimbabwe at the Melbourne Cricket Ground","content":"Live Streaming of the India vs Zimbabwe T20 World Cup 2022 game is going to be available on the Disney Plus Hotstar app in India. The Indian audience can also watch the match LIVE on the Star Sports Network on their television sets. India saved a scare against Bangladesh in its last game where it was bailed by the opponent’s lack of experience in pressure situations and won the match by 5 runs eventually. However, they would be up against an equally challenging opposition in Zimbabwe, who have played well throughout the tournament except for their last game where they were beaten by the Netherlands. Thus, it is not going to be an easy pass for India. IND vs ZIM T20 World Cup Live Streaming India vs Zimbabwe T20 World Cup will begin at 01:30 pm IST on November 06, 2022. This match can be live streamed on the Hotstar app and watched Live and exclusively on the Star Sports Network on TV in India. When and where would Ind vs Zim T20 World Cup match occur? The T20 World Cup match of the Super 12 stage between India and Zimbabwe will begin at 01:30 pm Indian Standard Time on November 06, 2022, at the Melbourne Cricket Ground, Australia. How can people watch India vs Zimbabwe T20 World Cup match live and exclusive? People can watch Rohit Sharma’s India take on Craig Ervine-led Zimbabwe live and exclusive on Star Sports network on television sets. On SmartPhones and online, today’s India vs Zimbabwe T20 World Cup match can be Live Streamed on the Disney Plus Hotstar app and its website. IND vs ZIM T20 World Cup Pitch Report The Melbourne wicket has offered a lot of help to the bowlers, especially n terms of bounce and swing and hence the fast bowlers will always be in the game. It s not a high-scoring pitch and hence anything between 150-160 could be really tricky. Ind vs Zim T20 World Cup Melbourne weather report After washing out three games, Melbourne could finally have a game without a prior rain warning as the weather forecast has predicted intermittent clouds throughout the evening, but no rain. Thus a full game could be in store for the visitors.","pubDate":"2022-11-05 16:48:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221105/thumb-122110501061.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs BAN Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s PAK vs BAN T20 World Cup 2022 Super 12 in Adelaide, 930 AM IST, November 6","link":"https://zeenews.india.com/cricket/pak-vs-ban-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-pak-vs-ban-t20-world-cup-2022-super-12-in-adelaide-930-am-ist-november-6-2531514.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs Bangladesh Dream11 Team Prediction Pakistan vs Bangladesh T20 World Cup 2022 Super 12 Preview - Check My Dream11 Team, Best players list of PAK vs BAN, Pakistan Dream11 Team Player List, Bangladesh Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Pakistan will take on Bangladesh in a do-or-die match which is also their final Super 12 clash of ther T20 World Cup 2022 on Sunday (November 6). The match between Babar Azam's Pakistan and Shakib Al Hasan's Bangladesh will be played at the Adelaide Oval in which the Men in Green need to win the fixture in order to keep their qualification hopes alive. With two wins from four games, Pakistan are behind India and South Africa in the Group 2 points table. (T20 World Cup 2022 Group 2 points table: How can India, Pakistan and South Africa qualify for semifinals? Check HERE) Babar Azam's Pakistan defeated South Africa in their second-last clash of the group stage of T20 World Cup 2022 on Thursday (November 3) by 33 runs via DLS method to keep their hopes alive in the tournament. Now the situation for them is tricky as they would hope either India or South Africa lose their remaining fixtures and along with that they need to win their own clash against Bangladesh as well. The win against South Africa was a combined effort of Mohammad Haris, Iftikhar Ahmed, and Shadab Khan with the bat that saw them post a mammoth 185 for 9 in 20 overs. PAK vs BAN Dream11 Team Prediction Captain: Mohammad Rizwan Vice-Captain: Shakib Al Hasan Suggested Playing XI for PAK vs BAN Dream11 Fantasy Cricket Wicketkeepers: Mohammad Rizwan, Nurul Hasan Batters: Babar Azam, Shan Masood, Litton Das Allrounders: Shadab Khan, Mohammad Nawaz, Shakib Al Hasan Bowlers: Shaheen Afridi, Haris Rauf, Taskin Ahmed Pakistan vs Bangladesh Possible XIs Pakistan Predicted Line-up: Babar Azam (c), Mohammad Rizwan (wk), Iftikhar Ahmed, Shadab Khan, Mohammad Harris, Shan Masood, Mohammad Nawaz, Mohammad Wasim, Shaheen Afridi, Haris Rauf, Naseem Shah Bangladesh Predicted Line-up: Litton Das, Shakib Al Hasan (c), Najmul Hossain Shanto, Afif Hossain, Yasir Ali, Nurul Hasan (wk), Mosaddek Hossain, Taskin Ahmed, Hasan Mahmud, Shoriful Islam, Mustafizur Rahman","pubDate":"2022-11-05 16:28:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe T20 record: IND vs ZIM win percentage in T20I history","link":"https://thesportsrush.com/cricket-news-india-vs-zimbabwe-t20-record-ind-vs-zim-win-percentage-in-t20i-history/","keywords":["Cricket","ICC T20 World Cup 2022","India","Zimbabwe"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Set to face each other for the first time in the eight editions of the T20 World Cup, India and Zimbabwe will play the last tie of the ‘Super 12’ stage of the ongoing T20 World Cup 2022, at the iconic Melbourne Cricket Ground (MCG) on Sunday (tomorrow). Except in case of an upset or… The post India vs Zimbabwe T20 record: IND vs ZIM win percentage in T20I history appeared first on The SportsRush.","content":"Set to face each other for the first time in the eight editions of the T20 World Cup, India and Zimbabwe will play the last tie of the ‘Super 12’ stage of the ongoing T20 World Cup 2022, at the iconic Melbourne Cricket Ground (MCG) on Sunday (tomorrow). Except in case of an upset or two during the two contests earlier in the day, team India will find themselves in a much-win situation tomorrow in order to advance through to the semi-final stage of the Cup. As for Rohit Sharma’s men, it will be about putting up a dominant show, which has been a slight cause of concern for them despite topping the group at present with 3 wins out of 4 matches so far. As for Zimbabwe, who had a decent enough opportunity to make it through to the final-4 as well after humbling Pakistan earlier, have faced back-to-back losses against Bangladesh and then Netherlands to almost crash out of the tournament. Only a hefty, one-sided win against India tomorrow, preceded by a Pakistan loss versus Bangladesh earlier will come to their almost improbable rescue. India have played only a total of three away bilateral T20I series against Zimbabwe in 2010, 2015, and finally in 2016. They had won the 2010 series 2-0 (two-match series), drew the 2015 series 1-1 (two-match series), and again won the 2016 series 2-1 (three-match series). Thus, head-to-head, team India have won five of the seven T20Is against Zimbabwe, while lost on a couple of occasions. Rohit Sharma (10 runs in 2 innings), Virat Kohli (26* runs in 1 inning), Ravichandran Ashwin (2 wickets in 2 innings), Yuzvendra Chahal (3 wickets in 3 innings), Bhuvneshwar Kumar (2 wickets in 2 innings), Axar Patel {51 runs (3 innings) and 6 wickets (5 innings)}, and KL Rahul (69 runs in 3 innings) are the players from the present Indian World Cup squad, who have played against Zimbabwe in the format before. Tendai Chatara (1 wicket in 2 innings), Craig Ervine (39 runs in 3 innings), Sikandar Raza (39 runs in 4 innings), and Sean Williams (17 runs and 1 wicket in 1 inning) are the players from the present Zimbabwe World Cup squad, who have played against India in the format before. India has a win percentage of 71.43% against Zimbabwe in the T20I format (across 7 matches).","pubDate":"2022-11-05 16:23:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kohli would have been successful against 1980s Windies pace attack: Kim Hughes","link":"https://www.orissapost.com/kohli-would-have-been-successful-against-1980s-windies-pace-attack-kim-hughes/","keywords":["Sports","virat kohli"],"creator":["Post News Network"],"video_url":null,"description":"Melbourne: With his technique and temperament, Virat Kohli would have held his own against the likes of Malcolm Marshall and Michael Holding had he played in the late 1970s and 80s, feels former Australian captain Kim Hughes. The general standard of Test match batting, though, has “deteriorated in current times”, according to the former skipper. […]","content":"Melbourne: With his technique and temperament, Virat Kohli would have held his own against the likes of Malcolm Marshall and Michael Holding had he played in the late 1970s and 80s, feels former Australian captain Kim Hughes. The general standard of Test match batting, though, has “deteriorated in current times”, according to the former skipper. Hughes, who played 70 Tests and also captained Australia during a critical phase, was considered to be a very stylish batter from the late 70s till mid 80s, before he quickly faded out after a slump in form. “Virat Kohli would be a world class player in any era because he is tough, got a fantastic technique, and plenty of courage. He would do well in any era,” the 68-year-old Hughes told PTI in an interview. For Hughes, there is no one bigger and better than Sir Vivian Richards but Kohli would come just in the next bracket. “Kohli would have been equally successful against the West Indies team of 70s and 80s. Maybe, he is not in the class of Viv, but suddenly in the top echelon. “Viv was above everybody else, but Virat is certainly in the league of Greg Chappell, Allan Border and Javed Miandad, the best in my era,” said the man, who had 4000 plus Test runs. Hughes, who has nine Test hundreds apart 22 half-centuries, feels that having an average of 50 plus isn’t a big deal in these times. But, back in the day, it was a kind of novelty due to the kind of pace attack the top teams had. “Only great players in my era averaged 50, and there were only half a dozen at max,” said Hughes, whose own average was around 38, even though there were few who had the style and flair like him. He gave a technical example. “In late 70s and mid 80s, only batter who could hit a pacer for six over extra cover consistently was Viv. And now even my nine-year-old grandson could hit a six. “No team now have four great fast bowlers like the West Indies of yore had and in our era, only Viv, Greg (Chappell), AB (Border) and Javed Miandad were four great players. They averaged 50 plus,” he added. “The players now, I am sorry are not in the league of Viv, Greg, Javed and Allan.”   Reason for decline in Test match batting ======================== Hughes feels that T20 cricket is one of the biggest reasons for current day batters facing technical problems. “T20 overs cricket has led to deterioration of technique of lot of batters as they get on the front-foot. Big bats, short boundaries, and mistimed shots are going for sixes. “Most of the Test batsmen in this era wouldn’t know what the backfoot looks like. Because of limited overs cricket, they just lunged on the front-foot and are sorted out by good bowlers,” he reasoned. Hughes feels that among the younger generation of batters, Cameron Green has a solid backfoot play, and with his all-round skills would be the “best all-rounder” in the days to come.   Cricket Australia and its ‘deplorable’ ways ========================== Hughes isn’t exactly a great fan of Cricket Australia and the manner in which it has handled some of the recent controversies. He cited three examples – sandpaper gate, David Warner’s future captaincy issue, and the Justin Langer exit episode. “I think the manner in which Cricket Australia handled sandpaper incident was poorly. Former CEO James Sutherland didn’t speak about it for three days. “He should have got on the plane instantly and got to South Africa and told the cricket manager and captain that ‘no one says anything till I reach’.” If sandpaper gate was bad, the way Langer had to leave the Australia head coach’s job was worse. “The Langer situation was handled absolutely deplorably. After they beat England and then decided to procrastinate and then had audacity to offer him six-month contract rather than ask him to do the World Cup (last edition in UAE). I think, they treated Justin Langer disgracefully,” he sounded rather angry. He also feel that CA’s stand on seeing Warner as a potential captain smacks of double standards. “They also handled David Warner situation very poorly and he hasn’t been in newspaper articles and media with respect to sandpaper and other people involved in it as well. “Yes, it’s not right and David has taken it on the chin. Smith was responsible as captain. He is now eligible, and David isn’t.”   Don’t see Cummins playing T20s after this edition ============================== Playing three formats along with league cricket isn’t feasible in this day and age, and hence, Pat Cummins is unlikely to play more T20Is post this World Cup, opined Hughes. “After this T20 World Cup, I think that Pat won’t play too many T20Is for Australia. He doesn’t need to play that and he needs to have a break. “He would play the odd 50-over game and some youngsters are coming up, so he should let them play and he would focus on Tests particularly going to England,” he said. Alcohol addiction and turning into mental health coach ================================= The last two years have been challenging for Hughes, who saw a downward spiral during the first COVID wave, when he drowned himself in alcohol and needed counselling and rehabilitation. “It just did,” he paused for a moment and said. “COVID came along and there was no corporate speaking but that’s not an excuse. It sneaks up suddenly and you don’t realise. Drinking or being around alcohol was much a part of my life as it is with a lot of Australian men. “We don’t talk about things,” said the man, whose cover drives were as much a fad as his blonde curly hair. For Hughes, more than his 9 hundreds and Test best of 213, the greatest “century” is being off alcohol for 101 weeks. “Yes, today it is 101 weeks without drinking alcohol. I was going down the wrong path, and went into a rehab on advice of my son, and it’s the greatest century I have ever scored. 101 weeks, and I haven’t missed a drink,” he laughed. “That’s the best thing that has happened to me. I can talk to people on ways to overcome on how to overcome alcohol or drug addiction, gambling. I work a lot on mental well being and mental health. I am a mental health coach.” The brighter side of COVID was that his three sons and daughter gave birth to five grandchildren in the last 20 months. “COVID has proved to be productive for Team Hughes,” he burst out laughing. And how he is doing financially? “Well, I am going okay, I am not a millionaire, but I live in the greatest place in the world and that’s Australia,” he signed off. PTI","pubDate":"2022-11-05 16:23:10","image_url":"https://www.orissapost.com/wp-content/uploads/2022/02/Virat-Kohli-1-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"RG Baruah Cricket: Kabir Hussan hits century against Bajali","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/rg-baruah-cricket-kabir-hussan-hits-century-against-bajali-621820","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Hussan (110) and a half century from Jyotishman (53) guided Barpeta to big total in their first innings against Bajali on the opening day of the RG Baruah Cricket","content":"Sports Reporter GUWAHATI: A nice century from Kabir Hussan (110) and a half century from Jyotishman (53) guided Barpeta to big total in their first innings against Bajali on the opening day of the RG Baruah Cricket at the Nehru Stadium here today. Barpeta declared their first innings 374-9 and later they restricted Bajali 77-8 in their first innings at stumps on Day I. Saurav Ojah and Dipankar Paul collected four and three wickets each giving away seven runs respectively. Debashish (45) was the top scorer for Bajali in the first innings. In another game at Amingaon Silchar were bowled out 148 in the first innings. Ayush Dutta (40) was the top scorer and Deep Singh bagged 4-46. In reply Lakhipur were 115-7 at stumps on day I. Adi Dey collected 4 wickets giving away 28 runs. Also Read: ASBC Asian Elite Boxing Championships: Thapa, Kumar, Sachin advance into quarters Also Watch:","pubDate":"2022-11-05 15:56:43","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/05/409671-best-cricketbat-3.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Public interest litigation (PIL) over removal of Sourav Ganguly as BCCI President","link":"https://www.sentinelassam.com/sports/cricket/public-interest-litigation-pil-over-removal-of-sourav-ganguly-as-bcci-president-621819","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"PIL has been filed at Calcutta High Court against the removal of former Indian cricket team captain Sourav Ganguly as the BCCI President.","content":"KOLKATA: A public interest litigation (PIL) has been filed at Calcutta High Court against the removal of former Indian cricket team captain Sourav Ganguly as the Board of Control for Cricket in India (BCCI) President. The PIL, filed by advocate Ramaprasad Sarkar, is likely to be heard on Tuesday. Sarkar's argument is that Ganguly was removed from the BCCI chief's post despite there was a clear order from the Supreme Court that he could continue in that chair for another three years. IANS. Also Read: ASBC Asian Elite Boxing Championships: Thapa, Kumar, Sachin advance into quarters Also Watch:","pubDate":"2022-11-05 15:52:28","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/05/409670-sourav-ganguly-1658329818-2-1667583221.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Aussie edge Afghans, rely on Lanka to stay alive","link":"https://www.sentinelassam.com/sports/cricket/t20-world-cup-aussie-edge-afghans-rely-on-lanka-to-stay-alive-621817","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Gulbadin Naib and Ibrahim Zadran were leading Afghanistan to a famous win with their 59-run stand off 46 balls for the third wicket.","content":"ADELAIDE: Australia managed to survive a late cameo from Rashid Khan to edge Afghanistan by four runs in their final Group 1 match in Super 12s of Men's T20 World Cup at the Adelaide Oval on Friday. After Glenn Maxwell made an unbeaten 54 off 32 balls to carry Australia to a competitive 168/6, Gulbadin Naib and Ibrahim Zadran were leading Afghanistan to a famous win with their 59-run stand off 46 balls for the third wicket. But Australia made a comeback, triggering an Afghanistan collapse from 99/2 to 103/6. But Rashid kept the fight alive for an improbable victory with a 23-ball 48, hitting three fours and four sixes at a strike rate of 208.7. But he had too much to do in the end for a famous victory, even though he gave Australia an almighty scare as Afghanistan ended at 164/7 in 20 overs. Australia now need Sri Lanka to beat England at the Sydney Cricket Ground on Saturday to give the hosts and defending champions a ticket to the semifinals. In a batting line-up where captain Aaron Finch and finisher Tim David were missing due to hamstring injuries, Maxwell hit six fours and two sixes at a strike rate of 168.75 and found some support from Mitchell Marsh (45 off 30 balls) to give something to defend for their bowlers. Australia's total also meant that New Zealand became the first team to officially qualify for the semifinals of the tournament from Group 1. Pushed into batting first, David Warner had a rollicking start with four boundaries in the first two overs. Despite Cameron Green falling cheaply, Warner and Marsh were looking really good for getting big scores. But Warner was cleaned bowled by Naveen-ul-Haq while going for an outrageous switch hit and Steve Smith was also trapped lbw to fall cheaply in the final over of the Power-play. Marsh batted well and even took a six as well as two fours off Gulbadin Naib in the ninth over. But he fell five short of his half-century as top-edge on slog-sweep was caught by the keeper off Mujeeb Ur Rahman. In trouble at 86/4 in 10.4 overs, Maxwell entered the stage and batted superbly for a 53-run stand off 29 balls with Marcus Stoinis (25 off 21 balls) for the fifth wicket. The duo scored their runs quickly through boundaries and helped Australia aim for a big score. Though Afghanistan took out Stoinis, stand-in captain Matthew Wade, Pat Cummins and Kane Richardson in quick succession, Maxwell ensured that his 29-ball fifty got Australia cross 160-mark. In the chase, Rahmanullah Gurbaz got Afghanistan off to a quick start and was looking dangerous but Kane Richardson struck in his opening over to send him back for a 17-ball 30 while Josh Hazlewood took out Usman Ghani cheaply. Naib and Zadran joined forces to power Afghanistan's charge for a famous win. While Naib hit a quickfire 23-ball 39, hitting three fours and two sixes, Zadran supported him in the third wicket stand with 26 off 33 balls. But Afghanistan lost a flurry of wickets, getting Australia back into the contest. Naib was run out by a direct hit from Glenn Maxwell in the deep before Adam Zampa removed Ibrahim Zadran and Najibullah Zadran while Josh Hazelwood removed Mohammad Nabi, as Australia saw hopes of bowling out Afghanistan. Rashid hit some late boundaries to ensure Afghanistan were in the reckoning for a late win. After Darwish Rasooli was run-out in the 19th over, Australia were able to defend 22 off the final over despite Rashid hitting two fours and a six against a bowling attack minus Mitchell Starc which needed to bowl out Afghanistan for 106 or less to overhaul England's net run rate. Brief scores: Australia 168/8 in 20 overs (Glenn Maxwell 54 not out, Mitchell Marsh 45; Naveen-ul-Haq 3-21, Fazalhaq Farooqui 2-29) beat Afghanistan 164/7 in 20 overs (Rashid Khan 48 not out, Gulbadin Naib 39; Adam Zampa 2-22, Josh Hazlewood 2-33) by four runs. IANS Also Read: Disappointing that ODI Super League is not going ahead: Netherlands captain Scott Edwards Also Watch:","pubDate":"2022-11-05 15:44:48","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/05/409668-04maxwell.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies cricketer Vivian Richards appointed brand ambassador of Lanka Premier League (LPL) 2022","link":"https://www.sentinelassam.com/sports/cricket/west-indies-cricketer-vivian-richards-appointed-brand-ambassador-of-lanka-premier-league-lpl-2022-621815","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Richards said he is excited to get to Sri Lanka, a country where he has always received “huge praise and love” from the cricket fans.","content":"COLOMBO: Legendary West Indies cricketer Vivian Richards has joined the Lanka Premier League (LPL) 2022 as its brand ambassador, giving a big boost to the third edition of the tournament to be played from December 6-23. Richards said he is excited to get to Sri Lanka, a country where he has always received \"huge praise and love\" from the cricket fans. \"I am delighted to be the brand ambassador of the third edition of the LPL and want to say that this tournament is unearthing some great talents in Sri Lanka. We saw the power of Sri Lankan cricket in the Asia Cup this year and LPL certainly has a part to play in that success. I have seen the last two editions of this tournament and the quality of cricket was sublime and I am sure that players will maintain it in the upcoming edition as well,\" said Richards. \"I get great love from the Sri Lankan people and love this country. I am really excited to get to Sri Lanka for the upcoming season of the LPL, especially after the way this country and its people have overcome the tough times recently. The upcoming edition of the tournament will also put a smile back on the faces of the people of this great country. I am sure it will be a huge success.\" Apart from giving a platform to young Sri Lankan players, the tournament has been a huge success in terms of viewership as well. \"We are pleased to announce one of the finest batters of all time, Vivian Richards as brand ambassadors for the 2022 LPL. Having someone like Sir Richards will boost the league and attract more followers from the whole world, and help in our quest to make this tournament a global cricketing attraction. I am really excited to see great Sri Lankan talents on display in the league,\" said Anil Mohan, chairman of IPG Group and founder of LPL. IANS Also Read: Net run rate not on our mind; we will only focus on our game in tie v Sri Lanka, says batter Alex Hales Also Watch:","pubDate":"2022-11-05 15:37:11","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/05/409666-viv-richards-1667579403162184437a5ba5large.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Net run rate not on our mind; we will only focus on our game in tie v Sri Lanka, says batter Alex Hales","link":"https://www.sentinelassam.com/sports/cricket/net-run-rate-not-on-our-mind-we-will-only-focus-on-our-game-in-tie-v-sri-lanka-says-batter-alex-hales-621810","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"With New Zealand, for all practical purposes, becoming the first team from either group to secure a semifinal berth following their 35-run victory over Ireland at the Adelaide Oval","content":"SYDNEY: England will focus on their game rather than be overly bothered about improving their net run rate (NRR) when they take on Sri Lanka in their last Super 12 game of the ICC T20 World Cup at the Sydney Cricket Ground (SCG) on Saturday, their opening batter Alex Hales has said. With New Zealand, for all practical purposes, becoming the first team from either group to secure a semifinal berth following their 35-run victory over Ireland at the Adelaide Oval on Friday, the England vs Sri Lanka match tomorrow becomes huge for Jos Buttler's side as a loss will send Australia into the last-four if they defeat Afghanistan today. If both England and Australia win their respective fixtures, it will come down to NRR, where Buttler's side has a huge advantage. Both England and Australia are on five points, though the latter have a dismal NRR. Asked if his team will be keeping an eye on NRR rate going into the game against Sri Lanka, Hales said, \"It's always a big thing, isn't it, but I think ours are looking pretty good. I'm not sure exactly what it is; I think Australia have to win by 60 runs and we have to have a tight game or something like that. That's what the guys have been saying around the camp. \"I think we're just going to focus on us. As long as we put in a good performance, we all play well, then it should take care of itself,\" added Hales. The mood in the England camp is quite positive, indicated Hales, following their 20-run win against the Kiwis in their previous fixture. \"Yeah, it's (mood) been pretty good. Obviously a great win against New Zealand , a really tight game and a tight contest. Hopefully should set us up well for the rest of the tournament. Yeah, we enjoyed a nice day off yesterday (Thursday), and everyone is feeling confident and looking forward to tomorrow (Saturday).\" IANS Also Read: Still looking for that little bit of rhythm: Skipper Kane Williamson Also Watch:","pubDate":"2022-11-05 15:20:34","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/05/409661-jos-butler-16673020033x2.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"No favourites in 'good to watch' World Cup: Ross Taylor","link":"https://www.iol.co.za/sport/cricket/international/no-favourites-in-good-to-watch-world-cup-ross-taylor-b6ea21ec-65ac-4365-b86b-bd3f15ade1a3","keywords":null,"creator":["AFP"],"video_url":null,"description":"According to former New Zealand batsman Ross Taylor, South Africa have the best bowling line-up at the T20 Cricket World Cup in Australia.","content":null,"pubDate":"2022-11-05 15:16:42","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/3b86985e-da20-5dc7-8baf-a6ac288f6d48&operation=CROP&offset=0x189&resize=3614x2030","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe head to head in T20 history: IND vs ZIM T20 head to head records and stats","link":"https://thesportsrush.com/cricket-news-india-vs-zimbabwe-head-to-head-in-t20-history-ind-vs-zim-t20-head-to-head-records-and-stats/","keywords":["Cricket","ICC T20 World Cup 2022","India","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The 42nd match of the ongoing eighth edition of ICC T20 World Cup will be played between India and Zimbabwe in Melbourne tomorrow. Having faced each other in a three-match ODI series earlier this year, India and Zimbabwe will be locking horns in the shortest format after more than six years. The last T20I between… The post India vs Zimbabwe head to head in T20 history: IND vs ZIM T20 head to head records and stats appeared first on The SportsRush.","content":"The 42nd match of the ongoing eighth edition of ICC T20 World Cup will be played between India and Zimbabwe in Melbourne tomorrow. Having faced each other in a three-match ODI series earlier this year, India and Zimbabwe will be locking horns in the shortest format after more than six years. The last T20I between these two teams had resulted in a thrilling finish after India managed to defend 139 runs by just three runs. In what will be the first-ever India-Zimbabwe T20I outside of Zimbabwe, it will also witness these two teams playing each other for the first time in a T20 World Cup. India, who have already been part of two close finishes in this round, would neither be wanting to take another game down to the wire nor be wanting to register a defeat to bring teams below them on the into contention for qualifying to the next round. Irrespective of the margin, an Indian victory will see them playing against England in the second semi-final at the Adelaide Oval on Thursday. Already knocked out of the tournament, Zimbabwe will be eyeing defeating India for the third time in this format. Having put on display immense potential in this World Cup, Zimbabwe wouldn’t get a bigger validation and acceptance than by defeating arch-rivals Pakistan and India in a World Cup. Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-11-05 15:11:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe pitch report MCG: Melbourne Cricket pitch report batting or bowling for tomorrow match","link":"https://thesportsrush.com/cricket-news-india-vs-zimbabwe-pitch-report-mcg-melbourne-cricket-pitch-report-batting-or-bowling-for-tomorrow-match/","keywords":["Cricket","India","MCG","Melbourne Cricket Ground","Zimbabwe"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Team India have arrived at the iconic Melbourne Cricket Ground (MCG) yet again. The venue, hosted the once-in-a-lifetime kind of a helluva contest between India and Pakistan two weeks ago, and which the Indian fans are not going to forget anytime soon. The nail-biting win in that contest is the reason why the Indian side… The post India vs Zimbabwe pitch report MCG: Melbourne Cricket pitch report batting or bowling for tomorrow match appeared first on The SportsRush.","content":"Team India have arrived at the iconic Melbourne Cricket Ground (MCG) yet again. The venue, hosted the once-in-a-lifetime kind of a between India and Pakistan two weeks ago, and which the Indian fans are not going to forget anytime soon. The nail-biting win in that contest is the reason why the Indian side has been than most of the other teams across both the groups, pertaining the race towards the semi-final. Thus, during the 42nd and last match of the ‘Super 12’ stage of the ongoing T20 World Cup 2022, India will lock horns against Zimbabwe at the MCG on Sunday (tomorrow). The contest will in all likelihood, be a virtual knock-out fixture for Rohit Sharma’s men as far as the remaining slots in the semi-final berths is concerned. However, in case of a loss suffered by either of South Africa or Pakistan during their respective matches earlier in the day, India will automatically qualify for the semis, as they currently sit at the top of their group’s with 6 points. With rain having washed-off three matches of the ongoing World Cup at the MCG this World Cup, apart from the India-Pakistan thriller, only the Ireland versus England ‘Group 1’ match could somehow fetch a result with the former winning the rain-interrupted contest by 5 runs (DLS method). However, with the rain Gods unlikely to make an appearance tomorrow, we are in for an exciting finish to the ‘Super 12’ stage of the Cup. As for the pitch at the ‘G’ tomorrow, it is the fast bowlers who have dictated terms here in the two complete matches so far, picking 21 wickets at an economy rate of 7.52 runs per Over. The at this venue has further encouraged the pacers to bowl short at this surface, with the added bonus of decent seam movement and carry off the deck. Thus, while the fresh pitch tomorrow will yet again act as a fast bowler’s delight, do expect the batters to have a crack in after spending some minutes at the crease as well. Scores in the vicinity of the 160-run mark might well prove to be a winning total after batting first.","pubDate":"2022-11-05 15:08:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Syed Mushtaq Ali Trophy: Mumbai survive a scare, beat Himachal Pradesh in a nerve wreaking final to be crowned champions","link":"https://www.firstpost.com/firstcricket/sports-news/syed-mushtaq-ali-trophy-mumbai-survive-a-scare-beat-himachal-pradesh-in-a-nerve-wreaking-final-to-be-crowned-champions-11578371.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Syed Mushtaq Ali Trophy: Mumbai survive a scare, beat Himachal Pradesh in a nerve wreaking final to be crowned champions","content":"Sarfaraz Khan held his nerves in a nail-biting Syed Mushtaq Ali Trophy final to guide Mumbai to beat Himachal Pradesh by three wickets and clinch their maiden title at the Eden Gardens on Saturday.Sarfaraz Khan hit two boundaries and a maximum off Kanwar Singh’s 19th over and reduced the equation to six runs from six balls.Mumbai eventually chased down a below-par target of 144 with just three balls to spare as Tanush Kotian hit a winning six toward fine leg on the third ball, after the first two balls fetched two runs.Himachal Pradesh had a star-studded Mumbai batting lineup under pressure as they choked them for runs and kept taking wickets at regular intervals.WHAT. A. FINISH!WHAT. A. WIN!Mumbai overcame a stiff challenge from the spirited Himachal Pradesh side to seal a thrilling victory to win their maiden #SyedMushtaqAliT20 title.Scorecard https://t.co/VajdciaA1p#HPvMUM | #Final | @mastercardindia pic.twitter.com/t3WRR0wET1— BCCI Domestic (@BCCIdomestic) November 5, 2022 Shreyas Iyer steadied the innings with a 26-ball 34, but his dismissal in the 14th over opened the doors for Himachal’s comeback.Vaibhav Arora starred with the ball, bagging three wickets for 27, whereas Rishi Dhawan and Mayank Dagar picked two wickets each.Earlier, Himachal were rattled with some brilliant bowling as none of the top-order batters were able to score past 25. Ekant Sen, who came out to bat at number eight, scored 37 to take Himachal to a respectable total of 143/8 at the end of 20 overs. !Celebrations begin as the @ajinkyarahane88-led Mumbai lift their maiden #SyedMushtaqAliT20 title.Scorecard https://t.co/VajdciaA1p#HPvMUM | #Final | @MumbaiCricAssoc | @mastercardindia pic.twitter.com/D4HH8aakmB— BCCI Domestic (@BCCIdomestic) November 5, 2022Mumbai’s Mohit Avasthi (3/21) and Kotian (3/15) decimated the Himachal batting lineup.Ajinkya Rahane failed to impress with the bat once again, but his captainship in the final and throughout the tournament was a strong pillar on which the Mumbai team thrived.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-05 15:08:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Ajinkya-Rahane.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: India likely to face England in semi-finals in Adelaide","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-india-likely-to-face-england-in-semi-finals-in-adelaide-11578281.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup: India likely to face England in semi-finals in Adelaide","content":"India are set to face a stiff challenge in the T20 World Cup semi-finals in form of the English side at the Adelaide Oval on 10 November, Thursday.England won their last group encounter against Sri Lanka and qualified for the semi-finals alongside New Zealand.However, India will have to beat Zimbabwe in their last group match and confirm their place at the top of the table on Sunday.India are currently placed on the top of Group 2 points table and are likely to finish there after South Africa lost to Pakistan by 33 runs in a rain-interrupted match last Thursday. India are considered favourites against Zimbabwe and are expected to beat them without any significant difficulties.The team to top group 2 is supposed to face the second-ranked team from group 1, and hence, England who have qualified as the second-ranked team from group 1 in all likelihood will face India.Graeme Swann, speaking for broadcasters Star Sports said, “India would have preferred to face Australia in the semi-finals. Facing England will be a bit more challenging for them.”The T20 World Cup has however seen too many upsets, and India vs Zimbabwe has an equal probability to end on unexpected lines. If that does happen, India’s qualification to the semi-finals will depend on other results.If India finishes second in the group, India will face their ICC event nemesis New Zealand in the semi-finals.New Zealand is likely to face South Africa in the first semi-final unless rain intervenes in their match against the Netherlands and they end up at six points alongside the winner of Pakistan vs Bangladesh, in which case NRR will decide the second qualifier from Group 2.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-05 14:17:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-vs-England.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Turn Muslim, no matter what you do in life, you go to heaven’: Old video of Pakistani cricketer Ahmed Shehzad persuading TM Dilshan to embrace Islam goes viral","link":"https://www.opindia.com/2022/11/pakistani-cricketer-ahmed-shehzad-persuading-dilshan-to-embrace-islam-goes-viral/","keywords":["Editor's picks","News Reports","Sports","Cricket","islam","Pakistan","religious conversion","Sri Lanka"],"creator":["OpIndia Staff"],"video_url":null,"description":"In the viral video, Pakistani cricketer Ahmed Shehzad tried persuading T Dilshan of converting to Islam on a cricket ground.","content":"On Friday (November 4), a video of Pakistani cricketer Ahmed Shehzad attempting to convert Sri Lankan cricketing legend TM Dilshan to Islam went viral on social media. A 21-second long video clip of the incident was shared on Twitter by a user named Incognito X (@Incognito_jkl). “If you are a non-Muslim and you turn Muslim, no matter whatever you do in your life, straight to heaven,” Shehzad was heard as saying. Dilshan did not seem to pay any heed to the comments of the Pakistani cricketer. However, when the Sri Lankan legend finally responded (which was not captured by the microphone), Ahmed Shehzad warned, “Then be ready for the (Hell) fire.” Pakistan Cricket Team has 11 maulvis, not 11 cricketers pic.twitter.com/VH9VJcjG30— Incognito X (@Incognito_jkl) November 4, 2022 While reflecting on the on-field proselytization by the Pakistani cricketer, the Twitter user wrote, “Pakistan Cricket Team has 11 maulvis (clerics), not 11 cricketers.” The Origins of the viral video The viral video, dating back to August 30, 2014, was shot during the 3rd ODI match between Sri Lanka and Pakistan. The match was hosted at the Rangiri Dambulla International Stadium by the island nation. During the 50-over encounter, Sri Lanka dismissed Pakistan for a paltry score of 102. TM Dilshan went on to score an unbeaten half-century and the hosts went on to win the match by 7 wickets (in accordance with the Duckworth-Lewis method). Although Dilshan did not register a formal complaint, an official inquiry was initiated by the Pakistan Cricket Board (PCB). As per reports, TM Dilshan was born to a Muslim father and a Buddhist mother. Following his international debut in 1999, he dropped his Muslim name ‘Tuwan Mohamed Dilshan.’ Thereafter, the Sri Lankan legend adopted his mother’s Sinhalese-Buddhist identity under the name Tillakaratne Mudiyanselage Dilshan. Similarly, many other Pakistani cricketers, mostly former players such as Inzamam-ul-Haq, Saeed Anwar, Muhammad Yusuf, Saqlain Mushtaq, and other have taken to Islamic preaching after announcing their retirement. Some of them have continued being connected with cricket in some or the other capacity, but that has not stopped them from routinely conducting sessions to preach Islamic religious scriptures. Mohammad Rizwan invokes Allah in a match against the Netherlands Being overtly religious and becoming an Islamic scholar is not just an exclusive preserve of the former Pakistani cricketers, for whom there are scarce economic opportunities after hanging up their booths in a country starkly polarised by Islamic extremism. Even the current crop of cricketers has displayed an evangelical zeal to proselytise the infidels and propagate their religion. For instance, Mohammad Rizwan, the prolific run-scorer for Pakistan, has been one of the most ardent proponents of spreading Islam. Former Australian cricketer Matthew Hayden, who was appointed as the Batting Coach of the Pakistan cricket team for the 2021 T20 World Cup, had in November 2021 made a startling revelation when he said that Mohammad Rizwan gifted him an English version of a copy of Quran. Talking about the moment when he was given the book, Hayden said, “It was Rizzy (Mohammad Rizwan) and I have to say it was a beautiful moment I will never forget. I am curious about Islam even though I am a Christian. One follows Christ and the other Muhammad and in a sense never shall meet but he presented me with an English version of the Quran. We sat on the floor for half an hour and talked through it. I am reading a bit of it each day. Rizzy is one of my favourite individuals, a champion human being.” More recently, Rizwan was caught on stump mic telling a Dutch player that he believed in Allah and not in the game situation. Rizwan reportedly made the comments during Pakistan vs Netherlands match, played on October 30 in the ongoing T20 World Cup in Australia. Pakistan is currently third on the points table and is all but certain of going back home without qualifying for the semis. Stump mic! @iMRizwanPak to the Duch wicketkeeper” I believe on ALLAH not on the game situation.#PAKvsNED #T20WorldCup— Saeed Anwar (@ImSaeedAnwar) October 30, 2022 Not just this, Rizwan is also known for taking time out of his busy cricket schedule and preaching Islam in mosques and madarsas. Several videos of the cricketer preaching Islam and its teachings distilled from the Quran have gone viral on the internet. Mohd Rizwan @iMRizwanPak is preaching Islam. Mash Allah pic.twitter.com/LlUHZ0A6Yb— Nadira Mushtaque Syed (@naadiisporty) December 31, 2021 Muhammad Rizwan Preaching Islam in a mosque at Melbourne. pic.twitter.com/X8Rj5NPN0b— Maham Fatima (@MahamOfficial_2) October 20, 2022 In fact, not just in Pakistan, Rizwan also finds time to preach Islam on international tours to foreign countries. Recently, social media websites were awash with a video of him preaching Islam in a mosque in Melbourne amid the Pakistan cricket team’s world cup campaign.","pubDate":"2022-11-05 14:14:17","image_url":null,"source_id":"opindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM T20 World Cup Live Streaming: When and where to watch India vs ZIM Group 2 match","link":"https://www.firstpost.com/firstcricket/sports-news/ind-vs-zim-t20-world-cup-live-streaming-when-and-where-to-watch-india-vs-zim-group-2-match-11577981.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IND vs ZIM T20 World Cup Live Streaming: When and where to watch India vs ZIM Group 2 match","content":"India take on Zimbabwe in the final Super 12 Group 2 match of the ongoing T20 World Cup, in Melbourne on Sunday. A win would all but take India to the semi-finals, after having won three of the four group matches so far.After beginning their Super 12 campaign with a last-ball win over arch-rivals Pakistan, the Men in Blue carried on their winning streak as they beat Netherlands in their second match, only to go down to South Africa in their third game.However, India followed that defeat with a five-run win over Asian giants Bangladesh in a rain-affected game.India had been sent to bat by Bangladesh and put up a total of 184/6.Bangladesh started their chase strongly, and were 66/0 from seven overs, with Litton Das having scored a half-century, when rain stopped play. The Tigers were 17 runs ahead on DLS par score, but when play resumed after the rain delay, Bangladesh suffered a collapse.From 66/0, Bangladesh were restricted to 108/6 in the 13th over, with Arshdeep Singh and Hardik Pandya having taken two wickets apiece while Mohammed Shami took one. Nurul Hasan and Taskin Ahmed forged a 37-run stand for the seventh wicket, but that was not enough for Bangladesh to cross the finish line.India’s biggest positive has been Virat Kohli’s form, who has scored 220 runs from four matches, with three fifties to his name.Zimbabwe meanwhile, have three points from four games, including that thrilling win over Pakistan, as well as a washout against South Africa. They lie fifth in the Group 2 standings, ahead of the already-eliminated Netherlands.Here’s all you need to know regarding when and where to watch India vs Zimbabwe:Where will the Group 2 match between India and Zimbabwe be played?The Group 2 match between India and Zimbabwe will be played at the Melbourne Cricket Ground (MCG).When will the Group 2 match between India and Zimbabwe start?The Group 2 match between India and Zimbabwe will start at 1:30 PM (IST).How to watch the live broadcast of the Group 2 match between India and Zimbabwe in India?Live broadcast of India vs Zimbabwe match will be available on the Star Sports Network in India.How to watch the live streaming of the Group 2 match between India and Zimbabwe in India?Live streaming of India vs Zimbabwe match will be available on the Disney+Hotstar app and website. ","pubDate":"2022-11-05 13:49:12","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/India-win-INDvBAN-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ashok Sigamani to become TNCA President","link":"https://sportstar.thehindu.com/cricket/ashok-sigamani-to-become-tnca-president/article66100474.ece","keywords":null,"creator":["\n        S. Dipak Ragav  \n    "],"video_url":null,"description":"Dr Ashok Sigamani, who was the vice president, was elected as President with R.I. Palani as Secretary in the Tamil Nadu Cricket Association elections on Saturday.","content":"With the last-minute withdrawal of candidates for the post of President, Joint and Assistant Secretary, a new set of office bearers of the Tamil Nadu Cricket Association were elected unopposed at its 90th Annual General Meeting here on Saturday. Dr Ashok Sigamani, who was the vice president, was elected as President with R.I. Palani as Secretary, while K. Shivakumar and Dr R.N. Baba were elected as the new Joint Secretary and Assistant Secretary respectively. T.J. Srinivasaraj will be the new Treasurer S. Prabhu, DSK Reddy and R.R Kalidas Vandayar, who had filed their nominations for the post of President, Joint Secretary and Assistant Secretary withdrew their nominations unconditionally on Saturday. The trio had earlier approached the Madras High Court to stay the election proceedings citing procedural violations but on Saturday decided to withdraw all the legal cases as well, thus paving the way for all posts to be filled unanimously. The General Body on Saturday also approved a pension scheme of Rs 10,000 per month for retired First Class Cricketers who have played between 10 and 24 matches for Tamil Nadu. Speaking to the media after taking charge as President, Ashok Sigamani said the new office bearers will look to continue the work done by the predecessors and reiterated the association’s goal of trying to win the Ranji Trophy as the priority on the cricketing side of things. When asked about plans to identify and nurture pacers, an area the team has lacked for a while, Ashok said, “We are planning to have a talent scout to go throughout the districts and identify pacers and even spinners. We can divide the programme into zones and get players who have the potential.” He also added that the association will also focus more on women’s cricket to create more opportunities and explore even a league for them. Read more stories on Cricket.","pubDate":"2022-11-05 13:38:09","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes takes England into T20 World Cup semis as Australia dumped out","link":"https://www.iol.co.za/sport/cricket/international/ben-stokes-takes-england-into-t20-world-cup-semis-as-australia-dumped-out-aa1e822c-8bc5-4815-b073-d549d7d0d7d1","keywords":null,"creator":["AFP"],"video_url":null,"description":"Ben Stokes starred as England beat Sri Lanka by 42 runs on Saturday and dumped hosts Australia out of the T20 Cricket World Cup.","content":null,"pubDate":"2022-11-05 13:28:02","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/2a1bec59-a323-5c21-a970-2fc42cf1e7d9&operation=CROP&offset=0x131&resize=3500x1966","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Wasim Akram Opens Up On 'Rumours' About Him Being Involved In Match-Fixing - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvd2FzaW0tYWtyYW0tb3BlbnMtdXAtb24tcnVtb3Vycy1hYm91dC1oaW0tYmVpbmctaW52b2x2ZWQtaW4tbWF0Y2gtZml4aW5nLTM0OTM0ODXSAXZodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L3dhc2ltLWFrcmFtLW9wZW5zLXVwLW9uLXJ1bW91cnMtYWJvdXQtaGltLWJlaW5nLWludm9sdmVkLWluLW1hdGNoLWZpeGluZy0zNDkzNDg1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Wasim Akram Opens Up On 'Rumours' About Him Being Involved In Match-Fixing  NDTV Sports“In Pakistan, rumors still persist – ‘he’s a match-fixer', it hurts a lot”- Wasim Akram on darkest phase of his career  Circle of Cricket'Match-fixing rumours were like trauma': Wasim Akram recalls dark phase of his career  The Indian ExpressWasim Akram: ‘The match-fixing rumours were like a trauma … no one trusted each other’  The GuardianCelebrities and their memoirs: 5 times Bollywood stars shocked with their revelations  OTV NewsView Full coverage on Google News","content":null,"pubDate":"2022-11-05 13:22:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes keeps cool amid collapse as England scrape past Sri Lanka to reach World Cup semis and knock Australia out","link":"https://www.thesun.co.uk/sport/20311267/england-sri-lanka-t20-world-cup-stokes/","keywords":["Cricket","Sport","Men's T20 World Cup","Sport Live Blogs","T20 cricket"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"BEN STOKES kept his cool and guided England to victory over Sri Lanka and a place in the Twenty20 World Cup semi-finals. Stokes remained strong during a dramatic England collapse that turned an apparent cruise to victory into a tense final few overs. The Durham all-rounder finished 42 not out from 36 balls as England beat Sri Lanka by four wickets with two balls remaining. So England emerge from Group One of the Super 12s on net run-rate and their semi-final will be in Adelaide on Thursday – most likely against India. Their win has the delicious added bonus of knocking out hosts and reigning champs Australia from their own tournament. Stokes has a relatively poor record for England in T20s but there are few better in tight situations in must-win matches. He was promoted to No3 because Dawid Malan tweaked a groin muscle in the field and don’t forget Stokes’ fielding has been superb and his bowling useful in this tournament – despite his wonky right knee requiring heavy strapping. Openers Jos Buttler and Alex Hales broke the back of England’s chase and swept to 75-0 after 7.1 overs but, on a used pitch, Sri Lanka’s spinners started causing problems. England succumbed to 111-5 and then 129-6 with the middle-order self-destructing and Malan unable to bat because of his injury. England needed five from the final over and Chris Woakes completed the job with a square cut to the boundary. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Captain Buttler said: “It got a bit close at the end. I’m not a great watcher so I didn’t enjoy it much. We had to find a way to win the game and thankfully we did that. “It was the kind of situation that Ben Stokes is made for and, while he was at the crease, we had a sense of calm. He can play a lot of roles – he affects the game in all three facets and he’s a proper competitor. “When we get to the later stages of competitions, you’ll see him grow and grow.” Sri Lanka chose to bat because they believed the surface would become harder to bat on. And they made an electrifying start with Pathum Nissanka hoisting the second ball of the innings for six. Then Kusal Mendis deposited Mark Wood’s opening delivery into the stand and Nissanka uppercut the final ball of the Durham speedster’s first over for another maximum. Sri Lanka were going very nicely at 65-1 from seven overs. But their innings disintegrated after that with 76-7 coming from their final 13 overs and 25-5 off the last five. Wood’s first over cost 17 runs but he finished with 3-26 while Adil Rashid, out of sorts recently, showed encouraging signs of a return to form with 1-16 from his four overs. Rashid also equalled Chris Jordan’s record of 90 wickets for England in men’s T20s. When Buttler and, especially, Hales blitzed the start of England’s reply, the game looked over. The 70 runs they plundered in the first six overs was the highest powerplay score in the tournament. But some poor shot selection undermined England’s innings with Harry Brook, Liam Livingstone and Moeen Ali among those culpable. Stokes stayed and, although it was not as epic as his innings in England’s 50-over World Cup final triumph in 2019 , it was another show of determination and mental resilience against the white ball. Sri Lanka coach Chris Silverwood, sacked by England after their 4-0 Ashes hammering last winter, added: “I wish England all the luck – I have so many friends in their camp. “There are a lot of good players in that England dressing room but Ben has been their talisman. Getting England over the line will do his confidence a lot of good.” Here's how the action unfolded on our live blog... Cometh the moment, cometh the man. Ben Stokes stepped up when his side most needed him today. When we need him most... He's always there 👏 #T20WorldCup | @benstokes38 pic.twitter.com/zJW8TlFpaY England now travel to Adelaide where they will play their semi-final. Adil Rashid was awarded the man of the match award today. Rashid ending up with figure of 1/16 from his 4 overs. With 2 runs needed from the last 3 balls, Chris Woakes opened his blade up to play the ball backward of square with the ball racing all the way to the boundary. After racing out of the traps in the first 10 overs of the game, England seemingly were making hard work of the run chase. With wickets falling at regular intervals, there were some worried faces on the England bench. Woakes and Stokes were able to see Joss Buttler's side through to the semi-finals. England are looking take runs wherever they can find them now. Not a good time to bowl a full toss as Stokes slaps it towards the boundary, there is a fielder there so only the two runs. This over has relieved the pressure on England, some very loose deliveries. England need 5 runs from the last over. The very last ball of the over, a slower ball following Curran down the leg side. He looks to go big and gets caught on the fine leg boundary. England surely are not going to throw this away now. 13 runs from 12 balls required. Maheesh comes back on to try and make something happen. Sri Lanka are looking to attack now. England still seem content working the ball around for runs rather than going for the big hits. 15 required from 18 balls now for England. After the start England made, nobody expect an ending as tense as this. Credit to the Sri Lankan players, they have not given up and taken their catches in the field. 21 runs needed from 24 balls. Surely England are not going to blow this. Sam Curran comes into bat with the pressure on. Sri Lanka feel as though they are back in this game. The whole of Australia is sat on the edge of their seats. Moeen Ali comes in for England. They are in danger of grasping defeat from the jaws of victory here. 32 required from 36 balls. You could argue that Sri Lanka should have had another 30 odd runs from their innings. Had they scored this, England would be in a tricky situation right now. Instead, they are able to just nudge the ball around. If Sri Lanka can make another couple of breakthroughs, the will cause England some real concern. They are trying to push the ball around now, knowing they only need a run a ball. Just 5 runs from the over. Brook kind of gifted his wicket away there. Poor shot from the England batsman. If they are not careful, they are in danger of letting Sri Lanka back into this game. What a comedy of errors that was. 47 not out and Hales goes for the big sweep. It hits the toe end of the bat and chips back up to the bowler. Second ball in and Brook is trying to reverse sweep. Very lucky to not see that one hit the stumps. Dhananjaya comes on to bowl. Looking to make something happen with some more spin. 6 runs come from the over. Wanindu Hasaranga drifts one up and Buttler goes after it. Making up some ground in the field, Chamika takes a great catch out on the leg-side boundary at deep mid-wicket. Stokes comes in at number three after Malan seemingly tweaked his groin in the field. Maheesh continues with his spell and his third over. Buttler works one away from his legs for a single. 3 runs from the over from Maheesh. England are starting to pick up the pace now. Rajitha is going for some tap now from these two. Sri Lanka use a review for what seems like Hales just striking the ground on its way through. Wasted review by Sri Lanka. 20 runs from the final over of the powerplay. Wanindu Hasaranga comes into the attack for Sri Lanka. Good footwork from Buttler gives him space to punch the ball through the covers for four. The England skipper finishes the over with a big six.","pubDate":"2022-11-05 13:20:00","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Australia’s shoddy defence trashed as England delivers last rites","link":"https://www.couriermail.com.au/sport/cricket/world-cup-2022-england-v-sri-lanka-all-the-latest-news/news-story/506ba1fba94e6a594204ca434073d566","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australia’s shambolic defence of their T20 World Cup title is officially over.","content":"England joined New Zealand in the semi-finals after beating Sri Lanka by four wickets in a thriller at the Sydney Cricket Ground.The Australians finished in a three-way tie with the English and the Kiwis at the top of the Group 1 standings but missed out on the playoffs because they had the worst net run rate of the trio.Their last chance of sneaking through was if Sri Lanka beat England but the Poms got the job done despite losing wickets late as the pressure mounted.They restricted the Asian Cup champions to 8-141 with some brilliant bowling at the death then reeled off the required runs with just two balls to spare with Alex Hales (47) and Jos Buttler (28) laying the foundations and Ben Stokes (42 not out) brilliantly finishing it off.“I was as nervous as anything waiting to bat with my pads on! My heart rate will hopefully come down,” England fast bowler Mark Wood said.“A bit nervy but we got there in the end. I am sure we will be disappointed with making it so close, but the seamers all day seemed to go for runs and the spinners squeezed us a little. But Ben Stokes, who has done it in that situation stood up.“Ben is a big game player. We needed him there and he did it for us. We played well up top. I don’t think it’s an easy wicket to start on. I think the middle order will cash in on a better pitch.”As group 1 runners up, England will play the Group B winners – likely to be India – in the semis at Adelaide next Thursday. As things stand, the Kiwis will probably play South Africa at the SCG on Wednesday.The final Group B matches are still to be played on Sunday but there could be another twist in a tournament full of surprises.Although it was close in the end, truth be told, the Aussies never really deserved to make the semis and the fallout to the team’s lacklustre efforts in a home World Cup should be fast and brutal to avoid it ever happening again.Former Australian fast bowler Stuart Clark told the BBC’s Test Match Special:“It’s disappointing for Australia to go out but they weren’t good enough. They will have a debrief and a bit of soul searching.“There’s some guys who have been around for a while, and we have to start looking to some younger guys. Cameron Green is the only player under 29.“I think this especially applies to the bowlers who play all three formats. The questions are going to be asked about what our team will look like for the next T20 World Cup, and I think half these guys won’t be there.”Although the Australians only lost one match during the group phase, they never came close to replicating the same standards when they won the World Cup in Dubai last year.That of course was when Justin Langer was in charge but the team has gone to pieces since he was shown the door.Serious questions will need to be asked about the team’s current leadership and future direction because their performances were not up to scratch.The first casualties are likely to be the senior players who underperformed during the tournament, including the skipper Aaron Finch.Steve Smith, David Warner, Matthew Wade, Marcus Stoinis and Glenn Maxwell will all be in their mid 30s by the next World Cup so most of them – if any – won’t make it either.The expected cull may not stop just at the players.The new Australian coach Andrew McDonald and the selection panel should also expect to find themselves under the pump after some baffling decisions to stick with ageing players out of form.10.22PM UPDATE England is through to the T20 World Cup semi-finals after a four-wicket win over Sri Lanka with three balls to spare. England was 0-70 off six overs and made 6-72 from that point. A sore Ben Stokes finished 42 not out after Alex Hales (47) and Jos Buttler (28) set the platform for England’s chase. 10.18PM UPDATE England needs five runs off the last over to reach the T20 World Cup semi-finals. Ben Stokes will be on strike. Four runs would mean a super over would decide whether Australia goes through. 10.10PM UPDATE Sam Curran caught! England needs 13 runs off the last two overs with four wickets in hand. This is nuts! Chris Woakes has come in ahead of the injured Dawid Malan. 10.05PM UPDATE England needs 15 off 18 balls. This is far more tense than it should be. 10.01PM UPDATE England needs 21 from 24 balls. 9.54PM UPDATE ALI OUT, ENGLAND NERVOUSMoeen Ali chips a catch to cover and England is 5-111.Sam Curran is the new man in, with Dawid Malan still yet to bat. 9.52PM UPDATE ENGLAND WOBBLING Within sight of a berth in the semi-finals, England has lost 3-24. With six overs remaining and the SCG crowd cheering dot balls, England needs 32 runs. A reminder Dawid Malan is unlikely to bat after injuring his groin in the field. 9.34PM UPDATE WIN PREDICTOR SAYS AUSTRALIA ALL BUT DONE The win predictor has England at 95 per cent and Sri Lanka 5 per cent. England is 2-86 after 10 overs, needing 56 off 60 balls to clinch a semi-final spot. 9.20PM UPDATE ENGLAND’S BRUTAL POWER PLAY SHOW Australia’s last hopes of making the World Cup semi finals are fading fast.England are making light work of their run chase against Sri Lanka at the SCG and it seems only a matter of time before they boot the Aussies out.Needing just 142 for victory, England raced to 70 without loss after the six over power play.Showing the Aussies what they should have done, the English openers have completely monstered the Sri Lankan attack.Alex Hales is 42 not out from 19 balls with Jos Buttler unbeaten on 25 off 18 and the required run rate already down to less than a run a ball.SCBBL PROMO9.07PM UPDATE ENGLAND POWERING TO TOTAL Five overs down in England’s chase and Australia is staring at an early exit from the T20 World Cup. Jos Buttler and Alex Hales have powered England to 0-50 after five overs, needing a further 9 2 runs from 90 balls. 8.43PM UPDATE WHY AUSSIE FANS SHOULD HAVE HOPE Although Sri Lanka’s total of 8-141 may not seem massive after they were pegged back by England’s bowlers at the death, some key stats are still in their favour.For starters, no team that’s batted second at the SCG during this tournament has gone and won a match.And the highest total by any team batting second at the SCG during the World Cup is just 123.Still, the Poms will be heavily favoured to reach their target and qualify the semis, which would leave the Aussies wondering what could have been after Sri Lanka looked on course for a much bigger total before completely losing their way at the end, adding just 25 runs for the loss of five wickets over the last five overs.8.35PM UPDATE ENGLAND RALLIES TO CLOSE ON SEMI-FINALS England is in the box seat to reach the T20 World Cup semi-finals after producing a sterling rally with the ball. Sri Lanka raced to 1-54 after the six-over powerplay but limped through the rest of its innings as Sam Curran and Adil Rashid led England’s fightback. Sri Lanka finished with 8-141, losing three wickets in the last over and only managing 87 runs from its last 84 balls. Commentator Mike Atherton said a lack of firepower has come back to haunt the Sri Lankans. 8.11PM UPDATE MALAN LIMPS FROM FIELD England’s battling line-up has suffered a potentially disastrous setback with former World No. 1 batter Dawid Malan injured in the field. Malan appeared to hurt his groin while chasing a ball from backward point and immediately limped from the field at the SCG. It remains to be seen whether he will be available to bat as England chases a semi-final berth. 8.02PM UPDATE BROAD RAISES SCG PITCH CONCERNSEnglish quick Stuart Broad says he can’t understand why the England-Sri Lanka match is being played on the same SCG wicket as two other games. Broad tweeted on Saturday night: “SL started well. Feel like their batting is light from now. Would expect us to win the next 10 overs. Then have to play their spinners well. “Not sure why we’re using a pitch for the 3rd time in a World Cup.” 7.56PM UPDATE NISSANKA REACHES HALF-CENTURY Sri Lankan opener Pathum Nissanka has brought up his half-century at the SCG after overcoming a mid pitch collision as the English bowlers bagged two more wickets to slow down the run flow.Nissanke got to his 50 off 33 balls as Sri Lanka moved to 3-89 after 12 overs – still on course for a big total despite slowing down.He had a scare when he crashed into his teammate Charith Asalanka but both men recovered.Asalanka fell for eight when he skied a catch off Ben Stokes to Dawid Malan.Sri Lanka also lost Dhananjaya de Silva for nine when he was caught by Stokes on the boundary rope right in front of the Member’s Stand.7.49PM UPDATE SRI LANKAN STAR HURT Pathum Nissanka has received treatment on the field after appearing to be hurt when he collided with teammate Charith Asalanka. Play resumed after a delay of about five minutes with Nissanka batting on. “Bit of a hobble, but it didn’t look too disastrous,” former England captain Michael Atherton said in commentary after play resumed. Sri Lanka reached 2-80 after 10 overs with Nissanka the star, unbeaten on 46. 7.27PM UPDATE SRI LANKAN POWERPLAY OVER There is hope for Australia yet because Sri Lanka have exploded out the blocks – belting 1-54 during the powerplay.Showing a lot more intent than the Aussies did against Afghanistan, Sri Lanka’s openers have been carving up the English attack.Pathum Nissanka let the Poms know what they were in for when he dispatched the second ball of the match – from Ben Stokes – over the ropes for six.Nissanka got another maximum off express bowler Chris Wood when he deflected past third man then a third off Sam Curran.Kusal Mendis also blasted a six off Wood as the Asian Cup champions piled on 32 from the first three overs.The Poms got rid of Mendis for 14 when Liam Livingstone held a running catch in the deep but Nissanka (32 not put) and the new batter Dhananjaya de Silva (two) kept the scoreboard ticking over.7.15PM UPDATE SRI LANKAN STARTS GIVES AUSSIES HOPE Pathum Nissanka and Kusal Mendis have launched Sri Lanka to 0-32 after three overs, giving Australia a boost as it prays for a Sri Lankan victory against England. Mark Wood left the field after bowling the third over of the innings. 6.50PM COULD COIN TOSS POINT TO AUSSIE PROGRESSION? Some good news for Australia at the T20 World Cup.Sri Lanka has won the toss and elected to bat first in their match against England at the Sydney Cricket Ground.The stats are a good omen for Australia’s hopes of a Sri Lankan victory because every team that has batted first at the SCG during the tournament has gone on and won the match.Australia won the toss in the tournament opener against New Zealand but gave the Kiwis first go on a perfect deck and promptly got hammered.England captain Jos Buttler said he would definitely have batted first if he’d won the toss against Sri Lanka.“We need to play our best cricket to try to get through to the next round,” he said.England named an unchanged team from the one that beat New Zealand in their last outing while Sri Lanka made one change, recalling Chamika Karunratne.6.35PM UPDATE – TEAM LISTS ARE IN SRI LANKA Pathum NissankaKusal Mendis (WK)Dhananjaya de SilvaCharith AsalankaBhanuka RajapaksaDasun Shanaka (C)Wanindu HasarangaChamika KarunaratneMaheesh TheekshanaLahiru KumaraKasun RajithaENGLANDJos Buttler (C) (WK)Alex HalesDawid MalanBen StokesHarry BrookMoeen AliLiam LivingstoneSam CurranChris WoakesAdil RashidMark Wood6.20PM UPDATE RAIN WON’T SAVE AUSSIES One of Australia’s two avenues of making the semis already looks closed with virtually no chance of rain coming to their rescue.The Aussies would sneak into the knockout stages if Saturday’s final group 1 match between England and Sri Lanka was washed out but Mother Nature isn’t playing ball.There is hardly a cloud in the sky above the Sydney Cricket Ground and the forecast for rain is 1%.So much for the wettest year on record.That leaves Australia with only one remaining path to stay alive – they now need Sri Lanka to beat the Poms.CAN SRI LANKA SEND AUSSIES THROUGH? Australia is hours away from learning whether its T20 World Cup defence is over.The reigning champion paid the price for a disastrous loss to New Zealand in its tournament opener, finishing the Super 12 stage with a net run rate of -0.173. New Zealand has booked its passage to the final four after finishing equal on seven points with Australia, but with a far superior NRR of 2.112.Aaron Finch’s men needed to defeat Afghanistan by about 60 runs in their final Super 12 match to overhaul England’s NRR of 0.547, but only fell over the line on Adelaide on Friday night. While that result has saved the Australians a nervous night calculating NRR changes, it means only a Sri Lankan win will secure them a spot in the semi-finals. Sri Lanka has four points and cannot qualify, although it could still finish third in Group 1 ahead of England. Tonight’s match starts at 7pm. Follow the latest talking points from the SCG here.","pubDate":"2022-11-05 12:42:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"}]}