{"newsArray":[{"title":"Cricket match derailed by vicious intruders","link":"https://www.cairnspost.com.au/sport/cricket/wbbl-match-derailed-as-aggressive-birds-swoop-sydney-thunder-fielders/news-story/4da37a773728656a6d17ac3f8233193f","keywords":["Cricket news and galleries","Kayo","Womens Cricket"],"creator":null,"video_url":null,"description":"Tuesday night’s WBBL match between the Sydney Thunder and Hobart Hurricanes had to be temporarily suspended as frightened players dodged a group of angry intruders.","content":null,"pubDate":"2022-10-18 21:38:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"$60 million net worth John Cena posts Glenn Phillips’ picture on Instagram celebrating his maiden T20I century","link":"https://thesportsrush.com/cricket-news-60-million-net-worth-john-cena-posts-glenn-phillips-picture-on-instagram-celebrating-his-maiden-t20i-century/","keywords":["Cricket","Glenn Phillips","john cena"],"creator":["Gurpreet Singh"],"video_url":null,"description":"$60 million net worth John Cena posts Instagram pictures without providing contexts, but fans were quick to spot the reason as usual. 13-time WWE champion, and 16-time Wrestling champion John Cena’s popularity extends beyond some of the top former or present Cricketers across the World even in countries where Cricket is quite a renowned sport… The post $60 million net worth John Cena posts Glenn Phillips’ picture on Instagram celebrating his maiden T20I century appeared first on The SportsRush.","content":"$60 million net worth John Cena posts Instagram pictures without providing contexts, but fans were quick to spot the reason as usual. 13-time WWE champion, and 16-time Wrestling champion John Cena’s popularity extends beyond some of the top former or present Cricketers across the World even in countries where Cricket is quite a renowned sport than most others. The reason why the terms John Cena and Cricket are written side by side goes back to the New Zealand Tri-Series final played between New Zealand and Pakistan on October 14, at The Hagley Oval in Christchurch. New Zealand’s hard-hitting middle-order batter Glenn Phillips was seen walking towards the pitch post Devon Conway’s dismissal, with the ever-popular John Cena’s theme/introductory song from the WWE events, being played in the background at the stadium. ALSO WATCH: Glenn Phillips six off Shakib Al Hasan caught brilliantly by fan on grass bank at the Hagley Oval Just when Philips began opening himself up with a jog followed by some shadow batting practice, the hook part of the popular music played out in the stadium, which became quite viral across social media platforms, so much so that it perhaps invited Cena’s attention as well over the course of a few hours. Fan of it https://t.co/QdoW6yyNjS — Vithushan Ehantharajah (@Vitu_E) October 18, 2022 $60 million net worth John Cena posts picture of Glenn Phillips John Cena, just a day ago, made sure to post Glenn Phillips’ picture on his verified Instagram handle from November 2020, when he smashed his maiden T20I century against West Indies, at Mount Maunganui. Interestingly, the American Wrestler-turned actor’s Instagram bio reads – ‘Welcome to my Instagram. These images will be posted without explanation, for your interpretation. Enjoy.” Cena did the same this time around as well, but fans were quick to draw the link and the reason behind the post, which made a rather cheerful day for both the ardent Cricket and WWE fans.   View this post on Instagram   A post shared by John Cena (@johncena) As for Phillips, who has been in decent T20 form of-late, will be seen in action from October 22 onwards, when New Zealand will take on defending champions Australia in the opening match of the ‘Super 12’ stage of the ongoing T20 World Cup 2022. The post $60 million net worth John Cena posts Glenn Phillips’ picture on Instagram celebrating his maiden T20I century appeared first on The SportsRush.","pubDate":"2022-10-18 19:02:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"The multiple failures of CA’s ham-fisted administrators - Daily Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMinAFodHRwczovL3d3dy5kYWlseXRlbGVncmFwaC5jb20uYXUvc3BvcnQvY3JpY2tldC9kYXZpZC13YXJuZXItc251YmJlZC1hcy1wYXQtY3VtbWlucy1uYW1lZC1hdXN0cmFsaWFzLW9kaS1jYXB0YWluL25ld3Mtc3RvcnkvZWZlM2JiYTZhNTI0NjFhZjRkNGEyMTdhYzY3OGM2YjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The multiple failures of CA’s ham-fisted administrators  Daily TelegraphThe question we need answered before David Warner can captain again  Sydney Morning Herald'Can't speak highly enough of Warner's leadership': Bailey | ICC Men's T20 World Cup 2022  cricket.com.auBailey wants issue of Warner ban resolved  Blue Mountains GazetteWarner should have ban lifted but giving him Australian white-ball captaincy would be the wrong call  The RoarView Full coverage on Google News","content":null,"pubDate":"2022-10-18 18:45:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Rohit Sharma and co. brace themselves ahead of Kiwi challenge | READ","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-rohit-sharma-and-co-brace-themselves-ahead-of-kiwi-challenge-read-2022-10-18-817263","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: Rohit Sharma-led team India are currently stationed in Australia and are preparing themselves for the much-awaited India vs Pakistan clash that is to be played on October 23, 2022, at the Melbourne Cricket Ground. India in their first warm-up match played against Aaron Finch's Australian team on October 17, 2022, and defeated them by a margin of 6 runs. Team India will now take on Kane Williamson's New Zealand at the Gabba on October 18, 2022.","content":"-led team India are currently stationed in Australia and are preparing themselves for the much-awaited India vs Pakistan clash that is to be played on October 23, 2022, at the Melbourne Cricket Ground. India in their first warm-up match played against 's Australian team on October 17, 2022, and defeated them by a margin of 6 runs. Team India will now take on 's New Zealand at the Gabba on October 18, 2022. Much to India's respite, their top-order batsman showed some kind of promise at the top, but as far as Rohit Sharma is considered, he still needs to find his groove and contribute to the team's cause. Rohit Sharma surprised cricketing experts around the globe as he gave only one over in the entire match. Shami bowled a brilliant final over and scalped three wickets. has been ruled out of the World Cup and as of now, the onus of leading India's bowling attack falls on speedster Mohammed Shami. As far as Kane Williamson and his troops are considered, they will want to dominate India straightaway. Surprisingly, New Zealand are not being counted as favourites, and Williamson is hardly bothered by this. They have the likes of and at their disposal and if they can bring their best to the table, it will certainly do a world of good to the Kiwis. New Zealand were the finalist at the previous edition of the T20 World Cup but owing to their loss against Pakistan in the tri-series final might have dampened their spirits a bit. India: Rohit Sharma (c), KL Rahul, , Suryakumar Yadav, Deepak Hooda, Rishabh Pant, , , R Ashwin, , Axar Patel, , Harshal Patel, Arshdeep Singh, Mohammad Shami. Standby Players: Mohammed Siraj, Shreyas Iyer, Ravi Bishnoi, Shardul Thakur. Kane Williamson (c), Tim Southee, , , Glenn Phillips, Jimmy Neesham, Daryl Mitchell, , , Lachlan Ferguson, Devon Conway, Mark Chapman, Michael Bracewell, Trent Boult, Finn Allen.","pubDate":"2022-10-18 18:23:18","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ Warm-up match Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND vs NZ T20 World Cup 2022 match in Gabba, Brisbane 130 PM IST, October 19","link":"https://zeenews.india.com/cricket/ind-vs-nz-warm-up-match-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-vs-nz-t20-world-cup-2022-match-in-gabba-brisbane-130-pm-ist-october-19-2523889.html","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand warm-up match Dream11 Team Prediction India vs New Zealand T20 World Cup 2022 Preview - Check My Dream11 Team, Best players list of IND vs NZ Warm-up match, India Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Rohit Sharma's Team India is all set to take on New Zealand in their last warm-up match of the ICC T20 World Cup 2022 at The Gabba, Brisbane on Wednesday. India won their last warm-up match against Australia. The major positives for Team India are the fifties by KL Rahul and Suryakumar Yadav while the comeback of Mohammed Shami was a key highlight. Rohit might look to give R Ashwin and Deepak Hooda some game time in the last warm-up match Also Read: Pakistan likely to boycott ODI World Cup 2023 in India: Reports Match Details India vs New Zealand ICC T20 World Cup 2022 Warm-Up match October 19, Wednesday The Gabba 1:30 PM IST WE ARE #TeamIndia #T20WorldCup pic.twitter.com/BCxvqK60ni — BCCI (@BCCI) October 18, 2022 IND vs NZ Dream11 Batters – Suryakumar Yadav (C), Virat Kohli, Glenn Phillips, Kane Williamson, KL Rahul Wicketkeeper – Finn Allan All-rounders – Hardik Pandya (VC) Bowlers – Tim Southee, Mohammad Shami, Yuzvendra Chahal, Ish Sodhi IND vs NZ Dream11: Probable Playing XIs India: Rohit Sharma, KL Rahul, Virat Kohli, Suryakumar Yadav, Hardik Pandya, Dinesh Karthik, Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Bhuvneshwar Kumar, Mohammad Shami New Zealand: Finn Allan, Martin Guptill, Kane Williamson, Glenn Phillips, Mark Chapman, Michael Bracewell, Mitchell Santner, Adam Milne, Ish Sodhi, Lockie Ferguson, Tim Southee Full Squads New Zealand Devon Conway, Finn Allen, MJ Guptill, Kane Williamson(C), Michael Bracewell, James Neesham, Mitchell Santner, Glenn Phillips, Trent Boult, Tim Southee, Ish Sodhi, DJ Mitchell, MS Chapman, LH Ferguson, AF Milne India Rohit Sharma(C), Virat Kohli, SA Yadav, KL Rahul, HH Pandya, Axar Patel, Dinesh Karthik, B Kumar, M Shami, Yuzvendra Chahal, Arshdeep Singh, Rishabh Pant, S Iyer, Ravichandran Ashwin, Deepak Hooda, HV Patel, Ravi Bishnoi, Shardul Thakur, Saurabh Kumar","pubDate":"2022-10-18 17:57:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"KS vs CECC Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for KCC T20 Elite Championship, Match 24","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ks-vs-cecc-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-kcc-t20-elite-championship-match-24?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":"Kuwait Swedish (KS) will take on Ceylinco Express CC (CECC) in the 24th match of the KCC T20 Elite Championship at the Sulabiya Ground in Al Jahra Governorate on Tuesday, October 18. Ahead of the match, here's everything you need to know about the KS vs CECC Dream11 Fantasy prediction . Ceylinco Express CC have had a disappointing tournament, losing all four of their games, with their batting being the main reason behind their failure. They'll be expecting their batters to step up and get back on track. Kuwait Swedish, on the other hand, are having a good tournament, having won three of their four games. They are third in the points table and will look to move into the top two with a win to improve their chances of advancing to the next round. The 24th match of the KCC T20 Elite Championship will be played on October 18th at the Sulabiya Ground in Al Jahra Governorate. The match is set to take place at 11:00 pm IST. The live score & commentary of the game can be followed in the Sportskeeda Live Score section . KS vs CECC, KCC T-20 Elite Championship, Match 24 Date and Time: 18th October 2022, 11:00 pm IST Venue: Sulabiya Ground, Al Jahra Governorate The pitch at the Sulabiya Ground is good for batting, and batters truly enjoy batting since the ball comes off the bat nicely. There should be some early movement with the new ball, which will keep batters on their toes. Over time, the ball will grip the surface more accurately, making it easier for bowlers to use their variations. Anything above 160 could be a par score. Last 5 Matches (This Tournament) Matches won by teams batting first: 2 Matches won by teams bowling first: 3 Average first-innings score: 142 Average second-innings score: 131 Kuwait Swedish: W-W-L-W Ceylinco Express CC : L-L-L-L Kuwait Swedish injury/team news No major injury updates. Kuwait Swedish Probable Playing 11 Usman Patel (c&wk), Mohammed Faisal, Ali Zaheer, Mohammed Bulbul Ahmed, Yasin Patel, Asanka Silva, Mohammed Sumon, Sayed Monib, Ridmika Nimesh, Mohamed Dilhan, Sujon Miah CECC injury/team news No major injury updates. CECC Probable Playing 11 Ibrahim Rifkaz, Viraj Weerasekara, Deepal Melvo (c), Ahilan Ratnam, Priyakanth Harichchandra, Nilesh Patil, Mohammed Ruzly, Mohamed Shafran, Mohamed Rameez (wk) Vengadashen Abhishek, Mohamed Hameez Usman Ghani (249 runs in 4 matches, Average: 83.00) Usman has looked impressive in the competition so far, having scored 249 runs at an average of 83.00, with a highest score of 113 runs. He is expected to have another strong performance in today's game. Ali Zaheer (128 runs in 4 matches, Average: 42.66) Ali has been brilliant with the bat in this tournament, having amassed 128 runs at a strike rate of 94.65 in four games. Given his current form, he is a must-have in your KS vs CECC Dream11 fantasy team. Sayed Monib (37 runs & 7 wickets in 4 matches, Average: 11.42) The experienced all-rounder has seven wickets and has shown promise with the bat, scoring 37 runs in four games. He could prove to be a valuable pick for your Dream11 fantasy team for this game. Yasin Patel ( 8 wickets in 4 matches , Average: 11.37 ) He has looked good so far in the competition and could be a good pick for your fantasy team. Yasin has picked up eight wickets in four games at an average of 11.37 to become his side's leading wicket-taker this season. Ibrahim is a talented batter who has played a vital role in his team's success in the middle order so far, scoring 114 runs at an average of 28.50 in four. Given his potential and ability, he is an excellent candidate for the captaincy. Mohamed Dilhan Dilhan is a good, technically sound batter who can put up big numbers when he gets set. That makes him a good option for vice-captaincy in your Dream11 fantasy team. Priyakanth Harichchandra Mohammed Ruzly Vengadashen Abhishek Sujon Miah Asanka Silva Ridmika Nimesh has been outstanding with the ball so far, not allowing many runs and keeping batters in check. He has taken five wickets and scored 19 runs in four games and could be a multiplier pick for your fantasy team. Wicketkeepers: Usman Patel (c) Batters: Ibrahim Rifkaz, Ahilan Ratnam, Ali Zaheer All-rounders: Priyakanth Harichchandra, Sayed Monib (vc), Mohamed Shafran Bowlers: Yasin Patel, Mohammed Sumon, Ridmika Nimesh, Viraj Weerasekara Wicketkeepers: Usman Patel (vc) Batters: Ibrahim Rifkaz, Mohamed Dilhan, Ali Zaheer All-rounders: Priyakanth Harichchandra, Sayed Monib, Mohamed Shafran Bowlers: Yasin Patel (c), Mohamed Hameez, Ridmika Nimesh, Viraj Weerasekara Get the Latest updates & News on T20 World Cup & Follow us for Live Scores , Schedule , and Squads Poll : 0 votes Quick Links","pubDate":"2022-10-18 17:30:18","image_url":"https://static.sportskeeda.com/editor/2022/10/b3172-16660947257289-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI vs PCB: Ramiz Raja gives massive statement regarding 2023 ODI World Cup","link":"https://www.indiatvnews.com/sports/cricket/bcci-vs-pcb-ramiz-raja-gives-massive-statement-regarding-2023-odi-world-cup-jay-shah-2022-10-18-817244","keywords":null,"creator":null,"video_url":null,"description":"BCCI vs PCB: Jay Shah, the secretary of the Board of Control for Cricket in India (BCCI) earlier today confirmed that team India will not travel to Pakistan for the Asia Cup that is scheduled to be played in 2023. Speculations were rife that the Indian cricket team was willing to travel to Pakistan to challenge other Asian nations, but as of now, things around India's participation in the marquee event looks pretty bleak. BCCI secretary Jay Shah also stressed upon having a neutral venue for the Asia Cup that will be played next year.","content":"Jay Shah, the secretary of the Board of Control for Cricket in India (BCCI) earlier today confirmed that team India will not travel to Pakistan for the Asia Cup that is scheduled to be played in 2023. Speculations were rife that the Indian cricket team was willing to travel to Pakistan to challenge other Asian nations, but as of now, things around India's participation in the marquee event looks pretty bleak. BCCI secretary Jay Shah also stressed upon having a neutral venue for the Asia Cup that will be played next year. Pakistan earned themselves the hosting rights of the 2023 Asia Cup and with international cricket returning to Pakistan soil, it looked almost certain that India will participate. But things went downhill pretty quickly as Jay Shah denied India's participation. Shah coincidentally also happens to be the president of the Asian Cricket Council. The matters related to India playing in the Asia Cup hosted by Pakistan was mentioned in the notes that were circulated to the BCCI members before Tuesday's Annual General Meeting (AGM) in Mumbai. Shah was quoted saying \"We have decided to play at a neutral venue\". This decision by the BCCI hasn't gone down well with the Pakistan Cricket Board (PCB) and has rubbed them off in a very wrong way. PCB chief Ramiz Raja indicated that one of the options that they are considering as of now is pulling out of the 50-over ICC World Cup in India. The sources close to the Pakistan Cricket Board also said that Raja will write to the ACC and will also demand an emergency meeting in Melbourne next month to discuss Shah's statement.","pubDate":"2022-10-18 16:52:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India will win T20 World Cup if they beat Pakistan in tournament opener, says Suresh Raina","link":"https://metro.co.uk/2022/10/18/cricket-india-backed-win-t20-world-cup-one-condition-suresh-raina-17588165/","keywords":["Cricket","Australia cricket","Cricket World Cup","India Cricket","Pakistan Cricket","Rohit Sharma"],"creator":["Louis Sealey"],"video_url":null,"description":"'The team is doing well right now.'","content":"India begin their T20 World Cup campaign against Pakistan (Picture: Getty) India will go on to win the T20 World Cup if they manage to beat arch-rivals Pakistan in their opening match of the tournament, Suresh Raina has said. India, champions in T20 cricket in 2007, begin their 2022 campaign on Sunday against Babar Azam’s Pakistan. The Super 12 stage of the tournament gets underway on Saturday as hosts and defending champions Australia face last year’s runners-up New Zealand at the SCG. After taking on Pakistan, India will play South Africa, Bangladesh and two teams from qualifying as they bid to become T20 world champions for the second time. ‘Definitely, if we win the opening game against Pakistan, we will win the World Cup,’ former India star Raina told NDTV. ‘The team is doing well right now. [Mohammed] Shami has replaced [Jasprit] Bumrah, it will give the side a bit of X-factor. ‘We have Arshdeep Singh, Suryakumar Yadav. Everyone is in good form and Virat Kohli is looking really good. Suresh Raina made more than 300 appearances for India (Picture: Getty) ‘Rohit Sharma is a very good leader and if we win the first match, it will set a good tone for us. Everyone in the country is praying for them and I really want them to win the World Cup.’ India, who currently sit at No. 2 in the ICC rankings, beat Australia in a warm-up match earlier this week and face New Zealand in their final pre-World Cup game tomorrow. Rahul Dravid has been forced to tinker with his squad after losing star bowler Bumrah and all-rounder Ravindra Jadeja to injury on the eve of the World Cup. Bumrah, 28, has been ruled out of the tournament with a back stress fracture, while Jadeja, 33, is struggling with a knee problem. India regular Shami has replaced Bumrah in the India squad. ‘I would not call him a perfect replacement because you cannot replace Jasprit Bumrah or Ravindra Jadeja,’ Raina added. ‘They have played consistently for India and they have given performances. ‘But the best option you had, you have selected him. Shami has given good performances, he has been in good form. ‘BCCI have done really well in sending the team to Australia 15 days prior to the tournament. The grounds are big, overall I think the preparation has been nice. We will need to play fearless cricket and show good intent.’ MORE : Steve Harmison names the five teams that can win the T20 World Cup MORE : Nasser Hussain and Michael Atherton predict T20 World Cup winner For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-10-18 16:28:02","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: Sri Lanka stay alive and Netherlands solidify their claim for Super 12 | READ","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-sri-lanka-stay-alive-and-netherlands-solidify-their-claim-for-super-12-read-dasun-shanaka-2022-10-18-817235","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The ongoing ICC T20 World Cup that is being played in Australia is off to a flyer. Namibia defeated Sri Lanka on the first day ane the race to qualify for the Super 12 stage has intensified. As of now, the Netherlands are the only side that looks like making it to the Super 12. As far as the other teams are concerned, their fate hangs in the balance and they have to register some miraculous performances in order to rub shoulders with the big boys of world cricket.","content":"The ongoing ICC T20 World Cup that is being played in Australia is off to a flyer. Namibia defeated Sri Lanka on the first day ane the race to qualify for the Super 12 stage has intensified. As of now, the Netherlands are the only side that looks like making it to the Super 12. As far as the other teams are concerned, their fate hangs in the balance and they have to register some miraculous performances in order to rub shoulders with the big boys of world cricket. The clash of the champions, both Namibia and Netherlands had won their previous clash and both of them looked to solidify their stand in the qualifiers. The skipper of Namibia, Gerhard Erasmus won the toss and decided to bat first. Michael van Lingen opened the proceedings for Namibia with Divan la Cock. Lingen somehow managed to score 20 off 19 deliveries, but la Cock was dismissed for a golden duck. With Namibia reeling on 32/3, Loftie-Eaton was dismissed for 0 off 2 deliveries. It was only Jan Frylinck who scored 43 off 48 deliveries and propelled Namibia's score to 121. The Netherlands knew that they had to keep wickets in hand to chase this target down as Max ODowd and Vikramjit Singh opened the proceedings for them. The Netherlands were 101/3 by the end of 16 overs. Courtesy of Max ODowd, Vikramjit Singh, and Bas de Leede, Netherlands chased down the target with 3 balls remaining. As of now the United Arab Emirates have a mathematical chance of qualifying for the Super 12 and they will have to wait for the results of other encounters to go their way if they want to qualify.","pubDate":"2022-10-18 16:12:08","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"New BCCI president Binny wants to reduce player injuries, improve pitches","link":"https://www.business-standard.com/article/sports/new-bcci-president-binny-wants-to-reduce-player-injuries-improve-pitches-122101801077_1.html","keywords":null,"creator":null,"video_url":null,"description":"Right after taking charge, new BCCI president Roger Binny on Tuesday said frequent injuries to top India players is a matter of concern and promised to \"get to the bottom of it all\". Improving the pitches for domestic cricket is also high on his agenda. \"We will look to improve on what we can do to reduce the injuries to players,\" Binny told reporters here after taking over BCCI presidency from Sourav Ganguly. \"Players getting frequently injured is a concern, and we wish to get to the bottom of it all and see how it can be changed for the better. \"We have excellent doctors and trainers at the National Cricket Academy (in Bengaluru), but we must look to reduce the injuries and improve recovery.\" India have fielded as many as 40 players across formats in 2022, with injuries being the main reason, apart from multiple series being held simultaneously. The team will be without its premier pacer Jasprit Bumrah and star all-rounder Ravindra Jadeja, all thanks to injuries. While Bumrah","content":null,"pubDate":"2022-10-18 16:09:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221018/thumb-122101801077.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"SCO vs IRE Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s SCO vs IRE T20 World Cup 2022 match No. 7 in Bellerive Oval, 930 AM IST, October 19","link":"https://zeenews.india.com/cricket/sco-vs-ire-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-sco-vs-ire-t20-world-cup-2022-match-no-7-in-bellerive-oval-930-am-ist-october-19-2523848.html","keywords":null,"creator":null,"video_url":null,"description":"Scotland vs Ireland Dream11 Team Prediction Scotland vs Ireland T20 World Cup 2022 Match No. 7 Preview - Check My Dream11 Team, Best players list of SCO vs IRE, Scotland Dream11 Team Player List, Ireland Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-10-18 16:00:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI vs PCB: Jay Shah announces Asia Cup at ‘neutral venue’, Pakistan threatens World Cup pullout","link":"https://www.tribuneindia.com/news/sports/bcci-vs-pcb-jay-shah-announces-asia-cup-at-neutral-venue-pakistan-threatens-world-cup-pullout-442511","keywords":null,"creator":null,"video_url":null,"description":"Mumbai/Karachi, October 18 The Indian and Pakistan cricket boards put themselves on a collision course on Tuesday after BCCI secretary Jay Shah said the 2023 Asia Cup will be played at a neutral venue, prompting the neighbours to threaten a boycott of next year's ODI World Cup. The hosting rights of the 2023 edition of the 50-over Asia Cup has been awarded to Pakistan by the Asian Cricket Council (ACC) as a pre-cursor to the marquee World Cup in India. Incidentally, Shah is the president of the Asian Cricket Council. The matter of India playing the Asia Cup in Pakistan was stated in the notes circulated to the BCCI members before Tuesday's Annual General Meeting (AGM) in Mumbai. \"We have decided to play at a neutral venue,\" Shah was quoted as saying by multiple cricket websites after the conclusion of the AGM. One of the reasons cited for not playing in Pakistan was that there has been precedence in the past of the continental event being shifted at a neutral venue. India hasn't travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terrorist attack on November 26 that year, the scheduled bilateral series in early 2009 was cancelled. The other reason cited was the Sri Lankan team bus being attacked by terrorists in Lahore, after which no international team visited the country for more than a decade due to security reasons. Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn't been any bilateral cricket. The two teams have only played each other at various ICC and ACC events. The PCB is irked as international cricket has resumed in the country with all top nations like England, Australia, West Indies travelling there to play Tests and white-ball rubbers. Sources close to PCB chairman Ramiz Raja indicated that one of the options that they are mulling after Shah's statement is to pull out of the 50-over ICC World Cup in India. \"The PCB is now prepared to take hard decisions and play hard ball because it is also aware that the ICC and ACC events will have to face commercial liabilities and losses if Pakistan does not play India in these multi-team events,\" a senior PCB source told PTI on the condition of anonymity. Pakistan last came to India for a short six-match white-ball bilateral series in 2012. The PCB, when contacted, declined to give an official reaction to Shah's statement. \"We have nothing to say at the moment, but yes, we will look at things and take up this matter at appropriate forums like the ICC board meeting in Melbourne next month,\" a spokesperson said. However, it has been learnt that the PCB chairman and other senior officials were very upset about the announcement by Shah. \"The PCB officials are surprised at the timing of Jay Shah's statement because there is still nearly a year to go before the Asia Cup is held in Pakistan in September 2023,\" an insider said. He said the PCB was aware that the issue of India travelling to Pakistan for the Asia Cup was on the agenda at the BCCI AGM but didn't expect any announcement on this issue at this time. \"The PCB is wondering in what capacity has Jay Shah given the statement that the ACC will look to relocate the Asia Cup to UAE out of Pakistan, because the hosting rights were awarded by the executive board of the ACC, not the president,\" the PCB source said. PCB could pull out of ACC membership The PCB sources said that Raja would be sending a strongly-worded letter to the ACC on the matter and would be demanding an emergency meeting of the ACC board to be convened in Melbourne next month to discuss Shah's statement. The insider also disclosed that the PCB had decided to look at several options and would not accept any disruption to its hosting rights. \"One option under consideration will be to pull out of the ACC as the PCB believes the ACC was formed to promote and develop cricket in the region and forge unity among the member nations. \"But if the president of the ACC is going to give statements like these, there is no use for Pakistan to remain in the body,\" he added.","content":"PTI Mumbai/Karachi, October 18 The Indian and Pakistan cricket boards put themselves on a collision course on Tuesday after BCCI secretary Jay Shah said the 2023 Asia Cup will be played at a neutral venue, prompting the neighbours to threaten a boycott of next year's ODI World Cup. The hosting rights of the 2023 edition of the 50-over Asia Cup has been awarded to Pakistan by the Asian Cricket Council (ACC) as a pre-cursor to the marquee World Cup in India. Incidentally, Shah is the president of the Asian Cricket Council. The matter of India playing the Asia Cup in Pakistan was stated in the notes circulated to the BCCI members before Tuesday's Annual General Meeting (AGM) in Mumbai. \"We have decided to play at a neutral venue,\" Shah was quoted as saying by multiple cricket websites after the conclusion of the AGM. One of the reasons cited for not playing in Pakistan was that there has been precedence in the past of the continental event being shifted at a neutral venue. India hasn't travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terrorist attack on November 26 that year, the scheduled bilateral series in early 2009 was cancelled. The other reason cited was the Sri Lankan team bus being attacked by terrorists in Lahore, after which no international team visited the country for more than a decade due to security reasons. Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn't been any bilateral cricket. The two teams have only played each other at various ICC and ACC events. The PCB is irked as international cricket has resumed in the country with all top nations like England, Australia, West Indies travelling there to play Tests and white-ball rubbers. Sources close to PCB chairman Ramiz Raja indicated that one of the options that they are mulling after Shah's statement is to pull out of the 50-over ICC World Cup in India. \"The PCB is now prepared to take hard decisions and play hard ball because it is also aware that the ICC and ACC events will have to face commercial liabilities and losses if Pakistan does not play India in these multi-team events,\" a senior PCB source told PTI on the condition of anonymity. Pakistan last came to India for a short six-match white-ball bilateral series in 2012. The PCB, when contacted, declined to give an official reaction to Shah's statement. \"We have nothing to say at the moment, but yes, we will look at things and take up this matter at appropriate forums like the ICC board meeting in Melbourne next month,\" a spokesperson said. However, it has been learnt that the PCB chairman and other senior officials were very upset about the announcement by Shah. \"The PCB officials are surprised at the timing of Jay Shah's statement because there is still nearly a year to go before the Asia Cup is held in Pakistan in September 2023,\" an insider said. He said the PCB was aware that the issue of India travelling to Pakistan for the Asia Cup was on the agenda at the BCCI AGM but didn't expect any announcement on this issue at this time. \"The PCB is wondering in what capacity has Jay Shah given the statement that the ACC will look to relocate the Asia Cup to UAE out of Pakistan, because the hosting rights were awarded by the executive board of the ACC, not the president,\" the PCB source said. PCB could pull out of ACC membership The PCB sources said that Raja would be sending a strongly-worded letter to the ACC on the matter and would be demanding an emergency meeting of the ACC board to be convened in Melbourne next month to discuss Shah's statement. The insider also disclosed that the PCB had decided to look at several options and would not accept any disruption to its hosting rights. \"One option under consideration will be to pull out of the ACC as the PCB believes the ACC was formed to promote and develop cricket in the region and forge unity among the member nations. \"But if the president of the ACC is going to give statements like these, there is no use for Pakistan to remain in the body,\" he added. #BCCI #Cricket #Jay Shah #Mumbai #Pakistan","pubDate":"2022-10-18 15:40:50","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1997706672.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB could opt out of Asian Cricket Council if India refuse to travel to Pakistan - Check Details","link":"https://zeenews.india.com/cricket/pcb-could-opt-out-of-asian-cricket-council-if-india-refuse-to-travel-to-pakistan-check-details-2523833.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan is scheduled to host Asia Cup based on the 50-overs format next year. Later in the same year, India is scheduled to host ICC Men's Cricket World Cup.","content":null,"pubDate":"2022-10-18 15:36:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"King meeting fan: Pakistan cricket fans react as Babar Azam meets Sunil Gavaskar ahead of IND vs PAK clash in T20 WC","link":"https://zeenews.india.com/cricket/ind-vs-pak-t20-world-cup-2022-twitter-reacts-as-pakistan-captain-babar-azam-meets-sunil-gavaskar-ahead-india-clash-check-2523807.html","keywords":null,"creator":null,"video_url":null,"description":"Pakistan cricket team hosted a private party for their captain in which India legend Sunil Gavaskar was also invited. Gavaskar had a little chat with Babar at the party and also presented him with an autographed cap.","content":null,"pubDate":"2022-10-18 14:43:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"BCCI president Roger Binny reacts for first time, emphasizes on fitness","link":"https://www.indiatvnews.com/sports/cricket/bcci-president-roger-binny-reacts-for-first-time-emphasizes-on-fitness-sourav-ganguly-jay-shah-arun-singh-dhumal-2022-10-18-817209","keywords":null,"creator":null,"video_url":null,"description":"Defying all odds, former cricketer and World Cup-winning player for India Roger Binny has become the 36th president of the Board of Control for Cricket in India (BCCI). In a recent turn of events, Sourav Ganguly stepped down as BCCI President. He was offered the role of IPL chairman but he turned it down instantly. Jay Shah continues as the BCCI secretary and Arun Singh Dhumal has been made the new Indian Premier League (IPL) chairman.","content":null,"pubDate":"2022-10-18 14:40:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Roger Binny: A cricketer, A Gentleman And 'Ajaatshatru'","link":"https://sports.ndtv.com/cricket/roger-binny-a-cricketer-a-gentleman-and-ajaatshatru-3443008","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Roger Binny, the 36th president of Board of Control for Cricket in India (BCCI), can be termed in one word 'Ajaatshatru' -- a person without any enemies.","content":"If BCCI had constituted its Annual Awards for a 'Gentleman Cricketer' back in the 1980s, Roger Michael Humphrey Binny perhaps would have been a prime nominee to win it season after season. The 36th president of Board of Control for Cricket in India (BCCI) can be termed in one word 'Ajaatshatru' -- a person without any enemies. While in terms of pure cricketing achievements, his immediate predecessor Sourav Ganguly would be miles ahead but if looked in isolation, the reticent man from Bengaluru isn't short of pedigree and could be quietly assertive as and when he wants to. The BCCI couldn't have had a better choice as a player administrator at the helm than Binny, who will easily go down in the history of Indian cricket as one of most hardworking, honest cricketers to have graced the game. In his near four-and-a-half decade association with the sport, Binny has only earned friends -- as a state level player in a star-studded Karnataka team that had stars like Gundappa Viswanath, Erapalli Prasanna, Syed Kirmani, Brijesh Patel, AV Jayaprakash in its ranks. He was immensely popular member of the 1980s Indian team where he and Madan Lal did play a supporting role to Kapil Dev 's strike bowler act for a good seven to eight years. He had his moments under the sun for the Indian team and the 1983 World Cup was as much as his crowning glory as it was for Kapil Dev, Sandeep Patil and Yashpal Sharma. But perhaps, like some of his 83 batch-mates, who despite way lesser achievements compared to him, wear the stardom on their sleeves as if there is no tomorrow, Binny's grace has been his subtlety. Imposition has never been his forte but getting the job done indeed has been his strong points. How revered and loved Binny was could be gauged from one story that his 83 teammate Sunil Valson had once narrated to PTI. \"Roger had an injury during the 83 World Cup and I was supposed to play one of the games. On the morning of the game, there was a fitness Test and the manner in which Roger sprinted, I knew that he would play. \"Although I felt bad for myself, you couldn't feel bad for Roger, who was the sweetest human being you would come across,\" said Valson, who despite being a mean left-arm fast medium, missed out on India. He came in as a strongly-built six-footer, who was a mean swing bowler but also at the same time opened the batting for Karnataka. Because of his huge girth and an imposing lower body, fans back in the day used to jokingly call him \"Jack Fruit\". In England, he was deceptive with his movement in the air and as always was a supporting hero with seven wickets in the 1986 Test match at Headingley, which is more remembered for one of the finest Test hundreds by Dilip Vengsarkar. His opening partnership of 451 with Sanjay Desai against Kerala in the 1977-78 was a world record in first-class cricket for the longest time. He was a specialist opener, who had to come at number 8 or at times even No.9 in Test matches as it was difficult to sneak into the top six, which had players like Sunil Gavaskar , Anshuman Gaikwad, Dilip Vengsarkar, Mohinder Amarnath, Kapil Dev and Ravi Shastri . Despite being an effective swing bowler, Binny's Test career never took off. Only 47 wickets from 27 Tests never portrayed his real quality. Perhaps the lack of pace and India playing for draws on barren tracks became Binny's undoing, save one evening in 1987 when the famous evening River Hooghly breeze blowing across Eden Gardens saw him wreak havoc against Imran Khan's Pakistan bowling from the High Court End. That 6/56 was his best ever figures in Test cricket and incidentally came in his last series. Very few people know that Sunil Gavaskar's last Test match was also Binny's last in the long format game for India. Only difference was that Gavaskar had announced his retirement and Binny was dropped after being given a total of three overs to bowl in an entire Test by captain Kapil Dev. He couldn't help because that was the worst ever track at Chinnaswamy on which Gavaskar's 96 became a part of cricketing folkore and a masterclass on how to play on tracks that can be best described as snake pits. By the end of that year, Binny's international career was over after the first game of the 1987 World Cup where young pair of Geoff Marsh and David Boon, literally hammered him. He continued to play Ranji Trophy for a few more years and as a seasoned skipper led a team that had some of the brightest future stars of Indian cricket -- Rahul Dravid , Javagal Srinath and Venkatesh Prasad to name a few. In an old interaction, Dravid had recalled how Binny had presented him with an India shirt from one of his tours, something that immensely boosted a young man's confidence. When he was named the coach of the India U-19 team in 2000, he was only 45 years old and more like a friend and confidante for the likes of Mohammed Kaif, Reetinder Singh Sodhi, Yuvraj Singh , who all were part of that first ever champion squad. Typically in an understated way, Binny remained away from the limelight and let the Yuvrajs and Kaifs enjoy their first brush with stardom. He became Bengal's Ranji coach at a time when it was going through transition phase with a lot of seniors on the wane. Probably, because of his soft nature, he could never impose strict disciplinarian measures on players. He wanted them to play touch Rugby but they insisted on playing football as warm-up routine. He became national selector in 2012 but in his third year had to relinquish his position after Lodha Committee's 'Conflict of Interest' clause created confusion. The reason being his son Stuart, a decent all-rounder himself, being in national contention. Sunil Gavaskar in one of his columns wrote that he had asked Roger and was told that he has always recused himself whenever Stuart's name would come up for discussion. But he had to quit more because of perception than propriety. Promoted As KSCA president, insiders say that he had largely let secretary Santosh Menon run the show but in the last 6-8 months got himself involved in administrative matters more keenly. Call it destiny, it is his old friend Brijesh Patel and Tamil Nadu strongman N Srinivasan, who engineered his ascension to the top job with only three years of his administrative career left.","pubDate":"2022-10-18 14:36:11","image_url":"https://c.ndtvimg.com/2018-12/uscjojb_roger-binny_625x300_22_December_18.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: SL vs UAE Match Prediction – Who will win today’s T20 WC match between Sri Lanka vs United Arab Emirates? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMipQFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy90MjAtd29ybGQtY3VwLTIwMjItc2wtdnMtdWFlLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy10MjAtd29ybGQtY3VwLW1hdGNoLWJldHdlZW4tc3JpLWxhbmthLXZzLXVhZS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: SL vs UAE Match Prediction – Who will win today’s T20 WC match between Sri Lanka vs United Arab Emirates?  CricTrackerBall-by-ball - how Karthik Meiyappan hat-tricked Sri Lanka  ESPNcricinfoMatch Story | T20 WC: SL brush past UAE, Netherlands continue winning momentum  CricbuzzSL vs UAE Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- ICC T20 World Cup 2022  Cricket AddictorRecent Match Report - Sri Lanka vs U.A.E. 6th Match, First Round Group A 2022/23  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-10-18 13:22:39","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pat Cummins becomes Australia's ODI skipper; 'Collaborative captaincy' could involve David Warner too","link":"https://www.thehansindia.com/sports/cricket/pat-cummins-becomes-australias-odi-skipper-collaborative-captaincy-could-involve-david-warner-too-765906","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Australia have named Pat Cummins their new ODI captain They are yet to announce their side’s vice-captainCummins became Australian men’s 27th ODI skipper","content":"Australia have named Pat Cummins their new ODI captain Australia on Tuesday confirmed fast bowler Pat Cummins as their One-Day International (ODI) captain. He replaced Aaron Finch, who recently retired from the format but has continued his role in the T20Is. Australia's national selector George Bailey on Tuesday spoke about the country's fresh approach on how the team will be led in the ODIs over the next 12 months ahead of the 2023 Cricket World Cup. While Bailey insisted that choosing Cummins as their new ODI captain was a \"no-brainer,\" he also said that with responsibilities growing on the pacer's shoulders, the player won't be expected to play in every single ODI before the 2023 World Cup in India. The Australian cricket team could opt for a collaborative captaincy in the 50-over format, which could see the involvement of David Warner, who is currently facing a lifetime ban from any leadership role. \"We are moving away from this concept of a captain taking over and their leadership being all encompassing,\" Bailey, who is one of the 26 previous ODI captains of Australia, told reporters in Brisbane on Tuesday, according to cricket.com.au. \"Pat used the word the other day – it's a collaboration at times. It's one of Pat's great strengths that he's a collaborative leader. We've been really clear with not just Pat but all our multi-format players that we will continue to manage them across all formats. We're very clear on prioritising key series. I also think we've got a number of players who can assume the leadership should they need to. \"I don't expect to see Pat play every one-day game in the lead-in to the World Cup, so I expect that we might see two or three guys take the leadership for a game at some stage,\" added Bailey. Pat Cummins has been named Australia's 27th ODI captain 🙌 pic.twitter.com/T0p02wwjiP Among the players who could be involved in Australia's collaborative captaincy are Alex Carey, who led Australia in an ODI series in the Caribbean last year, Steve Smith, a former all-format skipper, and Warner, whose lifetime leadership ban handed down following the 2018 ball-tampering controversy could be reconsidered after Cricket Australia's Board announced a review of the organisation's code of conduct. David Warner's leadership is 'highly respected' – George Bailey Bailey also opened up on Warner's critics who have changed their opinion about the southpaw since the infamous Sandpaper Gate in Cape Town. \"What I do hope is that it happens in a really timely manner,\" Bailey said of CA's code of conduct review. \"The longer that drags out just leads to (more) speculation. I don't think that's helpful for David. \"David's leadership within the group is fantastic, titled or not. It's highly respected. I think it's a credit to David that a number of people externally who are now saying it's a no-brainer that he should hold a leadership position were, 18 months, two years ago, some of the strongest advocates for him having a life ban. It's a credit to David that he has worked on himself. Internally I can't speak highly enough of what he brings to the group – as do a number of players,\" the former Australian captain explained further. Meanwhile, Cummins, who became Australia's 27th captain of the men's ODI side, had earlier stated that he would expect to lean significantly on others to lead for certain series. \"You'd probably need to look at it a little bit differently to perhaps in the past with so much cricket going on, if I was offered it. Just playing every single game isn't realistic. We've got a handful of guys that play all three formats. In a year like this, T20 becomes the focus leading to a World Cup. Next year might be different with the one-day World Cup. But with 15 Test matches in the next six months, I don't think you can expect the captain to play every game just because he is the captain,\" Cummins had said before the announcement was made. While Cummins became the first fast bowler to lead Australia's men's team in white-ball cricket, he also was the first bowler since the late Shane Warne filled in for 11 ODIs in the late 1990s.","pubDate":"2022-10-18 13:21:59","image_url":"https://assets.thehansindia.com/h-upload/2022/10/18/500x300_1316876-david-warner.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"New BCCI president Binny wants to reduce player injuries, improve pitches for domestic cricket","link":"https://economictimes.indiatimes.com/news/sports/new-bcci-president-binny-wants-to-reduce-player-injuries-improve-pitches-for-domestic-cricket/articleshow/94946445.cms","keywords":null,"creator":null,"video_url":null,"description":"India have fielded as many as 40 players across formats in 2022, with injuries being the main reason, apart from multiple series being held simultaneously. The team will be without its premier pacer Jasprit Bumrah and star all-rounder Ravindra Jadeja, all thanks to injuries.","content":null,"pubDate":"2022-10-18 13:06:29","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-62110,resizemode-4,msid-94946445/new-bcci-president-binny-wants-to-reduce-player-injuries-improve-pitches-for-domestic-cricket.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs New Zealand warm up match Live Telecast Channel in India: When and where to watch IND vs NZ Gabba practice match?","link":"https://thesportsrush.com/cricket-news-india-vs-new-zealand-warm-up-match-live-telecast-channel-in-india-when-and-where-to-watch-ind-vs-nz-gabba-practice-match/","keywords":["Cricket","ICC T20 World Cup 2022","India","New Zealand"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs New Zealand warm up match Live Telecast: The SportsRush presents before you the timing and live streaming details of IND vs NZ practice match. It has finally come down to the last warm-up match for the Indian cricket team before their much-awaited first ICC T20 World Cup 2022 match against arch-rivals Pakistan in… The post India vs New Zealand warm up match Live Telecast Channel in India: When and where to watch IND vs NZ Gabba practice match? appeared first on The SportsRush.","content":"India vs New Zealand warm up match Live Telecast: The SportsRush presents before you the timing and live streaming details of IND vs NZ practice match. It has finally come down to the last warm-up match for the Indian cricket team before their much-awaited first ICC T20 World Cup 2022 match against arch-rivals Pakistan in Melbourne on Sunday. Having last played against each other in the shortest format 11 months ago, New Zealand and India will be facing each other in the last practice match before the commencement of the Super 12 round later this month. A rare batting collapse for the Black Caps at the Allan Border Field saw them bundling out for 98 in 17.1 overs against South Africa yesterday. Not the kind of performance which Kane Williamson and his men would have hoped for especially after losing the final of New Zealand T20I Tri-Nation series 2022 against Pakistan earlier this month, the Kiwis would be wanting to make instance amends at the Gabba tomorrow. India, on the other hand, held their nerves in a crunch situation against hosts Australia on Monday to register a 6-run victory. With pacer Mohammed Shami’s form emerging as the pinnacle of an Indian victory, the Indian team management would be preparing him for bowl his four-over quota at least once before October 23. India vs New Zealand warm up match Live Telecast Channel in India Star Sports Network will continue to both televise and stream the last round of warm-up matches for this tournament. Given the number of matches to be played on Wednesday, it is difficult to predict the exact channel for this warm-up match. Having said that, readers are advised to go through Star’s channels tomorrow afternoon. Unlike the previous match featuring India, this one will be played at night (according to the local time). Fans, who prefer to stream live cricket, will be be able to do so on Disney+Hotstar but with a paid subscription. Let’s go pic.twitter.com/2a7hSuqyi6 — Virat Kohli (@imVkohli) October 18, 2022 Date – 19/10/2022 (Monday). Match start Time – 01:30 PM (India). TV Channel – Star Sports Network (India). Online platform – Disney+Hotstar (India). The post India vs New Zealand warm up match Live Telecast Channel in India: When and where to watch IND vs NZ Gabba practice match? appeared first on The SportsRush.","pubDate":"2022-10-18 12:44:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Binny's agenda: reducing player injuries, improving pitches for domestic cricket - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2JjY2ktcHJlc2lkZW50LXJvZ2VyLWJpbm55cy1hZ2VuZGEtcmVkdWNpbmctcGxheWVyLWluanVyaWVzLWFuZC1pbXByb3ZpbmctcGl0Y2hlcy1mb3ItZG9tZXN0aWMtY3JpY2tldC0xMzQwNDg00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Binny's agenda: reducing player injuries, improving pitches for domestic cricket  ESPNcricinfoMeet new BCCI president Roger Binny: Railway guard's son, World Cup winner, dog-rescuer, loves fishing but doesn't rock the boat  The Indian Express'Bumrah injury before World Cup...': BCCI president Roger Binny's 2 priorities  Hindustan TimesBCCI president Roger Binny wants to reduce player injuries, improve pitches for domestic cricket  MoneycontrolBCCI will work on reducing injuries to players, says new board president Roger Binny  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-10-18 12:30:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pat Cummins says he will not appear in any more ads for Cricket Australia energy company sponsor - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMi9vY3QvMTgvcGF0LWN1bW1pbnMtc2F5cy1oZS13aWxsLW5vdC1hcHBlYXItaW4tYW55LW1vcmUtYWRzLWZvci1jcmlja2V0LWF1c3RyYWxpYS1lbmVyZ3ktY29tcGFueS1zcG9uc29y0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pat Cummins says he will not appear in any more ads for Cricket Australia energy company sponsor  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-10-18 12:19:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"“He is outstanding”: Dasun Shanaka lauds Man of the Match Pathum Nissanka for his innings vs UAE in T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-he-is-outstanding-dasun-shanaka-lauds-man-of-the-match-pathum-nissanka-for-his-innings-vs-uae-in-t20-world-cup-2022/","keywords":["Cricket","Dasun Shanaka","ICC T20 World Cup 2022","Pathum Nissanka","Sri Lanka vs UAE"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Dasun Shanaka had a lot of praise for Pathum Nissanka, who won Man of the Match for his excellent half-century against UAE. After losing the first match against Namibia, the Sri Lankan team made an excellent comeback in the match against UAE. It was a do-or-die match for them, and they were ruthless in their… The post “He is outstanding”: Dasun Shanaka lauds Man of the Match Pathum Nissanka for his innings vs UAE in T20 World Cup 2022 appeared first on The SportsRush.","content":"After losing the first match against Namibia, the Sri Lankan team made an excellent comeback in the match against UAE. It was a do-or-die match for them, and they were ruthless in their approach. Sri Lanka defeated UAE by a huge margin of 79 runs. UAE opted to bowl first, and their bowlers did a fairly decent job. They managed to restrict Sri Lanka for a score of 152-8, where spinner Karthik Meiyappan took an excellent . Sri Lankan opener Pathum Nissanka was excellent, and he scored 74 runs in just 60 balls with the help of 2 sixes and 6 boundaries. In reply, the UAE batters failed miserably, and they got all out for just 73 runs. Dushmantha Chameera and Wanindu Hasaranga took 3 wickets each, whereas Maheesh Theekshana had a couple of scalps. Sri Lankan captain Dasun Shanaka attended the post-match conference after the game where he thanked the crowd for their support throughout the match. He said that they were disappointed with the batting effort as they were looking to score around 180-90 runs. Shanka added that their only target was to win the match, and he knew that once the bowlers get going, it won’t be easy for the UAE batters to counter them. “I thank the crowd for coming all the way from Melbourne. We were disappointed with 150, we could have ended up with 180-90, the tone was set up front but myself and Danu didn’t click in the middle. We focus on the win only, so once Chameera and Hasaranga got going it wasn’t going to be easy for them,” Dasun Shanaka said at the post-match conference. A fighting knock by Pathum Nissanka 👊 — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) Shanaka had a lot of praise for the youngster Pathum Nissanka, who also won the Man of the Match award for his excellent performance in the match. He called Nissanka an outstanding cricketer and appreciated his focus as well. “Nissanka’s focus is to bat through the innings, he is outstanding, that is his focus and I am pleased for him,” Shanaka added.","pubDate":"2022-10-18 12:10:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2023: BCCI secretary Jay Shah teases neutral venue to host marquee cricketing event","link":"https://www.indiatvnews.com/sports/cricket/asia-cup-2023-bcci-secretary-jay-shah-teases-neutral-venue-to-host-marquee-cricketing-event-2022-10-18-817167","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2023: The Rohit Sharma-led Indian team is currently stationed in Australia and is gearing up for the all-important World Cup. Riding high on the backs of a series win against Australia and South Africa, the Indian cricket team will want to start their World Cup on a victorious note. On the other hand, there is the Board of Control for Cricket in India (BCCI) which is doing the rounds of the headlines owing to the presidential elections. ","content":null,"pubDate":"2022-10-18 12:07:15","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ireland vs Scotland T20 head to head record: IRE vs SCO head to head records and stats","link":"https://thesportsrush.com/cricket-news-ireland-vs-scotland-t20-head-to-head-record-ire-vs-sco-head-to-head-records-and-stats/","keywords":["Cricket","ICC T20 World Cup 2022","Ireland","Scotland"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ireland vs Scotland T20 head to head: The SportsRush presents for you the Head to Head statistics for IRE vs SCO T20 World Cup match. Ireland and Scotland will resume their T20I rivalry after more than three years in the seventh First Round match of ICC T20 World Cup 2022. Just like these two teams’… The post Ireland vs Scotland T20 head to head record: IRE vs SCO head to head records and stats appeared first on The SportsRush.","content":"Ireland and Scotland will resume their T20I rivalry after more than three years in the seventh First Round match of ICC T20 World Cup 2022. Just like these two teams’ respective tournament opener yesterday, even this match will be played at the Bellerive Oval. Ireland, who enjoy a brilliant T20I head-to-head record against Scotland, face a must-win match after losing against Zimbabwe on Monday. With eyes on Super 12 qualification, Irish cricketers would be looking to further strengthen their head-to-head record against this opposition. Scotland, on the other hand, will be playing this match on the back of defeating West Indies by a 42-run margin. As cliched as it sounds, Scotland would be wanting to carry forward the momentum to move a step closer to qualifying for the next round for the second time in as many years. The countdown to tomorrow is on – let’s go! 👊 ☘️🏏 — Cricket Ireland (@cricketireland) Played in Dublin in September 2019, the last Ireland-Scotland T20I had resulted in an archetype cliffhanger. Chasing a 187-run target, Scotland had done all the hard work before falling short by a solitary run. With multiple players from both the teams having played that match, fans can expect a stellar match on Tuesday. Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-10-18 11:46:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Roger Binny takes over as 36th President of BCCI; a look at the boardâ€™s new office bearers","link":"https://www.moneycontrol.com/news/sports/roger-binny-takes-over-as-36th-presidentbccilook-atboardâ€™s-new-office-bearers_16660321.html","keywords":null,"creator":null,"video_url":null,"description":"Bangalore-born Binny, who was part of India#39;s historic 1983 World Cup-winning squad, steps into the shoes of Sourav Ganguly, widely regarded as one of cricket#39;s greatest captains.","content":null,"pubDate":"2022-10-18 11:43:33","image_url":null,"source_id":"moneycontrol","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian cricket board approves women’s IPL at AGM","link":"https://economictimes.indiatimes.com/news/sports/bcci-annual-general-meeting-approves-womens-ipl/articleshow/94943154.cms","keywords":null,"creator":null,"video_url":null,"description":"The demand for WIPL has been growing for some years now, and BCCI secretary Jay Shah was pushing hard for it, said a senior source in the BCCI. Earlier, on June 15th, Shah had told ET in an exclusive interview that the board had big plans for women’s IPL.","content":null,"pubDate":"2022-10-18 11:19:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-96094,resizemode-4,msid-94943154/indian-cricket-board-approves-womens-ipl-at-agm.jpg","source_id":"economictimes_indiatimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Australian cricket captain Pat Cummins denies involvement in the end of sponsorship deal with Alinta Energy","link":"https://thewest.com.au/sport/cricket/australian-cricket-captain-pat-cummins-denies-involvement-in-the-end-of-sponsorship-deal-with-alinta-energy-c-8578978","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Cricket Australia will part ways with major sponsor Alinta Energy at the end of this summer, but captain and climate activist Pat Cummins has denied having any involvement in the demise of the lucrative deal.","content":null,"pubDate":"2022-10-18 11:02:09","image_url":"https://images.thewest.com.au/publication/C-8578978/66373a030edadb4d6de15d76e6468a89957c4e47-16x9-x0y118w4435h2495.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL Governing Council Told To Finalise Details: Rajeev Shukla","link":"https://sports.ndtv.com/cricket/ipl-governing-council-told-to-finalise-details-rajeev-shukla-on-womens-ipl-3441796","keywords":["Cricket"],"creator":["ANI"],"video_url":null,"description":"The former IPL Chairman commented on the BCCI's stand for the International Cricket Council (ICC) chairman post saying that the board has not decided on anything as the elections for the apex council...","content":"The Board of Control for Cricket in India's newly appointed Vice-President Rajeev Shukla confirmed the women's IPL was in the pipeline after the BCCI's Annual General Meeting on Tuesday. Shukla shared the updates regarding the Women's Indian Premier League (IPL) stating that the IPL governing council has been asked to finalize the details for the tournament with the franchise auction to be decided later. \"We have in principle decided to start women's IPL. IPL governing council was asked to finalise the details for the same. Franchise auction and all other things will be decided in some time,\" informed Rajeev Shukla. The former IPL Chairman commented on the BCCI's stand for the International Cricket Council (ICC) chairman post saying that the board has not decided on anything as the elections for the apex council were still far off. \"We have not decided anything on the ICC Chairman post yet. As a tradition all the members have authorised the office bearers to take a call on that, we are still to nominate our members for apex council. ICC elections are still far away and we will take a call at the appropriate time,\" disclosed Shukla. Former Indian cricketer Roger Binny was elected as the 36th President of the Indian cricket body, Board of Control for Cricket in India (BCCI), replacing Sourav Ganguly on Tuesday. The 91st Annual General Meeting of the Board of Control for Cricket in India (BCCI) was held in Mumbai. Notably, Binny was the only candidate to have filed a nomination for the top post. Promoted Sourav Ganguly ended his BCCI President's stint after three years. Jay Shah will continue to serve as the BCCI Secretary. Ashish Shelar has been appointed as BCCI Treasurer. Rajeev Shukla will be the vice president, whereas Devajit Saikia will be the joint secretary. Arun Dhumal has been appointed as the Indian Premier League (IPL) Chairman.","pubDate":"2022-10-18 10:53:58","image_url":"https://c.ndtvimg.com/2020-04/397a53q8_rajeev-shukla-pti_625x300_09_April_20.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-UAE&#039;s Meiyappan takes first hat-trick of T20 World Cup","link":"https://www.thestar.com.my/sport/cricket/2022/10/18/cricket-uae039s-meiyappan-takes-first-hat-trick-of-t20-world-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - United Arab Emirates spinner Karthik Meiyappan dismissed Sri Lanka's Bhanuka Rajapaksa, Charith Asalanka and captain Dasun Shanaka to claim a hat-trick in a Twenty20 World Cup Group A match in Australia on Tuesday. Read full story","content":null,"pubDate":"2022-10-18 10:17:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"}]}