{"newsArray":[{"title":"IPL winners and runners-up list from 2008 to 2022","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-winners-and-runners-up-from-2008-to-2022-12350472.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL winners and runners-up list from 2008 to 2022","content":"Cricket IPL winners and runners-up list from 2008 to 2022 As we get ready for IPL 2023, take a look at the winners and runners-up from all the previous editions of the Indian Premier League. FP Trending March 25th, 2023 16:40:26 IST Gujarat Titans are the seventh new team to win the IPL trophy. Sportzpics The 16th season of the Indian Premier League (IPL) is set to commence on 31 March with the first match between defending champions Gujarat Titans and Chennai Super Kings. Since its introduction in 2008, the franchise tournament has come a long way as it has witnessed as many as seven different teams lifting the silverware over the years. Mumbai Indians have been the most successful franchise with five titles, which came in 2013, 2015, 2017, 2019 and 2020. Chennai Super Kings, known to be Mumbai’s arch-rivals, are trailing just behind them. The Yellow franchise has engraved its name on the coveted trophy four times so far with the latest one in 2021. Kolkata Knight Riders also have a rich history, becoming the champions twice. The teams who have tasted success once include Rajasthan Royals, now-defunct Deccan Chargers, Sunrisers Hyderabad and Gujarat Titans. In IPL 2022, Gujarat Titans made a roaring entry into the tournament with India all-rounder Hardik Pandya leading from the front. The new entrants suffered just four defeats during the group league, advancing to the knockout stage as the table-topper. In the first playoff, they got the better of Rajasthan Royals to directly qualify for the final. Rajasthan got a rematch by advancing to the final after winning the second play-off match. But Gujarat once again outclassed them, winning the final by 7 wickets. Gujarat Titans will begin their title defense with the first match against Chennai Super Kings, slated to be hosted on 31 March at the Narendra Modi Stadium in Ahmedabad. The date for the playoffs and final is still not out. With the IPL 2023 just around the corner, let’s take a look at the winners of previous editions: Season Winner Runner-up Player of the match 2008 Rajasthan Royals (RR) Chennai Super Kings (CSK) Yusuf Pathan 2009 Deccan Chargers (DC) Royal Challengers Bangalore (RCB) Anil Kumble 2010 Chennai Super Kings (CSK) Mumbai Indians (MI) Suresh Raina 2011 Chennai Super Kings (CSK) Royal Challengers Bangalore (RCB) Murali Vijay 2012 Kolkata Knight Riders (KKR) Chennai Super Kings (CSK) Manvinder Bisla 2013 Mumbai Indians (MI) Chennai Super Kings (CSK) Kieron Pollard 2014 Kolkata Knight Riders (KKR) Kings XI Punjab (KXIP) Manish Pandey 2015 Mumbai Indians (MI) Chennai Super Kings (CSK) Rohit Sharma 2016 Sunrisers Hyderabad (SRH) Royal Challengers Bangalore (RCB) Ben Cutting 2017 Mumbai Indians (MI) Rising Pune Supergiant (RPS) Krunal Pandya 2018 Chennai Super Kings (CSK) Sunrisers Hyderabad (SRH) Shane Watson 2019 Mumbai Indians (MI) Chennai Super Kings (CSK) Jasprit Bumrah 2020 Mumbai Indians (MI) Delhi Capitals (DC) Trent Boult 2021 Chennai Super Kings (CSK) Kolkata Knight Riders (KKR) Faf du Plessis 2022 Gujarat Titans Rajasthan Royals Hardik Pandya Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 16:40:26 IST Tags: Cricket Ipl Ipl 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 11:10:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Hardik-Pandya-records-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"LIVE SCORES: Proteas v West Indies first T20","link":"https://www.thesouthafrican.com/sport/cricket/sa-cricket/live-scores-proteas-versus-west-indies-first-t20-breaking-saturday-25-march-2023/","keywords":["SA Cricket","Aiden Markram","Featured","Proteas"],"creator":["Craig Lewis"],"video_url":null,"description":"Follow all the live action as a powerful Proteas team takes on the West Indies in the first T20 on Saturday.","content":"A new limited-overs era began with a recent 1-1 ODI series draw between the Proteas and West Indies, and the teams now head into T20 action. ALSO READ: Kapp ‘heartbroken’ as Van Niekerk heads into shock retirement The Proteas have named a powerful squad for this series, with in-form Aiden Markram taking on the captaincy duties in a key new role for the talented batsman. You can follow all the live scoring below, with play getting underway at 2pm: Proteas T20I squad against West Indies Aiden Markram (captain, Momentum Multiply Titans), Quinton de Kock (Momentum Multiply Titans), Bjorn Fortuin (DP World Lions), Reeza Hendricks (DP World Lions), Marco Jansen (Dafabet Warriors) , Heinrich Klaasen (Momentum Multiply Titans), Sisanda Magala (DP World Lions), David Miller (Hollywoodbets Dolphins), Lungi Ngidi (Momentum Multiply Titans), Anrich Nortje (Dafabet Warriors), Wayne Parnell (Six Gun Grill Western Province), Kagiso Rabada (DP World Lions), Rilee Rossouw (ITEC Knights), Tabraiz Shamsi (Momentum Multiply Titans), Tristan Stubbs (Dafabet Warriors). ALSO READ: Temba Bavuma laments dearth of Test cricket Proteas Team Management against West Indies Rob Walter (Head Coach), Khomotso Volvo Masubelele (Team Manager), JP Duminy (Batting Coach), Rory Kleinveldt (Bowling Coach), Wandile Gwavu (Fielding Coach), Matthew Reuben (Performance Analyst), Runeshan Moodley (Strength and Conditioning coach), Sizwe Hadebe (Physiotherapist), Dr Hashendra Ramjee (Team Doctor), Kyle Botha (Logistics and Masseur), Zunaid Wadee (Security), Lucy Davey (Media Manager). ALSO READ: Proteas complete series whitewash of West Indies South Africa T20 International Series against West Indies Saturday, 25 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Sunday, 26 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Tuesday, 28 March at 18:00 South Africa vs West Indies – DP World Wanderers Stadium, Johannesburg IN CLOSING | Australian publication deletes ‘fat-shamed’ article on Proteas star","pubDate":"2023-03-25 10:46:46","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-curtains-for-all-rounders-delhi-capitals-coach-ricky-ponting-on-new-impact-player-rule-12350002.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule","content":"Cricket IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule Starting this IPL season, the teams will have to name four substitutes at the toss. One of these four can be called into play at any point in the game FP Sports March 25th, 2023 16:14:41 IST File image of former Australian captain and Delhi Capitals coach Ricky Ponting. Image: BCCI/IPL Former Aussie captain and Delhi Capitals head coach Ricky Ponting believes that the new ‘ Impact Player ’ rule is curtains for all-rounders in the IPL. Given that a team now has the option to get in a proper batter or bowler, Ponting said, they won’t anymore need to play someone who can do a bit of both. “It actually almost negates the role of allrounders in the game now. So unless they’re absolutely world-class and they’re getting picked either as a batsman or as a bowler, not sort of a bits and pieces guy, then I don’t think you’ll see many, many teams this year actually use the guy that might bat at seven and maybe bowling over or two. Because you don’t need those guys anymore,” Ponting said. “It [usage of Impact Player] depends on if you bat or bowl first,” Ponting said while talking about how a side can use the impact player. “So, at the toss, we will be putting in a bowling-first team and a batting-first team. And obviously if you bat first, you’re probably going to sub in a batter. Or if you bat first and lose an early wicket, you might want to bring in a batter straight on top of that. So, there are several different ways to use it. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 16:14:41 IST Tags: Impact Player Ipl 2023 Ipl 2023 Dc Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 10:44:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/thequint-2020-10-4eae1d88-21ae-4.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"DC vs MIW WPL 2023 Final Dream11 prediction: Fantasy cricket tips for Delhi Capitals vs Mumbai Indians Women","link":"https://www.dnaindia.com/cricket/report-dc-vs-miw-wpl-2023-final-dream11-prediction-fantasy-cricket-tips-for-delhi-capitals-vs-mumbai-indians-women-3032230","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Delhi Capitals finished at the top of the points table with six wins and two losses, while the Mumbai Indians had the same number of victories and defeats.","content":"The highly anticipated Women's Premier League 2023 Final is set to take place on March 26th at the Brabourne Stadium in Mumbai, where the Delhi Capitals will face off against the Mumbai Indians. It's no secret that these two teams have been the strongest contenders throughout the tournament, and their journey to the final has been nothing short of impressive. The Delhi Capitals finished at the top of the points table with six wins and two losses, while the Mumbai Indians had the same number of victories and defeats. However, the Capitals secured their spot in the final due to their superior net run rate. On the other hand, the Mumbai Indians had to battle it out in the Eliminator match against the UP Warriorz, but their hard work and determination paid off as they secured their place in the final. This final match promises to be a nail-biting affair, as both teams have been equally dominant throughout the tournament. In fact, they have already faced each other twice this season, with each team winning one game each. The battle for supremacy in this final match will ultimately crown the ultimate champions of the Women's Premier League 2023. Match Details Delhi Capitals vs Mumbai Indians, WPL final Date & Time: March 26, 7:30 PM Venue: Brabourne Stadium, Mumbai MIW vs DCW Dream11 Prediction Wicketkeeper: Yastika Bhatia Batters: Harmanpreet Kaur, Verma, Rodrigues, Meg Lanning All-rounders: Kapp, Alice Capsey, Hayley Matthews Bowlers: Ishqaue, Wong, Nat Sciver-Brunt MIW vs DCW My Dream11 team Yastika Bhatia, Meg Lanning, Harmanpreet Kaur, Shafali Verma, Hayley Matthews, Nat Sciver-Brunt, Marizanne Kapp, Amelia Kerr, Alice Capsey, Shikha Pandey, Issy Wong READ| Meet Harleen Deol, the 'Beauty Queen' of women's cricket who is often mistaken for Bollywood actress","pubDate":"2023-03-25 10:43:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Former Australia captain Tim Paine hints at coaching role post retirement","link":"https://www.indiatvnews.com/sports/cricket/former-australia-captain-tim-paine-hints-at-coaching-role-post-retirement-2023-03-25-857572","keywords":null,"creator":null,"video_url":null,"description":"Former Australia Test captain Tim Paine has hinted at taking up a coaching job following his retirement from all forms of cricket recently. The 38-year-old played his last domestic career game for Tasmania against Queensland in Sheffield Shield last week.","content":"Former Australia Test captain Tim Paine has hinted at taking up a coaching job following his retirement from all forms of cricket recently. The 38-year-old played his last domestic career game for Tasmania against Queensland in Sheffield Shield last week. Paine led Australia in a handful of Test matches after the 2018 sandpaper saga and also created history by retaining in England. Overall, Paine played 35 Tests, 35 ODIs, and 12 T20Is for his country while featuring in a mammoth 154 FC games, 136 List A, and 81 T20 matches during his career that lasted for almost two decades. He stepped down as skipper days before the start of the 2021-22 Ashes series at home. \"It's an emotional time when you move on from something that you love doing and you care deeply about, but I'll still be involved in the game of cricket,\" Paine was quoted as saying by cricket. com.au, \"To come back and do that, it was nice to finish on my home ground,\" he added. The veteran cricketer said it's been an emotional time since he decided to retire from the game. \"My phone has been going berserk, from all around the world as well, which is nice. It's made me a bit emotional reading some of the messages and social media stuff people have sent. I came in the doors at Cricket Tasmania when I was 12 years old, 26 years ago, which is a long time,\" said Paine. \"It's an emotional time when you move on from something that you love doing and you care deeply about, but I'll still be involved in the game of cricket,\" added Paine who made his debut against Pakistan, where he was capped alongside in 2010.","pubDate":"2023-03-25 10:37:48","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"From Shibani Dandekar to Karishma Kotak: Most glamorous and beautiful female anchors in IPL history","link":"https://www.dnaindia.com/cricket/report-ipl-2023-glamorous-beautiful-female-anchors-ipl-shibani-dandekar-karishma-kotak-mandira-rochelle-rao-mayanti-3032227","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Some of the popular female anchors of the IPL are Mayanti Langer, Archana Vijaya, Mandira Bedi. Karishma Kotak, and Shibani Dandekar.","content":"Indian Premier League (IPL) is without doubt one of the most popular sporting leagues in the world. The IPL grabs the attentions of millions of people across the world not only because of its fast bowlers and power-hitters, but also for its glamorous and pretty female anchors. Some of the popular anchors of the IPL are Mayanti Langer, Archana Vijaya, Mandira Bedi. Karishma Kotak, and Shibani Dandekar. 1. Archana Vijaya Archana Vijaya made her IPL debut as an anchor in 2011. She is best known for anchoring IPL Extraaa Innings and traveling with IPL teams across the country. 2. Mandira Bedi Mandira Bedi is one of the most popular female TV anchors in India. She hosted only one season of the IPL in 2009, but cricket fans still remember her for her good grasp over the game. 3. Shibani Dandekar Shibani Dandekar is known for her glamourous looks and broad knowledge of the game of cricket. She appeared as anchor in five seasons of the IPL from 2011 to 2015. 4. Mayanti Langer The glamorous anchor is married to Indian all-rounder Stuart Binny. Mayanti Langer is one of the most popular faces in Indian sports broadcasting. Mayanti is currently associated with Star Sports and is likely to host the upcoming IPL 2023. 5. Rochelle Rao Rochelle Rao is a model and has featured in the Kingfisher Calendar too. In 2012, Rochelle was crowned Miss India International. She was associated with the Indian Premier League in 2015-16. 6. Karishma Kotak Karishma Kotak was the anchor of the sixth edition of the Indian Premier League, which was held in 2013. Karishma Kotak is also a supermodel.","pubDate":"2023-03-25 10:27:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Delhi hopes to cash in on ‘Kapp impact’","link":"https://www.thehindu.com/sport/cricket/delhi-hopes-to-cash-in-on-kapp-impact/article66658024.ece","keywords":null,"creator":null,"video_url":null,"description":"Ours is such a well-balanced side and credit has to go to the people who have put together this team, says South African star","content":"Marizanne Kapp has made a huge impact at the WPL. But, that was almost inevitable. She was Player-of-the-Match in The Hundred finals in England, in 2021 and 2022; so also in the WBBL 2021-22 final. She thus played key roles in making Oval Invincibles and Perth Scorchers champions. Delhi Capitals must be hoping Kapp does her special thing once again in a league final. The South African has to her credit 3,545 runs and 223 wickets in international white-ball cricket, has been one of the main reasons for Capitals’ direct entry to Sunday’s title-clash. She has the WPL’s best bowling figures — her five for 15 was an exceptional spell against Gujarat Giants — and in her six innings, she went past 30 four times. She has done all that while going through emotional turmoil. Her South African teammate and life partner Dane van Niekerk — she was signed up by RCB — recently announced her retirement from international cricket. “RCB has been so good to her and everyone would have loved to see her on the park, but just being here and finding her feet again was helpful for her,” said Kapp in an exclusive interview with The Hindu. “We both made our international debut in 2009 and here we are. Even though she is only 29, she has been playing for 14 years. She hopefully will continue to play in these leagues.” Kapp is enjoying her time at the WPL. “I started a bit slow (with my bowling) and wasn’t too happy, but I got better. Now we are in the final, I can’t be happier. After coming from South Africa, I took a while to adjust to the wickets here. My spell against Gujarat was probably my best in T20 cricket.” She is glad to be part of Capitals. “Ours is such a well-balanced side and credit has to go to the people who have put together this team after a lot of research,” she said. “The major thing for us is that a lot of players are contributing.”","pubDate":"2023-03-25 09:51:59","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form","link":"https://www.firstpost.com/firstcricket/sports-news/if-you-try-to-save-someone-the-game-will-only-bite-you-ajay-jadeja-comments-on-suryakumar-yadavs-poor-form-12350252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form","content":"Cricket 'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form India missed the currently-injured Shreyas Iyer against Australia, and Suryakumar was given with the responsibility to fill in Iyer’s spot. FirstCricket Staff March 25th, 2023 15:21:42 IST Suryakumar Yadav walks back dejectedly after getting dismissed for a third consecutive golden duck during the third ODI between India and Australia in Chennai. AFP Aggressive India batter Suryakumar Yadav endured a forgettable ODI series against Australia recently, as he registered three golden ducks off as many ODIs at home. SKY, as he is affectionately called, had ended up as the top run-scorer in T20Is in 2022, amassing 1164 runs from 31 ODIs, but has been unable to recreate that magic into the ODIs this year. India missed the currently-injured Shreyas Iyer against Australia, and Suryakumar was given with the responsibility to fill in Iyer’s spot. While Yadav was dismissed by Mitchell Starc in the first two matches, Ashton Agar claimed the batter’s wicket in the series-decider in Chennai. SKY was even demoted to No 7 in the third ODI, a move that was a ‘huge blunder’ by the Indian team management, according to former cricketer Ajay Jadeja. “He’s the same Suryakumar Yadav who scored 360 degrees across the ground. It isn’t as if he doesn’t know how to play. It’s all about the mindset. When someone like Virat Kohli faced so many months out of form, it means there’s something in the mind that affects your game. If you’re thinking too much, and you’re making the player wait for his batting, the doubt only increases,” Jadeja was quoted as saying by Cricbuzz. The 52-year-old further stated why playing SKY at No 7 did not help India’s case. “In our days, it used to be said that if someone isn’t in form, and if he plays at no.4 and you send him at no.7, it will always be more challenging. You will always feel more comfortable when you bat up the order. When you come at no.7, whatever strength you have in your batting, you’ve already lost 60-80 percent of it. You haven’t made it any easier. You can only regain form when you play ahead. You can’t save anyone. If you try to save someone, this game will only bite you more,” Jadeja added. The 32-year-old has played lesser ODIs than compared to T20Is. In 23 matches he has played so far, Suryakumar has managed just 433 runs at an average of 24.05. This year is crucial for both Suryakumar and Team India, with an ODI World Cup at home scheduled to begin in about six months’ time. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 15:21:42 IST Tags: Ajay Jadeja Cricket Suryakumar Yadav Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:51:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Suryakumar-Yadav-India-Australia-3rd-ODI-AFP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum","link":"https://www.firstpost.com/firstcricket/sports-news/same-problem-as-the-2019-odi-world-cup-zaheer-khan-on-indias-number-four-batting-position-conundrum-12350282.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum","content":"Cricket 'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum Surya Kumar Yadav ­— who was expected to take the charge of regular number four batter — registered back-to-back back golden ducks in the India-Australia Australia ODI series. This has brought about uncertainty over the batting position FP Sports March 25th, 2023 15:20:49 IST File image of Zaheer Khan. Sportzpics With Shreyas Iyer injured and Suryakumar Yadav out of form, former Indian pacer Zaheer Khan believes the same middle-order batting position conundrum has returned to haunt India ahead of the ODI World Cup this year. Suryakumar Yadav ­— who was expected to take the charge of regular number four batter — registered back-to-back golden ducks in the India-Australia ODI series across all three games. This has brought about uncertainty over the number four batting position. Khan said that this was the same problem for India in 2019. It was believed to be one of the reasons India could not go beyond the semi-final. “The batting order is something which they will have to definitely look at again. They will have to figure out the number 4 option again. That is something which was the discussion leading to the 2019 World Cup as well. We are talking about four years down the line now if we are in the same boat. Yes, I understand Shreyas Iyer was your designated number 4. You are really looking at him taking that role and responsibility but if he is going to be injured now for the longer time then you have to really find these answers,” Zaheer said on Cricbuzz . India’s captain Rohit Sharma, however, has backed Yadav after the team’s loss in the third ODI against Australia. A lower back injury for Iyer, meanwhile, had ruled him out of final Test against Australia in Ahmedabad and the ODI series too. Iyer is also set to miss at least part of the IPL with Kolkata Knight Riders. (KKR). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 15:20:49 IST Tags: 2023 Odi World Cup Suryakumar Yadav Zaheer Khan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:50:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Zaheer-Khan-Mumbai-Indians-practice-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-factbox-royal-challengers-bangalore-rcb-8807701.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore","content":"Cricket IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore Despite having some of the best squads, Royal Challengers Bangalore have failed to lift the IPL title so far. FirstCricket Staff March 25th, 2023 15:18:08 IST RCB captain Faf du Plessis and Virat Kohli. Sportzpics IPL titles : 0 Royal Challengers Bangalore have been the dragons without fire over the years. Season after season, they boast of a formidable team, consisting of world-beaters, especially in the batting line-up. But most of the time they have disappointed. However, there has been an uptick in their recent performances, with RCB reaching the playoffs in 2020, 2021 and 2022. Overall they have ended up runners-up in three seasons. Here’s how they have fared year on year How did they fare the previous season : With Virat Kohli giving up the captaincy, the responsibility fell to Faf du Plessis, who was in his first season at RCB. The team finished fourth in the table with eight wins from 14 matches and 16 points to reach the playoffs. They defeated Lucknow Super Giants by 14 runs in the Eliminator but lost to Rajasthan Royals by seven wickets in Qualifier 2. Win Percentage : RCB are one of only three teams to have more losses than wins (for teams to have played more than 100 matches). They possess a win percentage of 48.65. Of the 227 matches played, they have won 107 and lost 113 with four ending in no result. Of the three Super Overs they have been a part of, they have won two and lost one. Highest Run-getter : Virat Kohli RCB have the best batter in their line-up. He is also the top run-getter in the league with 6624 runs from 215 innings at 36.20. He has scored five tons, the most in the league and the third-most number of 50-plus scores – 44. Highest wicket-taker : Yuzvendra Chahal Chahal had been the backbone of the RCB bowling line-up which has struggled over the years. In his eight years at the franchise, he picked up 139 wickets from 112 innings at 22.03. He’s possessed an impressive economy rate of 7.58 and a strike rate of 17.4 and has two four-fers to his name. Chahal joined Rajasthan Royals in 2022. Among the current lot, Harshal Patel, who was bought back for 10.75 crore by RCB in the IPL 2022 auction, is the highest wicket-taker with 85 wickets from 64 innings at 21.64. He possesses an economy rate of 8.22 and strike rate of 15.7. Highest individual score : Chris Gayle 175 not out vs Pune Warriors at Bengaluru in 2013 23 April 2013 was the day the Universe Boss went berserk and clobbered the Pune bowlers all over the part at the M Chinnaswamy Stadium. He was unstoppable that day as he hammered 13 fours and 17 sixes on his way to 175 not out off 66 balls. He propelled RCB to 263/5 and then the team restricted Pune to 133/9 to win the match by 130 runs. Gayle’s 175 not out still stands as the highest individual score in the league. Highest team score : The Gayle Storm that hit Pune Warriors was also the day RCB registered their highest total in the league – 263/5. Gayle also ended up getting two wickets in the match going with his unbeaten 175. Favourite opponent : Delhi Capitals Delhi are one of two sides side against whom RCB have won more than they have lost (For teams against whom RCB has played 10 or more matches). They have won 17 of their 29 matches and lost 10 with a win percentage of 62.5 percent. The other team against whom they have more than 50 percent win percentage is Rajasthan Royals – 52. Bogey team : Chennai Super Kings Chennai Super Kings have had the wood over RCB winning 20 of the 31 matches and losing 10. RCB, with 33.33 win percent against CSK, have their lowest win percentage against any team (For teams against whom RCB has played 10 or more matches) Lesser known facts : RCB hold the record for highest and lowest scores in the league. Highest – 263/5 vs PWI at Bengaluru in 2013. Lowest – 49 vs KKR at the Eden Gardens in 2017, Chasing 132, RCB were bundled out for 49 as KKR bowlers ran riot at the Eden Gardens. No batsman even managed a double digit score. Yuzvendra Chahal has taken 51 wickets at the M Chinnaswamy Stadium in IPL from 42 matches at a SR of 16.61 – the most by any RCB bowler at a venue in IPL. Retention, purchases and squad Players retained: Faf du Plessis, Virat Kohli, Suyash Prabhudessai, Rajat Patidar, Dinesh Karthik, Anuj Rawat, Finn Allen, Glenn Maxwell, Wanindu Hasaranga, Shahbaz Ahmed, Harshal Patel, David Willey, Karn Sharma, Mahipal Lomror, Mohammed Siraj, Josh Hazlewood, Siddarth Kaul, Akash Deep Players released: Sherfane Rutherford, Luvnith Sisodia, Aneeshwar Gautam, Chama Milind IPL 2022 auction players purchased : Reece Topley – Rs 1.9 crore Will Jacks – Rs 3.2 crore (replaced by Michael Bracewell) Manoj Bhandage – Rs 20 lakh Rajan Kumar – Rs 70 lakh Avinash Singh – Rs 60 lakh Sonu Yadav – Rs 20 lakh Purse left: Rs 1.75 crore RCB full squad : Faf du Plessis (c), Virat Kohli, Suyash Prabhudessai, Rajat Patidar, Dinesh Karthik, Anuj Rawat, Finn Allen, Glenn Maxwell, Wanindu Hasaranga, Shahbaz Ahmed, Harshal Patel, David Willey, Karn Sharma, Mahipal Lomror, Mohammed Siraj, Josh Hazlewood, Siddarth Kaul, Akash Deep, Reece Topley, Himanshu Sharma, Michael Bracewell, Manoj Bhandage, Rajan Kumar, Avinash Singh, Sonu Yadav. Click here to read factboxes of all teams Click here to follow comprehensive coverage of IPL 20223 Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram Updated Date: March 25, 2023 15:18:08 IST Tags: Faf Du Plessis Ipl 2023 Ipl 2023 Rcb Ipl Factbox Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:48:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/RCB-review-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL winners and runners-up list from 2008 to 2022","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-winners-and-runners-up-from-2008-to-2022-12350472.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL winners and runners-up list from 2008 to 2022","content":"Cricket IPL winners and runners-up list from 2008 to 2022 As we get ready for IPL 2023, take a look at the winners and runners-up from all the previous editions of the Indian Premier League. FP Trending March 25th, 2023 16:40:26 IST Gujarat Titans are the seventh new team to win the IPL trophy. Sportzpics The 16th season of the Indian Premier League (IPL) is set to commence on 31 March with the first match between defending champions Gujarat Titans and Chennai Super Kings. Since its introduction in 2008, the franchise tournament has come a long way as it has witnessed as many as seven different teams lifting the silverware over the years. Mumbai Indians have been the most successful franchise with five titles, which came in 2013, 2015, 2017, 2019 and 2020. Chennai Super Kings, known to be Mumbai’s arch-rivals, are trailing just behind them. The Yellow franchise has engraved its name on the coveted trophy four times so far with the latest one in 2021. Kolkata Knight Riders also have a rich history, becoming the champions twice. The teams who have tasted success once include Rajasthan Royals, now-defunct Deccan Chargers, Sunrisers Hyderabad and Gujarat Titans. In IPL 2022, Gujarat Titans made a roaring entry into the tournament with India all-rounder Hardik Pandya leading from the front. The new entrants suffered just four defeats during the group league, advancing to the knockout stage as the table-topper. In the first playoff, they got the better of Rajasthan Royals to directly qualify for the final. Rajasthan got a rematch by advancing to the final after winning the second play-off match. But Gujarat once again outclassed them, winning the final by 7 wickets. Gujarat Titans will begin their title defense with the first match against Chennai Super Kings, slated to be hosted on 31 March at the Narendra Modi Stadium in Ahmedabad. The date for the playoffs and final is still not out. With the IPL 2023 just around the corner, let’s take a look at the winners of previous editions: Season Winner Runner-up Player of the match 2008 Rajasthan Royals (RR) Chennai Super Kings (CSK) Yusuf Pathan 2009 Deccan Chargers (DC) Royal Challengers Bangalore (RCB) Anil Kumble 2010 Chennai Super Kings (CSK) Mumbai Indians (MI) Suresh Raina 2011 Chennai Super Kings (CSK) Royal Challengers Bangalore (RCB) Murali Vijay 2012 Kolkata Knight Riders (KKR) Chennai Super Kings (CSK) Manvinder Bisla 2013 Mumbai Indians (MI) Chennai Super Kings (CSK) Kieron Pollard 2014 Kolkata Knight Riders (KKR) Kings XI Punjab (KXIP) Manish Pandey 2015 Mumbai Indians (MI) Chennai Super Kings (CSK) Rohit Sharma 2016 Sunrisers Hyderabad (SRH) Royal Challengers Bangalore (RCB) Ben Cutting 2017 Mumbai Indians (MI) Rising Pune Supergiant (RPS) Krunal Pandya 2018 Chennai Super Kings (CSK) Sunrisers Hyderabad (SRH) Shane Watson 2019 Mumbai Indians (MI) Chennai Super Kings (CSK) Jasprit Bumrah 2020 Mumbai Indians (MI) Delhi Capitals (DC) Trent Boult 2021 Chennai Super Kings (CSK) Kolkata Knight Riders (KKR) Faf du Plessis 2022 Gujarat Titans Rajasthan Royals Hardik Pandya Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 16:40:26 IST Tags: Cricket Ipl Ipl 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 11:10:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Hardik-Pandya-records-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"LIVE SCORES: Proteas v West Indies first T20","link":"https://www.thesouthafrican.com/sport/cricket/sa-cricket/live-scores-proteas-versus-west-indies-first-t20-breaking-saturday-25-march-2023/","keywords":["SA Cricket","Aiden Markram","Featured","Proteas"],"creator":["Craig Lewis"],"video_url":null,"description":"Follow all the live action as a powerful Proteas team takes on the West Indies in the first T20 on Saturday.","content":"A new limited-overs era began with a recent 1-1 ODI series draw between the Proteas and West Indies, and the teams now head into T20 action. ALSO READ: Kapp ‘heartbroken’ as Van Niekerk heads into shock retirement The Proteas have named a powerful squad for this series, with in-form Aiden Markram taking on the captaincy duties in a key new role for the talented batsman. You can follow all the live scoring below, with play getting underway at 2pm: Proteas T20I squad against West Indies Aiden Markram (captain, Momentum Multiply Titans), Quinton de Kock (Momentum Multiply Titans), Bjorn Fortuin (DP World Lions), Reeza Hendricks (DP World Lions), Marco Jansen (Dafabet Warriors) , Heinrich Klaasen (Momentum Multiply Titans), Sisanda Magala (DP World Lions), David Miller (Hollywoodbets Dolphins), Lungi Ngidi (Momentum Multiply Titans), Anrich Nortje (Dafabet Warriors), Wayne Parnell (Six Gun Grill Western Province), Kagiso Rabada (DP World Lions), Rilee Rossouw (ITEC Knights), Tabraiz Shamsi (Momentum Multiply Titans), Tristan Stubbs (Dafabet Warriors). ALSO READ: Temba Bavuma laments dearth of Test cricket Proteas Team Management against West Indies Rob Walter (Head Coach), Khomotso Volvo Masubelele (Team Manager), JP Duminy (Batting Coach), Rory Kleinveldt (Bowling Coach), Wandile Gwavu (Fielding Coach), Matthew Reuben (Performance Analyst), Runeshan Moodley (Strength and Conditioning coach), Sizwe Hadebe (Physiotherapist), Dr Hashendra Ramjee (Team Doctor), Kyle Botha (Logistics and Masseur), Zunaid Wadee (Security), Lucy Davey (Media Manager). ALSO READ: Proteas complete series whitewash of West Indies South Africa T20 International Series against West Indies Saturday, 25 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Sunday, 26 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Tuesday, 28 March at 18:00 South Africa vs West Indies – DP World Wanderers Stadium, Johannesburg IN CLOSING | Australian publication deletes ‘fat-shamed’ article on Proteas star","pubDate":"2023-03-25 10:46:46","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-curtains-for-all-rounders-delhi-capitals-coach-ricky-ponting-on-new-impact-player-rule-12350002.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule","content":"Cricket IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule Starting this IPL season, the teams will have to name four substitutes at the toss. One of these four can be called into play at any point in the game FP Sports March 25th, 2023 16:14:41 IST File image of former Australian captain and Delhi Capitals coach Ricky Ponting. Image: BCCI/IPL Former Aussie captain and Delhi Capitals head coach Ricky Ponting believes that the new ‘ Impact Player ’ rule is curtains for all-rounders in the IPL. Given that a team now has the option to get in a proper batter or bowler, Ponting said, they won’t anymore need to play someone who can do a bit of both. “It actually almost negates the role of allrounders in the game now. So unless they’re absolutely world-class and they’re getting picked either as a batsman or as a bowler, not sort of a bits and pieces guy, then I don’t think you’ll see many, many teams this year actually use the guy that might bat at seven and maybe bowling over or two. Because you don’t need those guys anymore,” Ponting said. “It [usage of Impact Player] depends on if you bat or bowl first,” Ponting said while talking about how a side can use the impact player. “So, at the toss, we will be putting in a bowling-first team and a batting-first team. And obviously if you bat first, you’re probably going to sub in a batter. Or if you bat first and lose an early wicket, you might want to bring in a batter straight on top of that. So, there are several different ways to use it. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 16:14:41 IST Tags: Impact Player Ipl 2023 Ipl 2023 Dc Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 10:44:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/thequint-2020-10-4eae1d88-21ae-4.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"DC vs MIW WPL 2023 Final Dream11 prediction: Fantasy cricket tips for Delhi Capitals vs Mumbai Indians Women","link":"https://www.dnaindia.com/cricket/report-dc-vs-miw-wpl-2023-final-dream11-prediction-fantasy-cricket-tips-for-delhi-capitals-vs-mumbai-indians-women-3032230","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Delhi Capitals finished at the top of the points table with six wins and two losses, while the Mumbai Indians had the same number of victories and defeats.","content":"The highly anticipated Women's Premier League 2023 Final is set to take place on March 26th at the Brabourne Stadium in Mumbai, where the Delhi Capitals will face off against the Mumbai Indians. It's no secret that these two teams have been the strongest contenders throughout the tournament, and their journey to the final has been nothing short of impressive. The Delhi Capitals finished at the top of the points table with six wins and two losses, while the Mumbai Indians had the same number of victories and defeats. However, the Capitals secured their spot in the final due to their superior net run rate. On the other hand, the Mumbai Indians had to battle it out in the Eliminator match against the UP Warriorz, but their hard work and determination paid off as they secured their place in the final. This final match promises to be a nail-biting affair, as both teams have been equally dominant throughout the tournament. In fact, they have already faced each other twice this season, with each team winning one game each. The battle for supremacy in this final match will ultimately crown the ultimate champions of the Women's Premier League 2023. Match Details Delhi Capitals vs Mumbai Indians, WPL final Date & Time: March 26, 7:30 PM Venue: Brabourne Stadium, Mumbai MIW vs DCW Dream11 Prediction Wicketkeeper: Yastika Bhatia Batters: Harmanpreet Kaur, Verma, Rodrigues, Meg Lanning All-rounders: Kapp, Alice Capsey, Hayley Matthews Bowlers: Ishqaue, Wong, Nat Sciver-Brunt MIW vs DCW My Dream11 team Yastika Bhatia, Meg Lanning, Harmanpreet Kaur, Shafali Verma, Hayley Matthews, Nat Sciver-Brunt, Marizanne Kapp, Amelia Kerr, Alice Capsey, Shikha Pandey, Issy Wong READ| Meet Harleen Deol, the 'Beauty Queen' of women's cricket who is often mistaken for Bollywood actress","pubDate":"2023-03-25 10:43:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Former Australia captain Tim Paine hints at coaching role post retirement","link":"https://www.indiatvnews.com/sports/cricket/former-australia-captain-tim-paine-hints-at-coaching-role-post-retirement-2023-03-25-857572","keywords":null,"creator":null,"video_url":null,"description":"Former Australia Test captain Tim Paine has hinted at taking up a coaching job following his retirement from all forms of cricket recently. The 38-year-old played his last domestic career game for Tasmania against Queensland in Sheffield Shield last week.","content":"Former Australia Test captain Tim Paine has hinted at taking up a coaching job following his retirement from all forms of cricket recently. The 38-year-old played his last domestic career game for Tasmania against Queensland in Sheffield Shield last week. Paine led Australia in a handful of Test matches after the 2018 sandpaper saga and also created history by retaining in England. Overall, Paine played 35 Tests, 35 ODIs, and 12 T20Is for his country while featuring in a mammoth 154 FC games, 136 List A, and 81 T20 matches during his career that lasted for almost two decades. He stepped down as skipper days before the start of the 2021-22 Ashes series at home. \"It's an emotional time when you move on from something that you love doing and you care deeply about, but I'll still be involved in the game of cricket,\" Paine was quoted as saying by cricket. com.au, \"To come back and do that, it was nice to finish on my home ground,\" he added. The veteran cricketer said it's been an emotional time since he decided to retire from the game. \"My phone has been going berserk, from all around the world as well, which is nice. It's made me a bit emotional reading some of the messages and social media stuff people have sent. I came in the doors at Cricket Tasmania when I was 12 years old, 26 years ago, which is a long time,\" said Paine. \"It's an emotional time when you move on from something that you love doing and you care deeply about, but I'll still be involved in the game of cricket,\" added Paine who made his debut against Pakistan, where he was capped alongside in 2010.","pubDate":"2023-03-25 10:37:48","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"From Shibani Dandekar to Karishma Kotak: Most glamorous and beautiful female anchors in IPL history","link":"https://www.dnaindia.com/cricket/report-ipl-2023-glamorous-beautiful-female-anchors-ipl-shibani-dandekar-karishma-kotak-mandira-rochelle-rao-mayanti-3032227","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Some of the popular female anchors of the IPL are Mayanti Langer, Archana Vijaya, Mandira Bedi. Karishma Kotak, and Shibani Dandekar.","content":"Indian Premier League (IPL) is without doubt one of the most popular sporting leagues in the world. The IPL grabs the attentions of millions of people across the world not only because of its fast bowlers and power-hitters, but also for its glamorous and pretty female anchors. Some of the popular anchors of the IPL are Mayanti Langer, Archana Vijaya, Mandira Bedi. Karishma Kotak, and Shibani Dandekar. 1. Archana Vijaya Archana Vijaya made her IPL debut as an anchor in 2011. She is best known for anchoring IPL Extraaa Innings and traveling with IPL teams across the country. 2. Mandira Bedi Mandira Bedi is one of the most popular female TV anchors in India. She hosted only one season of the IPL in 2009, but cricket fans still remember her for her good grasp over the game. 3. Shibani Dandekar Shibani Dandekar is known for her glamourous looks and broad knowledge of the game of cricket. She appeared as anchor in five seasons of the IPL from 2011 to 2015. 4. Mayanti Langer The glamorous anchor is married to Indian all-rounder Stuart Binny. Mayanti Langer is one of the most popular faces in Indian sports broadcasting. Mayanti is currently associated with Star Sports and is likely to host the upcoming IPL 2023. 5. Rochelle Rao Rochelle Rao is a model and has featured in the Kingfisher Calendar too. In 2012, Rochelle was crowned Miss India International. She was associated with the Indian Premier League in 2015-16. 6. Karishma Kotak Karishma Kotak was the anchor of the sixth edition of the Indian Premier League, which was held in 2013. Karishma Kotak is also a supermodel.","pubDate":"2023-03-25 10:27:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Delhi hopes to cash in on ‘Kapp impact’","link":"https://www.thehindu.com/sport/cricket/delhi-hopes-to-cash-in-on-kapp-impact/article66658024.ece","keywords":null,"creator":null,"video_url":null,"description":"Ours is such a well-balanced side and credit has to go to the people who have put together this team, says South African star","content":"Marizanne Kapp has made a huge impact at the WPL. But, that was almost inevitable. She was Player-of-the-Match in The Hundred finals in England, in 2021 and 2022; so also in the WBBL 2021-22 final. She thus played key roles in making Oval Invincibles and Perth Scorchers champions. Delhi Capitals must be hoping Kapp does her special thing once again in a league final. The South African has to her credit 3,545 runs and 223 wickets in international white-ball cricket, has been one of the main reasons for Capitals’ direct entry to Sunday’s title-clash. She has the WPL’s best bowling figures — her five for 15 was an exceptional spell against Gujarat Giants — and in her six innings, she went past 30 four times. She has done all that while going through emotional turmoil. Her South African teammate and life partner Dane van Niekerk — she was signed up by RCB — recently announced her retirement from international cricket. “RCB has been so good to her and everyone would have loved to see her on the park, but just being here and finding her feet again was helpful for her,” said Kapp in an exclusive interview with The Hindu. “We both made our international debut in 2009 and here we are. Even though she is only 29, she has been playing for 14 years. She hopefully will continue to play in these leagues.” Kapp is enjoying her time at the WPL. “I started a bit slow (with my bowling) and wasn’t too happy, but I got better. Now we are in the final, I can’t be happier. After coming from South Africa, I took a while to adjust to the wickets here. My spell against Gujarat was probably my best in T20 cricket.” She is glad to be part of Capitals. “Ours is such a well-balanced side and credit has to go to the people who have put together this team after a lot of research,” she said. “The major thing for us is that a lot of players are contributing.”","pubDate":"2023-03-25 09:51:59","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form","link":"https://www.firstpost.com/firstcricket/sports-news/if-you-try-to-save-someone-the-game-will-only-bite-you-ajay-jadeja-comments-on-suryakumar-yadavs-poor-form-12350252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form","content":"Cricket 'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form India missed the currently-injured Shreyas Iyer against Australia, and Suryakumar was given with the responsibility to fill in Iyer’s spot. FirstCricket Staff March 25th, 2023 15:21:42 IST Suryakumar Yadav walks back dejectedly after getting dismissed for a third consecutive golden duck during the third ODI between India and Australia in Chennai. AFP Aggressive India batter Suryakumar Yadav endured a forgettable ODI series against Australia recently, as he registered three golden ducks off as many ODIs at home. SKY, as he is affectionately called, had ended up as the top run-scorer in T20Is in 2022, amassing 1164 runs from 31 ODIs, but has been unable to recreate that magic into the ODIs this year. India missed the currently-injured Shreyas Iyer against Australia, and Suryakumar was given with the responsibility to fill in Iyer’s spot. While Yadav was dismissed by Mitchell Starc in the first two matches, Ashton Agar claimed the batter’s wicket in the series-decider in Chennai. SKY was even demoted to No 7 in the third ODI, a move that was a ‘huge blunder’ by the Indian team management, according to former cricketer Ajay Jadeja. “He’s the same Suryakumar Yadav who scored 360 degrees across the ground. It isn’t as if he doesn’t know how to play. It’s all about the mindset. When someone like Virat Kohli faced so many months out of form, it means there’s something in the mind that affects your game. If you’re thinking too much, and you’re making the player wait for his batting, the doubt only increases,” Jadeja was quoted as saying by Cricbuzz. The 52-year-old further stated why playing SKY at No 7 did not help India’s case. “In our days, it used to be said that if someone isn’t in form, and if he plays at no.4 and you send him at no.7, it will always be more challenging. You will always feel more comfortable when you bat up the order. When you come at no.7, whatever strength you have in your batting, you’ve already lost 60-80 percent of it. You haven’t made it any easier. You can only regain form when you play ahead. You can’t save anyone. If you try to save someone, this game will only bite you more,” Jadeja added. The 32-year-old has played lesser ODIs than compared to T20Is. In 23 matches he has played so far, Suryakumar has managed just 433 runs at an average of 24.05. This year is crucial for both Suryakumar and Team India, with an ODI World Cup at home scheduled to begin in about six months’ time. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 15:21:42 IST Tags: Ajay Jadeja Cricket Suryakumar Yadav Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:51:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Suryakumar-Yadav-India-Australia-3rd-ODI-AFP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum","link":"https://www.firstpost.com/firstcricket/sports-news/same-problem-as-the-2019-odi-world-cup-zaheer-khan-on-indias-number-four-batting-position-conundrum-12350282.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum","content":"Cricket 'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum Surya Kumar Yadav ­— who was expected to take the charge of regular number four batter — registered back-to-back back golden ducks in the India-Australia Australia ODI series. This has brought about uncertainty over the batting position FP Sports March 25th, 2023 15:20:49 IST File image of Zaheer Khan. Sportzpics With Shreyas Iyer injured and Suryakumar Yadav out of form, former Indian pacer Zaheer Khan believes the same middle-order batting position conundrum has returned to haunt India ahead of the ODI World Cup this year. Suryakumar Yadav ­— who was expected to take the charge of regular number four batter — registered back-to-back golden ducks in the India-Australia ODI series across all three games. This has brought about uncertainty over the number four batting position. Khan said that this was the same problem for India in 2019. It was believed to be one of the reasons India could not go beyond the semi-final. “The batting order is something which they will have to definitely look at again. They will have to figure out the number 4 option again. That is something which was the discussion leading to the 2019 World Cup as well. We are talking about four years down the line now if we are in the same boat. Yes, I understand Shreyas Iyer was your designated number 4. You are really looking at him taking that role and responsibility but if he is going to be injured now for the longer time then you have to really find these answers,” Zaheer said on Cricbuzz . India’s captain Rohit Sharma, however, has backed Yadav after the team’s loss in the third ODI against Australia. A lower back injury for Iyer, meanwhile, had ruled him out of final Test against Australia in Ahmedabad and the ODI series too. Iyer is also set to miss at least part of the IPL with Kolkata Knight Riders. (KKR). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 15:20:49 IST Tags: 2023 Odi World Cup Suryakumar Yadav Zaheer Khan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:50:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Zaheer-Khan-Mumbai-Indians-practice-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-factbox-royal-challengers-bangalore-rcb-8807701.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore","content":"Cricket IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore Despite having some of the best squads, Royal Challengers Bangalore have failed to lift the IPL title so far. FirstCricket Staff March 25th, 2023 15:18:08 IST RCB captain Faf du Plessis and Virat Kohli. Sportzpics IPL titles : 0 Royal Challengers Bangalore have been the dragons without fire over the years. Season after season, they boast of a formidable team, consisting of world-beaters, especially in the batting line-up. But most of the time they have disappointed. However, there has been an uptick in their recent performances, with RCB reaching the playoffs in 2020, 2021 and 2022. Overall they have ended up runners-up in three seasons. Here’s how they have fared year on year How did they fare the previous season : With Virat Kohli giving up the captaincy, the responsibility fell to Faf du Plessis, who was in his first season at RCB. The team finished fourth in the table with eight wins from 14 matches and 16 points to reach the playoffs. They defeated Lucknow Super Giants by 14 runs in the Eliminator but lost to Rajasthan Royals by seven wickets in Qualifier 2. Win Percentage : RCB are one of only three teams to have more losses than wins (for teams to have played more than 100 matches). They possess a win percentage of 48.65. Of the 227 matches played, they have won 107 and lost 113 with four ending in no result. Of the three Super Overs they have been a part of, they have won two and lost one. Highest Run-getter : Virat Kohli RCB have the best batter in their line-up. He is also the top run-getter in the league with 6624 runs from 215 innings at 36.20. He has scored five tons, the most in the league and the third-most number of 50-plus scores – 44. Highest wicket-taker : Yuzvendra Chahal Chahal had been the backbone of the RCB bowling line-up which has struggled over the years. In his eight years at the franchise, he picked up 139 wickets from 112 innings at 22.03. He’s possessed an impressive economy rate of 7.58 and a strike rate of 17.4 and has two four-fers to his name. Chahal joined Rajasthan Royals in 2022. Among the current lot, Harshal Patel, who was bought back for 10.75 crore by RCB in the IPL 2022 auction, is the highest wicket-taker with 85 wickets from 64 innings at 21.64. He possesses an economy rate of 8.22 and strike rate of 15.7. Highest individual score : Chris Gayle 175 not out vs Pune Warriors at Bengaluru in 2013 23 April 2013 was the day the Universe Boss went berserk and clobbered the Pune bowlers all over the part at the M Chinnaswamy Stadium. He was unstoppable that day as he hammered 13 fours and 17 sixes on his way to 175 not out off 66 balls. He propelled RCB to 263/5 and then the team restricted Pune to 133/9 to win the match by 130 runs. Gayle’s 175 not out still stands as the highest individual score in the league. Highest team score : The Gayle Storm that hit Pune Warriors was also the day RCB registered their highest total in the league – 263/5. Gayle also ended up getting two wickets in the match going with his unbeaten 175. Favourite opponent : Delhi Capitals Delhi are one of two sides side against whom RCB have won more than they have lost (For teams against whom RCB has played 10 or more matches). They have won 17 of their 29 matches and lost 10 with a win percentage of 62.5 percent. The other team against whom they have more than 50 percent win percentage is Rajasthan Royals – 52. Bogey team : Chennai Super Kings Chennai Super Kings have had the wood over RCB winning 20 of the 31 matches and losing 10. RCB, with 33.33 win percent against CSK, have their lowest win percentage against any team (For teams against whom RCB has played 10 or more matches) Lesser known facts : RCB hold the record for highest and lowest scores in the league. Highest – 263/5 vs PWI at Bengaluru in 2013. Lowest – 49 vs KKR at the Eden Gardens in 2017, Chasing 132, RCB were bundled out for 49 as KKR bowlers ran riot at the Eden Gardens. No batsman even managed a double digit score. Yuzvendra Chahal has taken 51 wickets at the M Chinnaswamy Stadium in IPL from 42 matches at a SR of 16.61 – the most by any RCB bowler at a venue in IPL. Retention, purchases and squad Players retained: Faf du Plessis, Virat Kohli, Suyash Prabhudessai, Rajat Patidar, Dinesh Karthik, Anuj Rawat, Finn Allen, Glenn Maxwell, Wanindu Hasaranga, Shahbaz Ahmed, Harshal Patel, David Willey, Karn Sharma, Mahipal Lomror, Mohammed Siraj, Josh Hazlewood, Siddarth Kaul, Akash Deep Players released: Sherfane Rutherford, Luvnith Sisodia, Aneeshwar Gautam, Chama Milind IPL 2022 auction players purchased : Reece Topley – Rs 1.9 crore Will Jacks – Rs 3.2 crore (replaced by Michael Bracewell) Manoj Bhandage – Rs 20 lakh Rajan Kumar – Rs 70 lakh Avinash Singh – Rs 60 lakh Sonu Yadav – Rs 20 lakh Purse left: Rs 1.75 crore RCB full squad : Faf du Plessis (c), Virat Kohli, Suyash Prabhudessai, Rajat Patidar, Dinesh Karthik, Anuj Rawat, Finn Allen, Glenn Maxwell, Wanindu Hasaranga, Shahbaz Ahmed, Harshal Patel, David Willey, Karn Sharma, Mahipal Lomror, Mohammed Siraj, Josh Hazlewood, Siddarth Kaul, Akash Deep, Reece Topley, Himanshu Sharma, Michael Bracewell, Manoj Bhandage, Rajan Kumar, Avinash Singh, Sonu Yadav. Click here to read factboxes of all teams Click here to follow comprehensive coverage of IPL 20223 Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram Updated Date: March 25, 2023 15:18:08 IST Tags: Faf Du Plessis Ipl 2023 Ipl 2023 Rcb Ipl Factbox Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:48:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/RCB-review-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL winners and runners-up list from 2008 to 2022","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-winners-and-runners-up-from-2008-to-2022-12350472.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL winners and runners-up list from 2008 to 2022","content":"Cricket IPL winners and runners-up list from 2008 to 2022 As we get ready for IPL 2023, take a look at the winners and runners-up from all the previous editions of the Indian Premier League. FP Trending March 25th, 2023 16:40:26 IST Gujarat Titans are the seventh new team to win the IPL trophy. Sportzpics The 16th season of the Indian Premier League (IPL) is set to commence on 31 March with the first match between defending champions Gujarat Titans and Chennai Super Kings. Since its introduction in 2008, the franchise tournament has come a long way as it has witnessed as many as seven different teams lifting the silverware over the years. Mumbai Indians have been the most successful franchise with five titles, which came in 2013, 2015, 2017, 2019 and 2020. Chennai Super Kings, known to be Mumbai’s arch-rivals, are trailing just behind them. The Yellow franchise has engraved its name on the coveted trophy four times so far with the latest one in 2021. Kolkata Knight Riders also have a rich history, becoming the champions twice. The teams who have tasted success once include Rajasthan Royals, now-defunct Deccan Chargers, Sunrisers Hyderabad and Gujarat Titans. In IPL 2022, Gujarat Titans made a roaring entry into the tournament with India all-rounder Hardik Pandya leading from the front. The new entrants suffered just four defeats during the group league, advancing to the knockout stage as the table-topper. In the first playoff, they got the better of Rajasthan Royals to directly qualify for the final. Rajasthan got a rematch by advancing to the final after winning the second play-off match. But Gujarat once again outclassed them, winning the final by 7 wickets. Gujarat Titans will begin their title defense with the first match against Chennai Super Kings, slated to be hosted on 31 March at the Narendra Modi Stadium in Ahmedabad. The date for the playoffs and final is still not out. With the IPL 2023 just around the corner, let’s take a look at the winners of previous editions: Season Winner Runner-up Player of the match 2008 Rajasthan Royals (RR) Chennai Super Kings (CSK) Yusuf Pathan 2009 Deccan Chargers (DC) Royal Challengers Bangalore (RCB) Anil Kumble 2010 Chennai Super Kings (CSK) Mumbai Indians (MI) Suresh Raina 2011 Chennai Super Kings (CSK) Royal Challengers Bangalore (RCB) Murali Vijay 2012 Kolkata Knight Riders (KKR) Chennai Super Kings (CSK) Manvinder Bisla 2013 Mumbai Indians (MI) Chennai Super Kings (CSK) Kieron Pollard 2014 Kolkata Knight Riders (KKR) Kings XI Punjab (KXIP) Manish Pandey 2015 Mumbai Indians (MI) Chennai Super Kings (CSK) Rohit Sharma 2016 Sunrisers Hyderabad (SRH) Royal Challengers Bangalore (RCB) Ben Cutting 2017 Mumbai Indians (MI) Rising Pune Supergiant (RPS) Krunal Pandya 2018 Chennai Super Kings (CSK) Sunrisers Hyderabad (SRH) Shane Watson 2019 Mumbai Indians (MI) Chennai Super Kings (CSK) Jasprit Bumrah 2020 Mumbai Indians (MI) Delhi Capitals (DC) Trent Boult 2021 Chennai Super Kings (CSK) Kolkata Knight Riders (KKR) Faf du Plessis 2022 Gujarat Titans Rajasthan Royals Hardik Pandya Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 16:40:26 IST Tags: Cricket Ipl Ipl 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 11:10:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Hardik-Pandya-records-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"LIVE SCORES: Proteas v West Indies first T20","link":"https://www.thesouthafrican.com/sport/cricket/sa-cricket/live-scores-proteas-versus-west-indies-first-t20-breaking-saturday-25-march-2023/","keywords":["SA Cricket","Aiden Markram","Featured","Proteas"],"creator":["Craig Lewis"],"video_url":null,"description":"Follow all the live action as a powerful Proteas team takes on the West Indies in the first T20 on Saturday.","content":"A new limited-overs era began with a recent 1-1 ODI series draw between the Proteas and West Indies, and the teams now head into T20 action. ALSO READ: Kapp ‘heartbroken’ as Van Niekerk heads into shock retirement The Proteas have named a powerful squad for this series, with in-form Aiden Markram taking on the captaincy duties in a key new role for the talented batsman. You can follow all the live scoring below, with play getting underway at 2pm: Proteas T20I squad against West Indies Aiden Markram (captain, Momentum Multiply Titans), Quinton de Kock (Momentum Multiply Titans), Bjorn Fortuin (DP World Lions), Reeza Hendricks (DP World Lions), Marco Jansen (Dafabet Warriors) , Heinrich Klaasen (Momentum Multiply Titans), Sisanda Magala (DP World Lions), David Miller (Hollywoodbets Dolphins), Lungi Ngidi (Momentum Multiply Titans), Anrich Nortje (Dafabet Warriors), Wayne Parnell (Six Gun Grill Western Province), Kagiso Rabada (DP World Lions), Rilee Rossouw (ITEC Knights), Tabraiz Shamsi (Momentum Multiply Titans), Tristan Stubbs (Dafabet Warriors). ALSO READ: Temba Bavuma laments dearth of Test cricket Proteas Team Management against West Indies Rob Walter (Head Coach), Khomotso Volvo Masubelele (Team Manager), JP Duminy (Batting Coach), Rory Kleinveldt (Bowling Coach), Wandile Gwavu (Fielding Coach), Matthew Reuben (Performance Analyst), Runeshan Moodley (Strength and Conditioning coach), Sizwe Hadebe (Physiotherapist), Dr Hashendra Ramjee (Team Doctor), Kyle Botha (Logistics and Masseur), Zunaid Wadee (Security), Lucy Davey (Media Manager). ALSO READ: Proteas complete series whitewash of West Indies South Africa T20 International Series against West Indies Saturday, 25 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Sunday, 26 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Tuesday, 28 March at 18:00 South Africa vs West Indies – DP World Wanderers Stadium, Johannesburg IN CLOSING | Australian publication deletes ‘fat-shamed’ article on Proteas star","pubDate":"2023-03-25 10:46:46","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-curtains-for-all-rounders-delhi-capitals-coach-ricky-ponting-on-new-impact-player-rule-12350002.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule","content":"Cricket IPL 2023: 'Curtains for all-rounders', Delhi Capitals coach Ricky Ponting on new 'Impact Player' rule Starting this IPL season, the teams will have to name four substitutes at the toss. One of these four can be called into play at any point in the game FP Sports March 25th, 2023 16:14:41 IST File image of former Australian captain and Delhi Capitals coach Ricky Ponting. Image: BCCI/IPL Former Aussie captain and Delhi Capitals head coach Ricky Ponting believes that the new ‘ Impact Player ’ rule is curtains for all-rounders in the IPL. Given that a team now has the option to get in a proper batter or bowler, Ponting said, they won’t anymore need to play someone who can do a bit of both. “It actually almost negates the role of allrounders in the game now. So unless they’re absolutely world-class and they’re getting picked either as a batsman or as a bowler, not sort of a bits and pieces guy, then I don’t think you’ll see many, many teams this year actually use the guy that might bat at seven and maybe bowling over or two. Because you don’t need those guys anymore,” Ponting said. “It [usage of Impact Player] depends on if you bat or bowl first,” Ponting said while talking about how a side can use the impact player. “So, at the toss, we will be putting in a bowling-first team and a batting-first team. And obviously if you bat first, you’re probably going to sub in a batter. Or if you bat first and lose an early wicket, you might want to bring in a batter straight on top of that. So, there are several different ways to use it. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 16:14:41 IST Tags: Impact Player Ipl 2023 Ipl 2023 Dc Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 10:44:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/thequint-2020-10-4eae1d88-21ae-4.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"DC vs MIW WPL 2023 Final Dream11 prediction: Fantasy cricket tips for Delhi Capitals vs Mumbai Indians Women","link":"https://www.dnaindia.com/cricket/report-dc-vs-miw-wpl-2023-final-dream11-prediction-fantasy-cricket-tips-for-delhi-capitals-vs-mumbai-indians-women-3032230","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"The Delhi Capitals finished at the top of the points table with six wins and two losses, while the Mumbai Indians had the same number of victories and defeats.","content":"The highly anticipated Women's Premier League 2023 Final is set to take place on March 26th at the Brabourne Stadium in Mumbai, where the Delhi Capitals will face off against the Mumbai Indians. It's no secret that these two teams have been the strongest contenders throughout the tournament, and their journey to the final has been nothing short of impressive. The Delhi Capitals finished at the top of the points table with six wins and two losses, while the Mumbai Indians had the same number of victories and defeats. However, the Capitals secured their spot in the final due to their superior net run rate. On the other hand, the Mumbai Indians had to battle it out in the Eliminator match against the UP Warriorz, but their hard work and determination paid off as they secured their place in the final. This final match promises to be a nail-biting affair, as both teams have been equally dominant throughout the tournament. In fact, they have already faced each other twice this season, with each team winning one game each. The battle for supremacy in this final match will ultimately crown the ultimate champions of the Women's Premier League 2023. Match Details Delhi Capitals vs Mumbai Indians, WPL final Date & Time: March 26, 7:30 PM Venue: Brabourne Stadium, Mumbai MIW vs DCW Dream11 Prediction Wicketkeeper: Yastika Bhatia Batters: Harmanpreet Kaur, Verma, Rodrigues, Meg Lanning All-rounders: Kapp, Alice Capsey, Hayley Matthews Bowlers: Ishqaue, Wong, Nat Sciver-Brunt MIW vs DCW My Dream11 team Yastika Bhatia, Meg Lanning, Harmanpreet Kaur, Shafali Verma, Hayley Matthews, Nat Sciver-Brunt, Marizanne Kapp, Amelia Kerr, Alice Capsey, Shikha Pandey, Issy Wong READ| Meet Harleen Deol, the 'Beauty Queen' of women's cricket who is often mistaken for Bollywood actress","pubDate":"2023-03-25 10:43:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Former Australia captain Tim Paine hints at coaching role post retirement","link":"https://www.indiatvnews.com/sports/cricket/former-australia-captain-tim-paine-hints-at-coaching-role-post-retirement-2023-03-25-857572","keywords":null,"creator":null,"video_url":null,"description":"Former Australia Test captain Tim Paine has hinted at taking up a coaching job following his retirement from all forms of cricket recently. The 38-year-old played his last domestic career game for Tasmania against Queensland in Sheffield Shield last week.","content":"Former Australia Test captain Tim Paine has hinted at taking up a coaching job following his retirement from all forms of cricket recently. The 38-year-old played his last domestic career game for Tasmania against Queensland in Sheffield Shield last week. Paine led Australia in a handful of Test matches after the 2018 sandpaper saga and also created history by retaining in England. Overall, Paine played 35 Tests, 35 ODIs, and 12 T20Is for his country while featuring in a mammoth 154 FC games, 136 List A, and 81 T20 matches during his career that lasted for almost two decades. He stepped down as skipper days before the start of the 2021-22 Ashes series at home. \"It's an emotional time when you move on from something that you love doing and you care deeply about, but I'll still be involved in the game of cricket,\" Paine was quoted as saying by cricket. com.au, \"To come back and do that, it was nice to finish on my home ground,\" he added. The veteran cricketer said it's been an emotional time since he decided to retire from the game. \"My phone has been going berserk, from all around the world as well, which is nice. It's made me a bit emotional reading some of the messages and social media stuff people have sent. I came in the doors at Cricket Tasmania when I was 12 years old, 26 years ago, which is a long time,\" said Paine. \"It's an emotional time when you move on from something that you love doing and you care deeply about, but I'll still be involved in the game of cricket,\" added Paine who made his debut against Pakistan, where he was capped alongside in 2010.","pubDate":"2023-03-25 10:37:48","image_url":null,"source_id":"indiatvnews","category":["sports"],"country":["india"],"language":"english"},{"title":"From Shibani Dandekar to Karishma Kotak: Most glamorous and beautiful female anchors in IPL history","link":"https://www.dnaindia.com/cricket/report-ipl-2023-glamorous-beautiful-female-anchors-ipl-shibani-dandekar-karishma-kotak-mandira-rochelle-rao-mayanti-3032227","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Some of the popular female anchors of the IPL are Mayanti Langer, Archana Vijaya, Mandira Bedi. Karishma Kotak, and Shibani Dandekar.","content":"Indian Premier League (IPL) is without doubt one of the most popular sporting leagues in the world. The IPL grabs the attentions of millions of people across the world not only because of its fast bowlers and power-hitters, but also for its glamorous and pretty female anchors. Some of the popular anchors of the IPL are Mayanti Langer, Archana Vijaya, Mandira Bedi. Karishma Kotak, and Shibani Dandekar. 1. Archana Vijaya Archana Vijaya made her IPL debut as an anchor in 2011. She is best known for anchoring IPL Extraaa Innings and traveling with IPL teams across the country. 2. Mandira Bedi Mandira Bedi is one of the most popular female TV anchors in India. She hosted only one season of the IPL in 2009, but cricket fans still remember her for her good grasp over the game. 3. Shibani Dandekar Shibani Dandekar is known for her glamourous looks and broad knowledge of the game of cricket. She appeared as anchor in five seasons of the IPL from 2011 to 2015. 4. Mayanti Langer The glamorous anchor is married to Indian all-rounder Stuart Binny. Mayanti Langer is one of the most popular faces in Indian sports broadcasting. Mayanti is currently associated with Star Sports and is likely to host the upcoming IPL 2023. 5. Rochelle Rao Rochelle Rao is a model and has featured in the Kingfisher Calendar too. In 2012, Rochelle was crowned Miss India International. She was associated with the Indian Premier League in 2015-16. 6. Karishma Kotak Karishma Kotak was the anchor of the sixth edition of the Indian Premier League, which was held in 2013. Karishma Kotak is also a supermodel.","pubDate":"2023-03-25 10:27:00","image_url":null,"source_id":"dnaindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Delhi hopes to cash in on ‘Kapp impact’","link":"https://www.thehindu.com/sport/cricket/delhi-hopes-to-cash-in-on-kapp-impact/article66658024.ece","keywords":null,"creator":null,"video_url":null,"description":"Ours is such a well-balanced side and credit has to go to the people who have put together this team, says South African star","content":"Marizanne Kapp has made a huge impact at the WPL. But, that was almost inevitable. She was Player-of-the-Match in The Hundred finals in England, in 2021 and 2022; so also in the WBBL 2021-22 final. She thus played key roles in making Oval Invincibles and Perth Scorchers champions. Delhi Capitals must be hoping Kapp does her special thing once again in a league final. The South African has to her credit 3,545 runs and 223 wickets in international white-ball cricket, has been one of the main reasons for Capitals’ direct entry to Sunday’s title-clash. She has the WPL’s best bowling figures — her five for 15 was an exceptional spell against Gujarat Giants — and in her six innings, she went past 30 four times. She has done all that while going through emotional turmoil. Her South African teammate and life partner Dane van Niekerk — she was signed up by RCB — recently announced her retirement from international cricket. “RCB has been so good to her and everyone would have loved to see her on the park, but just being here and finding her feet again was helpful for her,” said Kapp in an exclusive interview with The Hindu. “We both made our international debut in 2009 and here we are. Even though she is only 29, she has been playing for 14 years. She hopefully will continue to play in these leagues.” Kapp is enjoying her time at the WPL. “I started a bit slow (with my bowling) and wasn’t too happy, but I got better. Now we are in the final, I can’t be happier. After coming from South Africa, I took a while to adjust to the wickets here. My spell against Gujarat was probably my best in T20 cricket.” She is glad to be part of Capitals. “Ours is such a well-balanced side and credit has to go to the people who have put together this team after a lot of research,” she said. “The major thing for us is that a lot of players are contributing.”","pubDate":"2023-03-25 09:51:59","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form","link":"https://www.firstpost.com/firstcricket/sports-news/if-you-try-to-save-someone-the-game-will-only-bite-you-ajay-jadeja-comments-on-suryakumar-yadavs-poor-form-12350252.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form","content":"Cricket 'If you try to save someone, the game will only bite you': Ajay Jadeja comments on Suryakumar Yadav's poor form India missed the currently-injured Shreyas Iyer against Australia, and Suryakumar was given with the responsibility to fill in Iyer’s spot. FirstCricket Staff March 25th, 2023 15:21:42 IST Suryakumar Yadav walks back dejectedly after getting dismissed for a third consecutive golden duck during the third ODI between India and Australia in Chennai. AFP Aggressive India batter Suryakumar Yadav endured a forgettable ODI series against Australia recently, as he registered three golden ducks off as many ODIs at home. SKY, as he is affectionately called, had ended up as the top run-scorer in T20Is in 2022, amassing 1164 runs from 31 ODIs, but has been unable to recreate that magic into the ODIs this year. India missed the currently-injured Shreyas Iyer against Australia, and Suryakumar was given with the responsibility to fill in Iyer’s spot. While Yadav was dismissed by Mitchell Starc in the first two matches, Ashton Agar claimed the batter’s wicket in the series-decider in Chennai. SKY was even demoted to No 7 in the third ODI, a move that was a ‘huge blunder’ by the Indian team management, according to former cricketer Ajay Jadeja. “He’s the same Suryakumar Yadav who scored 360 degrees across the ground. It isn’t as if he doesn’t know how to play. It’s all about the mindset. When someone like Virat Kohli faced so many months out of form, it means there’s something in the mind that affects your game. If you’re thinking too much, and you’re making the player wait for his batting, the doubt only increases,” Jadeja was quoted as saying by Cricbuzz. The 52-year-old further stated why playing SKY at No 7 did not help India’s case. “In our days, it used to be said that if someone isn’t in form, and if he plays at no.4 and you send him at no.7, it will always be more challenging. You will always feel more comfortable when you bat up the order. When you come at no.7, whatever strength you have in your batting, you’ve already lost 60-80 percent of it. You haven’t made it any easier. You can only regain form when you play ahead. You can’t save anyone. If you try to save someone, this game will only bite you more,” Jadeja added. The 32-year-old has played lesser ODIs than compared to T20Is. In 23 matches he has played so far, Suryakumar has managed just 433 runs at an average of 24.05. This year is crucial for both Suryakumar and Team India, with an ODI World Cup at home scheduled to begin in about six months’ time. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 15:21:42 IST Tags: Ajay Jadeja Cricket Suryakumar Yadav Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:51:42","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Suryakumar-Yadav-India-Australia-3rd-ODI-AFP-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum","link":"https://www.firstpost.com/firstcricket/sports-news/same-problem-as-the-2019-odi-world-cup-zaheer-khan-on-indias-number-four-batting-position-conundrum-12350282.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum","content":"Cricket 'Same problem as the 2019 ODI World Cup': Zaheer Khan on India's number four batting position conundrum Surya Kumar Yadav ­— who was expected to take the charge of regular number four batter — registered back-to-back back golden ducks in the India-Australia Australia ODI series. This has brought about uncertainty over the batting position FP Sports March 25th, 2023 15:20:49 IST File image of Zaheer Khan. Sportzpics With Shreyas Iyer injured and Suryakumar Yadav out of form, former Indian pacer Zaheer Khan believes the same middle-order batting position conundrum has returned to haunt India ahead of the ODI World Cup this year. Suryakumar Yadav ­— who was expected to take the charge of regular number four batter — registered back-to-back golden ducks in the India-Australia ODI series across all three games. This has brought about uncertainty over the number four batting position. Khan said that this was the same problem for India in 2019. It was believed to be one of the reasons India could not go beyond the semi-final. “The batting order is something which they will have to definitely look at again. They will have to figure out the number 4 option again. That is something which was the discussion leading to the 2019 World Cup as well. We are talking about four years down the line now if we are in the same boat. Yes, I understand Shreyas Iyer was your designated number 4. You are really looking at him taking that role and responsibility but if he is going to be injured now for the longer time then you have to really find these answers,” Zaheer said on Cricbuzz . India’s captain Rohit Sharma, however, has backed Yadav after the team’s loss in the third ODI against Australia. A lower back injury for Iyer, meanwhile, had ruled him out of final Test against Australia in Ahmedabad and the ODI series too. Iyer is also set to miss at least part of the IPL with Kolkata Knight Riders. (KKR). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 25, 2023 15:20:49 IST Tags: 2023 Odi World Cup Suryakumar Yadav Zaheer Khan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:50:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Zaheer-Khan-Mumbai-Indians-practice-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-factbox-royal-challengers-bangalore-rcb-8807701.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore","content":"Cricket IPL 2023 Factbox: Everything you need to know about Royal Challengers Bangalore Despite having some of the best squads, Royal Challengers Bangalore have failed to lift the IPL title so far. FirstCricket Staff March 25th, 2023 15:18:08 IST RCB captain Faf du Plessis and Virat Kohli. Sportzpics IPL titles : 0 Royal Challengers Bangalore have been the dragons without fire over the years. Season after season, they boast of a formidable team, consisting of world-beaters, especially in the batting line-up. But most of the time they have disappointed. However, there has been an uptick in their recent performances, with RCB reaching the playoffs in 2020, 2021 and 2022. Overall they have ended up runners-up in three seasons. Here’s how they have fared year on year How did they fare the previous season : With Virat Kohli giving up the captaincy, the responsibility fell to Faf du Plessis, who was in his first season at RCB. The team finished fourth in the table with eight wins from 14 matches and 16 points to reach the playoffs. They defeated Lucknow Super Giants by 14 runs in the Eliminator but lost to Rajasthan Royals by seven wickets in Qualifier 2. Win Percentage : RCB are one of only three teams to have more losses than wins (for teams to have played more than 100 matches). They possess a win percentage of 48.65. Of the 227 matches played, they have won 107 and lost 113 with four ending in no result. Of the three Super Overs they have been a part of, they have won two and lost one. Highest Run-getter : Virat Kohli RCB have the best batter in their line-up. He is also the top run-getter in the league with 6624 runs from 215 innings at 36.20. He has scored five tons, the most in the league and the third-most number of 50-plus scores – 44. Highest wicket-taker : Yuzvendra Chahal Chahal had been the backbone of the RCB bowling line-up which has struggled over the years. In his eight years at the franchise, he picked up 139 wickets from 112 innings at 22.03. He’s possessed an impressive economy rate of 7.58 and a strike rate of 17.4 and has two four-fers to his name. Chahal joined Rajasthan Royals in 2022. Among the current lot, Harshal Patel, who was bought back for 10.75 crore by RCB in the IPL 2022 auction, is the highest wicket-taker with 85 wickets from 64 innings at 21.64. He possesses an economy rate of 8.22 and strike rate of 15.7. Highest individual score : Chris Gayle 175 not out vs Pune Warriors at Bengaluru in 2013 23 April 2013 was the day the Universe Boss went berserk and clobbered the Pune bowlers all over the part at the M Chinnaswamy Stadium. He was unstoppable that day as he hammered 13 fours and 17 sixes on his way to 175 not out off 66 balls. He propelled RCB to 263/5 and then the team restricted Pune to 133/9 to win the match by 130 runs. Gayle’s 175 not out still stands as the highest individual score in the league. Highest team score : The Gayle Storm that hit Pune Warriors was also the day RCB registered their highest total in the league – 263/5. Gayle also ended up getting two wickets in the match going with his unbeaten 175. Favourite opponent : Delhi Capitals Delhi are one of two sides side against whom RCB have won more than they have lost (For teams against whom RCB has played 10 or more matches). They have won 17 of their 29 matches and lost 10 with a win percentage of 62.5 percent. The other team against whom they have more than 50 percent win percentage is Rajasthan Royals – 52. Bogey team : Chennai Super Kings Chennai Super Kings have had the wood over RCB winning 20 of the 31 matches and losing 10. RCB, with 33.33 win percent against CSK, have their lowest win percentage against any team (For teams against whom RCB has played 10 or more matches) Lesser known facts : RCB hold the record for highest and lowest scores in the league. Highest – 263/5 vs PWI at Bengaluru in 2013. Lowest – 49 vs KKR at the Eden Gardens in 2017, Chasing 132, RCB were bundled out for 49 as KKR bowlers ran riot at the Eden Gardens. No batsman even managed a double digit score. Yuzvendra Chahal has taken 51 wickets at the M Chinnaswamy Stadium in IPL from 42 matches at a SR of 16.61 – the most by any RCB bowler at a venue in IPL. Retention, purchases and squad Players retained: Faf du Plessis, Virat Kohli, Suyash Prabhudessai, Rajat Patidar, Dinesh Karthik, Anuj Rawat, Finn Allen, Glenn Maxwell, Wanindu Hasaranga, Shahbaz Ahmed, Harshal Patel, David Willey, Karn Sharma, Mahipal Lomror, Mohammed Siraj, Josh Hazlewood, Siddarth Kaul, Akash Deep Players released: Sherfane Rutherford, Luvnith Sisodia, Aneeshwar Gautam, Chama Milind IPL 2022 auction players purchased : Reece Topley – Rs 1.9 crore Will Jacks – Rs 3.2 crore (replaced by Michael Bracewell) Manoj Bhandage – Rs 20 lakh Rajan Kumar – Rs 70 lakh Avinash Singh – Rs 60 lakh Sonu Yadav – Rs 20 lakh Purse left: Rs 1.75 crore RCB full squad : Faf du Plessis (c), Virat Kohli, Suyash Prabhudessai, Rajat Patidar, Dinesh Karthik, Anuj Rawat, Finn Allen, Glenn Maxwell, Wanindu Hasaranga, Shahbaz Ahmed, Harshal Patel, David Willey, Karn Sharma, Mahipal Lomror, Mohammed Siraj, Josh Hazlewood, Siddarth Kaul, Akash Deep, Reece Topley, Himanshu Sharma, Michael Bracewell, Manoj Bhandage, Rajan Kumar, Avinash Singh, Sonu Yadav. Click here to read factboxes of all teams Click here to follow comprehensive coverage of IPL 20223 Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram Updated Date: March 25, 2023 15:18:08 IST Tags: Faf Du Plessis Ipl 2023 Ipl 2023 Rcb Ipl Factbox Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-25 09:48:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/RCB-review-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"}]}