{"newsArray":[{"title":"Rebuilt Richardson a smarter Test quick","link":"https://www.perthnow.com.au/sport/cricket/rebuilt-richardson-a-smarter-test-quick-c-5071456","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Jhye Richardson has returned to Test cricket a smarter bowler despite back-to-back shoulder operations.","content":null,"pubDate":"2021-12-23 23:31:17","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5071456/40374a0966e34e53903c04cc717376c3103e09c2-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"Rebuilt Richardson a smarter Test quick","link":"https://thewest.com.au/sport/cricket/rebuilt-richardson-a-smarter-test-quick-c-5071454","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Jhye Richardson has returned to Test cricket a smarter bowler despite back-to-back shoulder operations.","content":null,"pubDate":"2021-12-23 23:31:17","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5071454/40374a0966e34e53903c04cc717376c3103e09c2-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"England DUMP Rory Burns after horrific start to the Ashes with Zak Crawley to come in for Boxing Day Test","link":"https://www.thesun.co.uk/sport/17132647/england-rory-burns-ashes-crawley-bairstow/","keywords":["Cricket","Sport","England Cricket","The Ashes 2021-22"],"creator":["John Etheridge"],"video_url":null,"description":"RORY BURNS has been dumped by England after his horrific start to The Ashes. Opener Burns will be replaced by Zak Crawley for the Boxing Day Test and his Surrey team-mate Ollie Pope gives way to Jonny Bairstow. Burns was clean bowled by the first ball of The Ashes and his fortunes have hardly improved […]","content":"RORY BURNS has been dumped by England after his horrific start to The Ashes. Opener Burns will be replaced by Zak Crawley for the Boxing Day Test and his Surrey team-mate Ollie Pope gives way to Jonny Bairstow. GettyRory Burns scored just 51 runs from four innings in the opening two tests[/caption] PAZak Crawley has been called up to replace Burns[/caption] GettyJonny Bairstow also comes back into the side[/caption] Burns was clean bowled by the first ball of The Ashes and his fortunes have hardly improved since then. Scores of 0, 13, 4, 34 and his quirky technique have been mocked by many pundits. He also let off David Warner in the Brisbane First Test by dropping an easy chance. England considered excluding Haseeb Hameed instead of Burns, 31. But the tour management opted to keep Hameed because he is seven years younger. After scoring 267 against Pakistan at Southampton in 2020, Crawley averages just 11 in Test cricket this year. Most read in Sport MAX-IMUM THREAT Verstappen will quit F1 if he loses engineer who helped him beat Hamilton YOB SHAME Five arrested as Spurs and West Ham fans clash in bloody scenes before cup tie CON GET IT McGregor to be allowed to skip queue and face UFC champion Charles Oliveira next LOU'S LOVE Gary Speed's widow ties the knot with developer partner who helped after tragedy BOXING NAY Liverpool vs Leeds & Wolves vs Watford both OFF as Covid hits Boxing Day games CZECH IT OUT Euro 96 star looks unrecognisable 25 years on from playing days - who is it? JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) But he has made some technical changes designed to eliminate his habit of nicking catches. And he has looked more assured than most in England’s net sessions. Pope scored 35 in the first innings of the series but has recorded 4, 5 and 4 since then. His batting has also become increasingly frenetic and agitated. Bairstow’s performances in Test cricket nose-dived in recent years but he did score a century on the previous Ashes tour in 2017-18. He is expected to be preferred at No 6 to the less-experienced Dan Lawrence. Australia coach Justin Langer suggested Mitchell Starc will play his third Ashes Test in quick succession but Josh Hazlewood will again miss out with a minor side strain. Starc, 31, has bowled more than 75 overs in the series and felt twinges in his back last time out. Captain Pat Cummins should return in Melbourne and Victoria’s Scott Boland has been added.","pubDate":"2021-12-23 22:37:10","full_description":"RORY BURNS has been dumped by England after his horrific start to The Ashes. Opener Burns will be replaced by Zak Crawley for the Boxing Day Test and his Surrey team-mate Ollie Pope gives way to Jonny Bairstow. Burns was clean bowled by the first ball of The Ashes and his fortunes have hardly improved since then. Scores of 0, 13, 4, 34 and his quirky technique have been mocked by many pundits. He also let off David Warner in the Brisbane First Test by dropping an easy chance. England considered excluding Haseeb Hameed instead of Burns, 31. But the tour management opted to keep Hameed because he is seven years younger. After scoring 267 against Pakistan at Southampton in 2020, Crawley averages just 11 in Test cricket this year. JOIN SUN VEGAS: GET A FREE £10 BONUS WITH 100s OF GAMES TO PLAY AND NO DEPOSIT REQUIRED (Ts&Cs apply) But he has made some technical changes designed to eliminate his habit of nicking catches. And he has looked more assured than most in England’s net sessions. Pope scored 35 in the first innings of the series but has recorded 4, 5 and 4 since then. His batting has also become increasingly frenetic and agitated. Bairstow’s performances in Test cricket nose-dived in recent years but he did score a century on the previous Ashes tour in 2017-18. He is expected to be preferred at No 6 to the less-experienced Dan Lawrence. Australia coach Justin Langer suggested Mitchell Starc will play his third Ashes Test in quick succession but Josh Hazlewood will again miss out with a minor side strain. Starc, 31, has bowled more than 75 overs in the series and felt twinges in his back last time out. Captain Pat Cummins should return in Melbourne and Victoria’s Scott Boland has been added.","image_url":null,"source_id":"thesun"},{"title":"‘Blew up’: Ashes great warns of England divide - NEWS.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMioAFodHRwczovL3d3dy5uZXdzLmNvbS5hdS9zcG9ydC9jcmlja2V0L3RoZS1hc2hlcy9hc2hlcy1ncmVhdC1zdGV2ZS1oYXJtaXNvbi10b29rLW9mZmVuY2UtdG8tam9lLXJvb3RzLWJvd2xpbmctcmVtYXJrcy9uZXdzLXN0b3J5L2JjZDdhMWVjMmIyN2UwNTE2Mzc1NjQzNzk1ZDE3ZjYw0gGkAWh0dHBzOi8vd3d3Lm5ld3MuY29tLmF1L3Nwb3J0L2NyaWNrZXQvdGhlLWFzaGVzL2FzaGVzLWdyZWF0LXN0ZXZlLWhhcm1pc29uLXRvb2stb2ZmZW5jZS10by1qb2Utcm9vdHMtYm93bGluZy1yZW1hcmtzL25ld3Mtc3RvcnkvYmNkN2ExZWMyYjI3ZTA1MTYzNzU2NDM3OTVkMTdmNjA_YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Blew up’: Ashes great warns of England divide  NEWS.com.auEnglish cricket team hold 'brutally honest' meeting after disastrous Ashes start against Australia  ABC News‘The whole thing blew up’: England great fears ‘nasty’ divide after Root drama  Fox SportsJoe Root 'frustrated' and 'angry' with England's performance in first two Ashes Tests  Wide World of Sports'We want to win the series' - England won't give up on Ashes as Malan pinpoints Australia's advantage  Sporting News AUView Full coverage on Google News","content":null,"pubDate":"2021-12-23 21:50:38","image_url":null,"source_id":"google"},{"title":"Root's future on the line amidst Ashes calamity","link":"https://wwos.nine.com.au/cricket/ashes-2021-joe-root-english-captaincy-future-ian-chappell-mark-taylor-exclusive/190c5094-5321-4d58-a039-8b84ec4e4d4f","keywords":null,"creator":["wwos"],"video_url":null,"description":"As England lurches from one disaster to another, it could end up costing the captain his job.","content":"Joe Root's future as England captain is on the line over the remainder of the Ashes series, according to former Australian skippers Mark Taylor and Ian Chappell.Root has led England in more than half his Test matches - 58 of 111 - since taking over in 2017.With 27 wins he's the most successful English captain of all time, and in Melbourne he will equal Alastair Cook's record of 59 matches in charge.READ MORE: 'Divided' England in turmoilREAD MORE: Forgotten candidate to replace struggling openerREAD MORE: Gallen reveals 'ridiculous' offer to fight SBWBut Root's captaincy record in Australia makes for dismal reading - six losses and one draw from seven matches - while Australia retained the Ashes in England in 2019, another black mark against the English skipper.Of major concern is the size of the losses on this tour, with England totally outplayed in both matches to date.Taylor and Chappell agreed that Root's time could be up at the end of this series, but both identified England's greatest problem - the lack of an obvious successor as skipper.\"It would be hard for him to continue, if this continues on, and maybe Joe won't even want to,\" Taylor said on Nine's Outside the Rope.\"Once again, it's like Marcus Harris for Australia, you've got to make sure you've got a replacement.\"Joe Root's captaincy credentials, they look OK, 27 wins from 58, that's not bad. 50 per cent win ratio is a very good ratio for a Test match captain.\"But you've got to say, 'OK Joe, do you want to keep doing it?'\"If they keep playing the way they're playing I suspect he'd probably say no.\"Ben Stokes is the vice-captain, and one of the few players in the team certain of keeping his spot.But as the team's best player, and an all-rounder, he already has plenty on his plate.England would no doubt have reservations about handing the captaincy to Stokes, perhaps remembering the ill-fated experiment with Andrew Flintoff 15 years ago, which culminated in a 5-0 Ashes thrashing in 2006-07.\"Ben Stokes is the obvious candidate,\" Taylor said.\"But bear in mind Ben's just had six months off for mental leave, he's had his injuries as well. Do you want to inflict the captaincy, if that's the right way of putting it, on Ben Stokes?\"He's the guy you're going to be looking for to not only take useful wickets, not only take great catches, but make some runs also.\"He's got a lot in his camp to do as a player. To make him captain may not be something he needs, and not in the best interests of English cricket.\"Chappell agreed that Stokes' aggressive mindset and inspirational play would make him an ideal candidate, but acknowledged he already has a heavy workload.\"If you look through that team list, Ben Stokes is the only name that comes up as an option if you're going to drop Joe Root,\" he said.\"There are certain players that you shouldn't make captain.\"It's going to weigh them down. Alastair Cook wasn't a captain in my book, and it weighed him down. You've got to get guys who are buoyed by the job.\"Pat Cummins to me is going to be buoyed by the job, he looks forward to it.\"I don't think Joe likes the job, but I think he likes the rewards that come with being England captain. But you go through that list, there's only one name you can come up with.\"If Ben Stokes says, 'Mate, I don't want to know about it,' well where do you go from there? Send up a prayer.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-23 19:41:52","full_description":"Joe Root's future as England captain is on the line over the remainder of the Ashes series, according to former Australian skippers Mark Taylor and Ian Chappell . Root has led England in more than half his Test matches - 58 of 111 - since taking over in 2017. With 27 wins he's the most successful English captain of all time, and in Melbourne he will equal Alastair Cook's record of 59 matches in charge. READ MORE: 'Divided' England in turmoil READ MORE: Forgotten candidate to replace struggling opener READ MORE: Gallen reveals 'ridiculous' offer to fight SBW But Root's captaincy record in Australia makes for dismal reading - six losses and one draw from seven matches - while Australia retained the Ashes in England in 2019, another black mark against the English skipper. Of major concern is the size of the losses on this tour, with England totally outplayed in both matches to date. Taylor and Chappell agreed that Root's time could be up at the end of this series, but both identified England's greatest problem - the lack of an obvious successor as skipper. \"It would be hard for him to continue, if this continues on, and maybe Joe won't even want to,\" Taylor said on Nine's Outside the Rope. \"Once again, it's like Marcus Harris for Australia, you've got to make sure you've got a replacement. \"Joe Root's captaincy credentials, they look OK, 27 wins from 58, that's not bad. 50 per cent win ratio is a very good ratio for a Test match captain. \"But you've got to say, 'OK Joe, do you want to keep doing it?' \"If they keep playing the way they're playing I suspect he'd probably say no.\" Ben Stokes is the vice-captain, and one of the few players in the team certain of keeping his spot. But as the team's best player, and an all-rounder, he already has plenty on his plate. England would no doubt have reservations about handing the captaincy to Stokes, perhaps remembering the ill-fated experiment with Andrew Flintoff 15 years ago, which culminated in a 5-0 Ashes thrashing in 2006-07. \"Ben Stokes is the obvious candidate,\" Taylor said. \"But bear in mind Ben's just had six months off for mental leave, he's had his injuries as well. Do you want to inflict the captaincy, if that's the right way of putting it, on Ben Stokes? \"He's the guy you're going to be looking for to not only take useful wickets, not only take great catches, but make some runs also. \"He's got a lot in his camp to do as a player. To make him captain may not be something he needs, and not in the best interests of English cricket.\" Chappell agreed that Stokes' aggressive mindset and inspirational play would make him an ideal candidate, but acknowledged he already has a heavy workload. \"If you look through that team list, Ben Stokes is the only name that comes up as an option if you're going to drop Joe Root,\" he said. \"There are certain players that you shouldn't make captain. \"It's going to weigh them down. Alastair Cook wasn't a captain in my book, and it weighed him down. You've got to get guys who are buoyed by the job. \"Pat Cummins to me is going to be buoyed by the job, he looks forward to it. \"I don't think Joe likes the job, but I think he likes the rewards that come with being England captain. But you go through that list, there's only one name you can come up with. \"If Ben Stokes says, 'Mate, I don't want to know about it,' well where do you go from there? Send up a prayer.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400220/pickerimage.jpg","source_id":"nine"},{"title":"Sporting Highlights-2021","link":"https://www.thehansindia.com/sports/sporting-highlights-2021-721368","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":null,"content":"Sporting Highlights-2021Sporting Highlights-2021Sporting Highlights-2021Jan 27ICC Player of the Month: ICC introduces Player of the Month awards to recognise best performances of cricketers. Fans registered with the ICC can also be able to vote online every month to award their favourite male and female cricketers across all three formats of international cricket played in that month.Jan 31Denmark edge out Sweden 26-24 at the Cairo Stadium Sports Hall in Egypt to retain IHF World Men's Handball title FEB 2BCCI cancels Ranji Trophy for first time in 87 years, agrees to hold Hazare trophy. Feb 7Tom Brady (Inset) wins 7th Super Bowl title as new team Tampa Bay secure 31-9 victory over Kansas City feb 21Serbia's Novak Djokovic (right) wins record-extending ninth Australian Open by defeating Russia's Daniil Medvedev 7-5, 6-2, 6-2. mar 12Mithali Raj becomes first Indian woman cricketer to score 10,000 international runs across all formats. She also become the second woman cricketer internationally to achieve the milestone of 10,000 international runs. mar 20Alexis Pinturault of France and Slovakian Petra Vihova claim Alphine Ski World cup titles apr 11Hideki Matsuyama claims one-shot victory at US Masters, first Japanese man to win golf major. apr 20India's Mirabai Chanu creates new world record & national record in Clean and Jerk after lifting 119 kg at the Asian Weightlifting Championships in Tashkent.apr 21Asian Wrestling Championships 2021: India clinches 14 medals including 5 Gold, 3 silver, 6 bronze to finish third in the medal tally, behind Iran and Kazakhstan which topped the 34th edition of the Championship with 17 medals each. May 11Man City, Atletico Madrid, Internazionale and Bayern Munich win Europe's top soccer leagues may 22Toulouse beat La Rochelle to win fifth European Cup rugby title May 23Phil Mickelson (left) takes US PGA Championship, becoming oldest major winner at 50 may 29Chelsea defeat Man City 1-0 in all-English UEFA Champions League final MAy 30Colombia's Egan Bernal wind Gitod'ltala June 5Jamaica's Shelly-Ann Fraser-Pryce becomes second-fastest woman in history. Fraser-Pryce beat Carmelita Jeter's 2009 record of 10.64 seconds June 20Spain's Jon Rahm wins first gold major at US OpenShafali Verma becomes youngest Indian Cricketer to make debut in all formats: Shafali at the age of 17 years and 150 days made her ODI debut to achieve the feat. It made her the 5th youngest cricketer overall in the list which is headed by Afghanistan's Mujeeb Ur Rahman.June 24World Test Championship Final: New Zealand crowned ICC World Test Champions, lift inaugural WTC Trophy after an 8-wicket victory over India in the final hour of a nail-biting reserve day with a boundary from Taylor. June 28Shafali Verma becomes youngest Indian Cricketer to make debut in all formats: Shafali at the age of 17 years and 150 days made her ODI debut to achieve the feat. It made her the 5th youngest cricketer overall in the list which is headed by Afghanistan's Mujeeb Ur Rahman. July 1Abhimanyu Mishra youngest-ever Chess Grandmaster: Abhimanyu Mishra, a 12-years old Indian-origin boy, becomes the youngest ever Grandmaster in Chess breaking the record of 12 years and 7 months set by GM Sergey Karjakin in 2002. July 11Argentina beat perennial rivals Brazil 1-0 at Maracana Stadium to claim 15th Copa America title Italy beat England on penalties 3-2 after 1-1 extra-time draw at Wembley to win Uefa Euro 2020. Italy conquer Europe for first time since 1968. Goalkeeper Gianluigi Donnarumma named player of tournament. Euro 2020 Golden Boot: Portugal captain Cristiano Ronaldo wins Golden Boot after finishing as top goalscorer. Ronaldo, 36, scored five goals for Portugal same as the Czech Republic's forward Patrik Schick. The Portugal captain won with one tie-breaker of assists while Schick finished with zero assists.Novak Djokovic dominate the tennis world in 2021: Novak Djokovic seals sixth Wimbledon title, joining Roger Federer and Rafael Nadal on 20 Grand Slams. July 18TadejPogacar, 22, wins second successive Tour de France July 20Milwaukee Bucks win first NBA title since 1971 with victory over Phoenix Suns aug 1Shuttler PV Sindhu wins bronze, becomes second Indian after Sushil Kumar to win two individual Olympic medals. She had won silver in 2016 Rio Olympic Games after losing in the final to Spain's Carolina Marin. aug 7Neeraj Chopra clinches gold, becomes first-ever Indian athlete to win gold at Olympic Games. He wins gold medal in javelin with a throw of 87.58m.He is the second Indian-ever to win an individual gold after Abhinav Bindra, who won gold in Men's 10m air rifle in shooting in 2008 Olympic Games. aug 11Lionel Messi signs for PSG, ending 17-year career with Barcelona aug 23World Athletics U20 Championships: India's Shaili Singh wins the silver medal with a jump of 6.59m, missing the gold by just a centimetre. Sweden's Maja Askag wins gold with a jump of 6.60m. sept 6Best-ever Paralympics for India: India scripted history at Tokyo Paralympics 2020 with its best-ever medal tally of 19 medals, which includes five gold medals, eight silver medals, and six bronze medals. The 19 medals were clinched by Indian para athletes across five sporting disciplines including shooting, javelin throw, badminton, athletics and archery. sept 11Britain's Emma Raducanu, 18, wins US Open – first ever qualifier to win Grand Slam title oct 8World Wrestling Championships: Anshu Malik becomes the first Indian woman wrestler to win a Silver medal in the women's 57-kg category at the World Wrestling Championships. oct 10Tyson Fury knocks out Deontay Wilder in 11th round to retain WBC heavyweight crown oct 13Sunil Chhetri breaks Pele's goal record: Indian football skipper Sunil Chhetri broke legendary Brazilian football player Pele's international goal record on October 13, 2021 during the match against the Maldives in the ongoing 2021 SAFF Championship. Sunil Chhetri surpassed Pele's International goal record of 77 goals when he scored a goal in the 62nd minute in India's match against the Maldives. The Indian football captain has also become the joint sixth-highest international goal scorer in the world. oct 14ISSF Junior World Championship: India finish on top with 43 medals, including 17 gold, 16 silvers and 10 bronze medals oct 24Fabio Quartararo becomes MotoGP world champion, as legend Valentino Rossi calls it quits oct 25New IPL Teams 2021 - Ahmedabad and Lucknow: The Sanjiv Goenka-owned RPSG group placed the winning bid worth Rs 7,090 crore for the Lucknow IPL team, while CVC Capital Partners have claimed Ahmedabad with a bid of Rs 5,166 crore. Nov 5Akash Kumar becomes India's 7th male boxer to win medal at Worlds. Indian boxer Akash Kumar wins bronze after suffering a 0-5 loss against Kazakhstan's Makhmud Sabyrkhan in the 54-kg category at the 2021 AIBA men's World Boxing Championships in Belgrade. Nov 14ICC T20 World Cup: Australia pummel New Zealand by 8 wickets to claim maiden crown. David Warner was named T20 World Cup 2021 player of the tournament and Mitchell Marsh was named player of the match Nov 18India vs Pakistan T20 match most viewed T20I in history ICC reveals record viewership of 167 million, making it the most viewed T20I till date. It was held in the United Arab Emirates between October 17 - November 14, 2021. Nov 30Ballon d'Or Winner 2021: Lionel Messi won the men's Ballon d'Or award for a record seventh time on November 30, 2021. Spain's Alexia Putellas won the women's Ballon d'Or award for the first time. This year, two new Ballon d'Or awards were also introduced- 'The Striker of the Year' & 'The Club of the Year'. While the striker of the year award went to Robert Lewandowski, the Best Club of the Year award went to Chelsea. Dec 2World Athletics Awards 2021: India Legend Anju Bobby George named 'Woman of the Year' at the World Athletics Awards 2021. A retired Indian sprinter Anju Bobby George was conferred the awardfor her continuous efforts in advancing the sport in India and for inspiring more women to follow her footsteps and achieve their dreams of being successful athletes. The Olympic Champions Elaine Thompson-Herah of Jamaica and Norway's KarstenWarholm were named the World Athletes of the year. Dec 5FIH Men's Hockey World Cup: Argentina beat six-time champions Germany 4-2 to lift FIH Men's Junior Hockey World Cupat the Kalinga Stadium in Odisha on December 5, this is their second title win.India finished fourth after losing 1-3 to France in the third-place match.Argentina became the only third team after Germany (six wins) and India (2001, 2016) to win multiple Junior Hockey WC titles. Dec 6'Asia Youth Para Games 2021: Indian shuttlers bag 15 medals, including 4 Gold, 7 Silver, and 4 Bronze. PalakKohli, HardikMakkar and SanjanaKumari won three medals each. The 4th edition of the Asian Youth Para Games 2021 was held in Manama, Bahrain from December 2 to 6, 2021. India finished fifth overall with 36 medals while Iran topped the medal tally with 97. Dec 12Max Verstappen wins his first F1 World Championship, beating Lewis Hamilton on final lap of thrilling season finale in Abu Dhabi Dec 19Yash Dhull to lead the U-19 World Cup India Squad 2022 The U-19 World Cup will be played from January 14 to February 2, 2022, in West Indies across the four host countries. U-19 Indian Squad, lead by YashDhull, will square off against South Africa on January 15, 2022. Check the full list of the U-19 World Cup 2022 Indian Squad.","pubDate":"2021-12-23 19:25:08","full_description":"Sporting Highlights-2021 Sporting Highlights-2021 Jan 27 ICC Player of the Month: ICC introduces Player of the Month awards to recognise best performances of cricketers. Fans registered with the ICC can also be able to vote online every month to award their favourite male and female cricketers across all three formats of international cricket played in that month. Jan 31 Denmark edge out Sweden 26-24 at the Cairo Stadium Sports Hall in Egypt to retain IHF World Men's Handball title FEB 2 BCCI cancels Ranji Trophy for first time in 87 years, agrees to hold Hazare trophy. Feb 7 Tom Brady (Inset) wins 7th Super Bowl title as new team Tampa Bay secure 31-9 victory over Kansas City feb 21 Serbia's Novak Djokovic (right) wins record-extending ninth Australian Open by defeating Russia's Daniil Medvedev 7-5, 6-2, 6-2. mar 12 Mithali Raj becomes first Indian woman cricketer to score 10,000 international runs across all formats. She also become the second woman cricketer internationally to achieve the milestone of 10,000 international runs. mar 20 Alexis Pinturault of France and Slovakian Petra Vihova claim Alphine Ski World cup titles apr 11 Hideki Matsuyama claims one-shot victory at US Masters, first Japanese man to win golf major. apr 20 India's Mirabai Chanu creates new world record & national record in Clean and Jerk after lifting 119 kg at the Asian Weightlifting Championships in Tashkent. apr 21 Asian Wrestling Championships 2021: India clinches 14 medals including 5 Gold, 3 silver, 6 bronze to finish third in the medal tally, behind Iran and Kazakhstan which topped the 34th edition of the Championship with 17 medals each. May 11 Man City, Atletico Madrid, Internazionale and Bayern Munich win Europe's top soccer leagues may 22 Toulouse beat La Rochelle to win fifth European Cup rugby title May 23 Phil Mickelson (left) takes US PGA Championship, becoming oldest major winner at 50 may 29 Chelsea defeat Man City 1-0 in all-English UEFA Champions League final MAy 30 Colombia's Egan Bernal wind Gitod'ltala June 5 Jamaica's Shelly-Ann Fraser-Pryce becomes second-fastest woman in history. Fraser-Pryce beat Carmelita Jeter's 2009 record of 10.64 seconds June 20 Spain's Jon Rahm wins first gold major at US OpenShafali Verma becomes youngest Indian Cricketer to make debut in all formats: Shafali at the age of 17 years and 150 days made her ODI debut to achieve the feat. It made her the 5th youngest cricketer overall in the list which is headed by Afghanistan's Mujeeb Ur Rahman. June 24 World Test Championship Final: New Zealand crowned ICC World Test Champions, lift inaugural WTC Trophy after an 8-wicket victory over India in the final hour of a nail-biting reserve day with a boundary from Taylor. June 28 Shafali Verma becomes youngest Indian Cricketer to make debut in all formats: Shafali at the age of 17 years and 150 days made her ODI debut to achieve the feat. It made her the 5th youngest cricketer overall in the list which is headed by Afghanistan's Mujeeb Ur Rahman. July 1 Abhimanyu Mishra youngest-ever Chess Grandmaster: Abhimanyu Mishra, a 12-years old Indian-origin boy, becomes the youngest ever Grandmaster in Chess breaking the record of 12 years and 7 months set by GM Sergey Karjakin in 2002. July 11 Argentina beat perennial rivals Brazil 1-0 at Maracana Stadium to claim 15th Copa America title Italy beat England on penalties 3-2 after 1-1 extra-time draw at Wembley to win Uefa Euro 2020. Italy conquer Europe for first time since 1968. Goalkeeper Gianluigi Donnarumma named player of tournament. Euro 2020 Golden Boot: Portugal captain Cristiano Ronaldo wins Golden Boot after finishing as top goalscorer. Ronaldo, 36, scored five goals for Portugal same as the Czech Republic's forward Patrik Schick. The Portugal captain won with one tie-breaker of assists while Schick finished with zero assists. Novak Djokovic dominate the tennis world in 2021: Novak Djokovic seals sixth Wimbledon title, joining Roger Federer and Rafael Nadal on 20 Grand Slams. July 18 TadejPogacar, 22, wins second successive Tour de France July 20 Milwaukee Bucks win first NBA title since 1971 with victory over Phoenix Suns aug 1 Shuttler PV Sindhu wins bronze, becomes second Indian after Sushil Kumar to win two individual Olympic medals. She had won silver in 2016 Rio Olympic Games after losing in the final to Spain's Carolina Marin. aug 7 Neeraj Chopra clinches gold, becomes first-ever Indian athlete to win gold at Olympic Games. He wins gold medal in javelin with a throw of 87.58m.He is the second Indian-ever to win an individual gold after Abhinav Bindra, who won gold in Men's 10m air rifle in shooting in 2008 Olympic Games. aug 11 Lionel Messi signs for PSG, ending 17-year career with Barcelona aug 23 World Athletics U20 Championships: India's Shaili Singh wins the silver medal with a jump of 6.59m, missing the gold by just a centimetre. Sweden's Maja Askag wins gold with a jump of 6.60m. sept 6 Best-ever Paralympics for India: India scripted history at Tokyo Paralympics 2020 with its best-ever medal tally of 19 medals, which includes five gold medals, eight silver medals, and six bronze medals. The 19 medals were clinched by Indian para athletes across five sporting disciplines including shooting, javelin throw, badminton, athletics and archery. sept 11 Britain's Emma Raducanu, 18, wins US Open – first ever qualifier to win Grand Slam title oct 8 World Wrestling Championships: Anshu Malik becomes the first Indian woman wrestler to win a Silver medal in the women's 57-kg category at the World Wrestling Championships. oct 10 Tyson Fury knocks out Deontay Wilder in 11th round to retain WBC heavyweight crown oct 13 Sunil Chhetri breaks Pele's goal record: Indian football skipper Sunil Chhetri broke legendary Brazilian football player Pele's international goal record on October 13, 2021 during the match against the Maldives in the ongoing 2021 SAFF Championship. Sunil Chhetri surpassed Pele's International goal record of 77 goals when he scored a goal in the 62nd minute in India's match against the Maldives. The Indian football captain has also become the joint sixth-highest international goal scorer in the world. oct 14 ISSF Junior World Championship: India finish on top with 43 medals, including 17 gold, 16 silvers and 10 bronze medals oct 24 Fabio Quartararo becomes MotoGP world champion, as legend Valentino Rossi calls it quits oct 25 New IPL Teams 2021 - Ahmedabad and Lucknow: The Sanjiv Goenka-owned RPSG group placed the winning bid worth Rs 7,090 crore for the Lucknow IPL team, while CVC Capital Partners have claimed Ahmedabad with a bid of Rs 5,166 crore. Nov 5 Akash Kumar becomes India's 7th male boxer to win medal at Worlds. Indian boxer Akash Kumar wins bronze after suffering a 0-5 loss against Kazakhstan's Makhmud Sabyrkhan in the 54-kg category at the 2021 AIBA men's World Boxing Championships in Belgrade. Nov 14 ICC T20 World Cup: Australia pummel New Zealand by 8 wickets to claim maiden crown. David Warner was named T20 World Cup 2021 player of the tournament and Mitchell Marsh was named player of the match Nov 18 India vs Pakistan T20 match most viewed T20I in history ICC reveals record viewership of 167 million, making it the most viewed T20I till date. It was held in the United Arab Emirates between October 17 - November 14, 2021. Nov 30 Ballon d'Or Winner 2021: Lionel Messi won the men's Ballon d'Or award for a record seventh time on November 30, 2021. Spain's Alexia Putellas won the women's Ballon d'Or award for the first time. This year, two new Ballon d'Or awards were also introduced- 'The Striker of the Year' & 'The Club of the Year'. While the striker of the year award went to Robert Lewandowski, the Best Club of the Year award went to Chelsea. Dec 2 World Athletics Awards 2021: India Legend Anju Bobby George named 'Woman of the Year' at the World Athletics Awards 2021. A retired Indian sprinter Anju Bobby George was conferred the awardfor her continuous efforts in advancing the sport in India and for inspiring more women to follow her footsteps and achieve their dreams of being successful athletes. The Olympic Champions Elaine Thompson-Herah of Jamaica and Norway's KarstenWarholm were named the World Athletes of the year. Dec 5 FIH Men's Hockey World Cup: Argentina beat six-time champions Germany 4-2 to lift FIH Men's Junior Hockey World Cupat the Kalinga Stadium in Odisha on December 5, this is their second title win.India finished fourth after losing 1-3 to France in the third-place match.Argentina became the only third team after Germany (six wins) and India (2001, 2016) to win multiple Junior Hockey WC titles. Dec 6' Asia Youth Para Games 2021: Indian shuttlers bag 15 medals, including 4 Gold, 7 Silver, and 4 Bronze. PalakKohli, HardikMakkar and SanjanaKumari won three medals each. The 4th edition of the Asian Youth Para Games 2021 was held in Manama, Bahrain from December 2 to 6, 2021. India finished fifth overall with 36 medals while Iran topped the medal tally with 97. Dec 12 Max Verstappen wins his first F1 World Championship, beating Lewis Hamilton on final lap of thrilling season finale in Abu Dhabi Dec 19 Yash Dhull to lead the U-19 World Cup India Squad 2022 The U-19 World Cup will be played from January 14 to February 2, 2022, in West Indies across the four host countries. U-19 Indian Squad, lead by YashDhull, will square off against South Africa on January 15, 2022. Check the full list of the U-19 World Cup 2022 Indian Squad.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/23/500x300_1137383-year-end.jpg","source_id":"thehansindia"},{"title":"RUB vs EME Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for KCA T20 Pink Challenge 2021, Match 15","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/rub-vs-eme-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-kca-t20-pink-challenge-2021-match-15?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-23 19:10:12","full_description":"Team Ruby will take on Team Emerald in the 15th game of the T20 Pink Challenge 2021 at the Sanatana Dharma College Ground in Alappuzha on Friday. Team Ruby began their campaign with three successive losses. However, they won their next two games. With eight points, they are now fourth in the points table. Team Emerald, meanwhile, have been the team to beat. They have won four of their five games thus far, and are the favourites to win this contest as well. Akshaya Sadanandan (c), M Abina (wk), Santosh Siha, Sayoojya Salilan, J Chaithanya, Joseph Jipsa, Najla Noushad, NR Anjana, MP Aleena, SR Urvasi, KA Sivanai. Mani Minnu (c), B Sauparnika, Santosh Anaswara, Surendran Aleena, Mohanan Darsana, Fairooz Fathima, VJ Joshitha, Stanly Steffi, Yadhu Priya, Surendran Vinaya, Baby Arya. Match: RUB vs EME, KCA T20 Pink Challenge 2021, Match 15. Date and Time: 24th December, 2021; 9:00 AM IST. Venue: Santana Dharma College Ground, Alappuzha. The surface is expected to favour bowlers, who will hope to be in control of the game. The highest score on this ground over the last four games has been 128 runs. A score of 120 could prove to be par on this wicket. The team winning the toss should look to bat first. M Abina could prove to be an effective wicketkeeper choice for your Dream11 Fantasy side. She could be crucial in the middle order for Rajasthan. S Salilan can play the role of finisher for her team. In the game against Team Sapphire, she remained not out on 24 to lead her team to victory. M Minnu is the captain of her team, and is known to lead with responsibility. She scored 50 runs off 36 balls in the game against Team Pearl; her sterling knock included eight fours and two sixes. Meanwhilke, A Sadanandan has showed her exquisite stroke-making skills. She was in top form recently, scoring 65 runs off 60 deliveries. She also picked up a wicketm and could prove to be a wonderful multiplier choice for your RUB vs EME Dream11 Fantasy side. S Anaswara has been incredibly consistent and competitive with the ball. She picked up two wickets against Team Pearl, and had a stellar economy rate of 2.5. M Minnu (EME) – 659 points. A Sadanandan (RUB) – 571 points. S Vinaya (EME) – 314 points. S Anaswara (EME) – 300 points. M Darsana (EME) – 264 points. M Minnu: 186 runs and 9 wickets. A Sadanandan: 256 runs and 6 wickets. S Aleena: 57 runs and 2 wickets. M Abina: 128 runs. Fantasy Suggestion #1: M Abina, S Salilan, S Siha, B Sauparnika, A Sadanandan, M Minnu, M Darsana, S Aleena, S Vinaya, S Anaswara, N Noushad, Captain: M Minnu. Vice-Captain: A Sadanandan. Fantasy Suggestion #2: M Abina, S Salilan, S Siha, B Sauparnika, A Sadanandan, M Minnu, M Darsana, S Vinaya, S Anaswara, N Noushad, M Aleena. Captain: S Anaswara. Vice-Captain: M Abina.","image_url":"https://static.sportskeeda.com/editor/2021/12/d04dd-16402839995515-1920.jpg","source_id":"sportskeeda"},{"title":"WF vs AA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Super Smash 2021/22, Match 12","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wf-vs-aa-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-super-smash-2021-22-match-12?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-23 19:10:12","full_description":"The Wellington Firebirds will take on the Auckland Aces in the 12th match of the Super Smash 2021-22 at the Basin Reserve in Wellington on Friday. The Wellington Firebirds began their campaign with a 27-tun win over Canterbury. However, since then, they’ve lost two matches on the trot. They are fifth in the standings and will be looking to make a comeback here. Meanwhile, Auckland Aces are still searching for their first win in the competition. They lost their previous games against Northern Brave and are the underdogs here as well. WF XI Finn Allen (wk), Luke Georgeson, Troy Johnson, Michael Bracewell (c), Nathan Smith, Jamie Gibson, Tim Robinson, Logan Van Beek, Peter Younghusband, Ben Sears, Hamish Bennett AA XI Martin Guptill, George Worker, Mark Chapman, Cole Briggs, Robert O’Donnell (c), Ben Horne (wk), Sean Solia, Lockie Ferguson, Louis Delport, Adithya Ashok, Benjamin Lister WF vs AA, Super Smash 2021/22, Match 12 Date and Time: December 24, 2021, 7:10 AM IST Venue: Basin Reserve, Wellington The surface is flat and will be a treat to bat on. Bowlers will have to toil to pick up wickets and bowl tight spells on this ground. The wicket might slow down in the second half and both sides should opt to bat first if they win the toss. Wicketkeeper Finn Allen’s game of calculative risk-taking is a treat to watch. The youngster can smash opposition bowlers for fun. He has scored 77 runs in the last three matches at a strike rate of 192.5. Batters Michael Bracewell brings plenty of value to the table. Bracewell has scored 47 runs and has also picked up three wickets so far. Martin Guptill’s exploits in the shortest format of the sport are no mystery to anyone. He has had a distinguished career at the highest level and Guptill will be looking to make a mark in the Super Smash this season as well. All-rounders Logan van Beek is a proven match-winner who is expected to have a major impact in this contest as well. Not only has he scored 100 runs in three games at an average of 50, he has also picked up four wickets. Van Beek can prove to be a fine multiplier choice for your WF vs AA Dream11 fantasy side. Bowlers Lockie Ferguson is an excellent bowler in T20 cricket. The Kiwi speedster picked up two wickets in the first game. Lockie is also decent with the bat in hand. Logan van Beek (WF) – 282 points Michael Bracewell (WF) – 168 points Finn Allen (WF) – 154 points Nathan Smith (WF) – 136 points Lockie Ferguson (AA) – 109 points Logan van Beek: 100 runs and 4 wickets Michael Bracewell: 47 runs and 3 wickets Finn Allen: 77 runs Lockie Ferguson: 33 runs and 2 wickets Martin Guptill: 51 runs Fantasy Suggestion #1: Finn Allen, Michael Bracewell, Martin Guptill, Mark Chapman, George Worker, Logan Van Beek, Sean Solia, Nathan Smith, Lockie Ferguson, Louis Delport, Hamish Bennett Captain: Logan van Beek , Vice-Captain: Michael Bracewell Fantasy Suggestion #2: Finn Allen, Michael Bracewell, Martin Guptill, Mark Chapman, Logan Van Beek, Sean Solia, Nathan Smith, Lockie Ferguson, Louis Delport, Hamish Bennett, Louis Delport Captain: Martin Guptill , Vice-Captain: Lockie Ferguson.","image_url":"https://static.sportskeeda.com/editor/2021/12/446f2-16402830078615-1920.jpg","source_id":"sportskeeda"},{"title":"Man of the series Lanka Premier League 2021: Who was awarded Man of the series in LPL 2021?","link":"https://thesportsrush.com/cricket-news-man-of-the-series-lanka-premier-league-2021-who-was-awarded-man-of-the-series-in-lpl-2021/","keywords":["Cricket","Galle Gladiators","Jaffna Kings","Lanka Premier league 2021","LPL 2021"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Man of the series Lanka Premier League 2021: The opening batter from Jaffna Kings was declared the Man of the Series in LPL 2021. During the final match of the recently concluded second season of the Lanka Premier League between Jaffna Kings and Galle Gladiators in Hambantota, Jaffna Kings have registered their second consecutive title… The post Man of the series Lanka Premier League 2021: Who was awarded Man of the series in LPL 2021? appeared first on The SportsRush.","content":"Man of the series Lanka Premier League 2021: The opening batter from Jaffna Kings was declared the Man of the Series in LPL 2021. During the final match of the recently concluded second season of the Lanka Premier League between Jaffna Kings and Galle Gladiators in Hambantota, Jaffna Kings have registered their second consecutive title victory by defeating Galle Gladiators by 23 runs. Readers must note that these two teams had taken part in LPL 2020 final as well with the same team emerging as the victorious side last year as well. Despite beating Jaffna thrice this season, Galle failed to trounce them when it mattered the most. Gladiators, who had gained a massive advantage in the first half of a 202-run target, were let down by their middle-order to eventually score 178/9 in 20 overs. With bowling figures of 3-0-15-2, spinner Chaturanga de Silva was the pick of the bowlers for Jaffna at the Mahinda Rajapaksa International Cricket Stadium tonight. Other than de Silva, his younger brother and all-rounder Wanidu Hasaranga also contributed with a couple of wickets. In the first innings, individual half-centuries from Avishka Fernando (63) and Tom Kohler-Cadmore (57*) had propelled them to 201/3 in 20 overs after captain Thisara Perera won the toss and chose to bat. Man of the series Lanka Premier League 2021 Fernando, who won the ‘Man of the Match’ award for top-scoring among both the teams tonight, also won the ‘Man of the Series’ award for finishing the tournament as its second-highest run-scorer. In 10 matches this season, Fernando amassed 312 runs at an average and strike rate of 34.66 and 152.94 respectively. In what was his second half-century tonight, Fernando has also scored his maiden T20 century in the second qualifier against Dambulla Giants on Tuesday. Power Hitter Avishka Fernando with a total of 3⃣1⃣2⃣ runs in the tournament has been simply sensational in the #LPL2021 and drove his team to the coveted title! #ADIDAAMACHA #KingsOfTheNorth #LPL2021 #YaalKollo #JKvGG pic.twitter.com/pPCPDI69Uu — Jaffna Kings (@KingsJaffna) December 23, 2021 “I’m very happy that I was able to what I do to the best of my ability. I batted at number four [during the ICC T20 World Cup 2021] but I had a couple of failures, so I’m quite happy to do well again at the top of the order,” Fernando told Supreme TV during the post-match presentation ceremony. The post Man of the series Lanka Premier League 2021: Who was awarded Man of the series in LPL 2021? appeared first on The SportsRush.","pubDate":"2021-12-23 18:21:17","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"LPL 2021 final Man of the Match today: Who was awarded Man of the Match in Jaffna Kings vs Galle Gladiators LPL 2021 final?","link":"https://thesportsrush.com/cricket-news-lpl-2021-final-man-of-the-match-today-who-was-awarded-man-of-the-match-in-jaffna-kings-vs-galle-gladiators-lpl-2021-final/","keywords":["Cricket","Galle Gladiators","Jaffna Kings","Lanka Premier league 2021","LPL 2021"],"creator":["Dixit Bhargav"],"video_url":null,"description":"LPL 2021 final Man of the Match: The batter from the champion team won the Man of the Match award for top-scoring tonight. During the final match of the recently concluded second season of the Lanka Premier League between Jaffna Kings and Galle Gladiators in Hambantota, Jaffna Kings beat Galle Gladiators by 23 runs. A… The post LPL 2021 final Man of the Match today: Who was awarded Man of the Match in Jaffna Kings vs Galle Gladiators LPL 2021 final? appeared first on The SportsRush.","content":"LPL 2021 final Man of the Match: The batter from the champion team won the Man of the Match award for top-scoring tonight. During the final match of the recently concluded second season of the Lanka Premier League between Jaffna Kings and Galle Gladiators in Hambantota, Jaffna Kings beat Galle Gladiators by 23 runs. A replica of LPL 2020 final, Kings have defeated Gladiators after losing three matches in a row against them this season. Chasing a mammoth 202-run target, Gladiators started off brilliantly to score 81/2 in the powerplay. However, what followed wasn’t very smart piece of batting as they lost wickets at regular intervals which didn’t allow them to score 121 runs in the remaining 14 overs. Not making the most of a 26-ball 63-run opening partnership between Kusal Mendis (39) and Danushka Gunathilaka (54), Galle eventually ended up with 178/9 in 20 overs. With bowling figures of 3-0-15-2, spinner Chaturanga de Silva was the pick of the bowlers for Jaffna at the Mahinda Rajapaksa International Cricket Stadium tonight. Other than de Silva, his younger brother and all-rounder Wanidu Hasaranga also contributed with a couple of wickets. LPL 2021 final Man of the Match Kings captain Thisara Perera winning the toss and opting to bat first was well-supported by their opening batters Avishka Fernando (63) and Rahmanullah Gurbaz (35) who put together a brisk 56-run partnership. Fernando, who scored eight fours and a couple of sixes, subsequently stitched a 63-run partnership for the second-wicket alongside Tom Kohler-Cadmore (57*). In what was his 12th T20 half-century and second of this season, 23-year old Fernando was declared the ‘Man of the Match’ in LPL 2021 final match. Another special 5⃣0⃣ for Power Hitter Avishka Fernando. A innings so far!#JKvGG #ADIDAAMACHA #KingsOfTheNorth #LPL2021 #YaalKollo pic.twitter.com/KwsLfoEzEY — Jaffna Kings (@KingsJaffna) December 23, 2021 “I have done my best and I am extremely pleased. I batted at [No.] 4 in the WC [ICC T20 World Cup 2021]. I like to bat at the top of the order,” Fernando told Supreme TV during the post-match presentation ceremony. The post LPL 2021 final Man of the Match today: Who was awarded Man of the Match in Jaffna Kings vs Galle Gladiators LPL 2021 final? appeared first on The SportsRush.","pubDate":"2021-12-23 18:11:50","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Batters lead the way for Two Blues in Goldfields A-grade turf cricket","link":"https://thewest.com.au/news/kalgoorlie-miner/batters-lead-the-way-for-two-blues-in-goldfields-a-grade-turf-cricket-c-5052028","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Great Boulder batters among the leaders through the first half of the season","content":null,"pubDate":"2021-12-23 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5052028/63dbb507f11713e129b9e4fb66a2211559dc28b3-16x9-x0y209w4000h2250.jpg","source_id":"thewest"},{"title":"Legends League | Akhtar and Jayasuriya for Asia Lions","link":"https://www.thehindu.com/sport/cricket/legends-league-akhtar-and-jayasuriya-for-asia-lions/article38023463.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"The Legends Cricket League, a professional cricket league for retired international cricketers, on Thursday announced that Shoaib Akhtar and Sanath Ja","content":null,"pubDate":"2021-12-23 16:53:59","full_description":null,"image_url":null,"source_id":"thehindu"},{"title":"Revived MCG pitch promises stage fit for a compelling Ashes contest | Geoff Lemon","link":"https://www.theguardian.com/sport/2021/dec/24/revived-mcg-pitch-promises-stage-fit-for-a-compelling-ashes-contest","keywords":["The Ashes","Ashes 2021-22","Australia cricket team","England cricket team","Cricket","Australia sport","Sport"],"creator":["Geoff Lemon in Melbourne"],"video_url":null,"description":"If curators can produce something approaching last year’s lively pitch, the 70,000 expected in Melbourne could be in a for a Boxing Day treatThose England supporters who only pay attention to cricket in Australia every four years might be expecting the third Ashes Test to be a certain kind of game. That would be based on England’s last visit to the Melbourne Cricket Ground in 2017, for a match played on a pitch so dead that the biggest sporting event in Victoria’s calendar was more a state funeral. What we saw that year was a horticultural marvel, in that nobody could get anyone out, but equally nobody could score. The batting oozed along in a slurry of mistimed shots, and the chief mode of occasional dismissal seemed to be deliveries chopped onto the stumps. After days of that, the large sign above the Percy Beames bar bearing the ground’s highest score by a visiting player saw Alastair Cook’s 244 regrettably replace the masterpiece 208 by Vivian Richards. At least they both got knighthoods. Continue reading...","content":null,"pubDate":"2021-12-23 16:30:01","full_description":"T hose England supporters who only pay attention to cricket in Australia every four years might be expecting the third Ashes Test to be a certain kind of game. That would be based on England’s last visit to the Melbourne Cricket Ground in 2017, for a match played on a pitch so dead that the biggest sporting event in Victoria’s calendar was more a state funeral. What we saw that year was a horticultural marvel, in that nobody could get anyone out, but equally nobody could score. The batting oozed along in a slurry of mistimed shots, and the chief mode of occasional dismissal seemed to be deliveries chopped onto the stumps. After days of that, the large sign above the Percy Beames bar bearing the ground’s highest score by a visiting player saw Alastair Cook’s 244 regrettably replace the masterpiece 208 by Vivian Richards. At least they both got knighthoods. This time around, things might be different. English correspondents express bemusement that Australians use the title “curator” for those who prepare the pitch, but of course we do - it is the finest of arts. After 2017, the MCG persuaded Matt Page to move states and give up guardianship of the pitches for the two Perth grounds. In a gradual process that culminated last year, Page managed to bring the drop-in wicket square for the MCG back to life. Thus on Boxing Day in 2020, we saw a slightly green surface that was full of juice and life, giving vigour to the fast bowlers on both sides. India took the honours via Mohammed Siraj and Jasprit Bumrah, Australia bowled well via Pat Cummins, Mitchell Starc and Josh Hazlewood, and it was a true enough wicket for Ajinkja Rahane to dig in for a series-turning century. There was also some bounce and grip for the finger-spinners on both sides, who took 11 wickets between them. It was an enthralling contest, done late on the fourth day. No curator can just roll out the same surface again, but if Page can get something approaching last year’s effort, it will be a fit stage for a contest. As deflated as the whole camp must be, England’s seam attack could yet get something useful out of such a surface and push back in the series. That won’t be of much use though without help from England’s batting, which is as likely to struggle here as anywhere. Personnel changes in the top six are likely, but if there were any potential replacements with good credentials to play, they already would be there. As to which Australian bowlers they will be facing, that is a much more open question. Josh Hazlewood will spend Christmas in Melbourne but apparently won’t play. Mitchell Starc had some back problems last time out and is facing 14 days of Test cricket out of 23. Cameron Green was held back by the fitness staff on the last day in Adelaide. Jhye Richardson put in a big shift there after not playing a Test in nearly three years. Michael Neser has had recent hamstring problems. Into the squad comes Scott Boland, seemingly as cover for everybody. Two days out from the match, Australia’s coach Justin Langer said that Starc would probably play and that Green’s treatment was just precaution for a young player. Cummins will return, and surely one of Neser or Richardson will be right. Boland probably won’t play, but if he does, he’s a sharp bowler who hits a hard length, and takes his wickets for Victoria at the MCG at an average of 25. Also different for this visit in 2021 will be the crowd. Facing up while surrounded by 70,000 people is still a rare experience in professional cricket, but it will be less intense than the 90,000 or more who would usually pack out Boxing Day for an Ashes tour. The covid rate in Melbourne will keep some people at home, because for all of the MCC’s assurances about protocols, there is no way that safety standards can be maintained all day at crush points and bars. For those who do come along though, the last point of difference is a big one: the series is still live. In 2006, 2013, and 2017, the Ashes had been wrapped up 3-0 before the Boxing Day Test. With the revised schedule in 2021, it has become the third Test, which is much more compelling. A fifth Test later in January is also great for the schedule. Cricket Australia should learn and retain that for future years. If the MCG pitch can change, so can anything.","image_url":"https://i.guim.co.uk/img/media/53812e34ea71dbc841edf6f04a4c83b19a30cfc6/0_168_5041_3025/master/5041.jpg?width=460&quality=85&auto=format&fit=max&s=5ef7f169223ad3ea7b77f87eadc6d442","source_id":"theguardian"},{"title":"Jaffna vs Galle LPL 2021 final Live Telecast Channel in India and USA: When and where to watch Lanka Premier League 2021 final?","link":"https://thesportsrush.com/cricket-news-jaffna-vs-galle-lpl-2021-final-live-telecast-channel-in-india-and-usa-when-and-where-to-watch-lanka-premier-league-2021-final/","keywords":["Cricket","Galle Gladiators","Jaffna Kings","Lanka Premier league 2021","LPL 2021"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jaffna vs Galle LPL 2021 final Live Telecast: The SportsRush presents before you the timing and live streaming details of LPL 2021 final. The final match of the ongoing second season of the Lanka Premier League is being played between Jaffna Kings and Galle Gladiators in Hambantota tonight. Readers must note that the final match… The post Jaffna vs Galle LPL 2021 final Live Telecast Channel in India and USA: When and where to watch Lanka Premier League 2021 final? appeared first on The SportsRush.","content":"Jaffna vs Galle LPL 2021 final Live Telecast: The SportsRush presents before you the timing and live streaming details of LPL 2021 final. The final match of the ongoing second season of the Lanka Premier League is being played between Jaffna Kings and Galle Gladiators in Hambantota tonight. Readers must note that the final match is a replica of LPL 2020 final which was also played between these two teams. Kings captain Thisara Perera’s decision of electing to bat after winning the toss has worked in their favour as their opening batters Avishka Fernando and Rahnamullah Gurbaz in the first overs. Led by Bhanuka Rajapaksa, Gladiators have won all their three matches against Kings this season. It would now be interesting to see if Jaffna will be able to end their losing streak against Galle in this all-important final or not. Wishing @KingsJaffna and @GalleGladiators good luck for tonight’s finals! Looking forward to a fierce battle between the two finalists for the #LPLT20 trophy May the best team win!#එක්වජයගමු #ஒன்றாகவென்றிடுவோம் #WinTogether #SriLanka #T20cricket #LankaPremierLeague #LPL2021 — Namal Rajapaksa (@RajapaksaNamal) December 23, 2021 Jaffna vs Galle LPL 2021 final Live Telecast in India and USA Sony Sports Network are televising the ongoing Lanka Premier League 2021 final match in India. The last match of the tournament is being televised on both Sony SIX and Sony TEN 2 in English commentary in India. Online users can stream the tournament on Sony’s streaming application named Sony LIV. It is worth mentioning that fans no longer have the option of watching the match on Airtel Xstream app as Sony Network’s channels are no longer available on this platform. As far as the local fans is Sri Lanka are concerned, they can watch LPL 2021 final match on Supreme TV. While Willow TV are broadcasting LPL 2021 final in USA and Canada, A Sports are televising it in Pakistan. Date – 23/12/2021 (Thursday). Match start Time – 07:30 PM (India and Sri Lanka). TV Channel – Sony SIX and Sony TEN 2 (India), Supreme TV (Sri Lanka), Willow TV (USA and Canada), A Sports (Pakistan), Fox Sports (Australia), Free Sports (UK) and Sports Max Cricket (Caribbean). Online platform – Sony LIV (India), Daraz App (Sri Lanka) and Kayo app (Australia). The post Jaffna vs Galle LPL 2021 final Live Telecast Channel in India and USA: When and where to watch Lanka Premier League 2021 final? appeared first on The SportsRush.","pubDate":"2021-12-23 14:26:03","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Dilip Vengsarkar slams Sourav Ganguly for speaking on behalf of selectors, says THIS","link":"https://zeenews.india.com/cricket/dilip-vengsarkar-slams-sourav-ganguly-for-speaking-on-behalf-of-selectors-says-this-2422080.html","keywords":null,"creator":null,"video_url":null,"description":"Former India batter and chairman of selectors Dilip Vengsarkar has slammed BCCI president Sourav Ganguly for speaking on behalf of current selectors and creating an unnecessary controversy in Indian cricket.","content":null,"pubDate":"2021-12-23 14:14:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"WB-W vs AH-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Women’s Super Smash 2021-22 Match 14","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wb-w-vs-ah-w-dream11-prediction-fantasy-cricket-tips-todays-playing-11-pitch-report-women-s-super-smash-2021-22-match-14?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-23 13:11:25","full_description":"Wellington Blaze will take on Auckland Hearts in Match No. 14 of the Women’s Super Smash 2021-22 at the Basin Reserve in Wellington on Friday. Wellington Blaze have been in splendid form, winning three matches in a row. They are currently second in the points table. Meanwhile, Auckland Hearts have also won two in a row and are closely following Wellington Blaze in the points table. Wellington Blaze : Rebecca Burns, Georgia Plimmer, Amelia Kerr, Maddy Green (c), Jess Kerr, Leigh Kasperek, Thamsyn Newton, Jessica McFadyen (wk), Xara Jetly, Maneka Singh, Deanna Doughty Auckland Hearts : Lauren Down (c), Anna Peterson, Katie Perkins, Bella Armstrong, Holly Huddleston, Arlene Kelly, IC Gaze (wk), Skye Bowden, Jesse Prasad, Molly Penfold, Fran Jonas Match: WB-W vs AH-W Date & Time: December 24th 2021, 3:40 AM IST Venue: Basin Reserve, Wellington The 22-yard surface at the Basin Reserve in Wellington is usually a good one to bat on. Two games of the tournament have been played at this venue, with 144 and 142 being the scores batting first. Thus, more of the same can be expected from this game. Wicketkeeper Jessica McFadyen hasn't contributed with the bat but she has taken three catches and has affected five stumpings. Batters Lauren Down has scored 54 runs in two innings in this Women’s Super Smash 2021-22 so far. All-rounders Amelia Kerr has been magnificent with both the bat and the ball. She has returned with five wickets and has scored 183 runs. Anna Peterson has taken three wickets and has chipped in with 27 runs as well in two games. Bowlers Leigh Kasperek is in fine form and has picked up six wickets. With the bat, she has scored 103 runs so far. Amelia Kerr (WB-W): 439 points Leigh Kasperek (WB-W): 331 points Maneka Singh (WB-W): 193 points Holly Huddleston (AH-W): 146 points Anna Peterson (AH-W): 141 points Amelia Kerr: 183 runs & 5 wickets Leigh Kasperek: 103 runs & 6 wickets Anna Peterson: 27 runs & 3 wickets Holly Huddleston: 54 runs & 2 wickets Fantasy Suggestion #1: Jessica McFadyen, Katie Perkins, Maddy Green, Lauren Down, Thamsyn Newton, Amelia Kerr, Anna Peterson, Arlene Kelly, Holly Huddleston, Leigh Kasperek, Maneka Singh Captain: Amelia Kerr Vice-captain: Anna Peterson Fantasy Suggestion #2: Jessica McFadyen, Katie Perkins, Lauren Down, Rebecca Burns, Amelia Kerr, Anna Peterson, Arlene Kelly, Holly Huddleston, Leigh Kasperek, Jess Kerr, Maneka Singh Captain: Amelia Kerr Vice-captain: Holly Huddleston","image_url":"https://static.sportskeeda.com/editor/2021/12/abe9c-16402615342459-1920.jpg","source_id":"sportskeeda"},{"title":"U-19 Asia Cup: India thrash UAE by 154 runs; Pakistan beat Afghanistan","link":"https://www.indiatvnews.com/sports/cricket/u-19-asia-cup-india-thrash-uae-by-154-runs-pakistan-beat-afghanistan-750903","keywords":null,"creator":null,"video_url":null,"description":"India U-19 cricket team was off to an auspicious start in the ACC U-19 Asia Cup as the Yash Dhull-led side defeated UAE U-19 by 154 runs here on Thursday. Harnoor Singh shone with the bat for India with a century while Dhull scored a half-century as well before Indian bowlers ran through UAE batting order.","content":null,"pubDate":"2021-12-23 13:09:19","full_description":"India U-19 cricket team was off to an auspicious start in the ACC U-19 Asia Cup as the Yash Dhull-led side defeated UAE U-19 by 154 runs here on Thursday. Harnoor Singh shone with the bat for India with a century while Dhull scored a half-century as well before Indian bowlers ran through UAE batting order. In the other matches played on Thursday, Pakistan beat Afghanistan by four wickets and Sri Lanka hammered Kuwait by 274 runs. In India's match, the 'Boys in Blue' put up 282 for five on the board, courtesy Harnoor's 120 off 130 balls and skipper Dhull's 63 off 68 balls. Rajvardhan Hangargekar's unbeaten 48 off 23 balls provided the final flourish. UAE used as many as nine bowling options at the ICC Academy Ground but the move did not help their cause. The home team's batters came a cropper against the Indian bowling line-up, folding up for 128 in 34.3 overs. Hangargekar took three wickets for India while Garv Sangwan, Vicky Oswal and Kaushal Tamble took two each. India next play arch-rivals Pakistan on Saturday. The tournament is being played ahead of the U-19 World Cup in the West Indies next month.","image_url":null,"source_id":"indiatvnews"},{"title":"Legends League Cricket: Shoaib Akhtar, Shahid Afridi, Sanath Jayasuriya named in Asia Lions team","link":"https://zeenews.india.com/cricket/legends-league-cricket-shoaib-akhtar-shahid-afridi-sanath-jayasuriya-named-in-asia-lions-team-2422044.html","keywords":null,"creator":null,"video_url":null,"description":"The League will be played in January 2022 at the Al Amerat Cricket Stadium in Oman between three power-packed teams. The other two teams would be representing India and Rest of the World.","content":null,"pubDate":"2021-12-23 12:11:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Cricket-Lara, Steyn join coaching staff of IPL&#039;s Hyderabad team","link":"https://www.thestar.com.my/sport/cricket/2021/12/23/cricket-lara-steyn-join-coaching-staff-of-ipl039s-hyderabad-team","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - West Indies batting great Brian Lara and former South Africa pace spearhead Dale Steyn have joined the revamped coaching staff of the Indian Premier League's Sunrisers Hyderabad, the franchise said on Thursday. Read full story","content":null,"pubDate":"2021-12-23 11:54:00","full_description":"MUMBAI (Reuters) - West Indies batting great Brian Lara and former South Africa pace spearhead Dale Steyn have joined the revamped coaching staff of the Indian Premier League's Sunrisers Hyderabad, the franchise said on Thursday. Lara, who scored more that 22,000 runs in international cricket before retiring in 2007, was named as the strategic advisor and batting coach of the side that won the popular Twenty20 tournament in 2016. Steyn, who announced his retirement from all forms of the game in August, was named as the pace bowling coach of the franchise he played for in the past. Hyderabad finished last in the 2021 edition of the eight-team tournament after which head coach Trevor Bayliss stepped down. He was replaced by former Australian all-rounder Tom Moody, who worked as the director of cricket last season. Former Australia batter Simon Katich and ex-India batter Hemang Badani also joined the side's support staff with highest test wicket-taker Muthiah Muralidaran continuing as the spin bowling coach. (Reporting by Sudipto Ganguly; Editing by Toby Chopra)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/23/1418338.jpg","source_id":"thestar_my"},{"title":"Strikers ‘nowhere near it’ as BBL campaign hits new low in Heat loss - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMi5QFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvZG9tZXN0aWMtY3JpY2tldC9iaWctYmFzaC9saXZlLWJibC1jcmlja2V0LXNjb3Jlcy0yMDIxLWFkZWxhaWRlLXN0cmlrZXJzLXZzLWJyaXNiYW5lLWhlYXQtaG93LXRvLWxpdmUtc3RyZWFtLXN1cGVyY29hY2gtdXBkYXRlcy1zY29yZWNhcmQtY29tbWVudGFyeS9uZXdzLXN0b3J5Lzg4MGQwNTNlZWZlZjVmZTZkZDQ4ZDNhODgyNDA5ODE40gHlAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC9kb21lc3RpYy1jcmlja2V0L2JpZy1iYXNoL2xpdmUtYmJsLWNyaWNrZXQtc2NvcmVzLTIwMjEtYWRlbGFpZGUtc3RyaWtlcnMtdnMtYnJpc2JhbmUtaGVhdC1ob3ctdG8tbGl2ZS1zdHJlYW0tc3VwZXJjb2FjaC11cGRhdGVzLXNjb3JlY2FyZC1jb21tZW50YXJ5L25ld3Mtc3RvcnkvODgwZDA1M2VlZmVmNWZlNmRkNDhkM2E4ODI0MDk4MTg?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Strikers ‘nowhere near it’ as BBL campaign hits new low in Heat loss  Fox SportsDuckett fires as Heat bounce back over Strikers  cricket.com.auBig Bash 2021-22 match preview: Adelaide Strikers v Brisbane Heat  The Cricketer‘Key wicket’: Heat lock in No.1 target  NEWS.com.auAdelaide Strikers vs Brisbane Heat Preview & Prediction  The Stats ZoneView Full coverage on Google News","content":null,"pubDate":"2021-12-23 11:22:00","image_url":null,"source_id":"google"},{"title":"Cricket-Collingwood to stand in as England coach for West Indies series","link":"https://www.thestar.com.my/sport/cricket/2021/12/23/cricket-collingwood-to-stand-in-as-england-coach-for-west-indies-series","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former England captain Paul Collingwood will stand in as head coach for England's five-match Twenty20 International series against West Indies next month, the country's cricket board (ECB) said on Thursday. Read full story","content":null,"pubDate":"2021-12-23 11:01:00","full_description":"(Reuters) - Former England captain Paul Collingwood will stand in as head coach for England's five-match Twenty20 International series against West Indies next month, the country's cricket board (ECB) said on Thursday. Regular head coach Chris Silverwood will take a break following the ongoing Ashes series against Australia, with Marcus Trescothick joining Collingwood as an assistant coach. Eoin Morgan will captain the squad. Collingwood was at the T20 World Cup earlier this year with England before going to the Ashes, but flew back to Britain last week. Of the 16 players named in the squad, 11 travelled to the World Cup, with uncapped left-arm seamer David Payne earning a maiden call-up to the England T20I team. \"We have selected a strong squad with some serious batting power and a balanced attack as we begin preparations ahead of the T20 World Cup in Australia,\" Collingwood said. \"The World Cup is less than a year away and there will be increased opportunities for the squad in the absence of those players who are with the Ashes squad.\" The series will begin on Jan. 22 and will conclude on Jan. 30. Squad: Eoin Morgan (captain), Moeen Ali, Tom Banton, Sam Billings, Liam Dawson, George Garton, Chris Jordan, Liam Livingstone, Saqib Mahmood, Tymal Mills, David Payne, Adil Rashid, Jason Roy, Phil Salt, Reece Topley, James Vince. (Reporting by Aadi Nair in Bengaluru; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/23/1418260.jpg","source_id":"thestar_my"},{"title":"David Payne cricket: Phil Salt and George Garton among three uncapped players in England’s T20I squad for West India tour","link":"https://thesportsrush.com/cricket-news-david-payne-cricket-phil-salt-and-george-garton-among-three-uncapped-players-in-englands-t20i-squad-for-west-india-tour/","keywords":["Cricket","David Payne","England","England tour of West Indies 2022","George Garton","Phil Salt","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"David Payne: The left-arm pacer from Gloucestershire is among the three uncapped players in England’s T20I squad for West Indies tour. England have named a strong 16-member squad for their upcoming five-match T20I series in West Indies beginning from January 22 in Bridgetown. England, whose last T20I was the ICC T20 World Cup 2021 semi-final… The post David Payne cricket: Phil Salt and George Garton among three uncapped players in England’s T20I squad for West India tour appeared first on The SportsRush.","content":"David Payne: The left-arm pacer from Gloucestershire is among the three uncapped players in England’s T20I squad for West Indies tour. England have named a strong 16-member squad for their upcoming five-match T20I series in West Indies beginning from January 22 in Bridgetown. England, whose last T20I was the ICC T20 World Cup 2021 semi-final against New Zealand in Abu Dhabi last month, have made as many as eight changes to their World Cup squad. Considering the minimal gap between the last day of the fifth Ashes 2021-22 Test against Australia and the Bridgetown T20I, there was no way how multi-format players could have traveled and quarantined in the exact opposition part of the world. As a result, white-ball vice-captain Jos Buttler, batters Dawid Malan and Jonny Bairstow and pacer-duo of Chris Woakes and Mark Wood aren’t part of the T20I squad. Meanwhile, players such as Jofra Archer, Brydon Carse, Sam Curran, Tom Curran, Lewis Gregory, Olly Stone and David Willey were unavailable due to various injuries. David Payne, Phil Salt and George Garton included in England’s T20I squad for West India tour A consequence of tightly-knit international fixtures has come in the form of opportunities to play for England for the first time in the shortest format for batter Phil Salt and pacer-duo of David Payne and George Garton. While Salt had played three ODIs against Pakistan earlier this year, Payne and Garton are uncapped at the highest level. However, both have been part of England’s white-ball squad in the recent past. Having most recently finished playing for Dambulla Giants in Lanka Premier League 2021, Salt is the highest run-scorer (final to be played tonight) on the back of scoring 301 runs in 10 matches at an average and strike rate of 30.10 and 154.35 respectively. Batting-pair of Tom Banton and James Vince, who had last played T20Is in 2020 and 2019 respectively, have been recalled to fill voids in the top-order. Banton, who was representing Colombo Stars in LPL 2021, was short of runs with his 109 runs coming at an average and strike rate of 13.62 and 107.92 respectively. Vince, on the other hand, is currently representing Sydney Sixers in Big Bash League 2021-22. All-rounder Liam Dawson has been preferred as the third spin-bowling option behind Ali and Rashid. Fast bowling-pair of Saqib Mahmood and Reece Topley, who had last played T20Is in July and March this year respectively, have also been handed T20I comebacks. While Mahmood is plying his trade for Sydney Thunder in BBL 11, Topley is playing for Melbourne Renegades. Much like Vince and Dawson, Topley was also among the three reserves for England’s World Cup squad. England T20I squad vs West Indies 2022 Eoin Morgan (c), Moeen Ali, Tom Banton, Sam Billings, Liam Dawson, George Garton, Chris Jordan, Liam Livingstone, Saqib Mahmood, Tymal Mills, David Payne, Adil Rashid, Jason Roy, Phil Salt, Reece Topley, James Vince. “We have selected a strong squad with some serious batting power and a balanced attack as we begin preparations ahead of the T20 World Cup in Australia. The World Cup is less than a year away and there will be increased opportunities for the squad in the absence of those players who are with the Ashes squad. “I have good memories winning a World Cup in Barbados and I’m really looking forward to going back there with this squad to face a very good West Indies who will test all aspects of our skills,” former England captain and their head coach for West Indies tour Paul Collingwood said in a statement. The post David Payne cricket: Phil Salt and George Garton among three uncapped players in England’s T20I squad for West India tour appeared first on The SportsRush.","pubDate":"2021-12-23 10:59:09","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket-S Africa welcome back Olivier with open arms for India series","link":"https://www.thestar.com.my/sport/cricket/2021/12/23/cricket-s-africa-welcome-back-olivier-with-open-arms-for-india-series","keywords":null,"creator":null,"video_url":null,"description":"PRETORIA (Reuters) - Fast bowler Duanne Olivier is expected to return to the South Africa line-up as the home side challenge visiting India in the first match of a three game series in the ICC World Test Championship at Centurion Park starting on Sunday. Read full story","content":null,"pubDate":"2021-12-23 10:41:00","full_description":"PRETORIA (Reuters) - Fast bowler Duanne Olivier is expected to return to the South Africa line-up as the home side challenge visiting India in the first match of a three game series in the ICC World Test Championship at Centurion Park starting on Sunday. Olivier will bolster a home seam attack missing injured Anrich Nortje and will play his first test since 2019, when he turned his back on South Africa in favour of county cricket in England, despite considerable success in the five-day format. The series is expected to be a battle between the respective pace attacks on lively wickets, especially in the first two tests on the Highveld, and Olivier’s return is therefore timely having taken 48 wickets in 10 tests at an average of under 20. \"I want our best opportunity to win matches and series, and in order for that to happen, you need to make tough calls, for instance bringing people back,\" South Africa captain Dean Elgar told reporters in response to whether Olivier should be given a chance to return. \"I was very keen to have him back, I’m happy and excited knowing what he can do on the field. There’s no bad feelings about what’s happened in the past.\" South Africa have often relied on fast bowlers on spicy home wickets to get them to victory, but are also well aware that India have developed an excellent pace attack that has brought them overseas success in the last few years. \"India has been an immensely improved bowling line up, especially playing away from home. We're very mindful of what we're going to be up against,\" Elgar said. India have kept a low profile in their Johannesburg bio-secure bubble since their arrival in the country, but batsman Cheteshwar Pujara believes this is their best chance yet of claiming a first ever test series win in South Africa. \"Our fast bowlers have been the difference between the sides overall when we have played abroad. If you look at the Australia and England series, we have done exceptionally well as a bowling unit,\" Pujara told the Board of Control for Cricket in India website. \"Our fast bowlers are our strength (in South Africa) and I hope they can utilise the conditions and give us 20 wickets in each test match.\" India are coming off a home series win over New Zealand completed this month, while South Africa have not played test cricket since a series victory in the West Indies in June. (Reporting by Nick Said; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/23/1418227.jpg","source_id":"thestar_my"},{"title":"IPL 2022 auction in Bengaluru on Feb 12-13","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/ipl-2022-auction-in-bengaluru-on-feb-12-13/article38020304.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"The Board of Control for Cricket in India (BCCI) has informed the franchises that the IPL mega-auction will be held in Bengaluru on February 12 and 13.","content":null,"pubDate":"2021-12-23 10:36:27","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"IND vs SA: Indian batting line-up good enough to tackle South African pacers, says Cheteshwar Pujara","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-2021-2022-indian-batting-line-up-good-enough-to-tackle-south-african-pacers-says-cheteshwar-pujara-750876","keywords":null,"creator":null,"video_url":null,"description":"The right-handed batsman Cheteshwar Pujara is confident of his team's batting abilities to tackle lateral movement on pace-friendly tracks in South Africa and he believes that the team led by Virat Kohli will play good cricket in the Rainbow nations.","content":null,"pubDate":"2021-12-23 10:34:59","full_description":"The right-handed batsman is confident of his team's batting abilities to tackle lateral movement on pace-friendly tracks in South Africa and he believes that the team led by will play good cricket in the Rainbow nations. Pujara said the recent overseas success has made India a confident unit and that will reflect in the three-Test series, beginning Sunday. \"When you are a visiting team, you know that there is pace and bounce and there is lateral movement and to face the fast bowlers is always a big challenge when you go out of India,\" Pujara said in a video posted by BCCI on its twitter handle. \"This team has learnt that and this is a much more balanced batting line-up and I think we will be able to tackle that and with our preparation I am very confident we will put up a good show.\" Pujara also felt that the experience of having played in South Africa will also stand them in good stead. \"...most of the (Indian) players have played in South Africa in the past, it is an experienced side and it terms of preparation, we know what is expected from us. \"Most of the teams play well in their home conditions and it's the same with the South African team. They have one of the best bowling line-ups and facing one of the best fast bowlers has always been challenging,\" said the 33-year-old from Rajkot. India had retained the Border-Gavaskar trophy after beating Australia 2-1 in the four-match series early in the year. Virat Kohli's men also claimed a 2-1 victory in the five-Test rubber in England before the fifth Test was cancelled due to COVID-19. \"Having done well in England and Australia will make a big difference in this squad's confidence and self belief that we can win overseas, we can win in any conditions,\" Pujara said. \"And with our bowling and batting line-up, I am very confident that we have the capacity to win a series in South Africa.\" Pujara has lacked consistency since 2020 with his last century coming in January 2019 in Australia. In the last 10 innings, he has scored two fifties but couldn't convert them to big scores. The Indian batting mainstay said he has better clarity now about how to go about things, having played in these conditions here before. \"When I came here in 2011, and Morne Morkel were at their peak, I visited again in 2013 and 2017, so I understood what to expect. \"With experience you learn so many things, I feel you start believe in your preparation and don't need to change too many things. Because of my tours of South Africa and Australia, I know the conditions little better. \"With that experience I know how to prepare, what kind of shots to play and what kind of shots one needs to avoid, so you are little bit clear with your preparation and mindset.\" The Indian team is staying in a resort here with lot of open spaces inside the bio-bubble. \"This is the best bubble I have been a part of, you can move around, get fresh air, there is lot of places to move around, that helps when it comes to mental preparation, so you are much more relaxed, being close to the nature.\"","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket-Silverwood must get decisions right or face music, says Panesar","link":"https://www.thestar.com.my/sport/cricket/2021/12/23/cricket-silverwood-must-get-decisions-right-or-face-music-says-panesar","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former England spinner Monty Panesar believes Chris Silverwood could face being replaced as coach if he does not get his decision-making right ahead of the third Ashes test against Australia starting on Sunday. Read full story","content":null,"pubDate":"2021-12-23 10:32:00","full_description":"(Reuters) - Former England spinner Monty Panesar believes Chris Silverwood could face being replaced as coach if he does not get his decision-making right ahead of the third Ashes test against Australia starting on Sunday. England have been comprehensively outplayed by Australia in the first two matches, suffering heavy defeats in Brisbane and Adelaide and unless things change quickly the series will more than likely be lost in Melbourne. Captain Joe Root and Silverwood have come under scrutiny for their team selections, including leaving bowlers James Anderson and Stuart Broad out of the opening match in Brisbane. Former skipper Michael Atherton then branded the decision to pick five seamers and no spinners and leave paceman Mark Wood out of the Adelaide test as \"lacking cricketing sense\". Panesar said England have to get their team selection right in Melbourne. \"It's an important test match for both Joe Root and Chris Silverwood,\" Panesar said. \"Root's performances in the next three Test matches are going to be vital, and Silverwood himself has said that he's accountable for making decisions and takes ownership, so it puts his position under pressure if they continue to get these decisions wrong. \"It's also about the nature of these losses. The defeats that they have suffered have been very heavy.\" Panesar said the key in Melbourne will be to get runs on the board and not rely solely on Root. \"They have to get their decisions right in terms of team selection and in terms of attitude too,\" he said in his William Hill blog. \"And the key is going to be runs, if they don't get runs on the board then they will lose this test as well. \"They need to ask themselves how they can get to 350, 400 and with who. There's a lot of onus on Root, who's scored over 30% of England's runs this year, but he's a lone soldier trying to get all of these runs for England and he needs help.\" Panesar thinks the England top order must be changed with Rory Burns making way after four failures. \"I'm not sure if Rory Burns has the technique to adjust to these Australian pitches, whereas Zak Crawley has the attacking approach, which paired with the defensive style of Haseeb Hameed, would work really well,\" Panesar said. \"These are the decisions that have to be made and if Chris Silverwood gets it wrong for a third time, then I think people will start questioning whether he's the right man to lead England as head coach.\" (Reporting by Martyn Herman; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/23/1418216.jpg","source_id":"thestar_my"},{"title":"'Virat Kohli had problems with Anil Kumble, now he has problems with Sourav Ganguly,' says THIS former Pakistan cricketer","link":"https://zeenews.india.com/cricket/virat-kohli-had-problems-with-anil-kumble-now-he-has-problems-with-sourav-ganguly-says-this-former-pakistan-cricketer-2421994.html","keywords":null,"creator":null,"video_url":null,"description":"\"Virat had problems with Anil Kumble, now he has problems with Ganguly. Kumble and Ganguly have proved themselves; they are the real ambassadors of the game. Virat is speaking against Ganguly who has changed Indian cricket,\" Kaneria said.","content":null,"pubDate":"2021-12-23 10:15:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"IPL auction 2022 date and time: Will IPL 2022 auction and India-West Indies ODI clash in February?","link":"https://thesportsrush.com/cricket-news-ipl-auction-2022-date-and-time-will-ipl-2022-auction-and-india-west-indies-odi-clash-in-february/","keywords":["Cricket","IPL 2022","India","Indian Premier League","IPL Auction","West Indies","West Indies tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IPL auction 2022 date and time: The auction for the 15th season of the Indian Premier League will be held in less than two months’ time from now. The auction date for the 15th season of the Indian Premier League has been confirmed. In what will be a mega-auction, perhaps the last one in the… The post IPL auction 2022 date and time: Will IPL 2022 auction and India-West Indies ODI clash in February? appeared first on The SportsRush.","content":"IPL auction 2022 date and time: The auction for the 15th season of the Indian Premier League will be held in less than two months’ time from now. The auction date for the 15th season of the Indian Premier League has been confirmed. In what will be a mega-auction, perhaps the last one in the IPL, it will be a two-day affair which will be held in Bengaluru in February 2022. It was only last month that eight teams had shelved as much as INR 256 crore to retain a total of 27 players (19 Indian and eight overseas) ahead of the auction. Contrary to the original plan, two new teams will get more time to finalize their first set of three players before the auction. Once the same happens, teams will have more clarity regarding their potential first-choice picks in the auction. While the Lucknow franchise has zeroed in on their support staff and also the players (reportedly), Ahmedabad franchise is yet to make any official announcement due to a pending inquiry about its owners. IPL auction 2022 date and time Contrary to a previous report, IPL 2022 auction will take place on February 12 and 13. A mega auction involving 10 teams is bound to be conducted over a two-day period. Hence, no surprises there. It is worth mentioning that BCCI (Board of Control for Cricket in India) are likely to stop accepting players’ names from other countries and state associations of India by mid-January. It will be after then that a players’ list will be trimmed down for the auction. Will IPL 2022 auction and India-West Indies ODI clash in February? India, who are scheduled to host West Indies during the times of IPL 2022 auction as part of their bumper home season, will be playing the third ODI in Kolkata on February 12. In the past, the date of auction has been finalized in such a way that it never clashes with India’s international match. While BCCI might tinker with the schedule at a later stage, both the marquee events are set to clash for now. There is no hiding to the fact that a clash will mean a certain loss for broadcaster Star Sports Network for audiences will get divided between the auction and India-West Indies third ODI. “It has been clarified to us that the match and auction are two different things and both will go ahead [on the same date],” a franchise official was quoted as saying by Cricbuzz. The post IPL auction 2022 date and time: Will IPL 2022 auction and India-West Indies ODI clash in February? appeared first on The SportsRush.","pubDate":"2021-12-23 09:49:06","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Akhtar, Jayasuriya in Asia Lions squad for Legends Cricket League","link":"https://sportstar.thehindu.com/cricket/shoaib-akhtar-sanath-jayasuriya-asia-lions-squad-legends-cricket-league/article38019609.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"The league will be played at the Al Amerat Cricket Stadium in Oman between three teams. Besides Asia Lions, the other two teams would be representing India and Rest of the World.","content":null,"pubDate":"2021-12-23 09:08:20","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Ashes 2021-22: How the new Covid restrictions will play out for the Sydney Test","link":"https://thewest.com.au/sport/ashes-2021-22-how-the-new-covid-restrictions-will-play-out-for-the-sydney-test-c-5066936","keywords":null,"creator":["Sam Landsberger"],"video_url":null,"description":"As Covid cases rocketed to almost six thousand in NSW, Cricket Australia has revealed what the new restrictions will mean to fans and their impact on crowd capacity at the SCG.","content":null,"pubDate":"2021-12-23 09:06:52","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5066936/e23b03faef7729a024a1c8baaca0b7e3f8ac45d4-16x9-x0y0w2048h1152.jpg","source_id":"thewest"}]}