{"newsArray":[{"article_id":"46fcb450e7483e4b9e87c77336cd7b96","title":"England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup","link":"https://www.dailymail.co.uk/sport/cricket/article-12744725/England-batter-Ben-Duckett-seize-big-chance-impress-Caribbean-watching-tired-team-mates-struggle-World-Cup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE INTERVIEW BY LAWRENCE BOOTH: Duckett, who has been at the heart of England's Bazball revolution in Test cricket, intends to show what he can do in 50-over cricket.","content":"England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup A new-look England will face the West Indies in three ODIs next month Ben Duckett hopes to add to the eight one-day caps he has won in seven years The 29-year-old has been at the heart of the Bazball revolution in Test cricket By Lawrence Booth for the Daily Mail Published: 20:01, 13 November 2023 | Updated: 20:37, 13 November 2023 e-mail View comments A refreshed Ben Duckett wants to take the Caribbean by storm next month after watching his ‘tired’ team-mates struggle at the World Cup in India . Duckett, who has been at the heart of England’s Bazball revolution in Test cricket, intends to show what he can do in 50-over cricket when a new four-year World Cup cycle begins with the first of three ODIs against West Indies in Antigua on December 3. And he believes the simplicity of his approach, which essentially remains unaltered whatever the format, will stand him in good stead as he looks to add to the eight one-day caps he has won since his debut in Bangladesh seven years ago. ‘I’ve been a part of the best generation of England white-ball cricket and it’s been near to impossible to break into the team,’ he told Mail Sport. ‘Now there’s an opportunity to go and get my place.’ Managing director Rob Key said on Sunday he felt England’s one-day team had not been helped by comparisons with the aggressive Bazballers. And with many of the 30-somethings who have fallen so short in India being omitted from the trip to the Caribbean, a new-look one-day side will include the Test-match top three of Duckett, Zak Crawley and Ollie Pope. England batter Ben Duckett wants to take the Caribbean by storm next month Once, England used the one-day team as the route into Test cricket. Then, under Ben Stokes and Brendon McCullum, the Test side copied their one-day counterparts’ aggression. Now, with Key observing that the 50-over team has gone away from the style that helped make England double white-ball world champions, it is as if the wheel has turned full circle. The 29-year-old Duckett hesitates to call himself young, but admits: ‘The exciting brand that the likes of me, Zak and Popey play is exactly what England want in both formats. It will be an opportunity for some fresh faces to go and show what they can do. ‘I’ve always found I don’t have a different gameplan for Test match, 50-over and T20. In the past I’d always say you just take a few more risks in T20, whereas now I’m running at Josh Hazlewood in a Test match on day one. ‘There’s also Harry Brook, Will Jacks and Phil Salt - there are so many names. All those guys are playing a similar brand of cricket throughout the formats, which makes life a lot easier.’ Duckett does not believe that the squad for the Caribbean spells the end for England’s Class of 2019, and says the selectors were always going to look elsewhere for a trip that starts so soon after the World Cup. He says he was told he was ‘pretty close’ to selection for the tournament himself, and found it ‘tough’ to watch England lose six games out of nine. The 29-year-old has been at the heart of England’s Bazball revolution in Test cricket ‘I’m sure the lads are more gutted than anyone,’ he said. ‘It’s a side that were good enough to go and win. I’m looking at half or three-quarters of that squad, and the timing being straight after the English summer. All the lads have been playing so much cricket. ‘I felt for them flying straight off at the end of the summer, with no break, going straight to a World Cup in India. It must have been incredibly hard, and there must have been tired bodies.’ Duckett, by contrast, has had six weeks off after the end of a summer in which he opened in all five Ashes Tests and made an unbeaten 107 off 78 balls in an ODI against Ireland in Bristol. ‘I’ve had a really nice break, and I feel fresh and ready to go.’ Music, after the last few weeks, to English ears. India India Cricket Share or comment on this article: England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-13 20:37:24","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/20/77755749-0-image-a-59_1699907840349.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d24e92287afac98b7947d6c21ce5f7e5","title":"World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-morne-morkel-resigns-as-pakistan-bowling-coach-following-teams-disappointing-performance-13384862.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance","content":"Cricket World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance Morne Morkel had joined Pakistan cricket team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. Press Trust of India November 14, 2023 00:03:38 IST Morne Morkel had joined the team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. AP Lahore: Former South African pacer Morne Morkel on Monday resigned as the Pakistan cricket team’s bowling coach without completing his contract and two days after the team’s elimination from the World Cup in India. World Cup 2023: News | Schedule | Results | Points table The Babar Azam-led Pakistan lost five of the nine matches in the ODI showpiece event, losing the last match to England by 93 runs in Kolkata. Related Articles World Cup 2023: Pakistan have not been paid for five months, claims Rashid Latif World Cup 2023: What are Pakistan's semi-final chances after beating Bangladesh? Morkel had joined the team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. His first assignment with the Pakistan team was its tour of Sri Lanka for a two-Test series. “Pakistan Cricket Board will announce his replacement in due course. Pakistan’s next assignment is a three-match Test series against Australia scheduled to take place from December 14, 2023, to January 7, 2024, in Australia,” the PCB said in a statement on Monday. Former fast bowler Umar Gul is tipped to replace Morkel as he has worked before with the national team on an interim basis and has also coached the Afghanistan team. Pakistan failed to qualify for the semifinals after finishing fifth, which led to several former cricketers demanding wholesale changes in the side, including the removal of Babar Azam as skipper . Pakistan suffered losses against India, Australia, South Africa, England and a shock defeat at the hands of Afghanistan. Join our Whatsapp channel to get the latest global news updates Published on: November 14, 2023 00:03:38 IST Tags: Cricket Morne Morkel Pakistan Cricket Team World Cup 2023","pubDate":"2023-11-13 18:33:38","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Morne-Morkel-640_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"32a191663c9b006e82300e10a2d57677","title":"World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-we-have-the-right-bowlers-to-exploit-different-conditions-says-india-bowling-coach-paras-mhambrey-13384812.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey","content":"Cricket World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey “In terms of the different skills, we have the ability to (take on) whatever challenge that is ahead of us. Maybe different surfaces, we have the bowlers to do that. And we’ve done it,” India bowling coach Paras Mhambrey said. FirstCricket Staff November 13, 2023 23:41:56 IST Paras Mhambrey was all praise for Jasprit Bumrah, calling him a \"lethal\" bowler. AP India bowling coach Paras Mhambrey believes that the hosts have the right bowlers who can be effective on different conditions and surfaces. World Cup 2023: News | Schedule | Results | Points table The Indian bowlers have taken the 2023 World Cup by storm so far, with the pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj sharing 45 wickets between themselves. Apart from the pacers, Ravindra Jadeja (16 wickets) and Kuldeep Yadav (14 wickets) have also been equally impressive. Related Articles World Cup 2023: Team India reach Mumbai ahead of semi-final against New Zealand; Coaching staff inspects Wankhede pitch World Cup 2023: Hardik Pandya ruled out of tournament; Prasidh Krishna named replacement India’s impeccable bowling attack has helped the hosts remain unbeaten in the World Cup so far, having clinched nine wins in as many matches. “In terms of the different skills, we have the ability to (take on) whatever challenge that is ahead of us. Maybe different surfaces, we have the bowlers to do that. And we’ve done it,” Mhambrey told ICC following India’s 160-run win over Netherlands on Sunday. “We’re the only team who are going to play in nine different venues. So for us, it’s nine different surfaces, nine different challenges. “So, we have the right bowlers to exploit these conditions, and they’ve shown that. All of them on a given day can win a game for their country,” stated Mhambrey. Mhambrey went onto term Jasprit Bumrah as a “lethal” bowler whereas he complemented Shami’s seam bowling. “Boom (Bumrah) is a very different action. Just look at the way he’s come back to the game (from injury). The set of skills, the unique action. He completely beats you. Now, he’s got both. He gets the ball in and gets the ball out. He’s become lethal,” the coach said. “Shami is someone who has the seam (that hits) straight upright. You never know when Shami hits that seam, which way it’s going to come,” added the 51-year-old. Mhambrey also noted Siraj’s versatility, saying: “Siraj has really kind of grown in the last couple of years. He’s understood his bowling, obviously coming through the ranks. He’s started using different set of skills, the wobble seam. “Initially, he had the ball coming into right-handers but now, he shapes the ball away. He has the ability and smartness to use the wobble seam and that also worked,” continued Mhambrey. Mhambrey was all praise for Jadeja’s accuracy, whereas he feels Kuldeep Yadav has improved on his technicality. “His (Jadeja) ability is very simple. Ability to hit the deck, and hit the lengths spot on. Very accurate. Very miserly in terms of the way he goes about his bowling. Doesn’t give anything away to the batsman. “Love how Kuldeep has gone about over the last couple of years. He’s done little bit of technical adjustment to his run-up, which has really helped him to add those revs,” said Mhambrey. “His spin has gone up, speed has gone up. And, someone like a chinaman bowler who does that, doesn’t allow you to step out so easily,” he added. Although Ravichandran Ashwin has played just the lone match against Australia in Chennai, where he finished with figures of 1/34, Mhambrey feels the all-rounder offers loads of experience to the team. “Ash (Ashwin) is out and out a match-winner. Love the way he moves about, no airs about playing the game or not playing the game. “Even when he’s sitting in the dugout when you have those chats with him, he’s always there to guide these guys and comes up with a lot of suggestions,” commented the former cricketer. Join our Whatsapp channel to get the latest global news updates Published on: November 13, 2023 23:41:56 IST Tags: Cricket Paras Mhambrey Team India World Cup 2023","pubDate":"2023-11-13 18:11:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Bumrah-640_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"51bdae32ae9b819b4e146e0dd09bc2c2","title":"Jay Shah: జై షా వల్లనే శ్రీలంక క్రికెట్‌ నాశనం అయ్యింది...లంక మాజీ కెప్టెన్ అర్జున రణతుంగ సంచలన వ్యాఖ్యలు...","link":"https://telugu.latestly.com/india/news/jay-shah-sri-lankan-cricket-was-destroyed-by-jay-shah-115363.html","keywords":null,"creator":null,"video_url":null,"description":"శ్రీలంక క్రికెట్ (ఎస్‌ఎల్‌సి) నాశనం వెనుక బిసిసిఐ కార్యదర్శి జైషా కారణం అని శ్రీలంక మాజీ కెప్టెన్ అర్జున రణతుంగ విరుచుకుపడ్డాడు.","content":"శ్రీలంక క్రికెట్ (ఎస్‌ఎల్‌సి) నాశనం వెనుక బిసిసిఐ కార్యదర్శి జైషా కారణం అని శ్రీలంక మాజీ కెప్టెన్ అర్జున రణతుంగ విరుచుకుపడ్డాడు. అంతర్జాతీయ క్రికెట్ కౌన్సిల్ (ICC) అధిక రాజకీయ జోక్యానికి SLCని సస్పెండ్ చేసిన 15 రోజుల తర్వాత 1996 ప్రపంచ కప్ విజేత కెప్టెన్ చేసిన వ్యాఖ్య కావడం విశేషం. \"SLC అధికారులు జే షా మధ్య ఉన్న సంబంధం కారణంగా, వారు SLCని తొక్కిపెట్టి నియంత్రించగలరనే భావనలో ఉన్నారు\" అని రణతుంగ చెప్పినట్లు డైలీ మిర్రర్ పేర్కొంది. 'జయ్ షా శ్రీలంక క్రికెట్‌ను నడుపుతున్నాడని. జే షా ఒత్తిడి కారణంగా SLC నాశనమవుతోందన్నారు. భారత్‌లో ఓ వ్యక్తి శ్రీలంక క్రికెట్‌ను నాశనం చేస్తున్నాడు. భారత హోం మంత్రిగా ఉన్న తన తండ్రి వల్ల మాత్రమే అతను శక్తివంతమయ్యాడు, ”అని రణతుంగ ప్రధాని నరేంద్ర మోడీ మంత్రివర్గంలో సభ్యుడు అమిత్ షాను ఉద్దేశించి అన్నారు. From where does Jay Shah get money to manage Sri Lanka Cricket?? 😳 pic.twitter.com/Q6K6JblzPM — Mr. R Gandhi 🇮🇳 (@Mr_RGandhi) November 13, 2023 SLCలో అధికార పోరు మధ్యలో రణతుంగ కీలక వ్యక్తి. ఈ నెల ప్రారంభంలో, శ్రీలంక క్రీడా మంత్రి రోషన్ రణసింగ్ SLC బోర్డును తొలగించి, అర్జున రణతుంగ నేతృత్వంలో మధ్యంతర కమిటీని ఏర్పాటు చేశారు. మొత్తం బోర్డు సస్పెన్షన్‌కు ప్రధాన కారణం అవినీతి ఆరోపణలేనని రణసింగే పేర్కొన్నారు. అయితే, ఈ నిర్ణయాన్ని శ్రీలంక అప్పీల్ కోర్ట్ రద్దు చేసింది, ఇది తదుపరి విచారణ పెండింగ్‌లో ఉన్న అధికారులను పునరుద్ధరించింది. పర్యవసానంగా, గత వారం సంక్షోభ కాల్ సమయంలో 'స్వయంప్రతిపత్తితో దాని వ్యవహారాలను నిర్వహించడంలో' విఫలమైనందుకు ICC SLCని సస్పెండ్ చేసింది. భారత్‌లో జరిగిన ODI ప్రపంచ కప్‌లో శ్రీలంక జట్టు నాకౌట్‌లతో పాటు ఛాంపియన్స్ ట్రోఫీకి అర్హత సాధించలేకపోయిన దుర్భర ప్రదర్శన తర్వాత, కొనసాగుతున్న రాజకీయ గందరగోళం శ్రీలంకలో క్రికెట్ అభివృద్ధిని మరింత స్తంభింపజేస్తుందని భావిస్తున్నారు.","pubDate":"2023-11-13 17:40:04","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"d9439c06f0bd544afcc6e29335f2ffb4","title":"Cricket Legends Virender Sehwag, Diana Edulji, and Aravinda de Silva Inducted into ICC Cricket Hall of Fame","link":"https://orissadiary.com/cricket-legends-virender-sehwag-diana-edulji-and-aravinda-de-silva-inducted-into-icc-cricket-hall-of-fame/","keywords":["Sports"],"creator":["OdAdmin"],"video_url":null,"description":"Three cricketing greats and standout performers in the history of the game – legendary opener Virender Sehwag, former Indian Women Test skipper Diana Edulji and Sri Lanka’s iconic star Aravinda de Silva are the latest inductees to be added to the ICC Cricket Hall of Fame. The International Cricket Council (ICC) today announced the name […]","content":"Three cricketing greats and standout performers in the history of the game – legendary opener Virender Sehwag, former Indian Women Test skipper Diana Edulji and Sri Lanka’s iconic star Aravinda de Silva are the latest inductees to be added to the ICC Cricket Hall of Fame. The International Cricket Council (ICC) today announced the name of the three legends of cricket as the latest inductees. Sehwag, a destructive opener of the modern era, holds a record that is still hard to match, the first Indian with a two Triple centuries. The second inductee Edulji captained India for almost three decades, and as a left-arm orthodox spinner claimed 100 wickets while making 54 international appearances. Edulji took up the role of administrator with Western Railways and worked hard to create opportunities for employment for women cricketers. The third inductee was a winner of the ICC Men’s Cricket World Cup with Sri Lanka in 1996 – Aravinda de Silva. The Sri Lankan batter was known for his consistency, scoring 20 Test centuries during an 18-year international career which is the third most by any Sri Lanka men’s player. The ICC Hall of Fame honours the greatest international cricketers throughout the long history of the sport, and the enduring legacies of de Silva, Edulji and Sehwag see them join as inductees number 110, 111 and 112 respectively. As part of this year’s celebrations, the Class of 2023 will be inducted in a special on-field ceremony at the Wankhede Stadium, Mumbai during the first semi-final of the ICC Men’s Cricket World Cup 2023 on November 15.","pubDate":"2023-11-13 17:25:18","image_url":null,"source_id":"orissadiary","source_priority":2836164,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"00363e591f6298aa8d77248d0a91bb1a","title":"बेटी को गोद में लेकर सेमीफाइनल के लिए मुंबई पहुंचे रोहित शर्मा, फैन्स ने लगाये नारे, वीडियो वायरल","link":"https://hindi.oneindia.com/news/sports/cricket/world-cup-2023-rohit-sharma-reached-mumbai-with-family-video-goes-viral-846133.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma: रोहित शर्मा और टीम इंडिया मुंबई पहुँच गए हैं। मुंबई के वानखेड़े स्टेडियम में न्यूजीलैंड के खिलाफ सेमीफाइनल खेला जाएगा।","content":"भारत और न्यूजीलैंड के बीच वर्ल्ड कप सेमीफाइनल मैच बुधवार को मुंबई के वानखेड़े स्टेडियम में खेला जाना है। लीग चरण में टीम इंडिया ने अपना अंतिम मुकाबला नीदरलैंड्स के खिलाफ खेला था। नीदरलैंड्स के खिलाफ भारत ने एक बड़े अंतर से जीत दर्ज की थी। मुंबई में टीम इंडिया सोमवार को पहुँच गई। रोहित शर्मा अपने परिवार के साथ पहुंचे। बेटी के अलावा पत्नी रितिका भी उनके साथ मौजूद थीं। रोहित शर्मा अपनी बेटी को गोद में लेकर आए। फैन्स ने जैसे ही उनको देखा, उत्साह से लबरेज होकर रोहित भाई-रोहित भाई पुकारने लगे। हालंकि रोहित शर्मा कड़े सुरक्षा घेरे में थे और बिना किसी को देखे वह पुलिस की सुरक्षा में निकल गए। पीछे उनकी पत्नी रितिका सजदेह भी थीं। रोहित शर्मा, उनकी बेटी और पत्नी का एक वीडियो तेजी से इंटरनेट पर वायरल हो गया। फैन्स के भी धांसू रिएक्शन आए। कीवी टीम के खिलाफ भारतीय टीम ने साल 2019 के वर्ल्ड कप में भी सेमीफाइनल मैच खेला था। हालांकि उस मुकाबले में टीम इंडिया को निराशा हाथ लगी थी। भारतीय टीम हार के साथ टूर्नामेंट से बाहर हो गई थी। इस बार बदला लेना का बेहतरीन मौका भारत के पास आया है। Captain Rohit Sharma arrived in Mumbai for Semis 🔥💙 🎥 voompla/IG अब तक के अभियान की बात की जाए तो टीम इंडिया ने किसी भी विपक्षी दल को नहीं छोड़ा है। भारतीय टीम ने वर्ल्ड कप हिस्सा ले रही सभी 9 टीमों को पटखनी दी। भारतीय टीम ने लगातार 9 वर्ल्ड कप मैचों में जीत दर्ज करने का नया रिकॉर्ड बना दिया। इससे पहले 8 मैचों में जीत का कीर्तिमान भारत ने 2003 में बनाया था।","pubDate":"2023-11-13 16:50:14","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"11b5947fd15db00a4ab3771c6814541c","title":"Australian cricketer’s incredible six wickets in final six balls wins match","link":"https://uk.sports.yahoo.com/news/australian-cricketer-incredible-six-wickets-142654046.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-11-13 16:41:05","image_url":null,"source_id":"yahoo","source_priority":17,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"b2c9cadd43a63e30fe769e70a8ad5cc3","title":"World Cup 203 Top Stats : विराट-रोहितचा फलंदाजीत जलवा, मॅक्सवेलचीही कमाल, पाहा 10 रोचक आकडे","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-stats-records-most-run-batting-averages-strike-rate-most-wicket-highest-score-1228276","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup Stats  : भारतात सुरु असलेला विश्वचषक आता अखेरच्या टप्प्यात पोहचला आहे. तीन सामन्यानंतर आपल्याला विजेता मिळेल. साखळी सामन्यावर भारताने वर्चस्व गाजवले. त्याशिवाय ऑस्ट्रेलिया, दक्षिण आफ्रिका आणि न्यूझीलंड या संघाने उपांत्य फेरतीत स्थान पटकावले. सहा संघाचे साखळी फेरतीच आव्हान संपुष्टात आले. प्रत्येक संघाने 9-9 सामने खेळले. साखळी फेरीत दहा संघामध्ये आतापर्यंत 45 सामने झालेत. त्यानंतर अनेक रोचक आकडेवारी समोर आली आहे. यामधील टॉप 10 खास आकडेवारी पाहूयात....  1. सर्वोच्च टीम स्कोर :  यंदाच्या विश्वचषकातील सर्वोच्च धावसंख्येचा विक्रम दक्षिण आफ्रिकेच्या नावावर जमा आहे. आफ्रिकेने लंकेविरोधात पाच विकेट्सच्या मोबदल्यात 428 धावांचा डोंगर उभारला होता.    2. सर्वात मोठा विजय :यंदाच्या विश्वचषकातील सर्वात मोठ्या विजयाची नोंद ऑस्ट्रेलियाच्या नावावर आहे. कांगारुंनी दुबळ्या नेदरलँड्संचा 302 धावांनी पराभव केला. 3. सर्वाधिक धावा : यंदाच्या विश्वचषकातील सर्वाधिक धावांचा मान विराट कोहलीचा आहे. विराट कोहलीने नऊ सामन्यात पाच अर्धशतके आणि दोन शतकांच्या मदतीने  594 धावा केल्या आहेत. दुसऱ्या क्रमांकावर असणारा क्विंटन डिकॉक फक्त तीन धावांनी मागे आहे.  4. सर्वोत्कृष्ट खेळी :ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेल याने अफगाण गोलंदाजांची धुलाई केली होती. मॅक्सवेलने 128 चेंडूत नाबाद 201 धावांची खेळी केली. या खेळीच्या बळावर ऑस्ट्रेलियाने उपांत्य फेरीत प्रवेश मिळवला. 5. सर्वात बेस्ट फलंदाजीतील सरासरी : यंदाच्या विश्वचषकात सर्वात बेस्ट सरासरीचा रेकॉर्ड विराट कोहलीच्या नावावर आहे. विराट कोहलीने 99 च्या सरासरीने 594 धावा केल्या आहेत. विराट कोहली तीन वेळा नाबाद राहिलाय.  6. जबराट स्ट्राइक रेट  :यंदाच्या विश्वचषकात सर्वाधिक स्ट्राईक रेटचा रेकॉर्ड ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेलच्या नावावर आहे. मॅक्सवेलने 152.69 च्या स्ट्राईक रेटने धावा केल्या आहेत. सात सामन्यात 260 चेंडूत 397 धावा त्याने चोपल्या आहेत.  7. सर्वाधिक शतके : दक्षिण आफ्रिकेच्या क्विंटन डिकॉकच्या नावावर सर्वाधिक शतके आहेत. त्याने यंदा चार शतके ठोकली आहे. डिकॉकने नऊ डावात चार शतकाच्या मदतीने 591 धावा केल्यात. 8. सर्वाधिक षटकार :रोहित शर्मा यंदाच्या विश्वचषकात वेगळ्याच अंदाजात फलंदाजी करतो. पहिल्या चेंडूपासून रोहित आक्रमक फलंदाजी करतो. यंदाच्या विश्वचषकात सर्वाधिक षटकाराचा विक्रम रोहिच्या नावावर आहे. रोहितने नऊ सामन्यात 28 षटकार मारलेत. मॅक्सवेल 26 षटकारासह दुसऱ्या स्थानावर आहे.  9. सर्वाधिक विकेट :ऑस्ट्रेलियाचा फिरकी गोलंदाज एडम झम्पा याने यंदाच्या विश्वचषकात सर्वाधिक विकेट घेतल्या. झम्पाने नऊ सामन्यात 22 विकेट घेतल्या आहेत. मधुशंका दुसऱ्या स्थानावर आहे.   10. सर्वोत्कृष्ट गोलंदाजी: मोहम्मद शामीने लंकेविरोधात 5 षटकात फक्त 18 धावा कर्च करत पाच विकेट घेतल्यात. ही विश्वचषकातील सर्वोत्कृष्ट गोलंदाजी आहे.  ","content":"World Cup Stats : भारतात सुरु असलेला विश्वचषक आता अखेरच्या टप्प्यात पोहचला आहे. तीन सामन्यानंतर आपल्याला विजेता मिळेल. साखळी सामन्यावर भारताने वर्चस्व गाजवले. त्याशिवाय ऑस्ट्रेलिया, दक्षिण आफ्रिका आणि न्यूझीलंड या संघाने उपांत्य फेरतीत स्थान पटकावले. सहा संघाचे साखळी फेरतीच आव्हान संपुष्टात आले. प्रत्येक संघाने 9-9 सामने खेळले. साखळी फेरीत दहा संघामध्ये आतापर्यंत 45 सामने झालेत. त्यानंतर अनेक रोचक आकडेवारी समोर आली आहे. यामधील टॉप 10 खास आकडेवारी पाहूयात.... 1. सर्वोच्च टीम स्कोर : यंदाच्या विश्वचषकातील सर्वोच्च धावसंख्येचा विक्रम दक्षिण आफ्रिकेच्या नावावर जमा आहे. आफ्रिकेने लंकेविरोधात पाच विकेट्सच्या मोबदल्यात 428 धावांचा डोंगर उभारला होता. 2. सर्वात मोठा विजय : यंदाच्या विश्वचषकातील सर्वात मोठ्या विजयाची नोंद ऑस्ट्रेलियाच्या नावावर आहे. कांगारुंनी दुबळ्या नेदरलँड्संचा 302 धावांनी पराभव केला. 3. सर्वाधिक धावा : यंदाच्या विश्वचषकातील सर्वाधिक धावांचा मान विराट कोहलीचा आहे. विराट कोहलीने नऊ सामन्यात पाच अर्धशतके आणि दोन शतकांच्या मदतीने 594 धावा केल्या आहेत. दुसऱ्या क्रमांकावर असणारा क्विंटन डिकॉक फक्त तीन धावांनी मागे आहे. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); 4. सर्वोत्कृष्ट खेळी : ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेल याने अफगाण गोलंदाजांची धुलाई केली होती. मॅक्सवेलने 128 चेंडूत नाबाद 201 धावांची खेळी केली. या खेळीच्या बळावर ऑस्ट्रेलियाने उपांत्य फेरीत प्रवेश मिळवला. 5. सर्वात बेस्ट फलंदाजीतील सरासरी : यंदाच्या विश्वचषकात सर्वात बेस्ट सरासरीचा रेकॉर्ड विराट कोहलीच्या नावावर आहे. विराट कोहलीने 99 च्या सरासरीने 594 धावा केल्या आहेत. विराट कोहली तीन वेळा नाबाद राहिलाय. 6. जबराट स्ट्राइक रेट : यंदाच्या विश्वचषकात सर्वाधिक स्ट्राईक रेटचा रेकॉर्ड ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेलच्या नावावर आहे. मॅक्सवेलने 152.69 च्या स्ट्राईक रेटने धावा केल्या आहेत. सात सामन्यात 260 चेंडूत 397 धावा त्याने चोपल्या आहेत. 7. सर्वाधिक शतके : दक्षिण आफ्रिकेच्या क्विंटन डिकॉकच्या नावावर सर्वाधिक शतके आहेत. त्याने यंदा चार शतके ठोकली आहे. डिकॉकने नऊ डावात चार शतकाच्या मदतीने 591 धावा केल्यात. 8. सर्वाधिक षटकार : रोहित शर्मा यंदाच्या विश्वचषकात वेगळ्याच अंदाजात फलंदाजी करतो. पहिल्या चेंडूपासून रोहित आक्रमक फलंदाजी करतो. यंदाच्या विश्वचषकात सर्वाधिक षटकाराचा विक्रम रोहिच्या नावावर आहे. रोहितने नऊ सामन्यात 28 षटकार मारलेत. मॅक्सवेल 26 षटकारासह दुसऱ्या स्थानावर आहे. 9. सर्वाधिक विकेट : ऑस्ट्रेलियाचा फिरकी गोलंदाज एडम झम्पा याने यंदाच्या विश्वचषकात सर्वाधिक विकेट घेतल्या. झम्पाने नऊ सामन्यात 22 विकेट घेतल्या आहेत. मधुशंका दुसऱ्या स्थानावर आहे. 10. सर्वोत्कृष्ट गोलंदाजी: मोहम्मद शामीने लंकेविरोधात 5 षटकात फक्त 18 धावा कर्च करत पाच विकेट घेतल्यात. ही विश्वचषकातील सर्वोत्कृष्ट गोलंदाजी आहे.","pubDate":"2023-11-13 16:32:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/13/1c5717b10b7898c4147346679a52bc2f1699893115180265_original.jpeg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"aa2a141ff700f69eeefd1b107b3fbc9c","title":"सौरव गांगुली ने डिटेल से बताई वजह, क्यों वर्ल्ड कप में पाकिस्तान के अभियान की हवा निकल गई","link":"https://sports.ndtv.com/hindi/cricket/sourav-ganguly-reveals-the-reason-why-pakistan-had-had-so-poor-campaing-in-world-cup-2023-4571540#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"पाकिस्तान से World Cup 2023 के सेमीफाइनल में पहुंचने में नाकाम रहने के बाद से ही दिग्गजों के बयानों का लगातार आना जारी है..और अब गांगुली ने इस पर विस्तार से रोशनी डाली है","content":"जारी World Cup 2023 के सेमीफाइनल में पहुंचने में नाकाम रहने और मेगा इवेंट में भारत और अफगानिस्तान के हाथों पिटने के बाद पाकिस्तान क्रिकेट में आया भूचाल थमा नहीं है. अब जबकि कुछ ही दिनों में कप्तान बाबर आजम (Babar Azam) PCB अध्यक्ष से मिलने जा रहे हैं, तो जाहिर है कि यह तूफान एक अलग ही मोड़ ले सकता है. इसी बीच पाकिस्तान टीम के प्रदर्शन को लेकर लगातार बयानों का आना जारी है. और अब भारतीय पूर्व कप्तान सौरव गांगुली (Sourav Ganguly) ने भी पड़ोसी देश के खराब प्रदर्शन पर मुंह खोला है. यह भी पढ़ें: World Cup 2023: केएल राहुल ने 62 गेंद पर शतक जमाकर रचा इतिहास, तोड़ दिया रोहित शर्मा का रिकॉर्ड गांगुली ने एक पाकिस्तानी चैनल से बातचीत में कहा यह खिलाड़ियों का दीर्घकालिक फॉर्मेट पर टी20 को तरजीह देने का असर है और इसमें संतुलन बनाने की जरुरत है. भारत और पाकिस्तान के अभियान की तुलना करते हुए सौरव ने इस बात को सिरे से खारिज कर दिया कि भारत की सफलता के पीछे एकमात्र कारण आईपीएल है. उन्होंने कहा कि अंतरराष्ट्रीय क्रिकेट में भारत की सफलता का एकमात्र कारण आईपीएल नहीं है. गुणवत्ता केवल आईपीएल खेलने से नहीं आ सकती. यह चार या पांच दिनी क्रिकेट खेलने से आती है. अगर आप ज्यादा टी20 क्रिकेट खेलोगे, तो आप एकदम साधारण बनकर रह जाओगे. पूर्व कप्तान ने कहा कि मैं हमेशा कहता हूं कि आप टी20 खेलें और पैसा बनाएं, लेकिन अगर आप खिलाड़ी बनना चाहते हैं, तो आपको चार या पांच दिनी क्रिकेट खेलनी होगी. उन्होंने कहा कि भारत की सफलता के लिए पूरी तरह से आईपीएल को श्रेय नहीं दिया जा सकता. इसका श्रेय हमारे मजबूत घरेलू ढांचे और प्रतिभाशाली खिलाड़ियों के पूल को दिया जाना चाहिए. गांगुली ने खिलाड़ियों के विकास के लिए चार या पांच दिनी क्रिकेट को खेलने के महत्व पर रोशनी डाली. सौरव ने कहा कि खिलाड़ियों को वसीम अकरम की तरह होना चाहिए, जो हर दिन 20-30 ओवर गेंदबाजी किया करते थे. वह पुरानी गेंद के साथ भी उतने ही तेज होते थे, जितने नई गेंद के साथ. मैं सोचता हूं कि केवल आईपीएल ही नहीं, बल्कि पूरा भारतीय क्रिकेट ढांचा बहुत ही अविश्वसनीय है. यहां बहुत ज्यााद मैचों का आयोजन होता है, बहुत ज्यादा खिलाड़ी हैं और इस लिहाज से हम भाग्यशाली हैं.  ","pubDate":"2023-11-13 16:26:42","image_url":"https://c.ndtvimg.com/2023-11/v0r35r98_sourav-ganguly_625x300_13_November_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c0a7a51453500cbf5b30e79d69454111","title":"\"सहवाग ने सिखाया कि टेस्ट क्रिकेट कैसे खेली जाती है\", ICC ने दिया यह बड़ा सम्मान, तो फैंस ने दिए कुछ ऐसे कमेंट","link":"https://sports.ndtv.com/hindi/cricket/sehwag-taught-how-test-cricket-is-played-fans-reacted-as-icc-gives-such-a-big-honor-to-virender-sehwag-4571220#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"जो काम ICC को कई साल कर लेना चाहिए था, उसे अब पैतृक संस्था ने दुरुस्त कर लिया. और वीरू भारत के बहुत ही चुनिंदा खिलाड़ियों में शामिल हो गए","content":"देर आए, दुरुस्त आए! जो काम कई साल पहले हो जाना चाहिए था, वह अंतरराष्ट्रीय क्रिकेट काउंसिल ने आखिर कर ही दिया. ICC ने भारतीय दिग्गज बल्लेबाज वीरेंद्र सहवाग (Virender Sehwag) को साल 2023 के लिए \"हॉल ऑफ फेम\" में जगह दी है. सहवाग अब भारत के उन चुनिंदा क्रिकेटरों में शामि हो गए हैं, जिन्हें इस सूची में जगह मिली है. ICC ने कुछ साल पहले ही \"हॉल ऑफ फेम\" की शुरुआत की थी. सहवाग के क्रिकेट इतिहास के सर्वकालिक सबसे आतिशी बल्लेबाजों में से एक गिना जाता है. सहवाग ने टेस्ट क्रिकेट में साल 2000 में आक्रामक शैली की शुरुआत की थी. तब सहवाग का स्ट्रा. रेट अपने समय के बाकी बल्लेबाजों से खासा आगे होता था और उन्होंने नियमित अंतराल पर इसे अंजाम दिया.Sehwag career at a glance104 Tests – 8,586 runs at an average of 49.34, 40 wickets251 ODIs – 8,273 runs at an average of 35.05, 96 wickets19 T20Is – 394 runs at an average of 21.88— Anuj Mishra (@anujmishra003) November 13, 2023वीरू ने अपने अंदाज से भारत को कई मैच जिताए. और वह बस कुछ ही रन से टेस्ट क्रिकेट में तीसरा तिहरा शतक जड़ने से चूक गए थे. सहवाग ने खेले 104 टेस्ट मैचों में 49.34 के औसत से 8586 रन बनाए. और उन्हें गावस्कर के बाद भारत का दूसरा सर्वकालिक सर्वश्रेष्ठ ओपनर कहा जाता है. बहरहाल, सहवाग की जैसे ही हॉल ऑफ फेम की खबर आई, तो उनके चाहने वालों ने वीरू की तारीफ में एक से बढ़कर एक प्रतिक्रिया दी. देखिए कि कैसे कमेंट कर रहे हैं वीरू के चाहने वालेVirender Sehwag ❤ play like bolwer be like: bhai kitna marega yaar ab to maf kar de— Aryan Pandey (@AryanPa66861306) November 13, 2023बात एकदम पूरी तरह सही हैOne of the most destructive opener in history of cricket #VirenderSehwag pic.twitter.com/4XZv14Hhk5— CricWiz (@CricWizTalks) November 13, 2023टेस्ट क्रिकेट खेलना वीरू ने सिखायाOne of the legend in Indian cricket.....test me kaise khelte hai Viru bhai ne shikhaya...— Hriday Singh (@hridaysingh16) November 13, 2023इसमें भी कोई दो राय नहीं हैHe used to take the game away within 10 overs— Dom (@diligent_three) November 13, 2023","pubDate":"2023-11-13 16:25:17","image_url":"https://c.ndtvimg.com/2023-06/f6mqt16o_virender-sehwag-prediction-_120x90_27_June_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"46fcb450e7483e4b9e87c77336cd7b96","title":"England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup","link":"https://www.dailymail.co.uk/sport/cricket/article-12744725/England-batter-Ben-Duckett-seize-big-chance-impress-Caribbean-watching-tired-team-mates-struggle-World-Cup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE INTERVIEW BY LAWRENCE BOOTH: Duckett, who has been at the heart of England's Bazball revolution in Test cricket, intends to show what he can do in 50-over cricket.","content":"England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup A new-look England will face the West Indies in three ODIs next month Ben Duckett hopes to add to the eight one-day caps he has won in seven years The 29-year-old has been at the heart of the Bazball revolution in Test cricket By Lawrence Booth for the Daily Mail Published: 20:01, 13 November 2023 | Updated: 20:37, 13 November 2023 e-mail View comments A refreshed Ben Duckett wants to take the Caribbean by storm next month after watching his ‘tired’ team-mates struggle at the World Cup in India . Duckett, who has been at the heart of England’s Bazball revolution in Test cricket, intends to show what he can do in 50-over cricket when a new four-year World Cup cycle begins with the first of three ODIs against West Indies in Antigua on December 3. And he believes the simplicity of his approach, which essentially remains unaltered whatever the format, will stand him in good stead as he looks to add to the eight one-day caps he has won since his debut in Bangladesh seven years ago. ‘I’ve been a part of the best generation of England white-ball cricket and it’s been near to impossible to break into the team,’ he told Mail Sport. ‘Now there’s an opportunity to go and get my place.’ Managing director Rob Key said on Sunday he felt England’s one-day team had not been helped by comparisons with the aggressive Bazballers. And with many of the 30-somethings who have fallen so short in India being omitted from the trip to the Caribbean, a new-look one-day side will include the Test-match top three of Duckett, Zak Crawley and Ollie Pope. England batter Ben Duckett wants to take the Caribbean by storm next month Once, England used the one-day team as the route into Test cricket. Then, under Ben Stokes and Brendon McCullum, the Test side copied their one-day counterparts’ aggression. Now, with Key observing that the 50-over team has gone away from the style that helped make England double white-ball world champions, it is as if the wheel has turned full circle. The 29-year-old Duckett hesitates to call himself young, but admits: ‘The exciting brand that the likes of me, Zak and Popey play is exactly what England want in both formats. It will be an opportunity for some fresh faces to go and show what they can do. ‘I’ve always found I don’t have a different gameplan for Test match, 50-over and T20. In the past I’d always say you just take a few more risks in T20, whereas now I’m running at Josh Hazlewood in a Test match on day one. ‘There’s also Harry Brook, Will Jacks and Phil Salt - there are so many names. All those guys are playing a similar brand of cricket throughout the formats, which makes life a lot easier.’ Duckett does not believe that the squad for the Caribbean spells the end for England’s Class of 2019, and says the selectors were always going to look elsewhere for a trip that starts so soon after the World Cup. He says he was told he was ‘pretty close’ to selection for the tournament himself, and found it ‘tough’ to watch England lose six games out of nine. The 29-year-old has been at the heart of England’s Bazball revolution in Test cricket ‘I’m sure the lads are more gutted than anyone,’ he said. ‘It’s a side that were good enough to go and win. I’m looking at half or three-quarters of that squad, and the timing being straight after the English summer. All the lads have been playing so much cricket. ‘I felt for them flying straight off at the end of the summer, with no break, going straight to a World Cup in India. It must have been incredibly hard, and there must have been tired bodies.’ Duckett, by contrast, has had six weeks off after the end of a summer in which he opened in all five Ashes Tests and made an unbeaten 107 off 78 balls in an ODI against Ireland in Bristol. ‘I’ve had a really nice break, and I feel fresh and ready to go.’ Music, after the last few weeks, to English ears. India India Cricket Share or comment on this article: England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-13 20:37:24","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/20/77755749-0-image-a-59_1699907840349.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d24e92287afac98b7947d6c21ce5f7e5","title":"World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-morne-morkel-resigns-as-pakistan-bowling-coach-following-teams-disappointing-performance-13384862.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance","content":"Cricket World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance Morne Morkel had joined Pakistan cricket team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. Press Trust of India November 14, 2023 00:03:38 IST Morne Morkel had joined the team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. AP Lahore: Former South African pacer Morne Morkel on Monday resigned as the Pakistan cricket team’s bowling coach without completing his contract and two days after the team’s elimination from the World Cup in India. World Cup 2023: News | Schedule | Results | Points table The Babar Azam-led Pakistan lost five of the nine matches in the ODI showpiece event, losing the last match to England by 93 runs in Kolkata. Related Articles World Cup 2023: Pakistan have not been paid for five months, claims Rashid Latif World Cup 2023: What are Pakistan's semi-final chances after beating Bangladesh? Morkel had joined the team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. His first assignment with the Pakistan team was its tour of Sri Lanka for a two-Test series. “Pakistan Cricket Board will announce his replacement in due course. Pakistan’s next assignment is a three-match Test series against Australia scheduled to take place from December 14, 2023, to January 7, 2024, in Australia,” the PCB said in a statement on Monday. Former fast bowler Umar Gul is tipped to replace Morkel as he has worked before with the national team on an interim basis and has also coached the Afghanistan team. Pakistan failed to qualify for the semifinals after finishing fifth, which led to several former cricketers demanding wholesale changes in the side, including the removal of Babar Azam as skipper . Pakistan suffered losses against India, Australia, South Africa, England and a shock defeat at the hands of Afghanistan. Join our Whatsapp channel to get the latest global news updates Published on: November 14, 2023 00:03:38 IST Tags: Cricket Morne Morkel Pakistan Cricket Team World Cup 2023","pubDate":"2023-11-13 18:33:38","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Morne-Morkel-640_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"32a191663c9b006e82300e10a2d57677","title":"World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-we-have-the-right-bowlers-to-exploit-different-conditions-says-india-bowling-coach-paras-mhambrey-13384812.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey","content":"Cricket World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey “In terms of the different skills, we have the ability to (take on) whatever challenge that is ahead of us. Maybe different surfaces, we have the bowlers to do that. And we’ve done it,” India bowling coach Paras Mhambrey said. FirstCricket Staff November 13, 2023 23:41:56 IST Paras Mhambrey was all praise for Jasprit Bumrah, calling him a \"lethal\" bowler. AP India bowling coach Paras Mhambrey believes that the hosts have the right bowlers who can be effective on different conditions and surfaces. World Cup 2023: News | Schedule | Results | Points table The Indian bowlers have taken the 2023 World Cup by storm so far, with the pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj sharing 45 wickets between themselves. Apart from the pacers, Ravindra Jadeja (16 wickets) and Kuldeep Yadav (14 wickets) have also been equally impressive. Related Articles World Cup 2023: Team India reach Mumbai ahead of semi-final against New Zealand; Coaching staff inspects Wankhede pitch World Cup 2023: Hardik Pandya ruled out of tournament; Prasidh Krishna named replacement India’s impeccable bowling attack has helped the hosts remain unbeaten in the World Cup so far, having clinched nine wins in as many matches. “In terms of the different skills, we have the ability to (take on) whatever challenge that is ahead of us. Maybe different surfaces, we have the bowlers to do that. And we’ve done it,” Mhambrey told ICC following India’s 160-run win over Netherlands on Sunday. “We’re the only team who are going to play in nine different venues. So for us, it’s nine different surfaces, nine different challenges. “So, we have the right bowlers to exploit these conditions, and they’ve shown that. All of them on a given day can win a game for their country,” stated Mhambrey. Mhambrey went onto term Jasprit Bumrah as a “lethal” bowler whereas he complemented Shami’s seam bowling. “Boom (Bumrah) is a very different action. Just look at the way he’s come back to the game (from injury). The set of skills, the unique action. He completely beats you. Now, he’s got both. He gets the ball in and gets the ball out. He’s become lethal,” the coach said. “Shami is someone who has the seam (that hits) straight upright. You never know when Shami hits that seam, which way it’s going to come,” added the 51-year-old. Mhambrey also noted Siraj’s versatility, saying: “Siraj has really kind of grown in the last couple of years. He’s understood his bowling, obviously coming through the ranks. He’s started using different set of skills, the wobble seam. “Initially, he had the ball coming into right-handers but now, he shapes the ball away. He has the ability and smartness to use the wobble seam and that also worked,” continued Mhambrey. Mhambrey was all praise for Jadeja’s accuracy, whereas he feels Kuldeep Yadav has improved on his technicality. “His (Jadeja) ability is very simple. Ability to hit the deck, and hit the lengths spot on. Very accurate. Very miserly in terms of the way he goes about his bowling. Doesn’t give anything away to the batsman. “Love how Kuldeep has gone about over the last couple of years. He’s done little bit of technical adjustment to his run-up, which has really helped him to add those revs,” said Mhambrey. “His spin has gone up, speed has gone up. And, someone like a chinaman bowler who does that, doesn’t allow you to step out so easily,” he added. Although Ravichandran Ashwin has played just the lone match against Australia in Chennai, where he finished with figures of 1/34, Mhambrey feels the all-rounder offers loads of experience to the team. “Ash (Ashwin) is out and out a match-winner. Love the way he moves about, no airs about playing the game or not playing the game. “Even when he’s sitting in the dugout when you have those chats with him, he’s always there to guide these guys and comes up with a lot of suggestions,” commented the former cricketer. Join our Whatsapp channel to get the latest global news updates Published on: November 13, 2023 23:41:56 IST Tags: Cricket Paras Mhambrey Team India World Cup 2023","pubDate":"2023-11-13 18:11:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Bumrah-640_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"51bdae32ae9b819b4e146e0dd09bc2c2","title":"Jay Shah: జై షా వల్లనే శ్రీలంక క్రికెట్‌ నాశనం అయ్యింది...లంక మాజీ కెప్టెన్ అర్జున రణతుంగ సంచలన వ్యాఖ్యలు...","link":"https://telugu.latestly.com/india/news/jay-shah-sri-lankan-cricket-was-destroyed-by-jay-shah-115363.html","keywords":null,"creator":null,"video_url":null,"description":"శ్రీలంక క్రికెట్ (ఎస్‌ఎల్‌సి) నాశనం వెనుక బిసిసిఐ కార్యదర్శి జైషా కారణం అని శ్రీలంక మాజీ కెప్టెన్ అర్జున రణతుంగ విరుచుకుపడ్డాడు.","content":"శ్రీలంక క్రికెట్ (ఎస్‌ఎల్‌సి) నాశనం వెనుక బిసిసిఐ కార్యదర్శి జైషా కారణం అని శ్రీలంక మాజీ కెప్టెన్ అర్జున రణతుంగ విరుచుకుపడ్డాడు. అంతర్జాతీయ క్రికెట్ కౌన్సిల్ (ICC) అధిక రాజకీయ జోక్యానికి SLCని సస్పెండ్ చేసిన 15 రోజుల తర్వాత 1996 ప్రపంచ కప్ విజేత కెప్టెన్ చేసిన వ్యాఖ్య కావడం విశేషం. \"SLC అధికారులు జే షా మధ్య ఉన్న సంబంధం కారణంగా, వారు SLCని తొక్కిపెట్టి నియంత్రించగలరనే భావనలో ఉన్నారు\" అని రణతుంగ చెప్పినట్లు డైలీ మిర్రర్ పేర్కొంది. 'జయ్ షా శ్రీలంక క్రికెట్‌ను నడుపుతున్నాడని. జే షా ఒత్తిడి కారణంగా SLC నాశనమవుతోందన్నారు. భారత్‌లో ఓ వ్యక్తి శ్రీలంక క్రికెట్‌ను నాశనం చేస్తున్నాడు. భారత హోం మంత్రిగా ఉన్న తన తండ్రి వల్ల మాత్రమే అతను శక్తివంతమయ్యాడు, ”అని రణతుంగ ప్రధాని నరేంద్ర మోడీ మంత్రివర్గంలో సభ్యుడు అమిత్ షాను ఉద్దేశించి అన్నారు. From where does Jay Shah get money to manage Sri Lanka Cricket?? 😳 pic.twitter.com/Q6K6JblzPM — Mr. R Gandhi 🇮🇳 (@Mr_RGandhi) November 13, 2023 SLCలో అధికార పోరు మధ్యలో రణతుంగ కీలక వ్యక్తి. ఈ నెల ప్రారంభంలో, శ్రీలంక క్రీడా మంత్రి రోషన్ రణసింగ్ SLC బోర్డును తొలగించి, అర్జున రణతుంగ నేతృత్వంలో మధ్యంతర కమిటీని ఏర్పాటు చేశారు. మొత్తం బోర్డు సస్పెన్షన్‌కు ప్రధాన కారణం అవినీతి ఆరోపణలేనని రణసింగే పేర్కొన్నారు. అయితే, ఈ నిర్ణయాన్ని శ్రీలంక అప్పీల్ కోర్ట్ రద్దు చేసింది, ఇది తదుపరి విచారణ పెండింగ్‌లో ఉన్న అధికారులను పునరుద్ధరించింది. పర్యవసానంగా, గత వారం సంక్షోభ కాల్ సమయంలో 'స్వయంప్రతిపత్తితో దాని వ్యవహారాలను నిర్వహించడంలో' విఫలమైనందుకు ICC SLCని సస్పెండ్ చేసింది. భారత్‌లో జరిగిన ODI ప్రపంచ కప్‌లో శ్రీలంక జట్టు నాకౌట్‌లతో పాటు ఛాంపియన్స్ ట్రోఫీకి అర్హత సాధించలేకపోయిన దుర్భర ప్రదర్శన తర్వాత, కొనసాగుతున్న రాజకీయ గందరగోళం శ్రీలంకలో క్రికెట్ అభివృద్ధిని మరింత స్తంభింపజేస్తుందని భావిస్తున్నారు.","pubDate":"2023-11-13 17:40:04","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"d9439c06f0bd544afcc6e29335f2ffb4","title":"Cricket Legends Virender Sehwag, Diana Edulji, and Aravinda de Silva Inducted into ICC Cricket Hall of Fame","link":"https://orissadiary.com/cricket-legends-virender-sehwag-diana-edulji-and-aravinda-de-silva-inducted-into-icc-cricket-hall-of-fame/","keywords":["Sports"],"creator":["OdAdmin"],"video_url":null,"description":"Three cricketing greats and standout performers in the history of the game – legendary opener Virender Sehwag, former Indian Women Test skipper Diana Edulji and Sri Lanka’s iconic star Aravinda de Silva are the latest inductees to be added to the ICC Cricket Hall of Fame. The International Cricket Council (ICC) today announced the name […]","content":"Three cricketing greats and standout performers in the history of the game – legendary opener Virender Sehwag, former Indian Women Test skipper Diana Edulji and Sri Lanka’s iconic star Aravinda de Silva are the latest inductees to be added to the ICC Cricket Hall of Fame. The International Cricket Council (ICC) today announced the name of the three legends of cricket as the latest inductees. Sehwag, a destructive opener of the modern era, holds a record that is still hard to match, the first Indian with a two Triple centuries. The second inductee Edulji captained India for almost three decades, and as a left-arm orthodox spinner claimed 100 wickets while making 54 international appearances. Edulji took up the role of administrator with Western Railways and worked hard to create opportunities for employment for women cricketers. The third inductee was a winner of the ICC Men’s Cricket World Cup with Sri Lanka in 1996 – Aravinda de Silva. The Sri Lankan batter was known for his consistency, scoring 20 Test centuries during an 18-year international career which is the third most by any Sri Lanka men’s player. The ICC Hall of Fame honours the greatest international cricketers throughout the long history of the sport, and the enduring legacies of de Silva, Edulji and Sehwag see them join as inductees number 110, 111 and 112 respectively. As part of this year’s celebrations, the Class of 2023 will be inducted in a special on-field ceremony at the Wankhede Stadium, Mumbai during the first semi-final of the ICC Men’s Cricket World Cup 2023 on November 15.","pubDate":"2023-11-13 17:25:18","image_url":null,"source_id":"orissadiary","source_priority":2836164,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"00363e591f6298aa8d77248d0a91bb1a","title":"बेटी को गोद में लेकर सेमीफाइनल के लिए मुंबई पहुंचे रोहित शर्मा, फैन्स ने लगाये नारे, वीडियो वायरल","link":"https://hindi.oneindia.com/news/sports/cricket/world-cup-2023-rohit-sharma-reached-mumbai-with-family-video-goes-viral-846133.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma: रोहित शर्मा और टीम इंडिया मुंबई पहुँच गए हैं। मुंबई के वानखेड़े स्टेडियम में न्यूजीलैंड के खिलाफ सेमीफाइनल खेला जाएगा।","content":"भारत और न्यूजीलैंड के बीच वर्ल्ड कप सेमीफाइनल मैच बुधवार को मुंबई के वानखेड़े स्टेडियम में खेला जाना है। लीग चरण में टीम इंडिया ने अपना अंतिम मुकाबला नीदरलैंड्स के खिलाफ खेला था। नीदरलैंड्स के खिलाफ भारत ने एक बड़े अंतर से जीत दर्ज की थी। मुंबई में टीम इंडिया सोमवार को पहुँच गई। रोहित शर्मा अपने परिवार के साथ पहुंचे। बेटी के अलावा पत्नी रितिका भी उनके साथ मौजूद थीं। रोहित शर्मा अपनी बेटी को गोद में लेकर आए। फैन्स ने जैसे ही उनको देखा, उत्साह से लबरेज होकर रोहित भाई-रोहित भाई पुकारने लगे। हालंकि रोहित शर्मा कड़े सुरक्षा घेरे में थे और बिना किसी को देखे वह पुलिस की सुरक्षा में निकल गए। पीछे उनकी पत्नी रितिका सजदेह भी थीं। रोहित शर्मा, उनकी बेटी और पत्नी का एक वीडियो तेजी से इंटरनेट पर वायरल हो गया। फैन्स के भी धांसू रिएक्शन आए। कीवी टीम के खिलाफ भारतीय टीम ने साल 2019 के वर्ल्ड कप में भी सेमीफाइनल मैच खेला था। हालांकि उस मुकाबले में टीम इंडिया को निराशा हाथ लगी थी। भारतीय टीम हार के साथ टूर्नामेंट से बाहर हो गई थी। इस बार बदला लेना का बेहतरीन मौका भारत के पास आया है। Captain Rohit Sharma arrived in Mumbai for Semis 🔥💙 🎥 voompla/IG अब तक के अभियान की बात की जाए तो टीम इंडिया ने किसी भी विपक्षी दल को नहीं छोड़ा है। भारतीय टीम ने वर्ल्ड कप हिस्सा ले रही सभी 9 टीमों को पटखनी दी। भारतीय टीम ने लगातार 9 वर्ल्ड कप मैचों में जीत दर्ज करने का नया रिकॉर्ड बना दिया। इससे पहले 8 मैचों में जीत का कीर्तिमान भारत ने 2003 में बनाया था।","pubDate":"2023-11-13 16:50:14","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"11b5947fd15db00a4ab3771c6814541c","title":"Australian cricketer’s incredible six wickets in final six balls wins match","link":"https://uk.sports.yahoo.com/news/australian-cricketer-incredible-six-wickets-142654046.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-11-13 16:41:05","image_url":null,"source_id":"yahoo","source_priority":17,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"b2c9cadd43a63e30fe769e70a8ad5cc3","title":"World Cup 203 Top Stats : विराट-रोहितचा फलंदाजीत जलवा, मॅक्सवेलचीही कमाल, पाहा 10 रोचक आकडे","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-stats-records-most-run-batting-averages-strike-rate-most-wicket-highest-score-1228276","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup Stats  : भारतात सुरु असलेला विश्वचषक आता अखेरच्या टप्प्यात पोहचला आहे. तीन सामन्यानंतर आपल्याला विजेता मिळेल. साखळी सामन्यावर भारताने वर्चस्व गाजवले. त्याशिवाय ऑस्ट्रेलिया, दक्षिण आफ्रिका आणि न्यूझीलंड या संघाने उपांत्य फेरतीत स्थान पटकावले. सहा संघाचे साखळी फेरतीच आव्हान संपुष्टात आले. प्रत्येक संघाने 9-9 सामने खेळले. साखळी फेरीत दहा संघामध्ये आतापर्यंत 45 सामने झालेत. त्यानंतर अनेक रोचक आकडेवारी समोर आली आहे. यामधील टॉप 10 खास आकडेवारी पाहूयात....  1. सर्वोच्च टीम स्कोर :  यंदाच्या विश्वचषकातील सर्वोच्च धावसंख्येचा विक्रम दक्षिण आफ्रिकेच्या नावावर जमा आहे. आफ्रिकेने लंकेविरोधात पाच विकेट्सच्या मोबदल्यात 428 धावांचा डोंगर उभारला होता.    2. सर्वात मोठा विजय :यंदाच्या विश्वचषकातील सर्वात मोठ्या विजयाची नोंद ऑस्ट्रेलियाच्या नावावर आहे. कांगारुंनी दुबळ्या नेदरलँड्संचा 302 धावांनी पराभव केला. 3. सर्वाधिक धावा : यंदाच्या विश्वचषकातील सर्वाधिक धावांचा मान विराट कोहलीचा आहे. विराट कोहलीने नऊ सामन्यात पाच अर्धशतके आणि दोन शतकांच्या मदतीने  594 धावा केल्या आहेत. दुसऱ्या क्रमांकावर असणारा क्विंटन डिकॉक फक्त तीन धावांनी मागे आहे.  4. सर्वोत्कृष्ट खेळी :ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेल याने अफगाण गोलंदाजांची धुलाई केली होती. मॅक्सवेलने 128 चेंडूत नाबाद 201 धावांची खेळी केली. या खेळीच्या बळावर ऑस्ट्रेलियाने उपांत्य फेरीत प्रवेश मिळवला. 5. सर्वात बेस्ट फलंदाजीतील सरासरी : यंदाच्या विश्वचषकात सर्वात बेस्ट सरासरीचा रेकॉर्ड विराट कोहलीच्या नावावर आहे. विराट कोहलीने 99 च्या सरासरीने 594 धावा केल्या आहेत. विराट कोहली तीन वेळा नाबाद राहिलाय.  6. जबराट स्ट्राइक रेट  :यंदाच्या विश्वचषकात सर्वाधिक स्ट्राईक रेटचा रेकॉर्ड ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेलच्या नावावर आहे. मॅक्सवेलने 152.69 च्या स्ट्राईक रेटने धावा केल्या आहेत. सात सामन्यात 260 चेंडूत 397 धावा त्याने चोपल्या आहेत.  7. सर्वाधिक शतके : दक्षिण आफ्रिकेच्या क्विंटन डिकॉकच्या नावावर सर्वाधिक शतके आहेत. त्याने यंदा चार शतके ठोकली आहे. डिकॉकने नऊ डावात चार शतकाच्या मदतीने 591 धावा केल्यात. 8. सर्वाधिक षटकार :रोहित शर्मा यंदाच्या विश्वचषकात वेगळ्याच अंदाजात फलंदाजी करतो. पहिल्या चेंडूपासून रोहित आक्रमक फलंदाजी करतो. यंदाच्या विश्वचषकात सर्वाधिक षटकाराचा विक्रम रोहिच्या नावावर आहे. रोहितने नऊ सामन्यात 28 षटकार मारलेत. मॅक्सवेल 26 षटकारासह दुसऱ्या स्थानावर आहे.  9. सर्वाधिक विकेट :ऑस्ट्रेलियाचा फिरकी गोलंदाज एडम झम्पा याने यंदाच्या विश्वचषकात सर्वाधिक विकेट घेतल्या. झम्पाने नऊ सामन्यात 22 विकेट घेतल्या आहेत. मधुशंका दुसऱ्या स्थानावर आहे.   10. सर्वोत्कृष्ट गोलंदाजी: मोहम्मद शामीने लंकेविरोधात 5 षटकात फक्त 18 धावा कर्च करत पाच विकेट घेतल्यात. ही विश्वचषकातील सर्वोत्कृष्ट गोलंदाजी आहे.  ","content":"World Cup Stats : भारतात सुरु असलेला विश्वचषक आता अखेरच्या टप्प्यात पोहचला आहे. तीन सामन्यानंतर आपल्याला विजेता मिळेल. साखळी सामन्यावर भारताने वर्चस्व गाजवले. त्याशिवाय ऑस्ट्रेलिया, दक्षिण आफ्रिका आणि न्यूझीलंड या संघाने उपांत्य फेरतीत स्थान पटकावले. सहा संघाचे साखळी फेरतीच आव्हान संपुष्टात आले. प्रत्येक संघाने 9-9 सामने खेळले. साखळी फेरीत दहा संघामध्ये आतापर्यंत 45 सामने झालेत. त्यानंतर अनेक रोचक आकडेवारी समोर आली आहे. यामधील टॉप 10 खास आकडेवारी पाहूयात.... 1. सर्वोच्च टीम स्कोर : यंदाच्या विश्वचषकातील सर्वोच्च धावसंख्येचा विक्रम दक्षिण आफ्रिकेच्या नावावर जमा आहे. आफ्रिकेने लंकेविरोधात पाच विकेट्सच्या मोबदल्यात 428 धावांचा डोंगर उभारला होता. 2. सर्वात मोठा विजय : यंदाच्या विश्वचषकातील सर्वात मोठ्या विजयाची नोंद ऑस्ट्रेलियाच्या नावावर आहे. कांगारुंनी दुबळ्या नेदरलँड्संचा 302 धावांनी पराभव केला. 3. सर्वाधिक धावा : यंदाच्या विश्वचषकातील सर्वाधिक धावांचा मान विराट कोहलीचा आहे. विराट कोहलीने नऊ सामन्यात पाच अर्धशतके आणि दोन शतकांच्या मदतीने 594 धावा केल्या आहेत. दुसऱ्या क्रमांकावर असणारा क्विंटन डिकॉक फक्त तीन धावांनी मागे आहे. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); 4. सर्वोत्कृष्ट खेळी : ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेल याने अफगाण गोलंदाजांची धुलाई केली होती. मॅक्सवेलने 128 चेंडूत नाबाद 201 धावांची खेळी केली. या खेळीच्या बळावर ऑस्ट्रेलियाने उपांत्य फेरीत प्रवेश मिळवला. 5. सर्वात बेस्ट फलंदाजीतील सरासरी : यंदाच्या विश्वचषकात सर्वात बेस्ट सरासरीचा रेकॉर्ड विराट कोहलीच्या नावावर आहे. विराट कोहलीने 99 च्या सरासरीने 594 धावा केल्या आहेत. विराट कोहली तीन वेळा नाबाद राहिलाय. 6. जबराट स्ट्राइक रेट : यंदाच्या विश्वचषकात सर्वाधिक स्ट्राईक रेटचा रेकॉर्ड ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेलच्या नावावर आहे. मॅक्सवेलने 152.69 च्या स्ट्राईक रेटने धावा केल्या आहेत. सात सामन्यात 260 चेंडूत 397 धावा त्याने चोपल्या आहेत. 7. सर्वाधिक शतके : दक्षिण आफ्रिकेच्या क्विंटन डिकॉकच्या नावावर सर्वाधिक शतके आहेत. त्याने यंदा चार शतके ठोकली आहे. डिकॉकने नऊ डावात चार शतकाच्या मदतीने 591 धावा केल्यात. 8. सर्वाधिक षटकार : रोहित शर्मा यंदाच्या विश्वचषकात वेगळ्याच अंदाजात फलंदाजी करतो. पहिल्या चेंडूपासून रोहित आक्रमक फलंदाजी करतो. यंदाच्या विश्वचषकात सर्वाधिक षटकाराचा विक्रम रोहिच्या नावावर आहे. रोहितने नऊ सामन्यात 28 षटकार मारलेत. मॅक्सवेल 26 षटकारासह दुसऱ्या स्थानावर आहे. 9. सर्वाधिक विकेट : ऑस्ट्रेलियाचा फिरकी गोलंदाज एडम झम्पा याने यंदाच्या विश्वचषकात सर्वाधिक विकेट घेतल्या. झम्पाने नऊ सामन्यात 22 विकेट घेतल्या आहेत. मधुशंका दुसऱ्या स्थानावर आहे. 10. सर्वोत्कृष्ट गोलंदाजी: मोहम्मद शामीने लंकेविरोधात 5 षटकात फक्त 18 धावा कर्च करत पाच विकेट घेतल्यात. ही विश्वचषकातील सर्वोत्कृष्ट गोलंदाजी आहे.","pubDate":"2023-11-13 16:32:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/13/1c5717b10b7898c4147346679a52bc2f1699893115180265_original.jpeg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"aa2a141ff700f69eeefd1b107b3fbc9c","title":"सौरव गांगुली ने डिटेल से बताई वजह, क्यों वर्ल्ड कप में पाकिस्तान के अभियान की हवा निकल गई","link":"https://sports.ndtv.com/hindi/cricket/sourav-ganguly-reveals-the-reason-why-pakistan-had-had-so-poor-campaing-in-world-cup-2023-4571540#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"पाकिस्तान से World Cup 2023 के सेमीफाइनल में पहुंचने में नाकाम रहने के बाद से ही दिग्गजों के बयानों का लगातार आना जारी है..और अब गांगुली ने इस पर विस्तार से रोशनी डाली है","content":"जारी World Cup 2023 के सेमीफाइनल में पहुंचने में नाकाम रहने और मेगा इवेंट में भारत और अफगानिस्तान के हाथों पिटने के बाद पाकिस्तान क्रिकेट में आया भूचाल थमा नहीं है. अब जबकि कुछ ही दिनों में कप्तान बाबर आजम (Babar Azam) PCB अध्यक्ष से मिलने जा रहे हैं, तो जाहिर है कि यह तूफान एक अलग ही मोड़ ले सकता है. इसी बीच पाकिस्तान टीम के प्रदर्शन को लेकर लगातार बयानों का आना जारी है. और अब भारतीय पूर्व कप्तान सौरव गांगुली (Sourav Ganguly) ने भी पड़ोसी देश के खराब प्रदर्शन पर मुंह खोला है. यह भी पढ़ें: World Cup 2023: केएल राहुल ने 62 गेंद पर शतक जमाकर रचा इतिहास, तोड़ दिया रोहित शर्मा का रिकॉर्ड गांगुली ने एक पाकिस्तानी चैनल से बातचीत में कहा यह खिलाड़ियों का दीर्घकालिक फॉर्मेट पर टी20 को तरजीह देने का असर है और इसमें संतुलन बनाने की जरुरत है. भारत और पाकिस्तान के अभियान की तुलना करते हुए सौरव ने इस बात को सिरे से खारिज कर दिया कि भारत की सफलता के पीछे एकमात्र कारण आईपीएल है. उन्होंने कहा कि अंतरराष्ट्रीय क्रिकेट में भारत की सफलता का एकमात्र कारण आईपीएल नहीं है. गुणवत्ता केवल आईपीएल खेलने से नहीं आ सकती. यह चार या पांच दिनी क्रिकेट खेलने से आती है. अगर आप ज्यादा टी20 क्रिकेट खेलोगे, तो आप एकदम साधारण बनकर रह जाओगे. पूर्व कप्तान ने कहा कि मैं हमेशा कहता हूं कि आप टी20 खेलें और पैसा बनाएं, लेकिन अगर आप खिलाड़ी बनना चाहते हैं, तो आपको चार या पांच दिनी क्रिकेट खेलनी होगी. उन्होंने कहा कि भारत की सफलता के लिए पूरी तरह से आईपीएल को श्रेय नहीं दिया जा सकता. इसका श्रेय हमारे मजबूत घरेलू ढांचे और प्रतिभाशाली खिलाड़ियों के पूल को दिया जाना चाहिए. गांगुली ने खिलाड़ियों के विकास के लिए चार या पांच दिनी क्रिकेट को खेलने के महत्व पर रोशनी डाली. सौरव ने कहा कि खिलाड़ियों को वसीम अकरम की तरह होना चाहिए, जो हर दिन 20-30 ओवर गेंदबाजी किया करते थे. वह पुरानी गेंद के साथ भी उतने ही तेज होते थे, जितने नई गेंद के साथ. मैं सोचता हूं कि केवल आईपीएल ही नहीं, बल्कि पूरा भारतीय क्रिकेट ढांचा बहुत ही अविश्वसनीय है. यहां बहुत ज्यााद मैचों का आयोजन होता है, बहुत ज्यादा खिलाड़ी हैं और इस लिहाज से हम भाग्यशाली हैं.  ","pubDate":"2023-11-13 16:26:42","image_url":"https://c.ndtvimg.com/2023-11/v0r35r98_sourav-ganguly_625x300_13_November_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c0a7a51453500cbf5b30e79d69454111","title":"\"सहवाग ने सिखाया कि टेस्ट क्रिकेट कैसे खेली जाती है\", ICC ने दिया यह बड़ा सम्मान, तो फैंस ने दिए कुछ ऐसे कमेंट","link":"https://sports.ndtv.com/hindi/cricket/sehwag-taught-how-test-cricket-is-played-fans-reacted-as-icc-gives-such-a-big-honor-to-virender-sehwag-4571220#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"जो काम ICC को कई साल कर लेना चाहिए था, उसे अब पैतृक संस्था ने दुरुस्त कर लिया. और वीरू भारत के बहुत ही चुनिंदा खिलाड़ियों में शामिल हो गए","content":"देर आए, दुरुस्त आए! जो काम कई साल पहले हो जाना चाहिए था, वह अंतरराष्ट्रीय क्रिकेट काउंसिल ने आखिर कर ही दिया. ICC ने भारतीय दिग्गज बल्लेबाज वीरेंद्र सहवाग (Virender Sehwag) को साल 2023 के लिए \"हॉल ऑफ फेम\" में जगह दी है. सहवाग अब भारत के उन चुनिंदा क्रिकेटरों में शामि हो गए हैं, जिन्हें इस सूची में जगह मिली है. ICC ने कुछ साल पहले ही \"हॉल ऑफ फेम\" की शुरुआत की थी. सहवाग के क्रिकेट इतिहास के सर्वकालिक सबसे आतिशी बल्लेबाजों में से एक गिना जाता है. सहवाग ने टेस्ट क्रिकेट में साल 2000 में आक्रामक शैली की शुरुआत की थी. तब सहवाग का स्ट्रा. रेट अपने समय के बाकी बल्लेबाजों से खासा आगे होता था और उन्होंने नियमित अंतराल पर इसे अंजाम दिया.Sehwag career at a glance104 Tests – 8,586 runs at an average of 49.34, 40 wickets251 ODIs – 8,273 runs at an average of 35.05, 96 wickets19 T20Is – 394 runs at an average of 21.88— Anuj Mishra (@anujmishra003) November 13, 2023वीरू ने अपने अंदाज से भारत को कई मैच जिताए. और वह बस कुछ ही रन से टेस्ट क्रिकेट में तीसरा तिहरा शतक जड़ने से चूक गए थे. सहवाग ने खेले 104 टेस्ट मैचों में 49.34 के औसत से 8586 रन बनाए. और उन्हें गावस्कर के बाद भारत का दूसरा सर्वकालिक सर्वश्रेष्ठ ओपनर कहा जाता है. बहरहाल, सहवाग की जैसे ही हॉल ऑफ फेम की खबर आई, तो उनके चाहने वालों ने वीरू की तारीफ में एक से बढ़कर एक प्रतिक्रिया दी. देखिए कि कैसे कमेंट कर रहे हैं वीरू के चाहने वालेVirender Sehwag ❤ play like bolwer be like: bhai kitna marega yaar ab to maf kar de— Aryan Pandey (@AryanPa66861306) November 13, 2023बात एकदम पूरी तरह सही हैOne of the most destructive opener in history of cricket #VirenderSehwag pic.twitter.com/4XZv14Hhk5— CricWiz (@CricWizTalks) November 13, 2023टेस्ट क्रिकेट खेलना वीरू ने सिखायाOne of the legend in Indian cricket.....test me kaise khelte hai Viru bhai ne shikhaya...— Hriday Singh (@hridaysingh16) November 13, 2023इसमें भी कोई दो राय नहीं हैHe used to take the game away within 10 overs— Dom (@diligent_three) November 13, 2023","pubDate":"2023-11-13 16:25:17","image_url":"https://c.ndtvimg.com/2023-06/f6mqt16o_virender-sehwag-prediction-_120x90_27_June_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"46fcb450e7483e4b9e87c77336cd7b96","title":"England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup","link":"https://www.dailymail.co.uk/sport/cricket/article-12744725/England-batter-Ben-Duckett-seize-big-chance-impress-Caribbean-watching-tired-team-mates-struggle-World-Cup.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE INTERVIEW BY LAWRENCE BOOTH: Duckett, who has been at the heart of England's Bazball revolution in Test cricket, intends to show what he can do in 50-over cricket.","content":"England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup A new-look England will face the West Indies in three ODIs next month Ben Duckett hopes to add to the eight one-day caps he has won in seven years The 29-year-old has been at the heart of the Bazball revolution in Test cricket By Lawrence Booth for the Daily Mail Published: 20:01, 13 November 2023 | Updated: 20:37, 13 November 2023 e-mail View comments A refreshed Ben Duckett wants to take the Caribbean by storm next month after watching his ‘tired’ team-mates struggle at the World Cup in India . Duckett, who has been at the heart of England’s Bazball revolution in Test cricket, intends to show what he can do in 50-over cricket when a new four-year World Cup cycle begins with the first of three ODIs against West Indies in Antigua on December 3. And he believes the simplicity of his approach, which essentially remains unaltered whatever the format, will stand him in good stead as he looks to add to the eight one-day caps he has won since his debut in Bangladesh seven years ago. ‘I’ve been a part of the best generation of England white-ball cricket and it’s been near to impossible to break into the team,’ he told Mail Sport. ‘Now there’s an opportunity to go and get my place.’ Managing director Rob Key said on Sunday he felt England’s one-day team had not been helped by comparisons with the aggressive Bazballers. And with many of the 30-somethings who have fallen so short in India being omitted from the trip to the Caribbean, a new-look one-day side will include the Test-match top three of Duckett, Zak Crawley and Ollie Pope. England batter Ben Duckett wants to take the Caribbean by storm next month Once, England used the one-day team as the route into Test cricket. Then, under Ben Stokes and Brendon McCullum, the Test side copied their one-day counterparts’ aggression. Now, with Key observing that the 50-over team has gone away from the style that helped make England double white-ball world champions, it is as if the wheel has turned full circle. The 29-year-old Duckett hesitates to call himself young, but admits: ‘The exciting brand that the likes of me, Zak and Popey play is exactly what England want in both formats. It will be an opportunity for some fresh faces to go and show what they can do. ‘I’ve always found I don’t have a different gameplan for Test match, 50-over and T20. In the past I’d always say you just take a few more risks in T20, whereas now I’m running at Josh Hazlewood in a Test match on day one. ‘There’s also Harry Brook, Will Jacks and Phil Salt - there are so many names. All those guys are playing a similar brand of cricket throughout the formats, which makes life a lot easier.’ Duckett does not believe that the squad for the Caribbean spells the end for England’s Class of 2019, and says the selectors were always going to look elsewhere for a trip that starts so soon after the World Cup. He says he was told he was ‘pretty close’ to selection for the tournament himself, and found it ‘tough’ to watch England lose six games out of nine. The 29-year-old has been at the heart of England’s Bazball revolution in Test cricket ‘I’m sure the lads are more gutted than anyone,’ he said. ‘It’s a side that were good enough to go and win. I’m looking at half or three-quarters of that squad, and the timing being straight after the English summer. All the lads have been playing so much cricket. ‘I felt for them flying straight off at the end of the summer, with no break, going straight to a World Cup in India. It must have been incredibly hard, and there must have been tired bodies.’ Duckett, by contrast, has had six weeks off after the end of a summer in which he opened in all five Ashes Tests and made an unbeaten 107 off 78 balls in an ODI against Ireland in Bristol. ‘I’ve had a really nice break, and I feel fresh and ready to go.’ Music, after the last few weeks, to English ears. India India Cricket Share or comment on this article: England batter Ben Duckett out to seize his big chance to impress in the Caribbean after watching his 'tired' team-mates struggle at the World Cup e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-13 20:37:24","image_url":"https://i.dailymail.co.uk/1s/2023/11/13/20/77755749-0-image-a-59_1699907840349.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d24e92287afac98b7947d6c21ce5f7e5","title":"World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-morne-morkel-resigns-as-pakistan-bowling-coach-following-teams-disappointing-performance-13384862.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance","content":"Cricket World Cup 2023: Morne Morkel resigns as Pakistan bowling coach following team's disappointing performance Morne Morkel had joined Pakistan cricket team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. Press Trust of India November 14, 2023 00:03:38 IST Morne Morkel had joined the team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. AP Lahore: Former South African pacer Morne Morkel on Monday resigned as the Pakistan cricket team’s bowling coach without completing his contract and two days after the team’s elimination from the World Cup in India. World Cup 2023: News | Schedule | Results | Points table The Babar Azam-led Pakistan lost five of the nine matches in the ODI showpiece event, losing the last match to England by 93 runs in Kolkata. Related Articles World Cup 2023: Pakistan have not been paid for five months, claims Rashid Latif World Cup 2023: What are Pakistan's semi-final chances after beating Bangladesh? Morkel had joined the team on a six-month contract in June this year after finishing his assignment with IPL side Lucknow Super Giants. His first assignment with the Pakistan team was its tour of Sri Lanka for a two-Test series. “Pakistan Cricket Board will announce his replacement in due course. Pakistan’s next assignment is a three-match Test series against Australia scheduled to take place from December 14, 2023, to January 7, 2024, in Australia,” the PCB said in a statement on Monday. Former fast bowler Umar Gul is tipped to replace Morkel as he has worked before with the national team on an interim basis and has also coached the Afghanistan team. Pakistan failed to qualify for the semifinals after finishing fifth, which led to several former cricketers demanding wholesale changes in the side, including the removal of Babar Azam as skipper . Pakistan suffered losses against India, Australia, South Africa, England and a shock defeat at the hands of Afghanistan. Join our Whatsapp channel to get the latest global news updates Published on: November 14, 2023 00:03:38 IST Tags: Cricket Morne Morkel Pakistan Cricket Team World Cup 2023","pubDate":"2023-11-13 18:33:38","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Morne-Morkel-640_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"32a191663c9b006e82300e10a2d57677","title":"World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey","link":"https://www.firstpost.com/firstcricket/sports-news/world-cup-2023-we-have-the-right-bowlers-to-exploit-different-conditions-says-india-bowling-coach-paras-mhambrey-13384812.html","keywords":["First Cricket News"],"creator":["PN Vishnu"],"video_url":null,"description":"World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey","content":"Cricket World Cup 2023: We have the right bowlers to exploit different conditions, says India bowling coach Paras Mhambrey “In terms of the different skills, we have the ability to (take on) whatever challenge that is ahead of us. Maybe different surfaces, we have the bowlers to do that. And we’ve done it,” India bowling coach Paras Mhambrey said. FirstCricket Staff November 13, 2023 23:41:56 IST Paras Mhambrey was all praise for Jasprit Bumrah, calling him a \"lethal\" bowler. AP India bowling coach Paras Mhambrey believes that the hosts have the right bowlers who can be effective on different conditions and surfaces. World Cup 2023: News | Schedule | Results | Points table The Indian bowlers have taken the 2023 World Cup by storm so far, with the pace trio of Mohammed Shami, Jasprit Bumrah and Mohammed Siraj sharing 45 wickets between themselves. Apart from the pacers, Ravindra Jadeja (16 wickets) and Kuldeep Yadav (14 wickets) have also been equally impressive. Related Articles World Cup 2023: Team India reach Mumbai ahead of semi-final against New Zealand; Coaching staff inspects Wankhede pitch World Cup 2023: Hardik Pandya ruled out of tournament; Prasidh Krishna named replacement India’s impeccable bowling attack has helped the hosts remain unbeaten in the World Cup so far, having clinched nine wins in as many matches. “In terms of the different skills, we have the ability to (take on) whatever challenge that is ahead of us. Maybe different surfaces, we have the bowlers to do that. And we’ve done it,” Mhambrey told ICC following India’s 160-run win over Netherlands on Sunday. “We’re the only team who are going to play in nine different venues. So for us, it’s nine different surfaces, nine different challenges. “So, we have the right bowlers to exploit these conditions, and they’ve shown that. All of them on a given day can win a game for their country,” stated Mhambrey. Mhambrey went onto term Jasprit Bumrah as a “lethal” bowler whereas he complemented Shami’s seam bowling. “Boom (Bumrah) is a very different action. Just look at the way he’s come back to the game (from injury). The set of skills, the unique action. He completely beats you. Now, he’s got both. He gets the ball in and gets the ball out. He’s become lethal,” the coach said. “Shami is someone who has the seam (that hits) straight upright. You never know when Shami hits that seam, which way it’s going to come,” added the 51-year-old. Mhambrey also noted Siraj’s versatility, saying: “Siraj has really kind of grown in the last couple of years. He’s understood his bowling, obviously coming through the ranks. He’s started using different set of skills, the wobble seam. “Initially, he had the ball coming into right-handers but now, he shapes the ball away. He has the ability and smartness to use the wobble seam and that also worked,” continued Mhambrey. Mhambrey was all praise for Jadeja’s accuracy, whereas he feels Kuldeep Yadav has improved on his technicality. “His (Jadeja) ability is very simple. Ability to hit the deck, and hit the lengths spot on. Very accurate. Very miserly in terms of the way he goes about his bowling. Doesn’t give anything away to the batsman. “Love how Kuldeep has gone about over the last couple of years. He’s done little bit of technical adjustment to his run-up, which has really helped him to add those revs,” said Mhambrey. “His spin has gone up, speed has gone up. And, someone like a chinaman bowler who does that, doesn’t allow you to step out so easily,” he added. Although Ravichandran Ashwin has played just the lone match against Australia in Chennai, where he finished with figures of 1/34, Mhambrey feels the all-rounder offers loads of experience to the team. “Ash (Ashwin) is out and out a match-winner. Love the way he moves about, no airs about playing the game or not playing the game. “Even when he’s sitting in the dugout when you have those chats with him, he’s always there to guide these guys and comes up with a lot of suggestions,” commented the former cricketer. Join our Whatsapp channel to get the latest global news updates Published on: November 13, 2023 23:41:56 IST Tags: Cricket Paras Mhambrey Team India World Cup 2023","pubDate":"2023-11-13 18:11:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Bumrah-640_AP.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"51bdae32ae9b819b4e146e0dd09bc2c2","title":"Jay Shah: జై షా వల్లనే శ్రీలంక క్రికెట్‌ నాశనం అయ్యింది...లంక మాజీ కెప్టెన్ అర్జున రణతుంగ సంచలన వ్యాఖ్యలు...","link":"https://telugu.latestly.com/india/news/jay-shah-sri-lankan-cricket-was-destroyed-by-jay-shah-115363.html","keywords":null,"creator":null,"video_url":null,"description":"శ్రీలంక క్రికెట్ (ఎస్‌ఎల్‌సి) నాశనం వెనుక బిసిసిఐ కార్యదర్శి జైషా కారణం అని శ్రీలంక మాజీ కెప్టెన్ అర్జున రణతుంగ విరుచుకుపడ్డాడు.","content":"శ్రీలంక క్రికెట్ (ఎస్‌ఎల్‌సి) నాశనం వెనుక బిసిసిఐ కార్యదర్శి జైషా కారణం అని శ్రీలంక మాజీ కెప్టెన్ అర్జున రణతుంగ విరుచుకుపడ్డాడు. అంతర్జాతీయ క్రికెట్ కౌన్సిల్ (ICC) అధిక రాజకీయ జోక్యానికి SLCని సస్పెండ్ చేసిన 15 రోజుల తర్వాత 1996 ప్రపంచ కప్ విజేత కెప్టెన్ చేసిన వ్యాఖ్య కావడం విశేషం. \"SLC అధికారులు జే షా మధ్య ఉన్న సంబంధం కారణంగా, వారు SLCని తొక్కిపెట్టి నియంత్రించగలరనే భావనలో ఉన్నారు\" అని రణతుంగ చెప్పినట్లు డైలీ మిర్రర్ పేర్కొంది. 'జయ్ షా శ్రీలంక క్రికెట్‌ను నడుపుతున్నాడని. జే షా ఒత్తిడి కారణంగా SLC నాశనమవుతోందన్నారు. భారత్‌లో ఓ వ్యక్తి శ్రీలంక క్రికెట్‌ను నాశనం చేస్తున్నాడు. భారత హోం మంత్రిగా ఉన్న తన తండ్రి వల్ల మాత్రమే అతను శక్తివంతమయ్యాడు, ”అని రణతుంగ ప్రధాని నరేంద్ర మోడీ మంత్రివర్గంలో సభ్యుడు అమిత్ షాను ఉద్దేశించి అన్నారు. From where does Jay Shah get money to manage Sri Lanka Cricket?? 😳 pic.twitter.com/Q6K6JblzPM — Mr. R Gandhi 🇮🇳 (@Mr_RGandhi) November 13, 2023 SLCలో అధికార పోరు మధ్యలో రణతుంగ కీలక వ్యక్తి. ఈ నెల ప్రారంభంలో, శ్రీలంక క్రీడా మంత్రి రోషన్ రణసింగ్ SLC బోర్డును తొలగించి, అర్జున రణతుంగ నేతృత్వంలో మధ్యంతర కమిటీని ఏర్పాటు చేశారు. మొత్తం బోర్డు సస్పెన్షన్‌కు ప్రధాన కారణం అవినీతి ఆరోపణలేనని రణసింగే పేర్కొన్నారు. అయితే, ఈ నిర్ణయాన్ని శ్రీలంక అప్పీల్ కోర్ట్ రద్దు చేసింది, ఇది తదుపరి విచారణ పెండింగ్‌లో ఉన్న అధికారులను పునరుద్ధరించింది. పర్యవసానంగా, గత వారం సంక్షోభ కాల్ సమయంలో 'స్వయంప్రతిపత్తితో దాని వ్యవహారాలను నిర్వహించడంలో' విఫలమైనందుకు ICC SLCని సస్పెండ్ చేసింది. భారత్‌లో జరిగిన ODI ప్రపంచ కప్‌లో శ్రీలంక జట్టు నాకౌట్‌లతో పాటు ఛాంపియన్స్ ట్రోఫీకి అర్హత సాధించలేకపోయిన దుర్భర ప్రదర్శన తర్వాత, కొనసాగుతున్న రాజకీయ గందరగోళం శ్రీలంకలో క్రికెట్ అభివృద్ధిని మరింత స్తంభింపజేస్తుందని భావిస్తున్నారు.","pubDate":"2023-11-13 17:40:04","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"telugu"},{"article_id":"d9439c06f0bd544afcc6e29335f2ffb4","title":"Cricket Legends Virender Sehwag, Diana Edulji, and Aravinda de Silva Inducted into ICC Cricket Hall of Fame","link":"https://orissadiary.com/cricket-legends-virender-sehwag-diana-edulji-and-aravinda-de-silva-inducted-into-icc-cricket-hall-of-fame/","keywords":["Sports"],"creator":["OdAdmin"],"video_url":null,"description":"Three cricketing greats and standout performers in the history of the game – legendary opener Virender Sehwag, former Indian Women Test skipper Diana Edulji and Sri Lanka’s iconic star Aravinda de Silva are the latest inductees to be added to the ICC Cricket Hall of Fame. The International Cricket Council (ICC) today announced the name […]","content":"Three cricketing greats and standout performers in the history of the game – legendary opener Virender Sehwag, former Indian Women Test skipper Diana Edulji and Sri Lanka’s iconic star Aravinda de Silva are the latest inductees to be added to the ICC Cricket Hall of Fame. The International Cricket Council (ICC) today announced the name of the three legends of cricket as the latest inductees. Sehwag, a destructive opener of the modern era, holds a record that is still hard to match, the first Indian with a two Triple centuries. The second inductee Edulji captained India for almost three decades, and as a left-arm orthodox spinner claimed 100 wickets while making 54 international appearances. Edulji took up the role of administrator with Western Railways and worked hard to create opportunities for employment for women cricketers. The third inductee was a winner of the ICC Men’s Cricket World Cup with Sri Lanka in 1996 – Aravinda de Silva. The Sri Lankan batter was known for his consistency, scoring 20 Test centuries during an 18-year international career which is the third most by any Sri Lanka men’s player. The ICC Hall of Fame honours the greatest international cricketers throughout the long history of the sport, and the enduring legacies of de Silva, Edulji and Sehwag see them join as inductees number 110, 111 and 112 respectively. As part of this year’s celebrations, the Class of 2023 will be inducted in a special on-field ceremony at the Wankhede Stadium, Mumbai during the first semi-final of the ICC Men’s Cricket World Cup 2023 on November 15.","pubDate":"2023-11-13 17:25:18","image_url":null,"source_id":"orissadiary","source_priority":2836164,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"00363e591f6298aa8d77248d0a91bb1a","title":"बेटी को गोद में लेकर सेमीफाइनल के लिए मुंबई पहुंचे रोहित शर्मा, फैन्स ने लगाये नारे, वीडियो वायरल","link":"https://hindi.oneindia.com/news/sports/cricket/world-cup-2023-rohit-sharma-reached-mumbai-with-family-video-goes-viral-846133.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma: रोहित शर्मा और टीम इंडिया मुंबई पहुँच गए हैं। मुंबई के वानखेड़े स्टेडियम में न्यूजीलैंड के खिलाफ सेमीफाइनल खेला जाएगा।","content":"भारत और न्यूजीलैंड के बीच वर्ल्ड कप सेमीफाइनल मैच बुधवार को मुंबई के वानखेड़े स्टेडियम में खेला जाना है। लीग चरण में टीम इंडिया ने अपना अंतिम मुकाबला नीदरलैंड्स के खिलाफ खेला था। नीदरलैंड्स के खिलाफ भारत ने एक बड़े अंतर से जीत दर्ज की थी। मुंबई में टीम इंडिया सोमवार को पहुँच गई। रोहित शर्मा अपने परिवार के साथ पहुंचे। बेटी के अलावा पत्नी रितिका भी उनके साथ मौजूद थीं। रोहित शर्मा अपनी बेटी को गोद में लेकर आए। फैन्स ने जैसे ही उनको देखा, उत्साह से लबरेज होकर रोहित भाई-रोहित भाई पुकारने लगे। हालंकि रोहित शर्मा कड़े सुरक्षा घेरे में थे और बिना किसी को देखे वह पुलिस की सुरक्षा में निकल गए। पीछे उनकी पत्नी रितिका सजदेह भी थीं। रोहित शर्मा, उनकी बेटी और पत्नी का एक वीडियो तेजी से इंटरनेट पर वायरल हो गया। फैन्स के भी धांसू रिएक्शन आए। कीवी टीम के खिलाफ भारतीय टीम ने साल 2019 के वर्ल्ड कप में भी सेमीफाइनल मैच खेला था। हालांकि उस मुकाबले में टीम इंडिया को निराशा हाथ लगी थी। भारतीय टीम हार के साथ टूर्नामेंट से बाहर हो गई थी। इस बार बदला लेना का बेहतरीन मौका भारत के पास आया है। Captain Rohit Sharma arrived in Mumbai for Semis 🔥💙 🎥 voompla/IG अब तक के अभियान की बात की जाए तो टीम इंडिया ने किसी भी विपक्षी दल को नहीं छोड़ा है। भारतीय टीम ने वर्ल्ड कप हिस्सा ले रही सभी 9 टीमों को पटखनी दी। भारतीय टीम ने लगातार 9 वर्ल्ड कप मैचों में जीत दर्ज करने का नया रिकॉर्ड बना दिया। इससे पहले 8 मैचों में जीत का कीर्तिमान भारत ने 2003 में बनाया था।","pubDate":"2023-11-13 16:50:14","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"11b5947fd15db00a4ab3771c6814541c","title":"Australian cricketer’s incredible six wickets in final six balls wins match","link":"https://uk.sports.yahoo.com/news/australian-cricketer-incredible-six-wickets-142654046.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-11-13 16:41:05","image_url":null,"source_id":"yahoo","source_priority":17,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"b2c9cadd43a63e30fe769e70a8ad5cc3","title":"World Cup 203 Top Stats : विराट-रोहितचा फलंदाजीत जलवा, मॅक्सवेलचीही कमाल, पाहा 10 रोचक आकडे","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-stats-records-most-run-batting-averages-strike-rate-most-wicket-highest-score-1228276","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup Stats  : भारतात सुरु असलेला विश्वचषक आता अखेरच्या टप्प्यात पोहचला आहे. तीन सामन्यानंतर आपल्याला विजेता मिळेल. साखळी सामन्यावर भारताने वर्चस्व गाजवले. त्याशिवाय ऑस्ट्रेलिया, दक्षिण आफ्रिका आणि न्यूझीलंड या संघाने उपांत्य फेरतीत स्थान पटकावले. सहा संघाचे साखळी फेरतीच आव्हान संपुष्टात आले. प्रत्येक संघाने 9-9 सामने खेळले. साखळी फेरीत दहा संघामध्ये आतापर्यंत 45 सामने झालेत. त्यानंतर अनेक रोचक आकडेवारी समोर आली आहे. यामधील टॉप 10 खास आकडेवारी पाहूयात....  1. सर्वोच्च टीम स्कोर :  यंदाच्या विश्वचषकातील सर्वोच्च धावसंख्येचा विक्रम दक्षिण आफ्रिकेच्या नावावर जमा आहे. आफ्रिकेने लंकेविरोधात पाच विकेट्सच्या मोबदल्यात 428 धावांचा डोंगर उभारला होता.    2. सर्वात मोठा विजय :यंदाच्या विश्वचषकातील सर्वात मोठ्या विजयाची नोंद ऑस्ट्रेलियाच्या नावावर आहे. कांगारुंनी दुबळ्या नेदरलँड्संचा 302 धावांनी पराभव केला. 3. सर्वाधिक धावा : यंदाच्या विश्वचषकातील सर्वाधिक धावांचा मान विराट कोहलीचा आहे. विराट कोहलीने नऊ सामन्यात पाच अर्धशतके आणि दोन शतकांच्या मदतीने  594 धावा केल्या आहेत. दुसऱ्या क्रमांकावर असणारा क्विंटन डिकॉक फक्त तीन धावांनी मागे आहे.  4. सर्वोत्कृष्ट खेळी :ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेल याने अफगाण गोलंदाजांची धुलाई केली होती. मॅक्सवेलने 128 चेंडूत नाबाद 201 धावांची खेळी केली. या खेळीच्या बळावर ऑस्ट्रेलियाने उपांत्य फेरीत प्रवेश मिळवला. 5. सर्वात बेस्ट फलंदाजीतील सरासरी : यंदाच्या विश्वचषकात सर्वात बेस्ट सरासरीचा रेकॉर्ड विराट कोहलीच्या नावावर आहे. विराट कोहलीने 99 च्या सरासरीने 594 धावा केल्या आहेत. विराट कोहली तीन वेळा नाबाद राहिलाय.  6. जबराट स्ट्राइक रेट  :यंदाच्या विश्वचषकात सर्वाधिक स्ट्राईक रेटचा रेकॉर्ड ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेलच्या नावावर आहे. मॅक्सवेलने 152.69 च्या स्ट्राईक रेटने धावा केल्या आहेत. सात सामन्यात 260 चेंडूत 397 धावा त्याने चोपल्या आहेत.  7. सर्वाधिक शतके : दक्षिण आफ्रिकेच्या क्विंटन डिकॉकच्या नावावर सर्वाधिक शतके आहेत. त्याने यंदा चार शतके ठोकली आहे. डिकॉकने नऊ डावात चार शतकाच्या मदतीने 591 धावा केल्यात. 8. सर्वाधिक षटकार :रोहित शर्मा यंदाच्या विश्वचषकात वेगळ्याच अंदाजात फलंदाजी करतो. पहिल्या चेंडूपासून रोहित आक्रमक फलंदाजी करतो. यंदाच्या विश्वचषकात सर्वाधिक षटकाराचा विक्रम रोहिच्या नावावर आहे. रोहितने नऊ सामन्यात 28 षटकार मारलेत. मॅक्सवेल 26 षटकारासह दुसऱ्या स्थानावर आहे.  9. सर्वाधिक विकेट :ऑस्ट्रेलियाचा फिरकी गोलंदाज एडम झम्पा याने यंदाच्या विश्वचषकात सर्वाधिक विकेट घेतल्या. झम्पाने नऊ सामन्यात 22 विकेट घेतल्या आहेत. मधुशंका दुसऱ्या स्थानावर आहे.   10. सर्वोत्कृष्ट गोलंदाजी: मोहम्मद शामीने लंकेविरोधात 5 षटकात फक्त 18 धावा कर्च करत पाच विकेट घेतल्यात. ही विश्वचषकातील सर्वोत्कृष्ट गोलंदाजी आहे.  ","content":"World Cup Stats : भारतात सुरु असलेला विश्वचषक आता अखेरच्या टप्प्यात पोहचला आहे. तीन सामन्यानंतर आपल्याला विजेता मिळेल. साखळी सामन्यावर भारताने वर्चस्व गाजवले. त्याशिवाय ऑस्ट्रेलिया, दक्षिण आफ्रिका आणि न्यूझीलंड या संघाने उपांत्य फेरतीत स्थान पटकावले. सहा संघाचे साखळी फेरतीच आव्हान संपुष्टात आले. प्रत्येक संघाने 9-9 सामने खेळले. साखळी फेरीत दहा संघामध्ये आतापर्यंत 45 सामने झालेत. त्यानंतर अनेक रोचक आकडेवारी समोर आली आहे. यामधील टॉप 10 खास आकडेवारी पाहूयात.... 1. सर्वोच्च टीम स्कोर : यंदाच्या विश्वचषकातील सर्वोच्च धावसंख्येचा विक्रम दक्षिण आफ्रिकेच्या नावावर जमा आहे. आफ्रिकेने लंकेविरोधात पाच विकेट्सच्या मोबदल्यात 428 धावांचा डोंगर उभारला होता. 2. सर्वात मोठा विजय : यंदाच्या विश्वचषकातील सर्वात मोठ्या विजयाची नोंद ऑस्ट्रेलियाच्या नावावर आहे. कांगारुंनी दुबळ्या नेदरलँड्संचा 302 धावांनी पराभव केला. 3. सर्वाधिक धावा : यंदाच्या विश्वचषकातील सर्वाधिक धावांचा मान विराट कोहलीचा आहे. विराट कोहलीने नऊ सामन्यात पाच अर्धशतके आणि दोन शतकांच्या मदतीने 594 धावा केल्या आहेत. दुसऱ्या क्रमांकावर असणारा क्विंटन डिकॉक फक्त तीन धावांनी मागे आहे. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); 4. सर्वोत्कृष्ट खेळी : ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेल याने अफगाण गोलंदाजांची धुलाई केली होती. मॅक्सवेलने 128 चेंडूत नाबाद 201 धावांची खेळी केली. या खेळीच्या बळावर ऑस्ट्रेलियाने उपांत्य फेरीत प्रवेश मिळवला. 5. सर्वात बेस्ट फलंदाजीतील सरासरी : यंदाच्या विश्वचषकात सर्वात बेस्ट सरासरीचा रेकॉर्ड विराट कोहलीच्या नावावर आहे. विराट कोहलीने 99 च्या सरासरीने 594 धावा केल्या आहेत. विराट कोहली तीन वेळा नाबाद राहिलाय. 6. जबराट स्ट्राइक रेट : यंदाच्या विश्वचषकात सर्वाधिक स्ट्राईक रेटचा रेकॉर्ड ऑस्ट्रेलियाच्या ग्लेन मॅक्सवेलच्या नावावर आहे. मॅक्सवेलने 152.69 च्या स्ट्राईक रेटने धावा केल्या आहेत. सात सामन्यात 260 चेंडूत 397 धावा त्याने चोपल्या आहेत. 7. सर्वाधिक शतके : दक्षिण आफ्रिकेच्या क्विंटन डिकॉकच्या नावावर सर्वाधिक शतके आहेत. त्याने यंदा चार शतके ठोकली आहे. डिकॉकने नऊ डावात चार शतकाच्या मदतीने 591 धावा केल्यात. 8. सर्वाधिक षटकार : रोहित शर्मा यंदाच्या विश्वचषकात वेगळ्याच अंदाजात फलंदाजी करतो. पहिल्या चेंडूपासून रोहित आक्रमक फलंदाजी करतो. यंदाच्या विश्वचषकात सर्वाधिक षटकाराचा विक्रम रोहिच्या नावावर आहे. रोहितने नऊ सामन्यात 28 षटकार मारलेत. मॅक्सवेल 26 षटकारासह दुसऱ्या स्थानावर आहे. 9. सर्वाधिक विकेट : ऑस्ट्रेलियाचा फिरकी गोलंदाज एडम झम्पा याने यंदाच्या विश्वचषकात सर्वाधिक विकेट घेतल्या. झम्पाने नऊ सामन्यात 22 विकेट घेतल्या आहेत. मधुशंका दुसऱ्या स्थानावर आहे. 10. सर्वोत्कृष्ट गोलंदाजी: मोहम्मद शामीने लंकेविरोधात 5 षटकात फक्त 18 धावा कर्च करत पाच विकेट घेतल्यात. ही विश्वचषकातील सर्वोत्कृष्ट गोलंदाजी आहे.","pubDate":"2023-11-13 16:32:21","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/13/1c5717b10b7898c4147346679a52bc2f1699893115180265_original.jpeg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"aa2a141ff700f69eeefd1b107b3fbc9c","title":"सौरव गांगुली ने डिटेल से बताई वजह, क्यों वर्ल्ड कप में पाकिस्तान के अभियान की हवा निकल गई","link":"https://sports.ndtv.com/hindi/cricket/sourav-ganguly-reveals-the-reason-why-pakistan-had-had-so-poor-campaing-in-world-cup-2023-4571540#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"पाकिस्तान से World Cup 2023 के सेमीफाइनल में पहुंचने में नाकाम रहने के बाद से ही दिग्गजों के बयानों का लगातार आना जारी है..और अब गांगुली ने इस पर विस्तार से रोशनी डाली है","content":"जारी World Cup 2023 के सेमीफाइनल में पहुंचने में नाकाम रहने और मेगा इवेंट में भारत और अफगानिस्तान के हाथों पिटने के बाद पाकिस्तान क्रिकेट में आया भूचाल थमा नहीं है. अब जबकि कुछ ही दिनों में कप्तान बाबर आजम (Babar Azam) PCB अध्यक्ष से मिलने जा रहे हैं, तो जाहिर है कि यह तूफान एक अलग ही मोड़ ले सकता है. इसी बीच पाकिस्तान टीम के प्रदर्शन को लेकर लगातार बयानों का आना जारी है. और अब भारतीय पूर्व कप्तान सौरव गांगुली (Sourav Ganguly) ने भी पड़ोसी देश के खराब प्रदर्शन पर मुंह खोला है. यह भी पढ़ें: World Cup 2023: केएल राहुल ने 62 गेंद पर शतक जमाकर रचा इतिहास, तोड़ दिया रोहित शर्मा का रिकॉर्ड गांगुली ने एक पाकिस्तानी चैनल से बातचीत में कहा यह खिलाड़ियों का दीर्घकालिक फॉर्मेट पर टी20 को तरजीह देने का असर है और इसमें संतुलन बनाने की जरुरत है. भारत और पाकिस्तान के अभियान की तुलना करते हुए सौरव ने इस बात को सिरे से खारिज कर दिया कि भारत की सफलता के पीछे एकमात्र कारण आईपीएल है. उन्होंने कहा कि अंतरराष्ट्रीय क्रिकेट में भारत की सफलता का एकमात्र कारण आईपीएल नहीं है. गुणवत्ता केवल आईपीएल खेलने से नहीं आ सकती. यह चार या पांच दिनी क्रिकेट खेलने से आती है. अगर आप ज्यादा टी20 क्रिकेट खेलोगे, तो आप एकदम साधारण बनकर रह जाओगे. पूर्व कप्तान ने कहा कि मैं हमेशा कहता हूं कि आप टी20 खेलें और पैसा बनाएं, लेकिन अगर आप खिलाड़ी बनना चाहते हैं, तो आपको चार या पांच दिनी क्रिकेट खेलनी होगी. उन्होंने कहा कि भारत की सफलता के लिए पूरी तरह से आईपीएल को श्रेय नहीं दिया जा सकता. इसका श्रेय हमारे मजबूत घरेलू ढांचे और प्रतिभाशाली खिलाड़ियों के पूल को दिया जाना चाहिए. गांगुली ने खिलाड़ियों के विकास के लिए चार या पांच दिनी क्रिकेट को खेलने के महत्व पर रोशनी डाली. सौरव ने कहा कि खिलाड़ियों को वसीम अकरम की तरह होना चाहिए, जो हर दिन 20-30 ओवर गेंदबाजी किया करते थे. वह पुरानी गेंद के साथ भी उतने ही तेज होते थे, जितने नई गेंद के साथ. मैं सोचता हूं कि केवल आईपीएल ही नहीं, बल्कि पूरा भारतीय क्रिकेट ढांचा बहुत ही अविश्वसनीय है. यहां बहुत ज्यााद मैचों का आयोजन होता है, बहुत ज्यादा खिलाड़ी हैं और इस लिहाज से हम भाग्यशाली हैं.  ","pubDate":"2023-11-13 16:26:42","image_url":"https://c.ndtvimg.com/2023-11/v0r35r98_sourav-ganguly_625x300_13_November_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c0a7a51453500cbf5b30e79d69454111","title":"\"सहवाग ने सिखाया कि टेस्ट क्रिकेट कैसे खेली जाती है\", ICC ने दिया यह बड़ा सम्मान, तो फैंस ने दिए कुछ ऐसे कमेंट","link":"https://sports.ndtv.com/hindi/cricket/sehwag-taught-how-test-cricket-is-played-fans-reacted-as-icc-gives-such-a-big-honor-to-virender-sehwag-4571220#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"जो काम ICC को कई साल कर लेना चाहिए था, उसे अब पैतृक संस्था ने दुरुस्त कर लिया. और वीरू भारत के बहुत ही चुनिंदा खिलाड़ियों में शामिल हो गए","content":"देर आए, दुरुस्त आए! जो काम कई साल पहले हो जाना चाहिए था, वह अंतरराष्ट्रीय क्रिकेट काउंसिल ने आखिर कर ही दिया. ICC ने भारतीय दिग्गज बल्लेबाज वीरेंद्र सहवाग (Virender Sehwag) को साल 2023 के लिए \"हॉल ऑफ फेम\" में जगह दी है. सहवाग अब भारत के उन चुनिंदा क्रिकेटरों में शामि हो गए हैं, जिन्हें इस सूची में जगह मिली है. ICC ने कुछ साल पहले ही \"हॉल ऑफ फेम\" की शुरुआत की थी. सहवाग के क्रिकेट इतिहास के सर्वकालिक सबसे आतिशी बल्लेबाजों में से एक गिना जाता है. सहवाग ने टेस्ट क्रिकेट में साल 2000 में आक्रामक शैली की शुरुआत की थी. तब सहवाग का स्ट्रा. रेट अपने समय के बाकी बल्लेबाजों से खासा आगे होता था और उन्होंने नियमित अंतराल पर इसे अंजाम दिया.Sehwag career at a glance104 Tests – 8,586 runs at an average of 49.34, 40 wickets251 ODIs – 8,273 runs at an average of 35.05, 96 wickets19 T20Is – 394 runs at an average of 21.88— Anuj Mishra (@anujmishra003) November 13, 2023वीरू ने अपने अंदाज से भारत को कई मैच जिताए. और वह बस कुछ ही रन से टेस्ट क्रिकेट में तीसरा तिहरा शतक जड़ने से चूक गए थे. सहवाग ने खेले 104 टेस्ट मैचों में 49.34 के औसत से 8586 रन बनाए. और उन्हें गावस्कर के बाद भारत का दूसरा सर्वकालिक सर्वश्रेष्ठ ओपनर कहा जाता है. बहरहाल, सहवाग की जैसे ही हॉल ऑफ फेम की खबर आई, तो उनके चाहने वालों ने वीरू की तारीफ में एक से बढ़कर एक प्रतिक्रिया दी. देखिए कि कैसे कमेंट कर रहे हैं वीरू के चाहने वालेVirender Sehwag ❤ play like bolwer be like: bhai kitna marega yaar ab to maf kar de— Aryan Pandey (@AryanPa66861306) November 13, 2023बात एकदम पूरी तरह सही हैOne of the most destructive opener in history of cricket #VirenderSehwag pic.twitter.com/4XZv14Hhk5— CricWiz (@CricWizTalks) November 13, 2023टेस्ट क्रिकेट खेलना वीरू ने सिखायाOne of the legend in Indian cricket.....test me kaise khelte hai Viru bhai ne shikhaya...— Hriday Singh (@hridaysingh16) November 13, 2023इसमें भी कोई दो राय नहीं हैHe used to take the game away within 10 overs— Dom (@diligent_three) November 13, 2023","pubDate":"2023-11-13 16:25:17","image_url":"https://c.ndtvimg.com/2023-06/f6mqt16o_virender-sehwag-prediction-_120x90_27_June_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"}]}