{"newsArray":[{"title":"Heartbreaking defeat for Ireland as Bangladesh claim a 2-0 series victory","link":"https://www.cricketireland.ie/news/article/heartbreaking-defeat-for-ireland-as-bangladesh-claim-a-2-0-series-victory","keywords":null,"creator":null,"video_url":null,"description":"CHELMSFORD – Despite half-centuries from Paul Stirling, Andrew Balbirnie and Lorcan Tucker, along with a four-wicket haul from Mark Adair, Ireland Men fell agonisingly four runs short as Bangladesh prevailed in a topsy-turvy series finale at Chelmsford. A Mustafizur Rahman death bowling masterclass stopped Ireland in their tracks just as they looked to have a chase of 275 under their control.","content":"On a gloomy morning at Chelmsford, Balbirnie won the toss and chose to bowl first. Ireland’s new ball pair of Josh Little and Adair were threatening from the outset. Adair had a close lbw shout off Rony Tadulkar turned down off his sixth ball shortly before Little, who took a little longer than Adair to find his radar, extracted an edge from the bat of Tamim Iqbal only to see Balbirnie shell the chance at slip. Adair deservedly made an early breakthrough in his second over after Tadulkar nicked an attempted expansive heave through to Tucker behind the stumps. Little created chances at the other end but with little reward, with Bangladesh number three Najmul Hossain Shanto twice edging Little to the boundary in his first seven balls at the crease. The diminutive left-hander soon found his rhythm, strumming elegant boundaries off both of Ireland’s opening bowlers. Shanto raced to 35 off 31 deliveries before he was dismissed by Craig Young – returning to the Ireland side in place of Graham Hume – courtesy of a smart catch by Balbirnie at second slip. Tamim and Litton Das continued to score briskly despite the Bangladesh captain being unusually starved of the strike, facing just 28 balls in the first 16 overs of the match. At that point, Bangladesh were 98-2 and on course for a score in excess of 300. Their momentum was halted somewhat by the off-spin of Andy McBrine. Despite Das hitting him for six over long-on early in his spell, McBrine was able to offer control conceding just 16 runs from his opening four overs. He was rewarded with the wicket of the dangerous Das who was caught by Adair at mid-off. Tamim passed 50 but Bangladesh’s scoring rate had started to slow down. Towhid Hridoy came and went, falling to the final delivery of George Dockrell’s first over to bring the experienced Mushfiqur Rahim into the game. Ireland continued to make inroads at regular intervals; Tamim was Dockrell’s second victim, falling for 69, and while Rahim and Mehidy Hasan Miraz put on a fifty-run partnership for the sixth wicket, it wasn’t at a hurtling pace. At 255-5 after 45 overs, Bangladesh once more briefly threatened to post a total in the region of 300 but McBrine, and in particular Adair put paid to that idea, ensuring that Bangladesh were bowled out for 274 with seven balls of the innings remaining. Adair finished with figures of 4-40; it was the third time that he’d taken a four-wicket haul for Ireland in ODI cricket. The Ireland chase started slowly. There was no boundary in the opening four overs as Hasan Mahmud and Mustafizur Rahman both started well with the ball. Stephen Doheny fell to Rahman for five, edging one through to Litton Das at second slip off a ball that just angled away from him. Balbirnie and Stirling quietly picked up the scoring, always keeping the required run rate within reach. Stirling unleashed a succession of brutal hits that raced away to the fence while Balbirnie ticked the score along at a more than decent rate. Both batters passed fifty as they shared their seventh century partnership in ODI cricket, breaking the Irish record for the most 100-run stands in the format previously held by Stirling and William Porterfield. Unfortunately for Ireland, like with Tamim earlier in the contest, both Stirling and Balbirnie fell shortly after reaching their landmarks leaving Harry Tector, fresh from scoring a career-best 140 on Friday, and Lorcan Tucker to take over the mantle. Tector’s intent was on display for all to see earlier in his innings, taking the attack to Mehidy by hitting him for six over extra cover after the Bangladesh off-spinner had conceded his runs at less than three per over up until that point. With 14 overs to go, Ireland still had seven wickets remaining, but the asking rate had climbed to above seven runs per over. Tector and Tucker then went up another gear, taking 21 runs off Mrittunjoy Chowdhury’s seventh over and then after seeing through another quiet over from Mehidy, another 11 runs from Ebadot Hossain’s first over back into the attack. 62 runs were needed from the final 10 with the set pair of Tucker and Tector at the crease. Tector’s second six, a mighty blow off a slower delivery from Ebadot, took the asking rate below a run a ball with nine overs remaining – Ireland were in control of the contest. The game’s momentum then swung once more after Tamim made the inspired decision to introduce Shanto, a man who had previously never taken a wicket in international cricket, into the attack at the business end of the run chase. Shanto removed Tector for 45 with his fifth delivery thanks to an excellent catch from Das in the deep. The loss of Tector was then compounded by Rahman’s dismissal of Curtis Campher the following over, this time Tamim taking a composed high catch. Rahman continued to demonstrate his death bowling prowess removing Dockrell and then Tucker for exactly fifty to suck all the momentum out of the Ireland run chase. He finished with figures of 10-1-44-4 as Ireland ultimately fell four runs short, with runs hard to come by towards the end of their innings, in a not dissimilar manner to Bangladesh’s earlier in the day, despite some lusty blows from Adair that took the contest to its final over. Defeat for Ireland means that Bangladesh take the series 2-0, but despite losing the series, the performance by Ireland in this series shows real progression from the Bangladesh ODI series earlier in the year. Next up for Ireland is a three-day game back in Essex at the end of the month before a trip to Lord’s to face England in June. Ireland v Bangladesh, 3rd ODI, County Ground, Chelmsford, 14 May 2023 Bangladesh 274 (48.5 overs; Tamim Iqbal 69; Mark Adair 4-40) Ireland 270-9 (50 overs; Paul Stirling 60, Andy Balbirnie 53, Lorcan Tucker 50; Mustafizur Rahman 4-44) Bangladesh won by four runs See full scorecard","pubDate":"2023-05-14 18:56:37","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"I do not have an answer for that performance, says Rajasthan Royals skipper Samson","link":"https://www.thehindu.com/sport/cricket/i-do-not-have-an-answer-for-that-performance-says-rajasthan-royals-skipper-samson/article66851237.ece","keywords":null,"creator":null,"video_url":null,"description":"Faf du Plessis' RCB won the match by 112 runs after posting 171 for five","content":"Rajasthan Royals skipper Sanju Samson had \"no answer\" to the dismal performance his batters dished out in the match against Royal Challengers Bangalore on Sunday, getting bundled out for 59, the third-lowest innings total ever in the IPL. Faf du Plessis' RCB won the match by 112 runs after posting 171 for five. The visitors finished off the opposition in just 10.3 overs with South African quick Wayne Parnell emerging the most successful bowler with 3/10 from three overs. The famed Royals batting simply crumbled with the home team reduced to 5/28 in powerplay from which it could never recover. On the floundering campaign in the second half of the IPL, Samson said, \"That is a great question, actually. I was thinking about it and where it went wrong. Sorry, I do not have an answer for that.\" Four Royals batters, including openers Jos Buttler and Yashasvi Jaiswal, were out for duck, while Sanju Samson could only score four runs. Samson, though, put up a brave front saying IPL is a tournament where a turnaround can happen within a couple of days. \"We all know the nature of the IPL. We know things can change in a couple of days. Funny, funny things happen at the end of the league stages. We have to be strong, be professional and think about the game we are playing in Dharamsala. You have to keep your hopes high and try your best,\" he added. The margin of defeat means the Royals' net run rate has taken a severe beating even as RCB leapfrogged them on the points table to be placed fifth with 12 points, while RR, stranded on 12 points, dropped to sixth. The Royals skipper said their strategy to go hard in powerplays had come unstuck, adding that his batters had little choice but to take risks, given the wicket was going to slow down as their innings progressed. \"We usually go hard in the powerplay but that did not quite happen today. It will take some time to assess our display. That is the nature of T20 cricket, you have to go hard in the powerplay, knowing that the wicket will slow down. \"Today, it did not work out. That (match) could have gone to the wire, it could have been a tight match if we had a decent powerplay. I felt that (RCB's score) was a par score on this wicket.\" RCB skipper du Plessis said the improvement in the net run rate (NRR) after the big win will do his side a world of good. He added the pitch was really difficult to bat on and that the later order batting by Anuj Rawat (29 not out) helped the team past 160. \"We needed it, in terms of the NRR. It was a really difficult pitch when we batted first. Even in the powerplay, the ball was keeping low and we felt that 160 would be a good score. Those hits towards the end pushed us to a very good score. We have not quite managed to do it (finish off strongly) well.\"","pubDate":"2023-05-14 18:06:08","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"VIDEO: धोनी के ऑटोग्राफ में भी जादू! अनुज रावत के ग्लव्स लगा था माही का ठप्पा, फिर बिना देखे उड़ाई गिल्लियां","link":"https://hindi.news18.com/news/sports/cricket-anuj-rawat-dismissed-the-batter-without-looking-at-dhoni-autographed-gloves-in-rr-vs-rcb-watch-video-6198753.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आरसीबी ने राजस्थान को करारी मात देकर प्लेऑफ की उम्मीदों को बरकरार रखा है. इस मैच में आरसीबी की तरफ से अनुज रावत में एमएस धोनी की विकेटकीपिंग की झलक देखने को मिली. जिसका वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है.","content":"राजस्थान के खिलाफ अनुज रावत ने शानदार विकेटकीपिंग की. (Screengrab) नई दिल्ली. टीम इंडिया के पूर्व कप्तान एमएस धोनी (MS Dhoni) दुनिया के टॉप विकेटकीपर्स में से एक हैं. धोनी ने विकेट के पीछे से बिजली की तेजी से कई बैटर्स को पवेलियन का रास्ता दिखाया है. वहीं, बिना देखे विकेट्स हिट करने का टैलेंट धोनी के अलावा शायद ही किसी विकेटकीपर में देखने को मिला है. लेकिन इस सीजन आरसीबी के अनुज रावत (Anuj Rawat) में एमएस धोनी ये झलक देखने को मिली है. लेकिन इत्तेफाक यह है कि जिन ग्लव्स का इस्तेमाल अनुज रावत ने किया उसपर माही के ऑटोग्राफ की फोटो सोशल मीडिया पर देखने को मिली है. राजस्थान के खिलाफ मैच में अनुज रावत ने विकेट के पीछे से बेहतरीन प्रदर्शन किया. मैच के अहम मोड़ पर शिमरोन हेटमायर ने एक शानदार शॉट खेलने के बाद दो रन चुराने की कोशिश की. लेकिन गेंद सिराज का गोली की गति से थ्रो और अनुज रावत की अनदेखी विकेटकीपिंग ने उनके प्लान पर पानी फेर दिया. अनुज रावत ने धोनी के अंदाज में बिना देखे ही आर अश्विन की गिल्लियां उड़ा दीं. जिसका वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है. इसी के साथ एक फोटो और सामने आई है जिसमें देखा जा सकता है कि अनुज रावत धोनी के साइन वाले ग्सव्स पहने नजर आ रहे हैं. One of the best glove work in IPL history – Anuj Rawat. pic.twitter.com/hW7FpspcCw — Johns. (@CricCrazyJohns) May 14, 2023 राजस्थान की उम्मीदों पर फिरा पानी राजस्थान के लिए प्लेऑफ के लिहाज से हर एक मुकाबला करो या मरो की स्थिति से समान था. लेकिन अब आरसीबी से हार झेलने के बाद इस टीम के लिए प्लेऑफ के दरवाजे लगभग बंद हो चुके हैं. आरसीबी के सामने राजस्थान की टीम में विकेटों की पतझड़ देखने को मिली और पूरी टीम महज 59 रन पर ही सिमट गई. वहीं, आरसीबी को अगले 2 मैच जीतने के साथ दूसरी टीमों के नतीजों पर भी निर्भर रहना होगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , Ms dhoni , RR vs RCB भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 17:32:29","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/anuj-rawat-16840853903x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PCB ने किया ऐलान, बाबर आजम का होगा सख्‍त इम्तिहान, अब तक इस चुनौती के आगे रहे हैं नाकाम","link":"https://hindi.news18.com/news/sports/cricket-pcb-announced-schedule-of-australia-tour-three-test-series-will-be-challenging-for-babar-azam-6197231.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"एशिया कप 2023 और भारत में होने वाले वनडे वर्ल्‍ड कप में पाकिस्‍तान टीम की भागीदारी के सस्‍पेंस के बीच पीसीबी ने रविवार को एक ऐलान किया जो कप्‍तान बाबर आजम के लिए बेहद चुनौतीपूर्ण होगा. इस दौरान ना सिर्फ बाबर की कप्‍तानी बल्कि उनकी बैटिंग स्किल का भी सख्‍त इम्तिहान होगा.","content":"बाबर आजम के फैंस उनकी तुलना विराट कोहली से करते हैं. (AFP) नई दिल्‍ली. पाकिस्तान क्रिकेट टीम इस साल के आखिर में तीन मैचों की बेनड-कादिर ट्रॉफी टेस्ट सीरीज के लिए ऑस्ट्रेलिया का दौरा करेगी. ये तीनों ही मैच वर्ल्ड टेस्ट चैंपियनशिप साइकल के लिहाज से पाकिस्तान के लिए बेहद अहम होंगे. रविवार को पीसीबी ने इस बाबत एक ट्वीट किया. ऑस्ट्रेलिया और पाकिस्‍तान के बीच तीन मैचों की सीरीज के शुरुआत 14 दिसंबर से पर्थ में होने वाले पहले टेस्ट मैच से होगी. इसके बाद बॉक्सिंग डे टेस्ट मैच मेलबर्न क्रिकेट ग्राउंड में 26 दिसंबर से खेला जाएगा. सीरीज का आखिरी टेस्‍ट 3 जनवरी से सिडनी में होगा. बता दें कि वर्ल्‍ड टेस्‍ट चैंपियनशिप 2023 का फाइनल भारत और ऑस्ट्रेलिया के बीच 7 जून से इंग्लैंड के द ओवल में खेला जाएगा. बाबर आजम का तीसरा ऑस्ट्रेलिया दौरा पाकिस्‍तान टीम के कप्‍तान बाबर आजम का बतौर खिलाड़ी यह तीसरा ऑस्ट्रेलियाई दौरा होगा. इससे पहले वह 2016 में मिस्बाह-उल-हक की कप्तानी में और 2019 में अजहर अली की अगुआई में ऑस्ट्रेलिया गए थे. 2016 में बाबर कंगारुओं के बॉलिंग अटैक के सामने पूरी तरह फ्लॉप रहे. तीन टेस्‍ट मैचों की छह पारियों में वह कुल 68 रन ही बना पाए. 2019 का दौरा पहले से कुछ बेहतर रहा. बाबर आजम ने दो टेस्‍ट मैचों की चार पारियों में एक शतक के साथ 210 रन बनाए. न्‍यूजीलैंड के खिलाफ टी20 और वनडे सीरीज में शतक जड़ने वाले बाबर पहली बार ऑस्ट्रेलिया में पाकिस्‍तान टीम की अगुआई भी करेंगे. पाकिस्‍तान को World Cup जिताया, टीम से बेइज्‍जत कर निकाला, 14 खिलाड़ियों से गिड़गिड़ाया था यह दिग्गज वर्ल्‍ड कप जीतना और ऑस्ट्रेलिया को हराना है लक्ष्‍य पाकिस्‍तान टीम के अक्‍टूबर-नवंबर में होने वाले वनडे वर्ल्‍ड कप के लिए भारत आने पर भले ही सस्‍पेंस बरकरार हो, लेकिन टीम के निदेशक मिकी आर्थर पहले ही कह चुके हैं कि 2023 वर्ल्‍ड कप जीतना पाकिस्‍तान के लिए सबसे बड़ा लक्ष्‍य है. इसके बाद वह अगली कठिन चुनौती ऑस्ट्रेलिया को उसकी सरजमीं पर टेस्‍ट सीरीज में हराने को मानते हैं. साउथ अफ्रीका को ऑस्ट्रेलिया में जीत दिला चुके मिकी ऑर्थर का मानना है कि पाकिस्‍तान के लिए भी ऐसा करना मुमकिन है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Australia Cricket Team , Babar Azam , Pakistan cricket team , Pcb भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 16:44:37","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Virat-Kohli-Babar-Azam-AFP-16793921253x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"माफ कीजिएगा... मेरे पास इसका जवाब नहीं है... संजू सैमसन ने क्यों कहा ऐसा? जानिए","link":"https://hindi.news18.com/news/sports/cricket-sanju-samson-told-i-do-not-think-i-have-an-answer-to-that-yet-after-loses-royal-challengers-banglore-6198269.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आरसीबी ने राजस्थान को 112 रन से हराकर प्लेऑफ की दौड़ में खुद को बरकरार रखा है. राजस्थान ने आईपीएल इतिहास का तीसरा सबसे कम स्कोर बनाया. उसके 9 बैटर दहाई का आंकड़ा भी नहीं छू सके.","content":"संजू सैमसन ने आरसीबी के खिलाफ हार के बाद दी प्रतिक्रिया. (Instagram) नई दिल्ली. रॉयल चैलेंजर्स बैंगलोर के खिलाफ जब राजस्थान रॉयल्स (RR vs RCB) की टीम आईपीएल के 60वें मैच में ग्राउंड पर उतरी होगी तो, सपने में भी नहीं सोचा होगा कि प्लेऑफ से पहले उसका ये हश्र होगा. आरसीबी ने एकतरफा मैच में राजस्थान को शर्मनाक हार झेलने पर मजबूर कर दिया. मैच के बाद जब राजस्थान रॉयल्स के कप्तान संजू सैमसन (Sanju Samson) से टीम के लचर प्रदर्शन के बारे में पूछा गया तो उनके पास कोई जवाब नहीं था. आईपीएल इतिहास का तीसरा सबसे कम स्कोर बनाया जीत के लिए 172 रन के लक्ष्य का पीछा करते हुए राजस्थान की टीम आईपीएल इतिहास के तीसरे सबसे कम स्कोर पर सिमट गई. राजस्थान की टीम महज 10.3 ओवर बल्लेबाजी कर पाई और उसे 112 रन की बड़ी हार का सामना करना पड़ा. वेन पार्नेल (10/3), माइकल ब्रेसवेल (16/2) और कर्ण शर्मा (19/2) की उम्दा गेंदबाजी के सामने शिमरोन हेटमायर (19 गेंद में 35 रन) के अलावा राजस्थान का कोई भी बल्लेबाज नहीं चला. पावर प्ले में आधी टीम 28 रन पर पवेलियन लौट गई और इसके बाद उबर नहीं सकी. लीग के दूसरे हाफ में लगातार खराब प्रदर्शन के बारे में पूछे जाने पर सैमसन ने प्रसारकों से कहा, ‘वास्तव में यह एक बड़ा प्रश्न है. मैं इसके बारे में सोच रहा था और कहां गलती हुई. माफ कीजिएगा मेरे पास इसका जवाब नहीं है.’ यह भी पढ़ें: कौन हैं प्रभसिमरन सिंह… करियर के 18वें IPL मैच में जड़ी सेंचुरी… नीलामी में 4. 2 करोड़ का हुआ था नुकसान यशस्वी और बटलर खाता भी नहीं खोल सके अनुभवी ओपनर जोस बटलर और यशस्वी जायसवाल सहित राजस्थान के चार बल्लेबाज खाता खोले बगैर आउट हुए, जबकि संजू सैमसन केवल चार रन ही बना सके. सैमसन ने कहा कि आईपीएल एक ऐसा टूर्नामेंट है जहां कुछ ही दिनों में उलटफेर हो सकता है. बकौल सैमसन, ‘हम सभी आईपीएल के बारे में जानते हैं. हम जानते हैं कि कुछ दिनों में चीजें बदल सकती हैं. लीग चरणों के आखिर में मजेदार चीजें होती हैं. हमें मजबूत होना होगा, पेशेवर होना होगा और उस खेल के बारे में सोचना होगा.’ राजस्थान नेट रनरेट खराब हुआ बड़ी हार के कारण राजस्थान का नेट रन रेट खराब हुआ है. टीम 13 मैचों में 12 अंक के साथ छठे स्थान पर है. इस विकेटकीपर बल्लेबाज ने कहा कि टीम की योजना पावरप्ले में अधिक रन बनाने की थी क्योंकि बाद में रन बनाना मुश्किल होता. यह योजना हालांकि विफल रही. उन्होंने कहा, ‘ हम आमतौर पर पावरप्ले में आक्रामक बल्लेबाजी करते हैं लेकिन आज ऐसा नहीं हो पाया. हमारे प्रदर्शन का आकलन करने में कुछ समय लगेगा. टी20 क्रिकेट की यही प्रकृति है, आपको पावरप्ले में आक्रामक रूख अपनाना होता है. जब आपको पता है कि पिच बाद में धीमी हो जागी तो यह और जरूरी हो जाता है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , Jos Buttler , RR vs RCB , Sanju Samson भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 16:34:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Sanju-Samson-2-16840811513x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK vs KKR: शिवम दुबे के झन्‍नाटेदार छक्‍के से चीयरलीडर्स मैं भी फैली दशहत, बाल-बाल बची, इधर-उधर भागती दिखी","link":"https://hindi.news18.com/news/sports/cricket-csk-vs-kkr-shivam-dube-hit-six-ball-hit-cheerleader-who-got-injured-during-ipl-match-6198165.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"शिवम दुबे को भी उम्‍मीद नहीं होगी कि उनके इस शॉट से एक चीयरलीडर इस कदर घायल होते-होते बच सकती हैं. कोलकाता नाइटराइडर्स के खिलाफ मैच के दौरान वो सीएसके के लिए मुश्किल वक्‍त पर अहम पारी खेलते नजर आए. दुबे ने नाबाद 48 रन बनाए.","content":"शिवम दुबे सीएसके के लिए शानदार पारी खेल रहे हैं. (IPL/Screengrab) नई दिल्‍ली. चेन्‍नई सुपर किंग्‍स की टीम के बैटर शिवम दुबे ने कोलकाता नाइटराइउर्स के खिलाफ मैच के दौरान एक झन्‍नाटेदार छक्‍का जड़ा. वो इस शॉट के माध्‍यम से भले ही अपने और टीम के लिए छह रन प्राप्‍त करने में सफल रहे हों लेकिन इसके साथ ही मैच के दौरान दर्शकों का मनोरंजन कर रही चीयरलीडर में इससे दशहत फैल गई. छक्‍के के लिए जा रही गेंद एक चीयरलीडर को लगने से मामूली अंतर से बची. वो डर के मारे गेंद से बचती हुई नजर आई. यह घटना 12वें ओवर की पांचवीं गेंद पर सामने आई. गेंदबाजी अटैक पर सुयश शर्मा थे. गेंद ऑफ स्‍टंप के बेहद ज्‍यादा बाहर थी. ऐसे में दुबे ने इसपर प्रहार करने का मन बनाया. कवर्स की दिशा में उन्‍होंने हवाई शॉट लगाया. वहां पर ही बाउंड्री लाइन के बाहर चीयरलीडर्स का स्‍टेज बना हुआ है. ऐसे में गेंद चीयरलीडर्स के बीच से निकलते हुए छक्‍के के लिए गई. वो बाल-बाल गेंद से घायल होने से बच गई. गेंद से बचने हुए वो सभी दशहत में नजर आई. मैच के दौरान शिवम दुबे अपने अर्धशतक से दो रन से चूक गए. उन्‍होंने 34 गेंदों पर 48 रन की अहम पारी सीएसके के लिए खेली. केकेआर के खिलाफ मैच के दौरान दुबे ने तीन छक्‍के और एक चौका लगाया. उनके पहले ही छक्‍के के दौरान चीयरलीडर घायल होते-होते बच गई थी. मैच के दौरान सीएसके की टीम ने निर्धारित 20 ओवरों में छह विकेट के नुकसान पर 144 रन बनाए. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: CSK vs KKR , IPL 2023 , Shivam Dube भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 15:19:05","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shivam-Dube-cheerleader-16840784463x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Hybrid model for Asia Cup and beyond may end Pakistan-India &amp;#039;logjam&amp;#039; says PCB","link":"https://thehimalayantimes.com/sports/hybrid-model-for-asia-cup-and-beyond-may-end-pakistan-india-logjam-says-pcb","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD, PAKISTAN, MAY 14The Pakistan Cricket Board is still hopeful India agrees to its hybrid model of hosting majority of the Asia Cup games at a neutral venue in September....","content":null,"pubDate":"2023-05-14 15:14:39","image_url":"https://thehimalayantimes.com/thehimalayantimes/uploads/images/2023/05/14/23447.jpg","source_id":"thehimalayantimes","category":["sports"],"country":["Nepal"],"language":"english"},{"title":"CSK vs KKR Live Score, IPL 2023: Sunil Narine cleans up Ambati Rayudu, Moeen Ali in an over as Chennai go 5 down after MS Dhoni wins toss - The Indian Express","link":"https://news.google.com/rss/articles/CBMipAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY2hlbm5haS1zdXBlci1raW5ncy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZS1pcGwtMjAyMy1jc2stdnMta2tyLW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtdXBkYXRlcy04NjA4Mzg2L9IBqQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY2hlbm5haS1zdXBlci1raW5ncy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZS1pcGwtMjAyMy1jc2stdnMta2tyLW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtdXBkYXRlcy04NjA4Mzg2L2xpdGUv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs KKR Live Score, IPL 2023: Sunil Narine cleans up Ambati Rayudu, Moeen Ali in an over as Chennai go 5 down after MS Dhoni wins toss  The Indian ExpressCSK vs KKR Dream11 Prediction Today Match 61, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorMatch Preview - Super Kings vs KKR, Indian Premier League 2023, 61st Match  ESPNcricinfoCSK eye stress-free march into the Playoffs | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2023: CSK Look To Consolidate Playoffs Spot Against Downtrodden KKR  NDTVView Full coverage on Google News","content":null,"pubDate":"2023-05-14 15:09:25","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका","link":"https://hindi.news18.com/photogallery/sports/cricket-5-young-players-including-yashasvi-jaiswal-and-rinku-singh-are-in-race-for-emerging-player-ipl-2023-6197903.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 में एक से बढ़कर एक खिलाड़ी अपने प्रदर्शन से धूम मचा रहे हैं. इस सीजन में युवाओं और अनुभवी प्लेयर्स के बीच कांटे की टक्कर देखने को मिल रही है. एक तरफ पुराने चावल अपना जलवा बिखेर रहे हैं. वहीं, दूसरी तरफ इमर्जिंग प्लेयर की रेस में कई शानदार प्लेयर्स तहलका मचाते नजर आ रहे हैं. हम ऐसे ही टॉप-5 युवा प्लेयर्स की बात करने जा रहे हैं. जिन्होंने इस सीजन आते ही मौको को दोनों हाथों से लपका है.","content":null,"pubDate":"2023-05-14 14:56:16","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Yashasvi-Jaiswal-AP-1-3-16840754483x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB दिन के मैचों मे हो जाती है और भी खूंखार, बड़ो-बड़ों पर भारी, 2 टीमें खतरे में डालेंगी प्‍लेऑफ की दावेदारी!","link":"https://hindi.news18.com/news/sports/cricket-rr-vs-rcb-faf-du-plessis-lead-royal-challengers-bangalore-win-all-four-day-matches-in-ipl-2023-lose-6-in-night-6197735.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"रॉयल चैलेंजर्स बैंगलोर की टीम ने राजस्‍थान रॉयल्‍स को 112 रनों से मात दी. इस वक्‍त सभी टीमें प्‍लेऑफ में पहुंचने के नजरिए से करो-मरो की स्थिति में हैं. एक भी हार टूर्नामेंट में टॉप-4 में पहुंचने के सपने को तोड़ सकती है.","content":null,"pubDate":"2023-05-14 14:51:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/RCB-Playoff-Scenario-16840748203x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Heartbreaking defeat for Ireland as Bangladesh claim a 2-0 series victory","link":"https://www.cricketireland.ie/news/article/heartbreaking-defeat-for-ireland-as-bangladesh-claim-a-2-0-series-victory","keywords":null,"creator":null,"video_url":null,"description":"CHELMSFORD – Despite half-centuries from Paul Stirling, Andrew Balbirnie and Lorcan Tucker, along with a four-wicket haul from Mark Adair, Ireland Men fell agonisingly four runs short as Bangladesh prevailed in a topsy-turvy series finale at Chelmsford. A Mustafizur Rahman death bowling masterclass stopped Ireland in their tracks just as they looked to have a chase of 275 under their control.","content":"On a gloomy morning at Chelmsford, Balbirnie won the toss and chose to bowl first. Ireland’s new ball pair of Josh Little and Adair were threatening from the outset. Adair had a close lbw shout off Rony Tadulkar turned down off his sixth ball shortly before Little, who took a little longer than Adair to find his radar, extracted an edge from the bat of Tamim Iqbal only to see Balbirnie shell the chance at slip. Adair deservedly made an early breakthrough in his second over after Tadulkar nicked an attempted expansive heave through to Tucker behind the stumps. Little created chances at the other end but with little reward, with Bangladesh number three Najmul Hossain Shanto twice edging Little to the boundary in his first seven balls at the crease. The diminutive left-hander soon found his rhythm, strumming elegant boundaries off both of Ireland’s opening bowlers. Shanto raced to 35 off 31 deliveries before he was dismissed by Craig Young – returning to the Ireland side in place of Graham Hume – courtesy of a smart catch by Balbirnie at second slip. Tamim and Litton Das continued to score briskly despite the Bangladesh captain being unusually starved of the strike, facing just 28 balls in the first 16 overs of the match. At that point, Bangladesh were 98-2 and on course for a score in excess of 300. Their momentum was halted somewhat by the off-spin of Andy McBrine. Despite Das hitting him for six over long-on early in his spell, McBrine was able to offer control conceding just 16 runs from his opening four overs. He was rewarded with the wicket of the dangerous Das who was caught by Adair at mid-off. Tamim passed 50 but Bangladesh’s scoring rate had started to slow down. Towhid Hridoy came and went, falling to the final delivery of George Dockrell’s first over to bring the experienced Mushfiqur Rahim into the game. Ireland continued to make inroads at regular intervals; Tamim was Dockrell’s second victim, falling for 69, and while Rahim and Mehidy Hasan Miraz put on a fifty-run partnership for the sixth wicket, it wasn’t at a hurtling pace. At 255-5 after 45 overs, Bangladesh once more briefly threatened to post a total in the region of 300 but McBrine, and in particular Adair put paid to that idea, ensuring that Bangladesh were bowled out for 274 with seven balls of the innings remaining. Adair finished with figures of 4-40; it was the third time that he’d taken a four-wicket haul for Ireland in ODI cricket. The Ireland chase started slowly. There was no boundary in the opening four overs as Hasan Mahmud and Mustafizur Rahman both started well with the ball. Stephen Doheny fell to Rahman for five, edging one through to Litton Das at second slip off a ball that just angled away from him. Balbirnie and Stirling quietly picked up the scoring, always keeping the required run rate within reach. Stirling unleashed a succession of brutal hits that raced away to the fence while Balbirnie ticked the score along at a more than decent rate. Both batters passed fifty as they shared their seventh century partnership in ODI cricket, breaking the Irish record for the most 100-run stands in the format previously held by Stirling and William Porterfield. Unfortunately for Ireland, like with Tamim earlier in the contest, both Stirling and Balbirnie fell shortly after reaching their landmarks leaving Harry Tector, fresh from scoring a career-best 140 on Friday, and Lorcan Tucker to take over the mantle. Tector’s intent was on display for all to see earlier in his innings, taking the attack to Mehidy by hitting him for six over extra cover after the Bangladesh off-spinner had conceded his runs at less than three per over up until that point. With 14 overs to go, Ireland still had seven wickets remaining, but the asking rate had climbed to above seven runs per over. Tector and Tucker then went up another gear, taking 21 runs off Mrittunjoy Chowdhury’s seventh over and then after seeing through another quiet over from Mehidy, another 11 runs from Ebadot Hossain’s first over back into the attack. 62 runs were needed from the final 10 with the set pair of Tucker and Tector at the crease. Tector’s second six, a mighty blow off a slower delivery from Ebadot, took the asking rate below a run a ball with nine overs remaining – Ireland were in control of the contest. The game’s momentum then swung once more after Tamim made the inspired decision to introduce Shanto, a man who had previously never taken a wicket in international cricket, into the attack at the business end of the run chase. Shanto removed Tector for 45 with his fifth delivery thanks to an excellent catch from Das in the deep. The loss of Tector was then compounded by Rahman’s dismissal of Curtis Campher the following over, this time Tamim taking a composed high catch. Rahman continued to demonstrate his death bowling prowess removing Dockrell and then Tucker for exactly fifty to suck all the momentum out of the Ireland run chase. He finished with figures of 10-1-44-4 as Ireland ultimately fell four runs short, with runs hard to come by towards the end of their innings, in a not dissimilar manner to Bangladesh’s earlier in the day, despite some lusty blows from Adair that took the contest to its final over. Defeat for Ireland means that Bangladesh take the series 2-0, but despite losing the series, the performance by Ireland in this series shows real progression from the Bangladesh ODI series earlier in the year. Next up for Ireland is a three-day game back in Essex at the end of the month before a trip to Lord’s to face England in June. Ireland v Bangladesh, 3rd ODI, County Ground, Chelmsford, 14 May 2023 Bangladesh 274 (48.5 overs; Tamim Iqbal 69; Mark Adair 4-40) Ireland 270-9 (50 overs; Paul Stirling 60, Andy Balbirnie 53, Lorcan Tucker 50; Mustafizur Rahman 4-44) Bangladesh won by four runs See full scorecard","pubDate":"2023-05-14 18:56:37","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"I do not have an answer for that performance, says Rajasthan Royals skipper Samson","link":"https://www.thehindu.com/sport/cricket/i-do-not-have-an-answer-for-that-performance-says-rajasthan-royals-skipper-samson/article66851237.ece","keywords":null,"creator":null,"video_url":null,"description":"Faf du Plessis' RCB won the match by 112 runs after posting 171 for five","content":"Rajasthan Royals skipper Sanju Samson had \"no answer\" to the dismal performance his batters dished out in the match against Royal Challengers Bangalore on Sunday, getting bundled out for 59, the third-lowest innings total ever in the IPL. Faf du Plessis' RCB won the match by 112 runs after posting 171 for five. The visitors finished off the opposition in just 10.3 overs with South African quick Wayne Parnell emerging the most successful bowler with 3/10 from three overs. The famed Royals batting simply crumbled with the home team reduced to 5/28 in powerplay from which it could never recover. On the floundering campaign in the second half of the IPL, Samson said, \"That is a great question, actually. I was thinking about it and where it went wrong. Sorry, I do not have an answer for that.\" Four Royals batters, including openers Jos Buttler and Yashasvi Jaiswal, were out for duck, while Sanju Samson could only score four runs. Samson, though, put up a brave front saying IPL is a tournament where a turnaround can happen within a couple of days. \"We all know the nature of the IPL. We know things can change in a couple of days. Funny, funny things happen at the end of the league stages. We have to be strong, be professional and think about the game we are playing in Dharamsala. You have to keep your hopes high and try your best,\" he added. The margin of defeat means the Royals' net run rate has taken a severe beating even as RCB leapfrogged them on the points table to be placed fifth with 12 points, while RR, stranded on 12 points, dropped to sixth. The Royals skipper said their strategy to go hard in powerplays had come unstuck, adding that his batters had little choice but to take risks, given the wicket was going to slow down as their innings progressed. \"We usually go hard in the powerplay but that did not quite happen today. It will take some time to assess our display. That is the nature of T20 cricket, you have to go hard in the powerplay, knowing that the wicket will slow down. \"Today, it did not work out. That (match) could have gone to the wire, it could have been a tight match if we had a decent powerplay. I felt that (RCB's score) was a par score on this wicket.\" RCB skipper du Plessis said the improvement in the net run rate (NRR) after the big win will do his side a world of good. He added the pitch was really difficult to bat on and that the later order batting by Anuj Rawat (29 not out) helped the team past 160. \"We needed it, in terms of the NRR. It was a really difficult pitch when we batted first. Even in the powerplay, the ball was keeping low and we felt that 160 would be a good score. Those hits towards the end pushed us to a very good score. We have not quite managed to do it (finish off strongly) well.\"","pubDate":"2023-05-14 18:06:08","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"VIDEO: धोनी के ऑटोग्राफ में भी जादू! अनुज रावत के ग्लव्स लगा था माही का ठप्पा, फिर बिना देखे उड़ाई गिल्लियां","link":"https://hindi.news18.com/news/sports/cricket-anuj-rawat-dismissed-the-batter-without-looking-at-dhoni-autographed-gloves-in-rr-vs-rcb-watch-video-6198753.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आरसीबी ने राजस्थान को करारी मात देकर प्लेऑफ की उम्मीदों को बरकरार रखा है. इस मैच में आरसीबी की तरफ से अनुज रावत में एमएस धोनी की विकेटकीपिंग की झलक देखने को मिली. जिसका वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है.","content":"राजस्थान के खिलाफ अनुज रावत ने शानदार विकेटकीपिंग की. (Screengrab) नई दिल्ली. टीम इंडिया के पूर्व कप्तान एमएस धोनी (MS Dhoni) दुनिया के टॉप विकेटकीपर्स में से एक हैं. धोनी ने विकेट के पीछे से बिजली की तेजी से कई बैटर्स को पवेलियन का रास्ता दिखाया है. वहीं, बिना देखे विकेट्स हिट करने का टैलेंट धोनी के अलावा शायद ही किसी विकेटकीपर में देखने को मिला है. लेकिन इस सीजन आरसीबी के अनुज रावत (Anuj Rawat) में एमएस धोनी ये झलक देखने को मिली है. लेकिन इत्तेफाक यह है कि जिन ग्लव्स का इस्तेमाल अनुज रावत ने किया उसपर माही के ऑटोग्राफ की फोटो सोशल मीडिया पर देखने को मिली है. राजस्थान के खिलाफ मैच में अनुज रावत ने विकेट के पीछे से बेहतरीन प्रदर्शन किया. मैच के अहम मोड़ पर शिमरोन हेटमायर ने एक शानदार शॉट खेलने के बाद दो रन चुराने की कोशिश की. लेकिन गेंद सिराज का गोली की गति से थ्रो और अनुज रावत की अनदेखी विकेटकीपिंग ने उनके प्लान पर पानी फेर दिया. अनुज रावत ने धोनी के अंदाज में बिना देखे ही आर अश्विन की गिल्लियां उड़ा दीं. जिसका वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है. इसी के साथ एक फोटो और सामने आई है जिसमें देखा जा सकता है कि अनुज रावत धोनी के साइन वाले ग्सव्स पहने नजर आ रहे हैं. One of the best glove work in IPL history – Anuj Rawat. pic.twitter.com/hW7FpspcCw — Johns. (@CricCrazyJohns) May 14, 2023 राजस्थान की उम्मीदों पर फिरा पानी राजस्थान के लिए प्लेऑफ के लिहाज से हर एक मुकाबला करो या मरो की स्थिति से समान था. लेकिन अब आरसीबी से हार झेलने के बाद इस टीम के लिए प्लेऑफ के दरवाजे लगभग बंद हो चुके हैं. आरसीबी के सामने राजस्थान की टीम में विकेटों की पतझड़ देखने को मिली और पूरी टीम महज 59 रन पर ही सिमट गई. वहीं, आरसीबी को अगले 2 मैच जीतने के साथ दूसरी टीमों के नतीजों पर भी निर्भर रहना होगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , Ms dhoni , RR vs RCB भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 17:32:29","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/anuj-rawat-16840853903x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PCB ने किया ऐलान, बाबर आजम का होगा सख्‍त इम्तिहान, अब तक इस चुनौती के आगे रहे हैं नाकाम","link":"https://hindi.news18.com/news/sports/cricket-pcb-announced-schedule-of-australia-tour-three-test-series-will-be-challenging-for-babar-azam-6197231.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"एशिया कप 2023 और भारत में होने वाले वनडे वर्ल्‍ड कप में पाकिस्‍तान टीम की भागीदारी के सस्‍पेंस के बीच पीसीबी ने रविवार को एक ऐलान किया जो कप्‍तान बाबर आजम के लिए बेहद चुनौतीपूर्ण होगा. इस दौरान ना सिर्फ बाबर की कप्‍तानी बल्कि उनकी बैटिंग स्किल का भी सख्‍त इम्तिहान होगा.","content":"बाबर आजम के फैंस उनकी तुलना विराट कोहली से करते हैं. (AFP) नई दिल्‍ली. पाकिस्तान क्रिकेट टीम इस साल के आखिर में तीन मैचों की बेनड-कादिर ट्रॉफी टेस्ट सीरीज के लिए ऑस्ट्रेलिया का दौरा करेगी. ये तीनों ही मैच वर्ल्ड टेस्ट चैंपियनशिप साइकल के लिहाज से पाकिस्तान के लिए बेहद अहम होंगे. रविवार को पीसीबी ने इस बाबत एक ट्वीट किया. ऑस्ट्रेलिया और पाकिस्‍तान के बीच तीन मैचों की सीरीज के शुरुआत 14 दिसंबर से पर्थ में होने वाले पहले टेस्ट मैच से होगी. इसके बाद बॉक्सिंग डे टेस्ट मैच मेलबर्न क्रिकेट ग्राउंड में 26 दिसंबर से खेला जाएगा. सीरीज का आखिरी टेस्‍ट 3 जनवरी से सिडनी में होगा. बता दें कि वर्ल्‍ड टेस्‍ट चैंपियनशिप 2023 का फाइनल भारत और ऑस्ट्रेलिया के बीच 7 जून से इंग्लैंड के द ओवल में खेला जाएगा. बाबर आजम का तीसरा ऑस्ट्रेलिया दौरा पाकिस्‍तान टीम के कप्‍तान बाबर आजम का बतौर खिलाड़ी यह तीसरा ऑस्ट्रेलियाई दौरा होगा. इससे पहले वह 2016 में मिस्बाह-उल-हक की कप्तानी में और 2019 में अजहर अली की अगुआई में ऑस्ट्रेलिया गए थे. 2016 में बाबर कंगारुओं के बॉलिंग अटैक के सामने पूरी तरह फ्लॉप रहे. तीन टेस्‍ट मैचों की छह पारियों में वह कुल 68 रन ही बना पाए. 2019 का दौरा पहले से कुछ बेहतर रहा. बाबर आजम ने दो टेस्‍ट मैचों की चार पारियों में एक शतक के साथ 210 रन बनाए. न्‍यूजीलैंड के खिलाफ टी20 और वनडे सीरीज में शतक जड़ने वाले बाबर पहली बार ऑस्ट्रेलिया में पाकिस्‍तान टीम की अगुआई भी करेंगे. पाकिस्‍तान को World Cup जिताया, टीम से बेइज्‍जत कर निकाला, 14 खिलाड़ियों से गिड़गिड़ाया था यह दिग्गज वर्ल्‍ड कप जीतना और ऑस्ट्रेलिया को हराना है लक्ष्‍य पाकिस्‍तान टीम के अक्‍टूबर-नवंबर में होने वाले वनडे वर्ल्‍ड कप के लिए भारत आने पर भले ही सस्‍पेंस बरकरार हो, लेकिन टीम के निदेशक मिकी आर्थर पहले ही कह चुके हैं कि 2023 वर्ल्‍ड कप जीतना पाकिस्‍तान के लिए सबसे बड़ा लक्ष्‍य है. इसके बाद वह अगली कठिन चुनौती ऑस्ट्रेलिया को उसकी सरजमीं पर टेस्‍ट सीरीज में हराने को मानते हैं. साउथ अफ्रीका को ऑस्ट्रेलिया में जीत दिला चुके मिकी ऑर्थर का मानना है कि पाकिस्‍तान के लिए भी ऐसा करना मुमकिन है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Australia Cricket Team , Babar Azam , Pakistan cricket team , Pcb भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 16:44:37","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Virat-Kohli-Babar-Azam-AFP-16793921253x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"माफ कीजिएगा... मेरे पास इसका जवाब नहीं है... संजू सैमसन ने क्यों कहा ऐसा? जानिए","link":"https://hindi.news18.com/news/sports/cricket-sanju-samson-told-i-do-not-think-i-have-an-answer-to-that-yet-after-loses-royal-challengers-banglore-6198269.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आरसीबी ने राजस्थान को 112 रन से हराकर प्लेऑफ की दौड़ में खुद को बरकरार रखा है. राजस्थान ने आईपीएल इतिहास का तीसरा सबसे कम स्कोर बनाया. उसके 9 बैटर दहाई का आंकड़ा भी नहीं छू सके.","content":"संजू सैमसन ने आरसीबी के खिलाफ हार के बाद दी प्रतिक्रिया. (Instagram) नई दिल्ली. रॉयल चैलेंजर्स बैंगलोर के खिलाफ जब राजस्थान रॉयल्स (RR vs RCB) की टीम आईपीएल के 60वें मैच में ग्राउंड पर उतरी होगी तो, सपने में भी नहीं सोचा होगा कि प्लेऑफ से पहले उसका ये हश्र होगा. आरसीबी ने एकतरफा मैच में राजस्थान को शर्मनाक हार झेलने पर मजबूर कर दिया. मैच के बाद जब राजस्थान रॉयल्स के कप्तान संजू सैमसन (Sanju Samson) से टीम के लचर प्रदर्शन के बारे में पूछा गया तो उनके पास कोई जवाब नहीं था. आईपीएल इतिहास का तीसरा सबसे कम स्कोर बनाया जीत के लिए 172 रन के लक्ष्य का पीछा करते हुए राजस्थान की टीम आईपीएल इतिहास के तीसरे सबसे कम स्कोर पर सिमट गई. राजस्थान की टीम महज 10.3 ओवर बल्लेबाजी कर पाई और उसे 112 रन की बड़ी हार का सामना करना पड़ा. वेन पार्नेल (10/3), माइकल ब्रेसवेल (16/2) और कर्ण शर्मा (19/2) की उम्दा गेंदबाजी के सामने शिमरोन हेटमायर (19 गेंद में 35 रन) के अलावा राजस्थान का कोई भी बल्लेबाज नहीं चला. पावर प्ले में आधी टीम 28 रन पर पवेलियन लौट गई और इसके बाद उबर नहीं सकी. लीग के दूसरे हाफ में लगातार खराब प्रदर्शन के बारे में पूछे जाने पर सैमसन ने प्रसारकों से कहा, ‘वास्तव में यह एक बड़ा प्रश्न है. मैं इसके बारे में सोच रहा था और कहां गलती हुई. माफ कीजिएगा मेरे पास इसका जवाब नहीं है.’ यह भी पढ़ें: कौन हैं प्रभसिमरन सिंह… करियर के 18वें IPL मैच में जड़ी सेंचुरी… नीलामी में 4. 2 करोड़ का हुआ था नुकसान यशस्वी और बटलर खाता भी नहीं खोल सके अनुभवी ओपनर जोस बटलर और यशस्वी जायसवाल सहित राजस्थान के चार बल्लेबाज खाता खोले बगैर आउट हुए, जबकि संजू सैमसन केवल चार रन ही बना सके. सैमसन ने कहा कि आईपीएल एक ऐसा टूर्नामेंट है जहां कुछ ही दिनों में उलटफेर हो सकता है. बकौल सैमसन, ‘हम सभी आईपीएल के बारे में जानते हैं. हम जानते हैं कि कुछ दिनों में चीजें बदल सकती हैं. लीग चरणों के आखिर में मजेदार चीजें होती हैं. हमें मजबूत होना होगा, पेशेवर होना होगा और उस खेल के बारे में सोचना होगा.’ राजस्थान नेट रनरेट खराब हुआ बड़ी हार के कारण राजस्थान का नेट रन रेट खराब हुआ है. टीम 13 मैचों में 12 अंक के साथ छठे स्थान पर है. इस विकेटकीपर बल्लेबाज ने कहा कि टीम की योजना पावरप्ले में अधिक रन बनाने की थी क्योंकि बाद में रन बनाना मुश्किल होता. यह योजना हालांकि विफल रही. उन्होंने कहा, ‘ हम आमतौर पर पावरप्ले में आक्रामक बल्लेबाजी करते हैं लेकिन आज ऐसा नहीं हो पाया. हमारे प्रदर्शन का आकलन करने में कुछ समय लगेगा. टी20 क्रिकेट की यही प्रकृति है, आपको पावरप्ले में आक्रामक रूख अपनाना होता है. जब आपको पता है कि पिच बाद में धीमी हो जागी तो यह और जरूरी हो जाता है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , Jos Buttler , RR vs RCB , Sanju Samson भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 16:34:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Sanju-Samson-2-16840811513x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK vs KKR: शिवम दुबे के झन्‍नाटेदार छक्‍के से चीयरलीडर्स मैं भी फैली दशहत, बाल-बाल बची, इधर-उधर भागती दिखी","link":"https://hindi.news18.com/news/sports/cricket-csk-vs-kkr-shivam-dube-hit-six-ball-hit-cheerleader-who-got-injured-during-ipl-match-6198165.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"शिवम दुबे को भी उम्‍मीद नहीं होगी कि उनके इस शॉट से एक चीयरलीडर इस कदर घायल होते-होते बच सकती हैं. कोलकाता नाइटराइडर्स के खिलाफ मैच के दौरान वो सीएसके के लिए मुश्किल वक्‍त पर अहम पारी खेलते नजर आए. दुबे ने नाबाद 48 रन बनाए.","content":"शिवम दुबे सीएसके के लिए शानदार पारी खेल रहे हैं. (IPL/Screengrab) नई दिल्‍ली. चेन्‍नई सुपर किंग्‍स की टीम के बैटर शिवम दुबे ने कोलकाता नाइटराइउर्स के खिलाफ मैच के दौरान एक झन्‍नाटेदार छक्‍का जड़ा. वो इस शॉट के माध्‍यम से भले ही अपने और टीम के लिए छह रन प्राप्‍त करने में सफल रहे हों लेकिन इसके साथ ही मैच के दौरान दर्शकों का मनोरंजन कर रही चीयरलीडर में इससे दशहत फैल गई. छक्‍के के लिए जा रही गेंद एक चीयरलीडर को लगने से मामूली अंतर से बची. वो डर के मारे गेंद से बचती हुई नजर आई. यह घटना 12वें ओवर की पांचवीं गेंद पर सामने आई. गेंदबाजी अटैक पर सुयश शर्मा थे. गेंद ऑफ स्‍टंप के बेहद ज्‍यादा बाहर थी. ऐसे में दुबे ने इसपर प्रहार करने का मन बनाया. कवर्स की दिशा में उन्‍होंने हवाई शॉट लगाया. वहां पर ही बाउंड्री लाइन के बाहर चीयरलीडर्स का स्‍टेज बना हुआ है. ऐसे में गेंद चीयरलीडर्स के बीच से निकलते हुए छक्‍के के लिए गई. वो बाल-बाल गेंद से घायल होने से बच गई. गेंद से बचने हुए वो सभी दशहत में नजर आई. मैच के दौरान शिवम दुबे अपने अर्धशतक से दो रन से चूक गए. उन्‍होंने 34 गेंदों पर 48 रन की अहम पारी सीएसके के लिए खेली. केकेआर के खिलाफ मैच के दौरान दुबे ने तीन छक्‍के और एक चौका लगाया. उनके पहले ही छक्‍के के दौरान चीयरलीडर घायल होते-होते बच गई थी. मैच के दौरान सीएसके की टीम ने निर्धारित 20 ओवरों में छह विकेट के नुकसान पर 144 रन बनाए. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: CSK vs KKR , IPL 2023 , Shivam Dube भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 15:19:05","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shivam-Dube-cheerleader-16840784463x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Hybrid model for Asia Cup and beyond may end Pakistan-India &amp;#039;logjam&amp;#039; says PCB","link":"https://thehimalayantimes.com/sports/hybrid-model-for-asia-cup-and-beyond-may-end-pakistan-india-logjam-says-pcb","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD, PAKISTAN, MAY 14The Pakistan Cricket Board is still hopeful India agrees to its hybrid model of hosting majority of the Asia Cup games at a neutral venue in September....","content":null,"pubDate":"2023-05-14 15:14:39","image_url":"https://thehimalayantimes.com/thehimalayantimes/uploads/images/2023/05/14/23447.jpg","source_id":"thehimalayantimes","category":["sports"],"country":["Nepal"],"language":"english"},{"title":"CSK vs KKR Live Score, IPL 2023: Sunil Narine cleans up Ambati Rayudu, Moeen Ali in an over as Chennai go 5 down after MS Dhoni wins toss - The Indian Express","link":"https://news.google.com/rss/articles/CBMipAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY2hlbm5haS1zdXBlci1raW5ncy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZS1pcGwtMjAyMy1jc2stdnMta2tyLW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtdXBkYXRlcy04NjA4Mzg2L9IBqQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY2hlbm5haS1zdXBlci1raW5ncy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZS1pcGwtMjAyMy1jc2stdnMta2tyLW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtdXBkYXRlcy04NjA4Mzg2L2xpdGUv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs KKR Live Score, IPL 2023: Sunil Narine cleans up Ambati Rayudu, Moeen Ali in an over as Chennai go 5 down after MS Dhoni wins toss  The Indian ExpressCSK vs KKR Dream11 Prediction Today Match 61, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorMatch Preview - Super Kings vs KKR, Indian Premier League 2023, 61st Match  ESPNcricinfoCSK eye stress-free march into the Playoffs | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2023: CSK Look To Consolidate Playoffs Spot Against Downtrodden KKR  NDTVView Full coverage on Google News","content":null,"pubDate":"2023-05-14 15:09:25","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका","link":"https://hindi.news18.com/photogallery/sports/cricket-5-young-players-including-yashasvi-jaiswal-and-rinku-singh-are-in-race-for-emerging-player-ipl-2023-6197903.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 में एक से बढ़कर एक खिलाड़ी अपने प्रदर्शन से धूम मचा रहे हैं. इस सीजन में युवाओं और अनुभवी प्लेयर्स के बीच कांटे की टक्कर देखने को मिल रही है. एक तरफ पुराने चावल अपना जलवा बिखेर रहे हैं. वहीं, दूसरी तरफ इमर्जिंग प्लेयर की रेस में कई शानदार प्लेयर्स तहलका मचाते नजर आ रहे हैं. हम ऐसे ही टॉप-5 युवा प्लेयर्स की बात करने जा रहे हैं. जिन्होंने इस सीजन आते ही मौको को दोनों हाथों से लपका है.","content":null,"pubDate":"2023-05-14 14:56:16","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Yashasvi-Jaiswal-AP-1-3-16840754483x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB दिन के मैचों मे हो जाती है और भी खूंखार, बड़ो-बड़ों पर भारी, 2 टीमें खतरे में डालेंगी प्‍लेऑफ की दावेदारी!","link":"https://hindi.news18.com/news/sports/cricket-rr-vs-rcb-faf-du-plessis-lead-royal-challengers-bangalore-win-all-four-day-matches-in-ipl-2023-lose-6-in-night-6197735.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"रॉयल चैलेंजर्स बैंगलोर की टीम ने राजस्‍थान रॉयल्‍स को 112 रनों से मात दी. इस वक्‍त सभी टीमें प्‍लेऑफ में पहुंचने के नजरिए से करो-मरो की स्थिति में हैं. एक भी हार टूर्नामेंट में टॉप-4 में पहुंचने के सपने को तोड़ सकती है.","content":null,"pubDate":"2023-05-14 14:51:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/RCB-Playoff-Scenario-16840748203x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Heartbreaking defeat for Ireland as Bangladesh claim a 2-0 series victory","link":"https://www.cricketireland.ie/news/article/heartbreaking-defeat-for-ireland-as-bangladesh-claim-a-2-0-series-victory","keywords":null,"creator":null,"video_url":null,"description":"CHELMSFORD – Despite half-centuries from Paul Stirling, Andrew Balbirnie and Lorcan Tucker, along with a four-wicket haul from Mark Adair, Ireland Men fell agonisingly four runs short as Bangladesh prevailed in a topsy-turvy series finale at Chelmsford. A Mustafizur Rahman death bowling masterclass stopped Ireland in their tracks just as they looked to have a chase of 275 under their control.","content":"On a gloomy morning at Chelmsford, Balbirnie won the toss and chose to bowl first. Ireland’s new ball pair of Josh Little and Adair were threatening from the outset. Adair had a close lbw shout off Rony Tadulkar turned down off his sixth ball shortly before Little, who took a little longer than Adair to find his radar, extracted an edge from the bat of Tamim Iqbal only to see Balbirnie shell the chance at slip. Adair deservedly made an early breakthrough in his second over after Tadulkar nicked an attempted expansive heave through to Tucker behind the stumps. Little created chances at the other end but with little reward, with Bangladesh number three Najmul Hossain Shanto twice edging Little to the boundary in his first seven balls at the crease. The diminutive left-hander soon found his rhythm, strumming elegant boundaries off both of Ireland’s opening bowlers. Shanto raced to 35 off 31 deliveries before he was dismissed by Craig Young – returning to the Ireland side in place of Graham Hume – courtesy of a smart catch by Balbirnie at second slip. Tamim and Litton Das continued to score briskly despite the Bangladesh captain being unusually starved of the strike, facing just 28 balls in the first 16 overs of the match. At that point, Bangladesh were 98-2 and on course for a score in excess of 300. Their momentum was halted somewhat by the off-spin of Andy McBrine. Despite Das hitting him for six over long-on early in his spell, McBrine was able to offer control conceding just 16 runs from his opening four overs. He was rewarded with the wicket of the dangerous Das who was caught by Adair at mid-off. Tamim passed 50 but Bangladesh’s scoring rate had started to slow down. Towhid Hridoy came and went, falling to the final delivery of George Dockrell’s first over to bring the experienced Mushfiqur Rahim into the game. Ireland continued to make inroads at regular intervals; Tamim was Dockrell’s second victim, falling for 69, and while Rahim and Mehidy Hasan Miraz put on a fifty-run partnership for the sixth wicket, it wasn’t at a hurtling pace. At 255-5 after 45 overs, Bangladesh once more briefly threatened to post a total in the region of 300 but McBrine, and in particular Adair put paid to that idea, ensuring that Bangladesh were bowled out for 274 with seven balls of the innings remaining. Adair finished with figures of 4-40; it was the third time that he’d taken a four-wicket haul for Ireland in ODI cricket. The Ireland chase started slowly. There was no boundary in the opening four overs as Hasan Mahmud and Mustafizur Rahman both started well with the ball. Stephen Doheny fell to Rahman for five, edging one through to Litton Das at second slip off a ball that just angled away from him. Balbirnie and Stirling quietly picked up the scoring, always keeping the required run rate within reach. Stirling unleashed a succession of brutal hits that raced away to the fence while Balbirnie ticked the score along at a more than decent rate. Both batters passed fifty as they shared their seventh century partnership in ODI cricket, breaking the Irish record for the most 100-run stands in the format previously held by Stirling and William Porterfield. Unfortunately for Ireland, like with Tamim earlier in the contest, both Stirling and Balbirnie fell shortly after reaching their landmarks leaving Harry Tector, fresh from scoring a career-best 140 on Friday, and Lorcan Tucker to take over the mantle. Tector’s intent was on display for all to see earlier in his innings, taking the attack to Mehidy by hitting him for six over extra cover after the Bangladesh off-spinner had conceded his runs at less than three per over up until that point. With 14 overs to go, Ireland still had seven wickets remaining, but the asking rate had climbed to above seven runs per over. Tector and Tucker then went up another gear, taking 21 runs off Mrittunjoy Chowdhury’s seventh over and then after seeing through another quiet over from Mehidy, another 11 runs from Ebadot Hossain’s first over back into the attack. 62 runs were needed from the final 10 with the set pair of Tucker and Tector at the crease. Tector’s second six, a mighty blow off a slower delivery from Ebadot, took the asking rate below a run a ball with nine overs remaining – Ireland were in control of the contest. The game’s momentum then swung once more after Tamim made the inspired decision to introduce Shanto, a man who had previously never taken a wicket in international cricket, into the attack at the business end of the run chase. Shanto removed Tector for 45 with his fifth delivery thanks to an excellent catch from Das in the deep. The loss of Tector was then compounded by Rahman’s dismissal of Curtis Campher the following over, this time Tamim taking a composed high catch. Rahman continued to demonstrate his death bowling prowess removing Dockrell and then Tucker for exactly fifty to suck all the momentum out of the Ireland run chase. He finished with figures of 10-1-44-4 as Ireland ultimately fell four runs short, with runs hard to come by towards the end of their innings, in a not dissimilar manner to Bangladesh’s earlier in the day, despite some lusty blows from Adair that took the contest to its final over. Defeat for Ireland means that Bangladesh take the series 2-0, but despite losing the series, the performance by Ireland in this series shows real progression from the Bangladesh ODI series earlier in the year. Next up for Ireland is a three-day game back in Essex at the end of the month before a trip to Lord’s to face England in June. Ireland v Bangladesh, 3rd ODI, County Ground, Chelmsford, 14 May 2023 Bangladesh 274 (48.5 overs; Tamim Iqbal 69; Mark Adair 4-40) Ireland 270-9 (50 overs; Paul Stirling 60, Andy Balbirnie 53, Lorcan Tucker 50; Mustafizur Rahman 4-44) Bangladesh won by four runs See full scorecard","pubDate":"2023-05-14 18:56:37","image_url":null,"source_id":"cricketireland","category":["sports"],"country":["ireland"],"language":"english"},{"title":"I do not have an answer for that performance, says Rajasthan Royals skipper Samson","link":"https://www.thehindu.com/sport/cricket/i-do-not-have-an-answer-for-that-performance-says-rajasthan-royals-skipper-samson/article66851237.ece","keywords":null,"creator":null,"video_url":null,"description":"Faf du Plessis' RCB won the match by 112 runs after posting 171 for five","content":"Rajasthan Royals skipper Sanju Samson had \"no answer\" to the dismal performance his batters dished out in the match against Royal Challengers Bangalore on Sunday, getting bundled out for 59, the third-lowest innings total ever in the IPL. Faf du Plessis' RCB won the match by 112 runs after posting 171 for five. The visitors finished off the opposition in just 10.3 overs with South African quick Wayne Parnell emerging the most successful bowler with 3/10 from three overs. The famed Royals batting simply crumbled with the home team reduced to 5/28 in powerplay from which it could never recover. On the floundering campaign in the second half of the IPL, Samson said, \"That is a great question, actually. I was thinking about it and where it went wrong. Sorry, I do not have an answer for that.\" Four Royals batters, including openers Jos Buttler and Yashasvi Jaiswal, were out for duck, while Sanju Samson could only score four runs. Samson, though, put up a brave front saying IPL is a tournament where a turnaround can happen within a couple of days. \"We all know the nature of the IPL. We know things can change in a couple of days. Funny, funny things happen at the end of the league stages. We have to be strong, be professional and think about the game we are playing in Dharamsala. You have to keep your hopes high and try your best,\" he added. The margin of defeat means the Royals' net run rate has taken a severe beating even as RCB leapfrogged them on the points table to be placed fifth with 12 points, while RR, stranded on 12 points, dropped to sixth. The Royals skipper said their strategy to go hard in powerplays had come unstuck, adding that his batters had little choice but to take risks, given the wicket was going to slow down as their innings progressed. \"We usually go hard in the powerplay but that did not quite happen today. It will take some time to assess our display. That is the nature of T20 cricket, you have to go hard in the powerplay, knowing that the wicket will slow down. \"Today, it did not work out. That (match) could have gone to the wire, it could have been a tight match if we had a decent powerplay. I felt that (RCB's score) was a par score on this wicket.\" RCB skipper du Plessis said the improvement in the net run rate (NRR) after the big win will do his side a world of good. He added the pitch was really difficult to bat on and that the later order batting by Anuj Rawat (29 not out) helped the team past 160. \"We needed it, in terms of the NRR. It was a really difficult pitch when we batted first. Even in the powerplay, the ball was keeping low and we felt that 160 would be a good score. Those hits towards the end pushed us to a very good score. We have not quite managed to do it (finish off strongly) well.\"","pubDate":"2023-05-14 18:06:08","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"VIDEO: धोनी के ऑटोग्राफ में भी जादू! अनुज रावत के ग्लव्स लगा था माही का ठप्पा, फिर बिना देखे उड़ाई गिल्लियां","link":"https://hindi.news18.com/news/sports/cricket-anuj-rawat-dismissed-the-batter-without-looking-at-dhoni-autographed-gloves-in-rr-vs-rcb-watch-video-6198753.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आरसीबी ने राजस्थान को करारी मात देकर प्लेऑफ की उम्मीदों को बरकरार रखा है. इस मैच में आरसीबी की तरफ से अनुज रावत में एमएस धोनी की विकेटकीपिंग की झलक देखने को मिली. जिसका वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है.","content":"राजस्थान के खिलाफ अनुज रावत ने शानदार विकेटकीपिंग की. (Screengrab) नई दिल्ली. टीम इंडिया के पूर्व कप्तान एमएस धोनी (MS Dhoni) दुनिया के टॉप विकेटकीपर्स में से एक हैं. धोनी ने विकेट के पीछे से बिजली की तेजी से कई बैटर्स को पवेलियन का रास्ता दिखाया है. वहीं, बिना देखे विकेट्स हिट करने का टैलेंट धोनी के अलावा शायद ही किसी विकेटकीपर में देखने को मिला है. लेकिन इस सीजन आरसीबी के अनुज रावत (Anuj Rawat) में एमएस धोनी ये झलक देखने को मिली है. लेकिन इत्तेफाक यह है कि जिन ग्लव्स का इस्तेमाल अनुज रावत ने किया उसपर माही के ऑटोग्राफ की फोटो सोशल मीडिया पर देखने को मिली है. राजस्थान के खिलाफ मैच में अनुज रावत ने विकेट के पीछे से बेहतरीन प्रदर्शन किया. मैच के अहम मोड़ पर शिमरोन हेटमायर ने एक शानदार शॉट खेलने के बाद दो रन चुराने की कोशिश की. लेकिन गेंद सिराज का गोली की गति से थ्रो और अनुज रावत की अनदेखी विकेटकीपिंग ने उनके प्लान पर पानी फेर दिया. अनुज रावत ने धोनी के अंदाज में बिना देखे ही आर अश्विन की गिल्लियां उड़ा दीं. जिसका वीडियो सोशल मीडिया पर तेजी से वायरल हो रहा है. इसी के साथ एक फोटो और सामने आई है जिसमें देखा जा सकता है कि अनुज रावत धोनी के साइन वाले ग्सव्स पहने नजर आ रहे हैं. One of the best glove work in IPL history – Anuj Rawat. pic.twitter.com/hW7FpspcCw — Johns. (@CricCrazyJohns) May 14, 2023 राजस्थान की उम्मीदों पर फिरा पानी राजस्थान के लिए प्लेऑफ के लिहाज से हर एक मुकाबला करो या मरो की स्थिति से समान था. लेकिन अब आरसीबी से हार झेलने के बाद इस टीम के लिए प्लेऑफ के दरवाजे लगभग बंद हो चुके हैं. आरसीबी के सामने राजस्थान की टीम में विकेटों की पतझड़ देखने को मिली और पूरी टीम महज 59 रन पर ही सिमट गई. वहीं, आरसीबी को अगले 2 मैच जीतने के साथ दूसरी टीमों के नतीजों पर भी निर्भर रहना होगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , Ms dhoni , RR vs RCB भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 17:32:29","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/anuj-rawat-16840853903x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"PCB ने किया ऐलान, बाबर आजम का होगा सख्‍त इम्तिहान, अब तक इस चुनौती के आगे रहे हैं नाकाम","link":"https://hindi.news18.com/news/sports/cricket-pcb-announced-schedule-of-australia-tour-three-test-series-will-be-challenging-for-babar-azam-6197231.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"एशिया कप 2023 और भारत में होने वाले वनडे वर्ल्‍ड कप में पाकिस्‍तान टीम की भागीदारी के सस्‍पेंस के बीच पीसीबी ने रविवार को एक ऐलान किया जो कप्‍तान बाबर आजम के लिए बेहद चुनौतीपूर्ण होगा. इस दौरान ना सिर्फ बाबर की कप्‍तानी बल्कि उनकी बैटिंग स्किल का भी सख्‍त इम्तिहान होगा.","content":"बाबर आजम के फैंस उनकी तुलना विराट कोहली से करते हैं. (AFP) नई दिल्‍ली. पाकिस्तान क्रिकेट टीम इस साल के आखिर में तीन मैचों की बेनड-कादिर ट्रॉफी टेस्ट सीरीज के लिए ऑस्ट्रेलिया का दौरा करेगी. ये तीनों ही मैच वर्ल्ड टेस्ट चैंपियनशिप साइकल के लिहाज से पाकिस्तान के लिए बेहद अहम होंगे. रविवार को पीसीबी ने इस बाबत एक ट्वीट किया. ऑस्ट्रेलिया और पाकिस्‍तान के बीच तीन मैचों की सीरीज के शुरुआत 14 दिसंबर से पर्थ में होने वाले पहले टेस्ट मैच से होगी. इसके बाद बॉक्सिंग डे टेस्ट मैच मेलबर्न क्रिकेट ग्राउंड में 26 दिसंबर से खेला जाएगा. सीरीज का आखिरी टेस्‍ट 3 जनवरी से सिडनी में होगा. बता दें कि वर्ल्‍ड टेस्‍ट चैंपियनशिप 2023 का फाइनल भारत और ऑस्ट्रेलिया के बीच 7 जून से इंग्लैंड के द ओवल में खेला जाएगा. बाबर आजम का तीसरा ऑस्ट्रेलिया दौरा पाकिस्‍तान टीम के कप्‍तान बाबर आजम का बतौर खिलाड़ी यह तीसरा ऑस्ट्रेलियाई दौरा होगा. इससे पहले वह 2016 में मिस्बाह-उल-हक की कप्तानी में और 2019 में अजहर अली की अगुआई में ऑस्ट्रेलिया गए थे. 2016 में बाबर कंगारुओं के बॉलिंग अटैक के सामने पूरी तरह फ्लॉप रहे. तीन टेस्‍ट मैचों की छह पारियों में वह कुल 68 रन ही बना पाए. 2019 का दौरा पहले से कुछ बेहतर रहा. बाबर आजम ने दो टेस्‍ट मैचों की चार पारियों में एक शतक के साथ 210 रन बनाए. न्‍यूजीलैंड के खिलाफ टी20 और वनडे सीरीज में शतक जड़ने वाले बाबर पहली बार ऑस्ट्रेलिया में पाकिस्‍तान टीम की अगुआई भी करेंगे. पाकिस्‍तान को World Cup जिताया, टीम से बेइज्‍जत कर निकाला, 14 खिलाड़ियों से गिड़गिड़ाया था यह दिग्गज वर्ल्‍ड कप जीतना और ऑस्ट्रेलिया को हराना है लक्ष्‍य पाकिस्‍तान टीम के अक्‍टूबर-नवंबर में होने वाले वनडे वर्ल्‍ड कप के लिए भारत आने पर भले ही सस्‍पेंस बरकरार हो, लेकिन टीम के निदेशक मिकी आर्थर पहले ही कह चुके हैं कि 2023 वर्ल्‍ड कप जीतना पाकिस्‍तान के लिए सबसे बड़ा लक्ष्‍य है. इसके बाद वह अगली कठिन चुनौती ऑस्ट्रेलिया को उसकी सरजमीं पर टेस्‍ट सीरीज में हराने को मानते हैं. साउथ अफ्रीका को ऑस्ट्रेलिया में जीत दिला चुके मिकी ऑर्थर का मानना है कि पाकिस्‍तान के लिए भी ऐसा करना मुमकिन है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Australia Cricket Team , Babar Azam , Pakistan cricket team , Pcb भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 16:44:37","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Virat-Kohli-Babar-Azam-AFP-16793921253x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"माफ कीजिएगा... मेरे पास इसका जवाब नहीं है... संजू सैमसन ने क्यों कहा ऐसा? जानिए","link":"https://hindi.news18.com/news/sports/cricket-sanju-samson-told-i-do-not-think-i-have-an-answer-to-that-yet-after-loses-royal-challengers-banglore-6198269.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आरसीबी ने राजस्थान को 112 रन से हराकर प्लेऑफ की दौड़ में खुद को बरकरार रखा है. राजस्थान ने आईपीएल इतिहास का तीसरा सबसे कम स्कोर बनाया. उसके 9 बैटर दहाई का आंकड़ा भी नहीं छू सके.","content":"संजू सैमसन ने आरसीबी के खिलाफ हार के बाद दी प्रतिक्रिया. (Instagram) नई दिल्ली. रॉयल चैलेंजर्स बैंगलोर के खिलाफ जब राजस्थान रॉयल्स (RR vs RCB) की टीम आईपीएल के 60वें मैच में ग्राउंड पर उतरी होगी तो, सपने में भी नहीं सोचा होगा कि प्लेऑफ से पहले उसका ये हश्र होगा. आरसीबी ने एकतरफा मैच में राजस्थान को शर्मनाक हार झेलने पर मजबूर कर दिया. मैच के बाद जब राजस्थान रॉयल्स के कप्तान संजू सैमसन (Sanju Samson) से टीम के लचर प्रदर्शन के बारे में पूछा गया तो उनके पास कोई जवाब नहीं था. आईपीएल इतिहास का तीसरा सबसे कम स्कोर बनाया जीत के लिए 172 रन के लक्ष्य का पीछा करते हुए राजस्थान की टीम आईपीएल इतिहास के तीसरे सबसे कम स्कोर पर सिमट गई. राजस्थान की टीम महज 10.3 ओवर बल्लेबाजी कर पाई और उसे 112 रन की बड़ी हार का सामना करना पड़ा. वेन पार्नेल (10/3), माइकल ब्रेसवेल (16/2) और कर्ण शर्मा (19/2) की उम्दा गेंदबाजी के सामने शिमरोन हेटमायर (19 गेंद में 35 रन) के अलावा राजस्थान का कोई भी बल्लेबाज नहीं चला. पावर प्ले में आधी टीम 28 रन पर पवेलियन लौट गई और इसके बाद उबर नहीं सकी. लीग के दूसरे हाफ में लगातार खराब प्रदर्शन के बारे में पूछे जाने पर सैमसन ने प्रसारकों से कहा, ‘वास्तव में यह एक बड़ा प्रश्न है. मैं इसके बारे में सोच रहा था और कहां गलती हुई. माफ कीजिएगा मेरे पास इसका जवाब नहीं है.’ यह भी पढ़ें: कौन हैं प्रभसिमरन सिंह… करियर के 18वें IPL मैच में जड़ी सेंचुरी… नीलामी में 4. 2 करोड़ का हुआ था नुकसान यशस्वी और बटलर खाता भी नहीं खोल सके अनुभवी ओपनर जोस बटलर और यशस्वी जायसवाल सहित राजस्थान के चार बल्लेबाज खाता खोले बगैर आउट हुए, जबकि संजू सैमसन केवल चार रन ही बना सके. सैमसन ने कहा कि आईपीएल एक ऐसा टूर्नामेंट है जहां कुछ ही दिनों में उलटफेर हो सकता है. बकौल सैमसन, ‘हम सभी आईपीएल के बारे में जानते हैं. हम जानते हैं कि कुछ दिनों में चीजें बदल सकती हैं. लीग चरणों के आखिर में मजेदार चीजें होती हैं. हमें मजबूत होना होगा, पेशेवर होना होगा और उस खेल के बारे में सोचना होगा.’ राजस्थान नेट रनरेट खराब हुआ बड़ी हार के कारण राजस्थान का नेट रन रेट खराब हुआ है. टीम 13 मैचों में 12 अंक के साथ छठे स्थान पर है. इस विकेटकीपर बल्लेबाज ने कहा कि टीम की योजना पावरप्ले में अधिक रन बनाने की थी क्योंकि बाद में रन बनाना मुश्किल होता. यह योजना हालांकि विफल रही. उन्होंने कहा, ‘ हम आमतौर पर पावरप्ले में आक्रामक बल्लेबाजी करते हैं लेकिन आज ऐसा नहीं हो पाया. हमारे प्रदर्शन का आकलन करने में कुछ समय लगेगा. टी20 क्रिकेट की यही प्रकृति है, आपको पावरप्ले में आक्रामक रूख अपनाना होता है. जब आपको पता है कि पिच बाद में धीमी हो जागी तो यह और जरूरी हो जाता है. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: IPL 2023 , Jos Buttler , RR vs RCB , Sanju Samson भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 16:34:36","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Sanju-Samson-2-16840811513x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"CSK vs KKR: शिवम दुबे के झन्‍नाटेदार छक्‍के से चीयरलीडर्स मैं भी फैली दशहत, बाल-बाल बची, इधर-उधर भागती दिखी","link":"https://hindi.news18.com/news/sports/cricket-csk-vs-kkr-shivam-dube-hit-six-ball-hit-cheerleader-who-got-injured-during-ipl-match-6198165.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"शिवम दुबे को भी उम्‍मीद नहीं होगी कि उनके इस शॉट से एक चीयरलीडर इस कदर घायल होते-होते बच सकती हैं. कोलकाता नाइटराइडर्स के खिलाफ मैच के दौरान वो सीएसके के लिए मुश्किल वक्‍त पर अहम पारी खेलते नजर आए. दुबे ने नाबाद 48 रन बनाए.","content":"शिवम दुबे सीएसके के लिए शानदार पारी खेल रहे हैं. (IPL/Screengrab) नई दिल्‍ली. चेन्‍नई सुपर किंग्‍स की टीम के बैटर शिवम दुबे ने कोलकाता नाइटराइउर्स के खिलाफ मैच के दौरान एक झन्‍नाटेदार छक्‍का जड़ा. वो इस शॉट के माध्‍यम से भले ही अपने और टीम के लिए छह रन प्राप्‍त करने में सफल रहे हों लेकिन इसके साथ ही मैच के दौरान दर्शकों का मनोरंजन कर रही चीयरलीडर में इससे दशहत फैल गई. छक्‍के के लिए जा रही गेंद एक चीयरलीडर को लगने से मामूली अंतर से बची. वो डर के मारे गेंद से बचती हुई नजर आई. यह घटना 12वें ओवर की पांचवीं गेंद पर सामने आई. गेंदबाजी अटैक पर सुयश शर्मा थे. गेंद ऑफ स्‍टंप के बेहद ज्‍यादा बाहर थी. ऐसे में दुबे ने इसपर प्रहार करने का मन बनाया. कवर्स की दिशा में उन्‍होंने हवाई शॉट लगाया. वहां पर ही बाउंड्री लाइन के बाहर चीयरलीडर्स का स्‍टेज बना हुआ है. ऐसे में गेंद चीयरलीडर्स के बीच से निकलते हुए छक्‍के के लिए गई. वो बाल-बाल गेंद से घायल होने से बच गई. गेंद से बचने हुए वो सभी दशहत में नजर आई. मैच के दौरान शिवम दुबे अपने अर्धशतक से दो रन से चूक गए. उन्‍होंने 34 गेंदों पर 48 रन की अहम पारी सीएसके के लिए खेली. केकेआर के खिलाफ मैच के दौरान दुबे ने तीन छक्‍के और एक चौका लगाया. उनके पहले ही छक्‍के के दौरान चीयरलीडर घायल होते-होते बच गई थी. मैच के दौरान सीएसके की टीम ने निर्धारित 20 ओवरों में छह विकेट के नुकसान पर 144 रन बनाए. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: CSK vs KKR , IPL 2023 , Shivam Dube भाग्यश्री को मां बने बीते थे कुछ घंटे, पति को भड़काने अस्पताल पहुंची 1 महिला, बोली, 'सलमान खान के साथ...' IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका जब बॉबी देओल ने लिया 1 गलत फैसला, लगा फिल्मी करिअर पर ग्रहण, लगातार 6 फिल्में हुईं डिजास्टर","pubDate":"2023-05-14 15:19:05","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shivam-Dube-cheerleader-16840784463x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Hybrid model for Asia Cup and beyond may end Pakistan-India &amp;#039;logjam&amp;#039; says PCB","link":"https://thehimalayantimes.com/sports/hybrid-model-for-asia-cup-and-beyond-may-end-pakistan-india-logjam-says-pcb","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD, PAKISTAN, MAY 14The Pakistan Cricket Board is still hopeful India agrees to its hybrid model of hosting majority of the Asia Cup games at a neutral venue in September....","content":null,"pubDate":"2023-05-14 15:14:39","image_url":"https://thehimalayantimes.com/thehimalayantimes/uploads/images/2023/05/14/23447.jpg","source_id":"thehimalayantimes","category":["sports"],"country":["Nepal"],"language":"english"},{"title":"CSK vs KKR Live Score, IPL 2023: Sunil Narine cleans up Ambati Rayudu, Moeen Ali in an over as Chennai go 5 down after MS Dhoni wins toss - The Indian Express","link":"https://news.google.com/rss/articles/CBMipAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY2hlbm5haS1zdXBlci1raW5ncy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZS1pcGwtMjAyMy1jc2stdnMta2tyLW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtdXBkYXRlcy04NjA4Mzg2L9IBqQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY2hlbm5haS1zdXBlci1raW5ncy12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtbGl2ZS1zY29yZS1pcGwtMjAyMy1jc2stdnMta2tyLW1hdGNoLWxhdGVzdC1zY29yZWNhcmQtdXBkYXRlcy04NjA4Mzg2L2xpdGUv?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CSK vs KKR Live Score, IPL 2023: Sunil Narine cleans up Ambati Rayudu, Moeen Ali in an over as Chennai go 5 down after MS Dhoni wins toss  The Indian ExpressCSK vs KKR Dream11 Prediction Today Match 61, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorMatch Preview - Super Kings vs KKR, Indian Premier League 2023, 61st Match  ESPNcricinfoCSK eye stress-free march into the Playoffs | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2023: CSK Look To Consolidate Playoffs Spot Against Downtrodden KKR  NDTVView Full coverage on Google News","content":null,"pubDate":"2023-05-14 15:09:25","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: कौन हैं Emerging Players की रेस के घोड़े? टीम इंडिया में जल्द होगी एंट्री, 1 ने शतक ठोक मचाया तहलका","link":"https://hindi.news18.com/photogallery/sports/cricket-5-young-players-including-yashasvi-jaiswal-and-rinku-singh-are-in-race-for-emerging-player-ipl-2023-6197903.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"आईपीएल 2023 में एक से बढ़कर एक खिलाड़ी अपने प्रदर्शन से धूम मचा रहे हैं. इस सीजन में युवाओं और अनुभवी प्लेयर्स के बीच कांटे की टक्कर देखने को मिल रही है. एक तरफ पुराने चावल अपना जलवा बिखेर रहे हैं. वहीं, दूसरी तरफ इमर्जिंग प्लेयर की रेस में कई शानदार प्लेयर्स तहलका मचाते नजर आ रहे हैं. हम ऐसे ही टॉप-5 युवा प्लेयर्स की बात करने जा रहे हैं. जिन्होंने इस सीजन आते ही मौको को दोनों हाथों से लपका है.","content":null,"pubDate":"2023-05-14 14:56:16","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Yashasvi-Jaiswal-AP-1-3-16840754483x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"RCB दिन के मैचों मे हो जाती है और भी खूंखार, बड़ो-बड़ों पर भारी, 2 टीमें खतरे में डालेंगी प्‍लेऑफ की दावेदारी!","link":"https://hindi.news18.com/news/sports/cricket-rr-vs-rcb-faf-du-plessis-lead-royal-challengers-bangalore-win-all-four-day-matches-in-ipl-2023-lose-6-in-night-6197735.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"रॉयल चैलेंजर्स बैंगलोर की टीम ने राजस्‍थान रॉयल्‍स को 112 रनों से मात दी. इस वक्‍त सभी टीमें प्‍लेऑफ में पहुंचने के नजरिए से करो-मरो की स्थिति में हैं. एक भी हार टूर्नामेंट में टॉप-4 में पहुंचने के सपने को तोड़ सकती है.","content":null,"pubDate":"2023-05-14 14:51:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/RCB-Playoff-Scenario-16840748203x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}