{"newsArray":[{"title":"WA to host up to 10 days of international cricket next summer as West Indies make Optus Stadium debut","link":"https://thewest.com.au/sport/cricket/wa-to-host-up-to-10-days-of-international-cricket-next-summer-as-west-indies-make-optus-stadium-debut-c-6976794","keywords":null,"creator":["Braden Quartermaine"],"video_url":null,"description":"Perth Stadium will launch the Test summer when Australia host the West Indies and the international season will conclude back in Perth when the Aussies take on South Africa in a one-dayer in January.","content":null,"pubDate":"2022-05-29 22:00:00","image_url":"https://images.thewest.com.au/publication/C-6976794/01c11bd4dd80dd47315577c81117620c2c2e9dd7-16x9-x0y64w3000h1688.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket Australia confirms England matches this summer","link":"https://www.skysports.com/cricket/news/12040/12623923/cricket-australia-confirms-matches-against-england-men-and-women-this-summer","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia has announced T20I and ODI matches against England's men's and women's teams as part of a busy 2022-23 summer schedule. ","content":"Last Updated: 29/05/22 9:33pm Cricket Australia has announced T20I and ODI matches against England's men's and women's teams as part of a busy 2022-23 summer schedule. England men will travel to face the reigning T20 champions in an opening clash at The Gabba in Brisbane on October 9, before the teams meet at the Manuka Oval in Canberra on October 12 and October 14 ahead of Australia's World Cup defence October 16 to November 13. Matthew Mott's ODI team then kick off a three-match series in Adelaide on November 17, followed by games in Sydney on November 19 and Melbourne on November 22. Australia's T20 World Cup-winning women meanwhile compete against Australia, Pakistan and Ireland in Derry from July 16 to July 23 as part of the Women's Commonwealth Bank T20I Tri-Series, after which Birmingham awaits as the 2022 Commonwealth Games take place from July 29-August 7. Please use Chrome browser for a more accessible video player Cricket Australia CEO Nick Hockley said: \"Following arguably the most successful summer in our cricket history last year, we are thrilled to announce an action-packed international schedule for our outstanding women's and men's teams. \"We are hosting a record six touring nations to Australia this season, in addition to the ICC Men's T20 World Cup. It promises to be an incredible summer. \"We are delighted that Test cricket is coming back to Perth Stadium for the first Test of the summer versus the West Indies, after almost three years without international cricket, and we look forward to hosting South Africa over Boxing Day and New Year for the first time since 2008. \"I would like to take this opportunity to wish our No.1-ranked women's team the best of luck as they head to Ireland and then England for the Commonwealth Games. It's the start of an exciting eight months for the team that also includes a tour to India, home series against Pakistan, the opportunity to play in the Hundred and our own extended domestic season, before the T20 World Cup. Please use Chrome browser for a more accessible video player Australia's schedule also includes ODI Series against Zimbabwe (August 28-September 3), New Zealand (September 6-September 11), followed by a T20I Series against West Indies to precede their meeting with England. Newly-appointed head coach Andrew McDonald leads his team out in their first Test of the summer against West Indies on November 30, before welcoming South Africa in December. Next February will also see Australia's women go in search of their sixth T20 World Cup crown. \"After two years of being impacted by the pandemic, the 2022-23 home summer will be an especially busy one for the Australian men's team as we honour our commitments to the ICC's Future Tours Program,\" Hockley added. \"This provides important opportunities to progress towards ICC World Test Championship Final qualification as well as build up for the ICC Cricket World Cup in India in 2023.\"","pubDate":"2022-05-29 21:00:00","image_url":"https://e0.365dm.com/21/10/1920x1080/skysports-ap-newsroom-liam-livingstone_5565014.jpg?20211030170141","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Man of the Series today IPL 2022 final: Who became Man of the Series of today cricket match between GT and RR?","link":"https://thesportsrush.com/cricket-news-man-of-the-series-today-ipl-2022-final-who-became-man-of-the-series-of-today-cricket-match-between-gt-and-rr/","keywords":["Cricket","Gujarat Titans","IPL 2022","Rajasthan Royals","GT","Indian Premier League","Jos Buttler","rajasthan royals","RR"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Man of the Series today IPL 2022 final: The batter from Rajasthan Royals won the series award for registering a career-best season. Gujarat Titans beat Rajasthan Royals by 7 wickets in Indian Premier League 2022 final match at the Narendra Modi Stadium to lift their maiden title in the first season itself. GT batter Shubman… The post Man of the Series today IPL 2022 final: Who became Man of the Series of today cricket match between GT and RR? appeared first on The SportsRush.","content":"Man of the Series today IPL 2022 final: The batter from Rajasthan Royals won the series award for registering a career-best season. Gujarat Titans beat Rajasthan Royals by 7 wickets in Indian Premier League 2022 final match at the Narendra Modi Stadium to lift their maiden title in the first season itself. GT batter Shubman Gill (45*) and captain Hardik Pandya (34) were the architects of sealing the chase as their 63-run third-wicket partnership came at a time when they had lost too quick wickets in Wriddhiman Saha (5) and Matthew Wade (8). With Gill playing an anchor role, hard-hitting batter David Miller scored 32* (19) with the help of three fours and a six to prevent them from any trouble with a victory not far away from them. Eventually, it was Gill who hit Rajasthan pacer Obed McCoy for a six to take Titans past the victory line in the penultimate over. While Pandya won a match award for also picking three wickets and contribute significantly in a victory, RR opening batter Jos Buttler pinned down all other contenders to be declared the ‘Player of the Series’. Buttler, who managed to become the highest run-scorer of the season by some distance, won the series award for scoring 863 runs in 17 innings at an average of 57.53 and a strike rate of 149.05 including four centuries and four half-centuries. ALSO READ: IPL 2022 awards list Having become only the second batter to score in excess of 800 runs in an IPL season, Buttler deserved to win a trophy and a cash prize of INR 10 lakh for this award. What a dream debut season for Gujarat Titans. @hardikpandya7 has been absolutely brilliant as a leader and player. This has been a fantastic IPL and great to see a new champion. Jos Buttler was in a league of his own and Rajasthan Royals can be proud of their season. #IPLFinal pic.twitter.com/dnTKOoAO4K — Virender Sehwag (@virendersehwag) May 29, 2022 “Exceeded all my expectations apart from today – the trophy we really wanted. Disappointed with that. Big congratulations to Hardik [Pandya] and [his] team. Deserving champions. My goals are to play my role for the team and try and react on the day regarding what the game is asking me to do,” Buttler told Star Sports during the post-match presentation ceremony.","pubDate":"2022-05-29 20:35:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya Champions Trophy Final: Gujarat Titans IPL 2022 victory celebration video","link":"https://thesportsrush.com/cricket-news-hardik-pandya-champions-trophy-final-gujarat-titans-ipl-2022-victory-celebration-video/","keywords":["Cricket","Gujarat Titans","IPL 2022","Rajasthan Royals","GT","Hardik Pandya","Indian Premier League","IPL"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hardik Pandya Champions Trophy Final: The Indian Premier League has finally got a new winner after five editions of the marquee league. During the grand finale of the 15th season of the Indian Premier League at the Narendra Modi Stadium in Ahmedabad, the Gujarat Titans (GT), playing their maiden season, in front of their home crowd… The post Hardik Pandya Champions Trophy Final: Gujarat Titans IPL 2022 victory celebration video appeared first on The SportsRush.","content":"Hardik Pandya Champions Trophy Final: The Indian Premier League has finally got a new winner after five editions of the marquee league. During the grand finale of the 15th season of the Indian Premier League at the Narendra Modi Stadium in Ahmedabad, the Gujarat Titans (GT), playing their maiden season, in front of their home crowd for the first time, have lifted the title with a 7-wicket victory against the Rajasthan Royals (RR). After breathing fire with the ball in the first innings by getting rid of RR’s top-3 batters in the season, GT skipper Hardik Pandya soaked in all the pressure with his 30-ball 34, and a match-winning partnership alongside Shubman Gill (45* off 43) for the third wicket. Ultimately, Gill’s partnership with the in-form David Miller (32* off 19) comprising 47* runs off 29 deliveries for the 4th wicket, sealed the deal for Gujarat, with the former hitting the match-winning Six off Obed McCoy on the first delivery of the 19th Over. An all-round performance with both bat and the ball earned Pandya the ‘Player of the Match’ award in the night of the final. In fact, he is only the third captain in the 15 years of the marquee league’s existence, to win the ‘Player of the Match’ award in an IPL final. ALSO READ: Full list of all IPL 2022 award winners GT @gujarat_titans showed us what it takes to win the world’s toughest T20 championship.Being debutants, they never let the pressure affect their superlative performance. Great leadership from @hardikpandya7 & many congratulations to @Gary_Kirsten #AshishNehra. Enjoy the trophy! — Suresh Raina (@ImRaina) May 29, 2022 Hardik Pandya Champions Trophy Final Earlier, a lackluster batting performance by the RR batters, and a disciplined bowling display by the GT bowlers, meant that the Sanju Samson-led side could only huff and puff to the under-par score of 130/9 in the their 20 Overs. Gujarat Titans IPL 2022 victory celebration video The celebrations begin for Gujarat Titans #IPL pic.twitter.com/3go5fLpWwY — Sky Sports Cricket (@SkyCricket) May 29, 2022 For more Cricket-related news, click here. The post Hardik Pandya Champions Trophy Final: Gujarat Titans IPL 2022 victory celebration video appeared first on The SportsRush.","pubDate":"2022-05-29 20:00:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hardik's high: Captain guides Gujarat Titans to IPL triumph in maiden season - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMipgFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaGFyZGlrcy1oaWdoLWNhcHRhaW4tZ3VpZGVzLWd1amFyYXQtdGl0YW5zLXRvLWlwbC10cml1bXBoLWluLW1haWRlbi1zZWFzb24vYXJ0aWNsZXNob3cvOTE4NzYxNjEuY21z0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Hardik's high: Captain guides Gujarat Titans to IPL triumph in maiden season  Times of India‘Remember the Titans!’ Aussie star clinches IPL title in debut team’s fairy tale finish  Fox SportsGujarat claim IPL title to cap dream debut season  cricket.com.auGujarat win IPL at first attempt  7NEWSHardik’s Kapil Dev moment: Pace all-rounder leads no-hopers to IPL title  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-05-29 19:58:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"'I'll take the trophy rather than..': Pandya's big statement after IPL title win - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMipQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbGwtdGFrZS10aGUtdHJvcGh5LXJhdGhlci10aGFuLWd0LWNhcHRhaW4taGFyZGlrLXBhbmR5YS1tYWtlcy1iaWctc3RhdGVtZW50LWFmdGVyLXdpbm5pbmctaXBsLTIwMjItdGl0bGUtMTAxNjUzODUxNDc5OTcyLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'I'll take the trophy rather than..': Pandya's big statement after IPL title win  Hindustan TimesLive Cricket Score - IPL 2022 Final - Gujarat Titans vs Rajasthan Royals, Ahmedabad | Cricbuzz.com - Cricbuzz  CricbuzzRavi Bishnoi will be a big star for India in the upcoming years: Rashid Khan  CricTrackerIPL 2022 Final, GT vs RR Highlights: Hardik Pandya, Shubman Gill Star As Gujarat Titans Win Maiden IPL Title  NDTV Sports'If he trusts his skills...': Rashid Khan's bold India prediction for youngster  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-29 19:48:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights, IPL 2022 GT vs RR Final, Full Cricket Score: Debutants GT outplay RR to win title - Firstpost - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMimwFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLWlwbC0yMDIyLWd0LXZzLXJyLWZpbmFsLWZ1bGwtY3JpY2tldC1zY29yZS1kZWJ1dGFudHMtZ3Qtb3V0cGxheS1yci10by13aW4tdGl0bGUtMTA3MzAyNDEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, IPL 2022 GT vs RR Final, Full Cricket Score: Debutants GT outplay RR to win title - Firstpost  FirstpostLive Cricket Score - IPL 2022 Final - Gujarat Titans vs Rajasthan Royals, Ahmedabad | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 Final, GT vs RR Highlights: Hardik Pandya, Shubman Gill Star As Gujarat Titans Win Maiden IPL Title  NDTV SportsHardik’s Kapil Dev moment: Pace all-rounder leads no-hopers to IPL title  The Indian Express'If he trusts his skills...': Rashid Khan's bold India prediction for youngster  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-29 19:47:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Final, GT vs RR: Shubman Gill survives as Yuzvendra Chahal drops a sitter; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-final-gt-vs-rr-shubman-gill-survives-as-yuzvendra-chahal-drops-a-sitter-watch-video-10735481.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 Final, GT vs RR: Shubman Gill survives as Yuzvendra Chahal drops a sitter; watch video","content":"Cricket IPL 2022 Final, GT vs RR: Shubman Gill survives as Yuzvendra Chahal drops a sitter; watch video FirstCricket Staff May 30th, 2022 1:10:23 IST Gujarat Titans etched their name in record book after clinching the IPL title in their maiden season. The Hardik Pandya-led side defeated Rajasthan Royals in the final in Ahmedabad on Sunday by 7 wickets after chasing down a target of 131 runs. While the Royals could only managed to pick three wickets, they had a chance to draw first blood in the very first over of the innings. Sanju Samson had set a brilliant field with the on side quite packed for Shubman Gill on strike. Yuzvendra Chahal dropped a catch in the first over. Sportzpics Trent Boult who was bowling this over nipped back the ball that had some extra bounce on it, sharply. The ball after hitting Gill's gloves popped up and Yuzvendra Chahal who was stationed at square leg misjudged the catch and went for the dive which wasn't really required resulting him in dropping the catch. Gill later went on to score an unbeaten 45 off 43 as GT went over the line. The Titans lost a couple of early wickets and were reduced to 23/2 when Shubman and captain Hardik Pandya came in for the rescue with a partnership of 63 runs for the third wicket. The Gujarat team then lost Pandya for 34 off 30 but Gill and David Miller who walked out at number five took the team over the line. Miller scored 32* off 19. Earlier, Pandya scalped three wickets rattle RR batting unit as the side was restricted to 130/9 in 20 overs. To watch the video, CLICK HERE Read all the Latest News , Trending News , Cricket News , IPL Live Score , IPL 2022 schedule , IPL 2022 Points table and Entertainment News . Follow us on Facebook , Twitter and Instagram . Updated Date: May 30, 2022 01:10:23 IST Tags: Gt Vs Rr Ipl 2022 Ipl 2022 Final Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-05-29 19:40:23","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Chahal-drop-catch-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricketers brace for busiest summer","link":"https://www.perthnow.com.au/sport/cricket/cricketers-brace-for-busiest-summer-c-6983343","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia's men will play at least 27 fixtures in their busiest ever home cricket summer, with while-ball matches to begin in August and Tests in November.","content":"Two years of COVID postponements and a Twenty20 World Cup have handed Australia's cricketers the busiest summer in the country's history. Cricket Australia confirmed a cluttered schedule on Monday, with a whopping 27 men's fixtures beginning with the first top-end tour since 2008 in August and September. West Indies and South Africa will visit for Test series, while the former will join New Zealand and Zimbabwe in playing catch-up white ball series before the home T20 World Cup that was originally slated for 2020. Early-season cricket will be played in in Townsville and Cairns against Zimbabwe and New Zealand respectively, before Australia leave for a three-match Twenty20 series in India. West Indies and England then play white-ball series either side of the October-November Twenty20 World Cup, with the English to be coached by Australia's former women's mentor Matthew Mott. Notably, the Test summer begins in Perth on November 30 against West Indies, before a pink-ball Test in Adelaide from December 8. Brisbane hosts the first Test against South Africa on December 17, before Melbourne and Sydney hold the traditional Boxing Day and New Years' Tests. The schedule makes for a shift away from the Gabba hosting the first Test of the summer, but means the first two Tests are beamed into the east coast in evening prime-time before the Christmas period begins. \"We are hosting a record six touring nations to Australia this season, in addition to the ICC Men's T20 World Cup,\" CA CEO Nick Hockley said. \"We are delighted that Test cricket is coming back to Perth Stadium for the first Test of the summer versus the West Indies, after almost three years without international cricket. \"And we look forward to hosting South Africa over Boxing Day and New Year for the first time since 2008.\" The figure of 27 matches for the men does not include any T20 World Cup warm-up fixtures, or finals games if the defending champions qualify. The summer therefore easily tops the previous record of 24 matches in 2014-15, which also included a home World Cup in the one-day format. It also comes as part of an extremely busy 12 months for the team, with a four-Test series in India in February and March, an away Ashes next winter, a tour of South Africa and a one-day World Cup in October and November. The one sticking point of Australia's home summer remains a three-match one-day series against South Africa between January 12 and 17, at a time CA had hoped to have all white-ball stars playing Big Bash. South Africa have also requested to move the series, but no other window can be found and all ICC ODI Super League fixtures must be completed before April. Instead, CA have scheduled the games to start earlier to allow BBL matches to follow at night. Meanwhile, Australia's women play three ODIs and T20s against Pakistan in January, with no Test on the agenda. They will also tour India for five T20s in December, ahead of the short-form World Cup in South Africa in February.","pubDate":"2022-05-29 19:32:11","image_url":"https://images.perthnow.com.au/publication/C-6983343/4b86286aa688b06d92978a364adfc2054a024c86-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 awards: Jos Buttler wins the Orange Cap; Yuzvendra Chahal bags Purple Cap","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-awards-jos-buttler-wins-the-orange-cap-yuzvendra-chahal-bags-purple-cap-10735311.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 awards: Jos Buttler wins the Orange Cap; Yuzvendra Chahal bags Purple Cap","content":"Gujarat Titans were crowned the new champions of the Indian Premier League after they defeated Rajasthan Royals in the final of 2022 edition in Ahmedabad on Sunday.Chasing a target of 131, the Titans lost a couple of early wickets but captain Hardik Pandya and opener Shubman Gill steadied the ship for the side with a 63-run stand for the third wicket. The Gujarat team then suffered a hiccup when Pandya was caught by Jaiswal in the slips off Yuzvendra Chahal for 34 off 30.But David Miller and Gill made sure that there were no further fall of wickets. Miller continued his domination while Gill held the fort at the other end as the two batters chipped in with an unbeaten partnership of 47 runs for the fourth wicket.Gill remained unbeaten at 45 off 43 while Miller struck 32* off 19.Earlier, in the day, the Gujarat bowlers and especially Hardik Pandya thoroughly dominated the RR batters. The skipper returned with figures of 3/17 in 4 overs as the Royals were restricted to 130/9 in 20 overs.We now take a look at the award winners from the tournament.1) Jos Buttler takes away the orange cap after he scored 863 runs in 17 matches at an average of 57.33. The right-handed batter also struck four centuries in the season.2) RR's Yuzvendra Chahal shown brilliance with the ball throughout the tournament as was awarded with the purple cap. Chahal scalped 27 wickets in 17 matches at an economy rate of 7/75 which also included a four-fer and a five-wicket haul.3) Jos Buttler is the Most Valuable Player of IPL 2022. In 17 matches, he had 387.5 points.4) GT's Lockie Ferguson bowled the fastest ball of the tournament after he clocked 157.3 kmph against RR in the final match.5) Umran Malik was named the Emerging player of the season.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-29 19:31:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Jos-640-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"\"With one of the greatest in cricket...ever\" - Former RPSG owner Sanjiv Goenka shares a picture with MS Dhoni","link":"https://www.sportskeeda.com/cricket/with-one-of-the-greatest-in-cricket-ever-former-rpsg-owner-sanjiv-goenka-shares-a-picture-with-ms-dhoni?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Suryesh M"],"video_url":null,"description":null,"content":"Sanjiv Goenka, the former owner of Rising Pune Supergiant and the current owner of the Lucknow Supergiants, has shared a picture of him and MS Dhoni on Instagram. In the caption of the post, the chairman of the RPSG group termed the former Indian captain one of the greatest in cricket. The post from Sajiv Goenka came as a surprise to many of the fans, given the bittersweet relationship between the two individuals in the past. After the end of IPL 2016 where the Pune outlet finished second-last on the points table, Goenka decided to take the harsh call of sacking MS Dhoni as skipper and appoint Steve Smith as the captain. Sanjiv Goenka told PTI back then: Instagram Post After this post from Sanjiv Goenka, many fans jokingly commented that the entrepreneur's account might have been hacked. Dhoni had captained teams in 143 IPL games before being sacked by RPSG. He ended up winning 83 of those encounters, 78 of which came while leading the Chennai Super Kings (CSK). At the same time though, Goenka also expressed his admiration for Dhoni while speaking to India Today. He justified his decision saying that Smith has done well leading Australia and added that the captaincy shift might help the team improve its performances. He said: The Pune-based franchise managed to do exceedingly well in 2017 making it all the way to the final. They fell one run short of the target set by Mumbai Indians in the final to finish as the runners-up. Also Read | IPL 2022: What is the lowest total successfully defended in an IPL final? Q. 0 votes so far","pubDate":"2022-05-29 19:25:09","image_url":"https://static.sportskeeda.com/editor/2022/05/fb418-16538469628041-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Sealed with a 6! Gujarat Titans crowned the 2022 IPL champions","link":"https://www.cairnspost.com.au/sport/cricket/sealed-with-a-6-gujarat-titans-crowned-the-2022-ipl-champions/video/61e2dae0023f11cb6f85e07da727950f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Gujarat Titans have been crowned the 2022 IPL champions after cruising to a 7-wicket victory over the Rajasthan Royals.","content":null,"pubDate":"2022-05-29 19:09:22","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Home Australian cricket summer at a glance","link":"https://thewest.com.au/sport/cricket/home-australian-cricket-summer-at-a-glance-c-6983249","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Details of Australia's home summer of cricket, with all men's and women's matches scheduled for 2022-23.","content":"AUSTRALIA'S INTERNATIONAL HOME SUMMER AT A GLANCE MEN'S: ODIs v Zimbabwe: August 28, 31 and September 3 at Riverway Stadium, Townsville. ODIs v New Zealand: September 6, 8 and 11 at Cazalys Stadium, Cairns. T20s v West Indies: October 5 and 7 at Metricon Stadium, Gold Coast. T20s v England: October 9 at The Gabba, Brisbane; October 12 and 14 at Manuka Oval, Canberra. ICC T20 World Cup October 22 v New Zealand at SCG; October 25 v TBA at Perth Stadium; October 28 v England at MCG; October 31 v TBA at The Gabba, Brisbane; November 4 v Afghanistan at Adelaide Oval. ODIs v England (D/N) November 17 at Adelaide Oval; November 19 at SCG; November 22 at MCG. Tests v West Indies November 30 - December 4 at Perth Stadium; December 8 - December 12 at Adelaide Oval (D/N). Tests v South Africa December 17 - December 21: The Gabba, Brisbane; December 26 - December 30 at MCG; January 4 - January 8 at SCG. ODIs v South Africa January 12 at Blundstone Arena, Hobart; January 14 at SCG; January 17 at Perth Stadium. WOMEN'S ODIs v Pakistan January 16 and 18 at Allan Border Field, Brisbane; January 21 at North Sydney. T20s v Pakistan January 24 at North Sydney; January 27 and 29 at Manuka Oval, Canberra.","pubDate":"2022-05-29 19:04:04","image_url":"https://images.thewest.com.au/publication/C-6983249/41e40fb7806b438b8a9a87b67b3a66c24334fb8f-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Gujarat win IPL title in fairytale debut season","link":"https://www.thestar.com.my/sport/cricket/2022/05/30/cricket-gujarat-win-ipl-title-in-fairytale-debut-season","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - Debutants Gujarat Titans were crowned the Indian Premier League (IPL) champions on Sunday after they beat Rajasthan Royals by seven wickets in the final in Ahmedabad. Read full story","content":null,"pubDate":"2022-05-29 18:46:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: 'Politics or cricket, can't keep Gujarat down' - Twitter erupts as GT win maiden IPL title","link":"https://www.dnaindia.com/cricket/report-ipl-2022-politics-or-cricket-cant-keep-gujarat-down-twitter-erupts-as-gt-win-maiden-ipl-title-2956581","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Twitter was abuzz with reactions as Gujarat Titans won their maiden IPL title in their first season in the cash-rich league.","content":null,"pubDate":"2022-05-29 18:38:15","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/05/30/2040144-guj.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 GT vs RR Final, Live Cricket Score and Update: GT outplay RR to win title in maiden season","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-rr-ipl-final-live-cricket-score-tata-ipl-2022-match-scorecard-live-update-gujarat-titans-vs-rajasthan-royals-indian-premier-league-live-streaming-today-10730241.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 GT vs RR Final, Live Cricket Score and Update: GT outplay RR to win title in maiden season","content":"23:44 (IST)After 18.2 overs,Gujarat Titans 133/3 ( Shubman Gill 45 , David Miller 32)GT vs RR Live Score IPL 2022 Final Updates: SIX! Shubman Gill finishes off in style, clobbering the ball over the square leg fence off Obed McCoy, as Gujarat Titans outplay Rajasthan Royals with seven wickets and 10 deliveries to spare! What a dominant run this has been from the Titans this season, topping the table, securing direct qualification into the summit clash and now winning it with such ease!23:43 (IST)After 18 overs,Gujarat Titans 127/3 ( Shubman Gill 39 , David Miller 32)GT vs RR Live Score IPL 2022 Final Updates: Tidy third over for Ashwin, with five coming off it, including a brace to Miller in the final delivery. Just four more needed for Gujarat Titans to complete a memorable title triumph.23:36 (IST)After 17 overs,Gujarat Titans 122/3 ( Shubman Gill 37 , David Miller 29)GT vs RR Live Score IPL 2022 Final Updates: Big over for the Titans as 13 coming off it, including a couple of streaky boundaries to Miller, as the equation comes down to less than 10 with three overs left. Gill and Miller could very well finish things off with singles, though that certainly isn’t Miller’s style and he will look to end it with a bang.23:30 (IST)After 16 overs,Gujarat Titans 109/3 ( Shubman Gill 37 , David Miller 17)GT vs RR Live Score IPL 2022 Final Updates: SIX! And now Miller decides to take on senior offie Ashwin, smashing the ball into the stands beyond midwicket in the third ball of the off-spinner’s second over. 12 off the over, with the umpire signalling timeout at the end of this over. Gujarat need just 22 more to win off 24, and it should be a cakewalk for them from here.23:26 (IST)After 15 overs,Gujarat Titans 97/3 ( Shubman Gill 33 , David Miller 9)GT vs RR Live Score IPL 2022 Final Updates: McCoy returns with the season now coming down it’s last six overs. Eight off the West Indian’s third over, including a boundary to Miller in the fourth ball as the South African drives through the extra cover region. GT need 34 more to win off 30. 23:23 (IST)After 14 overs,Gujarat Titans 89/3 ( Shubman Gill 31 , David Miller 3)GT vs RR Live Score IPL 2022 Final Updates: Chahal signs off with figures of 1/20 after dismissing Pandya with a peach of a delivery in the second ball of his final over. David Miller walks out to bat and gets off the mark with a brace. GT still very much ahead at the moment, needing just 42 more to win off 36 with plenty of wickets in hand.23:17 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! Ripper of a delivery from Yuzvendra Chahal, and the legspinner ensures he'll bag the Purple Cap at the end of the tournament! It's the perfect leg-spinner, one that grips and turns sharply after pitching between middle and leg, and finds Pandya's outside edge. Neat piece of fielding by Jaiswal at slip to complete the dismissal. That should give Gujarat a glimmer of hope! GT 86/3Pandya c Jaiswal b Chahal 34(30)23:13 (IST)After 13 overs,Gujarat Titans 84/2 ( Shubman Gill 31 , Hardik Pandya (C) 32)GT vs RR Live Score IPL 2022 Final Updates: No boundaries conceded by Boult in his final over of the evening, with the Kiwi pacer signing off with excellent figures of 1/14. though that won’t really help Rajasthan’s cause as they desperately need to break this stand and collect wickets at regular intervals thereafter if they are to keep their title hopes alive.23:09 (IST)After 12 overs,Gujarat Titans 77/2 ( Shubman Gill 29 , Hardik Pandya (C) 28)GT vs RR Live Score IPL 2022 Final Updates: Ashwin’s finally introduced in the 12th over, and boy is he off to an expensive start, getting struck for a four and a six off successive deliveries to Pandya, and starting off with a 15-run over, one which will have made the Gujarat dugout a lot more confident. One can safely say the momentum has tilted back in Gujarat’s favour in this over, and it will certainly be very difficult stopping Pandya’s charge towards the target from here.23:03 (IST)After 11 overs,Gujarat Titans 62/2 ( Shubman Gill 26 , Hardik Pandya (C) 16)GT vs RR Live Score IPL 2022 Final Updates: McCoy’s back. Gill pulls the ball towards cow corner in the first ball, coming back for a second after a fine piece of fielding by Hetmyer at the boundary. There’s little any of the fielders can do as Pandya firmly cuts a length ball outside off through the cover region to collect his second boundary. Pandya collects a single off the last ball to keep the strike. Partnership’s worth 39 at the end of this over at run-a-ball.22:59 (IST)After 10 overs,Gujarat Titans 54/2 ( Shubman Gill 23 , Hardik Pandya (C) 11)GT vs RR Live Score IPL 2022 Final Updates: Six off Chahal’s third over of the evening. Gujarat need another 77 runs to win at the halfway stage with eight wickets in hand. Partnership between Pandya and Gill’s worth 31 off 33 so far, and will be starting to worry Rajasthan at the moment.22:56 (IST)After 9 overs,Gujarat Titans 48/2 ( Shubman Gill 19 , Hardik Pandya (C) 9)GT vs RR Live Score IPL 2022 Final Updates: Prasidh returns to the attack. Pandya decides to attack in this over, going for a majestic lofted drive over mid off in the third delivery. Gill then collects a streaky four off an inside edge in the last ball of the over. Umpire signals timeout. Gujarat need 83 to win off 66. 22:52 (IST)After 8 overs,Gujarat Titans 38/2 ( Shubman Gill 14 , Hardik Pandya (C) 4)GT vs RR Live Score IPL 2022 Final Updates: Another close shave for Shubman Gill after he gets a thick top-edge towards extra cover, where Hetmyer fails to hold on to the catch after running in the opposite direction. Three off Chahal's second over. Gujarat going at less than five-an-over at the moment, and need a big over now to keep the asking rate under check.22:47 (IST)After 7 overs,Gujarat Titans 35/2 ( Shubman Gill 12 , Hardik Pandya (C) 3)GT vs RR Live Score IPL 2022 Final Updates: Obed McCoy introduced on the other side of the powerplay, and he does his part in building pressure on the Titans by conceding just four singles in his first over. Gill, meanwhile, is batting on 12, and having been dropped on nought, will hope to make the most of the lifeline handed to him earlier today.22:41 (IST)After 6 overs,Gujarat Titans 31/2 ( Shubman Gill 10 , Hardik Pandya (C) 1)GT vs RR Live Score IPL 2022 Final Updates: Spin introduced in the final over of the powerplay, with Yuvzendra Chahal replacing Prasidh Krishna. The leg-spinner, hoping to get the Purple Cap back from Wanindu Hasaranga, keeps things tight in the first five deliveries, conceding just two singles, before Gill produces a sweetly-timed sweep to end the powerplay with a boundary.22:38 (IST)After 5 overs,Gujarat Titans 25/2 ( Shubman Gill 5 , Hardik Pandya (C) 0)GT vs RR Live Score IPL 2022 Final Updates: Boult is among the wickets after all, as Wade tamely chips the ball towards Parag standing at midwicket, resulting in the easiest of chances. Out walks GT skipper Hardik Pandya at No 4. Rajasthan, meanwhile, are starting to believe again. One more wicket, and it could be anybody’s game from here.22:33 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! Tame end to Matthew Wade's innings, as the Aussie keeper-batter departs after tamely chipping the ball towards Riyan Parag standing at midwicket. GT 23/2Wade c Parag b Boult 8(10)22:29 (IST)GT vs RR Live Score IPL 2022 Final Updates: Poor start for Krishna in his second over, conceding five wides at the start of the over after firing one down the leg side to Wade. Krishna follows it with three good deliveries, collecting a dot off each, before Matthew Wade pulls a short ball behind square, comfortably depositing it in the stands. Dot off each of the last two, with 11 coming off the over.22:26 (IST)After 3 overs,Gujarat Titans 16/1 ( Shubman Gill 4 , Matthew Wade 2)GT vs RR Live Score IPL 2022 Final Updates: Superb second over from Trent Boult as he collects a maiden — the first of the IPL final. Looks like Rajasthan have a chance after all!22:20 (IST)After 2 overs,Gujarat Titans 11/1 ( Shubman Gill 4 , Matthew Wade 2)GT vs RR Live Score IPL 2022 Final Updates: Prasidh Krishna steams in from the other end. Saha collects his first boundary with a firm pull in front of square in the second delivery. Krishna though, sends him back to the dugout two balls later with a peach of a delivery that angles in, beats the inside edge and hits the top of middle. Six runs and a wicket from the over.22:16 (IST)After 1 over,Gujarat Titans 5/0 ( Wriddhiman Saha (W) 1 , Shubman Gill 4)GT vs RR Live Score IPL 2022 Final Updates: Boult nearly gets Rajasthan the early breakthrough that they were looking for, inducing an inside edge off Gill’s bat in the fourth delivery, only for Yuzi Chahal to make a hash of the opportunity at square leg. Gill rubs salt on the wound by collecting the first boundary of the innings two balls later.22:12 (IST)GT vs RR Live Score IPL 2022 Final Updates: Wriddhiman Saha walks out to open the GT innings alongside Shubman Gill, with Trent Boult bowling the first over. Rajasthan need a few early wickets in the powerplay if they are to defend 130. For Gujarat, a solid partnership should be more than half the battle won.22:03 (IST)Do take the poll and let us know what you thinkWhich team will have the glittering trophy in their hands at the end of the #IPLFinal? #IPL2022 #GTvRRLIVE: https://t.co/HF2TVbs640— Firstpost Sports (@FirstpostSports) May 29, 202222:00 (IST)Can they? Mumbai Indians have defended 129 runs in the IPL 2017 final, RR bowlers needs to repeat this for Rajasthan to take the second title— Johns. (@CricCrazyJohns) May 29, 202221:59 (IST)Advantage GT at the interval  GT - 9/10 for execution with the ball. Near-perfect for these conditions.RR needed at least 150 for a fighting score. Of course, there is that good old cliche which I won't repeat.— Bharath Ramaraj (@Fancricket12) May 29, 202221:57 (IST)After 20 overs,Rajasthan Royals 130/9 ( Prasidh Krishna 0 , )GT vs RR Live Score IPL 2022 Final Updates: Shami bowls the final over. Parag turns down a single in the first delivery, and dashes back for a second after working the ball towards deep backward square leg, with Matthew Wade’s throw from that region also fairly wide at the non-striker’s end. Parag slices the ball behind point for a boundary in the third, before pushing for another double — this time his partner McCoy falling well short of the non-striker’s end to get dismissed for 8. Dot off the fifth followed by a perfect inswinging yorker to Parag that uproots the off stump as Rajasthan Royals finish on 130/9 after opting to bat.21:56 (IST)GT vs RR Live Score IPL 2022 Final Updates: BOWLED! Shami uproots the off-stump with an inswinging yorker in the final delivery of the innings, as Parag misses completely while looking to smash the ball down the ground. A superb delivery from the leading seamer as he finishes off with a wicket to his name. RR 130/9Parag b Shami 15(15)21:54 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! McCoy's nowhere in the frame by the time Shami breaks the stumps at the non-striker's stumps. Parag drills the ball down the ground, the ball deflecting off Shami's foot. Parag pushes for a second run, but McCoy slips while dashing back for the second and is run out comfortably in the end. RR 130/8McCoy run out (Tewatia/Shami) 8(5)21:49 (IST)After 19 overs,Rajasthan Royals 123/7 ( Riyan Parag 8 , Obed McCoy 8)GT vs RR Live Score IPL 2022 Final Updates: No fireworks for the Royals in the penultimate over, bowled by Dayal, as the left-arm seamer concedes just three singles off his third over of the evening. Just one more over to go after this. Rajasthan need another 27 just to get to 150.21:46 (IST)After 18 overs,Rajasthan Royals 120/7 ( Riyan Parag 6 , Obed McCoy 7)GT vs RR Live Score IPL 2022 Final Updates: Big over for the Royals, with 16 coming off it as Trent Boult and Obed McCoy collect a six each, though left-arm spinner Sai Kishore also collects his second wicket of the evening by dismissing the former. Left-handed batter McCoy can hit the ball quite cleanly, as was evident in his slog-sweep in the final delivery, and will hope to contribute some vital runs in the last two overs of the innings.21:43 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! Boult had collected his first six just the previous delivery, but fails to get the distance this time around while attempting to go big over long off. Rahul Tewatia settles under the ball and collects it safely as Rajasthan lose their seventh wicket. Second wicket of the evening for Sai Kishore. RR 112/7Boult c Tewatia b Sai Kishore 11(7)21:40 (IST)After 17 overs,Rajasthan Royals 104/6 ( Riyan Parag 5 , Trent Boult 3)GT vs RR Live Score IPL 2022 Final Updates: Ferguson’s back too, and the focus will once again be back on the speed gun. Can he breach the 100mph barrier this evening. Tidy over from the Kiwi pacer with a single collected off each delivery of the innings. Rajasthan finally cross 100 — the only problem for them is that they have just three more overs left.21:33 (IST)After 16 overs,Rajasthan Royals 98/6 ( Riyan Parag 2 , Trent Boult 0)GT vs RR Live Score IPL 2022 Final Updates: R Sai Kishore introduced with Rashid Khan and Hardik Pandya exhausting their quotas. And he too is among the wickets, getting rid of Ravichandran Ashwin in the penultimate delivery as the latter ends up skying the ball towards long on, where Miller holds on. Four runs and a wicket from the over.21:32 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! The wickets are tumbling thick and fast for the Royals now, as Ashwin departs not too long after Hetmyer. Looks to smash the ball down the ground, but doesn't quite get the distance even if he gets the elevation. David Miller settles under the swirling ball at long on, and pulls off a fine catch in the end. RR 98/6Ashwin c Miller b Sai Kishore 6(9)21:28 (IST)After 15 overs,Rajasthan Royals 94/5 ( Ravichandran Ashwin 4 , Riyan Parag 0)GT vs RR Live Score IPL 2022 Final Updates: Pandya’s slightly expensive in this over, collecting two boundaries in three balls as Hetmyer looks to accelerate after a cautious start. Pandya though, signs off with a third wicket to his name, collecting an easy return catch to dismiss Hetmyer for 11 and signing off with figures of 3/17. 10 runs and a wicket from the over.21:26 (IST)OUT! Wicket number three for the Gujarat Titans skipper, this time getting rid of another dangerous hitter in Shimron Hetmyer. The ball appeared to have stopped after pitching along good length, and Hetmyer ended up poking it tamely towards Pandya, offering an easy return catch. Rajasthan have now lost half their side with less than 100 on board. RR 94/5Hetmyer c and b Pandya 11(12)21:24 (IST)What a season this has turned out to be for the Englishman!Most runs against pace in any IPL season620 - Jos Buttler in 2022Highest average against spin in any IPL season243 - Jos Buttler in 2022— Kausthub Gudipati (@kaustats) May 29, 202221:23 (IST)A near-perfect evening for RashidJasprit Bumrah is the only bowler to bowl 4 overs without conceding a boundary in an IPL Final. He did that in 2019. Rashid Khan could have been second tonight if not for the misfield by Sai Kishore on the first ball of his spell.— Mazher Arshad (@MazherArshad) May 29, 202221:22 (IST)After 14 overs,Rajasthan Royals 84/4 ( Shimron Hetmyer 2 , Ravichandran Ashwin 3)GT vs RR Live Score IPL 2022 Final Updates: Rashid concedes just two off his final over of the evening, signing off with outstanding — and potentially match-winning — figures of 1/18. Timeout signalled at the end of this over. Rajasthan are still 16 short of the 100-mark with just six more overs to go. They’ll need to score at 10-an-over just to get to 150 from here.21:18 (IST)After 13 overs,Rajasthan Royals 82/4 ( Shimron Hetmyer 1 , Ravichandran Ashwin 2)GT vs RR Live Score IPL 2022 Final Updates: Big blow to the Royals in this over as Buttler’s caught-behind in the first delivery as Buttler misses out on an unprecedented fifth ton this season. The Englishman departs for 39, and Rajasthan’s hopes of mounting a total in excess of 180 surely are over right now. Another superb over from Pandya, with just three singles coming off it besides Buttler’s wicket. Ashwin and Hetmyer at the crease now.21:13 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! Huge blow for the Royals as Jos Buttler — the leading run-scorer this season and a key hope to them setting up a challenging total tonight — departs after nicking the ball to the keeper while looking for a late cut. Pandya persists with the back-of-length stuff, bowling this one a lot closer to the stumps to cramp the batter for room. RR 79/4Buttler c Saha b Pandya 39(35)21:08 (IST)After 12 overs,Rajasthan Royals 79/3 ( Jos Buttler 39 , Shimron Hetmyer 0)GT vs RR Live Score IPL 2022 Final Updates: Single off each of the first four deliveries in Rashid’s third over, before Devdutt Padikkal perishes while looking to break the shackles, departing after collecting just 2 in 10 balls. Rashid ends the over with a sharp google that takes Shimron Hetmyer by surprise. Four runs and a wicket from the over.21:04 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! Padikkal's patchy stay at the crease comes to an end as the southpaw ends up serving Shami the simplest of catches at short third man, giving Rashid Khan his first wicket in an IPL final! RR 79/3Padikkal c Shami b Khan 2(10)21:00 (IST)After 11 overs,Rajasthan Royals 75/2 ( Jos Buttler 37 , Devdutt Padikkal 0)GT vs RR Live Score IPL 2022 Final Updates: Pandya continues to bowl in a good rhythm, with just four coming off this over including a brace to Buttler at the start of the over. He’s conceded just four in the two overs he’s bowled so far today.20:57 (IST)After 10 overs,Rajasthan Royals 71/2 ( Jos Buttler 34 , Devdutt Padikkal 0)GT vs RR Live Score IPL 2022 Final Updates: Shami returns, replacing Rashid. Buttler, meanwhile, collects a brace in the second delivery, and follows it up with two lovely shots — a firm pull behind square leg followed by a crunch through the extra cover region, collecting consecutive boundaries. In the process, he also goes past David Warner’s 848 runs in the 2016 season to sit at the second position in the list of batters with most runs in a single season. Rajasthan have collected 71 so far at the halfway stage, and will need to score a lot more quickly if they are to set a challenging target tonight.20:49 (IST)After 9 overs,Rajasthan Royals 60/2 ( Jos Buttler 23 , Devdutt Padikkal 0)GT vs RR Live Score IPL 2022 Final Updates: Skipper Hardik Pandya decides to have a bowl after the timeout, and ends up bowling perhaps the best over so far in the final, conceding just one while getting rid of Samson with a short delivery outside off. The momentum has tilted towards Gujarat in the last couple of overs.20:44 (IST)GT vs RR Live Score IPL 2022 Final Updates: OUT! One skipper gets the other! Pandya fires a back-of-length delivery to Samson, taking pace off the delivery, and Samson ends up getting a thick outside edge that sends the ball high up in the air towards point. Sai Kishore backpedals from the circle and collects his second catch of the evening. RR 60/2Samson c Sai Kishore b Pandya 14(11)20:40 (IST)After 8 overs,Rajasthan Royals 59/1 ( Jos Buttler 22 , Sanju Samson (C) (W) 14)GT vs RR Live Score IPL 2022 Final Updates: Tidy second over from Rashid, with five singles coming off it. Umpire signals timeout at the end of this over. Rajasthan currently are going at a little over seven-an-over at the moment, and will hope Buttler accelerates sooner rather than later so that they’re able to set a score in excess of 180 tonight.20:38 (IST)After 7 overs,Rajasthan Royals 54/1 ( Jos Buttler 19 , Sanju Samson (C) (W) 12)GT vs RR Live Score IPL 2022 Final Updates: 10 off Ferguson’s second over of the evening, with Jos Buttler collecting back-to-back boundaries in the fourth and fifth deliveries. Buttler’s on 19 at the moment, and slowly getting into his groove.20:31 (IST)After 6 overs,Rajasthan Royals 44/1 ( Jos Buttler 10 , Sanju Samson (C) (W) 11)GT vs RR Live Score IPL 2022 Final Updates: Rashid Khan is introduced in the final over of the powerplay, and he’s off to a rough start as Rajasthan skipper Samson collects a boundary off his very first delivery of the evening — through a misfield by R Sai Kishore at extra cover. The star leg-spinner, though, keeps it tidy for the remainder of the over, conceding just four more singles. Rajasthan collect 45 in the powerplay, losing Jaiswal’s wicket along the way.Gujarat Titans vs Rajasthan Royals Live update - IPL 2022 GT vs RR cricket score, Final IPL Match Live Coverage: SIX! Shubman Gill finishes off in style, clobbering the ball over the square leg fence off Obed McCoy, as Gujarat Titans outplay Rajasthan Royals with seven wickets and 10 deliveries to spare! What a dominant run this has been from the Titans this season, topping the table, securing direct qualification into the summit clash and now winning it with such ease!Preview: The original table-toppers after the league stage — Gujarat Titans and Rajasthan Royals — will square off in the final of the Indian Premier League (IPL) 2022. The GT vs RR IPL final will take place at the Narendra Modi Stadium in Ahmedabad on Sunday.Gujarat Titans, in their maiden IPL season, had finished on top of the league table with 20 points after 14 matches. The Hardik Pandya-led side then beat RR in the Qualifier 1 at the Eden Gardens in Kolkata to book a spot in the finals.The road to finals for RR was not as smooth. They went to Qualifier 2 after losing to GT. The Sanju Samson-led outfit then beat Royal Challengers Bangalore by 7 wickets in that match to set up the summit clash with GT.Here are all the details about the IPL 2022 final:When will the Gujarat Titans and Rajasthan Royals match be played?The GT vs RR IPL 2022 match will take place on 29 May.Where will the Gujarat Titans and Rajasthan Royals match be held?The GT vs RR IPL 2022 match will be held at the Narendra Modi Stadium in Ahmedabad.What time will the Gujarat Titans and Rajasthan Royals match start?The GT vs RR IPL 2022 match will start at 8 pm. The toss is set to be held at 7.30 pm.Where can you watch the GT vs RR IPL 2022 match on TV and online?The GT vs RR IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The GT vs RR match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the GT vs RR IPL 2022 match.Full squad:Rajasthan Royals Squad: Sanju Samson (c), Jos Buttler, Yashasvi Jaiswal, Ravichandran Ashwin, Trent Boult, Shimron Hetmyer, Devdutt Padikkal, Prasidh Krishna, Yuzvendra Chahal, Riyan Parag, KC Cariappa, Navdeep Saini, Obed McCoy, Anunay Singh, Kuldeep Sen, Karun Nair, Dhruv Jurel, Tejas Baroka, Shubham Garhwal, Kuldip Yadav, James Neesham, Rassie van der Dussen, Nathan Coulter-Nile, Daryl Mitchell.Gujarat Titans Squad: Hardik Pandya (c), Rashid Khan, Matthew Wade, Shubman Gill, Vijay Shankar, Rahul Tewatia, Mohammed Shami, David Miller, Varun Aaron, Lockie Ferguson, Jayant Yadav, Dominic Drakes, Wriddhiman Saha (wk), Rahmanullah Gurbaz, Gurkeerat Singh Mann, Pradeep Sangwan, Alzarri Joseph, Noor Ahmad, R Sai Kishore, Darshan Nalkande, Abhinav Manohar, Sai Sudarshan, Yash Dayal.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-29 18:15:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/IPL-2022-final-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Final Watched By Record Crowd Of More Than A Lakh In Ahmedabad","link":"https://sports.ndtv.com/cricket/ipl-final-watched-by-record-crowd-of-more-than-a-lakh-at-narendra-modi-stadium-in-ahmedabad-3020697","keywords":null,"creator":null,"video_url":null,"description":"The Indian Premier League (IPL 2022) final between Gujarat Titans and Rajasthan Royals in Ahmedabad set a new record attendance for a cricket match, attracting a crowd of 104,859, organisers said...","content":null,"pubDate":"2022-05-29 17:57:44","image_url":"https://c.ndtvimg.com/2022-05/b4b1tdu8_narendra-modi-stadium-ipl-2022_625x300_29_May_22.jpeg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"VCAT Tigers emerge winners in quadrangular tournament","link":"https://telanganatoday.com/vcat-tigers-emerge-winners-in-quadrangular-tournament","keywords":["Cricket","News","Sport","quadrangular tournament","VCAT Lions","VCAT Stallions","VCAT Tigers"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: The Veterans Cricket Association of Telangana (VCAT) Tigers emerged winners in the quadrangular tournament organised at the Grand Arena Sports County, Maheshwaram, recently. The tournament, conducted at the launch of the VCAT, saw four teams, VCAT Stallions, VCAT Lions, VCAT Tigers and Mumbai Eagles. Mumbai Eagles emerged runners-up.   Now you can get handpicked […]","content":"Hyderabad: The Veterans Cricket Association of Telangana (VCAT) Tigers emerged winners in the quadrangular tournament organised at the Grand Arena Sports County, Maheshwaram, recently. The tournament, conducted at the launch of the VCAT, saw four teams, VCAT Stallions, VCAT Lions, VCAT Tigers and Mumbai Eagles. Mumbai Eagles emerged runners-up.   Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-05-29 17:42:59","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"“HARDIK the BOWLER is back”: Harbhajan Singh praises Hardik Pandya for his excellent bowling spell during GT vs RR IPL 2022 final","link":"https://thesportsrush.com/cricket-news-hardik-the-bowler-is-back-harbhajan-singh-praises-hardik-pandya-for-his-excellent-bowling-spell-during-gt-vs-rr-ipl-2022-final/","keywords":["Cricket","Gujarat Titans","IPL 2022","Rajasthan Royals","GT","Harbhajan Singh","Hardik Pandya","Indian Premier League","IPL","rajasthan royals","RR"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Harbhajan Singh praises Hardik Pandya after latter took charge of Titans’ bowling attack, thereby restricting RR on a below par total. During the grand finale of the 15th season of the Indian Premier League at the Narendra Modi Stadium in Ahmedabad, the Gujarat Titans (GT) have restricted the Rajasthan Royals (RR) at a paltry and perhaps an… The post “HARDIK the BOWLER is back”: Harbhajan Singh praises Hardik Pandya for his excellent bowling spell during GT vs RR IPL 2022 final appeared first on The SportsRush.","content":"Harbhajan Singh praises Hardik Pandya after latter took charge of Titans’ bowling attack, thereby restricting RR on a below par total. During the grand finale of the 15 th season of the Indian Premier League at the Narendra Modi Stadium in Ahmedabad, the Gujarat Titans (GT) have restricted the Rajasthan Royals (RR) at a paltry and perhaps an under-par score of 130/9 in their 20 Overs. Staying true to their approach, it was Yashasvi Jaiswal (22 off 16) who played the role of the aggressor, smashing a Four and a couple of Sixes, while Jos Buttler (39 off 35) took his trusted, cautious approach at during the Powerplay. However, just when RR needed to up the ante, the GT skipper Hardik Pandya stepped up with the ball, and consistently bowled the back of the length deliveries with perfection and decent enough pace, to trouble the batters right from the get-go. With his eventual bowling figures of 4-0-17-3, Pandya got rid of the Orange Cap holder Jos Buttler, Sanju Samson (14 off 11), and Shimron Hetmyer (11 off 12) – RR’s three best batters this season, to puncture the spirits of the rest of the batting line-up. Highly impressed by Hardik Pandya’s bowling effort in the night of the final, former India off-spinner Harbhajan Singh took to his Twitter handle to acknowledge and praise the GT skipper. HARDIK the BOWLER is back .. what a spell captain 🔝👏 @hardikpandya7 @gujarat_titans — Harbhajan Turbanator (@harbhajan_singh) May 29, 2022 Apart from being the highest run-scorer for Gujarat in their debut season, Pandya, with 8 wickets at an average of 27.75, has also impressed with the ball in hand. Moreover, the 28-year-old has also surprised a significant section of the Cricket fans with his captaincy skills, after not much had been expected of him pre-season due to his elongated battle with injury since the T20 World Cup in UAE last year.","pubDate":"2022-05-29 17:42:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL final watched by crowd of 104,859: Organisers","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-final-watched-by-crowd-of-104859-organisers/articleshow/91875038.cms","keywords":null,"creator":null,"video_url":null,"description":"The Indian Premier League final between Gujarat Titans and Rajasthan Royals saw a record crowd attendance of 104,859 at the world's biggest cricket stadium in Ahmedabad, oraginsers said on Sunday.","content":"AHMEDABAD: The Indian Premier League final between Gujarat Titans and Rajasthan Royals saw a record crowd attendance of 104,859 at the world's biggest cricket stadium in Ahmedabad, oraginsers said on Sunday. The 132,000-seater Narendra Modi Stadium was nearly full for the season finale of the popular Twenty20 tournament.","pubDate":"2022-05-29 17:40:08","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"RECORD ALERT | IPL 2022: GT vs RR IPL final draws highest ever attendance in history of white-ball cricket","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-gt-vs-rr-ipl-final-draws-highest-ever-attendance-in-history-of-white-ball-cricket-hardik-pandya-vs-sanju-samson-2022-05-29-780337","keywords":null,"creator":null,"video_url":null,"description":"The IPL final between Gujarat Titans and Rajasthan Royals has become one of the most attended cricket games ever, with the official number coming in at 1,04,859.","content":null,"pubDate":"2022-05-29 17:37:36","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Matthew Wade falls cheaply in IPL Final","link":"https://www.cairnspost.com.au/sport/cricket/matthew-wade-falls-cheaply-in-ipl-final/video/8df51c4766754a09e6b9300f23626dd7","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Matthew Wade was dismissed for just eight runs during the IPL Final between the Gujarat Titans and the Rajasthan Royals","content":null,"pubDate":"2022-05-29 17:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Final | Rajasthan set a target of 131 for Gujarat","link":"https://thenewsglory.com/ipl-2022-final-rajasthan-set-a-target-of-131-for-gujarat/","keywords":["Sports","Cricket","Gujarat","India","IPL 2022"],"creator":["The News Glory"],"video_url":null,"description":"Ahmedabad: Rajasthan Royals set a target of 131 for victory over Gujarat in the final of the current IPL season. The final of the current season is being played at the Narendra Modi Cricket Ground in Ahmedabad, Gujarat. The Gujarat Titans and Rajasthan Royals are playing in it. Rajasthan captain Sanju Samson won the toss […]","content":"Ahmedabad: Rajasthan Royals set a target of 131 for victory over Gujarat in the final of the current IPL season. The final of the current season is being played at the Narendra Modi Cricket Ground in Ahmedabad, Gujarat. The Gujarat Titans and Rajasthan Royals are playing in it. Rajasthan captain Sanju Samson won the toss and elected to bat. Gujarat captain Hardik Pandya, on the other hand, had initially expressed interest in bowling. Yashaswi Jaiswal and Butler were the opening batsmen for Rajasthan. Both added 31 runs for the first wicket. Jaiswal was out for 22 off 16 balls. Sanju Samson, the captain of the team that followed, formed a partnership with Butler for 30 runs. However, Rajasthan lost wickets at regular intervals. Sanju Samson (14 runs), Padikkal (2 runs), Butler (39 runs), Hedmeyer (11 runs), Aswin (6 runs), Bolt (11 runs), McCoy (8 runs), Ryan Barak (15 runs) Were out. At the end of 20 overs, Rajasthan lost 9 wickets and scored 130 runs. Gujarat are chasing the target of 131 runs to win. Hardik Pandya (3 wickets), Sai Kishore (2 wickets), Rashid Khan, Yash Dayal and Shami took one wicket each for Gujarat. .","pubDate":"2022-05-29 17:01:27","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"BAW vs VH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2Jhdy12cy12aC1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtZHJlYW0xMS1uYXR1cmUtaXNsZS10MTAv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BAW vs VH Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10  Cricket AddictorBAW vs VH Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Nature Isle T10 2022, Match 19  SportskeedaBAW vs VHK 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match 19  CricTrackerIRR vs SSS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10  Cricket AddictorCricket Match Predictions: Dream11 Nature Isle T10, 2022 - Barana Aute Warriors vs Valley Hikers, Match 19: 29th May  Cricket WorldView Full coverage on Google News","content":null,"pubDate":"2022-05-29 16:34:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL displays world's largest cricket jersey, enters Guinness world records","link":"https://www.business-standard.com/article/sports/ipl-displays-world-s-largest-cricket-jersey-enters-guinness-world-records-122052900800_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Indian Premier League has taken a giant leap by getting itself registered in the Guinness Book of Records after displaying a giant jersey during the closing in Ahmedabad on Sunday.","content":"The 15th edition of the Indian Premier League has taken a giant leap by getting itself registered in the Guinness Book of World Records after displaying a giant jersey during the closing ceremony at the Narendra Modi Stadium in Ahmedabad on Sunday. The former India head coach Ravi Shastri who was doing presenters' duties, announced about it. The jersey was numbered 15, representing the 15th edition of the tournament. It also held the symbols of all the 10 teams that participated in IPL 2022. Later, the IPL took to Twitter and shared a video of the jersey launch at the world's largest cricket stadium. David Miller, the middle-order batter and one of the key persons behind Gujarat Titans' success, wants to soak in the atmosphere of the final in a completely packed stadium. \"It's been a long time, these finals don't come around too many times. The beautiful atmosphere here, I want to soak it up and I'm very excited,\" said the left-hander in a pre-final chat with broadcasters Star Sports. --IANS inj/bsk (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-05-29 16:31:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220529/thumb-122052900800.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Hardik Pandya's impressive bowling pushes Rajasthan Royals on backfoot in IPL 2022 final","link":"https://www.firstpost.com/firstcricket/sports-news/hardik-pandyas-impressive-bowling-pushes-rajasthan-royals-on-backfoot-in-ipl-2022-final-10734951.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Hardik Pandya's impressive bowling pushes Rajasthan Royals on backfoot in IPL 2022 final","content":"Gujarat Titans captain Hardik Pandya was on a roll against Rajasthan Royals in the final of the IPL 2022 in Ahmedabad after he returned with figures of 3/17 in 4 overs.Pandya troubled the batters with quick back of the length and short deliveries and rattled the Royals middle-order.The right-hander first removed his counterpart Sanju Samson on the second ball of the ninth over with short one. The batter tried to pull that one but couldn't connect his stroke and was caught around the backward point area for 14 off 11.Pandya then scalped an important wicket of Jos Buttler on the very first ball of the 13th over. He bowled another short delivery, outside off that Buttler tried to run down to the third man but only managed to edge it and then rest was done by wicket-keeper Wriddhiman Saha behind. Buttler was undone for 39 off 35.The Titans captain later returned in the 15th over to bowl his final one. He was hit for 10 runs in the first five balls in this over before he finally got another wicket on the final delivery. Hardik bowled a slower back of the length ball to Shimron Hetmyer who tried to defend it but a bit early as the ball popped in the air and the bowler was grabbed the catch in his follow through.Hetmyer was sent back in the hut for 11 off 12.The Titans have made it to the final in their debut season.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-29 16:20:33","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Pandya-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: GT's Lockie Ferguson clocks fastest delivery of the tournament","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-gts-lockie-ferguson-clocks-fastest-delivery-of-the-tournament-10734621.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: GT's Lockie Ferguson clocks fastest delivery of the tournament","content":"Gujarat Titans pacer Lockie Ferguson bowled the fastest delivery in the IPL 2022. The right-arm bowler bowled yorker, outside off stump to Jos Buttler on the final ball of the fifth over during the title clash between RR and GT.Ferguson clocked 157.3 kmph and surpassed SRH's Umran Malik who had bowled a delivery at 157 kmph in the 20th over against the Delhi Capitals in Mumbai.While the Titans made it to the final in their debut season, this is the second time that the Royals have registered a final berth. They last played an IPL final in the inaugural edition and lifted the trophy under Shane Warne's captaincy.The RR captain Sanju Samson opted to bat first.Earlier, in the tournament, Gujarat and Rajasthan had finished as the top two sides. While RR lost to Titans in Qualifier 1, they made a solid return and defeated RCB in the second qualifier to march forward.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-29 15:55:59","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Ferguson-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Final, GT vs RR Live Score: Hardik Pandya Removes Sanju Samson, Jos Buttler Continues To Impress - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9ndC12cy1yci1pcGwtMjAyMi1maW5hbC1saXZlLXVwZGF0ZXMtc2NvcmVib2FyZC1ndWphcmF0LXRpdGFucy12cy1yYWphc3RoYW4tcm95YWxzLWxpdmUtc2NvcmUtMzAxOTc3ONIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Final, GT vs RR Live Score: Hardik Pandya Removes Sanju Samson, Jos Buttler Continues To Impress  NDTV SportsMatch Preview - Royals vs Titans, Indian Premier League 2022, Final  ESPNcricinfoLive Cricket Score - IPL 2022 Final - Gujarat Titans vs Rajasthan Royals, Ahmedabad | Cricbuzz.com - Cricbuzz  CricbuzzLIVE | IPL Final Social BUZZ, GT vs RR: Hardik Pandya Does a Virat Kohli; Asks Crowd to up The Decibel  India.com'If he trusts his skills...': Rashid Khan's bold India prediction for youngster  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-29 15:23:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Gujarat Titans vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/gujarat-titans-vs-rajasthan-royals-live-score-over-final-t20-6-10-updates-3020220","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Gujarat Titans vs Rajasthan Royals from Narendra Modi Stadium, Ahmedabad. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.1 overs, Rajasthan Royals are 73/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Gujarat Titans and Rajasthan Royals. Everything related to Gujarat Titans and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Gujarat Titans vs Rajasthan Royals live score. Do check for Gujarat Titans vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) A yorker, on middle. Buttler digs it out to mid-wicket and scampers across for a quick single. Just what Rajasthan needed, a big over, this one goes for 11 and they will look for a couple of more like this. 9.5 overs (0 Run) Full and outside off, pushed to covers. 9.4 overs (4 Runs) FOUR! This one is a shot of a classy player! A length ball, outside off. Buttler hangs back and drives it through mid off for a boundary. Hardik Pandya has no chance to stop it. 9.3 overs (4 Runs) FOUR! Much needed boundary for Rajasthan! Bangs a bouncer, well directed as well. Buttler rides the bounce and pulls it to deep square leg for a boundary. It races away into the fence in no time. 9.2 overs (2 Runs) Superb work from Lockie Ferguson! Length ball wide outside off. Buttler drives it firmly and to deep cover. Lockie Ferguson runs to his right, dives and saves a couple of runs. 9.1 overs (0 Run) Length and on off. Buttler plays it back to Shami. 8.6 overs (0 Run) Excellent start from the skipper! Just a run and a huge wicket of Samson! Around off, Padikkal pushes it to extra-cover. Finds the fielder. 8.5 overs (0 Run) BEATEN AGAIN! Top-class bowling from Pandya! On a length and going across Padikkal. He looks to defend without much foot movement and fails to connect. 8.4 overs (0 Run) On the pads, flicked to mid-wicket. 8.3 overs (0 Run) Follows it with a peach of a delivery! A length ball, just around off. Padikkal looks to defend inside the line and gets beaten on the outside edge. The ball whizzes past the off pole. Devdutt Padikkal walks out to bat! 8.2 overs (0 Run) OUT! CAUGHT! The skipper gets the opposition skipper! Pandya again hits the hard length and serves it just outside off. Samson plays the wrong line as he swings across but it goes off the top edge and to backward point where Sai Kishore tracks back and takes a really good catch. Not much contribution from Sanju Samson and he will be disappointed. Fair to say, the pitch is helping the seamers. 8.1 overs (1 Run) Pandya hits the deck and serves it outside off. Buttler cuts it aerially and to deep cover who collects it on a bounce. A single. DRINKS! Rajasthan are off to a good start! The platform is laid for them to put on a really good total on the board. They would hope, both Buttler and Samson who have their eye in can continue. Gujarat on the other hand, need one of these two to fall or they well might be chasing a big total again. An interesting passage awaits. 7.6 overs (1 Run) Just five singles off the over then! Slides one around middle, it is hit to deep mid-wicket for one more. 7.5 overs (1 Run) A googly but was on the length. Samson reads it and wrists it to mid-wicket for a single. 7.4 overs (1 Run) Tossed up, just outside off. Buttler punches it to deep cover for a single. 7.3 overs (0 Run) Superb delivery! A slower one, length and outside off. Buttler waits on the back foot to cut but misses it. 7.2 overs (1 Run) A loopy ball, on off. Sanju steps across and drives it to the right of long off for a single. 7.1 overs (1 Run) Tossed up, around off. Jos pushes it past point for a single. 6.6 overs (1 Run) A quick single to end the over! Full and on off, it is pushed away to mid off and Buttler takes a risky but successful single. 6.5 overs (4 Runs) FOUR! Two in a row! Short in length and outside off. Buttler cuts it hard and past point for a boundary. He is finding his rhythm. 6.4 overs (4 Runs) FOUR! JUST OVER! Lockie pitches it up, outside off. Buttler gets underneath and smashes it over mid off where Pandya leaps but it speeds over and into the fence. 6.3 overs (0 Run) Short of a length, outside off, steep bounce there. Buttler frees his arms and slashes at it but fails to connect. 6.2 overs (1 Run) A low full toss, outside off. Samson pushes it off the splice and to sweeper cover for a single. 6.1 overs (0 Run) Good shot but for no run! Overpitched and outside off. Samson drives it but straight to the man at mid off. 5.6 overs (0 Run) Dot to end the over! Good over by Rashid other than the first ball misfield! Darted on the pads, it is flicked to short fine leg. At the end of the Powerplay, Rajasthan are 44 for 1. 5.5 overs (1 Run) Just a single! Quicker again, floats it on middle. Samson turns it to deep mid-wicket for a single. 5.4 overs (0 Run) A quicker one, length and outside off. Samson drops it in front of covers. No run. 5.3 overs (1 Run) Tossed up, length and on middle. Buttler hangs back and nudges it to square leg for one more. 5.2 overs (1 Run) Slightly shorter and on middle. Samson tucks it past mid-wicket for a single. 5.1 overs (4 Runs) MISFIELD AND FOUR! Flatter and outside off Samson punches off the back foot to covers where Sai Kishore fails to stop it and allows it through for a boundary. Not what Pandya will like it.","pubDate":"2022-05-29 15:18:01","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637894540699494003.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: IPL creates Guinness World Record with largest cricket jersey","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/watch-ipl-creates-guinness-world-record-with-largest-cricket-jersey/articleshow/91873719.cms","keywords":null,"creator":null,"video_url":null,"description":"Amid the high voltage final clash of Indian Premier League (IPL) 2022 between Gujarat Titans and Rajasthan Royals, the tournament created the Guinness World Record for the world's largest cricket jersey.","content":null,"pubDate":"2022-05-29 15:14:08","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"}]}