{"newsArray":[{"title":"|","link":"https://www.thenews.com.pk/print/978866-n-a","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh T20 skipper Nurul out of Zimbabwe tourAg AFPDHAKA: Bangladesh’s captain for the Twenty20 International series against Zimbabwe Nurul Hasan will miss the rest of tour due to a finger injury, the country’s cricket board said on Monday.The wicketkeeper-batsman hurt his left...","content":null,"pubDate":"2022-08-02 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"“It’s all about giving opportunity”: Rohit Sharma explains why Avesh Khan bowled last over ahead of Bhuvneshwar Kumar in 2nd T20 vs West Indies","link":"https://thesportsrush.com/cricket-news-its-all-about-giving-opportunity-rohit-sharma-explains-why-avesh-khan-bowled-last-over-ahead-of-bhuvneshwar-kumar-in-2nd-t20-vs-west-indies/","keywords":["Cricket","Avesh Khan","Bhuvneshwar Kumar","India","India tour of West Indies 2022","Rohit Sharma","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma explains why Avesh Khan bowled last over: The Indian captain made some atypical bowling changes at the Warner Park tonight. India captain Rohit Sharma is proud of his boys for taking the second T20I against West Indies to the last over in Basseterre tonight. Defending a 139-run target, India managed to remain alive… The post “It’s all about giving opportunity”: Rohit Sharma explains why Avesh Khan bowled last over ahead of Bhuvneshwar Kumar in 2nd T20 vs West Indies appeared first on The SportsRush.","content":"Rohit Sharma explains why Avesh Khan bowled last over: The Indian captain made some atypical bowling changes at the Warner Park tonight. India captain Rohit Sharma is proud of his boys for taking the second T20I against West Indies to the last over in Basseterre tonight. Defending a 139-run target, India managed to remain alive in the match until West Indies wicket-keeper batter Devon Thomas hit a six and a four off consecutive deliveries in the last over. Barring Bhuvneshwar Kumar, all other Indian bowlers picked a wicket apiece to not let the opposition run away chasing a below par target. “Proud of the team. When you are defending a target like that, it can end in 13-14 overs or you try to drag it to the last over. Guys kept fighting, it was important to take wickets. The planning we did, the guys came and executed. Happy with bowlers,” Sharma told ESPN Caribbean during the post-match presentation ceremony. . @ObedCMcCoy brought his best today with the ball!🙌🏾 #WIvIND #MaroonMagic pic.twitter.com/dUgoXCKXkT — Windies Cricket (@windiescricket) August 1, 2022 Apart from West Indies leveling the series 1-1 with three more matches to be played, they have also been able to bring an end to an abysmal 12-match losing streak spanning across some 33 months against India. In what was only their third match across formats in St Kitts, India are yet to register a win at the Warner Park. With West Indies needing 38 runs in five overs with seven wickets in hand, Sharma would’ve easily bowled pacer Bhuvneshwar Kumar’s remaining two overs in the general run of things. The same would’ve been a certainty with any opposition requiring 27 runs in the last three overs of a T20I against India. However, Kumar not bowling outside of his first spell was primarily done to provide death-bowling opportunities to the likes of Avesh Khan, Arshdeep Singh and Hardik Pandya. While Singh managed to concede only 10 runs in his two death overs, Khan and Pandya leaked boundaries leading to an Indian loss. “It’s all about giving opportunity. We know Bhuvneshwar [Kumar], what he brings to the table, but if you don’t give opportunity to Avesh [Khan] or Arshdeep [Singh], you will never find out what it means to bowl at the death for India,” Sharma added without sounding concerned for Khan who gave away 12 runs in just two balls of the 20th over. ALSO READ: Where to watch highlights of West Indies vs India 2nd T20I? Put in to bat first, Sharma got out for a golden duck for the fourth time in his T20I career. A first-ball wicket was followed by India losing wickets at regular intervals. An innings which never really got going found the visitors getting bundled out for 138 in 19.4 overs. Even at the cost of sounding repetitive, Sharma reiterated how such things will happen during the journey of revamping their T20I batting approach. “It was not enough runs on the board for us. We didn’t bat well. Pitch was playing quite nicely but we didn’t apply ourselves. But that can happen. I have said again and again that when you are trying something as a batting group, it won’t work out always. We will try to see our mistakes and look to correct them,” Sharma mentioned.","pubDate":"2022-08-01 22:23:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"The Hundred kits: All team jerseys and dress 2022 Hundred","link":"https://thesportsrush.com/cricket-news-the-hundred-kits-all-team-jerseys-and-dress-2022-hundred/","keywords":["Cricket","The Hundred","The Hundred 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"The Hundred kits: Eight men’s and women’s teams will participate in ECB’s ‘The Hundred’, which has returned for a second edition. Eight men’s teams are all geared up to clash against each other in the second edition of The Hundred’, which is set to begin from tomorrow (Wednesday), with the defending champions Southern Braves to… The post The Hundred kits: All team jerseys and dress 2022 Hundred appeared first on The SportsRush.","content":"The Hundred kits: Eight men’s and women’s teams will participate in ECB’s ‘The Hundred’, which has returned for a second edition. Eight men’s teams are all geared up to clash against each other in the second edition of The Hundred’ , which is set to begin from tomorrow (Wednesday), with the defending champions Southern Braves to lock horns against the Welsh Fire, during the opening game at the Ageas Bowl in Southampton. The eight women’s teams will begin with their campaign a week later, from August 11, after the wrap-up of the ongoing Commonwealth Games 2022 in Birmingham, where women’s Cricket has found an inclusion for the first time in history. Defending women’s champion the Oval Invincibles would host Northern Superchargers at The Kia Oval as their tournament opener. Each of the eight men’s teams would play against the other six teams once, and the remaining, nearest regional rivals twice. As for the women’s teams, a delayed start would mean that each side will only play six group matches each, which would mean that some teams would not meet during the group stage. The team which would top the points table after the end of the group stage would qualify directly for the grand finale at the Lord’s Cricket Ground on September 3, while the second and third placed sides would face each other in the ‘Eliminator’, slated to take place on September 2 at the Ageas Bowl, Southampton for both men and women. There’s a new way to experience The Hundred in 2022… Take it away, @katecross16 ! 🤩 #TheHundredFantasyGame pic.twitter.com/v3PhBfGpMj — The Hundred (@thehundred) August 1, 2022 Top stars from England and overseas, would take the field in their all-attractive jerseys, with the ECB eyeing on yet another successful conduction of the unique format, akin the last year. The kits/jerseys of the each of the eight teams are as follows:","pubDate":"2022-08-01 22:08:12","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Awesome Aussies to take the world by storm","link":"https://www.couriermail.com.au/sport/commonwealth-games/awesome-aussies-to-watch-at-the-birmingham-commonwealth-games/news-story/ae68fe6bc6ae87cd5e1bd099cd44ae47","keywords":["Athletics","Aus Team News","Commonwealth Games","More Sports","Olympics","Sport news and galleries"],"creator":null,"video_url":null,"description":"Birmingham is going to get outrageous.","content":"Australia is looking to break records with an insane gold medal rush at the 2022 Commonwealth Games and it sadly means that many of our athletes’ mighty performances will be buried in the avalanche.While they will all be worth watching, there are some events Aussie sports fans simply can’t miss — even with the unfriendly timezone difference forcing those Down Under to set their alarms depressingly early to watch the best of action. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Try 14-Days Free Now >It says everything that you can take it to the bank that Australia will win the required 66 gold medals to become the first country to achieve a total of 1000 gold medals in the history of the Commonwealth Games movement.Some astute judges are even predicting Australia will challenge the haul of 80 gold medals won at the 2018 Games on the Gold Coast.Once again the majority of the headline-grabbing performances are expected to come in the pool — coming off a bonkers performance of 28 gold medals and 73 total medals on the Gold Coast.The list of must-watch athletes for the Birmingham Games has to start with Aussie star Ariarne Titmus, who captivated the entire country with her performances at the Tokyo Olympics last year. Ariarne TitmusTitmus has some real competition in teen freak Summer McIntosh in the 400m freestyle. The 15-year-old Canadian is seen as a future superstar. For now at least though, Titmus’ real battle will be against the clock. The world was denied the dream re-match between Titmus and American legend Katie Ledecky when Titmus decided to skip the recent World Championships to focus on her Commonwealth Games campaign. After Titmus dethroned Ledecky at the Tokyo Games, the American won at the World Championships last month, but with a time that was well short of the world record effort of 3:56.40 that Titmus smashed at the Australian Championships in May.Emma McKeonStill being celebrated as Australia’s greatest ever Olympic athlete following her heroics at the Tokyo Games, McKeon is now expected to cement her place in the history as the most successful Commonwealth Games athlete of all time.McKeon, who’s won eight gold medals and 12 medals overall, is poised to break the record held by swimming greats Susie O’Neill, Ian Thorpe and Leisel Jones — who share the record with 10 career gold medals.Shooter Phillip Adams holds the Australian record for overall medals with 18.McKeon is competing in eight events in Birmingham. Peter BolPeter Bol is hungry to prove the excitement surrounding him is not undue after a disappointing campaign at the World Athletics Championships in Oregon last week. After finishing fourth in the men’s 800m at the Tokyo Games, Bol was seventh at the World Championships with a time that was more than 1.5 seconds outside his personal best. With several of the best 800m runners in the world — including Kenya’s top-ranked runners — missing the Games, Bol is considered a very real gold medal chance. KookaburrasThe Kookaburras are ranked number one in the world and have won every Commonwealth Games men’s hockey gold medal since hockey was introduced to the competition in 1998.With the added motivation of their heartbreaking penalty shootout loss to Belgium in the gold medal game at the Tokyo Olympics, the Kookaburras are expected to join the gold rush in Birmingham. Cody SimpsonThe pop star turned swimmer enters Birmingham with his private life making more headlines than his performances in the pool — but that could all change at the Commonwealth Games. The 25-year-old — who has previously been romantically linked to celebrities like Miley Cyrus and Gigi Hadid — embarked on a new path nobody saw coming when he returned to the pool in 2021 after a 10-year break from competitive swimming.Initially eyeing off an Australian berth at the 2024 Paris Olympics, Simpson is ahead of schedule. His remarkable swim to place third in the 100m butterfly behind Matt Temple and Kyle Chalmers at the recent National Championships was enough to secure him a spot on the Commonwealth Games team.Eleanor PattersonEleanor Patterson stunned the world by becoming the first Australian to win the women’s high jump gold at the World Athletics Championship last week.The 26-year-old recorded a personal best of 2.02m, equalling the Oceania record, becoming just the 10th Australian to win a gold medal at the World Athletics Championships.Patterson’s unbelievable comeback follows her decision to walk away from the sport after missing out on selection for the 2018 Commonwealth Games team. It’s easy to forget the 26-year-old also won gold at the 2014 Commonwealth Games.Rohan BrowningThe 24-year-old has long been Australia’s great hope in the blue ribbon 100m event that decides the fastest man on the planet. He missed out on a spot in the final at the Tokyo Games by just 0.09 seconds, but was unable to get past the heats at the World Championships earlier this month. Big things are expected in Birmingham where Browning is expected to challenge for a medal if he can reach his goal of becoming just the second Australian ever to run under the magic 10 second mark.Alana KingThe red-hot leg-spinner has the cricket world in a spin. King has been a revelation since making her international debut against England in January. Cementing herself in a team that is almost impossible to break into, King’s deadly variations will be one of captain Meg Lanning’s trump cards as the Aussies compete for cricket’s inaugural gold medal at the Commonwealth Games.Full schedule for Birmingham 2022 Commonwealth GamesThe opening ceremony will kick off at 8pm local time on Thursday July 28 (for Aussie fans, that’s 5am AEST on Friday July 29). The closing ceremony will bring things to an end on August 8 in Birmingham — or the early hours of August 9 Down Under.A full schedule of events for the Commonwealth Games can be seen below.","pubDate":"2022-08-01 21:59:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"India versus West Indies second T20 highlights: Fancode yesterday match 2nd T20 highlights where to watch","link":"https://thesportsrush.com/cricket-news-india-versus-west-indies-second-t20-highlights-fancode-yesterday-match-2nd-t20-highlights-where-to-watch/","keywords":["Cricket","Devon Thomas","India","India tour of West Indies 2022","Obed McCoy","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India versus West Indies second T20 highlights: India continue to remain without a victory at the Warner Park. During the second T20I of India’s tour of West Indies 2022 in Basseterre, West Indies beat India by 5 wickets to end their 12-match losing streak against this opposition in white-ball cricket. It is after almost 33… The post India versus West Indies second T20 highlights: Fancode yesterday match 2nd T20 highlights where to watch appeared first on The SportsRush.","content":"India versus West Indies second T20 highlights: India continue to remain without a victory at the Warner Park. During the second T20I of India’s tour of West Indies 2022 in Basseterre, West Indies beat India by 5 wickets to end their 12-match losing streak against this opposition in white-ball cricket. It is after almost 33 months that West Indies have been able to defeat India in any format. Chasing a 139-run target, West Indies would’ve ideally wanted to have registered a victory way before they eventually did. Having said that, considering their recent form, the hosts wouldn’t mind winning with four balls remaining in the match. Opening batter Brandon King, who brought up a fourth T20I half-century to score 68 (52) with the help of eight fours and two sixes, was the pick of their batters. Having said that, it was Devon Thomas (31*) who kept calm in a tense situation to be able to register a last-over finish at the Warner Park. Needing 23 runs off 14 balls to win the match, Thomas hit India vice-captain Hardik Pandya for a six to bring the asking rate down. Further requiring 10 runs off the last Avesh Khan over, the right-hand batter hit a six and a four off consecutive deliveries to avoid any last-minute error. One of the two changes made by West Indies for this match, Thomas justified the decision of playing an extra batter on the back of hitting a four and two sixes. That being said, the real architect of this West Indian victory was fast bowler Obed McCoy. Banking on his current form, McCoy not only registered career-best bowling figures but also picked the best figures for a West Indian bowler . McCoy’s six-wicket haul, only the 11th in this format, earned him a second Player of the Match award in international cricket. Streaming platform FanCode, only official streaming app of this tour for the Indian audiences, has an option of watching highlights but only for its subscribers . However, non-subscribers can watch selected video highlights on the Twitter handle or YouTube channel of FanCode. An entertaining T20I comes to a close at Warner Park in St. Kitts.🇰🇳 #WIvIND #MenInMaroon pic.twitter.com/lFbtVgL5Zs — Windies Cricket (@windiescricket) August 1, 2022 While the official YouTube channel of West Indies Cricket will also be uploading highlights of this match but that might take some time especially for the Indian audiences who would be looking for highlights upon waking up in the morning in a few hours from now.","pubDate":"2022-08-01 21:32:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ben Stokes The Hundred: Is Ben Stokes playing The Hundred 2022 for Northern Superchargers?","link":"https://thesportsrush.com/cricket-news-ben-stokes-the-hundred-is-ben-stokes-playing-the-hundred-2022-for-northern-superchargers/","keywords":["Cricket","Ben Stokes","The Hundred","The Hundred 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ben Stokes The Hundred: The England all-rounder had announced his retirement from the ODI format last month in July. The much anticipated second edition of England’s 100-ball tournament – ‘The Hundred’ is all set to commence tomorrow with defending men’s champions Southern Braves to play the opening game against the Welsh Fire, at the Ageas… The post Ben Stokes The Hundred: Is Ben Stokes playing The Hundred 2022 for Northern Superchargers? appeared first on The SportsRush.","content":"Ben Stokes The Hundred: The England all-rounder had announced his retirement from the ODI format last month in July. The much anticipated second edition of England’s 100-ball tournament – ‘The Hundred’ is all set to commence tomorrow with defending men’s champions Southern Braves to play the opening game against the Welsh Fire, at the Ageas Bowl in Southampton. The women’s fixture will commence a week later, from August 11, as majority of the players are partaking in the ongoing Commonwealth Games 2022 in Birmingham, where women’s Cricket has been introduced for the very first time. Meanwhile, the England and Wales Cricket Board (ECB) has made way for a two-week window for its Test players to participate in ‘The Hundred’ for their franchises, with the three-match Test series against South Africa set to begin from August 17 onwards as well. Ben Stokes The Hundred However, England’s Test captain Ben Stokes, has opted out from participating in the 100-ball tournament, with ECB having confirmed the same on July 15, a few days before Stokes decided to retire from the ODI format altogether. The development meant that the 31-year-old all-rounder will not play for the Northern Superchargers this time around, although he would have not played more than three matches due to the South Africa Test series. For those unaware, the Durham all-rounder had represented the Superchargers in a couple of matches during The Hundred’s inaugural season last year. Having played has last match match in England colours during England’s first ODI against South Africa in Durham a few days ago, Stokes has his eyes set on clinching the three-match Test series against the Proteas, after the team’s limited Overs side under Jos Buttler, drew and lost the ODI and T20I series recently. Under his Test captaincy so far, Stokes has not lost a single match, while securing record wins versus New Zealand in the three-match series and then managing a draw versus India during the one-off Test at Edgbaston. The post Ben Stokes The Hundred: Is Ben Stokes playing The Hundred 2022 for Northern Superchargers? appeared first on The SportsRush.","pubDate":"2022-08-01 21:25:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Neue Sportart: Suhl spielt jetzt auch Cricket","link":"https://www.insuedthueringen.de/inhalt.neue-sportart-suhl-spielt-jetzt-auch-cricket.72d14203-1255-4904-801e-1f1d5133d944.html","keywords":null,"creator":["Karsten Tischer"],"video_url":null,"description":"Sie kamen als Flüchtlinge von Afghanistan nach Deutschland, jetzt sind sie eine eigene Abteilung in einem Sportverein: Seit diesem Sommer wird in Suhl auch Cricket gespielt. Ein Besuch beim Training in der Hölderlinstraße.","content":"Sie kamen als Flüchtlinge von Afghanistan nach Deutschland, jetzt sind sie eine eigene Abteilung in einem Sportverein: Seit diesem Sommer wird in Suhl auch Cricket gespielt. Ein Besuch beim Training in der Hölderlinstraße.","pubDate":"2022-08-01 21:19:00","image_url":"https://www.insuedthueringen.de/media.media.9eb00880-3123-4d6d-97aa-aedb4931e27f.original.jpg","source_id":"insuedthueringen","country":["germany"],"category":["sports"],"language":"german"},{"title":"Ex-NZ cricketer Davis comes out as gay","link":"https://www.perthnow.com.au/sport/cricket/ex-nz-cricketer-davis-comes-out-as-gay-c-7723058","keywords":null,"creator":["Ben McKay"],"video_url":null,"description":"Pace bowler Heath Davis has come out as gay, almost three decades after playing Test cricket for New Zealand.","content":"Three decades after his Test debut, Heath Davis has become the first male New Zealand international cricketer to come out as gay. Davis played five Tests and 11 ODIs for the Black Caps and had a lengthy first class career in domestic cricket as a fiery pace bowler. Speaking to the Spinoff and Dominion Post, Davis described a \"lonely\" experience in the game, leaving his teammates on nights out. Davis said moving clubs from Wellington to Auckland provided a freer experience. \"Everyone in Auckland knew I was gay, in the team, but it didn't seem to be that big an issue,\" he said. \"If you're sharing a room with them or something, (maybe not). On the field it was all good.\" Davis, now 50, now lives in Brisbane. He is one of a very few international cricketers to share their non-heterosexuality, following English wicketkeeper Steven Davies in 2011.","pubDate":"2022-08-01 20:13:55","image_url":"https://images.perthnow.com.au/publication/C-7723058/1aca3839ed08d05fdc05ae04558aeb64394d0de3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Live Cricket Score India vs West Indies 2nd T20I Latest Updates: Obed McCoy Six-Fer Bundle India Out for 13 - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiywFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbGl2ZS1jcmlja2V0LXNjb3JlLWluZGlhLXZzLXdlc3QtaW5kaWVzLTJuZC10MjBpLWxhdGVzdC11cGRhdGVzLWluZC12cy13aS1saXZlLXN0cmVhbWluZy10b2RheS1tYXRjaC1jb3ZlcmFnZS1oaWdobGlnaHRzLXdhcm5lci1wYXJrLXN0LWtpdHRzLWxpdmVuZXdzLTU2Njg0ODMuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Live Cricket Score India vs West Indies 2nd T20I Latest Updates: Obed McCoy Six-Fer Bundle India Out for 13  News18WI vs IND: 2nd T20I Between India And West Indies To Start At 10 PM IST Due To Delay In Team Luggage Arrival  Cricket AddictorMatch Preview - India vs West Indies, India in West Indies 2022, 2nd T20I  ESPNcricinfoLive Cricket Score - West Indies vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  Cricbuzz\"...Best Thing About His Game\": Bhuvneshwar Kumar On Young Indian Pacer  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-08-01 19:20:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Eoin Morgan The Hundred: Is Eoin Morgan playing The Hundred 2022 for London Spirits?","link":"https://thesportsrush.com/cricket-news-eoin-morgan-the-hundred-is-eoin-morgan-playing-the-hundred-2022-for-london-spirits/","keywords":["Cricket","Eoin Morgan","The Hundred"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Eoin Morgan The Hundred: The former England skipper had retired from international Cricket last month post England’s tour of the Netherlands. The second edition of ECB’s 100-ball tournament ‘The Hundred’ is set to get underway tomorrow onwards, with the defending men’s champion Southern Braves to play the opening game against the Welsh Fire, at the… The post Eoin Morgan The Hundred: Is Eoin Morgan playing The Hundred 2022 for London Spirits? appeared first on The SportsRush.","content":"Eoin Morgan The Hundred: The former England skipper had retired from international Cricket last month post England’s tour of the Netherlands. The second edition of ECB’s 100-ball tournament ‘The Hundred’ is set to get underway tomorrow onwards, with the defending men’s champion Southern Braves to play the opening game against the Welsh Fire, at the Ageas Bowl in Southampton. The women’s fixtures will get underway from August 11 onwards, as the players are presently representing their respective countries in the ongoing Commonwealth Games 2022, where Women’s T20 Cricket has been introduced for the first time ever. Former England skipper Eoin Morgan, who announced his retirement across all international Cricket formats, is set to return back and play for his previous team in the tournament. ALSO READ : The Hundred 2022 men’s team squad Having led the London Spirits during the inaugural edition of the tournament last year, Eoin Morgan will lead the Spirits during the second edition as well. While announcing his international retirement last month, the 35-year-old has explicitly stated that he would continue to partake in the domestic matches, and will also lead London Spirits in the second edition of The Hundred. “To what lies ahead for me, I will continue to enjoy playing at a domestic level while I can. I’m really looking forward to playing and captaining London Spirit in the second edition of The Hundred this year, ” said Morgan. It is worth of a mention that Morgan’s London Spirits had finished at the bottom of the points table last year, with mere one win out of eight matches. A couple of days earlier, the Southpaw batter was all in praise for The Hundred, and stated that with domestic tournaments as such in his own country, he England players no longer have to necessarily travel elsewhere to partake in the various leagues and play as an overseas player. Wondering how to start building your team? 🏗 @Eoin16 & @sambillings have some suggestions… #TheHundredFantasyGame pic.twitter.com/rtHoktNvlh — The Hundred (@thehundred) August 1, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-01 18:58:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"LIVE IND vs WI 2nd T20I Cricket Score and Updates: Ravindra Jadeja-Hardik Pandya Aim to Re-Build For India - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi6QFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaW5kLXZzLXdpLTJuZC10MjBpLWNyaWNrZXQtc2NvcmUtd2FybmVyLXBhcmstc3Qta2l0dHMtdG9zcy1tYXRjaC11cGRhdGVzLWluZGlhLXZzLXdlc3QtaW5kaWVzLTJuZC10MjBpLWxpdmUtc3RyZWFtaW5nLWRkLXNwb3J0cy1mYW5jb2RlLWJhbGwtYnktYmFsbC1jb21tZW50YXJ5LXJhdmluZHJhLWphZGVqYS1kaW5lc2gta2FydGhpay01NTQ3MTE3L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs WI 2nd T20I Cricket Score and Updates: Ravindra Jadeja-Hardik Pandya Aim to Re-Build For India  India.comWI vs IND: 2nd T20I Between India And West Indies To Start At 10 PM IST Due To Delay In Team Luggage Arrival  Cricket AddictorMatch Preview - India vs West Indies, India in West Indies 2022, 2nd T20I  ESPNcricinfoLive Cricket Score - West Indies vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  CricbuzzIND vs WI Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs  News18View Full coverage on Google News","content":null,"pubDate":"2022-08-01 18:14:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs India: West Indies vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-t20i-t20-6-10-updates-3215253","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Warner Park, Basseterre, St Kitts. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, India are 81/4. The live updates of West Indies vs India scorecard is also available. It is the perfect platform to follow your favourite teams in West Indies vs India, 2022. Keep a track on your favourite batsmen and bowlers through West Indies vs India, 2022 today match, ball by ball commentary, West Indies vs India, West Indies vs India live score, West Indies vs India scorecard. Follow the excitement of the West Indies vs India, 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) Just a single to the end the over, six singles from this over! 9.5 overs (1 Run) Drifts on the pads again. This is fuller in length and Pandya flicks it to fine leg for a single. 9.4 overs (1 Run) A slower yorker, outside off. Jadeja flicks it to deep mid-wicket for a single. 9.3 overs (1 Run) Bit of hesitation but an easy single in the end. On a length, on leg. Pandya clips it to short fine leg and inititally hesitates to take a single but Jadeja calls him and they complete it easily in the end. 9.2 overs (1 Run) Bowls it short, on off. Jadeja pulls it towards deep mid-wicket for another single. 9.1 overs (1 Run) On a length, on middle. Pandya pushes it to long on for a single. 8.6 overs (0 Run) Another good over by Akeal Hosein. This is pushed through quicker and on off, Ravindra Jadeja makes room and dabs it to point. Only 2 runs from the over. 8.5 overs (1 Run) A bit short and down the leg, Hardik Pandya helps it towards fine leg for another run. 8.4 overs (0 Run) Tossed up around middle and leg, Hardik Pandya nudges it to mid-wicket for one. 8.3 overs (0 Run) Nice delivery. This is slower through the air, holds its line and bounces of the deck, Hardik Pandya blocks it out watchfully. 8.2 overs (1 Run) Flatter and on middle and leg, Ravindra Jadeja stays back and eases it to long on for a single. 8.1 overs (0 Run) Floated on off, turning in a bit, Ravindra Jadeja knocks it to short mid-wicket. 7.6 overs (1 Run) Bangs it short again, around off. Jadeja pulls it firmly to deep mid-wicket for a single. Just 4 from the over, good start from Holder! 7.5 overs (1 Run) On a length, on middle. Pandya works it with the angle towards mid-wicket for a single. 7.4 overs (1 Run) Seems like the Windies bowlers have decided to keep their length on the shorter side. It is a short one angling into middle from 'round the wicket and Jadeja pulls it to deep square leg for a single. 7.3 overs (0 Run) Short of good length and around off. Jadeja chops it to the point fielder. 7.2 overs (1 Run) Again the same length, it is angling into the body and Pandya works it wide of mid on for a single. 7.1 overs (0 Run) Holder starts off with the shorter length, it is angling into off. Pandya rides the bounce and defends it towards the leg side. 6.6 overs (1 Run) Tossed up, around off. Pandya works it to mid on for one. A wicket-taking over by Hosein comes to an end. 6.5 overs (1 Run) Half a chance! It is fuller, on off. Jadeja comes down the track and pushes it aerially to the left of the bowler. Hosein moves to that side but does not get near the ball. They take as the ball goes to long on. 6.4 overs (0 Run) Floated and full, outside off. Jadeja blocks it back to the bowler on the front foot. Ravindra Jadeja is the new batter in. 6.3 overs (0 Run) OUT! CAUGHT! Hosein gets his man and sends Pant back in the hut. He bowls this a bit fuller and outside off, Rishabh Pant skips down the track and tries to heave it over the deep mid-wicket fence against the wind. However, he cannot use all of his power and ends up mistiming his shot. The ball goes in the air towards deep mid-wicket. Odean Smith sprints to his right in the deep and pouches the ball safely. India loses another. 6.2 overs (4 Runs) FOUR! Nice shot! This is a bit short and on middle, Rishabh Pant picks the length early and goes down and hooks it over short fine leg for a boundary. 6.1 overs (1 Run) Starts with a flatter delivery and down the leg, Hardik Pandya tucks it through square leg for one. Change. Akeal Hosein comes into the attack now. 5.6 overs (1 Run) Smith continues to be tad short and around off. Pandya powers it to sweeper cover for a single. 5.5 overs (0 Run) On the shorter side again, around off. Pandya punches it to covers this time. 5.4 overs (0 Run) Nice carry again! It is short and around off. The ball is just short of good length and bounces sharply to beat the outside edge of Pandya's blade as he looks to push it away. 5.3 overs (6 Runs) SIX! What a shot! India continue their aggressive approach! Short and wide outside off. Pandya waits for it and cuts it over the point fence for a maximum. Fantastic shot! 5.2 overs (1 Run) Shorter in length again, it is outside off and Pant cuts it to deep point for a single. 5.1 overs (0 Run) Smith starts his second over with a back-of-a-length delivery, around off. Pant punches it to the cover fielder in the ring.","pubDate":"2022-08-01 18:09:36","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637949939675523784.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Harshal Patel not playing today: Why Virat Kohli is not playing today 2nd T20I between India and West Indies in St Kitts?","link":"https://thesportsrush.com/cricket-news-why-harshal-patel-not-playing-today-why-virat-kohli-is-not-playing-today-2nd-t20i-between-india-and-west-indies-in-st-kitts/","keywords":["Cricket","Avesh Khan","Harshal Patel","India","India tour of West Indies 2022","Virat Kohli","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Harshal Patel not playing today: India have made a solitary change to their Playing XI for the second T20I. During the second T20I of India’s tour of West Indies 2022 in Basseterre, West Indies captain Nicholas Pooran has won the toss and chose to bowl for the second time in a row in this… The post Why Harshal Patel not playing today: Why Virat Kohli is not playing today 2nd T20I between India and West Indies in St Kitts? appeared first on The SportsRush.","content":"Why Harshal Patel not playing today: India have made a solitary change to their Playing XI for the second T20I. During the second T20I of India’s tour of West Indies 2022 in Basseterre, West Indies captain Nicholas Pooran has won the toss and chose to bowl for the second time in a row in this series. “We gonna have a bowl, wickets look nice and we will try and use our experience. We want to forget that game and believe in our process and execute our plans. Different conditions today and the guys are looking forward to whatever spin/seam attack they have,” Pooran told ESPN Caribbean at the toss. Wanting to put their best foot forward in search of a victory at the Warner Parl, West Indies have made a couple of changes to their Playing XI. Batter Brandon King and wicket-keeper batter Devon Thomas have replaced batter Shamarh Brooks and fast bowler Keemo Paul in the XI. Why is Harshal Patel not playing today vs West Indies? India captain Rohit Sharma didn’t mind losing a toss for the second time in a row as he sounded unperturbed about being asked to bat first following a delayed start. “It was quite pleasing for us, the way we played first game. We stuck to our plans and executed it really well. It’s another opportunity for us and we are looking to repeat what we did in the first one,” Sharma told ESPN Caribbean at the toss. A lone change for India has come in the form of fast bowler Avesh Khan playing this match for spinner Ravi Bishnoi. It is a change in the conditions which has motivated India to play an extra pacer on Monday. Rohit Sharma is gone first-ball #WIvIND #SaddaPunjab #PunjabKings pic.twitter.com/E90eK8yvOy — Punjab Kings (@PunjabKingsIPL) August 1, 2022 “The dimensions are different here and wanted to get an extra seamer here. [Ravi] Bishnoi misses out unfortunately and Avesh Khan comes in. It’s unfortunate that he misses out but we are trying whatever we can from the team’s perspective,” Sharma added. A primary reason why India have picked Khan ahead of a more established name in Harshal Patel is the latter suffering a rib injury. “Harshal Patel has a rib injury and is unavailable for selection for the 2nd and 3rd T20I. He is being monitored by the BCCI medical team,” BCCI (Board of Control for Cricket in India) tweeted before the start of this match. As far as former captain Virat Kohli is concerned, he has been rested for this tour. The post Why Harshal Patel not playing today: Why Virat Kohli is not playing today 2nd T20I between India and West Indies in St Kitts? appeared first on The SportsRush.","pubDate":"2022-08-01 18:00:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs West Indies, 2nd T20I Live Score: Obed McCoy Strikes Again As India Lose Two Early Wickets - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3dlc3QtaW5kaWVzLXZzLWluZGlhLTIwMjIvaW5kaWEtdnMtd2VzdC1pbmRpZXMtMm5kLXQyMGktbGl2ZS1zY29yZS11cGRhdGVzLTMyMTQ1OTnSAXBodHRwczovL3Nwb3J0cy5uZHR2LmNvbS93ZXN0LWluZGllcy12cy1pbmRpYS0yMDIyL2luZGlhLXZzLXdlc3QtaW5kaWVzLTJuZC10MjBpLWxpdmUtc2NvcmUtdXBkYXRlcy0zMjE0NTk5L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs West Indies, 2nd T20I Live Score: Obed McCoy Strikes Again As India Lose Two Early Wickets  NDTV SportsWI vs IND: 2nd T20I Between India And West Indies To Start At 10 PM IST Due To Delay In Team Luggage Arrival  Cricket AddictorMatch Preview - India vs West Indies, India in West Indies 2022, 2nd T20I  ESPNcricinfoLive Cricket Score - West Indies vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  Cricbuzz‘There must’ve been some deep thinking’ – Bhuvneshwar Kumar on Suryakumar Yadav opening in the first T20I  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-08-01 17:37:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI 2nd T20 Live Score Updates: Rohit Sharma departs first ball, India lose their skipper early - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtd2ktMm5kLXQyMC1saXZlLXNjb3JlLXVwZGF0ZXMtODA2NDA5Ny_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI 2nd T20 Live Score Updates: Rohit Sharma departs first ball, India lose their skipper early  The Indian ExpressWI vs IND: 2nd T20I Between India And West Indies To Start At 10 PM IST Due To Delay In Team Luggage Arrival  Cricket AddictorMatch Preview - India vs West Indies, India in West Indies 2022, 2nd T20I  ESPNcricinfoLive Cricket Score - West Indies vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  CricbuzzRohit Sharma Explains Why Suryakumar Yadav Is Opening In T20I Series vs West Indies  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-08-01 17:33:22","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"West Indies vs India Live Score Ball by Ball, West Indies vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-live-score-over-2nd-t20i-t20-1-5-updates-3215066","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between West Indies vs India from Warner Park, Basseterre, St Kitts. Check commentary and full scoreboard of the match.","content":"Follow the West Indies vs India, 2022 live cricket score on Sports.NDTV.com . After 4.2 overs, India are 40/3. Get live score, ball by ball commentary and much more. Keep track of West Indies vs India, 2022 today match between West Indies and India. Everything related to West Indies and India match will be available on Sports.NDTV.com . Stay updated with West Indies vs India live score. Do check for West Indies vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Who will be the next batter in? 4.2 overs (0 Run) OUT! c Devon Thomas b Alzarri Joseph. 4.1 overs (0 Run) A length ball, sliding into the pads, Iyer tries to clip it away but misses. He gets rapped on his pads. Change of ends for Alzarri Joseph. He is back on. 3.6 overs (0 Run) Good length, around off, blocked to backward point. 3.5 overs (2 Runs) In the air but safe! Full length, outside off. Rishabh Pant stays back and throws his blade at it. He ends up splicing it towards long off. The fielder from mid off gives it a chase but it lands safely in front of him. They take two. 3.4 overs (6 Runs) SIX! Innovative and effective. It is a short ball, on middle and leg. Rishabh Pant shuffles across and smokes it over the fine leg fence. 3.3 overs (2 Runs) Great running yet again! It is a length ball, on the pads, Pant flicks it into the gap at mid-wicket. Odean Smith gives it a chase. The call is for two, they push hard for the first one, but denied the second as the fielder reached it. Although he fumbles, which allows them to take another run. 3.2 overs (2 Runs) A short ball, on off. Pant pulls it to deep mid-wicket along the ground. The batters push hard and gets back for the second run convincingly. 3.1 overs (1 Run) Back of a length, outside off. Iyer stays back and slaps it to mid off for a quick single. Odean Smith is into the attack now as he replaces Alzarri Joseph. 2.6 overs (3 Runs) Great fielding by the skipper this time. Setting up an example for his side. It is full, outside off. Shreyas Iyer leans in and drives it over covers. Nicholas Pooran gives it chase and keeps it in play with a brilliant dive in the nick of time. The batters take three. 2.5 overs (0 Run) Slightly short, on off. Iyer hops inside the crease and defends it out. 2.4 overs (1 Run) Length ball, on off. Pant pushes it to cover for a single. 2.3 overs (6 Runs) SIX! This is huge! A freebie for Pant's standard. It is full, sliding down leg. Pant stays back and flicks it over the square leg fence for a biggie. He is making his intent clear. 2.2 overs (0 Run) Touch fuller, on off. Pant blocks it to cover. Rishabh Pant walks out to the middle. 2.1 overs (0 Run) OUT! CAUGHT BEHIND! Another man bites the dust for India. Obed McCoy gets his second wicket of the innings. He has sent back both the openers in a jiffy. It is full, outside off, angling across the right-hander. Suryakumar Yadav tries to drive on the up, but only manages to get a thick outside edge. Devon Thomas makes no mistake behind the stick. India in a spot. 1.6 overs (6 Runs) SIX! All the way! Shreyas Iyer now gets into the act. Fuller length, outside off. It is a half-volley. Shreyas Iyer tonks it over the wide long on fence for a maximum. 1.5 overs (3 Runs) Into the gap! It is full, on the pads. Suryakumar Yadav stays back and wrists it through mid-wicket. Three runs taken. 1.4 overs (2 Runs) Overthrows! Fuller, on off. Yadav pushes it to extra cover. The batters take one. There is an overthrow which allows the batters to sneak another one. 1.3 overs (6 Runs) SIX! Suryakumar Yadav gets off the mark with a biggie. It is a length ball, outside off, Suryakumar Yadav expands his arms and lofts it over extra cover. He hits it clean enough to send it into the stands. 1.2 overs (0 Run) Suryakumar Yadav stays back to this good length delivery and dabs it down to short third man. 1.1 overs (0 Run) A length ball, on off. Yadav stays back and defends it out solidly. Alzarri Joseph will start from the other end. 0.6 over (0 Run) A wicket-maiden for Obed McCoy. An incredible start for the hosts. It is full, on middle and leg. Shreyas Iyer clips it to mid-wicket. 0.5 over (0 Run) McCoy dishes it full and on off. Iyer blocks it out watchfully. 0.4 over (0 Run) Hits it too straight! It is full, on off. Iyer leans forward, drives it down the ground, only to disturb the stumps at the non-striker's end. 0.3 over (0 Run) Touch short, on middle and leg. Iyer tucks it to square leg. 0.2 over (0 Run) McCoy fires it full, on off. Shreyas Iyer stays back and blocks it out watchfully. Shreyas Iyer walks out at number 3! 0.1 over (0 Run) OUT! CAUGHT! A dream start for West Indies. Rohit Sharma walks back on a golden duck. Obed McCoy starts his spell with a good-length delivery, around off. This one flies off the deck. It get big on Rohit Sharma. He lifts his blade to block it out but gets it to short third man off the thick outside edge. Akeal Hosein leaps and takes a sharp catch over his head. Timed his jump to perfection. We are all set to begin! The West Indies players are in the huddle. They disperse now to take their respective positions. Rohit Sharma and Suryakumar Yadav are the openers for India. So, India sticking with SKY at the top of the order but he has come out wearing Arshdeep Singh's T-shirt out in the middle. Remember, the reason for the delay? Anyway, the West Indies players now take the knee in support of the Black Lives Matter movement while the Indian players keep their hand on the heart in support of the movement. It will be Obed McCoy to start with the ball. Here we go... Rohit Sharma, the skipper of India starts by saying that the first game was quite pleasing. It was not the easiest of the pitch but they managed to stuck to their plan. Mentions they want the guys to bat anywhere. T20 cricket is a different form of cricket and aims that the boys are flexible enough but cenrtain players are meant for certain roles and they need to focus on that. Adds, with the wind blowing across heavily they wanted to try an extra pacer. Hence Avesh Khan comes in for Ravi Bishnoi. Ends by saying it is very unfortunate for Bishnoi to miss out. Nicholas Pooran, the skipper of West Indies, says that they will bowl first. He says that the wicket looks really nice and they will look to chase down the total. He adds that they will look to improve from the last game and execute their plans better in this one. He says that it's a new ground and new conditions and they will look to play according to it. He ends by saying Keemo Paul and Shamarh Brooks are out and Brandon King and Devon Thomas replaces them. India (Playing XI) - Rohit Sharma (C), Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (WK), Hardik Pandya, Ravindra Jadeja, Dinesh Karthik, Ravichandran Ashwin, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan (In place of Ravi Bishnoi). West Indies (Playing XI) - Kyle Mayers, Devon Thomas (WK) (In place of Keemo Paul), Brandon King (In place of Shamarh Brooks), Jason Holder, Nicholas Pooran (C), Rovman Powell, Shimron Hetmyer, Akeal Hosein, Odean Smith, Alzarri Joseph, Obed McCoy. TOSS - The coin goes up and lands in favour of Nicholas Pooran. West Indies have elected to BOWL first. As we wait for the action to unfold, let's just try to figure out the team combination India might go with in today's game. The usual cricketing nous says that after a comfortable win in the first game, India will field an unchanged XI. However, will they open with SKY alongside Rohit Sharma again? Or will they go back to Pant who was opening with Rohit in England? Another option will be to replace Pant with either Ishan Kishan or Sanju Samson. Kishan has done quite well in the opportunities he has got so far while we all know what Sanju Samson can bring to the table. Indian team selection nowadays has become quite fascinating and we should probably stop with the discussion as this discussion can get endless and we are still not into the middle order and bowling department. We shall probably just wait for the toss and figure out what Rohit Sharma and team management decide. Toss is just a few minutes away…","pubDate":"2022-08-01 17:09:49","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637949903734765052.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI 2nd T20I: 'International cricket h ya gully?', Fans angry as match gets delayed for second time, check reacts HERE","link":"https://zeenews.india.com/cricket/ind-vs-wi-2nd-t20i-international-cricket-h-ya-gully-fans-angry-as-match-gets-delayed-for-second-time-check-reacts-here-2492082.html","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI 2nd T20I has been delayed twice due to various reasons and fans were pleased with it","content":"First the match was delayed by 2 hours due to the players not receiving their luggage on time. First it was delayed to 10PM (IST) with 9:30 PM as toss time. Shockingly, it has been delayed again and scheduled for 11PM (IST). Neither BCCI or Windies cricket social media handles have updated of second delayed news till now, but the livestreaming site Fancode for the India tour of West Indies 2022 have stated, \"It is now supposed to start at 11 PM, which means the toss should be at 10:30PM. It will still be a 20 over game.\" (Know the reason why the India vs West Indies 2nd T20I was delayed first time HERE) Fans were not pleased with the match getting delayed twice and took social media expressing some angry reactions. Checkout the trolls and reactions here... @cricketaakash @rjraunac @BCCI @ICC IND vs wi ye international match hai ki Gally cricket match abhi tak koi player's nahi pahuche ground par — Hasan Dawar (@HasanDawar66) August 1, 2022 It seems so unprofessional by Windies board......never seen this kind of incident in any international cricket tournament..... #IndvsWI #WIvsIND #INDvWI #Cricket #CricketTwitter — Dr.Harinder Singh (@professorsahaab) August 1, 2022 Why IND vs WI 2nd T20I residual again and again ?? @BCCI @windiescricket @CricInformer @FANEXPOCANADA @Dream11 @fantasy1Cricket — Raj Kishor Singh (@itsrksingh22) August 1, 2022 Match end time will be match start time, just because of stupid luggage. Zomato could deliver in 30 minutes flat. #IndvsWI — Manoj Funny (@Manoj49151909) August 1, 2022 Me to @CricCrazyJohns right now : #IndvsWI pic.twitter.com/NG82YftTKI — Meme Professor (@Meme_Professor9) August 1, 2022 Talking about the previous T20I fixture, India outplayed West Indies not only in all three departments of the game, but also in terms of playing eleven combination. India opted for three spinners in Ravi Bishnoi, Ravichandran Ashwin and Ravindra Jadeja while West Indies played just one spinner in Akeal Hosein. Eventually, Bishnoi, Ashwin and Jadeja shared five wickets between themselves as they exposed West Indies batting issues in terms of facing spin while left-arm spinner Hosein took 1-14 in his four overs. Apart from this, West Indies also erred in ground fielding and allowed Rohit Sharma and Dinesh Karthik to play critical knocks with the bat. (IND vs WI 2nd T20I Dream11 prediction) Thanks to Sharma and Karthik, India continued with their aggressive batting template in T20Is, posting 190 batting first. But they will need to sort out who opens the batting with Sharma in absence of KL Rahul, as India sprung a surprise by promoting Suryakumar Yadav to open the batting with Rishabh Pant, who opened in two matches against England, slotted in middle-order. WI vs IND Probable Playing XI West Indies: Shamarh Brooks, Shimron Hetmyer, Rovman Powell, Nicholas Pooran (c & wk), Kyle Mayers, Jason Holder, Akeal Hosein, Odean Smith, Keemo Paul, Alzarri Joseph, Obed McCoy India: Rohit Sharma (c), Rishabh Pant (wk), Shreyas Iyer, Suryakumar Yadav, Hardik Pandya, Dinesh Karthik, Ravindra Jadeja, Ravi Bishnoi, Bhuvneshwar Kumar, Ravichandran Ashwin, Arshdeep Singh","pubDate":"2022-08-01 16:30:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE IND vs WI 2nd T20I Cricket Score and Updates: Match Postponed Again; Rescheduled to 11:00 PM IST - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi5wFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaW5kLXZzLXdpLTJuZC10MjBpLWNyaWNrZXQtc2NvcmUtd2FybmVyLXBhcmstc3Qta2l0dHMtdG9zcy1tYXRjaC11cGRhdGVzLWluZGlhLXZzLXdlc3QtaW5kaWVzLTJuZC10MjBpLWxpdmUtc3RyZWFtaW5nLWRkLXNwb3J0cy1mYW5jb2RlLWJhbGwtYnktYmFsbC1jb21tZW50YXJ5LW1hdGNoLXBvc3Rwb25lZC10by0xMS1wbS1pc3QtNTU0NzExNy_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs WI 2nd T20I Cricket Score and Updates: Match Postponed Again; Rescheduled to 11:00 PM IST  India.comMatch Preview - West Indies vs India, India in West Indies 2022, 2nd T20I  ESPNcricinfoWI vs IND: 2nd T20I Between India And West Indies To Start At 10 PM IST Due To Delay In Team Luggage Arrival  Cricket AddictorMust have been some thought process behind Suryakumar Yadav opening in the first T20I: Bhuvneshwar Kumar  India TodaySecond West Indies vs India T20I to start two hours late following delay in arrival of teams' luggage  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-08-01 16:05:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"McGrath: ‘T20 has shown batters what they can achieve, they are now playing Test cricket without fear’","link":"https://sportstar.thehindu.com/cricket/glenn-mcgrath-t20-test-cricket-england-ben-stokes-brendon-mccullum/article65712588.ece","keywords":null,"creator":["\n        S. Dipak Ragav  \n    "],"video_url":null,"description":"Former Aussie great lauds England’s approach in red-ball cricket.","content":"Former Australian pacer Glenn McGrath heaped praises on England’s new approach to Test cricket, appreciating the fearless aspect the team has brought under skipper Ben Stokes and coach Brendon McCullum. Last month, England defeated New Zealand 3-0 before beating India in the one-off Test chasing 378 in the fourth innings. Speaking on Monday at the MRF Pace Foundation where he is Director of Coaching, McGrath said, “They have come out and said they want to be aggressive. In that fourth innings, even if they lose wickets and the pressure builds, their attitude is ‘let us not worry about it.’ They want to go out and play a positive brand of cricket. If you can get a team to play without fear, it is amazing what you can achieve.” “T20 has shown batters what they can achieve and they are now playing Test cricket without fear. Bowlers need to find a way to combat that and have to figure out the right plans,” he added. It has been ten years since McGrath took over the reins from Dennis Lillee at the Pace Foundation. On his stint so far, McGrath said, “our goal was to continue what Dennis had built and not to reinvent anything. My strength is the mental side of the game, the preparations, the routines and the way you go about taking wickets. To see 29 of our boys who have been through us play in the IPL, was good. Prasidh Krishna and Avesh Khan have gone on to represent India in the shorter formats and that is what it is all about.” McGrath, who was a key member of the dominant Australian team that won three consecutive World Cups (50 overs) felt that there needs to be some changes done to keep one-day cricket relevant. Recently Ben Stokes retired from ODIs and players like R. Ashwin have also said they feared for the format’s relevance. “I am a traditionalist so I would like to preserve Test cricket. I would like to think the format is relevant but they have to keep making it exciting, a good product that broadcasters want to show. They have a few challenges,” said the Australian great. Read more stories on Cricket.","pubDate":"2022-08-01 15:35:39","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"The Hundred sponsors: Full list of new The Hundred 2022 sponsors","link":"https://thesportsrush.com/cricket-news-the-hundred-sponsors-full-list-of-new-the-hundred-2022-sponsors/","keywords":["Cricket","Hundred cricket","The Hundred"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"The Hundred sponsors: The SportsRush brings you the list of all the sponsors of the 2nd season of the Hundred competition. When the Hundred cricket was launched in 2020, it was heavily criticized even in England because of the new format introduced. The tournament was delayed in 2020 due to the Covid pandemic, and it… The post The Hundred sponsors: Full list of new The Hundred 2022 sponsors appeared first on The SportsRush.","content":"The Hundred sponsors: The SportsRush brings you the list of all the sponsors of the 2nd season of the Hundred competition. When the Hundred cricket was launched in 2020, it was heavily criticized even in England because of the new format introduced. The tournament was delayed in 2020 due to the Covid pandemic, and it was finally played last year. The tournament also collides with the other domestic tournaments in England. However, despite all the negativities around, the tournament was a huge hit. The stadiums were completely filled, whereas the TV ratings were also quite high of the competition. The 2nd edition of the Hundred is set to start from 3 August 2022 with the match between Southern Brave and Welsh Fire. Southern Brave won the tournament last season, and they will again be looking to hold their crown. There will be a total of 34 matches each in the Men’s and Women’s competitions. The squads of all the eight teams are finalized, and there are some star players involved in the tournament. Wondering how to start building your team? 🏗 @Eoin16 & @sambillings have some suggestions… #TheHundredFantasyGame pic.twitter.com/rtHoktNvlh — The Hundred (@thehundred) August 1, 2022 The Hundred 2021 was a success, and there is no shortage of sponsors for the 2nd edition of the tournament. Sky Sports and BBC Sport are broadcasting partners of the same, and they will broadcast the match live in the UK and Ireland. Dream11 is one of the official sponsors, and it is the official fantasy app in India as well. Masuri is the official helmet partner of the tournament, whereas NB Sports is the official kit sponsor. The full list of the Hundred 2022 sponsors are mentioned below. Official Broadcast Partners: Sky Sports and BBC Sport Principal Partner: Cazoo Official Team Partner: KP Snacks Official Partner: Dream11 and Lifebuoy Official Soft Drink: Robinsons Official Insights Partner: Sage Official Partner: Sure Official Wellness Partner: Vitality Official Helmet Sponsor: Masuri Official Kit Partner: NB Team Sports Official Hot Partner: New Era Official Child’s Smartwatch Supplier: Xplora","pubDate":"2022-08-01 15:07:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket — Nilesh Kulkarni rewinds the clock to an ecstatic yet agonising debut","link":"https://www.thehindu.com/sport/cricket/cricket-nilesh-kulkarni-rewinds-the-clock-to-an-ecstatic-yet-agonising-debut/article65711692.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"25 years since his record on Test debut, left-arm spinner Nilesh Kulkarni relives the experience","content":null,"pubDate":"2022-08-01 14:58:01","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"‘It’s a reality check’ – Jos Buttler vows to have ‘honest chat’ with his England team after T20 series defeat to South Africa","link":"https://metro.co.uk/2022/08/01/cricket-jos-buttler-reacts-england-t20-series-defeat-south-africa-world-cup-17106426/","keywords":["Cricket","Cricket World Cup","England cricket","India Cricket","Jos Buttler","South Africa cricket"],"creator":["Louis Sealey"],"video_url":null,"description":"England failed to win a home white-ball series this summer.","content":"Jos Buttler’s England failed to win a white-ball series at home this summer (Picture: Getty) Jos Buttler has vowed to have an ‘honest chat’ with his England team after they slipped to a T20 series defeat to South Africa and failed to win a home white-ball series this summer. England were bowled out for just 101 in Sunday’s T20I decider against South Africa in Southampton, with the tourists sealing an emphatic 90-run win to take the series 2-1. Buttler’s side lost by the same margin in their T20 and ODI series against India earlier in the summer, while they could only draw the 50-over series against South Africa. Buttler replaced 2019 World Cup-winning captain Eoin Morgan at the helm in late June and admits England’s recent results should act as a ‘reality check’ ahead of the T20 World Cup which takes place in Australia later in the year. ‘I think it is a reality check,’ Buttler said. ‘We haven’t played our best cricket by a long stretch and I don’t think we have been able to impose ourselves. ‘We can’t live in the past and pat ourselves on the backs for the changes that have been made in English cricket and the successes we have had. ‘It’s about looking forward, trying to chase the best teams in the world and being at the forefront of that. South Africa beat England in Sunday’s T20I decider (Picture: Getty) ‘We do need an honest chat. You don’t want to overreact to situations but you could sense the frustration around the ground with the “get on with it, England” chants. ‘You don’t want to be associated with that. It is the first time I have heard that for a very long time, so that frustration around the group shows we weren’t managing to put on the show we want to put on. ‘You can cope with losing but you want to make sure you stay true to what you believe in and I think we fell well short with the way we played. ‘The disappointing thing was the way we went down. We lacked intent and confidence and didn’t put the opposition under pressure. We never managed to fire shots and wrestle the initiative. ‘I think that bit of timidness is probably the thing we are frustrated with most. We want to be a team that wants to be brave and take risks. ‘We have to work out where that lack of consistency comes from. Whether it’s over-confidence or lack of confidence, we have not been able to back up performances. As individuals and as a team we have not played our best. ‘The first place I would look is myself. I want to lead from the front as captain and I know I haven’t performed at the level I would like to.’ England play ten more 20-over matches before they will attempt to win the T20 World Cup for the second time, following a semi-final exit in the last edition in November. Buttler with England white-ball coach Matthew Mott (Picture: Getty) Australian Matthew Mott, who was appointed as England’s limited-overs coach in May, added: ‘We were down on confidence with bat and ball. ‘We’ll want to use The Hundred really well to get that confidence so when we get ready for Pakistan and the World Cup we’re a bit of a different team.’ While England’s white-ball team now face a two-month wait before their next fixture, the Test side begin a three-match series against South Africa on August 17. MORE : Steve Smith mocks England’s Test cricket Bazball revolution MORE : Moeen Ali reacts to setting England T20 record in South Africa win For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-08-01 14:46:25","image_url":"https://metro.co.uk/wp-content/uploads/2022/08/GettyImages-1242226404.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Is The Hundred on BBC: The Hundred Cricket Live Telecast in India on which channel","link":"https://thesportsrush.com/is-the-hundred-on-bbc-the-hundred-cricket-live-telecast-in-india-on-which-channel/","keywords":["Cricket","100 cricket","Hundred cricket","The Hundred"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Is The Hundred on BBC: The SportsRush brings you the list of broadcasters of the Hundred cricket in India and the UK. Cricket’s brand new format, the Hundred cricket is back with its second season, and there is a lot of buzz regarding it. The first season was a huge hit despite a lot of… The post Is The Hundred on BBC: The Hundred Cricket Live Telecast in India on which channel appeared first on The SportsRush.","content":"Is The Hundred on BBC: The SportsRush brings you the list of broadcasters of the Hundred cricket in India and the UK. Cricket’s brand new format, the Hundred cricket is back with its second season, and there is a lot of buzz regarding it. The first season was a huge hit despite a lot of negativities around regarding the rules and format , but the audience loved the format, and the same is expected this time around as well. Southern Brave won the title last time around, and they will be up against Welsh Fire in the first match of the season on 3 August 2022. Birmingham Phoenix were the dominating side last season, but they lost in the finals. The competition’s star value has certainly increased this time around. Also Read: Full fixtures of the Hundred 2022 Sky Sports has gained the right to broadcast all the matches of both Men’s and Women’s competitions of the Hundred in the UK and Ireland. The users can watch all 68 games of the competition live on Sky Sports Cricket, Sky Sports Main Event and Sky Sports Mix. There is also a dedicated channel for the Hundred on Sky Sports. BBC have gained the right to broadcast a total of 18 games live on BBC TV (10 men’s and 8 women’s), which will include both the finals. Although, all the 68 games will be broadcasted live on BBC Radio 5 Live or 5 Live Sports Extra. , The Hundred is Join us for a chance to win tickets to games, play with pros and take on a bowling machine pic.twitter.com/zleQJoOG5V — Sky Sports (@SkySports) July 31, 2022 The first edition of the Hundred cricket gained quite a lot of popularity in the Indian market as well, but it was not televised on the TV last year. The same case will continue this season as well, Fancode will be only streaming the competition digitally in India. Fancode has signed a 4-years deal with the England and Wales Cricket Board (ECB) for the same. The users will have to buy a subscription pass in order the watch the match live on Fancode. There will be different kinds of options available for the fans, and they can choose their package accordingly.","pubDate":"2022-08-01 14:39:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ZIM vs BAN 3rd T20I Dream11 prediction: Fantasy cricket tips for Zimbabwe vs Bangladesh 3rd T20I in Harare","link":"https://www.dnaindia.com/cricket/report-zim-vs-ban-3rd-t20i-dream11-prediction-fantasy-tips-for-zimbabwe-vs-bangladesh-3rd-t20i-in-harare-fancode-2973149","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"ZIM vs BAN 3rd T20I Dream 11 Team - Check My Dream11 Team, Best Player's list for Zimbabwe vs Bangladesh 3rd T20I in Harare.","content":null,"pubDate":"2022-08-01 14:29:45","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Start of 2nd T20I between India and West Indies pushed back by 2 hours","link":"https://www.business-standard.com/article/sports/start-of-2nd-t20i-between-india-and-west-indies-pushed-back-by-2-hours-122080101228_1.html","keywords":null,"creator":null,"video_url":null,"description":"The start of the second T20I between India and West Indies has been pushed back by two hours due to a delay in arrival of team luggage, Cricket West Indies (CWI) said on Monday. \"Due to circumstances beyond CWI's control, there have been significant delays in crucial team luggage arriving into St Kitts from Trinidad. As a result, today's match 2nd Goldmedal T20 Cup match is due to start at 12.30 pm (10 PM India time),\" the Cricket West Indies said in the statement. The match is scheduled to be played at the Warner Park. India lead the five-match series 1-0 following their 68-run win in the lung-opener at the Brian Lara Cricket Academy in Trinidad.","content":"The start of the second T20I between India and West Indies has been pushed back by two hours due to a delay in arrival of team luggage, Cricket West Indies (CWI) said on Monday. \"Due to circumstances beyond CWI's control, there have been significant delays in crucial team luggage arriving into St Kitts from Trinidad. As a result, today's match 2nd Goldmedal T20 Cup match is due to start at 12.30 pm (10 PM India time),\" the Cricket West Indies said in the statement. The match is scheduled to be played at the Warner Park. India lead the five-match series 1-0 following their 68-run win in the lung-opener at the Brian Lara Cricket Academy in Trinidad. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-08-01 14:27:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220801/thumb-122080101228.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Why today match is delayed: Why toss is delayed in India vs West Indies 3rd T20I in St Kitts?","link":"https://thesportsrush.com/cricket-news-why-today-match-is-delayed-why-toss-is-delayed-in-india-vs-west-indies-3rd-t20i-in-st-kitts/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Why today match is delayed: The 2nd T20I match between West India and India at St. Kitts has been officially delayed. West Indies will take on India in the 2nd T20I of the 5-match T20I series at Warner Park in St Kitts. Team India is coming on the back of a brilliant win in the… The post Why today match is delayed: Why toss is delayed in India vs West Indies 3rd T20I in St Kitts? appeared first on The SportsRush.","content":"Why today match is delayed: The 2nd T20I match between West India and India at St. Kitts has been officially delayed. West Indies will take on India in the 2nd T20I of the 5-match T20I series at Warner Park in St Kitts. Team India is coming on the back of a brilliant win in the last match, and they would want to stamp their authority in this one as well. West Indies, on the other hand, are looking to level the T20I series. The batting of the Indian team struggled in the last game apart from Dinesh Karthik and Rohit Sharma. This track won’t easy to bat on as well if the record of T20Is are taken into consideration. The bowling lineup of the Indian team looks set, and they will again be looking to do well. West Indies lost the ODIs easily, whereas they are still searching for their best eleven in the T20Is as well. Jason Holder batted at number three in the last match. The hosts may make some changes in this match. However, the start of the 2nd T20I has been officially delayed. Why today match is delayed The 2nd T20I between West Indies and India at the Warner Park in St. Kitts has been delayed by a couple of hours due to a significant delay in the team’s luggage arriving in St Kitts from Trinidad. Cricket West Indies released an official statement of the same as well. “Due to circumstances beyond CWI’s control, there have been significant delays in crucial team luggage arriving into St Kitts from Trinidad. As a result, today’s match 2nd Goldmedal T20 Cup match is due to start at 12:30 pm (11:30am Jamaica/10pm India). CWI regrets any inconvenience caused to our valued fans, sponsors, broadcast partners and all other stakeholders,” Cricket West Indies said in their statement. Our broadcast for 2nd T20I between West Indies and India will start at 9 PM. Game starts at 10 PM #WIvIND — Doordarshan Sports (@ddsportschannel) August 1, 2022 The match was scheduled to start at 8:00 pm IST, but it has now been postponed to 10 pm IST. In a respite, the weather is looking good for the day, so despite the delay, we can expect a full encounter without any weather dissruptions. The post Why today match is delayed: Why toss is delayed in India vs West Indies 3rd T20I in St Kitts? appeared first on The SportsRush.","pubDate":"2022-08-01 14:20:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket legends join family at service for ‘Mr Yorkshire’ Harry Gration","link":"https://ca.sports.yahoo.com/news/cricket-legends-join-family-mr-132636704.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-08-01 13:41:07","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"IND vs WI today match time toss: India vs West Indies T20 start time at Warner Park","link":"https://thesportsrush.com/cricket-news-ind-vs-wi-today-match-time-toss-india-vs-west-indies-t20-start-time-at-warner-park/","keywords":["Cricket","India","India tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs West Indies T20 start time: India will be playing a match in St Kitts for the first time since their tour in 2006. The second T20I of the ongoing India’s tour of West Indies will be played in Basseterre tonight. Having played only two matches in St Kitts till date, India will step… The post IND vs WI today match time toss: India vs West Indies T20 start time at Warner Park appeared first on The SportsRush.","content":"India vs West Indies T20 start time: India will be playing a match in St Kitts for the first time since their tour in 2006. The second T20I of the ongoing India’s tour of West Indies will be played in Basseterre tonight. Having played only two matches in St Kitts till date, India will step on the field at the Warner Park only for the third time in search of a maiden victory. Not just unbeaten on this tour but unbeaten against West Indies in the last 12 white-ball matches played across almost 33 months as well, India will need a miraculous performance from the opposition to put a halt to their winning streak. Readers must note that India have won 30 and lost just three out of their last 35 matches across formats against West Indies. ALSO READ: Highest innings total and highest successful run-chase at Warner Park, Basseterre, St Kitts Having refrained from making changes to their winning combinations lately, expect India to play with the same XI in this match. Having said that, a change in the batting order might still be on the cards. Meanwhile, the hosts are likely to make changes in a bid to return to winning ways. India vs West Indies T20 start time Originally scheduled to begin at 10:30 AM (local time), the third West Indies vs India T20I has been delayed by a couple of hours due to logistical errors. According to a CWI (Cricket West Indies) statement, team luggage didn’t arrive in St Kitts on time. “Due to circumstances beyond CWI’s control, there have been significant delays in crucial team luggage arriving into St Kitts from Trinidad. As a result, today’s match 2nd Goldmedal T20 Cup match is due to start at 12:30 pm (11:30am Jamaica/10pm India),” read CWI’s statement. Today’s game is delayed by two hours because the luggage hasn’t arrived. True. — Harsha Bhogle (@bhogleharsha) August 1, 2022 Meant to be a prime time start for the Indian audiences, the match will now run late into the night. A 10:00 PM (IST) start means that the match could well be played till around 02:00 AM on Tuesday. As far as the toss is concerned, it will happen at 12:00 PM and 09:30 PM according to West Indian and Indian time zones respectively. The post IND vs WI today match time toss: India vs West Indies T20 start time at Warner Park appeared first on The SportsRush.","pubDate":"2022-08-01 13:40:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘A different unit’: England white-ball cricket coach Mott asks for patience","link":"https://ca.sports.yahoo.com/news/different-unit-england-white-ball-133907202.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-08-01 13:39:07","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"IND vs WI Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND vs WI 2nd T20 at Warner Park in Basseterre, St Kitts, 10 PM IST, August 1","link":"https://zeenews.india.com/cricket/ind-vs-wi-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-vs-wi-2nd-t20-at-warner-park-in-basseterre-st-kitts-10-pm-ist-august-1-2491735.html","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs India Dream11 Team Prediction West Indies vs India 2nd T20 - Check My Dream11 Team, Best players list of WI vs IND, West Indies Dream11 Team Player List, India Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"After registering a comprehensive 68-run win in the first T20I at Trinidad, India will be aiming to make it 2-0 against the West Indies in the second T20I at Warner Park in Basseterre, St Kitts on Monday (August 1). With both teams now making the travel to St Kitts & Nevis for back-to-back matches, it presents a great chance for India to continue their winning juggernaut on tour. At the Brian Lara Stadium in Tarouba, India outplayed West Indies not only in all three departments of the game, but also in terms of playing eleven combination. India opted for three spinners in Ravi Bishnoi, Ravichandran Ashwin and Ravindra Jadeja while West Indies played just one spinner in Akeal Hosein. Eventually, Bishnoi, Ashwin and Jadeja shared five wickets between themselves as they exposed West Indies batting issues in terms of facing spin while left-arm spinner Hosein took 1-14 in his four overs. Apart from this, West Indies also erred in ground fielding and allowed Rohit Sharma and Dinesh Karthik to play critical knocks with the bat. Thanks to Sharma and Karthik, India continued with their aggressive batting template in T20Is, posting 190 batting first. But they will need to sort out who opens the batting with Sharma in absence of KL Rahul, as India sprung a surprise by promoting Suryakumar Yadav to open the batting with Rishabh Pant, who opened in two matches against England, slotted in middle-order. Apart from spinners doing well, India will also be pleased with how senior pacer Bhuvneshwar Kumar and young left-arm fast bowler Arshdeep Singh went through their overs, taking wickets with accuracy and sorted approach to deny West Indies batting the start they needed. West Indies, on the other hand, would like to brush aside the thrashing they got from India after having come into the series with a 2-0 win over Bangladesh in T20Is. Despite the return of Shimron Hetmyer into the side, he didn’t bring the desired impact West Indies would have liked to see in the batting department. Match Details West Indies vs India, 2nd T20 Venue: Warner Park, Basseterre, St Kitts Date & Time: August 1 at 10 PM IST Live Streaming and TV details: Fancode WI vs IND Dream 11 Prediction Wicketkeeper: Dinesh Karthik Batters: Suryakumar Yadav, Shimron Hetmeyer, Rohit Sharma, Kyle Mayers All-rounders: Ravindra Jadeja Bowlers: Obed McCoy, Bhuvneshwar Kumar, Alzarri Joseph, Ravichandran Ashwin, Akeal Hossain Captain: Rohit Sharma Vice-Captain: Ravindra Jadeja WI vs IND Probable Playing XI West Indies: Shamarh Brooks, Shimron Hetmyer, Rovman Powell, Nicholas Pooran (c & wk), Kyle Mayers, Jason Holder, Akeal Hosein, Odean Smith, Keemo Paul, Alzarri Joseph, Obed McCoy India: Rohit Sharma (c), Rishabh Pant (wk), Shreyas Iyer, Suryakumar Yadav, Hardik Pandya, Dinesh Karthik, Ravindra Jadeja, Ravi Bishnoi, Bhuvneshwar Kumar, Ravichandran Ashwin, Arshdeep Singh","pubDate":"2022-08-01 13:38:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}