{"newsArray":[{"title":"Rohit named India Test captain as Pujara, Rahane dropped","link":"https://www.thenews.com.pk/print/935195-rohit-named-india-test-captain-as-pujara-rahane-dropped","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI: Rohit Sharma completing his takeover of the leadership across cricket formats after Virat Kohli’s exit.Rohit Sharma, now captain across all three formats of Indian cricket team will lead the 18-member squad and Jasprit Bumrah will be his deputy for the two Tests starting March 4...","content":null,"pubDate":"2022-02-20 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Yousuf emphasises match-scenario practice for batsmen","link":"https://www.thenews.com.pk/print/935184-yousuf-emphasises-match-scenario-practice-for-batsmen","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Pakistan cricket team batting coach Mohammad Yousuf has said that the match-scenario practice will help the boys to prepare for Test cricket.“After the Test series against Bangladesh boys have not played four-day cricket. It was important that our batsmen and bowlers remain in the...","content":null,"pubDate":"2022-02-20 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"James Faulkner banned for life from PSL","link":"https://www.thenews.com.pk/print/935181-james-faulkner-banned-for-life-from-psl","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Australian cricketer James Faulkner was on Saturday banned for life from the Pakistan Super League after his withdrawal from the tournament and blaming the Pakistan Cricket Board and his franchise Quetta Gladiators for not “honouring” a contractual agreement.The PCB and Quetta...","content":null,"pubDate":"2022-02-20 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"James Faulkner quits Pakistan Super League after contract dispute and ban - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAyLTIwL2phbWVzLWZhdWxrbmVyLXF1aXRzLXBha2lzdGFuLXN1cGVyLWxlYWd1ZS8xMDA4NDU5NjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"James Faulkner quits Pakistan Super League after contract dispute and ban  ABC News‘Reprehensible’: Aussie star in nuclear row  NEWS.com.auAustralian cricketer James Faulkner quits Pakistan Super League in contract dispute, gets banned  Wide World of SportsAussie star breaks chandelier, quits PSL in extraordinary pay dispute 'disgrace' - and the PSL fires right back  The RoarFaulkner quits Pakistan Super League in ugly payment row  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-02-19 23:26:11","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Reprehensible’: Aussie star in nuclear row","link":"https://www.cairnspost.com.au/sport/cricket/reprehensible-aussie-star-in-alleged-nuclear-falling-out/news-story/7f059c3767f63b9bbd9aceb341945fed","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Aussie cricket star James Faulkner has been handed a lifetime ban from the Pakistan Super League over sensational claims of “reprehensible” behaviour and counter claims of missed payments.","content":null,"pubDate":"2022-02-19 21:21:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Reprehensible’: Aussie star in nuclear row","link":"https://www.news.com.au/sport/cricket/reprehensible-aussie-star-in-alleged-nuclear-falling-out/news-story/7f059c3767f63b9bbd9aceb341945fed","keywords":null,"creator":null,"video_url":null,"description":"Aussie cricket star James Faulkner has been handed a lifetime ban from the Pakistan Super League over sensational claims of “reprehensible” behaviour and counter claims of missed payments.","content":null,"pubDate":"2022-02-19 21:21:00","full_description":"Aussie cricket star James Faulkner has been handed a lifetime ban from the Pakistan Super League over sensational claims of “reprehensible” behaviour and counter claims of missed payments. The 31-year-old made explosive allegations on social media he had made a decision to leave the competition immediately after claiming to have been lied to about payments for his involvement with the Quetta Gladiators. However, it was soon followed by a statement from the Pakistan Cricket Board alleging Faulkner’s behaviour at the tournament had been “reprehensible”. The star all-rounder was last year involved in another bitter falling out with the Hobart Hurricanes in the BBL where he publicly blasted the Big Bash franchise for what he claims was a “disrespectful” one-year contract extension. His departure from the Gladiators has now gone nuclear. “I apologise to the Pakistan cricket fans, but unfortunately I’ve had to withdraw from the last 2 matches and leave the @thePSLt20 due to the @TheRealPCB not honouring my contractual agreement/payments,” he posted on Twitter. “I’ve been here the whole duration and they have continued to lie to me. “It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace from the @TheRealPCB and @thePSLt20. I’m sure you all understand my position.” Pakistan cricket officials have denied his allegations and released a lengthy statement claiming it had paid 70 per cent of Faulkner’s contract to his British bank account in December. It is standard procedure for the remaining 30 per cent of playing contracts to be transferred to players’ accounts within 40 days after the PSL ends, according to The Associated Press . The cricket governing body claimed it had spoken with Faulkner about his grievances and claim the Australian had acted with “reprehensible and insulting behaviour” during the talks. “The PCB and Quetta Gladiators are disappointed and dismayed with the reprehensible behaviour of Mr James Faulkner, who was also part of the Abu Dhabi-leg of the HBL Pakistan Super League in 2021, and, along with all participants, has always been treated with utmost respect,” the statement alleged. “In the seven years of the HBL Pakistan Super League, no player has ever complained about the nonfulfillment of the PCB’s contractual obligations. “Instead, all players have only praised and appreciated the efforts of the PCB to make their stay, appearance and participation as comfortable as practically possible. This is evident that from the fact that most of these cricketers have continued to remain part of the PCB’s marquee event since 2016 and have helped the PCB to make the HBL PSL a strong and formidable brand as it stands today.” The statement detailed a series of allegations against Faulkner, claiming his payments were “fully up to date”. The statement alleged Faulkner’s behaviour at the tournament was considered to be “gross misconduct” by the league. The statement alleges Faulkner threatened and refused to participate in his side’s match against Multan Sultans on Friday afternoon until his money demands were met. The statement also tabled further allegations which have not been verified. It confirmed Faulkner left the country on Saturday. The Board claims he caused deliberate damage to hotel property and acted inappropriately and abusively at the airport ahead of his flight to Australia. The league has now handed him a lifetime ban, barring him from ever being available to nominate for the competition’s annual draft. “In wake of the above, and taking serious note of Mr James Faulkner’s gross misconduct that was an attempt to bring the PCB, Pakistan cricket and the HBL Pakistan Super League into disrepute, it has been unanimously agreed by the PCB and the franchises that Mr James Faulkner will not be drafted in future HBL Pakistan Super League events,” the statement outlined. The Tasmanian has not represented Australia since 2017. Faulkner was a standout performer in the Pakistan Super League last year, snaring 13 wickets in six games at an economy rate of 6.50 for the Lahore Qalandars. Pakistan cricket stars have since taken to Twitter to refute Faulkner’s claims of mistreatment during the tournament. “Disappointed with @JamesFaulkner44 comments who reciprocated Pakistan’s hospitality & arrangements by levelling baseless allegations,” Pakistan legend Shahid Afridi posted on Twitter. “We all have been treated with respect & never ever our payments have been delayed. “No one should be allowed to taint Pakistan cricket & the #HBLPSL brand.” Ahmad Shahzad also posted he was “disappointed” by Faulkner’s public comments, declaring the Aussie “should instead be grateful as despite his tantrums he was facilitated in his safe return by Pakistan Government”. New Zealand legend Brendan McCullum thought the first Test against South Africa would be close but he couldn’t have been much more wrong. Hayden Kerr is one of Australian cricket’s rising stars but a major milestone was dashed by a man he knows very well. Australia has dominated Sri Lanka in the sides’ five-match T20I series but one glaring issue has put a dampener on the spectacle.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie star quits PSL over 'disgraceful' dispute","link":"https://wwos.nine.com.au/cricket/pakistan-super-league-james-faulkner-quits-quetta-gladiators-psl-bans-australian/ac5bc3ee-5b17-4556-b211-b74ae6f3baa4","keywords":null,"creator":["wwos"],"video_url":null,"description":"James Faulkner quit the Pakistan Super League last night and alleged that organisers failed to honour his contract.","content":"Quetta Gladiators fast bowler James Faulkner quit the Pakistan Super League last night and alleged that organisers failed to honour his contract, a claim the country's cricket board vehemently refuted.Faulkner claimed the Pakistan Cricket Board lied to him during his six-game stint in the league.\"I apologise to the Pakistan cricket fans. But unfortunately, I've had to withdraw from the last 2 matches and leave the (PSL) due to the (PCB) not honouring my contractual agreement/payments,\" he wrote on Twitter. \"I've been here the whole duration and they have continued to lie to me.\"READ MORE: Bellamy reveals Papenhuyzen injury headacheREAD MORE: Special haka tribute for Kiwi Olympic herohttps://twitter.com/JamesFaulkner44/status/1494975761144504327The 31-year-old Australian said it \"hurts to leave\" because he wanted to help \"get international cricket back in Pakistan ... But the treatment I have received has been a disgrace from the (PCB) and (PSL). I'm sure you all understand my position.\"Pakistan's cricket officials disagreed, however, and banned Faulkner from future editions of its premier domestic Twenty20 league.The PCB said it paid 70 per cent of Faulkner's contract to his British bank account in December and that \"the receipt of this payment was acknowledged by Mr Faulkner.\" The remaining 30 per cent is transferred to players' accounts within 40 days after the PSL ends.The board said Faulkner's agent revised his bank information to an Australian account in January and that the player insisted that \"a second duplicate payment of the same amount be made to his account in Australia.\"Despite Faulkner's \"reprehensible and insulting behaviour\" during talks on Friday, the board said, it assured the Australian that his grievances would be addressed. Still, he pulled out of the crucial game for Quetta against Multan and demanded that his travel arrangements be made immediately.Faulkner, according to the PCB, caused deliberate damage to hotel property and acted inappropriately and abusively at the airport ahead of his flight to Australia.\"Taking serious note of James Faulkner's gross misconduct that was an attempt to bring the PCB, Pakistan cricket and the Pakistan Super League into disrepute, it has been unanimously agreed by the PCB and the franchises that James Faulkner will not be drafted in future Pakistan Super League events,\" the board said.Faulkner took six wickets in six games for Quetta this season and scored 49 runs.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-19 21:09:17","full_description":"Quetta Gladiators fast bowler James Faulkner quit the Pakistan Super League last night and alleged that organisers failed to honour his contract, a claim the country's cricket board vehemently refuted. Faulkner claimed the Pakistan Cricket Board lied to him during his six-game stint in the league. \"I apologise to the Pakistan cricket fans. But unfortunately, I've had to withdraw from the last 2 matches and leave the (PSL) due to the (PCB) not honouring my contractual agreement/payments,\" he wrote on Twitter. \"I've been here the whole duration and they have continued to lie to me.\" READ MORE: Bellamy reveals Papenhuyzen injury headache READ MORE: Special haka tribute for Kiwi Olympic hero The 31-year-old Australian said it \"hurts to leave\" because he wanted to help \"get international cricket back in Pakistan ... But the treatment I have received has been a disgrace from the (PCB) and (PSL). I'm sure you all understand my position.\" Pakistan's cricket officials disagreed, however, and banned Faulkner from future editions of its premier domestic Twenty20 league. The PCB said it paid 70 per cent of Faulkner's contract to his British bank account in December and that \"the receipt of this payment was acknowledged by Mr Faulkner.\" The remaining 30 per cent is transferred to players' accounts within 40 days after the PSL ends. The board said Faulkner's agent revised his bank information to an Australian account in January and that the player insisted that \"a second duplicate payment of the same amount be made to his account in Australia.\" Despite Faulkner's \"reprehensible and insulting behaviour\" during talks on Friday, the board said, it assured the Australian that his grievances would be addressed. Still, he pulled out of the crucial game for Quetta against Multan and demanded that his travel arrangements be made immediately. Faulkner, according to the PCB, caused deliberate damage to hotel property and acted inappropriately and abusively at the airport ahead of his flight to Australia. \"Taking serious note of James Faulkner's gross misconduct that was an attempt to bring the PCB, Pakistan cricket and the Pakistan Super League into disrepute, it has been unanimously agreed by the PCB and the franchises that James Faulkner will not be drafted in future Pakistan Super League events,\" the board said. Faulkner took six wickets in six games for Quetta this season and scored 49 runs. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/411054/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Reprehensible’: Aussie quits over PSL ‘disgrace’ as pay dispute takes ugly public twist - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvZGlzYXBwb2ludGVkLWFuZC1kaXNtYXllZC1mYXVsa25lci1wY2ItdHJhZGUtYmxvd3MtYXMtcGF5LWRpc3B1dGUtdHVybnMtdWdseS9uZXdzLXN0b3J5L2RiMzM0MTI3OTM2N2ZlMmQwMjFmMzhhMTA5MjM3ZTU20gGdAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC9kaXNhcHBvaW50ZWQtYW5kLWRpc21heWVkLWZhdWxrbmVyLXBjYi10cmFkZS1ibG93cy1hcy1wYXktZGlzcHV0ZS10dXJucy11Z2x5L25ld3Mtc3RvcnkvZGIzMzQxMjc5MzY3ZmUyZDAyMWYzOGExMDkyMzdlNTY?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Reprehensible’: Aussie quits over PSL ‘disgrace’ as pay dispute takes ugly public twist  Fox Sports‘Reprehensible’: Aussie star in nuclear row  NEWS.com.auAustralian cricketer James Faulkner quits Pakistan Super League in contract dispute, gets banned  Wide World of SportsFaulkner quits Pakistan Super League in ugly payment row  cricket.com.auIf the report is true then strict action should be taken against James Faulkner, Younis Khan  ARY NewsView Full coverage on Google News","content":null,"pubDate":"2022-02-19 20:48:54","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Reprehensible’: Aussie star quits over PSL ‘disgrace’ as pay dispute takes ugly public twist","link":"https://www.foxsports.com.au/cricket/disappointed-and-dismayed-faulkner-pcb-trade-blows-as-pay-dispute-turns-ugly/news-story/db3341279367fe2d021f38a109237e56","keywords":null,"creator":null,"video_url":null,"description":"The Pakistani Cricket Board and Pakistan Super League outfit Quetta Gladiators have slammed James Faulkner after the Australian quit the side over a dispute in payments, branding his behaviour as “reprehensible”.","content":null,"pubDate":"2022-02-19 20:45:00","full_description":"The Pakistani Cricket Board and Pakistan Super League outfit Quetta Gladiators have slammed James Faulkner after the Australian quit the side over a dispute in payments, branding his behaviour as “reprehensible”. Having not played in the Gladiators’ previous three PSL fixtures, Faulkner confirmed he would play no further part for the remainder of the season despite wanting to “help get international cricket” back in the country. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > “I apologise to the Pakistan cricket fans. But unfortunately I’ve had to withdraw from the last 2 matches and leave @thePSLt20 due to the @TheReaclPCB not honouring my contractual agreements/payments,” Faulkner tweeted on Saturday night (AEDT). “I’ve been here the whole duration and they have continued to lie to me. “It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. “But the treatment I have received has been a disgrace from the @TheRealPCB and @thePSLt20. “I’m sure you all understand my position.” MORE COVERAGE Shield Wrap: Skipper stuns with ‘unbelievable’ catch; Test star’s statement knock Big Aussie ‘change’ could have Smith on outer … but Stoinis isn’t buying it Court documents lift lid on Tim Paine scandal as shocking sexts revealed Stoinis backs Smith's place in T20 team | 01:38 However, the PCB and the Gladiators issued a strongly worded statement in response, and listed a summary of facts. “The PCB and Quetta Gladiators are disappointed and dismayed with the reprehensible behaviour of Mr James Faulkner, who was also part of the Abu Dhabi-leg of the HBL Pakistan Super League in 2021, and, along with all participants, has always been treated with the utmost respect,” the statement read. “In the seven years of the HBL Pakistan Super League, no player has ever complained about the nonfulfillment of the PCB’s contractual obligations. “Instead, all players have only praised and appreciated the efforts of the PCB to make their stay, appearance and participation as comfortable as practically possible. “This is evident that from the fact that most of these cricketers have continued to remain part of the PCB’s marquee event since 2016 and have helped the PCB to make the HBL PSL a strong and formidable brand as it stands today.” The PCB detailed the timeline of events leading up to Faulkner’s tumultuous exit, beginning in December when Faulkner’s agent confirmed details of an offshore bank account in the UK in which the Tasmanian’s fee payments would be transferred. But the following month saw Faulkner’s agent send revised banking details for his onshore account in Australia, but 70 per cent of his fee payment would be transferred to the UK offshore account. BRISBANE, AUSTRALIA - DECEMBER 27: James Faulkner of the Hurricanes plays a shot during the Big Bash League match between the Brisbane Heat and the Hobart Hurricanes at The Gabba, on December 27, 2020, in Brisbane, Australia. (Photo by Bradley Kanaris/Getty Images) Source: Getty Images The PCB stated that all payments due to Faulkner are up to date, but he continued to insist that a second duplicate payment had to be made to his account in Australia. Faulkner “further threatened and refused to participate” in the Gladiator’s match against the Multan Sultans last Friday (AEDT). During a meeting between Faulkner and the PCB on Friday afternoon, the governing body assured that all his issues would be addressed, despite the Australian’s “reprehensible and insulting behaviour” in which he “refused to reconsider his decision to take the field in a crucial match for his side, let his team down and demanded that his travel arrangements be immediately made.” Then on Saturday morning, before he was due to leave, Faulkner “caused deliberate damage to the hotel property” and had to pay damage fees to hotel management. The PCB also received “reports and complaints from immigration authorities that Mr Faulkner had acted inappropriately and abusively at the airport.” As a result for the recent madness, the PCB and the PSL franchises unanimously agreed that he will not be drafted in future PSL events.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"“This is what I face from a so called “Respected” journalist”: Wriddhiman Saha leaks WhatsApp chat of alleged threat from a journalist post selection snub for IND vs SL Test series","link":"https://thesportsrush.com/cricket-news-this-is-what-i-face-from-a-so-called-respected-journalist-wriddhiman-saha-leaks-whatsapp-chat-of-alleged-threat-from-a-journalist-post-selection-snub-for-ind-vs-sl-test-series/","keywords":["Cricket","Sri Lanka tour of India 2022","Wriddhiman Saha"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Wriddhiman Saha leaks WhatsApp chat of a journalist persisting for an interview with him post his exclusion from India squad for SL series. Wicketkeeper-batter Wriddhiman Saha has found his name amongst the four senior players who’ve being axed from the Indian Test team squad for the imminent two-match Test series against Sri Lanka at home.… The post “This is what I face from a so called “Respected” journalist”: Wriddhiman Saha leaks WhatsApp chat of alleged threat from a journalist post selection snub for IND vs SL Test series appeared first on The SportsRush.","content":"Wriddhiman Saha leaks WhatsApp chat of a journalist persisting for an interview with him post his exclusion from India squad for SL series. Wicketkeeper-batter Wriddhiman Saha has found his name amongst the four senior players who’ve being axed from the Indian Test team squad for the imminent two-match Test series against Sri Lanka at home. The 37-year-old, however, post his selection snub has visibly expressed his disappointment on the likes of head coach Rahul Dravid and BCCI President Sourav Ganguly. Saha has even went on to exclaim that Dravid in fact, suggested him to consider retiring from International Cricket after he was explicably told by the BCCI in advance regarding him being not considered for selection. The Bengal wicketkeeper also remarked that he ‘failed to understand why everything changed so fast’ after he was assured by Sourav Ganguly of a place in the Indian squad post his half-century knock against New Zealand during the first Test in November 2021. Ganguly, as per Saha, explicably told him not to worry until he is at the helm of the BCCI. Chetan Sharma, the chairman of selectors, on the other hand, did not disclose the grounds on which Saha was omitted from the squad. “I can’t tell you on what grounds he has been dropped. That’s for selectors. All I can tell you is that he was told before and asked to play the Ranji trophy, which is the ladder for the Indian team. What we discussed between ourselves we can’t tell you,” remarked Sharma. “Why he did not play Ranji, the state association CAB can tell you that. That is not my jurisdiction. As selectors, we wanted them to play. We are not looking at age. When there are youngsters sitting outside, we thought we shall give chance. For these two test matches. But it’s important to play Ranji. Else, how will we know if you are match-ready?”, Sharma further added. Wriddhiman Saha leaks WhatsApp chat of a journalist If this wasn’t it, Saha, post a few hours after the Indian squad announcement on Saturday, went ahead to post a screenshot of a one-way WhatsApp chat, allegedly from a ‘respected’ journalist on his Twitter handle. As per the texts, the person initially told Saha to do an interview with him, and that he has no other democratic option to choose anyone else but him for the same. The journalist even went on to assure Saha that he is the only person who could ‘help’ him. A few minutes later, when Saha allegedly did not call him for the interview, the unnamed journalist went on to threaten the Bengal keeper stating that ‘this wasn’t something which he should have done’. After all of my contributions to Indian cricket..this is what I face from a so called “Respected” journalist! This is where the journalism has gone. pic.twitter.com/woVyq1sOZX — Wriddhiman Saha (@Wriddhipops) February 19, 2022 For more Cricket-related news, click here. The post “This is what I face from a so called “Respected” journalist”: Wriddhiman Saha leaks WhatsApp chat of alleged threat from a journalist post selection snub for IND vs SL Test series appeared first on The SportsRush.","pubDate":"2022-02-19 20:16:29","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CS vs WF Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for NZ ODD, Match 25","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/cs-vs-wf-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-nz-odd-match-25?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-19 19:16:07","full_description":"Central District (CS) will take on Wellington (WF) in the 25th match of the New Zealand Domestic One Day Trophy 2021-22 at the Pukekura Park in New Plymouth on Sunday. The Central Districts defeated Wellington by 43 runs in their last match under the DLS Method. They appear much stronger and more balanced with the arrival of Ross Taylor. The performances of both teams so far have been excellent, and once again, their battle will determine the best of the tournament. Bayley Wiggins (w), Ben Smith, Brad Schmulian, Ross Taylor, Tom Bruce (c), Josh Clarkson, Doug Bracewell, Adam Milne, Seth Rance, Joey Field, Jayden Lennox Finn Allen, Luke Georgeson, Jakob Bhula, Troy Johnson, Michael Bracewell, Lauchie Johns (w), Nathan Smith, Logan van Beek, Ollie Newton, Ben Sears, Hamish Bennett (c) Match: Central Districts vs Wellington, NZ Domestic One Day Trophy 2021-22, Match 25 Date and Time: 20 February 2022; 03:30 AM IST Venue: Pukekura Park, New Plymouth The pitch at the Pukekura Park Stadium has assisted the batters. However, the pacers have been able to find movement with the new ball. Putting runs on the board first should be the preferred strategy for teams winning the toss. Finn Allen : Allen is an explosive batter at the top of the order. He has scored 234 runs at an average of 39.00 in his last six games. He is expected to play a big knock in this game. Ross Taylor: Taylor displayed very good form in the last match and scored 111 runs at a strike rate of 217.65. He should be a good addition to your CS vs WF Dream11 fantasy team. Michael Bracewell : Bracewell is a great all-rounder who could provide some valuable points with both bat and ball. He has scored 193 runs and also picked up eight wickets in just six games in the tournament so far. Seth Rance: Rance has picked up ten wickets in his last four NZ ODD games at an average of 8.90. He could be a valuable pick in your CS vs WF Dream11 fantasy team. Adam Milne (CS) - 204 points Ollie Newton (WF) - 246 points Troy Johnson (WF) - 342 points Logan van Beek - 63 runs and nine wickets in his last six games; bowling average: 25.89 Nathan Smith – 198 runs and five wickets in his last six games; batting average: 33.00 Troy Johnson - 263 runs in his last six games; batting average: 43.82 Fantasy Suggestion #1 : Finn Allen, Ross Taylor, Ben Smith, Troy Johnson, Doug Bracewell, Michael Bracewell, Logan van Beek, Adam Milne, Seth Rance, Ollie Newton, Nathan Smith Captain : Michael Bracewell Vice-captain : Ross Taylor Fantasy Suggestion #2 : Finn Allen, Bayley Wiggins, Ross Taylor, Tom Bruce, Troy Johnson, Doug Bracewell, Michael Bracewell, Logan van Beek, Adam Milne, Seth Rance, Nathan Smith Captain : Michael Bracewell Vice-captain : Logan van Beek","image_url":"https://static.sportskeeda.com/editor/2022/02/13a81-16452909502614-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“Rahul Dravid suggested that I think about taking retirement”: Wriddhiman Saha reveals Rahul Dravid’s suggestion post selection snub for India vs Sri Lanka Test series","link":"https://thesportsrush.com/cricket-news-rahul-dravid-suggested-that-i-think-about-taking-retirement-wriddhiman-saha-reveals-rahul-dravids-suggestion-post-selection-snub-for-india-vs-sri-lanka-test-series/","keywords":["Cricket","india vs sri lanka","Rahul Dravid","sri lanka tour of india","Wriddhiman Saha"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Wriddhiman Saha reveals Rahul Dravid’s suggestion after he was dropped from team India squad for the imminent Test series versus Sri Lanka. The Indian selection committee under the chairmanship of Chetan Sharma decided to drop as many as four Indian experienced, senior players- the likes of Cheteshwar Pujara, Ajinkya Rahane, pacer Ishant Sharma, and wicketkeeper-batter… The post “Rahul Dravid suggested that I think about taking retirement”: Wriddhiman Saha reveals Rahul Dravid’s suggestion post selection snub for India vs Sri Lanka Test series appeared first on The SportsRush.","content":"Wriddhiman Saha reveals Rahul Dravid’s suggestion after he was dropped from team India squad for the imminent Test series versus Sri Lanka. The Indian selection committee under the chairmanship of Chetan Sharma decided to drop as many as four Indian experienced, senior players- the likes of Cheteshwar Pujara, Ajinkya Rahane, pacer Ishant Sharma, and wicketkeeper-batter Wriddhiman Saha. Chetan Sharma has however, not given a clear-cut reason for Saha’s exclusion from the squad, but did take an indirect jibe at the Bengal wicketkeeper for his decision to opt out of the ongoing Ranji Trophy 2021/22 season. “I can’t tell you on what grounds he has been dropped. That’s for selectors. All I can tell you is that he was told before and asked to play the Ranji trophy, which is the ladder for the Indian team. What we discussed between ourselves we can’t tell you,” remarked Sharma. “Why he did not play Ranji, the state association CAB can tell you that. That is not my jurisdiction. As selectors, we wanted them to play. We are not looking at age. When there are youngsters sitting outside, we thought we shall give chance. For these two test matches. But it’s important to play Ranji. Else, how will we know if you are match-ready?”, Sharma further added. However, a few hours post the selection snub, the 37-year-old has come up with shocking revelations which include team coach Rahul Dravid suggesting him to consider his retirement from international Cricket. Wriddhiman Saha reveals Rahul Dravid’s suggestion During an interaction with the Times of India, Saha, expressed disappointment on his exclusion from the squad, and remarked that he was intimated beforehand by the selectors (regarding him being dropped) and was also advised by the present coach Rahul Dravid to consider retiring from International Cricket. “Yes, the team management told me that I would not be considered henceforth. I could not tell this so long as I was part of the India team setup. Even coach Rahul Dravid suggested that I think about taking retirement,” Saha revealed. Wriddhiman Saha expresses disappointment in Sourav Ganguly Saha further added that he received a congratulatory text from BCCI President Sourav Ganguly after his gritty 2nd innings knock of 61 off 126 deliveries versus New Zealand during the Kanpur Test in November 2021. While Ganguly even assured him not to worry about his place in the side, Saha now fails to understand how ‘everything changed so fast’. “When I hit an unbeaten 61 taking a pain-killer in the first Test against New Zealand in Kanpur last November, Dadi (as Sourav was referred to by Bengal players) congratulated me over Whatsapp. He even mentioned that I should not worry about anything so long as he is at the helm of the BCCI. Such a message from the board president really boosted my confidence.But I failed to understand why everything changed so fast,” remarked Saha. While Rishabh Pant has been an automatic pick as the first choice wicketkeeper in the side, KS Bharat, who has been travelling with the Indian Test squads for a few series now, has been roped in as the second keeper choice, and perhaps closing further doors for Wriddhiman Saha with it. Test squad – Rohit Sharma (C), Priyank Panchal, Mayank Agarwal, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Shubhman Gill, Rishabh Pant (wk), KS Bharath, R Jadeja, Jayant Yadav, R Ashwin, Kuldeep Yadav, Sourabh Kumar, Mohd. Siraj, Umesh Yadav, Mohd. Shami, Jasprit Bumrah (VC). — BCCI (@BCCI) February 19, 2022 For more Cricket-related news, click here. The post “Rahul Dravid suggested that I think about taking retirement”: Wriddhiman Saha reveals Rahul Dravid’s suggestion post selection snub for India vs Sri Lanka Test series appeared first on The SportsRush.","pubDate":"2022-02-19 18:55:26","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ganguly said as long as I am here, you would be in team: Wriddhiman Saha - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvYmVpbmctaW4tYnViYmxlLWZvci1tb250aHMtaS1kZWNpZGVkLXRvLXNwZW5kLXRpbWUtd2l0aC1mYW1pbHktd3JpZGRoaW1hbi1zYWhhLW9uLXNraXBwaW5nLXJhbmppLXRyb3BoeS03NzgxNjkzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ganguly said as long as I am here, you would be in team: Wriddhiman Saha  The Indian ExpressDravid told me won't be picked henceforth, suggested retirement, says furious Wriddhiman Saha  Times of India'Rahul Dravid Suggested Retirement': Furious Wriddhiman Saha Slams Team Management After Being Dropped From Indian Test Team | Cricket News  NDTVSports.comSaha: In South Africa, I was told that I will not be considered going forward  SportstarImportant to play Ranji, how else will we know you are match-ready’: Selection committee chairman on Saha’s absence  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-02-19 18:48:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Dravid told me won't be picked henceforth, suggested retirement, says furious Wriddhiman Saha - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMitAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9zcmktbGFua2EtaW4taW5kaWEvZHJhdmlkLXRvbGQtbWUtd29udC1iZS1waWNrZWQtaGVuY2Vmb3J0aC1zdWdnZXN0ZWQtcmV0aXJlbWVudC1zYXlzLWZ1cmlvdXMtd3JpZGRoaW1hbi9hcnRpY2xlc2hvdy84OTY5MjIwMy5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Dravid told me won't be picked henceforth, suggested retirement, says furious Wriddhiman Saha  Times of India'Rahul Dravid Suggested Retirement': Furious Wriddhiman Saha Slams Team Management After Being Dropped From Indian Test Team | Cricket News  NDTVSports.comSourav Ganguly Promised Me A Spot Till He's At BCCI, Rahul Dravid Suggested Me Of Retirement And The Selectors Dropped Me: Wriddhiman Saha Exposes BCCI's Dual Standards  Cricket AddictorGanguly said as long as I am here, you would be in team: Wriddhiman Saha  The Indian ExpressSaha: In South Africa, I was told that I will not be considered going forward  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-02-19 17:58:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Woman makes shock claim in court case over alleged explicit texts from cricketer","link":"https://www.rt.com/sport/549964-tim-paine-texts-court-case-australia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS","keywords":null,"creator":["RT"],"video_url":null,"description":"Former Australia test cricket captain Tim Paine has been accused by Renee Ferguson in a federal court case involving Cricket Tasmania Read Full Article at RT.com","content":"The former Australia cricket captain is accused of sending sexual texts and photos to a woman reportedly seeking $72,000 in compensation Graphic sexual texts allegedly sent by ex-Australia cricket captain Tim Paine to a former Cricket Tasmania (CT) employee were not consensual, accuser Renee Ferguson has claimed in reported legal documents as part of a federal court case. Ashes winner Paine said that the texts, which allegedly told Ferguson to \"finish me off\" and included photos of his genitalia, were consensual when he resigned as Australia captain in November 2021 over the scandal, according to Yahoo. Ferguson, who is said to be seeking $72,000 in compensation, has now reportedly said that the texts were not consensual and claimed that two other managers at CT, as well as Paine's brother-in-law, Shannon Tubb, subjected her to sexualized and inappropriate comments when she worked at the organization in 2017 where she says their behavior was accepted and part of the workplace culture. Paine, who announced on November 26 that he would be taking a break from cricket \"for the foreseeable future\" after stepping down from the Australia test team captaincy a week before, allegedly texted Ferguson in the hours leading up to an Ashes match against England in Brisbane. After Paine sent her a message that stated he couldn't rest his hands \"when I'm this hard\", Ferguson claims to have tried to steer the topic of conversation away from being sexual.  In other correspondence, the 37-year-old allegedly ordered her to \"finish me off with those lips then Renee\", along with a winking emoji. The lengthy 18-page court document is said to show how Ferguson said she was unsure how to respond to the unsolicited texts and vowed that a woman would \"never kiss and tell\".  \"Regardless neither of us are in a position of power... we are both f*cked if this got out,\" Ferguson highlighted, which then allegedly prompted Paine to offend Ferguson by sending her a photo of his penis and the caption: \"True, so f***ed\". Ferguson claims that three managers subjected her to sexualized and inappropriate comments during her time at CT, with one – Stephen McMullen – failing in a bid to keep his identity private on Wednesday and denying allegations of asking intrusive questions and making graphic comments towards Ferguson. Now coaching at a prestigious school in South Australia, Paine's brother-in-law, Shannon Tubbm was also involved, according to the documents. He is said to have texted her \"I want to put my c**k between your tits\" while working as CT's high-performance manager.   In 2015, another senior member of staff allegedly made lewd comments while walking past Ferguson's desk and boasted to colleagues: \"Hey everyone, [the woman] will be naked in my apartment at 11 today. Get your binoculars out and I will open the curtains.\" Read more Man arrested after threatening to rape India cricket icon Kohli’s nine-month-old daughter When Ferguson raised her concerns to managers she was allegedly informed: \"I’m not saying it didn’t happen, but you need to move forward\". Ferguson claims that her mental health suffered due to the \"relentless and systemic\" behavior at CT, which led to her struggling to take care of her children and suicidal thoughts, while also leaving her feeling deflated.  A federal court judge ordered Ferguson and CT to go into mediation next month, with the ex-receptionist said to be demanding an apology plus $100,000 AUD ($72,000) in compensation for the hurt and humiliation she suffered in their employ. When Paine stepped down from the captaincy, CT condemned Cricket Australia for its \"appalling\" treatment of the wicketkeeper. CT's chairman, Andrew Gaggin, stated that Paine \"should not have been put in a position where he felt the need to resign over an incident that was determined by an independent inquiry to not be a breach of the code of conduct\". Contrary to what Ferguson has reportedly put forward, Gaggin added that the messages were \"a consensual and private exchange that occurred between two mature adults and was not repeated\".  Read more The woke takeover of sport continues across the world Cricket Australia did admit that it had mishandled the debacle in 2018, but its chair, Richard Freudenstein, who was not in his post at the time, said the organization \"would not make the same decisions today\" under the current administration in late 2021.  After Pat Cummins replaced Paine as Australia captain, the team beat England 4-0 in a five-test Ashes series on home soil concluded in the Tasmanian capital of Hobart on January 18.","pubDate":"2022-02-19 17:34:33","full_description":"Graphic sexual texts allegedly sent by ex-Australia cricket captain Tim Paine to a former Cricket Tasmania (CT) employee were not consensual, accuser Renee Ferguson has claimed in reported legal documents as part of a federal court case. Ashes winner Paine said that the texts, which allegedly told Ferguson to \"finish me off\" and included photos of his genitalia, were consensual when he resigned as Australia captain in November 2021 over the scandal, according to Yahoo . Ferguson, who is said to be seeking $72,000 in compensation, has now reportedly said that the texts were not consensual and claimed that two other managers at CT, as well as Paine's brother-in-law, Shannon Tubb, subjected her to sexualized and inappropriate comments when she worked at the organization in 2017 where she says their behavior was accepted and part of the workplace culture. A post shared by Tim Paine (@tim_paine09) Paine, who announced on November 26 that he would be taking a break from cricket \"for the foreseeable future\" after stepping down from the Australia test team captaincy a week before, allegedly texted Ferguson in the hours leading up to an Ashes match against England in Brisbane. After Paine sent her a message that stated he couldn't rest his hands \"when I'm this hard\" , Ferguson claims to have tried to steer the topic of conversation away from being sexual. In other correspondence, the 37-year-old allegedly ordered her to \"finish me off with those lips then Renee\" , along with a winking emoji. The lengthy 18-page court document is said to show how Ferguson said she was unsure how to respond to the unsolicited texts and vowed that a woman would \"never kiss and tell\" . \"Regardless neither of us are in a position of power... we are both f*cked if this got out,\" Ferguson highlighted, which then allegedly prompted Paine to offend Ferguson by sending her a photo of his penis and the caption: \"True, so f***ed\" . A post shared by Tim Paine (@tim_paine09) Ferguson claims that three managers subjected her to sexualized and inappropriate comments during her time at CT, with one – Stephen McMullen – failing in a bid to keep his identity private on Wednesday and denying allegations of asking intrusive questions and making graphic comments towards Ferguson. Now coaching at a prestigious school in South Australia, Paine's brother-in-law, Shannon Tubbm was also involved, according to the documents. He is said to have texted her \"I want to put my c**k between your tits\" while working as CT's high-performance manager. In 2015, another senior member of staff allegedly made lewd comments while walking past Ferguson's desk and boasted to colleagues: \"Hey everyone, [the woman] will be naked in my apartment at 11 today. Get your binoculars out and I will open the curtains.\" When Ferguson raised her concerns to managers she was allegedly informed: \"I’m not saying it didn’t happen, but you need to move forward\" . Ferguson claims that her mental health suffered due to the \"relentless and systemic \" behavior at CT, which led to her struggling to take care of her children and suicidal thoughts, while also leaving her feeling deflated. A federal court judge ordered Ferguson and CT to go into mediation next month, with the ex-receptionist said to be demanding an apology plus $100,000 AUD ($72,000) in compensation for the hurt and humiliation she suffered in their employ. When Paine stepped down from the captaincy, CT condemned Cricket Australia for its \"appalling\" treatment of the wicketkeeper. CT's chairman, Andrew Gaggin, stated that Paine \"should not have been put in a position where he felt the need to resign over an incident that was determined by an independent inquiry to not be a breach of the code of conduct \". Contrary to what Ferguson has reportedly put forward, Gaggin added that the messages were \"a consensual and private exchange that occurred between two mature adults and was not repeated\" . Cricket Australia did admit that it had mishandled the debacle in 2018, but its chair, Richard Freudenstein, who was not in his post at the time, said the organization \"would not make the same decisions today\" under the current administration in late 2021. After Pat Cummins replaced Paine as Australia captain, the team beat England 4-0 in a five-test Ashes series on home soil concluded in the Tasmanian capital of Hobart on January 18.","image_url":"https://cdni.rt.com/files/2022.02/thumbnail/6210dc32203027337258d568.jpg","source_id":"rt","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"LIVE Lahore Qalandars vs Islamabad United T20 Score: Harry Brooks Scores 1st PSL Hundred, Lahore On Top - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi0gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL3BzbC1saXZlLWxhaG9yZS1xYWxhbmRhcnMtdnMtaXNsYW1hYmFkLXVuaXRlZC10MjAtY3JpY2tldC1zY29yZS1sYWgtdnMtaXNsLWJhbGwtYnktYmFsbC1jb21tZW50YXJ5LThwbS1pc3Qtc29ueWxpdi1pY2MtdHYtc2hhaGVlbi1hZnJpZGktYXphbS1mYWtoYXItcmFzaGlkLWhhcnJ5LWJyb29rcy0xMDAtNTI0ODQ5My_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE Lahore Qalandars vs Islamabad United T20 Score: Harry Brooks Scores 1st PSL Hundred, Lahore On Top  India.comLAH vs ISL Dream11 Prediction, Fantasy Cricket Tips, Playing XI Updates, Pitch Report & Injury Updates For Match 27  CricTrackerLahore Qalandars vs Islamabad United Live Streaming: When and Where to Watch Pakistan Super League 2022 Mat  News18Rossouw, Rizwan shine in Sultans record win  The News InternationalLAH vs ISL Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- PSL 2022  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-02-19 16:28:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"James Faulkner IPL 2022: Will James Faulkner play in IPL 2022?","link":"https://thesportsrush.com/cricket-news-james-faulkner-ipl-2022-will-james-faulkner-play-in-ipl-2022/","keywords":["Cricket","IPL 2022","Indian Premier League","IPL","James Faulkner","PSL","PSL 7"],"creator":["Gurpreet Singh"],"video_url":null,"description":"James Faulkner IPL 2022: The Australian all-rounder left the ongoing PSL 7 midway over contractual payment issue with the PCB. Australian and Quetta Gladiators all-rounder in the ongoing seventh edition of the Pakistan Super League (PSL) James Faulkner, decided to step down from the remainder of the tournament over a contractual payment dispute with the… The post James Faulkner IPL 2022: Will James Faulkner play in IPL 2022? appeared first on The SportsRush.","content":"James Faulkner IPL 2022: The Australian all-rounder left the ongoing PSL 7 midway over contractual payment issue with the PCB. Australian and Quetta Gladiators all-rounder in the ongoing seventh edition of the Pakistan Super League (PSL) James Faulkner, decided to step down from the remainder of the tournament over a contractual payment dispute with the Pakistan Cricket Board (PCB) on Saturday. Taking to his Twitter handle a few hours ago, the 31-year-old issued an apology to the Pakistan Cricket fans for his withdrawal from the tournament, while also accusing the PCB for not honouring his contractual payment and lying to him throughout his stay in the tournament. 1/2 I apologise to the Pakistan cricket fans. But unfortunately I’ve had to withdraw from the last 2 matches and leave the @thePSLt20 due to the @TheRealPCB not honouring my contractual agreement/payments. I’ve been here the whole duration and they have continued to lie to me. — James Faulkner (@JamesFaulkner44) February 19, 2022 2/2 It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace from the @TheRealPCB and @thePSLt20 I’m sure you all understand my position. — James Faulkner (@JamesFaulkner44) February 19, 2022 A couple of hours later, the PCB along with the Quetta Gladiators came up a combined, detailed account of their side of the story, refuting the ‘baseless allegations’ of the left-arm pacer. As per the PCB, 70% of the payment amount as per the contract have already been transferred to Faulkner’s offshore UK bank account, and has been acknowledged by him for the same as well. However, as per PCB, Faulkner also insisted the board to make a similar duplicate payment in his Australian account as well, which would have meant that the all-rounder would have been paid twice. We are yet to hear James Faulkner’s counter on PCB’s statement as yet. 2/2 pic.twitter.com/8FIUlc5HtS — Pakistan Cricket (@TheRealPCB) February 19, 2022 James Faulkner IPL 2022 As far as Faulkner’s participation in the imminent 15th season of the IPL is concerned, the Aussie bowling all-rounder failed to grab the attention of any of the 10 franchises despite being amongst the 600 players up for possible grabs in the recently concluded mega auction. The development meant that he would not feature in IPL 2022. Faulkner was placed in Set no.45 of the final players list at a base price of INR 1 Crore, and was unfortunately amongst the many players who were not selected by the franchises to be part of the ‘accelerated bidding‘ process during the final stage of the auction. In the ongoing PSL 7, Faulkner played a total of 6 matches for the Sarfaraz Ahmed-led Quetta Gladiators, and picked 6 wickets at an average of 32.66. He made himself unavailable for the franchise’s previous two matches against Peshawar Zalmi and Multan Sultans due to his aforementioned tussle with the PCB. The post James Faulkner IPL 2022: Will James Faulkner play in IPL 2022? appeared first on The SportsRush.","pubDate":"2022-02-19 16:02:11","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Separated Shikhar Dhawan's emotional meet with son after 2 years - WATCH","link":"https://zeenews.india.com/cricket/separated-shikhar-dhawans-emotional-meet-with-son-after-2-years-watch-2437944.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team opener Shikhar Dhawan, who has parted ways with wife Ayesha, met his son for the first time in two years.","content":null,"pubDate":"2022-02-19 15:32:00","full_description":"Indian cricket team opener Shikhar Dhawan, who has parted ways with wife Ayesha, met his son for the first time in two years. Shikhar was an emotional father when he met his son Zoravar on Saturday after a long wait. He shared a video in which he can be seen hugging his son Zoravar. Dhawan flew to Australia to meet his son. While we do not know why Dhawan could not meet his son for such a long time, Australia's strict border rules could be one reason. His former wife and son live in Australia and it would have been difficult for Shikhar to fly to Australia under Covid norms. Watch how father and son met after two-year wait: A post shared by Shikhar Dhawan (@shikhardofficial) The Indian cricketer and his wife Ayesha Mukherjee had parted ways after eight years of marriage in September last year. Dhawan married the Melbourne-based boxer, Ayesha Mukherjee, in 2012 and adopted her two daughters from her previous marriage. They were blessed with a son whom they named Zoravar.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"James Faulkner leaves PSL after accusing PCB of not honouring his contract","link":"https://www.business-standard.com/article/sports/james-faulkner-leaves-psl-after-accusing-pcb-of-not-honouring-his-contract-122021900826_1.html","keywords":null,"creator":null,"video_url":null,"description":"Australian allrounder James Faulkner on Saturday left the Pakistan Super League abruptly after accusing the country's cricket board (PCB) of \"not honouring\" his contractual agreement.","content":null,"pubDate":"2022-02-19 14:49:00","full_description":"Australian allrounder James Faulkner on Saturday left the Pakistan Super League abruptly after accusing the country's cricket board (PCB) of \"not honouring\" his contractual agreement. Faulkner, who played for the Quetta Gladiators, left the team hotel and bio bubble after posting a series of tweets in which he accused the PCB and PSL management of telling him lies and treating his disgracefully. The PCB and Quetta Gladiators, however, said that Faulkner has been paid his money for appearing in the league as per his contractual obligations and added that the Australian will not be picked in the T20 tournament in future. Faulkner apologised to the Pakistani cricket fans for his withdrawal from the team's last two matches against Multan Sultans on Friday and tomorrow's fixture against Karachi Kings. \"I apologise to the Pakistan cricket fans. But, unfortunately, I've had to withdraw from the last 2 matches and leave the PSL due to the PCB not honouring my contractual agreement/payments,\" he said in a tweet. Faulkner blamed the cricket board for continuing to \"lie\" to him despite his full-time presence in the tournament. The Australian all-rounder said it \"hurts\" to leave as he wanted to \"help\" get international cricket back in Pakistan. \"It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing,\" Faulkner said. He claimed that despite his attempts to do so, the treatment he received from the PCB and the management of the PSL had been a \"disgrace\". \"I'm sure you all understand my position,\" he added. PCB and Quetta Gladiators, however, accused Faulkner of reprehensible and insulting behaviour and causing deliberate damage to the hotel property and behaving inappropriately and abusively with immigration authorities at the airport. \"In December 2021, James Faulkner's agent confirmed the United Kingdom bank details to which his fee payments should be transferred. This was noted for action,\" they said in a statement. \"In January 2022, for reasons best known to James Faulkner, his agent sent revised banking details of James Faulkner's onshore account in Australia. However, the contracted 70 per cent of James Faulkner's fee payment was transferred to his offshore UK bank account. The receipt of this payment was acknowledged by James Faulkner. \"Accordingly, payments due to Mr Faulkner as per his contract are fully up to date. The remaining 30 per cent of his contractual payment only becomes due 40 days after the completion of the HBL Pakistan Super League 2022, which now remains a matter to be reviewed in line with his contract.\" The Board and the franchise claimed that in spite of the money being transferred and received in his account, Faulkner continued to insist that a second duplicate payment of the same amount be made to his account in Australia. \"He further threatened and refused to participate in his side's match against Multan Sultans on Friday afternoon until his money demands were met,\" the statement said. \"The PCB, as a responsible organisation, engaged with him early Friday afternoon in an attempt to reason with him. Despite his reprehensible and insulting behavior during the conversation, Faulkner was assured that all his grievances would be addressed. \"He refused to reconsider his decision to take the field in a crucial match for his side, let his team down and demanded that his travel arrangements be immediately made.\" The PCB and Quetta Gladiators said they are \"disappointed and dismayed with the reprehensible behavior of James Faulkner, who was also part of the Abu Dhabi-leg of the Pakistan Super League in 2021, and, along with all participants, has always been treated with utmost respect.\" The statement noted that in the seven years of the Pakistan Super League, no player has ever complained about the nonfulfillment of the PCBs contractual obligations. It also said the PCB was also in constant contact with his agent, who was regretful and apologetic. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220219/thumb-122021900826.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy 2021-22: Overcoming hurdles, Sakibul Gani brings glory to Bihar with world record","link":"https://www.indiatvnews.com/sports/cricket/ranji-trophy-2021-22-overcoming-hurdles-sakibul-gani-brings-glory-to-bihar-with-world-record-2022-02-19-760508","keywords":null,"creator":null,"video_url":null,"description":"It is seldom that a youngster from Bihar makes a splash in the world of cricket, overcoming the hurdles thrown by a system that reeks of apathy for such sporting activities.","content":null,"pubDate":"2022-02-19 14:21:40","full_description":"It is seldom that a youngster from Bihar makes a splash in the world of cricket, overcoming the hurdles thrown by a system that reeks of apathy for such sporting activities. To make a debut so spectacular that the name enters record books is nothing short of extraordinary. Sakibul Gani, playing for Bihar, smashed an astounding 341 in the Ranji Trophy Plate Group match against Mizoram on Friday to break the world record for the highest individual score on a first-class debut. \"He became the 1st batter to score a triple ton on First-Class debut,\" says the Twitter handle of BCCI domestic. It is quite likely that wannabe cricketers across the state would now draw inspiration from his feat. The 22-year-old, who hit 56 fours and two sixes to get to 341 off 405 balls, hails from the state's East Champaran district, where his triple ton the previous day is being raved about at almost every street corner. \"Sakibul is the youngest of four siblings and he showed a passion for the game since his days at the Zilla school\", reminisces his father Adnan Gani at their house in Agarwal, a modest locality on the outskirts of Motihari, the district headquarters. Their home is, not surprisingly, teeming with visitors who are received by the proud father and Azma Khatun, the mother of the 22-year-old. \"May my son attain the heights of glory. May he play for India one day,\" mumbles the demure homemaker who proudly states that the boy \"always worked hard and did not neglect his studies in the pursuit of sports\". Her face gets flush with motherly affection as Khatun goes on and on about \"Mera laal\", now a lanky youngster who sports a small beard on his handsome face. Adulation, and even stardom, awaits the young man whose achievement must have caught the attention of the high and the mighty in the state. \"Congratulations to Bihar's Sakibul Gani, who created a world record by becoming the first batsman in the world to score a triple century on first-class debut,\" tweeted Tejashwi Yadav, a former deputy CM and the current leader of the opposition. Yadav, incidentally, was an aspiring cricketer who retains a passion for the sport. Congratulatory tweets have also come from Pramod Kumar, state minister and Motihari MLA, besides Alok Ranjan, who holds art, culture and youth portfolio, which is also responsible for sports in a state. However, Gani's elder brother Faisal, who was the first one to notice the spark in the younger siblings, evokes pathos as he articulates the very low expectations he has from the system. \"I just want the administration to help us with a proper cricket ground. My brother, like numerous other boys with similar prowess, had to make do with a patch of land in the Gandhi Maidan here\", he said. The state has, in the recent past, been in a celebratory mood over sensation and national team rising star Ishan Kishan, both of whom have roots in Bihar. Neither of them had, however, represented the state team. With Gani making his mark as a Bihar team batsman, residents of the province have a reason to hope that the state machinery will shed its indifference towards sports and lend its weight to nurturing its rich pool of talent.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"PSL 2022, Lahore Qalandars vs Islamabad United Live Cricket Updates","link":"https://sports.ndtv.com/cricket/psl-2022-lahore-qalandars-vs-islamabad-united-live-cricket-updates-2777826","keywords":null,"creator":null,"video_url":null,"description":"PSL 2022 Live Cricket Updates: Second-placed Lahore Qalandars take on fourth-placed Islamabad United in the ongoing Pakistan Super League (PSL) on Saturday at the Gaddafi Stadium in Lahore.","content":null,"pubDate":"2022-02-19 14:17:01","full_description":"PSL 2022 Live Cricket Updates: Second-placed Lahore Qalandars take on fourth-placed Islamabad United in the ongoing Pakistan Super League (PSL) on Saturday at the Gaddafi Stadium in Lahore. With only a handful of games left in the ongoing PSL 7, both Lahore and Islamabad will aim to book seal their spots in the play-offs of the tournament. Islamabad trail Lahore by just two points but could overtake them with a win later today. Multan Sultans are comfortably sitting at the top of the points table, while Karachi Kings are firmly rooted at the bottom with just one win from 9 games so far. (LIVE SCORECARD) Kamran Ghulam walks in at number 3. OUT! BOWLED! What a start by Faheem Ashraf! The experiment to open with Salt doesn't work and he walks back cheaply. Who will bowl from the opposite end? Faheem Ashraf it is. Another shorter length delivery on middle. Salt goes back and punches it to long on for a single. A tidy start this by Mubashir Khan. Quicker and flatter on off. Zaman just dabs it towards the off side for a single. Slightly shorter on middle this time. Salt just works it to mid-wicket for a single. He is off the mark as well. Zaman skips down the track and works this delivery on middle towards square leg for a single. Nicely tossed up on off. Zaman goes forward and blocks it. A flatter delivery on off to start. Zaman works it to mid-wicket for a couple. Lahore and Fakhar Zaman are underway! We are set for the game to begin! The players have made their way out to the middle. There is one forced change for Islamabad United - Hasan Ali who was about to play this game has been ruled out after the toss, as he got injured. It is Marchant de Lange who comes in as a replacement. Philip Salt and Fakhar Zaman to open the batting for Lahore Qalandars. Mubashir Khan will start proceedings with the ball. Here we go... Islamabad United (Playing XI) - Rahmanullah Gurbaz, Mubashir Khan, Danish Aziz, Liam Dawson, Asif Ali (C), Azam Khan (WK), Faheem Ashraf, Marchant de Lange, Mohammad Wasim (In place of Muhammad Musa), Waqas Maqsood, Zahir Khan. Lahore Qalandars (Playing XI) - Sohail Akhtar (In place of Abdullah Shafique), Fakhar Zaman, Kamran Ghulam, Mohammad Hafeez, Harry Brook, Philip Salt (WK), David Wiese, Rashid Khan, Shaheen Afridi (C), Haris Rauf, Zaman Khan. TOSS - The coin goes up and lands in favour of Lahore Qalandars. They have elected to BAT first. Lahore Qalandars have fared reasonably well this season but they suffered a defeat against Karachi Kings in their previous clash and they will be itching to get back to winning ways. Their batters weren't upto the mark in the last game and they must put their best foot forward coming into this fixture. Let's hope that this turns out be an intriguing contest. Stay tuned for toss and team news. Islamabad United have been winning their alternate games so far this season and if we go by that, they are to register their fifth win of the tournament against Lahore. They are coming at the back of a loss in their previous game where they certainly missed the services of Shadab Khan. Islamabad will now be looking to make amends and come out on top against Lahore Qalandars. Hello and a very warm welcome to game number 27 of Pakistan Super League where Islamabad United will take on Lahore Qalandars. The race for playoffs is heating up and we are in for another cracker of a game. ... MATCH DAY ...","image_url":"https://c.ndtvimg.com/2022-02/gmm8r41_lahore-qalandars-twitter_120x90_19_February_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB bans Faulkner from future PSL events, slams player over non-payment allegations","link":"https://sportstar.thehindu.com/cricket/pcb-slams-faulkner-over-payment-allegations-bans-player-from-future-psl-events/article38430495.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Australian all-rounder James Faulkner abruptly left the Pakistan Super League (PSL) on Saturday citing payment disputes, though the Pakistan Cricket Board (PCB) has denied the allegation.","content":null,"pubDate":"2022-02-19 13:47:00","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB is poor bro: Indian twitter users roast PSL, PCB over non-payment to James Faulkner","link":"https://zeenews.india.com/cricket/pcb-is-poor-bro-indian-twitter-users-roast-psl-pcb-over-non-payment-to-james-faulkner-2437923.html","keywords":null,"creator":null,"video_url":null,"description":"Australian all-rounder James Faulkner abruptly left the Pakistan Super League (PSL) on Saturday citing payment disputes, though the Pakistan Cricket Board (PCB) has denied the allegation.","content":null,"pubDate":"2022-02-19 13:27:00","full_description":"Australian all-rounder James Faulkner abruptly left the Pakistan Super League (PSL) on Saturday citing payment disputes, though the Pakistan Cricket Board (PCB) has denied the allegation. Faulkner did not play the last three games of his Quetta Gladiators franchise and announced his shock withdrawal on Twitter. \"...unfortunately I’ve had to withdraw from the last 2 matches and leave the @thePSLt20 due to the @TheRealPCB not honouring my contractual agreement/payments,\" Faulkner said in the first of his two posts. \"I`ve been here the whole duration and they have continued to lie to me.\" \"It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace...\" he added. The PCB did not reply immediately to a Reuters email seeking details but denied Faulkner`s allegation in a Twitter post. \"The PCB and Quetta Gladiators have regretfully taken note of Mr James Faulkner`s false and misleading accusations and will shortly be releasing a detailed statement on the matter,\" it said. Twitter users, especially from India, have shown support for Faulkner on Twitter and have roasted the PCB and PSL for not giving proper pay to the cricketers taking part in the league. Here are some chosen reactions: This is not a way to treat player from any country & In any tournament. @TheRealPCB have some shame, Immediately make all the settlement which are suppose to be. @thePSLt20 don't treat players like this. @JamesFaulkner44 I Fell The Pain... — Pragath__ (@Devadiga_Prashi) February 19, 2022 PCB is poor bro,hv some mercy,i believe they will pay your desired amount by taking some kind of loan or debt from China. — U______ (@UtkarshRatedR23) February 19, 2022 We understand bro. U did well. Its not ur fault. More power to u and other foreign stars who wants to criticize PSL but not criticizing. Hope they get strength and writes the same. Return back Australia king _. — KochiKame (@TweetECricket) February 19, 2022 With Reuters inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Continued To Lie\": Faulkner Withdraws From PSL Due To Contract Dispute","link":"https://sports.ndtv.com/cricket/continued-to-lie-james-faulkner-withdraws-from-psl-due-to-non-payment-2777702","keywords":null,"creator":null,"video_url":null,"description":"Australian cricketer James Faulkner on Saturday announced that he will take no further part in the ongoing Pakistan Super League, blaming the Pakistan Cricket Board (PCB) and his franchise Quetta...","content":null,"pubDate":"2022-02-19 12:56:38","full_description":"Australian cricketer James Faulkner was on Saturday handed a life ban from the Pakistan Super League (PSL) after he withdrew from the tournament, blaming the Pakistan Cricket Board (PCB) and his franchise Quetta Gladiators for not \"honouring\" a contractual agreement. Taking to Twitter, Faulkner, who played six matches for the Gladiators this season, had also apologised to the Pakistan cricket fans for withdrawing from the competition. \"I apologise to the Pakistan cricket fans. But unfortunately, I've had to withdraw from the last two matches and leave the PSL due to the PCB not honouring my contractual agreements/payments,\" Faulkner wrote in a Twitter thread. \"I've been here the whole duration and they have continued to lie to me,\" he added. 1/2 I apologise to the Pakistan cricket fans. But unfortunately I've had to withdraw from the last 2 matches and leave the @thePSLt20 due to the @TheRealPCB not honouring my contractual agreement/payments. I've been here the whole duration and they have continued to lie to me. In another tweet, Faulkner said that he wanted to get international cricket back in Pakistan, adding that the treatment he has received from the PCB and the PSL \"has been a disgrace\". \"It hurts to leave as I wanted to help get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace from PCB and PSL. I'm sure you all understand my position,\" he added in another tweet. 2/2 It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace from the @TheRealPCB and @thePSLt20 I'm sure you all understand my position. In response, the PCB termed Faulkner's allegations as \"baseless\" and handed him a life ban from the tournament. PCB and Quetta Gladiators strongly refute James Faulkner's baseless allegations. Read more: https://t.co/fEfqU4X471 #HBLPSL7 \"The PCB and Quetta Gladiators are disappointed and dismayed with the reprehensible behavior of Mr James Faulkner, who was also part of the Abu Dhabi-leg of the HBL Pakistan Super League in 2021, and, along with all participants, has always been treated with utmost respect,\" read a part of the PCB's statement . Promoted \"In wake of the above, and taking serious note of Mr James Faulkner's gross misconduct that was an attempt to bring the PCB, Pakistan cricket and the HBL Pakistan Super League into disrepute, it has been unanimously agreed by the PCB and the franchises that Mr James Faulkner will not be drafted in future HBL Pakistan Super League events,\" it added. Faulkner played six matches for the Gladiators in the ongoing PSL 7, taking 6 wickets.","image_url":"https://i.ndtvimg.com/i/2017-09/james-faulkner_650x400_51505183648.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Brutal shot on Test great ends comeback chat","link":"https://wwos.nine.com.au/rugby/drew-mitchell-comeback-in-queensland-vs-tonga-invitational-charity-game/bd30a3e6-b6dd-42e2-8b1f-e3b2a10ee7f3","keywords":null,"creator":["wwos"],"video_url":null,"description":"Michael Cheika wants Drew Mitchell to stay retired after \"getting rinsed\" in a charity match at Suncorp Stadium.","content":"Former Wallabies coach Michael Cheika famously lured Drew Mitchell out of the international wilderness to star at the 2015 Rugby World Cup.But after watching the 37-year-old take on a Tongan Invitational XV at Suncorp Stadium on Saturday night, Cheika says enough is enough.\"To be honest I'm disappointed with the viewers because that's garbage,\" Cheika said in response to a Stan Sport poll asking whether Mitchell should come out of retirement.Super Rugby Pacific kicks off this weekend with Waratahs vs Drua, Chiefs vs Highlanders, Crusaders vs Hurricanes, Reds vs Rebels and Brumbies vs Force - all streaming ad-free, live and on demand only on Stan Sport. Sign up for your free seven day trial!https://twitter.com/StanSportRugby/status/1494971739868053508?s=20&t=6zeqpsTT_YAq8Rq_kaH4cA\"Like it should be 100 (per cent) zero, coming out of retirement.\"Mitchell lined up at outside centre for a vintage Reds XV that included fellow greats Nathan Sharpe, Chris Latham, Brad Thorn, James Horwill and Stephen Moore.But the mic'd-up Mitchell appeared to be a target for some tough-tackling Tongans, taking one particularly brutal hit from Pila Fifita.READ MORE: Taniela Tupou's eventful night in Reds win over RebelsREAD MORE: Waratahs snap painful drought with thumping win over DruaREAD MORE: Brodie Retallick stars for Chiefs in return to Super Rugby\"I got absolutely rinsed,\" Mitchell admitted.\"I donated a hamstring and a rib to the Tongan relief fund. It's obviously for a great cause but there is no chance I'm coming out of retirement. I'm well and truly stuck on the couch watching Yellowstone on Stan.\"The Queensland Rugby Union organised the star-studded charity match with proceeds going to the UNICEF Australia Tongan Recovery Appeal.More than $70,000 had been raised for the tsunami relief effort before the match even kicked off at Suncorp Stadium.\"It's obviously a great initiative and when someone like Toutai Kefu calls up and says get involved in that game, that charity match for a great cause, there's only one answer and that's 'yes',\" Mitchell said.As for a more permanent comeback?\"That is an emphatic 'no'. It won't be happening,\" Mitchell said.Radike Samo, Trevor Leota, George Smith, Hosea Gear, Digby Ioane and Lote Tuqiri were among the big names on the Tongan side.All Blacks great Andrew Mehrtens - who recently injured himself in a charity cricket match - was most amused by Mitchell's outing, which will be available as a full match replay on Stan Sport.\"It's a great initiative, isn't it? Stan Comedy,\" Mehrtens said.\"If you haven't had enough of a laugh at Taniela Tupou and his antics then get on and have a look at Drew.\"The charity game was a curtain raiser to the Reds vs Rebels Super Rugby Pacific match, won 23-5 by Australian champions Queensland.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-19 12:41:10","full_description":"Former Wallabies coach Michael Cheika famously lured Drew Mitchell out of the international wilderness to star at the 2015 Rugby World Cup. But after watching the 37-year-old take on a Tongan Invitational XV at Suncorp Stadium on Saturday night, Cheika says enough is enough. \"To be honest I'm disappointed with the viewers because that's garbage,\" Cheika said in response to a Stan Sport poll asking whether Mitchell should come out of retirement. Super Rugby Pacific kicks off this weekend with Waratahs vs Drua, Chiefs vs Highlanders, Crusaders vs Hurricanes, Reds vs Rebels and Brumbies vs Force - all streaming ad-free, live and on demand only on Stan Sport. Sign up for your free seven day trial! \"Like it should be 100 (per cent) zero, coming out of retirement.\" Mitchell lined up at outside centre for a vintage Reds XV that included fellow greats Nathan Sharpe, Chris Latham, Brad Thorn, James Horwill and Stephen Moore. But the mic'd-up Mitchell appeared to be a target for some tough-tackling Tongans, taking one particularly brutal hit from Pila Fifita. READ MORE: Taniela Tupou's eventful night in Reds win over Rebels READ MORE: Waratahs snap painful drought with thumping win over Drua READ MORE: Brodie Retallick stars for Chiefs in return to Super Rugby \"I got absolutely rinsed,\" Mitchell admitted. \"I donated a hamstring and a rib to the Tongan relief fund. It's obviously for a great cause but there is no chance I'm coming out of retirement. I'm well and truly stuck on the couch watching Yellowstone on Stan.\" The Queensland Rugby Union organised the star-studded charity match with proceeds going to the UNICEF Australia Tongan Recovery Appeal. More than $70,000 had been raised for the tsunami relief effort before the match even kicked off at Suncorp Stadium. \"It's obviously a great initiative and when someone like Toutai Kefu calls up and says get involved in that game, that charity match for a great cause, there's only one answer and that's 'yes',\" Mitchell said. As for a more permanent comeback? \"That is an emphatic 'no'. It won't be happening,\" Mitchell said. Radike Samo, Trevor Leota, George Smith, Hosea Gear, Digby Ioane and Lote Tuqiri were among the big names on the Tongan side. All Blacks great Andrew Mehrtens - who recently injured himself in a charity cricket match - was most amused by Mitchell's outing, which will be available as a full match replay on Stan Sport. \"It's a great initiative, isn't it? Stan Comedy,\" Mehrtens said. \"If you haven't had enough of a laugh at Taniela Tupou and his antics then get on and have a look at Drew.\" The charity game was a curtain raiser to the Reds vs Rebels Super Rugby Pacific match, won 23-5 by Australian champions Queensland. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/412191/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma Named Test Captain Ahead Of SL Series: How The World Reacted","link":"https://sports.ndtv.com/cricket/rohit-sharma-named-test-captain-ahead-of-sri-lanka-series-how-the-world-reacted-2777658","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma was on Saturday named captain of the Indian cricket team for the upcoming Test series against Sri Lanka.","content":null,"pubDate":"2022-02-19 12:26:42","full_description":"The Board of Control for Cricket in India (BCCI) on Saturday named Rohit Sharma as the captain of India's Test team ahead of the upcoming series against Sri Lanka. The decision was taken while announcing India's T20I and Test squads for the upcoming home series against Sri Lanka, which starts on Thursday. Rohit has early named as India's full-time white-ball captain late last year, replacing Virat Kohli in the role. After Rohit was named as captain of India's Test team ahead of the upcoming series, fans took to Twitter and congratulated the 34-year-old batter. Here's how the world reacted to Rohit Sharma being named as India's captain in Tests ahead of the Sri Lanka series. \"From getting dropped in Tests to Test Captain of India, Rohit Sharma's rise in test cricket has been an inspiration. Sun has risen very well,\" a fan captioned Rohit's photo on Twitter. From getting dropped in Tests to Test Captain of India, Rohit Sharma's rise in test cricket has been an inspiration. Sun has risen very well. pic.twitter.com/5UoWdzx8eL \"Team India All Format Captain Rohit Sharma. Congrats @ImRo45,\" another fan tweeted. Team India All Format Captain Rohit Sharma Congrats @ImRo45 #RohitSharma #Hitman pic.twitter.com/X27zJM9JAS \"Rohit Sharma is India's 35th Test captain. He became a regular member and opener of the Test squad in last few years and now will be leading India in the longer formats. A terrific rise by the Hitman,\" a fan wrote on Twitter. Rohit Sharma is India's 35th Test captain. He became a regular member and opener of the Test squad in last few years and now will be leading India in the longer formats. A terrific rise by the Hitman. \"Now you are looking at new test captain of Team India!!\" a fan captioned a post. Now you are looking at new test captain of Team India!! @ImRo45 pic.twitter.com/KRLZt0sas6 \"Rohit Sharma named as the Test captain of Team India. @ImRo45 Proud moment,\" a fan captioned the post. Rohit Sharma named as the Test captain of Team India. @ImRo45 Proud moment pic.twitter.com/jGZimDVtHf While Rohit was named as Test captain, Jasprit Bumrah will be his deputy for the Sri Lanka series. Also, veteran batters Ajinkya Rahane and Cheteshwar Pujara were dropped from the Test team after a disappointing recent run of form.","image_url":"https://c.ndtvimg.com/2021-09/eiu4i16_rohit-sharma-afp_625x300_05_September_21.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia's Faulkner leaves PSL over payment dispute","link":"https://sportstar.thehindu.com/cricket/australia-james-faulkner-leaves-psl-over-payment-dispute/article38430419.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Australian all-rounder James Faulkner abruptly left the Pakistan Super League (PSL) on Saturday citing payment disputes, though the Pakistan Cricket Board (PCB) has denied the allegation.","content":null,"pubDate":"2022-02-19 12:26:15","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"James Faulkner and PCB engage in war of words over payment issue in PSL","link":"https://zeenews.india.com/cricket/james-faulkner-and-pcb-engage-in-war-of-words-over-payment-issue-in-psl-2437910.html","keywords":null,"creator":null,"video_url":null,"description":"Australian all-rounder James Faulkner, who plays for Quetta Gladiators in Pakistan Super League (PSL), blasted Pakistan Cricket Board and the management of Pakistan Super League over a payment issue.","content":null,"pubDate":"2022-02-19 12:16:00","full_description":"Australian all-rounder James Faulkner, who plays for Quetta Gladiators in Pakistan Super League (PSL), blasted Pakistan Cricket Board and the management of Pakistan Super League over a payment issue. Faulker wrote on his Twitter: \"I apologise to the Pakistan cricket fans. But unfortunately I’ve had to withdraw from the last 2 matches and leave the @thePSLt20 due to the @TheRealPCB not honouring my contractual agreement/payments. I’ve been here the whole duration and they have continued to lie to me. \"It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace from the @TheRealPCB and @thePSLt20. I’m sure you all understand my position.\" PCB, in reply to the accusation made by Faulkner, said that the charges are fake and a detailed reply is awaited from them. 1/2 I apologise to the Pakistan cricket fans. But unfortunately I've had to withdraw from the last 2 matches and leave the @thePSLt20 due to the @TheRealPCB not honouring my contractual agreement/payments. I've been here the whole duration and they have continued to lie to me. — James Faulkner (@JamesFaulkner44) February 19, 2022 2/2 It hurts to leave as I wanted to help to get international cricket back in Pakistan as there is so much young talent and the fans are amazing. But the treatment I have received has been a disgrace from the @TheRealPCB and @thePSLt20 I'm sure you all understand my position. — James Faulkner (@JamesFaulkner44) February 19, 2022 The PCB and Quetta Gladiators have regretfully taken note of Mr James Faulkner's false and misleading accusations and will shortly be releasing a detailed statement on the matter. #HBLPSL7 — Pakistan Cricket (@TheRealPCB) February 19, 2022 \"The PCB and Quetta Gladiators have regretfully taken note of Mr James Faulkner's false and misleading accusations and will shortly be releasing a detailed statement on the matter.\"","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma named India's next Test captain, replacing Virat Kohli - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9yb2hpdC1zaGFybWEtbmFtZWQtYXMtaW5kaWFuLXRlc3QtY2FwdGFpbi1yZXBsYWNlcy12aXJhdC1rb2hsaS8xNzBjZTQ5Yy05MTMzLTQ3ZTYtOWQyZC00NTVlNWZkYzE0YTLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma named India's next Test captain, replacing Virat Kohli  Wide World of SportsIndia take big step in post-Kohli era with new Test captain named  Fox SportsPujara, Rahane, Ishant, Saha dropped for Sri Lanka Test series  ESPNcricinfoRohit’s Test coronation accompanied by culling of the old guard  The Indian ExpressRohit Sharma appointed as India's full-time Test captain  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2022-02-19 12:04:53","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma named India's Test captain","link":"https://www.perthnow.com.au/sport/cricket/rohit-sharma-named-indias-test-captain-c-5761174","keywords":null,"creator":["Amlan Chakraborty"],"video_url":null,"description":"Opener Rohit Sharma has succeeded Virat Kohli as India cricket captain in all three formats of the game, after being named Test skipper.","content":null,"pubDate":"2022-02-19 12:03:24","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5761174/79651c88527ff687ba92abd29bcea0eb56b30086-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"}]}