{"newsArray":[{"title":"T20 Open Cricket Championship-2022 commences at Bandipora","link":"https://kashmirreader.com/2022/08/09/t20-open-cricket-championship-2022-commences-at-bandipora/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"BANDIPORA: The Additional Deputy Commissioner (ADC) Bandipora, Waseem Raja on Monday inaugurated the 4th T20 Open Cricket Championship-2022 at S.K Stadium, here. The championship has been organised by Hashmee Cricket Club Bandipora in collaboration with District Administration Bandipora and District Election Office Bandipora. The 4th T20 Open Cricket Championship-2022 is powered by Ali’s Sports Academy […]","content":"BANDIPORA: The Additional Deputy Commissioner (ADC) Bandipora, Waseem Raja on Monday inaugurated the 4th T20 Open Cricket Championship-2022 at S.K Stadium, here. The championship has been organised by Hashmee Cricket Club Bandipora in collaboration with District Administration Bandipora and District Election Office Bandipora. The 4th T20 Open Cricket Championship-2022 is powered by Ali’s Sports Academy Bandipora and supported by Bandipora Cricket Initiative. The inaugural match was played between Rising Star Budgam vs Hamdan Hurricane Srinagar. Speaking on the occasion, Padmashree Faisal Ali Dar said that 64 teams from across Kashmir are participating in the Knockout T20 championship. He said organisers have arranged all the required facilities in collaboration with the District Administration to run the championship smoothly and to involve youth in sports activities. Interacting with the players and spectators, the ADC complimented the organisers of the event for showing sports spirit and involving youth in sports activities. He said District Administration is conducting various activities under SVEEP (Systematic Voters’ Education and Electoral Participation program) and this is also part of awareness under SVEEP to aware youth regarding voting rights. He also highlighted the importance of the electoral process and participation of every eligible citizen in strengthening the Democracy in the country. The ADC urged the youth to participate in sports and athletic activities apart from pursuing their academics for their physical and mental health and said that such an event will help to keep the young generation away from drugs, social evils and inculcate the spirit and love among the youth.     KR Desk","pubDate":"2022-08-08 21:31:37","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Premier admits Gabba blowout, casts doubt on Ekka sporting revamp","link":"https://www.couriermail.com.au/news/queensland/qld-politics/palaszczuk-dismisses-lions-using-showgrounds-during-gabba-upgrade/news-story/f3d958e67e72d99e366e4d6a32e4cdb0","keywords":["CM QLD News and Photos","QLD Politics","SEQ Olympics Bid 2032","Sport"],"creator":null,"video_url":null,"description":"Annastacia Palaszczuk has cast doubt on plans for the Ekka’s Main Arena to be redeveloped into a boutique stadium to temporarily host Brisbane Lions games while the Gabba is rebuilt for the 2032 Olympics.","content":"The Premier also conceded the $1bn cost of razing and rebuilding the Gabba would likely blow out, citing “worldwide” building material price hikes and shortages.RNA chief executive Brendan Christou last month confirmed discussions were under way with Stadiums Queensland and the Lions over his proposal for a 20,000-plus seat stadium at the Ekka, with the AFL club saying it supported the idea.The venue could not only host Brisbane games in the lead-up to the Olympics, but AFLW and cricket after 2032.But Ms Palaszczuk appeared to dismiss the $80m proposal when asked about it during a visit to the Ekka on Monday.“Can I say very clearly that as part of our Olympic bid it (the RNA) will be used for the dressage and show jumping – that is what we actually pitched to the International Olympic Committee,” she said. “In relation to any further proposals, there is ­currently a brand new field being built out at Springfield, we also have ­regional AFL grounds and we have Carrara down in the Gold Coast.”Pressed further, Ms Palaszczuk said “they have had no discussions with me, the Brisbane Lions, about that (the proposal) – in fact, yesterday, they were talking to me about how great the Springfield campus (in Ipswich) is.” However, Lions infrastructure, strategy and government general manager Jake Anson said: “Lions fans want to see us play in Brisbane.“Brisbane must continue to stage sports events leading into the Olympic Games.“Brighton Homes Arena at Springfield Central is nearly complete. “It can be expanded, but more needs to be ­understood about its Olympics role to determine the business case.”As it currently stands, the Springfield stadium has a capacity of up to 10,000 – well short of the Lions 42,000-strong membership. Mr Anson confirmed there had been “dialogue with the Queensland government and Stadiums Queensland regarding the viability of a number of venues, including the RNA”. Ms Palaszczuk said the $1bn figure to redevelop the Gabba had been based on “cost estimates at the time”.“Of course, now we understand that there’s been a lot of increase in shortages and supply and materials – they’re worldwide issues,” she said.","pubDate":"2022-08-08 19:36:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"USA-W U19 vs WI-W U19 Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for 1st T20I","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/usa-w-u19-vs-wi-w-u19-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-1st-t20i?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-08-08 19:28:15","image_url":"https://static.sportskeeda.com/editor/2022/08/35036-16599796419263-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Tottenham striker and England captain Harry Kane takes on six-hitting challenge at The Hundred","link":"https://metro.co.uk/2022/08/08/tottenham-star-harry-kane-takes-on-six-hitting-challenge-the-hundred-cricket-17149356/","keywords":["Cricket","Antonio Conte","England cricket","England football team","Eoin Morgan","Harry Kane","Jos Buttler","Premier League","The Hundred","Tottenham Hotspur FC"],"creator":["Louis Sealey"],"video_url":null,"description":"Not bad...","content":"Tottenham and England striker Harry Kane swapped his football boots for a cricket bat as he took part in a six-hitting challenge before a Hundred match at Lord’s. Kane took on Spurs team-mate Matt Doherty in the challenge as the pair tried their best to clear the ropes ahead of London Spirit’s clash with Manchester Originals. Former England captain and Sky Sports pundit Nasser Hussain was on hand to offer technical advice but the pair did not look too out of place at the makeshift crease. Kane and Doherty are both cricket lovers and met London Spirit captain Eoin Morgan and Manchester Originals skipper Jos Buttler before the challenge. Tottenham legend Kane then performed the toss, with Spirit posting 160-6 after electing to bat first. England opener Zak Crawley made 41 and West Indies all-rounder Kieron Pollard smashed four sixes in his 11-ball 34. Spurs duo Kane and Doherty helped Tottenham kick-start their 2022-23 season with an emphatic 4-1 win over Southampton on Saturday. The pair will return to action this weekend when Antonio Conte’s side travel across London to face Chelsea. From the Premier League to #TheHundred …â¡ @HKane vs @mattdoherty20 in the six-hitting challenge! Are you watching @benstokes38 ? ðð pic.twitter.com/MI8KgGxlNC 'Criminal!' - Paul Scholes blasts two Manchester United players after Brighton defeat 'They're not good enough!' - Roy Keane says Erik ten Hag must replace Man Utd duo Harry Redknapp rates Man Utd, Chelsea, Arsenal and Tottenham's title chances MORE : Kevin Pietersen urges England not to drop 'best player' Jason Roy MORE : Eoin Morgan returns to form as London Spirit edge Hundred thriller For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","pubDate":"2022-08-08 19:23:41","image_url":"https://metro.co.uk/wp-content/uploads/2022/08/GettyImages-1413656651.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Harry Kane performs the toss for The Hundred clash before he and Tottenham team-mate Matt Doherty have a go","link":"https://www.thesun.ie/sport/football/9222966/tottenham-harry-kane-coin-toss-cricket-the-hundred/","keywords":["Football","Sport","Cricket","Premier League","Tottenham Hotspur transfer news"],"creator":["Joshua Mbu"],"video_url":null,"description":null,"content":"TOTTENHAM striker Harry Kane performed the coin toss ahead of The Hundred clash before joining team-mate Matt Doherty in batting. The two Spurs aces attended the match off the back of a barnstorming start to the Premier League campaign. PAKane alongside Morgan for the coin toss[/caption] GettyThe Tottenham stars then took part in a six hitting challenge[/caption] GettyBoth Kane and Doherty impressed in the challenge, getting significant height and distance on their batting[/caption] Both featured in Spurs’ opening day 4-1 demolition of Southampton. However, neither managed to get in among the goals to open their Prem account for the season. Instead, Kane and Doherty took part in the coin toss ahead of The Hundred cricket match, before trying to show off their batting skills. The pair took on a six hitting challenge ahead of the London Spirit and Manchester Originals clash. Doherty in particular was impressive, getting significant height and distance with his batting. Kane and Doherty weren’t shy to hide their biases as they sported Spirit uniform. Spurs are back in action next weekend against London rivals Chelsea. The table toppers will be hoping to claim the scalp of one of their biggest rivals early on to make a statement of their intent. Most read in Football ROY THE RED Richards jokingly winds up Keane by telling him that 'he looks nervous' RED DEVILS LATEST Milinkovic-Savic 'says yes', Cristiano Ronaldo BOOED in United video GIGGS 'ABUSE' Giggs 'kicked naked girlfriend out of 5-star hotel in row over him flirting' SAINT-SATIONAL Moment Saint-Maximin gives astonished Newcastle fan a ROLEX after Forest win ACE ‘ATTACK' German international star accused of kicking pregnant ex in stomach BALE FORCE Bale scores 'absolutely filthy' LAFC goal to send MLS commentator wild FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS Spurs are on a 15-year trophy drought, with their last cup lift coming in 2008. Ledley King was the captain to lift the then Carling Cup. Kane is yet to win silverware in his football career. His earliest opportunity will be at the Qatar World Cup in November-December with England.","pubDate":"2022-08-08 18:52:05","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"No Plate team in Ranji Trophy knockouts","link":"https://www.thehindu.com/sport/no-plate-team-in-ranji-trophy-knockouts/article65747075.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"BCCI announces the return of Duleep Trophy and Irani Cup to domestic cricket calendar","content":"Ranji Trophy... the symbol of domestic supremacy. | Photo Credit: K. MURALI KUMAR For the first time in 15 seasons, the Ranji Trophy will have separate Elite and Plate league final, with the Board of Control for Cricket in India announcing a full-fledged domestic season on Monday. The Ranji Trophy Elite League will see 32 teams divided into four groups of eight teams each while the Plate League will see six recently-added teams. Top two teams from each of the Elite groups will qualify for the quarterfinals. The Plate League will decide its own champion with the knockouts. The arrangement will ensure that the quality of Ranji knockouts will not be diluted, as it was for the last few seasons with the policy of including a Plate team in it. Since the BCCI switched from zonal league to a two-tier Ranji Trophy league in 2002-03 till the 2007-08 season, the Plate League — then with 12 teams — will witness its own champion. The last Plate champion was Gujarat, which had overcome Railways in a thrilling final at the Brabourne Stadium here in January 2008. The other two senior men’s tournaments — Syed Mushtaq Ali Trophy (T20) and Vijay Hazare Trophy (one-day) — will be played in the same format as the last year. It will have the 38 participating teams divided into five groups. The BCCI has reintroduced the Duleep Trophy and the Irani Cup in its calendar. Duleep Trophy will return to its conventional inter-zonal avatar, with the addition of North East Zone as the sixth team. It will be played on a knockout basis from Sept. 8 to 25 to kick off the season. Irani Cup will see Ranji champion Madhya Pradesh pitted against Rest of India from Oct. 1 to 5. With an eye on next year’s inaugural Under-19 women’s World Cup, the BCCI has introduced the women’s Under-19 T20 Trophy and Challenger Trophy tournaments. The senior women’s season is set to be wrapped just before the ODI World Cup begins in South Africa in February next year. The tournament dates: Ranji Trophy: Dec. 13 to Feb. 20, 2023. Syed Mushtaq Ali Trophy: Oct. 11 to Nov. 5; Vijay Hazare Trophy: Nov. 12 to Dec. 2. Duleep Trophy: Sept. 8 to 25; Irani Cup: Oct. 1 to 5. Senior women’s T20 Trophy: Oct. 11 to Nov. 5; Senior women’s inter-zonal T20 Trophy: Nov. 8 to 15; Senior women’s T20 Challenger Trophy: Nov. 20 to 26; Senior women’s one-day Trophy: Jan. 18 to Feb. 7, 2023; Senior women’s inter-zonal one-day Trophy: Feb. 12 to 21, 2023. Ranji Trophy Groups: Elite: League A: Bengal, Uttar Pradesh, Uttarakhand, Haryana, Himachal Pradesh, Baroda, Odisha, and Nagaland. League B: Mumbai, Saurashtra, Hyderabad, Andhra, Maharashtra, Tamil Nadu, Delhi, and Assam. League C: Karnataka, Kerala, Jharkhand, Chhattisgarh, Services, Rajasthan, Goa, and Pondicherry. League D: Punjab, Madhya Pradesh, Vidarbha, Railways, Gujarat, Jharkhand, Chandigarh, and Tripura. Plate League: Meghalaya, Manipur, Sikkim, Arunachal, Bihar, and Mizoram. Our code of editorial values Printable version | Aug 9, 2022 12:09:56 am | https://www.thehindu.com/sport/no-plate-team-in-ranji-trophy-knockouts/article65747075.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-08-08 18:38:16","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Bumrah is not playing Asia Cup 2022: Is Jasprit Bumrah injured?","link":"https://thesportsrush.com/cricket-news-why-bumrah-is-not-playing-asia-cup-2022-is-jasprit-bumrah-injured/","keywords":["Cricket","India Cricket Team","asia cup","Asia Cup 2022","India","Jasprit Bumrah"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Jasprit Bumrah is not playing Asia Cup 2022: The senior Indian fast bowler isn’t part of a strong 15-member squad. Premier fast bowler Jasprit Bumrah is not part of India’s 15-member Asia Cup 2022 squad leaving the team with a three-man pace attack comprising of Bhuvneshwar Kumar, Arshdeep Singh and Avesh Khan. Pacer Deepak… The post Why Bumrah is not playing Asia Cup 2022: Is Jasprit Bumrah injured? appeared first on The SportsRush.","content":"Why Jasprit Bumrah is not playing Asia Cup 2022: The senior Indian fast bowler isn’t part of a strong 15-member squad. Premier fast bowler Jasprit Bumrah is not part of India’s 15-member Asia Cup 2022 squad leaving the team with a three-man pace attack comprising of Bhuvneshwar Kumar, Arshdeep Singh and Avesh Khan. Pacer Deepak Chahar, who has regained fitness after missing competitive cricket for almost six months, has been named among three standbys for the tournament. Bumrah’s absence means that India won’t be playing the Asia Cup with their ideal squad. With India scheduled to host Australia and South Africa for white-ball series before ICC T20 World Cup 2022, the team management would be hoping for Bumrah to return to action before the world event. It was an hour or so before the announcement of official squad that news around Bumrah suffering a back injury has begin to do the rounds in the Indian media. Rested for the tour of West Indies, Bumrah had last played for India during the tour of England last month. With him experiencing back spams during his rest period, Bumrah has been ruled out of action for an indefinite period of time. “Jasprit Bumrah has a back injury and will not play in the Asia Cup. He is our main bowler and we would like him to be back in action before T20 World Cup. We can’t risk him in the Asia Cup as the injury could aggravate,” a senior BCCI official told PTI on the condition of anonymity. The only two instances of Bumrah playing international cricket in the UAE have been Asia Cup 2018 and ICC T20 World Cup 2021. In addition to Bumrah, fellow fast bowler Harshal Patel has also missed out on selection due to a rib injury . Patel, 31, was part of the Indian squad for West Indies tour but didn’t get to play a match due to injury before getting ruled out of the last two matches.","pubDate":"2022-08-08 17:26:36","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup: Jasprit Bumrah not included in India squad; Here's Why","link":"https://www.thehansindia.com/sports/cricket/asia-cup-jasprit-bumrah-not-included-in-india-squad-heres-why-756931","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Jasprit Bumrah has played 58 T20Is for IndiaHe has not played since the ODI series in EnglandAsia Cup is due to begin on Aug. 27 in Dubai","content":"Jasprit Bumrah India fast bowler Jasprit BumrahJasprit Bumrah was not included in the Asia Cup squad due to an injury. The Indian team announced its 15-man squad on Monday. It is believed that Bumrah's injury will take time to heal and the pacer will not regain full fitness in time for the Asia Cup. The 15th edition of the Asia Cup is scheduled to begin on Aug. 27 in Dubai and the six-team tournament will go on till Sept. 11. The teams were divided in two groups with India in Group A, along with arch-rivals Pakistan. The two said sides will come face to face on Aug. 28 at Dubai International Cricket Stadium. \"Jasprit Bumrah has a back injury and will not play in the Asia Cup. He is our main bowler and we would like him to be back in action before T20 World Cup. WE can't risk him in Asia Cup and the injury could aggravate,\" a senior BCCI official had told PTI before the squad announcement. Apart from Bumrah, another pacer Harshal Patel missed out on the Asia Cup due to an injury. The two players are currently undergoing rehabilitation at the National Cricket Academy (NCA) in Bengaluru, according to an official release from the BCCI. After the three-match ODI series in England, Bumrah was rested for India's white-ball tour of West Indies and also the ODI series against Zimbabwe. India included Bhuvneshwar Kumar, Avesh Khan, and Arshdeep Singh in their pace attack for Asia Cup, but the Men in Blue will certainly miss Bumrah's services. India will hope Bumrah to recover soon and have enough time to play matches to get back to his groove ahead of the T20 World Cup, which is due to take place in Oct-Nov in Australia. Bumrah has picked up 69 wickets in 58 T20Is appearances for India. Meanwhile, the likes of KL Rahul and Virat Kohli returned to the squad. Rahul has not played cricket in the last few months due to a sports hernia surgery and covid-19, while Kohli was rested from India's recent tour of the Caribbean and the upcoming series in Zimbabwe. Shreyas Iyer and Ishan Kishan, who are India's top two leading run-scorer in the T20Is this year, did not find a place in the Asia Cup squad. Iyer has scored 449 runs in 14 T20Is, while Ishan has 430 runs to his name in 14 T20Is. Iyer, however, was named in India's reserves for the Asia Cup, along with Deepak Chahar and Axar Patel. India's 15-man squad for Asia Cup: Rohit Sharma (c), KL Rahul (vc), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wk), Dinesh Karthik (wk), Hardik Pandya, Ravindra Jadeja, R. Ashwin, Yuzvendra Chahal, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan.","pubDate":"2022-08-08 17:17:31","image_url":"https://assets.thehansindia.com/h-upload/2022/08/08/500x300_1306999-bumrah.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India squad for Asia Cup 2022: Asia Cup 2022 cricket team list India player list","link":"https://thesportsrush.com/cricket-news-india-squad-for-asia-cup-2022-asia-cup-2022-cricket-team-list-india-player-list/","keywords":["Cricket","India Cricket Team","asia cup","Asia Cup 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India squad for Asia Cup 2022 player list: India have announced a strong 15-member squad for Asia Cup 2022. The All-India senior selection committee has named a 15-member squad for Asia Cup 2022. A squad trimmed from 18 to 15 has space for the return of three senior players in vice-captain KL Rahul, former captain… The post India squad for Asia Cup 2022: Asia Cup 2022 cricket team list India player list appeared first on The SportsRush.","content":"India squad for Asia Cup 2022 player list: India have announced a strong 15-member squad for Asia Cup 2022. The All-India senior selection committee has named a 15-member squad for Asia Cup 2022. A squad trimmed from 18 to 15 has space for the return of three senior players in vice-captain KL Rahul, former captain Virat Kohli and spinner Yuzvendra Chahal. Rahul, who hasn’t played a competitive match since Indian Premier League 2022 owing to injury and COVID-19 , would’ve both toured England and West Indies under normal circumstances. Having made a full recovery now, Rahul has not just been recalled to the T20I squad but also handed the vice-captaincy. Kohli, who had been rested from the tours of West Indies and Zimbabwe, will return to a near full-strength squad in the hope of ending a rut. Chahal, who played a three-match ODI series in West Indies, was also rested for the recently concluded five-match T20I series. Batters Ishan Kishan, Shreyas Iyer and Sanju Samson, all-rounder Axar Patel, pacer Harshal Patel ( injured ) and spinner Kuldeep Yadav have been dropped from the squad which had toured West Indies recently. Shreyas Iyer and Axar Patel are among the three standby players named with the main squad. Pacer Deepak Chahar, who had earlier been named in the ODI squad for Zimbabwe tour, is the third Indian standby player for Asia Cup 2022. While the wicket-keeper duo of Rishabh Pant and Dinesh Karthik and spinner Ravichandran Ashwin have retained their spots, fast bowler Jasprit Bumrah has missed out on selection because of a back injury. This is a good team just need Bumrah and Harshal back to full fitness going forward. Good to see Kohli is back. Expecting him to be back to his full form. #AsiaCup2022 — Irfan Pathan (@IrfanPathan) August 8, 2022 Rohit Sharma (c), KL Rahul (vc), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wk), Dinesh Karthik (wk), Hardik Pandya, Ravindra Jadeja, Ravichandran Ashwin, Yuzvendra Chahal, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan.","pubDate":"2022-08-08 16:54:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Kohli, Rahul in India Asia Cup squad but Bumrah out injured","link":"https://www.thestar.com.my/sport/cricket/2022/08/09/cricket-kohli-rahul-in-india-asia-cup-squad-but-bumrah-out-injured","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India batsmen Virat Kohli and KL Rahul have been recalled to the Twenty20 squad for the Asia Cup but seamer Jasprit Bumrah has been ruled out due to injury, the country's cricket governing body BCCI said on Monday. Read full story","content":"(Reuters) - India batsmen Virat Kohli and KL Rahul have been recalled to the Twenty20 squad for the Asia Cup but seamer Jasprit Bumrah has been ruled out due to injury, the country's cricket governing body BCCI said on Monday. Former captain Kohli and Bumrah were left out of the T20 squad for the five-match series against West Indies, which India went on to win 4-1 on Sunday. Kohli has endured a lean run of form across all formats and the 33-year-old is without a century in international cricket since November 2019. Rahul returns to the squad after a lengthy period on the sidelines following a groin injury and COVID-19 diagnosis. He will be Rohit Sharma's deputy. Harshal Patel is also not available for selection due to injury, while Shreyas Iyer, Axar Patel and Deepak Chahar have been named as standbys. India are defending champions at the Asia Cup, which will be played from Aug. 27-Sept. 11 in the United Arab Emirates. They will open their campaign against arch rivals and neighbours Pakistan in a blockbuster Sunday clash. The tournament, which serves as preparation for the Asian sides in the lead-up to the T20 World Cup later this year, was shifted to the UAE last month due to the political and economic crisis in Sri Lanka, who retain the hosts' honour. India squad: Rohit Sharma (captain), KL Rahul, Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant, Dinesh Karthik, Hardik Pandya, Ravindra Jadeja, R Ashwin, Yuzvendra Chahal, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan (Reporting by Manasi Pathak in Bengaluru; Editing by Ken Ferris)","pubDate":"2022-08-08 16:50:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/09/1690022.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Ex-India Cricketer Manoj Prabhakar Appointed As New Head Coach Of Nepal","link":"https://sports.ndtv.com/cricket/former-india-cricketer-manoj-prabhakar-appointed-as-new-head-coach-of-nepal-3237604","keywords":null,"creator":null,"video_url":null,"description":"The Cricket Association of Nepal (CAN) on Monday announced former Indian cricketer Manoj Prabhakar as the new head coach of the Nepal Men's national team","content":null,"pubDate":"2022-08-08 16:33:19","image_url":"https://i.ndtvimg.com/i/2018-01/manoj-prabhakar_806x605_71516457536.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Belfast pitch report: Civil Service Cricket Club Belfast pitch report for IRE vs AFG 1st T20I","link":"https://thesportsrush.com/cricket-news-belfast-pitch-report-civil-service-cricket-club-belfast-pitch-report-for-ire-vs-afg-1st-t20i/","keywords":["Cricket","Afghanistan","Afghanistan tour of Ireland 2022","Ireland"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Belfast pitch report: The SportsRush brings you the pitch report for the 1st T20I between Ireland and Afghanistan in Belfast. Ireland will take on Afghanistan in the 1st T20I of the 5-match series at the Civil Service Cricket Ground in Belfast. This series is expected to be a competitive one. Ireland have played some great… The post Belfast pitch report: Civil Service Cricket Club Belfast pitch report for IRE vs AFG 1st T20I appeared first on The SportsRush.","content":"Belfast pitch report: The SportsRush brings you the pitch report for the 1st T20I between Ireland and Afghanistan in Belfast. Ireland will take on Afghanistan in the 1st T20I of the 5-match series at the Civil Service Cricket Ground in Belfast. This series is expected to be a competitive one. Ireland have played some great cricket in their home conditions, but they have not been able to win games. The pacers of the side have been great, whereas Paul Stirling and Harry Tector have done great in batting. Afghanistan will be led by Mohammad Nabi in the series, and again the spinners of the side will be under focus. The batters of the side will carry a huge responsibility in this game as the bowlers have always performed great for them. Belfast pitch report: The pitch at the Civil Service Cricket Ground in Belfast has been a competitive one, where there is help for every kind of players. In last Ireland vs New Zealand series, the pacers dominated in the first innings, where they took complete use of the fresh pitches, and the extra amount of bounce helped them. The spinners generally dominate in the 2nd innings, where the pitch gets a little slower. All being said about the bowlers, there are no major demons for the batters as well on the pitch, and once set, the batters can play their shots properly. The smaller boundaries and fast outfield work in the favour of the batters. Afghanistan dominates @cricketireland in the head-to-head record in T20Is. AfghanAtalan have won 14 out of the 19 games they have played against them, with Ireland winning 4 whereas the remaining one game being abandoned. #AfghanAtalan | #IREvAFG2022 pic.twitter.com/zk0q8x7Cxm — Afghanistan Cricket Board (@ACBofficials) August 8, 2022 A total of 21 T20Is have been played at this very venue, where 13 matches have been won by the chasing teams and 8 teams have been won by the teams batting first. The average 1st innings score has been 123 runs, which certainly is an indication that the batting has not been that easy here. The last T20I at this ground between Ireland and New Zealand was a high-scoring encounter, where New Zealand chased the target of 175 runs. Both Afghanistan and Ireland would love to bowl first after winning the toss in this match. The post Belfast pitch report: Civil Service Cricket Club Belfast pitch report for IRE vs AFG 1st T20I appeared first on The SportsRush.","pubDate":"2022-08-08 16:30:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli returns to India's T20I squad for the Asia Cup; Jasprit Bumrah injured - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2FzaWEtY3VwLTIwMjItdmlyYXQta29obGktcmV0dXJucy10by1pbmRpYS1zLXQyMGktc3F1YWQtZm9yLXRoZS1hc2lhLWN1cC1qYXNwcml0LWJ1bXJhaC1pbmp1cmVkLTEzMjgxMjfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli returns to India's T20I squad for the Asia Cup; Jasprit Bumrah injured  ESPNcricinfoJasprit Bumrah out of Asia Cup with back injury, India cricket team | Cricbuzz.com - Cricbuzz  CricbuzzBig guns return as India name squad for Asia Cup 2022  ICC CricketIndia Squad For Asia Cup: Rohit Sharma To Lead, Jasprit Bumrah Out Due To Injury  NDTV SportsVirat Kohli, KL Rahul return for Asia Cup 2022 | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-08-08 16:17:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Proteas captain Dean Elgar not concerned by England’s ‘Bazball’ approach","link":"https://www.iol.co.za/sport/cricket/proteas/proteas-captain-dean-elgar-not-concerned-by-englands-bazball-approach-5cfe67d2-de16-43ab-b850-ba1653f9aeb5","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Proteas skipper Dean Elgar casually brushed off concerns about confronting England’s new uber aggressive style of play Test cricket.","content":null,"pubDate":"2022-08-08 15:04:18","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/f42eb62d-44ee-5d31-a009-e9a01978bd5f&operation=CROP&offset=0x28&resize=4500x2528","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Une Australienne positive au Covid-19 autorisée à jouer lors de la finale de cricket des Jeux du Commonwealth","link":"https://www.20minutes.fr/sport/3335231-20220808-australienne-positive-covid-19-autorisee-jouer-lors-finale-cricket-jeux-commonwealth#xtor=RSS-149","keywords":["Sport"],"creator":["20 Minutes avec agence (20 Minutes)"],"video_url":null,"description":"À l'inverse, durant l'Open d'Australie en janvier 2022, Novak Djokovic avait été exclu du tournoi de tennis en raison du Covid","content":"Lors des Jeux du Commonwealth 2022 à Birmingham ( Royaume-Uni ), c’est l’équipe d’Australie qui a remporté le tournoi féminin de cricket face à l’Inde ce dimanche. La victoire a cependant été critiquée par de nombreux observateurs indiens. La raison ? Tahlia McGrath, l’une des meilleures joueuses australiennes, a été autorisée à jouer malgré un test positif au Covid quelques heures avant, explique RMC Sport . Lol, Australia banned a negative @DjokerNole but allows a Covid positive player to play cricket.. Hypocrites of the highest order. The right decision as Covid is not a disease that’s killing people now, but a hypocritical one none the less. Embarrassing. https://t.co/UsE7hicWnD — Adam Brooks 🇬🇧 (@EssexPR) August 8, 2022 L‘accès à ce contenu a été bloqué afin de respecter votre choix de consentement En cliquant sur « J‘ACCEPTE », vous acceptez le dépôt de cookies par des services externes et aurez ainsi accès aux contenus de nos partenaires J‘ACCEPTE Et pour mieux rémunérer 20 Minutes, n'hésitez pas à accepter tous les cookies, même pour un jour uniquement, via notre bouton \"J‘accepte pour aujourd‘hui\" dans le bandeau ci-dessous. Plus d’informations sur la page Politique de gestion des cookies . « Hypocrisie » et « racisme » Par mesure de précaution, la sportive a pourtant été contrainte de s’asseoir loin de ses coéquipières et a dû porter un masque. Ce n’est ainsi pas le risque sanitaire pris qui a été dénoncé par les supports indiens, mais plutôt une certaine « hypocrisie » australienne. Le pays applique en effet sur son territoire des mesures anti-Covid strictes. Elles avaient notamment mené à l’exclusion de Novak Djokovic de l’Open d’Australie de tennis en janvier dernier. Mais au Royaume-Uni, les règles d’auto-isolement sont seulement consultatives. Les organisateurs ont donc pu arbitrer librement. De plus, certains fans ont affirmé qu’il s’agissait d’une décision « raciste ». Selon eux, si une joueuse indienne avait été contaminée, alors la sélection aurait été exclue de la finale. Interrogée à ce sujet, la capitaine indienne Harmanpreet Kaur a toutefois indiqué que leur équipe était d’accord avec la décision des organisateurs de laisser Thalia McGrath jouer. « Il fallait faire preuve d’esprit sportif. Je suis contente que nous n’ayons pas dit non à Tahlia, manquer la finale aurait été très dur pour elle » a-t-elle déclaré, mentionnant le fait qu’ « elle n’était pas très malade ». Une remarque qui n’a pas calmé les critiques. Sport Football : Conséquence du Covid-19, la règle des cinq remplacements par équipe « validée définitivement » Sport Montréal : Novak Djokovic, non vacciné, ne jouera pas au Masters 1000","pubDate":"2022-08-08 15:02:14","image_url":"https://img.20mn.fr/nmVR_BSRTk68abKgCsdhCCk/648x415_australienne-tahlia-mcgrath-autorisee-participer-finale-tournoi-cricket-lors-jeux-commonwealth-malgre-test-covid-positif","source_id":"20minutes","country":["france"],"category":["sports"],"language":"french"},{"title":"Afghanistan vs Ireland T20 record head to head: IRE vs AFG head to head records in T20 history","link":"https://thesportsrush.com/cricket-news-afghanistan-vs-ireland-t20-record-head-to-head-ire-vs-afg-head-to-head-records-in-t20-history/","keywords":["Cricket","Afghanistan","Afghanistan tour of Ireland 2022","Ireland"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Afghanistan vs Ireland T20 record head to head: The SportsRush presents for you the Head to Head statistics for the first IRE vs AFG T20I. The first match of Afghanistan’s tour of Ireland 2022 will be played in Belfast tomorrow. The first T20I will be followed by four more matches as a five-match series will… The post Afghanistan vs Ireland T20 record head to head: IRE vs AFG head to head records in T20 history appeared first on The SportsRush.","content":"Afghanistan vs Ireland T20 record head to head: The SportsRush presents for you the Head to Head statistics for the first IRE vs AFG T20I. The first match of Afghanistan’s tour of Ireland 2022 will be played in Belfast tomorrow. The first T20I will be followed by four more matches as a five-match series will be played within nine days at the same venue. In their 12-year T20I history against each other, Afghanistan have maintained a one-sided dominating record against Ireland to the extent that the Irish are yet to win a home T20I against this opposition. On the way to Ireland with Rohan khan pic.twitter.com/zeFS4ZX16F — Mohammad Nabi (@MohammadNabi007) August 5, 2022 In some form on the back of locking horns against England, India, New Zealand and South Africa during their home summer, Ireland should be confident enough to challenge the Afghans especially in home conditions. The last time when Ireland and Afghanistan had played a T20I against each other was right before the onset of COVID-19 pandemic. Last of a three-match series in Greater Noida, the match had ended in a riveting super over. While Ireland had managed to come out as the victorious side then, their last victory against Afghanistan without a super over dates back to 2013. Afghanistan vs Ireland T20 record head to head Total number of matches played: 18 Matches won by IRE: 4 Matches won by AFG: 14 Matches played in Ireland: 2 (IRE 0, AFG 2) Matches played in Europe: 2 (IRE 0, AFG 2) Matches played at Civil Service Cricket Club: 0 (IRE 0, AFG 0) IRE average score against AFG: 146 AFG average score against IRE: 162 Most runs for IRE: 543 (Paul Stirling) Most runs for AFG: 411 (Hazratullah Zazai) Most wickets for IRE: 8 (George Dockrell) Most wickets for AFG: 34 (Rashid Khan) Most catches for IRE: 10 (George Dockrell) Most catches for AFG: 15 (Mohammad Nabi) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post Afghanistan vs Ireland T20 record head to head: IRE vs AFG head to head records in T20 history appeared first on The SportsRush.","pubDate":"2022-08-08 14:45:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games: Australian cricketer Tahlia McGrath played in final despite positive Covid test - The Times","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy50aGV0aW1lcy5jby51ay9hcnRpY2xlL2NvbW1vbndlYWx0aC1nYW1lcy1hdXN0cmFsaWFuLWNyaWNrZXRlci10YWhsaWEtbWNncmF0aC1wbGF5ZWQtaW4tZmluYWwtZGVzcGl0ZS1wb3NpdGl2ZS1jb3ZpZC10ZXN0LWY4Z21zajlzcNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Commonwealth Games: Australian cricketer Tahlia McGrath played in final despite positive Covid test  The TimesMoment Covid struck Tahlia McGrath hugs Australia cricket teammates at Commonwealth Games 2022  Daily MailThe picture that sums up the lunacy of Team Australia's Covid attitudes  The TelegraphPiers Morgan slams Australia’s Novak Djokovic ‘hypocrisy’ as cricketer is allowed to play WITH Covid...  The SunAustralia's women's T20 cricket side slammed after fielding Covid-positive player to help them win  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-08-08 14:30:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-Rabada fitness is top priority for South Africa&#039;s test team","link":"https://www.thestar.com.my/sport/cricket/2022/08/08/cricket-rabada-fitness-is-top-priority-for-south-africa039s-test-team","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - South Africa have made getting opening bowler Kagiso Rabada fit for the three-test series against England their top priority, captain Dean Elgar said on Monday. Read full story","content":"(Reuters) - South Africa have made getting opening bowler Kagiso Rabada fit for the three-test series against England their top priority, captain Dean Elgar said on Monday. Radaba hurt ligaments in his left ankle in last month's Twenty20 series against England but has been bowling in the nets since the test squad began a pre-series camp in Canterbury, Elgar told a virtual news conference. \"The workload is maybe the biggest concern, whether he can get himself throughout a test match with the intensity and obviously the volume of overs in a day's play,\" Elgar said. \"For now he's doing all the right things but I can't say 'yes or no' as yet,\" Elgar added about Rabada's chances of making the first test at Lords on Aug. 17. \"But it's high on our list to get him fit and giving us more resources going into the first test.\" The 27-year-old Rabada is the team's lead strike bowler with 243 test wickets at an average of 22.41. South Africa must already do without middle order batsman Temba Bavuma, who has an elbow injury, but Elgar said he was pleased with the strength of his available squad and their form. \"I think the options are brilliant for us and I think we're ticking the boxes in the right way. Some of ours guys have been doing well in county cricket and that's a massive asset for us going into this test series, just from knowing more about the conditions,\" he said. \"Another thing we got is white-ball cricketers that have had a pretty successful series over here so far, they've got a lot of confidence coming into the tests and it's almost like a breath of fresh air having those guys come in, just knowing that they've done pretty well in the last month.\" South Africa beat England 2-1 in the Twenty20 series and drew the One Day International campaign with the decisive match washed out. (Writing by Mark Gleeson in Cape Town; Editing by Christian Radnedge)","pubDate":"2022-08-08 14:19:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/08/1689740.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"CWG Cricket: A frustratingly familiar result for India","link":"https://www.hindustantimes.com/sports/commonwealth-games/cwg-cricket-a-frustratingly-familiar-result-for-india-101659967654796.html","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet and Co fell nine runs short, exactly the same margin by which they lost that ODI World Cup Final. The more things change, the more they stay the same","content":null,"pubDate":"2022-08-08 14:14:09","image_url":"https://images.hindustantimes.com/img/2022/08/08/1600x900/PTI08-08-2022-000053B-0_1659967705142_1659967705142_1659967729129_1659967729129.jpg","source_id":"hindustantimes","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights India vs Australia Men's Hockey Commonwealth Games Final 2022: Manpreet Singh and Co Settle For Si - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMipQFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2hpZ2hsaWdodHMtaW5kaWEtdnMtYXVzdHJhbGlhLW1lbnMtaG9ja2V5LWNvbW1vbndlYWx0aC1nYW1lcy1maW5hbC0yMDIyLW1hbnByZWV0LXNpbmdoLWFuZC1jby1zZXR0bGUtZm9yLXNpbHZlci1hdXNzaWVzLXdpbi03LTAtNTU2MDM2NS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights India vs Australia Men's Hockey Commonwealth Games Final 2022: Manpreet Singh and Co Settle For Si  India.comCWG 2022: Twitter reacts after India lose 0-7 to Australia in men's hockey to bag silver medal - Sports News , Firstpost  Firstpost'Congratulations, But They Will Go Home Disappointed As...': BCCI President Sourav Ganguly's Message For th  News18Watch: Deepti Sharma's One-Handed Stunner To Dismiss Beth Mooney Takes Internet By Storm  NDTV Sports‘Congratulations on winning India’s first medal in cricket’- PM Modi, Sachin Tendulkar laud Harmanpreet Kaur-led India for bagging silver  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-08-08 14:05:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"South Asian Cricket Academy wastes little time showing why it was needed | Emma John","link":"https://www.theguardian.com/sport/2022/aug/08/south-asian-cricket-academy-wastes-little-time-showing-why-it-was-needed","keywords":["Cricket","Worcestershire","Sport"],"creator":["Emma John"],"video_url":null,"description":"Programme aimed at helping British Asians progress in the county game bears early fruit with batsman Kashif AliKashif Ali learned how to bat from Mohammad Yousuf and Joe Root. There were no coaches around when he and his friends played tapeball cricket, so he watched his favourite players on YouTube, and tried to imitate them. When he was 12, his family moved from Kashmir to Luton, and three years later he played his first hardball game. By the time he was 24 he had played in the 2nd XIs of six different first-class counties – without ever making it further.Two weeks ago, Kashif finally made his first-class debut, for Worcestershire. Their County Championship match against Derbyshire was a low-scoring affair where the seamers ran rampant, and only four complete overs had been bowled when Kashif was hurried in at No 5, his team 23 for three. He put on almost a century stand for the fourth wicket with Jack Haynes, and top-scored in the innings with 52. “I didn’t think too much about it,” he says. “I just went in, played my shots, and backed myself.” The next day, Worcestershire signed him on a two-year deal. “It’s what I’ve wanted for quite a few years now, so that felt really good.” Continue reading...","content":"K ashif Ali learned how to bat from Mohammad Yousuf and Joe Root. There were no coaches around when he and his friends played tapeball cricket, so he watched his favourite players on YouTube, and tried to imitate them. When he was 12, his family moved from Kashmir to Luton, and three years later he played his first hardball game. By the time he was 24 he had played in the 2nd XIs of six different first-class counties – without ever making it further. Two weeks ago, Kashif finally made his first-class debut, for Worcestershire . Their County Championship match against Derbyshire was a low-scoring affair where the seamers ran rampant, and only four complete overs had been bowled when Kashif was hurried in at No 5, his team 23 for three. He put on almost a century stand for the fourth wicket with Jack Haynes, and top-scored in the innings with 52. “I didn’t think too much about it,” he says. “I just went in, played my shots, and backed myself.” The next day, Worcestershire signed him on a two-year deal. “It’s what I’ve wanted for quite a few years now, so that felt really good.” ‘Cricket is everything’: Adnan Miakhel’s England dreams alive as asylum granted Read more For some – including Kashif himself – the moral of this story is that if you keep faith in yourself, dreams can come true. But there is another lesson too. Kashif is one of the first graduates of the South Asian Cricket Academy, an “intervention programme” launched this year to help British Asians overcome the systemic inequalities and invisible biases that keep them out of the professional game. Kashif had been pinging around cricket’s development system for years without finding a county. It has taken the Academy less than half a season to secure him a contract. The Academy was born out of a conversation between Kabir Ali, the former England all-rounder, and his club teammate Tom Brown, the Birmingham City University researcher whose work revealed that while British Asians make up 30% of the recreational game in England, they constitute only 5% of professional cricketers. That disparity was raised at last year’s DCMS hearings into accusations of structural racism within the sport; neither the ECB nor the individual counties have got close to solving it. “I kept being told that if you’re good enough you’ll make it regardless of your background,” says Brown. Unconvinced, Brown and Kabir came up with the idea of offering British Asian cricketers tailored coaching and education, alongside match opportunities against county oppositions. Players would receive support developed for them individually, from strength and conditioning training to nutritional advice. “We wanted to show that things don’t have to be done the way they’ve always been done,” says Brown, “and we figured, even if no one got signed this year, at least we would have created a learning environment that approached things differently.” Former England player and current Yorkshire assistant coach Kabir Ali developed the idea of SACA with Tom Brown. Photograph: Gareth Copley/Getty Images Instead, success has come quickly. In recent wins against Northamptonshire and Surrey seconds SACA’s team was missing more than half their first-choice players, who were already on county trials. Even Brown was surprised at the ready talent they uncovered: when he launched the scheme, they expected to find around 16 players good enough to compete for a professional contract. They have already showcased 30 in their sides, with more awaiting their turn. Andy Umeed, who opened the batting for Warwickshire in 14 matches between 2016 and 2017, is another SACA player to earn a county contract after Somerset signed him to the end of 2023. For Umeed, the opportunity to train through the winter, and the guidance of elite coaches, enabled him to get his career back on track and “bridge that gap between club cricket and the professional game”. For Kashif, the opportunities to impress county coaches have been key. “It has been really helpful in gaining exposure, and counties having a look at you,” he says. “I have trialled quite a lot in the past but never got noticed.” The Spin: sign up and get our weekly cricket email. Funded by Birmingham City University, SACA has received less attention than the ACE programme, which was conceived around the same time in response to a dramatic decline in black British professionals. The academy’s size and scope is more limited than Ebony Rainford-Brent’s project; ACE has grown rapidly since gaining charitable status in October 2020, while SACA was created with the intention to make itself obsolete within six years, a short fix until the rest of the county system catches up with its ideas. But they have one notable thing in common: both were set up by individuals who could see a problem, and were fed up of waiting for the people supposedly in charge to fix it. Rainford-Brent’s voice as a black woman in the Surrey boardroom finally prompted action on an issue that cricket has known about for more than a decade. The ECB only recently got involved, announcing in April that it would fund ACE’s “continued expansion” as part of the action plan launched in the wake of the Rafiq hearings. Brown may be hoping that SACA’s achievements finally earn them some financial backing too; so far, they have received no support from cricket’s governing body. He says “mindsets are starting to shift” around talent identification, including the understanding that players may develop much later than the current system allows for. But in theory, at least, SACA remains an amateur side: “and the fact we’ve competed and even beaten professional sides proves there’s talent out there not making it.”","pubDate":"2022-08-08 14:00:03","image_url":"https://i.guim.co.uk/img/media/bfd56a366f1227991b61169eaff6fabbb93d9e08/136_128_3364_2019/master/3364.jpg?width=460&quality=85&auto=format&fit=max&s=aa3ec3d8a19c577f8dc3e299ee914b95","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Women cricket stars eye Olympic chance after Commonwealth Games","link":"https://www.iol.co.za/sport/cricket/international/women-cricket-stars-eye-olympic-chance-after-commonwealth-games-002327ed-1c9f-48ea-a571-10e59dad29b4","keywords":null,"creator":["AFP"],"video_url":null,"description":"Women cricketers say they would ‘love to go to LA’ to chase Olympic glory after a strikingly successful debut at the Commonwealth Games.","content":null,"pubDate":"2022-08-08 13:33:46","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/6e22290d-a91e-5245-ac97-0c2aac013f92&operation=CROP&offset=0x153&resize=4911x2760","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Belfast Cricket Ground T20 records: Belfast T20 records and highest innings total at Civil Service Cricket Club Sormont","link":"https://thesportsrush.com/cricket-news-belfast-cricket-ground-t20-records-belfast-t20-records-and-highest-innings-total-at-civil-service-cricket-club-sormont/","keywords":["Cricket","Afghanistan","Afghanistan tour of Ireland 2022","Ireland"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Belfast Cricket Ground T20 records: Civil Service Cricket Club will be hosting an international match in less than three weeks. Afghanistan’s tour of Ireland 2022 will commence in less than 24 hours from now with the first of a five-match T20I series to be played at the Civil Service Cricket Club. Readers must note that… The post Belfast Cricket Ground T20 records: Belfast T20 records and highest innings total at Civil Service Cricket Club Sormont appeared first on The SportsRush.","content":"Belfast Cricket Ground T20 records: Civil Service Cricket Club will be hosting an international match in less than three weeks. Afghanistan’s tour of Ireland 2022 will commence in less than 24 hours from now with the first of a five-match T20I series to be played at the Civil Service Cricket Club. Readers must note that all the remaining matches of this series will also be played at this venue only. Belfast, which hosted New Zealand for three T20Is for last month, will be hosting a total of eight international matches in this bumper Irish summer. Ireland, who’ve played 14 out of the 22 T20Is played here, have won four and lost nine to not have the best of records in the last 14 years. Afghanistan, on the other hand, have never played a Belfast T20I in the past. Having played nine ODIs at this venue, Afghanistan have won five and lost four matches. 🛫to 🇨🇮 pic.twitter.com/8MVzQmH7wd — fazal farooqi (@fazalfarooqi10) August 5, 2022 Highest T20I run-scorers at the Civil Service Cricket Club are Paul Stirling (188), William Porterfield (154), Glenn Phillips (148), Gary Wilson (131) and Mark Adair (112). A list of best T20I batters at this venue among active cricketers is provided below: Highest wicket-takers in Belfast T20Is are Kevin O’Brien (11), Dewald Nel (9), Andrew Cusack (9), Josh Little (9) and Harvir Baidwan (8). A list of best T20I bowlers here among active cricketers is given below: Out of 22 Belfast T20Is over the years, 13 have been won by teams batting second. The above mentioned third-highest innings total at this venue is also the highest successful T20I run-chase here.","pubDate":"2022-08-08 13:32:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"From Cricket to Arm-wrestling: Rajiv Bose Joins Pro Panja League as Business Head","link":"https://www.news18.com/news/sports/from-cricket-to-arm-wrestling-rajiv-bose-joins-pro-panja-league-as-business-head-5713405.html","keywords":["sports"],"creator":null,"video_url":null,"description":"Rajiv Bose stepped right into the action as Pro Panja League held its second Ranking Tournament in Gwalior, which saw the participation of over 600 arm-wrestlers from all over the country","content":null,"pubDate":"2022-08-08 13:05:14","image_url":"https://images.news18.com/ibnlive/uploads/2022/08/rajiv-bose-joins-pro-panja-league-as-business-head.jpg","source_id":"news18","country":["india"],"category":["sports"],"language":"english"},{"title":"Games-Canada&#039;s Hamilton prepared to throw Commonwealth 100th anniversary party","link":"https://www.thestar.com.my/sport/others/2022/08/08/games-canada039s-hamilton-prepared-to-throw-commonwealth-100th-anniversary-party","keywords":null,"creator":null,"video_url":null,"description":"BIRMINGHAM, England (Reuters) - The Commonwealth Games are ready to return in 2030 to Hamilton, the Canadian city that launched the multi-sport event 100 years ago, with Niagara Falls providing the backdrop for beach volleyball and a push to add men's cricket to the programme. Read full story","content":"BIRMINGHAM, England (Reuters) - The Commonwealth Games are ready to return in 2030 to Hamilton, the Canadian city that launched the multi-sport event 100 years ago, with Niagara Falls providing the backdrop for beach volleyball and a push to add men's cricket to the programme. With the federal and provincial governments expressing support and no other cities having formally thrown their hats in the ring, Hamilton bid leader Louis Frapporti told Reuters the 'Steel City' is the favourite when the Commonwealth Games Federation (CGF) makes a decision sometime next year. \"Without jinxing it we are clearly the punitive favourite if only because we have invested so much time and energy in actually creating a proposal,\" said Frapporti. \"The only country we are hearing any rumblings about is New Zealand. \"What we understand is we are so far ahead of them in terms of preparation of a bid that they are more likely to be interested in 2034 than 2030.\" If chosen it would mark the fifth time Canada has hosted the quadrennial event but the first since 1994 when they were held in Victoria, British Colombia. Hamilton staged the first competition in 1930 when it was known as the British Empire Games and had just six sports; athletics, boxing, lawn bowls, rowing, swimming, and wrestling. Women competed only in aquatic events. At the Birmingham Games, which came to close on Monday, nearly 5,000 athletes from 72 nations and territories competed in 19 sports. For the first time at a major multi-sport event there were more medal events for women (136) than men (134) and a record eight integrated para-sports with podium finishes counting in the overall medal standings. While the 100th anniversary provides an obvious hook on which to hang a pitch, the Hamilton100 Commonwealth Games Bid Corporation will not be playing the sentiment card but instead focus on the elements that made the Birmingham Games a success. \"We are very light on the centenary celebration elements,\" said Frapporti. \"Some people, like our (Hamilton) mayor, are very keen on that but from the perspective of us who have actually crafted the proposal we see that as the least compelling part of this. \"We want to get away from the concept of the Games as an event in time. \"Rather we are looking to take the CGF's value proposition which includes inclusivity, diversity, sustainability and make it about a movement.\" TRIMMED BUDGET Diversity, inclusion and private funding are buzz words that perk up government ears, particularly when it comes to spending taxpayer money. Originally the Hamilton100 bid proposed an operating budget of around $1.5 billion (CDN). But that has been trimmed to around $1 billion, about the same cost of the Birmingham Games with, according to Frapporti, the private sector kicking in between $250 to $500 million. \"What differentiates the Games framework at this point is a very significant amount of private sector investment around the delivery of infrastructure assets,\" said Frapporti. The biggest infrastructure project in the Hamilton bid would be the construction of an athletes village, which under current plans would be privately delivered. The private sector would also be responsible for renovating the FirstOntario Centre in downtown Hamilton and contribute to the building of a state-of-the-art cricket facility. Otherwise, the bid leans heavily on existing facilities across what is known as the 'Golden Horseshoe' such as the velodrome in nearby Milton built for the 2015 Pan Am Games. The bid will also make use of one of the world's natural wonders with Niagara Falls providing the backdrop for beach volleyball. \"To the extent the Commonwealth Games aspires to be the 'Olympics light' there is no path to success doing that,\" said Frapporti. \"What we sought to do is embrace those values and opportunities which actually truly differentiate the sport so very much around inclusivity.\" (Reporting by Steve Keating in Birmingham. Editing by Christian Radnedge)","pubDate":"2022-08-08 13:05:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/08/1689699.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Urgent NRL plea as 'bad memories' probed","link":"https://wwos.nine.com.au/nrl/2022-ricky-stuart-punishment-press-conference-comments-raiders-panthers-jaeman-salmon-phil-gould/c5ca8865-3bf0-455e-8d0f-53e321a22d7f","keywords":null,"creator":["wwos"],"video_url":null,"description":"Phil Gould has made a desperate plea as tension between Ricky Stuart and young Panther Jaeman Salmon festers.","content":"Phil Gould says it's natural for people to be inquisitive about the motivation behind Ricky Stuart's startling \"weak-gutted dog person\" takedown of young Panther Jaeman Salmon. But the rugby league icon has implored for the history behind the verbal assault to remain private, insisting \"it's not going to be healthy\". The NRL is set to deal Stuart a punishment — likely a two-game ban, according to Nine's Danny Weidler — after the Raiders coach attacked Salmon in an explosive post-match press conference on Saturday. READ MORE: Stuart offered time off as likely ban revealed READ MORE: 'Emotional' Kyrgios ends three-year title drought READ MORE: Aussies claim cricket gold despite positive COVID-19 test When Stuart was asked about an incident involving Salmon in the Raiders' loss to the Panthers, in which the five-eighth kicked Tom Starling in the groin, the veteran coach unloaded. It's since been revealed that Stuart remains incensed by an incident during a 2010 junior rugby league match, in which Salmon and Stuart's son were playing. Weidler believes the icy history between Stuart and Salmon extends beyond that match. But Gould stressed on Nine's 100% Footy that the sensitive past must remain a secret. 100% Footy is now available as a podcast! Subscribe/follow via Apple , Spotify or Google Podcasts . \"Naturally, people will be curious now as to what motivated it and why Ricky snapped the way he did — and he did snap,\" Gould said. \"He said (to me), 'I didn't know that was going to come out at all'. It wasn't pre-meditated, but the sheer mention of his name brought back bad memories and all of a sudden the words were out before he could take them back. \"I am way too close to this situation to be making comment publicly about it. \"Whatever the decision of the NRL, naturally people and the media are going to be very curious as to what motivated it, what was the history. Everyone's going to try to delve for that story. \"And let me tell you: that's not going to do anyone any good whatsoever. \"So, I would hope that with the NRL decision ... for which Ricky is quite ready and prepared for whatever decision comes — I would like to think that is the end of it and no one else opens their mouth.\" Stream the NRL premiership 2022 live and free on 9Now . Cameron Smith, who was coached by Stuart in the Kangaroos set-up, agreed with Gould. \"Private matters should stay private, anyway, shouldn't they?\" the Storm legend said on 100% Footy . \"Don't you think? It's separate to rugby league.\" Smith also said he was \"shocked\" by Stuart's comments and the Canberra mentor had \"crossed the line\". \"It's not going to be healthy for anyone for that history, which was a while ago, to be coming out now and people wanting to delve into that and read into things that shouldn't be there, and it's not going to be good for the people that are involved,\" Gould added. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-08-08 13:04:30","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/08/446724/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"BCCI disallows Bengal from playing Global T20 Namibia","link":"https://sportstar.thehindu.com/cricket/indian/bcci-bengal-global-t20-namibia-no-objection-certificate/article65746439.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"The Cricket Association of Bengal formally sought a No Objection Certificate from the BCCI to participate in the T20 league, but the request was declined.","content":"The Board of Control for Cricket in India (BCCI) has declined the Cricket Association of Bengal’s request to allow its senior men’s team to feature in the Global T20 Namibia in September. The CAB had announced a squad for the tournament, with Abhimanyu Easwaran leading the team. As a policy, the BCCI does not allow any of its teams or players to feature in overseas franchise T20 leagues. However, this being a league organised by an associate member nation - Cricket Namibia - and with no franchise or ownership involved, the CAB officials had formally sought a No Objection Certificate from the BCCI hoping that it would allow for players’ participation in the tournament. However, in its communication to the CAB, the Board has clarified that it will not allow the players to feature in the T20 tournament. Following the BCCI’s diktat, the CAB has informed the management company which was liaisoning on behalf of Cricket Namibia that it would not be possible for them to field a team. While Cricket Namibia officials were unavailable for comment at the time of publishing the story, it is understood that it has decided to go ahead with the tournament with the remaining two teams. The Namibia national team will be the only international side featuring in the tournament. As far as overseas participation is concerned, Cricket South Africa domestic franchise Momentum Multiply Titans and Pakistan Super League franchise Lahore Qalandars have agreed “in principle” to participate. If things fall in place, the teams are expected to reach Namibia by the fourth week of August. The nine-day tournament will be a curtain raiser for the Namibian national team ahead of its CWC League 2 ODI Tri-series in Papua New Guinea in September. The team will travel to Australia in October for the T20 World Cup and the organisers feel that this four-team tournament will help the Namibian team get enough match practice and international exposure. For the Bengal team, too, it would have been a pre-season tour, but with the BCCI refusing to give a go-ahead, it has to look for a different option to get the players ready for the domestic season. Read more stories on India.","pubDate":"2022-08-08 12:50:29","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022 Live Score India vs Australia CWG 2022 Men's Hockey Gold Medal Match: IND Trail 0-7 Against AUS - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiwAFodHRwczovL3d3dy5uZXdzMTguY29tL25ld3Mvc3BvcnRzL2luZGlhLXZzLWF1c3RyYWxpYS1saXZlLXNjb3JlLWN3Zy0yMDIyLW1lbi1ob2NrZXktZ29sZC1tZWRhbC1maW5hbC1jb21tb253ZWFsdGgtZ2FtZXMtbGF0ZXN0LXVwZGF0ZXMtdG9kYXktbWF0Y2gtc3RyZWFtaW5nLW9ubGluZS13YXRjaC1saXZlbmV3cy01NzExOTgzLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"CWG 2022 Live Score India vs Australia CWG 2022 Men's Hockey Gold Medal Match: IND Trail 0-7 Against AUS  News18AUS Women beat IND Women AUS Women won by 9 runs - AUS Women vs IND Women, Commonwealth Games Women's Cricket Competition, Final Match Summary, Report  ESPNcricinfoHarmanpreet Kaur rues trend of mistakes in big finals after missing CWG gold medal  Times of India'Congratulations, But They Will Go Home Disappointed As...': BCCI President Sourav Ganguly's Message For th  News18Mooney: 'The belief in the Australia dressing room is at an unprecedented level'  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-08-08 12:49:41","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Australia Live Score, Hockey Final, Commonwealth Games 2022: Second half begins, India trails Australia 0-5 - Sportstar","link":"https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3Nwb3J0c3Rhci50aGVoaW5kdS5jb20vY29tbW9ud2VhbHRoLWdhbWVzL25ld3MvaW5kaWEtdnMtYXVzdHJhbGlhLWxpdmUtc2NvcmUtbWVucy1ob2NrZXktZmluYWwtY29tbW9ud2VhbHRoLWdhbWVzLTIwMjItaW5kLXZzLWF1cy1jd2ctbWF0Y2gtdXBkYXRlcy9hcnRpY2xlNjU3NDUyMDcuZWNl0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia Live Score, Hockey Final, Commonwealth Games 2022: Second half begins, India trails Australia 0-5  SportstarAUS Women beat IND Women AUS Women won by 9 runs - AUS Women vs IND Women, Commonwealth Games Women's Cricket Competition, Final Match Summary, Report  ESPNcricinfoCWG 2022: Gold goes to Aussies as India women choke in T20 final  Times of India'Congratulations, But They Will Go Home Disappointed As...': BCCI President Sourav Ganguly's Message For th  News18Rohit Sharma-led team India followed thrilling IND vs AUS CWG 2022 final closely in Florida  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-08-08 12:10:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Piers Morgan slams Australia’s Novak Djokovic ‘hypocrisy’ as cricketer is allowed to play WITH Covid","link":"https://www.thesun.co.uk/sport/19449436/australia-womens-cricket-covid-piers-morgan/","keywords":["Cricket","Sport","Commonwealth Games","Coronavirus"],"creator":["Jake Lambourne"],"video_url":null,"description":null,"content":"PIERS MORGAN has slammed Australia for being “hypocritical” after they fielded Covid-infected cricketer Tahlia McGrath in their Commonwealth Games final. The Aussies claimed the T20 gold medal at Edgbaston on Sunday after beating India by nine runs. AFPAustralian star Tahlia McGrath played against India despite testing positive for Covid[/caption] ReutersAustralia have been slammed for allowing McGrath to feature in their Commonwealth Games victory against India[/caption] But there has been controversy surrounding their victory after they allowed McGrath to feature, despite her testing positive for coronavirus prior to the game. If the final was held in Australia, then the 26-year-old wouldn’t have been able to play due to their strict Covid rules. But with England having more relaxed laws, the International Cricket Council and the Commonwealth Games Foundation cleared her to be involved. Fans believe that Australia were wrong to do so considering the fact they deported Novak Djokovic ahead of the Australian Open due to him not being vaccinated. READ MORE IN SPORT COR BLIMEY Australia slammed after fielding Covid positive player to win cricket Games gold PARTY STARTER Deposit a minimum of £10 and get 120 FREE SPINS on Starburst with PartyCasino Highlighting that point, Piers Morgan tweeted: “Given what happened with Djokovic in Australia, this is a shockingly bad & hypocritical decision.” And many of his 7.9 million followers agreed with him, as one replied: “Which is exactly why the Djokovic debacle was so ridiculous. As if this was never going to be the reality moving forward.” Another messaged: “Textbook example of hypocrisy and double standards.” A third added: “Yep! Hypocrisy at it’s finest.” latest commonwealth games news MOR DRAMA Morgan slams Australia’s ‘hypocrisy’ as cricketer is allowed to play WITH Covid COR BLIMEY Australia slammed after fielding Covid positive player to win cricket Games gold OUT OF PITCH Coventry vs Rotherham POSTPONED after Commonwealth Games rugby sevens matches PITCH PROBLEMS Coventry clash with Rotherham in HUGE doubt over pitch safety fears BALLIN' Ward-Hibbert says England on path to becoming 'great basketball nation' CRYING GAME First Dates' Fred Sirieix fights back tears as daughter WINS Commonwealth gold This person then said: “So glad even the most vocal are noticing the double standards now!” Meanwhile one simply stated: “Australia have a ‘win at all costs’ mentality. Kind of respect it.” Another remarked: “”So Australia can deny [Novak] Djokovic from playing in the Australian Open for not being vaccinated but will allow a Covid +ve [sic] person to play a cricket match?” In bizarre scenes, McGrath did not line up alongside her team-mates for Australia’s national anthem, while she had to sit in the stands wearing a mask during their batting. Though she batted at No4 without a mask, where she scored two runs off four balls before bowling two overs, while she also took a catch in the fourth over. But despite warning her team-mates not to celebrate with her after taking the wicket, she joined in on the jubilant scenes after Australia were crowned Commonwealth champions. She then returned to wearing a mask while standing on the podium to receive her medal.","pubDate":"2022-08-08 11:59:56","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"}]}