{"newsArray":[{"title":"Warner poised to snub BBL for UAE riches","link":"https://www.cairnspost.com.au/sport/cricket/bbl-cricket-news-david-warner-set-to-snub-big-bash-league-join-rival-uae-t20-competition/news-story/8799da8583c79e5dc18ec674cc859228","keywords":["Big Bash News","Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian cricket is at a crossroad with David Warner requesting to play in the UAE T20 league this January at the height of the traditional summer.","content":null,"pubDate":"2022-07-26 23:48:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Nothing is impossible’: Romanian cult hero nominates for BBL Draft","link":"https://www.foxsports.com.au/cricket/domestic-cricket/big-bash/cricket-australia-2022-bbl-draft-news-pavel-florin-nominates-to-join-big-bash-league-romania-cricket-video/news-story/85a6e33353963237efed75008f51edb8","keywords":null,"creator":null,"video_url":null,"description":"Romanian cricket cult hero Pavel Florin is once again daring to dream after he nominated himself for the inaugural BBL Draft.","content":"Romanian cricket cult hero Pavel Florin is once again daring to dream after he nominated himself for the inaugural BBL Draft . The 43-year-old became an internet sensation three years ago when footage of his quirky bowling action while playing cricket in Romania went viral. The nightclub bouncer was suddenly meeting Shane Warne and Brian Lara at Lord’s, and was invited into the commentary box. BBL Draft picks revealed as lottery serves up brutal twist for Ponting’s crew Watch South Africa’s Tour of England. Every ODI & T20 Live & On-Demand on Kayo. New to Kayo? Start your free trial now > Florin insists “nothing is impossible” — and is aiming high by throwing his hat in the ring to play in the BBL. And while Florin is extremely unlikely to be picked up by any club as a player, he could yet play a role during this summer’s BBL season, The Daily Telegraph reports. The publication understands that Cricket Australia is considering brining Florin to Australia in an ambassadorial role, while it also reports that Cricket NSW believes he could be a good promotional tool. BBL boss Alistair Dobson told the publication: “I was pretty excited to see Pavel’s email land in my inbox. “Pavel said he was inspired by a love of the game and to show everyone that regardless of their abilities, that they can believe in their chance. “We’d love to get him involved in the BBL somehow this summer if we can.” As of last week, almost 200 players had nominated for the BBL Draft, in which clubs will pick a minimum of two, and a maximum of three overseas players. The draft will take place on August 28, and will be broadcast on Fox Cricket, available on Foxtel and Kayo Sports.","pubDate":"2022-07-26 22:30:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pavel Florin nominates for Big Bash Draft","link":"https://www.cairnspost.com.au/sport/cricket/pavel-florin-nominates-for-big-bash-draft/video/88ba10ba8017fb03a1670ffd72a3f005","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Romanian cult hero Pavel Florin is set to nominate for the Big Bash Draft after setting the cricket world alight with his unusual bowling technique.","content":null,"pubDate":"2022-07-26 22:18:18","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"$20M renovations coming for Major League Cricket stadium in North Texas","link":"https://www.wfaa.com/article/sports/grand-prairie-major-league-cricket/287-8d0cd0cc-b9e3-4325-a91d-d317268e4c57","keywords":["sports","home"],"creator":null,"video_url":null,"description":"The stadium will play host to MLC’s Texas franchise and is set to open in spring 2023.","content":"GRAND PRAIRIE, Texas — Editor's note: The video published above is a WFAA story from 2021 about cricket's popularity growing in Collin County. Major League Cricket (MLC) is coming to North Texas, and work on the Lone Star State team's $20 million renovated stadium has begun. Yep, you read that correctly! The league announced the timeline of completion for Grand Prairie Stadium, which will play host to MLC's Texas franchise. The stadium is using $20 million to convert the baseball diamond, formerly the home of the Texas AirHogs, into a cricket field with a natural grass turf wicket. \"I am excited to see the vision of bringing Major League Cricket to the US and to North Texas is beginning with the construction of the Grand Prairie Stadium,\" said Anurag Jain, Managing Partner of Perot Jain, LP and Chairman of Access Healthcare. \"What has been a grassroots sport with tremendous support, will now have a home stadium with world-class professional matches for many fans to watch. It will be exciting to watch a tremendous rise in interest for the game among North Texas sports fans once the stadium opens.\" Here is a rendering of what the new stadium is expected to look like, courtesy of Major League Cricket and the city of Grand Prairie: According to HKS, the Dallas-based project architect, the newly-converted stadium will feature 1,000 club and premium seats, with the ability to expand to a capacity of over 15,000 for major events. HKS is also known for designing other marquee venues including AT&T Stadium in Arlington and SoFi Stadium in Los Angeles. Some of the improvements now underway include: refurbishment and enhancement of the stadium’s 13 luxury suites and Hall of Fame and Officer Club Rooms, installation of premium seating experiences around the field, and a renovation and reopening of the stadium’s sports bar facility. 🚧 WORK HAS BEGUN IN GRAND PRAIRIE, TEXAS 🚧 We are excited to announce phase 1️⃣ of the $20M conversion began this week 🏗️ Set to open spring of 2023, our flagship MLC stadium will be the most extensive cricket facility in the USA 🏟️ 🇺🇸 Full story ➡️ https://t.co/SePAhQ4c3e pic.twitter.com/thXCZUd0QO MLC said in a release that training nets, batting lanes, two additional outside turf fields and further enhancements to the venue will be made in subsequent renovation phases. The Texas team's identity and launch plans will be announced later in 2022, according to league officials. More Texas sports coverage:","pubDate":"2022-07-26 19:43:51","image_url":"https://media.tegna-media.com/assets/WFAA/images/ef81d498-e973-425e-81c2-f7bf00375373/ef81d498-e973-425e-81c2-f7bf00375373_750x422.jpg","source_id":"wfaa","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"India vs West Indies, 3rd ODI: With clean sweep on mind, Team India might not tinker too much with batting line-up","link":"https://kashmirreader.com/2022/07/27/india-vs-west-indies-3rd-odi-with-clean-sweep-on-mind-team-india-might-not-tinker-too-much-with-batting-line-up/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"PORT OF SPAIN: A ruthless Indian team is unlikely to take its foot off the pedal as it aims to top up a world-record winning feat with another clean sweep against the West Indies on Wednesday. India created a world record on Sunday by sealing their 12th consecutive series win in the ODI format against […]","content":"PORT OF SPAIN: A ruthless Indian team is unlikely to take its foot off the pedal as it aims to top up a world-record winning feat with another clean sweep against the West Indies on Wednesday. India created a world record on Sunday by sealing their 12th consecutive series win in the ODI format against the West Indies — the most against a team. In this backdrop, head coach Rahul Dravid might be tempted to try out some of his reserve players but he will have to maintain a fine balance between keeping the momentum and testing his bench strength. In the batting department, it is unlikely that Ruturaj Gaikwad would be preferred over Shubman Gill, who after two innings of 64 and 43 would not like to sit out. Gaikwad had got a full South Africa series where he looked distinctly uncomfortable against quality pace. While his IPL credentials have kept him in the mix, chances of Indian cricket establishment investing in him on short term basis look dim. Shreyas Iyer and Sanju Samson have also hit the straps with fifties in last game and Suryakumar Yadav is not expected to cool his heels at the expense of Ishan Kishan despite his twin failures in the first two games. Kishan is seen as a timer of the ball who can use the Powerplay overs well by hitting over the in-field. He isn’t a power hitter who can force the pace after 35th over and hence Samson is a better option despite him being a left hander. Ravindra Jadeja as the designated vice-captain was the first choice all-rounder in this series before he was ruled out of the first two games due to a knee niggle. It is still not certain whether Jadeja will be available for the final game as Axar Patel after his match-winning knock of 64 in the second game could feel hard done by. However if Dhawan wants two play two left-arm spinners, then Yuzvendra Chahal could be asked to rest but that will be at the cost of sacrificing variety in bowling attack. Arshdeep Singh had a groin issue during the England ODIs but since he is a left arm seam bowler, he could be tried out in place of Avesh Khan, who was a tad expensive in the second ODI. He leaked 54 runs in his six wicket-less overs. Avesh and Prasidh Krishna have a similar type of hit the deck bowling style, getting deliveries to rear up from back of length or good length. It only warrants that one among the two should start in the eleven. As far as West Indies is concerned, they have capable players but as a unit, they have failed to fire. They depend too much on individual brilliance of Shai Hope, Nicholas Pooran, Rovman Powell or Romario Shepherd. More importantly, the team hasn’t shown resilience to win important moments that can impact the outcome of the match. West Indies could do well to use the experience of Jason Holder in the final game of the series. The hosts would aim to put an end to their losing streak in ODIs, which has now stretched to eight matches, including a 0-3 loss to Bangladesh in the preceding rubber. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-07-26 18:52:34","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Border’s advice for Head: Improve against spin to emulate Hayden’s success during ’01 India tour","link":"https://kashmirreader.com/2022/07/27/borders-advice-for-head-improve-against-spin-to-emulate-haydens-success-during-01-india-tour/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"MELBOURNE: Former captain Allan Border has advised southpaw Travis Head to improve his technique against spinners if he wants to replicate Matthew Hayden’s success when Australia tour India for four-Test series next year. Head was named as the ‘Player of the Series’ during the last Ashes but his form drastically dipped in sub-continental conditions (against […]","content":"MELBOURNE: Former captain Allan Border has advised southpaw Travis Head to improve his technique against spinners if he wants to replicate Matthew Hayden’s success when Australia tour India for four-Test series next year. Head was named as the ‘Player of the Series’ during the last Ashes but his form drastically dipped in sub-continental conditions (against Pakistan and Sri Lanka) where he managed to aggregate only 91 runs with the highest score of 26. “He’s (Head) got to sit down and work out a method better than it’s going at the moment, that’s for sure,” Border was quoted as saying in cricket.com.au. Border said that he has spoken to Head about batting on wickets which are spinning. “I have talked to him (Head) a little bit about batting on spinning wickets. He’s got to learn how to sweep and sweep well. And he’s got to use his feet, people don’t seem to be prepared to go down the track and defend, even,” added Border, who has 11,174 Test runs to his name. “We are going to sub-continent a lot, so if he wants to be in the frame, he needs to learn how to play the turning ball,” said Border and cited the example of Hayden. “Hayden’s a great example,” quipped Border. “There’s just few subtle things. He’s a very good player against anything other than the turning ball. That’s the chink he’s got to work on, but it’s (play the) sweep shot, use your feet, get on the front foot and when you are trying to defend, use nice soft hands,” was Border’s suggestion for Head, who has played 28 Tests. Hayden had a superb campaign in India in 2001 where he scored 549 runs, including two hundreds and a double hundred. Australia is set to tour India next year for a four-Test series. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-07-26 18:51:38","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-India to host 2025 women&#039;s 50-over World Cup","link":"https://www.thestar.com.my/sport/cricket/2022/07/27/cricket-india-to-host-2025-women039s-50-over-world-cup","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India will host the 2025 women's 50-over World Cup, while Bangladesh and England will stage Twenty20 World Cups in 2024 and 2026, respectively, the International Cricket Council (ICC) said on Tuesday. Read full story","content":null,"pubDate":"2022-07-26 17:49:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/27/1673828.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Paddy Upton joins Indian cricket team's support staff as mental conditioning coach","link":"https://www.dnaindia.com/cricket/report-paddy-upton-joins-indian-cricket-team-support-staff-as-mental-conditioning-coach-2971732","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Paddy Upton has joined India`s support staff under head coach Rahul Dravid in the West Indies as the mental conditioning coach.","content":null,"pubDate":"2022-07-26 17:49:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's cricket gets run of global events","link":"https://www.perthnow.com.au/sport/cricket/womens-cricket-gets-run-of-global-events-c-7654414","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Bangladesh, India, England and Sri Lanka have been awarded hosting rights for major events as the women's international cricket calendar 2024-27 was determined.","content":null,"pubDate":"2022-07-26 17:48:38","image_url":"https://images.perthnow.com.au/publication/C-7654414/cfb41ecb05b1ef358f9e45bdfde7aaf7dcd605a9-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"County Ground Bristol pitch report 1st T20I: ENG vs SA T20 pitch report today match Bristol","link":"https://thesportsrush.com/cricket-news-county-ground-bristol-pitch-report-1st-t20i-eng-vs-sa-t20-pitch-report-today-match-bristol/","keywords":["Cricket","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"County Ground Bristol pitch report 1st T20I: The first of the three-match T20I series between South Africa and England starts tomorrow. After some riveting action during the first two ODIs, the final ODI between South Africa and England at Leeds had to be unfortunately called-off due to rain, with the series ending in a stalemate.… The post County Ground Bristol pitch report 1st T20I: ENG vs SA T20 pitch report today match Bristol appeared first on The SportsRush.","content":"County Ground Bristol pitch report 1st T20I: The first of the three-match T20I series between South Africa and England starts tomorrow. After some riveting action during the first two ODIs, the final ODI between South Africa and England at Leeds had to be unfortunately called-off due to rain, with the series ending in a stalemate. The Proteas now gear themselves up for some promising high-octane T20Is, with the first of the three-match series set to take place at the County Ground in Bristol today. South Africa would be led by their experienced campaigner in David Miller, with their regular skipper Temba Bavuma ruled out due to injury. Eyes would also be on Rilee Rossouw, who is likely to feature in the playing XI tomorrow, after tasting decent success during the various T20 leagues around the world including the PSL, BPL, and most recently the T20 Blast, where he finished as the second-highest run-scorer in the season. As for England, their new skipper Jos Buttler has faced back to back home ODI and T20I series defeats against India, followed by a draw against South Africa a couple of days ago. Having won the last three series against the Proteas in the format, he would like to continue with the streak and register a maiden series victory under his full-time leadership. Training was a lot of fun today Go behind the scenes and take a closer look #ENGvSA — England Cricket (@englandcricket) July 26, 2022 County Ground Bristol pitch report 1st T20I The venue is set to host only its fourth T20I tomorrow, with the last one having taken place in July 2018. As for this year’s recently concluded T20 Blast, the average first innings total at this venue sat at 171, which perhaps suggests that the batters are likely to enjoy their time out there in the middle today. Moreover, the shorter square and straight boundaries at the County ground further aids the big hitters present in both the sides. As for the bowlers, the pacers are likely to get some assistance with the new ball, but would have to make ample use of their variations while taking the pace off the ball during the latter half of the innings, to taste success at this venue. All in all, expect a high-scoring clash between the two batting-heavy sides today at Bristol. The post County Ground Bristol pitch report 1st T20I: ENG vs SA T20 pitch report today match Bristol appeared first on The SportsRush.","pubDate":"2022-07-26 17:31:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India to host 2025 Women's ODI World Cup, FTP for next 5 years finalised","link":"https://timesofindia.indiatimes.com/sports/cricket/news/icc-meet-bcci-to-host-2025-womens-odi-world-cup-ftp-for-next-five-years-finalised/articleshow/93144951.cms","keywords":null,"creator":null,"video_url":null,"description":"India will host the Women's 50-over World Cup in 2025 as the BCCI has successfully bid for the mega event during the ICC Annual Conference that concluded in Birmingham on Tuesday. The ICC flagship event will return to the country after more than a decade. The last big mega women's global cricket event held in India was the 2016 World T20. The inaugural T20 Champions Trophy in 2027 will be hosted by Sri Lanka.","content":"NEW DELHI: India will host the Women's 50-over World Cup in 2025 as the BCCI has successfully bid for the mega event during the ICC Annual Conference that concluded in Birmingham on Tuesday. The ICC flagship event will return to the country after more than a decade. The last time a women's 50-over World Cup was held in India was back in 2013 when Australian emerged champions after beating the West Indies by 114 runs in the final in Mumbai. Three other ICC women's events were also awarded on the day with Bangladesh hosting the 2024 T20 World Cup and England winning hosting rights for the 2026 edition. The inaugural T20 Champions Trophy in 2027 will be hosted by Sri Lanka. The last big mega women's global cricket event held in India was the 2016 World T20 but that was primarily because ICC used to organise both men's and women's event simultaneously. However, the system has changed with popularity of women's game increasing exponentially and ICC has segregated the events to procure the proper value for women's game with separate broadcast deal and exclusive coverage. \"We were keen on hosting the ICC Women's Cricket World Cup 2025 and we are glad we have won the hosting rights for this marquee clash on the women's calendar,\" BCCI president Sourav Ganguly was quoted as saying in an ICC release. \"The sport has undergone tremendous transformation since then. The popularity of women's cricket is rapidly rising, and this is a step in the right direction. The BCCI will work closely with the ICC and fulfil all the requirements.\" BCCI secretary Jay Shah said: \"We are taking several steps to raise the profile of the sport right from the grassroots level and hosting the World Cup will further boost the popularity of the sport in the country. \"The BCCI remains committed to women's cricket in India. We have the infrastructure in place, and I am confident we will have a very successful edition of the World Cup.\" The 50 over Women's World Cup, however, has been a stand-alone event since its inception in 1973, two years before the men's mega event started in England in 1975. India have hosted the event thrice -- in 1978, 1997 and 2013. Those in the know of things in the ICC felt that it was prudent call by the BCCI if they are bidding for the 2025 ODI event. \"Since BCCI is bullish about starting the Women's IPL from next season, I think they wouldn't like to hold any other marquee T20 women's event right away. Hence the decision to bid for the 2025 World Cup seems logical,\" the source said. In the 2025 Women's World Cup, the hosts and five top nations from ICC Women's Championship (IWC) 2022-2025 will get direct entry into the tournament. The remaining two teams will be identified through a global Qualifier comprising six teams. Out of six teams in the Qualifier, four will be from the IWC (rankings after top five teams) and the other two will be selected according to the ICC Women's ODI Team Rankings. Other Key Decisions ICC Board Finalises FTP The ICC Board approved both the men's and women's Future Tours Programme (FTP) from 2023 to 2027 and these will be published in the coming days. It is learnt that India will play 38 Tests during the said period. Laxman in ICC cricket Committee India great and current head of National cricket Academy VVS Laxman has been appointed to the ICC Men's Cricket Committee as current player representative alongside former New Zealand skipper Daniel Vettori. Roger Harper has been selected as the second past player representative on the committee joining Mahela Jayawardene. New ICC Chairman to be elected in November The Board approved the process to elect the next Chair of the ICC which will take place in November 2022. The election will be decided by a simple majority unlike earlier years when two-third majority was a must. The term of the elected Chair will run for a two-year period from December 1 2022 to November 30, 2024. BCCI president Sourav Ganguly and secretary Jay Shah are expected to play a big role in deciding who would replace New Zealand's Gregor Barclay. Cambodia, Ivory Coast, Uzbekistan are new ICC Associate Members The growth of global cricket is being celebrated as the ICC welcomed its newest Members with Cambodia, Cote D'Ivoire and Uzbekistan all receiving Associate Membership status. Cambodia and Uzbekistan are the 24th and 25th Members of the Asia region, whilst Cote D'Ivoire is Africa's 21st Member, with the ICC now comprising 108 Members in total, including 96 Associates.","pubDate":"2022-07-26 17:21:28","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC approves process to elect next chairman in November; Laxman, Vettori in cricket committee","link":"https://sportstar.thehindu.com/cricket/icc-chairman-election-ganguly-in-contention-laxman-vettori-in-cricket-committee/article65687229.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"With Barclay’s term ending, there is strong speculation that Sourav Ganguly could be the next chair of the ICC but sources in the BCCI indicated that “it’s too early” to come to any conclusion.","content":"The International Cricket Council (ICC) Board approved the process to elect the next chairman of the world body in November. After the meeting in Birmingham, it was decided that with Greg Barclay ending his tenure this year, the election will be decided by a simple majority and the term of the Chair will be for a two-year period between December 1, 2022, to November 30, 2024. The ICC Board has decided that a two-thirds majority is no longer required to be elected as the chairman. According to the latest recommendations, the contestant bagging 51 per cent votes will be elected as the winner. In a 16-member board, the candidate needs just nine votes from the directors to get elected. With Barclay’s term ending, there is strong speculation that Sourav Ganguly could emerge as the next chair of the ICC as several countries may back him, however, sources in the Board of Control for Cricket in India (BCCI) indicated that “it’s too early” to come to any conclusion. A lot will depend on the verdict by the Supreme Court on the cooling-off period of the BCCI president and the secretary. The bench headed by Chief Justice N.V. Ramana is scheduled to hear the matter on Thursday and the Board insiders feel that depending on the Supreme Court’s verdict, Ganguly’s future could be decided. Laxman, Vettori in ICC cricket committee Former India international and the current National Cricket Academy chief VVS Laxman and former New Zealand captain Daniel Vettori have been appointed to the ICC Men’s Cricket Committee as current player representatives. West Indies’ Roger Harper has been selected as the second past player representative on the committee joining Sri Lanka’s Mahela Jayawardene. Newest members In the meeting, the ICC awarded associate membership status to Cambodia, Cote D’Ivoire and Uzbekistan. Cambodia and Uzbekistan are the 24th and 25th Members of the Asia region, while Cote D’Ivoire is Africa’s 21st Member, with the ICC now comprising 108 Members in total, including 96 Associates. However, Ukraine’s application for ICC Membership is deferred until cricket activity is able to safely resume within the country and it can demonstrate that it satisfies 2.2(b)(ii) and 2.2(c)(iii) of the Membership Criteria. The ICC continues to support the Ukraine Cricket Federation through this process. Following Russia’s suspension at the 2021 AGM due to continued non-compliance since July 2019 with ICC Membership Criteria 2.2(a)(i), 2.2(b)(i) and 2.2(b)(ii) and after failing to resolve the issues and demonstrate compliance following suspension, Cricket Russia has now had its Membership of the ICC terminated. Focus on Afghanistan The ICC Board received an update from the Afghanistan Working Group, and the Afghanistan Cricket Board representatives provided an update on the situation relating to women’s cricket in Afghanistan. ICC representatives will be seeking to meet with Afghanistan Cricket Board and government officials to discuss the matter further in coming weeks. Read more stories on Cricket.","pubDate":"2022-07-26 17:18:09","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"VVS Laxman, Daniel Vettori Appointed To ICC Men's Cricket Committee","link":"https://sports.ndtv.com/cricket/vvs-laxman-daniel-vettori-appointed-to-icc-mens-cricket-committee-3196542","keywords":null,"creator":null,"video_url":null,"description":"The International Cricket Council (ICC) on Tuesday confirmed the appointment of former cricketers VVS Laxman andDaniel Vettori to the ICC Mens Cricket Committee","content":"The International Cricket Council (ICC) on Tuesday confirmed the appointment of former cricketers VVS Laxman and Daniel Vettori to the ICC Men's Cricket Committee as current player representatives. \" Roger Harper has been selected as the second past player representative on the committee joining Mahela Jayawardene ,\" stated an official ICC media release. The ICC Board also received an update from the Afghanistan Working Group, and the Afghanistan Cricket Board representatives provided an update on the situation relating to women's cricket in Afghanistan. ICC representatives will be seeking to meet with Afghanistan Cricket Board and government officials to discuss the matter further in the coming weeks. The growth of global cricket is being celebrated as the ICC welcomed its newest Members with Cambodia, Cote D'Ivoire and Uzbekistan all receiving Associate Membership status. Cambodia and Uzbekistan are the 24th and 25th Members of the Asia region, whilst Cote D'Ivoire is Africa's 21st Member, with the ICC now comprising 108 Members in total, including 96 Associates. \"In addition, Ukraine's application for ICC Membership is deferred until cricket activity is able to safely resume within the country and it can demonstrate that it satisfies 2.2(b)(ii) and 2.2(c)(iii) of the Membership Criteria. The ICC continues to support the Ukraine Cricket Federation through this process,\" stated an official statement. Promoted Following Russia's suspension at the 2021 AGM due to continued non-compliance since July 2019 with ICC Membership Criteria 2.2(a)(i), 2.2(b)(i) and 2.2(b)(ii) and after failing to resolve the issues and demonstrate compliance following suspension, Cricket Russia has now had its Membership of the ICC terminated.","pubDate":"2022-07-26 17:04:46","image_url":"https://c.ndtvimg.com/2022-05/6gfp51ng_vvs-laxman-bcciipl_625x300_27_May_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Commonwealth Games 2022: 10 things to watch out for in Birmingham | Tumaini Carayol","link":"https://www.theguardian.com/sport/2022/jul/26/commonwealth-games-2022-10-things-to-watch-out-for-in-birmingham","keywords":["Commonwealth Games 2022","Adam Peaty","Laura Kenny","Athletics","Swimming","Cycling","Gymnastics","Netball","Women's cricket","esports","Triathlon","Commonwealth Games","Cricket","Sport"],"creator":["Tumaini Carayol in Birmingham"],"video_url":null,"description":"Elite Jamaican sprinters, a swimming sensation returns and a chance to make cricket history as the Games begins this weekThe world championships has only recently finished in the US, yet a hectic summer continues for some of the top athletes in the world. Shelly-Ann Fraser-Pryce, Elaine Thompson-Herah and Shericka Jackson – the three faces of sprinting so far this year – are all expected to compete in Birmingham. Dina Asher-Smith, a 200m bronze medallist and a member of the 4x100m relay gold medal-winning team in 2018, will naturally be the focal point if she is fully fit after pulling up during the 4x100m in Oregon. While Katarina Johnson-Thompson will look to inch back to top form, athletes such as Jake Wightman, Keely Hodgkinson and Laura Muir will be aiming to consolidate their successes. Continue reading...","content":null,"pubDate":"2022-07-26 16:47:01","image_url":"https://i.guim.co.uk/img/media/242fd3ee546522f5fce6aea24b4deae28e6b7fdd/0_308_6580_3949/master/6580.jpg?width=460&quality=85&auto=format&fit=max&s=83578125e216ba52cc6f80f495613550","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Ricky Ponting picks his finalists for the upcoming T20I Cricket World Cup 2022, says Australia will win the trophy","link":"https://www.dnaindia.com/cricket/report-ricky-ponting-picks-his-finalists-for-the-upcoming-t20i-cricket-world-cup-2022-2971721","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Former Australian captain Ricky Ponting feels that India and hosts Australia will play in the final of the ICC Men`s T20 World Cup later this year.","content":null,"pubDate":"2022-07-26 16:41:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India and Australia will be T20 World Cup 2022 finalists, opines Ricky Ponting","link":"https://www.tribuneindia.com/news/sports/india-and-australia-will-be-t20-world-cup-2022-finalists-opines-ricky-ponting-415939","keywords":null,"creator":null,"video_url":null,"description":"Melbourne, July 26 Legendary Australian batter and skipper Ricky Ponting feels that India and Australia will be the finalists in the upcoming T20 World Cup and the latter will beat the Men in Blue in the final. ICC World T20 will take place in Australia later this year. Ponting has been around a lot of T20 cricket in recent times, having spent time as assistant of the Australian team under Justin Langer, being the head coach of Delhi Capitals in the Indian Premier League (IPL) and doing commentary during Big Bash League games. \"I think India and Australia will be the two playing in the final and I will just have to say that Australia will beat them in the final,\" Ponting said on the latest edition of ICC Review. \"The reigning champions have got home conditions and that was one thing that made Australia's win in the last World Cup, not remarkable, but that little bit sweeter for them. The fact that a lot of people, me included, thought when they went to UAE, the conditions that they were going to have to face on the back of the IPL, I thought the conditions might have been the thing that might not have allowed them to win it. But they found a way,\" he added. He also gave his thoughts on the England cricket team. He is impressed by its recent appointed Test head coach Brendon McCullum and his performance in the recently concluded Test series with New Zealand at home. Ponting is also aware of the greatness of England's new white-ball coach Matthew Mott because of his superb record with Australian women's team as its coach. \"I actually think England are an outstanding white-ball team and they have an outstanding white-ball setup. I just think the three teams on paper that look to have most class and the most match-winners are India, Australia and England,\" he said. The Aussie legend does not really agree with Pakistan bowling legend Waqar Younis on the chances of the Asian side clinching their second T20I World Cup title. He acknowledges the greatness of star pacer Shaheen Afridi and Mohammad Rizwan, but feels that the batting relies too much on the world number 1 batter and skipper Babar Azam. \"If Babar does not have a great tournament, I do not think they can win. I saw him up close and personal a couple of years ago out here in a Test series against Australia and I said it then, I thought the sky was the limit for this guy as far as Test match batting (was concerned) and, if anything, he has probably got better and better in the last couple of years. Their openers are very important and their new-ball bowlers are very important, but that role of the spin bowler in Australia might be a little bit more difficult with wickets that probably won't give them assistance,\" he said. On chances of other teams at least making it to the finals, he said, \"I know the game too well and any of New Zealand, Pakistan or West Indies even - we know how they tend to love playing this game and they are probably most suited to the T20 format. It would not surprise me if any of those sides find their way through to the final.\" ANI","content":null,"pubDate":"2022-07-26 16:37:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_2091946283.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"What do Laxmi Ratan Shukla and WV Raman’s appointments mean for Bengal cricket?","link":"https://sportstar.thehindu.com/cricket/domestic/bengal-cricket-team-appoints-laxmi-ratan-shukla-wv-raman-what-to-expect/article65687120.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Both Laxmi Ratan Shukla and WV Raman want to take things as they come and approach each and every situation with a positive mindset.","content":"The last time Bengal clinched the Vijay Hazare Trophy title in March 2012, it rode on a century by Laxmi Ratan Shukla to defeat a star-studded Mumbai in the final. While Shukla had an incredible outing in the tournament, the Sourav Ganguly-led Bengal team excelled in every department under the watchful eyes of coach WV Raman. It’s been a decade since and Bengal’s senior men’s team hasn’t been able to add another trophy in its cabinet. Over the last few years, Bengal came strikingly close to winning a Ranji Trophy title, but was outplayed by Saurashtra in the final in the 2019-20 season. In the just-concluded season, the team was knocked out of the Ranji Trophy semifinals after being defeated by Madhya Pradesh, which eventually went on to win the title. Ahead of the upcoming season, the Cricket Association of Bengal (CAB) has overhauled the coaching staff - bringing back Raman as the batting consultant, while Shukla will be the coach. Both Shukla and Raman, however, want to take things as they come. “We already had a great relationship and if he comes and assists the Bengal team with his vast experience, it will be really great,” Shukla told Sportstar about Raman’s appointment. Having worked with Raman in the past - in the Bengal team and in the Indian Premier League - Shukla understands what the former India women’s team head coach would bring to the table. “With WV Raman sir, it has always been a very sweet and positive equation. I always respect him as I learned so much from him, so obviously his presence will help a lot,” Shukla said. Raman will be stepping into the shoes of VVS Laxman - who was earlier the batting consultant for CAB’s Vision Programme - and the seasoned coach is looking forward to this stint. “We will have different things to do. As the coach of the team, LR (Shukla) will have to see things in a different way, whereas, me sticking to one function, I will have to approach a different aspect altogether,” Raman told this publication. “But then, it will also be a case of both working together because the team’s objective is important and to ensure that the boys do what is needed of them will be important…” Unlike Shukla, Raman will not travel with the team, rather his job will be to prepare the team for the overall season - something that Laxman would do during his stint. “The target will be to try and make the players realise what they need to do with the skillsets they have and within their framework of technique, how things can be done in all formats,” Raman said. And, both Raman and Shukla agree that coordination will be important. In his playing days, Shukla was known for his indomitable spirit on the field and as a coach he wants to imbibe that. “For the team, mental balance is very important. We need to be mature in our approach and improve our temperament. I can guide the team, but at the end of the day, I need to ensure that I improve that temperament,” Shukla, a former Bengal captain himself, said. “For instance, if a Virat Kohli is getting out in a particular area, then no coach can help him. He himself needs to find a way. People can come and advise, but ultimately the player will have to do things himself. Similarly, I believe that a coach can guide a player, but ultimately, it is up to the player to pick the brains of the coach, understand what he wants and implement those things accordingly. That’s what I want this team to do…” A domestic cricket stalwart for Bengal, Shukla has also played three ODIs for India and after retiring in 2015, Shukla entered politics and was a minister of state, youth affairs and sports, until January last year. During his stint as the Bengal captain, Shukla played with quite a few current players like Manoj Tiwary and Abhimanyu Easwaran and he believes that will help. “They have all played under me, so they know how I would manage the team and what I expect from all of them. So going forward, they know how LR Shukla operates and what he believes in and I hope that together, we can put up a good show,” the newly-appointed coach said. Just like his playing days, Shukla wants to play to his strengths and work together as a team alongside Raman and other support staff. Read more stories on Domestic.","pubDate":"2022-07-26 16:36:34","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs South Africa 1st T20I Live Telecast Channel name in India and UK: When and where to watch ENG vs SA Bristol T20I?","link":"https://thesportsrush.com/cricket-news-england-vs-south-africa-1st-t20i-live-telecast-channel-name-in-india-and-uk-when-and-where-to-watch-eng-vs-sa-bristol-t20i/","keywords":["Cricket","England","South Africa","South Africa tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"England vs South Africa 1st T20I Live Telecast: The SportsRush presents before you the timing and live streaming details of 1st ENG vs SA T20I. England and South Africa will be playing the first of their three imminent T20Is in Bristol tomorrow as the city will witness a T20I for the first time since 2018.… The post England vs South Africa 1st T20I Live Telecast Channel name in India and UK: When and where to watch ENG vs SA Bristol T20I? appeared first on The SportsRush.","content":"England vs South Africa 1st T20I Live Telecast: The SportsRush presents before you the timing and live streaming details of 1st ENG vs SA T20I. England and South Africa will be playing the first of their three imminent T20Is in Bristol tomorrow as the city will witness a T20I for the first time since 2018. While England have never won a T20I at the County Ground, South Africa have never played an international match here. Only the seventh bilateral T20I series (third in England) between these two teams, it will be played 20 months after the last one in South Africa. England, who had last hosted South Africa for a T20I series half-a-decade ago, haven’t lost a series against them since then. Having won three series in a row, England would be keen to extend their winning streak in what is going to be their last white-ball series of this summer. Meanwhile, South Africa would want to make the most of the hosts’ mediocre white-ball form this season to win their first-ever T20I series in England. In the past, the Proteas have won only one T20I series against this opposition. Jonny Bairstow lifting Sam Curran IG: reecejtopley pic.twitter.com/HwVH7l6wVr — England’s Barmy Army (@TheBarmyArmy) July 26, 2022 England vs South Africa 1st T20I Live Telecast Channel name in India and UK Sony Sports Network is televising South Africa’s tour of England 2022 in India. As was the case during the recently concluded three-match ODI series, Sony will have only an English commentary panel for the T20Is as well. Indians fans will be able to watch this series on Sony SIX. Online users in India can stream the series on Sony’s streaming application named Sony LIV. It is worth mentioning that fans no longer have the option of watching the match on Airtel Xstream app as Sony Network’s channels are no longer available on this platform. ALSO READ: England vs South Africa T20 head to head records As far as the local fans in UK are concerned, they will be able to watch Bristol T20I on their televisions by tuning in to the tried and tested Sky Sports Cricket. Back home, South African fans will be able to watch this series on SuperSport. Date – 27/07/2022 (Thursday). Match start Time – 06:30 PM (England) and 11:00 PM (India). TV Channel – Sony SIX (India), Sky Sports Cricket (UK) and SuperSport (South Africa). Online platform – Sony LIV (India) and Sky Sports app (UK). The post England vs South Africa 1st T20I Live Telecast Channel name in India and UK: When and where to watch ENG vs SA Bristol T20I? appeared first on The SportsRush.","pubDate":"2022-07-26 16:30:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Ahead of T20 World Cup, India bring back Paddy Upton as mental conditioning coach","link":"https://www.orissapost.com/ahead-of-t20-world-cup-india-bring-back-paddy-upton-as-mental-conditioning-coach/","keywords":["Sports","India","ipl","Paddy Upton","Rahul Dravid","rohit sharma","T20 World cup","virat kohli"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: Renowned mental conditioning coach Paddy Upton, who was part of the support staff of India’s 2011 World Cup winning team, is rejoining the national set-up in the lead up to the T20 World Cup in Australia. Paddy Upton has been roped in on a short term contract and will be the latest addition […]","content":"New Delhi: Renowned mental conditioning coach Paddy Upton, who was part of the support staff of India’s 2011 World Cup winning team, is rejoining the national set-up in the lead up to the T20 World Cup in Australia. Paddy Upton has been roped in on a short term contract and will be the latest addition to coach Rahul Dravid’’s team of support staff. “Yes, Paddy will be joining the ODI team from Wednesday’s third game against the West Indies. He will continue till the end of the T20 World Cup in Australia. It is a short-term arrangement for a period of four months,” a senior BCCI source informed Tuesday on conditions of anonymity. Upton was first roped in by former India coach Gary Kirsten, when he took charge of the senior national team in 2008. They forged a successful partnership till 2011. Upton, since then has been associated with various IPL teams and has worked with Dravid at Rajasthan Royals. It is only understandable that Dravid approached Upton for being familiar with his style of working which had worked wonders for the Indian team of last decade. With India having a hectic itinerary going into the T20 World Cup starting with the Pakistan game in Melbourne October 23, Dravid perhaps would have understood the need of having a man, who is known for being a motivator and also helping players cope with rigours of international cricket. The ICC silverware has eluded India since 2013 Champions Trophy and the BCCI is keeping no stone unturned to ensure that the ‘Men in Blue’ come up trumps at the global meet. During the last edition, the BCCI had MS Dhoni as the ‘Mentor’ for the event but with a tired team and a dated approach in T20s, the move didn’t yield desired results. Some of the players that Upton has worked with during his Team India stint (between 2008-2011) are Virat Kohli, current skipper Rohit Sharma, senior spinners Ravichandran Ashwin and Ravindra Jadeja. On the other hand, Yuzvendra Chahal and Prasidh Krishna have worked with Upton at Rajasthan Royals. It is understood that Upton might hold some sessions with team’s premier batter Kohli, whose prolonged lean patch has led to calls of him being dropped from the shortest format. “It is great that someone like Paddy has again joined the Indian team. If you look at Virat’s batting, he isn’t always looking out of form and maybe it’s all in the mind. And who better than Upton to clear the cobwebs,” a former India player said.  ","pubDate":"2022-07-26 16:30:15","image_url":"https://www.orissapost.com/wp-content/uploads/2022/07/Rahul-Dravid-and-Paddy-Upton-300x156.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Women must climb a mountain to win India's first cricket medal","link":"https://www.business-standard.com/article/sports/cwg-2022-women-must-climb-a-mountain-to-win-india-s-first-cricket-medal-122072601022_1.html","keywords":null,"creator":null,"video_url":null,"description":"A few possible scenarios on how Indian women's cricket team can bag a medal at upcoming Commonwealth Games in Birmingham","content":"Smriti Mandhana, a key part of Indian women's cricket team, said that the country’s chances of winning a medal at the upcoming Commonwealth Games are very high, while adding she would want nothing less than gold. “Our preparations have been good and we are gunning for the gold, just not a podium finish,\" she said. But is winning gold, or for that matter any medal in the competitive field of women’s cricket, at Birmingham 2022 going to be easy? No hiccups seen in the initial phase The Indian team would not like to give much importance to Australia, who are their toughest opponent at the group stage. “We have played them (Australia) in the openers in quite a lot of tournaments. In a T20 tournament, any team can beat any team. I wouldn't term Australia as a big team and make them feel good about that,” Mandhana said in a video uploaded by BCCI Women’s Twitter handle. We are aiming for Gold Medal at the Commonwealth Games: #TeamIndia vice-captain @mandhana_smriti . #B2022 pic.twitter.com/7Tsovu3Y12 — BCCI Women (@BCCIWomen) July 22, 2022 But as much as she wants to put India and Australia on an equal footing, the records won’t let the audiences believe it. In the 23 games that have been played between the two sides, the team from Down Under has emerged victorious in 16 while women in blue have won only six matches. However, apart from Australia, the other two teams in India’s group i.e. Pakistan and Barbados (West Indies’ representative for CWG) haven’t had the upper hand against the Harmanpreet Kaur-led side. India have beaten arch-rivals Pakistan nine times out of 11 and outsmarted West Indies 10 times out of 18. Thus, India can fancy themselves beating Barbados (curtailed version of West Indies) easily. Hence, reaching the semi-finals is not a big issue. Battling fear in the semis The main test for the Indian team would begin in the semi-final where it will have to face either England, South Africa or New Zealand from Group B. India are part of Group A. Group B also has Sri Lanka. India would most probably face England as the hosts are being tipped to top their group despite being pitted against New Zealand and South Africa. They have recently beaten South Africa who are already playing without their two top players in Lizelle Lee and Marizanne Kapp. Against New Zealand too, the English team has an upper hand having defeated the White Ferns 22 times in 28 games. A warm send off for #TeamIndia as they left for Birmingham this morning from Bengaluru. #Birmingham2022 pic.twitter.com/Z6tcR3jcDf — BCCI Women (@BCCIWomen) July 24, 2022 However, if India manages to beat Australia in the group stage, they can avoid facing England. India’s record against the English women has been very dismal. They have lost 17 times in 22 meetings. India haven't been good against New Zealand either. The Indian women have beaten the women from the Kiwi nation only four times in 13 games. Things are not going to be easy for India in the semi-final and the 11 ladies that take the field on that day would have to play nothing less than terrific cricket to get into the final and secure India’s first medal in cricket at Commonwealth Games . What if India don’t make it to the final? Looking at Mandhana’s confidence, India would be hoping for nothing less than a place in the final. But if, by any chance, they fail to do so, they would have another go at a medal (bronze), playing the other losing semi-finalist. Thus on August 07, 2022, the day of the gold medal match, India would be able to secure at least one medal. To secure the bronze though, they would have to once again give their best. The team that India will face would also be coming in with a loss in their previous tie. #TeamIndia captain @ImHarmanpreet speaks about the excitement to play in the @birminghamcg22 Commonwealth Games #B2022 pic.twitter.com/uOVnsKmwwU — BCCI Women (@BCCIWomen) July 23, 2022 Cricket was once played at the Kuala Lampur Commonwealth Games in 1998. South Africa won the gold by beating Australia in the final while New Zealand won the bronze by beating Sri Lanka. India, a cricketing powerhouse, has remained medal-less in the sport even after participating in the 1998 edition.","pubDate":"2022-07-26 16:23:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220726/thumb-122072601022.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Here's entire schedule for cricket matches at Commonwealth Games in Birmingham","link":"https://www.indiatvnews.com/sports/cricket/here-s-entire-schedule-for-women-s-t20i-cricket-matches-at-commonwealth-games-in-birmingham-edgbaston-2022-07-26-795135","keywords":null,"creator":null,"video_url":null,"description":"The shortest format of cricket is set to be played for the first time in the history of the Commonwealth Games with the women's T20I matches.","content":null,"pubDate":"2022-07-26 16:06:18","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI 3rd ODI live streaming: When and where to watch India vs West Indies 3rd ODI in Trinidad","link":"https://www.dnaindia.com/cricket/report-ind-vs-wi-3rd-odi-live-streaming-when-and-where-to-watch-india-vs-west-indies-3rd-odi-in-trinidad-2971716","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Know all the details about the 3rd ODI match between India vs West Indies which will be played at the Queens Park Cricket Stadium on 27th July.","content":null,"pubDate":"2022-07-26 16:04:30","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Superb Bowling Display! | Highlights - England v South Africa | 2nd Men's Royal London ODI 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9bjJxMGpLZUlQMTDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Superb Bowling Display! | Highlights - England v South Africa | 2nd Men's Royal London ODI 2022  England & Wales Cricket BoardEngland/South Africa series squared  Stabroek NewsDe Kock dazzles before rain ruins England v South Africa ODI decider  The GuardianEngland ODI series ratings: Sam Curran and Reece Topley impress against South Africa  The TelegraphRain trumps Quinton De Kock's unbeaten 92 as England-South Africa series drawn  Times NowView Full coverage on Google News","content":null,"pubDate":"2022-07-26 15:30:31","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Weather Galle tomorrow Day 4: Galle International Stadium weather tomorrow SL vs PAK 2nd Test","link":"https://thesportsrush.com/cricket-news-weather-galle-tomorrow-day-4-galle-international-stadium-weather-tomorrow-sl-vs-pak-2nd-test/","keywords":["Cricket","Pakistan","Pakistan tour of Sri Lanka 2022","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Weather Galle tomorrow: The SportsRush presents before you the weather prediction for the second SL vs PAK Test Day 4. During the third day of the second Test of Pakistan’s tour of Sri Lanka 2022 in Galle, Sri Lanka managed to build a strong lead for themselves despite the absence of any individual performance. The… The post Weather Galle tomorrow Day 4: Galle International Stadium weather tomorrow SL vs PAK 2nd Test appeared first on The SportsRush.","content":"Weather Galle tomorrow: The SportsRush presents before you the weather prediction for the second SL vs PAK Test Day 4. During the third day of the second Test of Pakistan’s tour of Sri Lanka 2022 in Galle, Sri Lanka managed to build a strong lead for themselves despite the absence of any individual performance. The hosts’ top seven batters getting to starts witnessed them scoring 176/5 in 50 overs before bad light forced players to walk off the Galle International Stadium to register a shortened evening session. Losing in-form former captain Dinesh Chandimal (21) in the 35th over did put Sri Lanka in trouble but an unbeaten 59-run partnership for the sixth wicket between captain Dimuth Karunaratne (27*) and all-rounder Dhananjaya de Silva (30*) avoided a batting collapse to power the lead in excess of 300 runs. Currently leading by 323 runs with half their batting unit remaining, Sri Lanka would want to post at least a 400+ target. While memories of Pakistan registering the highest successful run-chase at this venue would be fresh, Sri Lanka will have to both bat and time their declaration smartly keeping the weather in mind. Weather Galle tomorrow SL vs PAK Day 4 While two full days of cricket is remaining in the match, weather having it in it to play spoilsport on Day 4 could change the dynamics of the match. It is worth mentioning that the morning session on Wednesday is highly unlikely to receive any rainfall. According to AccuWeather, there’s only a 7% rainfall predicted for the first two hours tomorrow. True friends are never apart, maybe in distance but never in heart.#SLvsPAK pic.twitter.com/2P0gW2uUhV — Dimuth Karunarathna (@IamDimuth) July 26, 2022 That being said, the remainder of playing hours on Day 4 is expected to receive moderate to high rainfall in Galle. While there’s a 49% rainfall predicted at the start of the second session, the same number will increase to 73% in the third session. Assuming that the weather prediction holds true, both the teams might have to alter their respective strategies with respect to playing for a draw or a victory. Galle International Stadium hourly weather tomorrow 10:00 AM – 28 degree (Rain Probability – 7%). 11:00 AM – 29 degree (Rain Probability – 7%). 12:00 PM – 29 degree (Rain Probability – 10%). 01:00 PM – 30 degree (Rain Probability – 49%). 02:00 PM – 30 degree (Rain Probability – 68%). 03:00 PM – 29 degree (Rain Probability – 49%). 04:00 PM – 29 degree (Rain Probability – 73%). 05:00 PM – 29 degree (Rain Probability – 49%). 06:00 PM – 28 degree (Rain Probability – 73%). The post Weather Galle tomorrow Day 4: Galle International Stadium weather tomorrow SL vs PAK 2nd Test appeared first on The SportsRush.","pubDate":"2022-07-26 15:05:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI 3rd ODI Dream11 prediction: Fantasy cricket tips for India vs West Indies in Trinidad","link":"https://www.dnaindia.com/cricket/report-ind-vs-wi-3rd-odi-dream11-prediction-fantasy-cricket-tips-for-india-vs-west-indies-in-trinidad-2971705","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"IND vs WI Dream 11 Team - Check My Dream11 Team, Best Player's list for India vs West Indies 3rd ODI","content":null,"pubDate":"2022-07-26 14:58:18","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Issy Wong: Playing Commonwealth cricket at Edgbaston will mean the world to me","link":"https://uk.sports.yahoo.com/news/issy-wong-playing-commonwealth-cricket-143034142.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-26 14:30:34","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India bring back Paddy Upton as mental conditioning coach - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMie2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvaW5kaWEtdG91ci1vZi13aS0yMDIyLWluZGlhLWJyaW5nLWJhY2stcGFkZHktdXB0b24tYXMtbWVudGFsLWNvbmRpdGlvbmluZy1leHBlcnQtMTMyNjI3MdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India bring back Paddy Upton as mental conditioning coach  ESPNcricinfoPaddy Upton joins India support staff | Cricbuzz.com - Cricbuzz  CricbuzzPaddy Upton joins Indian cricket team's support staff as mental conditioning coach  DNA IndiaWith pressures of T20 World Cup, Dravid ropes in Upton as India's mental conditioning coach  Times of IndiaBCCI Hires Renowned Mental Conditioning Coach for ICC T20 World Cup 2022  News18View Full coverage on Google News","content":null,"pubDate":"2022-07-26 14:22:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CWG 2022: Big SETBACK for India women cricket team as two players test Covid positive ahead of Australia clash","link":"https://zeenews.india.com/cricket/cwg-2022-big-setback-for-india-women-cricket-team-as-two-players-test-covid-positive-ahead-of-australia-clash-2489847.html","keywords":null,"creator":null,"video_url":null,"description":"Women's cricket is making its debut at the Commonwealth Games. The India squad left on Sunday morning for Birmingham without the two players.","content":"Another member of the Indian women's cricket team has tested positive for COVID-19 and has stayed back in the country ahead of the side's opener against Australia in the Commonwealth Games in Birmingham on Friday. The India squad left on Sunday morning for Birmingham without the two players. BCCI president Sourav Ganguly had earlier confirmed that one member of the touring party tested positive. The squad trained at the National Cricket Academy (NCA) ahead of the Games. A warm send off for #TeamIndia as they left for Birmingham this morning from Bengaluru. #Birmingham2022 pic.twitter.com/Z6tcR3jcDf — BCCI Women (@BCCIWomen) July 24, 2022 Women's cricket is making its debut at the Commonwealth Games. ''A second player has tested positive for COVID-19 and it happened before departure. Both the players remain in India,'' an Indian Olympic Association official told PTI. A BCCI source added: ''As per protocol, both players can only join the team once they test negative.'' Considering the situation, the two players are unlikely to feature in the opener against Australia. The second game is against arch-rivals Pakistan on July 31 and the final league match against Barbados on August 3. All games, including the final, will be played at Edgbaston. The organizers have said that tickets for the semifinals and final are already sold out. The team will be having its first training session later on Tuesday. #TeamIndia captain @ImHarmanpreet speaks about the excitement to play in the @birminghamcg22 Commonwealth Games #B2022 pic.twitter.com/uOVnsKmwwU — BCCI Women (@BCCIWomen) July 23, 2022 We are aiming for Gold Medal at the Commonwealth Games: #TeamIndia vice-captain @mandhana_smriti . #B2022 pic.twitter.com/7Tsovu3Y12 — BCCI Women (@BCCIWomen) July 22, 2022 Ahead of the team's departure, India skipper Harmanpreet Kaur had spoken about how much playing in the Commonwealth Games meant to her and the team. ''We don't get to experience this often so really looking forward to it. The opening ceremony will be a special experience for all of us,'' she had said.","pubDate":"2022-07-26 14:19:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Durban to host CSA’s annual four-day spinners’ camp","link":"https://www.iol.co.za/sport/cricket/domestic/durban-to-host-csas-annual-four-day-spinners-camp-21957d3d-f1e4-4290-b9b9-81c4913780b8","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Cricket South Africa is making use of the country’s new spin Mecca, Durban, to help improve local player’s ability against spin bowling.","content":null,"pubDate":"2022-07-26 14:11:20","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/ae790f34-52fe-5de7-9c59-28a0d8549f27&operation=CROP&offset=0x42&resize=2093x1176","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs WI, 3rd ODI: India eye clean sweep against West Indies","link":"https://telanganatoday.com/ind-vs-wi-3rd-odi-india-eye-clean-sweep-against-west-indies","keywords":["Cricket","News","Sport","India","Rahul Dravid","West Indies"],"creator":["PTI"],"video_url":null,"description":"Port of Spain: A ruthless Indian team is unlikely to take its foot off the pedal as it aims to top up a world-record winning feat with another clean sweep against the West Indies on Wednesday. India created a world record on Sunday by sealing their 12th consecutive series win in the ODI format against […]","content":"Port of Spain: A ruthless Indian team is unlikely to take its foot off the pedal as it aims to top up a world-record winning feat with another clean sweep against the West Indies on Wednesday. India created a world record on Sunday by sealing their 12th consecutive series win in the ODI format against the West Indies – the most against a team. In this backdrop, head coach Rahul Dravid might be tempted to try out some of his reserve players but he will have to maintain a fine balance between keeping the momentum and testing his bench strength. In the batting department, it is unlikely that Ruturaj Gaikwad would be preferred over Shubman Gill, who after two innings of 64 and 43 would not like to sit out. Gaikwad had got a full South Africa series where he looked distinctly uncomfortable against quality pace. While his IPL credentials have kept him in the mix, chances of Indian cricket establishment investing in him on short term basis look dim. Shreyas Iyer and Sanju Samson have also hit the straps with fifties in last game and Suryakumar Yadav is not expected to cool his heels at the expense of Ishan Kishan despite his twin failures in the first two games. Kishan is seen as a timer of the ball who can use the Powerplay overs well by hitting over the in-field. He isn’t a power hitter who can force the pace after 35th over and hence Samson is a better option despite him being a left hander. Ravindra Jadeja as the designated vice-captain was the first choice all-rounder in this series before he was ruled out of the first two games due to a knee niggle. It is still not certain whether Jadeja will be available for the final game as Axar Patel after his match-winning knock of 64 in the second game could feel hard done by. However if Dhawan wants two play two left-arm spinners, then Yuzvendra Chahal could be asked to rest but that will be at the cost of sacrificing variety in bowling attack. Arshdeep Singh had a groin issue during the England ODIs but since he is a left arm seam bowler, he could be tried out in place of Avesh Khan, who was a tad expensive in the second ODI. He leaked 54 runs in his six wicket-less overs. Avesh and Prasidh Krishna have a similar type of hit the deck bowling style, getting deliveries to rear up from back of length or good length. It only warrants that one among the two should start in the eleven. As far as West Indies is concerned, they have capable players but as a unit, they have failed to fire. They depend too much on individual brilliance of Shai Hope, Nicholas Pooran, Rovman Powell or Romario Shepherd. More importantly, the team hasn’t shown resilience to win important moments that can impact the outcome of the match. West Indies could do well to use the experience of Jason Holder in the final game of the series. The hosts would aim to put an end to their losing streak in ODIs, which has now stretched to eight matches, including a 0-3 loss to Bangladesh in the preceding rubber.","pubDate":"2022-07-26 14:07:34","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"}]}