{"newsArray":[{"title":"‘Broken’: Aussie star in tears on live radio","link":"https://www.news.com.au/sport/cricket/glenn-maxwell-breaks-down-on-live-radio-over-shane-warne-death/news-story/dd2ab83f2f8cf1e7f972c02c69239531","keywords":null,"creator":null,"video_url":null,"description":"Aussie cricket star Glenn Maxwell broke down on live radio over the death of Shane Warne, as he struggles to come to grips with losing one of his best mates.","content":null,"pubDate":"2022-03-05 02:23:00","full_description":"Aussie cricket star Glenn Maxwell broke down on live radio over the death of Shane Warne, as he struggles to come to grips with losing one of his best mates. Maxwell — a dynamic fixture in Australia’s white ball teams — first encountered Warne as a teenager and later became friends when they shared a dressing room together at the Melbourne Stars in the early days of the T20 Big Bash League. Warne died aged just 52 after a suspected heart attack in Thailand and Maxwell was devastated to wake up to the tragic news on Saturday, saying he is “broken”. In a tearful interview with Triple M’s Dead Set Legends program, Maxwell was overwhelmed with emotion as he tried to digest a loss that has shocked the world. “Warnie actually got me to the Stars. Sorry,” Maxwell said, as he broke down and struggled to get the words out. “We had a really good relationship. Just broken at the moment. “I was actually lucky enough to play my second ever grade game against Warnie when I was about 16 or 17. I thought I was fortunate then but to play alongside him at the Stars and, I suppose, post his career become good friends off the field and be a part of his inner sanctum. It’s a hard morning.” Asked about what made Warne so special, Maxwell said: “He was a life-loving person. You’ll be hard-pressed to find a more caring, loyal, generous person than him. He gave his time to pretty much every cricketer that came through, he saw every leg-spinner that was playing international or state cricket and when he was commentating he’d be out there helping them out. “That was just the sort of person he was, he just gave his time so generously … he inspired multiple generations of cricketers just wanting to be Shane Warne. “That’s the legacy he’s going to leave. “Even just to talk to him about normal stuff. He was so knowledgeable, so caring, so friendly. “As far as Australian cricket goes, we’ve lost someone with immeasurable knowledge of the game and someone that’s going to be dearly missed.” Maxwell also paid tribute to Warne on social media, posting emotional Instagram messages alongside photos of the pair together. “Absolutely devastated,” he wrote. “The effect that the king had on so many people around the world is immeasurable. “The wisdom that he shared with every player that he came in contact with was of the highest quality. “The cricket community will always remember that he inspired an entire generation of players to try to be the greatest player of all time. Those who were lucky enough to watch/play with (him), will be forever thankful to be in the presence of true genius. “And the other side, the people who got to know him off the field as the most life loving, loyal, generous and caring person possible. “I will never forget your generosity and time you put in to me as a persona and as a player. Thanks for everything king.” “Devastated” Australian cricket great Ian Healy has spoken candidly about his fears Shane Warne was going to die young. Outside of being one of the most successful bowlers to ever exist, Shane Warne made his fortune through a vast range of deals. International newspapers have paid tribute to the “King of Spin” after Shane Warne’s sudden death. Here’s some of the best front pages.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne’s cricket career remembered","link":"https://www.news.com.au/sport/shane-warnes-cricket-career-remembered/video/e0a420122e1f87ff2dbf1a3cfbdcbf21","keywords":null,"creator":null,"video_url":null,"description":"The cricket world is mourning the death of Australian king of spin Shane Warne after a suspected heart attack. The leg-spinner was found unresponsive in his villa in Koh Samui in Thailand, and despite the efforts of medical staff, he couldn't be revived. There has been an outpouring of condolences as his cricket career is remembered.","content":null,"pubDate":"2022-03-05 02:20:21","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Australia’s greatest bowler’: Border’s tears as Warne’s first Test captain remembers ‘top shelf’ man","link":"https://www.foxsports.com.au/cricket/australia/shane-warne-dead-allan-border-reflects-on-australia-greatest-cricket-bowler-don-bradman-video-reaction-cricket-australia/news-story/72f37887f19b727afd70bab5b4214c35","keywords":null,"creator":null,"video_url":null,"description":"Join Mark Howard, Mark Taylor and Kerry O’Keeffe from 2pm (AEDT) today on Fox Cricket Channel 501 as we pay tribute to Shane Warne, the King of Spin","content":null,"pubDate":"2022-03-05 02:20:00","full_description":"Join Mark Howard, Mark Taylor and Kerry O’Keeffe from 2pm (AEDT) today on Fox Cricket Channel 501 as we pay tribute to Shane Warne, the King of Spin Shane Warne’s first Test captain Allan Border says the late spinner was Australia’s greatest bowler. The world has been rocked by Warne’s sudden passing overnight. Border - one of Australia’s greatest captains and a man who carried the side through their darkest era and into a bright new dawn - was notified of Warne’s death in the early hours of Saturday morning. Unable to sleep, the Queensland and Australian great spent the entire morning pacing around his home in Brisbane. Border says he has been rocked to the core and is in disbelief so soon after Rod Marsh, a modern great who changed the way wicket-keepers play the game, also passed away on Friday after suffering a heart attack late last month. “I’ve shed some tears over the last couple of days with Rod Marsh, it’s going to be hard getting through the next couple of days finally realising I’m not going to see Shane again,” Border said. “It’s just so sad.” Cricketer Shane Warne (L) with former cricketer Allan Border as team celebrates victory in Third Test of India v Australia series in Nagpur. Source: News Corp Australia Border played a pivotal role in shaping Warne’s career. The Australian skipper handed him his debut in 1992 against India, before throwing him the ball against Sri Lanka when Warne had struggled and the game was on the line. After taking just one wicket in his first two-and-a-half Tests, Border, on the back of Greg Matthews’ suggestion, called on Warne in Colombo when Sri Lanka was on track for a famous win. The inspired piece of captaincy worked wonders, as Warne took 3-11 from 5.1 overs to see Australia defeat Sri Lanka by 16 runs. NEW PODCAST - Shane Warne: A tribute to the King OR SUBSCRIBE IN ITUNES OR SPOTIFY From then, Warne was off and running. “Greg Matthews was bowling well and I think it was he who prompted me and said, ‘Why don’t you give the leg-spinner a go?’ I thought upon it and said, yeah OK,” Border recalled. “I threw Warnie the ball and boom, boom, boom, three wickets in a couple of overs and job done and we won the Test match we shouldn’t have won. “I think from that point, Warnie gained a lot of confidence. “He talks about that being the real turning point even as a cricketer. “He wasn’t sure how good he was. Well, we soon found out, didn’t we?” MORE SHANE WARNE NEWS VALE: Australia cricket legend Shane Warne dies of suspected heart attack TRAGIC: Shane Warne’s haunting final tweet as Aussie cricket hit by double tragedy CUMMINS: Captain pays tribute to ‘once in a century’ legend Australian captain Allan Border (left) and Shane Warne celebrate in the dressing room winning the first Ashes Test at Old Trafford on 7th June 1993. Photo: Getty Images Source: Getty Images Although Warne could get people out “even before they walked to the crease”, Border says initially that was far from the case. “He was just your basic club leg-spinner, but could really land them and really spun them hard,” Border said. “Initially he was just very naive but it didn’t take long, I’m talking in 12 months, he just got better and better and the psychological side of his game started to come to the fire. “He was a smart guy, Warnie. He knew how to push buttons. Some guys were out before they even went out to bat. “He was a special, special character and cricketer and a great man off the field, don’t worry about the public persona, that’s Warnie doing his thing. But he was a top shelf man.” Warne haunts England in 2005! | 00:46 While Donald Bradman is widely regarded as the game’s greatest cricket for his average of 99.94, Warne was named as one of Wisden’s cricketers of the 20th century despite only being halfway through his career when he was selected. The other cricketers were Bradman, Garfield Sobers, Jack Hobbs and Viv Richards. Border, who played alongside Dennis Lillee and Glenn McGrath says Warne topped the charts. “He’s on that (Bradman) level,” Border said. “Sir Donald Bradman was a batsman, he’s our best batsman. “But who’s our best bowler? That starts an interesting debate: Lillee and McGrath, but Warne’s got to be our best bowler ever. “When Shane Warne was in the Australian cricket team, Australia wins Test matches. It was the same with Bradman.” READ MORE Shane Warne played in 8 Ashes. The only one he lost was in 2005 — it was his greatest series REACTION: Cricket world reacts with shock and sorrow as ‘Warney’ dead at 52 \"King of Spin\" In his own words | 04:27 Warne took 708 Test wickets, with 195 of them coming in Ashes matches. Border turned to the leg-spinner at Old Trafford after England had got off to a strong start in response to Australia’s first-innings score of 289. With the home side 1-79, Warne broke through with his first ball on English soil by bowling Mike Gatting for four. The ball instantly became known as the Gatting Ball. “Warne to Gatting, how good is that,” Border recalled. “That’s his first ball he’s ever bowled in England, incredible. I knew from that moment we were going to win the series.” Border said Warne revitalised his Test captaincy and made leading fun. “It just refreshed my captaincy,” Border said. “We went through that period and era where we didn’t have any real strong options, we had a few, but when Warne came along it was a fun time to be the captain. “Every Time you threw Warne the ball you knew something was going to happen. “It was just special as a captain to be able to make positive decisions out on the field rather than try to plug holes. He was great for me as a captain and great for the game.” Ashes top 20: Warnie's final day heroics | 02:02 More than the wickets that he took and the matches he won, Border said recalling the joy and memories of the past was the “secret” to getting past the tragedy. He said that Warne was a “top-shelf man”. “I’ve done it tough,” Border said, a day after Marsh’s passing. “We’re talking about two of the very top shelf of people and cricketers and to go back-to-back, it’s knocked everyone about. “Cricketers are doing it tough because they’re special people in our lives. “And top shelf cricketers, not second or third shelf, it’s the top shelf we’re going to with these two blokes. It’s not been a good time.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Eddie reveals final conversation with Warne","link":"https://wwos.nine.com.au/cricket/shane-warne-death-eddie-mcguire-tribute-recalls-last-exchange-with-legend/a4dc4e09-c700-48db-8dbe-71aec6b4c9e3","keywords":null,"creator":["wwos"],"video_url":null,"description":"Eddie McGuire has opened up on his final interaction with his great mate Shane Warne before his tragic death.","content":"Eddie McGuire has revealed what his last conversation with his great mate Shane Warne was before the cricket icon's tragic and sudden death in Thailand.McGuire, like many, was left stunned when Warne was pronounced dead in the early hours of Saturday Australian time.The pair were great friends, building a relationship over a number of decades while working together with the Nine Network as well as the Melbourne Stars, where Warne was once captain and McGuire once president.READ MORE: Warne's shell-shocked mother breaks silence on son's deathREAD MORE: Ex-teammate Ian Healy feared Warne's early demiseREAD MORE: Brett Lee offers insight on Shane Warne the fatherMcGuire said he'd last spoken to Warne earlier this week.\"A couple of days ago, texting, and on WhatsApp and sending stupid memes to each other and laughing and talking about things,\" he told Nine's TODAY when asked about the pair's last chat.\"I know Sam Newman said this morning he spoke to him only a couple of days ago, trying to find him a car and things. He was in town. He texted me. He was catching up with Piers Morgan.\"He had such an amazing network. Everyone. I remember going do his house for a barbecue and he surprised me, he had one of the owners of Glasgow Celtic there.\"When asked by Tony Jones what he'd tell his mate if he had the opportunity for one last conversation, McGuire's message was simple.\"I'd say, 'Thanks, mate. Thanks for everything',\" McGuire said.\"Thanks for making Test cricket great again. Thanks for making leg spin great again.\"For all the things he did, Warnie, you think he should be a fast bowler but he fixed up Test cricket, he was great at one-day, he won the World Cup against the odds.\"He fought back from mishaps along the journey, which showed we always say, as Churchill said, when you're walking through hell, keep walking. He did.\"He had an amazing relationship with Simone post his divorce, but also with his three kids, and they're just wonderful kids, and they're just wonderful kids. You meet his kids and you see Simone and Shane.\"You just thank him for what he gave, and I hope that that's what we remember him for, for the great moments on the ground and for those who were lucky enough to have been in his orbit for the amazing generosity of spirit that he gave to so many people.\"Despite being four years removed from international cricket when the Big Bash League began in the summer of 2011-12, Warne was undoubtedly its biggest drawcard. McGuire admitted that the competition couldn't have grown without the legend's input.\"Shane Warne was the reason Big Bash popped there's no doubt about that. I saw it first hand,\" he said.\"He recruited all the great players to the Stars. He called that ball when he was mic'd up.\"There's a million stories of Shane Warne that would be most people's best story of their life that have been forgotten in history because he's been so great.\"McGuire also gave an insight into what it was like being in the orbit of the larger-than-life Warne.\"What I remember of Shane is for a bloke who was so famous, so talented, had so much, I've never known somebody who was prepared to give so much to anyone, not only in his immediate orbit, but anyone who came across his path,\" he said.\"All the joys that he had in life, he just wanted to give you a drink, to come to a barbecue.\"I remember we were at a barbecue hosted by him and Liz Hurley for the Melbourne Stars. He had park cricketers there. We had to boot them out of his pool in the end. He did that every week. Poker games and charities and the amount of sessions in the nets with Shane Warne for kids, things like that.\"He ate well from the smorgasbord of life, but he more than replenished what he took. He gave and he goes away, a net giver of life. No doubt about it.\"McGuire said he'd been in mourning in the early hours of Saturday alongside some of the Stars family.\"It's like the cosmos came together when those messages were going out,\" he said.\"As a long-time president you don't want to be getting phone calls at 1:30 am in the morning on a Saturday, and got the message from my son that Shane had died.\"Sir Viv Richards, Ian Botham, Kevin Pietersen, all our friends in the Northern Hemisphere. Sam Newman, all these different people, all the Melbourne Stars family, where Shane and I had such great times together.\"We've all half gone back to sleep, sat up all night and we're all talking to each other again this morning, we're all in tears, we're all devastated, and that's the only way I can say it.\"We're all laughing at the same time over this amazing life force that was Shane Warne, and then that devastates us even more, because the star, pardon the pun, just turned so brightly and now it's dimmed.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-05 02:19:56","full_description":"Eddie McGuire has revealed what his last conversation with his great mate Shane Warne was before the cricket icon's tragic and sudden death in Thailand. McGuire, like many, was left stunned when Warne was pronounced dead in the early hours of Saturday Australian time . The pair were great friends, building a relationship over a number of decades while working together with the Nine Network as well as the Melbourne Stars , where Warne was once captain and McGuire once president. READ MORE: Warne's shell-shocked mother breaks silence on son's death READ MORE: Ex-teammate Ian Healy feared Warne's early demise READ MORE: Brett Lee offers insight on Shane Warne the father McGuire said he'd last spoken to Warne earlier this week. \"A couple of days ago, texting, and on WhatsApp and sending stupid memes to each other and laughing and talking about things,\" he told Nine's TODAY when asked about the pair's last chat. \"I know Sam Newman said this morning he spoke to him only a couple of days ago, trying to find him a car and things. He was in town. He texted me. He was catching up with Piers Morgan. \"He had such an amazing network. Everyone. I remember going do his house for a barbecue and he surprised me, he had one of the owners of Glasgow Celtic there.\" When asked by Tony Jones what he'd tell his mate if he had the opportunity for one last conversation, McGuire's message was simple. \"I'd say, 'Thanks, mate. Thanks for everything',\" McGuire said. \"Thanks for making Test cricket great again. Thanks for making leg spin great again. \"For all the things he did, Warnie, you think he should be a fast bowler but he fixed up Test cricket, he was great at one-day, he won the World Cup against the odds. \"He fought back from mishaps along the journey, which showed we always say, as Churchill said, when you're walking through hell, keep walking. He did. \"He had an amazing relationship with Simone post his divorce, but also with his three kids, and they're just wonderful kids, and they're just wonderful kids. You meet his kids and you see Simone and Shane. \"You just thank him for what he gave, and I hope that that's what we remember him for, for the great moments on the ground and for those who were lucky enough to have been in his orbit for the amazing generosity of spirit that he gave to so many people.\" Despite being four years removed from international cricket when the Big Bash League began in the summer of 2011-12, Warne was undoubtedly its biggest drawcard. McGuire admitted that the competition couldn't have grown without the legend's input. \"Shane Warne was the reason Big Bash popped there's no doubt about that. I saw it first hand,\" he said. \"He recruited all the great players to the Stars. He called that ball when he was mic'd up. \"There's a million stories of Shane Warne that would be most people's best story of their life that have been forgotten in history because he's been so great.\" McGuire also gave an insight into what it was like being in the orbit of the larger-than-life Warne. \"What I remember of Shane is for a bloke who was so famous, so talented, had so much, I've never known somebody who was prepared to give so much to anyone, not only in his immediate orbit, but anyone who came across his path,\" he said. \"All the joys that he had in life, he just wanted to give you a drink, to come to a barbecue. \"I remember we were at a barbecue hosted by him and Liz Hurley for the Melbourne Stars. He had park cricketers there. We had to boot them out of his pool in the end. He did that every week. Poker games and charities and the amount of sessions in the nets with Shane Warne for kids, things like that. \"He ate well from the smorgasbord of life, but he more than replenished what he took. He gave and he goes away, a net giver of life. No doubt about it.\" McGuire said he'd been in mourning in the early hours of Saturday alongside some of the Stars family. \"It's like the cosmos came together when those messages were going out,\" he said. \"As a long-time president you don't want to be getting phone calls at 1:30 am in the morning on a Saturday, and got the message from my son that Shane had died. \"Sir Viv Richards, Ian Botham, Kevin Pietersen, all our friends in the Northern Hemisphere. Sam Newman, all these different people, all the Melbourne Stars family, where Shane and I had such great times together. \"We've all half gone back to sleep, sat up all night and we're all talking to each other again this morning, we're all in tears, we're all devastated, and that's the only way I can say it. \"We're all laughing at the same time over this amazing life force that was Shane Warne, and then that devastates us even more, because the star, pardon the pun, just turned so brightly and now it's dimmed.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/414844/050322tjwarne.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Women’s World Cup: Australian team pays tribute to Shane Warne and Rod Marsh","link":"https://thewest.com.au/sport/womens-world-cup-australian-team-pays-tribute-to-shane-warne-and-rod-marsh-c-5940684","keywords":null,"creator":["Erin Smith"],"video_url":null,"description":"Australia’s Women’s World Cup campaign opened with a tribute to Shane Warne and Rod Marsh as the cricket world came to terms with the deaths of two legends.","content":null,"pubDate":"2022-03-05 01:32:24","full_description":"Two of cricket’s greats, Shane Warne and Rod Marsh , have been honoured by the Australian and English women’s cricket teams with a minute silence before their World Cup campaign begins in Hamilton, New Zealand this morning. The cricketing world has been left stunned by the sudden and sad news of Warne’s passing overnight after a suspected heart attack while on holiday in Thailand. Marsh sadly passed away on Friday following a heart attack a week earlier. The Australian and English women’s teams will don black armbands for the 50-over-clash as a sign of respect. Aussie captain Meg Lanning said it had been a sad week. “Losing Shane and Rod in the last couple of days has been very sad, our thoughts are with their family and friends, they were two icons of the game. It is a very sad time and hopefully we can do them proud today,” Lanning said. Australia lost the toss and will be first to the crease with the bat. Lanning wasn’t phased by the prospect of having to chase down the reigning World Cup champions. “We have been 50-50 with chasing and setting the last couple of years,” she said. Australia will be without Ashleigh Gardner who tested positive to Covid-19 earlier this week. All-rounder Annabel Sutherland has been brought into the squad. “It is unfortunate we are missing Gardner, but we feel we have some good coverage here. Gardner is going as well as can be expected but is frustrated she can’t be here today,” Lanning said.","image_url":"https://images.thewest.com.au/publication/C-5940684/6085c979b11c628fda9cf48f30db98b310273754-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Women’s World Cup: Australian team pays tribute to Shane Warne and Rod Marsh","link":"https://www.perthnow.com.au/sport/womens-world-cup-australian-team-pays-tribute-to-shane-warne-and-rod-marsh-c-5940681","keywords":null,"creator":["Erin Smith"],"video_url":null,"description":"Australia’s Women’s World Cup campaign opened with a tribute to Shane Warne and Rod Marsh as the cricket world came to terms with the deaths of two legends.","content":null,"pubDate":"2022-03-05 01:32:21","full_description":"Two of cricket’s greats, Shane Warne and Rod Marsh , have been honoured by the Australian and English women’s cricket teams with a minute silence before their World Cup campaign begins in Hamilton, New Zealand this morning. The cricketing world has been left stunned by the sudden and sad news of Warne’s passing overnight after a suspected heart attack while on holiday in Thailand. Marsh sadly passed away on Friday following a heart attack a week earlier. The Australian and English women’s teams will don black armbands for the 50-over-clash as a sign of respect. Aussie captain Meg Lanning said it had been a sad week. “Losing Shane and Rod in the last couple of days has been very sad, our thoughts are with their family and friends, they were two icons of the game. It is a very sad time and hopefully we can do them proud today,” Lanning said. Australia lost the toss and will be first to the crease with the bat. Lanning wasn’t phased by the prospect of having to chase down the reigning World Cup champions. “We have been 50-50 with chasing and setting the last couple of years,” she said. Australia will be without Ashleigh Gardner who tested positive to Covid-19 earlier this week. All-rounder Annabel Sutherland has been brought into the squad. “It is unfortunate we are missing Gardner, but we feel we have some good coverage here. Gardner is going as well as can be expected but is frustrated she can’t be here today,” Lanning said.","image_url":"https://images.perthnow.com.au/publication/C-5940681/6085c979b11c628fda9cf48f30db98b310273754-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne dies: Warnie’s family offered a State funeral by Victorian Premier Dan Andrews","link":"https://thewest.com.au/news/vic/shane-warne-dies-warnies-family-offered-a-state-funeral-by-victorian-premier-dan-andrews-c-5940485","keywords":null,"creator":["Staff writers and AAP"],"video_url":null,"description":"Victorian Premier Dan Andrews has offered a State funeral to the family of Shane Warne after the cricket great’s sudden death of a suspected heart attack.","content":null,"pubDate":"2022-03-05 01:23:31","full_description":"Victorian Premier Dan Andrews has offered a State funeral to the family of Shane Warne after the cricket great’s sudden death of a suspected heart attack. News broke in the early hours of Saturday that the 52-year-old had been found unresponsive in a villa in Koh Samui, Thailand. Victorian Premier Daniel Andrews has offered a state funeral to the Warne family, an offer that has been supported by the Federal Government. It is not yet known whether the family plans to accept the offer. Warne, who was born in the Melbourne suburb of Upper Ferntree Gully, leaves behind daughters Brooke, 24, and Summer, 20, and son Jackson, 22. Mr Andrews said he had made the offer to Warne’s family so Victorians could “pay tribute to his legacy and contribution to our state, community and country”. “Victoria has lost an icon. Australia has lost a legend. And the entire cricket world is mourning the loss of the King,” he said in a statement. ‘To us, he was the greatest – but to his family, he was so much more. “Shane Warne didn’t just inspire a cricketing generation — he defined it.” Mr Andrews spoke of Warnie’s Ashes hat trick, his 700th wicket told how he game cricket fans “irreplaceable MCG memories”. “Nobody who saw Shane Warne play will ever forget him,” Mr Andrews said. “To us, he was the greatest – but to his family, he was so much more. “Our hearts are breaking for Shane’s family and friends.” Reuters news agency is reporting one of Warne’s friends found the 52-year-old unresponsive in the Thai villa after he failed to appear for dinner. They performed CPR on him before paramedics arrived. Warne was taken to the Thai International Hospital via ambulance but could not be revived after about 20 minutes of CPR. A Thai police officer has told Reuters the death is not being treated as suspicious. Prime Minister Scott Morrison also offered his condolences to the Warne family in a written statement. “Shane was his own man, following his own path,” Mr Morrison said. “In those times when he could have been knocked down by the headlines, he got back up. He always did. “We have lost one of Australia’s greatest cricketers and today we are bewildered by this sad and sudden loss.”","image_url":"https://images.thewest.com.au/publication/C-5940485/e3c356b0fa885f006479be09499cc7db02b9104f-16x9-x0y86w5132h2887.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Glenn Maxwell in tears paying tribute to Warne","link":"https://www.cairnspost.com.au/sport/cricket/glenn-maxwell-in-tears-paying-tribute-to-warne/video/701e806a5445c909c575c09e940d9154","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Glenn Maxwell has given an emotional interview with Triple M's Deadset Legends today, paying tribute to Shane Warne.","content":null,"pubDate":"2022-03-05 01:09:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne dies: Warnie’s family offered a State funeral by Victorian Premier Dan Andrews","link":"https://www.perthnow.com.au/news/vic/shane-warne-dies-warnies-family-offered-a-state-funeral-by-victorian-premier-dan-andrews-c-5939993","keywords":null,"creator":["Staff writers and AAP"],"video_url":null,"description":"Victorian Premier Dan Andrews has offered a State funeral to the family of Shane Warne after the cricket great’s sudden death of a suspected heart attack.","content":null,"pubDate":"2022-03-05 01:09:10","full_description":"Victorian Premier Dan Andrews has offered a State funeral to the family of Shane Warne after the cricket great’s sudden death of a suspected heart attack. News broke in the early hours of Saturday that the 52-year-old had been found unresponsive in a villa in Koh Samui, Thailand. Victorian Premier Daniel Andrews has offered a state funeral to the Warne family, an offer that has been supported by the Federal Government. It is not yet known whether the family plans to accept the offer. Warne, who was born in the Melbourne suburb of Upper Ferntree Gully, leaves behind daughters Brooke, 24, and Summer, 20, and son Jackson, 22. Mr Andrews said he had made the offer to Warne’s family so Victorians could “pay tribute to his legacy and contribution to our state, community and country”. ‘To us, he was the greatest – but to his family, he was so much more. “Victoria has lost an icon. Australia has lost a legend. And the entire cricket world is mourning the loss of the King,” he said in a statement. “Shane Warne didn’t just inspire a cricketing generation — he defined it.” Mr Andrews spoke of Warnie’s Ashes hat trick, his 700th wicket told how he game cricket fans “irreplaceable MCG memories”. “Nobody who saw Shane Warne play will ever forget him,” Mr Andrews said. “To us, he was the greatest – but to his family, he was so much more. “Our hearts are breaking for Shane’s family and friends.” Reuters news agency is reporting one of Warne’s friends found the 52-year-old unresponsive in the Thai villa after he failed to appear for dinner. They performed CPR on him before paramedics arrived. Warne was taken to the Thai International Hospital via ambulance but could not be revived after about 20 minutes of CPR. A Thai police officer has told Reuters the death is not being treated as suspicious. Prime Minister Scott Morrison also offered his condolences to the Warne family in a written statement. “Shane was his own man, following his own path,” Mr Morrison said. “In those times when he could have been knocked down by the headlines, he got back up. He always did. “We have lost one of Australia’s greatest cricketers and today we are bewildered by this sad and sudden loss.”","image_url":"https://images.perthnow.com.au/publication/C-5939993/afb5d58b49b63bc3d5bc1220d2a90b2f9ff39478-16x9-x1y0w2446h1376.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sombre start to Aussie Women’s World Cup campaign","link":"https://www.cairnspost.com.au/sport/cricket/womens-cricket/womens-world-cup-australian-team-pays-tribute-to-shane-warne-and-rod-marsh/news-story/b83d1d6b562324e516d06cefd19464ef","keywords":["Cricket news and galleries","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Two of cricket’s greats, Shane Warne and Rod Marsh, have been honoured by the Australian and English women’s cricket teams with a minute silence before their World Cup campaign begins in Hamilton, New Zealand this morning.","content":null,"pubDate":"2022-03-05 01:09:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rich tributes paid to Marsh","link":"https://www.thenews.com.pk/print/938763-rich-tributes-paid-to-marsh","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Officials paid rich tributes to former Australian great Rod Marsh who breathed his last in Australia Friday morning.“I just echo those comments about the passing of Rod Marsh as a young boy in Australia, falling in love with the sport of cricket. Rod was one of my heroes, and he...","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"ISLAMABAD: Officials paid rich tributes to former Australian great Rod Marsh who breathed his last in Australia Friday morning. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ “I just echo those comments about the passing of Rod Marsh as a young boy in Australia, falling in love with the sport of cricket. Rod was one of my heroes, and he also made such a contribution after his playing days as well with young players in many countries. And he also had a strong involvement with the ICC, too, with the establishment of the ICC Cricket Academy in Dubai. And he was the mastermind of the design of the facilities there, and young players are enjoying those facilities every day, so his legacy,” ICC Chief Executive Geoff Allardice said. Faisal Hasnain, CEO of Pakistan Cricket Board also paid rich tribute to Rod Marsh: “I would like on my behalf and on behalf of the PCB and the people of Pakistan would like to offer my condolences to Cricket Australia and to the friends and family of Rodney Marsh, who has sadly passed away. I grew up watching players like Rodney Marsh, Dennis Lilly, Geoff Thompson, the Chappell brothers.” Cricket Australia CEO Nick Hockley said: “I would like on behalf of Cricket Australia, to offer my sincere condolences to the family. I think there’s a sad, very sad day for Australian cricket and there are a lot of people who may have made just such a positive impact on so many lives.”","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Shane Warne, spin genius with soap-opera life","link":"https://www.thenews.com.pk/print/938760-shane-warne-spin-genius-with-soap-opera-life","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: Shane Warne mixed legendary cricket deeds with lurid headlines away from the pitch in a career as bewitching as his famed wrong ‘un.Warne, who has died at the age of 52 from a suspected heart attack, was never one for half-measures throughout his extraordinary 15-year Test career.The...","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"SYDNEY: Shane Warne mixed legendary cricket deeds with lurid headlines away from the pitch in a career as bewitching as his famed wrong ‘un. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Warne, who has died at the age of 52 from a suspected heart attack, was never one for half-measures throughout his extraordinary 15-year Test career. The greatest leg-spinner of them all carved out a flamboyant lifestyle cast outside the mould of a traditional cricketing icon, often putting himself at odds with the game’s purists. Vainglorious Warne did things his way and will be remembered for his dalliances and forthright opinions as much as for his pioneering 708 Test wickets in a 145-Test career that made him the scourge of batsmen worldwide. Warne is entrenched in Australia’s sporting pantheon — in the eyes of many he is second only to cricket’s immortal Don Bradman. Yet his achievements are tempered for some by his penchant for a zesty private life, including at one point being engaged to British actress Liz Hurley. But Warne’s contribution to cricket is not in doubt, notably after he resurrected the waning art of leg-spin, becoming the first bowler to take 700 Test wickets and delivered the most famous ball in the sport’s history. Ball of the century Warne posted inauspicious figures of 1-150 in his 1992 Test debut but knuckled down under spin guru Terry Jenner. Eighteen months later, Warne riveted the cricketing world with the “ball of the century” against England. Warne’s first leg-break delivery in an Ashes Test turned viciously to bamboozle England’s Mike Gatting at Old Trafford in 1993 that heralded the arrival of a cricketing superstar. He was a master of mind games, targeting batsmen ahead of a series and warning he was working on a new mystery ball to bowl out his “bunnies” in the opposition line-up. He gave a man-of-the-match performance when Australia won the World Cup in 1999, and was known for a sharp and inventive cricketing brain which saw him long touted as Australian Test skipper. But even Warne himself once described his life as a soap opera, such was the litany of off-field controversies. “Warney”, also nicknamed “Hollywood”, survived drug and bookmaking scandals and pursued an energetic love life which is widely thought to have cost him the Australian captaincy. In 1998 it emerged that Warne and Australian team-mate Mark Waugh had been fined three years earlier for supplying information to an Indian bookmaker. Warne was stripped of the Australian team vice-captaincy in 2000 after it emerged he had bombarded an English nurse with lewd text messages after meeting her in a nightclub. A series of infidelities culminated in his very public break-up from his wife of 10 years, Simone, with whom he had three children. Success despite scandals And yet his performance in Australia’s failed Ashes campaign in England in 2005 is regarded by some pundits as the pinnacle of his career, when he overcame his disintegrating marriage and a tabloid frenzy to take 40 wickets. Warne was inducted into the International Cricket Council Hall of Fame at Lord’s in 2013, just days after finally calling time on his career.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Aussie players excited to be in Pakistan","link":"https://www.thenews.com.pk/print/938764-aussie-players-excited-to-be-in-pakistan","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Cricket Association Australia Chief Executive Todd Greenberg was highly satisfied with the security arrangements by the concerned authorities in Pakistan, saying tourists were unbelievably excited.“The Australian cricketers are excited and are thankful to the PCB particularly the...","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"ISLAMABAD: Cricket Association Australia (CAA) Chief Executive Todd Greenberg was highly satisfied with the security arrangements by the concerned authorities in Pakistan, saying tourists were unbelievably excited. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ “The Australian cricketers are excited and are thankful to the PCB particularly the people of Pakistan for the warm welcome they received. A lot of players were very anxious about this tour some months ago, but that anxiety has turned to real excitement and that’s a really positive sign for global cricket. It’s a really positive sign that the Australian cricket team are here, and we understand our contribution and our responsibility to the global game, which is why this tour is so significantly important.” He apologised to the people who faced trouble with the closure of roads for security purposes. “When the roads are closed and the cavalcade comes through, we understand that creates difficulties for the people in Pakistan. We want to thank you and we appreciate that effort to allow us to be secure and to get to the ground and to get to training and all those sorts of things.”","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘Just broken’: Glenn Maxwell breaks down in gut-wrenching interview after Warne’s death","link":"https://www.foxsports.com.au/cricket/australia/glenn-maxwell-interview-about-shane-warne-how-did-shane-warne-die-cricket-news-2022-bbl/news-story/134814a961c1ea41551b32b3c33129ad","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket superstar Glenn Maxwell has broken down in an emotional interview discussing his relationship with good friend, cricket icon Shane Warne.","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"Australian cricket superstar Glenn Maxwell has broken down in an emotional interview discussing his relationship with good friend, cricket icon Shane Warne. Warne passed away in Thailand overnight at the age of 52 , with Maxwell saying: “We’ve lost someone with immeasurable knowledge of the game, someone that’s going to be dearly missed.” Maxwell choked back tears in a deeply touching interview on Triple M radio as he described Warne’s impact on his career and life. NEW PODCAST – Shane Warne: A tribute to the King OR SUBSCRIBE IN ITUNES OR SPOTIFY MORE SHANE WARNE NEWS BLOODY GOOD FLUKE: The moment that ‘changed’ Warnie’s life ‘THE GREATEST’: Vaughan in emotional tribute to Warne WARNIE’S GREATEST MOMENTS: ‘Amazing Adelaide’; sublime hat-trick VALE: Australia cricket legend Shane Warne dies of suspected heart attack Asked if their careers crossed paths, he said: “Yeah, Warnie actually got me to the Stars. Sorry … um. Yeah we had a really good relationship. Just broken.” “I was actually lucky enough to play my second ever grade game against Warnie,” he said. “I was about 16 or 17 and thought I was fortunate then. But to get to play with him at the Stars and post his career, become good friends off the field and sort of be a part of his inner sanctum … it’s a hard morning.” Maxwell praised the generosity of spirit of his great friend. “He was a pretty life-loving person,” he said. “You’d be hard pressed to find a more caring, loyal, generous person than him. He gave his time to pretty much every cricketer that came through. He saw every leg spinner that was playing international cricket, state cricket when he was commentating, he’d be out there helping them out. “That was just the sort of person he was, he just gave his time so generously. He found a way to, he inspired multiple generations of players wanting to be Shane Warne. That’s the legacy he’s going to leave.” Cricket Legends: Shane Warne | 26:02 MORE SHANE WARNE NEWS TRAGIC: Shane Warne’s haunting final tweet as Aussie cricket hit by double tragedy CUMMINS: Captain pays tribute to ‘once in a century’ legend REACTION: Cricket world reacts with shock and sorrow as ‘Warney’ dead at 52 The Australian all-rounder not only linked up with Warne at the Melbourne Stars in the BBL, but was coached by Warne at the London Spirit in England’s The Hundred competition last year. Maxwell continued: “He was (fun to be around). Even just to talk to him about normal stuff, he was just so knowledgeable and so caring and friendly. When myself and Finchy (Aaron Finch) started playing poker with him and going around to his house, being openly invited to just have these nice chats with him, we’d always make an effort to turn up early so we could talk about other stuff. He was just so giving with his time and more than happy to give back. “As far as Australian cricket goes, we’ve lost someone with immeasurable knowledge of the game, someone that’s going to be dearly missed.” Ashes top 20: Warnie's final day heroics | 02:02 MORE SHANE WARNE NEWS OBITUARY: Spin King Warne transcended sport and his freak skill changed cricket IN PICTURES: Legend, larrikin, life of the party: Shane Warne’s incredible life UK VIEW: ‘Box office’ star who was cricket’s ultimate ‘con-man’ … in the possible way ‘TRANSCENDS SPORT’: Hugh Jackman, Ed Sheeran and more respond A choked-up Maxwell added: “I went around and saw Finchy this morning … I only woke up to the news this morning. It’s been a tough morning.” “I just want to send my whole love to (Shane’s family),” he concluded. Allan Border reflects on great loss | 09:54","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Strong Pakistan to benefit international cricket'","link":"https://www.thenews.com.pk/print/938762-strong-pakistan-to-benefit-international-cricket","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: On the historic opening day of the first Test between Australia and Pakistan, Chief Executive International Cricket Council Geoff Allardice admitted that a stronger Pakistan would be of a big benefit to international cricket.Allardice along with Nick Hockley , Australian Cricket...","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"ISLAMABAD: On the historic opening day of the first Test between Australia and Pakistan, Chief Executive International Cricket Council (ICC) Geoff Allardice admitted that a stronger Pakistan would be of a big benefit to international cricket. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Allardice along with Nick Hockley (CE Cricket Australia), Australian Cricket Association (CAA) Chief Executive Todd Greenberg, and the PCB CEO Faisal Hasnain held a media talk Friday at the Pindi Stadium to mark the return of the Australian team to Pakistan. “I think strong Pakistan is very important for international cricket. Series not only holds importance for the PCB and cricket fans in Pakistan, but it also is a significant moment when it’s been twenty-four years between Test series in this country, between the two teams.” The ICC chief executive hoped that the series would have its impact on the World Test Championship. “More importantly it provides an opportunity to the fans to watch leading players in action.” He was also worried about the cricketers’ preference for T20 leagues instead of national duties. “It is an issue the ICC is facing. It is changing the game, really. I think the strengths of some of the domestic leagues around the world provide really good options and professional opportunities for the players. So finding the balance between those two is an ongoing discussion. And in our next set of meetings in April, it’ll be a pretty prominent agenda item.” Allardice, however, did not have a satisfactory answer when questioned on the social media’s misuse trying to interrupt and discourage teams touring Pakistan. “I think the detail of that isn’t something that we’ve, you know. The ICC has been part of the journey of getting Pakistan back, hosting elite cricket, and I think each of the touring teams has to satisfy itself with the arrangements when they embark on a tour.” Faisal Hasnain praised the contribution of all the concerned to ensure that the series would go ahead. “There are many, many people on both sides that have worked tirelessly over many, many months to make this tour a reality. And the PCB and the Pakistani public and cricket fans are part of those efforts. Thank all those involved governments and agencies.” “I am confident that when the Australian team returns home, they will leave with fond memories and will all hopefully become ambassadors of Pakistan. The Pakistani fans have waited for 24 years to see a strong Australian side play in Pakistan, and their wishes will very, very shortly be fulfilled. So I urge cricket fans all over Pakistan to come and see the matches to fill the stadiums and enjoy what promises to be a high-quality cricket match and series between two top world-class teams.” Nick Hockley was blunt in admitting that Australian players’ worries and pre-tour fears turned into excitement. “A lot of players were very anxious about this tour some months ago, but that anxiety has turned to real excitement and that’s a really positive sign for global cricket. We understand our contribution and responsibility to the global game, which is why this tour is so significantly important.”","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"West Indies upset hosts NZ in World Cup opener","link":"https://www.thenews.com.pk/print/938766-west-indies-upset-hosts-nz-in-world-cup-opener","keywords":null,"creator":null,"video_url":null,"description":"MOUNT MAUNGAUNI: Host nation New Zealand lost the opening match of the Women’s Cricket World Cup in dramatic fashion on Friday when the West Indies claimed three wickets in the final over.New Zealand finished three runs short of the West Indies’ total of 259 as Hayley Matthews’...","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"MOUNT MAUNGAUNI: Host nation New Zealand lost the opening match of the Women’s Cricket World Cup in dramatic fashion on Friday when the West Indies claimed three wickets in the final over. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ New Zealand finished three runs short of the West Indies’ total of 259 as Hayley Matthews’ 119 powered the Caribbean women to a shock victory at Mount Maunganui’s Bay Oval. Kiwi captain Sophie Devine responded with a defiant 108 but Deandra Dottin took 2-2 in the final over and helped run out rookie Fran Jonas to claim a last-gasp win. New Zealand opted to bowl after winning the toss, with Devine saying her players were excited about the “once in a generation” chance to play the one-day showcase on home soil. “It would be silly to think that there’s not going to be pressure or expectation, so we’re trying to really step into that and embrace it,” she said. The West Indies finished with 259-9, making a blistering start of 10 runs an over before the New Zealand attack pegged them back with a steady stream of wickets. The first dismissal of the tournament was Dottin on 12 when she edged a Lea Tahuhu delivery to Jess Kerr at mid-off in the third over. Matthews’ maiden ton was the highlight of the innings after the 23-year-old was promoted from the middle order to open the batting. “I’m not sure how I felt about it at first since I was pretty comfortable batting at five, but it seemed to work out alright,” she said after a knock that included 16 fours and one six. Matthews also took 2-41 with the ball in a player-of-the-match performance. Chedean Nation chipped in with 36 runs and captain Stafanie Taylor made 30, while Tahuhu was the best of the Kiwi bowlers with three for 57. Devine responded with a big total of her own, helped by some sloppy West Indies fielding that saw a run-out opportunity and a catch squandered. Her sixth ODI century came off 117 balls, but she struggled to find partners as spinners Matthews and Anisa Mohammed contained New Zealand’s batters. New Zealand looked in trouble when Devine was dismissed for 108 by a sharply taken caught-and-bowled from Chinelle Henry with the required run rate creeping up. Back-to-back boundaries from Katey Martin gave New Zealand the momentum before Dottin’s superb over of death bowling sealed the win for the West Indies.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Australian cricket great Rod Marsh dead at 74","link":"https://www.thenews.com.pk/print/938761-australian-cricket-great-rod-marsh-dead-at-74","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: Former Test and ODI wicketkeeper-batter Rod Marsh has been remembered as “a colossal figure in Australian cricket” after he passed away at the age of 74 on Friday.Rod Marsh was remembered as “a colossal figure” in Australian cricket Friday who gave close to 50...","content":null,"pubDate":"2022-03-05 01:00:00","full_description":"SYDNEY: Former Test and ODI wicketkeeper-batter Rod Marsh has been remembered as “a colossal figure in Australian cricket” after he passed away at the age of 74 on Friday.Rod Marsh was remembered as “a colossal figure” in Australian cricket Friday who gave close to 50 years’ service to the sport as tributes poured in after he died following a heart attack at a charity event last week. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The 74-year-old, who played 96 Tests and was later a long-time national selector, had been in an induced coma and passed away peacefully in an Adelaide hospital on Friday morning, his family confirmed. “We are so grateful for all the love and support our family has received from so many people over the last week,” they said in a statement. “It has given us strength in the most difficult week of our lives.” Perth-born Marsh made his international debut in 1970 against England before retiring in 1984 with what was then a world-record 355 Test dismissals, 95 off the bowling of legendary paceman Dennis Lillee.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Celebrity tributes flow with passing of Australian cricket legend","link":"https://www.perthnow.com.au/entertainment/celebrity/shane-warne-celebrity-tributes-flow-with-passing-of-australian-cricket-legend--c-5939712","keywords":null,"creator":["Megan French"],"video_url":null,"description":"Celebrities from music and the silver screen have flooded social media with heartfelt tributes to cricket legend Shane Warne after his shock death, with many speaking about what a good friend he was.","content":null,"pubDate":"2022-03-05 00:54:52","full_description":"Celebrities have flooded social media with heartfelt tributes to cricket legend Shane Warne after his shock death. Rolling Stones frontman and cricket tragic Mick Jagger was among the first, writing on Twitter: “He brought such joy to the game and was the greatest spin bowler ever.” The Rolling Stones tours to Australia often coincided with the Ashes series. Elton John too, has paid tribute and also noted the passing another Australian cricket great, Rod Marsh: “A tragic day for Australian cricket. Two legends passing is heartbreaking. I knew them both and played cricket with Rod in Perth. A very special and fearless man. “Shane was a magical bowler and such huge fun. They were both Australians through and through, which made them so endearing.” Magda Szubanski, whose character Sharon on long running Australian comedy Kath and Kim was obsessed with the spin king, said she was in shock and devastated at Warne’s passing. “I’ve woken in the middle of the night to this terrible terrible news I’m in complete shock. This is just too sad. Devastating. Incredible to think that bright, cheeky spark has been snuffed out RIP Shane Warne.” Hollywood A-lister Russell Crowe also shared his condolences to his friend. “S.K. Warne. Woke this morning to the devastating news. Having a hard time accepting it. Genius player. Grand company. Loyal friend.” English singer songwriter Ed Sheeran posted a heartfelt tribute on Instagram to his 37 million followers. “The world keeps taking incredible people away. I spoke to Shane on the anniversary of Michaels passing this week saying we were both raising a glass of 707 in his honour, and now this news comes out,” Sheeran wrote. “Shane was the kindest heart, and always went above and beyond to make people feel welcome and special. Such a gentleman. He gave so many hours and years of his life to bring joy to others, and was such an amazing friend to me. Il bloody miss you mate. Absolutely gutted.” Ant Middleton, chief instructor on SAS Australia, said he was “devastated” about the tragic news. “From a childhood hero of mine to a good friend! Such a proud positive gentleman. Rest in peace brother,” he wrote. Australian star Dannii Minogue wrote: “I am devastated to wake up to the news that Shane Warne has passed. My heart breaks for his family and friends” on Instagram. “He was such a light and energy in the room. He was always lovely to my whole family. He knew that I didn’t have a clue about cricket, but he liked that. To me, he was just Shane. I can still hear him say, “Hey Disco how are you?” West Coast Eagles player Nic Naitanui shared an image of the cricket legend on Twitter in light of the news. Australian actor Hugh Jackman, like most, sais he was in a state of shock. “Like you all I am in shock to wake to the news that @ShaneWarne had passed away. I’m grateful to have known him, and to have witnessed his once in a generation talent,” Jackman wrote on Twitter. “My heartfelt sympathies to his family and close friends at this incredibly difficult time. Rest well Shane.” Model Lara Worthington shared some poignant words on her Instagram story. “Ohhh I can’t believe this... You were such a huge part of my life. So fiercely protective and always the gentleman. You changed our world! I will miss you,” she wrote accompanying a photo of the pair together.","image_url":"https://images.perthnow.com.au/publication/C-5939712/e48a1fb6fe31d73f69a1ef015362f29c138d114e-16x9-x23y5w507h285.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Ultimate magician of cricket’s ultimate magic - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9zaGFuZS13YXJuZS11bHRpbWF0ZS1tYWdpY2lhbi1vZi1jcmlja2V0cy11bHRpbWF0ZS1tYWdpYy03ODAxNTA0L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne: Ultimate magician of cricket’s ultimate magic  The Indian ExpressShane Warne: The greatest ever spinner, and so, so much more  Cricket365.comLegendary Australian spinner Shane Warne passes away aged 52 | Cricbuzz.com - Cricbuzz  CricbuzzAustralian cricket icon Shane Warne passes away at 52  The Indian ExpressShane Warne - The wizard who glorified spin bowling  MoneycontrolView Full coverage on Google News","content":null,"pubDate":"2022-03-05 00:54:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Warne's mum expresses shock over son's death","link":"https://wwos.nine.com.au/cricket/shane-warne-death-mother-shocked-as-tributes-flow-around-the-world/8c44ebe5-356b-4cda-9545-355375c5b491","keywords":null,"creator":["wwos"],"video_url":null,"description":"Shane Warne's parents have expressed shock at the passing of their son who died of a suspected heart attack while in Thailand.","content":"Shane Warne's parents have expressed shock at the passing of their son who died of a suspected heart attack while on holiday in Thailand.Not long after the 52-year-old's death was confirmed, Warne's mother Bridgette spoke briefly to The Herald Sun.\"We're just in shock,\" she said outside her home, before adding \"we're OK\".READ MORE: How 'shocked' Mark Taylor found out about Warne's deathREAD MORE: Cummins' powerful tribute to 'all-time favourite' WarneREAD MORE: Ten of the best from Shane Warne's illustrious careerWarne's family has been offered a state funeral by Victorian Premier Daniel Andrews.\"To us, he was the greatest – but to his family, he was so much more,\" Mr Andrews said.\"Our hearts are breaking for Shane's family and friends – and they are in the thoughts of all Victorians.\"I have offered a state funeral to his family so Victorians can pay tribute to his legacy and contribution to our state, community and country.\"Tributes have poured in from all over the cricket world in the wake of Warne's death, with his biggest rivals and former teammates all shaken by the news.Warne was on holiday with friends in Thailand's resort island Koh Samui when he was found unresponsive. The group of mates performed CPR before an ambulance took him to hospital where he was pronounced dead.Media reports state Warne's manager Andrew Neophitou performed CPR before the ambulance arrived.According to Reuters, Warne's body was transferred from the Thai International Hospital to another hospital for autopsy and his friends would be questioned by police on Saturday. There were no signs of foul play.https://twitter.com/CricketAus/status/1499841086402953217?ref_src=twsrc%5Etfwhttps://twitter.com/sachin_rt/status/1499766592413962243https://twitter.com/gilly381/status/1499782599903887364https://twitter.com/patcummins30/status/1499779186021617670https://twitter.com/GNev2/status/1499772266682404876https://twitter.com/rashidkhan_19/status/1499787821753663489https://twitter.com/sherryontopp/status/1499786099895730176https://twitter.com/dizzy259/status/1499845048443101187https://twitter.com/BrianLara/status/1499767651899432963https://twitter.com/ScottMorrisonMP/status/1499885123256614913?ref_src=twsrc%5Etfwhttps://twitter.com/TheRealBozza/status/1499868672046759938?ref_src=twsrc%5Etfwhttps://twitter.com/JimmyBarnes/status/1499892172489117696?ref_src=twsrc%5Etfwhttps://twitter.com/bowlologist/status/1499873661863411715?ref_src=twsrc%5Etfwhttps://twitter.com/MickJagger/status/1499832978368778248?ref_src=twsrc%5Etfwhttps://twitter.com/Joeingles7/status/1499757565596430344?ref_src=twsrc%5Etfwhttps://twitter.com/RealHughJackman/status/1499770253852696577?ref_src=twsrc%5Etfwhttps://twitter.com/sallypearson/status/1499824873501184001?ref_src=twsrc%5EtfwThe Australian men's and women's teams will wear black armbands and pause for a moments silence before their respective matches in Pakistan and at the ICC Women's One-Day World Cup in New Zealand today.\"Shane Warne is one of cricket's true legends. The outpouring of shock and sadness at this news is testament to the esteem in which he is held across the world,\" said Cricket Australia Chair Lachlan Henderson.\"Arguably the greatest and most influential bowler the world has seen, Shane has been a hero and inspiration to millions of cricketers everywhere.\"He created cult status for leg spin bowling at a time that pace bowlers dominated the game.\"This has been a tragic couple of days with the passing of Rod and Shane and we continue to acknowledge their extraordinary impact on cricket in Australia and the legacies they leave. They were giants of the game with personalities to match.\"Our thoughts are with Shane's family and particularly his children Jackson, Brooke and Summer.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-03-05 00:43:42","full_description":"Shane Warne's parents have expressed shock at the passing of their son who died of a suspected heart attack while on holiday in Thailand . Not long after t he 52-year-old's death was confirmed, Warne's mother Bridgette spoke briefly to The Herald Sun. \"We're just in shock,\" she said outside her home, before adding \"we're OK\". READ MORE: How 'shocked' Mark Taylor found out about Warne's death READ MORE: Cummins' powerful tribute to 'all-time favourite' Warne READ MORE: Ten of the best from Shane Warne's illustrious career Warne's family has been offered a state funeral by Victorian Premier Daniel Andrews. \"To us, he was the greatest – but to his family, he was so much more,\" Mr Andrews said. \"Our hearts are breaking for Shane's family and friends – and they are in the thoughts of all Victorians. \"I have offered a state funeral to his family so Victorians can pay tribute to his legacy and contribution to our state, community and country.\" Tributes have poured in from all over the cricket world in the wake of Warne's death, with his biggest rivals and former teammates all shaken by the news. Warne was on holiday with friends in Thailand's resort island Koh Samui when he was found unresponsive. The group of mates performed CPR before an ambulance took him to hospital where he was pronounced dead. Media reports state Warne's manager Andrew Neophitou performed CPR before the ambulance arrived. According to Reuters, Warne's body was transferred from the Thai International Hospital to another hospital for autopsy and his friends would be questioned by police on Saturday. There were no signs of foul play. The Australian men's and women's teams will wear black armbands and pause for a moments silence before their respective matches in Pakistan and at the ICC Women's One-Day World Cup in New Zealand today. \"Shane Warne is one of cricket's true legends. The outpouring of shock and sadness at this news is testament to the esteem in which he is held across the world,\" said Cricket Australia Chair Lachlan Henderson. \"Arguably the greatest and most influential bowler the world has seen, Shane has been a hero and inspiration to millions of cricketers everywhere. \"He created cult status for leg spin bowling at a time that pace bowlers dominated the game. \"This has been a tragic couple of days with the passing of Rod and Shane and we continue to acknowledge their extraordinary impact on cricket in Australia and the legacies they leave. They were giants of the game with personalities to match. \"Our thoughts are with Shane's family and particularly his children Jackson, Brooke and Summer.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/03/414852/050322warneobit5.png","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shock and tributes as Aussie cricket great Shane Warne dies on Koh Samui","link":"https://www.bangkokpost.com/sports/2274311/shock-and-tributes-as-aussie-cricket-great-shane-warne-dies-on-koh-samui","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: Australian star Shane Warne -- one of the greatest Test players of all time -- has died of a suspected heart attack aged just 52, sparking an outpouring of grief from fellow cricketers, celebrities and politicians.","content":null,"pubDate":"2022-03-05 00:35:00","full_description":"SYDNEY: Australian star Shane Warne -- one of the greatest Test players of all time -- has died of a suspected heart attack aged just 52, sparking an outpouring of grief from fellow cricketers, celebrities and politicians. Warne a larger-than-life character whose tally of 708 Test wickets has been surpassed only by fellow spinner Muttiah Muralitharan, was found unresponsive at a luxury resort in Koh Samui on Friday. \"Shane was found unresponsive in his villa and despite the best efforts of medical staff, he could not be revived,\" a statement from his management company said. A Thai medical source told AFP that companions and emergency staff performed cardiopulmonary resuscitation but to no avail. His body was brought to the Thai International Hospital Samui at around 6pm from Samujana Villas, northeast of Koh Samui, medical staff said. The announcement came just hours after the death was announced of fellow Australian great Rod Marsh, one of cricket's outstanding wicketkeepers -- with Warne himself tweeting a tribute. As Australia awoke to the news on Saturday, fans began laying flowers at the Melbourne Cricket Ground, where there is a statue in his honour. Credited with reviving the art of leg-spin, Warne was part of a dominant Australian Test team in the 1990s and 2000s and helped his country win the 1999 limited-overs World Cup. Australian captain Pat Cummins, currently leading the team on a tour of Pakistan, said he was \"a hero\" to the current generation of cricketers. \"The loss that we are all trying to wrap our heads around is huge,\" he said in a video message. \"The game was never the same after Warnie emerged, and the game will never be the same after his passing.\" Warne's inestimable impact was reflected by his inclusion in a list of the Wisden Cricketers of the 20th Century, alongside Donald Bradman, Garfield Sobers, Jack Hobbs and Viv Richards. West Indian great Richards said he was \"shocked to the core\". \"There are no words to describe what I feel right now, he tweeted. Bursting onto the scene as a brash young player with a shock of blond hair, Warne became almost as well known for a colourful life away from cricket as he was for his exploits on the field. Both he and Australia team-mate Mark Waugh were fined for accepting money from a bookmaker and Warne was suspended for 12 months after failing a drugs test on the eve of the 2003 World Cup in South Africa, having taken a diuretic. The first bowler to take 700 Test wickets with an assortment of leg-breaks, googlies, flippers and his own \"zooters\", Warne retired from Australia duty in 2007 following a 5-0 series win at home to arch-rivals England. He played 145 Tests in total over a 15-year career, taking 708 wickets, and was also a useful lower-order batsman, with a highest Test score of 99. In addition to his international exploits, Warne also enjoyed a successful career with his Australian state side Victoria. And while his private life effectively ruled him out of captaining Australia, for all his acknowledged tactical acumen, Warne did skipper English county team Hampshire. Following his international retirement Warne continued to star on the Twenty20 franchise circuit, appearing for Rajasthan Royals in the Indian Premier League and his home town Melbourne Stars in Australia's Big Bash League. He subsequently became a highly regarded television commentator and pundit, renowned for his forthright opinions. Warne was also involved with team coaching -- most recently at London Spirit in England's new Hundred competition -- and he worked individually too with current-day leg-spinners. Warne was divorced from wife Simone Callahan, with whom he had three children. He also had high-profile relationship with British actress Liz Hurley. India batting great Sachin Tendulkar wrote on Twitter of his ex-rival: \"Shocked, stunned & miserable... Will miss you Warnie. There was never a dull moment with you around.\" Former Australia team-mate Adam Gilchrist said he was \"numb\". \"The highlight of my cricketing career was to keep wicket to Warnie. Best seat in the house to watch the maestro at work.\" His death also attracted the attention of Rolling Stones frontman Mick Jagger, a big cricket fan, who said he was \"so saddened\". \"He brought such joy to the game and was the greatest spin bowler ever,\" said the English singer, while British Prime Minister Boris Johnson said he was \"totally shocked\". \"A cricketing genius and one of the nicest guys you could meet, who also did a lot to help disadvantaged kids into sport,\" said Johnson.","image_url":null,"source_id":"bangkokpost","country":["thailand"],"category":["sports"],"language":"english"},{"title":"How Warne’s body will be brought home","link":"https://www.news.com.au/sport/cricket/rest-in-peace-king-australian-captain-pat-cummins-responds/news-story/360acc5bd69b92137d729a441126d76b","keywords":null,"creator":null,"video_url":null,"description":"Australian officials will fly to Thailand on Saturday to retrieve the body of cricket legend Shane Warne.","content":null,"pubDate":"2022-03-05 00:20:00","full_description":"Australian officials will fly to Thailand on Saturday to retrieve the body of cricket legend Shane Warne. Warne has died of a suspected heart attack at the age of 52. He was found unresponsive at a villa in Thailand where he had been staying with friends, and could not be revived. Foreign Affairs Minister Marise Payne confirmed Department of Foreign Affairs and Trade officials had been in touch with Warne’s travelling companions, and would travel to Koh Sumai to “provide further assistance”. Warne has been taken to a local hospital for an autopsy, and will then be repatriated ahead of an expected state funeral. “DFAT is working with Thai authorities to confirm arrangements following his passing, assist with his repatriation, and provide other assistance on the ground,” Senator Payne said. Warne’s family will be offered a state funeral, with Prime Minister Scott Morrison describing him as one of the nation’s greatest cricketers and characters. “Australians have woken in shock and sadness to the awful news of the death of Shane Warne, aged just 52,” Mr Morrison said. “Shane was one of our greatest cricketers of all time, one of only a few that could approach the extraordinary achievements of the great Don Bradman.” “His achievements were the product of his talent, discipline and passion for the game he loved,” the Prime Minister said. “But Shane was more than this to Australians. He was one of our nation’s greatest characters. “His humour, his passion, his irreverence, his approachability ensured he was loved by all.” Mr Morrison said all Australians loved Shane Warne. “We are all bewildered today by this sad and sudden loss,” he said. “And for this to happen the day after losing the indomitable Rod Marsh, it doesn’t seem imaginable.” Australian Test Captain Pat Cummins released an emotional tribute following the cricket legend’s sudden death. Cummins recorded a video statement from his hotel room in Pakistan, where Australia is in the middle of a Test match. “On behalf of the entire playing group and support staff here in Pakistan, I want to express our shock and sadness over Shane’s sudden passing,” he said. “We are all numbed by the news. Shane was a once-in-a-century cricketer and his achievements will stand for all time, but apart from the wickets he took and the games he helped Australia win, what he did was draw so many people to the sport. “So many of us in the playing group grew up idolising him and fell in love with this great sport as a result, while many of our support staff either played with him or against him. “It has been a terrible couple of days for Australian cricket with the passing of Rod Marsh and now Shane. Our thoughts are with both families and, in Shane’s case, particularly with his parents Keith and Bridgette, his brother Jason and his children Jackson, Summer and Brooke. “The game of cricket was never the same after Shane emerged, and it will never be the same now he has gone. Rest in peace, King.” Warne’s death was the second blow for Australian cricket in 24 hours after the death of wicketkeeping great Rod Marsh. Steve Smith, also in Pakistan with the national team, said it was “hard to fathom that we’ve lost two Australian legends within 24 hours”. Opening batter David Warner said: “Two legends of our game have left us too soon. I’m lost for words, and this is extremely sad. “My thoughts and prayers go out to the Marsh and Warne family. I just cannot believe it. RIP, you will both be missed.” Several other Australian cricketers including Nathan Lyon took to social media to express their shock and sadness at Warne’s death. “Absolutely lost for words. The true GOAT. RIP Warnie,” Lyon said. Three of Shane Warne’s mates battled for 20 minutes to save his life after the cricket legend died on a holiday from a suspected heart attack. A spin king on the pitch and a playboy known for his love of cigarettes and beer off it, here’s a look at the incredible life and times of Shane Warne. Shane Warne was a larger than life character who will be remembered as much for his off-field charisma as his on-field magic.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne: Cricket legend’s parents speak out following their son’s shock death","link":"https://thewest.com.au/sport/shane-warne-cricket-legends-parents-speak-out-following-their-sons-shock-death-c-5939915","keywords":null,"creator":["Owen Leonard"],"video_url":null,"description":"Shane Warne’s parents have spoken of their shock at the passing of their beloved son who died of a suspected heart attack while on holiday in Thailand.","content":null,"pubDate":"2022-03-05 00:16:43","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5939915/7eb84e8a578c86a3ab26244f85f3e288564b61ff-16x9-x0y55w2041h1148.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne’s glamorous dating life","link":"https://www.news.com.au/sport/cricket/shane-warnes-glamorous-dating-life-included-sad-breakup-with-liz-hurley/news-story/59a3a1087e67cd3307831c77b411f1f3","keywords":null,"creator":null,"video_url":null,"description":"Shane Warne lived an illustrious life that brimmed with both cricket greatness and a celebrity status usually reserved for Hollywood actors and rockstars.","content":null,"pubDate":"2022-03-04 23:54:00","full_description":"Shane Warne lived an illustrious life that brimmed with both cricket greatness and a celebrity status usually reserved for Hollywood actors and rockstars. In the years that followed the breakdown of Warne’s 10-year marriage to Simone Callahan, who he shared three children with, the star leg-spinner was linked to a string of glamorous, high-profile women. News of his death shocked the world on Saturday morning after he was found unresponsive in a Thailand villa, suffering a suspected heart attack. Warne and Callahan got married in 2005 and were together for a decade before splitting up shortly before the 2005 Ashes series. In an interview on Fox Cricket over summer Warne spoke about how his marriage break-up was the “lowest” moment of his life . “Getting divorced was a difficult time in my life and for my children — and it was my fault,’’ Warne said. “So I have to live with that for the rest of my life ... it wasn’t easy. “A week before the Ashes series to do that, and then have to drag myself off the canvas and get out there and play in 2005, play against a quality England side … to have the Barmy Army for six hours a day, not just 10 minutes, singing songs, singing ‘Where’s your missus gone?’ “That was the lowest point in my life and then I had to go out and play an Ashes series so that was really tough.” Despite reported attempts to repair the relationship, Callahan and Warne couldn’t reconcile and the cricket icon embarked on a series of high-profile relationships with other women. Between 2011-2013, he dated British actor Liz Hurley and spontaneously proposed to her on James Packer’s boat in 2011. In Warne’s autobiography, No Spin , he described their relationship as the “happiest years of my life”. They split before making it down the aisle, with the romance ultimately “fizzling out”. Warne said there was “no single, clear reason” why their relationship ended. It was suspected Hurley landing a lead role on TV series The Royals played a big part because of the new demands on her time and how little they saw each other. Warne also reportedly dated model, DJ and reality show contestant Emily Scott, with their relationship ending in September 2014 after a few months. In May of that year, Warne tweeted: “Wow, 8 years of friendship, a full moon party & attending a mates 50th turns into us dating? What's next, down on a knee!” While their relationship was brief, it was enough time for it to have its own scandal or two. In July 2014, Warne was pictured with Sophie Monk, but he strenuously denied there was anything romantic going on between the two. Warne previously confessed to using Tinder to meet women, and in 2015 met up with a single mum named Kim McGrath . In 2016 Warne was reportedly dating American student Kathryn Long, who was in her early 20s. In the same year he was linked with 24-year-old Simone Toon and also took to social media to accuse someone of tipping off the paparazzi when he arrived at Brynne Edelsten’s home for a “nightcap” at 1am after a charity event. “After a fun night raising money for breast cancer in Geelong last night, me & a few friends plus Brynne Edelsten went out for a couple of drinks,” Warne wrote on social media at the time. “Brynne then invited me back to her place around 1am for a nightcap, when I arrived, paparazzi were conveniently waiting outside her home to get the pic, coincidence? I left instantly and thought how sad is that!” In 2017 Warne was romantically linked to model Emily Sears, with the pair spotted together at a restaurant in Los Angeles. They reportedly began dating in March of 2017, and were more serious by June. Sears shared her grief over Warne’s death Saturday morning, posting to Instagram: “Woke up to the horrible news RIP Shane Warne you were a great mate and a legendary Aussie. I’m in shock and heartbroken. I don’t have words right now #ripshanewarne.” Three of Shane Warne’s mates battled for 20 minutes to save his life after the cricket legend died on a holiday from a suspected heart attack. Shane Warne, one of the most influential figures in Australian sport, has died aged 52 of a suspected heart attack in Thailand. Jackson Warne recently said he wished he wasn’t the son of cricket icon Shane, but their complex relationship was much more than that.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"The world reacts to Shane Warne's death","link":"https://thewest.com.au/sport/cricket/the-world-reacts-to-shane-warnes-death-c-5939827","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"How the world has reacted to the death of Australian cricket great Shane Warne.","content":null,"pubDate":"2022-03-04 23:53:08","full_description":"THE WORLD REACTS TO SHANE WARNE'S DEATH:- * \"I thought nothing could ever happen to him. He lived more in his life than most people would live in 20.\" - Glenn McGrath * \"He has had a turbulent life but a very full life ... you just felt, I certainly did, he would go on forever.\" - Mark Taylor * \"Shocked, stunned & miserable ... there was never a dull moment with you around.\" - Sachin Tendulkar * \"I am shocked to the core. This can't be true.\" - Viv Richards * \"We have lost one of the greatest sportsmen of all time!\" - Brian Lara * \"The game of cricket was never the same after Shane emerged and it will never be the same now he has gone.\" - Pat Cummins * \"He brought such joy to the game and was the greatest spin bowler ever.\" - Mick Jagger * \"Heaven will be a lively place now the King has arrived.\" - Michael Vaughan * \"Please no ....heartbroken. Already miss \"The King.\" - Brendon McCullum * \"Numb.\" - Adam Gilchrist * \"I cannot process the passing of this great of our sport.\" - Virat Kohli * \"The man who made spin cool.\" - Virendar Sehwag * \"It's just unfathomable.\" - Mark Waugh * \"The RockStar of cricket! Gone too soon.\" - Brett Lee * \"Genius player. Grand company. Loyal friend.\" - Russell Crowe * \"The biggest superstar of my generation gone.\" - Waqar Younis * \"Played hard on field and was one of the first to have a beer with you after.\" - Jacques Kallis","image_url":"https://images.thewest.com.au/publication/C-5939827/67486635e9147ce44d1187a6346a3d2be5e11384-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"The world reacts to Shane Warne's death","link":"https://www.perthnow.com.au/sport/cricket/the-world-reacts-to-shane-warnes-death-c-5939825","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"How the world has reacted to the death of Australian cricket great Shane Warne.","content":null,"pubDate":"2022-03-04 23:53:08","full_description":"THE WORLD REACTS TO SHANE WARNE'S DEATH:- * \"I thought nothing could ever happen to him. He lived more in his life than most people would live in 20.\" - Glenn McGrath * \"He has had a turbulent life but a very full life ... you just felt, I certainly did, he would go on forever.\" - Mark Taylor * \"Shocked, stunned & miserable ... there was never a dull moment with you around.\" - Sachin Tendulkar * \"I am shocked to the core. This can't be true.\" - Viv Richards * \"We have lost one of the greatest sportsmen of all time!\" - Brian Lara * \"The game of cricket was never the same after Shane emerged and it will never be the same now he has gone.\" - Pat Cummins * \"He brought such joy to the game and was the greatest spin bowler ever.\" - Mick Jagger * \"Heaven will be a lively place now the King has arrived.\" - Michael Vaughan * \"Please no ....heartbroken. Already miss \"The King.\" - Brendon McCullum * \"Numb.\" - Adam Gilchrist * \"I cannot process the passing of this great of our sport.\" - Virat Kohli * \"The man who made spin cool.\" - Virendar Sehwag * \"It's just unfathomable.\" - Mark Waugh * \"The RockStar of cricket! Gone too soon.\" - Brett Lee * \"Genius player. Grand company. Loyal friend.\" - Russell Crowe * \"The biggest superstar of my generation gone.\" - Waqar Younis * \"Played hard on field and was one of the first to have a beer with you after.\" - Jacques Kallis","image_url":"https://images.perthnow.com.au/publication/C-5939825/67486635e9147ce44d1187a6346a3d2be5e11384-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne death: Robert Craddock on covering a career of drama, excitement and controversy","link":"https://thewest.com.au/sport/cricket/inside-life-on-the-road-covering-shane-warnes-career-of-drama-excitement-and-controversy-c-5938692","keywords":null,"creator":["Robert Craddock"],"video_url":null,"description":"Covering a cricket tour with Shane Warne came with drama, excitement, shocks, and controversy. And sometimes all those things happened on the same day, writes Robert Craddock.","content":null,"pubDate":"2022-03-04 23:36:48","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5938692/901002476bd011dde7dd292927ec9fe852ccc105-16x9-x0y0w861h484.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shane Warne was a man ‘everyone can relate to’ says Ben Stokes who remembers cricket legend’s ‘love and desire for the game’","link":"https://talksport.com/sport/cricket/1057207/shane-warne-ben-stokes-cricket-england-austrialia-antigua/","keywords":["Cricket","Sport","Australia Cricket","England Cricket"],"creator":["Connor Andrews"],"video_url":null,"description":"Shane Warne was a man ‘everyone can relate to’ whose ‘love and desire for the game’ shone through according to England vice captain Ben Stokes. Cricket legend Warne has sadly passed away at the age of 52, with tributes not only flooding in for an incredible player, but an amazing person. Warne was adored on […]","content":"Shane Warne was a man ‘everyone can relate to’ whose ‘love and desire for the game’ shone through according to England vice captain Ben Stokes. Cricket legend Warne has sadly passed away at the age of 52, with tributes not only flooding in for an incredible player, but an amazing person. The cricketing world is mourning the loss of WarneGETTY And Stokes has now joined Joe Root in paying tributeGetty Warne was adored on and off the pitch as an icon who did things his own way, widely regarded as one of, if not the best, bowlers cricket has ever produced. A household name as an adored character that transcended the sport, Warne’s impact has been shown far and wide across the globe following the news of his passing. England’s cricketers took time out ahead of their warm-up game in Antigua to remember the great with a minutes silence, and all-rounder Stokes has since spoken of his shock. “Not everyone in the dressing room knew him but, you know, it’s Shane Warne,” Stokes said.  “We all grew up watching him play, he’s made some amazing memories on the cricket field, growing up watching.  “Everyone can relate to him, getting to know him personally, it was a bit of a shock and very sad. Most read in Cricket Emotional Gatting wishes he could hear Warne tell him how good THAT ball was one more time legend Entertainer, icon, true great - emotional tributes paid to Shane Warne on talkSPORT legend Shane Warne's career in numbers as cricket world mourns the loss of Australian hero special ‘The Question of Sport green room was in some state’ - McCoist on meeting Warne tribute England players pay their respects to Warne in Antigua after legend's shock death icon Warne transcended sport and counted Tyson, MJ, Sheeran and Kylie among his friends Stokes has very fond memories of one of his sporting idolsGetty And stressed that he was just one of many to be generously given time by WarneGetty “I’ll always remember the first association was at Rajasthan and I couldn’t believe how much of a badger [cricket enthusiast] he was.  “He’s done everything in the game and he’s been there done that in life as well but he still had the love and desire for the game as he had when he was playing.  “That’s quite rare in people like that who have achieved so much in their career and that’s where I said before he gave so much time to everyone who wanted his help, he gave his own time willingly as well so it’s a very sad loss.” Stokes made extra effort to stress how giving Warne was with his time, whilst also remembering fellow Aussie cricket legend Rod Marsh who passed away a day earlier. Warne will be fondly remembered by many, including StokesGetty “The news we had the day before with Marsh and then to hear about Shane today was devastating for the world of cricket,” Stokes said. “People like myself and plenty of other people around the world got to know him personally very well.  “It’s very sad but I think a reflection of him as a man but not only as a cricketer was shown today in the tributes that have been paid to him. “A legend of the game, one of the greats, and he gave so much time to everyone and that shouldn’t be overlooked.  “As great a player as he was, I think the man that he was needs to be respected as well.”","pubDate":"2022-03-04 23:23:27","full_description":"Shane Warne was a man ‘everyone can relate to’ whose ‘love and desire for the game’ shone through according to England vice captain Ben Stokes. Cricket legend Warne has sadly passed away at the age of 52, with tributes not only flooding in for an incredible player , but an amazing person. Warne was adored on and off the pitch as an icon who did things his own way, widely regarded as one of, if not the best, bowlers cricket has ever produced. A household name as an adored character that transcended the sport, Warne’s impact has been shown far and wide across the globe following the news of his passing. England’s cricketers took time out ahead of their warm-up game in Antigua to remember the great with a minutes silence , and all-rounder Stokes has since spoken of his shock. “Not everyone in the dressing room knew him but, you know, it’s Shane Warne,” Stokes said. “We all grew up watching him play, he’s made some amazing memories on the cricket field, growing up watching. “Everyone can relate to him, getting to know him personally, it was a bit of a shock and very sad. “I’ll always remember the first association was at Rajasthan and I couldn’t believe how much of a badger [cricket enthusiast] he was. “He’s done everything in the game and he’s been there done that in life as well but he still had the love and desire for the game as he had when he was playing. “That’s quite rare in people like that who have achieved so much in their career and that’s where I said before he gave so much time to everyone who wanted his help, he gave his own time willingly as well so it’s a very sad loss.” Stokes made extra effort to stress how giving Warne was with his time, whilst also remembering fellow Aussie cricket legend Rod Marsh who passed away a day earlier. “The news we had the day before with Marsh and then to hear about Shane today was devastating for the world of cricket,” Stokes said. “People like myself and plenty of other people around the world got to know him personally very well. “It’s very sad but I think a reflection of him as a man but not only as a cricketer was shown today in the tributes that have been paid to him. “A legend of the game, one of the greats, and he gave so much time to everyone and that shouldn’t be overlooked. “As great a player as he was, I think the man that he was needs to be respected as well.”","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Shane Warne death: Why there will never be another Warnie","link":"https://thewest.com.au/sport/cricket/shane-warne-death-why-there-will-never-be-another-warnie-c-5937120","keywords":null,"creator":["Jordan McArdle"],"video_url":null,"description":"Shane Keith Warne made cricket fun, bowling leg-spin cool and was a pure box-office entertainer who could draw a sell-out crowd on his own.","content":null,"pubDate":"2022-03-04 23:08:43","full_description":"There will never be another Warnie. Shane Keith Warne made cricket fun, bowling leg-spin cool and was a pure box-office entertainer who could draw a sell-out crowd on his own. Sure, he was controversial and unorthodox, but that’s what made him special. The larger-than-life figure leaves this world as Australia’s all-time leading Test wicket-taker and second most ever, with 708 scalps for in 145 matches, but that doesn’t even begin to scratch the surface of his impact on the game. Rourke Walsh Peter Law He was the player who made you stop what you’re doing when he had ball in hand because you knew something out of the ordinary was going to happen. Nobody could change the game quite like him. There was the ‘ball of the century’ to Mike Gatting at Old Trafford in 1993, the semi-final turning delivery to late South African captain Hansie Cronje in the ‘99 World Cup and countless more jaw-dropping feats, including knocking over Brendon McCullum during his later years in the Big Bash seconds after predicting it while mic’d up. It’s been more than 15 years since Warne sent down his last delivery at international level, and nearly a decade from when he bowed out altogether, but his inspiration to the generations of leg-spinners that followed is stronger than ever. Ask T20 World Cup-winning tweaker and Australia’s leading white-ball spinner Adam Zampa who he’s watched more than anyone on YouTube? Shane Warne. “I’ve watched that many videos of Warne and Stuart MacGill on YouTube, it’s not funny,’‘ Zampa, now 29, said as a 21-year-old. “There’s the greatest moments of Shane Warne, which goes for about 15 minutes. I watched that one about 100 times. Still do — but that’s just to get some goosebumps really.” You don’t even need to bother asking the nation’s best red-ball leg-spinning prospect Mitch Swepson, currently on tour in Pakistan and closing in on a Test debut. His action is a carbon copy of ‘The King’. Even down the grades and in parks, backyards and driveways around Australia and the world, there’s wannabe Warnie’s everywhere trying to bust out leg breaks or flippers to varying degrees of success but never as good as the real thing. The most remarkable thing about Shane Warne is that he didn’t want to be a cricketer as a kid growing up in Melbourne. Footy was his dream but that didn’t work out how he planned. “I had a letter from St Kilda footy club saying my services were no longer required after being there for nearly three years, and that was my dream shattered,” Warne recalled on Cricket Legends. Cricket was a different story, with Warne enjoying a meteoric rise from third grade at St Kilda to a Test debut against India at the SCG in the summer of 1991-92, sporting the peroxide blonde locks and chubby cheeks. He had his struggles early days and was in and out of the side before becoming a household name of Australian cricket and in the conversation to be the greatest player of all-time. His influence continued through coaching and commentary right up until his tragic death. But his career, and life in general, weren’t without hiccups. From the diet pills and bookmaker scandals, the infamous ‘can’t bowl, can’t throw’ comments which he denied, to partying, smoking and women, Warne was never too far away from the front page of a tabloid newspaper. Nobody can deny he lived his life to the fullest, on and off the field, and did things his way. That’s why we love him.","image_url":"https://images.thewest.com.au/publication/C-5937120/b77a579d5978e35078b57ff8e548c5329f7b1683-16x9-x0y126w2073h1166.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Tributes pour in for late maestro Warne","link":"https://www.perthnow.com.au/sport/cricket/tributes-pour-in-for-late-maestro-warne-c-5939444","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"Former Australian cricket teammates of Shane Warne have paid tribute to the legendary spinner, who died suddenly in Thailand aged 52.","content":null,"pubDate":"2022-03-04 23:00:37","full_description":"Mark Taylor thought Shane Warne's \"turbulent life\" would just keep rolling on forever. But now, the former Australian captain is like the rest of his teammates: numbed at news of Warne's death. \"He has had a turbulent life but a very full life,\" Taylor told the Nine Network on Saturday. \"He had been through all sorts of scandals. \"He mesmerised us with his bowling and his competitive nature on the field. \"We have loved that real ocker side of Shane Warne. \"You just felt, I certainly did, he would go on forever. \"It is a huge shock for me and it is a huge shock for the cricketing world.\" Warne, 52, died suddenly of a suspected heart attack while holidaying on the Thailand island of Koh Samui. Another of Warne's Australian captains, Steve Waugh, said he had \"so many memories and moments that will never be forgotten\" of the legspinner. \"It was a privilege and a pleasure to play alongside you,\" Waugh posted on Instagram. Glenn McGrath said he was \"absolutely devastated\". Like Taylor, he believed \"nothing could ever happen to him\". \"Warnie was larger than life ... he lived more in his life than most people would live in 20,\" McGrath said. \"He was the ultimate competitor. He thought the game was never lost, that he could turn it around and bring us to victory, which he did so many times. \"I think he lived his life the same way. There seemed to be never a dull moment. \"Rest In Peace my good mate, there'll never again be anyone like you.\" Mark Waugh described Warne as the \"ultimate entertainer\" both on and off the field. \"It's just unfathomable to lose another great of our cricket family,\" Waugh posted on Twitter. Adam Gilchrist said he was \"numb\". \"The highlight of my cricketing career was to keep wicket to Warnie. Best seat in the house to watch the maestro at work.\" Darren Lehmann, a teammate of Warne who later became Australia's coach, said he was devastated. \"Shane was the most generous, fun-loving superstar of our game ... he was always charismatic caring and true friend,\" Lehmann posted on Twitter. Former Australia quick Brett Lee hailed Warne as the \"rock star\" of cricket. \"Can't believe it. The greatest bowler to play the game ever! The RockStar of cricket ! Gone too soon,\" Lee posted on Twitter.","image_url":"https://images.perthnow.com.au/publication/C-5939444/f355a7df20e0a179dd088f2038f2c05a2ef478b9-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"}]}