{"newsArray":[{"article_id":"81536ca1d4d9593b5c5460dbaa096d03","title":"Sports Highligts: হার্দিকের আইপিএল দল নিয়ে ধোঁয়াশা, ভারতের জয়, খেলার সেরা খবরের একঝলক এক নজরে","link":"https://bengali.abplive.com/sports/sports-highlights-know-latest-updates-of-teams-players-matches-and-other-highlights-27-december-1027074","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"মুম্বই: আইপিএলে কোনও দলে হার্দিক, তা নিয়ে ধোঁয়াশা চরমে। শেষে মুম্বইতেই কি বঢোদরার অলরাউন্ডার। গুজরাতের নতুন অধিনায়ক কে? কোন কোন তারকাকে ছেড়ে দিল কেকেআর? এক নজরে দিনের সেরা খেলার খবরের এক ঝলক - ভারতের জয় টানা দ্বিতীয় জয়। পাঁচ ম্যাচের টি-টােয়েন্টি সিরিজের (T20 Series) দ্বিতীয় ম্যাচেও জয় ছিনিয়ে নিল ভারতীয় দল (Indian Cricket Team)। অজিদের বিরুদ্ধে ৪৪ রানের ব্যবধানে জয় ছিনিয়ে নিল টিম ইন্ডিয়া। ২৩৬ রান তাড়া করতে নেমে ২০ ওভারে ৯ উইকেট হারিয়ে ১৯১ রানেই আটকে গেল অস্ট্রেলিয়া। বল হাতে ভারতীয় বোলারদের মধ্যে সর্বাধিক ৩টি করে উইকেট নেন রবি বিষ্ণোই ও প্রসিদ্ধ কৃষ্ণ। ভারতের হয়ে অর্ধশতরান করেন যশস্বী জয়সওয়াল, ঈশান কিষাণ ও রুতুরাজ গায়কোয়াড। ২৫ বলে ৫৩ রান করে ম্য়াচের সেরা হন জয়সওয়াল। ৯ বলে ৩১ রানের ইনিংস খেলেন রিঙ্কু সিংহ। মুম্বইয়ে হার্দিক? আইপিএলে গুজরাত টাইটান্স (Gujrat Titans) ও মুম্বই ইন্ডিয়ান্সের (Mumbai Indians) দল নিয়েই গত কয়েকদিন সবচেয়ে বেশি আগ্রহ দেখিয়েছিলেন ক্রিকেটপ্রেমীরা। আর তার নেপথ্যে ছিলেন হার্দিক পাণ্ড্য (Hardik Pandya)। প্রথমে খবর ছিল যে হার্দিক মুম্বইয়ে তাঁর পুরনো দলে ফিরছেন। আজ যদিও গুজরাত টাইটান্স যখন তাঁদের ক্রিকেটারদের তালিকা প্রকাশ করে তখন দেখা গেল যে হার্দিককে (Hardik Pandya) দলে রেখেছে তারা। কিন্তু রান বাড়তে বাড়তেই ফের গল্পে নতুন মোড়। সূত্রের খবর, হার্দিককে দলে ফেরাচ্ছে নীতা আম্বানির দল। তবে কোনও ক্রিকেটারের বদলে নয়। সরাসরি টাকার বিনিময়ে গুজরাত ফ্র্যাঞ্চাইজি থেকে হার্দিককে দলে নিয়ে নিয়েছে মুম্বই শিবির। বঢোদরা অলরাউন্ডার নাকি সরকারি সই সবুদও করে ফেলেছেন। নতুন মরসুমে রোহিত শর্মার নেতৃত্বে নিজের প্রথম আইপিএল দল মুম্বইয়ের হয়েই খেলবেন হার্দিক। অন্যদিকে, কানাঘুষো শোনা যাচ্ছে যে নতুন মরসুমের জন্য় গুজরাতের অধিনায়ক হচ্ছেন শুভমন গিল। প্রায় ৭২ ঘণ্টার নাটকে যেন যবনিকা পতন হল প্রায়।  কাকে ছাড়ল কেকেআর? কাকেই বা ধরে রাখল?  আইপিএলে (IPL 2024) নতুন মরসুমের আগে মোট ১২ জন প্লেয়ারকে ছেড়ে দিল কেকেআর(Kolkata Knight Riders) । তাঁদের মধ্যে রয়েছেন- শাকিব আল হাসান, লিটন দাস, ডেভিড উইজি, আর্য দেশাই, নারায়ণ জগদীশান, কুলওন্ত খেজরিওয়ালিয়া, শার্দুল ঠাকুর, লকি ফার্গুসন, উমেশ যাদব, টিম সাউদি, জনসন চার্লস। কেকেআর শিবির ধরে রাখল যাঁদের তাঁদের নাম দেখে নেওয়া যাক - নীতিশ রানা, শ্রেয়স আইয়ার, রিঙ্কু সিংহ, রহমনউল্লাহ গুরবাজ, সুনীল নারাইন, জেসন রয়, সুয়াশ শর্মা, অনুকূল রয়, আন্দ্রে রাসেল, ভেঙ্কটেশ আইয়ার, হর্ষিত রানা, বৈভব আরোরা, বরুণ চক্রবর্তী। প্রাণ বাঁচালেন শামি বাইশ গজের বাইরেও ফের নামভূমিকায় ক্রিকেটার মহম্মদ শামি। উত্তরাখণ্ডে দুর্ঘটনাগ্রস্তের কাছে ত্রাতা হয়ে উঠলেন তিনি। পাহাড়ের ঢাল বেয়ে গড়িয়ে পড়া গাড়ির যাত্রীকে রক্ষা করতে ছুটে গেলেন শামি। নিরাপদে উদ্ধারও করে আনলেন দুর্ঘটনাগ্রস্তকে। আশেপাশের মানুষও সাহায্যে এগিয়ে এসেছিলেন বলে যদিও জানিয়েছেন শামি। কিন্তু নিজের গরজে যেভাবে দুর্ঘটনাগ্রস্ত ব্যক্তিকে রক্ষা করেন তিনি, তাতে এই মুহূর্তে শামির প্রশংসায় পঞ্চমুখ নেটদুনিয়া।    ","content":"মুম্বই: আইপিএলে কোনও দলে হার্দিক, তা নিয়ে ধোঁয়াশা চরমে। শেষে মুম্বইতেই কি বঢোদরার অলরাউন্ডার। গুজরাতের নতুন অধিনায়ক কে? কোন কোন তারকাকে ছেড়ে দিল কেকেআর? এক নজরে দিনের সেরা খেলার খবরের এক ঝলক - ভারতের জয় টানা দ্বিতীয় জয়। পাঁচ ম্যাচের টি-টােয়েন্টি সিরিজের (T20 Series) দ্বিতীয় ম্যাচেও জয় ছিনিয়ে নিল ভারতীয় দল (Indian Cricket Team)। অজিদের বিরুদ্ধে ৪৪ রানের ব্যবধানে জয় ছিনিয়ে নিল টিম ইন্ডিয়া। ২৩৬ রান তাড়া করতে নেমে ২০ ওভারে ৯ উইকেট হারিয়ে ১৯১ রানেই আটকে গেল অস্ট্রেলিয়া। বল হাতে ভারতীয় বোলারদের মধ্যে সর্বাধিক ৩টি করে উইকেট নেন রবি বিষ্ণোই ও প্রসিদ্ধ কৃষ্ণ। ভারতের হয়ে অর্ধশতরান করেন যশস্বী জয়সওয়াল, ঈশান কিষাণ ও রুতুরাজ গায়কোয়াড। ২৫ বলে ৫৩ রান করে ম্য়াচের সেরা হন জয়সওয়াল। ৯ বলে ৩১ রানের ইনিংস খেলেন রিঙ্কু সিংহ। মুম্বইয়ে হার্দিক? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আইপিএলে গুজরাত টাইটান্স (Gujrat Titans) ও মুম্বই ইন্ডিয়ান্সের (Mumbai Indians) দল নিয়েই গত কয়েকদিন সবচেয়ে বেশি আগ্রহ দেখিয়েছিলেন ক্রিকেটপ্রেমীরা। আর তার নেপথ্যে ছিলেন হার্দিক পাণ্ড্য (Hardik Pandya)। প্রথমে খবর ছিল যে হার্দিক মুম্বইয়ে তাঁর পুরনো দলে ফিরছেন। আজ যদিও গুজরাত টাইটান্স যখন তাঁদের ক্রিকেটারদের তালিকা প্রকাশ করে তখন দেখা গেল যে হার্দিককে (Hardik Pandya) দলে রেখেছে তারা। কিন্তু রান বাড়তে বাড়তেই ফের গল্পে নতুন মোড়। সূত্রের খবর, হার্দিককে দলে ফেরাচ্ছে নীতা আম্বানির দল। তবে কোনও ক্রিকেটারের বদলে নয়। সরাসরি টাকার বিনিময়ে গুজরাত ফ্র্যাঞ্চাইজি থেকে হার্দিককে দলে নিয়ে নিয়েছে মুম্বই শিবির। বঢোদরা অলরাউন্ডার নাকি সরকারি সই সবুদও করে ফেলেছেন। নতুন মরসুমে রোহিত শর্মার নেতৃত্বে নিজের প্রথম আইপিএল দল মুম্বইয়ের হয়েই খেলবেন হার্দিক। অন্যদিকে, কানাঘুষো শোনা যাচ্ছে যে নতুন মরসুমের জন্য় গুজরাতের অধিনায়ক হচ্ছেন শুভমন গিল। প্রায় ৭২ ঘণ্টার নাটকে যেন যবনিকা পতন হল প্রায়। কাকে ছাড়ল কেকেআর? কাকেই বা ধরে রাখল? আইপিএল ে (IPL 2024) নতুন মরসুমের আগে মোট ১২ জন প্লেয়ারকে ছেড়ে দিল কেকেআর(Kolkata Knight Riders) । তাঁদের মধ্যে রয়েছেন- শাকিব আল হাসান, লিটন দাস, ডেভিড উইজি, আর্য দেশাই, নারায়ণ জগদীশান, কুলওন্ত খেজরিওয়ালিয়া, শার্দুল ঠাকুর, লকি ফার্গুসন, উমেশ যাদব, টিম সাউদি, জনসন চার্লস। কেকেআর শিবির ধরে রাখল যাঁদের তাঁদের নাম দেখে নেওয়া যাক - নীতিশ রানা, শ্রেয়স আইয়ার , রিঙ্কু সিংহ, রহমনউল্লাহ গুরবাজ, সুনীল নারাইন , জেসন রয়, সুয়াশ শর্মা, অনুকূল রয়, আন্দ্রে রাসেল , ভেঙ্কটেশ আইয়ার, হর্ষিত রানা, বৈভব আরোরা, বরুণ চক্রবর্তী। প্রাণ বাঁচালেন শামি বাইশ গজের বাইরেও ফের নামভূমিকায় ক্রিকেটার মহম্মদ শামি। উত্তরাখণ্ডে দুর্ঘটনাগ্রস্তের কাছে ত্রাতা হয়ে উঠলেন তিনি। পাহাড়ের ঢাল বেয়ে গড়িয়ে পড়া গাড়ির যাত্রীকে রক্ষা করতে ছুটে গেলেন শামি। নিরাপদে উদ্ধারও করে আনলেন দুর্ঘটনাগ্রস্তকে। আশেপাশের মানুষও সাহায্যে এগিয়ে এসেছিলেন বলে যদিও জানিয়েছেন শামি। কিন্তু নিজের গরজে যেভাবে দুর্ঘটনাগ্রস্ত ব্যক্তিকে রক্ষা করেন তিনি, তাতে এই মুহূর্তে শামির প্রশংসায় পঞ্চমুখ নেটদুনিয়া। var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-11-26 19:13:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/27/5765b3de7f4fe675a6e182f8a63cdb761701025531549206_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"d916377aac13671d6c071e52f4a50b73","title":"Aditi Ashok wins Ladies European Tour season-ending title","link":"https://www.hindustantimes.com/sports/others/aditi-ashok-wins-ladies-european-tour-season-ending-title-101701019988299.html","keywords":null,"creator":null,"video_url":null,"description":"India’s top woman golfer made a late surge to win the Andalucia Costa Del Sol Open in Spain by two shots for her fifth win on the tour","content":"Aditi Ashok showcased her game and grit, holding her nerves in the final holes to card a final round 66 and pull off an exciting two-shot victory over Dutch woman Anne Van Dam in the Andalucia Costa Del Sol Open, the year-ending tournament on the Ladies European Tour on Sunday. It has been a brilliant season for Aditi with the changes she had made to her swing clearly raising her game to another leve(Getty Images via AFP) The 25-year-old started and finished her season on LET in style, having won the opening event, the Magical Kenya Ladies Open, by nine shots in February. It is the biggest victory for the Bengaluru golfer, who pocketed a winner’s purse of € 97,500. We're now on WhatsApp. Click to join. Aditi finished on 17-under par (69, 68, 68, 66 =271), ahead of Anne (69, 71, 65, 68= 273). India’s Diksha Dagar was tied seventh at 10-under (72, 71, 68, 67= 278), though she finished third in the Race to Costa Del Sol (LET Order of Merit) rankings with Aditi, who played only eight events, fourth. Thailand’s Trichat Cheenglab won the title despite a tied 55th finish. It has been a brilliant season for Aditi with the changes she had made to her swing clearly raising her game to another level. Besides the two wins on LET this season, she was second in the Saudi Ladies International, third in the Lalla Meryem Cup, all in February, and won silver in the Hangzhou Asian Games. Tied second through the second and third rounds, Aditi trailed Dutch playing partner Anne Van Dam, a five-time winner on the LET who led by one shot until drama unfolded on the 15th hole leading to a rousing finish under the afternoon Spanish sun. Anne’s tee shot on the par-five hole veered to the right and settled amid stones next to a tree, forcing her to lay up on the fairway, find the fringe of the green with her third, and eventually saving par. Aditi, flawless from tee to green, birdied with a brilliant putt off at least 17 feet to tie for the lead. Her precision off the tee on the par-3 16th then left her with a two-footer for birdie while Anne’s tee shot spun back to 15 feet off the pin and she two-putted for par. The par-14 17th showcased Aditi’s skill and temperament. The driver off the tee and an accurate second shot left her with an 8-foot putt for birdie, which she sank. Her fourth birdie in five holes – she had five birdies on the back nine, including three in a row from the 15th to 17th – left her with a two-shot cushion going into the final hole. Anne was again frustrated after her 25-foot birdie attempt rolled to the left of the hole, leaving her with another par. The drama wasn’t over. On the 18th, Aditi found the fairway rough to the right and landed her second shot on the bunker, leaving her with a tricky third to get on the sloping green. Although Anne’s second shot landed nine feet off the pin, she needed a birdie and the Indian had to bogey to force a tie. But Aditi was creative with the wedge, aiming for the fringe of the green to get the ball to roll down the slope to three feet off the hole, sealing a great win. “I started slow and missed some birdies, but glad it picked up on the back nine,” a delighted Aditi said after receiving the winner’s trophy. “It was a great battle, especially Anna when she plays well...she is a great player.” Aditi (added: “She hit the trees and I made a great putt. That was the switch moment. And I made sure I had a good look at par on the 18th.” Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR N Ananthanarayanan N Ananthanarayanan has spent almost three decades with news agencies and newspapers, reporting domestic and international sport. He has a passion for writing on cricket and athletics. ...view detail Aditi Ashok","pubDate":"2023-11-26 18:27:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/11/26/1600x900/aditi_ashok_1701020049666_1701020049835.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5ae3676a2d246fd4b669e93c62deffc2","title":"WATCH: “We always find new methods to fail” – Zimbabwe captain Sikandar Raza after shock loss to Uganda","link":"https://3-mob.com/sport/watch-we-always-find-new-methods-to-fail-zimbabwe-captain-sikandar-raza-after-shock-loss-to-uganda/","keywords":["Cricket","Sport","Sikandar Raza","Zimbabwe Cricket"],"creator":["3-mob.com"],"video_url":null,"description":"Zimbabwe had no kind words for his side The post WATCH: “We always find new methods to fail” – Zimbabwe captain Sikandar Raza after shock loss to Uganda first appeared on Three Men On a Boat.","content":"Zimbabwe T20 international captain Sikandar Raza has spoken after his side’s shock loss to Uganda in the ICC Men’s T20 World Cup Qualifier Africa. The loss means Zimbabwe need results to go their way elsewhere for them to get a wicket to the main tournament next year. A dejected Raza did not have any kind of words for his side, who he said seemed to find ‘new methods to fail’. “The standard of cricket we are playing is quite tough, and difficult for watch,” the skipper said. He said in the interview that Zimbabwe seemed to bring its standards down against lesser teams which was a worry. Watch the while interview below:","pubDate":"2023-11-26 18:25:58","image_url":null,"source_id":"3mob","source_priority":1904716,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"0edc2d8b09bb0d9d48d327bc8ae880af","title":"India Beat Australia: দ্বিতীয় টি ২০ ম্যাচেও হার অস্ট্রেলিয়ার, ২-০ এগিয়ে গেল ভারত","link":"https://bangla.latestly.com/sports/cricket/india-beat-australia-in-second-t20-in-thiruvananthapuram-won-by-44-runs-266171.html","keywords":null,"creator":null,"video_url":null,"description":"দ্বিতীয় টি ২০ ম্যাচেও অস্ট্রেলিয়াকে হারিয়ে দিল ভারত। রবিবার থিরুভানাথাপুরমে প্রথম ইনিংসে ব্যাট করতে নেমে ২০ ওভারে মাত্র চার উইকেট হারিয়ে ২৩৫ রান করে ভারত। আর এই বিশাল রান তাড়া করতে নেমে ১৯১ রানে খেলা শেষ হয়ে যায় অস্ট্রেলিয়ার।","content":"থিরুভানাথাপুরম: দ্বিতীয় টি ২০ ম্যাচেও (2nd T20I) অস্ট্রেলিয়াকে হারিয়ে দিল ভারত (India beat Australia)। রবিবার থিরুভানাথাপুরমে (Thiruvananthapuram) প্রথম ইনিংসে ব্যাট করতে নেমে ২০ ওভারে মাত্র চার উইকেট হারিয়ে ২৩৫ রান করে ভারত। আর এই বিশাল রান তাড়া করতে নেমে ১৯১ রানে খেলা শেষ হয়ে যায় অস্ট্রেলিয়ার। প্রথম ইনিংসে দুর্দান্ত ব্যাটিং করে ভারতের শুরুটা ভালোই করেছিলেন যশস্বী জয়সওয়াল, ইশান কিষাণ ও ঋতুরাজ গায়কোয়াড়। যশস্বী ২৫ বলে ৯টি চার ও দুটি ছয় মেরে ৫৩ রান করেন। আর গায়কোয়াড় ৪৩ বলে তিনটি চার ও দুটি ছয় মেরে করেন ৫৮ রান। অন্যদিকে ইশান কিষাণের ব্যাট থেকে আসে ৩২ বলে ৫২। আর শেষদিকে রিঙ্কু সিং মাত্র ৯ বলে ৪টি চার ও দুটি ৬ মেরে ৩১ রান করে ভারতকে পৌঁছে দেয় ২৩৫-এ। এর জবাবে ব্যাট করতে নেমে প্রথম থেকেই ধস নামে অস্ট্রেলিয়ার ব্যাটিং লাইনআপে। মাত্র ৫৮ রানে ফিরে যান চারজন অজি ব্যাটসম্যান। পরে টিম ডেভিড ও মার্কাসের ৮১ রানের জুটি তাঁদের রান কিছুটা বাড়লেও ভারতের চিন্তার কারণ হয়নি। শেষে অস্ট্রেলিয়ান টি ২০ টিমের অধিনায়ক ম্যাথু ওয়েড ৪২ রান করে হারের ব্যবধান কিছুটা কমালেও ২০ ওভারে ৯ উইকেটে ১৯১ রানেই থেমে যায় তাঁদের ইনিংস। আরও পড়ুন: Hardik Pandya GT: জল্পনা উড়িয়ে হার্দিক পান্ডিয়াকে ধরে রাখল গুজরাট, মুম্বইকে কি প্রতীক্ষায় রাখল টাইটান্স A win by 44 runs in Trivandrum! 🙌 #TeamIndia take a 2⃣-0⃣ lead in the series 👏👏 Scorecard ▶️ https://t.co/nwYe5nOBfk #INDvAUS | @IDFCFIRSTBank pic.twitter.com/sAcQIWggc4 — BCCI (@BCCI) November 26, 2023","pubDate":"2023-11-26 18:04:32","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"730d895cfe329abd91d37b0abddd58f8","title":"IND vs AUS 2nd T20I HIGHLIGHTS: India Beat Australia By 44 Runs, Go 2-0 Up In Five-Match Series","link":"https://news.abplive.com/sports/cricket/ind-vs-aus-2nd-t20i-highlights-india-beat-australia-by-44-runs-thiruvananthapuram-1645382","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India have beaten Australia by 44 runs in the second T20I of the five-match series at the Greenfield International Stadium in Thiruvananthapuram on Sunday (November 26). Australia won the toss and elected to bowl first in this fixture but each of India's top three batters scored half-centuries to lay a solid foundation for the Men in Blue. Yashasvi Jaiswal scored 53 off 25, Ruturaj Gaikwad scored 58 off 43 and Ishan Kishan made 52 off 32 before a handly little cameo from Rinku Singh worth 9-ball 31* that propelled them to a score of 235/4. Yashasvi Jaiswal receives the Player of the Match award for his solid opening act with the bat 👏👏#TeamIndia complete a 44-run win over Australia in the 2nd T20I 👌👌Scorecard ▶️ https://t.co/nwYe5nOBfk#INDvAUS | @IDFCFIRSTBank pic.twitter.com/smMRxGogSy — BCCI (@BCCI) November 26, 2023 In the run chase, Australia lost three wickets inside the powerplay and were always behind in the second innings. The two spinners Ravi Bishnoi and Axar Patel got the early breakthroughs for the hosts before the pacers joined in. Bishnoi eventually returned with figures of 3 for 32 while Prasidh too picked 3 for 41. There was only one partnership that seemed to threaten India's strong total which was the fifth-wicket partnership worth 81 off 38 between Tim David (37 off 22) and Marcus Stoinis (45 off 25). Once India broke the partnership, the match never looked out of their grasp and they eventually completed a dominant victory.From the southernmost international cricket venue  in India, the series focus will now head to the easternmost international cricket venue in the country with the third match of the series set to be played at the Barsapara Stadium in Guwahati. Another commanding performance by Team India, securing a 2-0 lead in the T20I series against Australia! Kudos to our dynamic openers @ybj_19 and @Ruutu1331 for setting the stage on fire with their explosive fifties. @ishankishan51, holding his ground at number 3, played yet… pic.twitter.com/pqGFUSM9Kj — Jay Shah (@JayShah) November 26, 2023","content":"India have beaten Australia by 44 runs in the second T20I of the five-match series at the Greenfield International Stadium in Thiruvananthapuram on Sunday (November 26). Australia won the toss and elected to bowl first in this fixture but each of India's top three batters scored half-centuries to lay a solid foundation for the Men in Blue. Yashasvi Jaiswal scored 53 off 25, Ruturaj Gaikwad scored 58 off 43 and Ishan Kishan made 52 off 32 before a handly little cameo from Rinku Singh worth 9-ball 31* that propelled them to a score of 235/4. Yashasvi Jaiswal receives the Player of the Match award for his solid opening act with the bat 👏👏 #TeamIndia complete a 44-run win over Australia in the 2nd T20I 👌👌 Scorecard ▶️ https://t.co/nwYe5nOBfk #INDvAUS | @IDFCFIRSTBank pic.twitter.com/smMRxGogSy — BCCI (@BCCI) November 26, 2023 In the run chase, Australia lost three wickets inside the powerplay and were always behind in the second innings. The two spinners Ravi Bishnoi and Axar Patel got the early breakthroughs for the hosts before the pacers joined in. Bishnoi eventually returned with figures of 3 for 32 while Prasidh too picked 3 for 41. There was only one partnership that seemed to threaten India's strong total which was the fifth-wicket partnership worth 81 off 38 between Tim David (37 off 22) and Marcus Stoinis (45 off 25). Once India broke the partnership, the match never looked out of their grasp and they eventually completed a dominant victory. From the southernmost international cricket venue in India, the series focus will now head to the easternmost international cricket venue in the country with the third match of the series set to be played at the Barsapara Stadium in Guwahati. Another commanding performance by Team India, securing a 2-0 lead in the T20I series against Australia! Kudos to our dynamic openers @ybj_19 and @Ruutu1331 for setting the stage on fire with their explosive fifties. @ishankishan51 , holding his ground at number 3, played yet… pic.twitter.com/pqGFUSM9Kj googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — Jay Shah (@JayShah) November 26, 2023","pubDate":"2023-11-26 17:23:10","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/26/51c0a3a98e1b8fb79592645b0e98400a1701018684952625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"81d191cd26acc7768072006dc03c3c55","title":"Bowling woes for Australia in second T20 loss to India","link":"https://www.watoday.com.au/sport/cricket/bowling-woes-for-australia-in-second-t20-loss-to-india-20231127-p5emxd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"A ragged Australian bowling display allowed the home side to plunder a mammoth 4-235 in Thiruvananthapuram.","content":"India’s top order fired on all cylinders to fashion a 44-run win over Australia to put the home side 2-0 ahead in the five-match T20 series in Thiruvananthapuram on Sunday. Put in to bat, India’s top three batters smashed rapid fifties to power the hosts to a commanding 4-235 at the Greenfield International Stadium. India’s Rinku Singh hammered 31 of nine balls at the death. Credit: Getty Images In reply, Australia failed to fully recover from a top-order collapse and managed only 9-191. Australia beat India in the final of the 50-overs World Cup earlier this month and both teams have fielded second-string squads for the T20 series. Ruturaj Gaikwad (58), Yashasvi Jaiswal (53), Ishan Khan (52) and Rinku Singh (31no off nine balls) capitalised on the tourists’ waywardness with the ball. India’s total was their highest in T20s against Australia – surpassing their previous best of 8-209 set three days ago at Visakhapatnam – and easily the best score at Greenfield International Stadium. Australia’s Marcus Stoinis fell for 45 of 25 balls. Credit: AP Australia bowled poorly in the powerplay before regularly losing control as the dew set in early, dishing up 12 wides and a no-ball via a chest-high full-toss from Glenn Maxwell. Nathan Ellis (3-45) picked up three of the four wickets but was expensive in doing so, Sean Abbott’s three overs were dispatched for 56 and Australia’s three spinners were ineffective.","pubDate":"2023-11-26 17:20:35","image_url":null,"source_id":"watoday","source_priority":347743,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c16a6ac7b4a1b1d202f030aee01837ca","title":"Bowling woes for Australia in second T20 loss to India","link":"https://www.smh.com.au/sport/cricket/bowling-woes-for-australia-in-second-t20-loss-to-india-20231127-p5emxd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"A ragged Australian bowling display allowed the home side to plunder a mammoth 4-235 in Thiruvananthapuram.","content":"India’s top order fired on all cylinders to fashion a 44-run win over Australia to put the home side 2-0 ahead in the five-match T20 series in Thiruvananthapuram on Sunday. Put in to bat, India’s top three batters smashed rapid fifties to power the hosts to a commanding 4-235 at the Greenfield International Stadium. India’s Rinku Singh hammered 31 of nine balls at the death. Credit: Getty Images In reply, Australia failed to fully recover from a top-order collapse and managed only 9-191. Australia beat India in the final of the 50-overs World Cup earlier this month and both teams have fielded second-string squads for the T20 series. Ruturaj Gaikwad (58), Yashasvi Jaiswal (53), Ishan Khan (52) and Rinku Singh (31no off nine balls) capitalised on the tourists’ waywardness with the ball. India’s total was their highest in T20s against Australia – surpassing their previous best of 8-209 set three days ago at Visakhapatnam – and easily the best score at Greenfield International Stadium. Australia’s Marcus Stoinis fell for 45 of 25 balls. Credit: AP Australia bowled poorly in the powerplay before regularly losing control as the dew set in early, dishing up 12 wides and a no-ball via a chest-high full-toss from Glenn Maxwell. Nathan Ellis (3-45) picked up three of the four wickets but was expensive in doing so, Sean Abbott’s three overs were dispatched for 56 and Australia’s three spinners were ineffective. Jaiswal was the early aggressor, dominating India’s 1-77 powerplay, which was their best in T20s against Australia. The 21-year-old opener welcomed Abbott to the bowling crease by going 4-4-4-6-6 to bring up his half-century inside the fourth over. After Jaiswal miscued Ellis to Adam Zampa, Ishan Kishan took over and targeted Australia’s spinners. He raised his 50 by walloping Tanveer Sangha for back-to-back sixes before slicing a wide, off-balance, one-handed shot to Ellis in the deep. Gaikwad was the anchor of the innings, becoming the third Indian batter to move past 50. Acting captain Suryakumar Yadav, game one hero Rinku and Tilak Varma all teed off at the death, Australia’s last two overs thumped for 45. Australia faltered early in their chase and were reeling at 4-58 in the eighth over before Marcus Stoinis (45) and Tim David (37) arrested the slide. Wade made 42 not out down the order, but Australia still finished well short of their target. The teams now move to Guwahati for the third ODI on Tuesday. AAP, Reuters News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-11-26 17:20:35","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"fdbfda5233eaf36afa1b310f6adad683","title":"IPL 2024 Auction: Full List Of Players Retained, Released And Traded By 10 Franchises","link":"https://news.abplive.com/sports/cricket/ipl-2024-auction-full-list-of-players-retained-released-and-traded-by-10-franchises-csk-dc-gt-kkr-lsg-mi-pbks-rr-rcb-srh-1645377","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"All the ten Indian Premier League (IPL) franchises released the list of retained and released players on retention deadline day. The headline was Gujarat Titans (GT) retaining Hardik Pandya as captain with reports emerging that he would be traded to Mumbai Indians (MI).Take a look at the complete list of released, retained and traded players by each of the 10 participating teams in the IPL:Chennai Super Kings (CSK) Retained players: MS Dhoni (captain and wicketkeeper), Moeen Ali, Deepak Chahar, Devon Conway (wk), Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Ajay Mandal, Mukesh Choudhary, Matheesha Pathirana, Ajinkya Rahane, Shaik Rasheed, Mitchell Santner, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Released players: Ben Stokes, Dwaine Pretorius, Bhagath Varma, Subhranshu Senapati, Ambati Rayudu, Kyle Jamieson, Akash Singh, Sisanda Magala. Delhi Capitals (DC)Retained Players: Rishabh Pant, Pravin Dubey, David Warner, Vicky Ostwal, Prithvi Shaw, Anrich Nortje, Abishek Porel, Kuldeep Yadav, Axar Patel, Lungi Ngidi, Lalit Yadav, Khaleel Ahmed, Mitchell Marshm, Ishant Sharma, Yash Dhull, Mukesh Kumar. Released Players: Rilee Rossouw, Chetan Sakariya, Rovman Powell, Manish Pandey, Phil Salt, Mustafizur Rahman, Kamlesh Nagarkoti, Ripal Patel, Sarfaraz Khan, Aman Khan, Priyam Garg.Gujarat Titans (GT) Released players: Yash Dayal, KS Bharat, Shivam Mavi, Urvil Patel, Pradeep Sangwan, Odean Smith, Alzarri Joseph, Dasun Shanaka Retained players: Hardik Pandya (captain), David Miller, Shubman Gill, Matthew Wade, Wriddhiman Saha, Kane Williamson, Abhinav Manohar, B Sai Sudharsan, Darshan Nalkande, Vijay Shankar, Jayant Yadav, Rahul Tewatia, Mohammed Shami, Noor Ahmad, Sai Kishore, Rashid Khan, Joshua Little, Mohit SharmaKolkata Knight Riders (KKR) Retained players: Nitish Rana, Rinku Singh, Rahmanullah Gurbaz, Shreyas Iyer, Jason Roy, Sunil Narine, Suyash Sharma, Anukul Roy, Andre Russell, Venkatesh Iyer, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy Released players: Shakib Al Hasan, Litton Das, Aarya Desai, David Wiese, Narayan Jagadeesan, Mandeep Singh, Kulwant Khejroliya, Shardul Thakur, Lockie Ferguson, Umesh Yadav, Tim Southee, Johnson CharlesLucknow Super Giants (LSG) Released players: Jaydev Unadkat, Daniel Sams, Manan Vohra, Swapnil Singh, Karan Sharma, Arpit Guleria, Suryansh Shedge, Karun Nair Retained players: KL Rahul (captain), Quinton de Kock, Nicholas Pooran, Ayush Badoni, Kyle Mayers, Marcus Stoinis, Deepak Hooda, Ravi Bishnoi, Naveen ul Haq, Krunal Pandya, Yudhvir Singh, Prerak Mankad, Yash Thakur, Amit Mishra, Mark Wood, Mayank Yadav, Mohsin Khan Traded players: Devdutt Padikkal (from Rajasthan Royals) Mumbai Indians (MI)Released players: Mohd. Arshad Khan, Ramandeep Singh, Hrithik Shokeen, Raghav Goyal, Jofra Archer, Tristan Stubbs, Duan Jansen, Jhye Richardson, Riley Meredith, Chris Jordan, Sandeep WarrierRetained players: Rohit Sharma (captain), Dewald Brevis, Suryakumar Yadav, Ishan Kishan, N. Tilak Verma, Tim David, Vishnu Vinod, Arjun Tendulkar, Cameron Green, Shams Mulani, Nehal Wadhera, Jasprit Bumrah, Kumar Kartikeya, Piyush Chawla, Akash Madhwal, Jason Behrendorff Traded players: Romario Shepherd (traded in from Lucknow Super Giants)Punjab Kings (PBKS)Retained Players: Shikhar Dhawan (captain), Matthew Short, Prabhsimran Singh (wicketkeeper), Jitesh Sharma (wicketkeeper), Sikandar Raza, Rishi Dhawan, Liam Livingstone, Atharva Taide, Arshdeep Singh, Nathan Ellis, Sam Curran, Kagiso Rabada, Harpreet Brar, Rahul Chahar, Harpreet Bhatia, Vidwath Kaverappa, Shivam Singh Released: Mohit Rathee, Raj Bawa, Shahrukh Khan, Bhanuka Rajapaksa, Baltej Singh Rajasthan Royals (RR)Retained Players: Sanju Samson (Captain), Jos Buttler, Shimron Hetmyer, Yashasvi Jaiswal, Dhruv Jurel, Riyan Parag, Donovan Ferreira, Kunal Rathore, Ravichandran Ashwin, Kuldeep Sen, Navdeep Saini, Prasidh Krishna, Sandeep Sharma, Trent Boult, Yuzvendra Chahal, Adam Zampa. Released players: Joe Root, Abdul Basith, Jason Holder, Akash Vashisht, Kuldip Yadav, Obed McCoy, Murugan Ashwin, KC Cariappa, KM Asif. Traded: Avesh Khan Royal Challengers Bangalore (RCB)Released players: Wanindu Hasaranga, Harshal Patel, Josh Hazlewood, Finn Allen, Michael Bracewell, David Willey, Wayne Parnell, Sonu Yadav, Avinash Singh, Siddarth Kaul, Kedar Jadhav Retained players: Faf du Plessis (captain), Glenn Maxwell, Virat Kohli, Rajat Patidar, Anuj Rawat, Dinesh Karthik, Suyash Prabhudessai, Will Jacks, Mahipal Lomror, Karn Sharma, Manoj Bhandage, Vyshak Vijaykumar, Akash Deep, Mohammed Siraj, Reece Topley, Himanshu Sharma, Rajan Kumar Traded players: Mayank Dagar (from Sunrisers Hyderabad) Sunrisers Hyderabad (SRH)Released players: Harry Brook, Samarth Vyas, Kartik Tyagi, Vivrant Sharma, Akeal Hosein, Adil Rashid Retained players: Abdul Samad, Aiden Markram (captain), Rahul Tripathi, Glenn Phillips, Heinrich Klaasen, Mayank Agarwal, Anmolpreet Singh, Upendra Singh Yadav, Nitish Kumar Reddy, Abhishek Sharma, Marco Jansen, Washington Sundar, Sanvir Singh, Bhuvneshwar Kumar, T Natarajan, Mayank Markande, Umran Malik, Fazalhaq Farooqi Traded players: Shahbaz Ahmed (from Royal Challengers Bangalore)","content":"All the ten Indian Premier League (IPL) franchises released the list of retained and released players on retention deadline day. The headline was Gujarat Titans (GT) retaining Hardik Pandya as captain with reports emerging that he would be traded to Mumbai Indians (MI). Take a look at the complete list of released, retained and traded players by each of the 10 participating teams in the IPL: Chennai Super Kings (CSK) Retained players: MS Dhoni (captain and wicketkeeper), Moeen Ali, Deepak Chahar, Devon Conway (wk), Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Ajay Mandal, Mukesh Choudhary, Matheesha Pathirana, Ajinkya Rahane, Shaik Rasheed, Mitchell Santner, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Released players: Ben Stokes, Dwaine Pretorius, Bhagath Varma, Subhranshu Senapati, Ambati Rayudu, Kyle Jamieson, Akash Singh, Sisanda Magala. Delhi Capitals (DC) Retained Players: Rishabh Pant, Pravin Dubey, David Warner, Vicky Ostwal, Prithvi Shaw, Anrich Nortje, Abishek Porel, Kuldeep Yadav, Axar Patel, Lungi Ngidi, Lalit Yadav, Khaleel Ahmed, Mitchell Marshm, Ishant Sharma, Yash Dhull, Mukesh Kumar. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Released Players: Rilee Rossouw, Chetan Sakariya, Rovman Powell, Manish Pandey, Phil Salt, Mustafizur Rahman, Kamlesh Nagarkoti, Ripal Patel, Sarfaraz Khan, Aman Khan, Priyam Garg. Gujarat Titans (GT) Released players: Yash Dayal, KS Bharat, Shivam Mavi, Urvil Patel, Pradeep Sangwan, Odean Smith, Alzarri Joseph, Dasun Shanaka Retained players: Hardik Pandya (captain), David Miller, Shubman Gill, Matthew Wade, Wriddhiman Saha, Kane Williamson, Abhinav Manohar, B Sai Sudharsan, Darshan Nalkande, Vijay Shankar, Jayant Yadav, Rahul Tewatia, Mohammed Shami, Noor Ahmad, Sai Kishore, Rashid Khan, Joshua Little, Mohit Sharma Kolkata Knight Riders (KKR) Retained players: Nitish Rana, Rinku Singh, Rahmanullah Gurbaz, Shreyas Iyer, Jason Roy, Sunil Narine, Suyash Sharma, Anukul Roy, Andre Russell, Venkatesh Iyer, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy Released players: Shakib Al Hasan, Litton Das, Aarya Desai, David Wiese, Narayan Jagadeesan, Mandeep Singh, Kulwant Khejroliya, Shardul Thakur, Lockie Ferguson, Umesh Yadav, Tim Southee, Johnson Charles Lucknow Super Giants (LSG) Released players: Jaydev Unadkat, Daniel Sams, Manan Vohra, Swapnil Singh, Karan Sharma, Arpit Guleria, Suryansh Shedge, Karun Nair Retained players: KL Rahul (captain), Quinton de Kock, Nicholas Pooran, Ayush Badoni, Kyle Mayers, Marcus Stoinis, Deepak Hooda, Ravi Bishnoi, Naveen ul Haq, Krunal Pandya, Yudhvir Singh, Prerak Mankad, Yash Thakur, Amit Mishra, Mark Wood, Mayank Yadav, Mohsin Khan Traded players: Devdutt Padikkal (from Rajasthan Royals) Mumbai Indians (MI) Released players: Mohd. Arshad Khan, Ramandeep Singh, Hrithik Shokeen, Raghav Goyal, Jofra Archer, Tristan Stubbs, Duan Jansen, Jhye Richardson, Riley Meredith, Chris Jordan, Sandeep Warrier Retained players: Rohit Sharma (captain), Dewald Brevis, Suryakumar Yadav, Ishan Kishan, N. Tilak Verma, Tim David, Vishnu Vinod, Arjun Tendulkar, Cameron Green, Shams Mulani, Nehal Wadhera, Jasprit Bumrah, Kumar Kartikeya, Piyush Chawla, Akash Madhwal, Jason Behrendorff Traded players: Romario Shepherd (traded in from Lucknow Super Giants) Punjab Kings (PBKS) Retained Players: Shikhar Dhawan (captain), Matthew Short, Prabhsimran Singh (wicketkeeper), Jitesh Sharma (wicketkeeper), Sikandar Raza, Rishi Dhawan, Liam Livingstone, Atharva Taide, Arshdeep Singh, Nathan Ellis, Sam Curran, Kagiso Rabada, Harpreet Brar, Rahul Chahar, Harpreet Bhatia, Vidwath Kaverappa, Shivam Singh Released: Mohit Rathee, Raj Bawa, Shahrukh Khan, Bhanuka Rajapaksa, Baltej Singh Rajasthan Royals (RR) Retained Players: Sanju Samson (Captain), Jos Buttler, Shimron Hetmyer, Yashasvi Jaiswal, Dhruv Jurel, Riyan Parag, Donovan Ferreira, Kunal Rathore, Ravichandran Ashwin, Kuldeep Sen, Navdeep Saini, Prasidh Krishna, Sandeep Sharma, Trent Boult, Yuzvendra Chahal, Adam Zampa. Released players: Joe Root, Abdul Basith, Jason Holder, Akash Vashisht, Kuldip Yadav, Obed McCoy, Murugan Ashwin, KC Cariappa, KM Asif. Traded: Avesh Khan Royal Challengers Bangalore (RCB) Released players: Wanindu Hasaranga, Harshal Patel, Josh Hazlewood, Finn Allen, Michael Bracewell, David Willey, Wayne Parnell, Sonu Yadav, Avinash Singh, Siddarth Kaul, Kedar Jadhav Retained players: Faf du Plessis (captain), Glenn Maxwell, Virat Kohli, Rajat Patidar, Anuj Rawat, Dinesh Karthik, Suyash Prabhudessai, Will Jacks, Mahipal Lomror, Karn Sharma, Manoj Bhandage, Vyshak Vijaykumar, Akash Deep, Mohammed Siraj, Reece Topley, Himanshu Sharma, Rajan Kumar Traded players: Mayank Dagar (from Sunrisers Hyderabad) Sunrisers Hyderabad (SRH) Released players: Harry Brook, Samarth Vyas, Kartik Tyagi, Vivrant Sharma, Akeal Hosein, Adil Rashid Retained players: Abdul Samad, Aiden Markram (captain), Rahul Tripathi, Glenn Phillips, Heinrich Klaasen, Mayank Agarwal, Anmolpreet Singh, Upendra Singh Yadav, Nitish Kumar Reddy, Abhishek Sharma, Marco Jansen, Washington Sundar, Sanvir Singh, Bhuvneshwar Kumar, T Natarajan, Mayank Markande, Umran Malik, Fazalhaq Farooqi Traded players: Shahbaz Ahmed (from Royal Challengers Bangalore)","pubDate":"2023-11-26 16:18:47","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/26/6ac9493d38ece225bfcae26a765093e81701015490508625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d3ae59e6194ad43b7a198e52d4abaffc","title":"Bartlett makes New Zealand XI","link":"https://times-age.co.nz/sports/bartlett-in-nz-xi/","keywords":["Cricket","Rugby","Softball","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"CRICKET Southey Sayer Wairarapa Korus, captain and allrounder Ocean Bartlett, has been named in a New Zealand XI squad to play two warm-up games against the visiting Pakistani women’s team this week. The teams will play a one-day 50-0ver match tomorrow and a T20 match on Thursday, with both games at Bert Sutcliffe Oval at […]","content":"CRICKET Southey Sayer Wairarapa Korus, captain and allrounder Ocean Bartlett, has been named in a New Zealand XI squad to play two warm-up games against the visiting Pakistani women’s team this week. The teams will play a one-day 50-0ver match tomorrow and a T20 match on Thursday, with both games at Bert Sutcliffe Oval at Lincoln. RUGBY SEVENS Wairarapa-Bush narrowly missed a place in the women’s final of the Central Zone Rugby Sevens at Massey University on Saturday. The green and reds qualified for the second vs three semifinal after a 29–5 loss to Hawke’s Bay, a 22–17 win over Whanganui, and a 39–0 loss to eventual champions Manawatū. That set up a semifinal with Hawke’s Bay, which Wai-Bush led until the final 24 seconds when the injury-hit side conceded a match-winning try. Wai-Bush finished third in the men’s competition, which was reduced to three teams after the late withdrawal of Whanganui on Friday night. A first-up 24–7 loss to Manawatū was followed by a 49–5 defeat to Hawke’s Bay, who finished the tournament unbeaten. CRICKET The weather had the final say in the fourth round of the Bidwill Cup premier club championship, with both games abandoned without a ball being bowled. With two rounds to play, the Barbarians lead on 50 points, Inspire Living Greytown are on 39, Burger King Red Star 38, and Lansdowne have 22 points.","pubDate":"2023-11-26 16:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/11/RS479297_051-scaled-e1699423886635-1024x583.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"491890ecab8de4ac33e656d7e7e28bf1","title":"Mohamed Salah reveals he is ‘addicted’ to online chess: ‘Hope to play Magnus Carlsen some day’","link":"https://www.hindustantimes.com/sports/others/mohamed-salah-reveals-he-is-addicted-to-online-chess-hope-to-play-magnus-carlsen-some-day-101701013193929.html","keywords":null,"creator":null,"video_url":null,"description":"Liverpool star Mohamed Salah has revealed that he plays online chess almost every day with random people.","content":"Liverpool star Mohamed Salah has revealed that he is an avid online chess player and wants to meet five-time world champion Magnus Carlsen. The Egyptian forward, widely rated among the best football players in the world, said that he plays chess online “every day, literally every day.” Salah said that he wishes to play five-time champion Carlsen some day. “I play chess, I am addicted to chess,\" said Salah on Sky Sports. He further said that he is not going to reveal the name he uses online while playing the sport but there have been a few opponents who would ask him if he is Salah himself. “I am not saying my name. I put my name and some other numbers so some people they ask ‘are you Mo Salah,’ I say ‘yes,’ they don’t believe it, and say ‘you are lying.’ I say ‘yes, I’m lying,'\" he said. We're now on WhatsApp. Click to join. Salah said that he is also rated around 1400. “I’m good, I’m not Magnus, but I’m good. No one has a chance with Magnus. But hopefully we will play one day.” Carlsen, on the other hand, is known to be a huge fan of football and of Salah himself. The Norwegian has regularly featured Salah on his Fantasy Premier League squad that took him to the top of the game with more than 7 million players. The former world champion appeared to accept the invitation and took to X/Twitter on Sunday to respond with a simple emoji, tagging Salah. Incidentally, Salah's Liverpool teammate Trent Alexander-Arnold played Carlsen in an exhibition match in Manchester, England back in 2018. Alexander-Arnold ended up losing in 17 moves. \"I've been playing chess since I was very young, and I've always enjoyed it. It's hard to find someone who wants to play as much as me,\" he had said. Salah further said that while he never played any other sport apart from football when he was young, he has now dabbled with other sports. \"I play paddle tennis pretty well, tennis sometimes. I play golf, surprisingly. Not like a proper English guy but I play good gold for an Egyptian,\" he said. Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Mohamed Salah Magnus Carlsen","pubDate":"2023-11-26 15:56:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/11/26/1600x900/salah_carlsen_1701014024486_1701014029628.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"81536ca1d4d9593b5c5460dbaa096d03","title":"Sports Highligts: হার্দিকের আইপিএল দল নিয়ে ধোঁয়াশা, ভারতের জয়, খেলার সেরা খবরের একঝলক এক নজরে","link":"https://bengali.abplive.com/sports/sports-highlights-know-latest-updates-of-teams-players-matches-and-other-highlights-27-december-1027074","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"মুম্বই: আইপিএলে কোনও দলে হার্দিক, তা নিয়ে ধোঁয়াশা চরমে। শেষে মুম্বইতেই কি বঢোদরার অলরাউন্ডার। গুজরাতের নতুন অধিনায়ক কে? কোন কোন তারকাকে ছেড়ে দিল কেকেআর? এক নজরে দিনের সেরা খেলার খবরের এক ঝলক - ভারতের জয় টানা দ্বিতীয় জয়। পাঁচ ম্যাচের টি-টােয়েন্টি সিরিজের (T20 Series) দ্বিতীয় ম্যাচেও জয় ছিনিয়ে নিল ভারতীয় দল (Indian Cricket Team)। অজিদের বিরুদ্ধে ৪৪ রানের ব্যবধানে জয় ছিনিয়ে নিল টিম ইন্ডিয়া। ২৩৬ রান তাড়া করতে নেমে ২০ ওভারে ৯ উইকেট হারিয়ে ১৯১ রানেই আটকে গেল অস্ট্রেলিয়া। বল হাতে ভারতীয় বোলারদের মধ্যে সর্বাধিক ৩টি করে উইকেট নেন রবি বিষ্ণোই ও প্রসিদ্ধ কৃষ্ণ। ভারতের হয়ে অর্ধশতরান করেন যশস্বী জয়সওয়াল, ঈশান কিষাণ ও রুতুরাজ গায়কোয়াড। ২৫ বলে ৫৩ রান করে ম্য়াচের সেরা হন জয়সওয়াল। ৯ বলে ৩১ রানের ইনিংস খেলেন রিঙ্কু সিংহ। মুম্বইয়ে হার্দিক? আইপিএলে গুজরাত টাইটান্স (Gujrat Titans) ও মুম্বই ইন্ডিয়ান্সের (Mumbai Indians) দল নিয়েই গত কয়েকদিন সবচেয়ে বেশি আগ্রহ দেখিয়েছিলেন ক্রিকেটপ্রেমীরা। আর তার নেপথ্যে ছিলেন হার্দিক পাণ্ড্য (Hardik Pandya)। প্রথমে খবর ছিল যে হার্দিক মুম্বইয়ে তাঁর পুরনো দলে ফিরছেন। আজ যদিও গুজরাত টাইটান্স যখন তাঁদের ক্রিকেটারদের তালিকা প্রকাশ করে তখন দেখা গেল যে হার্দিককে (Hardik Pandya) দলে রেখেছে তারা। কিন্তু রান বাড়তে বাড়তেই ফের গল্পে নতুন মোড়। সূত্রের খবর, হার্দিককে দলে ফেরাচ্ছে নীতা আম্বানির দল। তবে কোনও ক্রিকেটারের বদলে নয়। সরাসরি টাকার বিনিময়ে গুজরাত ফ্র্যাঞ্চাইজি থেকে হার্দিককে দলে নিয়ে নিয়েছে মুম্বই শিবির। বঢোদরা অলরাউন্ডার নাকি সরকারি সই সবুদও করে ফেলেছেন। নতুন মরসুমে রোহিত শর্মার নেতৃত্বে নিজের প্রথম আইপিএল দল মুম্বইয়ের হয়েই খেলবেন হার্দিক। অন্যদিকে, কানাঘুষো শোনা যাচ্ছে যে নতুন মরসুমের জন্য় গুজরাতের অধিনায়ক হচ্ছেন শুভমন গিল। প্রায় ৭২ ঘণ্টার নাটকে যেন যবনিকা পতন হল প্রায়।  কাকে ছাড়ল কেকেআর? কাকেই বা ধরে রাখল?  আইপিএলে (IPL 2024) নতুন মরসুমের আগে মোট ১২ জন প্লেয়ারকে ছেড়ে দিল কেকেআর(Kolkata Knight Riders) । তাঁদের মধ্যে রয়েছেন- শাকিব আল হাসান, লিটন দাস, ডেভিড উইজি, আর্য দেশাই, নারায়ণ জগদীশান, কুলওন্ত খেজরিওয়ালিয়া, শার্দুল ঠাকুর, লকি ফার্গুসন, উমেশ যাদব, টিম সাউদি, জনসন চার্লস। কেকেআর শিবির ধরে রাখল যাঁদের তাঁদের নাম দেখে নেওয়া যাক - নীতিশ রানা, শ্রেয়স আইয়ার, রিঙ্কু সিংহ, রহমনউল্লাহ গুরবাজ, সুনীল নারাইন, জেসন রয়, সুয়াশ শর্মা, অনুকূল রয়, আন্দ্রে রাসেল, ভেঙ্কটেশ আইয়ার, হর্ষিত রানা, বৈভব আরোরা, বরুণ চক্রবর্তী। প্রাণ বাঁচালেন শামি বাইশ গজের বাইরেও ফের নামভূমিকায় ক্রিকেটার মহম্মদ শামি। উত্তরাখণ্ডে দুর্ঘটনাগ্রস্তের কাছে ত্রাতা হয়ে উঠলেন তিনি। পাহাড়ের ঢাল বেয়ে গড়িয়ে পড়া গাড়ির যাত্রীকে রক্ষা করতে ছুটে গেলেন শামি। নিরাপদে উদ্ধারও করে আনলেন দুর্ঘটনাগ্রস্তকে। আশেপাশের মানুষও সাহায্যে এগিয়ে এসেছিলেন বলে যদিও জানিয়েছেন শামি। কিন্তু নিজের গরজে যেভাবে দুর্ঘটনাগ্রস্ত ব্যক্তিকে রক্ষা করেন তিনি, তাতে এই মুহূর্তে শামির প্রশংসায় পঞ্চমুখ নেটদুনিয়া।    ","content":"মুম্বই: আইপিএলে কোনও দলে হার্দিক, তা নিয়ে ধোঁয়াশা চরমে। শেষে মুম্বইতেই কি বঢোদরার অলরাউন্ডার। গুজরাতের নতুন অধিনায়ক কে? কোন কোন তারকাকে ছেড়ে দিল কেকেআর? এক নজরে দিনের সেরা খেলার খবরের এক ঝলক - ভারতের জয় টানা দ্বিতীয় জয়। পাঁচ ম্যাচের টি-টােয়েন্টি সিরিজের (T20 Series) দ্বিতীয় ম্যাচেও জয় ছিনিয়ে নিল ভারতীয় দল (Indian Cricket Team)। অজিদের বিরুদ্ধে ৪৪ রানের ব্যবধানে জয় ছিনিয়ে নিল টিম ইন্ডিয়া। ২৩৬ রান তাড়া করতে নেমে ২০ ওভারে ৯ উইকেট হারিয়ে ১৯১ রানেই আটকে গেল অস্ট্রেলিয়া। বল হাতে ভারতীয় বোলারদের মধ্যে সর্বাধিক ৩টি করে উইকেট নেন রবি বিষ্ণোই ও প্রসিদ্ধ কৃষ্ণ। ভারতের হয়ে অর্ধশতরান করেন যশস্বী জয়সওয়াল, ঈশান কিষাণ ও রুতুরাজ গায়কোয়াড। ২৫ বলে ৫৩ রান করে ম্য়াচের সেরা হন জয়সওয়াল। ৯ বলে ৩১ রানের ইনিংস খেলেন রিঙ্কু সিংহ। মুম্বইয়ে হার্দিক? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আইপিএলে গুজরাত টাইটান্স (Gujrat Titans) ও মুম্বই ইন্ডিয়ান্সের (Mumbai Indians) দল নিয়েই গত কয়েকদিন সবচেয়ে বেশি আগ্রহ দেখিয়েছিলেন ক্রিকেটপ্রেমীরা। আর তার নেপথ্যে ছিলেন হার্দিক পাণ্ড্য (Hardik Pandya)। প্রথমে খবর ছিল যে হার্দিক মুম্বইয়ে তাঁর পুরনো দলে ফিরছেন। আজ যদিও গুজরাত টাইটান্স যখন তাঁদের ক্রিকেটারদের তালিকা প্রকাশ করে তখন দেখা গেল যে হার্দিককে (Hardik Pandya) দলে রেখেছে তারা। কিন্তু রান বাড়তে বাড়তেই ফের গল্পে নতুন মোড়। সূত্রের খবর, হার্দিককে দলে ফেরাচ্ছে নীতা আম্বানির দল। তবে কোনও ক্রিকেটারের বদলে নয়। সরাসরি টাকার বিনিময়ে গুজরাত ফ্র্যাঞ্চাইজি থেকে হার্দিককে দলে নিয়ে নিয়েছে মুম্বই শিবির। বঢোদরা অলরাউন্ডার নাকি সরকারি সই সবুদও করে ফেলেছেন। নতুন মরসুমে রোহিত শর্মার নেতৃত্বে নিজের প্রথম আইপিএল দল মুম্বইয়ের হয়েই খেলবেন হার্দিক। অন্যদিকে, কানাঘুষো শোনা যাচ্ছে যে নতুন মরসুমের জন্য় গুজরাতের অধিনায়ক হচ্ছেন শুভমন গিল। প্রায় ৭২ ঘণ্টার নাটকে যেন যবনিকা পতন হল প্রায়। কাকে ছাড়ল কেকেআর? কাকেই বা ধরে রাখল? আইপিএল ে (IPL 2024) নতুন মরসুমের আগে মোট ১২ জন প্লেয়ারকে ছেড়ে দিল কেকেআর(Kolkata Knight Riders) । তাঁদের মধ্যে রয়েছেন- শাকিব আল হাসান, লিটন দাস, ডেভিড উইজি, আর্য দেশাই, নারায়ণ জগদীশান, কুলওন্ত খেজরিওয়ালিয়া, শার্দুল ঠাকুর, লকি ফার্গুসন, উমেশ যাদব, টিম সাউদি, জনসন চার্লস। কেকেআর শিবির ধরে রাখল যাঁদের তাঁদের নাম দেখে নেওয়া যাক - নীতিশ রানা, শ্রেয়স আইয়ার , রিঙ্কু সিংহ, রহমনউল্লাহ গুরবাজ, সুনীল নারাইন , জেসন রয়, সুয়াশ শর্মা, অনুকূল রয়, আন্দ্রে রাসেল , ভেঙ্কটেশ আইয়ার, হর্ষিত রানা, বৈভব আরোরা, বরুণ চক্রবর্তী। প্রাণ বাঁচালেন শামি বাইশ গজের বাইরেও ফের নামভূমিকায় ক্রিকেটার মহম্মদ শামি। উত্তরাখণ্ডে দুর্ঘটনাগ্রস্তের কাছে ত্রাতা হয়ে উঠলেন তিনি। পাহাড়ের ঢাল বেয়ে গড়িয়ে পড়া গাড়ির যাত্রীকে রক্ষা করতে ছুটে গেলেন শামি। নিরাপদে উদ্ধারও করে আনলেন দুর্ঘটনাগ্রস্তকে। আশেপাশের মানুষও সাহায্যে এগিয়ে এসেছিলেন বলে যদিও জানিয়েছেন শামি। কিন্তু নিজের গরজে যেভাবে দুর্ঘটনাগ্রস্ত ব্যক্তিকে রক্ষা করেন তিনি, তাতে এই মুহূর্তে শামির প্রশংসায় পঞ্চমুখ নেটদুনিয়া। var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-11-26 19:13:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/27/5765b3de7f4fe675a6e182f8a63cdb761701025531549206_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"d916377aac13671d6c071e52f4a50b73","title":"Aditi Ashok wins Ladies European Tour season-ending title","link":"https://www.hindustantimes.com/sports/others/aditi-ashok-wins-ladies-european-tour-season-ending-title-101701019988299.html","keywords":null,"creator":null,"video_url":null,"description":"India’s top woman golfer made a late surge to win the Andalucia Costa Del Sol Open in Spain by two shots for her fifth win on the tour","content":"Aditi Ashok showcased her game and grit, holding her nerves in the final holes to card a final round 66 and pull off an exciting two-shot victory over Dutch woman Anne Van Dam in the Andalucia Costa Del Sol Open, the year-ending tournament on the Ladies European Tour on Sunday. It has been a brilliant season for Aditi with the changes she had made to her swing clearly raising her game to another leve(Getty Images via AFP) The 25-year-old started and finished her season on LET in style, having won the opening event, the Magical Kenya Ladies Open, by nine shots in February. It is the biggest victory for the Bengaluru golfer, who pocketed a winner’s purse of € 97,500. We're now on WhatsApp. Click to join. Aditi finished on 17-under par (69, 68, 68, 66 =271), ahead of Anne (69, 71, 65, 68= 273). India’s Diksha Dagar was tied seventh at 10-under (72, 71, 68, 67= 278), though she finished third in the Race to Costa Del Sol (LET Order of Merit) rankings with Aditi, who played only eight events, fourth. Thailand’s Trichat Cheenglab won the title despite a tied 55th finish. It has been a brilliant season for Aditi with the changes she had made to her swing clearly raising her game to another level. Besides the two wins on LET this season, she was second in the Saudi Ladies International, third in the Lalla Meryem Cup, all in February, and won silver in the Hangzhou Asian Games. Tied second through the second and third rounds, Aditi trailed Dutch playing partner Anne Van Dam, a five-time winner on the LET who led by one shot until drama unfolded on the 15th hole leading to a rousing finish under the afternoon Spanish sun. Anne’s tee shot on the par-five hole veered to the right and settled amid stones next to a tree, forcing her to lay up on the fairway, find the fringe of the green with her third, and eventually saving par. Aditi, flawless from tee to green, birdied with a brilliant putt off at least 17 feet to tie for the lead. Her precision off the tee on the par-3 16th then left her with a two-footer for birdie while Anne’s tee shot spun back to 15 feet off the pin and she two-putted for par. The par-14 17th showcased Aditi’s skill and temperament. The driver off the tee and an accurate second shot left her with an 8-foot putt for birdie, which she sank. Her fourth birdie in five holes – she had five birdies on the back nine, including three in a row from the 15th to 17th – left her with a two-shot cushion going into the final hole. Anne was again frustrated after her 25-foot birdie attempt rolled to the left of the hole, leaving her with another par. The drama wasn’t over. On the 18th, Aditi found the fairway rough to the right and landed her second shot on the bunker, leaving her with a tricky third to get on the sloping green. Although Anne’s second shot landed nine feet off the pin, she needed a birdie and the Indian had to bogey to force a tie. But Aditi was creative with the wedge, aiming for the fringe of the green to get the ball to roll down the slope to three feet off the hole, sealing a great win. “I started slow and missed some birdies, but glad it picked up on the back nine,” a delighted Aditi said after receiving the winner’s trophy. “It was a great battle, especially Anna when she plays well...she is a great player.” Aditi (added: “She hit the trees and I made a great putt. That was the switch moment. And I made sure I had a good look at par on the 18th.” Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR N Ananthanarayanan N Ananthanarayanan has spent almost three decades with news agencies and newspapers, reporting domestic and international sport. He has a passion for writing on cricket and athletics. ...view detail Aditi Ashok","pubDate":"2023-11-26 18:27:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/11/26/1600x900/aditi_ashok_1701020049666_1701020049835.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5ae3676a2d246fd4b669e93c62deffc2","title":"WATCH: “We always find new methods to fail” – Zimbabwe captain Sikandar Raza after shock loss to Uganda","link":"https://3-mob.com/sport/watch-we-always-find-new-methods-to-fail-zimbabwe-captain-sikandar-raza-after-shock-loss-to-uganda/","keywords":["Cricket","Sport","Sikandar Raza","Zimbabwe Cricket"],"creator":["3-mob.com"],"video_url":null,"description":"Zimbabwe had no kind words for his side The post WATCH: “We always find new methods to fail” – Zimbabwe captain Sikandar Raza after shock loss to Uganda first appeared on Three Men On a Boat.","content":"Zimbabwe T20 international captain Sikandar Raza has spoken after his side’s shock loss to Uganda in the ICC Men’s T20 World Cup Qualifier Africa. The loss means Zimbabwe need results to go their way elsewhere for them to get a wicket to the main tournament next year. A dejected Raza did not have any kind of words for his side, who he said seemed to find ‘new methods to fail’. “The standard of cricket we are playing is quite tough, and difficult for watch,” the skipper said. He said in the interview that Zimbabwe seemed to bring its standards down against lesser teams which was a worry. Watch the while interview below:","pubDate":"2023-11-26 18:25:58","image_url":null,"source_id":"3mob","source_priority":1904716,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"0edc2d8b09bb0d9d48d327bc8ae880af","title":"India Beat Australia: দ্বিতীয় টি ২০ ম্যাচেও হার অস্ট্রেলিয়ার, ২-০ এগিয়ে গেল ভারত","link":"https://bangla.latestly.com/sports/cricket/india-beat-australia-in-second-t20-in-thiruvananthapuram-won-by-44-runs-266171.html","keywords":null,"creator":null,"video_url":null,"description":"দ্বিতীয় টি ২০ ম্যাচেও অস্ট্রেলিয়াকে হারিয়ে দিল ভারত। রবিবার থিরুভানাথাপুরমে প্রথম ইনিংসে ব্যাট করতে নেমে ২০ ওভারে মাত্র চার উইকেট হারিয়ে ২৩৫ রান করে ভারত। আর এই বিশাল রান তাড়া করতে নেমে ১৯১ রানে খেলা শেষ হয়ে যায় অস্ট্রেলিয়ার।","content":"থিরুভানাথাপুরম: দ্বিতীয় টি ২০ ম্যাচেও (2nd T20I) অস্ট্রেলিয়াকে হারিয়ে দিল ভারত (India beat Australia)। রবিবার থিরুভানাথাপুরমে (Thiruvananthapuram) প্রথম ইনিংসে ব্যাট করতে নেমে ২০ ওভারে মাত্র চার উইকেট হারিয়ে ২৩৫ রান করে ভারত। আর এই বিশাল রান তাড়া করতে নেমে ১৯১ রানে খেলা শেষ হয়ে যায় অস্ট্রেলিয়ার। প্রথম ইনিংসে দুর্দান্ত ব্যাটিং করে ভারতের শুরুটা ভালোই করেছিলেন যশস্বী জয়সওয়াল, ইশান কিষাণ ও ঋতুরাজ গায়কোয়াড়। যশস্বী ২৫ বলে ৯টি চার ও দুটি ছয় মেরে ৫৩ রান করেন। আর গায়কোয়াড় ৪৩ বলে তিনটি চার ও দুটি ছয় মেরে করেন ৫৮ রান। অন্যদিকে ইশান কিষাণের ব্যাট থেকে আসে ৩২ বলে ৫২। আর শেষদিকে রিঙ্কু সিং মাত্র ৯ বলে ৪টি চার ও দুটি ৬ মেরে ৩১ রান করে ভারতকে পৌঁছে দেয় ২৩৫-এ। এর জবাবে ব্যাট করতে নেমে প্রথম থেকেই ধস নামে অস্ট্রেলিয়ার ব্যাটিং লাইনআপে। মাত্র ৫৮ রানে ফিরে যান চারজন অজি ব্যাটসম্যান। পরে টিম ডেভিড ও মার্কাসের ৮১ রানের জুটি তাঁদের রান কিছুটা বাড়লেও ভারতের চিন্তার কারণ হয়নি। শেষে অস্ট্রেলিয়ান টি ২০ টিমের অধিনায়ক ম্যাথু ওয়েড ৪২ রান করে হারের ব্যবধান কিছুটা কমালেও ২০ ওভারে ৯ উইকেটে ১৯১ রানেই থেমে যায় তাঁদের ইনিংস। আরও পড়ুন: Hardik Pandya GT: জল্পনা উড়িয়ে হার্দিক পান্ডিয়াকে ধরে রাখল গুজরাট, মুম্বইকে কি প্রতীক্ষায় রাখল টাইটান্স A win by 44 runs in Trivandrum! 🙌 #TeamIndia take a 2⃣-0⃣ lead in the series 👏👏 Scorecard ▶️ https://t.co/nwYe5nOBfk #INDvAUS | @IDFCFIRSTBank pic.twitter.com/sAcQIWggc4 — BCCI (@BCCI) November 26, 2023","pubDate":"2023-11-26 18:04:32","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"730d895cfe329abd91d37b0abddd58f8","title":"IND vs AUS 2nd T20I HIGHLIGHTS: India Beat Australia By 44 Runs, Go 2-0 Up In Five-Match Series","link":"https://news.abplive.com/sports/cricket/ind-vs-aus-2nd-t20i-highlights-india-beat-australia-by-44-runs-thiruvananthapuram-1645382","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India have beaten Australia by 44 runs in the second T20I of the five-match series at the Greenfield International Stadium in Thiruvananthapuram on Sunday (November 26). Australia won the toss and elected to bowl first in this fixture but each of India's top three batters scored half-centuries to lay a solid foundation for the Men in Blue. Yashasvi Jaiswal scored 53 off 25, Ruturaj Gaikwad scored 58 off 43 and Ishan Kishan made 52 off 32 before a handly little cameo from Rinku Singh worth 9-ball 31* that propelled them to a score of 235/4. Yashasvi Jaiswal receives the Player of the Match award for his solid opening act with the bat 👏👏#TeamIndia complete a 44-run win over Australia in the 2nd T20I 👌👌Scorecard ▶️ https://t.co/nwYe5nOBfk#INDvAUS | @IDFCFIRSTBank pic.twitter.com/smMRxGogSy — BCCI (@BCCI) November 26, 2023 In the run chase, Australia lost three wickets inside the powerplay and were always behind in the second innings. The two spinners Ravi Bishnoi and Axar Patel got the early breakthroughs for the hosts before the pacers joined in. Bishnoi eventually returned with figures of 3 for 32 while Prasidh too picked 3 for 41. There was only one partnership that seemed to threaten India's strong total which was the fifth-wicket partnership worth 81 off 38 between Tim David (37 off 22) and Marcus Stoinis (45 off 25). Once India broke the partnership, the match never looked out of their grasp and they eventually completed a dominant victory.From the southernmost international cricket venue  in India, the series focus will now head to the easternmost international cricket venue in the country with the third match of the series set to be played at the Barsapara Stadium in Guwahati. Another commanding performance by Team India, securing a 2-0 lead in the T20I series against Australia! Kudos to our dynamic openers @ybj_19 and @Ruutu1331 for setting the stage on fire with their explosive fifties. @ishankishan51, holding his ground at number 3, played yet… pic.twitter.com/pqGFUSM9Kj — Jay Shah (@JayShah) November 26, 2023","content":"India have beaten Australia by 44 runs in the second T20I of the five-match series at the Greenfield International Stadium in Thiruvananthapuram on Sunday (November 26). Australia won the toss and elected to bowl first in this fixture but each of India's top three batters scored half-centuries to lay a solid foundation for the Men in Blue. Yashasvi Jaiswal scored 53 off 25, Ruturaj Gaikwad scored 58 off 43 and Ishan Kishan made 52 off 32 before a handly little cameo from Rinku Singh worth 9-ball 31* that propelled them to a score of 235/4. Yashasvi Jaiswal receives the Player of the Match award for his solid opening act with the bat 👏👏 #TeamIndia complete a 44-run win over Australia in the 2nd T20I 👌👌 Scorecard ▶️ https://t.co/nwYe5nOBfk #INDvAUS | @IDFCFIRSTBank pic.twitter.com/smMRxGogSy — BCCI (@BCCI) November 26, 2023 In the run chase, Australia lost three wickets inside the powerplay and were always behind in the second innings. The two spinners Ravi Bishnoi and Axar Patel got the early breakthroughs for the hosts before the pacers joined in. Bishnoi eventually returned with figures of 3 for 32 while Prasidh too picked 3 for 41. There was only one partnership that seemed to threaten India's strong total which was the fifth-wicket partnership worth 81 off 38 between Tim David (37 off 22) and Marcus Stoinis (45 off 25). Once India broke the partnership, the match never looked out of their grasp and they eventually completed a dominant victory. From the southernmost international cricket venue in India, the series focus will now head to the easternmost international cricket venue in the country with the third match of the series set to be played at the Barsapara Stadium in Guwahati. Another commanding performance by Team India, securing a 2-0 lead in the T20I series against Australia! Kudos to our dynamic openers @ybj_19 and @Ruutu1331 for setting the stage on fire with their explosive fifties. @ishankishan51 , holding his ground at number 3, played yet… pic.twitter.com/pqGFUSM9Kj googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — Jay Shah (@JayShah) November 26, 2023","pubDate":"2023-11-26 17:23:10","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/26/51c0a3a98e1b8fb79592645b0e98400a1701018684952625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"81d191cd26acc7768072006dc03c3c55","title":"Bowling woes for Australia in second T20 loss to India","link":"https://www.watoday.com.au/sport/cricket/bowling-woes-for-australia-in-second-t20-loss-to-india-20231127-p5emxd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"A ragged Australian bowling display allowed the home side to plunder a mammoth 4-235 in Thiruvananthapuram.","content":"India’s top order fired on all cylinders to fashion a 44-run win over Australia to put the home side 2-0 ahead in the five-match T20 series in Thiruvananthapuram on Sunday. Put in to bat, India’s top three batters smashed rapid fifties to power the hosts to a commanding 4-235 at the Greenfield International Stadium. India’s Rinku Singh hammered 31 of nine balls at the death. Credit: Getty Images In reply, Australia failed to fully recover from a top-order collapse and managed only 9-191. Australia beat India in the final of the 50-overs World Cup earlier this month and both teams have fielded second-string squads for the T20 series. Ruturaj Gaikwad (58), Yashasvi Jaiswal (53), Ishan Khan (52) and Rinku Singh (31no off nine balls) capitalised on the tourists’ waywardness with the ball. India’s total was their highest in T20s against Australia – surpassing their previous best of 8-209 set three days ago at Visakhapatnam – and easily the best score at Greenfield International Stadium. Australia’s Marcus Stoinis fell for 45 of 25 balls. Credit: AP Australia bowled poorly in the powerplay before regularly losing control as the dew set in early, dishing up 12 wides and a no-ball via a chest-high full-toss from Glenn Maxwell. Nathan Ellis (3-45) picked up three of the four wickets but was expensive in doing so, Sean Abbott’s three overs were dispatched for 56 and Australia’s three spinners were ineffective.","pubDate":"2023-11-26 17:20:35","image_url":null,"source_id":"watoday","source_priority":347743,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c16a6ac7b4a1b1d202f030aee01837ca","title":"Bowling woes for Australia in second T20 loss to India","link":"https://www.smh.com.au/sport/cricket/bowling-woes-for-australia-in-second-t20-loss-to-india-20231127-p5emxd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"A ragged Australian bowling display allowed the home side to plunder a mammoth 4-235 in Thiruvananthapuram.","content":"India’s top order fired on all cylinders to fashion a 44-run win over Australia to put the home side 2-0 ahead in the five-match T20 series in Thiruvananthapuram on Sunday. Put in to bat, India’s top three batters smashed rapid fifties to power the hosts to a commanding 4-235 at the Greenfield International Stadium. India’s Rinku Singh hammered 31 of nine balls at the death. Credit: Getty Images In reply, Australia failed to fully recover from a top-order collapse and managed only 9-191. Australia beat India in the final of the 50-overs World Cup earlier this month and both teams have fielded second-string squads for the T20 series. Ruturaj Gaikwad (58), Yashasvi Jaiswal (53), Ishan Khan (52) and Rinku Singh (31no off nine balls) capitalised on the tourists’ waywardness with the ball. India’s total was their highest in T20s against Australia – surpassing their previous best of 8-209 set three days ago at Visakhapatnam – and easily the best score at Greenfield International Stadium. Australia’s Marcus Stoinis fell for 45 of 25 balls. Credit: AP Australia bowled poorly in the powerplay before regularly losing control as the dew set in early, dishing up 12 wides and a no-ball via a chest-high full-toss from Glenn Maxwell. Nathan Ellis (3-45) picked up three of the four wickets but was expensive in doing so, Sean Abbott’s three overs were dispatched for 56 and Australia’s three spinners were ineffective. Jaiswal was the early aggressor, dominating India’s 1-77 powerplay, which was their best in T20s against Australia. The 21-year-old opener welcomed Abbott to the bowling crease by going 4-4-4-6-6 to bring up his half-century inside the fourth over. After Jaiswal miscued Ellis to Adam Zampa, Ishan Kishan took over and targeted Australia’s spinners. He raised his 50 by walloping Tanveer Sangha for back-to-back sixes before slicing a wide, off-balance, one-handed shot to Ellis in the deep. Gaikwad was the anchor of the innings, becoming the third Indian batter to move past 50. Acting captain Suryakumar Yadav, game one hero Rinku and Tilak Varma all teed off at the death, Australia’s last two overs thumped for 45. Australia faltered early in their chase and were reeling at 4-58 in the eighth over before Marcus Stoinis (45) and Tim David (37) arrested the slide. Wade made 42 not out down the order, but Australia still finished well short of their target. The teams now move to Guwahati for the third ODI on Tuesday. AAP, Reuters News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-11-26 17:20:35","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"fdbfda5233eaf36afa1b310f6adad683","title":"IPL 2024 Auction: Full List Of Players Retained, Released And Traded By 10 Franchises","link":"https://news.abplive.com/sports/cricket/ipl-2024-auction-full-list-of-players-retained-released-and-traded-by-10-franchises-csk-dc-gt-kkr-lsg-mi-pbks-rr-rcb-srh-1645377","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"All the ten Indian Premier League (IPL) franchises released the list of retained and released players on retention deadline day. The headline was Gujarat Titans (GT) retaining Hardik Pandya as captain with reports emerging that he would be traded to Mumbai Indians (MI).Take a look at the complete list of released, retained and traded players by each of the 10 participating teams in the IPL:Chennai Super Kings (CSK) Retained players: MS Dhoni (captain and wicketkeeper), Moeen Ali, Deepak Chahar, Devon Conway (wk), Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Ajay Mandal, Mukesh Choudhary, Matheesha Pathirana, Ajinkya Rahane, Shaik Rasheed, Mitchell Santner, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Released players: Ben Stokes, Dwaine Pretorius, Bhagath Varma, Subhranshu Senapati, Ambati Rayudu, Kyle Jamieson, Akash Singh, Sisanda Magala. Delhi Capitals (DC)Retained Players: Rishabh Pant, Pravin Dubey, David Warner, Vicky Ostwal, Prithvi Shaw, Anrich Nortje, Abishek Porel, Kuldeep Yadav, Axar Patel, Lungi Ngidi, Lalit Yadav, Khaleel Ahmed, Mitchell Marshm, Ishant Sharma, Yash Dhull, Mukesh Kumar. Released Players: Rilee Rossouw, Chetan Sakariya, Rovman Powell, Manish Pandey, Phil Salt, Mustafizur Rahman, Kamlesh Nagarkoti, Ripal Patel, Sarfaraz Khan, Aman Khan, Priyam Garg.Gujarat Titans (GT) Released players: Yash Dayal, KS Bharat, Shivam Mavi, Urvil Patel, Pradeep Sangwan, Odean Smith, Alzarri Joseph, Dasun Shanaka Retained players: Hardik Pandya (captain), David Miller, Shubman Gill, Matthew Wade, Wriddhiman Saha, Kane Williamson, Abhinav Manohar, B Sai Sudharsan, Darshan Nalkande, Vijay Shankar, Jayant Yadav, Rahul Tewatia, Mohammed Shami, Noor Ahmad, Sai Kishore, Rashid Khan, Joshua Little, Mohit SharmaKolkata Knight Riders (KKR) Retained players: Nitish Rana, Rinku Singh, Rahmanullah Gurbaz, Shreyas Iyer, Jason Roy, Sunil Narine, Suyash Sharma, Anukul Roy, Andre Russell, Venkatesh Iyer, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy Released players: Shakib Al Hasan, Litton Das, Aarya Desai, David Wiese, Narayan Jagadeesan, Mandeep Singh, Kulwant Khejroliya, Shardul Thakur, Lockie Ferguson, Umesh Yadav, Tim Southee, Johnson CharlesLucknow Super Giants (LSG) Released players: Jaydev Unadkat, Daniel Sams, Manan Vohra, Swapnil Singh, Karan Sharma, Arpit Guleria, Suryansh Shedge, Karun Nair Retained players: KL Rahul (captain), Quinton de Kock, Nicholas Pooran, Ayush Badoni, Kyle Mayers, Marcus Stoinis, Deepak Hooda, Ravi Bishnoi, Naveen ul Haq, Krunal Pandya, Yudhvir Singh, Prerak Mankad, Yash Thakur, Amit Mishra, Mark Wood, Mayank Yadav, Mohsin Khan Traded players: Devdutt Padikkal (from Rajasthan Royals) Mumbai Indians (MI)Released players: Mohd. Arshad Khan, Ramandeep Singh, Hrithik Shokeen, Raghav Goyal, Jofra Archer, Tristan Stubbs, Duan Jansen, Jhye Richardson, Riley Meredith, Chris Jordan, Sandeep WarrierRetained players: Rohit Sharma (captain), Dewald Brevis, Suryakumar Yadav, Ishan Kishan, N. Tilak Verma, Tim David, Vishnu Vinod, Arjun Tendulkar, Cameron Green, Shams Mulani, Nehal Wadhera, Jasprit Bumrah, Kumar Kartikeya, Piyush Chawla, Akash Madhwal, Jason Behrendorff Traded players: Romario Shepherd (traded in from Lucknow Super Giants)Punjab Kings (PBKS)Retained Players: Shikhar Dhawan (captain), Matthew Short, Prabhsimran Singh (wicketkeeper), Jitesh Sharma (wicketkeeper), Sikandar Raza, Rishi Dhawan, Liam Livingstone, Atharva Taide, Arshdeep Singh, Nathan Ellis, Sam Curran, Kagiso Rabada, Harpreet Brar, Rahul Chahar, Harpreet Bhatia, Vidwath Kaverappa, Shivam Singh Released: Mohit Rathee, Raj Bawa, Shahrukh Khan, Bhanuka Rajapaksa, Baltej Singh Rajasthan Royals (RR)Retained Players: Sanju Samson (Captain), Jos Buttler, Shimron Hetmyer, Yashasvi Jaiswal, Dhruv Jurel, Riyan Parag, Donovan Ferreira, Kunal Rathore, Ravichandran Ashwin, Kuldeep Sen, Navdeep Saini, Prasidh Krishna, Sandeep Sharma, Trent Boult, Yuzvendra Chahal, Adam Zampa. Released players: Joe Root, Abdul Basith, Jason Holder, Akash Vashisht, Kuldip Yadav, Obed McCoy, Murugan Ashwin, KC Cariappa, KM Asif. Traded: Avesh Khan Royal Challengers Bangalore (RCB)Released players: Wanindu Hasaranga, Harshal Patel, Josh Hazlewood, Finn Allen, Michael Bracewell, David Willey, Wayne Parnell, Sonu Yadav, Avinash Singh, Siddarth Kaul, Kedar Jadhav Retained players: Faf du Plessis (captain), Glenn Maxwell, Virat Kohli, Rajat Patidar, Anuj Rawat, Dinesh Karthik, Suyash Prabhudessai, Will Jacks, Mahipal Lomror, Karn Sharma, Manoj Bhandage, Vyshak Vijaykumar, Akash Deep, Mohammed Siraj, Reece Topley, Himanshu Sharma, Rajan Kumar Traded players: Mayank Dagar (from Sunrisers Hyderabad) Sunrisers Hyderabad (SRH)Released players: Harry Brook, Samarth Vyas, Kartik Tyagi, Vivrant Sharma, Akeal Hosein, Adil Rashid Retained players: Abdul Samad, Aiden Markram (captain), Rahul Tripathi, Glenn Phillips, Heinrich Klaasen, Mayank Agarwal, Anmolpreet Singh, Upendra Singh Yadav, Nitish Kumar Reddy, Abhishek Sharma, Marco Jansen, Washington Sundar, Sanvir Singh, Bhuvneshwar Kumar, T Natarajan, Mayank Markande, Umran Malik, Fazalhaq Farooqi Traded players: Shahbaz Ahmed (from Royal Challengers Bangalore)","content":"All the ten Indian Premier League (IPL) franchises released the list of retained and released players on retention deadline day. The headline was Gujarat Titans (GT) retaining Hardik Pandya as captain with reports emerging that he would be traded to Mumbai Indians (MI). Take a look at the complete list of released, retained and traded players by each of the 10 participating teams in the IPL: Chennai Super Kings (CSK) Retained players: MS Dhoni (captain and wicketkeeper), Moeen Ali, Deepak Chahar, Devon Conway (wk), Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Ajay Mandal, Mukesh Choudhary, Matheesha Pathirana, Ajinkya Rahane, Shaik Rasheed, Mitchell Santner, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Released players: Ben Stokes, Dwaine Pretorius, Bhagath Varma, Subhranshu Senapati, Ambati Rayudu, Kyle Jamieson, Akash Singh, Sisanda Magala. Delhi Capitals (DC) Retained Players: Rishabh Pant, Pravin Dubey, David Warner, Vicky Ostwal, Prithvi Shaw, Anrich Nortje, Abishek Porel, Kuldeep Yadav, Axar Patel, Lungi Ngidi, Lalit Yadav, Khaleel Ahmed, Mitchell Marshm, Ishant Sharma, Yash Dhull, Mukesh Kumar. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Released Players: Rilee Rossouw, Chetan Sakariya, Rovman Powell, Manish Pandey, Phil Salt, Mustafizur Rahman, Kamlesh Nagarkoti, Ripal Patel, Sarfaraz Khan, Aman Khan, Priyam Garg. Gujarat Titans (GT) Released players: Yash Dayal, KS Bharat, Shivam Mavi, Urvil Patel, Pradeep Sangwan, Odean Smith, Alzarri Joseph, Dasun Shanaka Retained players: Hardik Pandya (captain), David Miller, Shubman Gill, Matthew Wade, Wriddhiman Saha, Kane Williamson, Abhinav Manohar, B Sai Sudharsan, Darshan Nalkande, Vijay Shankar, Jayant Yadav, Rahul Tewatia, Mohammed Shami, Noor Ahmad, Sai Kishore, Rashid Khan, Joshua Little, Mohit Sharma Kolkata Knight Riders (KKR) Retained players: Nitish Rana, Rinku Singh, Rahmanullah Gurbaz, Shreyas Iyer, Jason Roy, Sunil Narine, Suyash Sharma, Anukul Roy, Andre Russell, Venkatesh Iyer, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy Released players: Shakib Al Hasan, Litton Das, Aarya Desai, David Wiese, Narayan Jagadeesan, Mandeep Singh, Kulwant Khejroliya, Shardul Thakur, Lockie Ferguson, Umesh Yadav, Tim Southee, Johnson Charles Lucknow Super Giants (LSG) Released players: Jaydev Unadkat, Daniel Sams, Manan Vohra, Swapnil Singh, Karan Sharma, Arpit Guleria, Suryansh Shedge, Karun Nair Retained players: KL Rahul (captain), Quinton de Kock, Nicholas Pooran, Ayush Badoni, Kyle Mayers, Marcus Stoinis, Deepak Hooda, Ravi Bishnoi, Naveen ul Haq, Krunal Pandya, Yudhvir Singh, Prerak Mankad, Yash Thakur, Amit Mishra, Mark Wood, Mayank Yadav, Mohsin Khan Traded players: Devdutt Padikkal (from Rajasthan Royals) Mumbai Indians (MI) Released players: Mohd. Arshad Khan, Ramandeep Singh, Hrithik Shokeen, Raghav Goyal, Jofra Archer, Tristan Stubbs, Duan Jansen, Jhye Richardson, Riley Meredith, Chris Jordan, Sandeep Warrier Retained players: Rohit Sharma (captain), Dewald Brevis, Suryakumar Yadav, Ishan Kishan, N. Tilak Verma, Tim David, Vishnu Vinod, Arjun Tendulkar, Cameron Green, Shams Mulani, Nehal Wadhera, Jasprit Bumrah, Kumar Kartikeya, Piyush Chawla, Akash Madhwal, Jason Behrendorff Traded players: Romario Shepherd (traded in from Lucknow Super Giants) Punjab Kings (PBKS) Retained Players: Shikhar Dhawan (captain), Matthew Short, Prabhsimran Singh (wicketkeeper), Jitesh Sharma (wicketkeeper), Sikandar Raza, Rishi Dhawan, Liam Livingstone, Atharva Taide, Arshdeep Singh, Nathan Ellis, Sam Curran, Kagiso Rabada, Harpreet Brar, Rahul Chahar, Harpreet Bhatia, Vidwath Kaverappa, Shivam Singh Released: Mohit Rathee, Raj Bawa, Shahrukh Khan, Bhanuka Rajapaksa, Baltej Singh Rajasthan Royals (RR) Retained Players: Sanju Samson (Captain), Jos Buttler, Shimron Hetmyer, Yashasvi Jaiswal, Dhruv Jurel, Riyan Parag, Donovan Ferreira, Kunal Rathore, Ravichandran Ashwin, Kuldeep Sen, Navdeep Saini, Prasidh Krishna, Sandeep Sharma, Trent Boult, Yuzvendra Chahal, Adam Zampa. Released players: Joe Root, Abdul Basith, Jason Holder, Akash Vashisht, Kuldip Yadav, Obed McCoy, Murugan Ashwin, KC Cariappa, KM Asif. Traded: Avesh Khan Royal Challengers Bangalore (RCB) Released players: Wanindu Hasaranga, Harshal Patel, Josh Hazlewood, Finn Allen, Michael Bracewell, David Willey, Wayne Parnell, Sonu Yadav, Avinash Singh, Siddarth Kaul, Kedar Jadhav Retained players: Faf du Plessis (captain), Glenn Maxwell, Virat Kohli, Rajat Patidar, Anuj Rawat, Dinesh Karthik, Suyash Prabhudessai, Will Jacks, Mahipal Lomror, Karn Sharma, Manoj Bhandage, Vyshak Vijaykumar, Akash Deep, Mohammed Siraj, Reece Topley, Himanshu Sharma, Rajan Kumar Traded players: Mayank Dagar (from Sunrisers Hyderabad) Sunrisers Hyderabad (SRH) Released players: Harry Brook, Samarth Vyas, Kartik Tyagi, Vivrant Sharma, Akeal Hosein, Adil Rashid Retained players: Abdul Samad, Aiden Markram (captain), Rahul Tripathi, Glenn Phillips, Heinrich Klaasen, Mayank Agarwal, Anmolpreet Singh, Upendra Singh Yadav, Nitish Kumar Reddy, Abhishek Sharma, Marco Jansen, Washington Sundar, Sanvir Singh, Bhuvneshwar Kumar, T Natarajan, Mayank Markande, Umran Malik, Fazalhaq Farooqi Traded players: Shahbaz Ahmed (from Royal Challengers Bangalore)","pubDate":"2023-11-26 16:18:47","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/26/6ac9493d38ece225bfcae26a765093e81701015490508625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d3ae59e6194ad43b7a198e52d4abaffc","title":"Bartlett makes New Zealand XI","link":"https://times-age.co.nz/sports/bartlett-in-nz-xi/","keywords":["Cricket","Rugby","Softball","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"CRICKET Southey Sayer Wairarapa Korus, captain and allrounder Ocean Bartlett, has been named in a New Zealand XI squad to play two warm-up games against the visiting Pakistani women’s team this week. The teams will play a one-day 50-0ver match tomorrow and a T20 match on Thursday, with both games at Bert Sutcliffe Oval at […]","content":"CRICKET Southey Sayer Wairarapa Korus, captain and allrounder Ocean Bartlett, has been named in a New Zealand XI squad to play two warm-up games against the visiting Pakistani women’s team this week. The teams will play a one-day 50-0ver match tomorrow and a T20 match on Thursday, with both games at Bert Sutcliffe Oval at Lincoln. RUGBY SEVENS Wairarapa-Bush narrowly missed a place in the women’s final of the Central Zone Rugby Sevens at Massey University on Saturday. The green and reds qualified for the second vs three semifinal after a 29–5 loss to Hawke’s Bay, a 22–17 win over Whanganui, and a 39–0 loss to eventual champions Manawatū. That set up a semifinal with Hawke’s Bay, which Wai-Bush led until the final 24 seconds when the injury-hit side conceded a match-winning try. Wai-Bush finished third in the men’s competition, which was reduced to three teams after the late withdrawal of Whanganui on Friday night. A first-up 24–7 loss to Manawatū was followed by a 49–5 defeat to Hawke’s Bay, who finished the tournament unbeaten. CRICKET The weather had the final say in the fourth round of the Bidwill Cup premier club championship, with both games abandoned without a ball being bowled. With two rounds to play, the Barbarians lead on 50 points, Inspire Living Greytown are on 39, Burger King Red Star 38, and Lansdowne have 22 points.","pubDate":"2023-11-26 16:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/11/RS479297_051-scaled-e1699423886635-1024x583.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"491890ecab8de4ac33e656d7e7e28bf1","title":"Mohamed Salah reveals he is ‘addicted’ to online chess: ‘Hope to play Magnus Carlsen some day’","link":"https://www.hindustantimes.com/sports/others/mohamed-salah-reveals-he-is-addicted-to-online-chess-hope-to-play-magnus-carlsen-some-day-101701013193929.html","keywords":null,"creator":null,"video_url":null,"description":"Liverpool star Mohamed Salah has revealed that he plays online chess almost every day with random people.","content":"Liverpool star Mohamed Salah has revealed that he is an avid online chess player and wants to meet five-time world champion Magnus Carlsen. The Egyptian forward, widely rated among the best football players in the world, said that he plays chess online “every day, literally every day.” Salah said that he wishes to play five-time champion Carlsen some day. “I play chess, I am addicted to chess,\" said Salah on Sky Sports. He further said that he is not going to reveal the name he uses online while playing the sport but there have been a few opponents who would ask him if he is Salah himself. “I am not saying my name. I put my name and some other numbers so some people they ask ‘are you Mo Salah,’ I say ‘yes,’ they don’t believe it, and say ‘you are lying.’ I say ‘yes, I’m lying,'\" he said. We're now on WhatsApp. Click to join. Salah said that he is also rated around 1400. “I’m good, I’m not Magnus, but I’m good. No one has a chance with Magnus. But hopefully we will play one day.” Carlsen, on the other hand, is known to be a huge fan of football and of Salah himself. The Norwegian has regularly featured Salah on his Fantasy Premier League squad that took him to the top of the game with more than 7 million players. The former world champion appeared to accept the invitation and took to X/Twitter on Sunday to respond with a simple emoji, tagging Salah. Incidentally, Salah's Liverpool teammate Trent Alexander-Arnold played Carlsen in an exhibition match in Manchester, England back in 2018. Alexander-Arnold ended up losing in 17 moves. \"I've been playing chess since I was very young, and I've always enjoyed it. It's hard to find someone who wants to play as much as me,\" he had said. Salah further said that while he never played any other sport apart from football when he was young, he has now dabbled with other sports. \"I play paddle tennis pretty well, tennis sometimes. I play golf, surprisingly. Not like a proper English guy but I play good gold for an Egyptian,\" he said. Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Mohamed Salah Magnus Carlsen","pubDate":"2023-11-26 15:56:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/11/26/1600x900/salah_carlsen_1701014024486_1701014029628.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"81536ca1d4d9593b5c5460dbaa096d03","title":"Sports Highligts: হার্দিকের আইপিএল দল নিয়ে ধোঁয়াশা, ভারতের জয়, খেলার সেরা খবরের একঝলক এক নজরে","link":"https://bengali.abplive.com/sports/sports-highlights-know-latest-updates-of-teams-players-matches-and-other-highlights-27-december-1027074","keywords":["খেলা"],"creator":["ABP Ananda"],"video_url":null,"description":"মুম্বই: আইপিএলে কোনও দলে হার্দিক, তা নিয়ে ধোঁয়াশা চরমে। শেষে মুম্বইতেই কি বঢোদরার অলরাউন্ডার। গুজরাতের নতুন অধিনায়ক কে? কোন কোন তারকাকে ছেড়ে দিল কেকেআর? এক নজরে দিনের সেরা খেলার খবরের এক ঝলক - ভারতের জয় টানা দ্বিতীয় জয়। পাঁচ ম্যাচের টি-টােয়েন্টি সিরিজের (T20 Series) দ্বিতীয় ম্যাচেও জয় ছিনিয়ে নিল ভারতীয় দল (Indian Cricket Team)। অজিদের বিরুদ্ধে ৪৪ রানের ব্যবধানে জয় ছিনিয়ে নিল টিম ইন্ডিয়া। ২৩৬ রান তাড়া করতে নেমে ২০ ওভারে ৯ উইকেট হারিয়ে ১৯১ রানেই আটকে গেল অস্ট্রেলিয়া। বল হাতে ভারতীয় বোলারদের মধ্যে সর্বাধিক ৩টি করে উইকেট নেন রবি বিষ্ণোই ও প্রসিদ্ধ কৃষ্ণ। ভারতের হয়ে অর্ধশতরান করেন যশস্বী জয়সওয়াল, ঈশান কিষাণ ও রুতুরাজ গায়কোয়াড। ২৫ বলে ৫৩ রান করে ম্য়াচের সেরা হন জয়সওয়াল। ৯ বলে ৩১ রানের ইনিংস খেলেন রিঙ্কু সিংহ। মুম্বইয়ে হার্দিক? আইপিএলে গুজরাত টাইটান্স (Gujrat Titans) ও মুম্বই ইন্ডিয়ান্সের (Mumbai Indians) দল নিয়েই গত কয়েকদিন সবচেয়ে বেশি আগ্রহ দেখিয়েছিলেন ক্রিকেটপ্রেমীরা। আর তার নেপথ্যে ছিলেন হার্দিক পাণ্ড্য (Hardik Pandya)। প্রথমে খবর ছিল যে হার্দিক মুম্বইয়ে তাঁর পুরনো দলে ফিরছেন। আজ যদিও গুজরাত টাইটান্স যখন তাঁদের ক্রিকেটারদের তালিকা প্রকাশ করে তখন দেখা গেল যে হার্দিককে (Hardik Pandya) দলে রেখেছে তারা। কিন্তু রান বাড়তে বাড়তেই ফের গল্পে নতুন মোড়। সূত্রের খবর, হার্দিককে দলে ফেরাচ্ছে নীতা আম্বানির দল। তবে কোনও ক্রিকেটারের বদলে নয়। সরাসরি টাকার বিনিময়ে গুজরাত ফ্র্যাঞ্চাইজি থেকে হার্দিককে দলে নিয়ে নিয়েছে মুম্বই শিবির। বঢোদরা অলরাউন্ডার নাকি সরকারি সই সবুদও করে ফেলেছেন। নতুন মরসুমে রোহিত শর্মার নেতৃত্বে নিজের প্রথম আইপিএল দল মুম্বইয়ের হয়েই খেলবেন হার্দিক। অন্যদিকে, কানাঘুষো শোনা যাচ্ছে যে নতুন মরসুমের জন্য় গুজরাতের অধিনায়ক হচ্ছেন শুভমন গিল। প্রায় ৭২ ঘণ্টার নাটকে যেন যবনিকা পতন হল প্রায়।  কাকে ছাড়ল কেকেআর? কাকেই বা ধরে রাখল?  আইপিএলে (IPL 2024) নতুন মরসুমের আগে মোট ১২ জন প্লেয়ারকে ছেড়ে দিল কেকেআর(Kolkata Knight Riders) । তাঁদের মধ্যে রয়েছেন- শাকিব আল হাসান, লিটন দাস, ডেভিড উইজি, আর্য দেশাই, নারায়ণ জগদীশান, কুলওন্ত খেজরিওয়ালিয়া, শার্দুল ঠাকুর, লকি ফার্গুসন, উমেশ যাদব, টিম সাউদি, জনসন চার্লস। কেকেআর শিবির ধরে রাখল যাঁদের তাঁদের নাম দেখে নেওয়া যাক - নীতিশ রানা, শ্রেয়স আইয়ার, রিঙ্কু সিংহ, রহমনউল্লাহ গুরবাজ, সুনীল নারাইন, জেসন রয়, সুয়াশ শর্মা, অনুকূল রয়, আন্দ্রে রাসেল, ভেঙ্কটেশ আইয়ার, হর্ষিত রানা, বৈভব আরোরা, বরুণ চক্রবর্তী। প্রাণ বাঁচালেন শামি বাইশ গজের বাইরেও ফের নামভূমিকায় ক্রিকেটার মহম্মদ শামি। উত্তরাখণ্ডে দুর্ঘটনাগ্রস্তের কাছে ত্রাতা হয়ে উঠলেন তিনি। পাহাড়ের ঢাল বেয়ে গড়িয়ে পড়া গাড়ির যাত্রীকে রক্ষা করতে ছুটে গেলেন শামি। নিরাপদে উদ্ধারও করে আনলেন দুর্ঘটনাগ্রস্তকে। আশেপাশের মানুষও সাহায্যে এগিয়ে এসেছিলেন বলে যদিও জানিয়েছেন শামি। কিন্তু নিজের গরজে যেভাবে দুর্ঘটনাগ্রস্ত ব্যক্তিকে রক্ষা করেন তিনি, তাতে এই মুহূর্তে শামির প্রশংসায় পঞ্চমুখ নেটদুনিয়া।    ","content":"মুম্বই: আইপিএলে কোনও দলে হার্দিক, তা নিয়ে ধোঁয়াশা চরমে। শেষে মুম্বইতেই কি বঢোদরার অলরাউন্ডার। গুজরাতের নতুন অধিনায়ক কে? কোন কোন তারকাকে ছেড়ে দিল কেকেআর? এক নজরে দিনের সেরা খেলার খবরের এক ঝলক - ভারতের জয় টানা দ্বিতীয় জয়। পাঁচ ম্যাচের টি-টােয়েন্টি সিরিজের (T20 Series) দ্বিতীয় ম্যাচেও জয় ছিনিয়ে নিল ভারতীয় দল (Indian Cricket Team)। অজিদের বিরুদ্ধে ৪৪ রানের ব্যবধানে জয় ছিনিয়ে নিল টিম ইন্ডিয়া। ২৩৬ রান তাড়া করতে নেমে ২০ ওভারে ৯ উইকেট হারিয়ে ১৯১ রানেই আটকে গেল অস্ট্রেলিয়া। বল হাতে ভারতীয় বোলারদের মধ্যে সর্বাধিক ৩টি করে উইকেট নেন রবি বিষ্ণোই ও প্রসিদ্ধ কৃষ্ণ। ভারতের হয়ে অর্ধশতরান করেন যশস্বী জয়সওয়াল, ঈশান কিষাণ ও রুতুরাজ গায়কোয়াড। ২৫ বলে ৫৩ রান করে ম্য়াচের সেরা হন জয়সওয়াল। ৯ বলে ৩১ রানের ইনিংস খেলেন রিঙ্কু সিংহ। মুম্বইয়ে হার্দিক? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); আইপিএলে গুজরাত টাইটান্স (Gujrat Titans) ও মুম্বই ইন্ডিয়ান্সের (Mumbai Indians) দল নিয়েই গত কয়েকদিন সবচেয়ে বেশি আগ্রহ দেখিয়েছিলেন ক্রিকেটপ্রেমীরা। আর তার নেপথ্যে ছিলেন হার্দিক পাণ্ড্য (Hardik Pandya)। প্রথমে খবর ছিল যে হার্দিক মুম্বইয়ে তাঁর পুরনো দলে ফিরছেন। আজ যদিও গুজরাত টাইটান্স যখন তাঁদের ক্রিকেটারদের তালিকা প্রকাশ করে তখন দেখা গেল যে হার্দিককে (Hardik Pandya) দলে রেখেছে তারা। কিন্তু রান বাড়তে বাড়তেই ফের গল্পে নতুন মোড়। সূত্রের খবর, হার্দিককে দলে ফেরাচ্ছে নীতা আম্বানির দল। তবে কোনও ক্রিকেটারের বদলে নয়। সরাসরি টাকার বিনিময়ে গুজরাত ফ্র্যাঞ্চাইজি থেকে হার্দিককে দলে নিয়ে নিয়েছে মুম্বই শিবির। বঢোদরা অলরাউন্ডার নাকি সরকারি সই সবুদও করে ফেলেছেন। নতুন মরসুমে রোহিত শর্মার নেতৃত্বে নিজের প্রথম আইপিএল দল মুম্বইয়ের হয়েই খেলবেন হার্দিক। অন্যদিকে, কানাঘুষো শোনা যাচ্ছে যে নতুন মরসুমের জন্য় গুজরাতের অধিনায়ক হচ্ছেন শুভমন গিল। প্রায় ৭২ ঘণ্টার নাটকে যেন যবনিকা পতন হল প্রায়। কাকে ছাড়ল কেকেআর? কাকেই বা ধরে রাখল? আইপিএল ে (IPL 2024) নতুন মরসুমের আগে মোট ১২ জন প্লেয়ারকে ছেড়ে দিল কেকেআর(Kolkata Knight Riders) । তাঁদের মধ্যে রয়েছেন- শাকিব আল হাসান, লিটন দাস, ডেভিড উইজি, আর্য দেশাই, নারায়ণ জগদীশান, কুলওন্ত খেজরিওয়ালিয়া, শার্দুল ঠাকুর, লকি ফার্গুসন, উমেশ যাদব, টিম সাউদি, জনসন চার্লস। কেকেআর শিবির ধরে রাখল যাঁদের তাঁদের নাম দেখে নেওয়া যাক - নীতিশ রানা, শ্রেয়স আইয়ার , রিঙ্কু সিংহ, রহমনউল্লাহ গুরবাজ, সুনীল নারাইন , জেসন রয়, সুয়াশ শর্মা, অনুকূল রয়, আন্দ্রে রাসেল , ভেঙ্কটেশ আইয়ার, হর্ষিত রানা, বৈভব আরোরা, বরুণ চক্রবর্তী। প্রাণ বাঁচালেন শামি বাইশ গজের বাইরেও ফের নামভূমিকায় ক্রিকেটার মহম্মদ শামি। উত্তরাখণ্ডে দুর্ঘটনাগ্রস্তের কাছে ত্রাতা হয়ে উঠলেন তিনি। পাহাড়ের ঢাল বেয়ে গড়িয়ে পড়া গাড়ির যাত্রীকে রক্ষা করতে ছুটে গেলেন শামি। নিরাপদে উদ্ধারও করে আনলেন দুর্ঘটনাগ্রস্তকে। আশেপাশের মানুষও সাহায্যে এগিয়ে এসেছিলেন বলে যদিও জানিয়েছেন শামি। কিন্তু নিজের গরজে যেভাবে দুর্ঘটনাগ্রস্ত ব্যক্তিকে রক্ষা করেন তিনি, তাতে এই মুহূর্তে শামির প্রশংসায় পঞ্চমুখ নেটদুনিয়া। var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/storyblock.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2023-11-26 19:13:15","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/27/5765b3de7f4fe675a6e182f8a63cdb761701025531549206_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"d916377aac13671d6c071e52f4a50b73","title":"Aditi Ashok wins Ladies European Tour season-ending title","link":"https://www.hindustantimes.com/sports/others/aditi-ashok-wins-ladies-european-tour-season-ending-title-101701019988299.html","keywords":null,"creator":null,"video_url":null,"description":"India’s top woman golfer made a late surge to win the Andalucia Costa Del Sol Open in Spain by two shots for her fifth win on the tour","content":"Aditi Ashok showcased her game and grit, holding her nerves in the final holes to card a final round 66 and pull off an exciting two-shot victory over Dutch woman Anne Van Dam in the Andalucia Costa Del Sol Open, the year-ending tournament on the Ladies European Tour on Sunday. It has been a brilliant season for Aditi with the changes she had made to her swing clearly raising her game to another leve(Getty Images via AFP) The 25-year-old started and finished her season on LET in style, having won the opening event, the Magical Kenya Ladies Open, by nine shots in February. It is the biggest victory for the Bengaluru golfer, who pocketed a winner’s purse of € 97,500. We're now on WhatsApp. Click to join. Aditi finished on 17-under par (69, 68, 68, 66 =271), ahead of Anne (69, 71, 65, 68= 273). India’s Diksha Dagar was tied seventh at 10-under (72, 71, 68, 67= 278), though she finished third in the Race to Costa Del Sol (LET Order of Merit) rankings with Aditi, who played only eight events, fourth. Thailand’s Trichat Cheenglab won the title despite a tied 55th finish. It has been a brilliant season for Aditi with the changes she had made to her swing clearly raising her game to another level. Besides the two wins on LET this season, she was second in the Saudi Ladies International, third in the Lalla Meryem Cup, all in February, and won silver in the Hangzhou Asian Games. Tied second through the second and third rounds, Aditi trailed Dutch playing partner Anne Van Dam, a five-time winner on the LET who led by one shot until drama unfolded on the 15th hole leading to a rousing finish under the afternoon Spanish sun. Anne’s tee shot on the par-five hole veered to the right and settled amid stones next to a tree, forcing her to lay up on the fairway, find the fringe of the green with her third, and eventually saving par. Aditi, flawless from tee to green, birdied with a brilliant putt off at least 17 feet to tie for the lead. Her precision off the tee on the par-3 16th then left her with a two-footer for birdie while Anne’s tee shot spun back to 15 feet off the pin and she two-putted for par. The par-14 17th showcased Aditi’s skill and temperament. The driver off the tee and an accurate second shot left her with an 8-foot putt for birdie, which she sank. Her fourth birdie in five holes – she had five birdies on the back nine, including three in a row from the 15th to 17th – left her with a two-shot cushion going into the final hole. Anne was again frustrated after her 25-foot birdie attempt rolled to the left of the hole, leaving her with another par. The drama wasn’t over. On the 18th, Aditi found the fairway rough to the right and landed her second shot on the bunker, leaving her with a tricky third to get on the sloping green. Although Anne’s second shot landed nine feet off the pin, she needed a birdie and the Indian had to bogey to force a tie. But Aditi was creative with the wedge, aiming for the fringe of the green to get the ball to roll down the slope to three feet off the hole, sealing a great win. “I started slow and missed some birdies, but glad it picked up on the back nine,” a delighted Aditi said after receiving the winner’s trophy. “It was a great battle, especially Anna when she plays well...she is a great player.” Aditi (added: “She hit the trees and I made a great putt. That was the switch moment. And I made sure I had a good look at par on the 18th.” Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR N Ananthanarayanan N Ananthanarayanan has spent almost three decades with news agencies and newspapers, reporting domestic and international sport. He has a passion for writing on cricket and athletics. ...view detail Aditi Ashok","pubDate":"2023-11-26 18:27:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/11/26/1600x900/aditi_ashok_1701020049666_1701020049835.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5ae3676a2d246fd4b669e93c62deffc2","title":"WATCH: “We always find new methods to fail” – Zimbabwe captain Sikandar Raza after shock loss to Uganda","link":"https://3-mob.com/sport/watch-we-always-find-new-methods-to-fail-zimbabwe-captain-sikandar-raza-after-shock-loss-to-uganda/","keywords":["Cricket","Sport","Sikandar Raza","Zimbabwe Cricket"],"creator":["3-mob.com"],"video_url":null,"description":"Zimbabwe had no kind words for his side The post WATCH: “We always find new methods to fail” – Zimbabwe captain Sikandar Raza after shock loss to Uganda first appeared on Three Men On a Boat.","content":"Zimbabwe T20 international captain Sikandar Raza has spoken after his side’s shock loss to Uganda in the ICC Men’s T20 World Cup Qualifier Africa. The loss means Zimbabwe need results to go their way elsewhere for them to get a wicket to the main tournament next year. A dejected Raza did not have any kind of words for his side, who he said seemed to find ‘new methods to fail’. “The standard of cricket we are playing is quite tough, and difficult for watch,” the skipper said. He said in the interview that Zimbabwe seemed to bring its standards down against lesser teams which was a worry. Watch the while interview below:","pubDate":"2023-11-26 18:25:58","image_url":null,"source_id":"3mob","source_priority":1904716,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"0edc2d8b09bb0d9d48d327bc8ae880af","title":"India Beat Australia: দ্বিতীয় টি ২০ ম্যাচেও হার অস্ট্রেলিয়ার, ২-০ এগিয়ে গেল ভারত","link":"https://bangla.latestly.com/sports/cricket/india-beat-australia-in-second-t20-in-thiruvananthapuram-won-by-44-runs-266171.html","keywords":null,"creator":null,"video_url":null,"description":"দ্বিতীয় টি ২০ ম্যাচেও অস্ট্রেলিয়াকে হারিয়ে দিল ভারত। রবিবার থিরুভানাথাপুরমে প্রথম ইনিংসে ব্যাট করতে নেমে ২০ ওভারে মাত্র চার উইকেট হারিয়ে ২৩৫ রান করে ভারত। আর এই বিশাল রান তাড়া করতে নেমে ১৯১ রানে খেলা শেষ হয়ে যায় অস্ট্রেলিয়ার।","content":"থিরুভানাথাপুরম: দ্বিতীয় টি ২০ ম্যাচেও (2nd T20I) অস্ট্রেলিয়াকে হারিয়ে দিল ভারত (India beat Australia)। রবিবার থিরুভানাথাপুরমে (Thiruvananthapuram) প্রথম ইনিংসে ব্যাট করতে নেমে ২০ ওভারে মাত্র চার উইকেট হারিয়ে ২৩৫ রান করে ভারত। আর এই বিশাল রান তাড়া করতে নেমে ১৯১ রানে খেলা শেষ হয়ে যায় অস্ট্রেলিয়ার। প্রথম ইনিংসে দুর্দান্ত ব্যাটিং করে ভারতের শুরুটা ভালোই করেছিলেন যশস্বী জয়সওয়াল, ইশান কিষাণ ও ঋতুরাজ গায়কোয়াড়। যশস্বী ২৫ বলে ৯টি চার ও দুটি ছয় মেরে ৫৩ রান করেন। আর গায়কোয়াড় ৪৩ বলে তিনটি চার ও দুটি ছয় মেরে করেন ৫৮ রান। অন্যদিকে ইশান কিষাণের ব্যাট থেকে আসে ৩২ বলে ৫২। আর শেষদিকে রিঙ্কু সিং মাত্র ৯ বলে ৪টি চার ও দুটি ৬ মেরে ৩১ রান করে ভারতকে পৌঁছে দেয় ২৩৫-এ। এর জবাবে ব্যাট করতে নেমে প্রথম থেকেই ধস নামে অস্ট্রেলিয়ার ব্যাটিং লাইনআপে। মাত্র ৫৮ রানে ফিরে যান চারজন অজি ব্যাটসম্যান। পরে টিম ডেভিড ও মার্কাসের ৮১ রানের জুটি তাঁদের রান কিছুটা বাড়লেও ভারতের চিন্তার কারণ হয়নি। শেষে অস্ট্রেলিয়ান টি ২০ টিমের অধিনায়ক ম্যাথু ওয়েড ৪২ রান করে হারের ব্যবধান কিছুটা কমালেও ২০ ওভারে ৯ উইকেটে ১৯১ রানেই থেমে যায় তাঁদের ইনিংস। আরও পড়ুন: Hardik Pandya GT: জল্পনা উড়িয়ে হার্দিক পান্ডিয়াকে ধরে রাখল গুজরাট, মুম্বইকে কি প্রতীক্ষায় রাখল টাইটান্স A win by 44 runs in Trivandrum! 🙌 #TeamIndia take a 2⃣-0⃣ lead in the series 👏👏 Scorecard ▶️ https://t.co/nwYe5nOBfk #INDvAUS | @IDFCFIRSTBank pic.twitter.com/sAcQIWggc4 — BCCI (@BCCI) November 26, 2023","pubDate":"2023-11-26 18:04:32","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"bengali"},{"article_id":"730d895cfe329abd91d37b0abddd58f8","title":"IND vs AUS 2nd T20I HIGHLIGHTS: India Beat Australia By 44 Runs, Go 2-0 Up In Five-Match Series","link":"https://news.abplive.com/sports/cricket/ind-vs-aus-2nd-t20i-highlights-india-beat-australia-by-44-runs-thiruvananthapuram-1645382","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"India have beaten Australia by 44 runs in the second T20I of the five-match series at the Greenfield International Stadium in Thiruvananthapuram on Sunday (November 26). Australia won the toss and elected to bowl first in this fixture but each of India's top three batters scored half-centuries to lay a solid foundation for the Men in Blue. Yashasvi Jaiswal scored 53 off 25, Ruturaj Gaikwad scored 58 off 43 and Ishan Kishan made 52 off 32 before a handly little cameo from Rinku Singh worth 9-ball 31* that propelled them to a score of 235/4. Yashasvi Jaiswal receives the Player of the Match award for his solid opening act with the bat 👏👏#TeamIndia complete a 44-run win over Australia in the 2nd T20I 👌👌Scorecard ▶️ https://t.co/nwYe5nOBfk#INDvAUS | @IDFCFIRSTBank pic.twitter.com/smMRxGogSy — BCCI (@BCCI) November 26, 2023 In the run chase, Australia lost three wickets inside the powerplay and were always behind in the second innings. The two spinners Ravi Bishnoi and Axar Patel got the early breakthroughs for the hosts before the pacers joined in. Bishnoi eventually returned with figures of 3 for 32 while Prasidh too picked 3 for 41. There was only one partnership that seemed to threaten India's strong total which was the fifth-wicket partnership worth 81 off 38 between Tim David (37 off 22) and Marcus Stoinis (45 off 25). Once India broke the partnership, the match never looked out of their grasp and they eventually completed a dominant victory.From the southernmost international cricket venue  in India, the series focus will now head to the easternmost international cricket venue in the country with the third match of the series set to be played at the Barsapara Stadium in Guwahati. Another commanding performance by Team India, securing a 2-0 lead in the T20I series against Australia! Kudos to our dynamic openers @ybj_19 and @Ruutu1331 for setting the stage on fire with their explosive fifties. @ishankishan51, holding his ground at number 3, played yet… pic.twitter.com/pqGFUSM9Kj — Jay Shah (@JayShah) November 26, 2023","content":"India have beaten Australia by 44 runs in the second T20I of the five-match series at the Greenfield International Stadium in Thiruvananthapuram on Sunday (November 26). Australia won the toss and elected to bowl first in this fixture but each of India's top three batters scored half-centuries to lay a solid foundation for the Men in Blue. Yashasvi Jaiswal scored 53 off 25, Ruturaj Gaikwad scored 58 off 43 and Ishan Kishan made 52 off 32 before a handly little cameo from Rinku Singh worth 9-ball 31* that propelled them to a score of 235/4. Yashasvi Jaiswal receives the Player of the Match award for his solid opening act with the bat 👏👏 #TeamIndia complete a 44-run win over Australia in the 2nd T20I 👌👌 Scorecard ▶️ https://t.co/nwYe5nOBfk #INDvAUS | @IDFCFIRSTBank pic.twitter.com/smMRxGogSy — BCCI (@BCCI) November 26, 2023 In the run chase, Australia lost three wickets inside the powerplay and were always behind in the second innings. The two spinners Ravi Bishnoi and Axar Patel got the early breakthroughs for the hosts before the pacers joined in. Bishnoi eventually returned with figures of 3 for 32 while Prasidh too picked 3 for 41. There was only one partnership that seemed to threaten India's strong total which was the fifth-wicket partnership worth 81 off 38 between Tim David (37 off 22) and Marcus Stoinis (45 off 25). Once India broke the partnership, the match never looked out of their grasp and they eventually completed a dominant victory. From the southernmost international cricket venue in India, the series focus will now head to the easternmost international cricket venue in the country with the third match of the series set to be played at the Barsapara Stadium in Guwahati. Another commanding performance by Team India, securing a 2-0 lead in the T20I series against Australia! Kudos to our dynamic openers @ybj_19 and @Ruutu1331 for setting the stage on fire with their explosive fifties. @ishankishan51 , holding his ground at number 3, played yet… pic.twitter.com/pqGFUSM9Kj googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); — Jay Shah (@JayShah) November 26, 2023","pubDate":"2023-11-26 17:23:10","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/26/51c0a3a98e1b8fb79592645b0e98400a1701018684952625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"81d191cd26acc7768072006dc03c3c55","title":"Bowling woes for Australia in second T20 loss to India","link":"https://www.watoday.com.au/sport/cricket/bowling-woes-for-australia-in-second-t20-loss-to-india-20231127-p5emxd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"A ragged Australian bowling display allowed the home side to plunder a mammoth 4-235 in Thiruvananthapuram.","content":"India’s top order fired on all cylinders to fashion a 44-run win over Australia to put the home side 2-0 ahead in the five-match T20 series in Thiruvananthapuram on Sunday. Put in to bat, India’s top three batters smashed rapid fifties to power the hosts to a commanding 4-235 at the Greenfield International Stadium. India’s Rinku Singh hammered 31 of nine balls at the death. Credit: Getty Images In reply, Australia failed to fully recover from a top-order collapse and managed only 9-191. Australia beat India in the final of the 50-overs World Cup earlier this month and both teams have fielded second-string squads for the T20 series. Ruturaj Gaikwad (58), Yashasvi Jaiswal (53), Ishan Khan (52) and Rinku Singh (31no off nine balls) capitalised on the tourists’ waywardness with the ball. India’s total was their highest in T20s against Australia – surpassing their previous best of 8-209 set three days ago at Visakhapatnam – and easily the best score at Greenfield International Stadium. Australia’s Marcus Stoinis fell for 45 of 25 balls. Credit: AP Australia bowled poorly in the powerplay before regularly losing control as the dew set in early, dishing up 12 wides and a no-ball via a chest-high full-toss from Glenn Maxwell. Nathan Ellis (3-45) picked up three of the four wickets but was expensive in doing so, Sean Abbott’s three overs were dispatched for 56 and Australia’s three spinners were ineffective.","pubDate":"2023-11-26 17:20:35","image_url":null,"source_id":"watoday","source_priority":347743,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c16a6ac7b4a1b1d202f030aee01837ca","title":"Bowling woes for Australia in second T20 loss to India","link":"https://www.smh.com.au/sport/cricket/bowling-woes-for-australia-in-second-t20-loss-to-india-20231127-p5emxd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"A ragged Australian bowling display allowed the home side to plunder a mammoth 4-235 in Thiruvananthapuram.","content":"India’s top order fired on all cylinders to fashion a 44-run win over Australia to put the home side 2-0 ahead in the five-match T20 series in Thiruvananthapuram on Sunday. Put in to bat, India’s top three batters smashed rapid fifties to power the hosts to a commanding 4-235 at the Greenfield International Stadium. India’s Rinku Singh hammered 31 of nine balls at the death. Credit: Getty Images In reply, Australia failed to fully recover from a top-order collapse and managed only 9-191. Australia beat India in the final of the 50-overs World Cup earlier this month and both teams have fielded second-string squads for the T20 series. Ruturaj Gaikwad (58), Yashasvi Jaiswal (53), Ishan Khan (52) and Rinku Singh (31no off nine balls) capitalised on the tourists’ waywardness with the ball. India’s total was their highest in T20s against Australia – surpassing their previous best of 8-209 set three days ago at Visakhapatnam – and easily the best score at Greenfield International Stadium. Australia’s Marcus Stoinis fell for 45 of 25 balls. Credit: AP Australia bowled poorly in the powerplay before regularly losing control as the dew set in early, dishing up 12 wides and a no-ball via a chest-high full-toss from Glenn Maxwell. Nathan Ellis (3-45) picked up three of the four wickets but was expensive in doing so, Sean Abbott’s three overs were dispatched for 56 and Australia’s three spinners were ineffective. Jaiswal was the early aggressor, dominating India’s 1-77 powerplay, which was their best in T20s against Australia. The 21-year-old opener welcomed Abbott to the bowling crease by going 4-4-4-6-6 to bring up his half-century inside the fourth over. After Jaiswal miscued Ellis to Adam Zampa, Ishan Kishan took over and targeted Australia’s spinners. He raised his 50 by walloping Tanveer Sangha for back-to-back sixes before slicing a wide, off-balance, one-handed shot to Ellis in the deep. Gaikwad was the anchor of the innings, becoming the third Indian batter to move past 50. Acting captain Suryakumar Yadav, game one hero Rinku and Tilak Varma all teed off at the death, Australia’s last two overs thumped for 45. Australia faltered early in their chase and were reeling at 4-58 in the eighth over before Marcus Stoinis (45) and Tim David (37) arrested the slide. Wade made 42 not out down the order, but Australia still finished well short of their target. The teams now move to Guwahati for the third ODI on Tuesday. AAP, Reuters News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-11-26 17:20:35","image_url":null,"source_id":"smh","source_priority":6729,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"fdbfda5233eaf36afa1b310f6adad683","title":"IPL 2024 Auction: Full List Of Players Retained, Released And Traded By 10 Franchises","link":"https://news.abplive.com/sports/cricket/ipl-2024-auction-full-list-of-players-retained-released-and-traded-by-10-franchises-csk-dc-gt-kkr-lsg-mi-pbks-rr-rcb-srh-1645377","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"All the ten Indian Premier League (IPL) franchises released the list of retained and released players on retention deadline day. The headline was Gujarat Titans (GT) retaining Hardik Pandya as captain with reports emerging that he would be traded to Mumbai Indians (MI).Take a look at the complete list of released, retained and traded players by each of the 10 participating teams in the IPL:Chennai Super Kings (CSK) Retained players: MS Dhoni (captain and wicketkeeper), Moeen Ali, Deepak Chahar, Devon Conway (wk), Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Ajay Mandal, Mukesh Choudhary, Matheesha Pathirana, Ajinkya Rahane, Shaik Rasheed, Mitchell Santner, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Released players: Ben Stokes, Dwaine Pretorius, Bhagath Varma, Subhranshu Senapati, Ambati Rayudu, Kyle Jamieson, Akash Singh, Sisanda Magala. Delhi Capitals (DC)Retained Players: Rishabh Pant, Pravin Dubey, David Warner, Vicky Ostwal, Prithvi Shaw, Anrich Nortje, Abishek Porel, Kuldeep Yadav, Axar Patel, Lungi Ngidi, Lalit Yadav, Khaleel Ahmed, Mitchell Marshm, Ishant Sharma, Yash Dhull, Mukesh Kumar. Released Players: Rilee Rossouw, Chetan Sakariya, Rovman Powell, Manish Pandey, Phil Salt, Mustafizur Rahman, Kamlesh Nagarkoti, Ripal Patel, Sarfaraz Khan, Aman Khan, Priyam Garg.Gujarat Titans (GT) Released players: Yash Dayal, KS Bharat, Shivam Mavi, Urvil Patel, Pradeep Sangwan, Odean Smith, Alzarri Joseph, Dasun Shanaka Retained players: Hardik Pandya (captain), David Miller, Shubman Gill, Matthew Wade, Wriddhiman Saha, Kane Williamson, Abhinav Manohar, B Sai Sudharsan, Darshan Nalkande, Vijay Shankar, Jayant Yadav, Rahul Tewatia, Mohammed Shami, Noor Ahmad, Sai Kishore, Rashid Khan, Joshua Little, Mohit SharmaKolkata Knight Riders (KKR) Retained players: Nitish Rana, Rinku Singh, Rahmanullah Gurbaz, Shreyas Iyer, Jason Roy, Sunil Narine, Suyash Sharma, Anukul Roy, Andre Russell, Venkatesh Iyer, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy Released players: Shakib Al Hasan, Litton Das, Aarya Desai, David Wiese, Narayan Jagadeesan, Mandeep Singh, Kulwant Khejroliya, Shardul Thakur, Lockie Ferguson, Umesh Yadav, Tim Southee, Johnson CharlesLucknow Super Giants (LSG) Released players: Jaydev Unadkat, Daniel Sams, Manan Vohra, Swapnil Singh, Karan Sharma, Arpit Guleria, Suryansh Shedge, Karun Nair Retained players: KL Rahul (captain), Quinton de Kock, Nicholas Pooran, Ayush Badoni, Kyle Mayers, Marcus Stoinis, Deepak Hooda, Ravi Bishnoi, Naveen ul Haq, Krunal Pandya, Yudhvir Singh, Prerak Mankad, Yash Thakur, Amit Mishra, Mark Wood, Mayank Yadav, Mohsin Khan Traded players: Devdutt Padikkal (from Rajasthan Royals) Mumbai Indians (MI)Released players: Mohd. Arshad Khan, Ramandeep Singh, Hrithik Shokeen, Raghav Goyal, Jofra Archer, Tristan Stubbs, Duan Jansen, Jhye Richardson, Riley Meredith, Chris Jordan, Sandeep WarrierRetained players: Rohit Sharma (captain), Dewald Brevis, Suryakumar Yadav, Ishan Kishan, N. Tilak Verma, Tim David, Vishnu Vinod, Arjun Tendulkar, Cameron Green, Shams Mulani, Nehal Wadhera, Jasprit Bumrah, Kumar Kartikeya, Piyush Chawla, Akash Madhwal, Jason Behrendorff Traded players: Romario Shepherd (traded in from Lucknow Super Giants)Punjab Kings (PBKS)Retained Players: Shikhar Dhawan (captain), Matthew Short, Prabhsimran Singh (wicketkeeper), Jitesh Sharma (wicketkeeper), Sikandar Raza, Rishi Dhawan, Liam Livingstone, Atharva Taide, Arshdeep Singh, Nathan Ellis, Sam Curran, Kagiso Rabada, Harpreet Brar, Rahul Chahar, Harpreet Bhatia, Vidwath Kaverappa, Shivam Singh Released: Mohit Rathee, Raj Bawa, Shahrukh Khan, Bhanuka Rajapaksa, Baltej Singh Rajasthan Royals (RR)Retained Players: Sanju Samson (Captain), Jos Buttler, Shimron Hetmyer, Yashasvi Jaiswal, Dhruv Jurel, Riyan Parag, Donovan Ferreira, Kunal Rathore, Ravichandran Ashwin, Kuldeep Sen, Navdeep Saini, Prasidh Krishna, Sandeep Sharma, Trent Boult, Yuzvendra Chahal, Adam Zampa. Released players: Joe Root, Abdul Basith, Jason Holder, Akash Vashisht, Kuldip Yadav, Obed McCoy, Murugan Ashwin, KC Cariappa, KM Asif. Traded: Avesh Khan Royal Challengers Bangalore (RCB)Released players: Wanindu Hasaranga, Harshal Patel, Josh Hazlewood, Finn Allen, Michael Bracewell, David Willey, Wayne Parnell, Sonu Yadav, Avinash Singh, Siddarth Kaul, Kedar Jadhav Retained players: Faf du Plessis (captain), Glenn Maxwell, Virat Kohli, Rajat Patidar, Anuj Rawat, Dinesh Karthik, Suyash Prabhudessai, Will Jacks, Mahipal Lomror, Karn Sharma, Manoj Bhandage, Vyshak Vijaykumar, Akash Deep, Mohammed Siraj, Reece Topley, Himanshu Sharma, Rajan Kumar Traded players: Mayank Dagar (from Sunrisers Hyderabad) Sunrisers Hyderabad (SRH)Released players: Harry Brook, Samarth Vyas, Kartik Tyagi, Vivrant Sharma, Akeal Hosein, Adil Rashid Retained players: Abdul Samad, Aiden Markram (captain), Rahul Tripathi, Glenn Phillips, Heinrich Klaasen, Mayank Agarwal, Anmolpreet Singh, Upendra Singh Yadav, Nitish Kumar Reddy, Abhishek Sharma, Marco Jansen, Washington Sundar, Sanvir Singh, Bhuvneshwar Kumar, T Natarajan, Mayank Markande, Umran Malik, Fazalhaq Farooqi Traded players: Shahbaz Ahmed (from Royal Challengers Bangalore)","content":"All the ten Indian Premier League (IPL) franchises released the list of retained and released players on retention deadline day. The headline was Gujarat Titans (GT) retaining Hardik Pandya as captain with reports emerging that he would be traded to Mumbai Indians (MI). Take a look at the complete list of released, retained and traded players by each of the 10 participating teams in the IPL: Chennai Super Kings (CSK) Retained players: MS Dhoni (captain and wicketkeeper), Moeen Ali, Deepak Chahar, Devon Conway (wk), Tushar Deshpande, Shivam Dube, Ruturaj Gaikwad, Rajvardhan Hangargekar, Ravindra Jadeja, Ajay Mandal, Mukesh Choudhary, Matheesha Pathirana, Ajinkya Rahane, Shaik Rasheed, Mitchell Santner, Simarjeet Singh, Nishant Sindhu, Prashant Solanki, Maheesh Theekshana. Released players: Ben Stokes, Dwaine Pretorius, Bhagath Varma, Subhranshu Senapati, Ambati Rayudu, Kyle Jamieson, Akash Singh, Sisanda Magala. Delhi Capitals (DC) Retained Players: Rishabh Pant, Pravin Dubey, David Warner, Vicky Ostwal, Prithvi Shaw, Anrich Nortje, Abishek Porel, Kuldeep Yadav, Axar Patel, Lungi Ngidi, Lalit Yadav, Khaleel Ahmed, Mitchell Marshm, Ishant Sharma, Yash Dhull, Mukesh Kumar. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Released Players: Rilee Rossouw, Chetan Sakariya, Rovman Powell, Manish Pandey, Phil Salt, Mustafizur Rahman, Kamlesh Nagarkoti, Ripal Patel, Sarfaraz Khan, Aman Khan, Priyam Garg. Gujarat Titans (GT) Released players: Yash Dayal, KS Bharat, Shivam Mavi, Urvil Patel, Pradeep Sangwan, Odean Smith, Alzarri Joseph, Dasun Shanaka Retained players: Hardik Pandya (captain), David Miller, Shubman Gill, Matthew Wade, Wriddhiman Saha, Kane Williamson, Abhinav Manohar, B Sai Sudharsan, Darshan Nalkande, Vijay Shankar, Jayant Yadav, Rahul Tewatia, Mohammed Shami, Noor Ahmad, Sai Kishore, Rashid Khan, Joshua Little, Mohit Sharma Kolkata Knight Riders (KKR) Retained players: Nitish Rana, Rinku Singh, Rahmanullah Gurbaz, Shreyas Iyer, Jason Roy, Sunil Narine, Suyash Sharma, Anukul Roy, Andre Russell, Venkatesh Iyer, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy Released players: Shakib Al Hasan, Litton Das, Aarya Desai, David Wiese, Narayan Jagadeesan, Mandeep Singh, Kulwant Khejroliya, Shardul Thakur, Lockie Ferguson, Umesh Yadav, Tim Southee, Johnson Charles Lucknow Super Giants (LSG) Released players: Jaydev Unadkat, Daniel Sams, Manan Vohra, Swapnil Singh, Karan Sharma, Arpit Guleria, Suryansh Shedge, Karun Nair Retained players: KL Rahul (captain), Quinton de Kock, Nicholas Pooran, Ayush Badoni, Kyle Mayers, Marcus Stoinis, Deepak Hooda, Ravi Bishnoi, Naveen ul Haq, Krunal Pandya, Yudhvir Singh, Prerak Mankad, Yash Thakur, Amit Mishra, Mark Wood, Mayank Yadav, Mohsin Khan Traded players: Devdutt Padikkal (from Rajasthan Royals) Mumbai Indians (MI) Released players: Mohd. Arshad Khan, Ramandeep Singh, Hrithik Shokeen, Raghav Goyal, Jofra Archer, Tristan Stubbs, Duan Jansen, Jhye Richardson, Riley Meredith, Chris Jordan, Sandeep Warrier Retained players: Rohit Sharma (captain), Dewald Brevis, Suryakumar Yadav, Ishan Kishan, N. Tilak Verma, Tim David, Vishnu Vinod, Arjun Tendulkar, Cameron Green, Shams Mulani, Nehal Wadhera, Jasprit Bumrah, Kumar Kartikeya, Piyush Chawla, Akash Madhwal, Jason Behrendorff Traded players: Romario Shepherd (traded in from Lucknow Super Giants) Punjab Kings (PBKS) Retained Players: Shikhar Dhawan (captain), Matthew Short, Prabhsimran Singh (wicketkeeper), Jitesh Sharma (wicketkeeper), Sikandar Raza, Rishi Dhawan, Liam Livingstone, Atharva Taide, Arshdeep Singh, Nathan Ellis, Sam Curran, Kagiso Rabada, Harpreet Brar, Rahul Chahar, Harpreet Bhatia, Vidwath Kaverappa, Shivam Singh Released: Mohit Rathee, Raj Bawa, Shahrukh Khan, Bhanuka Rajapaksa, Baltej Singh Rajasthan Royals (RR) Retained Players: Sanju Samson (Captain), Jos Buttler, Shimron Hetmyer, Yashasvi Jaiswal, Dhruv Jurel, Riyan Parag, Donovan Ferreira, Kunal Rathore, Ravichandran Ashwin, Kuldeep Sen, Navdeep Saini, Prasidh Krishna, Sandeep Sharma, Trent Boult, Yuzvendra Chahal, Adam Zampa. Released players: Joe Root, Abdul Basith, Jason Holder, Akash Vashisht, Kuldip Yadav, Obed McCoy, Murugan Ashwin, KC Cariappa, KM Asif. Traded: Avesh Khan Royal Challengers Bangalore (RCB) Released players: Wanindu Hasaranga, Harshal Patel, Josh Hazlewood, Finn Allen, Michael Bracewell, David Willey, Wayne Parnell, Sonu Yadav, Avinash Singh, Siddarth Kaul, Kedar Jadhav Retained players: Faf du Plessis (captain), Glenn Maxwell, Virat Kohli, Rajat Patidar, Anuj Rawat, Dinesh Karthik, Suyash Prabhudessai, Will Jacks, Mahipal Lomror, Karn Sharma, Manoj Bhandage, Vyshak Vijaykumar, Akash Deep, Mohammed Siraj, Reece Topley, Himanshu Sharma, Rajan Kumar Traded players: Mayank Dagar (from Sunrisers Hyderabad) Sunrisers Hyderabad (SRH) Released players: Harry Brook, Samarth Vyas, Kartik Tyagi, Vivrant Sharma, Akeal Hosein, Adil Rashid Retained players: Abdul Samad, Aiden Markram (captain), Rahul Tripathi, Glenn Phillips, Heinrich Klaasen, Mayank Agarwal, Anmolpreet Singh, Upendra Singh Yadav, Nitish Kumar Reddy, Abhishek Sharma, Marco Jansen, Washington Sundar, Sanvir Singh, Bhuvneshwar Kumar, T Natarajan, Mayank Markande, Umran Malik, Fazalhaq Farooqi Traded players: Shahbaz Ahmed (from Royal Challengers Bangalore)","pubDate":"2023-11-26 16:18:47","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/11/26/6ac9493d38ece225bfcae26a765093e81701015490508625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d3ae59e6194ad43b7a198e52d4abaffc","title":"Bartlett makes New Zealand XI","link":"https://times-age.co.nz/sports/bartlett-in-nz-xi/","keywords":["Cricket","Rugby","Softball","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"CRICKET Southey Sayer Wairarapa Korus, captain and allrounder Ocean Bartlett, has been named in a New Zealand XI squad to play two warm-up games against the visiting Pakistani women’s team this week. The teams will play a one-day 50-0ver match tomorrow and a T20 match on Thursday, with both games at Bert Sutcliffe Oval at […]","content":"CRICKET Southey Sayer Wairarapa Korus, captain and allrounder Ocean Bartlett, has been named in a New Zealand XI squad to play two warm-up games against the visiting Pakistani women’s team this week. The teams will play a one-day 50-0ver match tomorrow and a T20 match on Thursday, with both games at Bert Sutcliffe Oval at Lincoln. RUGBY SEVENS Wairarapa-Bush narrowly missed a place in the women’s final of the Central Zone Rugby Sevens at Massey University on Saturday. The green and reds qualified for the second vs three semifinal after a 29–5 loss to Hawke’s Bay, a 22–17 win over Whanganui, and a 39–0 loss to eventual champions Manawatū. That set up a semifinal with Hawke’s Bay, which Wai-Bush led until the final 24 seconds when the injury-hit side conceded a match-winning try. Wai-Bush finished third in the men’s competition, which was reduced to three teams after the late withdrawal of Whanganui on Friday night. A first-up 24–7 loss to Manawatū was followed by a 49–5 defeat to Hawke’s Bay, who finished the tournament unbeaten. CRICKET The weather had the final say in the fourth round of the Bidwill Cup premier club championship, with both games abandoned without a ball being bowled. With two rounds to play, the Barbarians lead on 50 points, Inspire Living Greytown are on 39, Burger King Red Star 38, and Lansdowne have 22 points.","pubDate":"2023-11-26 16:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/11/RS479297_051-scaled-e1699423886635-1024x583.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"491890ecab8de4ac33e656d7e7e28bf1","title":"Mohamed Salah reveals he is ‘addicted’ to online chess: ‘Hope to play Magnus Carlsen some day’","link":"https://www.hindustantimes.com/sports/others/mohamed-salah-reveals-he-is-addicted-to-online-chess-hope-to-play-magnus-carlsen-some-day-101701013193929.html","keywords":null,"creator":null,"video_url":null,"description":"Liverpool star Mohamed Salah has revealed that he plays online chess almost every day with random people.","content":"Liverpool star Mohamed Salah has revealed that he is an avid online chess player and wants to meet five-time world champion Magnus Carlsen. The Egyptian forward, widely rated among the best football players in the world, said that he plays chess online “every day, literally every day.” Salah said that he wishes to play five-time champion Carlsen some day. “I play chess, I am addicted to chess,\" said Salah on Sky Sports. He further said that he is not going to reveal the name he uses online while playing the sport but there have been a few opponents who would ask him if he is Salah himself. “I am not saying my name. I put my name and some other numbers so some people they ask ‘are you Mo Salah,’ I say ‘yes,’ they don’t believe it, and say ‘you are lying.’ I say ‘yes, I’m lying,'\" he said. We're now on WhatsApp. Click to join. Salah said that he is also rated around 1400. “I’m good, I’m not Magnus, but I’m good. No one has a chance with Magnus. But hopefully we will play one day.” Carlsen, on the other hand, is known to be a huge fan of football and of Salah himself. The Norwegian has regularly featured Salah on his Fantasy Premier League squad that took him to the top of the game with more than 7 million players. The former world champion appeared to accept the invitation and took to X/Twitter on Sunday to respond with a simple emoji, tagging Salah. Incidentally, Salah's Liverpool teammate Trent Alexander-Arnold played Carlsen in an exhibition match in Manchester, England back in 2018. Alexander-Arnold ended up losing in 17 moves. \"I've been playing chess since I was very young, and I've always enjoyed it. It's hard to find someone who wants to play as much as me,\" he had said. Salah further said that while he never played any other sport apart from football when he was young, he has now dabbled with other sports. \"I play paddle tennis pretty well, tennis sometimes. I play golf, surprisingly. Not like a proper English guy but I play good gold for an Egyptian,\" he said. Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Sports Desk At HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more. ...view detail Mohamed Salah Magnus Carlsen","pubDate":"2023-11-26 15:56:36","image_url":"https://www.hindustantimes.com/ht-img/img/2023/11/26/1600x900/salah_carlsen_1701014024486_1701014029628.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"}]}