{"newsArray":[{"title":"Lyon offers cheeky advice to struggling Burns","link":"https://www.news.com.au/sport/cricket/lyon-offers-cheeky-advice-to-struggling-burns/video/bb5441203d798ec96740b58e2f0dbe4e","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Nathan Lyon offered Rory Burns some friendly advice after the struggling England opener had trouble picking the GOAT.","content":null,"pubDate":"2021-12-19 22:28:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Lyon offers cheeky advice to struggling Burns","link":"https://www.cairnspost.com.au/sport/cricket/lyon-offers-cheeky-advice-to-struggling-burns/video/bb5441203d798ec96740b58e2f0dbe4e","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Nathan Lyon offered Rory Burns some friendly advice after the struggling England opener had trouble picking the GOAT.","content":null,"pubDate":"2021-12-19 22:28:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ashes 2021-22: Adelaide drama forces broadcasters to think radical approach in trying to beat Covid - Daily Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL3d3dy5kYWlseXRlbGVncmFwaC5jb20uYXUvc3BvcnQvY3JpY2tldC9hc2hlcy0yMDIxMjAyMi1jb3ZpZC1kcmFtYS1zdHJpa2VzLWFkZWxhaWRlLXRlc3QtYWdhaW4vbmV3cy1zdG9yeS85ZjBmNDFiNWEwZTgxYTVjMmUzM2Y5Yjk2NmVkN2EwNdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2021-22: Adelaide drama forces broadcasters to think radical approach in trying to beat Covid  Daily TelegraphAshes Test struck by fresh Covid drama  NEWS.com.auAshes broadcast crew members test positive for COVID-19 in Adelaide  ABC NewsShould Pat play? Two cricket tragics come out swinging  The AdvertiserCovid chaos in the media ranks points to wider precarity of this Ashes series  The GuardianView Full coverage on Google News","content":null,"pubDate":"2021-12-19 21:19:47","image_url":null,"source_id":"google"},{"title":"Starc adds injury to insult for Joe Root","link":"https://www.news.com.au/sport/cricket/starc-adds-injury-to-insult-for-joe-root/video/e0b05d89886aca3cce015a44abf089ee","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Joe Root had a torrid time at the crease to end Day 4, first getting hit in the groin by Mitch Starc before being dismissed on the last ball of the day.","content":null,"pubDate":"2021-12-19 21:16:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"EXCLUSIVE: England suffering paralysis by analysis in disastrous Adelaide Test, Mark Taylor says - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC90aGUtYXNoZXMtMjAyMS1lbmdsYW5kLWF1c3RyYWxpYS1qb2Utcm9vdC1qYW1lcy1hbmRlcnNvbi1zdHVhcnQtYnJvYWQtbWFyay10YXlsb3ItZXhjbHVzaXZlLzFlYWVjODM2LTdmYWQtNGZkZi1hZmEwLWIxMWFhNDZlZjVlYtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE: England suffering paralysis by analysis in disastrous Adelaide Test, Mark Taylor says  Wide World of SportsCaptain mocked, Poms brought to their knees  NEWS.com.auTubby's Boring Story Gets Ruined By Joe Root's Wicket | Triple M Cricket  Triple MAshes live scores 2021-22 Australia v England: Start time, stats, stream  The AdvertiserRoot's horror day ends in even more pain  Tasmania ExaminerView Full coverage on Google News","content":null,"pubDate":"2021-12-19 20:54:30","image_url":null,"source_id":"google"},{"title":"Under 19 World Cup winners list: How many times India has won U 19 Cricket World Cup?","link":"https://thesportsrush.com/cricket-news-under-19-world-cup-winners-list-how-many-times-india-has-won-u-19-cricket-world-cup/","keywords":["Cricket","BCCI","ICC Under 19 World Cup 2022","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Under 19 World Cup winners list: Team India has lifted the ICC Under-19 Cricket World Cup for the maximum times in the tournament’s history. The BCCI’s all-India Junior Selection Committee on Sunday, announced a 17-member Team India squad for the upcoming ICC Under-19 men’s World Cup set to commence from January 14 in West Indies.… The post Under 19 World Cup winners list: How many times India has won U 19 Cricket World Cup? appeared first on The SportsRush.","content":"Under 19 World Cup winners list: Team India has lifted the ICC Under-19 Cricket World Cup for the maximum times in the tournament’s history. The BCCI’s all-India Junior Selection Committee on Sunday, announced a 17-member Team India squad for the upcoming ICC Under-19 men’s World Cup set to commence from January 14 in West Indies. Delhi’s Yash Dhull has been named as team India’s skipper for the tournament with Andhra Pradesh’s SK Rasheed picked as his deputy. The Priyam Garg-led Indian Under-19 side had agonizingly lost the final of the previous edition of the World Cup in 2020 against Bangladesh by 3 wickets in what was a humdinger of a match at Potchefstroom, South Africa. Rajasthan Royals’ opening batter Yashasvi Jaiswal was adjudged the ‘Player of the Tournament’ for amassing 400 runs across 6 innings at a stupendous average of 133.33. Rajasthan and former Punjab Kings’ leg-spinner Ravi Bishnoi was the tournament’s leading wicket-taker with 17 wickets across 6 innings at an average of 10.64. Under 19 World Cup winners list: How many times has India lifted the U-19 World Cup? India is the most successful team in the tournament’s history having lifted the coveted silverware four times in 2000, 2008, 2012 and 2018. They also finished as runner-ups in 2016 and 2020 edition of the tournament. Team India, led by Prithvi Shaw had last lifted the trophy in 2018 by comfortably defeating Australia by 8 wickets in the final played at Mount Maunganui in New Zealand. India had first won the tournament in the year 2000 under the captaincy of Mohammad Kaif. Highest stands for India in Under-19 World Cup: 183 : M Bisla/P Patel v Canada, Auckland, 2002 180 : M Kalra/P Shaw v Australia, Mount Maunganui, 2018 176 : Y Jaiswal/D Saxena v Pakistan, Potchefstroom, 2020* 175 : S Dhawan/R Uthappa v Scotland, Dhaka, 2004#U19CWC — Umang Pabari (@UPStatsman) February 4, 2020 Australia stand second having won the tournament thrice in 1988, 2002, and 2010 while Pakistan have won the coveted silverware twice in 2004 and 2006. England (1998), West Indies (2016), South Africa (2014) and Bangladesh (2020) have won bagged the silverware one time each in the 13 overall editions of the tournament. Under 19 World Cup winners list Winner Runner-up Year/Host Australia Pakistan 1988/Australia England New Zealand 1998/ South Africa India Sri Lanka 2000/Sri Lanka Australia South Africa 2002/New Zealand Pakistan West Indies 2004/Bangladesh Pakistan India 2006/Sri Lanka India South Africa 2008/Malaysia Australia Pakistan 2010/New Zealand India Australia 2012/Australia South Africa Pakistan 2014/UAE West Indies India 2016/Bangladesh India Australia 2018/New Zealand Bangladesh India 2020/South Africa TBD TBD 2022/West Indies             The post Under 19 World Cup winners list: How many times India has won U 19 Cricket World Cup? appeared first on The SportsRush.","pubDate":"2021-12-19 17:07:23","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Aakash Chopra on KL Rahul's elevation as Test vice-captain in South Africa: Things are changing in Indian cricket","link":"https://www.indiatoday.in/sports/cricket/story/aakash-chopra-on-kl-rahul-s-elevation-as-test-vice-captain-in-south-africa-things-are-changing-in-indian-cricket-1889681-2021-12-19?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Aakash Chopra on Rahul's elevation as Test vice-captain: Things are changing in IND cricket","content":null,"pubDate":"2021-12-19 16:35:56","full_description":"Former India opener Aakash Chopra reckons KL Rahul might get appointed the vice-captain of the national ODI team as well very soon after getting the post in Test cricket on the tour of South Africa earlier this week. Rahul has been asked to fill in the post after Rohit Sharma got ruled out of the Test series due to a hamstring injury. Chopra now feels that Rahul's elevation will put pressure on former vice-captain Ajinkya Rahane, who was replaced from the post by Rohit. “KL Rahul has been appointed as India’s Test vice-captain (for the South Africa series) as Rohit Sharma is injured. Rahul Dravid is the coach, Rohit is the captain of white-ball formats,” said Aakash Chopra in a video shared on Koo. “I think Rahul may be appointed vice-captain in ODIs also. Ajinkya Rahane might find it difficult to find a place in the XI. He was captain just a couple of Test matches ago but right now he’s not even the vice-captain. Things are changing in Indian cricket.\" Rahul was in good form with the bat in the England Tests earlier this year where he scored 315 runs from 4 matches but did not play the home series against New Zealand due to a muscle strain. For the selectors, it was difficult to go back to Rahane who is no longer a certainty in the Test XI and possibly it is too early for Rishabh Pant to be elevated as vice captain of the national team. Rahul, currenty, is seen as one of the few all-format specialist batter. Live TV Also Read | If Rohit gets Test captaincy from Kohli, it will be clear they are not getting along: Butt Also Read | Cheteshwar Pujara hopeful India can script history in South Africa Test series","image_url":null,"source_id":"indiatoday"},{"title":"England camp admit Adelaide Ashes mistakes","link":"https://www.perthnow.com.au/sport/cricket/england-camp-admit-adelaide-ashes-mistakes-c-5014346","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"England's cricket camp now accept that they picked the wrong team and misjudged conditions as they faced a second Test drubbing against Australia in Adelaide.","content":null,"pubDate":"2021-12-19 16:35:12","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5014346/8c8fc09dfcbad41baa0a13aa23f5ce1e5d8f9f16-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"England camp admit Adelaide Ashes mistakes","link":"https://thewest.com.au/sport/cricket/england-camp-admit-adelaide-ashes-mistakes-c-5014343","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"England's cricket camp now accept that they picked the wrong team and misjudged conditions as they faced a second Test drubbing against Australia in Adelaide.","content":null,"pubDate":"2021-12-19 16:35:12","full_description":"England's camp admit, in hindsight, they should have picked a different team for their calamitous second Ashes Test. And they also concede that they misjudged conditions for the day-night Test in Adelaide. They expected more swing. And less spin. They got more spin. And less swing. And now they're facing another crushing defeat to Australia on Monday's last day when, set 486 runs to win, they resume at 4-82. \"The wicket is obviously turning,\" England's bowling coach Jon Lewis said after Sunday's play. \"And we felt the ball would move around under the lights a little bit more than it has. \"In hindsight, you might say we should have picked a different side. \"But at the time, we felt like we picked a team that would win the game.\" But at the time, England ignored the warnings of Adelaide Oval's head groundsman Damian Hough. On match eve, Hough was asked if England would make a mistake by not playing a specialist spinner. \"Yeah, I think so. History says that the pitch will spin,\" Hough said. England then named a team without a specialist spinner. Which led to the sight of England paceman Ollie Robinson bowling some off-spin on Sunday. \"It wasn't in the plan,\" Lewis said. \"However he has done it before, he has done it at Sussex.\" In fact, Robinson had bowled 26 overs of off-spin for Sussex in his career. \"It (off-spin) is something he did as a kid,\" Lewis said. \"He started as a batter and an offspinner, so it's not an alien skill to him. \"It's something he can do. It's something he practises not often in the nets but he does practice it. \"It's another string to his bow and I think he actually bowled it okay.\" Lewis likened England's bowlers to a racehorse returning from a spell. \"The guys are, I would say, short of a gallop in terms of we didn't get any middle time in the warm-up games,\" he said of a preparation ruined by Queensland rain. \"(But) the guys should be getting better by now.\" Yet the remain upbeat, relatively speaking, despite the prospect of going two-nil down in the five-Test series. \"At the moment I would say the guys are in pretty good spirits in the context of what has been happening,\" he said.","image_url":"https://images.thewest.com.au/publication/C-5014343/8c8fc09dfcbad41baa0a13aa23f5ce1e5d8f9f16-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Joe Root's prove the toughest nuts to crack as Australia close in - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXNoZXMtMjAyMS0yMi1qb2Utcm9vdC1wcm92ZS10aGUtdG91Z2hlc3QtbnV0cy10by1jcmFjay1hcy1hdXN0cmFsaWEtY2xvc2UtaW4tMTI5MzgwN9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Joe Root's prove the toughest nuts to crack as Australia close in  ESPNcricinfoWatch: Twitter Left Bewildered As England Pacer Bowls Off-Spin On Day 4 Of 2nd Ashes Test  NDTV SportsLive Cricket Score - The Ashes, 2021-22, 2nd Test, Day 4, Adelaide | Cricbuzz.com - Cricbuzz  CricbuzzTubby's Boring Story Gets Ruined By Joe Root's Wicket | Triple M Cricket  Triple M2nd Ashes Test: Australia snare Joe Root to close in on victory  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-19 16:09:00","image_url":null,"source_id":"google"},{"title":"Joe Root's prove the toughest nuts to crack as Australia close in - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXNoZXMtMjAyMS0yMi1qb2Utcm9vdC1wcm92ZS10aGUtdG91Z2hlc3QtbnV0cy10by1jcmFjay1hcy1hdXN0cmFsaWEtY2xvc2UtaW4tMTI5MzgwN9IBhQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2FzaGVzLTIwMjEtMjItam9lLXJvb3QtcHJvdmUtdGhlLXRvdWdoZXN0LW51dHMtdG8tY3JhY2stYXMtYXVzdHJhbGlhLWNsb3NlLWluLTEyOTM4MDc_cGxhdGZvcm09YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Joe Root's prove the toughest nuts to crack as Australia close in  ESPNcricinfoWatch: Twitter Left Bewildered As England Pacer Bowls Off-Spin On Day 4 Of 2nd Ashes Test  NDTV SportsLive Cricket Score - The Ashes, 2021-22, 2nd Test, Day 4, Adelaide | Cricbuzz.com - Cricbuzz  CricbuzzTubby's Boring Story Gets Ruined By Joe Root's Wicket | Triple M Cricket  Triple MAshes 2021-22: Birthday Boy Usman Khawaja Breaks Into 'Moon Walk' With Barmy Army | WATCH VIDEO  News18","content":null,"pubDate":"2021-12-19 16:09:00","image_url":null,"source_id":"google"},{"title":"Yash Dhull cricketer: Team India U19 captain Yash Dhull stats and records","link":"https://thesportsrush.com/yash-dhull-cricketer-team-india-u19-captain-yash-dhull-stats-and-records/","keywords":["Cricket","BCCI","ICC U-19 Cricket World Cup","Yash Dhull"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Yash Dhull cricketer: Delhi’s Yash Dhull named as Team India captain for upcoming ICC Under 19 men’s World Cup next month in West Indies. The BCCI’s all-India Junior Selection Committee has named Delhi’s young batting sensation Yash Dhull as Team India captain for the ICC Under-19 men’s World Cup set to commence from January 14… The post Yash Dhull cricketer: Team India U19 captain Yash Dhull stats and records appeared first on The SportsRush.","content":"Yash Dhull cricketer: Delhi’s Yash Dhull named as Team India captain for upcoming ICC Under 19 men’s World Cup next month in West Indies. The BCCI’s all-India Junior Selection Committee has named Delhi’s young batting sensation Yash Dhull as Team India captain for the ICC Under-19 men’s World Cup set to commence from January 14 in West Indies. Dhull will lead the 17-member Indian team squad who would begin with their quest for bagging a record 5th Under-19 World Cup title against South Africa on January 15. Team India has been placed alongside South Africa, Uganda, and Ireland in Group B. It is worth noting that the 19-year-old was also named as the team’s skipper last week for the upcoming Under-19 Asia Cup, to be held in UAE from December 23. Thus, his appointment as side’s captain for the imminent World Cup doesn’t come as a surprise. With great honour, we announce that Yash Dhull from the DC Bal Bhavan Academy will lead the India U-19 squad at the Asia Cup Congratulations Yash, you’ve made all of us proud #YehHaiNayiDilli #DCCricketAcademy pic.twitter.com/mHI1HYMbgS — Delhi Capitals (@DelhiCapitals) December 10, 2021 He will be assisted by Andhra Pradesh’s SK Rasheed as the vice-captain of the side. Yash Dhull cricketer: Dhull has led Delhi U-16, U-19 and India ‘A’ U-19 sides as well Yash Dhull, a right-handed middle order batter from Delhi was one of the leading run getters in the Vinoo Mankad Trophy earlier this year. He had amassed a total of 302 runs in 5 matches at an average of 75.50 for the Delhi Districts and Cricket Association (DDCA) in the renowned tournament. Yash, 19, who has also led the Delhi Under-16, Under-19, and the India ‘A’ Under- 19 side previously as well, rose to prominence just a few hours after being named captain of the India Under-19 squad for the Asia Cup on December 10. His promotion as Delhi’s young age group skipper took place after he garnered plentiful eyeballs post an unbeaten 186 against Punjab in the Under-16 Vijay Merchant Trophy. Under his captaincy, Delhi reached the knockouts after as many as eight years. The trip to the United Arab Emirates for the Under-19 Asia Cup will be Dhull’s first foreign tour in India colours.           The post Yash Dhull cricketer: Team India U19 captain Yash Dhull stats and records appeared first on The SportsRush.","pubDate":"2021-12-19 16:01:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"India Under 19 team 2022 players list: BCCI announce team India under 19 team 2021 squad for ICC U-19 World Cup in West Indies","link":"https://thesportsrush.com/cricket-news-india-under-19-team-2022-players-list-bcci-announce-team-india-under-19-team-2021-squad-for-icc-u-19-world-cup-in-west-indies/","keywords":["Cricket","BCCI","ICC U-19 Cricket World Cup","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India Under 19 team 2022 players list: BCCI announce Team India squad for upcoming ICC U-19 Cricket World Cup in West Indies. BCCI’s all-India Junior Selection Committee announced Team India’s squad on Sunday for the imminent ICC Under-19 Men’s Cricket World Cup to take place in West Indies. The 14th edition of the tournament will… The post India Under 19 team 2022 players list: BCCI announce team India under 19 team 2021 squad for ICC U-19 World Cup in West Indies appeared first on The SportsRush.","content":"India Under 19 team 2022 players list: BCCI announce Team India squad for upcoming ICC U-19 Cricket World Cup in West Indies. BCCI’s all-India Junior Selection Committee announced Team India’s squad on Sunday for the imminent ICC Under-19 Men’s Cricket World Cup to take place in West Indies. The 14th edition of the tournament will take place from January 14 to February 5, 2022 across four host countries in the Caribbean island, which will see 16 teams competing for the trophy in 48 matches. “The All-India Junior Selection Committee has picked India’s squad for the upcoming ICC Under 19 Men’s Cricket World Cup to be played in the West Indies from 14th January to 5th February 2022 across four host countries,” the BCCI said in a press release. India is the most successful team in the tournament’s history having lifted the coveted silverware four times in 2000, 2008, 2012 and 2018. They also finished as runner-ups in 2016 and 2020 edition of the tournament. India lost to Bangladesh in the final of the last World Cup in 2020 against Bangladesh in New Zealand. India Under 19 team 2022 players list: Yash Dhull named captain, SK Rasheed named his deputy Delhi’s young sensation Yash Dhull has been named as the captain of the 17-member Indian Team squad, while Andhra Pradesh’s SK Rasheed named as the vice-captain. India have been placed alongside South Africa, Uganda, and Ireland in Group B. They will begin their campaign against South Africa at the Providence Stadium in Guyana on January 15, 2022. The Yash Dhull-led side will then lock horns against Ireland and Uganda on January 19 and 22 respectively. The format will see the top two teams from each of the four groups advance to the Super League while the remaining teams feature in the Plate across 23 days of competition. India squad: Yash Dhull (c), Harnoor Singh, Angkrish Raghuvanshi, SK Rasheed (vice-captain), Nishant Sindhu, Siddarth Yadav, Dinesh Bana (wk), Aaradhya Yadav (wk), Raj Angad Bawa, Manav Parakh, Kaushal Tambe, RS Hangargekar, Vasu Vats, Vicky Ostwal, Ravikumar, Garv Sangwan. Standby players: Rishit Reddy, Uday Saharan, Ansh Gosai, Amit Raj Upadhyay, PM Singh Rathore. Here’s India’s squad for ICC U19 Cricket World Cup 2022 squad #BoysInBlue Go well, boys! pic.twitter.com/im3UYBLPXr — BCCI (@BCCI) December 19, 2021 For more Cricket related news, click here.         The post India Under 19 team 2022 players list: BCCI announce team India under 19 team 2021 squad for ICC U-19 World Cup in West Indies appeared first on The SportsRush.","pubDate":"2021-12-19 14:48:33","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Tubby pinpoints cause of England 'paralysis'","link":"https://wwos.nine.com.au/cricket/the-ashes-2021-england-australia-joe-root-james-anderson-stuart-broad-mark-taylor-exclusive/1eaec836-7fad-4fdf-afa0-b11aa46ef5eb","keywords":null,"creator":["wwos"],"video_url":null,"description":"Mark Taylor has given a scathing assessment of England as they limp toward the final day of the Adelaide Test.","content":"Extreme analysis has led to paralysis as England limp toward the final day of the second Ashes Test, according to former Australia captain Mark Taylor.The tourists are in need of conjuring a sporting miracle if they are to chase the remaining 386 runs to win the Adelaide Test, while even salvaging a draw is highly unlikely.Australia dealt England a monumental task when fill-in captain Steve Smith declared his side's second innings closed at 9-230 just before tea on day four, setting the visitors a record fourth-innings chase of 468 to win.LIVE BLOG: Lethal Aussies zeroing in on huge Adelaide winEngland's chase then began in disastrous fashion as Australia's bowlers thrived with the pink ball under lights, leaving the visitors reeling at 4-82 at stumps and staring down a two-nil series deficit.Taylor was scathing in his assessment of England's mindset.\"The problem that England have got is their thinking is way too conservative and too analytical. They've almost suffered paralysis from too much analysis,\" Taylor told Wide World of Sports.\"They've obviously looked at their bowlers, looked at who's going to play when and then got it all wrong. I don't know exactly how fit all their bowlers were before the first Test, but to pick the side they did, without (pacemen) Stuart Broad and James Anderson ...\"And now that they've got to (Adelaide) they've bowled conservatively ... They bowled so much better on day four in that first session, where they picked up 3-14 in the first hour of play. They bowled a good metre, almost a metre-and-a-half fuller than they've bowled all series – and all of a sudden Australia looked in a little bit of trouble. And when you're doing this much analysing before a Test ... why does it take them that long to work out where to bowl?\"READ MORE: Root groin blow adds to England woesNeither Broad nor Anderson played the first Test and, although they have tremendous Test records, they failed to do serious damage in both innings with the ball in Adelaide.Broad took 1-73 and 1-27, while Anderson finished with figures of 2-58 and 1-8.\"(England have) spent so much time on bowling rotations and asking, 'Who's going to play?', 'What sort of pitches are we going to play on?', 'Are we going to play the day-night Test?',\" Taylor said.\"I think they've spent way too much time analysing all of the things they can't control.\"Just pick your best team and play good cricket and play with energy – that's what they need to do and they haven't done that.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-19 14:23:30","full_description":"Extreme analysis has led to paralysis as England limp toward the final day of the second Ashes Test , according to former Australia captain Mark Taylor . The tourists are in need of conjuring a sporting miracle if they are to chase the remaining 386 runs to win the Adelaide Test, while even salvaging a draw is highly unlikely. Australia dealt England a monumental task when fill-in captain Steve Smith declared his side's second innings closed at 9-230 just before tea on day four, setting the visitors a record fourth-innings chase of 468 to win. LIVE BLOG: Lethal Aussies zeroing in on huge Adelaide win England's chase then began in disastrous fashion as Australia's bowlers thrived with the pink ball under lights, leaving the visitors reeling at 4-82 at stumps and staring down a two-nil series deficit. Taylor was scathing in his assessment of England's mindset. \"The problem that England have got is their thinking is way too conservative and too analytical. They've almost suffered paralysis from too much analysis,\" Taylor told Wide World of Sports. \"They've obviously looked at their bowlers, looked at who's going to play when and then got it all wrong. I don't know exactly how fit all their bowlers were before the first Test, but to pick the side they did, without (pacemen) Stuart Broad and James Anderson ... \"And now that they've got to (Adelaide) they've bowled conservatively ... They bowled so much better on day four in that first session, where they picked up 3-14 in the first hour of play. They bowled a good metre, almost a metre-and-a-half fuller than they've bowled all series – and all of a sudden Australia looked in a little bit of trouble. And when you're doing this much analysing before a Test ... why does it take them that long to work out where to bowl?\" READ MORE: Root groin blow adds to England woes Neither Broad nor Anderson played the first Test and, although they have tremendous Test records, they failed to do serious damage in both innings with the ball in Adelaide. Broad took 1-73 and 1-27, while Anderson finished with figures of 2-58 and 1-8. \"(England have) spent so much time on bowling rotations and asking, 'Who's going to play?', 'What sort of pitches are we going to play on?', 'Are we going to play the day-night Test?',\" Taylor said. \"I think they've spent way too much time analysing all of the things they can't control. \"Just pick your best team and play good cricket and play with energy – that's what they need to do and they haven't done that.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/399853/pickerimage.jpg","source_id":"nine"},{"title":"Ahead of India series, CSA postpones domestic matches over COVID fears","link":"https://www.indiatvnews.com/sports/cricket/ahead-of-india-series-csa-postpones-domestic-matches-over-covid-fears-750298","keywords":null,"creator":null,"video_url":null,"description":"South Africa's four-day franchise series has been postponed as a precautionary measure over COVID-19 fears, confirmed Cricket South Africa on Sunday. The announcement came just a week before the three-match Test series between India and South Africa gets underway in Centurion. The country has seen a spike in the number of COVID-19 cases in the past few weeks.","content":null,"pubDate":"2021-12-19 14:17:36","full_description":"South Africa's four-day franchise series has been postponed as a precautionary measure over COVID-19 fears, confirmed Cricket South Africa on Sunday. The announcement came just a week before the three-match Test series between India and South Africa gets underway in Centurion. The country has seen a spike in the number of COVID-19 cases in the past few weeks. \"The decision to defer the fifth round of matches, which were scheduled to take place between December 16-19 (Division Two) and December 19-22 (Division One), was taken as a safeguarding measure in light of the competition being held outside of a bio-secure environment and amid the latest wave of the COVID-19 pandemic,\" CSA said in a statement. The postponed matches, including round four, will be rescheduled for the new year. South Africa is currently enduring their fourth wave of the coronavirus pandemic, which followed the discovery of the Omicron variant last month.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket - England need another Stokes special to save Adelaide test","link":"https://www.channelnewsasia.com/sport/cricket-england-need-another-stokes-special-save-adelaide-test-2390076","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-19 14:04:21","full_description":"ADELAIDE : England's hopes of saving the second Ashes test against Australia are in tatters following Joe Root's late dismissal on Sunday but the touring side still hope Ben Stokes might be their saviour again. Set an improbable victory target of 468, England finished day four on a precarious 82-4. The toughest blow was Root's dismissal to the day's final delivery when Mitchell Starc had the England captain caught behind for 24. Stokes was unbeaten on three and the touring side need a repeat of his batting heroics which secured England's highest successful Ashes run chase at Leeds two years ago. \"Anytime one if your best players (Root) gets out, it’s a knock,\" fast bowling coach Jon Lewis told reporters. \"Ben (Stokes) has done it before, he has done special things in an England shirt.\" As for inspiration, Stokes need not look beyond his captain, who batted through pain to help his team. After having a hospital scan in the morning for an abdomen injury sustained in the nets, Root was floored by an express delivery from Starc shortly before the close of play. The England skipper grimaced and rolled in pain before receiving medical attention. Although he bravely soldiered on, Root ran gingerly between the wickets in obvious discomfort. \"Joe showed a hell of a lot of character to go out,\" Lewis said. \"There was no doubt in Joe’s mind he was going out to bat and it shows what a great player and brilliant leader he is. \"He wants to show his team how hard he wants to try for the team.\" England will hope their lower order batters show similar gumption when they embark on the huge task of surviving three sessions with six wickets in hand to save the match. (Editing by Amlan Chakraborty and Ed Osmond)","image_url":null,"source_id":"channelnewsasia"},{"title":"Ahead Of India Series, CSA Postpones Domestic Matches Over COVID Fears","link":"https://sports.ndtv.com/cricket/ahead-of-india-series-cricket-south-africa-postpones-domestic-matches-over-covid-fears-2659876","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa on Sunday announced that the remaining round of CSA four-day franchise series, the country's premier domestic competition, has been postponed as a precautionary measure over...","content":null,"pubDate":"2021-12-19 13:55:47","full_description":"Cricket South Africa on Sunday announced that the remaining round of CSA four-day franchise series, the country's premier domestic competition, has been postponed as a precautionary measure over COVID-19 fears. The announcement came just a week before the three-match Test series between India and South Africa gets underway in Centurion. The country has seen a spike in the number of COVID-19 cases in the past few weeks. \"The decision to defer the fifth round of matches, which were scheduled to take place between December 16-19 (Division Two) and December 19-22 (Division One), was taken as a safeguarding measure in light of the competition being held outside of a bio-secure environment and amid the latest wave of the COVID-19 pandemic,\" CSA said in a statement. The postponed matches, including round four, will be rescheduled for the new year. South Africa is currently enduring their fourth wave of the coronavirus pandemic, which followed the discovery of the Omicron variant last month.","image_url":"https://c.ndtvimg.com/2021-11/p0m0bcqg_cricket-generic_625x300_08_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Yash Dhull To Captain India In ICC U-19 Cricket World Cup","link":"https://sports.ndtv.com/cricket/yash-dhull-to-captain-india-in-icc-u-19-cricket-world-cup-2659866","keywords":null,"creator":null,"video_url":null,"description":"India is the most successful team in the ICC U-19 Cricket World Cup, having won four titles.","content":null,"pubDate":"2021-12-19 13:34:56","full_description":"The All-India Junior Selection Committee on Sunday picked the squad for the upcoming ICC Under-19 Men's Cricket World Cup to be played in the West Indies from January 14 to February 5, 2022, across four host countries. The 14th edition of the tournament will see 16 teams competing for the trophy in 48 matches. India is the most successful team having won four titles in 2000, 2008, 2012, and 2018. India have also been runner-up in 2016 and in the previous edition of the tournament held in 2020 in New Zealand. The format will see the top two teams from each of the four groups advance to the Super League while the remaining teams feature in the Plate across 23 days of competition. India U-19 are placed in Group B. India will square off against South Africa on January 15 and then the side will lock horns against Ireland and Uganda on January 19 and 22. Promoted India squad: Yash Dhull (c), Harnoor Singh, Angkrish Raghuvanshi, SK Rasheed (vice-captain), Nishant Sindhu, Siddarth Yadav, Dinesh Bana (wk), Aaradhya Yadav (wk), Raj Angad Bawa, Manav Parakh, Kaushal Tambe, RS Hangargekar, Vasu Vats, Vicky Ostwal, Ravikumar, Garv Sangwan. Standby players: Rishit Reddy, Uday Saharan, Ansh Gosai, Amit Raj Upadhyay, PM Singh Rathore.","image_url":"https://c.ndtvimg.com/2021-12/6mu4osko_india-u19-instagram_120x90_19_December_21.jpg","source_id":"ndtv"},{"title":"ICC U19 Cricket World Cup 2022: BCCI announces India's squad","link":"https://www.indiatvnews.com/sports/cricket/icc-u19-cricket-world-cup-2022-bcci-announces-india-s-squad-750291","keywords":null,"creator":null,"video_url":null,"description":"BCCI's All-India Junior Selection Committee has picked India’s squad for the upcoming ICC Under 19 Men’s Cricket World Cup to be played in the West Indies from 14th January to 5th February 2022 across four host countries. The 14th edition of the tournament will see 16 teams competing for the trophy in 48 matches.","content":null,"pubDate":"2021-12-19 13:24:51","full_description":"BCCI has announced India's squad for the Under-19 World Cup, slated to take place in West Indies from January 14 to February 5. Delhi batsman Yash Dhull will be leading India in the marquee event. Four-time winners India are clubbed with South Africa, Ireland and Uganda in Group B. Dhull's appointment was on expected lines as he was also named captain for the upcoming Asia Cup, to be held in the UAE from December 23. Dhull will have Andhra's SK Rasheed as his deputy for the premier tournament in the Caribbean. \"The All-India Junior Selection Committee has picked India's squad for the upcoming ICC Under 19 Men's Cricket World Cup to be played in the West Indies from 14th January to 5th February 2022 across four host countries,\" the BCCI said in a press release. The 14th edition of the tournament will see 16 teams competing for the trophy across 48 matches. India are the most successful team having won the title four times -- 2000, 2008, 2012 and 2018. India have also been runners-up in 2016 and in the previous edition of the tournament held in 2020 in New Zealand. Dhull, a right-handed middle-order batter, was a leading run-getter in the Vinoo Mankad Trophy earlier this year. He averaged 75. 50 for his 302 runs for the Delhi Districts & Cricket Association (DDCA) in the five matches that the team played during the tournament. Delhi player Dhull thus joins the great in captaining the junior side in the marquee tournament. He has previously led the Delhi U-16, U-19 and India 'A' U-19 sides. Rasheed was also impressive in the Vinoo Mankad Trophy, including scoring a match-winning century. The format will see the top two teams from each of the four groups advance to the Super League while the remaining teams feature in the Plate across 23 days of competition. India will begin their campaign against South Africa at the Providence Stadium in Guyana on January 15. They will play their remaining group matches against Ireland and Uganda on January 19 and 22 respectively. The four host countries have been confirmed as Antigua and Barbuda, Guyana, St Kitts and Nevis and Trinidad and Tobago with 10 venues hosting matches. The 48-match schedule will begin with hosts West Indies taking on Australia, with Sri Lanka facing Scotland in Guyana on January 14. The group stage will take place across Guyana, St Kitts and Nevis and Trinidad and Tobago between January 14 and 22. Trinidad and Tobago will host the Plate competition between January 25 and 31, with the Super League taking place in Antigua and Barbuda from January 26. The semi-finals will be played on February 1 and 2 across two venues: the Sir Vivian Richards Cricket Ground and Coolidge Cricket Ground. The final will also be held at the Sir Vivian Richards Cricket Ground.","image_url":null,"source_id":"indiatvnews"},{"title":"India announces ICC U-19 Cricket World Cup 2022 squad","link":"https://sportstar.thehindu.com/cricket/india-squad-team-icc-u19-cricket-world-cup-2022-west-indies-yash-dhull-captain-sk-rasheed/article37990953.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"The 14th edition of the tournament will see 16 teams competing for the trophy in 48 matches.","content":null,"pubDate":"2021-12-19 13:14:23","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"How many overs left in AUS vs ENG Day 5 Ashes: How many overs remaining today in Australia vs England Adelaide Test?","link":"https://thesportsrush.com/cricket-news-how-many-overs-left-in-aus-vs-eng-day-5-ashes-how-many-overs-remaining-today-in-australia-vs-england-adelaide-test/","keywords":["Cricket","Ashes 2021-22","Australia","England"],"creator":["Dixit Bhargav"],"video_url":null,"description":"How many overs left on Day 5 Australia vs England: A riveting day of Test cricket awaits us at the Adelaide Oval tomorrow. As has been the story for a large part of this series till now, the fourth day of the ongoing second Ashes 2021-22 Test match between Australia and England in Adelaide witnessed… The post How many overs left in AUS vs ENG Day 5 Ashes: How many overs remaining today in Australia vs England Adelaide Test? appeared first on The SportsRush.","content":"How many overs left on Day 5 Australia vs England: A riveting day of Test cricket awaits us at the Adelaide Oval tomorrow. As has been the story for a large part of this series till now, the fourth day of the ongoing second Ashes 2021-22 Test match between Australia and England in Adelaide witnessed the hosts calling the shots yet again. Despite losing early wickets, Australia somehow managed to score 230/9 dec. in 61 overs to set England a gargantuan 468-run target. In what will be the highest run-chase in Test cricket if England performs the unthinkable, it wouldn’t be possible without an other-wordly batting effort by their middle-order. Usman Khawaja pulling out the shuffle for the Barmy Army! #Ashes pic.twitter.com/RD9b4Ws4ce — cricket.com.au (@cricketcomau) December 19, 2021 How many overs left in AUS vs ENG Day 5? England, who ended Day 4 on 82/4 in 43.2 overs, had only lost their top-order until the last ball of the day which saw captain Joe Root (24) edging a Mitchell Starc delivery to Alex Carey. Joe Root’s gone right at the end of the day! After he’d been hit badly and was tough enough to continue – and face Starcy again, who took his wicket. Respect. #Ashes — Chloe-Amanda Bailey (@ChloeAmandaB) December 19, 2021 England, who need 386 more runs to win with just six wickets in hand, will unequivocally be eyeing a draw for all their remaining batters haven’t been in the best of forms lately. As far as the overs remaining on Day 5 are concerned, England are effectively left with 90.4 overs to survive at the Adelaide Oval on Monday. Readers must note that England had to chase a 468-run target in a minimum of 134 overs and that they have already played 43.2 overs. As far as the highest-ever fourth innings score at the Adelaide Oval is concerned, India hold that record for scoring 445/10 in a 493-run chase in 1978. The highest-ever successful run-chase at this venue was registered by Australia themselves when they had sealed a 315-run target against England in 1902. The post How many overs left in AUS vs ENG Day 5 Ashes: How many overs remaining today in Australia vs England Adelaide Test? appeared first on The SportsRush.","pubDate":"2021-12-19 12:56:40","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"English quick makes massive Ashes statement with record-breaking BBL debut - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMi1wFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvZG9tZXN0aWMtY3JpY2tldC9iaWctYmFzaC9iYmwtMjAyMS1iYmwtMTEtYnJpc2JhbmUtaGVhdC12cy1zeWRuZXktdGh1bmRlci1uZXdzLXNjb3Jlcy1saXZlLXN0cmVhbS1ob3ctdG8td2F0Y2gtYXVzdHJhbGlhLXRlYW1zLXVwZGF0ZXMvbmV3cy1zdG9yeS80MWViYWFiZDhmMThmMGEzMTAwOThiNGQ0NDM5MGQzONIB1wFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvZG9tZXN0aWMtY3JpY2tldC9iaWctYmFzaC9iYmwtMjAyMS1iYmwtMTEtYnJpc2JhbmUtaGVhdC12cy1zeWRuZXktdGh1bmRlci1uZXdzLXNjb3Jlcy1saXZlLXN0cmVhbS1ob3ctdG8td2F0Y2gtYXVzdHJhbGlhLXRlYW1zLXVwZGF0ZXMvbmV3cy1zdG9yeS80MWViYWFiZDhmMThmMGEzMTAwOThiNGQ0NDM5MGQzOA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"English quick makes massive Ashes statement with record-breaking BBL debut  Fox SportsThunder's English imports storm past Heat | BBL|11  cricket.com.auBBL star’s record feat exposes England’s Ashes woes  NEWS.com.au‘Something special’: BBL keeper takes freakish ‘blinder’ following two amazing crowd grabs  Fox SportsHeat blitzed by Mahmood's stunning Thunder debut | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-19 12:18:00","image_url":null,"source_id":"google"},{"title":"Mahmood with 5 total wickets!","link":"https://www.cairnspost.com.au/sport/cricket/mahmood-with-5-total-wickets/video/6b9cb38805388e1101b8c1e74c2bbe60","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Saqib Mahmood claimed four wickets plus a run out to help the Sydney Thunder dismantle the Brisbane Heat","content":null,"pubDate":"2021-12-19 12:16:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Mahmood with 5 total wickets!","link":"https://www.news.com.au/sport/cricket/mahmood-with-5-total-wickets/video/6b9cb38805388e1101b8c1e74c2bbe60","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Saqib Mahmood claimed four wickets plus a run out to help the Sydney Thunder dismantle the Brisbane Heat","content":null,"pubDate":"2021-12-19 12:16:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"Stumps: Aussies dominate day 4","link":"https://www.news.com.au/sport/cricket/stumps-aussies-dominate-day-4/video/ee93b9ccbf6f6cf6345b4fe73ef3eb7b","keywords":null,"creator":null,"video_url":null,"description":"Ashes: Re-live the best action from the fourth day of the Adelaide Test as Australia dominated once more, with FOX Cricket's Shane Warne, Mark Waugh and Mark Howard..","content":null,"pubDate":"2021-12-19 12:16:05","full_description":null,"image_url":null,"source_id":"news"},{"title":"Stumps: Aussies dominate day 4","link":"https://www.cairnspost.com.au/sport/cricket/stumps-aussies-dominate-day-4/video/ee93b9ccbf6f6cf6345b4fe73ef3eb7b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Ashes: Re-live the best action from the fourth day of the Adelaide Test as Australia dominated once more, with FOX Cricket's Shane Warne, Mark Waugh and Mark Howard..","content":null,"pubDate":"2021-12-19 12:16:05","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ashes Stats: Root passes Cook; Ponting's happy birthdays","link":"https://www.skysports.com/cricket/news/12040/12499793/ashes-stats-joe-root-takes-run-record-for-england-captains-and-ricky-pontings-happy-birthdays","keywords":null,"creator":null,"video_url":null,"description":"Australia are closing in on victory in the second Ashes Test and Sky Cricket statistician Benedict Bermange has all the key stats about a few English landmarks - not all of them positive - reached during day four in Adelaide...","content":null,"pubDate":"2021-12-19 12:15:00","full_description":"Cricket Statistician Last Updated: 19/12/21 12:29pm Australia are closing in on victory in the second Ashes Test and Sky Cricket statistician Benedict Bermange has all the key stats about a few English landmarks - not all of them positive - reached during day four in Adelaide... Ricky Ponting celebrated his 47th birthday today. Perhaps fittingly, he is the only player to celebrate winning a Test on his birthday as many as three times. Australia clearly had no faith in Nathan Lyon's batting in this Test, twice declaring nine wickets down without letting him come to the crease. The only other No 11 to suffer the same indignity without being injured was New Zealand's Chris Martin against Australia at Perth in 2001. Seven different England bowlers took wickets in this Test, the most for them in a single Test since the Cape Town Test of January 1965. On that occasion, eight different England bowlers took at least one wicket, equalling the overall Test record they set against New Zealand at Christchurch in March 1951. England's target of 468 would be the highest-ever successful run chase in Test history. There have only been four successful fourth-innings run chases of at least 400 in Test history: England's openers have now been dismissed for 13 ducks in 2021, by far the most suffered by any team in a calendar year: Jhye Richardson became the first player to ever have a strike rate of at least 200.00 in both innings of the same Test. When he reached 10 in his second innings, Joe Root overtook Alastair Cook's England record of 4,844 runs when captaining the side:","image_url":"https://e1.365dm.com/21/12/1920x1080/skysports-joe-root-england_5620008.jpg?20211219103507","source_id":"skysports"},{"title":"2nd Ashes Test: Australia snare Joe Root to close in on victory - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9uZXdzLzJuZC1hc2hlcy10ZXN0LWF1c3RyYWxpYS1zbmFyZS1qb2Utcm9vdC10by1jbG9zZS1pbi1vbi12aWN0b3J5L2FydGljbGVzaG93Lzg4MzczODM4LmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"2nd Ashes Test: Australia snare Joe Root to close in on victory  Times of IndiaWatch: Twitter Left Bewildered As England Pacer Bowls Off-Spin On Day 4 Of 2nd Ashes Test  NDTV SportsLive Cricket Score - The Ashes, 2021-22, 2nd Test, Day 4, Adelaide | Cricbuzz.com - Cricbuzz  CricbuzzAshes live scores 2021-22 Australia v England: Start time, stats, stream  The AdvertiserTubby's Boring Story Gets Ruined By Joe Root's Wicket | Triple M Cricket  Triple MView Full coverage on Google News","content":null,"pubDate":"2021-12-19 12:11:00","image_url":null,"source_id":"google"},{"title":"Joe Root hit: Joe Root suffers severe agony after getting hit in the groin for the second time in a day at the Adelaide Oval","link":"https://thesportsrush.com/cricket-news-joe-root-hit-joe-root-suffers-severe-agony-after-getting-hit-in-the-groin-for-the-second-time-in-a-day-at-the-adelaide-oval/","keywords":["Cricket","Videos","Ashes 2021","Australia","England","Joe Root","Mitchell Starc"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Joe Root hit: The English captain was in serious pain after getting hit in the unmentionables for the second time in a day. The fourth day of the ongoing second Ashes 2021-22 Test between Australia and England in Adelaide was a rough day for England captain Joe Root not just because of his team’s shambolic… The post Joe Root hit: Joe Root suffers severe agony after getting hit in the groin for the second time in a day at the Adelaide Oval appeared first on The SportsRush.","content":"Joe Root hit: The English captain was in serious pain after getting hit in the unmentionables for the second time in a day. The fourth day of the ongoing second Ashes 2021-22 Test between Australia and England in Adelaide was a rough day for England captain Joe Root not just because of his team’s shambolic performance but also because of physical pain which he suffered twice around the same body part. Root, who hadn’t taken the field in the afternoon after getting hit in the abdomen whilst receiving throwdowns in the nets before the start of play, ended the day on a similar painful note. It all had happened on the first delivery of the 42nd over when Root got hit in the groin region after failing to defend a Mitchell Starc delivery. With Starc bowling from round the wicket, the angle of the left-arm further brought the into the right-handed batter. Root, who had underwent scans at the same body part in the morning, suffered severe agony after copping a nasty blow in the night session. It was only after receiving an enhanced medical attention that Root was ready to face again. Having done all the hard work, Root failed to end the day unbeaten as he edged a Starc delivery to Australia wicket-keeper Alex Carey in the following over. In what turned out to be the last delivery of the day, a dejected Root walked back to the pavilion after scoring 24 (67) as England have been reduced to 82/4 in a 468-run chase. Joe Root hit in the groin in Adelaide Test That has floored Root. Ouch. #Ashes pic.twitter.com/JSbsdr9Z76 — cricket.com.au (@cricketcomau) December 19, 2021 Twitter reactions on Joe Root: Talk about a perfectly timed photo Daniel Kalisz #Ashes pic.twitter.com/nar3hgLuBt — 7Cricket (@7Cricket) December 19, 2021 Oh jeez… Root’s jatz crackers have taken a pounding today. What are the chances? #Ashes — Melinda Farrell (@melindafarrell) December 19, 2021 Right in the spuds. Again! #Ashes — Andrew Miller (@miller_cricket) December 19, 2021 The presence of mind to shoo away the spider-cam > Joe Root is always switched on #Ashes pic.twitter.com/DbRd6lmj5G — Cricket on BT Sport (@btsportcricket) December 19, 2021 Absolute scenes in the commentary box, completely losing it watching Joe Root run #Ashes pic.twitter.com/0CoJCSPTKD — 7Cricket (@7Cricket) December 19, 2021 “I was okay, I’ve had two children since…” Sir Alastair Cook gives his immediate reaction to that Joe Root incident #Ashes pic.twitter.com/li79f9RgYh — Cricket on BT Sport (@btsportcricket) December 19, 2021 For more cricket-related news, click here. The post Joe Root hit: Joe Root suffers severe agony after getting hit in the groin for the second time in a day at the Adelaide Oval appeared first on The SportsRush.","pubDate":"2021-12-19 12:08:20","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"STUMPS: Root groin blow adds to England woes","link":"https://wwos.nine.com.au/cricket/the-ashes-2021-england-australia-scores-joe-root-testicles-injury-video-highlights/08b85c71-3427-46e1-b5ee-03d30f138893","keywords":null,"creator":["wwos"],"video_url":null,"description":"Australia are in a greatly dominant position at stumps on the fourth day in Adelaide, as they push for a two-nil series lead.","content":"England face the near-impossible task of scoring another 386 runs on the final day of the second Ashes Test to win the game.What's more possible but also extremely unlikely is England surviving another three sessions to salvage a draw in Adelaide, after limping to stumps on the fourth day at 4-82.Australia's stand-in captain, Steve Smith, declared at 9-230 just before tea, setting England a record fourth-innings chase of 468 to win.LIVE BLOG: Lethal Aussies zeroing in on huge Adelaide winThe mammoth pursuit began in disastrous fashion, with Haseeb Hameed making a six-ball duck, Rory Burns managing only 34, Dawid Malan being removed for 20 and Joe Root mustering just 24.Root lost his wicket on the final ball of the day, edging a Mitchell Starc delivery through to wicketkeeper Alex Carey.All-rounder Ben Stokes (three) and No.6 Ollie Pope (zero) will be in the middle for the beginning of the final day.READ MORE: England keeper's 'oddest' Ashes Test continuesRoot was dealt not one but two doses of horrible misfortune on the fourth day, copping a cricket ball to the abdomen before the start of play and being hit in the testicles late in the final session.MORE TO COME.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-19 11:55:00","full_description":"England face the near-impossible task of scoring another 386 runs on the final day of the second Ashes Test to win the game. What's more possible but also extremely unlikely is England surviving another three sessions to salvage a draw in Adelaide, after limping to stumps on the fourth day at 4-82. Australia added to the tourists' pain when left-arm quick Mitchell Starc removed Joe Root on the final ball of the day, which followed an excruciating blow to the captain's testicles. LIVE BLOG: Lethal Aussies zeroing in on huge Adelaide win Australia's stand-in captain, Steve Smith , had declared at 9-230 just before tea, setting England a record fourth-innings chase of 468 to win. The mammoth pursuit began in disastrous fashion when Haseeb Hameed was dismissed for a six-ball duck, before Rory Burns mustered only 34, Dawid Malan 20 and Root 24. Root lost his wicket when he edged a Starc delivery through to wicketkeeper Alex Carey. The world's No.1-ranked men's Test batter was dealt not one but two doses of horrible misfortune on the fourth day. READ MORE: England keeper's 'oddest' Ashes Test continues His blow to the testicles late in the final session, caused by a rapid Starc delivery, followed a hit to the abdomen just before the start of play. He had been struck in the abdomen while receiving throw-downs, before missing the first 80 minutes of play but being cleared of serious damage. \"(We were) set up from (Nathan) Lyon at one end and (it) just allowed Starc to run in and bowl fast,\" said fast bowler Jhye Richardson on the Fox Cricket broadcast. \"Ruffled up Root a little bit, drew the false shot. \"Couldn't be happier.\" All-rounder Ben Stokes (three) and No.6 Ollie Pope (zero) will be in the middle for the beginning of the final day. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/399853/pickerimage.jpg","source_id":"nine"}]}