{"newsArray":[{"title":"VCA Stadium T20 records: Nagpur Stadium T20 records and highest innings total","link":"https://thesportsrush.com/cricket-news-vca-stadium-t20-records-nagpur-stadium-t20-records-and-highest-innings-total/","keywords":["Cricket","Australia","Australia tour of India 2022","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"VCA Stadium T20 records: Vidarbha Cricket Association Stadium will be hosting a T20 after almost three years. Not just international cricket but even T20s will return to the Vidarbha Cricket Association Stadium after almost three years as dedicated fans’ long wait will come to end with the second of the three T20Is to be played… The post VCA Stadium T20 records: Nagpur Stadium T20 records and highest innings total appeared first on The SportsRush.","content":"Not just international cricket but even T20s will return to the Vidarbha Cricket Association Stadium after almost three years as dedicated fans’ long wait will come to end with the second of the three T20Is to be played between India and Australia this week. India, whose death-bowling issues have been brought out in the open this month, need a quick turnaround with respect to their recent form. Having won and lost a couple of T20Is each at this venue, the hosts would be keen to avoid another defeat as it will convert the third T20I in Hyderabad on Sunday into a dead-rubber. Australia, on the other hand, will be playing their first-ever Nagpur T20I on Friday. Been part of six out of the 27 international matches played here over the years, Aussies have an even worse record winning one and losing their remaining five matches albeit in other formats. Highest run-scorers in T20Is played at the VCA Stadium are Mohammad Shahzad (166), KL Rahul (123), Jamie Atkinson (82), Mohammad Naim (81) and Mohammad Nabi (79). While former India captain Virat Kohli has scored 44 runs across two Nagpur T20Is, all captain Rohit Sharma has managed across three innings are 10 runs. Highest wicket-takers in Nagpur T20Is are Mohammad Nabi (8), Rashid Khan (8), , Donald Tiripano (5) and Wellington Masakadza (5). Among bowlers participating in the ongoing series, Jasprit Bumrah has picked a couple of wickets here. On the contrary, Ravichandran Ashwin, Yuzvendra Chahal and Sharma have picked a wicket apiece. Known for its significant boundary size, VCA Stadium has witnessed a lone 200+ total in a total of 24 completed T20I innings. Out of , as many as nine have been won batting first and only three have been won after bowling first. The highest successful T20I run-chase at this venue belongs to South Africa for sealing a 123-run chase against South Africa during a Super 10 match of ICC World Twenty20 2016.","pubDate":"2022-09-22 22:40:37","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ICC chairmanship not in my hands, says Ganguly","link":"https://kashmirreader.com/2022/09/23/icc-chairmanship-not-in-my-hands-says-ganguly/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"KOLKATA: BCCI president Sourav Ganguly on Thursday said the ICC chairmanship is “not in my hands”, playing down strong speculation that the former India captain could head to Dubai. In July, the International Cricket Council (ICC) Board approved the process to elect the next chairman of the world body in November. After the meeting in […]","content":"KOLKATA: BCCI president Sourav Ganguly on Thursday said the ICC chairmanship is “not in my hands”, playing down strong speculation that the former India captain could head to Dubai. In July, the International Cricket Council (ICC) Board approved the process to elect the next chairman of the world body in November. After the meeting in Birmingham, it was decided that with Greg Barclay ending his tenure this year, the election will be decided by a simple majority and the term of the Chair will be for a two-year period between December 1, 2022, to November 30, 2024. Ganguly’s name has been doing the rounds since then. But when asked about it, the elegant batter of yesteryear just had this to say: “ICC chairmanship is not in my hands.” The ICC Board has decided that a two-thirds majority is no longer required to be elected as the chairman. According to the latest recommendations, the contestant bagging 51 per cent votes will be elected as the winner. In a 16-member board, the candidate needs just nine votes from the directors to get elected. The Indian men’s team hasn’t been in the best of form of late, and Ganguly acknowledged that not being able to do well in big tournaments is a matter of concern. “Rohit Sharma has a winning percentage of almost 80. India has lost the last three-four matches but before that… He has led in 35-40 matches and lost just five or six. “I am sure Rohit and Rahul Dravid will be concerned about the team and everything, and they will improve. “I am not worried about one or two losses, but yes, we have not done well in big tournaments. We will talk about that.. “The team will leave (for the T20 World Cup in Australia) two to three weeks, will get time to acclimatise and play practice matches.” Regarding Virat Kohli’s recent century, he said, “It’s very good news that Virat has done well in the Asia Cup, and hopefully, he will continue in that vein.” The seasoned Jhulan Goswami is retiring from international cricket after playing the third and final ODI against England, and Ganguly called the pacer “an absolute legend”. “Jhulan is an absolute legend… Last three as BCCI president, we have maintained very good relations… She had a fantastic career. She is almost 40. “Jhulan will leave a mark in women’s cricket. She is a role model, she should get the highest honour when she finishes at Lord’s. She is an absolute champion.” It’s been a while now, but Ganguly still can’t believe that India lost the Commonwealth Games final in Australia. —PTI   Press Trust of Indiakashmirreader.com","pubDate":"2022-09-22 20:46:36","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"CS throws open LG’s Rolling Trophy Cricket tournament","link":"https://kashmirreader.com/2022/09/23/cs-throws-open-lgs-rolling-trophy-cricket-tournament/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Administers pledge to participants against drug abuse JAMMU: Chief Secretary, Dr Arun Kumar Mehta today inaugurated the UT wide Lieutenant Governor’s Rolling Trophy Cricket-2022 here at Sher-e-Kashmir Cricket Stadium, Sonawar being organised by Mission Youth in collaboration with Youth Services and Sports Department. On the occasion the Chief Secretary urged the participating youth to not […]","content":"Administers pledge to participants against drug abuse JAMMU: Chief Secretary, Dr Arun Kumar Mehta today inaugurated the UT wide Lieutenant Governor’s Rolling Trophy Cricket-2022 here at Sher-e-Kashmir Cricket Stadium, Sonawar being organised by Mission Youth in collaboration with Youth Services and Sports Department. On the occasion the Chief Secretary urged the participating youth to not only play themselves but involve their elders as well. He told them that participating in the game is more important than winning or losing the game. He made out that every participant is a champion irrespective of the result of the game he is participating in. Dr Mehta observed that it is the happiest day for all of us to note that 38000 youth across all the districts of J&K have initially registered themselves for playing this tournament. He expressed that the government is targeting 33 lakh youth to play any game of their interest in the times ahead. The Chief Secretary mentioned that it is the endeavour of the government to facilitate each person to participate in any sort of sporting or cultural activity. He declared that the Culture Department is soon going to organize the cultural events across the UT and urged everybody including the participating youth to take part in any of the cultural events like music, singing, dancing, painting, etc. Dr Mehta maintained that the government has ensured that each panchayat has a play field and youth have facilities close by to hone their sporting skills. He remarked that at present J&K has some 57 stadia that are fully equipped to hold day/night matches. He encouraged the youth to play there after schooling and enjoy the true spirit of the game during night hours. He also interacted with the players there and asked them about their interests and strong areas of the game. He enquired from them about the nature and quality of sports facilities available in their respective areas. He advised them to play well and give them his best wishes for their good performance throughout the tournament. The Chief Secretary administered pledge to youth about working against drug abuse. He inspired them to stop people from falling prey of drug abuse and simultaneously save themselves from this menace. He asked them to channelize their energy in making greater strides in their studies and sports. He told them to make it their objective to weed out this epidemic from our UT. It was given out that LG’s Rolling Trophy is a big initiative taken by the government to provide a platform for the Youth of J&K in the age group of 19 to 35 years. It was also revealed that the department of Youth Services & Sports has remarkably done well by achieving the participation of 13,84,993 youth in the games so far. Regarding the trophy it was said that it would be played as per T-20 format and is being conducted on three tier basis. Tier 1 (Basic Level) is already complete as trials in Cricket have been completed in all the 186 Physical education Zones of the UT. From 186 Physical Education Zones, 38000 Cricketers had registered their credentials for this tourney, as was informed during this event. Similarly in Tier 2 (Intermediate Level) zonal level teams selected by the experts will compete at District Level for the title. During the competitions best players will be selected and a District Team shall be constituted which will represent that District at UT level. It was further given that in the final leg (Tier 3) of the trophy 20 teams, from 20 districts will compete at the apex level. The teams participating in the trophy at UT level will be provided boarding, lodging, refreshment, food and equipment. The Trophy has so far received huge response and sports lovers in general and Cricket enthusiasts in particular across the geography of UT of J&K have applauded this initiative of the UT government. Those who were present on this occasion includes Divisional Commissioner, Kashmir; CEO, Mission Youth; Secretary Youth Services and Sports; Deputy Commissioner, Srinagar; Director, Youth Services and Sports; Secretary, Sports Council and many other officers of the department. Players from different teams and large number of students were also present to watch the inaugural match of this tournament. KR Desk","pubDate":"2022-09-22 20:46:11","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Legends League Cricket 2022 Points Table: Updated standings after Gujarat Giants vs Manipal Tigers Match 5","link":"https://www.sportskeeda.com/cricket-news/news-legends-league-cricket-2022-points-table-updated-standings-gujarat-giants-vs-manipal-tigers-match-5?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Sportz Connect"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-22 20:38:46","image_url":"https://static.sportskeeda.com/editor/2022/09/8dbda-16638674310056-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest 1st wicket partnership in T20 International: Highest opening partnership in T20 International cricket","link":"https://thesportsrush.com/cricket-news-highest-1st-wicket-partnership-in-t20-international-highest-opening-partnership-in-t20-international-cricket/","keywords":["Cricket","babar azam","England","England tour of Pakistan 2022","Mohammad Rizwan","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest 1st wicket partnership in T20I: The ever-reliable Pakistani opening batters proved their mettle yet again tonight. Pakistan opening batters Mohammad Rizwan and Babar Azam made a mockery of a 200-run chase in the second T20I against England at the National Stadium tonight. An unbeaten 117-ball 203-run opening partnership, which resulted in being the fourth-highest… The post Highest 1st wicket partnership in T20 International: Highest opening partnership in T20 International cricket appeared first on The SportsRush.","content":"Pakistan opening batters Mohammad Rizwan and Babar Azam made a mockery of a 200-run chase in the second T20I against England at the National Stadium tonight. An unbeaten 117-ball 203-run opening partnership, which resulted in being the , powered Rizwan and Azam to register the . In fact, it is for the first time that a 10-wicket victory in T20s witnessed two openers crossing the 200-run mark. Putting behind a substandard batting performance in the first T20I at the same venue, Pakistan wicket-keeper batter Rizwan and captain Azam scored their 18th half-century and second century respectively in this format to literally punish the English bowlers. If you think Babar and Rizwan have been the problem… you really haven’t been watching the last couple of years !! — Nasser Hussain (@nassercricket) While Rizwan scored 88* (51) with the help of five fours and four sixes at a strike rate of 172.54, Azam contributed with 110* (66) including 11 fours and five sixes at a strike rate of 166.66 to ensure a 1-1 series scoreline with five more matches to be played. The right-handed batters putting on a show in front of a packed stadium culminated in an electrifying atmosphere as everyone present at the venue appeared to have relished the occasion. In addition to being the fifth-highest T20I opening partnership, Rizwan and Azam’s partnership is also the fifth-highest T20I partnership for all wickets. Only the sixth 200+ T20I partnership (all for first wicket), it has extended this pair’s lead to seven as far as most hundred partnerships in this format are concerned. Currently at the second position in the list of highest opening partnership runs in T20Is, it won’t be too long before Rizwan and Azam (1,621) surpass India’s Shikhar Dhawan and Rohit Sharma (1,743). If the filter of opening batters is removed, Rizwan and Azam (1,929) already have the highest partnership runs in T20Is.","pubDate":"2022-09-22 20:10:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England thumped in first T20 vs Pakistan as hosts’ openers fire unbeaten 203 for stunning ten-wicket victory in Karachi","link":"https://www.thesun.co.uk/sport/19892530/england-pakistan-karachi-cricket-news-moeen-ali/","keywords":["Cricket","Sport"],"creator":["John Etheridge"],"video_url":null,"description":null,"content":"ENGLAND’S friendly welcome on their historic tour of Pakistan suddenly turned into a brutal battering on the field. Incredibly, Pakistan openers Babar Azam and Mohammad Rizwan stormed to a victory target of 200 in the second Twenty20 match without being separated. Pakistan picked up a huge victory over England in KarachiGetty England were thumped in their first T20 against PakistanGetty For all the gratitude England have received for their first visit to the country since 2005, this was an eye-opening hammering for their bowlers. Stand-in captain Moeen Ali rampaged a brilliant 55 not out from 23 balls and Ben Duckett made 43 from 22 deliveries. But their efforts were dwarfed by the Pakistanis. And Moeen’s single over of spin – which cost 21 runs and included three sixes – was the moment when Pakistan looked certain to win. They cantered across the finishing line with England seemingly powerless to stem the flow of boundaries that brought nine sixes and 15 fours. Read More on Cricket 'BEYOND DISRESPECTFUL' Cricket legend Shane Warne’s daughter slams TV mini-series ‘Warnie’ RIP RAUF Tributes paid as legendary cricket umpire dies after suffering cardiac arrest Babar, arguably the world’s best all-format batsman, became the first Pakistani to make two T20 centuries and finished with a brilliant 110 not out from 66 balls. The impish Rizwan was unbeaten on 88. Pakistan’s ten-wicket victory with three balls to spare levelled the series after England’s six-wicket triumph on Tuesday. The third game in the seven-match series is on Friday. Moeen said: “I thought 199 was a very good score. We bowled okay for the first ten overs but the momentum shifted when I bowled my over. “Babar and Rizwan played really well, they were brilliant. I know they get a lot of stick for their strike-rates but they are top players and there’s nothing wrong with their strike-rates.” England had a couple of chances to dismiss Rizwan on 23 and 32 – but Alex Hales spilled a catch at mid-off and wicketkeeper Phil Salt missed a stumping. Most read in Cricket 'BEYOND DISRESPECTFUL' Cricket legend Shane Warne’s daughter slams TV mini-series ‘Warnie’ RIP RAUF Tributes paid as legendary cricket umpire dies after suffering cardiac arrest BURSTING AT THE SEAMS Ex-England cricketer's transformation from thin bowler to bodybuilder SING FOR THE KING England cricketers become first sports team to sing 'God Save the King' CRICKET TRAGEDY Two killed as Pakistan fans celebrate riot-torn Afghan win with rifles STANDING OVA-TION Kia Oval renamed in celebration of Surrey legend Stewart's 90th birthday FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS Much later, in the 19th over, Rizwan was put down by Moeen at extra cover on 93. That over – bowled by left-armer Luke Wood, who was Player of the Match on his England debut 48 hours earlier – went for 17 runs and included three wides. Moeen chose to bat first and included three spinners in his team because he thought the dry, cracked pitch would become more difficult. In fact, the surface eased for batting with the ball skidding onto the bat. Wrist-spinner Adil Rashid added: “We did well to get 199 but the pitch got better. All credit to their openers, they played some magnificent shots. We’re confident of bouncing back in the next game.”","pubDate":"2022-09-22 19:46:59","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England: Babar Azam century in stunning opening stand with Mohammad Rizwan secures remarkable win - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiogFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjcwMzMwNS9wYWtpc3Rhbi12cy1lbmdsYW5kLWJhYmFyLWF6YW0tY2VudHVyeS1pbi1zdHVubmluZy1vcGVuaW5nLXN0YW5kLXdpdGgtbW9oYW1tYWQtcml6d2FuLXNlY3VyZXMtcmVtYXJrYWJsZS13aW7SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs England: Babar Azam century in stunning opening stand with Mohammad Rizwan secures remarkable win  Sky SportsPakistan beat England to win second men’s T20 cricket international – as it happened  The GuardianBabar Azam stuns England with magnificent century in record stand to tie the series  The TelegraphPakistan vs England: Hosts win by 10 wickets to level seven-match series at 1-1  Sky SportsBabar Azam’s century fires Pakistan to 10-wicket T20 win against England  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-09-22 19:30:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-Babar, Rizwan power Pakistan to victory over England","link":"https://www.thestar.com.my/sport/cricket/2022/09/23/cricket-babar-rizwan-power-pakistan-to-victory-over-england","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Babar Azam hit a brilliant century and Mohammad Rizwan scored 88 to lead Pakistan to a crushing 10-wicket win over England in the second Twenty20 International in Karachi on Thursday and level the seven-match series at 1-1. Read full story","content":null,"pubDate":"2022-09-22 18:56:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Jhulan Goswami is all set to take Retirement from International Cricket","link":"https://www.gudstory.com/jhulan-goswami-is-all-set-to-take-retirement-from-international-cricket/","keywords":["Cricket"],"creator":["Rachel Arninda"],"video_url":null,"description":"Jhulan Goswami has decided to pull her boots off from her legendary career Jhulan Goswami, the leading wicket taker in women’s international cricket of Indian Team, is all set to take retirement at the Hallowed Lord’s during India’s third and final ODI against England on 24th September, 2022. Jhulan Goswami is one of the fastest […] The post Jhulan Goswami is all set to take Retirement from International Cricket appeared first on Gud Story.","content":"Jhulan Goswami has decided to pull her boots off from her legendary career Jhulan Goswami, the leading wicket taker in women’s international cricket of Indian Team, is all set to take retirement at the Hallowed Lord’s during India’s third and final ODI against England on 24th September, 2022. Jhulan Goswami is one of the fastest bowlers in women’s international cricket. In May, she surpassed Cathryn Fitzpatrick to become the highest wicket-taker in women’s ODI history.  She was named vice-captain of the national team ahead of the tour of England in 2006. In the tour, she helped India to win the series, including their first victory against England, making a fifty as nightwatchman in the first Test at Leicester and taking her career-best match figures of 10 for 78 – 5 for 33 and 5 for 45 – in the second Test at Taunton. A look back at India’s fast bowler: Jhulan Goswami This success made her the Player of the Series and also brought recognition at the Castrol Awards in Mumbai in September, where she received a Special Award. After that, she won the ICC Women’s Player of Year in 2007 – a year no Indian male player bagged any individual award. Soon after, she was elevated as captain of the national team. Then in 2010, she was conferred with the prestigious Arjuna Award. A Padma Shri followed two years later. Having made her international debut in 2002, Jhulan retired from T20Is in 2018, and played her last Test match in October 2021. A veteran of six Women’s ODI World Cups, Jhulan has played 12 Tests, 68 T20 internationals and 201 ODIs. From 201 WODIs, she has a world record 252 wickets to her name — the only bowler with more than 200 wickets in the format. The next in the list is South Africa’s Shabnim Ismail who has 191 wickets from 127 matches. Across formats, Jhulan has a record 352 wickets to her name. Lisa Sthalekar requested Jhulan Goswami not to retire Lisa Sthalekar, former Australia Captain applauded Jhulan Goswami and appreciated her and urged not to retire from international cricket after the series. “Still too good @jhulanG10…. please don’t retire #ENGvsInd” tweet by Lisa Sthalekar Also read: Bhuvneshwar Kumar Allowed The Ball To Swing During Asia Cup 2022 The post Jhulan Goswami is all set to take Retirement from International Cricket appeared first on Gud Story.","pubDate":"2022-09-22 18:39:59","image_url":null,"source_id":"gudstory","country":["india"],"category":["sports"],"language":"english"},{"title":"Harmanpreet Kaur: Captain of Indian Women National Cricket Team was on fire in the 2nd ODI between England and India","link":"https://www.gudstory.com/harmanpreet-kaur-captain-of-indian-women-national-cricket-team-was-on-fire-in-2nd-odi/","keywords":["Cricket","Harmanpreet Kaur"],"creator":["Rachel Arninda"],"video_url":null,"description":"England won the Toss England Women won the toss and elected to bowl against India in the second ODI of the three-match series at the St Lawrence Ground, Canterbury. The visitors made a promising start to the three-match ODI series against England, with a thumping seven-wicket win on Sunday, at the County Ground in Hove.  The Harmanpreet […] The post Harmanpreet Kaur: Captain of Indian Women National Cricket Team was on fire in the 2nd ODI between England and India appeared first on Gud Story.","content":"England won the Toss England Women won the toss and elected to bowl against India in the second ODI of the three-match series at the St Lawrence Ground, Canterbury. The visitors made a promising start to the three-match ODI series against England, with a thumping seven-wicket win on Sunday, at the County Ground in Hove.  The Harmanpreet Kaur, Captain of Indian Women National Cricket Team century could help India with a win in this game while England will be looking to equalise the series. This series will also serve as a farewell to veteran seamer Jhulan Goswami, who would bow out of international cricket after the third ODI on September 24. England are four wickets down against India while chasing a total of 334. Harmanpreet Kaur smashed an unbeaten 143 off just 111 balls, as India posted a massive 333 for five against England. She drew level with the Indian Opener Smriti in the 2nd ODI between India and England. After the dismissal of Smriti Mandhana, Harleen Deol joined the Indian captain in the middle as the player went on to stitch 113 runs, with both reaching the 50-run mark in quick succession. After that Harmanpreet Kaur slammed her sixth international century in 2nd ODI between England and India. Outstanding Performance by the Indian Captain Harmanpreet Kaur is the captain of Indian Women National Cricket Team. She plays as an all-rounder for the Indian Team and was awarded the Arjun Award for Cricket in 2017 by the Ministry of Youth Affairs and Sports. Veteran cricket commentator Harsha Bhogle also praised the Indian captain for her ferocious batting. “62 in the last 3 overs. When @ImHarmanpreet is in this mood, she inhabits a different planet!” he tweeted. Harmanpreet Kaur, captain of Indian Women National Cricket Team smashed 18 fours and 4 sixes in a powerful knock which drew a standing ovation from a mesmerized audience. Also read: The Controversy of Mithali Raj: BBCI vs Management vs Rogue Agent The post Harmanpreet Kaur: Captain of Indian Women National Cricket Team was on fire in the 2nd ODI between England and India appeared first on Gud Story.","pubDate":"2022-09-22 18:27:54","image_url":null,"source_id":"gudstory","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan beat England to win second men’s T20 cricket international – live reaction - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMifmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvc2VwLzIyL3Bha2lzdGFuLXYtZW5nbGFuZC1zZWNvbmQtbWVucy10MjAtY3JpY2tldC1pbnRlcm5hdGlvbmFsLWxpdmUtc2NvcmUtdXBkYXRlc9IBfmh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvc2VwLzIyL3Bha2lzdGFuLXYtZW5nbGFuZC1zZWNvbmQtbWVucy10MjAtY3JpY2tldC1pbnRlcm5hdGlvbmFsLWxpdmUtc2NvcmUtdXBkYXRlcw?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan beat England to win second men’s T20 cricket international – live reaction  The GuardianPakistan vs England: Live updates from second T20I as tourists seek to double advantage  Sky SportsBabar Azam stuns England with magnificent century to tie the series  The TelegraphPakistan v England 2022, 2nd T20I: score, scorecard, result, report  The CricketerSnipers take positions in Pakistan to try to make cricket feel normal  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-09-22 18:25:56","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"'Record-breaking partnership': Rizwan, Babar hailed by Shahid Afridi and fans after PAK's 10-wicket win over ENG in 2nd T20I","link":"https://zeenews.india.com/cricket/pak-vs-eng-2nd-t20i-record-breaking-partnership-mohammad-rizwan-babar-azam-power-pakistan-to-10-wicket-win-fans-cant-keep-calm-2513277.html","keywords":null,"creator":null,"video_url":null,"description":"The 203-run opening stand between Babar Azam and Mohammad Rizwan is now the highest-ever for Pakistan in T20Is. Not to forget, theirs is also the highest run chase in T20 cricket without losing a wicket.","content":"Babar Azam and Mohammad Rizwan were a sight to behold on Thursday night as their dominant opening partnership helped Pakistan thrash England in the 2nd T20I by 10 wickets to level the seven-match series 1-1. Pakistan captain Babar Azam himself slammed a hundred off just 62 balls to smash many records. This was his 2nd T20I hundred and it came off after a dry run in Asia Cup 2022. Rizwan too showed his class with an unbeaten 88 off 51 balls that included 5 fours and 6 sixes respectively. On the other hand, Babar Azam smashed 110 off 66 balls that included 11 fours and 5 sixes respectively. The 203-run opening stand is now the highest-ever for Pakistan in T20Is. Not to forget, theirs is also the highest run chase in T20 cricket without losing a wicket. The previous highest in international T20s was 169 by New Zealand vs Pakistan in 2016. In all T20s, the previous highest was 184 by Kolkata Knight Riders vs Gujarat Lions in 2017. Take a look at fans reactions to Babar Azam and Mohammad Rizwan' knocks. This was the highest run chase in ALL T20 cricket without losing a wicket. The previous highest in international T20s was 169 by New Zealand vs Pakistan in 2016. In all T20s, the previous highest was 184 for Kolkota Knight Riders vs Gujrat Lions in 2017. Remarkable. #PAKvENG — Aatif Nawaz (@AatifNawaz) September 22, 2022 The two best batters in the world have lighted up the stage once again. @babarazam258 the superstar! @iMRizwanPak was no less. What a feast! __ Pakistan Zindabad! ___ pic.twitter.com/Ef636Npt9E — Shaheen Shah Afridi (@iShaheenAfridi) September 22, 2022 Records tumbling win _ Incredible effort from @babarazam258 and @iMRizwanPak _ #PAKvENG | #UKSePK pic.twitter.com/LUOT01yozW — Pakistan Cricket (@TheRealPCB) September 22, 2022 King is Back 100 up_____ Babar Azam's coming in form is good for Pakistan keep it up captain __ Alweys Love u &Pakistan @babarazam258 #BabarAzam pic.twitter.com/0SxeYSPnYZ — Sohail Shafi (@sohail_shafi3) September 22, 2022 200-0. This is unreal. The best in the sport on the field together. We are in the presence of royalty. #PakvsEng2022 #BabarAzam #PAKvENG pic.twitter.com/Zg7KZVk9me — Cricket insect (@000insect) September 22, 2022 What a way to finish the game! This will go down as a memorable chase for @babarazam258 and @iMRizwanPak but also all of us as a nation. You can't stay down for long when you're the best.__ #PAKvsEng pic.twitter.com/WGt6ON2kej — Shahid Afridi (@SAfridiOfficial) September 22, 2022","pubDate":"2022-09-22 18:22:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Andrew Strauss plans for cricket reform labelled ‘unworkable’ by county chiefs","link":"https://www.belfasttelegraph.co.uk/sport/cricket/andrew-strauss-plans-for-cricket-reform-labelled-unworkable-by-county-chiefs-42010799.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"County chiefs have criticised Sir Andrew Strauss’ proposed reforms for domestic cricket despite admitting change is needed.","content":null,"pubDate":"2022-09-22 18:21:20","image_url":"https://www.belfasttelegraph.co.uk/sport/cricket/6a258/42010795.ece/AUTOCROP/w1240h700/bpanews_4466b6dc-c2ba-465a-a8d6-e53bebfc7ecd_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Pakistan beat England to win second men’s T20 cricket international – live reaction","link":"https://www.theguardian.com/sport/live/2022/sep/22/pakistan-v-england-second-mens-t20-cricket-international-live-score-updates","keywords":["Pakistan v England 2022","Pakistan cricket team","England cricket team","Cricket","Sport","Over by over reports"],"creator":["Taha Hashim"],"video_url":null,"description":"Live over-by-over updates from the 3.30pm BST startGet in touch! Feel free to mail Taha or tweet @TahaHash4th over: England 32-0 (Salt 11, Hales 21) Dahani into the attack with that very straight run-up of his. Hales after missing a pull third ball goes for a massive heave and continues to enjoy some luck – another thick edge flies to the right of the keeper for four. He’s in smash-mode tonight. Salt punches to mid-off for a single to finish the over. 3rd over: England 24-0 (Salt 9, Hales 15) After a couple of dots, Hales manages to flick leg-side and pick up four behind square. He uses his crease again next ball, getting away with a thick edge that flies for six over the third-man rope! Continue reading...","content":"Show key events only Please turn on JavaScript to use this feature Live feed Key events 20m ago Pakistan bounce back to make it 1-1 53m ago Pakistan win by 10 wickets! 1h ago Century for Babar! 2h ago Pakistan need 200 to win from 20 overs 3h ago WICKET! Brook b Rauf 31 (England 160-5) 3h ago WICKET! Duckett b Nawaz 43 (England 101-3) 3h ago WICKET! Salt b Rauf 30 (England 95-3) 4h ago WICKET! Malan b Dahani 0 (England 42-2) 4h ago WICKET! Hales b Dahani 26 (England 42-1) 5h ago England have won the toss and will bat first 5h ago Preamble Show key events only Please turn on JavaScript to use this feature 15m ago 19.30 Andy Bull’s report from Karachi Babar Azam’s century fires Pakistan to 10-wicket T20 win against England Read more Updated at 19.34 BST 20m ago 19.25 Pakistan bounce back to make it 1-1 Andy Bull’s report has dropped , so I’m going to wave goodbye. We’ll be back for the third T20I… tomorrow! 26m ago 19.20 “I thought we batted well and first 10 overs we actually bowled OK , they were going at eight and a bit an over,” says Moeen Ali at the post-match presentation. “The momentum changed when I bowled my over and I went for 20 [21] and that really gave them the belief and after that they were almost unstoppable.” 35m ago 19.11 A really tough outing for England’s bowlers. Liam Dawson – who was unlucky to have Rizwan dropped off his bowling – and Sam Curran were economical, but there was plenty of punishment elsewhere. Still, they’ve got five – five – more games in this series to sort things out. And there’s still Mark Wood, Chris Woakes and Reece Topley to come back in, particularly to help out in the Powerplay where they haven’t taken a wicket yet in this series. 49m ago 18.57 That was Babar Azam’s 26th international hundred . He’s got seven in Tests, 17 in ODIs, and two in T20Is. He’s 27 years old. 🔊 Karachi has witnessed a Babar special 👑 #PAKvENG | #UKSePK pic.twitter.com/vkblIu9icE — Pakistan Cricket (@TheRealPCB) September 22, 2022 53m ago 18.53 Pakistan win by 10 wickets! That’s a wrap. We’ve seen something truly special in Karachi tonight, with Pakistan chasing down 200 without losing a single wicket . Rizwan looks to the heavens before giving his good mate Babar a big ol’ hug. What an atmosphere it looks out there as the fans soak this in alongside their heroes out in the middle. Pakistan win by 10 wickets in stunning style. Photograph: Anjum Naveed/AP Updated at 18.55 BST 1h ago 18.48 19th over: Pakistan 197-0 (Babar 105, Rizwan 87) Just one conceded first up from Wood, and he’s only marginally off from nailing the yorker next ball as Babar whips away for four. Wood responds by getting the yorker right, but Rizwan fetches a ball wide of off stump and sends it down the ground for four. Moeen drops a very tough chance at short extra cover as Wood starts to lose his lines, bowling three wides in the over. Pakistan need just three from the final over. 1h ago 18.41 Century for Babar! 18th over: Pakistan 180-0 (Rizwan 78, Babar 100) Curran’s cutters have been good today and he leaks just a couple of singles from his first four before Babar taps away for one to move to a sensational hundred. He really is something else, probably the best all-format batter going right now. But, whisper it, that is a really, really good over from Sam Curran. Pakistan need 20 from 12. Astonishing from Babar. Photograph: Anjum Naveed/AP Updated at 18.49 BST 1h ago 18.36 17th over: Pakistan 176-0 (Babar 98, Rizwan 76) England just can’t stop the boundaries. Willey’s penultimate ball is a full toss and Babar hits it towards deep midwicket, where Sam Curran gives it his all to try and pull off something sensational – but it’s six . Photograph: Alex Davidson/Getty Images Updated at 18.40 BST 1h ago 18.33 These two are something else: Most century stands in men's T20I cricket: Rizwan/Babar - 7 Rahul/Rohit – 5 Dhawan/Rohit – 4 Finch/Warner – 4 Guptill/Williamson – 4 Mohammad Rizwan and Babar Azam out ahead of the pack. #PAKvENG pic.twitter.com/GP32bhE5BG — Wisden (@WisdenCricket) September 22, 2022 1h ago 18.32 16th over: Pakistan 164-0 (Rizwan 72, Babar 90) Wood goes wide and Babar cuts behind point to keep the boundary count running. The final ball of the over sees Babar enter the nineties; he swats Wood’s cutter for four more. Pakistan need 36 off 24 balls. They’re in control. 1h ago 18.26 It really is: Raining sixes in Karachi 🚀 #PAKvENG | #UKSePK pic.twitter.com/4DBmw1k0Fu — Pakistan Cricket (@TheRealPCB) September 22, 2022 1h ago 18.24 15th over: Pakistan 151-0 (Babar 79, Rizwan 71) Rizwan’s lightning-quick hands are at it again as he smashes Rashid’s first ball across the line for six. And then it’s Babar’s turn. It’s a googly from Rashid, and Babar gets down on the sweep to pick up six for himself. The momentum is with the hosts. 1h ago 18.21 14th over: Pakistan 135-0 (Rizwan 64, Babar 70) What was looking to be a decent over for England ends with Babar flicking Curran for four more. Pakistan need 65 from 36 balls. 1h ago 18.17 13th over: England 125-0 (Babar 64, Rizwan 60) Moeen finally gives himself a bowl and it’s not a great start as he drops short and watches Babar smash it over deep midwicket for six. Later in the over, Moeen tosses one up wide outside off and Babar fetches it for six more over long-on. But the best shot of the over is the last one: Rizwan gets down quickly to sweep for six more . A fantastic over for Pakistan. England, after 33 overs today, finally look as if they’re in a bit of trouble. 2h ago 18.13 12th over: Pakistan 104-0 (Babar 50, Rizwan 53) Dawson in for his final over of the innings. He adapts well to some pre-delivery movement from Rizwan, firing in a yorker to concede just a single. All in all, it’s another very good set from Dawson, who finishes with 0-26 from his four tonight. Meanwhile Babar celebrates his half-century. 2h ago 18.09 11th over: Pakistan 99-0 (Babar 47, Rizwan 51) Rizwan brings up another T20I half-century, his 18th to be precise. And then Babar goes straight against Wood, sending a slower ball for six over the bowler’s head. A lovely-looking pull shot for one ends the over. 2h ago 18.03 10th over: Pakistan 87-0 (Rizwan 48, Babar 38) Dawson back in for the middle-overs squeeze and this is good stuff from the Hampshire man, offering little room for a get-out shot. Just four singles from it. We’re halfway and Pakistan are well placed at 87-0 – but one of these two really does have to go and get a big one today. 2h ago 17.59 9th over: Pakistan 83-0 (Babar 36, Rizwan 46) Babar goes after Rashid’s first ball, finding four through the off side. Otherwise, it’s just singles. 2h ago 17.56 8th over: Pakistan 74-0 (Babar 29, Rizwan 44) Curran lets us get our breath back. Just six off it. 2h ago 17.51 7th over: Pakistan 68-0 (Rizwan 41, Babar 26) Oooh , Rizwan advances and misses the fuller delivery from Adil Rashid but Salt fails to gather the ball for a stumping chance. Short and down the leg-side from Rashid a few balls later, which Rizwan helps along for four, and it’s soon back-to-back boundaries after a tidy sweep behind square from the Pakistan gloveman. 2h ago 17.47 6th over: Pakistan 59-0 (Rizwan 32, Babar 26) Dropped! Dawson tosses it up, Rizwan comes down and doesn’t get the right connection, sending the ball up high into the night sky. Hales, dropping back from mid-off, juggles but can’t hold on. And then the kicker: Rizwan comes down the track again but nails it this time, smashing it for six over long-on. Dawson then drops short to Babar, who rocks back and pulls for four. Just the Powerplay Pakistan needed. 2h ago 17.43 5th over: Pakistan 46-0 (Rizwan 23, Babar 22) Terrific from Rizwan, fast hands flicking Willey for six behind square. Babar then makes room for an off-side thump for four. These two pretty much repeating what they did the other night. Photograph: Anjum Naveed/AP Updated at 17.48 BST 2h ago 17.39 4th over: Pakistan 32-0 (Babar 16, Rizwan 15) So just the one for Dawson as Moeen introduces Luke Wood from the other end. And that’s lovely from Babar – it’s short and wide and the Pakistan captain responds with a comprehensive cut for four. But Wood keeps things quiet from the rest of the over. 2h ago 17.34 3rd over: Pakistan 25-0 (Rizwan 14, Babar 11) The left-arm revolution continues. Sam Curran replaces David Willey and after a couple of dots Babar finally breaks through, slapping the ball past mid-on, who got fingertips but couldn’t stop the boundary. The over ends with a slower ball that Babar swats for four down the ground. 2h ago 17.30 2nd over: Pakistan 16-0 (Rizwan 13, Babar 3) England copy Pakistan and decide to give the left-arm spinner the new ball. Hiya, Liam Dawson. He’s on the money, too, bowling tight lines to concede just four singles. 2h ago 17.25 1st over: Pakistan 12-0 (Babar 1, Rizwan 11) David Willey opens up and Rizwan follows up a cut for four with a flick between midwicket and mid-on for another boundary a few moments later. Pakistan are above the rate! 2h ago 17.19 Pakistan need 200 to win from 20 overs Don’t need to get the calculator out for this one – Pakistan need 10 an over. Some cracking knocks from England there, particularly from Duckett and Moeen. The former was all about delicate sweeps, manipulating spin in the middle overs. The latter showed off his immaculate bat swing, peppering deep midwicket against both spin and pace. Harry Brook excelled once again, too. Pakistan are going to have to pull off something special here. 3h ago 17.13 20th over: England 199-5 (Moeen 55, Curran 10) England running hard out there, picking up two twos to start off the final over of the innings. Hasnain gives a free hit away after overstepping but Moeen can only squirt away a single. Curran gets himself off strike after a dot before Moeen plays a stunning stroke. Keeps still, and just launches a fuller ball for six over deep midwicket. And then another SIX to finish! Mo, that is unreal . This one’s short, but also stays a bit low and the pull flies away. What a knock from the England captain, who went to fifty with that final shot off just his 23rd delivery. England have been truly magnificent with the bat here. 3h ago 17.05 19th over: England 180-5 (Moeen 38, Curran 9) Sam Curran, now two-time County Championship winner Sam Curran, kicks off Rauf’s final over with a ramp for four. But Rauf manages to limit the damage elsewhere, with just four more runs following in the set. 3h ago 17.02 18th over: England 172-5 (Curran 2, Moeen 37) Moeen moves to the leg side and Dahani follows him, but the left-hander whips away to find four at deep midwicket. A shorter ball follows and Moeen hits it straight toward Khushdil Shah at deep midwicket who… drops it! Ooof, that really should’ve been taken. Moeen picks up for four through the fine-leg region to finish the over. 3h ago 16.57 WICKET! Brook b Rauf 31 (England 160-5) Rauf goes short and Brook hooks over fine leg for another six. But Rauf ends the fun, bowling Brook, who was trying to pull off a very ambitious scoop. 17th over: England 160-5 (Moeen 27, Curran 0) Harry Brook is bowled out by Haris Rauf for 31. Photograph: Anjum Naveed/AP Updated at 17.24 BST 3h ago 16.52 16th over: England 151-4 (Moeen 25, Brook 24) Mo is flying! He gets on top of a short ball from Hasnain to send the ball racing to the square leg boundary. He digs out a yorker for a single next ball but Brook finishes the over with an unreal six! It’s a slower ball from Hasnain which Brook makes room for to drive over long-off, over the rope. These two are having loads of fun. 3h ago 16.47 15th over: England 133-4 (Brook 13, Moeen 18) Back-to-back sixes from Moeen to close the over! Both times he keeps it simple: down on the knee to smash it over deep midwicket. Moeen against spin in this format is always a hell of a watch. 3h ago 16.43 14th over: England 114-4 (Moeen 1, Brook 12) An optimistic review from Pakistan goes nowhere before Brook follows up a couple with a hook off Dahani for six! 76 metres long from the Yorkshireman. 3h ago 16.37 13th over: England 103-4 (Brook 3, Moeen 1) Pakistan back in the game here with the dismissals of Salt and Duckett. Time for Mo to have a go. 3h ago 16.35 WICKET! Duckett b Nawaz 43 (England 101-3) Big, big breakthrough. After another boundary Duckett shuffles across his crease again to open up the region behind square on the leg side. But Nawaz finally has his revenge, getting the ball to straighten and knock over the stumps. The big one. Ben Duckett goes for 43. Photograph: Alex Davidson/Getty Images Updated at 16.41 BST 3h ago 16.30 12th over: England 96-3 (Brook 1, Duckett 39) Harry Brook is in and he’s early to show off a solid forward defence to Rauf before guiding one to third man for a single. Top over from the tearaway. 3h ago 16.27 WICKET! Salt b Rauf 30 (England 95-3) Babar decides to return to pace, calling for Haris Rauf who goes straight and fast to beat Salt’s heave. Much needed wicket for Pakistan. Phil Salt is bowled for 30. Photograph: Alex Davidson/Getty Images Updated at 16.37 BST 3h ago 16.25 11th over: England 93-2 (Salt 28, Duckett 39) Another top sweep! Duckett goes hard at Qadir’s googly to pick four more, and then… another one! This time it’s the leg-spinner and Duckett smashes it to the rope at deep midwicket. Fifty stand comes up for this pair. 3h ago 16.19 10th over: England 80-2 (Salt 26, Duckett 28) Duckett really does look good on the sweep – and he can play all kinds of them. He goes orthodox to take a boundary off Nawaz’s first ball, then plays a delicate ramp for a couple. The left-hander rocks back and nails a pull a few balls later for two, and finishes with a reverse slap for four. 4h ago 16.13 9th over: England 66-2 (Duckett 15, Salt 25) Qadir starting to get some proper grip from the surface. Duckett shows off his sweeps (orthodox and reverse) before Salt fails to lay a bat on a sharp leggie. 4h ago 16.09 8th over: England 62-2 (Salt 24, Duckett 12) Very cheeky from Salt as a reverse sweep/dab gets him a couple from the off side. But Duckett outdoes him with the last ball of Nawaz’s over, nailing the ramp for four over the keeper’s head. That was gorgeous. 4h ago 16.05 7th over: England 53-2 (Duckett 7, Salt 20) The twirl of Usman Qadir enters the game. He’s lovely to watch when he gets that googly ragging. Nothing too lethal in that over but he goes for just five. 4h ago 16.03 6th over: England 48-2 (Duckett 6, Salt 16) Ben Duckett survives the hat-trick ball and picks up a couple on the leg-side to get himself going. Dahani finishes up with a cutter that Duckett isn’t fooled by – he plays a controlled pull to pick up his first boundary. Nonetheless, a cracking over for Pakistan. 4h ago 15.58 WICKET! Malan b Dahani 0 (England 42-2) Bowled him around the legs! Malan shows his leg stump and misses out on the flick as Dahani, from over the wicket, puts himself on a hat-trick. Fast and straight – the game is a pretty simple one at times. Out! Photograph: Alex Davidson/Getty Images Updated at 16.14 BST 4h ago 15.56 WICKET! Hales b Dahani 26 (England 42-1) Hales’ luck finally runs out as Dahani returns to rattle the stumps! Alex Hales is bowled by Shahnawaz Dahani. Photograph: Anjum Naveed/AP Updated at 16.06 BST 4h ago 15.54 5th over: England 42-0 (Salt 16, Hales 26) Haris Rauf somehow hasn’t bowled Hales there – the right-hander is nowhere near it on the pull shot to one that stays low. Hales then opens up the off side to slap the ball over backward point, the ball trickling away for four more. 4h ago 15.50 4th over: England 32-0 (Salt 11, Hales 21) Dahani into the attack with that very straight run-up of his. Hales after missing a pull third ball goes for a massive heave and continues to enjoy some luck – another thick edge flies to the right of the keeper for four. He’s in smash-mode tonight. Salt punches to mid-off for a single to finish the over. 4h ago 15.44 3rd over: England 24-0 (Salt 9, Hales 15) After a couple of dots, Hales manages to flick leg-side and pick up four behind square. He uses his crease again next ball, getting away with a thick edge that flies for six over the third-man rope! 4h ago 15.40 2nd over: England 13-0 (Salt 9, Hales 4) Cracking shot from Salt! He greets the left-arm spin of Mohammad Nawaz with a six over long-off. Hales tries to go big down the ground too but is still searching for the middle tonight. 4h ago 15.36 1st over: England 3-0 (Salt 2, Hales 1) Hasnain on the pads first up, and Salt’s flick to fine leg gives him one. Some lovely shape away from the right-hander to Hales next ball, who gets off the mark with his second. Solid start from the 22-year-old, Pakistan’s only change from the other night. 4h ago 15.30 Right then, we’re about to get started. David Gower’s on comms, Mohammad Hasnain’s got the ball and Phil Salt’s on strike. Let’s play. 4h ago 15.27 A lovely welcome from John Starbuck: “Just a line to say welcome to the wonderful world of the OBO, where all opinions may be entertained from across the world.” Thanks for having me! 4h ago 15.25 Elsewhere, Surrey have won the County Championship! Rory Burns smashed 30* off 16 balls (!) to get his side over the line in a chase of 55 against Yorkshire at The Oval. Tanya Aldred’s there taking it all in. 5h ago 15.13 Teams: Pakistan: Babar Azam (c), Mohammad Rizwan (wk), Haider Ali, Shan Masood, Iftikhar Ahmed, Khushdil Shah, Mohammad Nawaz, Usman Qadir, Haris Rauf, Mohammad Hasnain, Shahnawaz Dahani England: Phil Salt (wk), Alex Hales, Dawid Malan, Ben Duckett, Harry Brook, Moeen Ali (c), Sam Curran, David Willey, Adil Rashid, Liam Dawson, Luke Wood 5h ago 15.10 England have won the toss and will bat first Moeen wins the toss again – but England are having a bat first tonight. One change: out goes the pace of Richard Gleeson, in comes the left-arm tweak of Liam Dawson. Just the one change for Pakistan as well: Naseem Shah is replaced by the also very fast Mohammad Hasnain. 5h ago 15.03 Preamble Hello, hello, hello. We’re back in Karachi for the second of seven – seven – T20Is between England and Pakistan. A new-look England put up a thoroughly professional performance on Tuesday: debutant Luke Wood looked the part, bowling briskly to take 3-24, while Alex Hales marked his return from three years in exile with a half-century. Harry Brook played the best knock of his international career so far, smashing 42* off 25 in a comfortable six-wicket win. Pakistan, on the other hand, had little to smile about beyond a sparky 85-run stand between their two men up top, Babar Azam and Mohammad Rizwan. But it was also one of those nights where the game was secondary. England were back playing in Pakistan for the first time since 2005. The gradual return of international cricket to these shores means a great deal to the people of this cricket-loving nation, and so there was much to celebrate during the series opener even if the hosts were below par. “Karachi put on a show tonight,” said Hales afterwards. And now the fun continues at the NSK; expect another electric atmosphere. I’ll be back in a bit with the toss and the teams. It’s also my OBO debut so go easy on me, folks (someone sort out my cap presentation please). Slide into my DMs at @tahahash or drop me a line at taha.hashim.casual@theguardian.com. Updated at 15.18 BST Topics Pakistan v England 2022 Pakistan cricket team England cricket team Cricket Over by over reports Reuse this content","pubDate":"2022-09-22 18:20:32","image_url":"https://i.guim.co.uk/img/media/5ac70a0f6ed1e727c06e4edeaad4e755500db54e/0_363_5483_3292/master/5483.jpg?width=460&quality=85&auto=format&fit=max&s=15a1072510e847007b4e2179bedf54a2","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Babar Azam’s century fires Pakistan to 10-wicket T20 win against England","link":"https://www.theguardian.com/sport/2022/sep/22/babar-azams-century-fires-pakistan-to-10-wicket-t20-win-against-england","keywords":["Pakistan v England 2022","Pakistan cricket team","England cricket team","Sport","Cricket"],"creator":["Andy Bull at the National Stadium"," Karachi"],"video_url":null,"description":"England 199-5: Pakistan 203-0Pakistan level series after chasing 200 without losing wicketOn Tuesday night, the Karachi crowd were so loud that Alex Hales described it as one of the best atmospheres in world cricket. But that paled in comparison to how the National Stadium felt and sounded two days later, when Pakistan won a famous victory by 10 wickets after chasing down England’s sizeable 199 with three balls to spare. There’s been a lot of talk in the Pakistani media about the weakness of the team’s middle order. Truth is, it doesn’t much matter how the rest of them bat when you have two openers who can play the way Mohammad Rizwan and Babar Azam did here.No one left early this time, not with two of the best T20 batsmen in the world (Rizwan is currently No 1, Azam No 3 in the ICC rankings) going like this. It ended up being by far the biggest total ever chased down in a 10-wicket victory in the history of international T20 cricket. By the time Moeen Ali, who must have desperately regretted his decision to bat first, brought himself on to bowl the 13th over and ended up conceding 21 runs, England seemed to be pretty much flat out of ideas about how to get them out. Continue reading...","content":"No one left the National Stadium early . Two days earlier, fans had poured out of the ground in the final few overs of England’s win . This time, every one of the 30,000 fans stayed right until the very end of a famous victory. Between them Pakistan’s openers, Babar Azam and Mohammad Rizwan, chased down England’s formidable total of 199 with three balls to spare. It was the highest chase in men’s T20 cricket without losing a wicket. There’s been a lot of talk in Pakistan about the weakness of the team’s middle order. Truth is, it doesn’t matter how everyone else bats when you have openers who can play like that. Pakistan beat England to win second men’s T20 cricket international – live reaction Read more Moeen Ali said that the game turned when he brought himself on to bowl the 13th over, at which point Pakistan were 104 for none. Azam pulled him over mid-wicket for one six and drove him down the wicket for another. By the time Rizwan slog-swept a third over square leg off the last ball, the over had cost 21. “I genuinely feel my over cost the game for us,” Ali said. “It was a gamble on my part, I was almost trying to buy a wicket, and it didn’t come off.” It’s true that England seemed to run out of ideas about how to drag the game back after that, but still, he was being generous to his team. The real turning point came in the fifth over of the innings when Rizwan, on 23, cuffed the ball to mid-on off Liam Dawson and Alex Hales dropped the catch. Rizwan gave another chance in the very next over, when Phil Salt missed a stumping off the first ball of Adil Rashid’s spell, and a third much later in the game, when Ali dropped a hard chance at cover. “We take our catches and it’s a different game in my opinion,” Ali said. Maybe. But Azam’s innings was immaculate. His first 30 runs came a little better than a run-a-ball, but he ended up with 110 off 66. It was a breathtaking innings, full of hurried singles, vicious cuts and wicked pulls. Rizwan finished on 88 off 51. Dawson had replaced Richard Gleeson, which meant England ended up in the unusual position where they had an attack of three-spinners and three left-arm seamers. All that variety didn’t do much for them. “There were a few other things we should have tried,” Ali said ruefully. “Nobody really bowled a bouncer.” It was a bit late to think of that now. Only Dawson and Sam Curran had any real control over the scoring rate. Pakistan were particularly severe on David Willey, who’s now bowled 7.3 overs for 85 runs in two games, and will surely drop out of the team for Friday’s game. Ali says England will “make a couple of changes”, and hinted that some of the injured players in the squad, Mark Wood, Chris Woakes and Gleeson himself, may be available. Olly Stone may be more likely. Like Ali said , “in T20 cricket you want people who can bowl 90mph” and England badly lacked that. Ali will know better what to expect from the pitch, too. He admitted that he had misread this one, which played surprisingly well given that it looked so dry and cracked, although he said he didn’t regret his decision. England had, after all, batted pretty well themselves. Moeen Ali hit his half-century from just 23 balls but his efforts were soon eclipsed by Pakistan’s openers. Photograph: Anjum Naveed/AP It was built around an opening stand of 42 between Hales and Salt, an inventive 43 off 22 balls by Ben Duckett full of scoops and sweeps and glances, a blistering 31 off 19 by Harry Brook and, the cherry on top, a 23-ball fifty by Ali. He had said earlier in the week that what he really wanted to do while in Pakistan was help raise funds for the floods affecting the south of the country. He did exactly that by hitting four glorious sixes, each of which cost the sponsors a $1,000 donation. His partnership with Brook was worth 59 off 27 balls. But all their efforts were put in fresh perspective by the way Pakistan batted. Azam and Rizwan hit 16 fours and nine sixes. Their bowlers provided their share of entertainment too, especially Haris Rauf and Shahnawaz Dahani, who took two wickets each. Dahani, who plays for the local province of Sindh, lit up the ground when he bowled Hales and Dawid Malan with consecutive balls. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. Dahani celebrated each wicket by spinning on his heel and sprinting back the way he came, wagging his finger and shouting madly like he was chasing after someone who had just pinched his bicycle. Which was all very entertaining, but led to an unfortunate moment later in the innings when he set off all over again to celebrate having Ali caught in the deep. He made it most of the way to the boundary before he finally realised, after he heard Azam shouting out, that Khushdil Shah had dropped the catch. Funny as that was, Hales’ drop meant it was Dahani and his teammates who had the last laugh.","pubDate":"2022-09-22 18:11:15","image_url":"https://i.guim.co.uk/img/media/d4c030d56d1d4dddfe4db534bbc9f6f7d082d351/792_319_4578_2747/master/4578.jpg?width=460&quality=85&auto=format&fit=max&s=92e889f210705e77200d8755c84e2c10","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Pakistan vs England LIVE score 2nd T20I: Babar Azam (110*), Rizwan (88*) anchor PAK to record run chase - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwOi8vd3d3LmZpcnN0cG9zdC5jb20vZmlyc3Rjcmlja2V0L3Nwb3J0cy1uZXdzL3Bha2lzdGFuLXZzLWVuZ2xhbmQtMm5kLXQyMGktbGl2ZS1jcmlja2V0LXNjb3JlLXN0cmVhbWluZy1jb21tZW50YXJ5LWthcmFjaGktMTEzMTIyOTEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs England LIVE score 2nd T20I: Babar Azam (110*), Rizwan (88*) anchor PAK to record run chase  FirstpostPAK vs ENG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- England Tour of Pakistan, 2nd T20I  Cricket AddictorPAK vs ENG 2nd T20 Live Score Updates: Babar, Rizwan demolish England as Pakistan win by 10 wickets, level series at 1-1  The Indian ExpressMatch Preview - England vs Pakistan, England in Pakistan 2022, 2nd T20I  ESPNcricinfoAlex Hales lauds English bowlers' efforts after six-wicket victory against Pakistan  GEO SUPERView Full coverage on Google News","content":null,"pubDate":"2022-09-22 17:56:15","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"County Championship: Surrey beat Yorkshire by 10 wickets to win title - BBC","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzYyOTg4OTk50gEuaHR0cHM6Ly93d3cuYmJjLmNvbS9zcG9ydC9jcmlja2V0LzYyOTg4OTk5LmFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"County Championship: Surrey beat Yorkshire by 10 wickets to win title  BBCCounty cricket: Surrey beat Yorkshire to win title, Kent defeat Hampshire – live  The GuardianOllie Pope stars as Surrey win County Championship title after convincing victory over Yorkshire  Sky SportsCounty Championship: Surrey edge closer to title as Yorkshire struggle  BBCSurrey beat Yorkshire to clinch County Championship Division One title in style  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-09-22 17:05:29","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"'God of cricket for a reason': Sachin Tendulkar turns back the clock with smashing 40 vs ENG-L, leaves fans in awe - WATCH","link":"https://zeenews.india.com/cricket/road-safety-world-series-ind-l-vs-eng-l-sachin-tendulkar-turns-back-the-clock-with-fiery-40-leaves-fans-in-awe-watch-2513249.html","keywords":null,"creator":null,"video_url":null,"description":"Even at 49 years of age and 9 years after retiring from the sport, Tendulkar continues to bat like a dream and the fans who attended the game at the Rajiv Gandhi International Cricket Stadium in Dehradun could not have asked for more.","content":"Legendary Indian batter Sachin Tendulkar may have retired from the game but he surely has not forgotten how to bat. We keep on repeating this line one match after the other in Road Safety World Series 2022. In the match vs England Legends, the India Legends captain Sachin Tendulkar turned the clock back as he smashed 40 off just 20 balls. His knock included 3 fours and 3 sixes each and came at a strike rate of 200. Tendulkar played some extra-ordinary shots in the innings. Once against a pacer, he came down the track to hit the ball over long on region for a maximum. On other occasion, again against a pacer, he played a hook shot. That was something rare and special from Tendulkar. The fans could not stop gushing over Tendulkar as he yet again showed that class is permament. Even at 49 years of age and 9 years after retiring from the sport, Tendulkar continues to bat like a dream and the fans who attended the game at the Rajiv Gandhi International Cricket Stadium in Dehradun could not have asked for more. Take a loot at some of Tendulkar shots and reactions of the fans on his blistering 40 run knock. Class... Sachin Tendulkar _ pic.twitter.com/1BIgrBuI2u — ____ ______ (@Loyalsachfan01) September 22, 2022 Vintage Sachin Tendulkar pic.twitter.com/qvogWLkVqC — Sachin Tendulkar__FC (@CrickeTendulkar) September 22, 2022 Sachin Tendulkar at the age of 48/49 _ The Greatest Ever...! #RoadSafetyWorldSeries pic.twitter.com/XD3gRgiesX — ______ (@Shebas_10dulkar) September 22, 2022 The Master Sachin Tendulkar striking with 264.3 strike rate at the moment. pic.twitter.com/NSVGG2bggT — CricketMAN2 (@ImTanujSingh) September 22, 2022 230+ Strike Rate... Slow pitch, Damp pitch , Slow outfield SACHIN TENDULKAR _... pic.twitter.com/MF3rTJ3AUV — ____ ______ (@Loyalsachfan01) September 22, 2022 At the end of the innings, India Legends put on 170/5 in 20 overs. Tendulkar top-scored with 40 as told earlier. Yuvraj Singh, Tendulkar's former India teammate, slammed 31 off 15 balls that included 1 four and 3 sixes. Stuart Binny played a good hand with 18 off 11 balls, smashing 2 fours and 1 six respectively. Not to forget, Pathan brother played brilliant cricket as well with the bat. Yusuf Patha, who came to bat at No 5, smashed 27 off just 11 balls, that included 1 fur and 3 sixes respectively. Irfan Pathan, on the other hand, provided the finishing touch with 11 off 9 balls that included 1 six. Stephen Parry was the best bowler for England on the night picking up 3 wickets from his 3 over spell in the rain-curtailed 15-over match in Dehradun. Chris Schofield too picked a wicket and that was a big one in form of Tendulkar.","pubDate":"2022-09-22 16:57:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Most T20 Wickets: Battle on as Bhuvneshwar Kumar vs Yuzvendra Chahal takes center stage for most T20 wickets","link":"https://www.indiatvnews.com/sports/cricket/most-t20-wickets-battle-on-as-bhuvneshwar-kumar-vs-yuzvendra-chahal-takes-center-stage-for-most-t20-wickets-ind-vs-aus-ind-vs-aus-live-2022-09-22-810637","keywords":null,"creator":null,"video_url":null,"description":"The second T20I between India and Australia is all set to take center stage on Friday as India and Australia collide in the decisive clash. The match at the Vidarbha Cricket Association (VCA) Stadium will have bearings on a small matter between Bhuvneshwar Kumar and Yuzvendra Chahal as they bid to become India’s highest wicket-taker in T20Is. Both Bhuvneshwar and Chahal are on 84 wickets each and will look to pip one another to the accolade.","content":null,"pubDate":"2022-09-22 15:45:27","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"County cricket: Surrey beat Yorkshire to win title, Kent defeat Hampshire – live - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvc2VwLzIyL2NvdW50eS1jcmlja2V0LXN1cnJleS12LXlvcmtzaGlyZS1oYW1wc2hpcmUtdi1rZW50LWxpdmXSAWpodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvbGl2ZS8yMDIyL3NlcC8yMi9jb3VudHktY3JpY2tldC1zdXJyZXktdi15b3Jrc2hpcmUtaGFtcHNoaXJlLXYta2VudC1saXZl?oc=5","keywords":null,"creator":null,"video_url":null,"description":"County cricket: Surrey beat Yorkshire to win title, Kent defeat Hampshire – live  The GuardianCounty Championship: Surrey edge closer to title as Yorkshire struggle  BBCOllie Pope stars as Surrey win County Championship title after convincing victory over Yorkshire  Sky SportsSurrey win 2022 County Championship title with one round to spare  The CricketerSurrey win 21st County Championship title after victory over Yorkshire  The MirrorView Full coverage on Google News","content":null,"pubDate":"2022-09-22 15:42:16","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG 2nd T20 Live Score Updates: Duckett and Salt hold fort for England - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9wYWstdnMtZW5nLTJuZC10MjAtbGl2ZS1zY29yZS11cGRhdGVzLTgxNjcwMDcv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs ENG 2nd T20 Live Score Updates: Duckett and Salt hold fort for England  The Indian ExpressPAK vs ENG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- England Tour of Pakistan, 2nd T20I  Cricket AddictorMatch Preview - England vs Pakistan, England in Pakistan 2022, 2nd T20I  ESPNcricinfoAlex Hales felt like he was ”making debut again” for England  The Indian ExpressPAK vs ENG Weather Forecast And Pitch Report of National Stadium, Karachi- England Tour Of Pakistan 2022, 2nd T20I  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-09-22 15:22:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Surrey win County Championship for 21st time","link":"https://www.thestar.com.my/sport/cricket/2022/09/22/cricket-surrey-win-county-championship-for-21st-time","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Surrey won the County Championship for the 21st time and with a game to spare after beating Yorkshire by 10 wickets at The Oval on Thursday. Read full story","content":null,"pubDate":"2022-09-22 15:16:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Azharuddin on stampede for India vs Australia T20I tickets in Hyderabad: &#039;We have done nothing wrong&#039;","link":"https://sportstar.thehindu.com/cricket/azharuddin-on-stampede-for-india-vs-australia-t20i-tickets-in-hyderabad-we-have-done-nothing-wrong/article65923583.ece","keywords":null,"creator":["\n        V. V. Subrahmanyam  \n    "],"video_url":null,"description":"Chaotic scenes unfolded as ticket sales started on Thursday. Telangana sports minister V. Srinivas Goud summoned Hyderabad Cricket Association (HCA) president Mohammad Azharuddin and top officials for an explanation.","content":null,"pubDate":"2022-09-22 15:11:03","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs AUS 2nd T20I: Pitch Report, Weather Update of VCA Stadium, Nagpur","link":"https://www.business-standard.com/article/sports/ind-vs-aus-2nd-t20i-pitch-report-weather-update-of-vca-stadium-nagpur-122092201090_1.html","keywords":null,"creator":null,"video_url":null,"description":"India vs Australia 2nd T20I pitch report: The Vidarbha Cricket Association ground in Jamtha, Nagpur has been known for its high-scoring wickets and the trend shall continue","content":"The caravan of the three-match T20I series between hosts India and visitors Australia moves from North of India to the central. The two teams will fight it out at the VCA Stadium in Nagpur . The capacity crowd at the venue will be waiting for nothing less than an Indian victory as a loss would mean a series loss for Rohit Sharma and co. IND vs AUS 2nd T20I Pitch Report The Vidarbha Cricket Association ground in Jamtha, Nagpur has been known for its high-scoring wickets and the trend shall continue. However, India have played four T20I matches here and won only two. The two matches it lost were one against Sri Lanka way back in 2009 and other against New Zealand in the 2016 T20 World Cup. Against Sri Lanka, India made 186 but were not able to chase down 216. Against New Zealand, they could not chase down even 127. However, in the past two games against England and Bangladesh respectively, Indian players have done well and won defending both a high and a low total. The pitch would definitely be good for batting and India would look to defend once more. Ind vs Aus 2nd T20I Nagpur weather report The weather in Jamtha Nagpur is going to be alarmingly humid and the sub-30 temperatures are only going to add to the heat. It would be very tough for the Aussies to handle the weather because it is definitely going to be worse than Mohali. IND vs AUS 2nd T20I Live Streaming Second India vs Australia T20I will begin at 07:00 pm IST on September 23, 2022. This match can be live streamed on the Hotstar app and can also be watched Live and Exclusive on the Star Sports Network on TV in India. When and where would the IND vs AUS 2nd T20I occur? The second T20I match between India and Australia would begin at 07:00 pm Indian Standard Time on September 23, 2022, at the Vidarbha Cricket Association Ground in Jamtha, Nagpur. Where can people watch India vs Australia 2nd T20I Live and Exclusive? People can watch Rohit Sharma’s India take on Aaron Finch-led Australia Live and Exclusive on Star Sports Network on Television sets. On SmartPhones and online, today’s India vs Australia match can be Live Streamed on the Hotstar app and its website.","pubDate":"2022-09-22 14:58:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220922/thumb-122092201090.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Harmanpreet Kaur, Smriti Mandhana and the art of hitting in women’s cricket","link":"https://indianexpress.com/article/sports/cricket/harmanpreet-kaur-smriti-mandhana-and-the-art-of-hitting-in-womens-cricket-8167183/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-22 14:41:26","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"GUY vs SLK Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for CPL 2022, Match 27","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/guy-vs-slk-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-caribbean-premier-league-2022-match-27?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":"The Guyana Amazon Warriors (GUY) will take on the St Lucia Kings (SLK) in the 27th match of the Caribbean Premier League (CPL) 2022 at the Providence Stadium in Guyana on Friday, September 22. Ahead of the match, here's everything you need to know about the GUY vs SLK Dream11 Fantasy prediction . The Guyana Amazon Warriors have struggled to get going in the CPL 2022. With just two wins from their seven matches, they are at the bottom of the table. The Amazon Warriors have five points to their name and even though they defeated Jamaica Tallawahs by 12 runs in their last game, time seems to be running out for them to make an impact. St Lucia Kings, on the other hand, have done quite well. They have won four of their eight matches and are second in the standings with eight points. The Kings are currently on a three-match winning streak, beating the Trinbago Knight Riders by just one run in their last encounter. The 27th match of Caribbean Premier League 2022 will be played on September 23 at the Providence Stadium in Guyana. The match is set to take place at 4:30 AM IST. The live score & commentary of the game can be followed in the Sportskeeda Live Score section. GUY vs SLK, CPL 2022, Match 27 Date and Time: 23rd September, 2022, 4:30 AM IST Venue: Providence Stadium, Guyana Live Streaming and Broadcast: FanCode Two CPL 2022 matches have already been held at the Providence Stadium, which offers a sporting track. Both sides would like to bat first upon winning the toss, with the chasing teams losing the first two games here. Last 5 matches (CPL 2022) Matches won by teams batting first: 2 Matches won by teams bowling first: 0 Average first-innings score: 167 Average second-innings score: 143 Guyana Amazon Warriors: W-L-L-W-L St Lucia Kings: W-W-W-L-L Guyana Amazon Warriors injury/team news No major injury updates. Guyana Amazon Warriors Probable Playing 11 Shai Hope, Chandrapaul Hemraj, Rahmanullah Gurbaz (WK), Shimron Hetmyer (C), Shakib Al Hasan, Romario Shepherd, Odean Smith, Keemo Paul, Junior Sinclair, Imran Tahir, and Gudakesh Motie. St Lucia Kings injury/team news No major injury updates. St Lucia Kings Probable Playing 11 Faf du Plessis (C), Johnson Charles, Niroshan Dickwella (WK), Adam Hose, Roston Chase, David Wiese, Roshon Primus, Alzarri Joseph, Matthew Forde, Kesrick Williams, and Larry Edward. Johnson Charles is the best wicketkeeper choice for your GUY vs SLK Dream11 fantasy team. He has smashed 342 runs in eight matches at an average of 48.85 and is the leading run-scorer in the tournament so far. Faf Du Plessis has been a highly impactful player. His strike rate of 167.85 is the highest in the top 10 list of scorers, with the former South African captain also batting at an average of over 31. David Wiese could prove to be a dynamic and effective all-round option for your Dream11 fantasy team. He has scored 114 runs at an average of 38 and a strike rate of over 148. Wiese has also claimed nine wickets at a wonderful economy rate of 6.04. Imran Tahir has done well with the ball, having scalped seven wickets in six games at an average of 22.14 and a economy rate of 6.73. Johnson Charles has been consistent with the bat and has an average of 48.85. He has scored a half-century in every other game so far and has also been dependable behind the stumps. He could prove to be an influential captaincy pick for your GUY vs SLK Dream11 fantasy team. Alzarri Joseph is the leading wicket-taker in the competition with 15 wickets in just eight matches at a splendid average of 14.60. He also boasts a great economy rate of 6.84. Players Stats Dream11 Fantasy Points Alzarri Joseph 48 runs and 15 wickets 573 points Johnson Charles 342 runs 508 points David Wiese 114 runs and 9 wickets 485 points Faf Du Plessis 188 runs 314 points Odean Smith 80 runs and 6 wickets 301 points Johnson Charles and Alzarri Joseph are the leaders in their respective categories in CPL 2022 and are an extremely safe captaincy pairing for your GUY vs SLK Dream11 fantasy team. Wicketkeeper: Johnson Charles (c) Batters: Faf Du Plessis, Chandrapaul Hemraj, Shimron Hetmyer All-rounders: David Wiese, Odean Smith, Romario Shepherd, Roston Chase Bowlers: Alzarri Joseph (vc), Imran Tahir, Gudakesh Motie Wicketkeeper: Johnson Charles Batters: Faf Du Plessis (vc), Chandrapaul Hemraj, Shimron Hetmyer All-rounders: David Wiese (c), Odean Smith, Romario Shepherd, Roshon Primus Bowlers: Alzarri Joseph, Imran Tahir, Gudakesh Motie Q. 0 votes so far","pubDate":"2022-09-22 14:31:41","image_url":"https://static.sportskeeda.com/editor/2022/09/dccb1-16638497008348-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"VCT vs NSW Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats, Pitch Report for Australia Domestic One-Day Cup, Match 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/vct-vs-nsw-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-australia-domestic-one-day-cup-match-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-22 14:31:41","image_url":"https://static.sportskeeda.com/editor/2022/09/674c7-16638475831099-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL stint helped me stay calm: Tim David","link":"https://sportstar.thehindu.com/cricket/ind-vs-aus-tim-david-ipl-rcb-mi-1st-t20i-australia-beats-india/article65923279.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"The experience of playing in India before and playing a fair bit of T20 cricket recently helped him in staying calm in the run chase in the first T20I, David said.","content":"The experience of playing in Indian conditions during his IPL stint helped him to stay calm under pressure during the opening T20I, said Australia’s Tim David on Thursday. The 26-year-old made his IPL debut for Royal Challengers Bangalore in Sharjah against Chennai Super Kings last year. He was then bought by Mumbai Indians and played eight matches for the franchise this year. “I think having had the experience of playing in India before and playing a fair bit of T20 cricket recently, I felt calm the other night because I knew that we’re in a good position to be able to chase those runs,” said David during a virtual press conference. “And the way the pitch was playing so I think to get over the line, you know, that still has to happen. It doesn’t just happen straight away. And that was some brilliant performances from our batsman, the chase that score down.” David scored a 14-ball 18 on debut and added 62 with Matthew Wade (45) to guide Australia to a four-wicket win in the first T20 on Tuesday. “Having some good experience playing in India, I think finishing off games and understanding how it can go and how the pitches can play or when it kind of lights up in front of you, so you know, there can be an advantage batting second in Indian conditions. “That was a good experience - that IPL - to draw on to the other night out there in the middle,” added David. He added that the experience of sharing the dressing room with Wade in the Hobart Hurricanes helped him during the chase in Mohali. “I played a fair bit with Maddie (Wade) but I haven’t batted with him that much. So it was nice to have a familiar face out there the other night and I think he did most of the heavy lifting,” he said. “So to be stood the other end and watch him finish the game off was great. And that’s I guess it’s good stuff.” Talking about his role in the Australian team, David said: “I think my role on the team here is to be batting in the middle order. So that means that I’m not going to be facing a lot of balls in matches. “And I’m probably going to try and put the foot down with my batting first or if we’re chasing, trying to finish off the game. So I’ve got to tick off my boxes of trying to play powerful shots, trying to clear the boundary and I think that’s a big part of my training. “So I try and get volume in the nets because, let’s say, in a three-match series here I like face 20 balls ...so I’ve got a lot of my work done in the nets. And be prepared to kind of be on for every ball.” “I think it’s pretty straightforward. It’s very similar to what I’ve been playing T20 cricket over the last year and 18 months so I guess I’m trying to bring my experiences that I’ve had so far and just take the game on and help the team win games.” Asked if he had ever thought that he would be playing the T20 World Cup for Australia, David said: “To be honest, I didn’t give it very much thought. It’s just it’s kind of evolved naturally to be here at this stage. Yeah, I haven’t thought about that too much. “I just look to win a game which is in front of me and don’t put any expectations on that. “I just try and keep the game very simple. I don’t look too far ahead of myself. I’m trying to stay pretty grounded and train harder than that and just improve as much as I can.” Read more stories on Cricket.","pubDate":"2022-09-22 14:29:40","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Sikander Bakht creates chaos in PAK cricket, reveals Rizwan’s stance on Sarfaraz Ahmed ‘won't let him return’","link":"https://www.indiatvnews.com/sports/cricket/sikander-bakht-creates-chaos-in-pak-cricket-reveals-rizwan-s-stance-on-sarfaraz-ahmed-won-t-let-him-return-pak-vs-eng-pak-vs-eng-live-2022-09-22-810621","keywords":null,"creator":null,"video_url":null,"description":"Former Pakistan player Sikander Bakht has created chaos in Pakistan cricket as he tweeted about the friction between Sarfaraz Ahmed and Mohammad Rizwan. According to Bakht, Mohammad Rizwan would never allow Sarfaraz Ahmed to return to the squad as long as he was there. To be exact the words heard by Bakht heard, ‘won't let him (Sarfaraz) return’.","content":null,"pubDate":"2022-09-22 14:25:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Ban on the art of reverse swing”: Deep Dasgupta wants ICC to reconsider Saliva Ban in cricket","link":"https://thesportsrush.com/cricket-news-ban-on-the-art-of-reverse-swing-deep-dasgupta-wants-icc-to-reconsider-saliva-ban-in-cricket/","keywords":["Cricket","Deep Dasgupta","ICC"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Saliva Ban in cricket: Ban on applying saliva on a cricket ball will be among a few upcoming rule changes in the sport. In spite of being a sport liked by traditionalists, cricket has continued to evolve over the years. It is this perpetual evolution of the game which has made it more relevant and… The post “Ban on the art of reverse swing”: Deep Dasgupta wants ICC to reconsider Saliva Ban in cricket appeared first on The SportsRush.","content":"Saliva Ban in cricket: Ban on applying saliva on a cricket ball will be among a few upcoming rule changes in the sport. In spite of being a sport liked by traditionalists, cricket has continued to evolve over the years. It is this perpetual evolution of the game which has made it more relevant and exciting especially among modern-day youth. This evolution wouldn’t have been possible without multiple rule changes made to the sport. Notwithstanding the complexity of a sport like cricket, lawmakers have been able to tinker with the laws to adjust with changing times and situations. A primary reason behind some of the rules belonging to cricket being tampered with time and again is to ensure that both rules and cutting edge technology go hand in hand. ALSO READ: What is the new Over Rate rule for ODI Cricket? Even ICC’s (International Cricket Council) latest chief executives’ committee meeting had space for not one but several rule changes. The most stark out of all the latest rule changes is ICC completely banning the use of saliva on a cricket ball. Deep Dasgupta wants ICC to reconsider Saliva Ban in cricket Former India wicket-keeper batter Deep Dasgupta has spoken against ICC totally banning the use of saliva. Dasgupta, 45, took to social media platform Twitter to post a video praising all other rule changes but expressed his unwillingness to accept that saliva will no longer be allowed to shine a cricket ball. Hoping that the global body would perhaps reconsider its decision, Dasgupta didn’t shy away from perceiving saliva ban as a ban on the “art of reverse swing”. Readers must note that former Australia opening batter Matthew Hayden had also expressed disapproval around saliva ban in the past. “One rule which I don’t really accept and I think it’s not good for cricket is the permanent ban on saliva,” Dasgupta said in a video posted on his Twitter handle. “I think that does help the non-subcontinental countries a little more. But for subcontinental countries, it does not make sense. “And more so, I think it’s not just a ban on saliva but a ban on the art of reverse swing because we’ve haven’t seen the ball reversing at all [post the ban on saliva] or maybe very very little. Not enough [reverse swing] to make a difference in a game of cricket.” Saliva, a vital component for shining the ball, was used for the same purpose since time immemorial in cricket. It was only after the outbreak of COVID-19 pandemic that ICC had introduced a 5-run penalty for using saliva to shine a cricket ball. The fear of playing in a global pandemic was such that umpires used to wipe a cricket ball if anyone was found using saliva on it. While bowlers had hoped for ICC to introduce shining wax, bowler-friendly wickets or other alternatives to shine a cricket ball, only sweat was allowed as a last option. On the other hand, Australia batter Marnus Labuschagne and India spinner Ravichandran Ashwin had both urged cricketers to adapt to saliva ban amid COVID-19 scare. The post “Ban on the art of reverse swing”: Deep Dasgupta wants ICC to reconsider Saliva Ban in cricket appeared first on The SportsRush.","pubDate":"2022-09-22 14:06:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}