{"newsArray":[{"title":"Cricket-Former coach Langer slams Cricket Australia politics","link":"https://www.thestar.com.my/sport/cricket/2022/05/27/cricket-former-coach-langer-slams-cricket-australia-politics","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Justin Langer has criticised the politics at Cricket Australia (CA), four months after he resigned from his role as national team coach. Read full story","content":"(Reuters) - Justin Langer has criticised the politics at Cricket Australia (CA), four months after he resigned from his role as national team coach. Langer led Australia to their first Twenty20 World Cup title last year before overseeing a 4-0 demolition of England in the Ashes but he was offered only a short-term extension this year. Leading former Australia players, including Langer's team mates Ricky Ponting, Adam Gilchrist and Matthew Hayden, had expressed sadness at his treatment. Langer said that after he quit he recalled a conversation with CA's interim chairman Richard Freudenstein, who was not pleased with the media coverage favouring the former batsman. \"The first thing he said to me was 'It must make you feel so good that all your mates are supporting you in the media,'\" Langer said at a Chamber of Commerce event in Perth, as reported by Australian media. \"I said, 'Yeah, it is, acting chairman. But with all due respect, those mates are also the all-time greats of Australian cricket. They are the fabric of Australian cricket, they are Australian cricket. \"So yeah, I'm glad my mates are looking after me. Imagine if you had have'. \"Ironically, the last six months of my coaching career were the most enjoyable period of 12 years of coaching. Not only did we win everything, but I had energy, I had focus and I was happy -- besides the bullshit politics.\" CA was not immediately available for comment. Langer's resignation came a day after his England counterpart Chris Silverwood left his job and the Australian was linked with the vacant role which eventually went to New Zealander Brendon McCullum. \"I've never spoken to English cricket,\" Langer said. \"The thought of coaching England... mate!\" (Reporting by Rohith Nair in Bengaluru, editing by Ed Osmond)","pubDate":"2022-05-26 19:52:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/05/27/1600354.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Former coach Langer slams Cricket Australia politics","link":"https://www.channelnewsasia.com/sport/former-coach-langer-slams-cricket-australia-politics-2710441","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Justin Langer has criticised the politics at Cricket Australia (CA), four months after he resigned from his role as national team coach. Langer led Australia to their first Twenty20 World Cup title last year before overseeing a 4-0 demolition of England in the Ashes but he was offered only a short-term extension this year. Leading former Australia players, including Langer's team mates Ricky Ponting, Adam Gilchrist and Matthew Hayden, had expressed sadness at his treatment. Langer said that after he quit he recalled a conversation with CA's interim chairman Richard Freudenstein, who was not pleased with the media coverage favouring the former batsman. \"The first thing he said to me was 'It must make you feel so good that all your mates are supporting you in the media,'\" Langer said at a Chamber of Commerce event in Perth, as reported by Australian media. \"I said, 'Yeah, it is, acting chairman. But with all due respect, those mates are also the all-time greats of Australian cricket. They are the fabric of Australian cricket, they are Australian cricket. \"So yeah, I'm glad my mates are looking after me. Imagine if you had have'. \"Ironically, the last six months of my coaching career were the most enjoyable period of 12 years of coaching. Not only did we win everything, but I had energy, I had focus and I was happy - besides the bullshit politics.\" CA was not immediately available for comment. Langer's resignation came a day after his England counterpart Chris Silverwood left his job and the Australian was linked with the vacant role which eventually went to New Zealander Brendon McCullum. \"I've never spoken to English cricket,\" Langer said. \"The thought of coaching England... mate!\"","pubDate":"2022-05-26 19:45:00","image_url":"https://onecms-res.cloudinary.com/image/upload/s--Tl5WH7oc--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2022-05-26t194501z_1_lynxnpei4p0wr_rtroptp_3_cricket-t20-eng-aus.jpg?itok=H6JPCe9H","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Patrick Vieira is probably top of the manager pound-for-pound rankings and one pitch invaders probably want to avoid","link":"https://www.thesun.ie/sport/football/8858754/patrick-vieira-gerrard-mbappe-guardiola/","keywords":["Football","Premier League"],"creator":["Kealan Hughes"],"video_url":null,"description":"AFTER the airline passenger who picked a fight with Mike Tyson, the stupidest person on the planet has to be the Everton fan who goaded Patrick Vieira — and was booted to the ground as a consequence. The Crystal Palace boss might have put on a bit of a timber since his days as the […]","content":"AFTER the airline passenger who picked a fight with Mike Tyson, the stupidest person on the planet has to be the Everton fan who goaded Patrick Vieira — and was booted to the ground as a consequence. The Crystal Palace boss might have put on a bit of a timber since his days as the fiercest enforcer in football but he’s still not someone you would choose to get in an argument with. The Premier League has its fair share of tough managers ReutersYou would not want to mess with Patrick Vieira (right) or Steven Gerrard[/caption] PA:Press AssociationJurgen Klopp and Ralph Hasenhuttl could probably handle themselves in a scrap[/caption] So for the benefit of all you pitch invaders, here’s a rough guide to which Premier League managers it’s probably best to avoid… PATRICK VIEIRA (Crystal Palace). Speak softly and carry a big kick remains the philosophy of L’Incredible Hulk, who takes no merde from anyone.STEVEN GERRARD (Aston Villa). Never backed down as a player and you just know he can still more than look after himself.RALPH HASENHUTTL (Southampton). The volatile Saints boss is a real unit and would probably crush the life out of you, if you crossed him. Read More in Football STAR CAST Real Madrid stars copy iconic Reservoir Dogs suits as they arrive in Paris VEN DIAGRAM How Venezia rose from bankruptcy to the ‘world’s most fashionable’ club ANTONIO CONTE (Tottenham). Maybe it’s an Italian stereotype but there’s a vibe of The Godfather’s Sonny Corleone about a man who exudes brooding menace.JURGEN KLOPP (Liverpool). The German goofball might want us to regard him as a good laugh but there is definitely a psychotic streak lurking beneath those manic touchline antics.MIKE JACKSON (Burnley). Anyone who spent his entire playing career as a lower-league defender must be hard. Harder than Sean Dyche? There’s only one way to find out . . .DAVID MOYES (West Ham). You can take the Moyes out of Glasgow but you can’t take Glasgow out of the man. His death stare alone is enough to turn you to stone. Most read in Football Transfer news live Neymar wants 'to stay' despite PSG being 'ready to sell' him MAN UTD NEWS De Jong transfer LATEST, Carragher urges Ten Hag to AXE Ronaldo KEANE TO HELP Roy Keane's incredible gesture to sick child after Martin McGuinness request gloves are off Man Utd keeper Lee Grant retires aged 39 with brilliant 332-word statement KERR FURY Virgin Media viewers all saying same thing after Brian Kerr rant about Mourinho ED ACHE Robbie Keane floored Edgar Davids with ONE PUNCH at Spurs, reveals Jamie O'Hara FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS MIKEL ARTETA (Arsenal). Like Monty Python’s Black Knight, he’s one of those blokes who would never concede defeat, even if his arm was hanging off.ERIK TEN HAG (Man Utd). Bit of an unknown quantity at the moment but he has to be a step up on disappointed geography teacher Ralf Rangnick.PEP GUARDIOLA (Man City). Fighting would be far too ugly for the king of football aesthetics, who would prefer to sort you out with mild sarcasm.DEAN SMITH (Norwich). Maybe it’s the Black Country accent which gives him a bit of street cred but he would willingly settle for mid-table after the season he’s had.FRANK LAMPARD (Everton). Too affable to fall out with anyone enough for it to get physical. And has Duncan Ferguson watching his back.BRENDAN RODGERS (Leicester). Too much work on his face for him to risk getting into a scrap. “Not the veneers!”THOMAS TUCHEL (Chelsea). Bigger than you realise but he’s like an overgrown puppy, or one of those inflatable matchstick men you see dancing over used-car lots.EDDIE HOWE (Newcastle). They say it’s the quiet ones you need to be wary of but nice-guy Eddie is no Clark Kent.GRAHAM POTTER (Brighton). Too meticulous in his planning to allow himself to be distracted by a touchline tear-up.BRUNO LAGE (Wolves). Just like his team, he’s dipped so far beneath the radar that no one would notice if he was involved in a confrontation.JESSE MARSCH (Leeds). The man who loves to quote Gandhi to his players is clearly a firm believer in passive resistance.THOMAS FRANK (Brentford). The closest thing in football to a hippy, it’s all peace and love for the genial Dane.ROY HODGSON (Watford). He’s a book lover, not a fighter. Plus he’s 74 years old. Gunderful Ilkay Gundogan’s late winner against Aston Villa on Sunday was Manchester City’s 99th Premier League goal of the season and their 150th in all competitions. They also scored 29 times in the Champions League, 16 in the FA Cup and six in the Carabao Cup. Gundogan’s Villa killer meant he became the seventh City player to get into double figures for the season, joining Riyad Mahrez, Kevin De Bruyne, Raheem Sterling, Phil Foden, Gabriel Jesus and Bernardo Silva. Imagine what they’ll be like when Erling Haaland rocks up next season. And yet some people still say they’re boring. Ilkay Gundogan became the seventh Manchester City player to hit double figures for the season on SundayGetty Liver fool Covering Arsenal v Everton on Sunday, I was struck by news of Manchester City’s third goal being ­celebrated louder by the Emirates crowd than the Gunners’ fifth. The prospect of Liverpool winning the title, and possibly the Quad, was seemingly too much to stomach for most fans. I’m told it was a similar situation at just about every other ground except Anfield. Pep Guardiola was talking nonsense when he said the whole country supports Liverpool. You love them or can’t stand them. They even call themselves ‘The Unbearables’. Which is probably why most of us will be cheering for Real Madrid tomorrow. ReutersPep Guardiola claimed the whole country was behind Liverpool[/caption] Deal with it, Real With Kylian Mbappe agreeing a new deal at Paris Saint-Germain and Erling Haaland signing for Manchester City, there’s a new world order in football. And that’s going to take some getting used to for Real Madrid, Barcelona and Manchester United, who for years have been accustomed to just clicking their fingers at any player they wanted. But it’s not only the so-called three biggest clubs in the world who are struggling to come to terms with the rise of the state-owned super teams. For president of the Spanish League, Javier Tebas, had a right old hissy fit when Mbappe confirmed he had rejected a move to Madrid to sign a new PSG deal worth £1million a week. Furious Tebas branded PSG “an insult to football” and even made an official complaint to Uefa about the terms of the contract. But Uefa president Aleksander Ceferin was never going to turn on his new bezzies at PSG and pointed out that Real had been offering a pretty similar deal to Mbappe. Which makes LaLiga’s tantrum all the more amusing. APLaLiga complained about the deal that took Kylian Mbappe to PSG[/caption] Energy vampire Naomi Osaka could give Wimbledon a miss as playing at a tournament without ranking points is “affecting her mentality”. As the All England Club contemplates the absence of the world No 38, I’m sure they’re thinking, “Oh well, never mind”. The Mega AgencyNaomi Osaka is considering skipping Wimbledon[/caption] Read More in Sport 'LORD OF THE RING' Fury suited and booted as he enjoys retirement posing next to luxury car BERNIE ARREST Bernie Ecclestone arrested for carrying gun while boarding plane in Brazil No Eton mess up Henry Blofeld the cricket bore and pink trouser stereotype, has threatened to boycott the MCC unless they reverse their decision to axe the annual Eton v Harrow match. And that, ladies and gentlemen, is what is known as a win-win situation. PA:Press AssociationHenry Blofeld has threatened to boycott the MCC[/caption]","pubDate":"2022-05-26 19:28:05","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Wriddhiman Saha turns down request from Cricket Association of Bengal to play Ranji Trophy knockouts","link":"https://www.sportskeeda.com/cricket/news-wriddhiman-saha-turns-request-cricket-association-bengal-play-ranji-trophy-knockouts?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":null,"pubDate":"2022-05-26 19:20:42","image_url":"https://static.sportskeeda.com/editor/2022/05/4a00c-16535854851948-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Saha not willing to play for Bengal in Ranji knockouts; communicates decision to CAB","link":"https://www.indiatvnews.com/sports/cricket/gujarat-titans-opener-saha-not-willing-to-play-for-bengal-in-ranji-knockouts-communicates-decision-to-cab-2022-05-26-779671","keywords":null,"creator":null,"video_url":null,"description":"Gujarat Titans opener and former Indian test wicketkeeper Wriddhiman Saha officialy communicated to the Cricket Association of Bengal that he is \"not willing\" to play for the state team in the upcoming Ranji Trophy knockouts.","content":"Gujarat Titans opener and former Indian test wicketkeeper officialy communicated to the Cricket Association of Bengal that he is \"not willing\" to play for the state team in the upcoming Ranji Trophy knockouts. This effectively brings an end to Saha's glorious career with Bengal from where he made his Ranji debut in November 2007 and went on to play 122 first-class and 102 List A matches. \"The Cricket Association of Bengal wanted Wriddhiman Saha to play for Bengal at this crucial juncture especially when Bengal would be fighting in the knockout stage in a bid to win the Ranji Trophy after becoming the top-ranked team in the country at the end of the Group Stage,\" CAB president Avishek Dalmiya said in a statement. \"I had expressed this to Wriddhiman and had requested him to reconsider his decision. However, Wriddhiman has now communicated to us that he is not willing to play the Ranji Knockouts.\" The 37-year-old, who has played 122 first-class matches, has also left their official team WhatsApp group, making it clear that he has moved on. A CAB official said Saha is yet to seek a no-objection certificate (NOC) but the association would give him once he asks for it. \"We tried our best to convince him, even through his childhood coach (Jayanta Bhowmick), but he has made up his mind not to play for Bengal again. The association will give him NOC as and when he asks for it,\" the official told PTI. Saha first had pulled out of the Ranji Trophy group stage citing 'personal reasons' after he was excluded from the Indian Test team for the two-match home series against Sri Lanka in February. CAB assistant secretary Debabrata Das then made unsavoury statements against Saha in the media, questioning his commitment to infuriate the veteran wicketkeeper-batter. Following his sublime form in the ongoing for his franchise Gujarat Titans, Saha was picked for the Ranji quarterfinal that further annoyed him as \"he was not consulted before being selected\". Saha reportedly sought an apology from Debabrata Das but after it was not materialised he made it clear he is not going to play for Bengal again. \"There are many things in between. But now we are clear that he's not playing so that we can prepare accordingly for the big match,\" the official said. Bengal will play their Ranji Trophy quarterfinal against Jharkhand in Bangalore from June 6. (Inputs PTI)","pubDate":"2022-05-26 17:51:33","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Tim Muda Kriket Putri Indonesia Uji Coba di Kartini Cup VII","link":"https://sport.detik.com/sport-lain/d-6097039/tim-muda-kriket-putri-indonesia-uji-coba-di-kartini-cup-vii","keywords":null,"creator":null,"video_url":null,"description":"Pengurus Pusat Persatuan Cricket Indonesia (PP PCI) terus meningkatkan kualitas Tim Nasional (Timnas) Cricket Putri Indonesia.","content":"Tim Muda Kriket Putri Indonesia Uji Coba di Kartini Cup VII Randy Prasatya - Sport Jumat, 27 Mei 2022 00:30 WIB 0 komentar BAGIKAN URL telah disalin Foto: dok. PCI Jakarta - Pengurus Pusat Persatuan Kriket Indonesia (PP PCI) terus meningkatkan kualitas Tim Nasional (Timnas) kriket Putri Indonesia. Dalam menghadapi babak kualifikasi Kejuaraan Dunia kriket U 19 Putri di Bali, Juli mendatang, Tim Nasional (Timnas) kriket Putri diterjunkan pada Kejuaraan kriket Kartini Cup Ke-7/2022 yang digelar di Lapangan kriket Udayana, Jimbaran, Bali, 18-22 Mei lalu. Pelaksana Ketua Harian PP PCI, Abhiram Singh Yadav di Jakarta, Rabu (25/5/2022), kejuaraan yang diikuti Tim Denpasar, Seminyak Barong, Badung, dan Makassar ini menjadi ajang uji coba Timnas U19 untuk persiapan menghadapi kualifikasi Kejuaraan Dunia kriket U19 yang akan memperebutkan 1 tiket menuju Piala Dunia Putri U 19 di Afrika Selatan. Dari Kartini Cup 2022 ini, Abhiram Sing Yadav berharap, Timnas U 19 Putri banyak mendapatkan banyak belajar dan bisa melihat sejauh mana perkembangan prestasinya. Baca juga: Atlet Kriket Bali Diharapkan Bisa Terus Berkembang \"Semoga Timnas U 19 bisa belajar banyak untuk mempersiapkan diri lebih baik lagi saat tampil di kualifikasi Piala Dunia U 19. PP PCI berharap mereka bisa menunjukkan permainan terbaik,\" harapnya. Kejuaraan ini menggunakan sistem kompetisi penuh, setiap tim akan melawan tim lainnya untuk mencari tim unggulan tahun ini. Laga terakhir terasa atmosfer final ketika Seminyak Barong melawan Tim Indonesia U 19. Tim Barong diperkuat oleh beberapa pemain Timnas senior seperti Wayan Sariani, Fitria Rada Rani (Yolla) dan Putri Suwandewi melawan juniornya. Pada inning pertama, Timnas U 19 membuat semua pemain senior Barong keluar dan menahan mereka 80 run untuk dikejar. Bowling yang sangat impresif dari Wesika yang mendapatkan 4 wicket dan Yolanda yang menahan senior mereka dengan 2 maiden dan hanya 4 run untuk lawan dalam 4 over. Di awal Inning kedua, tim batting Timnas U 19 tidak dapat membendung serangan balasan dari seniornya. Dalam 10 over, 8 wicket terus berjatuhan walau 1 pemain dapat kembali bermain setelah retired hurt dan memberikan perlawanan pada paruh kedua Timnas U 19 mencetak 40 run mengejar 80 run. Pada over ke 16, pertandingan berakhir dengan skor 70 untuk Timnas U 19, yang kurang 11 run dari lawannya karena semua batter keluar. Kartini Cup Ke-7 dijuarai oleh tim Seminyak Barong diikuti dengan Tim Indonesia U 19 sebagai runner up. Sedangkan Tim Denpasar menempati peringkat ketiga dan Tim Badung menempati peringkat keempat. Selain menjadi ajang pemanasan Timnas U 19, Kartini Cup 2022 ini juga menjadi uji coba Pekan Olahraga Daerah (PORDA) Provinsi Bali yang akan diselenggarakan akhir tahun. Ketua Umum KONI Bali, Oka Darmawan mengucapkan terimakasih kepada PP PCI yang sudah menyelenggarakan event ini dengan sukses. \"Terima kasih kepada PP PCI yang terus membina atletnya lewat event-event berkelas seperti ini. Dan, Porprov akan sangat terbantu persiapannya karena event ini,\" katanya. Simak Video \" AS Roma Juara Conference League, Mourinho Ukir Catatan Manis \" [Gambas:Video 20detik] (ran/pur) kriket kriket indonesia 0 komentar BAGIKAN URL telah disalin","pubDate":"2022-05-26 17:30:07","image_url":null,"source_id":"detik","country":["indonesia"],"category":["sports"],"language":"indonesian"},{"title":"RR vs RCB: Everything you need to know | IPL 2022 | 12th Man TV - Royal Challengers Bangalore","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9WUp0bk9pczZLcWvSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"RR vs RCB: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreRR vs RCB Match Prediction- Who Will Win Today's IPL Match Between Rajasthan Royals vs Royal Challengers Bangalore, IPL 2022, Qualifier 2  Cricket AddictorIPL Qualifier 2: Bangalore peak at the right time ahead of a Royal contest  Gulf NewsRCB wins IPL 2022 Eliminator vs LSG | Game Day  Royal Challengers BangaloreLSG vs RCB: “Harshal Patel Was Most Impressive, Hats Off To Him” - Sanjay Manjrekar Picks Pacer As RCB's Standout Performer With Ball  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-26 16:38:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"INDW vs SLW: जून में श्रीलंका के दौरे पर जाएगी भारतीय महिला क्रिकेट टीम, SLC ने की पुष्टि","link":"https://www.abplive.com/sports/ipl/indw-vs-slw-indian-women-s-cricket-team-to-tour-sri-lanka-in-june-confirms-slc-2132490","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Indian women's cricket team tour of Sri Lanka:</strong> भारतीय महिला टीम जून में तीन वनडे और तीन टी20 मैचों के लिए श्रीलंका&nbsp; के दौरे पर जाएगी. इस बात की जानकारी श्रीलंका क्रिकेट (एसएलसी) की कार्यकारी समिति ने दी है. इस दौरान उन्होंने कहा कि वनडे हाल ही में शुरू हुई आईसीसी महिला चैम्पियनशिप के तहत खेला जाएगा, जो 2025 महिला क्रिकेट विश्व कप के लिए क्वालीफिकेशन का हिस्सा होगा.</p> <p style=\"text-align: justify;\"><strong>SLC ने लिए कई बड़े फैसले&nbsp;</strong></p> <p style=\"text-align: justify;\">भारत की महिलाओं के श्रीलंका दौरे को मंजूरी देना एसएलसी कार्यकारी समिति द्वारा लिए गए सात फैसलों में से एक है, जहां भारतीय क्रिकेटर पुणे में चल रहे महिला टी20 चैलेंज में भाग ले रही हैं, वहीं श्रीलंका वर्तमान में तीन टी20 और इतने ही वनडे के लिए पाकिस्तान का दौरा कर रहा है, जो सभी कराची में खेले जाने हैं.</p> <p style=\"text-align: justify;\"><strong>2018 में आखिरी बार गई थी टीम इंडिया</strong></p> <p style=\"text-align: justify;\">आखिरी बार भारत ने 2018 में द्वीप राष्ट्र का दौरा किया था, जहां भारत ने वनडे सीरीज 2-1 और टी20 सीरीज 4-0 से जीती थी. श्रीलंका में आर्थिक संकट के बावजूद अगर यात्रा होती है, तो न्यूजीलैंड में आईसीसी महिला क्रिकेट विश्व कप 2022 के सेमीफाइनल में पहुंचने में नाकाम रहने के बाद यह भारत की पहली द्विपक्षीय सीरीज होगी.</p> <p style=\"text-align: justify;\">श्रीलंका सीरीज के बाद भारत को जुलाई-अगस्त में बर्मिघम में होने वाले राष्ट्रमंडल गेम्स में ऑस्ट्रेलिया, बारबाडोस और पाकिस्तान के साथ ग्रुप में रखा जाना है. इसके बाद 10 से 24 सितंबर तक इंग्लैंड के साथ तीन वनडे और इतने ही टी20 मैच खेले जाएंगे.</p> <p style=\"text-align: justify;\"><strong>(इनपुट: एजेंसी)</strong></p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें..</strong></p> <p style=\"text-align: justify;\"><strong><a title=\"GT vs RR: इस शख्स ने की थी संजू सैमसन के 47 रन बनाने की सटीक भविष्यवाणी, अब कोहली के बारे में भी बताया \" href=\"https://www.abplive.com/sports/ipl/prediction-about-sanju-samson-scoring-47-goes-exactly-right-in-gt-vs-rr-match-ipl-2022-2131243\" target=\"\">GT vs RR: इस शख्स ने की थी संजू सैमसन के 47 रन बनाने की सटीक भविष्यवाणी, अब कोहली के बारे में भी बताया</a></strong></p> <p style=\"text-align: justify;\"><strong><a title=\"GT vs RR: शॉट पड़ते ही सिर पीटने लग गए थे मैकॉय, बाउंड्री पर बटलर ने बदल दी पूरी कहानी \" href=\"https://www.abplive.com/sports/ipl/obed-mccoy-reaction-after-dismissing-matthew-wade-goes-viral-on-social-media-2131320\" target=\"\">GT vs RR: शॉट पड़ते ही सिर पीटने लग गए थे मैकॉय, बाउंड्री पर बटलर ने बदल दी पूरी कहानी</a></strong></p>","content":null,"pubDate":"2022-05-26 16:37:37","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Ahmedabad Cricket Stadium pitch report RR vs RCB today match: Narendra Modi Stadium pitch report T20 IPL 2022 Qualifier 2","link":"https://thesportsrush.com/cricket-news-ahmedabad-cricket-stadium-pitch-report-rr-vs-rcb-today-match-narendra-modi-stadium-pitch-report-t20-ipl-2022-qualifier-2/","keywords":["Cricket","IPL 2022","Rajasthan Royals","RCB","Indian Premier League","IPL","Narendra Modi stadium","rajasthan royals","Royal Challengers Bangalore","RR"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ahmedabad Cricket Stadium pitch report RR vs RCB today match: The venue has hosted a total of 17 Indian Premier League matches till date. The ‘Qualifier 2’ fixture of the ongoing 15th season of the Indian Premier League (IPL) will be played between the Rajasthan Royals (RR) and the Royal Challengers Bangalore (RCB) at the… The post Ahmedabad Cricket Stadium pitch report RR vs RCB today match: Narendra Modi Stadium pitch report T20 IPL 2022 Qualifier 2 appeared first on The SportsRush.","content":"Ahmedabad Cricket Stadium pitch report RR vs RCB today match: The venue has hosted a total of 17 Indian Premier League matches till date. The ‘Qualifier 2’ fixture of the ongoing 15th season of the Indian Premier League (IPL) will be played between the Rajasthan Royals (RR) and the Royal Challengers Bangalore (RCB) at the Narendra Modi Stadium in Ahmedabad. Having lost the ‘Qualifier 1’ against the Gujarat Titans (GT), the RR would get another shot to make it through to the final today. Buoyed by the return back of form of their highest run-getter of the season, Jos Buttler, RR would take the field feeling high on confidence with the bat in hand. With their spinners having gone wicket less in the previous match, skipper Sanju Samson would want them to bring back their ‘A’ game, having been the best in the league in this particular department amongst all the teams. The RCB, on the other hand, have had both the winning momentum and fortune by their side in the past few days. The Faf du Plessis-led side would perhaps feel there wouldn’t be a better opportunity to go all the way and script history by lifting their maiden IPL title. However, they need to go past two challenging hurdles, against the top-2 sides this season to live the elusive dream. All eyes on Q2 👀🔥 #RoyalsFamily | #HallaBol | #TATAIPL2022 pic.twitter.com/XVl7kTSTTG — Rajasthan Royals (@rajasthanroyals) May 26, 2022 ALSO READ : Narendra Modi stadium T20 records The average score in the IPL at this venue has been a touch over 160. Hence, one may presume the track to assist the bowlers and the batters during the different phases of the match. Having said that, the pitch behavior would boil down to the soil characteristic underneath its surface. As per ‘Cricbuzz’, the venue has a total of six red soil pitches and five black soil pitches. A red soil pitch with a cover of grass is likely to assist the pacers especially with the hard, new ball, as the surface will offer that extra bounce and carry. However, as has generally been the case with T20 matches, expect the curator to prepare a batter friendly track with the pitch having an even bounce.","pubDate":"2022-05-26 15:37:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Saha unwilling to play Ranji Trophy knockouts","link":"https://sportstar.thehindu.com/cricket/domestic/wriddhiman-saha-unwilling-to-play-ranji-trophy-knockouts-cricket-association-of-bengal/article38498239.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Wriddhiman Saha has informed the Cricket Association of Bengal that he is not willing to play the Ranji Trophy knockouts, beginning on June 6.","content":"Wriddhiman Saha has informed the Cricket Association of Bengal (CAB) that he is not willing to play the Ranji Trophy knockouts, beginning on June 6. \"The Cricket Association of Bengal wanted Wriddhiman Saha to play for Bengal at this crucial juncture especially when Bengal would be fighting in the knockout stage in a bid to win the Ranji Trophy after becoming the top ranked team in the country at the end of the Group Stage,\" CAB president Avishek Dalmiya said on Thursday. \"I had expressed this to Wriddhiman and had requested him to reconsider his decision. However, Wriddhiman has now communicated to us that he is not willing to play the Ranji Knockouts.\" READ | Saha's participation in doubt despite being named in Bengal's Ranji squad The statement comes a day after Saha reportedly exited the Bengal team's WhatsApp group. Last week, as reported by Sportstar , Saha, who is currently featuring in the Indian Premier League (IPL) for Gujarat Titans, had a long conversation with Dalmiya, where he indicated that he may no longer play for Bengal. He was upset with comments by a senior CAB official, who had raised questions over Saha’s commitment after he decided to skip the group stage of the Ranji Trophy due to personal reasons. Saha, however, was not available for comments on his future plans.","pubDate":"2022-05-26 15:20:54","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Ahmedabad Stadium highest score T20: Motera Stadium average score IPL","link":"https://thesportsrush.com/cricket-news-ahmedabad-stadium-highest-score-t20-motera-stadium-average-score-ipl/","keywords":["Cricket","IPL 2022","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ahmedabad Stadium highest score T20: Narendra Modi Stadium has witnessed only one 200+ innings total in the Indian Premier League. Ahmedabad is in the spotlight after the pinnacle of the ongoing 15th season of the Indian Premier League will be played here from tomorrow. Practically a second semi-final, IPL 2022 Qualifier 2 will be played… The post Ahmedabad Stadium highest score T20: Motera Stadium average score IPL appeared first on The SportsRush.","content":"Ahmedabad Stadium highest score T20: Narendra Modi Stadium has witnessed only one 200+ innings total in the Indian Premier League. Ahmedabad is in the spotlight after the pinnacle of the ongoing 15th season of the Indian Premier League will be played here from tomorrow. Practically a second semi-final, IPL 2022 Qualifier 2 will be played between Rajasthan Royals and Royal Challengers Bangalore. In what will be the first match for Gujarat Titans at their home ground in the Narendra Modi Stadium, they will face the winner of Qualifier 2 in IPL 2022 final on Sunday. Considering the intensity of cricket played in both IPL 2022 playoffs thus far, fans would be hoping for Ahmedabad to produce playoffs matches similar to Kolkata. Chalo chalein અમદાવાદ #RoyalsFamily | #HallaBol | #TATAIPL2022 pic.twitter.com/gHwuZllBhq — Rajasthan Royals (@rajasthanroyals) May 25, 2022 As far as the average innings score at the Narendra Modi Stadium is concerned, it has been 158.2 in a total of 47 T20s over the years. Speaking particularly of the 17 IPL matches played here across four seasons in the past, average innings total rises by a small margin to 161.2. Ahmedabad Stadium highest score T20 Apart from IPL and T20Is, Ahmedabad has also hosted a lot of Syed Mushtaq Ali Trophy matches. Hence, domestic Indian state teams also make their presence feel in the record books with respect to this venue. Score Team Opposition Year 224/2 India England 2021 215/4 Maharashtra Mumbai 2013 201/6 Rajasthan Royals Delhi Capitals 2014 198/9 Mumbai Maharashtra 2013 194/3 Baroda Mumbai 2013 While three 200+ innings totals have been registered in Ahmedabad T20s, the feat has been achieved only once in Ahmedabad IPL matches. Readers must note that the next best IPL innings totals at this venue have been scored by Royals (191/6) and Punjab Kings (191/6 and 179/5). ALSO READ: Narendra Modi Stadium IPL records Royal Challengers, who have played three T20s at the Narendra Modi Stadium in the past, have a highest inning total of 171/5 in 20 overs (against Delhi Capitals last season). The post Ahmedabad Stadium highest score T20: Motera Stadium average score IPL appeared first on The SportsRush.","pubDate":"2022-05-26 14:02:35","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Scarborough Cricket Club's Cameron Cooper called up to play in new Disability Premier League","link":"https://www.thescarboroughnews.co.uk/sport/cricket/scarborough-cricket-clubs-cameron-cooper-called-up-to-play-in-new-disability-premier-league-3710283","keywords":["Sport"],"creator":["Andy Bloomfield"],"video_url":null,"description":"Scarborough Cricket Club 2nds pace bowler Cameron Cooper has been called up to play in a new 20-over Disability Premier League (DPL) this summer.","content":null,"pubDate":"2022-05-26 13:27:55","image_url":"https://www.thescarboroughnews.co.uk/webimg/QVNIMTI1ODM5NzA2.jpg?width=1200&auto=webp","source_id":"thescarboroughnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Durham Cricket's home ground renamed Seat Unique Riverside","link":"https://www.thenorthernecho.co.uk/news/20167934.durham-crickets-home-ground-renamed-seat-unique-riverside/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"DURHAM Cricket's home ground has been renamed Seat Unique Riverside as part of a a new three-year deal, it has been revealed today (May 26).","content":null,"pubDate":"2022-05-26 13:15:00","image_url":"https://www.thenorthernecho.co.uk/resources/images/13820916/?type=app&htype=0","source_id":"thenorthernecho","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Velocity vs Trailblazers LIVE Score, Women's T20 Challenge 2022: Trailblazers looks to win big against Velocity","link":"https://sportstar.thehindu.com/cricket/womens-cricket/velocity-vs-trailblazers-live-score-womens-t20-challenge-ipl-wipl-match-2022/article38498168.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Velocity vs Trailblazers LIVE, Women's T20 Challenge 2022: Check out the score, updates and highlights of today's WT20C match from the Maharashtra Cricket Association Stadium in Pune.","content":"6 PM: VELOCITY vs TRAILBLAZERS DREAM11 FANTASY TEAM PICKS Wicketkeeper: Yastika Bhatia Batters: Laura Wolvaardt, Shafali Verma (c) , Kiran Navgire, Jemimah Rodrigues, Smriti Mandhana (vc) All-rounders: Hayley Matthews, Salma Khatun Bowlers: Rajeshwari Gayakwad, Kate Cross, Radha Yadav Team Composition: VEL 6:5 TBL Credits Left: 0.5 VELOCITY vs TRAILBLAZERS MATCH PREVIEW With both Velocity and Supernovas winning a game each in the 2022 edition of the Women’s T20 Challenge, Smriti Mandhana’s Trailblazers finds itself in a tight fight for survival. The defending champion needs a win, and a comfortable one at that when it takes on an upbeat Velocity at the MCA Stadium here on Thursday. Velocity vs Trailblazers LIVE, Women's T20 Challenge 2022: Playing XI, toss, Dream11 prediction, qualification scenario Despite bowling out an initially explosive Supernovas side for 163 in its 20 overs, Trailblazers could not convert its gains in the field into anything with the bat. The side fell short by 49 runs, the biggest margin of defeat in the tournament’s history. A packed batting order found it hard to keep going. Mandhana and opening partner Hayley Matthews got the side off a good start with a brisk 39-ball partnership in the first five overs, but Pooja Vastrakar struck to send both openers and Sophia Dunkley back to the hut. READ: Veda Krishnamurthy: Hope RCB makes statement by fielding team in Women's IPL Jemimah Rodrigues, who is now fighting for her place in the national team, found herself running out of partners but could have seized the opportunity a bit better herself to get her team close to the target and to make a statement about her return to form on the back of consistent league and domestic performances for the better part of the past year. Devika Palshikar coach of Velocity felt the team was throwing away their wickets and it certainly looked that way with all the simple soft dismissals inside the circle. She will not dismiss this side though, with the kind of names and how filled with achievements their resumes are, fully expecting them to come back with a vengeance when they go up against her side in a do-or-die ‘league’ fixture. The win underlined how well Velocity's leadership group is working. Kate Cross, the designated bowling captain, led the charge with two wickets (Priya Punia and Harleen Deol) to her name. Along with Sharma (who removed Dottin), the duo snuffed out any momentum Supernovas could manage to gather early on and consistently broke partnerships until Harmanpreet Kaur dropped anchor and steadied the side to a competitive 150-run score in its 20 overs. Velocity will be most happy with what followed in the chase. Shafali Verma seems to have left the demons plaguing her on the field for the last year or so behind for now. Despite a few initial jitters vs Sophie Ecclestone, she took the Supernovas to the cleaners in her 33-ball 51. Laura Wolvaardt, the side's batting captain, eventually finished the chase with an unbeaten 51 herself and 10 balls to spare. ALSO READ: Women's T20 Challenge: Solid plans, core leadership group behind Velocity's win, says coach Devika Palshikar Dominant performances of this sort put the pressure back on Mandhana and Co. who need to find a way to corner Verma, especially, early on in the innings. While Velocity has the brute force of uncapped player Kiran Navgire and all-rounders who can do a fair bit of damage with the bat (Sneh Rana and Cross), these players have not had a go in this tournament yet. Matthews and Salma Khatun were able to trouble batters with their variations, Matthews also with her speed. These two will be crucial in Trailblazers’ bid for a consecutive final appearance. HEAD TO HEAD: Velocity and Trailblazers have met each other twice in this tournament’s history. While the then-Mithali Raj-led side won by three wickets in 2019 in Jaipur (with Danni Wyat and Shafali Verma orchestrating that victory, the Trailblazers also managed to bowl out Velocity for a paltry 47 in 2020. Sophie Ecclestone was the aggressor-in-chief in that defeat but has moved on to Supernovas this season but Trailblazers won that game with 7.5 overs and just a wicket gone - the kind of win the side needs to stay alive this time around too. - Lavanya Lakshmi Narayanan RELATED V ELOCIT Y vs TRAILBLAZERS Predicted XIs Velocity: Shafali Verma, Natthakan Chantham, Yastika Bhatia, Laura Wolvaardt, Deepti Sharma, Kiran Navgire, Sneh Rana, Radha Yadav Ayabonga Khaka, Maya Sonawane, Kate Cross Trailblazers: Smriti Mandhana, Sabbhineni Meghana, Hayley Matthews, Jemimah Rodrigues, Richa Ghosh, Arundhati Reddy, Salma Khatun, Poonam Yadav, Renuka Singh, Rajeshwari Gayakwad, Sophia Dunkley VELOCIT Y VS TRAILBLAZERS Squads Velocity: Deepti Sharma (c), Sneh Rana, Shafali Verma, Ayabonga Khaka, Kiran Navgire, Kate Cross, Keerthi James, Laura Wolvaardt, Maya Sonawane, Natthakan Chantham, Radha Yadav, Aarti Kedar, Shivali Shinde, Simran Bahadur, Yastika Bhatia, Pranavi Chandra Trailblazers: Smriti Mandhana (c), Poonam Yadav, Arundhati Reddy, *Hayley Matthews, Jemimah Rodrigues, Priyanka Priyadarshini, Rajeshwari Gayakwad, Renuka Singh, Richa Ghosh, S. Meghana, Saiqa Ishaque, *Salma Khatun, *Sharmin Akter, *Sophia Dunkley, Sujata Mallik, S.B.Pokharkar. WHERE TO WATCH VELOCIT Y vs TRAILBLAZERS, IPL 2022 LIVE? The Women's T20 Challenge 2022 match between Velocity and Trailblazers will be telecast live on the Star Sports network from 7:30pm. You can also follow the game on Disney+ Hotstar.","pubDate":"2022-05-26 11:55:32","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Teams would benefit immensely if KL Rahul bats quicker, says Manjrekar","link":"https://www.business-standard.com/article/sports/teams-would-benefit-immensely-if-kl-rahul-bats-quicker-says-manjrekar-122052600986_1.html","keywords":null,"creator":null,"video_url":null,"description":"Former India batter Sanjay Manjrekar pointed out that teams, irrespective of IPL or international cricket, can benefit immensely if opener K.L Rahul bats \"quicker rather than longer.\"","content":null,"pubDate":"2022-05-26 11:54:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220526/thumb-122052600986.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: LSG vs RCB | Fan Reactions & Review | 12th Man TV - Royal Challengers Bangalore","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9Q0VCX0dRX3hWM0HSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: LSG vs RCB | Fan Reactions & Review | 12th Man TV  Royal Challengers BangaloreLive Cricket Score: LSG vs RCB, Eliminator, IPL 2022 | Cricbuzz.com  CricbuzzLive match blog - RCB vs Super Giants Eliminator 2022 - Cricket Insights  ESPNcricinfoRCB wins IPL 2022 Eliminator vs LSG | Game Day  Royal Challengers BangaloreLSG vs RCB: “Harshal Patel Was Most Impressive, Hats Off To Him” - Sanjay Manjrekar Picks Pacer As RCB's Standout Performer With Ball  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-26 11:30:03","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Justin Langer blames politics within Cricket Australia for his exit as men's team coach","link":"https://www.indiatoday.in/sports/cricket/story/justin-langer-blames-politics-within-cricket-australia-for-his-exit-as-men-s-team-coach-1954456-2022-05-26?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Langer blames politics within Cricket Australia for his exit as men's team coach","content":null,"pubDate":"2022-05-26 10:37:17","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"How Virat Kohli has fared in IPL knockouts","link":"https://www.firstpost.com/firstcricket/sports-news/how-virat-kohli-has-fared-in-ipl-knockouts-10722641.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"How Virat Kohli has fared in IPL knockouts","content":"Virat Kohli has been one of the most consistent performers in the Indian Premier League and the former RCB captain has notched up a total of 7000 runs for his franchise, becoming the first batter to achieve the feat.While Kohli has scored runs for the Royal Challengers Bangalore, he hasn't been able to leave a mark in the knockout stages of the IPL.Before the Eliminator match of the IPL 2022 against Lucknow Super Giants that was held in Kolkata on Wednesday, the right-handed player had been a part of 12 playoff matches and had only managed to score 237 runs. The classy right-hander has only scored two fifties in the 12 knockout appearances for the franchise.Scenes we just absolutely love to see. ❤️More of this in Ahmedabad please! #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #PlayOffs pic.twitter.com/B2IupgLAue— Royal Challengers Bangalore (@RCBTweets) May 26, 2022RCB defeated LSG by 14 runs in the Eliminator to march ahead in the Qualifier 2 and will now face Rajasthan Royals in that game on Friday in Ahmedabad. The winner of this match will lock horns with Gujarat Titans in the final on Sunday at Narendra Modi Stadium. That feeling of breaking the Eliminator jinx.Two steps away from making history: #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #PlayOffs pic.twitter.com/CIMn46GSkU— Royal Challengers Bangalore (@RCBTweets) May 26, 2022Kohli's dry run in the knockout matches continued against the Super Giants as well as he only managed 25 off 24 deliveries in this match. RCB then rode on a spectacular century from Rajat Patidar to post 207/4. Later, the bowlers restricted LSG to 193/6 in 20 overs. RCB have played IPL final thrice but are still searching for their first trophy.Here's a look at Kohli's appearances in the knockouts stage of the tournament:1) RCB vs CSK- 2nd Semi-final 2009- 24* off 172) RCB vs Deccan Chargers- 2009 Final- 7 off 83) RCB vs MI- 1st Semi-Final 2010- 9 off 74) RCB vs Deccan Chargers- 3rd Place Play-off 2010- DNB5) RCB vs CSK- Qualifier 1 2011- 70* off 446) MI vs RCB- Qualifier 2 2011- 8 off 127) CSK vs RCB- 2011 Final- 35 off 328) RCB vs RR- Eliminator 2015- 12 off 189) CSK vs RCB- Qualifier 2 2015- 12 off 910) Gujarat Lions vs RCB- Qualifier 1 2016- 0 off 211) RCB vs SRH- 2016 Final- 54 off 3512) SRH vs RCB- Eliminator 2020- 6 off 713) LSG vs RCB- Eliminator 2022- 25 off 24Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 10:35:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Virat-Kohli-playoffs-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Justin Langer slams politics in Cricket Australia","link":"https://www.thehindu.com/sport/cricket/justin-langer-slams-politics-in-cricket-australia/article65463226.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"Former head coach of the Australian cricket team Justin Langer has hit out at Richard Freudenstein and the cricket board of his country for the politics that led to his dismissal","content":null,"pubDate":"2022-05-26 10:35:06","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"'We’ll come back stronger': Gautam Gambhir's message after LSG's journey ends in IPL 2022","link":"https://www.firstpost.com/firstcricket/sports-news/well-come-back-stronger-gautam-gambhirs-message-after-lsgs-journey-ends-in-ipl-2022-10722511.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'We’ll come back stronger': Gautam Gambhir's message after LSG's journey ends in IPL 2022","content":"Lucknow Super Giants mentor Gautam Gambhir has vowed that his side will come back stronger next season of the Indian Premier League. The IPL debutants were eliminated from the 2022 season after they lost to Royal Challengers Bangalore in the Eliminator by 14 runs at the Eden Gardens.Gambhir was appointed LSG's mentor before the 2022 mega auctions and helped put the franchise into a solid unit under the captaincy of KL Rahul which made it to the playoffs in their first season.LSG finished third in the points table with 18 points from 14 games and were behind Rajasthan Royals on net run rate. However, their debut campaign came to an end on Wednesday with RCB booking a spot in the Qualifier 2 against RR.After the defeat to RCB, Gambhir took to Instagram to share his feeling. He wrote: \"Hard luck today but a great tournament for our new team. We’ll come back stronger….Until we meet again!\" View this post on InstagramA post shared by Gautam Gambhir (@gautamgambhir55)Being one of the best sides in the league phase, LSG were the favourites in the Eliminator but were undone by the sensational batting of Rajat Patidar who struck a magnificent 112 0ff 54. His quick-fire innings was laced with 12 fours and seven sixes as RCB posted a target of 208.Patidar, however, was helped by LSG's poor fielding as well as he was dropped twice on his way to his hundred.In reply, LSG gave a good fight and brought down the equation to 41 from the last three overs but some exceptional death overs bowling from Harshal Patel and Josh Hazlewood allowed RCB to prevail on the night by 14 runs.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 10:24:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Gautam-Gambhir-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Justin Langer comes out all guns blazing; accuses Cricket Australia of dirty politics","link":"https://www.indiatvnews.com/sports/cricket/justin-langer-comes-out-all-guns-blazing-accuses-cricket-australia-of-dirty-politics-2022-05-26-779563","keywords":null,"creator":null,"video_url":null,"description":"Veteran Australian player and former coach of the national team, Justin Langer, has come out all guns blazing, slammed the Australian Cricket Board, and has accused them, particularly interim chairman Richard Freudenstein, of dirty politics.","content":null,"pubDate":"2022-05-26 10:16:47","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Langer hits out at Cricket Australia politics, rules over ever coaching England","link":"https://uk.sports.yahoo.com/news/langer-hits-cricket-australia-politics-100037668.html?src=rss","keywords":["Sports"],"creator":["Stats Perform"],"video_url":null,"description":"Justin Langer says he suffered from trying to please everybody while he was Australia head coach.","content":"Justin Langer says he suffered from trying to please everybody while he was Australia head coach.","pubDate":"2022-05-26 10:00:37","image_url":null,"source_id":"yahoo_hk","country":["hong kong"],"category":["sports"],"language":"chinese"},{"title":"On this day in 2013: MI stunned tournament-favourite CSK to lift their maiden IPL title","link":"https://www.firstpost.com/firstcricket/sports-news/on-this-day-in-2013-mi-stunned-tournament-favourite-csk-to-lift-their-maiden-ipl-title-10721931.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"On this day in 2013: MI stunned tournament-favourite CSK to lift their maiden IPL title","content":"Mahendra Singh Dhoni-led Chennai Super Kings had been the master of the big occasion until their fifth Indian Premier League final when the sheer ferocity of the Mumbai Indians attack brought them down to the knees in front of a full house at the Eden Gardens in Kolkata on 26 May in 2013.Despite facing some issues at the initial stage of the tournament, fortune favoured Mumbai Indians’ skipper Rohit Sharma as he led the side to lift their maiden IPL trophy winning the one-sided clash on the final day.Winning the toss, Mumbai Indians’ newly-appointed captain midway through the season, Rohit Sharma decided to bat first. They lost both of their openers — Dwayne Smith and Aditya Tare in the first two overs of their innings. While Smith added just four runs to the scoresheet, Tare headed to the dugout for a golden duck. Skipper Sharma also failed to produce anything significant. Among the top-order batters, Dinesh Karthik was the only one to reach the two-digit mark scoring 21 runs in 26 deliveries.With the wicket of Karthik in the 10th over, Mumbai Indians went 4-man down for 52 when Kieron Pollard walked in and took charge of the game with Ambati Rayudu. While Rayudu’s innings finished at a 36-ball 37, Pollard remained unbeaten for 60 runs off 32 deliveries. The explosive knock of Pollard including 7 boundaries and 3 maximums helped Mumbai to put up a decent target of 149 in front of the powerhouse of IPL, Chennai Super Kings.In the first over of Chennai’s innings, Lasith Malinga gave an early blow with the wicket of in-form Michael Hussey. The CSK top-order was looking helpless in front of the Mumbai Indians’ pacer-duo Lasith Malinga and Mitchell Johnson. Suresh Raina, S Badrinath, and Ravindra Jadeja left the field without opening their account. Skipper MS Dhoni ignited the hope with his unbeaten knock of 63 runs in 45 deliveries.But no other batter managed to hold the wicket at the other end. Though the chase was looking easy for the two-time champions, the yellow army fell 23 runs short and the Mumbai-based franchise recorded their first Indian Premier League title. Malinga, Johnson, and spinner Harbhajan Singh scalped two wickets each to destroy the batting attack of Chennai. Kieron Pollard was awarded the player of the match trophy for the match-winning knock.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 09:51:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/mumbai-indians.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rajat Patidar - From unsold player to Lucknow Super Giants slayer - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMipAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLTIwMjItcmFqYXQtcGF0aWRhci1mcm9tLXVuc29sZC1wbGF5ZXItdG8tbHVja25vdy1zdXBlci1naWFudHMtc2xheWVyL2FydGljbGVzaG93LzkxODEwNjg4LmNtc9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Rajat Patidar - From unsold player to Lucknow Super Giants slayer  Times of IndiaRCB wins IPL 2022 Eliminator vs LSG | Game Day  Royal Challengers BangaloreLive Cricket Score: LSG vs RCB, Eliminator, IPL 2022 | Cricbuzz.com  CricbuzzWatch: Kohli jumps off seat, Rahul in disbelief after Karthik hits majestic shot  Hindustan TimesLSG vs RCB, Eliminator: Dressing Room Celebrations  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-05-26 09:50:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"French Open 2022: Carlos Alcaraz anchors his sinking ship just in time to enter the third round of Roland Garros","link":"https://www.firstpost.com/sports/french-open-2022-carlos-alcaraz-anchors-his-sinking-ship-just-in-time-to-enter-the-third-round-of-roland-garros-10720911.html","keywords":["Sports"],"creator":["Saurabh Nagpal"],"video_url":null,"description":"French Open 2022: Carlos Alcaraz anchors his sinking ship just in time to enter the third round of Roland Garros","content":"Among the beauties of Grand Slam tennis is its ability to stretch a match to extreme levels, expose the nitty-gritty of how the game is ebbing and flowing, and bring out a player’s best and worse in one single game.Post the completion of his match in the Court Simonne-Mathieu arena, the 19-year-old Spaniard, Carlos Alcaraz, would have made a note or two about the cyclical nature that tennis matches can have, as he displayed his full force of grit and determination in coming from behind and edging past his fellow countrymen, Albert Ramos-Viñolas, 6-1, 6-7(7), 5-7, 7-6(2), 6-4 in the second round of Roland Garros.Alcaraz is the talk of the town and the Tour right now. Many bookmakers have him among the very favourites to lift the famous La Coupe des Mousquetaires, that is, the Musketeers’ Trophy, come the 6th of June. After all, the Spaniard is the youngest player to break into the top 10, since Rafael Nadal did, 17 years ago. His ascent to the top has materialised at an astronomical pace, and it is almost bizarre to think that around April 2021, his rank was floating somewhere in the region of the 130s. During his climb upwards, the sixth seed has claimed five titles, including this season’s Masters in Madrid and Miami.Off the back of 11 consecutive victories, including wins against the biggest of the fishes, Nadal and Novak Djokovic, in consecutive matches, Alcaraz started like a Ferrari, as one would have expected him to, steamrolling the first set 6-1. Thoroughly dominant (and, at times, delicate, with his drop shots) from the baseline, everyone got a glimpse of why the 19-year-old has been termed a clay-court specialist.Not foreign to the tricks and trades of the surface, having won most of his professional matches on clay (180 out of 254), the 34-year-old Ramos-Viñolas had his say on the happenings of the match, as he took the next two sets 7-6(7), 7-5. Staying disciplined on his serve and in rallies, his banal consistency got to the extravagant skill and power of Alcaraz, who was pushed into committing more forced errors (19 and 12) and unforced errors (24 and 15) in sets 2 and 3, while his forced and unforced errors were merely 7 and 2 in the first set.At the start of set 4, Alcaraz broke Ramos-Viñolas’ serve and garnered a two-nil lead but, without wasting any time, the former World No. 17 recovered the lost ground. From then on, there was a growing sense that the game was slipping from the clutches of the younger Spaniard, which reached its climax at 5-4 when Ramos-Viñolas’ was serving for the match.The heroism of saving the match point proved to be the spark that re-energised the teenager and flipped the momentum dynamics of the game. Following that, there was an air of inevitability around Alcaraz, as he broke Ramos-Viñolas’ serve to level the scoreline and eventually took the set in the tie-break with relative ease.Into the fifth set, the tide turned again as the 34-year-old found himself leading the set 3-0.However, the sense of imminence and self-belief surrounding Alcaraz hadn’t alienated him and, keeping his compose under pressure – the most impressive feature of his throughout the game – he came roaring back to grab six out of the next seven games and clinch the contest, while successfully displaying the full array of his passing, drop, and volley strokes in the process.This IS what it means. @alcarazcarlos03 I #RolandGarros pic.twitter.com/QVzJkiS0k0— Roland-Garros (@rolandgarros) May 25, 2022 Alcaraz by name ✨ Alcaraz by nature ✨@alcarazcarlos03 defeats compatriot Albert Ramos-Vinolas 6-1, 6-7(7), 5-7, 7-6(2), 6-4 to advance to the third round.#RolandGarros pic.twitter.com/06A8nqfkgX— Roland-Garros (@rolandgarros) May 25, 2022Alcaraz’s first win on the Tour was against Ramos-Viñolas more than two years ago in Rio de Janeiro. After more than four-and-a-half hours of gruelling-but-enthralling tennis, Alcaraz earned his 30th win of the season – a staggering feat in itself. But this mentally and physically taxing hustle with his Spanish compatriot would have taught him some valuable lessons, not in the least that there are no easy victories in Grand Slams.The 19-year-old will now face 27th seed Sebastian Korda of the United States on Friday in the third round of the French Open.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 09:42:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Carlos-Alcaraz-6402.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"LSG vs RCB, IPL 2022 Eliminator: How KL Rahul's knock let LSG down and other talking points","link":"https://www.firstpost.com/firstcricket/sports-news/lsg-vs-rcb-ipl-2022-eliminator-how-has-kl-rahul-struggled-to-pace-innings-and-other-burning-questions-10720651.html","keywords":["First Cricket News"],"creator":["Rohit Sankar"],"video_url":null,"description":"LSG vs RCB, IPL 2022 Eliminator: How KL Rahul's knock let LSG down and other talking points","content":"Royal Challengers Bangalore broke the Eliminator jinx by squeezing out a 14-run win over Lucknow Super Giants on Thursday night. After exiting the tournament twice in the Eliminator in successive seasons, RCB managed to turn it around through a spectacular hundred from Rajat Patidar, the impressive No.3 batter.But this wasn't his first time saving the team when in trouble. Here's more on the burning questions from the game.How Rajat Patidar has stepped up as RCB's man in strife multiple timesWith Faf du Plessis gone for a duck, Rajat Patidar stepped up from No.3 to play one of the best knocks in an IPL playoff game. The 49-ball hundred was the joint-quickest in the playoff stage of the IPL as Patidar took RCB past 200.Time and again this year, Patidar has played a solid hand in strife for RCB. The three times he crossed 40 were all after RCB had lost either Faf du Plessis or Virat Kohli for a duck. Each of them came at three different venues, but all of them came from No.3.Patidar's 40-plus knocks52 (32) vs GT, Brabourne - Faf du Plessis 0 48 (38) vs SRH, Wankhede - Kohli 0 112* (54) vs LSG, Eden Gardens - Faf du Plessis 0An excellent player of spin, Patidar currently has the best strike-rate against spin in the season (177.3). It spiked on Wednesday night after he spectacularly took down Ravi Bishnoi and Krunal Pandya, smashing them for 58 runs off just 22 balls.Why Ravi Bishnoi's ravishing start to T20 cricket is unravelling pretty quickly?Ravi Bishnoi shot to prominence in the last edition of the IPL, impressing with his excellent disguise of the wrong 'un and baffling both left- and right-handers alike. He was so impressive that an India call-up followed soon after he ended the season with 12 wickets at an average of 18.5 and an economy rate of 6.34. While he has played five extra matches compared to last year this time around, Bishnoi has only 13 wickets, one more than last year, with an economy rate of 8.44.Worryingly, Bishnoi has struggled to take wickets and restrict the scoring rate, which meant Lucknow benching him in the middle. He came back for the last couple of games but went for 45 runs in his four overs in the decisive fixture, including five boundaries in an over off Patidar.While Bishnoi has continued to be decent against left-handers (economy rate of 7.7), he has gone at 9 runs per over against right-handers with his googlies getting too predictable.How Avesh Khan has consistently dominated the big gunsAvesh Khan might have leaked 44 runs in his four overs but as has been the case through the season, he managed to get a big wicket; dismissing Virat Kohli for 25 off 24 balls. Avesh ends the season with 18 wickets at an average of 23.11 and an economy rate of 8.73. Although inferior to his numbers last season — 24 wickets at 18.75 and 7.37 economy rate — Avesh has consistently found a way against the top players.Some of his wickets this season include Jos Buttler, Andre Russell, Rohit Sharma, Virat Kohli, Nitish Rana, Nicholas Pooran, Moeen Ali and Hardik Pandya. Notably, he dismissed Buttler, the Orange Cap holder in the season twice in three balls, although he still went for runs against the others in the same game.How KL Rahul's knock let LSG downKL Rahul's strike-rate is under the scanner and not for the first time. In yet another controversial knock, the Lucknow Super Giants skipper and opener hit 79 off 58 balls in a run-chase of 208. Without delving too much into the specifics, to state in layman terms, Rahul's scoring rate of 8.4 runs per over was two runs per over below that of the required run rate of 10.4. He did this while consuming nearly 50 per cent of the deliveries available in the innings.Needless to say, the rest of the batters had to make up for Rahul's slow rate and failed to do so. However, it's worth noting that the combined strike rate of his colleagues was 9.02, above that of Rahul's. With players like Marcus Stoinis, Evin Lewis and Krunal Pandya waiting, Rahul's acceleration arrived too late. His first 42 balls saw him score a mere 48 runs. At this stage, Lucknow needed 99 runs to win off just seven overs. Rahul finished with more than 600 runs for the third successive time in an IPL season but once again disappointed with his strike-rates, while maintaining an exceptional average. This has been the story of every season since 2019.KL Rahul in the last four IPL seasons2022: 616 runs @ 51.3, SR: 135.4 2021: 626 runs @ 62.6, SR: 138.8 2020: 670 runs @ 55.8, SR: 129.3 2019: 583 runs @ 53.9, SR: 135.4Why RCB need to give better support for Harshal PatelHarshal Patel produced a brilliant spell against Lucknow Super Giants, turning the game on its head by conceding just 17 runs in his last two overs (the 18th and 20th overs of the innings). In the death overs this season, Harshal has gone at an economy rate of 9.38 while every other RCB quick has gone at over 11 runs per over. Harshal also has the most wickets in this phase (9 wickets) by an RCB bowler. But with the others not stepping up, RCB have the second-worst bowling average in the season in the death.That they play one of the better big-hitting teams in the death overs (Rajasthan Royals have the third-best batting strike-rate in the death this year) in the second qualifier makes RCB's death bowling a big part of their plans for the big game. They need to get their act together and support Harshal, something Josh Hazlewood did last night in the penultimate over, dismissing Rahul and Krunal off successive balls and giving away just nine runs in the over.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 09:40:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Rajat-Patidar-IPL-2022-Eliminator-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Rajat Patidar corrects Virat Kohli on how to pronounce his surname, watch","link":"https://www.firstpost.com/firstcricket/sports-news/watch-rajat-patidar-corrects-virat-kohli-on-how-to-pronounce-his-surname-10720861.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Rajat Patidar corrects Virat Kohli on how to pronounce his surname, watch","content":"In perhaps the biggest match of his career so far, Rajat Patidar displayed tremendous grit, mettle and skills to notch up a hundred – an innings that dominated the Lucknow Super Giants bowling attack and powered Royal Challengers Bangalore past 200.This was a match-winning effort as it came on a day when the big three of RCB – Faf du Plessis, Virat Kohli and Glenn Maxwell all failed. Patidar came in at number 3 and never looked bothered or ruffled one bit. 90 of his runs came in boundaries off just 19 deliveries.It has been an amazing journey for him, he was unsold at the IPL auctions and was snapped up by RCB only as a replacement when Luvnith Sisodia was injured. Ever since, he has been a valuable inclusion to the side and has performed as one of the most assured batters.Watch the video here:Speaking with former India and RCB captain Virat Kohli after the match, the right-hander even corrected Kohli when he mispronounced his surname. It was an excellent conversation as Kohli said that he had not seen a better innings than the one played by Patidar that night.“I told him as well after the game as well that I have seen many impact innings and many innings under pressure over so many years. I have not seen many better than how Rajat played today. Under pressure, big game, first uncapped player,” Kohli told Patidar while speaking to the broadcasters.Patidar looked fluent from the start and added 66 runs with Kohli for the second wicket after RCB lost Faf du Plessis in the first over. Kohli added that one should understand and appreciate the excellence of the cricketer after an innings like that.“The magnitude of the game was so big that I was feeling the tension in the air because I have been in those situations where you have to cross the line as a team.” What he did was very very special, I don’t think that anyone should take that for granted. You should understand the excellence of the innings and appreciate as a cricketer, an innings like that,” said Kohli.Incidentally, his 112 not out is the highest score for an uncapped player in the IPL knockouts history.Read all the Latest News, Trending News, Cricket News, IPL Live Score Update, Latest IPL Schedule 2022 and IPL 2022 Points table, Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 09:40:05","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Rajat-Patidar-Virat-Kohli-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"BAW vs CRD Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10 - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiqgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2Jhdy12cy1jcmQtZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLWRyZWFtMTEtdGVhbS1wbGF5aW5nLXhpLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlLWRyZWFtMTEtbmF0dXJlLWlzbGUtdDEwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BAW vs CRD Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10  Cricket AddictorSSS vs VH Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs for Nature Isle T1  News18BAW vs CRD 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match 10  CricTrackerIRR vs TGS Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Dream11 Nature Isle T10  Cricket AddictorCricket Match Predictions: Dream11 Nature Isle T10, 2022 - Sari Sari Sunrisers vs Valley Hikers, Match 12: 26th May  Cricket WorldView Full coverage on Google News","content":null,"pubDate":"2022-05-26 09:25:31","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Women’s T20 Challenge 2022, Velocity vs Trailblazers: Pune Weather Update","link":"https://www.firstpost.com/firstcricket/sports-news/womens-t20-challenge-2022-velocity-vs-trailblazers-pune-weather-update-10721541.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Women’s T20 Challenge 2022, Velocity vs Trailblazers: Pune Weather Update","content":"Smriti Mandhana’s Trailblazers will square off against Deepti Sharma’s Velocity in a crucial match of the Women’s T20 Challenge 2022 at Pune's Maharashtra Cricket Association Stadium at 7:30 PM IST on 26 May, Thursday. In this fixture, a win alone might not be enough for the defending champions. The Trailblazers will also have to keep an eye on the net run rate in order to secure their place in the final.Trailblazers suffered a huge loss in their previous game against the Supernovas. Batting first, the Harmanpreet Kaur-steered Supernovas put up 163 runs in front of Trailblazers. Pooja Vastrakar’s four-wicket haul and Sophie Ecclestone’s two wickets did not let Trailblazers breach the target. Skipper Mandhana top-scored with a 23-ball 34 and the side lost the game by 49 runs.On the other side, Velocity is coming off a confident win against Supernovas in their last contest. While chasing down a target of 151, Velocity clinched a comfortable seven-wicket victory, riding on the half-centuries of Shafali Verma and Laura Wolvaardt. While opener Verma scored 51 runs off 33 deliveries to give the team a kickstart, Wolvaardt smashed an important 51 runs off 35 to take them past the winning post.Weather Report:Pune weather is expected to be mostly clear on Thursday evening. There is no chance of rain during this Trailblazers vs Velocity encounter. The wind speed is expected to be around 16km/h on matchday, while the temperature could hover from 23 degrees Celsius to 35 degrees Celsius. The humidity is expected to be around 50-80 percent.Probable Playing XIs:Trailblazers: Smriti Mandhana, Hayley Matthews, Jemimah Rodrigues, Sabbhineni Meghana, Sophia Dunkley, Richa Ghosh, Arundhati Reddy, Salma Khatun, Poonam Yadav, Renuka Singh, Rajeshwari Gayakwad.Velocity: Shafali Verma, Natthakan Chantham, Yastika Bhatia, Laura Wolvaardt, Deepti Sharma, Kiran Navgire, Sneh Rana, Radha Yadav, Ayabonga Khaka, Maya Sonawane, Kate Cross.Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022, and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 08:50:07","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Trailblazers-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Shikhar Dhawan's father 'knocks out' PBKS batter after his side fails to qualify for IPL 2022 playoffs","link":"https://www.firstpost.com/firstcricket/sports-news/watch-shikhar-dhawans-father-knocks-out-pbks-batter-after-his-side-fails-to-qualify-for-ipl-2022-playoffs-10721171.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Watch: Shikhar Dhawan's father 'knocks out' PBKS batter after his side fails to qualify for IPL 2022 playoffs","content":"Punjab Kings opener Shikhar Dhawan recently posted a hilarious video on social media after the team was knocked out of the 15th edition of the Indian Premier League. In the video, the cricketer could be seen being jokingly beaten by his father while other family members try to stop him.However, it is to be noted that the video was made just for the entertainment of fans. The PBKS opener does this on a regular basis, trying to make funny reels for his followers and sometimes includes his family as well in these videos.Here is what he had posted: The video was captioned as: \"Knock out by my dad for not qualifying for knock outs.\" In the clip, the cricketer’s father could be seen mock beating his son. The video has grabbed attention of social media users and has been viewed multiple times.Many teammates of Shikhar Dhawan reacted to the video including former Indian cricketer Harbhajan Singh. The 2011 World Cup winner jokingly remarked that Dhawan’s father turned out to be a better actor than him.PBKS star Harpreet Brar also reacted to the hilarious video and wrote “Haha 😂 Uncle on fire pajii 😅.”Punjab Kings finished IPL 2022 at No 6 on the Points Table with 7 wins and 7 losses. Had they won one more match, they could have made to the playoffs. The team led by Mayank Agarwal will have to make a strong comeback in IPL 2023 to win their maiden IPL title.Dhawan became the leading run-getter for the Punjab-based franchise in this IPL season. The Indian opener smashed 460 runs in 14 matches in IPL 2022. Dhawan also broke multiple records in his debut season for Punjab Kings.Read all the Latest News, Trending News, Cricket News, IPL Live Score Update, Latest IPL Schedule 2022 and IPL 2022 Points table, Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-26 08:47:20","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/knock-out-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}