{"newsArray":[{"title":"'Rizwan used prohibited substance during T20 WC'","link":"https://www.thenews.com.pk/print/956350-rizwan-used-prohibited-substance-during-t20-wc","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: A prohibited substance was used by Pakistan’s leading cricketer Mohammad Rizwan during the T20 World Cup semi-finals against Australia which was later cleared by the ICC.According to Pakistan Cricket Board’s Doctor Najeebullah Soomro who conducted an interview with the star...","content":null,"pubDate":"2022-05-09 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Genuine pace of Umran Malik will be hard to ignore, says Ian Chappell","link":"https://kashmirreader.com/2022/05/09/genuine-pace-of-umran-malik-will-be-hard-to-ignore-says-ian-chappell/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"SYDNEY: India’s cricketing establishment has over the years shown patience in grooming a pack of world-class bowlers but in near future, the genuine pace of Umran Malik will be hard to ignore, feels former Australia captain Ian Chappell. Chappell, one of the most respected voices in world cricket, says that the advent of IPL has […]","content":"SYDNEY: India’s cricketing establishment has over the years shown patience in grooming a pack of world-class bowlers but in near future, the genuine pace of Umran Malik will be hard to ignore, feels former Australia captain Ian Chappell. Chappell, one of the most respected voices in world cricket, says that the advent of IPL has acted as a catalyst for India’s “enormous depth in pace bowling” and it is not showing any signs of abating. “India’s pace-bowling revolution shows no sign of abating, and the name on IPL watchers’ lips is currently that of the pacy Umran Malik. In the past India has displayed patience in developing its fast-bowling group but the genuine pace of Malik will be hard to ignore,” Chappell wrote in his column for ‘ESPNcricinfo’. “In a world where fast bowling is a valuable commodity, India are now a shining light.” The IPL indeed has played a huge role in transforming India from a side with potential to a dominant force in world cricket. “India are currently a dominant international side and if they continue to show the required resolve, will continue to be a leading team. That is an envious position and India can thank the highly successful IPL for much of their lofty reputation.” Chappell feels that India’s pace bowling arsenal is a matter of “envy” for rival countries. “The development of star quick bowlers like Jasprit Bumrah, Mohammed Shami and Mohammed Siraj has been instrumental in India’s improved overseas reputation. There is also a depth below that group, in the successful Ishant Sharma, the underrated Umesh Yadav, and handy back-up in Shardul Thakur.” Chappell, who first toured India in 1969 and played against the top sides in his time, believes the situation now is a far cry from the days when some Indian players were happy being non-playing members in adverse conditions. “India have evolved from a team that had a reputation where some players treasured the blazer, sweater and cap more than actual selection in the Test side, to one that was extremely difficult to beat under any conditions,” he wrote. “However, India, who had produced the odd faster bowler, lacked a pace conglomerate. Then the IPL began to bare its teeth, and now we have the current generation of fast bowlers to round out a versatile attack, which accompanies a strong batting line-up and a decent catching combination,” he added. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-05-08 20:35:51","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli falls for third golden duck in IPL 2022","link":"https://kashmirreader.com/2022/05/09/kohli-falls-for-third-golden-duck-in-ipl-2022/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"MUMBAI: Virat Kohli on Sunday fell for his third golden duck this IPL season to extend the Indian superstar’s grave batting slump. Opening the batting for Royal Challengers Bangalore against Sunrisers Hyderabad in Mumbai, Kohli flicked the ball straight to short mid-wicket off left-arm spinner Jagadeesha Suchith. The 33-year-old star batsman and former India captain […]","content":"MUMBAI: Virat Kohli on Sunday fell for his third golden duck this IPL season to extend the Indian superstar’s grave batting slump. Opening the batting for Royal Challengers Bangalore against Sunrisers Hyderabad in Mumbai, Kohli flicked the ball straight to short mid-wicket off left-arm spinner Jagadeesha Suchith. The 33-year-old star batsman and former India captain has scored just 216 runs in 12 matches with just one half-century. Pundits including former India coach Ravi Shastri believe Kohli is “overcooked” due to relentless cricket and should take a break. Kohli’s miserable run with the bat has coincided with his stepping down as captain of India in T20 and Test cricket and also being removed as ODI skipper. He stood aside as skipper at Bangalore after the previous IPL season. Kohli has now failed to score a century in more than 100 matches in all formats. —PTI Press Trust of Indiakashmirreader.com","pubDate":"2022-05-08 20:35:41","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 MS Dhoni healps praise on 2 CSK players after 91-run win over DC","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-ms-dhoni-healps-praise-on-2-csk-players-after-91-run-win-over-dc-741689","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"CSK thrashed DC by 91 runs in IPL 2022Devon Conway scored 49-ball 97CSK are now eighth in the IPL 2022 table","content":"MS Dhoni MS Dhoni heaped praise on two young Chennai Super Kings (CSK) bowlers after their big win over Delhi Capitals (DC) on Sunday. CSK thrashed DC by 91 runs at DY Patil Stadium, Navi Mumbai, in the Indian Premier League (IPL 2022). The victory pulled them one place up to No. 8 in the points table. DC captain Rishabh Pant won the toss and asked CSK to bat. The lost toss turned into a blessing for Dhoni and Co as they posted 208 for 6 in 20 overs. Eventual Player of the Match Devon Conway top scored with his knock of 87 off 49 deliveries. He struck at a strike rate of 177.55 as he hit five sixes and seven fours. CSK bowlers produced a collective effort as they never allowed a Delhi batter to settle in the middle. Openers David Warner and KS Bharat, who threatened at the beginning, were sent back inside the powerplay overs. The next two batsmen Mitchell Marsh and Pant were also removed at the correct time. Marsh scored 25 off 20, while Pant scored a quick-fire 21. Following that, only Shardul Thakur scored in double digits. The former CSK all-rounder scored 25 off 19 balls. CSK's opening bowling duo Mukesh Choudhary and Simarjeet Singh had a great outing against DC. They made two dismissals each and bowled quite economically to help CSK secure their fourth victory in the IPL 2022. \"It would have been better if we would have had a win like this somewhere early. It was a perfect game. The batters did really well. It was a toss where we wanted to win and field first, but in the heart, I was fine to lose the toss. The ball stops and comes, and it behaves only after 13-14 overs. Everybody contributed a bit. Runs on the board really help, and it was important to restrict their big-hitters. Both Simarjeet and Mukesh have taken time to mature. They have the capability, the more they play, the better they'll get at game sense,\" said Dhoni after CSK's big win on Sunday. Mukesh has played 10 out of CSK's 11 games in the ongoing season. The fast bowler has picked up 13 wickets, including a four-wicke haul. Simarjeet, who made his IPL debut this season, has three scalps in three games. Pace Boys bringing on the shine! ✨ #CSKvDC #WhistlePodu #Yellove 🦁💛 pic.twitter.com/BI4ynKSS8R Dhoni struck two sixes and a four in his eight-ball 21 before taking two catches behind the wickets in the second innings. \"It is ultimately about reading which is a good delivery to bowl and which is a delivery to not bowl. In T20 cricket, it is all about knowing which delivery not to bowl. I don't like going in and hitting straightaway. But with only 12 deliveries left, if a few of us contribute with scores of 8 off 2, it helps. But scoring just 2 or 3 runs doesn't help. I am not a big fan of maths. Even in school I wasn't good at it. Thinking of the NRR doesn't help. You just want to enjoy the IPL. When two other teams are playing, you don't want to be under pressure and thinking. You just have to think about what to do in the next game. If we make the playoffs, great. But even if we don't it's not the end of the world,\" added Dhoni. If we make the playoffs, great. But even if we don't it's not the end of the world - #THA7A #CSKvDC #WhistlePodu #Yellove 🦁💛 pic.twitter.com/7Y5XJyekwS IPL 2022: We were outplayed in all departments, says Rishabh Pant Meanwhile, Pant admitted that his side was \"outplayed in all departments\" by Dhoni and Co. \"I think they outplayed us in all departments. As Delhi Capitals we have played a lot of close games, there had to be a game where there is a massive difference between the two sides and unfortunately we are on the receiving end. I thought we were getting better but that is not the case. The only thing we can look forward to is the next three matches, if we win them then we will qualify. There is a fair bit going on amongst us, especially Covid and we had few stomach infections, but we are not making an excuse and we just want to keep improving. Right now we can be more positive and that's what we are going to be talking about to the boys, let's be more proactive and let's be in a good frame of mind to make good decisions in the next few matches,\" said Pant at the post-match presentation. CSK are scheduled to next play Mumbai Indians (MI), who have already been eliminated from IPL 2022), on Thursday (May 12) at Wankhede Stadium. DC, on the other hand, take on Rajasthan Royals (RR) at DY Patil Stadium, Navi Mumbai, on Wednesday.","pubDate":"2022-05-08 19:00:47","image_url":"https://assets.thehansindia.com/h-upload/2022/05/08/500x300_1291049-ms-dhoni.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: They outplayed us in all departments, says Rishabh Pant after CSK thrash DC by 91 runs","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-they-outplayed-us-in-all-departments-says-rishabh-pant-after-csk-thrash-dc-by-91-runs-741666","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"CSK thrashed DC by 91 runs on SundayDevon Conway was MoM for scoring 87CSK have climbed to No. 8 in the points table","content":"Delhi Capitals (DC) skipper Rishabh PantDelhi Capitals (DC) skipper Rishabh PantDelhi Capitals (DC) skipper Rishabh Pant has admitted that Chennai Super Kings (CSK) \"outplayed\" his side in \"all departments\" on Sunday. CSK registered their fourth win in the Indian Premier League (IPL) by thrashing DC by 91 runs at DY Patil Stadium, Navi Mumbai.Devon Conway top scored for CSK with his excellent knock of 87 off 49 balls. He hit five sixes and seven fours and scored the runs at a strike rate of 177.55. In addition, cameos from the likes of MS Dhoni (21 off 8), Ruturaj Gaikwad (41 off 3), and Shivan Dube (32 off 19) helped CSK post 208 for 6 in 20 overs. During the chase, DC lost both its openers inside the powerplay overs. Pacers Mukesh Choudhary and Simarjeet Singh, who opened CSK's bowling finished with two wickets each. Moeen Ali was the best of the lot as he picked up three wickets while he gave away just 13 runs in his quota of four overs. In the post-match presentation, Pant said that DC need to focus on the remaining matches, try to win them all to qualify for the playoffs. \"I think they outplayed us in all departments. As Delhi Capitals we have played a lot of close games, there had to be a game where there is a massive difference between the two sides and unfortunately we are on the receiving end. I thought we were getting better but that is not the case. The only thing we can look forward to is the next three matches, if we win them then we will qualify. There is a fair bit going on amongst us, especially Covid and we had a few stomach infections, but we are not making an excuse and we just want to keep improving. Right now we can be more positive and that's what we are going to be talking about to the boys, let's be more proactive, and let's be in a good frame of mind to make good decisions in the next few matches,\" added Pant.IPL 2022: Have to give credit to MS, says ConwayMeanwhile, CSK opener Conway credited Dhoni for his match-winning knock on Sunday. \"The thought process was just about keeping it simple. It was just about communicating with Ruturaj. With Hussey, I just discussed how the surface would be and who the bowlers would be to target. I am just happy to build that partnership up with Rutu, and the way he's playing, he makes my job easier. I have to be true to myself, authentic to myself. I look to play cricket shots and just assess where to put my foot down. I have to give credit to MS, because I got out trying to play the sweep in the last game, and he told me to look to play straight,\" said Player of the Match, Conway, after CSK's victory over DC.Presenting, MOM - Devon Conway.! 👑Let this be the first of many Singam Shields, Dev.! #WhistlePodu #Yellove 💛🦁 pic.twitter.com/FrpP59s51v— Chennai Super Kings (@ChennaiIPL) May 8, 2022 With their latest triumph, CSK have eight points and have climbed to No. 8, pushing Kolkata Knight Riders (KKR) to No. 9 in the IPL 2022 points table. CSK are scheduled to next play Mumbai Indians (MI), who have already been eliminated from IPL 2022), on Thursday (May 12) at Wankhede Stadium. DC, on the other hand, take on Rajasthan Royals (RR) at DY Patil Stadium, Navi Mumbai, on Wednesday.","pubDate":"2022-05-08 18:33:40","image_url":"https://assets.thehansindia.com/h-upload/2022/05/08/500x300_1291023-rishabh-pant.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Devon Conway, Moeen Ali shine as Chennai Super Kings crush Delhi Capitals by 91 runs","link":"https://www.firstpost.com/photos/ipl-2022-devon-conway-moeen-ali-shine-as-chennai-super-kings-crush-delhi-capitals-by-91-runs-10648611.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: Devon Conway, Moeen Ali shine as Chennai Super Kings crush Delhi Capitals by 91 runs","content":"Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-08 18:08:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/PP8-19.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 CSK vs DC HIGHLIGHTS: CSK register a win by 91 runs","link":"https://www.firstpost.com/firstcricket/sports-news/csk-vs-dc-live-cricket-score-tata-ipl-2022-match-scorecard-live-update-chennai-super-kings-vs-delhi-capitals-indian-premier-league-live-streaming-today-10644751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Tata IPL 2022 CSK vs DC HIGHLIGHTS: CSK register a win by 91 runs","content":"23:23 (IST)That's it from our end for this match. Hope you enjoyed our coverage. Stay with us and follow all the updates from the tournament. 23:20 (IST)IPL 2022 CSK vs DC  It was Devon Conway who set the tone for CSK alongside Ruturaj Gaikwad in the very beginning. The left-hander scored 87 in 49 balls and was adjudged man of the match for his performance.  23:17 (IST)IPL 2022 CSK vs DC  Moeen Ali returned with figures of 3/13 in 4 overs while Mukesh Choudhary, Simarjeet and Bravo scalped a couple apiece. 23:15 (IST)IPL 2022 CSK vs DC  The Delhi Capitals have been bundled out for 117 while chasing 209. The Chennai Super Kings bowlers, espcially Moeen Ali thoroughly dominated the Capitals' batting line up. 23:12 (IST)IPL 2022 CSK vs DC  WICKET! That's the end of the match. Bravo deceives Khaleel with his pace as he bowls a slow yorker and it disturbs the woodwork behind. CSK win by 91 runs. 23:09 (IST)IPL 2022 CSK vs DC  WICKET! There's another wicket. Bravo comes round the wicket, bowls length ball around the leg stump and Thakur tries to glance that but only manages to edges it back to Dhoni. 23:08 (IST)IPL 2022 CSK vs DC  FOUR! Touch fuller, outside off and this time he goes over extra cover for another boundary. 23:07 (IST)IPL 2022 CSK vs DC  FOUR! Back of the length a bit from Bravo, outside off and Thakur cuts that through for a boundary. 23:06 (IST)IPL 2022 CSK vs DC After 17 overs,Finland 115/4 ( Aniketh Pusthay 6 , Vanraaj Padhaal 0)A Maximum came in that over from Theekshana but he gets things back in control and only gives seven in that one. 23:04 (IST)IPL 2022 CSK vs DC  SIX! Thakur hammers that fuller delivery over long on. 23:03 (IST)IPL 2022 CSK vs DCAfter 16 overs,Delhi Capitals 102/8 ( Shardul Thakur 9 , Anrich Nortje 1)Another fine over from CSK as they continue to pick wickets. 22:58 (IST)IPL 2022 CSK vs DC  WICKET! Length ball from Simarjeet but that hurries on to Kuldeep Yadav as he tries to pull. The ball takes the top edge and Robin Uthappa completes an easy catch around point. 22:55 (IST)IPL 2022 CSK vs DC After 15 overs,Delhi Capitals 99/7 ( Shardul Thakur 8 , Kuldeep Yadav 5)The Chennai Super Kings have been brilliant both with the bat and in the field. They are giving absolutely nothing. 22:52 (IST)IPL 2022 CSK vs DC After 14 overs,Delhi Capitals 94/7 ( Shardul Thakur 5 , Kuldeep Yadav 4)CSK have continued to keep things tight as Moeen Ali's impressive spell comes to an end. 22:45 (IST)IPL 2022 CSK vs DC After 12 overs,Delhi Capitals 86/7 ( Shardul Thakur 3 , Kuldeep Yadav 0)Moeen Ali continues his dominance with the ball in this over.22:41 (IST)IPL 2022 CSK vs DC After 11 overs,Delhi Capitals 85/7 ( Shardul Thakur 2 , Kuldeep Yadav 0)Wickets continue to tumble as Choudhary gets two in the over. 22:40 (IST)IPL 2022 CSK vs DC  WICKET! Another one in the over. Length ball from Choudhary, moving away from the right-hander and Powell edges it while going for the cut. MS Dhoni completes a sitter behind the stumps. 22:35 (IST)IPL 2022 CSK vs DC  WICKET! WHAT A BALLLLL. Choudhary moves that into the left-hander and the ball takes away the top of off. Axar has to depart for 1. 22:33 (IST)IPL 2022 CSK vs DC After 10 overs,Delhi Capitals 82/5 ( Rovman Powell 2 , Axar Patel 1)Two wickets come from that over and DC have been pushed on the backfoot. 22:32 (IST)IPL 2022 CSK vs DC  WICKET! Moeen pulls the length a bit on this one and Ripal Patel once again slogs that but couldn't find the same timing on it. He has been caught by Conway at deep mid-wicket for 6. 22:31 (IST)IPL 2022 CSK vs DC  SIX! Flighted one from Moeen Ali and Ripal Patel slog sweeps that for a maximum over deep mid-wicket boundary. 22:29 (IST)IPL 2022 CSK vs DC  WICKET! Moeen Ali comes round the wicket against Pant and gets a bit of turn on that. The left-hander tries to cut that length ball but plays it on to his stumps. 22:27 (IST)IPL 2022 CSK vs DC After 9 overs,Delhi Capitals 75/3 ( Rishabh Pant (C) (W) 21 , Rovman Powell 2)A good over from Theekshana as he just gives two in that.  22:24 (IST)IPL 2022 CSK vs DC After 8 overs,Delhi Capitals 73/3 ( Rishabh Pant (C) (W) 20 , Rovman Powell 1)Moeen Ali gets an important wicket in that over as Delhi Capitals lose another one.22:22 (IST)IPL 2022 CSK vs DC  WICKET! Moeen Ali tosses that one up and Mitchell Marsh takes the aerial route but couldn't clear the long on boundary and Gaikwad grabs a good one. 22:18 (IST)IPL 2022 CSK vs DC After 7 overs,Delhi Capitals 71/2 ( Mitchell Marsh 25 , Rishabh Pant (C) (W) 19)An expensive over from Bravo as he gives away 12 in that. 22:16 (IST)IPL 2022 CSK vs DC  FOUR! Length ball, outside off, had no pace on it but Marsh gets it through the covers. 22:13 (IST)IPL 2022 CSK vs DC  FOUR! Bravo bowls that full around the middle and leg and Marsh flicks that over mid wicket and gets a boundary. 22:12 (IST)IPL 2022 CSK vs DC After 6 overs,Delhi Capitals 59/2 ( Mitchell Marsh 16 , Rishabh Pant (C) (W) 16)Another boundary to finish the over. Simarjeet bowls this short and Pant just pulls that with authority. 22:08 (IST)IPL 2022 CSK vs DC  SIX! Touch fuller from Simarjeet, outside off and Marsh swings his bat and the ball flies over long off boundary. 22:08 (IST)IPL 2022 CSK vs DC After 5 overs,Delhi Capitals 48/2 ( Mitchell Marsh 9 , Rishabh Pant (C) (W) 12)Pant scores some boundaries after that important wicket of Warner. The left-hander cuts that length ball as it runs away to the third man boundary for another four in the over. 22:07 (IST)IPL 2022 CSK vs DC  FOUR! Pant begins with two boundaries as he comes down the track and hammers that to the long off area. 22:05 (IST)IPL 2022 CSK vs DC  WICKET! Massive, massive wicket for CSK. David Warner has to depart and he is not happy at all. Theekshana pulls the length a bit, bowls it around middle and off moving. Warner tries for a reverse hit but couldn't and the ball hits his back thigh. The CSK players appeal and the umpire raises his finger. The batter goes upstairs but the DRS shows that the ball is clipping the off stump and he has to go back on umpire's call.  22:01 (IST)IPL 2022 CSK vs DC  FOUR! Warner welcomes Theekshana with a boundary. The spinner offers him width and Warner goes over covers for a four. 22:00 (IST)IPL 2022 CSK vs DC After 4 overs,Delhi Capitals 32/1 ( David Warner 15 , Mitchell Marsh 9)A good over from Simarjeet. Just 4 come from that one. 21:56 (IST)IPL 2022 CSK vs DC After 3 overs,Delhi Capitals 28/1 ( David Warner 14 , Mitchell Marsh 6)SIX! Another back of the length ball from Choudhary and Warner pulls that with authority for a maximum over deep mid-wicket boundary to end the over. 21:51 (IST)IPL 2022 CSK vs DC  FOUR! Length ball, moving away from the right-hander and Marsh drives that nicely to pierce the off-side field for a boundary. 21:50 (IST)IPL 2022 CSK vs DC After 2 overs,Delhi Capitals 17/1 ( David Warner 8 , Mitchell Marsh 1)A wicket has come in that over and this is what CSK needed. 21:49 (IST)IPL 2022 CSK vs DC  WICKET! Simarjeet gets the breakthrough early. Back of the length ball from him, outside off and the ball hurries on to the batter as KS Bharat tries to pull that but only manages the get an edge. Moeen completes a good catch at first slip. 21:47 (IST)IPL 2022 CSK vs DC  FOUR! The bowlers are getting some movement. KS Bharat edged that fuller delivery first up and got the boundary behind but this time plays that cover drive to perfection. 21:46 (IST)IPL 2022 CSK vs DC After 1 overs,Delhi Capitals 8/0 ( David Warner 8 , Srikar Bharat 0)SIX! Warner finishes the first over with a six. The left-hander didn't really time that well. Choudhary bowled a length ball, outside off and Warner just threw his bat on it. The ball takes the top edge but had enough force on it to go over the ropes towards the third man region. 21:27 (IST)IPL 2022 CSK vs DC  Conway and Gaikwad started off pretty well for CSK as the left-right batting duo put up a partnership of more than 100 runs for the first wicket. The Super Kings then lost the way in the middle a bit but got back on track to post a big total. DC need to chase down 209 in 20 overs. 21:25 (IST)IPL 2022 CSK vs DC After 20 overs,Chennai Super Kings 208/6 ( MS Dhoni (C) (W) 21 , Dwayne Bravo 1)The Chennai Super Kings have posted 208/6 in 20 overs. 21:22 (IST)IPL 2022 CSK vs DC  WICKET! Two wickets on the trot. Another length ball, going down the leg from Nortje and Robin Uthappa tries slog that over backward square leg but couldn't time his stroke and Nagarkoti takes a good catch in the deep. 21:20 (IST)IPL 2022 CSK vs DC  WICKET! No pace on that one. Nortje bowls that length ball, outside off and Moeen Ali slices that one in the air. Warner takes a good catch at long off. 21:19 (IST)IPL 2022 CSK vs DC  FOUR! Perfect yorker length, outside off and Moeen Ali gets something on it. The ball races away to the fence as the third man is inside the circle. 21:19 (IST)IPL 2022 CSK vs DC After 19 overs,Chennai Super Kings 199/4 ( MS Dhoni (C) (W) 17 , Moeen Ali 5)SIX! Back of the length once again, going away from the right-hander and MS Dhoni throws the bat on it to get another maximum towards long off. The fielder made a valiant effort diving to his left after covering a good ground but couldn't grab the ball. 21:15 (IST)IPL 2022 CSK vs DC  FOUR! Short one from Khaleel and Moeen Ali pulls that and gets a boundary towards deep fine leg.21:13 (IST)IPL 2022 CSK vs DC  WICKET! Khaleel gets another one. Length ball, outside off, Rayudu goes back into his crease to clear the fence on the off side but miscues his stroke and Axar Patel completes a good running catch towards his left in the deep. 21:12 (IST)IPL 2022 CSK vs DC  FOUR! Full and wide from Khaleel and Rayudu gets a boundary behind the square on off.  Chennai Super Kings vs Delhi Capitals HIGHLIGHTS - Tata IPL 2022 CSK vs DC cricket score, 55th IPL Match HIGHLIGHTS: That's the end of the match. Bravo deceives Khaleel with his pace as he bowls a slow yorker and it disturbs the woodwork behind. CSK win by 91 runs.PREVIEW: Defending champions Chennai Super Kings had their playoffs hopes dashed in their last contest against Royal Challengers Bangalore. The Chennai-based franchise will be hoping to salvage their campaign and win their remaining games when they encounter a confident Delhi Capitals on Sunday.Delhi Capitals are currently placed fifth in the points table, with 10 points in 10 games. They come into this match after their 21-run win over Sunrisers Hyderabad in their last outing. The Rishabh Pant-lead team need to be wary of Chennai. While MS Dhoni's side is all but out of contention, they would still want to spoil the party of several other teams.Barring David Warner, none of other Delhi batters have been as consistent. Time has come for captain Rishabh Pant and Mitchell Marsh to convert starts into substantial scores. The form of Rovman Powell will give them a lot of confidence heading into this match.When will the Chennai Super Kings and Delhi Capitals match be played?The CSK vs DC IPL 2022 match will take place on 8 May.Where will the Chennai Super Kings and Delhi Capitals match be held?The CSK vs DC IPL 2022 match will be held at DY Patil Stadium in Mumbai.What time will the Chennai Super Kings and Delhi Capitals match start?The CSK vs DC IPL 2022 match will start at 7:30 pm. The toss will be held at 7 pm.Where can you watch CSK vs DC IPL 2022 match on TV and online?The CSK vs DC IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The CSK vs DC match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the CSK vs DC IPL 2022 match.Complete Squads:Chennai Super Kings: MS Dhoni (Captain), Ravindra Jadeja Moeen Ali, Mitchell Santner, Ruturaj Gaikwad, Dwayne Bravo, Ambati Rayadu, Robin Uthappa, Chris Jordan, Adam Milne, Devon Conway, Shivam Dube, Maheesh Theekshana, Dwaine Pretorius, Rajvardhan Hangargekar, Tushar Deshpande, KM Asif, C Hari Nishaanth, N Jagadeesan, Subranshu Senapati, K Bhagath Verma, Prashant Solanki, Simarjeet Singh, Mukesh Choudhary.Delhi Capitals: Rishabh Pant (Captain), Ashwin Hebbar, David Warner, Mandeep Singh, Prithvi Shaw, Rovman Powell, Anrich Nortje, Khaleel Ahmed, Kuldeep Yadav, Chetan Sakariya, Lungi Ngidi, Mustafizur Rahman, Shardul Thakur, Axar Patel, Kamlesh Nagarkoti, Lalit Yadav, Yash Dhull, Mitchell Marsh, Pravin Dubey, Ripal Patel, Sarfaraz Khan, Vicky Ostwal, KS Bharat and Tim Seifert.Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-08 17:54:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/CSK-vs-DC-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs DC LIVE Cricket Score, Match 55: Chennai Super Kings Beat Delhi Capitals By 91 Runs - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LmluZGlhLmNvbS9zcG9ydHMvaGlnaGxpZ2h0cy1pcGwtMjAyMi1jc2stdnMtZGMtbWF0Y2gtNTUtY2hlbm5haS1zdXBlci1raW5ncy1iZWF0LWRlbGhpLWNhcGl0YWxzLWJ5LTkxLXJ1bnMtNTM4MDQwNS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs DC LIVE Cricket Score, Match 55: Chennai Super Kings Beat Delhi Capitals By 91 Runs  India.comDelhi Capitals in isolation after another positive Covid case in camp | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 LIVE: CSK vs DC LIVE | Preview LIVE | MS Dhoni | Rishabh Pant | Mustafizur Rahman  NEWS9 liveSuper Kings-Capitals match on schedule after rest of Capitals contingent returns negative tests  ESPNcricinfoPrithvi Shaw admitted to hospital with high fever, tests negative for Covid-19  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-08 17:51:42","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs DC LIVE Cricket Score, Match 55: Chennai on Top; Delhi Capitals Reeling - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi3wFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtY3JpY2tldC1zY29yZS1jc2stdnMtZGMtaXBsLW1hdGNoLTU1LXVwZGF0ZXMtZHktcGF0aWwtY2hlbm5haS1zdXBlci1raW5ncy1kZWxoaS1jYXBpdGFscy1saXZlLXN0cmVhbWluZy1ob3RzdGFyLWJhbGwtYnktYmFsbC1jb21tZW50YXJ5LXBhbnQtbWFyc2gtc2ltYXJqZWV0LXRoZWVrc2hhbmEtbXVrZXNoLWJyYXZvLTUzODA0MDUv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs DC LIVE Cricket Score, Match 55: Chennai on Top; Delhi Capitals Reeling  India.comDelhi Capitals in isolation after another positive Covid case in camp | Cricbuzz.com - Cricbuzz  CricbuzzSuper Kings-Capitals match on schedule after rest of Capitals contingent returns negative tests  ESPNcricinfoIPL 2022 LIVE: CSK vs DC LIVE | Preview LIVE | MS Dhoni | Rishabh Pant | Mustafizur Rahman  NEWS9 liveDelhi Capitals’ Prithvi Shaw admitted to Mumbai hospital due to high fever  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-05-08 17:02:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Most runs for CSK in IPL 2022: Highest runs in IPL 2022 for Chennai Super Kings","link":"https://thesportsrush.com/cricket-news-most-runs-for-csk-in-ipl-2022-highest-runs-in-ipl-2022-for-chennai-super-kings/","keywords":["Cricket","CSK","Delhi Capitals","IPL 2022","chennai super kings","csk","DC","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Most runs for CSK: Chennai Super Kings have put on board another 200+ innings total in Indian Premier League 2022. Defending champions Chennai Super Kings batted in a manner they are commonly known for in Indian Premier League 2022 match against Delhi Capitals at the Dr DY Patil Sports Academy tonight. Invited to bat first… The post Most runs for CSK in IPL 2022: Highest runs in IPL 2022 for Chennai Super Kings appeared first on The SportsRush.","content":"Most runs for CSK: Chennai Super Kings have put on board another 200+ innings total in Indian Premier League 2022. Defending champions Chennai Super Kings batted in a manner they are commonly known for in Indian Premier League 2022 match against Delhi Capitals at the Dr DY Patil Sports Academy tonight. Invited to bat first by Delhi captain Rishabh Pant, Chennai thrived on the back of a 110-run opening partnership between Ruturaj Gaikwad (41) and Devon Conway (87). While the two highest IPL 2022 partnerships also belong to CSK, their batters also have two entries in Top Five IPL 2022 opening partnerships. As a result, Gaikwad strengthened his position at the top of the list among highest run-scorers for Super Kings. Conway, on the other hand, has reached to the fourth position despite playing only four matches this season thus far. Having already scored three half-centuries, Conway already has the most half-centuries for his team in IPL 2022. All-rounder Shivam Dube, who had been their top run-scorer this season for a long while before being left out for a couple of matches, scored a hard-hitting 32 (19) to surpass batter Ambati Rayudu (5) to reach the second spot. Chennai, who are at the penultimate position on the points table, have won just three and lost seven matches this season. Although their overall performance hasn’t been up to the mark, CSK have managed to score the maximum 200+ innings total in this season. While Mahendra Singh Dhoni and his men have crossed the 200-run mark on four occasions, both Capitals and Rajasthan Royals have done the same thrice this season. Most runs for CSK in IPL 2022 Devon Conway’s a good starter. Runs scored in first five matches of four different types of cricket: Test: 223, 83, 73, 135, 109 ODI: 27, 72, 126, TBC, TBC T20I: 41, 65*, 5, 63, 99* IPL: 3, 85*, 56, 87, TBC That’s 1,352 runs in 21 innings – or 64 runs an innings. — Michael Appleton (@michelappleton) May 8, 2022 Batter Matches Runs Highest Average SR 100 50 Ruturaj Gaikwad 11 306 99 27.81 133.04 0 2 Shivam Dube 9 279 95* 34.87 160.34 0 2 Ambati Rayudu 11 261 78 29 127.94 0 1 Devon Conway 4 231 87 77 155.03 0 3 Robin Uthappa 11 229 88 22.9 138.78 0 2 The post Most runs for CSK in IPL 2022: Highest runs in IPL 2022 for Chennai Super Kings appeared first on The SportsRush.","pubDate":"2022-05-08 16:51:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KSCA awards top performers, teams from last three seasons","link":"https://sportstar.thehindu.com/cricket/ksca-awards-top-performers-teams-from-last-three-seasons/article38486508.ece","keywords":null,"creator":["Ashwin Achal"],"video_url":null,"description":"The top performers and teams from across the State were honoured at the Karnataka State Cricket Association (KSCA) annual awards function at M. Chinnaswamy Stadium.","content":"The top performers and teams from across the State were honoured at the Karnataka State Cricket Association (KSCA) annual awards function at M. Chinnaswamy Stadium here on Sunday. KSCA Secretary Santosh Menon stated that Karnataka is a preferred destination when it comes to hosting matches. “The BCCI does not look beyond Karnataka and Bengaluru when it comes to hosting matches. This is especially true for Bengaluru, which is the only city in the country to have five First-Class grounds,” Santosh said. Santosh made special mention of the grounds persons, who worked tirelessly through tough conditions. “The biggest challenge we faced was the upkeep of our grounds during the COVID-19 pandemic. Our grounds persons were up to the challenge. We must thank them for risking their lives and working on our grounds,\" Santosh said. The awardees: 2021-22: Inter-Club tournament: U-14: Highest Run Getter: Atharv Malviya (Vultures) Highest Wicket Taker: Bhuvan Shivkumar (Vultures) Winner: Dooravani Cricketers (1) U-16: Highest Run Getter: M.B. Shivam (Swastic Union 2) Highest Wicket Taker: K.P. Karthikeya (Vultures) Winner: Swastic Union 2 U-19: Highest Run Getter: P. Dhruv (Vijaya) Highest Wicket Taker: Dheeraj Gowda (Century Cricketers) Winner: Vijaya CC Inter-zonal tournament: U-16: Highest Run Getter: Ravi Kairav (Vice President’s XI) Highest Wicket Taker: Pranav Aswath (President’s XI) U-19: Highest Run Getter: Vijaya Raj (Raichur Zone) Highest Wicket Taker: Sufiyan Sharief (Bangalore City XI) U-25 S.A. Srinivasan Memorial tournament: Highest Run Getter: L.R. Chethan (Mysore Zone) Highest Wicket Taker: Rohith Kumar (Dharwad Zone) League: Group I, V Division: Highest Run Getter: M.B. Basavaraj (Seshadripuram PUC) Highest Wicket Taker: Prathap (Jaidur Cricketers) Winner: Lions CC Group I, IV Division: Highest Run Getter: Naveen Shankara (Duleep Cricketers) Highest Wicket Taker: Pradeep Kumar (Sparklers) Winner: Vikram CC Group I, III Division: Highest Run Getter: K. Gagandeep (Hanumanthnagar) Highest Wicket Taker: B. Vineeth (Dooravani Cricketers 1) Winner: Hanumanthnagar CC Group I, II Division: Highest Run Getter: Kruthik Krishna (Jawahar 1) Highest Wicket Taker: Aditya Mani (Herons) Winner: Jawahar SC 1 Group I, I Division: Highest Run Getter: Mohammed Aqib (Modern) Highest Wicket Taker: Shreyas Gopal (Swastic Union 1) Winner: Rajajinagar Cricketers Inter-Club T20 tournament: Highest Run Getter: B.R. Sharath (Mount Joy) Highest Wicket Taker: Nischith Rao (Rajajinagar Cricketers) Winner: Social Cricketers Special awards: BCCI - Under-19 Women’s One Day Trophy: Highest Run Getter: G.R. Prerana Highest Wicket Taker: Chandasi Krishnamurthy BCCI - Senior Women’s One Day Trophy: Highest Run Getter: Vrinda Dinesh Highest Wicket Taker: V. Chandu BCCI - Senior Women’s T-20 Trophy: Highest Run Getter: Shubha Satheesh Highest Wicket Taker: V. Chandu BCCI - Under-19 Men’s Vinoo Mankad Trophy (One Day): Highest Run Getter: Aneeshwar Gautam Highest Wicket Taker: Dhanush Gowda BCCI - Under-19 Men’s Cooch-Behar Trophy (Multi Day): Highest Run Getter: Vishal Onat Highest Wicket Taker: K. Shashikumar BCCI – Under 25 Men’s One Day Trophy: Highest Run Getter: K.V. Aneesh Highest Wicket Taker: M. Venkatesh BCCI - Under-25 Men’s Col.C.K. Nayudu Trophy (Multi Day): Highest Run Getter: Kishan Bedare Highest Wicket Taker: Rohit Kumar BCCI - Vijay Hazare Trophy: Highest Run Getter: R. Samarth Highest Wicket Taker: Pravin Dubey BCCI - Syed Mushtaq Ali Trophy: Highest Run Getter: Manish Pandey Highest Wicket Taker: K.C. Cariappa —- 2020-21: Y.S. Ramaswamy Memorial tournament: Highest Run Getter: Nihal Ullal (Rajajinagar Cricketers) Highest Wicket Taker: Vidyadhar Patil (Vijaya) Winner: Vultures Inter-Club T20 tournament: Highest Run Getter: S.M. Rajkumar (Jawahar 1) Highest Wicket Taker: Kushal Pramesh (The Bangalore Cricketers) Winner: Vultures Inter-club tournament: U-16: Highest Run Getter: Srujan Nandan (Swastic Union 1) Highest Wicket Taker: Ansh Aima (Vultures) Winner: Swastic Union 2 U-19: Highest Run Getter: R. Smaran (Vultures) Highest Wicket Taker: Jay Desai (Vijaya) Winner: Vijaya CC Under-19 Inter-Zonal tournament: Highest Run Getter: N.A. Chinmay (Bangalore Zone) Highest Wicket Taker: K. Gaurav (Moffusil XI) U-23 S.A. Srinivasan Memorial tournament: Highest Run Getter: Lochan Appanna (President’s XI) Highest Wicket Taker: S. Punith (President’s XI) Special awards: BCCI - Senior Women’s One Day Trophy: Highest Run Getter: Shubha Satheesh Highest Wicket Taker: V. Chandu BCCI - Vijay Hazare Trophy: Highest Run Getter: Devdutt Padikkal Highest Wicket Taker: Prasidh Krishna BCCI - Syed Mushtaq Ali Trophy: Highest Run Getter: Devdutt Padikkal Highest Wicket Taker: J. Suchith","pubDate":"2022-05-08 16:40:35","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Suddenly MS Dhoni became captain: Yuvraj Singh on why he could not lead Indian cricket team","link":"https://zeenews.india.com/cricket/suddenly-ms-dhoni-became-captain-yuvraj-singh-blames-greg-chappell-controversy-for-not-becoming-india-captain-2461582.html","keywords":null,"creator":null,"video_url":null,"description":"Yuvraj scored over 10,000 runs in international cricket and over 2500 runs in IPL.","content":"Yuvraj Singh retired as one of the all-time greats of the Indian cricket team. The left-handed batter scored over 10,000 runs in international cricket and over 2500 runs in IPL. He was the Player of the Series in ICC ODI World Cup 2011, scoring over 300 run and picking over 10 wickets as well. However, Yuvraj still has one regret and that is not leading the Indian men's cricket team. In an interview to News18, he made a big statement, saying that he was supposed to lead India but the Greg Chappell incident changed everything and MS Dhoni was handed over the captaincy suddenly. Overwhelmed to share my journey as a father on this Mother's Day. I believe the best thing we can do for mommies is to be an equal partner in parenting. Be it diapering or feeding, I was always learning but @hazelkeech was just perfect. _ pic.twitter.com/sjLFItEU6H — Yuvraj Singh (@YUVSTRONG12) May 8, 2022 \"I was supposed to be the captain. Then the Greg Chappell incident happened. It had become Chappell or Sachin. I was probably the only player who supported…that I support my teammate. And there were a lot of people in the…Some of the BCCI officials did not like that. It was said that they should make anybody the captain but not myself. This is what I heard,” Yuvraj said. Not to forget, the Greg Chappell contorversy had rocked the Indian cricket and it had made two factions within the team. It led to India's dismal performance in 2007 ODI World Cup when they were ousted in only the first stage of the tournament. Yuvraj said that with Rahul Dravid, Sourav Ganguly and Sachin Tendulkar opting out of maiden T20 World Cup in South Africa, he was the front-runner to lead India in the mega event but Dhoni was suddenly made the skipper. \"I am not sure how true it is. Suddenly from vice-captaincy I was removed. Sehwag was not there in the team. So, out of nowhere, Mahi (MS Dhoni) became captain for the 2007 T20 World Cup. I thought I was going to be the captain,\" he added.","pubDate":"2022-05-08 14:58:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Faf du Plessis Fifty, Wanindu Hasaranga 5-Wicket Haul Set Up RCB's Thrashing Of SRH - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9zcmgtdnMtcmNiLWZhZi1kdS1wbGVzc2lzLWZpZnR5LXdhbmluZHUtaGFzYXJhbmdhLTUtd2lja2V0LWhhdWwtc2V0LXVwLXJjYnMtdGhyYXNoaW5nLW9mLXNyaC0yOTU3MjIx0gGLAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL3NyaC12cy1yY2ItZmFmLWR1LXBsZXNzaXMtZmlmdHktd2FuaW5kdS1oYXNhcmFuZ2EtNS13aWNrZXQtaGF1bC1zZXQtdXAtcmNicy10aHJhc2hpbmctb2Ytc3JoLTI5NTcyMjEvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Faf du Plessis Fifty, Wanindu Hasaranga 5-Wicket Haul Set Up RCB's Thrashing Of SRH  NDTV SportsSRH vs RCB, Go Green Game: Preview | IPL 2022  Royal Challengers BangaloreVirat Kohli's poor form continues as he falls for third golden duck in IPL  DAWN.comLive Cricket Score - SRH vs RCB, Match 54, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022: Hasaranga’s five-wicket haul seals Bangalore’s crushing 67-run win over Hyderabad  Gulf NewsView Full coverage on Google News","content":null,"pubDate":"2022-05-08 14:42:03","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Delhi Capitals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-delhi-capitals-live-score-over-match-55-t20-6-10-updates-2957181","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Delhi Capitals from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.2 overs, Chennai Super Kings are 105/0. The live updates of Chennai Super Kings vs Delhi Capitals scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Chennai Super Kings vs Delhi Capitals, Chennai Super Kings vs Delhi Capitals live score, Chennai Super Kings vs Delhi Capitals scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (4 Runs) FOUR! A hat-trick of boundaries from Devon Conway to end the over and at the halfway mark, Chennai are flying with 100/0! This is tossed up, outside off, Conway hangs deep and smashes it over the cover region for another boundary. 9.5 overs (4 Runs) FOUR! Yadav goes quicker and tries to bowl the arm ball but gets smashed again. Full and around off, driven hard and along the ground, through extra cover for another boundary. 9.4 overs (4 Runs) FOUR! This was a hit-me ball from Kuldeep Yadav. Floated up, outside off, Conway creams it over the cover region and picks up a boundary. 9.4 overs (1 Run) WIDE! This is spilled well down the leg side, wided. 9.3 overs (1 Run) On middle, Ruturaj Gaikwad plays the reverse sweeps this time and connects well but Anrich Nortje at short fine leg makes a good diving stop. Just a single taken. 9.2 overs (1 Run) Outside off and turning away, Devon Conway waits for it and cuts it past point for another single. 9.1 overs (1 Run) Yadav sees Gaikwad giving the charge and spears it into middle. Gaikwad almost gets yorked as he jams it towards mid off for a single. 8.6 overs (0 Run) A bit of a yes and no in the middle but the batters avoid the run-out. Flatter, on off, Conway taps it towards short mid-wicket and Gaikwad wants the single. Axar is quick to get to the ball and Conway sends his partner back in time. 8.5 overs (1 Run) On middle, Gaikwad comes down the track and gets it off the inner half of the blade towards mid-wicket for one more. 8.4 overs (1 Run) Third fifty on the trot for Devon Conway and he has been like a breath of fresh air for Chennai. This is pushed wider and Conway drives through the line towards deep point for a run. 8.3 overs (1 Run) Quicker and flatter, around off. This is dabbed down to backward point for a quick single. 8.2 overs (1 Run) Axar slides it outside the off stump and Conway slaps it to the man at deep cover for one more. Conway moves on to 49 now. 8.1 overs (1 Run) Shorter, fired into middle, Gaikwad pulls it through mid-wicket to turn the strike over. 7.6 overs (4 Runs) FOUR! Full and wide, Conway with a powerful drive through the cover region and he picks up another boundary. 18 runs come off Kuldeep Yadav's first over. 7.5 overs (6 Runs) SIX! Swept away for another maximum! On middle, Conway gets low and sweeps it flat and hard over the square leg fence. He is in the groove now. 7.4 overs (6 Runs) SIX! Had to reach for it Devon Conway but goes through with the shot and gets maximum purchase. Tossed up, around off, Conway steps out and launches it over the wide long on fence for a bigge. 7.3 overs (1 Run) On off, driven down to long off for a single. 7.2 overs (0 Run) Now, was there an edge on it? Yes, there was but almost an impossible one for the keeper to pouch that one. This is pushed through quicker and angled across the right-hander. Ruturaj Gaikwad looks to cut but gets a huge deflection that hits Pant on the gloves. 7.1 overs (1 Run) Kuldeep starts off with a looped-up delivery on off. Conway hangs back and punches it down to long on for a single. Strategic break! Devon Conway and Ruturaj Gaikwad have got Chennai off to a flier. They have been attacking the bad deliveries and are rotating the strike well. It's been sensational batting from the openers so far. Delhi will need to break this partnership at the earliest and not let them get away. Also, Kuldeep Yadav comes into the attack. 6.6 overs (0 Run) Axar sees Gaikwad coming down the track and slides it into the pads. Gaikwad tries to cover drive but gets an inside edge onto the pads. Good comeback over from Axar, just four singles off it. 6.5 overs (1 Run) A tad shorter, around off. Conway fetches it and sweeps it hard towards the backward square leg fence for just a single. 6.4 overs (1 Run) On middle, pushed down to long on for a run. 6.3 overs (0 Run) A bit flatter this time, angled into leg stump. Gaikwad fails to get it away leg side. 6.2 overs (1 Run) Slower through the air and on a length, Conway wrists it towards the mid-wicket region for one more. 6.1 overs (1 Run) Axar slides this one onto the pads and Gaikwad just works it through mid-wicket for a single. 5.6 overs (1 Run) Three consecutive 50-run plus stands for the Chennai openers and they are off to a flier. At the end of the Powerplay, Chennai are 57/0! Slower one, on middle, turned through mid on for a run. 5.5 overs (4 Runs) FOUR! This is even better from Gaikwad. Thakur pitches it up right in the slot and Gaikwad just lifts it back over his head for back-to-back boundaries. 5.4 overs (4 Runs) FOUR! Up and over, intentional from Ruturaj Gaikwad. This is floated up outside off and Gaikwad lofts it over the cover region and picks up a boundary. The fifty is up for Chennai. 5.3 overs (1 Run) Delhi are allowing these two to just rotate the strike with utmost ease. Over middle, tucked away to mid-wicket by Conway for one. 5.2 overs (1 Run) Easy single! Around off, Gaikwad nudges it down with soft hands towards the cover region and rotates the strike. 5.1 overs (1 Run) Perfect length, around the top of off. Conway stands tall and punches it to deep cover for a single. 5.1 overs (2 Runs) TWO WIDES! Thakur comes back into the attack and just digs one in around off stump. The ball flies off the surface and Pant just about manages to get a glove on it. A wide is called and the batters are able to scamper through as well.","pubDate":"2022-05-08 14:33:42","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637876370120477996.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, CSK vs DC LIVE Cricket Score, Match 55: Devon Conway, Ruturaj Gaikwad Steady For Chennai - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi5gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtY3JpY2tldC1zY29yZS1jc2stdnMtZGMtaXBsLW1hdGNoLTU1LXVwZGF0ZXMtZHktcGF0aWwtY2hlbm5haS1zdXBlci1raW5ncy1kZWxoaS1jYXBpdGFscy1saXZlLXN0cmVhbWluZy1ob3RzdGFyLWJhbGwtYnktYmFsbC1jb21tZW50YXJ5LWdhaWt3YWQtY29ud2F5LXNoYXJkdWwta3VsZGVlcC1ub3J0amUta2hhbGVlbC1wYXRlbC01MzgwNDA1L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, CSK vs DC LIVE Cricket Score, Match 55: Devon Conway, Ruturaj Gaikwad Steady For Chennai  India.comDelhi Capitals in isolation after another positive Covid case in camp | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 LIVE: CSK vs DC LIVE | Preview LIVE | MS Dhoni | Rishabh Pant | Mustafizur Rahman  NEWS9 liveQuestions over CSK-DC clash after Capitals member reportedly tests positive for Covid-19  ESPNcricinfoIPL 2022: Prithvi Shaw Says Admitted To Hospital With Fever, Shares Pic  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-05-08 14:33:42","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 KKR vs MI Live Streaming: Kolkata Knight Riders vs Mumbai Indians Live Coverage, venue, date, timing","link":"https://www.firstpost.com/firstcricket/sports-news/tata-ipl-2022-kkr-vs-mi-live-streaming-kolkata-knight-riders-vs-mumbai-indians-live-coverage-venue-date-timing-10648331.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Tata IPL 2022 KKR vs MI Live Streaming: Kolkata Knight Riders vs Mumbai Indians Live Coverage, venue, date, timing","content":"Kolkata Knight Riders will take on Mumbai Indians in Match 56 of the IPL 2022 at the DY Patil Stadium in Mumbai on Monday (May 9).The Shreyas Iyer-led KKR come into this match after a 75-run drubbing at the hands of table-toppers Lucknow Super Giants and will look to bounce back.KKR's huge margin of defeat in their last game has left them with eight points from 11 games. They have three matches left and the maximum they can reach is 14 points, which is again something that cannot guarantee even a fourth-place finish.Mumbai Indians, on the other hand, have won two back-to-back games against Rajasthan Royals and Gujarat Titans and will aim to register their third victory of the tournament.MI have already been eliminated from the race to the playoffs as they have just four points from 10 matches and even if they win all their remaining games, the five-time champions can reach only 12 points, far from what is needed to advance to the next stage.When will the Kolkata Knight Riders and Mumbai Indians match be played?The KKR vs MI IPL 2022 match will take place on 9 May.Where will the Kolkata Knight Riders and Mumbai Indians match be held?The KKR vs MI IPL 2022 match will be held at DY Patil Stadium in Mumbai.What time will the Kolkata Knight Riders and Mumbai Indians match start?The KKR vs MI IPL 2022 match will start at 7:30 pm. The toss will take place at 7 pm.Where can you watch Kolkata Knight Riders vs Mumbai Indians IPL 2022 match on TV and online?The KKR vs MI IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The KKR vs MI match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the KKR vs MI IPL 2022 match.Squads:Kolkata Knight Riders: Aaron Finch, Abhijeet Tomar, Ajinkya Rahane, Baba Indrajith, Nitish Rana, Pratham Singh, Rinku Singh, Shreyas Iyer (c), Ashok Sharma, Pat Cummins, Rasikh Dar, Shivam Mavi, Tim Southee, Umesh Yadav, Varun Chakaravarthy, Aman Khan, Andre Russell, Anukul Roy, Chamika Karunaratne, Mohammed Nabi, Ramesh Kumar, Sunil Narine, Venkatesh Iyer, Sam Billings, Sheldon Jackson.Mumbai Indians: Rohit Sharma (c), Anmolpreet Singh, Rahul Buddhi, Ramandeep Singh, SuryakumarYadav, Tilak Verma, Tim David, Arjun Tendulkar, Basil Thampi, Hrithik Shokeen, Jasprit Bumrah, Jaydev Unadkat, Jofra Archer, Mayank Markande, Murugan Ashwin, Riley Meredith, Tymal Mills, Kartikeya Singh, Daniel Sams, Dewald Brevis, Fabian Allen, Kieron Pollard, Sanjay Yadav, Aryan Juyal and Ishan Kishan.Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-08 14:19:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/KKr640-6.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: SRH remain sixth after fourth loss in a row","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-points-table-orange-cap-and-purple-cap-latest-table-today-srh-remain-sixth-after-fourth-loss-in-a-row-10447751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 Points Table, Orange Cap and Purple Cap Latest Table Today: SRH remain sixth after fourth loss in a row","content":"IPL 2022 has in store new teams, changed squad line-ups and a different format. But that will not necessarily impact the point system.This year the format is going to be a little different, wherein the 10 teams will be split into two groups - Group A and B.Group A - Mumbai Indians, Kolkata Knight Riders, Rajasthan Royals, Delhi Capitals, Lucknow Super GiantsGroup B - Chennai Super Kings, Sunrisers Hyderabad, Royal Challengers Bangalore, Punjab Kings, Gujarat TitansNow, within the groups, each team will play each other twice, as well as twice against the team in the same row from the other group. Then each team from every group will play against all the other teams in the other group once. That brings it to a total of 14 (8 + 5 + 1) matches for all teams.On Wednesday, RCB got back to winning ways by beating CSK by 13 runs to go fourth on the points table.Here's the list of current Orange and Purple Cap holders:Orange Cap holder: Jos Buttler (RR) - 618 runsPurple Cap holder: Yuzvendra Chahal (RR) - 22 wicketsHere's the latest updated IPL 2022 league table: PositionTeamMatchesWonLostNRNet RRPoints1LSG11830 +0.703162GT11830+0.120163RR11740+0.326144RCB12750-0.115145DC10550+0.641106SRH11560-0.031107PBKS11560-0.231108KKR11470-0.30489CSK10370-0.431610MI10280-0.7254Click here to view the full Orange Cap standingsClick here to view the full Purple Cap standings Click here to read Factboxes of all teamsClick here to follow comprehensive coverage of IPL 2022Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-08 14:16:31","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/02/IPL-Trophy-640-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Highlights, Tata IPL 2022 SRH vs RCB, Full Cricket Score and Update: Hasaranga's five-fer helps RCB thrash SRH by 67 runs - Firstpost - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMitgFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLXRhdGEtaXBsLTIwMjItc3JoLXZzLXJjYi1mdWxsLWNyaWNrZXQtc2NvcmUtYW5kLXVwZGF0ZS1oYXNhcmFuZ2FzLWZpdmUtZmVyLWhlbHBzLXJjYi10aHJhc2gtc3JoLWJ5LTY3LXJ1bnMtMTA2NDQyMjEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, Tata IPL 2022 SRH vs RCB, Full Cricket Score and Update: Hasaranga's five-fer helps RCB thrash SRH by 67 runs - Firstpost  FirstpostSRH vs RCB, Go Green Game: Preview | IPL 2022  Royal Challengers BangaloreSRH vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorSRH vs RCB IPL 2022 Highlights: Hasaranga fifer powers Bangalore to massive win  Hindustan TimesVirat Kohli's poor form continues as he falls for third golden duck in IPL  DAWN.comView Full coverage on Google News","content":null,"pubDate":"2022-05-08 14:08:59","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Chennai Super Kings vs Delhi Capitals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/chennai-super-kings-vs-delhi-capitals-live-score-over-match-55-t20-1-5-updates-2957034","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Chennai Super Kings vs Delhi Capitals from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Chennai Super Kings are 46/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Chennai Super Kings and Delhi Capitals. Everything related to Chennai Super Kings and Delhi Capitals match will be available on Sports.NDTV.com . Stay updated with Chennai Super Kings vs Delhi Capitals live score. Do check for Chennai Super Kings vs Delhi Capitals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (6 Runs) Six! 4.5 overs (6 Runs) SIX! Up and over! Fuller delivery, around middle. Devon Conway dances down the pitch and tonks it over the bowler's head for a biggie. 4.4 overs (1 Run) Fuller ball, around middle and leg. Ruturaj Gaikwad steps down the track and works it away through mid-wicket for a single. 4.3 overs (0 Run) Tad shorter, around middle and off. Ruturaj Gaikwad taps it towards cover. He wanted a single there, but he is sent back on time. 4.2 overs (1 Run) Fuller again, outside off. Devon Conway gets down on his knee and he reverse-sweeps this one. Mitchell Marsh at short third man dives to his left and makes a good stop. Single taken! 4.1 overs (0 Run) Axar Patel begins with a fuller ball, spinning away a tad, around off. Devon Conway blocks it out. Spin for the first time as Axar Patel comes into the attack now. 3.6 overs (1 Run) Quick single! Full in length now, around middle. Devon Conway pushes it gently towards mid on and scampers across to the other end. He retains the strike. 3.5 overs (1 Run) On a length, outside off. Ruturaj Gaikwad dabs it towards third man and rotates the strike. 3.4 overs (1 Run) Shorter ball, around off. Devon Conway picks up the length and pulls it to the fielder at deep square leg for a run. 3.3 overs (1 Run) Swinging in around off, a length delivery. Ruturaj Gaikwad steers it towards third man off the back foot. Single! 3.2 overs (1 Run) Tad fuller, around middle and leg. Devon Conway pushes it with the inner half of his bat towards mid on and takes a quick run. 3.1 overs (0 Run) Angling in, on a length, around middle and leg. Devon Conway looks to flick this but he misses and gets hit high on his pad. 2.6 overs (0 Run) Outside off, fuller ball. Ruturaj Gaikwad lunges and drives it to the fielder at cover. Dot to end the over! 2.5 overs (1 Run) Pitched it up now, outside off. Devon Conway presses forward and drives it towards deep point for a single. 2.4 overs (1 Run) Marginally short, width on offer this time. Ruturaj Gaikwad hangs back and pushes it past backward point. Single taken! 2.3 overs (1 Run) Another good-length delivery from over the wicket now, outside off. Devon Conway dabs it towards cover for a single. 2.2 overs (4 Runs) FOUR! Devon Conway takes full advantage of the Free Hit! Not the best ball to bowl though! A length ball from 'round the wicket, down the leg side. Devon Conway flicks it fine towards fine leg for a boundary. 2.2 overs (2 Runs) No ball! Outside off, tad shorter. Ruturaj Gaikwad slashes it through cover for a single. Anrich Nortje has overstepped here and a no ball is called! Free Hit coming up! 2.1 overs (6 Runs) SIX! BANG! Ruturaj Gaikwad takes on Anrich Nortje straighaway, Brilliant use of the feet! Touch fuller, around middle. Ruturaj Gaikwad shimmmies down the pitch and smashes it over long on for a biggie. Early change in the bowling as Anrich Nortje is brought into the attack. 1.6 overs (1 Run) Angling in, on a length, on the pads. Ruturaj Gaikwad tucks it towards square leg and takes a single. A tidy start from Khaleel Ahmed! 1.5 overs (1 Run) Shorter this time, around middle and leg. Devon Conway swivels and pulls it towards deep square leg. Single taken. 1.4 overs (0 Run) Good-length delivery, outside off. Devon Conway blocks it out towards cover. No run taken! 1.3 overs (1 Run) Lands it on a length, around middle and off. Ruturaj Gaikwad taps it towards cover off the back foot and scampers across to the other end. 1.2 overs (0 Run) Back of a length, outside off. Ruturaj Gaikwad miscues his pull it straight to the fielder at mid-wicket. He probably missed out on that one. 1.1 overs (0 Run) On a length, outside off, swinging away. Ruturaj Gaikwad lets that go through to the keeper. 1.1 overs (1 Run) Wide! A good-length ball, down the leg side. Ruturaj Gaikwad looks to flick this but he misses. Wide given! Khaleel Ahmed to share the new ball with Shardul Thakur. 0.6 over (0 Run) Beaten! A good delivery to finish the over! Another length ball, outside off. Devon Conway looks to have a push at it, but he gets beaten on the outside edge. 5 runs off the first over. 0.5 over (0 Run) Good-length delivery, around middle. Devon Conway blocks it out solidly. 0.4 over (0 Run) Pitched up again, outside off. Devon Conway drives it to the fielder at mid off. 0.3 over (4 Runs) FOUR! Devon Conway gets off the mark in style! A fuller ball, darting it on the pads. Devon Conway flicks it past mid-wicket for a boundary. 0.2 over (1 Run) A length ball, outside off. Ruturaj Gaikwad taps it towards point off the back foot. Single taken! Ruturaj Gaikwad and Chennai are up and running! 0.1 over (0 Run) Shardul Thakur begins with a fuller ball, shaping away a tad, around off. Ruturaj Gaikwad pushes it down the ground. No run taken there! We are ready for play! The umpires are out in the middle and so are the players from Delhi. The Chennai openers, Devon Conway and Ruturaj Gaikwad too make their way out to the middle and are ready to take guard. Shardul Thakur to start proceedings with the new ball. Let's play... Also, on a side note, Dwayne Bravo returns to side which MS Dhoni forgot to mention at the toss and he replaces Dwaine Pretorius. MS Dhoni the skipper of Chennai says that they would have bowled first looking at their combination. But toss is not in their control and they are happy to bowl second. Adds that they had a bad season earlier but they had made the most of it and it helped them. Further adds that there have been a few changes after the auction and sometimes they need to find the best combination. Informs that Ravindra Jadeja is not fit and Shivam Dube comes in. Rishabh Pant the skipper of Delhi says that they will have a bowl first because the wicket looks like a good one and 170 looks like a good score to chase. Adds that the season has been a bit of up and down and hopes to continue the momentum from the last game and keep the winning run going. On being asked about MS Dhoni, he says that he has learned a lot from him and hopefully they can get a win over his side. Informs that they have a couple of changes with Axar Patel and Srikar Bharat coming in. Chennai (Playing XI) - Ruturaj Gaikwad, Devon Conway, Robin Uthappa, Ambati Rayudu, Shivam Dube (In for Ravindra Jadeja), MS Dhoni (C/WK), Moeen Ali, Dwayne Bravo (In for Dwaine Pretorius), Mukesh Choudhary, Maheesh Theekshana, Simarjeet Singh. Delhi (Playing XI) - Srikar Bharat (In for Mandeep Singh), David Warner, Mitchell Marsh, Rishabh Pant (C/WK), Rovman Powell, Ripal Patel, Axar Patel (In for Lalit Yadav), Shardul Thakur, Kuldeep Yadav, Anrich Nortje, Khaleel Ahmed. TOSS - Up goes the coin and it lands in favour of Delhi. They have elected to BOWL first. Right now, there's action going on in the first match of Super Sunday, where Bangalore and Hyderabad are battling it out in order to bolster their chances of making it through to the playoffs. You can switch tabs and follow both games as the build for the match between Chennai and Delhi continues. Chennai on the flip side have not been at their best and are virtually knocked out of the tournament. Dwayne Bravo's absence has cost the team and they will be hoping he returns to the side. However, Devon Conway's return has solved their top-order woes. Their chance to seal a spot in the top four might be slim, but they can get over the line and disturb the qualification chances for the other teams. So folks who are you backing today? Stay tuned as we bring to you the toss and other updates. Delhi have been blown hot and cold this season. They have been winning alternative games for the past few matches. They have been knocking on the doors for a spot in the playoffs and a victory today will surely help their cause. Prithvi Shaw is likely to miss the game once again due to illness and this could be a concern for them. Hello and a warm welcome to match number 55 between Chennai and Delhi. This game was in doubt due to a couple of Covid cases in Delhi's camp. But thankfully, all the others tested negative and we are ready to witness some action. So, buckle up folks! Get ready for an enticing contest. ... MATCH DAY ...","pubDate":"2022-05-08 13:49:59","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637876343922283047.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Dhoni ducks in IPL: How many times Dhoni duck out in IPL history?","link":"https://thesportsrush.com/cricket-news-dhoni-ducks-in-ipl-how-many-times-dhoni-duck-out-in-ipl-history/","keywords":["Cricket","CSK","IPL 2022","chennai super kings","csk","Indian Premier League","MS Dhoni"],"creator":["Dixit Bhargav"],"video_url":null,"description":"MS Dhoni ducks in IPL: The legendary captain of Chennai Super Kings doesn’t have many ducks in front of his name in the Indian Premier League. Legendary Chennai Super Kings captain Mahendra Singh Dhoni will be in action in less than 30 minutes from now as his team will take on Delhi Capitals at the… The post Dhoni ducks in IPL: How many times Dhoni duck out in IPL history? appeared first on The SportsRush.","content":"MS Dhoni ducks in IPL: The legendary captain of Chennai Super Kings doesn’t have many ducks in front of his name in the Indian Premier League. Legendary Chennai Super Kings captain Mahendra Singh Dhoni will be in action in less than 30 minutes from now as his team will take on Delhi Capitals at the Dr DY Patil Sports Academy in the ongoing 15th season of the Indian Premier League. Defending champions CSK, who are at the penultimate position on the points table on the back of winning three and losing seven out of their 10 matches this season, would want to not lose even an iota of hope with respect to their qualification for the playoffs despite minimal chances of the same. Dhoni, who had kick-started IPL 2022 with a fighting half-century against Kolkata Knight Riders at the Wankhede Stadium, has shown glimpses of his big-hitting skills against Lucknow Super Giants and Mumbai Indians this season. Having said that, him continuing to bat at his preferred position of No. 7 hasn’t provided him with a lot of batting opportunities. As a result, all Dhoni had scored in IPL 2022 are 142 runs at an average and strike rate of 28.40 and 130.27 respectively. It was almost four weeks ago that Dhoni had returned to the pavilion without scoring a run against Royal Challengers Bangalore. However, it wasn’t counted as a quintessential duck as the 40-year old player wasn’t dismissed. Dhoni has registered a similar instance of scoring 0* during an IPL 2020 match against Mumbai at the Sheikh Zayed Cricket Stadium. Apart from these two innings, Dhoni has been dismissed for a duck on only four occasions in the IPL. The aforementioned number is quite low as compared to other IPL greats namely Rohit Sharma (14) and Virat Kohli (9) .","pubDate":"2022-05-08 13:34:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs RCB Live Score Updates: Fifty up for feisty Rahul Tripathi - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiXGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLXNyaC12cy1yY2ItbGl2ZS1zY29yZS11cGRhdGVzLTc5MDYzMTcv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs RCB Live Score Updates: Fifty up for feisty Rahul Tripathi  The Indian ExpressSRH vs RCB, Go Green Game: Preview | IPL 2022  Royal Challengers BangaloreSRH vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Sunrisers vs RCB, Indian Premier League 2022, 54th Match  ESPNcricinfoIPL 2022, SRH vs RCB Live Score: Rahul Tripathi Fifty Keeps SRH Hopes Alive In Massive Chase vs RCB  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-05-08 13:13:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli, Sachin Tendulkar, Yuvraj Singh and other cricketers extend heartfelt wishes on Mother's Day","link":"https://www.firstpost.com/firstcricket/sports-news/virat-kohli-sachin-tendulkar-yuvraj-singh-and-other-cricketers-extend-heartfelt-wishes-on-mothers-day-10647941.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Virat Kohli, Sachin Tendulkar, Yuvraj Singh and other cricketers extend heartfelt wishes on Mother's Day","content":"The second Sunday of May is celebrated as the Mother’s Day around the world every year. To mark the occasion, several cricketers took to their social media handles and posted heartwarming wishes for their mothers.Batting legend Sachin Tendulkar shared a picture of his mother with their cat.“We may have a thousand worries in the world, but our mother’s main worry will still remain whether we’ve had food on time. Such is a mother’s love! Here’s my Aai with our adopted cat. They share a special bond - he has his meals only when Aai is having hers,\" Tendulkar tweeted.We may have a thousand worries in the world, but our mother’s main worry will still remain whether we’ve had food on time. Such is a mother’s love!Here’s my Aai with our adopted cat. They share a special bond - he has his meals only when Aai is having hers #MothersDay pic.twitter.com/2m8jSdm0QD— Sachin Tendulkar (@sachin_rt) May 8, 2022Former India captain Virat Kohli wrote, “A lot of love and happiness to all mother’s (sic). Your strength is unmatched and here’s wishing you a very Happy Mother’s Day\".A lot of love and happiness to all mother's. Your strength is unmatched and here's wishing you a very Happy Mother's Day. — Virat Kohli (@imVkohli) May 8, 2022Here are some of the other tweets from other cricketers:“ਆਣ ਤੋਂ ਪਹਿਲਾ ਮੁਸ਼ਕਿਲਾਂ ਟਲ ਜਾਨਦਿਆਂ ਨੇ ਮੇਰੀ ਮਾਂ ਦੀ ਦੁਆਂਵਾਂ ਚ ਅਸਰ ਇਨਾਂ”ਰਬ ਮਾਵਾਂ ਨੂੰ ਲੰਮੀ ੳਮਰਾਂ ਬਕਸ਼ੇAane se pehle mushkilein tal jaati hain Meri maa ki duaon mein asar itna haiRab maao ko lambi umr de #HappyMothersDay pic.twitter.com/rQwZHPbFSs— Harbhajan Turbanator (@harbhajan_singh) May 8, 2022We celebrate their existence everyday, but even more on this day Happy Mothers’ Day #OrangeArmy #ReadyToRise #TATAIPL pic.twitter.com/Pn8ESTTFiJ — SunRisers Hyderabad (@SunRisers) May 8, 2022Wishing a very Happy Mother’s Day to the two most amazing women in my life ❤️ it takes amazing women to become amazing moms and you both prove this each day! Thank you for always holding everything together @hazelkeech #HappyMothersDay2022 pic.twitter.com/BH8OFlcThb— Yuvraj Singh (@YUVSTRONG12) May 8, 2022Happy Mother’s Day ❤️ pic.twitter.com/lz0vdmTkpA — Ravi Bishnoi (@bishnoi0056) May 8, 2022Wishing you a very Happy #MothersDay Maa , @PriyankaCRaina & all the mother’s out there I feel blessed to be surrounded by such great mothers, you both are a true inspiration for me! Words will never be enough to describe how much I love & admire you both! ❤️ #Lifelines pic.twitter.com/SQRLSWOPGF— Suresh Raina (@ImRaina) May 8, 2022Happy Mother’s Day, Mothers. You are loved and appreciated.#MothersDay — Mpumelelo Mbangwa (@mmbangwa) May 8, 2022Happy Mother’s to our beautiful mothers! Lief julle oneindig baie ❤️ pic.twitter.com/SLBrTbtl04— Marizanne Kapp (@kappie777) May 8, 2022Happy first Mothers Day to my beautiful wife you’re the most incredible mum Rylee could ever ask for, we’re both so lucky. Here’s to all the mums, grandmothers, caretakers and everything else in between - you’re my hero #MothersDay pic.twitter.com/r28wOfx9vk — Megan Schutt (@megan_schutt) May 8, 2022Read all the Latest News, Trending News, Cricket News, IPl Live Score UpdateLatest IPL Schedule 2022 , and , IPl 2022 Points tableEntertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-08 12:32:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Yuvraj640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“DK has to be in the Indian T20 World Cup team”: Michael Vaughan calls for Dinesh Karthik’s comeback into India T20 squad","link":"https://thesportsrush.com/cricket-news-dk-has-to-be-in-the-indian-t20-world-cup-team-michael-vaughan-calls-for-dinesh-karthiks-comeback-into-india-t20-squad/","keywords":["Cricket","IPL 2022","RCB","Sunrisers Hyderabad","dinesh karthik","Indian Premier League","Michael vaughan","Royal Challengers Bangalore","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Michael Vaughan calls for Dinesh Karthik’s comeback: The former English captain wants the veteran Indian wicket-keeper batter to play international cricket again. During the 54th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Royal Challengers Bangalore at the Wankhede Stadium, veteran Royal Challengers Bangalore wicket-keeper batter Dinesh Karthik… The post “DK has to be in the Indian T20 World Cup team”: Michael Vaughan calls for Dinesh Karthik’s comeback into India T20 squad appeared first on The SportsRush.","content":"Michael Vaughan calls for Dinesh Karthik’s comeback: The former English captain wants the veteran Indian wicket-keeper batter to play international cricket again. During the 54th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Royal Challengers Bangalore at the Wankhede Stadium, veteran Royal Challengers Bangalore wicket-keeper batter Dinesh Karthik has played yet another impact-generating innings this season. Coming in to bat at No. 5 in the penultimate over, Karthik’s knock has it in it to be the difference between the two teams. Aided by a reprieve on the boundary by Sunrisers Hyderabad batter Rahul Tripathi, Karthik smashed a four and four sixes in his eight-ball 30*. Having hit a six off Kartik Tyagi in the 19th over, Karthik hit three sixes and a four off debutant Fazalhaq Farooqi to power Bangalore to 192/3 in 20 overs after captain Faf du Plessis (73*) won the toss and chose to bat. Following former captain Virat Kohli’s golden duck , du Plessis and Rajat Patidar (48) put together a rescuing act in the form of a 105-run second-wicket partnership. As far as Karthik is concerned, him scoring 274 runs this season at a strike rate of 200 has resulted in him topping the list of batters with highest strike rate (minimum 75 runs) this season. Former England captain Michael Vaughan is among the many admirers of Karthik for his evolved big-hitting skills this season. Vaughan, who took to social media platform Twitter to suggest a break to Kohli earlier in the day, called for Karthik’s comeback into the T20I squad for the ICC T20 World Cup 2022. DK has to be in the Indian T20 World Cup team .. #IPL2022 🚀🚀🚀 — Michael Vaughan (@MichaelVaughan) May 8, 2022 Karthik, 36, had played the last of his 152 matches for India across formats during the ICC Cricket World Cup 2019. Readers must note that Karthik had publicly expressed a desire of wanting to play the role of a finisher during the ICC T20 World Cup 2020 (later moved to 2022 due to COVID-19) but wasn’t selected in the squad. ALSO READ: Why India shouldn’t have dropped Dinesh Karthik from T20I squad A domestic stalwart on the back of what is a two-decade old career now, Karthik continues to both pile on the runs and grab outstanding catches behind the stumps in domestic cricket for Tamil Nadu.","pubDate":"2022-05-08 12:24:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Prithvi Shaw Says Admitted To Hospital With Fever, Shares Pic - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiZWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL3ByaXRodmktc2hhdy1zYXlzLWFkbWl0dGVkLXRvLWhvc3BpdGFsLXdpdGgtZmV2ZXItc2hhcmVzLXBpYy0yOTU2ODUx0gFraHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvcHJpdGh2aS1zaGF3LXNheXMtYWRtaXR0ZWQtdG8taG9zcGl0YWwtd2l0aC1mZXZlci1zaGFyZXMtcGljLTI5NTY4NTEvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Prithvi Shaw Says Admitted To Hospital With Fever, Shares Pic  NDTV SportsDelhi Capitals in isolation after another positive Covid case in camp | Cricbuzz.com - Cricbuzz  CricbuzzQuestions over CSK-DC clash after Capitals member reportedly tests positive for Covid-19  ESPNcricinfoCSK vs DC, IPL 2022 Live Cricket Score: Prithvi Shaw's Participation in Doubt as Delhi Capitals take on MS  News18Chennai Super Kings vs Delhi Capitals Predictions, Betting Tips & Odds │8 MAY, 2022  Telecom AsiaView Full coverage on Google News","content":null,"pubDate":"2022-05-08 12:17:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK vs DC Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Delhi vs Chennai","link":"https://www.indiatvnews.com/sports/cricket/csk-vs-dc-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-delhi-vs-chennai-2022-05-08-775042","keywords":null,"creator":null,"video_url":null,"description":"CSK vs DC Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Chenna Super Kings vs Delhi Capitals Match Details","content":"Chennai Super Kings vs Delhi Capitals 2022, Match No. 55 Sunday, 7:30 PM DY Patil Sports Academy Rishabh Pant(C), David Warner, Devon Conway, Ruturaj Gaikwad, Robin Uthappa, , Mitchell Marsh, Dwaine Pretorius, , Maheesh Theekshana(VC), Shardul Thakur Ruturaj Gaikwad, Devon Conway, Moeen Ali, Robin Uthappa, , , , Dwayne Pretorious/ , Simarjeet Singh/Shivam Dube, Maheesh Theekshana, Mukesh Choudhary David Warner, Mandeep Singh/Yash Dhull, Mitchell Marsh, Rishabh Pant, Rovman Powell, Lalit Yadav, Axar Patel Shardul Thakur, Anrich Nortje, Kuldeep Yadav, Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). The match will be streamed live on Hotstar Sunday, 8th May 7:30 PM IST DY Patil Sports Academy, Mumbai Ruturaj Gaikwad, Devon Conway, Robin Uthappa, Ambati Rayudu, Moeen Ali, Ravindra Jadeja, MS Dhoni, Dwaine Pretorius, Simarjeet Singh, Maheesh Theekshana, Mukesh Choudhary, Dwayne Bravo, Shivam Dube, , Chris Jordan, Tushar Deshpande, Rajvardhan Hangargekar, Matheesha Pathirana, Bhagath Varma, KM Asif, Prashant Solanki, Subhranshu Senapati, N Jagadeesan, Hari Nishanth Mandeep Singh, David Warner, Mitchell Marsh, Rishabh Pant, Lalit Yadav, Rovman Powell, Ripal Patel, Shardul Thakur, Kuldeep Yadav, Khaleel Ahmed, Anrich Nortje, Axar Patel, , , Chetan Sakariya, Sarfaraz Khan, Tim Seifert, , Ashwin Hebbar, Praveen Dubey, Kamlesh Nagarkoti, Yash Dhull, Vicky Ostwal, Srikar Bharat","pubDate":"2022-05-08 11:24:54","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-royal-challengers-bangalore-live-score-over-match-54-t20-11-15-updates-2956651","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Royal Challengers Bangalore from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Royal Challengers Bangalore are 126/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Royal Challengers Bangalore. Everything related to Sunrisers Hyderabad and Royal Challengers Bangalore match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Royal Challengers Bangalore live score. Do check for Sunrisers Hyderabad vs Royal Challengers Bangalore scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) On middle, pulled away to deep mid-wicket for one more. Despite a boundary, just 7 off the over. 14.5 overs (0 Run) On a length and just outside off. Glenn strokes it to cover. 14.4 overs (4 Runs) FOUR! Much needed! Length ball, on the line of the stumps. Maxwell pre-meditates and pulls it through square leg for a boundary. 14.3 overs (0 Run) Tyagi goes wide of the crease now. Maxwell swings again but misses. 14.3 overs (1 Run) Wide! Bangs a bouncer on middle and the ball shoots more off the deck. Nicholas Pooran does really well to get a glove on it and stop. Wided. 14.2 overs (0 Run) A full ball, outside off. Maxwell with a wild swing and a miss. 14.1 overs (1 Run) A length ball, outside off, it is hit to cover for a single. DRINKS! Bangalore have lost Rajat Patidar but the youngster has set the platform for Glenn Maxwell and Bangalore to go big in this final phase of the innings. Faf du Plessis isalso well set and we all know how dangerous he can be at the death overs and with plenty of batting to follow, Bangalore are looking set for a big total. However, if Hyderabad manage to get wickets here, they can stem the run-flow and let's see how things pan out as Kartik Tyagi is back on. 13.6 overs (0 Run) NOT OUT! Malik serves a bumper, around middle. Maxwell makes room and tries to slash at it but misses. An appeal by Hyderabad but the umpire is unmoved. Kane Williamson asks if there was any sound and eventually takes the review but to no avail as UltraEdge shows nothing on it. Review! Hyderabad have taken a review for a caught behind against Glenn Maxwell. The replays roll in and the UltraEdge shows no bat involved. So Glenn Maxwell will continue. 13.5 overs (4 Runs) FOUR! Now a slower ball at 136 clicks, Malik's standards! Fuller and outside off. Glenn Maxwell drives it hard and past the cover fielder for a boundary. 13.4 overs (0 Run) Umran Malik gets to the 150 speed here. A widish yorker, outside off. Glenn fails to squeeze it out. 13.3 overs (0 Run) Angles a full ball, on middle. Maxwell tucks it off the inner half to mid-wicket. 13.2 overs (0 Run) This is on a length and outside off, good pace from Malik and Maxwell fails to get his bat on it. 13.1 overs (1 Run) Length ball down the leg side. Faf du Plessis whips it to deep square leg for a single. Umran Malik is back on. He went for 20 runs in his first over. 12.6 overs (0 Run) Tossed up, outside off. Maxwell pushes it straight to covers. 12.5 overs (6 Runs) SIX! HUGE! Top shot from 'The Big Show'! Flatter and around off. Glenn Maxwell goes for the reverse hit and hits it well over point for a biggie. 12.4 overs (1 Run) On a length and on middle, eased down to long on for a single. 12.3 overs (1 Run) Flatter and on middle. Maxwell tucks it to square leg for a single. Glenn Maxwell walks out at number 4. 12.2 overs (0 Run) OUT! TAKEN! Finally Hyderabad get the crucial breakthrough. Rajat Patidar misses out on his fifty as well. Again an arm ball from Jagadeesha Suchith, sliding around middle and leg. Rajat Patidar tries to heave it but does not connect well and Rahul Tripathi at deep mid-wicket takes a sharp catch. 12.1 overs (0 Run) This one comes with an angle, fuller and sliding on leg. Patidar misses his slog-sweep and gets hit on the pads. 11.6 overs (1 Run) Shorter and on off, Rajat pushes it through covers for one. 11.6 overs (1 Run) WIDE! Down the leg side this time. Wided. 11.5 overs (1 Run) Now takes one as this is pushed down to long off. 11.4 overs (4 Runs) FOUR! This will release the little pressure that was building. Shorter and outside off, Faf slaps it over covers for a boundary. Fifty for Faf du Plessis! 11.3 overs (0 Run) Make that three! Outside off, shorter, Faf is early in the pull, he is beaten. 11.2 overs (0 Run) Two dots in a row! That is a rarity! Length around off, this one jags back in sharply. Faf looks to flick but misses. It goes just over the middle pole. 11.1 overs (0 Run) Length and outside off, stays a touch low. Faf looks to cut but misses. Kartik Tyagi is back on. 10.6 overs (1 Run) Darts it on leg, Rajat Patidar flicks it towards deep mid-wicket and gets a single. 10.5 overs (1 Run) Fuller one and on off, Faf du Plessis flicks it towards mid wicket and rotates the strike. 10.4 overs (1 Run) Flatter one on off, this is flicked towards square leg for a single. 10.3 overs (0 Run) On the pads, darts it on leg, Patidar tries to sweep it but misses and the ball hits his pads. There is an appeal but it is going down leg. 10.2 overs (1 Run) Flatter one on leg, this is played towards covers for a single. 10.1 overs (1 Run) Flatter one on middle, Patidar plays it towards long on and gets a single.","pubDate":"2022-05-08 11:12:05","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637876249166653691.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Virat Kohli disappoints with third golden duck of IPL 2022","link":"https://www.firstpost.com/firstcricket/sports-news/srh-vs-rcb-watch-video-virat-kohli-suffers-third-golden-duck-in-ipl-2022-10647741.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Watch: Virat Kohli disappoints with third golden duck of IPL 2022","content":"Virat Kohli got out for another golden duck, his third of the ongoing Indian Premier League (IPL 2022) season as the Royal Challengers Bangalore batter was out in the first ball of the match against Sunrisers Hyderabad at the Wankhede stadium in Mumbai on Sunday.Opening for RCB after the side opted to bat first, Kohli suffered a soft dismissal as he flicked a full delivery by left-arm orthodox J Suchith straight to SRH skipper Kane Williamson standing at mid-wicket.The 33-year-old batter was expectedly and visibly upset as he did a facepalm in disbelief while walking back to the dugout. The former India and RCB captain is going through one of the worst slumps in form of his career as he has amassed just 216 runs in 11 games.Golden Duck Vs SRH Today 🙄 Seeing My Idol Like This Is Different Kind Of Pain.😔 But, I Have Trust In My King ❤️ Inshallah KinG_Kohli Comeback Stronger Very Soon✨ So Blasting Comeback Loading On The Card Very Soon_\"😀 Best Of Luck @imVkohli pic.twitter.com/EQfPKo74UB— Arbaz Hussain🇵🇰 (@ArbazHus77) May 8, 2022His previous golden ball duck came against the same outfit less than two weeks ago when RCB were humiliated by the Sunrisers, who bundled them out for 68 to win the match by nine wickets. It was also the first time Kohli suffered back-to-back first-ball dismissals in his career. His first golden duck of the season was against Lucknow Super Giants.Kohli overall golden ducks in IPLAgainst Mumbai Indians in Bengaluru, 2008 ( dismissed by Ashish Nehra) Against Punjab Kings in Bengaluru, 2014 (by Sandeep Sharma) Against Kolkata Knight Riders in Kolkata, 2017 (by Nathan Coulter-Nile) vs LSG in Mumbai, 2022 (by Dushmanta Chameera) vs SRH in Mumbai, 2022 (by Marco Jansen) vs SRH in Mumbai, 2022 (by J Suchith)Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook<","pubDate":"2022-05-08 11:02:17","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/virat-kohli-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“Sometimes a break from the game is all a player needs”: Michael Vaughan hints at Virat Kohli needing a break amid poor IPL 2022","link":"https://thesportsrush.com/cricket-news-sometimes-a-break-from-the-game-is-all-a-player-needs-michael-vaughan-hints-at-virat-kohli-needing-a-break-amid-poor-ipl-2022/","keywords":["Cricket","IPL 2022","RCB","IPL","Michael vaughan","Virat Kohli"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Michael Vaughan has suggested Virat Kohli take some rest from cricket after his poor run of form in the Indian Premier League. Royal Challengers Bangalore are up against Sunrisers Hyderabad in the 54th league game of the Indian Premier League. RCB won the toss and opted to bat first on a batting wicket at the… The post “Sometimes a break from the game is all a player needs”: Michael Vaughan hints at Virat Kohli needing a break amid poor IPL 2022 appeared first on The SportsRush.","content":"Michael Vaughan has suggested Virat Kohli take some rest from cricket after his poor run of form in the Indian Premier League. Royal Challengers Bangalore are up against Sunrisers Hyderabad in the 54th league game of the Indian Premier League. RCB won the toss and opted to bat first on a batting wicket at the Wankhede Stadium in Mumbai. In the last game against Sunrisers Hyderabad, Bangalore bundled out for just 68 runs. Faf du Plessis and Virat Kohli came to open the innings for the RCB, and all the eyes were on Virat Kohli yet again. Virat has been far from his best in this season of the Indian Premier League. Virat Kohli again disappointed his fans and went out on a golden duck on the ball of Jagadeesha Suchith. Suchith bowled a ball on the pads of Virat Kohli, and Kohli flicked it straight to the fielder at short midwicket. Virat was shocked at the dismissal and even he took a lot of time to reach the pavilion as well. Former English captain Michael Vaughan also commented on the form of Virat Kohli after his dismissal. He said that a rest can do wonders for Virat Kohli as he is playing just too much of cricket at the moment. “Sometimes a break from the game is all a player needs .. the amount of cricket these players play a break is as good as anything,” Michael Vaughan tweeted. Sometimes a break from the game is all a player needs .. the amount of cricket these players play a break is as good as anything .. #IPL2022 — Michael Vaughan (@MichaelVaughan) May 8, 2022 Before Michael Vaughan, even Ravi Shastri suggested rest for Virat Kohli earlier in the tournament. Virat, who scored his last century in 2019 in any format of the game has been struggling a lot in the tournament so far. Kohli has scored 216 runs this season at a poor average of 19.63, courtesy of two half-centuries. Virat has been dismissed on a golden duck thrice this season, something that has never happened before in his career. RCB needs Virat Kohli to fire at the top of the order.","pubDate":"2022-05-08 10:58:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 SRH vs RCB Live Cricket Score and Update: Patidar, du Plessis stitch fifty partnership","link":"https://www.firstpost.com/firstcricket/sports-news/srh-vs-rcb-live-cricket-score-tata-ipl-2022-match-scorecard-live-update-sunrisers-hyderabad-vs-royal-challengers-bangalore-indian-premier-league-live-streaming-today-10644221.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Tata IPL 2022 SRH vs RCB Live Cricket Score and Update: Patidar, du Plessis stitch fifty partnership","content":"16:09 (IST)After 8 overs,Royal Challengers Bangalore 77/1 ( Faf du Plessis (C) 36 , Rajat Patidar 37)IPL 2022, SRH vs RCB Live Score: Umran Malik introduced after the timeout, and he starts off with a delivery slightly short of the 90mph mark. Follows it up with a short, wide ball that is promptly dispatched towards the extra cover boundary by Patidar. Decides to bowl fuller in the third, this time hitting 148kmph on the speed gun, as Patidar is happy to collect a single. Du Plessis then collects back-to-back fours, the second one the result of a dropped chance by Tripathi at midwicket, the ball brushing his hand and running away to the boundary rope. FdP rubs salt on the wound by pulling the ball over deep midwicket for a six, resulting in the tearaway quick conceding 20 off his first over.16:03 (IST)After 7 overs,Royal Challengers Bangalore 57/1 ( Faf du Plessis (C) 21 , Rajat Patidar 32)IPL 2022, SRH vs RCB Live Score: Suchith into his third over as Farooqi is taken off. Patidar, meanwhile, moving into the 30s while bringing up the fifty stand with du Plessis with his second six of the innings, muscling the ball over long off in the penultimate ball. Timeout signalled at the end of this over.16:01 (IST)IPL 2022, SRH vs RCB Live Score: SIX! Patidar rocks back and muscles the half-tracker from Suchith over long off to bring up the fify stand for the second wicket with du Plessis! RCB 55/115:59 (IST)After 6 overs,Royal Challengers Bangalore 47/1 ( Faf du Plessis (C) 20 , Rajat Patidar 23)IPL 2022, SRH vs RCB Live Score: Tyagi off to a nightmare of a start after being brought in place of Bhuvneshwar, as he is smashed for 17 runs, with Du Plessis collecting a six and a four to move to 20. Patidar too collects a streaky boundary off an outside edge in the third delivery. End of the powerplay, RCB recover to 47/1.15:51 (IST)After 5 overs,Royal Challengers Bangalore 30/1 ( Faf du Plessis (C) 9 , Rajat Patidar 18)IPL 2022, SRH vs RCB Live Score: Debutant Fazalhaq Farooqi, replacing Sean Abbott in the lineup today, introduced in the fifth over. Starts off with a couple of balls measuring 142 clicks, the second one slightly shorter in length that is tickled away towards fine leg for a four. Farooqi’s tidy in the remaining deliveries of the over, conceding just two singles in four balls.15:49 (IST)After 4 overs,Royal Challengers Bangalore 24/1 ( Faf du Plessis (C) 8 , Rajat Patidar 13)IPL 2022, SRH vs RCB Live Score: SIX! Patidar collects the first maximum of the match with a solid strike over the wide long on boundary in the penultimate delivery of Bhuvneshwar’s second over. Another 10-run over for the Royal Challenges, with four singles coming off it besides the six.15:47 (IST)After 3 overs,Royal Challengers Bangalore 14/1 ( Faf du Plessis (C) 6 , Rajat Patidar 5)IPL 2022, SRH vs RCB Live Score: Suchith continues. Starts off with a wide down the leg side with du Plessis also setting off for the non-striker’s end after a fumble by keeper Pooran. Patidar collects a brace and a single off the next two balls. FOUR! Du Plessis dances down the track and dispatches the ball towards long on to collect the first four of the afternoon. He gets off strike with a single off the next ball. 10 from the over.15:43 (IST)After 2 overs,Royal Challengers Bangalore 6/1 ( Faf du Plessis (C) 1 , Rajat Patidar 2)IPL 2022, SRH vs RCB Live Score: Seam from the other end, with Bhuvneshwar Kumar bowling the second over. He’s off to a tidy start too with just two singles coming off it. RCB skipper Faf du Plessis is off the mark as well.15:40 (IST)After 1 over,Royal Challengers Bangalore 2/1 ( Faf du Plessis (C) 0 , Rajat Patidar 1)IPL 2022, SRH vs RCB Live Score: Top start for the Sunrisers as Suchith gets rid of Kohli off the first delivery of the day, piling further misery on the woefully out-of-form ex-RCB skipper. Two runs and a wicket from the over, with new batter Patidar opening his account with a single in the second delivery.15:35 (IST)IPL 2022, SRH vs RCB Live Score: OUT! A third golden duck of the season for Virat Kohli! Gets a full delivery from Suchith, and he flicks it straight to Kane Williamson standing at midwicket. He can barely believe his luck at the moment, and wears the familiar gutted look on his way back to the dugout. RCB 0/1Kohli c Williamson b Suchith 0(1)15:32 (IST)IPL 2022, SRH vs RCB Live Score: Jagadeesha Suchith to bowl the first over of the afternoon, as SRH opt to start with spin. Virat Kohli and skipper Faf du Plessis walk out to open the innings, the former on strike.15:08 (IST)Teams: SRH: Abhishek Sharma, Kane Williamson (c), Rahul Tripathi, Aiden Markram, Nicholas Pooran (wk), Shashank Singh, Fazalhaq Farooqi, Jagadeesha Suchith, Bhuvneshwar Kumar, Kartik Tyagi, Umran MalikRCB: Faf du Plessis (c), Virat Kohli, Rajat Patidar, Glenn Maxwell, Shahbaz Ahmed, Dinesh Karthik (wk), Mahipal Lomror, Wanindu Hasaranga, Harshal Patel, Mohammed Siraj, Josh Hazlewood15:02 (IST)Faf du Plessis: Nice to see Kane losing a toss for a change. Hopefully we put up a good score today. I find the last two games, we’ve done some good things in the batting department. Same team. Kane Williamson: I suppose I was due to lose one. Little bit undecided. Important we do the job with the ball well first up. We have two changes. Farooqui comes in for Abbott, and Suchith comes in for Gopal. Strategic, and a little bit of balance.15:02 (IST)TOSS: RCB win the toss and skipper Faf du Plessis opts to bat14:55 (IST)Matthew Hayden analyses the Wankhede surface ahead of toss: \"It’s so hot. It’s just humid and really scorching. Expect to see lots of sixes. I’m looking for wear and tear and eve though they have quality fast bowlers, Hasaranga and Gopal might have a say today. Just the dryness here, you can see it’s starting to flake up. Don’t be surprised if you see the ball holding up. You’ll see the bowlers bowling the hard lengths. 170 should be an ideal score here.\"14:45 (IST)RCB to bring back green jersey todayThe Royal Challengers Bangalore will be bringing back the much-loved light green jersey as part of their 'Go Green' initiative for their clash against the 'Orange Army' today. RCB had ditched the green jersey for a light blue one in support of the frontline workers tackling the COVID-19 pandemic.Click here for more14:35 (IST)COVID scare in DC camp... againThe Delhi Capitals players and coaching staff members have been forced to isolate after yet another positive COVID case emerged in the camp — this time a net bowler contracting the virus. The development puts a question mark on their fixture against Chennai Super Kings that is scheduled to take place later today.Click here for the full report14:25 (IST)Kohli v Williamson in focusBoth Virat Kohli and Kane Williamson will hope to regain form in the mid-table meeting between Royal Challengers Bangalore and Sunrisers Hyderabad at the Wankhede Stadium. RCB will hope to bolster their playoff chances with a win today while SRH would want to return to winning ways after three losses in a row.Click here for the SRH-RCB preview14:15 (IST)Hello and welcome to our live coverage of Match 54 of Indian Premier League (IPL) 2022, with Sunrisers Hyderabad (SRH) taking on Royal Challengers Bangalore (RCB) at the Wankhede Stadium in Mumbai.Sunrisers Hyderabad vs Royal Challengers Bangalore Live update - Tata IPL 2022 SRH vs RCB cricket score, 54th IPL Match Live Coverage: Umran Malik introduced after the timeout, and he starts off with a delivery slightly short of the 90mph mark. Follows it up with a short, wide ball that is promptly dispatched towards the extra cover boundary by Patidar. Decides to bowl fuller in the third, this time hitting 148kmph on the speed gun, as Patidar is happy to collect a single. Du Plessis then collects back-to-back fours, the second one the result of a dropped chance by Tripathi at midwicket, the ball brushing his hand and running away to the boundary rope. FdP rubs salt on the wound by pulling the ball over deep midwicket for a six, resulting in the tearaway quick conceding 20 off his first over.Sunrisers Hyderabad will take on the Royal Challengers Bangalore in their next match at the Wankhede Stadium on 8 May. The Kane Williamson-led SRH come into this match on the back of three straight defeats and they need to get their campaign back on track if they aim to make it to the playoffs.On the other hand, Royal Challengers Bangalore ended their losing streak with a convincing win over the Chennai Super Kings in their last encounter. Although their batting did not fire as expected, a solid bowling performance led by Josh Hazlewood and Harshal Patel saw them clinch a very important victory Virat Kohli now needs to perform and if this happens, this RCB side will have all their bases covered.When will the Sunrisers Hyderabad and Royal Challengers Bangalore match be played?The SRH vs RCB IPL 2022 match will take place on 8 May.Where will the Sunrisers Hyderabad and Royal Challengers Bangalore match be held?The SRH vs RCB IPL 2022 match will be held at Wankhede Stadium in Mumbai.What time will the Sunrisers Hyderabad and Royal Challengers Bangalore match start?The SRH vs RCB IPL 2022 match will begin from 3:30 pm onwards. The toss will be held at 3 pm on the same day.Where can you watch SRH vs RCB IPL 2022 match on TV and online?The SRH vs RCB IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The SRB vs RCB match will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores and commentary of the SRH vs RCB IPL 2022 match.Complete Squads:Royal Challengers Bangalore: Faf du Plessis (Captain), Virat Kohli, Glenn Maxwell, Mohammed Siraj, Harshal Patel, Wanindu Hasaranga, Josh Hazlewood, Shahbaz Ahmed, Anuj Rawat, Akash Deep, Dinesh Karthik, Sherfane Rutherford, Mahipal Lomror, Finn Allen, Jason Behrendorff, Suyash Prabhudessai, Chama Milind, Aneeshwar Gautam, Karn Sharma, David Willey, Rajat Patidar, Siddharth Kaul.Sunrisers Hyderabad: Kane Williamson (Captain), Abdul Samad, Umran Malik, Washington Sundar, Nicholas Pooran, T Natarajan, Bhuvneshwar Kumar, Rahul Tripathi, Abhishek Sharma, Karik Tyagi, Priyam Garg, Shreyas Gopal, Jagadeesha Suchith, Aiden Markram, Marco Jansen, Romario Shepherd, Fazalhaq Farooqi, Sean Abbott, R Samarth, Saurabh Dubey, Shashank Singh, Vishnu Vinod, Glenn Philips.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-08 10:39:35","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Kane-Williamson-Faf-du-Plessis-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs RCB Live Score: Faf Du Plessis, Rajat Patidar Rebuild Innings After Virat Kohli's Early Wicket vs SRH - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaXBsLTIwMjItc3JoLXZzLXJjYi1saXZlLXNjb3JlLXVwZGF0ZXMtc3VucmlzZXJzLXZzLXJveWFsLWNoYWxsZW5nZXJzLWxpdmUtc2NvcmUtMjk1NjMxM9IBfmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaXBsLTIwMjItc3JoLXZzLXJjYi1saXZlLXNjb3JlLXVwZGF0ZXMtc3VucmlzZXJzLXZzLXJveWFsLWNoYWxsZW5nZXJzLWxpdmUtc2NvcmUtMjk1NjMxMy9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs RCB Live Score: Faf Du Plessis, Rajat Patidar Rebuild Innings After Virat Kohli's Early Wicket vs SRH  NDTV SportsSRH vs RCB, Go Green Game: Preview | IPL 2022  Royal Challengers BangaloreMatch Preview - Sunrisers vs RCB, Indian Premier League 2022, 54th Match  ESPNcricinfoSRH vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorSRH vs RCB IPL 2022 Live Score: Virat Kohli falls for golden duck in first over  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-08 10:39:28","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}