{"newsArray":[{"title":"“He Can Set IPL Public sale On Hearth”: Suresh Raina On Un-Capped Star | Cricket Information","link":"https://www.thetimesofbengal.com/sports/he-can-set-ipl-public-sale-on-hearth-suresh-raina-on-un-capped-star-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Forward of the 2023 Indian Premier League (IPL) public sale on Friday, former India batter The post “He Can Set IPL Public sale On Hearth”: Suresh Raina On Un-Capped Star | Cricket Information appeared first on The Times of Bengal.","content":"Forward of the 2023 Indian Premier League (IPL) public sale on Friday, former India batter Suresh Raina shared his ideas on who’re the highest worldwide and home gamers he expects to be probably the most sought through the Public sale. Raina picked Jaydev Unadkat and Narayan Jagadeesan as his high picks for the Indians. Each Indian gamers had a superb home season. Unadkat completed with 19 wickets in 10 video games at an financial system fee of three.33. On the similar time, Jagadeesan slammed 5 consecutive centuries for Tamil Nadu, the final of which was a record-breaking 277 towards Arunachal Pradesh. “Then there may be Jaydev Unadkat who simply gained the Vijay Hazare Trophy and has a number of expertise within the IPL. N Jagadeesan has an excellent cricketing mind, and he bats so deep, is a really good, calculative batsman. He has achieved rather well for Tamil Nadu, be careful for him,” Raina mentioned in a Jio Cinema present forward of the IPL 2023 public sale. Raina singled out Eire quick bowler Joshua Little as a participant to be careful in the back of an impressive T20 World Cup the place he claimed 11 wickets in seven matches. “Sam Curran has achieved rather well for England in addition to for Chennai Tremendous Kings and there may be Ben Stokes who has led England properly. So having a high all-rounder in your crew can change the motion of the sport. Be careful for Joshua Little from Eire. He has achieved rather well within the World Cup simply now, and I simply performed with him,” Raina mentioned. A complete of 405 gamers, together with 273 Indians and 132 abroad gamers, are set to go beneath the hammer through the public sale of Indian Premier League (IPL) 2023 which is able to happen in Kochi on December 23. “The IPL 2023 Participant Public sale checklist is out with a complete of 405 cricketers set to go beneath the hammer in Kochi on December 23, 2022. Initially, a complete of 369 gamers had been shortlisted by 10 groups from the preliminary checklist of 991 gamers. Thirty-six extra gamers had been requested by groups, that are added into the ultimate checklist which makes a complete of 405 gamers which will likely be offered on the IPL 2023 public sale,” an announcement from the league mentioned. “Out of 405 gamers, 273 are Indians and 132 are abroad gamers of which 4 gamers are from affiliate nations. The whole capped gamers are 119, uncapped gamers are 282 and 4 from affiliate nations,” added the assertion. A few of the gamers set to go beneath the hammer embody: Mayank Agarwal (India), Harry Brook (England), Joe Root (England), Rilee Rossouw (South Africa), Cameron Inexperienced (Australia), Sikandar Raza (Zimbabwe), Ben Stokes (England), Ajinkya Rahane (India), Travis Head (Australia), Nicholas Pooran (West Indies), Mujeeb Rahman (Afghanistan), Dawid Malan (England), Dasun Shanaka (Sri Lanka), Paul Stirling (Eire), Shai Hope (West Indies), Daryl Mitchell (New Zealand), Rassie van der Dussen (South Africa), Tom Latham (New Zealand), Jason Roy (England), Karthik Meiyappan (UAE), Harry Tector (Eire), Reeza Hendricks (South Africa), Blessing Muzarbani (Zimbabwe). Featured Video Of The Day Video: Messi’s Argentina Arrive Again In Buenos Aires After FIFA WC Triumph Subjects talked about on this article Source link The post “He Can Set IPL Public sale On Hearth”: Suresh Raina On Un-Capped Star | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 03:31:30","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Public sale: 5 Guidelines Franchises Would Want To Be Conscious Of Whereas Shopping for Gamers | Cricket Information","link":"https://www.thetimesofbengal.com/sports/ipl-2023-public-sale-5-guidelines-franchises-would-want-to-be-conscious-of-whereas-shopping-for-gamers-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The Indian Premier League (IPL) 2023 public sale has arrived, with 405 gamers set to The post IPL 2023 Public sale: 5 Guidelines Franchises Would Want To Be Conscious Of Whereas Shopping for Gamers | Cricket Information appeared first on The Times of Bengal.","content":"The Indian Premier League (IPL) 2023 public sale has arrived, with 405 gamers set to go underneath the hammer for 87 vacant spots in a complete of 10 franchises. It’s the event the place some careers will probably be made whereas some veterans will probably be deemed surplus to requirement. The IPL public sale all the time comes with its surprises and disappointments. However, a number of issues are going to be completely different this time. Whether or not it could be for good or unhealthy, solely time will have the ability to inform. The mini-auction, for the IPL 2023 season, will probably be held in Kochi on December 23. Right here, we check out some guidelines and laws that the franchises would wish to stick to. 1. Opposite to the final season, the franchises have gotten INR 5 crore further to spend this time round. The mentioned quantity has been added to their total purse steadiness. 2. The franchises should spend 75 p.c of their total purse steadiness in any respect price. 3. No Proper To Match (RTM) card has been allowed this time. 4. The variety of Indian gamers in every squad can differ from 17 to 25, neither much less nor extra. Relating to the abroad lot, a most of 8 gamers may be purchased. 5. Any participant going unsold within the preliminary rounds may be introduced again later. From the 2023 season onwards, the X-Issue substitution has additionally been allowed which successfully makes it a 12-man crew per facet for every match. The franchises, therefore, would wish to maintain this side in thoughts earlier than bidding for his or her desired gamers. Featured Video Of The Day FIH Girls’s Nations Cup: Victorious Crew India Receives Heat Welcome In Delhi Matters talked about on this article Source link The post IPL 2023 Public sale: 5 Guidelines Franchises Would Want To Be Conscious Of Whereas Shopping for Gamers | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-23 03:07:32","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL public sale dwell methods: What the ten groups want, which slots can be found and gamers they may bid for on December 23","link":"https://www.thetimesofbengal.com/sports/ipl-public-sale-dwell-methods-what-the-ten-groups-want-which-slots-can-be-found-and-gamers-they-may-bid-for-on-december-23/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The Indian Premier League (IPL) public sale will start at 2.30pm IST in Kochi on The post IPL public sale dwell methods: What the ten groups want, which slots can be found and gamers they may bid for on December 23 appeared first on The Times of Bengal.","content":"The Indian Premier League (IPL) public sale will start at 2.30pm IST in Kochi on Friday. The ultimate public sale pool includes 405 gamers from the initially registered 991, with a most of 87 slots out there to be stuffed by the ten franchises. Of those, 30 will likely be abroad gamers. Right here’s what the ten groups want and the way they may go about filling the spots. Chennai Tremendous Kings (Purse Left: Rs 20.45 crore) Having launched Dwayne Bravo and Robin Uthappa, the four-time champion will look to rope in an abroad fast-bowling all-rounder, which can even assist in including heft to a lean batting line-up. CSK may eye Sam Curran, the English all-rounder it had purchased for INR 5.5 crore in 2019. A tough-hitting middle-order batter can even be on CSK’s want listing, contemplating it has Ambati Rayudu and MS Dhoni, who’ve struggled to attain at a quick clip persistently of late. Whereas the spin division seems to be settled, CSK would fancy a backup fast-bowler with real tempo who can complement Deepak Chahar and Mukesh Choudhary and cushion harm points. READ | IPL public sale: What’s accelerated bidding, guidelines, slots out there and cash left Mumbai Indians (Purse Left: Rs 20.55 crore) Whereas the five-time champion has largely retained its core, Kieron Pollard’s absence, for the primary time since 2010, will play on Mumbai Indians’ thoughts. It has enough firepower on the high of the batting order and within the center however can have a bowling all-rounder on its radar who can present a sixth bowling choice. On the high of its precedence, nevertheless, will likely be a pacer who can cowl for the injury-prone Jasprit Bumrah and Jofra Archer, whose health for the match is below a cloud. Kumar Kartikeya and Hrithik Shokeen confirmed glimpses of their potential with the ball in IPL 2022, however MI would wish to financial institution on extra expertise and selection within the spin division and will look in the direction of somebody like Adil Rashid or Adam Zampa. With Tristan Stubbs the one backup wicketkeeper within the squad, Indians may have their sights on a reserve for Ishan Kishan. Royal Challengers Bangalore (Purse Left: Rs 8.75 crore) Nonetheless in the hunt for its maiden title win, RCB doesn’t have an excessive amount of cash to play with. It has the second smallest purse remaining and nonetheless some gaps to fill. An Indian batter will likely be on high of its guidelines. It may eye an Indian opening batter to associate with skipper Faf du Plessis to accommodate Virat Kohli in his most well-liked No. 3 place. If Kohli continues to open, RCB may accept a middle-order choice too. Mayank Agarwal and Manish Pandey are sturdy contenders for these roles and may anchor the innings and complement power-hitters akin to Glenn Maxwell and Rajat Patidar. RCB’s abroad gamers du Plessis, Maxwell, Wanindu Hasaranga, and Josh Hazlewood choose themselves and the franchise is unlikely to interrupt the financial institution on filling the 2 abroad slots it has left. Kolkata Knight Riders (Purse Left: Rs 7.05 crore) The Knight Riders face the dilemma of getting to fill the second-highest variety of slots with the smallest purse out there. It might want to optimise its INR 7.05 crore to rope in a wicketkeeper and a gap batter. Rahmanullah Gurbaz of Afghanistan, who’s but to make his IPL debut, is the one recognised wicketkeeper within the squad. Contemplating Gurbaz performs, he’ll want a gap associate, ideally Indian, as Tim Southee, Sunil Narine and Andre Russell occupy the remainder of the abroad spots. Narayan Jagadeesan, Vivrant Sharma, Shubham Khajuria and Rohan Kunnummal are choices KKR may contemplate, given their mild purse. Mayank Agarwal could be a really perfect contender however the former Punjab Kings skipper could possibly be out of bounds for the cash-strapped franchise. READ |Which gamers will are available IPL 2023 public sale: base value, age, nation and IPL historical past Delhi Capitals (Purse Left: Rs 19.45 crore) Having solely launched 5 gamers, the Capitals appear like a settled group forward of the auctions. It has a major INR 19.45 crore left to rope in 5 gamers and may afford to focus on some large names. Amongst them could possibly be Ben Stokes, Sam Curran and Jason Holder. However, contemplating the Rishabh Pant-led aspect is stacked with bowling firepower, Delhi may look in the direction of investing extra aggressively in batters who float within the middle-order, which is barely lighter with an out-of-form Rishabh Pant, inconsistent Rovman Powell and Sarfaraz Khan. Capitals would additionally contemplate a specialist finisher with Rilee Rossouw and Nicholas Pooran rising as front-runners for that function. Like most groups, Capitals can even want a canopy for captain and wicketkeeper Pant and will take a look at getting again Okay.S. Bharat, who was purchased by the franchise for INR 2 crore on the final public sale, at a cheaper price. Sunrisers Hyderabad (Purse Left: Rs 42.25 crore) After a few consecutive disappointing seasons, Sunrisers are set for a wholesale revamp. They’ll start by on the lookout for a frontrunner after releasing Kane Williamson and will contemplate Mayank Agarwal, Ben Stokes, Jason Holder and Nicholas Pooran for the job. Its full rebuilding course of will embrace utilizing all of the would possibly of its whopping purse of INR 42.25 crore to get Abhishek Sharma a gap associate who can rating briskly. Jason Roy and Cameroon Inexperienced are viable choices whereas Rilee Rossouw will likely be an thrilling prospect within the center order, together with Rahul Tripathi and Abdul Samad and compatriot Aiden Markram. Spinners will likely be in demand on the SRH public sale desk, and Zampa, Rashid and all-rounder Sikandar Raza will all be in competition. The tempo division will rally round Bhuvneshwar Kumar and Umran Malik, and the administration can have a eager curiosity in Adam Milne, Chris Jordan and Jaydev Unadkat. Rajasthan Royals (Purse Left: Rs 13.20 crore) A top-heavy Rajasthan Royals will search for stability within the center order, which has lengthy been its bane. Whereas Shimron Hetmyer can end the innings with a flourish, the Royals will look in the direction of somebody who can set the stage for a late flourish or regular the ship in case of early wickets. Manish Pandey, Shakib Al Hasan and Sikandar Raza are choices that may match into the RR mould, with the final two additionally giving the group an additional bowling choice. A real all-rounder, within the type of Ben Stokes, Cameroon Inexperienced or Jason Holder can tide over the difficulty of a scarcity of depth within the batting whereas including to the tempo battery comprising Trent Boult, Prasidh Krishna and Kuldeep Sen. READ |IPL Public sale 2023: Six uncapped Indian gamers to be careful for in December 23 mini-auction Punjab Kings (Purse Left: Rs 32.2 crore) The franchise can have a brand new chief in Shikhar Dhawan and can wish to proceed its aggressive model of cricket with the bat. With a settled batting line-up, which incorporates arduous hitters Jonny Bairstow, Liam Livingstone and Bhanuka Rajapaksa, and Arshdeep Singh and Kagiso Rabada forming a world-class tempo duo, Punjab Kings will concentrate on getting a top quality all-rounder and a spinner as backups for Rahul Chahar and Harpreet Brar. The franchise has the second largest purse remaining and roping in scorching property Ben Stokes or Cameroon Inexperienced could possibly be possible for the Kings. Punjab’s high-risk, high-reward method with the bat is susceptible to collapses, and it may search for an anchor in Manish Pandey or Kane Williamson and Joe Root amongst abroad choices. Lucknow Tremendous Giants (Purse Left: Rs 23.35 crore) Tremendous Giants are stacked with all-rounders however might want to bolster its batting because it lacks specialisation in that division. After the strong opening pair of captain KL Rahul and Quinton de Kock, a gradual choice within the center order will maintain the group in good stead. The likes of Marcus Stoinis, Ayush Badoni and Deepak Hooda can handle the ending. Having let go of Dushmantha Chameera, LSG will want a backup for injury-riddled Mark Wooden and will break the financial institution on Sam Curran. Jason Holder, to the shock of most, was launched by Lucknow, and that transfer may set the stage for a big-ticket signing in Ben Stokes or Cameroon Inexperienced. Gujarat Titans (Purse Left: Rs 19.25 crore) Fairly expectedly, defending champion Gujarat Titans has not opted for too many modifications after profitable the title in its maiden marketing campaign. The areas it may concentrate on, nevertheless, would be the fast-bowling unit, the place it doesn’t have the tearaway tempo of Lockie Ferguson any longer. It would want backups for Alzarri Joseph and Mohammed Shami and may discover an abroad choice in that regard. A dependable batting choice can be one thing Gujarat can have its eyes on. Sai Sudharsan was pretty constant within the center order whereas Abhinav Manohar was brisk in the direction of the tip of the innings. The Hardik Pandya-led aspect would need a even handed mixture of each to lend help to David Miller. Source link The post IPL public sale dwell methods: What the ten groups want, which slots can be found and gamers they may bid for on December 23 appeared first on The Times of Bengal.","pubDate":"2022-12-23 02:43:36","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"405 candidates wrestled for 87 seats IPL players auction in Kochi today – Sam Karan likely to fetch the highest price","link":"https://thenewsglory.com/405-candidates-wrestled-for-87-seats-ipl-players-auction-in-kochi-today-sam-karan-likely-to-fetch-the-highest-price/","keywords":["Sports","Cricket","IPL","ipl auction","Sam Curran","Same Karan"],"creator":["The News Glory"],"video_url":null,"description":"Cochin: The 16th season of the IPL cricket series is going to be held in the months of March and April next year. This time all 10 teams are going to play on local and away basis. The mini player auction for this series will be held in Kochi today at 2.30 pm. 87 seats […]","content":"Cochin : The 16th season of the IPL cricket series is going to be held in the months of March and April next year. This time all 10 teams are going to play on local and away basis. The mini player auction for this series will be held in Kochi today at 2.30 pm. 87 seats are vacant across 10 teams. This will include 30 foreign players. 405 players have been shortlisted for the mini auction. In today’s auction, various teams may compete to buy England all-rounder Sam Karan for a huge sum. It is noteworthy that Sam Karan was selected as the Man of the Series in the recent T20 World Cup held in Australia. He is now only 24 years old. This will make the bidding team see him as a long-term investment.","pubDate":"2022-12-23 01:57:37","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Bowling coach Shane Jurgensen on what Tim Southee will bring to Black Caps as test captain","link":"https://www.nzherald.co.nz/sport/cricket-bowling-coach-shane-jurgensen-on-what-tim-southee-will-bring-to-black-caps-as-test-captain/K3Z3NMWWA5C2FJ3PM4W6AYUA2Y/","keywords":null,"creator":null,"video_url":null,"description":"Southee’s work as a leader with began long before he was named new test captain.","content":"Tim Southee’s work as a leader with the Black Caps began long before he was named test captain. The 34-year-old has been crucial to the success of the Black Caps bowling unit over the years, and bowling coach Shane Jurgensen believes his consistency with the ball and ability to instil confidence in the group will continue to be a key feature of his leadership as captain — starting with the first of two tests against Pakistan in Karachi on Boxing Day. “He’s done a fantastic job as a leader of the group over a long period of time, both in his skills and also his leadership,” Jurgensen said of Southee. “He provides a lot of confidence around the group and that’s what we’re looking forward to him bringing into his captaincy.” Variety in the New Zealand bowling attack will once again prove crucial in Pakistan, with new — and old — faces coming into the squad to take advantage of the conditions in the subcontinent. Jurgensen says Southee, along with the team’s leadership group, has played a big part in fostering an environment of comradery among the bowlers, helping new additions to the hunting pack to slot in seamlessly. “The guys have really realised as a bowling group you do have to hunt as a pack and you rely a lot on each other. And that’s what’s really important, once you’ve got that trust and that bond and guys feel psychologically safe within the group. I think certainly Tim and the other senior bowlers have provided that to many of the young bowlers coming in.” Tim Southee of the Black Caps. Photo / Photosport Ajaz Patel, one of the bowlers returning to the side with spin set to be important in Karachi, said he’s looking forward to seeing Southee grow into the role. Advertisement Advertise with NZME. “It’s a new and exciting challenge for Tim and it’s something I’m sure he’s really looking forward to and takes a lot of pride in,” Patel said. “We know how much he loves playing for New Zealand. I’m sure he’s going to try and stamp his mark on the New Zealand cricket scene so it will be interesting to see how he takes that lead.” The Black Caps are expecting a similarly flat wicket, having watched England’s series sweep of Pakistan at the same venue closely, which will require an all-round effort from the bowling attack. “Looks like the wicket are quite slow, docile, potentially flat wickets — offering some spin and a good opportunity to try and have an impact with the new ball if you can, but then quickly switch to having an impact with the old ball,” Jurgensen said. “There’s really a role for all our bowlers over there in Pakistan and we’re going to have to play well as a unit.” Jurgensen says mixing patience with aggression will be key, as England showed in their 3-0 series win over Pakistan. “It’s important to stay really patient and bide your time. Over the course of those games, you saw that there were windows of opportunity for each team to take advantage and for us it’ll be exactly the same; making sure we adapt to conditions as quickly as we can. “Look forward to playing a combination of some patient but also some aggressive cricket when we get that opportunity to take the momentum of the game towards us.” Advertisement Advertise with NZME. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2022-12-23 01:30:00","image_url":"https://www.nzherald.co.nz/resizer/nLvCkYxF3s52rJItivtRTq2S0Vc=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/BFBTPSZ45VBTRHY4CYB6ULXORE.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Shadow ban: Time for cricket’s judicial process to emerge from dark ages","link":"https://www.smh.com.au/sport/shadow-ban-time-for-cricket-s-judicial-process-to-emerge-from-dark-ages-20221222-p5c89s.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Darren Kane"],"video_url":null,"description":"The circus surrounding David Warner’s appeal against his lifetime leadership ban from Cricket Australia proves there’s no substitute for openness and transparency.","content":null,"pubDate":"2022-12-23 01:00:00","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"Following the soccer World Cup craze in Kerala","link":"https://www.thetimesofbengal.com/sports/following-the-soccer-world-cup-craze-in-kerala/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"On the night time the universe willed Lionel Messi to kiss the 2022 FIFA World The post Following the soccer World Cup craze in Kerala appeared first on The Times of Bengal.","content":"On the night time the universe willed Lionel Messi to kiss the 2022 FIFA World Cup trophy, I used to be in Mumbai. I used to be masking a ladies’s cricket sequence between India and Australia. There was no cricket match that Sunday, so I may watch the ultimate soccer match stay on tv in my resort room. At half-time, when Argentina was main 2-0 towards France, I instructed a colleague on the telephone that solely a Kylian Mbappé hat-trick may cease Messi from fulfilling his dream. Because it turned out, even the Mbappé hat-trick wasn’t sufficient. The primary soccer World Cup I adopted carefully was the 1986 version held in Mexico. I used to be at school then and there was no tv in Wayanad. I trusted the BBC World Service radio for updates on that World Cup, which was made unforgettable by Deigo Maradona. I keep in mind commentator Bryon Butler describing the little grasp’s second purpose for Argentina towards England within the quarter-final: “That is why he is the greatest player in the world. Diego Maradona 2, England nil.” That purpose is regarded by many because the greatest-ever one scored in a soccer subject. However the legend had scored his first purpose together with his hand. “The hand of God,” Maradona would say.\r Little may I’ve imagined that a long time later, I might interview the person who was the closest witness to Maradona’s targets. Once I met England’s goalkeeper of that match, Peter Shilton, who had come to Kozhikode 9 years in the past for a operate as a part of the United Nations’ seventieth anniversary celebrations, he stated his nation couldn’t forgive Maradona’s first purpose. “We felt we were cheated,” he stated.\r Shilton is the joint document holder for probably the most clear sheets (10) together with France’s Fabien Barthez. “But for Maradona, I could have had the record all by myself,” he stated that morning on the foyer of the Taj resort in Kozhikode. He, nonetheless, appreciated Maradona’s different targets throughout that World Cup, particularly the one towards Belgium.\r By the point the soccer World Cup moved to Italy in 1990, tv had lastly arrived in my dwelling city of Kalpetta. These days, Doordarshan was the one channel obtainable, and never all matches had been telecast stay. Some matches had been screened the next mornings. However what’s the enjoyable in watching a match when you already know the outcome? One fan – each man in his household performed sport – discovered a means out: he would stand up sooner than everybody else, pay money for the newspaper and conceal it till the telecast of the match was over.\r There are crazier followers in north Kerala in the course of the World Cups. I met a lot of them in the course of the 2018 World Cup; I used to be assigned by the Sports activities Editor to journey to Malappuram and write a function on the district’s well-known and enduring love affair with the gorgeous sport. There I met Nasib, who bought fish at half the market worth the day his favorite workforce, Brazil, performed. I additionally met Nabeel whose home was painted in numerous elements in yellow and inexperienced; white and light-weight blue; and blue, white and pink. The riot of colors was the handiwork of Nabeel and his cousins who wished to declare their allegiance to Brazil, Argentina and France. I additionally went to an ‘office room’ rented by followers of Brazil. A Communist Celebration of India (Marxist) department committee member instructed me that the occasion workplace was screening the World Cup match stay on an enormous display screen, one thing the rival occasion, the Indian Union Muslim League, additionally did. This time, the large cut-outs of Messi, Neymar and Cristiano Ronaldo erected on a river in a village close to Pullavoor in Kozhikode district, which shares neighbouring Malappuram’s ardour, attracted international consideration. Once I went there final month, a number of tv channels had been filming the 30-foot tall Messi, 40-foot Neymar and 45-foot Ronaldo. I additionally examine it in AlJazeera. Messi, nonetheless, stood the tallest in Qatar. ajithkumar.pk@thehindu.co.in Source link The post Following the soccer World Cup craze in Kerala appeared first on The Times of Bengal.","pubDate":"2022-12-22 20:38:32","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Umesh, Ashwin put India in driver’s seat as Bangladesh get bowled out for 227","link":"https://kashmirreader.com/2022/12/23/umesh-ashwin-put-india-in-drivers-seat-as-bangladesh-get-bowled-out-for-227/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Mirpur: Umesh Yadav’s incisive spells with the old ball and Ravichandran Ashwin’s controlled effort put India in complete command as Bangladesh were bowled out for a below-par 227 on the opening day of the second Test here on Thursday. At stumps, India reached 19 for no loss with skipper KL Rahul batting on 3 off […]","content":"Mirpur: Umesh Yadav’s incisive spells with the old ball and Ravichandran Ashwin’s controlled effort put India in complete command as Bangladesh were bowled out for a below-par 227 on the opening day of the second Test here on Thursday. At stumps, India reached 19 for no loss with skipper KL Rahul batting on 3 off 30 balls in company of Shubman Gill (14 batting, 20 balls). Some of the balls bowled by Bangladeshi spinners were turning square and the decision to drop last Test’s player of the match Kuldeep Yadav is looking a controversial one. When Bangladesh batted, Umesh (4/25 in 15 overs) led the Indian pace attack manfully while Ashwin (4/71 in 21.5 overs) closed in on a career-haul of 450 wickets (447 currently) on a day when Jaydev Unadkat’s (2/50 in 16 overs) return to Test fold after 12 long years did stir up fair amount of debate about some selection calls taken by this team management. However, Unadkat could term himself lucky as last game’s hero Kuldeep (8 wickets and 40 runs) was unceremoniously dumped by the team management comprising the two Rahuls — head coach Dravid and skipper Kannaur Lokesh (KL). The pitch was termed to be a confusing one by skipper Rahul at the toss which prompted them to pick an extra seam bowler in Unadkat. The decision didn’t backfire because of the inferior quality of Bangladesh batting line-up more than anything else. Former skipper Mominul Haque (84, 157 balls) was the only batter who showed admirable patience for more than four hours but he hardly enjoyed any support from the other end. Zakir Hasan (15) and Najmul Hosain Shanto (24) added 39 for the first wicket but more importantly saw off the morning spell from Umesh and Mohammed Siraj (0/39 in 9 overs). It was Unadkat who got the first breakthrough when the ball bounced a tad more and was caught in the slips. However, the Saurashtra player bowled a better delivery to get the stodgy Mushfiqur Rahim when he came round the wicket and angled one into the batter. The ball straightened enough after pitching as it completely squared up Rahim. Unadkat, who made his debut against South Africa at Centurion in December 2010, returned to Test format after a gap of 12 years. In between, he missed 118 matches, the highest by an Indian and the second highest in world cricket. However, the most impressive bowler for India was Umesh, who consistently pitched the ball up. What was heartening to see was that along with his stock ball — the outswinger –, he has also developed a potent inswinger, one which he used to get rid of Nurul Hasan. He also got important wickets of Shakib Al Hasan and Mehidy Hasan Miraz by bowling a probing channel and the slowness of the track did the rest. Litton Das (25 off 26 balls) played an attacking knock which had two boundaries and a six but he couldn’t carry on the good work as he flicked a full length delivery from Ashwin straight to captain KL Rahul. But, Mominul kept his calm and went about his business in a quiet fashion, hitting 12 fours and a six in the process. It was Ashwin, who removed Mominul at the fag end of the day when he shaped for an expansive drive and then decided to check his stroke but the ball kissed his gloves into Rishabh Pant’s gloves. —PTI Umesh, Ashwin put India in driver’s seat as Bangladesh get bowled out for 227 added by Press Trust of India on 12:44 am December 23, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-22 19:14:50","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Mini auction, maximum returns: Curran, Stokes, Green set for IPL windfall","link":"https://kashmirreader.com/2022/12/23/mini-auction-maximum-returns-curran-stokes-green-set-for-ipl-windfall/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Kochi: Intense bidding is expected to be the order of the day when 10 teams jostle to grab their preferred players from a limited pool of cricketers, including the likes of Ben Stokes, Sam Curran and Mayank Agarwal, in the mini IPL auction here on Friday. The player pool for the auction has been pruned […]","content":"Kochi: Intense bidding is expected to be the order of the day when 10 teams jostle to grab their preferred players from a limited pool of cricketers, including the likes of Ben Stokes, Sam Curran and Mayank Agarwal, in the mini IPL auction here on Friday. The player pool for the auction has been pruned to 405 with a maximum of 87 slots, including 30 overseas, to be filled by the teams. Former South Africa all-rounder Chris Morris has been the biggest beneficiary of the mini IPL auction till date. In 2021, he became the most expensive player in auction history when Rajasthan Royals shelled out Rs 16.25 crore for his services. Morris is now happily retired. All-rounder Curran, who was named the Player of the 2022 T20 World Cup, is expected to attract intense bidding and end up with a million dollar deal. He is only 24 and teams will look at him as a long-term investment. Back in 2019, Punjab Kings made him an IPL millionaire before he moved to Chennai Super Kings who would be looking to buy him back. Curran, who missed the 2022 season as he was recovering from a back injury, has set his base price at Rs 2 crore. The all-rounders have been listed in the second set to come up for bidding. The venue of the auction is not the usual Bengaluru as Kochi gets to host the keenly followed event. Curran’s English teammates including Test skipper Stokes and Harry Brook are also likely to land fat pay cheques. Stokes is a super star of the game and delivers in the toughest of situations while Brook made a name for himself in the Test format with three centuries against Pakistan after already proving his worth in the shorter-formats. Stokes has set his base price at Rs 2 crore and Brook at Rs 1.5 crore. Australian all-rounder Cameron Green will also be watching the proceedings keenly. He has not looked back in the shortest format after getting the opportunity to open for Australia in India earlier this year. Many were surprised that he was not picked in the World Cup squad initially but he was eventually drafted in after Josh Inglis got injured. New Zealand skipper Kane Williamson will be another big name with a base price of Rs 2 crore. He was released by Sunrisers Hyderabad alongside West Indian Nicholas Pooran. Williamson’s strike rate in T20s has been questioned but he remains a very good leadership choice in case a franchise is looking for captaincy material. Pooran, who quit West Indies captaincy after an early exit from the T20 World Cup, has not been in the best of forms of late but is expected to secure a decent deal. Former England Test skipper Joe Root has also thrown his hat into the ring. Zimbabwe all-rounder Sikandar Raza, who has been among the top T20 players over the past 12 months, can also attract a heavy bid. Agarwal sought after among Indians Out of favour India Test opener Agarwal will go under the hammer in Set 1 comprising batters. He has kept his base price at Rs 1 crore and teams are likely to go after him. Punjab had released him earlier this year and appointed Shikhar Dhawan the captain instead. A good IPL is crucial for Agarwal as he aims to get back into the India fold. Veteran Ishant Sharma and Jaydev Unadkat are Indian pace bowling options available to the teams. If Ishant doesn’t get a deal, he might not carry on playing for Delhi in domestic cricket. Among the uncapped Indians who could break the bank include pacers Shivam Mavi and Yash Thakur. Having released by CSK, Tamil Nadu batter N Jagadeesan should be in demand after smashing a record five straight centuries in List A cricket. PTI Mini auction, maximum returns: Curran, Stokes, Green set for IPL windfall added by Press Trust of India on 12:41 am December 23, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-22 19:11:36","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Public sale 2023: Three All-rounders Who Will Be On Wishlist Of Each Group | Cricket Information","link":"https://www.thetimesofbengal.com/sports/ipl-public-sale-2023-three-all-rounders-who-will-be-on-wishlist-of-each-group-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Kochi (Kerala): India’s greatest sporting gala is just not too removed from the horizon however The post IPL Public sale 2023: Three All-rounders Who Will Be On Wishlist Of Each Group | Cricket Information appeared first on The Times of Bengal.","content":"Kochi (Kerala): India’s greatest sporting gala is just not too removed from the horizon however the buzz for the Indian Premier League begins this December with the participant auctions. The IPL auctions are a tense and thrilling affair as groups attempt to outbid one another for a few of the hottest properties in T20 cricket. The sixteenth version of the IPL will see 991 gamers register for the auctions that are to be held in Kochi on the twenty third of December, 2022. The auctions will see a few of the greatest all-rounders in world cricket go below the hammer and groups might be vying to get them into their rosters. Previous seasons have seen groups carry out extraordinarily nicely if they’ve extremely valued all-rounders of their squads and this 12 months’s auctions have some huge names who’ve constantly carried out nicely in each the worldwide and home T20 circuits. The next are the three all-rounders who might be good buys for groups in IPL 2023. Ben Stokes (Base Worth: INR 2 crore):Thought-about by many to be one of many nice all-rounders of contemporary cricket, there isn’t a doubt that Ben Stokes might be one of many greatest buys of the IPL 2023 Auctions. The all-rounder was the most costly participant within the 2018 IPL auctions when he was purchased by Rajasthan Royals for Rs. 12.5 cr. Stokes is extensively referred to as an expressive cricketer who depends on his instincts to get his group out of tight conditions. Stokes additionally has nice management talents and his character is appeared upon by kids within the group, which makes him the right position mannequin to have on the facet. Stokes didn’t function in final 12 months’s IPL as he wished to give attention to his psychological well being and well-being, however the former Rajasthan Royals man might be gearing up for the sixteenth version of the match and may anticipate plenty of paddles raised to signal the left-handed all-rounder. Shakib Al Hasan (Base Worth: INR 1.5 crore): One of many best cricketers to emerge from Bangladesh, Shakib Al Hasan has been the spine of a plethora of groups in his embellished cricket profession. The all-rounder is thought for his consistency, accuracy and aggression with the ball in hand and has a variety of pictures when batting. His confidence and temperament have led him and his sides to carry out on the greatest phases each internationally and domestically. He has represented Kolkata Knight Riders and Sunrisers Hyderabad within the IPL and plenty of groups might be trying to deliver him into their squads not only for his cricketing prowess but additionally for his unmatched expertise and skill to deal with strain in clutch conditions. Sam Curran (Base Worth: INR 2 crore):Sam Curran comes into the IPL 2023 Auctions using on the success of England’s win of the ICC Males’s T20 World Cup. The younger all-rounder had an excellent World Cup, not solely profitable the Man of the Match award within the finals but additionally the Man of the Sequence award within the match. The gifted all-rounder has already proven nice performances for Chennai Tremendous Kings in earlier editions of the IPL and is extremely efficient with each bat and ball. Sam Curran’s rising expertise, coupled along with his management qualities make him a perfect purchase for IPL groups. His capacity to clear the fence at the same time as a lower-order batsman and his accuracy when bowling on the loss of life make him a perfect purchase for any group at this 12 months’s public sale. (Aside from the headline, this story has not been edited by NDTV workers and is printed from a syndicated feed.) Featured Video Of The Day India’s Prime FIFA World Cup Last Moments Matters talked about on this article Source link The post IPL Public sale 2023: Three All-rounders Who Will Be On Wishlist Of Each Group | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-22 18:37:43","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Plateaued rights deal may push cricket into private equity","link":"https://www.theage.com.au/sport/cricket/plateaued-rights-deal-may-push-cricket-into-private-equity-20221222-p5c8bg.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Private equity may be the beneficiary of a cricket broadcast deal set to provide the smallest rights uplift for the game in more than 30 years.","content":null,"pubDate":"2022-12-22 18:30:00","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL auctioneer name 2023: Has Hugh Edmeades conducted IPL auction in the past?","link":"https://thesportsrush.com/cricket-news-ipl-auctioneer-name-2023-has-hugh-edmeades-conducted-ipl-auction-in-the-past/","keywords":["Cricket","Hugh Edmeades","Indian Premier League","IPL 2023","IPL 2023 mini auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"The much-anticipated mini auction ahead of IPL 2023 will commence from 02:30 pm (IST) onwards on Friday, in the south Indian city of Kochi. Some big overseas names in Ben Stokes, Cameron Green, Sam Curran, Harry Brook et al, might invite some of the most intense bids at the auction table tomorrow, as the ten… The post IPL auctioneer name 2023: Has Hugh Edmeades conducted IPL auction in the past? appeared first on The SportsRush.","content":"The much-anticipated mini auction ahead of IPL 2023 will commence from 02:30 pm (IST) onwards on Friday, in the south Indian city of Kochi. Some big overseas names in Ben Stokes, Cameron Green, Sam Curran, Harry Brook et al, might invite some of the most intense bids at the auction table tomorrow, as the ten franchises look to rope in the best possible replacements to the ones they had released from their squad ahead of the imminent season. Needless to say, this one-day event might yet again turn out to be the one to remember for a few upcoming stars of the game as well. There might be some intense bidding for the overseas stars of the game, especially after a recent report on Thursday confirmed on the availability of all the players, barring those from Sri Lanka and Bangladesh for the entire duration of the tournament. IPL auctioneer name 2023 The veteran auctioneer, the man who has successfully conducted around 2,700 auction across the world, Hugh Edmeades, will yet again take centre stage as the auctioneer for the IPL mini auction 2023. Edmeadus, who was also the auctioneer during the mega auction ahead of IPL 2022, had grabbed the headlines for a very unfortunate reason. The 62-year-old had suddenly collapsed on the floor while auctioneering the bid for Sri Lankan allrounder Wanindu Hasaranga. In what was later reported as a case of postural hypotension which caused the fall, Edmeadus could not continue with the auction process, and was replaced with the experienced broadcaster Charu Sharma. Read more on Hugh Edmeades, by clicking here. Has Hugh Edmeades conducted IPL auction in the past? The veteran auctioneer, Hugh Edmeadus, will be conducting his fifth IPL auction tomorrow. He had replaced the ever-popular Richard Madley in the year 2018, until when the latter had taken over the auction proceedings since the inception of the league in 2008. A Cricket fan himself, Edmeadus claims to follow the IPL action regularly, and believes his role is that of a referee or the umpire as he is supposed to not show any emotions while calling the bids as franchises battle for a player. The post IPL auctioneer name 2023: Has Hugh Edmeades conducted IPL auction in the past? appeared first on The SportsRush.","pubDate":"2022-12-22 18:22:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Hooda’s second century of the match places Rajasthan in a robust place","link":"https://www.thetimesofbengal.com/sports/hoodas-second-century-of-the-match-places-rajasthan-in-a-robust-place/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Deepak Hooda’s dream 12 months continues. The 12 months noticed him make his India debut The post Hooda’s second century of the match places Rajasthan in a robust place appeared first on The Times of Bengal.","content":"Deepak Hooda’s dream 12 months continues. The 12 months noticed him make his India debut in each the quick codecs and rating runs aplenty for Lucknow Tremendous Giants within the IPL. Now he has twin a whole bunch on his return to First Class cricket. His second century of the match put Rajasthan in a robust place on the third day of the Ranji Trophy match in opposition to Kerala on the Sawai Mansingh Stadium. Worryingly for the guests, Hooda will return to the center on the ultimate morning on Friday, batting on 106 (122b, 6×4, 3×6). Rajasthan was 278 for 5 at stumps, a lead of 309. Hooda, who had scored 133 within the first innings, has thus far placed on 111 for the sixth wicket with wicketkeeper Kunal Rathore (48 batting, 3×4, 1×6). Earlier than that, one other fantastic spell by Jalaj Saxena had put Rajasthan in hassle. The off-spinner eliminated opener Yash Kothari (24, 30b) and Mahipal Lomror off successive balls. In his following over he despatched again Salman Khan to scale back Rajasthan to 49 for 3. However, the opposite opener Abhijeet Tomar (68, 157b, 6×4) stored vigil till he was trapped lbw by left-arm spinner Sijomon Joseph. Earlier, Kerala, which had resumed its first innings at 268 for eight, was bowled out for 306, conceding a lead of 31. Left-arm seamer Aniket Choudhary took each the wickets to complete with 5 for 85, his thirteenth five-wicket haul. Sachin Child remained unbeaten on 139 (217b, 18×4). The scores: Rajasthan — 1st Innings: 337. Kerala — 1st Innings: P. Rahul b Aniket 10, Rohan Prem c Rathore b Aniket 18, Shoun Roger c Menaria b Aniket 0, Sachin Child (not out) 139, Sanju Samson c Salman b Suthar 82, Akshay Chandran run out 5, Jalaj Saxena c sub (Shubham) b Nagarkoti 21, Sijomon Joseph c Nagarkoti b Suthar 10, Basil Thampi lbw b Suthar 0, F. Fanoos b Aniket 0, M.D. Nidheesh b Aniket 4; Extras (b-8, lb-9) 17; Complete (in 82.5 overs): 306. Fall of wickets: 1-22, 2-28, 3-31, 4-176, 5-194, 6-222, 7-264, 8-268, 9-292. Rajasthan bowling: Aniket 20.5-1-85-5, Arafat 11-4-31-0, Nagarkoti 9-1-43-1, Suthar 25-2-87-3, Lomror 14-0-39-0, Tomar 3-2-4-0. Rajasthan — 2nd Innings: Yash Kothari b Jalaj 24, Abhijeet Tomar lbw b Sijomon 68, Mahipal Lomror c Shoun b Jalaj 0, Salman Khan b Jalaj 0, Ashok Menaria c Rahul b Thampi 19, Deepak Hooda (batting) 106, Kunal Rathore (batting) 48; Extras (b-9, lb-3, w-1) 13; Complete (for 5 wkts. in 76 overs): 278. Fall of wickets: 1-47, 2-47, 3-49, 4-94, 5-167. Kerala bowling: Thampi 6-0-27-1, Jalaj 22-2-79-3, Fanoos 15-2-49-0, Nidheesh 10-2-27-0, Sijomon 15-0-56-1, Akshay 7-0-24-0, Shoun 1-0-4-0. Source link The post Hooda’s second century of the match places Rajasthan in a robust place appeared first on The Times of Bengal.","pubDate":"2022-12-22 17:25:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Kuldeep Yadav will have to wait for his chances, says former India selector Saba Karim","link":"https://www.dnaindia.com/cricket/report-kuldeep-yadav-will-have-to-wait-for-his-chances-says-former-india-selector-saba-karim-3012372","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Kuldeep although was snubbed for an extra pacer in the Dhaka Test match and it irked the fans of Indian cricket in social media.","content":null,"pubDate":"2022-12-22 17:25:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Indians React As Jofra Archer Will get Recalled To England Squad Forward Of IPL 2023 Public sale | Cricket Information","link":"https://www.thetimesofbengal.com/sports/mumbai-indians-react-as-jofra-archer-will-get-recalled-to-england-squad-forward-of-ipl-2023-public-sale-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Purchased within the Indian Premier League (IPL) 2022 mega public sale by Mumbai Indians, Jofra The post Mumbai Indians React As Jofra Archer Will get Recalled To England Squad Forward Of IPL 2023 Public sale | Cricket Information appeared first on The Times of Bengal.","content":"Purchased within the Indian Premier League (IPL) 2022 mega public sale by Mumbai Indians, Jofra Archer is but for use by his new franchise within the T20 league. The England pacer has been fighting accidents for the previous couple of years and wasn’t even make it to the nation’s squad for the T20 World Cups in 2021 and 2022. Having final represented England in March 2021, Archer has lastly made his comeback for the nationwide staff. His return, nonetheless, comes proper earlier than the IPL 2023 public sale, and his franchise Mumbai Indians could not be happier. Archer was named Thursday in a 14-strong squad for a three-match one-day worldwide sequence in South Africa. Mumbai Indians, in a publish on Twitter, highlighted how comfortable they had been seeing Archer being in England colors. JOF in colors Phrases that make us go: #OneFamily @JofraArcher @ICC pic.twitter.com/Bk5uFNaCME — Mumbai Indians (@mipaltan) December 22, 2022 The Sussex quick bowler Archer made a dramatic entry onto the worldwide stage in 2019 when he turned one of many stars of England’s 50-over World Cup triumph. However he has not performed worldwide cricket since March 2021 because of damage. The 27-year-old Barbados-born fast suffered a number of elbow issues, which led to 2 operations earlier than his hopes of a return to motion had been dashed by a stress fracture of the decrease again in Might that dominated him out of the 2022 English season. Archer, nonetheless, performed for the second-string England Lions in a warm-up match towards the Check aspect in Abu Dhabi final month forward of the senior staff’s 3-0 whitewash of Pakistan. Simply six balls into the follow match, Archer hit Zak Crawley on the helmet with a bouncer. An England and Wales Cricket Board assertion issued Thursday mentioned Archer was “recovering properly from an elbow damage and is anticipated to return to worldwide cricket in South Africa subsequent month”. With AFP inputs Featured Video Of The Day “Soccer In Argentina Is A Ardour”: Argentinian Envoy To NDTV Matters talked about on this article Source link The post Mumbai Indians React As Jofra Archer Will get Recalled To England Squad Forward Of IPL 2023 Public sale | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-22 17:13:30","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Ajaz Patel wants to end rollercoaster year with wickets when Black Caps face Pakistan","link":"https://www.nzherald.co.nz/sport/cricket-ajaz-patel-wants-to-end-rollercoaster-year-with-wickets-when-black-caps-face-pakistan/EY434GFFZFGQ7K5BVHDA5R6DDE/","keywords":null,"creator":null,"video_url":null,"description":"Two prizes awaiting in Pakistan will ensure Ajaz Patel’s unusual year ends on a high.","content":null,"pubDate":"2022-12-22 17:00:00","image_url":"https://www.nzherald.co.nz/resizer/WtXV3HXOvgqlAUrotV6sWnP_TQE=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/JJ7G6AR7JFCRNCQKX6M33C5Z4M.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Star speedster Archer returns to English squad for South Africa ODIs","link":"https://www.thetimesofbengal.com/sports/star-speedster-archer-returns-to-english-squad-for-south-africa-odis/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"By AFP LONDON: Jofra Archer is poised to make an eagerly-anticipated England comeback within the new The post Star speedster Archer returns to English squad for South Africa ODIs appeared first on The Times of Bengal.","content":"By AFP LONDON: Jofra Archer is poised to make an eagerly-anticipated England comeback within the new 12 months after being named Thursday in a 14-strong squad for a three-match one-day worldwide collection in South Africa. Sussex quick bowler Archer made a dramatic entry onto the worldwide stage in 2019 when he turned one of many stars of England’s 50-over World Cup triumph. However he has not performed worldwide cricket since March 2021 because of harm. The 27-year-old Barbados-born rapidly suffered a number of elbow issues, which led to 2 operations earlier than his hopes of a return to motion had been dashed by a stress fracture of the decrease again in Might that dominated him out of the 2022 English season. Archer, nevertheless, performed for the second-string England Lions in a warm-up match towards the Check facet in Abu Dhabi final month forward of the senior staff’s 3-0 whitewash of Pakistan. Simply six balls into the observe match, Archer hit Zak Crawley on the helmet with a bouncer. An England and Wales Cricket Board assertion issued Thursday mentioned Archer was “recovering effectively from an elbow harm and is predicted to return to worldwide cricket in South Africa subsequent month”. Brook set for ODI debut In the meantime, rising star Harry Brook, contemporary from three very good Check tons of in Pakistan and England’s T20 World Cup win in Australia, has been known as into an ODI squad for the primary time. The 23-year-old Yorkshireman has been a mainstay throughout an already busy England tour programme however staff administration have determined towards resting him forward of a Check collection in New Zealand in February. Excellent batsman Joe Root and specific quick bowler Mark Wooden have although been unnoticed, although, as England look to handle the workloads of their multi-format gamers. Opener Ben Duckett, who performed the final of his three ODIs in 2016, has been recalled to the 50-over set-up after regaining his England place on the T20 and Check degree in latest months. Left-arm fast Reece Topley, unluckily dominated out of the T20 World Cup marketing campaign after tripping on a boundary sponge, has additionally been included in a squad that can once more be led by white-ball captain Jos Buttler. However all-rounder Liam Livingstone has been dominated out with the knee harm he suffered on his Check debut towards Pakistan in Rawalpindi. The three-match contest in South Africa is a rearranged collection that was initially deserted in December 2020 after a Covid-19 scare prompted England to fly dwelling early. Will probably be performed over six days, with two fixtures in Bloemfontein beginning on January 27 earlier than the ultimate recreation takes place in Kimberley on February 1. England’s ODI squad Jos Buttler (Lancashire, capt and wk), Moeen Ali (Warwickshire), Jofra Archer (Sussex), Harry Brook (Yorkshire), Sam Curran (Surrey), Ben Duckett (Nottinghamshire), Dawid Malan (Yorkshire), Adil Rashid (Yorkshire), Jason Roy (Surrey), Phil Salt (Lancashire), Olly Stone (Nottinghamshire), Reece Topley (Surrey), David Willey (Northamptonshire), Chris Woakes (Warwickshire) Fixtures Jan 27: South Africa v England, 1st ODI, BloemfonteinJan 29: South Africa v England, 2nd ODI, BloemfonteinFeb 1: South Africa v England, third ODI, Kimberley LONDON: Jofra Archer is poised to make an eagerly-anticipated England comeback within the new 12 months after being named Thursday in a 14-strong squad for a three-match one-day worldwide collection in South Africa. Sussex quick bowler Archer made a dramatic entry onto the worldwide stage in 2019 when he turned one of many stars of England’s 50-over World Cup triumph. However he has not performed worldwide cricket since March 2021 because of harm. The 27-year-old Barbados-born rapidly suffered a number of elbow issues, which led to 2 operations earlier than his hopes of a return to motion had been dashed by a stress fracture of the decrease again in Might that dominated him out of the 2022 English season. Archer, nevertheless, performed for the second-string England Lions in a warm-up match towards the Check facet in Abu Dhabi final month forward of the senior staff’s 3-0 whitewash of Pakistan. Simply six balls into the observe match, Archer hit Zak Crawley on the helmet with a bouncer. An England and Wales Cricket Board assertion issued Thursday mentioned Archer was “recovering effectively from an elbow harm and is predicted to return to worldwide cricket in South Africa subsequent month”. Brook set for ODI debut In the meantime, rising star Harry Brook, contemporary from three very good Check tons of in Pakistan and England’s T20 World Cup win in Australia, has been known as into an ODI squad for the primary time. The 23-year-old Yorkshireman has been a mainstay throughout an already busy England tour programme however staff administration have determined towards resting him forward of a Check collection in New Zealand in February. Excellent batsman Joe Root and specific quick bowler Mark Wooden have although been unnoticed, although, as England look to handle the workloads of their multi-format gamers. Opener Ben Duckett, who performed the final of his three ODIs in 2016, has been recalled to the 50-over set-up after regaining his England place on the T20 and Check degree in latest months. Left-arm fast Reece Topley, unluckily dominated out of the T20 World Cup marketing campaign after tripping on a boundary sponge, has additionally been included in a squad that can once more be led by white-ball captain Jos Buttler. However all-rounder Liam Livingstone has been dominated out with the knee harm he suffered on his Check debut towards Pakistan in Rawalpindi. The three-match contest in South Africa is a rearranged collection that was initially deserted in December 2020 after a Covid-19 scare prompted England to fly dwelling early. Will probably be performed over six days, with two fixtures in Bloemfontein beginning on January 27 earlier than the ultimate recreation takes place in Kimberley on February 1. England’s ODI squad Jos Buttler (Lancashire, capt and wk), Moeen Ali (Warwickshire), Jofra Archer (Sussex), Harry Brook (Yorkshire), Sam Curran (Surrey), Ben Duckett (Nottinghamshire), Dawid Malan (Yorkshire), Adil Rashid (Yorkshire), Jason Roy (Surrey), Phil Salt (Lancashire), Olly Stone (Nottinghamshire), Reece Topley (Surrey), David Willey (Northamptonshire), Chris Woakes (Warwickshire) Fixtures Jan 27: South Africa v England, 1st ODI, BloemfonteinJan 29: South Africa v England, 2nd ODI, BloemfonteinFeb 1: South Africa v England, third ODI, Kimberley Source link The post Star speedster Archer returns to English squad for South Africa ODIs appeared first on The Times of Bengal.","pubDate":"2022-12-22 16:49:42","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Yorkshire star Adam Lyth's bowling suspension is removed","link":"https://www.yorkpress.co.uk/sport/23209454.yorkshire-star-adam-lyths-bowling-suspension-removed/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"ADAM LYTH'S suspension from bowling in county cricket has been lifted.","content":null,"pubDate":"2022-12-22 16:45:11","image_url":"https://www.yorkpress.co.uk/resources/images/16294861/?type=app&htype=0","source_id":"yorkpress","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Bail Mysteriously Falls Throughout BBL Match; Commentators, Gamers Left Shocked. Watch Video | Cricket Information","link":"https://www.thetimesofbengal.com/sports/bail-mysteriously-falls-throughout-bbl-match-commentators-gamers-left-shocked-watch-video-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Melbourne Renegades are having a blistering run within the ongoing season of the Huge Bash The post Bail Mysteriously Falls Throughout BBL Match; Commentators, Gamers Left Shocked. Watch Video | Cricket Information appeared first on The Times of Bengal.","content":"Melbourne Renegades are having a blistering run within the ongoing season of the Huge Bash League 2022-23. The Melbourne-based franchise is holding the second spot within the factors desk and has remained unbeaten in all three video games to date. Of their earlier match, the Nic Maddinson-led aspect registered a four-wicket win over Brisbane Warmth and accomplished their hattrick of victories. Nevertheless, a really unusual incident occurred throughout the Renegades’ first conflict towards Brisbane Warmth, which left the commentators and the gamers puzzled. It occurred throughout the ninth over of the Renegades’ innings when their skipper Maddinson was on the strike. Maddinson performed a shot on Mark Steketee‘s supply and tried to run for a single. However bails fell off the stumps and everybody assumed it was a hit-wicket incident. Nevertheless, the story took a wierd flip when the replay confirmed that Maddinson didn’t even inch nearer to the stumps and the bails had fallen on their very own. What on earth??? Seems to be just like the wind’s knocked the bail off! Maddinson stays secure @KFCAustralia #BucketMoment #BBL12 pic.twitter.com/sboxGvIewA — KFC Huge Bash League (@BBL) December 15, 2022 The incident left everybody confused and Maddinson was declared not out by the third umpire. Coming to the match, Maddinson smashed 87 runs off 49 balls and took to his aspect to a complete of 166/7 in 20 overs. In return, Brisbane Warmth had been restricted at 144/6, to the courtesy of the three-wicket haul by Akeal Hossein. Melbourne Renegades will now be going up towards Hobart Hurricanes whereas Brisbane Warmth can be going through Adelaide Strikers of their subsequent match. Featured Video Of The Day Video: Messi’s Argentina Arrive Again In Buenos Aires After FIFA WC Triumph Subjects talked about on this article Source link The post Bail Mysteriously Falls Throughout BBL Match; Commentators, Gamers Left Shocked. Watch Video | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-22 16:25:31","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023: BCCI updates franchises Bangladesh, Sri Lanka gamers to be obtainable solely after April 8","link":"https://www.thetimesofbengal.com/sports/ipl-2023-bcci-updates-franchises-bangladesh-sri-lanka-gamers-to-be-obtainable-solely-after-april-8/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Forward of Friday’s Indian Premier League (IPL) 2023 public sale, the Board of Management for The post IPL 2023: BCCI updates franchises Bangladesh, Sri Lanka gamers to be obtainable solely after April 8 appeared first on The Times of Bengal.","content":"Forward of Friday’s Indian Premier League (IPL) 2023 public sale, the Board of Management for Cricket in India (BCCI) has knowledgeable the ten franchises that the Bangladesh gamers, who will function within the Eire collection, will solely be obtainable between April 8 and Could 1. The Sri Lankan gamers, too, will probably be obtainable from April 8 attributable to their prior worldwide commitments. A complete of 4 gamers from Bangladesh have been shortlisted within the public sale, whereas there are 10 gamers from Sri Lanka. In response to the data shared with the IPL franchises, the gamers from England and Australia are anticipated to be obtainable for your entire length. This basically signifies that the cricket boards of Australia and England are anticipated to present No Objection Certificates (NOC) to its gamers for your entire length. “That’s what we have heard so far, unless of course there are any last-minute changes,” a crew official within the know of issues informed Sportstar. With the event prone to start within the first week of April, the gamers from New Zealand, South Africa, West Indies will probably be obtainable all through the event. The ultimate public sale pool can have 405 gamers from the initially registered 991, with a most of 87 slots obtainable to be crammed by the ten franchises. Of those, 30 will probably be abroad gamers. There will probably be a complete of 273 Indian gamers, and 132 abroad – together with 4 from Affiliate nations. There are 119 capped gamers and 286 uncapped. Source link The post IPL 2023: BCCI updates franchises Bangladesh, Sri Lanka gamers to be obtainable solely after April 8 appeared first on The Times of Bengal.","pubDate":"2022-12-22 16:01:29","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"On Group India And Asia Cup Controversy, New Pakistan Board Chief Has His Say | Cricket Information","link":"https://www.thetimesofbengal.com/sports/on-group-india-and-asia-cup-controversy-new-pakistan-board-chief-has-his-say-cricket-information/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The Pakistan Cricket Board (PCB) has undergone a basic change, with chief Ramiz Raja being The post On Group India And Asia Cup Controversy, New Pakistan Board Chief Has His Say | Cricket Information appeared first on The Times of Bengal.","content":"The Pakistan Cricket Board (PCB) has undergone a basic change, with chief Ramiz Raja being changed by Najam Sethi. As the brand new PCB boss addressed the media on Thursday, questions in regards to the ‘Asia Cup controversy’ have been certain to be requested. Whereas the Board of Management for Cricket in India (BCCI) secretary Jay Shah had outrightly refused when the query of sending the gamers to Pakistan for the match arose, former PCB chief Ramiz Raja had threatened to reciprocate by not sending the Pakistan staff to India for 2023 ODI World Cup. When Sethi was requested about his views because the PCB boss about your entire topic, he mentioned it was “too early” for him to remark. In a media briefing, Sethi mentioned: “It is too early for me to say. These points might be mentioned with the interior committee. I do not know what selections have been taken by the earlier regime. I’ve learn plenty of issues however it’ll be higher if we evaluate the scenario and determine what message we need to convey. However in terms of India, all of it is dependent upon the Pakistan authorities’s choice. The steerage comes from there solely.” Sethi was additionally requested in regards to the number of the Pakistan staff for the New Zealand sequence. When requested for his views in regards to the staff, Sethi mentioned that this wasn’t the suitable time to recommend whether or not a change ought to be made within the staff. “A cricket staff has been introduced. I do not know if it is cheap proper now to take any choice on if we should always change something or if we should always maintain the staff as it’s. There are two factors of view and we’ll focus on it. It will be higher if there aren’t any extra questions on this as a result of we have not made any choice on it. If the staff wasn’t introduced, we might have most likely approached it with new concepts however that chance might be not there anymore. However we’ll see,” he confused. With the arrival of Najam Sethi, the PCB has additionally introduced again the 2014 structure. Featured Video Of The Day Anurag Thakur Felicitates Indian Blind Cricket Group After T20 World Cup Win Matters talked about on this article Source link The post On Group India And Asia Cup Controversy, New Pakistan Board Chief Has His Say | Cricket Information appeared first on The Times of Bengal.","pubDate":"2022-12-22 15:37:30","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy 2022-23: Hooda slams one other ton as Rajasthan takes innings lead over Kerala","link":"https://www.thetimesofbengal.com/sports/ranji-trophy-2022-23-hooda-slams-one-other-ton-as-rajasthan-takes-innings-lead-over-kerala/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Deepak Hooda’s dream yr continues. The yr noticed him make his India debut within the The post Ranji Trophy 2022-23: Hooda slams one other ton as Rajasthan takes innings lead over Kerala appeared first on The Times of Bengal.","content":"Deepak Hooda’s dream yr continues. The yr noticed him make his India debut within the limited-overs codecs and rating runs aplenty for Lucknow Tremendous Giants within the IPL. Now he has twin a whole bunch on his return to First Class cricket. It has put his new facet, Rajasthan, in a robust place on the third day within the Ranji Trophy match in opposition to Kerala at Jaipur’s Sawai Mansingh Stadium. Worryingly for the customer, Hooda will return to the center on the ultimate morning on Friday, batting on 106 (122b, 6×4, 3×6). Rajasthan was 278 for 5 at stumps with a lead of 309. Hooda, who had scored 133 within the first innings, has put 111 for the unfinished sixth wicket with wicketkeeper Kunal Rathore (48 batting, 3×4, 1×6). Earlier than that, one other advantageous spell by Jalaj Saxena had put Rajasthan in hassle. The off-spinner eliminated opener Yash Kothari (24, 30b) and Mahipal Lomror off successive balls. In his following over he despatched again Salman Khan to scale back Rajasthan to 49 for 3. However, the opposite opener Abhijeet Tomar (68, 157b, 6×4), stored vigil till he was trapped lbw by left-arm spinner Sijomon Joseph. Earlier, Kerala, which had resumed its first innings at 268 for eight, was bowled out for 306, conceding a lead of 31. Left-arm seamer Aniket Choudhary took each the wickets to complete with 5 for 85, his thirteenth five-wicket haul. Sachin Child, who had are available at No. 4, remained unbeaten on 139 (217b, 18×4). Rajasthan – 1st Innings: 337. Kerala — 1st Innings: P. Rahul b Aniket 10, Rohan Prem c Rathore b Aniket 18, Shoun Roger c Menaria b Aniket 0, Sachin Child (not out) 139, Sanju Samson c Salman b Suthar 82, Akshay Chandran run out 5, Jalaj Saxena c sub (Shubham) b Nagarkoti 21, Sijomon Joseph c Nagarkoti b Suthar 10, Basil Thampi lbw b Suthar 0, F. Fanoos b Aniket 0, M.D. Nidheesh b Aniket 4; Extras (b-8, lb-9) 17; Complete (in 82.5 overs): 306. Fall of wickets: 1-22, 2-28, 3-31, 4-176, 5-194, 6-222, 7-264, 8-268, 9-292. Rajasthan bowling: Aniket 20.5-1-85-5, Arafat 11-4-31-0, Nagarkoti 9-1-43-1, Suthar 25-2-87-3, Lomror 14-0-39-0, Tomar 3-2-4-0. Rajasthan — 2nd Innings: Yash Kothari b Jalaj 24, Abhijeet Tomar lbw b Sijomon 68, Mahipal Lomror c Shoun b Jalaj 0, Salman Khan b Jalaj 0, Ashok Menaria c Rahul b Thampi 19, Deepak Hooda (batting) 106, Kunal Rathore (batting) 48; Extras (b-9, lb-3, w-1) 13; Complete (for 5 wkts. in 76 overs): 278. Fall of wickets: 1-47, 2-47, 3-49, 4-94, 5-167. Kerala bowling: Thampi 6-0-27-1, Jalaj 22-2-79-3, Fanoos 15-2-49-0, Nidheesh 10-2-27-0, Sijomon 15-0-56-1, Akshay 7-0-24-0, Shoun 1-0-4-0. Source link The post Ranji Trophy 2022-23: Hooda slams one other ton as Rajasthan takes innings lead over Kerala appeared first on The Times of Bengal.","pubDate":"2022-12-22 15:25:39","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Both govts have to be consulted when it comes to bilateral cricket: Sethi","link":"https://www.business-standard.com/article/sports/both-govts-have-to-be-consulted-when-it-comes-to-bilateral-cricket-sethi-122122200844_1.html","keywords":null,"creator":null,"video_url":null,"description":"The head of Pakistan Cricket Board's (PCB) management committee Najam Sethi on Thursday made it clear that he would act on the advice of the government when it comes to cricket relations with India. Sethi was on Wednesday appointed chairman of a 14-member committee to run the affairs of the game in the country for the next four months after Ramiz Raja was removed as PCB chief. \"Governments in both countries have to be consulted when it comes to bilateral and other cricket relations between Pakistan and India,\" Sethi told reporters in Lahore. India hasn't travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terrorist attack on November 26 that year, the scheduled bilateral series in early 2009 was cancelled. Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn't been any bilateral cricket. The two teams have only played each other at various International Cricket Council (ICC) and Asian Cricket Council (ACC","content":"The head of Pakistan Cricket Board's (PCB) management committee Najam Sethi on Thursday made it clear that he would act on the advice of the government when it comes to cricket relations with India. Sethi was on Wednesday appointed chairman of a 14-member committee to run the affairs of the game in the country for the next four months after Ramiz Raja was removed as PCB chief. \"Governments in both countries have to be consulted when it comes to bilateral and other cricket relations between Pakistan and India,\" Sethi told reporters in Lahore. India hasn't travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terrorist attack on November 26 that year, the scheduled bilateral series in early 2009 was cancelled. Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn't been any bilateral cricket. The two teams have only played each other at various International Cricket Council (ICC) and Asian Cricket Council (ACC) events. A controversy had erupted in October, when ACC president and BCCI secretary Jay Shah said that India will not travel to Pakistan next year for the 50-over Asia Cup -- likely to be held in September 2023 -- after which the PCB had threatened to pull out of the 50-over World Cup to be held in India next year. Sethi said his main task was to fully implement the 2014 constitution and revive the Board of Governors and General Body under the old system and hold elections within 120 days. But Sethi, who was chairman and CEO between 2013 and 2018 before resigning after the Imran Khan-led government took charge in 2018, appeared unhappy with the announcement of the Pakistan Test squad for the home series against New Zealand by the old management. \"I don't know whether there is a need to make changes in the squad, we will see if fresh ideas are required. It would have been better if the squad had not been announced, he said. The government on Wednesday night issued a notification confirming the appointment of the management committee while removing Ramiz Raja, but the sitting chief selector Muhammad Wasim announced the squad for the NZ series. Sethi dropped clear hints that there would be changes in the Board, including in cricket-related areas. I think we had done a good job in our four-five year tenure before I resigned. But what has happened in the last four years everyone can see, he said. Sethi also made it clear that the country's prime minister wanted a revival of departmental teams and the regional cricket associations. That is our main priority to revive departmental cricket because in the last four years we have seen a terrible rise in unemployment and a famine in cricket talent. The old system worked well for us and we got players from domestic cricket. Nowadays it seems we are only getting players from PSL, he said. Sethi said all the groundwork for launching the Pakistan Super League and convincing international teams to return to playing in Pakistan was done in his last tenure. It is good that all teams are now touring Pakistan and the New Zealand team's tour is very important for us. But we also have to ensure a steady supply of talent from our domestic cricket, he said. Sethi also expressed his concern over the selection issues and performance of the team in the recent Test series against England which Pakistan lost 0-3. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-12-22 15:18:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221222/thumb-122122200844.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"What’s There in a Name: CVs of Tendulkar, Dhoni, Sehwag for national selectors’ posts sent from spam emails","link":"https://www.tribuneindia.com/news/sports/whats-there-in-a-name-cvs-of-tendulkar-dhoni-sehwag-for-national-selectors-posts-sent-from-spam-emails-463541","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, December 22 When the BCCI mandarins opened the mail box to check the CVs of prospective national selection committee candidates, they were in for a shock to find applications from Sachin Tendulkar, Mahendra Singh Dhoni and Virender Sehwag. And if that wasn't enough, there was Pakistan captain Inzamam ul Haq also offering his candidature for the position. Only that all these CVs were posted using spam email ids from imposters wanting to have some fun at BCCI's expense. The BCCI has received over 600 e-mail applications for the five-member selection panel and a some of them have come from fake ids claiming to be Tendulkar, Dhoni, Sehwag and Inzamam. On a serious note, the Cricket Advisory Committee is expected to shortlist 10 names for the high-profile positions. \"Around 600 applications have been received and some of them have come from fake ids claiming to be Dhoni, Sehwag and Tendulkar. They are simply wasting BCCI's time by doing that. \"The CAC will shortlist 10 candidates and then choose the final five. The process will be completed soon,\" a BCCI source told PTI. The BCCI had sacked the Chetan-Sharma led selection panel following the team's semifinal exit from the T20 World Cup last month. However, that panel continues to remain in operation with their successors not finalised. The committee had also followed the first round of Ranji Trophy and are watching the second round. Debasish Mohanty is in Kolkata watching the Bengal vs Himachal Pradesh match. On Wednesday, the BCCI Apex Council could not clear the central contracts of the players as the selection committee is yet to be formed and its input is needed before the list is finalised. The CAC comprising Ashok Malhotra, Jatin Paranjpe and Sulakshna Naik, which was appointed earlier this month, is expected to meet soon to complete the job. Besides deciding the central contracts, the selection panel's initial task will be to pick teams for the home series against Sri Lanka and New Zealand starting January 3.","content":null,"pubDate":"2022-12-22 14:42:02","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1164341915.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan government advice a must on bilateral cricket ties with India: PCB chief Najam Sethi","link":"https://www.dnaindia.com/cricket/report-govt-advice-a-must-on-bilateral-cricket-ties-with-india-pcb-chief-najam-sethi-3012348","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"After Ramiz Raja was fired as PCB chief, Sethi was named chairman of a 14-member committee to oversee the game in the country for the next 4 months.","content":null,"pubDate":"2022-12-22 14:02:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2023 Auction: From Ishan Kishan to Ben Stokes; most expensive player of each auction since 2008","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-auction-from-ishan-kishan-to-ben-stokes-most-expensive-player-of-each-auction-since-2008-11856261.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2023 Auction: From Ishan Kishan to Ben Stokes; most expensive player of each auction since 2008","content":"Cricket IPL 2023 Auction: From Ishan Kishan to Ben Stokes; most expensive player of each auction since 2008 India becoming the champions of the 2007 T20 World Cup paved the way for MS Dhoni to become the most expensive player in the inaugural season of the IPL. FP Trending December 22nd, 2022 19:18:16 IST Ishan Kishan of Mumbai Indians. Sportzpics The mega auction for the 15th edition of the Indian Premier League (IPL 2023) will take place tomorrow, 23 December. Though the initial list of players had 991 names, 405 shortlisted cricketers will go under the hammer during the auction beginning at 2:30 PM IST. Since the introduction of the cash-rich tournament in 2008, a number of players have raised eyebrows by earning a whooping price in each edition. With every passing year, the viewership of the IPL auction has witnessed a significant boost. The IPL 2023 auction will be streamed live on the Jio Cinema mobile app and website for free. MUST CHECK: IPL 2023 Auction: Players list, venue, date, time, livestream, purse remaining, rules; all you need to know Ahead of the auction day, here we have listed the most expensive players of the franchise tournament so far: IPL 2022- Ishan Kishan (Mumbai Indians), Price: 15.25 Cr. A core member of the Mumbai Indians family, Ishan Kishan was released ahead of the 2022 season. However, the franchise finally decided to repurchase the left-handed batter and had to pay a huge sum of 15.25 crore. Mumbai finished at the bottom of the table with Kishan racking up 418 runs during the campaign. IPL 2021- Chris Morris (Rajasthan Royals), Price: 16.25 Cr. Seamer all-rounder Chris Morris seemed to have good value thanks to his impressive performance in the RCB outfit in 2020. But, the South African cricketer turned out to be the most expensive buy when Rajasthan sealed the deal for Rs 16.25 crore. Though he could not get enough opportunity with the bat, Morris fetched 15 wickets in IPL 2021. IPL 2020- Pat Cummins (Kolkata Knight Riders), Price: 15.5 Cr. Kolkata Knight Riders registered the highest bid of the 2020 auction to sign Australian all-rounder Pat Cummins. Cummins had a long-term experience playing in the tournament that led the price to reach a sky-high figure of Rs 15.5 crore. But, he could not live up to the expectations. The right-arm pacer picked up 12 wickets and managed to score just 146 runs. IPL 2019- Jaydev Unadkat (Rajasthan Royals) & Varun Chakravarty (Kolkata Knight Riders), Price: 8.4 Cr. In an unpredictable occurrence, two Indian cricketers- Jaydev Unadkat and Varun Chakravarty received the highest bid of the year, Rs 8.4 crore. While Rajasthan bought Unadkat to strengthen their bowling attack, Chakravarty joined the Knight Riders. Though Unadkat got 12 wickets under his belt, Chakravarty played just one game. IPL 2018- Ben Stokes (Rajasthan Royals), Price: 12.5 Cr. Coming off a two-year ban, Rajasthan Royals made headlines by signing English all-rounder Ben Stokes for a whopping Rs 12.5 crore. As Stokes was well-recognised for his expertise in every format, the deal was not quite surprising. However, the cricketer emerged to be a huge disappointment. He could only take 8 wickets and recorded 196 runs with the bat. IPL 2017- Ben Stokes (Rising Pune Supergiants), Price: 14.5 Cr. Ben Stoke stole the show in his maiden IPL auction after new-entrant RPSG shelled out Rs 14.5 crore to appoint him. The Englishman played a pivotal role in his team’s journey till the final. He notched up 316 runs and also got 12 wickets to his name. IPL 2016- Shane Watson (Royal Challengers Bangalore), Price: 9.5 Cr. Bangalore slashed out Rs 9.5 crore on all-rounder Shane Watson which clicked well for the side. The opening batter failed to shine with the bat but was remarkable in the bowling department. He scalped 20 wickets, with RCB becoming the runners-up of that edition. IPL 2015- Yuvraj Singh (Delhi Daredevils), Price: 16 Cr. India’s white-ball specialist Yuvraj Singh topped the tally of highest-bid players for the consecutive second time in the 2015 IPL auction. With Delhi Daredevils picking him for Rs 16 crore, the iconic all-rounder became the most expensive Indian player in the tournament’s history so far. He served the franchise for just one season and recorded 276 runs. IPL 2014- Yuvraj Singh (Royal Challengers Bangalore), Price: 14 Cr. The Bangalore-based side was quite interested in signing Yuvraj Singh and finalised the deal for a staggering Rs 14 crore. During his one-year stint there, the Southpaw amassed 376 runs along and picked up 5 wickets. IPL 2013- Glenn Maxwell (Mumbai Indians), Price: 6.3 Cr. Australian batter Glenn Maxwell, a leading figure in T20 cricket, became the costliest pick of the 2013 mega auction. Since Mumbai Indians could not find any better choice, they spent Rs 6.3 crore to sign Maxwell. The right-handed batter was sidelined in most of the fixtures and managed to gather 36 runs in three appearances. IPL 2012- Ravindra Jadeja (Chennai Super Kings), Price: 12.8 Cr. The Yellow Army, led by MS Dhoni, was quite keen to have Ravindra Jadeja thanks to his great understanding with the ex-India skipper. Chennai stuck to the bidding for a long time and finally bagged the deal for Rs 12.8 crore. Jadeja turned out to be a fruitful investment and had a major contribution in CSK lifting the IPL trophy in 2018 and 2021. IPL 2011- Gautam Gambhir (Kolkata Knight Riders), Price: 14.9 Cr. Ahead of the 2011 season, KKR purchased Indian star batter Gautam Gambhir for Rs 14.9 crore and assigned him the captaincy. The decision did not disappoint the franchise as, under Gambhir’s leadership, Kolkata won their maiden IPL title in 2012. They repeated the feat in 2014. IPL 2010- Shane Bond (Kolkata Knight Riders) & Kieron Pollard (Mumbai Indians), Price: 4.8 Cr. New Zealand quick Shane Bond and West Indies all-rounder Kieron Pollard jointly held the highest bid of the 2010 auction. Bond was picked up by Kolkata, while Pollard made his IPL debut in the Mumbai-based franchise. Bond featured in 8 matches and managed to fetch 9 wickets in the season. On the other hand, Pollard went on to become a core member of the Mumbai franchise and helped them lift the trophy five times. IPL 2009- Kevin Pietersen (Royal Challengers Bangalore) & Andrew Flintoff (Chennai Super Kings), Price: 9.8 Cr. Pietersen and Flintoff, two prominent English cricketers, received the highest bids in the 2009 IPL auction. Both teams went for Rs 9.8 crore, with CSK purchasing the all-rounder and RCB acquiring the renowned batter. Both cricketers did not perform up to expectations. Pietersen registered 96 runs in 6 games and Flintoff got just 2 wickets under his belt while scoring 62 runs in 3 matches. IPL 2008- MS Dhoni (Chennai Super Kings), Price: 9.5 Cr. India became the champions of the 2007 T20 World Cup. The feat unquestionably paved the way for MS Dhoni to receive a good price in the inaugural season of the IPL. Chennai Super Kings clinched the deal for Rs 9.5 crore and the bonding still persists. Under Dhoni’s captaincy, CSK lifted the title four times, making them the tournament’s second most successful side so far. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 22, 2022 19:18:16 IST Tags: Cricket Ipl Ipl 2023 Auction Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-22 13:48:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Ishan-Kishan-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN | Umesh, Ashwin Abaram: Bangladesh all out for 227 runs","link":"https://thenewsglory.com/ind-vs-ban-umesh-ashwin-abaram-bangladesh-all-out-for-227-runs/","keywords":["Sports","Bangladesh","Cricket","game","India"],"creator":["The News Glory"],"video_url":null,"description":"Dhaka: In the second Test match between India and Bangladesh, Bangladesh team is all out for 227 runs. Umesh Yadav and Ashwin have taken 4 wickets each for the Indian team. The Indian team has scored 19 runs at the end of the first day’s play. Indian cricket team is touring Bangladesh and playing cricket […]","content":"Dhaka: In the second Test match between India and Bangladesh, Bangladesh team is all out for 227 runs. Umesh Yadav and Ashwin have taken 4 wickets each for the Indian team. The Indian team has scored 19 runs at the end of the first day’s play. Indian cricket team is touring Bangladesh and playing cricket series. Both teams are currently playing a 2-match Test series. The Indian team is leading 1-0 in this series. In this context, Bangladesh won the toss and elected to bat in the second Test match which started in Dhaka today. However, the team scored 227 runs in 73.5 overs losing all wickets. Mominul Haq batted well. Facing 157 balls, he scored 84 runs and got out. Ashwin took his wicket. Players like Liton Das and Rahim played in the field for a while. But they could not stand and dance for long. Among the Indian bowlers, Ashwin and Umesh Yadav took 4 wickets each. Unathgat had taken 2 wickets. Siraj and Axar Patel remained wicketless in the first innings. The Indian team continued to bat. At the end of the first day’s play, he batted 8 overs and scored 19 runs. Captain Rahul and Subman Gill are in the field. Overall, the first day of the tournament ended in favor of the Indian team. If the Indian team does not lose wickets at the start of the second day tomorrow, there is a chance to accumulate more runs.","pubDate":"2022-12-22 12:44:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Governments in both countries have to be consulted when it comes to bilateral cricket between India and Pakistan: Najam Sethi","link":"https://www.tribuneindia.com/news/sports/governments-in-both-countries-have-to-be-consulted-when-it-comes-to-bilateral-cricket-between-india-and-pakistan-najam-sethi-463533","keywords":null,"creator":null,"video_url":null,"description":"Karachi, December 22The head of Pakistan Cricket Board's (PCB) management committee Najam Sethi on Thursday made it clear that he would act on the advice of the government when it comes to cricket relations with India.Sethi was on Wednesday appointed chairman of a 14-member committee to run the affairs of the game in the country for the next four months after Ramiz Raja was removed as PCB chief.\"Governments in both countries have to be consulted when it comes to bilateral and other cricket relations between Pakistan and India,\" Sethi told reporters in Lahore.India hasn't travelled to Pakistan since the 2008 Asia Cup, and after the Mumbai terrorist attack on November 26 that year, the scheduled bilateral series in early 2009 was cancelled.Pakistan did travel to India for a short six-match white-ball series in 2012, but in the last 10 years, there hasn't been any bilateral cricket. The two teams have only played each other at various International Cricket Council (ICC) and Asian Cricket Council (ACC) events.A controversy had erupted in October, when ACC president and BCCI secretary Jay Shah said that India will not travel to Pakistan next year for the 50-over Asia Cup—likely to be held in September 2023 -- after which the PCB had threatened to pull out of the 50-over World Cup to be held in India next year.Sethi said his main task was to fully implement the 2014 constitution and revive the Board of Governors and General Body under the old system and hold elections within 120 days.But Sethi, who was chairman and CEO between 2013 and 2018 before resigning after the Imran Khan-led government took charge in 2018, appeared unhappy with the announcement of the Pakistan Test squad for the home series against New Zealand by the old management.\"I don't know whether there is a need to make changes in the squad, we will see if fresh ideas are required. It would have been better if the squad had not been announced,\" he said.The government on Wednesday night issued a notification confirming the appointment of the management committee while removing Ramiz Raja, but the sitting chief selector Muhammad Wasim announced the squad for the NZ series.Sethi dropped clear hints that there would be changes in the Board, including in cricket-related areas.\"I think we had done a good job in our four-five year tenure before I resigned. But what has happened in the last four years everyone can see,\" he said.Sethi also made it clear that the country's prime minister wanted a revival of departmental teams and the regional cricket associations.\"That is our main priority to revive departmental cricket because in the last four years we have seen a terrible rise in unemployment and a famine in cricket talent. The old system worked well for us and we got players from domestic cricket. Nowadays it seems we are only getting players from PSL,\" he said.Sethi said all the groundwork for launching the Pakistan Super League and convincing international teams to return to playing in Pakistan was done in his last tenure.\"It is good that all teams are now touring Pakistan and the New Zealand team's tour is very important for us. But we also have to ensure a steady supply of talent from our domestic cricket,\" he said.Sethi also expressed his concern over the selection issues and performance of the team in the recent Test series against England which Pakistan lost 0-3.","content":null,"pubDate":"2022-12-22 12:42:47","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_2024809069.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh 2nd Test: Unadkat's two wickets on return, Mominul's crucial knock and other top moments from Day 1","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-2nd-test-day-1-top-moments-unadkat-mominul-11857181.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh 2nd Test: Unadkat's two wickets on return, Mominul's crucial knock and other top moments from Day 1","content":"Cricket India vs Bangladesh 2nd Test: Unadkat's two wickets on return, Mominul's crucial knock and other top moments from Day 1 Here are some top moments from Day 1 of the second Test between Bangladesh and India in Mirpur. FirstCricket Staff December 22nd, 2022 18:10:27 IST India's Jaydev Unadkat, left, bowls on the day one of the second test cricket match Bangladesh between India, in Dhaka, Bangladesh, Thursday, Dec. 22, 2022. (AP Photo/Surjeet Yadav) The opening day of the second Test between hosts Bangladesh and India at the Shere Bangla Stadium belonged to KL Rahul and Co, with the bowlers helping restrict the Bangla Tigers to 227 inside 73.5 overs. The main headline-grabber of the day was Jaydev Unadkat, who was making his return to Test cricket with Team India after 12 long years. While Unadkat picked two wickets, Mominul Haque (84) was Bangladesh’s top performer with the bat. At stumps on Day 1, India were 19/0 after eight overs, trailing the hosts by 208 runs, with KL Rahul (3) and Shubman Gill (14) in the middle. Let’s now take a look at some top moments from Day 1 of the second Test: Jaydev Unadkat picks two wickets on return The last time Jaydev Unadkat played a Test was against South Africa in December 2010. MS Dhoni was the skipper of the Indian team, and Rahul Dravid was part of that team. Oh, and Virat Kohli had not made his Test debut yet. Unadkat was picked in the squad for as a replacement for the injured Mohammed Shami, and on Thursday, he was named in the playing XI for the second Test, replacing Kuldeep Yadav, much to the surprise of many. Unadkat first struck in the 15 th over of the Bangladesh innings, when he got rid of Zakir Hasan (15), who was caught by KL Rahul at the slip position. The 31-year-old once again caused damage several overs later, in the 42 nd over, when Mushfiqur Rahim was edged and caught by Rishabh Pant, courtesy Unadkat bowling that delivery at a length. Unadkat would go on to finish the innings with figures of 2/50. Mominul Haque’s crucial 84 Most of Bangladesh’s batters did not perform upto what the team management would have expected, but Mominul Haque stood out among the rest of the Bangladesh batters. Many of them, including Najmul Hossain Shanto (24), Litton Das (25) and Mushfiqur Rahim (26) got starts, but were unable to convert them into big knocks. However, that was not the case for Mominul. Mominul came into bat at number three in the 15 th over after the dismissal of Zakir Hasan, and he consistently built 40-plus stands with Shakib Al Hasan, Mushfiqur, Litton Das and Mehidy Hasan Miraz, that helped Bangladesh post 227. It’s fair to say Mominul’s patient 84 that came in 157 balls (12 fours and one six) was a silver lining in the hosts’ innings, which otherwise would have succumb to a total lower than 227. Bangladesh’s massive collapse Being too reliant on one batter to do everything might trigger a collapse, and it is paramount that the batter from the other end provide immense support. As said before, most of the hosts’ batters lacked momentum, not being able to score big runs. Talking of which, Bangladesh were 213/5 at one point, but little did they know they would get all out for 227. Umesh Yadav, who had already taken the wicket of Shakib Al Hasan early in the innings, struck thrice between the 67 th and 73 rd over. In the 67 th over, Mehidy Hasan Miraz who had gone for the cut shot, instead got an outside edge off Umesh’s length delivery, only to be caught by Pant. Nurul Hasan was Yadav’s next victim, getting struck leg before wicket in the 69 th over. By now, Bangladesh were 219/7, with hopes of a 300-plus total looking far from possible. Umesh Yadav then completed his four-wicket haul by removing Taskin Ahmed, who was caught by Siraj at point. Just an over later, Ashwin, who already had two wickets to his name, joined the party in the 74 th over, removing the in-form Mominul and getting rid of Khaled Ahmed to finish off the Bangladesh innings. Both Umesh and Ashwin finished with four wickets each. KL Rahul survives LBW decision In the eighth over of India’s first innings reply, KL Rahul, facing Shakib Al Hasan’s delivery, was hit on the pad, and was given LBW by the on-field umpire. Rahul then had a quick chat with Shubman Gill at the other end, and eventually opted for the DRS. The replays showed there was no bat involved. The ball had pitched around a length, and Rahul had looked to defend it straight. However, while the impact was in line, the ball was missing leg-stump, and that meant the decision was reversed to India’s favour. The last thing India would have wanted was losing a crucial wicket before stumps, and with this decision reversal, Rahul and Team India breathed a sigh of relief. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 22, 2022 18:10:27 IST Tags: Cricket India Vs Bangladesh Jaydev Unadkat Mominul Haque Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-22 12:40:27","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Unadkat-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England in South Africa: Jofra Archer picked for one-day international series - BBC","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzY0MDU0NDM50gEuaHR0cHM6Ly93d3cuYmJjLmNvbS9zcG9ydC9jcmlja2V0LzY0MDU0NDM5LmFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England in South Africa: Jofra Archer picked for one-day international series  BBCJofra Archer return to England squad for South Africa ODI series while Rehan Ahmed not selected  Sky SportsJofra Archer named in England squad for ODI series in South Africa  The GuardianEngland and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.ukJofra Archer's England return nears with South Africa ODI squad inclusion  The TelegraphView Full coverage on Google News","content":null,"pubDate":"2022-12-22 11:36:13","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"}]}