{"newsArray":[{"title":"Lords stadium records: Lords ODI records batting and bowling and highest innings total","link":"https://thesportsrush.com/cricket-news-lords-stadium-records-lords-odi-records-batting-and-bowling-and-highest-innings-total/","keywords":["Cricket","England","India","India tour of England 2022","Lord's Cricket Ground"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Lords stadium records: The historic cricket stadium will be hosting an ODI after just over 12 months tomorrow. The second ODI of India’s tour of England 2022 will be played at the historic Lord’s tomorrow. Considering how players have traveled day in and day out in this series, they would be relieved to be playing… The post Lords stadium records: Lords ODI records batting and bowling and highest innings total appeared first on The SportsRush.","content":"Lords stadium records: The historic cricket stadium will be hosting an ODI after just over 12 months tomorrow. The second ODI of India’s tour of England 2022 will be played at the historic Lord’s tomorrow. Considering how players have traveled day in and day out in this series, they would be relieved to be playing two ODIs within three days in the same city. Having last hosted international cricket in the form of a Test match against New Zealand last month, Lord’s will be hosting an ODI after just over a year. As far as an England-India ODI at Lord’s is concerned, it will be played after four years. England, who face another must-win match in the white-ball leg against India, don’t have the best of records here. Readers must note that the hosts have won 25 and lost 27 out of their 56 Lord’s ODIs. India, on the other hand, have won four and lost three out of their eight ODIs at this venue. Lords stadium records Highest ODI run-scorers at Lord’s are Marcus Trescothick (595), Vivian Richards (524), Eoin Morgan (514), Alex Stewart (509) and Graham Gooch (498). A list of best batters among active cricketers in Lord’s ODI is provided below: Batter Matches Runs Highest Average SR 100 50 Joe Root (ENG) 8 365 113* 52.14 81.29 1 2 Ben Stokes (ENG) 7 259 89 43.16 87.79 0 2 Ravi Bopara (ENG) 7 251 96 35.85 80.44 0 2 Jos Buttler (ENG) 8 231 121 28.87 112.68 1 1 Jonny Bairstow (ENG) 5 224 72* 56 94.91 0 2 Indian batters taking part in this series have minimal ODI returns at this venue as the highest run-scorers are Virat Kohli (61), Shikhar Dhawan (36) and Hardik Pandya (21). ALSO READ: Lord’s pitch report for 2nd England vs India ODI Highest ODI wicket-takers at Lord’s are Daren Gough (27), James Anderson (19), Brett Lee (18), Andrew Flintoff (18) and Graeme Swann (16). A list of best bowlers among active cricketers in Lord’s ODI is provided below: Bowler Matches Wickets Average Economy SR James Anderson (ENG) 16 19 40.36 5.38 45 Liam Plunkett (ENG) 10 15 18.2 4.33 25.2 Mitchell Starc (AUS 3 10 10.4 4.1 15.2 Shaheeh Shah Afridi (PAK) 3 8 15.75 5 18.8 Chris Woakes (ENG) 5 8 25.87 4.83 32.1 Much like their batters, Indian bowlers (part of current squad) are also yet to leave a mark in this format at Lord’s. It is noteworthy that Yuzvendra Chahal, Ravindra Jadeja and Pandya have picked a solitary wicket each at this venue. Highest innings total at Lord’s Score Overs Team Opposition Year 334/4 60 England India 1975 328/6 50 England Ireland 2017 326/8 49.3 India England 2002 325/5 50 England India 2002 322/7 50 England India 2017 A moment India fans – or @SGanguly99 – will ever forget #OnThisDay in 2002, @MohammadKaif‘s heroics saw his side win the NatWest Series final.#LoveLords | #ENGvIND pic.twitter.com/AlujGiUTnd — Lord’s Cricket Ground (@HomeOfCricket) July 13, 2022 The aforementioned third-highest innings total at Lord’s is only instance of a 300+ ODI run-chase at this venue. The iconic match was the final of NatWest Trophy 2002. The second-best ODI run-chase here had come in an England vs West Indies 2004 match when the visitors had chased a 286-run target with five balls remaining in the match. The post Lords stadium records: Lords ODI records batting and bowling and highest innings total appeared first on The SportsRush.","pubDate":"2022-07-13 09:41:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Weather in Guyana West Indies 2nd ODI: Providence Stadium Guyana weather forecast WI vs BAN today match","link":"https://thesportsrush.com/cricket-news-weather-in-guyana-west-indies-2nd-odi-providence-stadium-guyana-weather-forecast-wi-vs-ban-today-match/","keywords":["Cricket","Bangladesh","Providence Stadium","West Indies"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Weather in Guyana West Indies 2nd ODI: The SportsRush brings you the weather report of the WI vs BAN 2nd ODI match. Guyana’s Providence Stadium will host the 2nd match of the 3-match ODI series between West Indies and Bangladesh. The visitors won the first ODI match, and they would aim to win the series,… The post Weather in Guyana West Indies 2nd ODI: Providence Stadium Guyana weather forecast WI vs BAN today match appeared first on The SportsRush.","content":"Weather in Guyana West Indies 2nd ODI: The SportsRush brings you the weather report of the WI vs BAN 2nd ODI match. Guyana’s Providence Stadium will host the 2nd match of the 3-match ODI series between West Indies and Bangladesh. The visitors won the first ODI match, and they would aim to win the series, whereas West Indies will aim to stay in the series. The pitch at the Providence Stadium is on the slower side, and the bowlers of Bangladesh will again enjoy bowling on the surface. West Indies’ top-order will again be under the radar after the failure in the first ODI match. The bowling of West Indies has done well under these conditions. Bangladesh has been led by Tamim Iqbal in this series, and they batted well in the last match. Again the eyes will be on the bowlers of the side who were excellent in the last match. Weather in Guyana West Indies 2nd ODI All the eyes will again be on the weather in the 2nd ODI match between West Indies and Bangladesh in Guyana. Rain interrupted the proceedings in the last match as well, and the forecast is not great for the 2nd ODI is under some dark clouds as well. If the match gets cancelled, West Indies won’t be able to win the series. According to Accuweather, the forecast for the 2nd match is not promising, and the rain can halt the proceedings. During the game hours, the chances of rain range from 35% to 51%, so the match can be halted in between because of the weather. Ahead of the match, there are 57% chances of rain, so the toss can get delayed as well. Player of the match: Mehidy Hasan Miraz.#BCB #Cricket #WIvBAN pic.twitter.com/BdBG2QyGBm — Bangladesh Cricket (@BCBtigers) July 10, 2022 The temperature will range between 28-30 degrees Celsius, and the humidity will go as high as 80%. So, there will be hot and humid conditions throughout the match, and it won’t be pleasing for the players on the field. Keeping the overcast conditions in mind, both teams would want to bowl first after winning the toss. The post Weather in Guyana West Indies 2nd ODI: Providence Stadium Guyana weather forecast WI vs BAN today match appeared first on The SportsRush.","pubDate":"2022-07-13 09:08:41","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"WI vs BAN Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s WI vs BAN 2nd ODI at Providence Stadium, Guyana, 7 PM IST July 13","link":"https://zeenews.india.com/cricket/wi-vs-ban-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-wi-vs-ban-2nd-odi-at-providence-stadium-guyana-7-pm-ist-july-13-2484921.html","keywords":null,"creator":null,"video_url":null,"description":"West Indies vs Bangladesh Dream11 Team Prediction West Indies vs Bangladesh 2nd ODI - Check My Dream11 Team, Best players list of WI vs BAN, West Indies Dream11 Team Player List, Bangladesh Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-07-13 08:56:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"A promising start to the first edition of Andhra Premier League T-20 cricket championship","link":"https://www.thehindu.com/sport/other-sports/a-promising-start-to-the-first-edition-of-andhra-premier-league-t-20-cricket-championship/article65610550.ece","keywords":null,"creator":["\n        V. V. Subrahmanyam  \n    "],"video_url":null,"description":"The Andhra Premier League T-20 championship gives young cricketers an opportunity to rub shoulders and learn from big names in the field","content":"Captains of the six APL teams posing with the trophies at ACA VDCA Stadium during the inauguration in Visakhapatnam | Photo Credit: K R Deepak It will be a different kind of monsoon magic for the cricket lovers of the City of Destiny in the ongoing inaugural edition of the Shreeram Group-sponsored Andhra Premier League (APL) T-20 cricket championship featuring six franchisees. For Andhra Cricket Association and the Visakhapatnam District Cricket Association which have won all-round appreciation for the successful conduct of international fixtures over the last few years, this APL can well be another feather in the cap. The APL is conceptualised with the intent of providing a chance for the average fan of the high-profile Indian Premier League to see the domestic talent available and also give the young talent a feel of what it means to play in coloured clothing and white balls. Not surprisingly, the Board of Control for Cricket in India (BCCI) has given the go-ahead to its affiliated unit, ACA, to host the event. For the record, the six franchisees — Uttarandhra Lions of KVR Estates, Rayalaseema Kings of Dasaradharam Reddy, Godavari Titans of Malvin Global Energy, Coastal Riders of Surya Granites, Bezwada Tigers of Andhra Hospitals and Vizag Warriors of Pulsus Group — will vie for top honours. With former Andhra Ranji cricketers Sathyaprasad Yachendra, heading the Governing Council of the APL, and the other members including R V Ch Prasad, former Ranji captain, G V V Gopala Raju as members, the cricketers and the officials involved in the conduct may not have any scope for complaints. For someone who played the game when there were no proper training facilities and these kinds of leagues were not even a distant dream, they know exactly what the players, administrators and the fans look for. That six teams with 20 players each were picked from the auction comprising about 400 players itself is proof, if needed, that the ACA has done its homework pretty well in terms of extending an opportunity for the young and the experienced cricketers to be in contention. There has been a conscious effort to have the format too on the lines of the IPL — six teams will compete against one another in a single round-robin style during the league stage, with the top four teams moving on to the playoff rounds. “The League is not just about money. It is essentially a platform especially for the young talent to showcase their skills. With IPL being the biggest showpiece in domestic cricket for obvious reasons, we felt it is imperative to have the APL which should help us in tapping young talent and grooming it into world-class players,” says Sathyaprasad Yachendra. “APL is not just for men. We have also organised the first edition of APL for women in Vizianagaram as the sport has gone to the next level in the recent past thanks to the exploits of the Indian women’s cricket team. We are pleased at the increasing number of girls taking up cricket,” he says. “We have been planning this APL for a long time but the pandemic put brakes on the event. So, this year, Sarat Chandra Reddy (ACA President) insisted that it should be held and be a grand success,” says Sathyaprasad, adding that it is a complete team effort on behalf of the Governing Council and the entire ACA to put things in place. “It will be a regular event in ACA calendar in future,” he says. And, interestingly, it is not a one-way process of only the players and the ACA getting benefitted. Even the sponsors can look back with a sense of pride as the League gives them a scope to make financial gains. Like many such Leagues, the APL too gives a huge opportunity for the young cricketers to rub shoulders with some of the big names of Andhra cricket including Indian star and wicketkeeper-batsman K Srikar Bharat, Ricky Bhui, Ashwin Hebbar who will be playing for their respective franchisees. “We believe the youngsters getting a feel of being out there in a League would inspire them to move to the next grade,” Sathyaprasad. With Star Sports telecasting the matches, the excitement amongst the players, officials and the fans is understandable. “We are grateful to all the six franchisees for buying the teams for three years and not just one season,” the Governing Council chairperson says. Significantly, the coaches of all the teams will be keeping a tab on the performances and preparing notes to help the young talent look far beyond. “Definitely, it would have been great if we had this League in our playing days. But, in a way we are trying to ensure that the current generation of cricketers is getting what we missed then,” he says. By all means, the APL is going to be a crowd-puller, weather-permitting. Our code of editorial values Printable version | Jul 13, 2022 2:03:56 pm | https://www.thehindu.com/sport/other-sports/a-promising-start-to-the-first-edition-of-andhra-premier-league-t-20-cricket-championship/article65610550.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-07-13 08:32:35","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"The Spin | South Africa can cast off turbulence to show winning identity in England","link":"https://www.theguardian.com/sport/2022/jul/13/south-africa-cricket-tour-england-chance-to-show-off-winning-identity","keywords":["South Africa cricket team","Sport","Cricket"],"creator":["Daniel Gallan"],"video_url":null,"description":"After a chaotic period Proteas will quietly back themselves to dampen their hosts’ newfound optimismWelcome to The Spin, the Guardian’s weekly (and free) cricket newsletter. Here’s an extract from this week’s edition. To receive the full version every Wednesday, just pop your email in below:The South Africa Proteas embark on their tour of England with two primary objectives: restore the team’s tattered reputation and offer their compatriots back home a fleeting moment of joy. Continue reading...","content":null,"pubDate":"2022-07-13 08:30:18","image_url":"https://i.guim.co.uk/img/media/b7537f9b6b1684ea647071961b53133e23afbdd9/0_59_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=27022e9b32f1145c8a41eebb65c19b40","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Umesh Yadav picks maiden wicket in County cricket representing Middlesex against Worcestershire","link":"https://www.indiatvnews.com/sports/cricket/umesh-yadav-picks-maiden-wicket-in-county-cricket-representing-middlesex-against-worcestershire-2022-07-13-791765","keywords":null,"creator":null,"video_url":null,"description":"Umesh Yadav has picked his maiden wicket in the County Championship representing Middlesex against Worcestershire on the second day of play on Wednesday.","content":"has picked his maiden wicket in the County Championship representing Middlesex against Worcestershire on the second day of play on Wednesday. The senior India pacer, who was roped in by Middlesex for the remainder of the English County season replacing Pakistan speedster Shaheen Shah Afridi, took the wicket of Taylor Cornall. Umesh went through the defence of Cornall (11) to return with figures of 14-1-45-1. On Day 2, Middlesex dismissed Worcestershire for 191 and then reached 180 for six to take a lead of 177 runs. Middlesex had scored 188 in their first innings. Once considered one of the fittest bowlers to play the game, Umesh has had his share of ups and downs. Despite all the talent that he has, the Indian pacer has continuously struggled to keep his place intact in the Indian team, be it for the blue jersey or the white flannels. But whenever, he gets an opportunity, Yadav makes sure that he uses it to the best of his capabilities. Not only is he skilful with the bowl, but comes across as a very handy tailender too and can hit the long bowl. Umesh had a certain kind of revival in his cricketing career when he was picked up by the two-time Indian Premier League ( ) champions, Kolkata Knight Riders. Umesh spearheaded the attack well for a few initial matches but later went off-colour. Middlesex announced that Umesh will be available to represent the club in both County Championship and Royal London Cup campaigns for the rest of the season. \"Middlesex Cricket is delighted to announce that Indian international quick bowler Umesh Kumar Yadav has signed terms with the Club and will join for the remainder of the 2022 season, This morning the Club received this confirmation, and confirmation that he is registered with the ECB, and Yadav has, as a result, now been named as an addition to Middlesex's squad for this weeks' game. \"He is a proven world-class performer, and can not only make a huge difference himself for the remainder of our Championship campaign and to our prospects in the Royal London Cup but will also be a fantastic role model for our younger bowlers to work alongside,\" said Alex Coleman, Middlesex' Head of Men's Performance Cricket. Umesh is also the latest Indian to play County cricket after veteran batter , and all-rounders Washington Sundar and . While Pujara plays for Sussex, Sundar and Krunal have signed up for Lancashire and Warwickshire respectively.","pubDate":"2022-07-13 08:23:10","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket SA CEO - We had to abandon Aus series to ensure sustainability of the sport","link":"https://www.iol.co.za/sport/cricket/proteas/cricket-sa-ceo-we-had-to-abandon-aus-series-to-ensure-sustainability-of-the-sport-b2717003-e793-43c9-8d54-fcfec90c92dd","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"The organisation’s chief executive, Pholetsi Moseki said it had to do so to ensure the sustainability of the sport in the country.","content":null,"pubDate":"2022-07-13 08:14:20","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/c563a4e5-debb-5229-8f52-4a7aeab45085&operation=CROP&offset=0x203&resize=2664x1498","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"\"Let Me Get My Ducks\": Jaffer Trolls Vaughan After England's Dismal Show","link":"https://sports.ndtv.com/cricket/india-vs-england-let-me-get-my-ducks-wasim-jaffer-trolls-michael-vaughan-after-england-batters-dismal-show-in-1st-odi-3153270","keywords":null,"creator":null,"video_url":null,"description":"Wasim Jaffer smartly used the word \"duck\" to take a dig at Michael Vaughan and the England national cricket team.","content":"The social media banter between former India batter Wasim Jaffer and ex-England cricketer Michael Vaughan is nothing new. The two often engage in pulling each other's leg and their topic of talk mainly revolves around the performance of their respective national teams against each other. Given that India are currently touring England, the ongoing series between the sides gave the former cricketers yet another chance to have some fun. This time it was Vaughan, who found himself at the receiving end of Jaffer's witty reply. As the England batters put a flop show against India in the first ODI of the three-match series at Kennington Oval in London on Tuesday, Vaughan wrote to Jaffer on Twitter: \"Fancy coming round for Tea @WasimJaffer14!! Think I have an evening free. #ENGvsIND.\" To this Jaffer replied: \"Haha sure Michael, just let me get my ducks in a row first #ENGvIND.\" Haha sure Michael, just let me get my ducks in a row first #ENGvIND https://t.co/neJz6JHpl0 Notably, as many as four England batters were dismissed for a duck in the first ODI match against India on Tuesday. The batters who failed to open their account were Jason Roy , Joe Root , Ben Stokes and Liam Livingstone . Promoted Jaffer smartly used the word \"duck\" to take a dig at Vaughan and the England national cricket team. Talking about the match, Jasprit Bumrah returned his career-best ODI figures of 6 for 19 and Mohammed Shami picked 3 for 31 as India bowled out hosts England for 110 runs. In reply, the visitors reached home in 18.4 over, thanks to Rohit Sharma's unbeaten 76 off 58 and Shikhar Dhawan 's 31 not out. The duo stitched unbeaten 114 runs to help India win the game by 10 wickets and take a 1-0 lead in the three-match series.","pubDate":"2022-07-13 08:09:07","image_url":"https://c.ndtvimg.com/2022-07/inf59t48_wasim-jaffer-806_625x300_10_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“They have a lot of time left in them”: Andrew McDonald relaxed about David Warner and Usman Khawaja’s future as Test opening pair","link":"https://thesportsrush.com/cricket-news-they-have-a-lot-of-time-left-in-them-andrew-mcdonald-relaxed-about-david-warner-and-usman-khawajas-future-as-test-opening-pair/","keywords":["Cricket","Andrew McDonald","Australia","David Warner","usman khawaja"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"David Warner and Usman Khawaja will be 36 soon, but the Australian coach Andrew McDonald is relaxed about their future. The Australian team recently drew the test series against Sri Lanka. Australia won the first test, but they crumbled in the 2nd test together. Although, it is not a bad result considering the Sri Lankans… The post “They have a lot of time left in them”: Andrew McDonald relaxed about David Warner and Usman Khawaja’s future as Test opening pair appeared first on The SportsRush.","content":"David Warner and Usman Khawaja will be 36 soon, but the Australian coach Andrew McDonald is relaxed about their future. The Australian team recently drew the test series against Sri Lanka. Australia won the first test, but they crumbled in the 2nd test together. Although, it is not a bad result considering the Sri Lankans whitewashed them on the last tour. Australia’s performance in the tests has been great lately where they won the Ashes at home and also won the away series against Pakitan. They are well placed to qualify for the World Test Championship’s final as well. Although, the Australian team is quite close to going through the transition period. The majority of the Australian first-team players are above 30, and it is inevitable that a transition period will loom soon upon them. Also Read: Usman Khawaja’s BBL 12 team The opening duo of David Warner and Usman Khawaja has done well for the Aussies. However, both of them will be 36 this year, and there have been concerns over the future of their combination. Both of them have been opening together since the mid-ashes for the Aussies. Usman Khawaja has been great for the Aussies since his return, where he has scored 888 runs at an average of 98.66. Warner has not been that great, but there is absolutely no doubt over the quality of the veteran southpaw. Australian coach Andrew McDonald has said that he is not worried about the future of both southpaws. A heartwarming note from David Warner for Usman Khawaja, who made twin hundreds on his Australia comeback 💛 📸 davidwarner31/IG pic.twitter.com/Fi8YBHMB8w — ESPNcricinfo (@ESPNcricinfo) January 9, 2022 McDonald said that many players have done on the other side of 35, and both of them can do the same as well. He believes that both Warner and Khawaja have a lot of cricket left in them. “Everyone talks about the wrong side of 35. Is there such a thing as the right side of 35?” Andrew McDonald said to cricket.com.au. “We’ve seen players perform on the other side of 35 as well. So we don’t look at the right or wrong side of 35.” “We look at the performances they’re putting out. And we still think they have a lot of time left in them with the challenges that we’ve got in front of us.” McDonald said that they would want to make sure that both Khawaja and Warner don’t go together during the transition period. Matt Renshaw, Henry Hunt and Will Pucovski are some of the younger players aiming for that opening spot of the Australians.","pubDate":"2022-07-13 08:08:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka reach third in WTC standings; Australia lose No. 1 spot","link":"https://www.sentinelassam.com/sports/cricket/sri-lanka-reach-third-in-wtc-standings-australia-lose-no-1-spot-602261","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Sri Lanka are now firmly in the mix for the World Test Championship final next year, with their win helping them jump in front of Pakistan, India and West Indies.","content":"Galle: Sri Lanka's massive victory over Australia in the second Test at Galle has had major ramifications on the ICC World Test Championship (WTC) standings, with the Pat Cummins-led side losing the No. 1 spot to South Africa. Sri Lanka recorded a stunning innings and 39-run victory over the visitors at the Galle International Stadium on Monday with Australia dismissed for a paltry 151 in the second innings. With the victory, the Dimuth Karunaratne-led side levelled the series at 1-1. Australia had won the opening Test at the same venue by 10 wickets. The win on Monday helped Sri Lanka jump ahead of a trio of rivals and up to third on the latest WTC standings. But it's right at the top of the standings that now has a new look, with Australia losing their place as No. 1. South Africa take over as the new leader on the latest standings with a win-loss percentage of 71.43 per cent, while Australia drop to second with 70 per cent after their first Test loss in the current period. Sri Lanka are now firmly in the mix for the World Test Championship final next year, with their win helping them jump in front of Pakistan, India and West Indies and up to third on the standings. Despite the absence of a host of key players due to Covid-19, Sri Lanka got dominant performances from star batter Dinesh Chandimal and debutant Prabath Jayasuriya in the second Test to cruise to an easy victory. It means Dimuth Karunaratne's side now has a 54.17 win-loss percentage and has them ahead of a host of close rivals in the race for the World Test Championship mace. Sri Lanka don't have to wait long to close the gap even further on the sides in front of them on the standings, with a two-match Test series at home against Pakistan commencing later this month. Australia, meanwhile, take a short break from five-day cricket, with their next Test assignment coming at home against West Indies at the end of November. Also read: UAE International League T20: Andy Flower named head coach of Gulf Giants Also watch:","pubDate":"2022-07-13 07:49:26","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/13/364140-sri-lanka-s-win-in-second-test-pushes-them-to-1405025.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Emma Lamb slams ton as England Women crush South Africa","link":"https://www.sentinelassam.com/sports/cricket/emma-lamb-slams-ton-as-england-women-crush-south-africa-602251","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"England’s massive win comes months after they stopped South Africa’s charge in the ICC Women’s Cricket World Cup semifinal in New Zealand.","content":"Northampton: Young Emma Lamb scored a maiden international century as England, backed by fine bowling performances from Nat Sciver and Katherine Brunt, won the opening One-day International against South Africa Women by five wickets with 107 ball remaining at the County Ground here. England bowlers were tough to negotiate, with Sciver grabbing a four- wicket haul, while Brunt took three as the Proteas were dismissed for 218 in 47.4 overs. England's massive win comes months after they stopped South Africa's charge in the ICC Women's Cricket World Cup semifinal in New Zealand. The hosts then notched up the winning runs in 32.1 overs with Emma Lamb smashing 15 boundaries in her nearly run-a-ball 102. Brief scores: South Africa Women 218 in 47.4 overs (Laura Wolvaardt 43, Chloe Tryon 88, Nadine de Klerk 38; Nat Sciver 4/59, Katherine Brunt 3/18) lost to England 219/5 in 32.1 overs (Emma Lamb 102, Nat Sciver 55) by five wickets. Also read: Athapaththu, Harmanpreet rise in Women's ODI Rankings Also watch:","pubDate":"2022-07-13 07:29:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/13/364125-emma-lamb.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"CRS vs PAD Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECS T10 Bologna 2022, Match 10","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/crs-vs-pad-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ecs-t10-bologna-2022-match-10?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-13 07:26:46","image_url":"https://static.sportskeeda.com/editor/2022/07/f0400-16576900005023-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"NTT vs CYC Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Strike League T20, Match 3","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ntt-vs-cyc-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-strike-league-t20-match-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-13 07:26:46","image_url":"https://static.sportskeeda.com/editor/2022/07/4be74-16576892556547-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Ukraine needs ICC membership for game to survive","link":"https://www.thestar.com.my/sport/cricket/2022/07/13/cricket-ukraine-needs-icc-membership-for-game-to-survive","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - The chief executive of Ukraine's cricket board says it \"ticks all the boxes\" to become an associate member of the International Cricket Council (ICC) and that the game would not survive if it was denied entry. Read full story","content":"(Reuters) - The chief executive of Ukraine's cricket board says it \"ticks all the boxes\" to become an associate member of the International Cricket Council (ICC) and that the game would not survive if it was denied entry. Ukraine is expected to get second-tier membership at the governing body's board meeting this month, entitling the war-torn country to Twenty20 International status and funds from the ICC, which has earmarked $30.8 million for its 96 associate members this year. The Ukraine Cricket Federation (UCF) has been organising cricket for the last two decades and has a pool of 15,000 students, most of them Indian, at the senior level. Its chief executive Kobus Olivier told Reuters it met all the ICC requirements before Russia invaded. \"We ticked all the boxes on Feb. 24 when the war started,\" he said. \"I have so much belief in this process ... and I am absolutely confident Ukraine will be an associate member of the ICC.\" Olivier, a South African, said the ICC should take note of how the EU \"fast-tracked\" Ukraine's candidate status to join the bloc, saying it set a \"very good precedent\". UCF President Hardeep Singh has made arrangements for national team players to train in India while Olivier set up base in Zagreb after fleeing Kyiv. He is effectively running the UCF's junior and women cricket programmes from Zagreb and engaging refugees, mostly mothers and children, in cricket-in-the-park sessions three days a week. \"These refugee mothers are actually going to make the Ukrainian national team in a couple of years,\" said Olivier, whose own escape from Kyiv, along with his four pet dogs, is the subject of a documentary. Olivier is also planning to host a 'Ukrainian Freedom Cup' in Zagreb next month with teams from Serbia, Slovenia, Hungary and Czech Republic. If the ICC rejects its membership application the consequences for the game in Ukraine would be dire, Olivier said. \"It will be the end of cricket in Ukraine,\" he said. The Lord's Taverners, a British charity, and the MCC Foundation, the charity arm of cricket's lawmakers, have given support to the UCF but sponsorship funds have dried up. ICC membership would make the UCF eligible for government funding and could attract new sponsors. \"It will be a snowball effect,\" said Olivier. (Reporting by Amlan Chakraborty in New Delhi; editing by Peter Rutherford)","pubDate":"2022-07-13 07:17:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/13/1657700.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Ravi Ashwin exclusive: 'ODI cricket needs to find its relevance - I turn it off when it's on TV'","link":"https://uk.sports.yahoo.com/news/ravi-ashwin-exclusive-odi-cricket-070000421.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-07-13 07:00:00","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Providence Stadium pitch report 2nd ODI: WI vs BAN pitch report Providence Stadium Guyana today match","link":"https://thesportsrush.com/cricket-news-providence-stadium-pitch-report-2nd-odi-wi-vs-ban-pitch-report-providence-stadium-guyana-today-match/","keywords":["Cricket","Bangladesh","Guyana","Providence Stadium","West Indies"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Providence Stadium pitch report 2nd ODI: The SportsRush brings you the pitch report of the 2nd ODI match between West Indies and Bangladesh. West Indies will take on Bangladesh in the 2nd ODI of the 3-match ODI series at the Providence Stadium in Guyana. Bangladesh won the first ODI, and they would want to win… The post Providence Stadium pitch report 2nd ODI: WI vs BAN pitch report Providence Stadium Guyana today match appeared first on The SportsRush.","content":"Providence Stadium pitch report 2nd ODI: The SportsRush brings you the pitch report of the 2nd ODI match between West Indies and Bangladesh. West Indies will take on Bangladesh in the 2nd ODI of the 3-match ODI series at the Providence Stadium in Guyana. Bangladesh won the first ODI, and they would want to win the series, whereas the hosts would want to level it. The bowlers of Bangladesh were at their best in the last match, and the pitch will again suit their kind of bowling. West Indies’ top-order collapsed in the last match, but they have some able players at the top. This can be an interesting match to watch out for. The Providence Stadium is set to host the 2nd continuous ODI match between West Indies and Bangladesh. This track in Guyana will definitely not excite the batters of both teams as batting has always been really tough here due to its slowish nature. In the last few years, it has been seen that pitch gets slower and slower as the game progresses. The balls grip onto the surface which makes the shot-making way tougher for the batters as compared to any other venue in the world. There is an uneven bounce on the track as well, so the powerplay overs are going to be crucial for both sides. One more sleep until the #MenInMaroon are back in action! #WIvBAN 🏏🌴🇬🇾 pic.twitter.com/NUC7l9FVZP — Windies Cricket (@windiescricket) July 12, 2022 A total of 22 ODIs have been played on this ground, where the chasing teams have won 9 and the defending teams have won 13 matches. The average 1st innings score at this ground is just 229 runs. The smaller boundaries can go in the favour of the batters, but they have to get the timing right. Spinners will be handy on this track, whereas the pacers who can bowl the slower deliveries will also enjoy bowling here. This was proved in the first ODI as well, where the hosts managed to score just 149 runs. Looking at the overcast conditions, both sides would want to chase.","pubDate":"2022-07-13 06:55:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Athapaththu, Harmanpreet rise in Women's ODI Rankings","link":"https://www.sentinelassam.com/sports/cricket/athapaththu-harmanpreet-rise-in-womens-odi-rankings-602220","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India captain Harmanpreet moved up one place to 13th following her Player of the Match effort of 75 helping her gain 12 rating points.","content":"Dubai: A host of Sri Lanka and India players including captains Chamari Athapaththu and Harmanpreet Kaur rose up in the latest ICC Women's ODI Player Rankings, released on Tuesday, following the completion of their three-match one-day series in Pallekele. While India registered a 3-0 series sweep during the dominant 50-over series, it was Sri Lanka captain Athapaththu, who made the biggest impression on the top 10 list for batters. Athapaththu scored a quick-fire 44 in the final match of the series last week and that saw the talented 32-year-old rise two spots to a career-best-equaling eighth position, which she had first attained after an epic 178 off 143 balls against Australia in the ICC Women's Cricket World Cup in Bristol five years ago. On the other hand, India captain Harmanpreet moved up one place to 13th following her Player of the Match effort of 75 helping her gain 12 rating points. Kaur, who finished with 119 runs and three wickets in India's 3-0 win and was named Player of the series, has also moved up eight slots to 71st among bowlers and four spots to 20th among all-rounders. Other India batters to move up in the rankings include opener Shafali Verma (up three places to 33rd), Yastika Bhatia (up one place to 45th) and Pooja Vastrakar (up eight places to 53rd). Also read: There is rest for being out of form: Venkatesh Prasad Also watch:","pubDate":"2022-07-13 06:45:07","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/13/364078-harm.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"'Alexa, please play Jasprit Bumrah': Wasim Jaffer's tweet goes viral","link":"https://www.firstpost.com/firstcricket/sports-news/alexa-please-play-jasprit-bumrah-wasim-jaffers-tweet-goes-viral-10904251.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"'Alexa, please play Jasprit Bumrah': Wasim Jaffer's tweet goes viral","content":"Cricket 'Alexa, please play Jasprit Bumrah': Wasim Jaffer's tweet goes viral Jasprit Bumrah was pick of the bowlers for the visitors and the seamer starred with match-winning figures of 6/19. FP Trending July 13th, 2022 11:38:29 IST India's captain Rohit Sharma, left, pats teammate Jasprit Bumrah to congratulate him for taking six wickets during the first one day international cricket match between England and India at the Oval cricket ground in London, Tuesday, July 12, 2022. (AP Photo/Matt Dunham) An irresistible Jasprit Bumrah produced a stunning effort to shoot out the England batting order in the first ODI at the Oval. Under cloudy skies and on a pitch that had a green tinge, Bumrah bowled with pace and found the perfect length to trouble England’s power-packed batting order. He ended with 6 wickets for just 19 runs and registered the third best ODI bowling figures for any Indian after Stuart Binny (6/4) and Anil Kumable (6/12). He started England’s collapse when he got rid of Jason Roy, Joe Root and Liam Livingstone for ducks. He also accounted for Jonny Bairstow and chipped in with a couple of lower-order wickets to end with a 6-wicket haul. Former India opener Wasim Jaffer, who keeps sharing hilarious and relatable memes on Twitter, posted a very smart tweet to pay his respects to Bumrah’s \"Alexa, please play Jasprit Bumrah\" \"Sorry, Jasprit Bumrah is unplayable,\" Jaffer posted. England were bowled out for 110 and in response, Rohit Sharma and Shikhar Dhawan romped home even before 20 overs with all 10 wickets in hand. The Indian openers took their time against the moving ball and when they got their eye in, they started expressing themselves. Rohit was brilliant and was superb against the short ball to notch up a dominant half-century. For his superb spell and match-defining efforts, Jasprit Bumrah was adjudged man of the match. Speaking after the innings, he said that he was pleased with the way the white-ball moved around and with how the conditions were favourable to the bowlers. “When there is swing to offer and seam movement, it is exciting times for white-ball cricket. Very happy when there was some help for us in the beginning. When I bowled the first ball, I saw some swing,” he said after the match. Updated Date: July 13, 2022 11:38:29 IST Tags: Cricket India Vs England 2022 Jasprit Bumrah Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-07-13 06:08:29","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/BumrahAPL.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa pull out of January ODI series in Australia","link":"https://www.firstpost.com/firstcricket/sports-news/south-africa-pull-out-of-january-odi-series-in-australia-10904271.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"South Africa pull out of January ODI series in Australia","content":"South Africa have cancelled their men's one-day international series scheduled for Australia in January, it was confirmed Wednesday.Matches on 12, 14 and 17 January in Hobart, Sydney and Perth have been scrapped said Cricket Australia, after South Africa's request for new dates to avoid a clash with their domestic T20 league could not be accommodated.\"It is disappointing that Cricket South Africa will be unable to contest the ODI series in January,\" said Cricket Australia chief executive Nick Hockley.With a backlog of postponed fixtures from the pandemic meaning no window is available to reschedule before the qualification cut-off in May, South Africa have agreed to forfeit all 30 Super League points to Australia, pending ICC approval.The series was part of the ICC Super League which determines direct qualification for the 2023 World Cup. The Proteas are currently in 11th place on the Super League standings. Only the top eight teams qualify directly for next year's 50-over tournament in India.A three-Test series against South Africa in December and January will go ahead as planned.Three other Australia fixtures have had venue changes to provide an even spread of matches for home supporters.A men's Twenty20 match against the West Indies on October 7 has moved from the Gold Coast to Brisbane, while a Twenty20 international against England two days later has switched to Perth, from Brisbane.A women's T20 match against Pakistan on January 26 moves changed from Canberra to Hobart.Revised Australia 2022-23 schedule:Men:ODI series v Zimbabwe (all Townsville): August 28, 31, September 3ODI series v New Zealand (all Cairns): September 6, 8, 11T20 series v West Indies: October 5 (Gold Coast), 7 (Brisbane)T20 series v England: October 9 (Perth), 12, 14 (both Canberra)ICC Men's T20 World Cup: October 16-November 13ODI Series v England: November 17 (Adelaide), 19 (Sydney), 22 Melbourne.Test series v West Indies: First Test November 30–December 4 (Perth), Second Test December 8-12 (Adelaide).Test series v South Africa: First Test December 17-21 (Brisbane), Second Test December 26-30 (Melbourne), Third Test January 4-8 (Sydney).Women:ODI series v Pakistan January 16, 18 (both Brisbane), 21 (Sydney).Twenty20 series v Pakistan: January 24 (Sydney), 26 (Hobart), 29 (both Canberra).With AFP inputsRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-07-13 05:56:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/03/South-Africa-cricket-team-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"The death of bilateral ODI cricket is here. With South Africa’s withdrawal of ODI series with Australia due to their new T20 franchise league, the economics of cricket has spoken","link":"https://indianexpress.com/article/sports/cricket/south-africas-withdrawal-of-odi-series-with-australia-due-to-their-new-t20-franchise-league-the-economics-of-cricket-has-8026165/","keywords":["Cricket","Sports"],"creator":["Sriram Veera"],"video_url":null,"description":null,"content":"The end of bilateral cricket series, especially in ODIs, is here. South Africa have withdrawn from their ODI series in Australia as it clashes with their new T20 franchise league. With the mushrooming T20 franchise leagues encroaching the already-packed international schedule, and with the backing and the interest of the money bags, this wasn’t a surprise. Still, South Africa’s withdrawal stands out for the risks entailed. They have put their direct qualification to the 50-over ODI world cup next year at risk by their withdrawal as they stand to lose valuable points. The economics of cricket, we have been told for a while now, doesn’t support Test and “meaningless” bilateral series. Uday Shankar, the former chief of Star & Disney India, had once told this newspaper how there is no market for Test cricket and it’s only the largesse of the broadcasters that is running it. Some small tweaks to the massive summer of international cricket ahead. We still look forward to welcoming @OfficialCSA for a Test series kicking off at the Gabba on December 17 🙌 pic.twitter.com/xov2iuaucd — Cricket Australia (@CricketAus) July 13, 2022 Not just Test cricket, but the bilateral ODI series is at risk. In fact, the schedule has already adjusted. There are fewer and fewer ODIs being played these days. But it appears more shuffling and re-arranging of the decks is on cards. “Do we want to save cricket or no? You think if Kerry Packer didn’t do what he did, what would have happened to cricket. Do you need 13 Test matches in a year – 65 days! How many holidays you get? 20 days? Is that enough to watch all the Tests?” Shankar had told The Indian Express in 2017, just days after his network had coughed up16,000 crore to secure the media rights for the Indian Premier League between the years 2018 and 2022. Now, in its latest iteration, that figure has astronomically risen to 43,000 crores. Uday Shankar, the former chief of Star & Disney India. (FILE) “The economics do not drive the game. The popularity of the game drives the economics. Except for the summer Tests in England and a few in Australia, have you seen a full stadium? In today’s world, who do you expect to be available on TV or in the stadium to watch a match that goes on for five days? Our own data suggests, whether it’s T20, ODI or Test match, people spend one hour watching it. This is BARC data. Economics of Test cricket doesn’t work,” Shankar told this newspaper. He also spoke about how the economics is purely driven by what the fans want. “The fans have spoken that they love the T20 format. It’s easy to misunderstand a broadcaster’s perspective because we seem to be the guys who are in it for the money, which is true. But you make money only when the fans like something.. This whole model of going and buying ever-more expensive cricket rights is not sustainable. Consumption of sports here is lowest in world. Until that changes, business of sports is going to be tough.” An early indicator of Brand IPL growing despite the pandemic lull was the sale of two new teams earlier this year: BCCI earned a total of $1.7 billion, with the Lucknow franchise going for 250 per cent more than the base price. The ICC tournaments would survive and the ICC has tried to give some importance to Tests by having a Test Championship. But it might not prove enough. Top Sports News Now Rohit hooks and pulls his way to quickfire 78 as India reach target in quick time Boom Time: Bumrah’s mastery leaves England batting in tatters Who is Watkinson, the PE teacher who saved the Olympic champion Mo Farah’s life? Click here for more “Test cricket has a two-fold problem and that needs to be recognized. One, most of the Tests people find meaningless. Even today when India and Pakistan play or England and Australia play, people get excited about it because there’s a context. Most of Test cricket there’s no context. Second problem with Test cricket is that there’s too much of it. Last year in this country, India played 13 Tests at home. So 65 days of Test cricket in India, where data shows a person sees one out of 30 hours played during a Test,” Shankar said then. Subscriber Only Stories View All Premium Mattewara a game changer? Premium National Emblem Row: Dimensions, angle of view, make emblem look differen... Premium India’s demography at crossroads: Elderly may outnumber the youth Premium Explained: Why the euro has fallen to $1, what it means for the rupee Subscribe Now to get 66% OFF “I don’t think Test cricket needs to be shut down. Staple has to be shorter format, and Test has to be fine-dining experience for special occasions. ICC have ODIs and T20, and they do well. The whole stature changes when there is an ICC tournament. If magically all the stadiums were to be full and everybody who loves cricket was watching Test cricket, we would kill each other to go and bid for the Test rights,” Shankar had said. His wish is now being granted. UPSC Key | The Indian Express helps you prepare for the Civil Services and other competitive exams with cues on how to read and understand content. Read here","pubDate":"2022-07-13 05:43:21","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Bowling test-match length did the trick v England - Bumrah","link":"https://www.thestar.com.my/sport/cricket/2022/07/13/cricket-bowling-test-match-length-did-the-trick-v-england---bumrah","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - India pace spearhead Jasprit Bumrah said bowling a fuller, test-match length paid off after his devastating 6-19 secured their 10-wicket win against England in Tuesday's one-dayer. Read full story","content":null,"pubDate":"2022-07-13 05:27:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/13/1657599.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"The death of bilateral ODI cricket is here. With South Africa's withdrawal of ODI series with Australia due to their new T20 franchise league, the economics of cricket has spoken - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvc291dGgtYWZyaWNhcy13aXRoZHJhd2FsLW9mLW9kaS1zZXJpZXMtd2l0aC1hdXN0cmFsaWEtZHVlLXRvLXRoZWlyLW5ldy10MjAtZnJhbmNoaXNlLWxlYWd1ZS10aGUtZWNvbm9taWNzLW9mLWNyaWNrZXQtaGFzLTgwMjYxNjUv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The death of bilateral ODI cricket is here. With South Africa's withdrawal of ODI series with Australia due to their new T20 franchise league, the economics of cricket has spoken  The Indian ExpressSouth Africa tour of Australia : South Africa withdraw from ODI leg of Australia tour | Cricbuzz.com - Cricbuzz  CricbuzzSouth Africa's ODI World Cup hopes hang by a thread as Australia series cancelled  ESPNcricinfoBig blow for South Africa's World Cup hopes  International Cricket CouncilAUS vs SA: South Africa put their direct World Cup qualification in doubt, withdraw from Australia ODI series  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-07-13 05:26:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Mohammed Shami becomes fastest Indian bowler to 150 ODI wickets","link":"https://www.firstpost.com/firstcricket/sports-news/mohammed-shami-becomes-fastest-indian-bowler-to-150-odi-wickets-10904101.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Mohammed Shami becomes fastest Indian bowler to 150 ODI wickets","content":"Mohammed Shami became the fastest Indian bowler to 150 ODI wickets in the first India vs England ODI at the Kennington Oval.The seamer needed 80 matches to 150 ODI wickets. Shami, who returned match figures of 3/31 from seven overs in India's 10-wicket win, achieved the feat with his second wicket of the match.In the 15th over of the game, Shami dismissed English captain Jos Buttler to achieve the landmark. He also scalped the wickets of Ben Stokes and Craig Overton. The 31-year-old broke the record of former pacer Ajit Agarkar who had completed 150 ODI wickets in 97 matches. Coincidentally, Agarkar had also marked the milestone at the same venue in 2002 against Sri Lanka.1st ODI stats: Jasprit Bumrah's milestones and other interesting numbersOverall, Shami is third joint-fastest to reach 150 ODI wickets. He shares the record with Afghanistan's Rashid Khan. Mitchell Starc from Australia holds the record for the fastest 150 wickets in ODIs in just 77 matches with Pakistan's Saqlain Mushtaq second. He got to 150 ODI scalps in 78 matches.After the first ODI at The Oval, Shami has 151 wickets from 80 ODIs at an average of 25.32. His economy rate is 5.61. In 60 Tests, he has 216 wickets at an average of 27.45. He also has 18 wickets from 17 T20Is at an economy rate of 9.54.Apart from Shami, Jasprit Bumrah had a great time in the first ODI as the pacer took career-best figures of 6/19 to bowl England out for just 110 runs in 25.2 overs. Four of his six wickets came in the powerplay.READ | How India rediscovered their bowling powerplay mojo in The Oval ODI vs EnglandIn reply, India got the job done in 18.4 overs with openers Rohit Sharma and Shikhar Dhawan staying unbeaten to help the visitors take a 1-0 lead in the three-match series.The second match of the series will be played at the Lord's on 14 June.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-07-13 05:24:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Mohammed-Shami-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Jasprit Bumrah's sensational inswinger to clean up Liam Livingstone for a duck","link":"https://www.firstpost.com/firstcricket/sports-news/watch-jasprit-bumrahs-sensational-inswinger-to-clean-up-liam-livingstone-for-a-duck-10904141.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Watch: Jasprit Bumrah's sensational inswinger to clean up Liam Livingstone for a duck","content":"After Indian captain Rohit Sharma won the toss and elected to bowl first at The Oval, his new-ball bowlers wreaked havoc on the England batting order. Jasprit Bumrah and Mohammed Shami sent half of the England team back in the first eight overs. Bumrah was at his lethal best as he sent back four England batters in his first spell– 3 of the top-order batters were dismissed for ducks.In his first over of the day, Bumrah accounted for Jason Roy’s and Joe Root’s wickets and bowled a maiden over. He then returned to send Jonny Bairstow packing with a ball that held its length and took Bairstow’s outside edge. The ball flew to first slip, but Rishabh Pant dived to his right to pouch an incredible catch.1st ODI stats: Jasprit Bumrah's milestones and other interesting numbersWalking in number six was Liam Livingstone, who looked at sea against the moving ball and found no rhythm against both Bumrah and Shami. Off the eighth ball, he marched down the track and tried to counter the swing by walking across to off stump. Bumrah bowled a full-length delivery that swung in prodigiously and beat Livingstone to crash into the stumps.Watch:Bumrah ended with figures of 6/19 and cleaned up the lower order with his fast and full yorkers. He was given great support by Shami, who scalped three wickets. England were shot out for 110 and in response, Rohit slammed a powerful half-century as the Indian openers remained unbeaten in their chase.“When there is swing to offer and seam movement, it is exciting times for white-ball cricket. Very happy when there was some help for us in the beginning. When I bowled the first ball, I saw some swing,” Bumrah said at the post-match presentation.The second ODI will take place at Lord’s and considering the momentum India have got after this win, they would be favourites to clinch the series.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-07-13 05:20:38","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Bumrah1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG: Barmy Army claims Virat Kohli was dropped for Oval ODI, Bharat Army wins internet with epic reply - Times Now","link":"https://news.google.com/__i/rss/rd/articles/CBMipgFodHRwczovL3d3dy50aW1lc25vd25ld3MuY29tL3Nwb3J0cy9jcmlja2V0L2luZC12cy1lbmctYmFybXktYXJteS1jbGFpbS12aXJhdC1rb2hsaS13YXMtZHJvcHBlZC1mb3Itb3ZhbC1vZGktYmhhcmF0LWFybXktd2luLWludGVybmV0LXdpdGgtZXBpYy1yZXBseS1hcnRpY2xlLTkyODM1MTIw0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ENG: Barmy Army claims Virat Kohli was dropped for Oval ODI, Bharat Army wins internet with epic reply  Times NowBrilliant Bumrah Takes 6-19 | Highlights - England v India | 1st Men's Royal London ODI 2022  England & Wales Cricket BoardVirat Kohli yet to recover from groin injury, likely to miss 2nd ODI against England  Times of IndiaFirst India-England ODI today | The News | 12.07.2022  DD INDIABharat Army`s epic response wins the internet after Barmy Army claims Virat Kohli was dropped for 1st ODI  WIONView Full coverage on Google News","content":null,"pubDate":"2022-07-13 04:52:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"On This Day: Sourav Ganguly-led India script history with NatWest Trophy triumph in 2002","link":"https://www.firstpost.com/firstcricket/sports-news/on-this-day-sourav-ganguly-led-india-script-history-with-natwest-trophy-triumph-in-2002-10886051.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"On This Day: Sourav Ganguly-led India script history with NatWest Trophy triumph in 2002","content":"It’s been two decades since the cricket world witnessed one of the greatest battles on the 22 yards when India and England crossed swords in the final of the 2002 NatWest Trophy on 13 July at Lord's. The Men in Blue dedicated their sweat and blood until Sourav Ganguly marked the historic victory by waving his shirt from Lord’s balcony.India, under the leadership of Ganguly, played well throughout the tri-series, winning four of their five league games. When they headed to the final to meet the hosts, there were a few doubts on whether they could replicate the earlier performance. However, the extraordinary team effort and Ganguly’s aggressive approach guided the side to lift the historic NatWest Trophy.Batting first, England didn’t face much resistance in the initial phase. Opener Marcus Trescothick got well settled at the crease and went on to score a hundred. The southpaw registered a 100-ball 109 which included seven boundaries and two maximums. Skipper Naseer Hussain also breached the 100-run mark scoring 115 runs off 128 balls. Among others, Andrew Flintoff played his part and added 40 runs to the scoresheet. Riding on these knocks, the English brigade posted a huge 325 runs on the board.In response, the Indian opening pair, Virender Sehwag and Ganguly started the chase well. The duo stitched a 106-run stand until Ganguly fell for a 43-ball 60 off Alex Tudor. In the next over, Ashley Giles got rid of Sehwag who missed the half-century by just 5 runs scoring 45 off 49 deliveries. Then the middle order didn’t get much time to settle as Dinesh Mongia, Sachin Tendulkar and Rahul Dravid contributed 9, 14 and 5 runs respectively to the mammoth chase.With India five down at 146, young guns Yuvraj Singh and Mohammad Kaif took charge and stitched a 121-run partnership. Both reached the 50-run mark as Kaif remained unbeaten at 87 and Yuvraj Singh whacked a quickfire 65-ball 69. The duo had almost done the job and made it easy for the tailenders. With Zaheer Khan tapping the ball to the offside and completing a double, India scripted history by claiming the title. Kaif who played the innings of his life was awarded Player of the Match.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-07-13 04:51:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/NatWest-Trophy-2002-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa's men's cricket team withdraws from three-match ODI series against Australia in January - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA3LTEzL3NvdXRoLWFmcmljYS13aXRoZHJhd3MtZnJvbS1hdXN0cmFsaWEtb2RpLXNlcmllcy8xMDEyMzQ3OTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South Africa's men's cricket team withdraws from three-match ODI series against Australia in January  ABC NewsSouth Africa withdraw from January ODI series | cricket.com.au  cricket.com.auMassive blow for Tassie’s summer of cricket  The MercuryCanberra loses one women's T20I after South Africa withdraws from ODI series  The Canberra TimesProteas pull out of ODI series in Australia — but it’s not all bad news, with stars to play in BBL  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2022-07-13 04:43:20","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma and Shikhar Dhawan opening pair deserves an all-time great status","link":"https://www.firstpost.com/firstcricket/sports-news/rohit-sharma-and-shikhar-dhawan-opening-pair-deserves-an-all-time-great-status-10903761.html","keywords":["First Cricket News"],"creator":["Bansal Shah"],"video_url":null,"description":"Rohit Sharma and Shikhar Dhawan opening pair deserves an all-time great status","content":"Rohit Sharma nudges the first ball of the innings—a short-of-length delivery from David Willey—towards short leg. He wanted to take a quick single straight away and looked at Shikhar Dhawan at the non-striker’s end. Hesitated a bit. Dhawan was not napping but was not sure about the single either. Yet responded quickly. He was running towards the danger end as the fielder was so close to the stumps. And he would never have made it safely to the crease, had Bairstow—rushing in from mid-wicket—managed a direct hit.There was never a single to be run. But the duo had some conversation, only their eyes would know, and set off for one. Dhawan would have made a comeback with a diamond duck. Yet ran away. Responding to your partner’s call is what partnerships are all about! As Rohit knew he wasn’t going to be attacked, he turned back to look if Dhawan was safe, even before he had reached the non-striker’s end. Partnerships are also about looking after your partner. Hence, when Dhawan struggled to score freely, Rohit took the lead role and pulled—already distant match—away from England.“We do understand each other quite well, except the first ball where there was a little bit of mix-up. He is playing in ODI cricket after a long time. So it was just a misjudgement, but then we started batting well together,” Rohit said at the post-match presentation about their partnership.Rohit-Dhawan pair gives that sense of comfort and assurance. Hope this pair remains intact till the next WC.— `ryan (@ryandesa_7) July 12, 2022The last time Rohit and Dhawan opened for India was just a few months back in February 2022 in the third ODI against West Indies. But yet it seems like the duo has been in a long-distance relationship for quite some time. And rightly so, since Dhawan has been in and out of the Indian white-ball circuit in recent times. Even during the ODIs against West Indies, Rohit had different partners in the first two games.The duo opened together for the first time—nine years, one month, and six days back — in the 2013 Champions Trophy. The tournament revolutionised a new-look Indian team as the inexperienced side won the trophy. The pair wasn't a fan favourite initially as stalwarts like Virender Sehwag and Gautam Gambhir were dropped from the squad. However, the pair established themselves on the field, in the record books, and the heart of fans. So much so that the fans were elated to see Dhawan back at the top of the order with Rohit. Albeit, this might be the last time the duo is seen opening in England, where the love affair started.9 years on, the bond is still strong * @ImRo45 Congratulations to the Team India for the spectacular victory ?? #IndVsEng #ODISeries pic.twitter.com/eWiQvCP3zq— Shikhar Dhawan (@SDhawan25) July 12, 2022Since 2013, the two batters have partnered with each other 113 times, of which they have opened 112 times. The duo reached a milestone of 5,000 opening-partnership runs at an average of 46.43 on Tuesday as they stitched their eighteenth century stand. Their opening-partnership tally of 5,108 runs is the fourth-best overall and second-best for India. And, their tally of 18 hundred-run opening partnerships is the second-best overall.Sachin-Ganguly, Gilchrist-Hayden, Cook-Strauss, Sachin-Sehwag, Greenidge-Haynes, and Atapattu-Jayasuriya are some of the names that come to mind while thinking about elite opening pairs. Will Rohit-Dhawan be added to the list? Are they one of the greatest opening pairs of all time?To start the answer, they have opened together 112 times which is the third-highest of all time, only next to Sachin-Ganguly (136) and Gilchrist-Hayden (114). Their first two opening partnerships were 100-run stands. Interestingly, they had never opened together in a practice match either before that. The feat explains the understanding between the two.To show the result of their performance, India have won 27 of 33 matches wherein the duo has had a partnership of more than 50 runs.Above all these run-riots, records, and victories is the level of comfort the opening partnership of Rohit Sharma and Shikhar Dhawan gives. Not only to the fans but also to the dressing room.TriviaRohit Sharma and Shikhar Dhawan first time had a partnership for the fourth wicket against West Indies in Port of Spain in 2011. The duo scored 43 runs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-07-13 04:25:33","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/Rohit-Sharma-Shikhar-Dhawan-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa's Three-Match ODI Series In Australia Cancelled","link":"https://sports.ndtv.com/cricket/south-africas-three-match-odi-series-in-australia-cancelled-3152609","keywords":null,"creator":null,"video_url":null,"description":"Matches on January 12, 14 and 17 in Hobart, Sydney and Perth have been scrapped said Cricket Australia, after South Africa's request for new dates to avoid a clash with their domestic T20 league could...","content":"South Africa have cancelled their men's one-day international series scheduled for Australia in January, it was confirmed Wednesday. Matches on January 12, 14 and 17 in Hobart, Sydney and Perth have been scrapped said Cricket Australia, after South Africa's request for new dates to avoid a clash with their domestic T20 league could not be accommodated. \"It is disappointing that Cricket South Africa will be unable to contest the ODI series in January,\" said Cricket Australia chief executive Nick Hockley. The series was part of the ICC Super League which determines direct qualification for the 2023 World Cup. With a backlog of postponed fixtures form the pandemic meaning no window is available to reschedule before the qualification cut-off in May, South Africa have agreed to forfeit all 30 Super League points to Australia, pending ICC approval. A three-Test series against South Africa in December and January will go ahead as planned. Three other Australia fixtures have had venue changes to provide an even spread of matches for home supporters. A men's Twenty20 match against the West Indies on October 7 has moved from the Gold Coast to Brisbane, while a Twenty20 international against England two days later has switched to Perth, from Brisbane. A women's T20 match against Pakistan on January 26 moves changed from Canberra to Hobart. Men: ODI series v Zimbabwe (all Townsville): August 28, 31, September 3 ODI series v New Zealand (all Cairns): September 6, 8, 11 T20 series v West Indies: October 5 (Gold Coast), 7 (Brisbane) T20 series v England: October 9 (Perth), 12, 14 (both Canberra) ICC Men's T20 World Cup: October 16-November 13 ODI Series v England: November 17 (Adelaide), 19 (Sydney), 22 Melbourne. Test series v West Indies: First Test November 30-December 4 (Perth), Second Test December 8-12 (Adelaide). Test series v South Africa: First Test December 17-21 (Brisbane), Second Test December 26-30 (Melbourne), Third Test January 4-8 (Sydney). Women: ODI series v Pakistan January 16, 18 (both Brisbane), 21 (Sydney). Promoted Twenty20 series v Pakistan: January 24 (Sydney), 26 (Hobart), 29 (both Canberra). (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-07-13 04:07:15","image_url":"https://c.ndtvimg.com/2022-01/06a02bjg_south-africa-afp_625x300_23_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia’s ODI series against South Africa axed in boost for Big Bash League","link":"https://www.theguardian.com/sport/2022/jul/13/australias-odi-series-against-south-africa-axed-in-boost-for-big-bash-league","keywords":["Australia cricket team","South Africa cricket team","Cricket","Australia sport","Sport","Cricket Australia","Australia news"],"creator":["Australian Associated Press"],"video_url":null,"description":"Proteas to still play three-Test series earlier in summerDoor opens for more international players to feature in BBLAustralia’s home ODI series against South Africa has been cancelled, opening the door for more international players to feature in the Big Bash League. The Proteas have pulled out of the three ODIs in January, scheduled for Hobart, Sydney and Perth, due to the new Twenty20 league in South Africa.Cricket South Africa’s leaders last month told Cricket Australia they would not allow their players to stay in the country for the white-ball series in fear of compromising the launch of their own domestic T20 league. CA tried to find alternative dates for the matches but were unable to do so with a cramped schedule in 2023 involving a tour of India, an Ashes series and an ODI World Cup. Continue reading...","content":null,"pubDate":"2022-07-13 04:06:53","image_url":"https://i.guim.co.uk/img/media/f211e98c568b5899c4ee42c6e309cc0c6c2b1272/0_147_2911_1747/master/2911.jpg?width=460&quality=85&auto=format&fit=max&s=e60f645b5e9bf6805cda9055cbe85938","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"}]}