{"newsArray":[{"title":"Jonassen, Lanning star in DC’s comfortable win","link":"http://island.lk/jonassen-lanning-star-in-dcs-comfortable-win/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"A terrific 70 from skipper Meg Lanning and an allround performance from Jess Jonassen helped Delhi Capitals pick up their second straight win in the inaugural WPL on Tuesday (March 7). Lanning’s fireworks at the top of the order and Jonassen’s finish saw Capitals post an imposing 211 on the board. Even though Tahlia McGrath […]","content":"A terrific 70 from skipper Meg Lanning and an allround performance from Jess Jonassen helped Delhi Capitals pick up their second straight win in the inaugural WPL on Tuesday (March 7). Lanning’s fireworks at the top of the order and Jonassen’s finish saw Capitals post an imposing 211 on the board. Even though Tahlia McGrath went one step ahead by smashing an unbeaten 90, a lack of support from the other end saw Warriorz lose comfortably by 42 runs in the end. Brief scores: Delhi Capitals 211/4 in 20 overs (Meg Lanning 70, Jess Jonassen 42*; Shabnim Ismail 1/29) UP Warriorz 169/5 in 20 overs (Tahlia McGrath 90*; Jess Jonassen 3/43) 42 runs Published on By Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa.","pubDate":"2023-03-07 20:07:54","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Michael Vaughan's legal team describe ECB racism investigation as \"wholly inadequate\"","link":"https://www.mirror.co.uk/sport/cricket/michael-vaughan-ecb-yorkshire-rafiq-29398111","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Dean Wilson)"],"video_url":null,"description":"Michael Vaughan's legal team gave closing submissions on Tuesday at the Cricket Discipline Commission hearing and took aim at the ECB, but the national governing body hit back","content":"Michael Vaughan and his legal team have slammed the ECB , describing their racism investigation case as “wholly inadequate” and biased. Vaughan is charged with bringing the game into disrepute by saying to Azeem Rafiq , Adil Rashid , Rana Naved-ul-Hasan and Ajmal Shahzad “there’s too many of you lot, we need to have a word about that” prior to a Twenty20 match against Nottinghamshire in June 2009. Vaughan categorically denies the allegation, and the closing submissions from Christopher Stoner KC on behalf of the former England captain took a swipe at the way the ECB had handled the entire case, branding it unfair and claiming it denied their client “due process.” Michael Vaughan says it's \"inconceivable\" he made alleged racist comment to team-mates Michael Vaughan blasts cricket racism hearing as a \"terrible look for the game\" The ECB’s legal lead, Jane Mulcahy KC, hit back at those claims, describing them as “inappropriate to be alleged”. On the final day of the Cricket Discipline Commission hearing, both sides traded blows with compelling descriptions of the evidence heard over the previous four days. But what Vaughan described in his evidence as a “terrible look for the game”, after he and former team-mate Rafiq had fought it out in public, became an argument between an Ashes -winning captain and his former employers and governing body over accusations both parties had not being sufficiently thorough in their collection of evidence. And Stoner pulled no punches when he said: “We say this investigation was wholly inadequate. In reality there was no investigation, and we are concerned by the bias shown by the ECB. Michael Vaughan and his legal team slammed the ECB in closing submissions ( Image: AP) “Due process matters and it is the cornerstone of our law. It was sent on holiday by the ECB in this investigation. That brings a question of fairness. This was a prosecution from the outset.” Mulcahy KC was just as robust in her summation of the ECB’s case beforehand when she focused once more on the historic tweets sent by Vaughan between 2010 and 2017, for which he has already apologised and agreed were “completely unacceptable.” Mulcahy said: “The tweets are central to this case and it makes no difference that they were sent in a non-cricketing context. We say if a person has a tendency to make racist comments, they have a tendency to make racist comments.” The final cases against the non-participating Andrew Gale and Richard Pyrah were also heard before the panel retired to deliberate on a verdict that is expected at the end of the month. Panel chair Tim O’Gorman said: “These are serious matters, and the panel will give them due consideration.” Read More 4 questions England must answer ahead of World Cup defence including Ben Stokes' future Read More Shakib Al Hasan stars as England slump to ODI defeat against Bangladesh Read More Ashes tipped to be best series since 2005 with Bazball making Australia 'take notice' Read More England quick Mark Wood admits he \"might not play any\" Ashes Tests this summer Read More Shane Warne's family pay moving tribute to Australian icon a year on from tragic death","pubDate":"2023-03-07 19:45:57","image_url":"https://i2-prod.mirror.co.uk/incoming/article29398410.ece/ALTERNATES/s615/0_lkw102-0_252.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Five reasons why: Sri Lanka clash isn’t a big comedown","link":"https://www.nzherald.co.nz/sport/five-reasons-why-sri-lanka-clash-isnt-a-big-comedown/AINJ45BN5VFATG4MMRVHFWVXWY/","keywords":null,"creator":null,"video_url":null,"description":"Why the Sri Lanka series could be just as good as the recent England visit.","content":"The Black Caps’ two-test series with Sri Lanka starts tomorrow and Kris Shannon looks at why it could be just as good as the recent England visit. 1. Maybe they’ll win by one run again? In another world, one in which the international cricketing calendar was equitable and not designed to make the rich richer, we could be in the middle of the deciding third test between the Black Caps and England. We are not. We are in this world, filled with misery and suffering and yet another two-test series starting on Thursday, this time against Sri Lanka. This series may feel like a huge comedown after the blockbuster clash with England in general, and the madness of that final day at the Basin Reserve in particular. But I am pleased to report that is far from true, for an abundance of reasons (well, five). To start: what if there’s another test decided by one run? The haters will say that it’s impossible; that it’s one of the rarest occurrences in sport, last week being the second such occasion in almost 150 years of test cricket. But what if it does? Wouldn’t that be amazing? Winning one test by a solitary run isn’t cool. You know what’s cool? Winning *two* tests by a solitary run. In a row. Which could definitely happen. You can’t rule it out. You can’t tell me summer has peaked, that we just witnessed the best test the Black Caps will play in my lifetime, rendering each subsequent match a little less enjoyable and creating inside me a yearning void that will never be sated. You can’t. Advertisement Advertise with NZME. 2. Maybe there’ll be more Bazball? What will soon be regarded as the Black Caps’ second-best home test series this summer confirmed one notion: Brendon McCullum’s whole deal is real. England’s winning streak was ended but their streak of compelling test matches survived, with even the first-test thrashing at Bay Oval featuring captivating cricket and ample opportunities for the opposition to avoid said thrashing. England, it seems, aren’t all talk. They really will persist with this risky style of play, no matter whether a safer strategy would have almost certainly won the series. That was clear in not just Ben Stokes’ bucking recent trends by enforcing the follow-on. It was clear in how England continually sought to curtail their own innings rather than bat the opposition - and potentially themselves - out of a positive result. And it was clear after the one-run defeat in Wellington. McCullum had stressed his side primarily wanted to entertain and, having played their part in the ultimate show, there was no hint of disappointment among the touring players. So, yeah. Maybe Sri Lanka will do that? Idk 3. Exciting squad experimentation Advertisement Advertise with NZME. England weren’t alone — the home side also played engaging cricket the last couple of weeks. Now they must do likewise to ensure the Sri Lanka series isn’t seen as a huge comedown, which, again, it is not. Thankfully, they have just the men for the job…the exact same men who did the job against England. It wouldn’t have made sense, would it, to try to replicate last month’s excitement with any changes in personnel? Now’s not the time to get crazy, to select a single new player, to add some spark into a proudly settled team who boast one victory in eight. Who wants to see whether Glenn Phillips, this country’s most thrilling batsman, can translate his talent to test cricket and back up the debut half-century he scored against Australia more than three years ago, only to never be selected again? Not me, no thanks. And why would anyone want a look at Ish Sodhi in New Zealand conditions following his player-of-the-series performance in Pakistan? Michael Bracewell did a perfectly mediocre job as the sole spinner against England. Now’s the time to stay the course. There’s no room for experimentation. Not when these tests matter. 4. These tests matter Look, it says it right there in the header, why bore anyone for 135 words explaining the reason these tests matter. That’s not what this column is about: picking a topic by throwing darts at a newspaper before scratching together some flimsy supporting evidence. This column trusts readers don’t need their hand held; they’re clever enough to reach their own conclusions. But if I’m wrong about that, if I have too much faith in anyone foolish enough to still be reading, then here’s a brief case. These tests matter because New Zealand haven’t won a test series since June 2021. They matter because playing a Sri Lanka side a couple of places below them in the world rankings represents a golden chance to end that barren run. They matter because [Eds note: cut for space]. 5. Absence makes the heart whatever Thought of another one. These tests matter because of scarcity. They’re the last tests the Black Caps will play until a two-match series in Bangladesh after the ODI World Cup. Some foolish folk will use that fact to argue these tests don’t matter, that the steady diet of short-form cricket to follow is all that counts in a World Cup year.But wise observers will have a succinct retort: No. You’re wrong. Stop saying that these tests feel totally irrelevant after those wondrous five days in Wellington, that this series will be a huge comedown. And please stop pestering New Zealand Cricket about when that match will be made available as an NFT. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-03-07 19:27:59","image_url":"https://www.nzherald.co.nz/resizer/OmEBAQk7VBKhI6INezuAPBJ9ULk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VMQC5BUHLVAFTAKUEHI47MRE2A.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"New Zealand stands in way of Sri Lanka’s World Test final quest","link":"https://www.dailymirror.lk/cricket/New-Zealand-stands-in-way-of-Sri-Lanka’s-World-Test-final-quest/315-255423","keywords":null,"creator":null,"video_url":null,"description":"Despite having an eye on the bigger picture of qualification for the final of the World Championship later this year, Sri Lanka Test captain Dimuth Karunaratne said that his team’s focus, for now at least, was the first Test against New Zealand that starts at the Hagley Oval in Christchurch on Thursday.","content":"Despite having an eye on the bigger picture of qualification for the final of the World Championship later this year, Sri Lanka Test captain Dimuth Karunaratne said that his team’s focus, for now at least, was the first Test against New Zealand that starts at the Hagley Oval in Christchurch on Thursday. A 2-0 series whitewash of New Zealand could put Sri Lanka into the final, although it also depends on India not winning their final Test against Australia. “Before we even think about two Test matches we need to think about the first Test, and how we can win that. That's been the conversation. As a team, we are well aware of that,” Karunaratne said on Tuesday. It will not be an easy task either, given that Sri Lanka have previously won only two Tests in New Zealand, but Karunaratne believes that playing in March, as opposed to December when Sri Lanka’s Tests in New Zealand are usually scheduled, could bring their spinners into contention. “We usually tour New Zealand in December, but this time since we are touring in March it is quite hot and I think the pitches will dry quickly and offer support to spinners. In the New Zealand versus England series, the spinners were among the wickets. So we are leaning towards playing a frontline spinner in addition to Dhananjaya de Silva,” Karunaratne added. That will likely see Prabath Jayasuriya, the left-arm spinner who had an incredible start to his Test career with 29 wickets in three matches, feature alongside three front-line fast-bowlers. One department that virtually picks itself is the batting, with Karunaratne backing the batsmen that featured in Sri Lanka’s last Test against Pakistan. “Right now, our top order is stable. Everyone has been among the runs and have cemented their places,” Karunaratne said, adding that this would mean top order batsman Nishan Madushka is unlikely to be given a Test debut, atleast for the first Test. “Nishan is an up and coming player who has been among the runs, and consistently too. We would like to give him a chance, but when you look at the team, all the batters have shown their skill, and unluckily he won't get a chance for the first Test,” Karunaratne said. One way into the team for Madushka however, by Karunaratne’s own admission, is if specialist wicket-keeper Niroshan Dickwella fails to produce with the bat. “We look at Dickwella as a specialist wicket-keeper, and when you compare him to the other options we have in that role, he is by far the best. Even when Kumar Sangakkara was in the team, the wicket-keeping role was given to Prasanna Jayawardena, and even though other players who could keep wickets came into the team, Prasanna was always given that role,” he said. “We need a specialist keeper in Test cricket, more so than T20I and ODI cricket. Dickwella has not played a big innings yet, but when you see how he has batted with the tail end at times, he has made some important contributions. We are going with Dickwella, but we have put that pressure on him, especially since Nishan can also keep, and if Dicwkella doesn't perform maybe that could be an opening for him.” Meanwhile, New Zealand will take momentum from their dramatic one-run win over England last week, a result that put them in rare company. Tim Southee's hosts became just the fourth team to win a Test after following on as they secured a draw in the two-match series against England. Kane Williamson, who became New Zealand's record run-scorer in the thrilling Wellington win, said it was vital to kick on after the Black Caps ended a seven-Test winless run. \"It's been a long time for us to get over the line,\" former skipper Williamson said ahead of the first Test against Sri Lanka starting on Thursday in Christchurch. \"We haven't had the results we would've liked, despite putting the work in, so it's nice to get those rewards. \"It's an important series for us now as we are looking to improve and we're focused in trying to put out better performances.\" Sri Lanka's preparations have been disrupted by rain, with the second day of their only warm-up match against a New Zealand Board XI washed out on Sunday in Lincoln, just outside Christchurch. Sri Lanka will also play three one-day internationals and three Twenty20s against New Zealand after the Tests. New Zealand (from): Tim Southee (capt), Tom Blundell, Michael Bracewell, Devon Conway, Matt Henry, Tom Latham, Daryl Mitchell, Blair Tickner, Neil Wagner, Scott Kuggeleijn, Henry Nicholls, Kane Williamson, Will Young Sri Lanka (from): Dimuth Karunaratne (capt), Oshada Fernando, Kusal Mendis, Angelo Mathews, Dhananjaya de Silva, Dinesh Chandimal, Kamindu Mendis, Niroshan Dickwella, Nishan Madushka, Ramesh Mendis, Prabath Jayasuriya, Chamika Karunaratne, Kasun Rajitha, Lahiru Kumara, Asitha Fernando, Vishwa Fernando, Milan Rathnayake","pubDate":"2023-03-07 18:37:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_6219fb68c3.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Proteas ring changes for second Test cricket match against West Indies","link":"https://www.dailymaverick.co.za/article/2023-03-07-proteas-ring-changes-for-second-test-cricket-match-against-west-indies/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Proteas coach Shukri Conrad has made four changes to the side that beat West Indies by 87 runs in the first Test. The post Proteas ring changes for second Test cricket match against West Indies appeared first on Daily Maverick.","content":"Shukri Conrad has not been afraid of making bold decisions since taking the reigns as head coach of South Africa’s Test team. He has continued that approach in only his second match in charge. First, by deviating from the norm and announcing the playing 11 a day early for the Proteas’ second Test match against West Indies. Second, by ringing four changes to his side and subsequently allowing every player in the squad a run in the two-match series. “I don’t set out to do things in a brave way. I’d like to think I am a guy who thinks things through carefully, but I’m always going to look to take the road less travelled, and that’s where I’d like this side to go,” Conrad told the media on Tuesday. The four changes include Ryan Rickelton, Wiaan Mulder, Simon Harmer and Keshav Maharaj coming in for Keegan Petersen, Senuran Muthusamy, Marco Jansen and Anrich Nortje. Nortje was the only enforced change — ruled out due to a stiff groin. “We all know that Anna [Nortje] has been ruled out. Marco [Jansen] deserves a little bit of a break,” said Conrad. “That lanky body of his has been through the mill the last couple of months and we also need to look after what lies ahead for these guys in the next couple of months.” Temba Bavuma of the Proteas during day two of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 1 March 2023 in Centurion, South Africa. (Photo: Lee Warren / Gallo Images) Visit Daily Maverick’s home page for more news, analysis and investigations Rickelton is a straight swap for Petersen in the No. 5 batting position. “This is not just changing the side for the sake of changing the side,” said Conrad. “Everybody’s got a crack, but the one oke that probably deserves a crack more than anyone [Ryan Rickelton] hasn’t had one yet. It was a simple choice, that.” But Conrad assured that Petersen is still part of his long-term planning in the batting department. “We went with Keegan in the first Test because he was the incumbent. Him being left out is not on the back of two non-scoring performances,” said the coach. “I still think [Petersen’s] best position might be [number] five going forward, in terms of the way he plays… I feel Keegan’s got a bigger role to play in the middle order rather than the top-order. “Rickelton deserves his crack at it too. As everybody knows, he’s been churning out [the runs domestically],” added Conrad. Consistent and big runs have been a rarity for the Proteas in the last couple of years. However, Conrad is confident that they will soon find the winning formula. “This Test batting unit is still a work in progress. But hopefully by design and not stumbling onto something, we’re going to get the right mix.” Kagiso Rabada of South Africa during day three of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 2 March 2023 in Centurion, South Africa. (Photo: Sydney Seshibedi / Gallo Images) The Test match will take place at the Wanderers in Johannesburg, which is traditionally known as fast-bowling paradise. But Conrad has elected to only go with two fast bowling options in Kagiso Rabada and Gerald Coetzee – who made his debut in the previous Test – as well as Mulder’s medium pace. Conrad has also opted for two frontline spinners in Harmer and Maharaj. “History would suggest, in the last year, that the spinners do come into the game here,” he said. “The game doesn’t have to end on day three. Test matches are meant to go to day five, and if it goes to days four and five, our spinners will come into it in a big way. The first ball of the Test match between South Africa and West Indies will be bowled at 10am on Wednesday. DM Dean Elgar, Aiden Markram, Tony de Zorzi, Temba Bavuma (captain), Ryan Rickelton, Heinrich Klaasen, Wiaan Mulder, Simon Harmer, Keshav Maharaj, Gerald Coetzee, Kagiso Rabada","pubDate":"2023-03-07 18:12:37","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs","link":"https://www.firstpost.com/firstcricket/sports-news/dc-vs-upw-highlights-wpl-2023-match-5-at-dy-patil-stadium-delhi-hammer-up-by-42-runs-12256602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs","content":"Cricket DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs DC vs UPW WPL 2023 Highlights: Follow DC vs UPW live score, ball by ball commentary, scorecard and latest updates from WPL 2023 live match at Firstpost FirstCricket Staff March 7th, 2023 23:12:13 IST Meg Lanning and Alyssa Healy, captain of Delhi Capitals and UP Warriorz respectively, at toss in Match 5 of WPL 2023. Sportzpics FP commentary Quick Scorecard Full scorecard Ball by ball commentary Delhi Capitals Vs UP Warriorz At Dr. DY Patil Sports Academy, Navi Mumbai, 07 March, 2023 07 March, 2023 Starts 19:30 (IST) Match Ended Delhi Capitals 211/4 (20.0 ov) Match 5 UP Warriorz 169/5 (20.0 ov) Delhi Capitals beat UP Warriorz by 42 runs Toss: UP Warriorz won the toss and chose to field in Match 5 of the inaugural Women’s Premier League at the DY Patil Stadium in Navi Mumbai on Tuesday. The Warriorz made a big call in their second outing of the tournament — that of benching Grace Harris, who masterminded a come-from-behind victory over Gujarat Giants on Sunday in their opening game. Harris, who struck an unbeaten 59 that setup a thrilling three-wicket win, was left out in favour of South African speedster Shabnim Ismail, whose inclusion was apparently inspired by the conditions, especially the tinge of green on the DY Patil surface. Delhi Capitals skipper Meg Lanning, meanwhile, announced an unchanged XI for the clash. Much like UP, Delhi too began their campaign with a victory though theirs was by a comfortable 60-run over Royal Challengers Bangalore. Openers Lanning and Shafali Verma had stitched an opening stand worth 162 after RCB opted to field, with Marizanne Kapp and Jemimah Rodrigues taking over once both departed within a few deliveries of one another. Kapp and Rodrigues shared an unbroken 60-run stand as Delhi posted a mammoth 223/2 on the board. American seamer Tara Norris would then record the first five-for of the tournament as her haul of 5/29 would ensure Bangalore were never in the hunt in the first place. Delhi Capitals : Meg Lanning (c), Shafali Verma, Marizanne Kapp, Jemimah Rodrigues, Alice Capsey, Jess Jonassen, Taniya Bhatia (wk), Arundhati Reddy, Shikha Pandey, Radha Yadav, Tara Norris UP Warriorz : Alyssa Healy (wk/c), Shweta Sehrawat, Kiran Navgire, Tahlia McGrath, Deepti Sharma, Simran Shaikh, Devika Vaidya, Sophie Ecclestone, Shabnim Ismail, Anjali Sarvani, Rajeshwari Gayakwad Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 07, 2023 23:12:13 IST Tags: Cricket Delhi Capitals Up Warriorz Wpl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-07 17:42:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Meg-Lanning-Alyssa-Healy-DC-UPW-WPL-2023-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"India head coach Rahul Dravid plays down pitch talk ahead of 4th Test against Australia","link":"https://thenewsmill.com/2023/03/india-head-coach-rahul-dravid-plays-down-pitch-talk-ahead-of-4th-test-against-australia/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"India head coach Rahul Dravid delved briefly into the talk around the pitch ahead of the fourth Test against Australia in Ahmedabad and said that they need to be realistic about batting in these challenging conditions. The fourth Test begins on Thursday in Ahmedabad with India aiming to book their place in the WTC final with a win. Dravid said that challenging wickets were a “part of the game” with the talk around pitches raging after the Indore pitch for the third Test received a “poor” rating from International Cricket Council (ICC). The home team’s head coach also played down talks around India’s batters struggling, maintaining that expectations have to be “realistic”. “We have played on some challenging wickets when we go overseas also,” Dravid said in the pre-match press conference. “[We] played in South Africa recently where spinners were completely taken out of the game. And everyone wants to produce wickets where eventually one wants results. You will probably prepare wickets where the ball holds a bit more sway over the bat and that’s necessary and part of the game,” he added. With the top order struggling, India’s lower middle order has been responsible for the majority of runs in the series, but Dravid didn’t seem bothered by this. “You need to be realistic as to what is a good performance on these challenging wickets,” Dravid said. “So, you need to be realistic what the benchmarks are now, what standards are on these kinds of surfaces just one good performance can change the game. It might not be a double hundred but a 50-60 or 70 somewhere, but could actually be a very, very good score in some conditions,” he added. India are 2-1 ahead in the series, but Australia’s stunning win in Indore in the previous Test saw them qualify for the ICC World Test Championship final and also proved that they could not only test, but also beat, India in these conditions.(ANI)","pubDate":"2023-03-07 17:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs Australia: Ahmedabad pitch and that Rohit Sharma look","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-ahmedabad-pitch-and-that-rohit-sharma-look-12257082.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"India vs Australia: Ahmedabad pitch and that Rohit Sharma look","content":"Cricket India vs Australia: Ahmedabad pitch and that Rohit Sharma look After inspecting the pitch, Rohit Sharma threw his hands up in an animated fashion, he inspected the strip from different angles, did some shadow batting too and was constantly in the ground staff’s ears. Sahil Malhotra March 7th, 2023 22:54:07 IST Indian skipper Rohit Sharma assessing the pitch on Tuesday morning. Image credit: Sahil Malhotra Before the Indian players started with their warm-up drills, Rohit Sharma made the long walk down the dressing room via a very long tunnel and headed towards the square where two pitches were under the covers. He ignored the one on the far right and instructed the ground staff to remove covers off the one he was standing close to. The captain seemed far away from the boundary rope, where your’s truly stood, but a borrowed binocular helped in seeing Rohit’s first reaction to the 22 yards. And, it didn’t seem a pleasant one. The 35-year-old had his both hands up in animated fashion, as if suggesting to the curator and ground staff, “ye kya hai (what is this)”. Again, not an analysis of a lip-reading expert but some observations after seeing the skipper’s reaction. He inspected the strip from different angles, did some shadow batting too and was constantly in the ground staff’s ears. Read: What Ahmedabad has in store for PM Modi, Anthony Albanese Rohit was alone to start the inspection but soon had the company of coach Rahul Dravid, batting coach Vikram Rathour and bowling coach Paras Mhambrey. The think tank paced up and down the surface and continued to chat with the ground staff. Rohit and Rahul did have a mini-discussion of sorts away from the group for a brief period before the former exited the scene and commenced his warm-up. The right-hander did check the firmness of the strip on multiple occasions, from multiple spots, and it could well be the reason for his response. In comparison to Nagpur, Delhi and Indore, this looked the freshest of the lot and gave no impressions of a dry rank-turner. Not to forget there was a lot of unexpected rain last evening. Morning session look of the square at the Narendra Modi Stadium in Ahmedabad. Image credit: Sahil Malhotra Cheteshwar Pujara and Kuldeep Yadav were the next pair to reach the square and the former went down on his knees to get a close feel of the surface. He pressed his fingers on the strip from different positions and seemed keen on ascertaining how hard or soft it was. When all this was going on, Rahul used a new SG ball to do a bounce test near what seemed like the popping crease area. The bounce test didn’t return positive but a fresh bout of sunlight and some rolling will help iron out flaws, if any, on that front. Soil sourced from Kolkata for two pitches The ground-staff seems confident of having a game of “at least four days” and most feel it will not be the raging rank-turner seen in Indore, where the game lasted a little over two days. The excess green in between the two covered wickets did spice things up in the morning session where the visiting Australian media thought something different could well be in store. The bigger confusion for most in the morning was to figure out which pitch was being prepared for the match. The entire square was cordoned off, was not under covers and it was difficult to make out which pitch will be the match pitch. Red soil, black soil. Which soil? #INDvAUS @cricketnext pic.twitter.com/PRhcCEg0dx — Sahil Malhotra (@Sahil_Malhotra1) March 7, 2023 On speaking to the ground-staff and quizzing them on the fresh look of the square, it was brought to our notice that fresh soil has been sourced from Kolkata and two pitches have been re-laid. They will most likely be used from next season onwards. “ Kolkata se mitti mangwaya hai (soil has come from Kolkata) and it has been used for two wickets. Do naya wicket tayyar ho raha hai, aur agle season se istemaal hoga ,” a member of the groundstaff told News18 CricketNext. ‘Don’t know why second pitch was covered’ Unlike the morning session, there was clarity in the afternoon when Rohit & Co trained. The inspection was done of the match pitch only, the one under covers on the left (left of the players’ box/tunnel), and no attention was paid to the covered one on the extreme right. “I don’t know why two strips are covered. I never asked him why he (the curator) covered the other strip. I didn’t see the other one. I just looked at the one we are playing on and it looks okay to me. Whatever the wicket is, it honestly doesn’t matter. There is a lot of talk around the pitches. It is the same for both teams. It is more challenging for the batters at times and more challenging for the bowlers at times. Wickets are like that. Whatever it is, we have to learn to play on them. We have to learn to adjust and we have played on some challenging wickets overseas as well. We played in South Africa recently where the spinners were completely taken out of the game. Everyone is trying to produce wickets which give results,” Dravid said on the pitch during the press conference. Read: After Indore loss, ‘Jeet Nischay’ and ‘Sammaan’ greet India in Ahmedabad As much as the team, captain, coach and management try to downplay the pitch talk, it continues to be the point of interest in the build-up to every fixture of this Border Gavaskar Trophy. And, Ahmedabad has been no different. From a series standpoint, a lot is at stake for both sides and the hosts in particular would be gunning for a win to secure their World Test Championship final berth. Whether this is the ideal pitch to get a result in their favour is something we will find out in a couple of days’ time but all eyeballs will continue to be hooked to the 22 yards. The Indore strip changed drastically from how it was during the practice sessions and while Ahmedabad wears a fresh look, there’s a possibility of it going the drier, if not rank-turner, route. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 07, 2023 22:54:07 IST Tags: Cricket India Vs Australia India Vs Australia 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-07 17:24:07","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Rohit-Sharma-Ahmedabad-pitch-inspection-Ahmedabad-Test-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"\"In UK, the ball swings for long periods of time\"- Ricky Ponting suggests a unique inclusion in India's batting unit for WTC final","link":"https://www.sportskeeda.com/cricket/news-in-uk-ball-swings-long-periods-time-ricky-ponting-suggests-unique-inclusion-india-s-batting-unit-wtc-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Anuj Nitin Prabhu"],"video_url":null,"description":null,"content":"Former Australian captain Ricky Ponting feels Team India need to find a way of playing both Shubman Gill and KL Rahul in their playing XI if they reach the World Test Championship (WTC) final. The high-octane clash is scheduled to be played in June later this year. Rahul was dropped from the team after the first two Tests against Australia and picked Gill for the third Test in Indore. However, Ponting stressed how different the conditions for the WTC final will be compared to those in India and shed light on how good Rahul's record has been in England. KL Rahul already has two Test centuries in England and so Ricky Ponting wants India to play both him and Shubman Gill in those conditions. Here's what he said in the ICC Review: Ricky Ponting also opined that with the weather in England always being a factor, both teams will need to pick their XI based on the conditions. While he agreed that The Oval is one of the best batting pitches in England, Ponting also spoke about how overhead conditions could change the situation. India will confirm their place in the WTC final if they beat Australia in the fourth Test in Ahmedabad, beginning on Thursday, March 9. Poll : 0 votes Quick Links","pubDate":"2023-03-07 16:45:34","image_url":"https://staticc.sportskeeda.com/editor/2023/03/50ace-16781918452651-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL: छक्के-चौके से ही ठोकी फिफ्टी, 42 गेंद में 72 रन, कौन हैं नई ऑरेंज कैप होल्डर","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/wpl-2023-meg-lanning-hits-consecutive-fifty-in-orange-cap-holder-of-the-tournament/articleshow/98483253.cms","keywords":null,"creator":null,"video_url":null,"description":"Mag Lanning WPL: मैग लैनिंग ने वीमेंस प्रीमियर लीग में लगातार दूसरी फिफ्टी ठोक दी है। आरसीबी के बाद यूपी वारियर्स के खिलाफ उनके बल्ले से अर्धशतक निकला। इसी के साथ यह ऑस्ट्रेलियाई ओपनर टूर्नामेंट की ऑरेंज कैप होल्डर भी बन चुकीं हैं।","content":"वीमेंस प्रीमियर लीग (Women's premier league) में ऑस्ट्रेलियाई ओपनर मैग लैनिंग का शानदार फॉर्म जारी है। दिल्ली कैपिटल्स की इस कैप्टन ने टूर्नामेंट में लगातार दूसरी फिफ्टी ठोकी। यूपी वॉरियर्स के खिलाफ उन्होंने ताबड़तोड़ 70 रन बनाए। 42 गेंद की इस पारी में मैग के बल्ले से 10 करारे चौके और 3 जबरदस्त छक्के भी निकले। इसी के साथ ऑरेंज कैप भी हथिया लिया। पहले मैच में आरसीबी के खिलाफ भी उन्होंने जोरदार बैटिंग करते हुए 72 रन बनाए थे। मैग लैनिंग के बूते ही दिल्ली कैपिटल्स ने टॉस गंवाकर पहले बल्लेबाजी करते हुए चार विकेट पर 211 रन का विशाल स्कोर खड़ा किया। यह टूर्नामेंट में दिल्ली का लगातार दूसरा 200+ स्कोर था। जेस जॉनासन (20 गेंदों पर नाबाद 42, तीन चौके, तीन छक्के) और जेमिमा रोड्रिग्स (22 गेंदों पर नाबाद 34, चार चौके) ने 34 गेंदों पर 67 रन की अटूट साझेदारी करके टीम का स्कोर 200 रन के पार पहुंचाया। पावरप्ले में लैनिंग ने रन बनाने का बीड़ा उठाया। उनकी आक्रामक बल्लेबाजी से दिल्ली ने पहले छह ओवरों में 62 रन बनाए। लैनिंग ने पिछले मैच में वारियर्स को जीत दिलाने वाली ग्रेस हैरिस की जगह टीम में शामिल की गई शबनीम इस्माइल पर दो छक्के लगाए और पावरप्ले के अंतिम ओवर में बाएं हाथ की स्पिनर राजेश्वरी गायकवाड़ का स्वागत चार चौकों से किया। लैनिंग और शेफाली वर्मा (14 गेंदों पर 17 रन) ने पहले विकेट के लिए 67 रन जोड़े। मैग लैनिंग ने अनुभवी स्पिनर सोफी एक्लेस्टोन पर छक्का जड़कर 32 गेंदों में अपना अर्धशतक पूरा किया। इसके बाद बारिश के कारण कुछ देर के लिए खेल रुका रहा। एक्लेस्टोन खेल शुरू होने पर मारिजान काप (12 गेंदों पर 16 रन) को दीप्ति शर्मा के हाथों कैच कराया। लैनिंग ने इसी ओवर में लगातार दो चौके जड़े, लेकिन गायकवाड ने अगले ओवर में आर्म बॉल पर उनका मिडिल स्टंप थर्रा दिया। इसके बाद जॉनसन और रोड्रिग्स ने आखिरी चार ओवर में 58 रन जुटाए।","pubDate":"2023-03-07 16:42:42","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jonassen, Lanning star in DC’s comfortable win","link":"http://island.lk/jonassen-lanning-star-in-dcs-comfortable-win/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"A terrific 70 from skipper Meg Lanning and an allround performance from Jess Jonassen helped Delhi Capitals pick up their second straight win in the inaugural WPL on Tuesday (March 7). Lanning’s fireworks at the top of the order and Jonassen’s finish saw Capitals post an imposing 211 on the board. Even though Tahlia McGrath […]","content":"A terrific 70 from skipper Meg Lanning and an allround performance from Jess Jonassen helped Delhi Capitals pick up their second straight win in the inaugural WPL on Tuesday (March 7). Lanning’s fireworks at the top of the order and Jonassen’s finish saw Capitals post an imposing 211 on the board. Even though Tahlia McGrath went one step ahead by smashing an unbeaten 90, a lack of support from the other end saw Warriorz lose comfortably by 42 runs in the end. Brief scores: Delhi Capitals 211/4 in 20 overs (Meg Lanning 70, Jess Jonassen 42*; Shabnim Ismail 1/29) UP Warriorz 169/5 in 20 overs (Tahlia McGrath 90*; Jess Jonassen 3/43) 42 runs Published on By Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa.","pubDate":"2023-03-07 20:07:54","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Michael Vaughan's legal team describe ECB racism investigation as \"wholly inadequate\"","link":"https://www.mirror.co.uk/sport/cricket/michael-vaughan-ecb-yorkshire-rafiq-29398111","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Dean Wilson)"],"video_url":null,"description":"Michael Vaughan's legal team gave closing submissions on Tuesday at the Cricket Discipline Commission hearing and took aim at the ECB, but the national governing body hit back","content":"Michael Vaughan and his legal team have slammed the ECB , describing their racism investigation case as “wholly inadequate” and biased. Vaughan is charged with bringing the game into disrepute by saying to Azeem Rafiq , Adil Rashid , Rana Naved-ul-Hasan and Ajmal Shahzad “there’s too many of you lot, we need to have a word about that” prior to a Twenty20 match against Nottinghamshire in June 2009. Vaughan categorically denies the allegation, and the closing submissions from Christopher Stoner KC on behalf of the former England captain took a swipe at the way the ECB had handled the entire case, branding it unfair and claiming it denied their client “due process.” Michael Vaughan says it's \"inconceivable\" he made alleged racist comment to team-mates Michael Vaughan blasts cricket racism hearing as a \"terrible look for the game\" The ECB’s legal lead, Jane Mulcahy KC, hit back at those claims, describing them as “inappropriate to be alleged”. On the final day of the Cricket Discipline Commission hearing, both sides traded blows with compelling descriptions of the evidence heard over the previous four days. But what Vaughan described in his evidence as a “terrible look for the game”, after he and former team-mate Rafiq had fought it out in public, became an argument between an Ashes -winning captain and his former employers and governing body over accusations both parties had not being sufficiently thorough in their collection of evidence. And Stoner pulled no punches when he said: “We say this investigation was wholly inadequate. In reality there was no investigation, and we are concerned by the bias shown by the ECB. Michael Vaughan and his legal team slammed the ECB in closing submissions ( Image: AP) “Due process matters and it is the cornerstone of our law. It was sent on holiday by the ECB in this investigation. That brings a question of fairness. This was a prosecution from the outset.” Mulcahy KC was just as robust in her summation of the ECB’s case beforehand when she focused once more on the historic tweets sent by Vaughan between 2010 and 2017, for which he has already apologised and agreed were “completely unacceptable.” Mulcahy said: “The tweets are central to this case and it makes no difference that they were sent in a non-cricketing context. We say if a person has a tendency to make racist comments, they have a tendency to make racist comments.” The final cases against the non-participating Andrew Gale and Richard Pyrah were also heard before the panel retired to deliberate on a verdict that is expected at the end of the month. Panel chair Tim O’Gorman said: “These are serious matters, and the panel will give them due consideration.” Read More 4 questions England must answer ahead of World Cup defence including Ben Stokes' future Read More Shakib Al Hasan stars as England slump to ODI defeat against Bangladesh Read More Ashes tipped to be best series since 2005 with Bazball making Australia 'take notice' Read More England quick Mark Wood admits he \"might not play any\" Ashes Tests this summer Read More Shane Warne's family pay moving tribute to Australian icon a year on from tragic death","pubDate":"2023-03-07 19:45:57","image_url":"https://i2-prod.mirror.co.uk/incoming/article29398410.ece/ALTERNATES/s615/0_lkw102-0_252.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Five reasons why: Sri Lanka clash isn’t a big comedown","link":"https://www.nzherald.co.nz/sport/five-reasons-why-sri-lanka-clash-isnt-a-big-comedown/AINJ45BN5VFATG4MMRVHFWVXWY/","keywords":null,"creator":null,"video_url":null,"description":"Why the Sri Lanka series could be just as good as the recent England visit.","content":"The Black Caps’ two-test series with Sri Lanka starts tomorrow and Kris Shannon looks at why it could be just as good as the recent England visit. 1. Maybe they’ll win by one run again? In another world, one in which the international cricketing calendar was equitable and not designed to make the rich richer, we could be in the middle of the deciding third test between the Black Caps and England. We are not. We are in this world, filled with misery and suffering and yet another two-test series starting on Thursday, this time against Sri Lanka. This series may feel like a huge comedown after the blockbuster clash with England in general, and the madness of that final day at the Basin Reserve in particular. But I am pleased to report that is far from true, for an abundance of reasons (well, five). To start: what if there’s another test decided by one run? The haters will say that it’s impossible; that it’s one of the rarest occurrences in sport, last week being the second such occasion in almost 150 years of test cricket. But what if it does? Wouldn’t that be amazing? Winning one test by a solitary run isn’t cool. You know what’s cool? Winning *two* tests by a solitary run. In a row. Which could definitely happen. You can’t rule it out. You can’t tell me summer has peaked, that we just witnessed the best test the Black Caps will play in my lifetime, rendering each subsequent match a little less enjoyable and creating inside me a yearning void that will never be sated. You can’t. Advertisement Advertise with NZME. 2. Maybe there’ll be more Bazball? What will soon be regarded as the Black Caps’ second-best home test series this summer confirmed one notion: Brendon McCullum’s whole deal is real. England’s winning streak was ended but their streak of compelling test matches survived, with even the first-test thrashing at Bay Oval featuring captivating cricket and ample opportunities for the opposition to avoid said thrashing. England, it seems, aren’t all talk. They really will persist with this risky style of play, no matter whether a safer strategy would have almost certainly won the series. That was clear in not just Ben Stokes’ bucking recent trends by enforcing the follow-on. It was clear in how England continually sought to curtail their own innings rather than bat the opposition - and potentially themselves - out of a positive result. And it was clear after the one-run defeat in Wellington. McCullum had stressed his side primarily wanted to entertain and, having played their part in the ultimate show, there was no hint of disappointment among the touring players. So, yeah. Maybe Sri Lanka will do that? Idk 3. Exciting squad experimentation Advertisement Advertise with NZME. England weren’t alone — the home side also played engaging cricket the last couple of weeks. Now they must do likewise to ensure the Sri Lanka series isn’t seen as a huge comedown, which, again, it is not. Thankfully, they have just the men for the job…the exact same men who did the job against England. It wouldn’t have made sense, would it, to try to replicate last month’s excitement with any changes in personnel? Now’s not the time to get crazy, to select a single new player, to add some spark into a proudly settled team who boast one victory in eight. Who wants to see whether Glenn Phillips, this country’s most thrilling batsman, can translate his talent to test cricket and back up the debut half-century he scored against Australia more than three years ago, only to never be selected again? Not me, no thanks. And why would anyone want a look at Ish Sodhi in New Zealand conditions following his player-of-the-series performance in Pakistan? Michael Bracewell did a perfectly mediocre job as the sole spinner against England. Now’s the time to stay the course. There’s no room for experimentation. Not when these tests matter. 4. These tests matter Look, it says it right there in the header, why bore anyone for 135 words explaining the reason these tests matter. That’s not what this column is about: picking a topic by throwing darts at a newspaper before scratching together some flimsy supporting evidence. This column trusts readers don’t need their hand held; they’re clever enough to reach their own conclusions. But if I’m wrong about that, if I have too much faith in anyone foolish enough to still be reading, then here’s a brief case. These tests matter because New Zealand haven’t won a test series since June 2021. They matter because playing a Sri Lanka side a couple of places below them in the world rankings represents a golden chance to end that barren run. They matter because [Eds note: cut for space]. 5. Absence makes the heart whatever Thought of another one. These tests matter because of scarcity. They’re the last tests the Black Caps will play until a two-match series in Bangladesh after the ODI World Cup. Some foolish folk will use that fact to argue these tests don’t matter, that the steady diet of short-form cricket to follow is all that counts in a World Cup year.But wise observers will have a succinct retort: No. You’re wrong. Stop saying that these tests feel totally irrelevant after those wondrous five days in Wellington, that this series will be a huge comedown. And please stop pestering New Zealand Cricket about when that match will be made available as an NFT. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-03-07 19:27:59","image_url":"https://www.nzherald.co.nz/resizer/OmEBAQk7VBKhI6INezuAPBJ9ULk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VMQC5BUHLVAFTAKUEHI47MRE2A.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"New Zealand stands in way of Sri Lanka’s World Test final quest","link":"https://www.dailymirror.lk/cricket/New-Zealand-stands-in-way-of-Sri-Lanka’s-World-Test-final-quest/315-255423","keywords":null,"creator":null,"video_url":null,"description":"Despite having an eye on the bigger picture of qualification for the final of the World Championship later this year, Sri Lanka Test captain Dimuth Karunaratne said that his team’s focus, for now at least, was the first Test against New Zealand that starts at the Hagley Oval in Christchurch on Thursday.","content":"Despite having an eye on the bigger picture of qualification for the final of the World Championship later this year, Sri Lanka Test captain Dimuth Karunaratne said that his team’s focus, for now at least, was the first Test against New Zealand that starts at the Hagley Oval in Christchurch on Thursday. A 2-0 series whitewash of New Zealand could put Sri Lanka into the final, although it also depends on India not winning their final Test against Australia. “Before we even think about two Test matches we need to think about the first Test, and how we can win that. That's been the conversation. As a team, we are well aware of that,” Karunaratne said on Tuesday. It will not be an easy task either, given that Sri Lanka have previously won only two Tests in New Zealand, but Karunaratne believes that playing in March, as opposed to December when Sri Lanka’s Tests in New Zealand are usually scheduled, could bring their spinners into contention. “We usually tour New Zealand in December, but this time since we are touring in March it is quite hot and I think the pitches will dry quickly and offer support to spinners. In the New Zealand versus England series, the spinners were among the wickets. So we are leaning towards playing a frontline spinner in addition to Dhananjaya de Silva,” Karunaratne added. That will likely see Prabath Jayasuriya, the left-arm spinner who had an incredible start to his Test career with 29 wickets in three matches, feature alongside three front-line fast-bowlers. One department that virtually picks itself is the batting, with Karunaratne backing the batsmen that featured in Sri Lanka’s last Test against Pakistan. “Right now, our top order is stable. Everyone has been among the runs and have cemented their places,” Karunaratne said, adding that this would mean top order batsman Nishan Madushka is unlikely to be given a Test debut, atleast for the first Test. “Nishan is an up and coming player who has been among the runs, and consistently too. We would like to give him a chance, but when you look at the team, all the batters have shown their skill, and unluckily he won't get a chance for the first Test,” Karunaratne said. One way into the team for Madushka however, by Karunaratne’s own admission, is if specialist wicket-keeper Niroshan Dickwella fails to produce with the bat. “We look at Dickwella as a specialist wicket-keeper, and when you compare him to the other options we have in that role, he is by far the best. Even when Kumar Sangakkara was in the team, the wicket-keeping role was given to Prasanna Jayawardena, and even though other players who could keep wickets came into the team, Prasanna was always given that role,” he said. “We need a specialist keeper in Test cricket, more so than T20I and ODI cricket. Dickwella has not played a big innings yet, but when you see how he has batted with the tail end at times, he has made some important contributions. We are going with Dickwella, but we have put that pressure on him, especially since Nishan can also keep, and if Dicwkella doesn't perform maybe that could be an opening for him.” Meanwhile, New Zealand will take momentum from their dramatic one-run win over England last week, a result that put them in rare company. Tim Southee's hosts became just the fourth team to win a Test after following on as they secured a draw in the two-match series against England. Kane Williamson, who became New Zealand's record run-scorer in the thrilling Wellington win, said it was vital to kick on after the Black Caps ended a seven-Test winless run. \"It's been a long time for us to get over the line,\" former skipper Williamson said ahead of the first Test against Sri Lanka starting on Thursday in Christchurch. \"We haven't had the results we would've liked, despite putting the work in, so it's nice to get those rewards. \"It's an important series for us now as we are looking to improve and we're focused in trying to put out better performances.\" Sri Lanka's preparations have been disrupted by rain, with the second day of their only warm-up match against a New Zealand Board XI washed out on Sunday in Lincoln, just outside Christchurch. Sri Lanka will also play three one-day internationals and three Twenty20s against New Zealand after the Tests. New Zealand (from): Tim Southee (capt), Tom Blundell, Michael Bracewell, Devon Conway, Matt Henry, Tom Latham, Daryl Mitchell, Blair Tickner, Neil Wagner, Scott Kuggeleijn, Henry Nicholls, Kane Williamson, Will Young Sri Lanka (from): Dimuth Karunaratne (capt), Oshada Fernando, Kusal Mendis, Angelo Mathews, Dhananjaya de Silva, Dinesh Chandimal, Kamindu Mendis, Niroshan Dickwella, Nishan Madushka, Ramesh Mendis, Prabath Jayasuriya, Chamika Karunaratne, Kasun Rajitha, Lahiru Kumara, Asitha Fernando, Vishwa Fernando, Milan Rathnayake","pubDate":"2023-03-07 18:37:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_6219fb68c3.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Proteas ring changes for second Test cricket match against West Indies","link":"https://www.dailymaverick.co.za/article/2023-03-07-proteas-ring-changes-for-second-test-cricket-match-against-west-indies/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Proteas coach Shukri Conrad has made four changes to the side that beat West Indies by 87 runs in the first Test. The post Proteas ring changes for second Test cricket match against West Indies appeared first on Daily Maverick.","content":"Shukri Conrad has not been afraid of making bold decisions since taking the reigns as head coach of South Africa’s Test team. He has continued that approach in only his second match in charge. First, by deviating from the norm and announcing the playing 11 a day early for the Proteas’ second Test match against West Indies. Second, by ringing four changes to his side and subsequently allowing every player in the squad a run in the two-match series. “I don’t set out to do things in a brave way. I’d like to think I am a guy who thinks things through carefully, but I’m always going to look to take the road less travelled, and that’s where I’d like this side to go,” Conrad told the media on Tuesday. The four changes include Ryan Rickelton, Wiaan Mulder, Simon Harmer and Keshav Maharaj coming in for Keegan Petersen, Senuran Muthusamy, Marco Jansen and Anrich Nortje. Nortje was the only enforced change — ruled out due to a stiff groin. “We all know that Anna [Nortje] has been ruled out. Marco [Jansen] deserves a little bit of a break,” said Conrad. “That lanky body of his has been through the mill the last couple of months and we also need to look after what lies ahead for these guys in the next couple of months.” Temba Bavuma of the Proteas during day two of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 1 March 2023 in Centurion, South Africa. (Photo: Lee Warren / Gallo Images) Visit Daily Maverick’s home page for more news, analysis and investigations Rickelton is a straight swap for Petersen in the No. 5 batting position. “This is not just changing the side for the sake of changing the side,” said Conrad. “Everybody’s got a crack, but the one oke that probably deserves a crack more than anyone [Ryan Rickelton] hasn’t had one yet. It was a simple choice, that.” But Conrad assured that Petersen is still part of his long-term planning in the batting department. “We went with Keegan in the first Test because he was the incumbent. Him being left out is not on the back of two non-scoring performances,” said the coach. “I still think [Petersen’s] best position might be [number] five going forward, in terms of the way he plays… I feel Keegan’s got a bigger role to play in the middle order rather than the top-order. “Rickelton deserves his crack at it too. As everybody knows, he’s been churning out [the runs domestically],” added Conrad. Consistent and big runs have been a rarity for the Proteas in the last couple of years. However, Conrad is confident that they will soon find the winning formula. “This Test batting unit is still a work in progress. But hopefully by design and not stumbling onto something, we’re going to get the right mix.” Kagiso Rabada of South Africa during day three of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 2 March 2023 in Centurion, South Africa. (Photo: Sydney Seshibedi / Gallo Images) The Test match will take place at the Wanderers in Johannesburg, which is traditionally known as fast-bowling paradise. But Conrad has elected to only go with two fast bowling options in Kagiso Rabada and Gerald Coetzee – who made his debut in the previous Test – as well as Mulder’s medium pace. Conrad has also opted for two frontline spinners in Harmer and Maharaj. “History would suggest, in the last year, that the spinners do come into the game here,” he said. “The game doesn’t have to end on day three. Test matches are meant to go to day five, and if it goes to days four and five, our spinners will come into it in a big way. The first ball of the Test match between South Africa and West Indies will be bowled at 10am on Wednesday. DM Dean Elgar, Aiden Markram, Tony de Zorzi, Temba Bavuma (captain), Ryan Rickelton, Heinrich Klaasen, Wiaan Mulder, Simon Harmer, Keshav Maharaj, Gerald Coetzee, Kagiso Rabada","pubDate":"2023-03-07 18:12:37","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs","link":"https://www.firstpost.com/firstcricket/sports-news/dc-vs-upw-highlights-wpl-2023-match-5-at-dy-patil-stadium-delhi-hammer-up-by-42-runs-12256602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs","content":"Cricket DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs DC vs UPW WPL 2023 Highlights: Follow DC vs UPW live score, ball by ball commentary, scorecard and latest updates from WPL 2023 live match at Firstpost FirstCricket Staff March 7th, 2023 23:12:13 IST Meg Lanning and Alyssa Healy, captain of Delhi Capitals and UP Warriorz respectively, at toss in Match 5 of WPL 2023. Sportzpics FP commentary Quick Scorecard Full scorecard Ball by ball commentary Delhi Capitals Vs UP Warriorz At Dr. DY Patil Sports Academy, Navi Mumbai, 07 March, 2023 07 March, 2023 Starts 19:30 (IST) Match Ended Delhi Capitals 211/4 (20.0 ov) Match 5 UP Warriorz 169/5 (20.0 ov) Delhi Capitals beat UP Warriorz by 42 runs Toss: UP Warriorz won the toss and chose to field in Match 5 of the inaugural Women’s Premier League at the DY Patil Stadium in Navi Mumbai on Tuesday. The Warriorz made a big call in their second outing of the tournament — that of benching Grace Harris, who masterminded a come-from-behind victory over Gujarat Giants on Sunday in their opening game. Harris, who struck an unbeaten 59 that setup a thrilling three-wicket win, was left out in favour of South African speedster Shabnim Ismail, whose inclusion was apparently inspired by the conditions, especially the tinge of green on the DY Patil surface. Delhi Capitals skipper Meg Lanning, meanwhile, announced an unchanged XI for the clash. Much like UP, Delhi too began their campaign with a victory though theirs was by a comfortable 60-run over Royal Challengers Bangalore. Openers Lanning and Shafali Verma had stitched an opening stand worth 162 after RCB opted to field, with Marizanne Kapp and Jemimah Rodrigues taking over once both departed within a few deliveries of one another. Kapp and Rodrigues shared an unbroken 60-run stand as Delhi posted a mammoth 223/2 on the board. American seamer Tara Norris would then record the first five-for of the tournament as her haul of 5/29 would ensure Bangalore were never in the hunt in the first place. Delhi Capitals : Meg Lanning (c), Shafali Verma, Marizanne Kapp, Jemimah Rodrigues, Alice Capsey, Jess Jonassen, Taniya Bhatia (wk), Arundhati Reddy, Shikha Pandey, Radha Yadav, Tara Norris UP Warriorz : Alyssa Healy (wk/c), Shweta Sehrawat, Kiran Navgire, Tahlia McGrath, Deepti Sharma, Simran Shaikh, Devika Vaidya, Sophie Ecclestone, Shabnim Ismail, Anjali Sarvani, Rajeshwari Gayakwad Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 07, 2023 23:12:13 IST Tags: Cricket Delhi Capitals Up Warriorz Wpl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-07 17:42:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Meg-Lanning-Alyssa-Healy-DC-UPW-WPL-2023-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"India head coach Rahul Dravid plays down pitch talk ahead of 4th Test against Australia","link":"https://thenewsmill.com/2023/03/india-head-coach-rahul-dravid-plays-down-pitch-talk-ahead-of-4th-test-against-australia/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"India head coach Rahul Dravid delved briefly into the talk around the pitch ahead of the fourth Test against Australia in Ahmedabad and said that they need to be realistic about batting in these challenging conditions. The fourth Test begins on Thursday in Ahmedabad with India aiming to book their place in the WTC final with a win. Dravid said that challenging wickets were a “part of the game” with the talk around pitches raging after the Indore pitch for the third Test received a “poor” rating from International Cricket Council (ICC). The home team’s head coach also played down talks around India’s batters struggling, maintaining that expectations have to be “realistic”. “We have played on some challenging wickets when we go overseas also,” Dravid said in the pre-match press conference. “[We] played in South Africa recently where spinners were completely taken out of the game. And everyone wants to produce wickets where eventually one wants results. You will probably prepare wickets where the ball holds a bit more sway over the bat and that’s necessary and part of the game,” he added. With the top order struggling, India’s lower middle order has been responsible for the majority of runs in the series, but Dravid didn’t seem bothered by this. “You need to be realistic as to what is a good performance on these challenging wickets,” Dravid said. “So, you need to be realistic what the benchmarks are now, what standards are on these kinds of surfaces just one good performance can change the game. It might not be a double hundred but a 50-60 or 70 somewhere, but could actually be a very, very good score in some conditions,” he added. India are 2-1 ahead in the series, but Australia’s stunning win in Indore in the previous Test saw them qualify for the ICC World Test Championship final and also proved that they could not only test, but also beat, India in these conditions.(ANI)","pubDate":"2023-03-07 17:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs Australia: Ahmedabad pitch and that Rohit Sharma look","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-ahmedabad-pitch-and-that-rohit-sharma-look-12257082.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"India vs Australia: Ahmedabad pitch and that Rohit Sharma look","content":"Cricket India vs Australia: Ahmedabad pitch and that Rohit Sharma look After inspecting the pitch, Rohit Sharma threw his hands up in an animated fashion, he inspected the strip from different angles, did some shadow batting too and was constantly in the ground staff’s ears. Sahil Malhotra March 7th, 2023 22:54:07 IST Indian skipper Rohit Sharma assessing the pitch on Tuesday morning. Image credit: Sahil Malhotra Before the Indian players started with their warm-up drills, Rohit Sharma made the long walk down the dressing room via a very long tunnel and headed towards the square where two pitches were under the covers. He ignored the one on the far right and instructed the ground staff to remove covers off the one he was standing close to. The captain seemed far away from the boundary rope, where your’s truly stood, but a borrowed binocular helped in seeing Rohit’s first reaction to the 22 yards. And, it didn’t seem a pleasant one. The 35-year-old had his both hands up in animated fashion, as if suggesting to the curator and ground staff, “ye kya hai (what is this)”. Again, not an analysis of a lip-reading expert but some observations after seeing the skipper’s reaction. He inspected the strip from different angles, did some shadow batting too and was constantly in the ground staff’s ears. Read: What Ahmedabad has in store for PM Modi, Anthony Albanese Rohit was alone to start the inspection but soon had the company of coach Rahul Dravid, batting coach Vikram Rathour and bowling coach Paras Mhambrey. The think tank paced up and down the surface and continued to chat with the ground staff. Rohit and Rahul did have a mini-discussion of sorts away from the group for a brief period before the former exited the scene and commenced his warm-up. The right-hander did check the firmness of the strip on multiple occasions, from multiple spots, and it could well be the reason for his response. In comparison to Nagpur, Delhi and Indore, this looked the freshest of the lot and gave no impressions of a dry rank-turner. Not to forget there was a lot of unexpected rain last evening. Morning session look of the square at the Narendra Modi Stadium in Ahmedabad. Image credit: Sahil Malhotra Cheteshwar Pujara and Kuldeep Yadav were the next pair to reach the square and the former went down on his knees to get a close feel of the surface. He pressed his fingers on the strip from different positions and seemed keen on ascertaining how hard or soft it was. When all this was going on, Rahul used a new SG ball to do a bounce test near what seemed like the popping crease area. The bounce test didn’t return positive but a fresh bout of sunlight and some rolling will help iron out flaws, if any, on that front. Soil sourced from Kolkata for two pitches The ground-staff seems confident of having a game of “at least four days” and most feel it will not be the raging rank-turner seen in Indore, where the game lasted a little over two days. The excess green in between the two covered wickets did spice things up in the morning session where the visiting Australian media thought something different could well be in store. The bigger confusion for most in the morning was to figure out which pitch was being prepared for the match. The entire square was cordoned off, was not under covers and it was difficult to make out which pitch will be the match pitch. Red soil, black soil. Which soil? #INDvAUS @cricketnext pic.twitter.com/PRhcCEg0dx — Sahil Malhotra (@Sahil_Malhotra1) March 7, 2023 On speaking to the ground-staff and quizzing them on the fresh look of the square, it was brought to our notice that fresh soil has been sourced from Kolkata and two pitches have been re-laid. They will most likely be used from next season onwards. “ Kolkata se mitti mangwaya hai (soil has come from Kolkata) and it has been used for two wickets. Do naya wicket tayyar ho raha hai, aur agle season se istemaal hoga ,” a member of the groundstaff told News18 CricketNext. ‘Don’t know why second pitch was covered’ Unlike the morning session, there was clarity in the afternoon when Rohit & Co trained. The inspection was done of the match pitch only, the one under covers on the left (left of the players’ box/tunnel), and no attention was paid to the covered one on the extreme right. “I don’t know why two strips are covered. I never asked him why he (the curator) covered the other strip. I didn’t see the other one. I just looked at the one we are playing on and it looks okay to me. Whatever the wicket is, it honestly doesn’t matter. There is a lot of talk around the pitches. It is the same for both teams. It is more challenging for the batters at times and more challenging for the bowlers at times. Wickets are like that. Whatever it is, we have to learn to play on them. We have to learn to adjust and we have played on some challenging wickets overseas as well. We played in South Africa recently where the spinners were completely taken out of the game. Everyone is trying to produce wickets which give results,” Dravid said on the pitch during the press conference. Read: After Indore loss, ‘Jeet Nischay’ and ‘Sammaan’ greet India in Ahmedabad As much as the team, captain, coach and management try to downplay the pitch talk, it continues to be the point of interest in the build-up to every fixture of this Border Gavaskar Trophy. And, Ahmedabad has been no different. From a series standpoint, a lot is at stake for both sides and the hosts in particular would be gunning for a win to secure their World Test Championship final berth. Whether this is the ideal pitch to get a result in their favour is something we will find out in a couple of days’ time but all eyeballs will continue to be hooked to the 22 yards. The Indore strip changed drastically from how it was during the practice sessions and while Ahmedabad wears a fresh look, there’s a possibility of it going the drier, if not rank-turner, route. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 07, 2023 22:54:07 IST Tags: Cricket India Vs Australia India Vs Australia 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-07 17:24:07","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Rohit-Sharma-Ahmedabad-pitch-inspection-Ahmedabad-Test-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"\"In UK, the ball swings for long periods of time\"- Ricky Ponting suggests a unique inclusion in India's batting unit for WTC final","link":"https://www.sportskeeda.com/cricket/news-in-uk-ball-swings-long-periods-time-ricky-ponting-suggests-unique-inclusion-india-s-batting-unit-wtc-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Anuj Nitin Prabhu"],"video_url":null,"description":null,"content":"Former Australian captain Ricky Ponting feels Team India need to find a way of playing both Shubman Gill and KL Rahul in their playing XI if they reach the World Test Championship (WTC) final. The high-octane clash is scheduled to be played in June later this year. Rahul was dropped from the team after the first two Tests against Australia and picked Gill for the third Test in Indore. However, Ponting stressed how different the conditions for the WTC final will be compared to those in India and shed light on how good Rahul's record has been in England. KL Rahul already has two Test centuries in England and so Ricky Ponting wants India to play both him and Shubman Gill in those conditions. Here's what he said in the ICC Review: Ricky Ponting also opined that with the weather in England always being a factor, both teams will need to pick their XI based on the conditions. While he agreed that The Oval is one of the best batting pitches in England, Ponting also spoke about how overhead conditions could change the situation. India will confirm their place in the WTC final if they beat Australia in the fourth Test in Ahmedabad, beginning on Thursday, March 9. Poll : 0 votes Quick Links","pubDate":"2023-03-07 16:45:34","image_url":"https://staticc.sportskeeda.com/editor/2023/03/50ace-16781918452651-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL: छक्के-चौके से ही ठोकी फिफ्टी, 42 गेंद में 72 रन, कौन हैं नई ऑरेंज कैप होल्डर","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/wpl-2023-meg-lanning-hits-consecutive-fifty-in-orange-cap-holder-of-the-tournament/articleshow/98483253.cms","keywords":null,"creator":null,"video_url":null,"description":"Mag Lanning WPL: मैग लैनिंग ने वीमेंस प्रीमियर लीग में लगातार दूसरी फिफ्टी ठोक दी है। आरसीबी के बाद यूपी वारियर्स के खिलाफ उनके बल्ले से अर्धशतक निकला। इसी के साथ यह ऑस्ट्रेलियाई ओपनर टूर्नामेंट की ऑरेंज कैप होल्डर भी बन चुकीं हैं।","content":"वीमेंस प्रीमियर लीग (Women's premier league) में ऑस्ट्रेलियाई ओपनर मैग लैनिंग का शानदार फॉर्म जारी है। दिल्ली कैपिटल्स की इस कैप्टन ने टूर्नामेंट में लगातार दूसरी फिफ्टी ठोकी। यूपी वॉरियर्स के खिलाफ उन्होंने ताबड़तोड़ 70 रन बनाए। 42 गेंद की इस पारी में मैग के बल्ले से 10 करारे चौके और 3 जबरदस्त छक्के भी निकले। इसी के साथ ऑरेंज कैप भी हथिया लिया। पहले मैच में आरसीबी के खिलाफ भी उन्होंने जोरदार बैटिंग करते हुए 72 रन बनाए थे। मैग लैनिंग के बूते ही दिल्ली कैपिटल्स ने टॉस गंवाकर पहले बल्लेबाजी करते हुए चार विकेट पर 211 रन का विशाल स्कोर खड़ा किया। यह टूर्नामेंट में दिल्ली का लगातार दूसरा 200+ स्कोर था। जेस जॉनासन (20 गेंदों पर नाबाद 42, तीन चौके, तीन छक्के) और जेमिमा रोड्रिग्स (22 गेंदों पर नाबाद 34, चार चौके) ने 34 गेंदों पर 67 रन की अटूट साझेदारी करके टीम का स्कोर 200 रन के पार पहुंचाया। पावरप्ले में लैनिंग ने रन बनाने का बीड़ा उठाया। उनकी आक्रामक बल्लेबाजी से दिल्ली ने पहले छह ओवरों में 62 रन बनाए। लैनिंग ने पिछले मैच में वारियर्स को जीत दिलाने वाली ग्रेस हैरिस की जगह टीम में शामिल की गई शबनीम इस्माइल पर दो छक्के लगाए और पावरप्ले के अंतिम ओवर में बाएं हाथ की स्पिनर राजेश्वरी गायकवाड़ का स्वागत चार चौकों से किया। लैनिंग और शेफाली वर्मा (14 गेंदों पर 17 रन) ने पहले विकेट के लिए 67 रन जोड़े। मैग लैनिंग ने अनुभवी स्पिनर सोफी एक्लेस्टोन पर छक्का जड़कर 32 गेंदों में अपना अर्धशतक पूरा किया। इसके बाद बारिश के कारण कुछ देर के लिए खेल रुका रहा। एक्लेस्टोन खेल शुरू होने पर मारिजान काप (12 गेंदों पर 16 रन) को दीप्ति शर्मा के हाथों कैच कराया। लैनिंग ने इसी ओवर में लगातार दो चौके जड़े, लेकिन गायकवाड ने अगले ओवर में आर्म बॉल पर उनका मिडिल स्टंप थर्रा दिया। इसके बाद जॉनसन और रोड्रिग्स ने आखिरी चार ओवर में 58 रन जुटाए।","pubDate":"2023-03-07 16:42:42","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jonassen, Lanning star in DC’s comfortable win","link":"http://island.lk/jonassen-lanning-star-in-dcs-comfortable-win/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"A terrific 70 from skipper Meg Lanning and an allround performance from Jess Jonassen helped Delhi Capitals pick up their second straight win in the inaugural WPL on Tuesday (March 7). Lanning’s fireworks at the top of the order and Jonassen’s finish saw Capitals post an imposing 211 on the board. Even though Tahlia McGrath […]","content":"A terrific 70 from skipper Meg Lanning and an allround performance from Jess Jonassen helped Delhi Capitals pick up their second straight win in the inaugural WPL on Tuesday (March 7). Lanning’s fireworks at the top of the order and Jonassen’s finish saw Capitals post an imposing 211 on the board. Even though Tahlia McGrath went one step ahead by smashing an unbeaten 90, a lack of support from the other end saw Warriorz lose comfortably by 42 runs in the end. Brief scores: Delhi Capitals 211/4 in 20 overs (Meg Lanning 70, Jess Jonassen 42*; Shabnim Ismail 1/29) UP Warriorz 169/5 in 20 overs (Tahlia McGrath 90*; Jess Jonassen 3/43) 42 runs Published on By Maris Stella College, Negombo will encounter St. Sylvester’s College, Kandy in the quarter final of the Under 19 Division I Tier ‘B’ tournament today and tomorrow at Negombo. Captained by Kaveen Fernando, Maris Stella were the champions in their group (group ‘Y’), while St. Sylvester’s were the runners up to St. Servatius’ in their group (Z). St. Sylvester’s are led by Malith Kulatunge. Maris Stella (from): Kaveen Fernando (Captain), Shen Adithya (Vice Captain), Navindu Wijesooriya, Sachiru Hansala, Ayesh Perera, Sandew Rathnayaka, Rahumath Deen, Ramith Bandara, Levin Fernando, Randeera de Silva, Nethum Basnayaka, Akalanka Fernando, Mineth Fernando, Hasindu Perera, Anshen De Silva, Ameesha Fernando, Manjua Nayanajith, Shevin Hewavitharana, Binal Fernando, Rayan Punchihewa, Hansala Kulasooriya, Adithya Fernando, Pawan Edirisinghe, Hasthika De Silva, Rasul Fernando, Dilash Fernando, Senura Liyanage. St. Sylvester’s (from): Malith Kulatunge (Captain), Akila Wickramasinghe, Isuru Gunasekara, Khanka Wickramasinghe, Charuka Ayeshan, Sahan Dissanayake, Kavishka Imesh, Chandupa Waduge, Yoshitha Isuranga, Wageesha Hansala, Chamod Dissanayake, Dion Fernando, Pansilu Bandara, Nimesha Silva, Kashyapa Dissanayake, Piyumaka Karunarathna, Chandimal Wijewardana, Arusha Mendis, Sihina Bandara, Sandaruwan Herath, Published on By Chandana Dayananda of Sri Lanka Army clinched the overall title of the Sri Lanka Air Force conducted three-stage cycle race which concluded at Anuradhapura on Saturday. Dayananda clocked 9:43.31 seconds to win the title, while his teammate Avishka Dilnuwan finished second. Their performances were vital for Sri Lanka Army to win the team title as well. Suranga Ranaweera of Dehiwala Mount Lavinia Sports Club was placed third. Air Force won the women’s team championship In the women’s event, which was an 84-kilo metres race, Dinesha Dilrukshi (2:34.46 secs) of Sri Lanka Air Force was the winner. Sudharika Priyadharshani was placed second, while Navy’s Anne Shenali settled for the third position in this one-day event. The three-stage men’s event commenced with a participation of 160 cyclists on March 2 at close proximity to the Air Force headquarters in Colombo. Sri Lanka Air Force conducted the event for the 24th time. Men’s event was conducted in three stages Some 160 participants competed Men’s event was conducted in three stages. in the men’s event Dinesha Dilrukshi of the Air Force was the winner of the women’s race. Published on By With a rain threat looming large, spinners Tharinda Nirmal and Sharon Abhishek did well for Richmond to contain St. Benedict’s to 175 runs on day one of the Under 19 Division I Tier ‘A’ two-day tournament quarter-final cricket encounter at Dombagoda on Monday. Points awarded for wickets and runs come into decide the team advancing to the next stage when rain prevent decisions of knockout stage matches. Richmond showed that they were eager to avoid disappointments of rain by restricting their opponents to 175 runs. Only 73 overs were possible on day one but Richmond were ahead of their rivals according to points as they restricted the Bens to 175 runs. Deciding to bat first St. Benedict’s lost four wickets for 43 runs before Sharujan Shanmuganathan dropped anchor with a determined knock of 70 runs. He scored just three fours during his 152-ball stay. Skipper Chamath Chathurya with a valuable knock of 38 runs (104 balls) and Arshan Joseph with an unbeaten 19 were the only other batsmen to resist. Nirmal was the pick of the bowlers for Richmond as he bowled the buck of overs with Abhishek. Both spinners bowled 21 overs each and shared seven wickets between them to keep alive their chances of advancing to the semi-finals of the tournament. They will now be aiming to take the first innings advantage today. The winners of this match will encounter the winners of the quarter-final between St. Joseph’s and Wesley. In the top half of the tournament, Trinity are scheduled to meet Royal, while Maliyadeva encounter St. Sebastian’s, Moratuwa.","pubDate":"2023-03-07 20:07:54","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Michael Vaughan's legal team describe ECB racism investigation as \"wholly inadequate\"","link":"https://www.mirror.co.uk/sport/cricket/michael-vaughan-ecb-yorkshire-rafiq-29398111","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Dean Wilson)"],"video_url":null,"description":"Michael Vaughan's legal team gave closing submissions on Tuesday at the Cricket Discipline Commission hearing and took aim at the ECB, but the national governing body hit back","content":"Michael Vaughan and his legal team have slammed the ECB , describing their racism investigation case as “wholly inadequate” and biased. Vaughan is charged with bringing the game into disrepute by saying to Azeem Rafiq , Adil Rashid , Rana Naved-ul-Hasan and Ajmal Shahzad “there’s too many of you lot, we need to have a word about that” prior to a Twenty20 match against Nottinghamshire in June 2009. Vaughan categorically denies the allegation, and the closing submissions from Christopher Stoner KC on behalf of the former England captain took a swipe at the way the ECB had handled the entire case, branding it unfair and claiming it denied their client “due process.” Michael Vaughan says it's \"inconceivable\" he made alleged racist comment to team-mates Michael Vaughan blasts cricket racism hearing as a \"terrible look for the game\" The ECB’s legal lead, Jane Mulcahy KC, hit back at those claims, describing them as “inappropriate to be alleged”. On the final day of the Cricket Discipline Commission hearing, both sides traded blows with compelling descriptions of the evidence heard over the previous four days. But what Vaughan described in his evidence as a “terrible look for the game”, after he and former team-mate Rafiq had fought it out in public, became an argument between an Ashes -winning captain and his former employers and governing body over accusations both parties had not being sufficiently thorough in their collection of evidence. And Stoner pulled no punches when he said: “We say this investigation was wholly inadequate. In reality there was no investigation, and we are concerned by the bias shown by the ECB. Michael Vaughan and his legal team slammed the ECB in closing submissions ( Image: AP) “Due process matters and it is the cornerstone of our law. It was sent on holiday by the ECB in this investigation. That brings a question of fairness. This was a prosecution from the outset.” Mulcahy KC was just as robust in her summation of the ECB’s case beforehand when she focused once more on the historic tweets sent by Vaughan between 2010 and 2017, for which he has already apologised and agreed were “completely unacceptable.” Mulcahy said: “The tweets are central to this case and it makes no difference that they were sent in a non-cricketing context. We say if a person has a tendency to make racist comments, they have a tendency to make racist comments.” The final cases against the non-participating Andrew Gale and Richard Pyrah were also heard before the panel retired to deliberate on a verdict that is expected at the end of the month. Panel chair Tim O’Gorman said: “These are serious matters, and the panel will give them due consideration.” Read More 4 questions England must answer ahead of World Cup defence including Ben Stokes' future Read More Shakib Al Hasan stars as England slump to ODI defeat against Bangladesh Read More Ashes tipped to be best series since 2005 with Bazball making Australia 'take notice' Read More England quick Mark Wood admits he \"might not play any\" Ashes Tests this summer Read More Shane Warne's family pay moving tribute to Australian icon a year on from tragic death","pubDate":"2023-03-07 19:45:57","image_url":"https://i2-prod.mirror.co.uk/incoming/article29398410.ece/ALTERNATES/s615/0_lkw102-0_252.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Five reasons why: Sri Lanka clash isn’t a big comedown","link":"https://www.nzherald.co.nz/sport/five-reasons-why-sri-lanka-clash-isnt-a-big-comedown/AINJ45BN5VFATG4MMRVHFWVXWY/","keywords":null,"creator":null,"video_url":null,"description":"Why the Sri Lanka series could be just as good as the recent England visit.","content":"The Black Caps’ two-test series with Sri Lanka starts tomorrow and Kris Shannon looks at why it could be just as good as the recent England visit. 1. Maybe they’ll win by one run again? In another world, one in which the international cricketing calendar was equitable and not designed to make the rich richer, we could be in the middle of the deciding third test between the Black Caps and England. We are not. We are in this world, filled with misery and suffering and yet another two-test series starting on Thursday, this time against Sri Lanka. This series may feel like a huge comedown after the blockbuster clash with England in general, and the madness of that final day at the Basin Reserve in particular. But I am pleased to report that is far from true, for an abundance of reasons (well, five). To start: what if there’s another test decided by one run? The haters will say that it’s impossible; that it’s one of the rarest occurrences in sport, last week being the second such occasion in almost 150 years of test cricket. But what if it does? Wouldn’t that be amazing? Winning one test by a solitary run isn’t cool. You know what’s cool? Winning *two* tests by a solitary run. In a row. Which could definitely happen. You can’t rule it out. You can’t tell me summer has peaked, that we just witnessed the best test the Black Caps will play in my lifetime, rendering each subsequent match a little less enjoyable and creating inside me a yearning void that will never be sated. You can’t. Advertisement Advertise with NZME. 2. Maybe there’ll be more Bazball? What will soon be regarded as the Black Caps’ second-best home test series this summer confirmed one notion: Brendon McCullum’s whole deal is real. England’s winning streak was ended but their streak of compelling test matches survived, with even the first-test thrashing at Bay Oval featuring captivating cricket and ample opportunities for the opposition to avoid said thrashing. England, it seems, aren’t all talk. They really will persist with this risky style of play, no matter whether a safer strategy would have almost certainly won the series. That was clear in not just Ben Stokes’ bucking recent trends by enforcing the follow-on. It was clear in how England continually sought to curtail their own innings rather than bat the opposition - and potentially themselves - out of a positive result. And it was clear after the one-run defeat in Wellington. McCullum had stressed his side primarily wanted to entertain and, having played their part in the ultimate show, there was no hint of disappointment among the touring players. So, yeah. Maybe Sri Lanka will do that? Idk 3. Exciting squad experimentation Advertisement Advertise with NZME. England weren’t alone — the home side also played engaging cricket the last couple of weeks. Now they must do likewise to ensure the Sri Lanka series isn’t seen as a huge comedown, which, again, it is not. Thankfully, they have just the men for the job…the exact same men who did the job against England. It wouldn’t have made sense, would it, to try to replicate last month’s excitement with any changes in personnel? Now’s not the time to get crazy, to select a single new player, to add some spark into a proudly settled team who boast one victory in eight. Who wants to see whether Glenn Phillips, this country’s most thrilling batsman, can translate his talent to test cricket and back up the debut half-century he scored against Australia more than three years ago, only to never be selected again? Not me, no thanks. And why would anyone want a look at Ish Sodhi in New Zealand conditions following his player-of-the-series performance in Pakistan? Michael Bracewell did a perfectly mediocre job as the sole spinner against England. Now’s the time to stay the course. There’s no room for experimentation. Not when these tests matter. 4. These tests matter Look, it says it right there in the header, why bore anyone for 135 words explaining the reason these tests matter. That’s not what this column is about: picking a topic by throwing darts at a newspaper before scratching together some flimsy supporting evidence. This column trusts readers don’t need their hand held; they’re clever enough to reach their own conclusions. But if I’m wrong about that, if I have too much faith in anyone foolish enough to still be reading, then here’s a brief case. These tests matter because New Zealand haven’t won a test series since June 2021. They matter because playing a Sri Lanka side a couple of places below them in the world rankings represents a golden chance to end that barren run. They matter because [Eds note: cut for space]. 5. Absence makes the heart whatever Thought of another one. These tests matter because of scarcity. They’re the last tests the Black Caps will play until a two-match series in Bangladesh after the ODI World Cup. Some foolish folk will use that fact to argue these tests don’t matter, that the steady diet of short-form cricket to follow is all that counts in a World Cup year.But wise observers will have a succinct retort: No. You’re wrong. Stop saying that these tests feel totally irrelevant after those wondrous five days in Wellington, that this series will be a huge comedown. And please stop pestering New Zealand Cricket about when that match will be made available as an NFT. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2023-03-07 19:27:59","image_url":"https://www.nzherald.co.nz/resizer/OmEBAQk7VBKhI6INezuAPBJ9ULk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VMQC5BUHLVAFTAKUEHI47MRE2A.JPG","source_id":"nzherald","category":["sports"],"country":["new zealand"],"language":"english"},{"title":"New Zealand stands in way of Sri Lanka’s World Test final quest","link":"https://www.dailymirror.lk/cricket/New-Zealand-stands-in-way-of-Sri-Lanka’s-World-Test-final-quest/315-255423","keywords":null,"creator":null,"video_url":null,"description":"Despite having an eye on the bigger picture of qualification for the final of the World Championship later this year, Sri Lanka Test captain Dimuth Karunaratne said that his team’s focus, for now at least, was the first Test against New Zealand that starts at the Hagley Oval in Christchurch on Thursday.","content":"Despite having an eye on the bigger picture of qualification for the final of the World Championship later this year, Sri Lanka Test captain Dimuth Karunaratne said that his team’s focus, for now at least, was the first Test against New Zealand that starts at the Hagley Oval in Christchurch on Thursday. A 2-0 series whitewash of New Zealand could put Sri Lanka into the final, although it also depends on India not winning their final Test against Australia. “Before we even think about two Test matches we need to think about the first Test, and how we can win that. That's been the conversation. As a team, we are well aware of that,” Karunaratne said on Tuesday. It will not be an easy task either, given that Sri Lanka have previously won only two Tests in New Zealand, but Karunaratne believes that playing in March, as opposed to December when Sri Lanka’s Tests in New Zealand are usually scheduled, could bring their spinners into contention. “We usually tour New Zealand in December, but this time since we are touring in March it is quite hot and I think the pitches will dry quickly and offer support to spinners. In the New Zealand versus England series, the spinners were among the wickets. So we are leaning towards playing a frontline spinner in addition to Dhananjaya de Silva,” Karunaratne added. That will likely see Prabath Jayasuriya, the left-arm spinner who had an incredible start to his Test career with 29 wickets in three matches, feature alongside three front-line fast-bowlers. One department that virtually picks itself is the batting, with Karunaratne backing the batsmen that featured in Sri Lanka’s last Test against Pakistan. “Right now, our top order is stable. Everyone has been among the runs and have cemented their places,” Karunaratne said, adding that this would mean top order batsman Nishan Madushka is unlikely to be given a Test debut, atleast for the first Test. “Nishan is an up and coming player who has been among the runs, and consistently too. We would like to give him a chance, but when you look at the team, all the batters have shown their skill, and unluckily he won't get a chance for the first Test,” Karunaratne said. One way into the team for Madushka however, by Karunaratne’s own admission, is if specialist wicket-keeper Niroshan Dickwella fails to produce with the bat. “We look at Dickwella as a specialist wicket-keeper, and when you compare him to the other options we have in that role, he is by far the best. Even when Kumar Sangakkara was in the team, the wicket-keeping role was given to Prasanna Jayawardena, and even though other players who could keep wickets came into the team, Prasanna was always given that role,” he said. “We need a specialist keeper in Test cricket, more so than T20I and ODI cricket. Dickwella has not played a big innings yet, but when you see how he has batted with the tail end at times, he has made some important contributions. We are going with Dickwella, but we have put that pressure on him, especially since Nishan can also keep, and if Dicwkella doesn't perform maybe that could be an opening for him.” Meanwhile, New Zealand will take momentum from their dramatic one-run win over England last week, a result that put them in rare company. Tim Southee's hosts became just the fourth team to win a Test after following on as they secured a draw in the two-match series against England. Kane Williamson, who became New Zealand's record run-scorer in the thrilling Wellington win, said it was vital to kick on after the Black Caps ended a seven-Test winless run. \"It's been a long time for us to get over the line,\" former skipper Williamson said ahead of the first Test against Sri Lanka starting on Thursday in Christchurch. \"We haven't had the results we would've liked, despite putting the work in, so it's nice to get those rewards. \"It's an important series for us now as we are looking to improve and we're focused in trying to put out better performances.\" Sri Lanka's preparations have been disrupted by rain, with the second day of their only warm-up match against a New Zealand Board XI washed out on Sunday in Lincoln, just outside Christchurch. Sri Lanka will also play three one-day internationals and three Twenty20s against New Zealand after the Tests. New Zealand (from): Tim Southee (capt), Tom Blundell, Michael Bracewell, Devon Conway, Matt Henry, Tom Latham, Daryl Mitchell, Blair Tickner, Neil Wagner, Scott Kuggeleijn, Henry Nicholls, Kane Williamson, Will Young Sri Lanka (from): Dimuth Karunaratne (capt), Oshada Fernando, Kusal Mendis, Angelo Mathews, Dhananjaya de Silva, Dinesh Chandimal, Kamindu Mendis, Niroshan Dickwella, Nishan Madushka, Ramesh Mendis, Prabath Jayasuriya, Chamika Karunaratne, Kasun Rajitha, Lahiru Kumara, Asitha Fernando, Vishwa Fernando, Milan Rathnayake","pubDate":"2023-03-07 18:37:00","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_6219fb68c3.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Proteas ring changes for second Test cricket match against West Indies","link":"https://www.dailymaverick.co.za/article/2023-03-07-proteas-ring-changes-for-second-test-cricket-match-against-west-indies/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Proteas coach Shukri Conrad has made four changes to the side that beat West Indies by 87 runs in the first Test. The post Proteas ring changes for second Test cricket match against West Indies appeared first on Daily Maverick.","content":"Shukri Conrad has not been afraid of making bold decisions since taking the reigns as head coach of South Africa’s Test team. He has continued that approach in only his second match in charge. First, by deviating from the norm and announcing the playing 11 a day early for the Proteas’ second Test match against West Indies. Second, by ringing four changes to his side and subsequently allowing every player in the squad a run in the two-match series. “I don’t set out to do things in a brave way. I’d like to think I am a guy who thinks things through carefully, but I’m always going to look to take the road less travelled, and that’s where I’d like this side to go,” Conrad told the media on Tuesday. The four changes include Ryan Rickelton, Wiaan Mulder, Simon Harmer and Keshav Maharaj coming in for Keegan Petersen, Senuran Muthusamy, Marco Jansen and Anrich Nortje. Nortje was the only enforced change — ruled out due to a stiff groin. “We all know that Anna [Nortje] has been ruled out. Marco [Jansen] deserves a little bit of a break,” said Conrad. “That lanky body of his has been through the mill the last couple of months and we also need to look after what lies ahead for these guys in the next couple of months.” Temba Bavuma of the Proteas during day two of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 1 March 2023 in Centurion, South Africa. (Photo: Lee Warren / Gallo Images) Visit Daily Maverick’s home page for more news, analysis and investigations Rickelton is a straight swap for Petersen in the No. 5 batting position. “This is not just changing the side for the sake of changing the side,” said Conrad. “Everybody’s got a crack, but the one oke that probably deserves a crack more than anyone [Ryan Rickelton] hasn’t had one yet. It was a simple choice, that.” But Conrad assured that Petersen is still part of his long-term planning in the batting department. “We went with Keegan in the first Test because he was the incumbent. Him being left out is not on the back of two non-scoring performances,” said the coach. “I still think [Petersen’s] best position might be [number] five going forward, in terms of the way he plays… I feel Keegan’s got a bigger role to play in the middle order rather than the top-order. “Rickelton deserves his crack at it too. As everybody knows, he’s been churning out [the runs domestically],” added Conrad. Consistent and big runs have been a rarity for the Proteas in the last couple of years. However, Conrad is confident that they will soon find the winning formula. “This Test batting unit is still a work in progress. But hopefully by design and not stumbling onto something, we’re going to get the right mix.” Kagiso Rabada of South Africa during day three of the 1st Betway Test match between South Africa and West Indies at SuperSport Park on 2 March 2023 in Centurion, South Africa. (Photo: Sydney Seshibedi / Gallo Images) The Test match will take place at the Wanderers in Johannesburg, which is traditionally known as fast-bowling paradise. But Conrad has elected to only go with two fast bowling options in Kagiso Rabada and Gerald Coetzee – who made his debut in the previous Test – as well as Mulder’s medium pace. Conrad has also opted for two frontline spinners in Harmer and Maharaj. “History would suggest, in the last year, that the spinners do come into the game here,” he said. “The game doesn’t have to end on day three. Test matches are meant to go to day five, and if it goes to days four and five, our spinners will come into it in a big way. The first ball of the Test match between South Africa and West Indies will be bowled at 10am on Wednesday. DM Dean Elgar, Aiden Markram, Tony de Zorzi, Temba Bavuma (captain), Ryan Rickelton, Heinrich Klaasen, Wiaan Mulder, Simon Harmer, Keshav Maharaj, Gerald Coetzee, Kagiso Rabada","pubDate":"2023-03-07 18:12:37","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs","link":"https://www.firstpost.com/firstcricket/sports-news/dc-vs-upw-highlights-wpl-2023-match-5-at-dy-patil-stadium-delhi-hammer-up-by-42-runs-12256602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs","content":"Cricket DC vs UPW Highlights, WPL 2023 Match 5 at DY Patil Stadium: Delhi hammer UP by 42 runs DC vs UPW WPL 2023 Highlights: Follow DC vs UPW live score, ball by ball commentary, scorecard and latest updates from WPL 2023 live match at Firstpost FirstCricket Staff March 7th, 2023 23:12:13 IST Meg Lanning and Alyssa Healy, captain of Delhi Capitals and UP Warriorz respectively, at toss in Match 5 of WPL 2023. Sportzpics FP commentary Quick Scorecard Full scorecard Ball by ball commentary Delhi Capitals Vs UP Warriorz At Dr. DY Patil Sports Academy, Navi Mumbai, 07 March, 2023 07 March, 2023 Starts 19:30 (IST) Match Ended Delhi Capitals 211/4 (20.0 ov) Match 5 UP Warriorz 169/5 (20.0 ov) Delhi Capitals beat UP Warriorz by 42 runs Toss: UP Warriorz won the toss and chose to field in Match 5 of the inaugural Women’s Premier League at the DY Patil Stadium in Navi Mumbai on Tuesday. The Warriorz made a big call in their second outing of the tournament — that of benching Grace Harris, who masterminded a come-from-behind victory over Gujarat Giants on Sunday in their opening game. Harris, who struck an unbeaten 59 that setup a thrilling three-wicket win, was left out in favour of South African speedster Shabnim Ismail, whose inclusion was apparently inspired by the conditions, especially the tinge of green on the DY Patil surface. Delhi Capitals skipper Meg Lanning, meanwhile, announced an unchanged XI for the clash. Much like UP, Delhi too began their campaign with a victory though theirs was by a comfortable 60-run over Royal Challengers Bangalore. Openers Lanning and Shafali Verma had stitched an opening stand worth 162 after RCB opted to field, with Marizanne Kapp and Jemimah Rodrigues taking over once both departed within a few deliveries of one another. Kapp and Rodrigues shared an unbroken 60-run stand as Delhi posted a mammoth 223/2 on the board. American seamer Tara Norris would then record the first five-for of the tournament as her haul of 5/29 would ensure Bangalore were never in the hunt in the first place. Delhi Capitals : Meg Lanning (c), Shafali Verma, Marizanne Kapp, Jemimah Rodrigues, Alice Capsey, Jess Jonassen, Taniya Bhatia (wk), Arundhati Reddy, Shikha Pandey, Radha Yadav, Tara Norris UP Warriorz : Alyssa Healy (wk/c), Shweta Sehrawat, Kiran Navgire, Tahlia McGrath, Deepti Sharma, Simran Shaikh, Devika Vaidya, Sophie Ecclestone, Shabnim Ismail, Anjali Sarvani, Rajeshwari Gayakwad Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 07, 2023 23:12:13 IST Tags: Cricket Delhi Capitals Up Warriorz Wpl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-07 17:42:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Meg-Lanning-Alyssa-Healy-DC-UPW-WPL-2023-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"India head coach Rahul Dravid plays down pitch talk ahead of 4th Test against Australia","link":"https://thenewsmill.com/2023/03/india-head-coach-rahul-dravid-plays-down-pitch-talk-ahead-of-4th-test-against-australia/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"India head coach Rahul Dravid delved briefly into the talk around the pitch ahead of the fourth Test against Australia in Ahmedabad and said that they need to be realistic about batting in these challenging conditions. The fourth Test begins on Thursday in Ahmedabad with India aiming to book their place in the WTC final with a win. Dravid said that challenging wickets were a “part of the game” with the talk around pitches raging after the Indore pitch for the third Test received a “poor” rating from International Cricket Council (ICC). The home team’s head coach also played down talks around India’s batters struggling, maintaining that expectations have to be “realistic”. “We have played on some challenging wickets when we go overseas also,” Dravid said in the pre-match press conference. “[We] played in South Africa recently where spinners were completely taken out of the game. And everyone wants to produce wickets where eventually one wants results. You will probably prepare wickets where the ball holds a bit more sway over the bat and that’s necessary and part of the game,” he added. With the top order struggling, India’s lower middle order has been responsible for the majority of runs in the series, but Dravid didn’t seem bothered by this. “You need to be realistic as to what is a good performance on these challenging wickets,” Dravid said. “So, you need to be realistic what the benchmarks are now, what standards are on these kinds of surfaces just one good performance can change the game. It might not be a double hundred but a 50-60 or 70 somewhere, but could actually be a very, very good score in some conditions,” he added. India are 2-1 ahead in the series, but Australia’s stunning win in Indore in the previous Test saw them qualify for the ICC World Test Championship final and also proved that they could not only test, but also beat, India in these conditions.(ANI)","pubDate":"2023-03-07 17:31:23","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs Australia: Ahmedabad pitch and that Rohit Sharma look","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-ahmedabad-pitch-and-that-rohit-sharma-look-12257082.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"India vs Australia: Ahmedabad pitch and that Rohit Sharma look","content":"Cricket India vs Australia: Ahmedabad pitch and that Rohit Sharma look After inspecting the pitch, Rohit Sharma threw his hands up in an animated fashion, he inspected the strip from different angles, did some shadow batting too and was constantly in the ground staff’s ears. Sahil Malhotra March 7th, 2023 22:54:07 IST Indian skipper Rohit Sharma assessing the pitch on Tuesday morning. Image credit: Sahil Malhotra Before the Indian players started with their warm-up drills, Rohit Sharma made the long walk down the dressing room via a very long tunnel and headed towards the square where two pitches were under the covers. He ignored the one on the far right and instructed the ground staff to remove covers off the one he was standing close to. The captain seemed far away from the boundary rope, where your’s truly stood, but a borrowed binocular helped in seeing Rohit’s first reaction to the 22 yards. And, it didn’t seem a pleasant one. The 35-year-old had his both hands up in animated fashion, as if suggesting to the curator and ground staff, “ye kya hai (what is this)”. Again, not an analysis of a lip-reading expert but some observations after seeing the skipper’s reaction. He inspected the strip from different angles, did some shadow batting too and was constantly in the ground staff’s ears. Read: What Ahmedabad has in store for PM Modi, Anthony Albanese Rohit was alone to start the inspection but soon had the company of coach Rahul Dravid, batting coach Vikram Rathour and bowling coach Paras Mhambrey. The think tank paced up and down the surface and continued to chat with the ground staff. Rohit and Rahul did have a mini-discussion of sorts away from the group for a brief period before the former exited the scene and commenced his warm-up. The right-hander did check the firmness of the strip on multiple occasions, from multiple spots, and it could well be the reason for his response. In comparison to Nagpur, Delhi and Indore, this looked the freshest of the lot and gave no impressions of a dry rank-turner. Not to forget there was a lot of unexpected rain last evening. Morning session look of the square at the Narendra Modi Stadium in Ahmedabad. Image credit: Sahil Malhotra Cheteshwar Pujara and Kuldeep Yadav were the next pair to reach the square and the former went down on his knees to get a close feel of the surface. He pressed his fingers on the strip from different positions and seemed keen on ascertaining how hard or soft it was. When all this was going on, Rahul used a new SG ball to do a bounce test near what seemed like the popping crease area. The bounce test didn’t return positive but a fresh bout of sunlight and some rolling will help iron out flaws, if any, on that front. Soil sourced from Kolkata for two pitches The ground-staff seems confident of having a game of “at least four days” and most feel it will not be the raging rank-turner seen in Indore, where the game lasted a little over two days. The excess green in between the two covered wickets did spice things up in the morning session where the visiting Australian media thought something different could well be in store. The bigger confusion for most in the morning was to figure out which pitch was being prepared for the match. The entire square was cordoned off, was not under covers and it was difficult to make out which pitch will be the match pitch. Red soil, black soil. Which soil? #INDvAUS @cricketnext pic.twitter.com/PRhcCEg0dx — Sahil Malhotra (@Sahil_Malhotra1) March 7, 2023 On speaking to the ground-staff and quizzing them on the fresh look of the square, it was brought to our notice that fresh soil has been sourced from Kolkata and two pitches have been re-laid. They will most likely be used from next season onwards. “ Kolkata se mitti mangwaya hai (soil has come from Kolkata) and it has been used for two wickets. Do naya wicket tayyar ho raha hai, aur agle season se istemaal hoga ,” a member of the groundstaff told News18 CricketNext. ‘Don’t know why second pitch was covered’ Unlike the morning session, there was clarity in the afternoon when Rohit & Co trained. The inspection was done of the match pitch only, the one under covers on the left (left of the players’ box/tunnel), and no attention was paid to the covered one on the extreme right. “I don’t know why two strips are covered. I never asked him why he (the curator) covered the other strip. I didn’t see the other one. I just looked at the one we are playing on and it looks okay to me. Whatever the wicket is, it honestly doesn’t matter. There is a lot of talk around the pitches. It is the same for both teams. It is more challenging for the batters at times and more challenging for the bowlers at times. Wickets are like that. Whatever it is, we have to learn to play on them. We have to learn to adjust and we have played on some challenging wickets overseas as well. We played in South Africa recently where the spinners were completely taken out of the game. Everyone is trying to produce wickets which give results,” Dravid said on the pitch during the press conference. Read: After Indore loss, ‘Jeet Nischay’ and ‘Sammaan’ greet India in Ahmedabad As much as the team, captain, coach and management try to downplay the pitch talk, it continues to be the point of interest in the build-up to every fixture of this Border Gavaskar Trophy. And, Ahmedabad has been no different. From a series standpoint, a lot is at stake for both sides and the hosts in particular would be gunning for a win to secure their World Test Championship final berth. Whether this is the ideal pitch to get a result in their favour is something we will find out in a couple of days’ time but all eyeballs will continue to be hooked to the 22 yards. The Indore strip changed drastically from how it was during the practice sessions and while Ahmedabad wears a fresh look, there’s a possibility of it going the drier, if not rank-turner, route. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 07, 2023 22:54:07 IST Tags: Cricket India Vs Australia India Vs Australia 2023 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-07 17:24:07","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Rohit-Sharma-Ahmedabad-pitch-inspection-Ahmedabad-Test-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"\"In UK, the ball swings for long periods of time\"- Ricky Ponting suggests a unique inclusion in India's batting unit for WTC final","link":"https://www.sportskeeda.com/cricket/news-in-uk-ball-swings-long-periods-time-ricky-ponting-suggests-unique-inclusion-india-s-batting-unit-wtc-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Anuj Nitin Prabhu"],"video_url":null,"description":null,"content":"Former Australian captain Ricky Ponting feels Team India need to find a way of playing both Shubman Gill and KL Rahul in their playing XI if they reach the World Test Championship (WTC) final. The high-octane clash is scheduled to be played in June later this year. Rahul was dropped from the team after the first two Tests against Australia and picked Gill for the third Test in Indore. However, Ponting stressed how different the conditions for the WTC final will be compared to those in India and shed light on how good Rahul's record has been in England. KL Rahul already has two Test centuries in England and so Ricky Ponting wants India to play both him and Shubman Gill in those conditions. Here's what he said in the ICC Review: Ricky Ponting also opined that with the weather in England always being a factor, both teams will need to pick their XI based on the conditions. While he agreed that The Oval is one of the best batting pitches in England, Ponting also spoke about how overhead conditions could change the situation. India will confirm their place in the WTC final if they beat Australia in the fourth Test in Ahmedabad, beginning on Thursday, March 9. Poll : 0 votes Quick Links","pubDate":"2023-03-07 16:45:34","image_url":"https://staticc.sportskeeda.com/editor/2023/03/50ace-16781918452651-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL: छक्के-चौके से ही ठोकी फिफ्टी, 42 गेंद में 72 रन, कौन हैं नई ऑरेंज कैप होल्डर","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/wpl-2023-meg-lanning-hits-consecutive-fifty-in-orange-cap-holder-of-the-tournament/articleshow/98483253.cms","keywords":null,"creator":null,"video_url":null,"description":"Mag Lanning WPL: मैग लैनिंग ने वीमेंस प्रीमियर लीग में लगातार दूसरी फिफ्टी ठोक दी है। आरसीबी के बाद यूपी वारियर्स के खिलाफ उनके बल्ले से अर्धशतक निकला। इसी के साथ यह ऑस्ट्रेलियाई ओपनर टूर्नामेंट की ऑरेंज कैप होल्डर भी बन चुकीं हैं।","content":"वीमेंस प्रीमियर लीग (Women's premier league) में ऑस्ट्रेलियाई ओपनर मैग लैनिंग का शानदार फॉर्म जारी है। दिल्ली कैपिटल्स की इस कैप्टन ने टूर्नामेंट में लगातार दूसरी फिफ्टी ठोकी। यूपी वॉरियर्स के खिलाफ उन्होंने ताबड़तोड़ 70 रन बनाए। 42 गेंद की इस पारी में मैग के बल्ले से 10 करारे चौके और 3 जबरदस्त छक्के भी निकले। इसी के साथ ऑरेंज कैप भी हथिया लिया। पहले मैच में आरसीबी के खिलाफ भी उन्होंने जोरदार बैटिंग करते हुए 72 रन बनाए थे। मैग लैनिंग के बूते ही दिल्ली कैपिटल्स ने टॉस गंवाकर पहले बल्लेबाजी करते हुए चार विकेट पर 211 रन का विशाल स्कोर खड़ा किया। यह टूर्नामेंट में दिल्ली का लगातार दूसरा 200+ स्कोर था। जेस जॉनासन (20 गेंदों पर नाबाद 42, तीन चौके, तीन छक्के) और जेमिमा रोड्रिग्स (22 गेंदों पर नाबाद 34, चार चौके) ने 34 गेंदों पर 67 रन की अटूट साझेदारी करके टीम का स्कोर 200 रन के पार पहुंचाया। पावरप्ले में लैनिंग ने रन बनाने का बीड़ा उठाया। उनकी आक्रामक बल्लेबाजी से दिल्ली ने पहले छह ओवरों में 62 रन बनाए। लैनिंग ने पिछले मैच में वारियर्स को जीत दिलाने वाली ग्रेस हैरिस की जगह टीम में शामिल की गई शबनीम इस्माइल पर दो छक्के लगाए और पावरप्ले के अंतिम ओवर में बाएं हाथ की स्पिनर राजेश्वरी गायकवाड़ का स्वागत चार चौकों से किया। लैनिंग और शेफाली वर्मा (14 गेंदों पर 17 रन) ने पहले विकेट के लिए 67 रन जोड़े। मैग लैनिंग ने अनुभवी स्पिनर सोफी एक्लेस्टोन पर छक्का जड़कर 32 गेंदों में अपना अर्धशतक पूरा किया। इसके बाद बारिश के कारण कुछ देर के लिए खेल रुका रहा। एक्लेस्टोन खेल शुरू होने पर मारिजान काप (12 गेंदों पर 16 रन) को दीप्ति शर्मा के हाथों कैच कराया। लैनिंग ने इसी ओवर में लगातार दो चौके जड़े, लेकिन गायकवाड ने अगले ओवर में आर्म बॉल पर उनका मिडिल स्टंप थर्रा दिया। इसके बाद जॉनसन और रोड्रिग्स ने आखिरी चार ओवर में 58 रन जुटाए।","pubDate":"2023-03-07 16:42:42","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}