{"newsArray":[{"title":"Bismah confident will perform well in tri-series, CW Games","link":"https://www.thenews.com.pk/print/972853-bismah-confident-will-perform-well-in-tri-series-cw-games","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Rain-marred Pakistan women’s national cricket team’s training camp concluded in Islamabad/Rawalpindi with captain Bismah Maroof confident of taking the tri-series in Ireland as a preparation event for the Birmingham Commonwealth Games.The Bismah Maroof-led team will fly out...","content":null,"pubDate":"2022-07-10 00:59:38","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Nowhere to hide: The continuing failures of Virat Kohli could spell the beginning of the end for India’s most successful Test captain ever","link":"https://www.tribuneindia.com/news/sports/nowhere-to-hide-the-continuing-failures-of-virat-kohli-could-spell-the-beginning-of-the-end-for-indias-most-successful-test-captain-ever-410986","keywords":null,"creator":null,"video_url":null,"description":"Rohit Mahajan VIRAT KOHLI angry and animated in the Test match against England, sometimes seemed lost and distant as well. In January, in the ODIs against South Africa, Kohli seemed noticeably uninvolved with the game, and experts such as Sunil Gavaskar and Vernon Philander noted that captain KL Rahul seemed out of ideas and the Indian players were waiting for things to happen. Kohli, formerly capable of injecting the team with high-intensity currents, seemed lost at times. Was Kohli's mind weighed down by worry or despair or anger? If world No. 2 Test bowler Ashwin can be dropped from Test side then your No. 1 batter (Kohli) can also be dropped. I hope Kohli scores runs... At the moment, Virat Kohli isn't playing like the Kohli we know, the one that has made him a legend through his performances. Kapil Dev, former Captain Kohli had given up Test captaincy immediately before the ODI series; he had no option other than to quit since he had put himself in a spot by contradicting BCCI president Sourav Ganguly publicly: He had practically called Ganguly a liar by giving the lie to Ganguly's claim that he had 'personally requested' Kohli to not give up the T20I team captaincy. The former skipper hasn't made a 100 in 76 international innings since 2019. - File photo As captain, Kohli's place in the Test team was a certainty; but after he gave up captaincy, he needed to again start scoring heavily to stay in the team. He's in trouble on that count — in his last 32 innings across 18 Tests, Kohli has made only 872 runs at an average of 27.25, with four half-centuries. The average in home Tests in this duration is only 26.27. These are poor numbers by any standard, let alone Kohli's own high standards — his pre-slump career average, before November 2019, was 54.97. It has come down to 49.53 now. Indecision? Kohli has often looked good, but he's also often looked indecisive — how much far to commit with the front foot, how far wide to go to attack the widish ball, for instance. His dismissal in the first innings in the rescheduled fifth Test in Birmingham showed his indecision — he was uncertain whether to play a shot and withdrew the bat late and played onto his stumps. He's had some bad luck, too, as in both innings of the Bengaluru Test against Sri Lanka in March, twice lbw to balls that shot through low. But the upshot is that he's low on scores; he's not known to be ever low on confidence, but perhaps, as is often the case, his customary brashness and aggression are a cover for insecurity. How would he deal with the low returns in international cricket? With the unforgiving BCCI keeping a close look at his performances, and with several young players coming through, Kohli is under the cosh. He acted his part while fielding during in the Birmingham Test, with gamesmanship and crazy celebrations and sledging of the English batsmen; but when you're not scoring runs, such antics seem hollow and contrived — for everyone knows that it's a very thin thread that holds the sword over your head, and the thread can snap any time. Time, of course, is running out for Kohli. He turns 34 in November, and very often this is the age when a batsman's career takes a decisive turn for the worse — the body is ravaged, the mind is fatigued, the reflexes are slow and the motivation begins to flag. However, Kohli's mind is steely, and he can turn things around and return to days of heavy scoring. In Ganguly himself, he has a great example — captain once, thrown out of the team soon after, Ganguly, with bloody-minded determination, returned to the Indian team after an 11-month hiatus and played 25 more Tests. After his return, he averaged 46.30, much better than the 40.78 he averaged before being dropped — a remarkable achievement. Can Kohli do what Ganguly did? Miracle workers Novak Djokovic is likely to win his 21st Grand Slam title tonight at Wimbledon, to move one past Roger Federer and one behind Rafael Nadal. The other day, Nadal played through pain and won a magnificent victory in the quarterfinals — but he suffered a 7mm abdominal muscle tear and had to withdraw from the semifinals. If Bjorn Borg had been a bit more bothered about winning big tournaments, he wouldn't have retired at age 26; and, to be sure, though he retired at 26 in 1983, he was actually done with tennis at only 24 in 1981 — he played only five matches in 1982-1983. If he'd been more keen about winning Grand Slams, surely Borg would have travelled for the Australian Open more than just once, that too as a 17-year-old. In those days the Australian Open was played on grass — Borg won five Wimbledon titles in a row and if he'd competed in Australia as well, he could well have ended up with at least 15 Grand Slam titles, instead of the 11 he did. Borg did win 11 Grand Slams, so it can't be said he lacked motivation — but he was sated early, while greater champions like Federer, Djokovic and Nadal aren't satisfied even after winning 20. Nadal is 36, Djokovic 35, and Federer turns 41 next month. If Kohli — or anyone, indeed — wants to look for inspiration, these three are great examples of motivation, ambition and excellence. If he can't turn his career around, he'd be relegated to the loud but low-satisfaction IPL, and that would be a pity indeed.","content":null,"pubDate":"2022-07-10 00:37:58","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_1633763100.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka strong in Day 2 of test","link":"https://www.couriermail.com.au/sport/cricket/sri-lanka-strong-in-day-2-of-test/video/3c556b2385e3f8ee08bc3f84adff3229","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Aussies have struggled as Sri Lanka fired in Day 2, now trailing by 180 runs.","content":"Cricket: The Aussies have struggled as Sri Lanka fired in Day 2, now trailing by 180 runs.","pubDate":"2022-07-09 22:27:22","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"How long is the break between innings in T20 cricket: Innings break duration in T20 matches","link":"https://thesportsrush.com/cricket-news-how-long-is-the-break-between-innings-in-t20-cricket-innings-break-duration-in-t20-matches/","keywords":["Cricket","T20","T20I"],"creator":["Gurpreet Singh"],"video_url":null,"description":"How long is the break between innings in T20 cricket: The shorter the format, the lesser is the time duration between start of each innings. The introduction and thereby the success of the T20 format of the game, ever since the inaugural season of the T20 World Cup in South Africa in 2007, which was… The post How long is the break between innings in T20 cricket: Innings break duration in T20 matches appeared first on The SportsRush.","content":"How long is the break between innings in T20 cricket: The shorter the format, the lesser is the time duration between start of each innings. The introduction and thereby the success of the T20 format of the game, ever since the inaugural season of the T20 World Cup in South Africa in 2007, which was soon followed by the maiden season of the Indian Premier League (IPL), is one to be studied and worth the attention. One of the major factors which led to the need for this format is to arrive at the match result as quickly as possible, while also delivering fast-paced Cricket, providing action every other delivery. The successful organization of 15 years of the IPL, and other major T20 franchise leagues in the world, which have also prompted boards to come up with the 10-Overs format, ‘The Hundred’, or more recently ‘ The Sixty’ as well, is enough testament to the success shortest formats are enjoying. Moreover, the format is also ensuring financial earning and stability to the respective country’s Cricket board, with comparatively more spectators hitting the stadiums for a shorter duration match with an action-packed guarantee, which thereby attracts the sponsors who wish to acquire the various rights to associate themselves with a particular league/tournament. A typical T20 match lasts for around three hours, with one-and-a-half hours for each of the two batting innings. With the prime objective to waste as least the time as possible to complete a T20 match, the official break between the two innings lasts only 10 minutes. Thus, this is the very reason why one must have noticed the opening batters from the fielding side rush towards their team dressing room after the end of the 20 Overs of the first innings. The 10-minutes innings interval break is way shorter than the the two other formats of the game – the One-Dayers and Tests.","pubDate":"2022-07-09 21:18:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"What is powerplay in cricket: Powerplay meaning in Cricket","link":"https://thesportsrush.com/cricket-news-what-is-powerplay-in-cricket-powerplay-meaning-in-cricket/","keywords":["Cricket","Powerplay"],"creator":["Gurpreet Singh"],"video_url":null,"description":"What is powerplay in cricket: The Powerplay rules are different for a T20 international and an One-day international match in Cricket. In a game which is already tilted in favour of the batters, Powerplay is the leader of the reasons why the same is believed so. The rule, which is applicable only in the limited-Overs… The post What is powerplay in cricket: Powerplay meaning in Cricket appeared first on The SportsRush.","content":"What is powerplay in cricket: The Powerplay rules are different for a T20 international and an One-day international match in Cricket. In a game which is already tilted in favour of the batters, Powerplay is the leader of the reasons why the same is believed so. The rule, which is applicable only in the limited-Overs format, refers to a set to fielding restrictions which dictates the position of fielders whether inside the 30-yard circle or outside of it. Teams posting and chasing targets in excess of 300 has a lot to to with the Powerplay Overs as well, which restricts the placement of fielders to be stationed at any part of the ground at will. In the ODIs these Overs are divided into three phases, and in two phases during the T2oIs. As per the ICC, the rules of Powerplay in ODIs at present, which has been in place since 2015 are as follows: -Mandatory Powerplay (Overs 1-10) – During an ODI match comprising 50 Overs, only a maximum of two fielders are allowed to stand outside the 30-yard circle during this phase. -Overs 11 to 40 – During this phase, not more than four fielders are allowed to stand outside the 30-yard circle. -Overs 41 to 50 – This phase provides a bit of a relief to the bowlers, as they can now place a maximum of five fielders outside the 30-yard circle. As per the ICC, the rules of Powerplay in T20Is at present are as follows: -Overs 1 to 6 – Only a maximum of two fielders are allowed to stand outside the 30-yard circle during this phase. 6th Over onwards – A maximum of five fielders are allowed outside the 30-yard circle. A change of strategy by India post T20 WC 2021. Emphasis more on strike rate than saving wickets. India Powerplay run-rate 8.82 (highest in the world). Rohit Sharma’s SR in PP 160 (highest for any batter). Message is clear: 15-ball 30s are better than 40-ball 50s. #EngvInd — Mazher Arshad (@MazherArshad) July 9, 2022 The ODI match has witnessed a host of amendments to the initial Powerplay Overs, which was introduced by the ICC in the year 2005. Here too, the phase was split into three divisions with the first ten Overs being mandatory Powerplay with only two fielders permitted outside the 30-yard circle and two fielders at catching positions within the circle. The next two phases comprised five-Overs each, with the fielding team to decide when to take them during the innings. Two close catchers were not mandatory in this case. In the year 2008, the ICC decided to allow the batting side to take one of the aforementioned two Powerplays. Then from October 1, 2011, the ICC decided that the batting and the bowling Powerplay cannot be taken before the 16th Over and must be completed by the 40th Over. This means that Overs 11-15 and 41-50 cannot be used as Powerplay Overs by either of the teams. Just a year later, the ICC decided to do away with the bowling Powerplay, with now only the batting side to take the five-Over powerplay by the 40th Over of the ODI. Also, while three fielders were now allowed to be stationed outside the circle, the number reduced to four from five fielders during the non-powerplay Overs. From 2015 onwards, the batting and bowling powerplays were entirely done away with, with the entire innings now divided into three phases, as mentioned above. Australia’s premier T20 tournament Big Bash League (BBL) also follow what is known as the ‘Bash Boost’. Here the chasing team gets rewarded with a bonus point for scoring more than their opposition at the 10-Over mark. In case the team batting second could not surpass the opposition score after 10 Overs, the fielding side gets the bonus point.","pubDate":"2022-07-09 20:01:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"2nd Test: Kusal Mendis leads Sri Lanka’s fight after Karunaratne falls","link":"https://kashmirreader.com/2022/07/10/2nd-test-kusal-mendis-leads-sri-lankas-fight-after-karunaratne-falls/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"COLOMBO: Dimuth Karunaratne and Kusal Mendis collaborated in a 152-run partnership to fuel Sri Lanka’s spirited reply to Australia’s first-innings 364 on day two of the second Test in Galle on Saturday. Karunaratne fell for 86 in the final session but Mendis was batting on 84 at stumps with Sri Lanka on 184-2, still 180 […]","content":"COLOMBO: Dimuth Karunaratne and Kusal Mendis collaborated in a 152-run partnership to fuel Sri Lanka’s spirited reply to Australia’s first-innings 364 on day two of the second Test in Galle on Saturday. Karunaratne fell for 86 in the final session but Mendis was batting on 84 at stumps with Sri Lanka on 184-2, still 180 behind. Angelo Mathews, who was withdrawn after the first innings in the opening Test for Testing positive for COVID-19, was batting on six at the other end. The hosts stumbled early in their reply when Pathum Nissanka (six) poked at a Mitchell Starc delivery and Cameron Green took a stunning catch at gully. Mitchell Swepson could not maintain the catching standard though when Karunaratne, then on 34, drove the ball straight back to the leg-spinner. The Sri Lanka captain, who was hit on his shoulder by a Starc delivery, otherwise looked assured, prompting Australia to waste a review trying to get him caught behind off Pat Cummins. Swepson returned to deny Karunaratne a hundred, trapping him lbw. Earlier, the bottom half of Australia’s batting order simply caved in after they resumed on 298-5. The tourists lost their last five wickets for 66 runs, falling well short of the 400 mark which had looked imminent when they were 329-5. Overnight batsman Steve Smith ran out of partners and remained unbeaten on 145, which included 16 fours. Sri Lanka’s Prabath Jayasuriya claimed 6-118 for a memorable debut Test. His are the second-best figures by a Sri Lanka bowler on Test debut, after Praveen Jayawickrama’s 6-92 against Bangladesh last year. The left-arm spinner, one of the three debutants Sri Lanka fielded after five COVID-19 cases in their camp, struck two quick blows early after Australia resumed. Alex Carey (28) perished trying to play a reverse sweep and Starc was caught in the slip in Jayasuriya’s next over. The left-arm seamer went on to trap Nathan Lyon lbw for his sixth victim. Debutant spinner Maheesh Theeksana sent back Swepson for his first wicket in Test cricket. Thousands of protesters in Colombo stormed the president’s official residence earlier in the day in the laTest manifestation of public anger over the country’s worst economic crisis in seven decades. ProTesters also gathered at the Galle fort overlooking the stadium as the match progressed. —Agencies KR Desk","pubDate":"2022-07-09 18:34:26","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Jadeja Impresses With The Bat For Dominant India | England Men v India Men | 2nd Vitality IT20 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9Mm9ScDdHQmpmVk3SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jadeja Impresses With The Bat For Dominant India | England Men v India Men | 2nd Vitality IT20  England & Wales Cricket BoardHighlights IND vs ENG 2nd T20I Scorecard: Bowlers Power India To 49-run Victory and 2-0 Lead Against England  India.comIND vs ENG 2nd T20I Highlights: India Beat England By 49 Runs, Seal Series 2-0  News18India vs England 2nd T20I Highlights: All-round India crush England by 49 runs to seal series  Times of IndiaLive Cricket Score: England vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-07-09 18:29:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2nd T20 highlights 2022: Yesterday match result who won India vs England 2nd T20 highlights","link":"https://thesportsrush.com/cricket-news-ind-vs-eng-2nd-t20-highlights-2022-yesterday-match-result-who-won-india-vs-england-2nd-t20-highlights/","keywords":["Cricket","Edgbaston","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs ENG 2nd T20 highlights 2022: Clinical with the new ball yet again, India register back-to-back wins versus England in the T20I series. During the second T20I of the ongoing India’s tour of England at the Edgbaston Cricket Ground, in Birmingham, team India prevailed against England by 49 runs, to go 2-0 up and… The post IND vs ENG 2nd T20 highlights 2022: Yesterday match result who won India vs England 2nd T20 highlights appeared first on The SportsRush.","content":"IND vs ENG 2nd T20 highlights 2022: Clinical with the new ball yet again, India register back-to-back wins versus England in the T20I series. During the second T20I of the ongoing India’s tour of England at the Edgbaston Cricket Ground, in Birmingham, team India prevailed against England by 49 runs, to go 2-0 up and take an unassailable lead in the three-match series. With today’s win, team India have managed to keep their record of never losing a T20I series against England intact. Also, Rohit Sharma’s juggernaut as team India captain continues, as he registered his 14th consecutive win in T20Is, and 19th overall across all formats. Rohit Sharma: 19th consecutive win as India captain (all formats) 14th consecutive T20I win as India captain — Sarang Bhalerao (@bhaleraosarang) July 9, 2022 En route to target of 171, England got off to a worst start possible, losing Jason Roy on the first ball of the innings for a Golden Duck off Bhuvneshwar Kumar (3-1-15-3), who, alongside Jasprit Bumrah (3-1-10-2) took the game away from Jos Buttler and his men with the new ball in hand itself. Losing their three power hitters within the powerplay itself, there was no coming back for the English batting line-up, as despite a couple of cameos from Moeen Ali (35 off 21) and David Willey (33* off 22), the target was never going to be in sight, as all they could manage was 121 All Out in 17 Overs. Earlier, after smashing 61 runs in the Powerplay, India were in no time reduced to 89/5, courtesy of a dream spell of fast bowling by the debutant Richard Gleeson (4-1-15-3), who got rid of the likes of Rohit Sharma, Virat Kohli , and Rishabh Pant, to derail India’s hopes of posting in excess of 200. He was well complimented by Chris Jordan (4-0-27-4) at the other end, and had it not been for Ravindra Jadeja’s unbeaten knock of 46* (29), England might have well levelled the series today. Jadeja’s career best T20I knock helped India post 170/8 in their 20 Overs, and all it took was yet another remarkable display of swing bowling especially from Bhuvneshwas Kumar, the player of the match today, to make it curtains for England. Watch the India v/s. England 2nd T20 highlights by clicking here.","pubDate":"2022-07-09 18:09:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-India rout England in second T20 to take series","link":"https://www.thestar.com.my/sport/cricket/2022/07/10/cricket-india-rout-england-in-second-t20-to-take-series","keywords":null,"creator":null,"video_url":null,"description":"BIRMINGHAM, England (Reuters) -Indian seamer Bhuvneshwar Kumar struck three times as a spirited bowling display from the touring side helped them outclass England by 49 runs in the second Twenty20 at Edgbaston on Saturday to take an unassailable 2-0 lead in the series. Read full story","content":null,"pubDate":"2022-07-09 17:25:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/10/1654262.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/england-vs-india-live-score-over-2nd-t20i-t20-16-20-updates-3143503","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between England vs India from Edgbaston, Birmingham. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 17.0 overs, England, chasing a target of 171, are 121. The live updates of England vs India scorecard is also available. It is the perfect platform to follow your favourite teams in England vs India, 2022. Keep a track on your favourite batsmen and bowlers through England vs India, 2022 today match, ball by ball commentary, England vs India, England vs India live score, England vs India scorecard. Follow the excitement of the England vs India, 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Right then, two games are done and it is India who have sealed the series 2-0. There is still one more game to go and well it might be a dead rubber, it is more about momentum going into the ODI series. India will be eyeing a clean sweep while England will be looking to make it 2-1 and get into the ODI series with some confidence behind them. The next match starts in less than 24 hours, on Sunday, the 10th of July. The first ball will be bowled at 7 pm IST (1.30 pm GMT) but our coverage will begin much sooner. Do join us then. Take care and goodbye! Bhuvneshwar Kumar (3-1-15-3) is the PLAYER OF THE MATCH for his exceptional display with the new ball. Bhuvneshwar Kumar says that when the ball swings one enjoys it a lot. Tells that there has not been a lot of swing with the white ball in England in the last few years and he is happy to get some good swing here. Mentions that Jos Buttler is a dangerous player and he has his plans against him and he tries to execute that. Mentions that whenever it swings it is easy to plan and execute it and he tries to work on his strength and is confident in his skills. Regarding his fitness, Bhuvneshwar Kumar says that he does not want to talk about it and signs off by saying that as he is playing something is going right at the moment. Indian skipper, Rohit Sharma says that they know how good England is as a team and they were up for the challenge. Adds that they were clinical and they had a clear idea of what to do. Mentions that whenever you win games, it gives you confidence and they want to just focus on what lies ahead and they want to challenge themselves more and more as a group. Adds that it was a brilliant knock under pressure from Ravindra Jadeja, who used all his experience and seems to be confident in what he wants to do and it was good to finish off on a score that he thought was par. Says that they understand the importance of the Powerplay and want to put pressure on the opposition and they did have a superb Powerplay in both matches which set up the victory. Ends by saying that they want to give others an opportunity but will have to have a chat about it and the only issue here is not getting carried away and keep on performing. Jos Buttler, the captain of England says that it is very disappointing and says that they did not play well and they did not deserve to win. Tells that at the halfway mark they were quite happy with Richard Gleeson bowling well on debut but they lost wickets early and in the hindsight says that they would have batted first but overall they did not play well. Applauds Richard Gleeson for his performance in the debut game and also talks about Chris Jordan and says that he has bowled quite well and he is happy for Jordan. Ends by saying that they need to be better in the next game though they don't have much time to reflect on the loss. Presentation ceremony... Earlier in the game, Jos Buttler won the toss and put India in to bat which didn't turn out to be the right decision as the English bowlers got hammered in the Powerplay. The debutant, Richard Gleeson picked up three quick wickets to change the momentum a bit and then Chris Jordan kept up the good work. However, the Indian batters kept on finding the fence towards the end and thanks to a blistering cameo from Ravindra Jadeja, the visitors reached a decent score of 170. While chasing a stiff target, the English innings could never gather any sort of momentum due to some excellent pace bowling from the opposition and a fragile display with the bat as well. In the end, it was a very comfortable victory for India and they keep their record of not losing a T20I series against England. Stay tuned for the presentation. Everything that could go wrong did go wrong for England once again. Their highly-rated top order crumbled early as Jason Roy and Jos Buttler had no answer to the swing and seam of the Indian pacers. And with wickets falling, they tried to play explosive cricket which didn't work. With half the side out for just 55 runs, the hosts were down and out. Moeen Ali did provide some hope of a comeback but perished soon and it was then David Willey who hit some lusty blows to make the loss look a little less dreadful. Given the hosts' prowess in white-ball cricket, they will be thoroughly disappointed with that display. India had a competitive total on the board but given England's explosive top order, the visitors needed an early breakthrough. Bhuvneshwar Kumar provided just that as he did last time around. Jasprit Bumrah and Kumar then kept on pressing the issue and picked up three wickets inside the first 5 overs. This set the tone for the others and the visitors just kept on picking up wickets at regular intervals. The two front-line seamers were excellent with Yuzvendra Chahal and Hardik Pandya supporting them well. Only Ravindra Jadeja had an off day with the ball but all in all, another strong showing with the ball and in the field from India has seen them take an unassailable 2-0 lead in the series. A resounding victory for India and they have sealed the three-match T20I series with a game to spare! This has been yet another strong all-round showing from the visitors and England have had not much answer to it. 16.6 overs (0 Run) OUT! KNOCKED HIM OVER! Harshal Patel finishes things off with a perfect yorker! He bowls it right in the blockhole at 131 kph. Matt Parkinson who needed to see off this last delivery, just could not get his bat down in time and sees his leg stump uprooted. It has been a brilliant performance yet again from India as they win by 49 runs! 16.5 overs (1 Run) A yorker on middle. Willey gets his bat down just in time and gets the inside edge towards short fine leg for single. 16.4 overs (0 Run) Lands on a length, outside off. It is slower in pace and Willey misses his cut shot. 16.3 overs (0 Run) This is angled across the batter, outside off. Willey looks to scoop it but misses. 16.2 overs (4 Runs) FOUR! A full toss outside off and David Willey smashes it through extra-cover for a boundary. Willey is handy batter but it looks tough for England from hereon. 16.1 overs (6 Runs) SIX! Ohh..just over the fielder at deep and over the ropes! This is full and outside off. Willey slices it towards the third man region. Axar Patel (Sub) jumps to take the catch and gets a hand to it but the ball doesn't stick and goes over the ropes. 15.6 overs (0 Run) On a length, on middle. Matt Parkinson works it towards the leg side. 61 needed now from 24 balls! 15.5 overs (1 Run) Lands on a length, around off. Willey punches it to backward point for a single. Matt Parkinson is the last man in for England. 15.4 overs (0 Run) OUT! CAUGHT! Bhuvneshwar Kumar gets his third wicket now and India are just one wicket away from another comfortable victory. A slower length delivery on middle. Richard Gleeson who looks to go over the top is completely outfoxed by the change of pace. The ball loops up in the air behind the bowler and Kohli at mid off runs to his right and slightly behind and takes a fine catch. 15.3 overs (0 Run) On a length, on off. Richard Gleeson punches it to covers. 15.2 overs (2 Runs) Back of a length, around off. Richard Gleeson punches it aerially off the outside half of his blade. The ball goes towards third man and the batters run two. 15.1 overs (1 Run) A slower length delivery on middle. Willey heaves it towards backward square leg off the inside half of his blade. A single taken.","pubDate":"2022-07-09 17:03:39","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637930028110679210.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs England, 2nd T20I Highlights: India Beat England By 49 Runs, Take Unassailable 2-0 Lead - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9pbmRpYS12cy1lbmdsYW5kLTJuZC10MjBpLTIwMjItaW5kLXZzLWVuZy1saXZlLXNjb3JlLXVwZGF0ZXMtMzE0Mjc4M9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England, 2nd T20I Highlights: India Beat England By 49 Runs, Take Unassailable 2-0 Lead  NDTV SportsLive Cricket Score: England vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  CricbuzzHighlights IND vs ENG 2nd T20I Scorecard: Bowlers Power India To 49-run Victory and 2-0 Lead Against England  India.comIndia vs England 2nd T20I Highlights: All-round India crush England by 49 runs to seal series  Times of IndiaIndia defeat England to clinch T20 series  Khaleej TimesView Full coverage on Google News","content":null,"pubDate":"2022-07-09 16:56:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2nd T20I Highlights: India Beat England By 49 Runs, Seal Series 2-0 - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMivAFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvbGl2ZS1jcmlja2V0LXNjb3JlLWluZGlhLXZzLWVuZ2xhbmQtMm5kLXQyMGktbGF0ZXN0LXVwZGF0ZXMtaW5kLXZzLWVuZy1saXZlLXN0cmVhbWluZy1tYXRjaC1jb3ZlcmFnZS1oaWdobGlnaHRzLWZyb20tZWRnYmFzdG9uLWxpdmVuZXdzLTU1MjMzOTEuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ENG 2nd T20I Highlights: India Beat England By 49 Runs, Seal Series 2-0  News18India vs England 2nd T20I Highlights: All-round India crush England by 49 runs to seal series  Times of IndiaLive Cricket Score: England vs India, 2nd T20I | Cricbuzz.com - Cricbuzz  CricbuzzHighlights IND vs ENG 2nd T20I Scorecard: Bowlers Power India To 49-run Victory and 2-0 Lead Against England  India.comIndia defeat England to clinch T20 series  Khaleej TimesView Full coverage on Google News","content":null,"pubDate":"2022-07-09 16:54:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Rohit Sharma gets ANGRY on players, cuss words caught on stump mic - Twitter asks him to calm down","link":"https://zeenews.india.com/cricket/watch-rohit-sharma-gets-angry-on-players-cuss-words-caught-on-stump-mic-twitter-asks-him-to-calm-down-2483597.html","keywords":null,"creator":null,"video_url":null,"description":"As soon as the video of Rohit cussing Indian players was posted on Twitter, Indian cricket fans asked him to calm down.","content":"India captain Rohit Sharma was caught cussing at his teammates during the second T20I against England at the Edgbaston, Birmingham on Saturday. Between overs four and five, Rohit was caught on the stump mic asking players to listen to him and during the conversation he cussed Indian players in Hindi. As soon as the video of Rohit cussing Indian players was posted on Twitter, Indian cricket fans asked him to calm down. Rohit Sharma for caught on the mic saying, \"mere time mere pe dekho, maa chudane gya vo\" ___ love that #ENGvIND pic.twitter.com/orVtappfBe — Mukul (@mukkkkul_) July 9, 2022 Rohit Sharma need to relax! pic.twitter.com/oRCouTTES3 — Akash Kharade (@cricaakash) July 9, 2022 Meanwhile, Sharma scored 31 runs in just 20 balls with the help of three fours and two sixes. With this innings, Rohit helped his side post a challenging total of 170/8 in 20 overs. Along with it, Rohit also became the first Indian and only second batter to hit 300-plus boundaries in international T20. Number one on the list is Ireland's Paul Stirling, who has 325 boundaries to his name while former India captain Virat Kohli is third on the list. Both the India batsmen were on 298 fours before the start of the second T20I. As Virat failed to score big, Rohit won the race to achieve this big feat.","pubDate":"2022-07-09 16:24:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Sri Lanka Protests Reach Cricket Fences In Galle Test vs Australia","link":"https://sports.ndtv.com/cricket/sri-lanka-protests-reach-cricket-fences-during-galle-test-against-australia-watch-3143444","keywords":null,"creator":null,"video_url":null,"description":"Hundreds of people climbed the walls of the scenic Galle Fort in the morning session of the second Test for a protest condemning President Gotabaya Rajapaksa for mismanagement of the country's...","content":"Australia's cricket tour of Sri Lanka was meant to help distract from the island nation's economic misery, but on Saturday the unrest sweeping the country came within shouting distance of the pitch. Hundreds of people climbed the walls of the scenic Galle Fort in the morning session of the second Test for a protest condemning President Gotabaya Rajapaksa for mismanagement of the country's finances. Looking down on the field as Australia finished their innings, the crowd's loud chants demanding Rajapaksa's resignation came only two hours before an angry crowd in the capital forced the president to flee his home. \"Today obviously the country is in turmoil, people outside having their say. We could obviously hear it, I mean we can still hear it now,\" Australia's Steve Smith said after stumps. But the former skipper, who wrapped up the innings 145 not out, said the hullaballoo had not had a bearing on the match. \"You can hear a lot,\" he said. \"But it didn't get to anyone or play a part in what was happening out here.\" Smith was at the crease when the protesters climbed up the fort walls about an hour before lunch. \"I saw them there this morning but didn't pay much attention to it,\" he said. The protest has made it on to the fort overlooking the cricket. The cops can't stop numbers like this pic.twitter.com/14HaQ2s7Qd Commentators and match officials were more intrigued by the sight, taking time out to snap pictures of the protests on their mobile phones from a balcony overlooking the protest site. The rally at Galle stadium was one of several around the country on Saturday. Through the day a crowd was gathered near the cricket ground to wave Sri Lankan flags and decry the impact of the economic crisis. \"My wife and I have been living on one meal a day for two months to make sure our child gets three,\" protester Janith Malinga told AFP. Malinga said Rajapaksa had to leave office for the country's dire situation to improve. \"Everything is in a mess,\" he added. \"This is not the Sri Lanka I dreamed of.\" 'No reason to reschedule' The island nation has endured months of turmoil with acute food and fuel shortages, rolling blackouts and galloping inflation making life miserable for its 22 million people. Australia's white-ball captain Aaron Finch said at the start of the tour that his side hoped they could bring some \"joy\" and entertainment to Sri Lanka as it weathered the crisis. Promoted The latest unrest comes during the last match of Australia's tour, with Pakistan's squad also on the island for their upcoming series. Cricket officials said there were no plans to change their schedules, adding that the sport was unaffected by the political turmoil. \"There is no opposition to having the games. In fact, fans are supportive and we have no reason to reschedule,\" a cricket board official told AFP.","pubDate":"2022-07-09 16:11:31","image_url":"https://c.ndtvimg.com/2022-07/om4rdo6o_sri-lanka-protest_625x300_09_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England chasing 171 to beat India in second T20 cricket international – live! - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMiaGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC9saXZlLzIwMjIvanVsLzA5L2VuZ2xhbmQtdi1pbmRpYS1zZWNvbmQtdDIwLWNyaWNrZXQtaW50ZXJuYXRpb25hbC1saXZl0gFoaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3Nwb3J0L2xpdmUvMjAyMi9qdWwvMDkvZW5nbGFuZC12LWluZGlhLXNlY29uZC10MjAtY3JpY2tldC1pbnRlcm5hdGlvbmFsLWxpdmU?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England chasing 171 to beat India in second T20 cricket international – live!  The GuardianLive England vs India live: latest scores for second T20 at Edgbaston  The TelegraphHarry Brook given key chance to make Eoin Morgan's place his own  ESPNcricinfoEngland v India predictions and free T20 cricket betting tips: Visitors stronger  Racing PostEngland v India Second T20 Tips: India the right favourites  Betting.betfairView Full coverage on Google News","content":null,"pubDate":"2022-07-09 16:07:05","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Best bowling figures in T20 debut: Best figures in innings on debut in T20Is full list","link":"https://thesportsrush.com/cricket-news-best-bowling-figures-in-t20-debut-best-figures-in-innings-on-debut-in-t20is-full-list/","keywords":["Cricket","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Best bowling figures in T20 debut: England pacer Richard Gleeson bowled his heart out to dismiss the best in the game during the second T20I. During the second T20I of the ongoing India’s tour of England at the Edgbaston Cricket Ground in Birmingham, a dream T20I debut in English colours for pacer Richard Gleeson has… The post Best bowling figures in T20 debut: Best figures in innings on debut in T20Is full list appeared first on The SportsRush.","content":"Best bowling figures in T20 debut: England pacer Richard Gleeson bowled his heart out to dismiss the best in the game during the second T20I. During the second T20I of the ongoing India’s tour of England at the Edgbaston Cricket Ground in Birmingham, a dream T20I debut in English colours for pacer Richard Gleeson has restricted India to the score of 170/8 after a fiery start from the new opening batting pair of Rishabh Pant (26 off 15) and Rohit Sharma (31 off 20). Having posted 61/1 on the scoreboard at the end of the Powerplay, the debutant from Lancashire picked up the prized wicket of India skipper Rohit Sharma in his very first Over of international Cricket to a short delivery, which ballooned up in the air after the latter got hurried on while playing the pull shot. Into the second Over, he then dismissed the off-colour Virat Kohli (1 off 2), and the set Rishabh Pant (26 off 15) in successive deliveries to let his side come right back into the contest. With Chris Jordan (4-0-27-4) complimenting Gleeson well enough from the other end as well, had it not been for an unbeaten knock from India’s all-rounder Ravindra Jadeja (46* off 29), India would have had themselves wanting at the 130-run mark. So Gleeson is finding international cricket to be a bit of a lark. 3 in 4 and 3 of the biggest names in the game at that. #ENGvIND — Melinda Farrell (@melindafarrell) July 9, 2022 Best bowling figures in T20 debut Gleeson ultimately finished the innings with excellent bowling figures of 4-1-15-3, which included the dream wickets of Rohit, Kohli, and Pant. As far as the best bowling figures on debut in the T20I format are concerned, Gleeson’s numbers, however, are nowhere even near the middle-half of the long list of bowlers with scintillating debut matches. With figures of 2-0-4-5 during the T20I match against Hong Kong in the year 2022, Malaysia’s Khizar Hayat tops the list of best bowling figures in T20I debut. Best figures in innings on debut in T20Is full list Bowler Overs Maidens Runs Wickets Country Opposition Venue Date Khizar Hayat 2 0 4 5 Malaysia v Hong Kong Kuala Lumpur 20-Feb-20 A Nanda 2.3 0 6 5 Luxembourg v Turkey Ilfov County 29-Aug-19 Elias Sunny 4 1 13 5 Bangladesh v Ireland Belfast 18-Jul-12 Hassan Mehmood 3.5 0 14 5 Sweden v Denmark Brondby 14-Aug-21 Ghulam Ahmadi 4 2 5 4 Germany v Norway Krefeld 05-Aug-21   The post Best bowling figures in T20 debut: Best figures in innings on debut in T20Is full list appeared first on The SportsRush.","pubDate":"2022-07-09 15:44:25","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant opening batsman in T20: Rishabh Pant fastest century in T20s full list","link":"https://thesportsrush.com/cricket-news-rishabh-pant-opening-batsman-in-t20-rishabh-pant-fastest-century-in-t20s-full-list/","keywords":["Cricket","Pant centuries","Pant opener","rishabh pant"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Rishabh Pant opening batsman in T20: Team India surprised everyone by opening with Rishabh Pant in the Edgbaston T20I. England and India are up against each other in the 2nd T20I of the 3-match T20I series at the Edgbaston Stadium in Birmingham. England won the toss and opted to bowl first, where India made four… The post Rishabh Pant opening batsman in T20: Rishabh Pant fastest century in T20s full list appeared first on The SportsRush.","content":"Rishabh Pant opening batsman in T20: Team India surprised everyone by opening with Rishabh Pant in the Edgbaston T20I. England and India are up against each other in the 2nd T20I of the 3-match T20I series at the Edgbaston Stadium in Birmingham. England won the toss and opted to bowl first, where India made four changes to their playing eleven. At the time of the announcement, it was looking like Virat Kohli will open the innings with Rohit Sharma, but there was a surprise opener in Rishabh Pant. Pant could not play a huge knock, but he made his intentions clear in 15-ball 26 runs knock. He was allotted the role to smash the bowlers, and he did the same. Pant has opened for India in the junior divisions, whereas he also has opened for Delhi in the domestic circuit. Rohit played the punt of opening with Rishabh Pant against West Indies earlier this year in an ODI match. Rishabh Pant is yet to score a T20I century, but he has smashed a couple of hundreds in T20 cricket. In 2018, Rishabh Pant scored the 2nd fastest century in the history of T20 cricket, where he completed his century in just 32 balls (just behind Chris Gayle). Pant smashed 116 runs in 38 balls at a strike-rate of 305.26, courtesy of 12 sixes and 8 boundaries. Rishabh Pant. 32-ball century against Himachal Pradesh. https://t.co/rhcSbRAoXR — Subhayan Chakraborty (@CricSubhayan) January 13, 2021 Pant achieved this milestone while playing for Delhi in the Syed Mushtaq Ali Trophy against Himachal Pradesh. Himachal Pradesh scored 144 runs in the first innings and Delhi achieved the target by ten wickets. Pant and Gautam Gambhir opened the innings for Delhi and Gambhir watched the innings from another end. Pant scored his maiden IPL century as well, where he smashed 128 runs in just 63 balls, playing for Delhi against Sunrisers Hyderabad. He smashed 128 runs in just 63 balls at a strike-rate of 2013.17, courtesy of 15 boundaries and 7 sixes. Delhi managed to score 187 runs, but they lost the match by nine wickets in the end.","pubDate":"2022-07-09 14:51:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli wicket today: Dawid Malan grabs terrific catch to dismiss Virat Kohli at Edgbaston","link":"https://thesportsrush.com/cricket-news-virat-kohli-wicket-today-dawid-malan-grabs-terrific-catch-to-dismiss-virat-kohli-at-edgbaston/","keywords":["Cricket","Videos","Dawid Malan","England","India","India tour of England 2022","Richard Gleeson","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Virat Kohli wicket today: The former Indian captain had to walk back to the pavilion after registering a single-digit score. During the second T20I of the ongoing India’s tour of England in Birmingham, England batter Dawid Malan excelled on the field to send former India captain Virat Kohli back to the pavilion. It all happened… The post Virat Kohli wicket today: Dawid Malan grabs terrific catch to dismiss Virat Kohli at Edgbaston appeared first on The SportsRush.","content":"Virat Kohli wicket today: The former Indian captain had to walk back to the pavilion after registering a single-digit score. During the second T20I of the ongoing India’s tour of England in Birmingham, England batter Dawid Malan excelled on the field to send former India captain Virat Kohli back to the pavilion. It all happened right after the powerplay when Kohli top-edged a delivery from debutant England fast bowler Richard Gleeson. Kohli, who wanted to hoic a delivery delivery pitched outside the off-stump towards long-on, ended up top-edging the ball between backward point and third-man. Running behind from backward point, Malan put on display a terrific fielding performance to dismiss Kohli. Slightly confused initially regarding attempting the catch or not because of Mitchell Swepson running in from third-man at one point, Malan eventually decided to continue with this try to complete a running catch. Expected to open the batting with captain Rohit Sharma (31) after India left out both Ishan Kishan and Deepak Hooda, Kohli walked in to bat at No. 3 in the fifth over as wicket-keeper batter Rishabh Pant (26) partnered Sharma at the top . Playing a T20I after almost five months, all Kohli scored today was 1 (3). On the other hand, 34-year old Gleeson celebrated his T20I debut by dismissing the likes of Sharma, Kohli and Pant on the first eight deliveries of his international career. As a result, a swift 49-run opening partnership was followed by India losing half their side for the next 40 runs to find themselves in deep trouble at Edgbaston. That’s outrageous, @dmalan29 ! 👏 Kohli departs… Scorecard/clips: https://t.co/aZbATuE7p7 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvIND 🇮🇳 pic.twitter.com/XPVQfyKLhH — England Cricket (@englandcricket) July 9, 2022 No more debates, Virat Kohli just has to score in the upcoming matches otherwise he could be out of the team. #ViratKohli #IndvEng — Sushant Mehta (@SushantNMehta) July 9, 2022 Virat Kohli is caught looking for a big shot. Virender Sehwag on commentary “paise aur gaind dekh ke urranay chahyain.” 😂 — Mazher Arshad (@MazherArshad) July 9, 2022 Watched all the three deliveries faced by Virat Kohli. Nervy and out of sorts. #ENGvIND — Subhayan Chakraborty (@CricSubhayan) July 9, 2022 Such is VK’s luck right now that even if the fielder had to do a 110m hurdle to get to the ball, he’d still catch it. 🤦🏽‍♂️ — KSR (@KShriniwasRao) July 9, 2022 For more cricket-related news, click here .","pubDate":"2022-07-09 14:45:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"'Pay for my therapy', fans' outburst as Virat Kohli fails once in second T20I against England","link":"https://zeenews.india.com/cricket/pay-for-my-therapy-fans-outburst-as-virat-kohli-fails-once-in-second-t20i-against-england-2483568.html","keywords":null,"creator":null,"video_url":null,"description":"As soon as Virat got out cheaply, Twitter was flooded with Indian cricket fans disappointed with India's premier batsman.","content":"Just when there were talks of keeping former India captain Virat Kohli out of the T20 side for the upcoming T20 World Cup in Australia, the India talisman got out cheaply in the second T20I against England at the Edgbaston, Birmingham on Saturday. Virat was dismissed by England's debutant Richard Gleeson in the 7th over of the innings. Virat went for a big hit over mid-on, and top-edged the ball to find Dawid Malan at the back-foot point. Virat had scored only one run in three balls. Virat Kohli's disappointing run of form continued in the fifth and final Test against England, where he could score only 11 and 20 in both of his innings. He also had a sub-par IPL 2022 season with Royal Challengers Bangalore. Kohli could score only 341 runs in 16 games at an average of 22.73 and a sub-par strike rate of 115.98. He could score only two half-centuries in the tournament. According to some reports, the Board of Control for Cricket in India (BCCI) could be having the veteran sit out on the bench during the ICC World T20I 2022, which will take place in Australia in October this year. Cricket legend Kapil Dev said to the media on Saturday that Kohli will need to perform better and if the spinner Ravichandran Ashwin could be dropped from the Test squad, even Virat could be dropped from the T20I squad. As soon as Virat got out cheaply, Twitter was flooded with Indian cricket fans disappointed with India's premier batsman. virat needs to understand that Rohit Pant Surya Hardik Karthik Are the players with aggressive role,he needs to play around that's it #INDvsEND #viratkohli — Sarcasm Sanghi __ (@Saichowdary014) July 9, 2022 Is Virat Kohli still suitable for T20 cricket? @BCCI — Vikas Mathur __ (@vikasmathur542) July 9, 2022 Virat Kohli is incredible, he scored 1 full run. — Sumant N Tivary__ (@Tivary) July 9, 2022 @imVkohli pls retireeeee u are standing against the countrys development why are u so selfish u are never gonna be the old player u were i know so many people have said this to you but u ignored them but plsssss take this seriously — Shreyas S.B. (@ShreyasSB6) July 9, 2022 Virat Kohli giving away his wickets to new bowlers be like - pic.twitter.com/hFGDNm1eka — omkar hazare (@_Satyanweshi_) July 9, 2022 @SGanguly99 @imVkohli @ImRo45 If Rahane can sit out, why not kohli? Include player on the basis of form, not with fame. — Debabrata Rath (@DebabrataRath6) July 9, 2022 Virat Kohli with his brand name walks in the playing XI replacing Deepak Hooda mr consistent these days. Indian Cricket is not going any where __ #ENGvsIND #INDvENG — SakshamK (@Sakshamcric) July 9, 2022 current condition of virat kohli _ pic.twitter.com/004WBsk2db — shivam18 ||__ (@shivamprince16) July 9, 2022 @virendersehwag Sir Don't you think @BCCI should ask Virat Kohli like they have asked to Hardik and Pujara. In form Hooda can make some run. Virat can comeback with form and mental peace.___ #ViratKohli #IndianCricketTeam #indvseng2ndt20 — Koushik Paul (@YourPaulBabu) July 9, 2022 It's time @imVkohli . Thanks for the memories_ #ENGvIND pic.twitter.com/n7pVtr0lnI — SUSHANT KUMAR (@Doctor_Punter) July 9, 2022 It's time @imVkohli . Thanks for the memories_ #ENGvIND pic.twitter.com/n7pVtr0lnI — SUSHANT KUMAR (@Doctor_Punter) July 9, 2022 @imVkohli pehle ja kar kundali dikha pandit se phir field per aana — Kajal (@ImKajal18) July 9, 2022 Kohli pay for my therapy sessions now @imVkohli You can't end ur career this way.. Score some runs pls _ — Sana Patel (@Crichipster) July 9, 2022","pubDate":"2022-07-09 14:45:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch - \"That's Outrageous\": Virat Kohli Fails To Get Going As Dawid Malan Takes A Stunner In Second.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiqgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9lbmdsYW5kLXZzLWluZGlhLTIwMjIvaW5kaWEtdnMtZW5nbGFuZC10aGF0cy1vdXRyYWdlb3VzLXZpcmF0LWtvaGxpLWZhaWxzLXRvLWdldC1nb2luZy1hcy1kYXdpZC1tYWxhbi10YWtlcy1hLXN0dW5uZXItaW4tc2Vjb25kLXQyMGktd2F0Y2gtMzE0MzIwNtIBsAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9lbmdsYW5kLXZzLWluZGlhLTIwMjIvaW5kaWEtdnMtZW5nbGFuZC10aGF0cy1vdXRyYWdlb3VzLXZpcmF0LWtvaGxpLWZhaWxzLXRvLWdldC1nb2luZy1hcy1kYXdpZC1tYWxhbi10YWtlcy1hLXN0dW5uZXItaW4tc2Vjb25kLXQyMGktd2F0Y2gtMzE0MzIwNi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch - \"That's Outrageous\": Virat Kohli Fails To Get Going As Dawid Malan Takes A Stunner In Second..  NDTV SportsProblem of plenty: How do India fit Virat Kohli in their T20I XI?  ESPNcricinfoIND vs ENG Live Cricket Score 2nd T20I Latest Updates: England Lose Top Order Early In Stiff Chase  News18\"Can't Play For Long Riding On Your Name\": Former India Cricketer On Virat Kohli  NDTV SportsLIVE IND vs ENG 2nd T20I Cricket Score, Edgbaston: Brook Departs, England In Spot Of Bother  India.comView Full coverage on Google News","content":null,"pubDate":"2022-07-09 14:37:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - India vs England 2nd T20I 2022 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL2luZGlhLWluLWVuZ2xhbmQtMjAyMi0xMjc2ODkzL2VuZ2xhbmQtdnMtaW5kaWEtMm5kLXQyMGktMTI3NjkwNS9tYXRjaC1yZXBvcnTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - India vs England 2nd T20I 2022  ESPNcricinfoLIVE IND vs ENG 2nd T20I Cricket Score, Edgbaston: Karthik Departs, Jadeja Crucial For Final Flourish  India.comIndia vs England 2nd T20I Live Score: Dinesh Karthik run out as aggressive India lose way  Times of IndiaProblem of plenty: How do India fit Virat Kohli in their T20I XI?  ESPNcricinfo\"Can't Play For Long Riding On Your Name\": Former India Cricketer On Virat Kohli  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-07-09 14:32:51","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs England, 2nd T20I Live Score Updates: Suryakumar Yadav, Hardik Pandya Depart In Consecutive Balls, India Five Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9pbmRpYS12cy1lbmdsYW5kLTJuZC10MjBpLTIwMjItaW5kLXZzLWVuZy1saXZlLXNjb3JlLXVwZGF0ZXMtMzE0Mjc4M9IBeGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9pbmRpYS12cy1lbmdsYW5kLTJuZC10MjBpLTIwMjItaW5kLXZzLWVuZy1saXZlLXNjb3JlLXVwZGF0ZXMtMzE0Mjc4My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England, 2nd T20I Live Score Updates: Suryakumar Yadav, Hardik Pandya Depart In Consecutive Balls, India Five Down  NDTV SportsProblem of plenty: How do India fit Virat Kohli in their T20I XI?  ESPNcricinfoIndia vs England 2nd T20I Live Score: Jordan gets Suryakumar after Gleeson's three-fer  Times of India\"Can't Play For Long Riding On Your Name\": Former India Cricketer On Virat Kohli  NDTV SportsI Don't Think India Will Change Playing XI Even If Seniors Return For 2nd T20I: Zaheer Khan  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-07-09 14:31:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Providence Stadium Guyana pitch report 1st ODI: WI vs BAN pitch report Guyana ODI","link":"https://thesportsrush.com/cricket-news-providence-stadium-guyana-pitch-report-1st-odi-wi-vs-ban-pitch-report-guyana-odi/","keywords":["Cricket","Guyana pitch report","WI vs BAN","WI vs BAN pitch report"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Providence Stadium Guyana pitch report 1st ODI: The SportsRush brings you the pitch report of the first ODI between West Indies and Bangladesh. West Indies will take Bangladesh in the 1st ODI of the 3-match ODI series at the Providence Stadium in Guyana. After winning the T20Is, the hosts would want to stamp their authority… The post Providence Stadium Guyana pitch report 1st ODI: WI vs BAN pitch report Guyana ODI appeared first on The SportsRush.","content":"Providence Stadium Guyana pitch report 1st ODI: The SportsRush brings you the pitch report of the first ODI between West Indies and Bangladesh. West Indies will take Bangladesh in the 1st ODI of the 3-match ODI series at the Providence Stadium in Guyana. After winning the T20Is, the hosts would want to stamp their authority in the ODIs as well. Shai Hope will again lead the top-order of the West Indies in this match, and he has some able supporting batters as well. The bowlers of the hosts have done well. Bangladesh will be led by Tamim Iqbal, and they will miss the services of Shakib al Hasan in this series. The Providence Stadium in Guyana will be hosting an ODI match after a span of almost four years. West Indies and India were scheduled to play a match in 2019, but it got abandoned. The pitch at the Providence Stadium will definitely not excite the batters due to his slowish nature. In the last couple of years, it has been seen that the pitch has been on the slower side, and the shot-making has been really tough at this very stadium. The slower balls will grip onto the surface, and there is an uneven bounce on the track as well. So, both teams would want to take advantage of the powerplay overs in batting. Enjoying this run of form from @nicholas_47 .💪🏽🔥 #MaroonMagic pic.twitter.com/0dyYZ9gHve — Windies Cricket (@windiescricket) July 8, 2022 A total of 21 ODIs have been played on this ground, where the chasing teams have won 8 and the defending teams have won 13 matches. So, this is a ground where both sides would want to bat first. The average 1st innings score at this ground is just 233 runs. The smaller boundaries can go in the favour of the batters. Sunil Narine is the highest-ever wicket-taker at this ground in the ODIs, whereas DJ Bravo is at the 2nd position. The spinners get turn and grip from the surface, whereas the pacers bowling slower deliveries have also got their rewards. 250 can be a par score at this venue.","pubDate":"2022-07-09 14:30:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"West Indies vs Bangladesh 1st ODI Live Telecast Channel in India and USA: When and where to watch WI vs BAN Guyana ODI?","link":"https://thesportsrush.com/cricket-news-west-indies-vs-bangladesh-1st-odi-live-telecast-channel-in-india-and-usa-when-and-where-to-watch-wi-vs-ban-guyana-odi/","keywords":["Cricket","Bangladesh","Bangladesh tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"West Indies vs Bangladesh 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st WI vs BAN ODI. The first ODI of the ongoing Bangladesh’s tour of West Indies will be played in Guyana tomorrow. Host for the recently concluded third T20I, Providence Stadium will be hosting… The post West Indies vs Bangladesh 1st ODI Live Telecast Channel in India and USA: When and where to watch WI vs BAN Guyana ODI? appeared first on The SportsRush.","content":"West Indies vs Bangladesh 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of 1st WI vs BAN ODI. The first ODI of the ongoing Bangladesh’s tour of West Indies will be played in Guyana tomorrow. Host for the recently concluded third T20I, Providence Stadium will be hosting all the three ODIs. In what is going to be the 11th bilateral ODI series (fifth in West Indies) between West Indies and Bangladesh, both the teams have won five series each till date. Readers must note that West Indies haven’t defeated Bangladesh in a bilateral ODI series since 2014. Bangladesh, who’ve won three series in a row in this period, have also won their last eight ODIs against West Indies. Yet to win a match on this tour, the visitors would want to take confidence from their outstanding recent ODI record against this opposition. Clinical & professional display of T20i cricket from @nicholas_47 & @windiescricket ;Refreshing approaches to playing T20 on full display. Shows what youthful leadership without “excess baggage” can bring. @BCBtigers must make some tough decisions to be more competitive #WIvBAN — Daren Ganga (@DarenGanga) July 7, 2022 Overall, West Indies have a 21-18 lead in 41 ODIs against Bangladesh. The lead increases to 8-5 in 13 home ODIs for West Indies. Continuing with an unfortunate scenario for international cricket in West Indies, New Zealand, Bangladesh and some other nations in the recent years, Bangladesh’s tour of West Indies 2022 is no different with respect to not finding a platform for television viewing in India. Having said that, streaming platform Fan Code is streaming the same at a nominal price. Fans, who wish to buy a pass for the rest of the multi-format tour (three T20Is and three ODIs), will have to pay a 42% discounted price of INR 29 on the website or mobile application of FanCode. As far as local fans in the Caribbean are concerned, they will be able to follow this ODI on ESPN Caribbean. Meanwhile, Bangladeshi fans back home will be able to watch Guyana ODIs on T-Sports. Fans living in USA and UK will be able to watch this series on ESPN+ and BT Sport respectively. Date – 10/07/2022 (Saturday). Match start Time – 09:30 AM (local) and 07:00 PM (India). TV Channel – Not available (India), T-Sports (Bangladesh), ESPN Caribbean (Caribbean), ESPN+ (USA) and BT Sport (UK). Online platform – FanCode (India), ICC TV (Bangladesh), West Indies Cricket YouTube Channel (Other Countries).","pubDate":"2022-07-09 14:30:39","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Watch - \"Outrageous\": Virat Kohli Falls For 1 As Dawid Malan Takes Stunner","link":"https://sports.ndtv.com/cricket/india-vs-england-thats-outrageous-virat-kohli-fails-to-get-going-as-dawid-malan-takes-a-stunner-in-second-t20i-watch-3143206","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli, former Indian cricket team captain, could last just three balls in the second T20I against England","content":"Virat Kohli 's lean patch extended in the second T20I between India and England too as he was dismissed for just 1. The star batter made a comeback to the side after being rested for the first T20I but he could not make an impact. After Rohit Sharma departed at the score of 31, a lot was expected from Kohli at No. 3. The former Indian cricket team captain could last just three balls. Against a length ball outside off by Gleeson, Kohli attempted to go over long-on. The ball, however, took the outside edge and flew behind. Dawid Malan ran backwards and took a diving catch. That's outrageous, @dmalan29 ! Kohli departs... Scorecard/clips: https://t.co/aZbATuE7p7 #ENGvIND pic.twitter.com/XPVQfyKLhH Kohli along with Rishabh Pant and Jasprit Bumrah returned to Indian playing eleven as England opted to bowl in the second T20 International here on Saturday. Deepak Hooda , whose scores in the last three games are 47, 104 and 33, had to make way to accommodate the senior players. Others who were left out include pacer Arshdeep Singh and opener Ishan Kishan . For England, seamer Richard Gleeson mase his debut while left arm fast bowler David Willey made a comeback to the playing eleven, replacing Reece Topley and Tymal Mills . Promoted India: Rohit Sharma (c), Virat Kohli, Suryakumar Yadav , Rishabh Pant(w), Hardik Pandya , Dinesh Karthik , Ravindra Jadeja , Harshal Patel , Bhuvneshwar Kumar , Jasprit Bumrah, Yuzvendra Chahal England: Jason Roy , Jos Buttler (w/c), Dawid Malan, Liam Livingstone , Harry Brook , Moeen Ali , Sam Curran , David Willey, Chris Jordan , Richard Gleeson, Matthew Parkinson. With PTI inputs","pubDate":"2022-07-09 14:30:27","image_url":"https://c.ndtvimg.com/2022-07/dahuba78_virat-kohli_625x300_09_July_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Providence Stadium Guyana ODI records: Guyana cricket stadium most runs wickets and highest innings total in ODIs","link":"https://thesportsrush.com/cricket-news-providence-stadium-guyana-odi-records-guyana-cricket-stadium-most-runs-wickets-and-highest-innings-total-in-odis/","keywords":["Cricket","Bangladesh","Bangladesh tour of West Indies 2022","West Indies"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Providence Stadium Guyana ODI records: Providence Stadium will be hosting an ODI after almost three years tomorrow. The last leg of Bangladesh’s tour of West Indies 2022 will commence in the form of a three-match ODI series with the first one to be played in Guyana on Sunday. A day contest will be followed by… The post Providence Stadium Guyana ODI records: Guyana cricket stadium most runs wickets and highest innings total in ODIs appeared first on The SportsRush.","content":"Providence Stadium Guyana ODI records: Providence Stadium will be hosting an ODI after almost three years tomorrow. The last leg of Bangladesh’s tour of West Indies 2022 will commence in the form of a three-match ODI series with the first one to be played in Guyana on Sunday. A day contest will be followed by two more ODIs at the same venue in the days to come. Having hosted a T20I as recent as the day before yesterday, Providence Stadium is gearing up to host an ODI after almost three years. Out of the 22 ODIs played here, West Indies have been part of 16 winning seven and losing eight over the years. Bangladesh, on the other hand, have won two and lost one out of their three ODIs played at this venue. Not part of the ongoing ICC World Cup Super League, the series still holds a lot of importance for both the teams. West Indies, who haven’t won a bilateral ODI series against Bangladesh in the last eight years, will have eyes on making amends at the earliest. A victory for the hosts tomorrow will end an eight-match losing streak for them against Bangladesh. As far as the visitors are concerned, they would be even more hungrier to win the ODI series after having lost both the Test and T20I series 2-0. Yet to win a match on this tour, it would be quite embarrassing for Bangladesh if they fail to return home empty-handed. Providence Stadium Guyana ODI records Highest ODI run-scorers at Providence Stadium are Shivnarine Chanderpaul (314), Mohammad Hafeez (277), Chris Gayle (252), Tamim Iqbal (222) and Jacques Kallis (184). Below is a list of highest run-scorers in Guyana ODIs among active cricketers: Batter Matches Runs Highest Average SR 100 50 Tamim Iqbal (BAN) 3 222 130* 111 73.02 1 1 Shimron Hetmyer (WI) 3 177 125 88.5 103.5 1 1 Shakib Al Hasan (BAN) 3 162 97 54 73.63 0 2 Babar Azam (PAK) 3 154 125* 77 88 1 0 Shai Hope (WI) 6 147 71 29.4 65.91 0 1 Highest ODI wicket-takers at Providence Stadium are Sunil Narine (12), Dwayne Bravo (11), Jason Holder (10), Shahid Afridi (9) and Charl Langeveldt (8). Below is a list of highest wicket-takers in Guyana ODIs among active cricketers: Bowler Matches Wickets Average Economy SR Jason Holder (WI) 10 10 35.7 4.68 45.7 Kemar Roach (WI) 5 7 17.57 3.53 29.8 Ashley Nurse (WI) 5 7 32.28 4.52 42.8 Hasan Ali (PAK) 3 6 18.33 5.54 19.8 Shadab Khan (PAK) 3 5 29.8 5.51 32.4 Highest innings total in Guyana ODIs Score Overs Team Opposition Year 309/5 49 West Indies Pakistan 2017 308/5 50 Pakistan West Indies 2017 303/5 50 Sri Lanka West Indies 2007 282/5 50 Pakistan West Indies 2017 279/4 50 Bangladesh West Indies 2018 The post Providence Stadium Guyana ODI records: Guyana cricket stadium most runs wickets and highest innings total in ODIs appeared first on The SportsRush.","pubDate":"2022-07-09 14:30:04","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"LIVE IND vs ENG 2nd T20I Cricket Score, Edgbaston: Jordan Gets Suryakumar-Pandya In Same Over, England In Con - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7QFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaW5kLXZzLWVuZy0ybmQtdDIwLWxpdmUtY3JpY2tldC1zY29yZS1lZGdiYXN0b24tbWF0Y2gtdXBkYXRlcy1lbmdsYW5kLXZzLWluZGlhLXQyMGktbGl2ZS1zdHJlYW0tc29ueWxpdi1qaW90di1iYWxsLWJ5LWJhbGwtY29tbWVudGFyeS1iaXJtaW5naGFtLXJvaGl0LWtvaGxpLWJ1dHRsZXItcm95LXBhbnQtcGFuZHlhLWJ1bXJhaC1qYWRlamEtNTUwMzIwNi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs ENG 2nd T20I Cricket Score, Edgbaston: Jordan Gets Suryakumar-Pandya In Same Over, England In Con  India.comIndia vs England 2nd T20 Live Score: Onus on Pandya, debutant Gleeson takes 3  Hindustan TimesEngland vs India 2nd T20I Dream11 Prediction, Dream11 Team Today Match, Fantasy Cricket Tips, Playing XI, Pitch Report, Injury Update- IND tour of ENG 2022  Cricket AddictorEngland v India Second T20 Tips: India the right favourites  Betting.betfairENG vs IND Match Prediction, 2nd T20I – Who will win today’s match between England and India?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-07-09 14:28:12","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian women's cricket team has great chance to claim medal at CWG: Mithali","link":"https://www.business-standard.com/article/sports/indian-women-s-cricket-team-has-great-chance-to-claim-medal-at-cwg-mithali-122070900583_1.html","keywords":null,"creator":null,"video_url":null,"description":"Women's cricket will make its debut in the Birmingham CWG after a men's tournament was held at the 1998 edition in Kuala Lumpur.","content":"Former captain Mithali Raj feels the Indian women's cricket team has a great chance to finish on the podium in the upcoming Commonwealth Games, provided it has its tactics and strategies in place. Women's cricket will make its debut in the Birmingham CWG after a men's tournament was held at the 1998 edition in Kuala Lumpur. India are placed in Group A and will take on Australia in their first group stage game on July 29. Pakistan and Barbados are the other two teams in the group. \"I think before any big event, preparation is very important. If you prepare well and because it's a T20 format and Commonwealth Games, if you have your tactics and strategies in place we have a great chance to finish on the podium,\" Mithali said here. The iconic former captain, who announced her retirement last month, was speaking at the Eden Gardens during the promotion of a movie 'Shabaash Mithu', which is based on her life. India, led by Harmanpreet Kaur, has nicely warmed up for the CWG, having won the T20 series against Sri Lanka 2-1. Mithali, who has played with Harmanpreet, also said that the Punjab all-rounder has enough experience to lead India to glory at the Games. \"She (Harmanpreet) has been leading in T20s since 2016, so I think she is experienced enough to lead (the team) in the Commonwealth Games,\" said the 39-year-old, who has 7,805 ODI runs. While the semifinals will be played on August 6, the summit clash will be held on August 7. The Birmingham CWG will be held from July 28 to August 8. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-07-09 14:09:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220709/thumb-122070900583.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs IND 2nd T20 Live Score Updates: India are three down at Edgbaston - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9lbmctdnMtaW5kLTJuZC10MjAtbGl2ZS1zY29yZS11cGRhdGVzLTgwMTkyNzMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ENG vs IND 2nd T20 Live Score Updates: India are three down at Edgbaston  The Indian ExpressIndia vs England 2nd T20 Live Score: Rohit departs, onus on Pant and Kohli  Hindustan TimesEngland vs India 2nd T20I Dream11 Prediction, Dream11 Team Today Match, Fantasy Cricket Tips, Playing XI, Pitch Report, Injury Update- IND tour of ENG 2022  Cricket AddictorIND vs ENG Live Cricket Score 2nd T20I Latest Updates: Rohit Sharma Departs After Good Start  News18England v India Second T20 Tips: India the right favourites  Betting.betfairView Full coverage on Google News","content":null,"pubDate":"2022-07-09 14:07:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant opening T20 record: Rishabh Pant stats as opener in T20Is","link":"https://thesportsrush.com/cricket-news-rishabh-pant-opening-t20-record-rishabh-pant-stats-as-opener-in-t20is/","keywords":["Cricket","England","India","India tour of England 2022","rishabh pant"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rishabh Pant opening T20 record: The Indian wicket-keeper batter has been surprisingly promoted as an opener tonight. During the second T20I of the ongoing India’s tour of England in Birmingham, India have surprised one and all by promoting wicket-keeper batter Rishabh Pant as captain Rohit Sharma’s opening partner. Pant, who hasn’t had the success that… The post Rishabh Pant opening T20 record: Rishabh Pant stats as opener in T20Is appeared first on The SportsRush.","content":"Rishabh Pant opening T20 record: The Indian wicket-keeper batter has been surprisingly promoted as an opener tonight. During the second T20I of the ongoing India’s tour of England in Birmingham, India have surprised one and all by promoting wicket-keeper batter Rishabh Pant as captain Rohit Sharma’s opening partner. Pant, who hasn’t had the success that he should have had in T20Is by now, had been suggested to open the batting in white-ball cricket by former cricketers namely Sunil Gavaskar, Sanjay Bangar and others. That being said, not many would’ve expected him to partner Sharma at the top at Edgbaston today. With India leaving out Ishan Kishan and Deepak Hooda to accommodate multi-format players in former captain Virat Kohli and Pant, Kohli was expected to open with Sharma. Readers must note that Kohli had expressed his intention of opening the batting with Sharma in T20Is during the home series against England last year. Pant, who used to open the batting with Kishan during his U-19 days, hasn’t replaced him as India’s opening batter for the first time. The same had happened in a home ODI against West Indies earlier this year but the move wasn’t a permanent one according to Sharma. Rishabh Pant opening T20 record Playing his 49th T20I, Pant has opened the batting for the first time in T20Is. The highest he had batted in T20Is before this match was at No. 3 (six times). If these two can click together, would be the fiercest opening pair at the #T20WorldCup! @RishabhPant17 @ImRo45 #ENGvIND — Reema Malhotra (@ReemaMalhotra8) July 9, 2022 As far as T20s are concerned, Pant has opened the batting for Delhi Capitals (Indian Premier League 2016) and Delhi (Syed Mushtaq Ali Trophy 2017-18 and 2019-2020) in the past. In 17 T20 innings as an opening batter, Pant has scored 599 runs at an average and strike rate of 37.43 and 166.38 respectively. The left-handed batter has registered a century and five half-centuries with a career-best 116* (38) coming against Himachal Pradesh at the Arun Jaitley Stadium four years ago. The post Rishabh Pant opening T20 record: Rishabh Pant stats as opener in T20Is appeared first on The SportsRush.","pubDate":"2022-07-09 14:06:26","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}