{"newsArray":[{"article_id":"97206d1212c52c15d1a08cde046727f3","title":"CID launches investigation into death threats against Sports Minister","link":"https://www.ft.lk/sports/CID-launches-investigation-into-death-threats-against-Sports-Minister/23-755500","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Officer in Charge (OIC) of the Organised Crime Branch of the Criminal Investigations Department (CID) informed Colombo Chief Magistrate Prasanna Alwis yesterday that investigations are underway regarding alleged death threats made against the Sports Minister Roshan Ranasinghe. Ranasinghe filed a complaint with the CID last week regarding various threats directed at him recently. Security for the Minister was also heightened following his disclosure in Parliament that he had received death threats from various parties. During his address in Parliament, Ranasinghe maintained that he has been facing multiple threats as a result of his recent revelations regarding corruption, fraud, and irregularities within Sri Lanka Cricket. He further expressed his concerns in a press conference citing perceived threats to his life from individuals associated with the “cricket mafia” in Sri Lanka, has expressed a profound lack of trust, going so far as to raise concerns about the water supplied by the President’s office, fearing the possibility of poisoning. According to the CID report, the Sports Minister personally filed a complaint, alleging that he has received death threats from criminal elements in connection to certain issues he had recently addressed with regard to the sport of Cricket. The report additionally noted that a further report will be submitted upon completing their investigations into the complaint.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"19c2f6fd55bb8dec1051a53d776b1d5f","title":"Sports Minister and his advisors are responsible for Sri Lanka’s suspension says SLC","link":"https://www.ft.lk/sports/Sports-Minister-and-his-advisors-are-responsible-for-Sri-Lanka-s-suspension-says-SLC/23-755501","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket’s (SLC) hierarchy held the Sports Minister and his advisors responsible for the country getting suspended by the International Cricket Council (ICC) and losing the hosting rights of the Under19 World Cup in January and the ICC annual conference in July next year. The ICC on 10 November suspended SLC membership of the ICC as it was in serious breach of its obligations as a member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka. SLC President Shammi Silva who attended the ICC meeting held in Ahmedabad said that due to the suspension he was admitted to the meeting, only as an observer. Apprising the media of what took place at the meeting Silva stated: “ICC Chair Greg Barclay who is also the New Zealand Cricket’s appointment to the Board of ICC and connected to rugby said that it was not only cricket, but Sri Lanka had also been suspended by the IRB. Another ICC representative also brought it to the notice of ICC that football in Sri Lanka had also suffered the same fate being suspended by FIFA. Imran Khawaja who came to Sri Lanka as an ICC representative said that he had spoken to the Sports Minister of Sri Lanka and during the conversation it came to light that the Minister did not understand how the ICC works. The ICC said that if we cannot resolve the issue they had to take this stance of suspending Sri Lanka. They cited Zimbabwe as an example. They said that until Sri Lanka removes the interim committee, the ICC will not lift the suspension. The decisions were taken by the rest of the ICC members who unanimously decided that we should be suspended and that the U19 World Cup should be held elsewhere. The meeting went on for about 45 minutes.” “However I appealed to the ICC to allow us to host the U19 World Cup but they said that a suspended country cannot host any ICC tournaments. It was handed to South Africa to host it. Even the annual ICC conference scheduled to be held in Sri Lanka in July is in doubt.” When asked how much Sri Lanka would lose in terms of foreign exchange by not hosting the two events, Silva said that it would be around $ 100 million. However, Sri Lanka’s U19 cricketers who have been preparing for this world event for months will have the opportunity to take part in the U19 World Cup in South Africa in January as well as the U19 Asia Cup which is to be held in Bangladesh in December. “The ICC also wanted to withhold the funding,” said Silva. “I told them not to do that but to give us a controlling fund where we will send them the costs incurred to be reimbursed. They agreed to that request. When it came to cricket, I asked the ICC to allow us to play cricket otherwise, the game would collapse totally because it is followed like a religion in the country. The ICC agreed to that request too but said that they will have to take a decision in the future after reviewing what happens in the country. For now we will be allowed to play bilateral series with other countries but not be able to host any ICC tournaments.” Silva revealed that someone had sent to the ICC the SLC’s auditor general report. “After studying it the ICC said at the meeting that there was nothing wrong with the AG’s report as they had also got it reviewed by their audit department. The ICC is also accepting the fact that there hasn’t been any fraud involved.” Silva assured that Sri Lanka’s domestic and international cricket will go on as usual without any hindrance and payments to its employees, coaches, staff, players etc. will be made as usual. “We are updating the ICC on how we are using their funds so there won’t be any problem.” When it was pointed out that in previous instances the ICC had conducted its tournaments under interim committees, Silva replied, “Earlier it was allowed but after Zimbabwe was suspended in July 2019 the ICC brought a new clause, Article 2.4 that no member body of the ICC should be governed by an interim committee.” “We have been updating the ICC with what is happening with cricket in Sri Lanka because we are bound by the ICC as a full member. If the Sports Minister is alleging that the ICC is acting on the information that I am sending to them, then I must be quite a powerful person in the world body,” said Silva. Citing an example how SLC has been harassed by the Sports Minister, Silva said, “If an international tournament is to be held in Sri Lanka we have to get the permission of the Sport Minister. On 3 August we wrote to the Minister seeking his approval for the ICC Under19 World Cup, but sad to say until today, we have not received a reply from him. This is how the Minister operates on the advice of his advisors who should take full blame for the current state of affairs. This harassment began not yesterday or today but about nine months ago.”","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"e50f7d7a5e50e054a2b2a6e0402d44a4","title":"Winning start for Colombo South and Kandy","link":"https://www.ft.lk/sports/Winning-start-for-Colombo-South-and-Kandy/23-755497","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Colombo South and Kandy registered comfortable wins in their Sri Lanka Youth League under 15 cricket encounter which concluded in Colombo. This tournament is organised by Sri Lanka Cricket (SLC) and sponsored by the leading nutrition company Prima for a record 16th year in tandem. Royalist, Rehan Peiris stroked a brilliant century scoring 101 inclusive of 11 boundaries and 3 huge six’s. Meanwhile, Galle were shot out for a low 94 in reply to Colombo South score of 260 for 7 off 50 overs. Hemaru Dilshan of Holy Cross Kalutura took 5 wickets for the winning team. At MCA ground Kandy beat Dambulla by 86 runs Kandy 149 in 50 Overs Dinul Wijesinghe 53, Nethil Senanayake 21 Pudasara Premawansa 4 for 29, Kavindu Abeyrathne 2 for 20 Dambulla 63 in 35.1 overs Shenon Fernando 21 Sanjana Sachindra 2 for 14, Kenula Pihilianga 2 for 16 At D.S. Senanayake Ground Colombo South beat Galle by 166 runs Colombo South 260 for 7 in 50 overs Rehan Peiris 101, Sayhsara Nilanjith 45, Thewindu Wewelwala 31 Praveen Madushanke 2 for 26, Kavindu Nimsarana 2 for 45, Thenuja Rashmin 2 for 72 Galle 94 in 24.4 Overs Yasiru Lakshan 40 Himaru Deshan 5 for 22, Matheesha Aponso 2 for 18","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"04db2977c4d8041372a0c2c6f5c2b53c","title":"Prima and SLC propels junior cricket with “Prima Under-15 Sri Lanka Youth League” organised by SLC","link":"https://www.ft.lk/sports/Prima-and-SLC-propels-junior-cricket-with-“Prima-Under-15-Sri-Lanka-Youth-League”-organised-by-SLC/23-755498","keywords":null,"creator":null,"video_url":null,"description":null,"content":"In a significant stride towards nurturing cricket talent, Prima, a leading nutrition company has come forward as the proud sponsors of the Sri Lanka Youth League Under-15 Cricket Tournament organised by SLC. Began on 21 November, the tournament will go on till 29 November. The event aims to identify and groom the cricketing prodigies of tomorrow. The matches will take place at Royal College Ground, D.S. Senanayake College ground and Mercantile Cricket Association Ground in Colombo. Prima as a nutrition company has been supporting development of junior cricket since 2007 in collaboration with Sri Lanka Cricket (SLC) which had paved the way for talented young cricketers to represent their districts and provinces. The primary objective of the tournament is to recognise and foster promising young talent at an early stage, laying the foundation for a robust future for Sri Lankan Cricket. With the participation of teams from Galle, Kandy, Dambulla, Colombo North, and Colombo South, the competition promises to be fierce, providing a platform for young cricketers from different regions to showcase their skills and determination. What sets this tournament apart is the inclusion of players from both district and provincial teams. This diverse mix ensures that the best talent from various regions of Sri Lanka is on display, creating a competitive and enriching environment for the players. Amidst the excitement and anticipation, Prima takes centre stage as the proud sponsor of the event. Prima’s commitment to community development and youth empowerment aligns seamlessly with the objectives of the Sri Lanka Youth League Under-15 Cricket Tournament. By supporting this initiative, Prima demonstrates its dedication to fostering sportsmanship, teamwork, and leadership qualities among the youth. Prima Group Sri Lanka Ceylon Agro Industries General Manager Sajith Gunaratne said: “Prima is delighted to be associated with the Sri Lanka Youth League Under-15 cricket tournament. We believe in the power of sports to shape character, instil discipline, and foster a sense of camaraderie. This tournament provides a platform for young cricketers to showcase their talent, and we are proud to contribute to the development of the next generation of cricketing stars.” As the tournament unfolds, cricket enthusiasts and supporters alike eagerly await the emergence of new talents who will carry the Sri Lankan flag on the global cricketing stage. Prima’s sponsorship not only adds prestige to the event but also underscores the brand’s commitment to investing in the future of Sri Lankan Cricket. The Sri Lanka Youth League Under-15 Cricket Tournament, fuelled by the support of Prima, promises to be a stepping stone for young cricketers, paving the way for a brighter future for the sport in the country.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"10c51d2e06ef7f3c1f6249628c046585","title":"President blames internal conflicts for cricket downfall","link":"https://www.ft.lk/sports/President-blames-internal-conflicts-for-cricket-downfall/23-755499","keywords":null,"creator":null,"video_url":null,"description":null,"content":"President Ranil Wickremesinghe blamed internal conflicts within the cricketing community for the decline of the sport in Sri Lanka yesterday. In response to accusations of shielding specific individuals associated with the sport, Wickremesinghe in parliament remarked that concerns regarding cricket have persisted over an extended period. He attributed the decline of the sport to an enduring conflict between two factions. “To tackle this issue, we have consistently championed the implementation of a law and the formation of a suitable team in adherence to that law. In pursuit of this objective, we have utilised the Chitrasiri report as the groundwork for the proposed legislation,” he said. Wickremesinghe also emphasised the need for collective responsibility to safeguard cricket from political interference. Expressing his views President Wickremesinghe said he had cautioned the subject Minister against handling a case in a way that could lead to consequences such as losing the International Cricket Council (ICC) membership, forfeiting matches and deterring tourists. “During Cabinet discussions, the Minister sought legal representation, and we, including the former President and the Attorney General, urged the Attorney General to represent him. Subsequently, the case concluded, and I plan to request a report from the Minister to understand the details,” he said. “While unsure of the court’s verdict, I believe that in cases with disputes, decisions should be sought from the court. Regarding the current situation, I conversed with the ICC, and they expressed concerns about political interference, emphasising the need for law rather than defending individuals,” he added. The President also said that accusing judges individually over court orders is unjustified and unwarranted. “The temporary order could have been addressed the next day if necessary,” he noted. “Launching attacks under the guise of parliamentary privileges is unacceptable. There is no privilege in this context. According to the standing orders, the proposal did not receive approval. Each branch of government has its own distinct responsibilities, the court performs its functions, and so does the council,” he said.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"0904c8f4bcb05b179abb4cee329016af","title":"Australia’s World Cup triumph most streamed Kayo Sports event ever","link":"https://www.foxsports.com.au/cricket/icc-world-cup/australias-world-cup-triumph-most-streamed-kayo-sports-event-ever/news-story/360eeebf9564921c2f3b58d9e16048ec","keywords":null,"creator":null,"video_url":null,"description":"The 2023 Men’s Cricket World Cup in India was the most-watched edition of the tournament across Foxtel Group platforms, up 46 per cent on broadcast and 800 per cent on streaming from 2019.","content":"The 2023 Men’s Cricket World Cup in India was the most-watched edition of the tournament across Foxtel Group platforms, up 46 per cent on broadcast and 800 per cent on streaming from 2019. Australia won its sixth Men’s World Cup title on Sunday, defeating India by six wickets in the final at Ahmedabad’s Narendra Modi Stadium. There were 494,000 viewers on Foxtel during the tournament finale, up 225 per cent on the unforgettable 2019 final between England and New Zealand at Lord’s, while there were 2.5 million streams on Kayo Sports, making it the platform’s most-streamed event ever. Meanwhile, the highlights package of Glenn Maxwell’s record-breaking double century against Afghanistan in Mumbai raked in 317,000 views on Kayo. Watch India v Australia on Kayo Sports. Every T20 Live with no ad breaks during play. Join Kayo now and start streaming instantly > Glenn Maxwell and David Warner of Australia. Photo by Robert Cianflone/Getty Images Source: Getty Images “What a way to end an incredible World Cup,” Managing Director of Kayo Sports Julian Ogrin said in a statement. “To see so many fans stream the match as the Aussies rose to a spectacular victory, from watching the live action on Sunday night to catching up or re-watching via our Kayo Minis, it was a fantastic night for Aussie sport. “And there is plenty more cricket to come. With the most comprehensive coverage across summer, powered by the world’s best commentary team, Kayo Sports is the place to watch it all.” Australia will next face India in a five-match T20 series, which gets underway on Friday morning at 12.30am AEDT.","pubDate":"2023-11-22 22:58:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2c2f3d0d48418ab18eb61664efaed1fc","title":"Tagenarine Chanderpaul, Kavem Hodge centuries edge Windies ahead of SA A on Day two","link":"https://www.iol.co.za/sport/cricket/tagenarine-chanderpaul-kavem-hodge-centuries-edge-windies-ahead-of-sa-a-on-day-two-9f51121a-72b2-482a-96b7-7bc63fe757ad","keywords":null,"creator":["Supplied"],"video_url":null,"description":"Tagenarine Chanderpaul and Kavem Hodge scored centuries as West Indies A moved ahead of South Africa A on day two of their four-day clash in Benoni.","content":null,"pubDate":"2023-11-22 18:43:04","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/4cbee086-8eb6-5396-a833-a09186428065&operation=CROP&offset=0x55&resize=4000x2251","source_id":"iol","source_priority":32046,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"e484e53eb100fd5f74c94d5a39e2af79","title":"IND vs AUS Final: फायनलमध्ये Travis Head ने क्लीन कॅच न घेतल्याने Rohit Sharma नाबाद असल्याचा यूट्यूबवर दावा; ICC ने केली भारत-ऑस्ट्रेलिया रिमॅचची घोषणा? जाणून घ्या सत्य","link":"https://marathi.latestly.com/sports/cricket/ind-vs-aus-final-rohit-sharma-not-out-as-travis-head-doesnt-take-a-clean-catch-in-final-youtube-claims-icc-announces-india-australia-rematch-know-the-truth-508030.html","keywords":null,"creator":null,"video_url":null,"description":"विश्वचषकाच्या अंतिम फेरीत ऑस्ट्रेलियन संघाने खेळाच्या प्रत्येक विभागात भारतावर वर्चस्व गाजवले होते, यात मतभेद नसावेत. गोलंदाजी, क्षेत्ररक्षण, फलंदाजीपासून रणनीतीपर्यंत प्रत्येक विभागात ऑस्ट्रेलिया सरस होता आणि त्यामुळेच तो चॅम्पियन झाला. हे दावे फक्त लाईक्स आणि सबस्क्रिप्शनसाठी केले जात आहेत.","content":"आयसीसी क्रिकेट वर्ल्ड 2023 च्या फायनलमध्ये (World Cup 2023 Final) पॅट कमिन्सच्या नेतृत्वाखालील ऑस्ट्रेलियाने स्पर्धा जिंकून अंतिम फेरीत भारताचा पराभव करून विजेतेपद पटकावले. विश्वचषक 2023 चा अंतिम सामना संपून दोन दिवस उलटले आहेत, पण भारतीय क्रिकेट चाहते अजूनही हे मानायला तयार नाहीत की टीम इंडियाच्या हातून विश्वचषक ट्रॉफी गेली आहे. यामुळेच सोशल मीडियावर असे अनेक दावे समोर येत आहेत, ज्यामध्ये टीम इंडियावर वर्ल्ड कप फायनलमध्ये फसवणूक केल्याचा आरोप होत आहे. भारतीय क्रिकेट चाहत्यांचा एक भाग असे दावे खरे मानत आहेत आणि ते मोठ्या प्रमाणावर शेअर करत आहेत. असाच दावा रोहित शर्माच्या विकेटशी संबंधित आहे. रोहित शर्मा विश्वचषक फायनलमध्ये नाबाद असल्याच्या बातम्या सोशल मीडिया, विशेषत: यूट्यूबवरील काही अकाऊंटवरून पोस्ट करण्यात आल्या होत्या. या अहवालांमध्ये असे म्हटले आहे की, रोहितचा हा झेल ट्रॅव्हिस हेडने चुकवला होता परंतु मैदानापासून चौथ्या पंचापर्यंत कोणाच्याही याकडे लक्ष गेले नाही. या रिपोर्ट्समध्ये ट्रॅव्हिस हेडचे छायाचित्रही दाखवले जात आहे, ज्यामध्ये त्याच्या हातातून चेंडू पडताना दिसत आहे. खोटे यूट्यूब व्हिडिओ व्हायरल होत आहेत- काही यूट्यूब चॅनेलने असा दावा केला की ट्रॅव्हिस हेडचा झेल योग्य प्रकारे पूर्ण झाला नाही आणि त्यामुळे क्रिकेट विश्वचषक 2023 च्या विजेतेपदासाठी भारताचा ऑस्ट्रेलियासोबत पुन्हा सामना खेळण्यास सहमती दर्शवली आहे. यूट्यूबचे हे व्हिडिओ आता इन्स्टा आणि फेसबुकवरून अनेक सोशल मीडिया नेटवर्कवर फिरत आहेत. पण हे खरेच खरे आहे? दिशाभूल करणारी लघुप्रतिमा- अधिक दिशाभूल करणारी लघुप्रतिमा- याचे उत्तर 'नाही' असे आहे. रोहित शर्मा आऊट न झाल्याचे आणि ट्रॅव्हिस हेडने झेल गमावल्याचे सर्व दावे चुकीचे आहेत. या कॅचचा खरा व्हिडिओ पाहिल्यानंतर हे सर्वांना स्पष्ट होईल. हा व्हिडिओ सामन्यादरम्यान अनेक वेळा दाखवण्यात आला होता, ज्यामध्ये ट्रॅव्हिस हेड स्पष्टपणे कॅच घेताना दिसत होता. ट्रॅव्हिस हेडने घेतलेला झेल पूर्णपणे कायदेशीर होता आणि मैदानावरील पंचांनी त्याला मान्यता दिली होती. तपासण्यासाठी थर्ड अंपायरचीही गरज नव्हती. तसेच आयसीसीने कोणत्याही रीमॅचसाठी सहमती दर्शवली नाही. (हेही वाचा: Rohit Sharma To Not Play T20I: रोहित शर्मा नजीकच्या भविष्यात टी-20 आंतरराष्ट्रीय सामन्यात खेळण्याची शक्यता नाही, संपूर्ण बातमी येथे वाचा ) ट्रॅव्हिस हेडचा झेल अयोग्य असल्याचा दावा करणारा बनावट यूट्यूब व्हिडिओ- ट्रॅव्हिस हेडचा मूळ झेल- A post shared by ICC (@icc) विश्वचषकाच्या अंतिम फेरीत ऑस्ट्रेलियन संघाने खेळाच्या प्रत्येक विभागात भारतावर वर्चस्व गाजवले होते, यात मतभेद नसावेत. गोलंदाजी, क्षेत्ररक्षण, फलंदाजीपासून रणनीतीपर्यंत प्रत्येक विभागात ऑस्ट्रेलिया सरस होता आणि त्यामुळेच तो चॅम्पियन झाला. हे दावे फक्त लाईक्स आणि सबस्क्रिप्शनसाठी केले जात आहेत. यूट्यूबवर न्यूज चॅनेलच्या नावावर अनेक बनावट खाती आहेत, जे खोट्या बातम्या चालवून त्यांचे व्ह्यूज, लाईक्स आणि सबस्क्रिप्शन वाढवतात. आता ज्या देशात क्रिकेटची पूजा केली जाते आणि जिथे अजूनही विश्वचषकाच्या फायनलमधील भारताचा पराभव पचवण्यास अवघड जात आहे, तिथे असे खोटे दावे करून अधिक मते गोळा केली जात आहेत.","pubDate":"2023-11-22 18:36:18","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"979b960ecebf7ce57c480b943b04de74","title":"Exclusive: Sri Lanka president Ranil Wickremesinghe insists ‘Jay Shah doesn’t run Sri Lankan cricket’","link":"https://www.firstpost.com/firstcricket/sports-news/exclusive-sri-lanka-president-ranil-wickramasinghe-insists-jay-shah-doesnt-run-sri-lankan-cricket-13419342.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Exclusive: Sri Lanka president Ranil Wickremesinghe insists ‘Jay Shah doesn’t run Sri Lankan cricket’","content":"Former Sri Lanka captain Arjuna Ranatunga’s comments on BCCI secretary Jay Shah “running” Sri Lankan cricket has caused a major storm across the cricketing world, especially in cricket-mad India that happens to be a superpower of the sport. The comments have caused an uproar to the point that Sri Lanka president Ranil Wickremesinghe himself offered an apology. In an exclusive conversation with Firstpost‘s Palki Sharma, President Wickremesinghe revealed that he has since had a conversation with Shah on the matter. “No Jay Shah doesn’t run Sri Lankan cricket. They think that Jay Shah is supporting the cricket board. But I spoke to Jay Shah and felt sorry that his name had been dragged in and apologised. “He said, ‘My position is, whoever is the legal body, I will back. If this lot is the legal body I will back them. If the other lot is the legal body, I will back them. If there’s a third group that’s the legal body, I will back them. That’s not decided by me, that’s decided by ICC,” Wickremesinghe said. ﻿ Ranatunga had made the comments a day after the ICC’s suspension of Sri Lanka Cricket (SLC), the richest sporting body in the crisis-stricken island nation, due to political interference. “Because of the connection between SLC officials and Jay Shah, they (the BCCI) are under the impression that they can trample and control SLC. “Jay Shah is running Sri Lanka Cricket. SLC is being ruined because of pressure from Jay Shah. One man in India is ruining Sri Lankan cricket. He is only powerful because of his father, who is India’s home minister,” Ranatunga, who led Sri Lanka to their only ICC World Cup triumph in 1996, was quoted as saying by Sri Lankan newspaper Daily Mirror. Read | Sri Lanka apologises to Jay Shah over Arjuna Ranatunga’s ‘ridiculous’ remarks The unrest in Sri Lankan cricket began after it’s 302-run mauling at the hands of India in Mumbai’s Wankhede Stadium. The manner in which the Kusal Mendis-led side had been outplayed, getting bowled out for 55, led to Sri Lanka sports minister Roshan Ranasinghe sacking the entire SLC board shortly after and name an interim committee with Ranatunga as the head. Sri Lanka’s Court of Appeals however, stayed Ranasinghe’s decision and allowed the Shammi Silva-led board to continuing with their daily functioning. It is widely believed that the SLC itself had approached ICC to recommend its suspension due to government interference. The Sri Lankan parliament would lave unanimously pass a resolution moved by chief opposition leader Sajith Premadasa calling for the entire board to resign. The ICC would confirm its suspension of SLC following its meeting in Ahmedabad on Tuesday, and would consequently shift the 2024 U-19 World Cup out of the country and to South Africa. Read | ICC’s suspension of SLC ‘illegal’, says Sri Lanka sports minister Reacting to the ICC’s decision, President Wickramasinghe added he knew the country’s board was going to get suspended. “The opposition has said that the Board of Control has written to the ICC and has said to suspend Sri Lanka. The leader of the opposition gave me a set of letters, I haven’t looked at it. But ICC was anyway going to suspend Sri Lanka, I knew that. “We were trying to save the U-19 matches, we were going to have tourism, but that didn’t work out so we lost on all that. I am waiting to see the outcome or the decision of the courts in regard to the interim committee. Once that is done, we’ll have to start talking with the ICC to ensure that Sri Lanka can host matches again. “As far as the cricket board is concerned, there is a committee of ministers that are going to it, which will recommend legislation. They’ve spoken to the board members as well as to the interim committee members, but I want to bring legislation which will take away the power of the minister to intervene and interfere in politics,” Wickramasinghe added.","pubDate":"2023-11-22 18:31:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Ranil-Wickramasinghe-Firstpost-Exclusive-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4841f7ee844a110f647b4b83d4cf7454","title":"\"I Apologise\": Warner's Sweet Gesture Towards 'Heartbroken' Indian Fan","link":"https://sports.ndtv.com/cricket/i-apologise-david-warners-sweet-gesture-towards-heartbroken-indian-fan-4591599","keywords":null,"creator":null,"video_url":null,"description":"David Warner was Australia's leading run-getting with 535 runs in the recently concluded ODI World Cup","content":null,"pubDate":"2023-11-22 18:30:24","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"97206d1212c52c15d1a08cde046727f3","title":"CID launches investigation into death threats against Sports Minister","link":"https://www.ft.lk/sports/CID-launches-investigation-into-death-threats-against-Sports-Minister/23-755500","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Officer in Charge (OIC) of the Organised Crime Branch of the Criminal Investigations Department (CID) informed Colombo Chief Magistrate Prasanna Alwis yesterday that investigations are underway regarding alleged death threats made against the Sports Minister Roshan Ranasinghe. Ranasinghe filed a complaint with the CID last week regarding various threats directed at him recently. Security for the Minister was also heightened following his disclosure in Parliament that he had received death threats from various parties. During his address in Parliament, Ranasinghe maintained that he has been facing multiple threats as a result of his recent revelations regarding corruption, fraud, and irregularities within Sri Lanka Cricket. He further expressed his concerns in a press conference citing perceived threats to his life from individuals associated with the “cricket mafia” in Sri Lanka, has expressed a profound lack of trust, going so far as to raise concerns about the water supplied by the President’s office, fearing the possibility of poisoning. According to the CID report, the Sports Minister personally filed a complaint, alleging that he has received death threats from criminal elements in connection to certain issues he had recently addressed with regard to the sport of Cricket. The report additionally noted that a further report will be submitted upon completing their investigations into the complaint.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"19c2f6fd55bb8dec1051a53d776b1d5f","title":"Sports Minister and his advisors are responsible for Sri Lanka’s suspension says SLC","link":"https://www.ft.lk/sports/Sports-Minister-and-his-advisors-are-responsible-for-Sri-Lanka-s-suspension-says-SLC/23-755501","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket’s (SLC) hierarchy held the Sports Minister and his advisors responsible for the country getting suspended by the International Cricket Council (ICC) and losing the hosting rights of the Under19 World Cup in January and the ICC annual conference in July next year. The ICC on 10 November suspended SLC membership of the ICC as it was in serious breach of its obligations as a member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka. SLC President Shammi Silva who attended the ICC meeting held in Ahmedabad said that due to the suspension he was admitted to the meeting, only as an observer. Apprising the media of what took place at the meeting Silva stated: “ICC Chair Greg Barclay who is also the New Zealand Cricket’s appointment to the Board of ICC and connected to rugby said that it was not only cricket, but Sri Lanka had also been suspended by the IRB. Another ICC representative also brought it to the notice of ICC that football in Sri Lanka had also suffered the same fate being suspended by FIFA. Imran Khawaja who came to Sri Lanka as an ICC representative said that he had spoken to the Sports Minister of Sri Lanka and during the conversation it came to light that the Minister did not understand how the ICC works. The ICC said that if we cannot resolve the issue they had to take this stance of suspending Sri Lanka. They cited Zimbabwe as an example. They said that until Sri Lanka removes the interim committee, the ICC will not lift the suspension. The decisions were taken by the rest of the ICC members who unanimously decided that we should be suspended and that the U19 World Cup should be held elsewhere. The meeting went on for about 45 minutes.” “However I appealed to the ICC to allow us to host the U19 World Cup but they said that a suspended country cannot host any ICC tournaments. It was handed to South Africa to host it. Even the annual ICC conference scheduled to be held in Sri Lanka in July is in doubt.” When asked how much Sri Lanka would lose in terms of foreign exchange by not hosting the two events, Silva said that it would be around $ 100 million. However, Sri Lanka’s U19 cricketers who have been preparing for this world event for months will have the opportunity to take part in the U19 World Cup in South Africa in January as well as the U19 Asia Cup which is to be held in Bangladesh in December. “The ICC also wanted to withhold the funding,” said Silva. “I told them not to do that but to give us a controlling fund where we will send them the costs incurred to be reimbursed. They agreed to that request. When it came to cricket, I asked the ICC to allow us to play cricket otherwise, the game would collapse totally because it is followed like a religion in the country. The ICC agreed to that request too but said that they will have to take a decision in the future after reviewing what happens in the country. For now we will be allowed to play bilateral series with other countries but not be able to host any ICC tournaments.” Silva revealed that someone had sent to the ICC the SLC’s auditor general report. “After studying it the ICC said at the meeting that there was nothing wrong with the AG’s report as they had also got it reviewed by their audit department. The ICC is also accepting the fact that there hasn’t been any fraud involved.” Silva assured that Sri Lanka’s domestic and international cricket will go on as usual without any hindrance and payments to its employees, coaches, staff, players etc. will be made as usual. “We are updating the ICC on how we are using their funds so there won’t be any problem.” When it was pointed out that in previous instances the ICC had conducted its tournaments under interim committees, Silva replied, “Earlier it was allowed but after Zimbabwe was suspended in July 2019 the ICC brought a new clause, Article 2.4 that no member body of the ICC should be governed by an interim committee.” “We have been updating the ICC with what is happening with cricket in Sri Lanka because we are bound by the ICC as a full member. If the Sports Minister is alleging that the ICC is acting on the information that I am sending to them, then I must be quite a powerful person in the world body,” said Silva. Citing an example how SLC has been harassed by the Sports Minister, Silva said, “If an international tournament is to be held in Sri Lanka we have to get the permission of the Sport Minister. On 3 August we wrote to the Minister seeking his approval for the ICC Under19 World Cup, but sad to say until today, we have not received a reply from him. This is how the Minister operates on the advice of his advisors who should take full blame for the current state of affairs. This harassment began not yesterday or today but about nine months ago.”","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"e50f7d7a5e50e054a2b2a6e0402d44a4","title":"Winning start for Colombo South and Kandy","link":"https://www.ft.lk/sports/Winning-start-for-Colombo-South-and-Kandy/23-755497","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Colombo South and Kandy registered comfortable wins in their Sri Lanka Youth League under 15 cricket encounter which concluded in Colombo. This tournament is organised by Sri Lanka Cricket (SLC) and sponsored by the leading nutrition company Prima for a record 16th year in tandem. Royalist, Rehan Peiris stroked a brilliant century scoring 101 inclusive of 11 boundaries and 3 huge six’s. Meanwhile, Galle were shot out for a low 94 in reply to Colombo South score of 260 for 7 off 50 overs. Hemaru Dilshan of Holy Cross Kalutura took 5 wickets for the winning team. At MCA ground Kandy beat Dambulla by 86 runs Kandy 149 in 50 Overs Dinul Wijesinghe 53, Nethil Senanayake 21 Pudasara Premawansa 4 for 29, Kavindu Abeyrathne 2 for 20 Dambulla 63 in 35.1 overs Shenon Fernando 21 Sanjana Sachindra 2 for 14, Kenula Pihilianga 2 for 16 At D.S. Senanayake Ground Colombo South beat Galle by 166 runs Colombo South 260 for 7 in 50 overs Rehan Peiris 101, Sayhsara Nilanjith 45, Thewindu Wewelwala 31 Praveen Madushanke 2 for 26, Kavindu Nimsarana 2 for 45, Thenuja Rashmin 2 for 72 Galle 94 in 24.4 Overs Yasiru Lakshan 40 Himaru Deshan 5 for 22, Matheesha Aponso 2 for 18","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"04db2977c4d8041372a0c2c6f5c2b53c","title":"Prima and SLC propels junior cricket with “Prima Under-15 Sri Lanka Youth League” organised by SLC","link":"https://www.ft.lk/sports/Prima-and-SLC-propels-junior-cricket-with-“Prima-Under-15-Sri-Lanka-Youth-League”-organised-by-SLC/23-755498","keywords":null,"creator":null,"video_url":null,"description":null,"content":"In a significant stride towards nurturing cricket talent, Prima, a leading nutrition company has come forward as the proud sponsors of the Sri Lanka Youth League Under-15 Cricket Tournament organised by SLC. Began on 21 November, the tournament will go on till 29 November. The event aims to identify and groom the cricketing prodigies of tomorrow. The matches will take place at Royal College Ground, D.S. Senanayake College ground and Mercantile Cricket Association Ground in Colombo. Prima as a nutrition company has been supporting development of junior cricket since 2007 in collaboration with Sri Lanka Cricket (SLC) which had paved the way for talented young cricketers to represent their districts and provinces. The primary objective of the tournament is to recognise and foster promising young talent at an early stage, laying the foundation for a robust future for Sri Lankan Cricket. With the participation of teams from Galle, Kandy, Dambulla, Colombo North, and Colombo South, the competition promises to be fierce, providing a platform for young cricketers from different regions to showcase their skills and determination. What sets this tournament apart is the inclusion of players from both district and provincial teams. This diverse mix ensures that the best talent from various regions of Sri Lanka is on display, creating a competitive and enriching environment for the players. Amidst the excitement and anticipation, Prima takes centre stage as the proud sponsor of the event. Prima’s commitment to community development and youth empowerment aligns seamlessly with the objectives of the Sri Lanka Youth League Under-15 Cricket Tournament. By supporting this initiative, Prima demonstrates its dedication to fostering sportsmanship, teamwork, and leadership qualities among the youth. Prima Group Sri Lanka Ceylon Agro Industries General Manager Sajith Gunaratne said: “Prima is delighted to be associated with the Sri Lanka Youth League Under-15 cricket tournament. We believe in the power of sports to shape character, instil discipline, and foster a sense of camaraderie. This tournament provides a platform for young cricketers to showcase their talent, and we are proud to contribute to the development of the next generation of cricketing stars.” As the tournament unfolds, cricket enthusiasts and supporters alike eagerly await the emergence of new talents who will carry the Sri Lankan flag on the global cricketing stage. Prima’s sponsorship not only adds prestige to the event but also underscores the brand’s commitment to investing in the future of Sri Lankan Cricket. The Sri Lanka Youth League Under-15 Cricket Tournament, fuelled by the support of Prima, promises to be a stepping stone for young cricketers, paving the way for a brighter future for the sport in the country.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"10c51d2e06ef7f3c1f6249628c046585","title":"President blames internal conflicts for cricket downfall","link":"https://www.ft.lk/sports/President-blames-internal-conflicts-for-cricket-downfall/23-755499","keywords":null,"creator":null,"video_url":null,"description":null,"content":"President Ranil Wickremesinghe blamed internal conflicts within the cricketing community for the decline of the sport in Sri Lanka yesterday. In response to accusations of shielding specific individuals associated with the sport, Wickremesinghe in parliament remarked that concerns regarding cricket have persisted over an extended period. He attributed the decline of the sport to an enduring conflict between two factions. “To tackle this issue, we have consistently championed the implementation of a law and the formation of a suitable team in adherence to that law. In pursuit of this objective, we have utilised the Chitrasiri report as the groundwork for the proposed legislation,” he said. Wickremesinghe also emphasised the need for collective responsibility to safeguard cricket from political interference. Expressing his views President Wickremesinghe said he had cautioned the subject Minister against handling a case in a way that could lead to consequences such as losing the International Cricket Council (ICC) membership, forfeiting matches and deterring tourists. “During Cabinet discussions, the Minister sought legal representation, and we, including the former President and the Attorney General, urged the Attorney General to represent him. Subsequently, the case concluded, and I plan to request a report from the Minister to understand the details,” he said. “While unsure of the court’s verdict, I believe that in cases with disputes, decisions should be sought from the court. Regarding the current situation, I conversed with the ICC, and they expressed concerns about political interference, emphasising the need for law rather than defending individuals,” he added. The President also said that accusing judges individually over court orders is unjustified and unwarranted. “The temporary order could have been addressed the next day if necessary,” he noted. “Launching attacks under the guise of parliamentary privileges is unacceptable. There is no privilege in this context. According to the standing orders, the proposal did not receive approval. Each branch of government has its own distinct responsibilities, the court performs its functions, and so does the council,” he said.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"0904c8f4bcb05b179abb4cee329016af","title":"Australia’s World Cup triumph most streamed Kayo Sports event ever","link":"https://www.foxsports.com.au/cricket/icc-world-cup/australias-world-cup-triumph-most-streamed-kayo-sports-event-ever/news-story/360eeebf9564921c2f3b58d9e16048ec","keywords":null,"creator":null,"video_url":null,"description":"The 2023 Men’s Cricket World Cup in India was the most-watched edition of the tournament across Foxtel Group platforms, up 46 per cent on broadcast and 800 per cent on streaming from 2019.","content":"The 2023 Men’s Cricket World Cup in India was the most-watched edition of the tournament across Foxtel Group platforms, up 46 per cent on broadcast and 800 per cent on streaming from 2019. Australia won its sixth Men’s World Cup title on Sunday, defeating India by six wickets in the final at Ahmedabad’s Narendra Modi Stadium. There were 494,000 viewers on Foxtel during the tournament finale, up 225 per cent on the unforgettable 2019 final between England and New Zealand at Lord’s, while there were 2.5 million streams on Kayo Sports, making it the platform’s most-streamed event ever. Meanwhile, the highlights package of Glenn Maxwell’s record-breaking double century against Afghanistan in Mumbai raked in 317,000 views on Kayo. Watch India v Australia on Kayo Sports. Every T20 Live with no ad breaks during play. Join Kayo now and start streaming instantly > Glenn Maxwell and David Warner of Australia. Photo by Robert Cianflone/Getty Images Source: Getty Images “What a way to end an incredible World Cup,” Managing Director of Kayo Sports Julian Ogrin said in a statement. “To see so many fans stream the match as the Aussies rose to a spectacular victory, from watching the live action on Sunday night to catching up or re-watching via our Kayo Minis, it was a fantastic night for Aussie sport. “And there is plenty more cricket to come. With the most comprehensive coverage across summer, powered by the world’s best commentary team, Kayo Sports is the place to watch it all.” Australia will next face India in a five-match T20 series, which gets underway on Friday morning at 12.30am AEDT.","pubDate":"2023-11-22 22:58:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2c2f3d0d48418ab18eb61664efaed1fc","title":"Tagenarine Chanderpaul, Kavem Hodge centuries edge Windies ahead of SA A on Day two","link":"https://www.iol.co.za/sport/cricket/tagenarine-chanderpaul-kavem-hodge-centuries-edge-windies-ahead-of-sa-a-on-day-two-9f51121a-72b2-482a-96b7-7bc63fe757ad","keywords":null,"creator":["Supplied"],"video_url":null,"description":"Tagenarine Chanderpaul and Kavem Hodge scored centuries as West Indies A moved ahead of South Africa A on day two of their four-day clash in Benoni.","content":null,"pubDate":"2023-11-22 18:43:04","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/4cbee086-8eb6-5396-a833-a09186428065&operation=CROP&offset=0x55&resize=4000x2251","source_id":"iol","source_priority":32046,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"e484e53eb100fd5f74c94d5a39e2af79","title":"IND vs AUS Final: फायनलमध्ये Travis Head ने क्लीन कॅच न घेतल्याने Rohit Sharma नाबाद असल्याचा यूट्यूबवर दावा; ICC ने केली भारत-ऑस्ट्रेलिया रिमॅचची घोषणा? जाणून घ्या सत्य","link":"https://marathi.latestly.com/sports/cricket/ind-vs-aus-final-rohit-sharma-not-out-as-travis-head-doesnt-take-a-clean-catch-in-final-youtube-claims-icc-announces-india-australia-rematch-know-the-truth-508030.html","keywords":null,"creator":null,"video_url":null,"description":"विश्वचषकाच्या अंतिम फेरीत ऑस्ट्रेलियन संघाने खेळाच्या प्रत्येक विभागात भारतावर वर्चस्व गाजवले होते, यात मतभेद नसावेत. गोलंदाजी, क्षेत्ररक्षण, फलंदाजीपासून रणनीतीपर्यंत प्रत्येक विभागात ऑस्ट्रेलिया सरस होता आणि त्यामुळेच तो चॅम्पियन झाला. हे दावे फक्त लाईक्स आणि सबस्क्रिप्शनसाठी केले जात आहेत.","content":"आयसीसी क्रिकेट वर्ल्ड 2023 च्या फायनलमध्ये (World Cup 2023 Final) पॅट कमिन्सच्या नेतृत्वाखालील ऑस्ट्रेलियाने स्पर्धा जिंकून अंतिम फेरीत भारताचा पराभव करून विजेतेपद पटकावले. विश्वचषक 2023 चा अंतिम सामना संपून दोन दिवस उलटले आहेत, पण भारतीय क्रिकेट चाहते अजूनही हे मानायला तयार नाहीत की टीम इंडियाच्या हातून विश्वचषक ट्रॉफी गेली आहे. यामुळेच सोशल मीडियावर असे अनेक दावे समोर येत आहेत, ज्यामध्ये टीम इंडियावर वर्ल्ड कप फायनलमध्ये फसवणूक केल्याचा आरोप होत आहे. भारतीय क्रिकेट चाहत्यांचा एक भाग असे दावे खरे मानत आहेत आणि ते मोठ्या प्रमाणावर शेअर करत आहेत. असाच दावा रोहित शर्माच्या विकेटशी संबंधित आहे. रोहित शर्मा विश्वचषक फायनलमध्ये नाबाद असल्याच्या बातम्या सोशल मीडिया, विशेषत: यूट्यूबवरील काही अकाऊंटवरून पोस्ट करण्यात आल्या होत्या. या अहवालांमध्ये असे म्हटले आहे की, रोहितचा हा झेल ट्रॅव्हिस हेडने चुकवला होता परंतु मैदानापासून चौथ्या पंचापर्यंत कोणाच्याही याकडे लक्ष गेले नाही. या रिपोर्ट्समध्ये ट्रॅव्हिस हेडचे छायाचित्रही दाखवले जात आहे, ज्यामध्ये त्याच्या हातातून चेंडू पडताना दिसत आहे. खोटे यूट्यूब व्हिडिओ व्हायरल होत आहेत- काही यूट्यूब चॅनेलने असा दावा केला की ट्रॅव्हिस हेडचा झेल योग्य प्रकारे पूर्ण झाला नाही आणि त्यामुळे क्रिकेट विश्वचषक 2023 च्या विजेतेपदासाठी भारताचा ऑस्ट्रेलियासोबत पुन्हा सामना खेळण्यास सहमती दर्शवली आहे. यूट्यूबचे हे व्हिडिओ आता इन्स्टा आणि फेसबुकवरून अनेक सोशल मीडिया नेटवर्कवर फिरत आहेत. पण हे खरेच खरे आहे? दिशाभूल करणारी लघुप्रतिमा- अधिक दिशाभूल करणारी लघुप्रतिमा- याचे उत्तर 'नाही' असे आहे. रोहित शर्मा आऊट न झाल्याचे आणि ट्रॅव्हिस हेडने झेल गमावल्याचे सर्व दावे चुकीचे आहेत. या कॅचचा खरा व्हिडिओ पाहिल्यानंतर हे सर्वांना स्पष्ट होईल. हा व्हिडिओ सामन्यादरम्यान अनेक वेळा दाखवण्यात आला होता, ज्यामध्ये ट्रॅव्हिस हेड स्पष्टपणे कॅच घेताना दिसत होता. ट्रॅव्हिस हेडने घेतलेला झेल पूर्णपणे कायदेशीर होता आणि मैदानावरील पंचांनी त्याला मान्यता दिली होती. तपासण्यासाठी थर्ड अंपायरचीही गरज नव्हती. तसेच आयसीसीने कोणत्याही रीमॅचसाठी सहमती दर्शवली नाही. (हेही वाचा: Rohit Sharma To Not Play T20I: रोहित शर्मा नजीकच्या भविष्यात टी-20 आंतरराष्ट्रीय सामन्यात खेळण्याची शक्यता नाही, संपूर्ण बातमी येथे वाचा ) ट्रॅव्हिस हेडचा झेल अयोग्य असल्याचा दावा करणारा बनावट यूट्यूब व्हिडिओ- ट्रॅव्हिस हेडचा मूळ झेल- A post shared by ICC (@icc) विश्वचषकाच्या अंतिम फेरीत ऑस्ट्रेलियन संघाने खेळाच्या प्रत्येक विभागात भारतावर वर्चस्व गाजवले होते, यात मतभेद नसावेत. गोलंदाजी, क्षेत्ररक्षण, फलंदाजीपासून रणनीतीपर्यंत प्रत्येक विभागात ऑस्ट्रेलिया सरस होता आणि त्यामुळेच तो चॅम्पियन झाला. हे दावे फक्त लाईक्स आणि सबस्क्रिप्शनसाठी केले जात आहेत. यूट्यूबवर न्यूज चॅनेलच्या नावावर अनेक बनावट खाती आहेत, जे खोट्या बातम्या चालवून त्यांचे व्ह्यूज, लाईक्स आणि सबस्क्रिप्शन वाढवतात. आता ज्या देशात क्रिकेटची पूजा केली जाते आणि जिथे अजूनही विश्वचषकाच्या फायनलमधील भारताचा पराभव पचवण्यास अवघड जात आहे, तिथे असे खोटे दावे करून अधिक मते गोळा केली जात आहेत.","pubDate":"2023-11-22 18:36:18","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"979b960ecebf7ce57c480b943b04de74","title":"Exclusive: Sri Lanka president Ranil Wickremesinghe insists ‘Jay Shah doesn’t run Sri Lankan cricket’","link":"https://www.firstpost.com/firstcricket/sports-news/exclusive-sri-lanka-president-ranil-wickramasinghe-insists-jay-shah-doesnt-run-sri-lankan-cricket-13419342.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Exclusive: Sri Lanka president Ranil Wickremesinghe insists ‘Jay Shah doesn’t run Sri Lankan cricket’","content":"Former Sri Lanka captain Arjuna Ranatunga’s comments on BCCI secretary Jay Shah “running” Sri Lankan cricket has caused a major storm across the cricketing world, especially in cricket-mad India that happens to be a superpower of the sport. The comments have caused an uproar to the point that Sri Lanka president Ranil Wickremesinghe himself offered an apology. In an exclusive conversation with Firstpost‘s Palki Sharma, President Wickremesinghe revealed that he has since had a conversation with Shah on the matter. “No Jay Shah doesn’t run Sri Lankan cricket. They think that Jay Shah is supporting the cricket board. But I spoke to Jay Shah and felt sorry that his name had been dragged in and apologised. “He said, ‘My position is, whoever is the legal body, I will back. If this lot is the legal body I will back them. If the other lot is the legal body, I will back them. If there’s a third group that’s the legal body, I will back them. That’s not decided by me, that’s decided by ICC,” Wickremesinghe said. ﻿ Ranatunga had made the comments a day after the ICC’s suspension of Sri Lanka Cricket (SLC), the richest sporting body in the crisis-stricken island nation, due to political interference. “Because of the connection between SLC officials and Jay Shah, they (the BCCI) are under the impression that they can trample and control SLC. “Jay Shah is running Sri Lanka Cricket. SLC is being ruined because of pressure from Jay Shah. One man in India is ruining Sri Lankan cricket. He is only powerful because of his father, who is India’s home minister,” Ranatunga, who led Sri Lanka to their only ICC World Cup triumph in 1996, was quoted as saying by Sri Lankan newspaper Daily Mirror. Read | Sri Lanka apologises to Jay Shah over Arjuna Ranatunga’s ‘ridiculous’ remarks The unrest in Sri Lankan cricket began after it’s 302-run mauling at the hands of India in Mumbai’s Wankhede Stadium. The manner in which the Kusal Mendis-led side had been outplayed, getting bowled out for 55, led to Sri Lanka sports minister Roshan Ranasinghe sacking the entire SLC board shortly after and name an interim committee with Ranatunga as the head. Sri Lanka’s Court of Appeals however, stayed Ranasinghe’s decision and allowed the Shammi Silva-led board to continuing with their daily functioning. It is widely believed that the SLC itself had approached ICC to recommend its suspension due to government interference. The Sri Lankan parliament would lave unanimously pass a resolution moved by chief opposition leader Sajith Premadasa calling for the entire board to resign. The ICC would confirm its suspension of SLC following its meeting in Ahmedabad on Tuesday, and would consequently shift the 2024 U-19 World Cup out of the country and to South Africa. Read | ICC’s suspension of SLC ‘illegal’, says Sri Lanka sports minister Reacting to the ICC’s decision, President Wickramasinghe added he knew the country’s board was going to get suspended. “The opposition has said that the Board of Control has written to the ICC and has said to suspend Sri Lanka. The leader of the opposition gave me a set of letters, I haven’t looked at it. But ICC was anyway going to suspend Sri Lanka, I knew that. “We were trying to save the U-19 matches, we were going to have tourism, but that didn’t work out so we lost on all that. I am waiting to see the outcome or the decision of the courts in regard to the interim committee. Once that is done, we’ll have to start talking with the ICC to ensure that Sri Lanka can host matches again. “As far as the cricket board is concerned, there is a committee of ministers that are going to it, which will recommend legislation. They’ve spoken to the board members as well as to the interim committee members, but I want to bring legislation which will take away the power of the minister to intervene and interfere in politics,” Wickramasinghe added.","pubDate":"2023-11-22 18:31:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Ranil-Wickramasinghe-Firstpost-Exclusive-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4841f7ee844a110f647b4b83d4cf7454","title":"\"I Apologise\": Warner's Sweet Gesture Towards 'Heartbroken' Indian Fan","link":"https://sports.ndtv.com/cricket/i-apologise-david-warners-sweet-gesture-towards-heartbroken-indian-fan-4591599","keywords":null,"creator":null,"video_url":null,"description":"David Warner was Australia's leading run-getting with 535 runs in the recently concluded ODI World Cup","content":null,"pubDate":"2023-11-22 18:30:24","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"97206d1212c52c15d1a08cde046727f3","title":"CID launches investigation into death threats against Sports Minister","link":"https://www.ft.lk/sports/CID-launches-investigation-into-death-threats-against-Sports-Minister/23-755500","keywords":null,"creator":null,"video_url":null,"description":null,"content":"The Officer in Charge (OIC) of the Organised Crime Branch of the Criminal Investigations Department (CID) informed Colombo Chief Magistrate Prasanna Alwis yesterday that investigations are underway regarding alleged death threats made against the Sports Minister Roshan Ranasinghe. Ranasinghe filed a complaint with the CID last week regarding various threats directed at him recently. Security for the Minister was also heightened following his disclosure in Parliament that he had received death threats from various parties. During his address in Parliament, Ranasinghe maintained that he has been facing multiple threats as a result of his recent revelations regarding corruption, fraud, and irregularities within Sri Lanka Cricket. He further expressed his concerns in a press conference citing perceived threats to his life from individuals associated with the “cricket mafia” in Sri Lanka, has expressed a profound lack of trust, going so far as to raise concerns about the water supplied by the President’s office, fearing the possibility of poisoning. According to the CID report, the Sports Minister personally filed a complaint, alleging that he has received death threats from criminal elements in connection to certain issues he had recently addressed with regard to the sport of Cricket. The report additionally noted that a further report will be submitted upon completing their investigations into the complaint.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"19c2f6fd55bb8dec1051a53d776b1d5f","title":"Sports Minister and his advisors are responsible for Sri Lanka’s suspension says SLC","link":"https://www.ft.lk/sports/Sports-Minister-and-his-advisors-are-responsible-for-Sri-Lanka-s-suspension-says-SLC/23-755501","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket’s (SLC) hierarchy held the Sports Minister and his advisors responsible for the country getting suspended by the International Cricket Council (ICC) and losing the hosting rights of the Under19 World Cup in January and the ICC annual conference in July next year. The ICC on 10 November suspended SLC membership of the ICC as it was in serious breach of its obligations as a member, in particular, the requirement to manage its affairs autonomously and ensure that there is no government interference in the governance, regulation and/or administration of cricket in Sri Lanka. SLC President Shammi Silva who attended the ICC meeting held in Ahmedabad said that due to the suspension he was admitted to the meeting, only as an observer. Apprising the media of what took place at the meeting Silva stated: “ICC Chair Greg Barclay who is also the New Zealand Cricket’s appointment to the Board of ICC and connected to rugby said that it was not only cricket, but Sri Lanka had also been suspended by the IRB. Another ICC representative also brought it to the notice of ICC that football in Sri Lanka had also suffered the same fate being suspended by FIFA. Imran Khawaja who came to Sri Lanka as an ICC representative said that he had spoken to the Sports Minister of Sri Lanka and during the conversation it came to light that the Minister did not understand how the ICC works. The ICC said that if we cannot resolve the issue they had to take this stance of suspending Sri Lanka. They cited Zimbabwe as an example. They said that until Sri Lanka removes the interim committee, the ICC will not lift the suspension. The decisions were taken by the rest of the ICC members who unanimously decided that we should be suspended and that the U19 World Cup should be held elsewhere. The meeting went on for about 45 minutes.” “However I appealed to the ICC to allow us to host the U19 World Cup but they said that a suspended country cannot host any ICC tournaments. It was handed to South Africa to host it. Even the annual ICC conference scheduled to be held in Sri Lanka in July is in doubt.” When asked how much Sri Lanka would lose in terms of foreign exchange by not hosting the two events, Silva said that it would be around $ 100 million. However, Sri Lanka’s U19 cricketers who have been preparing for this world event for months will have the opportunity to take part in the U19 World Cup in South Africa in January as well as the U19 Asia Cup which is to be held in Bangladesh in December. “The ICC also wanted to withhold the funding,” said Silva. “I told them not to do that but to give us a controlling fund where we will send them the costs incurred to be reimbursed. They agreed to that request. When it came to cricket, I asked the ICC to allow us to play cricket otherwise, the game would collapse totally because it is followed like a religion in the country. The ICC agreed to that request too but said that they will have to take a decision in the future after reviewing what happens in the country. For now we will be allowed to play bilateral series with other countries but not be able to host any ICC tournaments.” Silva revealed that someone had sent to the ICC the SLC’s auditor general report. “After studying it the ICC said at the meeting that there was nothing wrong with the AG’s report as they had also got it reviewed by their audit department. The ICC is also accepting the fact that there hasn’t been any fraud involved.” Silva assured that Sri Lanka’s domestic and international cricket will go on as usual without any hindrance and payments to its employees, coaches, staff, players etc. will be made as usual. “We are updating the ICC on how we are using their funds so there won’t be any problem.” When it was pointed out that in previous instances the ICC had conducted its tournaments under interim committees, Silva replied, “Earlier it was allowed but after Zimbabwe was suspended in July 2019 the ICC brought a new clause, Article 2.4 that no member body of the ICC should be governed by an interim committee.” “We have been updating the ICC with what is happening with cricket in Sri Lanka because we are bound by the ICC as a full member. If the Sports Minister is alleging that the ICC is acting on the information that I am sending to them, then I must be quite a powerful person in the world body,” said Silva. Citing an example how SLC has been harassed by the Sports Minister, Silva said, “If an international tournament is to be held in Sri Lanka we have to get the permission of the Sport Minister. On 3 August we wrote to the Minister seeking his approval for the ICC Under19 World Cup, but sad to say until today, we have not received a reply from him. This is how the Minister operates on the advice of his advisors who should take full blame for the current state of affairs. This harassment began not yesterday or today but about nine months ago.”","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"e50f7d7a5e50e054a2b2a6e0402d44a4","title":"Winning start for Colombo South and Kandy","link":"https://www.ft.lk/sports/Winning-start-for-Colombo-South-and-Kandy/23-755497","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Colombo South and Kandy registered comfortable wins in their Sri Lanka Youth League under 15 cricket encounter which concluded in Colombo. This tournament is organised by Sri Lanka Cricket (SLC) and sponsored by the leading nutrition company Prima for a record 16th year in tandem. Royalist, Rehan Peiris stroked a brilliant century scoring 101 inclusive of 11 boundaries and 3 huge six’s. Meanwhile, Galle were shot out for a low 94 in reply to Colombo South score of 260 for 7 off 50 overs. Hemaru Dilshan of Holy Cross Kalutura took 5 wickets for the winning team. At MCA ground Kandy beat Dambulla by 86 runs Kandy 149 in 50 Overs Dinul Wijesinghe 53, Nethil Senanayake 21 Pudasara Premawansa 4 for 29, Kavindu Abeyrathne 2 for 20 Dambulla 63 in 35.1 overs Shenon Fernando 21 Sanjana Sachindra 2 for 14, Kenula Pihilianga 2 for 16 At D.S. Senanayake Ground Colombo South beat Galle by 166 runs Colombo South 260 for 7 in 50 overs Rehan Peiris 101, Sayhsara Nilanjith 45, Thewindu Wewelwala 31 Praveen Madushanke 2 for 26, Kavindu Nimsarana 2 for 45, Thenuja Rashmin 2 for 72 Galle 94 in 24.4 Overs Yasiru Lakshan 40 Himaru Deshan 5 for 22, Matheesha Aponso 2 for 18","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"04db2977c4d8041372a0c2c6f5c2b53c","title":"Prima and SLC propels junior cricket with “Prima Under-15 Sri Lanka Youth League” organised by SLC","link":"https://www.ft.lk/sports/Prima-and-SLC-propels-junior-cricket-with-“Prima-Under-15-Sri-Lanka-Youth-League”-organised-by-SLC/23-755498","keywords":null,"creator":null,"video_url":null,"description":null,"content":"In a significant stride towards nurturing cricket talent, Prima, a leading nutrition company has come forward as the proud sponsors of the Sri Lanka Youth League Under-15 Cricket Tournament organised by SLC. Began on 21 November, the tournament will go on till 29 November. The event aims to identify and groom the cricketing prodigies of tomorrow. The matches will take place at Royal College Ground, D.S. Senanayake College ground and Mercantile Cricket Association Ground in Colombo. Prima as a nutrition company has been supporting development of junior cricket since 2007 in collaboration with Sri Lanka Cricket (SLC) which had paved the way for talented young cricketers to represent their districts and provinces. The primary objective of the tournament is to recognise and foster promising young talent at an early stage, laying the foundation for a robust future for Sri Lankan Cricket. With the participation of teams from Galle, Kandy, Dambulla, Colombo North, and Colombo South, the competition promises to be fierce, providing a platform for young cricketers from different regions to showcase their skills and determination. What sets this tournament apart is the inclusion of players from both district and provincial teams. This diverse mix ensures that the best talent from various regions of Sri Lanka is on display, creating a competitive and enriching environment for the players. Amidst the excitement and anticipation, Prima takes centre stage as the proud sponsor of the event. Prima’s commitment to community development and youth empowerment aligns seamlessly with the objectives of the Sri Lanka Youth League Under-15 Cricket Tournament. By supporting this initiative, Prima demonstrates its dedication to fostering sportsmanship, teamwork, and leadership qualities among the youth. Prima Group Sri Lanka Ceylon Agro Industries General Manager Sajith Gunaratne said: “Prima is delighted to be associated with the Sri Lanka Youth League Under-15 cricket tournament. We believe in the power of sports to shape character, instil discipline, and foster a sense of camaraderie. This tournament provides a platform for young cricketers to showcase their talent, and we are proud to contribute to the development of the next generation of cricketing stars.” As the tournament unfolds, cricket enthusiasts and supporters alike eagerly await the emergence of new talents who will carry the Sri Lankan flag on the global cricketing stage. Prima’s sponsorship not only adds prestige to the event but also underscores the brand’s commitment to investing in the future of Sri Lankan Cricket. The Sri Lanka Youth League Under-15 Cricket Tournament, fuelled by the support of Prima, promises to be a stepping stone for young cricketers, paving the way for a brighter future for the sport in the country.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"10c51d2e06ef7f3c1f6249628c046585","title":"President blames internal conflicts for cricket downfall","link":"https://www.ft.lk/sports/President-blames-internal-conflicts-for-cricket-downfall/23-755499","keywords":null,"creator":null,"video_url":null,"description":null,"content":"President Ranil Wickremesinghe blamed internal conflicts within the cricketing community for the decline of the sport in Sri Lanka yesterday. In response to accusations of shielding specific individuals associated with the sport, Wickremesinghe in parliament remarked that concerns regarding cricket have persisted over an extended period. He attributed the decline of the sport to an enduring conflict between two factions. “To tackle this issue, we have consistently championed the implementation of a law and the formation of a suitable team in adherence to that law. In pursuit of this objective, we have utilised the Chitrasiri report as the groundwork for the proposed legislation,” he said. Wickremesinghe also emphasised the need for collective responsibility to safeguard cricket from political interference. Expressing his views President Wickremesinghe said he had cautioned the subject Minister against handling a case in a way that could lead to consequences such as losing the International Cricket Council (ICC) membership, forfeiting matches and deterring tourists. “During Cabinet discussions, the Minister sought legal representation, and we, including the former President and the Attorney General, urged the Attorney General to represent him. Subsequently, the case concluded, and I plan to request a report from the Minister to understand the details,” he said. “While unsure of the court’s verdict, I believe that in cases with disputes, decisions should be sought from the court. Regarding the current situation, I conversed with the ICC, and they expressed concerns about political interference, emphasising the need for law rather than defending individuals,” he added. The President also said that accusing judges individually over court orders is unjustified and unwarranted. “The temporary order could have been addressed the next day if necessary,” he noted. “Launching attacks under the guise of parliamentary privileges is unacceptable. There is no privilege in this context. According to the standing orders, the proposal did not receive approval. Each branch of government has its own distinct responsibilities, the court performs its functions, and so does the council,” he said.","pubDate":"2023-11-22 23:38:56","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"0904c8f4bcb05b179abb4cee329016af","title":"Australia’s World Cup triumph most streamed Kayo Sports event ever","link":"https://www.foxsports.com.au/cricket/icc-world-cup/australias-world-cup-triumph-most-streamed-kayo-sports-event-ever/news-story/360eeebf9564921c2f3b58d9e16048ec","keywords":null,"creator":null,"video_url":null,"description":"The 2023 Men’s Cricket World Cup in India was the most-watched edition of the tournament across Foxtel Group platforms, up 46 per cent on broadcast and 800 per cent on streaming from 2019.","content":"The 2023 Men’s Cricket World Cup in India was the most-watched edition of the tournament across Foxtel Group platforms, up 46 per cent on broadcast and 800 per cent on streaming from 2019. Australia won its sixth Men’s World Cup title on Sunday, defeating India by six wickets in the final at Ahmedabad’s Narendra Modi Stadium. There were 494,000 viewers on Foxtel during the tournament finale, up 225 per cent on the unforgettable 2019 final between England and New Zealand at Lord’s, while there were 2.5 million streams on Kayo Sports, making it the platform’s most-streamed event ever. Meanwhile, the highlights package of Glenn Maxwell’s record-breaking double century against Afghanistan in Mumbai raked in 317,000 views on Kayo. Watch India v Australia on Kayo Sports. Every T20 Live with no ad breaks during play. Join Kayo now and start streaming instantly > Glenn Maxwell and David Warner of Australia. Photo by Robert Cianflone/Getty Images Source: Getty Images “What a way to end an incredible World Cup,” Managing Director of Kayo Sports Julian Ogrin said in a statement. “To see so many fans stream the match as the Aussies rose to a spectacular victory, from watching the live action on Sunday night to catching up or re-watching via our Kayo Minis, it was a fantastic night for Aussie sport. “And there is plenty more cricket to come. With the most comprehensive coverage across summer, powered by the world’s best commentary team, Kayo Sports is the place to watch it all.” Australia will next face India in a five-match T20 series, which gets underway on Friday morning at 12.30am AEDT.","pubDate":"2023-11-22 22:58:00","image_url":null,"source_id":"foxsports","source_priority":11250,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"2c2f3d0d48418ab18eb61664efaed1fc","title":"Tagenarine Chanderpaul, Kavem Hodge centuries edge Windies ahead of SA A on Day two","link":"https://www.iol.co.za/sport/cricket/tagenarine-chanderpaul-kavem-hodge-centuries-edge-windies-ahead-of-sa-a-on-day-two-9f51121a-72b2-482a-96b7-7bc63fe757ad","keywords":null,"creator":["Supplied"],"video_url":null,"description":"Tagenarine Chanderpaul and Kavem Hodge scored centuries as West Indies A moved ahead of South Africa A on day two of their four-day clash in Benoni.","content":null,"pubDate":"2023-11-22 18:43:04","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/4cbee086-8eb6-5396-a833-a09186428065&operation=CROP&offset=0x55&resize=4000x2251","source_id":"iol","source_priority":32046,"country":["south africa"],"category":["sports"],"language":"english"},{"article_id":"e484e53eb100fd5f74c94d5a39e2af79","title":"IND vs AUS Final: फायनलमध्ये Travis Head ने क्लीन कॅच न घेतल्याने Rohit Sharma नाबाद असल्याचा यूट्यूबवर दावा; ICC ने केली भारत-ऑस्ट्रेलिया रिमॅचची घोषणा? जाणून घ्या सत्य","link":"https://marathi.latestly.com/sports/cricket/ind-vs-aus-final-rohit-sharma-not-out-as-travis-head-doesnt-take-a-clean-catch-in-final-youtube-claims-icc-announces-india-australia-rematch-know-the-truth-508030.html","keywords":null,"creator":null,"video_url":null,"description":"विश्वचषकाच्या अंतिम फेरीत ऑस्ट्रेलियन संघाने खेळाच्या प्रत्येक विभागात भारतावर वर्चस्व गाजवले होते, यात मतभेद नसावेत. गोलंदाजी, क्षेत्ररक्षण, फलंदाजीपासून रणनीतीपर्यंत प्रत्येक विभागात ऑस्ट्रेलिया सरस होता आणि त्यामुळेच तो चॅम्पियन झाला. हे दावे फक्त लाईक्स आणि सबस्क्रिप्शनसाठी केले जात आहेत.","content":"आयसीसी क्रिकेट वर्ल्ड 2023 च्या फायनलमध्ये (World Cup 2023 Final) पॅट कमिन्सच्या नेतृत्वाखालील ऑस्ट्रेलियाने स्पर्धा जिंकून अंतिम फेरीत भारताचा पराभव करून विजेतेपद पटकावले. विश्वचषक 2023 चा अंतिम सामना संपून दोन दिवस उलटले आहेत, पण भारतीय क्रिकेट चाहते अजूनही हे मानायला तयार नाहीत की टीम इंडियाच्या हातून विश्वचषक ट्रॉफी गेली आहे. यामुळेच सोशल मीडियावर असे अनेक दावे समोर येत आहेत, ज्यामध्ये टीम इंडियावर वर्ल्ड कप फायनलमध्ये फसवणूक केल्याचा आरोप होत आहे. भारतीय क्रिकेट चाहत्यांचा एक भाग असे दावे खरे मानत आहेत आणि ते मोठ्या प्रमाणावर शेअर करत आहेत. असाच दावा रोहित शर्माच्या विकेटशी संबंधित आहे. रोहित शर्मा विश्वचषक फायनलमध्ये नाबाद असल्याच्या बातम्या सोशल मीडिया, विशेषत: यूट्यूबवरील काही अकाऊंटवरून पोस्ट करण्यात आल्या होत्या. या अहवालांमध्ये असे म्हटले आहे की, रोहितचा हा झेल ट्रॅव्हिस हेडने चुकवला होता परंतु मैदानापासून चौथ्या पंचापर्यंत कोणाच्याही याकडे लक्ष गेले नाही. या रिपोर्ट्समध्ये ट्रॅव्हिस हेडचे छायाचित्रही दाखवले जात आहे, ज्यामध्ये त्याच्या हातातून चेंडू पडताना दिसत आहे. खोटे यूट्यूब व्हिडिओ व्हायरल होत आहेत- काही यूट्यूब चॅनेलने असा दावा केला की ट्रॅव्हिस हेडचा झेल योग्य प्रकारे पूर्ण झाला नाही आणि त्यामुळे क्रिकेट विश्वचषक 2023 च्या विजेतेपदासाठी भारताचा ऑस्ट्रेलियासोबत पुन्हा सामना खेळण्यास सहमती दर्शवली आहे. यूट्यूबचे हे व्हिडिओ आता इन्स्टा आणि फेसबुकवरून अनेक सोशल मीडिया नेटवर्कवर फिरत आहेत. पण हे खरेच खरे आहे? दिशाभूल करणारी लघुप्रतिमा- अधिक दिशाभूल करणारी लघुप्रतिमा- याचे उत्तर 'नाही' असे आहे. रोहित शर्मा आऊट न झाल्याचे आणि ट्रॅव्हिस हेडने झेल गमावल्याचे सर्व दावे चुकीचे आहेत. या कॅचचा खरा व्हिडिओ पाहिल्यानंतर हे सर्वांना स्पष्ट होईल. हा व्हिडिओ सामन्यादरम्यान अनेक वेळा दाखवण्यात आला होता, ज्यामध्ये ट्रॅव्हिस हेड स्पष्टपणे कॅच घेताना दिसत होता. ट्रॅव्हिस हेडने घेतलेला झेल पूर्णपणे कायदेशीर होता आणि मैदानावरील पंचांनी त्याला मान्यता दिली होती. तपासण्यासाठी थर्ड अंपायरचीही गरज नव्हती. तसेच आयसीसीने कोणत्याही रीमॅचसाठी सहमती दर्शवली नाही. (हेही वाचा: Rohit Sharma To Not Play T20I: रोहित शर्मा नजीकच्या भविष्यात टी-20 आंतरराष्ट्रीय सामन्यात खेळण्याची शक्यता नाही, संपूर्ण बातमी येथे वाचा ) ट्रॅव्हिस हेडचा झेल अयोग्य असल्याचा दावा करणारा बनावट यूट्यूब व्हिडिओ- ट्रॅव्हिस हेडचा मूळ झेल- A post shared by ICC (@icc) विश्वचषकाच्या अंतिम फेरीत ऑस्ट्रेलियन संघाने खेळाच्या प्रत्येक विभागात भारतावर वर्चस्व गाजवले होते, यात मतभेद नसावेत. गोलंदाजी, क्षेत्ररक्षण, फलंदाजीपासून रणनीतीपर्यंत प्रत्येक विभागात ऑस्ट्रेलिया सरस होता आणि त्यामुळेच तो चॅम्पियन झाला. हे दावे फक्त लाईक्स आणि सबस्क्रिप्शनसाठी केले जात आहेत. यूट्यूबवर न्यूज चॅनेलच्या नावावर अनेक बनावट खाती आहेत, जे खोट्या बातम्या चालवून त्यांचे व्ह्यूज, लाईक्स आणि सबस्क्रिप्शन वाढवतात. आता ज्या देशात क्रिकेटची पूजा केली जाते आणि जिथे अजूनही विश्वचषकाच्या फायनलमधील भारताचा पराभव पचवण्यास अवघड जात आहे, तिथे असे खोटे दावे करून अधिक मते गोळा केली जात आहेत.","pubDate":"2023-11-22 18:36:18","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"979b960ecebf7ce57c480b943b04de74","title":"Exclusive: Sri Lanka president Ranil Wickremesinghe insists ‘Jay Shah doesn’t run Sri Lankan cricket’","link":"https://www.firstpost.com/firstcricket/sports-news/exclusive-sri-lanka-president-ranil-wickramasinghe-insists-jay-shah-doesnt-run-sri-lankan-cricket-13419342.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Exclusive: Sri Lanka president Ranil Wickremesinghe insists ‘Jay Shah doesn’t run Sri Lankan cricket’","content":"Former Sri Lanka captain Arjuna Ranatunga’s comments on BCCI secretary Jay Shah “running” Sri Lankan cricket has caused a major storm across the cricketing world, especially in cricket-mad India that happens to be a superpower of the sport. The comments have caused an uproar to the point that Sri Lanka president Ranil Wickremesinghe himself offered an apology. In an exclusive conversation with Firstpost‘s Palki Sharma, President Wickremesinghe revealed that he has since had a conversation with Shah on the matter. “No Jay Shah doesn’t run Sri Lankan cricket. They think that Jay Shah is supporting the cricket board. But I spoke to Jay Shah and felt sorry that his name had been dragged in and apologised. “He said, ‘My position is, whoever is the legal body, I will back. If this lot is the legal body I will back them. If the other lot is the legal body, I will back them. If there’s a third group that’s the legal body, I will back them. That’s not decided by me, that’s decided by ICC,” Wickremesinghe said. ﻿ Ranatunga had made the comments a day after the ICC’s suspension of Sri Lanka Cricket (SLC), the richest sporting body in the crisis-stricken island nation, due to political interference. “Because of the connection between SLC officials and Jay Shah, they (the BCCI) are under the impression that they can trample and control SLC. “Jay Shah is running Sri Lanka Cricket. SLC is being ruined because of pressure from Jay Shah. One man in India is ruining Sri Lankan cricket. He is only powerful because of his father, who is India’s home minister,” Ranatunga, who led Sri Lanka to their only ICC World Cup triumph in 1996, was quoted as saying by Sri Lankan newspaper Daily Mirror. Read | Sri Lanka apologises to Jay Shah over Arjuna Ranatunga’s ‘ridiculous’ remarks The unrest in Sri Lankan cricket began after it’s 302-run mauling at the hands of India in Mumbai’s Wankhede Stadium. The manner in which the Kusal Mendis-led side had been outplayed, getting bowled out for 55, led to Sri Lanka sports minister Roshan Ranasinghe sacking the entire SLC board shortly after and name an interim committee with Ranatunga as the head. Sri Lanka’s Court of Appeals however, stayed Ranasinghe’s decision and allowed the Shammi Silva-led board to continuing with their daily functioning. It is widely believed that the SLC itself had approached ICC to recommend its suspension due to government interference. The Sri Lankan parliament would lave unanimously pass a resolution moved by chief opposition leader Sajith Premadasa calling for the entire board to resign. The ICC would confirm its suspension of SLC following its meeting in Ahmedabad on Tuesday, and would consequently shift the 2024 U-19 World Cup out of the country and to South Africa. Read | ICC’s suspension of SLC ‘illegal’, says Sri Lanka sports minister Reacting to the ICC’s decision, President Wickramasinghe added he knew the country’s board was going to get suspended. “The opposition has said that the Board of Control has written to the ICC and has said to suspend Sri Lanka. The leader of the opposition gave me a set of letters, I haven’t looked at it. But ICC was anyway going to suspend Sri Lanka, I knew that. “We were trying to save the U-19 matches, we were going to have tourism, but that didn’t work out so we lost on all that. I am waiting to see the outcome or the decision of the courts in regard to the interim committee. Once that is done, we’ll have to start talking with the ICC to ensure that Sri Lanka can host matches again. “As far as the cricket board is concerned, there is a committee of ministers that are going to it, which will recommend legislation. They’ve spoken to the board members as well as to the interim committee members, but I want to bring legislation which will take away the power of the minister to intervene and interfere in politics,” Wickramasinghe added.","pubDate":"2023-11-22 18:31:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/11/Ranil-Wickramasinghe-Firstpost-Exclusive-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4841f7ee844a110f647b4b83d4cf7454","title":"\"I Apologise\": Warner's Sweet Gesture Towards 'Heartbroken' Indian Fan","link":"https://sports.ndtv.com/cricket/i-apologise-david-warners-sweet-gesture-towards-heartbroken-indian-fan-4591599","keywords":null,"creator":null,"video_url":null,"description":"David Warner was Australia's leading run-getting with 535 runs in the recently concluded ODI World Cup","content":null,"pubDate":"2023-11-22 18:30:24","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"}]}