{"newsArray":[{"title":"'Crazy stuff': Cricket fans in disbelief over 'unreal' scenes in BBL","link":"https://au.sports.yahoo.com/bbl-2021-cricket-fans-disbelief-unreal-scenes-234224455.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-27 23:42:24","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2021-12/2c6569f0-676e-11ec-befe-2c22bd4df01a","source_id":"yahoo"},{"title":"Cricket stunned by ‘one of the best shots ever’","link":"https://www.cairnspost.com.au/sport/cricket/one-of-the-best-shots-ive-ever-seen-cricket-stunned-by-bbl-six/news-story/8d2afe692097ca251b7fdc12cc4351e3","keywords":["Big Bash News","Cricket news and galleries"],"creator":null,"video_url":null,"description":"Brisbane Heat star Ben Duckett hit what Adam Gilchrist described as “one of the best cricket strokes” ever seen.","content":null,"pubDate":"2021-12-27 23:42:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Gutless England batsmen deliver full spectrum of ineptitude","link":"https://www.theage.com.au/sport/gutless-england-batsmen-deliver-full-spectrum-of-ineptitude-20211228-p59kg9.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"In the space of one savage hour at a deafening MCG, this Ashes series resembled less a cricket contest than a blood sport.","content":null,"pubDate":"2021-12-27 22:48:23","full_description":"It is on evenings like these, when the sun slips behind the Southern Stand and Australia’s premier pacemen zero in on their quarry like slavering hyenas, that the Melbourne Cricket Ground becomes a place where few Englishmen dare to tread. The beams and columns that hold together this vast amphitheatre veritably shook as Mitchell Starc, Pat Cummins and debutant Scott Boland bombarded a pitiful excuse of a top order into helpless terror. In the space of one savage hour, this Ashes series resembled less a cricket contest than a blood sport, a ritualised horror from which nobody could look away. At 5.37pm local time, Zak Crawley and Haseeb Hameed entered the crucible with a chance, however slender, to back up the bowlers’ unstinting efforts in limiting Australia to 267. Come 6.37, they had both succumbed to the onslaught, joined by Dawid Malan and Jack Leach in the chamber of doom that doubles as England’s dressing room. A Melburnian crowd fortified as much by Victoria Bitter as by the haplessness of the Poms revelled in the casual sadism of it all. While they had girded themselves for a tense duel at sundown, they should have known better. This is an England side made up less of stout hearts than of sacrificial lambs. We are only halfway through, but already a five-Test tour has become a one-way ticket to perdition. Even when set against their whitewashed predecessors, this England crop are delivering the full spectrum of ineptitude. Long before Hameed departed for seven, he had been a picture of agitation at the crease, padding up to a Cummins delivery that nipped back viciously. The MCG’s sprawling outfield condemned him to the longest, loneliest walk as he fell in single figures for the fourth consecutive innings. His selection for the tour has been an absurd folly, a gift-wrapped wicket for an attack of Australia’s quality. The MCG was rocking during Australia’s late evening bowling spell. Credit: Getty Against Cummins and Starc, he came across less as a poised opener than a helpless rabbit, ready to be devoured by the two towering seamers peppering him without mercy. Both are fearsome talents: always accurate, genuinely quick, and never happier than with the shiny red Kookaburra ball in their hands. But Hameed is so dismal, he can make even the rookie Boland look like Dennis Lillee. Until this week, the 32-year-old was a relatively obscure player from Melbourne’s south-eastern suburbs. He was once known as the “Barrel”, criticised by his local club for being sloppy and overweight. But he still made short work of Hameed, squaring him up for the outside edge. A couple of minutes later, having clipped the top of Leach’s off stump, he was toasting a double-wicket maiden. It would be difficult to script a grislier day than the fate that befell England here. Every time you think they cannot possibly dig themselves any deeper, they find fresh ways to confound. After a first-innings capitulation for 185, Michael Vaughan said that “the only thing they’ve got right is to turn up on time”. No sooner did he make that remark than they contrived to turn up 30 minutes late. In mitigation, it was not exactly their fault, given their arrival at the ground was delayed by the discovery of four positive Covid-19 cases in the camp. The only consolation was that the players remained negative. Mitchell Starc celebrates another wicket. Credit: AP Alas, England have gone so far down the laughing-stock route that cruel jokes began circulating that this team, dogged by poor fielding throughout the tour, could not even catch a virus. For one brief mid-afternoon spell, it seemed as if a re-energised James Anderson might arrest the demise. Telling Anderson he needs to be “braver” is akin to tweaking the tail of a saltwater crocodile, sure to trigger a response both instant and savage. Seething at Joe Root’s suggestion that he was struggling to hit the right lengths, England’s ageless seamer channelled his fury as only he knew, producing not just his team’s first four-wicket haul but a precious reassurance that the team still had players who could fight. Sadly, the batting line-up’s implosion rendered his contribution futile. When pressed on their latest failure, he did well to bite his tongue. England's Haseeb Hameed walks off after he was dismissed by Australia's Scott Boland during the second day of their cricket test match in Melbourne, Australia, Monday, Dec. 27, 2021. (AP Photo/Asanka Brendon Ratnayake) Credit: Asanka Brendon Ratnayake/AP Photo By the close, a 43,000-strong crowd was drunk on English suffering. The humiliation was perhaps expressed best when, with Leach skittled second ball, no batsman emerged on the field to replace him. Was this officially the white flag of surrender? Not quite, as Ben Stokes eventually materialised for another walk-on role in this ghastly vaudeville. Even though their gutlessness with the bat knows no bounds, they must take their punishment for another 2½ weeks yet. As England explored the extremes of their own incompetence, it was the final hour of this second day in Melbourne that held up the clearest mirror to the malaise. They had spent all afternoon toiling to retrieve the apparently irretrievable, but in 60 madcap minutes they threw it all away again. This was Ashes cricket at its wildest, loudest and most perversely thrilling. Sadly for England, it was an intensity with which they could not live. Their collapse, cheered by the baying masses, was one to encapsulate the bleakest farce. Daily Telegraph","image_url":null,"source_id":"theage"},{"title":"Gutless England batsmen deliver full spectrum of ineptitude","link":"https://www.smh.com.au/sport/gutless-england-batsmen-deliver-full-spectrum-of-ineptitude-20211228-p59kg9.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"In the space of one savage hour at a deafening MCG, this Ashes series resembled less a cricket contest than a blood sport.","content":null,"pubDate":"2021-12-27 22:48:23","full_description":"It is on evenings like these, when the sun slips behind the Southern Stand and Australia’s premier pacemen zero in on their quarry like slavering hyenas, that the Melbourne Cricket Ground becomes a place where few Englishmen dare to tread. The beams and columns that hold together this vast amphitheatre veritably shook as Mitchell Starc, Pat Cummins and debutant Scott Boland bombarded a pitiful excuse of a top order into helpless terror. In the space of one savage hour, this Ashes series resembled less a cricket contest than a blood sport, a ritualised horror from which nobody could look away. At 5.37pm local time, Zak Crawley and Haseeb Hameed entered the crucible with a chance, however slender, to back up the bowlers’ unstinting efforts in limiting Australia to 267. Come 6.37, they had both succumbed to the onslaught, joined by Dawid Malan and Jack Leach in the chamber of doom that doubles as England’s dressing room. A Melburnian crowd fortified as much by Victoria Bitter as by the haplessness of the Poms revelled in the casual sadism of it all. While they had girded themselves for a tense duel at sundown, they should have known better. This is an England side made up less of stout hearts than of sacrificial lambs. We are only halfway through, but already a five-Test tour has become a one-way ticket to perdition. Even when set against their whitewashed predecessors, this England crop are delivering the full spectrum of ineptitude. Long before Hameed departed for seven, he had been a picture of agitation at the crease, padding up to a Cummins delivery that nipped back viciously. The MCG’s sprawling outfield condemned him to the longest, loneliest walk as he fell in single figures for the fourth consecutive innings. His selection for the tour has been an absurd folly, a gift-wrapped wicket for an attack of Australia’s quality. The MCG was rocking during Australia’s late evening bowling spell. Credit: Getty Against Cummins and Starc, he came across less as a poised opener than a helpless rabbit, ready to be devoured by the two towering seamers peppering him without mercy. Both are fearsome talents: always accurate, genuinely quick, and never happier than with the shiny red Kookaburra ball in their hands. But Hameed is so dismal, he can make even the rookie Boland look like Dennis Lillee. Until this week, the 32-year-old was a relatively obscure player from Melbourne’s south-eastern suburbs. He was once known as the “Barrel”, criticised by his local club for being sloppy and overweight. But he still made short work of Hameed, squaring him up for the outside edge. A couple of minutes later, having clipped the top of Leach’s off stump, he was toasting a double-wicket maiden. It would be difficult to script a grislier day than the fate that befell England here. Every time you think they cannot possibly dig themselves any deeper, they find fresh ways to confound. After a first-innings capitulation for 185, Michael Vaughan said that “the only thing they’ve got right is to turn up on time”. No sooner did he make that remark than they contrived to turn up 30 minutes late. In mitigation, it was not exactly their fault, given their arrival at the ground was delayed by the discovery of four positive Covid-19 cases in the camp. The only consolation was that the players remained negative. Mitchell Starc celebrates another wicket. Credit: AP Alas, England have gone so far down the laughing-stock route that cruel jokes began circulating that this team, dogged by poor fielding throughout the tour, could not even catch a virus. For one brief mid-afternoon spell, it seemed as if a re-energised James Anderson might arrest the demise. Telling Anderson he needs to be “braver” is akin to tweaking the tail of a saltwater crocodile, sure to trigger a response both instant and savage. Seething at Joe Root’s suggestion that he was struggling to hit the right lengths, England’s ageless seamer channelled his fury as only he knew, producing not just his team’s first four-wicket haul but a precious reassurance that the team still had players who could fight. Sadly, the batting line-up’s implosion rendered his contribution futile. When pressed on their latest failure, he did well to bite his tongue. England's Haseeb Hameed walks off after he was dismissed by Australia's Scott Boland during the second day of their cricket test match in Melbourne, Australia, Monday, Dec. 27, 2021. (AP Photo/Asanka Brendon Ratnayake) Credit: Asanka Brendon Ratnayake/AP Photo By the close, a 43,000-strong crowd was drunk on English suffering. The humiliation was perhaps expressed best when, with Leach skittled second ball, no batsman emerged on the field to replace him. Was this officially the white flag of surrender? Not quite, as Ben Stokes eventually materialised for another walk-on role in this ghastly vaudeville. Even though their gutlessness with the bat knows no bounds, they must take their punishment for another 2½ weeks yet. As England explored the extremes of their own incompetence, it was the final hour of this second day in Melbourne that held up the clearest mirror to the malaise. They had spent all afternoon toiling to retrieve the apparently irretrievable, but in 60 madcap minutes they threw it all away again. This was Ashes cricket at its wildest, loudest and most perversely thrilling. Sadly for England, it was an intensity with which they could not live. Their collapse, cheered by the baying masses, was one to encapsulate the bleakest farce. Daily Telegraph","image_url":null,"source_id":"smh"},{"title":"Ashes 2021-22 third Test, day three: Australia v England – live!","link":"https://www.theguardian.com/sport/live/2021/dec/28/ashes-2021-22-australia-vs-england-day-three-3-cricket-3rd-third-boxing-day-test-live-score-card-aus-v-eng-start-time-latest-updates","keywords":["Ashes 2021-22","The Ashes","Cricket","Australia cricket team","England cricket team","Australia sport","Sport","Over by over reports"],"creator":["Jonathan Howcroft (now) and Rob Smyth (later)"],"video_url":null,"description":"Start time for the Boxing Day Test is 10:30am local, 11:30pm GMTSpectre of Covid looms over AshesThe Spin: subscribe to our weekly cricket newsletterAny thoughts? Email or tweet @JPHowcroftHello everybody and welcome to live over-by-over coverage of day three of the Boxing Day Ashes Test. We’re underway at the Melbourne Cricket Ground at 10.30am local time (11.30pm UK).Just like Australia’s attack slicing into England’s middle order, we’re going to bypass any opening pleasantries and dive straight into news this morning. Following yesterday’s Covid outbreak in the England camp, further cases have been identified in the touring party following PCR tests, but for now, the match, and the series continues.Asked on Monday if the tour was in danger, Nick Hockley, chief executive of Cricket Australia, replied: “No. This is what the protocols are for. We are being extra vigilant as there are increasing cases in the community but our protocols are designed for absolutely this set of events. Continue reading...","content":null,"pubDate":"2021-12-27 22:08:51","full_description":"To get you up to speed on where we are in this fast-moving Test, here’s Ali Martin’s report from stumps on day two. Root, who reached the close 12 not out with Ben Stokes for company, may well be reaching the point where he is done with the burdens of captaincy. And not least after a day when, despite news that two coaches and two family members in the touring party had tested positive for Covid‑19, his side displayed renewed fight on this green MCG pitch, only for this to then be undone by a top order still made of balsa wood. Hello everybody and welcome to live over-by-over coverage of day three of the Boxing Day Ashes Test. We’re underway at the Melbourne Cricket Ground at 10.30am local time (11.30pm UK). Just like Australia’s attack slicing into England’s middle order, we’re going to bypass any opening pleasantries and dive straight into news this morning. Following yesterday’s Covid outbreak in the England camp, further cases have been identified in the touring party following PCR tests, but for now, the match, and the series continues. Covid Ashes: England's afflicted has in fact risen by two ... now sits at 3 x support staff and 3 x family members ... but game/tour on for now with all others returning negative PCR test results Here’s Ali Martin’s report from this morning. There will doubtless be more news filtering out of the MCG as the day goes on as contingencies are discussed regarding the final two Tests of the tour. Asked on Monday if the tour was in danger, Nick Hockley, chief executive of Cricket Australia, replied: “No. This is what the protocols are for. We are being extra vigilant as there are increasing cases in the community but our protocols are designed for absolutely this set of events. I’ll be back with more shortly, but if you would like to join in, you can reach me by email or Twitter ( @JPHowcroft ).","image_url":"https://i.guim.co.uk/img/media/1282f207df5455ba019a065b2a70c7b876edb099/0_179_2689_1614/master/2689.jpg?width=460&quality=85&auto=format&fit=max&s=b53f5a20c707f2e8c8f49563e136f7bf","source_id":"theguardian"},{"title":"Cricket stunned by ‘one of best shots ever’","link":"https://www.news.com.au/sport/cricket/one-of-the-best-shots-ive-ever-seen-cricket-stunned-by-bbl-six/news-story/8d2afe692097ca251b7fdc12cc4351e3","keywords":null,"creator":null,"video_url":null,"description":"Brisbane Heat star Ben Duckett hit what Adam Gilchrist described as “one of the best cricket strokes” ever seen.","content":null,"pubDate":"2021-12-27 22:08:00","full_description":"Brisbane Heat star Ben Duckett hit what Adam Gilchrist described as “one of the best cricket strokes” ever seen. Duckett hit three reverse sweep boundaries against Melbourne Stars bowler Qaid Ahmad at the Gabba on Monday night. But it was the third - which went for six - that grabbed the attention of Australian cricket legend Gilchrist. Watch every game of the KFC Big Bash League Live & On-Demand on Kayo or catch up for FREE with minis on Kayo Freebies. Join Kayo Now > “That’s one of the best cricket strokes I’ve ever seen,” Gilchrist said on the Fox Cricket commentary. “We talk about getting momentum through the ball, so typically if you’re playing a reverse as opposed to a natural sweep shot where your body is moving towards where you want it to go, he’s so quick to switch around his body position. “He throws himself into it, uses every bit of power, every bit of strength. He almost hits down on it, just cuts underneath and dismisses it. “He switches and then watch his body move, the upper torso really leans into it, he keeps the head over the ball and moving towards where he wants to go.” Former England captain Michael Vaughan was also in the commentary box and was left just as captivated by the shot. “There’s two fielders on that boundary but he doesn’t have any concerns because he knows if he gets it,” Vaughan said. “It’s everything. It’s the movement, it’s the timing, it’s the body turning into the shot and then it’s the wrist, breaking the wrists and getting absolutely everything spot on with your timing. “This is a player that would have practised that shot for hours and hours and hours and it’s just like playing a forward defence or a cover drive for many other players, that shot for him is bread and butter.” Fox Cricket commentator Mark Howard called it “the shot of the season” but his teammate Chris Lynn put forward another contender moments later. Lord. Ben Duckett. Reverse sweep six. Insanity. Lynn - whose strike rate at the Gabba is a whopping 166 - pulled one that crashed into the scoreboard on the second level at the Gabba. The ball travelled 106 metres. “High into the night sky and way back from Christopher Lynn, way back,” Howard said. Vaughan added: “Oh that’s huge. This is a real test for Brodie Couch… he’s up against one of the greats of the Big Bash and you can’t bowl there to Chris Lynn.” The Stars won the match by 20 runs . Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . Originally published as ‘One of the best shots I’ve ever seen’: Cricket stunned by BBL six More members of the England camp have tested positive to Covid-19 after an earlier coronavirus scare delayed play on day two. Australia’s 12-over assault on England late on day two was the most ruthless since records began. Live coverage inside. Fringe Australian white-ball star Ben McDermott has sent a timely reminder that he still has what it takes in another T20 World Cup year.","image_url":null,"source_id":"news"},{"title":"Cricket-England and Australia cleared to play after negative tests","link":"https://www.thestar.com.my/sport/cricket/2021/12/28/cricket-england-and-australia-cleared-to-play-after-negative-tests","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - England and Australia’s cricketers have been cleared to play day three of the third Ashes test in Melbourne after all testing negative for COVID-19, Cricket Australia said on Monday. Read full story","content":null,"pubDate":"2021-12-27 21:59:00","full_description":"MELBOURNE (Reuters) -England and Australia’s cricketers have been cleared to play day three of the third Ashes test in Melbourne after all testing negative for COVID-19, governing body Cricket Australia (CA) said on Tuesday. \"The families of both sets of players also had PCR tests yesterday and all returned a negative test,\" CA said in a statement. The players undertook PCR tests after two England support staff and two of their family members tested positive this week and were forced into isolation. England were cleared to play day two on Monday at the Melbourne Cricket Ground after taking rapid antigen tests. Day three starts at 10:30 a.m. local time (2330 GMT). England will resume at 31 for four in the their second innings, needing 51 runs to make Australia bat again. Holders Australia, 2-0 up in the series after winning in Brisbane and Adelaide, need only draw the match in Melbourne to retain the urn. (Reporting by Ian Ransom, Editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/28/1422335.jpg","source_id":"thestar_my"},{"title":"Boxing Day Test to continue as scheduled at the MCG after England and Australian players test negative ahead of day three - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIxLTEyLTI4L21jZy10ZXN0LWFsbC1jbGVhci1wbGF5ZXJzLWZyb20tYm90aC1zaWRlcy10ZXN0LW5lZ2F0aXZlLWNvdmlkLzEwMDcyNzc1NtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Boxing Day Test to continue as scheduled at the MCG after England and Australian players test negative ahead of day three  ABC NewsCovid outbreak grows in England Ashes camp  NEWS.com.auAshes 2021 LIVE: Michael Vaughan suggests Cricket Australia to hold remaining Sydney & Hobart Tests at MCG, Melbourne amid COVID scare  InsideSportEnglish cricket team COVID scare delays day two of MCG Ashes Test after support staff, family members test positive  ABC NewsChannel 7 commentary team rocked by Covid  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-27 21:07:30","image_url":null,"source_id":"google"},{"title":"Players test negative, Boxing Day Test gets go ahead to continue","link":"https://www.theage.com.au/sport/cricket/players-test-negative-boxing-day-test-gets-go-ahead-to-continue-20211228-p59kfd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"Australian cricket authorities are breathing a sigh of relief after players from both sides all returned negative COVID tests, paving the way for the Boxing Day Test to continue.","content":null,"pubDate":"2021-12-27 21:05:09","full_description":"Australian cricket authorities are breathing a sigh of relief after players from both sides all returned negative COVID-19 tests, paving the way for the Boxing Day Test to continue on Tuesday. The families of players from both sides all returned negative tests as well. Australia are well-placed to seal victory in Melbourne and wrap up an Ashes series success after dominating the first two days of play. “Players from the Australian and England teams all had PCR COVID-19 Tests after play yesterday and all results have come back negative,” Cricket Australia said in a statement issued on Tuesday morning, less than three hours before play was scheduled to resume. “The families of both sets of players also had PCR tests yesterday and all returned a negative test. “The England team’s support staff and their family members who tested positive after PCR tests yesterday are in isolation. “Play in the third Vodafone men’s Ashes Test match resumes at the MCG at 10.30am today.“ CA’s focus off the field now turns to saving the New Year’s Test in Sydney and the final game of the series in Hobart, with the Ashes hanging precariously due to the current regulations in place in NSW and Tasmania regarding COVID-19 close contacts. There had been serious fears among cricket officials overnight that the Boxing Day Test was at risk of being abandoned. One member of the England camp had reported symptoms on Sunday night and by the following morning four people had tested positive to COVID. Play was delayed by half an hour on Monday as all players in the England side underwent rapid antigen tests, which were negative. MORE TO COME","image_url":null,"source_id":"theage"},{"title":"Players test negative, Boxing Day Test gets go ahead to continue","link":"https://www.smh.com.au/sport/cricket/players-test-negative-boxing-day-test-gets-go-ahead-to-continue-20211228-p59kfd.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"Australian cricket authorities are breathing a sigh of relief after players from both sides all returned negative COVID tests, paving the way for the Boxing Day Test to continue.","content":null,"pubDate":"2021-12-27 21:05:09","full_description":"Australian cricket authorities are breathing a sigh of relief after players from both sides all returned negative COVID-19 tests, paving the way for the Boxing Day Test to continue on Tuesday. The families of players from both sides all returned negative tests as well. Australia are well-placed to seal victory in Melbourne and wrap up an Ashes series success after dominating the first two days of play. “Players from the Australian and England teams all had PCR COVID-19 Tests after play yesterday and all results have come back negative,” Cricket Australia said in a statement issued on Tuesday morning, less than three hours before play was scheduled to resume. “The families of both sets of players also had PCR tests yesterday and all returned a negative test. “The England team’s support staff and their family members who tested positive after PCR tests yesterday are in isolation. “Play in the third Vodafone men’s Ashes Test match resumes at the MCG at 10.30am today.“ CA’s focus off the field now turns to saving the New Year’s Test in Sydney and the final game of the series in Hobart, with the Ashes hanging precariously due to the current regulations in place in NSW and Tasmania regarding COVID-19 close contacts. There had been serious fears among cricket officials overnight that the Boxing Day Test was at risk of being abandoned. One member of the England camp had reported symptoms on Sunday night and by the following morning four people had tested positive to COVID. Play was delayed by half an hour on Monday as all players in the England side underwent rapid antigen tests, which were negative. MORE TO COME","image_url":null,"source_id":"smh"},{"title":"Stars back on winners list after halting Heat comeback | BBL|11 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9NWpDS3B4MEdfOG_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Stars back on winners list after halting Heat comeback | BBL|11  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-27 20:00:27","image_url":null,"source_id":"google"},{"title":"NZ-XI vs BAN Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Bangladesh’s Tour of New Zealand, Other Test","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nz-xi-vs-ban-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-bangladesh-s-tour-new-zealand-other-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-27 19:26:35","full_description":"New Zealand XI will take on Bangladesh in the unofficial Test of Bangladesh’s tour of New Zealand at the Bay Oval in Mount Maunganui on Tuesday. New Zealand XI will welcome Bangladesh on their tour of the country with a two-day warm-up game that begins on Tuesday. Experienced campaigners, Neil Wagner and Devon Conway, will feature in this game. It will be an interesting opportunity for the youngsters to showcase their talents. Bangladesh, meanwhile, will look to acclimatise quickly to the conditions in New Zealand. Their squad looks balanced, and they will try to build momentum from this game. Maara Ave, Jakob Bhula, Jack Boyle, Devon Conway, Jacob Cumming, Joey Field, Jarrod Mckay, Tim Pringle, Brett Randell, Mitch Renwick, Tim Robinson, Neil Wagner. Mominul Haque (c), Khaled Ahmed, Taskin Ahmed, Yasir Ali, Liton Das, Mahmudul Hasan Joy, Mehidy Hasan, Nurul Hasan, Ebadot Hossain, Shadman Islam, Shohidul Islam, Taijul Islam, Abu Jayed, Fazle Mahmud, Mohammad Naim, Mushfiqur Rahim, Najmul Hossain Shanto. Match: NZ-XI vs BAN, Bangladesh’s Tour of New Zealand, Unofficial Test. Date and Time: 28th December, 2021; 3:30 AM IST. Venue: Bay Oval, Mount Maunganui. The surface is balanced, so both batters and bowlers are expected to find assistance. Both teams might opt to bat first to test their strengths in this warm-up game. Devon Conway missed the T20I and the Test series against India due to a hand injury. Getting back to fitness will be his primary objective in this game. Conway has shown plenty of promise in the early days of his Test career. He currently averages 63.17 in the format. Meanwhile, Liton Das had a strong showing in the recent Test series against Pakistan. He scored a century and a half-century in one game. Das averages 32.28 in 27 Tests. Mushfiqur Rahim is one of the most experienced players in the Bangladesh camp. The 34-year-old has scored 4856 runs in 77 Tests, and he has an average of 36.79. Moninul Haque had poor outings against Pakistan, failing to cross the single-digit mark. However, there is no doubt about his quality, and he’s one good knock away from returning to form. He has scored 3363 runs in 47 Tests at an average of 41.01. Neil Wagner’s pace and lengths are always difficult to deal with, especially in New Zealand conditions. He has 229 wickets to his name in 54 Test matches. Devon Conway (NZ-XI). Mushfiqur Rahim (BAN). Neil Wagner (NZ-XI) . Liton Das (BAN). Mominul Haque (BAN). Devon Conway: 379 runs in 3 Tests. Mushfiqur Rahim: 4856 runs in 77 Tests. Neil Wagner: 229 wickets in 54 Tests. Liton Das: 1453 runs in 27 Tests. Mominul Haque: 3363 runs in 47 Tests. Fantasy Suggestion #1: Devon Conway, Liton Das, Jakob Bhula, Mitch Renwick, Mushfiqur Rahim, Brett Randell, Mehidy Hasan Miraz, Mominul Haque, Neil Wagner, Taijul Islam, Taskin Ahmed. Captain: Devon Conway. Vice-Captain: Mushfiqur Rahim. Fantasy Suggestion #2: Devon Conway, Liton Das, Jakob Bhula, Mitch Renwick, Mushfiqur Rahim, Najmul Hossain-Shanto, Brett Randell, Mominul Haque, Neil Wagner, Tim Pringle, Taskin Ahmed. Captain: Neil Wagner. Vice-Captain: Liton Das.","image_url":"https://static.sportskeeda.com/editor/2021/12/02fcb-16406270855423-1920.jpg","source_id":"sportskeeda"},{"title":"OV vs WF Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Super Smash 2021/22, Match 15","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ov-vs-wf-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-super-smash-2021-22-match-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-27 19:26:35","full_description":"Otago Volts will take on Wellington Firebirds in the 15th match of the Super Smash 2021/22 at the John Davies Oval in Queenstown on Tuesday. Otago Volts have been far from their usual best in this season’s Super Smash. They have lost two games on the bounce against Canterbury and Central Stags and are currently fifth in the table with six points to their name. Wellington Firebirds also haven’t had a great campaign so far. They’ve lost three successive games and with just one win, they are bottom of the table. OV XI Hamish Rutherford (c), Josh Tasman Jones, Neil Broom, Nick Kelly, Anaru Kitchen, Llew Johnson, Michael Rippon, Max Chu (wk), Angus Mckenzie, Jacob Duffy, Matthew Bacon WF XI Finn Allen (wk), Tim Robinson, Logan Van Beek, Troy Johnson, Michael Bracewell (c), Jimmy Neesham, Jamie Gibson/Nathan Smith, Peter Younghusband, Ollie Newton, Ben Sears, Hamish Bennett OV vs WF, Super Smash 2021/22, Match 15 Date and Time: 28th December, 2021, 7:10 AM IST Venue: John Davies Oval, Queenstown The surface is pretty well-balanced and has something in it for both bowlers and batters. Batting first will be a good option on this wicket. Wicketkeeper Finn Allen’s game of calculative risk-taking is a treat to watch. The youngster can smash opposition bowlers for fun. He has scored 77 runs in the last three matches at a strike rate of 192.5. Batters Michael Bracewell brings plenty of value to the table. He has scored 105 runs at an average of 52.5 and has also picked up three wickets so far. Hamish Rutherford has lived up to his responsibilities quite well. He has scored 159 runs in four games so far and has an average of 39.75. All-rounders Logan van Beek is a proven match-winner who is expected to have a major impact in this contest as well. Not only has he scored 100 runs in three games at an average of 50, he has also picked up five wickets. Van Beek can prove to be a fine multiplier choice for your OV vs WF Dream11 fantasy side. Bowlers Ben Sears has been consistent in recent matches. He has picked up five wickets in the last two matches. Logan van Beek (OV) – 311 points Michael Bracewell (OV) – 271 points Hamish Rutherford (OV) – 264 points Anaru Kitchen (OV) – 226 points Michael Rippon (OV) – 214 points Logan van Beek: 100 runs and 5 wickets Michael Bracewell: 105 runs and 3 wickets Hamish Rutherford: 159 runs Neil Broom: 101 runs Finn Allen: 77 runs Fantasy Suggestion #1: Finn Allen, Michael Bracewell, Hamish Rutherford, Neil Broom, Logan van Beek, Anaru Kitchen, Michael Rippon, Ben Sears, Jacob Duffy, Matthew Bacon, Hamish Bennett Captain: Logan van Beek , Vice-Captain: Michael Bracewell Fantasy Suggestion #2: Finn Allen, Michael Bracewell, Hamish Rutherford, Neil Broom, Logan van Beek, Anaru Kitchen, Peter Younghusband, Michael Rippon, Ben Sears, Jacob Duffy, Hamish Bennett Captain: Anaru Kitchen , Vice-Captain: Finn Allen","image_url":"https://static.sportskeeda.com/editor/2021/12/cafcd-16406299609379-1920.jpg","source_id":"sportskeeda"},{"title":"OS-W vs WB-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Women’s Super Smash 2021-22, Match 15","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/os-w-vs-wb-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-women-s-super-smash-2021-22-match-15?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-27 19:26:35","full_description":"Otago Sparks Women (OS-W) will take on Wellington Blaze Women (WB-W) in the 15th match of the Super Smash 2021-22 at the John Davies Oval in Queenstown on Tuesday. Otago Sparks are going through a purple patch at the moment. They’ve won all of their five matches so far, and sitting atop the points table with 20 points. Star player Suzie Bates has been in majestic form, and is likely to play a key role in this game as well. Meanwhile, Wellington Blaze have also been in good form in the tournament, and are yet to lose a game as well. They are second in the points standings with 16 points. So an interesting clash should ensue between the two undefeated teams thus far. Suzie Bates (c), Polly Inglis, Katey Martin (wk), Kate Ebrahim, Caitlin Blakely, Bella James, Olivia Gain, Eden Carson, Emma Black, Sophie Oldershaw, Molly Loe. Rebecca Burns, Georgia Plimmer, Amelia Kerr, Maddy Green (c), Thamsyn Newton, Jess Kerr, Leigh Kasperek, Jessica McFadyen (wk), Xara Jetly, Deanna Doughty, Maneka Singh. Match: OS-W vs WB-W, Super Smash 2021/22, Match 15. Date and Time: 28th December, 2021; 3:40 AM IST. Venue: John Davies Oval, Queenstown. The surface is pretty balanced, and has something in it for both bowlers and batters. Batting first should be a good option on this wicket. Katey Martin is a great wicketkeeper choice for your Dream11 Fantasy side. She has been in great form in recent games. Suzie Bates is the highest scorer for Otago Sparks in the competition. She has led the way with the bat, collecting 217 runs in five games at an average of 54.25. Bates has had a strike rate of 116.04. Amerlia Kerr could be a player to watch out for in the Wellington Blaze team. Her all-round abilities make her a good captaincy pick for your OS-W vs WB-W Dream11 Fantasy team. She has scored 225 runs at an average of 56.25 in the ongoing tournament. Kerr has also picked up five wickets so far. Meanwhile, Kate Ebrahim is another all-rounder you must have in your Dream11 Fantasy team. She has picked up nine wickets in five games at an economy rate of 5.94. She has also scored 72 runs in the tournament thus far. Leigh Kasperek has done well with both bat and ball in the tournament. She has scalped eight wickets at an economy rate of 5.0 in four games so far, and has also scored 104 runs. Amelia Kerr (WB-W) – 506 points. Leigh Kasperek (WB-W) – 396 points. Kate Ebrahim (OS-W) – 385 points. Suzie Bates (OS-W) – 356 points. Eden Carson (OS-W) – 255 points. Amelia Kerr: 225 runs and 5 wickets. Leigh Kasperek: 104 runs and 8 wickets. Kate Ebrahim: 72 runs and 9 wickets. Suzie Bates: 217 runs and 1 wicket. Fantasy Suggestion #1: K Martin, S Bates, R Burns, G Plimmer, A Kerr, K Ebrahim, E Carson, L Kasperek, S Oldershaw, J Kerr, E Black. Captain: A Kerr. Vice-Captain: K Ebrahim. Fantasy Suggestion #2: K Martin, P Inglis, S Bates, R Burns, G Plimmer, A Kerr, K Ebrahim, E Carson, L Kasperek, S Oldershaw, J Kerr. Captain: S Bates. Vice-Captain: L Kasperek.","image_url":"https://static.sportskeeda.com/editor/2021/12/414a9-16406284564205-1920.jpg","source_id":"sportskeeda"},{"title":"Best women sports performances of the year 2021","link":"https://www.thehansindia.com/sports/best-women-sports-performances-of-the-year-2021-721946","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Women were the highlight of 2021 with their inspiring performances across the Olympics and Paralympics.","content":"Best women sports performances of the year 2021Best women sports performances of the year 2021Women were the highlight of 2021 with their inspiring performances across the Olympics and Paralympics. We take a look at the very best of them­Mirabai Chanu: The Indian ace weightlifter Mirabai Chanu gave the country a perfect start at the Tokyo Olympics when she won the silver medal at one of the world's biggest sporting events. Chanu lifted a total of 202 kgs (87kgs in snatch + 115 kgs in clean and jerk) to bag the medal. Chanu's win came two decades after trailblazer Karnam Malleshwari became the first Indian woman to win an Olympic medal.Indian ace weightlifter Mirabai Chanu Avani Lekhara: At just the age of 19, Avani Lekhara became the first Indian woman to win two Paralympic medals in Tokyo on her debut. Before claiming a bronze medal in 50m Rifle 3 Position SH1, the young shooter had also become the first Indian woman to win a Paralympic gold by winning top honours in 10m Air Rifle standing SH1 event. Avani LekharaBhavina Patel: Table tennis star Bhavina Patel had a memorable debut at the Tokyo Paralympics. The Indian paddler defeated World No 2 Borislava Peric-Rankovic in straight games to clinch the silver medal. With this win, Bhavina became the first Indian paddler to win a medal at the Games.Bhavina PatelLovlina Borgohain: Yet another Tokyo debutant, Indian boxer Lovlina Borgohain won a bronze medal in the women's 69kg welter-weight category. Defeating a former world champion in the quarterfinals, Lovlina became the third Indian boxer to win a medal in the Olympics.Lovlina Borgohain Indian women's hockey team: The Rani Rampal-led team created history by becoming the first Indian women's hockey team to reach an Olympic semifinal. Even if they lost the bronze medal match by just 1 point, the team made their country proud by putting their best performance on display. Indian women's hockey team PV Sindhu: Indian ace shuttler PV Sindhu was yet again a star, she won her second Olympic medal. Sindhu defeated China's He Bing Jiao in straight games to win the bronze medal in Tokyo. She also had an incredible run at the BWF World Championships.PV Sindhu Aditi Ashok: Golfer Aditi Ashok has become a household name after her stunning performance in the Tokyo Olympics where she missed out nearly on a medal. More than half the population of India who never watched golf woke up at 4 am to watch Aditi play.Golfer Aditi Ashok Manika Batra: Table tennis star Manika Batra despite not having her coach at the Tokyo Olympics put on some great performance. However, she made a strong comeback when she won a bronze medal at WTT Contender. Indian women's football team: In one of the most significant events for Indian football, 57th ranked India, played against two-time Olympics silver medalist and former World Cup runners-up Brazil, in a four-nations tournament. In the same match, forward Manisha Kalyan scored a brilliant goal. Even though India lost all matches, the team's performance in this tournament was appreciated worldwide.Nethra Kumanan: Nethra Kumanan became the first Indian sailor to qualify for the Olympics. Nethra showcased some incredible skills in Tokyo waters, to finish 35th in the race. Later, Nethra won the gold medal at the laser radial event of the Gran Canaria Sailing Championships. She also finished 23rd at the World Championships.Nethra Kumanan Bhavani Devi: C A Bhavani Devi is the first Indian fencer to qualify for the Olympics. Bhavani, then, won 1st ever fencing match in Olympics history, by beating Tunisia's Ben Azizi. Later she won the Charlellville National Competition in France in the individual women's sabre event.Bhavani Devi Indian women's cricket team: Even if our Indian women's cricket team did not have any major tournaments scheduled this year, the team still made head turns for their incredible Tests performance. Even after playing a Test match after seven years, the team successfully ended up the match against England in a draw. Similarly, playing their first-ever pink-ball day-night Test against Australia, the young team didn't let the Aussies win and ended this match in a draw too. Indian women's cricket team","pubDate":"2021-12-27 19:19:44","full_description":"Best women sports performances of the year 2021 Women were the highlight of 2021 with their inspiring performances across the Olympics and Paralympics. We take a look at the very best of them­ Mirabai Chanu: The Indian ace weightlifter Mirabai Chanu gave the country a perfect start at the Tokyo Olympics when she won the silver medal at one of the world's biggest sporting events. Chanu lifted a total of 202 kgs (87kgs in snatch + 115 kgs in clean and jerk) to bag the medal. Chanu's win came two decades after trailblazer Karnam Malleshwari became the first Indian woman to win an Olympic medal. Indian ace weightlifter Mirabai Chanu Avani Lekhara: At just the age of 19, Avani Lekhara became the first Indian woman to win two Paralympic medals in Tokyo on her debut. Before claiming a bronze medal in 50m Rifle 3 Position SH1, the young shooter had also become the first Indian woman to win a Paralympic gold by winning top honours in 10m Air Rifle standing SH1 event. Avani Lekhara Bhavina Patel: Table tennis star Bhavina Patel had a memorable debut at the Tokyo Paralympics. The Indian paddler defeated World No 2 Borislava Peric-Rankovic in straight games to clinch the silver medal. With this win, Bhavina became the first Indian paddler to win a medal at the Games. Bhavina Patel Lovlina Borgohain: Yet another Tokyo debutant, Indian boxer Lovlina Borgohain won a bronze medal in the women's 69kg welter-weight category. Defeating a former world champion in the quarterfinals, Lovlina became the third Indian boxer to win a medal in the Olympics. Lovlina Borgohain Indian women's hockey team: The Rani Rampal-led team created history by becoming the first Indian women's hockey team to reach an Olympic semifinal. Even if they lost the bronze medal match by just 1 point, the team made their country proud by putting their best performance on display. Indian women's hockey team PV Sindhu: Indian ace shuttler PV Sindhu was yet again a star, she won her second Olympic medal. Sindhu defeated China's He Bing Jiao in straight games to win the bronze medal in Tokyo. She also had an incredible run at the BWF World Championships. PV Sindhu Aditi Ashok: Golfer Aditi Ashok has become a household name after her stunning performance in the Tokyo Olympics where she missed out nearly on a medal. More than half the population of India who never watched golf woke up at 4 am to watch Aditi play. Golfer Aditi Ashok Manika Batra: Table tennis star Manika Batra despite not having her coach at the Tokyo Olympics put on some great performance. However, she made a strong comeback when she won a bronze medal at WTT Contender. Indian women's football team: In one of the most significant events for Indian football, 57th ranked India, played against two-time Olympics silver medalist and former World Cup runners-up Brazil, in a four-nations tournament. In the same match, forward Manisha Kalyan scored a brilliant goal. Even though India lost all matches, the team's performance in this tournament was appreciated worldwide. Nethra Kumanan: Nethra Kumanan became the first Indian sailor to qualify for the Olympics. Nethra showcased some incredible skills in Tokyo waters, to finish 35th in the race. Later, Nethra won the gold medal at the laser radial event of the Gran Canaria Sailing Championships. She also finished 23rd at the World Championships. Nethra Kumanan Bhavani Devi: C A Bhavani Devi is the first Indian fencer to qualify for the Olympics. Bhavani, then, won 1st ever fencing match in Olympics history, by beating Tunisia's Ben Azizi. Later she won the Charlellville National Competition in France in the individual women's sabre event. Bhavani Devi Indian women's cricket team: Even if our Indian women's cricket team did not have any major tournaments scheduled this year, the team still made head turns for their incredible Tests performance. Even after playing a Test match after seven years, the team successfully ended up the match against England in a draw. Similarly, playing their first-ever pink-ball day-night Test against Australia, the young team didn't let the Aussies win and ended this match in a draw too. Indian women's cricket team","image_url":"https://assets.thehansindia.com/h-upload/2021/12/27/500x300_1138126-women-sports.jpg","source_id":"thehansindia"},{"title":"ODI team selection pushed to end of this week; all eyes on Rohit's fitness","link":"https://www.business-standard.com/article/sports/odi-team-selection-pushed-to-end-of-this-week-all-eyes-on-rohit-s-fitness-121122701202_1.html","keywords":null,"creator":null,"video_url":null,"description":"Rohit has been doing his rehabilitation programme at the National Cricket Academy (NCA) but it could still take some time for the Indian captain to regain full fitness","content":null,"pubDate":"2021-12-27 19:16:00","full_description":"The BCCI has decided to delay the selection committee meeting for the ODIs in South Africa till the end of this month to get a clear picture on new white-ball captain Rohit Sharma's left-hamstring injury status. Rohit has been doing his rehabilitation programme at the National Cricket Academy (NCA) but it could still take some time for the Indian captain to regain full fitness. \"The team selection meeting will happen after the first Test. It could be on December 30 or 31st but the BCCI is yet to take a final call. Rohit is pulling all stops to get fit but hamstring injuries are a bit different from other injuries. \"It has been learnt that Ravindra Jadeja and Axar Patel are unavailable for selection. About Rohit, a call will be taken closer to the selection date,\" a senior BCCI official told PTI on conditions of anonymity. Jadeja and Axar's unavailability has opened the door for R Ashwin to make an ODI comeback after four years. Earlier, the selection meeting was supposed to be held just after Hazare Trophy but it has been pushed back only to ensure that Rohit gets a chance to pass the fitness test. In case Rohit is not fit in time for the the ODIs, KL Rahul will be leading India for the first time in a bilateral series. \"It could well happen that Rohit is not fit by the time of selection cut-off but then with the first ODI still three weeks away, he could get enough time to be with the team and regain full fitness closer to the date. \"In that case, he can be selected subject to fitness. These are things that chairman of selectors Chetan Sharma needs to check,\" the official said. As of now, Venkatesh Iyer and Ruturaj Gaikwad are the two youngsters who will be part of the ODI squad on the basis of their performance in Vijay Hazare Trophy. M Shahrukh Khan's name, who has impressed one and all as a finisher during the Hazare Trophy, might come up for discussion. It needs to be seen whether selectors pick him for this tour or keep him ready for the home series against Sri Lanka and West Indies as a T20 option. Shikhar Dhawan, the veteran opener despite his poor run of form in the domestic event, might be retained. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211227/thumb-121122701202.jpg","source_id":"business-standard"},{"title":"‘One of the best shots I’ve ever seen’: Cricket greats blown away by English star’s ridiculous six - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMixwFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvZG9tZXN0aWMtY3JpY2tldC9iaWctYmFzaC9vbmUtb2YtdGhlLWJlc3Qtc2hvdHMtaXZlLWV2ZXItc2Vlbi1jcmlja2V0LWdyZWF0cy1ibG93LWF3YXktYnktZW5nbGlzaC1zdGFycy1yaWRpY3Vsb3VzLXNpeC9uZXdzLXN0b3J5L2NlMjdkYmVlNzVkOWZiZTIxNmNkN2ExODdjNmRlM2Q00gHHAWh0dHBzOi8vd3d3LmZveHNwb3J0cy5jb20uYXUvY3JpY2tldC9kb21lc3RpYy1jcmlja2V0L2JpZy1iYXNoL29uZS1vZi10aGUtYmVzdC1zaG90cy1pdmUtZXZlci1zZWVuLWNyaWNrZXQtZ3JlYXRzLWJsb3ctYXdheS1ieS1lbmdsaXNoLXN0YXJzLXJpZGljdWxvdXMtc2l4L25ld3Mtc3RvcnkvY2UyN2RiZWU3NWQ5ZmJlMjE2Y2Q3YTE4N2M2ZGUzZDQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘One of the best shots I’ve ever seen’: Cricket greats blown away by English star’s ridiculous six  Fox Sports","content":null,"pubDate":"2021-12-27 19:15:18","image_url":null,"source_id":"google"},{"title":"Ashes 2021: Australia vs England, Boxing Day Test, MCG: Day 2 updates, stream, how to watch, live cricket scores, Joe Root, Pat Cummins","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-boxing-day-test-mcg-day-2-updates-stream-how-to-watch-live-cricket-scores-joe-root-pat-cummins/news-story/3064780483554be53e63c81928a976c7","keywords":null,"creator":null,"video_url":null,"description":"Allan Border believes Australia will wrap up the Boxing Day Test on day three and take an unassailable 3-0 lead in the series to clinch the Ashes with two Tests to play.","content":null,"pubDate":"2021-12-27 19:00:00","full_description":"Allan Border believes Australia will wrap up the Boxing Day Test on day three and take an unassailable 3-0 lead in the series to clinch the Ashes with two Tests to play. England will resume on day three at the MCG on 4-31, with Joe Root (12*) and Ben Stokes (2*) at the crease, still needing 51 runs to make Australia bat again. It was a stunning fall from grace after England dominated all but the final hour of day two to give their fans hope of performance worthy of turning the series around and keeping the Ashes alive. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . \"As good as I've ever seen him bowl\" | 02:38 However Mitchell Starc (2-11) and debutant Scott Boland (2-1) turned the match on its head to steal day two honours at the final hurdle and all but break England’s resolve. “With 80 runs as a lead, you thought ‘it’s not too bad, but England could make a bit of a fist of this’. But at 4-31, its hard to see it going past Tuesday,” Border said on Fox Cricket. “It’s advantage Australia.” CODE. Your ultimate sports subscription. Check out this week’s must reads on CODE and start your 1 month FREE trial Border conceded that while ever England had Stokes and Root at the crease they have a slim glimmer of hope, but the pair look to be the last line of defence for the tourists hopes of winning back the Ashes. “Perhaps there’s something extraordinary and Stokes could do it, Root’s a quality player, who knows what tomorrow will bring? But it’s not looking good for England,” Border said. MORE ASHES NEWS TALKING POINTS: ‘Best burst on record’ seals Ashes fate; Fresh humiliation proves Poms ‘can’t cope’ ‘NOBODY COMING OUT’: The humiliating moment that sums up England’s new Ashes low ‘STARING DEFEAT IN THE FACE’: England ‘all but gone’ as ‘brutal’ Aussies run riot - UK View CA CEO addresses new COVID scare | 10:03 Asked if the series was done, former Aussie leg spinner Kerry O’Keeffe said: “I think it is. I know there’s Butler and Bairstow and then the tail, but England tend to lose wickets in clumps and they’ve done it for 12 months. “I can’t see a fightback in it, particularly on this pitch, particularly with Australia being driven by Pat Cummins to not get complacent. NEW PODCAST - Michael Vaughan: “It’s time to get nasty” SUBSCRIBE IN ITUNES OR SPOTIFY ‘THIS IS ACTUALLY A WORSE TEAM’ Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!!! “I don’t think there’s a way out. I know it looks an Australian viewpoint, but this is a difficult pitch.” Should Root and Stokes fall cheaply early on day three it is not inconceivable that Australia could wrap up proceedings without their batsman having to play another part in the match. The thrilling final hour to day two has set the scene for an unmissable opening session at the Melbourne Cricket Ground on Tuesday morning. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . TEAMS Australia XI: David Warner, Marcus Harris, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey, Pat Cummins (c), Mitchell Starc, Nathan Lyon, Scott Boland England XI: Haseeb Hameed, Zak Crawley, Dawid Malan, Joe Root (c), Ben Stokes, Jonny Bairstow, Jos Buttler, Mark Wood, Ollie Robinson, James Anderson, Jack Leach FOLLOW THE ACTION IN OUR LIVE BLOG BELOW.","image_url":null,"source_id":"foxsports"},{"title":"KL Rahul ODI captain: Will KL Rahul become Team India captain for ODI series vs South Africa?","link":"https://thesportsrush.com/cricket-news-kl-rahul-odi-captain-will-kl-rahul-become-team-india-captain-for-odi-series-vs-south-africa/","keywords":["Cricket","India tour of South Africa 2021-22","india vs south africa"],"creator":["Gurpreet Singh"],"video_url":null,"description":"KL Rahul ODI captain: Newly appointed Team India ODI captain Rohit Sharma is still recovering with his hamstring injury. Team India have commenced with the much-awaited tour of South Africa with the first of the three match Test series underway at the SuperSport Park in Centurion. The tour also comprises of a three-match ODI series… The post KL Rahul ODI captain: Will KL Rahul become Team India captain for ODI series vs South Africa? appeared first on The SportsRush.","content":"KL Rahul ODI captain: Newly appointed Team India ODI captain Rohit Sharma is still recovering with his hamstring injury. Team India have commenced with the much-awaited tour of South Africa with the first of the three match Test series underway at the SuperSport Park in Centurion. The tour also comprises of a three-match ODI series which would begin on January 19, 2022 just a day after the end of the third Test at Cape Town. The BCCI’s selection committee, however, have not yet announced the team’s ODI squad despite naming Rohit Sharma as the team’s new skipper in the format on the very day they had announced an 18-member squad for the ongoing Test series. Rohit, however, just before the team’s flight to South Africa, injured his left hamstring during a practice session in Mumbai, thereby forcing the board to rule him out of the Test series. KL Rahul ODI captain: Will Rahul replace Rohit as ODI captain? The 34-year-old, as per reports was expected to be fit again within 3-4 weeks, but his availability for the imminent ODI series is yet to be confirmed. It is worth mentioning that Rohit had started his rehabilitation at the National Cricket Academy (NCA) post his injury, and was also seen interacting with the India Under-19 boys who are currently competing for the Asia Cup title in Dubai. While the status of his injury is yet to be ascertained, in the case of him not recovering before the start of the ODI series, the newly appointed Test vice-captain KL Rahul might replace him as India’s skipper. As per a report by Sports Today, KL Rahul is all set to lead team India if Rohit Sharma misses out from the ODI squad against South Africa. If #RohitSharma gets fit and match ready should he not play the last Test plus the ODI’s as planned…??? @BCCI #INDvSA — Samip Rajguru (@samiprajguru) December 24, 2021 As far as the team’s squad is concerned, the same is likely to be announced by the end of this year. As per a report by the PTI, the selection committee has been delaying their meeting for the ODI squad selection, only to get a clearer picture on Rohit’s availability for the series. In case of Sharma failing to recover from his injury, Maharashtra’s Ruturaj Gaikwad, who has had an excellent run of form off-late will in all likelihood be handed his ODI cap, with recent reports confirming him being picked for the ODI series against the Proteas.     The post KL Rahul ODI captain: Will KL Rahul become Team India captain for ODI series vs South Africa? appeared first on The SportsRush.","pubDate":"2021-12-27 18:40:20","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IND vs SA: Hope I can repeat my success in England and Australia in South Africa too, says Shardul","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-hope-i-can-repeat-my-success-in-england-and-australia-in-south-africa-too-says-shardul-thakur-751445","keywords":null,"creator":null,"video_url":null,"description":"Shardul Thakur has had a good initiation into Test cricket and the India seam bowling all-rounder wants to replicate his impressive show in Australia and England in the ongoing series against South Africa.","content":null,"pubDate":"2021-12-27 16:36:03","full_description":"Shardul Thakur has had a good initiation into Test cricket and the India seam bowling all-rounder wants to replicate his impressive show in Australia and England in the ongoing series against South Africa. Thakur has been preferred by the Indian team management ahead of and because of his superior batting skills. \"I am looking forward to it. I hope it comes off in SA too as I have been successful in England and Australia, to contribute in South African conditions, I would be more than happy,\" Shardul told teammate Ravichandran Ashwin during a chat on bcci.tv. For Shardul, who has 67 wickets and 366 runs for India in 43 international games across formats, self belief is the key. \"I do like to plan my game in terms of both bowling and batting. When I enter the ground, everything is about confidence and self-belief for me. If you are playing white-ball cricket, you think of yorker. So to bowl that yorker, I go in with full confidence which stands out for me as player,\" Shardul said. For the Mumbai cricketer, the aim is to remain a player who always makes winning contribution for the team and not just merely add up numbers.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket officials sweat on test results","link":"https://thewest.com.au/sport/cricket/cricket-officials-sweat-on-test-results-c-5103100","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Officials from Australia and England are waiting on the results of COVID-19 tests as four cases in the tourists' camp threaten to derail the Ashes.","content":null,"pubDate":"2021-12-27 16:33:43","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5103100/a5d0983e477ed5a524b141dbbb67a2acf305418f-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Cricket officials sweat on test results","link":"https://www.perthnow.com.au/sport/cricket/cricket-officials-sweat-on-test-results-c-5103096","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Officials from Australia and England are waiting on the results of COVID-19 tests as four cases in the tourists' camp threaten to derail the Ashes.","content":null,"pubDate":"2021-12-27 16:33:43","full_description":"Cricket Australia is sweating on the results of late-night tests after four COVID-19 cases in England's touring camp put the Ashes series in doubt. Players from both sides were sent for PCR tests after play on day two in Melbourne, with results expected on Tuesday morning. It comes after two of England's support staff and two of their family members returned positive rapid antigen tests on Monday morning. That prompted the rest of England's group to also have rapid tests, before negative results allowed each of their XI to take the field on Monday. But if the more in-depth PCR results reveal CA's worst nightmare, officials could have a battle on their hands to continue the series. But CA was adamant on Monday it could find a way to get the series played, with opener Marcus Harris also undeterred following his first-innings 76. \"We're all vaccinated. Everyone is doing the right thing and trying their hardest,\" Harris said. \"There is going to be hiccups, it's the world we live in. But we can get games played. \"I don't think it's as big of a meltdown issue as what some people are making it out to be. \"With the vaccination stuff people are recovering quickly. So I think we will find a way to get it done.\" Australia have so far managed to get almost all matches played on home soil since the start of the pandemic through its COVID-19 protocols. Only one Test has been postponed - against Afghanistan last summer. A one-day series against New Zealand was also called off when COVID-19 first surfaced mid-series. Otherwise the BBL, WBBL and women's internationals have got through unscathed, with crowds able to attend all bar the first closed-door sports event in Australia with an ODI against New Zealand in March 2020. There is little doubt however that England's outbreak now shapes as the biggest challenge to CA's record. \"We've seen through the last 18 months (we can get games on),\" CA boss Nick Hockley said. \"I have to say I am so proud of the work of everybody involved, in particular thank the players but also the governments and health departments across the country. \"We're having to learn to live with this. It is more work. \"You see a magnificent sight of Boxing Day Test at the MCG, the joy that it's bringing not just to people ... and all of that work ois absolutely worth it.\"","image_url":"https://images.perthnow.com.au/publication/C-5103096/a5d0983e477ed5a524b141dbbb67a2acf305418f-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Cricket officials sweat on test results","link":"https://www.busseltonmail.com.au/story/7564713/cricket-officials-sweat-on-test-results/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-27 16:30:48","full_description":"Australia and England players involved in the third Test have been sent for PCR tests. Cricket Australia is sweating on the results of late-night tests after four COVID-19 cases in England's touring camp put the Ashes series in doubt. Players from both sides were sent for PCR tests after play on day two in Melbourne, with results expected on Tuesday morning. It comes after two of England's support staff and two of their family members returned positive rapid antigen tests on Monday morning. That prompted the rest of England's group to also have rapid tests, before negative results allowed each of their XI to take the field on Monday. But if the more in-depth PCR results reveal CA's worst nightmare, officials could have a battle on their hands to continue the series. But CA was adamant on Monday it could find a way to get the series played, with opener Marcus Harris also undeterred following his first-innings 76. \"We're all vaccinated. Everyone is doing the right thing and trying their hardest,\" Harris said. \"There is going to be hiccups, it's the world we live in. But we can get games played. \"I don't think it's as big of a meltdown issue as what some people are making it out to be. \"With the vaccination stuff people are recovering quickly. So I think we will find a way to get it done.\" Australia have so far managed to get almost all matches played on home soil since the start of the pandemic through its COVID-19 protocols. Only one Test has been postponed - against Afghanistan last summer. A one-day series against New Zealand was also called off when COVID-19 first surfaced mid-series. Otherwise the BBL, WBBL and women's internationals have got through unscathed, with crowds able to attend all bar the first closed-door sports event in Australia with an ODI against New Zealand in March 2020. There is little doubt however that England's outbreak now shapes as the biggest challenge to CA's record. \"We've seen through the last 18 months (we can get games on),\" CA boss Nick Hockley said. \"I have to say I am so proud of the work of everybody involved, in particular thank the players but also the governments and health departments across the country. \"We're having to learn to live with this. It is more work. \"You see a magnificent sight of Boxing Day Test at the MCG, the joy that it's bringing not just to people ... and all of that work ois absolutely worth it.\" Australian Associated Press","image_url":"https://transform.newsnow.io/transform/v1/crop/frm/silverstone-feed-data/7d63e744-465a-426d-847a-d5dfc9bae06c.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail"},{"title":"IND vs SA: Duanne Olivier missed first Test due to Covid-19 after-effects, says South Africa selector","link":"https://zeenews.india.com/cricket/ind-vs-sa-duanne-olivier-missed-first-test-due-to-covid-19-after-effects-says-south-africa-selector-2423187.html","keywords":null,"creator":null,"video_url":null,"description":"According to Cricket South Africa (CSA)'s selection convener Victor Mpitsang, Olivier was kept out of playing eleven due to the after-effects of the Covid-19 virus and a hamstring niggle.","content":null,"pubDate":"2021-12-27 15:56:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Boland’s starring role for Australia adds extra layer of significance | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2021/dec/27/scott-bolands-starring-role-cricket-australia-england-ashes","keywords":["Ashes 2021-22","Australia cricket team","England cricket team","The Ashes","Cricket","Australia sport","Indigenous Australians","Sport"],"creator":["Geoff Lemon at the Melbourne Cricket Ground"],"video_url":null,"description":"The debutant offers hope of progress for Indigenous Australians with a moving reaction from the standsThere were four moments across the first two days of the third Ashes match when the Melbourne Cricket Ground rose, in movement and in voice, to the hometown bowler Scott Boland on his Test debut. The second time was when he took his first wicket, as Mark Wood’s dismissal was upheld by the video umpire. The third time was when Boland, batting at No 11, scored his first runs with an edge through the slip cordon.Those either side were more important. The first, before the match began, when Aunty Joy Murphy Wandin spoke during the welcome to country, noting the rarity of an Indigenous Australian cricketer representing this team. The guttural vocal affirmation from the stands was spontaneous and moving. Continue reading...","content":null,"pubDate":"2021-12-27 15:46:38","full_description":"T here were four moments across the first two days of the third Ashes match when the Melbourne Cricket Ground rose, in movement and in voice, to the hometown bowler Scott Boland on his Test debut. The second time was when he took his first wicket, as Mark Wood’s dismissal was upheld by the video umpire. The third time was when Boland, batting at No 11, scored his first runs with an edge through the slip cordon. Those either side were more important. The first, before the match began, when Aunty Joy Murphy Wandin spoke during the welcome to country, noting the rarity of an Indigenous Australian cricketer representing this team. The guttural vocal affirmation from the stands was spontaneous and moving. The fourth time was right at the end of the second day , in the shadow of stumps, when Boland ripped out two English wickets in the space of three balls, his first major influence on the match. Had England ended the day two wickets down, they would have stayed in the contest. At four down, the calculus had drastically changed. Boland’s story is in many ways representative of the treatment of Indigenous Australians in the nation’s modern incarnation. He did not know of his heritage until he was in his 20s, when his family learned that Boland’s grandfather was descended from the Gulidjan people of western Victoria. For so many people and for so long, that kind of heritage had been hidden or ignored. The Boland family embraced it instead, in a process of learning that is still under way. In 2018 I spoke to Boland about this. “Me and my brother [Nick] are both similar,” he said. “We didn’t know what to think at first, but the more we spoke about it with our family and the more people we got to meet through the [Cricket Australia] Indigenous programme, the more we understood about where we fit in and how we could help out. Me and Dan Christian chatted about it, and Ben Abbatangelo who was captaining the Australian Indigenous side. So the more we spoke about it, the more we felt comfortable about being involved.” There is no way to flatter Australian cricket’s history with Indigenous people. It is a gulf in the game. Unaarrimin and Murrumgunarrimin, often recorded by the colonial names of Johnny Mullagh and Twopenny, played one first-class match apiece for Victoria and New South Wales respectively in the 1800s. Jack Marsh and Alec Henry played a handful of state matches at the turn of the 20th century, as did Eddie Gilbert in the 1930s. The latter three were all pushed out of the game by spurious rejection of their bowling actions by white umpires and administrators. Two more known Aboriginal cricketers played first-class matches between Gilbert’s last in 1936 and Jason Gillespie’s first in 1995. Until Boland, Gillespie was the only Indigenous man to play Test cricket for Australia, while Faith Thomas in 1958 and Ashleigh Gardner starting in 2019 are the only women. Where Australian rules football and rugby league are now rich with Indigenous heroes, cricket still lags behind. The path to changing this remains long and difficult. All of which means that Boland’s appearance in a baggy green cap would have been hugely significant no matter what he did on the field. The extra layer was added with his dramatic final over on the second day. He was picked in this Ashes XI not for symbolism but for his ability to bash the ball into an often unresponsive MCG deck, where he had previously taken 91 first-class wickets at an average of 25 while others have struggled. The England opener Haseeb Hameed had survived a devastating opening burst from Pat Cummins and Mitchell Starc, getting through 30 deliveries and driving Starc down the ground for four. It was a quintessential Boland delivery that knocked him over, a ball slammed into the surface so that it jumped off the seam and took the edge of a haplessly wielded bat. Then England’s use of a nightwatchman came undone, Jack Leach studiously leaving his second delivery on a wider line only to hear it clip his off stump after jagging back in. The spectators lifted in time with Boland’s raised fist. It was a special moment, while one that should not paint a falsely harmonious picture. The MCG is also a ground where Aboriginal champion Adam Goodes was jeered out of Australian rules football after speaking up about the treatment of his people. There remains ugliness aplenty in the relationship between the continent’s original inhabitants and the colonial nation that pushes them to the margins. “You hear the way people talk in the general community, in general conversation, you would hear their remarks and things like that,” Boland said in that interview. “I think the more that people are educated about different cultures, the more they understand. It’s more mainstream now that Indigenous culture is a big part of Australian history and the Australian community.” There is hope in that, and also the reality that each step forward underlines how many are left to take.","image_url":"https://i.guim.co.uk/img/media/678d756056f098eea0668d41a7b2121a808b1575/0_67_4373_2624/master/4373.jpg?width=460&quality=85&auto=format&fit=max&s=0d0b8ad9dfc9ce7d307ff47309b3ce32","source_id":"theguardian"},{"title":"Late-career Jimmy Anderson chasing lost causes in failing England team | Jonathan Liew","link":"https://www.theguardian.com/sport/blog/2021/dec/27/late-career-jimmy-anderson-chasing-lost-causes-in-failing-england-cricket-australia-ashes","keywords":["Ashes 2021-22","Jimmy Anderson","England cricket team","Australia cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Jonathan Liew"],"video_url":null,"description":"The 39-year-old bowler is steadily getting better despite the battle scars with the team going in the opposite direction Jimmy Anderson walked into the indoor nets at the Melbourne Cricket Ground and slumped into the first available chair. His eyes were weary. His boots were scuffed. His trousers were soaked in blood, a fielding injury from Adelaide two Tests earlier which had never been allowed to heal. The fourth Ashes Test of 2017-18 had just ended in an excruciating draw, Anderson had just bowled 59 thankless overs and only a lunatic would have entertained the notion that he would be back at this very ground in four years’ time for more of the same.A lunatic such as Jimmy Anderson, in other words. For in the last week of 2021, here he was: a fresh set of whites, a fresh set of stumps, a fresh set of edges, a fresh haul of victims. And even if England’s latest batting collapse extinguished any faint hope that his four for 33 might prove an Ashes-saving effort, then in many ways this is to capture the very essence of late-career Anderson: a bowler steadily getting better and better, even as his team gets worse and worse. Continue reading...","content":null,"pubDate":"2021-12-27 14:53:17","full_description":"J immy Anderson walked into the indoor nets at the Melbourne Cricket Ground and slumped into the first available chair. His eyes were weary. His boots were scuffed. His trousers were soaked in blood, a fielding injury from Adelaide two Tests earlier which had never been allowed to heal. The fourth Ashes Test of 2017-18 had just ended in an excruciating draw, Anderson had just bowled 59 thankless overs and only a lunatic would have entertained the notion that he would be back at this very ground in four years’ time for more of the same. A lunatic such as Jimmy Anderson, in other words. For in the last week of 2021, here he was: a fresh set of whites, a fresh set of stumps, a fresh set of edges, a fresh haul of victims. And even if England’s latest batting collapse extinguished any faint hope that his four for 33 might prove an Ashes-saving effort, then in many ways this is to capture the very essence of late-career Anderson: a bowler steadily getting better and better, even as his team gets worse and worse. Certainly it looks less enjoyable than it once did. Anderson with the ball in his hand always had a certain sullenness to him, the knack of making professional sport look like hard labour. But something has changed, too. The catches go down with increasing frequency. So too the amount of time he gets to spend in the dressing room putting his feet up. And whereas peak Anderson was once one of the primary attacking weapons in the game, for the last few years he has been more often deployed in defence: chasing lost causes, bailing out failing batters. And so to watch Anderson these days is a curiously draining experience. The wickets are met with a snarl, the plays-and-misses with a grimace. There was a moment on the second evening when Jonny Bairstow ran round from deep midwicket to save a second run, but made the mistake of returning the ball on the half-volley instead of on the bounce. Anderson was still glaring at him a full 10 seconds later. The scars of battle may be largely psychological, but still visible for that. This will be his 60th Test defeat. Only Brian Lara and Shivnarine Chanderpaul have lost more. Only Allan Border and Kim Hughes – both Australians, you will note – will have lost more Tests in Australia. Only Muttiah Muralitharan and Courtney Walsh have taken more wickets in defeat. If we accept the modern pro’s maxim that personal accomplishments are largely irrelevant and only team success matters, then it turns out Anderson has done a lot of running and bowling and glowering and bleeding in a pointless cause. What, then, was the point? Perhaps, at heart, it really is just a numbers game. Not milestones or statistics – Anderson never paid much heed to those – but the singular, fiscal pursuit of the highest number of wickets for the fewest possible runs. Some of his recent analyses – 23-10-33-4, 10-6-8-1 – have an antediluvian, black-and-white feel to them. You need to go back 24 innings to find the last time he went at more than three runs an over. Anderson is 39 now, and no longer the sort of bowler who runs through a team or blazes his way through an entire summer. It is more than three years since he played a full five-Test series. His moments are rarer now. But when conditions are good and the ball is doing a bit, there are still few bowlers you would rather watch. The Lord’s Test against India was one such occasion. Now, on an unseasonably green MCG wicket, he stepped up again. The dangerous Steve Smith was dismissed with barely a flicker of resistance. Marcus Harris was bewitched and tortured from around the wicket before inevitably offering up a catch to slip. And though Pat Cummins tried to cut loose against the second new ball, Anderson ended up getting him too: a rare short delivery that Cummins could only skew to point. But of course, Anderson can only do it in England. Never mind that he now averages fractionally better (a shade over 33) in away Ashes Tests than he does at home. Or that he averages 12 in away Tests this decade. But the caricature of Anderson as a green-wicket phenomenon remains a stubbornly persistent myth, even within his own camp. Certainly you suspect it contributed to his omission in Brisbane and subsequent rustiness in Adelaide. By the time Anderson was finally up to speed, the Ashes had all but gone. After play, Anderson was asked if he was enjoying the tour. “I’ve got the opportunity to put an England shirt on,” he replied, and you realised that for all the pain, for all the bubbles , for all the despair and the defeat, none of this has been in vain. As the Covid scare in the England camp illustrated, Test cricket itself feels like an exceptionally fragile gift at the moment, and more fragile still in the hands of a 39-year-old fast bowler who may have only another two or three tours of Australia in him. The feel of a new ball in his fingers; the thrill of a plan in fruition; the blood on his trousers at the end of a long hard day; for Anderson, cricket itself was the point all along.","image_url":"https://i.guim.co.uk/img/media/9192d9fbab050a9adc43375fe79800753387bbed/0_70_4166_2499/master/4166.jpg?width=460&quality=85&auto=format&fit=max&s=79c2d17ea0c0e1bb4d5bfe89d2f6e6e8","source_id":"theguardian"},{"title":"\"Broccoli Soup, Chicken Chettinad\": Shot Of Team India's Lunch Menu On Day 2 Of India vs South Afric.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9pbmRpYS12cy1zb3V0aC1hZnJpY2Etc2hvdC1vZi10ZWFtLWluZGlhcy1sdW5jaC1tZW51LW9uLWRheS0yLW9mLWNlbnR1cmlvbi10ZXN0LWdvZXMtdmlyYWwtMjY3NDI0N9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Broccoli Soup, Chicken Chettinad\": Shot Of Team India's Lunch Menu On Day 2 Of India vs South Afric..  NDTV SportsLeave it to KL: How Rahul constructed a classic Test innings  ESPNcricinfoIndia vs South Africa 1st Test Score Updates, Day 2 Highlights: Rain washes out the second day's play in Centurion  Times of IndiaRain holds up India on day two of first Test versus South Africa  The Indian ExpressWasim Jaffer Posts A Hilarious Meme After KL Rahul Becomes 2nd Indian Opener To Score A Test Century In South Africa After The Former  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2021-12-27 14:24:00","image_url":null,"source_id":"google"},{"title":"U-19 Asia Cup: India beat Afghanistan by four wickets to enter semi-final - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9uZXdzL3UtMTktYXNpYS1jdXAtaW5kaWEtYmVhdC1hZmdoYW5pc3Rhbi1ieS1mb3VyLXdpY2tldHMtdG8tZW50ZXItc2VtaS1maW5hbC9hcnRpY2xlc2hvdy84ODUyNzM0OC5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"U-19 Asia Cup: India beat Afghanistan by four wickets to enter semi-final  Times of IndiaIND U19 vs AFG U19 Live Streaming Details- When And Where To Watch India U19 vs Afghanistan U19 In Your Country? U19 Asia Cup 2021  Cricket AddictorU19 Asia Cup 2021: All-round India defeat gritty Afghanistan by four wickets to enter semi-final  FirstpostU19 Asia Cup: Harnoor Singh, Raj Bawa star as India defeat Afghanistan  Hindustan TimesNP-U19 vs KUW-U19 Dream11 Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Updates For Match 12 of ACC U19 Asia Cup 2021/22  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2021-12-27 14:11:00","image_url":null,"source_id":"google"},{"title":"IND vs SA, 1st Test: Really happy that I could stay not out, says KL Rahul","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-1st-test-really-happy-that-i-could-stay-not-out-says-kl-rahul-751425","keywords":null,"creator":null,"video_url":null,"description":"India opener KL Rahul said that one goes through a variety of emotions on the way of scoring a century in Test cricket. He also expressed his happiness over staying unbeaten on day one, something which is expected of his role as the opener.","content":null,"pubDate":"2021-12-27 13:12:21","full_description":"India opener said that one goes through a variety of emotions on the way of scoring a century in Test cricket. He also expressed his happiness over staying unbeaten on day one, something which is expected of his role as the opener. On day one of the Boxing Day Test at SuperSport Park, Rahul carried his bat through to stay unbeaten on 122 at stumps, helping India reach 272/3 in a dominant display of batting by the tourists. \"It is truly special. Every hundred really takes something out of you and gives you a lot of joy. There are so many emotions that you go through when you have to score a hundred. You bat and fight for 6-7 hours. Those are the kind of innings that stand out and something that as players, we really cherish these,\" said Rahul in a video posted by the BCCI on Monday. \"Really happy that I could stay not out and this is what is expected of me from my team. Once I got off to a good start, I started and kept enjoying my batting and I did not think too far ahead,\" Rahul added. Talking about his maiden Test hundred in South Africa, Rahul emphasised on good preparation and trying to stay in the present. \"Preparation has been really good. The purpose and the intensity we had in training was something that was very refreshing and that's why you can all see the batters that batted on Day 1 were really focused, determined and had put in a lot of work,\" he said. \"I am not somebody who will bat hours and hours in the nets. But I do spend a lot of time thinking about my batting and visualise my innings. I just try to stay in the moment when I am out there in the middle. I try to enjoy each ball as it comes,\" India opener expressed. The 29-year-old vice-captain surprised himself with his patience and calmness throughout his unbeaten knock laced with 16 fours and a six. \"Just on 99, with the spinner ( ) bowling, I thought it was a good opportunity for me to get a single or go over the top coz everybody was inside. I did have the temptation to do that. But surprisingly, even in England, when I got that hundred in Lord's, I have surprised myself with how calm I have been and not really thought about that one run. My focus has always been to be in the moment and try to enjoy every ball and react to it the best possible way. Really happy that I could finish the day on a good note,\" Rahul concluded.","image_url":null,"source_id":"indiatvnews"},{"title":"McDermott 100 leads Hurricanes to win","link":"https://www.cairnspost.com.au/sport/cricket/mcdermott-100-leads-hurricanes-to-win/video/d2916a7f1abdf9de426ed920bdb5fef6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Hobart Hurricane's Ben McDermott has showed he is one of the most destructive batsmen in the country with a blistering century over the Adelaide Strikers.","content":null,"pubDate":"2021-12-27 12:16:07","full_description":null,"image_url":null,"source_id":"cairnspost"}]}