{"newsArray":[{"title":"Ex-Test captain Smith cleared of racism","link":"https://thewest.com.au/sport/cricket/ex-test-captain-smith-cleared-of-racism-c-6566394","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Former South Africa Test captain Graeme Smith, whose tenure as CSA director of cricket ended last month. has been cleared of racism allegations.","content":null,"pubDate":"2022-04-24 21:35:36","full_description":"Former South Africa director of cricket Graeme Smith has been cleared of racism allegations by two independent arbitrators, the country's cricket board (CSA) said. Smith and current head coach Mark Boucher were among a number of CSA employees implicated in \"tentative findings\" made by the Social Justice and Nation Building Ombudsman last year into alleged discrimination within the sport's national governing organisation in the past. Boucher has been accused of racism by former teammate Paul Adams and of sidelining his former assistant coach Enoch Nkwe. He denies both allegations and will face a CSA disciplinary hearing on charges of gross misconduct next month. The panel concluded that there was no evidence that Smith, also a former captain of the national side, racially discriminated against former player Thami Tsolekile between 2012 and 2014, or that he was biased against black leadership at CSA. It added that there was no merit in the allegation that Smith favoured Boucher over Nkwe during the selection process for head coach in 2019. \"The manner in which these issues have been dealt with... confirms CSA's commitment to deal with the SJN issues in a manner that treats them with utmost seriousness but also ensures fairness, due process and finality,\" said Lawson Naidoo, chair of the CSA board. \"Now that finality on these processes has been reached, it is appropriate to recognise the extraordinary contribution that Graeme has made to South African cricket.\" The 41-year-old Smith's tenure as director of cricket ended at the end of last month.","image_url":"https://images.thewest.com.au/publication/C-6566394/bf2e7fc746a88a0faf52d6f91e39738e407b5217-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Graeme Smith cleared of South Africa cricket racism allegations","link":"https://uk.sports.yahoo.com/news/graeme-smith-cleared-south-africa-201107186.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-04-24 20:11:07","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"South Africa's Smith cleared of racism by independent panel","link":"https://www.skysports.com/cricket/news/12040/12598451/graeme-smith-former-south-africa-director-of-cricket-cleared-of-racism-by-independent-panel","keywords":null,"creator":null,"video_url":null,"description":"Former South Africa director of cricket Graeme Smith has been cleared of racism allegations by two independent arbitrators, the country's cricket board (CSA) said on Sunday.","content":null,"pubDate":"2022-04-24 20:09:00","full_description":"Last Updated: 24/04/22 9:42pm Former South Africa director of cricket Graeme Smith has been cleared of racism allegations by two independent arbitrators, the country's cricket board (CSA) said on Sunday. Smith and current head coach Mark Boucher were among a number of CSA employees implicated in \"tentative findings\" made by the Social Justice and Nation Building Ombudsman last year into alleged discrimination within the sport's national governing organisation in the past. Boucher has been accused of racism by former team mate Paul Adams and of sidelining his former assistant coach Enoch Nkwe. He denies both allegations and will face a CSA disciplinary hearing on charges of gross misconduct next month. The panel concluded that there was no evidence that Smith, also a former captain of the national side, racially discriminated against former player Thami Tsolekile between 2012 and 2014, or that he was biased against Black leadership at CSA. It added that there was no merit in the allegation that Smith favoured Boucher over Nkwe during the selection process for head coach in 2019. \"The manner in which these issues have been dealt with... confirms CSA's commitment to deal with the SJN issues in a manner that treats them with utmost seriousness but also ensures fairness, due process and finality,\" said Lawson Naidoo, chair of the CSA board. \"Now that finality on these processes has been reached, it is appropriate to recognise the extraordinary contribution that Graeme has made to South African cricket.\" The 41-year-old Smith's tenure as director of cricket ended at the end of last month.","image_url":"https://e1.365dm.com/20/08/1920x1080/skysports-graeme-smith-south-africa_5055357.jpg?20200801132811","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-South Africa&#039;s Smith cleared of racism allegations by independent panel","link":"https://www.thestar.com.my/sport/cricket/2022/04/25/cricket-south-africa039s-smith-cleared-of-racism-allegations-by-independent-panel","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former South Africa director of cricket Graeme Smith has been cleared of racism allegations by two independent arbitrators, the country's cricket board (CSA) said on Sunday. Read full story","content":null,"pubDate":"2022-04-24 20:04:00","full_description":"(Reuters) - Former South Africa director of cricket Graeme Smith has been cleared of racism allegations by two independent arbitrators, the country's cricket board (CSA) said on Sunday. Smith and current head coach Mark Boucher were among a number of CSA employees implicated in \"tentative findings\" made by the Social Justice and Nation Building Ombudsman last year into alleged discrimination within the sport's national governing organisation in the past. Boucher has been accused of racism by former team mate Paul Adams and of sidelining his former assistant coach Enoch Nkwe. He denies both allegations and will face a CSA disciplinary hearing on charges of gross misconduct next month. The panel concluded that there was no evidence that Smith, also a former captain of the national side, racially discriminated against former player Thami Tsolekile between 2012 and 2014, or that he was biased against Black leadership at CSA. It added that there was no merit in the allegation that Smith favoured Boucher over Nkwe during the selection process for head coach in 2019. \"The manner in which these issues have been dealt with... confirms CSA's commitment to deal with the SJN issues in a manner that treats them with utmost seriousness but also ensures fairness, due process and finality,\" said Lawson Naidoo, chair of the CSA board. \"Now that finality on these processes has been reached, it is appropriate to recognise the extraordinary contribution that Graeme has made to South African cricket.\" The 41-year-old Smith's tenure as director of cricket ended at the end of last month. (Reporting by Dhruv Munjal in Bengaluru; editing by Clare Fallon)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/04/25/1563012.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Graeme Smith cleared of racial bias allegations in Mark Boucher’s appointment as Proteas coach","link":"https://www.iol.co.za/sport/cricket/proteas/graeme-smith-cleared-of-racial-bias-allegations-in-mark-bouchers-appointment-as-proteas-coach-f5a60f3d-faa4-4841-90c7-6ac400c47329","keywords":null,"creator":["Staff Reporter"],"video_url":null,"description":"Former Proteas captain and director of cricket Graeme Smith has been cleared by two independent arbitrators of racism allegations against him, which emanated from Cricket SA’s SJN process.","content":null,"pubDate":"2022-04-24 19:23:09","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/d51ba5c6-9a70-51e1-a694-061e8addf318&operation=CROP&offset=3x0&resize=2003x1127","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Highlights, Tata IPL 2022 LSG vs MI, Full cricket sc.. Lucknow seal big win as Mumbais winless run continues - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMirAFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLXRhdGEtaXBsLTIwMjItbHNnLXZzLW1pLWZ1bGwtY3JpY2tldC1zY29yZS1sdWNrbm93LXNlYWwtYmlnLXdpbi1hcy1tdW1iYWlzLXdpbmxlc3MtcnVuLWNvbnRpbnVlcy0xMDU5MTE3MS5odG1s0gGwAWh0dHBzOi8vd3d3LmZpcnN0cG9zdC5jb20vZmlyc3Rjcmlja2V0L3Nwb3J0cy1uZXdzL2hpZ2hsaWdodHMtdGF0YS1pcGwtMjAyMi1sc2ctdnMtbWktZnVsbC1jcmlja2V0LXNjb3JlLWx1Y2tub3ctc2VhbC1iaWctd2luLWFzLW11bWJhaXMtd2lubGVzcy1ydW4tY29udGludWVzLTEwNTkxMTcxLmh0bWwvYW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, Tata IPL 2022 LSG vs MI, Full cricket sc.. Lucknow seal big win as Mumbais winless run continues  FirstpostLucknow Super Giants vs Mumbai Indians Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Super Giants vs Mumbai, Indian Premier League 2022, 37th Match  ESPNcricinfoLive Cricket Score: LSG vs MI, Match 37, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 LIVE: MI vs LSG LIVE | Preview LIVE | Rohit Sharma | KL Rahul  NEWS9 liveView Full coverage on Google News","content":null,"pubDate":"2022-04-24 18:27:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"If Ben Stokes is not interested in Test captaincy, England are in trouble, says Ian Chappell","link":"https://www.thehansindia.com/sports/cricket/if-ben-stokes-is-not-interested-in-test-captaincy-england-are-in-trouble-says-ian-chappell-739633","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Joe Root recently quit England’s Test captaincyHe announced following England’s 1-0 Test series loss in West IndiesECB are yet to appoint a new Test skipper","content":"Ian ChappellIan ChappellFormer Australia captain Ian Chappell has said that if Ben Stokes is not interested in Test captaincy then England are in trouble.Joe Root recently stepped down as England's Test captain and the England and Wales Cricket Board (ECB) are yet to announce his successor. Ahead of England's upcoming three-match Test series against New Zealand in June, a new head coach will be also announced along with a new skipper. Earlier, after Ashley Giles stepped down as ECB's new director of cricket after the Ashes, he was replaced by Rob Key. If Stokes does not want to take up the Test captaincy role, England have a few more options at disposal. However, Chappell believes all-rounder Stokes is only their current \"viable option\". \"There's only one viable captaincy option in the best XI and that's allrounder Ben Stokes. If he seriously isn't interested in the job, then England are in big trouble. To question Stokes' viability based purely on the inferior captaincy of previous star allrounders is indefensible. Stokes has the fire in his belly and the positive approach to be successful. However, that alone doesn't guarantee success,\" wrote Chappell in his column for ESPNCricinfo on Sunday. The Australia legend went on to add that Stuart Broad or Jos Buttler should not be considered for the position as they do not guarantee a place in England's XI in Tests. England lost their previous Test series against West Indies 0-1 and are at the bottom of the World Test Championship table 2021-23. \"Stuart Broad is an intelligent, well-spoken player, but he should not be a captaincy consideration. He's now too old and maintains a conservative streak, especially when it comes to field placings for his own bowling. Jos Buttler is not a Test wicketkeeper; he has no obvious place in the first XI,\" Chappell added.","pubDate":"2022-04-24 18:13:44","image_url":"https://assets.thehansindia.com/h-upload/2022/04/24/500x300_1288743-ian-chappell.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Ravi Shastri, Sunil Gavaskar shower praise on KL Rahul","link":"https://www.thehansindia.com/sports/cricket/ipl-2022-ravi-shastri-sunil-gavaskar-shower-praise-on-kl-rahul-739632","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"KL Rahul scored 103 runs against MI on SundayIt was Rahul’s second ton in IPL 2022Both his tons have come against MI this season","content":"KL RahulKL RahulThe duo of Ravi Shastri and Sunil Gavaskar heaped praise on Lucknow Super Giants (LSG) skipper KL Rahul who scored a century on Sunday in the Indian Premier League (IPL) 2022.It was Rahul's second century in the IPL 2022 and both his hundreds in the ongoing season have come against Mumbai Indians (MI). Batting first on Sunday, Rahul remained unbeaten on 103 off 62 balls as LSG put up 168 runs in 20 overs. Two games ago, Rahul had finished with the same score – 103 not out against the same opponents. Meanwhile, Rahul also became the first-ever player to score three centuries against a single T20 team, according to ESPN Cricinfo. KL Rahul, the first player to score three hundreds against a single T20 team He has Mumbai Indians' number 📞 https://t.co/Uw4Ppb5Bx0 | #LSGvMI | #IPL2022 pic.twitter.com/5USUaUf4d6— ESPNcricinfo (@ESPNcricinfo) April 24, 2022 \"He's got a solid all-round game, the technique is good he's got all the shots, great temperament, and good presence of mind. With the responsibility of leading a new franchise is getting the best out of him,\" Shastri said on Star Sports. \"You asked me at the start of the season, Orange Cap, I said KL Rahul because the openers have the best chance. So, it will be between him and (Jos) Buttler. If you are an opening batsman who's firing then your franchise is going to do well in the TATA IPL because those are not the players at the back who come and do the damage. If you get an opener who's firing then it's half the job done already,\" the former India head coach added further. Rahul's knock played a crucial role in LSG's 36-run victory over MI on Sunday. After Rahul's 103, LSG's next top-scorer was Manish Pandey with run-a-ball 22. Gavaskar, on the other hand, lauded Rahul for the way he paced his innings against MI at Wankhede Stadium, Mumbai on Sunday. \"It is fabulous to see the way he's paced his innings (against Mumbai Indians). How he increased his tempo, how he went from one gear to second gear to third gear and towards the end (of the innings) he was into the fifth gear was fabulous,\" said Gavaskar. First game against MI - century ✅Second game against MI - century ✅Another special knock from KL Rahul against Mumbai Indians at Wankhede Stadium 🔥💥#LSGvsMI #IPL2022 #KLRahul #Cricket pic.twitter.com/8nbCrENSUM— Wisden India (@WisdenIndia) April 24, 2022 Rahul failed to score a single century last season in the IPL and he already has two to his name in the underway campaign. With his latest hundred against MI, Rahul emulated Virat Kohli in a special IPL record. Kohli and Rahul are the only players to have scored two centuries against the same team in a single season. The former RCB skipper did so in 2016 when he recorded two tons against Gujarat Lions. In the list of most centuries in the IPL, Rahul now stands joint-third with four hundreds to his name, with only Kohli (5) and Chris Gayle (6) above him.","pubDate":"2022-04-24 18:11:51","image_url":"https://assets.thehansindia.com/h-upload/2022/04/24/500x300_1288742-kl-rahul.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Tata IPL 2022 LSG vs MI Live Cricket Score and Update: Four-down Mumbai in trouble in run-chase - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMi2QFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9sc2ctdnMtbWktbGl2ZS1jcmlja2V0LXNjb3JlLXRhdGEtaXBsLTIwMjItbWF0Y2gtc2NvcmVjYXJkLWxpdmUtdXBkYXRlLWx1Y2tub3ctc3VwZXItZ2lhbnRzLXZzLW11bWJhaS1pbmRpYW5zLWluZGlhbi1wcmVtaWVyLWxlYWd1ZS1saXZlLXN0cmVhbWluZy10b2RheS0xMDU5MTE3MS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tata IPL 2022 LSG vs MI Live Cricket Score and Update: Four-down Mumbai in trouble in run-chase  FirstpostLucknow Super Giants vs Mumbai Indians Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Super Giants vs Mumbai, Indian Premier League 2022, 37th Match  ESPNcricinfoIPL 2022 LIVE: MI vs LSG LIVE | Preview LIVE | Rohit Sharma | KL Rahul  NEWS9 liveLSG vs MI Live Score, IPL 2022: Four quick wickets derail Mumbai Indians' run chase  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-04-24 17:12:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs MI Live Updates: Krunal Pandya Sends Rohit Sharma Packing, MI In Big Trouble - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1sc2ctdnMtbWktbGl2ZS1jcmlja2V0LXNjb3JlLWx1Y2tub3ctc3VwZXItZ2lhbnRzLXZzLW11bWJhaS1pbmRpYW5zLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTE1ODIx0gGdAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2xpdmUtaXBsLXNjb3JlLWxzZy12cy1taS1saXZlLWNyaWNrZXQtc2NvcmUtbHVja25vdy1zdXBlci1naWFudHMtdnMtbXVtYmFpLWluZGlhbnMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5MTU4MjEvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs MI Live Updates: Krunal Pandya Sends Rohit Sharma Packing, MI In Big Trouble  NDTV SportsLucknow Super Giants vs Mumbai Indians Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Super Giants vs Mumbai, Indian Premier League 2022, 37th Match  ESPNcricinfoIPL 2022 LIVE: MI vs LSG LIVE | Preview LIVE | Rohit Sharma | KL Rahul  NEWS9 liveLucknow Super Giants vs. Mumbai Indians Predictions, Betting Tips & Odds │24 APRIL, 2022  Telecom AsiaView Full coverage on Google News","content":null,"pubDate":"2022-04-24 16:59:42","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Fans slam England's Barmy Army after 'disrespectful' birthday wish for Sachin Tendulkar","link":"https://zeenews.india.com/cricket/fans-slam-englands-barmy-army-after-disrespectful-birthday-wish-for-sachin-tendulkar-2457095.html","keywords":null,"creator":null,"video_url":null,"description":"Cricket Fans get angry after England's Barmy Army tweet for Sachin Tendulkar's birthday","content":null,"pubDate":"2022-04-24 16:23:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-mumbai-indians-live-score-over-match-37-t20-1-5-updates-2916355","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Mumbai Indians from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-24 16:16:03","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.2 overs, Mumbai Indians, chasing a target of 169, are 32/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Mumbai Indians. Everything related to Lucknow Super Giants and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Mumbai Indians live score. Do check for Lucknow Super Giants vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (4 Runs) Four! 4.5 overs (1 Run) Back of a length, around middle. Ishan Kishan drags it with the inner half of his bat towards long on for a single. 4.4 overs (1 Run) Fuller ball, on the pads. Rohit Sharma works it away towards mid-wicket for a single. 4.3 overs (1 Run) Outside off, quicker, fuller ball. Ishan Kishan taps it towards cover and takes a single. 4.2 overs (0 Run) Flatter ball, short in length, outside off. Ishan Kishan pushes it towards the fielder at cover. 4.1 overs (1 Run) Fuller delivery, around middle and off. Rohit Sharma knocks it towards long off for a single. Krunal Pandya is into the attack. 3.6 overs (0 Run) Length delivery, outside off. Ishan Kishan pushes it towards cover. Ishan Kishan is on 3 off 13 balls now, he is taking his time to settle in. 3.5 overs (1 Run) A low full toss, on the pads. Rohit Sharma flicks it towards deep square leg for a single. 3.4 overs (0 Run) Back of a length, outside off. Rohit Sharma shuffles across and miscues his pull shot towards the fielder at mid on. 3.3 overs (0 Run) On a length, angling in, around middle. Rohit Sharma blocks it out towards the leg side. 3.2 overs (0 Run) Length delivery, outside off. Rohit Sharma presses forwards and defends it out. 3.1 overs (4 Runs) FOUR! Crunched! A length ball, around middle. Rohit Sharma shimmies down the track and hammers it past mid on for a cracking boundary. 2.6 overs (0 Run) Fuller delivery, around middle. Ishan Kishan blocks it out. 2.5 overs (0 Run) Touch slower now, on a length, outside off. Ishan Kishan blocks it out towards the off side. 2.4 overs (0 Run) Good-length delivery, around middle. Ishan Kishan backs away and blocks it out. 2.3 overs (1 Run) Tad fuller, around middle and off. Rohit Sharma works it away towards mid-wicket for a single. 2.2 overs (4 Runs) FOUR! Easy and effortless! Another shorter ball, around middle and off. Rohit Sharma pulls it gently past short fine leg for a boundary. 2.1 overs (1 Run) Jason Holder begins with a back-of-a-length delivery, around off. Ishan Kishan taps it towards point and takes a single. 1.6 overs (0 Run) Pitches it up now, angling in, around middle. Rohit Sharma works it away towards mid on. Ishan Kishan leaves his crease for a single, but he is sent back just in time. A direct-hit would have probably been curtains for Ishan Kishan! 1.5 overs (1 Run) On a length, outside off. Ishan Kishan guides it past the diving fielder at backward point for a single. Halt in play! Ishan Kishan gets hit on the left shoulder and needs some assistance. He looks fine now. 1.4 overs (0 Run) Half an appeal for caught behind but not given! Dushmantha Chameera drops it short now, around off. Ishan Kishan looks to pull this away but the ball hits him on his shoulder and lobs up in the air towards Quinton de Kock. No review taken! 1.3 overs (0 Run) Another good-length delivery, angling in, around middle. Ishan Kishan defends it out. 1.2 overs (0 Run) Length delivery, outside off. Ishan Kishan defends it out towards point. 1.1 overs (0 Run) Dushmantha Chameera begins with a fuller ball, outside off. Ishan Kishan presses forward and blocks it out. Who will bowl from the other end? It is Dushmantha Chameera. 0.6 over (4 Runs) FOUR! Rohit Sharma gets off the mark in style! Shorter ball, outside off. Rohit Sharma cuts it over point. The ball goes one bounce over the ropes for a boundary. 11 runs off the first over! 0.5 over (0 Run) Back of a length, outside off. Rohit Sharma blocks it out solidly. 0.4 over (0 Run) On a length, shaping away a tad, outside off. Rohit Sharma looks to push this away but he gets beaten. 0.4 over (1 Run) Wide! Shorter ball, wide of off. Rohit Sharma looks to cut this away but he misses. Wide called! 0.3 over (1 Run) Outside off, on a length. Ishan Kishan dabs it towards third man for a single. He gets off the mark! 0.2 over (0 Run) Angling in on a length, around middle. Ishan Kishan looks to defend this but he gets an inside edge back onto the body. 0.2 over (5 Runs) FIVE WIDES! Shorter ball, way down the leg side. Ishan Kishan leaves it alone. Quinton de Kock dives to his right, but he fails to get there. The ball races away towards fine leg for a boundary. 0.1 over (0 Run) Mohsin Khan begins with a shortish ball, down the leg side. Ishan Kishan looks to flick thus but he misses and gets hit on his thigh pads.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637864335550079953.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-mumbai-indians-live-score-over-match-37-t20-1-5-updates-2915961","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Mumbai Indians from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-24 14:06:04","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Lucknow Super Giants are 29/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Mumbai Indians. Everything related to Lucknow Super Giants and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Mumbai Indians live score. Do check for Lucknow Super Giants vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) Length ball, around off. Pandey nudges it to mid-wicket for a sharp single. 4.5 overs (0 Run) Full and outside off, pushed to mid off. 4.4 overs (0 Run) On middle, on a length, tucked to mid-wicket. 4.3 overs (1 Run) Outside off, steered it to third man for a single. 4.2 overs (0 Run) A length ball, outside off, bit of away movement. Rahul has a poke at it but misses. An appeal follows for a caught behind but nothing given. 4.1 overs (0 Run) Length ball, outside off. Rahul punches it to point. Manish Pandey comes to bat now. Also, Riley Meredith comes into the attack. 3.6 overs (0 Run) OUT! TAKEN! A sigh of relief for Tilak Varma as his captain comes to his rescue. A low full toss, outside off. Quinton de Kock leans to drive and hits it straight to short cover where Rohit Sharma takes a sharp catch. The ball was dying but Rohit has his fingers under it. Quinton de Kock goes for a cheap score against his ex-team. 3.5 overs (6 Runs) SIX! DROPPED! Jasprit Bumrah almost got his reward after piling the pressure but no support from the fielder. Full and angling on the pads. de Kock flicks it uppishly and to deep square leg where Tilak Varma tries to take over his head but fumbles and gives away a six. 3.4 overs (0 Run) A stifled appeal for LBW but angling down! Fuller and angling from around the wicket, around leg. de Kock misses his flick and gets hit on the pads. 3.3 overs (1 Run) No room whatsoever for Rahul! Short of a length, on middle. Rahul hangs back to defend but gets an inside edge onto the leg side for a single. 3.2 overs (0 Run) Another length ball, slanting on middle. Tight again from Bumrah and Rahul defends it out. 3.1 overs (0 Run) A huge appeal to start Bumrah's over, for an LBW but height might have saved him! A length ball, angling around middle. Rahul looks to defend but misses and gets rapped on the pads. Jasprit Bumrah comes into the attack. 2.6 overs (2 Runs) Good fielding, this time Tilak Varma! Length ball, outside off, de Kock drives it to covers where Varma gets a hand to it and stops the pace of the ball. Still two taken. 2.5 overs (1 Run) Good fielding by SKY! A length ball, outside off. Rahul opens the face of the bat and dabs it to short third man where Yadav dives to his left and stops it. A single taken. 2.4 overs (2 Runs) Length ball, on off. Rahul punches it to deep cover for a brace now. 2.3 overs (4 Runs) FOUR! Rahul has settled now! Length, angling across. Rahul frees his arms and cuts it aerially over covers for a couple of bounces and four. 2.2 overs (4 Runs) FOUR! Easy pickings! This is on the pads, Rahul hits this past mid-wicket for a boundary. 2.1 overs (1 Run) Length and outside off. de Kock slaps it to deep point for a single. 1.6 overs (0 Run) Despite a boundary, a successful over from the spinner. Flatter and angling on off. Rahul hangs back and chops it back to Shokeen. 1.5 overs (4 Runs) FOUR! Good shot! This is full and on middle. Rahul lofts it over the bowler's head. Pollard gives a chase from long on but to no avail. First boundary off the innings. 1.4 overs (0 Run) A full toss, around leg. Rahul makes room and drives it straight to covers. 1.3 overs (0 Run) Hrithik Shokeen anticipates Rahul will come down the track and cramps him with a full ball, blocked out again. Three dots! Good start by the youngster. 1.2 overs (0 Run) This one skids through, on a length and outside off. Rahul pushes it back to the bowler. 1.1 overs (0 Run) Tossed up, full and outside off. Rahul steps across and pushes it to Shokeen. Who will bowl from the other end? Hrithik Shokeen it is! 0.6 over (1 Run) Two runs of the over then! Length and outside off. Rahul plays it late to third man for a single. 0.5 over (0 Run) A length ball from around the wicket and gets a bit of inward shape as well. Rahul watchfully knocks it to point. 0.4 over (1 Run) First runs on the board! Full and slanting on the pads, de Kock flicks it in front of square leg for a single. 0.3 over (0 Run) Fuller ball now, outside off. de Kock mistimes his drive to mid off. 0.2 over (0 Run) Length ball, outside off, de Kock taps it to point. Rahul wants a single but is sent back. 0.1 over (0 Run) Sams starts with a length ball, angling on the pads, extra bounce there, de Kock looks to flick but gets hit high on the pads. We are ready for action! The umpires make their out to the middle. All the players are out in middle as well. KL Rahul and Quinton de Kock will open the batting for Lucknow. Daniel Sams will begin the proceedings with the ball. Let's go! KL Rahul the skipper of Lucknow, says that the last few games that they have watched they have noticed there is not much dew, so the toss does not really matter. Mentions that they need to be smarter with their plans, they have not lost the games with big margins, they know where they have gone wrong and they just need to correct their mistakes. Informs that they have one change Avesh Khan misses out due to a niggle, Mohsin Khan comes in. Rohit Sharma, the skipper of Mumbai, says it feels good to be back at Wankhede and he expects a huge cheer. Adds that previously it was a different squad and they'll hope to get together this time. Informs they will bowl first, they have played a lot of cricket here, good pitch, decent size and they back themselves and mentions they are playing the same team. Lucknow (Playing XI) - Quinton de Kock (WK), KL Rahul (C), Manish Pandey, Krunal Pandya, Deepak Hooda, Ayush Badoni, Marcus Stoinis, Jason Holder, Dushmantha Chameera, Ravi Bishnoi, Mohsin Khan (In for Avesh Khan). Mumbai (Unchanged Playing XI) - Rohit Sharma (C), Ishan Kishan (WK), Dewald Brevis, Suryakumar Yadav, Tilak Varma, Hrithik Shokeen, Kieron Pollard, Daniel Sams, Jaydev Unadkat, Riley Meredith, Jasprit Bumrah. TOSS - A loud roar from the crowd as Mumbai have won the toss and they have elected to BOWL first. PITCH REPORT - Matthew Hayden is near the pitch. He is a little confused with the surface, although it has a nice cover of grass, the scores have been up and down. Tells that it looks like a good batting track. Here's wishing the icon, legend, the master blaster, Sachin Tendulkar a very Happy Birthday. Mumbai returns to Wankhede on a perfect day. 'Sachin, Sachin' will surely be the chant of the crowd tonight. A win for Mumbai today will be a great gift for him! The last time these two sides met in this league, Lucknow came out on top. Can they do it once again? Or will Mumbai finally win their first game? We will find out. Stay tuned as we bring to you the toss and other updates. Lucknow are coming into this game after suffering a defeat. Their middle-order seems to be an issue as they have been a little inconsistent. They do have enough firepower in their lineup but they need to step up. KL Rahul scored an empathic century against Mumbai the last time the two sides met in this edition. He will be aiming to go big once again! Mumbai have been disappointing in all their departments. Their top order has failed to provide the start and all their bowlers have not been able to defend the target. Suryakumar Yadav and Tilak Varma have been the only consistent players from their side. They will want to make certain amendments and try to open their account. Not to forget, Mumbai are finally back home! Yes, they are playing at the Wankhede Stadium for the first time since 2019. Today might be a new fresh start for Mumbai! Hello and welcome to match number 37 of this exciting league where Mumbai will take on Lucknow at the Wankhede Stadium. Mumbai have had their worst start of the Indian T20 League and chances of qualification for them seem very slim as the maximum points they can reach is 14 provided they win all their remaining games. While the newbies in this league, Lucknow have done fairly well they have won 4 games out of 7 so far and will forward to grabbing two vital points in this game too. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637864257560311323.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Mohsin Khan cricketer IPL: Why is Avesh Khan not playing today’s IPL 2022 match between Lucknow Super Giants and Mumbai Indians?","link":"https://thesportsrush.com/cricket-news-mohsin-khan-cricketer-ipl-why-is-avesh-khan-not-playing-todays-ipl-2022-match-between-lucknow-super-giants-and-mumbai-indians/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","Mumbai Indians","Avesh Khan","Indian Premier League","LSG","MI","Mohsin Khan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Avesh Khan not playing today: Lucknow Super Giants have made a solitary change to their Playing XI for this match. During the 37th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Mumbai Indians at the Wankhede Stadium, Mumbai Indians captain Rohit Sharma has won the toss… The post Mohsin Khan cricketer IPL: Why is Avesh Khan not playing today’s IPL 2022 match between Lucknow Super Giants and Mumbai Indians? appeared first on The SportsRush.","content":"Why Avesh Khan not playing today: Lucknow Super Giants have made a solitary change to their Playing XI for this match. During the 37th match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Mumbai Indians at the Wankhede Stadium, Mumbai Indians captain Rohit Sharma has won the toss and chose to bowl in the first match of the season at their home ground. “Feels good to be back here. It has been a while since we played here and we are expecting a lot of noise. Our winning record here was with a different team. We now need to play better now. We’re bowling first,” Sharma told Star Sports at the toss. “We have played a lot of cricket here to understand that it is a chasing ground. Good pitch, decent boundaries, and we back ourselves to chase anything down.” मुस्कुराइए आप वानखेड़े में है! #OneFamily #DilKholKe #MumbaiIndians #LSGvMI @ImRo45 @klrahul11 pic.twitter.com/bPQmzZx8hr — Mumbai Indians (@mipaltan) April 24, 2022 In search of an elusive maiden victory of the season after seven consecutive defeats, Indians haven’t made any change to their Playing XI for this match. Why is Avesh Khan not playing vs Mumbai Indians today? Meanwhile, Lucknow Super Giants have made a lone change to their Playing XI by bringing in pacer Mohsin Khan for Avesh Khan. A vital part of their bowling attack, Avesh will be missing this match due to a niggle. “We just need to be smarter with our plans. We haven’t lost by big margins, it has just been small things. Hopefully, we can come out here and do better. Avesh Khan misses out due to a niggle and Mohsin Khan replaces him,” LSG captain KL Rahul said at the toss. “We got a couple of wickets in the first over in the last game but still gave away 50 runs in the powerplay. So it’s just those small things that we need to correct.”   The post Mohsin Khan cricketer IPL: Why is Avesh Khan not playing today’s IPL 2022 match between Lucknow Super Giants and Mumbai Indians? appeared first on The SportsRush.","pubDate":"2022-04-24 13:59:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Arun Lal to remain Bengal coach - CAB secretary Snehasish","link":"https://sportstar.thehindu.com/cricket/domestic/arun-lal-to-remain-bengal-coach-snehasish-ganguly-cab/article38479306.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"The Cricket Association of Bengal is not looking to replace its coaching staff led by Arun Lal, says Snehasish Ganguly.","content":null,"pubDate":"2022-04-24 13:23:05","full_description":"Cricket Association of Bengal (CAB) is not mulling to replace its coaching staff led by former India opener Arun Lal, secretary Snehasish Ganguly said here on Sunday. ALSO READ - Ranji Trophy knockouts likely from June 6 Under Lal, Bengal made it to the Ranji Trophy final in 2020 after a long gap of 13 years and in the ongoing season, it made it to the quarterfinals after notching the highest point tally of 18 with three wins on the trot. “I have seen in some sections of the media that CAB is in the process of appointing new coaching staff in the coming season,” Snehasish said here. ‘Excellent job’ “I would like to state categorically here that this news is baseless. These rumours are unnecessary and harmful in the middle of a season when the senior Bengal team is playing good competitive cricket. The team is playing well. The coaching staff is doing an excellent job. CAB is very happy with the current support system around the team and any news on the contrary is false and baseless,” he added. Lal has former Bengal off-spinner Sourasish Lahiri as his deputy. The knockout leg of Ranji Trophy will resume post-IPL in June.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"\"It Looked Like Indian Cricket Had Lost Him\": Sunil Gavaskar On SRH Pacer","link":"https://sports.ndtv.com/cricket/rcb-vs-srh-ipl-2022-it-looked-like-indian-cricket-had-lost-him-sunil-gavaskar-heaps-praise-on-srh-pacer-2915828","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Former India captain Sunil Gavaskar has lauded SunRisers Hyderabad pacer T Natarajan, who has taken 15 wickets in seven matches in the Indian Premier League (IPL ) 2022 so far","content":null,"pubDate":"2022-04-24 12:41:31","full_description":"Former India captain Sunil Gavaskar was all praise for T Natarajan , saying that the SunRisers Hyderabad pacer has regained confidence in the Indian Premier League (IPL) 2022 after overcoming injury setbacks. Natarajan, who was bought back by SRH for INR 4 crore during the IPL auction, is currently the second-highest wicket-taker of the season with 15 wickets from seven matches. Gavaskar was extremely impressed by the left-arm pacer for putting in the hard yards, adding that Natarajan is definitely up for a comeback to the Indian cricket team. His comments came after Natarajan starred for SRH during their win over Royal Challengers Bangalore on Saturday. Natarajan returned with impressive figures of 3/10 in four overs as SRH skittled out RCB for just 68 - the sixth lowest score in IPL ever. \"We all know that yorkers are his specialty but he held the ball back well. It's good to see him back because for some time it looked like Indian cricket had lost him. It's good to have him back in contention. I am pretty sure, with the way he bowls between the 16th and the 20th over, he will be very much in contention,\" Gavaskar said during the mid-innings show on official broadcasters Star Sports. The legendary batter added that Natarajan is setting his sights on the T20 World Cup, which will be played in Australia later this year. Promoted \"Last year, perhaps, he wasn't on top of his game. Right now, he is full of confidence. He has had his share of injuries but he is fresh and raring to go. He recognises that there is a World Cup coming up, he wants to be on that flight to Australia,\" he said during the post-match show. After Natarajan's exploits, SRH chased down the 69-run target with nine wickets and 12 overs to spare. SRH have so far won five of their seven games to be among the top-four in the points table.","image_url":"https://c.ndtvimg.com/2022-04/7ch7lcd8_t-natarajan-bcciipl_625x300_24_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Rishabh Pant is following MS Dhoni's footsteps as wicketkeeper, says Kuldeep Yadav - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vc3BvcnRzL2lwbC0yMDIyL3N0b3J5L2t1bGRlZXAteWFkYXYtbXMtZGhvbmktcmlzaGFiaC1wYW50LWxpa2Vucy1kZWxoaS1jYXBpdGFscy0xOTQxMzIxLTIwMjItMDQtMjTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Rishabh Pant is following MS Dhoni's footsteps as wicketkeeper, says Kuldeep Yadav  India TodayIPL 2022: Rishabh Pant is showing few glimpses of MS Dhoni, says Kuldeep Yadav  Times of IndiaIPL 2022: Conversation With Ricky Ponting Motivated me a Lot - Kuldeep Yadav Hails DC Coaching Staff  News18IPL 2022: Rishabh Pant Is Following MS Dhoni Footsteps: Kuldeep Yadav  Cricket AddictorHaving the freedom to express myself in DC camp has helped me put up good performances: Kuldeep Yadav  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-24 12:36:51","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Down the memory lane: Sachin Tendulkar's top 5 Test knocks","link":"https://www.indiatvnews.com/sports/cricket/sachin-tendulkar-s-top-5-test-knocks-2022-04-24-771867","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket has been blessed with a lot of legends. From Sunil Gavaskar to Virat Kohli, from Kapil Dev to Mahendra Singh Dhoni, these names are synonymous with greatness. They are absolute legends.","content":null,"pubDate":"2022-04-24 12:28:16","full_description":"Indian cricket has been blessed with a lot of legends. From Sunil Gavaskar to , from Kapil Dev to Mahendra Singh Dhoni, these names are synonymous with greatness. They are absolute legends. But there is one man that went over and above all the greatness one can imagine. The master-blaster, the legend, the architect of the Desert Storm, Sachin Ramesh Tendulkar. There is one thing about Sachin that sets him apart from his counterparts. His longetivity. 24 years to be exact. To be so good for so long is no small feat. That's why the world of cricket often refers him as the greatest of all time. Over the years, Sachin has played some knocks that have inspired generations to come. As he turns 49 today, let's have a look at five of his greatest Test knocks. Arguably Sachin's greatest knock in Test cricket came in 2004. By this time it was quite clear that Sachin had a special liking for this ground. Modern-day test cricket is increasingly becoming all about the counterattack. The moment the going gets tough, the batters look to break the shackles and try to put the pressure back on the bowlers. Attack is the best form of defence, is the mantra these days. Sachin's 241 not-out at the SCG will always be remebered as something the fore-fathers of Test cricket would be proud of. Grit, determination, willpower, and patience. These were the qualities that defined this knock. He eliminated the cover-drive from his inventory of strokes and just played on the on-side. With the series beautifully poised at 1-1. Sachin's SCG epic - 241 off 436 helped India draw the match, and the series. India vs Pakistan is called the mother of all cricketing battles. There is something different about these games. It brings the best out of players, even if it putting their body on the line. Heading into the match, Sachin's back problem needed no introduction. The pain got worse during the game, and it was clear that Sachin was struggling. But he kept going against the likes of Wasim, Waqar, Saqlain and notched up a socre of 136 in pursuit of 271 set by Pakistan. The team eventually ended on the wrong side of the result, but Tendulkar's determination and his never give-up attitude earned him a lot of respect. Taking on South Africa at home has always been a daunting task for any visiting team. Add to it the likes of Allan Donald & Shaun Pollock running in, and you have the recipe for total destruction. The Indian team faced the wrath of SA's attack as half the team was back in the hut in no time. played aggressively to put the pressure back on the Proteas. He played every shot in the book, notched up a personal score of 169 and took his team to safety. In what marked Sachin's first Test 100 in the West Indies, the master-blaster put on an exhibition at the Queen's Park Oval. On a pitch that was conducive for the pacers, Tendulkar unleashed his wide array of shots to put Caribbeans on the back foot. What makes this innings even special, is the fact that India lost quick-wickets early on. When Sachin came on to bat, the West Indian bowlers had thier tail up. He came in, wheathered the storm, dominated, and then made a magnifiecent 117. Although there are quite a few knocks that are more glamorous than this one, it still manages to stand out. Sachin was just 17-years-old when when the took the attack back to the English bowlers. Facing the likes of Fraser and Malcolm on a seam friendly track is no mean feat. All this, coupled with the fact that he walked out to bat in a pressure sitaution, makes this knock one of his best. Tendulkar kept the English bowlers at bay and remained unbeaten on a well-made 119. The knock helped India save the match, and was just a teaser for the things to come in the future.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"PBKS vs CSK Match Prediction- Who Will Win Today's IPL Match Between Punjab Kings vs Chennai Super Kings IPL 2022, Match 38, PBKS vs CSK - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMiwAFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vaW5kaWFuLXByZW1pZXItbGVhZ3VlLWlwbC0yMDIyL3Bia3MtdnMtY3NrLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy1pcGwtbWF0Y2gtYmV0d2Vlbi1wdW5qYWIta2luZ3MtdnMtY2hlbm5haS1zdXBlci1raW5ncy1pcGwtMjAyMi1tYXRjaC0zOC1wYmtzLXZzLWNzay_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PBKS vs CSK Match Prediction- Who Will Win Today's IPL Match Between Punjab Kings vs Chennai Super Kings IPL 2022, Match 38, PBKS vs CSK  Cricket AddictorPUN vs CHE 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match 38 of Indian T20 League 2022  CricTrackerMatch Preview - Punjab Kings vs Super Kings, Indian Premier League 2022, 38th Match  ESPNcricinfoPunjab Kings vs Chennai Super Kings Match Prediction- Who Will Win Today's IPL Match Between PBKS and CSK, IPL 2022, Match 38  Cricket AddictorIPL 2022: Match 38, PBKS vs CSK Match Prediction – Who will win today’s IPL match between PBKS and CSK?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-04-24 11:54:52","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket journalist Boria Majumdar found guilty, likely to face two-year BCCI ban in Wriddhiman Saha text case","link":"https://zeenews.india.com/cricket/cricket-journalist-boria-majumdar-found-guilty-likely-to-face-two-year-bcci-ban-in-wriddhiman-saha-text-case-2456948.html","keywords":null,"creator":null,"video_url":null,"description":"BCCI enquiry committee took the decision on Saturday at the meeting, revealed sources in the know of things at the board.","content":null,"pubDate":"2022-04-24 09:50:00","full_description":"Senior cricket journalist Boria Majumdar will face a two-year ban from covering the matches in India after he was found guilty in the Wriddhiman Saha text case. BCCI enquiry committee took the decision on Saturday at the meeting, revealed sources in the know of things at the board. The BCCI Apex Council was to review the probe committee's report concerning India wicketkeeper Wriddhiman Saha, who had accused this journalist of intimidating him, at its meeting on April 23. The BCCI had formed a three-member panel comprising vice-president Rajeev Shukla, treasurer Arun Dhumal and Apex Council member Prabhtej Bhatia to probe Saha's allegation. Saha had earlier posted a series of tweets on February 23 against an unnamed journalist, accusing him of threatening him over Whatsapp. The said journalist then accused Saha for doctoring the Whatsapp screenshots. It was later disclosed that it was Majumdar. \"We will be informing all state units of the Indian cricket board to not allow him inside stadiums. He won`t be given media accreditation for home matches and we will also be writing to ICC to blacklist him. Players will be asked not to engage with him,\" a top BCCI official was quoted as saying in an Indian Express report. On February 19, Saha wrote on Twitter while sharing the screenshot of the chat, \"After all of my contributions to Indian cricket...this is what I face from a so called \"Respected\" journalist! This is where the journalism has gone.\" After all of my contributions to Indian cricket..this is what I face from a so called “Respected” journalist! This is where the journalism has gone. pic.twitter.com/woVyq1sOZX — Wriddhiman Saha (@Wriddhipops) February 19, 2022 One of the messages in the chat read as, \"You did not call. Never again will I interview you. I don`t take insults kindly. And I will remember this.\" The report also said that Saha eventually identified Majumdar as the journalist in question when he came in front of the committee. Majumdar eventually identified himself through a video on Twitter and claimed that he would take legal action against Saha. \"While deposing before the committee, Saha identified Majumdar and alleged that he was \"bullied\" for an interview. Meanwhile, Majumdar accused the cricketer of \"doctoring\" the screenshots of the WhatsApp messages he had posted on Twitter and later shared with the committee,\" further said the report. Saha`s tweet took the cricketing world by storm, with former India opener Virender Sehwag offering his support to Saha and urging him to name Majumdar, who hadn`t been identified till then. \"Extremely sad. Such sense of entitlement, neither is he respected nor a journalist, just chamchagiri. With you Wriddhi,\" tweeted Sehwag at that time. With IANS inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Symonds Reveals How 'IPL Money' \"Poisoned\" His Relationship With Clarke","link":"https://sports.ndtv.com/cricket/andrew-symonds-reveals-how-ipl-money-poisoned-his-relationship-with-michael-clarke-2915303","keywords":null,"creator":null,"video_url":null,"description":"Andrew Symonds spilled the beans on his tumultuous relationship with former Australian cricket team captain and his once \"close mate\" Michael Clarke","content":null,"pubDate":"2022-04-24 09:08:18","full_description":"When they flourished, Andrew Symonds and Michael Clarke formed a formidable pair for the Australian cricket team. Together they won many series as Clarke went on to become the Australia captain. At the same time, Symonds was at the sunset of his career and somehow his equation with Clarke took the wrong turn. It reached a point when then interim captain Clarke sent Symonds back from a one-day series for skipping a team meeting and instead going to fishing. While Symonds, a hard-hitting allrounder, criticised Clarke's leadership style in 2015, the ex-Australia captain alleged that the former had once turned up drunk to play an ODI in 2008. The bickering between the two was that intense. \"Andrew Symonds went on TV to criticise my leadership. I'm sorry, but he is not a person to judge anyone on leadership,\" Clarke wrote in his 2015 Ashes Diary. \"This is a guy who turned up drunk to play for his country. It's pretty rich for him to be throwing rocks.\" Now, speaking on The Brett Lee Podcast , Symonds said that their friendship went sour after he got a good salary in the Indian Premier League. In the inaugural 2008 IPL, Symonds became the costliest overseas player as he was picked by Deccan Chargers for a sum of INR 5.4 crore. \"We became close. When he (Clarke) came into the side I used to bat with him a lot. So, when he came into the side I really looked after him. That built a bond,\" Symonds told Lee on the 49th minute of the hour-long podcast. \" Matthew Hayden said to me — when the IPL started, I got a pretty penny to go and play in the IPL — he identified it as there was a bit of jealousy that potentially came into the relationship (with Clarke) there. Promoted \"I guess Money does funny things. It's a good thing but it can be a poison and I reckon it may have poisoned our relationship. I've got enough respect for him to probably not go into detail about what was said. \"My friendship with him is no longer and I'm comfortable with that, but I'm not gonna sit here and start slinging mud.\"","image_url":"https://c.ndtvimg.com/2022-04/pe5t78qo_andrew-symonds-michael-clarke-afp_120x90_24_April_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sports journalist Boria Majumdar found guilty; faces 2-year ban in Saha text case: Report","link":"https://www.tribuneindia.com/news/sports/sports-journalist-boria-majumdar-found-guilty-faces-2-year-ban-in-saha-text-case-report-389044","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, April 24 Sports journalist Boria Majumdar has reportedly been found guilty in the Wriddhiman Saha text case and faces a two-year ban for the same, says a report in the Indian Express. The news comes after the Board of Control for Cricket in India (BCCI) set up a three-member committee in February, comprising vice-president Rajiv Shukla, treasurer Arun Dhumal, and Apex Council member Prabhtej Singh Bhatia to look into the matter where Saha took to Twitter to post a screenshot of threatening messages from Majumdar over an interview request. \"We will be informing all state units of the Indian cricket board not to allow him inside stadiums. He won't be given media accreditation for home matches and we will also be writing to ICC to blacklist him. Players will be asked not to engage with him,\" a top BCCI official was quoted as saying in the report on condition of anonymity. On February 19, Saha wrote on Twitter while sharing the screenshot of the chat, \"After all of my contributions to Indian cricket...this is what I face from a so called \"Respected\" journalist! This is where the journalism has gone.\" One of the messages in the chat read as, \"You did not call. Never again will I interview you. I don't take insults kindly. And I will remember this.\" The report also said that Saha eventually identified Majumdar as the journalist in question when he came in front of the committee. Majumdar eventually identified himself through a video on Twitter and claimed that he would take legal action against Saha. \"While deposing before the committee, Saha identified Majumdar and alleged that he was \"bullied\" for an interview. Meanwhile, Majumdar accused the cricketer of \"doctoring\" the screenshots of the WhatsApp messages he had posted on Twitter and later shared with the committee,\" further said the report. Saha's tweet took the cricketing world by storm, with former India opener Virender Sehwag offering his support to Saha and urging him to name Majumdar, who hadn't been identified till then. \"Extremely sad. Such sense of entitlement, neither is he respected nor a journalist, just chamchagiri. With you Wriddhi,\" Sehwag had tweeted at the time. When Saha had explained a couple of days later over his reasons on not revealing the name of the journalist, Sehwag had said, \"Dear Wriddhi, it's not your nature to harm others and you are a wonderful guy. But to prevent such harm from happening to anyone else in the future, it's important for you to name him. Gehri saans le, aur naam bol daal (take a deep breath, and reveal the name).\" IANS","content":null,"pubDate":"2022-04-24 08:34:13","full_description":"New Delhi, April 24 Sports journalist Boria Majumdar has reportedly been found guilty in the Wriddhiman Saha text case and faces a two-year ban for the same, says a report in the Indian Express. The news comes after the Board of Control for Cricket in India (BCCI) set up a three-member committee in February, comprising vice-president Rajiv Shukla, treasurer Arun Dhumal, and Apex Council member Prabhtej Singh Bhatia to look into the matter where Saha took to Twitter to post a screenshot of threatening messages from Majumdar over an interview request. \"We will be informing all state units of the Indian cricket board not to allow him inside stadiums. He won't be given media accreditation for home matches and we will also be writing to ICC to blacklist him. Players will be asked not to engage with him,\" a top BCCI official was quoted as saying in the report on condition of anonymity. On February 19, Saha wrote on Twitter while sharing the screenshot of the chat, \"After all of my contributions to Indian cricket...this is what I face from a so called \"Respected\" journalist! This is where the journalism has gone.\" One of the messages in the chat read as, \"You did not call. Never again will I interview you. I don't take insults kindly. And I will remember this.\" The report also said that Saha eventually identified Majumdar as the journalist in question when he came in front of the committee. Majumdar eventually identified himself through a video on Twitter and claimed that he would take legal action against Saha. \"While deposing before the committee, Saha identified Majumdar and alleged that he was \"bullied\" for an interview. Meanwhile, Majumdar accused the cricketer of \"doctoring\" the screenshots of the WhatsApp messages he had posted on Twitter and later shared with the committee,\" further said the report. Saha's tweet took the cricketing world by storm, with former India opener Virender Sehwag offering his support to Saha and urging him to name Majumdar, who hadn't been identified till then. \"Extremely sad. Such sense of entitlement, neither is he respected nor a journalist, just chamchagiri. With you Wriddhi,\" Sehwag had tweeted at the time. When Saha had explained a couple of days later over his reasons on not revealing the name of the journalist, Sehwag had said, \"Dear Wriddhi, it's not your nature to harm others and you are a wonderful guy. But to prevent such harm from happening to anyone else in the future, it's important for you to name him. Gehri saans le, aur naam bol daal (take a deep breath, and reveal the name).\" IANS","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_1507608116.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"MI vs LSG Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Mumbai vs Lucknow","link":"https://www.indiatvnews.com/sports/cricket/mi-vs-lsg-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-mumbai-vs-lucknow-2022-04-24-771830","keywords":null,"creator":null,"video_url":null,"description":"MI vs LSG Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Mumbai Indians vs Lucknow Super Giants Match Details","content":null,"pubDate":"2022-04-24 08:31:38","full_description":"Mumbai Indians vs Lucknow Super Giants Match No. 37 of 2022 Sunday, 7:30 PM Wankhede Stadium, Mumbai (C), , Suryakumar Yadav(VC), Deepak Hooda, Tilak Varma, Dewald Brevis, , Daniel Sams, , , Ravi Bishnoi. , Ishan Kishan, Dewald Brevis, Suryakumar Yadav, Tilak Varma, Kieron Pollard, Daniel Sams, M Ashwin, Riley Meredith, Jaydev Unadkat, KL Rahul, Quinton de Kock, , , Deepak Hooda, Ayush Badoni, Krunal Pandya, , Dushmantha Chameera, Avesh Khan, Ravi Bishnoi A high scoring match is likely to be displayed today. The team winning the toss might choose to bowl first. 167.3 44.4 Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). Hotstar Sunday, 24th April 7:30 PM IST Wankhede Stadium, Mumbai Rohit Sharma, Ishan Kishan, Dewald Brevis, Suryakumar Yadav, Tilak Varma, Kieron Pollard, Hrithik Shokeen, Daniel Sams, Jaydev Unadkat, Riley Meredith, Jasprit Bumrah, Fabian Allen, Murugan Ashwin, Tymal Mills, Basil Thampi, Anmolpreet Singh, Sanjay Yadav, Tim David, Ramandeep Singh, Mayank Markande, Aryan Juyal, Arjun Tendulkar, Rahul Buddhi, Arshad Khan Quinton de Kock, KL Rahul, Manish Pandey, Krunal Pandya, Deepak Hooda, Ayush Badoni, Marcus Stoinis, Jason Holder, Dushmantha Chameera, Ravi Bishnoi, Avesh Khan, Manan Vohra, Kyle Mayers, , Ankit Rajpoot, Krishnappa Gowtham, Shahbaz Nadeem, Andrew Tye, Mohsin Khan, Karan Sharma, Mayank Yadav","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"The ten most stomach-churning moments for all football fans","link":"https://www.football365.com/news/ten-stomach-churning-moments-supporters-carragher-high-line","keywords":["F365 Features","Promos","Topical Top Ten"],"creator":["Tim Ellis"],"video_url":null,"description":"The high line, game management and … The post The ten most stomach-churning moments for all football fans appeared first on Football365.","content":"Jamie Carragher reckons Liverpool’s pursuit of unprecedented glory is too stressful for supporters. That high line certainly doesn’t help. Carragher has claimed that Liverpool’s quest for a quadruple is too stressful for a supporter given the amount of tension that is involved in every game (apart from that walkover against Manchester United). He might be on to something. Supporting a team is bad for the circulatory system. Here are ten things that make fans go ‘oohh’ in that typical G-Nev/Carra way:   1) Goalkeepers playing football If Sam Allardyce had his way, goalkeepers would only be allowed to save shots. They would be banned from any tippy-tappy nonsense that jars with Big Sam’s pint of wine ideology. But Ederson’s decision to swipe the ball away from Diogo Jota at the last millisecond was pure theatre. Alisson has gone a bit bonkers on the half-turn recently; four minutes in at Anfield and he was off on one against Bruno Fernandes. Zack Steffen teased Sadio Mane and then actually let him score as if they were playing that five-a-side, not allowed in the area rule. Gee. It is perilous.   2) Playing a high line Okay. This is a bit specific to a certain team. Any Liverpool fans watching Chelsea’s ‘goals’ in the Carabao Cup final suffered from complications and palpitations brought on by extreme levels of high-line stress, especially when Romelu Lukaku pointed and his sleeve became active. Benfica similarly scored a bucketful, only to have a couple wiped out. The reliance on this tactic for Reds supporters must be trusted. It has got them this far. But try telling that to the heart. Bladdered fellas in the pub moaning about Liverpool’s high line is unrivalled entertainment — J (@jdblt7) April 15, 2022   3) Team selection “You don’t know what you’re doing” is one of those casual phrases thrown at managers in extremis. When your manager does something left-field and usual patterns of play – however bad – go completely AWOL, then it’s hard to stomach. Phil Jones, come on down! Pep Guardiola is getting very touchy about accusations that he is too clever by half. The Spaniard’s Megamind is programmed to make up new ways to win matches. Please see the 2021 Champions League final. Supporters can take losses but not the losses that come with self-sabotage.   4) Profligacy How many times do huge waves of pressure never offer the golden egg of a goal? Far too often for comfort. There is something deeply unsettling about being in control of a football match in everything but the scoreline. Twitchiness ensues. Not finishing what you started is what makes the sport the deepest-lying frustration, more irritating than a low block. “That’s football?” they say. No, it isn’t. That’s stress. As Thomas Tuchel muses on Lukaku: “I still believe that he will [score goals]. We need a bit more patience than we all have.” Patience? This isn’t cricket.   5) A lack of effort When the team are on their summer holidays (or Easter break), supporters can spot it an Ibiza mile off. The players come with oven-ready non-apologies and that faux disappointment in interviews. We see you, Bruno “we are fighting for nothing” Fernandes. Observe a whining team that does not win or even run but can waste a wad of weasel words on a smartphone. At least Hannibal ‘Lecter’ Mejbri came on to liven things up by trying to eat up the yards on the way to hacking off Jordan Henderson’s legs. And as Jimmy Floyd Hasselbaink noted, Lukaku doesn’t run around. But if you want to start picking on Cesar Azpilicueta after a shambolic performance, think again.   6) Sniffing the danger at set-pieces A goalkeeper as huge as Fraser Forster who can’t command the box against Burnley’s ball-wreckers? Look away now. Or how about a defence that doesn’t do first contact with the ball? When defending bazooka set-pieces is a weakness, this induces Full Metal Jacket stress from head to toe. Leicester fans are well drilled in coping with such dread, given that any opposition bonce is guaranteed to get first dibs on something floated into the penalty area. On the other side of the coin, how stupefyingly stressful is it to see a corner-kick as a redundant weapon? Yes. It’s Manchester United. Again.   7) The unbearable impotence of being there When your whole being is so welded to the results, it puts an enormous amount of strain on a midweek or weekend. Some of those visiting fans in L4 genuinely looked like they had lost their faith in humanity. A report just before the pandemic found that: ‘Fans who are strongly fused with their team – that is, have a strong sense of being ‘one’ with their team experience the greatest physiological stress response when watching a match.’ At least Covid gave us a break from the full force of that strong bond. Relationships are now strained to breaking point as player access has returned. It’s too close for comfort.   8) Title race and relegation every-second-counts battles Carragher said that Liverpool competing for fourth would be less nerve-wracking – although that might be arguable given Alisson had to score a 95th-minute winner against West Brom to set the Reds up for this titanic season. When every goal against feels like a dagger, a step further into the potential abyss of ‘losing’ a title or league status, then perspective is necessary. How is it enjoyable for a supporter to hang on every result as if it was literally more important than putting food on tables? The joy and pain of winning and losing status or trophies is really quite horrible. Winning is a relief, not ecstasy.   9) Managing a lead Game management, eh? It’s that bit when the natural hunger to attack has passed as leads are established, intensity drops and the opposition starts knocking on the door. The quest for a safe score that can be enjoyed is always hard. Having survived Manchester City’s late onslaught at Wembley, Liverpool were in the tricky two-nil twilight zone against United on Tuesday. Klopp went full Panzer division at Virgil van Dijk as the Dutchman temporarily lost his chill box equilibrium. It was just a reminder that relaxation isn’t even possible against the worst United team in living history. Football. Bloody hell.   10) The morning after Reality bites. What happened the night before was not a blur. The process of coming to terms with loss is a journey. It’s comforting to pretend not to care. That’s what fans do now – just to let themselves off the hook about a crippled bloodhound who used to be an adorable puppy. But you are invested. You do care. A lot. It’s just easier to look away now. The post The ten most stomach-churning moments for all football fans appeared first on Football365.","pubDate":"2022-04-24 07:53:31","image_url":null,"source_id":"football365","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Boria Found Guilty of Intimidating Wriddhiman Saha, Two Year Ban Likely: Report - The Quint","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LnRoZXF1aW50LmNvbS9zcG9ydHMvY3JpY2tldC9ib3JpYS1tYWp1bWRhci1ndWlsdHktb2YtaW50aW1pZGF0aW5nLXdpY2tldGtlZXBlci13cmlkZGhpbWFuLXNhaGEtdHdvLXllYXItYmFuLWJjY2nSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Boria Found Guilty of Intimidating Wriddhiman Saha, Two Year Ban Likely: Report  The QuintBoria Majumdar Guilty Of Intimidating Wriddhiman Saha; Likely To Be Banned For 2 years: Reports  Republic WorldBoria Majumdar likely to get two-year ban in Wriddhiman Saha case  The Indian ExpressBoria Majumdar Found Guilty in Wriddhiman Saha Case; BCCI Set to Ban Journalist For Two Years-Report  News18Here’s Why The BCCI Might Ban Journalist Boria Majumdar For 2 Years  The Cricket LoungeView Full coverage on Google News","content":null,"pubDate":"2022-04-24 07:21:05","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"LSG vs MI Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s LSG vs MI IPL Match No. 37 at Wankhede Stadium, Mumbai, 7:30 PM IST April 24","link":"https://zeenews.india.com/cricket/lsg-vs-mi-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-lsg-vs-mi-ipl-match-no-37-at-wankhede-stadium-mumbai-730-pm-ist-april-24-2456918.html","keywords":null,"creator":null,"video_url":null,"description":"Lucknow Super Giants vs Mumbai Indians Dream11 Team Prediction, Lucknow Super Giants vs Mumbai Indians IPL Match No. 37 - Check My Dream11 Team, Best players list of LSG vs MI, Lucknow Super Giants Dream11 Team Player List, Mumbai Indians Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-04-24 07:17:00","full_description":"Virtually out of the playoff race and struggling on multiple fronts, a horribly out-of-sorts Mumbai Indians will need a special team effort to arrest their slide when they take on Lucknow Super Giants in a return-leg IPL fixture on Sunday. With seven defeats in as many matches, MI are winless this season and are languishing at the bottom with nothing going right for the five-time champions, who have failed to win the crunch moments and will need a miracle to make it to the playoffs. Lucknow, on the other hand, have looked in good touch with four wins from seven matches but they are coming into the match after suffering a 18-run loss to Royal Challengers Bangalore. However, the fact that LSG beat MI by 18 runs in their first leg will give them confidence. MI have done well in patches but never looked as a unit, prompting former Australian batter Chris Lynn to stir speculations of a rift within the camp following their last defeat to Chennai Super Kings on Thursday. The defeat also handed MI the dubious record of becoming the first team in IPL history to lose its first seven matches in a season. On the other hand, Lucknow’s batting has been led by skipper KL Rahul (265 runs), who had slammed an unbeaten 60-ball 103 the last time the two teams faced off on April 16. He is the second highest runscorer this season. Other opener Quinton de Kock (215 runs) too has been in good rhythm. While Krunal Pandya was the top scorer against RCB, young Ayush Badoni and Deepak Hooda couldn’t convert their starts and need to step up when the going gets tough. Match Details Venue: Wankhede Stadium, Mumbai Date & Time: April 24th at 7:30 PM IST Live Streaming: Star Sports Network, Star Gold and Disney+Hotstar Keeper – Lokesh Rahul (C), Quinton de Kock Batsmen – Suryakumar Yadav (VC), Tilak Varma, Dewald Brevis All-rounders – Jason Holder, Marcus Stoinis, Daniel Sams Bowlers – Avesh Khan, Jaydev Unadkat, Jasprit Bumrah Captain: KL Rahul Vice-captain: Suryakumar Yadav Lucknow Super Giants: KL Rahul (c), Quinton de Kock (wk), Manish Pandey, Deepak Hooda, Ayush Badoni, Marcus Stoinis, Jason Holder, Krunal Pandya, Avesh Khan, Dushmantha Chameera, Ravi Bishnoi Mumbai Indians: Ishan Kishan (wk), Rohit Sharma (c), Dewald Brevis, Suryakumar Yadav, Tilak Varma, Kieron Pollard, Daniel Sams, Riley Meredith, Hrithik Shokeen, Jasprit Bumrah, Jaydev Unadkat","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Praise continues to pour in for Dhoni the finisher for his match-winning innings","link":"https://www.sentinelassam.com/sports/cricket/praise-continues-to-pour-in-for-dhoni-the-finisher-for-his-match-winning-innings-588954","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Ramji compared Dhoni with tennis great Roger Federer in terms of preparation","content":"Appreciation for Mahendra Singh Dhoni the finisher continues to pour in despite the former India skipper having won the game for Chennai Super Kings against Mumbai India two day back with his keen sense of timing and keeping his cool in extremely trying conditions. Dhoni's blistering 13-ball unbeaten 28 helped CSK clinch a last-ball thriller against the five-time champions, scoring 16 runs off the last four deliveries to help Chennai win their second game in IPL 2022. Australian cricketer Chris Lynn hailed Dhoni's game awareness and said on espncricinfo that, \"MS knew where the ball was going to be. The guy is so powerful, he is agile, and even his running between the wickets was very crucial. Talk about belief, just his hunger and his game awareness is the best in the tournament. MS Dhoni is the master. Even though they won the game, he never shows too much emotion. It is his belief and hunger, and he has still got it. You have to give him credit. He is agile, he is competing, and he wants to win,\" said Lynn. \"Dhoni has so much passion for cricket. He has so much passion for CSK. The players of that calibre, they will always be at the top and do well and that experience will tell, that's what he's doing,\" CSK CEO KS Viswanathan said. Former India cricket team trainer Ramji Srinivasan said Dhoni \"has a different mindset\" altogether. \"I always believe Dhoni trains like an individual athlete,\" said Ramji, who was the India trainer during the 2011 World Cup and 2013 Champions Trophy. \"It is absolutely necessary to trust and believe in your skill and ability to deliver in a crucial time. You need to have that mindset and self-confidence for your body to respond like that. These both are highly interconnected. This aspect is called bio-rhythm, where your mind and body are in total sync,\" Ramji added. Ramji compared Dhoni with tennis great Roger Federer in terms of preparation. \"I would straight away compare Dhoni to Federer. In terms of preparation, you can see a lot of similarity. If you see Federer, he makes things look very easy...his forehand or backhand, his drop shot, serve and volley, serve. Everything looks so easy and effortless. But to make things look so easy, you need twice the hard work that the others are doing and it has to be smart work as well. \"Dhoni is a natural and his fitness is natural. His solid calf muscles and thighs can give enormous amount of power and speed. You see the way he collects the ball and sprints to the stumps and makes a run-out. Or the split, the previous year or the one before the last that he did during his stumping...look at the split. He is naturally strong. He exactly understands that and this is what bio-rhythm is all about. The body listens to his mind and his mind listens to his body. And most importantly, Dhoni trains smartly,\" added Ramji. Skipper Jadeja, expressing his delight with Dhoni's cameo, said, \"It feels good that Mahi bhai is still hungry, he is still in touch, and everybody in the dressing room feels calm knowing he is in the middle and if he stays till the end, definitely he will win the match for us.\" IANS Also Read: Third umpire should have intervened: PantAlso Watch: ","pubDate":"2022-04-24 06:39:19","full_description":"Appreciation for Mahendra Singh Dhoni the finisher continues to pour in despite the former India skipper having won the game for Chennai Super Kings against Mumbai India two day back with his keen sense of timing and keeping his cool in extremely trying conditions. Dhoni's blistering 13-ball unbeaten 28 helped CSK clinch a last-ball thriller against the five-time champions, scoring 16 runs off the last four deliveries to help Chennai win their second game in IPL 2022. Australian cricketer Chris Lynn hailed Dhoni's game awareness and said on espncricinfo that, \"MS knew where the ball was going to be. The guy is so powerful, he is agile, and even his running between the wickets was very crucial. Talk about belief, just his hunger and his game awareness is the best in the tournament. MS Dhoni is the master. Even though they won the game, he never shows too much emotion. It is his belief and hunger, and he has still got it. You have to give him credit. He is agile, he is competing, and he wants to win,\" said Lynn. \"Dhoni has so much passion for cricket. He has so much passion for CSK. The players of that calibre, they will always be at the top and do well and that experience will tell, that's what he's doing,\" CSK CEO KS Viswanathan said. Former India cricket team trainer Ramji Srinivasan said Dhoni \"has a different mindset\" altogether. \"I always believe Dhoni trains like an individual athlete,\" said Ramji, who was the India trainer during the 2011 World Cup and 2013 Champions Trophy. \"It is absolutely necessary to trust and believe in your skill and ability to deliver in a crucial time. You need to have that mindset and self-confidence for your body to respond like that. These both are highly interconnected. This aspect is called bio-rhythm, where your mind and body are in total sync,\" Ramji added. Ramji compared Dhoni with tennis great Roger Federer in terms of preparation. \"I would straight away compare Dhoni to Federer. In terms of preparation, you can see a lot of similarity. If you see Federer, he makes things look very easy...his forehand or backhand, his drop shot, serve and volley, serve. Everything looks so easy and effortless. But to make things look so easy, you need twice the hard work that the others are doing and it has to be smart work as well. \"Dhoni is a natural and his fitness is natural. His solid calf muscles and thighs can give enormous amount of power and speed. You see the way he collects the ball and sprints to the stumps and makes a run-out. Or the split, the previous year or the one before the last that he did during his stumping...look at the split. He is naturally strong. He exactly understands that and this is what bio-rhythm is all about. The body listens to his mind and his mind listens to his body. And most importantly, Dhoni trains smartly,\" added Ramji. Skipper Jadeja, expressing his delight with Dhoni's cameo, said, \"It feels good that Mahi bhai is still hungry, he is still in touch, and everybody in the dressing room feels calm knowing he is in the middle and if he stays till the end, definitely he will win the match for us.\" IANS Also Read: Third umpire should have intervened: Pant Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/24/338687-676089-dhoni-afp.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Guwahati win by virtue of 1st innings lead","link":"https://www.sentinelassam.com/sports/cricket/guwahati-win-by-virtue-of-1st-innings-lead-588939","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Guwahati won against Goalpara by virtue of the first innings lead in the Nuruddin Inter District Cricket Championship held at Goalpara","content":"Guwahati won against Goalpara by virtue of the first innings lead in the Nuruddin Inter District Cricket Championship held at Goalpara today. In reply to Goalpara's first innings total 114, Guwahati declared their first innings on their overnight score 215-6. Goalpara were 102-3 in their second innings when the match came to an end. Opener Nur Baksh remained not out on 55. Gokul Sarma (2-29) and Sahil Ahmed (1-5) shared three wickets between them.Also Read: Gokulam Kerala create history by extending unbeaten runAlso Watch: ","pubDate":"2022-04-24 06:11:37","full_description":"Guwahati won against Goalpara by virtue of the first innings lead in the Nuruddin Inter District Cricket Championship held at Goalpara today. In reply to Goalpara's first innings total 114, Guwahati declared their first innings on their overnight score 215-6. Goalpara were 102-3 in their second innings when the match came to an end. Opener Nur Baksh remained not out on 55. Gokul Sarma (2-29) and Sahil Ahmed (1-5) shared three wickets between them. Also Read: Gokulam Kerala create history by extending unbeaten run Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/04/24/338665-212745-jk-baruah.avif","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Talk show host Boria Majumdar to face two years ban as BCCI finds him guilty of intimidating Wriddhiman Saha over interview","link":"https://www.opindia.com/2022/04/bcci-wriddhiman-saha-boria-majumdar-ban-two-years/","keywords":["Cricket","Editor's picks","News Reports","Sports","BCCI","Intimidation","wriddhiman saha"],"creator":["OpIndia Staff"],"video_url":null,"description":"In February, Wriddhiman Saha had shared screenshots of threatening messages from a 'journalist', without naming anyone but netizens had speculated","content":"As per reports, the Board of Cricket Council in India (BCCI) is intending to ban talk show host and sports journalist, Boria Majumdar, for two years after a three-member BCCI committee found him guilty of harassing Indian wicket-keeper Wriddhiman Saha over an interview request. The committee examined the incident and concluded Majumdar guilty and as a result, he would be barred from visiting stadiums or meeting players in India for at least two years. This follows after Wriddhiman Saha took to Twitter in February of this year to post a screenshot of threatening messages received by him from an unnamed journalist requesting an interview and then humiliating him for not responding. In the post, Saha wrote, “After all of my contributions to Indian cricket..this is what I face from a so called “Respected” journalist! This is where the journalism has gone.” After all of my contributions to Indian cricket..this is what I face from a so called “Respected” journalist! This is where the journalism has gone. pic.twitter.com/woVyq1sOZX— Wriddhiman Saha (@Wriddhipops) February 19, 2022 Saha received widespread sympathy from the cricketing community following his disclosure. After which, taking note of the social media post, the BCCI appointed a committee comprised of vice-president Rajeev Shukla, treasurer Arun Dhumal, and apex council member Prabhtej Bhatia to investigate Saha’s claim. However, Majumdar had accused Saha of “altering” WhatsApp message screenshots. During his testimony before the committee, Saha named Boria Majumdar and said that he was “bullied” for an interview. On the condition of anonymity, a top BCCI official informed The Sunday Express that the Indian cricket board will advise all state units that Boria Majumdar is not to be allowed inside stadiums. He will not be granted media credentials for home matches, and the board will write to the ICC to have him blacklisted. Players also will not be allowed to interact with him.","pubDate":"2022-04-24 06:00:00","image_url":null,"source_id":"opindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Kohli&#039;s slump lingers on with second straight first-ball dismissal","link":"https://www.thestar.com.my/sport/cricket/2022/04/24/cricket-kohli039s-slump-lingers-on-with-second-straight-first-ball-dismissal","keywords":null,"creator":null,"video_url":null,"description":"MUMBAI (Reuters) - Virat Kohli was out on the first ball for the second straight match as his lean patch continued in the Indian Premier League on Saturday during his side Royal Challengers Bangalore's humiliating defeat to Sunrisers Hyderabad. Read full story","content":null,"pubDate":"2022-04-24 05:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/04/24/1562287.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"}]}