{"newsArray":[{"title":"Aussie cricket coach Justin Langer takes job in Indian Premier League with Lucknow Super Giants","link":"https://www.dailymail.co.uk/sport/cricket/article-12301077/Aussie-cricket-coach-Justin-Langer-takes-job-Indian-Premier-League-Lucknow-Super-Giants.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"REVEALED: Justin Langer's new lucrative coaching gig after the former Australian mentor vowed that he would never coach again following bitter split","content":"REVEALED: Justin Langer's new coaching gig after the former Australian mentor vowed that he would never coach again following bitter split Lucrative offer makes him change his mind Will be reunited with some Aussie players He still believes his best coaching years are ahead By Ric Chapman For Daily Mail Australia Updated: 01:43, 15 July 2023 e-mail View comments Controversial former Australian cricket coach Justin Langer has gone back on his word made a year ago about ever coaching again and has signed with the Indian Premier League's Lucknow Super Giants. Langer, 52, will take over the coaching and replaces former England coach Andy Flower at the helm of the IPL franchise. The former Australian opener left his Australian role last year, just months after coaching Australia to T20 World Cup and Ashes glory. Losing the locker room was considered the main reason following repeated angry outbursts. Langer parted ways with Cricket Australia (CA) after he was offered a tiny contract to remain in charge only until the end of the 2022 T20 World Cup. Former Australian cricket coach and former Aussie opening batter Justin Langer (pictured) once said 'never again' to coaching but the Indian rupees have changed his mind At the time he wanted a long-term deal which he thought he deserved following an Ashes series win, a drawn series in England and a Twenty20 World Cup. When he declined the relatively insulting CA offer, his emotions at the time led him to say he'd never coach again. But, it really does seem that time heals all wounds as he now packs his bags and heads to India. At the time of the poor CA offer, Langer was interviewed and said: 'I don't think I'll coach again. No, I don't think I'll coach again,' he repeated when on the Cricket Etc podcast with The Australian cricket writers Peter Lalor and Gideon Haigh. 'The craziness is – and it's really strange in cricket – if you think about a lot of the other codes, the best coaches are a lot older. It doesn't make sense in cricket. 'I say I'm not going to coach again, but I reckon I'm 10 years off being the best coach I could be.' Well, he's not quite 10 years away from those comments but he's having another crack. To keep himself busy during his time away from helming Australia, the gritty West Australian former opening batsman remained involved in cricket via the media, including colour commentating for Channel Seven. Aussie basher Marcus Stoinis is a star attraction for Lucknow and Langer will reunite with him England quick Mark Wood in action for Lucknow Super Giants in the IPL earlier this year In India he will be reunited with Australian all-rounder Marcus Stoinis, one of Lucknow's star players. 'Lucknow Super Giants are on the journey of building a great story in the IPL. We all have a role to play in that journey and I am excited to be a part of the team moving forward,' Langer said. Lucknow is a new side in the IPL and the team has surprised many by making the playoffs in its first two seasons. In the Lucknow lineup in 2023 was England's speed demon Mark Wood, who was sidelined for the opening two Ashes Tests, but who earned Player of the Match honours for his blistering 5-34 during the first innings in the third Test in Leeds. Share or comment on this article: Aussie cricket coach Justin Langer takes job in Indian Premier League with Lucknow Super Giants e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-15 00:43:18","image_url":"https://i.dailymail.co.uk/1s/2023/07/15/00/73239931-0-image-a-5_1689377594527.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How To Watch MLC 2023 Free Live Streaming Online, SEO vs WAF on JioCinema? Get TV Telecast Details of Seattle Orcas vs Washington Freedom Major League Cricket 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-mlc-2023-free-live-streaming-online-seo-vs-waf-on-jiocinema-get-tv-telecast-details-of-seattle-orcas-vs-washington-freedom-major-league-cricket-2023-match-5267021.html","keywords":null,"creator":null,"video_url":null,"description":"The third match of the new T20 tournament would see some of the game's exciting names go up against each other. Scroll down to get live streaming and telecast details of the match.","content":"Seattle Orcas would open their MLC 2023 campaign against Washington Freedom on July 15. The match would be played at the Grand Prairie Stadium and it starts at 6:00 am IST (Indian Standard Time). Viacom18 bagged the media rights of MLC 2023 in India and the live telecast of this match will be available on Sports 18 1/HD channels. Fans who want to watch live streaming of this match for free, can do so on the JioCinema app and website. Adam Zampa Wears Jersey No 420 for Los Angeles Knight Riders in MLC 2023, Fans React. Seattle Orcas vs Washington Freedom It's Finally Here‼️ We take on @wshfreedom in our opening match of #MLC2023 🏏 📢 Come out in your numbers #PodSquad #SOvWF #SeattleOrcas #MajorLeagueCricket #Veeam pic.twitter.com/ofXZ5RdteO — Seattle Orcas (@MLCSeattleOrcas) July 14, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-15 00:00:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test: ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਨੂੰ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ, ਅਸ਼ਵਿਨ ਨੇ ਮੈਚ ਵਿੱਚ ਲਈਆਂ 12 ਵਿਕਟਾਂ","link":"https://punjabi.abplive.com/sports/cricket/ind-vs-wi-1st-test-india-beat-west-indies-by-an-innings-and-141-runs-in-the-first-test-ashwin-took-12-wickets-in-the-match-731489","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"India vs West Indies, 1st Test Highlights:  ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਖਿਲਾਫ 2 ਮੈਚਾਂ ਦੀ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਜਿੱਤ ਕੇ ਸੀਰੀਜ਼ 'ਚ 1-0 ਦੀ ਬੜ੍ਹਤ ਬਣਾ ਲਈ ਹੈ। ਡੋਮਿਨਿਕਾ ਦੇ ਵਿੰਡਸਰ ਪਾਰਕ 'ਚ ਖੇਡੇ ਗਏ ਸੀਰੀਜ਼ ਦੇ ਪਹਿਲੇ ਮੈਚ 'ਚ ਭਾਰਤੀ ਟੀਮ ਵਲੋਂ ਬੱਲੇਬਾਜ਼ੀ ਅਤੇ ਗੇਂਦਬਾਜ਼ੀ ਦੋਵਾਂ ਵਿਭਾਗਾਂ 'ਚ ਸ਼ਾਨਦਾਰ ਪ੍ਰਦਰਸ਼ਨ ਕੀਤਾ ਗਿਆ। ਤੀਜੇ ਦਿਨ ਭਾਰਤੀ ਟੀਮ ਨੇ 421 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਪਹਿਲਾ ਐਲਾਨ ਕੀਤਾ।  ਇਸ ਤੋਂ ਬਾਅਦ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਆਪਣੀ ਦੂਜੀ ਪਾਰੀ 'ਚ ਸਿਰਫ 130 ਦੌੜਾਂ 'ਤੇ ਹੀ ਸਿਮਟ ਗਈ। ਭਾਰਤ ਲਈ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਨੇ ਦੂਜੀ ਪਾਰੀ ਵਿੱਚ ਗੇਂਦ ਨਾਲ 7 ਵਿਕਟਾਂ ਲਈਆਂ। ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਨੇ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਟਾਸ ਜਿੱਤ ਕੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਟੀਮ ਆਪਣੀ ਪਹਿਲੀ ਪਾਰੀ 'ਚ 150 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਇਸ ਪਾਰੀ 'ਚ ਭਾਰਤ ਲਈ 5 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਬਾਅਦ ਭਾਰਤੀ ਟੀਮ ਲਈ ਮੈਚ 'ਚ ਉਤਰੀ ਕਪਤਾਨ ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ ਦੀ ਸਲਾਮੀ ਜੋੜੀ ਨੇ ਟੀਮ ਨੂੰ ਬਿਹਤਰੀਨ ਸ਼ੁਰੂਆਤ ਦਿਵਾਉਣ ਦਾ ਕੰਮ ਕੀਤਾ। ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਵਿਚਾਲੇ ਪਹਿਲੀ ਵਿਕਟ ਲਈ 229 ਦੌੜਾਂ ਦੀ ਸਾਂਝੇਦਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਰੋਹਿਤ 103 ਦੌੜਾਂ ਦੀ ਸ਼ਾਨਦਾਰ ਪਾਰੀ ਖੇਡ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਯਸ਼ਸਵੀ ਦੇ ਬੱਲੇ ਨਾਲ 171 ਦੌੜਾਂ ਦੀ ਇਤਿਹਾਸਕ ਪਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਵਿਰਾਟ ਕੋਹਲੀ ਨੇ ਵੀ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਅਤੇ ਰਵਿੰਦਰ ਜਡੇਜਾ 37 ਦੌੜਾਂ ਬਣਾ ਕੇ ਨਾਬਾਦ ਪਰਤੇ। ਭਾਰਤੀ ਟੀਮ ਨੇ 5 ਵਿਕਟਾਂ ਦੇ ਨੁਕਸਾਨ 'ਤੇ 421 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਪਣੀ ਪਾਰੀ ਐਲਾਨ ਦਿੱਤੀ, ਜਿਸ ਤੋਂ ਉਸ ਨੇ 271 ਦੌੜਾਂ ਦੀ ਬੜ੍ਹਤ ਹਾਸਲ ਕਰ ਲਈ ਹੈ। ਵੈਸਟਇੰਡੀਜ਼ ਦੇ ਬੱਲੇਬਾਜ਼ ਫਿਰ ਅਸ਼ਵਿਨ ਦੀ ਸਪਿਨ 'ਚ ਫਸ ਗਏ ਤੀਜੇ ਦਿਨ ਦੇ ਦੂਜੇ ਸੈਸ਼ਨ ਵਿੱਚ ਜਦੋਂ ਭਾਰਤੀ ਟੀਮ ਦੀ ਪਾਰੀ ਐਲਾਨੀ ਗਈ ਤਾਂ ਦਿਨ ਦੀ ਖੇਡ ਵਿੱਚ ਲਗਭਗ 50 ਓਵਰ ਬਾਕੀ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਆਪਣੀ ਸਪਿਨ ਦਾ ਜਾਦੂ ਦਿਖਾਉਂਦੇ ਹੋਏ ਅਸ਼ਵਿਨ ਨੇ ਵਿੰਡੀਜ਼ ਟੀਮ ਦੀ ਦੂਜੀ ਪਾਰੀ ਨੂੰ ਸਮੇਟਣ 'ਚ ਜ਼ਿਆਦਾ ਸਮਾਂ ਨਹੀਂ ਲਗਾਇਆ। 58 ਦੇ ਸਕੋਰ ਤੱਕ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਅੱਧੀ ਟੀਮ ਪੈਵੇਲੀਅਨ ਪਰਤ ਚੁੱਕੀ ਸੀ। ਇਸ ਤੋਂ ਬਾਅਦ ਪੂਰੀ ਟੀਮ 130 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਆਪਣੇ ਕਰੀਅਰ 'ਚ 34ਵੀਂ ਵਾਰ ਇਕ ਪਾਰੀ 'ਚ 5 ਵਿਕਟਾਂ ਲੈਣ ਦਾ ਕਾਰਨਾਮਾ ਕੀਤਾ, ਜਦਕਿ 8ਵੀਂ ਵਾਰ ਮੈਚ 'ਚ 10 ਵਿਕਟਾਂ ਹਾਸਲ ਕੀਤੀਆਂ। ਇਸ ਮੈਚ 'ਚ 171 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਲਈ ਯਸ਼ਸਵੀ ਨੂੰ 'ਪਲੇਅਰ ਆਫ ਦਿ ਮੈਚ' ਦਾ ਖਿਤਾਬ ਦਿੱਤਾ ਗਿਆ ਹੈ।  ","content":"India vs West Indies, 1st Test Highlights: ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਖਿਲਾਫ 2 ਮੈਚਾਂ ਦੀ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਜਿੱਤ ਕੇ ਸੀਰੀਜ਼ 'ਚ 1-0 ਦੀ ਬੜ੍ਹਤ ਬਣਾ ਲਈ ਹੈ। ਡੋਮਿਨਿਕਾ ਦੇ ਵਿੰਡਸਰ ਪਾਰਕ 'ਚ ਖੇਡੇ ਗਏ ਸੀਰੀਜ਼ ਦੇ ਪਹਿਲੇ ਮੈਚ 'ਚ ਭਾਰਤੀ ਟੀਮ ਵਲੋਂ ਬੱਲੇਬਾਜ਼ੀ ਅਤੇ ਗੇਂਦਬਾਜ਼ੀ ਦੋਵਾਂ ਵਿਭਾਗਾਂ 'ਚ ਸ਼ਾਨਦਾਰ ਪ੍ਰਦਰਸ਼ਨ ਕੀਤਾ ਗਿਆ। ਤੀਜੇ ਦਿਨ ਭਾਰਤੀ ਟੀਮ ਨੇ 421 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਪਹਿਲਾ ਐਲਾਨ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਆਪਣੀ ਦੂਜੀ ਪਾਰੀ 'ਚ ਸਿਰਫ 130 ਦੌੜਾਂ 'ਤੇ ਹੀ ਸਿਮਟ ਗਈ। ਭਾਰਤ ਲਈ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਨੇ ਦੂਜੀ ਪਾਰੀ ਵਿੱਚ ਗੇਂਦ ਨਾਲ 7 ਵਿਕਟਾਂ ਲਈਆਂ। ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਨੇ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਟਾਸ ਜਿੱਤ ਕੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਟੀਮ ਆਪਣੀ ਪਹਿਲੀ ਪਾਰੀ 'ਚ 150 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਇਸ ਪਾਰੀ 'ਚ ਭਾਰਤ ਲਈ 5 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਬਾਅਦ ਭਾਰਤੀ ਟੀਮ ਲਈ ਮੈਚ 'ਚ ਉਤਰੀ ਕਪਤਾਨ ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ ਦੀ ਸਲਾਮੀ ਜੋੜੀ ਨੇ ਟੀਮ ਨੂੰ ਬਿਹਤਰੀਨ ਸ਼ੁਰੂਆਤ ਦਿਵਾਉਣ ਦਾ ਕੰਮ ਕੀਤਾ। ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਵਿਚਾਲੇ ਪਹਿਲੀ ਵਿਕਟ ਲਈ 229 ਦੌੜਾਂ ਦੀ ਸਾਂਝੇਦਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਰੋਹਿਤ 103 ਦੌੜਾਂ ਦੀ ਸ਼ਾਨਦਾਰ ਪਾਰੀ ਖੇਡ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਯਸ਼ਸਵੀ ਦੇ ਬੱਲੇ ਨਾਲ 171 ਦੌੜਾਂ ਦੀ ਇਤਿਹਾਸਕ ਪਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਵਿਰਾਟ ਕੋਹਲੀ ਨੇ ਵੀ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਅਤੇ ਰਵਿੰਦਰ ਜਡੇਜਾ 37 ਦੌੜਾਂ ਬਣਾ ਕੇ ਨਾਬਾਦ ਪਰਤੇ। ਭਾਰਤੀ ਟੀਮ ਨੇ 5 ਵਿਕਟਾਂ ਦੇ ਨੁਕਸਾਨ 'ਤੇ 421 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਪਣੀ ਪਾਰੀ ਐਲਾਨ ਦਿੱਤੀ, ਜਿਸ ਤੋਂ ਉਸ ਨੇ 271 ਦੌੜਾਂ ਦੀ ਬੜ੍ਹਤ ਹਾਸਲ ਕਰ ਲਈ ਹੈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਵੈਸਟਇੰਡੀਜ਼ ਦੇ ਬੱਲੇਬਾਜ਼ ਫਿਰ ਅਸ਼ਵਿਨ ਦੀ ਸਪਿਨ 'ਚ ਫਸ ਗਏ ਤੀਜੇ ਦਿਨ ਦੇ ਦੂਜੇ ਸੈਸ਼ਨ ਵਿੱਚ ਜਦੋਂ ਭਾਰਤੀ ਟੀਮ ਦੀ ਪਾਰੀ ਐਲਾਨੀ ਗਈ ਤਾਂ ਦਿਨ ਦੀ ਖੇਡ ਵਿੱਚ ਲਗਭਗ 50 ਓਵਰ ਬਾਕੀ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਆਪਣੀ ਸਪਿਨ ਦਾ ਜਾਦੂ ਦਿਖਾਉਂਦੇ ਹੋਏ ਅਸ਼ਵਿਨ ਨੇ ਵਿੰਡੀਜ਼ ਟੀਮ ਦੀ ਦੂਜੀ ਪਾਰੀ ਨੂੰ ਸਮੇਟਣ 'ਚ ਜ਼ਿਆਦਾ ਸਮਾਂ ਨਹੀਂ ਲਗਾਇਆ। 58 ਦੇ ਸਕੋਰ ਤੱਕ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਅੱਧੀ ਟੀਮ ਪੈਵੇਲੀਅਨ ਪਰਤ ਚੁੱਕੀ ਸੀ। ਇਸ ਤੋਂ ਬਾਅਦ ਪੂਰੀ ਟੀਮ 130 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਆਪਣੇ ਕਰੀਅਰ 'ਚ 34ਵੀਂ ਵਾਰ ਇਕ ਪਾਰੀ 'ਚ 5 ਵਿਕਟਾਂ ਲੈਣ ਦਾ ਕਾਰਨਾਮਾ ਕੀਤਾ, ਜਦਕਿ 8ਵੀਂ ਵਾਰ ਮੈਚ 'ਚ 10 ਵਿਕਟਾਂ ਹਾਸਲ ਕੀਤੀਆਂ। ਇਸ ਮੈਚ 'ਚ 171 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਲਈ ਯਸ਼ਸਵੀ ਨੂੰ 'ਪਲੇਅਰ ਆਫ ਦਿ ਮੈਚ' ਦਾ ਖਿਤਾਬ ਦਿੱਤਾ ਗਿਆ ਹੈ।","pubDate":"2023-07-14 23:52:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/15/7ed2a190c86730e5d575cef6cccd976f1689378166437700_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Punjabi"},{"title":"Ashwin spins his web as India thrash Windies in Test","link":"https://www.perthnow.com.au/sport/cricket/ashwin-spins-his-web-as-india-thrash-windies-in-test-c-11284089","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"India have thrashed the West Indies to win the first Test inside three days, thanks to spinner Ravichandran Ashwin spinning his web in Dominica.","content":"Ravichandran Ashwin feasted on West Indies wickets on a generous turning pitch to propel India to victory by an innings and 141 runs inside three days of the first Test. Ashwin took 7-71 in the second innings, his best figures overseas, as West Indies were bowled out for 130 in less than 51 overs. New cap Yashasvi Jaiswal scored 171 for India as the visitors declared their first innings at 5-421 about an hour after lunch for a lead of 271. That was imposing considering West Indies made just 150 in their first knock. Offering spin-friendly Windsor Park to two of the world's best spinners was considered overly charitable not long after West Indies won the toss and decided to let India bowl first. Ashwin, the No.1-ranked Test bowler with a point to prove after being omitted from the World Test Championship final against Australia, and Ravindra Jadeja, the No.1-ranked Test allrounder, padded already impressive statistics with 17 of the 20 West Indies wickets. Beside 5-60 from the first innings, Ashwin's dozen wickets in the match gave him an eighth 10-wicket haul in a Test, tying Anil Kumble's India record. They are tied for fifth on the all-time list. Jadeja took 2-38 on Friday for a match haul of five wickets. The hosts have gone the distance only twice in their last 10 Tests going back 16 months. India, meanwhile, extended their unbeaten run in the Caribbean to 14 Tests after a seventh win since 2006. The highest score by an India man on debut was 187 by Shikhar Dhawan in 2013, and Jaiswal looked set to beat it on Friday morning until he fell 16 runs short.","pubDate":"2023-07-14 22:09:52","image_url":"https://images.perthnow.com.au/publication/C-11284089/19b6e03faa394eacef8b7c983c0d9ab07021dcf3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Surrey captain Jordan eager to get his hands on T20 Blast title after World Cup and Hundred success","link":"https://www.dailymail.co.uk/sport/cricket/article-12300627/Surrey-captain-Jordan-eager-hands-T20-Blast-title-World-Cup-success.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"For a renowned T20 specialist like England's Chris Jordan, it remains a surprise that throughout his 16-year career, England's highest wicket-taker in the format is yet to win a T20 Blast title.","content":"Chris Jordan eager to get his hands on T20 Blast title after winning the World Cup and the Hundred... with white-ball specialist relishing chance to captain Surrey in their seventh Finals Day England’s highest wicket-taker in the format is yet to win a T20 Blast title Jordan won the T20 World Cup in 2022 and the Hundred two years ago The 34-year-old will captain Surrey in their seventh Finals Day on Saturday By Aadam Patel For Mailonline Updated: 22:31, 14 July 2023 e-mail View comments For a renowned T20 specialist like England’s Chris Jordan, it remains a surprise that throughout his 16-year career, England’s highest wicket-taker in the format is yet to win a T20 Blast title. That could all be about to change on Saturday as he leads Surrey into their seventh Finals Day. For a county of Surrey’s stature, it is perhaps an even bigger surprise that since their success in the inaugural edition of the competition in 2003, they have never won it since. Jordan, 34, insists he is as hungry as can be, after their quarter-final win against a Lancashire side containing three of England’s T20 World-Cup winners in their top four. ‘When you sit down and look back at your career, you remember those moments when you win series and titles like the World Cup and The Hundred but I haven’t got the T20 Blast title in the locker yet,’ Jordan tells Mail Sport. Surrey captain Chris Jordan (above) has his sights set on the T20 Blast trophy ‘There’s still plenty of space in the cabinet though,’ he adds with a hint of optimism. For Jordan, who returned to Surrey in 2021 after leaving for Sussex in 2012, the responsibility of captaincy is something he feels like he’s thriving on. After all, Eoin Morgan would regularly look to him for advice during reign as England captain and it is pretty much the same under Jos Buttler. Surrey won eight of their first 11 games in the Blast before Middlesex pulled off a record run-chase at the Oval. Despite losing their last three games and missing out on a home quarter-final, an impressive win at Old Trafford with Jordan taking two for 28, saw them secure their place for Edgbaston. It was the first time Lancashire had lost at home in the format since 2020. ‘I’ve enjoyed it (captaincy) thoroughly. With a county like Surrey with so much history, it’s a huge honour. Sometimes you’ve got to take the rough with the smooth and embrace those challenges but that’s what I’ve always done with my career,’ says Jordan. One of those challenges will be dealing with the absence of overseas star Sunil Narine, who chose to play in the Major League Cricket tournament in the US, which began on Thursday. Despite rumours suggesting Narine had planned a 9,000 mile round trip from Dallas to Birmingham, he pulled out on Wednesday evening. Will he be missed? ‘Of course, 100 per cent,’ says Jordan. Sunil’s been a huge part of our success but it presents an incredible opportunity for one of our guys to step up,’ insists Jordan. Alec Stewart, Surrey’s Director of Cricket, said he was 'disappointed and frustrated' at what had unfolded but Jordan admits that it’s not a surprise for him. Jordan (centre) celebrates England's T20 World Cup success with Adil Rashid and Moeen Ali ‘Speaking as someone who plays and has played lots of franchise cricket, it’s not ideal but it’s the way of the world right now. It’s not disappointing for me. It’s just unfortunate. You’ve got to understand the time and realise it’s not the first time and it’s not the last time that this has happened.’ And for the boy who grew up in Barbados, it is another sign of the increasing democratisation of world cricket. ‘Equally I’d flip it and say it’s great in a way because cricket is properly on the map now. I could never imagine a T20 league in USA as a child growing up,’ says Jordan. ‘Yes - Test cricket is still the pinnacle but having that connection with other demographics is where T20 comes in, as something between cricket and entertainment. There’s so much more interest in the game now and that can only be a good thing.’ Share or comment on this article: Surrey captain Jordan eager to get his hands on T20 Blast title after World Cup and Hundred success e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:31:08","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/19/73231875-0-image-m-41_1689360836264.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England star Kate Cross is backing the women's team to win the Ashes after ODI victory","link":"https://www.dailymail.co.uk/sport/cricket/article-12300923/England-star-Kate-Cross-backing-womens-team-win-Ashes-ODI-victory.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"KATE CROSS: What was I saying about the scripts of both the men's and women's Ashes being packed with plenty of twists and turns? Well, there was another twist at Bristol in our first ODI.","content":"England star Kate Cross is backing the women's team to win their remaining ODI's against Australia and regain the Ashes urn after their recent sensational victory Kate Cross believes England will beat Australia to regain the Ashes urn Cross starred as England won by two wickets in Wednesday's ODI clash Two more ODI's will follow and Cross is up for the challenge against the Aussies By Kate Cross For The Daily Mail Updated: 22:30, 14 July 2023 e-mail View comments What was I saying about the scripts of both the men’s and women’s Ashes being packed with plenty of twists and turns? Well, there was another twist at Bristol in our first ODI and it was one that ended with me and Heather Knight adding the 29 runs needed to beat Australia by two wickets on Wednesday. To be there at the end with the captain in front of our families and friends with the Ashes on the line was so special. I’ll never forget that winning moment. My mum and dad were there supporting and they were the first to fight their way through the crowd afterwards to give me more big hugs. Mum, Christine, doesn’t rate my batting and she told me that when I came in she turned to dad and said: ‘This has got first-baller written all over it, Dave!’ Thankfully that wasn’t the case and it means, from 6-0 down, we have fought our way back to 6-6. With two games left to play, the Ashes are very much alive. I’ve had messages from all sorts like Chris Woakes, Jimmy Anderson, Bumble, Michael Vaughan. So many eyes are on our Ashes and we know now after three victories in a row we have to win two more, at the Ageas Bowl on Saturday and Taunton on Tuesday, to lift the trophy for the first time since 2014. Kate Cross believes that England's women will beat Australia in the remaining ODI's and regain the Ashes urn Cross went in at No 10 batting against Australia and produced a brilliant ramp shot I would have liked us to have needed fewer than 29 when I went in at No 10 but I was quite calm. Heather’s been in those positions before and knows how to speak to me. So even though there was a lot of pressure, I didn’t really feel it. My mum said to me afterwards: ‘Why was Heather giving you the strike?’ But if we hadn’t taken the singles it might have got a lot tighter. We decided to take it in increments. First: ‘Let’s get this down to 20.’ Then: ‘Let’s get it down to 10’. Then it was five and when we did that Heather said: ‘Right, let’s try to win this now.’ Simple planning amid the chaos. It was Heather who came down to me and said ‘the ramp’s on’, before I played the shot that has received a lot of attention. It’s a shot I practise a lot and she gave me the confidence to do it. Cross (left) and Heather Knight held their nerve to beat Australia by two wickets on Wednesday England will be hoping for similar fortunes when they resume battle with Australia on Sunday It’s not often I go out to bat for England and I’d never been there at the end in any successful chase for any team since a game for Lancashire nine years ago! Heather’s elation when she hit the winning boundary was telling. She is usually this cool ice queen, so that goes to show how much it meant. I did feel as if I’d let the team down with the ball, so this was my chance to pull it back. Heather keeps on calling it the great escape and it does feel like we could be on the cusp of something extra special now. We know Australia will come back hard but we feel there’s better cricket to come from us and we will keep on focusing on ourselves rather than worry about them. Bring on the Ageas Bowl! Share or comment on this article: England star Kate Cross is backing the women's team to win the Ashes after ODI victory e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:30:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/22/73236911-0-image-m-48_1689369708713.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David Lloyd has done it all from player to coach to adored commentator, but his world was rocked","link":"https://www.dailymail.co.uk/sport/cricket/article-12300883/David-Lloyd-player-coach-adored-commentator-world-rocked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: Ilyas Khan does not remember the year but he knows it was some time in the mid-to-late 1970s. He was a teenager, a shy boy of Kashmiri heritage, born and raised in Lancashire.","content":"EXCLUSIVE: David Lloyd has done it all from player to coach to adored commentator, but his world was rocked by the fallout from the Rafiq scandal. It left him in a dark place...but he’s now coming back into the light David Lloyd has done it all in cricket, from player to coach to loved commentator The 76-year-old is one of the most celebrated figures in the cricketing world His life was rocked by the Azeem Rafiq scandal and was left in a dark place By Oliver Holt For The Daily Mail Updated: 22:48, 14 July 2023 e-mail View comments Ilyas Khan does not remember the year but he knows it was some time in the mid-to-late 1970s. He was a teenager, a shy boy of Kashmiri heritage, born and raised amid the Lancashire mill towns, a habitual victim of casual racist abuse, a kid who loved cricket. Now and then, he would go to watch the indoor winter nets sessions held at a local leisure centre by Accrington Cricket Club, one of the teams in the famed Lancashire League, which attracted international stars in those days, both as coaches and players. It cost 50p or a pound each week for subscriptions. ‘My family didn’t have two pennies to rub together,’ says Khan, who went on to own Accrington Stanley Football Club and is a respected multi-millionaire technologist and philanthropist. The players were usually all white boys anyway. Asian kids rarely featured. It was an intimidating culture for a boy like Khan. He hung around the margins, watching the players practise. ‘One evening, I was peering through the netting as usual,’ Khan says, ‘and David Lloyd saw me. He was already a legend. He’d scored a double century for England. He called over and said, “Come and have a go”. ‘He was putting on coaching sessions then and I told him I couldn’t afford it. He said, “Don’t worry about that”. I was still unsure. He said, “Come on, pad up”. It happened twice. That welcome that Bumble gave me, it made a massive impression on me. David 'Bumble' Lloyd throughout his career has helped raise the profile of English cricket Since retiring from coaching, he has become one of the sport's most renowned broadcasters At his home in Yorkshire, the 76-year-old has made a cricket ground with a full working wicket ‘To me, Bumble was the one who made everything good. That was a time when skinhead gangs used to roam around. He was a beacon of light for me. I was a victim of racist abuse every day but on those evenings in the nets, I was just a little boy playing cricket.’ Half a century on — half a century of Bumble being an evangelist for cricket, of drawing people into the game, of spreading the joy of the game — he smiles at the mention of Ilyas when I recall the story one day over breakfast during the third Test earlier this month. It is 9am on the second day at Headingley and Bumble is sitting outside the Ugly Mugs Cafe opposite the ground. He has got a plate of fried egg, bacon and sausage in front of him. ‘Good start to the day, this,’ he says. He points out that Ilyas repaid that small act of kindness later in his life many, many times over by stepping in with a hefty financial donation to rescue the cricket club when it was in trouble. Ilyas rescued Stanley, too. He took what Bumble had done for him and he paid it forward. Inside the cafe, on the menu on the wall, one of the dishes is called after Lloyd’s nickname. In the 1950s, the comedian Michael Bentine created a show called The Bumblies, about three little aliens from the planet Bumble who land on Earth to learn about Earth children and their games. The players in the Lancashire dressing room thought the characters resembled Lloyd and the name stuck. So on the menu, there is Bumble’s Bap: three sausages, three rashers of bacon, and an egg. There is a Tuffers Sarnie, too, although it is not as substantial. At his table, Bumble is chatting about the day ahead and what the pitch may hold in store. Anyone who loves cricket — and a lot of people who don’t — could listen to him all day, even if it’s just sitting here at a rickety table on a pavement in a Leeds suburb. ‘Get a bat and hit it on the pitch,’ he says, his voice low and rich and sonorous as if he is letting you in to a secret, taking you into his confidence, his enthusiasm rising with every word, ‘and at a club ground it goes “bom, bom, bom”.’ Lloyd got his 'Bumble' nickname after players in the Lancashire dressing room thought he resembled characters out of a television show. It followed him well beyond his days as a player Whenever Lloyd is at cricket games, supporters clamber over to get pictures and speak to him Now his voice quickens. It is as if he is back on Sky again, a master of his art. ‘But hit a bat on a Test pitch,’ he says, ‘and it goes “bang, bang, bang” because it’s that hard. It won’t be easy for the batters today. The pitch will get faster.’ He’s right: 11 wickets fall that day. He gets up to walk over to the press box and begin his day’s work with Mail Sport. A couple of people scrape back their chairs from neighbouring tables and ask for selfies and he chats and smiles with them and talks about England’s chances of fighting their way back into the series. He spots Mark Wood and Chris Woakes, soon to become England’s latest Headingley heroes, as they wander past on the other side of the road on their way to the changing rooms, and applauds them. The other diners applaud, too, and Wood and Woakes give a wave. A woman, who has had her back to us but has been listening to the conversation about the pitch and the Lancashire League and has heard the knowledge and the warmth pouring out of Lloyd, looks up as he is leaving. ‘We miss you, Bumble,’ she says. Everybody tells him that. Wherever he goes. Everybody wishes he were still part of Sky’s brilliant cricket coverage with Michael Atherton, Nasser Hussain and Ian Ward, colleagues who had become dear friends. And even though it is lovely to hear, it twists at his insides, too. Lloyd began his presenting career as a cricket commentator after he quit as ex-England coach It is more than 18 months since Lloyd’s world changed when his name was mentioned by former Yorkshire cricketer Azeem Rafiq at a DCMS select committee hearing into the racism scandal that had engulfed the county and which continues to reverberate around the game now. Rafiq, whose career at Yorkshire had been blighted by institutional racism, was under pressure to name names. Lloyd had swapped a few direct messages on Twitter with an account called Cricket Badger, run by a journalist called James Buttler, who Lloyd had never met. Lloyd had repeated stories he had been told about Rafiq’s personal life and had suggested it was difficult to integrate Asian cricketers into some local clubs because they were alienated by the drinking culture that dominates much of English sport. Lloyd was named by Azeem Rafiq at a DCMS select committee hearing into the racism scandal He had also suggested that ‘getting subs out of Asian cricketers is like getting blood out of a stone’. Cricket Badger told Rafiq about the conversations and Rafiq repeated them in front of the DCMS committee. He talked about ‘closet racists’ within the game. Sometimes, the wronged, on their mission to put things right, hurt good people on their journey. The die was cast. Lloyd phoned Rafiq immediately and apologised. He released a statement and also apologised to the wider Asian cricketing community. A month later, it was announced he was retiring from Sky Sports, where he had worked for 22 years as a much-adored commentator. The job, and the fact he had been an England player, England coach and an umpire as well as a brilliant analyst and a natural, instinctive broadcaster had turned him into a national treasure. ‘I’ve decided the time is right to pass on the microphone,’ his statement said. The Lancashire-born cricket icon would later leave his role as a Sky Sports commentator Amid the many, many tributes that flooded in, there was this from Rob Key, now England’s director of cricket. ‘What a sad day,’ he wrote. ‘The best person I know, by some distance as well. Love always, Bumble. No one does it better.’ We walk from the cafe along into Headingley. Bumble stops again and again for fans to take selfies. Australia fans stop and talk to him, too. He’ll talk to anyone. That hasn’t changed. Eventually, we get up to the media canteen and sit down in a quiet corner and talk about what happened. ‘After the DCMS hearing,’ Lloyd says, ‘I rang Azeem and apologised and we had a good conversation. As far as I was concerned — and I think he has said the same — we were fine. Azeem had a grievance and it wasn’t dealt with by his employers. The top people at Yorkshire were incompetent at dealing with his grievance and it escalated to a position where he had nowhere else to go. ‘The comment I made about getting blood out of a stone was stupid. I think there are issues about raising money for clubs through the bar but there are other ways to generate finance because we are a multi-racial country and we should be able to find a solution to the support a club needs to keep going. That shouldn’t be too hard. ‘I don’t bear any bitterness towards Azeem. None at all. I think some of the MPs on the DCMS committee were a bunch of chancers and grandstanders. Where is Julian Knight now? I think we know. Where is John Nicolson now? They were looking for a fall guy and I dropped straight into their lap.’ Lloyd had repeated stories he had been told about Rafiq’s personal life to a journalist and had suggested it was difficult to integrate Asian cricketers into some local clubs because they were alienated by the drinking culture. Pictured: Rafiq addressing the House of Commons When Lloyd announced his retirement, he was 74. The end of a job that he had given so much of his life to and which had become wrapped up with his identity, which he loved and which he knew he had been good at, was desperately hard for him to come to terms with. ‘I was in a complete whirl,’ Lloyd says. ‘I felt unbelievably isolated. My wife and I were moving house to North Yorkshire. The house was being done up and the builders were in and are mates and they could see there was a problem and I just immersed myself in the move. That’s how I try to deal with things. Any problem, just as soon as you wake up, work, work, work. Just never stop until you go to bed and that’s how I dealt with it. ‘I was lucky that it needed a hell of a lot of work. I got stuck in and that saved me because I would have done something stupid. ‘My self-esteem was absolutely dreadful. I wouldn’t answer the phone to anybody, even people like Atherton, who was ringing constantly. He wanted to come and see me and I said no. I just locked myself away. I didn’t engage with anybody. ‘My life was upside down and in turmoil. I have put a veneer on it when I’ve been hurting inside like you wouldn’t believe. It was desperately hard for Lloyd to come to terms with his retirement from commentary Lloyd (right) was previously a coach for the England team during a spell from 1995 to 1999 ‘I come back to Accrington. I am very comfortable with who I am. No worries at all. I don’t need anybody to tell me who I am. I’m a decent bloke. I know that. Because I have been brought up properly. And I know it’s a bit big-headed, but I could do it. ‘Going back to my dad, who was a lay preacher, he always said “just be yourself”. What you see is what you get. I’m not a fine-dining sort of bloke. End of play, have a curry, couple of pints, see you tomorrow, pretty basic. ‘I’ve been in a hell of a tunnel. In my life, I have never had any resentment with anyone and I’m getting back to that state again now. I’ve had one or two rows with Geoffrey Boycott in the past but I absolutely love him to bits. Bumble: A life in cricket 407 first-class matches and 208 List A matches for Lancashire (1965-83) Nine Tests and eight ODIs for England (1973-80) First-class Umpire (1985-87) Coached Lancashire (1993-96) and England (1996-99) Commentator for Sky Sports (1999-2021) <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/cricket/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement He has been a great standard bearer for English cricket because of the way he played and the way he commentated. I have had some flipping rows with Boycs because of who he is but it doesn’t last. I have been in a big tunnel but I am out of it.’ And so we talk about happy things because there are so many happy things in his life and because he spreads, still, so much joy throughout the game and through the force of his personality and because he has achieved so much and has so much still to achieve. You only need to say ‘Bumble’ and people who love sport smile. It is a precious gift. ‘I never walked away from a dinner with Bumble not feeling better about the world,’ Atherton told me recently. ‘I had so many wonderful times at Sky,’ Bumble says. ‘In earlier days, Bob Willis and Paul Allott were my best mates. That was the last of the summer wine. We’d go on steam train trips to north Wales. We were inseparable. When they left, the younger lads came in — Nasser, Atherton, Ward. And again, we were inseparable. I worked with David Gower and Ian Botham and they did their own thing, which was fine. I had a great working relationship with Bryan Henderson and Mark Lynch was a massive influence as a director. The whole production team was pushing all the time, young people with lots of energy and that rubs off on you. ‘It was a massive blow to me when Bob died. The most affectionate bloke you could ever come across, as a true mate. A very caring chap. The England lads hated him until they met him because he could be very critical with his dour act which he took over from a former England player and journalist, Robin Marlar, who was known as “Marlar the Snarler”. He’d do a hatchet job on everybody. Bob took that mantle on. ‘He was mortified once because he had to write a letter of apology to Chris Woakes for giving him 0 out of 10 for one performance because “you don’t get a point for turning up” and Woakes is the nicest fella you could ever wish to meet. I miss Bob every day. ‘There are so many cricket broadcasters I admire. Nowadays, I’d say Ian Bishop and Simon Doull. Atherton and Hussain are a cut above. Ian Ward is a fabulous presenter. Mel Jones, too. She is the real deal, a great voice. Ebony Rainford-Brent is excellent. Lloyd admits that there are so many wonderful broadcasters in cricket that he admires ‘I worked for TMS for 11 years before I worked for Sky and Jonathan Agnew is a fabulous broadcaster. I like Simon Mann’s understated style. And I was driving home earlier in the series, listening to an excellent passage of commentary from Daniel Norcross. I tapped him on the shoulder in the lunch queue the next day to tell him how much I’d enjoyed it. ‘Further back, Fred Trueman is one of my all-time heroes. He was a curmudgeon and of course no one ever bowled as fast but he was a brilliant broadcaster. Geoffrey was a box-office listen. You have to listen. You don’t have to agree. Tony Cozier, CMJ, Jim Maxwell and my all-time hero, Bill Lawry. ‘I admired Lawry’s enthusiasm, his one-eyedness, his passion for Australian cricket, inflexions in his voice, he gets the big moments. You can do all your little stories and your pastimes but don’t miss the big moments. He nailed it every time. ‘He had a great rapport with Richie Benaud and Tony Greig. You saw that with Michael Holding and Ravi Shastri and Sunil Gavaskar. You get familiar with each other and you bounce off. You just have that telepathy. ‘It’s like opening the batting. You don’t call. You just look and go. As a duo, you knew “he’s done, I’m in” or “he’s done and so am I”. And just let it go. It’s an English thing that less is more. ‘We were always told at Sky, “less is more, shut up”. Dan Maskell and Peter Alliss, two of the all-time greats of British sports commentary, let the pictures tell the story. Sometimes, you have to have the judgment to think, “I’ve nothing to add to the pictures”. Nasser Hussain is one of the broadcasters and cricket commentators Lloyd enjoys listening to ‘Back in my TMS days, I was nobody and I asked the show’s legendary producer, Peter Baxter, why he used me. He said my voice was perfect. And that has stood me in good stead, the tenor of my voice. It’s quite deep. If you’ve got enthusiasm, your inflexions will take you up and down and you can’t just be monotonal. And you always start down because if you don’t, there’s nowhere to go.’ Perhaps, for a while, Bumble felt he had nowhere to go, too. But he’s past that. He is a hugely valued contributor to Mail Sport, he does a few appearances for talkSPORT without payment, because ‘they’re a fantastic bunch’. ‘When I go on with Ally McCoist and Alan Brazil and Laura Woods, when she was there, it’s just a brilliant lift,’ he says. ‘It’s good fun. ‘I need to work. Cricket’s second nature. I’ll go and watch Lancashire women against Yorkshire women. ‘I went to watch Lancashire Seconds and Yorkshire Seconds. I do Lancashire TV, which is like going home. ‘Just to walk into Old Trafford... I’ll be able to do more work from May next year. I’ll be 77 then but I’m not 77. I’m in my 50s, probably. I want to get back to doing more.’ Until then, he has plenty to occupy him, watching Earth children and their games. Now, he works as a contributor to Mail Sport and also enjoys appearing on other sports shows At the home he and his wife have now moved into, north of York, he has even created his own Field of Dreams. ‘I’ve got a few acres,’ Bumble says, ‘and I have got machines. I could go four and a half hours on a tractor and I love it. ‘Switch off, tending to fields. One of the fields, I have made into a cricket ground, I have put a pitch in the middle and a scoreboard and cut the grass. ‘You can’t play on it. It’s just a spoof pitch. You’d need ambulances everywhere if you had a match on it but it’s a big field and we’ve put stumps in and I cut it every day.’ Share or comment on this article: David Lloyd has done it all, but his world was rocked by the fallout from the Rafiq scandal e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:30:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/22/73236077-0-image-m-93_1689368863140.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Test: Jaiswal, Ashwin Help India Beat Windies By Innings And 141 Runs","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-1st-test-day-3-yashasvi-jaiswal-ravichandran-ashwin-help-india-ease-past-west-indies-4209080","keywords":null,"creator":null,"video_url":null,"description":"Senior off-spinner R Ashwin picked up yet another five-wicket haul (7/71) to bowl India to an innings and 141-run win over West Indies in the opening Test in Dominica on Friday.","content":"The world's top-ranked bowler R Ashwin was too good for an ill-equipped West Indies batting line-up as his second five-wicket haul of the game set up India's innings and 141-run victory in the opening Test in Dominica on Friday. After India declared their first innings at 421 for five midway into the afternoon session, an improved batting show was expected from the Caribbean batters but they were simply not up to the task and collapsed to 130 all out in 50 overs to ensure a three-day finish. Ashwin followed his 33rd five-wicket haul in the first innings with envious figures of seven for 71 in 21.3 overs, his best in an overseas Test. The result was a foregone conclusion after the West Indies were bundled out for 150 on the opening day. India's big win was also set up by Yashasvi Jaiswal who made a sublime 171 on debut. Virat Kohli contributed with 76 off 182 but it was not among his fluent knocks as he had to work extremely hard for his runs and was even dropped twice along the way. The second and final Test starts in Port of Spain, Trinidad, from July 20. India, who have not lost a Test to West Indies since 2002, will be expected to complete a clean sweep and pick up crucial points in the World Test Championship. The writing was on the wall when the West Indies were reduced to 32 for four in their second innings. With the conditions resembling the slow and dry tracks of India, Rohit Sharma introduced spin as early as the fifth over. West Indies slipped to 27 for two in 19 overs at tea with Ashwin and Jadeja removing Kraigg Brathwaite (7) and Tagenarine Chanderpaul (7) respectively. Jadeja trapped Chanderpaul in front with the one that turned from middle stump and DRS showed it was clipping the top of his leg-stump. Advertisement Brathwaite had little clue on what the skilful Ashwin was up to as he edged a straighter one to Ajinkya Rahane at first slip. The only West Indies batter who looked assured in the middle was debutant Alick Athanaze (28 off 44), who was not afraid to sweep Ashwin before unleashing a square cut and a pull off Mohammed Siraj. The talented southpaw was eventually caught at short leg by Jaiswal off Ashwin in the 37th over. India declared an hour after lunch and it seemed they were waiting for debutant Ishan Kishan to get his first run which took 20 balls. The visitors batted for as many as 152.2 overs in their first innings, scoring at a run rate of 2.76 for a massive 271-run lead. Kohli was the lone India batter to be dismissed after lunch. After being dropped in the first over post the break, Kohli did not last long as he fell into the trap laid by offie Rahkeem Cornwall. The burly spinner got one to bounce from middle stump and Kohli ended up flicking to the waiting leg slip fielder. In the morning, Jaiswal became only the third Indian to score 150 on debut while Kohli had to toil for a half-century as the visitors reached 400 for four at lunch. Resuming the day at 312 for two, India managed 88 runs in 29 overs in the morning session for the loss of Jaiswal (171) and Ajinkya Rahane (3). The Indian batters had to work for their runs on a slow pitch offering a lot of turn and a heavy outfield. Kohli celebrating after hitting a rare boundary was proof of that. Left-arm spinner Jomel Warrican opened the bowling alongside Holder and instantly created issues for Kohli. The former India skipper got a life when he was dropped on 40 by West Indies captain Brathwaite. Kohli went for a drive off Warrican and Brathwaite ended up grassing an easy chance at cover. At the other end, Jaiswal stepped out to Warrican and dispatched him for a straight six. He became the third Indian to reach 150 on debut with a single, matching the feats of Shikhar Dhawan (187) and Rohit Sharma (177). A double hundred was in the offing for Jaiswal but it wasn't to be as he edged one that angled away from Alzarri Joseph. Soon after Rahane, who had a good opportunity to make a big impact, attempted a drive on the up on a slow pitch off Kemar Roach and ended up offering a simple catch at cover. With Rahkeem Cornwall not allowed to bowl in the morning as he did not take the field on day two, the West Indies offered some easy boundaries to India towards the end of the session. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-07-14 21:29:11","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravi Ashwin, Yashasvi Jaiswal Star As India Beat West Indies by an Innings and 141 Runs in 1st Test 2023","link":"https://www.latestly.com/socially/sports/cricket/ravi-ashwin-yashasvi-jaiswal-star-as-india-beat-west-indies-by-an-innings-and-141-runs-in-1st-test-2023-5267005.html","keywords":null,"creator":null,"video_url":null,"description":"The Rohit Sharma-led side got off to a roaring start in the fresh World Test Championship cycle with this dominant performance over the West Indies. Ravichandran Ashwin starred with 12 wickets in the match while debutant Yashasvi Jaiswal smashed 171 in India's first innings.","content":"Ravichandran Ashwin took seven wickets in the second innings of the first Test as India beat West Indies by a mammoth margin of an innings and 141 runs in the 1st Test 2023. Ashwin, on the back of a five-wicket haul in the 1st Test, finished the match with a total of 12 wickets in the game. Yashasvi Jaiswal earlier dazzled on his debut, scoring 171 runs in India's first innings effort of 421/5d. With this, India have a 1-0 lead in this series, with the next and remaining Test match scheduled to start on July 20. Ravi Ashwin Completes His Eighth 10-Wicket Haul in Test Cricket, Achieves Feat During Day 3 of IND vs WI 1st Test 2023. India Beat West Indies in 1st Test 2023 1ST Test. India Won by an innings and 141 Run(s) https://t.co/xaaoS40Fyf #WIvIND — BCCI (@BCCI) July 14, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-14 21:27:17","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test Day 3 Live Score Update: पहले टेस्ट में टीम इंडिया ने वेस्टइंडीज को एक पारी और 141 रनों से दी करारी शिकस्त, सीरीज में 1-0 की बनाई बढ़त","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-3-live-score-update-in-the-first-test-team-india-defeated-west-indies-by-an-innings-and-141-runs-took-a-1-0-lead-in-the-series-1864824.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया की तरफ से युवा सलामी बल्लेबाज यशस्वी जायसवाल ने सबसे ज्यादा 171 रन बनाए. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला गया. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. मैच के तीसरे दिन टीम इंडिया ने वेस्टइंडीज को एक पारी और 141 रन से हराकर सीरीज में 1-0 की बढ़त बना ली हैं. टीम इंडिया की तरफ से युवा सलामी बल्लेबाज यशस्वी जायसवाल ने सबसे ज्यादा 171 रन बनाए. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. जवाब में टीम इंडिया ने अपनी पहली पारी पांच विकेट पर 421 रन के स्कोर पर घोषित की. इस तरह टीम इंडिया को 271 रन की बढ़त मिली. वहीं, दूसरी पारी में वेस्टइंडीज की पूरी टीम 50.3 ओवर में महज 130 रन पर आल आउट हो गई. टीम इंडिया की ओर से आर अश्विन ने पहली पारी में सबसे ज्यादा पांच और दूसरी पारी में भी सात विकेट विकेट चटकाए. टीम इंडिया और वेस्टइंडीज के बीच दूसरा टेस्ट मैच 20 जुलाई से पोर्ट ऑफ स्पेन में खेला जाएगा. INDIA WON FIRST TEST MATCH. India beat West Indies by innings and 141 runs, a dream start in new WTC cycle. Stars are Ashwin with 12 wickets, hundreds by Rohit & Jaiswal. pic.twitter.com/r8jjiW9jSp — Johns. (@CricCrazyJohns) July 14, 2023 1ST Test. India Won by an innings and 141 Run(s) https://t.co/xaaoS40Fyf #WIvIND — BCCI (@BCCI) July 14, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-14 21:15:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aussie cricket coach Justin Langer takes job in Indian Premier League with Lucknow Super Giants","link":"https://www.dailymail.co.uk/sport/cricket/article-12301077/Aussie-cricket-coach-Justin-Langer-takes-job-Indian-Premier-League-Lucknow-Super-Giants.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"REVEALED: Justin Langer's new lucrative coaching gig after the former Australian mentor vowed that he would never coach again following bitter split","content":"REVEALED: Justin Langer's new coaching gig after the former Australian mentor vowed that he would never coach again following bitter split Lucrative offer makes him change his mind Will be reunited with some Aussie players He still believes his best coaching years are ahead By Ric Chapman For Daily Mail Australia Updated: 01:43, 15 July 2023 e-mail View comments Controversial former Australian cricket coach Justin Langer has gone back on his word made a year ago about ever coaching again and has signed with the Indian Premier League's Lucknow Super Giants. Langer, 52, will take over the coaching and replaces former England coach Andy Flower at the helm of the IPL franchise. The former Australian opener left his Australian role last year, just months after coaching Australia to T20 World Cup and Ashes glory. Losing the locker room was considered the main reason following repeated angry outbursts. Langer parted ways with Cricket Australia (CA) after he was offered a tiny contract to remain in charge only until the end of the 2022 T20 World Cup. Former Australian cricket coach and former Aussie opening batter Justin Langer (pictured) once said 'never again' to coaching but the Indian rupees have changed his mind At the time he wanted a long-term deal which he thought he deserved following an Ashes series win, a drawn series in England and a Twenty20 World Cup. When he declined the relatively insulting CA offer, his emotions at the time led him to say he'd never coach again. But, it really does seem that time heals all wounds as he now packs his bags and heads to India. At the time of the poor CA offer, Langer was interviewed and said: 'I don't think I'll coach again. No, I don't think I'll coach again,' he repeated when on the Cricket Etc podcast with The Australian cricket writers Peter Lalor and Gideon Haigh. 'The craziness is – and it's really strange in cricket – if you think about a lot of the other codes, the best coaches are a lot older. It doesn't make sense in cricket. 'I say I'm not going to coach again, but I reckon I'm 10 years off being the best coach I could be.' Well, he's not quite 10 years away from those comments but he's having another crack. To keep himself busy during his time away from helming Australia, the gritty West Australian former opening batsman remained involved in cricket via the media, including colour commentating for Channel Seven. Aussie basher Marcus Stoinis is a star attraction for Lucknow and Langer will reunite with him England quick Mark Wood in action for Lucknow Super Giants in the IPL earlier this year In India he will be reunited with Australian all-rounder Marcus Stoinis, one of Lucknow's star players. 'Lucknow Super Giants are on the journey of building a great story in the IPL. We all have a role to play in that journey and I am excited to be a part of the team moving forward,' Langer said. Lucknow is a new side in the IPL and the team has surprised many by making the playoffs in its first two seasons. In the Lucknow lineup in 2023 was England's speed demon Mark Wood, who was sidelined for the opening two Ashes Tests, but who earned Player of the Match honours for his blistering 5-34 during the first innings in the third Test in Leeds. Share or comment on this article: Aussie cricket coach Justin Langer takes job in Indian Premier League with Lucknow Super Giants e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-15 00:43:18","image_url":"https://i.dailymail.co.uk/1s/2023/07/15/00/73239931-0-image-a-5_1689377594527.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How To Watch MLC 2023 Free Live Streaming Online, SEO vs WAF on JioCinema? Get TV Telecast Details of Seattle Orcas vs Washington Freedom Major League Cricket 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-mlc-2023-free-live-streaming-online-seo-vs-waf-on-jiocinema-get-tv-telecast-details-of-seattle-orcas-vs-washington-freedom-major-league-cricket-2023-match-5267021.html","keywords":null,"creator":null,"video_url":null,"description":"The third match of the new T20 tournament would see some of the game's exciting names go up against each other. Scroll down to get live streaming and telecast details of the match.","content":"Seattle Orcas would open their MLC 2023 campaign against Washington Freedom on July 15. The match would be played at the Grand Prairie Stadium and it starts at 6:00 am IST (Indian Standard Time). Viacom18 bagged the media rights of MLC 2023 in India and the live telecast of this match will be available on Sports 18 1/HD channels. Fans who want to watch live streaming of this match for free, can do so on the JioCinema app and website. Adam Zampa Wears Jersey No 420 for Los Angeles Knight Riders in MLC 2023, Fans React. Seattle Orcas vs Washington Freedom It's Finally Here‼️ We take on @wshfreedom in our opening match of #MLC2023 🏏 📢 Come out in your numbers #PodSquad #SOvWF #SeattleOrcas #MajorLeagueCricket #Veeam pic.twitter.com/ofXZ5RdteO — Seattle Orcas (@MLCSeattleOrcas) July 14, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-15 00:00:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test: ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਨੂੰ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ, ਅਸ਼ਵਿਨ ਨੇ ਮੈਚ ਵਿੱਚ ਲਈਆਂ 12 ਵਿਕਟਾਂ","link":"https://punjabi.abplive.com/sports/cricket/ind-vs-wi-1st-test-india-beat-west-indies-by-an-innings-and-141-runs-in-the-first-test-ashwin-took-12-wickets-in-the-match-731489","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"India vs West Indies, 1st Test Highlights:  ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਖਿਲਾਫ 2 ਮੈਚਾਂ ਦੀ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਜਿੱਤ ਕੇ ਸੀਰੀਜ਼ 'ਚ 1-0 ਦੀ ਬੜ੍ਹਤ ਬਣਾ ਲਈ ਹੈ। ਡੋਮਿਨਿਕਾ ਦੇ ਵਿੰਡਸਰ ਪਾਰਕ 'ਚ ਖੇਡੇ ਗਏ ਸੀਰੀਜ਼ ਦੇ ਪਹਿਲੇ ਮੈਚ 'ਚ ਭਾਰਤੀ ਟੀਮ ਵਲੋਂ ਬੱਲੇਬਾਜ਼ੀ ਅਤੇ ਗੇਂਦਬਾਜ਼ੀ ਦੋਵਾਂ ਵਿਭਾਗਾਂ 'ਚ ਸ਼ਾਨਦਾਰ ਪ੍ਰਦਰਸ਼ਨ ਕੀਤਾ ਗਿਆ। ਤੀਜੇ ਦਿਨ ਭਾਰਤੀ ਟੀਮ ਨੇ 421 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਪਹਿਲਾ ਐਲਾਨ ਕੀਤਾ।  ਇਸ ਤੋਂ ਬਾਅਦ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਆਪਣੀ ਦੂਜੀ ਪਾਰੀ 'ਚ ਸਿਰਫ 130 ਦੌੜਾਂ 'ਤੇ ਹੀ ਸਿਮਟ ਗਈ। ਭਾਰਤ ਲਈ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਨੇ ਦੂਜੀ ਪਾਰੀ ਵਿੱਚ ਗੇਂਦ ਨਾਲ 7 ਵਿਕਟਾਂ ਲਈਆਂ। ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਨੇ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਟਾਸ ਜਿੱਤ ਕੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਟੀਮ ਆਪਣੀ ਪਹਿਲੀ ਪਾਰੀ 'ਚ 150 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਇਸ ਪਾਰੀ 'ਚ ਭਾਰਤ ਲਈ 5 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਬਾਅਦ ਭਾਰਤੀ ਟੀਮ ਲਈ ਮੈਚ 'ਚ ਉਤਰੀ ਕਪਤਾਨ ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ ਦੀ ਸਲਾਮੀ ਜੋੜੀ ਨੇ ਟੀਮ ਨੂੰ ਬਿਹਤਰੀਨ ਸ਼ੁਰੂਆਤ ਦਿਵਾਉਣ ਦਾ ਕੰਮ ਕੀਤਾ। ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਵਿਚਾਲੇ ਪਹਿਲੀ ਵਿਕਟ ਲਈ 229 ਦੌੜਾਂ ਦੀ ਸਾਂਝੇਦਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਰੋਹਿਤ 103 ਦੌੜਾਂ ਦੀ ਸ਼ਾਨਦਾਰ ਪਾਰੀ ਖੇਡ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਯਸ਼ਸਵੀ ਦੇ ਬੱਲੇ ਨਾਲ 171 ਦੌੜਾਂ ਦੀ ਇਤਿਹਾਸਕ ਪਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਵਿਰਾਟ ਕੋਹਲੀ ਨੇ ਵੀ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਅਤੇ ਰਵਿੰਦਰ ਜਡੇਜਾ 37 ਦੌੜਾਂ ਬਣਾ ਕੇ ਨਾਬਾਦ ਪਰਤੇ। ਭਾਰਤੀ ਟੀਮ ਨੇ 5 ਵਿਕਟਾਂ ਦੇ ਨੁਕਸਾਨ 'ਤੇ 421 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਪਣੀ ਪਾਰੀ ਐਲਾਨ ਦਿੱਤੀ, ਜਿਸ ਤੋਂ ਉਸ ਨੇ 271 ਦੌੜਾਂ ਦੀ ਬੜ੍ਹਤ ਹਾਸਲ ਕਰ ਲਈ ਹੈ। ਵੈਸਟਇੰਡੀਜ਼ ਦੇ ਬੱਲੇਬਾਜ਼ ਫਿਰ ਅਸ਼ਵਿਨ ਦੀ ਸਪਿਨ 'ਚ ਫਸ ਗਏ ਤੀਜੇ ਦਿਨ ਦੇ ਦੂਜੇ ਸੈਸ਼ਨ ਵਿੱਚ ਜਦੋਂ ਭਾਰਤੀ ਟੀਮ ਦੀ ਪਾਰੀ ਐਲਾਨੀ ਗਈ ਤਾਂ ਦਿਨ ਦੀ ਖੇਡ ਵਿੱਚ ਲਗਭਗ 50 ਓਵਰ ਬਾਕੀ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਆਪਣੀ ਸਪਿਨ ਦਾ ਜਾਦੂ ਦਿਖਾਉਂਦੇ ਹੋਏ ਅਸ਼ਵਿਨ ਨੇ ਵਿੰਡੀਜ਼ ਟੀਮ ਦੀ ਦੂਜੀ ਪਾਰੀ ਨੂੰ ਸਮੇਟਣ 'ਚ ਜ਼ਿਆਦਾ ਸਮਾਂ ਨਹੀਂ ਲਗਾਇਆ। 58 ਦੇ ਸਕੋਰ ਤੱਕ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਅੱਧੀ ਟੀਮ ਪੈਵੇਲੀਅਨ ਪਰਤ ਚੁੱਕੀ ਸੀ। ਇਸ ਤੋਂ ਬਾਅਦ ਪੂਰੀ ਟੀਮ 130 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਆਪਣੇ ਕਰੀਅਰ 'ਚ 34ਵੀਂ ਵਾਰ ਇਕ ਪਾਰੀ 'ਚ 5 ਵਿਕਟਾਂ ਲੈਣ ਦਾ ਕਾਰਨਾਮਾ ਕੀਤਾ, ਜਦਕਿ 8ਵੀਂ ਵਾਰ ਮੈਚ 'ਚ 10 ਵਿਕਟਾਂ ਹਾਸਲ ਕੀਤੀਆਂ। ਇਸ ਮੈਚ 'ਚ 171 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਲਈ ਯਸ਼ਸਵੀ ਨੂੰ 'ਪਲੇਅਰ ਆਫ ਦਿ ਮੈਚ' ਦਾ ਖਿਤਾਬ ਦਿੱਤਾ ਗਿਆ ਹੈ।  ","content":"India vs West Indies, 1st Test Highlights: ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਖਿਲਾਫ 2 ਮੈਚਾਂ ਦੀ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਜਿੱਤ ਕੇ ਸੀਰੀਜ਼ 'ਚ 1-0 ਦੀ ਬੜ੍ਹਤ ਬਣਾ ਲਈ ਹੈ। ਡੋਮਿਨਿਕਾ ਦੇ ਵਿੰਡਸਰ ਪਾਰਕ 'ਚ ਖੇਡੇ ਗਏ ਸੀਰੀਜ਼ ਦੇ ਪਹਿਲੇ ਮੈਚ 'ਚ ਭਾਰਤੀ ਟੀਮ ਵਲੋਂ ਬੱਲੇਬਾਜ਼ੀ ਅਤੇ ਗੇਂਦਬਾਜ਼ੀ ਦੋਵਾਂ ਵਿਭਾਗਾਂ 'ਚ ਸ਼ਾਨਦਾਰ ਪ੍ਰਦਰਸ਼ਨ ਕੀਤਾ ਗਿਆ। ਤੀਜੇ ਦਿਨ ਭਾਰਤੀ ਟੀਮ ਨੇ 421 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਪਹਿਲਾ ਐਲਾਨ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਆਪਣੀ ਦੂਜੀ ਪਾਰੀ 'ਚ ਸਿਰਫ 130 ਦੌੜਾਂ 'ਤੇ ਹੀ ਸਿਮਟ ਗਈ। ਭਾਰਤ ਲਈ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਨੇ ਦੂਜੀ ਪਾਰੀ ਵਿੱਚ ਗੇਂਦ ਨਾਲ 7 ਵਿਕਟਾਂ ਲਈਆਂ। ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਨੇ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਟਾਸ ਜਿੱਤ ਕੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਟੀਮ ਆਪਣੀ ਪਹਿਲੀ ਪਾਰੀ 'ਚ 150 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਇਸ ਪਾਰੀ 'ਚ ਭਾਰਤ ਲਈ 5 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਬਾਅਦ ਭਾਰਤੀ ਟੀਮ ਲਈ ਮੈਚ 'ਚ ਉਤਰੀ ਕਪਤਾਨ ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ ਦੀ ਸਲਾਮੀ ਜੋੜੀ ਨੇ ਟੀਮ ਨੂੰ ਬਿਹਤਰੀਨ ਸ਼ੁਰੂਆਤ ਦਿਵਾਉਣ ਦਾ ਕੰਮ ਕੀਤਾ। ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਵਿਚਾਲੇ ਪਹਿਲੀ ਵਿਕਟ ਲਈ 229 ਦੌੜਾਂ ਦੀ ਸਾਂਝੇਦਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਰੋਹਿਤ 103 ਦੌੜਾਂ ਦੀ ਸ਼ਾਨਦਾਰ ਪਾਰੀ ਖੇਡ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਯਸ਼ਸਵੀ ਦੇ ਬੱਲੇ ਨਾਲ 171 ਦੌੜਾਂ ਦੀ ਇਤਿਹਾਸਕ ਪਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਵਿਰਾਟ ਕੋਹਲੀ ਨੇ ਵੀ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਅਤੇ ਰਵਿੰਦਰ ਜਡੇਜਾ 37 ਦੌੜਾਂ ਬਣਾ ਕੇ ਨਾਬਾਦ ਪਰਤੇ। ਭਾਰਤੀ ਟੀਮ ਨੇ 5 ਵਿਕਟਾਂ ਦੇ ਨੁਕਸਾਨ 'ਤੇ 421 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਪਣੀ ਪਾਰੀ ਐਲਾਨ ਦਿੱਤੀ, ਜਿਸ ਤੋਂ ਉਸ ਨੇ 271 ਦੌੜਾਂ ਦੀ ਬੜ੍ਹਤ ਹਾਸਲ ਕਰ ਲਈ ਹੈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਵੈਸਟਇੰਡੀਜ਼ ਦੇ ਬੱਲੇਬਾਜ਼ ਫਿਰ ਅਸ਼ਵਿਨ ਦੀ ਸਪਿਨ 'ਚ ਫਸ ਗਏ ਤੀਜੇ ਦਿਨ ਦੇ ਦੂਜੇ ਸੈਸ਼ਨ ਵਿੱਚ ਜਦੋਂ ਭਾਰਤੀ ਟੀਮ ਦੀ ਪਾਰੀ ਐਲਾਨੀ ਗਈ ਤਾਂ ਦਿਨ ਦੀ ਖੇਡ ਵਿੱਚ ਲਗਭਗ 50 ਓਵਰ ਬਾਕੀ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਆਪਣੀ ਸਪਿਨ ਦਾ ਜਾਦੂ ਦਿਖਾਉਂਦੇ ਹੋਏ ਅਸ਼ਵਿਨ ਨੇ ਵਿੰਡੀਜ਼ ਟੀਮ ਦੀ ਦੂਜੀ ਪਾਰੀ ਨੂੰ ਸਮੇਟਣ 'ਚ ਜ਼ਿਆਦਾ ਸਮਾਂ ਨਹੀਂ ਲਗਾਇਆ। 58 ਦੇ ਸਕੋਰ ਤੱਕ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਅੱਧੀ ਟੀਮ ਪੈਵੇਲੀਅਨ ਪਰਤ ਚੁੱਕੀ ਸੀ। ਇਸ ਤੋਂ ਬਾਅਦ ਪੂਰੀ ਟੀਮ 130 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਆਪਣੇ ਕਰੀਅਰ 'ਚ 34ਵੀਂ ਵਾਰ ਇਕ ਪਾਰੀ 'ਚ 5 ਵਿਕਟਾਂ ਲੈਣ ਦਾ ਕਾਰਨਾਮਾ ਕੀਤਾ, ਜਦਕਿ 8ਵੀਂ ਵਾਰ ਮੈਚ 'ਚ 10 ਵਿਕਟਾਂ ਹਾਸਲ ਕੀਤੀਆਂ। ਇਸ ਮੈਚ 'ਚ 171 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਲਈ ਯਸ਼ਸਵੀ ਨੂੰ 'ਪਲੇਅਰ ਆਫ ਦਿ ਮੈਚ' ਦਾ ਖਿਤਾਬ ਦਿੱਤਾ ਗਿਆ ਹੈ।","pubDate":"2023-07-14 23:52:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/15/7ed2a190c86730e5d575cef6cccd976f1689378166437700_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Punjabi"},{"title":"Ashwin spins his web as India thrash Windies in Test","link":"https://www.perthnow.com.au/sport/cricket/ashwin-spins-his-web-as-india-thrash-windies-in-test-c-11284089","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"India have thrashed the West Indies to win the first Test inside three days, thanks to spinner Ravichandran Ashwin spinning his web in Dominica.","content":"Ravichandran Ashwin feasted on West Indies wickets on a generous turning pitch to propel India to victory by an innings and 141 runs inside three days of the first Test. Ashwin took 7-71 in the second innings, his best figures overseas, as West Indies were bowled out for 130 in less than 51 overs. New cap Yashasvi Jaiswal scored 171 for India as the visitors declared their first innings at 5-421 about an hour after lunch for a lead of 271. That was imposing considering West Indies made just 150 in their first knock. Offering spin-friendly Windsor Park to two of the world's best spinners was considered overly charitable not long after West Indies won the toss and decided to let India bowl first. Ashwin, the No.1-ranked Test bowler with a point to prove after being omitted from the World Test Championship final against Australia, and Ravindra Jadeja, the No.1-ranked Test allrounder, padded already impressive statistics with 17 of the 20 West Indies wickets. Beside 5-60 from the first innings, Ashwin's dozen wickets in the match gave him an eighth 10-wicket haul in a Test, tying Anil Kumble's India record. They are tied for fifth on the all-time list. Jadeja took 2-38 on Friday for a match haul of five wickets. The hosts have gone the distance only twice in their last 10 Tests going back 16 months. India, meanwhile, extended their unbeaten run in the Caribbean to 14 Tests after a seventh win since 2006. The highest score by an India man on debut was 187 by Shikhar Dhawan in 2013, and Jaiswal looked set to beat it on Friday morning until he fell 16 runs short.","pubDate":"2023-07-14 22:09:52","image_url":"https://images.perthnow.com.au/publication/C-11284089/19b6e03faa394eacef8b7c983c0d9ab07021dcf3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Surrey captain Jordan eager to get his hands on T20 Blast title after World Cup and Hundred success","link":"https://www.dailymail.co.uk/sport/cricket/article-12300627/Surrey-captain-Jordan-eager-hands-T20-Blast-title-World-Cup-success.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"For a renowned T20 specialist like England's Chris Jordan, it remains a surprise that throughout his 16-year career, England's highest wicket-taker in the format is yet to win a T20 Blast title.","content":"Chris Jordan eager to get his hands on T20 Blast title after winning the World Cup and the Hundred... with white-ball specialist relishing chance to captain Surrey in their seventh Finals Day England’s highest wicket-taker in the format is yet to win a T20 Blast title Jordan won the T20 World Cup in 2022 and the Hundred two years ago The 34-year-old will captain Surrey in their seventh Finals Day on Saturday By Aadam Patel For Mailonline Updated: 22:31, 14 July 2023 e-mail View comments For a renowned T20 specialist like England’s Chris Jordan, it remains a surprise that throughout his 16-year career, England’s highest wicket-taker in the format is yet to win a T20 Blast title. That could all be about to change on Saturday as he leads Surrey into their seventh Finals Day. For a county of Surrey’s stature, it is perhaps an even bigger surprise that since their success in the inaugural edition of the competition in 2003, they have never won it since. Jordan, 34, insists he is as hungry as can be, after their quarter-final win against a Lancashire side containing three of England’s T20 World-Cup winners in their top four. ‘When you sit down and look back at your career, you remember those moments when you win series and titles like the World Cup and The Hundred but I haven’t got the T20 Blast title in the locker yet,’ Jordan tells Mail Sport. Surrey captain Chris Jordan (above) has his sights set on the T20 Blast trophy ‘There’s still plenty of space in the cabinet though,’ he adds with a hint of optimism. For Jordan, who returned to Surrey in 2021 after leaving for Sussex in 2012, the responsibility of captaincy is something he feels like he’s thriving on. After all, Eoin Morgan would regularly look to him for advice during reign as England captain and it is pretty much the same under Jos Buttler. Surrey won eight of their first 11 games in the Blast before Middlesex pulled off a record run-chase at the Oval. Despite losing their last three games and missing out on a home quarter-final, an impressive win at Old Trafford with Jordan taking two for 28, saw them secure their place for Edgbaston. It was the first time Lancashire had lost at home in the format since 2020. ‘I’ve enjoyed it (captaincy) thoroughly. With a county like Surrey with so much history, it’s a huge honour. Sometimes you’ve got to take the rough with the smooth and embrace those challenges but that’s what I’ve always done with my career,’ says Jordan. One of those challenges will be dealing with the absence of overseas star Sunil Narine, who chose to play in the Major League Cricket tournament in the US, which began on Thursday. Despite rumours suggesting Narine had planned a 9,000 mile round trip from Dallas to Birmingham, he pulled out on Wednesday evening. Will he be missed? ‘Of course, 100 per cent,’ says Jordan. Sunil’s been a huge part of our success but it presents an incredible opportunity for one of our guys to step up,’ insists Jordan. Alec Stewart, Surrey’s Director of Cricket, said he was 'disappointed and frustrated' at what had unfolded but Jordan admits that it’s not a surprise for him. Jordan (centre) celebrates England's T20 World Cup success with Adil Rashid and Moeen Ali ‘Speaking as someone who plays and has played lots of franchise cricket, it’s not ideal but it’s the way of the world right now. It’s not disappointing for me. It’s just unfortunate. You’ve got to understand the time and realise it’s not the first time and it’s not the last time that this has happened.’ And for the boy who grew up in Barbados, it is another sign of the increasing democratisation of world cricket. ‘Equally I’d flip it and say it’s great in a way because cricket is properly on the map now. I could never imagine a T20 league in USA as a child growing up,’ says Jordan. ‘Yes - Test cricket is still the pinnacle but having that connection with other demographics is where T20 comes in, as something between cricket and entertainment. There’s so much more interest in the game now and that can only be a good thing.’ Share or comment on this article: Surrey captain Jordan eager to get his hands on T20 Blast title after World Cup and Hundred success e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:31:08","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/19/73231875-0-image-m-41_1689360836264.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England star Kate Cross is backing the women's team to win the Ashes after ODI victory","link":"https://www.dailymail.co.uk/sport/cricket/article-12300923/England-star-Kate-Cross-backing-womens-team-win-Ashes-ODI-victory.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"KATE CROSS: What was I saying about the scripts of both the men's and women's Ashes being packed with plenty of twists and turns? Well, there was another twist at Bristol in our first ODI.","content":"England star Kate Cross is backing the women's team to win their remaining ODI's against Australia and regain the Ashes urn after their recent sensational victory Kate Cross believes England will beat Australia to regain the Ashes urn Cross starred as England won by two wickets in Wednesday's ODI clash Two more ODI's will follow and Cross is up for the challenge against the Aussies By Kate Cross For The Daily Mail Updated: 22:30, 14 July 2023 e-mail View comments What was I saying about the scripts of both the men’s and women’s Ashes being packed with plenty of twists and turns? Well, there was another twist at Bristol in our first ODI and it was one that ended with me and Heather Knight adding the 29 runs needed to beat Australia by two wickets on Wednesday. To be there at the end with the captain in front of our families and friends with the Ashes on the line was so special. I’ll never forget that winning moment. My mum and dad were there supporting and they were the first to fight their way through the crowd afterwards to give me more big hugs. Mum, Christine, doesn’t rate my batting and she told me that when I came in she turned to dad and said: ‘This has got first-baller written all over it, Dave!’ Thankfully that wasn’t the case and it means, from 6-0 down, we have fought our way back to 6-6. With two games left to play, the Ashes are very much alive. I’ve had messages from all sorts like Chris Woakes, Jimmy Anderson, Bumble, Michael Vaughan. So many eyes are on our Ashes and we know now after three victories in a row we have to win two more, at the Ageas Bowl on Saturday and Taunton on Tuesday, to lift the trophy for the first time since 2014. Kate Cross believes that England's women will beat Australia in the remaining ODI's and regain the Ashes urn Cross went in at No 10 batting against Australia and produced a brilliant ramp shot I would have liked us to have needed fewer than 29 when I went in at No 10 but I was quite calm. Heather’s been in those positions before and knows how to speak to me. So even though there was a lot of pressure, I didn’t really feel it. My mum said to me afterwards: ‘Why was Heather giving you the strike?’ But if we hadn’t taken the singles it might have got a lot tighter. We decided to take it in increments. First: ‘Let’s get this down to 20.’ Then: ‘Let’s get it down to 10’. Then it was five and when we did that Heather said: ‘Right, let’s try to win this now.’ Simple planning amid the chaos. It was Heather who came down to me and said ‘the ramp’s on’, before I played the shot that has received a lot of attention. It’s a shot I practise a lot and she gave me the confidence to do it. Cross (left) and Heather Knight held their nerve to beat Australia by two wickets on Wednesday England will be hoping for similar fortunes when they resume battle with Australia on Sunday It’s not often I go out to bat for England and I’d never been there at the end in any successful chase for any team since a game for Lancashire nine years ago! Heather’s elation when she hit the winning boundary was telling. She is usually this cool ice queen, so that goes to show how much it meant. I did feel as if I’d let the team down with the ball, so this was my chance to pull it back. Heather keeps on calling it the great escape and it does feel like we could be on the cusp of something extra special now. We know Australia will come back hard but we feel there’s better cricket to come from us and we will keep on focusing on ourselves rather than worry about them. Bring on the Ageas Bowl! Share or comment on this article: England star Kate Cross is backing the women's team to win the Ashes after ODI victory e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:30:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/22/73236911-0-image-m-48_1689369708713.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David Lloyd has done it all from player to coach to adored commentator, but his world was rocked","link":"https://www.dailymail.co.uk/sport/cricket/article-12300883/David-Lloyd-player-coach-adored-commentator-world-rocked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: Ilyas Khan does not remember the year but he knows it was some time in the mid-to-late 1970s. He was a teenager, a shy boy of Kashmiri heritage, born and raised in Lancashire.","content":"EXCLUSIVE: David Lloyd has done it all from player to coach to adored commentator, but his world was rocked by the fallout from the Rafiq scandal. It left him in a dark place...but he’s now coming back into the light David Lloyd has done it all in cricket, from player to coach to loved commentator The 76-year-old is one of the most celebrated figures in the cricketing world His life was rocked by the Azeem Rafiq scandal and was left in a dark place By Oliver Holt For The Daily Mail Updated: 22:48, 14 July 2023 e-mail View comments Ilyas Khan does not remember the year but he knows it was some time in the mid-to-late 1970s. He was a teenager, a shy boy of Kashmiri heritage, born and raised amid the Lancashire mill towns, a habitual victim of casual racist abuse, a kid who loved cricket. Now and then, he would go to watch the indoor winter nets sessions held at a local leisure centre by Accrington Cricket Club, one of the teams in the famed Lancashire League, which attracted international stars in those days, both as coaches and players. It cost 50p or a pound each week for subscriptions. ‘My family didn’t have two pennies to rub together,’ says Khan, who went on to own Accrington Stanley Football Club and is a respected multi-millionaire technologist and philanthropist. The players were usually all white boys anyway. Asian kids rarely featured. It was an intimidating culture for a boy like Khan. He hung around the margins, watching the players practise. ‘One evening, I was peering through the netting as usual,’ Khan says, ‘and David Lloyd saw me. He was already a legend. He’d scored a double century for England. He called over and said, “Come and have a go”. ‘He was putting on coaching sessions then and I told him I couldn’t afford it. He said, “Don’t worry about that”. I was still unsure. He said, “Come on, pad up”. It happened twice. That welcome that Bumble gave me, it made a massive impression on me. David 'Bumble' Lloyd throughout his career has helped raise the profile of English cricket Since retiring from coaching, he has become one of the sport's most renowned broadcasters At his home in Yorkshire, the 76-year-old has made a cricket ground with a full working wicket ‘To me, Bumble was the one who made everything good. That was a time when skinhead gangs used to roam around. He was a beacon of light for me. I was a victim of racist abuse every day but on those evenings in the nets, I was just a little boy playing cricket.’ Half a century on — half a century of Bumble being an evangelist for cricket, of drawing people into the game, of spreading the joy of the game — he smiles at the mention of Ilyas when I recall the story one day over breakfast during the third Test earlier this month. It is 9am on the second day at Headingley and Bumble is sitting outside the Ugly Mugs Cafe opposite the ground. He has got a plate of fried egg, bacon and sausage in front of him. ‘Good start to the day, this,’ he says. He points out that Ilyas repaid that small act of kindness later in his life many, many times over by stepping in with a hefty financial donation to rescue the cricket club when it was in trouble. Ilyas rescued Stanley, too. He took what Bumble had done for him and he paid it forward. Inside the cafe, on the menu on the wall, one of the dishes is called after Lloyd’s nickname. In the 1950s, the comedian Michael Bentine created a show called The Bumblies, about three little aliens from the planet Bumble who land on Earth to learn about Earth children and their games. The players in the Lancashire dressing room thought the characters resembled Lloyd and the name stuck. So on the menu, there is Bumble’s Bap: three sausages, three rashers of bacon, and an egg. There is a Tuffers Sarnie, too, although it is not as substantial. At his table, Bumble is chatting about the day ahead and what the pitch may hold in store. Anyone who loves cricket — and a lot of people who don’t — could listen to him all day, even if it’s just sitting here at a rickety table on a pavement in a Leeds suburb. ‘Get a bat and hit it on the pitch,’ he says, his voice low and rich and sonorous as if he is letting you in to a secret, taking you into his confidence, his enthusiasm rising with every word, ‘and at a club ground it goes “bom, bom, bom”.’ Lloyd got his 'Bumble' nickname after players in the Lancashire dressing room thought he resembled characters out of a television show. It followed him well beyond his days as a player Whenever Lloyd is at cricket games, supporters clamber over to get pictures and speak to him Now his voice quickens. It is as if he is back on Sky again, a master of his art. ‘But hit a bat on a Test pitch,’ he says, ‘and it goes “bang, bang, bang” because it’s that hard. It won’t be easy for the batters today. The pitch will get faster.’ He’s right: 11 wickets fall that day. He gets up to walk over to the press box and begin his day’s work with Mail Sport. A couple of people scrape back their chairs from neighbouring tables and ask for selfies and he chats and smiles with them and talks about England’s chances of fighting their way back into the series. He spots Mark Wood and Chris Woakes, soon to become England’s latest Headingley heroes, as they wander past on the other side of the road on their way to the changing rooms, and applauds them. The other diners applaud, too, and Wood and Woakes give a wave. A woman, who has had her back to us but has been listening to the conversation about the pitch and the Lancashire League and has heard the knowledge and the warmth pouring out of Lloyd, looks up as he is leaving. ‘We miss you, Bumble,’ she says. Everybody tells him that. Wherever he goes. Everybody wishes he were still part of Sky’s brilliant cricket coverage with Michael Atherton, Nasser Hussain and Ian Ward, colleagues who had become dear friends. And even though it is lovely to hear, it twists at his insides, too. Lloyd began his presenting career as a cricket commentator after he quit as ex-England coach It is more than 18 months since Lloyd’s world changed when his name was mentioned by former Yorkshire cricketer Azeem Rafiq at a DCMS select committee hearing into the racism scandal that had engulfed the county and which continues to reverberate around the game now. Rafiq, whose career at Yorkshire had been blighted by institutional racism, was under pressure to name names. Lloyd had swapped a few direct messages on Twitter with an account called Cricket Badger, run by a journalist called James Buttler, who Lloyd had never met. Lloyd had repeated stories he had been told about Rafiq’s personal life and had suggested it was difficult to integrate Asian cricketers into some local clubs because they were alienated by the drinking culture that dominates much of English sport. Lloyd was named by Azeem Rafiq at a DCMS select committee hearing into the racism scandal He had also suggested that ‘getting subs out of Asian cricketers is like getting blood out of a stone’. Cricket Badger told Rafiq about the conversations and Rafiq repeated them in front of the DCMS committee. He talked about ‘closet racists’ within the game. Sometimes, the wronged, on their mission to put things right, hurt good people on their journey. The die was cast. Lloyd phoned Rafiq immediately and apologised. He released a statement and also apologised to the wider Asian cricketing community. A month later, it was announced he was retiring from Sky Sports, where he had worked for 22 years as a much-adored commentator. The job, and the fact he had been an England player, England coach and an umpire as well as a brilliant analyst and a natural, instinctive broadcaster had turned him into a national treasure. ‘I’ve decided the time is right to pass on the microphone,’ his statement said. The Lancashire-born cricket icon would later leave his role as a Sky Sports commentator Amid the many, many tributes that flooded in, there was this from Rob Key, now England’s director of cricket. ‘What a sad day,’ he wrote. ‘The best person I know, by some distance as well. Love always, Bumble. No one does it better.’ We walk from the cafe along into Headingley. Bumble stops again and again for fans to take selfies. Australia fans stop and talk to him, too. He’ll talk to anyone. That hasn’t changed. Eventually, we get up to the media canteen and sit down in a quiet corner and talk about what happened. ‘After the DCMS hearing,’ Lloyd says, ‘I rang Azeem and apologised and we had a good conversation. As far as I was concerned — and I think he has said the same — we were fine. Azeem had a grievance and it wasn’t dealt with by his employers. The top people at Yorkshire were incompetent at dealing with his grievance and it escalated to a position where he had nowhere else to go. ‘The comment I made about getting blood out of a stone was stupid. I think there are issues about raising money for clubs through the bar but there are other ways to generate finance because we are a multi-racial country and we should be able to find a solution to the support a club needs to keep going. That shouldn’t be too hard. ‘I don’t bear any bitterness towards Azeem. None at all. I think some of the MPs on the DCMS committee were a bunch of chancers and grandstanders. Where is Julian Knight now? I think we know. Where is John Nicolson now? They were looking for a fall guy and I dropped straight into their lap.’ Lloyd had repeated stories he had been told about Rafiq’s personal life to a journalist and had suggested it was difficult to integrate Asian cricketers into some local clubs because they were alienated by the drinking culture. Pictured: Rafiq addressing the House of Commons When Lloyd announced his retirement, he was 74. The end of a job that he had given so much of his life to and which had become wrapped up with his identity, which he loved and which he knew he had been good at, was desperately hard for him to come to terms with. ‘I was in a complete whirl,’ Lloyd says. ‘I felt unbelievably isolated. My wife and I were moving house to North Yorkshire. The house was being done up and the builders were in and are mates and they could see there was a problem and I just immersed myself in the move. That’s how I try to deal with things. Any problem, just as soon as you wake up, work, work, work. Just never stop until you go to bed and that’s how I dealt with it. ‘I was lucky that it needed a hell of a lot of work. I got stuck in and that saved me because I would have done something stupid. ‘My self-esteem was absolutely dreadful. I wouldn’t answer the phone to anybody, even people like Atherton, who was ringing constantly. He wanted to come and see me and I said no. I just locked myself away. I didn’t engage with anybody. ‘My life was upside down and in turmoil. I have put a veneer on it when I’ve been hurting inside like you wouldn’t believe. It was desperately hard for Lloyd to come to terms with his retirement from commentary Lloyd (right) was previously a coach for the England team during a spell from 1995 to 1999 ‘I come back to Accrington. I am very comfortable with who I am. No worries at all. I don’t need anybody to tell me who I am. I’m a decent bloke. I know that. Because I have been brought up properly. And I know it’s a bit big-headed, but I could do it. ‘Going back to my dad, who was a lay preacher, he always said “just be yourself”. What you see is what you get. I’m not a fine-dining sort of bloke. End of play, have a curry, couple of pints, see you tomorrow, pretty basic. ‘I’ve been in a hell of a tunnel. In my life, I have never had any resentment with anyone and I’m getting back to that state again now. I’ve had one or two rows with Geoffrey Boycott in the past but I absolutely love him to bits. Bumble: A life in cricket 407 first-class matches and 208 List A matches for Lancashire (1965-83) Nine Tests and eight ODIs for England (1973-80) First-class Umpire (1985-87) Coached Lancashire (1993-96) and England (1996-99) Commentator for Sky Sports (1999-2021) <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/cricket/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement He has been a great standard bearer for English cricket because of the way he played and the way he commentated. I have had some flipping rows with Boycs because of who he is but it doesn’t last. I have been in a big tunnel but I am out of it.’ And so we talk about happy things because there are so many happy things in his life and because he spreads, still, so much joy throughout the game and through the force of his personality and because he has achieved so much and has so much still to achieve. You only need to say ‘Bumble’ and people who love sport smile. It is a precious gift. ‘I never walked away from a dinner with Bumble not feeling better about the world,’ Atherton told me recently. ‘I had so many wonderful times at Sky,’ Bumble says. ‘In earlier days, Bob Willis and Paul Allott were my best mates. That was the last of the summer wine. We’d go on steam train trips to north Wales. We were inseparable. When they left, the younger lads came in — Nasser, Atherton, Ward. And again, we were inseparable. I worked with David Gower and Ian Botham and they did their own thing, which was fine. I had a great working relationship with Bryan Henderson and Mark Lynch was a massive influence as a director. The whole production team was pushing all the time, young people with lots of energy and that rubs off on you. ‘It was a massive blow to me when Bob died. The most affectionate bloke you could ever come across, as a true mate. A very caring chap. The England lads hated him until they met him because he could be very critical with his dour act which he took over from a former England player and journalist, Robin Marlar, who was known as “Marlar the Snarler”. He’d do a hatchet job on everybody. Bob took that mantle on. ‘He was mortified once because he had to write a letter of apology to Chris Woakes for giving him 0 out of 10 for one performance because “you don’t get a point for turning up” and Woakes is the nicest fella you could ever wish to meet. I miss Bob every day. ‘There are so many cricket broadcasters I admire. Nowadays, I’d say Ian Bishop and Simon Doull. Atherton and Hussain are a cut above. Ian Ward is a fabulous presenter. Mel Jones, too. She is the real deal, a great voice. Ebony Rainford-Brent is excellent. Lloyd admits that there are so many wonderful broadcasters in cricket that he admires ‘I worked for TMS for 11 years before I worked for Sky and Jonathan Agnew is a fabulous broadcaster. I like Simon Mann’s understated style. And I was driving home earlier in the series, listening to an excellent passage of commentary from Daniel Norcross. I tapped him on the shoulder in the lunch queue the next day to tell him how much I’d enjoyed it. ‘Further back, Fred Trueman is one of my all-time heroes. He was a curmudgeon and of course no one ever bowled as fast but he was a brilliant broadcaster. Geoffrey was a box-office listen. You have to listen. You don’t have to agree. Tony Cozier, CMJ, Jim Maxwell and my all-time hero, Bill Lawry. ‘I admired Lawry’s enthusiasm, his one-eyedness, his passion for Australian cricket, inflexions in his voice, he gets the big moments. You can do all your little stories and your pastimes but don’t miss the big moments. He nailed it every time. ‘He had a great rapport with Richie Benaud and Tony Greig. You saw that with Michael Holding and Ravi Shastri and Sunil Gavaskar. You get familiar with each other and you bounce off. You just have that telepathy. ‘It’s like opening the batting. You don’t call. You just look and go. As a duo, you knew “he’s done, I’m in” or “he’s done and so am I”. And just let it go. It’s an English thing that less is more. ‘We were always told at Sky, “less is more, shut up”. Dan Maskell and Peter Alliss, two of the all-time greats of British sports commentary, let the pictures tell the story. Sometimes, you have to have the judgment to think, “I’ve nothing to add to the pictures”. Nasser Hussain is one of the broadcasters and cricket commentators Lloyd enjoys listening to ‘Back in my TMS days, I was nobody and I asked the show’s legendary producer, Peter Baxter, why he used me. He said my voice was perfect. And that has stood me in good stead, the tenor of my voice. It’s quite deep. If you’ve got enthusiasm, your inflexions will take you up and down and you can’t just be monotonal. And you always start down because if you don’t, there’s nowhere to go.’ Perhaps, for a while, Bumble felt he had nowhere to go, too. But he’s past that. He is a hugely valued contributor to Mail Sport, he does a few appearances for talkSPORT without payment, because ‘they’re a fantastic bunch’. ‘When I go on with Ally McCoist and Alan Brazil and Laura Woods, when she was there, it’s just a brilliant lift,’ he says. ‘It’s good fun. ‘I need to work. Cricket’s second nature. I’ll go and watch Lancashire women against Yorkshire women. ‘I went to watch Lancashire Seconds and Yorkshire Seconds. I do Lancashire TV, which is like going home. ‘Just to walk into Old Trafford... I’ll be able to do more work from May next year. I’ll be 77 then but I’m not 77. I’m in my 50s, probably. I want to get back to doing more.’ Until then, he has plenty to occupy him, watching Earth children and their games. Now, he works as a contributor to Mail Sport and also enjoys appearing on other sports shows At the home he and his wife have now moved into, north of York, he has even created his own Field of Dreams. ‘I’ve got a few acres,’ Bumble says, ‘and I have got machines. I could go four and a half hours on a tractor and I love it. ‘Switch off, tending to fields. One of the fields, I have made into a cricket ground, I have put a pitch in the middle and a scoreboard and cut the grass. ‘You can’t play on it. It’s just a spoof pitch. You’d need ambulances everywhere if you had a match on it but it’s a big field and we’ve put stumps in and I cut it every day.’ Share or comment on this article: David Lloyd has done it all, but his world was rocked by the fallout from the Rafiq scandal e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:30:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/22/73236077-0-image-m-93_1689368863140.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Test: Jaiswal, Ashwin Help India Beat Windies By Innings And 141 Runs","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-1st-test-day-3-yashasvi-jaiswal-ravichandran-ashwin-help-india-ease-past-west-indies-4209080","keywords":null,"creator":null,"video_url":null,"description":"Senior off-spinner R Ashwin picked up yet another five-wicket haul (7/71) to bowl India to an innings and 141-run win over West Indies in the opening Test in Dominica on Friday.","content":"The world's top-ranked bowler R Ashwin was too good for an ill-equipped West Indies batting line-up as his second five-wicket haul of the game set up India's innings and 141-run victory in the opening Test in Dominica on Friday. After India declared their first innings at 421 for five midway into the afternoon session, an improved batting show was expected from the Caribbean batters but they were simply not up to the task and collapsed to 130 all out in 50 overs to ensure a three-day finish. Ashwin followed his 33rd five-wicket haul in the first innings with envious figures of seven for 71 in 21.3 overs, his best in an overseas Test. The result was a foregone conclusion after the West Indies were bundled out for 150 on the opening day. India's big win was also set up by Yashasvi Jaiswal who made a sublime 171 on debut. Virat Kohli contributed with 76 off 182 but it was not among his fluent knocks as he had to work extremely hard for his runs and was even dropped twice along the way. The second and final Test starts in Port of Spain, Trinidad, from July 20. India, who have not lost a Test to West Indies since 2002, will be expected to complete a clean sweep and pick up crucial points in the World Test Championship. The writing was on the wall when the West Indies were reduced to 32 for four in their second innings. With the conditions resembling the slow and dry tracks of India, Rohit Sharma introduced spin as early as the fifth over. West Indies slipped to 27 for two in 19 overs at tea with Ashwin and Jadeja removing Kraigg Brathwaite (7) and Tagenarine Chanderpaul (7) respectively. Jadeja trapped Chanderpaul in front with the one that turned from middle stump and DRS showed it was clipping the top of his leg-stump. Advertisement Brathwaite had little clue on what the skilful Ashwin was up to as he edged a straighter one to Ajinkya Rahane at first slip. The only West Indies batter who looked assured in the middle was debutant Alick Athanaze (28 off 44), who was not afraid to sweep Ashwin before unleashing a square cut and a pull off Mohammed Siraj. The talented southpaw was eventually caught at short leg by Jaiswal off Ashwin in the 37th over. India declared an hour after lunch and it seemed they were waiting for debutant Ishan Kishan to get his first run which took 20 balls. The visitors batted for as many as 152.2 overs in their first innings, scoring at a run rate of 2.76 for a massive 271-run lead. Kohli was the lone India batter to be dismissed after lunch. After being dropped in the first over post the break, Kohli did not last long as he fell into the trap laid by offie Rahkeem Cornwall. The burly spinner got one to bounce from middle stump and Kohli ended up flicking to the waiting leg slip fielder. In the morning, Jaiswal became only the third Indian to score 150 on debut while Kohli had to toil for a half-century as the visitors reached 400 for four at lunch. Resuming the day at 312 for two, India managed 88 runs in 29 overs in the morning session for the loss of Jaiswal (171) and Ajinkya Rahane (3). The Indian batters had to work for their runs on a slow pitch offering a lot of turn and a heavy outfield. Kohli celebrating after hitting a rare boundary was proof of that. Left-arm spinner Jomel Warrican opened the bowling alongside Holder and instantly created issues for Kohli. The former India skipper got a life when he was dropped on 40 by West Indies captain Brathwaite. Kohli went for a drive off Warrican and Brathwaite ended up grassing an easy chance at cover. At the other end, Jaiswal stepped out to Warrican and dispatched him for a straight six. He became the third Indian to reach 150 on debut with a single, matching the feats of Shikhar Dhawan (187) and Rohit Sharma (177). A double hundred was in the offing for Jaiswal but it wasn't to be as he edged one that angled away from Alzarri Joseph. Soon after Rahane, who had a good opportunity to make a big impact, attempted a drive on the up on a slow pitch off Kemar Roach and ended up offering a simple catch at cover. With Rahkeem Cornwall not allowed to bowl in the morning as he did not take the field on day two, the West Indies offered some easy boundaries to India towards the end of the session. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-07-14 21:29:11","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravi Ashwin, Yashasvi Jaiswal Star As India Beat West Indies by an Innings and 141 Runs in 1st Test 2023","link":"https://www.latestly.com/socially/sports/cricket/ravi-ashwin-yashasvi-jaiswal-star-as-india-beat-west-indies-by-an-innings-and-141-runs-in-1st-test-2023-5267005.html","keywords":null,"creator":null,"video_url":null,"description":"The Rohit Sharma-led side got off to a roaring start in the fresh World Test Championship cycle with this dominant performance over the West Indies. Ravichandran Ashwin starred with 12 wickets in the match while debutant Yashasvi Jaiswal smashed 171 in India's first innings.","content":"Ravichandran Ashwin took seven wickets in the second innings of the first Test as India beat West Indies by a mammoth margin of an innings and 141 runs in the 1st Test 2023. Ashwin, on the back of a five-wicket haul in the 1st Test, finished the match with a total of 12 wickets in the game. Yashasvi Jaiswal earlier dazzled on his debut, scoring 171 runs in India's first innings effort of 421/5d. With this, India have a 1-0 lead in this series, with the next and remaining Test match scheduled to start on July 20. Ravi Ashwin Completes His Eighth 10-Wicket Haul in Test Cricket, Achieves Feat During Day 3 of IND vs WI 1st Test 2023. India Beat West Indies in 1st Test 2023 1ST Test. India Won by an innings and 141 Run(s) https://t.co/xaaoS40Fyf #WIvIND — BCCI (@BCCI) July 14, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-14 21:27:17","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test Day 3 Live Score Update: पहले टेस्ट में टीम इंडिया ने वेस्टइंडीज को एक पारी और 141 रनों से दी करारी शिकस्त, सीरीज में 1-0 की बनाई बढ़त","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-3-live-score-update-in-the-first-test-team-india-defeated-west-indies-by-an-innings-and-141-runs-took-a-1-0-lead-in-the-series-1864824.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया की तरफ से युवा सलामी बल्लेबाज यशस्वी जायसवाल ने सबसे ज्यादा 171 रन बनाए. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला गया. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. मैच के तीसरे दिन टीम इंडिया ने वेस्टइंडीज को एक पारी और 141 रन से हराकर सीरीज में 1-0 की बढ़त बना ली हैं. टीम इंडिया की तरफ से युवा सलामी बल्लेबाज यशस्वी जायसवाल ने सबसे ज्यादा 171 रन बनाए. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. जवाब में टीम इंडिया ने अपनी पहली पारी पांच विकेट पर 421 रन के स्कोर पर घोषित की. इस तरह टीम इंडिया को 271 रन की बढ़त मिली. वहीं, दूसरी पारी में वेस्टइंडीज की पूरी टीम 50.3 ओवर में महज 130 रन पर आल आउट हो गई. टीम इंडिया की ओर से आर अश्विन ने पहली पारी में सबसे ज्यादा पांच और दूसरी पारी में भी सात विकेट विकेट चटकाए. टीम इंडिया और वेस्टइंडीज के बीच दूसरा टेस्ट मैच 20 जुलाई से पोर्ट ऑफ स्पेन में खेला जाएगा. INDIA WON FIRST TEST MATCH. India beat West Indies by innings and 141 runs, a dream start in new WTC cycle. Stars are Ashwin with 12 wickets, hundreds by Rohit & Jaiswal. pic.twitter.com/r8jjiW9jSp — Johns. (@CricCrazyJohns) July 14, 2023 1ST Test. India Won by an innings and 141 Run(s) https://t.co/xaaoS40Fyf #WIvIND — BCCI (@BCCI) July 14, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-14 21:15:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Aussie cricket coach Justin Langer takes job in Indian Premier League with Lucknow Super Giants","link":"https://www.dailymail.co.uk/sport/cricket/article-12301077/Aussie-cricket-coach-Justin-Langer-takes-job-Indian-Premier-League-Lucknow-Super-Giants.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"REVEALED: Justin Langer's new lucrative coaching gig after the former Australian mentor vowed that he would never coach again following bitter split","content":"REVEALED: Justin Langer's new coaching gig after the former Australian mentor vowed that he would never coach again following bitter split Lucrative offer makes him change his mind Will be reunited with some Aussie players He still believes his best coaching years are ahead By Ric Chapman For Daily Mail Australia Updated: 01:43, 15 July 2023 e-mail View comments Controversial former Australian cricket coach Justin Langer has gone back on his word made a year ago about ever coaching again and has signed with the Indian Premier League's Lucknow Super Giants. Langer, 52, will take over the coaching and replaces former England coach Andy Flower at the helm of the IPL franchise. The former Australian opener left his Australian role last year, just months after coaching Australia to T20 World Cup and Ashes glory. Losing the locker room was considered the main reason following repeated angry outbursts. Langer parted ways with Cricket Australia (CA) after he was offered a tiny contract to remain in charge only until the end of the 2022 T20 World Cup. Former Australian cricket coach and former Aussie opening batter Justin Langer (pictured) once said 'never again' to coaching but the Indian rupees have changed his mind At the time he wanted a long-term deal which he thought he deserved following an Ashes series win, a drawn series in England and a Twenty20 World Cup. When he declined the relatively insulting CA offer, his emotions at the time led him to say he'd never coach again. But, it really does seem that time heals all wounds as he now packs his bags and heads to India. At the time of the poor CA offer, Langer was interviewed and said: 'I don't think I'll coach again. No, I don't think I'll coach again,' he repeated when on the Cricket Etc podcast with The Australian cricket writers Peter Lalor and Gideon Haigh. 'The craziness is – and it's really strange in cricket – if you think about a lot of the other codes, the best coaches are a lot older. It doesn't make sense in cricket. 'I say I'm not going to coach again, but I reckon I'm 10 years off being the best coach I could be.' Well, he's not quite 10 years away from those comments but he's having another crack. To keep himself busy during his time away from helming Australia, the gritty West Australian former opening batsman remained involved in cricket via the media, including colour commentating for Channel Seven. Aussie basher Marcus Stoinis is a star attraction for Lucknow and Langer will reunite with him England quick Mark Wood in action for Lucknow Super Giants in the IPL earlier this year In India he will be reunited with Australian all-rounder Marcus Stoinis, one of Lucknow's star players. 'Lucknow Super Giants are on the journey of building a great story in the IPL. We all have a role to play in that journey and I am excited to be a part of the team moving forward,' Langer said. Lucknow is a new side in the IPL and the team has surprised many by making the playoffs in its first two seasons. In the Lucknow lineup in 2023 was England's speed demon Mark Wood, who was sidelined for the opening two Ashes Tests, but who earned Player of the Match honours for his blistering 5-34 during the first innings in the third Test in Leeds. Share or comment on this article: Aussie cricket coach Justin Langer takes job in Indian Premier League with Lucknow Super Giants e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-15 00:43:18","image_url":"https://i.dailymail.co.uk/1s/2023/07/15/00/73239931-0-image-a-5_1689377594527.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"How To Watch MLC 2023 Free Live Streaming Online, SEO vs WAF on JioCinema? Get TV Telecast Details of Seattle Orcas vs Washington Freedom Major League Cricket 2023 Match","link":"https://www.latestly.com/socially/sports/cricket/how-to-watch-mlc-2023-free-live-streaming-online-seo-vs-waf-on-jiocinema-get-tv-telecast-details-of-seattle-orcas-vs-washington-freedom-major-league-cricket-2023-match-5267021.html","keywords":null,"creator":null,"video_url":null,"description":"The third match of the new T20 tournament would see some of the game's exciting names go up against each other. Scroll down to get live streaming and telecast details of the match.","content":"Seattle Orcas would open their MLC 2023 campaign against Washington Freedom on July 15. The match would be played at the Grand Prairie Stadium and it starts at 6:00 am IST (Indian Standard Time). Viacom18 bagged the media rights of MLC 2023 in India and the live telecast of this match will be available on Sports 18 1/HD channels. Fans who want to watch live streaming of this match for free, can do so on the JioCinema app and website. Adam Zampa Wears Jersey No 420 for Los Angeles Knight Riders in MLC 2023, Fans React. Seattle Orcas vs Washington Freedom It's Finally Here‼️ We take on @wshfreedom in our opening match of #MLC2023 🏏 📢 Come out in your numbers #PodSquad #SOvWF #SeattleOrcas #MajorLeagueCricket #Veeam pic.twitter.com/ofXZ5RdteO — Seattle Orcas (@MLCSeattleOrcas) July 14, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-15 00:00:04","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test: ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਨੂੰ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਹਰਾਇਆ, ਅਸ਼ਵਿਨ ਨੇ ਮੈਚ ਵਿੱਚ ਲਈਆਂ 12 ਵਿਕਟਾਂ","link":"https://punjabi.abplive.com/sports/cricket/ind-vs-wi-1st-test-india-beat-west-indies-by-an-innings-and-141-runs-in-the-first-test-ashwin-took-12-wickets-in-the-match-731489","keywords":["ਕ੍ਰਿਕਟ"],"creator":["ABP Sanjha"],"video_url":null,"description":"India vs West Indies, 1st Test Highlights:  ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਖਿਲਾਫ 2 ਮੈਚਾਂ ਦੀ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਜਿੱਤ ਕੇ ਸੀਰੀਜ਼ 'ਚ 1-0 ਦੀ ਬੜ੍ਹਤ ਬਣਾ ਲਈ ਹੈ। ਡੋਮਿਨਿਕਾ ਦੇ ਵਿੰਡਸਰ ਪਾਰਕ 'ਚ ਖੇਡੇ ਗਏ ਸੀਰੀਜ਼ ਦੇ ਪਹਿਲੇ ਮੈਚ 'ਚ ਭਾਰਤੀ ਟੀਮ ਵਲੋਂ ਬੱਲੇਬਾਜ਼ੀ ਅਤੇ ਗੇਂਦਬਾਜ਼ੀ ਦੋਵਾਂ ਵਿਭਾਗਾਂ 'ਚ ਸ਼ਾਨਦਾਰ ਪ੍ਰਦਰਸ਼ਨ ਕੀਤਾ ਗਿਆ। ਤੀਜੇ ਦਿਨ ਭਾਰਤੀ ਟੀਮ ਨੇ 421 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਪਹਿਲਾ ਐਲਾਨ ਕੀਤਾ।  ਇਸ ਤੋਂ ਬਾਅਦ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਆਪਣੀ ਦੂਜੀ ਪਾਰੀ 'ਚ ਸਿਰਫ 130 ਦੌੜਾਂ 'ਤੇ ਹੀ ਸਿਮਟ ਗਈ। ਭਾਰਤ ਲਈ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਨੇ ਦੂਜੀ ਪਾਰੀ ਵਿੱਚ ਗੇਂਦ ਨਾਲ 7 ਵਿਕਟਾਂ ਲਈਆਂ। ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਨੇ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਟਾਸ ਜਿੱਤ ਕੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਟੀਮ ਆਪਣੀ ਪਹਿਲੀ ਪਾਰੀ 'ਚ 150 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਇਸ ਪਾਰੀ 'ਚ ਭਾਰਤ ਲਈ 5 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਬਾਅਦ ਭਾਰਤੀ ਟੀਮ ਲਈ ਮੈਚ 'ਚ ਉਤਰੀ ਕਪਤਾਨ ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ ਦੀ ਸਲਾਮੀ ਜੋੜੀ ਨੇ ਟੀਮ ਨੂੰ ਬਿਹਤਰੀਨ ਸ਼ੁਰੂਆਤ ਦਿਵਾਉਣ ਦਾ ਕੰਮ ਕੀਤਾ। ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਵਿਚਾਲੇ ਪਹਿਲੀ ਵਿਕਟ ਲਈ 229 ਦੌੜਾਂ ਦੀ ਸਾਂਝੇਦਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਰੋਹਿਤ 103 ਦੌੜਾਂ ਦੀ ਸ਼ਾਨਦਾਰ ਪਾਰੀ ਖੇਡ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਯਸ਼ਸਵੀ ਦੇ ਬੱਲੇ ਨਾਲ 171 ਦੌੜਾਂ ਦੀ ਇਤਿਹਾਸਕ ਪਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਵਿਰਾਟ ਕੋਹਲੀ ਨੇ ਵੀ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਅਤੇ ਰਵਿੰਦਰ ਜਡੇਜਾ 37 ਦੌੜਾਂ ਬਣਾ ਕੇ ਨਾਬਾਦ ਪਰਤੇ। ਭਾਰਤੀ ਟੀਮ ਨੇ 5 ਵਿਕਟਾਂ ਦੇ ਨੁਕਸਾਨ 'ਤੇ 421 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਪਣੀ ਪਾਰੀ ਐਲਾਨ ਦਿੱਤੀ, ਜਿਸ ਤੋਂ ਉਸ ਨੇ 271 ਦੌੜਾਂ ਦੀ ਬੜ੍ਹਤ ਹਾਸਲ ਕਰ ਲਈ ਹੈ। ਵੈਸਟਇੰਡੀਜ਼ ਦੇ ਬੱਲੇਬਾਜ਼ ਫਿਰ ਅਸ਼ਵਿਨ ਦੀ ਸਪਿਨ 'ਚ ਫਸ ਗਏ ਤੀਜੇ ਦਿਨ ਦੇ ਦੂਜੇ ਸੈਸ਼ਨ ਵਿੱਚ ਜਦੋਂ ਭਾਰਤੀ ਟੀਮ ਦੀ ਪਾਰੀ ਐਲਾਨੀ ਗਈ ਤਾਂ ਦਿਨ ਦੀ ਖੇਡ ਵਿੱਚ ਲਗਭਗ 50 ਓਵਰ ਬਾਕੀ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਆਪਣੀ ਸਪਿਨ ਦਾ ਜਾਦੂ ਦਿਖਾਉਂਦੇ ਹੋਏ ਅਸ਼ਵਿਨ ਨੇ ਵਿੰਡੀਜ਼ ਟੀਮ ਦੀ ਦੂਜੀ ਪਾਰੀ ਨੂੰ ਸਮੇਟਣ 'ਚ ਜ਼ਿਆਦਾ ਸਮਾਂ ਨਹੀਂ ਲਗਾਇਆ। 58 ਦੇ ਸਕੋਰ ਤੱਕ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਅੱਧੀ ਟੀਮ ਪੈਵੇਲੀਅਨ ਪਰਤ ਚੁੱਕੀ ਸੀ। ਇਸ ਤੋਂ ਬਾਅਦ ਪੂਰੀ ਟੀਮ 130 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਆਪਣੇ ਕਰੀਅਰ 'ਚ 34ਵੀਂ ਵਾਰ ਇਕ ਪਾਰੀ 'ਚ 5 ਵਿਕਟਾਂ ਲੈਣ ਦਾ ਕਾਰਨਾਮਾ ਕੀਤਾ, ਜਦਕਿ 8ਵੀਂ ਵਾਰ ਮੈਚ 'ਚ 10 ਵਿਕਟਾਂ ਹਾਸਲ ਕੀਤੀਆਂ। ਇਸ ਮੈਚ 'ਚ 171 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਲਈ ਯਸ਼ਸਵੀ ਨੂੰ 'ਪਲੇਅਰ ਆਫ ਦਿ ਮੈਚ' ਦਾ ਖਿਤਾਬ ਦਿੱਤਾ ਗਿਆ ਹੈ।  ","content":"India vs West Indies, 1st Test Highlights: ਭਾਰਤ ਨੇ ਵੈਸਟਇੰਡੀਜ਼ ਖਿਲਾਫ 2 ਮੈਚਾਂ ਦੀ ਟੈਸਟ ਸੀਰੀਜ਼ ਦਾ ਪਹਿਲਾ ਮੈਚ ਪਾਰੀ ਅਤੇ 141 ਦੌੜਾਂ ਨਾਲ ਜਿੱਤ ਕੇ ਸੀਰੀਜ਼ 'ਚ 1-0 ਦੀ ਬੜ੍ਹਤ ਬਣਾ ਲਈ ਹੈ। ਡੋਮਿਨਿਕਾ ਦੇ ਵਿੰਡਸਰ ਪਾਰਕ 'ਚ ਖੇਡੇ ਗਏ ਸੀਰੀਜ਼ ਦੇ ਪਹਿਲੇ ਮੈਚ 'ਚ ਭਾਰਤੀ ਟੀਮ ਵਲੋਂ ਬੱਲੇਬਾਜ਼ੀ ਅਤੇ ਗੇਂਦਬਾਜ਼ੀ ਦੋਵਾਂ ਵਿਭਾਗਾਂ 'ਚ ਸ਼ਾਨਦਾਰ ਪ੍ਰਦਰਸ਼ਨ ਕੀਤਾ ਗਿਆ। ਤੀਜੇ ਦਿਨ ਭਾਰਤੀ ਟੀਮ ਨੇ 421 ਦੌੜਾਂ ਦੇ ਸਕੋਰ 'ਤੇ ਪਹਿਲਾ ਐਲਾਨ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਆਪਣੀ ਦੂਜੀ ਪਾਰੀ 'ਚ ਸਿਰਫ 130 ਦੌੜਾਂ 'ਤੇ ਹੀ ਸਿਮਟ ਗਈ। ਭਾਰਤ ਲਈ ਰਵੀਚੰਦਰਨ ਅਸ਼ਵਿਨ ਨੇ ਦੂਜੀ ਪਾਰੀ ਵਿੱਚ ਗੇਂਦ ਨਾਲ 7 ਵਿਕਟਾਂ ਲਈਆਂ। ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਟੀਮ ਨੇ ਪਹਿਲੇ ਟੈਸਟ ਵਿੱਚ ਟਾਸ ਜਿੱਤ ਕੇ ਪਹਿਲਾਂ ਬੱਲੇਬਾਜ਼ੀ ਕਰਨ ਦਾ ਫੈਸਲਾ ਕੀਤਾ। ਇਸ ਤੋਂ ਬਾਅਦ ਟੀਮ ਆਪਣੀ ਪਹਿਲੀ ਪਾਰੀ 'ਚ 150 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਇਸ ਪਾਰੀ 'ਚ ਭਾਰਤ ਲਈ 5 ਵਿਕਟਾਂ ਲਈਆਂ। ਇਸ ਤੋਂ ਬਾਅਦ ਭਾਰਤੀ ਟੀਮ ਲਈ ਮੈਚ 'ਚ ਉਤਰੀ ਕਪਤਾਨ ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਜੈਸਵਾਲ ਦੀ ਸਲਾਮੀ ਜੋੜੀ ਨੇ ਟੀਮ ਨੂੰ ਬਿਹਤਰੀਨ ਸ਼ੁਰੂਆਤ ਦਿਵਾਉਣ ਦਾ ਕੰਮ ਕੀਤਾ। ਰੋਹਿਤ ਅਤੇ ਯਸ਼ਸਵੀ ਵਿਚਾਲੇ ਪਹਿਲੀ ਵਿਕਟ ਲਈ 229 ਦੌੜਾਂ ਦੀ ਸਾਂਝੇਦਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਰੋਹਿਤ 103 ਦੌੜਾਂ ਦੀ ਸ਼ਾਨਦਾਰ ਪਾਰੀ ਖੇਡ ਕੇ ਪੈਵੇਲੀਅਨ ਪਰਤ ਗਏ। ਯਸ਼ਸਵੀ ਦੇ ਬੱਲੇ ਨਾਲ 171 ਦੌੜਾਂ ਦੀ ਇਤਿਹਾਸਕ ਪਾਰੀ ਦੇਖਣ ਨੂੰ ਮਿਲੀ। ਇਸ ਤੋਂ ਇਲਾਵਾ ਵਿਰਾਟ ਕੋਹਲੀ ਨੇ ਵੀ 76 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਖੇਡੀ। ਅਤੇ ਰਵਿੰਦਰ ਜਡੇਜਾ 37 ਦੌੜਾਂ ਬਣਾ ਕੇ ਨਾਬਾਦ ਪਰਤੇ। ਭਾਰਤੀ ਟੀਮ ਨੇ 5 ਵਿਕਟਾਂ ਦੇ ਨੁਕਸਾਨ 'ਤੇ 421 ਦੌੜਾਂ ਬਣਾ ਕੇ ਆਪਣੀ ਪਾਰੀ ਐਲਾਨ ਦਿੱਤੀ, ਜਿਸ ਤੋਂ ਉਸ ਨੇ 271 ਦੌੜਾਂ ਦੀ ਬੜ੍ਹਤ ਹਾਸਲ ਕਰ ਲਈ ਹੈ। googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); ਵੈਸਟਇੰਡੀਜ਼ ਦੇ ਬੱਲੇਬਾਜ਼ ਫਿਰ ਅਸ਼ਵਿਨ ਦੀ ਸਪਿਨ 'ਚ ਫਸ ਗਏ ਤੀਜੇ ਦਿਨ ਦੇ ਦੂਜੇ ਸੈਸ਼ਨ ਵਿੱਚ ਜਦੋਂ ਭਾਰਤੀ ਟੀਮ ਦੀ ਪਾਰੀ ਐਲਾਨੀ ਗਈ ਤਾਂ ਦਿਨ ਦੀ ਖੇਡ ਵਿੱਚ ਲਗਭਗ 50 ਓਵਰ ਬਾਕੀ ਸਨ। ਇਸ ਤੋਂ ਬਾਅਦ ਆਪਣੀ ਸਪਿਨ ਦਾ ਜਾਦੂ ਦਿਖਾਉਂਦੇ ਹੋਏ ਅਸ਼ਵਿਨ ਨੇ ਵਿੰਡੀਜ਼ ਟੀਮ ਦੀ ਦੂਜੀ ਪਾਰੀ ਨੂੰ ਸਮੇਟਣ 'ਚ ਜ਼ਿਆਦਾ ਸਮਾਂ ਨਹੀਂ ਲਗਾਇਆ। 58 ਦੇ ਸਕੋਰ ਤੱਕ ਵੈਸਟਇੰਡੀਜ਼ ਦੀ ਅੱਧੀ ਟੀਮ ਪੈਵੇਲੀਅਨ ਪਰਤ ਚੁੱਕੀ ਸੀ। ਇਸ ਤੋਂ ਬਾਅਦ ਪੂਰੀ ਟੀਮ 130 ਦੌੜਾਂ 'ਤੇ ਸਿਮਟ ਗਈ। ਅਸ਼ਵਿਨ ਨੇ ਆਪਣੇ ਕਰੀਅਰ 'ਚ 34ਵੀਂ ਵਾਰ ਇਕ ਪਾਰੀ 'ਚ 5 ਵਿਕਟਾਂ ਲੈਣ ਦਾ ਕਾਰਨਾਮਾ ਕੀਤਾ, ਜਦਕਿ 8ਵੀਂ ਵਾਰ ਮੈਚ 'ਚ 10 ਵਿਕਟਾਂ ਹਾਸਲ ਕੀਤੀਆਂ। ਇਸ ਮੈਚ 'ਚ 171 ਦੌੜਾਂ ਦੀ ਪਾਰੀ ਲਈ ਯਸ਼ਸਵੀ ਨੂੰ 'ਪਲੇਅਰ ਆਫ ਦਿ ਮੈਚ' ਦਾ ਖਿਤਾਬ ਦਿੱਤਾ ਗਿਆ ਹੈ।","pubDate":"2023-07-14 23:52:55","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/07/15/7ed2a190c86730e5d575cef6cccd976f1689378166437700_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"Punjabi"},{"title":"Ashwin spins his web as India thrash Windies in Test","link":"https://www.perthnow.com.au/sport/cricket/ashwin-spins-his-web-as-india-thrash-windies-in-test-c-11284089","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"India have thrashed the West Indies to win the first Test inside three days, thanks to spinner Ravichandran Ashwin spinning his web in Dominica.","content":"Ravichandran Ashwin feasted on West Indies wickets on a generous turning pitch to propel India to victory by an innings and 141 runs inside three days of the first Test. Ashwin took 7-71 in the second innings, his best figures overseas, as West Indies were bowled out for 130 in less than 51 overs. New cap Yashasvi Jaiswal scored 171 for India as the visitors declared their first innings at 5-421 about an hour after lunch for a lead of 271. That was imposing considering West Indies made just 150 in their first knock. Offering spin-friendly Windsor Park to two of the world's best spinners was considered overly charitable not long after West Indies won the toss and decided to let India bowl first. Ashwin, the No.1-ranked Test bowler with a point to prove after being omitted from the World Test Championship final against Australia, and Ravindra Jadeja, the No.1-ranked Test allrounder, padded already impressive statistics with 17 of the 20 West Indies wickets. Beside 5-60 from the first innings, Ashwin's dozen wickets in the match gave him an eighth 10-wicket haul in a Test, tying Anil Kumble's India record. They are tied for fifth on the all-time list. Jadeja took 2-38 on Friday for a match haul of five wickets. The hosts have gone the distance only twice in their last 10 Tests going back 16 months. India, meanwhile, extended their unbeaten run in the Caribbean to 14 Tests after a seventh win since 2006. The highest score by an India man on debut was 187 by Shikhar Dhawan in 2013, and Jaiswal looked set to beat it on Friday morning until he fell 16 runs short.","pubDate":"2023-07-14 22:09:52","image_url":"https://images.perthnow.com.au/publication/C-11284089/19b6e03faa394eacef8b7c983c0d9ab07021dcf3-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Surrey captain Jordan eager to get his hands on T20 Blast title after World Cup and Hundred success","link":"https://www.dailymail.co.uk/sport/cricket/article-12300627/Surrey-captain-Jordan-eager-hands-T20-Blast-title-World-Cup-success.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"For a renowned T20 specialist like England's Chris Jordan, it remains a surprise that throughout his 16-year career, England's highest wicket-taker in the format is yet to win a T20 Blast title.","content":"Chris Jordan eager to get his hands on T20 Blast title after winning the World Cup and the Hundred... with white-ball specialist relishing chance to captain Surrey in their seventh Finals Day England’s highest wicket-taker in the format is yet to win a T20 Blast title Jordan won the T20 World Cup in 2022 and the Hundred two years ago The 34-year-old will captain Surrey in their seventh Finals Day on Saturday By Aadam Patel For Mailonline Updated: 22:31, 14 July 2023 e-mail View comments For a renowned T20 specialist like England’s Chris Jordan, it remains a surprise that throughout his 16-year career, England’s highest wicket-taker in the format is yet to win a T20 Blast title. That could all be about to change on Saturday as he leads Surrey into their seventh Finals Day. For a county of Surrey’s stature, it is perhaps an even bigger surprise that since their success in the inaugural edition of the competition in 2003, they have never won it since. Jordan, 34, insists he is as hungry as can be, after their quarter-final win against a Lancashire side containing three of England’s T20 World-Cup winners in their top four. ‘When you sit down and look back at your career, you remember those moments when you win series and titles like the World Cup and The Hundred but I haven’t got the T20 Blast title in the locker yet,’ Jordan tells Mail Sport. Surrey captain Chris Jordan (above) has his sights set on the T20 Blast trophy ‘There’s still plenty of space in the cabinet though,’ he adds with a hint of optimism. For Jordan, who returned to Surrey in 2021 after leaving for Sussex in 2012, the responsibility of captaincy is something he feels like he’s thriving on. After all, Eoin Morgan would regularly look to him for advice during reign as England captain and it is pretty much the same under Jos Buttler. Surrey won eight of their first 11 games in the Blast before Middlesex pulled off a record run-chase at the Oval. Despite losing their last three games and missing out on a home quarter-final, an impressive win at Old Trafford with Jordan taking two for 28, saw them secure their place for Edgbaston. It was the first time Lancashire had lost at home in the format since 2020. ‘I’ve enjoyed it (captaincy) thoroughly. With a county like Surrey with so much history, it’s a huge honour. Sometimes you’ve got to take the rough with the smooth and embrace those challenges but that’s what I’ve always done with my career,’ says Jordan. One of those challenges will be dealing with the absence of overseas star Sunil Narine, who chose to play in the Major League Cricket tournament in the US, which began on Thursday. Despite rumours suggesting Narine had planned a 9,000 mile round trip from Dallas to Birmingham, he pulled out on Wednesday evening. Will he be missed? ‘Of course, 100 per cent,’ says Jordan. Sunil’s been a huge part of our success but it presents an incredible opportunity for one of our guys to step up,’ insists Jordan. Alec Stewart, Surrey’s Director of Cricket, said he was 'disappointed and frustrated' at what had unfolded but Jordan admits that it’s not a surprise for him. Jordan (centre) celebrates England's T20 World Cup success with Adil Rashid and Moeen Ali ‘Speaking as someone who plays and has played lots of franchise cricket, it’s not ideal but it’s the way of the world right now. It’s not disappointing for me. It’s just unfortunate. You’ve got to understand the time and realise it’s not the first time and it’s not the last time that this has happened.’ And for the boy who grew up in Barbados, it is another sign of the increasing democratisation of world cricket. ‘Equally I’d flip it and say it’s great in a way because cricket is properly on the map now. I could never imagine a T20 league in USA as a child growing up,’ says Jordan. ‘Yes - Test cricket is still the pinnacle but having that connection with other demographics is where T20 comes in, as something between cricket and entertainment. There’s so much more interest in the game now and that can only be a good thing.’ Share or comment on this article: Surrey captain Jordan eager to get his hands on T20 Blast title after World Cup and Hundred success e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:31:08","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/19/73231875-0-image-m-41_1689360836264.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England star Kate Cross is backing the women's team to win the Ashes after ODI victory","link":"https://www.dailymail.co.uk/sport/cricket/article-12300923/England-star-Kate-Cross-backing-womens-team-win-Ashes-ODI-victory.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"KATE CROSS: What was I saying about the scripts of both the men's and women's Ashes being packed with plenty of twists and turns? Well, there was another twist at Bristol in our first ODI.","content":"England star Kate Cross is backing the women's team to win their remaining ODI's against Australia and regain the Ashes urn after their recent sensational victory Kate Cross believes England will beat Australia to regain the Ashes urn Cross starred as England won by two wickets in Wednesday's ODI clash Two more ODI's will follow and Cross is up for the challenge against the Aussies By Kate Cross For The Daily Mail Updated: 22:30, 14 July 2023 e-mail View comments What was I saying about the scripts of both the men’s and women’s Ashes being packed with plenty of twists and turns? Well, there was another twist at Bristol in our first ODI and it was one that ended with me and Heather Knight adding the 29 runs needed to beat Australia by two wickets on Wednesday. To be there at the end with the captain in front of our families and friends with the Ashes on the line was so special. I’ll never forget that winning moment. My mum and dad were there supporting and they were the first to fight their way through the crowd afterwards to give me more big hugs. Mum, Christine, doesn’t rate my batting and she told me that when I came in she turned to dad and said: ‘This has got first-baller written all over it, Dave!’ Thankfully that wasn’t the case and it means, from 6-0 down, we have fought our way back to 6-6. With two games left to play, the Ashes are very much alive. I’ve had messages from all sorts like Chris Woakes, Jimmy Anderson, Bumble, Michael Vaughan. So many eyes are on our Ashes and we know now after three victories in a row we have to win two more, at the Ageas Bowl on Saturday and Taunton on Tuesday, to lift the trophy for the first time since 2014. Kate Cross believes that England's women will beat Australia in the remaining ODI's and regain the Ashes urn Cross went in at No 10 batting against Australia and produced a brilliant ramp shot I would have liked us to have needed fewer than 29 when I went in at No 10 but I was quite calm. Heather’s been in those positions before and knows how to speak to me. So even though there was a lot of pressure, I didn’t really feel it. My mum said to me afterwards: ‘Why was Heather giving you the strike?’ But if we hadn’t taken the singles it might have got a lot tighter. We decided to take it in increments. First: ‘Let’s get this down to 20.’ Then: ‘Let’s get it down to 10’. Then it was five and when we did that Heather said: ‘Right, let’s try to win this now.’ Simple planning amid the chaos. It was Heather who came down to me and said ‘the ramp’s on’, before I played the shot that has received a lot of attention. It’s a shot I practise a lot and she gave me the confidence to do it. Cross (left) and Heather Knight held their nerve to beat Australia by two wickets on Wednesday England will be hoping for similar fortunes when they resume battle with Australia on Sunday It’s not often I go out to bat for England and I’d never been there at the end in any successful chase for any team since a game for Lancashire nine years ago! Heather’s elation when she hit the winning boundary was telling. She is usually this cool ice queen, so that goes to show how much it meant. I did feel as if I’d let the team down with the ball, so this was my chance to pull it back. Heather keeps on calling it the great escape and it does feel like we could be on the cusp of something extra special now. We know Australia will come back hard but we feel there’s better cricket to come from us and we will keep on focusing on ourselves rather than worry about them. Bring on the Ageas Bowl! Share or comment on this article: England star Kate Cross is backing the women's team to win the Ashes after ODI victory e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:30:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/22/73236911-0-image-m-48_1689369708713.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"David Lloyd has done it all from player to coach to adored commentator, but his world was rocked","link":"https://www.dailymail.co.uk/sport/cricket/article-12300883/David-Lloyd-player-coach-adored-commentator-world-rocked.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: Ilyas Khan does not remember the year but he knows it was some time in the mid-to-late 1970s. He was a teenager, a shy boy of Kashmiri heritage, born and raised in Lancashire.","content":"EXCLUSIVE: David Lloyd has done it all from player to coach to adored commentator, but his world was rocked by the fallout from the Rafiq scandal. It left him in a dark place...but he’s now coming back into the light David Lloyd has done it all in cricket, from player to coach to loved commentator The 76-year-old is one of the most celebrated figures in the cricketing world His life was rocked by the Azeem Rafiq scandal and was left in a dark place By Oliver Holt For The Daily Mail Updated: 22:48, 14 July 2023 e-mail View comments Ilyas Khan does not remember the year but he knows it was some time in the mid-to-late 1970s. He was a teenager, a shy boy of Kashmiri heritage, born and raised amid the Lancashire mill towns, a habitual victim of casual racist abuse, a kid who loved cricket. Now and then, he would go to watch the indoor winter nets sessions held at a local leisure centre by Accrington Cricket Club, one of the teams in the famed Lancashire League, which attracted international stars in those days, both as coaches and players. It cost 50p or a pound each week for subscriptions. ‘My family didn’t have two pennies to rub together,’ says Khan, who went on to own Accrington Stanley Football Club and is a respected multi-millionaire technologist and philanthropist. The players were usually all white boys anyway. Asian kids rarely featured. It was an intimidating culture for a boy like Khan. He hung around the margins, watching the players practise. ‘One evening, I was peering through the netting as usual,’ Khan says, ‘and David Lloyd saw me. He was already a legend. He’d scored a double century for England. He called over and said, “Come and have a go”. ‘He was putting on coaching sessions then and I told him I couldn’t afford it. He said, “Don’t worry about that”. I was still unsure. He said, “Come on, pad up”. It happened twice. That welcome that Bumble gave me, it made a massive impression on me. David 'Bumble' Lloyd throughout his career has helped raise the profile of English cricket Since retiring from coaching, he has become one of the sport's most renowned broadcasters At his home in Yorkshire, the 76-year-old has made a cricket ground with a full working wicket ‘To me, Bumble was the one who made everything good. That was a time when skinhead gangs used to roam around. He was a beacon of light for me. I was a victim of racist abuse every day but on those evenings in the nets, I was just a little boy playing cricket.’ Half a century on — half a century of Bumble being an evangelist for cricket, of drawing people into the game, of spreading the joy of the game — he smiles at the mention of Ilyas when I recall the story one day over breakfast during the third Test earlier this month. It is 9am on the second day at Headingley and Bumble is sitting outside the Ugly Mugs Cafe opposite the ground. He has got a plate of fried egg, bacon and sausage in front of him. ‘Good start to the day, this,’ he says. He points out that Ilyas repaid that small act of kindness later in his life many, many times over by stepping in with a hefty financial donation to rescue the cricket club when it was in trouble. Ilyas rescued Stanley, too. He took what Bumble had done for him and he paid it forward. Inside the cafe, on the menu on the wall, one of the dishes is called after Lloyd’s nickname. In the 1950s, the comedian Michael Bentine created a show called The Bumblies, about three little aliens from the planet Bumble who land on Earth to learn about Earth children and their games. The players in the Lancashire dressing room thought the characters resembled Lloyd and the name stuck. So on the menu, there is Bumble’s Bap: three sausages, three rashers of bacon, and an egg. There is a Tuffers Sarnie, too, although it is not as substantial. At his table, Bumble is chatting about the day ahead and what the pitch may hold in store. Anyone who loves cricket — and a lot of people who don’t — could listen to him all day, even if it’s just sitting here at a rickety table on a pavement in a Leeds suburb. ‘Get a bat and hit it on the pitch,’ he says, his voice low and rich and sonorous as if he is letting you in to a secret, taking you into his confidence, his enthusiasm rising with every word, ‘and at a club ground it goes “bom, bom, bom”.’ Lloyd got his 'Bumble' nickname after players in the Lancashire dressing room thought he resembled characters out of a television show. It followed him well beyond his days as a player Whenever Lloyd is at cricket games, supporters clamber over to get pictures and speak to him Now his voice quickens. It is as if he is back on Sky again, a master of his art. ‘But hit a bat on a Test pitch,’ he says, ‘and it goes “bang, bang, bang” because it’s that hard. It won’t be easy for the batters today. The pitch will get faster.’ He’s right: 11 wickets fall that day. He gets up to walk over to the press box and begin his day’s work with Mail Sport. A couple of people scrape back their chairs from neighbouring tables and ask for selfies and he chats and smiles with them and talks about England’s chances of fighting their way back into the series. He spots Mark Wood and Chris Woakes, soon to become England’s latest Headingley heroes, as they wander past on the other side of the road on their way to the changing rooms, and applauds them. The other diners applaud, too, and Wood and Woakes give a wave. A woman, who has had her back to us but has been listening to the conversation about the pitch and the Lancashire League and has heard the knowledge and the warmth pouring out of Lloyd, looks up as he is leaving. ‘We miss you, Bumble,’ she says. Everybody tells him that. Wherever he goes. Everybody wishes he were still part of Sky’s brilliant cricket coverage with Michael Atherton, Nasser Hussain and Ian Ward, colleagues who had become dear friends. And even though it is lovely to hear, it twists at his insides, too. Lloyd began his presenting career as a cricket commentator after he quit as ex-England coach It is more than 18 months since Lloyd’s world changed when his name was mentioned by former Yorkshire cricketer Azeem Rafiq at a DCMS select committee hearing into the racism scandal that had engulfed the county and which continues to reverberate around the game now. Rafiq, whose career at Yorkshire had been blighted by institutional racism, was under pressure to name names. Lloyd had swapped a few direct messages on Twitter with an account called Cricket Badger, run by a journalist called James Buttler, who Lloyd had never met. Lloyd had repeated stories he had been told about Rafiq’s personal life and had suggested it was difficult to integrate Asian cricketers into some local clubs because they were alienated by the drinking culture that dominates much of English sport. Lloyd was named by Azeem Rafiq at a DCMS select committee hearing into the racism scandal He had also suggested that ‘getting subs out of Asian cricketers is like getting blood out of a stone’. Cricket Badger told Rafiq about the conversations and Rafiq repeated them in front of the DCMS committee. He talked about ‘closet racists’ within the game. Sometimes, the wronged, on their mission to put things right, hurt good people on their journey. The die was cast. Lloyd phoned Rafiq immediately and apologised. He released a statement and also apologised to the wider Asian cricketing community. A month later, it was announced he was retiring from Sky Sports, where he had worked for 22 years as a much-adored commentator. The job, and the fact he had been an England player, England coach and an umpire as well as a brilliant analyst and a natural, instinctive broadcaster had turned him into a national treasure. ‘I’ve decided the time is right to pass on the microphone,’ his statement said. The Lancashire-born cricket icon would later leave his role as a Sky Sports commentator Amid the many, many tributes that flooded in, there was this from Rob Key, now England’s director of cricket. ‘What a sad day,’ he wrote. ‘The best person I know, by some distance as well. Love always, Bumble. No one does it better.’ We walk from the cafe along into Headingley. Bumble stops again and again for fans to take selfies. Australia fans stop and talk to him, too. He’ll talk to anyone. That hasn’t changed. Eventually, we get up to the media canteen and sit down in a quiet corner and talk about what happened. ‘After the DCMS hearing,’ Lloyd says, ‘I rang Azeem and apologised and we had a good conversation. As far as I was concerned — and I think he has said the same — we were fine. Azeem had a grievance and it wasn’t dealt with by his employers. The top people at Yorkshire were incompetent at dealing with his grievance and it escalated to a position where he had nowhere else to go. ‘The comment I made about getting blood out of a stone was stupid. I think there are issues about raising money for clubs through the bar but there are other ways to generate finance because we are a multi-racial country and we should be able to find a solution to the support a club needs to keep going. That shouldn’t be too hard. ‘I don’t bear any bitterness towards Azeem. None at all. I think some of the MPs on the DCMS committee were a bunch of chancers and grandstanders. Where is Julian Knight now? I think we know. Where is John Nicolson now? They were looking for a fall guy and I dropped straight into their lap.’ Lloyd had repeated stories he had been told about Rafiq’s personal life to a journalist and had suggested it was difficult to integrate Asian cricketers into some local clubs because they were alienated by the drinking culture. Pictured: Rafiq addressing the House of Commons When Lloyd announced his retirement, he was 74. The end of a job that he had given so much of his life to and which had become wrapped up with his identity, which he loved and which he knew he had been good at, was desperately hard for him to come to terms with. ‘I was in a complete whirl,’ Lloyd says. ‘I felt unbelievably isolated. My wife and I were moving house to North Yorkshire. The house was being done up and the builders were in and are mates and they could see there was a problem and I just immersed myself in the move. That’s how I try to deal with things. Any problem, just as soon as you wake up, work, work, work. Just never stop until you go to bed and that’s how I dealt with it. ‘I was lucky that it needed a hell of a lot of work. I got stuck in and that saved me because I would have done something stupid. ‘My self-esteem was absolutely dreadful. I wouldn’t answer the phone to anybody, even people like Atherton, who was ringing constantly. He wanted to come and see me and I said no. I just locked myself away. I didn’t engage with anybody. ‘My life was upside down and in turmoil. I have put a veneer on it when I’ve been hurting inside like you wouldn’t believe. It was desperately hard for Lloyd to come to terms with his retirement from commentary Lloyd (right) was previously a coach for the England team during a spell from 1995 to 1999 ‘I come back to Accrington. I am very comfortable with who I am. No worries at all. I don’t need anybody to tell me who I am. I’m a decent bloke. I know that. Because I have been brought up properly. And I know it’s a bit big-headed, but I could do it. ‘Going back to my dad, who was a lay preacher, he always said “just be yourself”. What you see is what you get. I’m not a fine-dining sort of bloke. End of play, have a curry, couple of pints, see you tomorrow, pretty basic. ‘I’ve been in a hell of a tunnel. In my life, I have never had any resentment with anyone and I’m getting back to that state again now. I’ve had one or two rows with Geoffrey Boycott in the past but I absolutely love him to bits. Bumble: A life in cricket 407 first-class matches and 208 List A matches for Lancashire (1965-83) Nine Tests and eight ODIs for England (1973-80) First-class Umpire (1985-87) Coached Lancashire (1993-96) and England (1996-99) Commentator for Sky Sports (1999-2021) <!- - ad: https://mads.dailymail.co.uk/v8/gb/sport/cricket/article/other/mpu_factbox.html?id=mpu_factbox_1 - -> Advertisement He has been a great standard bearer for English cricket because of the way he played and the way he commentated. I have had some flipping rows with Boycs because of who he is but it doesn’t last. I have been in a big tunnel but I am out of it.’ And so we talk about happy things because there are so many happy things in his life and because he spreads, still, so much joy throughout the game and through the force of his personality and because he has achieved so much and has so much still to achieve. You only need to say ‘Bumble’ and people who love sport smile. It is a precious gift. ‘I never walked away from a dinner with Bumble not feeling better about the world,’ Atherton told me recently. ‘I had so many wonderful times at Sky,’ Bumble says. ‘In earlier days, Bob Willis and Paul Allott were my best mates. That was the last of the summer wine. We’d go on steam train trips to north Wales. We were inseparable. When they left, the younger lads came in — Nasser, Atherton, Ward. And again, we were inseparable. I worked with David Gower and Ian Botham and they did their own thing, which was fine. I had a great working relationship with Bryan Henderson and Mark Lynch was a massive influence as a director. The whole production team was pushing all the time, young people with lots of energy and that rubs off on you. ‘It was a massive blow to me when Bob died. The most affectionate bloke you could ever come across, as a true mate. A very caring chap. The England lads hated him until they met him because he could be very critical with his dour act which he took over from a former England player and journalist, Robin Marlar, who was known as “Marlar the Snarler”. He’d do a hatchet job on everybody. Bob took that mantle on. ‘He was mortified once because he had to write a letter of apology to Chris Woakes for giving him 0 out of 10 for one performance because “you don’t get a point for turning up” and Woakes is the nicest fella you could ever wish to meet. I miss Bob every day. ‘There are so many cricket broadcasters I admire. Nowadays, I’d say Ian Bishop and Simon Doull. Atherton and Hussain are a cut above. Ian Ward is a fabulous presenter. Mel Jones, too. She is the real deal, a great voice. Ebony Rainford-Brent is excellent. Lloyd admits that there are so many wonderful broadcasters in cricket that he admires ‘I worked for TMS for 11 years before I worked for Sky and Jonathan Agnew is a fabulous broadcaster. I like Simon Mann’s understated style. And I was driving home earlier in the series, listening to an excellent passage of commentary from Daniel Norcross. I tapped him on the shoulder in the lunch queue the next day to tell him how much I’d enjoyed it. ‘Further back, Fred Trueman is one of my all-time heroes. He was a curmudgeon and of course no one ever bowled as fast but he was a brilliant broadcaster. Geoffrey was a box-office listen. You have to listen. You don’t have to agree. Tony Cozier, CMJ, Jim Maxwell and my all-time hero, Bill Lawry. ‘I admired Lawry’s enthusiasm, his one-eyedness, his passion for Australian cricket, inflexions in his voice, he gets the big moments. You can do all your little stories and your pastimes but don’t miss the big moments. He nailed it every time. ‘He had a great rapport with Richie Benaud and Tony Greig. You saw that with Michael Holding and Ravi Shastri and Sunil Gavaskar. You get familiar with each other and you bounce off. You just have that telepathy. ‘It’s like opening the batting. You don’t call. You just look and go. As a duo, you knew “he’s done, I’m in” or “he’s done and so am I”. And just let it go. It’s an English thing that less is more. ‘We were always told at Sky, “less is more, shut up”. Dan Maskell and Peter Alliss, two of the all-time greats of British sports commentary, let the pictures tell the story. Sometimes, you have to have the judgment to think, “I’ve nothing to add to the pictures”. Nasser Hussain is one of the broadcasters and cricket commentators Lloyd enjoys listening to ‘Back in my TMS days, I was nobody and I asked the show’s legendary producer, Peter Baxter, why he used me. He said my voice was perfect. And that has stood me in good stead, the tenor of my voice. It’s quite deep. If you’ve got enthusiasm, your inflexions will take you up and down and you can’t just be monotonal. And you always start down because if you don’t, there’s nowhere to go.’ Perhaps, for a while, Bumble felt he had nowhere to go, too. But he’s past that. He is a hugely valued contributor to Mail Sport, he does a few appearances for talkSPORT without payment, because ‘they’re a fantastic bunch’. ‘When I go on with Ally McCoist and Alan Brazil and Laura Woods, when she was there, it’s just a brilliant lift,’ he says. ‘It’s good fun. ‘I need to work. Cricket’s second nature. I’ll go and watch Lancashire women against Yorkshire women. ‘I went to watch Lancashire Seconds and Yorkshire Seconds. I do Lancashire TV, which is like going home. ‘Just to walk into Old Trafford... I’ll be able to do more work from May next year. I’ll be 77 then but I’m not 77. I’m in my 50s, probably. I want to get back to doing more.’ Until then, he has plenty to occupy him, watching Earth children and their games. Now, he works as a contributor to Mail Sport and also enjoys appearing on other sports shows At the home he and his wife have now moved into, north of York, he has even created his own Field of Dreams. ‘I’ve got a few acres,’ Bumble says, ‘and I have got machines. I could go four and a half hours on a tractor and I love it. ‘Switch off, tending to fields. One of the fields, I have made into a cricket ground, I have put a pitch in the middle and a scoreboard and cut the grass. ‘You can’t play on it. It’s just a spoof pitch. You’d need ambulances everywhere if you had a match on it but it’s a big field and we’ve put stumps in and I cut it every day.’ Share or comment on this article: David Lloyd has done it all, but his world was rocked by the fallout from the Rafiq scandal e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-14 21:30:46","image_url":"https://i.dailymail.co.uk/1s/2023/07/14/22/73236077-0-image-m-93_1689368863140.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Test: Jaiswal, Ashwin Help India Beat Windies By Innings And 141 Runs","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-1st-test-day-3-yashasvi-jaiswal-ravichandran-ashwin-help-india-ease-past-west-indies-4209080","keywords":null,"creator":null,"video_url":null,"description":"Senior off-spinner R Ashwin picked up yet another five-wicket haul (7/71) to bowl India to an innings and 141-run win over West Indies in the opening Test in Dominica on Friday.","content":"The world's top-ranked bowler R Ashwin was too good for an ill-equipped West Indies batting line-up as his second five-wicket haul of the game set up India's innings and 141-run victory in the opening Test in Dominica on Friday. After India declared their first innings at 421 for five midway into the afternoon session, an improved batting show was expected from the Caribbean batters but they were simply not up to the task and collapsed to 130 all out in 50 overs to ensure a three-day finish. Ashwin followed his 33rd five-wicket haul in the first innings with envious figures of seven for 71 in 21.3 overs, his best in an overseas Test. The result was a foregone conclusion after the West Indies were bundled out for 150 on the opening day. India's big win was also set up by Yashasvi Jaiswal who made a sublime 171 on debut. Virat Kohli contributed with 76 off 182 but it was not among his fluent knocks as he had to work extremely hard for his runs and was even dropped twice along the way. The second and final Test starts in Port of Spain, Trinidad, from July 20. India, who have not lost a Test to West Indies since 2002, will be expected to complete a clean sweep and pick up crucial points in the World Test Championship. The writing was on the wall when the West Indies were reduced to 32 for four in their second innings. With the conditions resembling the slow and dry tracks of India, Rohit Sharma introduced spin as early as the fifth over. West Indies slipped to 27 for two in 19 overs at tea with Ashwin and Jadeja removing Kraigg Brathwaite (7) and Tagenarine Chanderpaul (7) respectively. Jadeja trapped Chanderpaul in front with the one that turned from middle stump and DRS showed it was clipping the top of his leg-stump. Advertisement Brathwaite had little clue on what the skilful Ashwin was up to as he edged a straighter one to Ajinkya Rahane at first slip. The only West Indies batter who looked assured in the middle was debutant Alick Athanaze (28 off 44), who was not afraid to sweep Ashwin before unleashing a square cut and a pull off Mohammed Siraj. The talented southpaw was eventually caught at short leg by Jaiswal off Ashwin in the 37th over. India declared an hour after lunch and it seemed they were waiting for debutant Ishan Kishan to get his first run which took 20 balls. The visitors batted for as many as 152.2 overs in their first innings, scoring at a run rate of 2.76 for a massive 271-run lead. Kohli was the lone India batter to be dismissed after lunch. After being dropped in the first over post the break, Kohli did not last long as he fell into the trap laid by offie Rahkeem Cornwall. The burly spinner got one to bounce from middle stump and Kohli ended up flicking to the waiting leg slip fielder. In the morning, Jaiswal became only the third Indian to score 150 on debut while Kohli had to toil for a half-century as the visitors reached 400 for four at lunch. Resuming the day at 312 for two, India managed 88 runs in 29 overs in the morning session for the loss of Jaiswal (171) and Ajinkya Rahane (3). The Indian batters had to work for their runs on a slow pitch offering a lot of turn and a heavy outfield. Kohli celebrating after hitting a rare boundary was proof of that. Left-arm spinner Jomel Warrican opened the bowling alongside Holder and instantly created issues for Kohli. The former India skipper got a life when he was dropped on 40 by West Indies captain Brathwaite. Kohli went for a drive off Warrican and Brathwaite ended up grassing an easy chance at cover. At the other end, Jaiswal stepped out to Warrican and dispatched him for a straight six. He became the third Indian to reach 150 on debut with a single, matching the feats of Shikhar Dhawan (187) and Rohit Sharma (177). A double hundred was in the offing for Jaiswal but it wasn't to be as he edged one that angled away from Alzarri Joseph. Soon after Rahane, who had a good opportunity to make a big impact, attempted a drive on the up on a slow pitch off Kemar Roach and ended up offering a simple catch at cover. With Rahkeem Cornwall not allowed to bowl in the morning as he did not take the field on day two, the West Indies offered some easy boundaries to India towards the end of the session. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-07-14 21:29:11","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Ravi Ashwin, Yashasvi Jaiswal Star As India Beat West Indies by an Innings and 141 Runs in 1st Test 2023","link":"https://www.latestly.com/socially/sports/cricket/ravi-ashwin-yashasvi-jaiswal-star-as-india-beat-west-indies-by-an-innings-and-141-runs-in-1st-test-2023-5267005.html","keywords":null,"creator":null,"video_url":null,"description":"The Rohit Sharma-led side got off to a roaring start in the fresh World Test Championship cycle with this dominant performance over the West Indies. Ravichandran Ashwin starred with 12 wickets in the match while debutant Yashasvi Jaiswal smashed 171 in India's first innings.","content":"Ravichandran Ashwin took seven wickets in the second innings of the first Test as India beat West Indies by a mammoth margin of an innings and 141 runs in the 1st Test 2023. Ashwin, on the back of a five-wicket haul in the 1st Test, finished the match with a total of 12 wickets in the game. Yashasvi Jaiswal earlier dazzled on his debut, scoring 171 runs in India's first innings effort of 421/5d. With this, India have a 1-0 lead in this series, with the next and remaining Test match scheduled to start on July 20. Ravi Ashwin Completes His Eighth 10-Wicket Haul in Test Cricket, Achieves Feat During Day 3 of IND vs WI 1st Test 2023. India Beat West Indies in 1st Test 2023 1ST Test. India Won by an innings and 141 Run(s) https://t.co/xaaoS40Fyf #WIvIND — BCCI (@BCCI) July 14, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-14 21:27:17","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test Day 3 Live Score Update: पहले टेस्ट में टीम इंडिया ने वेस्टइंडीज को एक पारी और 141 रनों से दी करारी शिकस्त, सीरीज में 1-0 की बनाई बढ़त","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-3-live-score-update-in-the-first-test-team-india-defeated-west-indies-by-an-innings-and-141-runs-took-a-1-0-lead-in-the-series-1864824.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया की तरफ से युवा सलामी बल्लेबाज यशस्वी जायसवाल ने सबसे ज्यादा 171 रन बनाए. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला गया. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. मैच के तीसरे दिन टीम इंडिया ने वेस्टइंडीज को एक पारी और 141 रन से हराकर सीरीज में 1-0 की बढ़त बना ली हैं. टीम इंडिया की तरफ से युवा सलामी बल्लेबाज यशस्वी जायसवाल ने सबसे ज्यादा 171 रन बनाए. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. जवाब में टीम इंडिया ने अपनी पहली पारी पांच विकेट पर 421 रन के स्कोर पर घोषित की. इस तरह टीम इंडिया को 271 रन की बढ़त मिली. वहीं, दूसरी पारी में वेस्टइंडीज की पूरी टीम 50.3 ओवर में महज 130 रन पर आल आउट हो गई. टीम इंडिया की ओर से आर अश्विन ने पहली पारी में सबसे ज्यादा पांच और दूसरी पारी में भी सात विकेट विकेट चटकाए. टीम इंडिया और वेस्टइंडीज के बीच दूसरा टेस्ट मैच 20 जुलाई से पोर्ट ऑफ स्पेन में खेला जाएगा. INDIA WON FIRST TEST MATCH. India beat West Indies by innings and 141 runs, a dream start in new WTC cycle. Stars are Ashwin with 12 wickets, hundreds by Rohit & Jaiswal. pic.twitter.com/r8jjiW9jSp — Johns. (@CricCrazyJohns) July 14, 2023 1ST Test. India Won by an innings and 141 Run(s) https://t.co/xaaoS40Fyf #WIvIND — BCCI (@BCCI) July 14, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-14 21:15:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"}]}