{"newsArray":[{"title":"‘Now I’ve seen everything!’ – Obstruction or run out?","link":"https://www.themercury.com.au/sport/cricket/now-ive-seen-everything-obstruction-or-run-out/video/bc7be123d224a53129cb0c1dd66c5369","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: There was confusion and controversy aplenty when Lucy Hamilton was deemed to have been runout against Sri Lanka at the Women's U-19 World Cup.","content":"Cricket: There was confusion and controversy aplenty when Lucy Hamilton was deemed to have been runout against Sri Lanka at the Women's U-19 World Cup.","pubDate":"2023-01-19 00:09:20","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"Batting maestro Hashim Amla calls time on illustrious career","link":"https://www.dailymaverick.co.za/article/2023-01-18-batting-maestro-hashim-amla-calls-time-on-illustrious-career/","keywords":null,"creator":["Craig Ray"],"video_url":null,"description":"Hashim Amla, one of South Africa’s greatest players, officially retired from all forms of cricket on Wednesday after a 20-year first-class career. The post Batting maestro Hashim Amla calls time on illustrious career appeared first on Daily Maverick.","content":null,"pubDate":"2023-01-18 19:34:18","image_url":null,"source_id":"dailymaverick","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs NZ first ODI | Fearless Bracewell-Santner tie: India win by 12 runs","link":"https://thenewsglory.com/ind-vs-nz-first-odi-fearless-bracewell-santner-tie-india-win-by-12-runs/","keywords":["Sports","Bracewll","Cricket","game","India","New Zealand","Santner"],"creator":["The News Glory"],"video_url":null,"description":"Hyderabad: India won the first ODI against New Zealand by 12 runs. The game went to the final over. Bracewell threatened the Indian team’s victory with his action. However, India won by taking his wicket as the last wicket. New Zealand cricket team is touring India and playing cricket series with India. Both the teams […]","content":"Hyderabad: India won the first ODI against New Zealand by 12 runs. The game went to the final over. Bracewell threatened the Indian team’s victory with his action. However, India won by taking his wicket as the last wicket. New Zealand cricket team is touring India and playing cricket series with India. Both the teams are currently playing a three-match ODI series. The first match of this series was played in Hyderabad today. The Indian team won the toss and elected to bat first. 349 runs scored at the end of 50 overs. New Zealand chased down the target of 350 runs to win. The team did not get the required partnership and kept losing wickets at regular intervals. Conway, Allen, Henry Nicholls, Mitchell, Glenn Phillips, Tom Latham, six batsmen lost their wickets when the team reached 131 runs. Then Santner and Bracewell formed a great partnership. \rBracewell – Santner\r The two put on a partnership of 161 runs. They were attacking the bowling of the Indian team. Bracewell hit a century, Santner passed his half-century. Siraj broke this risky alliance. He dismissed Santner for 57 runs. Bracewell was busy driving the ball to the boundary though. The team needed 20 runs to win in the last over. Bracewell was on strike. That over was bowled by Shardul Thakur. He hit a six off the first ball. The next ball was bowled empty. Next ball, Bracewell is out to LP at straight leg. He scored 140 runs off 78 balls. It included 12 fours and 10 sixes. New Zealand were all out for 337 runs in 49.2 overs. India won by 12 runs. Siraj took 4 wickets for the Indian team. Along with that, his bowling also restricted the opponent’s run accumulation. Earlier, captain Rohit Sharma and Gill opened the innings in the first innings of this match. Rohit was out for 34 runs. Kohli and Ishan Kishan, who followed, got out with single digit runs. Gill then put on a partnership of 65 runs with Suryakumar Yadav and 74 runs with Hardik Pandya. Suryakumar lost their wickets for 31 runs and Pandya for 28 runs. Washington Sundar and Shardul Tagore were quick to return to the pavilion. At the same time, the Indian team did not hit a boundary till about 26 balls. Gill, however, had fireworks in the last three overs. He got out after scoring 208 runs off 149 balls in the last over after a rain of sixes. He hit 19 fours and 9 sixes. At the end of 50 overs, the Indian team scored 349 runs for the loss of 8 wickets.","pubDate":"2023-01-18 17:35:40","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's U-19 WC: Shafali Verma's team enter Super Six with massive win over Scotland","link":"https://www.indiatvnews.com/sports/cricket/women-s-u-19-wc-shafali-verma-s-team-enter-super-six-with-massive-win-over-scotland-2023-01-18-840393","keywords":null,"creator":null,"video_url":null,"description":"On Wednesday, the Indian women's U-19 cricket team, led by the spin bowling trio of Mannat Kashyap, Archana Devi, and Sonam Yadav, gave a remarkable performance and defeated Scotland by 83 runs, securing a spot in the Super Six round of the first-ever Women's U-19 T20 World Cup.","content":null,"pubDate":"2023-01-18 17:31:08","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ | Asathya Siraj took a wicket in his hometown: The family came to watch the match","link":"https://thenewsglory.com/ind-vs-nz-asathya-siraj-took-a-wicket-in-his-hometown-the-family-came-to-watch-the-match/","keywords":["Sports","Cricket","game","India","New Zealand","Siraj"],"creator":["The News Glory"],"video_url":null,"description":"Hyderabad: Indian bowler Mohammad Siraj has taken a wicket in the one-day cricket match against the New Zealand team in his hometown. His family has also come to the stadium to watch him play. The 28-year-old right-arm fast bowler Siraj is one of the indispensable players in the Indian team. In ODI cricket, he bowls […]","content":"Hyderabad: Indian bowler Mohammad Siraj has taken a wicket in the one-day cricket match against the New Zealand team in his hometown. His family has also come to the stadium to watch him play. The 28-year-old right-arm fast bowler Siraj is one of the indispensable players in the Indian team. In ODI cricket, he bowls tremendously and takes wickets. Hailing from Hyderabad city. The first ODI between India and New Zealand is currently being played in Hyderabad. A local player, he has unanimous fan support. Whenever he comes to bowl, they cheer and amaze. Besides, his family has also come to the stadium to witness the match. In this case, he took the wicket of New Zealand player Devon Conway. Siraj took the wicket in the 6th over of the second innings. The expression of joy at his hometown wicket capture was evident in his body language. So far he has bowled 7 overs and taken 2 wickets by giving 29 runs including 2 maidens. His second wicket was New Zealand captain Tom Latham. \r First success with the ball for #TeamIndia!First international wicket on his home ground for @mdsirajofficial New Zealand lose Devon Conway Live – https://t.co/DXx5mqRguU #INDvNZ @mastercardindia pic.twitter.com/J7Hj6aeyid","pubDate":"2023-01-18 16:34:42","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Subman Gill is the 5th Indian to score a double century in ODI cricket","link":"https://thenewsglory.com/subman-gill-is-the-5th-indian-to-score-a-double-century-in-odi-cricket/","keywords":["Sports","Cricket","game","India","Shubman Gill","Subman Gill"],"creator":["The News Glory"],"video_url":null,"description":"Hyderabad: Indian cricketer Subman Gill has scored a double century in ODI against New Zealand. With this, he has created the record of being the youngest player to score a double century in ODI cricket. He also became the 5th Indian to score a double century in ODI cricket. He scored 208 runs off 149 […]","content":"Hyderabad: Indian cricketer Subman Gill has scored a double century in ODI against New Zealand. With this, he has created the record of being the youngest player to score a double century in ODI cricket. He also became the 5th Indian to score a double century in ODI cricket. He scored 208 runs off 149 balls against New Zealand in Hyderabad. It included 19 fours and 9 sixes. His strike rate is 139.60. With this, he became the youngest player to score a double century in ODI cricket at 23 years and 132 days. He also holds the record of being the Indian player who scored most runs in a single innings against the New Zealand team in ODI cricket. He also holds the record of being the Indian who has crossed 1000 runs in the shortest innings (19 innings) in ODI cricket. \r Milestone – Shubman Gill becomes the fastest Indian to score 1000 ODI runs in terms of innings (19) Live – https://t.co/DXx5mqRguU #INDvNZ @mastercardindia pic.twitter.com/D3ckhBBPxn — BCCI (@BCCI) January 18, 2023 Indians who scored a double century in ODI cricket \r Sachin Tendulkar vs South Africa: 200 runs – 2010 \r Sehwag vs West Indies: 219 runs – 2011 \r Rohit Sharma vs Australia: 209 runs – 2013 \r Rohit Sharma vs Sri Lanka: 264 runs – 2014 \r Rohit Sharma vs Sri Lanka: 208 runs – 2017 \r Ishan Kishan vs Bangladesh: 210 runs – 2022 \r Subman Gill vs New Zealand: 208 runs – 2023 \r","pubDate":"2023-01-18 14:32:41","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ: RRR star Jr NTR turns 'lucky charm' for Shubman Gill, fans call him 'reason behind double century'","link":"https://www.dnaindia.com/cricket/report-ind-vs-nz-rrr-star-jr-ntr-turns-lucky-charm-for-shubman-gill-fans-call-him-reason-behind-double-century-3017793","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Indian cricket fans called RRR star Jr NTR a lucky charm for Indian batsman Shubman Gill after his explosive double century against New Zealand.","content":null,"pubDate":"2023-01-18 13:06:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Gill scores maiden double ton, India sets target of 349 for New Zealand","link":"https://www.orissapost.com/gill-scores-maiden-double-ton-india-sets-target-of-349-for-new-zealand/","keywords":["Sports","Blair Tickner","double hundred","Hardik Pandya","India","Ishan Kishan","Lockie Ferguson","new zealand","odi","rohit sharma","Shubman Gill","suryakumar yadav","U-19 world cup","virat kohli"],"creator":["Post News Network"],"video_url":null,"description":"Hyderabad: Shubman Gill smashed a coming-of-age double hundred to power India to 349 for eight in the first ODI against New Zealand here Wednesday. Gill oozed class in his special 208 off 149 balls and batted through the innings with not much support from the other end. Skipper Rohit Sharma’s 34 off 38 was the […]","content":"Hyderabad: Shubman Gill smashed a coming-of-age double hundred to power India to 349 for eight in the first ODI against New Zealand here Wednesday. Gill oozed class in his special 208 off 149 balls and batted through the innings with not much support from the other end. Skipper Rohit Sharma’s 34 off 38 was the second best score of the innings. The 23-year-old, who was touted as the next big thing in Indian cricket ever since he displayed his talent in the 2018 U-19 World Cup, hammered 19 fours and nine sixes, six of them coming after his 150. The double century, his maiden, was also his second successive three digit score. 𝟔.𝟔.𝟔. 𝐃𝐎𝐔𝐁𝐋𝐄 𝐂𝐄𝐍𝐓𝐔𝐑𝐘 Take a bow, @ShubmanGill #INDvNZ pic.twitter.com/wwvQslGTxb — BCCI (@BCCI) January 18, 2023 After India opted to bat, it was a good contest between the openers and New Zealand pacers as the hosts reached 52 for no loss in the first 10 overs. The odd ball was stopping, making stroke making difficult. Rohit once again promised a big hundred but flattered to deceive. His sixes off Henry Shipley, a lofted drive over cover and a front foot pick up shot over long leg, stood out in his innings. Lockie Ferguson was generating serious pace as usual from one end but after getting lucky with a mistimed pull in the fourth over, Gill produced a crisp cover drive to deny him a maiden in his following over. Rohit’s aerial attempt off Blair Tickner in the 13th over ended his innings as he was caught at mid-on by Mitchell Santner. Usually, a wicket silences the Indian crowd but following Rohit’s dismissal, the crowd welcomed superstar Virat Kohli with a massive roar. Having scoring three hundred in his last four innings, Kohli began with a crunchy cover drive before being undone by a beauty from left-arm spinner Mitchell Santner. The ball pitch around off stump and turned just enough to clip the bails, leaving Kohli in disbelief. Ishan Kishan, who was accommodated in the middle-order after missing out against Sri Lanka, too did not last long as he edged an angled delivery to wicketkeeper Tom Latham. Suryakumar Yadav (31) joined Gill and did what he does best — increase the tempo of the innings. He hit four boundaries in different parts of the ground to assert himself. At the other end, Gill brought up his fifty with a slog sweep off spinner Michael Bracewell that went all the way. The stylish opener also got a life on 45 when Latham fluffed a straight forward stumping chance off Bracewell with Gill expecting the ball to turn. That was all the stroke of luck that Gill had as he did not look back from there on. He unleashed his signature pull shot off the pacers while using his feet against the spinners. He pulled Santner to get to 99 before reaching his third ODI hundred with a single. He reserved his best shot for the post century celebrations as he whipped a full delivery from Tickner between mid-wicket and mid-on. After Surya’s departure, Gill shared a 74-run stand with Hardik Pandya (28), who got out in a rather bizarre fashion. After he missed a cut shot completely off Santer, the bails came off and New Zealand appealed for a bowled dismissal. Latham’s gloves could have dislodged the bails but he himself wasn’t sure. The replays were not conclusive but the third umpire ruled in favour of the visitors. As India cruised towards 300, Gill reached 150 with a six over deep mid-wicket off Bracewell. After that milestone, he went berserk and reached the 200 with three huge sixes off Ferguson in the 49th over. His power hitting meant India hammered 57 runs off the last five overs. PTI","pubDate":"2023-01-18 12:50:43","image_url":"https://www.orissapost.com/wp-content/uploads/2022/08/FotoJet-2022-08-22T161922.057-784x441-678x381-1-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 1st ODI: Double hundred for Shubman Gill, youngster goes past Virat Kohli & MS Dhoni's record","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-1st-odi-double-hundred-for-shubman-gill-youngster-goes-past-virat-kohli-ms-dhoni-s-record-rajeev-gandhi-international-stadium-2023-01-18-840318","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ 1st ODI: Scintillating, absolutely scintillating, the Shubman Gill show has blown everybody apart, especially the Kiwi team. It was all meant to be with Gill keeping his cool at one end of the wicket. The likes of Virat Kohli, Suryakumar Yadav, and Rohit Sharma kept on perishing at one end, but it was youngster Gill who kept his cool and kept on striking the Kiwi bowlers. With this Gill has become the youngest player to score a double century for the Indian cricket team.","content":null,"pubDate":"2023-01-18 12:13:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs NZ: Shubman Gill becomes youngest batter to slam double hundred in ODI cricket history","link":"https://www.dnaindia.com/cricket/report-ind-vs-nz-shubman-gill-becomes-youngest-batter-to-slam-double-hundred-in-odi-cricket-history-3017770","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Gill scored his second century in succession after hitting a ton against Sri Lanka in the 3rd ODI in Thiruvananthapuram.","content":null,"pubDate":"2023-01-18 12:04:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH VIDEO: Huge error committed by third umpire, adjudges Hardik Pandya OUT","link":"https://www.indiatvnews.com/sports/cricket/watch-video-huge-error-committed-by-third-umpire-adjudges-hardik-pandya-out-ind-vs-nz-1st-odi-shubman-gill-2023-01-18-840309","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ 1st ODI: The umpiring standard have gone down extremely low as far as international cricket is concerned and Indian all-rounder Hardik Pandya is the latest victim of it. The first One Day International that is being played between India and New Zealand witnessed something bizarre while Hardik Pandya was batting. India were jolted by back-to-back blows of Ishan Kishan and Suryakumar Yadav's dismissal and the onus was on Hardik Pandya and Shubman Gill to guide India to a big total","content":null,"pubDate":"2023-01-18 11:49:46","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Ind vs NZ: Shubman Gill, Siraj shine as India win by 12 runs in a thriller to take 1-0 lead","link":"https://www.tribuneindia.com/news/sports/shubman-gills-maiden-odi-double-ton-powers-india-to-349-8-against-new-zealand-in-first-odi-471539","keywords":null,"creator":null,"video_url":null,"description":"Hyderabad, January 18 Shubman Gill settled the debate for the opener's slot with a coming of age doubled hundred before India survived Michael Bracewell's blitzkrieg to pull off a nervy 12-run win over New Zealand in the first ODI of the three-match series here on Wednesday. Gill oozed class in his special 208 off 149 balls and batted through the innings to power India to 349 for eight. Skipper Rohit Sharma's 34 off 38 was the second best score of the innings, highlighting that it was very much a one-man show. Chasing a big target, New Zealand were down and out at 131 for six before Michael Bracewell (140 off 78) came up with up a stunning century to bring his team back in the game from nowhere. He shared 162 off 102 balls with fellow left-hander Mitchell Santer (57 off 45), New Zealand's highest seventh wicket stand in ODIs, to test India's nerves. Playing in front of his home crowd, pacer Mohammed Siraj (4/46) produced a match-winning effort to stop New Zealand, who ended at 337. After India opted to bat, the 23-year-old Gill owned the stage and became the youngest batter to score a double hundred in ODI history. By doing so, he broke the record of Ishan Kishan, who was controversially dropped for the Sri Lanka ODIs after smashing a double ton in Bangladesh last month. Gill, who was touted as the next big thing in Indian cricket ever since he displayed his talent in the 2018 U-19 World Cup, hammered 19 fours and nine sixes, six of them coming after his 150. The double century was also his second successive three digit score. After India opted to bat, it was a good contest between the openers and New Zealand pacers as the hosts reached 52 for no loss in the first 10 overs. Rohit once again promised a big hundred but flattered to deceive. Lockie Ferguson was generating serious pace as usual from one end but after getting lucky with a mistimed pull in the fourth over, Gill produced a crisp cover drive to deny him a maiden in his following over. Usually a wicket silences the Indian crowd but following Rohit's dismissal, the crowd welcomed superstar Virat Kohli with a massive roar. Having scoring three hundred in his last four innings, Kohli began with a crunchy cover drive before being undone by a beauty from left-arm spinner Santner. Kishan, who was accommodated in the middle-order after missing out against Sri Lanka, too did not last long as he edged an angled delivery to wicketkeeper Tom Latham. At the other end, Gill brought up his fifty with a slog sweep of off-spinner Bracewell that went all the way. The stylish opener also got a life on 45 when Latham fluffed a straight forward stumping off Bracewell with Gill expecting the ball to turn. That was all the stroke of luck that Gill had as he did not look back from there on. He unleashed his signature pull shots off the pacers while using his feet against the spinners. He pulled Santner to get to 99 before reaching his third ODI hundred with a single. He reserved his best shot for the post century celebrations as he whipped a full delivery from Tickner between mid-wicket and mid-on. After Suryakumar Yadav's departure, Gill shared a 74-run stand with Hardik Pandya (28) who got out in a rather bizarre fashion. As India cruised towards 300, Gill reached 150 with a six over deep mid-wicket off Bracewell. After that milestone, he went berserk and reached 200 with three huge sixes off Ferguson in the 49th over. What was astounding was Gill's ability to hit straight sixes. His sensational hitting meant India hammered 57 runs off the last five overs. New Zealand had a mountain to climb. Siraj provided the first breakthrough in front of a packed home crowd as his well directed short ball got big on Devon Conway (10). Conway's opening partner Finn Allen (40) played some enthralling strokes but fell to a brilliant catch in the deep from Shahbaz Ahmed off Shardul Thakur. Kuldeep Yadav was impressive once again as he got rid of Henry Nicholls with a perfect wrong one before trapping Daryl Mitchell in front of the stumps with the conventional incoming delivery. With New Zealand struggling at 131 for six in the 29th over, the game looked over before Bracewell played a knock to remember. He toyed with the Indian attack, smashing 12 fours and as many as 10 sixes. He took the team on the brink of a famous win before falling short. The second ODI of the series will be played in Raipur on Saturday. Brief Scores: India: 349 for 8 in 50 overs (Shubman Gill 208; Daryl Mitchell 2/30). New Zealand: 337; 49.2 overs (Michael Bracewell 140; Mohammed Siraj 4/46).","content":null,"pubDate":"2023-01-18 11:31:24","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1115047008.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"SA-WU19 vs UAE-WU19 Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for ICC Women's Under 19 T20 World Cup","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/sa-wu19-vs-uae-wu19-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-icc-women-s-under-19-t20-world-cup?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-18 11:12:37","image_url":"https://static.sportskeeda.com/editor/2023/01/f099b-16740232082975-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia thrash Pakistan with 10 wicket win","link":"https://www.couriermail.com.au/sport/cricket/australia-thrash-pakistan-with-10-wicket-win/video/e732aeebcbeb5757afd49eae8f6e3738","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia notched up another comprehensive win against Pakistan in their second one day match up, with a young star shining.","content":"Cricket: Australia notched up another comprehensive win against Pakistan in their second one day match up, with a young star shining.","pubDate":"2023-01-18 10:54:17","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 1st ODI: Sublime Shubman Gill scores third ODI ton, continues his dream run","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-1st-odi-sublime-shubman-gill-scores-third-odi-ton-continues-his-dream-run-updates-score-commentary-virat-kohli-rohit-sharma-rajiv-gandhi-2023-01-18-840283","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL 1st ODI: India have discovered a new gem in Shubman Gill. The Punjab-based batter is enjoying a dream run currently and has emerged as one of the most dependable openers for the Indian cricket team. This is Gill's consecutive second hundred and with every game, he is proving his worth in the national side. India are taking on New Zealand in this three-match One Day International (ODI) series and Gill has started it off in a pretty dominant fashion.","content":null,"pubDate":"2023-01-18 10:19:17","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Strength test ahead of World Cup, as India gear up for a tri-series in South Africa","link":"https://www.orissapost.com/strength-test-ahead-world-cup-as-india-gear-up-for-a-tri-series-in-south-africa/","keywords":["Sports","australia","Deepti Sharma Rajeshwari Gayakwad","Harleen Deol","Harmanpreet Kaur","ICC","India","Jemimah Rodrigues","Jhulan Goswami","Pooja Vastrakar","Renuka Thakur","richa ghosh","Shafali Verma","shikha pandey","Smriti Mandhana (Vice Captain)","south africa","T20 Tri-series","women’s World Cup","Yastika Bhatia (wk)"],"creator":["Post News Network"],"video_url":null,"description":"East London: The matches against Australia exposed a lot of chinks in their armour and India will be eager to address them by improving in all three department in their T20 tri-series opener against hosts South Africa here Thursday. With only a few days left for the T20 World Cup in South Africa, skipper Harmanpreet […]","content":"East London: The matches against Australia exposed a lot of chinks in their armour and India will be eager to address them by improving in all three department in their T20 tri-series opener against hosts South Africa here Thursday. With only a few days left for the T20 World Cup in South Africa, skipper Harmanpreet Kaur will be keen to provide the team a winning start in the tri-series against South Africa and West Indies. In the previous series, which India lost 1-4, Harmapreet and Co. Were able to push the mighty Australia to the limit but failed to land the killer blow, be it with the bat or ball. Their fielding was also found lacking. The series exposed India’s frailties in the bowling department and the team has a lot of work to do before the ICC event, starting February 10. India’s young and relatively inexperienced pace department has struggled since veteran Jhulan Goswami retired from international cricket. This led to experienced pacer Shikha Pandey’s surprise inclusion in the side after almost 15 months. Having last played an international match in October 2021 before controversially being dropped, the focus will be on the veteran pacer as India will bank on Pandey’s experience and form in the World Cup. Hence it is vital that the 33-year-old, whose strength is swing bowling, gets into rhythm soon and spearheads the pace unit. Pace bowling all-rounder Pooja Vastrakar also returns to the side after missing the Australia series due to an injury. An important cog in India’s scheme of things with the bat and ball, the tri-series will provide crucial game time to shrug off the rust after her injury layoff ahead of the World Cup. Renuka Singh, the team’s go-to bowler in the last six months, and rookie left-arm pacer Anjali Sarvani delivered in patches against Australia and will look for a consistent show as will the spinners, who didn’t fare too well either. Deepti Sharma is the only one who has taken wickets regularly. India squad for ICC Women’s T20 World Cup 2023 & tri-series in South Africa announced; Harmanpreet Kaur to lead the team, Smriti Mandhana named Vice-Captain: BCCI pic.twitter.com/2V4PEj9tCF — ANI (@ANI) December 28, 2022 India will miss the services of the big-hitting duo of Shafali Verma and Richa Ghosh, who are competing in the U-19 Women’s World Cup. Their absence will be an opportunity to test other players. Sabbhineni Meghana is likely to open alongside Smriti Mandhana while Yastika Bhatia will don the wicketkeeper’s gloves. India have found a much-needed finisher in the young Richa but in her absence skipper Harmanpreet could do with more support in the middle order. India have a lot of work to do in the batting department. Rotation of strike has been a huge issue. While the boundary count has increased, the Indian batters consumed way too many deliveries against Australia. Focus will be on Jemimah Rodrigues as well after a good show at the Commonwealth Games last August. One of the pillars of the Indian team, which went all the way to the final of the CWG, Jemimah needs to find the runs. Hosts South Africa will be eager to make a mark in their first international game since the CWG in Birmingham. The series will give them the opportunity to try out strategies and different combinations ahead of the World Cup as they look to capitalise on their home advantage. Teams (from): India: Harmanpreet Kaur (Captain), Smriti Mandhana (Vice Captain), Yastika Bhatia (wk), Jemimah Rodrigues, Harleen Deol, Deepti Sharma, Devika Vaidya, Rajeshwari Gayakwad, Radha Yadav, Renuka Thakur, Meghna Singh, Anjali Sarvani, Shushma Verma (wk), Amanjot Kaur, Pooja Vastrakar, Sabbhineni Meghana, Sneh Rana and Shikha Pandey. South Africa: Suné Luus (Captain), Chloé Tryon (Vice Captain), Anneke Bosch, Tazmin Brits, Nadine de Klerk, Annerie Dercksen, Lara Goodall, Shabnim Ismail, Sinalo Jafta, Marizanne Kapp, Ayabonga Khaka, Masabata Klaas, Tebogo Macheke, Nonkululeko Mlaba, Tumi Sekhukhune, Delmi Tucker and Laura Wolvaardt. Match starts 10:30pm IST. PTI","pubDate":"2023-01-18 10:06:34","image_url":"https://www.orissapost.com/wp-content/uploads/2023/01/Harmanpreet-Kaur-300x200.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"In passing away of Kaptanji Radheyshyam Sharma, Delhi cricket loses another pillar","link":"https://indianexpress.com/article/sports/cricket/in-passing-away-of-kaptaanji-radheyshyam-sharma-delhi-cricket-loses-another-pillar-8389257/","keywords":["Cricket","Sports"],"creator":["S Santhanam"],"video_url":null,"description":null,"content":null,"pubDate":"2023-01-18 07:49:48","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket live updates: Black Caps v India, first ODI","link":"https://www.nzherald.co.nz/sport/cricket-live-updates-black-caps-v-india-first-odi/HOABR5FOPNHPNKI3ECWLOSFGWQ/","keywords":null,"creator":null,"video_url":null,"description":"All the ODI action as the Black Caps take on India in Hyderabad.","content":null,"pubDate":"2023-01-18 07:45:06","image_url":"https://www.nzherald.co.nz/resizer/GyHNFVAqoxO86e0o4bbk_vR-YWM=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/NUHLVN333VE7ZKO265DPC7LZ34.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IND vs NZ 1st ODI Live Cricket Score: Kiwis in deep trouble, they are five down","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-1st-odi-live-cricket-score-latest-updates-rajiv-gandhi-international-stadium-rohit-sharma-ball-by-ball-commentary-virat-kohli-2023-01-18-840211","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ 1st ODI Live Cricket Score: Kiwis in deep trouble, they are five down India vs New Zealand: Rohit Sharma and co. are taking on Tom Lataham's Kiwi side. India are coming off a dominant series victory against Sri Lanka and they will try and keep up with their stellar performance. The Rajiv Gandhi International Stadium, Hyderabad","content":null,"pubDate":"2023-01-18 07:18:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"News24.com | Renowned NZ cricket and rugby pundit Ian Smith parts ways with Sky","link":"https://www.news24.com/sport/Cricket/renowned-nz-cricket-and-rugby-pundit-ian-smith-parts-ways-with-sky-20230118","keywords":null,"creator":null,"video_url":null,"description":"Renowned New Zealand cricket and rugby broadcaster Ian Smith has left Sky TV after 23 years.","content":null,"pubDate":"2023-01-18 06:47:25","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Live Cricket Score: India vs New Zealand 1st ODI","link":"https://timesofindia.indiatimes.com/sports/cricket/new-zealand-in-india/india-vs-new-zealand-1st-odi-match-live-updates/liveblog/97080807.cms","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-01-18 05:52:31","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"'उन्हें सब पता है कि यहां आए तो..' विदेशी कोच द्वारा PAK टीम का कोच बनने की पेशकश ठुकराए जाने पर बोले वसीम अकरम","link":"https://sports.ndtv.com/hindi/cricket/wasim-akram-says-this-after-the-foreign-coach-turned-down-the-offer-to-coach-the-pak-team-they-all-know-that-if-they-come-here-3702051#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Wasim Akram: जब से पाकिस्तानी क्रिकेट (Pakistan Cricket) के नए चैयरमैन नजम सेठी (Najam Sethi) बने हैं तब से पाक क्रिकेट में हलचल मच रही है. रमीज राजा के बटने के बाद नजम सेठी पाकिस्तानी बोर्ड के नए चैयरमैन बने तो वहीं शाहिद अफरीदी को कुछ समय के लिए पाकिस्तान क्रिकेट का मुख्य चयनकर्ता भी बनाया था.","content":"Wasim Akram: जब से पाकिस्तानी क्रिकेट (Pakistan Cricket) के नए चैयरमैन नजम सेठी (Najam Sethi) बने हैं तब से पाक क्रिकेट में हलचल मच रही है. रमीज राजा के बटने के बाद नजम सेठी पाकिस्तानी बोर्ड के नए चैयरमैन बने तो वहीं शाहिद अफरीदी को कुछ समय के लिए पाकिस्तान क्रिकेट का मुख्य चयनकर्ता भी बनाया था. वहीं,  नजम सेठी के चैयरमैन बनने के बाद पाकिस्तानी बोर्ड पाकिस्तान टीम के लिए विदेशी कोच की तलाश करने लगा. यही कारण था कि मिकी आर्थर (Mickey Arthur) को फिर से पाकिस्तान का कोच बनाने की कोशिश की गई, जिसे ऑर्थर ने ठुकरा दिया. अब इस मु्द्दे पर पाकिस्तान के पूर्व दिग्गज वसीम अकरम (Wasim Akram) ने रिएक्ट किया है और पाकिस्तान बोर्ड में हो रही हलचल पर अपनी राय रखी है. अकरम ने क्रिकेट पाकिस्तान के साथ बातचीत में अपनी राय रखी और कहा कि, 'यदि आप मुझसे जानना चाहते हैं तो मैं यही कहना चाहूंगा कि विदेशी कोच यकीनन अब हमारी टीम केसाथ नहीं आना चाहेंगे. सभी को पता है कि यदि बोर्ड का कार्यकाल खत्म होगा या पाकिस्तानी क्रिकेट में नए बोर्ड का आगमन होगा तो उनका भी कॉन्ट्रेक्ट रद्द कर दिया जाएगा. यदि आपको विदेशी कोच नहीं मिल रहें तो आपको पाकिस्तान के पूर्व दिग्गजों को ही कोच बनाना चाहिए.'न्यूज एजेंसी भाषा के अनुसार मिकी आर्थर ने पाकिस्तान के कोच का पद स्वीकार करने से इस कारण मना कर दिया कि वो इस समय डर्बीशर के साथ दीर्घकालिन अनुबंध के साथ जुड़े हैं जिसके कारण वो इस समय पाकिस्तान का कोच पद स्वीकार नहीं कर सकते हैं. पीसीबी ने एक बयान में कहा ,‘उनका डर्बीशर के साथ दीर्घकालिन अनुबंध है, हमने उनसे सलाहकार के तौर पर काम करने के लिये भी कहा लेकिन विभिन्न कारणों से यह संभव नहीं हो सका.' बोर्ड में एक उच्च पदस्थ सूत्र ने कहा कि आर्थर इसलिये नहीं आ रहे क्योंकि पाकिस्तान क्रिकेट के माहौल पर उन्हें भरोसा नहीं है'.सूत्र ने कहा ,‘असलियत यह है कि पीसीबी अध्यक्ष नजम सेठी ने जब उनसे बात की तो उन्होंने कहा कि वह फिर पाकिस्तान क्रिकेट के साथ काम करना चाहते हैं लेकिन अतीत में बोर्ड के साथ उनका अनुभव अच्छा नहीं रहा है.'उन्होंने कहा ,‘आर्थर ने सेठी से कहा कि विश्व कप 2019 के दौरान पीसीबी प्रबंधन ने उनसे कहा था कि उनका अनुबंध बढाया जायेगा लेकिन पाकिस्तान के सेमीफाइनल में पहुंचने के बावजूद ऐसा नहीं किया गया. आर्थर को यह भी आशंका थी कि पाकिस्तान क्रिकेट के माहौल को देखते हुए उनका अनुबंध स्थायी रहेगा या नहीं.' (भाषा के इनपुट के साथ)ये भी पढ़े- Babar Azam: बाबर को लेकर अज़रुद्दीन ने कह दी बड़ी बात, जानकर चौक जायेंगे आपIND vs NZ 1st ODI: न्यूजीलैंड के खिलाफ भारत के संभावित 11, मध्यक्रम में खेल सकते हैं ईशान किशनस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-01-18 05:49:15","image_url":"https://c.ndtvimg.com/2020-01/rqfrs9l8_wasim-akram-afp_650x400_09_January_20.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"BBC sorry for pornographic noises heard during cup coverage","link":"https://www.manilatimes.net/2023/01/18/sports/bbc-sorry-for-pornographic-noises-heard-during-cup-coverage/1874800","keywords":["Sports"],"creator":["Associated Press"],"video_url":null,"description":"LONDON: The BBC has apologized after pornographic noises were played on air during the broadcaster's live coverage of an FA Cup match, apparently via a mobile phone that a prankster had hidden in the studio.The noises interrupted the coverage presented by former England striker Gary Lineker before the match between Wolverhampton and Liverpool at Molineux Stadium on Tuesday.Lineker later posted on Twitter a picture of a cell phone that he said was \"taped to the back of the set\" inside the stadium.\"As sabotage goes it was quite amusing,\" Lineker said.The BBC appeared to be less amused, and issued a statement saying: \"We apologize to any viewers offended during the live coverage of the football this evening.\"A self-ascribed YouTube prankster, who calls himself \"Jarvo,\" tweeted that he was behind the stunt, and posted a video showing him calling the phone to activate the sounds.Jarvo, whose real name is Daniel Jarvis, was banned in October from all sporting events in England and Wales for two years after running onto the pitch during a cricket test match between England and India in September 2021 and barging into England batter Jonny Bairstow.","content":null,"pubDate":"2023-01-18 05:34:54","image_url":"https://www.manilatimes.net/manilatimes/uploads/images/2023/01/18/148644.jpeg","source_id":"manilatimes","country":["philippines"],"category":["sports"],"language":"english"},{"title":"It’s an abuse to domestic cricket: Venkatesh Prasad takes aim at selectors for ignoring Sarfaraz","link":"https://sportstar.thehindu.com/cricket/venkatesh-prasad-slams-selectors-for-not-selecting-in-form-sarfaraz-khan-for-test-series-vs-australia/article66395840.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"Sarfaraz, who represents Mumbai, is a prolific run-getter in domestic cricket. On Tuesday, he scored another century - against Delhi in a Ranji Trophy Group B match, making it the batter’s 13th first-class ton.","content":null,"pubDate":"2023-01-18 05:31:06","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"'Abuse to domestic cricket': Prasad lambasts BCCI for ignoring Sarfaraz","link":"https://timesofindia.indiatimes.com/sports/cricket/news/unfair-and-an-abuse-to-domestic-cricket-venkatesh-prasad-lambasts-bcci-selectors-for-ignoring-sarfaraz-khan/articleshow/97080225.cms","keywords":null,"creator":null,"video_url":null,"description":"Former India pacer Venkatesh Prasad called in-form Sarfaraz Khan's exclusion from the Indian Test team as 'unfair' and lambasted the BCCI and the national selectors for ignoring the domestic run machine.","content":null,"pubDate":"2023-01-18 05:30:53","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"OPINION: New Proteas coaches have ability to get best out of SA talent","link":"https://www.citizen.co.za/sport/cricket/opinion-new-proteas-coaches-sa-talent/","keywords":["Cricket","Premium","aiden markram","CSA","proteas cricket team","South African cricket team","Tabraiz Shamsi"],"creator":["Ken Borland"],"video_url":null,"description":"The coaching strengths of Shukri Conrad and Rob Walter lie in the realm of getting between the ears of their players and giving them confidence and the skills to execute their own unique abilities.","content":"There is a video online of our national broadcaster analysing the appointments of Shukri Conrad and Rob Walter as the new Proteas head coaches for red-ball and white-ball cricket respectively, and the presenter gets both of their names wrong through the programme, an embarrassing lapse but one which perhaps speaks to them not being that well-known among the South African public. But both are held in high esteem in local cricket circles for their shrewd knowledge of the game. Conrad and Walter Walter was a very good club cricketer who became the strength and conditioning coach of the Proteas, while...","pubDate":"2023-01-18 05:25:16","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/01/Proteas-Rob-Walter-1.jpg","source_id":"citizen","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Northland athletes in running for country’s top sporting honours at Halberg Awards","link":"https://www.newstalkzb.co.nz/news/sport/northland-athletes-in-running-for-country-s-top-sporting-honours-at-halberg-awards/","keywords":null,"creator":null,"video_url":null,"description":"Four Northland athletes are among the finalists in the 60th Halberg Awards - the country’s top sporting awards. The awards recognise New Zealand’s top sporting achievements of the past year, with 30 finalists over six categories. The Women’s Rugby World Cup-winning Black Ferns, which featured three Northlanders - Portia Woodman, Krystal Murray and Arihiana Marino-Tauhinu - is a finalist in the ISPS Handa Team of the Year, while Cameron Leslie is a finalist in the ISPS Handa Para Athlete/Para Team of the Year category. Woodman is also a finalist in the High Performance Sport New Zealand Sportswoman of the Year category. Northlander Krystal Murray, in for a try during the Women’s Rugby World Cup 2021 final between New Zealand and England played at Eden Park in November. Murray is a member of the Black Ferns squad that is a finalist in the Halberg Awards The Halberg Foundation has announced 30 finalists over six categories for the 60th ISPS Handa Halberg Awards. Leslie is the S4 100m Freestyle World Champion. The awards’ judges – comprising former elite athletes and coaches, sports administrators, and current sports media – selected the finalists from 76 nominations received from national sports organisations and an independent nominations board for achievements in 2022. Northland Black Fern Arihiana Marino-Tauhinu is among the squad that is a finalist in the Halberg Awards. Marino-Tauhinu captained the Black Ferns in the game against Scotland at Northland Events Centre. The event will be both a significant milestone of achievement and one of reflection and remembrance as the first Halberg Awards ceremony since the passing of the man whose name adorns this occasion. The late Sir Murray Halberg (ONZ) re-established the awards in 1963 to honour and celebrate sporting excellence, and most importantly, the occasion formed the major fundraiser for the Halberg Foundation. Sir Murray established the charity, which aims to enhance the lives of physically disabled young New Zealanders by enabling them to participate in sport and recreation. The finalists in the Para Athlete/Para Team, Sportswoman, Sportsman and Team categories will be eligible for the supreme Halberg Award, which is the country’s highest accolade for sporting excellence. The winners will be announced at the 60th ISPS Handa Halberg Awards ceremony at Spark Arena, Auckland on Wednesday, 15 February 2023, and broadcast live on Sky Sport and through free-to-air services on Prime TV from 8:30pm. For more information, visit: www.halbergawards.co.nz. Northland Para-athlete Cameron Leslie is a finalist in the 60th Halberg Awards. Full list of nominations for the 60th ISPS Handa Halberg Awards ISPS Handa Sportsman on the Year (eligible for Supreme Halberg Award) Aaron Gate (cycling - track), Ajaz Patel (cricket), Ardie Savea (rugby), Brendon Hartley (motorsport), Dylan Schmidt (gymnastics - trampoline), Fergus Jenkins (mixed martial arts), Hamish Kerr (athletics - high jump), Hayden Wilde (triathlon), James McDonald (horse racing), Jamie Reid (golf), Joey Manu (rugby league), Jordan Parry (rowing), Lewis Clareburt (swimming), Marko Stamenic (football), Nico Porteous (freeskiing), Paul Coll (squash), Ryan Fox (golf), Sam Gaze (cycling – mountain bike), Shane van Gisbergen (motorsport), Steve Alker (golf), Tim Price (equestrian), Tom Walsh (athletics – shot put). ISPS Handa Para Athlete/Para team of the Year (eligible for supreme Halberg Award) Adam Hall (Para skiing), Anna Taylor (Para cycling), Cameron Leslie (Para swimming), Corey Peters (Para skiing), Devon Briggs (Para cycling), Eltje Malzbender (Para cycling), Holly Robinson (Para athletics – javelin), Lisa Adams (athletics), Nicole Murray (Para cycling), Rachel Maia (Para sport climbing), Scott Martlew (Para sprint kayak), Dame Sophie Pascoe (Para swimming), Wheel Blacks (wheelchair rugby). High Performance Sport New Zealand Sportswoman of the Year (eligible for supreme Halberg Award) Bronwyn Dibb (gymnastics – mini trampoline), Bryony Botha (cycling – track), Ellesse Andrews (cycling – track), Emma Twigg (rowing), Jess Hotter (skiing - freeride), Joelle King (squash), Jonelle Price (equestrian), Dame Lisa Carrington (sprint kayak), Lydia Ko (golf), Niamh Fisher-Black (cycling - road), Portia Woodman (rugby), Raecene McGregor (rugby league), Ruahei Demant (rugby), Tayla Bruce (lawn bowls), Theresa Fitzpatrick (rugby), Zoi Sadowski-Synnott (skiing- snowboard). ISPS Handa Team of the Year (eligible for supreme Halberg Award) Black Ferns (rugby), Joelle King and Amanda Landers-Murphy (squash – women’s doubles), Joelle King and Paul Coll (squash – mixed doubles), Kerri Williams and Grace Prendergast (rowing - pair), Matthew Walker, Edward Masters and Charles Murray (cycling – mountain bike enduro team), New Zealand Eventing Team (equestrian). Buddle Findlay Coach of the Year Ben Adams (Para skiing), Craig Palmer (cycling – men’s endurance track), Gary Hollywood (swimming), Gordon Walking (sprint kayak), Matt Toa (mixed martial arts), Mike Rodger (rowing), Sean Thompson (skiing - snowboarding), Thomas Onley (Para swimming), Tommy Pyatt (skiing - freeskiing), Wayne Smith (rugby). Sky Sport Emerging Talent Ben Westenberg (Para cycling), Cameron Gray (swimming), Gustav Legnavsky (skiing - freeski halfpipe), Jenna Hastings (cycling – downhill mountain bike), Jocelyn Hong (figure skating), Joshua Willmer (swimming), Ruby Andrews (skiing - freeskiing), Tepenisa Havea (athletics – shot/discus), Tara Vaughan (sprint kayak).","content":null,"pubDate":"2023-01-18 04:46:32","image_url":"https://www.newstalkzb.co.nz/media/ff1fv2b4/black-ferns-legend-portia-woodman.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"India ODIs: Uphill task for NZ without Boult, Southee","link":"https://www.sentinelassam.com/sports/cricket/india-odis-uphill-task-for-nz-without-boult-southee-633525","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Zealand go into the India ODIs after a memorable 2-1 series win in Pakistan.","content":"HYDERABAD: Experienced pacers Tim Southee and Trent Boult's absence leaves a \"massive hole\" in the New Zealand squad, but also provides a chance to fringe players to step up during the India tour, says stand-in-captain Tom Latham. While Southee has gone back home after a successful tour of Pakistan, Boult is playing the ILT20 in the UAE, having opted out of a New Zealand central contract. In the batting department, the Kiwis will miss the services of regular skipper Kane Williamson. \"They (Boult, Southee, Williamson) are not in the side and that leaves a massive hole for us. On the other hand, it presents an opportunity for other guys who have been around the squad. Everyone has played international cricket in the squad which is a bonus,\" added Latham during the pre-match press conference. \"It is their turn to step up. Lucky we have Lockie Ferguson, who has played a lot of cricket in India.\" Also Read: U19 Women's T20 World Cup: India Call In Yashasri As Replacement For Injured Hurley GalaAlso Watch: ","pubDate":"2023-01-18 04:42:28","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/18/431101-17ferguson.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB decides to separate Women's League from PSL","link":"https://www.thenews.com.pk/print/1031726-pcb-decides-to-separate-women-s-league-from-psl","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The management committee of the Pakistan Cricket Board , led by Najam Sethi, has decided to separate the Women’s League from the upcoming Pakistan Super League.The PCB has allocated the window of September this year for the first Women’s Super League, which will be held as a...","content":null,"pubDate":"2023-01-18 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB wants ACC board meeting to finalise Asia Cup details","link":"https://www.thenews.com.pk/print/1031717-pcb-wants-acc-board-meeting-to-finalise-asia-cup-details","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Pakistan Cricket Board has called for convening an urgent meeting of the Asian Cricket Council Board at the earliest and not later than February 2023 to discuss the formalities involved in the Asia Cup to be hosted by Pakistan in September.A source within the PCB has told...","content":null,"pubDate":"2023-01-18 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"}]}