{"newsArray":[{"title":"England look to talismanic captain Ben Stokes as Australia fume over Starc 'catch'","link":"https://www.dailymail.co.uk/sport/cricket/article-12254859/England-look-talismanic-captain-Ben-Stokes-Australia-fume-Starc-catch.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AND DAVID COVERDALE AT LORD'S: The hosts closed the fourth day of the second Test on 114 for four, needing an England record 371 to win.","content":"We need another miracle, Ben! England look to talismanic captain Stokes... as Glenn McGrath brands decision to overturn Mitchell Starc's 'catch' a 'DISGRACE' England's hopes received a battering from Starc and Cummins in superb form NASSER HUSSAIN: England must learn that entertainment follows winning OLIVER HOLT: Defeat may be looming, but if there's Ben Stokes, there's hope By Aadam Patel and David Coverdale For The Mail On Sunday Published: 22:31, 1 July 2023 | Updated: 00:53, 2 July 2023 e-mail 6 View comments England are praying for another Ben Stokes miracle at Lord’s on Sunday - four years after his Headingley heroics . The hosts closed the fourth day of the second Test on 114 for four, needing an England record 371 to win and stop Australia going 2-0 up, with captain Stokes unbeaten on 29. England had been left reeling on 45 for four by Australia’s quicks before Stokes and Ben Duckett guided them to stumps, with Duckett controversially recalled late on after the umpires adjudged that Mitchell Starc had grounded a boundary catch. Former Australia fast bowler Glenn McGrath branded the decision ‘a disgrace’ . In the third Ashes Test at Headingley in 2019, England entered the decisive day on 153 for three with Stokes at the crease - and he went on to score 135 as they famously chased 359 to win by one wicket. Ben Stokes will lead England's almighty fightback from the crease after a crazy fourth day Mitchell Starc's 'catch' to get out Ben Duckett was sensationally overturned by third umpire ‘There is always hope when Ben is there,’ said England batting coach Marcus Trescothick. ‘If we can get a good start and someone can get a big score, we will definitely be challenging to knock this score off.’ Controversy around Duckett’s recall added late drama. Starc caught a top edge but scraped the ball along the ground as he landed. But Australia legend McGrath blasted: ‘That is the biggest load of rubbish that I’ve ever seen. If that’s not out, every catch I’ve ever seen taken should not be out. ‘That is a disgrace. I’ve seen everything. That is ridiculous. If that’s England taking that catch, that is out!’ Asked about Duckett’s late reprieve, Trescothick compared the impact of technology in cricket to VAR. ‘It’s the same situation with VAR in football, which we all know is a difficult one,’ he said. ‘It’s understanding the rules and seeing a different part to it. ‘At the time, you see the clean catch and it looks ok and there’s no issue but then you put the technology on and you see the ball along the floor and you start to question it. It’s part of the game. We know technology is there. Let’s trust in the process.’ After stumps, the umpire team were swarmed by the visitors as boos rang out across Lord's Duckett - who reached a half-century just before the controversy - had to wait on the field for the decision to be made Law 33.3 states that ‘the act of making a catch shall start from the time when the ball first comes into contact with a fielder’s person and shall end when a fielder obtains complete control over both the ball and his/her own movement’. Trescothick insisted that despite losing four wickets in the final session, the England dressing room still believes. ‘We know the history don’t we? We’ve talked about it many times. Headingley and other occasions where he’s (Ben’s) been the stalwart of the innings and holding it together,’ said Trescothick. ‘So while Ben Stokes is there, us in the England changing room along with the rest of guys like Jonny Bairstow, Ben Duckett and the tailenders know that we’ve still got a chance.’ West Indies will not feature in a World Cup for the first time after Scotland stunned the two-time champions with a seven-wicket win in a qualifying Super Six contest in Harare yesterday. Share or comment on this article: England look to talismanic captain Ben Stokes as Australia fume over Starc 'catch' e-mail Add comment Comments 6 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 23:52:17","image_url":"https://i.dailymail.co.uk/1s/2023/07/02/00/72753587-0-image-a-38_1688252971155.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australia Women beat England by four-wickets as Beth Mooney puts on a masterclass at Edgbaston","link":"https://www.dailymail.co.uk/sport/cricket/article-12254975/Australia-Women-beat-England-four-wickets-Beth-Mooney-puts-masterclass-Edgbaston.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"HENRY CLARK AT EDGBASTON: Beth Mooney led from the front with 61* to guide Australia to a four-wicket win in the first of three T20 matches. The result leaves her side 6-0 up in the series.","content":"Beth Mooney masterclass guides Australia to a four-wicket win against England and put the tourists 6-0 up in the Women's Ashes as they move to within one win of retaining the urn Australia beat England by four wickets in a thriller at Edgbaston on Saturday Beth Mooney was the star scoring an unbeaten 61 in the first of three T20 games It means Australia are now just one win away from retaining the Women's Ashes By Henry Clark For The Mail On Sunday Published: 23:29, 1 July 2023 | Updated: 23:38, 1 July 2023 e-mail View comments On a night they desperately needed to deliver to keep their hopes of winning the women’s Ashes truly alive, England gave it their all. But against this all-conquering Australia side, sometimes even that is not enough and so it proved in a final over thriller at Edgbaston. Beth Mooney led from the front with 61* to guide Australia to a four-wicket win in the first of three Twenty20 matches. The result leaves her side 6-0 up in the series and just one win away from retaining the urn. ‘When you’re involved in any game like that it’s a bit harder to take, being so close,’ said England’s Amy Jones. ‘But there’s definitely positives. It was exciting and there were lots of people there to see which was a great feeling.’ It was always going to be an uphill battle for England after losing the Test match opener of the series. They battled hard here but the reigning Twenty20 World Champions weathered the storm of a 20,000-strong Edgbaston crowd and kept their composure to prove why they are the best white ball team around. Beth Mooney hit 61 not out to guide Australia to a four-wicket win against England at Edgbaston Heather Knight (left) and her side are now 6-0 down in the Women's Ashes series having lost the first of their three T20 matches It means that Australia are now one win away from retaining the urn, with England struggling during their first innings Regular wickets stunted England’s innings and had it not been for opener Sophia Dunkley’s 56 and Jones’ impressive late hand of 40* then things could have been a lot more straightforward for the tourists. England threatened to make the chase interesting with a flurry of late wickets but ultimately Mooney’s class told and she was there at the end as the tourists crossed the finish line with one ball to spare. ‘We were really happy [with our score],’ said Jones. ‘But Mooney batted really well and to have a batter bat the whole way through, you give yourself the best chance of winning. She was probably the difference.’ It was a power play full of drama after England were sent into bat. In the second over Danni Wyatt was beaten all ends up by Darcie Brown’s away swinger but the ball only shaved the top of off stump and failed to dislodge the bails. Her reprieve didn’t last long though. In the next over, Australian seamer Megan Schutt (2-33) knocked Wyatt’s (7) off stump out the ground. No doubt about that one. Alice Capsey was next to go, run out by Brown off her own bowling for three when replays showed she failed to ground her bat. With wickets falling around her, Dunkley had to reign in her attacking style but still made her runs at better than a run of ball. She is unlikely to be the cover star of the MCC coaching manual but Dunkley proved once again how effective her unorthodox shot-making can be. England’s innings threatened to descend into disarray when Dunkley was caught on the boundary before a further two wickets fell for only three runs. Sophia Dunkley topped the scores hitting a very well taken 56 runs off 49 balls to help keep England's score ticking over But Mooney was the star of the show anchoring the Australian run chase with England unable to remove her Sophie Ecclestone (pictured) took two wickets during the match dismissing Tahlia McGrath for 40 But up stepped Jones who led a late charge that included taking 13 runs off the final over. Jess Jonassen was the pick of the bowlers, picking up three wickets with her spin. England’s total always looked light on a good pitch at Edgbaston and so it proved. Lauren Bell got them off to the perfect start after dismissing Alyssa Healy for five. Debutant Danielle Gibson was equally as impressive with the ball but Tahlia McGrath’s effortless 40 from 29 balls helped to steady the ship. She fell to a brilliant piece of bowling by spinner Sophie Ecclestone (2-24) but once Australia got the required rate to a little over a run-a-ball, the final result never really seemed in doubt. A late flurry of wickets made things interesting but came too little, too late for the hosts. Share or comment on this article: Australia Women beat England by four-wickets as Beth Mooney puts on a masterclass at Edgbaston e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:31:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752807-0-image-a-51_1688249913005.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, and Josh Tongue gets high-profile bunny","link":"https://www.dailymail.co.uk/sport/cricket/article-12254937/THE-ASHES-NOTEBOOK-royal-reception-Ben-Stokes-Josh-Tongue-gets-high-profile-bunny.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"ASHES NOTEBOOK: England have hardly put on a royal performance at Lord's, but that did not stop Prince William and Prince George from enjoying the action yesterday afternoon.","content":"THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, Josh Tongue gets a high-profile bunny and Lord's sees a record 160,000 fans pass through their famous gates England had hopes of a fightback dented by Mitchell Starc and Pat Cummins OLIVER HOLT: England's fortunes look dismal, but if there's Stokes, there's hope NASSER HUSSAIN: England should know that winning Test brings entertainment By David Coverdale For The Mail On Sunday Published: 18:20 EDT, 1 July 2023 | Updated: 19:08 EDT, 1 July 2023 e-mail 1 View comments The fourth day of the second Test of the Ashes series was by no means short on drama, sparing a few mundane interludes . England halted Australia 's prodigious run rate by using one of their most lethal weapons against them and serving up a spell of non-stop short-pitched bowling to dispatch Australia for 279 before a slightly delayed tea. But as Ben Stokes ' side set about preparing for a near-historic chase of 371, their top order was set upon by Mitchell Starc and Pat Cummins in superb form. In one indomitable over, the Australian captain dismissed both Joe Root and Harry Brook, but the visitors were unable to get out Ben Duckett just before stumps after Starc's 'catch' was overturned in controversial fashion . Here, Mail Sport's DAVID COVERDALE takes you through some of the stories you might have missed from a gripping Saturday at Lord's. ECB chair Richard Johnson (left) hosted Prince William and Prince George in Lord's hospitality Prime Minister Rishi Sunak (centre) also took in the day and made an appearance on TMS England have hardly put on a royal performance at Lord’s, but that did not stop Prince William and Prince George from enjoying the action yesterday afternoon. The future king sat next to his son and ECB chair Richard Thompson in a hospitality box at the Home of Cricket, with George spotted tucking into a pizza. Prime Minister Rishi Sunak was also in attendance and seen sharing a laugh with the princes, shortly after he had joined Jonathan Agnew for a lunchtime interview on Test Match Special, in which he voiced his approval of Bazball. ‘How could you not fall in love with it and fall in love all over again with the English cricket team after what they did last year?’ said the PM. ‘You’ve got to give it to the team for what they have done.’ Sunak also revealed he used to have secret evening net sessions at The Oval during his time as Chancellor - and that he spent the 2005 Ashes betting on the action. ‘It was around that time spread betting became a thing online,’ he said. ‘I was [betting on] next wicket to fall, innings total, which was quite dangerous.’ If two princes and a Prime Minister were not enough, there was also a lord at Lord’s. England Ashes hero Ian Botham - who was made a life peer in 2020 - attended his first day of the series, and used it to promote his wine brand on social media from the stands. Ian Botham took advantage of the storied setting to plug his wine brand Botham Wines ‘England are not going so well at the moment, but what is going well is the Botham Pinot,’ said Baron Botham, 67, who left his Sky Sports commentary role after the last home Ashes series in 2019. ‘The wine definitely is on top.’ The former England captain was in the news earlier in the week after it emerged he is auctioning off more than 240 souvenirs from his illustrious career If Stuart Broad has the wood over David Warner, it seems Test debutant Josh Tongue might well have a bunny in Steve Smith. The Worcestershire seamer was the first English bowler to dismiss Smith this summer when he trapped him lbw in a County Championship match against Sussex. Josh Tongue gets his man once again, dismissing Steve Smith (right) for the third time And Tongue has removed the Australian star in both innings of this second Ashes Test - caught by Zak Crawley at deep backward square leg yesterday. Lord's will be a full house on Sunday as England attempt to pull off a record Ashes run chase. MCC announced on Saturday afternoon that they had sold all 32,000 tickets for day five, with tickets priced at just £25 for adults and £5 for Under-16s. There has been heavy criticism of the cost of adult tickets for the other four days here, the majority of which have been in excess of £100. Nevertheless, 160,000 fans have come through the gates over the course of this second Ashes Test, a record for the ground following the recent renovation of the Compton and Edrich Stands. MCC have also sold 16,000 tickets for Saturday’s third T20. Share or comment on this article: THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, and Josh Tongue gets high-profile bunny e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:20:34","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752513-0-image-a-32_1688249961541.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Todd Murphy is still a kid but he is capable of stepping in for injured Nathan Lyon","link":"https://www.dailymail.co.uk/sport/cricket/article-12254703/JASON-GILLESPIE-Todd-Murphy-kid-capable-stepping-injured-Nathan-Lyon.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: But looking ahead to the next Test at Headingley, we will see Todd Murphy come into the side - and Australia fans can be assured that he is the real deal.","content":"JASON GILLESPIE: Todd Murphy is still a kid but he is the real deal... the off-spinner doesn't have Nathan Lyon's 496 Test wickets but he is more than capable of stepping in for his injured team-mate Nathan Lyon attempted to bat at 11 a Australia were bowled out on Saturday Todd Murphy took seven wickets in his first ever innings of Test cricket in India Lyon receives a standing ovation from the Lord's crowd as he hobbles off By Jason Gillespie For The Mail On Sunday Published: 21:26, 1 July 2023 | Updated: 23:13, 1 July 2023 e-mail View comments Nathan Lyon looks unlikely to play again in this series and losing a spinner who has taken 496 Test wickets is obviously a massive blow for Australia. What that means going into day five of this match is that they will have to bowl without a frontline spinner, which gives England a fighting chance. But looking ahead to the next Test at Headingley, we will see Todd Murphy come into the side - and Australia fans can be assured that he is the real deal. He has already shown that he is more than capable of performing at this level. He got seven wickets in the first innings of his Test debut in India and he was excellent. At 22 years old, he is still a kid. He is a bit wet behind the ears in first-class experience, let alone international experience. He played his age-group cricket as a batsman and only developed as a spinner in the last five years, so he has had quite a rise. But there have been a lot of very good judges around Australia, particularly in Victoria, who have been talking him up as a quality option for quite some time. Todd Murphy is more than capable of filling in for his injured team-mate at Headingley Nathan Lyon received a standing ovation at Lord's after coming out to bat Despite suffering a significant calf injury, Lyon walked out to face the England attack I have seen him up close playing in the Sheffield Shield against my South Australia side and you can tell he has got an old head on young shoulders. He is picking up things so fast. On the last couple of tours, he has had Nathan with him the whole time and there is no better bowler for him to learn from. He’s also got Daniel Vettori as an assistant coach of Australia, who will have acted as another mentor. He is a slightly different bowler to Nathan. Whereas Nathan relies more on over spin and bounce, Todd uses more side spin and looks to give it a rip. I am gutted for Nathan because this was his 100th consecutive Test and he could have got his 500th Test wicket. He has shown such resilience in his career, as we all saw with the way he came out to bat in Australia’s second innings, despite his significant calf injury. Nathan is far from finished and I am sure he will return as Australia’s No1 spinner as soon as he is back fit. But this gives Todd another taste of international cricket and he will do a fine job for Australia going forward. He won’t be overawed. If the surface is the same in Leeds as it has been at Lord’s, we can also expect to see more short-pitch bowling from the seamers. Both teams have heavily resorted to that tactic here because they have identified that this surface offers next to nothing for the fast bowlers. In England’s first innings, Australia were in the last-chance saloon when Nathan went down and that was the only plan they had left. England were absolutely flying but they then gifted them wickets. Yes, I know they want to play positively, but if they had just absorbed some of that bowling, Australia would have to have changed tack. Instead, they allowed their opponents back into the game. Murphy has had Lyon with him on a number of previous tours to act as something of a mentor The off-spinner took seven wickets in his first innings of Test cricket against India Australia also fell for the same trap on Saturday and I am not sure either team have quite got their tactics right yet. One point of difference for Australia, though, has been the speed of their bowlers. I have been impressed with Josh Tongue for England. He has got that extra yard of pace on Jimmy Anderson, Stuart Broad and Ollie Robinson, who are all very similar. But the Aussie quicks are by and large quicker than the English seamers, in particular Mitchell Starc. I said at the time I would have played him at Edgbaston and he would have been well suited to that surface. But they were right to select him over Scott Boland for this Test and his dismissals of Zak Crawley and Ollie Pope last night proved just what a difference he can make. Share or comment on this article: JASON GILLESPIE: Todd Murphy is still a kid but he is capable of stepping in for injured Nathan Lyon e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:13:55","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752707-0-image-a-30_1688249627210.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us","link":"https://www.dailymail.co.uk/sport/cricket/article-12254911/STUART-BROAD-opinions-dressing-rooms-inner-sanctum-matter-us.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"STUART BROAD: A couple of our players are going have to play out of their skins today but we've seen that anything's possible and so we won't stop believing that we can level this Ashes series.","content":"STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us. We have to stick to our principles Stuart Broad insists that anything is possible with this current England squad Broad was forced to spend Friday evening in hospital after being hit in the face Re-live all the drama from day four at Lord's with England trailing by 257 runs By Stuart Broad for the Mail on Sunday Published: 22:30 BST, 1 July 2023 | Updated: 22:52 BST, 1 July 2023 e-mail View comments A couple of our players are going have to play out of their skins today but we've seen with this England team that anything's possible and so we won’t stop believing that we can level this Ashes series. This team has four of England's eight highest fourth-innings run chases, and although we have not played as well against Australia this week as we would have liked there’s still a chance of making it 1-1. At Leeds last year against New Zealand, we were 55 for six in the first innings - 274 runs behind - yet still managed to chase 300 to win, just three wickets down. Saturday was a really good fighting day from the bowlers and we just had to try to eke out with the old ball as much as we could. We obviously had a clear plan of bowling bouncers and getting those eight wickets for 92 runs was reward for fully committing to that plan. The key to bowling is bowling the ball that suits your field. And I think we all did that. The key to bowling is bowling the ball that suits your field. And I think we all did that on Saturday Among England’s highest ever fourth-innings chases, this team has got three of them Saturday was a really good fighting day from the bowlers and we just had to try to eke out with the old ball everything we could One of the things that we stay strong about in the changing room is sticking with our beliefs. Only the opinions of the dressing room’s inner sanctum matter in terms of how we play and we have enough credit in the bank from what we have done over the past 14 months to know that this style of attacking cricket works for us. It worked for us at Edgbaston because we won pretty much every session there apart from the last one on the final day. We were ahead of the game but Australia got over the line. Ultimately, things didn’t go as we would like over the first three days here but there wer some interesting statistics that Alastair Cook mentioned to me about our performance with the ball on the opening day — although we received criticism from outside the team environment, that criticism was purely based upon the result rather than the process. Fact is we hit our 12th best line and length in the first innings of a match since 2007 — something like 54 innings. We went past the outside edge of the bat 30 times and experienced something similar on day three. You have to stick true to your principles and not base your reflections purely on outcomes. Yes, we were disappointed with Friday morning’s session when we lost six quick wickets for 47 runs, that goes without saying, but ultimately we have formed a mindset of attack — sometimes it will work, sometimes it won’t. The dismissals might not have been conventional ones for Test cricket but you can’t clap when Harry Brook gets 150 on a green pitch versus New Zealand at Wellington and then cry on another occasion when he gets caught in the outfield. Sometimes it can look ugly but it’s a process we believe in and one that works for us. This Lord’s pitch hasn’t been the easiest to whack the ball on but batting tends to get easier, so let’s hope that continues. Fact is we hit our 12th best line and length in the first innings of a match since 2007 — something like 54 innings Yes, we were disappointed with Friday morning’s session when we lost six quick wickets for 47 runs People might have got a bit giddy when we won the toss but there are some of the best fast bowlers in the world across these two Ashes teams, and look how few slip catches there have been so far. That tells you all you need to know about the conditions we have operated in. If you can’t create slip chances, you don’t bowl a team out cheaply. In the second innings, we had to be creative and turn exclusively to short balls. But at some stage we will get circumstances that the fast bowlers will like. On the third day, it felt like old school Lord’s because the ball swung but it wasn’t the dream scenario to bowl because the pitch was very slow. Yes, we dropped a couple of chances early which might have made a difference but anyone that thought we should be bowling Australia out for 160 were being overly optimistic. It was more 320 kind of conditions. I was a bit frustrated that I spent Friday evening on a two-hour hospital visit after being struck by a Cameron Green delivery. It was the last ball of the over and I lost sight of it a little bit. Unfortunately, it caught me under the grille and struck me in the neck, going up into my jaw. It was sore. I wasn’t too concerned about getting an X-ray until the end of the match because I was going to bowl regardless of whether I had a break, but the team doctor Glen Rae was slightly concerned about the swelling and the chance of a bleed in the artery. It was worthwhile getting the all clear. I was also disappointed because I have bowled much worse than I did and ended up with more wickets. I should have had one of course when we should have reviewed the Marnus Labuschagne LBW. I was a bit frustrated that I spent Friday evening with a hospital visit after being struck by a Cameron Green delivery To be honest, the ball before tea which was shown to be going down leg side stuffed us, really. After that, I made a decision to get tighter into the stumps and so when I struck him on the pad again I knew it was out. I just couldn’t get others to believe me. Very rarely do we go for it if it is just one person thinking it’s out. Thankfully it didn’t hurt us too much because Marnus chipped one to point soon afterwards. Mitchell Starc had a catch controversially overturned by Marais Erasmus late on Saturday night The third umpire Marais Erasmus was called into action late on Saturday night, of course, when he reprieved Ben Duckett for a catch by Mitchell Starc that clearly involved the ball being floored. Ultimately, from my understanding of the rule, the ball isn’t allowed to hit the ground. We’ve all played cricket where a catch is attempted with your hands facing upwards and your elbow hits the ground and the ball pops out. But if you catch the ball and turn your hands and grind the ball on the ground, the ball can’t pop out of your hand. If that was a legal way of catching, we’d all be doing it. Share or comment on this article: STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:52:22","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/22/72752481-0-image-a-23_1688248336596.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England beaten in dramatic T20 opener as Australia tighten grip on Women’s Ashes","link":"https://www.watfordobserver.co.uk/sport/national/23627538.england-beaten-dramatic-t20-opener-australia-tighten-grip-womens-ashes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Georgia Wareham scrambled the winning single off the penultimate ball.","content":"Australia were cruising on 130 for two before stumbling to 140 for five and while they needed just a single off the last five balls, a four-wicket victory was not secured until the penultimate delivery. Beth Mooney’s 61 not out off 47 balls, plus cameos from Tahlia McGrath (40 off 29) and Ashleigh Gardner (31 off 23), underpinned the successful chase as England fell 6-0 down in the multi-format series with 10 points to play for. We take a narrow defeat at Edgbaston. Despite the result, what a night with 20,000 people watching us and bringing the atmosphere! 👏 — England Cricket (@englandcricket) Having also been beaten in the lone Test, England face having to win all five remaining matches – two T20s and three ODIs – to win the series against a side who are world champions in both formats. Lauren Bell, Sophie Ecclestone and Sarah Glenn each took a couple of wickets to take this match to the wire, but Georgia Wareham was able to scramble a single after punching to cover to get Australia home. Sophia Dunkley had earlier top-scored with 56 off 49 balls in England’s 153 for seven, a total in which only three of the home side’s batters reached double figures, while they were grateful for Amy Jones’ unbeaten 40 off 21 balls having lost four wickets for 12 runs in front of a 19,527 attendance. The largest English audience for a women’s match outside of a World Cup watched the home side stumble out of the traps after they were asked to bat first. Danni Wyatt had her off stump uprooted by Megan Schutt in the over after the bails had stayed in their grooves despite Darcie Brown grazing the England opener’s stump. Brown had better luck in running out a bewildered Alice Capsey, with third umpire Russell Warren deeming her bat was not grounded over the line. Dunkley’s swipes across the line brought two fours off Gardner and one off Brown but after England had reached 50, Nat Sciver-Brunt slashed Jess Jonassen to deep midwicket. Heather Knight audaciously ramped her third ball for four before she deposited Wareham over the long-on boundary. Knight was timing the ball better than Dunkley, who nevertheless reached 50 off 42 balls before the England captain misread McGrath’s slower ball and slammed to long-on for 29. Dunkley was then deceived by pace off from Schutt as she sliced to short third and by the time the debuting Danielle Gibson and Ecclestone had perished to successive deliveries off Jonassen, England were in some strife, having slipped from 106 for three to 118 for seven. Amid the clatter of wickets, Jones overturned an lbw verdict against her on eight and was then dropped on 15 in the penultimate over by Wareham, who watched on helplessly as the next ball sailed over her head for six. Jones, shuffling laterally in her crease to offset first Schutt then Gardner, also cleared the ropes from the final ball of the innings as England took 31 off the last two overs. Lauren Bell snared Australia captain Alyssa Healy but Mooney started assertively and McGrath ignited the charge with five off-side fours in the space of nine balls towards the end of the powerplay, with two off Ecclestone then three from Gibson. Sarah Glenn was hammered over deep square-leg for six by McGrath, who was then stumped after advancing and missing a swing at Ecclestone to give England a lifeline just before halfway. But Mooney picked off the wayward Freya Davies with a drive then clip for successive fours while Gardner twice heaved handsomely over deep midwicket off Glenn as the Australia pair effortlessly chipped away at the total. Gardner swung once too often and under-edged to wicketkeeper Jones before Grace Harris dragged on to her stumps as Glenn had two in two. Ellyse Perry was castled by Bell’s slower ball in the penultimate over but Annabel Sutherland and Mooney thumped fours to leave five needed off the last six deliveries. Sutherland belted Ecclestone back over her head to tie the scores before two dots were followed by a nervous pull which caught the top-edge and looped to Jones. Wareham, though, held her nerve with a cut and run as she and Mooney claimed the single Australia needed to get over the line.","pubDate":"2023-07-01 21:32:58","image_url":"https://www.watfordobserver.co.uk/resources/images/16952651/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Aussie legend Glenn McGrath claims England 'get the best of the decisions' after overturned catch","link":"https://www.dailymail.co.uk/sport/cricket/article-12254895/Aussie-legend-Glenn-McGrath-claims-England-best-decisions-overturned-catch.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Glenn McGrath was left fuming by the controversial decision to overturn an England wicket late in the evening session of the second Ashes Test at Lord's on Saturday.","content":"Furious Aussie legend Glenn McGrath says controversial Mitchell Starc catch decision is a 'DISGRACE'... as he claims Ben Duckett's reprieve is the 'biggest load of rubbish I've ever seen' England were let off after reviews showed Mitchell Starc's catch was grounded The hosts will start day five of the second Ashes Test trailing by 257 runs We need another miracle, Ben! England look to talismanic captain in their crisis By Dominic Hogan For Mailonline Published: 22:21 BST, 1 July 2023 | Updated: 22:51 BST, 1 July 2023 e-mail View comments Glenn McGrath was left fuming by the controversial decision to overturn an England wicket late in the evening session of the second Ashes Test at Lord's on Saturday. England opener Ben Duckett was given out after somehow managing to edge a Cameron Green bouncer down to deep fine leg. Mitchell Starc - who had already picked up two wickets - steamed in to take the catch diving to his left, before appearing to ground the ball in the process. Although the catch seemed to have been taken, he allowed the ball to grind across the floor, with his fingers crucially not under the ball, leaving umpire Marais Erasmus with no choice but to over turn the decision. And McGrath - who has taken more Test wickets than any fast bowler aside from England duo James Anderson and Stuart Broad - was adamant that his old enemy were getting the rub of the green with the decisions. Australia were left fuming after Mitchell Starc's catch was overturned following a video review Marais Erasmus' review showed that the ball was grounded without Starc's fingers beneath it Ben Duckett was handed the reprieve after he was caught at deep fine leg off a Cameron Green bouncer 'If that's England taking that catch, that is out!' he said. 'England have the best of the conditions and now they are getting the best of the rules. That is the biggest load of rubbish that I've ever seen. 'If that's not out, every catch I've ever seen taken should not be out. That is a disgrace.' Following the decision, Starc could be heard also fuming, and confronting Duckett over the call, although the opener had no part in the decision. The Notts batter had already begun to leave the field before boos in the crowd suggested that there might be perceived foul play afoot. Stopping on his way back to the pavilion at the hint of a lifeline, he was eventually called back to the crease after Erasmus' review and remained there until stumps alongside his captain Ben Stokes. The reprieve came at a pivotal moment in the Test - and indeed the series - with England having lost their first four wickets after a breathtaking spell of bowling from both Starc and his captain, Pat Cummins. Having been bowled out for 279 in their second innings, Australia set England a target of 371 to win the second Test and tie the series, but the hosts made a hash of their chase early on. The Notts and England opener had already made his way to the boundary rope before being called back Pat Cummins (pictured) and Starc blew England's lower order away with a breathtaking spell of bowling England's best batter Joe Root - the highest run scorer of any active player - was out for 18 Duckett's opening partner Zak Crawley was caught behind off Starc, before the quick castled Ollie Pope, with Cummins removing the key wicket of Joe Root and then bowling Harry Brook for just four. Stokes then came in to steady the ship alongside Duckett, who will open the batting on Sunday morning on 50 after the pair's 69-run partnership guided the home side to 114 for four, 257 runs behind the old enemy. But the great Aussia swing bowler was not the only ex-Ashes legend to have been bemused by the decision, with former England batter Marcus Trescothick also suggesting it might have been a clean catch. 'I thought the catch had been taken cleanly, but I have no idea on the rules,' he said. 'We've seen different ones in this game and different decisions have been given. We needed a little bit of luck, hopefully it's a sign things are changing. 'Whatever happens now, it's going to be an exciting final day. We're still fairly upbeat, we're in a positive unit. We have good days and bad days. You enjoy it on a good day, but you don't get too down on a bad day. You take the rough with the smooth. 'Who knows? They never really got going, they didn't get scoring momentum, they probably wanted 400 or 450, with a lot more time to go. We managed to pick up wickets, restricted the runs, so pretty happy with that.' Share or comment on this article: Aussie legend Glenn McGrath claims England 'get the best of the decisions' after overturned catch e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:24:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/22/72750223-0-image-a-17_1688246488808.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"NASSER HUSSAIN: Winning Tests provides its own entertainment","link":"https://www.dailymail.co.uk/sport/cricket/article-12254779/NASSER-HUSSAIN-Winning-Tests-provides-entertainment.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"NASSER HUSSAIN: Spells of bouncers and individual short-pitched duels between fast bowlers and batters have always been part of the game but this was different.","content":"NASSER HUSSAIN: That non-stop short-pitch bowling was like nothing I've ever seen from England... it was incredibly dull at times but it worked and results matter more than entertainment 98 per cent of all deliveries in the middle session of the fourth day were short But England stopped Australia from making runs and took valuable wickets The remaining Tests will only see more short-pitched bowling from both sides By Nasser Hussain for the Daily Mail Published: 21:58, 1 July 2023 | Updated: 22:21, 1 July 2023 e-mail View comments That session of almost non-stop short-pitched bowling from England on Saturday afternoon was unlike anything I have ever seen before in Test cricket. Together with the morning it was an unbelievable passage of play. At times it was farcical. It was certainly surreal. Spells of bouncers and individual short-pitched duels between fast bowlers and batters have always been part of the game but this was different. Ninety eight per cent of all deliveries in the middle session of the fourth day at Lord’s were short and we went two hours before a single ball was pitched up. Not only did it lead to wickets for England but it also stopped the flow of runs for Australia and I liked the fact Ben Stokes and his side were so committed to the tactic. There was no doubt in their minds what they were intending to do. When every ball is going to be short most of the fielders can be placed square of the wicket and batters then have to either duck out of the way ball after ball, which takes bravery and discipline, or have a hook and a flap and risk losing your wicket, as England did too often in the first innings. England's short-pitched bowling may have been predictable but it helped England stem Australia's flow of wickets Ben Stokes joined in on the bowling barrage but he may have put his knee under heavy stress Nathan Lyon cut a heroic figure as he took to the field with a visible calf injury to bat last The fitness levels needed to put in a stint like that are extraordinary and Stuart Broad, Josh Tongue and Ben Stokes will be getting out of bed in instalments on Sunday. When Stokes became captain of this England side he said he would never ask anybody to do something he would not be prepared to do himself and he showed that again yesterday with that 12 over spell. He seemed to be hobbling by the end of his first over so to carry on the way he did was some effort. In the end he put himself out to deep square leg because he didn’t want to do any running. Not that the ball was ever going to be pushed past him at mid-off because there were never any balls pitched up. You do worry about the captain when you see him like that. You don’t want that knee to be so bad it affects his batting as well as his bowling because he cannot run. The last thing England need is for Stokes to put himself out of the series. Then to cap it all came the sight of Nathan Lyon coming out to bat barely being able to walk because of his calf injury and for a while, as Mike Atherton said on Sky, it was like a scene from the TV programme MASH. Batters on both sides will know what they are going to get now. There is going to be an awful lot more short-pitched bowling in the three remaining Ashes Tests. But whether the bowlers can do it to the same effect at Headingley, Old Trafford and the Oval remains to be seen because it could just be this slightly two-paced Lord’s pitch that has led to this. Certainly Manchester, for one, will be quicker and that means you can play your shots or get out of the way more easily. There was a contrast between the way the teams played that short ball. When you’re caught on the boundary, as so many of England’s batsmen were in the first innings, people can react with horror. But is it really different to fend it off trying to defend? The bottom line is it is about scoring runs and England will have to learn from the mistakes they have made here. I saw Harry Brook practising against the short ball in the nets yesterday morning and while he was then undone by a beauty from Pat Cummins he knows he is going to be peppered with men back for the rest of this Ashes. So, was England’s approach in the field contrary to their vow to entertain? Well, at times it was incredibly dull on Saturday because spectators knew what ball was going to be delivered and where the batters were going to hit it. It was a mundane policy, yes, but I liked it because it took a hell of a lot of effort and it was successful for England, at least until it was their turn to bat again. Josh Tongue has been dazzling in his Ashes debut and he could have a big future ahead of him Harry Brook may have been practicing for the short ball but he fell to a plum from Pat Cummins As I said before a ball was bowled in this Test, England have to think about winning. The entertainment factor follows on from that. Mark Waugh made a good point in Australia overnight. Entertainment is not just smashing the ball out of the ground. It can also be about what Atherton, for example, did to combat Allan Donald at Trent Bridge in 1998. We still talk about that duel now. England have it all to do now in this Ashes and they only have three or four days before they have to go again in the third Test at Headingley. But one positive they can take from this match whatever happens today is the performance of Tongue. He looks the part and was both hostile and skilful in that long spell yesterday. If he can stay fit he has a big future at this level. Share or comment on this article: NASSER HUSSAIN: Winning Tests provides its own entertainment e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:21:35","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/21/72750693-0-image-m-15_1688245039284.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘Lost one of my mates’: Emotional Lyon takes aim at Pietersen over concussion comments","link":"https://www.theage.com.au/sport/cricket/lost-one-of-my-mates-emotional-lyon-takes-aim-at-pietersen-over-concussion-comments-20230702-p5dl2q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"Nathan Lyon has been in tears knowing he will probably be ruled out of the Ashes, and he took exception to comments from Australia’s former Ashes foe Kevin Pietersen.","content":"Nathan Lyon has taken offence at former England batsman Kevin Pietersen’s suggestion the injured spinner could have been hit in the head while batting during the second Test so Australia could replace him with a concussion sub. “I have heard comments that people thought I went out there to get hit in the head, and I’m really against that because I’ve lost one of my mates due to being hit in the head,” Lyon said, referring to the tragic death of Phil Hughes almost a decade ago. “So I think that’s a really poor excuse or conversation being had.” Lyon, clearly in pain, attempts to run for a single. Credit: Getty Pietersen, one of Australia’s greatest Ashes foes during his career, floated the suggestion after Lyon hobbled out to bat on Saturday with a badly injured right calf that is likely to end his tour and open the door for fellow off-spinner Todd Murphy to make his debut. “Imagine if he [Lyon] had been hit on the head and got concussion, he’d have got a like-for-like replacement and a world class spinner Todd Murphy, based on how he performed in India, it gives food for thought,” Pietersen said on Sky sports. Hughes collapsed on the pitch after being struck in the neck by a short ball playing a Sheffield Shield match for South Australia against New South Wales at the SCG during November 2014 and died in hospital two days later. Lyon was clearly emotional during his press conference after play on Saturday where he discussed the implications of his injury and the likelihood of his tour being over. He was playing his 100th consecutive Test and needs four more wickets to reach the 500 wicket milestone. “It’s been a lot down more than up. I have been absolutely shattered. I have been in tears, I have been upset, I have been hurting,” he said. “That shows this team means everything to me. And I will start this rehab journey now to get back and play my role and keep loving what I am able to do. “I’ve got a decent tear in my right calf. It is pretty obvious. I am sitting down with our medical team tomorrow and we will have a chat about that. Pretty shattering, pretty gutted. Pretty speechless if I am being honest. But I have a lot of confidence in that changeroom and just thrilled to be part of this team. “This is just a little speed bump in the road. This isn’t career-defining. I am hungrier than ever to get back out there, especially when you see your teammates out there busting your guts this afternoon. It’s disappointing from my end and the guys will keep going on and we will go from there.” Lyon was forced to wait in the Long Room before going out to bat because it would have taken him too long to get to the crease if he’d had to make his way from the dressing room. “I would have been timed out,” he said. “The lifts here are pretty slow, so I had to go down the stairs. It was interesting being in the long room rather than the pavilion waiting to bat. It was like being in the zoo, a lot of eyes were on me watching what we were doing, what we were talking about. But I’ll do anything for this team,” he said. While he was there Lyon ended up having a conversation with Jimmy Anderson confirming the convivial nature of this otherwise hard-fought tour. “He asked me if I was stupid, I said yes. Then I just said to him, ‘I may have to do a you and go to 40 (years of age),’” Lyon said. “He said if you keep loving the game, and keep trying to get better, there’s no reason why you can’t. That was a nice little moment with Jimmy. I’ve got a lot of respect for what he’s done. He’s an incredible role model in world cricket for so many.” Lyon claimed it was his decision to bat despite being so badly injured. “I’ve been having conversations since it happened with our medical team,” he said. “I knew the risks. But the way I look at it, as I said before, I’ll do anything for this team. You never know how big a 15-run partnership can be in an Ashes series. I’m proud of myself for going out there and doing that, but if it’s tomorrow, I’ll do it again.” Watch every ball of the men’s and women’s Ashes series live and exclusive on Channel Nine and 9NOW","pubDate":"2023-07-01 21:07:41","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"I’d do it again and again and again – injured Nathan Lyon proud of batting cameo","link":"https://www.watfordobserver.co.uk/sport/national/23627528.--injured-nathan-lyon-proud-batting-cameo/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Nathan Lyon limped out to bat as Australia’s number 11 despite a significant calf tear.","content":"Lyon sustained a significant calf tear on the second day and has been on crutches since, but defied the pain to walk out as last man during Australia’s second innings on Saturday afternoon. Australia’s frontline spinner limped on to a standing ovation and bravely batted for 25 minutes in a 13-ball innings of four that saw the tourists move on from 264 for nine to 279 all out, which set England 371 to win. “I have been absolutely shattered, I have been in tears, upset and I have been hurting, but this team means everything for me,” Lyon reflected after England closed on 114 for four, still requiring 257 runs for a series-levelling victory. “Yes, I have been having conversations since it happened with our medical team and I knew the risk. But the way I look at it, I will do anything for this team and you never know how big a 15-run partnership can be in an Ashes series. “So, yes I am proud of myself for going out there and doing that. “If it was tomorrow, I would do it again and again and again because I love this team, I love playing for Australia.” Lyon was on crutches at the start of day four but in an extraordinary sequence of events in the afternoon session, he started to make his way through the pavilion down to the pitch when Pat Cummins was out to leave the tourists on 261 for eight in the 96th over. With the 35-year-old in major discomfort every time he walked, Lyon hopped down the stairs and waited in the long room at Lord’s until Josh Hazlewood’s dismissal brought him to the crease. 👏 . | — Lord's Cricket Ground (@HomeOfCricket) Before his courageous innings, Lyon encountered England veteran James Anderson, who was off the field at the time. Lyon added: “I have played against Jimmy for a long period of time now and I have a lot of respect for him. He asked, ‘Am I stupid? And I said, ‘Yes, but I may have to do a you and go to 40.’ “He said, ‘if you keep loving the game and keep trying to get better there is no reason why you can’t,’ so that was a nice little moment with Jimmy. “Regarding batting, I had to go down to the long room and wait because I would have been timed out otherwise. The lifts here are pretty slow so I had to go down the stairs, I didn’t know how long Josh would hang in there for. “It was interesting being in the long room, rather than being in the pavilion. It felt like I was in the zoo. A lot of eyes on me, watching what I was doing, what we were saying but I will do anything for this team.” Ahead of his surprise cameo, speculation had started about whether Lyon would pad up and to what benefit. Former England captain Kevin Pietersen was not alone among broadcast pundits in suggesting that Lyon taking a blow to the helmet may benefit Australia if it allowed them to bring in Todd Murphy as a concussion substitute. Pietersen described the scenario as “food for thought” on Sky Sports, but Lyon was deeply unimpressed by the suggestion. Lyon’s friend and team-mate Phil Hughes died in 2014 after being hit by a bouncer in the neck and the spinner vehemently shut down the notion. He said: “I have heard comments that people thought I went out there to get hit on the head and I am really against that. “I lost one of my mates due to being hit in the head so I think that is a really poor excuse or conversation to be had.” While Lyon would not confirm his Ashes was over, he backed reserve spinner Murphy, 22, to leave his mark on the tour. Australia’s chief spinner Lyon, who was playing his 100th consecutive Test, will have a meeting with the team’s medical staff on Sunday over the best course of action for his rehabilitation. “This is just a little speed bump in the road, this is not career-defining or anything like that,” Lyon stated. “I am sitting down with our medical team tomorrow and we will have a chat. Right now, it is pretty shattering, pretty gutting and I am pretty speechless if I am honest.”","pubDate":"2023-07-01 20:18:53","image_url":"https://www.watfordobserver.co.uk/resources/images/16952628/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England look to talismanic captain Ben Stokes as Australia fume over Starc 'catch'","link":"https://www.dailymail.co.uk/sport/cricket/article-12254859/England-look-talismanic-captain-Ben-Stokes-Australia-fume-Starc-catch.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AND DAVID COVERDALE AT LORD'S: The hosts closed the fourth day of the second Test on 114 for four, needing an England record 371 to win.","content":"We need another miracle, Ben! England look to talismanic captain Stokes... as Glenn McGrath brands decision to overturn Mitchell Starc's 'catch' a 'DISGRACE' England's hopes received a battering from Starc and Cummins in superb form NASSER HUSSAIN: England must learn that entertainment follows winning OLIVER HOLT: Defeat may be looming, but if there's Ben Stokes, there's hope By Aadam Patel and David Coverdale For The Mail On Sunday Published: 22:31, 1 July 2023 | Updated: 00:53, 2 July 2023 e-mail 6 View comments England are praying for another Ben Stokes miracle at Lord’s on Sunday - four years after his Headingley heroics . The hosts closed the fourth day of the second Test on 114 for four, needing an England record 371 to win and stop Australia going 2-0 up, with captain Stokes unbeaten on 29. England had been left reeling on 45 for four by Australia’s quicks before Stokes and Ben Duckett guided them to stumps, with Duckett controversially recalled late on after the umpires adjudged that Mitchell Starc had grounded a boundary catch. Former Australia fast bowler Glenn McGrath branded the decision ‘a disgrace’ . In the third Ashes Test at Headingley in 2019, England entered the decisive day on 153 for three with Stokes at the crease - and he went on to score 135 as they famously chased 359 to win by one wicket. Ben Stokes will lead England's almighty fightback from the crease after a crazy fourth day Mitchell Starc's 'catch' to get out Ben Duckett was sensationally overturned by third umpire ‘There is always hope when Ben is there,’ said England batting coach Marcus Trescothick. ‘If we can get a good start and someone can get a big score, we will definitely be challenging to knock this score off.’ Controversy around Duckett’s recall added late drama. Starc caught a top edge but scraped the ball along the ground as he landed. But Australia legend McGrath blasted: ‘That is the biggest load of rubbish that I’ve ever seen. If that’s not out, every catch I’ve ever seen taken should not be out. ‘That is a disgrace. I’ve seen everything. That is ridiculous. If that’s England taking that catch, that is out!’ Asked about Duckett’s late reprieve, Trescothick compared the impact of technology in cricket to VAR. ‘It’s the same situation with VAR in football, which we all know is a difficult one,’ he said. ‘It’s understanding the rules and seeing a different part to it. ‘At the time, you see the clean catch and it looks ok and there’s no issue but then you put the technology on and you see the ball along the floor and you start to question it. It’s part of the game. We know technology is there. Let’s trust in the process.’ After stumps, the umpire team were swarmed by the visitors as boos rang out across Lord's Duckett - who reached a half-century just before the controversy - had to wait on the field for the decision to be made Law 33.3 states that ‘the act of making a catch shall start from the time when the ball first comes into contact with a fielder’s person and shall end when a fielder obtains complete control over both the ball and his/her own movement’. Trescothick insisted that despite losing four wickets in the final session, the England dressing room still believes. ‘We know the history don’t we? We’ve talked about it many times. Headingley and other occasions where he’s (Ben’s) been the stalwart of the innings and holding it together,’ said Trescothick. ‘So while Ben Stokes is there, us in the England changing room along with the rest of guys like Jonny Bairstow, Ben Duckett and the tailenders know that we’ve still got a chance.’ West Indies will not feature in a World Cup for the first time after Scotland stunned the two-time champions with a seven-wicket win in a qualifying Super Six contest in Harare yesterday. Share or comment on this article: England look to talismanic captain Ben Stokes as Australia fume over Starc 'catch' e-mail Add comment Comments 6 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 23:52:17","image_url":"https://i.dailymail.co.uk/1s/2023/07/02/00/72753587-0-image-a-38_1688252971155.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australia Women beat England by four-wickets as Beth Mooney puts on a masterclass at Edgbaston","link":"https://www.dailymail.co.uk/sport/cricket/article-12254975/Australia-Women-beat-England-four-wickets-Beth-Mooney-puts-masterclass-Edgbaston.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"HENRY CLARK AT EDGBASTON: Beth Mooney led from the front with 61* to guide Australia to a four-wicket win in the first of three T20 matches. The result leaves her side 6-0 up in the series.","content":"Beth Mooney masterclass guides Australia to a four-wicket win against England and put the tourists 6-0 up in the Women's Ashes as they move to within one win of retaining the urn Australia beat England by four wickets in a thriller at Edgbaston on Saturday Beth Mooney was the star scoring an unbeaten 61 in the first of three T20 games It means Australia are now just one win away from retaining the Women's Ashes By Henry Clark For The Mail On Sunday Published: 23:29, 1 July 2023 | Updated: 23:38, 1 July 2023 e-mail View comments On a night they desperately needed to deliver to keep their hopes of winning the women’s Ashes truly alive, England gave it their all. But against this all-conquering Australia side, sometimes even that is not enough and so it proved in a final over thriller at Edgbaston. Beth Mooney led from the front with 61* to guide Australia to a four-wicket win in the first of three Twenty20 matches. The result leaves her side 6-0 up in the series and just one win away from retaining the urn. ‘When you’re involved in any game like that it’s a bit harder to take, being so close,’ said England’s Amy Jones. ‘But there’s definitely positives. It was exciting and there were lots of people there to see which was a great feeling.’ It was always going to be an uphill battle for England after losing the Test match opener of the series. They battled hard here but the reigning Twenty20 World Champions weathered the storm of a 20,000-strong Edgbaston crowd and kept their composure to prove why they are the best white ball team around. Beth Mooney hit 61 not out to guide Australia to a four-wicket win against England at Edgbaston Heather Knight (left) and her side are now 6-0 down in the Women's Ashes series having lost the first of their three T20 matches It means that Australia are now one win away from retaining the urn, with England struggling during their first innings Regular wickets stunted England’s innings and had it not been for opener Sophia Dunkley’s 56 and Jones’ impressive late hand of 40* then things could have been a lot more straightforward for the tourists. England threatened to make the chase interesting with a flurry of late wickets but ultimately Mooney’s class told and she was there at the end as the tourists crossed the finish line with one ball to spare. ‘We were really happy [with our score],’ said Jones. ‘But Mooney batted really well and to have a batter bat the whole way through, you give yourself the best chance of winning. She was probably the difference.’ It was a power play full of drama after England were sent into bat. In the second over Danni Wyatt was beaten all ends up by Darcie Brown’s away swinger but the ball only shaved the top of off stump and failed to dislodge the bails. Her reprieve didn’t last long though. In the next over, Australian seamer Megan Schutt (2-33) knocked Wyatt’s (7) off stump out the ground. No doubt about that one. Alice Capsey was next to go, run out by Brown off her own bowling for three when replays showed she failed to ground her bat. With wickets falling around her, Dunkley had to reign in her attacking style but still made her runs at better than a run of ball. She is unlikely to be the cover star of the MCC coaching manual but Dunkley proved once again how effective her unorthodox shot-making can be. England’s innings threatened to descend into disarray when Dunkley was caught on the boundary before a further two wickets fell for only three runs. Sophia Dunkley topped the scores hitting a very well taken 56 runs off 49 balls to help keep England's score ticking over But Mooney was the star of the show anchoring the Australian run chase with England unable to remove her Sophie Ecclestone (pictured) took two wickets during the match dismissing Tahlia McGrath for 40 But up stepped Jones who led a late charge that included taking 13 runs off the final over. Jess Jonassen was the pick of the bowlers, picking up three wickets with her spin. England’s total always looked light on a good pitch at Edgbaston and so it proved. Lauren Bell got them off to the perfect start after dismissing Alyssa Healy for five. Debutant Danielle Gibson was equally as impressive with the ball but Tahlia McGrath’s effortless 40 from 29 balls helped to steady the ship. She fell to a brilliant piece of bowling by spinner Sophie Ecclestone (2-24) but once Australia got the required rate to a little over a run-a-ball, the final result never really seemed in doubt. A late flurry of wickets made things interesting but came too little, too late for the hosts. Share or comment on this article: Australia Women beat England by four-wickets as Beth Mooney puts on a masterclass at Edgbaston e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:31:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752807-0-image-a-51_1688249913005.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, and Josh Tongue gets high-profile bunny","link":"https://www.dailymail.co.uk/sport/cricket/article-12254937/THE-ASHES-NOTEBOOK-royal-reception-Ben-Stokes-Josh-Tongue-gets-high-profile-bunny.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"ASHES NOTEBOOK: England have hardly put on a royal performance at Lord's, but that did not stop Prince William and Prince George from enjoying the action yesterday afternoon.","content":"THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, Josh Tongue gets a high-profile bunny and Lord's sees a record 160,000 fans pass through their famous gates England had hopes of a fightback dented by Mitchell Starc and Pat Cummins OLIVER HOLT: England's fortunes look dismal, but if there's Stokes, there's hope NASSER HUSSAIN: England should know that winning Test brings entertainment By David Coverdale For The Mail On Sunday Published: 18:20 EDT, 1 July 2023 | Updated: 19:08 EDT, 1 July 2023 e-mail 1 View comments The fourth day of the second Test of the Ashes series was by no means short on drama, sparing a few mundane interludes . England halted Australia 's prodigious run rate by using one of their most lethal weapons against them and serving up a spell of non-stop short-pitched bowling to dispatch Australia for 279 before a slightly delayed tea. But as Ben Stokes ' side set about preparing for a near-historic chase of 371, their top order was set upon by Mitchell Starc and Pat Cummins in superb form. In one indomitable over, the Australian captain dismissed both Joe Root and Harry Brook, but the visitors were unable to get out Ben Duckett just before stumps after Starc's 'catch' was overturned in controversial fashion . Here, Mail Sport's DAVID COVERDALE takes you through some of the stories you might have missed from a gripping Saturday at Lord's. ECB chair Richard Johnson (left) hosted Prince William and Prince George in Lord's hospitality Prime Minister Rishi Sunak (centre) also took in the day and made an appearance on TMS England have hardly put on a royal performance at Lord’s, but that did not stop Prince William and Prince George from enjoying the action yesterday afternoon. The future king sat next to his son and ECB chair Richard Thompson in a hospitality box at the Home of Cricket, with George spotted tucking into a pizza. Prime Minister Rishi Sunak was also in attendance and seen sharing a laugh with the princes, shortly after he had joined Jonathan Agnew for a lunchtime interview on Test Match Special, in which he voiced his approval of Bazball. ‘How could you not fall in love with it and fall in love all over again with the English cricket team after what they did last year?’ said the PM. ‘You’ve got to give it to the team for what they have done.’ Sunak also revealed he used to have secret evening net sessions at The Oval during his time as Chancellor - and that he spent the 2005 Ashes betting on the action. ‘It was around that time spread betting became a thing online,’ he said. ‘I was [betting on] next wicket to fall, innings total, which was quite dangerous.’ If two princes and a Prime Minister were not enough, there was also a lord at Lord’s. England Ashes hero Ian Botham - who was made a life peer in 2020 - attended his first day of the series, and used it to promote his wine brand on social media from the stands. Ian Botham took advantage of the storied setting to plug his wine brand Botham Wines ‘England are not going so well at the moment, but what is going well is the Botham Pinot,’ said Baron Botham, 67, who left his Sky Sports commentary role after the last home Ashes series in 2019. ‘The wine definitely is on top.’ The former England captain was in the news earlier in the week after it emerged he is auctioning off more than 240 souvenirs from his illustrious career If Stuart Broad has the wood over David Warner, it seems Test debutant Josh Tongue might well have a bunny in Steve Smith. The Worcestershire seamer was the first English bowler to dismiss Smith this summer when he trapped him lbw in a County Championship match against Sussex. Josh Tongue gets his man once again, dismissing Steve Smith (right) for the third time And Tongue has removed the Australian star in both innings of this second Ashes Test - caught by Zak Crawley at deep backward square leg yesterday. Lord's will be a full house on Sunday as England attempt to pull off a record Ashes run chase. MCC announced on Saturday afternoon that they had sold all 32,000 tickets for day five, with tickets priced at just £25 for adults and £5 for Under-16s. There has been heavy criticism of the cost of adult tickets for the other four days here, the majority of which have been in excess of £100. Nevertheless, 160,000 fans have come through the gates over the course of this second Ashes Test, a record for the ground following the recent renovation of the Compton and Edrich Stands. MCC have also sold 16,000 tickets for Saturday’s third T20. Share or comment on this article: THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, and Josh Tongue gets high-profile bunny e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:20:34","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752513-0-image-a-32_1688249961541.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Todd Murphy is still a kid but he is capable of stepping in for injured Nathan Lyon","link":"https://www.dailymail.co.uk/sport/cricket/article-12254703/JASON-GILLESPIE-Todd-Murphy-kid-capable-stepping-injured-Nathan-Lyon.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: But looking ahead to the next Test at Headingley, we will see Todd Murphy come into the side - and Australia fans can be assured that he is the real deal.","content":"JASON GILLESPIE: Todd Murphy is still a kid but he is the real deal... the off-spinner doesn't have Nathan Lyon's 496 Test wickets but he is more than capable of stepping in for his injured team-mate Nathan Lyon attempted to bat at 11 a Australia were bowled out on Saturday Todd Murphy took seven wickets in his first ever innings of Test cricket in India Lyon receives a standing ovation from the Lord's crowd as he hobbles off By Jason Gillespie For The Mail On Sunday Published: 21:26, 1 July 2023 | Updated: 23:13, 1 July 2023 e-mail View comments Nathan Lyon looks unlikely to play again in this series and losing a spinner who has taken 496 Test wickets is obviously a massive blow for Australia. What that means going into day five of this match is that they will have to bowl without a frontline spinner, which gives England a fighting chance. But looking ahead to the next Test at Headingley, we will see Todd Murphy come into the side - and Australia fans can be assured that he is the real deal. He has already shown that he is more than capable of performing at this level. He got seven wickets in the first innings of his Test debut in India and he was excellent. At 22 years old, he is still a kid. He is a bit wet behind the ears in first-class experience, let alone international experience. He played his age-group cricket as a batsman and only developed as a spinner in the last five years, so he has had quite a rise. But there have been a lot of very good judges around Australia, particularly in Victoria, who have been talking him up as a quality option for quite some time. Todd Murphy is more than capable of filling in for his injured team-mate at Headingley Nathan Lyon received a standing ovation at Lord's after coming out to bat Despite suffering a significant calf injury, Lyon walked out to face the England attack I have seen him up close playing in the Sheffield Shield against my South Australia side and you can tell he has got an old head on young shoulders. He is picking up things so fast. On the last couple of tours, he has had Nathan with him the whole time and there is no better bowler for him to learn from. He’s also got Daniel Vettori as an assistant coach of Australia, who will have acted as another mentor. He is a slightly different bowler to Nathan. Whereas Nathan relies more on over spin and bounce, Todd uses more side spin and looks to give it a rip. I am gutted for Nathan because this was his 100th consecutive Test and he could have got his 500th Test wicket. He has shown such resilience in his career, as we all saw with the way he came out to bat in Australia’s second innings, despite his significant calf injury. Nathan is far from finished and I am sure he will return as Australia’s No1 spinner as soon as he is back fit. But this gives Todd another taste of international cricket and he will do a fine job for Australia going forward. He won’t be overawed. If the surface is the same in Leeds as it has been at Lord’s, we can also expect to see more short-pitch bowling from the seamers. Both teams have heavily resorted to that tactic here because they have identified that this surface offers next to nothing for the fast bowlers. In England’s first innings, Australia were in the last-chance saloon when Nathan went down and that was the only plan they had left. England were absolutely flying but they then gifted them wickets. Yes, I know they want to play positively, but if they had just absorbed some of that bowling, Australia would have to have changed tack. Instead, they allowed their opponents back into the game. Murphy has had Lyon with him on a number of previous tours to act as something of a mentor The off-spinner took seven wickets in his first innings of Test cricket against India Australia also fell for the same trap on Saturday and I am not sure either team have quite got their tactics right yet. One point of difference for Australia, though, has been the speed of their bowlers. I have been impressed with Josh Tongue for England. He has got that extra yard of pace on Jimmy Anderson, Stuart Broad and Ollie Robinson, who are all very similar. But the Aussie quicks are by and large quicker than the English seamers, in particular Mitchell Starc. I said at the time I would have played him at Edgbaston and he would have been well suited to that surface. But they were right to select him over Scott Boland for this Test and his dismissals of Zak Crawley and Ollie Pope last night proved just what a difference he can make. Share or comment on this article: JASON GILLESPIE: Todd Murphy is still a kid but he is capable of stepping in for injured Nathan Lyon e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:13:55","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752707-0-image-a-30_1688249627210.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us","link":"https://www.dailymail.co.uk/sport/cricket/article-12254911/STUART-BROAD-opinions-dressing-rooms-inner-sanctum-matter-us.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"STUART BROAD: A couple of our players are going have to play out of their skins today but we've seen that anything's possible and so we won't stop believing that we can level this Ashes series.","content":"STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us. We have to stick to our principles Stuart Broad insists that anything is possible with this current England squad Broad was forced to spend Friday evening in hospital after being hit in the face Re-live all the drama from day four at Lord's with England trailing by 257 runs By Stuart Broad for the Mail on Sunday Published: 22:30 BST, 1 July 2023 | Updated: 22:52 BST, 1 July 2023 e-mail View comments A couple of our players are going have to play out of their skins today but we've seen with this England team that anything's possible and so we won’t stop believing that we can level this Ashes series. This team has four of England's eight highest fourth-innings run chases, and although we have not played as well against Australia this week as we would have liked there’s still a chance of making it 1-1. At Leeds last year against New Zealand, we were 55 for six in the first innings - 274 runs behind - yet still managed to chase 300 to win, just three wickets down. Saturday was a really good fighting day from the bowlers and we just had to try to eke out with the old ball as much as we could. We obviously had a clear plan of bowling bouncers and getting those eight wickets for 92 runs was reward for fully committing to that plan. The key to bowling is bowling the ball that suits your field. And I think we all did that. The key to bowling is bowling the ball that suits your field. And I think we all did that on Saturday Among England’s highest ever fourth-innings chases, this team has got three of them Saturday was a really good fighting day from the bowlers and we just had to try to eke out with the old ball everything we could One of the things that we stay strong about in the changing room is sticking with our beliefs. Only the opinions of the dressing room’s inner sanctum matter in terms of how we play and we have enough credit in the bank from what we have done over the past 14 months to know that this style of attacking cricket works for us. It worked for us at Edgbaston because we won pretty much every session there apart from the last one on the final day. We were ahead of the game but Australia got over the line. Ultimately, things didn’t go as we would like over the first three days here but there wer some interesting statistics that Alastair Cook mentioned to me about our performance with the ball on the opening day — although we received criticism from outside the team environment, that criticism was purely based upon the result rather than the process. Fact is we hit our 12th best line and length in the first innings of a match since 2007 — something like 54 innings. We went past the outside edge of the bat 30 times and experienced something similar on day three. You have to stick true to your principles and not base your reflections purely on outcomes. Yes, we were disappointed with Friday morning’s session when we lost six quick wickets for 47 runs, that goes without saying, but ultimately we have formed a mindset of attack — sometimes it will work, sometimes it won’t. The dismissals might not have been conventional ones for Test cricket but you can’t clap when Harry Brook gets 150 on a green pitch versus New Zealand at Wellington and then cry on another occasion when he gets caught in the outfield. Sometimes it can look ugly but it’s a process we believe in and one that works for us. This Lord’s pitch hasn’t been the easiest to whack the ball on but batting tends to get easier, so let’s hope that continues. Fact is we hit our 12th best line and length in the first innings of a match since 2007 — something like 54 innings Yes, we were disappointed with Friday morning’s session when we lost six quick wickets for 47 runs People might have got a bit giddy when we won the toss but there are some of the best fast bowlers in the world across these two Ashes teams, and look how few slip catches there have been so far. That tells you all you need to know about the conditions we have operated in. If you can’t create slip chances, you don’t bowl a team out cheaply. In the second innings, we had to be creative and turn exclusively to short balls. But at some stage we will get circumstances that the fast bowlers will like. On the third day, it felt like old school Lord’s because the ball swung but it wasn’t the dream scenario to bowl because the pitch was very slow. Yes, we dropped a couple of chances early which might have made a difference but anyone that thought we should be bowling Australia out for 160 were being overly optimistic. It was more 320 kind of conditions. I was a bit frustrated that I spent Friday evening on a two-hour hospital visit after being struck by a Cameron Green delivery. It was the last ball of the over and I lost sight of it a little bit. Unfortunately, it caught me under the grille and struck me in the neck, going up into my jaw. It was sore. I wasn’t too concerned about getting an X-ray until the end of the match because I was going to bowl regardless of whether I had a break, but the team doctor Glen Rae was slightly concerned about the swelling and the chance of a bleed in the artery. It was worthwhile getting the all clear. I was also disappointed because I have bowled much worse than I did and ended up with more wickets. I should have had one of course when we should have reviewed the Marnus Labuschagne LBW. I was a bit frustrated that I spent Friday evening with a hospital visit after being struck by a Cameron Green delivery To be honest, the ball before tea which was shown to be going down leg side stuffed us, really. After that, I made a decision to get tighter into the stumps and so when I struck him on the pad again I knew it was out. I just couldn’t get others to believe me. Very rarely do we go for it if it is just one person thinking it’s out. Thankfully it didn’t hurt us too much because Marnus chipped one to point soon afterwards. Mitchell Starc had a catch controversially overturned by Marais Erasmus late on Saturday night The third umpire Marais Erasmus was called into action late on Saturday night, of course, when he reprieved Ben Duckett for a catch by Mitchell Starc that clearly involved the ball being floored. Ultimately, from my understanding of the rule, the ball isn’t allowed to hit the ground. We’ve all played cricket where a catch is attempted with your hands facing upwards and your elbow hits the ground and the ball pops out. But if you catch the ball and turn your hands and grind the ball on the ground, the ball can’t pop out of your hand. If that was a legal way of catching, we’d all be doing it. Share or comment on this article: STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:52:22","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/22/72752481-0-image-a-23_1688248336596.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England beaten in dramatic T20 opener as Australia tighten grip on Women’s Ashes","link":"https://www.watfordobserver.co.uk/sport/national/23627538.england-beaten-dramatic-t20-opener-australia-tighten-grip-womens-ashes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Georgia Wareham scrambled the winning single off the penultimate ball.","content":"Australia were cruising on 130 for two before stumbling to 140 for five and while they needed just a single off the last five balls, a four-wicket victory was not secured until the penultimate delivery. Beth Mooney’s 61 not out off 47 balls, plus cameos from Tahlia McGrath (40 off 29) and Ashleigh Gardner (31 off 23), underpinned the successful chase as England fell 6-0 down in the multi-format series with 10 points to play for. We take a narrow defeat at Edgbaston. Despite the result, what a night with 20,000 people watching us and bringing the atmosphere! 👏 — England Cricket (@englandcricket) Having also been beaten in the lone Test, England face having to win all five remaining matches – two T20s and three ODIs – to win the series against a side who are world champions in both formats. Lauren Bell, Sophie Ecclestone and Sarah Glenn each took a couple of wickets to take this match to the wire, but Georgia Wareham was able to scramble a single after punching to cover to get Australia home. Sophia Dunkley had earlier top-scored with 56 off 49 balls in England’s 153 for seven, a total in which only three of the home side’s batters reached double figures, while they were grateful for Amy Jones’ unbeaten 40 off 21 balls having lost four wickets for 12 runs in front of a 19,527 attendance. The largest English audience for a women’s match outside of a World Cup watched the home side stumble out of the traps after they were asked to bat first. Danni Wyatt had her off stump uprooted by Megan Schutt in the over after the bails had stayed in their grooves despite Darcie Brown grazing the England opener’s stump. Brown had better luck in running out a bewildered Alice Capsey, with third umpire Russell Warren deeming her bat was not grounded over the line. Dunkley’s swipes across the line brought two fours off Gardner and one off Brown but after England had reached 50, Nat Sciver-Brunt slashed Jess Jonassen to deep midwicket. Heather Knight audaciously ramped her third ball for four before she deposited Wareham over the long-on boundary. Knight was timing the ball better than Dunkley, who nevertheless reached 50 off 42 balls before the England captain misread McGrath’s slower ball and slammed to long-on for 29. Dunkley was then deceived by pace off from Schutt as she sliced to short third and by the time the debuting Danielle Gibson and Ecclestone had perished to successive deliveries off Jonassen, England were in some strife, having slipped from 106 for three to 118 for seven. Amid the clatter of wickets, Jones overturned an lbw verdict against her on eight and was then dropped on 15 in the penultimate over by Wareham, who watched on helplessly as the next ball sailed over her head for six. Jones, shuffling laterally in her crease to offset first Schutt then Gardner, also cleared the ropes from the final ball of the innings as England took 31 off the last two overs. Lauren Bell snared Australia captain Alyssa Healy but Mooney started assertively and McGrath ignited the charge with five off-side fours in the space of nine balls towards the end of the powerplay, with two off Ecclestone then three from Gibson. Sarah Glenn was hammered over deep square-leg for six by McGrath, who was then stumped after advancing and missing a swing at Ecclestone to give England a lifeline just before halfway. But Mooney picked off the wayward Freya Davies with a drive then clip for successive fours while Gardner twice heaved handsomely over deep midwicket off Glenn as the Australia pair effortlessly chipped away at the total. Gardner swung once too often and under-edged to wicketkeeper Jones before Grace Harris dragged on to her stumps as Glenn had two in two. Ellyse Perry was castled by Bell’s slower ball in the penultimate over but Annabel Sutherland and Mooney thumped fours to leave five needed off the last six deliveries. Sutherland belted Ecclestone back over her head to tie the scores before two dots were followed by a nervous pull which caught the top-edge and looped to Jones. Wareham, though, held her nerve with a cut and run as she and Mooney claimed the single Australia needed to get over the line.","pubDate":"2023-07-01 21:32:58","image_url":"https://www.watfordobserver.co.uk/resources/images/16952651/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Aussie legend Glenn McGrath claims England 'get the best of the decisions' after overturned catch","link":"https://www.dailymail.co.uk/sport/cricket/article-12254895/Aussie-legend-Glenn-McGrath-claims-England-best-decisions-overturned-catch.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Glenn McGrath was left fuming by the controversial decision to overturn an England wicket late in the evening session of the second Ashes Test at Lord's on Saturday.","content":"Furious Aussie legend Glenn McGrath says controversial Mitchell Starc catch decision is a 'DISGRACE'... as he claims Ben Duckett's reprieve is the 'biggest load of rubbish I've ever seen' England were let off after reviews showed Mitchell Starc's catch was grounded The hosts will start day five of the second Ashes Test trailing by 257 runs We need another miracle, Ben! England look to talismanic captain in their crisis By Dominic Hogan For Mailonline Published: 22:21 BST, 1 July 2023 | Updated: 22:51 BST, 1 July 2023 e-mail View comments Glenn McGrath was left fuming by the controversial decision to overturn an England wicket late in the evening session of the second Ashes Test at Lord's on Saturday. England opener Ben Duckett was given out after somehow managing to edge a Cameron Green bouncer down to deep fine leg. Mitchell Starc - who had already picked up two wickets - steamed in to take the catch diving to his left, before appearing to ground the ball in the process. Although the catch seemed to have been taken, he allowed the ball to grind across the floor, with his fingers crucially not under the ball, leaving umpire Marais Erasmus with no choice but to over turn the decision. And McGrath - who has taken more Test wickets than any fast bowler aside from England duo James Anderson and Stuart Broad - was adamant that his old enemy were getting the rub of the green with the decisions. Australia were left fuming after Mitchell Starc's catch was overturned following a video review Marais Erasmus' review showed that the ball was grounded without Starc's fingers beneath it Ben Duckett was handed the reprieve after he was caught at deep fine leg off a Cameron Green bouncer 'If that's England taking that catch, that is out!' he said. 'England have the best of the conditions and now they are getting the best of the rules. That is the biggest load of rubbish that I've ever seen. 'If that's not out, every catch I've ever seen taken should not be out. That is a disgrace.' Following the decision, Starc could be heard also fuming, and confronting Duckett over the call, although the opener had no part in the decision. The Notts batter had already begun to leave the field before boos in the crowd suggested that there might be perceived foul play afoot. Stopping on his way back to the pavilion at the hint of a lifeline, he was eventually called back to the crease after Erasmus' review and remained there until stumps alongside his captain Ben Stokes. The reprieve came at a pivotal moment in the Test - and indeed the series - with England having lost their first four wickets after a breathtaking spell of bowling from both Starc and his captain, Pat Cummins. Having been bowled out for 279 in their second innings, Australia set England a target of 371 to win the second Test and tie the series, but the hosts made a hash of their chase early on. The Notts and England opener had already made his way to the boundary rope before being called back Pat Cummins (pictured) and Starc blew England's lower order away with a breathtaking spell of bowling England's best batter Joe Root - the highest run scorer of any active player - was out for 18 Duckett's opening partner Zak Crawley was caught behind off Starc, before the quick castled Ollie Pope, with Cummins removing the key wicket of Joe Root and then bowling Harry Brook for just four. Stokes then came in to steady the ship alongside Duckett, who will open the batting on Sunday morning on 50 after the pair's 69-run partnership guided the home side to 114 for four, 257 runs behind the old enemy. But the great Aussia swing bowler was not the only ex-Ashes legend to have been bemused by the decision, with former England batter Marcus Trescothick also suggesting it might have been a clean catch. 'I thought the catch had been taken cleanly, but I have no idea on the rules,' he said. 'We've seen different ones in this game and different decisions have been given. We needed a little bit of luck, hopefully it's a sign things are changing. 'Whatever happens now, it's going to be an exciting final day. We're still fairly upbeat, we're in a positive unit. We have good days and bad days. You enjoy it on a good day, but you don't get too down on a bad day. You take the rough with the smooth. 'Who knows? They never really got going, they didn't get scoring momentum, they probably wanted 400 or 450, with a lot more time to go. We managed to pick up wickets, restricted the runs, so pretty happy with that.' Share or comment on this article: Aussie legend Glenn McGrath claims England 'get the best of the decisions' after overturned catch e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:24:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/22/72750223-0-image-a-17_1688246488808.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"NASSER HUSSAIN: Winning Tests provides its own entertainment","link":"https://www.dailymail.co.uk/sport/cricket/article-12254779/NASSER-HUSSAIN-Winning-Tests-provides-entertainment.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"NASSER HUSSAIN: Spells of bouncers and individual short-pitched duels between fast bowlers and batters have always been part of the game but this was different.","content":"NASSER HUSSAIN: That non-stop short-pitch bowling was like nothing I've ever seen from England... it was incredibly dull at times but it worked and results matter more than entertainment 98 per cent of all deliveries in the middle session of the fourth day were short But England stopped Australia from making runs and took valuable wickets The remaining Tests will only see more short-pitched bowling from both sides By Nasser Hussain for the Daily Mail Published: 21:58, 1 July 2023 | Updated: 22:21, 1 July 2023 e-mail View comments That session of almost non-stop short-pitched bowling from England on Saturday afternoon was unlike anything I have ever seen before in Test cricket. Together with the morning it was an unbelievable passage of play. At times it was farcical. It was certainly surreal. Spells of bouncers and individual short-pitched duels between fast bowlers and batters have always been part of the game but this was different. Ninety eight per cent of all deliveries in the middle session of the fourth day at Lord’s were short and we went two hours before a single ball was pitched up. Not only did it lead to wickets for England but it also stopped the flow of runs for Australia and I liked the fact Ben Stokes and his side were so committed to the tactic. There was no doubt in their minds what they were intending to do. When every ball is going to be short most of the fielders can be placed square of the wicket and batters then have to either duck out of the way ball after ball, which takes bravery and discipline, or have a hook and a flap and risk losing your wicket, as England did too often in the first innings. England's short-pitched bowling may have been predictable but it helped England stem Australia's flow of wickets Ben Stokes joined in on the bowling barrage but he may have put his knee under heavy stress Nathan Lyon cut a heroic figure as he took to the field with a visible calf injury to bat last The fitness levels needed to put in a stint like that are extraordinary and Stuart Broad, Josh Tongue and Ben Stokes will be getting out of bed in instalments on Sunday. When Stokes became captain of this England side he said he would never ask anybody to do something he would not be prepared to do himself and he showed that again yesterday with that 12 over spell. He seemed to be hobbling by the end of his first over so to carry on the way he did was some effort. In the end he put himself out to deep square leg because he didn’t want to do any running. Not that the ball was ever going to be pushed past him at mid-off because there were never any balls pitched up. You do worry about the captain when you see him like that. You don’t want that knee to be so bad it affects his batting as well as his bowling because he cannot run. The last thing England need is for Stokes to put himself out of the series. Then to cap it all came the sight of Nathan Lyon coming out to bat barely being able to walk because of his calf injury and for a while, as Mike Atherton said on Sky, it was like a scene from the TV programme MASH. Batters on both sides will know what they are going to get now. There is going to be an awful lot more short-pitched bowling in the three remaining Ashes Tests. But whether the bowlers can do it to the same effect at Headingley, Old Trafford and the Oval remains to be seen because it could just be this slightly two-paced Lord’s pitch that has led to this. Certainly Manchester, for one, will be quicker and that means you can play your shots or get out of the way more easily. There was a contrast between the way the teams played that short ball. When you’re caught on the boundary, as so many of England’s batsmen were in the first innings, people can react with horror. But is it really different to fend it off trying to defend? The bottom line is it is about scoring runs and England will have to learn from the mistakes they have made here. I saw Harry Brook practising against the short ball in the nets yesterday morning and while he was then undone by a beauty from Pat Cummins he knows he is going to be peppered with men back for the rest of this Ashes. So, was England’s approach in the field contrary to their vow to entertain? Well, at times it was incredibly dull on Saturday because spectators knew what ball was going to be delivered and where the batters were going to hit it. It was a mundane policy, yes, but I liked it because it took a hell of a lot of effort and it was successful for England, at least until it was their turn to bat again. Josh Tongue has been dazzling in his Ashes debut and he could have a big future ahead of him Harry Brook may have been practicing for the short ball but he fell to a plum from Pat Cummins As I said before a ball was bowled in this Test, England have to think about winning. The entertainment factor follows on from that. Mark Waugh made a good point in Australia overnight. Entertainment is not just smashing the ball out of the ground. It can also be about what Atherton, for example, did to combat Allan Donald at Trent Bridge in 1998. We still talk about that duel now. England have it all to do now in this Ashes and they only have three or four days before they have to go again in the third Test at Headingley. But one positive they can take from this match whatever happens today is the performance of Tongue. He looks the part and was both hostile and skilful in that long spell yesterday. If he can stay fit he has a big future at this level. Share or comment on this article: NASSER HUSSAIN: Winning Tests provides its own entertainment e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:21:35","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/21/72750693-0-image-m-15_1688245039284.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘Lost one of my mates’: Emotional Lyon takes aim at Pietersen over concussion comments","link":"https://www.theage.com.au/sport/cricket/lost-one-of-my-mates-emotional-lyon-takes-aim-at-pietersen-over-concussion-comments-20230702-p5dl2q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"Nathan Lyon has been in tears knowing he will probably be ruled out of the Ashes, and he took exception to comments from Australia’s former Ashes foe Kevin Pietersen.","content":"Nathan Lyon has taken offence at former England batsman Kevin Pietersen’s suggestion the injured spinner could have been hit in the head while batting during the second Test so Australia could replace him with a concussion sub. “I have heard comments that people thought I went out there to get hit in the head, and I’m really against that because I’ve lost one of my mates due to being hit in the head,” Lyon said, referring to the tragic death of Phil Hughes almost a decade ago. “So I think that’s a really poor excuse or conversation being had.” Lyon, clearly in pain, attempts to run for a single. Credit: Getty Pietersen, one of Australia’s greatest Ashes foes during his career, floated the suggestion after Lyon hobbled out to bat on Saturday with a badly injured right calf that is likely to end his tour and open the door for fellow off-spinner Todd Murphy to make his debut. “Imagine if he [Lyon] had been hit on the head and got concussion, he’d have got a like-for-like replacement and a world class spinner Todd Murphy, based on how he performed in India, it gives food for thought,” Pietersen said on Sky sports. Hughes collapsed on the pitch after being struck in the neck by a short ball playing a Sheffield Shield match for South Australia against New South Wales at the SCG during November 2014 and died in hospital two days later. Lyon was clearly emotional during his press conference after play on Saturday where he discussed the implications of his injury and the likelihood of his tour being over. He was playing his 100th consecutive Test and needs four more wickets to reach the 500 wicket milestone. “It’s been a lot down more than up. I have been absolutely shattered. I have been in tears, I have been upset, I have been hurting,” he said. “That shows this team means everything to me. And I will start this rehab journey now to get back and play my role and keep loving what I am able to do. “I’ve got a decent tear in my right calf. It is pretty obvious. I am sitting down with our medical team tomorrow and we will have a chat about that. Pretty shattering, pretty gutted. Pretty speechless if I am being honest. But I have a lot of confidence in that changeroom and just thrilled to be part of this team. “This is just a little speed bump in the road. This isn’t career-defining. I am hungrier than ever to get back out there, especially when you see your teammates out there busting your guts this afternoon. It’s disappointing from my end and the guys will keep going on and we will go from there.” Lyon was forced to wait in the Long Room before going out to bat because it would have taken him too long to get to the crease if he’d had to make his way from the dressing room. “I would have been timed out,” he said. “The lifts here are pretty slow, so I had to go down the stairs. It was interesting being in the long room rather than the pavilion waiting to bat. It was like being in the zoo, a lot of eyes were on me watching what we were doing, what we were talking about. But I’ll do anything for this team,” he said. While he was there Lyon ended up having a conversation with Jimmy Anderson confirming the convivial nature of this otherwise hard-fought tour. “He asked me if I was stupid, I said yes. Then I just said to him, ‘I may have to do a you and go to 40 (years of age),’” Lyon said. “He said if you keep loving the game, and keep trying to get better, there’s no reason why you can’t. That was a nice little moment with Jimmy. I’ve got a lot of respect for what he’s done. He’s an incredible role model in world cricket for so many.” Lyon claimed it was his decision to bat despite being so badly injured. “I’ve been having conversations since it happened with our medical team,” he said. “I knew the risks. But the way I look at it, as I said before, I’ll do anything for this team. You never know how big a 15-run partnership can be in an Ashes series. I’m proud of myself for going out there and doing that, but if it’s tomorrow, I’ll do it again.” Watch every ball of the men’s and women’s Ashes series live and exclusive on Channel Nine and 9NOW","pubDate":"2023-07-01 21:07:41","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"I’d do it again and again and again – injured Nathan Lyon proud of batting cameo","link":"https://www.watfordobserver.co.uk/sport/national/23627528.--injured-nathan-lyon-proud-batting-cameo/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Nathan Lyon limped out to bat as Australia’s number 11 despite a significant calf tear.","content":"Lyon sustained a significant calf tear on the second day and has been on crutches since, but defied the pain to walk out as last man during Australia’s second innings on Saturday afternoon. Australia’s frontline spinner limped on to a standing ovation and bravely batted for 25 minutes in a 13-ball innings of four that saw the tourists move on from 264 for nine to 279 all out, which set England 371 to win. “I have been absolutely shattered, I have been in tears, upset and I have been hurting, but this team means everything for me,” Lyon reflected after England closed on 114 for four, still requiring 257 runs for a series-levelling victory. “Yes, I have been having conversations since it happened with our medical team and I knew the risk. But the way I look at it, I will do anything for this team and you never know how big a 15-run partnership can be in an Ashes series. “So, yes I am proud of myself for going out there and doing that. “If it was tomorrow, I would do it again and again and again because I love this team, I love playing for Australia.” Lyon was on crutches at the start of day four but in an extraordinary sequence of events in the afternoon session, he started to make his way through the pavilion down to the pitch when Pat Cummins was out to leave the tourists on 261 for eight in the 96th over. With the 35-year-old in major discomfort every time he walked, Lyon hopped down the stairs and waited in the long room at Lord’s until Josh Hazlewood’s dismissal brought him to the crease. 👏 . | — Lord's Cricket Ground (@HomeOfCricket) Before his courageous innings, Lyon encountered England veteran James Anderson, who was off the field at the time. Lyon added: “I have played against Jimmy for a long period of time now and I have a lot of respect for him. He asked, ‘Am I stupid? And I said, ‘Yes, but I may have to do a you and go to 40.’ “He said, ‘if you keep loving the game and keep trying to get better there is no reason why you can’t,’ so that was a nice little moment with Jimmy. “Regarding batting, I had to go down to the long room and wait because I would have been timed out otherwise. The lifts here are pretty slow so I had to go down the stairs, I didn’t know how long Josh would hang in there for. “It was interesting being in the long room, rather than being in the pavilion. It felt like I was in the zoo. A lot of eyes on me, watching what I was doing, what we were saying but I will do anything for this team.” Ahead of his surprise cameo, speculation had started about whether Lyon would pad up and to what benefit. Former England captain Kevin Pietersen was not alone among broadcast pundits in suggesting that Lyon taking a blow to the helmet may benefit Australia if it allowed them to bring in Todd Murphy as a concussion substitute. Pietersen described the scenario as “food for thought” on Sky Sports, but Lyon was deeply unimpressed by the suggestion. Lyon’s friend and team-mate Phil Hughes died in 2014 after being hit by a bouncer in the neck and the spinner vehemently shut down the notion. He said: “I have heard comments that people thought I went out there to get hit on the head and I am really against that. “I lost one of my mates due to being hit in the head so I think that is a really poor excuse or conversation to be had.” While Lyon would not confirm his Ashes was over, he backed reserve spinner Murphy, 22, to leave his mark on the tour. Australia’s chief spinner Lyon, who was playing his 100th consecutive Test, will have a meeting with the team’s medical staff on Sunday over the best course of action for his rehabilitation. “This is just a little speed bump in the road, this is not career-defining or anything like that,” Lyon stated. “I am sitting down with our medical team tomorrow and we will have a chat. Right now, it is pretty shattering, pretty gutting and I am pretty speechless if I am honest.”","pubDate":"2023-07-01 20:18:53","image_url":"https://www.watfordobserver.co.uk/resources/images/16952628/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England look to talismanic captain Ben Stokes as Australia fume over Starc 'catch'","link":"https://www.dailymail.co.uk/sport/cricket/article-12254859/England-look-talismanic-captain-Ben-Stokes-Australia-fume-Starc-catch.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AND DAVID COVERDALE AT LORD'S: The hosts closed the fourth day of the second Test on 114 for four, needing an England record 371 to win.","content":"We need another miracle, Ben! England look to talismanic captain Stokes... as Glenn McGrath brands decision to overturn Mitchell Starc's 'catch' a 'DISGRACE' England's hopes received a battering from Starc and Cummins in superb form NASSER HUSSAIN: England must learn that entertainment follows winning OLIVER HOLT: Defeat may be looming, but if there's Ben Stokes, there's hope By Aadam Patel and David Coverdale For The Mail On Sunday Published: 22:31, 1 July 2023 | Updated: 00:53, 2 July 2023 e-mail 6 View comments England are praying for another Ben Stokes miracle at Lord’s on Sunday - four years after his Headingley heroics . The hosts closed the fourth day of the second Test on 114 for four, needing an England record 371 to win and stop Australia going 2-0 up, with captain Stokes unbeaten on 29. England had been left reeling on 45 for four by Australia’s quicks before Stokes and Ben Duckett guided them to stumps, with Duckett controversially recalled late on after the umpires adjudged that Mitchell Starc had grounded a boundary catch. Former Australia fast bowler Glenn McGrath branded the decision ‘a disgrace’ . In the third Ashes Test at Headingley in 2019, England entered the decisive day on 153 for three with Stokes at the crease - and he went on to score 135 as they famously chased 359 to win by one wicket. Ben Stokes will lead England's almighty fightback from the crease after a crazy fourth day Mitchell Starc's 'catch' to get out Ben Duckett was sensationally overturned by third umpire ‘There is always hope when Ben is there,’ said England batting coach Marcus Trescothick. ‘If we can get a good start and someone can get a big score, we will definitely be challenging to knock this score off.’ Controversy around Duckett’s recall added late drama. Starc caught a top edge but scraped the ball along the ground as he landed. But Australia legend McGrath blasted: ‘That is the biggest load of rubbish that I’ve ever seen. If that’s not out, every catch I’ve ever seen taken should not be out. ‘That is a disgrace. I’ve seen everything. That is ridiculous. If that’s England taking that catch, that is out!’ Asked about Duckett’s late reprieve, Trescothick compared the impact of technology in cricket to VAR. ‘It’s the same situation with VAR in football, which we all know is a difficult one,’ he said. ‘It’s understanding the rules and seeing a different part to it. ‘At the time, you see the clean catch and it looks ok and there’s no issue but then you put the technology on and you see the ball along the floor and you start to question it. It’s part of the game. We know technology is there. Let’s trust in the process.’ After stumps, the umpire team were swarmed by the visitors as boos rang out across Lord's Duckett - who reached a half-century just before the controversy - had to wait on the field for the decision to be made Law 33.3 states that ‘the act of making a catch shall start from the time when the ball first comes into contact with a fielder’s person and shall end when a fielder obtains complete control over both the ball and his/her own movement’. Trescothick insisted that despite losing four wickets in the final session, the England dressing room still believes. ‘We know the history don’t we? We’ve talked about it many times. Headingley and other occasions where he’s (Ben’s) been the stalwart of the innings and holding it together,’ said Trescothick. ‘So while Ben Stokes is there, us in the England changing room along with the rest of guys like Jonny Bairstow, Ben Duckett and the tailenders know that we’ve still got a chance.’ West Indies will not feature in a World Cup for the first time after Scotland stunned the two-time champions with a seven-wicket win in a qualifying Super Six contest in Harare yesterday. Share or comment on this article: England look to talismanic captain Ben Stokes as Australia fume over Starc 'catch' e-mail Add comment Comments 6 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 23:52:17","image_url":"https://i.dailymail.co.uk/1s/2023/07/02/00/72753587-0-image-a-38_1688252971155.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Australia Women beat England by four-wickets as Beth Mooney puts on a masterclass at Edgbaston","link":"https://www.dailymail.co.uk/sport/cricket/article-12254975/Australia-Women-beat-England-four-wickets-Beth-Mooney-puts-masterclass-Edgbaston.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"HENRY CLARK AT EDGBASTON: Beth Mooney led from the front with 61* to guide Australia to a four-wicket win in the first of three T20 matches. The result leaves her side 6-0 up in the series.","content":"Beth Mooney masterclass guides Australia to a four-wicket win against England and put the tourists 6-0 up in the Women's Ashes as they move to within one win of retaining the urn Australia beat England by four wickets in a thriller at Edgbaston on Saturday Beth Mooney was the star scoring an unbeaten 61 in the first of three T20 games It means Australia are now just one win away from retaining the Women's Ashes By Henry Clark For The Mail On Sunday Published: 23:29, 1 July 2023 | Updated: 23:38, 1 July 2023 e-mail View comments On a night they desperately needed to deliver to keep their hopes of winning the women’s Ashes truly alive, England gave it their all. But against this all-conquering Australia side, sometimes even that is not enough and so it proved in a final over thriller at Edgbaston. Beth Mooney led from the front with 61* to guide Australia to a four-wicket win in the first of three Twenty20 matches. The result leaves her side 6-0 up in the series and just one win away from retaining the urn. ‘When you’re involved in any game like that it’s a bit harder to take, being so close,’ said England’s Amy Jones. ‘But there’s definitely positives. It was exciting and there were lots of people there to see which was a great feeling.’ It was always going to be an uphill battle for England after losing the Test match opener of the series. They battled hard here but the reigning Twenty20 World Champions weathered the storm of a 20,000-strong Edgbaston crowd and kept their composure to prove why they are the best white ball team around. Beth Mooney hit 61 not out to guide Australia to a four-wicket win against England at Edgbaston Heather Knight (left) and her side are now 6-0 down in the Women's Ashes series having lost the first of their three T20 matches It means that Australia are now one win away from retaining the urn, with England struggling during their first innings Regular wickets stunted England’s innings and had it not been for opener Sophia Dunkley’s 56 and Jones’ impressive late hand of 40* then things could have been a lot more straightforward for the tourists. England threatened to make the chase interesting with a flurry of late wickets but ultimately Mooney’s class told and she was there at the end as the tourists crossed the finish line with one ball to spare. ‘We were really happy [with our score],’ said Jones. ‘But Mooney batted really well and to have a batter bat the whole way through, you give yourself the best chance of winning. She was probably the difference.’ It was a power play full of drama after England were sent into bat. In the second over Danni Wyatt was beaten all ends up by Darcie Brown’s away swinger but the ball only shaved the top of off stump and failed to dislodge the bails. Her reprieve didn’t last long though. In the next over, Australian seamer Megan Schutt (2-33) knocked Wyatt’s (7) off stump out the ground. No doubt about that one. Alice Capsey was next to go, run out by Brown off her own bowling for three when replays showed she failed to ground her bat. With wickets falling around her, Dunkley had to reign in her attacking style but still made her runs at better than a run of ball. She is unlikely to be the cover star of the MCC coaching manual but Dunkley proved once again how effective her unorthodox shot-making can be. England’s innings threatened to descend into disarray when Dunkley was caught on the boundary before a further two wickets fell for only three runs. Sophia Dunkley topped the scores hitting a very well taken 56 runs off 49 balls to help keep England's score ticking over But Mooney was the star of the show anchoring the Australian run chase with England unable to remove her Sophie Ecclestone (pictured) took two wickets during the match dismissing Tahlia McGrath for 40 But up stepped Jones who led a late charge that included taking 13 runs off the final over. Jess Jonassen was the pick of the bowlers, picking up three wickets with her spin. England’s total always looked light on a good pitch at Edgbaston and so it proved. Lauren Bell got them off to the perfect start after dismissing Alyssa Healy for five. Debutant Danielle Gibson was equally as impressive with the ball but Tahlia McGrath’s effortless 40 from 29 balls helped to steady the ship. She fell to a brilliant piece of bowling by spinner Sophie Ecclestone (2-24) but once Australia got the required rate to a little over a run-a-ball, the final result never really seemed in doubt. A late flurry of wickets made things interesting but came too little, too late for the hosts. Share or comment on this article: Australia Women beat England by four-wickets as Beth Mooney puts on a masterclass at Edgbaston e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:31:49","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752807-0-image-a-51_1688249913005.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, and Josh Tongue gets high-profile bunny","link":"https://www.dailymail.co.uk/sport/cricket/article-12254937/THE-ASHES-NOTEBOOK-royal-reception-Ben-Stokes-Josh-Tongue-gets-high-profile-bunny.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"ASHES NOTEBOOK: England have hardly put on a royal performance at Lord's, but that did not stop Prince William and Prince George from enjoying the action yesterday afternoon.","content":"THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, Josh Tongue gets a high-profile bunny and Lord's sees a record 160,000 fans pass through their famous gates England had hopes of a fightback dented by Mitchell Starc and Pat Cummins OLIVER HOLT: England's fortunes look dismal, but if there's Stokes, there's hope NASSER HUSSAIN: England should know that winning Test brings entertainment By David Coverdale For The Mail On Sunday Published: 18:20 EDT, 1 July 2023 | Updated: 19:08 EDT, 1 July 2023 e-mail 1 View comments The fourth day of the second Test of the Ashes series was by no means short on drama, sparing a few mundane interludes . England halted Australia 's prodigious run rate by using one of their most lethal weapons against them and serving up a spell of non-stop short-pitched bowling to dispatch Australia for 279 before a slightly delayed tea. But as Ben Stokes ' side set about preparing for a near-historic chase of 371, their top order was set upon by Mitchell Starc and Pat Cummins in superb form. In one indomitable over, the Australian captain dismissed both Joe Root and Harry Brook, but the visitors were unable to get out Ben Duckett just before stumps after Starc's 'catch' was overturned in controversial fashion . Here, Mail Sport's DAVID COVERDALE takes you through some of the stories you might have missed from a gripping Saturday at Lord's. ECB chair Richard Johnson (left) hosted Prince William and Prince George in Lord's hospitality Prime Minister Rishi Sunak (centre) also took in the day and made an appearance on TMS England have hardly put on a royal performance at Lord’s, but that did not stop Prince William and Prince George from enjoying the action yesterday afternoon. The future king sat next to his son and ECB chair Richard Thompson in a hospitality box at the Home of Cricket, with George spotted tucking into a pizza. Prime Minister Rishi Sunak was also in attendance and seen sharing a laugh with the princes, shortly after he had joined Jonathan Agnew for a lunchtime interview on Test Match Special, in which he voiced his approval of Bazball. ‘How could you not fall in love with it and fall in love all over again with the English cricket team after what they did last year?’ said the PM. ‘You’ve got to give it to the team for what they have done.’ Sunak also revealed he used to have secret evening net sessions at The Oval during his time as Chancellor - and that he spent the 2005 Ashes betting on the action. ‘It was around that time spread betting became a thing online,’ he said. ‘I was [betting on] next wicket to fall, innings total, which was quite dangerous.’ If two princes and a Prime Minister were not enough, there was also a lord at Lord’s. England Ashes hero Ian Botham - who was made a life peer in 2020 - attended his first day of the series, and used it to promote his wine brand on social media from the stands. Ian Botham took advantage of the storied setting to plug his wine brand Botham Wines ‘England are not going so well at the moment, but what is going well is the Botham Pinot,’ said Baron Botham, 67, who left his Sky Sports commentary role after the last home Ashes series in 2019. ‘The wine definitely is on top.’ The former England captain was in the news earlier in the week after it emerged he is auctioning off more than 240 souvenirs from his illustrious career If Stuart Broad has the wood over David Warner, it seems Test debutant Josh Tongue might well have a bunny in Steve Smith. The Worcestershire seamer was the first English bowler to dismiss Smith this summer when he trapped him lbw in a County Championship match against Sussex. Josh Tongue gets his man once again, dismissing Steve Smith (right) for the third time And Tongue has removed the Australian star in both innings of this second Ashes Test - caught by Zak Crawley at deep backward square leg yesterday. Lord's will be a full house on Sunday as England attempt to pull off a record Ashes run chase. MCC announced on Saturday afternoon that they had sold all 32,000 tickets for day five, with tickets priced at just £25 for adults and £5 for Under-16s. There has been heavy criticism of the cost of adult tickets for the other four days here, the majority of which have been in excess of £100. Nevertheless, 160,000 fans have come through the gates over the course of this second Ashes Test, a record for the ground following the recent renovation of the Compton and Edrich Stands. MCC have also sold 16,000 tickets for Saturday’s third T20. Share or comment on this article: THE ASHES NOTEBOOK: A royal reception for Ben Stokes' side, and Josh Tongue gets high-profile bunny e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:20:34","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752513-0-image-a-32_1688249961541.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"JASON GILLESPIE: Todd Murphy is still a kid but he is capable of stepping in for injured Nathan Lyon","link":"https://www.dailymail.co.uk/sport/cricket/article-12254703/JASON-GILLESPIE-Todd-Murphy-kid-capable-stepping-injured-Nathan-Lyon.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"JASON GILLESPIE: But looking ahead to the next Test at Headingley, we will see Todd Murphy come into the side - and Australia fans can be assured that he is the real deal.","content":"JASON GILLESPIE: Todd Murphy is still a kid but he is the real deal... the off-spinner doesn't have Nathan Lyon's 496 Test wickets but he is more than capable of stepping in for his injured team-mate Nathan Lyon attempted to bat at 11 a Australia were bowled out on Saturday Todd Murphy took seven wickets in his first ever innings of Test cricket in India Lyon receives a standing ovation from the Lord's crowd as he hobbles off By Jason Gillespie For The Mail On Sunday Published: 21:26, 1 July 2023 | Updated: 23:13, 1 July 2023 e-mail View comments Nathan Lyon looks unlikely to play again in this series and losing a spinner who has taken 496 Test wickets is obviously a massive blow for Australia. What that means going into day five of this match is that they will have to bowl without a frontline spinner, which gives England a fighting chance. But looking ahead to the next Test at Headingley, we will see Todd Murphy come into the side - and Australia fans can be assured that he is the real deal. He has already shown that he is more than capable of performing at this level. He got seven wickets in the first innings of his Test debut in India and he was excellent. At 22 years old, he is still a kid. He is a bit wet behind the ears in first-class experience, let alone international experience. He played his age-group cricket as a batsman and only developed as a spinner in the last five years, so he has had quite a rise. But there have been a lot of very good judges around Australia, particularly in Victoria, who have been talking him up as a quality option for quite some time. Todd Murphy is more than capable of filling in for his injured team-mate at Headingley Nathan Lyon received a standing ovation at Lord's after coming out to bat Despite suffering a significant calf injury, Lyon walked out to face the England attack I have seen him up close playing in the Sheffield Shield against my South Australia side and you can tell he has got an old head on young shoulders. He is picking up things so fast. On the last couple of tours, he has had Nathan with him the whole time and there is no better bowler for him to learn from. He’s also got Daniel Vettori as an assistant coach of Australia, who will have acted as another mentor. He is a slightly different bowler to Nathan. Whereas Nathan relies more on over spin and bounce, Todd uses more side spin and looks to give it a rip. I am gutted for Nathan because this was his 100th consecutive Test and he could have got his 500th Test wicket. He has shown such resilience in his career, as we all saw with the way he came out to bat in Australia’s second innings, despite his significant calf injury. Nathan is far from finished and I am sure he will return as Australia’s No1 spinner as soon as he is back fit. But this gives Todd another taste of international cricket and he will do a fine job for Australia going forward. He won’t be overawed. If the surface is the same in Leeds as it has been at Lord’s, we can also expect to see more short-pitch bowling from the seamers. Both teams have heavily resorted to that tactic here because they have identified that this surface offers next to nothing for the fast bowlers. In England’s first innings, Australia were in the last-chance saloon when Nathan went down and that was the only plan they had left. England were absolutely flying but they then gifted them wickets. Yes, I know they want to play positively, but if they had just absorbed some of that bowling, Australia would have to have changed tack. Instead, they allowed their opponents back into the game. Murphy has had Lyon with him on a number of previous tours to act as something of a mentor The off-spinner took seven wickets in his first innings of Test cricket against India Australia also fell for the same trap on Saturday and I am not sure either team have quite got their tactics right yet. One point of difference for Australia, though, has been the speed of their bowlers. I have been impressed with Josh Tongue for England. He has got that extra yard of pace on Jimmy Anderson, Stuart Broad and Ollie Robinson, who are all very similar. But the Aussie quicks are by and large quicker than the English seamers, in particular Mitchell Starc. I said at the time I would have played him at Edgbaston and he would have been well suited to that surface. But they were right to select him over Scott Boland for this Test and his dismissals of Zak Crawley and Ollie Pope last night proved just what a difference he can make. Share or comment on this article: JASON GILLESPIE: Todd Murphy is still a kid but he is capable of stepping in for injured Nathan Lyon e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 22:13:55","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/23/72752707-0-image-a-30_1688249627210.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us","link":"https://www.dailymail.co.uk/sport/cricket/article-12254911/STUART-BROAD-opinions-dressing-rooms-inner-sanctum-matter-us.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"STUART BROAD: A couple of our players are going have to play out of their skins today but we've seen that anything's possible and so we won't stop believing that we can level this Ashes series.","content":"STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us. We have to stick to our principles Stuart Broad insists that anything is possible with this current England squad Broad was forced to spend Friday evening in hospital after being hit in the face Re-live all the drama from day four at Lord's with England trailing by 257 runs By Stuart Broad for the Mail on Sunday Published: 22:30 BST, 1 July 2023 | Updated: 22:52 BST, 1 July 2023 e-mail View comments A couple of our players are going have to play out of their skins today but we've seen with this England team that anything's possible and so we won’t stop believing that we can level this Ashes series. This team has four of England's eight highest fourth-innings run chases, and although we have not played as well against Australia this week as we would have liked there’s still a chance of making it 1-1. At Leeds last year against New Zealand, we were 55 for six in the first innings - 274 runs behind - yet still managed to chase 300 to win, just three wickets down. Saturday was a really good fighting day from the bowlers and we just had to try to eke out with the old ball as much as we could. We obviously had a clear plan of bowling bouncers and getting those eight wickets for 92 runs was reward for fully committing to that plan. The key to bowling is bowling the ball that suits your field. And I think we all did that. The key to bowling is bowling the ball that suits your field. And I think we all did that on Saturday Among England’s highest ever fourth-innings chases, this team has got three of them Saturday was a really good fighting day from the bowlers and we just had to try to eke out with the old ball everything we could One of the things that we stay strong about in the changing room is sticking with our beliefs. Only the opinions of the dressing room’s inner sanctum matter in terms of how we play and we have enough credit in the bank from what we have done over the past 14 months to know that this style of attacking cricket works for us. It worked for us at Edgbaston because we won pretty much every session there apart from the last one on the final day. We were ahead of the game but Australia got over the line. Ultimately, things didn’t go as we would like over the first three days here but there wer some interesting statistics that Alastair Cook mentioned to me about our performance with the ball on the opening day — although we received criticism from outside the team environment, that criticism was purely based upon the result rather than the process. Fact is we hit our 12th best line and length in the first innings of a match since 2007 — something like 54 innings. We went past the outside edge of the bat 30 times and experienced something similar on day three. You have to stick true to your principles and not base your reflections purely on outcomes. Yes, we were disappointed with Friday morning’s session when we lost six quick wickets for 47 runs, that goes without saying, but ultimately we have formed a mindset of attack — sometimes it will work, sometimes it won’t. The dismissals might not have been conventional ones for Test cricket but you can’t clap when Harry Brook gets 150 on a green pitch versus New Zealand at Wellington and then cry on another occasion when he gets caught in the outfield. Sometimes it can look ugly but it’s a process we believe in and one that works for us. This Lord’s pitch hasn’t been the easiest to whack the ball on but batting tends to get easier, so let’s hope that continues. Fact is we hit our 12th best line and length in the first innings of a match since 2007 — something like 54 innings Yes, we were disappointed with Friday morning’s session when we lost six quick wickets for 47 runs People might have got a bit giddy when we won the toss but there are some of the best fast bowlers in the world across these two Ashes teams, and look how few slip catches there have been so far. That tells you all you need to know about the conditions we have operated in. If you can’t create slip chances, you don’t bowl a team out cheaply. In the second innings, we had to be creative and turn exclusively to short balls. But at some stage we will get circumstances that the fast bowlers will like. On the third day, it felt like old school Lord’s because the ball swung but it wasn’t the dream scenario to bowl because the pitch was very slow. Yes, we dropped a couple of chances early which might have made a difference but anyone that thought we should be bowling Australia out for 160 were being overly optimistic. It was more 320 kind of conditions. I was a bit frustrated that I spent Friday evening on a two-hour hospital visit after being struck by a Cameron Green delivery. It was the last ball of the over and I lost sight of it a little bit. Unfortunately, it caught me under the grille and struck me in the neck, going up into my jaw. It was sore. I wasn’t too concerned about getting an X-ray until the end of the match because I was going to bowl regardless of whether I had a break, but the team doctor Glen Rae was slightly concerned about the swelling and the chance of a bleed in the artery. It was worthwhile getting the all clear. I was also disappointed because I have bowled much worse than I did and ended up with more wickets. I should have had one of course when we should have reviewed the Marnus Labuschagne LBW. I was a bit frustrated that I spent Friday evening with a hospital visit after being struck by a Cameron Green delivery To be honest, the ball before tea which was shown to be going down leg side stuffed us, really. After that, I made a decision to get tighter into the stumps and so when I struck him on the pad again I knew it was out. I just couldn’t get others to believe me. Very rarely do we go for it if it is just one person thinking it’s out. Thankfully it didn’t hurt us too much because Marnus chipped one to point soon afterwards. Mitchell Starc had a catch controversially overturned by Marais Erasmus late on Saturday night The third umpire Marais Erasmus was called into action late on Saturday night, of course, when he reprieved Ben Duckett for a catch by Mitchell Starc that clearly involved the ball being floored. Ultimately, from my understanding of the rule, the ball isn’t allowed to hit the ground. We’ve all played cricket where a catch is attempted with your hands facing upwards and your elbow hits the ground and the ball pops out. But if you catch the ball and turn your hands and grind the ball on the ground, the ball can’t pop out of your hand. If that was a legal way of catching, we’d all be doing it. Share or comment on this article: STUART BROAD: Only the opinions of the dressing room's inner sanctum matter to us e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:52:22","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/22/72752481-0-image-a-23_1688248336596.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"England beaten in dramatic T20 opener as Australia tighten grip on Women’s Ashes","link":"https://www.watfordobserver.co.uk/sport/national/23627538.england-beaten-dramatic-t20-opener-australia-tighten-grip-womens-ashes/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Georgia Wareham scrambled the winning single off the penultimate ball.","content":"Australia were cruising on 130 for two before stumbling to 140 for five and while they needed just a single off the last five balls, a four-wicket victory was not secured until the penultimate delivery. Beth Mooney’s 61 not out off 47 balls, plus cameos from Tahlia McGrath (40 off 29) and Ashleigh Gardner (31 off 23), underpinned the successful chase as England fell 6-0 down in the multi-format series with 10 points to play for. We take a narrow defeat at Edgbaston. Despite the result, what a night with 20,000 people watching us and bringing the atmosphere! 👏 — England Cricket (@englandcricket) Having also been beaten in the lone Test, England face having to win all five remaining matches – two T20s and three ODIs – to win the series against a side who are world champions in both formats. Lauren Bell, Sophie Ecclestone and Sarah Glenn each took a couple of wickets to take this match to the wire, but Georgia Wareham was able to scramble a single after punching to cover to get Australia home. Sophia Dunkley had earlier top-scored with 56 off 49 balls in England’s 153 for seven, a total in which only three of the home side’s batters reached double figures, while they were grateful for Amy Jones’ unbeaten 40 off 21 balls having lost four wickets for 12 runs in front of a 19,527 attendance. The largest English audience for a women’s match outside of a World Cup watched the home side stumble out of the traps after they were asked to bat first. Danni Wyatt had her off stump uprooted by Megan Schutt in the over after the bails had stayed in their grooves despite Darcie Brown grazing the England opener’s stump. Brown had better luck in running out a bewildered Alice Capsey, with third umpire Russell Warren deeming her bat was not grounded over the line. Dunkley’s swipes across the line brought two fours off Gardner and one off Brown but after England had reached 50, Nat Sciver-Brunt slashed Jess Jonassen to deep midwicket. Heather Knight audaciously ramped her third ball for four before she deposited Wareham over the long-on boundary. Knight was timing the ball better than Dunkley, who nevertheless reached 50 off 42 balls before the England captain misread McGrath’s slower ball and slammed to long-on for 29. Dunkley was then deceived by pace off from Schutt as she sliced to short third and by the time the debuting Danielle Gibson and Ecclestone had perished to successive deliveries off Jonassen, England were in some strife, having slipped from 106 for three to 118 for seven. Amid the clatter of wickets, Jones overturned an lbw verdict against her on eight and was then dropped on 15 in the penultimate over by Wareham, who watched on helplessly as the next ball sailed over her head for six. Jones, shuffling laterally in her crease to offset first Schutt then Gardner, also cleared the ropes from the final ball of the innings as England took 31 off the last two overs. Lauren Bell snared Australia captain Alyssa Healy but Mooney started assertively and McGrath ignited the charge with five off-side fours in the space of nine balls towards the end of the powerplay, with two off Ecclestone then three from Gibson. Sarah Glenn was hammered over deep square-leg for six by McGrath, who was then stumped after advancing and missing a swing at Ecclestone to give England a lifeline just before halfway. But Mooney picked off the wayward Freya Davies with a drive then clip for successive fours while Gardner twice heaved handsomely over deep midwicket off Glenn as the Australia pair effortlessly chipped away at the total. Gardner swung once too often and under-edged to wicketkeeper Jones before Grace Harris dragged on to her stumps as Glenn had two in two. Ellyse Perry was castled by Bell’s slower ball in the penultimate over but Annabel Sutherland and Mooney thumped fours to leave five needed off the last six deliveries. Sutherland belted Ecclestone back over her head to tie the scores before two dots were followed by a nervous pull which caught the top-edge and looped to Jones. Wareham, though, held her nerve with a cut and run as she and Mooney claimed the single Australia needed to get over the line.","pubDate":"2023-07-01 21:32:58","image_url":"https://www.watfordobserver.co.uk/resources/images/16952651/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Aussie legend Glenn McGrath claims England 'get the best of the decisions' after overturned catch","link":"https://www.dailymail.co.uk/sport/cricket/article-12254895/Aussie-legend-Glenn-McGrath-claims-England-best-decisions-overturned-catch.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Glenn McGrath was left fuming by the controversial decision to overturn an England wicket late in the evening session of the second Ashes Test at Lord's on Saturday.","content":"Furious Aussie legend Glenn McGrath says controversial Mitchell Starc catch decision is a 'DISGRACE'... as he claims Ben Duckett's reprieve is the 'biggest load of rubbish I've ever seen' England were let off after reviews showed Mitchell Starc's catch was grounded The hosts will start day five of the second Ashes Test trailing by 257 runs We need another miracle, Ben! England look to talismanic captain in their crisis By Dominic Hogan For Mailonline Published: 22:21 BST, 1 July 2023 | Updated: 22:51 BST, 1 July 2023 e-mail View comments Glenn McGrath was left fuming by the controversial decision to overturn an England wicket late in the evening session of the second Ashes Test at Lord's on Saturday. England opener Ben Duckett was given out after somehow managing to edge a Cameron Green bouncer down to deep fine leg. Mitchell Starc - who had already picked up two wickets - steamed in to take the catch diving to his left, before appearing to ground the ball in the process. Although the catch seemed to have been taken, he allowed the ball to grind across the floor, with his fingers crucially not under the ball, leaving umpire Marais Erasmus with no choice but to over turn the decision. And McGrath - who has taken more Test wickets than any fast bowler aside from England duo James Anderson and Stuart Broad - was adamant that his old enemy were getting the rub of the green with the decisions. Australia were left fuming after Mitchell Starc's catch was overturned following a video review Marais Erasmus' review showed that the ball was grounded without Starc's fingers beneath it Ben Duckett was handed the reprieve after he was caught at deep fine leg off a Cameron Green bouncer 'If that's England taking that catch, that is out!' he said. 'England have the best of the conditions and now they are getting the best of the rules. That is the biggest load of rubbish that I've ever seen. 'If that's not out, every catch I've ever seen taken should not be out. That is a disgrace.' Following the decision, Starc could be heard also fuming, and confronting Duckett over the call, although the opener had no part in the decision. The Notts batter had already begun to leave the field before boos in the crowd suggested that there might be perceived foul play afoot. Stopping on his way back to the pavilion at the hint of a lifeline, he was eventually called back to the crease after Erasmus' review and remained there until stumps alongside his captain Ben Stokes. The reprieve came at a pivotal moment in the Test - and indeed the series - with England having lost their first four wickets after a breathtaking spell of bowling from both Starc and his captain, Pat Cummins. Having been bowled out for 279 in their second innings, Australia set England a target of 371 to win the second Test and tie the series, but the hosts made a hash of their chase early on. The Notts and England opener had already made his way to the boundary rope before being called back Pat Cummins (pictured) and Starc blew England's lower order away with a breathtaking spell of bowling England's best batter Joe Root - the highest run scorer of any active player - was out for 18 Duckett's opening partner Zak Crawley was caught behind off Starc, before the quick castled Ollie Pope, with Cummins removing the key wicket of Joe Root and then bowling Harry Brook for just four. Stokes then came in to steady the ship alongside Duckett, who will open the batting on Sunday morning on 50 after the pair's 69-run partnership guided the home side to 114 for four, 257 runs behind the old enemy. But the great Aussia swing bowler was not the only ex-Ashes legend to have been bemused by the decision, with former England batter Marcus Trescothick also suggesting it might have been a clean catch. 'I thought the catch had been taken cleanly, but I have no idea on the rules,' he said. 'We've seen different ones in this game and different decisions have been given. We needed a little bit of luck, hopefully it's a sign things are changing. 'Whatever happens now, it's going to be an exciting final day. We're still fairly upbeat, we're in a positive unit. We have good days and bad days. You enjoy it on a good day, but you don't get too down on a bad day. You take the rough with the smooth. 'Who knows? They never really got going, they didn't get scoring momentum, they probably wanted 400 or 450, with a lot more time to go. We managed to pick up wickets, restricted the runs, so pretty happy with that.' Share or comment on this article: Aussie legend Glenn McGrath claims England 'get the best of the decisions' after overturned catch e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:24:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/22/72750223-0-image-a-17_1688246488808.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"NASSER HUSSAIN: Winning Tests provides its own entertainment","link":"https://www.dailymail.co.uk/sport/cricket/article-12254779/NASSER-HUSSAIN-Winning-Tests-provides-entertainment.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"NASSER HUSSAIN: Spells of bouncers and individual short-pitched duels between fast bowlers and batters have always been part of the game but this was different.","content":"NASSER HUSSAIN: That non-stop short-pitch bowling was like nothing I've ever seen from England... it was incredibly dull at times but it worked and results matter more than entertainment 98 per cent of all deliveries in the middle session of the fourth day were short But England stopped Australia from making runs and took valuable wickets The remaining Tests will only see more short-pitched bowling from both sides By Nasser Hussain for the Daily Mail Published: 21:58, 1 July 2023 | Updated: 22:21, 1 July 2023 e-mail View comments That session of almost non-stop short-pitched bowling from England on Saturday afternoon was unlike anything I have ever seen before in Test cricket. Together with the morning it was an unbelievable passage of play. At times it was farcical. It was certainly surreal. Spells of bouncers and individual short-pitched duels between fast bowlers and batters have always been part of the game but this was different. Ninety eight per cent of all deliveries in the middle session of the fourth day at Lord’s were short and we went two hours before a single ball was pitched up. Not only did it lead to wickets for England but it also stopped the flow of runs for Australia and I liked the fact Ben Stokes and his side were so committed to the tactic. There was no doubt in their minds what they were intending to do. When every ball is going to be short most of the fielders can be placed square of the wicket and batters then have to either duck out of the way ball after ball, which takes bravery and discipline, or have a hook and a flap and risk losing your wicket, as England did too often in the first innings. England's short-pitched bowling may have been predictable but it helped England stem Australia's flow of wickets Ben Stokes joined in on the bowling barrage but he may have put his knee under heavy stress Nathan Lyon cut a heroic figure as he took to the field with a visible calf injury to bat last The fitness levels needed to put in a stint like that are extraordinary and Stuart Broad, Josh Tongue and Ben Stokes will be getting out of bed in instalments on Sunday. When Stokes became captain of this England side he said he would never ask anybody to do something he would not be prepared to do himself and he showed that again yesterday with that 12 over spell. He seemed to be hobbling by the end of his first over so to carry on the way he did was some effort. In the end he put himself out to deep square leg because he didn’t want to do any running. Not that the ball was ever going to be pushed past him at mid-off because there were never any balls pitched up. You do worry about the captain when you see him like that. You don’t want that knee to be so bad it affects his batting as well as his bowling because he cannot run. The last thing England need is for Stokes to put himself out of the series. Then to cap it all came the sight of Nathan Lyon coming out to bat barely being able to walk because of his calf injury and for a while, as Mike Atherton said on Sky, it was like a scene from the TV programme MASH. Batters on both sides will know what they are going to get now. There is going to be an awful lot more short-pitched bowling in the three remaining Ashes Tests. But whether the bowlers can do it to the same effect at Headingley, Old Trafford and the Oval remains to be seen because it could just be this slightly two-paced Lord’s pitch that has led to this. Certainly Manchester, for one, will be quicker and that means you can play your shots or get out of the way more easily. There was a contrast between the way the teams played that short ball. When you’re caught on the boundary, as so many of England’s batsmen were in the first innings, people can react with horror. But is it really different to fend it off trying to defend? The bottom line is it is about scoring runs and England will have to learn from the mistakes they have made here. I saw Harry Brook practising against the short ball in the nets yesterday morning and while he was then undone by a beauty from Pat Cummins he knows he is going to be peppered with men back for the rest of this Ashes. So, was England’s approach in the field contrary to their vow to entertain? Well, at times it was incredibly dull on Saturday because spectators knew what ball was going to be delivered and where the batters were going to hit it. It was a mundane policy, yes, but I liked it because it took a hell of a lot of effort and it was successful for England, at least until it was their turn to bat again. Josh Tongue has been dazzling in his Ashes debut and he could have a big future ahead of him Harry Brook may have been practicing for the short ball but he fell to a plum from Pat Cummins As I said before a ball was bowled in this Test, England have to think about winning. The entertainment factor follows on from that. Mark Waugh made a good point in Australia overnight. Entertainment is not just smashing the ball out of the ground. It can also be about what Atherton, for example, did to combat Allan Donald at Trent Bridge in 1998. We still talk about that duel now. England have it all to do now in this Ashes and they only have three or four days before they have to go again in the third Test at Headingley. But one positive they can take from this match whatever happens today is the performance of Tongue. He looks the part and was both hostile and skilful in that long spell yesterday. If he can stay fit he has a big future at this level. Share or comment on this article: NASSER HUSSAIN: Winning Tests provides its own entertainment e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-01 21:21:35","image_url":"https://i.dailymail.co.uk/1s/2023/07/01/21/72750693-0-image-m-15_1688245039284.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"‘Lost one of my mates’: Emotional Lyon takes aim at Pietersen over concussion comments","link":"https://www.theage.com.au/sport/cricket/lost-one-of-my-mates-emotional-lyon-takes-aim-at-pietersen-over-concussion-comments-20230702-p5dl2q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"Nathan Lyon has been in tears knowing he will probably be ruled out of the Ashes, and he took exception to comments from Australia’s former Ashes foe Kevin Pietersen.","content":"Nathan Lyon has taken offence at former England batsman Kevin Pietersen’s suggestion the injured spinner could have been hit in the head while batting during the second Test so Australia could replace him with a concussion sub. “I have heard comments that people thought I went out there to get hit in the head, and I’m really against that because I’ve lost one of my mates due to being hit in the head,” Lyon said, referring to the tragic death of Phil Hughes almost a decade ago. “So I think that’s a really poor excuse or conversation being had.” Lyon, clearly in pain, attempts to run for a single. Credit: Getty Pietersen, one of Australia’s greatest Ashes foes during his career, floated the suggestion after Lyon hobbled out to bat on Saturday with a badly injured right calf that is likely to end his tour and open the door for fellow off-spinner Todd Murphy to make his debut. “Imagine if he [Lyon] had been hit on the head and got concussion, he’d have got a like-for-like replacement and a world class spinner Todd Murphy, based on how he performed in India, it gives food for thought,” Pietersen said on Sky sports. Hughes collapsed on the pitch after being struck in the neck by a short ball playing a Sheffield Shield match for South Australia against New South Wales at the SCG during November 2014 and died in hospital two days later. Lyon was clearly emotional during his press conference after play on Saturday where he discussed the implications of his injury and the likelihood of his tour being over. He was playing his 100th consecutive Test and needs four more wickets to reach the 500 wicket milestone. “It’s been a lot down more than up. I have been absolutely shattered. I have been in tears, I have been upset, I have been hurting,” he said. “That shows this team means everything to me. And I will start this rehab journey now to get back and play my role and keep loving what I am able to do. “I’ve got a decent tear in my right calf. It is pretty obvious. I am sitting down with our medical team tomorrow and we will have a chat about that. Pretty shattering, pretty gutted. Pretty speechless if I am being honest. But I have a lot of confidence in that changeroom and just thrilled to be part of this team. “This is just a little speed bump in the road. This isn’t career-defining. I am hungrier than ever to get back out there, especially when you see your teammates out there busting your guts this afternoon. It’s disappointing from my end and the guys will keep going on and we will go from there.” Lyon was forced to wait in the Long Room before going out to bat because it would have taken him too long to get to the crease if he’d had to make his way from the dressing room. “I would have been timed out,” he said. “The lifts here are pretty slow, so I had to go down the stairs. It was interesting being in the long room rather than the pavilion waiting to bat. It was like being in the zoo, a lot of eyes were on me watching what we were doing, what we were talking about. But I’ll do anything for this team,” he said. While he was there Lyon ended up having a conversation with Jimmy Anderson confirming the convivial nature of this otherwise hard-fought tour. “He asked me if I was stupid, I said yes. Then I just said to him, ‘I may have to do a you and go to 40 (years of age),’” Lyon said. “He said if you keep loving the game, and keep trying to get better, there’s no reason why you can’t. That was a nice little moment with Jimmy. I’ve got a lot of respect for what he’s done. He’s an incredible role model in world cricket for so many.” Lyon claimed it was his decision to bat despite being so badly injured. “I’ve been having conversations since it happened with our medical team,” he said. “I knew the risks. But the way I look at it, as I said before, I’ll do anything for this team. You never know how big a 15-run partnership can be in an Ashes series. I’m proud of myself for going out there and doing that, but if it’s tomorrow, I’ll do it again.” Watch every ball of the men’s and women’s Ashes series live and exclusive on Channel Nine and 9NOW","pubDate":"2023-07-01 21:07:41","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"I’d do it again and again and again – injured Nathan Lyon proud of batting cameo","link":"https://www.watfordobserver.co.uk/sport/national/23627528.--injured-nathan-lyon-proud-batting-cameo/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Nathan Lyon limped out to bat as Australia’s number 11 despite a significant calf tear.","content":"Lyon sustained a significant calf tear on the second day and has been on crutches since, but defied the pain to walk out as last man during Australia’s second innings on Saturday afternoon. Australia’s frontline spinner limped on to a standing ovation and bravely batted for 25 minutes in a 13-ball innings of four that saw the tourists move on from 264 for nine to 279 all out, which set England 371 to win. “I have been absolutely shattered, I have been in tears, upset and I have been hurting, but this team means everything for me,” Lyon reflected after England closed on 114 for four, still requiring 257 runs for a series-levelling victory. “Yes, I have been having conversations since it happened with our medical team and I knew the risk. But the way I look at it, I will do anything for this team and you never know how big a 15-run partnership can be in an Ashes series. “So, yes I am proud of myself for going out there and doing that. “If it was tomorrow, I would do it again and again and again because I love this team, I love playing for Australia.” Lyon was on crutches at the start of day four but in an extraordinary sequence of events in the afternoon session, he started to make his way through the pavilion down to the pitch when Pat Cummins was out to leave the tourists on 261 for eight in the 96th over. With the 35-year-old in major discomfort every time he walked, Lyon hopped down the stairs and waited in the long room at Lord’s until Josh Hazlewood’s dismissal brought him to the crease. 👏 . | — Lord's Cricket Ground (@HomeOfCricket) Before his courageous innings, Lyon encountered England veteran James Anderson, who was off the field at the time. Lyon added: “I have played against Jimmy for a long period of time now and I have a lot of respect for him. He asked, ‘Am I stupid? And I said, ‘Yes, but I may have to do a you and go to 40.’ “He said, ‘if you keep loving the game and keep trying to get better there is no reason why you can’t,’ so that was a nice little moment with Jimmy. “Regarding batting, I had to go down to the long room and wait because I would have been timed out otherwise. The lifts here are pretty slow so I had to go down the stairs, I didn’t know how long Josh would hang in there for. “It was interesting being in the long room, rather than being in the pavilion. It felt like I was in the zoo. A lot of eyes on me, watching what I was doing, what we were saying but I will do anything for this team.” Ahead of his surprise cameo, speculation had started about whether Lyon would pad up and to what benefit. Former England captain Kevin Pietersen was not alone among broadcast pundits in suggesting that Lyon taking a blow to the helmet may benefit Australia if it allowed them to bring in Todd Murphy as a concussion substitute. Pietersen described the scenario as “food for thought” on Sky Sports, but Lyon was deeply unimpressed by the suggestion. Lyon’s friend and team-mate Phil Hughes died in 2014 after being hit by a bouncer in the neck and the spinner vehemently shut down the notion. He said: “I have heard comments that people thought I went out there to get hit on the head and I am really against that. “I lost one of my mates due to being hit in the head so I think that is a really poor excuse or conversation to be had.” While Lyon would not confirm his Ashes was over, he backed reserve spinner Murphy, 22, to leave his mark on the tour. Australia’s chief spinner Lyon, who was playing his 100th consecutive Test, will have a meeting with the team’s medical staff on Sunday over the best course of action for his rehabilitation. “This is just a little speed bump in the road, this is not career-defining or anything like that,” Lyon stated. “I am sitting down with our medical team tomorrow and we will have a chat. Right now, it is pretty shattering, pretty gutting and I am pretty speechless if I am honest.”","pubDate":"2023-07-01 20:18:53","image_url":"https://www.watfordobserver.co.uk/resources/images/16952628/?type=app&htype=0","source_id":"watfordobserver","category":["sports"],"country":["united kingdom"],"language":"english"}]}