{"newsArray":[{"title":"‘It’s a disgrace’ – Jason Cundy and Jamie O’Hara slam Cristiano Ronaldo for walking down tunnel early in Manchester United’s 2-0 win over Tottenham","link":"https://talksport.com/football/1224421/man-utd-cristiano-ronaldo-old-trafford-tunnel-tottenham-jason-cundy-jamie-ohara/","keywords":["Football","Premier League","The Sports Bar"],"creator":["Jake Lambourne"],"video_url":null,"description":null,"content":"Jason Cundy and Jamie O’Hara have slammed Manchester United star Cristiano Ronaldo after his early exit down the tunnel at Old Trafford. Dropped for the 2-0 win against Tottenham, the 37-year-old made his way back to the dressing room before full-time after failing to come off the bench in a superb victory for the Red Devils. Cristiano Ronaldo failed to come off the bench in Manchester United’s win over TottenhamGetty Ronaldo made his way down the tunnel before full-time after being overlooked by Erik ten HagRex Cameras spotted Ronaldo trudging down the tunnel late on as he once again made it all about him in what was United’s best performance of the season. The Red Devils didn’t miss the five-time Ballon d’Or winner as Fred and Bruno Fernandes got on the score sheet in what could have been a cricket score at Old Trafford. But Ronaldo’s antics has proven to be the talking point from the match, with talkSPORT’s Cundy and O’Hara labelling the Portugal international as a ‘disgrace’. Former Tottenham midfielder O’Hara said on The Sports Bar: “Ronaldo walks down the tunnel in the 89th minute – it’s a disgrace! “The best performance for Man United of the season so far, and Ronaldo walks off down the tunnel. “And the tunnel at Old Trafford is not right by the dugout, you’ve got to walk the length of the pitch, almost. How disrespectful is that to your teammates!” Most read in FOOTBALL game Man United 2-0 Spurs LIVE REACTION: Ronaldo branded a disgrace as he WALKS off BEALE DEAL QPR manager Michael Beale set to become new Wolves boss TRANSFER Zaha 'keen on Liverpool' move as rival clubs prepare to battle for Palace star caught Ex-Inter and Roma star caught smoking on bench and 'suspended indefinitely' by club QUALITY Arsenal, Spurs and Chelsea tipped for Zaha battle as brilliant stats emerge praise Conte calls Man United a 'monster' and reveals past Ferguson pursuit To which ex-Chelsea defender Cundy remarked: “It’s all for show. That’s why I wouldn’t take Ronaldo [at Chelsea]. The baggage. “He is a brilliant footballer and he will score goals but that’s the reason. “[Erik] Ten Hag has still got a problem with him, and January can’t come quick enough for Ten Hag to move him on. He wants to move on, there’s petulance. “And what does that do to other players? No doubt he’s a brilliant influence in the dressing room, but the petulance shown like that in public that’s not on, that’s not fair. Ronaldo has been criticised after his decision to head back to the changing room earlyAmazon “Imagine if you’re a young player looking up to Ronaldo and he does that? “For Ronaldo to do that during the game, it’s slapping Ten Hag round the face. He’s questioning his authority. Publicly he’s given the manager a little *tsh* round the chops.” O’Hara then simply stated: “It’s not good enough, especially on a night like tonight – it’s a big result for Manchester United.” Speaking after the match, Ten Hag revealed he will deal with the situation on Thursday. He told Amazon Prime: “I will deal with that tomorrow, not today.” Before adding: “He was there I have seen him, but I didn’t speak with him. “I will deal with that tomorrow, not today. We celebrate this victory and now we have to recover for Chelsea on Saturday.” OFFER OF THE DAY SkyBet: Bet £10 Get £30 In Free Bets* – CLAIM HERE New customers only. First single & e/w bet only odds of 1/1 or greater. 3 x £10 bet tokens. Free bet stakes not included in returns. Free bets only redeemable on football. Free bets are non withdrawable. No free bet expiry. Eligibility restrictions and further t&cs apply.","pubDate":"2022-10-19 22:35:46","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"AMR vs AZA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Oman D10 2022, Match 19","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/amr-vs-aza-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-oman-d10-2022-match-19?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-19 22:29:23","image_url":"https://static.sportskeeda.com/editor/2022/10/b930d-16662020196784-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Alyssa Healy made Australian vice-captain across all three formats","link":"https://www.perthnow.com.au/sport/alyssa-healy-made-australian-vice-captain-across-all-three-formats-c-8598991","keywords":null,"creator":["Russell Gould"],"video_url":null,"description":"There’s no end date to Australian captain Meg Lanning’s break from cricket, but there’s been a move towards anointing her successor.","content":"Alyssa Healy has moved a step closer to being Australia’s next captain after being confirmed as vice-captain across all three forms of the game. With no end date in sight for captain Meg Lanning’s break from the game, which has taken in the WBBL and could include an upcoming series against India, Healy now looms as the next skipper. Healy, 32 has been elevated to the role following Rachael Haynes’ retirement from international cricket last month. “It’s a privilege to have been offered the vice-captaincy of any Australian team, let alone one that’s tasted as much success as this one,” Healy said. “Rach played a key role in supporting Meg as well as driving the values and culture of the team and while she leaves big shoes to fill, I’m looking forward to helping lead this side alongside Meg and Shell (coach Shelley Nitschke). “It’s a really exciting time to be involved with this team; we’ve seen personnel changes as well as the emergence of incredible young talent, and with a T20 World Cup and away Ashes just around the corner, I’m looking forward to this next chapter of my career.” Healy has played 232 matches for her country – second only to all-rounder Ellyse Perry – and previously has been vice-captain in a temporary capacity, most recently in 2021. She has captained the NSW Breakers in the Women’s National Cricket League since 2018 and was Sydney Sixers vice-captain in the first seven editions of the Women’s Big Bash League. Should Lanning’s absence continue, Healy could find herself leading Australia in a five-game T20I tour of India in December, home ODIs and T20Is against Pakistan in January, and the 2023 T20 World Cup in South Africa in February. National selector Shawn Flegler said Healy was an “outstanding leader”. “We’re delighted that Alyssa has agreed to take on the role of vice-captain and look forward to the contribution she can make in tandem with Meg,” he said. “Alyssa is an outstanding leader on and off the field and brings a wealth of experience to the role. “We have great confidence in Alyssa, Meg and Shelley leading the team during an exciting 12-month period that will see the team defend its T20 World Cup title and look to retain the Ashes on English soil.”","pubDate":"2022-10-19 21:56:14","image_url":"https://images.perthnow.com.au/publication/C-8598991/817a0091f7fd4cc8c9245d17224a450fb2fa2ec3-16x9-x0y0w2048h1152.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Not his best game': Alan Shearer critical of Tottenham player during Man United loss","link":"https://www.hitc.com/en-gb/2022/10/19/not-his-best-game-alan-shearer-critical-of-tottenham-player-during-man-united-loss/?utm_source=rss&utm_medium=rss&utm_campaign=not-his-best-game-alan-shearer-critical-of-tottenham-player-during-man-united-loss","keywords":["Competitions","Football","Premier League","Teams","Tottenham Hotspur","son heung-min"],"creator":["Amir Mir"],"video_url":null,"description":"Alan Shearer has claimed that Son Heung-min didn’t have his best game during Tottenham Hotspur’s 2-0 defeat to Manchester United at Old Trafford on Wednesday... The post 'Not his best game': Alan Shearer critical of Tottenham player during Man United loss appeared first on HITC.","content":"Alan Shearer has claimed that Son Heung-min didn’t have his best game during Tottenham Hotspur’s 2-0 defeat to Manchester United at Old Trafford on Wednesday night, as he told Amazon Prime Sport. Antonio Conte’s side were blown away by Erik ten Hag’s side, and in truth, if it wasn’t for Hugo Lloris in between the sticks, then this should and could have been a cricket score. Before a ball was kicked, Man United would have been fully aware that Son and Harry Kane were the main threat to this counter-attacking team. Photo by Laurence Griffiths/Getty Images When Spurs are hitting you on the break, that’s when the fear rips through the opposition because they have speed, precision and a ruthless nature to their game. But this ever-progressing Man United team, which lost their opening two Premier League matches under ten Hag, dealt with the north London club from back to front. Son has blown hot and cold this season, from scoring a hat-trick one game, to getting subbed with nothing to his name in another, and at Old Trafford, he had another match to forget. “He’s not had his best game Son up to now, has he?!” said Shearer. “That sort of sums up his game, that cross.” Photo by Tom Purslow/Manchester United via Getty Images PRESSURE AND EXPECTATIONS ON SON Last season, Son produced his best career performance in Spurs colours when he won the Premier League’s Golden Boot award with 23 goals to his name. When you rise so high, then it comes with expectations and Son is finding that out during this current campaign. More is expected of him, and whilst he has had his moments this term, in truth, the consistency levels haven’t been there. The positive Son can take is that Tottenham themselves, in regards to the Premier League table, are still in a strong position, and on other occasions, he is still missing big chances, so it’s not just a case of the player not scoring and also not hardly being seeing during the game. The post 'Not his best game': Alan Shearer critical of Tottenham player during Man United loss appeared first on HITC.","pubDate":"2022-10-19 21:10:00","image_url":null,"source_id":"hitc","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Why Warner won’t expose CA over Sandpapergate","link":"https://www.cairnspost.com.au/sport/cricket/david-warner-autobiography-why-cricket-star-wont-expose-australian-cricket-yet/news-story/2cced117beb22cc0e62712fc749371a5","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"David Warner has signed up to do an autobiography but his manager believes he will spare Australian cricket the brutal ball-tampering expose it has feared for four years.","content":null,"pubDate":"2022-10-19 20:46:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Zampa backs Cummins over sponsorship drama","link":"https://www.cairnspost.com.au/sport/cricket/zampa-backs-cummins-over-sponsorship-drama/video/0358ed25b26d863b0684254478a4f547","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Adam Zampa has back Test and ODI captain Pat Cummins after the Aussie skipper announced he would not appear in anymore advertisements for sponsor Alinta Energy","content":null,"pubDate":"2022-10-19 20:36:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Mai tum logon ko thanda kar hi dun…”: Wasim Akram angrily clears mist of rumours regarding his unavailability during 1996 India vs Pakistan World Cup quarter-final match","link":"https://thesportsrush.com/cricket-news-mai-tum-logon-ko-thanda-kar-hi-dun-wasim-akram-angrily-clears-mist-of-rumours-regarding-his-unavailability-during-1996-india-vs-pakistan-world-cup-quarter-final-match/","keywords":["Cricket","ICC Cricket World Cup 1996","India","Pakistan","Wasim Akram"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Wasim Akram angrily comes up with the reason behind his absence from Pakistan playing XI versus India during 1996 World Cup quarter-final. Passionate Cricket fans in countries like India and Pakistan can really be unforgiving, when their two teams face each other especially during a World Cup contest, and the result isn’t a victory. From… The post “Mai tum logon ko thanda kar hi dun…”: Wasim Akram angrily clears mist of rumours regarding his unavailability during 1996 India vs Pakistan World Cup quarter-final match appeared first on The SportsRush.","content":"Wasim Akram angrily comes up with the reason behind his absence from Pakistan playing XI versus India during 1996 World Cup quarter-final. Passionate Cricket fans in countries like India and Pakistan can really be unforgiving, when their two teams face each other especially during a World Cup contest, and the result isn’t a victory. From Misbah-ul-Haq during the 2007 T20 World Cup, or a Ravichandran Ashwin during the 2014 Asia Cup, players have faced the ire of the fans from across the border, with their emotions not being able to differentiate between a sport and a war. The legendary Pakistan pacer Wasim Akram too, back in 1996 during the ODI World Cup in India, had to face something similar, when the Pakistan fans came out with baseless rumours surrounding his unavailability during the high-octane quarter-final clash against India at the M. Chinnaswamy Stadium, in Bangalore. The team management had not revealed until the eleventh hour that Akram had been ruled out of the second quarter-final clash against India due to a chest strain injury. Wasim Akram angrily explains reason for missing quarter-final clash versus India during 1996 World Cup During an interaction with ‘A Sports‘ alongside other Pakistani cricketers in Shoaib Malik, Misbah-ul-Haq, and Waqar Younis, Wasim Akram angrily flustered while explaining the people who had come up with different versions of the story around his absence from the aforementioned match. The 56-year-old exclaimed that he had picked up a chest strain injury while sweeping to a ball bowled by New Zealand’s Dion Nash three days before the quarter-final match against India. The reason he had not publicly reveal the nature of his injury was because he did not wish the Indian press to pick the story up and hand India the advantage to strategize around this new chink in his team’s armor. “I got injured three days ago against New Zealand. I scored 34 runs. I went down to sweep Dion Nash with the fine leg up, and I suffered an intercostal muscle pull. It took six weeks to completely heal. Waqar is sitting here, the reason we did not reveal it in the press is so that India does not get the confidence going into the match that their main player, the captain is injured,” exclaimed Akram. He also stated that the team physio Dan Kiesel even injected him with six painkillers in the morning of the clash, but to no avail. You have never seen Wasim Akram so angry till date #WasimAkram #PAKvAFG #T20WC2022 pic.twitter.com/ErCLZnlL9z — Muhammad Noman (@nomanedits) October 19, 2022 Ata-ur-Rehman was roped in as Wasim’s replacement in the playing XI that day, and despite him bowling decently well in the contest, Pakistan suffered a 39-run defeat, after failing to chase down the total of 287 posted by India. The post “Mai tum logon ko thanda kar hi dun…”: Wasim Akram angrily clears mist of rumours regarding his unavailability during 1996 India vs Pakistan World Cup quarter-final match appeared first on The SportsRush.","pubDate":"2022-10-19 19:38:34","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PCB says Jay Shah’s statement can ‘split’ cricketing communities, requests ACC to call emergency meeting","link":"https://kashmirreader.com/2022/10/20/pcb-says-jay-shahs-statement-can-split-cricketing-communities-requests-acc-to-call-emergency-meeting/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Lahore: The PCB on Wednesday said BCCI secretary Jay Shah’s statement that India won’t travel to Pakistan for the Asia Cup next year has the potential to split the cricketing communities and requested the Asian Cricket Council (ACC) to convene an emergency meeting on the issue. Shah, after beginning his second stint as BCCI secretary, […]","content":"Lahore: The PCB on Wednesday said BCCI secretary Jay Shah’s statement that India won’t travel to Pakistan for the Asia Cup next year has the potential to split the cricketing communities and requested the Asian Cricket Council (ACC) to convene an emergency meeting on the issue. Shah, after beginning his second stint as BCCI secretary, said India would like to play the continental tournament at a neutral venue and not tour Pakistan. In its first official response to Shah’s statement, the PCB said, “such statements can spilt the Asian and international cricket communities” and impact Pakistan’s visit to India for the 2023 World Cup. Shah, who made the statement after the BCCI AGM on Tuesday, also happens to be the ACC president. “The overall impact of such statements have the potential to split the Asian and international cricketing communities, and can impact Pakistan’s visit to India for the ICC Cricket World Cup 2023 and future ICC Events in India in the 2024-2031 cycle. “The PCB has to date not received any official communication or clarification from the ACC on the statement of the ACC President. As such, the PCB has now requested the Asian Cricket Council to convene an emergency meeting of its Board as soon as practically possible to discuss this important and sensitive matter,” the PCB said. Pakistan has been allotted hosting rights for the Asia Cup which will be held ahead of the ODI World Cup in India in October-November. The T20 Asia Cup held last month had to be shifted from Sri Lanka to the UAE amid the economic crisis in the island nation. The 2018 Asia Cup, scheduled to be held in India, was also moved to the UAE after the BCCI couldn’t procure clearance from government security agencies to host Pakistan. India and Pakistan only play each other in the Asian and the ICC events due to the political tensions between the two countries. India last toured Pakistan in 2008 while Pakistan’s played last series in India in 2012-13. The PCB said Shah’s statement was surprising and disappointing at the same time. “The PCB has noted with surprise and disappointment of yesterday’s comments made by the ACC President Mr Jay Shah with regards to shifting of next year’s Asia Cup to a neutral venue. “The comments were made without any discussion or consultation with the Board of the Asian Cricket Council or the Pakistan Cricket Board (event host) and without any thoughts towards their long-term consequences and implications. “After having presided over the ACC meeting during which Pakistan was awarded the ACC Asia Cup with an overwhelming support and response from the ACC Board Members, Mr Shah’s statement of shifting of the ACC Asia Cup has clearly been made unilaterally,” the PCB said. —PTI The officials from both the PCB and BCCI will be confronted with the issue at the International Cricket Council’s board meeting in Melbourne next month. The ICC is yet to comment on the matter. A top official from an Asian cricketing nation hoped the matter would be sorted amicably and said there is no Asia Cup without India or Pakistan. “It is the biggest match of the Asia Cup and with either team missing, the tournament doesn’t make sense. There is a lot of time left, but I hope the issue is sorted. The neutral venue is the best option if the BCCI decides against sending its team to Pakistan,” the official told PTI. The PCB is also irked because international cricket has resumed in the country with all top nations like England, Australia, West Indies travelling there to play Test and white-ball series in recent years. “This is contrary to the philosophy and spirit for which the Asian Cricket Council was formed in September 1983 a united Asian cricket body to safeguard the interests of the its Members and organise, develop, and promote the game of cricket in Asia,” the PCB added. A PCB source told PTI that the board is ready to play hard ball with the BCCI this time around and will approach the ICC during the meeting in Melbourne. The PCB has also threatened to pull of the ODI World Cup in India if the Asia Cup matter is not resolved. “It would be wrong to say that only Pakistan will be impacted if India and Pakistan don’t play each other in Asia or ICC events. The marquee match creates a sizeable revenue for the ICC and if that doesn’t happen, the other cricketing nations (including the associates) also suffer,” the source said. The ICC tends to put India and Pakistan in the same group in world events, with the game between the two teams drawing a massive television audience and full house at the stadium. Both teams open their T20 World Cup campaign against each other on Sunday. PTI   KR Desk","pubDate":"2022-10-19 19:06:24","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Inter-College Cricket tournament: ICSC lifts summit trophy","link":"https://kashmirreader.com/2022/10/20/inter-college-cricket-tournament-icsc-lifts-summit-trophy/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"SRINAGAR: Islamia College of Science and Commerce (ICSC) comprehensively beat Government Degree College, Baramulla in the finals of Inter-College Cricket tournament played at Kashmir University Cricket ground on Wednesday. ICSC skipper after winning the toss decided to bat first. ICSC lost opener Ghazi Mushtaq early. A match winning partnership of 60 runs between Quanain and […]","content":"SRINAGAR: Islamia College of Science and Commerce (ICSC) comprehensively beat Government Degree College, Baramulla in the finals of Inter-College Cricket tournament played at Kashmir University Cricket ground on Wednesday. ICSC skipper after winning the toss decided to bat first. ICSC lost opener Ghazi Mushtaq early. A match winning partnership of 60 runs between Quanain and Yasir consolidated the things. Quanian scored 42. In the final overs it was again all-rounder Muteeb who played a 12 ball cameo scoring 30 runs smashing the Baramulla bowler to every corner of the park. Chasing a daunting target of 163 runs Govt. Degree College, Baramulla despite flashes of brilliance kept losing wickets at regular intervals, thanks to a brilliant off spin bowling in tandem by Hurrair and Muteeb. Hurrair claimed three wickets while his partner bagged two two wickets respectively. Muteeb was adjudged Man of the Match. The tournament was tournament organized by Physical Education Department of University of Kashmir.   KR Desk","pubDate":"2022-10-19 19:05:24","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cutting eyes mental edge to return to form","link":"https://thewest.com.au/sport/cricket/cutting-eyes-mental-edge-to-return-to-form-c-8598032","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Ben Cutting has spent months working on the mental side of cricket in a bid to return to the form that made him one of Australia's most dangerous allrounders.","content":"Big-hitting Australian allrounder Ben Cutting has revealed how he spent months working with a sports psychologist in a bid to return to his best form. A revitalised Cutting confirmed on Thursday he had inked a new one-year deal with the Sydney Thunder, staying with the Big Bash League club for a third straight season. A peripheral member of Australia's white-ball side between 2013 and 2017, Cutting now plies his trade solely on the T20 circuit but has not played a competitive match since February. The 35-year-old has spent recent months working with sports psychologist Noel Blundell, whose list of past clients includes the likes of Ash Barty, Minjee Lee and Mark Skaife. \"I feel mentally and physically refreshed after not playing cricket over the last few months,\" Cutting said. \"I've used that time to work on the mental side of cricket as much as I have the physical side. \"One of the big things I've gained from working with Noel was the desire to get back to playing my natural game. \"That means playing without the handbrake on; playing without the worry about results or the decisions that are made on the field.\" Cutting scored just 153 runs at an average of 17 in last summer's BBL, fulfilling different roles both at the top of the order and late in the innings. Once renowned for his bowling, he also took just one wicket throughout the Thunder's campaign as he was limited to only 10 overs. As well as working with Blundell, the Queenslander has also spent time training under fellow former Bulls quick Joe Dawes after his exit from the PNG coaching position. \"I believe it is a matter of going out and playing with the same freedom I did as a kid 20-odd years ago,\" he said. \"What I've realised is my role has fluctuated over the last 15 or so years from being a guy who just bowled fast and wanted to take wickets to becoming more of a batter in T20. \"I'm aiming this summer to fuse together my batting and bowling games for Thunder. I want to get them firing.\" Sign up for our emails","pubDate":"2022-10-19 19:04:21","image_url":"https://images.thewest.com.au/publication/C-8598032/519dc324009cac5825c78d1a40cecd75c8462cf4-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Chetan’s fate hangs in balance, Mohanty’s tenure soon to end as BCCI likely to rejig selection panel","link":"https://kashmirreader.com/2022/10/20/chetans-fate-hangs-in-balance-mohantys-tenure-soon-to-end-as-bcci-likely-to-rejig-selection-panel/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: National selection committee chairman Chetan Sharma’s fate hangs in balance as the BCCI could soon rejig the senior panel after the T20 World Cup in Australia. It is an open secret that Chetan and his panel’s performance and consistency in selection has been below par in recent times and unless India performs very […]","content":"New Delhi: National selection committee chairman Chetan Sharma’s fate hangs in balance as the BCCI could soon rejig the senior panel after the T20 World Cup in Australia. It is an open secret that Chetan and his panel’s performance and consistency in selection has been below par in recent times and unless India performs very well, it could be curtains for India’s first hat-trick man in 50 over World Cup. “A lot will depend on how India fares at T20 World Cup. There aren’t too many people who are very happy with Chetan at the moment. But he will remain till BCCI selects the new Cricket Advisory Committee (CAC),” a senior BCCI official said. While it will be an anxious wait for Chetan, East Zone’s Debasish Mohanty in a few months time will have to make way for someone else as he will complete a cumulative four years in junior and senior selection panel. “The rule that was applicable with Abbey Kuruvilla will also apply to Debu Mohanty. Debu was inducted by the COA in junior panel in early 2019 and he had served two years till 2021 before being upgraded to senior panel after Devang Gandhi completed his tenure,” a senior BCCI official told PTI on conditions of anonymity. In a few months, Mohanty will complete his four years, so he will have to move on. Whether he will be relieved of his duties before the completion of four years or after that is the question. However in the East, there aren’t too many eligible Test cricketers, who could be handed over the job. The two names who fit the bill are former opener Shiv Sunder Das of Odisha and Bengal’s Deep Dasgupta. There are news doing rounds that Ranadeb Bose, a junior national selector, could be in the fray but he hasn’t played an official game for India. There is former ODI players Laxmi Ratan Shukla of Bengal and Sanjay Raul of Odisha, who are eligible. Subroto Banerjee, coach of current India pacer Umesh Yadav could also be a candidate. Similarly, after Kuruvilla moved into operational work of BCCI since he had completed four years (including three years in junior panel), the West Zone selection seat has remained vacant which will be needed to be filled up. Last time, Ajit Agarkar had the best and most decorated CV among all applicants but objections from his own state unit Mumbai Cricket Association became a hindrance. The only person, who despite non-performance might survive is Karnataka man and South Zone candidate Sunil Joshi. —PTI KR Desk","pubDate":"2022-10-19 19:03:01","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Josh Hazlewood: ‘I hardly watch any cricket. Do I like it? I like playing it’","link":"https://www.theguardian.com/sport/2022/oct/19/josh-hazlewood-t20-world-cup-australia-cricket","keywords":["T20 World Cup","Australia cricket team","Twenty20","Cricket","Australia sport","Sport"],"creator":["Simon Burnton in Perth"],"video_url":null,"description":"Exclusive: The world’s No 1 T20 bowler spent years away from the format but will be crucial to Australia’s World Cup defenceA smile plays upon the edges of Josh Hazlewood’s mouth. This, to be clear, is not a fleeting reaction to some momentary amusement, but a more or less permanent feature. Over the course of a couple of conversations, one in Canberra and the other a few days later in Brisbane, it is almost always there – the smile of a man who seems to have cracked the T20 code.Hazlewood’s rise in this format has been very recent and bewilderingly rapid. For most of the 31-year-old’s career he was assumed to be terrible at it, and having made his T20 international debut in 2013 he played nine games for his country over the next eight years. Continue reading...","content":"A smile plays upon the edges of Josh Hazlewood’s mouth. This, to be clear, is not a fleeting reaction to some momentary amusement, but a more or less permanent feature. Over the course of a couple of conversations, one in Canberra and the other a few days later in Brisbane, it is almost always there – the smile of a man who seems to have cracked the T20 code. Hazlewood’s rise in this format has been very recent and bewilderingly rapid. For most of the 31-year-old’s career he was assumed to be terrible at it, and having made his T20 international debut in 2013 he played nine games for his country over the next eight years. “I just didn’t play it, to be honest,” he says. Before the first game of Australia’s T20 World Cup defence, against New Zealand on Saturday, the total number of T20s he has played for his country and various franchise teams stands at 89 – fewer than Harry Brook, the 23-year-old who has only recently broken into the England side, and less than half the total of Afghanistan’s Mujeeb Ur Rahman, 10 years his junior. Cricketers free to boycott Aramco sponsorship at T20 World Cup Read more Everything changed in June 2021, when a number of players including the seamers Pat Cummins, Daniel Sams and Jhye Richardson, tired of life inside biosecure bubbles, chose not to take part in Australia’s white-ball tour of West Indies, and Hazlewood stepped in. At that stage he had played 10 T20 matches in the previous five years. Five months later he had won the game’s two biggest prizes, the IPL and the T20 World Cup, and a year later he was officially named the world’s No 1 T20i bowler . His ascent is more remarkable because in a world of rapidly changing time signatures, Hazlewood is a metronome, known most of all for repeatedly landing the ball on an ideal line and length. “I’ve got some changes but not big ones, I don’t think,” he says. “I’m always working on trying to get better ones. You often find guys with strange actions or very fast arms have good changes of pace because they can deceive you, but for a rhythmical bowler like myself changes of pace are going to be hard. It’s just subtle changes here and there.” Throughout those years when the game seemed to have left him behind he never lost faith that he could flourish in the format, but neither did he devote much time to trying to make it happen. “I always thought that if I got a good run at it I could learn on the go and be effective,” he says. “I think if I played a lot of games in a row and wasn’t effective then that’s probably when you’d [think] maybe the format’s gone.” One thing that makes his explosive return to T20s all the more remarkable is that during his time in the wilderness he not only did not train specifically for it, he did not even watch the shorter-form games. “I don’t watch much cricket in general, to be honest,” he says. “If we’re coming up against Sri Lanka down the track I might watch a little bit of their games but usually there’s enough footage to watch in bowling meetings. So yeah, I hardly watch any cricket.” Josh Hazlewood, in action against West Indies at the Gabba earlier this month, concentrates on ‘subtle changes’ to catch batters out. Photograph: Matt Roberts/Getty Images Would he say, then, that he genuinely likes cricket? “I like playing it,” he says. “If there’s a huge game I might switch it on, or if I know someone well who’s playing I might give it a watch, but otherwise I’ll more watch footy, rugby league. I like watching golf. I’ll watch a bit of that.” Once he retires, he says he is likely to leave the sport entirely unless a “very part-time” opportunity takes his fancy. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. In many ways Australia’s journey at the last T20 World Cup was similar to Hazlewood’s, only his took the best part of a decade and his team’s was condensed into a few weeks: initially much fancied, then completely written off, and then, unexpectedly, all-conquering. “I guess you can say that,” he says. “You probably get caught up in the team environment, and the team’s doing all these things and you forget that your role’s actually growing and getting better. The same at Chennai [where he won the IPL] – I felt like I just jumped in halfway through the tournament, jumped on the back of what they were doing, and just played my part. You just get caught up in the team aspect.” Covid perhaps helped with that: being trapped together in bubbles might be boring, but it also helps to forge strong bonds. “That added to our team last year, the success and dynamic, and it’s not going to be the same atmosphere here,” Hazlewood says. “It’s not going to recreate that bubble where we can’t go anywhere, we can’t do anything, we’ve got no families. It was very much a team thing last year – we played a lot of golf, we had a good time and we were always together. We’re still trying to recreate that same atmosphere – it’s still very much fresh in the minds of everyone, and it’s still the nucleus of that team.” Much of this nucleus is also involved in the Test side, and once the World Cup is over they will start to turn their attention to next summer’s Ashes series. Hazlewood says he is “really keen”, having missed most of Australia’s thrashing of England last time out after picking up a side strain in the opening game – “I didn’t see the rest of the series, I just switched off and spent some time with the family” – and is intrigued to see how England’s have changed under Ben Stokes and Brendon McCullum. “Oh, I’ve heard about it,” he says. “But I haven’t seen any of it, really.”","pubDate":"2022-10-19 19:00:33","image_url":"https://i.guim.co.uk/img/media/0342a9b0adccd0b585c65432a2553b09df2a59e3/0_286_5128_3077/master/5128.jpg?width=460&quality=85&auto=format&fit=max&s=b919d84aeab2a9af4a6c78cd6ac31425","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"},{"title":"Timnas Cricket Indonesia Kalahkan Jepang dan Korea Selatan","link":"https://sport.detik.com/sport-lain/d-6358285/timnas-cricket-indonesia-kalahkan-jepang-dan-korea-selatan","keywords":null,"creator":null,"video_url":null,"description":"Timnas Cricket Putra Indonesia tampil gemilang pada laga Kualifikasi Piala Dunia Sub Regional Grup B dengan memetik tiga kemenangan dari total empat laga.","content":"Timnas Cricket Indonesia Kalahkan Jepang dan Korea Selatan Tim Detikcom - Sport Kamis, 20 Okt 2022 01:31 WIB 0 komentar BAGIKAN URL telah disalin Foto: dok. PCI Jakarta - Timnas Cricket Indonesia kalahkan Jepang dan Korea Selatan Tim Nasional (Timnas) Cricket Putra Indonesia tampil gemilang pada laga Kualifikasi Piala Dunia Sub Regional Grup B dengan memetik tiga kemenangan dari total empat laga. Pertandingan ini digelar di Sano International Cricket Ground Jepang,15-19 Oktober 2022. Hal ini merupakan salah satu penampilan terbaik Timnas putra yang dibentuk Pengurus Pusat Persatuan Cricket Indonesia (PP PCI). ADVERTISEMENT SCROLL TO RESUME CONTENT Indonesia berhasil menaklukkan Korea Selatan pada dua laga dengan skor masing-masing 99/7 (Indonesia) vs 98/6 (Korea Selatan) pada tanggal 18 October 2022 serta skor 130/7 (Indonesia) vs 66/10 (Korea Selatan) pada laga awal tanggal 15 October 2022). Di laga ini, pemain Timnas Cricket Putra Indonesia, Padmakar Surve meraih man of the match. Sementara pada partai puncak tanggal 18 Oktober 2022, di hari yang sama dimana Indonesia mengalahkan Korea Selatan, Timnas Cricket Putra Indonesia berhasil menghentikan kedigdayaan tuan rumah Jepang dengan skor meyakinkan 104/4 (Indonesia) vs 103/10 (Jepang). Hasil ini juga menempatkan pemain asal Bali, Edi Guna Artawa menjadi man of the match. Dengan hasil ini, Indonesia dan Jepang sama-sama memetik 3 kemenangan dari total 4 laga. Baca juga: Independence Day 2022 Inspirasi Lahirnya Liga Cricket Putri se-Jabodetabek \"Kita bangga dengan penampilan Pasukan Garuda Muda Indonesia pada turnamen ini serta ini menjadi bekal persiapan kami menuju perhelatan SEA Games 2023 Kamboja dan Asian Games 2023 Habgzhou. Para atlet, Pelatih Nasional, staff dan seluruh tim sudah memberi yang terbaik. Terima kasih juga kepada masyarakat Indonesia yang selalu memberi doa dan dukungan tanpa henti,\" ujar Ketua Harian PP PCI Abhiram S. Yadav. Menurut Abhiram, hasil dari turnamen ini kemudian akan menjadi bahan evaluasi PP PCI dalam mempersiapkan laga-laga internasional dalam rangka membangun prestasi di kancah dunia. \"Kita akan terus berlatih dan berbenah agar dapat memberi yang terbaik bagi bangsa Indonesia,\" jelas Pelatih Timnas Cricket Putra Indonesia, Nuwan Shiroman. Dalam konteks ini, kata Abhiram, PP PCI telah mengidentifikasi talenta atlet sejak tahun 2021 serta telah melakukan perjalanan ke beberapa provinsi untuk melakukan sesi dengan masing-masing talenta yang telah dicatat sehingga menghasilkan long list nama atlet yang kemudian dikumpulkan di Pusat Pelatihan pada tahap pra-seleksi. Tahapan ini dilalui dengan mekanisme seleksi dari 24 atlet, yang kemudian menjadi 17 atlet. Pada akhirnya pada tanggal 10 September 2022 melalui pelatihan dan latih tanding, didapatkan 14 nama atlet putra yang diberangkatkan ke Jepang. \"PCI sangat aktif dan objektif dalam memilih pemain Timnas Cricket Putra Indonesia. Dan turnamen ini membuktikan bahwa proses pengembangan olahraga cricket di Indonesia berjalan dengan baik serta berhasil membawa prestasi internasional. Turnamen ini juga akan mendongkrak ranking Indonesia di dunia,\" tutup General Manager PP PCI, Afie Fiermansyah. Simak Video \" Stadion Kanjuruhan Akan Dibangun Berstandar FIFA, Seperti Manahan Solo \" [Gambas:Video 20detik] (ran/bay) cricket indonesia kriket indonesia 0 komentar BAGIKAN URL telah disalin","pubDate":"2022-10-19 18:31:57","image_url":null,"source_id":"detik","country":["indonesia"],"category":["sports"],"language":"indonesian"},{"title":"‘I died 15 times over two or three days’: The story of how Netherlands coach Ryan Campbell kept fighting","link":"https://www.smh.com.au/sport/cricket/i-died-15-times-over-two-or-three-days-the-story-of-how-netherlands-coach-ryan-campbell-kept-fighting-20221019-p5br6l.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Najma Sambul"],"video_url":null,"description":"Netherlands coach and former WA and Australian cricketer Ryan Campbell is celebrating life and cricket six months after a near-fatal cardiac arrest.","content":"Australian cricketer and Netherlands national cricket coach Ryan Campbell is a man celebrating two things: life and cricket. Earlier this week the Western Australia-born coach reflected on reaching a six-month milestone since his widely publicised cardiac arrest back in April. Netherlands coach Ryan Campbell. Credit: Sabine van Wechem “We just lost Rod Marsh , who was my Cricket Academy coach and I was very close to him, and obviously Shane Warne ,” he said. “I only saw the outpouring of grief afterwards and all the press about me and in all honesty, I just thought I am not anywhere near Rod Marsh or Shane Warne’s position in world cricket, but I think it was just that I was another cricketer in his 50s who’d had these heart issues and I think the world was like ‘what’s going on?’ ” Campbell was at a playground in the UK on a family holiday when he collapsed from a near-fatal cardiac arrest at 50 years old. “I literally keeled over with a cardiac arrest and my wife tells me that I died 15 times or something over the next two or three days, but for some reason I kept coming back and I guess the romantic in me would like to say that I’m not a quitter, and the love of my family and kids kept dragging me back. So, I’m glad I’m still here,” he said. After defying the odds – doctors said there would be a 7 per cent chance of survival – and 21 days in hospital, seven spent in an induced coma, Campbell has become vocal on men’s health and has received thousands of messages of support from strangers and fans across the world. “The amount of people ... saying ’Hi Ryan, I just wanted to thank you because I’m 45 or I’m 50 and I thought I was fit, but when I saw what happened to you, I just went to the doctor and they found something and now I’m gonna get it fixed.” “The amount of people that have come to me and rung me or text me or messaged me on social media, saying ‘Hi Ryan, I just wanted to thank you because I’m 45 or I’m 50 and I thought I was fit, but when I saw what happened to you, I just went to the doctor and they found something and now I’m gonna get it fixed or I’m on some medication,’ ” he said. “We are all not immortal, that’s the one thing that I’ve learned. So please go see your GP get checked out for the sake of your family and for yourself.” On ‘Restart a Heart’, a CPR awareness day last week, Campbell was invited to participate in the Heart of the Nation, the world’s largest CPR Class, founded by Original Yellow Wiggle and fellow cardiac arrest survivor Greg Page. “CPR is something very close to our heart, that myself and my wife did a first aid CPR course in the last three months just so we could help someone,” Campbell said. Campbell takes a catch to dismiss South African great Jacques Kallis while playing for Western Australia. Credit: Getty Images “I’m only here because a girl by the name of Beci Bassett had just finished her CPR course and gave me CPR on the spot and brought me back.” Campbell has been living in the Netherlands with his Dutch wife and two Dutch-speaking children. He will be farewelling his team after this year’s T20 World Cup campaign and five years at the helm. “I’d love to, you know, one day obviously, come home to Australia and I’ve got a seven-year-old and four-year-old who speak fluent Dutch at the moment. I’d love for them to experience living in WA or in Australia by the beach,” he said. The Netherlands will face Sri Lanka on Thursday after claiming victory over the United Arab Emirates and Namibia. The team will need to win Thursday’s match or hope the UAE lose against Namibia to stay in the tournament. “I’m only here because a girl by the name of Beci Bassett had just finished her CPR course and gave me CPR on the spot and brought me back.” A veteran of 98 first-class games, Campbell played two one-day internationals for Australia. Campbell, who has Hong Kong Chinese ancestry through his grandmother, also played for Hong Kong in the 2016 World Twenty20. Campbell will be looking for a new gig, but says for now he’s relishing all parts of life. “I’ve literally had the most wonderful afternoon because I’ve got friends from Las Vegas, from Hong Kong, from Perth, from Melbourne, from Sydney, they’ve all flown into Geelong today to catch up to celebrate me being still here for six months,” he said. “That’s the joy I’m getting at the moment, watching our cricket team, but also spending time with my family and friends here.”","pubDate":"2022-10-19 18:00:00","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stewart twins flay Great Boulder attack in Veterans’ big KBCA win","link":"https://thewest.com.au/news/kalgoorlie-miner/stewart-twins-flay-great-boulder-attack-in-veterans-big-kbca-win-c-8571745","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Brothers Zac and Luke Stewart blasted punishing knocks for Veterans in the second round of the Kalgoorlie-Boulder Cricket Association 2022-23 season.","content":"Hard-hitting twins Zac and Luke Stewart fell just five runs and seven runs short, respectively, of round-two Kalgoorlie-Boulder Cricket Association centuries, but were key figures in delivering Veterans’ first win of 2022-23 on Saturday against Great Boulder. After Veterans opened their innings at 2-16, Zac Stewart flayed the Two Blues’ attack with a masterful 95 underpinned by 14 fours and four sixes. Stewart and No.4 batter Josh Tierney put on 127 runs for the third wicket — Tierney finding the boundary nine times in his 55. Not to be outdone, Luke Stewart adopted similar tactics from the No.5 spot with an aggressive 93 that included seven fours and eight sixes. The trio’s stroke play guided Veterans to an imposing 8-289. Great Boulder were held to 8-139 in reply as Zac Stewart, Akash Powar and Craig McCrystal each grabbed two wickets. Powar led the attack with 2-15 as Great Boulder were dealt a second defeat since joining the competition this season. Also last weekend, Shaun Purcell struck 11 fours and two sixes in his punishing 70 that led Golden City to victory against Hibernians. Opener Bala Thiyagarajan also played well for his 39 among the side’s 6-176. Hibernians’ run chase started disastrously at 6-19 and while Scott Veen defied the attack for long periods with 64, the side was restricted to 120 in 26.2 overs. Veen struck 11 fours, but it was overshadowed by three wickets apiece to Thiru Manickam and Dinesh Fernando. The round finished with St George easily defeating Sunrisers, who were bundled out for 116 in 25 overs after being set 182 to win. St George’s 5-181 was earlier led by Jackson Cooper’s 53. Golden City lead the standings with six points from Veterans, St George and Hibernians, each locked on three points. The ladder is rounded out by Goldrush, Great Boulder and Sunrisers. Round three is on Saturday when Golden City play St George and Goldrush oppose Veterans, both at Shepherdson Park. Hibernians’ clash with Sunrisers is at Morrison Oval, with 1pm start times applying in all fixtures. Sign up for our emails","pubDate":"2022-10-19 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8571745/75e9004551ffe9f2cebbda0a0bc2cd4aa4034a45-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pakistan Cricket Board reschedules T20 series against West Indies; Here's all you need to know","link":"https://www.indiatvnews.com/sports/cricket/pakistan-cricket-board-reschedules-t20-series-against-west-indies-here-s-all-you-need-to-know-2022-10-19-817520","keywords":null,"creator":null,"video_url":null,"description":"The Pakistan Cricket Board has rescheduled its T20 series against the West Indies due to a busy home season. According to the PCB, the cricket boards of both the countries have agreed to postpone the three-match T20I series, which was set to take place in January 2023 in Pakistan.","content":null,"pubDate":"2022-10-19 17:59:53","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"SL vs NED Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s SL vs NED T20 World Cup 2022 match No 9 in Geelong, 930 AM IST, October 20","link":"https://zeenews.india.com/cricket/sl-vs-ned-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-sl-vs-ned-t20-world-cup-2022-match-no-9-in-geelong-930-am-ist-october-20-2524371.html","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka vs Netherlands Dream11 Team Prediction Sri Lanka vs Netherlands T20 World Cup 2022 Match No. 9 Preview - Check My Dream11 Team, Best players list of SL vs NED, Sri Lanka Dream11 Team Player List, Netherlands Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"World Cup fate is on the line for Netherlands and Sri Lanka when they meet at Kardinia Park in the penultimate game in Group A, with both facing the prospect of an early exit from the tournament. Coming into the ICC Men’s T20 World Cup 2022 it had been Sri Lanka who had been making much of the noise on the international stage, winning the Asia Cup and beating some high-calibre opponents in the process. But Dasun Shanaka and his side are now one loss away from World Cup elimination, and know they must almost certainly beat Group A leaders Netherlands on Thursday to make it to the Super 12. Here's how Sri Lanka can still qualify for Super 12 stage of T20 World Cup despite loss to Netherlands Sri Lanka’s opening-match defeat to Namibia is what has left them in such a perilous position, while Netherlands’ win over the same African opponents has left the Dutch sitting pretty at the top of the group on four points. A dominating win! Sri Lanka beat UAE by 79 runs. _ #SLvUAE #RoaringForGlory #T20WorldCup pic.twitter.com/yF5GsKOfuQ — Sri Lanka Cricket __ (@OfficialSLC) October 18, 2022 However, progression is still far from certain for the Netherlands. In fact, a loss may well be enough to send them out of the tournament despite those two wins. It all comes down to net run rate, and that is where the Netherlands are in trouble. Sri Lanka’s crushing win over UAE means that they will go above the Dutch on NRR should they win this game. And then it would all come down to Namibia v UAE in the Group A finale later on Thursday. A win for Namibia in that match would see them knock the Netherlands out in that scenario, as they already have a superior NRR. Should Netherlands win this game then Sri Lanka will be hoping for an enormous favour from UAE, who would need to beat Namibia and very heavily to overturn the NRR differential in Sri Lanka’s favour. Such a mathematical outcome is not impossible but highly improbable. SL vs NED Dream11 Team Prediction Captain: Pathum Nissanka Vice-Captain: Kusal Mendis Suggested Playing XI for SL vs NED Dream11 Fantasy Cricket Wicketkeepers: Kusal Mendis Batters: Vikramjit Singh, Bhanuka Rajapaksa, Pathum Nissanka, Max O’Dowd All-rounders: Wanindu Hasaranga, Bas de Leede Bowlers: Maheesh Theekshana, Fred Klaassen, Pramod Madushan, Tim Pringle SL vs NED Predicted Playing XIs SL Predicted Playing 11 : Kusal Mendis (wk), Pathum Nissanka, Bhanuka Rajapaksa, Danushka Gunathilaka, Charith Asalanka, Dasun Shanaka (c), Wanindu Hasaranga, Maheesh Theekshana, Chamika Karunaratne, Pramod Madushan, Lahiru Kumara NED Predicted Playing 11: Vikramjit Singh, Max O’Dowd, Bas de Leede, Colin Ackermann, Tom Cooper, Scott Edwards (c & wk), Roelof van der Merwe, Tim Pringle, Timm van der Gugten, Fred Klaassen, Paul van Meekeren","pubDate":"2022-10-19 17:46:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Moving Asia Cup venue may impact Pak's visit to India for WC","link":"https://www.thehansindia.com/sports/cricket/moving-asia-cup-venue-may-impact-paks-visit-to-india-for-wc-766050","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"PCB on Wednesday indicated that the possibility of moving the venue for next year's Asia Cup could \"impact\" Pakistan's visit to India for the 2023 Men's ODI World Cup, as well as future ICC events in India in the 2024-31 cycle.","content":"Lahore: The Pakistan Cricket Board (PCB) on Wednesday indicated that the possibility of moving the venue for next year's Asia Cup could \"impact\" Pakistan's visit to India for the 2023 Men's ODI World Cup, as well as future ICC events in India in the 2024-31 cycle. PCB further said that the comments made by Asian Cricket Council (ACC) president and BCCI secretary Jay Shah on Tuesday over shifting next year's Asia Cup to a neutral venue as India would not travel to Pakistan were noted with \"surprise and disappointment\". \"The comments were made without any discussion or consultation with the Board of the Asian Cricket Council or the Pakistan Cricket Board (event host) and without any thoughts towards their long-term consequences and implications. \"After having presided over the ACC meeting during which Pakistan was awarded the ACC Asia Cup with an overwhelming support and response from the ACC Board Members, Shah's statement of shifting of the ACC Asia Cup has clearly been made unilaterally,\" said the PCB in an official statement. The 2023 edition of the Asia Cup, to be held in the 50-over format, had been allotted to Pakistan as per the ICC's Future Tours Programme (FTP). \"This is contrary to the philosophy and spirit for which the Asian Cricket Council was formed in September 1983 -- a united Asian cricket body to safeguard the interests of its Members and organise, develop, and promote the game of cricket in Asia. \"The overall impact of such statements have the potential to split the Asian and international cricketing communities, and can impact Pakistan's visit to India for the ICC Cricket World Cup 2023 and future ICC Events in India in the 2024-2031 cycle,\" added the PCB. PCB also said it has requested for an emergency meeting of the ACC board to discuss the matter. \"The PCB has to date not received any official communication from the ACC on the statement of the ACC President. As such, the PCB has written to the Asian Cricket Council to convene an emergency meeting of its Board as soon as practically possible on this important and sensitive matter.\"","pubDate":"2022-10-19 17:45:41","image_url":"https://assets.thehansindia.com/h-upload/2022/10/19/500x300_1317071-pcb.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: West Indies and Ireland register memorable victories, rewinding day 4","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-west-indies-and-ireland-register-memorable-victories-rewinding-day-4-wi-vs-zim-sco-vs-ire-2022-10-19-817509","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: With every passing day, the World Cup is spicing up a little bit more, the contests are getting tougher and the qualifiers have been a joyride. As far as the minnow teams are considered, they have put up a splendid show and have raised the bar of the marquee cricketing event. As of now eight teams so far are struggling to make it to the Super 12 stage and rub shoulders with the big boys of international cricket. Here is a quick recap of how day 4 went.","content":null,"pubDate":"2022-10-19 17:16:17","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Will use my 50-year experience to help Mumbai cricket: Sandeep Patil","link":"https://www.indiatoday.in/sports/cricket/video/will-use-my-50-year-experience-to-help-mumbai-cricket-says-sandeep-patil-ahead-of-mca-polls-2287412-2022-10-19?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Will use my 50-year experience to help Mumbai cricket: Sandeep Patil","content":"Speaking exclusively to India Today Consulting Editor, Rajdeep Sardesai, former India cricketer Sandeep Patil spoke about his plans for Mumbai cricket as he... The top focus of this episode of Newstrack is on the Congress presidential election. The Congress today elected 'loyalist' Mallikarjun Kharge as its new president, the first non-Gandhi to head the 137-year-old party in 24 years. A school's principal in Farrukhabad chops off a Class 9 student's hair and thrashes her for not coming in with two braids. Isn't it bizarre? The Karnataka Congress launched a new campaign named ‘SayCM’. The campaign aims to highlight the alleged unfulfilled promises of the state's ruling BJP government. The campaign also has a QR code that will take the user to SayCm.com website. Watch this to know more. Finally, after 24 long years, Congress has a non-Gandhi party president in Mallikarjun Kharge. A staunch Gandhi family loyalist from Karnataka, the 80-year-old leader defeated Shashi Tharoor in an electoral contest by bagging nearly 84 per cent of votes in the party presidential election.","pubDate":"2022-10-19 16:59:39","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC T20 world cup qualifiers 2022 points table: T20 World Cup group stage points table","link":"https://thesportsrush.com/cricket-news-icc-t20-world-cup-qualifiers-2022-points-table-t20-world-cup-group-stage-points-table/","keywords":["Cricket","ICC T20 World Cup 2022","Points Table"],"creator":["Gurpreet Singh"],"video_url":null,"description":"ICC T20 world cup qualifiers 2022 points table: Barring UAE, rest of the teams in the qualifying stage have at least one win to their name. With just a couple of days remaining to mark the end to the ongoing group stage of the T20 World Cup 2022, the contests so far have witnessed a… The post ICC T20 world cup qualifiers 2022 points table: T20 World Cup group stage points table appeared first on The SportsRush.","content":"ICC T20 world cup qualifiers 2022 points table: Barring UAE, rest of the teams in the qualifying stage have at least one win to their name. With just a couple of days remaining to mark the end to the ongoing group stage of the T20 World Cup 2022, the contests so far have witnessed a neck-to-neck battle, with seven of the eight teams still in contention for the four spots in the ‘Super 12’ stage of the tournament. For those unaware, a total of four teams will join the eight teams in the next stage of the World Cup, which will commence from October 22 onwards, when defending champions Australia will face New Zealand at the Sydney Cricket Ground. The first two days of the ongoing group stage witnessed 2014 World Cup champion Sri Lanka and two-time champion West Indies suffering one-sided defeats against Namibia and Scotland respectively. While both Sri Lanka and West Indies returned with comprehensive victories in their second match, Scotland and Namibia faced defeat in their next contest. With one match each remaining for each of the eight teams, barring UAE (who have lost both their matches), a win for the other teams in the final group stage will almost book their berth in the ‘Super 12’ stage, with the Net Run Rate (NRR) also likely to come into play. ICC T20 world cup qualifiers 2022 points table From ‘Group B’, all the four teams – Scotland, Zimbabwe, West Indies, and Ireland have 2 points under their belt with one win and a loss each. However, Scotland (+0.759) and Zimbabwe (0.000) are presently placed at the top owing to a better Net run rate (NRR) than the Windies and Ireland, who have a negative NRR. West Indies will face Ireland, while Scotland will take on Zimbabwe next, to determine the two spots for the next stage. From ‘Group A’, Netherlands with 4 points have all but confirmed their place in the ‘Super 12’, unless they suffer a massive defeat versus Sri Lanka on Thursday. Namibia, on the other hand, will go through with a win against UAE in their last group stage match on Thursday as well. T20 World Cup 2022 group stage points table Group B Team Mat Won Lost Tied NR Pts NRR Scotland 2 1 1 0 0 2 0.759 Zimbabwe 2 1 1 0 0 2 0.000 West Indies 2 1 1 0 0 2 -0.275 Ireland 2 1 1 0 0 2 -0.468 Group A Team Mat Won Lost Tied NR Pts NRR Netherlands 2 2 0 0 0 4 +0.149 Namibia 2 1 1 0 0 2 +1.277 Sri Lanka 2 1 1 0 0 2 +0.600 UAE 2 0 2 0 0 0 -2.028   The post ICC T20 world cup qualifiers 2022 points table: T20 World Cup group stage points table appeared first on The SportsRush.","pubDate":"2022-10-19 16:51:06","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“You can never take New Zealand lightly”: Adam Zampa aware of New Zealand threat in T20 World Cup 2022 opener","link":"https://thesportsrush.com/cricket-news-you-can-never-take-new-zealand-lightly-adam-zampa-aware-of-new-zealand-threat-in-t20-world-cup-2022-opener/","keywords":["Cricket","Adam Zampa","Australia","ICC T20 World Cup 2022","New Zealand"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Adam Zampa aware of New Zealand threat: The Australian spinner expressed consciousness of their next opponent’s capabilities. Trans-Tasman neighbors Australia and New Zealand have a total of three things in common ahead of their first ICC T20 World Cup 2022 match against each other on Saturday. Also going to be the first Super 12 match… The post “You can never take New Zealand lightly”: Adam Zampa aware of New Zealand threat in T20 World Cup 2022 opener appeared first on The SportsRush.","content":"Adam Zampa aware of New Zealand threat: The Australian spinner expressed consciousness of their next opponent’s capabilities. Trans-Tasman neighbors Australia and New Zealand have a total of three things in common ahead of their first ICC T20 World Cup 2022 match against each other on Saturday. Also going to be the first Super 12 match of this World Cup, Australia vs New Zealand Sydney T20I will be played on the back of both these teams losing their last warm-up match, last T20I and last T20I series. Set to be played after almost a year of their clash in ICC T20 World Cup 2021 final in Dubai, it will be their third T20I at the Sydney Cricket Ground. Set to play a T20I at this venue after four and a half years, New Zealand will be looking to register their maiden victory here in the shortest format. Adam Zampa aware of New Zealand threat in T20 World Cup 2022 opener Although having never lost a home T20I to the Black Caps, Australia spinner Adam Zampa has spoken strictly against taking them lightly ahead of an all-important match. Hailing New Zealand’s bowling attack, Zampa believes that even chasing a moderate target can be challenging. “The thing about New Zealand is that they’re always in the contest. They’re the kind of team that will scratch their way to 165. And they’ve got a great bowling attack that can defend it. So, we understand that when we’re up against New Zealand, it’s never easy, they’re always in the game,” Zampa said in a video posted by cricket.com.au. Zampa, who has picked six wickets in eight T20Is at an average of 32.83, an economy rate of 8.38 and a strike rate of 23.5 against New Zealand, referred to an example from their previous World Cup final. “You saw last year in the World Cup. I think we had them 55/1 [57/1] after 10 [overs]. And thought even if they get a few here, we’re only chasing 150-160 but they got themselves to 170 [172/4]. So, you can never take New Zealand lightly,” Zampa added. The post “You can never take New Zealand lightly”: Adam Zampa aware of New Zealand threat in T20 World Cup 2022 opener appeared first on The SportsRush.","pubDate":"2022-10-19 16:50:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Time thing is a really difficult one to manage”: Ashton Agar suggests innovative hack to tackle ICC new rule around slow over rate penalty","link":"https://thesportsrush.com/cricket-news-time-thing-is-a-really-difficult-one-to-manage-ashton-agar-suggests-innovative-hack-to-tackle-icc-new-rule-around-slow-over-rate-penalty/","keywords":["Cricket","ashton agar","Australia","Over Rate"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ashton Agar suggests innovative hack: The Australian all-rounder has suggested a manner in which all reserve players could also be utilized while fielding. First announced over nine months ago but implemented only recently, new over rate rule in T20Is has already started to show its presence on cricket grounds. With teams bearing the brunt of… The post “Time thing is a really difficult one to manage”: Ashton Agar suggests innovative hack to tackle ICC new rule around slow over rate penalty appeared first on The SportsRush.","content":"Ashton Agar suggests innovative hack: The Australian all-rounder has suggested a manner in which all reserve players could also be utilized while fielding. First announced over nine months ago but implemented only recently, new over rate rule in T20Is has already started to show its presence on cricket grounds. With teams bearing the brunt of needing to field in the death overs with an additional fielder inside the 30-yard circle in Asia Cup 2022, fielding captains proactively make an effort to bowl 20 overs inside the stipulated time period to avoid a significant penalty. As a result, bowlers are often seen running back to their bowling mark in order to save time in the ongoing ICC T20 World Cup. Additionally, the bowlers are assisted by fielders who also make a dedicated effort to save time. Ashton Agar suggests innovative hack to tackle ICC new rule around slow over rate penalty If Australia all-rounder Ashton Agar is to be believed, an innovative hack can be implemented to save time in white-ball cricket especially in the shortest format. In fact, Australia have already started implementing this tactic in their recently concluded T20Is. Speaking in a video posted by cricket.com.au this morning, Agar explained how reserve players can be stationed all around the ground to return the ball in a bid to save time. Agar, in particular, pointed out about the powerplay where most of the fielders have to run towards the boundary to fetch the ball. Admitting that the same might only save a little time, it still has a lot of scope considering how even a minute saved can aid a fielding team in a crunch situation. “In the powerplay, obviously, the ball flies around and you lose time when players have to go and fetch the ball which is a part of cricket. So, the time thing is a really difficult one to manage,” Agar told cricket.com.au. “So, I guess stationing the guys who are on the bench around the ground. Does it save to 10 seconds here and there? Potentially. And that all ends up at the end of the day.” The post “Time thing is a really difficult one to manage”: Ashton Agar suggests innovative hack to tackle ICC new rule around slow over rate penalty appeared first on The SportsRush.","pubDate":"2022-10-19 16:06:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: All you need to know about Melbourne Cricket Ground","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-all-you-need-to-know-about-melbourne-cricket-ground-ind-vs-pak-india-vs-pakistan-2022-10-19-817488","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The stage is set for the biggest clash of the year. It is time to paint the sky blue and green. It is time for India and Pakistan to clash and set the tone for the ongoing T20 World Cup. Australia will clash with New Zealand in the World Cup opener, but it is the Indo-Pak clash that will witness tempers flaring and emotions running high. Rohit Sharma's team India will take on Babar Azam's Pakistan on October 23, 2022, at the mighty Melbourne Cricket Ground (MCG).","content":null,"pubDate":"2022-10-19 15:28:22","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Il Cricket e lo Snowboard più importanti della Ferrari? L’incredibile classifica Usa","link":"https://www.tuttosport.com/news/formula-1/2022/10/19-98696441/il_cricket_e_lo_snowboard_piu_importanti_della_ferrari_l_incredibile_classifica_usa/","keywords":["F1","ferrari","leclerc"],"creator":null,"video_url":null,"description":"I piloti della Rossa indietro nella graduatoria stilata da \"SportsPro 50 MM\"","content":null,"pubDate":"2022-10-19 14:26:53","image_url":"https://cdn.tuttosport.com/img/800/600/2022/10/19/161903502-1431bdbb-dcb8-4cd4-be23-e9b775d8e4ba.jpg","source_id":"tuttosport","country":["italy"],"category":["sports"],"language":"italian"},{"title":"Cricket-England&#039;s Topley out of T20 World Cup with ankle injury","link":"https://www.thestar.com.my/sport/cricket/2022/10/19/cricket-england039s-topley-out-of-t20-world-cup-with-ankle-injury","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England seamer Reece Topley has been ruled out of the Twenty20 World Cup in Australia due to ligament damage to his left ankle, the country's cricket board (ECB) said on Wednesday. Read full story","content":null,"pubDate":"2022-10-19 13:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/10/19/1783487.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"The Spin | Azeem Rafiq’s own failings do not give Yorkshire CCC any high ground","link":"https://www.theguardian.com/sport/2022/oct/19/azeem-rafiq-yorkshire-ccc-cricket-the-spin","keywords":["Sport","Cricket"],"creator":["Andy Bull"],"video_url":null,"description":"Poisonous situation has seen some refuse to let their club be accused by a man they can level their own accusations back atSeptember a decade ago, and Yorkshire were playing Essex in the last round of County Championship. In March, at the season’s start, Geoffrey Boycott had been elected club president. “The only thing that really matters to the membership is that Yorkshire do well in championship cricket,” Boycott said then. The club’s sesquicentenary was coming up in 2013. “In our anniversary year we should be striving to win the championship. We cannot do that in the second division, we have got to get out of it.” The onus, Boycott said, was on the young players. “They have to perform, they have to help to get promotion.”Yorkshire needed 19 points from this last game to do it. But Essex had a strong attack, and soon Yorkshire were 166 for six. That brought Azeem Rafiq to the wicket. He was 21, with a handful of first class matches behind him. He was one of those kids Boycott had been talking about. In just under three hours, he made 53 from 130 balls, with just a single four, and led the team to 312. When Essex batted, Rafiq removed three of their top five. In Yorkshire’s second innings, they were 111 for six, and the match was back in the balance. Rafiq made an unbeaten 75, in an innings that all but sealed their promotion. Then on the last day he made sure of it by taking five for 50. Yorkshire won by 239 runs. Continue reading...","content":"S eptember a decade ago, and Yorkshire were playing Essex in the last round of County Championship. In March, at the season’s start, Geoffrey Boycott had been elected club president. “The only thing that really matters to the membership is that Yorkshire do well in championship cricket,” Boycott said then. The club’s sesquicentenary was coming up in 2013. “In our anniversary year we should be striving to win the championship. We cannot do that in the second division, we have got to get out of it.” The onus, Boycott said, was on the young players. “They have to perform, they have to help to get promotion.” Yorkshire needed 19 points from this last game to do it. But Essex had a strong attack, and soon Yorkshire were 166 for six. That brought Azeem Rafiq to the wicket. He was 21, with a handful of first class matches behind him. He was one of those kids Boycott had been talking about. In just under three hours, he made 53 from 130 balls, with just a single four, and led the team to 312. When Essex batted, Rafiq removed three of their top five. In Yorkshire’s second innings, they were 111 for six, and the match was back in the balance. Rafiq made an unbeaten 75, in an innings that all but sealed their promotion. Then on the last day he made sure of it by taking five for 50. Yorkshire won by 239 runs. Azeem Rafiq to receive extra security at ECB’s Yorkshire hearing after threats Read more Rafiq was Yorkshire’s leading run-scorer and their leading wicket-taker in that match. His teammate Joe Root, who would make his England debut that same winter, won the breakthrough player of the year, but Rafiq got plenty of credit too. “He has the brilliant attribute for a spinner of being able to beat the bat on both sides,” said Darren Gough. “He is a tough, naturally aggressive batsman, too, and will make a good captain at some stage.” He had already led the team in T20 cricket. “It is perhaps premature talk,” reported Cricinfo, “but he might just be Graeme Swann’s spin-bowling successor in the England team.” Back then Rafiq was, in the simple sort of terms we like using in the sports pages, a hero, one of the “young guns” the Yorkshire Post promised could “launch a legacy of domination”. Looking back at the start of this story makes its end all the more miserable. Rafiq’s time at Yorkshire has ended in a bonfire of allegations and counter-allegations about who said and did what, to whom, and when. The latest were published in the Daily Mail last week, when Rafiq was accused of using antisemitic slurs, homophobic language, and of fat-shaming and swearing at young children. He has strongly denied all this. He says it is “categorically untrue” and that they are part of a “never-ending, coordinated campaign of lies” against him. Rafiq has previously admitted using antisemitic language. He has apologised for it and done his best to make amends. Rafiq has never made himself out to be blameless. He’s said more than once that he is “ashamed” by some of his past behaviour. Seen in one light, this only illuminates what the culture at Yorkshire was like at the time. Rafiq was, after all, one of the best and brightest young players on their books. His own behaviour can be understood as a reflection of the environment he found himself growing up in, a response to the harassment and abuse he suffered, and a reaction to the institutional racism he encountered . It doesn’t make his own experiences of racism any less true or hurtful, or diminish the fault of the people responsible. What it does do is help explain why the situation has become so poisonous. There are people in Yorkshire cricket who refuse to let the club be accused by a man they could level their own accusations back at, who won’t allow that he could both be badly flawed and still have been badly failed by the club. The Cricket Discipline Commission hearings into what went on at Yorkshire start soon. Photograph: Mike Egerton/PA You could read it in the letter signed by members of Yorkshire’s staff last year, which spoke about the “kind of individual he was whilst at the club” and “the endless episodes of Azeem’s behaviour, well-known to the club, which reflect on him as a person well before he decided to accuse the club, staff and players of any wrongdoing.” The letter went on: “We find it difficult to comprehend how this part of Azeem’s character has not been released or at least used by the club in its defence.” Those members of staff were subsequently sacked, a decision that exacerbated the very same grievances they were articulating. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. This isn’t a straightforward story of heroes, villains, and victims – life away from the playing field rarely is. If you’ve been following it, you will have seen repeated Chaucer’s old proverb about people who live in glass houses, the point of the cliche being, of course, that everything will end up broken in the end. It is going to get worse. The Cricket Discipline Commission hearings into what went on at Yorkshire start soon. The Independent Commission for Equity in Cricket is due to publish its report early next year. English cricket has got itself in a godawful mess over this one case. The ICEC promises to address over 4,000 of them. There is an iceberg on the near horizon. This is an extract from the Guardian’s weekly cricket email, The Spin. To subscribe, just visit this page and follow the instructions .","pubDate":"2022-10-19 13:39:26","image_url":"https://i.guim.co.uk/img/media/61e90d8e52438a34493eaf823b6fcfde7352041b/768_227_1952_1172/master/1952.jpg?width=460&quality=85&auto=format&fit=max&s=446936556baf9d95ae567f55d4b8ef4d","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Cricket-England's Topley out of T20 World Cup with ankle injury","link":"https://www.channelnewsasia.com/sport/cricket-englands-topley-out-t20-world-cup-ankle-injury-3015521","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide Best News Website or Mobile Service Digital Media Awards Worldwide (Reuters) -England seamer Reece Topley has been ruled out of the Twenty20 World Cup in Australia due to ligament damage to his left ankle, the country's cricket board (ECB) said on Wednesday. The 28-year-old will be replaced by fellow left-arm fast bowler Tymal Mills, who was travelling with the squad as a reserve player. Topley, who has picked up 22 wickets in as many T20 games, sustained the injury during a fielding drill ahead of England's warm-up game against Pakistan in Brisbane on Monday. \"Results of the scan on Tuesday in Perth revealed the injury,\" the ECB said in a statement, adding that Lancashire's Luke Wood has been added as a travelling reserve. England, T20 World Cup champions in 2010, open their campaign against Afghanistan in Perth on Saturday. Sri Lanka have also been forced to make two changes to their squad, with Kasun Rajitha coming in for Dushmantha Chameera after the pace spearhead was sidelined due to a torn calf muscle while Ashen Bandara replaces the injured Danushka Gunathilaka. The United Arab Emirates have drafted in Fahad Nawaz following a foot fracture to paceman Zawar Farid. Sri Lanka face Group A leaders Netherlands in their last Super 12 qualifier on Thursday and the UAE take on Namibia.","pubDate":"2022-10-19 13:39:03","image_url":"https://onecms-res.cloudinary.com/image/upload/s--jUF0XnjU--/c_fill,h_900,w_1600/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/v1/one-cms/core/2022-10-19t133903z_1_lynxmpei9i0jh_rtroptp_3_cricket-odi-eng-zaf.jpg?itok=Q22SbGoi","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"“It’s been a while since we’ve won the World Cup”: Rohit Sharma determined to do lot of things right to win ICC T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-its-been-a-while-since-weve-won-the-world-cup-rohit-sharma-determined-to-do-lot-of-things-right-to-win-icc-t20-world-cup-2022/","keywords":["Cricket","ICC T20 World Cup 2022","India","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma determined to do lot of things right: The Indian captain wants to focus on one match at a time during this World Cup. Following the abandonment of their second official warm-up match against New Zealand at the Gabba today, India will enter the Super 12 stage with a victory to their name in… The post “It’s been a while since we’ve won the World Cup”: Rohit Sharma determined to do lot of things right to win ICC T20 World Cup 2022 appeared first on The SportsRush.","content":"Rohit Sharma determined to do lot of things right: The Indian captain wants to focus on one match at a time during this World Cup. Following the abandonment of their second official warm-up match against New Zealand at the Gabba today, India will enter the Super 12 stage with a victory to their name in their last match against hosts and defending champions Australia at the same venue on Sunday. In addition to winning their latest practice match, India have also won their last two T20I series in the build-up to the world event although in completely different conditions. That being said, captain Rohit Sharma and his men would be confident on the back of doing well in whatever was in their hands. While a warm-up match against New Zealand would’ve given India an opportunity to allow fast bowler Mohammed Shami bowl his full quota of four overs for the first time after illness, weather gods in Brisbane had completely different plans for the day. Set to face arch-rivals Pakistan for the third time in 2022, India will kick-start their Super 12 campaign at the Melbourne Cricket Ground on Sunday. Realizing the importance and craze of an India-Pakistan match, Sharma laid emphasis on keeping themselves “relaxed” before an exciting blockbuster following across the globe. “Whenever we play Pakistan, it’s always a blockbuster. People want to come out and watch and feel the atmosphere more than anything else,” Sharma said in a video posted by BCCI (Board of Control for Cricket in India). “Obviously, want to enjoy the cricket as well. It’s pretty exciting. For us as players, of course, it is a big game. We want to keep ourselves quite relaxed and focus on what we need to do as individuals. That is to be the key for us.” Rohit Sharma determined to do lot of things right to win ICC T20 World Cup 2022 Champion of the inaugural T20 World Cup 15 years ago, most of host broadcaster (in India) Star Sports Network’s campaign for this World Cup is based around ending a wait of a T20 World Cup. Acknowledging the same, Sharma mentioned that the motive of the Indian cricket team is to lift the trophy in Melbourne next month. However, the 35-year old player didn’t want to think a lot about the future especially with five Super 12 matches to be played in the near future. India, who had failed to qualify for ICC T20 World Cup 2021 knockouts, wouldn’t want to put on display a debacle for the second time in a row. “It’s been a while since we’ve won the World Cup. Obviously, the whole motive and thought process is to win the World Cup. But we know [that] we need to do a lot of things right to get there. One step at a time for us. You really cannot think about semis and final from now onwards. Our focus will be to prepare well against each team and make sure [that] we move in the right direction,” Sharma added. The post “It’s been a while since we’ve won the World Cup”: Rohit Sharma determined to do lot of things right to win ICC T20 World Cup 2022 appeared first on The SportsRush.","pubDate":"2022-10-19 13:22:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mumbai cricket should win, says Patil ahead of MCA elections","link":"https://www.indiatoday.in/sports/cricket/story/mumbai-cricket-association-elections-sandeep-patil-interview-2287325-2022-10-19?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Mumbai cricket should win, says Patil ahead of MCA elections","content":null,"pubDate":"2022-10-19 12:41:25","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"}]}