{"newsArray":[{"title":"Novak Djokovic will not play at Miami Open after being denied entry to US","link":"http://island.lk/novak-djokovic-will-not-play-at-miami-open-after-being-denied-entry-to-us/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"World number one Novak Djokovic has failed in his bid to play at next week’s Miami Open after being denied entry to the United States. The 22-time Grand Slam winner had applied for special permission to enter the US because he is not vaccinated against Covid-19. The US requires international visitors to be vaccinated and […]","content":"Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:42:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Fifa drops Visit Saudi sponsorship for 2023 Women’s World Cup","link":"http://island.lk/fifa-drops-visit-saudi-sponsorship-for-2023-womens-world-cup/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the […]","content":"Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:40:55","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Conway 78 gives New Zealand the honours on weather-affected opening day","link":"http://island.lk/conway-78-gives-new-zealand-the-honours-on-weather-affected-opening-day-2/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his […]","content":"In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:40:45","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Tim Paine retires from domestic cricket","link":"http://island.lk/tim-paine-retires-from-domestic-cricket/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took […]","content":"Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports) Published on By Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka","pubDate":"2023-03-17 23:40:41","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"News24.com | East London weather deals blow to Proteas plans, but Duminy says selection won't change much","link":"https://www.news24.com/sport/Cricket/Proteas/east-london-weather-deals-blow-to-proteas-plans-but-duminy-says-selection-wont-change-much-20230317","keywords":null,"creator":null,"video_url":null,"description":"Proteas batting coach JP Duminy, in not so many words, confirmed they won’t be tinkering too much with their planned match-day 11 for Saturday's second ODI against the West Indies.","content":"At Buffalo Park, East London Proteas batting coach JP Duminy, in not so many words, confirmed they won’t be tinkering too much with their planned match-day 11 for Saturday's second ODI against the West Indies. The intermittent rain that blighted the first ODI on Thursday was nowhere to be seen on Friday, with a moderate breeze and more than comfortable heat not only allowing the playing surface and the square to dry out, but also seeing the ground in decent enough shape for the Proteas to practice on. Without giving away names, even though the one of Tony de Zorzi popped up in the lead-up question, Duminy said they would be treading a similar selection path for Saturday match at Buffalo Park. READ | First ODI washout denies Temba's Proteas momentum as warhorses are primed for combat The entire squad took part in Friday's training session, with the likely pace attack taking shape in the forms of Lungi Ngidi and Marco Jansen. The duo practiced extensively with bowling coach Rory Kleinveldt before Andile Phehlukwayo, Wayne Parnell, Lizaad Williams and Sisanda Magala joined them later in the piece. \"The great thing about where we stand is that there's a plan in place and the net has widened somewhat in terms of opportunities for the guys,\" Duminy said. \"Yes, there would have been one or two debuts if there was a game on Thursday and there's a likelihood that things will be similar going into the game on Saturday. READ | Key World Cup leadup task for Walter: Keep Quinny hungry \"I think the important part is that we plan, and we cover our important bases. Importantly, can we find the right combinations going forward in the next couple of months going into World Cup? \"That's what we need to see.\" The cancellation of the first ODI due to the weather left the Proteas with only two games to make use of in preparation for the month-end World Cup qualifiers against the Netherlands. One fewer game meant the Proteas need to press home any selectorial and tactical advantages that the weather and completed games will allow them. Duminy admitted the weather messed with their plans, but theirs is to adapt to whatever unfolds in front of them. READ | Dane van Niekerk confirms Proteas retirement, ends stellar career on tumultuous note \"We may need to shuffle and, from time to time, there may be a fork in the road that may force us to go in a different direction,\" Duminy said. \"If we can communicate well within the group and to stakeholders in terms of what that plan is, I think that's the important part. \"The execution is going to be important, but the plan is in place. The weather did throw a spanner in the works, especially in the first game, so we'll have to shuffle around going forward.\"","pubDate":"2023-03-17 21:15:50","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Indian tormentor strikes AGAIN as huge ‘turning point’ triggers horror Aussie collapse","link":"https://www.foxsports.com.au/cricket/steve-smith-prepares-for-odi-captaincy-return-as-australia-sweats-on-wounded-david-warner/news-story/9d1ef7d9950845e2c7d44f8ab6f4ec24","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul and Ravindra Jadeja stood calm in a tricky chase of 189 to steer India to a five-wicket win over Australia in the first one-day international on Friday.","content":"KL Rahul and Ravindra Jadeja stood calm in a tricky chase of 189 to steer India to a five-wicket win over Australia in the first one-day international on Friday. Australia were bowled out for 188 in 35.4 overs after a dramatic collapse following opener Mitchell Marsh’s 65-ball 81 in Mumbai. MATCH CENTRE: India vs Australia first ODI scorecard, stats Watch Australia’s Tour of India. Every ODI live & ad-break free during play on Kayo. New to Kayo? Start your free trial now > India were in trouble at 39-4 before Rahul (75 not out) took stock and an unbeaten 108-run sixth-wicket stand with Jadeja (45 not out) ensured the hosts secured victory in 39.5 overs. The hosts lead the three-match series 1-0 with the two teams warming up for the 50-over World Cup later this year in India. Stand-in-skipper Hardik Pandya praised Jadeja, who also claimed two wickets with his left-arm spin and took a stunning catch to be named man of the match, and Rahul for their calmness. “The way KL and Jaddu (Jadeja) finished it off and the way they batted, gave us the confidence,” said Pandya. “It was very relaxing outside watching them bat.” Fast bowlers Mohammed Shami and Mohammed Siraj took three wickets each after Australia lost their way from 129-2 following India’s decision to field first. MUMBAI, INDIA - MARCH 17: Ravindra Jadeja of India and KL Rahul of India celebrate their victory. Source: Getty Images The Australian innings turned on its head after Marsh, who is playing as a specialist batsman after recovering from an ankle injury, departed in the 20th over. He put on 72 runs for the second wicket with skipper Steve Smith and smashed 10 fours and five sixes to take the wind out of the Indian bowlers. Marsh reached his fifty with a boundary and another four took Australia past 100 before he fell to Jadeja in his attempt to go after the left-arm spinner and was caught. - Rocked at Wankhede - Australia suddenly faltered as Shami, with help from Jadeja and Siraj, ripped through the rest of the Australian order. “We weren’t expecting this when we rocked up here,” Smith said of the low-scoring match at the usually run-filled Wankhede Stadium. “India bowled well this morning, but we probably left a few (runs) out there.” Josh Inglis, who donned the wicketkeeping gloves after Alex Carey was ruled out sick, looked good in his knock of 26 before being bowled by Shami. Shami then sent back Cameron Green (12) and Marcus Stoinis (5) to break the back of the opposition batting. Australia's Josh Inglis is clean bowled. Source: AFP Australia’s pace spearhead Mitchell Starc hurt India early in the chase with three wickets after Stoinis trapped opener Ishan Kishan lbw for three. Starc, a left-arm quick, then struck with successive deliveries to send back Virat Kohli (4) and Suryakumar Yadav (0) -- both lbw. Rahul, who recently lost his place to Shubman Gill in the final two Tests against Australia after an extended batting slump, played out the hat-trick ball but Starc dismissed Gill for 20. Rahul and Pandya, who made his debut as ODI captain in the absence of regular skipper Rohit Sharma, put on 44 runs. Pandya fell to Stoinis on 25 but Rahul stood firm with Jadeja, who hit the winning runs. Rahul reached his 13th ODI fifty and then changed gears as he hit Adam Zampa for a four and six as India won with more than 10 overs to spare. The second ODI is on Sunday in Visakhapatnam Re-live all the action in our live blog below. Can’t see the blog? CLICK HERE","pubDate":"2023-03-17 21:00:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"PSL 2023: बाबर आजम का सपना टूटा, शाहीन अफरीदी की लाहौर कलंदर्स और मुल्तान के बीच होगा फाइनल","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/psl-2023-babar-azam-peshawar-zalmi-knocked-out-by-shaheen-afridi-lahore-qalandar/articleshow/98741034.cms","keywords":null,"creator":null,"video_url":null,"description":"PSL 2023: पाकिस्तान सुपर लीग के दूसरे एलिमिनेटर में डिफेंडिंग चैंपियन लाहौर कलंदर्स ने पेशावर जाल्मी को हराते हुए फाइनल में एंट्री मार ली। फाइनल में मुल्तान सुल्तांस पहले ही पहुंच चुकी है।","content":"बाबर आजम की कप्तानी वाली पेशावर जाल्मी का पाकिस्तान सुपर लीग के फाइनल में पहुंचने का सपना टूट गया। गद्दाफी स्टेडियम में शुक्रवार रात खेले गए एलिमिनेटर-2 में शाहिद अफरीदी वाली लाहौर कलंदर्स को जीत हासिल हुई। अब डिफेंडिंग चैंपियन लाहौर का खिताबी मुकाबला आज रात इसी मैदान पर मुल्तान सुल्तांस से होगा। मैच में पेशावर ने टॉस जीतकर पहले बैटिंग करते हुए पांच विकेट पर 171 रन बनाए। जवाब में लाहौर ने सात गेंद पहले ही चार विकेट से मैदान मार लिया। कप्तान बाबर आजम ने 36 गेंद में 42 रन बनाए तो तीसरे नंबर पर उतरे मोहम्मद हारिस के बल्ले से 54 गेंद में 85 रन निकले। लाहौर की ओर से ओपनर मिर्जा बेग ने सबसे ज्यादा 54 रन बनाए। हार के बाद बाबर आजम काफी मायूस नजर आए। पेशावर जाल्मी के मैंटॉर डैरेन सैमी उन्हें दिलासा देते देखे, जिसका वीडियो भी इंटरनेट पर वायरल हो रहा है।","pubDate":"2023-03-17 18:46:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Great Boulder, Lake View both unchanged for EGCA grand final","link":"https://thewest.com.au/news/kalgoorlie-miner/great-boulder-lake-view-both-unchanged-for-egca-grand-final-c-10069434","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Great Boulder and Lake View clash in the Eastern Goldfields Cricket Association’s A-grade decider on Saturday.","content":null,"pubDate":"2023-03-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-10069434/ebd90ea06a719e486ba31a9ffa6a18947a876027-16x9-x0y209w4000h2250.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"श्रेयस अय्यर IPL 2023 में खेलेंगे या नहीं? अभी करना होगा इंतजार, 10 दिन बाद होगा फैसला","link":"https://hindi.news18.com/news/sports/cricket-shreyas-iyer-advised-10-days-rest-call-on-availability-for-ipl-yet-to-be-taken-report-5570635.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL 2023: भारत के स्टार खिलाड़ी श्रेयस अय्यर के आगामी इंडियन प्रीमियर लीग में खेलने की स्थिति के बारे में अभी कोई जानकारी नहीं है. पीठ की चोट के कारण ऑस्ट्रेलिया के खिलाफ चौथे टेस्ट से हटने वाले श्रेयस अय्यर को मौजूदा वनडे सीरीज से भी बाहर हैं. श्रेयस अय्यर कोलकाता नाइट राइडर्स के कप्तान हैं, जो अभी भी अपनी फिटनेस स्थिति का इंतजार कर रहे हैं. अपनी चोट को लेकर आए नए अपडेट के मुताबिक श्रेयस को अपनी सही स्थिति जानने के लिए 10 दिनों तक इंतजार करना होगा.","content":"श्रेयस अय्यर के IPL में खेलने के फैसले के लिए 10 दिन का इंतजार करना होगा (PIC: AP) मुंबई. भारत के मिडिल ऑर्डर के बैटर श्रेयस अय्यर को 10 दिन आराम की सलाह दी गई है. उनकी आईपीएल 2023 के लिए उपलब्धता के बारे में फैसला अभी कोई नहीं लिया गया है. श्रेयस अय्यर की पीठ की चोट ऑस्ट्रेलिया के खिलाफ अहमदाबाद टेस्ट के दौरान फिर से उभर आई थी, जिसके बाद वह पूरा अहमदाबाद टेस्ट नहीं खेले थे. इसके बाद उन्हें ऑस्ट्रेलिया के खिलाफ 3 मैचों की वनडे सीरीज से भी बाहर होना पड़ा था. मीडिया में ऐसी कई रिपोर्ट्स सामने आ रही थीं कि श्रेयस अय्यर आईपीएल 2023 से भी बाहर हो गए हैं. लेकिन ताजा रिपोर्ट के मुताबिक, श्रेयस के आईपीएल में खेलने का फैसला 10 दिन बाद लिया जा सकता है. क्रिकबज में एक रिपोर्ट के अनुसार, श्रेयस अय्यर को स्पाइन विशेषज्ञ डॉ. अभय नेने से मिलने के बाद अपनी सही स्थिति के बारे में जानने के लिए 10 दिन इंतजार करना होगा. रिपोर्ट में साथ ही कहा गया है कि श्रेयस अय्यर पर किए गए टेस्ट काफी अच्छे नहीं हैं, लेकिन उन्हें आधिकारिक तौर पर आईपीएल से बाहर नहीं किया गया है. पति के लिए गोल्ड मेडलिस्ट ने छोड़ा करियर, रंग लाया बलिदान, महान बल्लेबाज ने माना- बीवी बिना नहीं होता कामयाब श्रेयस अय्यर के प्रारंभिक स्कैन के रिजल्टअच्छे नहीं पाए जाने के कारण उन्हें अहमदाबाद टेस्ट से हटा लिया गया था. अपने होमटाउन मुंबई लौटने के बाद श्रेयस अय्यर ने डॉ. अभय नेने से अपनी चोट के बारे में बातचीत की थी. डॉ. नेने लीलावती अस्पताल में स्पेशलिस्ट हैं और स्पाइन की परेशानियों को देखते हैं. भारतीय दिग्गज की पहली कमाई 2 रुपये, मंगल बाजार में बेचे नाड़े, नेशनल टीवी पर किया था खुलासा समझा जाता है कि डॉ. अभय नेने ने श्रेयस अय्यर को सलाह दी है कि वह सामान्य प्रक्रिया से गुजरें यानी आराम और रिहैब करें. उन्होंने श्रेयस अय्यर को 10 दिन बाद आने को कहा है. रिपोर्ट के अनुसार, श्रेयस अय्यर अगले कुछ दिनों में अपने तत्काल और दीर्घकालीन भविष्य के बारे में जान पाएंगे. रिपोर्ट में यह भी कहा गया है कि कोलकाता नाइट राइडर्स (KKR), जिसके अय्यर कप्तान हैं, खुद को उस स्थिति के लिए तैयार कर रहे हैं. यदि श्रेयस अय्यर प्रतियोगिता के लिए उपलब्ध नहीं होते हैं तो सुनील नरेन कप्तानी के लिए संभावित उम्मीदवार हैं. लेकिन श्रेयस अय्यर के उपलब्ध न होने की स्थिति में फ्रेंचाइजी दूसरी दिशा में भी देख सकती है. रिपोर्ट के अनुसार टीम अगले कुछ दिनों में कोलकाता में एकत्र होगी और श्रेयस अय्यर पर पूर्ण स्पष्टता मिल जाने के बाद नए कप्तान का फैसला किया जाएगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: India vs Australia , IPL 2023 , Kolkata Knight Riders , Shreyas iyer इस देश में आम आदमी की है मौज, जरूरतमंदों पर खूब खर्च करती है सरकार, संपन्न देशों जैसा है हाल बड़ी स्क्रीन के साथ लॉन्च हुई Fastrack की नई वॉच, हेल्थ और फिटनेस का भी रखेगी ख्याल, कीमत 1,695 रुपये अंग्रेजी में थोड़ा कच्‍चा था रोहित का साथी, वाइफ बनी पर्सनल ‘कोच’, झटपट बना गया जेंटलमैन","pubDate":"2023-03-17 17:51:49","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/shreyas-iyer-odi-paractice-16763001743x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: &#039;हम पूरे मैच में दबाव में थे, लेकिन...&#039; हार्दिक पंड्या ने बताई जीत की 2 वजह","link":"https://hindi.news18.com/news/sports/cricket-hardik-pandya-happy-with-kl-rahul-ravindra-jadeja-allround-show-against-australia-in-1st-odi-5570649.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India vs Australia ODI: भारत ने ऑस्ट्रेलिया को पहले वनडे में 5 विकेट से हरा दिया. हार्दिक पंड्या के वनडे कप्तानी के डेब्यू भी जीत से आगाज हुआ. हार्दिक ने कहा कि मैं अपनी बल्लेबाजी और गेंदबाजी से खुश हूं और खासतौर पर जिस तरह से रवींद्र जडेजा और केएल राहुल ने खेल दिखाया, वो सुकून देने वाला रहा.","content":"हार्दिक पंड्या ने बताया कि क्यों टीम इंडिया ऑस्ट्रेलिया के खिलाफ पहला वनडे जीती. (AP) मुंबई. भारत ने ऑस्ट्रेलिया को मुंबई वनडे में 5 विकेट से हरा दिया. भारत ने 189 रन के टारगेट को 39.5 ओवर में ही हासिल कर लिया. पहले वनडे में 5 विकेट से मिली जीत के बाद हार्दिक पंड्या ने केएल राहुल और रवींद्र जडेजा की तारीफ करते हुए कहा कि उनकी बल्लेबाजी सुकून देने वाली थी. खराब फॉर्म के कारण आस्ट्रेलिया के खिलाफ तीसरे और चौथे टेस्ट से बाहर रहे राहुल ने नाबाद 75 और जडेजा ने नाबाद 45 रन बनाये . कार्यवाहक कप्तान पंड्या ने कहा, “मैं हमारे प्रदर्शन से बहुत खुश हूं. जड्डू (जडेजा ) ने आठ महीने बाद वापसी करके शानदार प्रदर्शन किया. मुझे अपनी गेंदबाजी और बल्लेबाजी में मजा आया. लेकिन जड्डू और राहुल की बल्लेबाजी सुकून देने वाली थी. हम दोनों पारियों में दबाव में थे, लेकिन हमने संयम नहीं खोया और विषम परिस्थितियों से बाहर निकले.लय हासिल करने के बाद हमने उसे गंवाया नहीं.” वापसी पर ऐसा प्रदर्शन बोनस की तरह: जडेजा प्लेयर आफ द मैच जडेजा ने कहा कि घुटने के ऑपरेशन के कारण आठ महीने बाद लौटकर वह प्रारूप के अनुरूप ढलने की कोशिश में थे और यह प्रदर्शन बोनस की तरह रहा. उन्होंने कहा कि हम टेस्ट क्रिकेट खेल रहे थे और वनडे में मैने लंबे समय बाद वापसी की. मैं अच्छी गेंदबाजी की कोशिश कर रहा था. आस्ट्रेलियाई कप्तान स्टीव स्मिथ ने कहा कि इस विकेट पर 260-270 रन बनने चाहिए थे. जडेजा ने आगे कहा कि हमने इस तरह के प्रदर्शन की उम्मीद नहीं की थी. भारत ने उम्दा गेंदबाजी की. हम अगर 250 रन बनाते तो मैच में बने रह सकते थे. विकेट से तेज गेंदबाजों को काफी मदद मिली. हार्दिक का वनडे में धमाकेदार कप्तानी डेब्यू, मुश्किल में जिगरी यार ने ठोका अर्धशतक, भारत ने बनाई बढ़त VIDEO: मोहम्मद शमी का तूफान…कंगारुओं की ली जान! एक-एक रन के लिए तरसाया, 15 गेंद में कहर बरपाया ऑस्ट्रेलिया ने इस मैच में भारत को 189 रन का लक्ष्य दिया था. भारत ने 61 गेेंद रहते 5 विकेट खोकर इस टारगेट को हासिल कर लिया. भारत की जीत के हीरो केएल राहुल और रवींद्र जडेजा रहे. केएल राहुल ने 75 और जडेजा ने 45 रन ठोके. दोनों के बीच छठे विकेट के लिए नाबाद 108 रन की साझेदारी हुई. इससे पहले, मोहम्मद शमी और मोहम्मद सिराज ने 3-3 विकेट झटके थे. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Hardik Pandya , India vs Australia , KL Rahul , Ravindra jadeja , Team india बड़ी स्क्रीन के साथ लॉन्च हुई Fastrack की नई वॉच, हेल्थ और फिटनेस का भी रखेगी ख्याल, कीमत 1,695 रुपये अंग्रेजी में थोड़ा कच्‍चा था रोहित का साथी, वाइफ बनी पर्सनल ‘कोच’, झटपट बना गया जेंटलमैन 3 डबल सेंचुरी जमाने वाले धाकड़ की दूसरे वनडे में एंट्री, जीत के बाद भी 2 बदलाव पक्के, युवा बैटर का कटेगा पत्ता","pubDate":"2023-03-17 17:47:35","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/HARDIK-PANDYA-AP-16790750803x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Novak Djokovic will not play at Miami Open after being denied entry to US","link":"http://island.lk/novak-djokovic-will-not-play-at-miami-open-after-being-denied-entry-to-us/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"World number one Novak Djokovic has failed in his bid to play at next week’s Miami Open after being denied entry to the United States. The 22-time Grand Slam winner had applied for special permission to enter the US because he is not vaccinated against Covid-19. The US requires international visitors to be vaccinated and […]","content":"Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:42:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Fifa drops Visit Saudi sponsorship for 2023 Women’s World Cup","link":"http://island.lk/fifa-drops-visit-saudi-sponsorship-for-2023-womens-world-cup/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the […]","content":"Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:40:55","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Conway 78 gives New Zealand the honours on weather-affected opening day","link":"http://island.lk/conway-78-gives-new-zealand-the-honours-on-weather-affected-opening-day-2/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his […]","content":"In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:40:45","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Tim Paine retires from domestic cricket","link":"http://island.lk/tim-paine-retires-from-domestic-cricket/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took […]","content":"Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports) Published on By Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka","pubDate":"2023-03-17 23:40:41","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"News24.com | East London weather deals blow to Proteas plans, but Duminy says selection won't change much","link":"https://www.news24.com/sport/Cricket/Proteas/east-london-weather-deals-blow-to-proteas-plans-but-duminy-says-selection-wont-change-much-20230317","keywords":null,"creator":null,"video_url":null,"description":"Proteas batting coach JP Duminy, in not so many words, confirmed they won’t be tinkering too much with their planned match-day 11 for Saturday's second ODI against the West Indies.","content":"At Buffalo Park, East London Proteas batting coach JP Duminy, in not so many words, confirmed they won’t be tinkering too much with their planned match-day 11 for Saturday's second ODI against the West Indies. The intermittent rain that blighted the first ODI on Thursday was nowhere to be seen on Friday, with a moderate breeze and more than comfortable heat not only allowing the playing surface and the square to dry out, but also seeing the ground in decent enough shape for the Proteas to practice on. Without giving away names, even though the one of Tony de Zorzi popped up in the lead-up question, Duminy said they would be treading a similar selection path for Saturday match at Buffalo Park. READ | First ODI washout denies Temba's Proteas momentum as warhorses are primed for combat The entire squad took part in Friday's training session, with the likely pace attack taking shape in the forms of Lungi Ngidi and Marco Jansen. The duo practiced extensively with bowling coach Rory Kleinveldt before Andile Phehlukwayo, Wayne Parnell, Lizaad Williams and Sisanda Magala joined them later in the piece. \"The great thing about where we stand is that there's a plan in place and the net has widened somewhat in terms of opportunities for the guys,\" Duminy said. \"Yes, there would have been one or two debuts if there was a game on Thursday and there's a likelihood that things will be similar going into the game on Saturday. READ | Key World Cup leadup task for Walter: Keep Quinny hungry \"I think the important part is that we plan, and we cover our important bases. Importantly, can we find the right combinations going forward in the next couple of months going into World Cup? \"That's what we need to see.\" The cancellation of the first ODI due to the weather left the Proteas with only two games to make use of in preparation for the month-end World Cup qualifiers against the Netherlands. One fewer game meant the Proteas need to press home any selectorial and tactical advantages that the weather and completed games will allow them. Duminy admitted the weather messed with their plans, but theirs is to adapt to whatever unfolds in front of them. READ | Dane van Niekerk confirms Proteas retirement, ends stellar career on tumultuous note \"We may need to shuffle and, from time to time, there may be a fork in the road that may force us to go in a different direction,\" Duminy said. \"If we can communicate well within the group and to stakeholders in terms of what that plan is, I think that's the important part. \"The execution is going to be important, but the plan is in place. The weather did throw a spanner in the works, especially in the first game, so we'll have to shuffle around going forward.\"","pubDate":"2023-03-17 21:15:50","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Indian tormentor strikes AGAIN as huge ‘turning point’ triggers horror Aussie collapse","link":"https://www.foxsports.com.au/cricket/steve-smith-prepares-for-odi-captaincy-return-as-australia-sweats-on-wounded-david-warner/news-story/9d1ef7d9950845e2c7d44f8ab6f4ec24","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul and Ravindra Jadeja stood calm in a tricky chase of 189 to steer India to a five-wicket win over Australia in the first one-day international on Friday.","content":"KL Rahul and Ravindra Jadeja stood calm in a tricky chase of 189 to steer India to a five-wicket win over Australia in the first one-day international on Friday. Australia were bowled out for 188 in 35.4 overs after a dramatic collapse following opener Mitchell Marsh’s 65-ball 81 in Mumbai. MATCH CENTRE: India vs Australia first ODI scorecard, stats Watch Australia’s Tour of India. Every ODI live & ad-break free during play on Kayo. New to Kayo? Start your free trial now > India were in trouble at 39-4 before Rahul (75 not out) took stock and an unbeaten 108-run sixth-wicket stand with Jadeja (45 not out) ensured the hosts secured victory in 39.5 overs. The hosts lead the three-match series 1-0 with the two teams warming up for the 50-over World Cup later this year in India. Stand-in-skipper Hardik Pandya praised Jadeja, who also claimed two wickets with his left-arm spin and took a stunning catch to be named man of the match, and Rahul for their calmness. “The way KL and Jaddu (Jadeja) finished it off and the way they batted, gave us the confidence,” said Pandya. “It was very relaxing outside watching them bat.” Fast bowlers Mohammed Shami and Mohammed Siraj took three wickets each after Australia lost their way from 129-2 following India’s decision to field first. MUMBAI, INDIA - MARCH 17: Ravindra Jadeja of India and KL Rahul of India celebrate their victory. Source: Getty Images The Australian innings turned on its head after Marsh, who is playing as a specialist batsman after recovering from an ankle injury, departed in the 20th over. He put on 72 runs for the second wicket with skipper Steve Smith and smashed 10 fours and five sixes to take the wind out of the Indian bowlers. Marsh reached his fifty with a boundary and another four took Australia past 100 before he fell to Jadeja in his attempt to go after the left-arm spinner and was caught. - Rocked at Wankhede - Australia suddenly faltered as Shami, with help from Jadeja and Siraj, ripped through the rest of the Australian order. “We weren’t expecting this when we rocked up here,” Smith said of the low-scoring match at the usually run-filled Wankhede Stadium. “India bowled well this morning, but we probably left a few (runs) out there.” Josh Inglis, who donned the wicketkeeping gloves after Alex Carey was ruled out sick, looked good in his knock of 26 before being bowled by Shami. Shami then sent back Cameron Green (12) and Marcus Stoinis (5) to break the back of the opposition batting. Australia's Josh Inglis is clean bowled. Source: AFP Australia’s pace spearhead Mitchell Starc hurt India early in the chase with three wickets after Stoinis trapped opener Ishan Kishan lbw for three. Starc, a left-arm quick, then struck with successive deliveries to send back Virat Kohli (4) and Suryakumar Yadav (0) -- both lbw. Rahul, who recently lost his place to Shubman Gill in the final two Tests against Australia after an extended batting slump, played out the hat-trick ball but Starc dismissed Gill for 20. Rahul and Pandya, who made his debut as ODI captain in the absence of regular skipper Rohit Sharma, put on 44 runs. Pandya fell to Stoinis on 25 but Rahul stood firm with Jadeja, who hit the winning runs. Rahul reached his 13th ODI fifty and then changed gears as he hit Adam Zampa for a four and six as India won with more than 10 overs to spare. The second ODI is on Sunday in Visakhapatnam Re-live all the action in our live blog below. Can’t see the blog? CLICK HERE","pubDate":"2023-03-17 21:00:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"PSL 2023: बाबर आजम का सपना टूटा, शाहीन अफरीदी की लाहौर कलंदर्स और मुल्तान के बीच होगा फाइनल","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/psl-2023-babar-azam-peshawar-zalmi-knocked-out-by-shaheen-afridi-lahore-qalandar/articleshow/98741034.cms","keywords":null,"creator":null,"video_url":null,"description":"PSL 2023: पाकिस्तान सुपर लीग के दूसरे एलिमिनेटर में डिफेंडिंग चैंपियन लाहौर कलंदर्स ने पेशावर जाल्मी को हराते हुए फाइनल में एंट्री मार ली। फाइनल में मुल्तान सुल्तांस पहले ही पहुंच चुकी है।","content":"बाबर आजम की कप्तानी वाली पेशावर जाल्मी का पाकिस्तान सुपर लीग के फाइनल में पहुंचने का सपना टूट गया। गद्दाफी स्टेडियम में शुक्रवार रात खेले गए एलिमिनेटर-2 में शाहिद अफरीदी वाली लाहौर कलंदर्स को जीत हासिल हुई। अब डिफेंडिंग चैंपियन लाहौर का खिताबी मुकाबला आज रात इसी मैदान पर मुल्तान सुल्तांस से होगा। मैच में पेशावर ने टॉस जीतकर पहले बैटिंग करते हुए पांच विकेट पर 171 रन बनाए। जवाब में लाहौर ने सात गेंद पहले ही चार विकेट से मैदान मार लिया। कप्तान बाबर आजम ने 36 गेंद में 42 रन बनाए तो तीसरे नंबर पर उतरे मोहम्मद हारिस के बल्ले से 54 गेंद में 85 रन निकले। लाहौर की ओर से ओपनर मिर्जा बेग ने सबसे ज्यादा 54 रन बनाए। हार के बाद बाबर आजम काफी मायूस नजर आए। पेशावर जाल्मी के मैंटॉर डैरेन सैमी उन्हें दिलासा देते देखे, जिसका वीडियो भी इंटरनेट पर वायरल हो रहा है।","pubDate":"2023-03-17 18:46:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Great Boulder, Lake View both unchanged for EGCA grand final","link":"https://thewest.com.au/news/kalgoorlie-miner/great-boulder-lake-view-both-unchanged-for-egca-grand-final-c-10069434","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Great Boulder and Lake View clash in the Eastern Goldfields Cricket Association’s A-grade decider on Saturday.","content":null,"pubDate":"2023-03-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-10069434/ebd90ea06a719e486ba31a9ffa6a18947a876027-16x9-x0y209w4000h2250.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"श्रेयस अय्यर IPL 2023 में खेलेंगे या नहीं? अभी करना होगा इंतजार, 10 दिन बाद होगा फैसला","link":"https://hindi.news18.com/news/sports/cricket-shreyas-iyer-advised-10-days-rest-call-on-availability-for-ipl-yet-to-be-taken-report-5570635.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL 2023: भारत के स्टार खिलाड़ी श्रेयस अय्यर के आगामी इंडियन प्रीमियर लीग में खेलने की स्थिति के बारे में अभी कोई जानकारी नहीं है. पीठ की चोट के कारण ऑस्ट्रेलिया के खिलाफ चौथे टेस्ट से हटने वाले श्रेयस अय्यर को मौजूदा वनडे सीरीज से भी बाहर हैं. श्रेयस अय्यर कोलकाता नाइट राइडर्स के कप्तान हैं, जो अभी भी अपनी फिटनेस स्थिति का इंतजार कर रहे हैं. अपनी चोट को लेकर आए नए अपडेट के मुताबिक श्रेयस को अपनी सही स्थिति जानने के लिए 10 दिनों तक इंतजार करना होगा.","content":"श्रेयस अय्यर के IPL में खेलने के फैसले के लिए 10 दिन का इंतजार करना होगा (PIC: AP) मुंबई. भारत के मिडिल ऑर्डर के बैटर श्रेयस अय्यर को 10 दिन आराम की सलाह दी गई है. उनकी आईपीएल 2023 के लिए उपलब्धता के बारे में फैसला अभी कोई नहीं लिया गया है. श्रेयस अय्यर की पीठ की चोट ऑस्ट्रेलिया के खिलाफ अहमदाबाद टेस्ट के दौरान फिर से उभर आई थी, जिसके बाद वह पूरा अहमदाबाद टेस्ट नहीं खेले थे. इसके बाद उन्हें ऑस्ट्रेलिया के खिलाफ 3 मैचों की वनडे सीरीज से भी बाहर होना पड़ा था. मीडिया में ऐसी कई रिपोर्ट्स सामने आ रही थीं कि श्रेयस अय्यर आईपीएल 2023 से भी बाहर हो गए हैं. लेकिन ताजा रिपोर्ट के मुताबिक, श्रेयस के आईपीएल में खेलने का फैसला 10 दिन बाद लिया जा सकता है. क्रिकबज में एक रिपोर्ट के अनुसार, श्रेयस अय्यर को स्पाइन विशेषज्ञ डॉ. अभय नेने से मिलने के बाद अपनी सही स्थिति के बारे में जानने के लिए 10 दिन इंतजार करना होगा. रिपोर्ट में साथ ही कहा गया है कि श्रेयस अय्यर पर किए गए टेस्ट काफी अच्छे नहीं हैं, लेकिन उन्हें आधिकारिक तौर पर आईपीएल से बाहर नहीं किया गया है. पति के लिए गोल्ड मेडलिस्ट ने छोड़ा करियर, रंग लाया बलिदान, महान बल्लेबाज ने माना- बीवी बिना नहीं होता कामयाब श्रेयस अय्यर के प्रारंभिक स्कैन के रिजल्टअच्छे नहीं पाए जाने के कारण उन्हें अहमदाबाद टेस्ट से हटा लिया गया था. अपने होमटाउन मुंबई लौटने के बाद श्रेयस अय्यर ने डॉ. अभय नेने से अपनी चोट के बारे में बातचीत की थी. डॉ. नेने लीलावती अस्पताल में स्पेशलिस्ट हैं और स्पाइन की परेशानियों को देखते हैं. भारतीय दिग्गज की पहली कमाई 2 रुपये, मंगल बाजार में बेचे नाड़े, नेशनल टीवी पर किया था खुलासा समझा जाता है कि डॉ. अभय नेने ने श्रेयस अय्यर को सलाह दी है कि वह सामान्य प्रक्रिया से गुजरें यानी आराम और रिहैब करें. उन्होंने श्रेयस अय्यर को 10 दिन बाद आने को कहा है. रिपोर्ट के अनुसार, श्रेयस अय्यर अगले कुछ दिनों में अपने तत्काल और दीर्घकालीन भविष्य के बारे में जान पाएंगे. रिपोर्ट में यह भी कहा गया है कि कोलकाता नाइट राइडर्स (KKR), जिसके अय्यर कप्तान हैं, खुद को उस स्थिति के लिए तैयार कर रहे हैं. यदि श्रेयस अय्यर प्रतियोगिता के लिए उपलब्ध नहीं होते हैं तो सुनील नरेन कप्तानी के लिए संभावित उम्मीदवार हैं. लेकिन श्रेयस अय्यर के उपलब्ध न होने की स्थिति में फ्रेंचाइजी दूसरी दिशा में भी देख सकती है. रिपोर्ट के अनुसार टीम अगले कुछ दिनों में कोलकाता में एकत्र होगी और श्रेयस अय्यर पर पूर्ण स्पष्टता मिल जाने के बाद नए कप्तान का फैसला किया जाएगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: India vs Australia , IPL 2023 , Kolkata Knight Riders , Shreyas iyer इस देश में आम आदमी की है मौज, जरूरतमंदों पर खूब खर्च करती है सरकार, संपन्न देशों जैसा है हाल बड़ी स्क्रीन के साथ लॉन्च हुई Fastrack की नई वॉच, हेल्थ और फिटनेस का भी रखेगी ख्याल, कीमत 1,695 रुपये अंग्रेजी में थोड़ा कच्‍चा था रोहित का साथी, वाइफ बनी पर्सनल ‘कोच’, झटपट बना गया जेंटलमैन","pubDate":"2023-03-17 17:51:49","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/shreyas-iyer-odi-paractice-16763001743x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: &#039;हम पूरे मैच में दबाव में थे, लेकिन...&#039; हार्दिक पंड्या ने बताई जीत की 2 वजह","link":"https://hindi.news18.com/news/sports/cricket-hardik-pandya-happy-with-kl-rahul-ravindra-jadeja-allround-show-against-australia-in-1st-odi-5570649.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India vs Australia ODI: भारत ने ऑस्ट्रेलिया को पहले वनडे में 5 विकेट से हरा दिया. हार्दिक पंड्या के वनडे कप्तानी के डेब्यू भी जीत से आगाज हुआ. हार्दिक ने कहा कि मैं अपनी बल्लेबाजी और गेंदबाजी से खुश हूं और खासतौर पर जिस तरह से रवींद्र जडेजा और केएल राहुल ने खेल दिखाया, वो सुकून देने वाला रहा.","content":"हार्दिक पंड्या ने बताया कि क्यों टीम इंडिया ऑस्ट्रेलिया के खिलाफ पहला वनडे जीती. (AP) मुंबई. भारत ने ऑस्ट्रेलिया को मुंबई वनडे में 5 विकेट से हरा दिया. भारत ने 189 रन के टारगेट को 39.5 ओवर में ही हासिल कर लिया. पहले वनडे में 5 विकेट से मिली जीत के बाद हार्दिक पंड्या ने केएल राहुल और रवींद्र जडेजा की तारीफ करते हुए कहा कि उनकी बल्लेबाजी सुकून देने वाली थी. खराब फॉर्म के कारण आस्ट्रेलिया के खिलाफ तीसरे और चौथे टेस्ट से बाहर रहे राहुल ने नाबाद 75 और जडेजा ने नाबाद 45 रन बनाये . कार्यवाहक कप्तान पंड्या ने कहा, “मैं हमारे प्रदर्शन से बहुत खुश हूं. जड्डू (जडेजा ) ने आठ महीने बाद वापसी करके शानदार प्रदर्शन किया. मुझे अपनी गेंदबाजी और बल्लेबाजी में मजा आया. लेकिन जड्डू और राहुल की बल्लेबाजी सुकून देने वाली थी. हम दोनों पारियों में दबाव में थे, लेकिन हमने संयम नहीं खोया और विषम परिस्थितियों से बाहर निकले.लय हासिल करने के बाद हमने उसे गंवाया नहीं.” वापसी पर ऐसा प्रदर्शन बोनस की तरह: जडेजा प्लेयर आफ द मैच जडेजा ने कहा कि घुटने के ऑपरेशन के कारण आठ महीने बाद लौटकर वह प्रारूप के अनुरूप ढलने की कोशिश में थे और यह प्रदर्शन बोनस की तरह रहा. उन्होंने कहा कि हम टेस्ट क्रिकेट खेल रहे थे और वनडे में मैने लंबे समय बाद वापसी की. मैं अच्छी गेंदबाजी की कोशिश कर रहा था. आस्ट्रेलियाई कप्तान स्टीव स्मिथ ने कहा कि इस विकेट पर 260-270 रन बनने चाहिए थे. जडेजा ने आगे कहा कि हमने इस तरह के प्रदर्शन की उम्मीद नहीं की थी. भारत ने उम्दा गेंदबाजी की. हम अगर 250 रन बनाते तो मैच में बने रह सकते थे. विकेट से तेज गेंदबाजों को काफी मदद मिली. हार्दिक का वनडे में धमाकेदार कप्तानी डेब्यू, मुश्किल में जिगरी यार ने ठोका अर्धशतक, भारत ने बनाई बढ़त VIDEO: मोहम्मद शमी का तूफान…कंगारुओं की ली जान! एक-एक रन के लिए तरसाया, 15 गेंद में कहर बरपाया ऑस्ट्रेलिया ने इस मैच में भारत को 189 रन का लक्ष्य दिया था. भारत ने 61 गेेंद रहते 5 विकेट खोकर इस टारगेट को हासिल कर लिया. भारत की जीत के हीरो केएल राहुल और रवींद्र जडेजा रहे. केएल राहुल ने 75 और जडेजा ने 45 रन ठोके. दोनों के बीच छठे विकेट के लिए नाबाद 108 रन की साझेदारी हुई. इससे पहले, मोहम्मद शमी और मोहम्मद सिराज ने 3-3 विकेट झटके थे. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Hardik Pandya , India vs Australia , KL Rahul , Ravindra jadeja , Team india बड़ी स्क्रीन के साथ लॉन्च हुई Fastrack की नई वॉच, हेल्थ और फिटनेस का भी रखेगी ख्याल, कीमत 1,695 रुपये अंग्रेजी में थोड़ा कच्‍चा था रोहित का साथी, वाइफ बनी पर्सनल ‘कोच’, झटपट बना गया जेंटलमैन 3 डबल सेंचुरी जमाने वाले धाकड़ की दूसरे वनडे में एंट्री, जीत के बाद भी 2 बदलाव पक्के, युवा बैटर का कटेगा पत्ता","pubDate":"2023-03-17 17:47:35","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/HARDIK-PANDYA-AP-16790750803x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Novak Djokovic will not play at Miami Open after being denied entry to US","link":"http://island.lk/novak-djokovic-will-not-play-at-miami-open-after-being-denied-entry-to-us/","keywords":["Sports"],"creator":["Priyan"],"video_url":null,"description":"World number one Novak Djokovic has failed in his bid to play at next week’s Miami Open after being denied entry to the United States. The 22-time Grand Slam winner had applied for special permission to enter the US because he is not vaccinated against Covid-19. The US requires international visitors to be vaccinated and […]","content":"Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:42:48","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Fifa drops Visit Saudi sponsorship for 2023 Women’s World Cup","link":"http://island.lk/fifa-drops-visit-saudi-sponsorship-for-2023-womens-world-cup/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the […]","content":"Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:40:55","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Conway 78 gives New Zealand the honours on weather-affected opening day","link":"http://island.lk/conway-78-gives-new-zealand-the-honours-on-weather-affected-opening-day-2/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his […]","content":"In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka Published on By Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports)","pubDate":"2023-03-17 23:40:45","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Tim Paine retires from domestic cricket","link":"http://island.lk/tim-paine-retires-from-domestic-cricket/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took […]","content":"Former Australia captain Tim Paine has retired from domestic cricket after playing for Tasmania in their Sheffield Shield match against Queensland.The 38-year-old wicketkeeper was given a guard of honour as he left the field at Bellerive Oval following the game. Paine played 35 Tests for Australia, with 23 of those as captain after he took over from Steve Smith.Smith was stripped of the role after a ball-tampering controversy during Australia’s 2018 tour of South Africa. Paine has not played international cricket since January 2021 and last played domestic white-ball cricket in December 2022.Under Paine’s captaincy, Australia retained the Ashes in 2019 with a 2-2 draw, becoming the first Australia side to do so in England since 2001. They won 11, lost eight and drew four Tests during his tenure as captain. He also played 35 one-day internationals for his country and 12 Twenty20s.Paine stepped down as Australia Test captain in November 2021 before the Ashes over a historical investigation into sexually explicit texts to a female colleague. He said he was “exonerated”, but stepped down as he had learned his texts were set to be revealed publicly.Paine then took a leave of absence from the game, with his manager saying the player was taking “an indefinite mental health break”, before he returned to play for Tasmania in October 2022. He did not receive a Cricket Australia contract in 2022. “He’s been a phenomenal player,” said Tasmania captain Jordan Silk. “It’s an incredible effort to have the longevity that he’s had. He’s certainly going to be missed behind the stumps. “I’m sure a lot of guys who are playing now will say that there will never be another keeper as good as Tim Paine in Australia. So we’ve been incredibly blessed down here.” (BBC Sports) Published on By Published on By Fifa has dropped plans for Saudi Arabia to sponsor the 2023 Women’s World Cup, says Fifa president Gianni Infantino.It follows a backlash from co-hosts Australia and New Zealand, players and sponsors about the proposed deal. Infantino said talks had taken place with Visit Saudi, the gulf country’s tourism arm, about sponsoring the tournament. “At the end this discussion didn’t lead into a contract,” he said, calling the affair “a storm in a teacup.” The Swiss official, who has been re-elected unopposed as Fifa president, also said Fifa is aiming to have equal prize money for the men’s and women’s World Cup by 2027. Infantino said he would not have seen an issue with Saudi Arabia sponsoring a World Cup in Australia and New Zealand as “Fifa is an organisation of 211 countries, for us they are all the same,” and given that there is $1.5bn worth of trade between Australia and Saudi Arabia every year. “This doesn’t seem to be a problem,” he said. “But between a global organisation like Fifa and Visit Saudi this would have been an issue. There is a double standard here, which I really don’t understand. “There is no issue and no contract. There are discussions and of course we want to see how we can involve Saudi sponsors in women’s football generally, how we can involve Saudi sponsors in men football, or we can involve Qatari sponsors in women’s football and men’s football, and all other sponsors from all over the world.” Football Australia chief executive James Johnson said: “We welcome clarification from Fifa regarding Visit Saudi. “Equality, diversity and inclusion are really deep commitments for Football Australia and we’ll continue to work hard with Fifa to ensure the Women’s World Cup is shaped in this light, and it is a historic event for our nation, showcasing the world’s greatest female players and advancing the game globally.” The question of prize money was brought up by Infantino as part of a three-step plan for the women’s game.Women’s World Cup prize money is rising to £126m for this year’s tournament, from £25m in 2019. However, at the men’s World Cup last year in Qatar the prize money on offer totalled £365m. The money for the 2027 Women’s World Cup would match the 2026 men’s tournament in Canada, United States and Mexico, Infantino said. Along with prize money in the three-step plan announced by Infantino on Thursday, another will be equal conditions and services, such as accommodation and flights, for all men and women playing at World Cups. Step three is to have pay parity by the next men’s and women’s World Cup in 2026 and 2027, which Infantino said will be the “most complicated”, as he also criticised broadcasters and sponsors for offering much less financially for the women’s tournament compared to the men’s. World players’ union Fifpro welcomed Infantino’s comments on equal pay, saying: “The progress announced today demonstrates the intent of the players and Fifa to work proactively towards greater equity and equality for the industry.” The 2023 Women’s World Cup, which will be the first to feature 32 teams, runs from 20 July to 20 August. (BBC Sports) Published on By In rain-impacted Wellington, with heavy winds for company, New Zealand batted just 48 overs as bad light brought about an early close to an already truncated opening day. Kane Williamson and Henry Nicholls were unbeaten on 26 and 18 at the close respectively, though it was when Devon Conway was at the crease during his 108-ball 78 that New Zealand had looked the most threatening. Sri Lanka’s seamers, whose eyes might have lit up at the opportunity to bowl first on a supremely green top after Dimuth Karunaratne won the toss, unfortunately had to cope with some of the windiest conditions ever seen at Basin Reserve. “Today was certainly the windiest I’ve played at the Basin. Certainly a lot of challenge for the bowlers, and we wanted to make the most of that and put pressure on them,” Conway said after the end of play. While there was certainly extra bounce in the surface – Conway would describe it as “tennis-ball bounce” – the gusty winds meant the likes of Kasun Rajitha, Asitha Fernando and Lahiru Kumara were unable to gain the same sort of lateral movement they had so effectively utilised in Christchurch, while maintaining good lengths were also proving difficult. Conway and his more watchful opening partner Tom Latham also proved adept at leaving the ball on length, meaning Sri Lanka’s seamers were forced to pitch it full if they wanted to force the batters into a stroke. It was here that Conway flourished. In a stand worth 87, it was Kumara that took the brunt of Conway’s aggression, with eight of his 13 boundaries coming against the strapping quick. Anything too short or wide was pulled and cut with ease, while anything over pitched was driven just as efficiently. The first wicket came only once Latham looked to break free, pulling one straight down deep square-leg’s throat off Rajitha. Conway, though, carried on in a similar vein, as Williamson took over the anchor role in a 31-run stand. With the seamers struggling to make a consistent impact, Sri Lanka were forced to turn to spin shortly before tea. And it was the continued use of Dhananjaya de Silva’s offbreaks that provided an unlikely breakthrough in the final session. De Silva’s flatter trajectory from around the wicket slowed down Conway’s scoring, the left-hander scoring just three runs off the 16 deliveries he faced from de Silva. Eventually that pressure told, with Conway charging de Silva and only managing to chip a low return catch. Sri Lanka might even have had three for the day had debutant Nishan Madushka – replacing Niroshan Dickwella with the gloves – held on to a thick edge off Nicholls. It was quick and low to his left – almost a mirror image of the chance Dickwella had grassed off Williamson in Christchurch – but one Madushka ought to have held on to. Madushka has been brought into the side mainly on the back of his batting ability, and the pressure will certainly be on going forward. Williamson and Nicholls played through the rest of the session on pure merit until bad light meant play was stopped 45 minutes prior to the scheduled close. Sri Lanka","pubDate":"2023-03-17 23:40:41","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"News24.com | East London weather deals blow to Proteas plans, but Duminy says selection won't change much","link":"https://www.news24.com/sport/Cricket/Proteas/east-london-weather-deals-blow-to-proteas-plans-but-duminy-says-selection-wont-change-much-20230317","keywords":null,"creator":null,"video_url":null,"description":"Proteas batting coach JP Duminy, in not so many words, confirmed they won’t be tinkering too much with their planned match-day 11 for Saturday's second ODI against the West Indies.","content":"At Buffalo Park, East London Proteas batting coach JP Duminy, in not so many words, confirmed they won’t be tinkering too much with their planned match-day 11 for Saturday's second ODI against the West Indies. The intermittent rain that blighted the first ODI on Thursday was nowhere to be seen on Friday, with a moderate breeze and more than comfortable heat not only allowing the playing surface and the square to dry out, but also seeing the ground in decent enough shape for the Proteas to practice on. Without giving away names, even though the one of Tony de Zorzi popped up in the lead-up question, Duminy said they would be treading a similar selection path for Saturday match at Buffalo Park. READ | First ODI washout denies Temba's Proteas momentum as warhorses are primed for combat The entire squad took part in Friday's training session, with the likely pace attack taking shape in the forms of Lungi Ngidi and Marco Jansen. The duo practiced extensively with bowling coach Rory Kleinveldt before Andile Phehlukwayo, Wayne Parnell, Lizaad Williams and Sisanda Magala joined them later in the piece. \"The great thing about where we stand is that there's a plan in place and the net has widened somewhat in terms of opportunities for the guys,\" Duminy said. \"Yes, there would have been one or two debuts if there was a game on Thursday and there's a likelihood that things will be similar going into the game on Saturday. READ | Key World Cup leadup task for Walter: Keep Quinny hungry \"I think the important part is that we plan, and we cover our important bases. Importantly, can we find the right combinations going forward in the next couple of months going into World Cup? \"That's what we need to see.\" The cancellation of the first ODI due to the weather left the Proteas with only two games to make use of in preparation for the month-end World Cup qualifiers against the Netherlands. One fewer game meant the Proteas need to press home any selectorial and tactical advantages that the weather and completed games will allow them. Duminy admitted the weather messed with their plans, but theirs is to adapt to whatever unfolds in front of them. READ | Dane van Niekerk confirms Proteas retirement, ends stellar career on tumultuous note \"We may need to shuffle and, from time to time, there may be a fork in the road that may force us to go in a different direction,\" Duminy said. \"If we can communicate well within the group and to stakeholders in terms of what that plan is, I think that's the important part. \"The execution is going to be important, but the plan is in place. The weather did throw a spanner in the works, especially in the first game, so we'll have to shuffle around going forward.\"","pubDate":"2023-03-17 21:15:50","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Indian tormentor strikes AGAIN as huge ‘turning point’ triggers horror Aussie collapse","link":"https://www.foxsports.com.au/cricket/steve-smith-prepares-for-odi-captaincy-return-as-australia-sweats-on-wounded-david-warner/news-story/9d1ef7d9950845e2c7d44f8ab6f4ec24","keywords":null,"creator":null,"video_url":null,"description":"KL Rahul and Ravindra Jadeja stood calm in a tricky chase of 189 to steer India to a five-wicket win over Australia in the first one-day international on Friday.","content":"KL Rahul and Ravindra Jadeja stood calm in a tricky chase of 189 to steer India to a five-wicket win over Australia in the first one-day international on Friday. Australia were bowled out for 188 in 35.4 overs after a dramatic collapse following opener Mitchell Marsh’s 65-ball 81 in Mumbai. MATCH CENTRE: India vs Australia first ODI scorecard, stats Watch Australia’s Tour of India. Every ODI live & ad-break free during play on Kayo. New to Kayo? Start your free trial now > India were in trouble at 39-4 before Rahul (75 not out) took stock and an unbeaten 108-run sixth-wicket stand with Jadeja (45 not out) ensured the hosts secured victory in 39.5 overs. The hosts lead the three-match series 1-0 with the two teams warming up for the 50-over World Cup later this year in India. Stand-in-skipper Hardik Pandya praised Jadeja, who also claimed two wickets with his left-arm spin and took a stunning catch to be named man of the match, and Rahul for their calmness. “The way KL and Jaddu (Jadeja) finished it off and the way they batted, gave us the confidence,” said Pandya. “It was very relaxing outside watching them bat.” Fast bowlers Mohammed Shami and Mohammed Siraj took three wickets each after Australia lost their way from 129-2 following India’s decision to field first. MUMBAI, INDIA - MARCH 17: Ravindra Jadeja of India and KL Rahul of India celebrate their victory. Source: Getty Images The Australian innings turned on its head after Marsh, who is playing as a specialist batsman after recovering from an ankle injury, departed in the 20th over. He put on 72 runs for the second wicket with skipper Steve Smith and smashed 10 fours and five sixes to take the wind out of the Indian bowlers. Marsh reached his fifty with a boundary and another four took Australia past 100 before he fell to Jadeja in his attempt to go after the left-arm spinner and was caught. - Rocked at Wankhede - Australia suddenly faltered as Shami, with help from Jadeja and Siraj, ripped through the rest of the Australian order. “We weren’t expecting this when we rocked up here,” Smith said of the low-scoring match at the usually run-filled Wankhede Stadium. “India bowled well this morning, but we probably left a few (runs) out there.” Josh Inglis, who donned the wicketkeeping gloves after Alex Carey was ruled out sick, looked good in his knock of 26 before being bowled by Shami. Shami then sent back Cameron Green (12) and Marcus Stoinis (5) to break the back of the opposition batting. Australia's Josh Inglis is clean bowled. Source: AFP Australia’s pace spearhead Mitchell Starc hurt India early in the chase with three wickets after Stoinis trapped opener Ishan Kishan lbw for three. Starc, a left-arm quick, then struck with successive deliveries to send back Virat Kohli (4) and Suryakumar Yadav (0) -- both lbw. Rahul, who recently lost his place to Shubman Gill in the final two Tests against Australia after an extended batting slump, played out the hat-trick ball but Starc dismissed Gill for 20. Rahul and Pandya, who made his debut as ODI captain in the absence of regular skipper Rohit Sharma, put on 44 runs. Pandya fell to Stoinis on 25 but Rahul stood firm with Jadeja, who hit the winning runs. Rahul reached his 13th ODI fifty and then changed gears as he hit Adam Zampa for a four and six as India won with more than 10 overs to spare. The second ODI is on Sunday in Visakhapatnam Re-live all the action in our live blog below. Can’t see the blog? CLICK HERE","pubDate":"2023-03-17 21:00:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"PSL 2023: बाबर आजम का सपना टूटा, शाहीन अफरीदी की लाहौर कलंदर्स और मुल्तान के बीच होगा फाइनल","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/psl-2023-babar-azam-peshawar-zalmi-knocked-out-by-shaheen-afridi-lahore-qalandar/articleshow/98741034.cms","keywords":null,"creator":null,"video_url":null,"description":"PSL 2023: पाकिस्तान सुपर लीग के दूसरे एलिमिनेटर में डिफेंडिंग चैंपियन लाहौर कलंदर्स ने पेशावर जाल्मी को हराते हुए फाइनल में एंट्री मार ली। फाइनल में मुल्तान सुल्तांस पहले ही पहुंच चुकी है।","content":"बाबर आजम की कप्तानी वाली पेशावर जाल्मी का पाकिस्तान सुपर लीग के फाइनल में पहुंचने का सपना टूट गया। गद्दाफी स्टेडियम में शुक्रवार रात खेले गए एलिमिनेटर-2 में शाहिद अफरीदी वाली लाहौर कलंदर्स को जीत हासिल हुई। अब डिफेंडिंग चैंपियन लाहौर का खिताबी मुकाबला आज रात इसी मैदान पर मुल्तान सुल्तांस से होगा। मैच में पेशावर ने टॉस जीतकर पहले बैटिंग करते हुए पांच विकेट पर 171 रन बनाए। जवाब में लाहौर ने सात गेंद पहले ही चार विकेट से मैदान मार लिया। कप्तान बाबर आजम ने 36 गेंद में 42 रन बनाए तो तीसरे नंबर पर उतरे मोहम्मद हारिस के बल्ले से 54 गेंद में 85 रन निकले। लाहौर की ओर से ओपनर मिर्जा बेग ने सबसे ज्यादा 54 रन बनाए। हार के बाद बाबर आजम काफी मायूस नजर आए। पेशावर जाल्मी के मैंटॉर डैरेन सैमी उन्हें दिलासा देते देखे, जिसका वीडियो भी इंटरनेट पर वायरल हो रहा है।","pubDate":"2023-03-17 18:46:26","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Great Boulder, Lake View both unchanged for EGCA grand final","link":"https://thewest.com.au/news/kalgoorlie-miner/great-boulder-lake-view-both-unchanged-for-egca-grand-final-c-10069434","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Great Boulder and Lake View clash in the Eastern Goldfields Cricket Association’s A-grade decider on Saturday.","content":null,"pubDate":"2023-03-17 18:00:00","image_url":"https://images.thewest.com.au/publication/C-10069434/ebd90ea06a719e486ba31a9ffa6a18947a876027-16x9-x0y209w4000h2250.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"श्रेयस अय्यर IPL 2023 में खेलेंगे या नहीं? अभी करना होगा इंतजार, 10 दिन बाद होगा फैसला","link":"https://hindi.news18.com/news/sports/cricket-shreyas-iyer-advised-10-days-rest-call-on-availability-for-ipl-yet-to-be-taken-report-5570635.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL 2023: भारत के स्टार खिलाड़ी श्रेयस अय्यर के आगामी इंडियन प्रीमियर लीग में खेलने की स्थिति के बारे में अभी कोई जानकारी नहीं है. पीठ की चोट के कारण ऑस्ट्रेलिया के खिलाफ चौथे टेस्ट से हटने वाले श्रेयस अय्यर को मौजूदा वनडे सीरीज से भी बाहर हैं. श्रेयस अय्यर कोलकाता नाइट राइडर्स के कप्तान हैं, जो अभी भी अपनी फिटनेस स्थिति का इंतजार कर रहे हैं. अपनी चोट को लेकर आए नए अपडेट के मुताबिक श्रेयस को अपनी सही स्थिति जानने के लिए 10 दिनों तक इंतजार करना होगा.","content":"श्रेयस अय्यर के IPL में खेलने के फैसले के लिए 10 दिन का इंतजार करना होगा (PIC: AP) मुंबई. भारत के मिडिल ऑर्डर के बैटर श्रेयस अय्यर को 10 दिन आराम की सलाह दी गई है. उनकी आईपीएल 2023 के लिए उपलब्धता के बारे में फैसला अभी कोई नहीं लिया गया है. श्रेयस अय्यर की पीठ की चोट ऑस्ट्रेलिया के खिलाफ अहमदाबाद टेस्ट के दौरान फिर से उभर आई थी, जिसके बाद वह पूरा अहमदाबाद टेस्ट नहीं खेले थे. इसके बाद उन्हें ऑस्ट्रेलिया के खिलाफ 3 मैचों की वनडे सीरीज से भी बाहर होना पड़ा था. मीडिया में ऐसी कई रिपोर्ट्स सामने आ रही थीं कि श्रेयस अय्यर आईपीएल 2023 से भी बाहर हो गए हैं. लेकिन ताजा रिपोर्ट के मुताबिक, श्रेयस के आईपीएल में खेलने का फैसला 10 दिन बाद लिया जा सकता है. क्रिकबज में एक रिपोर्ट के अनुसार, श्रेयस अय्यर को स्पाइन विशेषज्ञ डॉ. अभय नेने से मिलने के बाद अपनी सही स्थिति के बारे में जानने के लिए 10 दिन इंतजार करना होगा. रिपोर्ट में साथ ही कहा गया है कि श्रेयस अय्यर पर किए गए टेस्ट काफी अच्छे नहीं हैं, लेकिन उन्हें आधिकारिक तौर पर आईपीएल से बाहर नहीं किया गया है. पति के लिए गोल्ड मेडलिस्ट ने छोड़ा करियर, रंग लाया बलिदान, महान बल्लेबाज ने माना- बीवी बिना नहीं होता कामयाब श्रेयस अय्यर के प्रारंभिक स्कैन के रिजल्टअच्छे नहीं पाए जाने के कारण उन्हें अहमदाबाद टेस्ट से हटा लिया गया था. अपने होमटाउन मुंबई लौटने के बाद श्रेयस अय्यर ने डॉ. अभय नेने से अपनी चोट के बारे में बातचीत की थी. डॉ. नेने लीलावती अस्पताल में स्पेशलिस्ट हैं और स्पाइन की परेशानियों को देखते हैं. भारतीय दिग्गज की पहली कमाई 2 रुपये, मंगल बाजार में बेचे नाड़े, नेशनल टीवी पर किया था खुलासा समझा जाता है कि डॉ. अभय नेने ने श्रेयस अय्यर को सलाह दी है कि वह सामान्य प्रक्रिया से गुजरें यानी आराम और रिहैब करें. उन्होंने श्रेयस अय्यर को 10 दिन बाद आने को कहा है. रिपोर्ट के अनुसार, श्रेयस अय्यर अगले कुछ दिनों में अपने तत्काल और दीर्घकालीन भविष्य के बारे में जान पाएंगे. रिपोर्ट में यह भी कहा गया है कि कोलकाता नाइट राइडर्स (KKR), जिसके अय्यर कप्तान हैं, खुद को उस स्थिति के लिए तैयार कर रहे हैं. यदि श्रेयस अय्यर प्रतियोगिता के लिए उपलब्ध नहीं होते हैं तो सुनील नरेन कप्तानी के लिए संभावित उम्मीदवार हैं. लेकिन श्रेयस अय्यर के उपलब्ध न होने की स्थिति में फ्रेंचाइजी दूसरी दिशा में भी देख सकती है. रिपोर्ट के अनुसार टीम अगले कुछ दिनों में कोलकाता में एकत्र होगी और श्रेयस अय्यर पर पूर्ण स्पष्टता मिल जाने के बाद नए कप्तान का फैसला किया जाएगा. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: India vs Australia , IPL 2023 , Kolkata Knight Riders , Shreyas iyer इस देश में आम आदमी की है मौज, जरूरतमंदों पर खूब खर्च करती है सरकार, संपन्न देशों जैसा है हाल बड़ी स्क्रीन के साथ लॉन्च हुई Fastrack की नई वॉच, हेल्थ और फिटनेस का भी रखेगी ख्याल, कीमत 1,695 रुपये अंग्रेजी में थोड़ा कच्‍चा था रोहित का साथी, वाइफ बनी पर्सनल ‘कोच’, झटपट बना गया जेंटलमैन","pubDate":"2023-03-17 17:51:49","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/02/shreyas-iyer-odi-paractice-16763001743x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs AUS: &#039;हम पूरे मैच में दबाव में थे, लेकिन...&#039; हार्दिक पंड्या ने बताई जीत की 2 वजह","link":"https://hindi.news18.com/news/sports/cricket-hardik-pandya-happy-with-kl-rahul-ravindra-jadeja-allround-show-against-australia-in-1st-odi-5570649.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"India vs Australia ODI: भारत ने ऑस्ट्रेलिया को पहले वनडे में 5 विकेट से हरा दिया. हार्दिक पंड्या के वनडे कप्तानी के डेब्यू भी जीत से आगाज हुआ. हार्दिक ने कहा कि मैं अपनी बल्लेबाजी और गेंदबाजी से खुश हूं और खासतौर पर जिस तरह से रवींद्र जडेजा और केएल राहुल ने खेल दिखाया, वो सुकून देने वाला रहा.","content":"हार्दिक पंड्या ने बताया कि क्यों टीम इंडिया ऑस्ट्रेलिया के खिलाफ पहला वनडे जीती. (AP) मुंबई. भारत ने ऑस्ट्रेलिया को मुंबई वनडे में 5 विकेट से हरा दिया. भारत ने 189 रन के टारगेट को 39.5 ओवर में ही हासिल कर लिया. पहले वनडे में 5 विकेट से मिली जीत के बाद हार्दिक पंड्या ने केएल राहुल और रवींद्र जडेजा की तारीफ करते हुए कहा कि उनकी बल्लेबाजी सुकून देने वाली थी. खराब फॉर्म के कारण आस्ट्रेलिया के खिलाफ तीसरे और चौथे टेस्ट से बाहर रहे राहुल ने नाबाद 75 और जडेजा ने नाबाद 45 रन बनाये . कार्यवाहक कप्तान पंड्या ने कहा, “मैं हमारे प्रदर्शन से बहुत खुश हूं. जड्डू (जडेजा ) ने आठ महीने बाद वापसी करके शानदार प्रदर्शन किया. मुझे अपनी गेंदबाजी और बल्लेबाजी में मजा आया. लेकिन जड्डू और राहुल की बल्लेबाजी सुकून देने वाली थी. हम दोनों पारियों में दबाव में थे, लेकिन हमने संयम नहीं खोया और विषम परिस्थितियों से बाहर निकले.लय हासिल करने के बाद हमने उसे गंवाया नहीं.” वापसी पर ऐसा प्रदर्शन बोनस की तरह: जडेजा प्लेयर आफ द मैच जडेजा ने कहा कि घुटने के ऑपरेशन के कारण आठ महीने बाद लौटकर वह प्रारूप के अनुरूप ढलने की कोशिश में थे और यह प्रदर्शन बोनस की तरह रहा. उन्होंने कहा कि हम टेस्ट क्रिकेट खेल रहे थे और वनडे में मैने लंबे समय बाद वापसी की. मैं अच्छी गेंदबाजी की कोशिश कर रहा था. आस्ट्रेलियाई कप्तान स्टीव स्मिथ ने कहा कि इस विकेट पर 260-270 रन बनने चाहिए थे. जडेजा ने आगे कहा कि हमने इस तरह के प्रदर्शन की उम्मीद नहीं की थी. भारत ने उम्दा गेंदबाजी की. हम अगर 250 रन बनाते तो मैच में बने रह सकते थे. विकेट से तेज गेंदबाजों को काफी मदद मिली. हार्दिक का वनडे में धमाकेदार कप्तानी डेब्यू, मुश्किल में जिगरी यार ने ठोका अर्धशतक, भारत ने बनाई बढ़त VIDEO: मोहम्मद शमी का तूफान…कंगारुओं की ली जान! एक-एक रन के लिए तरसाया, 15 गेंद में कहर बरपाया ऑस्ट्रेलिया ने इस मैच में भारत को 189 रन का लक्ष्य दिया था. भारत ने 61 गेेंद रहते 5 विकेट खोकर इस टारगेट को हासिल कर लिया. भारत की जीत के हीरो केएल राहुल और रवींद्र जडेजा रहे. केएल राहुल ने 75 और जडेजा ने 45 रन ठोके. दोनों के बीच छठे विकेट के लिए नाबाद 108 रन की साझेदारी हुई. इससे पहले, मोहम्मद शमी और मोहम्मद सिराज ने 3-3 विकेट झटके थे. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| Tags: Hardik Pandya , India vs Australia , KL Rahul , Ravindra jadeja , Team india बड़ी स्क्रीन के साथ लॉन्च हुई Fastrack की नई वॉच, हेल्थ और फिटनेस का भी रखेगी ख्याल, कीमत 1,695 रुपये अंग्रेजी में थोड़ा कच्‍चा था रोहित का साथी, वाइफ बनी पर्सनल ‘कोच’, झटपट बना गया जेंटलमैन 3 डबल सेंचुरी जमाने वाले धाकड़ की दूसरे वनडे में एंट्री, जीत के बाद भी 2 बदलाव पक्के, युवा बैटर का कटेगा पत्ता","pubDate":"2023-03-17 17:47:35","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/HARDIK-PANDYA-AP-16790750803x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}