{"newsArray":[{"title":"Pucovski saga’s parallel probe into cricket helmet safety","link":"https://www.theage.com.au/sport/cricket/pucovski-saga-s-parallel-probe-into-cricket-helmet-safety-20220213-p59w1a.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australian cricket’s medical chiefs have questioned whether helmet designs need fine-tuning to reduce risks of concussion.","content":null,"pubDate":"2022-02-13 08:04:54","full_description":"At the same time Will Pucovski has navigated a very public cycle of head knocks, recoveries and comebacks, Australian cricket’s medical chiefs have questioned whether helmet designs need further fine-tuning to reduce concussion risk. A recent study of 197 head impacts on 130 players in elite men’s and women’s cricket between 2014 and 2019, conducted by experts including Cricket Australia’s chief medical officer, Dr John Orchard, and its head of sports science, Alex Kountouris, suggested among other things that more could be done to bring down the likelihood of players suffering concussion when struck on the helmet. Will Pucovski after suffering a head knock against India in a tour match in 2020. Credit: Getty Images The research paper, published in the peer reviewed Journal of Concussion in 2020, found that a significantly higher percentage of players suffered concussion when struck on the back of the helmet, as opposed to elsewhere. While it stated that more research was needed around helmet design, the paper’s authors also concluded: “Improved impact attenuation of cricket helmets, particularly at the back, may reduce the risk of concussion.” The term “impact attenuation” refers to the amount of force absorbed and dissipated around an impact. Previous major reviews of helmet safety standards in cricket had primarily tackled dangerously high instances of serious injuries and skull fractures, often the result of balls getting through the gap between helmet peak and grill. The introduction of more exacting thresholds for helmets, consistent with British standards and made mandatory across the game in 2015, had little to do with concerns about concussion. A 2013 report on cricket helmet safety by Craig Ranson, director of athlete health at the English Institute of Sport, noted: “There is still considerable room for improving batting helmets, particularly with regard to reducing their weight and heat retention whilst augmenting protection against concussive impacts.” Will Pucovski was subbed out of Victoria’s Shield game due to concussion. Credit: Getty Images In intervening years, many players and coaches have privately wondered whether the new standard of helmets had reduced the chances of sustaining a serious head or neck injury from being struck by the ball, but also raised concussion risk as they felt, anecdotally, there was less “give” or “crumple” effect in helmets to absorb impacts. Reference to “impact attenuation” in the research paper has taken cricket closer to some of the debates that have continued in American football for some years , particularly following the discovery of CTE as a brain affliction. Numerous tweaks have been made to football helmets to attempt to improve their capacity to dissipate impacts without causing concussion, though the risk can never be completely eradicated. These discussions have run in parallel to Pucovski’s career. He made his state debut in early 2017 and was first picked in Australia’s Test squad two years later, finally making his international debut in January 2021 against India at the SCG. Of the 11 concussions Pucovski is reported to have suffered, his first took place playing football, and other freakish instances have included being hit by the ball while fielding, landing awkwardly, and Saturday’s instance involving a soccer ball in Victoria’s Sheffield Shield warm-ups. However, the most common instance has been the one examined in the research paper, where a batter is hit on the helmet by a ball delivered at speed. Earlier this year, ahead of his return to club cricket, Pucovski had said he accepted he would be hit again, but wanted to reach a point where he could do so and keep batting. “I’m going to get hit again in my career, if you face balls and hopefully a lot of balls, it’s just bound to happen,” he said in January. “It’s something I’ve got to deal with, but I’ve also got people helping me out with my concussions and I feel pretty confident that regardless of what happens I’ll always be able to bounce back. “I’m hoping the day comes where I get hit and I can just keep batting. That would be the ideal scenario. But it’s one of those things where I have full faith in the people around me that allow me to physically and mentally get out there and play good cricket.″⁣ Pucovski’s state coach, Chris Rogers, outlined the flipside to Pucovski’s self-awareness after his latest instance of having to withdraw from a game. “He’s not at all unaware of the situation and the noise that surrounds these concussions,” Rogers said. “He’s pretty aware of how this was going to play out, from that point of view he was pretty devastated and knows he’ll have to face some tough questions over the next period. It’s a really delicate situation with his history and everything he’s gone through. From here, it’s going to be a really important period for Will.” Talks between CA, the ICC and other member nations about the adoption of universal high standards for head and neck protection continue.","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pucovski saga’s parallel probe into cricket helmet safety","link":"https://www.smh.com.au/sport/cricket/pucovski-saga-s-parallel-probe-into-cricket-helmet-safety-20220213-p59w1a.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Australian cricket’s medical chiefs have questioned whether helmet designs need fine-tuning to reduce risks of concussion.","content":null,"pubDate":"2022-02-13 08:04:54","full_description":"At the same time Will Pucovski has navigated a very public cycle of head knocks, recoveries and comebacks, Australian cricket’s medical chiefs have questioned whether helmet designs need further fine-tuning to reduce concussion risk. A recent study of 197 head impacts on 130 players in elite men’s and women’s cricket between 2014 and 2019, conducted by experts including Cricket Australia’s chief medical officer, Dr John Orchard, and its head of sports science, Alex Kountouris, suggested among other things that more could be done to bring down the likelihood of players suffering concussion when struck on the helmet. Will Pucovski after suffering a head knock against India in a tour match in 2020. Credit: Getty Images The research paper, published in the peer reviewed Journal of Concussion in 2020, found that a significantly higher percentage of players suffered concussion when struck on the back of the helmet, as opposed to elsewhere. While it stated that more research was needed around helmet design, the paper’s authors also concluded: “Improved impact attenuation of cricket helmets, particularly at the back, may reduce the risk of concussion.” The term “impact attenuation” refers to the amount of force absorbed and dissipated around an impact. Previous major reviews of helmet safety standards in cricket had primarily tackled dangerously high instances of serious injuries and skull fractures, often the result of balls getting through the gap between helmet peak and grill. The introduction of more exacting thresholds for helmets, consistent with British standards and made mandatory across the game in 2015, had little to do with concerns about concussion. A 2013 report on cricket helmet safety by Craig Ranson, director of athlete health at the English Institute of Sport, noted: “There is still considerable room for improving batting helmets, particularly with regard to reducing their weight and heat retention whilst augmenting protection against concussive impacts.” Will Pucovski was subbed out of Victoria’s Shield game due to concussion. Credit: Getty Images In intervening years, many players and coaches have privately wondered whether the new standard of helmets had reduced the chances of sustaining a serious head or neck injury from being struck by the ball, but also raised concussion risk as they felt, anecdotally, there was less “give” or “crumple” effect in helmets to absorb impacts. Reference to “impact attenuation” in the research paper has taken cricket closer to some of the debates that have continued in American football for some years , particularly following the discovery of CTE as a brain affliction. Numerous tweaks have been made to football helmets to attempt to improve their capacity to dissipate impacts without causing concussion, though the risk can never be completely eradicated. These discussions have run in parallel to Pucovski’s career. He made his state debut in early 2017 and was first picked in Australia’s Test squad two years later, finally making his international debut in January 2021 against India at the SCG. Of the 11 concussions Pucovski is reported to have suffered, his first took place playing football, and other freakish instances have included being hit by the ball while fielding, landing awkwardly, and Saturday’s instance involving a soccer ball in Victoria’s Sheffield Shield warm-ups. However, the most common instance has been the one examined in the research paper, where a batter is hit on the helmet by a ball delivered at speed. Earlier this year, ahead of his return to club cricket, Pucovski had said he accepted he would be hit again, but wanted to reach a point where he could do so and keep batting. “I’m going to get hit again in my career, if you face balls and hopefully a lot of balls, it’s just bound to happen,” he said in January. “It’s something I’ve got to deal with, but I’ve also got people helping me out with my concussions and I feel pretty confident that regardless of what happens I’ll always be able to bounce back. “I’m hoping the day comes where I get hit and I can just keep batting. That would be the ideal scenario. But it’s one of those things where I have full faith in the people around me that allow me to physically and mentally get out there and play good cricket.″⁣ Pucovski’s state coach, Chris Rogers, outlined the flipside to Pucovski’s self-awareness after his latest instance of having to withdraw from a game. “He’s not at all unaware of the situation and the noise that surrounds these concussions,” Rogers said. “He’s pretty aware of how this was going to play out, from that point of view he was pretty devastated and knows he’ll have to face some tough questions over the next period. It’s a really delicate situation with his history and everything he’s gone through. From here, it’s going to be a really important period for Will.” Talks between CA, the ICC and other member nations about the adoption of universal high standards for head and neck protection continue.","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL auction: Odean Smith joins Punjab Kings for Rs 6 crore","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-auction/ipl-auction-odean-smith-joins-punjab-kings-for-rs-6-crore/article38422233.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"With the bat, Smith is a big-hitter lower down the order in T20 cricket. At CPL 2021, he was the second-highest wicket-taker.","content":null,"pubDate":"2022-02-13 07:26:20","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Finch and Marnus cop brutal $470k snubbing as IPL mega auction resumes: LIVE","link":"https://www.foxsports.com.au/cricket/indian-premier-league/ipl-auction-2022-live-updates-indian-premier-league-mega-auction-night-2-list-of-players-aussies-still-for-sale-teams-prices-news/news-story/f12b438efe89464f83fc2eb66bca227e","keywords":null,"creator":null,"video_url":null,"description":"Aaron Finch and Marnus Labuschagne have gone unsold at the Indian Premier League mega auction as 44 Aussies go up for sale on day two. Watch it live across Fox Cricket and Fox Sports More CH507 from 5:30pm AEDT!","content":null,"pubDate":"2022-02-13 06:57:00","full_description":"Aaron Finch and Marnus Labuschagne have gone unsold at the Indian Premier League mega auction as 44 Aussies go up for sale on day two. Watch it live across Fox Cricket and Fox Sports More CH507 from 5:30pm AEDT! Labuschagne was the first Australian to go under the hammer on night two, and went unsold at his base price of 1 crore ($A186k). White ball captain Finch suffered the same fate soon after as franchises passed on his signature at 1.5 crore ($A280k). On Saturday, superstar trio Pat Cummins, David Warner and Steve Smith took a combined $5 million pay cut on day one, with Cummins and Warner drafted at half of their previous pay packets, and Smith going unsold even at the reserve price of INR 2 crore (200 lakh), or $A372k. 1 crore (100 lakh) is worth around $A186k. Two seasons ago, Smith earnt a $2.2 million deal with Rajasthan. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > T20 LIVE: ‘What are you thinking?’ — The big question Aussies must answer after ‘poor’ display NIGHT 1 WRAP: Marsh cashes in; Smith unsold as India gun goes for $2.83m GRAPHIC: IPL auctioneer cleared after terrifying fall from stage during live bidding The biggest sale of day two so far has been that of English all-rounder Liam Livingstone who was bought by Punjab Kings for 11.50 crore ($A2.16m) The highest price paid on day one was 15.25 crore ($A2.83m) for 23-year-old Indian wicketkeeper Ishan Kishan by Mumbai. Unsold players from day one, such as Steve Smith, Adam Zampa and Matthew Wade, can still be picked up if a team asks them to be re-entered into the pool. Pucovski concussion jeopardizes future | 01:16 Two new franchises, Lucknow Super Giants and Ahmedabad’s Gujarat Titans, have joined Chennai Super Kings, Delhi Capitals, Kolkata Knight Riders, Mumbai Indians, Punjab Kings, Rajasthan Royals, Royal Challengers Bangalore and Sunrisers Hyderabad for the 2022 season. Marcus Stoinis (Lucknow) and Glenn Maxwell (Bangalore) were two of the 27 players retained by the clubs. In total 590 players are in the pool - 370 Indian and 220 overseas - with 49 of them set at the maximum reserve price of INR 2 crore (20 million rupees, or $372,000). The auction will run over two days, with the 2022 IPL season taking place from April 2 until June 3. AUSSIES STILL UP FOR GRABS ON DAY 2 (Reserve price listed) 2 crore/200 lakh (approx. A$375,000) – Nathan Coulter-Nile, Ashton Agar 1.5 crore/150 lakh (approx. A$280,000) – Chris Lynn, Usman Khawaja, Kane Richardson 1 crore/100 lakh (approx. A$186,000) – Daniel Sams, Andrew Tye, Moises Henriques, Riley Meredith, James Faulkner, D’Arcy Short, Josh Philippe 75 lakh (approx. A$140,000) – Nathan Ellis, Jason Behrendorff, Sean Abbott, Billy Stanlake, Ben Cutting 50 lakh (approx. A$93,000) – Ben McDermott, Kurtis Patterson, Wes Agar, Jack Wildermuth, Joel Paris, Hilton Cartwright 40 lakh (approx. A$75,000) – Tim David, Chris Green 30 lakh (approx. A$57,000) – Ben Dwarshuis, Matt Kelly 20 lakh (approx. A$38,000) – Hayden Kerr, Tanveer Sangha, Alex Ross, Jake Weatherald, Nathan McAndrew, Tom Rogers, Liam Guthrie, Liam Hatcher, Jason Sangha, Matt Short, Aidan Cahill DAY TWO AUSSIE RESULTS Unsold at 1.5 crore/150 lakh (approx. A$280,000) — Aaron Finch Unsold at 1 crore/100 lakh (approx. A$186,000) — Marnus Labuschagne Follow the 2022 IPL mega auction in our live blog below! If you can’t see the blog, tap here.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australian cricket star Will Pucovski to rest before call on future after latest concussion","link":"https://thewest.com.au/sport/cricket/pucovski-to-rest-before-call-on-future-c-5680866","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Will Pucovski has left Cricket Victoria's squad to return to Melbourne as the luckless batter looks to rest after the 11th concussion of his promising career.","content":null,"pubDate":"2022-02-13 06:39:01","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5680866/b1ecf364aca92e989b13d74e75777f508e11ff4b-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pucovski to rest before call on future","link":"https://www.perthnow.com.au/sport/cricket/pucovski-to-rest-before-call-on-future-c-5680863","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Will Pucovski has left Cricket Victoria's squad to return to Melbourne as the luckless batter looks to rest after the 11th concussion of his promising career.","content":null,"pubDate":"2022-02-13 06:38:58","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5680863/b1ecf364aca92e989b13d74e75777f508e11ff4b-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"AUS vs SL Dream11 Team Prediction, Fantasy Cricket Hints Australia vs Sri Lanka: Captain, Probable Playing 11s, Team News; Injury Updates For the 2nd T20 at Sydney Cricket Ground from 1.40 PM IST February 13","link":"https://zeenews.india.com/cricket/aus-vs-sl-dream11-team-prediction-fantasy-cricket-hints-australia-vs-sri-lanka-captain-probable-playing-11s-team-news-injury-updates-for-the-2nd-t20-at-sydney-cricket-ground-from-1-40-pm-ist-february-13-2436022.html","keywords":null,"creator":null,"video_url":null,"description":"Check AUS vs SL Dream11 Team Prediction for Australia vs Sri Lanka 2nd T20.","content":null,"pubDate":"2022-02-13 06:07:00","full_description":null,"image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Our initial plan to qualify for next round: Kunal","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/our-initial-plan-to-qualify-for-next-round-kunal-577991","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Captain of Assam Ranji Trophy team Kunal Saikia in a conversation with The Sentinel from Lahil shared his thought on the preparation, composition of team and target for the forthcoming season. Here is the excerpt.","content":"Our Reports ReporterGUWAHATI: Captain of Assam Ranji Trophy team Kunal Saikia in a conversation with The Sentinel from Lahil shared his thought on the preparation, composition of team and target for the forthcoming season. Here is the excerpt. The Sentinel (TS): You have to lead the team this season. Are you expecting the captaincy? Kunal: Not really. I was just focusing on my training. However when the selectors first informed me about the captaincy I talked to my senior teammates before agreeing to accept the post. (TS): How was the preparation this season? Kunal: It's quite good. We had tried to prepare ourselves from all different aspects which we may face during the match. Our coaching staff is absolutely fantastic. Head coach Ajay Ratra, Coach Stuart Binny and even our manager cum assistant coach Salil Sinha nicely guided us during the training and I hope we would be highly benefited from it. (TS): Your reaction about the squad. Kunal: It's a mixture of experience and youth. There are four new faces in the team and all are selected on the basis of their performance. Hope they will be able to contribute as per the expectation along with the senior members of the squad. (TS): Team will return to a longer version of the game after nearly two years. Can it be a trouble factor? Kunal: Not really. We had kept it in our mind and worked at the net accordingly. We are ready to shift our focus to a longer version of cricket. (TS): This season only four teams are in each elite group. Many feel it would be difficult to come back if there is any early setback. Your reaction. Kunal: Look, we have already chalked out our plan and it is to play good cricket and qualify for the next round. It is possible only if we go into the ground with a positive mind set. So there is no if or but... We will start our campaign with an aim to advance into the next round and I feel It will be a great boost for cricket in Assam if we reach our initial target.Also Read: Muslim Girl Bags 5 Gold Medals In Sanskrit At Lucknow UniversityAlso Watch:","pubDate":"2022-02-13 04:46:28","full_description":"Our Reports Reporter GUWAHATI: Captain of Assam Ranji Trophy team Kunal Saikia in a conversation with The Sentinel from Lahil shared his thought on the preparation, composition of team and target for the forthcoming season. Here is the excerpt. The Sentinel (TS): You have to lead the team this season. Are you expecting the captaincy? Kunal: Not really. I was just focusing on my training. However when the selectors first informed me about the captaincy I talked to my senior teammates before agreeing to accept the post. (TS): How was the preparation this season? Kunal: It's quite good. We had tried to prepare ourselves from all different aspects which we may face during the match. Our coaching staff is absolutely fantastic. Head coach Ajay Ratra, Coach Stuart Binny and even our manager cum assistant coach Salil Sinha nicely guided us during the training and I hope we would be highly benefited from it. (TS): Your reaction about the squad. Kunal: It's a mixture of experience and youth. There are four new faces in the team and all are selected on the basis of their performance. Hope they will be able to contribute as per the expectation along with the senior members of the squad. (TS): Team will return to a longer version of the game after nearly two years. Can it be a trouble factor? Kunal: Not really. We had kept it in our mind and worked at the net accordingly. We are ready to shift our focus to a longer version of cricket. (TS): This season only four teams are in each elite group. Many feel it would be difficult to come back if there is any early setback. Your reaction. Kunal: Look, we have already chalked out our plan and it is to play good cricket and qualify for the next round. It is possible only if we go into the ground with a positive mind set. So there is no if or but... We will start our campaign with an aim to advance into the next round and I feel It will be a great boost for cricket in Assam if we reach our initial target. Also Read: Muslim Girl Bags 5 Gold Medals In Sanskrit At Lucknow University Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/13/312012-images.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Saurav brings crucial points for Dhemaji","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/saurav-brings-crucial-points-for-dhemaji-577989","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Rode on a terrific ton from Saurav Mousum Dihingia (162) Dhemaji came back strongly in the JK Baruah Cricket and earned crucial first innings lead against Barpeta at Furkating today.","content":"Our Sports ReporterGUWAHATI: Rode on a terrific ton from Saurav Mousum Dihingia (162) Dhemaji came back strongly in the JK Baruah Cricket and earned crucial first innings lead against Barpeta at Furkating today. Chasing Barpeta's first innings total 201 Dhemaji were 29-4 at stumps on Day I yesterday. However Saurav changed the entire scenario of the game playing a solid knock. He got good support from Anurag Phukan (53). Dhemaji earned three points from the game by virtue of the first innings lead. Brief scores: Barpeta 1st innings: 201, Dhemaji (1st innings) 284/9 (64 overs)- Saurav Mousum Dihingia 162, Anurag Phukan 53, Bishnu Das 3-67, Ranjan Bikash Das 2-45; Barpeta (2nd innings) 38/2 (18 overs), Sandip Paul 20, Rajesh Prasad 2-12. Also Read: Muslim Girl Bags 5 Gold Medals In Sanskrit At Lucknow UniversityAlso Watch:","pubDate":"2022-02-13 04:43:42","full_description":"Our Sports Reporter GUWAHATI: Rode on a terrific ton from Saurav Mousum Dihingia (162) Dhemaji came back strongly in the JK Baruah Cricket and earned crucial first innings lead against Barpeta at Furkating today. Chasing Barpeta's first innings total 201 Dhemaji were 29-4 at stumps on Day I yesterday. However Saurav changed the entire scenario of the game playing a solid knock. He got good support from Anurag Phukan (53). Dhemaji earned three points from the game by virtue of the first innings lead. Brief scores: Barpeta 1st innings: 201, Dhemaji (1st innings) 284/9 (64 overs)- Saurav Mousum Dihingia 162, Anurag Phukan 53, Bishnu Das 3-67, Ranjan Bikash Das 2-45; Barpeta (2nd innings) 38/2 (18 overs), Sandip Paul 20, Rajesh Prasad 2-12. Also Read: Muslim Girl Bags 5 Gold Medals In Sanskrit At Lucknow University Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/13/312011-istockphoto-177427917-612x612.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Tezpur University Cricket Ground inaugurated","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/tezpur-university-cricket-ground-inaugurated-577988","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Tezpur University Cricket Ground, developed by Assam Cricket Association, was inaugurated today by Professor Vinod Kumar Jain, Vice-Chancellor, Tezpur University.","content":"Our Sports ReporterGUWAHATI: The Tezpur University Cricket Ground, developed by Assam Cricket Association, was inaugurated today by Professor Vinod Kumar Jain, Vice-Chancellor, Tezpur University. The function was attended by president and Secretary of the Assam Cricket Association Romen Dutta and Devajit Saikia, respectively along with other officials of the association. Assam Cricket Association has developed the Tezpur University Cricket Ground including 3 centre wickets and 2 practice wickets as part of an MOU inked between the former with the latter in the year 2020. It is this newly developed venue, along with the Assam Agricultural University Ground in Jorhat - which has also been developed by Assam Cricket Association - will host the first-of-its-kind Inter-University Tournament to be organized by Assam Cricket Association in memory of Nilay Dutta, from tomorrow. Addressing the gathering, Devajit Saikia, said that the Tezpur University Cricket Ground would provide the right platform to the students of the Tezpur University as well as the cricket enthusiasts from Tezpur and its adjoining areas to showcase and hone their cricketing skills. Speaking on the occasion, Professor Vinod Kumar Jain thanked Assam Cricket Association for filling the longstanding vacuum and developing a proper cricket ground, which was the need of the hour. Also Read: Muslim Girl Bags 5 Gold Medals In Sanskrit At Lucknow University Also Watch:","pubDate":"2022-02-13 04:41:12","full_description":"Our Sports Reporter GUWAHATI: The Tezpur University Cricket Ground, developed by Assam Cricket Association, was inaugurated today by Professor Vinod Kumar Jain, Vice-Chancellor, Tezpur University. The function was attended by president and Secretary of the Assam Cricket Association Romen Dutta and Devajit Saikia, respectively along with other officials of the association. Assam Cricket Association has developed the Tezpur University Cricket Ground including 3 centre wickets and 2 practice wickets as part of an MOU inked between the former with the latter in the year 2020. It is this newly developed venue, along with the Assam Agricultural University Ground in Jorhat - which has also been developed by Assam Cricket Association - will host the first-of-its-kind Inter-University Tournament to be organized by Assam Cricket Association in memory of Nilay Dutta, from tomorrow. Addressing the gathering, Devajit Saikia, said that the Tezpur University Cricket Ground would provide the right platform to the students of the Tezpur University as well as the cricket enthusiasts from Tezpur and its adjoining areas to showcase and hone their cricketing skills. Speaking on the occasion, Professor Vinod Kumar Jain thanked Assam Cricket Association for filling the longstanding vacuum and developing a proper cricket ground, which was the need of the hour. Also Read: Muslim Girl Bags 5 Gold Medals In Sanskrit At Lucknow University Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/13/312009-img-20220212-wa0161.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Auction: Mike Hesson Explains RCB's Acquisition Of Du Plessis","link":"https://sports.ndtv.com/cricket/ipl-2022-auction-mike-hesson-explains-royal-challengers-bangalores-acquisition-of-faf-du-plessis-2765544","keywords":null,"creator":null,"video_url":null,"description":"RCB's Director of Cricket Operations Mike Hesson explained why the franchise bought Faf du Plessis and also called him a \"highly experienced player\".","content":null,"pubDate":"2022-02-13 02:52:53","full_description":"Veteran cricketer Faf du Plessis was acquired for Rs 7 crore by Royal Challengers Bangalore (RCB) in the IPL 2022 auction on Saturday. The South African batter was involved in a bidding war between RCB, Chennai Super Kings (CSK) and Delhi Capitals (DC). A player with a lot of experience, Du Plessis can become a pivotal figure for the franchise in the upcoming season and has been backed by RCB's Director of Cricket Operations Mike Hesson. Speaking to the outfit's social media handle, Hesson said, \"We see him as a highly experienced player at the top of the order. It allows us to look at how we balance our side.\" \"He is also a really important leader in the group so really delighted to have him\", he further added. Faf du Plessis is a Royal Challenger Mike Hesson gives his thoughts after getting Faf as the first draft of the day for RCB. #PlayBold #WeAreChallengers #IPLMegaAuction #IPL2022 #IPLAuction pic.twitter.com/b9Mu744q1w Du Plessis represented CSK last season and was a crucial member as they defeated KKR in the final. Last year's Purple Cap holder Harshal Patel has also been bought by RCB for Rs 10.75 crore. Meanwhile, Sri Lankan bowler Wanindu Hasaranga has also been picked for the same price. Promoted The duo represented RCB last season too but neither was retained. Harshal had registered 32 wickets last season, which also made him the highest Indian wicket-taker in a single IPL season. Despite his efforts, RCB were knocked out in the Eliminator. Meanwhile, the auction also saw Shikhar Dhawan getting picked by Punjab Kings (PBKS) for Rs 8.25 crore. Spinner Ravichandran Ashwin was acquired by Rajasthan Royals (RR) for Rs 5 crore.","image_url":"https://c.ndtvimg.com/2019-06/go5a1e9g_faf-du-plessis-afp_625x300_20_June_19.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"'With De Kock, Holder add his name to the list': Gambhir picks Lucknow Super Giants' 'most important buy' at IPL auction - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMixwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93aXRoLXF1aW50b24tZGUta29jay1qYXNvbi1ob2xkZXItYWRkLWhpcy1uYW1lLXRvLXRoZS1saXN0LWdhdXRhbS1nYW1iaGlyLXBpY2tzLWx1Y2tub3ctc3VwZXItZ2lhbnRzLW1vc3QtaW1wb3J0YW50LWJ1eS1hdC1pcGwtMjAyMi1hdWN0aW9uLTEwMTY0NDY4OTQ5MzMzMC5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'With De Kock, Holder add his name to the list': Gambhir picks Lucknow Super Giants' 'most important buy' at IPL auction  Hindustan TimesLive Blog -- IPL 2022 Player Auction | Cricbuzz.com - Cricbuzz  CricbuzzIPL Auction 2022 Live Streaming: When And Where To Watch IPL Auction 2022 Live In Your Country?  Cricket AddictorPreity Zinta dances as Punjab Kings acquires Shikhar Dhawan for ₹8.25 crore: 'Always wanted him in our team'  Hindustan TimesIPL Mega Auction: Avesh Khan Becomes Most Expensive Uncapped Player, Enters 10-Crore Club  India.comView Full coverage on Google News","content":null,"pubDate":"2022-02-13 01:45:12","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Blindsided’: Broad tees off over Poms axing as brutal five-minute phone call revealed - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMivQFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvY3JpY2tldC1uZXdzLTIwMjEtc3R1YXJ0LWJyb2FkLWRyb3BwZWQtcmVhY3Rpb24tZW5nbGFuZC10b3VyLW9mLXdlc3QtaW5kaWVzLXRlYW0tc3F1YWQtamFtZXMtYW5kZXJzb24tY29sdW1uL25ld3Mtc3RvcnkvOTZhNDFiNzAxMGFhZjZhZDAzNWZiYWRlNzA5M2VlNjjSAb0BaHR0cHM6Ly93d3cuZm94c3BvcnRzLmNvbS5hdS9jcmlja2V0L2NyaWNrZXQtbmV3cy0yMDIxLXN0dWFydC1icm9hZC1kcm9wcGVkLXJlYWN0aW9uLWVuZ2xhbmQtdG91ci1vZi13ZXN0LWluZGllcy10ZWFtLXNxdWFkLWphbWVzLWFuZGVyc29uLWNvbHVtbi9uZXdzLXN0b3J5Lzk2YTQxYjcwMTBhYWY2YWQwMzVmYmFkZTcwOTNlZTY4?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Blindsided’: Broad tees off over Poms axing as brutal five-minute phone call revealed  Fox SportsEngland star fumes over ‘unjust’ Test axing  NEWS.com.au'Gutted' Broad breaks silence on England Test axing  cricket.com.auThe Cricket Show: Unfair to drop James Anderson and Stuart Broad? Joe Root 'lucky' to stay England captain?  Sky SportsEngland: Stuart Broad 'confused and angrier each day' after West Indies omission  BBC SportView Full coverage on Google News","content":null,"pubDate":"2022-02-13 01:33:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Mega Auction: Virat Kohli’s Royal Challengers Bangalore to take time on captaincy decision","link":"https://zeenews.india.com/cricket/ipl-2022-mega-auction-virat-kohli-s-royal-challengers-bangalore-to-take-time-on-captaincy-decision-2435977.html","keywords":null,"creator":null,"video_url":null,"description":"RCB director of cricket Mike Hesson expressed delight over buying back Harshal Patel, who was the leading wicket-taker in the 2021 edition with 32 wickets and made his India T20I debut against New Zealand last year.","content":null,"pubDate":"2022-02-13 01:21:00","full_description":"Mike Hesson, Director of Cricket Operations at Royal Challengers Bangalore (RCB) on Saturday (February 12) said the franchise will decide on their captain once the ongoing 2022 Indian Premier League (IPL) mega auction is over. On Saturday – Day 1 of the auction – Bangalore picked Faf du Plessis, Dinesh Karthik, Josh Hazlewood, Anuj Rawat and Akash Deep apart from buying back last year`s players Harshal Patel and Wanindu Hasaranga. “We haven`t had that discussion yet. We have got three incredible leaders in our group. The likes of Maxwell, Virat and Faf so we are really happy with those three leaders. Also, we got Josh Hazlewood, a leader from a bowling point of view. We are really happy with the group in terms of combination leaders. We will make the decision around captaincy after the auction,” said Hesson in the virtual press conference. Hesson expressed delight over buying back Patel, who was the leading wicket-taker in the 2021 edition with 32 wickets and made his India T20I debut against New Zealand last year. Bangalore battled past attempts from Sunrisers Hyderabad and Chennai Super Kings for a whopping sum of Rs 10.75 crore. “We are very happy as a group. We worked very hard in trying to get back a lot of our core for this year. It became pretty difficult on a few occasions. But we were delighted to get Harshal Patel back. I think we saw from all the all-rounders, Deepak Chahar, Shardul Thakur and to get Rs 10.75 crore for a proven performer like Harshal was a good buy. We are really pleased to get him back.” Hesson was delighted over getting Karthik, making his entry into RCB fold after 2015. “We are really happy with the middle order and also got the likes of DK, which gives us experience through the middle and is really important to sort of control some of the more talented players that we have got around him.” Hesson backed the specialist skills of Hasaranga, the leg-spin all-rounder from Sri Lanka, to come good in the absence of Yuzvendra Chahal, who was snapped by Rajasthan Royals. \"In terms of Wanindu Hasaranga, last year we had other options with Chahal as the local spinner. He gives us balance and has got the ability to bat anywhere between five and eight and has got some specialist skills in that area. He can bowl in power-play and middle order as well. So, he`s got some skills there.\" A message from our Spin wizard from Sri Lanka! Welcome back, Wanindu! #PlayBold #WeAreChallengers #IPLMegaAuction #IPL2022 #IPLAuction pic.twitter.com/upuqbH466B — Royal Challengers Bangalore (@RCBTweets) February 12, 2022 “We would have loved to go for Yuzvendra Chahal but the challenge is that without budget, Chahal was coming later in the auction. We knew there was a risk and was undervalued in terms of what he went for. We felt that with Hasaranga, a multi-skill player, we had another way of going about it. That was the strategy and we pretty much paid bang on in our budget for most buys today.” Hesson further remarked that they tried to buy back opener Devdutt Padikkal but he went to Rajasthan. “In terms of buying back RCB players, we had a good go at Devdutt Padikkal. Obviously, a local boy, a promising player. So, we had a go at him and get him back but then he got out of our price range.” Hesson signed off by saying that RCB still have lots of work to do on the second and final day of the mega auction. “We have got some work to do tomorrow and not getting too far ahead of ourselves. When you are building a bowling attack with the likes of Siraj and Hazlewood, obviously mainly being power-play bowlers and Harshal Patel does his work mainly through middle and end and is trying to give that versatility. We have also got Shahbaz Ahmed, who can bowl in different phases as well. We got flexibility in terms of group we have. But as I said, we still got work to do.” (with IANS inputs)","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Worrying update to Will Pucovski's latest concussion as future in cricket questioned again - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC93aWxsLXB1Y292c2tpLWNvbmN1c3Npb24tdmljdG9yaWEtcGxheWluZy1mdXR1cmUtd2lsbC1oZS1yZXRpcmUtdmlkZW8vZGRlNjliMDctZjY3Yi00NjI2LTlhZDUtM2Y1NTg0MjU4YTZk0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Worrying update to Will Pucovski's latest concussion as future in cricket questioned again  Wide World of SportsAussie prodigy’s ‘heartbreaking’ nightmare  NEWS.com.auCoach plays cool on Pucovski retirement talk but admits 24yo faces ‘tough questions’  Fox SportsWill Pucovski subbed out of Shield clash after suffering another concussion  Wide World of SportsPucovski blow overshadows Handscomb ton  Newcastle HeraldView Full coverage on Google News","content":null,"pubDate":"2022-02-13 01:11:33","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"FAQ of Auctionomics: Why Chahar got Rs 14 cr and Dhoni was retained for Rs 12 cr - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvZmFxLW9mLWF1Y3Rpb25vbWljcy13aHktY2hhaGFyLWdvdC1ycy0xNC1jci1hbmQtZGhvbmktd2FzLXJldGFpbmVkLWZvci1ycy0xMi1jci03NzY5Nzk3L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"FAQ of Auctionomics: Why Chahar got Rs 14 cr and Dhoni was retained for Rs 12 cr  The Indian ExpressBeginning of the dream for Abhinav Manohar | Cricbuzz.com - Cricbuzz  CricbuzzHarbhajan Singh Leads Reactions After Deepak Chahar Becomes Most Expensive Indian Bowler In IPL Hist..  NDTV SportsBhuvneshwar Kumar Bought By Sunrisers Hyderabad For INR 4.20 Crores In IPL 2022 Mega Auction  Cricket AddictorAbhinav Manohar: A Cindrella story at footwear shop  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-02-13 01:08:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Noor joins Quetta, Hassan replaces Nawaz","link":"https://www.thenews.com.pk/print/933094-noor-joins-quetta-hassan-replaces-nawaz","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Afghanistan’s U19 cricketer Noor Ahmed has joined Quetta Gladiators for the remaining matches in Pakistan Super League season 7.Noor, who was busy representing his country in the recently concluded ICC U19 Cricket World Cup, will be available for upcoming PSL 7 matches, said the...","content":null,"pubDate":"2022-02-13 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Justin Langer exit: Job offers flow amid Australian coaching role resignation","link":"https://thewest.com.au/sport/cricket/justin-langer-exit-job-offers-flow-amid-australian-coaching-role-resignation-c-5672528","keywords":null,"creator":["Ben Horne"],"video_url":null,"description":"The coach that Australian cricket didn’t want has been deluged with job offers both inside the game and from other sports.","content":null,"pubDate":"2022-02-12 22:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5672528/389e8b458319d49ecad66735ef25c37ff48fa2be-16x9-x0y83w2064h1161.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pucovski concussion casts doubt on cricketer’s future","link":"https://www.cairnspost.com.au/sport/cricket/pucovski-concussion-casts-doubt-on-cricketers-future/video/3a46a114c58033ca76440f0808e0974f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Another concussion to cricketer Will Pucovski has put his playing future in doubt.","content":null,"pubDate":"2022-02-12 21:40:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pucovski concussion casts doubt on cricketer’s future","link":"https://www.news.com.au/sport/cricket/pucovski-concussion-casts-doubt-on-cricketers-future/video/3a46a114c58033ca76440f0808e0974f","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Another concussion to cricketer Will Pucovski has put his playing future in doubt.","content":null,"pubDate":"2022-02-12 21:40:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket world in shock over 'horrible' moment in IPL auction","link":"https://au.sports.yahoo.com/ipl-auction-2022-cricket-shoc-horrible-moment-213843128.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-12 21:38:43","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/9c76ccf0-8c4b-11ec-84fe-eaf8d1807289","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Andrew Mcdonald cautious on coaching commitment","link":"https://www.cairnspost.com.au/sport/cricket/andrew-mcdonald-cautious-on-coaching-commitment/video/09e173bfadf813de63aff056e1d48369","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Andrew McDonald has shut down talks that he is locked in as the long term coaching option for the Australian side.","content":null,"pubDate":"2022-02-12 21:08:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Andrew Mcdonald cautious on coaching commitment","link":"https://www.news.com.au/sport/cricket/andrew-mcdonald-cautious-on-coaching-commitment/video/09e173bfadf813de63aff056e1d48369","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Andrew McDonald has shut down talks that he is locked in as the long term coaching option for the Australian side.","content":null,"pubDate":"2022-02-12 21:08:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"WB-W vs CH-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Hallyburton Johnstone Shield Match 29","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/wb-w-vs-ch-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-hallyburton-johnstone-shield-match-29?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Aman Chauhan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-12 19:27:56","full_description":"Wellington Blaze Women (WB-W) will take on Central Hinds Women (CH-W) in the 29th match of the Hallyburton Johnstone Shield at the Basin Reserve in Wellington on Saturday. Rain continues to disrupt the tournament, with the last match between the two teams being called off. Wellington Blaze Women currently hold the top spot in the table with 30 points while Central Hinds Women occupy third spot. Leigh Kasperek, Thamsyn Newton, Jessica McFadyen (wk), Rebecca Burns, Caitlin King, Deanna Doughty (c), Xara Jetly, Maneka Singh, Kate Chandler, Natasha Codyre, Georgia Plimmer. Kerry-Anne Tomlinson, Natalie Dodd (c) & (wk), Hannah Rowe, Jess Watkin, Melissa Hansen, Mikaela Greig, Georgia Atkinson, Emily Cunningham, Monique Rees, Ashtuti Kumar, Cate Pedersen. Match: Wellington Blaze Women vs Central Hinds Women, Match 29. Date and Time: February 13, 2022; 03:00 AM IST. Venue: Basin Reserve, Wellington. The track at the Basin Reserve Stadium seems to be a balanced one. There are a lot of high scores on this ground because the ball slides and comes onto the bat quite well. Jessica McFadyen: McFadyen is a talented wicketkeeper-batter. She has scored 185 in five games at an average of 37. McFadyen could prove to be valuable for her team. Maddy Green : She is a powerful batter and a handy off-spinner. Green has scored 244 runs in her last four games, including a century and two fifties at an average of 61. Maddy is a must-have for your WB-W vs CH-W Dream11 fantasy team. Jess Watkin: Watkin has been a consistent performer for her team. She has scored 111 runs in four games and has also picked up eight wickets. This makes Watkin a valuable pick for your WB-W vs CH-W Dream11 fantasy team. Xara Jetly: Jetly is a genuine wicket-taker for her team. She has picked up seven wickets in just four games in the competition so far, and could prove to be an effective pick for your Dream11 fantasy team. Maneka Singh (WB-W) – 148 points. Georgia Atkinson (CH-W) – 155 points. Mikaela Greig (CH-W) – 182 points. Xara Jetly (WB-W) – 262 points. Rebecca Burns (WB-W) – 151 points. Leigh Kasperek - 54 runs and 10 wickets in her last five games; bowling average: 13.00. Hannah Rowe - 79 runs and two wickets in her last four games; batting average: 19.75. Rebecca Burns - 84 runs in her last four games; batting average: 21.00. Fantasy Suggestion #1: Jessica McFadyen, Rebecca Burns, Emily Cunningham, Georgia Plimmer, Leigh Kasperek, Hannah Rowe, Jess Watkin, Ashtuti Kumar, Georgia Atkinson, Xara Jetly, Monique Rees. Captain: Jess Watkin. Vice-Captain: Xara Jetly. Fantasy Suggestion #2: Jessica McFadyen, Rebecca Burns, Caitlin King, Georgia Plimmer, Leigh Kasperek, Hannah Rowe, Jess Watkin, Mikaela Greig, Georgia Atkinson, Xara Jetly, Monique Rees Captain: Leigh Kasperek. Vice-Captain: Jess Watkin.","image_url":"https://static.sportskeeda.com/editor/2022/02/cac59-16446902961396-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"CTB vs CS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Ford Trophy, Match 21","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ctb-vs-cs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ford-trophy-match-21?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-12 19:27:56","full_description":"Canterbury Kings will take on Central Stags in the 21st Match of the Ford Trophy 2021-22 on Sunday, 13th February 2022 at the Mainpower Oval, Rangiora. The previous game between these two sides was unfortunately washed out due to rain. The Canterbury Kings are currently placed in fifth spot with just one win and three losses in seven games. In their previous match, they suffered a three-wicket defeat against the Wellington Firebirds. Meanwhile, the Central Stags have performed admirably and sit in top spot with three wins in six games. They are the only team that is yet to lose a game and are coming off a massive 200-run win over Otago in their last outing. Canterbury Kings Chad Bowes, Ken McClure, Daryl Mitchell, Tom Latham (wk), Leo Carter, Cole McConchie (c), Henry Shipley, Theo van Woerkom, Matt Henry, Will Williams, Ed Nuttall Central Stags Ben Smith, Bayley Wiggins (wk), Will Young, Ross Taylor, Tom Bruce (c), Josh Clarkson, Doug Bracewell, Adam Milne, Seth Rance, Blair Tickner, Jayden Lennox Match: Canterbury Kings vs Central Stags, Match 21 Date and Time: Sunday, 13th February at 3:30 AM IST Venue: Mainpower Oval, Rangiora The pitch at Mainpower Oval has been a great one for the fast bowlers. The lateral movement and bounce from the surface will be a source of worry for the batters. The pacers will try to take full advantage of the overcast conditions. Wicketkeeper Bayley Wiggins: Bayley has made a massive impact behind the stumps. He has scored 80 runs while also taking nine catches in just two games. Batters Will Young: Young is a dependable top-order batter for the Stags. He has 147 runs under his belt in two games, including one century. Leo Carter: Leo Carter is known for his consistency with the bat. He has scored 173 runs, including two half-centuries in four games. All-rounders Doug Bracewell: Bracewell has played the role of a bowling all-rounder brilliantly. He has grabbed six wickets and has scored 71 runs in three games. Henry Shipley: Henry has made valuable contributions to both departments. He has 147 runs to his name along with three wickets in four matches. Bowlers Seth Rance: Rance has been the leading bowler for his side. He has picked up eight wickets in three games while conceding at an economy of less than four. Adam Milne: Milne has troubled the batters with his express pace while also contributing with the bat. In the previous game, he grabbed two wickets and scored 50 runs at a strike rate of 238. Henry Shipley: 313 points Seth Rance: 260 points Doug Bracewell: 259 points Leo Carter: 245 points Adam Milne: 192 points Henry Shipley: Four matches, 147 runs, three wickets Seth Rance: Three matches, eight wickets Doug Bracewell: Three matches, 71 runs, six wickets Leo Carter: Four matches, 173 runs Adam Milne: Two matches, 50 runs, three wickets Fantasy Suggestion #1: Bayley Wiggins, Leo Carter, Will Young, Henry Shipley, Doug Bracewell, Seth Rance, Adam Milne, Tom Latham, Ken McClure, Theo van Woerkom, Will Williams Captain: Doug Bracewell Vice-Captain: Adam Milne Fantasy Suggestion #2: Bayley Wiggins, Leo Carter, Will Young, Henry Shipley, Doug Bracewell, Seth Rance, Adam Milne, Chad Bowes, Ross Taylor, Cole McConchie, Matt Henry Captain: Henry Shipley Vice-Captain: Seth Rance","image_url":"https://static.sportskeeda.com/editor/2022/02/fd4bf-16446906159081-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Auction: Avesh Khan Becomes The Most Expensive Uncapped Player Ever - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMidGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWF1Y3Rpb24tYXZlc2gta2hhbi1iZWNvbWVzLXRoZS1tb3N0LWV4cGVuc2l2ZS11bmNhcHBlZC1wbGF5ZXItZXZlci0yNzY1MjE00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Auction: Avesh Khan Becomes The Most Expensive Uncapped Player Ever  NDTV SportsLive Blog -- IPL 2022 Player Auction | Cricbuzz.com - Cricbuzz  CricbuzzIPL Auction 2022 Live Streaming: When And Where To Watch IPL Auction 2022 Live In Your Country?  Cricket AddictorFrom Ishan Kishan to Yuvraj Singh: Top five most expensive Indian buys in IPL auction  WIONKKR land Shreyas Iyer for INR 12.25 crore | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-02-12 17:49:10","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Mega Auction: List Of Players Sold On First Day - OTV News","link":"https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vb2Rpc2hhdHYuaW4vbmV3cy9zcG9ydHMvLWlwbC1tZWdhLWF1Y3Rpb24tbGlzdC1vZi1wbGF5ZXJzLXNvbGQtb24tZmlyc3QtZGF5LTE3MDQ2N9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL Mega Auction: List Of Players Sold On First Day  OTV NewsAs Faf du Plessis' CSK Journey Ends, Team & Wife Post Emotional Messages: IPL Auction | The Quint  The QuintAshwin sold to RR: Ashwin joins Rajasthan Royals  InsideSportPurple Cap holder Harshal Patel returns to RCB for Rs 10.75 crore in IPL auction  SportstarDevdutt Padikkal Bought By Rajasthan Royals (RR) For INR 7.75 Crores In IPL 2022 Mega Auction  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-02-12 16:56:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Auction 2022: Avesh Khan becomes most expensive uncapped player, goes to Lucknow for Rs 10 crore - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMivgFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaXBsLWF1Y3Rpb24tMjAyMi1hdmVzaC1raGFuLWJlY29tZXMtbW9zdC1leHBlbnNpdmUtdW5jYXBwZWQtcGxheWVyLWdvZXMtdG8tbHVja25vdy1mb3ItcnMtMTAtY3JvcmUvYXJ0aWNsZXNob3cvODk1MzIyMDMuY21z0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL Auction 2022: Avesh Khan becomes most expensive uncapped player, goes to Lucknow for Rs 10 crore  Times of IndiaLive Blog -- IPL 2022 Player Auction | Cricbuzz.com - Cricbuzz  CricbuzzIPL Auction 2022 Live Streaming: When And Where To Watch IPL Auction 2022 Live In Your Country?  Cricket AddictorPreity Zinta dances as Punjab Kings acquires Shikhar Dhawan for ₹8.25 crore: 'Always wanted him in our team'  Hindustan Times‘Very long term in terms of our thinking’ – KKR CEO Venky Mysore on splashing INR 12.25 crore on Shreyas Iyer in mega auction  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-02-12 16:54:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Auction 2022: Cannot believe we bought David Warner for INR 6.25 crore, says DC owner","link":"https://www.thehansindia.com/sports/cricket/ipl-auction-2022-cannot-believe-we-bought-david-warner-for-inr-625-crore-says-dc-owner-728967","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"DC signed Warner for INR 6.25 croreWarner started his IPL career with Delhi in 2009The Aussie captained SRH to IPL title in 2016","content":"David WarnerDavid WarnerDelhi Capitals (DC) co-owner Parth Jindal has expressed his delight of signing Warner before adding he \"cannot believe that we got such a legend at INR 6.25 crore\".Warner returned to his former franchise as DC bought the Australian opener at the Indian Premier League (IPL) Auction 2022 on Saturday. Warner was joined by his Australia teammate Mitchell Marsh at DC. The duo won the T20 World Cup with Australia in 2021 and Marsh went on to win the Big Bash League (BBL) 2021-22 with Perth Scorchers. \"Absolutely excited to buy David Warner. I cannot believe that we got such a legend at Rs 6.25 crore. With Warner and Prithvi Shaw opening the batting, it will be an explosive start to every single Delhi Capitals innings. It was really strange because we thought the price will go up. There was a lot of tactical stuff going on by the other teams. David Warner, the guy who won Australia the T20 World Cup is back in Delhi. We welcome Davey, and all his Insta stories and his shenanigans to the Capitals. We cannot wait to have him at the Capitals,\" added Jindal in an interview on Saturday. Warner, who started his IPL career with then-Delhi Daredevils in 2009, captained Sunrisers Hyderabad (SRH) to IPL title in 2016. Expressing his excitement at joining DC, Warner said, \"I am coming back to where it all started. I am really excited. Can't wait to see you all very soon over in India. Looking forward to it.\" View this post on Instagram A post shared by David Warner (@davidwarner31) Having scored as many as 5,449 runs in 150 matches at an average of 41.59, the Australian southpaw is the fifth-highest run-scorer in IPL history. He has four centuries and 50 fifties to his name, the most in the tournament.IPL Auction 2022: Stoked to be a part of DC, says MarshMeanwhile, Marsh pipped Warner in his IPL price. DC paid INR 6.50 crore for the Western Australian all-rounder. \"I am absolutely stoked to be a part of Delhi Capitals team. What an amazing franchise so to be a part of. Looking forward to get over to India in a few months time and represent our fan base. See you guys there, soon,\" said Marsh, who played a crucial part in Australia's maiden T20 World Cup win. Marsh scored 185 runs in six games at an average of 61.67 and was named as the Player of the Match in the World Cup final for scoring 77 runs in 50 balls against New Zealand at the Dubai International Cricket Stadium in November.Waiting for you to come and do what you do best in T20s 🔥Welcome to the family Mitch 💙#YehHaiNayiDilli #IPLAuction #IPL2022 pic.twitter.com/fn3VRkDoDk— Delhi Capitals (@DelhiCapitals) February 12, 2022 The 30-year-old Australian cricketer also scored his maiden T20 ton recently during the BBL season.","pubDate":"2022-02-12 16:32:23","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/02/12/500x300_1274564-david-warner.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Auction 2022: MI see Ishan Kishan as their future captain, says Irfan Pathan","link":"https://www.thehansindia.com/sports/cricket/ipl-auction-2022-mi-see-ishan-kishan-as-their-future-captain-says-irfan-pathan-728964","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"MI have re-signed Ishan Kishan at INR 15.25 croreKishan has been a part of MI since 2018MI have made only 2 signings so far","content":"Irfan PathanIrfan PathanFormer India all-rounder Irfan Pathan has said Mumbai Indians (MI) are looking at Ishan Kishan as their future captain and that's why they spent so much on the batsman.After releasing Kishan ahead of the Indian Premier League (IPL) Auction 2022, MI bought him again at INR 15.25 crore. Kishan is the second-most expensive Indian signing in an IPL auction, while he is the costliest in the ongoing auction. \"He has the potential to be the future captain as well, not right now. They still have Keiron Pollard who can lead, Bumrah who is a leader himself, they have Suryakumar Yadav who could be the prospect for leadership as well. So, they want to invest for the next 5-7 years, that's why they went after Ishan Kishan so clearly and they knew that no matter what we needed to go back to Ishan Kishan,\" Pathan said on Star Sports' show 'Cricket Live -- IPL Auction Special'.The pic says it all! 💙#OneFamily #MumbaiIndians #AalaRe #IPLAuction @surya_14kumar @ishankishan51 pic.twitter.com/y2eOTUBnyY— Mumbai Indians (@mipaltan) February 12, 2022 After making his IPL debut with Gujarat Lions in 2016, Kishan was bought by MI during the 2018 auction. \"I haven't seen in the Auction table, Mumbai Indian talking so much and taking a longer break than this in my history of this Auction list,\" Pathan added further. IPL Auction 2022: Price tag won't affect Ishan Kishan, says Sanjay Manjrekar Meanwhile, Sanjay Manjrekar has backed Kishan to go on with his usual business with the bat unffected by his high price at the IPL Auction 2022. \"I don't think the price tag will affect him too much because the team has shown great faith in him. I am sure it's something they would have told him,\" Sanjay Manjrekar told Star Sports. \"When we talk bout huge price tags, bringing a lot of pressure, the player feels the pressure when the team is gambling on him. Someone like Nicholas Pooran (Rs 10.75 crore by SunRisers Hyderabad) can feel pressure. We saw how Yuvraj Singh, when he was sold for Rs 14 crore again, his own confidence went down. He was on the slide, Ishan Kishan is at the peak of the powers. He is at the same franchise, I don't think the price tag is going to affect him. I don't think Ishan Kishan will feel the pressure at all,\" Majrekar added further. The former India cricketer went on to add that MI have shown a lot of faith in Kishan, who has scored 1,133 runs in 45 matches at a strike rate of 138.50 for the five-time IPL champions. \"Clearly what you can see is they retained four players. Rohit Sharma, Suryakumar Yadav, Jasprit Bumrah and Kieron Pollard. If they could retain 5, they would have retained Ishan Kishan. They were desperate to retain him but they couldn't. But they were like 'come what may, we will buy him back from the market'. So now Ishan Kishan is going to be part of a team where he feels really wanted,\" the cricketer-turned-commentator added further. On the Day 1 of the mega auction, MI have so far bought only two players: Kishan and South Africa's Dewald Brevis, who is also fondly called 'Baby AB'.","pubDate":"2022-02-12 15:38:39","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/02/12/500x300_1274414-irfan-pathan.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"}]}