{"newsArray":[{"title":"Bradford Premier League and club chair on Keighley disaster","link":"https://www.thetelegraphandargus.co.uk/news/20848923.bradford-premier-league-club-chair-keighley-disaster/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"KEIGHLEY Cricket Club have been plunged into relegation danger in the Bradford Premier League and the club chairman and league CEO have had their say.","content":null,"pubDate":"2022-08-30 23:25:00","image_url":"https://www.thetelegraphandargus.co.uk/resources/images/13758646/?type=app&htype=19","source_id":"thetelegraphandargus","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Hong Kong team players list Asia Cup 2022: How many Hong Kong players are from India and Pakistan?","link":"https://thesportsrush.com/cricket-news-hong-kong-team-players-list-asia-cup-2022-how-many-hong-kong-players-are-from-india-and-pakistan/","keywords":["Cricket","Asia Cup 2022","Hong Kong","India","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Hong Kong team players list Asia Cup 2022: The Hong Kong side remained unbeaten in the ‘Qualifiers’ to qualify for the ongoing Asia Cup 2022. Set to face India for the third time ever in International Cricket, and the first time in T20Is, Hong Kong will play their opening match of the ongoing Asia Cup… The post Hong Kong team players list Asia Cup 2022: How many Hong Kong players are from India and Pakistan? appeared first on The SportsRush.","content":"Hong Kong team players list Asia Cup 2022: The Hong Kong side remained unbeaten in the ‘Qualifiers’ to qualify for the ongoing Asia Cup 2022. Set to face India for the third time ever in International Cricket, and the first time in T20Is, Hong Kong will play their opening match of the ongoing Asia Cup 2022 at the Dubai International Stadium today. Having faced defeats in each of the other two occasions against India during the Asia Cup (2008, 2018) itself, the Nizakat Khan-led side know that they will expect nothing different from the current Indian side either, who are yet again favourites to bag the continental supremacy title. The one aspect of their 17-member Asia Cup 2022 squad, however, is the fact that none of their players originally hail from Hong Kong. For those unaware, 12 out of the 17 players in the Hong Kong squad are Pakistan-origins, 4 from India, and the remaining one from Great Britain. Two of Hong Kong’s most experienced players, with an experience of 51 and 32 T20Is respectively, skipper Nizakat Khan and Babar Hayat were born in the city of Attock, in Pakistan’s Punjab province. The remaining Pakistan-origin players are Zeeshan Ali, Haroon Arshad, Ehsan Khan, Mohammad Ghazanfar, Ateeq Iqbal, Mohammad Waheed, Wajid Shah, Aftab Hussain, and Yasim Murtaza. Born in Mumbai in December 1995, batting all-rounder Kinchit Shah has a rich international experience of 10 ODIS and 43 T20Is for Hong Kong. Although left-arm pacer Dhananjay Rao was born in Hong Kong, his parents were born and brought up in India. With an experience of 5 T20Is for Hong Kong, right-arm medium pacer Ayush Shukla has five wickets under his name as well. 17-year-old Ahan Trivedi, is yet to make his international appearance for Hong Kong. Finally, the 31-year-old wicket-keeper batter Scott McKechnie, who was born in Salford, Manchester, happens to be the only British-origin player in the Hong Kong squad.","pubDate":"2022-08-30 19:44:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bangladesh vs Afghanistan, Asia Cup 2022 Highlights: Zadran powers AFG to victory - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMidGh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9iYW5nbGFkZXNoLXZzLWFmZ2hhbmlzdGFuLWFzaWEtY3VwLTIwMjItbGl2ZS1zY29yZS11cGRhdGVzLTgxMjA4NjQv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs Afghanistan, Asia Cup 2022 Highlights: Zadran powers AFG to victory  The Indian ExpressBAN vs AFG T20I Asia Cup Highlights: Najib, Ibrahim Stun BAN To Take AFG To Super 4s  Cricket Country NewsBAN vs AFG Highlights, Asia Cup 2022 - Afghanistan 131/3 vs Bangladesh 127/7; Become First Team to Enter Su  News18Live: Asia Cup 2022: Md Nabi addresses media post-victory against Bangladesh | Live News  ANI NewsAsia Cup Highlights: Afghanistan defeat Bangladesh, into Super 4 stage  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-08-30 19:02:31","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BAN vs AFG T20I Asia Cup Highlights: Najib, Ibrahim Stun BAN To Take AFG To Super 4s - Cricket Country News","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL3d3dy5jcmlja2V0Y291bnRyeS5jb20vbmV3cy9iYW4tdnMtYWZnLXQyMGktYXNpYS1jdXAtMjAyMi1zdHJlYW1pbmctaG90c3Rhci1jb21tZW50YXJ5LWJhbmdsYWRlc2gtdnMtYWZnaGFuaXN0YW4tcmFzaGlkLXNoYWtpYi1uYWJpLWd1cmJhei1tdWplZWItdmlkZW8taGlnaGxpZ2h0cy0xMDM5MDUz0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BAN vs AFG T20I Asia Cup Highlights: Najib, Ibrahim Stun BAN To Take AFG To Super 4s  Cricket Country NewsBangladesh vs Afghanistan, Asia Cup 2022 Highlights: Zadran powers AFG to victory  The Indian ExpressBAN vs AFG Highlights, Asia Cup 2022 - Afghanistan 131/3 vs Bangladesh 127/7; Become First Team to Enter Su  News18LIVE BAN vs AFG T20I Asia Cup 2022 Score: Najib, Ibrahim Stun BAN To Take AFG To Super 4s  Cricket Country NewsLive: Asia Cup 2022: Md Nabi addresses media post-victory against Bangladesh | Live News  ANI NewsView Full coverage on Google News","content":null,"pubDate":"2022-08-30 18:56:09","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BAN vs AFG, Asia Cup 2022 Highlights: Afghanistan qualify for Super 4 after hammering Bangladesh - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2JhbmdsYWRlc2gtdnMtYWZnaGFuaXN0YW4tYXNpYS1jdXAtbGl2ZS1zY29yZS1iYW4tdnMtYWZnLXVwZGF0ZXMtc2hhcmphaC0xOTk0NDQ4LTIwMjItMDgtMzDSAY4BaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvc3BvcnRzL2NyaWNrZXQvc3RvcnkvYmFuZ2xhZGVzaC12cy1hZmdoYW5pc3Rhbi1hc2lhLWN1cC1saXZlLXNjb3JlLWJhbi12cy1hZmctdXBkYXRlcy1zaGFyamFoLTE5OTQ0NDgtMjAyMi0wOC0zMA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BAN vs AFG, Asia Cup 2022 Highlights: Afghanistan qualify for Super 4 after hammering Bangladesh  India TodayBAN vs AFG T20I Asia Cup Highlights: Najib, Ibrahim Stun BAN To Take AFG To Super 4s  Cricket Country NewsBangladesh vs Afghanistan, Asia Cup 2022 Highlights: Zadran powers AFG to victory  The Indian ExpressLive Cricket Score - Bangladesh vs Afghanistan, Group B, Asia Cup 2022 | Cricbuzz.com - Cricbuzz  CricbuzzNajibullah’s hitting swung match in our favour, says Afghanistan skipper after win over Bangladesh  ThePrintView Full coverage on Google News","content":null,"pubDate":"2022-08-30 18:50:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"WA cricket team head to South West for 2022 preseason camp","link":"https://thewest.com.au/news/south-west/wa-cricket-team-head-to-south-west-for-2022-preseason-camp--c-8016967","keywords":null,"creator":["Melissa Pedelty"],"video_url":null,"description":"Up to 150 Manjimup students from Years 4 to 6 had the opportunity of a lifetime when they were visited by their cricket idols who ran them through a series of activities at the Cricket WA clinic last week.","content":null,"pubDate":"2022-08-30 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8016967/6258767e420739e67e4ed8fd0ce0d11f6c97edd2-16x9-x0y96w1024h576.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Zadran brothers: Are Najibullah Zadran and Ibrahim Zadran related as brothers?","link":"https://thesportsrush.com/cricket-news-zadran-brothers-are-najibullah-zadran-and-ibrahim-zadran-related-as-brothers/","keywords":["Cricket","Afghanistan","asia cup","Asia Cup 2022","Bangladesh","Ibrahim Zadran","Najibullah Zadran"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Najibullah Zadran and Ibrahim Zadran: The two Afghani batters put together a match-winning partnership tonight. The Zadrans, consisting of Ibrahim and Najibullah, put together a match-winning 33-ball 69-run fourth-wicket partnership to power Afghanistan to a thumping 7-wicket victory against Bangladesh tonight. Chasing a 128-run target on a tricky Sharjah Cricket Stadium pitch, Afghanistan needed 66… The post Zadran brothers: Are Najibullah Zadran and Ibrahim Zadran related as brothers? appeared first on The SportsRush.","content":"Najibullah Zadran and Ibrahim Zadran: The two Afghani batters put together a match-winning partnership tonight. The Zadrans, consisting of Ibrahim and Najibullah, put together a match-winning 33-ball 69-run fourth-wicket partnership to power Afghanistan to a thumping 7-wicket victory against Bangladesh tonight. Chasing a 128-run target on a tricky Sharjah Cricket Stadium pitch, Afghanistan needed 66 runs in seven overs to win the match when captain Mohammad Nabi (8) failed to justify his batting promotion. Despite Ibrahim hitting Bangladesh fast bowler Taskin Ahmed for consecutive boundaries in the 15th over, Afghanistan still needed 52 runs in the last five overs. Najibullah, who had scored just three runs off his first six deliveries, hit three sixes off the next five balls to bring down the equation to needing 26 runs in three overs. Ibrahim’s boundary and Najibullah’s four and two back-to-back sixes off Mohammad Saifuddin put Afghanistan in a commanding position before Najibullah hit another six to seal the chase in the penultimate over. While Ibrahim scored 42* (41) with the help of four fours, Najibullah turned the tables with his 43* (17) coming at a strike rate of 252.94 and comprising of a four and six sixes. Having already defeated Sri Lanka by 8 wickets on Saturday, Afghanistan have become the first team to qualify for Asia Cup 2022 Super 4 round. The development means that Sri Lanka and Bangladesh will be playing a virtual knockout for the second Group B spot on Thursday. Najibullah! No surprises. #gun — Peter Borren (@dutchiepdb) August 30, 2022 Fans perceiving Ibrahim and Najibullah to be brothers is understandable because of both the cricketers sharing the same surname but it is noteworthy that the two are not related to each other. Ibrahim, 20, was born in Khost. Najibullah, 29, on the other hand, was born in Logar. While Ibrahim has represented Afghanistan in all three formats in his three-year career, Najibullah has played 159 white-ball matches for Afghanistan in his decade-long career.","pubDate":"2022-08-30 17:59:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs PAK 2022: पूर्व भारतीय दिग्गज कपिल देव का बयान, ना भारत जीता न पाकिस्तान, क्रिकेट जीता","link":"https://www.abplive.com/sports/cricket/after-india-s-victory-against-pakistan-in-the-asia-cup-2022-match-former-indian-captain-kapil-dev-said-that-neither-india-won-nor-pakistan-won-cricket-2204283","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"Kapil Dev On IND vs PAK 2022: रविवार को एशिया कप 2022 के मैच में भारत ने पाकिस्तान को 5 विकेट से हरा दिया. इस मैच में भारतीय कप्तान रोहित शर्मा ने टॉस जीतकर पहले फील्डिंग करने का फैसला किया. पहले बल्लेबाजी करने उतरी पाकिस्तान की टीम 19.5 ओवर में 147 रनों पर सिमट गई. पाकिस्तान के 147 रनों के जवाब में बल्लेबाजी करने उतरी भारतीय टीम की शुरूआत बेहद खराब रही. ओपनर केएल राहुल बिना कोई रन बनाए आउट हो गए. इसके अलावा सूर्यकुमार यादव भी जल्दी आउट हो गए. अब पूर्व भारतीय कप्तान कपिल देव ने इस मैच पर अपनी प्रतिक्रिया दी है. ना भारत जीता न पाकिस्तान, क्रिकेट जीता- कपिल देव पूर्व भारतीय कप्तान कपिल देव ने कहा कि मेरे मुताबिक क्रिकेट की जीत हुई, ना भारत जीता न पाकिस्तान, क्रिकेट जीता. पूर्व भारतीय कप्तान ने कहा कि दोनों टीमों के बीच शानदार मैच हुआ, दोनों टीमों ने शानदार खेल का नजारा पेश किया. कपिल देव ने आगे कहा कि दोनों टीमों ने शानदार प्रदर्शन किया, लेकिन जिस टीम को जीत मिली वह लाजिमी है कि ज्यादा खुश होगी. वहीं, हारने वाली टीम अगले मैच का इंतजार करेगी. यही इस खेल का असली मजा है. I can only say Cricket won, it's not India-Pakistan. Match was really fantastic. I think both teams played so well. Team which wins get much more joy while those who lose can say that they'll try next time. That's what sport is about: Veteran cricketer Kapil Dev to ANI#INDvsPAK pic.twitter.com/hb0TSz0X71 — ANI (@ANI) August 30, 2022 31 अगस्त को हांगकांग के सामने होगी टीम इंडिया वहीं, अब भारतीय टीम 31 अगस्त को अपना दूसरा मैच हांगकांग के खिलाफ खेलेगी. इस मैच से पहले हांगकांग के कप्तान निजाकत खान ने विराट कोहली के फॉर्म पर बयान देते हुए कहा कि मैं उनका बहुत बड़ा फैन हूं. विराट की पाकिस्तान के खिलाफ खिलाफ अहम पारी थी. निजाकत ने कहा कि वह चाहते हैं कि दिग्गज बल्लेबाज विराट कोहली एक बार फिर से ढेर सारे रन बनाएं. उन्होंने कहा कि हम वास्तव में चाहते हैं कि वह फॉर्म में वापस आएं और ढेर सारे रन बनाएं. ये भी पढ़ें- Asia Cup 2022: हार्दिक पांड्या के ट्वीट पर मोहम्मद आमिर का रिप्लाई वायरल, देखें पाकिस्तानी गेंदबाज का जवाब Team India के लिए पावर प्ले में इस बैट्समैन ने बनाए हैं सबसे ज्यादा रन, जानें किस नंबर पर शुभमन गिल","content":null,"pubDate":"2022-08-30 16:45:09","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Asia Cup: 'There was a rumour that I had died,' says Ravindra Jadeja","link":"https://www.thehansindia.com/sports/cricket/asia-cup-there-was-a-rumour-that-i-had-died-says-ravindra-jadeja-759827","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India defeated Pakistan by 5 wickets on SundayJadeja scored an important 29-ball 35India next take on Hong Kong on Wednesday in Dubai","content":"Asia Cup: ‘There was a rumour that I had died,’ says Ravindra Jadeja India all-rounder Ravindra Jadeja has said there was a \"rumour\" that he had died and has decided to not pay attention to all the chatter around him in the cricket fraternity. In a pre-match conference ahead of India's Asia Cup fixture against Hong Kong, Jadeja also spoke about reports that suggested he had been ruled out of the upcoming T20 World Cup due to a rib injury that had forced him to withdraw from the Indian Premier League (IPL) 2022. \"You have mentioned a very minor example (of a rumour) that I won't be available for the World Cup. In between, there was a rumour that I had died. It can't get bigger than this. I don't think about all these (rumours). I focus on going to the ground, playing and performing well for the country,\" Jadeja said on Tuesday. \"I want to improve on whatever is needed to perform well for my team. That's it. Day in and day out, I practice bowling, batting and fielding,\" the all-rounder added. The rumours began after his forgettable IPL 2022 campaign with Chennai Super Kings (CSK). Just two days before the tournament, CSK appointed Jadeja their new captain, but he stepped down midway through the tournament, handing over the reigns back to MS Dhoni. Jadeja played a vital role in India's five-wicket victory over Pakistan in their opening fixture of Asia Cup 2022 on Sunday. He gave away just 11 runs in two overs with the ball and followed that with an important 35 off 29 deliveries in India's successful chase. Asia Cup: We will not take Hong Kong lightly, says Jadeja Speaking about India's clash with Hong Kong, which is on Wednesday at the Dubai International Cricket Stadium, Jadeja said that the team was going into the game with a \"positive mindset\" and will not take the associate side \"lightly\". \"We are going to play against Hong Kong with a positive mindset and we will not take them lightly. On a given day, anything can happen in T20Is. We will give our best and play positively. We will think too far ahead until the World Cup. We are here, we will look to play against Hong Kong. After that, we will see which team we will play against,\" Jadeja added. Even though the pacers claimed all the wickets against Pakistan, Jadeja said the spinners bowled well too. \"Spinners also contributed. But sometimes it happens that you bowl well and you do not get wickets but fast bowlers do not bowl that well but get wickets. T20I is like that. The pacers get wickets on a full toss sometimes. Everyone bowled well and pacers gave us wickets when we needed them. Hardik Pandya gave us breakthroughs, then Bhuvneshwar took two in an over. \"Sometimes, left-arm spinners and leg spinners are bowling, so sending left-handed batters is easy and they can take chances. That is why I was promoted. We had seen their (Pakistan) playing XI, they had a left-arm spinner and leg spinner. So I was aware that I could face this situation. I prepared myself mentally accordingly. Luckily, I went and my knock was crucial,\" Jadeja added further.","pubDate":"2022-08-30 16:35:24","image_url":"https://assets.thehansindia.com/h-upload/2022/08/30/500x300_1310121-ravindra-jadeja.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"“Pitch reporter needed in Sharjah”: Scott Styris trolls himself as he reads Sharjah pitch incorrectly during BAN vs AFG Asia Cup 2022 match","link":"https://thesportsrush.com/cricket-news-pitch-reporter-needed-in-sharjah-scott-styris-trolls-himself-as-he-reads-sharjah-pitch-incorrectly-during-ban-vs-afg-asia-cup-2022-match/","keywords":["Cricket","Afghanistan","Asia Cup 2022","Bangladesh","Scott Styris","Sharjah Cricket Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Scott Styris trolls himself after reading the pitch at the Sharjah Cricket Stadium horribly wrong during the third Asia Cup 2022 match. During the second ‘Group B’ match of the ongoing Asia Cup 2022 between Afghanistan and Bangladesh at the Sharjah Cricket Ground, former New Zealand all-rounder Scott Styris got his pitch report horribly wrong,… The post “Pitch reporter needed in Sharjah”: Scott Styris trolls himself as he reads Sharjah pitch incorrectly during BAN vs AFG Asia Cup 2022 match appeared first on The SportsRush.","content":"Scott Styris trolls himself after reading the pitch at the Sharjah Cricket Stadium horribly wrong during the third Asia Cup 2022 match. During the second ‘Group B’ match of the ongoing Asia Cup 2022 between Afghanistan and Bangladesh at the Sharjah Cricket Ground, former New Zealand all-rounder Scott Styris got his pitch report horribly wrong, as the Afghanistan spinners were yet again at their sensational best right from the get-go. With sides batting first having won the previous four T20Is at this venue, Bangladesh skipper opted to bat first post winning the Toss. However, proceedings went haywire for them right from the start, as the Afghan right-arm spinner Mujeeb-ur-Rahman (4-0-16-3), sent their top-3 batters, including skipper Shakib-al-Hasan (11 off 9) back in the hut within the Powerplay itself. With spinners getting significant purchase, Mohammad Nabi introduced his champion spinner Rashid Khan right after the Powerplay as well, with the latter now getting rid of Bangladesh’s experienced wicket-keeper batter Mushfiqur Rahim (1 off 4), with the scorecard reading 28/4. Scott Styris trolls himself Post Shakib’s decision to bat first, former New Zealand all-rounder Scott Styris, via his pitch report for the day, backed the former’s decision, considering the Sharjah pitch ‘amazing to bat on’. With the venue hosting its first T20I since November last year, Styris even predicted Bangladesh to post around the 200-run mark. “This looks amazing to bat on. It is a very good toss to win for Bangladesh, they can put on a big score – somewhere near 200. This ground hasn’t had any cricket for a few months, so it has got enough time to regenerate. Shakib – you are my man today, opined Styris in his pitch report. With spinners dominating the proceedings, and Bangladesh looking nowhere near to touch even the 150-run mark, the former Kiwi international took to his Twitter handle, to laugh at himself, while hilariously coming up with a Job Vacancy advertisement for a Sharjah pitch reporter, without any minimum qualification requirement. He even seemed to express his anger at the choice of shots by majority of the Bangladeshi batters, who attempted to play across the line, bringing out the sweeps and the slog-sweeps out of their casket, rather than playing straight. JOB VACANCY: Pitch Reporter needed in Sharjah! No experience needed. Can’t be worse #PlayStraightFFS — Scott Styris (@scottbstyris) August 30, 2022 For more Cricket-related news, click here. The post “Pitch reporter needed in Sharjah”: Scott Styris trolls himself as he reads Sharjah pitch incorrectly during BAN vs AFG Asia Cup 2022 match appeared first on The SportsRush.","pubDate":"2022-08-30 16:30:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Hong Kong Asia Cup 2018: India vs Hong Kong T20 all match list","link":"https://thesportsrush.com/cricket-news-india-vs-hong-kong-asia-cup-2018-india-vs-hong-kong-t20-all-match-list/","keywords":["Cricket","asia cup","Asia Cup 2022","Hong Kong","India"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Hong Kong T20 all match list: The two teams will be playing only their third match at the highest level against each other tomorrow. The fourth match of Asia Cup 2022 will be played between India and Hong Kong in Dubai tomorrow. The match will only be the third international match to be… The post India vs Hong Kong Asia Cup 2018: India vs Hong Kong T20 all match list appeared first on The SportsRush.","content":"India vs Hong Kong T20 all match list: The two teams will be playing only their third match at the highest level against each other tomorrow. The fourth match of Asia Cup 2022 will be played between India and Hong Kong in Dubai tomorrow. The match will only be the third international match to be played by these two teams. While India kick-started their Asia Cup 2022 journey with a victory against Pakistan at the Dubai International Cricket Stadium on Sunday, Hong Kong will be playing their first match after remaining unbeaten in the Qualifier round in Oman earlier this month. Coming on the back of three consecutive wins against Singapore, Kuwait and UAE, Hong Kong would be banking on their current form despite facing a substantially better opposition in India on Wednesday. India vs Hong Kong Asia Cup 2018 Set to play a match against each other after four years, the last India vs Hong Kong match had been played during Asia Cup 2018 at the same venue. Getting Match Ready! #TeamIndia | #AsiaCup2022 | #INDvHK pic.twitter.com/DuPwgatgQc — BCCI (@BCCI) August 30, 2022 Chasing a 286-run target, Hong Kong had put on display more than just early signs of a scare primarily due to a 174-run opening partnership between current and the then captain in Nizakat Khan and Anshy Rath respectively. However, having lost wickets at regular intervals from the 35th over onward had found them short of 26 runs eventually. In what was his 14th ODI century, India opening batter Shikhar Dhawan had scored a match-winning 127 (120) back in the day. ALSO READ: Dubai International Cricket Stadium T20I records The first-ever India-Hong Kong encounter was also played in the Asia Cup. It was during the 2008 edition that India had defeated Hong Kong by a mammoth 256 runs. A 166-run fourth-wicket partnership between Suresh Raina (101) and Mahendra Singh Dhoni (109*) had played a pivotal role in a victory at the National Stadium, Karachi. India vs Hong Kong T20 all match list It is worth mentioning that India and Hong Kong will be playing their first-ever T20I against each other tomorrow. The post India vs Hong Kong Asia Cup 2018: India vs Hong Kong T20 all match list appeared first on The SportsRush.","pubDate":"2022-08-30 16:21:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"This is our chance to show them we can compete: Hong Kong captain sends warning to Rohit Sharma's Team India","link":"https://zeenews.india.com/cricket/india-vs-hong-kong-asia-cup-2022-hong-kong-captain-nizakat-khan-confident-of-quality-performance-against-rohit-sharmas-team-india-2503757.html","keywords":null,"creator":null,"video_url":null,"description":"The skipper said that any team can beat their opponent on a given day in T20I cricket and team showed fine form in Oman during Asia Cup qualifiers, which it won.","content":"Ahead of their Group A match against India at the ongoing Asia Cup 2022 , Hong Kong captain Nizakat Khan said on Tuesday that the opportunity to play against India and Pakistan is huge and his side wants to play good cricket. India and Hong Kong will lock horns in Group A at the ongoing Asia Cup 2022 on Wednesday. Watch the Team HK at the Asia Cup 2022 in Dubai Live on NOWTV - Channel 674 or Buy the Asia Cup Package on YuppTV App on Android or iOS devices _India vs HK on 31st August at 9:50pm HKT _Pakistan vs HK on 2nd September at 9:50 HKT #ACC #AsiaCup2022 #GetReadyForEpic pic.twitter.com/z12tEeUryV — Cricket Hong Kong (@CricketHK) August 29, 2022 \"Winning and losing is a part of the game. We want to play good cricket and it is important. It is a massive opportunity to play against India and Pakistan. We have a young squad and it is a great opportunity for us. We look forward to learning and moving forward I am sure we will play more Test nations,\" said Nizakat in a press conference. The skipper said that any team can beat their opponent on a given day in T20I cricket and team showed fine form in Oman during Asia Cup qualifiers, which it won. Recalling their last close meeting with India during Asia Cup 2018 which it lost by 26 runs, Nizakat said that the side will make sure that they repeat the mistakes made last time playing against the Asian giant. He also said that his side is prepared to take on top-class pacers even though it does not face them often in associate cricket. \"Gap (between bigger and small teams) is opportunities. This is our chance to show them we can compete,\" he added. Head coach Trent Johnson also remarked that Hong Kong does not get a lot of opportunities to play against India and Pakistan and any opportunity to play against such teams is huge. \"It is amazing what they (Hong Kong) have achieved so far. It is about playing good cricket and enjoying yourself. Hong Kong deserves to be at this stage,\" he added. The coach said that the work ethic of the team is phenomenal and this exposure during Asia Cup will promote cricket in the country. The Asian Cricket Council's marquee event returns after a four-year interval with the 2022 edition of the Men's Asia Cup. Being played in the T20 format, across two venues. Dubai International Cricket Stadium will host nine games including the final, while Sharjah Cricket Stadium will host four games, starting August 27 through September 11.","pubDate":"2022-08-30 16:15:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Once Read, I Had Died...\": Ravindra Jadeja On Rumours Regarding Him","link":"https://sports.ndtv.com/cricket/once-read-i-had-died-ravindra-jadejas-hilarious-take-on-rumours-regarding-him-3301211","keywords":null,"creator":null,"video_url":null,"description":"Talking about the rumours that keeping surfacing about him on the internet, Indian cricket team allrounder Ravindra Jadeja had a hilarious incident to narrate.","content":"Cricketers, that too from the Indian team, often have to go through intense scrutiny on social media. Their success is celebrated wildly while their failures are criticised quite strongly. Sometimes false rumours do the rounds regarding their private lives too. Talking about the rumours that keeping surfacing about him on the internet, Indian cricket team allrounder Ravindra Jadeja had a hilarious incident to narrate. \"You are talking about me not being a part of the T20 World Cup squad, this is nothing. I had once read that I have died (laughs). I do not think about all this, I just look to give my best. You just need to practice and improve and this is the key to success,\" Jadeja said in a press conference on Tuesday. Ravindra Jadeja is currently playing in the Asia Cup where India beat Pakistan in their first match on Sunday. They will next face Hong Kong on Wednesday. In the game against Pakistan, Hardik Pandya produced a special all-round effort as India held nerves to pull off an exciting five-wicket win. Hardik (3/25 in 4 overs) showed his high value under extreme pressure as his well-directed short balls helped India bowl out Pakistan for 147. It should have been straight forward chase but India's experienced top-three faltered, putting extra pressure on the middle order. Hardik (33 not out off 17) and Ravindra Jadeja (35 off 29) then shared a 52-run stand to take India on the cusp of of a famous win. The star all-rounder's three fours off Haris Rauf off the 19th over effectively sealed the game for India. With the team needing 6 off three balls, Hardik finished the game with a six off left-arm spinner Mohammad Nawaz. Promoted The focus was on India's top three going into the tournament and all three -- K L Rahul (0), Rohit Sharma (12 off 18) and Virat Kohli (35 off 34) -- did not have the best of times in the middle. With PTI inputs","pubDate":"2022-08-30 15:58:08","image_url":"https://c.ndtvimg.com/2022-08/14dhh36g_ravindra-jadeja_625x300_30_August_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Los cinco estadios más grandes de la India","link":"https://www.cwv.com.ve/los-cinco-estadios-mas-grandes-de-la-india/","keywords":["Deporte"],"creator":["Adelina Facundo"],"video_url":null,"description":"Estos lugares han albergado algunos juegos memorables. Siempre que hablamos de los estadios más grandes","content":"Estos lugares han albergado algunos juegos memorables. Siempre que hablamos de los estadios más grandes del mundo, nos vienen a la mente algunos nombres, como el estadio de Michigan en los EE. UU., el estadio Rungrado 1st of May en Corea del Norte y el Melbourne Cricket Ground en Australia. Sin embargo, India no se queda atrás en algunos de los estadios más grandes ahora en términos de capacidad. Aquí está la lista de los cinco estadios más grandes de la India: 5. Estadio Internacional de Críquet Shaheed Veer Narayan Singh – 65,000 Este estadio de cricket está ubicado en Raipur, Chattisgarh, y es uno de los estadios más grandes de la India en términos de capacidad. Tiene una capacidad de 65.000, lo que significa que el ambiente siempre ha sido electrizante cada vez que se agotan las entradas aquí. Se inauguró en septiembre de 2008 y el campo acogió su primer partido de cricket en 2010, cuando el equipo nacional de cricket de Canadá jugó un partido de entrenamiento contra el equipo estatal de Chhattisgarh. Desde entonces, el estadio ha albergado varios partidos, incluidos partidos de IPL, partidos de CPL T20 y partidos de la Serie Mundial de Seguridad Vial, solo por nombrar algunos. 4. Jardines del Edén – 80.000 Eden Gardens es uno de los estadios más hermosos de la India que ha dado millones de recuerdos a millones de fanáticos. Este lugar histórico en Calcuta, Bengala Occidental, alberga regularmente partidos internacionales para India. Con una capacidad de ochenta mil, la casa repleta de Eden Gardens no es más que un milagro. Fue fundado en 1864 y se ha hecho famoso gracias a algunos momentos memorables del cricket. Uno de ellos sucedió en 2001 cuando las leyendas indias Rahul Dravid y VVS Laxman salvaron la secuela y registraron una victoria fenomenal sobre Australia. Además, este magnífico estadio es el hogar de la franquicia con sede en Calcuta, Kolkata Knight Riders. Este hermoso estadio a menudo se conoce como el hogar del cricket indio. Cobertura en vivo de deportes indiosy en Khel Ahora 3. Vivekananda Yuba Bharti Krirangan (Estadio de Salt Lake) – 85,000 Con una capacidad de ochenta y cinco mil asientos, el Salt Lake Stadium alberga clubes de fútbol como ATK Mohun Bagan, East Bengal y Mohammedan. Es el mismo lugar donde se llevó a cabo la final de la Copa Mundial Sub-17 de la FIFA 2017. Los fanáticos del fútbol vieron partidos espectaculares en este maravilloso estadio, incluida la semifinal de la Copa Federación entre Bengala Oriental y Mohun Bagan en 1997. Antes de su renovación en 2011, era el estadio de fútbol más grande del mundo, con una capacidad para 120.000 espectadores. Equipos internacionales como Argentina y Venezuela jugaron un amistoso en 2011 en Salt Lake y se volvió histórico para el lugar y el fútbol indio porque la superestrella Lionel Messi jugó en ese partido. 2. Circuito Internacional de Buddh – 1.10.000 Buddh International Circuit es un circuito de carreras de motor indio ubicado en Greater Noida, Uttar Pradesh. La pista se inauguró oficialmente en 2011 con una capacidad de 1.10.000. El circuito se hizo famoso por el Gran Premio de Fórmula 1 de la India en octubre de 2011. El Gran Premio se canceló en 2014 debido a una disputa fiscal con el gobierno de Uttar Pradesh. Desde entonces, ningún campeonato internacional ha corrido en el circuito. 1. Estadio Narendra Modi – 1.32.000 El hermoso, épico y bien construido estadio Narendra Modi es el estadio más grande de India con una capacidad de 1.32,000. También es el estadio de cricket más grande del mundo después de vencer al icónico Melbourne Cricket Ground de Australia. Este estadio de cricket bien diseñado está ubicado en Ahmedabad y anteriormente se conocía como el estadio de cricket Sardar Vallabhbhai. Es propiedad de la Asociación de Cricket de Gujarat y es el lugar habitual para los partidos de pruebas indias, ODI y T20I. El estadio acogió su primer partido de prueba con balón rosa en 2021 entre India e Inglaterra. También fue sede de la final de la IPL de 2022, en la que los Gujarat Giants ganaron contra los Rajasthan Royals. Este lugar icónico es una visita obligada, especialmente si eres un gran fanático del cricket indio. Para obtener más actualizaciones, siga a Khel Now en Facebook, GorjeoY Instagram y únete a nuestra comunidad en Telegrama. Adelina Facundo«Amistoso defensor de Twitter. Evangelista de Internet certificado. Zombie geek. Alcohol ninja».","pubDate":"2022-08-30 15:19:02","image_url":null,"source_id":"cwv","country":["venezuela"],"category":["sports"],"language":"spanish"},{"title":"“No-brainer really”: Aaron Finch affirms Steve Smith Number 3 batting position in ODIs","link":"https://thesportsrush.com/cricket-news-no-brainer-really-aaron-finch-affirms-steve-smith-number-3-batting-position-in-odis/","keywords":["Cricket","Aaron Finch","Australia","Steven Smith","Zimbabwe","Zimbabwe tour of Australia 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Aaron Finch affirms Steve Smith Number 3 batting position: The Australian captain backed the former captain to bat at No. 3 in ODIs. Australia will be hosting Zimbabwe for the second of a three-match ODI series in Townsville tomorrow. A victory for the hosts will earn them an unassailable 2-0 series lead. Although in a… The post “No-brainer really”: Aaron Finch affirms Steve Smith Number 3 batting position in ODIs appeared first on The SportsRush.","content":"Aaron Finch affirms Steve Smith Number 3 batting position: The Australian captain backed the former captain to bat at No. 3 in ODIs. Australia will be hosting Zimbabwe for the second of a three-match ODI series in Townsville tomorrow. A victory for the hosts will earn them an unassailable 2-0 series lead. Although in a number way less than needed to beat Australia, Zimbabwe had their moments in the first ODI on Sunday. Having come close to beating India in Harare last week, there is no reason why the visitors can’t challenge Australia on Wednesday. Class. Steve Smith is looking 🔛 #AUSvZIM pic.twitter.com/IecZgC4ZFs — cricket.com.au (@cricketcomau) August 28, 2022 Addressing the reporters before the second ODI at the Riverway Stadium, Australia captain Aaron Finch affirmed former captain Steven Smith’s batting position. Backed by numbers, Finch’s response wasn’t just limited to reputation or Smith’s potential alone. “I think, since 2017, he averages 55 at a strike rate in the 90s batting at three. So, it’s a no-brainer, really,” Finch said in a video uploaded on cricket.com.au’s Twitter handle. 36th highest ODI run-scorer since the start of 2017, Smith is the fourth in the list comprising of only Australian cricketers. As far as No. 3 batters are concerned, Smith is at the ninth position on the back of his 1,348 runs coming at an average and strike rate of 53.92 and 90.22 respectively. ALSO READ: Steve Smith calls for better deals for Australian players in Big Bash League Smith, who has played just 29 innings at No. 3 in this period, has hit four centuries and nine half-centuries to be at the top of his game. Apart from Australia playing a limited number of ODIs in the recent years, Smith has also played less matches due to him being out of action for a year due to his involvement in 2018 Cape Town Ball Tampering scandal. Talking about Australia’s all-time highest ODI run-scorers at No. 3, Smith is at the third spot with his 3,333 runs coming at an average and strike rate of 54.63 and 87.22 respectively. The 33-year old player is only behind Ricky Ponting (12,547) and Dean Jones (5,100) in this list.","pubDate":"2022-08-30 14:56:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"EXCLUSIVE: 'Will make it special', says Harmanpreet Kaur on Jhulan Goswami's retirement ahead of England tour","link":"https://zeenews.india.com/cricket/exclusive-will-make-it-special-says-harmanpreet-kaur-on-jhulan-goswamis-retirement-ahead-of-england-tour-2503705.html","keywords":null,"creator":null,"video_url":null,"description":"Jhulan is the leading wicket-taker in international cricket and Harmanpreet made her debut under the captaincy of the senior pacer","content":null,"pubDate":"2022-08-30 14:56:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022, Bangladesh vs Afghanistan Live Score: Mujeeb Ur Rahman, Rashid Khan On Top; Bangladesh 5 Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2FzaWEtY3VwLTIwMjIvYmFuZ2xhZGVzaC12cy1hZmdoYW5pc3Rhbi1hc2lhLWN1cC0yMDIyLWJhbi12cy1hZmctbGl2ZS1zY29yZS0zMjk5Njg10gFxaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vYXNpYS1jdXAtMjAyMi9iYW5nbGFkZXNoLXZzLWFmZ2hhbmlzdGFuLWFzaWEtY3VwLTIwMjItYmFuLXZzLWFmZy1saXZlLXNjb3JlLTMyOTk2ODUvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup 2022, Bangladesh vs Afghanistan Live Score: Mujeeb Ur Rahman, Rashid Khan On Top; Bangladesh 5 Down  NDTV SportsMatch Preview - Bangladesh vs Afghanistan, Asia Cup 2022, 3rd Match, Group B  ESPNcricinfoAsia Cup, Bangladesh vs Afghanistan Live: Mujeeb, Rashid run riot, BAN 5 down  Hindustan TimesLIVE BAN vs AFG T20I Asia Cup 2022 Score: Mujeeb, Rashid Combine To Leave BAN Reeling  Cricket Country NewsLive Cricket Score - Bangladesh vs Afghanistan, Group B, Asia Cup 2022 | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-08-30 14:55:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“He’s our best bowler after Bumrah”: Madan Lal questions absence of Mohammed Shami in India’s T20 Squad","link":"https://thesportsrush.com/cricket-news-hes-our-best-bowler-after-bumrah-madan-lal-questions-absence-of-mohammed-shami-in-indias-t20-squad/","keywords":["Cricket","Madan Lal","Mohammed Shami"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Former Indian pacer Madan Lal has called Mohammed Shami the best Indian bowler after Bumrah, and he has questioned his absence. The absence of Mohammed Shami in the Indian T20I squad despite injuries to Jasprit Bumrah and Harshal Patel has been questioned by many experts. Shami has been out of the Indian T20I side after… The post “He’s our best bowler after Bumrah”: Madan Lal questions absence of Mohammed Shami in India’s T20 Squad appeared first on The SportsRush.","content":"Former Indian pacer Madan Lal has called Mohammed Shami the best Indian bowler after Bumrah, and he has questioned his absence. The absence of Mohammed Shami in the Indian T20I squad despite injuries to Jasprit Bumrah and Harshal Patel has been questioned by many experts. Shami has been out of the Indian T20I side after the last T20 World Cup where he failed to impress. Team India have gone with Avesh Khan and Arshdeep Singh over Shami in the Indian T20I side despite a great IPL season with Gujarat Titans. Shami took 20 wickets for the IPL champions Gujarat Titans and was the best bowler of the side in the tournament. Former Indian pacer Madan Lal has questioned the place of absence of Mohammed Shami in the Indian T20I squad. He said that Shami is the best Indian bowler after Bumrah, and he will consider a bowler who will take wickets for the side instead of the ones who just contain runs. “Shami should definitely be in the team for the T20 World Cup. He’s our best bowler after Bumrah. I would look for a bowler who could get me wickets. I don’t want bowlers who would only look to contain runs,” Madan Lal said. 2⃣-0⃣-6⃣-2⃣ Mohammed Shami, you beauty! 👏 Describe that #Epic opening spell from the @gujarat_titans speedster with a GIF. #KKRvGT #GujaratTitans #TATAIPL #IPL2022 pic.twitter.com/9KNlESUsgN — Star Sports (@StarSportsIndia) April 23, 2022 Madan Lal insists that the selectors will make a big mistake if they will leave Shami out of the squad. He believes that Shami will be a great bowler in the Australian conditions, and he is better than all the bowlers who are currently playing for Indian team in the Asia Cup. “The Indian selectors will make a big mistake if they don’t pick Shami. He’s a great bowler and has done well in Australia in the past. I don’t understand why they are not picking him for T20s. You think he’s not a better bowler than those who are playing now? He’s one of the best bowlers in world cricket,” Lal added.","pubDate":"2022-08-30 13:30:40","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Disney Star licenses part of its ICC rights to Zee in landmark agreement - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvZGlzbmV5LXN0YXItbGljZW5zZXMtcGFydC1vZi1pdHMtaWNjLXJpZ2h0cy10by16ZWUtaW4tbGFuZG1hcmstYWdyZWVtZW50LTEzMzE1MzDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Disney Star licenses part of its ICC rights to Zee in landmark agreement  ESPNcricinfoStar sublicenses ICC TV rights to ZEE | Cricbuzz.com - Cricbuzz  CricbuzzZEE Entertainment, Disney Star sign agreement for TV rights of ICC Men’s tournaments  MoneycontrolZee Enterprises sign strategic partnership with Disney Star, gets right to broadcast all ICC tournaments till 2027  CricTrackerFollowing Indian cricket becomes expensive, after Star, Sony, fans now need to subscribe Zee too  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-08-30 13:19:54","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"UFFICIALE: Parma, ecco Charpentier per l'attacco. Arriva a titolo definitivo dal Genoa","link":"https://www.tuttomercatoweb.com/serie-b/ufficiale-parma-ecco-charpentier-per-l-attacco-arriva-a-titolo-definitivo-dal-genoa-1724117","keywords":["Serie B"],"creator":null,"video_url":null,"description":"\"Il Parma Calcio annuncia di aver acquistato dal Genoa Cricket Football Club a titolo definitivo le prestazioni sportive di Gabriel André Joseph Charpentier (Pointe Noire, Congo, 17.","content":null,"pubDate":"2022-08-30 13:19:24","image_url":"https://tmw-storage.tcccdn.com/storage/tuttomercatoweb.com/img_notizie/thumb3/98/98afc7b56c031b51ea0adda148f0a0e4-73629-95723157c8ebcac4750156d2b21ac04e.jpeg","source_id":"tuttomercatoweb","country":["italy"],"category":["sports"],"language":"italian"},{"title":"“Nobody can match the passion she has for cricket” - Harmanpreet Kaur pays tribute to Jhulan Goswami","link":"https://www.sportskeeda.com/cricket/cricket-harmanpreet-kaur-pays-tribute-jhulan-goswami-india-women-england-women?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Renin Wilben Albert"],"video_url":null,"description":null,"content":"India women ’s skipper Harmanpreet Kaur paid a glowing tribute to veteran pacer Jhulan Goswami , stating her passion for cricket is unmatched. She also admitted that nobody can fill the legendary cricketer’s shoes. 39-year-old Goswami will play her last game for India when the visitors take on England women in the third and final ODI of the series at Lord's on September 24. She is the only bowler in the history of the women’s game to have claimed more than 200 ODI scalps. Speaking to the media ahead of the Indian team’s departure for the England series, Indian captain Harmanpreet hailed Goswami for her legendary contribution to the game. She said: The current India women skipper made her debut under Goswami in a game against Pakistan in the 2009 World Cup. Recalling the same, the 33-year-old stated: Goswami last turned out for India during the ODI World Cup in New Zealand in March. She picked up a side strain ahead of India's final group match against South Africa. As a result, she was not picked for the Sri Lanka tour. The Indian skipper admitted that the entire team is extremely keen to come up with some memorable performances so that the veteran pacer can sign off on a high. Harmanpreet said: Having made her international debut in 2002, Goswami has represented India in 12 Tests, 201 ODIs and 68 T20Is, claiming 352 scalps across the three formats of the game. India women will play three T20Is in England from September 10 to 15. This will be followed by three ODIs from September 18 to 24. Q. 0 votes so far","pubDate":"2022-08-30 13:19:01","image_url":"https://static.sportskeeda.com/editor/2022/08/178e6-16618641815756-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"[Watch] \"The Dronacharya of Indian domestic cricket is here!\" - KKR welcome new head coach Chandrakant Pandit","link":"https://www.sportskeeda.com/cricket/news-watch-the-dronacharya-indian-domestic-cricket-here-kkr-welcome-new-head-coach-chandrakant-pandit?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":"Chandrakant Pandit is set to serve as the head coach of the Kolkata Knight Riders ( KKR ) in the upcoming season of the Indian Premier League (IPL). He visited the franchise's office on Tuesday (August 30) to sign the contract. The Kolkata-based side shared a video on Instagram to give fans a glimpse of Chandrakant Pandit's visit. The veteran coach was also presented with the team jersey by KKR CEO Venky Mysore. Kolkata Knight Riders captioned the post: Instagram Post Pandit has replaced former New Zealand captain Brendon McCullum , who parted ways with KKR after this year's cash-rich league to serve as the head coach of England's Test team. Pandit has a fantastic record as a coach in domestic cricket. The former cricketer has guided teams like Madhya Pradesh, Mumbai, and Vidarbha to championship triumphs in the Ranji Trophy. The Shreyas Iyer-led side had a forgettable season this year, finishing seventh in the 10-team tournament. The side managed just six victories from their 14 league matches and failed to make the cut for the all-important playoffs. The two-time champions will be hoping to come up with an improved performance in the next edition under the guidance of their new head coach. Pandit has worked closely with skipper Iyer and assistant coach Abhishek Nayar in the past and shares a great rapport with the two. Iyer, on several occasions, has mentioned that Pandit has played a major role in his development as a batter. The right-handed batter finished as the leading run-scorer in the Ranji Trophy 2015-16 season with 1321 runs from 11 matches when Pandit was the head coach of the Mumbai team. Q. 0 votes so far","pubDate":"2022-08-30 13:19:01","image_url":"https://static.sportskeeda.com/editor/2022/08/cd73b-16618621236053-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“Koli needs to return to form and add runs” – Hong Kong captain Leschi","link":"https://thenewsglory.com/koli-needs-to-return-to-form-and-add-runs-hong-kong-captain-leschi/","keywords":["Sports","Asia Cup","Cricket","game","India"],"creator":["The News Glory"],"video_url":null,"description":"Dubai: Hong Kong captain Nizakat Khan has said that they want former Indian cricket team captain Virat Kohli to return to form. India and Hong Kong will play a multi-match series in the Asia Cup tomorrow. The first round of the ongoing Asia Cup is being held in the UAE. The Indian team is in […]","content":"Dubai: Hong Kong captain Nizakat Khan has said that they want former Indian cricket team captain Virat Kohli to return to form. India and Hong Kong will play a multi-match series in the Asia Cup tomorrow. The first round of the ongoing Asia Cup is being held in the UAE. The Indian team is in the ‘A’ category in this series. Pakistan and Hong Kong teams are also featured in the same category. India defeated Pakistan in the first match. India will face Hong Kong in the next match of the group stage. “I am a huge fan of Kohli. We want him to return to form. And he should be involved in accumulating runs for the Indian team as before. Last time in the Asia Cup (2018) we lost the match against India by 20 runs. Anything can happen in T20 cricket. Because we never know when a bowler will bowl a great spell and a batsman will rush and add runs. In the past, strong teams have suffered losses against associate teams. We are going to approach this match with a positive mindset,” he said.","pubDate":"2022-08-30 12:49:04","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"'Kohli was under pressure. Never played bad shots': Inzamam, Sehwag's verdicts - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiugFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC92aXJhdC1rb2hsaS13YXMtdW5kZXItcHJlc3N1cmUtbmV2ZXItcGxheWVkLXN1Y2gtYmFkLXNob3RzLWluemFtYW0tc2Vod2FnLXMtdmVyZGljdHMtb24taW5kaWEtYmF0dGVyLXMtcmV0dXJuLWFnYWluc3QtcGFraXN0YW4tMTAxNjYxODYyOTQ5OTE3Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Kohli was under pressure. Never played bad shots': Inzamam, Sehwag's verdicts  Hindustan Times'Kohli was Not Looking Confident': Former Pakistan Captain 'Surprised' Over Virat's Dismissal Against Pakis  News18\"Not Looking Confident...\": Ex-Pakistan Captain On Virat Kohli In Asia Cup  NDTV SportsIndia vs Pakistan, Asia Cup: Virat Kohli was not looking confident even after getting set, says Inzamam-ul-Haq  India TodayIND vs PAK: It Is Difficult To Dismiss A Set Batter, But Virat Kohli Was Not Looking Confident Even After Getting Set – Inzamam-ul-Haq  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-08-30 12:45:45","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Harmanpreet's checklist for UK tour: a fitting farewell for Goswami, better fielding standards and finding finishers - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2hhcm1hbnByZWV0LXMtY2hlY2tsaXN0LWZvci11ay10b3VyLWEtZml0dGluZy1mYXJld2VsbC1mb3ItZ29zd2FtaS1iZXR0ZXItZmllbGRpbmctc3RhbmRhcmRzLWFuZC1maW5kaW5nLWZpbmlzaGVycy0xMzMxNTI30gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Harmanpreet's checklist for UK tour: a fitting farewell for Goswami, better fielding standards and finding finishers  ESPNcricinfoHarmanpreet Kaur Confirms Jhulan Goswami's Retirement After England Series, Says \"Nobody Can Fill In..  NDTV SportsHarmanpreet on Jhulan: Nobody can fill the void she will leave  Hindustan TimesNobody can fill Jhulan Goswami's shoes, her passion for cricket is unmatched: Harmanpreet Kaur  The Indian ExpressJhulan Goswami's passion for cricket unmatched, nobody can taker her place: Harmanpreet Kaur - Firstpost  FirstpostView Full coverage on Google News","content":null,"pubDate":"2022-08-30 12:38:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BAN vs AFG Head to Head in T20: Bangladesh vs Afghanistan T20 head to head records","link":"https://thesportsrush.com/cricket-news-ban-vs-afg-head-to-head-in-t20-bangladesh-vs-afghanistan-t20-head-to-head-records/","keywords":["Cricket","Afghanistan","asia cup","Asia Cup 2022","Bangladesh"],"creator":["Dixit Bhargav"],"video_url":null,"description":"BAN vs AFG Head to Head in T20: The SportsRush presents for you the Head to Head statistics for BAN vs AFG Asia Cup 2022 match. Bangladesh and Afghanistan will lock horns with each other in the third match of the ongoing 15th edition of Asia Cup in Sharjah tonight. First match of the tournament… The post BAN vs AFG Head to Head in T20: Bangladesh vs Afghanistan T20 head to head records appeared first on The SportsRush.","content":"BAN vs AFG Head to Head in T20: The SportsRush presents for you the Head to Head statistics for BAN vs AFG Asia Cup 2022 match. Bangladesh and Afghanistan will lock horns with each other in the third match of the ongoing 15th edition of Asia Cup in Sharjah tonight. First match of the tournament at the Sharjah Cricket Stadium , it will be the first match which this venue will be hosting since ICC T20 World Cup 2021. Struggling with form especially in this format, Bangladesh will take the field on Tuesday is search of their maiden T20I victory here. Readers must note that Bangladesh have lost both their Sharjah T20Is till date. Much like their head-to-head records against Bangladesh, Afghanistan have a superior T20I record at this venue as well. In the 13 matches that they’ve played in the last eight years, Afghanistan have won 10 and lost just three. Furthermore, it is noteworthy that Afghanistan haven’t lost a Sharjah T20I since 2013. ALSO READ: Bangladesh vs Afghanistan pitch report at Sharjah Cricket Stadium The last time when these two Group B teams had faced each other in a T20I was during Afghanistan’s tour of Bangladesh earlier this year. A two-match series had resulted in a 1-1 draw after Afghanistan beat Bangladesh by 8 wickets at the Shere Bangla National Stadium. Despite losing an early wicket, a 99-run second-wicket partnership between Hazratullah Zazai and Usman Ghani had scripted victory in a 116-run chase. Total number of matches played: 8 Matches won by BAN: 3 Matches won by AFG: 5 Matches played at Sharjah Cricket stadium: 0 (BAN 0, AFG 0) Matches played in UAE: 0 (BAN 0, AFG 0) Matches played in Asia: 8 (BAN 3, AFG 5) BAN average score against AFG: 128 AFG average score against BAN: 130 Most runs for BAN: 169 (Mahmudullah) Most runs for AFG: 141 (Mohammad Nabi) Most wickets for BAN: 10 (Shakib Al Hasan) Most wickets for AFG: 14 (Rashid Khan) Most catches for BAN: 7 (Mahmudullah) Most catches for AFG: 5 (Rashid Khan) Preparations in the AfghanAtalan camp are 🔛 in full force ahead of their 2nd game in the Asia Cup 2022 tomorrow against Bangladesh 🏏 #AfghanAtalan | #AsiaCup2022 pic.twitter.com/774hNKV8Il — Afghanistan Cricket Board (@ACBofficials) August 29, 2022 NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-08-30 12:35:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“I was lucky to have a senior like her”: Harmanpreet Kaur considers Jhulan Goswami irreplaceable ahead of her retirement after England tour","link":"https://thesportsrush.com/cricket-news-i-was-lucky-to-have-a-senior-like-her-harmanpreet-kaur-considers-jhulan-goswami-irreplaceable-ahead-of-her-retirement-after-england-tour/","keywords":["Cricket","Harmanpreet Kaur","jhulan goswami"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Jhulan Goswami will retire after the upcoming England tour and Harmanpreet Kaur had a lot of praises for the same. Indian pacer Jhulan Goswami is set to retire from International cricket after the 3rd ODI match at the Lord’s on 24 September 2022 against England. It was said that ICC World Cup was Jhulan’s last… The post “I was lucky to have a senior like her”: Harmanpreet Kaur considers Jhulan Goswami irreplaceable ahead of her retirement after England tour appeared first on The SportsRush.","content":"Jhulan Goswami will retire after the upcoming England tour and Harmanpreet Kaur had a lot of praises for the same. Indian pacer Jhulan Goswami is set to retire from International cricket after the 3rd ODI match at the Lord’s on 24 September 2022 against England. It was said that ICC World Cup was Jhulan’s last tournament, but she made a surprise comeback in India’s squad for the English tour. India will play 3 T20Is and 3 ODIs in England, and Jhulan is a part of the ODI squad. Jhulan is the only cricketer in Women’s cricket to scalp 250 ODI wickets and is just the 2nd player after Mithali Raj to complete the milestone of 200 ODIs. Goswami also has 56 T20I and 44 test wickets under her belt The veteran Indian pacer is also the youngest player to take ten wickets in a test match. She has also been awarded Arjuna Award (2010) and Padma Shri (2012) for her incredible contribution to Indian cricket. It will be fitting for Jhulan to get her farewell game at the Lord’s. Harmanpreet Kaur considers Jhulan Goswami irreplaceable Indian captain Harmanpreet Kaur had a lot of praise for Jhulan Goswami ahead of the English tour. She called Jhulan irreplaceable and said that no one can beat her approach to the game. Harman insists that a lot of players are inspired by her, and she considers herself lucky to have a senior like her. “Her approach towards the game, nobody can beat that. I have learned a lot (from her). Nobody can take her place. Even today, she continues to put in the same effort. You don’t see many bowlers do that today,” Harmanpreet Kaur said. Harmanpreet Kaur confirms the ODI series against England will be Jhulan Goswami’s farewell series. “We will try to create a good environment and make it special. The last match will be special for all of us”@BCCIWomen #ENGvIND — Subhayan Chakraborty (@CricSubhayan) August 30, 2022 “Her (Goswami) passion for cricket is unmatched. She’s a great example for all of us. A lot of cricketers began playing after being inspired her. What she brings to the team, I haven’t seen (anyone do that). I was lucky to have a senior like her to learn from.” The post “I was lucky to have a senior like her”: Harmanpreet Kaur considers Jhulan Goswami irreplaceable ahead of her retirement after England tour appeared first on The SportsRush.","pubDate":"2022-08-30 12:32:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Nobody can fill Jhulan Goswami’s shoes, her passion for cricket is unmatched: Harmanpreet Kaur","link":"https://indianexpress.com/article/sports/cricket/nobody-can-fill-jhulans-shoes-her-passion-for-cricket-is-unmatched-harmanpreet-8121211/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"India skipper Harmanpreet Kaur on Tuesday paid a glowing tribute to Jhulan Goswami, saying the veteran pacer’s passion for the sport is unmatched and “nobody can fill her shoes”. The 39-year-old, who is leading wicket-taker in international cricket in a career spanning more than two decades, is set to retire after the third and final ODI against England at Lord’s on September 24.”She goes to every game with the same kind of passion which is unmatched, nobody can beat that,” Harmanpreet said in a media interaction here on the eve of their departure for their white-ball series in England. Having made her debut under the captaincy of Jhulan in a match against Pakistan in the 2009 World Cup, Harmanpreet has some vivid memories of the legendary Indian pacer who has a world record 252 wickets to her name from 201 ODIs — the only bowler with more than 200 wickets in the format. “When I made my debut she was the captain, it’s a great opportunity for me that I would be leading the side when she would be playing her last ODI. When I entered the team, she was the one who was leading from the front. I’ve learnt a lot from her. Nobody can fill in her shoes. Subscriber Only Stories View All Premium In Track and Field, money flows to the flashy and stylish Premium Crime against women rose by 15.3% in 2021: NCRB Premium PILs have a bad run, CJI-led bench says no to many Premium Indians get nearly twice as many US student visas as Chinese this year Subscribe Now to get 64% OFF “She’s someone who always puts in the same kind of effort, bowling two-three hours She still puts in the same kind of hard work she used to during her early days… I’ve never seen her make any changes to her practice regimen.” “You hardly see any bowler doing like that, or even at the nets while batting… Nobody can bring that passion she has for cricket. “As a cricketer and a person, I’ve learnt a lot from her. She’s a great example for all of us. There are many back home who have grown up watching her and then took up the sport.” Jhulan last played for India during the ODI World Cup in New Zealand in March this year before sustaining a side strain ahead of India’s final group game against South Africa and missed the Sri Lanka tour in July. Having made her International debut in 2002, Jhulan called it quits from T20s in 2018, and played her last Test match in October 2021. Overall, Jhulan has played 12 Tests, 68 T20 Internationals and 201 ODIs including six World Cup appearances. Advertisement Fresh from their silver medal winning show at Commonwealth Games Birmingham, India will begin their tour with three T20s starting from September 9.Thereafter India will play three ODIs at Hove (September 18), Canterbury (September 21) before the marquee ODI at the Lord’s, their first at the hallowed venue since their 2017 Cricket World Cup final defeat. Harmanpreet said they would do their best to make it a special occasion for her. Top Sports News Now India's World Wrestling Championship women's team picked, with blessing from Ayodhya seers In IPL viewers can choose personalised camera angle Won't go down without a fight: Serena wins opener Click here for more “We are talking about it being her last tournament. It would be very special for her and for us. We would try to create some great moments for her so she can go back with some special memories.”","pubDate":"2022-08-30 12:25:57","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Sussex vs Lancashire, Semi Final 1, Royal London One-Day Cup 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiaGh0dHBzOi8vbS5jcmljYnV6ei5jb20vbGl2ZS1jcmlja2V0LXNjb3Jlcy80MzU4MS9sYW5jcy12cy1zdXMtc2VtaS1maW5hbC0xLXJveWFsLWxvbmRvbi1vbmUtZGF5LWN1cC0yMDIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sussex vs Lancashire, Semi Final 1, Royal London One-Day Cup 2022  CricbuzzRoyal London One Day Cup 2022: Tuesday 30th August - Latest News, Scores, Match Reports and Reactions from the Semi-Finals  Cricket WorldSUS vs LAN Dream11 Team Prediction: Check Captain, Vice-Captain, and Probable Playing XIs for English One-D  News18Royal London One-Day Cup 2022, Semi Final 1: SUS vs LAN Dream11 Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update  CricTrackerSussex v Lancashire, Royal London Cup 2022 semi-final - report, result, score, scorecard  The CricketerView Full coverage on Google News","content":null,"pubDate":"2022-08-30 12:22:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Paul Farbrace to step down as Warwickshire director of cricket","link":"https://www.belfasttelegraph.co.uk/sport/cricket/paul-farbrace-to-step-down-as-warwickshire-director-of-cricket-41947253.html","keywords":["Cricket"],"creator":null,"video_url":null,"description":"Paul Farbrace will leave his post as Warwickshire’s director of cricket at the end of the season.","content":null,"pubDate":"2022-08-30 12:18:22","image_url":"https://www.belfasttelegraph.co.uk/sport/cricket/c9d82/41947251.ece/AUTOCROP/w1240h700/bpanews_a24ef6fd-ac56-4cf5-a27e-d79c7b0c6a2b_1","source_id":"belfasttelegraph","country":["united kingdom"],"category":["sports"],"language":"english"}]}