{"newsArray":[{"title":"IND vs SL 2nd T20 | Aksar comforted by action: Sri Lanka won by 16 runs","link":"https://thenewsglory.com/ind-vs-sl-2nd-t20-aksar-comforted-by-action-sri-lanka-won-by-16-runs/","keywords":["Sports","Cricket","game","India","Sri Lanka","T20","T20I"],"creator":["The News Glory"],"video_url":null,"description":"Pune: Sri Lanka won the 2nd T20 against India by 16 runs. Chasing a target of 207 runs, the Indian team scored 190 runs and lost the game. Suryakumar Yadav, Axar Patel and Shivam Mavi, who batted for the Indian team in this match, chased down the target and gave Sri Lanka a scare. The […]","content":"Pune: Sri Lanka won the 2nd T20 against India by 16 runs. Chasing a target of 207 runs, the Indian team scored 190 runs and lost the game. Suryakumar Yadav, Axar Patel and Shivam Mavi, who batted for the Indian team in this match, chased down the target and gave Sri Lanka a scare. The match was held at a cricket ground in Pune. India won the toss and chose to bowl. Batting first, Sri Lanka scored 206 runs. India chased down the target of 207 runs to win. Ishan Kishan and Subman Gill also opened the innings for India. Ishan Kishan, Gill, Rahul Tripathi and skipper Hardik Pandya lost their wickets before the end of the Powerplay overs. Deepak Hooda also got out for 9 runs. India lost 5 wickets for 57 runs. Then Akshar Patel came into the field. He put on a partnership of 91 runs with Suryakumar Yadav. Both crossed the half-century. Suryakumar was out on 51 runs. Shivam Mavi, who came in later, hit 2 fours and 2 sixes to score 26 runs off 15 balls. Axar Patel hit 6 sixes and got out in the last over after scoring 65 runs off 31 balls. Shivam Mavi also lost his wicket in the last ball. At the end of 20 overs, India scored 190 runs for the loss of 8 wickets. So Sri Lanka won by 16 runs. With this, the 3-match series is tied at 1-1. The team that wins the third and final match at Rajkot on the 7th will also win the series. India lose a T20I vs SL at home aft... Please enable JavaScript India lose a T20I vs SL at home after 6 yrs despite Axar-Suryakumar's record partnership | #shorts Earlier, the Sri Lankan openers put up an 80-run partnership for the first wicket in the first innings of this match. Mendis scored 52 runs off 31 balls. After that, Indian spinners Akshar Patel and Sahal bowled tremendously and controlled the run accumulation in Sri Lanka. But it all turned upside down in the last 5 overs. Again the Sri Lankan batsmen continued to accumulate runs. After scoring 129 runs at the end of 15 overs, the team scored 77 runs off the last 30 balls. The reason for this is that the Indian fast bowlers bowled without control. They also bowled a no-ball and teased the audience. The Sri Lankan captain scored 56 runs off 22 balls. Asalanga scored 37 runs off 19 balls. So the team scored 206 runs at the end of 20 overs.","pubDate":"2023-01-05 20:25:39","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL, 2nd T20I Highlights: श्रीलंका ने 16 रन से दूसरा मैच जीता, 1-1 से सीरीज हुआ बराबर","link":"https://sports.ndtv.com/hindi/cricket/india-vs-sri-lanka-2nd-t20i-match-ind-vs-sl-live-score-updates-3666377#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka, 2nd T20I : पुणे के एमसीए स्टेडियम में श्रीलंका ने भारत को 16 रन से हराकर सीरीज में 1-1 से बराबरी कर ली है.","content":"IND vs SL, 2nd T20I Match: श्रीलंका ने भारत को हराया पुणे में गुरुवार को दूसरे टी20 अंतरराष्ट्रीय ( ) में श्रीलंका ने भारत को 16 रन से हरा दिया. भारतीय टीम 207 रन के टारगेट का पीछा करते हुए 20 ओवर में 190/8 की बना सकी. विजेता टीम के लिए कसुन राजिथा, दिलशान मदुशंका और दासुन शनाका ने दो-दो विकेट लिए. जबकि भारत के लिए अक्षर पटेल (65 रन) और सूर्याकुमार यादव (51 रन) ने शानदार पारियां खेली लेकिन ये जीत दिलाने में असफल रहे. अंत में शिवम मावी (26 रन) ने भी भरपूर प्रयास किया लेकिन वो भी काफी नहीं रहा. इस जीत के साथ अब तीन मैचों की सीरीज 1-1 से बराबर हो गई है. इस सीरीज का फैसला राजकोट में होने वाले तीसरे टी20 से होगा. We level the series! 🇱🇰 1 - 1 🇮🇳 The series will be decided in Rajkot on Saturday.👊 श्रीलंका ने पहले बल्लेबाजी करते हुए 206/6 बनाए थे. जिसमें कप्तान दासुन शनाका ने ताबतोड़ बल्लेबाजी करते हुए सिर्फ 22 गेंदों में नाबाद 56 रन बनाए. इसके अलावा कुसल मेंडिस (52 रन) और चरित असलंका (37 रन) ने बड़ी की पारी खेली. सलामी बल्लेबाज पाथुम निसांका ने भी 33 रन का योगदान दिया. भारतीय गेंदबाज काफी महंगे साबित हुए और कई एक्स्ट्रा रन लुटाए. उमरान मलिक ने तीन, अक्षर पटेल ने दो और चहल ने एक विकेट निकाले. भारतीय कप्तान हार्दिक पांड्या (Hardik Pandya) ने श्रीलंका के खिलाफ टॉस जीतकर मेहमानों को पहले बल्लेबाजी का न्योता दिया था. संजू सैमसन की जगह बल्लेबाज राहुल त्रिपाठी को भारतीय टीम में शामिल किया गया था. बल्लेबाजी कोच विक्रम राठौर ने त्रिपाठी को उनका डेब्यू टी20 अंतरराष्ट्रीय कैप पहनाया. इसके अलावा, हर्षल पटेल की जगह अर्शदीप सिंह की टीम में वापसी हुई है. जबकि श्रीलंकाई टीम में कोई बदलाव नहीं किए गए. पाथुम निसांका, कुसल मेंडिस (विकेटकीपर), धनंजया डी सिल्वा, चरित असलंका, भानुका राजपक्षा, दासुन शनाका (कप्तान), वानिंदु हसरंगा, चमिका करुणारत्ने, महेश थीक्षणा, कसुन राजिथा, दिलशान मदुशंका. इशान किशन (विकेटकीपर), शुभमन गिल, सूर्यकुमार यादव, राहुल त्रिपाठी, हार्दिक पांड्या (कप्तान), दीपक हुड्डा, अक्षर पटेल, शिवम मावी, उमरान मलिक, अर्शदीप सिंह, युजवेंद्र चहल. The match went down to the wire but it is Sri Lanka who won the second T20I by 16 runs. Scorecard ▶️ | We put 2️⃣0️⃣6️⃣ on the board 🏏 Over to our bowlers now. 👊 Sri Lanka are unchanged. Two changes for India, Rahul Tripathi makes his debut, Arshdeep IN for Harshal Patel. have won the toss and elect to bowl first in the 2nd T20I against Sri Lanka. A look at our Playing XI for the game. Live -","pubDate":"2023-01-05 17:46:41","image_url":"https://c.ndtvimg.com/2023-01/uf2jpjc_axar-patel-afp_625x300_05_January_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Asia Cup 2023: India vs Pak once more","link":"https://thenorthlines.com/asia-cup-2023-india-vs-pak-once-more/","keywords":["Cricket","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent The Asian Cricket Council (ACC) on Thursday said that the Asia Cup, to be played in 50-over format, will be held in September this year, though the itinerary and the host country have not been announced yet. Pakistan is the original host of the Asia Cup this year but the BCCI is not […] The post Asia Cup 2023: India vs Pak once more appeared first on Northlines.","content":"NL Corresspondent The Asian Cricket Council (ACC) on Thursday said that the Asia Cup, to be played in 50-over format, will be held in September this year, though the itinerary and the host country have not been announced yet. Pakistan is the original host of the Asia Cup this year but the BCCI is not keen on playing there owing to political tension between the two countries. The then Pakistan Cricket Board (PCB) chairman Ramiz Raja had opposed the BCCI’s stand and even threatened boycott of the 50-over World Cup in India. But following a change of guard in the PCB, with Raja being replaced by Najam Sethi, there could be some positive development. The Asia Cup 2023 will be a six-team affair involving India, Pakistan, Sri Lanka, Bangladesh, Afghanistan and a qualifier team. Sri Lanka are the defending Asia Cup champions in the UAE after they beat Pakistan in the final. The tournament was played in T20 format because of the upcoming ICC T20 World Cup in Australia. With India set to host the ODI World Cup later this year and the focus of all the participating teams being on the 50-over format, this year’s Asia Cup will be held in that format. BCCI secretary and ACC president Jay Shah, while releasing the calendar for the next two years said the schedule “signals our unparalleled efforts and passion to take this game to new heights. With cricketers across countries gearing up for spectacular performances, it promises to be a good time for cricket.” A total of 145 ODI and T20I matches will be played during the two-year cycle (between 2023-2024) announced by ACC. There will be 75 games in 2023 and 70 games in 2024. Also, the Emerging (U23) Asia Cup is back and will be held in the 50-over format in July this year for men and involve eight teams. The tournament next year will be held in December but in T20 format. The women’s Emerging Asia Cup this year in June will be T20 affair involving eight teams.The post Asia Cup 2023: India vs Pak once more appeared first on Northlines.","pubDate":"2023-01-05 17:43:52","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"New Year T20 Cricket League gets underway","link":"https://thenorthlines.com/new-year-t20-cricket-league-gets-underway/","keywords":["Jammu","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Corresspondent Jammu, Jan 05: Naryana Life Saviours registered a big 108 runs win against KC Sports Club in the opening match of the New Year T20 Cricket League at KC Sports Club ground, here today. Batting first, Naryana scored 160 runs in the allotted 15 overs with Sunil Kumar (53), Verinder (31) and Amit […] The post New Year T20 Cricket League gets underway appeared first on Northlines.","content":"NL Corresspondent Jammu, Jan 05: Naryana Life Saviours registered a big 108 runs win against KC Sports Club in the opening match of the New Year T20 Cricket League at KC Sports Club ground, here today. Batting first, Naryana scored 160 runs in the allotted 15 overs with Sunil Kumar (53), Verinder (31) and Amit (25) main contributors. From KC Sports Club, Ayan took two wickets. In reply, KC Spots Club could score only 52 runs. Vishwajeet was only batsman who could touch the double figure mark with 15 runs in his account. From Naryana, Sunil took four wickets while Prince and Varinder shared two each. Sunil was later named man of the match for his match winning spell. In another match, Jammu Vishals defeated Lalitadiya Sports Club by 52 runs. Batting first, Jammu Vishals scored 143 runs for the loss of five wickets. Ashish Singh made unbeaten 51 runs while Amritpal Singh and Istiaq added 30 and 27 runs respectively. From Lalitadiya, Vinod took three wickets. Later, Lalitaditya Sports Club bowled out for 91 runs to lose the game by 52 runs. R K Bhat and Shamsher Singh shared three wickets each from Jammu Vishals. Ashish Singh was declared man of the match for his unbeaten half century. Earlier, the tournament was declared open by Secretary J&amp;K Sports Council (JKSC) Nuzrat Gul. The League is being Jointly organized by Veterans Cricket J&amp;K and KC Sports Club and supported by J&amp;K Police.The post New Year T20 Cricket League gets underway appeared first on Northlines.","pubDate":"2023-01-05 17:40:28","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL 2nd T20 | Sri Lanka 206: Poor Indian pace bowling","link":"https://thenewsglory.com/ind-vs-sl-2nd-t20-sri-lanka-206-poor-indian-pace-bowling/","keywords":["Sports","Cricket","game","India","Sri Lanka","T20","T20I"],"creator":["The News Glory"],"video_url":null,"description":"Pune: Sri Lanka scored 206 runs for the loss of six wickets in the second T20I against India. Gusal Mendis, Asalanga and captain Shanaka of the team played tremendously and scored runs. Akshar Patel, Sahal and captain Pandya bowled well on behalf of the Indian team. But other bowlers had given away runs. The Sri […]","content":"Pune: Sri Lanka scored 206 runs for the loss of six wickets in the second T20I against India. Gusal Mendis, Asalanga and captain Shanaka of the team played tremendously and scored runs. Akshar Patel, Sahal and captain Pandya bowled well on behalf of the Indian team. But other bowlers had given away runs. The Sri Lankan team is playing cricket on tour in India. Both teams are currently playing a 3-match T20I series. After India won the first match, the second T20I started today in Pune. India won the toss and chose to bowl. Sri Lanka can tie the series 1-1 only if they win this match. Otherwise the series will be lost. The team played with that in mind. So the Sri Lankan batsmen were busy chasing the ball to the boundary right from the start. The Sri Lankan openers put up a partnership of 80 runs for the first wicket. Mendis scored 52 runs off 31 balls. After that, Indian spinners Akshar Patel and Sahal bowled tremendously and controlled the run accumulation in Sri Lanka. But it all turned upside down in the last 5 overs. Again the Sri Lankan batsmen continued to accumulate runs. After scoring 129 runs at the end of 15 overs, the team scored 77 runs off the last 30 balls. The reason for this is that the Indian fast bowlers bowled without control. They also bowled a no-ball and teased the audience. The Sri Lankan captain scored 56 runs off 22 balls. Asalanga scored 37 runs off 19 balls. So the team scored 206 runs at the end of 20 overs. Now India is chasing the target. Ishan Kishan, Gill and Tripathi lost their wickets within 3 overs.","pubDate":"2023-01-05 16:21:39","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian pacer Arshdeep Singh trends fervidly after creating unwanted record of hat-trick of no-balls; ire, memes pour in","link":"https://www.tribuneindia.com/news/trending/indian-pacer-arshdeep-singh-trends-fervidly-after-creating-unwanted-record-of-hat-trick-of-no-balls-467699","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, January Team India on Thursday witnessed a significant setback in second match of the T20 series against Sri Lanka after guests set a monumental target of 206 runs at Maharashtra Cricket Association Stadium in Pune. Though all India pacers were brutally thrashed by Sri Lankan batters, left-armedArshdeep Singh has been at the target of netizens and veteran cricketers as he conceded a hat-trick of no balls to finish his 2nd over of the match. Besides this rash in an over, Singh threw as many as 5 no balls in the match. He has become first Indian bowler to bowl hat-trick of no-balls in T20Is. The left-arm pacer also took his no-ball tally to 12 in 22 T20Is he played so far. Former India captain Sunil Gavaskar, who was behind the microphones as commentator too reprimand Singh for overstepping frequently. \"As a professional, you can't be doing this. We often hear that today's players say, things aren't in our control. Not bowling no ball is in your control. What happens after you deliver the ball, what the batsman does, is another thing. Not bowling a no ball is definitely in your control,\" Gavaskar said during his commentary. Microblogging site Twitter too has been flooded with plethora of reactions from netizens. Few strongly rebuked the faster but majority was seen igniting a laughter burst with rib-tickling memes. #INDvsSL #NoballIt's okay Arshdeep...not your day pic.twitter.com/ArzHmLKyTZ — Sultaan Khan (@IamSultaan) January 5, 2023 Jethalal ready to replace arshdeep # no ball #INDvSL # noball pic.twitter.com/wA8tnXFGgQ — Mohammad Faizan (@Mohamma45712868) January 5, 2023 #NoBall zaher do bhaiyaa koi😂😂Arshdeep Singh creates an unwanted record✌️#INDvsSL#arshdeepsingh #cricketuniverse pic.twitter.com/9sAfGZLHq3 — 𝓚𝓲𝓽𝓽𝓾𝓾 ❤️♕ (@queenkritika21) January 5, 2023 Arshdeep bowling no bowl again and againICT: pic.twitter.com/qyXCRrLxig — Devansh Arora (@savagelaunda_18) January 5, 2023 Chad Arshdeep pic.twitter.com/Df60ykCX3q — memes_hallabol (@memes_hallabol) January 5, 2023 #INDvSL #ArshdeepSingh #noballBumrah watching Arshdeep : pic.twitter.com/sBbRsID3n2 — g0v!ntilde;D $#@reg;mA (@rishu_1809) January 5, 2023 #INDvSL #noball5 no balls by Arshdeep Singh pic.twitter.com/ICMPxZxAgt — Jaadu (@_jaadu_) January 5, 2023 Jethalal ready to replace Arshdeep Singh for next match 💪🏻#INDvSL #Noball #HardikPandya pic.twitter.com/u5WkjME20Y — Thalapathy Vijay (Fans club) (@Abhinav79910314) January 5, 2023 Arshdeep Today's Bowling.. pic.twitter.com/vaqnvWlvLN — Prof cheems ॐ (@Prof_Cheems) January 5, 2023 Arshdeep Singh needs these shoes please 😌#INDvSL pic.twitter.com/OcpRM2BMrC — Abhijeet ♞ (@TheYorkerBall) January 5, 2023 Hardik Pandya when arshdeep Bowl legal delivery . #INDvSL #INDvsSL #Arshdeep . pic.twitter.com/efDsU3gqMV — memewala (@LakshyaTandon5) January 5, 2023 #ArshdeepSingh#INDvSL#INDvSLMeanwhile Arshdeep Today : pic.twitter.com/DzOx4qDKtC — ದೊನ್ನೆ ಬಿರಿಯಾನಿ (@SreeDharaNEL) January 5, 2023 Arshdeep before coming to bowl today#INDvSL pic.twitter.com/upkTeGWmF5 — Azfaar // Emiliano stan🐐 (@VK18point5) January 5, 2023 Arshdeep singh 😂 #INDvSL pic.twitter.com/GbJ51gdnDX — Anurag Chaturvedi (@anuragchturvedi) January 5, 2023 Arshdeep singh if no ball was an Olympic sport#INDvSL pic.twitter.com/RcmIICHGeS — Muhammad Arun Singh Anthony (@ArunTuThikHoGya) January 5, 2023 Arshdeep singh.#INDvSL pic.twitter.com/GlWFsW6OGu — Dipressssh (@Dipessssh) January 5, 2023","content":null,"pubDate":"2023-01-05 15:31:28","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1644394054.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Adelaide Strikers complete record run chase to beat Hobart Hurricanes","link":"https://www.thestar.com.my/sport/cricket/2023/01/05/cricket-adelaide-strikers-complete-record-run-chase-to-beat-hobart-hurricanes","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - The Adelaide Strikers completed the highest successful run chase in Big Bash League (BBL) history when they chased down a mammoth target of 230 to beat the Hobart Hurricanes by seven wickets in Adelaide on Thursday. Read full story","content":null,"pubDate":"2023-01-05 15:14:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka, LIVE Cricket Score, 2nd T20I in Pune: SL 182/6; Shanaka propels visitors through slog overs","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-live-score-ind-vs-sl-2nd-t20-match-latest-cricket-updates-11935762.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka, LIVE Cricket Score, 2nd T20I in Pune: SL 182/6; Shanaka propels visitors through slog overs","content":"20:40 (IST)India vs Sri Lanka 2nd T20I Live ScoreAfter 19 overs,Sri Lanka 186/6 ( Dasun Shanaka (C) 37 , Chamika Karunaratne 10)Arshdeep returns to the attack in the penultimate over, and still can't get his front-foot landing right, conceding a two more no balls in this over, one of which could've resulted in Dasun Shanaka's dismissal as the Sri Lanka skipper was caught at deep midwicket by Suryakumar Yadav. The left-arm seamer, who replaced Harshal Patel in the XI today, finishes with 37 runs from two overs including five no-balls. Sri Lanka, meanwhile, will fancy 200 from here.20:32 (IST)India vs Sri Lanka LIVE Cricket ScoreAfter 18 overs,Sri Lanka 168/6 ( Dasun Shanaka (C) 24 , Chamika Karunaratne 7)Expensive end to Umran's spell, conceding 21 off his fourth to sign off with figures of 3/48. Shanaka smashes the hat-trick ball over his head for a four, before collecting a six the very next ball, getting a thick outside edge off an attempted pull that sends the ball sailing over fine leg. Things get even worse for him later in the over as he concedes a six over deep point, beating a leaping Chahal, off a no-ball! Sri Lanka are 12 short of the 180-mark with two overs left, and should cross 200 if skipper Shanaka sticks around till the end.20:28 (IST)Sheer pace! I. C. Y. M. I! @umran_malik_01's timber strike to dismiss Bhanuka Rajapaksa 👌 👌Follow the match ▶️ https://t.co/Fs33WcZ9ag #TeamIndia | #INDvSL pic.twitter.com/ws8mPgS7oq— BCCI (@BCCI) January 5, 202320:26 (IST)India vs Sri Lanka Live ScoreAfter 16 overs,Sri Lanka 138/6 ( Dasun Shanaka (C) 4 , Chamika Karunaratne 0)OUT! Two in two for Umran Malik, as he gets rid of Hasaranga for a golden duck and is on a hat-trick at the end of the 16th over! Hits the top of off as the Sri Lankan all-rounder gets nowhere close to the line of the delivery while looking to defend. SL 138/6Hasaranga b Malik 0(1)20:18 (IST)Sri Lanka vs India Live Cricket ScoreOUT! Asalanka departs just when he was starting to look dangerous for the Men in Blue. Had had been dealing in sixes so far, having collected four of them so far including two back-to-back maximums off Yuzi Chahal, and had narrowly beaten a leaping Gill at cow corner earlier in Malik's third over. He attempts to go big in the same direction in the penultimate delivery, but doesn't quite get the distance this time and ends up offering the simplest of catches to Gill. SL 138/5Asalanka c Gill b Malik 37(19)20:08 (IST)Sri Lanka vs India Live ScoreOUT! A second wicket for Axar Patel in as many overs. Unlike Nissanka's dismissal though, where Tripathi has to cover quite a few yards to his left, Dhananjaya de Silva ends up hitting this straight down long on's throat. SL 110/4De Silva c Hooda b Axar 3(6)20:05 (IST)IND vs SL 2nd T20I LIVE Cricket ScoreAfter 13 overs,Sri Lanka 107/3 ( Charith Asalanka 13 , Dhananjaya de Silva 2)Shivam Mavi returns to the attack, having conceded 15 in his first over earlier in the game. Charith Asalanka, meanwhile, smashes the ball over long on in the second ball of his over to bring up the century for the visitors. Three singles collected after the six. Before this over, Sri Lanka had collected 18 in the last four overs, the Indians mounting a fight back in the middle overs.20:00 (IST)IND vs SL 2nd T20I Live ScoreSIX! Cool as a cucumber, is Charith Asalanka as he nonchalantaly smashes the ball over long on, the ball landing several rows beyond the fence, as the 100 comes up for the Sri Lankans. SL 104/319:56 (IST)IND vs SL Live ScoreOUT! Both Lankan openers are back in the dugout now! Nissanka, who had been dropped on 31 by Chahal in the previous over, adds just two more runs before debutant Tripathi pulls off a superb catch at deep midwicket running to his left. The TV Umpire has a quick look after it is referred to him by his on-field colleagues, and the replay leaves little room for doubt. SL 96/3Nissanka c Tripathi b Axar 33(35)19:53 (IST)India vs Sri Lanka 2nd T20I Live ScoreAfter 10 overs,Sri Lanka 89/2 ( Pathum Nissanka 29 , Charith Asalanka 1)The fiery start by Mendis and Nissanka has ensured Sri Lanka are on course for a massive score even if they have lost two wickets in quick succession. Nissanka smashes a 148kmph bolt from Malik straight down the ground to give the Men in Blue a reminder of the threat that he still poses to them.19:45 (IST)India vs Sri Lanka LIVE Cricket ScoreBOWLED EM! The Indians are finally starting to fight back after getting plundered for runs so far. Rajapaksa follows Mendis back to the pavilion shortly after his arrival at the crease, getting beaten by Malik's pace as the ball rattles the stumps. The crowd has discovered its voice again after being quiet for the most part so far. The players will have a drink after this dismissal. SL 83/2Rajapaksa b Malik 2(3)19:41 (IST)India vs Sri Lanka Live ScoreOUT! Yuzi Chahal with the breakthrough as Kusal Mendis is trapped leg-before shortly after bringing up his half-century. The umpire however, had initially turned it down, and the legspinner looked absolutely convinced while urging Pandya to take this upstairs. He stands vindicated in the end as the Indians get three reds on HawkEye. End of a superb knock from the Sri Lankan vice-captain, giving the visitors just the start that they were looking for in this must-win clash. SL 80/1Mendis LBW Chahal 52(31)19:36 (IST)Sri Lanka vs India Live Cricket ScoreAfter 8 overs,Sri Lanka 80/0 ( Pathum Nissanka 23 , Kusal Mendis (W) 52)SIX! Kusal Mendis brings up his half-century — his 11th in T20Is — in style, slashing hard at a length ball outside off, the ball sailing over the man standing in front of the third man boundary. What a knock this has been from the Sri Lankan keeper-batter, consuming just 27 balls to bring up the milestone, smashing four sixes and two fours along the way. Sri Lanka, meanwhile, are motoring along at 10-an-over at the moment and will fancy posting a score in excess of 200.19:31 (IST)Sri Lanka vs India Live ScoreMendis gets down on one knee and slog-sweeps the ball into the stands beyond deep midwicket! After a tidy first over, even Axar is going for runs now, getting smashed for a maximum two balls after conceding a boundary. SL 66/0  19:27 (IST)IND vs SL 2nd T20I LIVE Cricket ScoreAfter 6 overs,Sri Lanka 55/0 ( Pathum Nissanka 13 , Kusal Mendis (W) 37)The fifty partnership comes up between Nissanka and Mendis in just 35 deliveries, with Mendis accounting for 35 of those runs in what has been a fiery start for the visitors in a must-win clash. Mendis brings up the milestone with a single off Chahal at the start of the final over of powerplay.19:25 (IST)Arshdeep will have to work on his discipline a bit moreMost no-balls bowled in T20I career:12 - Arshdeep Singh🇮🇳11 - Hasan Ali 🇵🇰11 - Keemo Paul🏝️11 - Oshane Thomas🏝️10 - Richard Ngarava🇿🇼#INDvSL— Kausthub Gudipati (@kaustats) January 5, 202319:24 (IST)IND vs SL 2nd T20I Live ScoreAfter 4 overs,Sri Lanka 47/0 ( Pathum Nissanka 9 , Kusal Mendis (W) 33)The first over by Pandya appears an anomaly now as the Indian bowlers have been bleeding runs ever since. After Arshdeep's nighmarish nine-ball over, skipper Pandya gets hit for a six over third man in the second delivery of his second over, which costs the Indians 11 runs. Shivam Mavi, the hero at Wankhede with 4/22 on debut, is also guilty of bowling a no-ball, starting off with a 15-run over as the Sri Lankan opening pair collect 47 in just four overs.19:21 (IST)IND vs SL Live ScoreAfter 2 overs,Sri Lanka 21/0 ( Pathum Nissanka 6 , Kusal Mendis (W) 11)Arshdeep is off to a forgettable start in his first over since the tour of New Zealand, conceding 19 runs including a hat-trick of no-balls. Not only does he concede a boundary first ball, but he ends up conceding a four and a six in each of the first two free hits, getting a stern look from his captain and in all likelihood, getting taken off the attack for now.19:07 (IST)India vs Sri Lanka 2nd T20I Live ScoreArshdeep concedes a four off his first ball of the series, as Nissanka leans in and crisply drives the ball through the gap between midwicket and mid on to collect the first boundary of the innings. SL 6/019:06 (IST)India vs Sri Lanka LIVE Cricket ScoreAfter 1 over,Sri Lanka 2/0 ( Pathum Nissanka 1 , Kusal Mendis (W) 0)Pandya gets the ball to move right away, getting some late away movement first ball to Nissanka. Bowls a steep bouncer down leg in the third delivery that is called a wide before Nissanka steers the ball towards third man for a single to open his account. Tidy start for Pandya with just two coming off it.19:01 (IST)India vs Sri Lanka Live ScoreHardik Pandya to start off with the ball in hand for the Men in Blue, as he did in the previous game in Mumbai. Pathum Nissanka and Kusal Mendis open for the Lankans as usual, the former on strike for the first delivery.18:43 (IST)Here's Rahul Tripathi receiving his maiden cap on his home ground before toss in the 2nd T20ICongratulations to Rahul Tripathi who is all set to make his T20I debut for #TeamIndia 🇮🇳👏#INDvSL @mastercardindia pic.twitter.com/VX1y83nOsD— BCCI (@BCCI) January 5, 202318:40 (IST)India vs Sri Lanka 2nd T20I Live ScorePlaying XIs:India: Ishan Kishan (wk), Shubman Gill, Suryakumar Yadav, Rahul Tripathi, Hardik Pandya (c), Deepak Hooda, Axar Patel, Shivam Mavi, Umran Malik, Arshdeep Singh, Yuzvendra ChahalSri Lanka: Pathum Nissanka, Kusal Mendis (wk), Dhananjaya de Silva, Charith Asalanka, Bhanuka Rajapaksa, Dasun Shanaka (c), Wanindu Hasaranga, Chamika Karunaratne, Maheesh Theekshana, Kasun Rajitha, Dilshan Madushanka18:37 (IST)India vs Sri Lanka LIVE Cricket Score— Two changes for Team India — Rahul Tripathi makes his international debut, replacing the injured Sanju Samson, while left-arm pacer Arshdeep Singh replaces Harshal Patel.— Sri Lanka captain Dasun Shanaka announces an unchanged XI for the second game.  18:36 (IST)India vs Sri Lanka Live Score Team India win the toss, and skipper Hardik Pandya opts to field in the second T20I in Pune, a venue where teams batting first have traditionally been more successful.18:27 (IST)Deep Dasgupta analyses the Pune pitch:It isn’t a very big venue. The pitch is almost at the centre. 60 metres to the left, 72 metres straight down. The pitch assists the seam bowlers a little more. It sounds really nice and firm. Will assist the seamers. It’s quite windy when the lights come on, that also helps the seamers. Very little dew factor, that’s why the venue is unique. Batting first, teams have won 75 per cent of the games here.18:20 (IST)Team India are in the house! #TeamIndia have arrived at the stadium for the second T20I against Sri Lanka.#INDvSL @mastercardindia pic.twitter.com/8if6o0uBN7— BCCI (@BCCI) January 5, 202318:11 (IST)ICYMITearaway pacer Umran Malik on Tuesday became the fastest Indian bowler after he bowled a delivery measuring 155 kmph during the first T20I against Sri Lanka in Mumbai. Malik, who incidentally has bowled a faster delivery for the Sunrisers Hyderabad in the IPL, surpassed the previous fastest delivery by an Indian bowler, the record of which was held by Jasprit Bumrah (153.36).Read: Umran Malik breaks Jasprit Bumrah's record to become fastest Indian bowler18:01 (IST)\"All is well\": SamsonIndia wicketkeeper-batter Sanju Samson was on Wednesday ruled out of the remainder of the T20I series against Sri Lanka after suffering a knee injury while fielding during the first T20I in Mumbai. The BCCI since has named Vidarbha and Punjab Kings keeper-batter Jitesh Sharma as his replacement.Despite the injury, Samson is keeping his spirits up and had recently shared a post on social media in which he wrote \"All is well\" and hinted at returning to action soon.Click here for more17:45 (IST)Focus on Gill as India eye series-clinching win in PuneWhile there will be a change in the middle-order for the Indian team with wicketkeeper-batter Sanju Samson getting ruled out of the remainder of the series with a knee injury, the focus will be on how Shubman Gill performs after an indifferent debut on Tuesday.Gill is under a lot of pressure to retain his spot as Ishan Kishan's opening partner, especially with the likes of Ruturaj Gaikwad and Rahul Tripathi waiting in the wings.Click here to read the 2nd T20I preview17:33 (IST)Hello and welcome to our live coverage of the second Twenty20 International between India and Sri Lanka at the Maharashtra Cricket Association Stadium in Pune with the Men in Blue eyeing a series-clinching win on Thursday.Team India will be hoping to clinch the three-match T20I series against Sri Lanka with a game to spare in the second match at Pune’s Maharashtra Cricket Association Stadium on Thursday.The Hardik Pandya-led side had on Tuesday won their opening match of the year in thrilling fashion, pulling off a two-run win after surviving a late scare with the game going down to the very last ball. The Men in Blue thus arrive in Pune, just a couple of hours away from Mumbai by road, hoping to carry the momentum from that win over to this game.As far as team news goes, India will have to make one change to their lineup on Thursday, with wicketkeeper-batter Sanju Samson getting ruled out of the remainder of the series due to injury. While the BCCI has named Vidarbha keeper-batter Jitesh Sharma as his replacement, Samson’s spot might go to either Rahul Tripathi or Washington Sundar.Squads:India: Hardik Pandya (Captain), Ishan Kishan (wk), Ruturaj Gaikwad, Shubman Gill, Suryakumar Yadav (VC), Deepak Hooda, Rahul Tripathi, Washington Sundar, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Harshal Patel, Umran Malik, Shivam Mavi, Mukesh Kumar.Sri Lanka: Dasun Shanaka (C), Pathum Nissanka, Avishka Fernando, Sadeera Samarawickrama, Kusal Mendis (VC for ODIs), Bhanuka Rajapaksa (only for T20Is), Charith Asalanka, Dhananjaya de Silva, Wanindu Hasaranga (VC for T20Is), Ashen Bandara, Maheesh Theekshana, Jeffrey Vandersay (only for ODIs), Chamika Karunaratne, Dilshan Madushanka, Kasun Rajitha, Nuwanidu Fernando (only for ODIs), Dunith Wellalage, Pramod Madushan, Lahiru Kumara, Nuwan Thushara (only for T20Is).Time: 7 PM IST.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-05 15:05:13","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Hardik-Pandya-Dasun-Shanaka-IND-SL-1st-T20I-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Late blows boost New Zealand&#039;s victory hopes in Karachi","link":"https://www.thestar.com.my/sport/cricket/2023/01/05/cricket-late-blows-boost-new-zealand039s-victory-hopes-in-karachi","keywords":null,"creator":null,"video_url":null,"description":"KARACHI, Pakistan (Reuters) - New Zealand set Pakistan a tricky target of 319 and then landed two late blows to boost their hopes of a series-clinching victory in the second test on Thursday. Read full story","content":null,"pubDate":"2023-01-05 14:22:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: Rahul Tripathi makes international debut, replaces Sanju Samson in playing XI in 2nd T20I","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-rahul-tripathi-makes-international-debut-replaces-sanju-samson-in-playing-xi-in-2nd-t20i-11937042.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: Rahul Tripathi makes international debut, replaces Sanju Samson in playing XI in 2nd T20I","content":"Top-order batter Rahul Tripathi was on Thursday handed his maiden international cap, ahead of India’s second T20I against Sri Lanka in Pune.Follow: India vs Sri Lanka 2nd T20I LIVE blogAhead of the match, the BCCI posted a video on their official Twitter handle, captioning it: “Congratulations to Rahul Tripathi who is all set to make his T20I debut for #TeamIndia”.Congratulations to Rahul Tripathi who is all set to make his T20I debut for #TeamIndia 🇮🇳👏#INDvSL @mastercardindia pic.twitter.com/VX1y83nOsD— BCCI (@BCCI) January 5, 2023Tripathi was drafted into the playing XI, in place of Sanju Samson, who was recently ruled out of the last two T20Is after sustaining a knee injury in the series-opener in Mumbai on Tuesday.Tripathi, 31, had received his maiden India call-up when the Hardik Pandya-led Men in Blue travelled to Ireland last June for two T20Is, but Tripathi failed to get a game there.Over the years, Tripathi has established himself as a reputed Indian batter in the IPL, having amassed 1798 runs from 76 games. The Ranchi-born cricketer has represented Sunrisers Hyderabad, Rajasthan Royals, Kolkata Knight Riders and the now-defunct Rising Pune Supergiant in the IPL.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-05 14:04:39","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Rahul-Tripathi-debut-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka LIVE Score Updates, 2nd T20I Match: Kusal Mendis Gives Flying Start To Sri Lanka As Arshdeep Leaks - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaW5kaWEtdnMtc3JpLWxhbmthLTJuZC10MjBpLW1hdGNoLWluZC12cy1zbC1saXZlLXNjb3JlLXVwZGF0ZXMtMzY2NjIyNtIBbGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvaW5kaWEtdnMtc3JpLWxhbmthLTJuZC10MjBpLW1hdGNoLWluZC12cy1zbC1saXZlLXNjb3JlLXVwZGF0ZXMtMzY2NjIyNi9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka LIVE Score Updates, 2nd T20I Match: Kusal Mendis Gives Flying Start To Sri Lanka As Arshdeep Leaks  NDTV SportsMatch Preview - India vs Sri Lanka, Sri Lanka in India 2022/23, 2nd T20I  ESPNcricinfoIND vs SL Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Sri Lanka Tour of India, 2nd T20I  Cricket Addictor\"Cannot remember when a opposition team took note of Sri Lankan players\" - Russell Arnold on Hardik Pandya's opinion  SportskeedaIndia eye another series win after Mumbai jailbreak | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-01-05 13:48:44","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India, Pakistan in same group for Asia Cup 2023: Jai Shah announces","link":"https://thenewsglory.com/india-pakistan-in-same-group-for-asia-cup-2023-jai-shah-announces/","keywords":["Sports","ACC","ACC president Jay Shah","asia cup 2023","Asian Cricket Council","BCCI","Cricket","game","India","india and pakistan","Jay Shah","Pakistan"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: India and Pakistan have been drawn in the same group for the upcoming Asia Cup series. The series is scheduled to take place in September. Asian Cricket Council President Jai Shah shared on Twitter that the series will be held in ODI format. The Asian Cricket Council has released the schedule for the men’s […]","content":"Mumbai: India and Pakistan have been drawn in the same group for the upcoming Asia Cup series. The series is scheduled to take place in September. Asian Cricket Council President Jai Shah shared on Twitter that the series will be held in ODI format. The Asian Cricket Council has released the schedule for the men’s and women’s cricket series for the two years 2023 and 2024. This information is published in it. A total of 145 ODIs and T20Is will be played. India, Pakistan, Sri Lanka, Bangladesh, Afghanistan and a total of six teams will participate in the series. ODI cricket is played in series format. A total of 13 matches. Group Round, Super-4 Round and Final. This is where India and Pakistan are in the same group. The Asia Cup 2023 series was planned to be held in Pakistan. But the Indian cricket team cannot go to Pakistan. Jai Shah had earlier said that the cricket match will be held on a common ground for both countries. Hence, there is anticipation as to where the series will take place. \r Presenting the @ACCMedia1 pathway structure & cricket calendars for 2023 & 2024! This signals our unparalleled efforts & passion to take this game to new heights. With cricketers across countries gearing up for spectacular performances, it promises to be a good time for cricket! pic.twitter.com/atzBO4XjIn — Jay Shah (@JayShah) January 5, 2023","pubDate":"2023-01-05 13:18:39","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Afghanistan Cricket Board to provide advisory service to ILT20","link":"https://www.sentinelassam.com/sports/cricket/afghanistan-cricket-board-to-provide-advisory-service-to-ilt20-631671","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Afghanistan Cricket Board (ACB) extended its support to Emirates Cricket Board (ECB) through advisory services on the Event Technical Committee of the DP World International League T20.","content":"DUBAI: Afghanistan Cricket Board (ACB) extended its support to Emirates Cricket Board (ECB) through advisory services on the Event Technical Committee of the DP World International League T20.In the spirit of cooperation in connection with the recently signed MOU between ACB and ECB where ACB's home series will be hosted in UAE, the ACB has agreed to a request to provide advisory services for the inaugural DP World ILT20 event. Mirwais Ashraf — chairman of Afghanistan Cricket Board and who has represented Afghanistan in 46 ODIs and 25 T20 internationals — will provide expert advice to the Event Technical Committee of the ILT20. IANS Also Read:  MI Emirates sign five promising overseas players for inaugural season of ILT20Also Watch:","pubDate":"2023-01-05 12:48:37","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/05/427744-ilt.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs New Zealand Highlights, 2nd Test Day 4 in Karachi: PAK 2 down in 319-run chase","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-new-zealand-highlights-2nd-test-day-4-in-karachi-pak-2-down-in-319-run-chase-11931302.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs New Zealand Highlights, 2nd Test Day 4 in Karachi: PAK 2 down in 319-run chase","content":"Pakistan vs New Zealand 2nd Test Day 3 Report: Pakistan rode on Saud Shakeel’s patient first Test century and Safaraz Ahmed’s aggressive 78 to trail New Zealand by 42 runs on the third day of the second Test on Wednesday.Lefthanded Shakeel batted throughout the day to go unbeaten on 124 off 336 balls in an innings spanned over eight hours before New Zealand spinners hit back late with four wickets and Pakistan finished the day at 407-9 at stumps.New Zealand part-time seamer Daryl Mitchell squeezed out Pakistan in the final session which saw the host score 70 runs as leftarm spinner Ajaz Patel (3-88) chipped away with wickets of Agha Salman (41) and Hasan Ali (4) through juggling catches by Michael Bracewell and Devon Conway.Leg spinner Ish Sodhi (2-94), who is recalled for the Pakistan Test tour after four years, had Naseem Shah and Mir Hamza clean bowled off successive deliveries, but Abrar Ahmed avoided the hat-trick ball with an umbrella of fielders surrounding him and was yet to get off the mark.(with inputs from The Associated Press)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-05 12:48:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/PAK-vs-NZ-Live-Score.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia, England play spin better than subcontinent sides: Kumar Sangakkara","link":"https://www.sentinelassam.com/sports/cricket/australia-england-play-spin-better-than-subcontinent-sides-kumar-sangakkara-631665","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Former Sri Lanka captain Kumar Sangakkara believes that overseas nations like England and Australia have learnt to play spin better than subcontinent sides as cricket has changed a lot over the years.","content":"NEW DELHI: Former Sri Lanka captain Kumar Sangakkara believes that overseas nations like England and Australia have learnt to play spin better than subcontinent sides as cricket has changed a lot over the years.\"I think cricket's changed quite a lot since 2011, in those days I would say that in Asian conditions, it favours the subcontinental players. But over the years I think that England, Australia, New Zealand have learnt to play spin a lot better than even the subcontinental sides,\" Sangakkara said on Star Sports show. \"You see a lot of reverse sweeps, paddle shots and sweeps, all of these new strokes using their feet. I think that has revolutionised the way we look at cricket in the subcontinent. IPL has helped a lot in terms of exposure as well,\" he added. India, currently playing a T20I series, is slated to play three-match ODI home series against Sri Lanka, starting from January 10. IANS Also Read:  Kumar Sangakkara praises Ravichandran Ashwin's \"sacrifice\"Also Watch:","pubDate":"2023-01-05 12:32:40","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/05/427738-kumar.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Gary Ballance named in Zimbabwe squad for T20I series against Ireland","link":"https://www.sentinelassam.com/sports/cricket/gary-ballance-named-in-zimbabwe-squad-for-t20i-series-against-ireland-631664","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Gary Ballance is set to make his debut for Zimbabwe after he was named in the squad for three-match T20I series against Ireland.","content":"HARARE: Gary Ballance is set to make his debut for Zimbabwe after he was named in the squad for three-match T20I series against Ireland. He is one of the four changes made to the 15-man side that represented Zimbabwe at the ICC Men's T20 World Cup 2022 in Australia in October-November.Apart from Ballance, the other new faces in the squad are Tadiwanashe Marumani, Innocent Kaia and Victor Nyauchi. Fast bowler Blessing Muzarabani, who is recovering from a quadriceps injury, has also missed out on selection alongside wicketkeeper-batter Regis Chakabva and batter Milton Shumba. Ballance, who played 23 Tests and 16 ODIs for England between 2014 and 2017, had signed a two-year contract to play domestic and international cricket in and for the country of his birth following his release from county cricket side Yorkshire. Star all-rounder Sikandar Raza - who is in the running for the ICC Men's Cricketer of the Year, ICC Men's ODI Cricketer of the Year and ICC Men's T20I Cricketer of the Year awards - will not feature in the T20Is against Ireland after Zimbabwe Cricket granted him the permission to play franchise cricket elsewhere. With captain Craig Ervine, Sean Williams, Tendai Chatara and Richard Ngarava all available, Zimbabwe will be at near-full strength when they face Ireland at Harare Sports Club. The T20I matches will be played on January 12, 14 and 15. This will be followed by the three-match ODI series between the two sides set for January 18, 21 and 23, also at Harare Sports Club. IANS Also Read:  England cricketer Gary Ballance apologises to Azeem Rafiq for racist languageAlso Watch:","pubDate":"2023-01-05 12:29:25","image_url":"https://assets.sentinelassam.com/h-upload/2023/01/05/427737-garry.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"SA20 League LIVE: BCCI official 'stunned' seeing LOGOS of South Africa T20 LEAGUE teams, says 'they exactly look like IPL team logos': Check OUT - InsideSport","link":"https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3d3dy5pbnNpZGVzcG9ydC5pbi9zYTIwLWxlYWd1ZS1saXZlLWJjY2ktb2ZmaWNpYWwtc3R1bm5lZC1zZWVpbmctbG9nb3Mtb2Ytc291dGgtYWZyaWNhLXQyMC1sZWFndWUtdGVhbXMtc2F5cy10aGV5LWV4YWN0bHktbG9vay1saWtlLWlwbC10ZWFtLWxvZ29zLWZvbGxvdy1saXZlLXVwZGF0ZXMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SA20 League LIVE: BCCI official 'stunned' seeing LOGOS of South Africa T20 LEAGUE teams, says 'they exactly look like IPL team logos': Check OUT  InsideSportSky: new South Africa T20 cricket deal  RXTV infoSA20: Sky Sports to show South Africa T20 competition in five-year rights deal  Sky SportsSA20 2023: Find out the Crowd Puller OVERSEAS quotient in each of the 6 teams in SA20, Is your favourite cricketer a part of the list? Check Out  InsideSportSA20 2023: Know Your 6 Teams, Complete Squad, Captains, Schedule, Venue, the rules and the wildcard signings - Check details  InsideSportView Full coverage on Google News","content":null,"pubDate":"2023-01-05 12:26:59","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Australian TV presenter Mylee Hogan demoted after backlash over 'Glenn McGrath died' prank","link":"https://www.firstpost.com/firstcricket/sports-news/australian-tv-presenter-mylee-hogan-demoted-after-backlash-over-glenn-mcgrath-died-prank-11934692.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"Australian TV presenter Mylee Hogan demoted after backlash over 'Glenn McGrath died' prank","content":"An awkward situation occurred on-air inside the studio of Channel 7’s Sunrise after newly-assigned host Mylee Hogan cracked a bizarre joke involving Australia’s legendary Glenn McGrath some days ago. The incident, which took place on 29 December, had a huge impact on Hogan’s reputation making the anchor lose her place at the studio desk.Hogan came up with the bizarre gig following a recent TikTok trend. The platform was seeing a number of hilarious videos in which children and teenagers were pulling out hilarious pranks on their parents by telling them that their favourite celebrities were dead even though the news was entirely fake.After talking about the TikTok segment, fellow host Mark Beretta had just started to introduce their next news item featuring an exclusive interview with former pacer McGrath when Hogan blurted out, “Glenn McGrath died.”No doubt, the remark did not go down well with Beretta as well as the other co-host Edwina Bartholomew. While Hogan kept laughing, Bartholomew hurriedly rubbished the comment by saying, “That’s not funny.” Beretta also opposed it and noted, “It’s crazy. I did not get that at all.”Watch:Viewers slammed new Sunrise host Mylee Hogan for joking cricketer Glenn McGrath died after a segment on TikTok fad where people are told a famous person has died. Just before he appeared on Sunrise.Well Mylee, your granddad turned into an imbecile – clearly, it’s genetic. 🤨 pic.twitter.com/oeyHKX8qUS— 🇦🇺🇳🇿 ♀️Emma ♀️ 🇭🇺🇬🇧 (@TheCynicalHun) December 30, 2022 Hogan remained silent till the end as the remaining hosts continued with their interview of the Australian cricketer. During the conversation, McGrath gave his insights about the recently finished Boxing Day Test between Australia and South Africa. It was the second Test of the three-match series played at the Melbourne Cricket Ground. In the match, the hosts clinched the victory by an innings and 182 runs, earning an unassailable 2-0 lead.Hogan was a fresh face on the studio desk and she was introduced to the breakfast show earlier on 23 December. Since the unexpected incident garnered a lot of criticism from the viewers, she was banned from that particular show with immediate effect without any official announcement. Social media users were also left outraged and termed Hogan “insensitive and immature.”On 3 January, Monique Wright replaced Hogan as a news anchor alongside Mark Beretta with Edwina Bartholomew taking her seat at the end of the studio desk. Hogan reappeared on Sunrise on Thursday, but this time as a field reporter.Melbourne will have to wait a little longer to dethrone Sydney as Australia’s most popular city, with new government data revealing the Victorian capital experienced the steepest population decline of any other capital city during the pandemic. @MyleeHogan pic.twitter.com/JgFCU1fDsU— Sunrise (@sunriseon7) January 4, 2023 She was spotted reporting from near the Sydney Harbour Bridge and speaking about the difference in population growth between Sydney and the Victorian capital, Melbourne.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-05 12:14:15","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/01/Glenn-McGrath-Reuters-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Matt Short stars as Adelaide Strikers make BBL history with thrilling seven-wicket win over Hobart Hurricanes - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIzLTAxLTA1L2JibC1hZGVsYWlkZS1zdHJpa2Vycy1kZWZlYXQtaG9iYXJ0LWh1cnJpY2FuZXMvMTAxODMxMDg40gEoaHR0cHM6Ly9hbXAuYWJjLm5ldC5hdS9hcnRpY2xlLzEwMTgzMTA4OA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Matt Short stars as Adelaide Strikers make BBL history with thrilling seven-wicket win over Hobart Hurricanes  ABC NewsStrikers pull off record chase in instant BBL classic | BBL|12  cricket.com.au‘Best I’ve seen’: BBL records smashed  news.com.auBBL madness: Short smacks century as Strikers stun with greatest run chase EVER  Fox SportsRecord breakers! Strikers chase 230 after Short ton | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2023-01-05 12:09:13","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Steve Smith soars to even greater heights, drops retirement hint during SCG Test against Proteas - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9hdXN0cmFsaWEtdi1zb3V0aC1hZnJpY2EtdGhpcmQtdGVzdC1zY2ctc3RldmUtc21pdGgtdXNtYW4ta2hhd2FqYS1zY29yZXMtdmlkZW8vMTNjMDU1OWEtZmZjMy00Mzk3LWE1MzYtNTM0YjRhYTdlZTkw0gFEaHR0cHM6Ly9hbXAubmluZS5jb20uYXUvYXJ0aWNsZS8xM2MwNTU5YS1mZmMzLTQzOTctYTUzNi01MzRiNGFhN2VlOTA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Steve Smith soars to even greater heights, drops retirement hint during SCG Test against Proteas  Wide World of SportsKhawaja closes on double as Smith, Head pile on Proteas pain | Australia v South Africa 2022-23  cricket.com.auClosing Bell: ASX small caps dominate, à la Test warriors Usman Khawaja, Steve Smith  StockheadRecords Tumble On Khawaja And Smith's Epic Test Day | 10 News First  10 News FirstCruel scenes leave Khawaja stranded  news.com.auView Full coverage on Google News","content":null,"pubDate":"2023-01-05 11:50:17","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka: ‘All is well’ says Sanju Samson after being ruled out of T20I series due to injury","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-sri-lanka-all-is-well-says-sanju-samson-after-being-ruled-out-of-t20i-series-due-to-injury-11935302.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Sri Lanka: ‘All is well’ says Sanju Samson after being ruled out of T20I series due to injury","content":"India wicketkeeper-batter Sanju Samson on Thursday took to Instagram to post a note, after he was ruled out of the ongoing home T20I series against Sri Lanka after sustaining an injury.Samson injured his knee while fielding in the first T20I in Mumbai on Tuesday, and was later ruled out of the remaining two T20Is, with Punjab Kings wicketkeeper-batter Jitesh Sharma replacing him.“All is well…Z u Zoooon,” the Kerala cricketer posted on Instagram. View this post on InstagramA post shared by Sanju V Samson (@imsanjusamson)“Get well soon bro,” Shikhar Dhawan replied, while Hardik Pandya, captaining Men in Blue in the ongoing series, replied with a heart emoticon.“Samson hurt his left knee while attempting to field a ball near the boundary ropes during the 1st T20I at the Wankhede Stadium in Mumbai,” the BCCI had said in a statement.“He was taken for scans and a specialist opinion this afternoon in Mumbai by the BCCI Medical Team and has been advised rest and rehabilitation,” it had added.Samson had a forgettable night with the bat on Tuesday, scoring just five runs. Facing Dhananjaya de Silva in the seventh over of the Indian innings, Samson was caught by Dilshan Madushanka at short third man after playing a rash shot while looking for a boundary.India went onto win the first T20I. Having been asked to bat first, the hosts posted 162 on the board on the back of an unbeaten 41 from Deepak Hooda and an unbeaten 31 from Axar Patel, and in reply, the Lankans fell narrowly short, being dismissed for 160.India will look to seal the series on Thursday, when the two teams faceoff in the second T20I in Pune.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-05 11:37:09","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/01/Sanju-Samson-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Smith drops retirement hint after eclipsing Bradman","link":"https://wwos.nine.com.au/cricket/australia-v-south-africa-third-test-scg-steve-smith-usman-khawaja-scores-video/13c0559a-ffc3-4397-a536-534b4aa7ee90","keywords":null,"creator":["wwos"],"video_url":null,"description":"S﻿teve Smith surpassed Sir Donald Bradman's Test century tally of 29, before making an astounding suggestion.","content":"S﻿teve Smith elevated his status to even greater heights on day two of the SCG Test, moving past the marks of three Australian batting greats as the hosts continued to make South Africa wilt.The former national captain then dropped a remarkable retirement hint, suggesting he might not play another Test in Australia.As Usman Khawaja toiled away in pursuit of his maiden Test double century on Thursday﻿, Smith compiled 104 runs from 192 balls to surpass Matthew Hayden (8625 runs) and Michael Clarke (8643) on Australia's all-time Test runs list, where he now sits in fourth.READ MORE: Zampa's single 'regret' over controversial act﻿READ MORE: Australian Open rejects calls to ban top players﻿READ MORE: Kyrgios' manager fires shot at injury doubtersThe New South Welshman also overtook Sir Donald Bradman's Test century tally of 29, notching his 30th hundred to move into third on the all-time list of Australian Test centurions.He chalked up his second Test century of the summer as Australia climbed to 4-475 from 131 overs by stumps.Smith﻿ pulled an Anrich Nortje delivery for four behind square to bring up his century, before raising his helmet and bat to cheers from the SCG crowd.The champion right-hander was removed two balls later, when he scooped the ball back to left-arm spinner Keshav Maharaj, ending a knock of 104 streaked with 11 fours and two sixes.Allan Border, the man sitting in second on the list of greatest Australian Test run-scorers, was calling the action on the Fox Cricket broadcast when Smith reached triple figures.﻿\"﻿A significant moment for him and the team in particular,\" Border said.\"What a performance from Steve Smith.\"Fantastic shot to bring up a significant milestone for him: a pull shot, banged in short, thumped away behind square.\"And the celebrations have started.\"Smith was non-committal when asked if he'd take part in another Australian Test summer.﻿\"I don't know. We'll see,\" Smith said in a press conference after play.\"I'm enjoying it at the moment.\"I really can't say how long I'll play for. I'm not sure.\"Take it one tour at a time. Just enjoy it and enjoy training and trying to get better, as well.\"Whilst I'm doing that I'm happy playing.\"But I don't know how long it'll last.\"Khawaja finished the day on 195 from 368 at the SCG, the venue at which he struck twin centuries in the New Year's Test of 2022.While Khawaja had busted out LeBron James' trademark \"silencer\" move after scoring his first of two centuries in last year's Sydney Test, he﻿ pulled off a more low-key dance after rushing back for two on Thursday.Khawaja moved beyond his previous Test best of 174, which he tallied against New Zealand in Brisbane in 2015, and looked set to exceed his career-high first-class score of 214, only for more rain to halt his charge.﻿Khawaja was treated to fireworks at the other end of the pitch, watching on as Travis Head bludgeoned 79 from 59﻿.Khawaja and recalled Queenslander Matthew Renshaw (5) will resume in the middle on day three.﻿Australia is pushing for a series whitewash and its first Test series victory over South Africa in Australia since the 2005-06 summer.Pat Cummins' men defeated South Africa by six wickets in Brisbane and by an innings and 182 runs in Melbourne.﻿For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2023-01-05 11:34:55","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2023/01/477741/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant could miss up to six months of cricket, injury similar to that of Ravindra Jadeja: Report","link":"https://www.firstpost.com/firstcricket/sports-news/rishabh-pant-could-miss-up-to-six-months-of-cricket-injury-similar-to-that-of-ravindra-jadeja-report-11934522.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Rishabh Pant could miss up to six months of cricket, injury similar to that of Ravindra Jadeja: Report","content":"Rishabh Pant could end up missing up to six months of cricketing action with the nature of his injury similar to that of Ravindra Jadeja, a report has claimed.India wicketkeeper-batter Pant was on Wednesday airlifted to Mumbai for undergoing an urgent knee ligament surgery after showing improvement at the Max Hospital in Dehradun, where he had been admitted after meeting with a horrific car accident on the National Highway 58 near Roorkee on 30 December.The BCCI, which arranged for a helicopter to fly Pant to Mumbai where he has been admitted to the Dhirubai Kokilaben Ambani Hospital, also got its medical panel to conduct a full-body MRI scan on the cricketer as a precautionary measure, according to a report on The Indian Express.Read: BCCI must also provide psychological support to Pant, says BindraThe report added that the nature of Pant’s injury was similar to what Jadeja had picked up during the Asia Cup last year, and while no official timeline has been given for Pant’s return, he isn’t expected to regain full fitness until June when the World Test Championship final takes place.“Every player’s body is different but looking at his report, our doctors say the ligament injury is like the one Jadeja suffered. As per the reports we received from Dehradun, we were told that Pant would need surgery as early as possible. It looks like he will take more than four months to recover,” an unnamed BCCI official was quoted as saying in the report.“The World Test Championship final is in England in June. So if India qualifies for that, realistically, that’s what we are aiming for,” the source added.Pant was driving to his hometown Roorkee to pay a surprise visit to his mother early morning last Friday when he fell asleep on the wheel, colliding against the road divider with his Mercedes-AMG GLE43 Coupe bursting into flames after the collision.Watch: Dravid, Pandya and other members of Team India wish Pant speedy recoveryPant, who was dangling out of the windshield after the impact according to eye witnesses, managed to exit the vehicle in time as he was rescued by a Haryana Roadways bus driver Sushil Mann and his conductor along with other locals before being taken to a nearby hospital on an ambulance. The vehicle was completely gutted as a result of the fire.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-01-05 10:53:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/RishabhPantL-min.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Men's Player of the Month nominees for December 2022 revealed - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzMwMDU0MDLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC Men's Player of the Month nominees for December 2022 revealed  ICC CricketBreakout star Harry Brook nominated for ICC player of the month award alongside Babar Azam and Travis Head  India TodayBabar Azam, Harry Brook, Travis Head Nominated for ICC Men's Player of the Month Award for December' 22  News18ICC confirms contenders for December Player of the Month Awards  ICC CricketICC Women's Player of the Month nominees for December 2022 revealed, Check OUT  InsideSportView Full coverage on Google News","content":null,"pubDate":"2023-01-05 09:32:03","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'Hopefully he can get 200 or 300': Smith praises Khawaja | Australia v South Africa 2022-23 - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9MlhhQXhkLWhRQXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Hopefully he can get 200 or 300': Smith praises Khawaja | Australia v South Africa 2022-23  cricket.com.auRecent Match Report - Australia vs South Africa 3rd Test 2022/23  ESPNcricinfoSmith's 30th Test hundred extends Australia's domination | Cricbuzz.com - Cricbuzz  CricbuzzSteve Smith Explains \"Chainsaw\" Celebration After 30th Test Ton Against South Africa In Sydney Test  NDTV SportsRecords Tumble On Khawaja And Smith's Epic Test Day | 10 News First  10 News FirstView Full coverage on Google News","content":null,"pubDate":"2023-01-05 09:30:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Live Sport on TV this Weekend","link":"https://www.limerickleader.ie/news/sport/1002585/live-sport-on-tv-this-weekend.html","keywords":["Live Sport on TV,Sport on TV"],"creator":["Colm Kinsella"],"video_url":null,"description":"THURSDAY, JANUARY 5 CRICKET PAKISTAN V NEW ZEALAND SKY SPORTS, 4.50AM GOLF TOURNAMENT OF CHAMPIONS SKY SPORTS, 7.15PM SOCCER CHELSEA V MAN CITY SKY SPORTS, 8PM CRICKET AUSTRALIA V SOUTH AFRICA BT SPORT 1, 11.30PM BASKETBALL IOWA STATE @ OKLAHOMA BT SPORT 3, MIDNIGHT FRIDAY, JANUARY 6 SOCCER ELCHE V","content":"THURSDAY, JANUARY 5 CRICKET PAKISTAN V NEW ZEALAND SKY SPORTS, 4.50AM GOLF TOURNAMENT OF CHAMPIONS SKY SPORTS, 7.15PM SOCCER CHELSEA V MAN CITY SKY SPORTS, 8PM CRICKET AUSTRALIA V SOUTH AFRICA BT SPORT 1, 11.30PM BASKETBALL IOWA STATE @ OKLAHOMA BT SPORT 3, MIDNIGHT FRIDAY, JANUARY 6 SOCCER ELCHE V CELTA VIGO PREMIER SPORT 1, 5.30PM SOCCER MAN UTD V EVERTON UTV, 8PM RUGBY MUNSTER V LIONS TG4, 7.35PM RUGBY GLOUCESTER V SARACENS BT SPORT 1, 7.45PM SOCCER VALENCIA V CADIZ LA LIGA TV, 8PM SATURDAY, JANUARY 7 SOCCER GILLINGHAM V LEICESTER BBC1, 12.30PM HORSE RACING FROM SANDOWN PARK VIRGIN MEDIA, 12.55PM SOCCER EXESTER V NORTHAMPTON BT SPORT 2, 4.30PM RUGBY CONNACHT V SHARKS RTE2, PREMIER SPORT, 5.15 SOCCER LIVERPOOL V WOLVES ITV4, 8PM SUNDAY, JANUARY 8 SNOOKER THE MASTERS BBC2, 1PM SOCCER MAN CITY V CHELSEA BBC1, 4.30PM SOCCER ASTON VILLA V STEVENAGE BBC RED BUTTON, 4.30PM SOCCER AC MILAN V ROMA BT SPORT 1, 7.45PM NBA NETS @ HEAT SKY SPORTS ARENA, 11PM","pubDate":"2023-01-05 09:30:01","image_url":"https://www.limerickleader.ie/resizer/300/200/true/1591870931128_1594804015.jpg--live_sport_on_tv_this_weekend.jpg?1594804015000","source_id":"limerickleader","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Usman Khawaja nears double century with Australia in command against South Africa","link":"https://www.independent.co.uk/sport/cricket/usman-khawaja-australia-south-africa-score-b2256466.html","keywords":["Cricket","Sport"],"creator":["Ian Ransom"],"video_url":null,"description":"Australia were 475 for four on day two when stumps came early at the Sydney Cricket Ground, with opener Khawaja on a career-high 195 not out","content":null,"pubDate":"2023-01-05 09:21:36","image_url":"https://static.independent.co.uk/2023/01/05/09/newFile-3.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket Australia to review third umpire's camera set-up after Marnus Labuschagne controversy","link":"https://www.dnaindia.com/cricket/report-cricket-australia-to-review-third-umpire-s-camera-set-up-after-marnus-labuschagne-controversy-3015123","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"After a controversy arose on Day 1 at the SCG over an attempted dismissal of Labuschagne, CA are set to review the camera setup for third umpire.","content":null,"pubDate":"2023-01-05 09:14:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Smith’s raw honesty over retirement talk","link":"https://www.themercury.com.au/sport/cricket/3rd-test-australia-vs-south-africa-follow-all-the-action-from-day-2-at-the-scg/news-story/eea4576021312d54a89ebdabc9df7cc4","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Steve Smith admits he is unsure whether he will play another Test match on home soil.","content":"After a rousing century at the SCG to pass Sir Donald Bradman in the record books with 30 Test tons, Smith was unable to guarantee Australian audiences will see him again next summer.Smith is poised to tour India next month and England for the Ashes later this year, but concedes his future is now a tour by tour proposition.The batting superstar believes 36-year-old Usman Khawaja – three years his senior – could bat on for some time yet following his sparkling 195 not out on another soggy day two against South Africa, with rain Australia’s only enemy at 4-475.But when asked would he be back in Australia for more summers to come, Smith could not say in a moment of raw honesty.“I don’t know. We’ll see,” Smith said.“I’m enjoying it at the moment. I really can’t say how long I’ll play for. I’m not sure.“Take it one tour at a time. Just enjoy it and enjoy training and trying to get better as well.“Whilst I’m doing that I’m happy playing. But I don’t know how long it’ll last.”Smith has hinted on previous occasions this summer that he may not play for as long as what people might think, but on Thursday that genuine uncertainty was laid bare.The admission he may not return for another home summer is a statement that will shock cricket followers.Smith’s brilliant 104 against South Africa which propelled him past Bradman (29) for most Test hundreds and past Michael Clarke (8643) into fourth on Australia’s all-time run-scoring list with 8647 runs from just 92 Tests was living proof he is an all-time great still at the top of his game.The 33-year-old was moved by those achievements on Thursday, but records clearly aren’t a prime motivation for one of those batsmen who appears poised to bow out with plenty left in the tank.“I don’t think about that stuff a great deal but I did look up at the board just after I got a 100 and to sit third on the list of all time Australians, there’s some pretty big names there so that’s pretty cool,” Smith said.“Fourth on the run scorers list (too) … I don’t play for that kind of stuff but it was cool to look up and see my name amongst those great players. It was pretty special.”While Australian cricket would be stunned to hear Smith may not forge on deeper into his 30s, Khawaja looks like he can defy father time longer than anyone would have expected after his many years on the outer.The King of Sydney has now scored more Test tons at the SCG than any other cricketer other than Ricky Ponting, and on Friday has the chance to add a maiden career double ton to the twin hundreds from last summer that launched his stunning renaissance.“I mean at the moment he’s at the top of his game isn’t he. He’s scoring runs at will,” Smith said.“He’s batting beautifully. At the moment he’s pretty comfortable and playing really nicely.“I guess Usman, like Davey (Warner) both can play for as long as they like and decide to hang them up when they want.“That’s how I see it at the moment. I’m not a selector obviously but both playing really well.”Few sportspeople of any discipline can surely claim to understand the intricacies of their own games as well as Smith understands his own batting.All summer Smith has talked about the work he had poured into recalibrating his technique – and how it had paid dividends for him this summer with a return to his best.But mid-innings on Thursday, Smith decided to temporarily revert to his old technique and did not break stride as he punished the South African attack.Smith is a genius, and one this Australian cricket team must spend the next few months desperately trying to convince to play on for a couple more years yet.“Just to (left armer Marco) Jansen when he came around the wicket and the ball was reversing a little bit,” Smith said.“I obviously know these conditions really well and I didn’t feel overly threatened on the outside of the bat. I went back to almost my old set-up. I was just getting back and across. I went back to leg stump and I was getting back and across and leaving myself really open just to cover the ball coming back in at me.“It just felt right at the time. I prefer to do it out there and be happy with it rather than get out and come back into the sheds and say, ‘why didn’t I do that?’”Smith believes the wicket can still break up enough for Australia to push for victory in the match, with Travis Head (70 off 59 balls) doing his best once again to supercharge the innings.Matt Renshaw (5) will resume alongside his Queensland teammate Khawaja on day three, as Australia will fight to bat long enough to give themselves the choice of not having to bat again in the game should South Africa crumble in reply.RE-LIVE ALL THE DAY TWO ACTION IN OUR BLOG BELOW5.30PM: STUMPS! RAIN CALLS PREMATURE END ONCE AGAINFor the second day running, Australia has dominated the on-field actions - but rain has had the final say.After forcing the players from the field, with Usman Khawaja just five runs shy of a maiden Test double century.Khawaja has put Australia firmly on top at 4-475 after two rain-reduced days, with his mighty knock sitting alongside Steve Smith’s stunning 30th Test ton and Travis Head’s impressive half-century.Smith’s century moved him past Don Bradman on Australia’s all-time Test century makers list, level with Matthew Hayden and with just Steve Waugh and Ricky Ponting in front of him.He also notched a similar feat on the runscoring table, passing both Hayden and Michael Clarke to sit outright fourth - behind Ponting, Waugh and Allan Border.And yet, it is the rain which could yet decide the outcome of this match. Only 131 overs have been bowled from a scheduled 180 across the first two days, and more bad weather is forecast for Friday’s play.5.05PM: AND HERE COMES THE RAINYep, ok, probably a smart call to bring the players off when they did - because the heavier rain has hit the SCG.The lower areas of the SCG have cleared out, with fans retiring to the under-cover concourse, while those higher up in the stands haven’t moved far just yet.If they get back on tonight, they could be witness to a famous double century from Khawaja. But that looks a long way away right now, with rain sweeping across the ground.5PM: DRINKS! AND RAIN! WITH KHAWAJA FIVE RUNS FROM HISTORYThere’s a sprinkling of rain at the SCG, and the umpires come together and momentarily you feel as though the players are about to be dragged from the field.But instead a (slightly) early drinks break is called, and it could be so that the umpires can assess the ball and whether it needs changing after spending plenty of time on the damp SCG outfield.It didn’t appear as though Usman Khawaja was all that keen to come off, anyway. And you can understand why... he’s five runs away from a maiden Test double century.Khawaja confirms that the ball has been replaced, after going soggy, during a brief interaction with the umpires.“The ball’s gone soggy, but the outfield is pretty wet,” Khawaja told Fox Cricket“I just asked them ‘they’re going to get a new ball, are they going to keep changing it’ and they said yes.”And then..... rain, immediately after the drinks break.Khawaja remains stranded on 195, for the time being.4.45PM: HEAD WELL CAUGHT ON BOUNDARY AFTER MIGHTY 70A very good low catch on the boundary by the substitute fielder van der Dussen, brings to an end a fantastic innings by Travis Head.70 runs off 49 balls. 8 fours and one six. Some clean, crisp hitting. Some ugly shots, others absolute beauties.But he’s pushed Australia’s total to 468 in rapid time and played the perfect foil role for Usman Khawaja as he edges towards a double century.And it brings the Covid kid himself, Matt Renshaw, to the crease. Let’s see how he gets on.4.25PM: IS HEAD ‘DECLARATION BATTING’?Could there be a declaration tonight? It seems unlikely, but with the uncertainty around the weather in the next couple of days, everything has to be on the table.Travis Head has sped along to a near run-a-ball 40, and some of his shots have been on the agricultural side of things.“That’s a declaration shot,” suggests Mark Waugh in commentary after one particularly aggressive heave.Australia is 3-432, rain is looming around the SCG and they’re chasing quick runs.Plenty of wickets in hand, too. But what’s the play here?One thing is certain: no one is declaring with Usman Khawaja so close to a maiden Test double ton. He is currently unbeaten on 186.UPDATE: In the ten minutes since this post, Travis Head has scored 21 runs. If he isn’t declaration batting, he’s definitely giving it a shake.4.07PM: AUSSIES BRING UP 400... KHAWAJA REACHES NEW HEIGHTSIt feels like we’re repeating ourselves a bit, but Australia has passed 400 - and not for the first time this summer.Travis Head has joined the fun and immediately lifted the tempo, racing to 30 off 33. He punches a straight drive back over the head of Simon Harmer for four, to bring up the 50-run partnership with Usman Khawaja - from just 66 balls.Khawaja, meanwhile, has passed his previus Test best score of 174. He’s onto 178. A double century is the next milestone to knock off for the silky left-hander.3.50PM: COVERS COMING OFF AFTER RAIN DELAYNow is when the tea break is typically due to finish... and we’re not ready to go just yet. Because of another rain delay.However, the good news is the covers have been removed and presumably play is not too far away.The outfield has been dried by the classic rope technique for the past 10 minutes, so I reckon we’ll be back to watching Usman Khawaja and Travis Head plundering runs for fun soon enough.3.30PM: TEA! AUSSIES ON TOP DESPITE SMITH EXITWith one session remaining on day two, how do you assess where this match is headed?Obviously Australia are on top. They’ve got just shy of 400 runs on the board, seemingly in complete control with 27 overs remaining in the day’s play. Only rain will stop them having a 500+ lead at stumps today.But as the tea break hits us, the heaven’s have opened again (not especially heavy rain, but frustrating rain for sure). Time has already been lost this Test, and more rain is expected over the next two days.Australia are 3-394 at tea, with Usman Khawaja on 172 and Travis Head on 17 - having lost Steve Smith for 104.But will they have enough time to push this game forward and get the cleansweep?3.10PM: GREEN OPENS UP INJURY BATTLE, INDIA SERIESStar all-rounder Cameron Green has conceded he‘ll be “touch and go” for Australia’s first Test in India in February having undergone surgery to fix his broken finger.But Green shut down reports he would be limited in his capacity to fulfil his massive $3.15 million Indian Premier League deal declaring rumours he wouldn’t be able to bowl as “not correct”.Green was forced to have surgery after scans revealed the bad break to the index finger on his right hand, suffered while batting in the first innings of the Boxing Day Test in Melbourne.Images of the break reinforced how significant an effort it was for Green to make an unbeaten 51 in the second innings, batting through the pain.It came just days after his massive IPL windfall but Green said his priority was getting back for the Test tour of India in February, although he conceded both he and fats bowler Mitchell Starc, who also broke a finger, would be racing the clock to be fit.“Obviously my first priority is the Test Series that’s beforehand,” Green added when asked about the IPL.“I think me and Starcy (Starc) are maybe touch and go for that first one but obviously we’ll give ourselves the best chance.”2.51PM: AND OUT! SMITH FALLS AFTER POSTING TONAnd that feels like it has come out of nowhere - after bringing up his 30th century, Smith falls to a simple caught and bowled to Keshav Maharaj.He’s out for 104.It’s the first wicket of the day (and Maharaj’s first of the series), and Smith walks of shaking his head - as he always does, to be fair.2.48PM: CENTURY! STEVE SMITH BRINGS UP 30TH TONWhat a player!Steve Smith brings up his 30th Test century, having passed Matthew Hayden and Michael Clark on Australia’s all-time Test runscorers. He now only trails Ricky Ponting, Allan Border and Steve Waugh.With that century, Smith officially passes Sir Donald Bradman (29 Test centuries) on the centurion list - equal with Matthew Hayden and, again, only behind Ricky Ponting and Steve Waugh.An incredible player.When he’s in a mood like this, it doesn’t ever appear like there is a way to get him out. He seems unstoppable.2.45PM: MILESTONES FALL AS AUSSIES MARCH ONThe milestones are stacking up for Australia.In the past handful of minutes Australia have brought up:- the 200-run partnership between Usman Khawaja and Steve Smith- Khawaja’s 150- Australia’s 350What’s next? Well, Steve Smith is unbeaten on 99.....2.20PM: DRINKS! SMITH, KHAWAJA CRUSH SOUTH AFRICAThe SCG is becoming a graveyard for South Africa’s bowlers - there’s nothing here for them.At the midway point in the middle session, Australia are doing their best to break whatever is left of the spirits of the Proteas.Usman Khawaja is approaching his 150, while Steve Smith is looking assured in the 90s. A 30th Test ton looks a foregone conclusion under sunny skies at the SCG.Australia are 2-334. They’re not being particularly expansive in their scoring - these two have added 187 runs for the third wicket at a rate of 3.33 an over, which is marginally better than the 3.24 across the whole Australian innings.But they’re putting Australia in a position where they may only need to bat once this Test, if they so desired.2.00PM: HOW WILL RENSHAW PERFORM AGAINST ‘STACKED ODDS’Has Matt Renshaw been set up to fail? Or is he setting himself up to fail?There are fears that his Test comeback could turn into a nightmare with the “odds stacked” against the returning star, who could be playing for a spot in Australia’s squad for the upcoming India series.Renshaw tested positive for Covid after play had started on Wednesday, and was immediately isolated from the group - but not ruled out of the match.He’s still listed to bat at No.6, at which point he’ll be thrown into the middle of the SCG cauldron against a world class South African pace attack - although one that is looking incresingly toothless after an unsuccessful summer.Renshaw was still testing positive on Thursday morning, but told Fox Cricket’s Mike Hussey that he’d seen improvement over the past 24 hours.But Kerry O’Keeffe pondered what Renshaw’s return to the international arena might look like after the SCG Test.“I think (there is expectation), yeah,” O’Keeffe said.“And he’s so disadvantaged, picking up the COVID. Not many who have gone into matches with Covid have done that well.“Australia’s hoping he can produce soemthing but gee the odds are stacked. He wouldnt have been able to do a lot if it’s a debilitating form (of COVID).”1.45PM: SMITH, KHAWAJA MARCH ON AS AUSSIES PASS 300Australia has brought up their 300 - on another sorry day for South Africa in a truly miserable summer.Usman Khawaja has already brought up his century, and Steve Smith doesn't appear far behind - accelerating at a great rate after a slow start to move into the 80s and have another SCG century of his own on the horizon.Smith has also passed Matt Hayden on the list of Australia’s Test runscorers, and is closing in on Michael Clarke, too.1.10PM: HOW UZZIE, BARTY CRACKED SPORT’S MAGICAL CODE- ROBERT CRADDOCKUsman Khawaja’s stunning career revival is a victory for the man who decided to put his cricket in one kit bag and his life in another.It’s the same theory that turned Ash Barty from a good player to a triple Grand Slam winner.Don’t chain your self-esteem as a person to the sport you play. Don’t let your head go up and down with your batting average or your world ranking. Khawaja reckoned he worked it out late in his career after his self-esteem yo-yoed violently up and down with his performances.“It got to a point where even when I was scoring runs I wasn’t happy so I knew I just had to change and let it go,’’ he said.Khawaja’s stunning 2022 – when he scored 1080 runs at 67 – and today’s epic century, only happened after he decided he couldn’t let cricket dominate his life.Khawaja these days is one of the most chilled out sportsman in the game.When a contact apologised for ringing him the day before the first Test against South Africa in Brisbane he said “that’s no problems … whether it’s a Test match or a club game I don’t feel differently.’’When Sydney friends told him after his twin tons against England at the SCG last summer they didn’t contact him before the match because they didn’t want to disturb him, replied: “Why? It’s only a game of cricket.’’12.30PM: LUNCH: KHAWAJA, SMITH DOMINATE OPENING SESSIONAs it has been almost all summer, Australia has dominated that session.And even though this Test is only 83 overs old, it is start to feel as though it is moving beyond where South Africa can win.After resuming at 2-147, Australia added 118 runs in the extended opening session today, and cheered on a century to Usman Khawaja (his 13th, and third on the trot at the SCG) and a half-century to Steve Smith (who enters lunch unbeaten on 59).It’s been a near chanceless morning for Australia, with Smith almost caught short on a reflect run-out attempt but largely untroubled otherwise.Weather appears to be Australia’s biggest foe this week, with rain eating up a further 15 minutes of play earlier today - although there is blue sky over the SCG as players make their way to lunch.12.08PM: CENTURY! KHAWAJA CONTINUES SCG LOVE AFFAIRNew year, same Uzzie.Usman Khawaja has continued his SCG love affair, polishing off another century at his one-time home ground.It’s three centuries in three innings for Khawaja, who raised the bat twice in last year’s Ashes Test against England.This one has been more measured, and already looks to form the bedrock of a mighty Australian first innings total.Khawaja returned for a quick second off Rabada, before celebrating with a jig in front of his teammates in the Members Stand.12.00PM: RICHIES GO WILD OVER ICONIC SCOREThe Richies got their wish!With the score 2-221, the 100-odd-strong group donning the beige, the off-white and the ivory jackets started their chant of “one, one, one” in the hope of getting a single that would bring up Richie Benaud’s iconic cricket scoreline of 2-222.Everyone at the SCG would’ve tried on their best Benaud ‘chew for chew-chew-choooo’ impression after Kagiso Rabada delivered in the form of a no-ball to bring the score up.The Richies duly responded with wild celebrations.Truly, that’s marvellous.11.50AM: KHAWAJA CLOSING IN ON CENTURY, SMITH FIRES UPUsman Khawaja is officially into the 90s - and has Test century No.13 in his sights.Khawaja started 2022 in dream fashion, turning a Test recall into centuries in both innings, and it seems like he’s taking a similar approach to welcoming in the new year for 2023.Khawaja has been the aggressor in the partnership alongisde Steve Smith - although Smith has taken things up a notch since Keshav Maharaj has been introduced into the attack, aunching him into the Bill O’Reilly Stand with an audacious hoik over mid-wicket.Austraia is 2-221 with the lunch break still 40 minutes away.11.20AM: KHAWAJA KEEPS PUNISHING MAHARAJAfter being greeted to a green-top at the Gabba, and a flatter deck at the MCG, Keshav Maharaj would’ve been delighted to hear whispers of a ‘mysterious’ SCG pitch that was expected to favour the spinners.Australia were convinced, bringing in Ashton Agar as a second-option to support frontline spinner Nathan Lyon. South Africa added a second tweaker themselves, in Simon Harmer.And it was Maharaj who had the first chance to follow the seamers into the contest.His first ball was a full-toss, which was duly punished by Usman Khawaja who thumped a rare boundary on a slow-scoring morning.24 hours on and things haven’t changed much, with Maharaj remaining wicketless for the series and Khawaja dumping him over the fence for the first six of the innings.Truth be told, Harmer appeared to trouble the Australian batsmen more yesterday than South Africa’s first-choice option.11.00AM: AUSSIES NAVIGATE OPENING HOUROne hour down of this elongated day of play - potentially offering up 98 overs - and Australia are marching along slowly.Admittedly they’ve done so with a 15-minute rain delay, which has restricted Australia to just 29 runs on Thursday morning.Steve Smith is unbeaten on 9, while Usman Khawaja is creeping towards a 13th Test century.He’s into the 70s.10.40AM: LEGEND SLAMS ‘UNACCEPTABLE’ RAIN CALLAustralian great Ricky Ponting has questioned why Steve Smith was forced to face a ball with the rain falling at the SCG - with umpires waiting until the end of the over to take players off the field.Smith navigated the over and remained not out as play was halted for a rain delay, but Ponting said if he’d been in the same position as Australia’s No.4 he would’ve refused to face up.“I don’t understand why they bowled that ball then? Why do the umpires wait until the end of the over to call that? That rain is clearly heavy enough,” Ponting said on Channel 7.“If I was out there batting, I would’ve walked away. I would’ve walked a couple of steps out of the square leg and actually waited for the umpires to make a decision, because let’s say Steve Smith nicks that ball, when you shouldn’t be out there, that’s not acceptable as far as I’m concerned.“I never get that, why they wait until the end of an over when it’s raining, to call a close in play.”On Wednesday night, Marnus Labuschagne was dismissed late in the day under gloomy skies - only for the umpires to immediately call a suspension of play due to bad light, without another ball being bowled.10.27AM: PLAY RESUMES.... AGAINWe’ll see how long this lasts, but just the 15 minute rain delay that time. Not a huge amount of rain about to cause all that much concern for players and umpires it seems.From the early start, Australia have added 1 run - to Usman Khawaja - as they take a cautious approach to Day Two.The feedback from both camps after day one was that this is one of the most unusual SCG wickets - some describing it as the dryest they’ve ever seen on day one of a Test.Who knows how it will play on days three, four and five?10.12AM: RAIN HALTS PLAY AFTER 11 MINUTESJust 11 minutes of play before Sydney’s fickle weather imposes itself on Day Two of the SCG Test - it’s fairly light rain, but enough to convince the umpires to call things off for the time being.The covers are on for about 90 seconds before being removed by the groundstaff - and then immediately replaced.It’s a very windy day in Sydney, with the clouds being blown across the city. It has the potential to be a lot of very light rain causing a lot of painful delays!But for the moment, play has been suspended.10AM: PLAY RESUMES UNDER LIGHTSPlay finished under lights last night, and that’s the case again this morning.The big lights are on, and Kagiso Rabada is charging in at Steve Smith, on the hunt for an early wicket.The fact the lights are on is a concern for players, officials and fans alike - but Australian great Steve Waugh will be pleased.He wanted the lights on yesterday and took to Instagram to make the plea.“Test cricket needs to realise there is a lot of competition out there and not using the lights when the players are off for bad light simply doesn’t add up,” he wrote.“Lots of unhappy spectators who can’t understand the rationale and reason for no play.”9.45AM: HISTORIC STATUE UNVEILED AT SCGThe story of the morning at the SCG on Thursday isn’t Matt Renshaw’s COVID status or Marnus Labuschagne’s controversial innings yesterday - it’s the unveiling the world’s first sculpture of a female crickterer.Australian great Belinda Clark was immortalised in bronze near the Gate A entrance at the SCG, with her statue placed alongside the likes of Richie Benaud, Steve Waugh and Fred Spofforth.A sizeable crowd gathered for the unveiling, as the rain held off, for the special moment.“I’m excited to have the sculpture in place and for people to now look at it and perhaps wonder what that is, who that is and to be able to tell a bit of a story is really important,” Clark said.“The sculpture encapsulates being able to have a go – to be courageous, to take on those challenges and break convention.9.30AM: SUN’S OUT AT THE SCGGood morning and welcome from the SCG, where we are half an hour away from the early scheduled start (brought forward because of the rain yesterday, as will be the case for the rest of the Test).I have good news - it’s a sunny morning at the SCG. The rains of earlier in the day have mercifully disappeared, and the light - the light!! - is superb so far.Australia will resume on 2-147 with Usman Khawaja on 54, and Steve Smith yet to score.8.45AM: WEATHER ISSUES FACING SCG TESTIt will be a wet start to the second day of the test match against South Africa at the SCG today with 1-2mm of rain predicted until 11am. Luckily for those watching the game it is predicted to clear up in the afternoon around midday. There is also a small chance of a thunderstorm this morning.“It will be cold, wet and windy,” said Helen Reid from the Bureau of Meteorology.“Unfortunately it’s not such a good day for the cricket.”In good news for those out in the stands, it’s not going to be a hot one with a maximum of 22 degrees, reaching the peak around 2pm.Ms Reid said even though it will cloudy over the next three days it was important people still applied sunscreen.“The UV index is extreme at the moment, which it always is this time of year,”“Umbrella’s will help as well, or maybe a UV-rated poncho.”It will be a windy one today, with wind speeds getting up to 59km an hour coming from the south/south west. The wind should start to die down by early evening around 5pm.7AM: THE SCG GAMBLE THAT LAUNCHED A SUPERSTAR- ROBERT CRADDOCKSodden Sydney is becoming the sink Test as well as the pink Test but for Marnus Labuschagne it’s still the ground that changed his life.This Test is the fourth anniversary of the day when selector Greg Chappell was out of options for a number three batsmen and decided to roll the dice.Already knocked back by one member of the top order, Chappell offered the high pressure role of going in early against India’s crack pace attack at the SCG to Labuschagne.The story goes that when they shook hands Labuschagne was so excited Chappell feared his arm may be pulled from the socket for it was as if he had handed the youngster the keys of a new car.When Labuschagne walked out to the wicket for his first innings against India at the SCG he was averaging just 20 after two Tests.Four years later he left the SCG, with his batting average anchored at just below 60 after a robust 79 ended when he edged a snorter off Anrich Nortje behind.Day one was a curious one for Labuschagne because it reinforced his reputation as one of the luckiest batsmen in cricket – before he got a taste of his own medicine.He should have been out to a low slips catch which was ruled not out by the third umpire but he had the misfortune of being out last ball of the day before bad light intervened.I happened to be standing near Chappell four years ago when Labuschagne walked to the wicket and he made the following prediction.“I honestly feel he is going to be one of our really exceptional batsmen. That zest for the contest he has wipes out so much of the fear.’’So it was that day. And so it is now. Labuschagne is 28 now, a father and a veteran of 32 Tests but his passion for the game, far from diminishing, seems to be growing.During the off-season Labuschagne had a two-week break from his loved ones. Not his family. His bats.He sent them back to the manufacturer to get updated stickers as he headed off to Stradbroke Island.It must have been hell for him to be “batless’’ on the island but he survived, returned and since then its been all cricket.Sydney is normally the Test where tempers fray and backsides drag but Labuschagne has been buzzing around the nets as if it’s the first Test of the summer.Not just batting but bowling his leg-spinners. He was heard asking anyone around if they had heard what the team was on match eve, His radar for cricket information is never off.Commentator Ian Smith called it early when he said from the time Labuschagne arrived at the crease he had the look of a man who would set up a tent and stay a day.He didn’t get there as he fell to what was the last ball of the day before bad light set in on a ground which has so much rain that ground authorities sell advertising on the top of the covers.The grim conditions never worry him. His time playing garage cricket on souped up mats from Bunnings condition him to enjoy the thrill of heavy duty contests of which there are many in Test cricket.Watch Australia v South Africa. Every test match live and ad-break in play on Kayo. New to Kayo? Start your free trial now >","pubDate":"2023-01-05 08:46:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"BBL 2022: Match 30, STR vs HUR Match Prediction – Who will win today’s BBL match between Adelaide Strikers and Hobart Hurricanes? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMitwFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9iYmwtMjAyMi1tYXRjaC0zMC1zdHItdnMtaHVyLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy1iYmwtbWF0Y2gtYmV0d2Vlbi1hZGVsYWlkZS1zdHJpa2Vycy1hbmQtaG9iYXJ0LWh1cnJpY2FuZXMtNjcwOC_SAb0BaHR0cHM6Ly93d3cuY3JpY3RyYWNrZXIuY29tL2NyaWNrZXQtbWF0Y2gtcHJlZGljdGlvbnMvYmJsLTIwMjItbWF0Y2gtMzAtc3RyLXZzLWh1ci1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtYmJsLW1hdGNoLWJldHdlZW4tYWRlbGFpZGUtc3RyaWtlcnMtYW5kLWhvYmFydC1odXJyaWNhbmVzLTY3MDgvP2FtcD0x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BBL 2022: Match 30, STR vs HUR Match Prediction – Who will win today’s BBL match between Adelaide Strikers and Hobart Hurricanes?  CricTrackerSTR vs HUR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- KFC Big Bash League  Cricket AddictorBig Bash: Matt Short smashes hundred as Adelaide Strikers complete record run-chase  The CricketerBBL|12 Match 30: Matthew Short century crucial in Strikers chase  Cricket WorldAdelaide Strikers v Hobart Hurricanes Big Bash Tips: Siddle absence a blow for hosts  Betting.betfairView Full coverage on Google News","content":null,"pubDate":"2023-01-05 08:45:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}