{"newsArray":[{"title":"Josh Hazlewood plays down concerns over Ashes campaign","link":"https://thewest.com.au/sport/cricket/hazlewood-plays-down-concerns-over-ashes-campaign-c-10876726","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Josh Hazlewood has been limited to four Tests in two years but he is adamant his fitness has not been a significant issue.","content":"Josh Hazlewood insists long-term concerns over his run of injuries are overblown and says his overall fitness is sound despite being limited to four Test appearances in two years. Hazlewood has been put on ice for Australia’s World Test Championship final against India at The Oval after failing to overcome side soreness. He got through three separate bowling spells at training on Saturday but will now watch on with Australia expected to play Scott Boland as their third seamer. Brought home from the IPL last month amid concerns over another side strain, Hazlewood’s run of injuries has been extensive as they are frustrating. The 32-year-old first suffered a side injury in the opening Test of the 2021-22 Ashes, leaving him sidelined for the remainder of that series. He was then picked for one Test in Pakistan before being overlooked for the rest of that 2022 series and during the ensuing tour of Sri Lanka. He suffered another side strain in the opening Test in Perth last summer, before an achilles injury on his return in Sydney left him unable to play in India. But as far as Hazlewood is concerned, the injuries have been more poorly timed than anything else. “I am not playing Test matches, but I am still bowling for close to 50 weeks of the year,” Hazlewood told AAP. “That’s the frustrating bit. “Just bowling in the past week or so here in England, it feels a bit easier. “You have a nice Dukes ball, there is a bit doing, you don’t have to break your back every ball like you do in India or Australia or somewhere else. “Hopefully that plays into my hands a little bit.” Hazlewood also downplayed concerns that the setback in the IPL was a sign his side strain could be a recurring issue during the Ashes. “After a long break, the intensity of the IPL is through the roof,” Hazlewood said. “You’re bowling wide yorker there, wide yorker to the other side, slower-ball, bouncer. Your body just gets in some bad positions technical wise. “I just felt a bit of crunching in my side, and I am very cautious with it.” Hazlewood is hopeful he will not have to be managed through the Ashes, with three sets of back-to-back Tests as bowling innings are generally shorter in England. He is also undecided if this will be his last Ashes tour, or if he can join Glenn McGrath as the only Australian quick this century to play beyond their 36th birthday. “I don’t really think too far ahead. You can get caught out a bit if you think too far ahead and where you will be in four years,” Hazlewood said. “I could still be playing then, I might not be “Being a fast bowler, not many walk off the field by their own choice. A lot of the time it comes through injury or your body has had enough. “Sometimes it hits you at 33, 34, 35 or 36. It could be any time.” Sign up for our emails","pubDate":"2023-06-05 00:02:24","image_url":"https://images.thewest.com.au/publication/C-10876726/91cb33d7b2cdffbc40111ddbc27b668bb50a4237-16x9-x242y15w558h314.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"England would prefer going into Ashes with Anderson, Robinson and Wood as pacers, says Mark Butcher","link":"https://thenewsmill.com/2023/06/england-would-prefer-going-into-ashes-with-anderson-robinson-and-wood-as-pacers-says-mark-butcher/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former England cricketer Mark Butcher believes England would prefer to go into the upcoming Ashes series against arch rivals Australia with the redoubatble pace trio of James Anderson, Ollie Robinson, and tearaway Mark Wood. The high-stakes Ashes series will start from June 16. “We think England’s preferred choice of bowling attack would be Anderson, Robinson, Wood, in terms of the three quicks. We still don’t know what [Ben] Stokes’ status is. I’m sure he will be absolutely fine, but if that isn’t the case, Stuart Broad today looked a little bit on the tardy side, a little slow and lacking in penetration when the ball was a little bit older,” Butcher told Sky Sports. England have already set sights on the Ashes series after trouncing England in a one-off Test, while Australia will go into the prestigious red-ball series after playing India in the World Test Championship (WTC) final. The WTC final would get underway at the Oval in London on June 7. Butcher, the former England opener, also had his say on young pacer Josh Tongue, who got himself on the Lord’s Honours board with brilliant spell of 5/66 in his debut Test against Ireland. “Until Josh Tongue got the ball back in his hand, and England went to a slightly more orthodox method of operating – going away from the short ball – there were one or two concerns. The main one being Jack Leach’s difficulties in bowling to left-handers,” he told Sky Sports. England have announced a 16-member squad for the first two matches of the Ashes series, retaining the same group from the one-off Test against Ireland. Josh Tongue found a place alongside James Anderson and Ollie Robinson, both of whom were ruled out of the Lord’s Test. “England have asked for flat pitches in the Ashes, haven’t they? They’ve not asked for green seamers; they want to take Australia on at their own game, be able to go out there and compile big runs. So, if there was one slight concern, it was that with tailenders in essentially they were made to look pretty ordinary for a long period of time during that afternoon session,” Butcher said. England squad for first two Ashes Tests: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Jack Leach, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 19:34:12","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Joe Root can't wait for Ashes without captaincy burden","link":"https://www.perthnow.com.au/sport/cricket/joe-root-cant-wait-for-ashes-without-captaincy-burden-c-10874864","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"England's main batter Joe Root says he's looking forward to playing his first Ashes series in eight years without having to worry about being captain.","content":"Joe Root says he will relish the chance to deliver for England and focus purely on playing in his first Ashes series in eight years without the captaincy. England made it 11 wins in 13 Tests under the leadership of skipper Ben Stokes and head coach Brendon McCullum with a 10-wicket victory over Ireland at Lord's on Saturday. All eyes now turn to the Ashes opener on June 16 and Root, who was man of the series on home soil in 2015 with 460 runs, is excited after leading England during the last three red-ball battles with Australia. \"It's going to be nice, yeah,\" the Yorkshireman said. \"It's going to be nice to just go and play the game and try and assist where I can for Ben and for the other guys around, play a slightly different senior role in the team. \"They're always great fun to be a part of, these big games, big series. They're the ones you want to stand up and play well in and it's an opportunity to do that again. \"I think my batting has been fine for a while, but, mentally, to be able to just turn up and play and have fun, just chat batting with some of the younger guys. \"Obviously I'll try and help out where I can but Ben knows what he's doing. \"He's got enough behind him now to give himself the encouragement and confidence to make those big calls on his own, as you'd expect him to anyway. He's doing a far better job than I did.\" Root's own preparation for this monumental series had been far from ideal before his 56 against Ireland. The Yorkshire batter decided against playing county championship cricket during April and May after he secured a first Indian Premier League contract, but Rajasthan Royals only selected him on three occasions and he batted just once in the tournament. Nevertheless, the 32-year-old was philosophical about his experience in India. \"Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here,\" Root explained. \"I am not saying it's not important or a good standard. For where I am in my career, am I going to learn more about myself in that environment? \"Am I really going to be prepared better for an Ashes series facing lower pace bowling on some nibbly wickets when hopefully we will play on good pitches against high pace and a high quality spinner? I don't think so. \"By learning and experiencing something new, discussing the game with greats like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year it would set me up best to get the best out of myself. I feel ready.\"","pubDate":"2023-06-04 18:39:04","image_url":"https://images.perthnow.com.au/publication/C-10874864/65a4affb9f54f8921a248ff8962b35cdc19c7d16-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australia’s journey to World Test Championship final against India","link":"https://thenewsmill.com/2023/06/australias-journey-to-world-test-championship-final-against-india/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"The Australian team are set to face India in the World Test Championship (WTC) final at the Ovals in London starting from June 7. Australia topped the WTC points table in the 2021-23 cycle with 66.67 points per cent in 19 Tests, while India made its cut for the final with 58.8 per cent. In the first WTC final, New Zealand became the champions of Test cricket after beating India at Southampton in 2021, as the WTC event has a two-year cycle. Australia missed by a narrow margin entering the WTC final in 2021 due to a slow over rate penalty, but this time they played brilliantly and reached the final in England. Australia qualified for the WTC final in the top spot. They played 19 matches and won 11 of them, while India earned 10 wins after playing 18 test matches. Before the Aussies play to claim the Test Championship, let’s see the journey of Australia to reach the final against India. Ashes (England vs Australia) – December 2021-January 2022 (won 4-0) The Aussies outplayed England in the Ashes series held between December 2021 and January 2022. They won the series 4-0. In the first test, they won comfortably by nine wickets. Pat Cummins’s clobbering bowling spell bundled the England side for just 147 runs in the first innings. Then, Travis Head played a blistering knock of 152, and David Warner’s 94 helped Australia post 425 in the first inning. In the second innings, spinner Nathan Lyon did the job and restricted England to 297. Australia chased the 19-run target quickly. The second test had the same story, Steve Smith took charge of Australia for the first time since the infamous ball-tampering incident in 2018, but the setback was insignificant as the hosts dominated the match from the start. With scores of 103 and 51, Marnus Labuschagne secured the No. 1 Test-batter rating, while Alex Carey produced a half-century in front of his home crowd in only his second Test, and Travis Head extended his hot start to the series with 51 in the second innings. Australia won the match by 275 runs. In the third match, England’s batting lineup crumbled and Australia registered a big win by an innings and 14 runs. In the first innings, Pat Cummins’s 3/36 and Nathan Lyon’s 3/36 had restricted England to 185. And in the second innings, Scott Boland performed exceptionally well and took six wickets by conceding only seven runs. Mitchell Starc had taken three wickets. Fourth test was a draw, however, Usman Khawaja displayed his talent with 137 runs and Scott Boland was the pick of the bowlers as he had the bowling figures of 4/36 in the first innings and 3/30 in the second innings. Fifth and the last match was won by 146 runs, Cameron Green contributed 74 runs as Australia recovered from 4-83 to record 303 batting first. Pat Cummins got seven wickets throughout the match, with Mitchell Starc, Scott Boland, and Green each getting three to conclude England’s terrible tour. Benaud-Qadir Trophy-Pakistan, March 2022 (won 1-0) Australia toured Pakistan after 24 years and the Cummins-led side defeated the host by 1-0. The two matches went to draw. But in the last test in Lahore, the Aussies came out victorious by 115 runs. Warne-Muralidaran Trophy, June-July 2022 (drawn 1-1) In the two-match series against Sri Lanka in their home venue. Australia won the first test by 10 wickets but in the second test, they had to face defeat by an innings and 39 runs. Frank Worrell Trophy-West Indies, November-December 2022 (2-0) Following their hosting of the T20 World Cup, Australia began their five-Test home season against a West Indies side that had gone undefeated in their previous five matches, having defeated England 1-0 and Bangladesh 2-0 in the previous home series. They claimed the series by 2-0, winning the first two matches and making the third match draw. Australia v South Africa – December 2022-January 2023 (won 2-0) Australia outplayed South Africa in a three-match series. In the first test in Gabba, they won by six wickets. Followed by a dominating win in the second test by an innings and 182 runs at the MCG. The third test was drawn. Border Gavaskar Trophy, February-March 2023 (lost 1-2) The Australian challenge arrived at India as India’s final obstacle towards the WTC final. In the first Test, an all-round show by Ravindra Jadeja (70 and seven wickets), a century by Rohit Sharma (120) helped India win by an innings and 132 runs. In the second Test, half-century by Axar Patel (74) and yet another all-round masterclass by Jadeja (26 and 10 wickets including a spell of 7/62) helped India win by six-wickets. Jadeja’s seven-wicket haul crumbled the Aussies to just 113 runs while following on, leaving India to chase 115 runs. India retained the Border-Gavaskar Trophy with a 2-0 lead. A spin exhibition by legendary Nathan Lyon (3/35 and 8/64) helped Australia win a low-scoring third Test by nine wickets to stay alive in the series. The scoreline was 2-1. In the final Test, Virat Kohli (186) outclassed Usman Khawaja (180) and Cameron Green (114) in a high-scoring match, which ended in a draw. India won the series 2-1. Australia squad for WTC final: Pat Cummins (c), Scott Boland, Alex Carey (wk), Cameron Green, Marcus Harris, Travis Head, Josh Inglis (wk), Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Todd Murphy, Michael Neser, Steve Smith (vc), Mitchell Starc, David Warner Standby players: Mitch Marsh, Matthew Renshaw India squad: Rohit Sharma (c), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, KS Bharat (wk), Ravichandran Ashwin, Ravindra Jadeja, Axar Patel, Shardul Thakur, Mohd. Shami, Mohd. Siraj, Umesh Yadav, Jaydev Unadkat and Ishan Kishan (wk). Standby players: Yashasvi Jaiswal, Mukesh Kumar and Suryakumar Yadav. (ANI)","pubDate":"2023-06-04 18:34:20","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Sport is cruel at times”: Michael Vaughan after England spinner Leach ruled out of Ashes due to injury","link":"https://thenewsmill.com/2023/06/sport-is-cruel-at-times-michael-vaughan-after-england-spinner-leach-ruled-out-of-ashes-due-to-injury/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former England captain Michael Vaughan expressed his disappointment over Jack Leach’s omission from The Ashes series against Australia, saying that the “sport is cruel at times” and he not being in the squad is a big blow to England. England spinner Jack Leach has been ruled out of the Men’s Ashes series after suffering from a low back stress fracture on Sunday as announced by The England and Wales Cricket Board. Leach has become a “pivotal figure” under the leadership of skipper Ben Stokes and coach Brendon McCullum. “Gutted for Jack leach .. Sport is cruel at times .. he has become a pivotal figure for England under Ben & Baz .. !! This is a big blow to England’s chances as Jack has become very good at holding an end whilst the seamers rotate & getting key wickets .. !! #Ashes,” tweeted Vaughan. The 31-year-old Somerset slow-left-armer developed low back symptoms during England’s Test victory over Ireland on Saturday. A stress fracture was discovered during a scan on Sunday in London, ruling him out of the upcoming Ashes Test series, which begins on Friday, June 16 at Edgbaston. England will announce a replacement for the Ashes series in due course. England had announced the 16-member squad for the first two matches of the Ashes series on Saturday. The spinner’s unavailability could be concerning as English fast bowler Ben Stokes did not make it to the Ashes squad due to his knee injury. Updated England squad: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 18:34:08","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"\"The Calmness He Has...\": Cameron Green Doffs Hat To Captain Rohit Sharma","link":"https://sports.ndtv.com/cricket/the-calmness-he-has-cameron-green-doffs-hat-to-captain-rohit-sharma-4092579","keywords":null,"creator":null,"video_url":null,"description":"While the Mumbai teammates will now be WTC Final foes, Green can turn to what he learned from the India skipper throughout the IPL and during their crucial century partnership against Sunrisers Hyderabad in the final IPL league game when they meet in the red-ball showdown.","content":"Australia all-rounder Cameron Green hopes to bring the calmness of Rohit Sharma into his game, having spent a quality time with the India captain in the Mumbai Indians dugout in IPL this year. Green, with 452 runs and six wickets, played a key role in MI's campaign this season under Rohit's captaincy, even though the five-time champions were eventually knocked out in Qualifier 2. \"The calmness he (Rohit) has out in the middle is so evident,\" Green told ICC ahead of the World Test Championship Final against India at The Oval, starting June 7. \"He's obviously been there and done that for 10 years. To be out there with him and just talk through a situation was awesome. \"My role was trying to be aggressive and then he obviously showed ways to go about it, whether it was attacking spin, attacking pace, kind of picking your bowler in a way,\" the 24-year-old added. Green joined the Australia side late and made his first appearance at training session on Thursday. While the Mumbai teammates will now be WTC Final foes, Green can turn to what he learnt from the India skipper throughout the IPL and during their crucial century partnership against Sunrisers Hyderabad in the final IPL league game when they meet in the red-ball showdown. Gearing up for the marquee clash, Green believes in-form Virat Kohli is definitely going to a big threat. \"Virat Kohli. I think he always tries to be the man to stand up in big moments,\" he said. \"A World Test Championship is obviously a massive moment, so I look forward to that.\" Green feels there won't be any problem for him to switch gears from T20 format to Test cricket. Advertisement \"There is nothing like Test cricket when you're kind of out in the middle,\" he said. \"Obviously your nerves are running really high. I think the best players are the best ones that are able to handle that.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-06-04 18:22:02","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"डब्ल्यूटीसी फाइनल में ऑस्ट्रेलिया से कैसे पार पाएगी टीम इंडिया? रोहित शर्मा ने बताया फॉर्मूला","link":"https://hindi.news18.com/news/sports/cricket-rohit-sharma-said-it-can-not-be-felt-in-england-we-come-to-know-whento-attack-wtc-final-ind-vs-aus-6416157.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और ऑस्ट्रेलिया के बीच डब्ल्यूटीसी फाइनल 7 जून से द ओवल में खेला जाएगा. इस मुकाबले के लिए टीम इंडिया लंदन पहुंचकर अपनी तैयारियों को अंतिम रूप दे रही है.","content":"रोहित शर्मा ने इंग्लैंड में सफल होने का बताया फॉर्मूला. नई दिल्ली. भारतीय क्रिकेट टीम के कप्तान रोहित शर्मा (Rohit Sharma) का कहना है कि इंग्लैंड की परिस्थितियां किसी भी बैटर्स के लिए चुनौतीपूर्ण होती है. वर्ल्ड क्रिकेट में हिटमैन के नाम से फेमस रोहित ने कहा है कि इस तरह की पिचों पर बैटर्स के लिए मेहनत के अलावा कोई और विकल्प नहीं है और कोई भी बैटर्स क्रीज पर सहज महसूस नहीं करता लेकिन उसे पता चल जाता है कि प्रतिद्वंद्वी टीम के गेंदबाजों के खिलाफ कब आक्रामकता बरतनी है. ऑस्ट्रेलिया के खिलाफ बुधवार से शुरू होने वाले विश्व टेस्ट चैम्पियनशिप फाइनल से पहले भारतीय कप्तान को लगता है कि इंग्लैंड की पिचों पर कड़ी मेहनत के अलावा कोई विकल्प नहीं है. रोहित ने रविवार को यहां आईसीसी के एक कार्यक्रम ‘आफ्टरनून विद टेस्ट लीजेंड्स’ में कहा, ‘मुझे लगता है कि आमतौर पर बल्लेबाज के लिये इंग्लैंड में काफी चुनौतीपूर्ण परिस्थितियां होती हैं. जब तक आप चुनौतियों से निपटने के लिए तैयार रहते हो, तब तक आपको सफलता मिलती है.’ श्रीलंका ने अफगानिस्तान पर दर्ज की सबसे बड़ी जीत, वनडे सीरीज बराबर, मेहमानों को 200 रन के पड़े लाले रोहित 2021 में इंग्लैंड के खिलाफ चार टेस्ट में भारत में सर्वश्रेष्ठ बल्लेबाज रहे थे. पैट कमिंस, रॉस टेलर और इयान बेल के साथ बैठे भारतीय कप्तान ने अपने निजी अनुभव के बारे में बात करते हुए कहा, ‘2021 में मुझे एक चीज महसूस हुई कि आप कभी भी क्रीज पर जमते नहीं हो और फिर मौसम बदलता रहता है. आपको लंबे समय तक ध्यान लगाये रखना होता है और फिर आपको पता चल जाता है कि अब गेंदबाजों को धुनने का समय आ गया है. सबसे महत्वपूर्ण चीज है कि आपको क्रीज पर जाकर समझना होता है कि आपकी मजबूती क्या है.’ मुंबई इंडियंस और टीम इंडिया के साथ इतने वर्षों में वह आंकड़ों और डाटा पर काफी ध्यान देते हैं. रोहित को लगता है कि ‘द ओवल’ में सफलता हासिल करने वाले पूर्व खिलाड़ियों के स्कोर बनाने के ‘पैटर्न’ को जानना बुरा विचार नहीं है. उन्होंने कहा, ‘मैं उनका (सफल खिलाड़ियों) अनुकरण करने की कोशिश नहीं करूंगा लेकिन उनके रन बनाने के ‘पैटर्न’ को जानना अच्छा होगा. मैंने पाया कि ओवल में स्क्वायर बाउंड्री काफी तेज लगती हैं.’ पिछले एक दशक से एक से दूसरे प्रारूप में खेलने के लिए खुद को ढालने वाले रोहित जानते हैं कि यह मुश्किल होता है लेकिन वह इस चुनौती और जरूरत के अनुसार अपनी तकनीक में बदलाव करने की खुद की काबिलियत का आनंद लेते हैं. रोहित ने कहा, ‘प्रारूप बदलना निश्चित रूप से चुनौतीपूर्ण कारक है. आप कई प्रारूपों में खेलते हो. मानसिक रूप से आपको बदलने के अनुकूलित होना चाहिए और अपनी तकनीक में फेरबदल करना चाहिए. आपको मानसिक रूप से तैयार रहना चाहिए. (इनपुट-भाषा ) . Tags: Rohit sharma , WTC Final नाथन लॉयन से लेकर आर अश्विन तक, WTC में किसने किए सबसे ज्यादा शिकार, भारतीय बॉलर कहां? कठिन समस्याएं सुलझाने में ज्यादा समय लेते हैं अकलमंद लोग- शोध मशहूर कपल कर चुके हैं सगाई, लेना चाहते हैं 7 फेरे, मगर ऐसा पेंच फंसा है, चाहते हुए भी नहीं कर पा रहे शादी","pubDate":"2023-06-04 18:04:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-21-16859014933x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia won't go into defence-mode bowling in Ashes","link":"https://www.perthnow.com.au/sport/cricket/australia-wont-go-into-defence-mode-bowling-in-ashes-c-10874606","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia believe England's attacking approach to Test cricket will bring about more dismissals in the Ashes, vowing not to go on the defence with the ball.","content":"Australia are preparing to fight fire with fire in the Ashes, vowing not to be trapped into solely trying to slow England down and instead hoping the hosts' aggression will cost them wickets. The tourists have turned their focus to Wednesday's World Test Championship final against India at The Oval, where a shot at a maiden long-format crown awaits Pat Cummins' men. But in the background, coaching staff have one eye on June 16 and attempting to find an answer to the Bazball revolution. England sent a final reminder of their dynamic style in last week's 10-wicket win over Ireland, as they rattled along at 6.36 per over with the bat. With Brendon \"Baz\" McCullum as coach, four frontline English batsmen have scored at a strike-rate of more than 80 in the past 12 months. Australia's coach Andrew McDonald would not detail the exact plan for England, but said his side would approach that Test series with \"totally different\" tactics to those they'd employ against India. But one thing they won't be lured into doing is going on the defensive and adopting a Twenty20 cricket approach of trying to solely dry up England's runs. \"There'll be a lot more dismissal options than a T20 game, where sometimes towards the back end it's executing yorkers when the ball is travelling straight,\" McDonald said. \"The red ball and in particular a Dukes ball will offer something, so we'll be able to be creative enough with with the way that we use our fields. \"Their modes of dismissal haven't changed a lot. There hasn't been a real big shift in the way that they get out. \"So their vulnerabilities are still there. And we'll look to expose those.\" Options could include having men on the boundary square of the wicket, or using unconventional field placements as genuine wicket-taking options. Australia have been the world's most economical bowling team in recent years, regularly operating at between 2.7 and 3.0 runs per over as they strangle oppositions. But in England, they are prepared for that rate to increase. \"We pride ourselves on being relentless with the ball and controlling the tempo is one of our big themes,\" McDonald said. \"The tempo may go up purely on the ground sizes, the speed of the outfield and the wickets flattening out. \"So it may look slightly different to potentially the 2.8 that we usually operate at. It might go up. We're prepared for that. \"But it's all going to be within the context of that game. \"No doubt the scoring rate will be a little bit higher with the way that they play, but we're hoping the balls-per-dismissal come down and then that way that evens out.\"","pubDate":"2023-06-04 17:34:32","image_url":"https://images.perthnow.com.au/publication/C-10874606/b3a367a09701e708c1ab0a81a059d5771fac4e0b-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australian side not affected by poor record at The Oval ahead of WTC final against India, says skipper Pat Cummins","link":"https://thenewsmill.com/2023/06/australian-side-not-affected-by-poor-record-at-the-oval-ahead-of-wtc-final-against-india-says-skipper-pat-cummins/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Ahead of his side’s ICC World Test Championship final match against India from June 7, Australia skipper Pat Cummins admitted that his side is not affected in any way by their poor Test record at The Oval, where it has won only two Tests in the last fifty years. In an event ahead of the ICC World Test Championship final against India, which will start at The Oval, Cummins discussed the WTC Final, Test cricket, the Indian team, etc. Out of their 38 matches at The Oval, Australia has won only seven, lost 17 and drawn 14. With a win percentage of 18.42, this is one of Australia’s worst-performing venues across the world. In the last fifty years, they have won two (in 2001 and 2015). “Not really (if the poor record at The Oval bothers his team). Our playing group has not played a lot of those matches. Our side is experienced. We have played some Ashes matches here. Some of our guys have scored runs. It has a similar pace, bounce to many Australian venues. We hope to get that same pace, bounce in the WTC final,” said Cummins. Australia missed out on the final of the first World Test Championship back in 2021 due to a slow-over rate penalty, which saw their points being reduced. Cummins said that initially, it was not something much talked about in the group. “But when we saw the final (between India and New Zealand), we realised what we had missed. It has been a driving force for us during these last couple of years. We have played some really awesome cricket during this time,” said the Aussie skipper. “At home, we have been formidable, except against India, which defeated us twice. We have a lot of experienced players, some players at the top of their game despite being at the twilight of their career. It is going to be interesting playing at a neutral venue,” added Cummins. On lack of cricket played before the WTC final as compared to India, which played a lot of Indian Premier League (IPL), Cummins said that from a bowlers point of view, he would prefer to be “underdone” than “overdone”, to stay fresh. “We have been having a great time training. The team is fresh and rejuvenated,” added Cummins. Cummins said that Test cricket is the top format of the game and he loves it. “It drains you mentally and physically. It tests you in every aspect as a player. You have to pick yourself, dust everything off yourself more than any other format,” added Cummins. Australia ended at the top of the WTC table with 11 wins, three losses, five draws in 19 matches whereas India ended in second position with 10 wins, five losses and three draws. India’s squad for WTC final: Rohit Sharma (Captain), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, KS Bharat (wk), Ravichandran Ashwin, Ravindra Jadeja, Axar Patel, Shardul Thakur, Mohd. Shami, Mohd. Siraj, Umesh Yadav, Jaydev Unadkat, Ishan Kishan (wk). Suryakumar Yadav, Mukesh Kumar and Yashasvi Jaiswal have been named as stand-by players for the high-stakes match. Australia squad: Pat Cummins (c), Scott Boland, Alex Carey (wk), Cameron Green, Marcus Harris, Travis Head, Josh Inglis (wk), Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Todd Murphy, Michael Neser, Steve Smith (vc), Mitchell Starc, David Warner Standby players: Mitch Marsh, and Matthew Renshaw. (ANI)","pubDate":"2023-06-04 17:34:24","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Jack Leach ruled out of men’s Ashes series with lower back fracture","link":"https://thenewsmill.com/2023/06/jack-leach-ruled-out-of-mens-ashes-series-with-lower-back-fracture/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"England spinner Jack Leach has been ruled out of the Men’s Ashes series after suffering from a low back stress fracture on Sunday as announced by The England and Wales Cricket Board. The 31-year-old Somerset slow-left-armer developed low back symptoms during England’s Test victory over Ireland on Saturday. A stress fracture was discovered during a scan on Sunday in London, ruling him out of the upcoming Ashes Test series, which begins on Friday, June 16 at Edgbaston. England will announce a replacement for the Ashes series in due course. England had announced the 16-member squad for the first two matches of the Ashes series on Saturday. The spinner’s unavailability could be concerning as English fast bowler Ben Stokes did not make it to the Ashes squad due to his knee injury. Updated England squad: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 17:34:12","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Josh Hazlewood plays down concerns over Ashes campaign","link":"https://thewest.com.au/sport/cricket/hazlewood-plays-down-concerns-over-ashes-campaign-c-10876726","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Josh Hazlewood has been limited to four Tests in two years but he is adamant his fitness has not been a significant issue.","content":"Josh Hazlewood insists long-term concerns over his run of injuries are overblown and says his overall fitness is sound despite being limited to four Test appearances in two years. Hazlewood has been put on ice for Australia’s World Test Championship final against India at The Oval after failing to overcome side soreness. He got through three separate bowling spells at training on Saturday but will now watch on with Australia expected to play Scott Boland as their third seamer. Brought home from the IPL last month amid concerns over another side strain, Hazlewood’s run of injuries has been extensive as they are frustrating. The 32-year-old first suffered a side injury in the opening Test of the 2021-22 Ashes, leaving him sidelined for the remainder of that series. He was then picked for one Test in Pakistan before being overlooked for the rest of that 2022 series and during the ensuing tour of Sri Lanka. He suffered another side strain in the opening Test in Perth last summer, before an achilles injury on his return in Sydney left him unable to play in India. But as far as Hazlewood is concerned, the injuries have been more poorly timed than anything else. “I am not playing Test matches, but I am still bowling for close to 50 weeks of the year,” Hazlewood told AAP. “That’s the frustrating bit. “Just bowling in the past week or so here in England, it feels a bit easier. “You have a nice Dukes ball, there is a bit doing, you don’t have to break your back every ball like you do in India or Australia or somewhere else. “Hopefully that plays into my hands a little bit.” Hazlewood also downplayed concerns that the setback in the IPL was a sign his side strain could be a recurring issue during the Ashes. “After a long break, the intensity of the IPL is through the roof,” Hazlewood said. “You’re bowling wide yorker there, wide yorker to the other side, slower-ball, bouncer. Your body just gets in some bad positions technical wise. “I just felt a bit of crunching in my side, and I am very cautious with it.” Hazlewood is hopeful he will not have to be managed through the Ashes, with three sets of back-to-back Tests as bowling innings are generally shorter in England. He is also undecided if this will be his last Ashes tour, or if he can join Glenn McGrath as the only Australian quick this century to play beyond their 36th birthday. “I don’t really think too far ahead. You can get caught out a bit if you think too far ahead and where you will be in four years,” Hazlewood said. “I could still be playing then, I might not be “Being a fast bowler, not many walk off the field by their own choice. A lot of the time it comes through injury or your body has had enough. “Sometimes it hits you at 33, 34, 35 or 36. It could be any time.” Sign up for our emails","pubDate":"2023-06-05 00:02:24","image_url":"https://images.thewest.com.au/publication/C-10876726/91cb33d7b2cdffbc40111ddbc27b668bb50a4237-16x9-x242y15w558h314.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"England would prefer going into Ashes with Anderson, Robinson and Wood as pacers, says Mark Butcher","link":"https://thenewsmill.com/2023/06/england-would-prefer-going-into-ashes-with-anderson-robinson-and-wood-as-pacers-says-mark-butcher/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former England cricketer Mark Butcher believes England would prefer to go into the upcoming Ashes series against arch rivals Australia with the redoubatble pace trio of James Anderson, Ollie Robinson, and tearaway Mark Wood. The high-stakes Ashes series will start from June 16. “We think England’s preferred choice of bowling attack would be Anderson, Robinson, Wood, in terms of the three quicks. We still don’t know what [Ben] Stokes’ status is. I’m sure he will be absolutely fine, but if that isn’t the case, Stuart Broad today looked a little bit on the tardy side, a little slow and lacking in penetration when the ball was a little bit older,” Butcher told Sky Sports. England have already set sights on the Ashes series after trouncing England in a one-off Test, while Australia will go into the prestigious red-ball series after playing India in the World Test Championship (WTC) final. The WTC final would get underway at the Oval in London on June 7. Butcher, the former England opener, also had his say on young pacer Josh Tongue, who got himself on the Lord’s Honours board with brilliant spell of 5/66 in his debut Test against Ireland. “Until Josh Tongue got the ball back in his hand, and England went to a slightly more orthodox method of operating – going away from the short ball – there were one or two concerns. The main one being Jack Leach’s difficulties in bowling to left-handers,” he told Sky Sports. England have announced a 16-member squad for the first two matches of the Ashes series, retaining the same group from the one-off Test against Ireland. Josh Tongue found a place alongside James Anderson and Ollie Robinson, both of whom were ruled out of the Lord’s Test. “England have asked for flat pitches in the Ashes, haven’t they? They’ve not asked for green seamers; they want to take Australia on at their own game, be able to go out there and compile big runs. So, if there was one slight concern, it was that with tailenders in essentially they were made to look pretty ordinary for a long period of time during that afternoon session,” Butcher said. England squad for first two Ashes Tests: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Jack Leach, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 19:34:12","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Joe Root can't wait for Ashes without captaincy burden","link":"https://www.perthnow.com.au/sport/cricket/joe-root-cant-wait-for-ashes-without-captaincy-burden-c-10874864","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"England's main batter Joe Root says he's looking forward to playing his first Ashes series in eight years without having to worry about being captain.","content":"Joe Root says he will relish the chance to deliver for England and focus purely on playing in his first Ashes series in eight years without the captaincy. England made it 11 wins in 13 Tests under the leadership of skipper Ben Stokes and head coach Brendon McCullum with a 10-wicket victory over Ireland at Lord's on Saturday. All eyes now turn to the Ashes opener on June 16 and Root, who was man of the series on home soil in 2015 with 460 runs, is excited after leading England during the last three red-ball battles with Australia. \"It's going to be nice, yeah,\" the Yorkshireman said. \"It's going to be nice to just go and play the game and try and assist where I can for Ben and for the other guys around, play a slightly different senior role in the team. \"They're always great fun to be a part of, these big games, big series. They're the ones you want to stand up and play well in and it's an opportunity to do that again. \"I think my batting has been fine for a while, but, mentally, to be able to just turn up and play and have fun, just chat batting with some of the younger guys. \"Obviously I'll try and help out where I can but Ben knows what he's doing. \"He's got enough behind him now to give himself the encouragement and confidence to make those big calls on his own, as you'd expect him to anyway. He's doing a far better job than I did.\" Root's own preparation for this monumental series had been far from ideal before his 56 against Ireland. The Yorkshire batter decided against playing county championship cricket during April and May after he secured a first Indian Premier League contract, but Rajasthan Royals only selected him on three occasions and he batted just once in the tournament. Nevertheless, the 32-year-old was philosophical about his experience in India. \"Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here,\" Root explained. \"I am not saying it's not important or a good standard. For where I am in my career, am I going to learn more about myself in that environment? \"Am I really going to be prepared better for an Ashes series facing lower pace bowling on some nibbly wickets when hopefully we will play on good pitches against high pace and a high quality spinner? I don't think so. \"By learning and experiencing something new, discussing the game with greats like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year it would set me up best to get the best out of myself. I feel ready.\"","pubDate":"2023-06-04 18:39:04","image_url":"https://images.perthnow.com.au/publication/C-10874864/65a4affb9f54f8921a248ff8962b35cdc19c7d16-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australia’s journey to World Test Championship final against India","link":"https://thenewsmill.com/2023/06/australias-journey-to-world-test-championship-final-against-india/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"The Australian team are set to face India in the World Test Championship (WTC) final at the Ovals in London starting from June 7. Australia topped the WTC points table in the 2021-23 cycle with 66.67 points per cent in 19 Tests, while India made its cut for the final with 58.8 per cent. In the first WTC final, New Zealand became the champions of Test cricket after beating India at Southampton in 2021, as the WTC event has a two-year cycle. Australia missed by a narrow margin entering the WTC final in 2021 due to a slow over rate penalty, but this time they played brilliantly and reached the final in England. Australia qualified for the WTC final in the top spot. They played 19 matches and won 11 of them, while India earned 10 wins after playing 18 test matches. Before the Aussies play to claim the Test Championship, let’s see the journey of Australia to reach the final against India. Ashes (England vs Australia) – December 2021-January 2022 (won 4-0) The Aussies outplayed England in the Ashes series held between December 2021 and January 2022. They won the series 4-0. In the first test, they won comfortably by nine wickets. Pat Cummins’s clobbering bowling spell bundled the England side for just 147 runs in the first innings. Then, Travis Head played a blistering knock of 152, and David Warner’s 94 helped Australia post 425 in the first inning. In the second innings, spinner Nathan Lyon did the job and restricted England to 297. Australia chased the 19-run target quickly. The second test had the same story, Steve Smith took charge of Australia for the first time since the infamous ball-tampering incident in 2018, but the setback was insignificant as the hosts dominated the match from the start. With scores of 103 and 51, Marnus Labuschagne secured the No. 1 Test-batter rating, while Alex Carey produced a half-century in front of his home crowd in only his second Test, and Travis Head extended his hot start to the series with 51 in the second innings. Australia won the match by 275 runs. In the third match, England’s batting lineup crumbled and Australia registered a big win by an innings and 14 runs. In the first innings, Pat Cummins’s 3/36 and Nathan Lyon’s 3/36 had restricted England to 185. And in the second innings, Scott Boland performed exceptionally well and took six wickets by conceding only seven runs. Mitchell Starc had taken three wickets. Fourth test was a draw, however, Usman Khawaja displayed his talent with 137 runs and Scott Boland was the pick of the bowlers as he had the bowling figures of 4/36 in the first innings and 3/30 in the second innings. Fifth and the last match was won by 146 runs, Cameron Green contributed 74 runs as Australia recovered from 4-83 to record 303 batting first. Pat Cummins got seven wickets throughout the match, with Mitchell Starc, Scott Boland, and Green each getting three to conclude England’s terrible tour. Benaud-Qadir Trophy-Pakistan, March 2022 (won 1-0) Australia toured Pakistan after 24 years and the Cummins-led side defeated the host by 1-0. The two matches went to draw. But in the last test in Lahore, the Aussies came out victorious by 115 runs. Warne-Muralidaran Trophy, June-July 2022 (drawn 1-1) In the two-match series against Sri Lanka in their home venue. Australia won the first test by 10 wickets but in the second test, they had to face defeat by an innings and 39 runs. Frank Worrell Trophy-West Indies, November-December 2022 (2-0) Following their hosting of the T20 World Cup, Australia began their five-Test home season against a West Indies side that had gone undefeated in their previous five matches, having defeated England 1-0 and Bangladesh 2-0 in the previous home series. They claimed the series by 2-0, winning the first two matches and making the third match draw. Australia v South Africa – December 2022-January 2023 (won 2-0) Australia outplayed South Africa in a three-match series. In the first test in Gabba, they won by six wickets. Followed by a dominating win in the second test by an innings and 182 runs at the MCG. The third test was drawn. Border Gavaskar Trophy, February-March 2023 (lost 1-2) The Australian challenge arrived at India as India’s final obstacle towards the WTC final. In the first Test, an all-round show by Ravindra Jadeja (70 and seven wickets), a century by Rohit Sharma (120) helped India win by an innings and 132 runs. In the second Test, half-century by Axar Patel (74) and yet another all-round masterclass by Jadeja (26 and 10 wickets including a spell of 7/62) helped India win by six-wickets. Jadeja’s seven-wicket haul crumbled the Aussies to just 113 runs while following on, leaving India to chase 115 runs. India retained the Border-Gavaskar Trophy with a 2-0 lead. A spin exhibition by legendary Nathan Lyon (3/35 and 8/64) helped Australia win a low-scoring third Test by nine wickets to stay alive in the series. The scoreline was 2-1. In the final Test, Virat Kohli (186) outclassed Usman Khawaja (180) and Cameron Green (114) in a high-scoring match, which ended in a draw. India won the series 2-1. Australia squad for WTC final: Pat Cummins (c), Scott Boland, Alex Carey (wk), Cameron Green, Marcus Harris, Travis Head, Josh Inglis (wk), Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Todd Murphy, Michael Neser, Steve Smith (vc), Mitchell Starc, David Warner Standby players: Mitch Marsh, Matthew Renshaw India squad: Rohit Sharma (c), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, KS Bharat (wk), Ravichandran Ashwin, Ravindra Jadeja, Axar Patel, Shardul Thakur, Mohd. Shami, Mohd. Siraj, Umesh Yadav, Jaydev Unadkat and Ishan Kishan (wk). Standby players: Yashasvi Jaiswal, Mukesh Kumar and Suryakumar Yadav. (ANI)","pubDate":"2023-06-04 18:34:20","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Sport is cruel at times”: Michael Vaughan after England spinner Leach ruled out of Ashes due to injury","link":"https://thenewsmill.com/2023/06/sport-is-cruel-at-times-michael-vaughan-after-england-spinner-leach-ruled-out-of-ashes-due-to-injury/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former England captain Michael Vaughan expressed his disappointment over Jack Leach’s omission from The Ashes series against Australia, saying that the “sport is cruel at times” and he not being in the squad is a big blow to England. England spinner Jack Leach has been ruled out of the Men’s Ashes series after suffering from a low back stress fracture on Sunday as announced by The England and Wales Cricket Board. Leach has become a “pivotal figure” under the leadership of skipper Ben Stokes and coach Brendon McCullum. “Gutted for Jack leach .. Sport is cruel at times .. he has become a pivotal figure for England under Ben & Baz .. !! This is a big blow to England’s chances as Jack has become very good at holding an end whilst the seamers rotate & getting key wickets .. !! #Ashes,” tweeted Vaughan. The 31-year-old Somerset slow-left-armer developed low back symptoms during England’s Test victory over Ireland on Saturday. A stress fracture was discovered during a scan on Sunday in London, ruling him out of the upcoming Ashes Test series, which begins on Friday, June 16 at Edgbaston. England will announce a replacement for the Ashes series in due course. England had announced the 16-member squad for the first two matches of the Ashes series on Saturday. The spinner’s unavailability could be concerning as English fast bowler Ben Stokes did not make it to the Ashes squad due to his knee injury. Updated England squad: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 18:34:08","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"\"The Calmness He Has...\": Cameron Green Doffs Hat To Captain Rohit Sharma","link":"https://sports.ndtv.com/cricket/the-calmness-he-has-cameron-green-doffs-hat-to-captain-rohit-sharma-4092579","keywords":null,"creator":null,"video_url":null,"description":"While the Mumbai teammates will now be WTC Final foes, Green can turn to what he learned from the India skipper throughout the IPL and during their crucial century partnership against Sunrisers Hyderabad in the final IPL league game when they meet in the red-ball showdown.","content":"Australia all-rounder Cameron Green hopes to bring the calmness of Rohit Sharma into his game, having spent a quality time with the India captain in the Mumbai Indians dugout in IPL this year. Green, with 452 runs and six wickets, played a key role in MI's campaign this season under Rohit's captaincy, even though the five-time champions were eventually knocked out in Qualifier 2. \"The calmness he (Rohit) has out in the middle is so evident,\" Green told ICC ahead of the World Test Championship Final against India at The Oval, starting June 7. \"He's obviously been there and done that for 10 years. To be out there with him and just talk through a situation was awesome. \"My role was trying to be aggressive and then he obviously showed ways to go about it, whether it was attacking spin, attacking pace, kind of picking your bowler in a way,\" the 24-year-old added. Green joined the Australia side late and made his first appearance at training session on Thursday. While the Mumbai teammates will now be WTC Final foes, Green can turn to what he learnt from the India skipper throughout the IPL and during their crucial century partnership against Sunrisers Hyderabad in the final IPL league game when they meet in the red-ball showdown. Gearing up for the marquee clash, Green believes in-form Virat Kohli is definitely going to a big threat. \"Virat Kohli. I think he always tries to be the man to stand up in big moments,\" he said. \"A World Test Championship is obviously a massive moment, so I look forward to that.\" Green feels there won't be any problem for him to switch gears from T20 format to Test cricket. Advertisement \"There is nothing like Test cricket when you're kind of out in the middle,\" he said. \"Obviously your nerves are running really high. I think the best players are the best ones that are able to handle that.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-06-04 18:22:02","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"डब्ल्यूटीसी फाइनल में ऑस्ट्रेलिया से कैसे पार पाएगी टीम इंडिया? रोहित शर्मा ने बताया फॉर्मूला","link":"https://hindi.news18.com/news/sports/cricket-rohit-sharma-said-it-can-not-be-felt-in-england-we-come-to-know-whento-attack-wtc-final-ind-vs-aus-6416157.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और ऑस्ट्रेलिया के बीच डब्ल्यूटीसी फाइनल 7 जून से द ओवल में खेला जाएगा. इस मुकाबले के लिए टीम इंडिया लंदन पहुंचकर अपनी तैयारियों को अंतिम रूप दे रही है.","content":"रोहित शर्मा ने इंग्लैंड में सफल होने का बताया फॉर्मूला. नई दिल्ली. भारतीय क्रिकेट टीम के कप्तान रोहित शर्मा (Rohit Sharma) का कहना है कि इंग्लैंड की परिस्थितियां किसी भी बैटर्स के लिए चुनौतीपूर्ण होती है. वर्ल्ड क्रिकेट में हिटमैन के नाम से फेमस रोहित ने कहा है कि इस तरह की पिचों पर बैटर्स के लिए मेहनत के अलावा कोई और विकल्प नहीं है और कोई भी बैटर्स क्रीज पर सहज महसूस नहीं करता लेकिन उसे पता चल जाता है कि प्रतिद्वंद्वी टीम के गेंदबाजों के खिलाफ कब आक्रामकता बरतनी है. ऑस्ट्रेलिया के खिलाफ बुधवार से शुरू होने वाले विश्व टेस्ट चैम्पियनशिप फाइनल से पहले भारतीय कप्तान को लगता है कि इंग्लैंड की पिचों पर कड़ी मेहनत के अलावा कोई विकल्प नहीं है. रोहित ने रविवार को यहां आईसीसी के एक कार्यक्रम ‘आफ्टरनून विद टेस्ट लीजेंड्स’ में कहा, ‘मुझे लगता है कि आमतौर पर बल्लेबाज के लिये इंग्लैंड में काफी चुनौतीपूर्ण परिस्थितियां होती हैं. जब तक आप चुनौतियों से निपटने के लिए तैयार रहते हो, तब तक आपको सफलता मिलती है.’ श्रीलंका ने अफगानिस्तान पर दर्ज की सबसे बड़ी जीत, वनडे सीरीज बराबर, मेहमानों को 200 रन के पड़े लाले रोहित 2021 में इंग्लैंड के खिलाफ चार टेस्ट में भारत में सर्वश्रेष्ठ बल्लेबाज रहे थे. पैट कमिंस, रॉस टेलर और इयान बेल के साथ बैठे भारतीय कप्तान ने अपने निजी अनुभव के बारे में बात करते हुए कहा, ‘2021 में मुझे एक चीज महसूस हुई कि आप कभी भी क्रीज पर जमते नहीं हो और फिर मौसम बदलता रहता है. आपको लंबे समय तक ध्यान लगाये रखना होता है और फिर आपको पता चल जाता है कि अब गेंदबाजों को धुनने का समय आ गया है. सबसे महत्वपूर्ण चीज है कि आपको क्रीज पर जाकर समझना होता है कि आपकी मजबूती क्या है.’ मुंबई इंडियंस और टीम इंडिया के साथ इतने वर्षों में वह आंकड़ों और डाटा पर काफी ध्यान देते हैं. रोहित को लगता है कि ‘द ओवल’ में सफलता हासिल करने वाले पूर्व खिलाड़ियों के स्कोर बनाने के ‘पैटर्न’ को जानना बुरा विचार नहीं है. उन्होंने कहा, ‘मैं उनका (सफल खिलाड़ियों) अनुकरण करने की कोशिश नहीं करूंगा लेकिन उनके रन बनाने के ‘पैटर्न’ को जानना अच्छा होगा. मैंने पाया कि ओवल में स्क्वायर बाउंड्री काफी तेज लगती हैं.’ पिछले एक दशक से एक से दूसरे प्रारूप में खेलने के लिए खुद को ढालने वाले रोहित जानते हैं कि यह मुश्किल होता है लेकिन वह इस चुनौती और जरूरत के अनुसार अपनी तकनीक में बदलाव करने की खुद की काबिलियत का आनंद लेते हैं. रोहित ने कहा, ‘प्रारूप बदलना निश्चित रूप से चुनौतीपूर्ण कारक है. आप कई प्रारूपों में खेलते हो. मानसिक रूप से आपको बदलने के अनुकूलित होना चाहिए और अपनी तकनीक में फेरबदल करना चाहिए. आपको मानसिक रूप से तैयार रहना चाहिए. (इनपुट-भाषा ) . Tags: Rohit sharma , WTC Final नाथन लॉयन से लेकर आर अश्विन तक, WTC में किसने किए सबसे ज्यादा शिकार, भारतीय बॉलर कहां? कठिन समस्याएं सुलझाने में ज्यादा समय लेते हैं अकलमंद लोग- शोध मशहूर कपल कर चुके हैं सगाई, लेना चाहते हैं 7 फेरे, मगर ऐसा पेंच फंसा है, चाहते हुए भी नहीं कर पा रहे शादी","pubDate":"2023-06-04 18:04:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-21-16859014933x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia won't go into defence-mode bowling in Ashes","link":"https://www.perthnow.com.au/sport/cricket/australia-wont-go-into-defence-mode-bowling-in-ashes-c-10874606","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia believe England's attacking approach to Test cricket will bring about more dismissals in the Ashes, vowing not to go on the defence with the ball.","content":"Australia are preparing to fight fire with fire in the Ashes, vowing not to be trapped into solely trying to slow England down and instead hoping the hosts' aggression will cost them wickets. The tourists have turned their focus to Wednesday's World Test Championship final against India at The Oval, where a shot at a maiden long-format crown awaits Pat Cummins' men. But in the background, coaching staff have one eye on June 16 and attempting to find an answer to the Bazball revolution. England sent a final reminder of their dynamic style in last week's 10-wicket win over Ireland, as they rattled along at 6.36 per over with the bat. With Brendon \"Baz\" McCullum as coach, four frontline English batsmen have scored at a strike-rate of more than 80 in the past 12 months. Australia's coach Andrew McDonald would not detail the exact plan for England, but said his side would approach that Test series with \"totally different\" tactics to those they'd employ against India. But one thing they won't be lured into doing is going on the defensive and adopting a Twenty20 cricket approach of trying to solely dry up England's runs. \"There'll be a lot more dismissal options than a T20 game, where sometimes towards the back end it's executing yorkers when the ball is travelling straight,\" McDonald said. \"The red ball and in particular a Dukes ball will offer something, so we'll be able to be creative enough with with the way that we use our fields. \"Their modes of dismissal haven't changed a lot. There hasn't been a real big shift in the way that they get out. \"So their vulnerabilities are still there. And we'll look to expose those.\" Options could include having men on the boundary square of the wicket, or using unconventional field placements as genuine wicket-taking options. Australia have been the world's most economical bowling team in recent years, regularly operating at between 2.7 and 3.0 runs per over as they strangle oppositions. But in England, they are prepared for that rate to increase. \"We pride ourselves on being relentless with the ball and controlling the tempo is one of our big themes,\" McDonald said. \"The tempo may go up purely on the ground sizes, the speed of the outfield and the wickets flattening out. \"So it may look slightly different to potentially the 2.8 that we usually operate at. It might go up. We're prepared for that. \"But it's all going to be within the context of that game. \"No doubt the scoring rate will be a little bit higher with the way that they play, but we're hoping the balls-per-dismissal come down and then that way that evens out.\"","pubDate":"2023-06-04 17:34:32","image_url":"https://images.perthnow.com.au/publication/C-10874606/b3a367a09701e708c1ab0a81a059d5771fac4e0b-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australian side not affected by poor record at The Oval ahead of WTC final against India, says skipper Pat Cummins","link":"https://thenewsmill.com/2023/06/australian-side-not-affected-by-poor-record-at-the-oval-ahead-of-wtc-final-against-india-says-skipper-pat-cummins/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Ahead of his side’s ICC World Test Championship final match against India from June 7, Australia skipper Pat Cummins admitted that his side is not affected in any way by their poor Test record at The Oval, where it has won only two Tests in the last fifty years. In an event ahead of the ICC World Test Championship final against India, which will start at The Oval, Cummins discussed the WTC Final, Test cricket, the Indian team, etc. Out of their 38 matches at The Oval, Australia has won only seven, lost 17 and drawn 14. With a win percentage of 18.42, this is one of Australia’s worst-performing venues across the world. In the last fifty years, they have won two (in 2001 and 2015). “Not really (if the poor record at The Oval bothers his team). Our playing group has not played a lot of those matches. Our side is experienced. We have played some Ashes matches here. Some of our guys have scored runs. It has a similar pace, bounce to many Australian venues. We hope to get that same pace, bounce in the WTC final,” said Cummins. Australia missed out on the final of the first World Test Championship back in 2021 due to a slow-over rate penalty, which saw their points being reduced. Cummins said that initially, it was not something much talked about in the group. “But when we saw the final (between India and New Zealand), we realised what we had missed. It has been a driving force for us during these last couple of years. We have played some really awesome cricket during this time,” said the Aussie skipper. “At home, we have been formidable, except against India, which defeated us twice. We have a lot of experienced players, some players at the top of their game despite being at the twilight of their career. It is going to be interesting playing at a neutral venue,” added Cummins. On lack of cricket played before the WTC final as compared to India, which played a lot of Indian Premier League (IPL), Cummins said that from a bowlers point of view, he would prefer to be “underdone” than “overdone”, to stay fresh. “We have been having a great time training. The team is fresh and rejuvenated,” added Cummins. Cummins said that Test cricket is the top format of the game and he loves it. “It drains you mentally and physically. It tests you in every aspect as a player. You have to pick yourself, dust everything off yourself more than any other format,” added Cummins. Australia ended at the top of the WTC table with 11 wins, three losses, five draws in 19 matches whereas India ended in second position with 10 wins, five losses and three draws. India’s squad for WTC final: Rohit Sharma (Captain), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, KS Bharat (wk), Ravichandran Ashwin, Ravindra Jadeja, Axar Patel, Shardul Thakur, Mohd. Shami, Mohd. Siraj, Umesh Yadav, Jaydev Unadkat, Ishan Kishan (wk). Suryakumar Yadav, Mukesh Kumar and Yashasvi Jaiswal have been named as stand-by players for the high-stakes match. Australia squad: Pat Cummins (c), Scott Boland, Alex Carey (wk), Cameron Green, Marcus Harris, Travis Head, Josh Inglis (wk), Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Todd Murphy, Michael Neser, Steve Smith (vc), Mitchell Starc, David Warner Standby players: Mitch Marsh, and Matthew Renshaw. (ANI)","pubDate":"2023-06-04 17:34:24","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Jack Leach ruled out of men’s Ashes series with lower back fracture","link":"https://thenewsmill.com/2023/06/jack-leach-ruled-out-of-mens-ashes-series-with-lower-back-fracture/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"England spinner Jack Leach has been ruled out of the Men’s Ashes series after suffering from a low back stress fracture on Sunday as announced by The England and Wales Cricket Board. The 31-year-old Somerset slow-left-armer developed low back symptoms during England’s Test victory over Ireland on Saturday. A stress fracture was discovered during a scan on Sunday in London, ruling him out of the upcoming Ashes Test series, which begins on Friday, June 16 at Edgbaston. England will announce a replacement for the Ashes series in due course. England had announced the 16-member squad for the first two matches of the Ashes series on Saturday. The spinner’s unavailability could be concerning as English fast bowler Ben Stokes did not make it to the Ashes squad due to his knee injury. Updated England squad: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 17:34:12","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Josh Hazlewood plays down concerns over Ashes campaign","link":"https://thewest.com.au/sport/cricket/hazlewood-plays-down-concerns-over-ashes-campaign-c-10876726","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Josh Hazlewood has been limited to four Tests in two years but he is adamant his fitness has not been a significant issue.","content":"Josh Hazlewood insists long-term concerns over his run of injuries are overblown and says his overall fitness is sound despite being limited to four Test appearances in two years. Hazlewood has been put on ice for Australia’s World Test Championship final against India at The Oval after failing to overcome side soreness. He got through three separate bowling spells at training on Saturday but will now watch on with Australia expected to play Scott Boland as their third seamer. Brought home from the IPL last month amid concerns over another side strain, Hazlewood’s run of injuries has been extensive as they are frustrating. The 32-year-old first suffered a side injury in the opening Test of the 2021-22 Ashes, leaving him sidelined for the remainder of that series. He was then picked for one Test in Pakistan before being overlooked for the rest of that 2022 series and during the ensuing tour of Sri Lanka. He suffered another side strain in the opening Test in Perth last summer, before an achilles injury on his return in Sydney left him unable to play in India. But as far as Hazlewood is concerned, the injuries have been more poorly timed than anything else. “I am not playing Test matches, but I am still bowling for close to 50 weeks of the year,” Hazlewood told AAP. “That’s the frustrating bit. “Just bowling in the past week or so here in England, it feels a bit easier. “You have a nice Dukes ball, there is a bit doing, you don’t have to break your back every ball like you do in India or Australia or somewhere else. “Hopefully that plays into my hands a little bit.” Hazlewood also downplayed concerns that the setback in the IPL was a sign his side strain could be a recurring issue during the Ashes. “After a long break, the intensity of the IPL is through the roof,” Hazlewood said. “You’re bowling wide yorker there, wide yorker to the other side, slower-ball, bouncer. Your body just gets in some bad positions technical wise. “I just felt a bit of crunching in my side, and I am very cautious with it.” Hazlewood is hopeful he will not have to be managed through the Ashes, with three sets of back-to-back Tests as bowling innings are generally shorter in England. He is also undecided if this will be his last Ashes tour, or if he can join Glenn McGrath as the only Australian quick this century to play beyond their 36th birthday. “I don’t really think too far ahead. You can get caught out a bit if you think too far ahead and where you will be in four years,” Hazlewood said. “I could still be playing then, I might not be “Being a fast bowler, not many walk off the field by their own choice. A lot of the time it comes through injury or your body has had enough. “Sometimes it hits you at 33, 34, 35 or 36. It could be any time.” Sign up for our emails","pubDate":"2023-06-05 00:02:24","image_url":"https://images.thewest.com.au/publication/C-10876726/91cb33d7b2cdffbc40111ddbc27b668bb50a4237-16x9-x242y15w558h314.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"England would prefer going into Ashes with Anderson, Robinson and Wood as pacers, says Mark Butcher","link":"https://thenewsmill.com/2023/06/england-would-prefer-going-into-ashes-with-anderson-robinson-and-wood-as-pacers-says-mark-butcher/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former England cricketer Mark Butcher believes England would prefer to go into the upcoming Ashes series against arch rivals Australia with the redoubatble pace trio of James Anderson, Ollie Robinson, and tearaway Mark Wood. The high-stakes Ashes series will start from June 16. “We think England’s preferred choice of bowling attack would be Anderson, Robinson, Wood, in terms of the three quicks. We still don’t know what [Ben] Stokes’ status is. I’m sure he will be absolutely fine, but if that isn’t the case, Stuart Broad today looked a little bit on the tardy side, a little slow and lacking in penetration when the ball was a little bit older,” Butcher told Sky Sports. England have already set sights on the Ashes series after trouncing England in a one-off Test, while Australia will go into the prestigious red-ball series after playing India in the World Test Championship (WTC) final. The WTC final would get underway at the Oval in London on June 7. Butcher, the former England opener, also had his say on young pacer Josh Tongue, who got himself on the Lord’s Honours board with brilliant spell of 5/66 in his debut Test against Ireland. “Until Josh Tongue got the ball back in his hand, and England went to a slightly more orthodox method of operating – going away from the short ball – there were one or two concerns. The main one being Jack Leach’s difficulties in bowling to left-handers,” he told Sky Sports. England have announced a 16-member squad for the first two matches of the Ashes series, retaining the same group from the one-off Test against Ireland. Josh Tongue found a place alongside James Anderson and Ollie Robinson, both of whom were ruled out of the Lord’s Test. “England have asked for flat pitches in the Ashes, haven’t they? They’ve not asked for green seamers; they want to take Australia on at their own game, be able to go out there and compile big runs. So, if there was one slight concern, it was that with tailenders in essentially they were made to look pretty ordinary for a long period of time during that afternoon session,” Butcher said. England squad for first two Ashes Tests: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Jack Leach, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 19:34:12","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Joe Root can't wait for Ashes without captaincy burden","link":"https://www.perthnow.com.au/sport/cricket/joe-root-cant-wait-for-ashes-without-captaincy-burden-c-10874864","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"England's main batter Joe Root says he's looking forward to playing his first Ashes series in eight years without having to worry about being captain.","content":"Joe Root says he will relish the chance to deliver for England and focus purely on playing in his first Ashes series in eight years without the captaincy. England made it 11 wins in 13 Tests under the leadership of skipper Ben Stokes and head coach Brendon McCullum with a 10-wicket victory over Ireland at Lord's on Saturday. All eyes now turn to the Ashes opener on June 16 and Root, who was man of the series on home soil in 2015 with 460 runs, is excited after leading England during the last three red-ball battles with Australia. \"It's going to be nice, yeah,\" the Yorkshireman said. \"It's going to be nice to just go and play the game and try and assist where I can for Ben and for the other guys around, play a slightly different senior role in the team. \"They're always great fun to be a part of, these big games, big series. They're the ones you want to stand up and play well in and it's an opportunity to do that again. \"I think my batting has been fine for a while, but, mentally, to be able to just turn up and play and have fun, just chat batting with some of the younger guys. \"Obviously I'll try and help out where I can but Ben knows what he's doing. \"He's got enough behind him now to give himself the encouragement and confidence to make those big calls on his own, as you'd expect him to anyway. He's doing a far better job than I did.\" Root's own preparation for this monumental series had been far from ideal before his 56 against Ireland. The Yorkshire batter decided against playing county championship cricket during April and May after he secured a first Indian Premier League contract, but Rajasthan Royals only selected him on three occasions and he batted just once in the tournament. Nevertheless, the 32-year-old was philosophical about his experience in India. \"Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here,\" Root explained. \"I am not saying it's not important or a good standard. For where I am in my career, am I going to learn more about myself in that environment? \"Am I really going to be prepared better for an Ashes series facing lower pace bowling on some nibbly wickets when hopefully we will play on good pitches against high pace and a high quality spinner? I don't think so. \"By learning and experiencing something new, discussing the game with greats like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year it would set me up best to get the best out of myself. I feel ready.\"","pubDate":"2023-06-04 18:39:04","image_url":"https://images.perthnow.com.au/publication/C-10874864/65a4affb9f54f8921a248ff8962b35cdc19c7d16-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australia’s journey to World Test Championship final against India","link":"https://thenewsmill.com/2023/06/australias-journey-to-world-test-championship-final-against-india/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"The Australian team are set to face India in the World Test Championship (WTC) final at the Ovals in London starting from June 7. Australia topped the WTC points table in the 2021-23 cycle with 66.67 points per cent in 19 Tests, while India made its cut for the final with 58.8 per cent. In the first WTC final, New Zealand became the champions of Test cricket after beating India at Southampton in 2021, as the WTC event has a two-year cycle. Australia missed by a narrow margin entering the WTC final in 2021 due to a slow over rate penalty, but this time they played brilliantly and reached the final in England. Australia qualified for the WTC final in the top spot. They played 19 matches and won 11 of them, while India earned 10 wins after playing 18 test matches. Before the Aussies play to claim the Test Championship, let’s see the journey of Australia to reach the final against India. Ashes (England vs Australia) – December 2021-January 2022 (won 4-0) The Aussies outplayed England in the Ashes series held between December 2021 and January 2022. They won the series 4-0. In the first test, they won comfortably by nine wickets. Pat Cummins’s clobbering bowling spell bundled the England side for just 147 runs in the first innings. Then, Travis Head played a blistering knock of 152, and David Warner’s 94 helped Australia post 425 in the first inning. In the second innings, spinner Nathan Lyon did the job and restricted England to 297. Australia chased the 19-run target quickly. The second test had the same story, Steve Smith took charge of Australia for the first time since the infamous ball-tampering incident in 2018, but the setback was insignificant as the hosts dominated the match from the start. With scores of 103 and 51, Marnus Labuschagne secured the No. 1 Test-batter rating, while Alex Carey produced a half-century in front of his home crowd in only his second Test, and Travis Head extended his hot start to the series with 51 in the second innings. Australia won the match by 275 runs. In the third match, England’s batting lineup crumbled and Australia registered a big win by an innings and 14 runs. In the first innings, Pat Cummins’s 3/36 and Nathan Lyon’s 3/36 had restricted England to 185. And in the second innings, Scott Boland performed exceptionally well and took six wickets by conceding only seven runs. Mitchell Starc had taken three wickets. Fourth test was a draw, however, Usman Khawaja displayed his talent with 137 runs and Scott Boland was the pick of the bowlers as he had the bowling figures of 4/36 in the first innings and 3/30 in the second innings. Fifth and the last match was won by 146 runs, Cameron Green contributed 74 runs as Australia recovered from 4-83 to record 303 batting first. Pat Cummins got seven wickets throughout the match, with Mitchell Starc, Scott Boland, and Green each getting three to conclude England’s terrible tour. Benaud-Qadir Trophy-Pakistan, March 2022 (won 1-0) Australia toured Pakistan after 24 years and the Cummins-led side defeated the host by 1-0. The two matches went to draw. But in the last test in Lahore, the Aussies came out victorious by 115 runs. Warne-Muralidaran Trophy, June-July 2022 (drawn 1-1) In the two-match series against Sri Lanka in their home venue. Australia won the first test by 10 wickets but in the second test, they had to face defeat by an innings and 39 runs. Frank Worrell Trophy-West Indies, November-December 2022 (2-0) Following their hosting of the T20 World Cup, Australia began their five-Test home season against a West Indies side that had gone undefeated in their previous five matches, having defeated England 1-0 and Bangladesh 2-0 in the previous home series. They claimed the series by 2-0, winning the first two matches and making the third match draw. Australia v South Africa – December 2022-January 2023 (won 2-0) Australia outplayed South Africa in a three-match series. In the first test in Gabba, they won by six wickets. Followed by a dominating win in the second test by an innings and 182 runs at the MCG. The third test was drawn. Border Gavaskar Trophy, February-March 2023 (lost 1-2) The Australian challenge arrived at India as India’s final obstacle towards the WTC final. In the first Test, an all-round show by Ravindra Jadeja (70 and seven wickets), a century by Rohit Sharma (120) helped India win by an innings and 132 runs. In the second Test, half-century by Axar Patel (74) and yet another all-round masterclass by Jadeja (26 and 10 wickets including a spell of 7/62) helped India win by six-wickets. Jadeja’s seven-wicket haul crumbled the Aussies to just 113 runs while following on, leaving India to chase 115 runs. India retained the Border-Gavaskar Trophy with a 2-0 lead. A spin exhibition by legendary Nathan Lyon (3/35 and 8/64) helped Australia win a low-scoring third Test by nine wickets to stay alive in the series. The scoreline was 2-1. In the final Test, Virat Kohli (186) outclassed Usman Khawaja (180) and Cameron Green (114) in a high-scoring match, which ended in a draw. India won the series 2-1. Australia squad for WTC final: Pat Cummins (c), Scott Boland, Alex Carey (wk), Cameron Green, Marcus Harris, Travis Head, Josh Inglis (wk), Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Todd Murphy, Michael Neser, Steve Smith (vc), Mitchell Starc, David Warner Standby players: Mitch Marsh, Matthew Renshaw India squad: Rohit Sharma (c), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, KS Bharat (wk), Ravichandran Ashwin, Ravindra Jadeja, Axar Patel, Shardul Thakur, Mohd. Shami, Mohd. Siraj, Umesh Yadav, Jaydev Unadkat and Ishan Kishan (wk). Standby players: Yashasvi Jaiswal, Mukesh Kumar and Suryakumar Yadav. (ANI)","pubDate":"2023-06-04 18:34:20","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"“Sport is cruel at times”: Michael Vaughan after England spinner Leach ruled out of Ashes due to injury","link":"https://thenewsmill.com/2023/06/sport-is-cruel-at-times-michael-vaughan-after-england-spinner-leach-ruled-out-of-ashes-due-to-injury/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Former England captain Michael Vaughan expressed his disappointment over Jack Leach’s omission from The Ashes series against Australia, saying that the “sport is cruel at times” and he not being in the squad is a big blow to England. England spinner Jack Leach has been ruled out of the Men’s Ashes series after suffering from a low back stress fracture on Sunday as announced by The England and Wales Cricket Board. Leach has become a “pivotal figure” under the leadership of skipper Ben Stokes and coach Brendon McCullum. “Gutted for Jack leach .. Sport is cruel at times .. he has become a pivotal figure for England under Ben & Baz .. !! This is a big blow to England’s chances as Jack has become very good at holding an end whilst the seamers rotate & getting key wickets .. !! #Ashes,” tweeted Vaughan. The 31-year-old Somerset slow-left-armer developed low back symptoms during England’s Test victory over Ireland on Saturday. A stress fracture was discovered during a scan on Sunday in London, ruling him out of the upcoming Ashes Test series, which begins on Friday, June 16 at Edgbaston. England will announce a replacement for the Ashes series in due course. England had announced the 16-member squad for the first two matches of the Ashes series on Saturday. The spinner’s unavailability could be concerning as English fast bowler Ben Stokes did not make it to the Ashes squad due to his knee injury. Updated England squad: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 18:34:08","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"\"The Calmness He Has...\": Cameron Green Doffs Hat To Captain Rohit Sharma","link":"https://sports.ndtv.com/cricket/the-calmness-he-has-cameron-green-doffs-hat-to-captain-rohit-sharma-4092579","keywords":null,"creator":null,"video_url":null,"description":"While the Mumbai teammates will now be WTC Final foes, Green can turn to what he learned from the India skipper throughout the IPL and during their crucial century partnership against Sunrisers Hyderabad in the final IPL league game when they meet in the red-ball showdown.","content":"Australia all-rounder Cameron Green hopes to bring the calmness of Rohit Sharma into his game, having spent a quality time with the India captain in the Mumbai Indians dugout in IPL this year. Green, with 452 runs and six wickets, played a key role in MI's campaign this season under Rohit's captaincy, even though the five-time champions were eventually knocked out in Qualifier 2. \"The calmness he (Rohit) has out in the middle is so evident,\" Green told ICC ahead of the World Test Championship Final against India at The Oval, starting June 7. \"He's obviously been there and done that for 10 years. To be out there with him and just talk through a situation was awesome. \"My role was trying to be aggressive and then he obviously showed ways to go about it, whether it was attacking spin, attacking pace, kind of picking your bowler in a way,\" the 24-year-old added. Green joined the Australia side late and made his first appearance at training session on Thursday. While the Mumbai teammates will now be WTC Final foes, Green can turn to what he learnt from the India skipper throughout the IPL and during their crucial century partnership against Sunrisers Hyderabad in the final IPL league game when they meet in the red-ball showdown. Gearing up for the marquee clash, Green believes in-form Virat Kohli is definitely going to a big threat. \"Virat Kohli. I think he always tries to be the man to stand up in big moments,\" he said. \"A World Test Championship is obviously a massive moment, so I look forward to that.\" Green feels there won't be any problem for him to switch gears from T20 format to Test cricket. Advertisement \"There is nothing like Test cricket when you're kind of out in the middle,\" he said. \"Obviously your nerves are running really high. I think the best players are the best ones that are able to handle that.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","pubDate":"2023-06-04 18:22:02","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"डब्ल्यूटीसी फाइनल में ऑस्ट्रेलिया से कैसे पार पाएगी टीम इंडिया? रोहित शर्मा ने बताया फॉर्मूला","link":"https://hindi.news18.com/news/sports/cricket-rohit-sharma-said-it-can-not-be-felt-in-england-we-come-to-know-whento-attack-wtc-final-ind-vs-aus-6416157.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारत और ऑस्ट्रेलिया के बीच डब्ल्यूटीसी फाइनल 7 जून से द ओवल में खेला जाएगा. इस मुकाबले के लिए टीम इंडिया लंदन पहुंचकर अपनी तैयारियों को अंतिम रूप दे रही है.","content":"रोहित शर्मा ने इंग्लैंड में सफल होने का बताया फॉर्मूला. नई दिल्ली. भारतीय क्रिकेट टीम के कप्तान रोहित शर्मा (Rohit Sharma) का कहना है कि इंग्लैंड की परिस्थितियां किसी भी बैटर्स के लिए चुनौतीपूर्ण होती है. वर्ल्ड क्रिकेट में हिटमैन के नाम से फेमस रोहित ने कहा है कि इस तरह की पिचों पर बैटर्स के लिए मेहनत के अलावा कोई और विकल्प नहीं है और कोई भी बैटर्स क्रीज पर सहज महसूस नहीं करता लेकिन उसे पता चल जाता है कि प्रतिद्वंद्वी टीम के गेंदबाजों के खिलाफ कब आक्रामकता बरतनी है. ऑस्ट्रेलिया के खिलाफ बुधवार से शुरू होने वाले विश्व टेस्ट चैम्पियनशिप फाइनल से पहले भारतीय कप्तान को लगता है कि इंग्लैंड की पिचों पर कड़ी मेहनत के अलावा कोई विकल्प नहीं है. रोहित ने रविवार को यहां आईसीसी के एक कार्यक्रम ‘आफ्टरनून विद टेस्ट लीजेंड्स’ में कहा, ‘मुझे लगता है कि आमतौर पर बल्लेबाज के लिये इंग्लैंड में काफी चुनौतीपूर्ण परिस्थितियां होती हैं. जब तक आप चुनौतियों से निपटने के लिए तैयार रहते हो, तब तक आपको सफलता मिलती है.’ श्रीलंका ने अफगानिस्तान पर दर्ज की सबसे बड़ी जीत, वनडे सीरीज बराबर, मेहमानों को 200 रन के पड़े लाले रोहित 2021 में इंग्लैंड के खिलाफ चार टेस्ट में भारत में सर्वश्रेष्ठ बल्लेबाज रहे थे. पैट कमिंस, रॉस टेलर और इयान बेल के साथ बैठे भारतीय कप्तान ने अपने निजी अनुभव के बारे में बात करते हुए कहा, ‘2021 में मुझे एक चीज महसूस हुई कि आप कभी भी क्रीज पर जमते नहीं हो और फिर मौसम बदलता रहता है. आपको लंबे समय तक ध्यान लगाये रखना होता है और फिर आपको पता चल जाता है कि अब गेंदबाजों को धुनने का समय आ गया है. सबसे महत्वपूर्ण चीज है कि आपको क्रीज पर जाकर समझना होता है कि आपकी मजबूती क्या है.’ मुंबई इंडियंस और टीम इंडिया के साथ इतने वर्षों में वह आंकड़ों और डाटा पर काफी ध्यान देते हैं. रोहित को लगता है कि ‘द ओवल’ में सफलता हासिल करने वाले पूर्व खिलाड़ियों के स्कोर बनाने के ‘पैटर्न’ को जानना बुरा विचार नहीं है. उन्होंने कहा, ‘मैं उनका (सफल खिलाड़ियों) अनुकरण करने की कोशिश नहीं करूंगा लेकिन उनके रन बनाने के ‘पैटर्न’ को जानना अच्छा होगा. मैंने पाया कि ओवल में स्क्वायर बाउंड्री काफी तेज लगती हैं.’ पिछले एक दशक से एक से दूसरे प्रारूप में खेलने के लिए खुद को ढालने वाले रोहित जानते हैं कि यह मुश्किल होता है लेकिन वह इस चुनौती और जरूरत के अनुसार अपनी तकनीक में बदलाव करने की खुद की काबिलियत का आनंद लेते हैं. रोहित ने कहा, ‘प्रारूप बदलना निश्चित रूप से चुनौतीपूर्ण कारक है. आप कई प्रारूपों में खेलते हो. मानसिक रूप से आपको बदलने के अनुकूलित होना चाहिए और अपनी तकनीक में फेरबदल करना चाहिए. आपको मानसिक रूप से तैयार रहना चाहिए. (इनपुट-भाषा ) . Tags: Rohit sharma , WTC Final नाथन लॉयन से लेकर आर अश्विन तक, WTC में किसने किए सबसे ज्यादा शिकार, भारतीय बॉलर कहां? कठिन समस्याएं सुलझाने में ज्यादा समय लेते हैं अकलमंद लोग- शोध मशहूर कपल कर चुके हैं सगाई, लेना चाहते हैं 7 फेरे, मगर ऐसा पेंच फंसा है, चाहते हुए भी नहीं कर पा रहे शादी","pubDate":"2023-06-04 18:04:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/06/rohit-sharma-21-16859014933x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Australia won't go into defence-mode bowling in Ashes","link":"https://www.perthnow.com.au/sport/cricket/australia-wont-go-into-defence-mode-bowling-in-ashes-c-10874606","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Australia believe England's attacking approach to Test cricket will bring about more dismissals in the Ashes, vowing not to go on the defence with the ball.","content":"Australia are preparing to fight fire with fire in the Ashes, vowing not to be trapped into solely trying to slow England down and instead hoping the hosts' aggression will cost them wickets. The tourists have turned their focus to Wednesday's World Test Championship final against India at The Oval, where a shot at a maiden long-format crown awaits Pat Cummins' men. But in the background, coaching staff have one eye on June 16 and attempting to find an answer to the Bazball revolution. England sent a final reminder of their dynamic style in last week's 10-wicket win over Ireland, as they rattled along at 6.36 per over with the bat. With Brendon \"Baz\" McCullum as coach, four frontline English batsmen have scored at a strike-rate of more than 80 in the past 12 months. Australia's coach Andrew McDonald would not detail the exact plan for England, but said his side would approach that Test series with \"totally different\" tactics to those they'd employ against India. But one thing they won't be lured into doing is going on the defensive and adopting a Twenty20 cricket approach of trying to solely dry up England's runs. \"There'll be a lot more dismissal options than a T20 game, where sometimes towards the back end it's executing yorkers when the ball is travelling straight,\" McDonald said. \"The red ball and in particular a Dukes ball will offer something, so we'll be able to be creative enough with with the way that we use our fields. \"Their modes of dismissal haven't changed a lot. There hasn't been a real big shift in the way that they get out. \"So their vulnerabilities are still there. And we'll look to expose those.\" Options could include having men on the boundary square of the wicket, or using unconventional field placements as genuine wicket-taking options. Australia have been the world's most economical bowling team in recent years, regularly operating at between 2.7 and 3.0 runs per over as they strangle oppositions. But in England, they are prepared for that rate to increase. \"We pride ourselves on being relentless with the ball and controlling the tempo is one of our big themes,\" McDonald said. \"The tempo may go up purely on the ground sizes, the speed of the outfield and the wickets flattening out. \"So it may look slightly different to potentially the 2.8 that we usually operate at. It might go up. We're prepared for that. \"But it's all going to be within the context of that game. \"No doubt the scoring rate will be a little bit higher with the way that they play, but we're hoping the balls-per-dismissal come down and then that way that evens out.\"","pubDate":"2023-06-04 17:34:32","image_url":"https://images.perthnow.com.au/publication/C-10874606/b3a367a09701e708c1ab0a81a059d5771fac4e0b-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Australian side not affected by poor record at The Oval ahead of WTC final against India, says skipper Pat Cummins","link":"https://thenewsmill.com/2023/06/australian-side-not-affected-by-poor-record-at-the-oval-ahead-of-wtc-final-against-india-says-skipper-pat-cummins/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"Ahead of his side’s ICC World Test Championship final match against India from June 7, Australia skipper Pat Cummins admitted that his side is not affected in any way by their poor Test record at The Oval, where it has won only two Tests in the last fifty years. In an event ahead of the ICC World Test Championship final against India, which will start at The Oval, Cummins discussed the WTC Final, Test cricket, the Indian team, etc. Out of their 38 matches at The Oval, Australia has won only seven, lost 17 and drawn 14. With a win percentage of 18.42, this is one of Australia’s worst-performing venues across the world. In the last fifty years, they have won two (in 2001 and 2015). “Not really (if the poor record at The Oval bothers his team). Our playing group has not played a lot of those matches. Our side is experienced. We have played some Ashes matches here. Some of our guys have scored runs. It has a similar pace, bounce to many Australian venues. We hope to get that same pace, bounce in the WTC final,” said Cummins. Australia missed out on the final of the first World Test Championship back in 2021 due to a slow-over rate penalty, which saw their points being reduced. Cummins said that initially, it was not something much talked about in the group. “But when we saw the final (between India and New Zealand), we realised what we had missed. It has been a driving force for us during these last couple of years. We have played some really awesome cricket during this time,” said the Aussie skipper. “At home, we have been formidable, except against India, which defeated us twice. We have a lot of experienced players, some players at the top of their game despite being at the twilight of their career. It is going to be interesting playing at a neutral venue,” added Cummins. On lack of cricket played before the WTC final as compared to India, which played a lot of Indian Premier League (IPL), Cummins said that from a bowlers point of view, he would prefer to be “underdone” than “overdone”, to stay fresh. “We have been having a great time training. The team is fresh and rejuvenated,” added Cummins. Cummins said that Test cricket is the top format of the game and he loves it. “It drains you mentally and physically. It tests you in every aspect as a player. You have to pick yourself, dust everything off yourself more than any other format,” added Cummins. Australia ended at the top of the WTC table with 11 wins, three losses, five draws in 19 matches whereas India ended in second position with 10 wins, five losses and three draws. India’s squad for WTC final: Rohit Sharma (Captain), Shubman Gill, Cheteshwar Pujara, Virat Kohli, Ajinkya Rahane, KS Bharat (wk), Ravichandran Ashwin, Ravindra Jadeja, Axar Patel, Shardul Thakur, Mohd. Shami, Mohd. Siraj, Umesh Yadav, Jaydev Unadkat, Ishan Kishan (wk). Suryakumar Yadav, Mukesh Kumar and Yashasvi Jaiswal have been named as stand-by players for the high-stakes match. Australia squad: Pat Cummins (c), Scott Boland, Alex Carey (wk), Cameron Green, Marcus Harris, Travis Head, Josh Inglis (wk), Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Todd Murphy, Michael Neser, Steve Smith (vc), Mitchell Starc, David Warner Standby players: Mitch Marsh, and Matthew Renshaw. (ANI)","pubDate":"2023-06-04 17:34:24","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Jack Leach ruled out of men’s Ashes series with lower back fracture","link":"https://thenewsmill.com/2023/06/jack-leach-ruled-out-of-mens-ashes-series-with-lower-back-fracture/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":"The News Mill","content":"England spinner Jack Leach has been ruled out of the Men’s Ashes series after suffering from a low back stress fracture on Sunday as announced by The England and Wales Cricket Board. The 31-year-old Somerset slow-left-armer developed low back symptoms during England’s Test victory over Ireland on Saturday. A stress fracture was discovered during a scan on Sunday in London, ruling him out of the upcoming Ashes Test series, which begins on Friday, June 16 at Edgbaston. England will announce a replacement for the Ashes series in due course. England had announced the 16-member squad for the first two matches of the Ashes series on Saturday. The spinner’s unavailability could be concerning as English fast bowler Ben Stokes did not make it to the Ashes squad due to his knee injury. Updated England squad: Ben Stokes (c), Ollie Pope, Jonny Bairstow (wk), Joe Root, James Anderson, Stuart Broad, Harry Brook, Ben Duckett, Zak Crawley, Matthew Potts, Ollie Robinson, Dan Lawrence, Chris Woakes, Mark Wood, Josh Tongue. (ANI)","pubDate":"2023-06-04 17:34:12","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"}]}