{"newsArray":[{"title":"England roll the dice with teen leg-spinner for crucial Lord’s Test","link":"https://www.theage.com.au/sport/cricket/england-roll-the-dice-with-teen-leg-spinner-for-crucial-lord-s-test-20230624-p5dj45.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"England have called 18-year-old leg-spinner Rehan Ahmed into their squad as cover for the injured Moeen Ali ahead of the second Test at Lord’s, but history is against him.","content":"England’s decision to call up 18-year-old leg-spinner Rehan Ahmed as cover for injured veteran Moeen Ali could be made redundant, with the Lord’s pitch expected to again favour seam bowlers. Jamie Cox, the former prolific Tasmania opening batsman and head of cricket and operations at the Marylebone Cricket Club, which owns Lord’s, said faster bowlers had claimed most of the wickets in county matches at the historic ground this season. “I can only talk of the cricket I’ve watched here and most recently it doesn’t spin a lot,” Cox told this masthead. “If you get a nice dry Test, it will certainly spin as the game progresses, but it’s not the surface in England that I would associate the most with the ball spinning out of big footmarks. I would guess that seam would do most of the damage here.” Seamers have dominated Test matches at Lord’s since Australia’s last Ashes tour in 2019, making up the top 11 most successful bowlers at the ground in that time, taking a total of 120 wickets. The two leading bowlers are Jimmy Anderson and Stuart Broad, with 14 wickets each in four Tests. The leading spinner is Jack Leach, with five wickets in three Tests, and he has been ruled out of the Ashes series with a back injury. The next best spinner is Moeen, with three wickets in one Test at an average of 46. England have called in young leg-spinner Rehan Ahmed for the Lord’s Test squad. Credit: Getty Having made a shock return after retiring from Test cricket almost two years ago, Moeen was in no condition for long-form cricket in the first Test at Edgbaston, suffering a gash in his spinning finger from the extra wear and tear of bowling 33 overs in Australia’s first innings. He managed just 14 overs in the second innings when England needed him to bowl on the drying pitch on the last day. Australia won the Test by two wickets in dramatic circumstances as Pat Cummins and Nathan Lyon put on 55 runs for the eighth wicket to get the visitors home. For all the talk about England’s ultra-aggressive Bazball approach, there are serious questions about their planning. While Ahmed was listed as a sub for Leach and then Moeen, his inclusion in the England squad is based largely on hope. He made an impressive debut in Pakistan in December, claiming seven wickets in his only Test, and he has played all three forms on the subcontinent for his country. However, in county cricket his batting has been more productive than his bowling. Playing for Leicestershire in Division Two of the county championship, he has taken just six wickets at 67.7 this season, but has scored four half-centuries. England appear to have no clear plan for their back-up spinners, calling Moeen out of retirement on the back of a one-word text from captain Ben Stokes that read, “Ashes?”, which Moeen originally thought was a joke. He has suffered the same overuse finger injury that hindered him during the 2017-18 Ashes tour of Australia. England are likely to recall express bowler Mark Wood for the second Test. The original theory was that he would replace Anderson, who was below his best at Edgbaston. However, given the Moeen injury, Ahmed’s lack of development and the inability of Stokes to bowl many overs because of a chronic knee injury, England could play four seamers and use Joe Root as their spinner at Lord’s. Root bowled well at Edgbaston until Australia captain Pat Cummins hit him for two sixes in three balls, setting the visitors on a course for a most unlikely victory. Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now.","pubDate":"2023-06-24 00:25:37","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Green the answer to Australia's 18-year Ashes search","link":"https://www.perthnow.com.au/sport/cricket/green-the-answer-to-australias-18-year-ashes-search-c-11075078","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cameron Green has outperformed Ben Stokes in the past two years of Test cricket, presenting himself as the answer to Australia's longest Ashes conundrum.","content":"Cameron Green's value to Australia in the Ashes has been laid bare with data showing how England have drastically benefited in the allrounder space over the past 18 years. Green is certain to play a crucial role in Australia's bid to win their first Ashes series in England since 2001, after healthy contributions in the two-wicket win at Edgbaston. Australia have been left searching for an allrounder of quality with both bat and ball since Andrew Flintoff's brilliant 2005 Ashes where he scored 402 runs and took 24 wickets. After Flintoff came Stokes, with England's lionheart keeping them in the 2019 series with both the bat and ball. From the 2005 Ashes through to the 2019 series in England, the hosts' allrounders have taken 54 wickets in 20 Tests and averaged 37.48 with the bat. Australia's returns have not been as joyful with 23 wickets in 13 Tests and a batting average of 33.64. But in Green, Australia can believe they have the answer. While Stokes' knee injury has left the England captain admitting he will be happy if he is still bowling by the fourth Test, Australia plan to increase Green's workload as the series goes on. Green has also averaged better than Stokes with both bat and ball in the past two years, while becoming the game's best fielder in the gully. \"Cameron Green ... we've been missing the allrounder since probably Keith Miller,\" Steve Waugh, who remains Australia's last captain to win a series in England, said earlier this month. \"He is probably the next best since him ... potentially. That just gives you the extra element to the team. \"When I was captain, my great allrounder was Adam Gilchrist. Now we've got Cameron Green.\" In the IPL this year, Mumbai Indians made a $3.15 million investment in Green and got returns of 452 runs at a strike-rate of 160.28 along with six wickets. Australia also made a call to make a long-term investment in Green two-and-a-half years ago, making clear they were going to give him time to develop as a No.6. In this Ashes, it's likely they could get their biggest reward yet if Green continues his form. \"He's fantastic, Greeny,\" Pat Cummins said. \"You've seen Ben Stokes, what he's done with England over the years, having that key allrounder who's in your top six can make a big difference at times. \"We're backing him in, he's still young but with each game he seems to be growing.\" GREEN V STOKES IN PAST TWO YEARS CAMERON GREEN Tests: 18 Runs: 802 Batting average: 36.45 Wickets: 26 Bowling average: 29.69 Catches: 18 BEN STOKES: Tests: 22 Runs: 1125 Batting average: 31.25 Wickets: 33 Bowling average: 35.03 Catches: 16","pubDate":"2023-06-24 00:02:10","image_url":"https://images.perthnow.com.au/publication/C-11075078/ff617203e66ff3af4f8d16e7805dc8ad945e910a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rumble in Harare…Windies, Chevrons in pivotal showdown","link":"https://www.chronicle.co.zw/rumble-in-harare-windies-chevrons-in-pivotal-showdown/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com IN what promises to be a thriller, the Windies and Zimbabwe will battle it out today at Harare Sports Club in a top-of-the-table clash in the 2023 Men’s Cricket World Cup Qualifiers. With a rich history between them, the Windies may feel confident, given their dominance in previous encounters. However, the Chevrons have […]","content":"The Chronicle IN what promises to be a thriller, the Windies and Zimbabwe will battle it out today at Harare Sports Club in a top-of-the-table clash in the 2023 Men’s Cricket World Cup Qualifiers. With a rich history between them, the Windies may feel confident, given their dominance in previous encounters. However, the Chevrons have shown tremendous form in the tournament, making this match a potential game-changer. With 48 matches played between them, the Windies hold the upper hand with 36 victories, while the Chevrons have managed only 10 wins against their opponents. Two matches have resulted in ties or inconclusive outcomes. Nonetheless, Zimbabwe have displayed impressive performances recently, winning their last two matches in a row. Playing on their home ground, Harare Sports Club, under the guidance of their legendary coach Dave Houghton, the Chevrons are buoyed by the support of their passionate fans, who have become their 12th man. Zimbabwe’s resurgence and the positive impact of Houghton’s leadership in the team’s dynamics will be crucial in their quest for victory against the formidable Windies. Following the Chevrons’ triumph over the Netherlands, Sikandar Raza, the history-making all-rounder, acknowledged Houghton’s transformative influence. “Dave has brought this culture, this mindset in the change room that unfortunately we were missing. We were on the verge of losing a culture, and lucky for all of us that we found Dave Houghton at the right time . . . he has brought everything that Zimbabwe was missing,” said Raza. Reflecting on their previous encounter in 2018, where Zimbabwe suffered a defeat that cost them a place in the World Cup, the Chevrons are determined to leave those memories behind. Brimming with confidence and rediscovering their winning formula, Zimbabwe relies heavily on the experience and skill of three senior players — Raza, Sean Williams, and skipper Craig Ervine. This trio’s exceptional form in the team’s opening matches will be vital against Darren Sammy’s Windies. During the tournament opener, Williams and Ervine each scored centuries, propelling Zimbabwe to an emphatic eight-wicket victory over Nepal. Their partnership of over 150 runs for the third wicket proved instrumental in securing the win. Ervine, in particular, showcased his prowess by achieving his third consecutive century in 50-over cricket, ending with an unbeaten 121 runs off 128 balls. Williams, on the other hand, etched his name in the record books by notching up the fastest century in ODI history for Zimbabwe, reaching the milestone in just 70 deliveries. In the subsequent match against the Netherlands, Zimbabwe continued their winning streak with a comfortable six-wicket triumph. Raza took centre stage this time, breaking records left and right. He achieved the fastest century for Zimbabwe, reaching the milestone in a mere 54 balls, surpassing Williams’ record. Remarkably, at 37, Raza became the oldest player in ODI history to take four wickets and score a century, surpassing the esteemed names of Sir Vivian Richards, Mohammad Hafeez, Tillakaratne Dilshan, and Sanath Jayasuriya. Williams and Ervine also contributed with half-centuries, scoring 50 and 91 runs, respectively. However, facing the powerful Windies side with their arsenal of big hitters, Zimbabwe’s bowlers, led by Tendai Chatara, must find their rhythm and deliver impactful performances. While the script has unfolded favourably for the Zimbabwean side thus far in the World Cup Qualifiers, a tough task lies ahead as they prepare to face the Windies, who are also flexing their muscles in the tournament. The Windies boast two of the most high-profile batters in Shai Hope and Nicholas Pooran, both of whom showcased their prowess by scoring centuries in their resounding 101-run victory over Nepal. Zimbabwe recognises the challenge and understands the importance of devising a plan to neutralise these formidable opponents. “We are thinking about the West Indies and we are also thinking about every other game as well, to be honest,” revealed Raza, emphasising the team’s focus on the upcoming clash. The outcome of this crucial encounter will determine the leader of Group A, adding an extra layer of significance to the match. With the stakes at their highest, the players from both teams are primed to deliver an enthralling contest for the spectators. The match is scheduled to commence at 09:00hrs, setting the stage for a riveting showdown between the Windies and the Chevrons as they vie for victory and continue their quest for qualification in the 2023 Men’s Cricket World Cup.","pubDate":"2023-06-23 22:05:51","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Dan Mousley and Will Smeed inspire Birmingham Bears and Somerset to key wins","link":"https://www.independent.co.uk/sport/cricket/somerset-kent-glenn-maxwell-dan-lawrence-worcestershire-b2363326.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"The Bears will be in the Vitality Blast quarter-finals while Somerset secured a home tie.","content":"Dan Mousley shone with bat and ball as Birmingham Bears clinched a Vitality Blast quarter-final spot with a convincing 53-run win over rivals Worcestershire on Friday. Mousley hit 51 in his side’s imposing 228 for four and then took four for 41 as the Rapids were restricted to 175 for nine by the North Group leaders. Rob Yates also scored 59 for the Bears and Glenn Maxwell added 44 from 20 deliveries while Mitchell Santner top-scored for the visitors with 56. South Group leaders Somerset secured a home quarter-final with a tight four-wicket win over Gloucestershire at Taunton. The hosts made a fine start as they reduced Gloucestershire to nine for three but Grant Roelofsen’s 52 and an unbeaten 42 from Jack Taylor helped the visitors post a competitive 186 for eight. Will Smeed cracked 78 from 42 balls in reply but it took further contributions from Ben Green (37), Kasey Aldridge (32no) and Craig Overton (17no) to ensure the job was completed with three balls to spare. Elsewhere, Daniel Bell-Drummond smashed a century and Grant Stewart took a hat-trick as Kent claimed a crushing 55-run win over Middlesex. Bell-Drummond hit 12 fours and four sixes in a 58-ball 111 and shared in a 127-run opening stand with Tawanda Muyeye (50) as Kent ran up 228 for three. Middlesex were bowled out for 173 in 19 overs in reply as George Linde, Joey Evison and Stewart each took three wickets. England white-ball captain Jos Buttler hit a 39-ball 83 with six sixes and eight fours as Lancashire beat Derbyshire by 27 runs in a rain-affected match at Old Trafford. Liam Livingstone added an unbeaten 47 as the Lightning made 177 for four from their reduced allocation of 15 overs. Derbyshire could muster just 150 for seven in response. Chris Lynn (62) and Saif Zaib (55) hit half-centuries as Northamptonshire powered to an emphatic 92-run win over the North Group’s bottom side Leicestershire. The pair put on 114 for the third wicket to help the Steelbacks to 210 for seven. The Foxes then crumbled to 118 all out despite 49 from England squad member Rehan Ahmed. Ben Sanderson was the pick of the bowling with three for 20 as the Steelbacks kept themselves in the quarter-final picture. Shadab Khan struck 87 from 53 balls as Sussex beat Glamorgan by 20 runs. The Pakistan all-rounder hit five fours and five sixes in his side’s 182 for six at Cardiff. Cam Fletcher top-scored with 57 in reply and Sam Northeast weighed in with 44 but Glamorgan fell short after Brad Currie and Tymal Mills took two wickets apiece. Hampshire beat Essex by four wickets by four wickets after 76 from captain James Vince in a close finish in Southampton. James Fuller also scored 56 but Benny Howell’s 36no and a late flurry from Liam Dawson were also needed for the hosts to reach their target of 210 in the last over. Dan Lawrence (70) and Feroze Khushi (61) were the mainstays of Essex’s 209 for seven after putting on 127 for the first wicket. The encounter between Durham and Yorkshire at the Riverside was declared a no result after rain intervened. Yorkshire were 49 for one after 8.1 overs when play was abandoned.","pubDate":"2023-06-23 21:44:48","image_url":"https://static.independent.co.uk/2023/06/23/22/c52d7d250101124463efa5a0cf2bb123Y29udGVudHNlYXJjaGFwaSwxNjg3NjQxODg5-2.67781944.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Virat Kohli, Rinku Singh, Guru Randhawa and other celebrities congratulate Suresh Raina for opening new restaurant in Amsterdam","link":"https://www.sportskeeda.com/cricket/news-virat-kohli-rinku-singh-guru-randhawa-celebrities-congratulate-suresh-raina-opening-new-restaurant-amsterdam","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Former Indian cricketer Suresh Raina recently opened his new restaurant, 'Raina Indian Restaurant', in Amsterdam, Netherlands. The former Indian cricketer aims to provide the taste of Indian dishes to residents of the famous European city. The 2011 World Cup winner posted four photos on Instagram earlier on Friday to announce the opening of his new restaurant. The tagline of Raina Indian Restaurant is ' Culinary Treasures of India '. Top names of the cricket world and Bollywood celebrities congratulated Suresh Raina on Instagram on his new venture. Here are some of the top reactions: Bollywood star Pulkit Samrat tagged Raina on his Instagram story and wrote: Popular music artist Guru Randhawa also congratulated Raina and wrote on his Instagram story. Kolkata Knight Riders star Rinku Singh , who idolized Raina as a cricketer, took to his Instagram to congratulate the former Indian cricketer as well. Raina's former India and Chennai Super Kings teammate Harbhajan Singh also dropped a comment on his Instagram post. Other top names who congratulated Raina in the comments box were Aly Goni, Kuldeep Yadav, Bobby Deol, Saina Nehwal, DJ Bravo, Deepak Chahar, Kiku Sharda, Piyush Chawla, Sneh Rana, Dhawal Kulkarni, Archana Vijaya, and Rahul Sharma. Instagram Post Priyanka Raina congratulated her husband with a long caption on Instagram. She posed with Suresh Raina in front of their restaurant in Amsterdam in a photo shared by her on the photo-sharing site. Priyanka labelled Suresh as an 'extraordinary' chef. She even invited her fans and followers to the Raina Indian Restaurant in Amsterdam. So far, the posts shared by Suresh and Priyanka have received over a million likes on Instagram. Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-06-23 21:15:35","image_url":"https://staticc.sportskeeda.com/editor/2023/06/9f58f-16875431684439-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Gayle Force: Cricket great Chris Gayle to throw opening pitch at Blue Jays game","link":"https://www.princegeorgecitizen.com/national-sports/gayle-force-cricket-great-chris-gayle-to-throw-opening-pitch-at-blue-jays-game-7189382","keywords":null,"creator":["John Chidley-Hill"," The Canadian Press"],"video_url":null,"description":"TORONTO — The Universe Boss is embracing his role as an ambassador for the sport of cricket. Chris Gayle will be throwing out the opening pitch at Rogers Centre on Saturday as the Toronto Blue Jays host the Oakland Athletics.","content":"TORONTO — The Universe Boss is embracing his role as an ambassador for the sport of cricket. Chris Gayle will be throwing out the opening pitch at Rogers Centre on Saturday as the Toronto Blue Jays host the Oakland Athletics. The 43-year-old Jamaican all-rounder said that as his playing days are winding down he wants to use his platform to help grow cricket, the sport he loves. \"It's good to have a sportsman from a different sport, both combining together, it's really good,\" said Gayle, sitting in the Blue Jays dugout at Rogers Centre and holding a baseball bat. \"That builds more of a relationship between the two sports. \"Baseball opens more doors for cricket and it's going to be a vice-versa when they see a cricketer is here at a baseball game. We will have the cricket eyes coming over to the baseball too.\" Gayle has set records in all three formats of cricket. He's the most capped player for the West Indies in international cricket. He's also the only player to have a triplet of centuries, with a triple hundred in Tests, a double hundred in one day international play and a hundred in Twenty20 play. Gayle is also the only player to score more than 14,000 runs and hit more than 1,000 sixes in Twenty20 cricket, the shortest format of the sport that has only 20 overs. He hopes that his appearance at Rogers Centre will get Toronto's large West Indian and South Asian communities out to a Blue Jays game and will also encourage baseball fans to check out cricket. \"The best place to start is by watching the Universe Boss. That's me,\" said Gayle, who is also goes by the nickname Gayle Force. \"That's where you want to say 'hey, this guy's very entertaining, let me go and check him out.' \"They're going to see a lot of history and say 'well, he's been pretty good, maybe I can watch a bit of cricket.'\" Gayle said he would take some practice throws before making the ceremonial first pitch on Saturday. Getting to throw twice, once a traditional baseball pitch and then a running cricket bowl, would be Gayle's preference to satisfy both sets of fans. \"I'd love to give them a proper bowling, but I want to do it properly,\" said Gayle, playing with a baseball in his hand. \"I wanted to do the proper pitch, so that's what I'm here to do. I'm going to deliver, as well. \"I also want to hit a home run. The baseball way, not the cricket way.\" Gayle will take batting practice with the Blue Jays on Saturday morning and then meet with Toronto's players before throwing out the opening pitch. Cricket-style Blue Jays jerseys will be given out to fans at the game. This report by The Canadian Press was first published June 23, 2023. John Chidley-Hill, The Canadian Press","pubDate":"2023-06-23 20:44:57","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/06/20230623150648-6495f7ad4cd7a037ea57cfd2jpeg.jpg;w=960","source_id":"princegeorgecitizen","category":["sports"],"country":["canada"],"language":"english"},{"title":"‘Sometimes you strike it lucky’: How a 25-cent phone poll gave the Matildas their name","link":"https://www.watoday.com.au/sport/soccer/sometimes-you-strike-it-lucky-how-a-25-cent-phone-poll-gave-the-matildas-their-name-20230517-p5d93q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Vince Rugari"],"video_url":null,"description":"The remarkable story of how the mascot from the 1982 Commonwealth Games inspired the Matildas’ nickname - after a public vote on a legendary SBS television show - is a mini-history of the evolution of the women’s game in Australia.","content":"Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For the duration of the FIFA Women’s World Cup, the Matildas will be based in Brisbane, and training at the Queensland Sport and Athletics Centre. It’s a fitting choice because the facility holds a special place in the team’s mythology. In the opening ceremony for the 1982 Commonwealth Games in Brisbane , a 13-metre tall, six-tonne animatronic kangaroo built on top of a forklift rolled around what was known, back then, as the QEII Stadium. Her name was Matilda. She could wriggle her ears, turn her head and open her “pouch”, out of which 20 kids dressed as joeys spilled for a trampoline display. Most memorably, she could blink her big, long eyelashes – and when she “winked” at Prince Philip, she became an instant Australian sporting icon, a symbol of the country’s cheeky irreverence and larrikin spirit. The famous ‘winking’ kangaroo named Matilda at the opening ceremony of the 1982 Brisbane Commonwealth Games. Credit: Vic Sumner Only in recent years has it emerged, via the ABC , that the person in charge of her eye movement apparatus smoked a joint just before the festivities began. You can draw a straight line from that extremely relaxed individual to the team that Sam Kerr will lead out onto Sydney’s Accor Stadium on July 20 for their opening match against Ireland – and it goes through four decades, seven FIFA World Cups, four famous words uttered by Juan Antonio Samaranch, an old classroom in Canberra, and a 25-cent phone poll on an iconic SBS television show helmed by Les Murray and Johnny Warren. The remarkable story of how that towering kangaroo inspired the team’s nickname has never been told in full. It is a mini-history of the evolution of the women’s game in Australia, and how a volunteer-run labour of love – fuelled by lamington drives, community raffles and an army of self-funded players – overcame widespread ignorance and indifference to cement the Matildas as a cultural phenomenon and uniting force, which is about to enjoy its crowning moment. Advertisement ‘Waltzing Matilda, we’re gonna kill you’ The Socceroos have been known by that name since 1972, when a publicity campaign for the team’s 1974 FIFA World Cup qualifiers coined the term “Socceroo”. It featured on a team logo unveiled by Sir Arthur George, the head of the Australian Soccer Federation, and was first deployed officially in plural form in a program for the visit of Scottish club Dundee United. With a push from Sydney journalist Tony Horstead, it quickly became widely used. But for 16 years, from their first senior international fixture in October 1979 against New Zealand, the Australian women’s team was known only as: Australia. That did not, however, stop others trying to come up with their own nicknames. A book co-authored by Matildas pioneer Heather Reid, Women in Boots: Football and Feminism in the 1970s , lists some of the cringeworthy names conjured up by the press over that period, including the “Soccerettes”, “Lady Socceroos”, “Soccerbelles”, and even the “Jillaroos”, which is today used by the national women’s rugby league team. One newspaper in New Zealand even called them the “Sexy Socceroos” during their 1980 tour. Until a government review triggered the creation of the Frank Lowy-led Australian Soccer Association (later renamed Football Federation Australia) in 2003, women’s football was run by an entirely separate organisation to the men: the Australian Women’s Soccer Association (AWSA), which formed in 1974. Advertisement Charged with fostering the growth of the women’s game and running the national team, the AWSA sat in the shadows of men’s soccer – which itself was in the shadows of more dominant codes like Aussie rules, rugby league and cricket. This was many years before football became a mainstream sport, when it was still largely driven by post-war ethnic migration, and when finding the scores from matches played in England or elsewhere usually meant waiting for newspapers to be delivered from overseas, days after they’d been played. Life on the margins meant the AWSA also had a miserly operating budget, which made national camps difficult to organise, let alone overseas fixtures. Players had to cover their own costs for airfares, uniforms and other fees, often resorting to fundraising efforts in pubs and clubs to find the money. When they did manage to play in another country, with no media coverage back home, they had to queue up at phone boxes to tell family and friends their results. Elaine Watson (left), the former president of the Australian Women’s Soccer Association. Credit: Football Australia In 1989, then-AWSA president Elaine Watson suggested the national team be called the “Soccertoos” – a portmanteau of “Cockatoos” with the idea that, yes, women play soccer too. The need for a formally recognised nickname was always obvious – not just for marketing reasons, but to stop the media from using silly, sometimes disrespectful alternatives, or derivatives of the Socceroos, which rubbed players the wrong way. It was an occasional topic of conversation within the national team’s dressing room and, during qualifying for the inaugural FIFA Women’s World Cup in 1991 , it came up again. “They asked us for suggestions,” said Sharon Young, who played four ‘A’ internationals for Australia and, as best as this masthead can tell, deserves to be credited as the first person to float the eventual nickname. “That’s when I said, ‘Well, what about Matilda? You know, the kangaroo that went around the stadium, the one that winked?’ I thought that’d be a great name.” Advertisement This was only nine years removed from the Commonwealth Games in Brisbane, which were still culturally resonant. The mascot had, obviously, taken its name from Waltzing Matilda , Banjo Paterson’s 1895 bush ballad, widely regarded as Australia’s unofficial national anthem – but Young is a bit miffed that people these days, including some of her former teammates, assume the name was directly inspired by the song. “It actually was sung on the team bus,” said Moya Dodd, who played 24 times for Australia before becoming a leading football executive. Prior to being interviewed for this story, she was unaware of Young’s involvement or the mascot link. Sharon Young, the former Matildas player who came up with the idea for their nickname. Credit: Peter Stoop “With a few adjustments to the words, as I recall. Something like: ‘ Waltzing Matilda, we’re gonna kill you .’ I think all Australians have a connection with the song. People from overseas have said, ‘Why are you called the Matildas?’. And I’d say, ‘Well, there’s this song about a guy who stole a sheep and was running away from the English, and would rather die than get captured by the English overlords.’ And they’re like, ‘Oh.’ “I think it did capture a sense of rebelliousness, if you like, which is women’s football. It was banned for a long time. To be a woman playing football was a social transgression. In a way, it identifies well with a song about a guy who’s defying authority by stealing things, and then making sure he doesn’t get caught.” But Australia ultimately failed to qualify for the 1991 World Cup, and the push for an official nickname ended there – shoved back “under the covers”, as Young put it, as her time with the national team also wound to an end. “We obviously didn’t have the money like they had now. There was always lamingtons all over the house, trying to sell them, all different raffles to try and get me overseas. The disappointment of not making the first-ever Women’s World Cup, and actually go overseas, was a really big thing for me,” she said. Advertisement “You work so hard, and you get to that level ... I went through nationals with a broken toe to get into that team. It really affected me. I continued to play soccer at the state level, and I got in the Australian side again, but my heart wasn’t there, so I ended up retiring.“ Young went on to forge a distinguished career playing indoor soccer. But by far her biggest legacy was coming up with the “Matildas” name , which was now out there in the ether, and would soon take on a life of its own. A ‘transformational’ moment The trajectory of the women’s game in Australia changed dramatically through two seismic decisions made in September 1993. The first was when the International Olympic Committee agreed to include women’s football for the first time at the Atlanta 1996 Games. Juan Antonio Samaranch at the Sydney Olympics. Credit: Getty Images The second was when Juan Antonio Samaranch stood up at the 101st session of the IOC in Monte Carlo , and said: “The winner is ... Sydney.” At the time, the Matildas had never competed at a major international tournament outside of Oceania. Now, as hosts, they could look forward to a guaranteed shot at Olympic glory on home soil at Sydney 2000. Advertisement With women’s football on the Olympic program and hosting rights secured, a previously unimaginable level of government support was suddenly available, waiting to be unlocked by the AWSA. Prior to joining the AWSA as their chief executive in 1994, administrator Peter Hugg was working at the Australian Sports Commission on the AOC’s “Gold Medal Program” – a government investment scheme to improve coaching, sports science, talent ID and high-performance programs across all Olympic sports so that, now that the Games were coming to Sydney, the host nation would win as many medals as possible. Hugg was able to apply that knowledge in his new role. Suddenly, the AWSA’s annual funding skyrocketed from a meagre $50,000 to $1.3 million. “It was transformational,” he said. It enabled them to sign a full-time national team coach – Tom Sermanni – for the first time. Six intensive training centres for women’s football were set up across the country, and each had their own full-time coaches, too. The women’s game was booming – or at least the national team set-up was, in comparison to years gone by. By winning the OFC Nations Cup in 1994, Australia qualified for the FIFA Women’s World Cup in Sweden the following year. Sermanni brought with him a full coaching panel, including an assistant, team manager, physio and a doctor. Tom Sermanni was the first full-time coach in Matildas history. Credit: Wolter Peeters Still, with the tournament fast approaching, women’s football remained almost invisible in Australia, and that simply had to change. “Very few people cared,” Hugg said. “Those who did care [were from] a completely different demographic group. They were super passionate, but it hadn’t broken through to the mainstream. The term ‘soccer mum’ hadn’t even been invented yet. It was very much a boys game played by some older women, with the occasional girl playing in a boys team.” One of the AWSA’s next hires was Sarah Groube, a fresh-faced university graduate who became their second full-time administrator, after Hugg, in 1995. “We didn’t find it that easy to get into the media,” Groube said. “The ABC was pretty good. You just had to pound the pavement though – we were literally ringing up Roy and HG on a Sunday to let them know what was happening in football, or trying to get on talkback. But no one was coming to us.” The AWSA was trying its best, and it was around this time that it began throwing all sorts of ideas at the wall to boost crowds, interest and broader visibility of the national team. One of them was a failed attempt to deploy M People’s 1993 hit Moving On Up as a team song. “We played it at matches,” Hugg said. “Some of the lyrics were ideal, and we thought, ‘this fits well’. But it was more about a relationship – girl meets boy, boy falls in love with girl, boy breaks up with girl, and then she leaves and she’s moving on up. It never caught on.” As the media continued to refer to the team as the Female Socceroos, they quickly realised their best option was to come up with a name, once and for all, in time for the 1995 World Cup. ‘I’m not saying it was rigged’ The AWSA was based in Canberra, inside ACT Sports House – a primary school building in the suburb of Hackett that was converted into offices for many local and national sporting bodies. Hugg, Groube and Sermanni were working in an old classroom, brainstorming names for the national team with chalk on a blackboard, next to hooks mounted on the walls where schoolchildren would hang their bags, chewing gum still stuck on the floors and windows. The old Hackett Primary School, which became ACT Sports House. Credit: Facebook Groube never liked the idea of naming the team after an animal or object. “We just felt that if you name the team after something that already exists – like you might hear on the news if they’re talking about the Opals, but if you’re not really listening closely ... is that the basketball team or are they talking about actual opals?” she said. After tossing up dozens of options, they kept coming back to one: Matilda. ”All the men’s teams – the Socceroos, Olyroos, Joeys – were about the kangaroo, so I guess what we were trying to find was the female version of the kangaroo,” Hugg said. They made the same link as Young had made to the 1982 Commonwealth Games mascot, albeit unaware she had floated it a few years prior. Hugg looked up the meaning of the name Matilda, which was of German origin. “It means ‘mighty in battle’, so it ticked that box,” he said. “We obviously had Waltzing Matilda , so it was a word that we were familiar with. Roald Dahl had written his book, Matilda , [published in 1988] about a girl with magical powers. And so these little snippets ... you sort of think, ‘This is getting a bit of legs to it. Let’s keep pushing this.’ “Sometimes you strike it lucky. It just fit. Nowadays, you would engage a strategist or an agency and some creative directors. It’s a lesson in that sometimes, the best ideas don’t cost any money.” Former AWSA chief executive Peter Hugg. Credit: Football NSW How this conversation leapt from the AWSA’s office to the studios of SBS and television screens across Australia isn’t entirely clear to anyone involved. Kyle Patterson, a presenter for On the Ball , SBS’s flagship football program that ran between 1984 and 2002, recalls a personal connection between Johnny Warren and Heather Reid, who at that stage was not officially involved with the AWSA but was working in Canberra for the Australian Sports Commission, and was always plugged into goings-on in women’s football. Warren lived there, too, and Reid said he would frequent ACT Sports House to catch up with friends working for other organisations, which led to “random” chats in the corridor – and while she reckons this might have been one of them, she cannot remember the team’s search for a name coming up in a specific conversation. Neither can Groube, although she was only a junior administrator, and said it may have happened above her head. “I like the idea of it,” she said. “It could have played out that way.” According to Patterson, Warren then brought it up during a production meeting. “He said, ‘You know what? It’s about time we pay some attention to the women’s game because they’re committed. They do it for nothing. They do it for love.’ In the end, we went to the women’s association and said, ‘We want to help. This will get a lot of conversations happening. Are you happy for us to run this poll?’” Patterson said. “They were great – they said ‘Yeah, we’re up for it.’ And they very quickly agreed that, within reason, they would accept the result as being the name. But we had to be very careful, because let’s be honest, it was a Sunday morning blokes’ show. We talked about the NSL [National Soccer League], it was pretty rough and ready.” Legendary Socceroo Johnny Warren had a hand in how the Matildas got their name. Credit: Antonin Cermak Groube said Warren was genuinely invested, and always supportive, like Patterson. But few others at the public broadcaster were. “Even SBS, the real shining light for football, was not super interested in women’s football. It was still extremely ... well, sexist, I’d say,” she said. “From time to time, we could get a bit of the novelty spotlight, and we had to keep using that throughout the 90s. That was what the competition was – it was, ‘Here we go, we might get some attention through running this competition.’ And it did. It got us some really great relationships built through SBS and some really great visibility.” On the Ball ’s involvement spanned over a couple of weeks. First, it put a call-out to viewers to send in their suggestions. Groube remembers a fax coming through from SBS with all the entries. “Man, I wish I had kept the fax – [this was] back in the day when it wasn’t even coming through on single pages, it was this roll of paper, and it just kept coming and coming,” she said. “I was in shock at how many entries there were ... Cockatoos, and all these animal names. We all just went, ‘Nope, we’re not gonna be named after something.’ I don’t know if [SBS] filtered some things out – I just remember reading some pretty tasteless ones, and going, ‘You’ve got to be kidding.’” Among the entries were the Galahs, and even – gulp – the Sheilas. “I mean, it’s wrong. It just wouldn’t have lasted,” Hugg said. From there, the AWSA narrowed it down to five names. There was the Waratahs, the NSW floral emblem, which was already in use by the state’s rugby union team, and would have been unpopular with players and fans from elsewhere. The Blue Flyers, which is the name for a female red kangaroo, but a bit too abstract. The Lorikeets, a rainbow-coloured parrot native to Australia, but potentially a bit too cute and cuddly for the sporting arena. The Soccertoos, somehow, survived to the final ballot. And then, the Matildas. Patterson read them out on air, encouraging viewers to dial into a 0055 number to cast their vote, at a cost of 25 cents per call. The SBS phone poll that led to the Matildas getting their name. Credit: SBS The final five names were, as Hugg explained, carefully selected. “You don’t run a competition unless you can influence the outcome,” he said. “I’m not saying it was rigged. But I’m saying it was skewed. And if you look at some of the names that it was up against ... you take the result that you want, and make all your other options not so attractive.” The Matildas won by a landslide. Sermanni distinctly remembers driving from Canberra to Sydney on a stormy day when he received a call from someone at SBS with the results, straining on his brick-sized mobile phone to hear the person on the other end as torrential rain pounded his car. “There was no other name that came close,” he said. “But to be honest, I wasn’t that fussed by it. I was like, ‘I’m not sure about this.’” ‘Girls need heroes too’ These days, it’s hard to imagine the Matildas being called anything else. According to subsequent newspaper reports, some players were apparently unhappy with the outcome, but nobody we spoke to could remember any sense of disquiet within the team, or any particular individuals at the source of it. “I have to admit, if there was concern or consternation or doubt, I never heard it,” Hugg said. “But this is before WhatsApp, chat groups, social media. They may come together at camps or whatever, there might have been some discussions, but there certainly wasn’t a player rebellion. It’s been so successful, it’d be a very game player to say, ‘I never liked it.’ “I would do it differently today. I have to confess, I don’t think we consulted the players as much as we probably should have.” Loading According to an independent study by Futures Sport and Entertainment , the Matildas are now Australia’s fourth-favourite national team and climbing. They have become a household name, internationally renowned, although precisely when they wormed their way into the public consciousness is up for debate – Reid suspects it wasn’t until players posed for a controversial nude calendar on the eve of the Sydney Olympics, which is a whole different story , and a textbook example of the sort of gimmicks they still had to resort to for coverage until very recently. In typical Australian style, the Matildas is now regularly shortened by fans and players to the Tillies. Other national sides like the Young Matildas (the under-20s) and ParaMatildas (the cerebral palsy team which was launched in 2022) have also borrowed their name. Young is thrilled her idea has aged so gracefully, and has to thank her father, George, for the fact her involvement became public knowledge. He blurted it out in a 2016 interview with a local newspaper in Laurieton. “He was just talking to a journalist there and says, ‘Oh, you know, my daughter, she came up with the Matildas name.’ She goes, ‘Well, that’s a good story.’ And I didn’t know anything about it until she rang me and started asking me all these questions,” she said. “I said, ‘Well, that’s right. I’m glad he remembered.’ Because I never said anything to anyone – you don’t think about all that stuff. But dad remembered. Unfortunately, he’s got dementia – I’m his carer, I look after him now. But he always sits up with me and watches Matildas games, he still loves the soccer, whatever it is, men’s or women’s. ”It’s great. You talk to anyone now, they know the Matildas. Once we have this World Cup here, then it’s really going to put it on the map and everybody’s going to be shocked at how many people are involved and how many people watch it. I’m so proud that it’s got that far and so proud to be a pioneer of that era were back in the day.” Matilda the mascot, from the 1982 Commonwealth Games, now lives at a fuel station in south-east Queensland. Credit: TripAdvisor As for Matilda the mascot? She’s had an itinerant life. Two years after the 1982 Commonwealth Games, she moved an hour down the road to the Gold Coast, where she sat at the entrance to the Wet ‘n’ Wild Water World (then known as Cade’s County Waterpark) – until 2009, when she was bought by Matilda Fuel Services, who put her up at a petrol station in Kybong, and then when that was demolished, another in Traveston, where she lives today. Hugg, meanwhile, is now based in Saudi Arabia, and still works in football, but travels the world when he can to watch the Matildas, and will be coming home to cheer them on at the World Cup. Loading “Tommy and myself and the board and others, we played only a small part. The Matildas name ... it’s because of what the players have made it,” he said. “It’s grown a life as a result of every player who has put on the shirt. I get a bit emotional because I’m very patriotic, and I love the team. “My daughter was born at the end of ’94, so she’s the same age as the name. When you become a father, and particularly of a daughter, you suddenly care about the world that she’s going to live in. I was a football administrator who wanted to provide a better world for my daughter. “Girls need heroes too. We wanted to create heroes out of these girls. What we wanted to do was exactly what’s happened. When you go to a Matildas match, and you see a six or seven or eight-year-old walking around with [Chloe] Logarzo or Kerr [on their back] or putting Hayley Raso’s ribbons in their hair – I mean, that has to be the ultimate, doesn’t it? “The girls are so wonderful, they are such a joy, and I love them all dearly.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-06-23 19:30:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka crush Oman by 10 wickets","link":"https://www.ft.lk/sports/Sri-Lanka-crush-Oman-by-10-wickets/23-749862","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Another gripping day of the ICC Men’s Cricket World Cup Qualifier saw Sri Lanka win big against Oman. Sri Lanka brushed off Oman yesterday in their Group B encounter at the Queens Sports Club in Bulawayo by registering a thumping 10-wicket victory. The result meant that they climbed to the summit of Group B and put themselves in a strong position to qualify for the Super Six stage of the tournament. Chasing a low total of 99, openers Dimuth Karunaratne and Pathum Nissanka barely broke a sweat, completing the task in 15 overs. Karunaratne was unbeaten on 61 while Nissanka scored 37* as Sri Lanka not only sealed a win but also bolstered their net run rate. Earlier, Sri Lanka skipper Dasun Shanaka called it right at the toss at the Queens Sports Club in Bulawayo and opted to bowl first. His call paid immediate dividends as Sri Lanka had a brilliant start with the ball, with their pacers breathing fire on the Oman batters. The pace of Lahiru Kumara and Kasun Rajitha was too much for the Oman top-order to handle, as they found themselves in massive trouble early on. Kashyap Prajapati was the first wicket to fall, as Kumara trapped him in front of the stumps. Aqib Ilyas followed suit, with Rajitha getting in on the act. Kumara was in no mood to stop as he sent Zeeshan Maqsood and Mohammad Nadeem packing in quick succession, as Oman found themselves reeling at 20/4. Ayaan Khan and Jatinder Singh then embarked on a rebuild job for Oman, putting together a 52-run stand. But it all changed again in a blink of an eye for Oman, as Wanindu Hasaranga delivered one of the overs of the Qualifier so far. The 21st over by Hasaranga fetched him three wickets while also being a maiden. Hasaranga first trapped Jatinder Singh lbw for 21 in the first delivery. The third delivery then saw him bowl Shoaib Khan out. He completed the trifecta by getting Jay Odedra on the final delivery of the over. Oman then found themselves in further trouble as miscommunication between Ayaan Khan and Naseem Khushi led to the latter being run out for 1 after brilliant work in the deep from Rajitha. This left Oman reeling at 84/8 at the halfway mark. Ayaan’s gritty knock of 41 would then come to an end with Hasaranga scalping his fourth courtesy of a brilliant catch in the slips by Dhananjaya de Silva. Hasaranga would clinch his second consecutive five-wicket haul in the tournament, trapping Bilal Khan for zero, as Oman were bowled out for 98. Scotland clinched their second win in a row at the Qualifier, with their bowlers putting them in charge after a Richie Berrington master class of 127 off 136 balls. Scotland scored 282 for the loss of 8 wickets. UAE had a tall ask at hand but some brilliant bowling from the Scotland bowlers further set them back. Chris Sole got the ball rolling with two wickets in two deliveries in the fifth over, dismissing Aryansh Sharma (8) and Vritiya Aravind (0). Sole ended up with 3 for 37. The double strike left UAE reeling and they never quite recovered from the early blows. In the end, UAE were bowled out for 171. Safyaan Sharif took 4 for 20.","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Chamari to lead in Women’s ODI series","link":"https://www.ft.lk/sports/Chamari-to-lead-in-Women-s-ODI-series/23-749860","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka has picked a 15-member squad with Chamari Athapaththu as Captain for the three-match Women’s ODI series against New Zealand to be played at Galle International Cricket Stadium on 27 and 30 June and 3 July. The matches will be part of the ICC Women’s Championship. Meanwhile, the New Zealand Women’s cricket team arrived in Sri Lanka for their first bilateral tour yesterday and travelled directly to Galle for the upcoming series. Chamari Athapaththu (Captain), Vishmi Gunaratne, Harshitha Samarawickrama, Nilakshi de Silva, Kavisha Dilhari, Anushka Sanjeewani, Oshadi Ranasinghe, Kawya Karvindi, Sugandika Kumari, Inoka Ranaweera, Udeshika Prabodhani, Hansima Karunaratne, Inoshi Fernando, Imesha Dulani, Hasini Perera.","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"ODI discard Mathews warms up for Tests with century","link":"https://www.ft.lk/sports/ODI-discard-Mathews-warms-up-for-Tests-with-century/23-749861","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Former Sri Lanka Captain Angelo Mathews, overlooked for the World Cup Qualifiers, warmed up for next month’s two-Test series against Pakistan with a delightful century for Colts in their Major Club 3-day league match against Kandy Customs SC at Thurstan College grounds yesterday. Batting at his customary position at four Mathews held the Colts innings together scoring 124 off 193 balls (10 fours, 6 sixes) as they were dismissed for 263. All-rounder Dhananjaya Lakshan chipped in with a hard hit 69 off 99 balls (5 fours, 4 sixes) while the rest of the Colts batting was consumed by spinners Gayan Sirisoma, Yohan Suresh and Mithun Jayawickrama, all three of whom took three wickets apiece. Kandy Customs SC were 63-2 at stumps. Moors SC were in a commanding position at the end of the first day of their match when they shot out Kurunegala YCC for 90 and scored 240-5 in reply by the close to enjoy a first innings lead of 150 at Moors SC grounds. Invited to bat first Kurunegala YCC batsmen struggled against the seam of Milan Ratnayake (3/18) and Lahiru Samarakoon (3/24) with four batsmen being dismissed for a duck. Moors SC in their turn lost their first four wickets for 85 before Sohan de Livera (96 off 109 balls, 8 fours, 2 sixes) and Mohammad Shamaz (58* off 72 balls, 5 fours, 1 six) rescued them with a 101-run stand. Ragama CC boosted by Sanjaya Chaturanga’s second first-class century (102 off 164 balls, 9 fours, 4 sixes) and a fine half-century from Janith Liyanage (76 off 114 balls, 3 fours, 5 sixes) scored 305 against BRC who ended the day at 10-0 at BRC grounds. Pacie Mohammad Shiraz and veteran spinner Dilruwan Perera took three wickets apiece for BRC. Half-centuries from national cricketers Kusal Perera (62 off 117 balls, 2 fours, 2 sixes) who is leading Police SC this season and Ashen Bandara (74* off 120 balls, 6 fours) and, Gitansh Khera, overseas player from India (68 off 98 balls, 6 fours, 1 six), saw them reach 310-6 against NCC at the NCC grounds. Seamers Chamika Gunasekara and Nipun Ransika took five of the wickets between them. Chilaw Marians CC spinners Lasith Lakshan (4/53) and Pulina Tharanga (3/62) helped dismiss Air Force SC for 242 at Air Force grounds, Katunayake. Opener Sahil Dias not only missed out on a century by six runs but also failed to carry his bat out when he was the last batsman dismissed for 94 off 236 balls (10 fours). Chilaw Marians CC were 1-0 at stumps. Fast bowlers Nisala Tharaka (5/58) and Kalana Perera (3/45) combined to bowl out Galle CC for 244 of which Ruwantha Kellepotha made a determined 87* off 157 balls (9 fours) to lift the team from 73-5 at one stage. Hosts SSC had replied with 33-1 by the close. In a low scoring game at Surrey Village grounds, Maggona, Sebastianites struggled to 85-7 by the close after dismissing Badureliya CC for 137. Bowlers held sway in this game where 17 wickets fell on the first day. Left-arm seamer Mohamed Dilshad took 5/47 for Sebastianites, and spinners Parvez Rasool (4/36), Indian overseas player and Chanaka Komasaru (3/49) were successful for Badureliya CC. In a delayed start at Panagoda due to wet ground conditions Army SC dismissed Nugegoda SWC for 149 with off-spinner Shehada Zoysa returning career best figures of 6/46 in his seventh first-class game. Hasitha Boyagoda’s solid knock of 93 off 205 balls (8 fours, 2 sixes) and contributions of 47 and 44 from Sandun Weerakkody and skipper Nipun Karunanayake saw Bloomfield invited to bat first by Ace Capital CC at Bloomfield grounds score 304. Off-spinner Roshan Jayatissa had figures of 7/70 – his 15th five-fer in first-class cricket. Ace Capital CC were 12-0 at close. Negombo CC deciding to bat first after winning the toss were 177-4 against Panadura SC at Panadura. The start was delayed by rain and only 50 overs were possible for the day. Left-hander Dimuth Sandaruwan held the batting together with a career best 87* off 112 balls (9 fours, 3 sixes).","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"England roll the dice with teen leg-spinner for crucial Lord’s Test","link":"https://www.theage.com.au/sport/cricket/england-roll-the-dice-with-teen-leg-spinner-for-crucial-lord-s-test-20230624-p5dj45.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"England have called 18-year-old leg-spinner Rehan Ahmed into their squad as cover for the injured Moeen Ali ahead of the second Test at Lord’s, but history is against him.","content":"England’s decision to call up 18-year-old leg-spinner Rehan Ahmed as cover for injured veteran Moeen Ali could be made redundant, with the Lord’s pitch expected to again favour seam bowlers. Jamie Cox, the former prolific Tasmania opening batsman and head of cricket and operations at the Marylebone Cricket Club, which owns Lord’s, said faster bowlers had claimed most of the wickets in county matches at the historic ground this season. “I can only talk of the cricket I’ve watched here and most recently it doesn’t spin a lot,” Cox told this masthead. “If you get a nice dry Test, it will certainly spin as the game progresses, but it’s not the surface in England that I would associate the most with the ball spinning out of big footmarks. I would guess that seam would do most of the damage here.” Seamers have dominated Test matches at Lord’s since Australia’s last Ashes tour in 2019, making up the top 11 most successful bowlers at the ground in that time, taking a total of 120 wickets. The two leading bowlers are Jimmy Anderson and Stuart Broad, with 14 wickets each in four Tests. The leading spinner is Jack Leach, with five wickets in three Tests, and he has been ruled out of the Ashes series with a back injury. The next best spinner is Moeen, with three wickets in one Test at an average of 46. England have called in young leg-spinner Rehan Ahmed for the Lord’s Test squad. Credit: Getty Having made a shock return after retiring from Test cricket almost two years ago, Moeen was in no condition for long-form cricket in the first Test at Edgbaston, suffering a gash in his spinning finger from the extra wear and tear of bowling 33 overs in Australia’s first innings. He managed just 14 overs in the second innings when England needed him to bowl on the drying pitch on the last day. Australia won the Test by two wickets in dramatic circumstances as Pat Cummins and Nathan Lyon put on 55 runs for the eighth wicket to get the visitors home. For all the talk about England’s ultra-aggressive Bazball approach, there are serious questions about their planning. While Ahmed was listed as a sub for Leach and then Moeen, his inclusion in the England squad is based largely on hope. He made an impressive debut in Pakistan in December, claiming seven wickets in his only Test, and he has played all three forms on the subcontinent for his country. However, in county cricket his batting has been more productive than his bowling. Playing for Leicestershire in Division Two of the county championship, he has taken just six wickets at 67.7 this season, but has scored four half-centuries. England appear to have no clear plan for their back-up spinners, calling Moeen out of retirement on the back of a one-word text from captain Ben Stokes that read, “Ashes?”, which Moeen originally thought was a joke. He has suffered the same overuse finger injury that hindered him during the 2017-18 Ashes tour of Australia. England are likely to recall express bowler Mark Wood for the second Test. The original theory was that he would replace Anderson, who was below his best at Edgbaston. However, given the Moeen injury, Ahmed’s lack of development and the inability of Stokes to bowl many overs because of a chronic knee injury, England could play four seamers and use Joe Root as their spinner at Lord’s. Root bowled well at Edgbaston until Australia captain Pat Cummins hit him for two sixes in three balls, setting the visitors on a course for a most unlikely victory. Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now.","pubDate":"2023-06-24 00:25:37","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Green the answer to Australia's 18-year Ashes search","link":"https://www.perthnow.com.au/sport/cricket/green-the-answer-to-australias-18-year-ashes-search-c-11075078","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cameron Green has outperformed Ben Stokes in the past two years of Test cricket, presenting himself as the answer to Australia's longest Ashes conundrum.","content":"Cameron Green's value to Australia in the Ashes has been laid bare with data showing how England have drastically benefited in the allrounder space over the past 18 years. Green is certain to play a crucial role in Australia's bid to win their first Ashes series in England since 2001, after healthy contributions in the two-wicket win at Edgbaston. Australia have been left searching for an allrounder of quality with both bat and ball since Andrew Flintoff's brilliant 2005 Ashes where he scored 402 runs and took 24 wickets. After Flintoff came Stokes, with England's lionheart keeping them in the 2019 series with both the bat and ball. From the 2005 Ashes through to the 2019 series in England, the hosts' allrounders have taken 54 wickets in 20 Tests and averaged 37.48 with the bat. Australia's returns have not been as joyful with 23 wickets in 13 Tests and a batting average of 33.64. But in Green, Australia can believe they have the answer. While Stokes' knee injury has left the England captain admitting he will be happy if he is still bowling by the fourth Test, Australia plan to increase Green's workload as the series goes on. Green has also averaged better than Stokes with both bat and ball in the past two years, while becoming the game's best fielder in the gully. \"Cameron Green ... we've been missing the allrounder since probably Keith Miller,\" Steve Waugh, who remains Australia's last captain to win a series in England, said earlier this month. \"He is probably the next best since him ... potentially. That just gives you the extra element to the team. \"When I was captain, my great allrounder was Adam Gilchrist. Now we've got Cameron Green.\" In the IPL this year, Mumbai Indians made a $3.15 million investment in Green and got returns of 452 runs at a strike-rate of 160.28 along with six wickets. Australia also made a call to make a long-term investment in Green two-and-a-half years ago, making clear they were going to give him time to develop as a No.6. In this Ashes, it's likely they could get their biggest reward yet if Green continues his form. \"He's fantastic, Greeny,\" Pat Cummins said. \"You've seen Ben Stokes, what he's done with England over the years, having that key allrounder who's in your top six can make a big difference at times. \"We're backing him in, he's still young but with each game he seems to be growing.\" GREEN V STOKES IN PAST TWO YEARS CAMERON GREEN Tests: 18 Runs: 802 Batting average: 36.45 Wickets: 26 Bowling average: 29.69 Catches: 18 BEN STOKES: Tests: 22 Runs: 1125 Batting average: 31.25 Wickets: 33 Bowling average: 35.03 Catches: 16","pubDate":"2023-06-24 00:02:10","image_url":"https://images.perthnow.com.au/publication/C-11075078/ff617203e66ff3af4f8d16e7805dc8ad945e910a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rumble in Harare…Windies, Chevrons in pivotal showdown","link":"https://www.chronicle.co.zw/rumble-in-harare-windies-chevrons-in-pivotal-showdown/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com IN what promises to be a thriller, the Windies and Zimbabwe will battle it out today at Harare Sports Club in a top-of-the-table clash in the 2023 Men’s Cricket World Cup Qualifiers. With a rich history between them, the Windies may feel confident, given their dominance in previous encounters. However, the Chevrons have […]","content":"The Chronicle IN what promises to be a thriller, the Windies and Zimbabwe will battle it out today at Harare Sports Club in a top-of-the-table clash in the 2023 Men’s Cricket World Cup Qualifiers. With a rich history between them, the Windies may feel confident, given their dominance in previous encounters. However, the Chevrons have shown tremendous form in the tournament, making this match a potential game-changer. With 48 matches played between them, the Windies hold the upper hand with 36 victories, while the Chevrons have managed only 10 wins against their opponents. Two matches have resulted in ties or inconclusive outcomes. Nonetheless, Zimbabwe have displayed impressive performances recently, winning their last two matches in a row. Playing on their home ground, Harare Sports Club, under the guidance of their legendary coach Dave Houghton, the Chevrons are buoyed by the support of their passionate fans, who have become their 12th man. Zimbabwe’s resurgence and the positive impact of Houghton’s leadership in the team’s dynamics will be crucial in their quest for victory against the formidable Windies. Following the Chevrons’ triumph over the Netherlands, Sikandar Raza, the history-making all-rounder, acknowledged Houghton’s transformative influence. “Dave has brought this culture, this mindset in the change room that unfortunately we were missing. We were on the verge of losing a culture, and lucky for all of us that we found Dave Houghton at the right time . . . he has brought everything that Zimbabwe was missing,” said Raza. Reflecting on their previous encounter in 2018, where Zimbabwe suffered a defeat that cost them a place in the World Cup, the Chevrons are determined to leave those memories behind. Brimming with confidence and rediscovering their winning formula, Zimbabwe relies heavily on the experience and skill of three senior players — Raza, Sean Williams, and skipper Craig Ervine. This trio’s exceptional form in the team’s opening matches will be vital against Darren Sammy’s Windies. During the tournament opener, Williams and Ervine each scored centuries, propelling Zimbabwe to an emphatic eight-wicket victory over Nepal. Their partnership of over 150 runs for the third wicket proved instrumental in securing the win. Ervine, in particular, showcased his prowess by achieving his third consecutive century in 50-over cricket, ending with an unbeaten 121 runs off 128 balls. Williams, on the other hand, etched his name in the record books by notching up the fastest century in ODI history for Zimbabwe, reaching the milestone in just 70 deliveries. In the subsequent match against the Netherlands, Zimbabwe continued their winning streak with a comfortable six-wicket triumph. Raza took centre stage this time, breaking records left and right. He achieved the fastest century for Zimbabwe, reaching the milestone in a mere 54 balls, surpassing Williams’ record. Remarkably, at 37, Raza became the oldest player in ODI history to take four wickets and score a century, surpassing the esteemed names of Sir Vivian Richards, Mohammad Hafeez, Tillakaratne Dilshan, and Sanath Jayasuriya. Williams and Ervine also contributed with half-centuries, scoring 50 and 91 runs, respectively. However, facing the powerful Windies side with their arsenal of big hitters, Zimbabwe’s bowlers, led by Tendai Chatara, must find their rhythm and deliver impactful performances. While the script has unfolded favourably for the Zimbabwean side thus far in the World Cup Qualifiers, a tough task lies ahead as they prepare to face the Windies, who are also flexing their muscles in the tournament. The Windies boast two of the most high-profile batters in Shai Hope and Nicholas Pooran, both of whom showcased their prowess by scoring centuries in their resounding 101-run victory over Nepal. Zimbabwe recognises the challenge and understands the importance of devising a plan to neutralise these formidable opponents. “We are thinking about the West Indies and we are also thinking about every other game as well, to be honest,” revealed Raza, emphasising the team’s focus on the upcoming clash. The outcome of this crucial encounter will determine the leader of Group A, adding an extra layer of significance to the match. With the stakes at their highest, the players from both teams are primed to deliver an enthralling contest for the spectators. The match is scheduled to commence at 09:00hrs, setting the stage for a riveting showdown between the Windies and the Chevrons as they vie for victory and continue their quest for qualification in the 2023 Men’s Cricket World Cup.","pubDate":"2023-06-23 22:05:51","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Dan Mousley and Will Smeed inspire Birmingham Bears and Somerset to key wins","link":"https://www.independent.co.uk/sport/cricket/somerset-kent-glenn-maxwell-dan-lawrence-worcestershire-b2363326.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"The Bears will be in the Vitality Blast quarter-finals while Somerset secured a home tie.","content":"Dan Mousley shone with bat and ball as Birmingham Bears clinched a Vitality Blast quarter-final spot with a convincing 53-run win over rivals Worcestershire on Friday. Mousley hit 51 in his side’s imposing 228 for four and then took four for 41 as the Rapids were restricted to 175 for nine by the North Group leaders. Rob Yates also scored 59 for the Bears and Glenn Maxwell added 44 from 20 deliveries while Mitchell Santner top-scored for the visitors with 56. South Group leaders Somerset secured a home quarter-final with a tight four-wicket win over Gloucestershire at Taunton. The hosts made a fine start as they reduced Gloucestershire to nine for three but Grant Roelofsen’s 52 and an unbeaten 42 from Jack Taylor helped the visitors post a competitive 186 for eight. Will Smeed cracked 78 from 42 balls in reply but it took further contributions from Ben Green (37), Kasey Aldridge (32no) and Craig Overton (17no) to ensure the job was completed with three balls to spare. Elsewhere, Daniel Bell-Drummond smashed a century and Grant Stewart took a hat-trick as Kent claimed a crushing 55-run win over Middlesex. Bell-Drummond hit 12 fours and four sixes in a 58-ball 111 and shared in a 127-run opening stand with Tawanda Muyeye (50) as Kent ran up 228 for three. Middlesex were bowled out for 173 in 19 overs in reply as George Linde, Joey Evison and Stewart each took three wickets. England white-ball captain Jos Buttler hit a 39-ball 83 with six sixes and eight fours as Lancashire beat Derbyshire by 27 runs in a rain-affected match at Old Trafford. Liam Livingstone added an unbeaten 47 as the Lightning made 177 for four from their reduced allocation of 15 overs. Derbyshire could muster just 150 for seven in response. Chris Lynn (62) and Saif Zaib (55) hit half-centuries as Northamptonshire powered to an emphatic 92-run win over the North Group’s bottom side Leicestershire. The pair put on 114 for the third wicket to help the Steelbacks to 210 for seven. The Foxes then crumbled to 118 all out despite 49 from England squad member Rehan Ahmed. Ben Sanderson was the pick of the bowling with three for 20 as the Steelbacks kept themselves in the quarter-final picture. Shadab Khan struck 87 from 53 balls as Sussex beat Glamorgan by 20 runs. The Pakistan all-rounder hit five fours and five sixes in his side’s 182 for six at Cardiff. Cam Fletcher top-scored with 57 in reply and Sam Northeast weighed in with 44 but Glamorgan fell short after Brad Currie and Tymal Mills took two wickets apiece. Hampshire beat Essex by four wickets by four wickets after 76 from captain James Vince in a close finish in Southampton. James Fuller also scored 56 but Benny Howell’s 36no and a late flurry from Liam Dawson were also needed for the hosts to reach their target of 210 in the last over. Dan Lawrence (70) and Feroze Khushi (61) were the mainstays of Essex’s 209 for seven after putting on 127 for the first wicket. The encounter between Durham and Yorkshire at the Riverside was declared a no result after rain intervened. Yorkshire were 49 for one after 8.1 overs when play was abandoned.","pubDate":"2023-06-23 21:44:48","image_url":"https://static.independent.co.uk/2023/06/23/22/c52d7d250101124463efa5a0cf2bb123Y29udGVudHNlYXJjaGFwaSwxNjg3NjQxODg5-2.67781944.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Virat Kohli, Rinku Singh, Guru Randhawa and other celebrities congratulate Suresh Raina for opening new restaurant in Amsterdam","link":"https://www.sportskeeda.com/cricket/news-virat-kohli-rinku-singh-guru-randhawa-celebrities-congratulate-suresh-raina-opening-new-restaurant-amsterdam","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Former Indian cricketer Suresh Raina recently opened his new restaurant, 'Raina Indian Restaurant', in Amsterdam, Netherlands. The former Indian cricketer aims to provide the taste of Indian dishes to residents of the famous European city. The 2011 World Cup winner posted four photos on Instagram earlier on Friday to announce the opening of his new restaurant. The tagline of Raina Indian Restaurant is ' Culinary Treasures of India '. Top names of the cricket world and Bollywood celebrities congratulated Suresh Raina on Instagram on his new venture. Here are some of the top reactions: Bollywood star Pulkit Samrat tagged Raina on his Instagram story and wrote: Popular music artist Guru Randhawa also congratulated Raina and wrote on his Instagram story. Kolkata Knight Riders star Rinku Singh , who idolized Raina as a cricketer, took to his Instagram to congratulate the former Indian cricketer as well. Raina's former India and Chennai Super Kings teammate Harbhajan Singh also dropped a comment on his Instagram post. Other top names who congratulated Raina in the comments box were Aly Goni, Kuldeep Yadav, Bobby Deol, Saina Nehwal, DJ Bravo, Deepak Chahar, Kiku Sharda, Piyush Chawla, Sneh Rana, Dhawal Kulkarni, Archana Vijaya, and Rahul Sharma. Instagram Post Priyanka Raina congratulated her husband with a long caption on Instagram. She posed with Suresh Raina in front of their restaurant in Amsterdam in a photo shared by her on the photo-sharing site. Priyanka labelled Suresh as an 'extraordinary' chef. She even invited her fans and followers to the Raina Indian Restaurant in Amsterdam. So far, the posts shared by Suresh and Priyanka have received over a million likes on Instagram. Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-06-23 21:15:35","image_url":"https://staticc.sportskeeda.com/editor/2023/06/9f58f-16875431684439-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Gayle Force: Cricket great Chris Gayle to throw opening pitch at Blue Jays game","link":"https://www.princegeorgecitizen.com/national-sports/gayle-force-cricket-great-chris-gayle-to-throw-opening-pitch-at-blue-jays-game-7189382","keywords":null,"creator":["John Chidley-Hill"," The Canadian Press"],"video_url":null,"description":"TORONTO — The Universe Boss is embracing his role as an ambassador for the sport of cricket. Chris Gayle will be throwing out the opening pitch at Rogers Centre on Saturday as the Toronto Blue Jays host the Oakland Athletics.","content":"TORONTO — The Universe Boss is embracing his role as an ambassador for the sport of cricket. Chris Gayle will be throwing out the opening pitch at Rogers Centre on Saturday as the Toronto Blue Jays host the Oakland Athletics. The 43-year-old Jamaican all-rounder said that as his playing days are winding down he wants to use his platform to help grow cricket, the sport he loves. \"It's good to have a sportsman from a different sport, both combining together, it's really good,\" said Gayle, sitting in the Blue Jays dugout at Rogers Centre and holding a baseball bat. \"That builds more of a relationship between the two sports. \"Baseball opens more doors for cricket and it's going to be a vice-versa when they see a cricketer is here at a baseball game. We will have the cricket eyes coming over to the baseball too.\" Gayle has set records in all three formats of cricket. He's the most capped player for the West Indies in international cricket. He's also the only player to have a triplet of centuries, with a triple hundred in Tests, a double hundred in one day international play and a hundred in Twenty20 play. Gayle is also the only player to score more than 14,000 runs and hit more than 1,000 sixes in Twenty20 cricket, the shortest format of the sport that has only 20 overs. He hopes that his appearance at Rogers Centre will get Toronto's large West Indian and South Asian communities out to a Blue Jays game and will also encourage baseball fans to check out cricket. \"The best place to start is by watching the Universe Boss. That's me,\" said Gayle, who is also goes by the nickname Gayle Force. \"That's where you want to say 'hey, this guy's very entertaining, let me go and check him out.' \"They're going to see a lot of history and say 'well, he's been pretty good, maybe I can watch a bit of cricket.'\" Gayle said he would take some practice throws before making the ceremonial first pitch on Saturday. Getting to throw twice, once a traditional baseball pitch and then a running cricket bowl, would be Gayle's preference to satisfy both sets of fans. \"I'd love to give them a proper bowling, but I want to do it properly,\" said Gayle, playing with a baseball in his hand. \"I wanted to do the proper pitch, so that's what I'm here to do. I'm going to deliver, as well. \"I also want to hit a home run. The baseball way, not the cricket way.\" Gayle will take batting practice with the Blue Jays on Saturday morning and then meet with Toronto's players before throwing out the opening pitch. Cricket-style Blue Jays jerseys will be given out to fans at the game. This report by The Canadian Press was first published June 23, 2023. John Chidley-Hill, The Canadian Press","pubDate":"2023-06-23 20:44:57","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/06/20230623150648-6495f7ad4cd7a037ea57cfd2jpeg.jpg;w=960","source_id":"princegeorgecitizen","category":["sports"],"country":["canada"],"language":"english"},{"title":"‘Sometimes you strike it lucky’: How a 25-cent phone poll gave the Matildas their name","link":"https://www.watoday.com.au/sport/soccer/sometimes-you-strike-it-lucky-how-a-25-cent-phone-poll-gave-the-matildas-their-name-20230517-p5d93q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Vince Rugari"],"video_url":null,"description":"The remarkable story of how the mascot from the 1982 Commonwealth Games inspired the Matildas’ nickname - after a public vote on a legendary SBS television show - is a mini-history of the evolution of the women’s game in Australia.","content":"Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For the duration of the FIFA Women’s World Cup, the Matildas will be based in Brisbane, and training at the Queensland Sport and Athletics Centre. It’s a fitting choice because the facility holds a special place in the team’s mythology. In the opening ceremony for the 1982 Commonwealth Games in Brisbane , a 13-metre tall, six-tonne animatronic kangaroo built on top of a forklift rolled around what was known, back then, as the QEII Stadium. Her name was Matilda. She could wriggle her ears, turn her head and open her “pouch”, out of which 20 kids dressed as joeys spilled for a trampoline display. Most memorably, she could blink her big, long eyelashes – and when she “winked” at Prince Philip, she became an instant Australian sporting icon, a symbol of the country’s cheeky irreverence and larrikin spirit. The famous ‘winking’ kangaroo named Matilda at the opening ceremony of the 1982 Brisbane Commonwealth Games. Credit: Vic Sumner Only in recent years has it emerged, via the ABC , that the person in charge of her eye movement apparatus smoked a joint just before the festivities began. You can draw a straight line from that extremely relaxed individual to the team that Sam Kerr will lead out onto Sydney’s Accor Stadium on July 20 for their opening match against Ireland – and it goes through four decades, seven FIFA World Cups, four famous words uttered by Juan Antonio Samaranch, an old classroom in Canberra, and a 25-cent phone poll on an iconic SBS television show helmed by Les Murray and Johnny Warren. The remarkable story of how that towering kangaroo inspired the team’s nickname has never been told in full. It is a mini-history of the evolution of the women’s game in Australia, and how a volunteer-run labour of love – fuelled by lamington drives, community raffles and an army of self-funded players – overcame widespread ignorance and indifference to cement the Matildas as a cultural phenomenon and uniting force, which is about to enjoy its crowning moment. Advertisement ‘Waltzing Matilda, we’re gonna kill you’ The Socceroos have been known by that name since 1972, when a publicity campaign for the team’s 1974 FIFA World Cup qualifiers coined the term “Socceroo”. It featured on a team logo unveiled by Sir Arthur George, the head of the Australian Soccer Federation, and was first deployed officially in plural form in a program for the visit of Scottish club Dundee United. With a push from Sydney journalist Tony Horstead, it quickly became widely used. But for 16 years, from their first senior international fixture in October 1979 against New Zealand, the Australian women’s team was known only as: Australia. That did not, however, stop others trying to come up with their own nicknames. A book co-authored by Matildas pioneer Heather Reid, Women in Boots: Football and Feminism in the 1970s , lists some of the cringeworthy names conjured up by the press over that period, including the “Soccerettes”, “Lady Socceroos”, “Soccerbelles”, and even the “Jillaroos”, which is today used by the national women’s rugby league team. One newspaper in New Zealand even called them the “Sexy Socceroos” during their 1980 tour. Until a government review triggered the creation of the Frank Lowy-led Australian Soccer Association (later renamed Football Federation Australia) in 2003, women’s football was run by an entirely separate organisation to the men: the Australian Women’s Soccer Association (AWSA), which formed in 1974. Advertisement Charged with fostering the growth of the women’s game and running the national team, the AWSA sat in the shadows of men’s soccer – which itself was in the shadows of more dominant codes like Aussie rules, rugby league and cricket. This was many years before football became a mainstream sport, when it was still largely driven by post-war ethnic migration, and when finding the scores from matches played in England or elsewhere usually meant waiting for newspapers to be delivered from overseas, days after they’d been played. Life on the margins meant the AWSA also had a miserly operating budget, which made national camps difficult to organise, let alone overseas fixtures. Players had to cover their own costs for airfares, uniforms and other fees, often resorting to fundraising efforts in pubs and clubs to find the money. When they did manage to play in another country, with no media coverage back home, they had to queue up at phone boxes to tell family and friends their results. Elaine Watson (left), the former president of the Australian Women’s Soccer Association. Credit: Football Australia In 1989, then-AWSA president Elaine Watson suggested the national team be called the “Soccertoos” – a portmanteau of “Cockatoos” with the idea that, yes, women play soccer too. The need for a formally recognised nickname was always obvious – not just for marketing reasons, but to stop the media from using silly, sometimes disrespectful alternatives, or derivatives of the Socceroos, which rubbed players the wrong way. It was an occasional topic of conversation within the national team’s dressing room and, during qualifying for the inaugural FIFA Women’s World Cup in 1991 , it came up again. “They asked us for suggestions,” said Sharon Young, who played four ‘A’ internationals for Australia and, as best as this masthead can tell, deserves to be credited as the first person to float the eventual nickname. “That’s when I said, ‘Well, what about Matilda? You know, the kangaroo that went around the stadium, the one that winked?’ I thought that’d be a great name.” Advertisement This was only nine years removed from the Commonwealth Games in Brisbane, which were still culturally resonant. The mascot had, obviously, taken its name from Waltzing Matilda , Banjo Paterson’s 1895 bush ballad, widely regarded as Australia’s unofficial national anthem – but Young is a bit miffed that people these days, including some of her former teammates, assume the name was directly inspired by the song. “It actually was sung on the team bus,” said Moya Dodd, who played 24 times for Australia before becoming a leading football executive. Prior to being interviewed for this story, she was unaware of Young’s involvement or the mascot link. Sharon Young, the former Matildas player who came up with the idea for their nickname. Credit: Peter Stoop “With a few adjustments to the words, as I recall. Something like: ‘ Waltzing Matilda, we’re gonna kill you .’ I think all Australians have a connection with the song. People from overseas have said, ‘Why are you called the Matildas?’. And I’d say, ‘Well, there’s this song about a guy who stole a sheep and was running away from the English, and would rather die than get captured by the English overlords.’ And they’re like, ‘Oh.’ “I think it did capture a sense of rebelliousness, if you like, which is women’s football. It was banned for a long time. To be a woman playing football was a social transgression. In a way, it identifies well with a song about a guy who’s defying authority by stealing things, and then making sure he doesn’t get caught.” But Australia ultimately failed to qualify for the 1991 World Cup, and the push for an official nickname ended there – shoved back “under the covers”, as Young put it, as her time with the national team also wound to an end. “We obviously didn’t have the money like they had now. There was always lamingtons all over the house, trying to sell them, all different raffles to try and get me overseas. The disappointment of not making the first-ever Women’s World Cup, and actually go overseas, was a really big thing for me,” she said. Advertisement “You work so hard, and you get to that level ... I went through nationals with a broken toe to get into that team. It really affected me. I continued to play soccer at the state level, and I got in the Australian side again, but my heart wasn’t there, so I ended up retiring.“ Young went on to forge a distinguished career playing indoor soccer. But by far her biggest legacy was coming up with the “Matildas” name , which was now out there in the ether, and would soon take on a life of its own. A ‘transformational’ moment The trajectory of the women’s game in Australia changed dramatically through two seismic decisions made in September 1993. The first was when the International Olympic Committee agreed to include women’s football for the first time at the Atlanta 1996 Games. Juan Antonio Samaranch at the Sydney Olympics. Credit: Getty Images The second was when Juan Antonio Samaranch stood up at the 101st session of the IOC in Monte Carlo , and said: “The winner is ... Sydney.” At the time, the Matildas had never competed at a major international tournament outside of Oceania. Now, as hosts, they could look forward to a guaranteed shot at Olympic glory on home soil at Sydney 2000. Advertisement With women’s football on the Olympic program and hosting rights secured, a previously unimaginable level of government support was suddenly available, waiting to be unlocked by the AWSA. Prior to joining the AWSA as their chief executive in 1994, administrator Peter Hugg was working at the Australian Sports Commission on the AOC’s “Gold Medal Program” – a government investment scheme to improve coaching, sports science, talent ID and high-performance programs across all Olympic sports so that, now that the Games were coming to Sydney, the host nation would win as many medals as possible. Hugg was able to apply that knowledge in his new role. Suddenly, the AWSA’s annual funding skyrocketed from a meagre $50,000 to $1.3 million. “It was transformational,” he said. It enabled them to sign a full-time national team coach – Tom Sermanni – for the first time. Six intensive training centres for women’s football were set up across the country, and each had their own full-time coaches, too. The women’s game was booming – or at least the national team set-up was, in comparison to years gone by. By winning the OFC Nations Cup in 1994, Australia qualified for the FIFA Women’s World Cup in Sweden the following year. Sermanni brought with him a full coaching panel, including an assistant, team manager, physio and a doctor. Tom Sermanni was the first full-time coach in Matildas history. Credit: Wolter Peeters Still, with the tournament fast approaching, women’s football remained almost invisible in Australia, and that simply had to change. “Very few people cared,” Hugg said. “Those who did care [were from] a completely different demographic group. They were super passionate, but it hadn’t broken through to the mainstream. The term ‘soccer mum’ hadn’t even been invented yet. It was very much a boys game played by some older women, with the occasional girl playing in a boys team.” One of the AWSA’s next hires was Sarah Groube, a fresh-faced university graduate who became their second full-time administrator, after Hugg, in 1995. “We didn’t find it that easy to get into the media,” Groube said. “The ABC was pretty good. You just had to pound the pavement though – we were literally ringing up Roy and HG on a Sunday to let them know what was happening in football, or trying to get on talkback. But no one was coming to us.” The AWSA was trying its best, and it was around this time that it began throwing all sorts of ideas at the wall to boost crowds, interest and broader visibility of the national team. One of them was a failed attempt to deploy M People’s 1993 hit Moving On Up as a team song. “We played it at matches,” Hugg said. “Some of the lyrics were ideal, and we thought, ‘this fits well’. But it was more about a relationship – girl meets boy, boy falls in love with girl, boy breaks up with girl, and then she leaves and she’s moving on up. It never caught on.” As the media continued to refer to the team as the Female Socceroos, they quickly realised their best option was to come up with a name, once and for all, in time for the 1995 World Cup. ‘I’m not saying it was rigged’ The AWSA was based in Canberra, inside ACT Sports House – a primary school building in the suburb of Hackett that was converted into offices for many local and national sporting bodies. Hugg, Groube and Sermanni were working in an old classroom, brainstorming names for the national team with chalk on a blackboard, next to hooks mounted on the walls where schoolchildren would hang their bags, chewing gum still stuck on the floors and windows. The old Hackett Primary School, which became ACT Sports House. Credit: Facebook Groube never liked the idea of naming the team after an animal or object. “We just felt that if you name the team after something that already exists – like you might hear on the news if they’re talking about the Opals, but if you’re not really listening closely ... is that the basketball team or are they talking about actual opals?” she said. After tossing up dozens of options, they kept coming back to one: Matilda. ”All the men’s teams – the Socceroos, Olyroos, Joeys – were about the kangaroo, so I guess what we were trying to find was the female version of the kangaroo,” Hugg said. They made the same link as Young had made to the 1982 Commonwealth Games mascot, albeit unaware she had floated it a few years prior. Hugg looked up the meaning of the name Matilda, which was of German origin. “It means ‘mighty in battle’, so it ticked that box,” he said. “We obviously had Waltzing Matilda , so it was a word that we were familiar with. Roald Dahl had written his book, Matilda , [published in 1988] about a girl with magical powers. And so these little snippets ... you sort of think, ‘This is getting a bit of legs to it. Let’s keep pushing this.’ “Sometimes you strike it lucky. It just fit. Nowadays, you would engage a strategist or an agency and some creative directors. It’s a lesson in that sometimes, the best ideas don’t cost any money.” Former AWSA chief executive Peter Hugg. Credit: Football NSW How this conversation leapt from the AWSA’s office to the studios of SBS and television screens across Australia isn’t entirely clear to anyone involved. Kyle Patterson, a presenter for On the Ball , SBS’s flagship football program that ran between 1984 and 2002, recalls a personal connection between Johnny Warren and Heather Reid, who at that stage was not officially involved with the AWSA but was working in Canberra for the Australian Sports Commission, and was always plugged into goings-on in women’s football. Warren lived there, too, and Reid said he would frequent ACT Sports House to catch up with friends working for other organisations, which led to “random” chats in the corridor – and while she reckons this might have been one of them, she cannot remember the team’s search for a name coming up in a specific conversation. Neither can Groube, although she was only a junior administrator, and said it may have happened above her head. “I like the idea of it,” she said. “It could have played out that way.” According to Patterson, Warren then brought it up during a production meeting. “He said, ‘You know what? It’s about time we pay some attention to the women’s game because they’re committed. They do it for nothing. They do it for love.’ In the end, we went to the women’s association and said, ‘We want to help. This will get a lot of conversations happening. Are you happy for us to run this poll?’” Patterson said. “They were great – they said ‘Yeah, we’re up for it.’ And they very quickly agreed that, within reason, they would accept the result as being the name. But we had to be very careful, because let’s be honest, it was a Sunday morning blokes’ show. We talked about the NSL [National Soccer League], it was pretty rough and ready.” Legendary Socceroo Johnny Warren had a hand in how the Matildas got their name. Credit: Antonin Cermak Groube said Warren was genuinely invested, and always supportive, like Patterson. But few others at the public broadcaster were. “Even SBS, the real shining light for football, was not super interested in women’s football. It was still extremely ... well, sexist, I’d say,” she said. “From time to time, we could get a bit of the novelty spotlight, and we had to keep using that throughout the 90s. That was what the competition was – it was, ‘Here we go, we might get some attention through running this competition.’ And it did. It got us some really great relationships built through SBS and some really great visibility.” On the Ball ’s involvement spanned over a couple of weeks. First, it put a call-out to viewers to send in their suggestions. Groube remembers a fax coming through from SBS with all the entries. “Man, I wish I had kept the fax – [this was] back in the day when it wasn’t even coming through on single pages, it was this roll of paper, and it just kept coming and coming,” she said. “I was in shock at how many entries there were ... Cockatoos, and all these animal names. We all just went, ‘Nope, we’re not gonna be named after something.’ I don’t know if [SBS] filtered some things out – I just remember reading some pretty tasteless ones, and going, ‘You’ve got to be kidding.’” Among the entries were the Galahs, and even – gulp – the Sheilas. “I mean, it’s wrong. It just wouldn’t have lasted,” Hugg said. From there, the AWSA narrowed it down to five names. There was the Waratahs, the NSW floral emblem, which was already in use by the state’s rugby union team, and would have been unpopular with players and fans from elsewhere. The Blue Flyers, which is the name for a female red kangaroo, but a bit too abstract. The Lorikeets, a rainbow-coloured parrot native to Australia, but potentially a bit too cute and cuddly for the sporting arena. The Soccertoos, somehow, survived to the final ballot. And then, the Matildas. Patterson read them out on air, encouraging viewers to dial into a 0055 number to cast their vote, at a cost of 25 cents per call. The SBS phone poll that led to the Matildas getting their name. Credit: SBS The final five names were, as Hugg explained, carefully selected. “You don’t run a competition unless you can influence the outcome,” he said. “I’m not saying it was rigged. But I’m saying it was skewed. And if you look at some of the names that it was up against ... you take the result that you want, and make all your other options not so attractive.” The Matildas won by a landslide. Sermanni distinctly remembers driving from Canberra to Sydney on a stormy day when he received a call from someone at SBS with the results, straining on his brick-sized mobile phone to hear the person on the other end as torrential rain pounded his car. “There was no other name that came close,” he said. “But to be honest, I wasn’t that fussed by it. I was like, ‘I’m not sure about this.’” ‘Girls need heroes too’ These days, it’s hard to imagine the Matildas being called anything else. According to subsequent newspaper reports, some players were apparently unhappy with the outcome, but nobody we spoke to could remember any sense of disquiet within the team, or any particular individuals at the source of it. “I have to admit, if there was concern or consternation or doubt, I never heard it,” Hugg said. “But this is before WhatsApp, chat groups, social media. They may come together at camps or whatever, there might have been some discussions, but there certainly wasn’t a player rebellion. It’s been so successful, it’d be a very game player to say, ‘I never liked it.’ “I would do it differently today. I have to confess, I don’t think we consulted the players as much as we probably should have.” Loading According to an independent study by Futures Sport and Entertainment , the Matildas are now Australia’s fourth-favourite national team and climbing. They have become a household name, internationally renowned, although precisely when they wormed their way into the public consciousness is up for debate – Reid suspects it wasn’t until players posed for a controversial nude calendar on the eve of the Sydney Olympics, which is a whole different story , and a textbook example of the sort of gimmicks they still had to resort to for coverage until very recently. In typical Australian style, the Matildas is now regularly shortened by fans and players to the Tillies. Other national sides like the Young Matildas (the under-20s) and ParaMatildas (the cerebral palsy team which was launched in 2022) have also borrowed their name. Young is thrilled her idea has aged so gracefully, and has to thank her father, George, for the fact her involvement became public knowledge. He blurted it out in a 2016 interview with a local newspaper in Laurieton. “He was just talking to a journalist there and says, ‘Oh, you know, my daughter, she came up with the Matildas name.’ She goes, ‘Well, that’s a good story.’ And I didn’t know anything about it until she rang me and started asking me all these questions,” she said. “I said, ‘Well, that’s right. I’m glad he remembered.’ Because I never said anything to anyone – you don’t think about all that stuff. But dad remembered. Unfortunately, he’s got dementia – I’m his carer, I look after him now. But he always sits up with me and watches Matildas games, he still loves the soccer, whatever it is, men’s or women’s. ”It’s great. You talk to anyone now, they know the Matildas. Once we have this World Cup here, then it’s really going to put it on the map and everybody’s going to be shocked at how many people are involved and how many people watch it. I’m so proud that it’s got that far and so proud to be a pioneer of that era were back in the day.” Matilda the mascot, from the 1982 Commonwealth Games, now lives at a fuel station in south-east Queensland. Credit: TripAdvisor As for Matilda the mascot? She’s had an itinerant life. Two years after the 1982 Commonwealth Games, she moved an hour down the road to the Gold Coast, where she sat at the entrance to the Wet ‘n’ Wild Water World (then known as Cade’s County Waterpark) – until 2009, when she was bought by Matilda Fuel Services, who put her up at a petrol station in Kybong, and then when that was demolished, another in Traveston, where she lives today. Hugg, meanwhile, is now based in Saudi Arabia, and still works in football, but travels the world when he can to watch the Matildas, and will be coming home to cheer them on at the World Cup. Loading “Tommy and myself and the board and others, we played only a small part. The Matildas name ... it’s because of what the players have made it,” he said. “It’s grown a life as a result of every player who has put on the shirt. I get a bit emotional because I’m very patriotic, and I love the team. “My daughter was born at the end of ’94, so she’s the same age as the name. When you become a father, and particularly of a daughter, you suddenly care about the world that she’s going to live in. I was a football administrator who wanted to provide a better world for my daughter. “Girls need heroes too. We wanted to create heroes out of these girls. What we wanted to do was exactly what’s happened. When you go to a Matildas match, and you see a six or seven or eight-year-old walking around with [Chloe] Logarzo or Kerr [on their back] or putting Hayley Raso’s ribbons in their hair – I mean, that has to be the ultimate, doesn’t it? “The girls are so wonderful, they are such a joy, and I love them all dearly.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-06-23 19:30:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka crush Oman by 10 wickets","link":"https://www.ft.lk/sports/Sri-Lanka-crush-Oman-by-10-wickets/23-749862","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Another gripping day of the ICC Men’s Cricket World Cup Qualifier saw Sri Lanka win big against Oman. Sri Lanka brushed off Oman yesterday in their Group B encounter at the Queens Sports Club in Bulawayo by registering a thumping 10-wicket victory. The result meant that they climbed to the summit of Group B and put themselves in a strong position to qualify for the Super Six stage of the tournament. Chasing a low total of 99, openers Dimuth Karunaratne and Pathum Nissanka barely broke a sweat, completing the task in 15 overs. Karunaratne was unbeaten on 61 while Nissanka scored 37* as Sri Lanka not only sealed a win but also bolstered their net run rate. Earlier, Sri Lanka skipper Dasun Shanaka called it right at the toss at the Queens Sports Club in Bulawayo and opted to bowl first. His call paid immediate dividends as Sri Lanka had a brilliant start with the ball, with their pacers breathing fire on the Oman batters. The pace of Lahiru Kumara and Kasun Rajitha was too much for the Oman top-order to handle, as they found themselves in massive trouble early on. Kashyap Prajapati was the first wicket to fall, as Kumara trapped him in front of the stumps. Aqib Ilyas followed suit, with Rajitha getting in on the act. Kumara was in no mood to stop as he sent Zeeshan Maqsood and Mohammad Nadeem packing in quick succession, as Oman found themselves reeling at 20/4. Ayaan Khan and Jatinder Singh then embarked on a rebuild job for Oman, putting together a 52-run stand. But it all changed again in a blink of an eye for Oman, as Wanindu Hasaranga delivered one of the overs of the Qualifier so far. The 21st over by Hasaranga fetched him three wickets while also being a maiden. Hasaranga first trapped Jatinder Singh lbw for 21 in the first delivery. The third delivery then saw him bowl Shoaib Khan out. He completed the trifecta by getting Jay Odedra on the final delivery of the over. Oman then found themselves in further trouble as miscommunication between Ayaan Khan and Naseem Khushi led to the latter being run out for 1 after brilliant work in the deep from Rajitha. This left Oman reeling at 84/8 at the halfway mark. Ayaan’s gritty knock of 41 would then come to an end with Hasaranga scalping his fourth courtesy of a brilliant catch in the slips by Dhananjaya de Silva. Hasaranga would clinch his second consecutive five-wicket haul in the tournament, trapping Bilal Khan for zero, as Oman were bowled out for 98. Scotland clinched their second win in a row at the Qualifier, with their bowlers putting them in charge after a Richie Berrington master class of 127 off 136 balls. Scotland scored 282 for the loss of 8 wickets. UAE had a tall ask at hand but some brilliant bowling from the Scotland bowlers further set them back. Chris Sole got the ball rolling with two wickets in two deliveries in the fifth over, dismissing Aryansh Sharma (8) and Vritiya Aravind (0). Sole ended up with 3 for 37. The double strike left UAE reeling and they never quite recovered from the early blows. In the end, UAE were bowled out for 171. Safyaan Sharif took 4 for 20.","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Chamari to lead in Women’s ODI series","link":"https://www.ft.lk/sports/Chamari-to-lead-in-Women-s-ODI-series/23-749860","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka has picked a 15-member squad with Chamari Athapaththu as Captain for the three-match Women’s ODI series against New Zealand to be played at Galle International Cricket Stadium on 27 and 30 June and 3 July. The matches will be part of the ICC Women’s Championship. Meanwhile, the New Zealand Women’s cricket team arrived in Sri Lanka for their first bilateral tour yesterday and travelled directly to Galle for the upcoming series. Chamari Athapaththu (Captain), Vishmi Gunaratne, Harshitha Samarawickrama, Nilakshi de Silva, Kavisha Dilhari, Anushka Sanjeewani, Oshadi Ranasinghe, Kawya Karvindi, Sugandika Kumari, Inoka Ranaweera, Udeshika Prabodhani, Hansima Karunaratne, Inoshi Fernando, Imesha Dulani, Hasini Perera.","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"ODI discard Mathews warms up for Tests with century","link":"https://www.ft.lk/sports/ODI-discard-Mathews-warms-up-for-Tests-with-century/23-749861","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Former Sri Lanka Captain Angelo Mathews, overlooked for the World Cup Qualifiers, warmed up for next month’s two-Test series against Pakistan with a delightful century for Colts in their Major Club 3-day league match against Kandy Customs SC at Thurstan College grounds yesterday. Batting at his customary position at four Mathews held the Colts innings together scoring 124 off 193 balls (10 fours, 6 sixes) as they were dismissed for 263. All-rounder Dhananjaya Lakshan chipped in with a hard hit 69 off 99 balls (5 fours, 4 sixes) while the rest of the Colts batting was consumed by spinners Gayan Sirisoma, Yohan Suresh and Mithun Jayawickrama, all three of whom took three wickets apiece. Kandy Customs SC were 63-2 at stumps. Moors SC were in a commanding position at the end of the first day of their match when they shot out Kurunegala YCC for 90 and scored 240-5 in reply by the close to enjoy a first innings lead of 150 at Moors SC grounds. Invited to bat first Kurunegala YCC batsmen struggled against the seam of Milan Ratnayake (3/18) and Lahiru Samarakoon (3/24) with four batsmen being dismissed for a duck. Moors SC in their turn lost their first four wickets for 85 before Sohan de Livera (96 off 109 balls, 8 fours, 2 sixes) and Mohammad Shamaz (58* off 72 balls, 5 fours, 1 six) rescued them with a 101-run stand. Ragama CC boosted by Sanjaya Chaturanga’s second first-class century (102 off 164 balls, 9 fours, 4 sixes) and a fine half-century from Janith Liyanage (76 off 114 balls, 3 fours, 5 sixes) scored 305 against BRC who ended the day at 10-0 at BRC grounds. Pacie Mohammad Shiraz and veteran spinner Dilruwan Perera took three wickets apiece for BRC. Half-centuries from national cricketers Kusal Perera (62 off 117 balls, 2 fours, 2 sixes) who is leading Police SC this season and Ashen Bandara (74* off 120 balls, 6 fours) and, Gitansh Khera, overseas player from India (68 off 98 balls, 6 fours, 1 six), saw them reach 310-6 against NCC at the NCC grounds. Seamers Chamika Gunasekara and Nipun Ransika took five of the wickets between them. Chilaw Marians CC spinners Lasith Lakshan (4/53) and Pulina Tharanga (3/62) helped dismiss Air Force SC for 242 at Air Force grounds, Katunayake. Opener Sahil Dias not only missed out on a century by six runs but also failed to carry his bat out when he was the last batsman dismissed for 94 off 236 balls (10 fours). Chilaw Marians CC were 1-0 at stumps. Fast bowlers Nisala Tharaka (5/58) and Kalana Perera (3/45) combined to bowl out Galle CC for 244 of which Ruwantha Kellepotha made a determined 87* off 157 balls (9 fours) to lift the team from 73-5 at one stage. Hosts SSC had replied with 33-1 by the close. In a low scoring game at Surrey Village grounds, Maggona, Sebastianites struggled to 85-7 by the close after dismissing Badureliya CC for 137. Bowlers held sway in this game where 17 wickets fell on the first day. Left-arm seamer Mohamed Dilshad took 5/47 for Sebastianites, and spinners Parvez Rasool (4/36), Indian overseas player and Chanaka Komasaru (3/49) were successful for Badureliya CC. In a delayed start at Panagoda due to wet ground conditions Army SC dismissed Nugegoda SWC for 149 with off-spinner Shehada Zoysa returning career best figures of 6/46 in his seventh first-class game. Hasitha Boyagoda’s solid knock of 93 off 205 balls (8 fours, 2 sixes) and contributions of 47 and 44 from Sandun Weerakkody and skipper Nipun Karunanayake saw Bloomfield invited to bat first by Ace Capital CC at Bloomfield grounds score 304. Off-spinner Roshan Jayatissa had figures of 7/70 – his 15th five-fer in first-class cricket. Ace Capital CC were 12-0 at close. Negombo CC deciding to bat first after winning the toss were 177-4 against Panadura SC at Panadura. The start was delayed by rain and only 50 overs were possible for the day. Left-hander Dimuth Sandaruwan held the batting together with a career best 87* off 112 balls (9 fours, 3 sixes).","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"England roll the dice with teen leg-spinner for crucial Lord’s Test","link":"https://www.theage.com.au/sport/cricket/england-roll-the-dice-with-teen-leg-spinner-for-crucial-lord-s-test-20230624-p5dj45.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Malcolm Conn"],"video_url":null,"description":"England have called 18-year-old leg-spinner Rehan Ahmed into their squad as cover for the injured Moeen Ali ahead of the second Test at Lord’s, but history is against him.","content":"England’s decision to call up 18-year-old leg-spinner Rehan Ahmed as cover for injured veteran Moeen Ali could be made redundant, with the Lord’s pitch expected to again favour seam bowlers. Jamie Cox, the former prolific Tasmania opening batsman and head of cricket and operations at the Marylebone Cricket Club, which owns Lord’s, said faster bowlers had claimed most of the wickets in county matches at the historic ground this season. “I can only talk of the cricket I’ve watched here and most recently it doesn’t spin a lot,” Cox told this masthead. “If you get a nice dry Test, it will certainly spin as the game progresses, but it’s not the surface in England that I would associate the most with the ball spinning out of big footmarks. I would guess that seam would do most of the damage here.” Seamers have dominated Test matches at Lord’s since Australia’s last Ashes tour in 2019, making up the top 11 most successful bowlers at the ground in that time, taking a total of 120 wickets. The two leading bowlers are Jimmy Anderson and Stuart Broad, with 14 wickets each in four Tests. The leading spinner is Jack Leach, with five wickets in three Tests, and he has been ruled out of the Ashes series with a back injury. The next best spinner is Moeen, with three wickets in one Test at an average of 46. England have called in young leg-spinner Rehan Ahmed for the Lord’s Test squad. Credit: Getty Having made a shock return after retiring from Test cricket almost two years ago, Moeen was in no condition for long-form cricket in the first Test at Edgbaston, suffering a gash in his spinning finger from the extra wear and tear of bowling 33 overs in Australia’s first innings. He managed just 14 overs in the second innings when England needed him to bowl on the drying pitch on the last day. Australia won the Test by two wickets in dramatic circumstances as Pat Cummins and Nathan Lyon put on 55 runs for the eighth wicket to get the visitors home. For all the talk about England’s ultra-aggressive Bazball approach, there are serious questions about their planning. While Ahmed was listed as a sub for Leach and then Moeen, his inclusion in the England squad is based largely on hope. He made an impressive debut in Pakistan in December, claiming seven wickets in his only Test, and he has played all three forms on the subcontinent for his country. However, in county cricket his batting has been more productive than his bowling. Playing for Leicestershire in Division Two of the county championship, he has taken just six wickets at 67.7 this season, but has scored four half-centuries. England appear to have no clear plan for their back-up spinners, calling Moeen out of retirement on the back of a one-word text from captain Ben Stokes that read, “Ashes?”, which Moeen originally thought was a joke. He has suffered the same overuse finger injury that hindered him during the 2017-18 Ashes tour of Australia. England are likely to recall express bowler Mark Wood for the second Test. The original theory was that he would replace Anderson, who was below his best at Edgbaston. However, given the Moeen injury, Ahmed’s lack of development and the inability of Stokes to bowl many overs because of a chronic knee injury, England could play four seamers and use Joe Root as their spinner at Lord’s. Root bowled well at Edgbaston until Australia captain Pat Cummins hit him for two sixes in three balls, setting the visitors on a course for a most unlikely victory. Watch every ball of the 2023 Ashes series live and exclusive on Channel 9 and 9Now.","pubDate":"2023-06-24 00:25:37","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Green the answer to Australia's 18-year Ashes search","link":"https://www.perthnow.com.au/sport/cricket/green-the-answer-to-australias-18-year-ashes-search-c-11075078","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Cameron Green has outperformed Ben Stokes in the past two years of Test cricket, presenting himself as the answer to Australia's longest Ashes conundrum.","content":"Cameron Green's value to Australia in the Ashes has been laid bare with data showing how England have drastically benefited in the allrounder space over the past 18 years. Green is certain to play a crucial role in Australia's bid to win their first Ashes series in England since 2001, after healthy contributions in the two-wicket win at Edgbaston. Australia have been left searching for an allrounder of quality with both bat and ball since Andrew Flintoff's brilliant 2005 Ashes where he scored 402 runs and took 24 wickets. After Flintoff came Stokes, with England's lionheart keeping them in the 2019 series with both the bat and ball. From the 2005 Ashes through to the 2019 series in England, the hosts' allrounders have taken 54 wickets in 20 Tests and averaged 37.48 with the bat. Australia's returns have not been as joyful with 23 wickets in 13 Tests and a batting average of 33.64. But in Green, Australia can believe they have the answer. While Stokes' knee injury has left the England captain admitting he will be happy if he is still bowling by the fourth Test, Australia plan to increase Green's workload as the series goes on. Green has also averaged better than Stokes with both bat and ball in the past two years, while becoming the game's best fielder in the gully. \"Cameron Green ... we've been missing the allrounder since probably Keith Miller,\" Steve Waugh, who remains Australia's last captain to win a series in England, said earlier this month. \"He is probably the next best since him ... potentially. That just gives you the extra element to the team. \"When I was captain, my great allrounder was Adam Gilchrist. Now we've got Cameron Green.\" In the IPL this year, Mumbai Indians made a $3.15 million investment in Green and got returns of 452 runs at a strike-rate of 160.28 along with six wickets. Australia also made a call to make a long-term investment in Green two-and-a-half years ago, making clear they were going to give him time to develop as a No.6. In this Ashes, it's likely they could get their biggest reward yet if Green continues his form. \"He's fantastic, Greeny,\" Pat Cummins said. \"You've seen Ben Stokes, what he's done with England over the years, having that key allrounder who's in your top six can make a big difference at times. \"We're backing him in, he's still young but with each game he seems to be growing.\" GREEN V STOKES IN PAST TWO YEARS CAMERON GREEN Tests: 18 Runs: 802 Batting average: 36.45 Wickets: 26 Bowling average: 29.69 Catches: 18 BEN STOKES: Tests: 22 Runs: 1125 Batting average: 31.25 Wickets: 33 Bowling average: 35.03 Catches: 16","pubDate":"2023-06-24 00:02:10","image_url":"https://images.perthnow.com.au/publication/C-11075078/ff617203e66ff3af4f8d16e7805dc8ad945e910a-16x9-x0y0w1280h720.jpg","source_id":"perthnow","category":["sports"],"country":["australia"],"language":"english"},{"title":"Rumble in Harare…Windies, Chevrons in pivotal showdown","link":"https://www.chronicle.co.zw/rumble-in-harare-windies-chevrons-in-pivotal-showdown/","keywords":["Sport"],"creator":["Chronicle Editor"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com IN what promises to be a thriller, the Windies and Zimbabwe will battle it out today at Harare Sports Club in a top-of-the-table clash in the 2023 Men’s Cricket World Cup Qualifiers. With a rich history between them, the Windies may feel confident, given their dominance in previous encounters. However, the Chevrons have […]","content":"The Chronicle IN what promises to be a thriller, the Windies and Zimbabwe will battle it out today at Harare Sports Club in a top-of-the-table clash in the 2023 Men’s Cricket World Cup Qualifiers. With a rich history between them, the Windies may feel confident, given their dominance in previous encounters. However, the Chevrons have shown tremendous form in the tournament, making this match a potential game-changer. With 48 matches played between them, the Windies hold the upper hand with 36 victories, while the Chevrons have managed only 10 wins against their opponents. Two matches have resulted in ties or inconclusive outcomes. Nonetheless, Zimbabwe have displayed impressive performances recently, winning their last two matches in a row. Playing on their home ground, Harare Sports Club, under the guidance of their legendary coach Dave Houghton, the Chevrons are buoyed by the support of their passionate fans, who have become their 12th man. Zimbabwe’s resurgence and the positive impact of Houghton’s leadership in the team’s dynamics will be crucial in their quest for victory against the formidable Windies. Following the Chevrons’ triumph over the Netherlands, Sikandar Raza, the history-making all-rounder, acknowledged Houghton’s transformative influence. “Dave has brought this culture, this mindset in the change room that unfortunately we were missing. We were on the verge of losing a culture, and lucky for all of us that we found Dave Houghton at the right time . . . he has brought everything that Zimbabwe was missing,” said Raza. Reflecting on their previous encounter in 2018, where Zimbabwe suffered a defeat that cost them a place in the World Cup, the Chevrons are determined to leave those memories behind. Brimming with confidence and rediscovering their winning formula, Zimbabwe relies heavily on the experience and skill of three senior players — Raza, Sean Williams, and skipper Craig Ervine. This trio’s exceptional form in the team’s opening matches will be vital against Darren Sammy’s Windies. During the tournament opener, Williams and Ervine each scored centuries, propelling Zimbabwe to an emphatic eight-wicket victory over Nepal. Their partnership of over 150 runs for the third wicket proved instrumental in securing the win. Ervine, in particular, showcased his prowess by achieving his third consecutive century in 50-over cricket, ending with an unbeaten 121 runs off 128 balls. Williams, on the other hand, etched his name in the record books by notching up the fastest century in ODI history for Zimbabwe, reaching the milestone in just 70 deliveries. In the subsequent match against the Netherlands, Zimbabwe continued their winning streak with a comfortable six-wicket triumph. Raza took centre stage this time, breaking records left and right. He achieved the fastest century for Zimbabwe, reaching the milestone in a mere 54 balls, surpassing Williams’ record. Remarkably, at 37, Raza became the oldest player in ODI history to take four wickets and score a century, surpassing the esteemed names of Sir Vivian Richards, Mohammad Hafeez, Tillakaratne Dilshan, and Sanath Jayasuriya. Williams and Ervine also contributed with half-centuries, scoring 50 and 91 runs, respectively. However, facing the powerful Windies side with their arsenal of big hitters, Zimbabwe’s bowlers, led by Tendai Chatara, must find their rhythm and deliver impactful performances. While the script has unfolded favourably for the Zimbabwean side thus far in the World Cup Qualifiers, a tough task lies ahead as they prepare to face the Windies, who are also flexing their muscles in the tournament. The Windies boast two of the most high-profile batters in Shai Hope and Nicholas Pooran, both of whom showcased their prowess by scoring centuries in their resounding 101-run victory over Nepal. Zimbabwe recognises the challenge and understands the importance of devising a plan to neutralise these formidable opponents. “We are thinking about the West Indies and we are also thinking about every other game as well, to be honest,” revealed Raza, emphasising the team’s focus on the upcoming clash. The outcome of this crucial encounter will determine the leader of Group A, adding an extra layer of significance to the match. With the stakes at their highest, the players from both teams are primed to deliver an enthralling contest for the spectators. The match is scheduled to commence at 09:00hrs, setting the stage for a riveting showdown between the Windies and the Chevrons as they vie for victory and continue their quest for qualification in the 2023 Men’s Cricket World Cup.","pubDate":"2023-06-23 22:05:51","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Dan Mousley and Will Smeed inspire Birmingham Bears and Somerset to key wins","link":"https://www.independent.co.uk/sport/cricket/somerset-kent-glenn-maxwell-dan-lawrence-worcestershire-b2363326.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"The Bears will be in the Vitality Blast quarter-finals while Somerset secured a home tie.","content":"Dan Mousley shone with bat and ball as Birmingham Bears clinched a Vitality Blast quarter-final spot with a convincing 53-run win over rivals Worcestershire on Friday. Mousley hit 51 in his side’s imposing 228 for four and then took four for 41 as the Rapids were restricted to 175 for nine by the North Group leaders. Rob Yates also scored 59 for the Bears and Glenn Maxwell added 44 from 20 deliveries while Mitchell Santner top-scored for the visitors with 56. South Group leaders Somerset secured a home quarter-final with a tight four-wicket win over Gloucestershire at Taunton. The hosts made a fine start as they reduced Gloucestershire to nine for three but Grant Roelofsen’s 52 and an unbeaten 42 from Jack Taylor helped the visitors post a competitive 186 for eight. Will Smeed cracked 78 from 42 balls in reply but it took further contributions from Ben Green (37), Kasey Aldridge (32no) and Craig Overton (17no) to ensure the job was completed with three balls to spare. Elsewhere, Daniel Bell-Drummond smashed a century and Grant Stewart took a hat-trick as Kent claimed a crushing 55-run win over Middlesex. Bell-Drummond hit 12 fours and four sixes in a 58-ball 111 and shared in a 127-run opening stand with Tawanda Muyeye (50) as Kent ran up 228 for three. Middlesex were bowled out for 173 in 19 overs in reply as George Linde, Joey Evison and Stewart each took three wickets. England white-ball captain Jos Buttler hit a 39-ball 83 with six sixes and eight fours as Lancashire beat Derbyshire by 27 runs in a rain-affected match at Old Trafford. Liam Livingstone added an unbeaten 47 as the Lightning made 177 for four from their reduced allocation of 15 overs. Derbyshire could muster just 150 for seven in response. Chris Lynn (62) and Saif Zaib (55) hit half-centuries as Northamptonshire powered to an emphatic 92-run win over the North Group’s bottom side Leicestershire. The pair put on 114 for the third wicket to help the Steelbacks to 210 for seven. The Foxes then crumbled to 118 all out despite 49 from England squad member Rehan Ahmed. Ben Sanderson was the pick of the bowling with three for 20 as the Steelbacks kept themselves in the quarter-final picture. Shadab Khan struck 87 from 53 balls as Sussex beat Glamorgan by 20 runs. The Pakistan all-rounder hit five fours and five sixes in his side’s 182 for six at Cardiff. Cam Fletcher top-scored with 57 in reply and Sam Northeast weighed in with 44 but Glamorgan fell short after Brad Currie and Tymal Mills took two wickets apiece. Hampshire beat Essex by four wickets by four wickets after 76 from captain James Vince in a close finish in Southampton. James Fuller also scored 56 but Benny Howell’s 36no and a late flurry from Liam Dawson were also needed for the hosts to reach their target of 210 in the last over. Dan Lawrence (70) and Feroze Khushi (61) were the mainstays of Essex’s 209 for seven after putting on 127 for the first wicket. The encounter between Durham and Yorkshire at the Riverside was declared a no result after rain intervened. Yorkshire were 49 for one after 8.1 overs when play was abandoned.","pubDate":"2023-06-23 21:44:48","image_url":"https://static.independent.co.uk/2023/06/23/22/c52d7d250101124463efa5a0cf2bb123Y29udGVudHNlYXJjaGFwaSwxNjg3NjQxODg5-2.67781944.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Virat Kohli, Rinku Singh, Guru Randhawa and other celebrities congratulate Suresh Raina for opening new restaurant in Amsterdam","link":"https://www.sportskeeda.com/cricket/news-virat-kohli-rinku-singh-guru-randhawa-celebrities-congratulate-suresh-raina-opening-new-restaurant-amsterdam","keywords":["Cricket"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":"Former Indian cricketer Suresh Raina recently opened his new restaurant, 'Raina Indian Restaurant', in Amsterdam, Netherlands. The former Indian cricketer aims to provide the taste of Indian dishes to residents of the famous European city. The 2011 World Cup winner posted four photos on Instagram earlier on Friday to announce the opening of his new restaurant. The tagline of Raina Indian Restaurant is ' Culinary Treasures of India '. Top names of the cricket world and Bollywood celebrities congratulated Suresh Raina on Instagram on his new venture. Here are some of the top reactions: Bollywood star Pulkit Samrat tagged Raina on his Instagram story and wrote: Popular music artist Guru Randhawa also congratulated Raina and wrote on his Instagram story. Kolkata Knight Riders star Rinku Singh , who idolized Raina as a cricketer, took to his Instagram to congratulate the former Indian cricketer as well. Raina's former India and Chennai Super Kings teammate Harbhajan Singh also dropped a comment on his Instagram post. Other top names who congratulated Raina in the comments box were Aly Goni, Kuldeep Yadav, Bobby Deol, Saina Nehwal, DJ Bravo, Deepak Chahar, Kiku Sharda, Piyush Chawla, Sneh Rana, Dhawal Kulkarni, Archana Vijaya, and Rahul Sharma. Instagram Post Priyanka Raina congratulated her husband with a long caption on Instagram. She posed with Suresh Raina in front of their restaurant in Amsterdam in a photo shared by her on the photo-sharing site. Priyanka labelled Suresh as an 'extraordinary' chef. She even invited her fans and followers to the Raina Indian Restaurant in Amsterdam. So far, the posts shared by Suresh and Priyanka have received over a million likes on Instagram. Get IPL 2023 Live Score along with Points Table & Schedule Updates at Sportskeeda. Poll : 0 votes Quick Links","pubDate":"2023-06-23 21:15:35","image_url":"https://staticc.sportskeeda.com/editor/2023/06/9f58f-16875431684439-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Gayle Force: Cricket great Chris Gayle to throw opening pitch at Blue Jays game","link":"https://www.princegeorgecitizen.com/national-sports/gayle-force-cricket-great-chris-gayle-to-throw-opening-pitch-at-blue-jays-game-7189382","keywords":null,"creator":["John Chidley-Hill"," The Canadian Press"],"video_url":null,"description":"TORONTO — The Universe Boss is embracing his role as an ambassador for the sport of cricket. Chris Gayle will be throwing out the opening pitch at Rogers Centre on Saturday as the Toronto Blue Jays host the Oakland Athletics.","content":"TORONTO — The Universe Boss is embracing his role as an ambassador for the sport of cricket. Chris Gayle will be throwing out the opening pitch at Rogers Centre on Saturday as the Toronto Blue Jays host the Oakland Athletics. The 43-year-old Jamaican all-rounder said that as his playing days are winding down he wants to use his platform to help grow cricket, the sport he loves. \"It's good to have a sportsman from a different sport, both combining together, it's really good,\" said Gayle, sitting in the Blue Jays dugout at Rogers Centre and holding a baseball bat. \"That builds more of a relationship between the two sports. \"Baseball opens more doors for cricket and it's going to be a vice-versa when they see a cricketer is here at a baseball game. We will have the cricket eyes coming over to the baseball too.\" Gayle has set records in all three formats of cricket. He's the most capped player for the West Indies in international cricket. He's also the only player to have a triplet of centuries, with a triple hundred in Tests, a double hundred in one day international play and a hundred in Twenty20 play. Gayle is also the only player to score more than 14,000 runs and hit more than 1,000 sixes in Twenty20 cricket, the shortest format of the sport that has only 20 overs. He hopes that his appearance at Rogers Centre will get Toronto's large West Indian and South Asian communities out to a Blue Jays game and will also encourage baseball fans to check out cricket. \"The best place to start is by watching the Universe Boss. That's me,\" said Gayle, who is also goes by the nickname Gayle Force. \"That's where you want to say 'hey, this guy's very entertaining, let me go and check him out.' \"They're going to see a lot of history and say 'well, he's been pretty good, maybe I can watch a bit of cricket.'\" Gayle said he would take some practice throws before making the ceremonial first pitch on Saturday. Getting to throw twice, once a traditional baseball pitch and then a running cricket bowl, would be Gayle's preference to satisfy both sets of fans. \"I'd love to give them a proper bowling, but I want to do it properly,\" said Gayle, playing with a baseball in his hand. \"I wanted to do the proper pitch, so that's what I'm here to do. I'm going to deliver, as well. \"I also want to hit a home run. The baseball way, not the cricket way.\" Gayle will take batting practice with the Blue Jays on Saturday morning and then meet with Toronto's players before throwing out the opening pitch. Cricket-style Blue Jays jerseys will be given out to fans at the game. This report by The Canadian Press was first published June 23, 2023. John Chidley-Hill, The Canadian Press","pubDate":"2023-06-23 20:44:57","image_url":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/06/20230623150648-6495f7ad4cd7a037ea57cfd2jpeg.jpg;w=960","source_id":"princegeorgecitizen","category":["sports"],"country":["canada"],"language":"english"},{"title":"‘Sometimes you strike it lucky’: How a 25-cent phone poll gave the Matildas their name","link":"https://www.watoday.com.au/sport/soccer/sometimes-you-strike-it-lucky-how-a-25-cent-phone-poll-gave-the-matildas-their-name-20230517-p5d93q.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Vince Rugari"],"video_url":null,"description":"The remarkable story of how the mascot from the 1982 Commonwealth Games inspired the Matildas’ nickname - after a public vote on a legendary SBS television show - is a mini-history of the evolution of the women’s game in Australia.","content":"Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For the duration of the FIFA Women’s World Cup, the Matildas will be based in Brisbane, and training at the Queensland Sport and Athletics Centre. It’s a fitting choice because the facility holds a special place in the team’s mythology. In the opening ceremony for the 1982 Commonwealth Games in Brisbane , a 13-metre tall, six-tonne animatronic kangaroo built on top of a forklift rolled around what was known, back then, as the QEII Stadium. Her name was Matilda. She could wriggle her ears, turn her head and open her “pouch”, out of which 20 kids dressed as joeys spilled for a trampoline display. Most memorably, she could blink her big, long eyelashes – and when she “winked” at Prince Philip, she became an instant Australian sporting icon, a symbol of the country’s cheeky irreverence and larrikin spirit. The famous ‘winking’ kangaroo named Matilda at the opening ceremony of the 1982 Brisbane Commonwealth Games. Credit: Vic Sumner Only in recent years has it emerged, via the ABC , that the person in charge of her eye movement apparatus smoked a joint just before the festivities began. You can draw a straight line from that extremely relaxed individual to the team that Sam Kerr will lead out onto Sydney’s Accor Stadium on July 20 for their opening match against Ireland – and it goes through four decades, seven FIFA World Cups, four famous words uttered by Juan Antonio Samaranch, an old classroom in Canberra, and a 25-cent phone poll on an iconic SBS television show helmed by Les Murray and Johnny Warren. The remarkable story of how that towering kangaroo inspired the team’s nickname has never been told in full. It is a mini-history of the evolution of the women’s game in Australia, and how a volunteer-run labour of love – fuelled by lamington drives, community raffles and an army of self-funded players – overcame widespread ignorance and indifference to cement the Matildas as a cultural phenomenon and uniting force, which is about to enjoy its crowning moment. Advertisement ‘Waltzing Matilda, we’re gonna kill you’ The Socceroos have been known by that name since 1972, when a publicity campaign for the team’s 1974 FIFA World Cup qualifiers coined the term “Socceroo”. It featured on a team logo unveiled by Sir Arthur George, the head of the Australian Soccer Federation, and was first deployed officially in plural form in a program for the visit of Scottish club Dundee United. With a push from Sydney journalist Tony Horstead, it quickly became widely used. But for 16 years, from their first senior international fixture in October 1979 against New Zealand, the Australian women’s team was known only as: Australia. That did not, however, stop others trying to come up with their own nicknames. A book co-authored by Matildas pioneer Heather Reid, Women in Boots: Football and Feminism in the 1970s , lists some of the cringeworthy names conjured up by the press over that period, including the “Soccerettes”, “Lady Socceroos”, “Soccerbelles”, and even the “Jillaroos”, which is today used by the national women’s rugby league team. One newspaper in New Zealand even called them the “Sexy Socceroos” during their 1980 tour. Until a government review triggered the creation of the Frank Lowy-led Australian Soccer Association (later renamed Football Federation Australia) in 2003, women’s football was run by an entirely separate organisation to the men: the Australian Women’s Soccer Association (AWSA), which formed in 1974. Advertisement Charged with fostering the growth of the women’s game and running the national team, the AWSA sat in the shadows of men’s soccer – which itself was in the shadows of more dominant codes like Aussie rules, rugby league and cricket. This was many years before football became a mainstream sport, when it was still largely driven by post-war ethnic migration, and when finding the scores from matches played in England or elsewhere usually meant waiting for newspapers to be delivered from overseas, days after they’d been played. Life on the margins meant the AWSA also had a miserly operating budget, which made national camps difficult to organise, let alone overseas fixtures. Players had to cover their own costs for airfares, uniforms and other fees, often resorting to fundraising efforts in pubs and clubs to find the money. When they did manage to play in another country, with no media coverage back home, they had to queue up at phone boxes to tell family and friends their results. Elaine Watson (left), the former president of the Australian Women’s Soccer Association. Credit: Football Australia In 1989, then-AWSA president Elaine Watson suggested the national team be called the “Soccertoos” – a portmanteau of “Cockatoos” with the idea that, yes, women play soccer too. The need for a formally recognised nickname was always obvious – not just for marketing reasons, but to stop the media from using silly, sometimes disrespectful alternatives, or derivatives of the Socceroos, which rubbed players the wrong way. It was an occasional topic of conversation within the national team’s dressing room and, during qualifying for the inaugural FIFA Women’s World Cup in 1991 , it came up again. “They asked us for suggestions,” said Sharon Young, who played four ‘A’ internationals for Australia and, as best as this masthead can tell, deserves to be credited as the first person to float the eventual nickname. “That’s when I said, ‘Well, what about Matilda? You know, the kangaroo that went around the stadium, the one that winked?’ I thought that’d be a great name.” Advertisement This was only nine years removed from the Commonwealth Games in Brisbane, which were still culturally resonant. The mascot had, obviously, taken its name from Waltzing Matilda , Banjo Paterson’s 1895 bush ballad, widely regarded as Australia’s unofficial national anthem – but Young is a bit miffed that people these days, including some of her former teammates, assume the name was directly inspired by the song. “It actually was sung on the team bus,” said Moya Dodd, who played 24 times for Australia before becoming a leading football executive. Prior to being interviewed for this story, she was unaware of Young’s involvement or the mascot link. Sharon Young, the former Matildas player who came up with the idea for their nickname. Credit: Peter Stoop “With a few adjustments to the words, as I recall. Something like: ‘ Waltzing Matilda, we’re gonna kill you .’ I think all Australians have a connection with the song. People from overseas have said, ‘Why are you called the Matildas?’. And I’d say, ‘Well, there’s this song about a guy who stole a sheep and was running away from the English, and would rather die than get captured by the English overlords.’ And they’re like, ‘Oh.’ “I think it did capture a sense of rebelliousness, if you like, which is women’s football. It was banned for a long time. To be a woman playing football was a social transgression. In a way, it identifies well with a song about a guy who’s defying authority by stealing things, and then making sure he doesn’t get caught.” But Australia ultimately failed to qualify for the 1991 World Cup, and the push for an official nickname ended there – shoved back “under the covers”, as Young put it, as her time with the national team also wound to an end. “We obviously didn’t have the money like they had now. There was always lamingtons all over the house, trying to sell them, all different raffles to try and get me overseas. The disappointment of not making the first-ever Women’s World Cup, and actually go overseas, was a really big thing for me,” she said. Advertisement “You work so hard, and you get to that level ... I went through nationals with a broken toe to get into that team. It really affected me. I continued to play soccer at the state level, and I got in the Australian side again, but my heart wasn’t there, so I ended up retiring.“ Young went on to forge a distinguished career playing indoor soccer. But by far her biggest legacy was coming up with the “Matildas” name , which was now out there in the ether, and would soon take on a life of its own. A ‘transformational’ moment The trajectory of the women’s game in Australia changed dramatically through two seismic decisions made in September 1993. The first was when the International Olympic Committee agreed to include women’s football for the first time at the Atlanta 1996 Games. Juan Antonio Samaranch at the Sydney Olympics. Credit: Getty Images The second was when Juan Antonio Samaranch stood up at the 101st session of the IOC in Monte Carlo , and said: “The winner is ... Sydney.” At the time, the Matildas had never competed at a major international tournament outside of Oceania. Now, as hosts, they could look forward to a guaranteed shot at Olympic glory on home soil at Sydney 2000. Advertisement With women’s football on the Olympic program and hosting rights secured, a previously unimaginable level of government support was suddenly available, waiting to be unlocked by the AWSA. Prior to joining the AWSA as their chief executive in 1994, administrator Peter Hugg was working at the Australian Sports Commission on the AOC’s “Gold Medal Program” – a government investment scheme to improve coaching, sports science, talent ID and high-performance programs across all Olympic sports so that, now that the Games were coming to Sydney, the host nation would win as many medals as possible. Hugg was able to apply that knowledge in his new role. Suddenly, the AWSA’s annual funding skyrocketed from a meagre $50,000 to $1.3 million. “It was transformational,” he said. It enabled them to sign a full-time national team coach – Tom Sermanni – for the first time. Six intensive training centres for women’s football were set up across the country, and each had their own full-time coaches, too. The women’s game was booming – or at least the national team set-up was, in comparison to years gone by. By winning the OFC Nations Cup in 1994, Australia qualified for the FIFA Women’s World Cup in Sweden the following year. Sermanni brought with him a full coaching panel, including an assistant, team manager, physio and a doctor. Tom Sermanni was the first full-time coach in Matildas history. Credit: Wolter Peeters Still, with the tournament fast approaching, women’s football remained almost invisible in Australia, and that simply had to change. “Very few people cared,” Hugg said. “Those who did care [were from] a completely different demographic group. They were super passionate, but it hadn’t broken through to the mainstream. The term ‘soccer mum’ hadn’t even been invented yet. It was very much a boys game played by some older women, with the occasional girl playing in a boys team.” One of the AWSA’s next hires was Sarah Groube, a fresh-faced university graduate who became their second full-time administrator, after Hugg, in 1995. “We didn’t find it that easy to get into the media,” Groube said. “The ABC was pretty good. You just had to pound the pavement though – we were literally ringing up Roy and HG on a Sunday to let them know what was happening in football, or trying to get on talkback. But no one was coming to us.” The AWSA was trying its best, and it was around this time that it began throwing all sorts of ideas at the wall to boost crowds, interest and broader visibility of the national team. One of them was a failed attempt to deploy M People’s 1993 hit Moving On Up as a team song. “We played it at matches,” Hugg said. “Some of the lyrics were ideal, and we thought, ‘this fits well’. But it was more about a relationship – girl meets boy, boy falls in love with girl, boy breaks up with girl, and then she leaves and she’s moving on up. It never caught on.” As the media continued to refer to the team as the Female Socceroos, they quickly realised their best option was to come up with a name, once and for all, in time for the 1995 World Cup. ‘I’m not saying it was rigged’ The AWSA was based in Canberra, inside ACT Sports House – a primary school building in the suburb of Hackett that was converted into offices for many local and national sporting bodies. Hugg, Groube and Sermanni were working in an old classroom, brainstorming names for the national team with chalk on a blackboard, next to hooks mounted on the walls where schoolchildren would hang their bags, chewing gum still stuck on the floors and windows. The old Hackett Primary School, which became ACT Sports House. Credit: Facebook Groube never liked the idea of naming the team after an animal or object. “We just felt that if you name the team after something that already exists – like you might hear on the news if they’re talking about the Opals, but if you’re not really listening closely ... is that the basketball team or are they talking about actual opals?” she said. After tossing up dozens of options, they kept coming back to one: Matilda. ”All the men’s teams – the Socceroos, Olyroos, Joeys – were about the kangaroo, so I guess what we were trying to find was the female version of the kangaroo,” Hugg said. They made the same link as Young had made to the 1982 Commonwealth Games mascot, albeit unaware she had floated it a few years prior. Hugg looked up the meaning of the name Matilda, which was of German origin. “It means ‘mighty in battle’, so it ticked that box,” he said. “We obviously had Waltzing Matilda , so it was a word that we were familiar with. Roald Dahl had written his book, Matilda , [published in 1988] about a girl with magical powers. And so these little snippets ... you sort of think, ‘This is getting a bit of legs to it. Let’s keep pushing this.’ “Sometimes you strike it lucky. It just fit. Nowadays, you would engage a strategist or an agency and some creative directors. It’s a lesson in that sometimes, the best ideas don’t cost any money.” Former AWSA chief executive Peter Hugg. Credit: Football NSW How this conversation leapt from the AWSA’s office to the studios of SBS and television screens across Australia isn’t entirely clear to anyone involved. Kyle Patterson, a presenter for On the Ball , SBS’s flagship football program that ran between 1984 and 2002, recalls a personal connection between Johnny Warren and Heather Reid, who at that stage was not officially involved with the AWSA but was working in Canberra for the Australian Sports Commission, and was always plugged into goings-on in women’s football. Warren lived there, too, and Reid said he would frequent ACT Sports House to catch up with friends working for other organisations, which led to “random” chats in the corridor – and while she reckons this might have been one of them, she cannot remember the team’s search for a name coming up in a specific conversation. Neither can Groube, although she was only a junior administrator, and said it may have happened above her head. “I like the idea of it,” she said. “It could have played out that way.” According to Patterson, Warren then brought it up during a production meeting. “He said, ‘You know what? It’s about time we pay some attention to the women’s game because they’re committed. They do it for nothing. They do it for love.’ In the end, we went to the women’s association and said, ‘We want to help. This will get a lot of conversations happening. Are you happy for us to run this poll?’” Patterson said. “They were great – they said ‘Yeah, we’re up for it.’ And they very quickly agreed that, within reason, they would accept the result as being the name. But we had to be very careful, because let’s be honest, it was a Sunday morning blokes’ show. We talked about the NSL [National Soccer League], it was pretty rough and ready.” Legendary Socceroo Johnny Warren had a hand in how the Matildas got their name. Credit: Antonin Cermak Groube said Warren was genuinely invested, and always supportive, like Patterson. But few others at the public broadcaster were. “Even SBS, the real shining light for football, was not super interested in women’s football. It was still extremely ... well, sexist, I’d say,” she said. “From time to time, we could get a bit of the novelty spotlight, and we had to keep using that throughout the 90s. That was what the competition was – it was, ‘Here we go, we might get some attention through running this competition.’ And it did. It got us some really great relationships built through SBS and some really great visibility.” On the Ball ’s involvement spanned over a couple of weeks. First, it put a call-out to viewers to send in their suggestions. Groube remembers a fax coming through from SBS with all the entries. “Man, I wish I had kept the fax – [this was] back in the day when it wasn’t even coming through on single pages, it was this roll of paper, and it just kept coming and coming,” she said. “I was in shock at how many entries there were ... Cockatoos, and all these animal names. We all just went, ‘Nope, we’re not gonna be named after something.’ I don’t know if [SBS] filtered some things out – I just remember reading some pretty tasteless ones, and going, ‘You’ve got to be kidding.’” Among the entries were the Galahs, and even – gulp – the Sheilas. “I mean, it’s wrong. It just wouldn’t have lasted,” Hugg said. From there, the AWSA narrowed it down to five names. There was the Waratahs, the NSW floral emblem, which was already in use by the state’s rugby union team, and would have been unpopular with players and fans from elsewhere. The Blue Flyers, which is the name for a female red kangaroo, but a bit too abstract. The Lorikeets, a rainbow-coloured parrot native to Australia, but potentially a bit too cute and cuddly for the sporting arena. The Soccertoos, somehow, survived to the final ballot. And then, the Matildas. Patterson read them out on air, encouraging viewers to dial into a 0055 number to cast their vote, at a cost of 25 cents per call. The SBS phone poll that led to the Matildas getting their name. Credit: SBS The final five names were, as Hugg explained, carefully selected. “You don’t run a competition unless you can influence the outcome,” he said. “I’m not saying it was rigged. But I’m saying it was skewed. And if you look at some of the names that it was up against ... you take the result that you want, and make all your other options not so attractive.” The Matildas won by a landslide. Sermanni distinctly remembers driving from Canberra to Sydney on a stormy day when he received a call from someone at SBS with the results, straining on his brick-sized mobile phone to hear the person on the other end as torrential rain pounded his car. “There was no other name that came close,” he said. “But to be honest, I wasn’t that fussed by it. I was like, ‘I’m not sure about this.’” ‘Girls need heroes too’ These days, it’s hard to imagine the Matildas being called anything else. According to subsequent newspaper reports, some players were apparently unhappy with the outcome, but nobody we spoke to could remember any sense of disquiet within the team, or any particular individuals at the source of it. “I have to admit, if there was concern or consternation or doubt, I never heard it,” Hugg said. “But this is before WhatsApp, chat groups, social media. They may come together at camps or whatever, there might have been some discussions, but there certainly wasn’t a player rebellion. It’s been so successful, it’d be a very game player to say, ‘I never liked it.’ “I would do it differently today. I have to confess, I don’t think we consulted the players as much as we probably should have.” Loading According to an independent study by Futures Sport and Entertainment , the Matildas are now Australia’s fourth-favourite national team and climbing. They have become a household name, internationally renowned, although precisely when they wormed their way into the public consciousness is up for debate – Reid suspects it wasn’t until players posed for a controversial nude calendar on the eve of the Sydney Olympics, which is a whole different story , and a textbook example of the sort of gimmicks they still had to resort to for coverage until very recently. In typical Australian style, the Matildas is now regularly shortened by fans and players to the Tillies. Other national sides like the Young Matildas (the under-20s) and ParaMatildas (the cerebral palsy team which was launched in 2022) have also borrowed their name. Young is thrilled her idea has aged so gracefully, and has to thank her father, George, for the fact her involvement became public knowledge. He blurted it out in a 2016 interview with a local newspaper in Laurieton. “He was just talking to a journalist there and says, ‘Oh, you know, my daughter, she came up with the Matildas name.’ She goes, ‘Well, that’s a good story.’ And I didn’t know anything about it until she rang me and started asking me all these questions,” she said. “I said, ‘Well, that’s right. I’m glad he remembered.’ Because I never said anything to anyone – you don’t think about all that stuff. But dad remembered. Unfortunately, he’s got dementia – I’m his carer, I look after him now. But he always sits up with me and watches Matildas games, he still loves the soccer, whatever it is, men’s or women’s. ”It’s great. You talk to anyone now, they know the Matildas. Once we have this World Cup here, then it’s really going to put it on the map and everybody’s going to be shocked at how many people are involved and how many people watch it. I’m so proud that it’s got that far and so proud to be a pioneer of that era were back in the day.” Matilda the mascot, from the 1982 Commonwealth Games, now lives at a fuel station in south-east Queensland. Credit: TripAdvisor As for Matilda the mascot? She’s had an itinerant life. Two years after the 1982 Commonwealth Games, she moved an hour down the road to the Gold Coast, where she sat at the entrance to the Wet ‘n’ Wild Water World (then known as Cade’s County Waterpark) – until 2009, when she was bought by Matilda Fuel Services, who put her up at a petrol station in Kybong, and then when that was demolished, another in Traveston, where she lives today. Hugg, meanwhile, is now based in Saudi Arabia, and still works in football, but travels the world when he can to watch the Matildas, and will be coming home to cheer them on at the World Cup. Loading “Tommy and myself and the board and others, we played only a small part. The Matildas name ... it’s because of what the players have made it,” he said. “It’s grown a life as a result of every player who has put on the shirt. I get a bit emotional because I’m very patriotic, and I love the team. “My daughter was born at the end of ’94, so she’s the same age as the name. When you become a father, and particularly of a daughter, you suddenly care about the world that she’s going to live in. I was a football administrator who wanted to provide a better world for my daughter. “Girls need heroes too. We wanted to create heroes out of these girls. What we wanted to do was exactly what’s happened. When you go to a Matildas match, and you see a six or seven or eight-year-old walking around with [Chloe] Logarzo or Kerr [on their back] or putting Hayley Raso’s ribbons in their hair – I mean, that has to be the ultimate, doesn’t it? “The girls are so wonderful, they are such a joy, and I love them all dearly.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-06-23 19:30:00","image_url":null,"source_id":"watoday","category":["sports"],"country":["australia"],"language":"english"},{"title":"Sri Lanka crush Oman by 10 wickets","link":"https://www.ft.lk/sports/Sri-Lanka-crush-Oman-by-10-wickets/23-749862","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Another gripping day of the ICC Men’s Cricket World Cup Qualifier saw Sri Lanka win big against Oman. Sri Lanka brushed off Oman yesterday in their Group B encounter at the Queens Sports Club in Bulawayo by registering a thumping 10-wicket victory. The result meant that they climbed to the summit of Group B and put themselves in a strong position to qualify for the Super Six stage of the tournament. Chasing a low total of 99, openers Dimuth Karunaratne and Pathum Nissanka barely broke a sweat, completing the task in 15 overs. Karunaratne was unbeaten on 61 while Nissanka scored 37* as Sri Lanka not only sealed a win but also bolstered their net run rate. Earlier, Sri Lanka skipper Dasun Shanaka called it right at the toss at the Queens Sports Club in Bulawayo and opted to bowl first. His call paid immediate dividends as Sri Lanka had a brilliant start with the ball, with their pacers breathing fire on the Oman batters. The pace of Lahiru Kumara and Kasun Rajitha was too much for the Oman top-order to handle, as they found themselves in massive trouble early on. Kashyap Prajapati was the first wicket to fall, as Kumara trapped him in front of the stumps. Aqib Ilyas followed suit, with Rajitha getting in on the act. Kumara was in no mood to stop as he sent Zeeshan Maqsood and Mohammad Nadeem packing in quick succession, as Oman found themselves reeling at 20/4. Ayaan Khan and Jatinder Singh then embarked on a rebuild job for Oman, putting together a 52-run stand. But it all changed again in a blink of an eye for Oman, as Wanindu Hasaranga delivered one of the overs of the Qualifier so far. The 21st over by Hasaranga fetched him three wickets while also being a maiden. Hasaranga first trapped Jatinder Singh lbw for 21 in the first delivery. The third delivery then saw him bowl Shoaib Khan out. He completed the trifecta by getting Jay Odedra on the final delivery of the over. Oman then found themselves in further trouble as miscommunication between Ayaan Khan and Naseem Khushi led to the latter being run out for 1 after brilliant work in the deep from Rajitha. This left Oman reeling at 84/8 at the halfway mark. Ayaan’s gritty knock of 41 would then come to an end with Hasaranga scalping his fourth courtesy of a brilliant catch in the slips by Dhananjaya de Silva. Hasaranga would clinch his second consecutive five-wicket haul in the tournament, trapping Bilal Khan for zero, as Oman were bowled out for 98. Scotland clinched their second win in a row at the Qualifier, with their bowlers putting them in charge after a Richie Berrington master class of 127 off 136 balls. Scotland scored 282 for the loss of 8 wickets. UAE had a tall ask at hand but some brilliant bowling from the Scotland bowlers further set them back. Chris Sole got the ball rolling with two wickets in two deliveries in the fifth over, dismissing Aryansh Sharma (8) and Vritiya Aravind (0). Sole ended up with 3 for 37. The double strike left UAE reeling and they never quite recovered from the early blows. In the end, UAE were bowled out for 171. Safyaan Sharif took 4 for 20.","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Chamari to lead in Women’s ODI series","link":"https://www.ft.lk/sports/Chamari-to-lead-in-Women-s-ODI-series/23-749860","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka has picked a 15-member squad with Chamari Athapaththu as Captain for the three-match Women’s ODI series against New Zealand to be played at Galle International Cricket Stadium on 27 and 30 June and 3 July. The matches will be part of the ICC Women’s Championship. Meanwhile, the New Zealand Women’s cricket team arrived in Sri Lanka for their first bilateral tour yesterday and travelled directly to Galle for the upcoming series. Chamari Athapaththu (Captain), Vishmi Gunaratne, Harshitha Samarawickrama, Nilakshi de Silva, Kavisha Dilhari, Anushka Sanjeewani, Oshadi Ranasinghe, Kawya Karvindi, Sugandika Kumari, Inoka Ranaweera, Udeshika Prabodhani, Hansima Karunaratne, Inoshi Fernando, Imesha Dulani, Hasini Perera.","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"ODI discard Mathews warms up for Tests with century","link":"https://www.ft.lk/sports/ODI-discard-Mathews-warms-up-for-Tests-with-century/23-749861","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Former Sri Lanka Captain Angelo Mathews, overlooked for the World Cup Qualifiers, warmed up for next month’s two-Test series against Pakistan with a delightful century for Colts in their Major Club 3-day league match against Kandy Customs SC at Thurstan College grounds yesterday. Batting at his customary position at four Mathews held the Colts innings together scoring 124 off 193 balls (10 fours, 6 sixes) as they were dismissed for 263. All-rounder Dhananjaya Lakshan chipped in with a hard hit 69 off 99 balls (5 fours, 4 sixes) while the rest of the Colts batting was consumed by spinners Gayan Sirisoma, Yohan Suresh and Mithun Jayawickrama, all three of whom took three wickets apiece. Kandy Customs SC were 63-2 at stumps. Moors SC were in a commanding position at the end of the first day of their match when they shot out Kurunegala YCC for 90 and scored 240-5 in reply by the close to enjoy a first innings lead of 150 at Moors SC grounds. Invited to bat first Kurunegala YCC batsmen struggled against the seam of Milan Ratnayake (3/18) and Lahiru Samarakoon (3/24) with four batsmen being dismissed for a duck. Moors SC in their turn lost their first four wickets for 85 before Sohan de Livera (96 off 109 balls, 8 fours, 2 sixes) and Mohammad Shamaz (58* off 72 balls, 5 fours, 1 six) rescued them with a 101-run stand. Ragama CC boosted by Sanjaya Chaturanga’s second first-class century (102 off 164 balls, 9 fours, 4 sixes) and a fine half-century from Janith Liyanage (76 off 114 balls, 3 fours, 5 sixes) scored 305 against BRC who ended the day at 10-0 at BRC grounds. Pacie Mohammad Shiraz and veteran spinner Dilruwan Perera took three wickets apiece for BRC. Half-centuries from national cricketers Kusal Perera (62 off 117 balls, 2 fours, 2 sixes) who is leading Police SC this season and Ashen Bandara (74* off 120 balls, 6 fours) and, Gitansh Khera, overseas player from India (68 off 98 balls, 6 fours, 1 six), saw them reach 310-6 against NCC at the NCC grounds. Seamers Chamika Gunasekara and Nipun Ransika took five of the wickets between them. Chilaw Marians CC spinners Lasith Lakshan (4/53) and Pulina Tharanga (3/62) helped dismiss Air Force SC for 242 at Air Force grounds, Katunayake. Opener Sahil Dias not only missed out on a century by six runs but also failed to carry his bat out when he was the last batsman dismissed for 94 off 236 balls (10 fours). Chilaw Marians CC were 1-0 at stumps. Fast bowlers Nisala Tharaka (5/58) and Kalana Perera (3/45) combined to bowl out Galle CC for 244 of which Ruwantha Kellepotha made a determined 87* off 157 balls (9 fours) to lift the team from 73-5 at one stage. Hosts SSC had replied with 33-1 by the close. In a low scoring game at Surrey Village grounds, Maggona, Sebastianites struggled to 85-7 by the close after dismissing Badureliya CC for 137. Bowlers held sway in this game where 17 wickets fell on the first day. Left-arm seamer Mohamed Dilshad took 5/47 for Sebastianites, and spinners Parvez Rasool (4/36), Indian overseas player and Chanaka Komasaru (3/49) were successful for Badureliya CC. In a delayed start at Panagoda due to wet ground conditions Army SC dismissed Nugegoda SWC for 149 with off-spinner Shehada Zoysa returning career best figures of 6/46 in his seventh first-class game. Hasitha Boyagoda’s solid knock of 93 off 205 balls (8 fours, 2 sixes) and contributions of 47 and 44 from Sandun Weerakkody and skipper Nipun Karunanayake saw Bloomfield invited to bat first by Ace Capital CC at Bloomfield grounds score 304. Off-spinner Roshan Jayatissa had figures of 7/70 – his 15th five-fer in first-class cricket. Ace Capital CC were 12-0 at close. Negombo CC deciding to bat first after winning the toss were 177-4 against Panadura SC at Panadura. The start was delayed by rain and only 50 overs were possible for the day. Left-hander Dimuth Sandaruwan held the batting together with a career best 87* off 112 balls (9 fours, 3 sixes).","pubDate":"2023-06-23 19:18:58","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"}]}