{"newsArray":[{"title":"Surprise name emerges as next T20 captain","link":"https://wwos.nine.com.au/cricket/australia-t20-captain-aaron-finch-replacement-mark-taylor-ian-chappell-exclusive/1f927a62-21fa-4c3e-a6a1-f8256cf7c46a","keywords":null,"creator":["wwos"],"video_url":null,"description":"A﻿ustralia should look beyond the obvious candidates to lead the side after Aaron Finch, according to Mark Taylor.","content":"Australia needs to look ahead, not backwards, when it comes to choosing Aaron Finch 's replacement as T20 captain, according to former skippers Mark Taylor and Ian Chappell. Finch remains in doubt for the must-win World Cup match against Afghanistan in Adelaide, and the possibility exists that he's played his final match for Australia. Matthew Wade will captain if Finch is absent. READ MORE: Red Bull boss fumes at 'hugely worrying' move READ MORE: Under fire Simmons ruled out with injury ﻿ READ MORE: ﻿ Wallabies ring changes for daunting France Test ﻿ The 35-year-old Finch is widely expected to retire from international cricket after this World Cup, having quit the 50-over format of the game in September. At this stage, the Australian T20 side won't play again until August 2023, while the next World Cup will be held in the West Indies and United States in June 2024. Australia's T20 squad has been quite stable over the last 12 months, with the only change to the side that won last year's World Cup being the inclusion of Tim David in the middle order for Steve Smith. Cameron Green is the only member of the 15-man squad for this year's tournament under the age of 29. The age of Finch's potential replacements is what worries Taylor. \"Australia's next major assignment in T20 cricket is the World Cup in two years time,\" he said on Wide World of Sports' Outside the Rope . \"Bear in mind that David Warner will be almost 38, Steve Smith will be 35﻿, Matthew Wade's probably out of contention because he'll be 36. \"Looking at replacing Aaron Finch, I think Australia should be looking at the next generation to start rebuilding this side altogether.\" With the obvious replacements ruled out, Taylor is looking elsewhere for Australia's next leader, including 23-year-old Green. \"We've got quite an oldish T20 side that won last year, I think they've got to be looking at someone like Mitch Marsh, Travis Head if he makes the team, Alex Carey if he takes the gloves, or someone like Cameron Green, who's in and out of the team at the moment. \"They're the guys I'd be looking at to be the leader of our T20 side in two years time. It also gives them an opportunity to have a look at them as leaders, for other formats of the game.\" Stream every Australian men's T20 World Cup match plus selected other matches, including the finals, live and free on 9Now . It's a proposal that also has the backing of Chappell. \"You've got to look ahead, not look backwards,\" he said. While the possibility of Warner's lifetime leadership ban being lifted and the opener succeeding Finch as skipper has been floated, Chappell said that won't happen. The former captain, who has been critical of the decision to hand Warner a different ban to the one given to Smith for the sandpaper fiasco in 2018, conceded the opener's time has passed. \"They might make nice people of themselves and change their mind now, but that's useless,\" he said. \"Warner's not going to captain anything, not for Australia anyhow.\"﻿ For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-11-03 23:27:56","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/11/464342/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Former Pakistan P.M. Imran Khan shot at rally. What happened?","link":"https://www.deseret.com/u-s-world/2022/11/3/23439092/imran-khan-shot-at-rally","keywords":null,"creator":["Gitanjali Poonia"],"video_url":null,"description":null,"content":"Pakistan’s former Prime Minster Imran Khan was shot at a rally Thursday. According to BBC , he was shot in the leg. One person died and five were injured in the attack in the city of Wazirabad. Khan, 70, was at a protest march “to demand that the government hold early elections, when his convoy came under attack,” per The New York Times . He was transported to Lahore for treatment and is reportedly in stable condition. Meanwhile, Khan’s party, Pakistan Tehreek-e-Insaf, or PTI, issued a statement on the former Pakistani cricket captain’s behalf. “(Khan) believes there are 3 people on whose behest this was done, Shehbaz Sharif, Rana Sanaullah, and Maj Gen Faisal. He said he was receiving information and is saying this on that basis,” party leaders said in a video statement , according to Free Press Kashmir . Earlier, Pakistani Prime Minister Shehbaz Sharif tweeted that he condemned the incident and instructed the interior minister to investigate the shooting. “I pray for the recovery and health of PTI chairman & other injured people,” he said, adding that the federal government will extend its support to the “Punjab govt for security & investigation.” Federal government will extend all support necessary to Punjab govt for security & investigation. Violence should have no place in our country's politics. 2/2 https://t.co/LWMUW03kQb According to the Times , a politically motivated attack like this hasn’t occurred in Pakistan since 2007, when Prime Minister Benazir Bhutto was assassinated at a public rally. Last month, the country’s election commission deemed Khan ineligible from holding public office after he was accused of “incorrectly declaring details of gifts from foreign dignitaries and proceeds from their alleged sale,” per BBC . He had been protesting this decision through a series of rallies. Nearly 800 people attended the latest one where the shooting occurred, according to CNN .","pubDate":"2022-11-03 21:35:14","image_url":null,"source_id":"deseret","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Imran Khan news leaves cricket community stunned amid T20 World Cup","link":"https://au.sports.yahoo.com/t20-world-cup-2022-imran-khan-news-leaves-cricket-community-stunned-195821901.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-03 19:58:21","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-11/da5b1f50-5bb0-11ed-9cfd-463d40569981","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pak keep slim semis hopes alive with win over SA","link":"https://www.thehansindia.com/sports/cricket/pak-keep-slim-semis-hopes-alive-with-win-over-sa-767798","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Shadab, Iftikhar, Shaheen star in 33-run victory","content":"Sydney: Shadab Khan produced a brilliant all-round show while Iftikhar Ahmed and Shaheen Shah Afridi played their roles to perfection to keep Pakistans slim semifinal hopes alive in the Men's T20 World Cup with a 33-run victory over South Africa via DLS method in a rain-reduced Group 2 match at the Sydney Cricket Ground on Thursday. The victory for Pakistan, who made 185/9 in 20 overs and restricted South Africa to 108/9 in 14 overs as per the adjustments by the DLS method, in Super 12s also meant that they maintained their perfect record over the Proteas in the history of Men's T20 World Cups with their fourth victory in as many meetings. Pakistan are now in third place in Group 2 points table, pushing Bangladesh to fourth place. On a chilly evening, South Africa made early strikes to push Pakistan on the back foot. Captain Babar Azam (6), Mohammad Rizwan (4) and Shan Masood (2) fell to Lungi Ngidi, Wayne Parnell and Anrich Nortje respectively. Young right-handed batter Mohammad Haris, who had earlier come into the squad as a replacement for Fakhar Zaman in the 15-man squad, entertained a near full-house crowd for some time with his 11-ball knock of 28, laced with two fours and three sixes at a strike-rate of 254.55 before being trapped lbw by Nortje. Iftikhar stepped up to resurrect Pakistan's innings as he built a 52-run stand with Mohammad Nawaz (28 off 22 balls) and then established a crucial 82-run stand off just 35 balls for the sixth wicket with Shadab, who struck the second fastest fifty by a batter from the country in T20Is, to take Pakistan to 185/9, which looked absolutely impossible at one point. While Iftikhar scored 51 from 35 deliveries, hitting three fours and two sixes at a strike rate of 145.71, Shadab's knock proved to be the game-changer for Pakistan as he smashed 52 from just 22 deliveries, including three fours and four sixes at a strike-rate of 236.36. The duo's efforts helped Pakistan get a very challenging total. They were also helped by a sloppy fielding performance from South Africa, who squandered a good start with the ball in power-play. They dropped five catches apart from several fumbles on a greasy outfield. In reply, Shaheen dismissed Quinton de Kock and Rilee Rossouw cheaply in the first three overs. But captain Temba Bavuma shrugged off his lean form with a 19-ball 36, hitting four fours and a six to lead the chase well until Shadab arrived in the eighth over. In his first over of the night, Shadab found Bavuma's outside edge as the keeper completed the catch. One brought two for the leg-spinner when Aiden Markram was castled for 20. By the time play was interrupted due to rain after nine overs, South Africa were 69/4. An hour's interruption caused by rain cut six overs from the chase and when play resumed South Africa needed 75 runs off the remaining five overs, with the target readjusted to 142 in 14 overs as per the DLS method. Tristan Stubbs and Heinrich Klaasen, who came in as David Miller was ruled out to back spasms, hung around to hit some boundaries. But the pressure of a high asking rate was always going to be huge as Shaheen, Mohammad Wasim, Naseem Shah and Haris Rauf picked up wickets in impressive fashion for Pakistan to stay alive in the race for the semifinals. Pakistan now need to win their next match against Bangladesh at Adelaide on Sunday and then hope that either India or South Africa lose their final Group 2 matches to Zimbabwe and Netherlands respectively. South Africa now need to defeat the Netherlands at Adelaide on Sunday, with their match happening before the Pakistan-Bangladesh clash on the same day to be in the reckoning for the last-four stage. Brief scores: Pakistan 185/9 in 20 overs (Shadab Khan 52, Iftikhar Ahmed 51; Anrich Nortje 4/41, Wayne Parnell 1/31) beat South Africa 108/9 in 14 overs (Temba Bavuma 36, Aiden Markram 20; Shaheen Shah Afridi 3/14, Shadab Khan 2/16) by 33 runs (via DLS method).","pubDate":"2022-11-03 18:12:38","image_url":"https://assets.thehansindia.com/h-upload/2022/11/03/500x300_1319001-pak.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Great Boulder and Norths record big wins in Eastern Goldfields Cricket Association’s B-grade competition","link":"https://thewest.com.au/news/kalgoorlie-miner/great-boulder-and-norths-record-big-wins-in-eastern-goldfields-cricket-associations-b-grade-competition-c-8744461","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Two Blues unbeaten after three rounds of the Eastern Goldfields Cricket Association’s B-grade competition.","content":"Small first innings totals paved the way for Great Boulder and North Kalgoorlie to notch decisive victories in last Saturday’s round three fixtures of the Eastern Goldfields Cricket Association’s B-grade competition. Hannans proved no match for Great Boulder, being routed for 57 in 28.1 overs batting first after initially slumping to 6-31. No.8 batter Melwin Jerome top-scored with 16 off 32 balls in 34 minutes, but only one other batter managed double digits on the back of Mitch Gray’s dynamic spell that yielded 6-12. Daniel Colling and Trent Bradshaw each grabbed two wickets and the Two Blues in reply cruised to 1-61 in 11.1 overs. Scott Edwards (not out 18), Brett Simmonds (23) and Will Miller (16) were the main contributors with the bat. Also last weekend, Lake View’s Jed Shaw made 35 and Tim Pike 24 but the side was bowled out for 87 in 29 overs against Norths. Tim Rule grabbed 4-36 and then contributed an unbeaten 19 as Norths chased down the winning runs with eight wickets in hand. Liam Radford anchored Norths’ innings with an unbeaten 40. In Saturday’s fourth round, Lake View play Great Boulder at Wallace Park and Hannans take on Norths at the Ray Finlayson Sporting Complex. Great Boulder have opened the season wit three successive wins. Ladder: Great Boulder 18 points; North Kalgoorlie 12; Hannans 6; Lake View 0. Sign up for our emails","pubDate":"2022-11-03 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8744461/8c29aed3a77044d147d8be5060671a3f41c25fd6-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Most unpredictable cricket team: Why Pakistan is called the most unpredictable team in Cricket?","link":"https://thesportsrush.com/cricket-news-most-unpredictable-cricket-team-why-pakistan-is-called-the-most-unpredictable-team-in-cricket/","keywords":["Cricket","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"The ongoing T20 World Cup 2022 has seen quite a few upsets since the tournament opener on October 16, when Asia Cup 2022 champions Sri Lanka were humbled by Namibia with a 55-run defeat. While Sri Lanka did bounce back to make it through to the ‘Super 12’ stage, the power-hitters laden West Indies side… The post Most unpredictable cricket team: Why Pakistan is called the most unpredictable team in Cricket? appeared first on The SportsRush.","content":"The ongoing T20 World Cup 2022 has seen quite a few upsets since the tournament opener on October 16, when Asia Cup 2022 champions Sri Lanka were humbled by Namibia with a 55-run defeat. While Sri Lanka did bounce back to make it through to the ‘Super 12’ stage, the power-hitters laden West Indies side crashed out of the tournament after suffering shocking upsets against Scotland and then Ireland. Come the ‘Super 12’ stage, there were a couple of other upsets that humbled the directly qualified teams, but team Pakistan made sure they, with their usual, uncanny brand of Cricket came up with some shocking defeats before coasting through, or play like absolute beasts some other day. In between, the ‘Men in Green’ also become victims of an upset of the highest order, to add to the entertainment value for the casual Cricket lovers, while soaking in all the curses of their ever-emotional fans back home. After almost miraculously losing to arch-rivals India, much credit for which goes to an unbelievable knock from Virat Kohli, Pakistan suffered a against the low-ranked Zimbabwean side in their next match, to find themselves staring at the exit door so early in the tournament. The unpredictable Pakistani side, then restricted the Netherlands on a paltry 91/9 in their 20 Overs during the next match. And just when everyone expected Pakistan to chase the total down as quickly as possible to improve their Net Run Rate (NRR), none of their top-5 batters batted at a strike rate of even 130+, as it took them 13.5 Overs to reach the target. Come Thursday, with none of their other group results going their way, their fans had minimal hopes from their team to pull off a victory against a strong South African unit, which were the only team (out of 16) to have not lost a single match in the ongoing World Cup. However, after some jaw-dropping knocks off the bats of their middle-order batters in Shadab Khan (52 off 22) and Iftikhar Ahmed (51 off 35), Pakistan forced the Sydney Crowd to stand up on the feet to post a challenging score of 185/9. Their much-famed bowling unit then stepped up, to hand the Proteas a 33-run loss, to find themselves . The Pakistan team, over the years, have always had the knack of producing the unlikeliest of results one day, and then somehow like rising from the ashes like a Pheonix, producing some of the most brilliant individual performances the other, to leave the other teams not only shell-shocked but also make up their minds to never take them for granted based on their players’ reputation or their previous few performances. Jump back memory lane to the 2019 ODI World Cup. Pakistan had not only suffered a 10-wicket loss against West Indies in their World Cup opener, but had arrived in England on the back of 11 consecutive defeats in the format. Come their next match against World Cup title favourites England, Pakistan rose to the occasion to post a mammoth total of 348 runs in their 50 Overs, and thereby hand a 14-run defeat to the English side. Who can forget the grand finale of the 2007 T20 World Cup against India, when , out of the Blue decided to play the lap scoop over short fine leg to hand the simplest of catches to Sreesanth, and gift India a 5-run victory. Even during the 2007 ODI World Cup, they suffered a shock defeat against the newcomers in Ireland by 3 wickets, to bow out of the tournament even before their last group stage match versus Zimbabwe. More recently, during the Asia Cup 2022 final in Dubai, a venue where teams batting second had won 6 of the 8 previous matches largely due to the dew factor, Pakistan had not only invited Sri Lanka to bat first but had reduced them to 58/5 to look like heading towards a comfortable Asia Cup title. However, a Bhanuka Rajapaksa (71 off 45) special out of nowhere and then a lackluster batting effort from the Pakistani batters, with Mohammad Rizwan (55 off 49) batting out most of the Overs in the 171-run chase meant that they eventually fell short by 23 runs.","pubDate":"2022-11-03 17:46:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CSA T20 Challenge shows why SA cricket is an attractive product","link":"https://www.iol.co.za/sport/cricket/domestic/csa-t20-challenge-shows-why-sa-cricket-is-an-attractive-product-63d05cc0-80ee-4253-9907-2992ce4494b1","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Dewald Brevis’ 162 off 57 balls earlier this week was one of the signs that show that South African cricket is still a very attractive product.","content":null,"pubDate":"2022-11-03 17:31:20","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/8ff079df-433a-5416-9d58-60c64187fe9b&operation=CROP&offset=155x0&resize=925x518","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Kohli comes up with incredible gesture for Litton after IND's win over BAN at WC - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMitAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC92aXJhdC1rb2hsaS1jb21lcy11cC13aXRoLWluY3JlZGlibGUtZ2VzdHVyZS1mb3ItbGl0dG9uLWRhcy1hZnRlci1pbmRpYS1zLXRocmlsbGluZy13aW4tb3Zlci1iYW5nbGFkZXNoLWF0LXQyMC13b3JsZC1jdXAtMTAxNjY3NDkzNTY5MjYwLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Kohli comes up with incredible gesture for Litton after IND's win over BAN at WC  Hindustan TimesVirat Kohli`s `FAKE fielding` controversy: Bangladesh cricket board to take ACTION, check details HERE - T2...  Zee NewsBangladesh accuse Kohli of 'fake fielding' during tense India victory  ESPNcricinfoVirat Kohli in 'Fake Fielding' faceoff; Harsha Bhogle explains rule to 'Friends of Bangladesh'  Hindustan TimesSocial Media All Praise for 'Unsung Hero' Raghu After Harsha Bhogle's Revelation  News18View Full coverage on Google News","content":null,"pubDate":"2022-11-03 17:21:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"NZ vs IRE Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NZ vs IRE T20 World Cup 2022 Super 12 in Adelaide, 930 AM IST, November 4","link":"https://zeenews.india.com/cricket/nz-vs-ire-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-nz-vs-ire-t20-world-cup-2022-super-12-in-adelaide-930-am-ist-november-4-2530703.html","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Ireland Dream11 Team Prediction New Zealand vs Ireland T20 World Cup 2022 Super 12 Preview - Check My Dream11 Team, Best players list of NZ vs IRE, Ireland Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-11-03 17:03:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan women’s cricket team captain Bismah laments no hike in match fee in last 8 years","link":"https://sportstar.thehindu.com/cricket/womens-cricket/bismah-maroof-pakistan-womens-cricket-pcb-match-fee-no-hike-last-8-years-press-conference/article66092921.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"Bismah’s comments came during a press conference she addressed in Lahore before the start of the home series against Ireland.","content":"Pakistan women’s cricket team captain Bismah Maroof has made her displeasure known over the failure of the PCB (Pakistan Cricket Board) to increase match fees of female players in the last eight years. Bismah’s comments came during a press conference she addressed in Lahore before the start of the home series against Ireland. She said the match fees for the national team players had not been increased since the last eight years. The Board of Control for Cricket in India (BCCI) recently announced that its women cricketers will be paid same match fee as the men. Bismah was asked about the BCCI’s move. “I think the women cricketers also put in a lot of hard work. But there is no doubt that in Pakistan women’s cricket still needs to progress to the level of countries like India, England, Australia etc.,” she said. She added, “It is also a fact that in recent years the PCB has done a lot to reward the women cricketers and provide them with the best facilities and coaches.” The Pakistan captain and batter, who returned to international cricket after motherhood, said the home series against Ireland would help the players prepare for next year’s T20 World Cup. The Pakistan women’s team surprised everyone by beating India in last month’s Asia Cup in Bangladesh but overall, the team’s performance in big tournaments has been pretty disappointing. Read more stories on Women's Cricket.","pubDate":"2022-11-03 16:56:18","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa vs Netherlands weather forecast on 6 November: SA vs NED rain prediction and weather report for Adelaide Oval","link":"https://thesportsrush.com/cricket-news-south-africa-vs-netherlands-weather-forecast-on-6-november-sa-vs-ned-rain-prediction-and-weather-report-for-adelaide-oval/","keywords":["Cricket","Adelaide Oval","ICC T20 World Cup 2022","Netherlands","South Africa"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Having been the only unbeaten team in the T20 World Cup 2022 so far, South Africa on Thursday too, suffered a one-sided defeat against Pakistan by 33 runs in a rain-affected match at the Sydney Cricket Ground (SCG). A win for South Africa today would have secured their semi-final berth, but has in turn made… The post South Africa vs Netherlands weather forecast on 6 November: SA vs NED rain prediction and weather report for Adelaide Oval appeared first on The SportsRush.","content":"Having been the only unbeaten team in the T20 World Cup 2022 so far, South Africa on Thursday too, suffered a one-sided defeat against Pakistan by 33 runs in a rain-affected match at the Sydney Cricket Ground (SCG). A win for South Africa today would have secured their semi-final berth, but has in turn made sure Pakistan stay alive in the tournament yet another day. The development has meant that they will face the Netherlands in a must-win, last ‘Super 12’ match on November 6 (Sunday), at the Adelaide Oval. While a loss against a relatively weaker Dutch side is unlikely, they would still not fall behind in the semi-final qualification race if they do lose, provided one of the other two results from their group go their way. ALSO READ: Hourly weather in Adelaide Oval Australia for Friday, November 4 For that to happen, one of India or Pakistan will have to lose their final ‘Super 12’ match against Zimbabwe and Bangladesh respectively. South Africa vs Netherlands weather forecast on 6 November In case of a washout due to rain, South Africa would then have to either hope for the Pakistan versus Bangladesh match to be abandoned as well (which will take place at the same venue on the same day next), or hope Bangladesh defeat Pakistan, in order to make it to the final-4. The South Africa versus Netherlands ‘Super 12’ match will commence from 10:30 am (local time) in Adelaide. As per the Accuweather forecast, sun will shine nice and bright the entire day, until 07:00 pm (local time). Thus, with 0% chances of rain, even during the Pakistan versus Bangladesh match as well, expect two mouth-watering clashes on a bright sunny Adelaide Sunday. Hourly weather in Adelaide Oval Australia for Friday November 6 09:00 AM – 20 degree (Rain Probability – 0%). 10:00 AM – 23 degree (Rain Probability – 0%). 11:00 AM – 25 degree (Rain Probability – 0%). 12:00 PM – 26 degree (Rain Probability – 0%). 01:00 PM – 27 degree (Rain Probability – 0%). 02:00 PM – 28 degree (Rain Probability – 0%). 03:00 PM – 27 degree (Rain Probability – 0%). 04:00 PM – 27 degree (Rain Probability – 0%). 05:00 PM – 26 degree (Rain Probability – 0%). The post South Africa vs Netherlands weather forecast on 6 November: SA vs NED rain prediction and weather report for Adelaide Oval appeared first on The SportsRush.","pubDate":"2022-11-03 16:19:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan stay in contention for semis","link":"https://www.arabtimesonline.com/news/pakistan-stay-in-contention-for-semis/","keywords":["Sports","T20"],"creator":["Arab Times"],"video_url":null,"description":"SYDNEY, Nov 3, (AP): Pakistan stayed in contention for the T20 World Cup semifinals after beating South Africa by 33 runs in a rain-affected match on Thursday. South Africa would have clinched a top-four berth with a win, and have a last chance on Sunday against the Netherlands. Pakistan have won two after two opening … The post Pakistan stay in contention for semis appeared first on ARAB TIMES - KUWAIT NEWS.","content":"SYDNEY, Nov 3, (AP): Pakistan stayed in contention for the T20 World Cup semifinals after beating South Africa by 33 runs in a rain-affected match on Thursday. South Africa would have clinched a top-four berth with a win, and have a last chance on Sunday against the Netherlands. Pakistan have won two after two opening losses and face Bangladesh on Sunday. But the winners of the clash will need help from others in Group 2 to advance. Pakistan’s Babar Azam bats during the T20 World Cup cricket match between Pakistan and South Africa in Sydney, Australia. (AP) Shadab Khan smashed a 21-ball half-century to lead Pakistan to 184-9 after being 43-4 at the Sydney Cricket Ground. Rain interrupted South Africa’s chase, and the target was revised to 142 off 14 overs on the Duckworth- Lewis-Stern method. But the Proteas were restricted to 108-9. Shadab picked up two wickets with his first three deliveries and was an easy man-of-the-match pick. His blistering 52 off 22 balls, which featured four sixes and three fours, revived Pakistan. Iftikhar Ahmed added 51 off 35 balls against sloppy South African fielding. “The pitch was nice, a bit slow, but the ball came onto the bat nicely,” Shadab said after what he described as his best T20 batting performance. Pakistan’s troublesome top order collapsed against South Africa’s pace and Pakistan could have been 44-5 if Quinton de Kock hadn’t dropped a difficult catch behind the wickets when Iftikhar was on 2. After Babar Azam’s fourth consecutive single-digit score, Mohammad Haris, in for the injured Fakhar Zaman, hit fast bowler Kagiso Rabada for two sixes and a four in a quickfire 28 off 11 balls before he was undone by Anrich Nortje’s pace and was out lbw. Iftikhar capitalized on de Kock’s drop and added a half-century stand with Mohammad Nawaz. But Shadab brought a boisterous Pakistan crowd to its feet with power hitting. South Africa struggled to stem the flow of runs under light drizzle, and the umpires kept the players on the field. The 82-run stand in the last seven overs took Pakistan to 177-5 before South Africa hit back late with three wickets. Shadab and Iftikhar holed out in the deep. Nortje took 4-41. Shaheen Afridi provided Pakistan with a perfect start to the chase with the wickets of de Kock and Rilee Rossouw but captain Temba Bavuma (36) and Aiden Markram (20) smashed fast bowler Haris Rauf for 37 runs off his first two overs to keep South Africa in the game. Shadab turned the game back in Pakistan’s favor when he had Bavuma caught behind off his first ball and clean bowled Markram with a sharp googly. South Africa slipped to 66-4. After the rain break, South Africa couldn’t cope with the pressure of scoring more than 14 an over. “Definitely disappointing the way we ended our bowling and fielding,” Bavuma said. “Credit to them, they had the momentum and took it with them through the bowling innings. Netherlands next, a big game, we want to put this game past us as quickly as possible and come again.” Meanwhile, Malibongwe Maketa was named interim head coach of the South Africa cricket team and will take charge of the Proteas for a three-test tour of Australia starting next month. Maketa will replace Mark Boucher, who will step down as head coach after the ongoing Twenty20 World Cup in Australia. The 42-year-old Maketa is currently the South Africa “A” team coach and head of the national academy, and has been part of the senior team’s coaching group before. He was an assistant coach with the Proteas from 2017-19. His appointment is only for the Tests in Brisbane, Melbourne and Sydney in December and January, with Cricket South Africa expected to make a permanent appointment early next year. The post Pakistan stay in contention for semis appeared first on ARAB TIMES - KUWAIT NEWS.","pubDate":"2022-11-03 16:00:00","image_url":null,"source_id":"arabtimesonline","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"Virat Kohli's 'FAKE fielding' controversy: Bangladesh cricket board to take ACTION, check details HERE - T20 World Cup 2022","link":"https://zeenews.india.com/cricket/virat-kohlis-fake-fielding-controversy-bangladesh-cricket-board-to-take-action-check-details-here-t20-world-cup-2022-2530682.html","keywords":null,"creator":null,"video_url":null,"description":"The T20 World Cup 2022 Super 12 clash between India and Bangladesh was full of interesting events. Whether it was Litton Das's fiery fifty, KL Rahul's magical throw to run out Das or Virat Kohli's 'fake fielding' throw. The rain-interrupted contest between India and Bangladesh was a thriller which went right down to wire. However, after the match in which India made a brilliant comeback to secure a victory by five runs in Adelaide, fingers were raised for a few issues from fans over the decision of the umpires.","content":null,"pubDate":"2022-11-03 15:46:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Want to be a consistent match-winner for India, says Suryakumar Yadav","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-want-to-be-a-consistent-match-winner-for-india-says-suryakumar-yadav-767792","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Suryakumar is the current World No. 1 T20I batsmanHe made his India debut just last yearSurya has scored 1,209 runs in 38 T20Is for India","content":"Suryakumar is the current World No. 1 T20I batsman The new World No. 1 T20I batsman Suryakumar Yadav has said he is aiming to be a consistent match-winner for Team India. Following two consecutive half-centuries in the ongoing T20 World Cup , Surya climbed to the top of the ICC rankings for T20I batsmen. While he became the 23rd batsman to be World No. 1 in T20Is, he was only the second Indian player to achieve the feat after Virat Kohli. In a recent interview, Surya revealed that he has never played a bowler in his name and reputation but whenever he goes inside to bat, he plays to the merit of the ball. \"To win as many games and to give as many performances for Team India whenever I get the opportunity. I have never played the name of a bowler. Whenever I go inside and bat, I play the ball. But at the same time, when I practice in the nets, I keep in mind all what shots I need to play against a particular bowler,\" Suryakumar said in the ICC Review. Surya replaced Pakistan's out-of-form Mohammad Rizwan at the top of the ICC T20I rankings. This is certainly a fine moment for Surya, considering he had not played for India until March of last year. So grateful for all the love and support, it motivates me to keep working hard.💪 https://t.co/A0TLyebCwU Since making his T20I debut for India during their home series against England, Surya has amassed 1,209 runs in 38 T20Is, including a century and 11 fifties, at a strike-rate of 177.27 and an average of a little over 40. The 32-year-old Surya is also the current leading run-scorer in the T20Is in 2022. The Indian batsman has scored 965 runs in 27 games at an average of 41.95 and strike-rate of 183.80, scoring a century and eight half-centuries. Surya scored an unbeaten 51 off 25 deliveries in India's 56-run victory over Netherlands in the Super 12s of the T20 World Cup 2022. He has had quite a few partnerships with Kohli in recent times and the Mumbai batsman has admitted that he enjoys batting with the former Indian skipper. \"I was just trying to express myself when I went in to bat. The situation was very simple, I just had to up the tempo at that time. I took one ball today (to get going), but the message was loud and clear. We had to get about 8-10 an over and get a total that our bowlers could defend easily. Very happy with the way things went. \"Really enjoying batting with him (Kohli), the thoughts are very clear when we both are batting. If I get few boundaries earlier then our partnership needs to be stretched and that's what we are doing,\" said Surya after receiving the Player of the Match award. With 164 runs in four games, Surya is placed eighth in the chart of most runs in the ongoing T20 World Cup Down Under. Kohli, meanwhile, is the leading scorer with 220 runs. With six points from four games, India are at the top of Group 2 in T20 World Cup's Super 12s. They are scheduled to take on Zimbabwe in their final group game on Sunday at Melbourne Cricket Ground (MCG). A win in the game would seal India's place in the semi-final. Last year, India failed to make it to the last-four of the T20 World Cup, which was held in the UAE.","pubDate":"2022-11-03 15:43:09","image_url":"https://assets.thehansindia.com/h-upload/2022/11/03/500x300_1318996-suryakumar-yadav.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Plays of the game from chaotic SA v Pakistan clash in Sydney","link":"https://www.iol.co.za/sport/cricket/proteas/plays-of-the-game-from-chaotic-sa-v-pakistan-clash-in-sydney-057baee4-1118-4147-abd2-74fe2bc073a8","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"IOL Sport’s Stuart Hess gives us the plays of the day from the action during the T20 World Cup clash between South Africa and Pakistan at the Sydney Cricket Ground.","content":null,"pubDate":"2022-11-03 15:32:38","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/0f810cc8-49c8-56b1-b5a5-664f85d3aca0&operation=CROP&offset=0x57&resize=3500x1966","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Pakistan cricket star’s ‘absurd’ World Cup feat","link":"https://www.cairnspost.com.au/sport/cricket/protect-this-man-at-all-costs-shadab-khan-keeps-pakistans-t20-world-cup-dream-alive/news-story/b6d35de76ceec19aee8ccafd870bd9ca","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Pakistan’s unbeaten T20 World Cup record against South Africa remains intact after Thursday evening’s rain-affected victory at the SCG kept the Cornered Tigers in contention for an unlikely semi-finals berth.","content":null,"pubDate":"2022-11-03 15:17:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"BCCI Nominee Likely To Head ICC's Finance And Commercial Affairs Committee","link":"https://sports.ndtv.com/cricket/bcci-nominee-likely-to-head-iccs-finance-and-commercial-affairs-committee-3487839","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"The BCCI representative in the all powerful ICC Board is likely to head the Finance and Commercial Affairs (F&CA) committee of the global cricket body","content":"The BCCI representative in the all powerful ICC Board is likely to head the Finance and Commercial Affairs (F&CA) committee of the global cricket body. While BCCI hadn't yet made it official, secretary Jay Shah looks likely to be Indian representative at the decision making ICC board unless he decides to send Roger Binny there and remain a part of the Chief Executives Committee. The F&CA committee is the most important of all the subsidiary committees of ICC and for some years, BCCI representatives weren't a part of it till former BCCI president Sourav Ganguly became its member. \"If Jay is representing BCCI in ICC Board, then he will automatically be part of F&CA committee. But India has not been heading the F&CA for a long time and it's BCCI's turn to head the committee,\" an ICC insider privy to the development told PTI. Shah will be reaching Melbourne in the next couple of days for the annual ICC board meeting. The newly elected BCCI president Roger Binny and IPL chairman Arun Dhumal are also expected to reach Australia to watch the T20 World Cup proceedings. It will be interesting to see who represents BCCI at the ICC Chief Executives Committee (CEC) meeting. The convention is that president sits in the ICC Board and secretary sits in the CEC. The F&CA committee decides on ICC's annual budget and is also the committee that determines the revenue sharing model, sponsorship and various rights deals for a particular cycle. As far as the chairman's position is concerned, incumbent Greg Barclay of New Zealand looks frontrunner although there is a second candidate who has filed his nomination. The members are tight lipped about the second candidate but it is understood to be either Zimbabwe cricket board Chief Tevengwa Mukhulani or Singapore's Imran Khwaja. Promoted Sourav Ganguly might continue as head of ICC Cricket Committee as it's a three year term. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-11-03 15:00:28","image_url":"https://c.ndtvimg.com/2022-10/4gf8k4tg_bcci_650x400_27_October_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Statement on incident in Pakistan","link":"https://www.cricketireland.ie/news/article/statement-on-incident-in-pakistan","keywords":null,"creator":null,"video_url":null,"description":"LAHORE, Pakistan – Cricket Ireland is aware of an incident involving former Prime Minister Imran Khan that took place approximately 150km outside Lahore, venue of the three ODIs and three T20Is between Ireland Women and Pakistan Women.","content":null,"pubDate":"2022-11-03 14:59:05","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Weather report of Adelaide Cricket Ground Australia: Weather in Adelaide Oval Australia for Friday November 4","link":"https://thesportsrush.com/cricket-news-weather-report-of-adelaide-cricket-ground-australia-weather-in-adelaide-oval-australia-for-friday-november-4/","keywords":["Cricket","Afghanistan","Australia","ICC T20 World Cup 2022","Ireland","New Zealand"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The iconic Adelaide Oval will entice bountiful eyeballs from the cricketing fraternity due to it being the host for two crucial ICC T20 World Cup 2022 Super 12 matches tomorrow. With the last Adelaide T20I getting affected by rain as recent as yesterday, it will be interesting to see how weather pans out in the… The post Weather report of Adelaide Cricket Ground Australia: Weather in Adelaide Oval Australia for Friday November 4 appeared first on The SportsRush.","content":"The iconic Adelaide Oval will entice bountiful eyeballs from the cricketing fraternity due to it being the host for two crucial ICC T20 World Cup 2022 Super 12 matches tomorrow. With the last Adelaide T20I getting as recent as yesterday, it will be interesting to see how weather pans out in the city on November 4. Only the second day at the office for this stadium with respect to this World Cup, Adelaide has it in it to decide the fortunes of teams regarding semi-final qualification. currently, hosts and defending champions Australia might also be seen playing their last match of the competition especially if they don’t register a gargantuan victory in their . 12:30 AFT 4th, Nov 2022 ️ , Adelaide | | | — Afghanistan Cricket Board (@ACBofficials) A huge shot in the arm for all the stakeholders involved is that weather appears to be pretty supportive for live action to happen throughout the day tomorrow. Tried and tested weather portal predicts a 0% rain probability in Adelaide for playing hours of both the matches. While cold and chilly conditions will persist at the Adelaide Oval with temperature dropping by five degree between afternoon and night, no rain forecast is quite a deserving update for this tournament. Considering how Super 12s have already witnessed as many as four rain abandoned matches and several rain-affected matches (including the last two in Adelaide and Sydney), one wouldn’t want weather gods to play spoilsport at such a vital juncture of a world event now. 02:00 PM – 18 degree (Rain Probability – 0%). 03:00 PM – 18 degree (Rain Probability – 0%). 04:00 PM – 19 degree (Rain Probability – 0%). 05:00 PM – 18 degree (Rain Probability – 0%). 06:00 PM – 17 degree (Rain Probability – 0%). 07:00 PM – 17 degree (Rain Probability – 0%). 08:00 PM – 16 degree (Rain Probability – 0%). 09:00 PM – 15 degree (Rain Probability – 0%). 10:00 PM – 14 degree (Rain Probability – 0%). 11:00 PM – 13 degree (Rain Probability – 0%).","pubDate":"2022-11-03 14:40:01","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Rizwan and I are 'not upto the mark,' says Babar after Pakistan beat South Africa","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-rizwan-and-i-are-not-upto-the-mark-says-babar-after-pakistan-beat-south-africa-767789","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Pakistan defeated South Africa by 33 runs on ThursdayIt was Pakistan’s second win in T20 World Cup 2022Shadab Khan scored a 22-ball 52","content":"Rizwan and I are ‘not upto the mark,’ says Babar after Pakistan beat South AfricaRizwan and I are ‘not upto the mark,’ says Babar after Pakistan beat South AfricaPakistan captain Babar Azam on Thursday admitted that he and Mohammad Rizwan are \"not upto the mark\" in the ongoing T20 World Cup 2022.Babar's comments came after Pakistan defeated South Africa by 33 runs in a rain-hit Super 12s game at Sydney Cricket Ground (SCG). The win on Thursday took Pakistan to third place in Group 2 with four points and now the 2009 champions have a chance to make it to the semi-final. But their fate will rely on other results too. \"I'm very happy with the way the team performed. We are not upto the mark - me and Rizwan. But the way Haris played - a different player - set the momentum. And the way Shadab and Ifti finished the innings - outstanding. To be honest, everyone is my best player. Everyone is my match-winner. The first two losses cost us. But the way we have played the last two matches. As you know cricket is a funny game. You never known,\" Babar said at SCG after Pakistan's win over the Proteas. While Rizwan has crossed the 20-run mark once in the last four games, all of Babar's scores so far in the T20 World Cup 2022 have been in single digits. South Africa captain Temba Bavuma, meanwhile, accepted that South Africa ended the first innings with poor bowling. \"Quite disappointing the way we ended our bowling session. Getting them 5 down quickly and allowing them to get to a formidable score. Lots of questions we need to ask. Credit to them. We knew that the weather was going to be a bit of an issue. I'm no bowler but the bowlers do practice for these conditions. \"Wicket was sliding on, slower balls weren't gripping. We probably could've used the bigger side a bit more. The next game is obviously a big one for us against Netherlands in Adelaide. Have to put this one behind quickly, take whatever learnings we can,\" added Bavuma. Pakistan lost quick wickets before Mohammad Nawaz and Iftikhar Ahmed put up 52 runs for the fifth wicket. Despite that, Pakistan had just 95 runs when they lost Nawaz – their fifth wicket – in the 13th over. However, from there on, Shadab Khan took matters into his hand and went after every South African bowler. Shadab struck four sixes and three fours as he put up a match-winning stand of 82 runs off just 36 balls with Iftikhar for the sixth wicket. The eventual Player of the Match, Shadab, scored at a strike-rate of 236.35 in his knock of 52 off 22 deliveries. \"I have played (batted) like this in PSL, but this is a World Cup match, so it's my best innings. The pitch was a bit slower compared to Perth. I tried to bowl at the stumps, and it paid off. I like to bat up the order, but it depends on the situation and what the team requires, so I am ready to bat anywhere,\" said Shadab. Pakistan's next game is against Bangladesh at Adelaide Oval on Sunday (Nov. 6). It is a do-or-die fixture for both sides. South Africa's next game is also on Sunday at the same venue against Netherlands.","pubDate":"2022-11-03 14:30:48","image_url":"https://assets.thehansindia.com/h-upload/2022/11/03/500x300_1318994-pakistan.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Imran Khan assassination attempt: From Babar Azam to Shoaib Malik, Pakistan cricket fraternity react","link":"https://www.indiatvnews.com/sports/cricket/from-babar-azam-to-wasim-akram-pakistan-cricket-fraternity-reacts-to-assassination-attempt-on-imran-khan-2022-11-03-821079","keywords":null,"creator":null,"video_url":null,"description":"Pakistan's former Prime Minister Imran Khan was attacked on Thursday. A gunman opened fire at a campaign truck carrying Khan, wounding him in both legs. Khan has been taken to a hospital in Lahore where his condition is stated to be out of danger.","content":"Pakistan's former Prime Minister Imran Khan was attacked on Thursday. A gunman opened fire at a campaign truck carrying Khan, wounding him in both legs. Khan has been taken to a hospital in Lahore where his condition is stated to be out of danger. \"Strongly condemn this heinous attack on Imran Khan. May Allah keep Kaptaan safe and protect our beloved Pakistan, Ameen,\" said Pakistan skipper Babar Azam. \"Deeply disturbed about the events unfolding in Wazirabad,\" he posted. \"Heard about the attack on Imran Khan. Alhamdolillah he is fine and in good spirits. This clip of him is from after the attack. I strongly condemn the attack,\" he posted. \"Strongly condemn the attack on Imran Khan. May he stay safe & get well soon. Aameen,\" he wrote. The identity of the gunman, who was arrested at the scene, was not immediately known. No group has claimed responsibility for the shooting. According to police, the attack happened in the Wazirabad district in the eastern Punjab province where Khan was traveling in a large convoy of trucks and cars heading towards the capital, Islamabad, as part of his campaign aimed at forcing the government to hold early elections. One person has reportedly died and seven have been wounded","pubDate":"2022-11-03 14:20:44","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC T20 World Cup 2022 Points Table, Schedule, Time Table, Live Score, Match List, India Squad, Groups, Squad, India Team, Time Table, Live Streaming, Live Telecast Channels - ICC CRICKET SCHEDULE","link":"https://news.google.com/__i/rss/rd/articles/CBMixgFodHRwczovL3d3dy5pY2Njcmlja2V0c2NoZWR1bGUuY29tL2ljYy10MjAtd29ybGQtY3VwLTIwMjItcG9pbnRzLXRhYmxlLXNjaGVkdWxlLXRpbWUtdGFibGUtbGl2ZS1zY29yZS1tYXRjaC1saXN0LWluZGlhLXNxdWFkLWdyb3Vwcy1zcXVhZC1pbmRpYS10ZWFtLXRpbWUtdGFibGUtbGl2ZS1zdHJlYW1pbmctbGl2ZS10ZWxlY2FzdC1jaGFubmVscy_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC T20 World Cup 2022 Points Table, Schedule, Time Table, Live Score, Match List, India Squad, Groups, Squad, India Team, Time Table, Live Streaming, Live Telecast Channels  ICC CRICKET SCHEDULET20 World Cup Group 1 Semi-final Scenarios: Australia May be the First Casualty in Case of Three-Way Tie Wi  News18Adelaide Weather Forecast: Rain respite for New Zealand but DARK CLOUDS hover over Australia's HOPES - Check DETAILS  InsideSportT20 World Cup permutations: Who can progress from Group 2?  Sky SportsT20 World Cup: Which Team in Group 2 Needs What To Qualify Into The Semis? - Qualification Scenarios  News18View Full coverage on Google News","content":null,"pubDate":"2022-11-03 14:01:10","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Teaching Cricket &amp; Hockey is back!","link":"https://www.cricketireland.ie/news/article/teaching-cricket-hockey-is-back","keywords":null,"creator":null,"video_url":null,"description":"Cricket Ireland is running another of its brilliant Teacher Training programme: ‘Teaching Cricket and Hockey’. In partnership with Hockey Ireland, the programme aims to sustainably support both sports at primary and secondary schools by providing training and resources to teachers keen to deliver cricket and hockey at their schools.","content":null,"pubDate":"2022-11-03 13:43:26","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"“Me and Rizwan are not up to the mark”: Babar Azam admits dip in form for himself and Mohammad Rizwan in T20 World Cup 2022","link":"https://thesportsrush.com/cricket-news-me-and-rizwan-are-not-up-to-the-mark-babar-azam-admits-dip-in-form-for-himself-and-mohammad-rizwan-in-t20-world-cup-2022/","keywords":["Cricket","babar azam","ICC T20 World Cup 2022","Mohammad Rizwan","Pakistan","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Pakistan captain Babar Azam has refrained from terming the current Playing XI as their best in the ongoing eighth edition of ICC T20 World Cup. Azam, who laid emphasis on each player of this current squad being a match-winner, hasn’t given up on Pakistan’s chances of qualifying for the semi-finals. Azam, who leads an unpredictable… The post “Me and Rizwan are not up to the mark”: Babar Azam admits dip in form for himself and Mohammad Rizwan in T20 World Cup 2022 appeared first on The SportsRush.","content":"Pakistan captain Babar Azam has refrained from terming the current Playing XI as their best in the ongoing eighth edition of ICC T20 World Cup. Azam, who laid emphasis on each player of this current squad being a match-winner, hasn’t given up on Pakistan’s chances of qualifying for the semi-finals. Azam, who leads an unpredictable team in a “funny game”, has been eyewitness to them losing and winning two consecutive matches respectively. Scheduled to face Bangladesh in Adelaide for their last Super 12 match on Sunday, Pakistan will have to win their third match in a row if they want their limited chances of qualification to work in their favour. This is for my entire team who have supported me throughout. I try to give it my all for them and for the fans of Pakistan cricket. Will always keep believing and working hard no matter what. #PakistanZindabad pic.twitter.com/aO6QAe9IKl — Shadab Khan (@76Shadabkhan) November 3, 2022 Babar Azam admits dip in form for himself and Mohammad Rizwan in T20 World Cup 2022 An honest assessment of his current form led to Azam from pointing fingers at himself and his opening partner Mohammad Rizwan. Having built a reputation of doing the heavy lifting in this top-heavy Pakistani team, both Azam and Rizwan have been found wanting on Australian pitches in this World Cup. Second-highest T20I run-scorer behind Rizwan in the last two years, Azam acknowledged a significant dip in form for both of them but was pleased to see how other batters took the South African bowling attack to the cleaners in the recently concluded T20 World Cup 2022 Match 36 in Sydney. “We are not up to the mark – me and [Mohammad] Rizwan. But the way [Mohammad] Haris played, different player, set the momentum. And the way Shadab [Khan] and Ifti [Iftikhar Ahmed] finished the innings, [they were] outstanding,” Azam told the broadcaster during the post-match presentation ceremony tonight. A normal glance at Azam and Rizwan’s last 10 T20I innings is enough to observe how these two right-handed batters have failed to provide Pakistan with solid starts in this tournament. Pakistan’s most complete victory in T20 World Cup 2022 became a possibility primarily due to a match-winning 35-ball 82-run sixth-wicket partnership between batter Iftikhar Ahmed and vice-captain Shadab Khan. Playing only his second T20I, batter Mohammad Haris justified his promotion from standbys to the Playing XI by batting at a strike rate of 254.54 during his 11-ball stay inside the powerplay. All in all, the trio scored a combined total of 131 (68) comprising of eight fours and nine sixes at a strike rate of 192.64 on Thursday. The post “Me and Rizwan are not up to the mark”: Babar Azam admits dip in form for himself and Mohammad Rizwan in T20 World Cup 2022 appeared first on The SportsRush.","pubDate":"2022-11-03 13:33:02","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"T20 WC: Pakistan Keep Slim Semi-final Hopes Alive With South Africa Win - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3QyMC13b3JsZC1jdXAtMjAyMi90MjAtd29ybGQtY3VwLXBha2lzdGFuLWtlZXAtc2xpbS13b3JsZC1jdXAtaG9wZXMtYWxpdmUtd2l0aC1zb3V0aC1hZnJpY2Etd2luLTM0ODczMTPSAYUBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vdDIwLXdvcmxkLWN1cC0yMDIyL3QyMC13b3JsZC1jdXAtcGFraXN0YW4ta2VlcC1zbGltLXdvcmxkLWN1cC1ob3Blcy1hbGl2ZS13aXRoLXNvdXRoLWFmcmljYS13aW4tMzQ4NzMxMy9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"T20 WC: Pakistan Keep Slim Semi-final Hopes Alive With South Africa Win  NDTV SportsLive Cricket Score: Pakistan vs South Africa, T20 WC 2022 | Cricbuzz.com  CricbuzzPakistan vs South Africa Highlights, T20 World Cup 2022: Pakistan beat South Africa to keep semis hopes alive  Times of IndiaHighlights PAK vs SA Score, T20 World Cup 2022: Pakistan Beat South Africa By 33 Runs  India.comDavid Miller wants South Africa to take advantage of Pakistan’s fragile middle-order: It’s an area to exploit  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-11-03 13:28:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: How can Pakistan make it to the semifinals after the win over South Africa - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvdDIwLXdvcmxkLWN1cC0yMDIyLWhvdy1jYW4tcGFraXN0YW4tcXVhbGlmeS1mb3ItdGhlLXNlbWlmaW5hbHMtb2YtdGhlLXdvcmxkLWN1cC1mcm9tLWhlcmUtODI0NzkwNy_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: How can Pakistan make it to the semifinals after the win over South Africa  The Indian Expressgoing with this -- Qualification scenarios: India primed for semis spot, Pakistan need a win and a favour | Cricbuzz.com - Cricbuzz  CricbuzzT20 World Cup: Group 2 Qualification Scenario Explained After Pakistan's Win Over South Africa  NDTV SportsPakistan vs South Africa Highlights, T20 World Cup 2022: Pakistan beat South Africa to keep semis hopes alive  Times of IndiaLive Cricket Score: Pakistan vs South Africa, T20 WC 2022 | Cricbuzz.com  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-11-03 13:26:01","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Phenomenal all-round display from Shadab Khan keeps Pakistan's World Cup dream alive - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC90MjAtd29ybGQtY3VwLTIwMjItc2hhZGFiLWtoYW4tc3RhcnMtcGFraXN0YW4tYmVhdHMtc291dGgtYWZyaWNhL2NiYTZhMmJlLWQ0MTItNGJhMC04ZTgyLWQ4MzdjMTUxY2EzZdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Phenomenal all-round display from Shadab Khan keeps Pakistan's World Cup dream alive  Wide World of Sports‘Outrageous’: T20 giants alive after utter ‘carnage’, cruel twist stings World Cup rival  Fox SportsPakistan cricket star’s ‘absurd’ World Cup feat  news.com.auAs it happened: Pakistan keeps semi-final hopes alive with win over South Africa  Wide World of SportsPakistan bat first in must-win T20 clash  Mandurah MailView Full coverage on Google News","content":null,"pubDate":"2022-11-03 13:16:35","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 WC: Pakistan Keep Slim Semi-final Hopes Alive With South Africa Win","link":"https://sports.ndtv.com/cricket/t20-world-cup-pakistan-keep-slim-world-cup-hopes-alive-with-south-africa-win-3487313","keywords":["Cricket"],"creator":["AFP"],"video_url":null,"description":"Pakistan kept their slim T20 World Cup hopes alive with a 33-run win over South Africa in a dramatic rain-affected match at the Sydney Cricket Ground on Thursday","content":null,"pubDate":"2022-11-03 12:53:08","image_url":"https://c.ndtvimg.com/2022-11/e50pep4_team-pakistan_625x300_03_November_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"How Pakistan go to semi finals: How many chances of Pakistan to qualify for semi final of T20 World Cup 2022?","link":"https://thesportsrush.com/cricket-news-how-pakistan-go-to-semi-finals-how-many-chances-of-pakistan-to-qualify-for-semi-final-of-t20-world-cup-2022/","keywords":["Cricket","ICC T20 World Cup 2022","Pakistan","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Pakistan have defeated South Africa by 33 runs (DLS Method) in the 36th match of the ongoing ICC T20 World Cup. A comprehensive victory on the back of excelling across departments has kept Pakistan’s chances of qualifying for the semi-finals alive. Chasing a 186-run target, South Africa hurt their chances of cementing a semi-final berth… The post How Pakistan go to semi finals: How many chances of Pakistan to qualify for semi final of T20 World Cup 2022? appeared first on The SportsRush.","content":"Pakistan have defeated South Africa by 33 runs (DLS Method) in the 36th match of the ongoing ICC T20 World Cup. A comprehensive victory on the back of excelling across departments has kept Pakistan’s chances of qualifying for the semi-finals alive. Chasing a 186-run target, South Africa hurt their chances of cementing a semi-final berth today itself by faltering in both the innings. While substandard bowling and fielding resulted in them needing to seal a mountainous chase, wicket-keeper batter Quinton de Kock (0) and batter Rilee Rossouw (7) getting out in the first three overs didn’t allow the Proteas to make progress in an ideal manner. An expected rain break taking away six overs from the match further made life difficult for South Africa as they were required to score 73 runs in five overs with a lower order bereft of batting depth. Opening the bowling for his team as usual, speedster Shaheen Shah Afridi was the pick of their bowlers with figures of 3-0-14-3. While vice-captain Shadab Khan picked a couple of crucial wickets, Mohammad Wasim, Naseem Shah and Haris Rauf chipped in with a wicket each. Winning the toss for the first time in this World Cup, captain Babar Azam’s decision of batting first wasn’t justified by his batters initially as they were reduced to 43/4 right after the powerplay. However, a match-winning 35-ball 82-run sixth-wicket partnership between Iftikhar Ahmed (51) and Shadab Khan (52) turned the table for Pakistan at the Sydney Cricket Ground tonight. A deserving candidate of the Player of the Match award, Shadab’s maiden T20I half-century comprised of three fours and four sixes at a strike rate of 236.36. How many chances of Pakistan to qualify for semi final of T20 World Cup 2022? Pakistan, whose chances of qualifying for the next round had received a major hit after their consecutive defeats earlier in the tournament, have somehow managed to stay alive ahead of their last Super 12 match against Bangladesh in Adelaide. Only Pakistan cricket can have such a start to the tournament & then become the first & only team to beat the only unbeaten team in this #T20WorldCup . #pakvsa — Asim Azhar (@AsimAzharr) November 3, 2022 For starters, Azam and his men will have to defeat Bangladesh to stand any chance of qualifying for the semi-final. Currently at the third position on Group 2 points table, Pakistan need at least one out of South Africa or India to lose their last match on November 6. Even if they beat Bangladesh, Pakistan will be knocked out if both South Africa and India also win on Sunday. While a South African loss will guarantee Pakistan of a semi-final berth, an Indian loss will bring the NRR (Net Run Rate) into the equation. Readers must note that Pakistan (1.117) have a better NRR than India (0.730) at the moment. The post How Pakistan go to semi finals: How many chances of Pakistan to qualify for semi final of T20 World Cup 2022? appeared first on The SportsRush.","pubDate":"2022-11-03 12:46:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Pakistan keep hopes live by ending South Africa&#039;s unbeaten run","link":"https://www.thestar.com.my/sport/cricket/2022/11/03/cricket-pakistan-keep-hopes-live-by-ending-south-africa039s-unbeaten-run","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) -Pakistan kept alive their slim hopes of reaching the Twenty20 World Cup semi-finals with a 33-run victory over South Africa in a rain-shortened Super 12 match on Thursday, bringing the tournament's only unbeaten record to an end in the process. Read full story","content":"SYDNEY (Reuters) -Pakistan kept alive their slim hopes of reaching the Twenty20 World Cup semi-finals with a 33-run victory over South Africa in a rain-shortened Super 12 match on Thursday, bringing the tournament's only unbeaten record to an end in the process. On the ropes at 43-4 early in their innings, Pakistan rallied behind spectacular half centuries from Iftikhar Ahmed and Shadab Khan to post 185 for nine and delight the lively crowd of 30,000 roaring them on at the Sydney Cricket Ground. South Africa would still have fancied their chances but Shaheen Afridi (3-14) claimed two early wickets and Shadab removed Temba Bavuma and Aiden Markram, who had built a promising third-wicket partnership of 49, in quick order. The skies opened soon afterwards with South Africa on 69-4 after nine overs and an hour later they resumed with a revised target of 142 from five more overs under the Duckworth–Lewis–Stern method only to fall well short at 108 for nine. The Proteas remain in second place behind India in Group 2 despite the loss and will secure one of the two semi-final spots if they beat the Netherlands in their final Super 12 match on Sunday. To have any chance of progressing, Pakistan must beat Bangladesh in Sunday's second match at Adelaide Oval and hope the Dutch have staged an upset or Zimbabwe manage to stun India in the final group match in Melbourne. \"Our first two matches were close losses but we've given 100% in our last two matches,\" said Pakistan skipper Babar Azam. \"Cricket is a funny game, you never know, so we'll hope for the best.\" Pakistan's hopes of reaching the last four were already hanging by a thread coming into the match and they looked over when top order batsmen Mohammad Rizwan, Azam and Shan Masood all departed cheaply. Mohammad Haris, thrown straight into the fray after coming into the squad as an injury replacement for Fakhar Zaman, had, however, showed his team mates the way with a blistering 28 off 11 balls that started with two sixes and a four. Iftikhar, who hit 51, and Shadab, who clubbed 52 off 22 balls, followed his lead with a partnership of 82 for the sixth wicket to transform the innings, which ended with a rain shower, a few boundaries and a flurry of wickets. While Azam's miserable tournament continued with six runs that left his tally at 14 from four innings, his South African counterpart Bavuma shrugged off the early loss of opening partner Quinton de Kock for a duck. Bavuma, whose previous three innings at the tournament had earned him 14 runs, hit a dogged 36 before being caught behind off Shadab's first delivery. Markram was bowled for 20 two balls later and after the rain break seamers Afridi, Mohammad Wasim and Naseem Shah successfully shackled the South Africans while chipping away with regular wickets. \"I think it's quite disappointing the way we finished our bowling effort, there's a lot of questions we need to ask ourselves,\" said Bavuma. (Reporting by Nick Mulvenney, editing by Ken Ferris)","pubDate":"2022-11-03 12:43:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/11/03/1803416.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"}]}