{"newsArray":[{"title":"Why is Nottingham Forest vs Sheffield United not on TV?","link":"https://www.fourfourtwo.com/news/why-is-nottingham-forest-vs-sheffield-united-not-on-tv","keywords":null,"creator":null,"video_url":null,"description":"Nottingham Forest vs Sheffield United is not on TV – and it's all because of… cricket!?","content":"Nottingham Forest vs Sheffield United is not on TV tonight – due to the cricket. The first Friday night football of the Premier League season beckons when Forest host the newly-promoted Blades ahead of the second weekend of the new campaign. Friday night football is usually a Sky staple but this time, it won’t be live on TV in the UK. and will be looking to pick up their first points of the season after opening-day defeats to and respectively and will also mark their first meeting since the 2022 Championship play-off semi-final at the City Ground. Yes – it's because of cricket. The clash was originally scheduled for a standard 3pm kick-off on Saturday 19th August, but due to Nottingham cricket side The Trent Rockets taking on Birmingham Phoenix the same afternoon, concern over heavy congestion in the city meant a move to a Friday night slot. The fixture wasn’t originally scheduled for TV when selections were made, and Premier League rules state that can’t change even if a game is moved to what would be a TV-friendly viewing time for many supporters sat at home on a Friday evening. Sky Sports also already has the live Championship game between and on Friday night, while there is a double helping of live Premier League action on Saturday night. Sky will be showing Ange Postecoglou’s first home game as manager against , immediately followed by the clash between and at 8pm on TNT Sports. You can find out more about the fixture here, with for the game.","pubDate":"2023-08-18 12:00:15","image_url":"https://cdn.mos.cms.futurecdn.net/NFrj5JKt8nn8NgQBNQunqb.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Virat Kohli के अंतर्राष्ट्रीय क्रिकेट में 15 साल पूरे, अब तक उन्होंने किए कई बड़े कारनामा","link":"https://jantaserishta.com/sports/virat-kohli-completes-15-years-in-international-cricket-till-now-he-has-done-many-big-feats-2727068","keywords":["खेल"],"creator":["Harrison"],"video_url":null,"description":null,"content":"विराट कोहली ने 18 अगस्त 2008 को अंतर्राष्ट्रीय क्रिकेट में कदम रखा था।दुनिया के सर्वश्रेष्ठ बल्लेबाजों में से एक विराट कोहली ने श्रीलंका के खिलाफ वनडे मैच से डेब्यू किया था, लेकिन इस सीरीज से पहले वह भारत को ICC U19 क्रिकेट विश्व कप ट्रॉफी दिलाकर इतिहास रच चुके थे। पहले वनडे मैच में विराट कोहली 12 रन बना सके थे, लेकिन आखिरी वनडे मैच में अर्धशतक लगाते हुए सीरीज में उन्होंने 159 रन बनाए। विराट कोहली का सबसे मजबूत फॉर्मेट वनडे है।उन्होंने वनडे फॉर्मेट में 275 मैचों में 57.32 की औसत से 12,898 रन बनाए हैं।उन्होंने 265 पारियों में 46 शतक और 65 अर्धशतक बनाए हैं, जिसमें उनका सर्वश्रेष्ठ स्कोर 183 रन है। वह सचिन के बाद वनडे में दूसरे सबसे ज्यादा रन बनाने वाले बल्लेबाज हैं। वनडे में 150 मैच खेलने के बाद औसत सबसे अधिक है । वो 5,000 वनडे रन बनाने वाले तीसरे सबसे तेज, 6,000 और 7,000 वनडे रन बनाने वाले दूसरे सबसे तेज और 8,000, 9,000, 10,000, 11,000 और 12,000 वनडे रन बनाने वाले सबसे तेज खिलाड़ी हैं। विराट का कप्तान के तौर पर रिकॉर्ड अच्छा रहा, उन्होंने 95 मैचों में टीम का नेतृत्व किया है, जिसमें 65 जीते, 27 हारे, एक बराबरी पर रहा और दो का कोई परिणाम नहीं निकला।विराट कोहली भारत की 2011 वनडे विश्व कप जीत के भी गवाह बने। विराट कोहली ने 2011 में वेस्टइंडीज के खिलाफ टेस्ट डेब्यू किया। इस प्रारूप में उनकी शुरुआत खराब रही । विराट ने 187 टेस्ट पारियों में 49.29 की औसत से 8,676 रन बनाए हैं, जिसमें 29 शतक और 29 अर्द्धशतक शामिल हैं। वहीं उनका सर्वश्रेष्ठ स्कोर 254 रन रहा है। टेस्ट में बतौर कप्तान विराट सफल रहे । विराट ने 68 टेस्ट में भारत का नेतृत्व किया, 40 जीते, 17 हारे और 11 ड्रा रहे।टी 20 अंतर्राष्ट्रीय में भी विराट कोहली का जलवा रहा है।उन्होंने 115 टी 20आई में उन्होंने 52.73 की औसत और 137.96 की स्ट्राइक रेट से 4,0008 रन बनाए हैं ।एक शतक और 37 अर्धशतक उन्होंने जड़े हैं। विराट का सर्वश्रेष्ठ स्कोर 122 रन रहा है।विराट कोहली आईसीसी टी 20 विश्व कप के सर्वकालिक महान खिलाड़ी हैं । टूर्नामेंट 27 मैचों और 25 पारियों में 81.50 की औसत से 131.30 की स्ट्राइक रेट और 14 अर्धशतक के साथ 1,141 रन बना चुके हैं।","pubDate":"2023-08-18 10:48:58","image_url":"https://jantaserishta.com/h-upload/2023/08/18/500x300_3321826-untitled-101-copy.jpg","source_id":"jantaserishta","source_priority":6826860,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Pakistan : विश्वचषकात पाकिस्तान भारताचा पराभव करेल, शोएब अख्तरचं भाकित","link":"https://marathi.abplive.com/sports/cricket/former-pakistani-player-shoaib-akhtar-backs-his-pakistani-team-to-beat-india-in-odi-world-cup-2023-1202297","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"Shoaib Akhtar On India vs Pakistan World Cup Match : भारतात होणाऱ्या विश्वचषकाला 50 दिवसांपेक्षा कमी कालावधी शिल्लक राहिलाय. विश्वचषकातील भारत आणि पाकिस्तान यांच्यातील सामन्याची क्रीडा चाहत्यांना उत्सुकता आहे. भारत आणि पाकिस्तान यांच्यातील रंगतदार सामना 14 ऑक्टोबर रोजी अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर खेळवण्यात येणार आहे. या ब्लॉकबास्टर सामन्यापूर्वी भारत आणि पाकिस्तानमधील माजी खेळाडूंनी आपापली मते व्यक्त करण्यास सुरुवात केली आहे. पाकिस्तानचा माजी वेगवान गोलंदाज शोएब अख्तर याने केलेल्या विधानाची सध्या जोरदार चर्चा सुरु आहे. विश्वचषकात पाकिस्तानचा संघ भारताचा पराभव करेल, असा विश्वास शोएब अख्तर याने व्यक्त केलाय.  विश्वचषकाच्या इतिहासात आतापर्यंत भारताने बाजी मारलेली आहे. वनडे विश्वचषकात पाकिस्तानला आतापर्यंत भारताचा पराभव करता आलेला नाही. मोठ्या सामन्यात दबाव झेलण्याची पाकिस्तानच्या संघाचे मजबूत बाजू असल्याचे शोएबने म्हटलेय. शोएब अख्तर याने रेव स्पोर्ट्स संकेतस्थळाला दिलेल्या मुलाखतीत पाकिस्तानच्या विजयाचा विश्वास व्यक्त केलाय. प्रत्येकवेळा पहिल्यांदा काही ना काही होतेच. भारतीय संघावर वारंवार जिंकण्याचा दबाव आहे. त्यामुळे अशा परिस्थितीत भारताचा पराभव करण्याची पाकिस्तानकडे मोटी संधी असेल, असे शोएब अख्तर म्हणाला.  आशिया चषकात दिसेल ट्रेलर  विश्वचषकात भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. त्यापूर्वी श्रीलंकामध्ये याची रंगीत तालिम पाहायला मिळणार आहे. आशिया चषकामध्ये भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. 2 सप्टेंबर रोजी श्रीलंका येथील पल्लेकेले स्टेडिअमवर भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. आशिया चषक यंदा एकदिवसीय स्वरुपात होणार आहे. भारत आणि पाकिस्तान एकाच ग्रुपमध्ये आहेत. आशिया चषकात भारत आणि पाकिस्तान यांच्यात किमान दोन सामने होतील. पाकिस्तानने आशिया चषकासाठी संघाची घोषणा केली आहे. भारतीय संघाची निवड अद्याप झालेली नाही. भारतीय संघाची निवड 20 ऑगस्ट रोजी होण्याची शक्यता आहे.   विश्वचषक कधीपासून -  भारतात होणारा विश्वचषकाचा पहिला सामना 5 ऑक्टोबर रोजी होणार आहे. गतविजेता इंग्लंड आणि उपविजेता न्यूझीलंड यांच्यात सलामीची लढत होणार आहे. 19 नोव्हेंबर रोजी महाअंतिम सामना रंगणार आहे. विश्वचषकाचा पहिला आणि अखेरचा सामना अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर रंगणार आहे. भारत आणि पाकिस्तान हा हायहोल्टेज सामनाही अहमदाबाद येथेच होणार आहे. यंदाचा विश्वचषक दहा संघामध्ये राऊंड रॉबिन पद्धतीने होणार आहे. प्रत्येक संघाचे कमीतकमी नऊ सामने होणार आहेत.   आणखी वाचा : ODI World Cup : पाकिस्तानी संघाला वर्ल्ड कपचं टेन्शन! भारतात खेळण्याचं दडपण? बाबर आझमच्या टीमसोबत मानसोपचार तज्ज्ञ पाठवण्याचा विचार","content":"Shoaib Akhtar On India vs Pakistan World Cup Match : भारतात होणाऱ्या विश्वचषकाला 50 दिवसांपेक्षा कमी कालावधी शिल्लक राहिलाय. विश्वचषकातील भारत आणि पाकिस्तान यांच्यातील सामन्याची क्रीडा चाहत्यांना उत्सुकता आहे. भारत आणि पाकिस्तान यांच्यातील रंगतदार सामना 14 ऑक्टोबर रोजी अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर खेळवण्यात येणार आहे. या ब्लॉकबास्टर सामन्यापूर्वी भारत आणि पाकिस्तानमधील माजी खेळाडूंनी आपापली मते व्यक्त करण्यास सुरुवात केली आहे. पाकिस्तानचा माजी वेगवान गोलंदाज शोएब अख्तर याने केलेल्या विधानाची सध्या जोरदार चर्चा सुरु आहे. विश्वचषकात पाकिस्तानचा संघ भारताचा पराभव करेल, असा विश्वास शोएब अख्तर याने व्यक्त केलाय. विश्वचषकाच्या इतिहासात आतापर्यंत भारताने बाजी मारलेली आहे. वनडे विश्वचषकात पाकिस्तानला आतापर्यंत भारताचा पराभव करता आलेला नाही. मोठ्या सामन्यात दबाव झेलण्याची पाकिस्तानच्या संघाचे मजबूत बाजू असल्याचे शोएबने म्हटलेय. शोएब अख्तर याने रेव स्पोर्ट्स संकेतस्थळाला दिलेल्या मुलाखतीत पाकिस्तानच्या विजयाचा विश्वास व्यक्त केलाय. प्रत्येकवेळा पहिल्यांदा काही ना काही होतेच. भारतीय संघावर वारंवार जिंकण्याचा दबाव आहे. त्यामुळे अशा परिस्थितीत भारताचा पराभव करण्याची पाकिस्तानकडे मोटी संधी असेल, असे शोएब अख्तर म्हणाला. आशिया चषकात दिसेल ट्रेलर विश्वचषकात भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. त्यापूर्वी श्रीलंकामध्ये याची रंगीत तालिम पाहायला मिळणार आहे. आशिया चषकामध्ये भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. 2 सप्टेंबर रोजी श्रीलंका येथील पल्लेकेले स्टेडिअमवर भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. आशिया चषक यंदा एकदिवसीय स्वरुपात होणार आहे. भारत आणि पाकिस्तान एकाच ग्रुपमध्ये आहेत. आशिया चषकात भारत आणि पाकिस्तान यांच्यात किमान दोन सामने होतील. पाकिस्तानने आशिया चषकासाठी संघाची घोषणा केली आहे. भारतीय संघाची निवड अद्याप झालेली नाही. भारतीय संघाची निवड 20 ऑगस्ट रोजी होण्याची शक्यता आहे. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); विश्वचषक कधीपासून - भारतात होणारा विश्वचषकाचा पहिला सामना 5 ऑक्टोबर रोजी होणार आहे. गतविजेता इंग्लंड आणि उपविजेता न्यूझीलंड यांच्यात सलामीची लढत होणार आहे. 19 नोव्हेंबर रोजी महाअंतिम सामना रंगणार आहे. विश्वचषकाचा पहिला आणि अखेरचा सामना अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर रंगणार आहे. भारत आणि पाकिस्तान हा हायहोल्टेज सामनाही अहमदाबाद येथेच होणार आहे. यंदाचा विश्वचषक दहा संघामध्ये राऊंड रॉबिन पद्धतीने होणार आहे. प्रत्येक संघाचे कमीतकमी नऊ सामने होणार आहेत. आणखी वाचा : ODI World Cup : पाकिस्तानी संघाला वर्ल्ड कपचं टेन्शन! भारतात खेळण्याचं दडपण? बाबर आझमच्या टीमसोबत मानसोपचार तज्ज्ञ पाठवण्याचा विचार","pubDate":"2023-08-18 10:47:56","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2021/07/14/1c9ec73e159c9143c5d532be07d0a6a5_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"बुमराहच्या नेतृत्वात भारतीय संघ सज्ज, कुणाला मिळणार संधी, पाहा भारताचे संभाव्य 11 शिलेदार","link":"https://marathi.abplive.com/sports/cricket/india-vs-ireland-1st-t20-match-probable-playing-11-rinku-singh-may-will-be-debut-1202291","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"India vs Ireland 1st T20: भारत (India) आणि आयर्लंड (Ireland) टी20 मालिकेकडे क्रिकेटप्रेमींचं लक्ष लागलं आहे. आजपासून भारत आणि आयर्लंड  यांच्यातील टी20 मालिकेला सुरुवात होणार आहे. आयर्लंड दौऱ्यावर टीम इंडियाच्या (Team India) सिनियर खेळाडूंना आराम देण्यात आलाय. या मालिकेत युवा खेळाडूंना संधी देण्यात आली आहे. जसप्रीत बुमराहच्या नेतृत्वात भारताचे कोणते शिलेदार मैदानात उतरणार ? याकडे लक्ष लागलेय.  युवा खेळाडूंना संधी -  आयर्लंड दौऱ्यासाठी टीम इंडियात युवा खेळाडूंना संधी देण्यात आली आहे. रिंकू सिंह, यशस्वी जयस्वाल आणि जितेश शर्मा यांना चांगल्या कामगिरीचं बक्षीस मिळाले आहे. या खेळाडूंना आयर्लंड दौऱ्यासाठी टीम इंडियात स्थान मिळाले आहे. त्याशिवाय मुकेश कुमार आणि शाहबाज अहमद, शिवम दुबे यांनाही संधी देण्यात आली आहे. रिंकू सिंहला पदार्पणाची संधी मिळणार? टीम इंडियाने आयर्लंड दौऱ्यासाठी रिंकू सिंहला संधी दिली आहे. त्याला प्लेईंग इलेव्हनमध्ये संधी मिळण्याची शक्यता आहे. रिंकूने सोशल मीडियावर टीम इंडियाच्या जर्सीमधील फोटो शेअर केले आहेत. टीम इंडियासोबतच्या सरावादरम्यानचे हे फोटो आहेत. रिंकूने इंस्टाग्रामवर फोटो शेअर केला आहे, यामध्ये तो टीम इंडियाच्या जर्सीमध्ये दिसत आहे आणि त्याच्या हातामध्ये बॅट आहे. भारताची संभाव्य प्लेईंग 11 :  ऋतुराज गायकवाड, यशस्वी जयसवाल, संजू सॅमसन (विकेटकीपर), तिलक वर्मा, रिंकू सिंह, शिवम दुबे, वाशिंगटन सुंदर, जसप्रीत बुमराह (कर्णधार), रवि बिश्नोई, अर्शदीप सिंह, मुकेश कुमार आयर्लंडची संभाव्य प्लेईंग 11 :  एंड्रयू बालबर्नी, पॉल स्टर्लिंग (कर्णधार), लोर्कन टकर, हॅरी टेक्टर, जॉर्ज डॉकरेल, गॅरेथ डेलानी, कर्टिस कँपर, मार्क अडायर, जोशुआ लिटिल, बॅरी मॅक्कार्थी, बेंजामिन व्हाइट भारत आणि आयर्लंड मालिकाभारत आणि आयर्लंड यांच्यामध्ये तीन सामन्याची टी 20 मालिका खेळवण्यात येणार आहे. भारत आणि आयर्लंड टी-20 मालिका शुक्रवारपासून सुरु होत आहे. 18 ऑगस्ट रोजी डबलिन येथे पहिला टी20 सामना खेळवण्यात येणार आहे. 20 ऑगस्ट रोजी दुसरा आणि 23 ऑगस्ट रोजी तिसरा टी20 सामना रंगणार आहे.   सिनिअर खेळाडूंना आराम -18 ऑगस्टपासून आयर्लंड दौऱ्याला सुरुवात होणार आहे. भारतीय संघ आयर्लंडविरुद्ध तीन टी-20 सामन्यांची मालिका खेळणार आहे. दुसरा ट्वेंटी-ट्वेंटी सामना 20 ऑगस्ट रोजी खेळवला जाईल. मालिकेतील तिसरा आणि शेवटचा सामना 23 ऑगस्ट रोजी होणार आहे. आशिया चषकाच्या पार्श्वभूमीवर बीसीसीआयने आयर्लंड दौऱ्यात सर्व मोठ्या खेळाडूंना विश्रांती देण्याचा निर्णय घेतला आहे. रोहित शर्मा, विराट कोहली, हार्दिक पांड्या, जडेजा, सूर्यकुमार यादव, शुभमन गिल, कुलदीप यादव, युजवेंद्र चहल, मोहम्मद शमी, सिराज हे मोठे खेळाडू या मालिकेत खेळताना दिसणार नाहीत.","content":"India vs Ireland 1st T20: भारत (India) आणि आयर्लंड (Ireland) टी20 मालिकेकडे क्रिकेटप्रेमींचं लक्ष लागलं आहे. आजपासून भारत आणि आयर्लंड यांच्यातील टी20 मालिकेला सुरुवात होणार आहे. आयर्लंड दौऱ्यावर टीम इंडियाच्या (Team India) सिनियर खेळाडूंना आराम देण्यात आलाय. या मालिकेत युवा खेळाडूंना संधी देण्यात आली आहे. जसप्रीत बुमराहच्या नेतृत्वात भारताचे कोणते शिलेदार मैदानात उतरणार ? याकडे लक्ष लागलेय. युवा खेळाडूंना संधी - आयर्लंड दौऱ्यासाठी टीम इंडियात युवा खेळाडूंना संधी देण्यात आली आहे. रिंकू सिंह, यशस्वी जयस्वाल आणि जितेश शर्मा यांना चांगल्या कामगिरीचं बक्षीस मिळाले आहे. या खेळाडूंना आयर्लंड दौऱ्यासाठी टीम इंडियात स्थान मिळाले आहे. त्याशिवाय मुकेश कुमार आणि शाहबाज अहमद, शिवम दुबे यांनाही संधी देण्यात आली आहे. रिंकू सिंहला पदार्पणाची संधी मिळणार? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); टीम इंडियाने आयर्लंड दौऱ्यासाठी रिंकू सिंहला संधी दिली आहे. त्याला प्लेईंग इलेव्हनमध्ये संधी मिळण्याची शक्यता आहे. रिंकूने सोशल मीडियावर टीम इंडियाच्या जर्सीमधील फोटो शेअर केले आहेत. टीम इंडियासोबतच्या सरावादरम्यानचे हे फोटो आहेत. रिंकूने इंस्टाग्रामवर फोटो शेअर केला आहे, यामध्ये तो टीम इंडियाच्या जर्सीमध्ये दिसत आहे आणि त्याच्या हातामध्ये बॅट आहे. भारताची संभाव्य प्लेईंग 11 : ऋतुराज गायकवाड, यशस्वी जयसवाल, संजू सॅमसन (विकेटकीपर), तिलक वर्मा, रिंकू सिंह, शिवम दुबे, वाशिंगटन सुंदर, जसप्रीत बुमराह (कर्णधार), रवि बिश्नोई, अर्शदीप सिंह, मुकेश कुमार आयर्लंडची संभाव्य प्लेईंग 11 : एंड्रयू बालबर्नी, पॉल स्टर्लिंग (कर्णधार), लोर्कन टकर, हॅरी टेक्टर, जॉर्ज डॉकरेल, गॅरेथ डेलानी, कर्टिस कँपर, मार्क अडायर, जोशुआ लिटिल, बॅरी मॅक्कार्थी, बेंजामिन व्हाइट भारत आणि आयर्लंड मालिका भारत आणि आयर्लंड यांच्यामध्ये तीन सामन्याची टी 20 मालिका खेळवण्यात येणार आहे. भारत आणि आयर्लंड टी-20 मालिका शुक्रवारपासून सुरु होत आहे. 18 ऑगस्ट रोजी डबलिन येथे पहिला टी20 सामना खेळवण्यात येणार आहे. 20 ऑगस्ट रोजी दुसरा आणि 23 ऑगस्ट रोजी तिसरा टी20 सामना रंगणार आहे. सिनिअर खेळाडूंना आराम - 18 ऑगस्टपासून आयर्लंड दौऱ्याला सुरुवात होणार आहे. भारतीय संघ आयर्लंडविरुद्ध तीन टी-20 सामन्यांची मालिका खेळणार आहे. दुसरा ट्वेंटी-ट्वेंटी सामना 20 ऑगस्ट रोजी खेळवला जाईल. मालिकेतील तिसरा आणि शेवटचा सामना 23 ऑगस्ट रोजी होणार आहे. आशिया चषकाच्या पार्श्वभूमीवर बीसीसीआयने आयर्लंड दौऱ्यात सर्व मोठ्या खेळाडूंना विश्रांती देण्याचा निर्णय घेतला आहे. रोहित शर्मा, विराट कोहली, हार्दिक पांड्या, जडेजा, सूर्यकुमार यादव, शुभमन गिल, कुलदीप यादव, युजवेंद्र चहल, मोहम्मद शमी, सिराज हे मोठे खेळाडू या मालिकेत खेळताना दिसणार नाहीत.","pubDate":"2023-08-18 10:32:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/18/e18d49efe032295c10cceaf06ca842041692353799723143_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"Chance for World No.1 Babar Azam to improve his not-so-great Asia Cup record","link":"https://www.indiatoday.in/sports/cricket/video/chance-for-world-no1-babar-azam-to-improve-his-not-so-great-asia-cup-record-2423115-2023-08-18?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chance for World No.1 Babar Azam to improve his not-so-great Asia Cup record","content":"Babar Azam will be Pakistan's key player as they get set for the Asia Cup and look forward to this year's World Cup. The Pakistan skipper will be looking to improve on his record in the tournament and be amongst the runs this time around. A journalist was shot dead by some unidentified men in Bihar’s Araria on Friday. Abhishek Bachchan turns coach in 'Ghoomer,' also starring Saiyami Kher. In an exclusive chat with India Today's Bhavna Agarwal, the duo spoke about the movie.","pubDate":"2023-08-18 10:25:34","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"title":"How can I watch TNT Sports? BT Sport rebrand explained","link":"https://www.independent.co.uk/sport/tnt-sports-what-is-bt-sport-why-b2391899.html","keywords":["Sport"],"creator":["Harry Latham-Coyle"],"video_url":null,"description":"BT Sport’s renaming follows a merger with Eurosport-owners Warner Bros Discovery","content":"TNT Sports has arrived on television screens in the United Kingdom with the channel’s rebrand fom BT Sport complete, with the new season of Premier League and Champions League football, as well as Premiership Rugby, to be shown on the channel. The renaming follows the purchase of BT Sport by Warner Bros Discovery, which also owns Eurosport . In time, the two channels will be brought together under the TNT Sports brand, with fans able to watch top football, rugby, tennis and Olympic sport action all under one banner. For now, though, Eurosport will remain distinct - the channel is the lead rightsholder for the Paris 2024 Olympics in the UK and Ireland. But what does this mean for subscribers, and what is TNT Sports? What was BT Sport and what sports did the channel show? Launched in August 2013, BT Sport is a group of paid television sports channels available in the UK and Republic of Ireland. It shows sports including Premier League and Champions League football, Premiership and Champions Cup rugby, cricket from Australia and New Zealand and MotoGP. What is Warner Bros Discovery and when was a merger agreed? Warner Bros Discovery (WBD) and BT Group announced last year that they had reached an agreement to form a joint venture that will eventually merge the Eurosport and BT Sport channels and portfolios. Warner Bros Discovery is a multinational mass media conglomerate that operates many of the world’s biggest television brands, including CNN and HBO. What is TNT Sports? TNT Sports will be a familiar brand to those in Latin America, where it is the home of top-level domestic and European football. From July 2023, the channel will now have a dedicated brand in the UK and Ireland ahead of the start of the 2023/24 football season. “The TNT Sports name is already synonymous with premium live sports in a number of countries around the world and a further sign of the global scale and expertise that WBD brings to the partnership with BT,” Andrew Georgiou, managing director of WBD Sports Europe, explained of the decision to rebrand. What does this mean for former BT Sport subscribers? For television viewers, BT Sport has become TNT Sports, with no new channel to tune in to. For those who watched regularly via the BT Sport app, discovery+ will be the new live streaming home of the rebranded channel. Fans wanting to subscribe to TNT Sports directly through discovery+ will have to pay £29.99 per month, the same as was previously charged for the BT Sport Monthly Pass - this will include access to Eurosport and the platform’s entertainment offerings. What sports will I be able to watch on the new channel after the merger is complete? The merger will allow sports fans to watch many of the world’s biggest sporting events all under one channel banner. These include: the Olympic Games, the Premier League, Champions League, Europa League, Premiership Rugby, MotoGP, UFC, Boxing, WWE, tennis Grand Slams, cycling Grand Tours and the winter sports season.","pubDate":"2023-08-18 10:18:03","image_url":"https://static.independent.co.uk/2021/04/19/16/GettyImages-1182719731.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sophie Ecclestone rested for Sri Lanka series as England turn to Gaur and Heath","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-heather-knight-lewis-australia-b2395318.html","keywords":["Cricket","Sport"],"creator":["George Sessions"],"video_url":null,"description":"England have opted to rest several key players ahead of a busy 12-month period with the T20 World Cup next year.","content":"England have handed maiden call-ups to Mahika Gaur and Bess Heath for the upcoming white-ball series with Sri Lanka but rested four key players including Sophie Ecclestone. Jon Lewis’ side will bring an enthralling summer to an end when they play three IT20s and three ODIs against Sri Lanka between August 31 and September 14. After beating Australia in both white-ball series last month, England turn their attention to Sri Lanka but will be without Ecclestone and Sophia Dunkley for the entire series, while Danni Wyatt will only play in the T20s and Nat Sciver-Brunt is only part of the ODI group. Fast bowler Gaur has benefited from this rotation and in the process will commit her international future to England after being selected in both white-ball squads. Gaur, 17, has represented United Arab Emirates in 19 T20 internationals but is set to make her debut for England after a fine summer where she helped North West Thunder make the Charlotte Edwards Cup Finals Day and, more recently, has caught the eye for Manchester Originals. Heath hit 41 for England A against Australia A earlier this summer and is selected in both groups following a consistent run of form over the past year. Freya Kemp is also back in the 20-over squad after she recovered from a stress fracture to her back and Lauren Filer has received her first IT20 call-up following a starring red-ball role against Australia in the one-off Test in June. Captain Heather Knight and her team will begin the IT20 series at a sold-out Hove on August 31. Head coach Lewis said: “We have named a squad with a good blend of youth and experience and see this as an important series to test the depth of our playing pool. “We have some exciting, new young players coming in who we are looking forward to working with. “Mahika is a very exciting talent. Left-arm swing bowlers of over six-foot tall are unique in women’s cricket. “Mahika has shown consistently this summer that she is a threat with the new ball and we are excited to see how she performs at international level. “Bess is an all-action cricketer who impacts games and is a great fit for us and how we want to play. “She impressed in the A team games against Australia earlier in the summer and she also provides cover for Amy Jones with the gloves. “With a World Cup coming up next year, it’s imperative we develop the squad and players can gain international caps and experience. “The chance to play at venues around the country is exciting. It’s great the opening fixture against Sri Lanka at Hove is now sold out. “After an incredible Ashes summer, we want to maintain momentum on and off the field and look forward to getting started.” England Women’s IT20 squad: Knight (captain), Bell, Bouchier, Capsey, Cross, Dean, Filer, Gaur, Gibson, Glenn, Heath, Jones, Kemp, Wong, Wyatt. England Women’s ODI squad: Knight (captain), Beaumont, Bell, Bouchier, Capsey, Cross, Dean, Filer, Gaur, Gibson, Glenn, Heath, Jones, Lamb, Sciver-Brunt,","pubDate":"2023-08-18 10:00:53","image_url":"https://static.independent.co.uk/2023/08/18/11/cac430811f466e36fc13d7c39158e805Y29udGVudHNlYXJjaGFwaSwxNjkyNDM2Mzk0-2.72972639.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Steve Smith, Mitchell Starc ruled out of South Africa Tour, Mitchell Marsh to lead in ODIs","link":"https://www.indiatvnews.com/sports/cricket/steve-smith-mitchell-starc-ruled-out-of-australia-tour-of-south-africa-mitchell-marsh-to-lead-in-odis-pat-cummins-2023-08-18-887431","keywords":null,"creator":null,"video_url":null,"description":"Australian star players Steve Smith and Mitchell Starc have been ruled out of the complete South Africa tour as the duo have suffered injuries, Cricket Australia confirmed on Friday. Australia travel to South Africa for T20Is and ODIs as they prepare for the ODI World Cup in India. Moreover, Mitchell Marsh has been appointed the ODI captain for the series as Pat Cummins would be on the sidelines too.","content":"Australian star players and Mitchell Starc have been ruled out of the complete South Africa tour as the duo have suffered injuries, Cricket Australia confirmed on Friday. Australia travel to South Africa for T20Is and ODIs as they prepare for the ODI World Cup in India. Moreover, Mitchell Marsh has been appointed the ODI captain for the series as would be on the sidelines too. It has been revealed that Smith is nursing a tendon injury to his left wrist and will be out for four weeks. Meanwhile, Starc experienced groin soreness after the WTC Final and series. The duo are expected to be fit for the ODI World Cup in India. Cricket Australia's chief selector George Bailey opened on the duo. \"The compacted Ashes series and the World Test Championship was a heavy load for the group, and we are taking a conservative approach to the build-up to the World Cup,\" he said on Friday. Meanwhile, Smith and Starc's exit has given Marnus Labuschagne a reprieve in the ODIs. The right-hand batter has been added to Australia's ODI squad after being axed from the 50-over team when Australia named its squad for the South Africa series and an initial one for the ODI World Cup. Labuschagne has struggled for runs in the format, scoring 847 runs in 30 matches at an average of 31. Notably, Bailey expects the duo will be back in action for the three-match ODI series in India which starts from September 22 onwards. \"With the World Cup the priority of the squad, it was determined on advice that it was best for Steve and Mitchell to join the group in India by which time we expect them to be fully fit and available for the Indian ODI series, plus the World Cup warm-up fixture,\" he added. The Board has also made Marsh the captain for the ODIs after being promoted as the T20I captain for the Proteas series. Cummins confirmed he will not be part of the complete tour as he is recovering from a wrist fracture. Marsh will lead Australia in his absence. Mitchell Marsh (c), Sean Abbott, , Tim David, Nathan Ellis, Aaron Hardie, Travis Head, Josh Inglis, Spencer Johnson, , Matt Short, , , Mitchell Marsh (c), Sean Abbott, Ashton Agar, , Pat Cummins, Nathan Ellis, Cameron Green, Aaron Hardie, Josh Hazlewood, Travis Head, Josh Inglis, Spencer Johnson, Marnus Labuschagne, Glenn Maxwell, Tanveer Sangha, Marcus Stoinis, David Warner, Adam Zampa","pubDate":"2023-08-18 08:42:03","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Adam Zampa, Mitchell Marsh will be vital to Australia’s chances in World Cup: Mike Hussey","link":"https://indianexpress.com/article/sports/cricket/adam-zampa-mitchell-marsh-will-be-vital-to-australias-chances-in-world-cup-mike-hussey-8898221/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Former Australian cricketer Mike Hussey believes spinner Adam Zampa and all-rounder Mitchell Marsh will play a crucial role in the team’s bid to clinch the World Cup in India later this year. Leg-spinner Zampa, 31, was first picked in Australia’s limited-overs squad in 2016 and since then has played 79 ODIs taking 131 wickets. With Indian conditions expected to favour spin bowling, Hussey believes Zampa would be the go-to bowler for Pat Cummins’ side. The wrist spinner with a skidding stock delivery played a vital role in Australia’s maiden T20 World Cup triumph in the UAE in 2021, finishing with 13 wickets at an economy rate of just 5.81. “Adam Zampa could play a big role for Australia throughout the tournament,” said Hussey on Friday. “He has been really good over the last few years.” The former cricketer added that the confidence with which Marsh is playing, he could have an enormous impact on the team’s fortunes. “And I think Mitch Marsh is someone that can certainly have a big impact. He has been given a great role, batting in the top three now and he is playing with enormous confidence. So, if he gets his confidence up, he can be a really tough man to stop.” Hussey was part of the Australia side that lifted the 50-over World Cup in 2007 in the West Indies and more recently was part of England’s coaching setup during their winning campaign in the T20 World Cup last year. He also cautioned that Australia will require the services of seniors like Steve Smith to supplement the efforts of Zampa and Marsh. Advertisement “You can’t rely on just one or two key players to win you a World Cup and it’s going to take a collective effort. But I think for Australia to do really well, they need their big guns to really step up and I guess when you think of that, you think of Steve Smith and Pat Cummins.” The 48-year-old also believes Australia will be leading contenders for the World Cup, scheduled to commence on October 5, as the side has “got a bit of continuity as well”. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More “I think Australia’s got a great chance as they have kept a (large) group of players together for a period of time now. They all know their roles pretty well and they’ve got a bit of continuity in their team as well.” Even though Australia were bundled out of the 2019 edition of the World Cup by eventual champions England, Hussey feels their chances of success are high because they keep trying to explore new methods to win. “I think they’ve been trying a few little different things. They performed well in the series (in March) against India in Indian conditions and that will give them enormous confidence coming into the World Cup.” Australia defeated India 2-1 in the three-match ODI series. Also Read India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE PCB should delete the video and apologise: Wasim Akram slams Pakistan Cri... Is this the beginning of the end? Dean Elgar laments Cricket South Africa... ‘Never thought it was all over’: Jasprit Bumrah says he is ready for Worl... Advertisement Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more “And Australia has a great history in World Cup events. So, I know they will be very determined to do extremely well. There’s so many great teams. It’s hard to pick a favourite but I think Australia will give themselves a big chance to be right up there.” Australia were the first to announce their squad for the World Cup, with the five-time champions leaving out star batter Marnus Labuschagne and including uncapped spinner Tanveer Sangha in the group of 18 players, which will be pruned down to 15 prior to the cut-off date on September 28.","pubDate":"2023-08-18 08:38:46","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Ireland 1st T20I: From Pitch reports to records, all you need to know about The Village, Malahide","link":"https://www.indiatvnews.com/sports/cricket/india-vs-ireland-1st-t20i-from-pitch-reports-to-records-all-you-need-to-know-about-the-village-in-malahide-2023-08-18-887428","keywords":null,"creator":null,"video_url":null,"description":"Team India will be up against Ireland in the T20I series opener at The Village in Malahide on Friday, August 18. For India, the biggest news is Jasprit Bumrah's return and the speedster will be seen leading the troops on the field. The visitors have picked a bunch of youngsters in their side for the series and, likely, some of the players who have already made a name for themselves in India's domestic circuit, including the Indian Premier League will get an opportunity in the series.","content":"Team India will be up against Ireland in the T20I series opener at The Village in Malahide on Friday, August 18. For India, the biggest news is 's return and the speedster will be seen leading the troops on the field. The visitors have picked a bunch of youngsters in their side for the series and, likely, some of the players who have already made a name for themselves in India's domestic circuit, including the Indian Premier League will get an opportunity in the series. For Ireland, it is a chance to test themselves against one of the best outfits and surprise them in their backyard. Ireland would love to improve their record against the Men in Blue as they haven't managed to win a single game against them in the shortest format. The first fixture of the three-match T20I series between the two countries will be played at The Village in Malahide on Friday, August 18 and the remaining two will also be played out at the same venue. Total T20I Matches - 21 Matches won batting first - 8 Matches won bowling first - 13 The wicket at The Village is considered pacer-friendly as the quicks have claimed 132 wickets in the T20Is that have been played at the venue, while spinners have snared 59 wickets to their credit. Hence, it won't be surprising if both teams head into the contest with a pace-heavy look. Paul Stirling (c), Andrew Balbirnie, Lorcan Tucker (wk), Harry Tector, Curtis Campher, George Dockrell, Mark Adair, Barry McCarthy, Fionn Hand, Craig Young, Josh Little, Ben White, Theo van Woerkom, Gareth Delany, Ross Adair Yashasvi Jaiswal, Ruturaj Gaikwad, Tilak Varma, Rinku Singh, Sanju Samson, Jitesh Sharma, Shivam Dube, Washington Sundar, Shahbaz Ahmed, Arshdeep Singh, Ravi Bishnoi, Jasprit Bumrah (c), Prasidh Krishna, Mukesh Kumar, Avesh Khan","pubDate":"2023-08-18 08:30:55","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Nottingham Forest vs Sheffield United not on TV?","link":"https://www.fourfourtwo.com/news/why-is-nottingham-forest-vs-sheffield-united-not-on-tv","keywords":null,"creator":null,"video_url":null,"description":"Nottingham Forest vs Sheffield United is not on TV – and it's all because of… cricket!?","content":"Nottingham Forest vs Sheffield United is not on TV tonight – due to the cricket. The first Friday night football of the Premier League season beckons when Forest host the newly-promoted Blades ahead of the second weekend of the new campaign. Friday night football is usually a Sky staple but this time, it won’t be live on TV in the UK. and will be looking to pick up their first points of the season after opening-day defeats to and respectively and will also mark their first meeting since the 2022 Championship play-off semi-final at the City Ground. Yes – it's because of cricket. The clash was originally scheduled for a standard 3pm kick-off on Saturday 19th August, but due to Nottingham cricket side The Trent Rockets taking on Birmingham Phoenix the same afternoon, concern over heavy congestion in the city meant a move to a Friday night slot. The fixture wasn’t originally scheduled for TV when selections were made, and Premier League rules state that can’t change even if a game is moved to what would be a TV-friendly viewing time for many supporters sat at home on a Friday evening. Sky Sports also already has the live Championship game between and on Friday night, while there is a double helping of live Premier League action on Saturday night. Sky will be showing Ange Postecoglou’s first home game as manager against , immediately followed by the clash between and at 8pm on TNT Sports. You can find out more about the fixture here, with for the game.","pubDate":"2023-08-18 12:00:15","image_url":"https://cdn.mos.cms.futurecdn.net/NFrj5JKt8nn8NgQBNQunqb.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Virat Kohli के अंतर्राष्ट्रीय क्रिकेट में 15 साल पूरे, अब तक उन्होंने किए कई बड़े कारनामा","link":"https://jantaserishta.com/sports/virat-kohli-completes-15-years-in-international-cricket-till-now-he-has-done-many-big-feats-2727068","keywords":["खेल"],"creator":["Harrison"],"video_url":null,"description":null,"content":"विराट कोहली ने 18 अगस्त 2008 को अंतर्राष्ट्रीय क्रिकेट में कदम रखा था।दुनिया के सर्वश्रेष्ठ बल्लेबाजों में से एक विराट कोहली ने श्रीलंका के खिलाफ वनडे मैच से डेब्यू किया था, लेकिन इस सीरीज से पहले वह भारत को ICC U19 क्रिकेट विश्व कप ट्रॉफी दिलाकर इतिहास रच चुके थे। पहले वनडे मैच में विराट कोहली 12 रन बना सके थे, लेकिन आखिरी वनडे मैच में अर्धशतक लगाते हुए सीरीज में उन्होंने 159 रन बनाए। विराट कोहली का सबसे मजबूत फॉर्मेट वनडे है।उन्होंने वनडे फॉर्मेट में 275 मैचों में 57.32 की औसत से 12,898 रन बनाए हैं।उन्होंने 265 पारियों में 46 शतक और 65 अर्धशतक बनाए हैं, जिसमें उनका सर्वश्रेष्ठ स्कोर 183 रन है। वह सचिन के बाद वनडे में दूसरे सबसे ज्यादा रन बनाने वाले बल्लेबाज हैं। वनडे में 150 मैच खेलने के बाद औसत सबसे अधिक है । वो 5,000 वनडे रन बनाने वाले तीसरे सबसे तेज, 6,000 और 7,000 वनडे रन बनाने वाले दूसरे सबसे तेज और 8,000, 9,000, 10,000, 11,000 और 12,000 वनडे रन बनाने वाले सबसे तेज खिलाड़ी हैं। विराट का कप्तान के तौर पर रिकॉर्ड अच्छा रहा, उन्होंने 95 मैचों में टीम का नेतृत्व किया है, जिसमें 65 जीते, 27 हारे, एक बराबरी पर रहा और दो का कोई परिणाम नहीं निकला।विराट कोहली भारत की 2011 वनडे विश्व कप जीत के भी गवाह बने। विराट कोहली ने 2011 में वेस्टइंडीज के खिलाफ टेस्ट डेब्यू किया। इस प्रारूप में उनकी शुरुआत खराब रही । विराट ने 187 टेस्ट पारियों में 49.29 की औसत से 8,676 रन बनाए हैं, जिसमें 29 शतक और 29 अर्द्धशतक शामिल हैं। वहीं उनका सर्वश्रेष्ठ स्कोर 254 रन रहा है। टेस्ट में बतौर कप्तान विराट सफल रहे । विराट ने 68 टेस्ट में भारत का नेतृत्व किया, 40 जीते, 17 हारे और 11 ड्रा रहे।टी 20 अंतर्राष्ट्रीय में भी विराट कोहली का जलवा रहा है।उन्होंने 115 टी 20आई में उन्होंने 52.73 की औसत और 137.96 की स्ट्राइक रेट से 4,0008 रन बनाए हैं ।एक शतक और 37 अर्धशतक उन्होंने जड़े हैं। विराट का सर्वश्रेष्ठ स्कोर 122 रन रहा है।विराट कोहली आईसीसी टी 20 विश्व कप के सर्वकालिक महान खिलाड़ी हैं । टूर्नामेंट 27 मैचों और 25 पारियों में 81.50 की औसत से 131.30 की स्ट्राइक रेट और 14 अर्धशतक के साथ 1,141 रन बना चुके हैं।","pubDate":"2023-08-18 10:48:58","image_url":"https://jantaserishta.com/h-upload/2023/08/18/500x300_3321826-untitled-101-copy.jpg","source_id":"jantaserishta","source_priority":6826860,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Pakistan : विश्वचषकात पाकिस्तान भारताचा पराभव करेल, शोएब अख्तरचं भाकित","link":"https://marathi.abplive.com/sports/cricket/former-pakistani-player-shoaib-akhtar-backs-his-pakistani-team-to-beat-india-in-odi-world-cup-2023-1202297","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"Shoaib Akhtar On India vs Pakistan World Cup Match : भारतात होणाऱ्या विश्वचषकाला 50 दिवसांपेक्षा कमी कालावधी शिल्लक राहिलाय. विश्वचषकातील भारत आणि पाकिस्तान यांच्यातील सामन्याची क्रीडा चाहत्यांना उत्सुकता आहे. भारत आणि पाकिस्तान यांच्यातील रंगतदार सामना 14 ऑक्टोबर रोजी अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर खेळवण्यात येणार आहे. या ब्लॉकबास्टर सामन्यापूर्वी भारत आणि पाकिस्तानमधील माजी खेळाडूंनी आपापली मते व्यक्त करण्यास सुरुवात केली आहे. पाकिस्तानचा माजी वेगवान गोलंदाज शोएब अख्तर याने केलेल्या विधानाची सध्या जोरदार चर्चा सुरु आहे. विश्वचषकात पाकिस्तानचा संघ भारताचा पराभव करेल, असा विश्वास शोएब अख्तर याने व्यक्त केलाय.  विश्वचषकाच्या इतिहासात आतापर्यंत भारताने बाजी मारलेली आहे. वनडे विश्वचषकात पाकिस्तानला आतापर्यंत भारताचा पराभव करता आलेला नाही. मोठ्या सामन्यात दबाव झेलण्याची पाकिस्तानच्या संघाचे मजबूत बाजू असल्याचे शोएबने म्हटलेय. शोएब अख्तर याने रेव स्पोर्ट्स संकेतस्थळाला दिलेल्या मुलाखतीत पाकिस्तानच्या विजयाचा विश्वास व्यक्त केलाय. प्रत्येकवेळा पहिल्यांदा काही ना काही होतेच. भारतीय संघावर वारंवार जिंकण्याचा दबाव आहे. त्यामुळे अशा परिस्थितीत भारताचा पराभव करण्याची पाकिस्तानकडे मोटी संधी असेल, असे शोएब अख्तर म्हणाला.  आशिया चषकात दिसेल ट्रेलर  विश्वचषकात भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. त्यापूर्वी श्रीलंकामध्ये याची रंगीत तालिम पाहायला मिळणार आहे. आशिया चषकामध्ये भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. 2 सप्टेंबर रोजी श्रीलंका येथील पल्लेकेले स्टेडिअमवर भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. आशिया चषक यंदा एकदिवसीय स्वरुपात होणार आहे. भारत आणि पाकिस्तान एकाच ग्रुपमध्ये आहेत. आशिया चषकात भारत आणि पाकिस्तान यांच्यात किमान दोन सामने होतील. पाकिस्तानने आशिया चषकासाठी संघाची घोषणा केली आहे. भारतीय संघाची निवड अद्याप झालेली नाही. भारतीय संघाची निवड 20 ऑगस्ट रोजी होण्याची शक्यता आहे.   विश्वचषक कधीपासून -  भारतात होणारा विश्वचषकाचा पहिला सामना 5 ऑक्टोबर रोजी होणार आहे. गतविजेता इंग्लंड आणि उपविजेता न्यूझीलंड यांच्यात सलामीची लढत होणार आहे. 19 नोव्हेंबर रोजी महाअंतिम सामना रंगणार आहे. विश्वचषकाचा पहिला आणि अखेरचा सामना अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर रंगणार आहे. भारत आणि पाकिस्तान हा हायहोल्टेज सामनाही अहमदाबाद येथेच होणार आहे. यंदाचा विश्वचषक दहा संघामध्ये राऊंड रॉबिन पद्धतीने होणार आहे. प्रत्येक संघाचे कमीतकमी नऊ सामने होणार आहेत.   आणखी वाचा : ODI World Cup : पाकिस्तानी संघाला वर्ल्ड कपचं टेन्शन! भारतात खेळण्याचं दडपण? बाबर आझमच्या टीमसोबत मानसोपचार तज्ज्ञ पाठवण्याचा विचार","content":"Shoaib Akhtar On India vs Pakistan World Cup Match : भारतात होणाऱ्या विश्वचषकाला 50 दिवसांपेक्षा कमी कालावधी शिल्लक राहिलाय. विश्वचषकातील भारत आणि पाकिस्तान यांच्यातील सामन्याची क्रीडा चाहत्यांना उत्सुकता आहे. भारत आणि पाकिस्तान यांच्यातील रंगतदार सामना 14 ऑक्टोबर रोजी अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर खेळवण्यात येणार आहे. या ब्लॉकबास्टर सामन्यापूर्वी भारत आणि पाकिस्तानमधील माजी खेळाडूंनी आपापली मते व्यक्त करण्यास सुरुवात केली आहे. पाकिस्तानचा माजी वेगवान गोलंदाज शोएब अख्तर याने केलेल्या विधानाची सध्या जोरदार चर्चा सुरु आहे. विश्वचषकात पाकिस्तानचा संघ भारताचा पराभव करेल, असा विश्वास शोएब अख्तर याने व्यक्त केलाय. विश्वचषकाच्या इतिहासात आतापर्यंत भारताने बाजी मारलेली आहे. वनडे विश्वचषकात पाकिस्तानला आतापर्यंत भारताचा पराभव करता आलेला नाही. मोठ्या सामन्यात दबाव झेलण्याची पाकिस्तानच्या संघाचे मजबूत बाजू असल्याचे शोएबने म्हटलेय. शोएब अख्तर याने रेव स्पोर्ट्स संकेतस्थळाला दिलेल्या मुलाखतीत पाकिस्तानच्या विजयाचा विश्वास व्यक्त केलाय. प्रत्येकवेळा पहिल्यांदा काही ना काही होतेच. भारतीय संघावर वारंवार जिंकण्याचा दबाव आहे. त्यामुळे अशा परिस्थितीत भारताचा पराभव करण्याची पाकिस्तानकडे मोटी संधी असेल, असे शोएब अख्तर म्हणाला. आशिया चषकात दिसेल ट्रेलर विश्वचषकात भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. त्यापूर्वी श्रीलंकामध्ये याची रंगीत तालिम पाहायला मिळणार आहे. आशिया चषकामध्ये भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. 2 सप्टेंबर रोजी श्रीलंका येथील पल्लेकेले स्टेडिअमवर भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. आशिया चषक यंदा एकदिवसीय स्वरुपात होणार आहे. भारत आणि पाकिस्तान एकाच ग्रुपमध्ये आहेत. आशिया चषकात भारत आणि पाकिस्तान यांच्यात किमान दोन सामने होतील. पाकिस्तानने आशिया चषकासाठी संघाची घोषणा केली आहे. भारतीय संघाची निवड अद्याप झालेली नाही. भारतीय संघाची निवड 20 ऑगस्ट रोजी होण्याची शक्यता आहे. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); विश्वचषक कधीपासून - भारतात होणारा विश्वचषकाचा पहिला सामना 5 ऑक्टोबर रोजी होणार आहे. गतविजेता इंग्लंड आणि उपविजेता न्यूझीलंड यांच्यात सलामीची लढत होणार आहे. 19 नोव्हेंबर रोजी महाअंतिम सामना रंगणार आहे. विश्वचषकाचा पहिला आणि अखेरचा सामना अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर रंगणार आहे. भारत आणि पाकिस्तान हा हायहोल्टेज सामनाही अहमदाबाद येथेच होणार आहे. यंदाचा विश्वचषक दहा संघामध्ये राऊंड रॉबिन पद्धतीने होणार आहे. प्रत्येक संघाचे कमीतकमी नऊ सामने होणार आहेत. आणखी वाचा : ODI World Cup : पाकिस्तानी संघाला वर्ल्ड कपचं टेन्शन! भारतात खेळण्याचं दडपण? बाबर आझमच्या टीमसोबत मानसोपचार तज्ज्ञ पाठवण्याचा विचार","pubDate":"2023-08-18 10:47:56","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2021/07/14/1c9ec73e159c9143c5d532be07d0a6a5_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"बुमराहच्या नेतृत्वात भारतीय संघ सज्ज, कुणाला मिळणार संधी, पाहा भारताचे संभाव्य 11 शिलेदार","link":"https://marathi.abplive.com/sports/cricket/india-vs-ireland-1st-t20-match-probable-playing-11-rinku-singh-may-will-be-debut-1202291","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"India vs Ireland 1st T20: भारत (India) आणि आयर्लंड (Ireland) टी20 मालिकेकडे क्रिकेटप्रेमींचं लक्ष लागलं आहे. आजपासून भारत आणि आयर्लंड  यांच्यातील टी20 मालिकेला सुरुवात होणार आहे. आयर्लंड दौऱ्यावर टीम इंडियाच्या (Team India) सिनियर खेळाडूंना आराम देण्यात आलाय. या मालिकेत युवा खेळाडूंना संधी देण्यात आली आहे. जसप्रीत बुमराहच्या नेतृत्वात भारताचे कोणते शिलेदार मैदानात उतरणार ? याकडे लक्ष लागलेय.  युवा खेळाडूंना संधी -  आयर्लंड दौऱ्यासाठी टीम इंडियात युवा खेळाडूंना संधी देण्यात आली आहे. रिंकू सिंह, यशस्वी जयस्वाल आणि जितेश शर्मा यांना चांगल्या कामगिरीचं बक्षीस मिळाले आहे. या खेळाडूंना आयर्लंड दौऱ्यासाठी टीम इंडियात स्थान मिळाले आहे. त्याशिवाय मुकेश कुमार आणि शाहबाज अहमद, शिवम दुबे यांनाही संधी देण्यात आली आहे. रिंकू सिंहला पदार्पणाची संधी मिळणार? टीम इंडियाने आयर्लंड दौऱ्यासाठी रिंकू सिंहला संधी दिली आहे. त्याला प्लेईंग इलेव्हनमध्ये संधी मिळण्याची शक्यता आहे. रिंकूने सोशल मीडियावर टीम इंडियाच्या जर्सीमधील फोटो शेअर केले आहेत. टीम इंडियासोबतच्या सरावादरम्यानचे हे फोटो आहेत. रिंकूने इंस्टाग्रामवर फोटो शेअर केला आहे, यामध्ये तो टीम इंडियाच्या जर्सीमध्ये दिसत आहे आणि त्याच्या हातामध्ये बॅट आहे. भारताची संभाव्य प्लेईंग 11 :  ऋतुराज गायकवाड, यशस्वी जयसवाल, संजू सॅमसन (विकेटकीपर), तिलक वर्मा, रिंकू सिंह, शिवम दुबे, वाशिंगटन सुंदर, जसप्रीत बुमराह (कर्णधार), रवि बिश्नोई, अर्शदीप सिंह, मुकेश कुमार आयर्लंडची संभाव्य प्लेईंग 11 :  एंड्रयू बालबर्नी, पॉल स्टर्लिंग (कर्णधार), लोर्कन टकर, हॅरी टेक्टर, जॉर्ज डॉकरेल, गॅरेथ डेलानी, कर्टिस कँपर, मार्क अडायर, जोशुआ लिटिल, बॅरी मॅक्कार्थी, बेंजामिन व्हाइट भारत आणि आयर्लंड मालिकाभारत आणि आयर्लंड यांच्यामध्ये तीन सामन्याची टी 20 मालिका खेळवण्यात येणार आहे. भारत आणि आयर्लंड टी-20 मालिका शुक्रवारपासून सुरु होत आहे. 18 ऑगस्ट रोजी डबलिन येथे पहिला टी20 सामना खेळवण्यात येणार आहे. 20 ऑगस्ट रोजी दुसरा आणि 23 ऑगस्ट रोजी तिसरा टी20 सामना रंगणार आहे.   सिनिअर खेळाडूंना आराम -18 ऑगस्टपासून आयर्लंड दौऱ्याला सुरुवात होणार आहे. भारतीय संघ आयर्लंडविरुद्ध तीन टी-20 सामन्यांची मालिका खेळणार आहे. दुसरा ट्वेंटी-ट्वेंटी सामना 20 ऑगस्ट रोजी खेळवला जाईल. मालिकेतील तिसरा आणि शेवटचा सामना 23 ऑगस्ट रोजी होणार आहे. आशिया चषकाच्या पार्श्वभूमीवर बीसीसीआयने आयर्लंड दौऱ्यात सर्व मोठ्या खेळाडूंना विश्रांती देण्याचा निर्णय घेतला आहे. रोहित शर्मा, विराट कोहली, हार्दिक पांड्या, जडेजा, सूर्यकुमार यादव, शुभमन गिल, कुलदीप यादव, युजवेंद्र चहल, मोहम्मद शमी, सिराज हे मोठे खेळाडू या मालिकेत खेळताना दिसणार नाहीत.","content":"India vs Ireland 1st T20: भारत (India) आणि आयर्लंड (Ireland) टी20 मालिकेकडे क्रिकेटप्रेमींचं लक्ष लागलं आहे. आजपासून भारत आणि आयर्लंड यांच्यातील टी20 मालिकेला सुरुवात होणार आहे. आयर्लंड दौऱ्यावर टीम इंडियाच्या (Team India) सिनियर खेळाडूंना आराम देण्यात आलाय. या मालिकेत युवा खेळाडूंना संधी देण्यात आली आहे. जसप्रीत बुमराहच्या नेतृत्वात भारताचे कोणते शिलेदार मैदानात उतरणार ? याकडे लक्ष लागलेय. युवा खेळाडूंना संधी - आयर्लंड दौऱ्यासाठी टीम इंडियात युवा खेळाडूंना संधी देण्यात आली आहे. रिंकू सिंह, यशस्वी जयस्वाल आणि जितेश शर्मा यांना चांगल्या कामगिरीचं बक्षीस मिळाले आहे. या खेळाडूंना आयर्लंड दौऱ्यासाठी टीम इंडियात स्थान मिळाले आहे. त्याशिवाय मुकेश कुमार आणि शाहबाज अहमद, शिवम दुबे यांनाही संधी देण्यात आली आहे. रिंकू सिंहला पदार्पणाची संधी मिळणार? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); टीम इंडियाने आयर्लंड दौऱ्यासाठी रिंकू सिंहला संधी दिली आहे. त्याला प्लेईंग इलेव्हनमध्ये संधी मिळण्याची शक्यता आहे. रिंकूने सोशल मीडियावर टीम इंडियाच्या जर्सीमधील फोटो शेअर केले आहेत. टीम इंडियासोबतच्या सरावादरम्यानचे हे फोटो आहेत. रिंकूने इंस्टाग्रामवर फोटो शेअर केला आहे, यामध्ये तो टीम इंडियाच्या जर्सीमध्ये दिसत आहे आणि त्याच्या हातामध्ये बॅट आहे. भारताची संभाव्य प्लेईंग 11 : ऋतुराज गायकवाड, यशस्वी जयसवाल, संजू सॅमसन (विकेटकीपर), तिलक वर्मा, रिंकू सिंह, शिवम दुबे, वाशिंगटन सुंदर, जसप्रीत बुमराह (कर्णधार), रवि बिश्नोई, अर्शदीप सिंह, मुकेश कुमार आयर्लंडची संभाव्य प्लेईंग 11 : एंड्रयू बालबर्नी, पॉल स्टर्लिंग (कर्णधार), लोर्कन टकर, हॅरी टेक्टर, जॉर्ज डॉकरेल, गॅरेथ डेलानी, कर्टिस कँपर, मार्क अडायर, जोशुआ लिटिल, बॅरी मॅक्कार्थी, बेंजामिन व्हाइट भारत आणि आयर्लंड मालिका भारत आणि आयर्लंड यांच्यामध्ये तीन सामन्याची टी 20 मालिका खेळवण्यात येणार आहे. भारत आणि आयर्लंड टी-20 मालिका शुक्रवारपासून सुरु होत आहे. 18 ऑगस्ट रोजी डबलिन येथे पहिला टी20 सामना खेळवण्यात येणार आहे. 20 ऑगस्ट रोजी दुसरा आणि 23 ऑगस्ट रोजी तिसरा टी20 सामना रंगणार आहे. सिनिअर खेळाडूंना आराम - 18 ऑगस्टपासून आयर्लंड दौऱ्याला सुरुवात होणार आहे. भारतीय संघ आयर्लंडविरुद्ध तीन टी-20 सामन्यांची मालिका खेळणार आहे. दुसरा ट्वेंटी-ट्वेंटी सामना 20 ऑगस्ट रोजी खेळवला जाईल. मालिकेतील तिसरा आणि शेवटचा सामना 23 ऑगस्ट रोजी होणार आहे. आशिया चषकाच्या पार्श्वभूमीवर बीसीसीआयने आयर्लंड दौऱ्यात सर्व मोठ्या खेळाडूंना विश्रांती देण्याचा निर्णय घेतला आहे. रोहित शर्मा, विराट कोहली, हार्दिक पांड्या, जडेजा, सूर्यकुमार यादव, शुभमन गिल, कुलदीप यादव, युजवेंद्र चहल, मोहम्मद शमी, सिराज हे मोठे खेळाडू या मालिकेत खेळताना दिसणार नाहीत.","pubDate":"2023-08-18 10:32:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/18/e18d49efe032295c10cceaf06ca842041692353799723143_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"Chance for World No.1 Babar Azam to improve his not-so-great Asia Cup record","link":"https://www.indiatoday.in/sports/cricket/video/chance-for-world-no1-babar-azam-to-improve-his-not-so-great-asia-cup-record-2423115-2023-08-18?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chance for World No.1 Babar Azam to improve his not-so-great Asia Cup record","content":"Babar Azam will be Pakistan's key player as they get set for the Asia Cup and look forward to this year's World Cup. The Pakistan skipper will be looking to improve on his record in the tournament and be amongst the runs this time around. A journalist was shot dead by some unidentified men in Bihar’s Araria on Friday. Abhishek Bachchan turns coach in 'Ghoomer,' also starring Saiyami Kher. In an exclusive chat with India Today's Bhavna Agarwal, the duo spoke about the movie.","pubDate":"2023-08-18 10:25:34","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"title":"How can I watch TNT Sports? BT Sport rebrand explained","link":"https://www.independent.co.uk/sport/tnt-sports-what-is-bt-sport-why-b2391899.html","keywords":["Sport"],"creator":["Harry Latham-Coyle"],"video_url":null,"description":"BT Sport’s renaming follows a merger with Eurosport-owners Warner Bros Discovery","content":"TNT Sports has arrived on television screens in the United Kingdom with the channel’s rebrand fom BT Sport complete, with the new season of Premier League and Champions League football, as well as Premiership Rugby, to be shown on the channel. The renaming follows the purchase of BT Sport by Warner Bros Discovery, which also owns Eurosport . In time, the two channels will be brought together under the TNT Sports brand, with fans able to watch top football, rugby, tennis and Olympic sport action all under one banner. For now, though, Eurosport will remain distinct - the channel is the lead rightsholder for the Paris 2024 Olympics in the UK and Ireland. But what does this mean for subscribers, and what is TNT Sports? What was BT Sport and what sports did the channel show? Launched in August 2013, BT Sport is a group of paid television sports channels available in the UK and Republic of Ireland. It shows sports including Premier League and Champions League football, Premiership and Champions Cup rugby, cricket from Australia and New Zealand and MotoGP. What is Warner Bros Discovery and when was a merger agreed? Warner Bros Discovery (WBD) and BT Group announced last year that they had reached an agreement to form a joint venture that will eventually merge the Eurosport and BT Sport channels and portfolios. Warner Bros Discovery is a multinational mass media conglomerate that operates many of the world’s biggest television brands, including CNN and HBO. What is TNT Sports? TNT Sports will be a familiar brand to those in Latin America, where it is the home of top-level domestic and European football. From July 2023, the channel will now have a dedicated brand in the UK and Ireland ahead of the start of the 2023/24 football season. “The TNT Sports name is already synonymous with premium live sports in a number of countries around the world and a further sign of the global scale and expertise that WBD brings to the partnership with BT,” Andrew Georgiou, managing director of WBD Sports Europe, explained of the decision to rebrand. What does this mean for former BT Sport subscribers? For television viewers, BT Sport has become TNT Sports, with no new channel to tune in to. For those who watched regularly via the BT Sport app, discovery+ will be the new live streaming home of the rebranded channel. Fans wanting to subscribe to TNT Sports directly through discovery+ will have to pay £29.99 per month, the same as was previously charged for the BT Sport Monthly Pass - this will include access to Eurosport and the platform’s entertainment offerings. What sports will I be able to watch on the new channel after the merger is complete? The merger will allow sports fans to watch many of the world’s biggest sporting events all under one channel banner. These include: the Olympic Games, the Premier League, Champions League, Europa League, Premiership Rugby, MotoGP, UFC, Boxing, WWE, tennis Grand Slams, cycling Grand Tours and the winter sports season.","pubDate":"2023-08-18 10:18:03","image_url":"https://static.independent.co.uk/2021/04/19/16/GettyImages-1182719731.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sophie Ecclestone rested for Sri Lanka series as England turn to Gaur and Heath","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-heather-knight-lewis-australia-b2395318.html","keywords":["Cricket","Sport"],"creator":["George Sessions"],"video_url":null,"description":"England have opted to rest several key players ahead of a busy 12-month period with the T20 World Cup next year.","content":"England have handed maiden call-ups to Mahika Gaur and Bess Heath for the upcoming white-ball series with Sri Lanka but rested four key players including Sophie Ecclestone. Jon Lewis’ side will bring an enthralling summer to an end when they play three IT20s and three ODIs against Sri Lanka between August 31 and September 14. After beating Australia in both white-ball series last month, England turn their attention to Sri Lanka but will be without Ecclestone and Sophia Dunkley for the entire series, while Danni Wyatt will only play in the T20s and Nat Sciver-Brunt is only part of the ODI group. Fast bowler Gaur has benefited from this rotation and in the process will commit her international future to England after being selected in both white-ball squads. Gaur, 17, has represented United Arab Emirates in 19 T20 internationals but is set to make her debut for England after a fine summer where she helped North West Thunder make the Charlotte Edwards Cup Finals Day and, more recently, has caught the eye for Manchester Originals. Heath hit 41 for England A against Australia A earlier this summer and is selected in both groups following a consistent run of form over the past year. Freya Kemp is also back in the 20-over squad after she recovered from a stress fracture to her back and Lauren Filer has received her first IT20 call-up following a starring red-ball role against Australia in the one-off Test in June. Captain Heather Knight and her team will begin the IT20 series at a sold-out Hove on August 31. Head coach Lewis said: “We have named a squad with a good blend of youth and experience and see this as an important series to test the depth of our playing pool. “We have some exciting, new young players coming in who we are looking forward to working with. “Mahika is a very exciting talent. Left-arm swing bowlers of over six-foot tall are unique in women’s cricket. “Mahika has shown consistently this summer that she is a threat with the new ball and we are excited to see how she performs at international level. “Bess is an all-action cricketer who impacts games and is a great fit for us and how we want to play. “She impressed in the A team games against Australia earlier in the summer and she also provides cover for Amy Jones with the gloves. “With a World Cup coming up next year, it’s imperative we develop the squad and players can gain international caps and experience. “The chance to play at venues around the country is exciting. It’s great the opening fixture against Sri Lanka at Hove is now sold out. “After an incredible Ashes summer, we want to maintain momentum on and off the field and look forward to getting started.” England Women’s IT20 squad: Knight (captain), Bell, Bouchier, Capsey, Cross, Dean, Filer, Gaur, Gibson, Glenn, Heath, Jones, Kemp, Wong, Wyatt. England Women’s ODI squad: Knight (captain), Beaumont, Bell, Bouchier, Capsey, Cross, Dean, Filer, Gaur, Gibson, Glenn, Heath, Jones, Lamb, Sciver-Brunt,","pubDate":"2023-08-18 10:00:53","image_url":"https://static.independent.co.uk/2023/08/18/11/cac430811f466e36fc13d7c39158e805Y29udGVudHNlYXJjaGFwaSwxNjkyNDM2Mzk0-2.72972639.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Steve Smith, Mitchell Starc ruled out of South Africa Tour, Mitchell Marsh to lead in ODIs","link":"https://www.indiatvnews.com/sports/cricket/steve-smith-mitchell-starc-ruled-out-of-australia-tour-of-south-africa-mitchell-marsh-to-lead-in-odis-pat-cummins-2023-08-18-887431","keywords":null,"creator":null,"video_url":null,"description":"Australian star players Steve Smith and Mitchell Starc have been ruled out of the complete South Africa tour as the duo have suffered injuries, Cricket Australia confirmed on Friday. Australia travel to South Africa for T20Is and ODIs as they prepare for the ODI World Cup in India. Moreover, Mitchell Marsh has been appointed the ODI captain for the series as Pat Cummins would be on the sidelines too.","content":"Australian star players and Mitchell Starc have been ruled out of the complete South Africa tour as the duo have suffered injuries, Cricket Australia confirmed on Friday. Australia travel to South Africa for T20Is and ODIs as they prepare for the ODI World Cup in India. Moreover, Mitchell Marsh has been appointed the ODI captain for the series as would be on the sidelines too. It has been revealed that Smith is nursing a tendon injury to his left wrist and will be out for four weeks. Meanwhile, Starc experienced groin soreness after the WTC Final and series. The duo are expected to be fit for the ODI World Cup in India. Cricket Australia's chief selector George Bailey opened on the duo. \"The compacted Ashes series and the World Test Championship was a heavy load for the group, and we are taking a conservative approach to the build-up to the World Cup,\" he said on Friday. Meanwhile, Smith and Starc's exit has given Marnus Labuschagne a reprieve in the ODIs. The right-hand batter has been added to Australia's ODI squad after being axed from the 50-over team when Australia named its squad for the South Africa series and an initial one for the ODI World Cup. Labuschagne has struggled for runs in the format, scoring 847 runs in 30 matches at an average of 31. Notably, Bailey expects the duo will be back in action for the three-match ODI series in India which starts from September 22 onwards. \"With the World Cup the priority of the squad, it was determined on advice that it was best for Steve and Mitchell to join the group in India by which time we expect them to be fully fit and available for the Indian ODI series, plus the World Cup warm-up fixture,\" he added. The Board has also made Marsh the captain for the ODIs after being promoted as the T20I captain for the Proteas series. Cummins confirmed he will not be part of the complete tour as he is recovering from a wrist fracture. Marsh will lead Australia in his absence. Mitchell Marsh (c), Sean Abbott, , Tim David, Nathan Ellis, Aaron Hardie, Travis Head, Josh Inglis, Spencer Johnson, , Matt Short, , , Mitchell Marsh (c), Sean Abbott, Ashton Agar, , Pat Cummins, Nathan Ellis, Cameron Green, Aaron Hardie, Josh Hazlewood, Travis Head, Josh Inglis, Spencer Johnson, Marnus Labuschagne, Glenn Maxwell, Tanveer Sangha, Marcus Stoinis, David Warner, Adam Zampa","pubDate":"2023-08-18 08:42:03","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Adam Zampa, Mitchell Marsh will be vital to Australia’s chances in World Cup: Mike Hussey","link":"https://indianexpress.com/article/sports/cricket/adam-zampa-mitchell-marsh-will-be-vital-to-australias-chances-in-world-cup-mike-hussey-8898221/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Former Australian cricketer Mike Hussey believes spinner Adam Zampa and all-rounder Mitchell Marsh will play a crucial role in the team’s bid to clinch the World Cup in India later this year. Leg-spinner Zampa, 31, was first picked in Australia’s limited-overs squad in 2016 and since then has played 79 ODIs taking 131 wickets. With Indian conditions expected to favour spin bowling, Hussey believes Zampa would be the go-to bowler for Pat Cummins’ side. The wrist spinner with a skidding stock delivery played a vital role in Australia’s maiden T20 World Cup triumph in the UAE in 2021, finishing with 13 wickets at an economy rate of just 5.81. “Adam Zampa could play a big role for Australia throughout the tournament,” said Hussey on Friday. “He has been really good over the last few years.” The former cricketer added that the confidence with which Marsh is playing, he could have an enormous impact on the team’s fortunes. “And I think Mitch Marsh is someone that can certainly have a big impact. He has been given a great role, batting in the top three now and he is playing with enormous confidence. So, if he gets his confidence up, he can be a really tough man to stop.” Hussey was part of the Australia side that lifted the 50-over World Cup in 2007 in the West Indies and more recently was part of England’s coaching setup during their winning campaign in the T20 World Cup last year. He also cautioned that Australia will require the services of seniors like Steve Smith to supplement the efforts of Zampa and Marsh. Advertisement “You can’t rely on just one or two key players to win you a World Cup and it’s going to take a collective effort. But I think for Australia to do really well, they need their big guns to really step up and I guess when you think of that, you think of Steve Smith and Pat Cummins.” The 48-year-old also believes Australia will be leading contenders for the World Cup, scheduled to commence on October 5, as the side has “got a bit of continuity as well”. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More “I think Australia’s got a great chance as they have kept a (large) group of players together for a period of time now. They all know their roles pretty well and they’ve got a bit of continuity in their team as well.” Even though Australia were bundled out of the 2019 edition of the World Cup by eventual champions England, Hussey feels their chances of success are high because they keep trying to explore new methods to win. “I think they’ve been trying a few little different things. They performed well in the series (in March) against India in Indian conditions and that will give them enormous confidence coming into the World Cup.” Australia defeated India 2-1 in the three-match ODI series. Also Read India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE PCB should delete the video and apologise: Wasim Akram slams Pakistan Cri... Is this the beginning of the end? Dean Elgar laments Cricket South Africa... ‘Never thought it was all over’: Jasprit Bumrah says he is ready for Worl... Advertisement Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more “And Australia has a great history in World Cup events. So, I know they will be very determined to do extremely well. There’s so many great teams. It’s hard to pick a favourite but I think Australia will give themselves a big chance to be right up there.” Australia were the first to announce their squad for the World Cup, with the five-time champions leaving out star batter Marnus Labuschagne and including uncapped spinner Tanveer Sangha in the group of 18 players, which will be pruned down to 15 prior to the cut-off date on September 28.","pubDate":"2023-08-18 08:38:46","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Ireland 1st T20I: From Pitch reports to records, all you need to know about The Village, Malahide","link":"https://www.indiatvnews.com/sports/cricket/india-vs-ireland-1st-t20i-from-pitch-reports-to-records-all-you-need-to-know-about-the-village-in-malahide-2023-08-18-887428","keywords":null,"creator":null,"video_url":null,"description":"Team India will be up against Ireland in the T20I series opener at The Village in Malahide on Friday, August 18. For India, the biggest news is Jasprit Bumrah's return and the speedster will be seen leading the troops on the field. The visitors have picked a bunch of youngsters in their side for the series and, likely, some of the players who have already made a name for themselves in India's domestic circuit, including the Indian Premier League will get an opportunity in the series.","content":"Team India will be up against Ireland in the T20I series opener at The Village in Malahide on Friday, August 18. For India, the biggest news is 's return and the speedster will be seen leading the troops on the field. The visitors have picked a bunch of youngsters in their side for the series and, likely, some of the players who have already made a name for themselves in India's domestic circuit, including the Indian Premier League will get an opportunity in the series. For Ireland, it is a chance to test themselves against one of the best outfits and surprise them in their backyard. Ireland would love to improve their record against the Men in Blue as they haven't managed to win a single game against them in the shortest format. The first fixture of the three-match T20I series between the two countries will be played at The Village in Malahide on Friday, August 18 and the remaining two will also be played out at the same venue. Total T20I Matches - 21 Matches won batting first - 8 Matches won bowling first - 13 The wicket at The Village is considered pacer-friendly as the quicks have claimed 132 wickets in the T20Is that have been played at the venue, while spinners have snared 59 wickets to their credit. Hence, it won't be surprising if both teams head into the contest with a pace-heavy look. Paul Stirling (c), Andrew Balbirnie, Lorcan Tucker (wk), Harry Tector, Curtis Campher, George Dockrell, Mark Adair, Barry McCarthy, Fionn Hand, Craig Young, Josh Little, Ben White, Theo van Woerkom, Gareth Delany, Ross Adair Yashasvi Jaiswal, Ruturaj Gaikwad, Tilak Varma, Rinku Singh, Sanju Samson, Jitesh Sharma, Shivam Dube, Washington Sundar, Shahbaz Ahmed, Arshdeep Singh, Ravi Bishnoi, Jasprit Bumrah (c), Prasidh Krishna, Mukesh Kumar, Avesh Khan","pubDate":"2023-08-18 08:30:55","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Why is Nottingham Forest vs Sheffield United not on TV?","link":"https://www.fourfourtwo.com/news/why-is-nottingham-forest-vs-sheffield-united-not-on-tv","keywords":null,"creator":null,"video_url":null,"description":"Nottingham Forest vs Sheffield United is not on TV – and it's all because of… cricket!?","content":"Nottingham Forest vs Sheffield United is not on TV tonight – due to the cricket. The first Friday night football of the Premier League season beckons when Forest host the newly-promoted Blades ahead of the second weekend of the new campaign. Friday night football is usually a Sky staple but this time, it won’t be live on TV in the UK. and will be looking to pick up their first points of the season after opening-day defeats to and respectively and will also mark their first meeting since the 2022 Championship play-off semi-final at the City Ground. Yes – it's because of cricket. The clash was originally scheduled for a standard 3pm kick-off on Saturday 19th August, but due to Nottingham cricket side The Trent Rockets taking on Birmingham Phoenix the same afternoon, concern over heavy congestion in the city meant a move to a Friday night slot. The fixture wasn’t originally scheduled for TV when selections were made, and Premier League rules state that can’t change even if a game is moved to what would be a TV-friendly viewing time for many supporters sat at home on a Friday evening. Sky Sports also already has the live Championship game between and on Friday night, while there is a double helping of live Premier League action on Saturday night. Sky will be showing Ange Postecoglou’s first home game as manager against , immediately followed by the clash between and at 8pm on TNT Sports. You can find out more about the fixture here, with for the game.","pubDate":"2023-08-18 12:00:15","image_url":"https://cdn.mos.cms.futurecdn.net/NFrj5JKt8nn8NgQBNQunqb.jpg","source_id":"fourfourtwo","source_priority":14446,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Virat Kohli के अंतर्राष्ट्रीय क्रिकेट में 15 साल पूरे, अब तक उन्होंने किए कई बड़े कारनामा","link":"https://jantaserishta.com/sports/virat-kohli-completes-15-years-in-international-cricket-till-now-he-has-done-many-big-feats-2727068","keywords":["खेल"],"creator":["Harrison"],"video_url":null,"description":null,"content":"विराट कोहली ने 18 अगस्त 2008 को अंतर्राष्ट्रीय क्रिकेट में कदम रखा था।दुनिया के सर्वश्रेष्ठ बल्लेबाजों में से एक विराट कोहली ने श्रीलंका के खिलाफ वनडे मैच से डेब्यू किया था, लेकिन इस सीरीज से पहले वह भारत को ICC U19 क्रिकेट विश्व कप ट्रॉफी दिलाकर इतिहास रच चुके थे। पहले वनडे मैच में विराट कोहली 12 रन बना सके थे, लेकिन आखिरी वनडे मैच में अर्धशतक लगाते हुए सीरीज में उन्होंने 159 रन बनाए। विराट कोहली का सबसे मजबूत फॉर्मेट वनडे है।उन्होंने वनडे फॉर्मेट में 275 मैचों में 57.32 की औसत से 12,898 रन बनाए हैं।उन्होंने 265 पारियों में 46 शतक और 65 अर्धशतक बनाए हैं, जिसमें उनका सर्वश्रेष्ठ स्कोर 183 रन है। वह सचिन के बाद वनडे में दूसरे सबसे ज्यादा रन बनाने वाले बल्लेबाज हैं। वनडे में 150 मैच खेलने के बाद औसत सबसे अधिक है । वो 5,000 वनडे रन बनाने वाले तीसरे सबसे तेज, 6,000 और 7,000 वनडे रन बनाने वाले दूसरे सबसे तेज और 8,000, 9,000, 10,000, 11,000 और 12,000 वनडे रन बनाने वाले सबसे तेज खिलाड़ी हैं। विराट का कप्तान के तौर पर रिकॉर्ड अच्छा रहा, उन्होंने 95 मैचों में टीम का नेतृत्व किया है, जिसमें 65 जीते, 27 हारे, एक बराबरी पर रहा और दो का कोई परिणाम नहीं निकला।विराट कोहली भारत की 2011 वनडे विश्व कप जीत के भी गवाह बने। विराट कोहली ने 2011 में वेस्टइंडीज के खिलाफ टेस्ट डेब्यू किया। इस प्रारूप में उनकी शुरुआत खराब रही । विराट ने 187 टेस्ट पारियों में 49.29 की औसत से 8,676 रन बनाए हैं, जिसमें 29 शतक और 29 अर्द्धशतक शामिल हैं। वहीं उनका सर्वश्रेष्ठ स्कोर 254 रन रहा है। टेस्ट में बतौर कप्तान विराट सफल रहे । विराट ने 68 टेस्ट में भारत का नेतृत्व किया, 40 जीते, 17 हारे और 11 ड्रा रहे।टी 20 अंतर्राष्ट्रीय में भी विराट कोहली का जलवा रहा है।उन्होंने 115 टी 20आई में उन्होंने 52.73 की औसत और 137.96 की स्ट्राइक रेट से 4,0008 रन बनाए हैं ।एक शतक और 37 अर्धशतक उन्होंने जड़े हैं। विराट का सर्वश्रेष्ठ स्कोर 122 रन रहा है।विराट कोहली आईसीसी टी 20 विश्व कप के सर्वकालिक महान खिलाड़ी हैं । टूर्नामेंट 27 मैचों और 25 पारियों में 81.50 की औसत से 131.30 की स्ट्राइक रेट और 14 अर्धशतक के साथ 1,141 रन बना चुके हैं।","pubDate":"2023-08-18 10:48:58","image_url":"https://jantaserishta.com/h-upload/2023/08/18/500x300_3321826-untitled-101-copy.jpg","source_id":"jantaserishta","source_priority":6826860,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Pakistan : विश्वचषकात पाकिस्तान भारताचा पराभव करेल, शोएब अख्तरचं भाकित","link":"https://marathi.abplive.com/sports/cricket/former-pakistani-player-shoaib-akhtar-backs-his-pakistani-team-to-beat-india-in-odi-world-cup-2023-1202297","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"Shoaib Akhtar On India vs Pakistan World Cup Match : भारतात होणाऱ्या विश्वचषकाला 50 दिवसांपेक्षा कमी कालावधी शिल्लक राहिलाय. विश्वचषकातील भारत आणि पाकिस्तान यांच्यातील सामन्याची क्रीडा चाहत्यांना उत्सुकता आहे. भारत आणि पाकिस्तान यांच्यातील रंगतदार सामना 14 ऑक्टोबर रोजी अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर खेळवण्यात येणार आहे. या ब्लॉकबास्टर सामन्यापूर्वी भारत आणि पाकिस्तानमधील माजी खेळाडूंनी आपापली मते व्यक्त करण्यास सुरुवात केली आहे. पाकिस्तानचा माजी वेगवान गोलंदाज शोएब अख्तर याने केलेल्या विधानाची सध्या जोरदार चर्चा सुरु आहे. विश्वचषकात पाकिस्तानचा संघ भारताचा पराभव करेल, असा विश्वास शोएब अख्तर याने व्यक्त केलाय.  विश्वचषकाच्या इतिहासात आतापर्यंत भारताने बाजी मारलेली आहे. वनडे विश्वचषकात पाकिस्तानला आतापर्यंत भारताचा पराभव करता आलेला नाही. मोठ्या सामन्यात दबाव झेलण्याची पाकिस्तानच्या संघाचे मजबूत बाजू असल्याचे शोएबने म्हटलेय. शोएब अख्तर याने रेव स्पोर्ट्स संकेतस्थळाला दिलेल्या मुलाखतीत पाकिस्तानच्या विजयाचा विश्वास व्यक्त केलाय. प्रत्येकवेळा पहिल्यांदा काही ना काही होतेच. भारतीय संघावर वारंवार जिंकण्याचा दबाव आहे. त्यामुळे अशा परिस्थितीत भारताचा पराभव करण्याची पाकिस्तानकडे मोटी संधी असेल, असे शोएब अख्तर म्हणाला.  आशिया चषकात दिसेल ट्रेलर  विश्वचषकात भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. त्यापूर्वी श्रीलंकामध्ये याची रंगीत तालिम पाहायला मिळणार आहे. आशिया चषकामध्ये भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. 2 सप्टेंबर रोजी श्रीलंका येथील पल्लेकेले स्टेडिअमवर भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. आशिया चषक यंदा एकदिवसीय स्वरुपात होणार आहे. भारत आणि पाकिस्तान एकाच ग्रुपमध्ये आहेत. आशिया चषकात भारत आणि पाकिस्तान यांच्यात किमान दोन सामने होतील. पाकिस्तानने आशिया चषकासाठी संघाची घोषणा केली आहे. भारतीय संघाची निवड अद्याप झालेली नाही. भारतीय संघाची निवड 20 ऑगस्ट रोजी होण्याची शक्यता आहे.   विश्वचषक कधीपासून -  भारतात होणारा विश्वचषकाचा पहिला सामना 5 ऑक्टोबर रोजी होणार आहे. गतविजेता इंग्लंड आणि उपविजेता न्यूझीलंड यांच्यात सलामीची लढत होणार आहे. 19 नोव्हेंबर रोजी महाअंतिम सामना रंगणार आहे. विश्वचषकाचा पहिला आणि अखेरचा सामना अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर रंगणार आहे. भारत आणि पाकिस्तान हा हायहोल्टेज सामनाही अहमदाबाद येथेच होणार आहे. यंदाचा विश्वचषक दहा संघामध्ये राऊंड रॉबिन पद्धतीने होणार आहे. प्रत्येक संघाचे कमीतकमी नऊ सामने होणार आहेत.   आणखी वाचा : ODI World Cup : पाकिस्तानी संघाला वर्ल्ड कपचं टेन्शन! भारतात खेळण्याचं दडपण? बाबर आझमच्या टीमसोबत मानसोपचार तज्ज्ञ पाठवण्याचा विचार","content":"Shoaib Akhtar On India vs Pakistan World Cup Match : भारतात होणाऱ्या विश्वचषकाला 50 दिवसांपेक्षा कमी कालावधी शिल्लक राहिलाय. विश्वचषकातील भारत आणि पाकिस्तान यांच्यातील सामन्याची क्रीडा चाहत्यांना उत्सुकता आहे. भारत आणि पाकिस्तान यांच्यातील रंगतदार सामना 14 ऑक्टोबर रोजी अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर खेळवण्यात येणार आहे. या ब्लॉकबास्टर सामन्यापूर्वी भारत आणि पाकिस्तानमधील माजी खेळाडूंनी आपापली मते व्यक्त करण्यास सुरुवात केली आहे. पाकिस्तानचा माजी वेगवान गोलंदाज शोएब अख्तर याने केलेल्या विधानाची सध्या जोरदार चर्चा सुरु आहे. विश्वचषकात पाकिस्तानचा संघ भारताचा पराभव करेल, असा विश्वास शोएब अख्तर याने व्यक्त केलाय. विश्वचषकाच्या इतिहासात आतापर्यंत भारताने बाजी मारलेली आहे. वनडे विश्वचषकात पाकिस्तानला आतापर्यंत भारताचा पराभव करता आलेला नाही. मोठ्या सामन्यात दबाव झेलण्याची पाकिस्तानच्या संघाचे मजबूत बाजू असल्याचे शोएबने म्हटलेय. शोएब अख्तर याने रेव स्पोर्ट्स संकेतस्थळाला दिलेल्या मुलाखतीत पाकिस्तानच्या विजयाचा विश्वास व्यक्त केलाय. प्रत्येकवेळा पहिल्यांदा काही ना काही होतेच. भारतीय संघावर वारंवार जिंकण्याचा दबाव आहे. त्यामुळे अशा परिस्थितीत भारताचा पराभव करण्याची पाकिस्तानकडे मोटी संधी असेल, असे शोएब अख्तर म्हणाला. आशिया चषकात दिसेल ट्रेलर विश्वचषकात भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. त्यापूर्वी श्रीलंकामध्ये याची रंगीत तालिम पाहायला मिळणार आहे. आशिया चषकामध्ये भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. 2 सप्टेंबर रोजी श्रीलंका येथील पल्लेकेले स्टेडिअमवर भारत आणि पाकिस्तान यांच्यात लढत होणार आहे. आशिया चषक यंदा एकदिवसीय स्वरुपात होणार आहे. भारत आणि पाकिस्तान एकाच ग्रुपमध्ये आहेत. आशिया चषकात भारत आणि पाकिस्तान यांच्यात किमान दोन सामने होतील. पाकिस्तानने आशिया चषकासाठी संघाची घोषणा केली आहे. भारतीय संघाची निवड अद्याप झालेली नाही. भारतीय संघाची निवड 20 ऑगस्ट रोजी होण्याची शक्यता आहे. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); विश्वचषक कधीपासून - भारतात होणारा विश्वचषकाचा पहिला सामना 5 ऑक्टोबर रोजी होणार आहे. गतविजेता इंग्लंड आणि उपविजेता न्यूझीलंड यांच्यात सलामीची लढत होणार आहे. 19 नोव्हेंबर रोजी महाअंतिम सामना रंगणार आहे. विश्वचषकाचा पहिला आणि अखेरचा सामना अहमदाबाद येथील नरेंद्र मोदी स्टेडिअमवर रंगणार आहे. भारत आणि पाकिस्तान हा हायहोल्टेज सामनाही अहमदाबाद येथेच होणार आहे. यंदाचा विश्वचषक दहा संघामध्ये राऊंड रॉबिन पद्धतीने होणार आहे. प्रत्येक संघाचे कमीतकमी नऊ सामने होणार आहेत. आणखी वाचा : ODI World Cup : पाकिस्तानी संघाला वर्ल्ड कपचं टेन्शन! भारतात खेळण्याचं दडपण? बाबर आझमच्या टीमसोबत मानसोपचार तज्ज्ञ पाठवण्याचा विचार","pubDate":"2023-08-18 10:47:56","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2021/07/14/1c9ec73e159c9143c5d532be07d0a6a5_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"बुमराहच्या नेतृत्वात भारतीय संघ सज्ज, कुणाला मिळणार संधी, पाहा भारताचे संभाव्य 11 शिलेदार","link":"https://marathi.abplive.com/sports/cricket/india-vs-ireland-1st-t20-match-probable-playing-11-rinku-singh-may-will-be-debut-1202291","keywords":["क्रिकेट"],"creator":["एबीपी माझा ब्युरो"],"video_url":null,"description":"India vs Ireland 1st T20: भारत (India) आणि आयर्लंड (Ireland) टी20 मालिकेकडे क्रिकेटप्रेमींचं लक्ष लागलं आहे. आजपासून भारत आणि आयर्लंड  यांच्यातील टी20 मालिकेला सुरुवात होणार आहे. आयर्लंड दौऱ्यावर टीम इंडियाच्या (Team India) सिनियर खेळाडूंना आराम देण्यात आलाय. या मालिकेत युवा खेळाडूंना संधी देण्यात आली आहे. जसप्रीत बुमराहच्या नेतृत्वात भारताचे कोणते शिलेदार मैदानात उतरणार ? याकडे लक्ष लागलेय.  युवा खेळाडूंना संधी -  आयर्लंड दौऱ्यासाठी टीम इंडियात युवा खेळाडूंना संधी देण्यात आली आहे. रिंकू सिंह, यशस्वी जयस्वाल आणि जितेश शर्मा यांना चांगल्या कामगिरीचं बक्षीस मिळाले आहे. या खेळाडूंना आयर्लंड दौऱ्यासाठी टीम इंडियात स्थान मिळाले आहे. त्याशिवाय मुकेश कुमार आणि शाहबाज अहमद, शिवम दुबे यांनाही संधी देण्यात आली आहे. रिंकू सिंहला पदार्पणाची संधी मिळणार? टीम इंडियाने आयर्लंड दौऱ्यासाठी रिंकू सिंहला संधी दिली आहे. त्याला प्लेईंग इलेव्हनमध्ये संधी मिळण्याची शक्यता आहे. रिंकूने सोशल मीडियावर टीम इंडियाच्या जर्सीमधील फोटो शेअर केले आहेत. टीम इंडियासोबतच्या सरावादरम्यानचे हे फोटो आहेत. रिंकूने इंस्टाग्रामवर फोटो शेअर केला आहे, यामध्ये तो टीम इंडियाच्या जर्सीमध्ये दिसत आहे आणि त्याच्या हातामध्ये बॅट आहे. भारताची संभाव्य प्लेईंग 11 :  ऋतुराज गायकवाड, यशस्वी जयसवाल, संजू सॅमसन (विकेटकीपर), तिलक वर्मा, रिंकू सिंह, शिवम दुबे, वाशिंगटन सुंदर, जसप्रीत बुमराह (कर्णधार), रवि बिश्नोई, अर्शदीप सिंह, मुकेश कुमार आयर्लंडची संभाव्य प्लेईंग 11 :  एंड्रयू बालबर्नी, पॉल स्टर्लिंग (कर्णधार), लोर्कन टकर, हॅरी टेक्टर, जॉर्ज डॉकरेल, गॅरेथ डेलानी, कर्टिस कँपर, मार्क अडायर, जोशुआ लिटिल, बॅरी मॅक्कार्थी, बेंजामिन व्हाइट भारत आणि आयर्लंड मालिकाभारत आणि आयर्लंड यांच्यामध्ये तीन सामन्याची टी 20 मालिका खेळवण्यात येणार आहे. भारत आणि आयर्लंड टी-20 मालिका शुक्रवारपासून सुरु होत आहे. 18 ऑगस्ट रोजी डबलिन येथे पहिला टी20 सामना खेळवण्यात येणार आहे. 20 ऑगस्ट रोजी दुसरा आणि 23 ऑगस्ट रोजी तिसरा टी20 सामना रंगणार आहे.   सिनिअर खेळाडूंना आराम -18 ऑगस्टपासून आयर्लंड दौऱ्याला सुरुवात होणार आहे. भारतीय संघ आयर्लंडविरुद्ध तीन टी-20 सामन्यांची मालिका खेळणार आहे. दुसरा ट्वेंटी-ट्वेंटी सामना 20 ऑगस्ट रोजी खेळवला जाईल. मालिकेतील तिसरा आणि शेवटचा सामना 23 ऑगस्ट रोजी होणार आहे. आशिया चषकाच्या पार्श्वभूमीवर बीसीसीआयने आयर्लंड दौऱ्यात सर्व मोठ्या खेळाडूंना विश्रांती देण्याचा निर्णय घेतला आहे. रोहित शर्मा, विराट कोहली, हार्दिक पांड्या, जडेजा, सूर्यकुमार यादव, शुभमन गिल, कुलदीप यादव, युजवेंद्र चहल, मोहम्मद शमी, सिराज हे मोठे खेळाडू या मालिकेत खेळताना दिसणार नाहीत.","content":"India vs Ireland 1st T20: भारत (India) आणि आयर्लंड (Ireland) टी20 मालिकेकडे क्रिकेटप्रेमींचं लक्ष लागलं आहे. आजपासून भारत आणि आयर्लंड यांच्यातील टी20 मालिकेला सुरुवात होणार आहे. आयर्लंड दौऱ्यावर टीम इंडियाच्या (Team India) सिनियर खेळाडूंना आराम देण्यात आलाय. या मालिकेत युवा खेळाडूंना संधी देण्यात आली आहे. जसप्रीत बुमराहच्या नेतृत्वात भारताचे कोणते शिलेदार मैदानात उतरणार ? याकडे लक्ष लागलेय. युवा खेळाडूंना संधी - आयर्लंड दौऱ्यासाठी टीम इंडियात युवा खेळाडूंना संधी देण्यात आली आहे. रिंकू सिंह, यशस्वी जयस्वाल आणि जितेश शर्मा यांना चांगल्या कामगिरीचं बक्षीस मिळाले आहे. या खेळाडूंना आयर्लंड दौऱ्यासाठी टीम इंडियात स्थान मिळाले आहे. त्याशिवाय मुकेश कुमार आणि शाहबाज अहमद, शिवम दुबे यांनाही संधी देण्यात आली आहे. रिंकू सिंहला पदार्पणाची संधी मिळणार? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); टीम इंडियाने आयर्लंड दौऱ्यासाठी रिंकू सिंहला संधी दिली आहे. त्याला प्लेईंग इलेव्हनमध्ये संधी मिळण्याची शक्यता आहे. रिंकूने सोशल मीडियावर टीम इंडियाच्या जर्सीमधील फोटो शेअर केले आहेत. टीम इंडियासोबतच्या सरावादरम्यानचे हे फोटो आहेत. रिंकूने इंस्टाग्रामवर फोटो शेअर केला आहे, यामध्ये तो टीम इंडियाच्या जर्सीमध्ये दिसत आहे आणि त्याच्या हातामध्ये बॅट आहे. भारताची संभाव्य प्लेईंग 11 : ऋतुराज गायकवाड, यशस्वी जयसवाल, संजू सॅमसन (विकेटकीपर), तिलक वर्मा, रिंकू सिंह, शिवम दुबे, वाशिंगटन सुंदर, जसप्रीत बुमराह (कर्णधार), रवि बिश्नोई, अर्शदीप सिंह, मुकेश कुमार आयर्लंडची संभाव्य प्लेईंग 11 : एंड्रयू बालबर्नी, पॉल स्टर्लिंग (कर्णधार), लोर्कन टकर, हॅरी टेक्टर, जॉर्ज डॉकरेल, गॅरेथ डेलानी, कर्टिस कँपर, मार्क अडायर, जोशुआ लिटिल, बॅरी मॅक्कार्थी, बेंजामिन व्हाइट भारत आणि आयर्लंड मालिका भारत आणि आयर्लंड यांच्यामध्ये तीन सामन्याची टी 20 मालिका खेळवण्यात येणार आहे. भारत आणि आयर्लंड टी-20 मालिका शुक्रवारपासून सुरु होत आहे. 18 ऑगस्ट रोजी डबलिन येथे पहिला टी20 सामना खेळवण्यात येणार आहे. 20 ऑगस्ट रोजी दुसरा आणि 23 ऑगस्ट रोजी तिसरा टी20 सामना रंगणार आहे. सिनिअर खेळाडूंना आराम - 18 ऑगस्टपासून आयर्लंड दौऱ्याला सुरुवात होणार आहे. भारतीय संघ आयर्लंडविरुद्ध तीन टी-20 सामन्यांची मालिका खेळणार आहे. दुसरा ट्वेंटी-ट्वेंटी सामना 20 ऑगस्ट रोजी खेळवला जाईल. मालिकेतील तिसरा आणि शेवटचा सामना 23 ऑगस्ट रोजी होणार आहे. आशिया चषकाच्या पार्श्वभूमीवर बीसीसीआयने आयर्लंड दौऱ्यात सर्व मोठ्या खेळाडूंना विश्रांती देण्याचा निर्णय घेतला आहे. रोहित शर्मा, विराट कोहली, हार्दिक पांड्या, जडेजा, सूर्यकुमार यादव, शुभमन गिल, कुलदीप यादव, युजवेंद्र चहल, मोहम्मद शमी, सिराज हे मोठे खेळाडू या मालिकेत खेळताना दिसणार नाहीत.","pubDate":"2023-08-18 10:32:32","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/18/e18d49efe032295c10cceaf06ca842041692353799723143_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"title":"Chance for World No.1 Babar Azam to improve his not-so-great Asia Cup record","link":"https://www.indiatoday.in/sports/cricket/video/chance-for-world-no1-babar-azam-to-improve-his-not-so-great-asia-cup-record-2423115-2023-08-18?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Chance for World No.1 Babar Azam to improve his not-so-great Asia Cup record","content":"Babar Azam will be Pakistan's key player as they get set for the Asia Cup and look forward to this year's World Cup. The Pakistan skipper will be looking to improve on his record in the tournament and be amongst the runs this time around. A journalist was shot dead by some unidentified men in Bihar’s Araria on Friday. Abhishek Bachchan turns coach in 'Ghoomer,' also starring Saiyami Kher. In an exclusive chat with India Today's Bhavna Agarwal, the duo spoke about the movie.","pubDate":"2023-08-18 10:25:34","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"title":"How can I watch TNT Sports? BT Sport rebrand explained","link":"https://www.independent.co.uk/sport/tnt-sports-what-is-bt-sport-why-b2391899.html","keywords":["Sport"],"creator":["Harry Latham-Coyle"],"video_url":null,"description":"BT Sport’s renaming follows a merger with Eurosport-owners Warner Bros Discovery","content":"TNT Sports has arrived on television screens in the United Kingdom with the channel’s rebrand fom BT Sport complete, with the new season of Premier League and Champions League football, as well as Premiership Rugby, to be shown on the channel. The renaming follows the purchase of BT Sport by Warner Bros Discovery, which also owns Eurosport . In time, the two channels will be brought together under the TNT Sports brand, with fans able to watch top football, rugby, tennis and Olympic sport action all under one banner. For now, though, Eurosport will remain distinct - the channel is the lead rightsholder for the Paris 2024 Olympics in the UK and Ireland. But what does this mean for subscribers, and what is TNT Sports? What was BT Sport and what sports did the channel show? Launched in August 2013, BT Sport is a group of paid television sports channels available in the UK and Republic of Ireland. It shows sports including Premier League and Champions League football, Premiership and Champions Cup rugby, cricket from Australia and New Zealand and MotoGP. What is Warner Bros Discovery and when was a merger agreed? Warner Bros Discovery (WBD) and BT Group announced last year that they had reached an agreement to form a joint venture that will eventually merge the Eurosport and BT Sport channels and portfolios. Warner Bros Discovery is a multinational mass media conglomerate that operates many of the world’s biggest television brands, including CNN and HBO. What is TNT Sports? TNT Sports will be a familiar brand to those in Latin America, where it is the home of top-level domestic and European football. From July 2023, the channel will now have a dedicated brand in the UK and Ireland ahead of the start of the 2023/24 football season. “The TNT Sports name is already synonymous with premium live sports in a number of countries around the world and a further sign of the global scale and expertise that WBD brings to the partnership with BT,” Andrew Georgiou, managing director of WBD Sports Europe, explained of the decision to rebrand. What does this mean for former BT Sport subscribers? For television viewers, BT Sport has become TNT Sports, with no new channel to tune in to. For those who watched regularly via the BT Sport app, discovery+ will be the new live streaming home of the rebranded channel. Fans wanting to subscribe to TNT Sports directly through discovery+ will have to pay £29.99 per month, the same as was previously charged for the BT Sport Monthly Pass - this will include access to Eurosport and the platform’s entertainment offerings. What sports will I be able to watch on the new channel after the merger is complete? The merger will allow sports fans to watch many of the world’s biggest sporting events all under one channel banner. These include: the Olympic Games, the Premier League, Champions League, Europa League, Premiership Rugby, MotoGP, UFC, Boxing, WWE, tennis Grand Slams, cycling Grand Tours and the winter sports season.","pubDate":"2023-08-18 10:18:03","image_url":"https://static.independent.co.uk/2021/04/19/16/GettyImages-1182719731.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sophie Ecclestone rested for Sri Lanka series as England turn to Gaur and Heath","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-heather-knight-lewis-australia-b2395318.html","keywords":["Cricket","Sport"],"creator":["George Sessions"],"video_url":null,"description":"England have opted to rest several key players ahead of a busy 12-month period with the T20 World Cup next year.","content":"England have handed maiden call-ups to Mahika Gaur and Bess Heath for the upcoming white-ball series with Sri Lanka but rested four key players including Sophie Ecclestone. Jon Lewis’ side will bring an enthralling summer to an end when they play three IT20s and three ODIs against Sri Lanka between August 31 and September 14. After beating Australia in both white-ball series last month, England turn their attention to Sri Lanka but will be without Ecclestone and Sophia Dunkley for the entire series, while Danni Wyatt will only play in the T20s and Nat Sciver-Brunt is only part of the ODI group. Fast bowler Gaur has benefited from this rotation and in the process will commit her international future to England after being selected in both white-ball squads. Gaur, 17, has represented United Arab Emirates in 19 T20 internationals but is set to make her debut for England after a fine summer where she helped North West Thunder make the Charlotte Edwards Cup Finals Day and, more recently, has caught the eye for Manchester Originals. Heath hit 41 for England A against Australia A earlier this summer and is selected in both groups following a consistent run of form over the past year. Freya Kemp is also back in the 20-over squad after she recovered from a stress fracture to her back and Lauren Filer has received her first IT20 call-up following a starring red-ball role against Australia in the one-off Test in June. Captain Heather Knight and her team will begin the IT20 series at a sold-out Hove on August 31. Head coach Lewis said: “We have named a squad with a good blend of youth and experience and see this as an important series to test the depth of our playing pool. “We have some exciting, new young players coming in who we are looking forward to working with. “Mahika is a very exciting talent. Left-arm swing bowlers of over six-foot tall are unique in women’s cricket. “Mahika has shown consistently this summer that she is a threat with the new ball and we are excited to see how she performs at international level. “Bess is an all-action cricketer who impacts games and is a great fit for us and how we want to play. “She impressed in the A team games against Australia earlier in the summer and she also provides cover for Amy Jones with the gloves. “With a World Cup coming up next year, it’s imperative we develop the squad and players can gain international caps and experience. “The chance to play at venues around the country is exciting. It’s great the opening fixture against Sri Lanka at Hove is now sold out. “After an incredible Ashes summer, we want to maintain momentum on and off the field and look forward to getting started.” England Women’s IT20 squad: Knight (captain), Bell, Bouchier, Capsey, Cross, Dean, Filer, Gaur, Gibson, Glenn, Heath, Jones, Kemp, Wong, Wyatt. England Women’s ODI squad: Knight (captain), Beaumont, Bell, Bouchier, Capsey, Cross, Dean, Filer, Gaur, Gibson, Glenn, Heath, Jones, Lamb, Sciver-Brunt,","pubDate":"2023-08-18 10:00:53","image_url":"https://static.independent.co.uk/2023/08/18/11/cac430811f466e36fc13d7c39158e805Y29udGVudHNlYXJjaGFwaSwxNjkyNDM2Mzk0-2.72972639.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Steve Smith, Mitchell Starc ruled out of South Africa Tour, Mitchell Marsh to lead in ODIs","link":"https://www.indiatvnews.com/sports/cricket/steve-smith-mitchell-starc-ruled-out-of-australia-tour-of-south-africa-mitchell-marsh-to-lead-in-odis-pat-cummins-2023-08-18-887431","keywords":null,"creator":null,"video_url":null,"description":"Australian star players Steve Smith and Mitchell Starc have been ruled out of the complete South Africa tour as the duo have suffered injuries, Cricket Australia confirmed on Friday. Australia travel to South Africa for T20Is and ODIs as they prepare for the ODI World Cup in India. Moreover, Mitchell Marsh has been appointed the ODI captain for the series as Pat Cummins would be on the sidelines too.","content":"Australian star players and Mitchell Starc have been ruled out of the complete South Africa tour as the duo have suffered injuries, Cricket Australia confirmed on Friday. Australia travel to South Africa for T20Is and ODIs as they prepare for the ODI World Cup in India. Moreover, Mitchell Marsh has been appointed the ODI captain for the series as would be on the sidelines too. It has been revealed that Smith is nursing a tendon injury to his left wrist and will be out for four weeks. Meanwhile, Starc experienced groin soreness after the WTC Final and series. The duo are expected to be fit for the ODI World Cup in India. Cricket Australia's chief selector George Bailey opened on the duo. \"The compacted Ashes series and the World Test Championship was a heavy load for the group, and we are taking a conservative approach to the build-up to the World Cup,\" he said on Friday. Meanwhile, Smith and Starc's exit has given Marnus Labuschagne a reprieve in the ODIs. The right-hand batter has been added to Australia's ODI squad after being axed from the 50-over team when Australia named its squad for the South Africa series and an initial one for the ODI World Cup. Labuschagne has struggled for runs in the format, scoring 847 runs in 30 matches at an average of 31. Notably, Bailey expects the duo will be back in action for the three-match ODI series in India which starts from September 22 onwards. \"With the World Cup the priority of the squad, it was determined on advice that it was best for Steve and Mitchell to join the group in India by which time we expect them to be fully fit and available for the Indian ODI series, plus the World Cup warm-up fixture,\" he added. The Board has also made Marsh the captain for the ODIs after being promoted as the T20I captain for the Proteas series. Cummins confirmed he will not be part of the complete tour as he is recovering from a wrist fracture. Marsh will lead Australia in his absence. Mitchell Marsh (c), Sean Abbott, , Tim David, Nathan Ellis, Aaron Hardie, Travis Head, Josh Inglis, Spencer Johnson, , Matt Short, , , Mitchell Marsh (c), Sean Abbott, Ashton Agar, , Pat Cummins, Nathan Ellis, Cameron Green, Aaron Hardie, Josh Hazlewood, Travis Head, Josh Inglis, Spencer Johnson, Marnus Labuschagne, Glenn Maxwell, Tanveer Sangha, Marcus Stoinis, David Warner, Adam Zampa","pubDate":"2023-08-18 08:42:03","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"},{"title":"Adam Zampa, Mitchell Marsh will be vital to Australia’s chances in World Cup: Mike Hussey","link":"https://indianexpress.com/article/sports/cricket/adam-zampa-mitchell-marsh-will-be-vital-to-australias-chances-in-world-cup-mike-hussey-8898221/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Former Australian cricketer Mike Hussey believes spinner Adam Zampa and all-rounder Mitchell Marsh will play a crucial role in the team’s bid to clinch the World Cup in India later this year. Leg-spinner Zampa, 31, was first picked in Australia’s limited-overs squad in 2016 and since then has played 79 ODIs taking 131 wickets. With Indian conditions expected to favour spin bowling, Hussey believes Zampa would be the go-to bowler for Pat Cummins’ side. The wrist spinner with a skidding stock delivery played a vital role in Australia’s maiden T20 World Cup triumph in the UAE in 2021, finishing with 13 wickets at an economy rate of just 5.81. “Adam Zampa could play a big role for Australia throughout the tournament,” said Hussey on Friday. “He has been really good over the last few years.” The former cricketer added that the confidence with which Marsh is playing, he could have an enormous impact on the team’s fortunes. “And I think Mitch Marsh is someone that can certainly have a big impact. He has been given a great role, batting in the top three now and he is playing with enormous confidence. So, if he gets his confidence up, he can be a really tough man to stop.” Hussey was part of the Australia side that lifted the 50-over World Cup in 2007 in the West Indies and more recently was part of England’s coaching setup during their winning campaign in the T20 World Cup last year. He also cautioned that Australia will require the services of seniors like Steve Smith to supplement the efforts of Zampa and Marsh. Advertisement “You can’t rely on just one or two key players to win you a World Cup and it’s going to take a collective effort. But I think for Australia to do really well, they need their big guns to really step up and I guess when you think of that, you think of Steve Smith and Pat Cummins.” The 48-year-old also believes Australia will be leading contenders for the World Cup, scheduled to commence on October 5, as the side has “got a bit of continuity as well”. Most Read 1 Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend 2 Gadar 2 box office collection day 6: Sunny Deol film becomes the second-highest grosser of the year, crosses The Kerala Story’s lifetime haul in less than a week 3 Priyanka Chopra pulls out of her New York restaurant Sona, actor’s team says the business a ‘proud and significant moment in her career’ 4 When Salman Khan introduced himself to John Travolta: ‘I work in Indian film industry, my name is…’ 5 Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu See More “I think Australia’s got a great chance as they have kept a (large) group of players together for a period of time now. They all know their roles pretty well and they’ve got a bit of continuity in their team as well.” Even though Australia were bundled out of the 2019 edition of the World Cup by eventual champions England, Hussey feels their chances of success are high because they keep trying to explore new methods to win. “I think they’ve been trying a few little different things. They performed well in the series (in March) against India in Indian conditions and that will give them enormous confidence coming into the World Cup.” Australia defeated India 2-1 in the three-match ODI series. Also Read India vs Ireland T20 Live Streaming: When and where to watch IND vs IRE PCB should delete the video and apologise: Wasim Akram slams Pakistan Cri... Is this the beginning of the end? Dean Elgar laments Cricket South Africa... ‘Never thought it was all over’: Jasprit Bumrah says he is ready for Worl... Advertisement Top Sports News Now R Praggnanandhaa overcomes compatriot Arjun Erigaisi in World Cup quarters in blitz after repeated games failed to find a winner 'Never thought it was all over': Jasprit Bumrah says he is ready for World Cup Unlike Gareth Southgate’s men, Sarina Wiegman’s women highlight English football’s attacking riches Click here for more “And Australia has a great history in World Cup events. So, I know they will be very determined to do extremely well. There’s so many great teams. It’s hard to pick a favourite but I think Australia will give themselves a big chance to be right up there.” Australia were the first to announce their squad for the World Cup, with the five-time champions leaving out star batter Marnus Labuschagne and including uncapped spinner Tanveer Sangha in the group of 18 players, which will be pruned down to 15 prior to the cut-off date on September 28.","pubDate":"2023-08-18 08:38:46","image_url":null,"source_id":"indianexpress","source_priority":1386,"country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Ireland 1st T20I: From Pitch reports to records, all you need to know about The Village, Malahide","link":"https://www.indiatvnews.com/sports/cricket/india-vs-ireland-1st-t20i-from-pitch-reports-to-records-all-you-need-to-know-about-the-village-in-malahide-2023-08-18-887428","keywords":null,"creator":null,"video_url":null,"description":"Team India will be up against Ireland in the T20I series opener at The Village in Malahide on Friday, August 18. For India, the biggest news is Jasprit Bumrah's return and the speedster will be seen leading the troops on the field. The visitors have picked a bunch of youngsters in their side for the series and, likely, some of the players who have already made a name for themselves in India's domestic circuit, including the Indian Premier League will get an opportunity in the series.","content":"Team India will be up against Ireland in the T20I series opener at The Village in Malahide on Friday, August 18. For India, the biggest news is 's return and the speedster will be seen leading the troops on the field. The visitors have picked a bunch of youngsters in their side for the series and, likely, some of the players who have already made a name for themselves in India's domestic circuit, including the Indian Premier League will get an opportunity in the series. For Ireland, it is a chance to test themselves against one of the best outfits and surprise them in their backyard. Ireland would love to improve their record against the Men in Blue as they haven't managed to win a single game against them in the shortest format. The first fixture of the three-match T20I series between the two countries will be played at The Village in Malahide on Friday, August 18 and the remaining two will also be played out at the same venue. Total T20I Matches - 21 Matches won batting first - 8 Matches won bowling first - 13 The wicket at The Village is considered pacer-friendly as the quicks have claimed 132 wickets in the T20Is that have been played at the venue, while spinners have snared 59 wickets to their credit. Hence, it won't be surprising if both teams head into the contest with a pace-heavy look. Paul Stirling (c), Andrew Balbirnie, Lorcan Tucker (wk), Harry Tector, Curtis Campher, George Dockrell, Mark Adair, Barry McCarthy, Fionn Hand, Craig Young, Josh Little, Ben White, Theo van Woerkom, Gareth Delany, Ross Adair Yashasvi Jaiswal, Ruturaj Gaikwad, Tilak Varma, Rinku Singh, Sanju Samson, Jitesh Sharma, Shivam Dube, Washington Sundar, Shahbaz Ahmed, Arshdeep Singh, Ravi Bishnoi, Jasprit Bumrah (c), Prasidh Krishna, Mukesh Kumar, Avesh Khan","pubDate":"2023-08-18 08:30:55","image_url":null,"source_id":"indiatvnews","source_priority":10055,"country":["india"],"category":["sports"],"language":"english"}]}