{"newsArray":[{"title":"Ravichandran Ashwin Surpasses Harbhajan Singh To Become India's 3rd-Highest Wicket-Taker In Tests","link":"https://www.sentinelassam.com/sports/cricket/ravichandran-ashwin-surpasses-harbhajan-singh-to-become-indias-3rd-highest-wicket-taker-in-tests-565408","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"In the second innings, he dismissed Kiwi openers Will Young just ahead of stumps on Day four, before dismissing Latham in the second session of the final day.","content":"New Delhi: With 418 wickets, Indian spinner Ravichandran Ashwin on Monday created history on the last day of the Test match against New Zealand as become India's third-highest wicket-taker in Test cricket. Ashwin achieved this milestone in the second innings of longest format of the game by sending Tom Latham (52) to the pavilion. He surpassed veteran off-spinner Harbhajan, who has taken 417 Test wickets. In the first innings, Ashwin had taken three wickets to take his tally of wickets to 416. In the second innings, he dismissed Kiwi openers Will Young just ahead of stumps on Day four, before dismissing Latham in the second session of the final day. As compare to Ashwin, Anil Kumble and Kapil Dev have taken more wickets for India in theTest match. Kumble, the legendary leg-spinner, had registered 619 scalps in 132 Tests while the former Indian skipper, Kapil Dev, had scalped 434 wickets in 131 appearances. India and New Zealand are facing each other in the first test match in Kanpur. The Indian team has set a target of 284 runs in front of New Zealand and in response the Kiwis have made 125 for 4 wickets till the tea break on the fifth day on Monday. On Saturday, the Ashwin took his 415th wicket and with this he left behind Pakistan legend Wasim Akram in this matter. So far in 2021, has taken 41 wickets and with this feat, he again left behind Pakistan's fast bowler Shaheen Shah Afridi. Notably, Ashwin had achieved this feat only in his 80th Test match. He has now reached number 14 in terms of taking the most wickets in Test cricket. Ashwin made his Test debut in the year 2011 against West Indies. In his Test career, he took five wickets 30 times, while on the other hand has also taken 10 wickets for seven times in a test. Most Active Cricketers with Test Cricket • James Anderson - 166 matches, 632 wickets • Stuart Broad - 149 matches, 524 wickets • Ravichandran Ashwin - 80 matches, 415 wicketsAlso read:Women's Cricket WC Qualifiers called off over Covid fearsAlso watch:","pubDate":"2021-11-29 10:31:40","full_description":"New Delhi: With 418 wickets, Indian spinner Ravichandran Ashwin on Monday created history on the last day of the Test match against New Zealand as become India's third-highest wicket-taker in Test cricket. Ashwin achieved this milestone in the second innings of longest format of the game by sending Tom Latham (52) to the pavilion. He surpassed veteran off-spinner Harbhajan, who has taken 417 Test wickets. In the first innings, Ashwin had taken three wickets to take his tally of wickets to 416. In the second innings, he dismissed Kiwi openers Will Young just ahead of stumps on Day four, before dismissing Latham in the second session of the final day. As compare to Ashwin, Anil Kumble and Kapil Dev have taken more wickets for India in theTest match. Kumble, the legendary leg-spinner, had registered 619 scalps in 132 Tests while the former Indian skipper, Kapil Dev, had scalped 434 wickets in 131 appearances. India and New Zealand are facing each other in the first test match in Kanpur. The Indian team has set a target of 284 runs in front of New Zealand and in response the Kiwis have made 125 for 4 wickets till the tea break on the fifth day on Monday. On Saturday, the Ashwin took his 415th wicket and with this he left behind Pakistan legend Wasim Akram in this matter. So far in 2021, has taken 41 wickets and with this feat, he again left behind Pakistan's fast bowler Shaheen Shah Afridi. Notably, Ashwin had achieved this feat only in his 80th Test match. He has now reached number 14 in terms of taking the most wickets in Test cricket. Ashwin made his Test debut in the year 2011 against West Indies. In his Test career, he took five wickets 30 times, while on the other hand has also taken 10 wickets for seven times in a test. • James Anderson - 166 matches, 632 wickets • Stuart Broad - 149 matches, 524 wickets • Ravichandran Ashwin - 80 matches, 415 wickets Also read: Women's Cricket WC Qualifiers called off over Covid fears Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/11/29/275580-ashwin.jpg","source_id":"sentinel"},{"title":"Warne reignites feud with bold Ashes call","link":"https://www.news.com.au/sport/cricket/shane-warne-reignites-feud-with-mitchell-starc-with-bold-ashes-call/news-story/d426c2fd2b00df577dd6b57db254b00d","keywords":null,"creator":null,"video_url":null,"description":"Cricket legend Shane Warne has again criticised Mitchell Starc’s form and called for him to be dropped from Australia’s side for the Ashes.","content":null,"pubDate":"2021-11-29 10:23:00","full_description":"Cricket legend Shane Warne has again criticised Mitchell Starc’s form and called for him to be dropped from Australia’s side for the Ashes. Starc has had an underwhelming 12 months in the national side by his standards, going back to last summer’s Test series against India, in which he only snared 11 wickets in four matches at an average of 40.72. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > The left-arm paceman’s sub-par form in national colours continued at the recent T20 World Cup, where he took nine wickets at 27.55 and leaked runs — notably in the final against New Zealand, where he went 0/60 off his four overs. Warne has long been a critic of Starc, famously taking aim at the quick’s body language several years ago and just earlier this month, saying he’s “nowhere” as he expressed concerns about Australia’s squad for the Ashes. Now the spin king has doubled down, suggesting Starc should be left out of the team for the Ashes in favour of in-form West Australian Jhye Richardson, while also declaring off-spinner Nathan Lyon’s spot is under pressure after a poor showing against India. “He (Lyon) had a poor summer last year, so did Mitchell Starc,” Warne said. “He (Starc) needs to find a bit of rhythm and some form. “He had a really poor World Cup. He’s just not bowling well enough. “It’s too important at the Gabba. I’m all for Jhye Richardson (replacing Starc in the team).” Starc, 31, has taken 255 wickets at an average of 27.57 across 61 Tests for Australia. Warne, who took 708 Test wickets for Australia, said he hoped fellow leg-spinner Mitch Swepson puts some heat on Lyon for the spinner’s spot. “I hope Mitch Swepson, as a leg-spinner, puts some pressure on Nathan Lyon,” he said. Warne would also like to see wicketkeeper Josh Inglis given his debut over Alex Carey, who is the frontrunner to take over the gloves following Tim Paine’s decision to step aside from cricket for the foreseeable future. “I just think Josh Inglis is ready,” he said. “He’s coming off form with three first-class hundreds last year.” With the first Test at the Gabba starting on December 8 barely a week away, there appears to be three spots in Australia’s XI still up for grabs. On top of the Starc-Richardson and Carey-Inglis duels, one of Usman Khawaja or Travis Head seem set to take the No. 5 batting position. But the selectors face a tough task to decide the final line-up after both Khawaja and Head produced very solid performances in their Sheffield Shield match-up last week. And they may have to go off gut feel, with wild weather to likely force a three-day practice match between the Australia and Australia A squads scheduled for this week to be cancelled . Australia’s Ashes practice match is ‘extremely unlikely’ to go ahead, as southeast Queensland continues to report miserable weather. Shane Warne knows what makes a top-line BBL bowler. Here are the five names you should have on your KFC SuperCoach shopping list this summer. Shane Warne has been left battered and bruised after a motorbike accident on Sunday and could have a broken foot.","image_url":null,"source_id":"news"},{"title":"Aakash Chopra Hails Ravichandran Ashwin On Achieving \"Incredible Feat\"","link":"https://sports.ndtv.com/cricket/next-stop-500-aakash-chopra-hails-ravichandran-ashwin-on-becoming-indias-third-highest-wicket-taker-in-test-cricket-2629204","keywords":null,"creator":null,"video_url":null,"description":"IND vs NZ: Former cricketer Aakash Chopra on Monday congratulated India all-rounder Ravichandran Ashwin on becoming the country's third-highest wicket-taker in Test cricket.","content":null,"pubDate":"2021-11-29 10:15:04","full_description":"Former cricketer Aakash Chopra on Monday congratulated India all-rounder Ravichandran Ashwin on becoming the country's third-highest wicket-taker in Test cricket. Ashwin achieved the feat during New Zealand's second innings of the ongoing first Test at the Green Park Stadium in Kanpur. He surpassed spin great Harbhajan Singh's tally of 417 wickets to reach the milestone. Taking to Koo, the former India batter wrote: \"418. Third highest wicket-taker in Tests for India. Incredible feat. One of the biggest match-winners that India has produced. Next stop-500.\" Ahead of the first Test, Ashwin needed 5 wickets to pip Harbhajan in the elite list. After taking three wickets in the first innings, Ashwin castled New Zealand vice-captain Tom Latham to achieve the feat. Only Anil Kumble and Kapil Dev have taken more wickets for India in the whites than the 35-year-old. Kumble had registered 619 scalps in 132 Tests while the former Indian skipper, Kapil Dev, had scalped 434 wickets in 131 appearances. India are in a good position in the Kanpur Test and eyeing victory after the Kane Williamson-led side lost wickets in quick succession. Promoted After managing to keep the Indian bowlers at bay in the first sesssion on Day five, the New Zealand batters crumbled under pressure as the Indian spinners, led by Ashwin, weaved their magic. Currently, New Zealand are 138/7, still needing 146 runs to win. So far, Ashwin and Ravindra Jadeja have taken three and two wickets, respectively, while Axar Patel and Umesh Yadav also registered a scalp each.","image_url":"https://c.ndtvimg.com/2021-11/kesharl8_ravichandran-ashwin-afp_625x300_29_November_21.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"India vs New Zealand 1st Test: R Ashwin surpasses THIS big record of Harbhajan Singh","link":"https://zeenews.india.com/cricket/india-vs-new-zealand-1st-test-r-ashwin-surpasses-this-big-record-of-harbhajan-singh-2414541.html","keywords":null,"creator":null,"video_url":null,"description":"Only Anil Kumble and Kapil Dev have taken more wickets for India in Test cricket than Ashwin (418).","content":null,"pubDate":"2021-11-29 10:11:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"IND vs NZ 1st Test: Ashwin third highest wicket-taker in Tests for India, overtakes Harbhajan","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-nz-1st-test-ashwin-third-highest-wicket-taker-in-tests-for-india-overtakes-harbhajan-747269","keywords":null,"creator":null,"video_url":null,"description":"Senior off-spinner Ravichandran Ashwin on Monday became India's third-highest wicket-taker in Test cricket as New Zealand skipper Kane Williamson stood between hosts and victory, taking his team to 125 for 4 at tea on the final day of the series opener.","content":null,"pubDate":"2021-11-29 09:53:06","full_description":"Senior off-spinner Ravichandran Ashwin on Monday became India's third-highest wicket-taker in Test cricket as New Zealand skipper stood between hosts and victory, taking his team to 125 for 4 at tea on the final day of the series opener. New Zealand now need 159 runs to win in 31.5 overs but Williamson (24 batting 97 balls) will be looking at a draw which will be creditable enough for the Black Caps, as they go into the final session with six wickets in hand. If the first session completely belonged to New Zealand who didn't lose a single wicket, the second session certainly belonged to India as (1/3in 12 overs) removed night-watchman Will Somerville (36 off 110 balls) with a short ball immediately after post-lunch resumption. It was who took a fine catch diving forward at long leg boundary. Williamson looked way more confident than his first innings effort as he hit a cover drive off (0/20 in 7 overs), who was completely off-colour on the day. (2) never looked comfortable and at stroke of tea, (1/21 in 11.1 overs) finally bowled one that had his number. Tom Latham (52 off 146 balls) scored another half-century before Ashwin's (20-6-28-2) delivery kept low and he dragged one onto the stumps. With that scalp, Ashwin in his 80th Test, crossed Harbhajan Singh (417 in 103 games) to become the third-highest wicket-taker for India in the five-day format. \"I would like to congratulate Ashwin on his milestone. Well done and hope he wins many more matches for India,\" Harbhajan told PTI. \"I never believed in comparisons. We played our best cricket in different times, against different opposition. I had done my best for the country back then and ditto for Ashwin, he did his best now,\" the former India spinner said. In the morning, Somerville displayed a lot of character defying the Indian bowling attack alongside senior opener Latham as they added 76 runs. One Jadeja delivery turned back sharply into Latham after being pitched on the rough created outside the off-stump by bowler's footmarks. India took a DRS but the replay showed that it didn't pitch in line. Otherwise, the duo wasn't really perturbed by the Indian spinners, who found it difficult to create too many chances. It also didn't help that two fast bowlers Ishant and Umesh bowled in complete contrast to what their Kiwi counterparts and Kyle Jamieson did on this very pitch. Just like he looked in England, Ishant's run-up was again gingerly and not for once during the morning spell did he look in rhythm. He and Umesh tried the short-ball tactic to the unfancied Somerville but he swayed and ducked without any discomfort and also played the rising delivery with soft hands.","image_url":null,"source_id":"indiatvnews"},{"title":"Ravichandran Ashwin goes past Harbhajan Singh, becomes India's third highest wicket-taker in Tests","link":"https://www.tribuneindia.com/news/sports/ravichandran-ashwin-goes-past-harbhajan-singh-becomes-indias-third-highest-wicket-taker-in-tests-344250","keywords":null,"creator":null,"video_url":null,"description":"Kanpur, November 29 Seasoned off-spinner Ravichandran Ashwin on Monday went past Harbhajan Singh to become the third highest wicket-taker for India in Test cricket, reaching the mark in his 80th match. The legendary Anil Kumble tops the chart with 619 scalps and is followed by India's first World Cup-winning captain Kapil Dev, who has a total of 434 wickets under his name. The 35-year-old Ashwin drew level with Harbhajan (417 in 103 games), who remains one of India's finest spinners, when he took the wicket of New Zealand opener Will Young towards the end of the fourth day in the opening Test here. The tweaker then dismissed Tom Latham to get his 418th Test wicket. In New Zealand's first innings, he had registered figures of 3/82 in 42.3 overs, helping the hosts gain a handy 49-run lead by bowling out the opposition for 296. \"I would like to congratulate Ashwin on his milestone. Well done and hope he wins many more matches for India,\" Harbhajan told PTI. \"I never believed in comparisons. We played our best cricket in different times, against different opposition. I had done my best for the country back then and ditto for Ashwin, he did his best now,\" the former India spinner added. Ashwin is the fourth Indian bowler to take more than 400 wickets in Test cricket. He also became the 13th highest Test wicket-taker of all time, moving past Pakistani fast bowling great Wasim Akram (414) as well apart from Harbhajan. Among active Test cricketers, Ashwin is the third highest wicket-taker after English pacers Stuart Broad (524) and James Anderson (632). Ashwin made his Test debut in November 2011 against the West Indies in Delhi. His wickets have come at a strike rate of 52.4 and an average of 24.56. Apart from his exploits with the ball, Ashwin is also known for his capability with the bat, scoring 2,685 runs at an average of 27.68 with five centuries to his name. The man from Chennai has also taken 150 wickets in 111 ODIs and is the third-highest wicket taker for India in T20Is with 61 scalps from 51 matches. PTI","content":null,"pubDate":"2021-11-29 09:41:54","full_description":"Kanpur, November 29 Seasoned off-spinner Ravichandran Ashwin on Monday went past Harbhajan Singh to become the third highest wicket-taker for India in Test cricket, reaching the mark in his 80th match. The legendary Anil Kumble tops the chart with 619 scalps and is followed by India's first World Cup-winning captain Kapil Dev, who has a total of 434 wickets under his name. The 35-year-old Ashwin drew level with Harbhajan (417 in 103 games), who remains one of India's finest spinners, when he took the wicket of New Zealand opener Will Young towards the end of the fourth day in the opening Test here. The tweaker then dismissed Tom Latham to get his 418th Test wicket. In New Zealand's first innings, he had registered figures of 3/82 in 42.3 overs, helping the hosts gain a handy 49-run lead by bowling out the opposition for 296. \"I would like to congratulate Ashwin on his milestone. Well done and hope he wins many more matches for India,\" Harbhajan told PTI. \"I never believed in comparisons. We played our best cricket in different times, against different opposition. I had done my best for the country back then and ditto for Ashwin, he did his best now,\" the former India spinner added. Ashwin is the fourth Indian bowler to take more than 400 wickets in Test cricket. He also became the 13th highest Test wicket-taker of all time, moving past Pakistani fast bowling great Wasim Akram (414) as well apart from Harbhajan. Among active Test cricketers, Ashwin is the third highest wicket-taker after English pacers Stuart Broad (524) and James Anderson (632). Ashwin made his Test debut in November 2011 against the West Indies in Delhi. His wickets have come at a strike rate of 52.4 and an average of 24.56. Apart from his exploits with the ball, Ashwin is also known for his capability with the bat, scoring 2,685 runs at an average of 27.68 with five centuries to his name. The man from Chennai has also taken 150 wickets in 111 ODIs and is the third-highest wicket taker for India in T20Is with 61 scalps from 51 matches. PTI","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/11/2021_11$largeimg_965336257.jpg","source_id":"tribuneindia"},{"title":"English great baffled by Australia's Smith call","link":"https://wwos.nine.com.au/cricket/the-ashes-2021-debate-continues-steve-smith-vice-captaincy-call-stephen-harmison-mark-taylor-ian-chappell/10a417fb-bf79-4f31-898e-be559175bf4b","keywords":null,"creator":["wwos"],"video_url":null,"description":"Debate over whether Steve Smith should have been named Australia's Test captain continues to rage ahead of the Ashes.","content":"Debate over whether Steve Smith should have been named Australia's Test captain continues to rage, with a former England star claiming Australia got the decision wrong. While Smith returned to an official leadership role, named as new captain Pat Cummins' deputy, ex-England quick Steve Harmison said Smith should be the skipper instead.\"I don't think this is the Australia of old … it's a big call,'' he told the Cricket Collective podcast.READ MORE: Judges' scorecards almost rob George Kambosos of historic title\"I think England would be happier with Cummins than Steve Smith. For me, if you put too much pressure on Pat in the Ashes that could prove the difference, because both batting units are frail and can be got at.\"I look at that decision being a big gamble for Australia. If there is nobody else, fine. I am not Australian, but I think if you had a natural leader there who has done the job before, you would have to go with him.\"If I was an Australian, I would not have a problem with Steve Smith coming back.\"While Harmison is a supporter of Smith's, others have not been so complimentary, as Smith himself predicted, with former Australian skipper Ian Chappell particularly scathing in his assessment. However, Smith has another ex-skipper in his corner, with Mark Taylor calling him the perfect deputy for a first-time captain in Cummins.\"[Cummins] will do a different job to what we've seen [from old captains],\" Taylor said on 2GB's Wide World of Sports Radio.\"Because he's a fast bowler and because he'll be required to huff and puff and knock guys over and bowl long spells and at times really bend the back, he's going to need some help out there in between those overs to get the field right, to get the bowlers right, to make sure other things aren't slipping away while he's trying to get wickets.\"He's going to need a very good deputy, and I think the right bloke is Steve Smith. It was interesting that Pat was very quick to in a way anoint him as his deputy at his press conference.READ MORE: Umpire's shocker remains after NZ batter takes too long to challengeREAD MORE: Frank Williams, Williams F1 team founder, dies at 79\"He knows he'll need him and he knows Steve Smith's got the experience ... and he will need someone to lean on in those really tough moments.\"Particularly when it comes to Nathan Lyon, I think that's going to be the most telling time. Steve Smith has now captained Nathan Lyon and obviously grown up playing with Nathan Lyon, that experience will be invaluable.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-11-29 09:37:27","full_description":"Debate over whether Steve Smith should have been named Australia's Test captain continues to rage, with a former England star claiming Australia got the decision wrong. While Smith returned to an official leadership role, named as new captain Pat Cummins ' deputy, ex-England quick Steve Harmison said Smith should be the skipper instead. \"I don't think this is the Australia of old … it's a big call,'' he told the Cricket Collective podcast. READ MORE: Judges' scorecards almost rob George Kambosos of historic title \"I think England would be happier with Cummins than Steve Smith. For me, if you put too much pressure on Pat in the Ashes that could prove the difference, because both batting units are frail and can be got at. \"I look at that decision being a big gamble for Australia. If there is nobody else, fine. I am not Australian, but I think if you had a natural leader there who has done the job before, you would have to go with him. \"If I was an Australian, I would not have a problem with Steve Smith coming back.\" While Harmison is a supporter of Smith's, others have not been so complimentary, as Smith himself predicted , with former Australian skipper Ian Chappell particularly scathing in his assessment . However, Smith has another ex-skipper in his corner, with Mark Taylor calling him the perfect deputy for a first-time captain in Cummins. \"[Cummins] will do a different job to what we've seen [from old captains],\" Taylor said on 2GB's Wide World of Sports Radio. \"Because he's a fast bowler and because he'll be required to huff and puff and knock guys over and bowl long spells and at times really bend the back, he's going to need some help out there in between those overs to get the field right, to get the bowlers right, to make sure other things aren't slipping away while he's trying to get wickets. \"He's going to need a very good deputy, and I think the right bloke is Steve Smith. It was interesting that Pat was very quick to in a way anoint him as his deputy at his press conference. READ MORE: Umpire's shocker remains after NZ batter takes too long to challenge READ MORE: Frank Williams, Williams F1 team founder, dies at 79 \"He knows he'll need him and he knows Steve Smith's got the experience ... and he will need someone to lean on in those really tough moments. \"Particularly when it comes to Nathan Lyon, I think that's going to be the most telling time. Steve Smith has now captained Nathan Lyon and obviously grown up playing with Nathan Lyon, that experience will be invaluable.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/396226/pickerimage.jpg","source_id":"nine"},{"title":"Harbhajan Congratulates Ashwin On Latter Overtaking Him In All-Time List","link":"https://sports.ndtv.com/cricket/harbhajan-singh-congratulates-ravichandran-ashwin-after-latter-goes-past-him-in-all-time-test-wicket-takers-list-2629138","keywords":null,"creator":null,"video_url":null,"description":"Indian spin great Harbhajan Singh took to Twitter on Monday to congratulate Ravichandran Ashwin after the latter became India's third-highest wicket-taker in Test cricket on Monday.","content":null,"pubDate":"2021-11-29 09:32:51","full_description":"Indian spin great Harbhajan Singh took to Twitter on Monday to congratulate Ravichandran Ashwin after the latter became India's third-highest wicket-taker in Test cricket on Monday. Ashwin dismissed Tom Latham in the second session to go past Harbhajan's tally of 417 wickets in Tests. \"Congratulations @ashwinravi99 wish you many more brother.. God bless.. keep shining,\" Harbhajan wrote in a tweet on Monday. Ashwin is now behind Anil Kumble (619) and Kapil Dev (434) in India's all-time list of highest Test wicket-takers. Congratulations @ashwinravi99 wish you many more brother.. God bless.. keep shining Meanwhile, Ashwin's superb performances with both and ball have prompted wicketkeeper-batter Dinesh Karthik to compare him to Kapil Dev. \"Obviously, I don't think I am in a place to judge both of them, but I must admit that they should be spoken of in the same breath when it comes to Indian cricket because both of them have been match-winners, have been exemplary, and have been definitely the two best all-rounders to have come out of this soil for a long, long time,\" Karthik said during a discussion with Simon Doull on Cricbuzz. \"You have to put him there (among India's best all-rounders) with the number of Man of the Series he has won, the accolades he has got obviously. Promoted \"Getting 417 wickets in 80 Tests is an unbelievable record to have and the fact that he's contributed and scored five hundreds, much more than a lot of the batters who play for a longer period of time in Test matches. There are people who have played 30-35 Tests, and still haven't managed five hundreds,\" he added. India are in a good position in the Kanpur Test and eyeing victory after the visitors lost wickets in quick succession.","image_url":"https://c.ndtvimg.com/2021-11/vol7gido_r-ashwin-afp_625x300_29_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"Ashwin beats Harbhajan to become India's 3rd-highest wicket-taker in Tests","link":"https://www.business-standard.com/article/news-ani/ashwin-beats-harbhajan-to-become-india-s-3rd-highest-wicket-taker-in-tests-121112900555_1.html","keywords":null,"creator":null,"video_url":null,"description":"India spinner Ravichandran Ashwin on Monday surpassed Harbhajan Singh to become the country's third-highest wicket-taker in Test cricket.Ashwin scalped the wicket of Tom Latham (52) on the ongoing Day 5 of the first Test against New Zealand and hence he achieved the feat.The off-spinner had equalled Harbhajan's tally of 417 wickets on Sunday after he dismissed Will Young on Day 4.Ashwin has so far taken 30 five-wicket hauls in his career.In the first innings of the ongoing Test, Ashwin had taken three wickets while Axar Patel took five.Nightwatchman Will Somerville and opening batter Tom Latham held the fort as New Zealand did not lose a single wicket in the opening session of Day 5 of the ongoing first Test against India here at Green Park, Kanpur on Monday.At lunch break, New Zealand's score read 79/1 with the visitors still needing 205 more runs for the win. Somerville and Latham are currently unbeaten at the crease.","content":null,"pubDate":"2021-11-29 08:40:00","full_description":"India spinner Ravichandran Ashwin on Monday surpassed Harbhajan Singh to become the country's third-highest wicket-taker in Test cricket. Ashwin scalped the wicket of Tom Latham (52) on the ongoing Day 5 of the first Test against New Zealand and hence he achieved the feat. The off-spinner had equalled Harbhajan's tally of 417 wickets on Sunday after he dismissed Will Young on Day 4. Ashwin has so far taken 30 five-wicket hauls in his career. In the first innings of the ongoing Test, Ashwin had taken three wickets while Axar Patel took five. Nightwatchman Will Somerville and opening batter Tom Latham held the fort as New Zealand did not lose a single wicket in the opening session of Day 5 of the ongoing first Test against India here at Green Park, Kanpur on Monday. At lunch break, New Zealand's score read 79/1 with the visitors still needing 205 more runs for the win. Somerville and Latham are currently unbeaten at the crease. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211129/thumb-121112900555.jpg","source_id":"business-standard"},{"title":"IPL Retention 2022 Live Telecast Channel in India: When and where to watch IPL 2022 Player Retention?","link":"https://thesportsrush.com/cricket-news-ipl-retention-2022-live-telecast-channel-in-india-when-and-where-to-watch-ipl-2022-player-retention/","keywords":["Cricket","IPL 2022","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IPL Retention 2022 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of IPL Retention 2022. The player retention event ahead of the 15th season of the Indian Premier League will be held tomorrow exactly a month and a half after the completion of the previous season of the IPL.… The post IPL Retention 2022 Live Telecast Channel in India: When and where to watch IPL 2022 Player Retention? appeared first on The SportsRush.","content":"IPL Retention 2022 Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of IPL Retention 2022. The player retention event ahead of the 15th season of the Indian Premier League will be held tomorrow exactly a month and a half after the completion of the previous season of the IPL. Readers must note that franchises had to name their list of retained players by November 30 (Tuesday). For now, only Delhi Capitals have officially confirmed their four retained players. Rajasthan Royals, on the other hand, have retained captain Sanju Samson. However, Royals still have a cushion of retaining more players. Since the IPL retention day is the first preparatory step taken by teams ahead of the upcoming season, the day will be keenly followed by fans of the biggest T20 league in the world. The retention day holds all the more importance ahead of a season which will have a mega auction with two new teams participating in it. | With the mega auction around the corner, our scouts are watching a lot of cricket!#RoyalsFamily | @JakeLushMcCrum | @romibhinder pic.twitter.com/VjNkL4DWfE — Rajasthan Royals (@rajasthanroyals) November 28, 2021 IPL Retention 2022 Live Telecast Channel in India Star Sports Network, host broadcaster of the Indian Premier League, will be broadcasting the retention event ahead of the 15th season of the biggest T20 tournament in India. As is generally the case with Star Sports Network, they are expected to put forward numerous options for fans to watch IPL Retention 2022. At this point in time, Star haven’t revealed the exact channels on which IPL 2022 retention event will be televised. Having said that, the program is highly likely to be televised on main channels namely Star Sports 1/1 HD and Star Sports 1 Hindi/1 HD Hindi. It can’t be said if IPL 2022 retention event will be covered in any other language other than English and Hindi. Online users can stream IPL retention 2022 on Star’s streaming application named Disney+Hotstar. It is worth mentioning that the match won’t be available on any other streaming platform in India. Date – 30/11/2021 (Tuesday). Match start Time – 05:00 PM (IST). TV Channels – Star Sports Network. Online platform – Disney+Hotstar. The post IPL Retention 2022 Live Telecast Channel in India: When and where to watch IPL 2022 Player Retention? appeared first on The SportsRush.","pubDate":"2021-11-29 08:39:45","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Ashes 2021-22: Australia’s crucial practice match ‘extremely unlikely’ to go ahead in Brisbane","link":"https://www.perthnow.com.au/sport/australias-crucial-ashes-practice-match-extremely-unlikely-to-go-ahead-c-4748261","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"Australia’s Ashes preparation has been thrown into disarray, with Cricket Australia confirming a crucial practice match scheduled for this week is ‘extremely unlikely’ to go ahead.","content":null,"pubDate":"2021-11-29 08:38:44","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4748261/77ccf056e5fcf3243d9e71ab7826c78df2d3344d-16x9-x0y0w4170h2346.jpg","source_id":"perthnow"},{"title":"Ashwin Surpasses Harbhajan, Becomes India's 3rd-Highest Test Wicket-Taker","link":"https://sports.ndtv.com/cricket/ravichandran-ashwin-surpasses-harbhajan-singh-to-become-indias-3rd-highest-wicket-taker-in-tests-2629022","keywords":null,"creator":null,"video_url":null,"description":"Ravichandran Ashwin on Monday became India's third-highest all-time wicket-taker in Test cricket, surpassing veteran off-spinner Harbhajan Singh in the elite list.","content":null,"pubDate":"2021-11-29 08:31:45","full_description":"Ravichandran Ashwin on Monday became India's third-highest all-time wicket-taker in Test cricket, surpassing veteran off-spinner Harbhajan Singh in the elite list. He achieved this feat on Day five of the ongoing first Test between India and New Zealand at the Green Park Stadium in Kanpur . He dismissed the Kiwi vice-captain Tom Latham to reach the milestone. Ahead of the first Test, Ashwin needed five wickets to pip Harbhajan Singh's tally of 417 wickets in the longest format of the game. In the first innings, Ashwin had taken three wickets to take his tally of wickets to 416. In the second innings, he dismissed Kiwi openers Will Young just ahead of stumps on Day four, before castling Latham in the second session of the final day. Only Anil Kumble and Kapil Dev have taken more wickets for India in the whites than Ashwin (418). Kumble, the legendary leg-spinner, had registered 619 scalps in 132 Tests while the former Indian skipper, Kapil Dev, had scalped 434 wickets in 131 appearances. After declaring their second innings on 234/7, India have handed New Zealand a stiff target of 284 runs in the first Test. The Kiwis were 79/1 at Lunch on Day five before Umesh Yadav gave India the much-needed breakthrough on the first ball of the second session. Promoted Ashwin then got the better of Latham to put the visitors three down. With just over two hours of play left, it will be interesting to see whether the Indian bowlers can work their magic. Intially, India had scored 345 in the first innings before Axar Patel's five-for saw the Kiwis being bowled out for 296, trailing India by 49 runs.","image_url":"https://c.ndtvimg.com/2021-11/sjar56u8_r-ashwin-afp_120x90_29_November_21.jpg","source_id":"ndtv"},{"title":"MCG in the market for day-night Ashes Test if Perth falls over","link":"https://www.smh.com.au/sport/cricket/mcg-in-the-market-for-day-night-ashes-test-if-perth-falls-over-20211129-p59d0d.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Should Perth lose its Ashes Test nothing is stopping Cricket Australia from scheduling a second day-night match of the series, in a slot that has delivered huge crowds to the MCG.","content":null,"pubDate":"2021-11-29 08:30:00","full_description":"Should Perth lose its Ashes Test nothing is stopping Cricket Australia from scheduling a second day-night match of the series, in a mid-January slot that has historically delivered huge crowds to the MCG. Sources told The Age and The Sydney Morning Herald that the tour agreement between Australia and England places no restriction on the number of pink ball matches, meaning the way would be open to a floodlit game in the eastern states to balance the loss of the broadcast-friendly Western Australia time zone. Big crowds have often flocked to the MCG for day-night games in January. Credit: Getty Images Tasmanian lobbying to hold the fifth Test at Hobart’s Bellerive Oval has stepped up since the WA Cricket chief executive Christina Matthews conceded her state was no better than a “50/50” chance to host the final match from January 14-18 due to the vast array of broadcast and technical staff needing to travel to Perth. Options at the disposal of the Tasmanian state government would include an arrangement with CA to underwrite any difference between Hobart attendances and Bellerive’s full capacity. Still more ambitious would be an offer to do a similar deal against projected revenue for a match played in a larger venue such as the SCG or MCG. What’s not in doubt is the fact that day/night fixtures at the MCG and SCG in mid-January have always tended to attract vast crowds during school holidays, even if they have traditionally been of the white ball variety. The overall average for Australia’s January day-night ODI matches at the MCG between the late 1980s and the start of the Twenty20 era in 2008 is just shy of 62,000. For Australia v England matches during the period, the attendance shoots up accordingly: 73,282 in 1995, 82,299 in 1999 and 78,625 in 2007. In more recent seasons, January T20 matches have consistently attracted huge crowds, including for Big Bash League derbies between the Melbourne Stars and Renegades. These games included a stunning 80,883 for the derby in January 2015, and 71,098 for the same fixture the following year. Both the SCG Trust and the Melbourne Cricket Club have reached out to Cricket Australia in recent weeks to offer their assistance, although it is thought that staging back-to-back games at the SCG would be a harder sell than to return to the MCG two weeks after the conclusion of the Boxing Day Test. “We’ve snuck another [pitch] in right beside it,” the MCC chief executive Stuart Fox told 3AW radio of the pitch for December 26. “We’re never cheeky about these things because we’ve lost two grand finals and I don’t like seeing other states pinch content. But we’re ready if we’re needed, and if Cricket Australia just accidentally made a phone call to us and said, ‘We need you to host a second Test,’ we’d be ready to go. “It’s pretty simple, I’ve spoken to Nick Hockley and said there’s a spare pitch there if any of the states get into trouble with a border closure, we’re happy to help out, but we know we’ve been at the opposite end of the conversation where we’ve lost content. So, I’m hoping we get this Test and series away with little disruption.” England’s director of cricket, Ashley Giles, said overnight that the tourists were awaiting further clarification from CA around the status of the Perth Test, and also an update about possible complications for the group of families due to fly into Melbourne ahead of Christmas due to the emergence of the new Omicron strain of COVID-19. “We’re obviously hoping it won’t affect anything,” Giles said on Sunday night. “There are going to be changes to those border controls in terms of our families being able to travel etc. and we clearly hope that’s not going to affect us. “But we are in the hands of national and local governments. We always knew things could change. We will do everything we can to make sure the families are accommodated and of course that the players are happy.” England are due to begin a four-day practice match against the England Lions in Brisbane from Tuesday, although heavy rain forecast for southern Queensland are likely to curtail the fixture. Ben Stokes has revealed that he suffered a heavy blow to the arm in training on Sunday, although he continued to bat after receiving attention from the team physio.","image_url":null,"source_id":"smh"},{"title":"MCG in the market for day-night Ashes Test if Perth falls over","link":"https://www.theage.com.au/sport/cricket/mcg-in-the-market-for-day-night-ashes-test-if-perth-falls-over-20211129-p59d0d.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Should Perth lose its Ashes Test nothing is stopping Cricket Australia from scheduling a second day-night match of the series, in a slot that has delivered huge crowds to the MCG.","content":null,"pubDate":"2021-11-29 08:30:00","full_description":"Should Perth lose its Ashes Test nothing is stopping Cricket Australia from scheduling a second day-night match of the series, in a mid-January slot that has historically delivered huge crowds to the MCG. Sources told The Age and The Sydney Morning Herald that the tour agreement between Australia and England places no restriction on the number of pink ball matches, meaning the way would be open to a floodlit game in the eastern states to balance the loss of the broadcast-friendly Western Australia time zone. Big crowds have often flocked to the MCG for day-night games in January. Credit: Getty Images Tasmanian lobbying to hold the fifth Test at Hobart’s Bellerive Oval has stepped up since the WA Cricket chief executive Christina Matthews conceded her state was no better than a “50/50” chance to host the final match from January 14-18 due to the vast array of broadcast and technical staff needing to travel to Perth. Options at the disposal of the Tasmanian state government would include an arrangement with CA to underwrite any difference between Hobart attendances and Bellerive’s full capacity. Still more ambitious would be an offer to do a similar deal against projected revenue for a match played in a larger venue such as the SCG or MCG. What’s not in doubt is the fact that day/night fixtures at the MCG and SCG in mid-January have always tended to attract vast crowds during school holidays, even if they have traditionally been of the white ball variety. The overall average for Australia’s January day-night ODI matches at the MCG between the late 1980s and the start of the Twenty20 era in 2008 is just shy of 62,000. For Australia v England matches during the period, the attendance shoots up accordingly: 73,282 in 1995, 82,299 in 1999 and 78,625 in 2007. In more recent seasons, January T20 matches have consistently attracted huge crowds, including for Big Bash League derbies between the Melbourne Stars and Renegades. These games included a stunning 80,883 for the derby in January 2015, and 71,098 for the same fixture the following year. Both the SCG Trust and the Melbourne Cricket Club have reached out to Cricket Australia in recent weeks to offer their assistance, although it is thought that staging back-to-back games at the SCG would be a harder sell than to return to the MCG two weeks after the conclusion of the Boxing Day Test. “We’ve snuck another [pitch] in right beside it,” the MCC chief executive Stuart Fox told 3AW radio of the pitch for December 26. “We’re never cheeky about these things because we’ve lost two grand finals and I don’t like seeing other states pinch content. But we’re ready if we’re needed, and if Cricket Australia just accidentally made a phone call to us and said, ‘We need you to host a second Test,’ we’d be ready to go. “It’s pretty simple, I’ve spoken to Nick Hockley and said there’s a spare pitch there if any of the states get into trouble with a border closure, we’re happy to help out, but we know we’ve been at the opposite end of the conversation where we’ve lost content. So, I’m hoping we get this Test and series away with little disruption.” England’s director of cricket, Ashley Giles, said overnight that the tourists were awaiting further clarification from CA around the status of the Perth Test, and also an update about possible complications for the group of families due to fly into Melbourne ahead of Christmas due to the emergence of the new Omicron strain of COVID-19. “We’re obviously hoping it won’t affect anything,” Giles said on Sunday night. “There are going to be changes to those border controls in terms of our families being able to travel etc. and we clearly hope that’s not going to affect us. “But we are in the hands of national and local governments. We always knew things could change. We will do everything we can to make sure the families are accommodated and of course that the players are happy.” England are due to begin a four-day practice match against the England Lions in Brisbane from Tuesday, although heavy rain forecast for southern Queensland are likely to curtail the fixture. Ben Stokes has revealed that he suffered a heavy blow to the arm in training on Sunday, although he continued to bat after receiving attention from the team physio.","image_url":null,"source_id":"theage"},{"title":"Aussie Ashes prep in disarray as crucial last audition likely canned","link":"https://www.foxsports.com.au/cricket/the-ashes/cricket-australia-2021-ashes-preparation-australia-a-vs-australia-practice-match-weather-likely-cancelled-alex-carey-josh-inglis/news-story/b55f2947f08da0fe2157263740006781","keywords":null,"creator":null,"video_url":null,"description":"Australia’s Ashes preparation has been thrown into disarray, with Cricket Australia confirming that a crucial practice match scheduled for this week is “extremely unlikely” to go ahead.","content":null,"pubDate":"2021-11-29 08:16:00","full_description":"Australia’s Ashes preparation has been thrown into disarray, with Cricket Australia confirming that a crucial practice match scheduled for this week is “extremely unlikely” to go ahead. The Australia and Australia A squads had been due to face off in a three-day practice match from Wednesday but wet weather in South East Queensland has forced Cricket Australia to begin planning other sessions. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > The likely cancellation of the match means selectors will miss their only chance to see the squad’s repatriated T20 World Cup players — including Steve Smith, David Warner, Mitchell Starc, Josh Hazlewood and new captain Pat Cummins — playing in a fully-fledged red-ball game setting before the Ashes begin on December 8. All five are locks for selection in the first Test at the Gabba but none have played red-ball cricket since last summer’s Sheffield Shield season. Meanwhile Alex Carey and Josh Inglis were among those set to line up for Australia A in the hunt to replace Tim Paine. Revisiting Harmison's INFAMOUS wide | 01:09 A CA spokesman confirmed on Monday evening that Australia wouldn’t train on Tuesday, and that the first day of the proposed practice match would likely be replaced with centre wicket and net practice sessions. It won’t be the first time Australian sessions have been scrapped ahead of the five-Test series — wet weather forced Australia to miss out on training last Wednesday and Thursday. England, also based out of a South East Queensland hub, is similarly coming to grips with the strong possibility of missing out on its last match simulation. The remaining members of the England squad will join their teammates in camp tomorrow after they are released from quarantine on the Gold Coast. They’d have been available to play in a four-day intra-squad match at Ian Healy Oval in Brisbane this week but that hitout, like Australia’s, is unlikely to go ahead. Cummins was unveiled as Tim Paine’s successor on Friday. (Photo by Visionhaus/Getty Images) Source: Supplied Despite the disjointed preparation for key members of the squad, Australian bowling coach Andrew McDonald indicated on Sunday that there would be “no excuses” for a slow start to the Ashes. “We’ve had fantastic facilities up here,” he said from Australia’s Gold Coast hub. “The weather’s been challenging at times but we’ve still been able to get out into the centre. “Also, these guys have got a lot of Test experience to draw upon. So changing formats is something that they’ve been able to deal with across their careers. “I think we’ll be really, really, really well-prepared.”","image_url":null,"source_id":"foxsports"},{"title":"Ashes prep thrown into disarray","link":"https://www.news.com.au/sport/cricket/australias-crucial-ashes-practice-match-extremely-unlikely-to-go-ahead/news-story/b0f93af789e8fc8136542fb37c19f194","keywords":null,"creator":null,"video_url":null,"description":"Australia’s Ashes preparation has been thrown into disarray, with Cricket Australia confirming a crucial practice match scheduled for this week is “extremely unlikely” to go ahead.","content":null,"pubDate":"2021-11-29 07:55:00","full_description":"Australia’s Ashes preparation has been thrown into disarray, with Cricket Australia confirming a crucial practice match scheduled for this week is “extremely unlikely” to go ahead. The Australia and Australia A squads had been due to face off in a three-day practice match from Wednesday, but wet weather in southeast Queensland has forced Cricket Australia to begin planning other sessions. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > The likely cancellation of the match means selectors will miss their only chance to see the squad’s repatriated T20 World Cup players – including Steve Smith, David Warner, Mitchell Starc, Josh Hazlewood and new captain Pat Cummins – playing in a fully fledged red-ball game setting before the Ashes begin on December 8. All five are locks for selection in the first Test at the Gabba, but none have played red-ball cricket since last summer’s Sheffield Shield season. A CA spokesman confirmed on Monday evening Australia wouldn’t train on Tuesday, and that the first day of the proposed practice match would likely be replaced with centre wicket and net practice sessions. It won’t be the first time Australian sessions have been scrapped ahead of the five-Test series – wet weather forced Australia to miss out on training last Wednesday and Thursday. England, also based out of a southeast Queensland hub, is similarly coming to grips with the strong possibility of missing out on its last match simulation. The remaining members of the England squad will join their teammates in camp tomorrow after they are released from quarantine on the Gold Coast. They’d have been available to play in a four-day intra-squad match at Ian Healy Oval in Brisbane this week but that hitout, like Australia’s, is unlikely to go ahead. Despite the disjointed preparation for key members of the squad, Australian bowling coach Andrew McDonald indicated on Sunday there would be “no excuses” for a slow start to the Ashes. “We’ve had fantastic facilities up here,” he said from Australia’s Gold Coast hub. “The weather’s been challenging at times, but we’ve still been able to get out into the centre. “Also, these guys have got a lot of Test experience to draw upon. So changing formats is something that they’ve been able to deal with across their careers. “I think we’ll be really, really, really well-prepared.” Shane Warne knows what makes a top-line BBL bowler. Here are the five names you should have on your KFC SuperCoach shopping list this summer. Shane Warne has been left battered and bruised after a motorbike accident on Sunday and could have a broken foot. New Zealand opening batter Will Young was left to rue a “sloppy” blunder in the penultimate over of the day against India.","image_url":null,"source_id":"news"},{"title":"GOZ vs AUK Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ECS T10 Malta Encore 2021 Match 25 & 26","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/gozo-vs-atlas-utc-knights-dream11-prediction-ecs-t10-malta-encore-2021?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Sahil Jain"],"video_url":null,"description":null,"content":null,"pubDate":"2021-11-29 07:11:02","full_description":"Gozo will take on Atlas UTC Knights in match number 25 & 26 of the ECS T10 Malta Encore 2021 at the Marsa Sports Club, Marsa, Malta on Monday. Gozo will be playing their first set of games in this tournament. They made their ECS debut in June earlier this year but have not had a great run. Atlas UTC Knights have already played two games. They won one game while the other was abandoned. Gozo : Joshby Job, Indika Thilan Perera, Milton Devasia, Senthil Raj (wk), Aji Wilson, Jerin Jacob, Moonnukandathil Mohammed Rafeeque, Ajeesh Antony, Sandeep Sasikumar, Rishal Simon, Sajan Varghese Atlas UTC Knights : Avinash Dileep (wk), Samuel Stanislaus, Basil George, Nithin Babu, Al Ameen Abdul, Manoj Salikumar, Sujesh Appu (c), Justin Shaju, Asif Sha, Sarath Babu, Akashlal Ramesan Match: GOZ vs AUK Date & Time: November 29th 2021, 1 & 3 PM IST Venue: Marsa Sports Club, Marsa, Malta The 22-yard surface at Marsa Sports Club in Malta is an excellent one to bat on and teams have consistently racked up big scores. Thus, another solid batting track is likely to be in store for this game. Wicketkeeper Senthil Raj can contribute effectively all-round. He got 90 runs and picked up three wickets in the tournament held in June this year. Batters Samuel Stanislaus has the knack of scoring tall regularly and he can blast away at the top of the order. He has scored 522 runs at a strike-rate of 155.82 in his ECS career. All-rounders Moonnukandathil Mohammed Rafeeque might be the one to look out for. He can have an impact with both bat and ball and will be a key player for GOZ. Bowlers Sujesh Appu is an experienced player and is a wicket-taking bowler. The AUK captain has taken 19 wickets in his ECS career so far. Basil George (AUK) Sujesh Appu (AUK) Samuel Stanislaus (AUK) Indika Thilan Perera (GOZ) Senthil Raj (GOZ) Samuel Stanislaus: 522 runs & 4 wickets (ECS career) Sujesh Appu: 19 wickets (ECS career) Basil George: 327 runs & 10 wickets (ECS career) Senthil Raj: 90 runs & 3 wickets (ECS career) Fantasy Suggestion #1: Avinash Dileep, Senthil Raj, Indika Thilan Perera, Samuel Stanislaus, Basil George, Jerin Jacob, Moonnukandathil Mohammed Rafeeque, Sarath Babu, Sujesh Appu, Nithin Babu, Sandeep Sasikumar Captain: Samuel Stanislaus Vice-captain: Indika Thilan Perera Fantasy Suggestion #2: Senthil Raj, Al Ameen Abdul, Indika Thilan Perera, Samuel Stanislaus, Basil George, Moonnukandathil Mohammed Rafeeque, Joshby Job, Sarath Babu, Sujesh Appu, Justin Shaju, Sandeep Sasikumar Captain: Basil George Vice-captain: Moonnukandathil Mohammed Rafeeque","image_url":"https://staticg.sportskeeda.com/editor/2021/07/c71fa-16252409236673-800.jpg","source_id":"sportskeeda"},{"title":"“I thought this might be the end”: Ben Stokes reveals frightening health scare experience ahead of the Ashes 2021-22","link":"https://thesportsrush.com/cricket-news-i-thought-this-might-be-the-end-ben-stokes-reveals-frightening-health-scare-experience-ahead-of-the-ashes-2021-22/","keywords":["Cricket","Australia vs England","Ben Stokes","The Ashes","\\"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ben Stokes is battling to be fit for the first Ashes 2021 test in Brisbane after he got hurt during training at the nets in Gold Coast. The Ashes 2021 is set to start in Australia from 8th December in Brisbane. Two traditional rivals will face off against each other for the prestigious Ashes urn.… The post “I thought this might be the end”: Ben Stokes reveals frightening health scare experience ahead of the Ashes 2021-22 appeared first on The SportsRush.","content":"Ben Stokes is battling to be fit for the first Ashes 2021 test in Brisbane after he got hurt during training at the nets in Gold Coast. The Ashes 2021 is set to start in Australia from 8th December in Brisbane. Two traditional rivals will face off against each other for the prestigious Ashes urn. The talismanic all-rounder Ben Stokes is all set to make his return in the Ashes 2021. It was looking like Stokes will miss his second continuous away Ashes, but he is finally back in the team. Ben Stokes has not played a single game since July due to a finger injury and mental health issues. He recently had a second operation on his injured finger. The gun all-rounder, whose Headingley heroics are still fresh, was not a part of England’s 17 men initial Ashes squad. Ben Stokes reveals frightening experience ahead of the Ashes In a recent interview, Ben Stokes revealed a frightening health scare that happened to him. He was taking a tablet, but it got stuck in his windpipe, and Ben was unable to breathe. “It was actually down to a simple tablet that went down the wrong way and got stuck in my windpipe causing me to choke horribly before the glands in my face went into overdrive to flush it out,” Stokes wrote in The Daily Mirror. “Until it actually came out, I thought this might be the end. We’ve all had those moments when something gets stuck in the throat, and usually someone can help you out.” “But I was on my own in my room and I couldn’t breathe as it became lodged and started to dissolve… it was a genuinely frightening experience.” “The team doctor came to see me straight away and she explained what had happened with the body reacting the way it did.” “I’m glad it did, even though I was a mess.” Ben Stokes smashing them in England training pic.twitter.com/S5tSFItq5n — Wisden (@WisdenCricket) November 25, 2021 Ben Stokes got hurt during the training at the Gold Coast on 28 November 2021. However, Ashley Giles is hopeful that Ben Stokes will play the first test in Brisbane. “I’m hopeful and I’d always like to be confident, but we’ve got to treat Ben carefully, as we would anyone else who’s been in that position, of not having a lot of cricket under their belts,” Giles said. England’s red-ball specoalosts are training at the gold coast, whereas the T20 World Cup squad members are in isolation. The post “I thought this might be the end”: Ben Stokes reveals frightening health scare experience ahead of the Ashes 2021-22 appeared first on The SportsRush.","pubDate":"2021-11-29 07:00:25","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Yasir hurt, Bangladesh extends lead to 159","link":"https://thewest.com.au/sport/cricket/yasir-hurt-bangladesh-extends-lead-to-159-c-4746646","keywords":null,"creator":["AAP"],"video_url":null,"description":"Bangladesh have a lead of 159 runs over Pakistan after reaching 6-115 at lunch on the fourth day of the first cricket Test.","content":null,"pubDate":"2021-11-29 06:52:22","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4746646/df919ea90093ef4a277aaf83bb57f0a3a069b417-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Yasir hurt, Bangladesh extends lead to 159","link":"https://www.perthnow.com.au/sport/cricket/yasir-hurt-bangladesh-extends-lead-to-159-c-4746640","keywords":null,"creator":["AAP"],"video_url":null,"description":"Bangladesh have a lead of 159 runs over Pakistan after reaching 6-115 at lunch on the fourth day of the first cricket Test.","content":null,"pubDate":"2021-11-29 06:52:02","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4746640/df919ea90093ef4a277aaf83bb57f0a3a069b417-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"“Don’t think MS Dhoni will play the full season”: Simon Doull thinks Faf du Plessis will replace MS Dhoni as CSK captain in IPL 2022","link":"https://thesportsrush.com/cricket-news-dont-think-ms-dhoni-will-play-the-full-season-simon-doull-thinks-faf-du-plessis-will-replace-ms-dhoni-as-csk-captain-in-ipl-2022/","keywords":["Cricket","CSK","chennai super kings","csk","Faf Du Plessis","Indian Premier League","IPL 2021","MS Dhoni","Simon Doull"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Faf du Plessis will replace MS Dhoni: The former pacer from New Zealand has put forward a left-field option for Chennai Super Kings. Former New Zealand fast bowler Simon Doull has shared names of four cricketers which according to him should be retained by Indian Premier League defending champions Chennai Super Kings ahead of IPL… The post “Don’t think MS Dhoni will play the full season”: Simon Doull thinks Faf du Plessis will replace MS Dhoni as CSK captain in IPL 2022 appeared first on The SportsRush.","content":"Faf du Plessis will replace MS Dhoni: The former pacer from New Zealand has put forward a left-field option for Chennai Super Kings. Former New Zealand fast bowler Simon Doull has shared names of four cricketers which according to him should be retained by Indian Premier League defending champions Chennai Super Kings ahead of IPL 2022 auction. With captain Mahendra Singh Dhoni had confirmed himself getting retained earlier this month, Doull highlighted three players who should be retained in addition to Dhoni. “Ravindra Jadeja, he is Mr. Chennai as well. He has got to be retained. What we saw from Ruturaj Gaikwad, I think he must be retained. You don’t want to let him go anywhere and the combination at the top of the order between him and Faf du Plessis,” Doull was quoted as saying by Star Sports, where he is commentating in the ongoing Test series between India and New Zealand. Considering the multiple areas in which all-rounder Ravindra Jadeja contributes on a cricket field, him getting retained won’t be a surprise by any means. As far as opening batters Ruturaj Gaikwad and Faf du Plessis are concerned, both of them had finished IPL 2021 as its top run-getters. Simon Doull thinks Faf du Plessis will replace MS Dhoni as CSK captain in IPL 2022 While Dhoni will start as Super Kings’s captain in IPL 2022, Doull believes that he will step aside at some point in the season especially after playing his farewell match in Chennai. Doull didn’t mince his words while nominating du Plessis as Dhoni’s replacement in the leadership role. “When MS Dhoni decides to play his final game, Faf du Plessis will take over the captaincy in April-May next year. That’s my thinking and I don’t think MS Dhoni will play the full season. Faf du Plessis will take over from him. But there will be a home game where they will announce it will be MSD’s last game and Faf will take over from there,” Doull added. In the 99 matches that du Plessis has played for Chennai across seven seasons, his 2,932 runs have come at an average and strike rate of 34.90 and 132.07 with the help of 21 half-centuries. Backed with #Yellove, everywhere you go! The MO show 7⃣7⃣*(23) #AbuDhabiT10 #WhistlePodu pic.twitter.com/4iUTRh4Tbr — Chennai Super Kings – Mask Pdu Whistle Pdu! (@ChennaiIPL) November 27, 2021 While there is no doubting du Plessis’ record as a batter, it will still be interesting to see if CSK retain the 37-year old player or not. With Moeen Ali and Sam Curran among other options for retention, picking one out of these three overseas players will be no mean task for the franchise. The post “Don’t think MS Dhoni will play the full season”: Simon Doull thinks Faf du Plessis will replace MS Dhoni as CSK captain in IPL 2022 appeared first on The SportsRush.","pubDate":"2021-11-29 06:40:41","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"All out: Michael Vaughan and the demise of cricket’s lads’ club - The Independent","link":"https://news.google.com/__i/rss/rd/articles/CBMibmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL2FydHMtZW50ZXJ0YWlubWVudC90di9mZWF0dXJlcy9taWNoYWVsLXZhdWdoYW4tY3JpY2tldC1hemVlbS1yYWZpcS1iMTk2NDMxNy5odG1s0gFyaHR0cHM6Ly93d3cuaW5kZXBlbmRlbnQuY28udWsvYXJ0cy1lbnRlcnRhaW5tZW50L3R2L2ZlYXR1cmVzL21pY2hhZWwtdmF1Z2hhbi1jcmlja2V0LWF6ZWVtLXJhZmlxLWIxOTY0MzE3Lmh0bWw_YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"All out: Michael Vaughan and the demise of cricket’s lads’ club  The IndependentAshley Giles suggests Michael Vaughan should be given ‘second chance’  The GuardianWhat the BBC show trial of Michael Vaughan tells us  Spectator.co.ukPart of me feels sympathy for Michael Vaughan – but he hasn't helped himself  The TimesAshley Giles warns of cancel culture in cricket after BBC axe Michael Vaughan from Ashes coverage  Telegraph.co.ukView Full coverage on Google News","content":null,"pubDate":"2021-11-29 06:37:40","image_url":null,"source_id":"google"},{"title":"The Great Escape: Brett Lee relives Edgbaston, 2005","link":"https://www.news.com.au/sport/cricket/the-great-escape-brett-lee-relives-edgbaston-2005/video/d7180cc06194c14920e3d6c50e4747d6","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Brett Lee takes foxsports.com.au through one of the most iconic Ashes moments... Edgbaston, 2005.","content":null,"pubDate":"2021-11-29 06:32:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"The Great Escape: Brett Lee relives Edgbaston, 2005","link":"https://www.cairnspost.com.au/sport/cricket/the-great-escape-brett-lee-relives-edgbaston-2005/video/d7180cc06194c14920e3d6c50e4747d6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Brett Lee takes foxsports.com.au through one of the most iconic Ashes moments... Edgbaston, 2005.","content":null,"pubDate":"2021-11-29 06:32:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"India A face South Africa A in 2nd unofficial Test amid threat of new COVID-19 variant","link":"https://www.indiatvnews.com/sports/cricket/india-a-face-south-africa-a-in-2nd-unofficial-test-amid-threat-of-new-covid-19-variant-747242","keywords":null,"creator":null,"video_url":null,"description":"Cooped up in a bio-bubble while a new COVID-19 variant causes panic all across here, the India A cricket team will take on South Africa A in the second unofficial Test from Tuesday with some senior side aspirants hoping to make an impression.","content":null,"pubDate":"2021-11-29 06:30:50","full_description":"Cooped up in a bio-bubble while a new COVID-19 variant causes panic all across here, the India A cricket team will take on South Africa A in the second unofficial Test from Tuesday with some senior side aspirants hoping to make an impression. The first four-day game ended in a draw due to inclement weather on Friday last week even as the detection of the B.1.1.529 COVID-19 variant, which was named Omicron by the WHO, forced many countries to impose international travel restrictions on South Africa. The uncertain situation also led to the Netherlands abandoning their last two ODIs against South Africa which were scheduled at Johannesburg. However, India A have stayed put in Bloemfontein inside a bio-bubble. The matches are being played without spectators and India senior team is also due to arrive in the country by December 9 for a nearly seven-week assignment starting December 17. If the situation deteriorates, it can jeopardise the tour which involves three Tests, three ODIs and four T20Is across four venues -- Johannesburg, Centurion, Paarl, and Cape Town. However, the India A players will need to keep the thoughts of the new variant at bay and focus on the task at hand as they revive their battle with South Africa A here. In the first game, India A batters produced a good show with Abhimanyu Easwaran hitting a solid hundred and skipper Priyank Panchal scoring 96 to take them to 308 for 4 in response to South Africa's 509 declared when rain washed out the final day. Opener also scored a fine 48 and he would look to make the most of the good batting conditions here. Hanuma Vihari, who was not picked for the two home Tests against New Zealand, could manage just 25 here and would be eager to make up for it in the second game. However, the visiting team's bowling is an area of concern as it allowed the hosts to pile up a mountain of runs at Mangaung Oval. While Navdeep Saini, who has lost his place in the Indian team, and his pace partner Arzan Nagwaswalla took two wickets each, Umran Malik, who was picked in the A squad after impressing with his extra pace in the , also snapped one. Among the three spinners, Rahul Chahar, who was a part of the recent home T20 series against New Zealand, conceded 125 runs for his one wicket, while K Gowtham and Baba Aparajith failed to cause any damage. For the hosts, Pieter Malan (163) and Tony de Zorzi (117) shone bright with respective tons, while three other batsmen -- J Smith, Sinethemba Qeshile and George Linde -- further piled on the agony on the Indian bowlers with half-centuries. In the bowling department, fast bowler Lutho Sipamla and left-arm spinner George Linde scalped a couple of wickets each but the other bowlers were not very effective. Squads: Priyank Panchal (c), Prithvi Shaw, Hanuma Vihari, Arzan Nagwaswalla, Devdutt Padikkal, Sarfaraz Khan, Abhimanyu Easwaran, Navdeep Saini, K Gowtham and Baba Aparajith, Rahul Chahar, Ishan Porel, Saurabh Kumar, Umran Malik, Upendra Yadav. Peter Malan (c), Dominic Hendricks, Raynard van Tonder, Jason Smith, Tony de Zorzi, Sarel Erwee, Senuran Muthusamy, George Linde, Marco Jansen, Migael Pretorius, Sinethemba Qeshile, Beuran Hendricks, Lutho Sipamla, Glenton Stuurman.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket: Somerville, Latham frustrate India on final day of first test","link":"https://www.channelnewsasia.com/sport/cricket-somerville-latham-frustrate-india-final-day-first-test-2344946","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-11-29 06:29:24","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--9DcGxxIG--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-11-29t062612z_1_lynxmpehas075_rtroptp_3_cricket-test-ind-nzl.jpg?itok=z3fGFVaQ","source_id":"channelnewsasia"},{"title":"‘The perfect sportsperson’: Tributes flow for Davidson at SCG farewell","link":"https://www.theage.com.au/sport/cricket/the-perfect-sportsperson-tributes-flow-for-davidson-at-scg-farewell-20211129-p59czs.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Alan Jones, John Howard and Mark Taylor spent Monday morning at a public memorial service recalling the wonderful feats – on and off the field – of Australian cricket icon Alan Davidson.","content":null,"pubDate":"2021-11-29 06:13:55","full_description":"Australian cricketing icon Alan Davidson has been labelled “the perfect sportsperson” by former prime minister John Howard at a public memorial service on Monday at the Sydney Cricket Ground. About 200 people – from all walks of life – gathered in the SCG Members for a service hosted by Alan Jones on the turf of the hallowed ground where Davidson played six of his 44 Tests for Australia. A memorial service for Alan Davidson was held at the SCG on Monday. Credit: Kate Geraghty Davidson, the brilliant left-arm bowling all-rounder whose Test career spanned from 1953 to 1963, died on October 30. He was 92. The proud New South Welshman, famous for his performance in the tied Test of 1960 against the West Indies , was also farewelled at a funeral in Strathfield on November 8. Monday served as an opportunity for members of the public to listen to stories about the man who took 186 Test wickets at 20.53 – the lowest average of any Australian bowler with more than 150 wickets. Former Australian prime minister John Howard (left) and Alan Jones (right). Credit: Kate Geraghty Davidson’s widow Betty, her son Neil, and other family members enjoyed the service that began at 11am. Venues NSW and SCG chairman Tony Shepherd provided a warm welcome, before Jones, Howard and former Australian Test captain Mark Taylor spoke glowingly of Davidson in a service also watched by more than 100 people on a live stream. Former governor-general Sir Peter Cosgrove, NSW Premier Dominic Perrottet, plus state ministers Stuart Ayres and Natalie Ward, were on deck to pay their respects. Two former NRL bosses in Todd Greenberg and David Gallop – now involved in cricket – were present, as were ABC commentator Jim Maxwell and former international umpire Simon Taufel. Cricket commentator Jim Maxwell (2nd from left), former Australian prime minister John Howard (3rd from left) and NSW Premier Dominic Perrottet (behind Howard) during the memorial service of Alan Davidson. Credit: Kate Geraghty Howard, the cricket-loving former PM, spoke of his joy at listening to Davidson tell stories at his home one evening. “I had the extraordinary pleasure of hosting a small dinner party at Kirribilli that included not only Alan but also the great [West Indian all-rounder] Sir Garfield Sobers,” Howard said. “To listen to these two giants of the game relive some of the exciting moments of that [1960] Test on the veranda of Kirribilli House gave me a new dimension of the privileges that I had … that came with being in office. “Alan not only had a remarkable career as a Test cricketer, he also gave back, and he is an example of the perfect Australian sportsperson, if there can be such a man or a woman. Someone who gets to the very top but then devotes the rest of his life to giving back.” Taylor said his late father loved watching Davidson play and was thrilled at the chance to be able to meet him. The family of Alan Davidson. Credit: Kate Geraghty In the tied Test of 1960, Davidson became the first cricketer to make 100 runs and take 10 wickets in the same match. Chasing 233 for victory, Australia were in trouble at 6-92 before Davidson combined in a 134-run stand with Richie Benaud. Davidson was then run out for 80 as Australia lost 4-6 to tie the match in dramatic fashion. Taylor recalled how Benaud used to tell him that, “the last hour didn’t go quite to plan”. “When I asked Davo not long after that ... he was a little more abrupt,” Taylor said. “He said ‘well if it wasn’t for that bloody Benaud running me out on 80, we would have won the bloody Test match’.” One of the greats ... Alan Davidson. Credit: Getty Or the time Davidson had dinner with a young Glenn McGrath. “Davo apparently said to Glenn, ‘What do you think of when you’re trying to bowl your first over of Test match cricket?” Taylor said. “Glenn said: ‘I’m hoping to get six balls on or about off stump and get through my first over’. Former Australia captain Mark Taylor. Credit: Kate Geraghty “Apparently Davo shook his head and said, ‘No, no, no. First over I’d bowl an inswinger, second ball I’d push it across [the batter], third ball maybe a slower ball, fourth ball bouncer, fifth ball an off or leg cutter, then maybe an inswinger to finish off’. “Glenn was in shock. From what I’d heard, it’s true. Dave could do that with the new ball and the old.” Davidson was chairman of the NSW Cricket Association for 33 years and served as a member of the SCG Trust for two decades. Afterwards, Davidson’s family invited guests to “raise a glass in honour of a great cricketer and an even better person”.","image_url":null,"source_id":"theage"},{"title":"‘The perfect sportsperson’: Tributes flow for Davidson at SCG farewell","link":"https://www.smh.com.au/sport/cricket/the-perfect-sportsperson-tributes-flow-for-davidson-at-scg-farewell-20211129-p59czs.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Alan Jones, John Howard and Mark Taylor spent Monday morning at a public memorial service recalling the wonderful feats – on and off the field – of Australian cricket icon Alan Davidson.","content":null,"pubDate":"2021-11-29 06:13:55","full_description":"Australian cricketing icon Alan Davidson has been labelled “the perfect sportsperson” by former prime minister John Howard at a public memorial service on Monday at the Sydney Cricket Ground. About 200 people – from all walks of life – gathered in the SCG Members for a service hosted by Alan Jones on the turf of the hallowed ground where Davidson played six of his 44 Tests for Australia. A memorial service for Alan Davidson was held at the SCG on Monday. Credit: Kate Geraghty Davidson, the brilliant left-arm bowling all-rounder whose Test career spanned from 1953 to 1963, died on October 30. He was 92. The proud New South Welshman, famous for his performance in the tied Test of 1960 against the West Indies , was also farewelled at a funeral in Strathfield on November 8. Monday served as an opportunity for members of the public to listen to stories about the man who took 186 Test wickets at 20.53 – the lowest average of any Australian bowler with more than 150 wickets. Former Australian prime minister John Howard (left) and Alan Jones (right). Credit: Kate Geraghty Davidson’s widow Betty, her son Neil, and other family members enjoyed the service that began at 11am. Venues NSW and SCG chairman Tony Shepherd provided a warm welcome, before Jones, Howard and former Australian Test captain Mark Taylor spoke glowingly of Davidson in a service also watched by more than 100 people on a live stream. Former governor-general Sir Peter Cosgrove, NSW Premier Dominic Perrottet, plus state ministers Stuart Ayres and Natalie Ward, were on deck to pay their respects. Two former NRL bosses in Todd Greenberg and David Gallop – now involved in cricket – were present, as were ABC commentator Jim Maxwell and former international umpire Simon Taufel. Cricket commentator Jim Maxwell (2nd from left), former Australian prime minister John Howard (3rd from left) and NSW Premier Dominic Perrottet (behind Howard) during the memorial service of Alan Davidson. Credit: Kate Geraghty Howard, the cricket-loving former PM, spoke of his joy at listening to Davidson tell stories at his home one evening. “I had the extraordinary pleasure of hosting a small dinner party at Kirribilli that included not only Alan but also the great [West Indian all-rounder] Sir Garfield Sobers,” Howard said. “To listen to these two giants of the game relive some of the exciting moments of that [1960] Test on the veranda of Kirribilli House gave me a new dimension of the privileges that I had … that came with being in office. “Alan not only had a remarkable career as a Test cricketer, he also gave back, and he is an example of the perfect Australian sportsperson, if there can be such a man or a woman. Someone who gets to the very top but then devotes the rest of his life to giving back.” Taylor said his late father loved watching Davidson play and was thrilled at the chance to be able to meet him. The family of Alan Davidson. Credit: Kate Geraghty In the tied Test of 1960, Davidson became the first cricketer to make 100 runs and take 10 wickets in the same match. Chasing 233 for victory, Australia were in trouble at 6-92 before Davidson combined in a 134-run stand with Richie Benaud. Davidson was then run out for 80 as Australia lost 4-6 to tie the match in dramatic fashion. Taylor recalled how Benaud used to tell him that, “the last hour didn’t go quite to plan”. “When I asked Davo not long after that ... he was a little more abrupt,” Taylor said. “He said ‘well if it wasn’t for that bloody Benaud running me out on 80, we would have won the bloody Test match’.” One of the greats ... Alan Davidson. Credit: Getty Or the time Davidson had dinner with a young Glenn McGrath. “Davo apparently said to Glenn, ‘What do you think of when you’re trying to bowl your first over of Test match cricket?” Taylor said. “Glenn said: ‘I’m hoping to get six balls on or about off stump and get through my first over’. Former Australia captain Mark Taylor. Credit: Kate Geraghty “Apparently Davo shook his head and said, ‘No, no, no. First over I’d bowl an inswinger, second ball I’d push it across [the batter], third ball maybe a slower ball, fourth ball bouncer, fifth ball an off or leg cutter, then maybe an inswinger to finish off’. “Glenn was in shock. From what I’d heard, it’s true. Dave could do that with the new ball and the old.” Davidson was chairman of the NSW Cricket Association for 33 years and served as a member of the SCG Trust for two decades. Afterwards, Davidson’s family invited guests to “raise a glass in honour of a great cricketer and an even better person”.","image_url":null,"source_id":"smh"},{"title":"“As a kid obviously growing up in England, I supported England”: Josh Inglis talks about the aspect of making his debut against his birth country in The Ashes","link":"https://thesportsrush.com/cricket-news-as-a-kid-obviously-growing-up-in-england-i-supported-england-josh-inglis-talks-about-the-aspect-of-making-his-debut-against-his-birth-country-in-the-ashes-2021-22/","keywords":["Cricket","Brisbane Test","Josh Inglis","The Ashes"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Josh Inglis talks about his rise in cricket, mental fitness, and the aspect of his debut against his birth country England in the Ashes. The Ashes is set to start from 8th December at the Gabba in Brisbane. After Paine’s exit, Australia is still deciding on the wicket-keeper role. Alex Carey and Josh Inglis are… The post “As a kid obviously growing up in England, I supported England”: Josh Inglis talks about the aspect of making his debut against his birth country in The Ashes appeared first on The SportsRush.","content":"Josh Inglis talks about his rise in cricket, mental fitness, and the aspect of his debut against his birth country England in the Ashes. The Ashes is set to start from 8th December at the Gabba in Brisbane. After Paine’s exit, Australia is still deciding on the wicket-keeper role. Alex Carey and Josh Inglis are the candidates battling out for the spot. Carey has been in contention for a long time, but the emergence of Josh Inglis has been amazing. Josh Inglis has revealed that talking to sports psychologist Matthew Burgin has changed his cricketing career. Till the last summer, Inglis played 60 first-class games without scoring a single century. He had an average of 28.15. After speaking with Burgin, his numbers have rocketed high. Inglis averages 58.00 since the last season, which includes three centuries. Josh was also a part of Australia’s T20 World Cup-winning squad. Josh Inglis talks about mental fitness and making his debut against England in the Ashes Josh Inglis insists that working on his mental state of the game has benefited him. He has worked closely with sports psychologist Matthew Burgin and his batting coach Beau Casson. “I went to Matt, who’s now with Cricket Australia. I just really narrowed down my focus and my routines…I just really wanted to face more balls and prolong my innings,” Inglis said. “I spoke in depth about that, it was brilliant. It changed my game and allowed me to build a couple of big innings last year.” Century! Josh Inglis brings it up off just 132 balls. That’s his third #SheffieldShield hundred of the season… pic.twitter.com/UtGsoE3QsK — cricket.com.au (@cricketcomau) March 26, 2021 Inglis revealed that he always used to train well, but couldn’t execute on the field. However, after spending with Matt, he is able to replicate his training in the main game. “That’s probably the beauty of it. I can replicate what I’m doing in training and in games,” Inglis said. “It’s before the ball is bowled, facing the delivery and then after the ball is bowled. It’s everything. And it’s doing it at training as well to make sure I’m replicating it as much as possible.” Josh Inglis has still not made his Australia debut in any format of the game. Inglis is born in England and can make his debut against his birth country. He was born in Leeds and was also a part of the Yorkshire cricket system. “It would obviously be very interesting [debuting against England]. It doesn’t happen very often,” Inglis said. “As a kid obviously growing up in England, I supported England.” Andre McDonald has revealed that Alex Carey and Josh Inglis are in a close battle for the wicket-keeper role. The post “As a kid obviously growing up in England, I supported England”: Josh Inglis talks about the aspect of making his debut against his birth country in The Ashes appeared first on The SportsRush.","pubDate":"2021-11-29 06:10:25","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IND A Face SA A In 2nd Unofficial Test Amid Threat Of New COVID Variant","link":"https://sports.ndtv.com/cricket/india-a-face-south-africa-a-in-2nd-unofficial-test-amid-threat-of-new-covid-19-variant-2628852","keywords":null,"creator":null,"video_url":null,"description":"Cooped up in a bio-bubble while a new COVID-19 variant causes panic all across here, the India A cricket team will take on South Africa A in the second unofficial Test from Tuesday.","content":null,"pubDate":"2021-11-29 06:01:50","full_description":"Cooped up in a bio-bubble while a new COVID-19 variant causes panic all across here, the India A cricket team will take on South Africa A in the second unofficial Test from Tuesday with some senior side aspirants hoping to make an impression. The first four-day game ended in a draw due to inclement weather on Friday last week even as the detection of the B.1.1.529 COVID-19 variant, which was named Omicron by the WHO, forced many countries to impose international travel restrictions on South Africa. The uncertain situation also led to the Netherlands abandoning their last two ODIs against South Africa which were scheduled at Johannesburg. However, India A have stayed put in Bloemfontein inside a bio-bubble. The matches are being played without spectators and India senior team is also due to arrive in the country by December 9 for a nearly seven-week assignment starting December 17. If the situation deteriorates, it can jeopardise the tour which involves three Tests, three ODIs and four T20Is across four venues -- Johannesburg, Centurion, Paarl, and Cape Town. However, the India A players will need to keep the thoughts of the new variant at bay and focus on the task at hand as they revive their battle with South Africa A here. In the first game, India A batters produced a good show with Abhimanyu Easwaran hitting a solid hundred and skipper Priyank Panchal scoring 96 to take them to 308 for 4 in response to South Africa's 509 declared when rain washed out the final day. Opener Prithvi Shaw also scored a fine 48 and he would look to make the most of the good batting conditions here. Hanuma Vihari, who was not picked for the two home Tests against New Zealand, could manage just 25 here and would be eager to make up for it in the second game. However, the visiting team's bowling is an area of concern as it allowed the hosts to pile up a mountain of runs at Mangaung Oval. While Navdeep Saini, who has lost his place in the Indian team, and his pace partner Arzan Nagwaswalla took two wickets each, Umran Malik, who was picked in the A squad after impressing with his extra pace in the IPL, also snapped one. Among the three spinners, Rahul Chahar, who was a part of the recent home T20 series against New Zealand, conceded 125 runs for his one wicket, while K Gowtham and Baba Aparajith failed to cause any damage. For the hosts, Pieter Malan (163) and Tony de Zorzi (117) shone bright with respective tons, while three other batsmen -- J Smith, Sinethemba Qeshile and George Linde -- further piled on the agony on the Indian bowlers with half-centuries. In the bowling department, fast bowler Lutho Sipamla and left-arm spinner George Linde scalped a couple of wickets each but the other bowlers were not very effective. Squads: India A: Priyank Panchal (c), Prithvi Shaw, Hanuma Vihari, Arzan Nagwaswalla, Devdutt Padikkal, Sarfaraz Khan, Abhimanyu Easwaran, Navdeep Saini, K Gowtham and Baba Aparajith, Rahul Chahar, Ishan Porel, Saurabh Kumar, Umran Malik, Upendra Yadav. South Africa A: Peter Malan (c), Dominic Hendricks, Raynard van Tonder, Jason Smith, Tony de Zorzi, Sarel Erwee, Senuran Muthusamy, George Linde, Marco Jansen, Migael Pretorius, Sinethemba Qeshile, Beuran Hendricks, Lutho Sipamla, Glenton Stuurman. Promoted Match starts 1.30pm IST. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2021-11/svr6hkb_prithvi-shaw-afp_120x90_29_November_21.jpg","source_id":"ndtv"}]}