{"newsArray":[{"title":"Fakhar Zaman becomes fastest Pakistani player to score 3000 ODI runs","link":"https://en.dailypakistan.com.pk/30-Apr-2023/fakhar-zaman-becomes-fastest-pakistani-player-to-score-3000-odi-runs","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"Batsman Fakhar Zaman on Saturday became the fastest Pakistani player to score 3000 ODI runs.","content":"Batsman Fakhar Zaman on Saturday became the fastest Pakistani player to score 3000 ODI runs. Zaman reached this milestone in his 67th innings. Only Hashim Amla (57) has got there quicker. Zaman achieved this honour while playing the second One Day International (ODI) against New Zealand at the Rawalpindi Cricket Stadium on Saturday. Pakistan beat New Zealand by seven wickets in the second ODI of the five-match series. New Zealand set a target of 337 runs at the loss of five wickets in 50 overs and Pakistan achieved the target in 48.2 overs at the loss of just three wickets.","pubDate":"2023-04-29 19:28:00","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-04-30/fakhar-zaman-becomes-fastest-pakistani-player-to-score-3000-odi-runs-1682808560-5480.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023 | Marsh heroics in vain as Sunrisers Hyderabad beat Delhi Capitals by 9 runs","link":"https://www.thehindu.com/sport/cricket/ipl-2023-marsh-heroics-in-vain-as-sunrisers-hyderabad-beat-delhi-capitals-by-9-runs/article66794669.ece","keywords":null,"creator":null,"video_url":null,"description":"The hard-hitting Australian all-rounder first snapped four wickets and then blasted six maximums in his 39-ball 63-run knock to conjure up hopes of a successful chase but once he was out, things went downhill for the hosts","content":"Mitchell Marsh dished out one of his finest all-round performances but it wasn't enough as Sunrisers Hyderabad returned to winning ways with a comprehensive nine-run win over Delhi Capitals in the IPL here on April 29. The hard-hitting Australian all-rounder first snapped four wickets and then blasted six maximums in his 39-ball 63-run knock to conjure up hopes of a successful chase but once he was out, things went downhill for the hosts on the sluggish Kotla track. Batting first, Abhishek Sharma slammed a 36-ball 67 to set the stage for Heinrich Klaasen, who provided the final flourish with an unbeaten 53 as SRH posted an impressive 197 for 6. In reply, Delhi lost skipper David Warner for a second-ball duck but Philip Salt (59) and Marsh took the attack to the opposition with a 112-run partnership off just 66 balls to lay a solid ground to their run chase. With the duo in full flow, 57 runs came in the powerplay as left-arm spinner Akeal Hosein conceded 30 in his three overs. Marsh clobbered Umran Malik for two maximums and Salt produced two good hits to amass 22 runs off the over, while Abhishek was punished for bowling wrong length with Marsh slamming a four and six. An incredible caught and bowled effort from Mayank Markande finally broke the partnership with Salt back in the pavilion. Soon, Abhishek got rid of Manish Pandey and when Marsh holed out to Markram off Hosein, it left DC at 125 for 4 in the 14th over. Needing 69 off 36 balls, SRH tightened the screws to limit DC to 188 for six in 20 overs with Axar Patel scoring 29 off 14 balls. With the win, SRH snapped their three-match losing streak to remain alive in the competition. They are bow in the eighth spot with six points, while DC stayed at the bottom. Earlier, back at the top, Abhishek seemed to be batting on a different track, slamming 12 fours and a six, even as the others struggled on the two-paced wicket. While the southpaw looked in good rhythm, the rest of the top and middle order continued to disappoint, scoring in single digits. But Klaasen's 27-ball-knock ensured that momentum is not lost with as many as 62 runs coming off last five overs. The South African added 53 of 33 balls with Abdul Samad (28 off 21 balls) and 35 off 18 balls with Akeal Hosein (16 off 10 balls) as SRH posted the highest score at the Kotla this season. For DC, Mitchell Marsh was the best bowler in display, returning with figures of 4-1-27-4, while Axar Patel (1/29) picked up a solitary wicket. Ishant Sharma also got one but he was expensive in his three overs. The stylish Abhishek was particularly harsh on Ishant Sharma, picking up back-to-back boundaries before pulling him for another four in the midwicket region. Mayank Agarwal, however, didn't look comfortable and his misery was ended by Ishant with a well-directed bouncer. Rahul Tripathi sent one from Mukesh Kumar over the keeper for a six before falling to Mitchell Marsh. Ishant was again on the firing line of Abhishek, who smashed him for four boundaries more in the sixth over as 16 runs came off it, helping SRH to end the powerplay at 62 for 2. Kuldeep Yadav could have dismissed Abhishek but Anrich Nortje spilled a regulation catch at the boundary and the opener rubbed salt on the bowler's wound with a slogsweep for a maximum to bring up his fifty. Abhishek took 25 balls to reach the milestone. Marsh was rewarded for bowling his cutters and back of length scrambled seam deliveries as he dismissed Markram and Harry Brook in a double wicket maiden over. Sunrisers reached 83 for 4 in 10 overs. Medium pacer Mukesh Kumar was next taken to the cleaners with Abhishek smashing two fours in the first two balls and Klaasen clobbering him for a four and maximum. The 11th over yielded 24 runs, taking SRH over the 100-mark in the process. Abhishek was finally dismissed in the 12th over when he tried to go for a slog off Axar. Klaasen then teed off during the death overs to ensure an above-par score for visitors.","pubDate":"2023-04-29 18:39:37","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Tim Murtagh celebrates 1000th wicket as Middlesex hammer Kent","link":"https://www.independent.co.uk/sport/cricket/tim-murtagh-middlesex-kent-matthew-potts-chris-cooke-b2329569.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Surrey were also dominant in their victory over Warwickshire.","content":"Tim Murtagh recorded a 10-wicket match haul as Middlesex secured a second successive LV= Insurance County Championship victory at the expense of Kent in Division One. The seamer reached 1000 wickets in all formats for his team after taking six for 42 – and match figures of 10 for 82 – as Kent fell to 128 all out at Lord’s. Ben Compton and Jack Leaning had dragged Kent back into contention with an 87-run partnership but seven wickets tumbled cheaply, setting Middlesex a comfortable chase of 86 as Sam Robson and Pieter Malan steered them to victory with nine wickets remaining. Surrey also secured a nine-wicket victory with a dominant display against Warwickshire at Edgbaston. The visitors added 70 to their total, with Jamie Smith top-scoring on 88, to set a first-innings lead of 131, but a fantastic spell from Kemar Roach saw the fast bowler take three for nine, leaving Warwickshire 22 for four at lunch. Roach finished with a five-for as the hosts fell to 141 all out and Surrey knocked off the required 11 runs in two overs. In Division Two, Matthew Potts starred with the ball picking up five wickets as Durham claimed victory by an innings and seven runs against Derbyshire at Chester-Le-Street. The visitors had made a good start to day three with Matthew Lamb and Luis Reece putting on 149 runs for the sixth wicket, but Durham sparked into life after Lamb fell just short of his century on 99, pinned lbw by Ben Raine. England seamer Potts then skittled through Derbyshire’s lower order, taking five for 65 for Durham to extend their lead at the top of the table. Sussex continued their push for victory against Gloucestershire, sparked by substitute fielder Tom Clark’s direct-hit run out of Marcus Harris. A chaotic period then saw Nathan McAndrew claim the wickets of James Bracey and Graeme van Buuren from successive balls for Gloucestershire to go four down at tea. Sussex took five further wickets in the late session, with McAndrew finishing the day with figures of five for 53 to leave Gloucestershire 198 for nine at the close, still 257 runs behind their opponent’s first-innings total. Chris Cooke and Michael Neser starred with the bat as Glamorgan fought back against Leicestershire. Chasing 407, Glamorgan were struggling on 225 for seven in their opening innings before Cooke and Neser shared an eight-wicket partnership of 211 to help move the side on to 446 for eight. Cooke remained unbeaten on 121 at the close of play, with Neser departing for 90 after being bowled by Chris Wright.","pubDate":"2023-04-29 18:39:09","image_url":"https://static.independent.co.uk/2023/04/29/19/1620067f39b81ba4090f90c45e742c3aY29udGVudHNlYXJjaGFwaSwxNjgyODcyOTQw-2.54927284.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IPL: Abhishek, Klaasen shine in Sunrisers' third win of season","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/dc-vs-srh-ipl-2023-highlights-abhishek-sharma-heinrich-klaasen-shine-in-sunrisers-hyderabads-third-win-of-season/articleshow/99875724.cms","keywords":null,"creator":null,"video_url":null,"description":"Abhishek Sharma, back at the top of the order for Sunrisers Hyderabad, was an anomaly for the first 12 overs of a match played between two equally unsure teams at the Ferozeshah Kotla on Saturday evening. His uncluttered intent fetched him 67 runs off 36 laid the foundation for Heinrich Klassen’s blazing unbeaten 27-ball 53 for SRH to post 197/6 and secure a nine-run win against a beleaguered Delhi Capitals.","content":"NBA: Action pics of playoffs Top NBA play-off moments Top action pics of NBA playoffs Top action pictures of NBA play-offs NBA special! Top moments NBA Mania!: Classy first-round playoff pictures Sunday showdown! Top Premier League Moments EPL: Top weekend action pictures Exciting action pictures of NBA Catch some top action of recent NBA games","pubDate":"2023-04-29 17:57:16","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"North West Cricket results 29/04/2023","link":"https://highlandradio.com/2023/04/29/north-west-cricket-results-29-04-2023/","keywords":["Sport"],"creator":["highlandsport"],"video_url":null,"description":"Strabane 1st XI 224 v 174/2 (21.5/30) Newbuildings 1st XI Newbuildings 1st XI won by 8 wickets (DLS method) Ballyspallen 1st XI 175 v 179/5 Eglinton 1st XI Eglinton 1st XI won by 5 wickets Donemana 1st XI 238 v 132 Bonds Glen 1st XI Donemana 1st XI won by 106 runs Burndennett 1st XI … North West Cricket results 29/04/2023 Read More » The post North West Cricket results 29/04/2023 appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Sun, 30 Apr 2023 (+353) 07491 25000 (+353) 086 60 25000 Facebook-f Twitter Instagram Youtube News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Listen Live Watch Live News Sport Obituaries Playback Events Shows Bingo Jobs Menu News Sport Obituaries Playback Events Shows Bingo Jobs Listen Live Watch Live Highland Fling in Glasgow Customer Service Awards Clár sa Charr Home / News & Sport / North West Cricket results 29/04/2023 North West Cricket results 29/04/2023 Sport April 29, 2023 Strabane 1st XI 224 v 174/2 (21.5/30) Newbuildings 1st XI Newbuildings 1st XI won by 8 wickets (DLS method) Ballyspallen 1st XI 175 v 179/5 Eglinton 1st XI Eglinton 1st XI won by 5 wickets Donemana 1st XI 238 v 132 Bonds Glen 1st XI Donemana 1st XI won by 106 runs Burndennett 1st XI 158 v 139/3 Coleraine 1st XI Coleraine 1st XI won by 7 wickets Killyclooney 1st XI 106 v 109/1 Bready 1st XI Bready 1st XI won by 9 wickets Fox Lodge 1st XI 102 v 103/5 St Johnston 1st XI St Johnston 1st XI won by 5 wickets Advertisement Advertisement Advertisement Top Stories News , Top Stories Joint funeral for siblings killed in Aughnacloy collision to be held on Monday 29 April 2023 News , Top Stories Hundreds turn out to Strabane vigil for family members killed in Aughnacloy collision 29 April 2023 News , Audio , Top Stories Donegal Senator called for Sports Capital Programme to open to allow new applications avail of funding. 29 April 2023 News , Top Stories Coast Guard, RNLI & Water Safety Ireland issue safety notice 29 April 2023 Advertisement Related News News , Top Stories Joint funeral for siblings killed in Aughnacloy collision to be held on Monday 29 April 2023 News , Top Stories Hundreds turn out to Strabane vigil for family members killed in Aughnacloy collision 29 April 2023 News , Audio , Top Stories Donegal Senator called for Sports Capital Programme to open to allow new applications avail of funding. 29 April 2023 News , Top Stories Coast Guard, RNLI & Water Safety Ireland issue safety notice 29 April 2023 News , Top Stories €1.3 million awarded to Donegal primary and special schools under the Minor Works Grant 28 April 2023 Playback Main Evening News, Sport, An Nuacht and Obituaries – Friday April 28th 28 April 2023 Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland enquiries@highlandradio.com Telephone: (+353) 07491 25000 Text: (+353) 086 60 25000 Fax: (+353) 07491 25344 News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertisement Copyright ©2023 Highland Radio - All Rights Reserved Designed by Manna | Developed by Purposemakers News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland (+353) 07491 25000 (+353) 086 60 25000 enquiries@highlandradio.com Facebook-f Twitter Instagram Youtube","pubDate":"2023-04-29 17:25:09","image_url":null,"source_id":"highlandradio","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Afghan cricketer Najib Zadran undergoes surgery at Pakistani hospital","link":"https://en.dailypakistan.com.pk/29-Apr-2023/afghan-cricketer-najib-zadran-undergoes-surgery-at-pakistani-hospital","keywords":["Sports"],"creator":null,"video_url":null,"description":"PESHAWAR – Afghanistan national cricket team player Najib Zadran underwent a tonsillectomy, a surgical procedure to remove the tonsils, at a hospital in northwestern Pakistani province of Khyber Pakhtunkhwa.","content":"PESHAWAR – Afghanistan national cricket team player Najib Zadran underwent a tonsillectomy, a surgical procedure to remove the tonsils, at a hospital in northwestern Pakistani province of Khyber Pakhtunkhwa. The Afghan all-rounder was admitted to a private hospital in Peshawar. He was presented flowers by the hospital administration after the successful surgery. Zadran has been discharged from the hospital and he has went back to his country along with his brother.","pubDate":"2023-04-29 17:23:27","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-04-29/afghan-cricketer-najib-zadran-undergoes-surgery-at-pakistani-hospital-1682787526-1844.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Gary Newbon: I knew Neville would be a natural behind the mic","link":"https://www.birminghammail.co.uk/sport/sport-opinion/gary-newbon-knew-neville-would-26811218","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Gary Newbon)"],"video_url":null,"description":"I enjoyed a good relationship with both Philip and Gary Neville, as well as their late father, Neville Neville","content":"Jimmy Greaves, Andy Townsend and Gary Neville are the biggest football names that I started off in television. The first two were at ATV and Central, respectively. As for Neville, I arranged for him to be an ITV pundit for the 2002 World Cup. I enjoyed a good relationship with both Philip and Gary Neville, as well as their late father, Neville Neville. When I discovered that Gary was injured and would miss the World Cup in Japan, I asked his father about the ITV role, which he agreed would be good. Both the Neville brothers and their sister, England netball international player and coach Tracey, were good with the media. It was the attitude I always looked for when picking on-screen talent. Players like Paul Scholes, Chris Sutton and Gabby Agbonlahor would not have been on my list. They were completely unhelpful. I got one interview with Scholes, none with Sutton or Agbonlahor. As it happens, Scholes and particularly Sutton are now good on the box. When I left ITV to join Sky Sports in the autumn of 2004, I chatted to Mr Neville senior about switching Gary to Sky, where I knew my boss, Andy Melvin, would be keen on having him in the football line-up. When my daughter Claire was at Rugby School as a sixth former, I was asked to manage The Lord’s Taverners charity cricket team at the school. I normally played in those days but as manager for the day I had to select and take charge. I had the former England opener David Steele and Jimmy Greaves in my team. I rang Sir Alex Ferguson to ask for a couple of players. He recommended Gary, who was in the first team, and Philip who was still to break through. When I questioned, Sir Alex about Philip, he assured me that he had been in the England schools cricket team and that he had to divert him from the attentions of Lancashire County Cricket Club down the road! He told me to ring their father, Mr Neville, who was commercial director at Bury Football Club. So I rang Mr Neville and introduced myself. He referred to Sir Alex as the boss and we chatted on. After a while, I said, ‘I cannot just call you Mr Neville, what is your first name please?’. He said it was Neville. I found myself incredulously saying, “Neville, Neville?” He brought his two sons, who were both brilliant. Gary was the fast bowler, Philip the batsman. Anyway, it started a long and trusted friendship. Mr Neville became an agent for his sons. Sadly, though, he died from a heart attack, aged 65, in August 2015 while visiting Australia to support Tracey, England’s netball coach in the World Cup. Meanwhile, Gary has made a real name for himself as a Sky Sports football pundit and has made a fortune in business. I got the idea in an Orlando hotel lift of bringing Andy Townsend into Central TV. It was 1994 and I was staying in the Republic of Ireland’s World Cup hotel. Andy was the Ireland captain. Andy, his wife, Jackie, and I were sharing a lift and I asked Andy what he planned to do after his playing days were over. He said he wanted to work in TV. He was still the Aston Villa captain but I offered him an expert’s role on Central Sports Special (highlights of midweek matches) when he was not playing. His first game involved West Bromwich Albion. He was and still is very good. Andy’s attitude was great. When he was transferred to Middlesbrough, he still made the journey down to the Central TV studios in Birmingham and when we came off the air late at night he would motor back to the northeast in time for training. Andy Gray, who also started with me, did the same thing when at Everton. Again, attitude. Townsend went on to be a regular on the ITV network and I was surprised when he was replaced. But talent is a subjective view and the person who makes the selections is the one that counts! Andy T is now the successful host of the Premier League’s coverage that goes around the world. It has been well documented how Jimmy Greaves made the breakthrough with me at ATV. People thought Trevor East, Billy Wright, Tony Flanagan (executive producer) and myself showed great foresight but I have to be honest, I never realised how funny Jimmy would be, although I rarely admit that! Mark Bolton did well as a presenter for Central Sport and progressed to Sky Sports where, sadly, he did not hold the post down after a while. I also brought in Manish Bhasin off BBC Radio Leicester. He was an absolute natural. Jon Holmes, Gary Lineker’s agent, rang me one day to ask permission to take him to the BBC, which I obviously granted. Then there was Sarah Jane Mee. She, too, took to presenting immediately. Eventually, Sarah Jane left to present football for Sky Sports and is now one of their leading newscasters at Sky News. Next week in the Sunday Mercury, read how I was the victim of wind-ups on TV by Alan Shearer, equestrian hero Nick Skelton, snooker’s Steve Davis and BBC reporter Ray Stubbs. I fell for it every time!","pubDate":"2023-04-29 16:50:39","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26810173.ece/ALTERNATES/s615/1_GettyImages-1479325727.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT","link":"https://www.gudstory.com/andre-russell-not-pandre-russell-has-struggled-to-find-his-form-with-four-single-digit-scores-in-eight-matches-and-a-highest-score-of-38-despite-starting-with-sixes-against-rashid-khan-in-the-game/","keywords":["Cricket","Andre Russell"],"creator":["Vishnu Reddy"],"video_url":null,"description":"Andre Russell has struggled to find his form in the ongoing season of IPL, with four single-digit scores in eight matches and a highest score of 38*. Despite starting with sixes against Rashid Khan in the game against Gujarat Titans, Andre Russell was unable to reach the kind of total that was expected of him. […] The post Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT appeared first on Gud Story.","content":"Home Sports Cricket Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT by Vishnu Reddy April 29, 2023 in Cricket Reading Time: 2 mins read 0 KKR Star All-rounder Andre Russell (Image Credit: Twitter) Share on Facebook Share on Twitter Andre Russell has struggled to find his form in the ongoing season of IPL, with four single-digit scores in eight matches and a highest score of 38*. Despite starting with sixes against Rashid Khan in the game against Gujarat Titans, Andre Russell was unable to reach the kind of total that was expected of him. Andre Russell finished with 34 runs off 19 balls as Kolkata Knight Riders posted a total of 179 for 7 against GT at Eden Gardens in Kolkata. During the mid-innings interview, Andre Russell had no intentions to hide his disappointment and expressed his dissatisfaction with the total that his team ended up with on a flat batting track. “I’m not happy at all looking at the total we’ve got,” said Andre Russell. When asked about the ideal total for the pitch, Andre Russell responded that something around 200 would have been ideal, especially given the start they got. “I think this pitch is a 190-200 wicket, so we are about 20 runs short. We only have ourselves to blame.” Rahman Ullah Gurbaz returned to the side after Jason Roy pulled out due to a back spasm and smashed seven sixes and five fours in his 39-ball knock, recording his second fifty of the season. However, KKR failed to make good use of the final few overs after rookie Afghanistan spinner Noor Ahmed (4-0-21-2) dismissed Rahman Ullah Gurbaz for 81 with compatriot Rashid Khan completing a well-judged catch. Mohammed Shami (3/33 in 4 overs) and Irishman Josh Little (2/25 in 4 overs) played their part to perfection in restricting KKR. ADVERTISEMENT At 135/5, KKR still had the firepower of Andre Russell and Rinku Singh with 28 balls remaining. However, they were unable to surpass the 200-mark, which always provides a team with a psychological edge. Noor claimed his second victim in Rinku, while the “birthday boy” Russell could not express himself fully as the GT bowlers did well to limit him to a 19-ball 34 not out (2×4, 3×6). GT easily achieved the target with 7 wickets in hand in the 18th over, proving Andre Russell’s words during the mid innings interview. They had a comfortable chase with opener Shubman Gill providing a good start. Although there was a brief period where Gill (49) and Hardik Pandya (25) fell in successive overs, KKR made a comeback. But it was short-lived as Vijay Shankar (51* off 24) and David Miller (32* off 18) took charge and led their team to victory. The defending champions registered their fourth consecutive away win. Read More: Our bowlers will come back strong: Wasim Jaffer Tags: Andre Russell Related Posts Our bowlers will come back strong: Wasim Jaffer April 29, 2023 WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad April 28, 2023 Stuart Broad writes off Australia’s 2021-22 Ashes triumph as a void series April 28, 2023 Dhoni’s Influence in India is Incomparable, Says Harbhajan Singh April 21, 2023","pubDate":"2023-04-29 16:33:33","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"Our bowlers will come back strong: Wasim Jaffer","link":"https://www.gudstory.com/our-bowlers-will-come-back-strong-says-wasim-jaffer/","keywords":["Cricket","Wasim Jaffer"],"creator":["Vishnu Reddy"],"video_url":null,"description":"After Punjab Kings suffered a 56-run defeat against Lucknow Super Giants in Mohali on April 28th, the team’s batting coach, Wasim Jaffer, showed support for their bowlers. Despite the visitors achieving the second highest IPL total of all time, Jaffer did not dwell on the bowling performance. Wasim Jaffer acknowledged that Kagiso Rabada, Arshdeep Singh, […] The post Our bowlers will come back strong: Wasim Jaffer appeared first on Gud Story.","content":"Home Sports Cricket Our bowlers will come back strong: Wasim Jaffer by Vishnu Reddy April 29, 2023 in Cricket Reading Time: 3 mins read 0 Punjab Kings batting coach Wasim Jaffer (Image Credit: IPL) Share on Facebook Share on Twitter After Punjab Kings suffered a 56-run defeat against Lucknow Super Giants in Mohali on April 28th, the team’s batting coach, Wasim Jaffer, showed support for their bowlers. Despite the visitors achieving the second highest IPL total of all time, Jaffer did not dwell on the bowling performance. Wasim Jaffer acknowledged that Kagiso Rabada, Arshdeep Singh, and Sam Curran, the lead seamers, had given away 144 runs in 11 overs, but Wasim Jaffer chose not to overanalyze the situation. “Don’t think there are any serious concerns (about the bowling attack) because they had thrice defended scores in tough conditions.” “Be it against Mumbai or Rajasthan, even in the earlier Kolkata game. The bowling unit has always performed for us this season. Today was one of those days when everything clicked for the opposition and we were a bit clueless. Our bowlers will come back strong,” Said Jaffer in the post-match press conference. Lucknow Super Giants displayed a ruthless performance with the bat, as Kyle Mayers set the tempo right from the start, scoring 74 runs in the PowerPlay. Ayush Badoni, along with Marcus Stoinis and Nicholas Pooran, continued the aggressive intent, ensuring that there was no slowing down. Although the pitch was excellent for batting, Wasim Jaffer acknowledges that the bowlers could have executed their plans better. “Perhaps we could have gone to Plan B a bit more. Like using the slower balls a lot more and using the longer boundary consistently. They (LSG) did this a lot more effectively and it worked for them. But again, most of their shots were clearing the boundary quite easily, so we have to give them credit for that.” ADVERTISEMENT Although teams batting first had won eight of the last 10 games, Shikhar Dhawan’ s decision to bowl at the toss appeared flawed in hindsight. However, Wasim Jaffer defended his skipper’s decision and treated the bowling effort as a one-off. At the same time, Wasim Jaffer was full of praise for Lucknow’s batting performance. The tourists hammered 110 runs between overs 7-15 after a frenetic powerplay. “It is a trend for IPL sides to opt for chasing after winning the toss. Dew was obviously a factor too. We had seen it during practice and that was a reason as well. But when the opposition gets to 257, it’s always tough to chase. They got a fast start in the powerplay and never slowed down at any stage. You have to give them credit,” Wasim Jaffer further added (Source: Cricbuzz). Despite having a mammoth target to chase, Punjab Kings surprised many by not promoting any of their big hitters early in the batting order. While young Atharva Taide made the most of his opportunity to bat at number three, it seemed like a perfect stage for one of the power-hitters to come in early. However, Punjab Kings stuck to their conventional order, and as a result, a lot of their firepower arrived a bit too late in the innings. “Our top-three is a fix and Taide is someone who always does well in the powerplay. We also wanted to maintain a left-right combination throughout. Also, someone like Livingstone hadn’t played a lot of cricket, Raza had done well for us and that’s why he was promoted. We thought that if we can get closer to the total, we have the power of Livingstone and Curran. As for Jitesh and Shahrukh, their roles are for the final five overs. Everyone did their best but it’s just unfortunate that we fell short by 56 runs,” opined Wasim Jaffer. Read More: WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad Tags: Wasim Jaffer Related Posts Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT April 29, 2023 WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad April 28, 2023 Stuart Broad writes off Australia’s 2021-22 Ashes triumph as a void series April 28, 2023 Dhoni’s Influence in India is Incomparable, Says Harbhajan Singh April 21, 2023","pubDate":"2023-04-29 16:15:24","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ: पाकिस्तान को उसके घर में घुसकर डेरिल मिचेल सिखाया सबक, दो शतक लगाकर धुरंधर गेंदबाजों की निकाली हवा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pak-vs-nz-daryl-mitchell-scored-his-second-consecutive-century-in-odi-series-against-pakistan/articleshow/99874279.cms","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: पाकिस्तान के खिलाफ दूसरे वनडे मैच में न्यूजीलैंड के धाकड़ बल्लेबाज डेरिल मिचेल ने शतक लगाकर धमाल मचा दिया। मिचेल का इस सीरीज में लगातार दूसरा शतक है। पहले मैच में भी उन्होंने बेहतरीन शतकीय पारी खेली।","content":"पाकिस्तान के खिलाफ तीन वनडे मैचों की सीरीज के दूसरे मुकाबले में न्यूजीलैंड के स्टार खिलाड़ी डेरिल मिचेल ने लगातार दूसरे मैच में शतक लगाकर सनसनी मचा दी है। रावलपिंडी में खेले गए दूसरे वनडे मैच डेरिल मिचेल ने बेहतरीन 129 रनों की पारी खेली। अपनी इस पारी में उन्होंने 119 गेंदों का सामना किया जिसमें उन्होंने 8 चौके और 3 छक्के भी लगाए। सीरीज के पहले वनडे में भी डेरिल मिचेल ने शानदार शतकीय पारी खेली थी। पहले वनडे में भी मिचेल ने 113 रनों की दमदार पारी खेली थी लेकिन इसके बावजूद न्यूजीलैंड की टीम इस मैच में जीत हासिल नहीं कर सकी थी। पाकिस्तान के खिलाफ डेरिल मिचेल पहले ऐसे बल्लेबाज बने हैं जिन्होंने उसके घर में लगातार दो वनडे शतक लगाने का कारनामा किया है। इसके अलावा मिचेल के करियर का यह तीसरा वनडे शतक भी था। मिचेल के अलावा न्यूजीलैंड की तरफ से टॉम लाथम ने भी 85 गेंदों में 98 रनों की पारी खेली। अपनी इस पारी में उन्होंने 8 चौके और 1 छक्का भी लगाया। इसके अलावा चाड बोवेस ने न्यूजीलैंड के लिए पारी की शुरुआत करते हुए बेहतरीन 51 रनों की पारी खेली। वहीं विल यंग 19 और जेम्स नीशम ने भी 17 रनों की महत्वपूर्ण पारी खेली, जिसके कारण ही मेहमान टीम ने निर्धारित 20 ओवर के खेल में 5 विकेट के नुकसान पर 336 रनों का चुनौतीपूर्ण स्कोर खड़ा किया। न्यूजीलैंड के खिलाफ इस मुकाबले में पाकिस्तानी गेंदबाजी आक्रमण कुछ खास असरदार नहीं रही। पाकिस्तान की तरफ से सिर्फ हारिस रउफ ने भी अपना दमदार खेल दिखाया। हालांकि हारिस राउफ काफी महंगे भी साबित हुए। उन्होंने अपने 10 ओवर के स्पेल में 78 रन खर्च दिए। इसके अलावा पाकिस्तान की तरफ से नशीम शाह को सिर्फ एक सफलता मिल पाई। इसके अलावा और कोई भी गेंदबाज अपना असर नहीं दिखा सके।","pubDate":"2023-04-29 15:53:07","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Fakhar Zaman becomes fastest Pakistani player to score 3000 ODI runs","link":"https://en.dailypakistan.com.pk/30-Apr-2023/fakhar-zaman-becomes-fastest-pakistani-player-to-score-3000-odi-runs","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"Batsman Fakhar Zaman on Saturday became the fastest Pakistani player to score 3000 ODI runs.","content":"Batsman Fakhar Zaman on Saturday became the fastest Pakistani player to score 3000 ODI runs. Zaman reached this milestone in his 67th innings. Only Hashim Amla (57) has got there quicker. Zaman achieved this honour while playing the second One Day International (ODI) against New Zealand at the Rawalpindi Cricket Stadium on Saturday. Pakistan beat New Zealand by seven wickets in the second ODI of the five-match series. New Zealand set a target of 337 runs at the loss of five wickets in 50 overs and Pakistan achieved the target in 48.2 overs at the loss of just three wickets.","pubDate":"2023-04-29 19:28:00","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-04-30/fakhar-zaman-becomes-fastest-pakistani-player-to-score-3000-odi-runs-1682808560-5480.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023 | Marsh heroics in vain as Sunrisers Hyderabad beat Delhi Capitals by 9 runs","link":"https://www.thehindu.com/sport/cricket/ipl-2023-marsh-heroics-in-vain-as-sunrisers-hyderabad-beat-delhi-capitals-by-9-runs/article66794669.ece","keywords":null,"creator":null,"video_url":null,"description":"The hard-hitting Australian all-rounder first snapped four wickets and then blasted six maximums in his 39-ball 63-run knock to conjure up hopes of a successful chase but once he was out, things went downhill for the hosts","content":"Mitchell Marsh dished out one of his finest all-round performances but it wasn't enough as Sunrisers Hyderabad returned to winning ways with a comprehensive nine-run win over Delhi Capitals in the IPL here on April 29. The hard-hitting Australian all-rounder first snapped four wickets and then blasted six maximums in his 39-ball 63-run knock to conjure up hopes of a successful chase but once he was out, things went downhill for the hosts on the sluggish Kotla track. Batting first, Abhishek Sharma slammed a 36-ball 67 to set the stage for Heinrich Klaasen, who provided the final flourish with an unbeaten 53 as SRH posted an impressive 197 for 6. In reply, Delhi lost skipper David Warner for a second-ball duck but Philip Salt (59) and Marsh took the attack to the opposition with a 112-run partnership off just 66 balls to lay a solid ground to their run chase. With the duo in full flow, 57 runs came in the powerplay as left-arm spinner Akeal Hosein conceded 30 in his three overs. Marsh clobbered Umran Malik for two maximums and Salt produced two good hits to amass 22 runs off the over, while Abhishek was punished for bowling wrong length with Marsh slamming a four and six. An incredible caught and bowled effort from Mayank Markande finally broke the partnership with Salt back in the pavilion. Soon, Abhishek got rid of Manish Pandey and when Marsh holed out to Markram off Hosein, it left DC at 125 for 4 in the 14th over. Needing 69 off 36 balls, SRH tightened the screws to limit DC to 188 for six in 20 overs with Axar Patel scoring 29 off 14 balls. With the win, SRH snapped their three-match losing streak to remain alive in the competition. They are bow in the eighth spot with six points, while DC stayed at the bottom. Earlier, back at the top, Abhishek seemed to be batting on a different track, slamming 12 fours and a six, even as the others struggled on the two-paced wicket. While the southpaw looked in good rhythm, the rest of the top and middle order continued to disappoint, scoring in single digits. But Klaasen's 27-ball-knock ensured that momentum is not lost with as many as 62 runs coming off last five overs. The South African added 53 of 33 balls with Abdul Samad (28 off 21 balls) and 35 off 18 balls with Akeal Hosein (16 off 10 balls) as SRH posted the highest score at the Kotla this season. For DC, Mitchell Marsh was the best bowler in display, returning with figures of 4-1-27-4, while Axar Patel (1/29) picked up a solitary wicket. Ishant Sharma also got one but he was expensive in his three overs. The stylish Abhishek was particularly harsh on Ishant Sharma, picking up back-to-back boundaries before pulling him for another four in the midwicket region. Mayank Agarwal, however, didn't look comfortable and his misery was ended by Ishant with a well-directed bouncer. Rahul Tripathi sent one from Mukesh Kumar over the keeper for a six before falling to Mitchell Marsh. Ishant was again on the firing line of Abhishek, who smashed him for four boundaries more in the sixth over as 16 runs came off it, helping SRH to end the powerplay at 62 for 2. Kuldeep Yadav could have dismissed Abhishek but Anrich Nortje spilled a regulation catch at the boundary and the opener rubbed salt on the bowler's wound with a slogsweep for a maximum to bring up his fifty. Abhishek took 25 balls to reach the milestone. Marsh was rewarded for bowling his cutters and back of length scrambled seam deliveries as he dismissed Markram and Harry Brook in a double wicket maiden over. Sunrisers reached 83 for 4 in 10 overs. Medium pacer Mukesh Kumar was next taken to the cleaners with Abhishek smashing two fours in the first two balls and Klaasen clobbering him for a four and maximum. The 11th over yielded 24 runs, taking SRH over the 100-mark in the process. Abhishek was finally dismissed in the 12th over when he tried to go for a slog off Axar. Klaasen then teed off during the death overs to ensure an above-par score for visitors.","pubDate":"2023-04-29 18:39:37","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Tim Murtagh celebrates 1000th wicket as Middlesex hammer Kent","link":"https://www.independent.co.uk/sport/cricket/tim-murtagh-middlesex-kent-matthew-potts-chris-cooke-b2329569.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Surrey were also dominant in their victory over Warwickshire.","content":"Tim Murtagh recorded a 10-wicket match haul as Middlesex secured a second successive LV= Insurance County Championship victory at the expense of Kent in Division One. The seamer reached 1000 wickets in all formats for his team after taking six for 42 – and match figures of 10 for 82 – as Kent fell to 128 all out at Lord’s. Ben Compton and Jack Leaning had dragged Kent back into contention with an 87-run partnership but seven wickets tumbled cheaply, setting Middlesex a comfortable chase of 86 as Sam Robson and Pieter Malan steered them to victory with nine wickets remaining. Surrey also secured a nine-wicket victory with a dominant display against Warwickshire at Edgbaston. The visitors added 70 to their total, with Jamie Smith top-scoring on 88, to set a first-innings lead of 131, but a fantastic spell from Kemar Roach saw the fast bowler take three for nine, leaving Warwickshire 22 for four at lunch. Roach finished with a five-for as the hosts fell to 141 all out and Surrey knocked off the required 11 runs in two overs. In Division Two, Matthew Potts starred with the ball picking up five wickets as Durham claimed victory by an innings and seven runs against Derbyshire at Chester-Le-Street. The visitors had made a good start to day three with Matthew Lamb and Luis Reece putting on 149 runs for the sixth wicket, but Durham sparked into life after Lamb fell just short of his century on 99, pinned lbw by Ben Raine. England seamer Potts then skittled through Derbyshire’s lower order, taking five for 65 for Durham to extend their lead at the top of the table. Sussex continued their push for victory against Gloucestershire, sparked by substitute fielder Tom Clark’s direct-hit run out of Marcus Harris. A chaotic period then saw Nathan McAndrew claim the wickets of James Bracey and Graeme van Buuren from successive balls for Gloucestershire to go four down at tea. Sussex took five further wickets in the late session, with McAndrew finishing the day with figures of five for 53 to leave Gloucestershire 198 for nine at the close, still 257 runs behind their opponent’s first-innings total. Chris Cooke and Michael Neser starred with the bat as Glamorgan fought back against Leicestershire. Chasing 407, Glamorgan were struggling on 225 for seven in their opening innings before Cooke and Neser shared an eight-wicket partnership of 211 to help move the side on to 446 for eight. Cooke remained unbeaten on 121 at the close of play, with Neser departing for 90 after being bowled by Chris Wright.","pubDate":"2023-04-29 18:39:09","image_url":"https://static.independent.co.uk/2023/04/29/19/1620067f39b81ba4090f90c45e742c3aY29udGVudHNlYXJjaGFwaSwxNjgyODcyOTQw-2.54927284.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IPL: Abhishek, Klaasen shine in Sunrisers' third win of season","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/dc-vs-srh-ipl-2023-highlights-abhishek-sharma-heinrich-klaasen-shine-in-sunrisers-hyderabads-third-win-of-season/articleshow/99875724.cms","keywords":null,"creator":null,"video_url":null,"description":"Abhishek Sharma, back at the top of the order for Sunrisers Hyderabad, was an anomaly for the first 12 overs of a match played between two equally unsure teams at the Ferozeshah Kotla on Saturday evening. His uncluttered intent fetched him 67 runs off 36 laid the foundation for Heinrich Klassen’s blazing unbeaten 27-ball 53 for SRH to post 197/6 and secure a nine-run win against a beleaguered Delhi Capitals.","content":"NBA: Action pics of playoffs Top NBA play-off moments Top action pics of NBA playoffs Top action pictures of NBA play-offs NBA special! Top moments NBA Mania!: Classy first-round playoff pictures Sunday showdown! Top Premier League Moments EPL: Top weekend action pictures Exciting action pictures of NBA Catch some top action of recent NBA games","pubDate":"2023-04-29 17:57:16","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"North West Cricket results 29/04/2023","link":"https://highlandradio.com/2023/04/29/north-west-cricket-results-29-04-2023/","keywords":["Sport"],"creator":["highlandsport"],"video_url":null,"description":"Strabane 1st XI 224 v 174/2 (21.5/30) Newbuildings 1st XI Newbuildings 1st XI won by 8 wickets (DLS method) Ballyspallen 1st XI 175 v 179/5 Eglinton 1st XI Eglinton 1st XI won by 5 wickets Donemana 1st XI 238 v 132 Bonds Glen 1st XI Donemana 1st XI won by 106 runs Burndennett 1st XI … North West Cricket results 29/04/2023 Read More » The post North West Cricket results 29/04/2023 appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Sun, 30 Apr 2023 (+353) 07491 25000 (+353) 086 60 25000 Facebook-f Twitter Instagram Youtube News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Listen Live Watch Live News Sport Obituaries Playback Events Shows Bingo Jobs Menu News Sport Obituaries Playback Events Shows Bingo Jobs Listen Live Watch Live Highland Fling in Glasgow Customer Service Awards Clár sa Charr Home / News & Sport / North West Cricket results 29/04/2023 North West Cricket results 29/04/2023 Sport April 29, 2023 Strabane 1st XI 224 v 174/2 (21.5/30) Newbuildings 1st XI Newbuildings 1st XI won by 8 wickets (DLS method) Ballyspallen 1st XI 175 v 179/5 Eglinton 1st XI Eglinton 1st XI won by 5 wickets Donemana 1st XI 238 v 132 Bonds Glen 1st XI Donemana 1st XI won by 106 runs Burndennett 1st XI 158 v 139/3 Coleraine 1st XI Coleraine 1st XI won by 7 wickets Killyclooney 1st XI 106 v 109/1 Bready 1st XI Bready 1st XI won by 9 wickets Fox Lodge 1st XI 102 v 103/5 St Johnston 1st XI St Johnston 1st XI won by 5 wickets Advertisement Advertisement Advertisement Top Stories News , Top Stories Joint funeral for siblings killed in Aughnacloy collision to be held on Monday 29 April 2023 News , Top Stories Hundreds turn out to Strabane vigil for family members killed in Aughnacloy collision 29 April 2023 News , Audio , Top Stories Donegal Senator called for Sports Capital Programme to open to allow new applications avail of funding. 29 April 2023 News , Top Stories Coast Guard, RNLI & Water Safety Ireland issue safety notice 29 April 2023 Advertisement Related News News , Top Stories Joint funeral for siblings killed in Aughnacloy collision to be held on Monday 29 April 2023 News , Top Stories Hundreds turn out to Strabane vigil for family members killed in Aughnacloy collision 29 April 2023 News , Audio , Top Stories Donegal Senator called for Sports Capital Programme to open to allow new applications avail of funding. 29 April 2023 News , Top Stories Coast Guard, RNLI & Water Safety Ireland issue safety notice 29 April 2023 News , Top Stories €1.3 million awarded to Donegal primary and special schools under the Minor Works Grant 28 April 2023 Playback Main Evening News, Sport, An Nuacht and Obituaries – Friday April 28th 28 April 2023 Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland enquiries@highlandradio.com Telephone: (+353) 07491 25000 Text: (+353) 086 60 25000 Fax: (+353) 07491 25344 News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertisement Copyright ©2023 Highland Radio - All Rights Reserved Designed by Manna | Developed by Purposemakers News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland (+353) 07491 25000 (+353) 086 60 25000 enquiries@highlandradio.com Facebook-f Twitter Instagram Youtube","pubDate":"2023-04-29 17:25:09","image_url":null,"source_id":"highlandradio","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Afghan cricketer Najib Zadran undergoes surgery at Pakistani hospital","link":"https://en.dailypakistan.com.pk/29-Apr-2023/afghan-cricketer-najib-zadran-undergoes-surgery-at-pakistani-hospital","keywords":["Sports"],"creator":null,"video_url":null,"description":"PESHAWAR – Afghanistan national cricket team player Najib Zadran underwent a tonsillectomy, a surgical procedure to remove the tonsils, at a hospital in northwestern Pakistani province of Khyber Pakhtunkhwa.","content":"PESHAWAR – Afghanistan national cricket team player Najib Zadran underwent a tonsillectomy, a surgical procedure to remove the tonsils, at a hospital in northwestern Pakistani province of Khyber Pakhtunkhwa. The Afghan all-rounder was admitted to a private hospital in Peshawar. He was presented flowers by the hospital administration after the successful surgery. Zadran has been discharged from the hospital and he has went back to his country along with his brother.","pubDate":"2023-04-29 17:23:27","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-04-29/afghan-cricketer-najib-zadran-undergoes-surgery-at-pakistani-hospital-1682787526-1844.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Gary Newbon: I knew Neville would be a natural behind the mic","link":"https://www.birminghammail.co.uk/sport/sport-opinion/gary-newbon-knew-neville-would-26811218","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Gary Newbon)"],"video_url":null,"description":"I enjoyed a good relationship with both Philip and Gary Neville, as well as their late father, Neville Neville","content":"Jimmy Greaves, Andy Townsend and Gary Neville are the biggest football names that I started off in television. The first two were at ATV and Central, respectively. As for Neville, I arranged for him to be an ITV pundit for the 2002 World Cup. I enjoyed a good relationship with both Philip and Gary Neville, as well as their late father, Neville Neville. When I discovered that Gary was injured and would miss the World Cup in Japan, I asked his father about the ITV role, which he agreed would be good. Both the Neville brothers and their sister, England netball international player and coach Tracey, were good with the media. It was the attitude I always looked for when picking on-screen talent. Players like Paul Scholes, Chris Sutton and Gabby Agbonlahor would not have been on my list. They were completely unhelpful. I got one interview with Scholes, none with Sutton or Agbonlahor. As it happens, Scholes and particularly Sutton are now good on the box. When I left ITV to join Sky Sports in the autumn of 2004, I chatted to Mr Neville senior about switching Gary to Sky, where I knew my boss, Andy Melvin, would be keen on having him in the football line-up. When my daughter Claire was at Rugby School as a sixth former, I was asked to manage The Lord’s Taverners charity cricket team at the school. I normally played in those days but as manager for the day I had to select and take charge. I had the former England opener David Steele and Jimmy Greaves in my team. I rang Sir Alex Ferguson to ask for a couple of players. He recommended Gary, who was in the first team, and Philip who was still to break through. When I questioned, Sir Alex about Philip, he assured me that he had been in the England schools cricket team and that he had to divert him from the attentions of Lancashire County Cricket Club down the road! He told me to ring their father, Mr Neville, who was commercial director at Bury Football Club. So I rang Mr Neville and introduced myself. He referred to Sir Alex as the boss and we chatted on. After a while, I said, ‘I cannot just call you Mr Neville, what is your first name please?’. He said it was Neville. I found myself incredulously saying, “Neville, Neville?” He brought his two sons, who were both brilliant. Gary was the fast bowler, Philip the batsman. Anyway, it started a long and trusted friendship. Mr Neville became an agent for his sons. Sadly, though, he died from a heart attack, aged 65, in August 2015 while visiting Australia to support Tracey, England’s netball coach in the World Cup. Meanwhile, Gary has made a real name for himself as a Sky Sports football pundit and has made a fortune in business. I got the idea in an Orlando hotel lift of bringing Andy Townsend into Central TV. It was 1994 and I was staying in the Republic of Ireland’s World Cup hotel. Andy was the Ireland captain. Andy, his wife, Jackie, and I were sharing a lift and I asked Andy what he planned to do after his playing days were over. He said he wanted to work in TV. He was still the Aston Villa captain but I offered him an expert’s role on Central Sports Special (highlights of midweek matches) when he was not playing. His first game involved West Bromwich Albion. He was and still is very good. Andy’s attitude was great. When he was transferred to Middlesbrough, he still made the journey down to the Central TV studios in Birmingham and when we came off the air late at night he would motor back to the northeast in time for training. Andy Gray, who also started with me, did the same thing when at Everton. Again, attitude. Townsend went on to be a regular on the ITV network and I was surprised when he was replaced. But talent is a subjective view and the person who makes the selections is the one that counts! Andy T is now the successful host of the Premier League’s coverage that goes around the world. It has been well documented how Jimmy Greaves made the breakthrough with me at ATV. People thought Trevor East, Billy Wright, Tony Flanagan (executive producer) and myself showed great foresight but I have to be honest, I never realised how funny Jimmy would be, although I rarely admit that! Mark Bolton did well as a presenter for Central Sport and progressed to Sky Sports where, sadly, he did not hold the post down after a while. I also brought in Manish Bhasin off BBC Radio Leicester. He was an absolute natural. Jon Holmes, Gary Lineker’s agent, rang me one day to ask permission to take him to the BBC, which I obviously granted. Then there was Sarah Jane Mee. She, too, took to presenting immediately. Eventually, Sarah Jane left to present football for Sky Sports and is now one of their leading newscasters at Sky News. Next week in the Sunday Mercury, read how I was the victim of wind-ups on TV by Alan Shearer, equestrian hero Nick Skelton, snooker’s Steve Davis and BBC reporter Ray Stubbs. I fell for it every time!","pubDate":"2023-04-29 16:50:39","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26810173.ece/ALTERNATES/s615/1_GettyImages-1479325727.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT","link":"https://www.gudstory.com/andre-russell-not-pandre-russell-has-struggled-to-find-his-form-with-four-single-digit-scores-in-eight-matches-and-a-highest-score-of-38-despite-starting-with-sixes-against-rashid-khan-in-the-game/","keywords":["Cricket","Andre Russell"],"creator":["Vishnu Reddy"],"video_url":null,"description":"Andre Russell has struggled to find his form in the ongoing season of IPL, with four single-digit scores in eight matches and a highest score of 38*. Despite starting with sixes against Rashid Khan in the game against Gujarat Titans, Andre Russell was unable to reach the kind of total that was expected of him. […] The post Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT appeared first on Gud Story.","content":"Home Sports Cricket Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT by Vishnu Reddy April 29, 2023 in Cricket Reading Time: 2 mins read 0 KKR Star All-rounder Andre Russell (Image Credit: Twitter) Share on Facebook Share on Twitter Andre Russell has struggled to find his form in the ongoing season of IPL, with four single-digit scores in eight matches and a highest score of 38*. Despite starting with sixes against Rashid Khan in the game against Gujarat Titans, Andre Russell was unable to reach the kind of total that was expected of him. Andre Russell finished with 34 runs off 19 balls as Kolkata Knight Riders posted a total of 179 for 7 against GT at Eden Gardens in Kolkata. During the mid-innings interview, Andre Russell had no intentions to hide his disappointment and expressed his dissatisfaction with the total that his team ended up with on a flat batting track. “I’m not happy at all looking at the total we’ve got,” said Andre Russell. When asked about the ideal total for the pitch, Andre Russell responded that something around 200 would have been ideal, especially given the start they got. “I think this pitch is a 190-200 wicket, so we are about 20 runs short. We only have ourselves to blame.” Rahman Ullah Gurbaz returned to the side after Jason Roy pulled out due to a back spasm and smashed seven sixes and five fours in his 39-ball knock, recording his second fifty of the season. However, KKR failed to make good use of the final few overs after rookie Afghanistan spinner Noor Ahmed (4-0-21-2) dismissed Rahman Ullah Gurbaz for 81 with compatriot Rashid Khan completing a well-judged catch. Mohammed Shami (3/33 in 4 overs) and Irishman Josh Little (2/25 in 4 overs) played their part to perfection in restricting KKR. ADVERTISEMENT At 135/5, KKR still had the firepower of Andre Russell and Rinku Singh with 28 balls remaining. However, they were unable to surpass the 200-mark, which always provides a team with a psychological edge. Noor claimed his second victim in Rinku, while the “birthday boy” Russell could not express himself fully as the GT bowlers did well to limit him to a 19-ball 34 not out (2×4, 3×6). GT easily achieved the target with 7 wickets in hand in the 18th over, proving Andre Russell’s words during the mid innings interview. They had a comfortable chase with opener Shubman Gill providing a good start. Although there was a brief period where Gill (49) and Hardik Pandya (25) fell in successive overs, KKR made a comeback. But it was short-lived as Vijay Shankar (51* off 24) and David Miller (32* off 18) took charge and led their team to victory. The defending champions registered their fourth consecutive away win. Read More: Our bowlers will come back strong: Wasim Jaffer Tags: Andre Russell Related Posts Our bowlers will come back strong: Wasim Jaffer April 29, 2023 WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad April 28, 2023 Stuart Broad writes off Australia’s 2021-22 Ashes triumph as a void series April 28, 2023 Dhoni’s Influence in India is Incomparable, Says Harbhajan Singh April 21, 2023","pubDate":"2023-04-29 16:33:33","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"Our bowlers will come back strong: Wasim Jaffer","link":"https://www.gudstory.com/our-bowlers-will-come-back-strong-says-wasim-jaffer/","keywords":["Cricket","Wasim Jaffer"],"creator":["Vishnu Reddy"],"video_url":null,"description":"After Punjab Kings suffered a 56-run defeat against Lucknow Super Giants in Mohali on April 28th, the team’s batting coach, Wasim Jaffer, showed support for their bowlers. Despite the visitors achieving the second highest IPL total of all time, Jaffer did not dwell on the bowling performance. Wasim Jaffer acknowledged that Kagiso Rabada, Arshdeep Singh, […] The post Our bowlers will come back strong: Wasim Jaffer appeared first on Gud Story.","content":"Home Sports Cricket Our bowlers will come back strong: Wasim Jaffer by Vishnu Reddy April 29, 2023 in Cricket Reading Time: 3 mins read 0 Punjab Kings batting coach Wasim Jaffer (Image Credit: IPL) Share on Facebook Share on Twitter After Punjab Kings suffered a 56-run defeat against Lucknow Super Giants in Mohali on April 28th, the team’s batting coach, Wasim Jaffer, showed support for their bowlers. Despite the visitors achieving the second highest IPL total of all time, Jaffer did not dwell on the bowling performance. Wasim Jaffer acknowledged that Kagiso Rabada, Arshdeep Singh, and Sam Curran, the lead seamers, had given away 144 runs in 11 overs, but Wasim Jaffer chose not to overanalyze the situation. “Don’t think there are any serious concerns (about the bowling attack) because they had thrice defended scores in tough conditions.” “Be it against Mumbai or Rajasthan, even in the earlier Kolkata game. The bowling unit has always performed for us this season. Today was one of those days when everything clicked for the opposition and we were a bit clueless. Our bowlers will come back strong,” Said Jaffer in the post-match press conference. Lucknow Super Giants displayed a ruthless performance with the bat, as Kyle Mayers set the tempo right from the start, scoring 74 runs in the PowerPlay. Ayush Badoni, along with Marcus Stoinis and Nicholas Pooran, continued the aggressive intent, ensuring that there was no slowing down. Although the pitch was excellent for batting, Wasim Jaffer acknowledges that the bowlers could have executed their plans better. “Perhaps we could have gone to Plan B a bit more. Like using the slower balls a lot more and using the longer boundary consistently. They (LSG) did this a lot more effectively and it worked for them. But again, most of their shots were clearing the boundary quite easily, so we have to give them credit for that.” ADVERTISEMENT Although teams batting first had won eight of the last 10 games, Shikhar Dhawan’ s decision to bowl at the toss appeared flawed in hindsight. However, Wasim Jaffer defended his skipper’s decision and treated the bowling effort as a one-off. At the same time, Wasim Jaffer was full of praise for Lucknow’s batting performance. The tourists hammered 110 runs between overs 7-15 after a frenetic powerplay. “It is a trend for IPL sides to opt for chasing after winning the toss. Dew was obviously a factor too. We had seen it during practice and that was a reason as well. But when the opposition gets to 257, it’s always tough to chase. They got a fast start in the powerplay and never slowed down at any stage. You have to give them credit,” Wasim Jaffer further added (Source: Cricbuzz). Despite having a mammoth target to chase, Punjab Kings surprised many by not promoting any of their big hitters early in the batting order. While young Atharva Taide made the most of his opportunity to bat at number three, it seemed like a perfect stage for one of the power-hitters to come in early. However, Punjab Kings stuck to their conventional order, and as a result, a lot of their firepower arrived a bit too late in the innings. “Our top-three is a fix and Taide is someone who always does well in the powerplay. We also wanted to maintain a left-right combination throughout. Also, someone like Livingstone hadn’t played a lot of cricket, Raza had done well for us and that’s why he was promoted. We thought that if we can get closer to the total, we have the power of Livingstone and Curran. As for Jitesh and Shahrukh, their roles are for the final five overs. Everyone did their best but it’s just unfortunate that we fell short by 56 runs,” opined Wasim Jaffer. Read More: WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad Tags: Wasim Jaffer Related Posts Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT April 29, 2023 WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad April 28, 2023 Stuart Broad writes off Australia’s 2021-22 Ashes triumph as a void series April 28, 2023 Dhoni’s Influence in India is Incomparable, Says Harbhajan Singh April 21, 2023","pubDate":"2023-04-29 16:15:24","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ: पाकिस्तान को उसके घर में घुसकर डेरिल मिचेल सिखाया सबक, दो शतक लगाकर धुरंधर गेंदबाजों की निकाली हवा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pak-vs-nz-daryl-mitchell-scored-his-second-consecutive-century-in-odi-series-against-pakistan/articleshow/99874279.cms","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: पाकिस्तान के खिलाफ दूसरे वनडे मैच में न्यूजीलैंड के धाकड़ बल्लेबाज डेरिल मिचेल ने शतक लगाकर धमाल मचा दिया। मिचेल का इस सीरीज में लगातार दूसरा शतक है। पहले मैच में भी उन्होंने बेहतरीन शतकीय पारी खेली।","content":"पाकिस्तान के खिलाफ तीन वनडे मैचों की सीरीज के दूसरे मुकाबले में न्यूजीलैंड के स्टार खिलाड़ी डेरिल मिचेल ने लगातार दूसरे मैच में शतक लगाकर सनसनी मचा दी है। रावलपिंडी में खेले गए दूसरे वनडे मैच डेरिल मिचेल ने बेहतरीन 129 रनों की पारी खेली। अपनी इस पारी में उन्होंने 119 गेंदों का सामना किया जिसमें उन्होंने 8 चौके और 3 छक्के भी लगाए। सीरीज के पहले वनडे में भी डेरिल मिचेल ने शानदार शतकीय पारी खेली थी। पहले वनडे में भी मिचेल ने 113 रनों की दमदार पारी खेली थी लेकिन इसके बावजूद न्यूजीलैंड की टीम इस मैच में जीत हासिल नहीं कर सकी थी। पाकिस्तान के खिलाफ डेरिल मिचेल पहले ऐसे बल्लेबाज बने हैं जिन्होंने उसके घर में लगातार दो वनडे शतक लगाने का कारनामा किया है। इसके अलावा मिचेल के करियर का यह तीसरा वनडे शतक भी था। मिचेल के अलावा न्यूजीलैंड की तरफ से टॉम लाथम ने भी 85 गेंदों में 98 रनों की पारी खेली। अपनी इस पारी में उन्होंने 8 चौके और 1 छक्का भी लगाया। इसके अलावा चाड बोवेस ने न्यूजीलैंड के लिए पारी की शुरुआत करते हुए बेहतरीन 51 रनों की पारी खेली। वहीं विल यंग 19 और जेम्स नीशम ने भी 17 रनों की महत्वपूर्ण पारी खेली, जिसके कारण ही मेहमान टीम ने निर्धारित 20 ओवर के खेल में 5 विकेट के नुकसान पर 336 रनों का चुनौतीपूर्ण स्कोर खड़ा किया। न्यूजीलैंड के खिलाफ इस मुकाबले में पाकिस्तानी गेंदबाजी आक्रमण कुछ खास असरदार नहीं रही। पाकिस्तान की तरफ से सिर्फ हारिस रउफ ने भी अपना दमदार खेल दिखाया। हालांकि हारिस राउफ काफी महंगे भी साबित हुए। उन्होंने अपने 10 ओवर के स्पेल में 78 रन खर्च दिए। इसके अलावा पाकिस्तान की तरफ से नशीम शाह को सिर्फ एक सफलता मिल पाई। इसके अलावा और कोई भी गेंदबाज अपना असर नहीं दिखा सके।","pubDate":"2023-04-29 15:53:07","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Fakhar Zaman becomes fastest Pakistani player to score 3000 ODI runs","link":"https://en.dailypakistan.com.pk/30-Apr-2023/fakhar-zaman-becomes-fastest-pakistani-player-to-score-3000-odi-runs","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"Batsman Fakhar Zaman on Saturday became the fastest Pakistani player to score 3000 ODI runs.","content":"Batsman Fakhar Zaman on Saturday became the fastest Pakistani player to score 3000 ODI runs. Zaman reached this milestone in his 67th innings. Only Hashim Amla (57) has got there quicker. Zaman achieved this honour while playing the second One Day International (ODI) against New Zealand at the Rawalpindi Cricket Stadium on Saturday. Pakistan beat New Zealand by seven wickets in the second ODI of the five-match series. New Zealand set a target of 337 runs at the loss of five wickets in 50 overs and Pakistan achieved the target in 48.2 overs at the loss of just three wickets.","pubDate":"2023-04-29 19:28:00","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-04-30/fakhar-zaman-becomes-fastest-pakistani-player-to-score-3000-odi-runs-1682808560-5480.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"IPL 2023 | Marsh heroics in vain as Sunrisers Hyderabad beat Delhi Capitals by 9 runs","link":"https://www.thehindu.com/sport/cricket/ipl-2023-marsh-heroics-in-vain-as-sunrisers-hyderabad-beat-delhi-capitals-by-9-runs/article66794669.ece","keywords":null,"creator":null,"video_url":null,"description":"The hard-hitting Australian all-rounder first snapped four wickets and then blasted six maximums in his 39-ball 63-run knock to conjure up hopes of a successful chase but once he was out, things went downhill for the hosts","content":"Mitchell Marsh dished out one of his finest all-round performances but it wasn't enough as Sunrisers Hyderabad returned to winning ways with a comprehensive nine-run win over Delhi Capitals in the IPL here on April 29. The hard-hitting Australian all-rounder first snapped four wickets and then blasted six maximums in his 39-ball 63-run knock to conjure up hopes of a successful chase but once he was out, things went downhill for the hosts on the sluggish Kotla track. Batting first, Abhishek Sharma slammed a 36-ball 67 to set the stage for Heinrich Klaasen, who provided the final flourish with an unbeaten 53 as SRH posted an impressive 197 for 6. In reply, Delhi lost skipper David Warner for a second-ball duck but Philip Salt (59) and Marsh took the attack to the opposition with a 112-run partnership off just 66 balls to lay a solid ground to their run chase. With the duo in full flow, 57 runs came in the powerplay as left-arm spinner Akeal Hosein conceded 30 in his three overs. Marsh clobbered Umran Malik for two maximums and Salt produced two good hits to amass 22 runs off the over, while Abhishek was punished for bowling wrong length with Marsh slamming a four and six. An incredible caught and bowled effort from Mayank Markande finally broke the partnership with Salt back in the pavilion. Soon, Abhishek got rid of Manish Pandey and when Marsh holed out to Markram off Hosein, it left DC at 125 for 4 in the 14th over. Needing 69 off 36 balls, SRH tightened the screws to limit DC to 188 for six in 20 overs with Axar Patel scoring 29 off 14 balls. With the win, SRH snapped their three-match losing streak to remain alive in the competition. They are bow in the eighth spot with six points, while DC stayed at the bottom. Earlier, back at the top, Abhishek seemed to be batting on a different track, slamming 12 fours and a six, even as the others struggled on the two-paced wicket. While the southpaw looked in good rhythm, the rest of the top and middle order continued to disappoint, scoring in single digits. But Klaasen's 27-ball-knock ensured that momentum is not lost with as many as 62 runs coming off last five overs. The South African added 53 of 33 balls with Abdul Samad (28 off 21 balls) and 35 off 18 balls with Akeal Hosein (16 off 10 balls) as SRH posted the highest score at the Kotla this season. For DC, Mitchell Marsh was the best bowler in display, returning with figures of 4-1-27-4, while Axar Patel (1/29) picked up a solitary wicket. Ishant Sharma also got one but he was expensive in his three overs. The stylish Abhishek was particularly harsh on Ishant Sharma, picking up back-to-back boundaries before pulling him for another four in the midwicket region. Mayank Agarwal, however, didn't look comfortable and his misery was ended by Ishant with a well-directed bouncer. Rahul Tripathi sent one from Mukesh Kumar over the keeper for a six before falling to Mitchell Marsh. Ishant was again on the firing line of Abhishek, who smashed him for four boundaries more in the sixth over as 16 runs came off it, helping SRH to end the powerplay at 62 for 2. Kuldeep Yadav could have dismissed Abhishek but Anrich Nortje spilled a regulation catch at the boundary and the opener rubbed salt on the bowler's wound with a slogsweep for a maximum to bring up his fifty. Abhishek took 25 balls to reach the milestone. Marsh was rewarded for bowling his cutters and back of length scrambled seam deliveries as he dismissed Markram and Harry Brook in a double wicket maiden over. Sunrisers reached 83 for 4 in 10 overs. Medium pacer Mukesh Kumar was next taken to the cleaners with Abhishek smashing two fours in the first two balls and Klaasen clobbering him for a four and maximum. The 11th over yielded 24 runs, taking SRH over the 100-mark in the process. Abhishek was finally dismissed in the 12th over when he tried to go for a slog off Axar. Klaasen then teed off during the death overs to ensure an above-par score for visitors.","pubDate":"2023-04-29 18:39:37","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"Tim Murtagh celebrates 1000th wicket as Middlesex hammer Kent","link":"https://www.independent.co.uk/sport/cricket/tim-murtagh-middlesex-kent-matthew-potts-chris-cooke-b2329569.html","keywords":["Cricket","Sport"],"creator":["Pa Sport Staff"],"video_url":null,"description":"Surrey were also dominant in their victory over Warwickshire.","content":"Tim Murtagh recorded a 10-wicket match haul as Middlesex secured a second successive LV= Insurance County Championship victory at the expense of Kent in Division One. The seamer reached 1000 wickets in all formats for his team after taking six for 42 – and match figures of 10 for 82 – as Kent fell to 128 all out at Lord’s. Ben Compton and Jack Leaning had dragged Kent back into contention with an 87-run partnership but seven wickets tumbled cheaply, setting Middlesex a comfortable chase of 86 as Sam Robson and Pieter Malan steered them to victory with nine wickets remaining. Surrey also secured a nine-wicket victory with a dominant display against Warwickshire at Edgbaston. The visitors added 70 to their total, with Jamie Smith top-scoring on 88, to set a first-innings lead of 131, but a fantastic spell from Kemar Roach saw the fast bowler take three for nine, leaving Warwickshire 22 for four at lunch. Roach finished with a five-for as the hosts fell to 141 all out and Surrey knocked off the required 11 runs in two overs. In Division Two, Matthew Potts starred with the ball picking up five wickets as Durham claimed victory by an innings and seven runs against Derbyshire at Chester-Le-Street. The visitors had made a good start to day three with Matthew Lamb and Luis Reece putting on 149 runs for the sixth wicket, but Durham sparked into life after Lamb fell just short of his century on 99, pinned lbw by Ben Raine. England seamer Potts then skittled through Derbyshire’s lower order, taking five for 65 for Durham to extend their lead at the top of the table. Sussex continued their push for victory against Gloucestershire, sparked by substitute fielder Tom Clark’s direct-hit run out of Marcus Harris. A chaotic period then saw Nathan McAndrew claim the wickets of James Bracey and Graeme van Buuren from successive balls for Gloucestershire to go four down at tea. Sussex took five further wickets in the late session, with McAndrew finishing the day with figures of five for 53 to leave Gloucestershire 198 for nine at the close, still 257 runs behind their opponent’s first-innings total. Chris Cooke and Michael Neser starred with the bat as Glamorgan fought back against Leicestershire. Chasing 407, Glamorgan were struggling on 225 for seven in their opening innings before Cooke and Neser shared an eight-wicket partnership of 211 to help move the side on to 446 for eight. Cooke remained unbeaten on 121 at the close of play, with Neser departing for 90 after being bowled by Chris Wright.","pubDate":"2023-04-29 18:39:09","image_url":"https://static.independent.co.uk/2023/04/29/19/1620067f39b81ba4090f90c45e742c3aY29udGVudHNlYXJjaGFwaSwxNjgyODcyOTQw-2.54927284.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IPL: Abhishek, Klaasen shine in Sunrisers' third win of season","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/dc-vs-srh-ipl-2023-highlights-abhishek-sharma-heinrich-klaasen-shine-in-sunrisers-hyderabads-third-win-of-season/articleshow/99875724.cms","keywords":null,"creator":null,"video_url":null,"description":"Abhishek Sharma, back at the top of the order for Sunrisers Hyderabad, was an anomaly for the first 12 overs of a match played between two equally unsure teams at the Ferozeshah Kotla on Saturday evening. His uncluttered intent fetched him 67 runs off 36 laid the foundation for Heinrich Klassen’s blazing unbeaten 27-ball 53 for SRH to post 197/6 and secure a nine-run win against a beleaguered Delhi Capitals.","content":"NBA: Action pics of playoffs Top NBA play-off moments Top action pics of NBA playoffs Top action pictures of NBA play-offs NBA special! Top moments NBA Mania!: Classy first-round playoff pictures Sunday showdown! Top Premier League Moments EPL: Top weekend action pictures Exciting action pictures of NBA Catch some top action of recent NBA games","pubDate":"2023-04-29 17:57:16","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"North West Cricket results 29/04/2023","link":"https://highlandradio.com/2023/04/29/north-west-cricket-results-29-04-2023/","keywords":["Sport"],"creator":["highlandsport"],"video_url":null,"description":"Strabane 1st XI 224 v 174/2 (21.5/30) Newbuildings 1st XI Newbuildings 1st XI won by 8 wickets (DLS method) Ballyspallen 1st XI 175 v 179/5 Eglinton 1st XI Eglinton 1st XI won by 5 wickets Donemana 1st XI 238 v 132 Bonds Glen 1st XI Donemana 1st XI won by 106 runs Burndennett 1st XI … North West Cricket results 29/04/2023 Read More » The post North West Cricket results 29/04/2023 appeared first on Highland Radio - Latest Donegal News and Sport.","content":"Sun, 30 Apr 2023 (+353) 07491 25000 (+353) 086 60 25000 Facebook-f Twitter Instagram Youtube News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Listen Live Watch Live News Sport Obituaries Playback Events Shows Bingo Jobs Menu News Sport Obituaries Playback Events Shows Bingo Jobs Listen Live Watch Live Highland Fling in Glasgow Customer Service Awards Clár sa Charr Home / News & Sport / North West Cricket results 29/04/2023 North West Cricket results 29/04/2023 Sport April 29, 2023 Strabane 1st XI 224 v 174/2 (21.5/30) Newbuildings 1st XI Newbuildings 1st XI won by 8 wickets (DLS method) Ballyspallen 1st XI 175 v 179/5 Eglinton 1st XI Eglinton 1st XI won by 5 wickets Donemana 1st XI 238 v 132 Bonds Glen 1st XI Donemana 1st XI won by 106 runs Burndennett 1st XI 158 v 139/3 Coleraine 1st XI Coleraine 1st XI won by 7 wickets Killyclooney 1st XI 106 v 109/1 Bready 1st XI Bready 1st XI won by 9 wickets Fox Lodge 1st XI 102 v 103/5 St Johnston 1st XI St Johnston 1st XI won by 5 wickets Advertisement Advertisement Advertisement Top Stories News , Top Stories Joint funeral for siblings killed in Aughnacloy collision to be held on Monday 29 April 2023 News , Top Stories Hundreds turn out to Strabane vigil for family members killed in Aughnacloy collision 29 April 2023 News , Audio , Top Stories Donegal Senator called for Sports Capital Programme to open to allow new applications avail of funding. 29 April 2023 News , Top Stories Coast Guard, RNLI & Water Safety Ireland issue safety notice 29 April 2023 Advertisement Related News News , Top Stories Joint funeral for siblings killed in Aughnacloy collision to be held on Monday 29 April 2023 News , Top Stories Hundreds turn out to Strabane vigil for family members killed in Aughnacloy collision 29 April 2023 News , Audio , Top Stories Donegal Senator called for Sports Capital Programme to open to allow new applications avail of funding. 29 April 2023 News , Top Stories Coast Guard, RNLI & Water Safety Ireland issue safety notice 29 April 2023 News , Top Stories €1.3 million awarded to Donegal primary and special schools under the Minor Works Grant 28 April 2023 Playback Main Evening News, Sport, An Nuacht and Obituaries – Friday April 28th 28 April 2023 Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland enquiries@highlandradio.com Telephone: (+353) 07491 25000 Text: (+353) 086 60 25000 Fax: (+353) 07491 25344 News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertisement Copyright ©2023 Highland Radio - All Rights Reserved Designed by Manna | Developed by Purposemakers News Sport Obituaries Playback Events Shows Bingo Jobs News Sport Obituaries Playback Events Shows Bingo Jobs Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Advertise Contact Us How to Listen Competition T&Cs Privacy Policy Highland Radio Pine Hill, Letterkenny, Co. Donegal, Ireland (+353) 07491 25000 (+353) 086 60 25000 enquiries@highlandradio.com Facebook-f Twitter Instagram Youtube","pubDate":"2023-04-29 17:25:09","image_url":null,"source_id":"highlandradio","category":["sports"],"country":["ireland"],"language":"english"},{"title":"Afghan cricketer Najib Zadran undergoes surgery at Pakistani hospital","link":"https://en.dailypakistan.com.pk/29-Apr-2023/afghan-cricketer-najib-zadran-undergoes-surgery-at-pakistani-hospital","keywords":["Sports"],"creator":null,"video_url":null,"description":"PESHAWAR – Afghanistan national cricket team player Najib Zadran underwent a tonsillectomy, a surgical procedure to remove the tonsils, at a hospital in northwestern Pakistani province of Khyber Pakhtunkhwa.","content":"PESHAWAR – Afghanistan national cricket team player Najib Zadran underwent a tonsillectomy, a surgical procedure to remove the tonsils, at a hospital in northwestern Pakistani province of Khyber Pakhtunkhwa. The Afghan all-rounder was admitted to a private hospital in Peshawar. He was presented flowers by the hospital administration after the successful surgery. Zadran has been discharged from the hospital and he has went back to his country along with his brother.","pubDate":"2023-04-29 17:23:27","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-04-29/afghan-cricketer-najib-zadran-undergoes-surgery-at-pakistani-hospital-1682787526-1844.jpg","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Gary Newbon: I knew Neville would be a natural behind the mic","link":"https://www.birminghammail.co.uk/sport/sport-opinion/gary-newbon-knew-neville-would-26811218","keywords":["Sport"],"creator":["newsdesk@birminghamlive.co.uk (Gary Newbon)"],"video_url":null,"description":"I enjoyed a good relationship with both Philip and Gary Neville, as well as their late father, Neville Neville","content":"Jimmy Greaves, Andy Townsend and Gary Neville are the biggest football names that I started off in television. The first two were at ATV and Central, respectively. As for Neville, I arranged for him to be an ITV pundit for the 2002 World Cup. I enjoyed a good relationship with both Philip and Gary Neville, as well as their late father, Neville Neville. When I discovered that Gary was injured and would miss the World Cup in Japan, I asked his father about the ITV role, which he agreed would be good. Both the Neville brothers and their sister, England netball international player and coach Tracey, were good with the media. It was the attitude I always looked for when picking on-screen talent. Players like Paul Scholes, Chris Sutton and Gabby Agbonlahor would not have been on my list. They were completely unhelpful. I got one interview with Scholes, none with Sutton or Agbonlahor. As it happens, Scholes and particularly Sutton are now good on the box. When I left ITV to join Sky Sports in the autumn of 2004, I chatted to Mr Neville senior about switching Gary to Sky, where I knew my boss, Andy Melvin, would be keen on having him in the football line-up. When my daughter Claire was at Rugby School as a sixth former, I was asked to manage The Lord’s Taverners charity cricket team at the school. I normally played in those days but as manager for the day I had to select and take charge. I had the former England opener David Steele and Jimmy Greaves in my team. I rang Sir Alex Ferguson to ask for a couple of players. He recommended Gary, who was in the first team, and Philip who was still to break through. When I questioned, Sir Alex about Philip, he assured me that he had been in the England schools cricket team and that he had to divert him from the attentions of Lancashire County Cricket Club down the road! He told me to ring their father, Mr Neville, who was commercial director at Bury Football Club. So I rang Mr Neville and introduced myself. He referred to Sir Alex as the boss and we chatted on. After a while, I said, ‘I cannot just call you Mr Neville, what is your first name please?’. He said it was Neville. I found myself incredulously saying, “Neville, Neville?” He brought his two sons, who were both brilliant. Gary was the fast bowler, Philip the batsman. Anyway, it started a long and trusted friendship. Mr Neville became an agent for his sons. Sadly, though, he died from a heart attack, aged 65, in August 2015 while visiting Australia to support Tracey, England’s netball coach in the World Cup. Meanwhile, Gary has made a real name for himself as a Sky Sports football pundit and has made a fortune in business. I got the idea in an Orlando hotel lift of bringing Andy Townsend into Central TV. It was 1994 and I was staying in the Republic of Ireland’s World Cup hotel. Andy was the Ireland captain. Andy, his wife, Jackie, and I were sharing a lift and I asked Andy what he planned to do after his playing days were over. He said he wanted to work in TV. He was still the Aston Villa captain but I offered him an expert’s role on Central Sports Special (highlights of midweek matches) when he was not playing. His first game involved West Bromwich Albion. He was and still is very good. Andy’s attitude was great. When he was transferred to Middlesbrough, he still made the journey down to the Central TV studios in Birmingham and when we came off the air late at night he would motor back to the northeast in time for training. Andy Gray, who also started with me, did the same thing when at Everton. Again, attitude. Townsend went on to be a regular on the ITV network and I was surprised when he was replaced. But talent is a subjective view and the person who makes the selections is the one that counts! Andy T is now the successful host of the Premier League’s coverage that goes around the world. It has been well documented how Jimmy Greaves made the breakthrough with me at ATV. People thought Trevor East, Billy Wright, Tony Flanagan (executive producer) and myself showed great foresight but I have to be honest, I never realised how funny Jimmy would be, although I rarely admit that! Mark Bolton did well as a presenter for Central Sport and progressed to Sky Sports where, sadly, he did not hold the post down after a while. I also brought in Manish Bhasin off BBC Radio Leicester. He was an absolute natural. Jon Holmes, Gary Lineker’s agent, rang me one day to ask permission to take him to the BBC, which I obviously granted. Then there was Sarah Jane Mee. She, too, took to presenting immediately. Eventually, Sarah Jane left to present football for Sky Sports and is now one of their leading newscasters at Sky News. Next week in the Sunday Mercury, read how I was the victim of wind-ups on TV by Alan Shearer, equestrian hero Nick Skelton, snooker’s Steve Davis and BBC reporter Ray Stubbs. I fell for it every time!","pubDate":"2023-04-29 16:50:39","image_url":"https://i2-prod.manchestereveningnews.co.uk/incoming/article26810173.ece/ALTERNATES/s615/1_GettyImages-1479325727.jpg","source_id":"birminghammail","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT","link":"https://www.gudstory.com/andre-russell-not-pandre-russell-has-struggled-to-find-his-form-with-four-single-digit-scores-in-eight-matches-and-a-highest-score-of-38-despite-starting-with-sixes-against-rashid-khan-in-the-game/","keywords":["Cricket","Andre Russell"],"creator":["Vishnu Reddy"],"video_url":null,"description":"Andre Russell has struggled to find his form in the ongoing season of IPL, with four single-digit scores in eight matches and a highest score of 38*. Despite starting with sixes against Rashid Khan in the game against Gujarat Titans, Andre Russell was unable to reach the kind of total that was expected of him. […] The post Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT appeared first on Gud Story.","content":"Home Sports Cricket Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT by Vishnu Reddy April 29, 2023 in Cricket Reading Time: 2 mins read 0 KKR Star All-rounder Andre Russell (Image Credit: Twitter) Share on Facebook Share on Twitter Andre Russell has struggled to find his form in the ongoing season of IPL, with four single-digit scores in eight matches and a highest score of 38*. Despite starting with sixes against Rashid Khan in the game against Gujarat Titans, Andre Russell was unable to reach the kind of total that was expected of him. Andre Russell finished with 34 runs off 19 balls as Kolkata Knight Riders posted a total of 179 for 7 against GT at Eden Gardens in Kolkata. During the mid-innings interview, Andre Russell had no intentions to hide his disappointment and expressed his dissatisfaction with the total that his team ended up with on a flat batting track. “I’m not happy at all looking at the total we’ve got,” said Andre Russell. When asked about the ideal total for the pitch, Andre Russell responded that something around 200 would have been ideal, especially given the start they got. “I think this pitch is a 190-200 wicket, so we are about 20 runs short. We only have ourselves to blame.” Rahman Ullah Gurbaz returned to the side after Jason Roy pulled out due to a back spasm and smashed seven sixes and five fours in his 39-ball knock, recording his second fifty of the season. However, KKR failed to make good use of the final few overs after rookie Afghanistan spinner Noor Ahmed (4-0-21-2) dismissed Rahman Ullah Gurbaz for 81 with compatriot Rashid Khan completing a well-judged catch. Mohammed Shami (3/33 in 4 overs) and Irishman Josh Little (2/25 in 4 overs) played their part to perfection in restricting KKR. ADVERTISEMENT At 135/5, KKR still had the firepower of Andre Russell and Rinku Singh with 28 balls remaining. However, they were unable to surpass the 200-mark, which always provides a team with a psychological edge. Noor claimed his second victim in Rinku, while the “birthday boy” Russell could not express himself fully as the GT bowlers did well to limit him to a 19-ball 34 not out (2×4, 3×6). GT easily achieved the target with 7 wickets in hand in the 18th over, proving Andre Russell’s words during the mid innings interview. They had a comfortable chase with opener Shubman Gill providing a good start. Although there was a brief period where Gill (49) and Hardik Pandya (25) fell in successive overs, KKR made a comeback. But it was short-lived as Vijay Shankar (51* off 24) and David Miller (32* off 18) took charge and led their team to victory. The defending champions registered their fourth consecutive away win. Read More: Our bowlers will come back strong: Wasim Jaffer Tags: Andre Russell Related Posts Our bowlers will come back strong: Wasim Jaffer April 29, 2023 WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad April 28, 2023 Stuart Broad writes off Australia’s 2021-22 Ashes triumph as a void series April 28, 2023 Dhoni’s Influence in India is Incomparable, Says Harbhajan Singh April 21, 2023","pubDate":"2023-04-29 16:33:33","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"Our bowlers will come back strong: Wasim Jaffer","link":"https://www.gudstory.com/our-bowlers-will-come-back-strong-says-wasim-jaffer/","keywords":["Cricket","Wasim Jaffer"],"creator":["Vishnu Reddy"],"video_url":null,"description":"After Punjab Kings suffered a 56-run defeat against Lucknow Super Giants in Mohali on April 28th, the team’s batting coach, Wasim Jaffer, showed support for their bowlers. Despite the visitors achieving the second highest IPL total of all time, Jaffer did not dwell on the bowling performance. Wasim Jaffer acknowledged that Kagiso Rabada, Arshdeep Singh, […] The post Our bowlers will come back strong: Wasim Jaffer appeared first on Gud Story.","content":"Home Sports Cricket Our bowlers will come back strong: Wasim Jaffer by Vishnu Reddy April 29, 2023 in Cricket Reading Time: 3 mins read 0 Punjab Kings batting coach Wasim Jaffer (Image Credit: IPL) Share on Facebook Share on Twitter After Punjab Kings suffered a 56-run defeat against Lucknow Super Giants in Mohali on April 28th, the team’s batting coach, Wasim Jaffer, showed support for their bowlers. Despite the visitors achieving the second highest IPL total of all time, Jaffer did not dwell on the bowling performance. Wasim Jaffer acknowledged that Kagiso Rabada, Arshdeep Singh, and Sam Curran, the lead seamers, had given away 144 runs in 11 overs, but Wasim Jaffer chose not to overanalyze the situation. “Don’t think there are any serious concerns (about the bowling attack) because they had thrice defended scores in tough conditions.” “Be it against Mumbai or Rajasthan, even in the earlier Kolkata game. The bowling unit has always performed for us this season. Today was one of those days when everything clicked for the opposition and we were a bit clueless. Our bowlers will come back strong,” Said Jaffer in the post-match press conference. Lucknow Super Giants displayed a ruthless performance with the bat, as Kyle Mayers set the tempo right from the start, scoring 74 runs in the PowerPlay. Ayush Badoni, along with Marcus Stoinis and Nicholas Pooran, continued the aggressive intent, ensuring that there was no slowing down. Although the pitch was excellent for batting, Wasim Jaffer acknowledges that the bowlers could have executed their plans better. “Perhaps we could have gone to Plan B a bit more. Like using the slower balls a lot more and using the longer boundary consistently. They (LSG) did this a lot more effectively and it worked for them. But again, most of their shots were clearing the boundary quite easily, so we have to give them credit for that.” ADVERTISEMENT Although teams batting first had won eight of the last 10 games, Shikhar Dhawan’ s decision to bowl at the toss appeared flawed in hindsight. However, Wasim Jaffer defended his skipper’s decision and treated the bowling effort as a one-off. At the same time, Wasim Jaffer was full of praise for Lucknow’s batting performance. The tourists hammered 110 runs between overs 7-15 after a frenetic powerplay. “It is a trend for IPL sides to opt for chasing after winning the toss. Dew was obviously a factor too. We had seen it during practice and that was a reason as well. But when the opposition gets to 257, it’s always tough to chase. They got a fast start in the powerplay and never slowed down at any stage. You have to give them credit,” Wasim Jaffer further added (Source: Cricbuzz). Despite having a mammoth target to chase, Punjab Kings surprised many by not promoting any of their big hitters early in the batting order. While young Atharva Taide made the most of his opportunity to bat at number three, it seemed like a perfect stage for one of the power-hitters to come in early. However, Punjab Kings stuck to their conventional order, and as a result, a lot of their firepower arrived a bit too late in the innings. “Our top-three is a fix and Taide is someone who always does well in the powerplay. We also wanted to maintain a left-right combination throughout. Also, someone like Livingstone hadn’t played a lot of cricket, Raza had done well for us and that’s why he was promoted. We thought that if we can get closer to the total, we have the power of Livingstone and Curran. As for Jitesh and Shahrukh, their roles are for the final five overs. Everyone did their best but it’s just unfortunate that we fell short by 56 runs,” opined Wasim Jaffer. Read More: WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad Tags: Wasim Jaffer Related Posts Andre Russell Not Pleased, Holds Entire KKR Team Accountable for Loss to GT April 29, 2023 WTC Final: Ajinkya Rahane Unveils Key to Success After Making India Squad April 28, 2023 Stuart Broad writes off Australia’s 2021-22 Ashes triumph as a void series April 28, 2023 Dhoni’s Influence in India is Incomparable, Says Harbhajan Singh April 21, 2023","pubDate":"2023-04-29 16:15:24","image_url":null,"source_id":"gudstory","category":["sports"],"country":["india"],"language":"english"},{"title":"PAK vs NZ: पाकिस्तान को उसके घर में घुसकर डेरिल मिचेल सिखाया सबक, दो शतक लगाकर धुरंधर गेंदबाजों की निकाली हवा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pak-vs-nz-daryl-mitchell-scored-his-second-consecutive-century-in-odi-series-against-pakistan/articleshow/99874279.cms","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: पाकिस्तान के खिलाफ दूसरे वनडे मैच में न्यूजीलैंड के धाकड़ बल्लेबाज डेरिल मिचेल ने शतक लगाकर धमाल मचा दिया। मिचेल का इस सीरीज में लगातार दूसरा शतक है। पहले मैच में भी उन्होंने बेहतरीन शतकीय पारी खेली।","content":"पाकिस्तान के खिलाफ तीन वनडे मैचों की सीरीज के दूसरे मुकाबले में न्यूजीलैंड के स्टार खिलाड़ी डेरिल मिचेल ने लगातार दूसरे मैच में शतक लगाकर सनसनी मचा दी है। रावलपिंडी में खेले गए दूसरे वनडे मैच डेरिल मिचेल ने बेहतरीन 129 रनों की पारी खेली। अपनी इस पारी में उन्होंने 119 गेंदों का सामना किया जिसमें उन्होंने 8 चौके और 3 छक्के भी लगाए। सीरीज के पहले वनडे में भी डेरिल मिचेल ने शानदार शतकीय पारी खेली थी। पहले वनडे में भी मिचेल ने 113 रनों की दमदार पारी खेली थी लेकिन इसके बावजूद न्यूजीलैंड की टीम इस मैच में जीत हासिल नहीं कर सकी थी। पाकिस्तान के खिलाफ डेरिल मिचेल पहले ऐसे बल्लेबाज बने हैं जिन्होंने उसके घर में लगातार दो वनडे शतक लगाने का कारनामा किया है। इसके अलावा मिचेल के करियर का यह तीसरा वनडे शतक भी था। मिचेल के अलावा न्यूजीलैंड की तरफ से टॉम लाथम ने भी 85 गेंदों में 98 रनों की पारी खेली। अपनी इस पारी में उन्होंने 8 चौके और 1 छक्का भी लगाया। इसके अलावा चाड बोवेस ने न्यूजीलैंड के लिए पारी की शुरुआत करते हुए बेहतरीन 51 रनों की पारी खेली। वहीं विल यंग 19 और जेम्स नीशम ने भी 17 रनों की महत्वपूर्ण पारी खेली, जिसके कारण ही मेहमान टीम ने निर्धारित 20 ओवर के खेल में 5 विकेट के नुकसान पर 336 रनों का चुनौतीपूर्ण स्कोर खड़ा किया। न्यूजीलैंड के खिलाफ इस मुकाबले में पाकिस्तानी गेंदबाजी आक्रमण कुछ खास असरदार नहीं रही। पाकिस्तान की तरफ से सिर्फ हारिस रउफ ने भी अपना दमदार खेल दिखाया। हालांकि हारिस राउफ काफी महंगे भी साबित हुए। उन्होंने अपने 10 ओवर के स्पेल में 78 रन खर्च दिए। इसके अलावा पाकिस्तान की तरफ से नशीम शाह को सिर्फ एक सफलता मिल पाई। इसके अलावा और कोई भी गेंदबाज अपना असर नहीं दिखा सके।","pubDate":"2023-04-29 15:53:07","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}