{"newsArray":[{"title":"Lyon and Swepson combine for eight wickets","link":"https://www.cairnspost.com.au/sport/cricket/lyon-and-swepson-combine-for-eight-wickets/video/9fa44eace2816b4209b84947fd1a750f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia bowled Sri Lanka out for 212 on day one of the first test, but had less success in batting.","content":null,"pubDate":"2022-06-29 21:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Smith fumes as iron Lyon’s effort diminished - Daily Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5kYWlseXRlbGVncmFwaC5jb20uYXUvc3BvcnQvY3JpY2tldC9hdXN0cmFsaWEtdi1zcmktbGFua2EtZmlyc3QtdGVzdC1uZXdzLWFuZC11cGRhdGVzLXNoYW5lLXdhcm5lLWhvbm91cmVkLWJlZm9yZS1wbGF5L25ld3Mtc3RvcnkvNzQ1MmFlODM1NzYxYzY5MTJlZDhkNzc4NzZmYTk4MmHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Smith fumes as iron Lyon’s effort diminished  Daily TelegraphNathan Lyon shines with five wickets on day one of first Test against Sri Lanka in Galle  ABC NewsLate scalps curb Australia's ascendancy after Lyon's five  cricket.com.auEXCLUSIVE: Nathan Lyon could finish with 600 Test wickets, says Steve O'Keefe, as the off-spinner returns to site of Test debut  Wide World of SportsLyon’s five wickets in Galle all about celebration and redemption  Sydney Morning HeraldView Full coverage on Google News","content":null,"pubDate":"2022-06-29 21:11:15","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"“It’s just a phase”: Rahul Dravid reckons Virat Kohli needs no motivation despite poor form ahead of Edgbaston Test match vs England","link":"https://thesportsrush.com/cricket-news-its-just-a-phase-rahul-dravid-reckons-virat-kohli-needs-no-motivation-despite-poor-form-ahead-of-edgbaston-test-match-vs-england/","keywords":["Cricket","India tour of Ireland 2022","Rahul Dravid","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rahul Dravid reckons Virat Kohli is an inspiration for people on and off the field; remains unperturbed on questions over his batting form. In the absence of KL Rahul, and most probably skipper Rohit Sharma as well, in the imminent one-off Test match of the Pataudi Trophy series against England starting July 1, team India… The post “It’s just a phase”: Rahul Dravid reckons Virat Kohli needs no motivation despite poor form ahead of Edgbaston Test match vs England appeared first on The SportsRush.","content":"Rahul Dravid reckons Virat Kohli is an inspiration for people on and off the field; remains unperturbed on questions over his batting form. In the absence of KL Rahul, and most probably skipper Rohit Sharma as well, in the imminent one-off Test match of the Pataudi Trophy series against England starting July 1, team India would want their former skipper Virat Kohli to lead from the front in the batting department, which lacks much of Test match experience. With scores of 33 and 67 in the recently concluded 4-day warm-up match versus Leicestershire, Kohli did play some delightful strokes to inspire confidence in the team management and the ardent fans at large. However, fans and Cricket followers across the globe are yet to witness the 71st international century off his bat, which has not been scored since the year 2019. Team India head coach Rahul Dravid, however seems to be unperturbed by his average returns with the bat for quite some time now. Addressing the media via a virtual press conference on Wednesday evening, India head coach Rahul Dravid exclaimed that all the team expects is match-winnings contributions from him, and that he has ticked all the boxes as far as the process for the same is concerned. “He’s ticking all the right boxes. There are phases but don’t think he needs motivation – it’s just a phase. We want match-winning contributions from him. He continues to contribute on and off the field and inspires a lot of guys,” remarked Dravid when questioned on Kohli’s form. Despite scoring his last international ton in November 2019 against Bangladesh during the Pink-Ball Test match, Kohli has scored six half-centuries since then in Tests, and Dravid expects him to keep contributing to the team’s success without worrying about the three digit score. To me, it doesn’t matter who the captain is for the Test vs England. Once toss happens, the leader of the pack for that game is still Virat Kohli. Nobody can handle Ben Stokes better. : ) — KSR (@KShriniwasRao) June 29, 2022 With Cheteshwar Pujara likely to open the innings alongside either of Mayank Agarwal or Shubman Gill, expect Kohli to bat at no.3, a spot above his usual position in Tests.","pubDate":"2022-06-29 19:35:07","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah to lead India in rescheduled 5th test","link":"https://www.thehansindia.com/sports/cricket/jasprit-bumrah-to-lead-india-in-rescheduled-5th-test-751151","keywords":["Sports,Cricket"],"creator":["Kushan Sarkar"],"video_url":null,"description":"Jasprit Bumrah is set to become the first fast bowler in 35 years to lead Indian Test team in the rescheduled 'fifth Test' against England as regular captain Rohit Sharma has been ruled out of the game after testing positive for COVID-19 for the second time on Wednesday.","content":"New Delhi: Jasprit Bumrah is set to become the first fast bowler in 35 years to lead Indian Test team in the rescheduled 'fifth Test' against England as regular captain Rohit Sharma has been ruled out of the game after testing positive for COVID-19 for the second time on Wednesday. The last pacer-captain that India had was the great Kapil Dev, who was removed from captaincy in 1987. Since then India has never had a speed merchant leading the team in traditional cricket.\"Rohit is out of this Test match, starting July 1, as his RT-PCR test has come positive again. He is still in isolation. Jasprit Bumrah, who is one of the vice-captains in absence of KL Rahul, will lead the team,\" a senior BCCI official told PTI on conditions of anonymity. Bumrah will be the 36th cricketer to lead India in the longest-format since the country first played in 1932. The Gujarat pacer, who has 123 wickets in 29 Tests, has grown into world's best fast bowlers. The Chairman of selectors Chetan Sharma had already said that he is being groomed as a future leader. Fast bowlers have not been traditionally given the job in India unlike in Pakistan where their greatest skipper was Imran Khan. Legends like Wasim Akram and Waqar Younis also led national side. In West Indies, Courtney Walsh led the side for a considerable amount of time and world number one Pat Cummins now leading Australia in longest format. (PTI)","pubDate":"2022-06-29 18:59:20","image_url":"https://assets.thehansindia.com/h-upload/2022/06/29/500x300_1300337-jasprit.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Suresh Raina ने दीपक हुड्डा के शतक पर दी बधाई, इंस्टाग्राम पर कही ये बात","link":"https://www.abplive.com/sports/cricket/former-indian-player-suresh-raina-congratulated-indian-batsman-deepak-hooda-on-instagram-in-the-second-t20-against-ireland-2157551","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IND vs IRE 2022:</strong> आयरलैंड के खिलाफ दूसरे टी20 में भारतीय बल्लेबाज दीपक हुड्डा (Deepak Hooda) ने शानदार शतकीय पारी खेली, उन्होंने 55 गेंद पर 104 रन बनाए. दरअसल, हुड्डा (Deepak Hooda) ने इस शतक के बाद आगामी टी20 वर्ल्ड कप (T20 World Cup) में अपनी मजबूत दावेदारी पेश की. वहीं, टी20 क्रिकेट में शतक लगाने वाले दीपक हुड्डा (Deepak Hooda) चौथे खिलाड़ी खिलाड़ी बन गए. इससे पहले रोहित शर्मा (Rohit Sharma), केएल राहुल (KL Rahul) और सुरेश रैना (Suresh Raina) यह कारनामा कर चुके हैं. अब पूर्व भारतीय खिलाड़ी सुरेश रैना (Suresh Raina) ने दीपक हुड्डा (Deepak Hooda) के इस शतक पर बड़ा बयान दिया है.</p> <p style=\"text-align: justify;\"><strong>सुरेश रैना ने दीपक हुड्डा को बधाई दी</strong></p> <p style=\"text-align: justify;\">सुरेश रैना (Suresh Raina) ने आयरलैंड (Ireland) के खिलाफ शतक लगाने वाले दीपक हुड्डा (Deepak Hooda) की तारीफ करते हुए इंस्टाग्राम (Instagram) पर बधाई दी. उन्होंने लिखा कि शतक लगाने वाले भारतीय खिलाड़ियों के क्लब में आपका स्वागत है. दरअसल, दीपक हुड्डा (Deepak Hooda) के शतक के बाद बीसीसीआई (BCCI) ने इंस्टाग्राम (Instagram) पर पोस्ट किया था, इस पोस्ट पर कमेंट्स कर सुरेश रैना (Suresh Raina) ने दीपक हुड्डा (Deepak Hooda) को बधाई दी. गौरतलब है कि सुरेश रैना (Suresh Raina) के अलावा रोहित शर्मा (Rohit Sharma) और केएल राहुल (KL Rahul) ने भारत के लिए टी20 क्रिकेट में शतक लगाने का कारनामा किया है.</p> <p style=\"text-align: justify;\"><strong>हुड्डा और सैमसन के बीच रिकार्ड साझेदारी</strong></p> <p style=\"text-align: justify;\">आयरलैंड (Ireland) के खिलाफ दूसरे टी20 मैच में टॉस जीतकर बल्लेबाजी करने उतरी भारतीय टीम (Indian Team) की शुरूआत बेहद खराब रही. ओपनर ईशान किशन (Ishan Kishan) सस्ते में पवैलियन लौट गए, लेकिन दीपक हुड्डा (Deepak Hooda) और संजू सैमसन (Sanju Samson) ने पारी को संभाल लिया. दोनों खिलाड़ियों के बीच 87 बॉल पर रिकार्ड 176 रनों की साझेदारी हुई. यह भारत के लिए टी20 क्रिकेट में किसी भी विकेट के लिए सबसे बड़ी साझेदारी है. वहीं, 227 रन बनाने के बाद भारतीय टीम (Indian Team) रोमांचक मैच में 4 रनों से जीत दर्ज करने में सफल रही. इस जीत के साथ ही भारतीय टीम ने 2-0 से सीरीज अपने नाम कर लिया.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/irfan-pathan-statement-on-deepak-hooda-i-had-asked-to-score-a-century-in-ipl-he-made-it-for-india-2157246\">'मैंने IPL में शतक लगाने का बोला था, उसने इंडिया के लिए बना दिया', दीपक हुड्डा पर पूर्व भारतीय दिग्गज ऑलराउंडर का बयान</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-ire-2nd-t20-deepak-hooda-become-fourth-indian-batsman-to-score-t20-hundred-for-india-2156807\">Deepak Hooda Record: टी20 में शतक जड़ हुड्डा ने बनाया रिकॉर्ड, ऐसा करने वाले चौथे भारतीय</a><br /></strong></p>","content":null,"pubDate":"2022-06-29 18:03:49","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Leeming Spartan Cricket Club finally allowed to take step towards a second oval at John Connell Reserve","link":"https://www.perthnow.com.au/local-news/south/leeming-spartan-cricket-club-finally-allowed-to-take-step-towards-a-second-oval-at-john-connell-reserve-c-7330801","keywords":null,"creator":["Indigo Lemay-Conway"],"video_url":null,"description":"After almost 30 years of pleading with the council for a second cricket field at John Connell Reserve, the local sporting clubs have finally been offered a glimmer of hope.","content":null,"pubDate":"2022-06-29 18:00:00","image_url":"https://images.perthnow.com.au/publication/C-7330801/78f578e0f200e6a8696afaeaf2cb0e79d138c6f4-16x9-x0y1048w2731h1536.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"James Anderson in awe of England's positive approach after 3-0 series win - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2VuZ2xhbmQtdnMtaW5kaWEtNXRoLXRlc3QtamFtZXMtYW5kZXJzb24taW4tYXdlLW9mLWVuZ2xhbmQtcy1wb3NpdGl2ZS1hcHByb2FjaC1hZnRlci0zLTAtc2VyaWVzLXdpbi0xMzIyMjk20gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"James Anderson in awe of England's positive approach after 3-0 series win  ESPNcricinfo\"Ankle Feels Pretty Good\": England's James Anderson Hopes To Recover For India Test  NDTV SportsEngland's James Anderson hopes to recover for India Test  Times of IndiaWill James Anderson Play Against India? It Depends On This Factor  The Cricket LoungeAjit Agarkar Explains Why India Do Not Need To Match England's Style Of Play  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-06-29 17:57:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“India are a little bit undercooked”: Moeen Ali reckons England as favourites to win fifth Test vs India at Edgbaston","link":"https://thesportsrush.com/cricket-news-india-are-a-little-bit-undercooked-moeen-ali-reckons-england-as-favourites-to-win-fifth-test-vs-india-at-edgbaston/","keywords":["Cricket","Birmingham","Edgbaston","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Moeen Ali reckons England as favourites to win the rescheduled fifth Test match set to be played at Edgbaston, Birmingham from Friday. Sans KL Rahul, and maybe sans skipper Rohit Sharma as well, team India will take on England at the Edgbaston Cricket Ground, in Birmingham, during the rescheduled ‘fifth’ Test match of the Pataudi… The post “India are a little bit undercooked”: Moeen Ali reckons England as favourites to win fifth Test vs India at Edgbaston appeared first on The SportsRush.","content":"Moeen Ali reckons England as favourites to win the rescheduled fifth Test match set to be played at Edgbaston, Birmingham from Friday. Sans KL Rahul, and maybe sans skipper Rohit Sharma as well, team India will take on England at the Edgbaston Cricket Ground, in Birmingham, during the rescheduled ‘fifth’ Test match of the Pataudi Trophy series after the same had to be postponed last year due to a spree of COVID-19 cases in the Indian camp. Having last played a Test match series against Sri Lanka in March this year, a majority of the Indian team players have been continuously playing the shortest format of the game since then, with the recently concluded warm-up match against Leicestershire the only Red ball match experience they have had collectively after around four months. England, on the other hand, under the new Test captain-coach duo of Ben Stokes and Brendon McCullum, seem to have found their mojo back, as they annihilated World Test champions New Zealand 3-0, a few days ago at home. It is on the basis of the aforementioned series whitewash inflicted upon New Zealand, that England all-rounder Moeen Ali believes would act to their advantage when they play the one-off Test match against India beginning Friday. “If this series had ended last year, India might have won.” If you had questioned me 4-5 weeks ago, I would’ve predicted India’s victory. But now I believe England will come out on top. “India is a little undercooked, ” Moeen exclaimed from Birmingham. “India had four games under their belt last year.” They have had a practice match and some net training this time. England, in my viewpoint, are the favorite right now because they have just started playing three good Tests and are playing very confidently, especially in comparison to last year,” he further added. Ali, who played his last Test against India at The Oval last year, had announced his retirement from the format soon after, citing a lack of enjoyment under the then team management with Joe Root as the skipper. Incidentally, he was elected as England’s vice-captain on his last Test of his international career. Moeen Ali has been named as England’s vice-captain for the fourth Test against India at the Oval starting on Thursday #ENGvsIND #Cricket — Saj Sadiq (@SajSadiqCricket) September 1, 2021 He, however, opened up on his Test comeback and the possibility of donning the Whites yet again under the present coach Brendon McCullum, while expressing his desire to play the away Test series against Pakistan post the T20 World Cup this year.","pubDate":"2022-06-29 17:52:27","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Azeem Rafiq Reveals 'Threats And Attacks' Since Yorkshire Racism Claims","link":"https://sports.ndtv.com/cricket/azeem-rafiq-reveals-threats-and-attacks-since-yorkshire-racism-claims-3113060","keywords":null,"creator":null,"video_url":null,"description":"Rafiq sent shockwaves across cricket two years ago when he said he had been subjected to racial harassment and bullying during his time as a Yorkshire player","content":"Azeem Rafiq claims his family have been subjected to \"threats, attacks and intimidation\" since the former Yorkshire spinner made allegations of racism against his old club. Rafiq sent shockwaves across cricket two years ago when he said he had been subjected to racial harassment and bullying during his time as a Yorkshire player. Yorkshire commissioned an investigation into the 31-year-old's claims and, though seven were upheld, the county concluded last October that no member of staff would face disciplinary action. The club came under pressure from politicians and the England and Wales Cricket Board launched its own investigation into the allegations and Yorkshire's handling of them. That culminated in the ECB charging Yorkshire and a number of individuals earlier this month with bringing the sport into disrepute. Rafiq, who said the racism had given him suicidal thoughts, insisted the whole affair has taken a toll on his family, who have endured abuse of their own from the public. Promoted \"From the moment I spoke out about my experiences at YCCC, my family and I have been subjected to threats, attacks and intimidation,\" Rafiq wrote on Twitter. \"Absolutely no individual or their family should be made to feel unsafe and I urge people to respect that.\"","pubDate":"2022-06-29 17:32:28","image_url":"https://c.ndtvimg.com/2020-09/o4k505ig_azeem-rafiq_625x300_03_September_20.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma not ruled out of Edgbaston Test as yet: Rahul Dravid","link":"https://www.thehansindia.com/sports/cricket/rohit-sharma-not-ruled-out-of-edgbaston-test-as-yet-rahul-dravid-751095","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Rohit returned with another covid positive result on WednesdayHe is due to undergo two more testsThe fifth Test will begin on July 1 in Birmingham","content":"India head coach Rahul Dravid on Wednesday said Captain Rohit Sharma is not out of the Edgbaston Test as yet as the player is being monitored after returning with a second covid positive result.The rescheduled fifth Test between India and England will go underway on Friday (July 1) in Birmingham. India lead the five-match Test series 2-1. Rohit tested positive for covid during India's practice four-day game against Leicestershire. His mandatory five-day quarantine ended today (June 29) but the Indian skipper has not tested negative yet. \"So the update on Rohit is that he is being monitored by our medical team, he is not yet been ruled out,\" Dravid said in a virtual press conference on Wednesday. \"Obviously, he needs to get the negative test to be available. We will keep monitoring him, we have still got close to 36 hours to go so we he will have a test later tonight and one maybe tomorrow morning as well. We will see, it is really upto the medical team and sports science team to decide on that. We will keep monitoring,\" the former Indian cricketer added further. It was earlier reported that Rohit is due to undergo two more tests: one today (June 29) evening and another on Thursday (June 30) - before the Indian team management takes a final decision on his availability for the Edgbaston Test. Last year when India toured England for the five-match Test series, Rohit was the tourists' best batsman. He scored 368 runs in four Tests at an average of 52.57, including a century. He was only behind England's Joe Root, who was at the top of the runs chart with 564 runs at an average of 94, including three tons.With KL Rahul out of the series with a groin injury and Rohit in doubt, Team India recently added opening batsman Mayank Agarwal to their Test squad.When the BCCI announced India's Test squad for the England tour, they had named Rahul as Rohit's deputy. However, Rahul is currently ruled out and is recovering after undergoing surgery. While the BCCI has not officially announced who'll lead in Rohit's absence, fast bowler Jasprit Bumrah is the likely contender. Bumrah was India's vice-captain during India's previous Test series, against Sri Lanka at home. The Indian team management has already informed Bumrah that he'll be the stand-in captain for the rescheduled fifth Test if Rohit is not given a green signal to play, according to news reports. Notably, Bumrah has never led in any cricket, and this will be his maiden captaincy stint. He will also become the first fast bowler to captain India since Kapil Dev.That Edgbaston feeling 😀#Edgbaston | #ENGvIND pic.twitter.com/gfexO5giSG— Edgbaston (@Edgbaston) June 29, 2022 India squad for 5th Test against England: Rohit Sharma (c), Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (wk), KS Bharat (wk), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohd Shami, Jasprit Bumrah, Mohd Siraj, Umesh Yadav, Prasidh Krishna, Mayank Agarwal.","pubDate":"2022-06-29 17:28:26","image_url":"https://assets.thehansindia.com/h-upload/2022/06/29/500x300_1300281-rahul-dravid.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ultimate Kho Kho में रैपर बादशाह ने पुनीत बालन संग खरीदी टीम, इस साल खेला जाएगा पहला संस्करण","link":"https://www.abplive.com/sports/musician-badshah-businessman-punit-balan-buy-mumbai-team-in-ultimate-kho-kho-2157541","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Musician Badshah:</strong> Ultimate Kho Kho में बॉलीवुड (Bollywood) का एक और तड़का लग गया है. दरअसल, मशहूर रैपर और सिंगर बादशाह (Badshah) भी अब फ्रेंजाइजी के मालिक हो गए हैं. बादशाह फेमस फिल्म निर्माता, डेवलपर पुनीत बालन (Punit Balan) संग फ्रेंजाइजी के सह-मालिक (Co-owner) होंगे. अब इस तरह मुंबई (Mumbai) की इस टीम के ऑनबोर्ड (Onboard) होने के बाद लाइन-अप (Line-up) पूरा हो गया है.</p> <p style=\"text-align: justify;\"><strong>Ultimate Kho Kho में 6 टीमें लेंगी हिस्सा</strong></p> <p style=\"text-align: justify;\">गौरतलब है कि यह Ultimate Kho Kho का पहला संस्करण (Edition) है. इस प्रतियोगिता में कुल 6 टीमें हिस्सा लेंगी. Ultimate Kho Kho का पहला संस्करण (First Edition) इसी साल खेला जाएगा. वहीं, इससे पहले ओडिशा स्पोर्ट्स डेवलपमेंट एंड प्रमोशन कंपनी (OSDPC) की ऑनरशिप वाली टीम लीग की पांचवीं फ्रेंचाइजी बनी थी. जिसके बाद ओडिशा के खेल और युवा सेवा मंत्री तुषारकांति बेहरा (Tusharkanti Behera) ने कहा कि खो-खो ओडिशा के कई हिस्सों में बहुत लोकप्रिय है. उन्होंने कहा कि हालिया खेलो इंडिया गेम यूथ गेम्स (Khelo India Game Youth Games) में हमारे खिलाड़ियों ने शानदार खेल दिया और सिल्वर मेडल (Silver Medal) अपने नाम किया.</p> <p style=\"text-align: justify;\"><strong>'खो-खो ओडिशा का पारंपरिक खेल'</strong></p> <p style=\"text-align: justify;\">ओडिशा (Odisha) के खेल और युवा सेवा मंत्री तुषारकांति बेहरा (Tusharkanti Behera) का मानना है कि खो-खो ओडिशा का पारंपरिक खेल (Traditional Game) है, इसलिए हमारे पास इसे राज्य में और विकसित करने की बहुत गुंजाइश है, इस वजह से हमने खो-खो (Kho Kho) लीग में भाग लेने का फैसला किया है. साथ ही उन्होंने इसे ओडिशा (Odisha) के मुख्यमंत्री (CM) नवीन पटनायक (Naveen Patnaik) के दृष्टिकोण का हिस्सा बताया.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/rahul-dravid-pc-rohit-sharma-is-not-out-of-the-fifth-test-yet-coach-dravid-s-big-statement-on-the-indian-captain-2157530\">Rahul Dravid PC: अभी पांचवें टेस्ट से बाहर नहीं हुए हैं रोहित शर्मा, कोच द्रविड़ का भारतीय कप्तान पर बड़ा बयान</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/team-india-tour-of-england-2022-squad-schedules-venue-live-streaming-ist-time-2157402\">India Tour of England 2022: जानें कब, कहां और कैसे देख सकते हैं आखिरी टेस्ट मैच, पढ़ें दोनों टीमों की संभावित प्लेइंग 11</a><br /></strong></p>","content":null,"pubDate":"2022-06-29 16:53:34","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"ICC WTC Points Table: वर्ल्ड टेस्ट चैंपियनशिप के फाइनल में पहुंचने के लिए टीम इंडिया को करना होगा ये काम, जानिए अभी क्या है स्थिति","link":"https://www.abplive.com/sports/cricket/icc-wtc-points-table-check-what-indian-cricket-team-needs-to-do-for-qualifying-in-icc-world-test-championship-finals-2157536","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>WTC Points Table:</strong> भारत (Team India) और इंग्लैंड (England) के बीच 1 जुलाई से एजबेस्टन (Edgbaston) में पांच टेस्ट मैचों की सीरीज का आखिरी और निर्णायक मुकाबला खेला जाना है. इस टेस्ट को साल 2021 में कोरोना वायरस की वजह से रद्द कर दिया गया था. फिलहाल सीरीज में टीम इंडिया 2-1 से आगे चल रही है. वर्ल्ड टेस्ट चैंपियनशिप (World Test Championship) के लिहाज से भी यह मैच काफी महत्वपूर्ण है. वहीं इस टेस्ट में जीत के बाद भी भारत को फाइनल में पहुंचने के लिए और भी मुकाबले जीतने होंगे.</p> <p style=\"text-align: justify;\"><strong>अभी तीसरे पायदान पर भारत</strong><br />अभी भारत आईसीसी वर्ल्ड टेस्ट चैंपियनशिप प्वाइंट टेबल में 77 अंकों और 58.33 प्रतिशत अंकों के साथ तीसरे पायदान पर है. वहीं अगर भारत इंग्लैंड (England) को आखिरी टेस्ट में हराकर सीरीज अपने नाम करता है तो भारत को रैंकिंग में इसका फायदा मिलेगा.&nbsp;</p> <p style=\"text-align: justify;\"><strong>ऐसे बन सकती है नंबर 1</strong><br />आईसीसी वर्ल्ड टेस्ट चैंपियनशिप प्वाइंट टेबल में पहले नंबर पर ऑस्ट्रेलिया और दूसरे पर दक्षिण अफ्रीका है. अगर भारत और इंग्लैंड के बीच आखिरी मुकाबला ड्रॉ होता है तो भी टीम इंडिया सीरीज 2-1 से अपने नाम करेगी. साथ ही 2022 में बांग्लादेश और ऑस्ट्रेलिया के भारत दौरे के साथ टीम इंडिया की नंबर 1 पर काबिज होने की संभावना बढ़ जाएंगी. यही मौका होगा जब टीम इंडिया ऑस्ट्रेलिया को पछाड़कर नंबर 1 बन सकती है.</p> <p style=\"text-align: justify;\"><br /><img src=\"https://feeds.abplive.com/onecms/images/uploaded-images/2022/06/29/2e4c3f6b2d43efb5af021d3fbbbdd135_original.jpg\" /></p> <p style=\"text-align: justify;\"><strong>इग्लैंड के अलावा 6 टेस्ट खेलने हैं</strong><br />इसी साल भारत को बांग्लादेश के खिलाफ 2 टेस्ट मैच और ऑस्ट्रेलिया के खिलाफ 4 टेस्ट मैच खेलने हैं. फाइनल में पहुंचने के लिए भारत को बांग्लादेश से दोनों टेस्ट मैच जीतने होंगे. इसके अलावा अगर भारत ऑस्ट्रेलिया को 4-0 से हरा देता है या सीरीज 3-1 से अपने नाम करता है, तो भारत के पास फाइनल में पहुंचने का मौका होगा.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-team-india-never-win-at-edgbaston-birmingham-check-details-india-vs-england-5th-test-2157501\">Team India at Edgbaston: एजबेस्टन में अब तक नहीं खुला है टीम इंडिया की जीत का खाता, बेहद शर्मनाक रहा है प्रदर्शन</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/team-india-tour-of-england-2022-squad-schedules-venue-live-streaming-ist-time-2157402\">India Tour of England 2022: जानें कब, कहां और कैसे देख सकते हैं आखिरी टेस्ट मैच, पढ़ें दोनों टीमों की संभावित प्लेइंग 11</a></strong></p>","content":null,"pubDate":"2022-06-29 16:52:49","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IRE vs IND: Thankful to Hardik for showing faith in me, says Umran Malik after 2nd T20I win","link":"https://www.thehansindia.com/sports/cricket/ire-vs-ind-thankful-to-hardik-for-showing-faith-in-me-says-umran-malik-after-2nd-t20i-win-751094","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Umran Malik defended 17 runs in the last over in 2nd T20IIndia won the game and clinched the series 2-0The pacer made his India debut in the first T20I","content":"Thankful to Hardik for showing faith in me, says Umran Malik after 2nd T20I win Umran Malik thanked Hardik Pandya for showing faith in him after the former defended 17 runs to help India win the 2nd T20I against Ireland on Tuesday. The Jammu and Kashmir pacer bowled a no ball and conceded two fours in his first three deliveries before giving away only three runs off the final three deliveries as India sealed the game by four runs at The Village in Dublin to clinch the series 2-0. \"I bowled wide to start with. Then Hardik Bhai told me to bowl a normal length and it became a no ball. When they needed eight runs off three balls, Hardik Bhai told me that if I could bowl two dots, we would win the match. Thankful to Hardik Bhai for showing faith in me and thanks to God that I didn't let him down,\" said Umran in a video posted on BCCI's official Twitter handle. Umran, who made his India debut in the first T20I, admitted that he got very emotional when he received the India cap from his Sunrisers Hyderabad (SRH) teammate Bhuvneshwar Kumar. \"It was a dream for me to play for India and it has come true. I was almost in tears when Bhuvi Bhai handed me the cap. It felt good after I successfully defended 17 runs in the final and we won the series,\" added Umran. Raw emotions on debut to keeping calm in the thrilling last-over win against Ireland! 👍 👍 #TeamIndia Umran Malik says it all after the second #IREvIND T20I in Dublin. 👏 👏 - By @RajalArora pic.twitter.com/Rsja5Lgb2M Umran had a fine season with SRH in IPL 2022, where he picked up 22 wickets in 14 games. He first received an India call-up ahead of their home series against South Africa. However, he did not get a game. During the post-match presentation on Tuesday, India's stand-in captain Hardik said that it was always going to be difficult for the Irishmen to score 18 runs against Umran's pace. \"I was trying to keep all the pressure out of my equation. I wanted to be in the present and I backed Umran. He has pace, with his pace it's always going to be tough to get 18 runs. They played some amazing shots, they batted very well, credit to them and credit to our bowlers for holding their nerves.,\" added Hardik. A great game to end the series on a winning note 💪🇮🇳What a fight! Well played, Ireland 🇮🇪 #UmranMalik #IREvIND #Cricket pic.twitter.com/UUA6suKhFh Meanwhile, Hardik also expressed his delight on winning his first series for India as captain. \"The crowd, their favourite boys were Dinesh and Sanju. Great experience to experience this side of the world. A lot of support comes for us, we try to entertain them and hope we did that. Thanks to everyone who supported us. As a child, it's always a dream to play for your country. Leading and getting the first win was special, now winning the series is special as well. Happy for Deepak and Umran,\" Hardik added further. Fantastic game to finish off the series 🇮🇳 Congratulations to the team, staff and our fans for an amazing effort. Well done to Ireland for a brilliant game 👏 pic.twitter.com/x8Ct6OhPr4 Team India are now gearing up for the one-off Test against England, which will begin on July 1 at Edgbaston in Birmingham. After that, the two sides will lock horns in three ODIs and as many T20Is.","pubDate":"2022-06-29 16:40:53","image_url":"https://assets.thehansindia.com/h-upload/2022/06/29/500x300_1300280-ire-vs-ind.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE NOW: Watch the 2022 NAB AFLW Draft - AFLW","link":"https://news.google.com/__i/rss/rd/articles/CBMiSGh0dHBzOi8vd3d3LndvbWVucy5hZmwvbmV3cy85NTEyNi9saXZlLW5vdy13YXRjaC10aGUtMjAyMi1uYWItYWZsdy1kcmFmdNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE NOW: Watch the 2022 NAB AFLW Draft  AFLW‘Gobsmacked’: Zoe Wakfer came to the draft to support her sister. She’s now an AFLW player  The AgeSwans take ‘Cripps-like’ mid first; Test cricket great’s daughter joins childhood club: AFLW Draft wrap  Fox SportsRECAP: Every pick of the 2022 NAB AFLW Draft as it happened  AFLWReliable Elliott drafted by Hawthorn  Hawthorn FCView Full coverage on Google News","content":null,"pubDate":"2022-06-29 16:28:34","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Will Rohit play 5th Test versus England: Is Rohit Sharma available for next match vs England at Edgbaston?","link":"https://thesportsrush.com/cricket-news-will-rohit-play-5th-test-versus-england-is-rohit-sharma-available-for-next-match-vs-england-at-edgbaston/","keywords":["Cricket","India tour of England 2022","Rahul Dravid","Rohit Sharma"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Will Rohit play 5th Test versus England: Team India head coach Rahul Dravid provided an update on Rohit Sharma’s availability. After wicket-keeper batter KL Rahul was ruled out a few days ago from team India’s tour of England, they have now been handed another massive blow as skipper Rohit Sharma has yet again returned with… The post Will Rohit play 5th Test versus England: Is Rohit Sharma available for next match vs England at Edgbaston? appeared first on The SportsRush.","content":"Will Rohit play 5th Test versus England: Team India head coach Rahul Dravid provided an update on Rohit Sharma’s availability. After wicket-keeper batter KL Rahul was ruled out a few days ago from team India’s tour of England, they have now been handed another massive blow as skipper Rohit Sharma has yet again returned with a positive COVID-19 test result for the second time on Wednesday morning. For those unaware, team India’s present all-format skipper had also tested positive on ‘Day 2’ of the recently concluded warm-up match against Leicestershire, after scoring 25 (47) on the first day. With two back-to-back COVID-19 positive reports, the clouds have become dark as ever regarding his availability for the fifth and final rescheduled Test match of the Pataudi Trophy series against England, which is set to begin from July 1, at the Edgbaston Cricket Ground, in Birmingham. Will Rohit play 5th Test versus England Addressing the media via a virtual press conference on Wednesday evening, team India head coach Rahul Dravid provided the fans with an update on Rohit’s availability for the Test match starting the upcoming Friday. “So the update on Rohit is that he is being monitored by our medical team, he is not yet been ruled out. Obviously, he needs to get the negative test to be available. We will keep monitoring him, we have still got close to 36 hours to go so he will have a test later tonight and one maybe tomorrow morning as well. We will see, it is really up to the medical team and sports science team to decide on that. We will keep monitoring.” Rahul Dravid: Rohit Sharma is being monitored by our medical team. He is not yet ruled out. Obviously he needs to come with negative report. But we still have a couple of days.#ENGvIND — Subhayan Chakraborty (@CricSubhayan) June 29, 2022 As per the recommendations by the UK government, Rohit Sharma had been currently undergoing a five-day isolation since testing positive, with the fifth day ending today (Wednesday). As per EspnCricinfo, the skipper will undergo two further tests – one Wednesday evening and the other on Thursday, after which a final call on his availability for the Test starting Friday would be taken. Goes without saying, he would have to return with negative COVID-19 results on both these occasions. The post Will Rohit play 5th Test versus England: Is Rohit Sharma available for next match vs England at Edgbaston? appeared first on The SportsRush.","pubDate":"2022-06-29 16:26:48","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2022: जो रूट के पास सचिन और गावस्कर को पछाड़ने का मौका, अपने नाम कर लेंगे यह खास रिकार्ड","link":"https://www.abplive.com/sports/cricket/joe-root-can-overtake-indian-batsmen-sachin-tendulkar-and-sunil-gavaskar-in-terms-of-scoring-the-most-runs-in-a-bilateral-series-2157513","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p><strong>Joe Root Test Record:</strong> इंग्लैंड टीम के पूर्व कप्तान जो रुट (Joe Root) इस वक्त शानदार फॉर्म मे चल रहे हैं. उन्होंने न्यूजीलैंड (New Zealand) के खिलाफ हालिया सीरीज में खूब रन बनाए. दरअसल, ऐसा माना जा रहा है कि जो रूट (Joe Root) टेस्ट क्रिकेट में महान भारतीय बल्लेबाज सचिन तेंदुलकर (Sachin Tendulkar) का रिकार्ड तोड़ सकते हैं. वहीं, जो रूट (Joe Root) के पास मौका है कि द्विपक्षीय सीरीज में सबसे ज्यादा रन बनाने का रिकार्ड अपने नाम कर सकते हैं. फिलहाल, भारत-इंग्लैंड के बीच टेस्ट सीरीज में सबसे ज्याद रन बनाने वाले बल्लेबाजों की फेहरिस्त में सुनील गावस्कर (Sunil Gavaskar), सचिन तेंदुलकर (Sachin Tendulkar) और जो रूट (Joe Root) का नाम शामिल है.</p> <p><strong>सचिन और गावस्कर जैसे दिग्गजों को पछाड़ सकते हैं जो रूट</strong></p> <p>बहरहाल, इंग्लैंड के पूर्व कप्तान जो रूट (Joe Root) भारत के खिलाफ 43 पारियों में अब तक 2353 रन बना चुके हैं. पूर्व भारतीय बल्लेबाज सचिन तेंदुलकर (Sachin Tendulkar) का रिकार्ड तोड़ने के लिए जो रूट (Joe Root) को 184 रन और बनाने होंगे, जबकि 131 रन बनाने के बाद वह सुनील गावस्कर (Sunil Gavaskar) से आगे निकल जाएंगे. वहीं, 79 रन बनाने के बाद अपने हमवतन कुक को पीछे छोड़ देंगे. दरअसल, इस वक्त जो रूट जिस तरह से बल्लेबाजी कर रहे हैं, ऐसे में माना जा रहा है कि वह भारत के खिलाफ आखिरी मैच में यह रिकार्ड अपने नाम कर सकते हैं.</p> <p><strong>1 जुलाई से खेला जाएगा आखिरी टेस्ट</strong></p> <p>भारत और इंग्लैंड के बीच आखिरी टेस्ट 1 जुलाई से एजबेस्टन (Edgbaston) में खेला जाएगा. फिलहाल, भारतीय टीम (Indian Team) इस सीरीज में 2-1 से आगे है. अगर भारतीय टीम आखिरी मैच जीतने या फिर ड्रॉ (Draw) करवाने में सफल रहती है तो सीरीज अपने नाम कर लेगी. भारतीय टीम (Indian Team) आखिरी बार साल 2007 में इंग्लैंड (England) की सरजमीं पर टेस्ट सीरीज (Test Series) जीतने में कामयाब हुई थी.</p> <p><strong>ये भी पढ़ें-&nbsp;</strong></p> <p><strong><a href=\"https://www.abplive.com/sports/cricket/david-warner-can-become-australia-captain-in-odi-and-t20-pat-cummins-appealed-to-cricket-australia-2157339\">वनडे और टी20 में ऑस्ट्रेलिया के कप्तान बन सकते हैं David Warner, पैट कमिंस ने CA से की ये अपील</a><br /></strong></p> <p><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-ire-2nd-t20-deepak-hooda-become-fourth-indian-batsman-to-score-t20-hundred-for-india-2156807\">Deepak Hooda Record: टी20 में शतक जड़ हुड्डा ने बनाया रिकॉर्ड, ऐसा करने वाले चौथे भारतीय</a><br /></strong></p>","content":null,"pubDate":"2022-06-29 15:57:44","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-India to take late call on Rohit&#039;s inclusion after positive COVID test","link":"https://www.thestar.com.my/sport/cricket/2022/06/29/cricket-india-to-take-late-call-on-rohit039s-inclusion-after-positive-covid-test","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India's captain Rohit Sharma may miss their test match against England starting on Friday after he tested positive for COVID-19, but the team will take a late call on his inclusion after his next COVID test, head coach Rahul Dravid said on Wednesday. Read full story","content":null,"pubDate":"2022-06-29 15:57:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/29/1641313.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India vs England, 5th Test: India to take late call on Rohit Sharma's inclusion after positive Covid test - Times of India","link":"https://news.google.com/__i/rss/rd/articles/CBMiwwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9zcG9ydHMvY3JpY2tldC9pbmRpYS1pbi1lbmdsYW5kL2luZGlhLXZzLWVuZ2xhbmQtNXRoLXRlc3QtaW5kaWEtdG8tdGFrZS1sYXRlLWNhbGwtb24tcm9oaXQtc2hhcm1hcy1pbmNsdXNpb24tYWZ0ZXItcG9zaXRpdmUtY292aWQtdGVzdC9hcnRpY2xlc2hvdy85MjU1MzAzNi5jbXPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England, 5th Test: India to take late call on Rohit Sharma's inclusion after positive Covid test  Times of IndiaCovid-positive Rohit faces race against time to play Edgbston Test  ESPNcricinfoRohit Sharma Will Not Play The 5th Rescheduled Test vs England, Jasprit Bumrah To Captain Team India- Reports  Cricket AddictorRohit Sharma Ruled Out of Edgbaston Test Against England, Jasprit Bumrah To Lead: Report  NDTV SportsIndia vs England: Jasprit Bumrah to lead India, Rohit Sharma ruled out of fifth Test after testing Covid  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-06-29 15:55:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs IND: Rohit Sharma not ruled out of Birmingham Test yet, says Rahul Dravid - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2VuZy12cy1pbmQtcm9oaXQtc2hhcm1hLW5vdC1ydWxlZC1vdXQtb2YtYmlybWluZ2hhbS10ZXN0LXlldC1zYXlzLXJhaHVsLWRyYXZpZC0xOTY4MzEyLTIwMjItMDYtMjnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ENG vs IND: Rohit Sharma not ruled out of Birmingham Test yet, says Rahul Dravid  India TodayCovid-positive Rohit faces race against time to play Edgbston Test  ESPNcricinfoRohit Sharma Will Not Play The 5th Rescheduled Test vs England, Jasprit Bumrah To Captain Team India- Reports  Cricket AddictorRahul Dravid addresses India captaincy situation ahead of England Test  International Cricket CouncilIndia vs England, 5th Test: India to take late call on Rohit Sharma's inclusion after positive Covid test  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-06-29 15:52:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma \"Not Yet Ruled Out\" Of Edgbaston Test: Rahul Dravid Gives Big Update On India Captain - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9lbmdsYW5kLXZzLWluZGlhLTIwMjIvcm9oaXQtc2hhcm1hLW5vdC15ZXQtcnVsZWQtb3V0LW9mLWVkZ2Jhc3Rvbi10ZXN0LXJhaHVsLWRyYXZpZC1naXZlcy1iaWctdXBkYXRlLW9uLWluZGlhLWNhcHRhaW4tMzExMjY3MdIBmwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9lbmdsYW5kLXZzLWluZGlhLTIwMjIvcm9oaXQtc2hhcm1hLW5vdC15ZXQtcnVsZWQtb3V0LW9mLWVkZ2Jhc3Rvbi10ZXN0LXJhaHVsLWRyYXZpZC1naXZlcy1iaWctdXBkYXRlLW9uLWluZGlhLWNhcHRhaW4tMzExMjY3MS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Rohit Sharma \"Not Yet Ruled Out\" Of Edgbaston Test: Rahul Dravid Gives Big Update On India Captain  NDTV SportsCovid-positive Rohit faces race against time to play Edgbston Test  ESPNcricinfoRohit Sharma Will Not Play The 5th Rescheduled Test vs England, Jasprit Bumrah To Captain Team India- Reports  Cricket AddictorRohit Sharma Ruled Out of Edgbaston Test Against England, Jasprit Bumrah To Lead: Report  NDTV SportsIndia vs England: Jasprit Bumrah to lead India, Rohit Sharma ruled out of fifth Test after testing Covid  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-06-29 15:31:17","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Edgbaston pitch report test match IND vs ENG: Birmingham cricket stadium pitch report ENG vs IND Test 2022","link":"https://thesportsrush.com/cricket-news-edgbaston-pitch-report-test-match-ind-vs-eng-birmingham-cricket-stadium-pitch-report-eng-vs-ind-test-2022/","keywords":["Cricket","Birmingham","Edgbaston","England","India","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Edgbaston pitch report test match IND vs ENG: The rescheduled ‘fifth’ Test match between India and England will take place in Birmingham. Team India is in all readiness to play the rescheduled ‘fifth’ and final Test match of the Pataudi Trophy series against England which was forced to be postponed last year due to the… The post Edgbaston pitch report test match IND vs ENG: Birmingham cricket stadium pitch report ENG vs IND Test 2022 appeared first on The SportsRush.","content":"Edgbaston pitch report test match IND vs ENG: The rescheduled ‘fifth’ Test match between India and England will take place in Birmingham. Team India is in all readiness to play the rescheduled ‘fifth’ and final Test match of the Pataudi Trophy series against England which was forced to be postponed last year due to the COVID-19 scare in the Indian camp. With the series score line reading 2-1 in favour of India, a win or a Draw at the Edgbaston Stadium in Birmingham – the venue for the Test match starting July 1, would help them clinch the away Test series versus England for the first time since 2007. Having said that, team India skipper Rohit Sharma, who was tested positive on ‘Day 2’ of the recently concluded warm-up match against Leicestershire, is all but officially ruled out of the Test match, after his test result returned positive yet again on Wednesday morning. With KL Rahul also ruled out due to injury, the aforementioned development is a huge blow for the Indian team, with one of KS Bharat or Mayank Agarwal now, in all likeliness to open the innings alongside Shubman Gill. While Jasprit Bumrah is most likely set to lead the Indian team for the first time ever, a high on confidence England side under Ben Stokes, would certainly start as favourites having perhaps found their mojo back, after whitewashing present World Test champions New Zealand 3-0. That Edgbaston feeling #Edgbaston | #ENGvIND pic.twitter.com/gfexO5giSG — Edgbaston (@Edgbaston) June 29, 2022 Edgbaston pitch report test match IND vs ENG With the seamers likely to get decent enough purchase especially on the fresh ‘Day 1’ pitch, expect the captain winning the Toss to elect to bowl first while also keeping in view the prediction of overcast conditions in Birmingham during the Test match. With the average first innings score at this venue in Tests being 308, batting first here has been a challenge especially against England, with Stuart Broad and James Anderson having scalped as many as 85 wickets across mere 21 Tests at this venue. Having said that, teams batting last (4th innings) at Edgbaston have also won 20 Tests (as against 18 for teams batting first), which also proves that the pitch eases out for the batters as the match progresses. All in all, the Edgbaston track is likely to turn out bowling-friendly, with the team batting second likely to have a slight upper hand. The post Edgbaston pitch report test match IND vs ENG: Birmingham cricket stadium pitch report ENG vs IND Test 2022 appeared first on The SportsRush.","pubDate":"2022-06-29 15:30:53","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bumrah likely to lead India in Edgbaston Test as Rohit returns with another covid positive result","link":"https://www.thehansindia.com/sports/cricket/bumrah-likely-to-lead-india-in-edgbaston-test-as-rohit-returns-with-another-covid-positive-result-751085","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Rohit tested covid positive during the practice game against LeicestershireThe rescheduled fifth Test is scheduled to begin on July 1India lead the five-Test series 2-1","content":"Rohit tested covid positive during the practice game against Leicestershire Rohit Sharma , who is racing against time to be available for the Edgbaston Test, reportedly tested positive for covid-19 again on Wednesday. India captain Rohit will undergo two more tests: one today (June 29) evening and another on Thursday (June 30) - before the Indian team management takes a final decision on his availability for the Test, which is due to begin on Friday in Birmingham. The visitors currently lead the five-match Test series 2-1. Rohit, who tested covid positive on Day 2 of the warm-up match against Leicestershire, last week, has been serving the five-day isolation as recommended by the UK government. Wednesday (June 29) marked the fifth day of the isolation. When the BCCI announced India's Test squad for the England tour, they had named KL Rahul as Rohit's deputy. However, Rahul is currently ruled out due to a groin injury. While the BCCI has not officially announced who'll lead in Rohit's absence, fast bowler Jasprit Bumrah is the likely contender. Bumrah was India's vice-captain during India's previous Test series, against Sri Lanka at home. The Indian team management has already informed Bumrah that he'll be the stand-in captain for the rescheduled fifth Test if Rohit is not given a green signal to play, according to news reports. Welcome to Birmingham, India. 🇮🇳👋 #Edgbaston | #ENGvIND pic.twitter.com/KARMqJA8ET Notably, Bumrah has never led in any cricket, and this will be his maiden captaincy stint. He will also become the first fast bowler to captain India since Kapil Dev. Speaking at a press conference ahead of the Sri Lanka series, Bumrah had said he would never \"shy away\" if he was given the chance to lead Team India. \"If given an opportunity at any scenario, it would be an honour and I would never ever shy away from that, but it is something that I don't go looking for,\" Bumrah had said. Even though has no experience in the captaincy department, Bumrah had said he was confident with the leadership role as he had grown in his role as a strike bowler both for India and at Mumbai Indians in the Indian Premier League (IPL). \"Whatever role is asked of me, I would do it with the best ability. You are always a leader when you are a senior member of the team, so it's just a post that comes with you. Basically, you try to help all the people in whatever capacity you can. Even in Mumbai Indians, you have got a lot of senior players but now I am one of the senior players as well, so you help the captain, you help everyone, you play the leadership role even when you are not asked to. \"That's how I look at it. I never want to [be the captain] just for personal satisfaction. It's just a post, it's just a name, you have to do your job and you have to help people in the best way you can,\" added Bumrah.","pubDate":"2022-06-29 14:58:29","image_url":"https://assets.thehansindia.com/h-upload/2022/06/29/500x300_1300271-rohit-sharma.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Smith left fuming at Khawaja after horrible mix-up during 1st Test vs SL - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiogFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93YXRjaC1zdGV2ZS1zbWl0aC1sZWZ0LWZ1bWluZy1hdC11c21hbi1raGF3YWphLWFmdGVyLWhvcnJpYmxlLW1peC11cC1kdXJpbmctMXN0LXRlc3QtYWdhaW5zdC1zcmktbGFua2EtMTAxNjU2NTEyMjY5NjExLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Smith left fuming at Khawaja after horrible mix-up during 1st Test vs SL  Hindustan TimesSL vs AUS Dream11 Team Prediction: Sri Lanka vs Australia Check Captain, Vice-Captain, and Probable Playing  News18Sri Lanka hand debut to experienced spinner as Head passed fit for Galle Test  International Cricket Council1st Test: Australia 98/3 at Stumps on Day 1 vs Sri Lanka, trail by 114 runs  Hindustan TimesA spin test amidst the high tide | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-06-29 14:46:40","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG LIVE 5th TEST: Rohit Sharma to miss OUT, Jasprit Bumrah to lead INDIA: Follow LIVE UPDATES - InsideSport","link":"https://news.google.com/__i/rss/rd/articles/CBMitgFodHRwczovL3d3dy5pbnNpZGVzcG9ydC5pbi9pbmQtdnMtZW5nLWxpdmUtNXRoLXRlc3QtYmlnLXNldGJhY2stZm9yLWluZGlhLWFzLXJvaGl0LXNoYXJtYS10by1taXNzLTV0aC10ZXN0LWphc3ByaXQtYnVtcmFoLXRvLWxlYWQtaW4taGlzLWFic2VuY2UtZm9sbG93LWluZGlhLXZzLWVuZ2xhbmQtbGl2ZS11cGRhdGVzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ENG LIVE 5th TEST: Rohit Sharma to miss OUT, Jasprit Bumrah to lead INDIA: Follow LIVE UPDATES  InsideSportRohit Sharma Will Not Play The 5th Rescheduled Test vs England, Jasprit Bumrah To Captain Team India- Reports  Cricket AddictorRohit Sharma Ruled Out of Edgbaston Test Against England, Jasprit Bumrah To Lead: Report  NDTV SportsIndia vs England: Jasprit Bumrah to lead India, Rohit Sharma ruled out of fifth Test after testing Covid  Times of IndiaRohit Sharma's Daughter, Samaira, Provides Latest Update About Indian Skipper's Health Condition After  LatestLYView Full coverage on Google News","content":null,"pubDate":"2022-06-29 13:32:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"York City fans to meet squad at T20 match with Bishopthorpe","link":"https://www.yorkpress.co.uk/sport/20243935.york-city-fans-meet-squad-t20-match-bishopthorpe/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"YORK City supporters will have the opportunity to meet their new-look squad in next month's cricket match against Bishopthorpe CC.","content":null,"pubDate":"2022-06-29 13:29:30","image_url":"https://www.yorkpress.co.uk/resources/images/13810675/?type=app&htype=0","source_id":"yorkpress","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"India vs England: Jasprit Bumrah named captain after Rohit Sharma tests Covid positive for second time - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYS12cy1lbmdsYW5kLWphc3ByaXQtYnVtcmFoLW5hbWVkLWNhcHRhaW4tcm9oaXQtc2hhcm1hLWNvdmlkLTc5OTkyMDAv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England: Jasprit Bumrah named captain after Rohit Sharma tests Covid positive for second time  The Indian ExpressRohit Sharma Will Not Play The 5th Rescheduled Test vs England, Jasprit Bumrah To Captain Team India- Reports  Cricket AddictorRohit tests positive for Covid-19 once again  ESPNcricinfoIndia vs England: Jasprit Bumrah to lead India, Rohit Sharma ruled out of fifth Test after testing Covid  Times of IndiaRohit Sharma shares smiling selfie from hotel amid doubts over captaincy at Edgbaston Test  Republic WorldView Full coverage on Google News","content":null,"pubDate":"2022-06-29 12:44:45","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'Furious' Smith rips Khawaja after horror mix-up","link":"https://wwos.nine.com.au/cricket/sri-lanka-australia-first-test-2022-steve-smith-fumes-at-usman-khawaja-over-run-out-day-1/b5875e2f-9b4b-405e-aa0d-97a5fd1733e0","keywords":null,"creator":["wwos"],"video_url":null,"description":"Steve Smith was left fuming at Usman Khawaja after being run out by the Aussie opener at the end of day one.","content":"Steve Smith has been left fuming after a horrible mix-up with Usman Khawaja ended his stay early in a tightly-contested opening day of the first Test against Sri Lanka . Smith's run out for just six allowed the home side to edge their way back into the contest after Australia had been on top for the majority of day one. The tourists ended day one on 3-98 after 25 overs, 114 runs adrift of Sri Lanka's first innings total of 212 in what was an eventful day of Test cricket. READ MORE: Serena stunned by rookie in 'crazy' boilover READ MORE: Nick Kyrgios fumes at 'snitch' in drama-filled Wimbledon match READ MORE: Stalemate leaves Sharks with massive dilemma READ MORE: F1 drivers turn on three-time champ after racist slur against Hamilton Smith's ugly mix-up with Khawaja came in the 20th over of Australia's innings after a moment of confusion which saw the fielding side launch a vociferous appeal for lbw. The ball cannoned off Smith's front pad towards the covers, and with no fielder in the vicinity, he and Khawaja proceeded to take a run, only for Khawaja to reject the run with his batting partner stranded in the middle of the pitch. Sri Lankan wicketkeeper Niroshan Dickwella charged towards the ball and threw it back towards the batter's end, with Kusal Mendis breaking the stumps before a diving Smith could make it back in time. The former skipper was left livid immediately following the run out, shaking his head and gesturing at Khawaja, who refused to look at him from the non-striker's end. \"Steve Smith is absolutely furious,\" said HD Ackermann on commentary. \"It's almost as if Smith couldn't believe he had to go. He was almost looking at square leg as if the square leg umpire was going to say, 'Don't worry, you don't have to be out', but he had to make his way off the park.\" \"He just keeps telling Usman Khawaja, 'There was a single available, I called early, why didn't you?',\" Pakistan great Aamer Sohail added. \"Confusion all around, but no confusion as far as the Sri Lankan fielders were concerned. \"Initially Smith thought there was no run in that and then Usman Khawaja called for it. The damage could've been worse for the tourists, with Dickwella missing a stumping chance off Khawaja a few overs later. The opener finished the day unbeaten on 47 off 86 deliveries, continuing the fine form he showed against Pakistan in Australia's last tour of the subcontinent. He will be joined by Travis Head (six off 11) when Australia takes the field on day two. After being forced to field first, Australia's spin tandem of Nathan Lyon (5-90) and Mitchell Swepson (3-55) helped keep the home side to a below-par score. Sri Lanka began brightly with the openers putting on 38 for the first wicket, but fell to 5-97 after Swepson removed Dhananjaya De Silva and Dinesh Chandimal in consecutive deliveries after lunch. A brilliant counter-attacking half-century from Dickwella (58 off 59) allowed Sri Lanka to cross the 200-run mark. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-06-29 12:44:20","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/06/439085/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Nathan Lyon shines with five wickets on day one of first Test against Sri Lanka in Galle - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiYWh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA2LTI5L25hdGhhbi1seW9uLWZpcnN0LXRlc3Qtc3JpLWxhbmthLWRheS1vbmUtd2lja2V0cy8xMDExOTUzMTDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Nathan Lyon shines with five wickets on day one of first Test against Sri Lanka in Galle  ABC NewsLate scalps curb Australia's ascendency after Lyon's five  cricket.com.auEXCLUSIVE: Nathan Lyon could finish with 600 Test wickets, says Steve O'Keefe, as the off-spinner returns to site of Test debut  Wide World of SportsLyon finds beauty in bowling ugly  7NEWSGalle forte: Lyon's legacy grows despite back spasm  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-06-29 12:41:07","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rohit ruled out of fifth Test after testing Covid positive again, Bumrah to lead India","link":"https://www.tribuneindia.com/news/sports/rohit-ruled-out-of-fifth-test-after-testing-covid-positive-again-bumrah-to-lead-india-408031","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, June 29Jasprit Bumrah is set to become first fast bowler in 35 years to lead Indian Test team in the rescheduled 'fifth Test' against England as regular captain Rohit Sharma has been ruled out of the game after testing positive for Covid-19 for the second time on Wednesday.The last pacer-captain that India had was the great Kapil Dev, who was removed from captaincy in 1987. Since then India has never had a speed merchant leading the team in traditional cricket.\"Rohit is out of this Test match, starting July 1, as his RT-PCR test has come positive again. He is still in isolation. Jasprit Bumrah, who is one of the vice-captains in absence of KL Rahul, will lead the team,\" a senior BCCI official told PTI on conditions of anonymity.Bumrah will be the 36th cricketer to lead India in the longest-format since the country first played in 1932. The Gujarat pacer, who has 123 wickets in 29 Tests, has grown into world's best fast bowlers.The Chairman of selectors Chetan Sharma had already said that he is being groomed as a future leader.Fast bowlers have not been traditionally given the job in India unlike in Pakistan where their greatest skipper was Imran Khan. Legends like Wasim Akram and Waqar Younis also led national side.In West Indies, Courtney Walsh led the side for a considerable amount of time and world number one Pat Cummins now leading Australia in longest format.With the experienced Rohit out of the playing eleven, seasoned Cheteshwar Pujara has a good chance of opening the batting with young Shubman Gill.The soure said that Mayank Agarwal has just been brought as \"cover\" and is not in the scheme of things as far featuring in the playing eleven is concerned.\"Mayank is here just as cover. It is likely to be Pujara-Gill combination that is going to open the batting. There is an outside chance for Hanuma Vihari to open as he has done the job in a stop-gap arrangement in Australia during the 2018 series. But chances of Pujara opening are way more,\" he said.It is understood that the specialist batters in the set-up will be Pujara, Gill, Virat Kohli, Shreyas Iyer, Vihari and Rishabh Pant.The only other debatable matter is whether to play a fourth fast bowling all-rounder in Shardul Thakur or a second spinner in Ravichandran Ashwin alongside Ravindra Jadeja.Along with Bumrah, Mohammed Siraj and Mohammed Shami select themselves automatically.With the first Test scheduled to finish on July 5 and the first T20I scheduled for July 7 in Southampton, the selection committee has decided that the star players will be given a three-day recovery period before they are picked from the second game.India are scheduled to clash with England three T20Is and as many ODIs.\"The squad that played T20I series in Ireland will remain in the first T20I and then from second T20I, all the stars (Rohit, if fit, Kohli, Bumrah, Pant, Jadeja) will make a comeback,\" the source added.\"Once, they are well rested, all of them will be a part of the regular white ball side but most of the players in Ireland will remain till the end of T20I series.\"","content":"PTI New Delhi, June 29 Jasprit Bumrah is set to become first fast bowler in 35 years to lead Indian Test team in the rescheduled ‘fifth Test’ against England as regular captain Rohit Sharma has been ruled out of the game after testing positive for Covid-19 for the second time on Wednesday. The last pacer-captain that India had was the great Kapil Dev, who was removed from captaincy in 1987. Since then India has never had a speed merchant leading the team in traditional cricket. “Rohit is out of this Test match, starting July 1, as his RT-PCR test has come positive again. He is still in isolation. Jasprit Bumrah, who is one of the vice-captains in absence of KL Rahul, will lead the team,” a senior BCCI official told PTI on conditions of anonymity. Bumrah will be the 36th cricketer to lead India in the longest-format since the country first played in 1932. The Gujarat pacer, who has 123 wickets in 29 Tests, has grown into world’s best fast bowlers. The Chairman of selectors Chetan Sharma had already said that he is being groomed as a future leader. Fast bowlers have not been traditionally given the job in India unlike in Pakistan where their greatest skipper was Imran Khan. Legends like Wasim Akram and Waqar Younis also led national side. In West Indies, Courtney Walsh led the side for a considerable amount of time and world number one Pat Cummins now leading Australia in longest format. With the experienced Rohit out of the playing eleven, seasoned Cheteshwar Pujara has a good chance of opening the batting with young Shubman Gill. The soure said that Mayank Agarwal has just been brought as “cover” and is not in the scheme of things as far featuring in the playing eleven is concerned. “Mayank is here just as cover. It is likely to be Pujara-Gill combination that is going to open the batting. There is an outside chance for Hanuma Vihari to open as he has done the job in a stop-gap arrangement in Australia during the 2018 series. But chances of Pujara opening are way more,” he said. It is understood that the specialist batters in the set-up will be Pujara, Gill, Virat Kohli, Shreyas Iyer, Vihari and Rishabh Pant. The only other debatable matter is whether to play a fourth fast bowling all-rounder in Shardul Thakur or a second spinner in Ravichandran Ashwin alongside Ravindra Jadeja. Along with Bumrah, Mohammed Siraj and Mohammed Shami select themselves automatically. With the first Test scheduled to finish on July 5 and the first T20I scheduled for July 7 in Southampton, the selection committee has decided that the star players will be given a three-day recovery period before they are picked from the second game. India are scheduled to clash with England three T20Is and as many ODIs. “The squad that played T20I series in Ireland will remain in the first T20I and then from second T20I, all the stars (Rohit, if fit, Kohli, Bumrah, Pant, Jadeja) will make a comeback,” the source added. “Once, they are well rested, all of them will be a part of the regular white ball side but most of the players in Ireland will remain till the end of T20I series.” #jasprit bumrah #rohit sharma","pubDate":"2022-06-29 12:36:13","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_176886550.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Australia cede early advantage as spin makes mark in first Test in Sri Lanka","link":"https://www.theguardian.com/sport/2022/jun/29/sri-lanka-australia-first-test-day-one-match-report","keywords":["Australia cricket team","Sri Lanka cricket team","Cricket","Australia sport","Sport"],"creator":["Australian Associated Press"],"video_url":null,"description":"Sri Lanka 212; Australia 98-3 (25 overs) | Australia trail by 114 runsNathan Lyon takes five wickets before tourists wobble with batA late Steve Smith run out highlighted Australia’s jitters in Sri Lanka after Nathan Lyon joined elite company with his 20th five-wicket haul in Test cricket. Lyon claimed figures of 5-90 to help bowl Sri Lanka out for 212 just after tea on the opening day of the two-Test series, before the tourists went to stumps at 98-3 in Galle.On the same day Sri Lanka paid tribute to Shane Warner, legspinner Mitchell Swepson also vindicated his selection with a fine 3-55 as he at one stage took two wickets in successive balls. Continue reading...","content":"A late Steve Smith run out highlighted Australia’s jitters in Sri Lanka after Nathan Lyon joined elite company with his 20th five-wicket haul in Test cricket. Lyon claimed figures of 5-90 to help bowl Sri Lanka out for 212 just after tea on the opening day of the two-Test series, before the tourists went to stumps at 98-3 in Galle. On the same day Sri Lanka paid tribute to Shane Warner, legspinner Mitchell Swepson also vindicated his selection with a fine 3-55 as he at one stage took two wickets in successive balls. ‘I just would have felt like an impostor’: Morgan confirms England retirement Read more At that point all was going well for Australia, as David Warner exploded out of the blocks in reply to have them 47-0. But as is so often the case on the sub-continent, a sting in the tail was still to come. In a chaotic final hour, Warner was trapped lbw for 25 by Ramesh Mendis, Marnus Labuschagne reverse-swept the spinner straight to gully and Smith was run out. Hit on the pads on six, Smith took off after Usman Khawaja appeared to call him through and then hesitated. Smith turned and dived but was well short of his ground, making clear his fury and disbelief clear to Khawaja as he got up and stormed off the ground. Australia’s situation at stumps could have also been far worse had Niroshan Dickwella not missed a chance to stump Khawaja on 36, before he finished the day unbeaten on 47. But still Wednesday belonged to Lyon, who joined Clarrie Grimmett, Dennis Lillee, Glenn McGrath and Warne as the only Australians to claim 20 five-wicket hauls. Derided for his inability to take command with his spin in the 2016 series against Sri Lanka, Lyon failed to take a five-wicket haul in the 3-0 flogging then. He has since spoken about the lessons taken from that, including realising he needed to learn to bowl ugly on the sub-continent with more variations in his release point. Ultimately that disappointment has proven crucial, going from averaging 42.57 in the first five years of his career in Asia to 25.84 since. He claimed the key wicket of Dimuth Karunaratne for 28 just after lunch on Wednesday, drawing his inside edge before David Warner leapt forward to take a one-handed catch at slip. Angelo Mathews became Lyon’s next victim when he glided him straight to Warner at leg slip, before the offspinner ended a rearguard action from Dickwella (58) to run through the tail. Swepson would have also walked away happy with his return, after appearing to be at risk of losing his spot following a difficult debut tour of Pakistan. After taking just two wickets for 266 runs there, Swepson’s first two scalps on Wednesday came with balls Warne would have been proud of. Both drifted, dipped and turned to catch the edges of Dhananjaya de Silva and veteran Dinesh Chandimal.","pubDate":"2022-06-29 12:32:41","image_url":"https://i.guim.co.uk/img/media/6b4eb5094633d2ec73566291b98e46a6994bd142/0_0_3000_1800/master/3000.jpg?width=460&quality=85&auto=format&fit=max&s=8d651ebd0fc618a4f9c927c9855b7de1","source_id":"theguardian","country":["australia"],"category":["sports"],"language":"english"}]}