{"newsArray":[{"title":"Revealed: SA Premier Cricket’s fast-starting recruits","link":"https://www.cairnspost.com.au/sport/cricket/saca-premier-crickets-faststarting-recruits-revealed-including-cam-valente-ben-charlesworth-bhavisha-devchand/news-story/d2ea6de80c494ebda24ce3837fa5e5e6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"SACA Premier Cricket season 2022/2023 is in full swing as the men’s and women’s first grade competitions complete another week of play.","content":null,"pubDate":"2022-11-02 23:30:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"LeBron James Hilariously Finds the Best Way to Call Father Time ‘Old’ Alongside Bronny James","link":"https://thesportsrush.com/nba-news-lebron-james-hilariously-finds-the-best-way-to-call-father-time-old-alongside-bronny-james/","keywords":["Basketball","Father Time","Lebron James","Nike"],"creator":["Nithin Joseph"],"video_url":null,"description":"LeBron James is currently in the middle of an ongoing battle with Father Time. Well, in the latest Nike advert he got a tiny victory. As he enters his 20th season, many are questioning whether or not LeBron James is getting up there in age. After all, The King is now playing at a high… The post LeBron James Hilariously Finds the Best Way to Call Father Time ‘Old’ Alongside Bronny James appeared first on The SportsRush.","content":"As he enters his 20th season, many are questioning whether or not LeBron James is getting up there in age. After all, The King is now playing at a high level at the age of 37. With many doubting his ability to keep up at his age, Nike decided to capitalize on this opportunity. The company has released several video advertisements showcasing James facing off against Father Time. Time, played by Jason Mamoa won round one against LeBron. However, James got one over him in the most recent advert. Also Read: King James is currently locked in a war against Father Time. Unfortunately, he lost the first battle against him. Well, LeBron seems to have taken a small victory in the build-up to the second one. Although not exactly a physical contest, James trolled Time by handing him a pair of Nike Monarchs instead of the new LeBron 20s. In the video promoting James’ latest shoe, The King hands his son Bronny a pair of the 20s. An act that prompts Jason Mamoa’s rendition of Father Time to suddenly appear and ask for a pair. Unfortunately for him, LeBron took this chance to get revenge for his previous loss. Hopefully, his joke doesn’t come back to bite him. The first Nike advert featuring LeBron’s battle against Father Time saw the two face off in a rope battle. One that James was unable to win. The second battle is almost upon us. Fans will have to wait and see if LeBron can tie the series in the next one. Also Read:","pubDate":"2022-11-02 23:00:02","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"TRI vs GUY Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Super50 Cup 2022, Match 7","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/tri-vs-guy-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-super50-cup-2022-match-7?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-11-02 20:54:01","image_url":"https://static.sportskeeda.com/editor/2022/11/1b0fd-16674105280745-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli total runs in all formats: Kohli total international runs across formats","link":"https://thesportsrush.com/cricket-news-virat-kohli-total-runs-in-all-formats-kohli-total-international-runs-across-formats/","keywords":["Cricket","ICC T20 World Cup 2022","India","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"With his third half-century, and by bagging his second ‘Player of the Series’ award in the ongoing T20 World Cup, former team India skipper Virat Kohli is roaring back to his greatness the entire Cricketing fraternity is well-versed with. After nearly single-handedly taking his team across the line while playing unarguably the best T20I knock… The post Virat Kohli total runs in all formats: Kohli total international runs across formats appeared first on The SportsRush.","content":"With his third half-century, and by bagging his second ‘Player of the Series’ award in the ongoing T20 World Cup, former team India skipper is roaring back to his greatness the entire Cricketing fraternity is well-versed with. After nearly single-handedly taking his team across the line while playing unarguably the best T20I knock of his career against Pakistan, Kohli yet again batted through the entire innings versus Bangladesh on Wednesday, after Rohit Sharma yet again gave his wicket away in the Powerplay. His 64* (44) laid the foundation for the team’s ultimate total to 184/6, with KL Rahul (50 off 32) and Suryakumar Yadav (30 off 16) too, playing crucial knocks alongside him. At present, he is the , having already amassed 220 runs across 4 innings, at an unbelievable average and strike rate of 220.0 and 144.73 respectively. Despite having scored an international century after almost a three-year gap in September this year, Virat Kohli still averages 49.53, 57.68, and 53.13 in the Test, ODI, and T20Is respectively. Virat Kohli presently ranks sixth in the list of all-time leading run-scorers across all the three formats in international Cricket. Across 477 matches (531 innings), the 33-year-old has amassed a total of 24,350 runs, at a career average and strike rate of 53.99 and 79.48 respectively. He has smashed 128 half-centuries and 71 centuries in international Cricket all this while. It is worth of a mention that his career average of 53.99 so far, is greater than all the legends of the game placed above him in the list, with the next-best being that of the legendary South African allrounder Jacques Kallis with 49.10. Placed above Kohli, in the list of all-time highest run-scorers across formats are Sachin Tendulkar, Kumar Sangakkara, Ricky Ponting, Mahela Jayawardene, and Jacques Kallis.","pubDate":"2022-11-02 19:32:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“She KO’s Conor McGregor”: UFC Fans Left Stunned as Knockout Video of Alex Pereira’s Sister Goes Viral Ahead of Her MMA Debut","link":"https://thesportsrush.com/ufc-mma-news-she-kos-conor-mcgregor-ufc-fans-left-stunned-as-knockout-video-of-alex-pereiras-sister-goes-viral-ahead-of-her-mma-debut/","keywords":["UFC","Alex Pereira","Aline Pereira","Israel Adesanya"],"creator":["Afnan Chougle"],"video_url":null,"description":"It is pretty rare to see siblings following the same career path. However, it seems like a normal thing in the Pereira family. With his dominance in the division, the surging Brazilian middleweight UFC contender Alex Pereira had already made a lot of noise in the MMA industry. ‘Poatan’, after dominating kickboxing in the Glory… The post “She KO’s Conor McGregor”: UFC Fans Left Stunned as Knockout Video of Alex Pereira’s Sister Goes Viral Ahead of Her MMA Debut appeared first on The SportsRush.","content":"It is pretty rare to see siblings following the same career path. However, it seems like a normal thing in the Pereira family. With his dominance in the division, the surging Brazilian middleweight UFC contender Alex Pereira had already made a lot of noise in the MMA industry. ‘Poatan’, after dominating kickboxing in the Glory Kickboxing promotion, entered MMA in 2015. He made his UFC debut in 2021 and has remained undefeated 3-0 in the promotion. Two of his wins have come via finish. He already earned a name for being one of the best strikers in the division. Now, his sister Aline Pereira is following in his footsteps. Alex Pereira’s sister Aline Pereira The UFC star’s sister, Aline Pereira, is preparing for her MMA debut. Aline holds a 6-2 professional kickboxing record under her name. Now, she will dip her hands in MMA and make her debut on 10th November at LFA 147. ALSO READ: “Holy Sh*t”: Joe Rogan Was Once Astounded by Cricket Great Virat Kohli’s Fame Compared to LeBron James, Conor McGregor, and Khabib Nurmagomedov Ahead of her professional MMA debut, an old knockout victory video of Alex Pereira’s sister is making rounds on the internet. Aline looks sharp in the clip and lands some vicious shots at her opponents.   alex pereira’s sister is literally the female version of him.pic.twitter.com/YymlJJ9vMY — Dovy (@DovySimuMMA) November 2, 2022 The fight took place at Glory 71 back in 2019. Aline Pereira defeated her opponent Crystal Lawson in less than one minute of the bout. This video left the fight fans stunned as they saw a glimpse of her brother Alex in her fighting style. UFC 281: Alex Pereira vs. Israel Adesanya- An old business to settle As aforementioned, Pereira has already made a name in the MMA community and it was mostly because of his previous two victories over the UFC middleweight champion Israel Adesanya during their Glory Kickboxing days. One of his victories against ‘The Last Stylebender’ came via a brutal finish. Now, the old rivals will collide for the third time, and this time inside the UFC cage. This middleweight title fight is set to headline UFC 281 on 12th November. ALSO READ: When Featherweight Alexander Volkanovski Outwrestled Middleweight Israel Adesanya! Are you guys excited about Pereira vs. Adesanya? What do you guys think about Alex Pereira’s sister?         The post “She KO’s Conor McGregor”: UFC Fans Left Stunned as Knockout Video of Alex Pereira’s Sister Goes Viral Ahead of Her MMA Debut appeared first on The SportsRush.","pubDate":"2022-11-02 18:30:54","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan T20 records at Sydney Cricket Ground: SCG Pakistan T20 matches all result list 2022","link":"https://thesportsrush.com/cricket-news-pakistan-t20-records-at-sydney-cricket-ground-scg-pakistan-t20-matches-all-result-list-2022/","keywords":["Cricket","ICC T20 World Cup 2022","Pakistan","SCG","Sydney Cricket Ground"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Pakistan will face South Africa in what will be a stern challenge for the Asian side, during the 36th match of the ongoing ICC T20 World Cup 2022, at the Sydney Cricket Ground on Thursday (tomorrow). After losing against India in a cliffhanger of a contest in Melbourne, Pakistan became victims of a huge upset… The post Pakistan T20 records at Sydney Cricket Ground: SCG Pakistan T20 matches all result list 2022 appeared first on The SportsRush.","content":"Pakistan will face South Africa in what will be a stern challenge for the Asian side, during the 36th match of the ongoing ICC T20 World Cup 2022, at the Sydney Cricket Ground on Thursday (tomorrow). After losing against India in a cliffhanger of a contest in Melbourne, Pakistan became victims of a huge upset after bowing down before Zimbabwe in their very next match as well, to now stare at the exit door of the tournament. With fate no longer in their hands, and to preserve that remaining flicker of hope to stay in contention for the semi-final berth, they will now face the only undefeated team in this World Cup next, in what is, needless to say, another do-or-die contest for them. ALSO READ: Sydney Cricket Ground pitch report for Pakistan vs South Africa Super 12 match Despite the sample size being relatively small, Pakistan registered only their first T20I victory on Australian soil last Sunday, when they defeated the Netherlands by 6 wickets at the Perth Stadium. In the points table, they are currently placed at the fifth spot, with 2 points after three matches, and a Net Run Rate (NRR) of +0.765. Pakistan T20 records at Sydney Cricket Ground The lone T20I that Pakistan had played at this venue against Australia in November 2019, had been washed off due to rain. With the rain having already reduced the aforementioned match to a 15-Overs-a-side encounter, on the back of skipper Babar Azam’s knock of 59* (38), Pakistan had posted the total of 107/5. In reply, Australia had raced off to the score of 41/0 in mere 3.1 Overs, but with rain intervening again, the match was called-off. In the ODI format at this venue, however, Pakistan have managed to win mere 6 of 21 ODIs, with their last victory coming in the year 1997 against the West Indies. Across the Tests at the SCG, Pakistan have won 2 of the 8 matches from 1973-2017. While 5 of them have ended as losses, one encounter ended in a Draw. The post Pakistan T20 records at Sydney Cricket Ground: SCG Pakistan T20 matches all result list 2022 appeared first on The SportsRush.","pubDate":"2022-11-02 18:21:25","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Watch: Litton Das Fumes As KL Rahul's Direct Hit From Deep Finds Him Short Of His Crease - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvd2F0Y2gtbGl0dG9uLWRhcy1mdW1lcy1hcy1rbC1yYWh1bHMtZGlyZWN0LWhpdC1mcm9tLWRlZXAtZmluZHMtaGltLXNob3J0LW9mLWhpcy1jcmVhc2UtMzQ4MzYyNdIBjwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvd2F0Y2gtbGl0dG9uLWRhcy1mdW1lcy1hcy1rbC1yYWh1bHMtZGlyZWN0LWhpdC1mcm9tLWRlZXAtZmluZHMtaGltLXNob3J0LW9mLWhpcy1jcmVhc2UtMzQ4MzYyNS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Litton Das Fumes As KL Rahul's Direct Hit From Deep Finds Him Short Of His Crease  NDTV SportsLive match blog - India vs Bangladesh 35th Match, Group 2 2022/23 - Cricket Insights  ESPNcricinfo#India emerges victorious against #Bangladesh in their Super 12 clash  DD INDIAIND vs BAN, T20 World Cup 2022, Highlights: India Prevails Over Bangladesh By 5 Runs In Rain-Curtailed Match  NDTV SportsWe've prepared Arshdeep Singh for death overs: Rohit Sharma  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-11-02 18:08:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"St George win by forfeit after Two Blues confusion","link":"https://thewest.com.au/news/kalgoorlie-miner/st-george-win-by-forfeit-after-two-blues-confusion-c-8735243","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"St George earn points against Great Boulder in a Kalgoorlie-Boulder Cricket Association round affected by rain.","content":"Rain played havoc with Saturday’s round-four Kalgoorlie-Boulder Cricket Association fixtures that included St George’s win officially going into the books as a forfeit by Great Boulder. Chasing 70 for victory, St George compiled 6-66 in 10.1 overs before rain forced play to be suspended. Association president Craig McCrystal said only a short delay applied before play was ready to resume. Great Boulder, however, had insufficient players in a clear misunderstanding of the match status. “Great Boulder to their credit stayed out on the ground for longer than expected with light rain falling in an effort to get a result,’ McCrystal said. “When the heavy rain hit, play was suspended with St George needing just four runs to win. “Great Boulder were of the opinion that the game had been abandoned. “However, this wasn’t the case — when the rain stopped, it took very little time for the pitch to become fit for play again. “Unfortunately, most of the Great Boulder players had left and they didn’t have a team to put on the ground to complete the game — thus having to forfeit.” St George’s innings was anchored by Jackson Cooper (28) and Blake Gambale (18), while Great Boulder’s Jaxon Atthowe claimed 3-16. Earlier, Great Boulder’s 69 off 27 overs was underpinned by No.10 batter Kalahni Vlasich’s 24 after the side earlier slumped to 9-31. Brendan Ryan took 4-17. Also last weekend, Brendan Brinkworth blasted 56, with nine fours, in Goldrush’s rain-affected draw with Golden City. Josh Chapman (41) also played well in the team’s 119 in 27.2 overs as Anu Rathnayake grabbed 4-9. Golden City were 0-46 from 4.3 overs when the rain hit. Rathnayake (20) and Rob Mills (19) were the not out batters. The scheduled night game between Veterans and Sunrisers did not get under way and was declared a draw. Sign up for our emails","pubDate":"2022-11-02 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8735243/6bb7b8dbf6803f14b0654a14e2e0fff1c69a9160-16x9-x0y214w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Albany and Districts Cricket Association eager to go back-to-back in Belt-Up Country Cup","link":"https://thewest.com.au/news/albany-advertiser/albany-and-districts-cricket-association-eager-to-go-back-to-back-in-belt-up-country-cup-c-8732601","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"The competition will run across three rounds and will be played between Albany and Districts Cricket Association, Peel Cricket Association, Bunbury and Districts Cricket Association and the Invitational XI.","content":"Albany and Districts Cricket Association all-rounder Ryan Kinnear says he is confident his side can go back-to-back in the Belt-Up Country Cup as they prepare for round one action this Sunday in Narrogin. The competition will run across three rounds and will be played between ADCA, Peel Cricket Association, Bunbury and Districts Cricket Association and the WA Invitational XI. The ADCA will send an 11-man squad for their campaign opener against the WA Invitational XI on Sunday at 11am at Clayton Road Oval — a rematch of February’s grand final. They will be looking to lift their second Country Cup in as many years and will have strong representation again through Mt Barker Bulls trio Nathan Crudeli, Alexander Fergie and captain Jeremy Wood. Royals’ stars Lincoln Joy and Ted Batchelor are set to feature while Collingwood Park’s Scottish recruit Oliver Davidson will make his debut for the ADCA side. Seb Stanton and Kieran Howie are the only two players from Manypeaks and Coen Marwick is the sole player from Railways. “I think we’ve got a good mix there with youth and experience,” Kinnear said. “The invitational side will be strong so we’ll have to play really well to get over the top of them. “It looks like they’ve got some really strong players which they’ve called upon. “Guys like Nathan (Crudeli) and Jez (Jeremy Wood) are experienced campaigners that do it week-in and week-out so I’m sure we will rely on them heavily. “I fancy our chances to get the win.” In the other round one fixture, Bunbury will clash with Peel at Hay Park in Bunbury. Round two will take place in December and round three is set down for January. The final is scheduled to be played on February 26 at Cresswell Park in Perth. WA Invitational XI coach Tim Edmunds said he was excited to see some of the best players across the State do battle. “It’s really pleasing that we firstly have a national country championships happening after two years of it being paused for COVID,” he said. “That has a really positive flow-on effect to this competition because all the best players are always going to be playing in this competition. “They have been in the previous two seasons but now there’s plenty more on the line because not only is it a good strong competition but the best players are putting their best foot forward also to do really well for their association and be selected for the State side.” ADCA Country Cup Squad Jeremy Wood (c) (Mt Barker) Nathan Crudeli (Mt Barker) Lincoln Joy (Royals) Ted Batchelor (Royals) Ollie Davidson (Collingwood Park) Kieran Howie (Manypeaks) Coen Marwick (Railways) Seb Stanton (Manypeaks) Josh Dallimore (Collingwood Park) Alex Fergie (Mt Barker) Ryan Kinnear WA Invitational XI Ben Payne (c) (Busselton Margaret River CA) Calum How (wk) (Newman CA) Michael Noble (Eastern Goldfields CA) Kalan Joyce (Upper Great Southern CA) Clayton Bruce-Cherry (Geraldton CA) Joe Dowling (Upper Great Southern CA) Brady Collins (Geraldton CA) Fraser Oates (Busselton Margaret River CA) Haig Colombera (Busselton Margaret River CA) Bailey Parsons (Upper Great Southern CA) Jack Buswell (Bunbury & Districts CA / University CC) Tom Forsyth (Geraldton CA) Sign up for our emails","pubDate":"2022-11-02 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8732601/5096b3b50c2d62a4145aa069dc777ade840abd3f-16x9-x0y270w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Great Boulder players the early leaders with bat and ball after unbeaten start to EGCA season","link":"https://thewest.com.au/news/kalgoorlie-miner/great-boulder-players-the-early-leaders-with-bat-and-ball-after-unbeaten-start-to-egca-season-c-8733004","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Bennell, Khankaonker leading the way in Eastern Goldfields Cricket Association 2022-23 A-grade competition.","content":"Great Boulder’s unbeaten start to the Eastern Goldfields Cricket Association’s 2022-23 A-grade campaign is reflected by the top positions in both batting and bowling after three rounds. Among EGCA batters, Two Blues skipper Bevan Bennell has compiled scores of 81 and 102 for a competition-best 91.50 average. He was not required with the bat last weekend when Great Boulder chased down Hannans’ 64 with nine wickets in hand. North Kalgoorlie’s Michael Noble is coming off an unbeaten 111 in a losing effort last weekend against Lake View to be averaging 74.50 from three innings, ahead of Great Boulder’s Josh Rushmore (65.00). Hannans’ Josh Gorman averages 62.50, with the top-six rounded out by Lake View pair Ayush Verma (54.00) and player-coach Dave Roberts (38.00). A former Perth first-grade batter, Roberts welcomed a return to form last weekend with a hard-hitting 58 off 58 balls in 68 minutes. Roberts averaged 10.67 in six matches last summer after joining Lake View. “It was nice to get a few (runs) out there in the middle,” Roberts said. “I’m not going to lie, it’s been a long time coming for me out here (in the Goldfields). “Hopefully it’s the start of something I can build on now, but it was a pretty good batting wicket (and) you cant really ask for much more. “The only thing was that maybe it was a little bit slow, but it’s all about getting in and giving yourself a bit of time.” Great Boulder recruit Vaibhav Khangaonker leads all EGCA bowlers with seven wickets at 6.43 from Hannans pair Luke Boxhall (seven wickets at 17.57) and Lindsay Pankkhurst (six wickets at 10.50). The top-six is rounded out by Noble (six wickets at 25.00), Great Boulder’s Aaron Charlesworth (five wickets at 11.40) and Norths’ Jake Dickinson (five wickets at 14.80). The downside to Khangaonker’s start is that he is unlikely to play between now and Christmas because of study commitments. Round four will be played on Saturday when Lake View take on Great Boulder at Wallace Park and Hannans battle Norths at Ray Finlayson Sporting Complex. Round nine on December 10 is the last before the Christmas break. However, regular turf fixtures are complemented by the annual Twenty 20 series, starting on Friday night when Hannans clash with Norths at Ray Finlayson Sporting Complex. Start time is 6pm. Qualifying matches for the series will also be played on November 11, November 25, December 2 and December 17, with the final on January 28. Ladder: Great Boulder 18 points; Hannans 6; North Kalgoorlie 6; Lake View 6. Sign up for our emails","pubDate":"2022-11-02 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8733004/398a72ffd5ce5a28869c7b9e3f7f83038d4e5b88-16x9-x0y107w2048h1152.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"PAK vs SA T20 World Cup: Sydney Cricket Ground pitch and weather report for Pakistan vs South Africa","link":"https://www.dnaindia.com/cricket/report-pak-vs-sa-t20-world-cup-sydney-cricket-ground-pitch-and-weather-report-for-pakistan-vs-south-africa-hotstar-2998652","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"PAK vs SA: Sydney Cricket Ground pitch and weather report for Pakistan vs South Africa T20 World Cup 2022 match 36 of Super 12 stage.","content":null,"pubDate":"2022-11-02 17:50:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli's no ball gesture to umpire vs BAN: Pakistan legends have split opinions on incident - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvdmlyYXQta29obGlzLW5vLWJhbGwtZ2VzdHVyZS10by11bXBpcmUtdnMtYmFuLXBha2lzdGFuLWxlZ2VuZHMtaGF2ZS1zcGxpdC1vcGluaW9ucy1vbi1pbmNpZGVudC04MjQ1ODk1L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli's no ball gesture to umpire vs BAN: Pakistan legends have split opinions on incident  The Indian ExpressLive match blog - India vs Bangladesh 35th Match, Group 2 2022/23 - Cricket Insights  ESPNcricinfoIndia Vs Bangladesh Live Match Score | India Bangladesh T20 World Cup 2022 LIVE | Cricket Live  CNN-News18IND vs BAN, T20 World Cup 2022, Highlights: India Prevails Over Bangladesh By 5 Runs In Rain-Curtailed Match  NDTV Sports#India emerges victorious against #Bangladesh in their Super 12 clash  DD INDIAView Full coverage on Google News","content":null,"pubDate":"2022-11-02 17:39:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs SA Dream11 prediction: Fantasy cricket tips for Pakistan vs South Africa Super 12 Match 36, T20 World Cup 2022","link":"https://www.dnaindia.com/cricket/report-pak-vs-sa-dream11-prediction-fantasy-cricket-tips-for-pakistan-vs-south-africa-t20-world-cup-2022-hotstar-2998640","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"PAK vs SA Dream 11 Team - Check My Dream11 Team, Best Player's list for Pakistan vs South Africa, Super 12, match 36 of T20 World Cup 2022.","content":null,"pubDate":"2022-11-02 17:24:44","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Tess Flintoff parents name: Is Tess Flintoff related to Andrew Flintoff?","link":"https://thesportsrush.com/cricket-news-tess-flintoff-parents-name-is-tess-flintoff-related-to-andrew-flintoff/","keywords":["Cricket","Andrew Flintoff","Tess Flintoff"],"creator":["Gurpreet Singh"],"video_url":null,"description":"During the 26th match of the ongoing Women’s Big Bash League (WBBL) 2022, a certain 19-year-old Tess Flintoff from the Melbourne Stars registered her name in the league’s record books by smashing the fastest WBBL half-century, off mere 16 deliveries against the Adelaide Strikers at the North Sydney Oval in Sydney. The teenager’s 16-ball 51*-run… The post Tess Flintoff parents name: Is Tess Flintoff related to Andrew Flintoff? appeared first on The SportsRush.","content":"During the 26th match of the ongoing Women’s Big Bash League (WBBL) 2022, a certain 19-year-old Tess Flintoff from the Melbourne Stars registered her name in the league’s record books by smashing the fastest WBBL half-century, off mere 16 deliveries against the Adelaide Strikers at the North Sydney Oval in Sydney. The teenager’s 16-ball 51*-run knock comprised 6 Fours and 3 Sixes, which ultimately helped the Stars win the contest by 22 runs, after posting the score of 186/5 – their highest ever total in the league’s history. Flintoff broke the fastest WBBL fifty record after five years, which was jointly held by the hard-hitting Aussie batter Ashley Gardner and South African opener Lizelle Lee, both of who had reached the mark off 22 deliveries at this very venue during the 2017-18 season. Moreover, the 19-year-old also smashed the second fastest-ever fifty in women’s T20 Cricket, just behind Warwickshire‘s Marie Kelly’s 15-ball half-century versus Gloucestershire this year itself. Tess Flintoff parents name Tess Flintoff is an Australian Cricketer born in Melbourne on March 31, 2003. This rising Aussie star got selected in Cricket Australia’s Under 15-age group Talent Squad in the year 2015, and made it to the Australian Under-19 squad in 2020 as well. While Tess’ mother’s name is nowhere mentioned in public domain, her father Tim Flintoff reportedly had played a few Premier 1st XI games matches for the Kingston Hawthorn Cricket Club in Australia, back during his playing days. Is Tess Flintoff related to Andrew Flintoff? No. Despite similar surnames Tess Flintoff is nowhere related to the former star England allrounder Andrew Flintoff, who played international Cricket from 1998-2009. As for Tess, the 19-year-old played junior cricket with the boys at the Knox Gardens Cricket Club in Australia before joining the Outer Eagles girls’ team. At such a young age, she has already represented and skippered Victoria in various age groups. Three year ago, in 2019, she also represented the senior Victorian team and made her deubt against Nwe South Wales (NSW) in Adelaide. The post Tess Flintoff parents name: Is Tess Flintoff related to Andrew Flintoff? appeared first on The SportsRush.","pubDate":"2022-11-02 17:24:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"They somehow panicked: Gavaskar feels BAN could have played smart cricket vs India","link":"https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-feels-bangladesh-could-have-played-smart-cricket-in-run-chase-vs-india-they-somehow-panicked-2292595-2022-11-02?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"They somehow panicked: Gavaskar feels BAN could have played smart cricket vs India","content":null,"pubDate":"2022-11-02 16:44:50","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"DLS target calculator: Duckworth Lewis Method target calculator process explained","link":"https://thesportsrush.com/cricket-news-dls-target-calculator-duckworth-lewis-method-target-calculator-process-explained/","keywords":["Cricket","DLS method","Duckworth-Lewis-Stern method"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Team India found themselves on the right side of the result yet again in what was another cliffhanger of a contest against Bangladesh in the ongoing T20 World Cup 2022, at the Adelaide Oval. Chasing a stiff target of 185 handed by the Indians, Bangladesh’s experienced opening batter Litton Das (60 off 27) broke loose… The post DLS target calculator: Duckworth Lewis Method target calculator process explained appeared first on The SportsRush.","content":"Team India found themselves on the right side of the result yet again in what was another cliffhanger of a contest against Bangladesh in the ongoing T20 World Cup 2022, at the Adelaide Oval. Chasing a stiff target of 185 handed by the Indians, Bangladesh’s experienced opening batter Litton Das (60 off 27) broke loose to play some delightful strokes, to smash a 21-ball half-century in the Powerplay itself. However, with the scorecard reading 66/0 after 7 Overs, it started raining heavily at the venue, which lead to almost an hour-long delay before the play finally resumed. With decent enough time lost, the second innings was now reduced to 16 Overs, with Bangladesh being handed the target of 151, or 84 runs off the remaining 9 Overs to win the contest as per the Duckworth-Lewis-Stern or the DLS method calculation. Here are the DLS equations. #BANvIND #T20WorldCup pic.twitter.com/15EAxFmR4T — Melinda Farrell (@melindafarrell) November 2, 2022 Despite valiant efforts from the Bangladeshi batters, they ultimately fell short by 5 runs of the revised target. Why is it named the ‘DLS method’? Since there is a designated time period within which an ODI or a T20 match should be completed, the match officials cannot keep waiting for the playing conditions to be fit enough for a resumption back of cricketing action. The situation thus requires to incorporate a system wherein there is a revised target for the chasing team after a reduction in the number of Overs. This is where the DLS method comes into effect. Earlier known as the D/L method, named after English statisticians Frank Duckworth and Tony Lewis who devised this method to calculate target scores, the formula was first used in the year 1997. However, after meeting with some criticisms, an Aussie academic Steve Stern came up with an updation to the existing D/L formula ahead of the 2015 ODI World Cup, and the method has since then been known as the DLS method. First things first, the method does not take into consideration the ability/reputation of a batter or a bowler into account, as the mathematical calculation makes use of quantitative data, no matter how fair or unfair one might deem its calculation to be from a qualitative standpoint. DLS target calculator There are two resources in a game of Cricket – Overs and wickets. This means that the target chasing side has these two resources available with it, before the chase begins and while it is on. These resources are important to ascertain the revised target, as it makes sure to take into consideration the aggressive batting approach with which the batting first team would have played if the match was, for example a 16-Overs-a-side contest, as was the case in today’s twenty Overs World Cup match. The value of these two resources – ‘Overs remaining’ and ‘wickets lost’, at a certain point in the chase is calculated as a percentage. This percentage figure is arrived at with the help of a computer programme after a careful analysis of an evolving data comprising scoring patterns (for men’s T20 matches in case of the ongoing World Cup), which gets updated each year in July. While this computer data comprising the two resources are not publicly available, we do have a formula to calculate the DLS target for the chasing side after a certain number of Overs (at least 5 Overs in a T20 match, and 20 Overs in an ODI match), to come up with the revised target after reduction in Overs. The formula is expressed as: Team 2’s par score = Team 1’s score x (Team 2’s resources/Team 1’s resources). Here, par score refers to the total that the chasing team should have reached after they are a certain number of wickets down, at the time of rain interruption. In today’s encounter, Bangladesh’s par score as per a 16-Overs contest arrived at 83, taking into consideration that they had 9 Overs remaining, and 10 wickets in hand. Had they lost a few wickets at the time of rain interruption, they would have had to chase a higher target. The post DLS target calculator: Duckworth Lewis Method target calculator process explained appeared first on The SportsRush.","pubDate":"2022-11-02 16:18:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"After Conor McGregor, Joe Rogan, and Chael Sonnen, Khabib Nurmagomedov’s Friend Hasbulla Fires Shot at Liver King","link":"https://thesportsrush.com/ufc-mma-news-after-conor-mcgregor-joe-rogan-and-chael-sonnen-khabib-nurmagomedovs-friend-hasbulla-fires-shot-at-liver-king/","keywords":["UFC","Chael Sonnen","Conor McGregor","Hasbulla Magomedov","Joe Rogan","Liver King"],"creator":["Afnan Chougle"],"video_url":null,"description":"Early in 2022, Brian Johnson, also known as Liver King on Instagram, became well known due to his unusual way of life. The 45-year-old is well renowned for leading an ancestral lifestyle and appears in his videos solely consuming raw meat and organs. Liver King has adamantly asserted that he developed his physique by living… The post After Conor McGregor, Joe Rogan, and Chael Sonnen, Khabib Nurmagomedov’s Friend Hasbulla Fires Shot at Liver King appeared first on The SportsRush.","content":"Early in 2022, Brian Johnson, also known as Liver King on Instagram, became well known due to his unusual way of life. The 45-year-old is well renowned for leading an ancestral lifestyle and appears in his videos solely consuming raw meat and organs. Liver King has adamantly asserted that he developed his physique by living this way. His actions have made him a social media cult figure. On Instagram, The Liver King has more than a million followers. However, some UFC celebrities, including Conor McGregor, Joe Rogan, Hasbulla, and Chael Sonnen, don’t appear to be fans of the social media sensation. Hasbulla Magomedov dissess Liver King at UFC 280 The Russian social media sensation Hasbulla Magomedov recently signed a multiyear PR deal with the leading MMA promotion UFC this year. As a result, Magomedov attended UFC 280, which took place last month in Abu Dhabi.   Hasbulla is no fan of Liver King pic.twitter.com/Itlw1DJyqJ — Spinnin Backfist (@SpinninBackfist) November 1, 2022 During the event, the 20-year-old social media star ran into Liver King. In a video making rounds on the internet, the 45-year-old can be seen posing with the Russian star. While clicking pictures, Liver King said, “I’m The Liver King. Don’t forget that. I’m coming for you.” ALSO READ: After Rejecting $100M to Fight Conor McGregor and Khabib Nurmagomedov, Georges St-Pierre Changes Tune on His Combat Return Magomedov, on the other hand, didn’t seem impressed by him. He gave a savage response to the 45-year-old. Magomedov said, “I would rather take a picture with a dog.” However, Hasbulla Magomedov isn’t the only UFC celebrity who took a shot at the Liver King. What did Conor McGregor, Joe Rogan, and Chael Sonnen say? Liver King has become a known name in the MMA community since his videos went rival. The veteran UFC color commentator Joe Rogan talked about him on his famous podcast. Rogan in an episode stated that Liver King wasn’t all natural. Furthermore, when asked about Liver Kings’ physique on Twitter, the UFC legend Chael Sonnen had a similar response. The former middleweight star refused to believe that the 45-year-old has a natural physique. ALSO READ: “Holy Sh*t”: Joe Rogan Was Once Astounded by Cricket Great Virat Kohli’s Fame Compared to LeBron James, Conor McGregor, and Khabib Nurmagomedov Similarly, even the former UFC two-weight champion Conor McGregor slammed the Instagram star, after a fan compared the UFC star to Liver King. What are your thoughts on the Liver King? The post After Conor McGregor, Joe Rogan, and Chael Sonnen, Khabib Nurmagomedov’s Friend Hasbulla Fires Shot at Liver King appeared first on The SportsRush.","pubDate":"2022-11-02 15:30:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Taijul Islam optimistic about Bangladesh cricket’s future","link":"https://sportstar.thehindu.com/cricket/domestic/taijul-islam-bangladesh-cricket-india-ind-vs-ban-kohli-shakib-litton-t20-world-cup/article66087811.ece","keywords":null,"creator":["\n        S. Dinakar  \n    "],"video_url":null,"description":"Taijul Islam, in Chennai to play the Tamil Nadu side, followed the pulsating T20 World Cup game between India and Bangladesh down under.","content":"With relentless rain preventing play on day three too - Bangladesh XI remained at 59 for three against Tamil Nadu XI - the visiting cricketers departed to the team hotel in the afternoon. There they followed the pulsating T20 World Cup game between India and Bangladesh down under. Among those watching the match was Taijul Islam. With 158 wickets in 38 Tests, the 30-year-old Taijul is a senior cricketer in this touring Bangladesh XI side. “Before the run-out of Litton Das we had a very good chance, Then, it became more difficult. But we put up a very good fight,” he told Sportstar on Wednesday. A left-arm spinner whose forte is control, Taijul rates his seven-wicket innings haul against Pakistan in the Chattogram Test of 2021 as his most satisfying display. “The Pakistanis play spin well and to do well against those batters was special,” he said. Asked who was the toughest Indian batter he bowled at, Taijul replied, “Cheteshwar Pujara. He gives very little chance to get him out and closes down the angles.” Interestingly, Taijul does not have a role model. “I pick the good things from the cricketers I like. I have developed my skills that way.” Of course, the influential Shakib Al Hasan has been around to help him. “He is like a big brother to me. He too is a left-arm spinner and we discuss ways to get batters out.” Looking across the border, Taijul said Ravindra Jadeja was a fine left-arm spinner. “He has all the deliveries and a big match temperament.” And Taijul is an admirer of Virat Kohli’s batsmanship. “India is full of strokemakers but Kohli is still the best.” Taijul was optimistic about Bangladesh’s cricketing future. “We have a good blend of experienced and young cricketers. And we are improving all the time.” Read more stories on Domestic.","pubDate":"2022-11-02 15:14:23","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"The Greatest Game: How England won the 2019 World Cup","link":"https://www.skysports.com/cricket/news/12040/12736486/the-greatest-game-sky-to-show-documentary-on-how-england-won-the-2019-cricket-world-cup","keywords":null,"creator":null,"video_url":null,"description":"The Greatest Game is the story of England's last-gasp victory over New Zealand in the iconic Super Over to win a dramatic 2019 World Cup final in arguably the greatest game of cricket ever played.","content":null,"pubDate":"2022-11-02 14:54:00","image_url":"https://e1.365dm.com/19/07/1920x1080/skysports-england-eoin-morgan_4718764.jpg?20190715102945","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"Watch: Shakib Al Hasan Unhappy With Virat Kohli Over Gesture To Umpire in T20 World Cup Game - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvc2hha2liLWFsLWhhc2FuLXVuaGFwcHktd2l0aC12aXJhdC1rb2hsaS1vdmVyLWdlc3R1cmUtdG8tdW1waXJlLWluLXQyMC13b3JsZC1jdXAtZ2FtZS13YXRjaC0zNDgzNDAz0gGUAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3QyMC13b3JsZC1jdXAtMjAyMi9zaGFraWItYWwtaGFzYW4tdW5oYXBweS13aXRoLXZpcmF0LWtvaGxpLW92ZXItZ2VzdHVyZS10by11bXBpcmUtaW4tdDIwLXdvcmxkLWN1cC1nYW1lLXdhdGNoLTM0ODM0MDMvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Shakib Al Hasan Unhappy With Virat Kohli Over Gesture To Umpire in T20 World Cup Game  NDTV SportsLive match blog - India vs Bangladesh 35th Match, Group 2 2022/23 - Cricket Insights  ESPNcricinfoIndia Vs Bangladesh Live Match Score | India Bangladesh T20 World Cup 2022 LIVE | Cricket Live  CNN-News18Watch: Kohli's 'aap aao batting karne k liye' remark leaves reporter dumbfounded  Hindustan TimesKL Rahul Storms Back To Form With Blistering Fifty; Former Cricketer Pragyan Ojha Analyses The Match  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-11-02 14:40:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Group 2 scenarios - What do India, South Africa, Pakistan and Bangladesh need to do to make semi-finals? - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3QyMC13b3JsZC1jdXAtMjAyMi1ncm91cC0yLXdoYXQtZG8taW5kaWEtc291dGgtYWZyaWNhLXBha2lzdGFuLWFuZC1iYW5nbGFkZXNoLW5lZWQtdG8tZG8tdG8tbWFrZS1zZW1pLWZpbmFscy0xMzQzMDM10gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Group 2 scenarios - What do India, South Africa, Pakistan and Bangladesh need to do to make semi-finals?  ESPNcricinfoT20 WC 2022: This Team Can Play Against India In The Semi-finals Of The T20 World Cup In Australia!  ICC CRICKET SCHEDULET20 World Cup Group 1 scenarios: Which teams can make it to the semifinals?  The Indian ExpressCan Pakistan still qualify? The route to a semi-final spot explained  icc-cricket.comT20 World Cup 2022: Deep Dasgupta names his picks for semi-finals  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-11-02 14:38:57","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Wrists Se Pata Nahi Chalta...\": Ex Pakistan Star's Praise For Arshdeep","link":"https://sports.ndtv.com/cricket/unke-wrists-se-pata-nahi-chalta-ex-pakistan-stars-huge-compliment-for-arshdeep-singh-3484311","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Former Pakistan cricket team spinner Saeed Ajmal lavished huge praise on Arshdeep Singh","content":"While the batting of Virat Kohli and Suryakumar Yadav have been the highlight of Indian cricket team's 2022 T20 World Cup campaign so far, Arshdeep Singh's left-arm pace bowling has made almost equal impact. He has so far scalped nine wickets to be India's best bowler in the mega event. His list of victims includes Babar Azam , Mohammad Rizwan, Quinton De Kock, Asif Ali among others. In India's first loss of the tournament against South Africa on Sunday, Arshdeep gave the team a glimmer of a hope while defending a low total of 133/9. He took the early wickets de Kock and Rilee Rossouw to peg back the Proteas. However, the Temba Bavuma -led side recovered from that shock to reach the target with two balls to spare. However, the 23-year-old Arshdeep's effort did not go unnoticed and he once again took two wickets against Bangladesh on Wednesday, helping India register a narrow five-run win. Former Pakistan cricket team spinner Saeed Ajmal lavished huge praise on him. Promoted \"Arshdeep Singh, kya baat hai! He bowls brilliantly. Unke wrists se pata nahi chalta hai (You can't figure out by his wrists) which ball he is going to move away or which one he'll bring back in. I think after Zaheer Khan , he is the first Indian bowler whose swing and pace is not predictable. He gets two to move away, and then gets one to jag back in. The delivery that comes back in from a left-arm fast bowler, that is the ball which is very difficult to face. You have seen Wasim Akram . He is a world-class bowler. Arshdeep bowled brilliantly,\" Ajmal said on his YouTube channel. Arshdeep's performance has meant that India have not felt the absence of injured pace spearhead Jasprit Bumrah . India next play Zimbabwe in a Group 2 match on Sunday.","pubDate":"2022-11-02 14:33:09","image_url":"https://c.ndtvimg.com/2022-10/ijogr3qo_arshdeep-singh_625x300_31_October_22.jpeg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Rohit Sharma makes special mention of KL Rahul after India's win","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-rohit-sharma-makes-special-mention-of-kl-rahul-after-indias-win-767666","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"KL Rahul scored a half-century on WednesdayIndia defeated Bangladesh by 5 runs in AdelaideVirat Kohli was the Player of the Match for his 64*","content":"KL Rahul scored a half-century on Wednesday India captain Rohit Sharma on Wednesday made a special mention of KL Rahul after their close victory over Bangladesh in the T20 World Cup 2022 . Rahul's place in the Indian team was questioned in the ICC tournament after scoring 4, 9, and 9 in India's last three games. However, the Karnataka batsman bounced back and proved his critics wrong by registering a crucial half-century at Adelaide Oval. It was reported on Tuesday that Virat Kohli and head coach Rahul Dravid were closely monitoring Rahul's net sessions, while the former was also seen giving tips to the opening batsman. The hard work seemed to have paid off as Rahul struck four sixes and three fours in his knock of 50 off 32 balls. \"The way KL batted as well, it was important for him and the team. We know what sort of player he is at the top of the order,\" Rohit said at the post-match presentation. The March continues 🇮🇳💙 pic.twitter.com/yjBvJwLmWo Half-centuries from Rahul and Kohli, and a quick-fire 30 off 16 balls from Suryakumar Yadav helped India to post 184 for 6 in 20 overs. In reply, Liton Das gave Bangladesh a flying start as the Tigers were 66 for no loss in seven overs before rain interrupted the play in Adelaide. Subsequently, Bangladesh's target was revised to 161 off 16 overs. The equation went down to 31 off the final two overs and then Bangladesh needed 20 off the last six balls. The match went down to the wire as Arshdeep was hit for a four and a six but India eventually sealed the game by five runs. Rohit revealed that he had make a choice between Arshdeep and Mohammed Shami for the final over. In the absence of Jasprit Bumrah, who missed the T20 World Cup due to a back injury, India have been preparing the 23-year-old Arshdeep to bowl in the death over and Rohit decided to back the pacer on Wednesday. \"I was calm and nervous at the same time, but it was important to stay calm as a group to execute. Shortened games can go either way, but we held our nerves well after the game started, it was a good win in the end. Arshdeep, when he came into the scene, we asked him to do the death overs for us. With Bumrah not there, it was a tough job for someone to take up. \"For a young guy to come and do that kind of a job is not easy, we've prepared him. He's been doing it for 8-9 months. I had to back someone who had been doing it regularly, it was a choice between Shami and Arshdeep,\" added Rohit in the same presentation. 💥💥💥 Arshdeep Singh continues to deliver the goods for India 👏 #T20WorldCup | #INDvBAN pic.twitter.com/LAgZhWlHqL Speaking about Kohli, who clinched his second Man of the Match award this tournament, Rohit said that he always knew it was just a matter of few innings for Kohli to return to his form. \"In my mind, Kohli was always there. It was just a matter of a few innings here and there, and he hasn't looked back since the Asia Cup. The guy has so much experience. Some of the catches we took today were great to watch. When you're playing in front of a big crowd it's not easy. To take those catches, it shows the character of the guys. I have no doubts over our fielding abilities,\" said Rohit. T20 World Cup: Losing to India has become our story, says Shakib Al-Hasan Meanwhile, Bangladesh captain Shakib Al-Hasan pointed out that Bangladesh have made it a habit of not being able to win close games against India. Shakib also praised Liton Das, who kept Bangladesh in the game till he was at the crease. The opening batsman hit three sixes and seven fours in his knock of 60 off 27 deliveries at an incredible strike-rate of 222.22. \"It's been the story when we play against India, we are almost there but we don't finish the line. Both teams enjoyed it, it was a great game and that's what we wanted. At the end, someone has to win and someone has to lose. He's [Litton Das] our best batter going around. The way he batted in the powerplay gave us a lot of momentum and gave us the belief that we could chase this with the short boundaries here. If you look at India's top four, they are very dangerous. \"Our plan was to get those 4 and that's why we bowled Taskin through. Unfortunately, he did not pick wickets but he was very economical. Not much, we have been very relaxed and not talking too much about cricket in this World Cup. We have one more match to go and we want to concentrate on that,\" added Shakib. India and Bangladesh have one game each left in the Super 12s. Team India next takes on Zimbabwe on Sunday (Nov. 6) in Melbourne, while Bangladesh remain in Adelaide to face off against Pakistan, also on Sunday.","pubDate":"2022-11-02 14:32:52","image_url":"https://assets.thehansindia.com/h-upload/2022/11/02/500x300_1318871-kl-rahul.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"\"We Are Almost There But...\": Bangladesh Captain Shakib Al Hasan On Losing Close Games Against India.. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvd2UtYXJlLWFsbW9zdC10aGVyZS1idXQtYmFuZ2xhZGVzaC1jYXB0YWluLXNoYWtpYi1hbC1oYXNhbi1vbi1sb3NpbmctY2xvc2UtZ2FtZXMtYWdhaW5zdC1pbmRpYS0zNDg0MTAx0gGXAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3QyMC13b3JsZC1jdXAtMjAyMi93ZS1hcmUtYWxtb3N0LXRoZXJlLWJ1dC1iYW5nbGFkZXNoLWNhcHRhaW4tc2hha2liLWFsLWhhc2FuLW9uLWxvc2luZy1jbG9zZS1nYW1lcy1hZ2FpbnN0LWluZGlhLTM0ODQxMDEvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"We Are Almost There But...\": Bangladesh Captain Shakib Al Hasan On Losing Close Games Against India..  NDTV SportsLive match blog - India vs Bangladesh 35th Match, Group 2 2022/23 - Cricket Insights  ESPNcricinfoIndia Vs Bangladesh Live Match Score | India Bangladesh T20 World Cup 2022 LIVE | Cricket Live  CNN-News18We've prepared Arshdeep Singh for death overs: Rohit Sharma  The Indian Express#India emerges victorious against #Bangladesh in their Super 12 clash  DD INDIAView Full coverage on Google News","content":null,"pubDate":"2022-11-02 14:15:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"King Kohli Creates History as The Highest Run Scorer In T20 Men's Cricket World Cup","link":"https://www.sentinelassam.com/sports/cricket/king-kohli-creates-history-as-the-highest-run-scorer-in-t20-mens-cricket-world-cup-621325","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Virat Kohli now the highest run-scorer in the history of T20 cricket leaving behind Mahela Jayawardhane's 1016 runs with his 16th run in the match against Bangladesh, reaching his 1017-run mark.","content":"ADELAIDE: In what has come as a red letter day in Indian cricket, ace cricketer Virat Kohli has set another milestone to emerge as the highest run scorer in the history of the T20 Men's Cricket World Cup, when he scored his 16th run in the T20 match against Bangladesh in the ongoing T20 World Cup Tournament in Australia's Adelaide. The earlier record was held by Sri Lankan cricketer Mahela Jayawardhane with 1016 runs in 31 innings set in 2014. With his 16th run in the match against Bangladesh, King Kohli is now at the top spot with 1017 runs in his 23rd innings in T20 World Cups. It may be mentioned here that earlier in the 2016 T20 World Cup, Kohli settled at the second spot after India returned home in the semi-final stage. Although the ace cricketer has seen many lows in the recent few years due to not scoring well, things have started to fall back in place from the Asia Cup 2022 onward. With a return to his dominating best again, Kohli scored the highest individual score by an Indian cricketer of 122 in 61 balls in the T20 format. In the current tournament as well, the right handed batsman been in his great form which was evident in the match winning score of 82 against Pakistan in the thrilling match. Notably, at the start of the match against Bangladesh today, Virat Kohli had 1001 runs to his name. It was in the 7th over against Bangladesh's Taskin Ahmed that he knocked off Jayawardhane's record with a single. He scored 64 runs in 44 balls today. This was also Virat Kohli's third half century in the current tournament. With the latest milestone in his career, Virat Kohli is now ahead of Rohit Sharma, Martin Gutill, Babar Azam and Paul Stirling. It was in 2012 that Virat Kohli participated in his first T20 World Cup and so far has played in 25 matches of the same. In this decade, Kohli scored as many as thirteen 50s and has 89 as his highest score against West Indies in the 2016 T20 World Cup. Also read: Crown Perth hotel apologises to Indian cricketer Virat Kohli for the breach of player's privacy by a fan Also watch:","pubDate":"2022-11-02 14:11:20","image_url":"https://assets.sentinelassam.com/h-upload/2022/11/02/408621-virat-kohli-.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"जिस हिंदू क्रिकेटर को बांग्लादेश में पड़ रही थी गाली, वही बना टीम का सबसे बड़ा हीरो","link":"https://navbharattimes.indiatimes.com/sports/cricket/t20worldcup/news/litton-das-scored-fifty-in-just-21-balls-vs-india-t20-world-cup-2022/articleshow/95255021.cms","keywords":null,"creator":null,"video_url":null,"description":"India vs Bangladesh T20 Cricket Match: बांग्लादेश के बल्लेबाज लिटन दास ने भारत के खिलाफ टी20 वर्ल्ड कप के मैच में विस्फोटक बल्लेबाजी की। एक महीने पहले ही एक पोस्ट के लिए उन्हें अपने ही देश में ट्रोल होना पड़ रहा था। अपशब्द कहे जा रहे थे। लेकिन आज उनकी पारी से टीम जीत के करीब पहुंच गई थी।","content":null,"pubDate":"2022-11-02 13:59:05","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"T20 World Cup 2022: \"Virat was always there\"- Rohit Sharma on Virat Kohli following win against Bangladesh","link":"https://www.indiatvnews.com/sports/cricket/t20-world-cup-2022-virat-was-always-there-rohit-sharma-on-virat-kohli-following-win-against-bangladesh-ind-vs-ban-ind-beat-ban-ind-close-to-semifinal-2022-11-02-820804","keywords":null,"creator":null,"video_url":null,"description":"T20 World Cup 2022: The Indian cricket team on Wednesday defeated the Bangladesh side in a nail-biting contest at Adelaide by 5 runs. Led by Arshdeep Singh and Hardik Pandya with the ball, India outclassed the Bangla Tigers in a rain-curtailed match. Earlier, it was Virat Kohli and KL Rahul, who gave India a good total of 184.","content":null,"pubDate":"2022-11-02 13:28:27","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Zimbabwe cricket back to life after T20 World Cup run, says coach","link":"https://www.iol.co.za/sport/cricket/international/zimbabwe-cricket-back-to-life-after-t20-world-cup-run-says-coach-36ff85e8-0699-4345-9d5a-6196b9858d2a","keywords":null,"creator":["AFP"],"video_url":null,"description":"Zimbabwe coach Dave Houghton says his team's T20 World Cup exploits have “brought the game back to life” in the country.","content":null,"pubDate":"2022-11-02 13:24:43","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/2c833a58-26f7-5bf6-81eb-1daef4f1335e","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: 'I'm just in a happy place,' says Kohli after India's win over Bangladesh","link":"https://www.thehansindia.com/sports/cricket/t20-world-cup-im-just-in-a-happy-place-says-kohli-after-indias-win-over-bangladesh-767662","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India defeated Bangladesh by 5 runsThe match was reduced to 16 overs due to rain Kohli scored an unbeaten 64 in the first innings","content":"Kohli scored an unbeaten 64 in the first innings Virat Kohli has said he is in a \"happy place\" after playing yet another match-winning knock for India in the ongoing T20 World Cup. Kohli scored an unbeaten 64 off 44 balls in India's five-run victory over Bangladesh in the Super 12s game at Adelaide Oval on Wednesday. The victory took India at the top of Group 2 with six points in four games. India will qualify for the semi-final if they defeat Zimbabwe in their final Super 12 fixture. The match on Wednesday was hit by rain, which saw Bangladesh's target revised. Shakib Al-Hasan and Co were 66 for no loss when the play was halted. When it resumed, Bangladesh's target was revised to 161 off 16 overs. Bangladesh's opening batsman Liton Das kept his side very much in the game while he lasted at the crease. He struck three sixes and seven fours in his knock of 60 off just 27 balls. Following his dismissal, no other batsman stuck in the middle for long and the Indian bowlers successfully brought the Men in Blue back into the game and eventually won it as well. \"Pretty close game, not as close as we would've liked it to be. It was another good day with the bat I guess, was trying to play myself into the innings. When I went in there was pressure, was watching the ball well. I'm just in a happy space, I don't want to compare anything. What's in the past is in the past,\" said Kohli after receiving the Player of the Match on Wednesday. Out of three games won by India, Kohli has earned the award in two, with his first award coming in India's superb victory against Pakistan. Kohli also revealed that when he came to know that the T20 World Cup was going to be played in Australia, he was so glad knowing he has ample experience of playing Down Under. \"As soon as I knew the WC was in Australia, I was grinning from ear to ear. I knew good cricketing shots would be the key. I knew the kind of experience and game awareness of having played in Australia will come in handy for the team. \"Hitting through the line is what I do in every format. It is just an extension for me. I absolutely love playing in this ground. Right from the nets at the back, as soon as I enter, it makes me feel at home. That knock at MCG was meant to be, but when I come here, it's like I'm meant to come to Adelaide and enjoy my batting,\" the former India captain added further. Kohli's love affair with Adelaide Oval is not hidden. Having played four One-Day Internationals (ODIs) at this ground, Kohli has scored two centuries and in the two T20Is, his scores are an unbeaten 90 and 64. The Delhi batsman had also captained his first Test at Adelaide Oval in December 2014. Character & Conviction. 💪 pic.twitter.com/WuYIpr99Xn India's final group game of the T20 World Cup 2022 will be played on Sunday (Nov. 6) against Zimbabwe at Melbourne Cricket Ground (MCG).","pubDate":"2022-11-02 13:21:58","image_url":"https://assets.thehansindia.com/h-upload/2022/11/02/500x300_1318862-virat-kohli.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN, T20 World Cup 2022: Arshdeep Singh rattles Bangladesh's hopes of victory, sets Twitter ablaze","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-ban-t20-world-cup-2022-arshdeep-singh-rattles-bangladesh-s-hopes-of-victory-sets-twitter-ablaze-2022-11-02-820800","keywords":null,"creator":null,"video_url":null,"description":"IND vs BAN, T20 World Cup 2022: India have edged past Bangladesh. In a thriller that unfolded at the Adelaide Oval, the men in blue edged past Bangladesh by a margin of 5 runs. In the race to qualify for the semi-finals, India held their nerves and executed their plans when it mattered the most. Riding high on Virat Kohli's 64* off 44 deliveries, the Indian cricket team posted a total of 184/6 at the end of 20 odd overs. When Liton Das got going, the hopes of India took a hit but that is when the 'Rain Gods' showed up.","content":null,"pubDate":"2022-11-02 13:05:56","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}