{"newsArray":[{"title":"WA Cricket Association board chair Terry ‘Tuck’ Waldron resigns after just three years in role","link":"https://thewest.com.au/sport/cricket/wa-cricket-association-board-chair-terry-tuck-waldron-resigns-after-just-two-years-in-role-c-8160076","keywords":null,"creator":["Ben Smith"],"video_url":null,"description":"Terry ‘Tuck’ Waldron has made the shock call to resign as chair of the WACA board after just three years.","content":null,"pubDate":"2022-09-07 22:00:00","image_url":"https://images.thewest.com.au/publication/C-8160076/0ce59826071e4256439fe0400db693f97ecd90c3-16x9-x598y594w2423h1363.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Fans rip up stadium after Asia Cup loss","link":"https://www.cairnspost.com.au/sport/cricket/fans-rip-up-stadium-after-asia-cup-loss/video/82b9a49f8b752245d15ce40869a177a4","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: After watching Afghanistan fall in a heartbreaking one wicket loss to Pakistan at the Asia Cup, fans in the stadium reacted violently, throwing chairs and attacking other spectators.","content":null,"pubDate":"2022-09-07 21:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Shubman Gill hits 92 for Glamorgan on English county debut","link":"https://www.firstpost.com/firstcricket/sports-news/shubman-gill-hits-92-for-glamorgan-on-english-county-debut-11205941.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Shubman Gill hits 92 for Glamorgan on English county debut","content":"Cricket Shubman Gill hits 92 for Glamorgan on English county debut India batter Shubman Gill struck a fine 92 in his English county championships debut as his side Glamorgan reached 230 for seven on the third day against Worcestershire FirstCricket Staff September 8th, 2022 2:43:21 IST Shubman Gill raises bat after scoring a half century for Glamorgan during an English County match on Wednesday. Twitter/Glamorgan Cardiff : India batter Shubman Gill struck a fine 92 in his English county championships debut as his side Glamorgan reached 230 for seven on the third day against Worcestershire here on Wednesday. The 22-year-old Indian consumed 148 balls for his 92 and hit nine fours and a six. Two balls after Gill’s departure off the bowling of E Barnard, bad light stopped play in the 67th over and the players headed off the field. Shubman Gill departs after a classy 92 on his Glamorgan debut Two balls later, the umpires decide that bad light will stop play and the players head off the field #GLAMvWOR | #GoGlam pic.twitter.com/yNKEDSHdxs — Glamorgan Cricket (@GlamCricket) September 7, 2022 Glamorgan trail Worcestershire by 224 runs with three wickets remaining in the second innings in the county championships division two match. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: September 08, 2022 02:43:21 IST Tags: Cricket Shubman Gill Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-09-07 21:13:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Shubman-Gill.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Afghanistan Asia Cup 2022: Watch Afghan fans disrupt, throw chairs at Pakistan fans; Shoaib Akhtar condemns","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-afghanistan-asia-cup-2022-watch-afghan-fans-disrupt-throw-chairs-at-pakistan-fans-shoaib-akhtar-condemns-11205911.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Afghanistan Asia Cup 2022: Watch Afghan fans disrupt, throw chairs at Pakistan fans; Shoaib Akhtar condemns","content":"In a strange and one of its kind incident, Afghanistan fans were seen disrupting the chairs from their situation and throwing them randomly at Pakistan fans and a few hitting them on their back.Cricket matches are often denominated as ‘edge of the seat’ thrillers when they go down to the last over, with both teams having an equal chance of winning. But that is only because the fans get to the edge of their seats in a tense situation, and not to hit the opposition fans with the edge of their seats.The incident took place after Pakistan defeated Afghanistan in the Super 4 clash on Wednesday at the Sharjah Cricket Stadium.Shoaib Akhtar condemned the antics of the Afghan fans and tweeted, “This is what Afghan fans are doing. This is what they’ve done in the past multiple times. This is a game and it’s supposed to be played and taken in the right spirit. @ShafiqStanikzai, your crowd & your players both need to learn a few things if you guys want to grow in the sport.Watch the video here:This is what Afghan fans are doing. This is what they’ve done in the past multiple times.This is a game and its supposed to be played and taken in the right spirit.@ShafiqStanikzai your crowd & your players both need to learn a few things if you guys want to grow in the sport. pic.twitter.com/rg57D0c7t8— Shoaib Akhtar (@shoaib100mph) September 7, 2022Afghanistan were brilliant on the field and had almost defeated Pakistan, bringing them on their knees after dismissing nine wickets. Pakistan needed 11 runs in the last over and had only one wicket in their hands. Afghanistan were the clear favourites.However, Naseem Shah hit two hefty blows to destroy Afghanistan’s dreams and also end their campaign at the ongoing Asia Cup.Read: Naseem Shah’s six and other talking points from Pakistan vs AfghanistanOn a serious note, some of these afghan kids really need to learn how to behave. This is an international match not gully cricket. Never happens in any other matches. That’s the reason i really respect the other Cricket Teams #PakvsAfg pic.twitter.com/jwRblDphRA— MUHAMMAD ROBAS (@IAmRobas) September 7, 2022The videos show fans disrupting one of the stands and randomly throwing chairs at Pakistan fans. The Pakistan fans tried to evacuate quickly to their safety.No official statements have been released by the Cricket boards or the Sharjah Cricket Stadium officials after the events.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 21:04:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Afg-vs-Pak-chairs-throw.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"England look to provide fitting finale to memorable summer at the Oval","link":"https://www.theguardian.com/sport/2022/sep/07/england-look-to-provide-fitting-finale-to-memorable-summer-at-the-oval","keywords":["England v South Africa 2022","England cricket team","South Africa cricket team","Cricket","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"South Africa likely to revert to their four-man pace attack while Harry Brook makes his England debut in the deciding TestAnd so to the Oval for a decider that will cap off an already memorable summer of Test cricket. England, reborn under Ben Stokes, could register their best home season for 18 years with a sixth win, while South Africa hope to reclaim the Basil D’Oliveira Trophy with what would be their third series win on these shores since readmission.So far we have witnessed the two sides register a thumping innings victory apiece, the pendulum swinging from South Africa’s storming of Lord’s to Stokes powering his side to parity in Manchester. There have been just six days of cricket – just under, in fact – and so while the forecast is iffy, the draw still feels like an outside bet. Continue reading...","content":"A nd so to the Oval for a decider that will cap off an already memorable summer of Test cricket. England, reborn under Ben Stokes, could register their best home season for 18 years with a sixth win, while South Africa hope to reclaim the Basil D’Oliveira Trophy with what would be their third series win on these shores since readmission. So far we have witnessed the two sides register a thumping innings victory apiece, the pendulum swinging from South Africa’s storming of Lord’s to Stokes powering his side to parity in Manchester . There have been just six days of cricket – just under, in fact – and so while the forecast is iffy, the draw still feels like an outside bet. At the Oval there is a rich sense of history and in recent times plenty between the two teams, be it Devon Malcolm’s nine-wicket display of shock and awe in 1994 , Hashim Amla’s masterful triple century in 2012 – the first by a South African – or the joyful scenes that followed confirmation of Moeen Ali’s hat-trick five years ago . Harry Brook has the brio and bravery to thrive in England’s Bazball era | Mark Ramprakash Read more The ground has also seen a few titans head off into the sunset over the years, with Don Bradman, Viv Richards, Curtly Ambrose, Andrew Flintoff and Alastair Cook among them. Cook did it best, of course, practically ensuring his retirement would be irreversible with a farewell century against India in 2018 that had the crowd swooning. But there is currently no sense of an impending swansong this week despite Jimmy Anderson recently entering his fifth decade and Stuart Broad’s broadcasting talents being much coveted by Sky. Certainly Stokes does not anticipate a quiet word from either, not least with an Ashes series next summer that is done by the end of July. “I honestly just can’t see a point where they decide it’s time to step away,” said the captain. “Jimmy has said how much fun he’s had and Broady’s influence in the dressing room is the best I’ve seen while playing with him over the years. The conversations he has had with the other bowlers is something he’s taken to another level. “It’s great to see Jimmy at 40 and Broady at 36 having a new lease of life and honestly I can’t tell you when the end will be. We’ve got the Ashes coming out next summer and I’m pretty sure they’ve got their eyes set on that but I’m not 100% sure.” Things could change – Broad, a dad-to-be, may well miss December’s tour of Pakistan – but their current desire says plenty about the environment Stokes and Brendon McCullum have fostered as captain and coach. Neither seamer was in the Caribbean in March but the new regime has looked to wring every last wicket out of them, reverting to the basic principle of picking the best XI and not overthinking the future. Stuart Broad and Jimmy Anderson share a joke as they plot a route through South Africa’s defences. Photograph: John Walton/PA While two fine Test careers may not be drawing stumps just yet, a fresh one begins, with Yorkshire’s Harry Brook the beneficiary of Jonny Bairstow’s unfortunate accident on the golf course . The 23-year-old will slot in at No 5 and has already raided 140 runs for the Lions against South Africa, even if Dean Elgar was tipping a far tougher assignment when describing Test cricket as “the big league”. The same goes for England’s XI as a whole, with South Africa’s captain unlikely to make the same mistake twice. Instead he is likely to revert to the four-pronged pace attack that positively crackled at Lord’s. This return for Marco Jansen, only slightly shorter than the Oval’s neighbouring gas holder and able to swing the ball prodigiously from a left-arm angle, means pressure is unlikely to be released so easily this week. Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. That said, the tourists desperately need more from a batting line-up that has returned just one half-century thus far. Changes to the middle order are likely. Ryan Rickelton has been confirmed to replace Rassie van der Dussen, while Khaya Zondo, whose one Test to date was ended by Covid before facing a ball, is tipped to nudge out Aiden Markram after a baffling run of 15 innings without a 50. As well as the chance to secure their first series victory on these shores since 2012 – and, criminally, the last for some time given no return visit is slated in the next cycle – the tourists also have the added incentive of furthering their chances of making next summer’s World Test Championship final. They sit second at present but can go level with leaders Australia, before they meet for a dust-up Down Under later this year. England are no-hopers in this regard, their prospects of reaching the final scuppered by the year of flatlining form that preceded the Stokes/McCullum axis. They can, however, continue their upward curve and their evolution as a side that is looking to be positive and not, as some feared earlier in the season, simply gung-ho. “The whole nation has enjoyed watching us play because sometimes they don’t know what they’re going to get,” said Stokes. He’s not wrong but given the ground, the occasion, two brittle teams and a pair of captains hell-bent on a victory at all costs, a decent finale looks in store regardless.","pubDate":"2022-09-07 21:00:15","image_url":"https://i.guim.co.uk/img/media/d364b45aba9ff5409c93f5efc15da9c380e43f52/0_131_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=739512ed04e91a869683df70aae8f607","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Afghanistan Asia Cup 2022 stat attack: Captain’s golden duck, 10th wicket partnership and more numbers","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-afghanistan-asia-cup-2022-stat-attack-captains-golden-duck-10th-wicket-partnership-and-more-numbers-11205721.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Afghanistan Asia Cup 2022 stat attack: Captain’s golden duck, 10th wicket partnership and more numbers","content":"Pakistan defeated Afghanistan in an edge-of-the-seat encounter after Naseem Shah’s back-to-back sixes off Fazlhaq Farooqi’s bowling in the last over at Sharjah Cricket Stadium on Wednesday. Afghanistan were restricted to 129 in 20 overs after none of the Pakistan bowlers went for more than 8.5 runs per over. The Afghanistan bowlers gave a bit of it back as they had succeeded, almost, in defending the total as 11 runs were needed in the last over with just one wicket in hand.First Javed Miandad six on last ball. Second Shahid Afridi two six in final. Today Naseem Shah creat history.❤️🇵🇰 Naseem Shah You Beauty. 🤗#UrvashiRautela #Goodbye #AsiaCup2022 pic.twitter.com/ehbcFIO7ej— Mehran Ch 🏴‍☠️ (@IMehranOffical) September 7, 2022In a low-scoring match as such, not many records could have been shattered, but here are a few –– Pakistan chased the 130-run target with one wicket in hand. This was the second such instance in T20Is, the previous one being way back in 2015 when they chased 174 against Sri Lanka in Colombo.– There have been only two one-wicket wins in the Asia Cup – both by Pakistan. The previous one was back in 2014 against India, when Shahid Afridi hit two sixes in a row to seal the match.– Naseem Shah and Mohammad Hasnain registered a partnership of 13 runs for the 10th wicket. The partnership is the highest between number 10 and 11 in a successful run chase in T20Is.– Shadab Khan scalped one wicket today, which was his 28th wicket in the UAE. He is Pakistan’s highest wicket-taker in UAE; the next best being Saeed Ajmal with 26 dismissals.– Mohammad Nabi and Babar Azam were both out for a first-ball duck in Sharjah. This was only the second such instance, the first one being in a 2019 ODI between India and West Indies. Virat Kohli and Kieron Pollard had got out for duck back then.International matches with both captains out for first-ball ducks (full members):Virat Kohli🇮🇳 & Kieron Pollard🏝️ in 2019 (ODI) Mohammad Nabi🇦🇫 & Babar Azam🇵🇰 today (T20I)#AsiaCup #AFGvPAK— Kausthub Gudipati (@kaustats) September 7, 2022– Pakistan have defeated Afghanistan in their last four contests in multinational events with six balls or less to spare.YearTournamentBalls to spare2018Asia Cup32019ODI World Cup22021T20I World Cup62022Asia Cup4Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 20:03:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Babar-Azam-stat-attack.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Babar Azam's poor form continues with golden duck during Pakistan vs Afghanistan","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-babar-azam-poor-form-continues-with-golden-duck-during-pakistan-vs-afghanistan-11205241.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: Babar Azam's poor form continues with golden duck during Pakistan vs Afghanistan","content":"Pakistan captain Babar Azam’s lean patch at the Asia Cup 2022 continued as the now World No. 2 T20 batter was out for a golden duck against Afghanistan at Sharjah Cricket Stadium on Wednesday.The opener was dismissed off the second ball of the Pakistan innings as they began their chase of 130. Afghan pacer Fazalhaq Farooqi dismissed the 27-year-old batter with a length delivery that kept low and hit Azam in front of the middle stump. Umpire Jayaraman Madanagopal had no hesitation in raising his finger and Azam didn’t opt for a review either.At the time of writing, Pakistan were stuttering at 52/3 in 10 overs with Iftikhar Ahmed (19*) and Shadab Khan (6*) on the crease.With the nought, Azam has now just 33 runs to his name while facing 28 deliveries in the continental tournament across four innings. His best show with the bat was a pale 14 against India in the last game but the skipper did had the pleasure to watch his team defeat their arch-rivals.Prior to that, Azam scored just 9 against Hong Kong before getting caught and bowled by Ehsan Khan. Pakistan, however, had little difficulty in winning that game in the group stages as they bundled out the minnows for a record 38.In the first of group matches against India in their Asia Cup opener, Azam just delivered 10 runs in nine balls before Bhuvneshwar Kumar claimed his scalp.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 19:35:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Babar-Azam-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Afghanistan Asia Cup 2022: Naseem Shah’s match-turning sixes and other talking points","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-afghanistan-asia-cup-2022-naseem-shahs-match-turning-sixes-and-other-talking-points-11205571.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Afghanistan Asia Cup 2022: Naseem Shah’s match-turning sixes and other talking points","content":"Naseem Shah ran half a mile on the field, his hands swaying, threw his bat away, removed his helmet, and threw it like he had 10 more in the kit bag. Hasan Ali in his blue apron had ran out to him till then from the dugout. The two had a moment. Naseem then threw his gloves off. The entire Pakistan team was out to celebrate the win.This wasn’t the first time a team has celebrated a win in such a manner. But every time a team celebrates as such, it does become iconic. Pakistan had beaten Afghanistan in the closest of the matches in this Asia Cup. More importantly, Pakistan had ensured an India knock-out from the tournament. The celebrations were obvious.Afghanistan had been brilliant throughout the night with the ball. They made a target of 130 look like 180, and going into the final over, were deemed to be the winners with just one wicket remaining to be dismissed.Azalhaq Farooqi, who had a brilliant day, had picked up three crucial wickets in his first three overs and shared only 19 runs. But cricket is a leveler, as we have repeatedly seen in the tournament.Pakistan promotes Nawaz to 4; he becomes Man-Of-The-Match,Pakistan promotes Shadab to 5; he becomes Man-Of-The-Match.For the billionth time, flexible batting orders, matchups & low-value-wickets work in T20 cricket. So impressive to see Pakistan doing it.— Rehan Ulhaq (@Rehan_ulhaq) September 7, 2022For once, fans from three teams would have been glued to the screens, but the team that didn’t have the additional support, went on to win the match.Ideally, there is no talking point apart from Naseem Shah’s two sixes, but as a ritual, we have added four more.Naseem Shah’s game-changing sixesPakistan had lost nine wickets. Pakistan needed 11 runs in six balls. That is when the green army’s number 11 batter tonked two huge hits straight over the bowler’s head.The first one ensured tides on the sight screen curtain. The second one made Rashid Khan – fielding at long off – stretch like he was the Fantastic Four’s Reed Richards. Only he wasn’t and that sealed the game for Pakistan.Farooqi who was brilliant in the 18th over, missed the Yorkers by a few inches, maybe centimeters and the Naseem ensured to convert those into full toss to be smashed out of the park.Ravi Shastri designated Naseem as an all-rounder after the match, who was till then certified as a number 11.Afghanistan’s dynamic powerplayAfghanistan started the powerplay in a dramatic fashion as Hazratullah Zazai was beaten on the very first delivery from Naseem Shah. Pakistan discussed a review, but decided against it at the end.After a tidy first over, the second over was taken over the park with Gurbaz hitting back-to-back sixes off Mohammad Hasnain.Afghanistan tried to play at a brisk rate in the power play and hit four 4s and two 6s ending their powerplay on 48 runs, but also lost two wickets on the way.Haris Rauf broke Gurbaz’s furniture first up in the fourth over and Hasnain repeated what Rauf had started six balls later, bowling out Zazai.What a match! We couldn’t have asked for a bigger thriller 🤩Congratulations Pakistan 🇵🇰 on an unbelievable victory, and advancing into the FINALS of the DP World #AsiaCup 2022 🔥👏#AFGvPAK #ACC #GetReadyForEpic pic.twitter.com/RhtpuOXWh4— AsianCricketCouncil (@ACCMedia1) September 7, 2022Pakistan’s economic bowlingPakistan had already shown the might of their bowling in the group stage when they took India to the last over in a chase of 148 and then bundled Hong Kong for 38 runs in the second match.In another important contest, Pakistan restricted Afghanistan to a below-par 129, despite a good score in the first half of the innings.Afghanistan had 72/2 on the board after 10 overs. But Pakistan choked the Afghan middle order and lower order as they could manage only 57 runs in the last 10 overs. If you think that’s bad, 10 runs of those 57 had come in the last over.None of the bowlers went more than 9 runs per over, with 8.5 economy of Mohammad Hasnain being the worst of the lot.Babar Azam’s continued poor runBabar Azam came into the tournament as the world’s number one batter but has been in very poor form since the start, failing to exceed 14 that came in the Super four stage match against India.To add to the misery, Babar was dismissed for a golden duck against Afghanistan after a good length delivery from Fazalhaq Farooqi remained a bit low and plumbed him LBW.His scores so far have been 9, 10, 14, and 0 summing up to 33 in four innings.Hearth break for Afghanistan 💔@fazalfarooqi10 conceded two sixes in two balls as Afghanistan lost the match by 1 wicket. 😣#AfghanAtalan | #AsiaCup2022 | #AFGvPAK pic.twitter.com/7eJQlxRcPv— Afghanistan Cricket Board (@ACBofficials) September 7, 2022Afghanistan’s spinners spin a webDespite a low score, Afghan spinners spun a web around the Pakistan batters and never allowed them to get off the hook as they combined to give runs at less than six per over and scalped two important wickets in the middle overs.Mujeeb Ur Rahman was excellent bowling three overs in the powerplay and giving just five runs. He ended his spell with figures of none for 12.Veteran Rashid Khan, on the other hand, was at his excellent best as he dismissed Mohammad Rizwan in the ninth over and then Shadab Khan in the 17th over. He ended his four over with figures of 2/ 25 which would have been far lesser had he been not smashed for two sixes on either side of Shadab Khan’s wicket.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 19:18:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Pak-vs-Afg-talking-points.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Afghanistan Asia Cup 2022: 'It reminded me of Miandad's six', says Babar Azam on Naseem's heroics with bat","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-afghanistan-asia-cup-2022-it-reminded-me-of-miandads-six-says-babar-azam-on-naseems-heroics-with-bat-11205561.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan vs Afghanistan Asia Cup 2022: 'It reminded me of Miandad's six', says Babar Azam on Naseem's heroics with bat","content":"Pakistan clinched their second win in the Super 4 stage of the Asia Cup 2022 against Afghanistan in a close encounter. The Babar Azam-led side has now registered a place in the final and will play Sri Lanka in the title clash on Sunday. With Pakistan’s win, India and Afghanistan have been knocked out of the tournament.Needing 11 in the final over while chasing 130 with one wicket in hand, Pakistan went over the line with four balls to spare as Naseem Shah hammered two sixes on the trot to finish off the game.Pakistan captain Babar Azam lauded Naseem for his efforts and also hailed the bowlers for their performance.“To be honest, the dressing room was very tensed. The team was walking in and out of the dressing room. Excellent with the way Naseem Shah finished it off. Sharjah is always low-scoring, and Mujeeb and Rashid Khan are two of the best bowlers. We just wanted to take the match deep. The way we started with the ball was excellent. In our batting, we didn’t execute ‘t our plans very well, but Naseem was outstanding. I didn’t expect this as such, but in the back of my mind, I have seen Naseem play like this earlier, and I had some belief. This moment reminds me of Javed Miandad’s six. We would like to continue this momentum and not repeat our mistakes,” Babar said during the post-match presentation.UNBELIEVABLE FINISH! 🤩Pakistan are through to the Asia Cup final💪#AsiaCup2022 | #AFGvPAK pic.twitter.com/T2KGjTmo5k— Pakistan Cricket (@TheRealPCB) September 7, 2022Afghanistan skipper admitted that the side’s bowling and fielding were brilliant but they failed to hold the nerves right till the end.“Yes the bowling and the fielding were brilliant, but we didn’t finish well and we didn’t hold our nerves. We didn’t leave the game at any stage. The boys fought on every ball. Again, it was the end, both with the bat and with the ball. We thought that we chased well against Bangladesh. We knew it would be tough chasing 130 here, and that’s why we looked to bowl dot balls. We didn’t give easy singles. The plan on the last two deliveries was to bowl slower bouncers or bowl yorkers, but he (Farooqi) didn’t execute his plans. We will try our best to play the last game with the same energy,” Nabi said.Earlier, Pakistan had ridden on a superb bowling performance to restrict Afghanistan to 129/6 in 20 overs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 19:12:11","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Naseem-Shah-Babar.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Afghanistan vs Bangladesh Asia Cup 2022: Heated altercation between Asif Ali and Fareed Ahmad; Watch video","link":"https://www.firstpost.com/firstcricket/sports-news/afghanistan-vs-bangladesh-asia-cup-2022-heated-altercation-between-asif-ali-and-fareed-ahmad-watch-video-11205521.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Afghanistan vs Bangladesh Asia Cup 2022: Heated altercation between Asif Ali and Fareed Ahmad; Watch video","content":"Pakistan batsman Asif Ali was involved in a heated spat with Afghanistan’s Fareed Ahmad during the two nations’ during closely-contested Asia Cup 2022 Super Four match in Sharjah on Wednesday.The incident happened during the 19th over of the match when the match was at a crunch stage with 12 runs needed of just eight balls for Pakistan to win the match. In the prior delivery, Ali already shot the left-arm pacer for a six over mid-on and was eager to capitalise further from the momentum gained from the maximum.Fareed, however, got the better of the Pakistani right-hander in the fifth ball of the over by bowling a slow short-ball that took a top edge of Asif’s wildly swinging bat for a safe catch by Karim Janat. The fielder, standing at short fine-leg, ran backward to ensure the tricky catch.Filled with emotions at that point, pacer Ahmad exulted, in a bit exaggerated fashion, in front of the departing batter. The gesture was responded by a shove from Asif before turning his back to the Afghan for the pavilion. Ahmad was next seen walking toward Asif while uttering some words in an animated manner. Ali certainly didn’t like what he heard and turned to almost hit the Afghan pacer with his bat before getting a hold at his nerve.No one would like it the way Farooqi teased Asif Ali and karma paid him instantly. #PakvsAfg #PAKvAFG #Afghanistan #NaseemShah #asifali pic.twitter.com/GiJIkg2d1u— Suhail Khan (@suhail_Lucknow) September 7, 2022However, the damage was visually done by this point as the official broadcaster’s Hindi commentator Aakash Chopra could be heard saying that Ali has found himself trouble through his aggressive gestures and could face a game ban.If inflicted, Ali will miss the Asia Cup final against Sri Lanka as Pakistan eventually defeated Afghanistan to confirm their final ticket.It took back-to-back sixes by tailender Naseem Shah in the first two balls of the 20th over that ensured their win. Pacer Fazalhaq Farooqi was at the receiving end and as the left-arm pacer was at blame for bowling two full tosses for Shah to take Pakistan to 131/9 while chasing 130.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 18:59:54","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Asif-Ali-Farid-Ahmad-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Remember the name': Twitterati hail Naseem Shah as he takes Pakistan into Asia Cup 2022 final with win over Afghanistan","link":"https://www.firstpost.com/firstcricket/sports-news/remember-the-name-twitterati-hail-naseem-shah-as-he-takes-pakistan-into-asia-cup-2022-final-with-win-over-afghanistan-11205531.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'Remember the name': Twitterati hail Naseem Shah as he takes Pakistan into Asia Cup 2022 final with win over Afghanistan","content":"Pakistan defeated Afghanistan in a nail-biting Super 4 encounter at the Asia Cup 2022 by one wicket. Needing 11 in the final over with just one wicket in hand, Naseem Shah hammered two maximums to seal the win for his side.Pakistan lost wickets at regular intervals during the chase but it was Shadab Khan who held the fort at one end and chipped in with 36 runs in 26 deliveries which included three sixes and a four.Invited to bat, Afghanistan posted 129 for six with Ibrahim Zadran top-scoring with a 37-ball 35. Pakistan chased down the target with four balls to spare, reaching 131 for 9 in 19.2 overs. Shadab Khan top-scored for Pakistan with 36 while Iftikhar Ahmed made 30.For Afghanistan, Fareed Ahmad and Fazalhaq Farooqi took three wickets apiece while Rashid Khan got two.The result meant that India and Afghanistan were out of the reckoning for the final to be played on Sunday as they are winless from two matches. With four points each, Pakistan and Sri Lanka qualified for the title clash.Always knew that my brother is made up for something special, and this was very special @iNaseemShahA team full of stars. Best of luck for the final Team Pakistan!— Shaheen Shah Afridi (@iShaheenAfridi) September 7, 2022 The victory sprintMan of the moment @iNaseemShah #AsiaCup2022 | #AFGvPAK pic.twitter.com/JRzjL5GbmE— Pakistan Cricket (@TheRealPCB) September 7, 2022 UNBELIEVABLE FINISH!Pakistan are through to the Asia Cup final#AsiaCup2022 | #AFGvPAK pic.twitter.com/T2KGjTmo5k— Pakistan Cricket (@TheRealPCB) September 7, 2022 Unbelievable!! What a match— Shoaib Akhtar (@shoaib100mph) September 7, 2022 Remember the name Naseem Shah❤️. #AsiaCup2022Final— Shahnawaz Dahani (@ShahnawazDahani) September 7, 2022 Dear Naseem Shah! @iNaseemShah You made us all proud today. What a Remarkable innings, you have played that led Pakistan Team to an unforgettable Victory, which will be remembered for long. Keep shinning and keep holding Pakistan Flag aloft. Pakistan Zindabad. pic.twitter.com/0uC8Z30hJB— Abid Ali (@AbidAli_Real) September 7, 2022 That’s the brand of cricket we are known for, Pakistan cricket at its best. What a thriller! @iNaseemShah you rocked brother. Well played @76Shadabkhan @IftiAhmed221 and the entire team #PAKvAFG— Fawad Alam (@iamfawadalam25) September 7, 2022(Inputs from PTI)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 18:59:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/PAK-vs-AFG-Twitter.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"AFG vs PAK fight: Asif Ali vs Afghanistan fight with Fareed Ahmad takes ugly turn in Sharjah as Pakistan win a nerve-thriller","link":"https://thesportsrush.com/cricket-news-afg-vs-pak-fight-asif-ali-vs-afghanistan-fight-with-fareed-ahmad-takes-ugly-turn-in-sharjah-as-pakistan-win-a-nerve-thriller/","keywords":["Cricket","Afghanistan","Asia Cup 2022","Asif Ali","Fareed Ahmad","Pakistan"],"creator":["Gurpreet Singh"],"video_url":null,"description":"AFG vs PAK fight: Asif Ali and Fareed Ahmad involve themselves in an ugly on-field spat, as Pakistan reach the finale of Asia Cup 2022. Yet another Asia Cup 2022 match. Yet another edge-of-the-seat humdinger. Pakistan have defeated Afghanistan by 1 wicket at the Sharjah Cricket Stadium, in what was a low-scoring thriller, to go… The post AFG vs PAK fight: Asif Ali vs Afghanistan fight with Fareed Ahmad takes ugly turn in Sharjah as Pakistan win a nerve-thriller appeared first on The SportsRush.","content":"AFG vs PAK fight: Asif Ali and Fareed Ahmad involve themselves in an ugly on-field spat, as Pakistan reach the finale of Asia Cup 2022. Yet another Asia Cup 2022 match. Yet another edge-of-the-seat humdinger. Pakistan have defeated Afghanistan by 1 wicket at the Sharjah Cricket Stadium, in what was a low-scoring thriller, to go through to the grand finale of the continental championship, scheduled to be played on September 11. A perfect see-saw battle with Afghanistan nearly turning the tide in their favour during the final four Overs, ended with a couple of scintillating Sixes of Naseem Shah’s bat, with Pakistan needing 11 runs off the final six deliveries. Defending a modest target of 130 runs, and despite the wicket being challenging to bat on, the Afghan left-arm pacers – Fareed Ahmad Malik (4-0-31-3) and Fazalhaq Farooqi (3.2-0-31-3) were the show stealers with the ball, in a side which is known for its experienced spin bowling trio. With 21 runs required off 12 deliveries, it was Fareed Malik picking the wickets of Haris Rauf (0 off 1) and most importantly the danger man Asif Ali (16 off 8) after conceding a Six in the 19th Over, that turned the bout in Afghanistan’s ‘D’, until Naseem decided to swing his axe. AFG vs PAK fight The peak moment of the chase arrived during the aforementioned Over, after a pumped up Malik, in all the adrenaline rush, perhaps had a word or two after dismissing Asif, which soon snowballed in a heated argument between the two, with Asif even threatening to hit the left-arm pacer with his bat before heading towards the dressing room. While both of them continued with their verbal ding-dong, it were the rest of the players from both the sides who had to intervene and pacify the two. The fight between Asif Ali and the Afghan bowler Very unfortunate #PAKvAFG pic.twitter.com/AQzxurWNB7 — Nadir Baloch (@BalochNadir5) September 7, 2022 No one would like it the way Farooqi teased Asif Ali and karma paid him instantly. #PakvsAfg #PAKvAFG #Afghanistan #NaseemShah #asifali pic.twitter.com/GiJIkg2d1u — Suhail Khan (@suhail_Lucknow) September 7, 2022 Post winning the match, a pumped up Naseem Shah, went for a victory 100 meters dash around the field, while also getting rid of his helmet, gloves, and the bat in the process, as the rest of his team mates joined him as well from the dressing room. This celebration by Naseem Shah was so beautiful. Love the passion pic.twitter.com/bDSQTMowkM — Haroon (@hazharoon) September 7, 2022 For more Cricket-related news, click here. The post AFG vs PAK fight: Asif Ali vs Afghanistan fight with Fareed Ahmad takes ugly turn in Sharjah as Pakistan win a nerve-thriller appeared first on The SportsRush.","pubDate":"2022-09-07 18:18:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pakistan beat Afghanistan in last-over thriller, knock India out of Asia Cup 2022","link":"https://www.firstpost.com/firstcricket/sports-news/pakistan-vs-afghanistan-live-cricket-score-asia-cup-updates-commentary-streaming-11203721.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Pakistan beat Afghanistan in last-over thriller, knock India out of Asia Cup 2022","content":"Pakistan Vs Afghanistan LIVE SCORE (t20) Quick Scorecard Full scorecard Ball by ball commentary FP commentary Pakistan Vs Afghanistan At Sharjah Cricket Stadium, Sharjah, 07 September, 2022 07 September, 2022 Starts 19:30 (IST) Match Ended Afghanistan 129/6 (20.0 ov) Super Four - Match 4 Pakistan 131/9 (19.2 ov) Pakistan beat Afghanistan by 1 wicket Live Blog Afghanistan Pakistan 129/6 (20.0 ov) - R/R 6.45 131/9 (19.2 ov) - R/R 6.78 Match Ended Pakistan beat Afghanistan by 1 wicket Mohammad Hasnain - 0 Naseem Shah - 13 This Over Batting Status R B 4s 6s Naseem Shah not out 14 4 0 2 Mohammad Hasnain not out 0 0 0 0 Bowling 0 M R W Fazalhaq Farooqi 3.2 0 31 3 Current Partnership Last Wicket 118/9 (18.5) 13 (13) R/R: 26 Mohammad Hasnain 0(0) Naseem Shah 13(3) Asif Ali 16(8) S.R (200) c Karim Janat b Fareed Ahmad Pakistan beat Afghanistan in last-over thriller, knock India out of Asia Cup 2022 Pakistan vs Afghanistan, Asia Cup 2022 Super 4, HIGHLIGHTS: Pakistan etched a win by one wicket in a final over thriller against Afghanistan. With this win, Pakistan have knocked India and Afghanistan out of the tournament Live Updates Highlights 23:27 (IST) Shadab Khan was adjudged Player of the match for his performance. That's it from our end for this game. Hope you enjoyed our coverage. Stay with us for all the LIVE UPDATES from the tournament Full Scorecard 23:13 (IST) PAK vs AFG LIVE SCORE Pakistan's win has knocked India and Afghanistan out of the tournament Full Scorecard 23:00 (IST) PAK vs AFG LIVE SCORE SIX! Farooqi bowls another full toss as he comes round the wicket. Naseem Shah deposits that over long off again. Pakistan have won it. They won by 1 wicket Full Scorecard 22:59 (IST) PAK vs AFG LIVE SCORE SIX! Farooqi bowls a full toss and Naseem Shah hammers that over long off Full Scorecard 22:56 (IST) PAK vs AFG LIVE SCORE WICKET! Fareed alters the length, bowls that short and Asif Ali top edges that while going for the pull. Karim Janat back paddles and takes a good catch Full Scorecard 22:55 (IST) PAK vs AFG LIVE SCORE SIX! Fareed comes round the wicket, bowls that full and Asif Ali hammers that over long on for a maximum Full Scorecard 22:50 (IST) PAK vs AFG LIVE SCORE WICKET! Fareed castles Haris Rauf. He is gone for zero off the first ball. Length ball, outside off from the bowler, Rauf tries to pull that but only plays it back on to the stumps as the ball takes the inside edge Full Scorecard 22:48 (IST) PAK vs AFG LIVE SCORE WICKET! Second wicket in the over for Farooqi. He bowls it full, outside off and Khushdil Shah just plays that on to his stumps while trying to negate it to the off side. Pakistan have lost 7 wickets now Full Scorecard 22:43 (IST) PAK vs AFG LIVE SCORE WICKET! What a fine delivery from Farooqi at this time. He bowls that touch fuller, slow and straight. Nawaz is deceived with the pace as it hits his back pad. The umpire gives that out but the left-hander has gone upstairs. The DRS shows three reds and Pakistan lose 6 now Full Scorecard 22:38 (IST) PAK vs AFG LIVE SCORE SIX! Asif Ali gets into the act as he hammers that fuller and quicker delivery over mid-wicket for a maximum Full Scorecard Load More Highlights 22:56 (IST) PAK vs AFG LIVE SCORE WICKET! Fareed alters the length, bowls that short and Asif Ali top edges that while going for the pull. Karim Janat back paddles and takes a good catch 22:50 (IST) PAK vs AFG LIVE SCORE WICKET! Fareed castles Haris Rauf. He is gone for zero off the first ball. Length ball, outside off from the bowler, Rauf tries to pull that but only plays it back on to the stumps as the ball takes the inside edge 22:48 (IST) PAK vs AFG LIVE SCORE WICKET! Second wicket in the over for Farooqi. He bowls it full, outside off and Khushdil Shah just plays that on to his stumps while trying to negate it to the off side. Pakistan have lost 7 wickets now 22:43 (IST) PAK vs AFG LIVE SCORE WICKET! What a fine delivery from Farooqi at this time. He bowls that touch fuller, slow and straight. Nawaz is deceived with the pace as it hits his back pad. The umpire gives that out but the left-hander has gone upstairs. The DRS shows three reds and Pakistan lose 6 now 22:37 (IST) PAK vs AFG LIVE SCORE WICKET! Here's a wicket that Afghanistan wanted. Rashid once again tosses this up, outside off and Shadab tries for a big stroke, miscues it and that's a good catch from Azmatullah Omarzai on the off side 22:27 (IST) PAK vs AFG LIVE SCORE WICKET! Here's the wicket that Afghanistan were looking for. Fareed comes round the wicket, bowls that short and Iftikhar goes for the pull but hits it straight to the man at deep mid-wicket 21:56 (IST) PAK vs AFG LIVE SCORE WICKET! That's a massive wicket. Mohammad Rizwan has been trapped in front of the stumps by Rashid Khan. The spinner brings that one into the right-hander as Rizwan tries to push that to the on side but misses the ball and it hits his pads. The umpire has given that out but he goes upstairs. The DRS shows three reds which means Rizwan will have to walk back 21:34 (IST) PAK vs AFG LIVE SCORE WICKET! This is the last thing that Pakistan needed. Fakhar Zaman calls for a quick single after pushing one to the off side from Mujeeb but Najibullah charges in from extra cover, picks it quickly and hits the bull's eye at the non-striker's end 21:22 (IST) PAK vs AFG LIVE SCORE WICKET! Fazalhaq Farooqi has the big one. He has trapped Babar Azam in front of the stumps for a first-ball zero. The left-hander bowls that touch fuller and straight as Babar goes on the back foot but is not able to negotiate that to the on side and the ball hits the pads. The umpire raises his finger 20:44 (IST) PAK vs AFG LIVE SCORE WICKET! Another one bites the dust. Afghanistan are on the back foot now. Ibrahim Zadran has to walk back. Haris Rauf bangs that short on the middle stump line as Zadran tries to give himself some room but the ball hurries on to him, takes the outside edge and rest is done by the wicket-keeper behind 20:34 (IST) PAK vs AFG LIVE SCORE WICKET! Afghanistan lose two in two now. Mohammad Nabi has been undone by Naseem Shah. A touch back of the length delivery from the youngster, outside off and Nabi tries to negotiate that late to the third man but only manages to play it on to the stumps 20:31 (IST) PAK vs AFG LIVE SCORE WICKET! This time he has found the fielder. Shadab Khan bowls that in the slot as Najibullah Zadran takes the aerial route but doesn't time his stroke well and is caught by Zaman at long on 20:22 (IST) PAK vs AFG LIVE SCORE WICKET! Nawaz has the breakthrough. He removes Janat after the batter has been caught by Fakhar Zaman while trying for a slog sweep. He miscues the stroke and has to walk back 19:56 (IST) PAK vs AFG LIVE SCORE WICKET! Hasnain finally gets a wicket. He bowls that a bit slow, full and into the stumps as he comes round the wicket to Zazai. The left-hander has been castled and Afghanistan are two down now 19:50 (IST) PAK vs AFG LIVE SCORE WICKET! Haris Rauf provides the much-needed breakthrough to Pakistan. He bowls that touch fuller, outside off, angling into the right-hander a bit and Gurbaz who tries to play across the line gets a thin inside edge as the ball hits the off stump. He has to depart Pakistan vs Afghanistan, HIGHLIGHTS: Rizwan was trapped in front of the stumps by Rashid. AP Pakistan vs Afghanistan, Asia Cup 2022 Super 4, HIGHLIGHTS: Pakistan etched a win by just one wicket in a final over thriller against Afghanistan. With this win, Pakistan have knocked India and Afghanistan out of the tournament PREVIEW : Pakistan will be up against Afghanistan in the Super 4 match of the Asia Cup 2022 in Sharjah. The Babar Azam-led side is coming into this game with a win against India in their first Super 4 stage match while the Afghan side suffered a loss against Sri Lanka. A defeat in this game will mean curtains to their campaign. Also, of Pakistan defeat Afghanistan, it will also bring Team India’s tournament to a close as well as The Men in Blue have already lost to Pakistan and Sri Lanka. SQUADS: Pakistan: Mohammad Rizwan(w), Babar Azam(c), Fakhar Zaman, Khushdil Shah, Iftikhar Ahmed, Shadab Khan, Asif Ali, Mohammad Nawaz, Haris Rauf, Mohammad Hasnain, Naseem Shah, Usman Qadir, Haider Ali, Hasan Ali, Shahnawaz Dahani Afghanistan: Hazratullah Zazai, Rahmanullah Gurbaz(w), Ibrahim Zadran, Mohammad Nabi(c), Najibullah Zadran, Karim Janat, Samiullah Shinwari, Rashid Khan, Naveen-ul-Haq, Mujeeb Ur Rahman, Fazalhaq Farooqi, Hashmatullah Shahidi, Afsar Zazai, Fareed Ahmad Malik, Usman Ghani, Azmatullah Omarzai, Noor Ahmad Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: September 07, 2022 23:31:53 IST Tags: Asia Cup 2022 Cricket Pakistan Vs Afghanistan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-09-07 18:01:53","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/AFG-vs-PAK-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"PlayCricket Roadshow and Perth Scorchers mascot Blaze the dragon to visit the Great Southern","link":"https://thewest.com.au/news/albany-advertiser/playcricket-roadshow-and-perth-scorchers-mascot-blaze-the-dragon-to-visit-the-great-southern--c-8157825","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"The roadshow aims to promote entry-level cricket to parents of five to 10-year-olds while promoting the existing local junior competition.","content":null,"pubDate":"2022-09-07 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8157825/79220841d552d7ac2a146feee552554c52dd459a-16x9-x0y63w1200h675.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Twitter Reacts As Pakistan Crush India's Asia Cup 2022 Final Hopes By Defeating Afghanistan - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMihQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vYXNpYS1jdXAtMjAyMi90d2l0dGVyLXJlYWN0cy1hcy1wYWtpc3Rhbi1jcnVzaC1pbmRpYXMtYXNpYS1jdXAtMjAyMi1maW5hbC1ob3Blcy1ieS1kZWZlYXRpbmctYWZnaGFuaXN0YW4v0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Twitter Reacts As Pakistan Crush India's Asia Cup 2022 Final Hopes By Defeating Afghanistan  Cricket AddictorAsia Cup Highlights: Naseem's back-to-back sixes helps PAK beat AFG, into final  Hindustan TimesLIVE Score PAK vs AFG Asia Cup 2022 Dubai: IND, AFG Knocked Out As PAK Clinch Thriller  Cricket Country NewsPakistan reach Asia Cup final and extinguish India's hopes  Gulf NewsPAK vs AFG Asia Cup 2022 Highlights: Naseem Shah sixes in last over takes Pakistan home  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-09-07 17:57:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Can India reach Asia Cup final 2022: How can India qualify for Asia Cup final?","link":"https://thesportsrush.com/cricket-news-can-india-reach-asia-cup-final-2022-how-can-india-qualify-for-asia-cup-final/","keywords":["Cricket","Afghanistan","asia cup","Asia Cup 2022","India","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Can India reach Asia Cup final 2o22: The qualification criteria wasn’t in India’s hands after two consecutive losses. During the 10th match of the ongoing 15th edition of Asia Cup between Pakistan and Afghanistan in Sharjah, Pakistan beat Afghanistan by 1 wicket in a nail-biting contest. Maintaining a winning streak against Afghanistan wasn’t the most… The post Can India reach Asia Cup final 2022: How can India qualify for Asia Cup final? appeared first on The SportsRush.","content":"Can India reach Asia Cup final 2o22: The qualification criteria wasn’t in India’s hands after two consecutive losses. During the 10th match of the ongoing 15th edition of Asia Cup between Pakistan and Afghanistan in Sharjah, Pakistan beat Afghanistan by 1 wicket in a nail-biting contest. Maintaining a winning streak against Afghanistan wasn’t the most simplest of tasks for Pakistan as Afghanistan almost beat them. A proper last-over thriller had required Pakistan to score 11 runs off six balls with a solitary wicket in hand. Batting only for the second time in this format, Pakistan fast bowler Naseem Shah held his nerve with the bat in hand as his back-to-back sixes off Afghanistan fast bowler Fazalhaq Farooqi powered his team to a hard-fought victory. Naseem Shah. — Ian Raphael Bishop (@irbishi) September 7, 2022 While Fareed Ahmed and Farooqi picked three wickets, Rashid Khan dismissed a couple of batters to keep the opposition in check while defending a paltry 130-run target. The fact that Afghanistan managed to not put up a strong fight and not let Pakistan run away with a low-scoring chase is in itself a victory for them. Last of the four Asia Cup 2022 matches at the Sharjah Cricket Stadium, it wasn’t just a contest to watch for cricketing reasons but was also an archetype box-office clash which also witnessed emotions getting the batter of players from both the teams. Can India reach Asia Cup final 2022? India, who desperately needed Pakistan to lose both their matches for them to qualify for Asia Cup 2022 final to be played in Dubai on Sunday, have been official knocked out of the tournament after this match. Irrespective of whether India beat Afghanistan in their last match tomorrow, they will not be able to qualify for the next round. With both Sri Lanka and Pakistan winning a couple of Super 4 matches, they will also be playing the final apart from their last match of this round on Friday. The post Can India reach Asia Cup final 2022: How can India qualify for Asia Cup final? appeared first on The SportsRush.","pubDate":"2022-09-07 17:56:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Asia Cup points table: Pakistan ensure place in final with Sri Lanka; knock India out of the tournament","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-points-table-pakistan-edge-india-in-thriller-to-collect-first-points-in-super-four-stage-11150751.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup points table: Pakistan ensure place in final with Sri Lanka; knock India out of the tournament","content":"Dubai: After another nail-biting thriller Pakistan defeated Afghanistan with Naseem Shah hitting two big sixes in the first two balls of the last over.The two out-of-the-park hits also ensured India’s ouster from the Asia Cup as Pakistan and Sri Lanka have both won two games each in the Super Four stage.Sri Lanka defeated India in a thrilling contest that went down till the last over after beating Afghanistan in a similar fashion.Earlier, in another last-over thriller, Pakistan got the better of rivals India, with Iftikhar Ahmed scoring the winning runs to collect their first two points of the Super Four stage.The next two matches between India and Afghanistan, and between Sri Lanka and Pakistan will not have any bearing on the points table.Here is a look at the Super 4s points table after the first match –TeamMatchesWonLostPointsNRRSri Lanka2204+0.351Pakistan2204 +0.241India2020-0.125Afghanistan2020-0.452Asia Cup group stage resultsAfghanistan beat Sri Lanka by eight wicketsIndia beat Pakistan by five wicketsAfghanistan beat Bangladesh by seven wicketsIndia beat Hong Kong by 40 runsSri Lanka beat Bangladesh by 2 wicketsPakistan beat Hong Kong by 155 runsAsia Cup group stage points table –Group ATeamMatchesWonLostPointsNRRIndia (Q)2204+1.096Pakistan (Q)2112+3.811Hong Kong2020-4.875 Group BTeamMatchesWonLostPointsNRRAfghanistan (Q)2204+2.467Sri Lanka (Q)2112-2.233Bangladesh2020-0.576Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 17:52:30","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Pakistan-points-table.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Afghanistan Highlights Asia Cup 2022 Super Four: PAK Beat AFG in a Last-over Thriller, IND Out - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMiwQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvcGFraXN0YW4tdnMtYWZnaGFuaXN0YW4tbGl2ZS1zY29yZS1jcmlja2V0LXVwZGF0ZXMtc3RyZWFtaW5nLXQyMC1hc2lhLWN1cC0yMDIyLXN1cGVyLWZvdXItcGFrLXZzLWFmZy1sYXRlc3Qtc2NvcmVjYXJkLXRvZGF5LXNoYXJqYWgtbGl2ZW5ld3MtNTkwOTY1OS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs Afghanistan Highlights Asia Cup 2022 Super Four: PAK Beat AFG in a Last-over Thriller, IND Out  News18Asia Cup Highlights: Naseem's back-to-back sixes helps PAK beat AFG, into final  Hindustan TimesLIVE Score PAK vs AFG Asia Cup 2022 Dubai: IND, AFG Knocked Out As PAK Clinch Thriller  Cricket Country NewsAfghanistan vs Pakistan, Asia Cup 2022, Highlights: India Out As Pakistan Beat Afghanistan To Set Up Final With Sri Lanka  NDTV SportsPakistan reach Asia Cup final and extinguish India's hopes  Gulf NewsView Full coverage on Google News","content":null,"pubDate":"2022-09-07 17:51:57","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup Live: PAK need 11 from 6 balls vs AFG in Sharjah Super 4 clash - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiwAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9wYWtpc3Rhbi12cy1hZmdoYW5pc3Rhbi1saXZlLWNyaWNrZXQtc2NvcmUtYXNpYS1jdXAtMjAyMi1zdXBlci00LXBhay12cy1hZmctdDIwLW1hdGNoLXRvZGF5LWxhdGVzdC1zY29yZWNhcmQtc2hhcmphaC1jcmlja2V0LXN0YWRpdW0tMTAxNjYyNTQ5ODEwNTIwLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Asia Cup Live: PAK need 11 from 6 balls vs AFG in Sharjah Super 4 clash  Hindustan TimesLIVE Score PAK vs AFG Asia Cup 2022 Dubai: Rashid Gets Shadab As Match Back To Life  Cricket Country News\"Occupational Hazards\": Ex-India Batter On India's Approach In T20Is  NDTV SportsPAK vs AFG: Pakistan skipper Babar Azam dismissed for golden duck, video goes viral  DNA IndiaPAK vs AFG Asia Cup 2022 Live Score Updates: India hopes alive as Pakistan need 12 from 8 balls  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-09-07 17:22:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Stokes hails team spirit as England seek to win six Tests in one summer for first time since 2004","link":"https://247newsaroundtheworld.com/sports/stokes-hails-team-spirit-as-england-seek-to-win-six-tests-in-one-summer-for-first-time-since-2004/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World There was a certain irony in Ben Stokes talking about the huge… The post Stokes hails team spirit as England seek to win six Tests in one summer for first time since 2004 appeared first on 247 News Around The World.","content":"247 News Around The World 247 News Around The World There was a certain irony in Ben Stokes talking about the huge role team spirit has played in England’s Test transformation on the day Alex Hales returned to the white-ball fold. Certainly, the England captain’s insistence that the off-field dynamic between a team clearly getting on extremely well has been crucial to a run of five victories in six Tests is at odds with the World Cup call-up of a man exiled for three years over ‘trust issues’. So, while pragmatism reigns in a white-ball team understandably keen to go for the short-term fix that Hales might bring in Australia in the sudden absence of Jonny Bairstow, Stokes will continue advocating the virtues of Test togetherness. England captain Ben Stokes hopes that togetherness will bring a triumphant end to a summer ‘It’s very important for groups to be able to spend time away from cricket grounds,’ said Stokes ahead of Thursday’s deciding Test against South Africa in response to a question about England’s players spending time together on the golf course in the 11 day break since the last Test. ‘It gives you that feel to play for each other a bit more. You’re always going to go out and try to do well but if you manage to connect like we have this summer it resonates with what you want to do out there for the team.’ Now Stokes hopes that togetherness will bring a triumphant end to a summer when England, with near evangelical zeal, have re-written the Test playbook and proved it, at a pivotal time, to once again be the best, most entertaining and fulfilling form of the game. Stokes believes England’s all-out attacking style – ‘even with rain around we won’t be playing for a draw in this game,’ he said – is bringing new supporters to cricket and that is the perfect antidote to ECB gambling the sport’s future on the Hundred and Sir Andrew Strauss planning to reduce the amount of red-ball County Championship cricket. Stokes takes part in practice on Wednesday ahead of the third Test against South Africa Victory at the Kia Oval would see England’s best Test summer since Michael Vaughan’s team of 2004 won all seven games and confirm an extraordinary renaissance after a run of just one victory in 17 Tests under Joe Root and Chris Silverwood. ‘That shows a massive progression over a short space of time and it’s been amazing to be part of,’ said Stokes. ‘The whole nation has enjoyed watching us play because sometimes they don’t know what they’re going to get. It’s always going to be entertaining whether we lose or win so it’s great. ‘I guess when you first come up with something you’re not sure of the response but it’s been amazing how quickly everybody bought in to the way we want to play.’ To claim that decisive victory England will have to overcome the absence of Bairstow, ruled out in such freak circumstances breaking his ankle during one of those games of golf, but at least they have a replacement richly deserving of an overdue debut in Harry Brook. Stokes believes team spirit has been crucial to a run of five victories in six Tests The Yorkshireman plays having averaged in excess of a hundred in the Championship earlier this season and after making 140 against South Africa for the Lions at Canterbury ahead of this series in an innings which featured six sixes. And while South Africa captain Dean Elgar testily dismissed that knock, when Brook took spinner Keshav Maharaj apart, and said ‘this is Test cricket, he’s in the big league now’ Stokes has no doubts Brook, at 23, is ready for the ultimate elevation. ‘There’s just things that stand out about certain players, like the time they have at the crease and the shots they play, and Harry has shown this summer the skill he has,’ said Stokes before, with a smile, assessing Brook’s personality in the dressing room. ‘He’s chilled, keeps himself to himself and just does what he does. He’s a bit dumb, if I can say that, but he’s such a good player. I’ve been called dumb a lot so that’s fine!’ Stokes has no doubts batsman Harry Brook (above), at 23, is ready to make the step up At the other end of the scale Jimmy Anderson and Stuart Broad play today with no signs of another end of season glorious Oval exit in sight and their absence from last winter’s tour of the West Indies looking more and more inexplicable. Stokes is delighted with how both have responded to his brave new world and expects them to be around at least until next year’s Ashes. ‘I honestly just can’t see a point where they decide it’s time for them to step away,’ said the captain. ‘Jimmy has come out and said how much fun he’s having and Broady’s influence in the dressing room is the best I’ve seen while playing with him over the years. The conversations he has not only with me but the bowlers and how he wants to help them is something he’s taken to another level. It’s great to see Jimmy at 40 and Broady at 36 having such a new lease of life in the dressing room.’ The only subject Stokes appeared less than enthusiastic about was the return of Hales but he could have vetoed that if he felt strongly enough as there is no way Jos Buttler and Rob Key would have gone against the wishes of their most important player. But Stokes is putting the Twenty20 team’s interests first by taking a pragmatic view and he deserves as much credit for that as the truly important work he is doing for Test cricket. Victory at the Kia Oval would cap England’s best Test summer since 2004 Post source: Daily mail The post Stokes hails team spirit as England seek to win six Tests in one summer for first time since 2004 appeared first on 247 News Around The World.","pubDate":"2022-09-07 17:14:50","image_url":null,"source_id":"247newsaroundtheworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"“It’s pretty much like a World Cup final for us”: Dean Elgar exclaims South Africa are ready to give their best to win the final Test and series vs England","link":"https://thesportsrush.com/cricket-news-its-pretty-much-like-a-world-cup-final-for-us-dean-elgar-exclaims-south-africa-are-ready-to-give-their-best-to-win-the-final-test-and-series-vs-england/","keywords":["Cricket","Dean Elgar","South Africa tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Dean Elgar exclaims South Africa will give it their all to have the result in their favour during the final Test match versus England. After being humbled by an innings during the first Test match at the iconic Lord’s Cricket Ground, the Ben Stokes-led side bounced back in Manchester during the second Test versus South… The post “It’s pretty much like a World Cup final for us”: Dean Elgar exclaims South Africa are ready to give their best to win the final Test and series vs England appeared first on The SportsRush.","content":"Dean Elgar exclaims South Africa will give it their all to have the result in their favour during the final Test match versus England. After being humbled by an innings during the first Test match at the iconic Lord’s Cricket Ground, the Ben Stokes-led side bounced back in Manchester during the second Test versus South Africa, to draw level the three-match Test series 1-1. After more than a week gap, the two sides will play a possible series decider from Thursday onwards, with the final match of the series at the Kennington Oval in London. While it were the the South African seamers who bowled as their skipper Dean Elgar expected them to turn out at Lord’s, the English seamers did the trick for England during the second Test, to make way for a spicy finish to the series. The series decider is so close #ENGvSA #BePartOfIt pic.twitter.com/N6z5JkmsPI — Cricket South Africa (@OfficialCSA) September 7, 2022 Dean Elgar exclaims South Africa will play the Test like a World Cup final On the match eve, Dean Elgar remarked that his side will give it their all to have a match result during the third Test, despite rain threatening to make an appearance. Exclaiming the ongoing tour to be his biggest test in his captaincy career, Elgar stated that the final Test match will be like playing a World Cup final. “There’s definitely going to be a winner in this Test, no doubt,” Elgar said. “Going into the Test 1-1, it’s pretty much like a World Cup final for us. That’s the way I’m viewing it. We’re going in with a result in mind and we’re going to give our best effort for that. We can’t control the weather but I’m pretty confident there will be a result in this game. “It’s the biggest Test so far in my captaincy. I think the players sense that. We’ve got to play every game like it’s your last and I think this one of those where you have to empty the tank. You can’t leave anything behind. You’ve got to leave everything on that field. It’s huge. It’s massive for us,” remarked Elgar. The South African skipper has confirmed that Ryan Rickelton would come into the side in place of the injured Rassie van der Dussen for the Test. The post “It’s pretty much like a World Cup final for us”: Dean Elgar exclaims South Africa are ready to give their best to win the final Test and series vs England appeared first on The SportsRush.","pubDate":"2022-09-07 16:45:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Australia Mohali tickets cost: Mohali Cricket Stadium ticket price PCA Stadium T20","link":"https://thesportsrush.com/cricket-news-india-vs-australia-mohali-tickets-cost-mohali-cricket-stadium-ticket-price-pca-stadium-t20/","keywords":["Cricket","Australia","Australia tour of India 2022","India","PCA Stadium Mohali"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs Australia Mohali tickets cost: A total of seven different price categories have been arranged for fans to pick from. Former India spinner Harbhajan Singh and all-rounder Yuvraj Singh are all in readiness of joining a long list of cricketers who have a stand (or an end or the whole stadium) inside a cricket… The post India vs Australia Mohali tickets cost: Mohali Cricket Stadium ticket price PCA Stadium T20 appeared first on The SportsRush.","content":"India vs Australia Mohali tickets cost: A total of seven different price categories have been arranged for fans to pick from. Former India spinner Harbhajan Singh and all-rounder Yuvraj Singh are all in readiness of joining a long list of cricketers who have a stand (or an end or the whole stadium) inside a cricket stadium named after them. Harbhajan and Yuvraj, two most successful cricketers from Punjab, might be seen in some sort of a felicitation ceremony before the first India vs Australia T20I in Mohali on September 20. This match will be the first international match after renaming of a couple of stands at the Punjab Cricket Association Stadium. Senior of the two players, Harbhajan had called time on his international career last year. Having played 367 matches for India between 1998-2016, Harbhajan had picked 711 wickets across formats to be the 13th highest wicket-taker in world cricket. Yuvraj, on the other hand, played represented India in 402 matches scoring 11,778 runs across formats including 17 centuries and 71 half-centuries. The southpaw had called time on a 17-year old career in 2019. “In a historic decision, the PCA executive committee, under president Gulzar Inder Chahal, has decided to name the Terrace Block and North Pavillion stands after legendary Indian cricketers Harbhajan Singh and Yuvraj Singh, respectively,” PCA secretary Dilsher Khanna was quoted as saying by The Indian Express. “Both have been icons for Punjab as well as Indian cricket and fans as well players will be inspired on seeing the stands being named after these two cricketers.” India vs Australia Mohali tickets cost In addition to the PCA confirming that both online and offline tickets for India-Australia T20I will be put on sale for general public on September 11, they have also revealed the ticket prices for this content. It is noteworthy that a total of seven price categories have been arranged for 11 blocks/stands. As far as the offline counters outside the stadium are concerned, only student tickets worth INR 300 will be sold over there in the first phase. Students, however, will have to carry with them a valid student identification card to be eligible for tickets at a discounted price. Stand Price Enclosures/Boxes (Level 2) INR 10,000 Elite Lounge (Level 3) IND 7,500 Enclosures/Boxes (Level 1) INR 7,500 Harbhajan Singh Stand INR 5,000 Yuvraj Singh Stand INR 2,000 VIP (East) Block 1 INR 1,500 VIP (West) Block 1 INR 1,500 VIP (East) Block 2 INR 1,500 Chair (West) Block 1 INR 1,000 Student tickets INR 300 VIP (West) Block INR 300 The post India vs Australia Mohali tickets cost: Mohali Cricket Stadium ticket price PCA Stadium T20 appeared first on The SportsRush.","pubDate":"2022-09-07 16:45:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Duleep Trophy: ‘I'm looking forward to start from zero again’, says Ajinkya Rahane ahead of the domestic season","link":"https://www.firstpost.com/firstcricket/sports-news/duleep-trophy-im-looking-forward-to-start-from-zero-again-says-ajinkya-rahane-ahead-of-the-domestic-season-11205161.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Duleep Trophy: ‘I'm looking forward to start from zero again’, says Ajinkya Rahane ahead of the domestic season","content":"Indian middle-order batter Ajinkya Rahane said that he is looking to have a new beginning and not looking at his past performances and prospects of playing again for India.Rahane last played a high-profile competitive match in the Indian Premier League 2022 but had to leave midway after sustaining a hamstring injury. He also had to miss the knockout stages for Mumbai in the Ranji Trophy.However, Rahane has recovered from the injury and is ready to make a comeback to the field.Read: From Ajinkya Rahane to Shreyas Iyer, plenty of Indian players to be in action“The recovery has been good. I was in NCA for a couple of months. The NCA staff and BCCI looked after me really well. I’m completely fit, and this is my first game after injury,” Rahane said ahead of the Duleep Trophy starter on 8 September, wherein he will lead the West Zone.Rahane said that he will start from zero and not think of his future or past.“It [the domestic season] is really important. I’m looking forward to start from zero again. For me, I don’t want to think about my past or future; it’s about being in the moment, and that’s why I said I want to start from zero again. You always get goosebumps when you go on the field, and I always like that feeling.“When you get that goosebumps, you get the motivation – whichever game you’re playing, whether it is a domestic game or international game. That feeling should be there. That feeling is still there, and I’m really excited about this season, starting with Duleep Trophy [sic].”Excitement Levels 🆙 as the Domestic season commences! 👏 👏Just One Sleep Away From #DuleepTrophy! ⌛️ pic.twitter.com/bzd5CwQ5Kq— BCCI Domestic (@BCCIdomestic) September 7, 2022Rahane was dismissed for a duck in the last Ranji Trophy match he played for Mumbai. He appreciated the support he received from NCA staff during his rehabilitation.“We will see what happens in the future, but I believe it’s important to be in the moment and focus on what’s in hand right now rather than focus on your future,” Rahane added. “It took me two months to get fit. I had to follow a strict diet and routine for these two months, but it was really good, and the staff were really positive. I’m out of that now. [I] just want to be fit throughout the season, and keep scoring runs,” he further said.Rahane has not had significant training sessions after his recovery and was only training indoors in Mumbai.“This [at Chepauk] was just my second session outdoors. I was just batting indoors in Mumbai, so I’m not thinking too far ahead or thinking too much about my batting. I [have] got the experience, but it is important to be in the moment and respect the opponents and respect the conditions wherever we are playing, and then take it from there,” Rahane concluded.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 16:08:56","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Ajinkya-Rahane.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Afghanistan vs Pakistan, Asia Cup 2022, Live Updates: Mohammad Rizwan On The Charge, Pakistan Two Down vs Afghanistan - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMihAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9hc2lhLWN1cC0yMDIyL3Bha2lzdGFuLXZzLWFmZ2hhbmlzdGFuLWFzaWEtY3VwLTIwMjItc3VwZXItZm91ci1tYXRjaC00LXBhay12cy1hZmctbGl2ZS1zY29yZS11cGRhdGVzLTMzMjM5NjHSAYoBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vYXNpYS1jdXAtMjAyMi9wYWtpc3Rhbi12cy1hZmdoYW5pc3Rhbi1hc2lhLWN1cC0yMDIyLXN1cGVyLWZvdXItbWF0Y2gtNC1wYWstdnMtYWZnLWxpdmUtc2NvcmUtdXBkYXRlcy0zMzIzOTYxL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Afghanistan vs Pakistan, Asia Cup 2022, Live Updates: Mohammad Rizwan On The Charge, Pakistan Two Down vs Afghanistan  NDTV SportsAsia Cup Live: AFG strike again after Babar's golden duck, PAK 2 down in chase  Hindustan TimesLIVE Score PAK vs AFG Asia Cup 2022 Dubai: PAK Jolted Early, Babar Out For A Golden Duck  Cricket Country News\"Occupational Hazards\": Ex-India Batter On India's Approach In T20Is  NDTV SportsMatch Preview - Afghanistan vs Pakistan, Asia Cup 2022, 10th Match, Super Four  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-09-07 16:05:12","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes speaks out on Alex Hales’ England recall ahead of T20 World Cup","link":"https://metro.co.uk/2022/09/07/cricket-ben-stokes-reacts-alex-hales-england-recall-t20-world-cup-17319212/","keywords":["Cricket","Ben Stokes","Cricket World Cup","England cricket","Jonny Bairstow"],"creator":["Louis Sealey"],"video_url":null,"description":"Hales has replaced Jonny Bairstow in England's T20 World Cup squad.","content":"Alex Hales has been added to England’s T20 World Cup squad (Pictures: Getty) Ben Stokes has spoken out on England’s decision to recall Alex Hales for the T20 World Cup. Hales has not played for England since being dropped on the eve of the 2019 World Cup because of an ‘off-field incident’. The Nottinghamshire opener, who helped Trent Rockets win The Hundred at Lord’s last weekend, was suspended after failing a test for recreational drug use. Former England captain Eoin Morgan said there had been a ‘breakdown in trust’ that meant he could not play in the 2019 World Cup, despite being a key player in the side leading up to the tournament. Hales has been in international wilderness for more than three years but was recalled to the white-ball squad on Wednesday as an injury replacement for Jonny Bairstow, who injured his left leg while playing golf last week. As well as replacing Bairstow in the T20 World Cup squad, Hales has been added to the England squad for the tour of Pakistan later this month. ‘Everyone’s goal is to win that World Cup for England,’ Test captain Stokes said when asked about Hales’ recall. ‘It’s an injury which presents an opportunity to someone else. Hales has made 141 appearances for England (Picture: Getty) ‘Alex is definitely one of the best T20 players in the world and unfortunately after what happened with Jonny we had to pull another guy up. ‘Alex is definitely one of the guys bowlers don’t want to be bowling at in the T20 format.’ Stokes and Hales are said to have a strained relationship after both were involved in a late night brawl in Bristol in 2017. But Stokes has played down Hales’ previous issues in the England set-up, adding: ‘I’ve not been in the leadership capacity in the white-ball group for however long. I’ve obviously been resting and stuff like that. ‘But when it comes down to the big moments in games and World Cup games, knockout games, you want your best players there to be taking that pressure on and he certainly is one of those.’ While Hales was not included in England’s initial T20 World Cup squad, director of cricket Rob Key previously insisted the door was open for the batter to return. ‘I spoke to Alex Hales, he rang me actually, and he argued why he wasn’t there and I think that’s quite right too,’ Key said after England’s first squad announcement last week. ‘I much prefer when these people pick up the phone and say, “come on then, why wasn’t I there?” Jonny Bairstow will miss the T20 World Cup after injuring himself while playing golf (Picture: Getty) ‘I have a huge amount of respect for that as opposed to people who go behind the scenes moaning about why they’ve not been picked. ‘I’ve said on a number of occasions that I feel Alex Hales has served his time for his misdemeanours. Now it’s on form, selection, and whether we feel they are the best person to go out there.’ Hales made 141 appearances for England before being exiled, scoring seven centuries and 22 fifties in white-ball cricket. The 33-year-old has been in superb form this summer, smashing 374 runs in the T20 Blast at a strike-rate of 193 and 259 runs in The Hundred at 152. MORE : Trent Rockets crowned men's Hundred champions after winning low-scoring thriller MORE : Oval Invincibles defend women's Hundred title as Capsey stars in routine win For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 15:45:33","image_url":"https://metro.co.uk/wp-content/uploads/2022/09/comp-1662563832.png","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Road Safety World Series 2022 tickets: How to book tickets for Green Park Cricket Stadium Kanpur Road Safety matches?","link":"https://thesportsrush.com/cricket-news-road-safety-world-series-2022-tickets-how-to-book-tickets-for-green-park-cricket-stadium-kanpur-road-safety-matches/","keywords":["Cricket","Road Safety World Series 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Road Safety World Series 2022 tickets: The second edition of the tournament will feature a total of eight teams from eight countries. Defending champions India Legends will take on the South African Legends in the opening match of the second edition of Road Safety World Series on September 10, at the Green Park Stadium in… The post Road Safety World Series 2022 tickets: How to book tickets for Green Park Cricket Stadium Kanpur Road Safety matches? appeared first on The SportsRush.","content":"Road Safety World Series 2022 tickets: The second edition of the tournament will feature a total of eight teams from eight countries. Defending champions India Legends will take on the South African Legends in the opening match of the second edition of Road Safety World Series on September 10, at the Green Park Stadium in Kanpur. A total of eight teams from eight different nations will take on each other in the tournament across 23 matches, with the grand finale scheduled to take place on October 1. While Mumbai and Raipur were the two Indian cities which hosted the tournament’s inaugural season last year, four cities – Raipur, Dehradun, Kanpur, and Raipur will host the matches this year. The first seven matches will take place at the Green Park in Kanpur. The Holkar Stadium in Indore will host the next five matches, The action for the next six games will move towards the Rajiv Gandhi International Stadium in Dehradun. The last two matches of the league stage, and all the knock out matches, including the grand finale, will take place at the Shaheed Veer Narayan Stadium, in Raipur. Always keep your mind on the drive, hands on the wheel and eyes on the road! 🤛🏻🙌🏻 excited to be part of the @RSWorldSeries 🔥 see you there! @India__Legends 💙 @YUVSTRONG12 #RoadSafetyWorldSeries #RSWS #Cricket #IndiaLegends #Cricket #yuvrajsingh #T20I pic.twitter.com/IaoaDLxCc9 — Road Safety World Series (@RSWorldSeries) September 7, 2022 Tickets for the opening match and the six following matches at the Green Park Stadium in Kanpur, are already up for sale at the online ticket booking platform BookMyShow.com . The minimum price value of a ticket featuring the India Legends commences from INR 300, and goes all the way to INR 2,500, depending on the best available view from the stands. The minimum ticket price for the five other matches involving seven other teams begin from INR 150. At a time, a minimum of one ticket, and a maximum of 10 tickets can be booked via the online platform. The interested fans can book their tickets by clicking here . Post this step, one will have to choose the number of tickets one needs to book, and select the price category with the seating map displayed on the right of the screen.","pubDate":"2022-09-07 15:36:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PAK vs AFG Asia Cup 2022 Live Score Updates: Nabi departs, Afghanistan six down - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9wYWtpc3Rhbi12cy1hZmdoYW5pc3Rhbi1hc2lhLWN1cC0yMDIyLWxpdmUtc2NvcmUtdXBkYXRlcy04MTM2ODczL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"PAK vs AFG Asia Cup 2022 Live Score Updates: Nabi departs, Afghanistan six down  The Indian ExpressAsia Cup Live Score: Rauf shines as PAK restrict AFG to 129/6, Target 130  Hindustan Times\"Occupational Hazards\": Ex-India Batter On India's Approach In T20Is  NDTV SportsLIVE Score PAK vs AFG Asia Cup 2022 Dubai: PAK Need 130 Runs To Book Final Berth  Cricket Country NewsIND vs PAK: When You Have High-Risk Approach, On Odd Occasion Wickets Will Fall At Worst Possible Time – Sanjay Manjrekar On India's Approach  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-09-07 15:28:30","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Neeraj Chopra favourite to script history again with Zurich Diamond League 2022 Champion title awaiting","link":"https://www.firstpost.com/sports/neeraj-chopra-favourite-to-script-history-again-with-zurich-diamond-league-2022-champion-title-awaiting-11204711.html","keywords":["Sports"],"creator":["Aditya K Halder"],"video_url":null,"description":"Neeraj Chopra favourite to script history again with Zurich Diamond League 2022 Champion title awaiting","content":"India’s reigning Olympic Champion Neeraj Chopra is among the favourites to script history again on Thursday night as he could become the first Indian to win a Zurich Diamond League title.The Zurich grand final — after 12 rounds of Diamond League meets in the calendar year — started on Wednesday with the finest track and field stars from all around the globe competing at the Stadion Letzigrund.Javelin star Chopra booked his spot in Zurich in style by winning the Lausanne Diamond League with an 89.08-meter throw late last month. The victory marked the 24-year-old athlete’s return after a month-long injury lay-off that also forced him to miss Commonwealth Games.Chopra finished inside the required top-six finish with a fourth spot in the javelin throw standings. His first spot in Zurich (8 points) and second place in Stockholm (7 points with 89.94m throw) took his points tally to 15 points. Chopra didn’t participate in the two of the Diamond meets that included men’s javelin in Doha (13 May) and Silesia (6 August).Watch: Neeraj Chopra’s 89.08m throw that landed him top place in Lausanne Diamond LeagueNo Anderson Peters in the entry listWorld Champion Anderson Peters won’t feature in the finale despite finishing second in the standing. The 24-year-old Grenadian is expectedly yet to recover from the injury he sustained during an assault in his homeland days after beating Chopra to the Worlds title.This leaves the Indian with his five remaining rivals on the night in Jakub Vadlejch (Czech Republic), Julian Weber (Germany), Curtis Thompson (USA), Patriks Gailums (Latvia), and Leandro Ramos (Portugal).Vadlejch and Weber (finished first and second respectively in the standing) are two of the expected threats for Neeraj on the night.Vadlejch, a two-time Diamond League final winner, has years of experience behind him at the age of 31. The Czech, who took silver at Tokyo Olympics, is in good shape leading into the final as he has been consistently throwing 87m-plus this season. He also breached the 90m mark for the first time in his career. 90.88m — a personal best for him — came back in May during the Doha Diamond League.However, Chopra has a psychological edge over his Czech rival. At any competition the duo participated in since the Tokyo Olympics, Vadlejch has never got better off the Indian.Weber, on the other hand, is on a comeback trail this year as the 28-year-old German improved on his personal best twice this year since 2016 (88.29m) to 89.54m at the prestigious FBK Games back in June. Weber was also crowned the European Champion last month as he defeated Vadljech in Poland.🚀 GOLDEN BOY IN HUNT FOR THE DIAMOND TROPHY 💎Poster Boy of 🇮🇳 Athletics, Neeraj Chopra looks to add another achievement to his CV – A Diamond League Trophy. Can the Reigning Olympic Champion do it in his 3rd DL finals at the #ZurichDL ?⏰ 11.50pm, 8th Sept 📺 Voot pic.twitter.com/wnNIYHvsOd— SPORTS ARENA🇮🇳 (@SportsArena1234) September 7, 2022Is Chopra exhausted yet to throw 90m?Chopra’s recent form suggests the final is his for the taking and could end the international season on a high with a maiden 90m throw. The star came close to breaching the mark in Stockholm in late June with an 89.94m throw. He recorded 89.30m at Paavo Nurmi Games in the same month, to speak of the form Chopra has been this season. Subsequently, he hurled the javelin 88.13m for a historic silver medal at the World Championships in July.However, competing this late in the year is a bit of uncharted territory for the Olympic champion as the last time Chopra competed in September was back in 2018. Back then, he represented Asia at the now-defunct IAAF Continental Championships in Ostrava. He finished a lowly sixth at the event and came right after the highs of the Jakarta Asian Games, where he took the gold medal with a new national record throw of 88.06m.pic.twitter.com/IYWm0AlmVR— Neeraj Chopra (@Neeraj_chopra1) September 1, 2022However, it’s worth mentioning that one of his throws seemed 85-plus but landed outside the recordable sector, therefore was red flagged. At a national tournament in Jalandhar 10 days later, Chopra could only produce a throw of 83.90m, suggesting he had already peaked for the season.There were also some concerns over his fitness during the Lausanne event when he decided not to throw twice out of his eligible six throws to ensure he doesn’t risk another injury on return.But keeping in mind that the now-postponed Asian Games — originally slated 10-25 September — would have been part of the calendar year, Neeraj and his coach Bartonietz Klaus would have geared up for a longer season. And the opportunity to finish on a high with a historic title on Thursday certainly must have attracted the interest of a star athlete like Neeraj Chopra.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 15:20:20","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Neeraj-Chopra-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"'Sack Rohit Sharma' trends on Twitter as India captain's rude behaviour is called out by fans","link":"https://zeenews.india.com/cricket/asia-cup-2022-ind-vs-afg-sack-rohit-sharma-trends-on-twitter-as-india-captains-rude-behaviour-is-called-out-by-fans-2507114.html","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team fans are upset over their captain Rohit Sharma's behaviour on the field as he was caught showing his emotions in a loud manner on the cricket field","content":"Team India captain Rohit Sharma is facing the heat from the fans after Men in Blue lost to Sri Lanka in their second clash in Super 4 stage of Asia Cup 2022 on Tuesday (September) in Dubai. The captain of the Indian men's cricket team came under fire for many key decisions which he failed to take. One of them was picking a squad which lacks experience in the pace bowling department. Fans are also pointing out to his disastrous team selection as well as on-field decision making. There is a lot of debate whether Rishabh Pant should be playing as the first-choice wicketkeeper over proven match-winner Dinesh Karthik. The other 'bad' decision many fans think is picking KL Rahul as an opener when he is out of form. With Rahul sticking to his slow-starter approach with the bat, India's top 3 batter play the same way is the arguement. Fans and experts wan Suryakumar Yadav to bat at No 3 and maybe Ishan Kishan at the top of the batting lineup and Kohli batting at 4. Apart from these cricketing opinions, fans are also upset over Rohit showing his emotions in a loud manner on the cricket field. When Arshdeep dropped a catch during India vs Pakistan match, he yelled at him. A video clip went viral from India vs Sri Lanka where Rohit can be seen ignoring Arshdeep's suggestion. Indian fans began a hashtah #SackRohit to pour out their emotions after the end of the match. Take a look at the reactions here. Dropped DK, didn't give the ball to Hooda when Nawaz a lefty who was playing ,went on to bowl YUZI in powerplay and played games with only four specialist bowlers. Quite the reasons to sack Rohit Sharma from captaincy - From a Kohli fan who experienced these things _ #sackrohit pic.twitter.com/q8b8xFOL8X — Vishnu (@itsvishnu17) September 6, 2022 I don't care how many trophies Rohit has but he can never be a leader like Virat Kohli. #ViratKohli #captainkohli #viratkholi #ICC #SackRohit #AsiaCupT20 pic.twitter.com/Mp5ZopxoKW — Ankit Jha (@ankit_virat18) September 7, 2022 I have not seen this type of behavior from any previous indian captain in my entire life......now i can understand why in 2017 MSD recommended Kohli's name instead of Rohit sharma In fact, Dhoni knew that only Kohli could handle the entire Indian team. #SackRohit pic.twitter.com/RyNONgopiM — Virat.kohli (@Virat_champion) September 7, 2022 If India loses in VK's captaincy - Blame VK If India loses in MSD's captaincy - Blame MSD If India loses in Rohit's captaincy - Blame other players Pak B side SL D side Hong Kong Z side But we are still not able to play the final even after having the best team #SackRohit agree? — KL Rahul FC (@KLRahulZone) September 6, 2022 If India loses in VK's captaincy - Blame VK If India loses in MSD's captaincy - Blame MSD If India loses in Rohit's captaincy - Blame other players Pak B side SL D side Hong Kong Z side But we are still not able to play the final even after having the best team #SackRohit agree? — KL Rahul FC (@KLRahulZone) September 6, 2022 Rohit however sounded positive at the end of the match about India doing well further in this tournament as well as T20 World Cup 2022 set to take place in Australia next month. He said that there are no long terms worries for India but India needs to answer a few questions before the World Cup. \"No long term worries, we have lost only two games back to back. Since the last World Cup, we haven't lost too many games. These games will teach us. We wanted to put ourselves under pressure in the Asia Cup. We are still looking for answers,\" he said.","pubDate":"2022-09-07 15:15:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Duleep Trophy: From Ajinkya Rahane to Shreyas Iyer, plenty of Indian players to be in action","link":"https://www.firstpost.com/firstcricket/sports-news/duleep-trophy-from-ajinkya-rahane-to-shreyas-iyer-plenty-of-indian-players-to-be-in-action-11204951.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Duleep Trophy: From Ajinkya Rahane to Shreyas Iyer, plenty of Indian players to be in action","content":"BCCI’s zonal tournament – Duleep Trophy – is back in the domestic calendar after three long years, and several Indian stars will be seen in action over the course of five matches, starting on 8 September.The tournament will inaugurate the domestic calendar for the 2022-23 season and is being played in the inter-zonal format for the first time after 2014-15.The BCCI has also added a new team – North East Zone, besides the five regular zones in North, East, South, West, and Central.Multiple India and IPL stars will be seen in action over the course of three weeks. While the West Zone and South Zone are significantly star-studded, other teams will rely heavily on their domestic talent.The West Zone boasts of maximum Indian players including Ajinkya Rahane – who will also lead the side, Prithvi Shaw, Shreyas Iyer, Jaydev Unadkat, and youngster Yashasvi Jaiswal.The South Zone squad also has a significant number of stars, consisting of Captain Hanuma Vihari, Mayank Agarwal, Manish Pandey, and Devdutt Padikkal.Under-19 sensation Yash Dhull, and quick Navdeep Saini will be seen playing for North Zone, while IPL stars Riyan Parag, and Shahbaz Ahmed will be seen for East Zone.Excitement Levels 🆙 as the Domestic season commences! 👏 👏Just One Sleep Away From #DuleepTrophy! ⌛️ pic.twitter.com/bzd5CwQ5Kq— BCCI Domestic (@BCCIdomestic) September 7, 2022Considering the first leg of the tournament starting on Thursday, in Chennai and Puducherry, we share insights on several players to watch out for in the tournament.Ajinkya RahaneAjinkya Rahane will be one of the biggest names at the zonal tournament and the eyes of fans as well as selection officials will be glued to his performance.Rahane last played in the Test series against South Africa in January 2022. Subsequently, he was dropped for the test series against Sri Lanka and the rescheduled test match against England.Ajinkya Rahane said, “I believe in following my processes. My focus in on Duleep Trophy currently, we’ll see what happens in future”.— Mufaddal Vohra (@mufaddal_vohra) September 7, 2022Rahane had also continued his poor form in Ranji Trophy during March 2022 and was dismissed for a duck in the last match he played against Odisha.Rahane will have to perform exceptionally well to ensure a place back in the Indian side, with significant competition for his spot in the middle order. In fact, Shreyas Iyer, who replaced him in the Indian team will also be playing alongside in the Duleep Trophy.Shreyas IyerShreyas Iyer has shown good signs as a batter in the longest format for India but has failed to be a consistent run-scorer.Iyer was excellent in the two-match home series against Sri Lanka and won the man of the match award in the second match for his twin fifties. Iyer has already hit three half-centuries and one century in five Tests he has played so far and proved his mettle.However, the batter was criticised after falling to the short ball ploy against England in the rescheduled Test in July.While he is expected to get a longer run with the Indian squad, he will have to continue to better other middle-order batters in the domestic setup.Mayank AgarwalThe dashing Karnataka opener was in the limelight in recent times but for his performance in the newly set up Karnataka’s Maharaja T20 Trophy.Talking about his form in the longest format, he has found himself in and out of the Indian squad, based on the availability of other openers.He was roped in the Sri Lanka Tests and played both the Tests but managed a total of 59 runs in three innings. However, he has averaged 41.33 in 21 Tests for India.With Rohit Sharma being the all-format captain and KL Rahul assigned to be his deputy, the possibilities of another opener getting a chance are quite low unless one of the two are unavailable.Hence, the current domestic season will prove to be a vital stage for Agarwal to cement his place in the national squad and prove to be a worthy replacement for the senior pros.Hanuma VihariHanuma Vihari has proved to be a significant name in the national setup for quite a while now. His leadership skills will come to test as he tries to unlock the next chapter in his cricketing career.While he has not been amongst the runs, he has played some vital innings in the Indian middle order.Vihari moved to Andhra Pradesh in the 2022 Ranji season and was named the captain of the side as well.The right-hander has scored 889 runs in 16 Tests for India at an average of 33.56. However, several of his impactful innings like the one at Brisbane against Australia have increased his stature in the Indian setup.Always have something to chase 💥 pic.twitter.com/pUHBjsE4xZ— Shreyas Iyer (@ShreyasIyer15) September 7, 2022Prithvi ShawPrithvi Shaw has been like the Indian opener who never was. After getting an opportunity in the Test team in 2018 against West Indies, and also winning the player of the series award, he was banned for eight months after failing a dope test.He did make a comeback in 2020 against New Zealand and Australia, but could only make a half-century in six innings and was dropped henceforth.Shaw was decent in the 2022/23 Ranji season and scored 355 in 10 innings at an average of 35.50. There are no significant chances of him making to the Indian squad in immediate future, but he can surely grab some eyeballs if he is able to perform well.Devdutt PaddikalThe 2020/21 Royal Challengers Bangalore sensation is yet to prove himself in the longer format of the game.The southpaw has 1,190 runs at an average of 36.06 in 19 First class games. While he has been inconsistent, a solitary century – 178 runs against Puducherry in the 2022 season brought him up the ranks in the domestic setup.Albeit, with already strong competition in the Indian Test setup for the top order as well as middle order, Paddikal is not expected anytime soon in the national squad.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-07 15:06:36","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/01/Rahane-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}