{"newsArray":[{"title":"Labuschagne banks on familiarity with Pakistan attack ahead of subcontinent tour","link":"https://sportstar.thehindu.com/cricket/australia-tour-of-pakistan-marnus-labuschagne-excited-to-face-pak-bowlers-subcontinent-conditons/article38390957.ece","keywords":null,"creator":["Ayan Acharya"],"video_url":null,"description":"“Hopefully, everything goes smoothly, and we get out there and play some awesome cricket and bring [international] cricket back to Pakistan, which I am sure the people over there will enjoy,” Labuschagne said.","content":null,"pubDate":"2022-02-07 05:57:28","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"When Lata Mangeshkar rescued BCCI post 1983 WC win","link":"https://www.sentinelassam.com/sports-news/when-lata-mangeshkar-rescued-bcci-post-1983-wc-win-576898","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"When Kapil Dev lifted the 1983 World Cup at the Lord’s balcony, the erstwhile BCCI president and one of the powerful ministers in the Indira Gandhi cabinet, late NKP Salve had a different worry.","content":"NEW DELHI: When Kapil Dev lifted the 1983 World Cup at the Lord's balcony, the erstwhile BCCI president and one of the powerful ministers in the Indira Gandhi cabinet, late NKP Salve had a different worry.It was still some years to go for economic liberalization and an astute businessman like Jagmohan Dalmiya's foresight to turn cricket into an industry. Kapil's Devils needed to be celebrated but the BCCI, which currently is looking at US$ 5 billion television contract, barely paid its cricketers a daily allowance of 20 pounds. Salve had to turn to his 'Man Friday' and Indian cricket's 'one stop Encyclopedia' Raj Singh Dungarpur for a solution to be able to reward the players for such an achievement. 'Raj bhai', as Dungarpur was known in Indian cricket circle, decided that the only way was to request his close friend and one of country's biggest cricket fans Lata Mangeshkar to do a pro-bono concert at the Jawaharlal Nehru Stadium in New Delhi. The venue was packed to capacity as Mangeshkar did a near two-hour programme. The event ensured that BCCI collected enough money and each of the 14 members got Rs 1 lakh each as cash award. \"It was a very decent sum in those days. We would otherwise save up tour money and daily allowance for that month and it came to barely Rs 60,000,\" Sunil Valson recollected. \"I remember some people said we will give you Rs 5000, some said Rs 10,000 and it was very disrespectful at times. But then Lata ji sang in that concert. What a function it was and one of the most memorable evenings to watch her sing live,\" Valson said. The BCCI and more so Dungarpur never forgot how Mangeshkar saved Indian cricket from sheer embarrassment just because of her pristine love for cricket. As a mark of respect, the BCCI till her death kept two complimentary VIP tickets allocated at any Indian stadium for her, where India played an international match. \"Just like we have quota for each match (before COVID era) for sponsors, state associations, there are two tickets at every cricket match for Lata ji,\" a senior BCCI official informed. The Mangeshkars were really cricket fans but one of the finest chroniclers of Mumbai cricket, senior journalist Makarand Waigankar recalls the days in 60s when Mangeshkar was a regular visitor at the Cricket Club of India's Brabourne Stadium and later at the Wankhede Stadium in 70s and 80s. \"Lata ji and her brother music composer Hridaynath Mageshkar were regulars at Test matches held at Brabourne Stadium. Later through the 70s she would hardly miss any game even with such busy recording schedule,\" Waingankar, who was a young journalist back then, recalled. Mangeshkar would sit alongside Dungarpur and former Mumbai legend and Test opener Madhav Apte and watch the proceedings. There is an old video of Mangeshkar also watching an India versus West Indies Test match in Chennai, where she must have gone for a recording back in 70s. She was very close to all Mumbai cricketers like Sunil Gavaskar, Dilip Vengsarkar and Sachin Tendulkar, who spoke about her with unmatchable humility and mother like respect. She would often drop in at the Cricket Club of India and enjoy cricketing discussion in the company of Dungarpur and another distinguished Test cricketer Hanumant Singh, who was the former's nephew. Tendulkar would often say that she saw Maa Saraswati in Mangeshkar. It's so poignant that the Nightangle of India left a day after Saraswati Puja. Agencies Also Read: Traffic In Mumbai Causes 3 Percent Divorces: Claims Devendra Fadnavis's WifeAlso Watch:","pubDate":"2022-02-07 05:42:40","full_description":"NEW DELHI: When Kapil Dev lifted the 1983 World Cup at the Lord's balcony, the erstwhile BCCI president and one of the powerful ministers in the Indira Gandhi cabinet, late NKP Salve had a different worry. It was still some years to go for economic liberalization and an astute businessman like Jagmohan Dalmiya's foresight to turn cricket into an industry. Kapil's Devils needed to be celebrated but the BCCI, which currently is looking at US$ 5 billion television contract, barely paid its cricketers a daily allowance of 20 pounds. Salve had to turn to his 'Man Friday' and Indian cricket's 'one stop Encyclopedia' Raj Singh Dungarpur for a solution to be able to reward the players for such an achievement. 'Raj bhai', as Dungarpur was known in Indian cricket circle, decided that the only way was to request his close friend and one of country's biggest cricket fans Lata Mangeshkar to do a pro-bono concert at the Jawaharlal Nehru Stadium in New Delhi. The venue was packed to capacity as Mangeshkar did a near two-hour programme. The event ensured that BCCI collected enough money and each of the 14 members got Rs 1 lakh each as cash award. \"It was a very decent sum in those days. We would otherwise save up tour money and daily allowance for that month and it came to barely Rs 60,000,\" Sunil Valson recollected. \"I remember some people said we will give you Rs 5000, some said Rs 10,000 and it was very disrespectful at times. But then Lata ji sang in that concert. What a function it was and one of the most memorable evenings to watch her sing live,\" Valson said. The BCCI and more so Dungarpur never forgot how Mangeshkar saved Indian cricket from sheer embarrassment just because of her pristine love for cricket. As a mark of respect, the BCCI till her death kept two complimentary VIP tickets allocated at any Indian stadium for her, where India played an international match. \"Just like we have quota for each match (before COVID era) for sponsors, state associations, there are two tickets at every cricket match for Lata ji,\" a senior BCCI official informed. The Mangeshkars were really cricket fans but one of the finest chroniclers of Mumbai cricket, senior journalist Makarand Waigankar recalls the days in 60s when Mangeshkar was a regular visitor at the Cricket Club of India's Brabourne Stadium and later at the Wankhede Stadium in 70s and 80s. \"Lata ji and her brother music composer Hridaynath Mageshkar were regulars at Test matches held at Brabourne Stadium. Later through the 70s she would hardly miss any game even with such busy recording schedule,\" Waingankar, who was a young journalist back then, recalled. Mangeshkar would sit alongside Dungarpur and former Mumbai legend and Test opener Madhav Apte and watch the proceedings. There is an old video of Mangeshkar also watching an India versus West Indies Test match in Chennai, where she must have gone for a recording back in 70s. She was very close to all Mumbai cricketers like Sunil Gavaskar, Dilip Vengsarkar and Sachin Tendulkar, who spoke about her with unmatchable humility and mother like respect. She would often drop in at the Cricket Club of India and enjoy cricketing discussion in the company of Dungarpur and another distinguished Test cricketer Hanumant Singh, who was the former's nephew. Tendulkar would often say that she saw Maa Saraswati in Mangeshkar. It's so poignant that the Nightangle of India left a day after Saraswati Puja. Agencies Also Read: Traffic In Mumbai Causes 3 Percent Divorces: Claims Devendra Fadnavis's Wife Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/07/308611-lata.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Sourav Ganguly, Shah hail Team India","link":"https://www.sentinelassam.com/sports-news/sourav-ganguly-shah-hail-team-india-576892","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"BCCI president Sourav Ganguly congratulated Team India for winning the ICC Under-19 Cricket World Cup 2022 at the Sir Vivian Richards Stadium, in Antigua on Saturday.","content":"NEW DELHI: BCCI president Sourav Ganguly congratulated Team India for winning the ICC Under-19 Cricket World Cup 2022 at the Sir Vivian Richards Stadium, in Antigua on Saturday.\"Congratulations to the under 19 team and the support staff and the selectors for winning the world cup in such a magnificent way...The cash prize announced by us of 40 lakhs is a small token of appreciation but their efforts are beyond value .. magnificent stuff..@bcci,\" Ganguly wrote on Twitter. India produced a clinical all-round performance to beat England by four wickets in the final. This is India's record fifth Under-19 World Cup title in tournament's history after previously winning it in 2000, 2008, 2012, 2018. \"I'm pleased to announce the reward of 40 lacs per player and 25 lacs per support staff for the U19 #TeamIndia contingent for their exemplary performance in #U19CWCFinal. You have made the Flag of India proud. @SGanguly99 @ThakurArunS @ShuklaRajiv,\" BCCI secretary Jay Shah tweeted. IANS Also Read: Traffic In Mumbai Causes 3 Percent Divorces: Claims Devendra Fadnavis's Wife Also Watch:","pubDate":"2022-02-07 05:32:57","full_description":"NEW DELHI: BCCI president Sourav Ganguly congratulated Team India for winning the ICC Under-19 Cricket World Cup 2022 at the Sir Vivian Richards Stadium, in Antigua on Saturday. \"Congratulations to the under 19 team and the support staff and the selectors for winning the world cup in such a magnificent way...The cash prize announced by us of 40 lakhs is a small token of appreciation but their efforts are beyond value .. magnificent stuff..@bcci,\" Ganguly wrote on Twitter. India produced a clinical all-round performance to beat England by four wickets in the final. This is India's record fifth Under-19 World Cup title in tournament's history after previously winning it in 2000, 2008, 2012, 2018. \"I'm pleased to announce the reward of 40 lacs per player and 25 lacs per support staff for the U19 #TeamIndia contingent for their exemplary performance in #U19CWCFinal. You have made the Flag of India proud. @SGanguly99 @ThakurArunS @ShuklaRajiv,\" BCCI secretary Jay Shah tweeted. IANS Also Read: Traffic In Mumbai Causes 3 Percent Divorces: Claims Devendra Fadnavis's Wife Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/07/308598-sourav.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Players still anxious about Pakistan tour","link":"https://thewest.com.au/sport/cricket/players-still-anxious-about-pakistan-tour-c-5599688","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Australia realise the importance of their upcoming cricket tour of Pakistan, but some players are nervous about the situation due to safety fears.","content":null,"pubDate":"2022-02-07 05:24:35","full_description":"The Australian Cricketers' Association is bracing for players to pull out of the tour of Pakistan due to safety concerns, despite reassurances about the situation. Australia last toured Pakistan in 1998, but the 24-year wait will end on March 4 when the three-Test series begins in Rawalpindi. The long-awaited tour will also feature three ODIs and one T20. Some players are still nervous about entering Pakistan due to safety fears. The onset of war in neighbouring Afghanistan in 2001 following the September 11 attacks in the US and a 2009 gunfire attack on a Sri Lanka team bus, meant Australia deemed a tour of Pakistan too risky until now. Instead, Pakistan have been forced to host Australia in the United Arab Emirates several times over the past two decades. Cricket Australia sent a delegation of staff to Pakistan in December along with government officials to determine whether it was safe for Australia to tour. Despite the tour being given the all-clear, ACA chief executive Todd Greenberg says there are some players who might pull out. \"Clearly there's some anxiety about touring, and that's perfectly natural given an Australian cricket team hasn't toured Pakistan for almost 25 years,\" Greenberg told SEN. \"I think we'll have a very full squad that will go. \"We may have one or two players that won't be comfortable despite all of the advice and guidance that we provide, and that's OK. \"Along with Cricket Australia, we'll need to respect those players and give them our full support if they decide not to make this tour.\" Greenberg said the tour of Pakistan was an important moment for international cricket. \"The players completely understand our contribution to the global game,\" he said. \"We don't have an expectation that we will sit here and expect teams to tour our country and not contribute ourselves. \"There's been an enormous amount of work on security detail and keeping players safe. That's priority No.1. \"On top of that is all the COVID protocols and the biosecurity rules and regulations.\"","image_url":"https://images.thewest.com.au/publication/C-5599688/0b12b416ee55a6939230a80d9f655fdf0f0ffe7e-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Players still anxious about Pakistan tour","link":"https://www.perthnow.com.au/sport/cricket/players-still-anxious-about-pakistan-tour-c-5599685","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Australia realise the importance of their upcoming cricket tour of Pakistan, but some players are nervous about the situation due to safety fears.","content":null,"pubDate":"2022-02-07 05:24:26","full_description":"The Australian Cricketers' Association is bracing for players to pull out of the tour of Pakistan due to safety concerns, despite reassurances about the situation. Australia last toured Pakistan in 1998, but the 24-year wait will end on March 4 when the three-Test series begins in Rawalpindi. The long-awaited tour will also feature three ODIs and one T20. Some players are still nervous about entering Pakistan due to safety fears. The onset of war in neighbouring Afghanistan in 2001 following the September 11 attacks in the US and a 2009 gunfire attack on a Sri Lanka team bus, meant Australia deemed a tour of Pakistan too risky until now. Instead, Pakistan have been forced to host Australia in the United Arab Emirates several times over the past two decades. Cricket Australia sent a delegation of staff to Pakistan in December along with government officials to determine whether it was safe for Australia to tour. Despite the tour being given the all-clear, ACA chief executive Todd Greenberg says there are some players who might pull out. \"Clearly there's some anxiety about touring, and that's perfectly natural given an Australian cricket team hasn't toured Pakistan for almost 25 years,\" Greenberg told SEN. \"I think we'll have a very full squad that will go. \"We may have one or two players that won't be comfortable despite all of the advice and guidance that we provide, and that's OK. \"Along with Cricket Australia, we'll need to respect those players and give them our full support if they decide not to make this tour.\" Greenberg said the tour of Pakistan was an important moment for international cricket. \"The players completely understand our contribution to the global game,\" he said. \"We don't have an expectation that we will sit here and expect teams to tour our country and not contribute ourselves. \"There's been an enormous amount of work on security detail and keeping players safe. That's priority No.1. \"On top of that is all the COVID protocols and the biosecurity rules and regulations.\"","image_url":"https://images.perthnow.com.au/publication/C-5599685/0b12b416ee55a6939230a80d9f655fdf0f0ffe7e-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Why did Justin Langer resign?","link":"https://www.theage.com.au/sport/cricket/why-did-justin-langer-resign-20220207-p59ucx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"How did a legend of Australian cricket end up quitting amid such bitterness? Why did the board offer him a six-month deal? Where does Pat Cummins stand? Justin Langer’s exit and its reasons explained.","content":null,"pubDate":"2022-02-07 05:18:34","full_description":"Justin Langer took over after the sandpaper scandal and finished with World Cup and Ashes victories. What on earth went wrong? In many ways the circumstances of his arrival were the seeds of his exit. He was appointed as a figurehead for the national team, a disciplinarian for the players and a spokesman for Australian cricket at a time of great crisis and upheaval. By the end of the 2019 Ashes series – and the Amazon documentary The Test – none of those preconditions existed anymore. From there it was a long, slow erosion of his position as the team evolved around him. Australia coach Justin Langer and captain Pat Cummins. Credit: Getty Why are Ricky Ponting and other players of his generation so angry? They believe, with some justification, that Langer has done more than enough in the role and across his life to deserve to hold a job he dearly wanted to keep. Their view of contemporary Australian cricket and the national men’s team is also largely judged by their own conversations with Langer, as a close friend, so it is understandable that they see things his way. Was Langer a victim of player power or of his own volatility? A combination of both, but it was a slow build-up over time, rather than the surprise or bombshell moment some have depicted it as. Langer was first asked to take a step back and allow the team to breathe during the 2018-19 summer, as depicted in The Test . He described 2019 as his “year of letting go”. Next there was internal feedback, directed through the high-performance department, that he had not done so enough and was still micromanaging the environment during the 2019 Ashes – albeit a tour during which he suffered health problems. Justin Langer. Credit: Getty Images Another instance took place after the 2020-21 home summer defeat to India, when the team struggled in biosecurity bubbles. When these calls for change were not sufficiently heeded during the white ball tours of West Indies and Bangladesh in the middle of last year, the chief executive Nick Hockley and then chair Earl Eddings held an emergency meeting with the team leaders Tim Paine, Aaron Finch and Pat Cummins to force frank talks with Langer that finally brought a significant change in approach over the final summer of his contract. These concerns were not only from players but multiple members of team staff over several years, dating back to 2018. Where does the new Test captain, Pat Cummins, stand in all this? During 2018, Cummins was injured and missed the first couple of tours Langer undertook as head coach. During that time, he resolved that after the Newlands scandal he needed to become a more senior and active presence in the dressing room. As such, he has watched the environment closely over subsequent years and as vice-captain, in particular, he would often be the avenue through which players or staff might discuss their views. He is on-record saying that an inclusive and welcoming environment, designed primarily to relieve pressure, is best for an international team. Cummins delivered his own feedback both in August last year and again when he and the white ball skipper Aaron Finch were spoken to prior to last week’s CA board meeting. Why didn’t CA offer Langer a longer-term deal? Because there was consensus among senior players, staff, CA’s executives and board directors that he was not the right coach for the team’s next four years, having helped it to mature and grow. That looks harsh to Langer and his supporters , but it is also a reality of sport that the best coach to help a team develop may not be the same as the one who takes advantage of that growth. OK, so why not just sack him? Langer made it clear by his decision not to announce his resignation during the Ashes that he preferred to fight for his job rather than have a guaranteed farewell “on a high” as he wrote in his exit email to Hockley. CA’s compromise was to offer a short-term deal and the chance to be publicly farewelled as coach during a home T20 World Cup campaign. As this was not the long-term deal he wanted, and also because he was exhausted by the job and the fight to keep it, Langer chose to quit. What now for Australian cricket and who’s in line to replace him? Right now, a lot of pain. Langer’s former teammates and a vast swathe of the public are exasperated by the decision, having been informed by CA’s own image-making over four years that Langer was the national team’s leader. Once that subsides, it will be very much on the players and staff to continue the performances they put on during the World Cup and the Ashes, after eventually and successfully compelling Langer to take a step back as coach. Andrew McDonald is the interim coach and looks able to claim the permanent job should he want it. Jason Gillespie, Trevor Baylis and McDonald’s fellow assistant Michael Di Venuto are other possible candidates. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Why did Justin Langer resign?","link":"https://www.smh.com.au/sport/cricket/why-did-justin-langer-resign-20220207-p59ucx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"How did a legend of Australian cricket end up quitting amid such bitterness? Why did the board offer him a six-month deal? Where does Pat Cummins stand? Justin Langer’s exit and its reasons explained.","content":null,"pubDate":"2022-02-07 05:18:34","full_description":"Justin Langer took over after the sandpaper scandal and finished with World Cup and Ashes victories. What on earth went wrong? In many ways the circumstances of his arrival were the seeds of his exit. He was appointed as a figurehead for the national team, a disciplinarian for the players and a spokesman for Australian cricket at a time of great crisis and upheaval. By the end of the 2019 Ashes series – and the Amazon documentary The Test – none of those preconditions existed anymore. From there it was a long, slow erosion of his position as the team evolved around him. Australia coach Justin Langer and captain Pat Cummins. Credit: Getty Why are Ricky Ponting and other players of his generation so angry? They believe, with some justification, that Langer has done more than enough in the role and across his life to deserve to hold a job he dearly wanted to keep. Their view of contemporary Australian cricket and the national men’s team is also largely judged by their own conversations with Langer, as a close friend, so it is understandable that they see things his way. Was Langer a victim of player power or of his own volatility? A combination of both, but it was a slow build-up over time, rather than the surprise or bombshell moment some have depicted it as. Langer was first asked to take a step back and allow the team to breathe during the 2018-19 summer, as depicted in The Test . He described 2019 as his “year of letting go”. Next there was internal feedback, directed through the high-performance department, that he had not done so enough and was still micromanaging the environment during the 2019 Ashes – albeit a tour during which he suffered health problems. Justin Langer. Credit: Getty Images Another instance took place after the 2020-21 home summer defeat to India, when the team struggled in biosecurity bubbles. When these calls for change were not sufficiently heeded during the white ball tours of West Indies and Bangladesh in the middle of last year, the chief executive Nick Hockley and then chair Earl Eddings held an emergency meeting with the team leaders Tim Paine, Aaron Finch and Pat Cummins to force frank talks with Langer that finally brought a significant change in approach over the final summer of his contract. These concerns were not only from players but multiple members of team staff over several years, dating back to 2018. Where does the new Test captain, Pat Cummins, stand in all this? During 2018, Cummins was injured and missed the first couple of tours Langer undertook as head coach. During that time, he resolved that after the Newlands scandal he needed to become a more senior and active presence in the dressing room. As such, he has watched the environment closely over subsequent years and as vice-captain, in particular, he would often be the avenue through which players or staff might discuss their views. He is on-record saying that an inclusive and welcoming environment, designed primarily to relieve pressure, is best for an international team. Cummins delivered his own feedback both in August last year and again when he and the white ball skipper Aaron Finch were spoken to prior to last week’s CA board meeting. Why didn’t CA offer Langer a longer-term deal? Because there was consensus among senior players, staff, CA’s executives and board directors that he was not the right coach for the team’s next four years, having helped it to mature and grow. That looks harsh to Langer and his supporters , but it is also a reality of sport that the best coach to help a team develop may not be the same as the one who takes advantage of that growth. OK, so why not just sack him? Langer made it clear by his decision not to announce his resignation during the Ashes that he preferred to fight for his job rather than have a guaranteed farewell “on a high” as he wrote in his exit email to Hockley. CA’s compromise was to offer a short-term deal and the chance to be publicly farewelled as coach during a home T20 World Cup campaign. As this was not the long-term deal he wanted, and also because he was exhausted by the job and the fight to keep it, Langer chose to quit. What now for Australian cricket and who’s in line to replace him? Right now, a lot of pain. Langer’s former teammates and a vast swathe of the public are exasperated by the decision, having been informed by CA’s own image-making over four years that Langer was the national team’s leader. Once that subsides, it will be very much on the players and staff to continue the performances they put on during the World Cup and the Ashes, after eventually and successfully compelling Langer to take a step back as coach. Andrew McDonald is the interim coach and looks able to claim the permanent job should he want it. Jason Gillespie, Trevor Baylis and McDonald’s fellow assistant Michael Di Venuto are other possible candidates. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Well left’: Cricket debate rages over video of bizarre dismissal in Tasmanian third grade","link":"https://www.foxsports.com.au/cricket/australia/cricket-news-2022-bizarre-footage-of-tasmanian-third-grade-match-sparks-heated-debate-wicket-after-batter-steps-away-video/news-story/5cb52c59b7f28fca02e1df45077ae570","keywords":null,"creator":null,"video_url":null,"description":"Footage of a Tasmanian batter’s unusual dismissal in a third grade fixture has sparked debate about the Laws of Cricket.","content":null,"pubDate":"2022-02-07 05:17:00","full_description":"Footage of a Tasmanian batter’s unusual dismissal in a third grade fixture has sparked debate about the Laws of Cricket. During a match against Lindisfarne in December 2020, Glenorchy was set a modest target of 98 for victory at University Oval. Facing the first ball of the run chase, Glenorchy opener Rajanbir Sandhu stepped away from his stance after Lindisfarne’s Bryan Scott had released the ball, which crashed into the stumps. Watch the CommBank Women‘s Ashes Series on Kayo. Every Test, T20 & ODI Live & On-Demand. New to Kayo? Start your free trial now > Despite Sandhu’s protests, the umpire had no problem awarding the dismissal, and he was heading back to the pavilion for a golden duck. It is commonplace in the sport for batters to step away from the crease during the bowler’s run-up due to a distraction, but Sandhu’s withdrawal was incredibly late. Law 20.4.2.5 states: “The striker is not ready for the delivery of the ball and, if the ball is delivered, makes no attempt to play it. Provided the umpire is satisfied that the striker had adequate reason for not being ready, the ball shall not count as one of the over.” MyCricket uploaded footage of Sandhu’s dismissal to Instagram on Saturday, and the comment section was inevitably flooded with comments, debating the legality of the wicket. Former Australian leg-spinner Cameron Boyce commented: “Too worried about the tekkers.” Former Ireland cricketer Niall O‘Brien tweeted: “See ya mate.” Some cricket fans pointed out that Sandhu looked up only moments before Scott released the ball, but most agreed that the umpire had made the right decision. Glenorchy ultimately won the match by four wickets, chasing the target in 16.4 overs. Scott finished with figures of 2/22 off four overs.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"CA’s desperate attempt to end cricket’s uncivil war","link":"https://www.cairnspost.com.au/sport/cricket/cricket-australia-to-reveal-reasonings-behind-justin-langer-decision-to-disgruntled-exstars/news-story/04a69df7c0e47e409f90b5748fe02afb","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Embattled Cricket Australia chief executive Nick Hockley will reach out to furious ex-players in a bid to calm the uncivil war which has divided the game.","content":null,"pubDate":"2022-02-07 05:00:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Painted as a monster' - Gilchrist slams Cricket Australia after Langer quits","link":"https://www.channelnewsasia.com/sport/painted-monster-gilchrist-slams-cricket-australia-after-langer-quits-2483461","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-07 04:56:03","full_description":"Former Australia captain Adam Gilchrist criticised Cricket Australia (CA) on Monday for their treatment of Justin Langer, saying the former head coach had been painted as a \"monster\". Langer resigned on Saturday, just weeks after leading Australia to a 4-0 Ashes series win over England, with Cricket Australia saying he had rejected a short-term extension of his contract. Australia also won last year's Twenty20 World Cup for the first time under Langer but there have been reports of player discontent over his coaching style. \"He's been painted by some particular people as a monster, that is not Justin Langer,\" Gilchrist told https://www.sen.com.au/news/2022/02/06/painted-as-a-monster-gilchrists-vehement-defence-of-langer Australian SEN Radio. \"He'll be the first to admit he has his frailties, he has his areas of weakness, but he'll sit and look you in the eye and work it out with you. \"So, to be painted as a monster, what sort of effect would that have on you personally and what's the flow-on effect to your family ... particularly through a period of time when you're not nearly understanding what is going on, the consistent innuendo and rumour.\" Cricket Australia did not immediately respond to a request for comment. In a LinkedIn post https://www.linkedin.com/feed/update/urn:li:activity:6896043102797213696 on Sunday, Langer said Cricket Australia offered him a short-term contract to lead the team's defence of the T20 World Cup title on home soil later this year but he opted not to accept it. \"If media reports are correct, several senior players and a couple of support staff don't support me moving forward, and it is now apparent the CA board and CEO, Nick Hockley, are also keen to see the team move in another direction,\" Langer said. \"I respect that decision,\" he said. \"My life has been built on values of honesty, respect, trust, truth, and performance and if that comes across as 'too intense' at times, I apologise.\" (Reporting by Manasi Pathak in Bengaluru; Editing by Robert Birsel)","image_url":null,"source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Gilchrist slams Cricket Australia, says Langer 'painted as a monster'","link":"https://sportstar.thehindu.com/cricket/adam-gilchrist-slams-cricket-australia-coach-justin-langer-resignation/article38390854.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Langer resigned, just weeks after leading Australia to a 4-0 Ashes series win over England, with Cricket Australia saying he had rejected a short-term extension of his contract","content":null,"pubDate":"2022-02-07 04:50:16","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Chris Silverwood Is A Good Coach, He Looked After Players, Says Moeen Ali","link":"https://sports.ndtv.com/cricket/chris-silverwood-is-a-good-coach-he-looked-after-players-says-moeen-ali-2753340","keywords":null,"creator":null,"video_url":null,"description":"England Cricket Board (ECB) on Thursday informed that men's coach Chris Silverwood has been relieved from his duties, after the Three Lions' debacle in Ashes.","content":null,"pubDate":"2022-02-07 04:44:06","full_description":"England all-rounder Moeen Ali said former head coach Chris Silverwood is a \"brilliant\" person, who looked after the players. England Cricket Board (ECB) on Thursday informed that men's coach Chris Silverwood has been relieved from his duties, after the Three Lions' debacle in Ashes. Moeen Ali said it's a shame that Silverwood is not with the England team now. \"One thing with Silverwood, he tries to look after the players and he's a brilliant person, he's a very good coach,\" ESPNcricinfo quoted Moeen Ali as saying. \"It's a shame he's obviously not there anymore but he's made lots of friends and he can go with a lot of respect because he was such a good guy,\" he added. Last month, Australia defeated England by 146 runs in the fifth Ashes Test at the Blundstone Arena on Sunday. With this win, Australia won the five-match Ashes 4-0 Promoted \"It's always sad when people leave, the guys are good guys and they've all done a great job, but at the end of the day everything is about results and we had a poor Ashes and these things happen,\" said Moeen while speaking about Silverwood. \"It's not a job forever. They tried to do the best for the players but these things happen when you have a bad tour like Australia, which is big for England, people then always after that get sacked, so it's very sad,\" he added.","image_url":"https://c.ndtvimg.com/2022-02/l54v1sg_chris-silverwood-afp_625x300_04_February_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Bizarre cricket footage sparks heated debate","link":"https://www.news.com.au/sport/cricket/bizarre-footage-of-tasmanian-third-grade-cricket-match-sparks-heated-debate/news-story/7a417e02220b04bb149293cc232d2947","keywords":null,"creator":null,"video_url":null,"description":"Footage of a Tasmanian batter’s unusual dismissal in a third grade fixture has sparked debate about the Laws of Cricket.","content":null,"pubDate":"2022-02-07 04:41:00","full_description":"Footage of a Tasmanian batter’s unusual dismissal in a third grade fixture has sparked debate about the Laws of Cricket. During a match against Lindisfarne in December 2020, Glenorchy was set a modest target of 98 for victory at University Oval. Facing the first ball of the run chase, Glenorchy opener Rajanbir Sandhu stepped away from his stance after Lindisfarne’s Bryan Scott had released the ball, which crashed into the stumps. Watch the CommBank Women‘s Ashes Series on Kayo. Every Test, T20 & ODI Live & On-Demand. New to Kayo? Start your free trial now > Despite Sandhu’s protests, the umpire had no problem awarding the dismissal, and he was heading back to the pavilion for a golden duck. It is commonplace in the sport for batters to step away from the crease during the bowler’s run-up due to a distraction, but Sandhu’s withdrawal was incredibly late. Law 20.4.2.5 states: “The striker is not ready for the delivery of the ball and, if the ball is delivered, makes no attempt to play it. Provided the umpire is satisfied that the striker had adequate reason for not being ready, the ball shall not count as one of the over.” Well left, Champ... https://t.co/7wQicE6D4u Tell your story walking, pal. MyCricket uploaded footage of Sandhu’s dismissal to Instagram on Saturday, and the comment section was inevitably flooded with comments, debating the legality of the wicket. Former Australian leg-spinner Cameron Boyce commented: “Too worried about the tekkers.” Former Ireland cricketer Niall O‘Brien tweeted: “See ya mate.” Some cricket fans pointed out that Sandhu looked up only moments before Scott released the ball, but most agreed that the umpire had made the right decision. Glenorchy ultimately won the match by four wickets, chasing the target in 16.4 overs. Scott finished with figures of 2/22 off four overs. Travis Head thought he’d be available for the first T20I of Australia’s five-match series against Sri Lanka but plans have changed. Australian Cricket Association chief Todd Greenberg says the Australian playing group thinks “very fondly” of ousted coach Justin Langer. Ellyse Perry mightn’t have been at her blistering best prior to Sunday, but Alyssa Healy says she’s now ready to shake things up at the World Cup.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Langer is not a monster he is being portrayed as, says Gilchrist","link":"https://www.business-standard.com/article/sports/langer-is-not-a-monster-he-is-being-portrayed-as-says-gilchrist-122020700252_1.html","keywords":null,"creator":null,"video_url":null,"description":"Langer stepped down as head coach of the Australian men's cricket team despite leading the side to its maiden ICC T20 World Cup title in the UAE and a 4-0 win in the recently-concluded Ashes","content":null,"pubDate":"2022-02-07 04:30:00","full_description":"Former Australian wicketkeeper-batter Adam Gilchrist has lashed out at Cricket Australia (CA) over its handling of the head coach Justin Langer issue, saying the 51-year-old former opener is being \"painted as a monster\", which is not the case. Langer stepped down as head coach of the Australian men's cricket team despite leading the side to its maiden ICC T20 World Cup title in the UAE and a 4-0 win in the recently-concluded Ashes after he reportedly felt humiliated by CA for offering him only a six-month contract renewal for his efforts. Reportedly unhappy with the treatment meted out by CA, Langer, whose contract was coming up for renewal in June this year after the month-long series against Pakistan, decided to step down five months before the expiry of his term and not fly out to Pakistan with the team. Gilchrist, a former teammate of Langer, told sen.com.au on Monday that Langer was the kind of person who would acknowledge his frailties and always work out an amicable solution with players and support staff. According to reports, Langer's position as coach had become shaky in August last year after players and support staff had made their dislike known of his \"volatile micromanagement style\". \"He's been painted by some particular people as a monster, that is not Justin Langer,\" said Gilchrist. \"He'll be the first to admit he has his frailties, he has his areas of weakness, but gee, he'll sit and look you in the eye and work it out with you. \"So, to be painted as a monster, what sort of effect would that have on you personally and what's the flow-on effect to your family and the people that are nearest and dearest to you, particularly through a period of time when you're not nearly understanding what is going on, the consistent innuendo and rumour. I think he stated it perfectly in his resignation letter, honesty, respect, trust, truth performance,\" added Gilchrist. \"And then unfortunately, he felt a compelling need to say if that's been the trouble I apologise, they're the foundations he bases his life on. I totally agree with him, (but) I unfortunately disagree with him that he felt a need to apologise because that shouldn't be a situation.\" Gilchrist said it was good that Langer had resigned given that there were very \"little\" values coming from within Cricket Australia and the team, which he has stood for in his life. \"They could have offered him (Langer) a five-year deal, but I think through the last few days Justin realised that a lot of those key fundamentals and values that he has always and consistently based his life on, there was very little of that coming from either within the group or from Cricket Australia, and that's where again where I think my focus goes to now,\" Gilchrist continued. \"It's done, the players know they have to manage that going forward now with whoever fills that role permanently, and they may well sit back in a year's time and say, 'Look, we did it, we got the results', but the cost on a human being and a family and the method with which everyone has gone about this, nonetheless Cricket Australia and the board, it just stuns me. The personal capital and the human capital that they (CA and players) are prepared to churn and burn is extraordinary. \"I think it's quite reckless and some of the decision-making over a long period of time in there has been fuelled by greed, it really leaves me staggered,\" added Gilchrist. --IANS akm/ (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220207/thumb-122020700252.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"\"On A Scale Of 10, I Give Him...\": Sunil Gavaskar Rates Rohit Sharma's 1st Match As Full-Time India .. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy13ZXN0LWluZGllcy0yMDIyL2luZC12cy13aS1zdW5pbC1nYXZhc2thci1yYXRlcy1yb2hpdC1zaGFybWFzLWZpcnN0LW1hdGNoLWFzLWZ1bGwtdGltZS10ZWFtLWluZGlhLXdoaXRlLWJhbGwtY2FwdGFpbi0yNzUzMzEy0gGjAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2luZGlhLXZzLXdlc3QtaW5kaWVzLTIwMjIvaW5kLXZzLXdpLXN1bmlsLWdhdmFza2FyLXJhdGVzLXJvaGl0LXNoYXJtYXMtZmlyc3QtbWF0Y2gtYXMtZnVsbC10aW1lLXRlYW0taW5kaWEtd2hpdGUtYmFsbC1jYXB0YWluLTI3NTMzMTIvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"On A Scale Of 10, I Give Him...\": Sunil Gavaskar Rates Rohit Sharma's 1st Match As Full-Time India ..  NDTVSports.comRecent Match Report - West Indies vs India 1st ODI 2021/22  ESPNcricinfoIND vs WI: Watch – “Rohit, Bat Lga Hai” – Virat Kohli Convinces Rohit Sharma To Take A Review, Turns Out To Be A Successful One  Cricket AddictorWashington Sundar, Siraj give a glimpse of their new-ball nous | Cricbuzz.com - Cricbuzz  CricbuzzAhmedabad conditions were 'pretty difficult’ says Alzarri Joseph  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-02-07 04:25:26","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Future looks bright for boys who showed great maturity, high skills to win U-19 WC","link":"https://timesofindia.indiatimes.com/sports/cricket/news/future-looks-bright-for-the-boys-who-showed-great-maturity-high-skills-to-win-under-19-world-cup/articleshow/89396014.cms","keywords":null,"creator":null,"video_url":null,"description":"Despite little age-group cricket in India for the past two seasons due to Covid-19, the India under-19 team notched up a nine-game unbeaten run, clinching two back-to-back tournaments. The way this bunch conquered an outbreak of Covid-19, forcing India to barely find 11 fit players for the games against Ireland and Uganda - is an inspiring tale in itself.","content":null,"pubDate":"2022-02-07 03:44:26","full_description":null,"image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"The Justin Langer era is over. What is facing Australian cricket's next generation? - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTAyLTA3L3RoZS1jaGFsbGVuZ2VzLXRoYXQtYXdhaXQtYXVzdHJhbGlhbi1jcmlja2V0LXBvc3QtanVzdGluLWxhbmdlci8xMDA4MDk5NzDSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The Justin Langer era is over. What is facing Australian cricket's next generation?  ABC NewsMichael Clarke sets cagey Cummins straight  NEWS.com.auCould Justin Langer coach England? Former captain weighs in  SENJohnson rips journo after attacking Cummins  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2022-02-07 03:18:15","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"COV vs FBA Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BPL 2022 Match No. 21 at Sylhet International Stadium, 12 PM IST February 7","link":"https://zeenews.india.com/cricket/cov-vs-fba-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-bpl-2022-match-no-21-at-sylhet-international-stadium-12-pm-ist-february-7-2434231.html","keywords":null,"creator":null,"video_url":null,"description":"Comilla Victorians vs Fortune Barishal Dream11 Team Prediction Comilla Victorians vs Fortune Barishal Match No. 21 - Check My Dream11 Team, Best players list of COV vs FBA, Comilla Victorians Dream11 Team Player List, Fortune Barishal Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Bangladesh Premier League 2022, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-02-07 02:38:00","full_description":"The Comilla Victorians will face off against Fortune Barishal in Match No. 21 of the Bangladesh Premier League (BPL) 2022 on Monday (February 7). The Victorians are currently at the top of the points table in the tournament having won four out of their six matches so far. They have lost only a single game and one match was washed away due to rain. The Barishal, on the other hand, have won four out of 7 matches and are placed in the second position on the points table. Their last game against Sylhet Sunrisers was abandoned due to rain. Venue: Sylhet International Stadium, Sylhet Date & Time: February 7th at 12 PM IST Live Streaming: Fancode Wicket-keeper: Liton Das Batters: Chris Gayle, Imrul Kayes, Faf du Plessis, Najmul Hossain-Shanto, Mahmudul Hasan Joy All-rounders: Dwayne Bravo (C), Sunil Narine Bowlers: Mustafizur Rahman (VC), Tanvir Islam, Mujeeb-ur-Rahman Captain: Dwayne Bravo Vice-captain: Mustafizur Rahman Comilla Victorians: Mahmudul Hasan Joy, Liton Das, Imrul Kayes (c), Faf du Plessis, Sunil Narine, Moeen Ali, Nahidul Islam, Mahidul Islam Ankon (wk), Mustafizur Rahman, Tanvir Islam, Sumon Khan Fortune Barishal: Towhid Hridoy, Shakib Al Hasan (c), Chris Gayle, Najmul Hossain Shanto, Irfan Sukkur, Munim Shahriar, Dwayne Bravo, Nurul Hasan (wk), Mehedi Hasan Rana, Mujeeb Ur Rahman, Shafiqul Islam","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Painted as a monster’: Gilchrist tears ‘greedy’ CA to shreds in stunning Langer claim","link":"https://www.foxsports.com.au/cricket/australia/painted-as-a-monster-gilchrist-tears-ca-to-shreds-over-reckless-staggering-langer-mess/news-story/0980a29c7c5132460994c0fa9c8f4822","keywords":null,"creator":null,"video_url":null,"description":"Test great Adam Gilchrist has turned his fury on Cricket Australia in the wake of Justin Langer’s resignation, declaring the former national coach had been portrayed “as a monster”.","content":null,"pubDate":"2022-02-07 01:56:00","full_description":"Test great Adam Gilchrist has turned his fury on Cricket Australia in the wake of Justin Langer’s resignation, declaring the former national coach had been portrayed “as a monster”. As a chasm begins to widen between ex-Australian players and the current group amid accusations they were part of a 12-month push to “have Justin out of the position”, Gilchrist lashed CA for a “churn and burn” mentality and failing to consider the “cost on a human being” for the lack of public clarity in their motivations not to re-sign Langer. Two days after Langer resigned after only being offered a six-month contract extension, Gilchrist, one of Langer’ closest friends, said he remained “staggered” at how the process played out with next to no real explanation why a long-term contract wasn’t offered for a coach who had just won the T20 World Cup and the Ashes. “I don’t care to listen to any of the corporate speak about transition and analysis of the coach’s position and requirements and evolution, that is just covering up that certain players and support staff around that team have spoken and they no longer wanted Justin there,” Gilchrist said on Monday. “I’m not inside that camp so I can’t question whether they are well intentioned or not. I am sure they are well intentioned from the way they see it. “Absolutely, there seems to be some disunity there. I don’t think the players would have pushed so hard both privately to CA and clearly, I could not tell you if players were doing (it) or player managers, but feeding information to the press. There was a concerted push to have Justin out of the positions. “Justin has realised those key fundamental values he has always based his life on. There was very little of that coming from within the group or CA. That’s where my focus goes to now. “The cost on a human being and his family and the method with which everyone has gone about this and none the least CA and the board. It stuns me the personal capital and human capital they are happy to churn and burn is extraordinary.” Justin Langer with Adam Gilchrist as Test teammates in 1999. Source: News Limited Gilchrist was especially frustrated with the way Langer, who took over the job after the sandpaper scandal in 2018 and restored Australian faith in the team, had been portrayed since leaks began to emerge about his style during 2021. “Since then, through to now where every day he is being painted a certain way, painted by particular people as a monster. That is not Justin Langer,” he told SEN. “He’ll be the first to admit he has his frailties, his areas of weakness. But geez, he’ll sit with you and look you in the eye and sort it out. He’s being painted as a monster. “What sort of effect would that have on your personally? What’s the flow-on effect on to your family? Particularly through a period of time where you are not really understanding what’s going on. “I think it’s quite reckless and some of the decision making over a long period of time has been fuelled by greed and it really leaves me staggered.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Yash, captain made for glory","link":"https://www.tribuneindia.com/news/sports/yash-captain-made-for-glory-367761","keywords":null,"creator":null,"video_url":null,"description":"Vinayak PadmadeoNew Delhi, February 6Yash Dhull's Janakpuri residence was teeming with family, friends and neighbours today, thronging the house to congratulate Vijay Dhull for his son's exploits in the U-19 World Cup.Yash's leadership qualities, and the natural talent in the team, stood out in India's undefeated run in the tournament. The resolve of the team was tested when six players, including Yash and his deputy Shaik Rasheed, were infected with Covid-19. But the depth of the team saw them through.Yash knew he was leading a very talented bunch. When asked whether he was nervous to lead this team, which had not played much as a team and had experimented with four different skippers, the 19-year-old denied feeling any nerves. \"I am not nervous at all. I have captained many teams before and I know what to do on the field. Besides I know that we will be a hard team to beat,\" Yash had told this correspondent before embarking on a two-month tour, starting with the U-19 Asia Cup in the UAE.The teenager learned his ropes in the tough fields of Delhi club cricket, and his coaches noticed early that he had a cricketing brain beyond his years.Leadership qualityRajesh Nagar, who runs an academy in Dwarka, where Yash has been training, made Yash the captain of the team in a DDCA league match when he was only 14. Airliner Academy's Pradeep Kochar too saw a similar role for the youngster.\"All of his coaches have told us: 'Your son has a mature cricketing brain'. Pradeep Kochar and even Hrishikesh Kanitkar sir (India U-19 coach) have said that Yash is made for cricket,\" Vijay said.Support from home made him battle-ready. His grandfather Jagat Singh, a former armyman, would take the young Yash for training while Vijay himself has played in the DDCA league for a number of clubs, including Subhania.\"I left a job and took up a consultancy role so that I could travel with him for matches. People do not understand it takes a lot of time and hard work to make a player,\" Vijay said.\"It is not as if I had to struggle a lot. I had played cricket at club level and knew what was required to become a cricketer. We got lucky we got good coaches like Kochar sir to mentor Yash,\" he said.Yash is the third Delhi youngster — after Virat Kohli (2008) and Unmukt Chand (2012) — to lead India to U-19 glory, and Vijay feels it's just the beginning.\"His dream is the same as that of many youngsters, to play for the senior team. This U-19 win is a small step towards that dream. I know it will not be easy. However, we are seeing some rewards and hopefully it will be the same in the future,\" Vijay added.","content":null,"pubDate":"2022-02-07 01:32:20","full_description":"Tribune News Service Vinayak Padmadeo New Delhi, February 6 Yash Dhull’s Janakpuri residence was teeming with family, friends and neighbours today, thronging the house to congratulate Vijay Dhull for his son’s exploits in the U-19 World Cup. Yash’s leadership qualities, and the natural talent in the team, stood out in India’s undefeated run in the tournament. The resolve of the team was tested when six players, including Yash and his deputy Shaik Rasheed, were infected with Covid-19. But the depth of the team saw them through. Yash knew he was leading a very talented bunch. When asked whether he was nervous to lead this team, which had not played much as a team and had experimented with four different skippers, the 19-year-old denied feeling any nerves. “I am not nervous at all. I have captained many teams before and I know what to do on the field. Besides I know that we will be a hard team to beat,” Yash had told this correspondent before embarking on a two-month tour, starting with the U-19 Asia Cup in the UAE. The teenager learned his ropes in the tough fields of Delhi club cricket, and his coaches noticed early that he had a cricketing brain beyond his years. Leadership quality Rajesh Nagar, who runs an academy in Dwarka, where Yash has been training, made Yash the captain of the team in a DDCA league match when he was only 14. Airliner Academy’s Pradeep Kochar too saw a similar role for the youngster. “All of his coaches have told us: ‘Your son has a mature cricketing brain’. Pradeep Kochar and even Hrishikesh Kanitkar sir (India U-19 coach) have said that Yash is made for cricket,” Vijay said. Support from home made him battle-ready. His grandfather Jagat Singh, a former armyman, would take the young Yash for training while Vijay himself has played in the DDCA league for a number of clubs, including Subhania. “I left a job and took up a consultancy role so that I could travel with him for matches. People do not understand it takes a lot of time and hard work to make a player,” Vijay said. “It is not as if I had to struggle a lot. I had played cricket at club level and knew what was required to become a cricketer. We got lucky we got good coaches like Kochar sir to mentor Yash,” he said. Yash is the third Delhi youngster — after Virat Kohli (2008) and Unmukt Chand (2012) — to lead India to U-19 glory, and Vijay feels it’s just the beginning. “His dream is the same as that of many youngsters, to play for the senior team. This U-19 win is a small step towards that dream. I know it will not be easy. However, we are seeing some rewards and hopefully it will be the same in the future,” Vijay added.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_14261979.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"1000th ODI: Rohit wins toss, match, top scores as India thump Windies - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvMTAwMHRoLW9kaS1yb2hpdC1ib3NzZXMtZWFzeS1jaGFzZS1hZnRlci1zcGlubmVycy1zZXQtdXAtaW5kaWFzLTYtd2t0LXZpY3Rvcnktb3Zlci13ZXN0LWluZGllcy03NzU5OTYzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"1000th ODI: Rohit wins toss, match, top scores as India thump Windies  The Indian ExpressRecent Match Report - West Indies vs India 1st ODI 2021/22  ESPNcricinfoIND vs WI: Watch – “Rohit, Bat Lga Hai” – Virat Kohli Convinces Rohit Sharma To Take A Review, Turns Out To Be A Successful One  Cricket Addictor1000th ODI: India coast to six-wicket victory against West Indies  Times of IndiaWatch: Virat Kohli's \"Ulta Wala Daal\" Plan To Yuzvendra Chahal Scripts Kieron Pollard's Downfall In 1st ODI | Cricket News  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-02-07 01:14:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India win U19 World Cup","link":"https://www.thenews.com.pk/print/931443-india-win-u19-world-cup","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: India edged out England by four wickets to win their fifth ICC Under-19 Men’s Cricket World Cup in the West Indies.The two unbeaten sides met at the Sir Vivian Richards Cricket Ground in Antigua and Barbuda as England went in search of only their second title, but it was India who...","content":null,"pubDate":"2022-02-07 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Two Pak juniors in World Cup team","link":"https://www.thenews.com.pk/print/931442-two-pak-juniors-in-world-cup-team","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Two Pakistanis Haseebullah Khan and Awais Ali have earned their names on the Most Valuable Team of the Under-19 Cricket World Cup.Indian victorious captain Yash Dhull was chosen to skipper a line-up of future stars.Overall, eight nations are represented in the 12-strong lineup as...","content":null,"pubDate":"2022-02-07 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Dunk, Faulkner say Aussies will enjoy playing in Pakistan","link":"https://www.thenews.com.pk/print/931447-dunk-faulkner-say-aussies-will-enjoy-playing-in-pakistan","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Australia men’s cricket team’s tour of Pakistan has a big thumbs up from compatriots Ben Dunk and James Faulkner who say the visitors will enjoy the atmosphere, the fans’ passion for the game and a quality opposition during their tour for three Tests, three ODIs and a...","content":null,"pubDate":"2022-02-07 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"‘Results don’t matter now’ – Julian slams Langer decision","link":"https://www.news.com.au/sport/cricket/results-dont-matter-now-julian-slams-langer-decision/video/c5e1c6e77ca1adedc0e0f3d47e81ecc7","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Former Australian allrounder Brendon Julian believes Justin Langer's ousting from the head coaching position could have set a dangerous precedent for his successor.","content":null,"pubDate":"2022-02-07 00:56:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Adam Gilchrist believes Justin Langer has been portrayed as a monster and let down by Cricket Australia","link":"https://www.perthnow.com.au/news/adam-gilchrist-believes-justin-langer-has-been-portrayed-as-a-monster-and-let-down-by-cricket-australia-c-5595131","keywords":null,"creator":[" "],"video_url":null,"description":"Two days after Justin Langer resigned as coach, the fury from past players towards Cricket Australia continues unabated.","content":null,"pubDate":"2022-02-07 00:41:13","full_description":"Test great Adam Gilchrist has turned his fury on Cricket Australia in the wake of Justin Langer’s resignation, declaring the former national coach had been portrayed “as a monster”. As a chasm begins to widen between ex-Australian players and the current group amid accusations they were part of a 12-month push to “have Justin out of the position”, Gilchrist lashed CA for a “churn and burn” mentality and failing to consider the “cost on a human being” for the lack of public clarity in their motivations not to re-sign Langer. Two days after Langer resigned after only being offered a six-month contract extension, Gilchrist, one of Langer’ closest friends, said he remained “staggered” at how the process played out with next to no real explanation why a long-term contract wasn’t offered for a coach who had just won the T20 World Cup and the Ashes. “I don’t care to listen to any of the corporate speak about transition and analysis of the coach’s position and requirements and evolution, that is just covering up that certain players and support staff around that team have spoken and they no longer wanted Justin there,” Gilchrist said on Monday. “I’m not inside that camp so I can’t question whether they are well intentioned or not. I am sure they are well intentioned from the way they see it. “Absolutely, there seems to be some disunity there. I don’t think the players would have pushed so hard both privately to CA and clearly, I could not tell you if players were doing (it) or player managers, but feeding information to the press. There was a concerted push to have Justin out of the positions. “Justin has realised those key fundamental values he has always based his life on. There was very little of that coming from within the group or CA. That’s where my focus goes to now. “The cost on a human being and his family and the method with which everyone has gone about this and none the least CA and the board. It stuns me the personal capital and human capital they are happy to churn and burn is extraordinary.”   Gilchrist was especially frustrated with the way Langer, who took over the job after the sandpaper scandal in 2018 and restored Australian faith in the team, had been portrayed since leaks began to emerge about his style during 2021. “Since then, through to now where every day he is being painted a certain way, painted by particular people as a monster. That is not Justin Langer,” he told SEN. “He’ll be the first to admit he has his frailties, his areas of weakness. But geez, he’ll sit with you and look you in the eye and sort it out. He’s being painted as a monster. “What sort of effect would that have on your personally? What’s the flow-on effect on to your family? Particularly through a period of time where you are not really understanding what’s going on. “I think it’s quite reckless and some of the decision making over a long period of time has been fuelled by greed and it really leaves me staggered.”","image_url":"https://images.perthnow.com.au/publication/C-5595131/5d56fa84b4111f2b487387ac190355f0db723ad5-16x9-x0y0w1872h1053.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Adam Gilchrist believes Justin Langer has been portrayed as a monster and let down by Cricket Australia","link":"https://thewest.com.au/news/adam-gilchrist-believes-justin-langer-has-been-portrayed-as-a-monster-and-let-down-by-cricket-australia-c-5595129","keywords":null,"creator":[" "],"video_url":null,"description":"Two days after Justin Langer resigned as coach, the fury from past players towards Cricket Australia continues unabated.","content":null,"pubDate":"2022-02-07 00:41:12","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5595129/5d56fa84b4111f2b487387ac190355f0db723ad5-16x9-x0y0w1872h1053.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Monster’: Test great lashes out over Langer","link":"https://www.news.com.au/sport/cricket/adam-gilchrist-believes-justin-langer-has-been-portrayed-as-a-monster-and-let-down-by-cricket-australia/news-story/e0a197ce97147462b55c2b97560438a7","keywords":null,"creator":null,"video_url":null,"description":"Test great Adam Gilchrist has turned his fury on Cricket Australia in the wake of Justin Langer’s resignation, declaring the former national coach had been portrayed “as a monster”.","content":null,"pubDate":"2022-02-07 00:25:00","full_description":"Test great Adam Gilchrist has turned his fury on Cricket Australia in the wake of Justin Langer’s resignation, declaring the former national coach had been portrayed “as a monster”. As a chasm begins to widen between ex-Australian players and the current group amid accusations they were part of a 12-month push to “have Justin out of the position”, Gilchrist lashed CA for a “churn and burn” mentality and failing to consider the “cost on a human being” for the lack of public clarity in their motivations not to re-sign Langer. Two days after Langer resigned after only being offered a six-month contract extension, Gilchrist, one of Langer’ closest friends, said he remained “staggered” at how the process played out with next to no real explanation why a long-term contract wasn’t offered for a coach who had just won the T20 World Cup and the Ashes. “I don’t care to listen to any of the corporate speak about transition and analysis of the coach’s position and requirements and evolution, that is just covering up that certain players and support staff around that team have spoken and they no longer wanted Justin there,” Gilchrist said on Monday. Still canât get over what a pathetic day for Australian Cricket yesterday was. ð “I’m not inside that camp so I can’t question whether they are well intentioned or not. I am sure they are well intentioned from the way they see it. “Absolutely, there seems to be some disunity there. I don’t think the players would have pushed so hard both privately to CA and clearly, I could not tell you if players were doing (it) or player managers, but feeding information to the press. There was a concerted push to have Justin out of the positions. “Justin has realised those key fundamental values he has always based his life on. There was very little of that coming from within the group or CA. That’s where my focus goes to now. “The cost on a human being and his family and the method with which everyone has gone about this and none the least CA and the board. It stuns me the personal capital and human capital they are happy to churn and burn is extraordinary.” Gilchrist was especially frustrated with the way Langer, who took over the job after the sandpaper scandal in 2018 and restored Australian faith in the team, had been portrayed since leaks began to emerge about his style during 2021. “Since then, through to now where every day he is being painted a certain way, painted by particular people as a monster. That is not Justin Langer,” he told SEN. “He’ll be the first to admit he has his frailties, his areas of weakness. But geez, he’ll sit with you and look you in the eye and sort it out. He’s being painted as a monster. “What sort of effect would that have on your personally? What’s the flow-on effect on to your family? Particularly through a period of time where you are not really understanding what’s going on. “I think it’s quite reckless and some of the decision making over a long period of time has been fuelled by greed and it really leaves me staggered.” Ellyse Perry mightn’t have been at her blistering best prior to Sunday, but Alyssa Healy says she’s now ready to shake things up at the World Cup. Former Test captain Michael Clarke believes the horrible position Pat Cummins was put in by Cricket Australia needs a positive resolution. The horrible position Pat Cummins was put in by Cricket Australia needs a positive resolution says a former Test captain.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Former Test captain Michael Clarke urges Pat Cummins to come clean over Justin Langer","link":"https://www.perthnow.com.au/sport/former-test-captain-michael-clarke-urges-pat-cummins-to-come-clean-over-justin-langer-c-5594709","keywords":null,"creator":[" "],"video_url":null,"description":"Former Test captain Michael Clarke believes the horrible position Pat Cummins was put in by Cricket Australia needs a positive resolution.","content":null,"pubDate":"2022-02-06 23:56:16","full_description":"Test captain Pat Cummins has been urged to give the Australian public a “clear opinion” on his role in Cricket Australia’s handling of the Justin Langer coaching fiasco or risk having a tainted tenure as skipper. Former Test captain Michael Clarke said Cummins had been “smoked” by former teammate Mitchell Johnson, who called the current skipper “gutless” for failing to fully back Langer. Clarke said Cummins had been put in a “lose-lose” situation by CA amid talk of player power being behind Langer’s ousting, which has earned huge amounts of vitriol from some of the biggest names in the game. “The Australian public aren’t stupid and this is my point with Pat Cummins,” Clarke said on Monday. “His reputation is squeaky-clean. Right now it has taken a hit, until he stands there and voices his opinion. Look what Mitchell Johnson said about Pat Cummins. A teammate, a friend of his has smoked him. “My advice to Patty is he has got to stand there. He needs to tell the fans where he sits on this because everyone thinks it is Patty who made the decision. That accountability sits with him. “He is trying to honour both parties and has done it very well. He is trying to look after Cricket Australia. I don’t like seeing Pat get smacked for this because I think he is in a lose-lose situation. He sits right in the middle.” CA boss Nick Hockley defended Cummins and said criticism of the skipper, who was consulted as part of the process in dealing with Langer, was “unfair”. But Clarke said there was value in Cummins, who is part of the Australian T20 squad set to play Sri Lanka this week, putting the speculation to bed. “Patty needs to come out and make his opinion very clear,” Clarke told The Big Sports Breakfast. “Cricket Australia have to allow him to be open and honest, otherwise he will be blamed for this. A lot of people are smashing him for this. “I saw Mitchell Johnson’s comments, he smoked him. I think a lot of people are thinking what Mitch is thinking. You’ve got the likes of Mark Taylor talking about it, Steve Waugh making comments, Ricky Ponting’s comments are very strong. “When Steve Waugh comes out and says something that’s big. He’s not paid by anyone. For him to come out and make a comment, this thing is heavy. You’ve got past legends fuming with how a 100-Test player and very successful coach has been treated. “I’m suggesting to Pat Cummins as the leader, he needs to stand tall and explain to past players – Mitchell Johnson, Steve Waugh, Ricky Ponting, Matthew Hayden – plus the fans and cricket lovers, what the hell is going on here? “My question is how much involvement did Pat have? Did he want this change and (if so) why? Bring on accountability. When you lose, that’s on you as captain. If this is what Patty wants, respect to him but he’s going to have to take the hits as well.” Langer resigned on Saturday after only being offered a six-month contract extension despite winning the T20 World Cup and the Ashes.","image_url":"https://images.perthnow.com.au/publication/C-5594709/56f041f2693fab4eaae69cac999a86705d8338c1-16x9-x0y0w2048h1152.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Former Test captain Michael Clarke urges Pat Cummins to come clean over Justin Langer","link":"https://thewest.com.au/sport/former-test-captain-michael-clarke-urges-pat-cummins-to-come-clean-over-justin-langer-c-5594708","keywords":null,"creator":[" "],"video_url":null,"description":"Former Test captain Michael Clarke believes the horrible position Pat Cummins was put in by Cricket Australia needs a positive resolution.","content":null,"pubDate":"2022-02-06 23:56:16","full_description":"Test captain Pat Cummins has been urged to give the Australian public a “clear opinion” on his role in Cricket Australia’s handling of the Justin Langer coaching fiasco or risk having a tainted tenure as skipper. Former Test captain Michael Clarke said Cummins had been “smoked” by former teammate Mitchell Johnson, who called the current skipper “gutless” for failing to fully back Langer. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > Clarke said Cummins had been put in a “lose-lose” situation by CA amid talk of player power being behind Langer’s ousting, which has earned huge amounts of vitriol from some of the biggest names in the game. “The Australian public aren’t stupid and this is my point with Pat Cummins,” Clarke said on Monday. “His reputation is squeaky-clean. Right now it has taken a hit, until he stands there and voices his opinion. Look what Mitchell Johnson said about Pat Cummins. A teammate, a friend of his has smoked him. “My advice to Patty is he has got to stand there. He needs to tell the fans where he sits on this because everyone thinks it is Patty who made the decision. That accountability sits with him. “He is trying to honour both parties and has done it very well. He is trying to look after Cricket Australia. I don’t like seeing Pat get smacked for this because I think he is in a lose-lose situation. He sits right in the middle.” CA boss Nick Hockley defended Cummins and said criticism of the skipper, who was consulted as part of the process in dealing with Langer, was “unfair”. But Clarke said there was value in Cummins, who is part of the Australian T20 squad set to play Sri Lanka this week, putting the speculation to bed. “Patty needs to come out and make his opinion very clear,” Clarke told The Big Sports Breakfast. “Cricket Australia have to allow him to be open and honest, otherwise he will be blamed for this. A lot of people are smashing him for this. “I saw Mitchell Johnson’s comments, he smoked him. I think a lot of people are thinking what Mitch is thinking. You’ve got the likes of Mark Taylor talking about it, Steve Waugh making comments, Ricky Ponting’s comments are very strong. “When Steve Waugh comes out and says something that’s big. He’s not paid by anyone. For him to come out and make a comment, this thing is heavy. You’ve got past legends fuming with how a 100-Test player and very successful coach has been treated. “I’m suggesting to Pat Cummins as the leader, he needs to stand tall and explain to past players – Mitchell Johnson, Steve Waugh, Ricky Ponting, Matthew Hayden – plus the fans and cricket lovers, what the hell is going on here? “My question is how much involvement did Pat have? Did he want this change and (if so) why? Bring on accountability. When you lose, that’s on you as captain. If this is what Patty wants, respect to him but he’s going to have to take the hits as well.” Langer resigned on Saturday after only being offered a six-month contract extension despite winning the T20 World Cup and the Ashes.","image_url":"https://images.thewest.com.au/publication/C-5594708/56f041f2693fab4eaae69cac999a86705d8338c1-16x9-x0y0w2048h1152.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"}]}