{"newsArray":[{"title":"Threat against Ashton Agar investigated","link":"https://thewest.com.au/sport/cricket/threat-against-ashton-agar-investigated-c-5881181","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Cricket Australia believe an online threat made against Ashton Agar is not credible after it was investigated by government security agencies.","content":null,"pubDate":"2022-02-28 22:47:38","full_description":"An online threat directed to the wife of Australian allrounder Ashton Agar has been investigated by government security agencies. Madeline Agar was sent a disturbing message on Instagram, warning her about her husband's safety during Australia's first tour of Pakistan in 24 years. The Australian team arrived in Rawalpindi on Sunday, with the first Test of the series starting this Friday. It has been suggested the message was sent from a fake account, most likely from someone outside of Pakistan, and authorities do not believe it is a credible threat. The message warned Agar's life would be at risk in Pakistan and also made threats against the couple's children, which they do not have. \"Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined Government security agencies,\" a Cricket Australia statement read. \"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. \"No further comment will be made at this time.\" No international cricket was played in Pakistan for a decade after a Sri Lanka team bus was attacked by terrorists in Lahore in 2009. CA has taken serious precautions for this tour, with a large security presence on guard outside the hotel where the Australians are staying.","image_url":"https://images.thewest.com.au/publication/C-5881181/41429967eba134151a798130d15e5aab5e2d08ba-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Threat against Ashton Agar investigated","link":"https://www.perthnow.com.au/sport/cricket/threat-against-ashton-agar-investigated-c-5881178","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Cricket Australia believe an online threat made against Ashton Agar is not credible after it was investigated by government security agencies.","content":null,"pubDate":"2022-02-28 22:47:37","full_description":"An online threat directed to the wife of Australian allrounder Ashton Agar has been investigated by government security agencies. Madeline Agar was sent a disturbing message on Instagram, warning her about her husband's safety during Australia's first tour of Pakistan in 24 years. The Australian team arrived in Rawalpindi on Sunday, with the first Test of the series starting this Friday. It has been suggested the message was sent from a fake account, most likely from someone outside of Pakistan, and authorities do not believe it is a credible threat. The message warned Agar's life would be at risk in Pakistan and also made threats against the couple's children, which they do not have. \"Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined Government security agencies,\" a Cricket Australia statement read. \"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. \"No further comment will be made at this time.\" No international cricket was played in Pakistan for a decade after a Sri Lanka team bus was attacked by terrorists in Lahore in 2009. CA has taken serious precautions for this tour, with a large security presence on guard outside the hotel where the Australians are staying.","image_url":"https://images.perthnow.com.au/publication/C-5881178/41429967eba134151a798130d15e5aab5e2d08ba-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Agar receives death threat on eve of Test series","link":"https://wwos.nine.com.au/cricket/australia-vs-pakistan-ashton-agar-death-threat-cricket-australia-statement/62094cbd-fdcd-4337-a323-5724fd9f3629","keywords":null,"creator":["wwos"],"video_url":null,"description":"Australian cricketer Ashton Agar was the subject of a death threat sent on the eve of the Test series against Pakistan.","content":"Cricket Australia says a death threat sent to the partner of spin bowler Ashton Agar \"is not considered a risk.\"As first reported by the Sydney Morning Herald, Agar's partner, Madeleine, received the threat on social media, warning that he should not travel to Pakistan.\"Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined government security processes,\" CA said in a statement.READ MORE: Taylor responds to Warne's coaching claimREAD MORE: Medvedev calls for peaceREAD MORE: Latest blow for luckless Tigers hooker\"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time.\"According to the SMH, Agar was the subject of the death threat, which may have come from a fake Instagram account, possibly from India.The first Test between Pakistan and Australia gets underway in Rawalpindi on Friday, the first time Australia has toured that country since 1998.Pakistan didn't host Test cricket for nearly 11 years after a terrorist attack on the Sri Lankan team during a match in Lahore in 2009.Earlier this week, Australian captain Pat Cummins spoke of the intense security surrounding the team, with 4000 police and military personnel guarding the team hotel.\"It's comforting,\" Cummins said.\"We're really lucky to be surrounded by so many professionals. That was one of the big factors that we wanted to be thorough on before arriving here: not only security but biosecurity. Everyone's done a fantastic job.\"In September, New Zealand abandoned its tour of Pakistan due to security concerns, prompting England to cancel a tour scheduled for October.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-02-28 20:50:50","full_description":"Cricket Australia says a death threat sent to the partner of spin bowler Ashton Agar \"is not considered a risk.\" As first reported by the Sydney Morning Herald , Agar's partner, Madeleine, received the threat on social media, warning that he should not travel to Pakistan. \"Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined government security processes,\" CA said in a statement. READ MORE: Taylor responds to Warne's coaching claim READ MORE: Medvedev calls for peace READ MORE: Latest blow for luckless Tigers hooker \"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time.\" According to the SMH, Agar was the subject of the death threat, which may have come from a fake Instagram account, possibly from India. The first Test between Pakistan and Australia gets underway in Rawalpindi on Friday, the first time Australia has toured that country since 1998. Pakistan didn't host Test cricket for nearly 11 years after a terrorist attack on the Sri Lankan team during a match in Lahore in 2009. Earlier this week, Australian captain Pat Cummins spoke of the intense security surrounding the team, with 4000 police and military personnel guarding the team hotel . \"It's comforting,\" Cummins said. \"We're really lucky to be surrounded by so many professionals. That was one of the big factors that we wanted to be thorough on before arriving here: not only security but biosecurity. Everyone's done a fantastic job.\" In September, New Zealand abandoned its tour of Pakistan due to security concerns, prompting England to cancel a tour scheduled for October. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/02/413574/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Khawaja: ‘I grew up down the road’","link":"https://www.news.com.au/sport/cricket/khawaja-i-grew-up-down-the-road/video/b0203537dedb2a02663e49806453468c","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Australia's first test in Pakistan will be a momentous occasion for Usman Khawaja who 'grew up down the road'.","content":null,"pubDate":"2022-02-28 20:45:17","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket news 2022: Australia vs Pakistan, Usman Khawaja says returning home is just another game, first Test, Rawalpindi, watch","link":"https://www.foxsports.com.au/cricket/australia/cricket-news-2022-australia-vs-pakistan-usman-khawaja-says-returning-home-is-just-another-game-first-test-rawalpindi-watch/news-story/d99a126b48d96a12a9b3dc9ccf405d85","keywords":null,"creator":null,"video_url":null,"description":"Usman Khawaja says playing against Pakistan in the nation he was born in is just another game.","content":null,"pubDate":"2022-02-28 19:00:00","full_description":"Usman Khawaja says playing against Pakistan in the nation he was born in is just another game. It is hard to believe, but they are his words not ours. “Any Test match, any game, is just another match, just another game, I’ve played it for such a long time,” a relaxed Khawaja told reporters during an extended interview following a long delay due to dodgy Wi-Fi. “I’ve been out of the team, I’m back in the team; every game for me now for Australia is just a bonus. “I’m not out here to prove anyone different, I’ve got a beautiful family back home. It’s not the be-all-and-end-all, I just love playing cricket and love being competitive.” Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Start your free trial now > Whilst that could well be the case for Khawaja, it is far from the case looking from the outside in. Australia’s first Pakistan-born Test cricketer is returning to the nation he was born in. It is a historic moment, not just for Khawaja but for Pakistan cricketers and deprived fans, who have only watched their heroes play on home soil on a handful of occasions since that forgettable and regrettable attack on Sri Lanka’s team bus in 2009. Perhaps that is why Khawaja - the most open of Australia’s cricketers - is not wanting to make his homecoming the centre of attention. Australian cricketer Usman Khawaja prepares to bat during their final practice session at the MCG before their departure for the team's first tour of Pakistan since 1998. (Photo by William WEST / AFP) Source: AFP “I know how I’d feel in Australia if cricket was taken away from us,” Khawaja said. “There would be some very lonely summers, some pretty boring summers to be honest. “I feel for the fans. I know how much they love cricket in the subcontinent. I think Pakistan has been deprived a fair bit. It’s been disappointing, I understand why, they’re still playing overseas, but it’s not the same, you want to be able to see your home grounds, your own conditions, go out and watch and take the kids, do all that stuff, which Pakistanis haven’t been able to do, which is disappointing both in terms of players not being able to come out to Pakistan to play. “I’ve also found it really disappointing that India and Pakistan don’t play. Growing up, being from Pakistan ... get those two nations playing together because we all know what competition and great camaraderie comes from that, so hopefully we can get this box ticked and then that’s the next goal for Pakistan cricket next.” Born in Islamabad, Khawaja attended matches at Rawalpindi - the venue of the first Test, starting Friday. When he returned on a four-week trip home as a child, he wore thigh pads as cricket pads and spent endless hours glued to his bat like a mother to a child. Australia set for historic Pakistan tour | 02:12 Now, 24 years after Australia’s previous tour in 1998, the men wearing the baggy greens are back. Khawaja, 35, on his first visit to Pakistan since 2010 - the year before he made his Test debut against England at the SCG - will in all likelihood open the batting in his former backyard. The mild-mannered left-hander appreciates the significance, but he won’t let the match define him. “The fact that I’m playing Pakistan is special, don’t get me wrong, it’s special, it’s something I’ve always wanted to do,” he said. “I grew up down the road, so there is that bit of sentiment definitely, but when the game starts you don’t really think about that stuff. You’re more worried about the ball coming down - the Test match happens like that (clicking his fingers). “I’m sure when I look back on it and think that’s pretty cool - the first tour of Pakistan after so many years, being born in Pakistan, as fate would have it, everything’s worked out beautifully, touch wood.” For a cricket obsessed nation like Pakistan, the fact Khawaja is a “local” is not lost on anyone. Just don’t tell Khawaja he is the local. Khawaja has faced Pakistan overseas before, but this ODI was in Dubai. (Photo by MAHMOUD KHALED / AFP) Source: AFP “I don’t really think that is my role,” he quipped, having been asked how he was enjoying being the team’s guide by a local journalist. “I think guys ask me questions here and there, I know some of it, but others I don’t. I’ve got to remind them, look, I’m Australian, I’ve grown up in Australia my whole life. I know bits and pieces ... Google usually has all the answers.” But Khawaja says he suspects those who pile the stands at Rawalpindi will want him to succeed, as long as it ends in a victory for Pakistan. “I’ve got a lot of support here in Pakistan,” he says. “I think they’ll support me. I think they’ll be hoping I get runs. But I think they’ll be hoping Australia get smashed at the same time, it’s going to be one of those catch 22s. “It’s pretty special. I know where the Rawalpindi ground is. I think I’ve got a couple of photos of when I was younger at the Old Rawalpindi Ground. “Being born here, I think it’s going to be pretty cool walking out there, playing a game, but I don’t expect a hostile crowd. Pakistanis love their cricket, they appreciate good cricket, and I think that’s what they’ll be hoping for.” Just as he played down the significance of his homecoming, so did Khawaja down play his match saving innings against Pakistan in the UAE, where he scored a 302-ball 141. “Any century for Australia is pretty amazing,” he said. “I guess the century at that time, everything that happened beforehand, going to Dubai and scoring that was very special. But I don’t want to live in the past too much. It was a few years ago, I loved it, I had a lot of fun, I try to stay quite present, another three matches coming now. To me, you say it, but it’s just another game.” Head and Australia prepping for Pakistan | 02:29 Albeit it was not just another innings, as then Pakistan skipper Sarfraz Ahmed noted at the time. “I have seen one of the best innings in Test cricket, especially in the fourth innings,” Sarfraz said. “The way he batted, he took Australia to the draw. He batted very well, he played most of his shots, even the reverse-sweep, so his was a brilliant knock.” His remarkable knock came after years of fruitless toil across Asia, where he had made just 117 runs across five Tests in Sri Lanka and Bangladesh. Whilst acknowledging that the surfaces in Pakistan will likely be different to the one he succeeded on in the UAE, Khawaja believes playing his way, a style that has been tweaked and re-tweaked over years, helped him succeed in 2018 and can set up his tour over the next month. “I took (the) onus on myself, I wasn’t going to listen to anyone else about how I needed to bat in the subcontinent,” he said. “I tried that, failed, so I made sure I did learn from it. “It wasn’t just the Dubai series. I had been to an India A series, scored hundreds in the India A series, (in the) white ball series I was player of the series there against India; It wasn’t just a one off in Dubai, I’ve done it time and time again in different teams. “There was a lot of work that went into it. I guess at the end of the day, that’s like five years ago. They were great learning experiences. If I didn’t have those experiences I probably wouldn’t be able to do that. But I gave myself the best opportunity to score. “There’s nothing certain in cricket, you can have all those skills and if certain things don’t go your way, you need a bit of luck, it’s a combination of both, but at least I know I’ve given myself the best chance to score in these conditions. Before in Sri Lanka and Bangladesh, I didn’t really understand what I needed to do in those conditions.” Win or lose, succeed or struggle, you get the feeling that Khawaja has already won by returning to the Test fold. Everything else, well it is just a bonus. But for everyone else, his legacy and homecoming return will go down in history.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Manypeaks into another B-grade grand final after crushing qualifying final victory in ADCA","link":"https://thewest.com.au/news/albany-advertiser/manypeaks-into-another-b-grade-grand-final-after-crushing-qualifying-final-victory-in-adca--c-5868996","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"Wrap of the Albany and Districts Cricket Association B-grade and C-grade finals played at the weekend.","content":null,"pubDate":"2022-02-28 18:00:00","full_description":"Manypeaks and Collingwood Park were the first teams through to the Albany and Districts Cricket Association minor grade grand finals at the weekend. Peaks progressed to yet another B-grade decider after thrashing Royals in Saturday’s qualifying final while Park survived some nervous moments late in their qualifying final against Narrikup to win by two wickets. After winning the toss and batting first at Turf South, Peaks set a competitive 8-157 from their 45 overs and that proved far too many for the Lions in the end. A couple of late lusty blows from George Sippe helped him top score with 28 not out while earlier contributions from Bryce Durack (22), Gary McGlade (27) and Jakob Douglas (24) ensured Peaks reached 150. The Lions had Peaks 3-54 when Wade Anning fell for 11, the second scalp for swing bowler Rob Berwick, but a strong partnership from McGlade and Douglas ensured their side remained in control. Left-arm bowler Brendan Pollard then destroyed the Lions top order, claiming three wickets in an over to leave their run chase reeling at 3-0. Pollard snared the big wicket of Tyler Crommelin for a duck and then removed Dan Robson and Teague Valli without scoring. Devon Jefferis provided some resistance with 20 but his side collapsed to be all out for 61 as Pollard snared 4-16 from his nine overs and was well supported by Tom Sutherland (3-21) as they won by 96 runs. In Saturday’s elimination final Denmark prevailed by 12 runs at McLean Park to eliminate Collingwood Park. Matt Burton (67) and Damien Schwarzbach (44) set the platform for the Magpies to make 179 and Park managed 7-167 in reply despite the best efforts of Jarrod Hansen (31) and Darcy Middleton (29). The Lions bounced back in Sunday’s preliminary final, winning by seven wickets at Turf South after bowling the Magpies out for 97. Only Oliver Pluckhahn troubled the Lions attack, making 32 from 41 balls as Berwick snared 3-15 and Valli made two crucial early breakthroughs. The Lions were patient in the run chase and passed the target in the 40th over with Dan Robson (29no) and Jack Hastie (14no) at the crease while Crommelin had earlier made 25. In the C-grade, Park won the qualifying final on Saturday with two wickets in hand after captain Darryl Robinson (16no) and Peter Darmody (12no) got them home in the 36th over. Narrikup set their rivals 134 to win and James Morris snared four wickets to give his side a strong chance of victory but a 32-run stand between O’Shea Durack (23) and Hayden Burling (24) provided crucial in the result. Peaks won Saturday’s elimination final by 39 runs over the Lions at Proctor Oval, courtesy of five wickets from Peter Robertson. Johnny Haua made a patient 34 but he lacked support as the Lions were all out for 88, Robertson taking 5-24. At Hard North in Sunday’s preliminary final John Miell blasted a superb 94 not out, hitting 12 boundaries, and that cameos from Morris (49) and Ashley Hornby (37no) helped Narrikup set a winning total of 2-201 before Peaks were bowled out for 115 in reply.","image_url":"https://images.thewest.com.au/publication/C-5868996/89ebdc8e4b64bc4f0d4ab9213450d8a1e109c16e-16x9-x0y239w4593h2584.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND VS SL: Disappointing to have no crowd for Virat Kohli's 100th Test, says Sunil Gavaskar","link":"https://www.thehansindia.com/sports/cricket/ind-vs-sl-disappointing-to-have-no-crowd-for-virat-kohlis-100th-test-says-sunil-gavaskar-731289","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India and Sri Lanka are set to play 2 TestsThe first Test in Mohali will be Kohli's 100th TestKohli made his Test debut back in 2011","content":"Sunil Gavaskar ; Virat KohliSunil Gavaskar ; Virat KohliFormer India captain Sunil Gavaskar has expressed that it will be \"disappointing\" to have no crowd in Mohali, which will host Virat Kohli's 100th Test.India and Sri Lanka are set to play a two-match Test series, starting March 4 at the PCA Stadium in Mohali. The Board of Control for Cricket in India (BCCI) has confirmed that the first Test will be played behind closed doors due to an increase in covid-19 cases in the Punjab city. One of the greatest players to have played cricket, Kohli, is set to make his 100th appearance in the whites for India and a section of fans are upset that there will be no fans to witness the legend's milestone game. PCA treasurer RP Singla on Saturday confirmed that fans won't be allowed to watch the first Test against Sri Lanka from the iconic stadium in Mohali. Singla said the decision has been taken in accordance with a directive from BCCI. \"Any game that you play, you want the crowd to be there. India has played without any crowds in recent times. Any performer, be it an actor, be it a cricketer, wants to play in front of the crowd. The 100th Test is very very special. Disappointing that there is going to be no crowd, but I think the decision has been taken in the greater interest. The cases have increased in and around Mohali, where the match is going to be played,\" Sunil Gavaskar told Sports Today. Meanwhile, the fans have questioned the decision, citing that the ongoing T20I series is being played with spectators in Dharamsala. Notably, Ahmedabad did not allow crowds for the three-match One-Day International (ODI) series against West Indies earlier this month, but the Eden Gardens in Kolkata had fans, although in a reduced capacity, for the final match of the series. Meanwhile, the M Chinnaswamy Stadium in Bengaluru, the venue for the second Test against Sri Lanka, will allow 50% crowd capacity. Kohli, who made his Test debut in 2011, is 30-odd runs away from completing 8,000 runs in Test cricket. He averages 50.39 in the red-ball game and has 28 fifties and 27 centuries. The former India captain has not scored a century since 2019. He has 70 international tons this name and is one away from equaling Ricky Ponting's record of most centuries, across formats.The 33-year-old recently stepped down as India's Test captain following his side's series defeat in South Africa. Rohit Sharma has been named the captain in the longest format as well.A tough one to take. Thank you to all the fans for your support 🇮🇳🙏🏻 pic.twitter.com/24wyhnhdyW— Virat Kohli (@imVkohli) January 14, 2022 Team India recently white-washed Sri Lanka 3-0 in the Twenty20 International (T20I) series. Shreyas Iyer was named the Player of the Series for finishing as the leading run-scorer. He scored 204 runs in three games and was unbeaten on all occasions. Kohli was rested for the series, along with the likes of KL Rahul and Rishabh Pant.","pubDate":"2022-02-28 17:56:54","full_description":"Sunil Gavaskar ; Virat Kohli Former India captain Sunil Gavaskar has expressed that it will be \"disappointing\" to have no crowd in Mohali, which will host Virat Kohli's 100th Test. India and Sri Lanka are set to play a two-match Test series, starting March 4 at the PCA Stadium in Mohali. The Board of Control for Cricket in India (BCCI) has confirmed that the first Test will be played behind closed doors due to an increase in covid-19 cases in the Punjab city. One of the greatest players to have played cricket, Kohli, is set to make his 100th appearance in the whites for India and a section of fans are upset that there will be no fans to witness the legend's milestone game. PCA treasurer RP Singla on Saturday confirmed that fans won't be allowed to watch the first Test against Sri Lanka from the iconic stadium in Mohali. Singla said the decision has been taken in accordance with a directive from BCCI. \"Any game that you play, you want the crowd to be there. India has played without any crowds in recent times. Any performer, be it an actor, be it a cricketer, wants to play in front of the crowd. The 100th Test is very very special. Disappointing that there is going to be no crowd, but I think the decision has been taken in the greater interest. The cases have increased in and around Mohali, where the match is going to be played,\" Sunil Gavaskar told Sports Today. Meanwhile, the fans have questioned the decision, citing that the ongoing T20I series is being played with spectators in Dharamsala. Notably, Ahmedabad did not allow crowds for the three-match One-Day International (ODI) series against West Indies earlier this month, but the Eden Gardens in Kolkata had fans, although in a reduced capacity, for the final match of the series. Meanwhile, the M Chinnaswamy Stadium in Bengaluru, the venue for the second Test against Sri Lanka, will allow 50% crowd capacity. Kohli, who made his Test debut in 2011, is 30-odd runs away from completing 8,000 runs in Test cricket. He averages 50.39 in the red-ball game and has 28 fifties and 27 centuries. The former India captain has not scored a century since 2019. He has 70 international tons this name and is one away from equaling Ricky Ponting's record of most centuries, across formats. The 33-year-old recently stepped down as India's Test captain following his side's series defeat in South Africa. Rohit Sharma has been named the captain in the longest format as well. A tough one to take. Thank you to all the fans for your support 🇮🇳🙏🏻 pic.twitter.com/24wyhnhdyW Team India recently white-washed Sri Lanka 3-0 in the Twenty20 International (T20I) series. Shreyas Iyer was named the Player of the Series for finishing as the leading run-scorer. He scored 204 runs in three games and was unbeaten on all occasions. Kohli was rested for the series, along with the likes of KL Rahul and Rishabh Pant.","image_url":"https://assets.thehansindia.com/h-upload/2022/02/28/500x300_1279216-sunil-gavaskar.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan vs Australia: Ashton Agar reportedly gets DEATH THREAT ahead of Test series","link":"https://zeenews.india.com/cricket/pakistan-vs-australia-ashton-agar-reportedly-gets-death-threat-ahead-of-test-series-2440938.html","keywords":null,"creator":null,"video_url":null,"description":"The message was immediately reported to the two cricket boards -PCB and CA, as well as the security agencies.","content":null,"pubDate":"2022-02-28 16:03:00","full_description":"Cricket Australia (CA) and Pakistan Cricket Board (PCB) investigated a death threat sent to all-rounder Ashton Agar on social media, said a report from 'The Sydney Morning Herald'. It also said that the threat was sent to Agar's wife Madeleine through a direct message on social media, saying that the all-rounder shouldn't go to Pakistan. \"A portion of the message reads: \"This is a warning for your husband Ashton Agar if he comes to tour against Pakistan he won't come [back] alive.\" The message also references Agar's children, which he does not have,\" said the report. It also said that the message came from a fake account on Instagram potentially hailing from India. This person from Gujarat who's an Environmental Officer at IMC Limited posted insulting remarks about Ashton Agar and how Pakistan is gonna blow his head off etc. Already Cricket Australia and the Pakistani Cricket Board have release statements condemning these threats. pic.twitter.com/kGyIjgqECV — Tyrelle Audain (@tjaudain360) February 28, 2022 The message was immediately reported to the two cricket boards as well as the security agencies. \"Cricket Australia is aware of a social media post, of which the nature and content have been investigated by the PCB, CA and combined Government security processes. There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time,\" said a statement from CA. Pakistan had been forced to host their international matches in the United Arab Emirates (UAE) since the 2009 Lahore attack on the Sri Lanka Test side. Last year, New Zealand's white-ball tour of Pakistan was suddenly abandoned hours before the first match in Rawalpindi after a security threat was detected. Soon after, England cancelled their men's and women's tours to Pakistan, citing the 'mental and physical well-being' of players and security concerns. About Agar, the report said, \"Security agencies, CA and the PCB have procedures in place for investigating these kinds of messages that target players and their families. Agar was said to be in good spirits despite the direct message sent to his wife. He is comfortable with the procedures that have been followed.\" Australia's Test side, led by pacer Pat Cummins, landed in Pakistan's capital Islamabad on Sunday and is scheduled to start training at Rawalpindi Cricket Stadium on Tuesday ahead of the first Test on March 4.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Andar hi andar se I was feeling a little nervous”: Shreyas Iyer reminisces IPL 2022 auction experience in first interview as KKR captain","link":"https://thesportsrush.com/cricket-news-andar-hi-andar-se-i-was-feeling-a-little-nervous-shreyas-iyer-reminisces-ipl-2022-auction-experience-in-first-interview-as-kkr-captain/","keywords":["Cricket","IPL 2022","KKR","Indian Premier League","Kolkata Knight riders","shreyas iyer"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Shreyas Iyer reminisces IPL 2022 auction: The in-form Indian batter will be leading a new franchise in Indian Premier League 2022. Indian Premier League franchise Kolkata Knight Riders wouldn’t have asked for a better build-up regarding their newly announced captain ahead of the 15th season of the tournament scheduled to be played between March 26… The post “Andar hi andar se I was feeling a little nervous”: Shreyas Iyer reminisces IPL 2022 auction experience in first interview as KKR captain appeared first on The SportsRush.","content":"Shreyas Iyer reminisces IPL 2022 auction: The in-form Indian batter will be leading a new franchise in Indian Premier League 2022. Indian Premier League franchise Kolkata Knight Riders wouldn’t have asked for a better build-up regarding their newly announced captain ahead of the 15th season of the tournament scheduled to be played between March 26 – May 29. It was around a couple of weeks ago when KKR had named India batter Shreyas Iyer as Eoin Morgan’s successor. Iyer, 27, will become the sixth captain at Knight Riders joining the likes of Sourav Ganguly, Brendon McCullum, Gautam Gambhir, Dinesh Karthik and Morgan. Ladies and gentlemen, boys and girls, say hello to the NEW SKIPPER of the #GalaxyOfKnights অধিনায়ক #ShreyasIyer @ShreyasIyer15 #IPL2022 #KKR #AmiKKR #Cricket pic.twitter.com/veMfzRoPp2 — KolkataKnightRiders (@KKRiders) February 16, 2022 Coming on the back of a Man of the Series performance in a three-match T20I series against Sri Lanka, Iyer scored three consecutive half-centuries without getting dismissed even once. “I would be coming in with a much different mindset now. I’m now more mature and experienced in terms of my decision-making and captaincy skills. Really waiting eagerly to work with every individual in the team, and build that synergy which could really help the team perform at a different level,” Iyer said in a video posted on Kolkata’s social media platform Twitter handle. Shreyas Iyer IPL teams Iyer, who not only missed the first half of IPL 2021 but was also removed as captain by Delhi Capitals due to a shoulder injury, played under Rishabh Pant in the second leg of the 14th season in the UAE. Having made his debut for Capitals in 2015, Iyer represented the franchise for seven straight seasons amassing 2,375 runs in 87 matches (second-highest for a Delhi player) at an average and strike rate of 31.66 and 123.95 including 16 half-centuries. Second-highest run-scorer for DC in the history of the cash-rich league, Iyer had also led them in 41 matches (won 21, lost 18 and tied 2) between 2018-2020. Only former India batter Virender Sehwag (52), Capitals’ (then Daredevils) icon player in the inaugural season in 2008, has led them more than Iyer. Shreyas Iyer reminisces IPL 2022 auction experience With Delhi not retaining Iyer among their four players, the right-hand batter opted to enter the auction and not join any of the two new teams. As expected, Iyer allured immediate interest during the auction in Bengaluru earlier this month. An intense bidding contest between Royal Challengers Bangalore and DC sky-rocketed Iyer’s price (from a base price of INR 2 crore) as Lucknow Super Giants, KKR and Gujarat Titans also joined the fray. Eventually, it was the Knight Riders who acquired Iyer’s services for a whopping INR 12 crore per season. Iyer, who observed the mega auction alongside his Indian teammates from a team hotel, reminisced the experience of being nervous and not being able to control his emotions despite “trying” to act relaxed. “I was watching the auction and KKR went for me right from the start. There were other big franchises as well coming along and you know, the battle was going on. We, all of our [Indian] team members, were sitting together and watching the auction,” Iyer said. “My heartbeat was pumping. I wasn’t able to control my emotions. I was trying to act relaxed but you know, andar hi andar se [from inside] I was feeling a little nervous. So, eventually KKR got me. That feeling was amazing. I’m really proud.” The post “Andar hi andar se I was feeling a little nervous”: Shreyas Iyer reminisces IPL 2022 auction experience in first interview as KKR captain appeared first on The SportsRush.","pubDate":"2022-02-28 15:42:54","full_description":"Shreyas Iyer reminisces IPL 2022 auction: The in-form Indian batter will be leading a new franchise in Indian Premier League 2022. Indian Premier League franchise Kolkata Knight Riders wouldn’t have asked for a better build-up regarding their newly announced captain ahead of the 15th season of the tournament scheduled to be played between March 26 – May 29 . It was around a couple of weeks ago when KKR had named India batter Shreyas Iyer as Eoin Morgan’s successor. Iyer, 27, will become the sixth captain at Knight Riders joining the likes of Sourav Ganguly, Brendon McCullum, Gautam Gambhir, Dinesh Karthik and Morgan. 🚨 Ladies and gentlemen, boys and girls, say hello 👋 to the NEW SKIPPER of the #GalaxyOfKnights অধিনায়ক #ShreyasIyer @ShreyasIyer15 #IPL2022 #KKR #AmiKKR #Cricket pic.twitter.com/veMfzRoPp2 — KolkataKnightRiders (@KKRiders) February 16, 2022 Coming on the back of a Man of the Series performance in a three-match T20I series against Sri Lanka, Iyer scored three consecutive half-centuries without getting dismissed even once. “I would be coming in with a much different mindset now. I’m now more mature and experienced in terms of my decision-making and captaincy skills. Really waiting eagerly to work with every individual in the team, and build that synergy which could really help the team perform at a different level,” Iyer said in a video posted on Kolkata’s social media platform Twitter handle. Iyer, who not only missed the first half of IPL 2021 but was also removed as captain by Delhi Capitals due to a shoulder injury , played under Rishabh Pant in the second leg of the 14th season in the UAE. Having made his debut for Capitals in 2015, Iyer represented the franchise for seven straight seasons amassing 2,375 runs in 87 matches (second-highest for a Delhi player) at an average and strike rate of 31.66 and 123.95 including 16 half-centuries. Second-highest run-scorer for DC in the history of the cash-rich league, Iyer had also led them in 41 matches (won 21, lost 18 and tied 2) between 2018-2020. Only former India batter Virender Sehwag (52), Capitals’ (then Daredevils) icon player in the inaugural season in 2008, has led them more than Iyer. With Delhi not retaining Iyer among their four players , the right-hand batter opted to enter the auction and not join any of the two new teams. As expected, Iyer allured immediate interest during the auction in Bengaluru earlier this month. An intense bidding contest between Royal Challengers Bangalore and DC sky-rocketed Iyer’s price (from a base price of INR 2 crore) as Lucknow Super Giants, KKR and Gujarat Titans also joined the fray. Eventually, it was the Knight Riders who acquired Iyer’s services for a whopping INR 12 crore per season. Iyer, who observed the mega auction alongside his Indian teammates from a team hotel, reminisced the experience of being nervous and not being able to control his emotions despite “trying” to act relaxed. “I was watching the auction and KKR went for me right from the start. There were other big franchises as well coming along and you know, the battle was going on. We, all of our [Indian] team members, were sitting together and watching the auction,” Iyer said. “My heartbeat was pumping. I wasn’t able to control my emotions. I was trying to act relaxed but you know, andar hi andar se [from inside] I was feeling a little nervous. So, eventually KKR got me. That feeling was amazing. I’m really proud.”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PCB claims online threat sent to Aussie player Agar's partner but wasn't credible","link":"https://www.indiatvnews.com/sports/cricket/pcb-claims-online-threat-sent-to-aussie-player-agars-partner-but-wasnt-credible-2022-02-28-762014","keywords":null,"creator":null,"video_url":null,"description":"The Pakistan Cricket Board (PCB) has claimed that a threat was sent to the partner of touring Australian cricketer Ashton Agar on social media but it was not found to be \"credible\" after investigation.","content":null,"pubDate":"2022-02-28 15:40:15","full_description":"The Pakistan Cricket Board (PCB) has claimed that a threat was sent to the partner of touring Australian cricketer Ashton Agar on social media but it was not found to be \"credible\" after investigation. Australia are touring Pakistan after 24 years amid tight security. \"The PCB is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined Government security agencies,” the board said in a statement. \"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time,\" it added. The message was sent to Agar's partner, Madeleine, on social media, which was immediately reported to Cricket Australia and the PCB. \"The Australian team security also investigated the matter and do not believe it is a credible threat,\" the source said. When New Zealand toured Pakistan last September threats were sent out to the team social media. Eventually, the Black Caps abandoned the tour without playing their white-ball series on the advice of their government which said there was a direct security threat to the touring side. Pakistan has hosted only six Test matches since 2009 due to security reasons after the Sri Lanka team was attacked by terrorists in Lahore in March, 2009.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"`My heart was pumping, I wasn`t able to…`: KKR captain Shreyas Iyer REVEALS how he felt while watching IPL... - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMiqgFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2NyaWNrZXQvbXktaGVhcnQtd2FzLXB1bXBpbmctaS13YXNudC1hYmxlLXRvLWtrci1jYXB0YWluLXNocmV5YXMtaXllci1yZXZlYWxzLWhvdy1oZS1mZWx0LXdoaWxlLXdhdGNoaW5nLWlwbC0yMDIyLWF1Y3Rpb24td2F0Y2gtMjQ0MDkyMC5odG1sL2FtcNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"`My heart was pumping, I wasn`t able to…`: KKR captain Shreyas Iyer REVEALS how he felt while watching IPL...  Zee NewsIPL 2022: Shreyas Iyer PROMISES to win IPL title for KKR  InsideSport'More Mature, Experienced in Terms of Decision Making, Captaincy Skills: Shreyas Iyer Ahead of IPL 2022  News18IPL 2022: My Heart Was Pumping, And I Wasn't Able To Control My Emotions: Shreyas Iyer On Watching Mega Auction  Cricket AddictorShreyas to approach captaincy with different mindset  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-02-28 15:04:41","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Pakistan claims online threat sent to Aussie player Agar's partner but not credible","link":"https://sportstar.thehindu.com/cricket/pakistan-vs-australia-ashton-agar-partner-receives-online-threats/article38442892.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"The message was sent to Agar's partner, Madeleine, on social media, which was immediately reported to Cricket Australia and the PCB.","content":null,"pubDate":"2022-02-28 14:56:14","full_description":"The Pakistan Cricket Board (PCB) has claimed that a threat was sent to the partner of touring Australian cricketer Ashton Agar on social media but it was not found to be \"credible\" after investigation. Australia is touring Pakistan after 24 years amid tight security. \"The PCB is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined Government security agencies,” the board said in a statement. READ: Shreyas to approach captaincy with different mindset \"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time,\" it added. The message was sent to Agar's partner, Madeleine, on social media, which was immediately reported to Cricket Australia and the PCB. \"The Australian team security also investigated the matter and do not believe it is a credible threat,\" the source said. When New Zealand toured Pakistan last September threats were sent out to the team social media. ALSO READ: Gurbaz ton helps Afghanistan beat Bangladesh in 3rd ODI Eventually, the Black Caps abandoned the tour without playing their white-ball series on the advice of their government which said there was a direct security threat to the touring side. Pakistan has hosted only six Test matches since 2009 due to security reasons after the Sri Lanka team was attacked by terrorists in Lahore in March, 2009.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Online Threat Sent To Australian Player's Partner Not Credible: Pak Board","link":"https://sports.ndtv.com/cricket/online-threat-sent-to-touring-australian-players-partner-not-credible-pakistan-cricket-board-2795256","keywords":null,"creator":null,"video_url":null,"description":"The message was sent to Agar's partner, Madeleine, on social media, which was immediately reported to Cricket Australia and the PCB.","content":null,"pubDate":"2022-02-28 14:39:26","full_description":"The Pakistan Cricket Board (PCB) has claimed that a threat was sent to the partner of touring Australian cricketer Ashton Agar on social media but it was not found to be \"credible\" after investigation. Australia are touring Pakistan after 24 years amid tight security. \"The PCB is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined Government security agencies,” the board said in a statement. \"There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time,\" it added. The message was sent to Agar's partner, Madeleine, on social media, which was immediately reported to Cricket Australia and the PCB. \"The Australian team security also investigated the matter and do not believe it is a credible threat,\" the source said. When New Zealand toured Pakistan last September threats were sent out to the team social media. Eventually, the Black Caps abandoned the tour without playing their white-ball series on the advice of their government which said there was a direct security threat to the touring side. Promoted Pakistan has hosted only six Test matches since 2009 due to security reasons after the Sri Lanka team was attacked by terrorists in Lahore in March, 2009. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2021-01/pjqmqd4g_ashton-agar-twitter_625x300_02_January_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Women's World Cup 2022: India Full Schedule, All teams Fixtures, Match Timings and Venues","link":"https://www.indiatvnews.com/sports/cricket/icc-womens-world-cup-2022-full-schedule-date-timings-in-ist-indias-fixtures-venues-live-streaming-online-tv-2022-02-28-762001","keywords":null,"creator":null,"video_url":null,"description":"The ICC Women’s Cricket ODI World Cup 2022 will commence on Friday, 4th March, in New Zealand. The 29-day marquee tournament will see a total of eight teams battle to get their hands on the trophy.","content":null,"pubDate":"2022-02-28 14:35:49","full_description":"The ICC Women’s Cricket ODI World Cup 2022 will commence on Friday, 4th March, in New Zealand. The 29-day marquee tournament will see a total of eight teams battle to get their hands on the trophy. India's campaign in the World Cup will begin on 6th March when they take on Pakistan Women. India vs Pakistan – 6th March – 6:30 am IST New Zealand vs India – 10th March – 6:30 am IST India vs West Indies – 12th March – 6:30 am IST England vs India – 16th March – 6:30 am IST Australia vs India – 19th March 2022 – 6:30 am IST Bangladesh vs India – 22nd March 2022 – 6:30 am IST India vs South Africa – 27th March 2022 – 6:30 am IST New Zealand vs West Indies (6.30 am), March 4, Tauranga Bangladesh vs South Africa (2.30 am), March 5, Dunedin Australia vs England (6.30 am), March 5, Hamilton Pakistan vs India (6.30 am), March 6, Tauranga New Zealand vs Bangladesh (2.30 am), March 7, Dunedin Australia vs Pakistan (6.30 am), March 8, Tauranga West Indies vs England (2.30 am), March 9, Dunedin India vs New Zealand (6.30 am), March 10, Hamilton Pakistan vs South Africa (6.30 am), March 11, Tauranga India vs West Indies ( 6.30 am), March 12, Hamilton New Zealand vs Australia (2.30 am), March 13, Wellington South Africa vs England (6.30 am), March 14, Tauranga Pakistan vs Bangladesh (2.30 am), March 14, Hamilton Australia vs West Indies (6.30 am), Match 15, Tauranga India vs England (6.30 am), March 16, Wellington New Zealand vs South Africa (6.30 am), March 17, Hamilton Bangladesh vs West Indies (2.30 am), March 18, Tauranga India vs Australia (6.30 am), March 19, Auckland New Zealand vs England (2.30 am), March 20, Auckland West Indies vs Pakistan (6.30 am), March 21, Hamilton India vs Bangladesh (6.30 am), March 22, Hamilton South Africa vs West Indies (2.30 am), March 24, Wellington England vs Pakistan (6.30 am), March 24, Wellington Bangladesh vs Australia (2.30 am), March 25, Christchurch New Zealand vs Pakistan (2.30 am), March 26, Wellington England vs Bangladesh (2.30 am), March 27, Christchurch India vs South Africa (6.30 am), March 27, Wellington Semi-Final 1 (2.30 am), March 30, Christchurch Semi-Final 2 (6.30 am), March 31, Wellington Final (6.30 am), April 3, Christchurch You can catch all the LIVE action on the Star Sports Network in India. You can catch the LIVE streaming of the World Cup matches on Disney+Hotstar. (Captain), (vice-captain), , Shafali Verma, Yastika Bhatia, , Richa Ghosh (wicket-keeper), Sneh Rana, Jhulan Goswami, , Meghna Singh, Renuka Singh Thakur, (wicket-keeper), Rajeshwari Gayakwad, . Sabbhineni Meghana, , Simran Dil Bahadur.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Our snipers will blow his head”: Ashton Agar wife receives death threat for husband days before Pakistan vs Australia Rawalpindi Test","link":"https://thesportsrush.com/cricket-news-our-snipers-will-blow-his-head-ashton-agar-wife-receives-death-threat-for-husband-days-before-pakistan-vs-australia-rawalpindi-test/","keywords":["Cricket","ashton agar","Australia","Australia tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ashton Agar wife receives death threat: The Australia all-rounder has been targeted via an online death threat sent to her partner. Australia all-rounder Ashton Agar has received a death threat warning him to not travel with an 18-member squad to Pakistan for an all-format tour to be played between March 4 – April 5. According… The post “Our snipers will blow his head”: Ashton Agar wife receives death threat for husband days before Pakistan vs Australia Rawalpindi Test appeared first on The SportsRush.","content":"Ashton Agar wife receives death threat: The Australia all-rounder has been targeted via an online death threat sent to her partner. Australia all-rounder Ashton Agar has received a death threat warning him to not travel with an 18-member squad to Pakistan for an all-format tour to be played between March 4 – April 5. According to a report in Sydney Morning Herald, the threat was sent to Agar’s wife Madeleine Agar on her Instagram handle. Meanwhile, Agar and the rest of the Australian contingent had landed in Islamabad on Sunday. While Test captain Pat Cummins and batter Usman Khawaja have since attended virtual press conferences, these two, Agar, Test vice-captain Steven Smith and spinner Mitchell Swepson have uploaded social media posts around warm and safe welcome in Pakistan. Ashton Agar wife receives death threat for husband days before 1st Pakistan vs Australia Test A screenshot of three messages sent to Madeleine has gone viral most recently. “This is an warning for your husband ashton Agar if he comes for tour against Pakistan he won’t come alive,” reads the second of the three messages. While the real identity of the sender remains unknown at this point in time, CA (Cricket Australia) and PCB (Pakistan Cricket Board) have released a joint statement on the matter expressing confidence in the “security arrangements” put in place for this series. “Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined government security agencies. There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time,” read the statement. Agar, 28, had last played a Test match in Bangladesh almost half-a-decade ago. Having played two Test matches each in England and Bangladesh separated by a four-year gap, Agar hasn’t played much of red-ball cricket at the highest level. The left-arm spinner who can also contribute with the bat is part of a three-member spin unit comprising of veteran Nathan Lyon and uncapped Mitchell Swepson. The post “Our snipers will blow his head”: Ashton Agar wife receives death threat for husband days before Pakistan vs Australia Rawalpindi Test appeared first on The SportsRush.","pubDate":"2022-02-28 14:13:12","full_description":"Ashton Agar wife receives death threat: The Australia all-rounder has been targeted via an online death threat sent to her partner. Australia all-rounder Ashton Agar has received a death threat warning him to not travel with an 18-member squad to Pakistan for an all-format tour to be played between March 4 – April 5. According to a report in Sydney Morning Herald, the threat was sent to Agar’s wife Madeleine Agar on her Instagram handle. It is worth mentioning that New Zealand had also received a similar threat message right before their first ODI against Pakistan in Rawalpindi last year. A delay in toss led to New Zealand’s last-minute withdrawal which ended up having a negative impact on the subsequent England’s tour as well. Meanwhile, Agar and the rest of the Australian contingent had landed in Islamabad on Sunday. While Test captain Pat Cummins and batter Usman Khawaja have since attended virtual press conferences , these two, Agar, Test vice-captain Steven Smith and spinner Mitchell Swepson have uploaded social media posts around warm and safe welcome in Pakistan. A screenshot of three messages sent to Madeleine has gone viral most recently. “This is an warning for your husband ashton Agar if he comes for tour against Pakistan he won’t come alive,” reads the second of the three messages. While the real identity of the sender remains unknown at this point in time, CA (Cricket Australia) and PCB (Pakistan Cricket Board) have released a joint statement on the matter expressing confidence in the “security arrangements” put in place for this series. “Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined government security agencies. There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time,” read the statement. ALSO READ: How to book tickets for Pakistan vs Australia Test matches? Agar, 28, had last played a Test match in Bangladesh almost half-a-decade ago. Having played two Test matches each in England and Bangladesh separated by a four-year gap, Agar hasn’t played much of red-ball cricket at the highest level. The left-arm spinner who can also contribute with the bat is part of a three-member spin unit comprising of veteran Nathan Lyon and uncapped Mitchell Swepson.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Former Australian Wicketkeeper Rodney Marsh In Induced Coma","link":"https://sports.ndtv.com/cricket/former-australian-wicketkeeper-rodney-marsh-in-induced-coma-2795124","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket great Rodney Marsh was \"in the fight of his life\" Monday after being placed in an induced coma following a major heart attack last week, his family said.","content":null,"pubDate":"2022-02-28 13:55:19","full_description":"Australian cricket great Rodney Marsh was \"in the fight of his life\" Monday after being placed in an induced coma following a major heart attack last week, his family said. The 74-year-old wicketkeeper, who played 96 Tests and was later a long-time national selector, was hospitalised after collapsing at a charity event in Queensland state. His son Paul said his condition was \"critical\". \"He is currently in the fight of his life and remains in an induced coma,\" he said in a statement released late Sunday. \"At the moment this is a waiting game and we are unlikely to have any certainty for some time. Promoted \"We know there is a lot of interest in dad's condition and our family has been overwhelmed by the messages of love and support from all around the world,\" he added. Marsh remains one of the finest wicketkeepers to have ever played international cricket, collecting what was then a world-record 355 Test dismissals.","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"How ‘undateable’ Aussie legend found love","link":"https://www.news.com.au/sport/sports-life/champions/how-undateable-australian-cricketer-glenn-mcgrath-found-love-after-wifes-tragic-death/news-story/91cb56403e14377924b02a912479c3ed","keywords":null,"creator":null,"video_url":null,"description":"Australian cricket legend Glenn McGrath has opened up on how he rediscovered love after the tragic death of his first wife Jane, whose legacy is still felt within the cricket community.","content":null,"pubDate":"2022-02-28 13:17:00","full_description":"Australian cricket legend Glenn McGrath has opened up on how he rediscovered love after the tragic death of his first wife Jane, whose legacy is still felt within the cricket community. Jane, who was diagnosed with breast cancer in 1997, founded the McGrath Foundation in 2005 with Glenn and close friends Tracy Bevan to help raise funds for breast care nurses in rural and regional Australia. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Start your free trial now > She succumbed to the illness in 2008 aged 42, leaving behind two kids — son James and daughter Holly. Every summer on day three of the New Year’s Test, the Sydney Cricket Ground turns pink in celebration of Jane’s life and the McGrath Foundation. And it wasn’t long after the inaugural Jane McGrath Pink Day in 2009 that Glenn met his second wife Sara Leonardi in Cape Town, South Africa. “When I met Glenn, he very quickly told me that he was a widower and that he had two kids,” Sara told ABC’s Australian Story . “I remember asking him, ‘What do you do?’ And he’s like, ‘I play cricket.’ And I was like, ‘No, I mean how do you pay your mortgage?’ And he said, ‘No, I play cricket’. “When you make the decision to be with someone, you take the whole package. I had no illusions that things were going to be peachy peachy, but I knew that Glenn and I loved each other and we were going to make it work.” Within a year of meeting, Sara up-ended her life and moved to Australia to live with Glenn and his young family. “I just enjoyed being with her,” Glenn explained. “She’s fun, she’s exciting. She’s got all these ideas and never wants to sit still. “She was thrown in the deep end. For her to come out here and come into a family where they lost their mother previously, there was a foundation because of Jane and her experience, took a lot of courage and character.” Despite the challenges of moving in with a family that had recently lost its mother, Sara quickly adjusted to the stepmother role. “I can’t even imagine what it would be like to come into a relationship knowing that you’re taking on not just the man but also two kids as well,” Holly said. “From the first day I met her, she was always so kind and caring. She kind of knew what we needed at the time. You can tell that she’s Italian, like she runs a tight ship and that was good. We needed that.” Because of Glenn’s popularity among the Australian community, his love life inevitably caught the attention of media outlets following Jane’s death. Despite keeping a low profile early in the relationship, a photographer snapped Glenn and Sara sitting together at a Double Bay cafe in early 2010. The couple were uncertain how the public would perceive their relationship, but media coverage was overwhelmingly positive. “It was on the front page of the newspaper and I was like, thank God I got my hair done,” Sara said. Glenn continued: “We found out the guy sold it for $95,000. If I knew that I’d have taken the photo myself. “We had six to seven cars following us everywhere we went. Poor old Sara was taking James to play cricket, she didn’t even know where she was going and there’s cars and motorbikes following. It was just ridiculous.” Sara fell pregnant with Glenn’s third child Madison via IVF, but she become increasingly unwell after developing pre-eclampsia. Her condition deteriorated considerably eight weeks out from the due date, with doctors recommending an emergency caesarean. “She could hardly breathe,” Glenn said. “Her lungs were filling with fluid and the doctor came to us and he said, ‘We need to deliver your baby now because your wife will not be alive in six hours’. And I thought, ‘S**t, you know, here we go again’.” Sara recalled: “I said to him, ‘If I’m gone, you’re absolutely undateable. Like, who’s going to date you if I’m gone?’” Madison weighed just 1.8kg at birth, but was otherwise a healthy baby girl. James and Holly have become increasingly involved with the McGrath Foundation as they’ve grown up, which Sara encouraged. “Did I understand Jane’s legacy? Certainly not from afar, but after being here and seeing the impact that she’d had on people with sharing her story, I understand why Australia had so much respect and love for her,” Sara explained. “Nobody lived it like Jane and Glenn did. It’s their life. It’s the legacy of Jane, it will be the legacy of Glenn and it will be the legacy of James, of Holly and of Madison as well. So it is a privilege to be involved with the foundation.” Australian sporting icon John Landy, the second person to run a sub four-minute mile, has passed away aged 91 surrounded by family. The partner of NRL icon Gorden Tallis has reportedly been rushed to hospital after a gas bottle exploded at the couple’s home. Alex “Chumpy” Pullin’s partner Ellidy has opened up on the miracle post-mortem sperm retrieval process that led to her baby.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"How ‘undateable’ Aussie legend found love","link":"https://www.cairnspost.com.au/affiliates/kayo/how-undateable-australian-cricketer-glenn-mcgrath-found-love-after-wifes-tragic-death/news-story/91cb56403e14377924b02a912479c3ed","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian cricket legend Glenn McGrath has opened up on how he rediscovered love after the tragic death of his first wife Jane, whose legacy is still felt within the cricket community.","content":null,"pubDate":"2022-02-28 13:13:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie cricketer sent death threat on eve of historic series in Pakistan","link":"https://www.foxsports.com.au/cricket/australia/cricket-2022-australia-vs-pakistan-tour-ashton-agar-death-threat-usman-khawaja-pat-cummins-video/news-story/358321f564a6f30a20e17a8b667e38c7","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia and the Pakistan Cricket Board have responded swiftly to a death threat delivered to Australian all-rounder Ashton Agar, believing it was “not considered a risk”.","content":null,"pubDate":"2022-02-28 13:08:00","full_description":"Cricket Australia and the Pakistan Cricket Board have responded swiftly to a death threat delivered to Australian all-rounder Ashton Agar, believing it was “not considered a risk”. Agar’s partner was sent a social media message — likely from India in an attempt to disrupt the historic tour — warning that the cricketer should not travel to Pakistan or risk not returning. “Your children will miss their Father if he comes to Pakistan. Our snipers will blow his head,” part of the message reads. The message was immediately reported to authorities, including the combined Government security agencies. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Start your free trial now > Cricket Australia don’t consider a death threat sent to Ashton Agar’s partner as credible. Picture. Phil Hillyard Source: News Corp Australia In a statement, it was found that the threat was not credible. “Cricket Australia is aware of a social media post, of which the nature and content has been investigated by the PCB, CA and combined Government security processes,” a CA statement read. “There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk. No further comment will be made at this time.” Australia touched down in Islamabad less than 48 hours ago for what is their first tour of Pakistan in 24 years due to security risks. Some 4,000 police and military personnel are guiding the team over the course of the six week tour, which includes three Tests, three ODIs and a lone T20 fixture. David Warner, Usman Khawaja and Steve Smith will form three of Australia’s top four in Pakistan. Photo: Getty Images Source: Getty Images Various outlets in Pakistan are reporting that the threat sent to Agar’s partner originated from India and was a plot to try and scare the tourists from completing their tour. The threat will not be looked at fondly by the PCB on the eve of the highly anticipated series. New Zealand left Pakistan on the day of its first game last year after receiving threats. England then cancelled its series. Teams have stayed away since terrorists attacked a Sri Lanka team bus on the way to a game in Lahore in 2009. Since arriving in Pakistan, Australia’s senior members have said they feel comfortable and safe in the country. On Tuesday, Pakistan-born Australian batsman Usman Khawaja “There is obviously a lot of security around us, but they hide pretty well in plain sight, and you can’t see too much at the moment,” Khawaja told reporters via zoom. “I think they’re doing a pretty good job just being around but not being seen.” Khawaja has family in Karachi, but because of the security bubble they are operating in won’t be able to see them. READ MORE SELECTION STATE OF PLAY: Aussies’ unthinkable Lyon call; Cummins hint in first Test shootout ‘PRESIDENT-LEVEL SECURITY’: 4,000 police on deck as Aussies end 24-year Pakistan tour drought Not that he is complaining, with the modern cricketer used to being ushered to the cricket venue from the hotel in parts of the world like India and Bangladesh. “Family or not family, they are quite strict, which is fair enough too,” Khawaja said. Khawaja also spoke optimistically of India playing in Pakistan and it being the “next goal for Pakistan cricket”. Cummins to favour quicks in Pakistan? | 01:02 A day earlier, Australian captain Pat Cummins said it was “comforting” the measures CA had gone to ensure the tour was a success. “We’re really lucky to be surrounded by so many professionals,” Cummins told reporters just hours after arriving and being taken straight to their team hotel. “That was one of the big factors that we wanted to be thorough on before arriving here: not only security but biosecurity. Everyone’s done a fantastic job. “We feel like we’re here and we can just focus on the cricket.” After taking the day to settle in, Australia will hold their first training session at Rawalpindi on Wednesday - two days before the first Test.","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie cricket star subject of death threat","link":"https://www.cairnspost.com.au/sport/cricket/cricket-australia-investigates-death-threat-ahead-of-historic-pakistan-tour/news-story/0a14d5c70e799d26560bc65d13b33ea7","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia has investigated a death threat reportedly sent to the partner of spin bowler Ashton Agar ahead of Australia’s historic tour of Pakistan.","content":null,"pubDate":"2022-02-28 13:07:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie cricket star subject of death threat","link":"https://www.news.com.au/sport/cricket/cricket-australia-investigates-death-threat-ahead-of-historic-pakistan-tour/news-story/0a14d5c70e799d26560bc65d13b33ea7","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia has investigated a death threat reportedly sent to the partner of spin bowler Ashton Agar ahead of Australia’s historic tour of Pakistan.","content":null,"pubDate":"2022-02-28 13:07:00","full_description":"Cricket Australia has investigated a death threat reportedly sent to the partner of spin bowler Ashton Agar ahead of Australia’s historic tour of Pakistan. As first revealed by The Sydney Morning Herald , a message was sent to Agar’s partner on social media warning that the cricketer should not travel to Pakistan. The message was immediately reported to CA and the Pakistan Cricket Board. Watch Australia’s Tour of Pakistan on Kayo. Every Test, ODI and T20 Live & On-Demand. New to Kayo? Start your free trial now > Screenshots of the alleged death threat have circulated social media, a portion of which read: “This is an warning for your husband Ashton Agar. If he comes for tour against Pakistan he won’t come alive. “Your children will miss there father if he comes to Pakistan.” It is believed the message was sent from a fake Instagram account, potentially based in India. On Monday evening, a Cricket Australia spokesperson confirmed the organisation was aware of the social media post, which the PCB and government security agencies had also investigated. “There are extensive security plans in place for this type of social media activity, which, in this case, is not considered a risk,” the statement read. “No further comment will be made at this time.” Due to safety concerns, the Australian men’s cricket team had not toured Pakistan since 1998, when former Test captain Mark Taylor famously scored an unbeaten 334 in Peshawar. Pakistan has been forced to host international matches in the United Arab Emirates since the tragic 2009 Lahore attack on the Sri Lankan cricket team. Last year, New Zealand’s white-ball tour of Pakistan was abruptly abandoned hours before the first match following a security threat. The Australian Test squad landed in Pakistan on Sunday, with training scheduled to commence at Rawalpindi Cricket Stadium on Tuesday. A real shame. Pakistan cricket fans don't deserve it. https://t.co/MuvMp32VL3 An Australian team spokesperson has confirmed Ashton Agar's partner was the subject of a death threat, warning the cricketer not to tour Pakistan. Team security do not believe it is a credible threat. There is a suggestion it is from a fake Instagram account from India #PAKvAUS Islamabad-born batter Usman Khawaja said the players had not faced any issues since touching down in the Asian nation. “It’s not too dissimilar to the other subcontinental tours we’ve toured,” he told reporters on Monday. “Even when we went to India or Bangladesh, we weren’t really allowed outside of the hotel room much anyway, other than training and playing games. “It’s pretty similar, I think. “Obviously there’s a lot of security around us but they hide pretty well in plain sight. “They’re doing a pretty good job at being around but not being seen.” On Sunday, Australian Test captain Pat Cummins praised CA and the PCB for the security measures that ensured the tour would be a success. “We’re really lucky to be surrounded by so many professionals,” he told reporters. “That was one of the big factors that we wanted to be thorough on before arriving here: not only security but biosecurity. Everyone’s done a fantastic job. “We feel like we’re here and we can just focus on the cricket.” Australia’s first Test match against Pakistan gets underway at Rawalpindi Cricket Stadium on Friday, with the first ball scheduled for 4pm AEDT. Australia’s tour of Pakistan March 4-8 — First Test, Rawalpindi March 12-16 — Second Test, Karachi March 21-25 — Third Test, Lahore March 29 — First ODI, Rawalpindi March 31 — Second ODI, Rawalpindi April 2 — Third ODI, Rawalpindi April 5 — Only T20I, Rawalpindi Australian cricket legend Glenn McGrath has opened up on how he rediscovered love after the tragic death of his first wife Jane. Australia has arrived in Islamabad for its first tour of Pakistan since 1998 and will be subject to strict security protocols during its stay. Will Young has pulled off an early contender for catch of the year, with his “outrageous” outfield grab quickly circulating social media.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Death threat against Australian cricketer in Pakistan","link":"https://www.cairnspost.com.au/sport/cricket/australian-cricketer-ashton-agar-subjected-to-death-threat-in-pakistan/news-story/8a77c43ee58238bcc93bcaa405181306","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia has dismissed a death threat against one of the Australian cricketers in Pakistan.","content":null,"pubDate":"2022-02-28 12:42:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Rohan Kunnummal and the never-ending hundreds","link":"https://sportstar.thehindu.com/cricket/domestic/rohan-kunnummal-kerala-cricket-domestic-first-class-ranji-trophy-sports-news/article38442783.ece","keywords":null,"creator":["P.K. Ajith Kumar"],"video_url":null,"description":"Rohan Kunnummal is the first batter from Kerala to score three consecutive hundreds in first-class cricket.","content":null,"pubDate":"2022-02-28 12:41:15","full_description":"Rohan Kunnummal had dropped Umang Kumar at slip when Kerala was desperately looking for a breakthrough on the final morning of the Ranji Trophy match against Gujarat at the Saurashtra Cricket Stadium on Sunday. He was gutted. The debutant batter went on to score another 36 runs and his partnership with Karan Patel yielded another 62. Rohan, however, got an opportunity to make amends. And he did – in stunning fashion. His unbeaten 106 not off just 87 balls took Kerala to one of its finest ever wins, as it chased down a target of 214 scoring at six-an-over. And he is the first batter from Kerala to score three consecutive hundreds in first-class cricket. The day after, the 23-year-old admits life seems like a dream for him at the moment. “It is a great feeling, yes,” he tells Sportstar. “It is nice that I could score three hundreds in a row, but what made me really happy was that I could help my team win.” READ| ICC plans to streamline men's, women's cricket calendar to avoid clashes He confesses he was feeling terrible after dropping Umang. “After that I just hoped that I would be able to win the match for my team,” he says. This was only Rohan’s third Ranji match, after making his debut in the 2019-20 season. “I was injured in that match and then Covid happened,” he says. “But I was hopeful that I could be picked for the Ranji Trophy as I had done well in both the Vijay Hazare and Syed Mushtaq Ali Trophy tournaments.” READ| Ranji Trophy: Baroda’s Vishnu Solanki to play third match despite losing father After being initiated into the sport by his father Sushil, a University player, Rohan honed his skills at the Sussex Cricket Academy in Kozhikode (his home is in the neighbouring town of Koyilandy). He made a sudden impact in age group cricket. He had made headlines when he hit 253 not out against Delhi at the Cooch Behar Trophy in 2016-17. That season he was named initially in the India Under-19 team but was omitted as the BCCI decided only those eligible for 2018 Under-19 World Cup would be picked. There was no doubt about his talent. And he is one of those batters who could impress you straight away: he is a delightful strokemaker with great timing and a sense of placement. Chandrakant Pandit had once told this correspondent that Rohan was the most promising batter he found during his coaching stint in Kerala. He is turning promise into performance.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest 4th innings total in Christchurch: What is the highest successful run chase at Hagley Oval Christchurch Tests?","link":"https://thesportsrush.com/cricket-news-highest-4th-innings-total-in-christchurch-what-is-the-highest-successful-run-chase-at-hagley-oval-christchurch-tests/","keywords":["Cricket","New Zealand","South Africa","South Africa tour of New Zealand 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest 4th innings total in Christchurch: The home team will have to seal a record chase in order to win the match and series tomorrow. A record run-chase stands between New Zealand and a maiden Test series victory against South Africa. While the Black Caps had successfully managed to end an 18-year drought by winning… The post Highest 4th innings total in Christchurch: What is the highest successful run chase at Hagley Oval Christchurch Tests? appeared first on The SportsRush.","content":"Highest 4th innings total in Christchurch: The home team will have to seal a record chase in order to win the match and series tomorrow. A record run-chase stands between New Zealand and a maiden Test series victory against South Africa. While the Black Caps had successfully managed to end an 18-year drought by winning the first Test against South Africa in Christchurch, their first-ever series victory against the Proteas requires a heroic effort on a Day 5 pitch at the same venue. Chasing a 426-run target in the second Test, New Zealand ended the fourth day on 94/4 in 42 overs. 332 runs to be scored with six wickets in hand doesn’t make them the favourites but the hosts would want to leave no stone unturned to achieve a historic Test series victory. Oh what a gun day it was #NZvSA #BePartOfIt pic.twitter.com/w3bnGgFBG2 — Cricket South Africa (@OfficialCSA) February 28, 2022 While batter Devon Conway (60*) and wicket-keeper batter Tom Blundell (1*) will resume New Zealand’s innings on Day 5, first innings centurion Colin de Grandhomme would be doubtlessly expected to shoulder responsibility for the second time in a row. Hagley Oval, which has been hosting Test matches in Christchurch since 2014, has never witnessed a 300+ fourth innings total in the 11 Tests that have been played here in the last eight years. ALSO WATCH: Will Young grabs terrific boundary catch to dismiss Marco Jansen on Day 4 As far as highest Test run-chases at Hagley Oval are concerned, New Zealand have emerged as the victorious side on all four previous occasions. Having said that, the highest that they have chased at this venue is a 132-run target (against India in 2020). If New Zealand are to win this match, they will have to post a more than three times innings total than their previous best. Highest 4th innings total in Christchurch Tests Team Score Overs Opposition Year New Zealand 256/8 124.4 England 2018 Sri Lanka 236 106.2 New Zealand 2018 Australia 201/3 54 New Zealand 2016 New Zealand 132/3 36 India 2020 New Zealand 111/1 18.4 Bangladesh 2017 Highest successful run chase at Hagley Oval Team Score Overs Opposition Year New Zealand 132/3 36 India 2020 New Zealand 111/1 18.4 Bangladesh 2017 New Zealand 108/2 31.2 Pakistan 2016 New Zealand 107/2 30.4 Sri Lanka 2014 New Zealand’s highest 4th innings total at home Score Overs Opposition Year Venue 451 93.3 England 2002 Jade Stadium 431 118.5 England 2008 McLean Park 324/5 107 Pakistan 1997 Lancester Park 311 100.3 England 2008 Basin Reserve 302 91.5 Australia 2010 Seddon Park The post Highest 4th innings total in Christchurch: What is the highest successful run chase at Hagley Oval Christchurch Tests? appeared first on The SportsRush.","pubDate":"2022-02-28 12:17:37","full_description":"Highest 4th innings total in Christchurch: The home team will have to seal a record chase in order to win the match and series tomorrow. A record run-chase stands between New Zealand and a maiden Test series victory against South Africa. While the Black Caps had successfully managed to end an 18-year drought by winning the first Test against South Africa in Christchurch, their first-ever series victory against the Proteas requires a heroic effort on a Day 5 pitch at the same venue. Chasing a 426-run target in the second Test, New Zealand ended the fourth day on 94/4 in 42 overs. 332 runs to be scored with six wickets in hand doesn’t make them the favourites but the hosts would want to leave no stone unturned to achieve a historic Test series victory. Oh what a gun day it was 🔥 #NZvSA #BePartOfIt pic.twitter.com/w3bnGgFBG2 — Cricket South Africa (@OfficialCSA) February 28, 2022 While batter Devon Conway (60*) and wicket-keeper batter Tom Blundell (1*) will resume New Zealand’s innings on Day 5, first innings centurion Colin de Grandhomme would be doubtlessly expected to shoulder responsibility for the second time in a row. Hagley Oval, which has been hosting Test matches in Christchurch since 2014, has never witnessed a 300+ fourth innings total in the 11 Tests that have been played here in the last eight years. ALSO WATCH: Will Young grabs terrific boundary catch to dismiss Marco Jansen on Day 4 As far as highest Test run-chases at Hagley Oval are concerned, New Zealand have emerged as the victorious side on all four previous occasions. Having said that, the highest that they have chased at this venue is a 132-run target (against India in 2020). If New Zealand are to win this match, they will have to post a more than three times innings total than their previous best.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Carey ready to defend her World Cup spot","link":"https://www.news.com.au/sport/cricket/carey-ready-to-defend-her-world-cup-spot/video/16d2d3a0e99bcc17ad8218c18595305d","keywords":null,"creator":null,"video_url":null,"description":"Cricket: With the Australian boasting plenty of depth heading into the World Cup, Nicola Carey has a battle on her hands to hold on to her spot.","content":null,"pubDate":"2022-02-28 11:45:17","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Carey ready to defend her World Cup spot","link":"https://www.cairnspost.com.au/sport/cricket/carey-ready-to-defend-her-world-cup-spot/video/16d2d3a0e99bcc17ad8218c18595305d","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: With the Australian boasting plenty of depth heading into the World Cup, Nicola Carey has a battle on her hands to hold on to her spot.","content":null,"pubDate":"2022-02-28 11:45:17","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Usman Khawaja excited to play in Pakistan","link":"https://www.cairnspost.com.au/sport/cricket/usman-khawaja-excited-to-play-in-pakistan/video/19b1eec99cad3407d38f2dba8f8899b9","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Usman Khawaja is set to play in his country of birth for the first time.","content":null,"pubDate":"2022-02-28 11:36:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Usman Khawaja excited to play in Pakistan","link":"https://www.news.com.au/sport/cricket/usman-khawaja-excited-to-play-in-pakistan/video/19b1eec99cad3407d38f2dba8f8899b9","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Usman Khawaja is set to play in his country of birth for the first time.","content":null,"pubDate":"2022-02-28 11:36:20","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australian cricketer subject of death threat in Pakistan before Test series","link":"https://www.theage.com.au/sport/cricket/australian-cricketer-subject-of-death-threat-in-pakistan-before-test-series-20220228-p5a0h8.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Cricket Australia has investigated an explicit message received by Ashton Agar’s partner on social media since the team arrived in Pakistan.","content":null,"pubDate":"2022-02-28 11:30:49","full_description":"Cricket Australia and the Pakistan Cricket Board have investigated a death threat sent to the partner of Australian spinner Ashton Agar on social media, warning that the cricketer should not travel to Pakistan. The Sydney Morning Herald and The Age can reveal that a message was sent to Agar’s partner, Madeleine, on social media, which was immediately reported to CA and the PCB. Ashton Agar during a match for Australia in 2020. Credit: Getty Image A team spokesperson confirmed Agar was the subject of the death threat, but team security has investigated and do not believe it is a credible threat. There is a suggestion it is from a fake Instagram account, potentially from India. The Australian team had planned for such disruptions on their first tour to Pakistan since 1998. Agar was said to be in good spirits despite the direct message sent to his wife. The team will have their first training session on Tuesday before Friday’s first Test at Rawalpindi. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australian cricketer subject of death threat in Pakistan before Test series","link":"https://www.smh.com.au/sport/cricket/australian-cricketer-subject-of-death-threat-in-pakistan-before-test-series-20220228-p5a0h8.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Tom Decent"],"video_url":null,"description":"Cricket Australia has investigated an explicit message received by Ashton Agar’s partner on social media since the team arrived in Pakistan.","content":null,"pubDate":"2022-02-28 11:30:49","full_description":"Cricket Australia and the Pakistan Cricket Board have investigated a death threat sent to the partner of Australian spinner Ashton Agar on social media, warning that the cricketer should not travel to Pakistan. The Sydney Morning Herald and The Age can reveal that a message was sent to Agar’s partner, Madeleine, on social media, which was immediately reported to CA and the PCB. Ashton Agar during a match for Australia in 2020. Credit: Getty Image A team spokesperson confirmed Agar was the subject of the death threat, but team security has investigated and do not believe it is a credible threat. There is a suggestion it is from a fake Instagram account, potentially from India. The Australian team had planned for such disruptions on their first tour to Pakistan since 1998. Agar was said to be in good spirits despite the direct message sent to his wife. The team will have their first training session on Tuesday before Friday’s first Test at Rawalpindi. More to come News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"}]}