{"newsArray":[{"article_id":"2143f9cb201d1bd9eaf5db2f1ac48161","title":"OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops","link":"https://www.dailymail.co.uk/sport/football/article-12694925/OLIVER-HOLT-Money-matters-FIFA-money-doesnt-just-talk-Saudis-involved-shouts-rooftops.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: As soon as it had become clear the Saudis wanted to host the tournament, everyone knew it was a done deal. With Fifa, money is the only thing that matters.","content":"OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops FIFA has confirmed Saudi Arabia as the sole bidder for the 2034 World Cup Saudi Arabia is now set to dominate the sporting landscape for the next decade Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Oliver Holt for MailOnline Published: 18:30 EDT, 31 October 2023 | Updated: 18:57 EDT, 31 October 2023 e-mail 8 View comments There was still a residue of outrage in the reaction when the 2034 World Cup was handed to Saudi Arabia on Tuesday. There were still good people who raged against the machine. Most of all, though, there was sad, grim resignation. As soon as it had become clear the Saudis wanted to host the tournament, everyone knew it was a done deal. With FIFA, money is the only thing that matters. And money doesn’t just talk when the Saudis get involved with sport. It shouts from the rooftops. It buys everything and everyone. It was instructive last week to see the cast of all-time great fighters the Saudis corralled to attend the ‘Battle of the Baddest’ between Tyson Fury and Francis Ngannou in Riyadh. It felt like every boxer who had ever won a belt was there. It was another exercise in excess. If there is any sense of relief, it is that we will at least be spared the grotesque festival of venality that usually accompanies a World Cup bidding process. This time, FIFA haven’t even bothered with a vote. They put blinkers on and followed the money-trail. It was interesting to see that Eddie Howe , the Newcastle United manager who usually pleads ignorance on anything to do with the kingdom that pays his wages, felt sufficiently informed to offer an opinion on the glad tidings about the 2034 tournament. FIFA president Gianni Infantino, left, has overseen the awarding of the 2034 World Cup to Saudi Arabia All-time great boxers were brought to Saudi Arabia for Tyson Fury's bout with Francis Ngannou Newcastle boss Eddie Howe said Saudi Arabia would ensure everything is 'structurally good' Your browser does not support iframes. ‘You can rest assured that everything will be structurally really good,’ Howe said, which was cheering. Howe might be England manager by then, of course. He might even be the Saudi manager given the extent of his fealty to the cause. There will, of course, be issues surrounding the disruption of the European leagues by the logistical challenges posed by another winter World Cup. The Premier League and the rest will just have to suck that up. We never pay too much heed to the disruption summer World Cups cause to other continents. But what remains hard to stomach is FIFA’s continuing blindness to the fact that a World Cup in Saudi Arabia means a World Cup in a kingdom where same-sex relationships are criminalised, women are treated as second-class citizens and human rights abuses flourish unabated. Awarding the World Cup to Saudi Arabia is not a vote for change. It is an empowerment of the status quo. It is a reward for its abuses and its repression. We should not seek to impose our culture on the Saudis but nor should we be complicit in the staging of a tournament in a country where whole swathes of the football community will not just be unwelcome but fearful of persecution and punishment. Saudi Arabia can finance the Saudi Pro League and take players from European leagues and try to bolster attendances and even if, to western tastes, players choosing to ply their trade there in relative anonymity seems regrettable, it is a personal choice. Heading to Saudi Arabia for the World Cup, which is supposed to be a global celebration of the game, which is supposed to be open to all, which is supposed to be a showcase for bringing people together through football, is entirely different. ‘The possibility that FIFA could award Saudi Arabia the 2034 World Cup despite its appalling human rights record and closed door to any monitoring exposes FIFA’s commitments to human rights as a sham,’ said Minky Worden, director of global initiatives at Human Rights Watch. Jordan Henderson is among the European players to have been attracted to Saudi Arabia Saudi Arabia's human rights record under Crown Prince Mohammed Bin Salman, left, has been criticised despite the influx of sporting events heading to the nation The World Cup confirms Saudi Arabia will dominate the sporting landscape for a decade ‘Saudi Arabia’s appalling human rights record has deteriorated under Crown Prince Mohammed Bin Salman’s rule, including mass executions, continued repression of women’s rights under its male guardianship system, and the killing of hundreds of migrants at the Saudi-Yemen border.’ The awarding of the World Cup to Saudi Arabia also means that the kingdom will dominate the sporting landscape for the next 11 years. That was predictable, anyway, but this is confirmation. The axis of world sport is shifting towards the Middle East and this will accelerate it. It may be that the World Cup is Saudi’s endgame in its colonisation of sport. But I doubt it. It is more likely that other ambitious projects will precede it and follow it. What price there will be a Champions League final in Riyadh in 2033? What price that Manchester United play Chelsea in a Premier League match there in 2035? What price the 2035 Cricket World Cup in Saudi Arabia? What price the 2035 Ryder Cup in Jeddah? What price the 2036 Olympic Games in Riyadh? The World Cup will not be the end of Saudi Arabia’s sporting ambitions. It will just be the end of the beginning. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Saudi Arabia Saudi Arabia Football Eddie Howe Share or comment on this article: OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops e-mail Add comment Comments 8 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 22:49:15","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/20/77241107-0-image-a-27_1698784033043.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d3fcc3f7b14fc5af3f0ba17c4992fafe","title":"Cricket World Cup 2023: Surprises, upsets, unpredictable twists; underdogs shine and giants falter","link":"https://kashmirreader.com/2023/11/01/cricket-world-cup-2023-surprises-upsets-unpredictable-twists-underdogs-shine-and-giants-falter/","keywords":["SPORTS"],"creator":["Hilal Bukhari"],"video_url":null,"description":"The cricket World Cup is going on in India, entertaining masses and testing talents. The teams which were considered to be the softer sides till now like Afghanistan and Netherlands have shown their own class and potential while some of the cricket giants and champions have failed to impress. West Indies could not even qualify […]","content":"The cricket World Cup is going on in India, entertaining masses and testing talents. The teams which were considered to be the softer sides till now like Afghanistan and Netherlands have shown their own class and potential while some of the cricket giants and champions have failed to impress. West Indies could not even qualify for the tournament. For the first time in the whole history of the cricket World Cup, they are not part of the main tournament. Pakistan’s fans are disappointed for what they consider is the team’s worst performance in the whole World Cup history too. However, I think England’s performance is more shocking and downgraded than the other teams. English players consistently play IPL matches here. They are used to the local conditions here. They are the current ODI world champion. Still, they are currently at the bottom of the points table there. Their national cricket infrastructure is much better than Pakistan’s. As far as the Pakistani cricket team is considered I think they do not possess a perfect combination for this tournament. They have not played on the Indian soil for years together. But the so-called stalwarts and some of the cricket legends of that country who criticize the team’s performance and the captain have not achieved much during their own tenures either. Those who cry about the favouritism in the team seem unaware of the facts. I don’t think their selectors had any better options available whom they ignored to choose their favourite instead. But England is possessing the best of their players in the team. You have batters like Jos Buttler, Johnny Baritow, David Malan, Joe Root, bowlers like Woakes, Adil Rashid and Mark Wood and all-rounders like Moeen Ali and Stokes. What else makes the best team? They are the big names in the whole world of cricket still their performances are nowhere near the Netherlands players who are less popular and were less trusted for bringing such great results. The only perfect success story so far in the tournament is the team India which seems to be the most favorite side to lift the trophy this time. The home conditions and the best bowling and batting combination are about to give the Indian cricket lovers the good news they have been waiting for years now. The writer can be reached at [email protected] Cricket World Cup 2023: Surprises, upsets, unpredictable twists; underdogs shine and giants falter added by Hilal Bukhari on 3:19 am November 1, 2023 View all posts by Hilal Bukhari → Hilal Bukhari Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-10-31 21:49:42","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"e285624773554de9ad6f3e26262aa622","title":"Kal Ka Match Kon Jeeta: कल का मैच कौन जीता- पाकिस्तान vs बांग्लादेश","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kon-jeeta-pakistan-vs-bangladesh-31st-match-result-updates-here-840885.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kon Jeeta: बांग्लादेश के खिलाफ जीत हासिल करने के साथ ही पाकिस्तान ने सेमीफाइनल की उम्मीदों को भी जिंदा रखा है।","content":"बांग्लादेश को हराने के साथ ही पाकिस्तान ने वर्ल्ड कप में अपनी तीसरी जीत दर्ज कर ली है। इससे पहले पाकिस्तान की टीम को नीदरलैंड और श्रीलंका के खिलाफ जीत मिली थी। शुरुआती दो मुकाबले जीतने के बाद पाकिस्तान को लगातार चार मैचों में हार का सामना करना पड़ा था। भारत के खिलाफ 14 अक्टूबर को अहमदाबाद के नरेंद्र मोदी स्टेडियम में 7 विकेट से हार झेलने वाली पाकिस्तान की टीम एक बार फिर से जीत की पटरी पर लौट चुकी है। बांग्लादेश के कप्तान शाकिब अल हसन ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया। बांग्लादेश के बल्लेबाज पाकिस्तान के खिलाफ बड़ा स्कोर नहीं बना सके। यही वजह रही की पूरी टीम 204 रनों पर सिमट गई। जवाब में पाकिस्तान की टीम ने आसानी से 205 रन बनाकर मैच को अपने नाम कर लिया। पाकिस्तान के लिए फखर ज़मान ने सबसे ज्यादा 81 रनों की पारी खेली। इस पारी के लिए फखर जमान को प्लेयर ऑफ द मैच का अवार्ड भी दिया गया। फखर ज़मान के अलावा अब्दुल्ला शफीक ने भी 67 रन बनाए। मोहम्मद रिजवान 26 और इफ्तिखार अहमद अंत तक नाबाद रहे। गेंदबाजी की बात करें तो पाकिस्तान की टीम ने इस मुकाबले में शानदार गेंदबाजी की। शाहीन अफरीदी ने पावरप्ले में विकेट लेकर पाकिस्तान को बेहतरीन शुरुआत दिलाई। मोहम्मद वसीम जूनियर और शाहीन अफरीदी ने तीन-तीन विकेट चटकाए। वहीं हारिस रऊफ को दो सफलता मिली। अब्दुल्ला शफीक, फखर जमान, बाबर आजम (कप्तान), मोहम्मद रिजवान (विकेटकीपर), सऊद शकील, आगा सलमान, इफ्तिखार अहमद, उसामा मीर, शाहीन अफरीदी, मोहम्मद वसीम जूनियर, हारिस रऊफ। लिटन दास, तंजीद हसन, नजमुल हुसैन शान्तो, शाकिब अल हसन (कप्तान), मुश्फिकुर रहीम (विकेटकीपर), महमूदुल्लाह, तोहिद हृदोय, मेहदी हसन मिराज, तस्कीन अहमद, मुस्तफिजुर रहमान, शोरिफुल इस्लाम।","pubDate":"2023-10-31 18:30:02","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ea1b2db62bbe3b9932e1cb3f561459f0","title":"Babar Azam Hopes Win Against Bangladesh Will Raise Pakistan's Confidence","link":"https://sports.ndtv.com/cricket/cricket-world-cup-babar-azam-hopes-win-against-bangladesh-will-raise-pakistans-confidence-4533249","keywords":null,"creator":null,"video_url":null,"description":"Pakistan defeated Bangladesh in Kolkata to register their third win in the ongoing ICC World Cup 2023. Wi","content":"After Pakistan registered a 7-wicket victory against Bangladesh, captain Babar Azam lavished praise on his team's outstanding performance in all three departments and said that his side will hope to carry the confidence into the next two games. Pakistan defeated Bangladesh in Kolkata to register their third win in the ongoing ICC World Cup 2023. With this brilliant victory, Pakistan broke their four-match losing streak in the ongoing tournament and moved to 5th in the points table with 6 points. Meanwhile, the ODI World Cup semifinal dream remained unfulfilled for Bangladesh. \"Credit to the boys, the way they played in all three departments. This win hopefully gives confidence in the coming matches. Shaheen started well with the ball. After 15-20 overs, they built a partnership. But our main bowlers struck. The main thing was our bowlers hit good lengths and took wickets,\" Babar Azam said during a post-match presentation. Babar lavished praise on Fakhar Zaman and stated that if the opener bats for 20 to 30 overs, the game would be different. Fakhar made a strong comeback in the 2023 Cricket World Cup, scoring 81 against Bangladesh. This achievement was especially notable given his past troubles with form, which resulted in his expulsion from the team. \"We know how well Fakhar plays when he's going. Good to see him do it. We are trying to win our remaining matches and see where we stand,\" Babar said. Babar thanked the Indian fans for their support of him and Pakistan during the match. Former player Ramiz Raja reminded the Pakistan skipper of the support his team received at Eden Gardens, for which he expressed gratitude. \"I want to thank the fans for supporting me and Pakistan throughout the World Cup,\" he said. Talking about the match, openers Zaman and Shafique scored 81 and 68 respectively while Mohammad Rizwan slammed an unbeaten 26, guiding their team to a 7-wicket triumph. For Bangladesh, Mehidy Hasan Miraz bagged a three-wicket haul. Earlier, Pakistan pacers Mohammad Wasim Jr, Shaheen Afridi and Haris Rauf with sensational spells wreaked havoc on Bangladesh batters to restrict the Bangla Tigers to a low total of 204. Wasim Jr and Shaheen Afridi were the chief destructive duo as they bagged three-wicket hauls respectively while pacer Haris Rauf came together to help the Men in Green bowl Bangladesh out for a low total. Pakistan will next face New Zealand on Saturday at M.Chinnaswamy Stadium in Bengaluru. Advertisement","pubDate":"2023-10-31 18:20:56","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a0fd53af24930298e43f7cfb82e9f272","title":"\"Looking For Answers:\" Bangladesh Skipper Shakib After Loss To Pakistan","link":"https://sports.ndtv.com/cricket/looking-for-answers-bangladesh-skipper-shakib-al-hasan-after-loss-to-pakistan-4533231","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh skipper Shakib Al Hasan admitted that the team is looking for answers for their disappointing campaign but is struggling to find answers","content":"Following his side's loss to Pakistan in their ICC Cricket World Cup match, Bangladesh skipper Shakib Al Hasan admitted that the team is looking for answers for their disappointing campaign but is struggling to find answers and added that something needs to be thought about his batting position. Riding on Fakhar Zaman , Abdullah Shafique 's half-centuries and bowlers' brilliance Pakistan registered a 7-wicket victory over Bangladesh in the ongoing ICC World Cup 2023 at the Eden Gardens in Kolkata on Tuesday. With this brilliant victory, Pakistan broke their four-match losing streak in the ongoing tournament, moving up to 5th in the points table with 6 points. Meanwhile, the ODI World Cup semifinal dream remained unfulfilled for Bangladesh, who have registered their sixth loss. \"Not enough runs. The wicket was really good. We lost early wickets. We had partnerships but not big ones that would allow us to go big in the last ten. We should have bowled better too. Pakistan did well in the first ten overs, credit to them too. We have to think about my batting order. I was batting early, did not score runs. My confidence was low too. In this stage, changing too many things seems difficult. We are trying to force things but it isn't working. At this moment, we have to perform together, which is not happening. We are looking for answers but are not getting it. Everywhere we go, fans come to the ground and are always behind us. They are our biggest strength,\" said Shakib in a post-match presentation. Shakib has made just 104 runs in six innings during this tournament at an average of 17.33, with two 40-plus scores. Coming to the match, Bangladesh elected to bat first. Knocks from Mahmudullah (56 in 70 balls, with six fours and a six), Litton Das (45 in 64 balls, with six fours) and skipper Shakib al Hasan (43 in 64 balls, with four boundaries) came in handy as Bangladesh was bundled out for 204 in 45.1 overs. Shaheen Afridi (3/23), Mohammed Waseem Jr (3/31) and Haris Rauf (2/36) also delivered solid spells with the ball. Iftikhar Ahmed and Usama Mir also got one wicket. In the chase of 205, a returning Fakhar Zaman (81 in 74 balls, with three fours and seven sixes) and Abdullah Shafique (68 in 69 balls, nine fours and two sixes) smashed the fifties that helped Pakistan cruise to a much-needed seven-wicket win. Fakhar received the 'Player of the Match' award for his knock.","pubDate":"2023-10-31 18:14:51","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"42142762fd37fcd808e4367af63caa03","title":"We’re better than that – Dawid Malan deflects England heat from Matthew Mott","link":"https://www.bordercountiesadvertizer.co.uk/sport/national/23892886.better---dawid-malan-deflects-england-heat-matthew-mott/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defending champions England have unravelled in dramatic fashion over the past month.","content":"England arrived in India as reigning champions and among the favourites but have unravelled in dramatic fashion over the past month. After six games they sit bottom of the table in 10th place, with a solitary win against fellow strugglers Bangladesh, putting Mott’s white-ball role under scrutiny. Speculation over the Australian’s position increased when Eoin Morgan, the side’s World Cup-winning former captain, claimed the squad seemed “unsettled” and later suggested England “take a leaf out of Baz’s book” – a direct reference to Test coach Brendon McCullum. Malan, the top run-scorer and solitary centurion in an underperforming lineup, told BBC Sport: “Motty is not the one walking out on the field. “We are being given everything we need to perform. The facilities and work, everything is being done as it always has been, we just haven’t been able to find a way to get wins on the board. It has been frustrating from a players’ point of view because we know we’re better than that. “I’m not involved in selection or any of those things, so I don’t know how that works or who is in charge of all that, but as players we need to take responsibility when we cross that rope.” Malan broadened the focus away from Mott’s future, insisting that everyone involved in the campaign would be feeling the same heat. “I guess whenever you have a poor campaign there is always someone who’s going to be targeted whether it be the captain, players, coach or selectors,” he said. “People’s jobs being scrutinised and players’ careers being scrutinised. We have a hell of a lot to play for in the last three. The only way we can get the noise off the coach is by performing. And it is up to us next three games to win these games and take that narrative away because we have not performed. “I know people say that a lot when their backs are against the wall but genuinely, we still back each other and we’re still here for each other. We just haven’t been able to put those performances out on the pitch.” Malan recently accepted a new one-year central contract with the England and Wales Cricket Board and, at 36, was neither surprised nor aggrieved to miss out on one of the new multi-year offers. He still hopes to play a part in next summer’s T20 World Cup but does not shy away from the fact that he is entering a different phase of his career. Malan confirmed that his latest deal with Yorkshire was as a white-ball only deal, effectively ending a first-class career that brought more than 13,000 runs, 22 Test caps and the high point of an Ashes century in Perth. “I’m not going to be playing four-day cricket, but I still have a contract with Yorkshire to play the Blast and I’ll still be playing the Hundred if I can get a contract in that,” he explained. “I’ll probably try and play as much white-ball cricket as I can for the rest of my career. It’s prioritising spending a bit more time at home because my winters are so busy with internationals or franchise tournaments.” Malan does not know how long his England days will last, but the appetite for fresh blood and renewal of an ageing side may hasten the end for several members of the current squad. With that in mind, he knows the 2025 Champions Trophy may be a step too far for him but remains eager to clinch a top-eight finish in India and guarantee the next generation do not miss out of qualifying for the tournament. “Two years feels a long way. I’m pretty sure I’ll be done but I’d love the guys to play in that,” he said. “If the decision gets made to move on from players, the last thing you want is that we haven’t done well enough to give other players the opportunity in future to play in big tournaments. It’s definitely not going to be a situation where we just go through the motions because we’re potentially out of this World Cup. We have a lot at stake and a lot of pride for England to be in that Champions Trophy in two years’ time.”","pubDate":"2023-10-31 18:11:57","image_url":"https://www.bordercountiesadvertizer.co.uk/resources/images/17391871/?type=app&htype=0","source_id":"bordercountiesadvertiser","source_priority":98087,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4c127eae02be5fbb1be94ba20d1ff15a","title":"We’re better than that – Dawid Malan deflects England heat from Matthew Mott","link":"https://www.basingstokegazette.co.uk/sport/national/23892886.better---dawid-malan-deflects-england-heat-matthew-mott/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defending champions England have unravelled in dramatic fashion over the past month.","content":"England arrived in India as reigning champions and among the favourites but have unravelled in dramatic fashion over the past month. After six games they sit bottom of the table in 10th place, with a solitary win against fellow strugglers Bangladesh, putting Mott’s white-ball role under scrutiny. Speculation over the Australian’s position increased when Eoin Morgan, the side’s World Cup-winning former captain, claimed the squad seemed “unsettled” and later suggested England “take a leaf out of Baz’s book” – a direct reference to Test coach Brendon McCullum. Malan, the top run-scorer and solitary centurion in an underperforming lineup, told BBC Sport: “Motty is not the one walking out on the field. “We are being given everything we need to perform. The facilities and work, everything is being done as it always has been, we just haven’t been able to find a way to get wins on the board. It has been frustrating from a players’ point of view because we know we’re better than that. “I’m not involved in selection or any of those things, so I don’t know how that works or who is in charge of all that, but as players we need to take responsibility when we cross that rope.” Malan broadened the focus away from Mott’s future, insisting that everyone involved in the campaign would be feeling the same heat. “I guess whenever you have a poor campaign there is always someone who’s going to be targeted whether it be the captain, players, coach or selectors,” he said. “People’s jobs being scrutinised and players’ careers being scrutinised. We have a hell of a lot to play for in the last three. The only way we can get the noise off the coach is by performing. And it is up to us next three games to win these games and take that narrative away because we have not performed. “I know people say that a lot when their backs are against the wall but genuinely, we still back each other and we’re still here for each other. We just haven’t been able to put those performances out on the pitch.” Malan recently accepted a new one-year central contract with the England and Wales Cricket Board and, at 36, was neither surprised nor aggrieved to miss out on one of the new multi-year offers. He still hopes to play a part in next summer’s T20 World Cup but does not shy away from the fact that he is entering a different phase of his career. Malan confirmed that his latest deal with Yorkshire was as a white-ball only deal, effectively ending a first-class career that brought more than 13,000 runs, 22 Test caps and the high point of an Ashes century in Perth. “I’m not going to be playing four-day cricket, but I still have a contract with Yorkshire to play the Blast and I’ll still be playing the Hundred if I can get a contract in that,” he explained. “I’ll probably try and play as much white-ball cricket as I can for the rest of my career. It’s prioritising spending a bit more time at home because my winters are so busy with internationals or franchise tournaments.” Malan does not know how long his England days will last, but the appetite for fresh blood and renewal of an ageing side may hasten the end for several members of the current squad. With that in mind, he knows the 2025 Champions Trophy may be a step too far for him but remains eager to clinch a top-eight finish in India and guarantee the next generation do not miss out of qualifying for the tournament. “Two years feels a long way. I’m pretty sure I’ll be done but I’d love the guys to play in that,” he said. “If the decision gets made to move on from players, the last thing you want is that we haven’t done well enough to give other players the opportunity in future to play in big tournaments. It’s definitely not going to be a situation where we just go through the motions because we’re potentially out of this World Cup. We have a lot at stake and a lot of pride for England to be in that Champions Trophy in two years’ time.”","pubDate":"2023-10-31 18:11:57","image_url":"https://www.basingstokegazette.co.uk/resources/images/17391871/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"27d1bbf6f29e0485b8666eb2d17bf5b8","title":"WC 2023: Shreyas Works On 'Weakness'; Rohit, Virat Skip Optional Practice","link":"https://sports.ndtv.com/cricket/cricket-world-cup-2023-shreyas-iyer-works-on-weakness-rohit-sharma-virat-kohli-skip-optional-practice-4531573","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer trained with the aim of overcoming his longstanding struggles ahead of the Cricket World Cup 2023 game against Sri Lanka.","content":"With his vulnerability against the short ball coming to the fore once again, India number four Shreyas Iyer trained with the aim of overcoming his longstanding struggles ahead of the Cricket World Cup 2023 game against Sri Lanka in Mumbai on Thursday. None of the top-order guns — captain Rohit Sharma, Virat Kohli and Shubman Gill — were in attendance for the optional session. Iyer versus the short ball was the focal point. The team's famed bowling attack, which delivered a fabulous 100-run victory over England last Sunday, also opted for rest. Perched at the top of the World Cup points table and with a spot in the semifinals virtually sealed for Rohit and Co, it is only imperative that the team keeps ironing out the areas of concern along the way. Iyer's troubles against the short ball, combined with the lack of big scores as the preferred No 4, is certainly something that the team management and the player want to overcome and it was evident as far as his approach to the session on Tuesday was concerned. The right-handed batter, who is back to his homeground that he shares with skipper Rohit, Suryakumar Yadav and Shardul Thakur in this Indian squad for the World Cup, faced plenty of short balls from throwdown specialists in the session that lasted for nearly two hours under the sun. While he did face some local net bowlers to begin with, the focus point of the session soon turned into having Iyer facing innumerable short balls hurled at him by India's throwdown specialists D Raghavendra, the left-handed Sri Lankan Nuwan Seneviratne and batting coach Vikram Rathour along with a few others. Having long batting stints on either side of the strip on which India will take on Sri Lanka, Iyer was also seen sporting a chest guard while he kept on pulling and hooking the short balls. To his credit, Iyer responded deftly with powerful strikes, sending the ball into the stands or clearing the ropes mostly. Towards the end, Iyer also had India head coach Rahul Dravid feeding him throwdowns and for a change, the batting great also fed a few deliveries to Iyer to drive while the bowling coach Paras Mhambrey watched from a distance. Also among the throwdown bowlers for Iyer was the team's fielding coach T Dilip, whose famous award ceremonies for the best fielder after every match have become a unique feature that fans have been glued to. Advertisement Iyer fell to the short ball in Dharamsala as well as the last game against England in Lucknow. Apart from Iyer's strenuous effort, all-rounder Shardul Thakur also had a long batting session while the others in Ishan Kishan, KL Rahul and Suryakumar had a regulation hit in the nets. All-rounders Ravichandran Ashwin and Ravindra Jadeja did more batting practice than bowling.","pubDate":"2023-10-31 18:09:17","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a37fe0fd9abb5669bf9b826df758f5e8","title":"IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce","link":"https://www.dailymail.co.uk/sport/cricket/article-12694147/State-school-cricket-dying-Englands-World-Cup-farce.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"IAN HERBERT: Precisely how England has managed to crash so spectacularly in defence of the World Cup is bewildering, but there are clues.","content":"IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce There are clues as to why England failed so badly to defend their World Cup title Hard-ball cricket is not played at state schools, leaving it out of reach to millions By Ian Herbert for MailOnline Published: 14:00 EDT, 31 October 2023 | Updated: 17:13 EDT, 31 October 2023 e-mail 21 shares 1 View comments Precisely how England, a cricket nation bankrolled by a governing body which turned over £334million in their last financial year, have managed to crash so spectacularly in defence of the World Cup is bewildering, but there are clues. Complacency and lack of interest in a form of cricket they have barely played: 42 ODIs in the past four years, compared with 88 between 2015 and 2019. The rank incompetence of announcing new central contracts mid-tournament, meaning that Ben Stokes declares he would rather maximise his earnings elsewhere than take a three-year offer, in the midst of the World Cup, while David Willey learns he is not good enough to receive any offer as he prepares to bowl against South Africa . Imagine the backlash if the FA timed an announcement like that. Hubris — everywhere. And then there is the problem which really requires vision, intelligence and the longer view. The fact that hard-ball cricket is beyond the reach of millions of our children because it is not played at state schools and is prohibitively expensive to those who may access it through clubs. Only one of England’s top six and three of the entire team smashed by South Africa in Mumbai were state-educated — that one being Stokes, who didn’t move to the UK until he was 12. State-school cricket is dying so we better get used to England's World Cup woe Hard-ball cricket is not played at state schools, leaving it out of reach to millions of kids. Ben Stokes is pictured in 2016 playing with primary school children in Newcastle Of the 12 different English players to have scored centuries in ODIs in the past four years, a mere two went to non-fee-paying schools - Stokes and Moeen Ali. In the Test format, too, England select from a painfully smaller pool than other nations. Five of the 18 openers tried since Andrew Strauss' retirement in 2012 have come from state schools, playing a combined 33 Tests out of 191. Some with an indifference to such numbers will point to how the World Cup was won four years ago with the dice loaded in favour of private school pupils. Then imagine how powerfully England, currently operating at a far lower base level than others, would compete with the elitism taken out. Those with an intelligent and active interest in the health of cricket have identified the sport's inclusion problem in the past year. One of the widely overlooked aspects of the Independent Commission for Equity in Cricket (ICEC) report - a broad and brilliant piece of work - was the stress it placed on the need to remove the barriers to working class children, priced out by the costs. The ECB's response to the report was big on gloss and words, yet maddeningly vague on detail. The report suggested county coaches working with 10-13-year-olds be given a remit to work in state schools. It raised the prospect of free kit and coaching to all children identified as possible future talents through local clubs, removing the obvious impediments to a young player from a poorer background - the £65 cost of a helmet, the £80 bat, the £40 pads. But none of this will be happening any time soon. 'To tackle barriers for state school pupils, we will develop an action plan designed to increase the number of state primary and secondary school students playing cricket,' the ECB declared in its response. And your heart sank. England are all but out of the World Cup in what has been a disastrous defence of their title 🚨 England are all but OUT of the Cricket World Cup after a 100 run defeat to India 🚨 pic.twitter.com/Z38BJPKyZD — Sky Sports Cricket (@SkyCricket) October 29, 2023 Meanwhile, out in the real world, the number of state schools where cricket is played is disappearing off the edge of a cliff. One current England international has discovered that the sport is no longer played at his old state secondary school. The promising relative of another former international has recently drifted away from the pathway talent programme. There have been successful ECB programmes like All Stars and Chance to Shine but this softball cricket is the relatively easy bit. Helping children making the step into hard ball cricket is monumental tough, particularly in the inner cities, where clubs need more coaches, more players willing to become coaches, more parents ready to get involved - and help to clear those barriers to inclusion. The sport's heroes are people like Shahidul Alam Ratan, whose organisation Capital Kids Cricket is trying to attract inner-city London children to the game. We met last year, when I was investigating why there's a lack of racial diversity in the cricket set-up at Middlesex, though his crusade transcends race. Ratan is a force of nature, constantly engaged in the fight to get a cork ball and a bat into the hands of kids. Any kids. Black, white, immigrant, British-born. The ultimate outcome just might be a renewal of that conveyor belt of players which produced Wilf Slack, Gladstone Small, Norman Cowans and others. Our Mail Sport colleague Nasser Hussain helped Capital Kids Cricket launch a 'Clubs in Need' campaign a few months ago. What wouldn't Ratan give for the financial help with coaching and equipment that the ICEC report suggested? He is too polite to point out that the ECB found £1.1million to pay its disastrous chief executive Tom Harrison in the year to January 2023, despite him leaving the organisation the previous June. So is Rick Walton, a writer and tireless champion of the sport in Pembrokeshire, where he is a talent pathway coach for promising young players. Joe Root is one of the few England internationals who were state-educated 'There's virtually no hard-ball cricket in our secondary schools now, because schools don't have the pitches or the groundsmen for their upkeep. Hardly any even have Astroturf strips. They're just reduced to softball games,' Walton tells me. Ratan recently introduced me to Bharath Rajamani of the Canons CC junior girls club, in North West London, which wants to offer its children affordable winter indoor venues to develop their skills. Most school halls are block-booked out to firms running holiday and after-school clubs. The only place Bharath could find this winter was a community hall at a local temple. Out in India, the claims and counterclaims have started. England are 'definitely unsettled,' says Eoin Morgan. Not so says Chris Woakes, who's just been carted around the subcontinent for around ten runs an over. 'We're all working together. There are no cliques.' None of which is material to England's blind spot. The base level of the national team's cricket just isn't that good and when the team are ignominiously eliminated from this tournament in the next few days, you would hope that the question of how to broaden the talent pool beyond the self-selecting middle classes just might surface. Don't hold your breath. They don't get much right... but United have got Sir Bobby tributes spot on If only Manchester United could organise a football team in the way they organised the remembrance of Sir Bobby Charlton. The past week's commemorations have befitted the man, from the two beautiful images of him draped on the front of Old Trafford to the scarf placed on his seat on Sunday. A permanent empty seat would be a fitting symbol of that remembrance. It was very good to see Manchester City uphold Sunday's tribute, too. A minute's applause extremely well observed. Manchester United have got their tributes to club legend Sir Bobby Charlton spot on A wreath placed there by Manchester United chief executive Richard Arnold rests in Sir Bobby Charlton’s seat in the directors’ box at Old Trafford ahead of tonight’s game against FC Copenhagen pic.twitter.com/SvFvzncZaY — Oliver Holt (@OllieHolt22) October 24, 2023 All Blacks live up to their name It was as much of a thrill as ever to see the All-Blacks' boots in Saturday night's World Cup final. We live in a world of individualists, sporting boots of every colour and design which say to the world, 'See! Look at me.' No pinks or green fluorescence from these participants who, to a man, wore black boots, immaculately polished. A beautiful symbol of collectivism. The All Blacks lived up to their name at the World Cup with each player sporting black boots Jilly is spot on over diving It's been a pleasure to get to know the writer Jilly Cooper these past few years, while she has been researching the football world for her great new novel, Tackle! Her unquenchable interest in the sport seems unaffected by the travails of her team, Forest Green Rovers, and it strikes me that also she very much has the measure of the sport. She relates her enthusiasm for the Lionesses in one recent interview. 'They're brilliant because they don't fall over and pretend they're dead, do they?' Jilly says. 'If men even get touched on the shoulders, they fall over. They ought to be acting Shakespeare at Stratford.' South Africa Ben Stokes England Cricket Share or comment on this article: IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce e-mail 21 shares Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 18:02:13","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/17/77234679-0-image-a-4_1698773528212.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"13897208f2732c7a144d6a1560b83642","title":"Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!'","link":"https://www.dailymail.co.uk/sport/cricket/article-12694279/Dawid-Malan-vows-England-wont-motions-three-matches-World-Cup-batsman-admits-careers-line-here.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Dawid Malan believes England will spend the last three games of their disastrous World Cup playing not just for their own careers but for the future of head coach Matthew Mott.","content":"Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!' England batsman Dawid Malan has stood out during a miserable month He wants to use match against Australia to restore pride in the team England could be eliminated from the World Cup before Saturday's fixture By Lawrence Booth for the Daily Mail Published: 18:00 GMT, 31 October 2023 | Updated: 20:51 GMT, 31 October 2023 e-mail 10 View comments Dawid Malan believes England will spend the last three games of their disastrous World Cup playing not just for their own careers but for the future of head coach Matthew Mott. During an otherwise miserable month, Malan has stood out, scoring more runs (236), and hitting more fours and sixes (31 and six), than any of his team-mates. But he said he was aware of the pressure being heaped on Mott, and wants to use Saturday’s match against Australia to restore pride to a team who have performed nothing like world champions. ‘Whenever you have a poor campaign, there is always someone who’s going to be targeted - whether it be the captain, players, coach or selectors,’ said Malan. ‘The only way we can get the noise off the coach is by performing. And it is up to us to win these next three games and take that narrative away, because we have not performed.’ Dawid Malan vows England won’t go through motions in last three matches at the World Cup Pressure is mounting on England head coach Matthew Mott after a disastrous World Cup England may yet go into the match against Australia with their fate already sealed. If New Zealand beat South Africa on Wednesday, and Afghanistan beat the Netherlands on Friday, their mathematical elimination will be confirmed. But a top-eight finish in the 10-team league will ensure qualification for the 2025 Champions Trophy in Pakistan, and there is also the carrot of next year’s T20 World Cup defence in the Caribbean and the USA. ‘People’s jobs and players’ careers are being scrutinised,’ said Malan. ‘We have a hell of a lot to play for. It’s definitely not going to be a situation where we just go through the motions.’ Like every other member of the dressing-room these past few weeks, Malan was at a loss to explain England’s ineptitude, though he played down former captain Michael Vaughan’s suggestion that discord had been sown by the mid-tournament announcement of a new set of tiered central contracts. ‘I don’t think that is an excuse,’ said Malan, one of only eight players out of 29 to receive the minimum one-year deal. ‘We have all been around long enough to still be able to perform whether we get contracts or not. We have just not been good enough.’ Malan also admitted that criticism from Eoin Morgan, Jos Buttler’s predecessor, was ‘fair’, but claimed he had no idea what Morgan meant when he said he thought ‘there was something else going on’ beyond a collective loss of form. ‘His job is to have an opinion and he’s totally entitled to that,’ he said. ‘The criticism is fair in the fact that we’ve not been good enough, and we deserve the criticism we’re getting because of it. ‘But I can only comment on us as a group. The boys are still supportive of each other. Hopefully that can turn and we start putting in some performances.’ Australia Cricket England Cricket Share or comment on this article: Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!' e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 18:00:52","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/17/77234517-0-image-a-7_1698772927815.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2143f9cb201d1bd9eaf5db2f1ac48161","title":"OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops","link":"https://www.dailymail.co.uk/sport/football/article-12694925/OLIVER-HOLT-Money-matters-FIFA-money-doesnt-just-talk-Saudis-involved-shouts-rooftops.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: As soon as it had become clear the Saudis wanted to host the tournament, everyone knew it was a done deal. With Fifa, money is the only thing that matters.","content":"OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops FIFA has confirmed Saudi Arabia as the sole bidder for the 2034 World Cup Saudi Arabia is now set to dominate the sporting landscape for the next decade Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Oliver Holt for MailOnline Published: 18:30 EDT, 31 October 2023 | Updated: 18:57 EDT, 31 October 2023 e-mail 8 View comments There was still a residue of outrage in the reaction when the 2034 World Cup was handed to Saudi Arabia on Tuesday. There were still good people who raged against the machine. Most of all, though, there was sad, grim resignation. As soon as it had become clear the Saudis wanted to host the tournament, everyone knew it was a done deal. With FIFA, money is the only thing that matters. And money doesn’t just talk when the Saudis get involved with sport. It shouts from the rooftops. It buys everything and everyone. It was instructive last week to see the cast of all-time great fighters the Saudis corralled to attend the ‘Battle of the Baddest’ between Tyson Fury and Francis Ngannou in Riyadh. It felt like every boxer who had ever won a belt was there. It was another exercise in excess. If there is any sense of relief, it is that we will at least be spared the grotesque festival of venality that usually accompanies a World Cup bidding process. This time, FIFA haven’t even bothered with a vote. They put blinkers on and followed the money-trail. It was interesting to see that Eddie Howe , the Newcastle United manager who usually pleads ignorance on anything to do with the kingdom that pays his wages, felt sufficiently informed to offer an opinion on the glad tidings about the 2034 tournament. FIFA president Gianni Infantino, left, has overseen the awarding of the 2034 World Cup to Saudi Arabia All-time great boxers were brought to Saudi Arabia for Tyson Fury's bout with Francis Ngannou Newcastle boss Eddie Howe said Saudi Arabia would ensure everything is 'structurally good' Your browser does not support iframes. ‘You can rest assured that everything will be structurally really good,’ Howe said, which was cheering. Howe might be England manager by then, of course. He might even be the Saudi manager given the extent of his fealty to the cause. There will, of course, be issues surrounding the disruption of the European leagues by the logistical challenges posed by another winter World Cup. The Premier League and the rest will just have to suck that up. We never pay too much heed to the disruption summer World Cups cause to other continents. But what remains hard to stomach is FIFA’s continuing blindness to the fact that a World Cup in Saudi Arabia means a World Cup in a kingdom where same-sex relationships are criminalised, women are treated as second-class citizens and human rights abuses flourish unabated. Awarding the World Cup to Saudi Arabia is not a vote for change. It is an empowerment of the status quo. It is a reward for its abuses and its repression. We should not seek to impose our culture on the Saudis but nor should we be complicit in the staging of a tournament in a country where whole swathes of the football community will not just be unwelcome but fearful of persecution and punishment. Saudi Arabia can finance the Saudi Pro League and take players from European leagues and try to bolster attendances and even if, to western tastes, players choosing to ply their trade there in relative anonymity seems regrettable, it is a personal choice. Heading to Saudi Arabia for the World Cup, which is supposed to be a global celebration of the game, which is supposed to be open to all, which is supposed to be a showcase for bringing people together through football, is entirely different. ‘The possibility that FIFA could award Saudi Arabia the 2034 World Cup despite its appalling human rights record and closed door to any monitoring exposes FIFA’s commitments to human rights as a sham,’ said Minky Worden, director of global initiatives at Human Rights Watch. Jordan Henderson is among the European players to have been attracted to Saudi Arabia Saudi Arabia's human rights record under Crown Prince Mohammed Bin Salman, left, has been criticised despite the influx of sporting events heading to the nation The World Cup confirms Saudi Arabia will dominate the sporting landscape for a decade ‘Saudi Arabia’s appalling human rights record has deteriorated under Crown Prince Mohammed Bin Salman’s rule, including mass executions, continued repression of women’s rights under its male guardianship system, and the killing of hundreds of migrants at the Saudi-Yemen border.’ The awarding of the World Cup to Saudi Arabia also means that the kingdom will dominate the sporting landscape for the next 11 years. That was predictable, anyway, but this is confirmation. The axis of world sport is shifting towards the Middle East and this will accelerate it. It may be that the World Cup is Saudi’s endgame in its colonisation of sport. But I doubt it. It is more likely that other ambitious projects will precede it and follow it. What price there will be a Champions League final in Riyadh in 2033? What price that Manchester United play Chelsea in a Premier League match there in 2035? What price the 2035 Cricket World Cup in Saudi Arabia? What price the 2035 Ryder Cup in Jeddah? What price the 2036 Olympic Games in Riyadh? The World Cup will not be the end of Saudi Arabia’s sporting ambitions. It will just be the end of the beginning. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Saudi Arabia Saudi Arabia Football Eddie Howe Share or comment on this article: OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops e-mail Add comment Comments 8 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 22:49:15","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/20/77241107-0-image-a-27_1698784033043.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d3fcc3f7b14fc5af3f0ba17c4992fafe","title":"Cricket World Cup 2023: Surprises, upsets, unpredictable twists; underdogs shine and giants falter","link":"https://kashmirreader.com/2023/11/01/cricket-world-cup-2023-surprises-upsets-unpredictable-twists-underdogs-shine-and-giants-falter/","keywords":["SPORTS"],"creator":["Hilal Bukhari"],"video_url":null,"description":"The cricket World Cup is going on in India, entertaining masses and testing talents. The teams which were considered to be the softer sides till now like Afghanistan and Netherlands have shown their own class and potential while some of the cricket giants and champions have failed to impress. West Indies could not even qualify […]","content":"The cricket World Cup is going on in India, entertaining masses and testing talents. The teams which were considered to be the softer sides till now like Afghanistan and Netherlands have shown their own class and potential while some of the cricket giants and champions have failed to impress. West Indies could not even qualify for the tournament. For the first time in the whole history of the cricket World Cup, they are not part of the main tournament. Pakistan’s fans are disappointed for what they consider is the team’s worst performance in the whole World Cup history too. However, I think England’s performance is more shocking and downgraded than the other teams. English players consistently play IPL matches here. They are used to the local conditions here. They are the current ODI world champion. Still, they are currently at the bottom of the points table there. Their national cricket infrastructure is much better than Pakistan’s. As far as the Pakistani cricket team is considered I think they do not possess a perfect combination for this tournament. They have not played on the Indian soil for years together. But the so-called stalwarts and some of the cricket legends of that country who criticize the team’s performance and the captain have not achieved much during their own tenures either. Those who cry about the favouritism in the team seem unaware of the facts. I don’t think their selectors had any better options available whom they ignored to choose their favourite instead. But England is possessing the best of their players in the team. You have batters like Jos Buttler, Johnny Baritow, David Malan, Joe Root, bowlers like Woakes, Adil Rashid and Mark Wood and all-rounders like Moeen Ali and Stokes. What else makes the best team? They are the big names in the whole world of cricket still their performances are nowhere near the Netherlands players who are less popular and were less trusted for bringing such great results. The only perfect success story so far in the tournament is the team India which seems to be the most favorite side to lift the trophy this time. The home conditions and the best bowling and batting combination are about to give the Indian cricket lovers the good news they have been waiting for years now. The writer can be reached at [email protected] Cricket World Cup 2023: Surprises, upsets, unpredictable twists; underdogs shine and giants falter added by Hilal Bukhari on 3:19 am November 1, 2023 View all posts by Hilal Bukhari → Hilal Bukhari Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-10-31 21:49:42","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"e285624773554de9ad6f3e26262aa622","title":"Kal Ka Match Kon Jeeta: कल का मैच कौन जीता- पाकिस्तान vs बांग्लादेश","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kon-jeeta-pakistan-vs-bangladesh-31st-match-result-updates-here-840885.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kon Jeeta: बांग्लादेश के खिलाफ जीत हासिल करने के साथ ही पाकिस्तान ने सेमीफाइनल की उम्मीदों को भी जिंदा रखा है।","content":"बांग्लादेश को हराने के साथ ही पाकिस्तान ने वर्ल्ड कप में अपनी तीसरी जीत दर्ज कर ली है। इससे पहले पाकिस्तान की टीम को नीदरलैंड और श्रीलंका के खिलाफ जीत मिली थी। शुरुआती दो मुकाबले जीतने के बाद पाकिस्तान को लगातार चार मैचों में हार का सामना करना पड़ा था। भारत के खिलाफ 14 अक्टूबर को अहमदाबाद के नरेंद्र मोदी स्टेडियम में 7 विकेट से हार झेलने वाली पाकिस्तान की टीम एक बार फिर से जीत की पटरी पर लौट चुकी है। बांग्लादेश के कप्तान शाकिब अल हसन ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया। बांग्लादेश के बल्लेबाज पाकिस्तान के खिलाफ बड़ा स्कोर नहीं बना सके। यही वजह रही की पूरी टीम 204 रनों पर सिमट गई। जवाब में पाकिस्तान की टीम ने आसानी से 205 रन बनाकर मैच को अपने नाम कर लिया। पाकिस्तान के लिए फखर ज़मान ने सबसे ज्यादा 81 रनों की पारी खेली। इस पारी के लिए फखर जमान को प्लेयर ऑफ द मैच का अवार्ड भी दिया गया। फखर ज़मान के अलावा अब्दुल्ला शफीक ने भी 67 रन बनाए। मोहम्मद रिजवान 26 और इफ्तिखार अहमद अंत तक नाबाद रहे। गेंदबाजी की बात करें तो पाकिस्तान की टीम ने इस मुकाबले में शानदार गेंदबाजी की। शाहीन अफरीदी ने पावरप्ले में विकेट लेकर पाकिस्तान को बेहतरीन शुरुआत दिलाई। मोहम्मद वसीम जूनियर और शाहीन अफरीदी ने तीन-तीन विकेट चटकाए। वहीं हारिस रऊफ को दो सफलता मिली। अब्दुल्ला शफीक, फखर जमान, बाबर आजम (कप्तान), मोहम्मद रिजवान (विकेटकीपर), सऊद शकील, आगा सलमान, इफ्तिखार अहमद, उसामा मीर, शाहीन अफरीदी, मोहम्मद वसीम जूनियर, हारिस रऊफ। लिटन दास, तंजीद हसन, नजमुल हुसैन शान्तो, शाकिब अल हसन (कप्तान), मुश्फिकुर रहीम (विकेटकीपर), महमूदुल्लाह, तोहिद हृदोय, मेहदी हसन मिराज, तस्कीन अहमद, मुस्तफिजुर रहमान, शोरिफुल इस्लाम।","pubDate":"2023-10-31 18:30:02","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ea1b2db62bbe3b9932e1cb3f561459f0","title":"Babar Azam Hopes Win Against Bangladesh Will Raise Pakistan's Confidence","link":"https://sports.ndtv.com/cricket/cricket-world-cup-babar-azam-hopes-win-against-bangladesh-will-raise-pakistans-confidence-4533249","keywords":null,"creator":null,"video_url":null,"description":"Pakistan defeated Bangladesh in Kolkata to register their third win in the ongoing ICC World Cup 2023. Wi","content":"After Pakistan registered a 7-wicket victory against Bangladesh, captain Babar Azam lavished praise on his team's outstanding performance in all three departments and said that his side will hope to carry the confidence into the next two games. Pakistan defeated Bangladesh in Kolkata to register their third win in the ongoing ICC World Cup 2023. With this brilliant victory, Pakistan broke their four-match losing streak in the ongoing tournament and moved to 5th in the points table with 6 points. Meanwhile, the ODI World Cup semifinal dream remained unfulfilled for Bangladesh. \"Credit to the boys, the way they played in all three departments. This win hopefully gives confidence in the coming matches. Shaheen started well with the ball. After 15-20 overs, they built a partnership. But our main bowlers struck. The main thing was our bowlers hit good lengths and took wickets,\" Babar Azam said during a post-match presentation. Babar lavished praise on Fakhar Zaman and stated that if the opener bats for 20 to 30 overs, the game would be different. Fakhar made a strong comeback in the 2023 Cricket World Cup, scoring 81 against Bangladesh. This achievement was especially notable given his past troubles with form, which resulted in his expulsion from the team. \"We know how well Fakhar plays when he's going. Good to see him do it. We are trying to win our remaining matches and see where we stand,\" Babar said. Babar thanked the Indian fans for their support of him and Pakistan during the match. Former player Ramiz Raja reminded the Pakistan skipper of the support his team received at Eden Gardens, for which he expressed gratitude. \"I want to thank the fans for supporting me and Pakistan throughout the World Cup,\" he said. Talking about the match, openers Zaman and Shafique scored 81 and 68 respectively while Mohammad Rizwan slammed an unbeaten 26, guiding their team to a 7-wicket triumph. For Bangladesh, Mehidy Hasan Miraz bagged a three-wicket haul. Earlier, Pakistan pacers Mohammad Wasim Jr, Shaheen Afridi and Haris Rauf with sensational spells wreaked havoc on Bangladesh batters to restrict the Bangla Tigers to a low total of 204. Wasim Jr and Shaheen Afridi were the chief destructive duo as they bagged three-wicket hauls respectively while pacer Haris Rauf came together to help the Men in Green bowl Bangladesh out for a low total. Pakistan will next face New Zealand on Saturday at M.Chinnaswamy Stadium in Bengaluru. Advertisement","pubDate":"2023-10-31 18:20:56","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a0fd53af24930298e43f7cfb82e9f272","title":"\"Looking For Answers:\" Bangladesh Skipper Shakib After Loss To Pakistan","link":"https://sports.ndtv.com/cricket/looking-for-answers-bangladesh-skipper-shakib-al-hasan-after-loss-to-pakistan-4533231","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh skipper Shakib Al Hasan admitted that the team is looking for answers for their disappointing campaign but is struggling to find answers","content":"Following his side's loss to Pakistan in their ICC Cricket World Cup match, Bangladesh skipper Shakib Al Hasan admitted that the team is looking for answers for their disappointing campaign but is struggling to find answers and added that something needs to be thought about his batting position. Riding on Fakhar Zaman , Abdullah Shafique 's half-centuries and bowlers' brilliance Pakistan registered a 7-wicket victory over Bangladesh in the ongoing ICC World Cup 2023 at the Eden Gardens in Kolkata on Tuesday. With this brilliant victory, Pakistan broke their four-match losing streak in the ongoing tournament, moving up to 5th in the points table with 6 points. Meanwhile, the ODI World Cup semifinal dream remained unfulfilled for Bangladesh, who have registered their sixth loss. \"Not enough runs. The wicket was really good. We lost early wickets. We had partnerships but not big ones that would allow us to go big in the last ten. We should have bowled better too. Pakistan did well in the first ten overs, credit to them too. We have to think about my batting order. I was batting early, did not score runs. My confidence was low too. In this stage, changing too many things seems difficult. We are trying to force things but it isn't working. At this moment, we have to perform together, which is not happening. We are looking for answers but are not getting it. Everywhere we go, fans come to the ground and are always behind us. They are our biggest strength,\" said Shakib in a post-match presentation. Shakib has made just 104 runs in six innings during this tournament at an average of 17.33, with two 40-plus scores. Coming to the match, Bangladesh elected to bat first. Knocks from Mahmudullah (56 in 70 balls, with six fours and a six), Litton Das (45 in 64 balls, with six fours) and skipper Shakib al Hasan (43 in 64 balls, with four boundaries) came in handy as Bangladesh was bundled out for 204 in 45.1 overs. Shaheen Afridi (3/23), Mohammed Waseem Jr (3/31) and Haris Rauf (2/36) also delivered solid spells with the ball. Iftikhar Ahmed and Usama Mir also got one wicket. In the chase of 205, a returning Fakhar Zaman (81 in 74 balls, with three fours and seven sixes) and Abdullah Shafique (68 in 69 balls, nine fours and two sixes) smashed the fifties that helped Pakistan cruise to a much-needed seven-wicket win. Fakhar received the 'Player of the Match' award for his knock.","pubDate":"2023-10-31 18:14:51","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"42142762fd37fcd808e4367af63caa03","title":"We’re better than that – Dawid Malan deflects England heat from Matthew Mott","link":"https://www.bordercountiesadvertizer.co.uk/sport/national/23892886.better---dawid-malan-deflects-england-heat-matthew-mott/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defending champions England have unravelled in dramatic fashion over the past month.","content":"England arrived in India as reigning champions and among the favourites but have unravelled in dramatic fashion over the past month. After six games they sit bottom of the table in 10th place, with a solitary win against fellow strugglers Bangladesh, putting Mott’s white-ball role under scrutiny. Speculation over the Australian’s position increased when Eoin Morgan, the side’s World Cup-winning former captain, claimed the squad seemed “unsettled” and later suggested England “take a leaf out of Baz’s book” – a direct reference to Test coach Brendon McCullum. Malan, the top run-scorer and solitary centurion in an underperforming lineup, told BBC Sport: “Motty is not the one walking out on the field. “We are being given everything we need to perform. The facilities and work, everything is being done as it always has been, we just haven’t been able to find a way to get wins on the board. It has been frustrating from a players’ point of view because we know we’re better than that. “I’m not involved in selection or any of those things, so I don’t know how that works or who is in charge of all that, but as players we need to take responsibility when we cross that rope.” Malan broadened the focus away from Mott’s future, insisting that everyone involved in the campaign would be feeling the same heat. “I guess whenever you have a poor campaign there is always someone who’s going to be targeted whether it be the captain, players, coach or selectors,” he said. “People’s jobs being scrutinised and players’ careers being scrutinised. We have a hell of a lot to play for in the last three. The only way we can get the noise off the coach is by performing. And it is up to us next three games to win these games and take that narrative away because we have not performed. “I know people say that a lot when their backs are against the wall but genuinely, we still back each other and we’re still here for each other. We just haven’t been able to put those performances out on the pitch.” Malan recently accepted a new one-year central contract with the England and Wales Cricket Board and, at 36, was neither surprised nor aggrieved to miss out on one of the new multi-year offers. He still hopes to play a part in next summer’s T20 World Cup but does not shy away from the fact that he is entering a different phase of his career. Malan confirmed that his latest deal with Yorkshire was as a white-ball only deal, effectively ending a first-class career that brought more than 13,000 runs, 22 Test caps and the high point of an Ashes century in Perth. “I’m not going to be playing four-day cricket, but I still have a contract with Yorkshire to play the Blast and I’ll still be playing the Hundred if I can get a contract in that,” he explained. “I’ll probably try and play as much white-ball cricket as I can for the rest of my career. It’s prioritising spending a bit more time at home because my winters are so busy with internationals or franchise tournaments.” Malan does not know how long his England days will last, but the appetite for fresh blood and renewal of an ageing side may hasten the end for several members of the current squad. With that in mind, he knows the 2025 Champions Trophy may be a step too far for him but remains eager to clinch a top-eight finish in India and guarantee the next generation do not miss out of qualifying for the tournament. “Two years feels a long way. I’m pretty sure I’ll be done but I’d love the guys to play in that,” he said. “If the decision gets made to move on from players, the last thing you want is that we haven’t done well enough to give other players the opportunity in future to play in big tournaments. It’s definitely not going to be a situation where we just go through the motions because we’re potentially out of this World Cup. We have a lot at stake and a lot of pride for England to be in that Champions Trophy in two years’ time.”","pubDate":"2023-10-31 18:11:57","image_url":"https://www.bordercountiesadvertizer.co.uk/resources/images/17391871/?type=app&htype=0","source_id":"bordercountiesadvertiser","source_priority":98087,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4c127eae02be5fbb1be94ba20d1ff15a","title":"We’re better than that – Dawid Malan deflects England heat from Matthew Mott","link":"https://www.basingstokegazette.co.uk/sport/national/23892886.better---dawid-malan-deflects-england-heat-matthew-mott/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defending champions England have unravelled in dramatic fashion over the past month.","content":"England arrived in India as reigning champions and among the favourites but have unravelled in dramatic fashion over the past month. After six games they sit bottom of the table in 10th place, with a solitary win against fellow strugglers Bangladesh, putting Mott’s white-ball role under scrutiny. Speculation over the Australian’s position increased when Eoin Morgan, the side’s World Cup-winning former captain, claimed the squad seemed “unsettled” and later suggested England “take a leaf out of Baz’s book” – a direct reference to Test coach Brendon McCullum. Malan, the top run-scorer and solitary centurion in an underperforming lineup, told BBC Sport: “Motty is not the one walking out on the field. “We are being given everything we need to perform. The facilities and work, everything is being done as it always has been, we just haven’t been able to find a way to get wins on the board. It has been frustrating from a players’ point of view because we know we’re better than that. “I’m not involved in selection or any of those things, so I don’t know how that works or who is in charge of all that, but as players we need to take responsibility when we cross that rope.” Malan broadened the focus away from Mott’s future, insisting that everyone involved in the campaign would be feeling the same heat. “I guess whenever you have a poor campaign there is always someone who’s going to be targeted whether it be the captain, players, coach or selectors,” he said. “People’s jobs being scrutinised and players’ careers being scrutinised. We have a hell of a lot to play for in the last three. The only way we can get the noise off the coach is by performing. And it is up to us next three games to win these games and take that narrative away because we have not performed. “I know people say that a lot when their backs are against the wall but genuinely, we still back each other and we’re still here for each other. We just haven’t been able to put those performances out on the pitch.” Malan recently accepted a new one-year central contract with the England and Wales Cricket Board and, at 36, was neither surprised nor aggrieved to miss out on one of the new multi-year offers. He still hopes to play a part in next summer’s T20 World Cup but does not shy away from the fact that he is entering a different phase of his career. Malan confirmed that his latest deal with Yorkshire was as a white-ball only deal, effectively ending a first-class career that brought more than 13,000 runs, 22 Test caps and the high point of an Ashes century in Perth. “I’m not going to be playing four-day cricket, but I still have a contract with Yorkshire to play the Blast and I’ll still be playing the Hundred if I can get a contract in that,” he explained. “I’ll probably try and play as much white-ball cricket as I can for the rest of my career. It’s prioritising spending a bit more time at home because my winters are so busy with internationals or franchise tournaments.” Malan does not know how long his England days will last, but the appetite for fresh blood and renewal of an ageing side may hasten the end for several members of the current squad. With that in mind, he knows the 2025 Champions Trophy may be a step too far for him but remains eager to clinch a top-eight finish in India and guarantee the next generation do not miss out of qualifying for the tournament. “Two years feels a long way. I’m pretty sure I’ll be done but I’d love the guys to play in that,” he said. “If the decision gets made to move on from players, the last thing you want is that we haven’t done well enough to give other players the opportunity in future to play in big tournaments. It’s definitely not going to be a situation where we just go through the motions because we’re potentially out of this World Cup. We have a lot at stake and a lot of pride for England to be in that Champions Trophy in two years’ time.”","pubDate":"2023-10-31 18:11:57","image_url":"https://www.basingstokegazette.co.uk/resources/images/17391871/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"27d1bbf6f29e0485b8666eb2d17bf5b8","title":"WC 2023: Shreyas Works On 'Weakness'; Rohit, Virat Skip Optional Practice","link":"https://sports.ndtv.com/cricket/cricket-world-cup-2023-shreyas-iyer-works-on-weakness-rohit-sharma-virat-kohli-skip-optional-practice-4531573","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer trained with the aim of overcoming his longstanding struggles ahead of the Cricket World Cup 2023 game against Sri Lanka.","content":"With his vulnerability against the short ball coming to the fore once again, India number four Shreyas Iyer trained with the aim of overcoming his longstanding struggles ahead of the Cricket World Cup 2023 game against Sri Lanka in Mumbai on Thursday. None of the top-order guns — captain Rohit Sharma, Virat Kohli and Shubman Gill — were in attendance for the optional session. Iyer versus the short ball was the focal point. The team's famed bowling attack, which delivered a fabulous 100-run victory over England last Sunday, also opted for rest. Perched at the top of the World Cup points table and with a spot in the semifinals virtually sealed for Rohit and Co, it is only imperative that the team keeps ironing out the areas of concern along the way. Iyer's troubles against the short ball, combined with the lack of big scores as the preferred No 4, is certainly something that the team management and the player want to overcome and it was evident as far as his approach to the session on Tuesday was concerned. The right-handed batter, who is back to his homeground that he shares with skipper Rohit, Suryakumar Yadav and Shardul Thakur in this Indian squad for the World Cup, faced plenty of short balls from throwdown specialists in the session that lasted for nearly two hours under the sun. While he did face some local net bowlers to begin with, the focus point of the session soon turned into having Iyer facing innumerable short balls hurled at him by India's throwdown specialists D Raghavendra, the left-handed Sri Lankan Nuwan Seneviratne and batting coach Vikram Rathour along with a few others. Having long batting stints on either side of the strip on which India will take on Sri Lanka, Iyer was also seen sporting a chest guard while he kept on pulling and hooking the short balls. To his credit, Iyer responded deftly with powerful strikes, sending the ball into the stands or clearing the ropes mostly. Towards the end, Iyer also had India head coach Rahul Dravid feeding him throwdowns and for a change, the batting great also fed a few deliveries to Iyer to drive while the bowling coach Paras Mhambrey watched from a distance. Also among the throwdown bowlers for Iyer was the team's fielding coach T Dilip, whose famous award ceremonies for the best fielder after every match have become a unique feature that fans have been glued to. Advertisement Iyer fell to the short ball in Dharamsala as well as the last game against England in Lucknow. Apart from Iyer's strenuous effort, all-rounder Shardul Thakur also had a long batting session while the others in Ishan Kishan, KL Rahul and Suryakumar had a regulation hit in the nets. All-rounders Ravichandran Ashwin and Ravindra Jadeja did more batting practice than bowling.","pubDate":"2023-10-31 18:09:17","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a37fe0fd9abb5669bf9b826df758f5e8","title":"IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce","link":"https://www.dailymail.co.uk/sport/cricket/article-12694147/State-school-cricket-dying-Englands-World-Cup-farce.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"IAN HERBERT: Precisely how England has managed to crash so spectacularly in defence of the World Cup is bewildering, but there are clues.","content":"IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce There are clues as to why England failed so badly to defend their World Cup title Hard-ball cricket is not played at state schools, leaving it out of reach to millions By Ian Herbert for MailOnline Published: 14:00 EDT, 31 October 2023 | Updated: 17:13 EDT, 31 October 2023 e-mail 21 shares 1 View comments Precisely how England, a cricket nation bankrolled by a governing body which turned over £334million in their last financial year, have managed to crash so spectacularly in defence of the World Cup is bewildering, but there are clues. Complacency and lack of interest in a form of cricket they have barely played: 42 ODIs in the past four years, compared with 88 between 2015 and 2019. The rank incompetence of announcing new central contracts mid-tournament, meaning that Ben Stokes declares he would rather maximise his earnings elsewhere than take a three-year offer, in the midst of the World Cup, while David Willey learns he is not good enough to receive any offer as he prepares to bowl against South Africa . Imagine the backlash if the FA timed an announcement like that. Hubris — everywhere. And then there is the problem which really requires vision, intelligence and the longer view. The fact that hard-ball cricket is beyond the reach of millions of our children because it is not played at state schools and is prohibitively expensive to those who may access it through clubs. Only one of England’s top six and three of the entire team smashed by South Africa in Mumbai were state-educated — that one being Stokes, who didn’t move to the UK until he was 12. State-school cricket is dying so we better get used to England's World Cup woe Hard-ball cricket is not played at state schools, leaving it out of reach to millions of kids. Ben Stokes is pictured in 2016 playing with primary school children in Newcastle Of the 12 different English players to have scored centuries in ODIs in the past four years, a mere two went to non-fee-paying schools - Stokes and Moeen Ali. In the Test format, too, England select from a painfully smaller pool than other nations. Five of the 18 openers tried since Andrew Strauss' retirement in 2012 have come from state schools, playing a combined 33 Tests out of 191. Some with an indifference to such numbers will point to how the World Cup was won four years ago with the dice loaded in favour of private school pupils. Then imagine how powerfully England, currently operating at a far lower base level than others, would compete with the elitism taken out. Those with an intelligent and active interest in the health of cricket have identified the sport's inclusion problem in the past year. One of the widely overlooked aspects of the Independent Commission for Equity in Cricket (ICEC) report - a broad and brilliant piece of work - was the stress it placed on the need to remove the barriers to working class children, priced out by the costs. The ECB's response to the report was big on gloss and words, yet maddeningly vague on detail. The report suggested county coaches working with 10-13-year-olds be given a remit to work in state schools. It raised the prospect of free kit and coaching to all children identified as possible future talents through local clubs, removing the obvious impediments to a young player from a poorer background - the £65 cost of a helmet, the £80 bat, the £40 pads. But none of this will be happening any time soon. 'To tackle barriers for state school pupils, we will develop an action plan designed to increase the number of state primary and secondary school students playing cricket,' the ECB declared in its response. And your heart sank. England are all but out of the World Cup in what has been a disastrous defence of their title 🚨 England are all but OUT of the Cricket World Cup after a 100 run defeat to India 🚨 pic.twitter.com/Z38BJPKyZD — Sky Sports Cricket (@SkyCricket) October 29, 2023 Meanwhile, out in the real world, the number of state schools where cricket is played is disappearing off the edge of a cliff. One current England international has discovered that the sport is no longer played at his old state secondary school. The promising relative of another former international has recently drifted away from the pathway talent programme. There have been successful ECB programmes like All Stars and Chance to Shine but this softball cricket is the relatively easy bit. Helping children making the step into hard ball cricket is monumental tough, particularly in the inner cities, where clubs need more coaches, more players willing to become coaches, more parents ready to get involved - and help to clear those barriers to inclusion. The sport's heroes are people like Shahidul Alam Ratan, whose organisation Capital Kids Cricket is trying to attract inner-city London children to the game. We met last year, when I was investigating why there's a lack of racial diversity in the cricket set-up at Middlesex, though his crusade transcends race. Ratan is a force of nature, constantly engaged in the fight to get a cork ball and a bat into the hands of kids. Any kids. Black, white, immigrant, British-born. The ultimate outcome just might be a renewal of that conveyor belt of players which produced Wilf Slack, Gladstone Small, Norman Cowans and others. Our Mail Sport colleague Nasser Hussain helped Capital Kids Cricket launch a 'Clubs in Need' campaign a few months ago. What wouldn't Ratan give for the financial help with coaching and equipment that the ICEC report suggested? He is too polite to point out that the ECB found £1.1million to pay its disastrous chief executive Tom Harrison in the year to January 2023, despite him leaving the organisation the previous June. So is Rick Walton, a writer and tireless champion of the sport in Pembrokeshire, where he is a talent pathway coach for promising young players. Joe Root is one of the few England internationals who were state-educated 'There's virtually no hard-ball cricket in our secondary schools now, because schools don't have the pitches or the groundsmen for their upkeep. Hardly any even have Astroturf strips. They're just reduced to softball games,' Walton tells me. Ratan recently introduced me to Bharath Rajamani of the Canons CC junior girls club, in North West London, which wants to offer its children affordable winter indoor venues to develop their skills. Most school halls are block-booked out to firms running holiday and after-school clubs. The only place Bharath could find this winter was a community hall at a local temple. Out in India, the claims and counterclaims have started. England are 'definitely unsettled,' says Eoin Morgan. Not so says Chris Woakes, who's just been carted around the subcontinent for around ten runs an over. 'We're all working together. There are no cliques.' None of which is material to England's blind spot. The base level of the national team's cricket just isn't that good and when the team are ignominiously eliminated from this tournament in the next few days, you would hope that the question of how to broaden the talent pool beyond the self-selecting middle classes just might surface. Don't hold your breath. They don't get much right... but United have got Sir Bobby tributes spot on If only Manchester United could organise a football team in the way they organised the remembrance of Sir Bobby Charlton. The past week's commemorations have befitted the man, from the two beautiful images of him draped on the front of Old Trafford to the scarf placed on his seat on Sunday. A permanent empty seat would be a fitting symbol of that remembrance. It was very good to see Manchester City uphold Sunday's tribute, too. A minute's applause extremely well observed. Manchester United have got their tributes to club legend Sir Bobby Charlton spot on A wreath placed there by Manchester United chief executive Richard Arnold rests in Sir Bobby Charlton’s seat in the directors’ box at Old Trafford ahead of tonight’s game against FC Copenhagen pic.twitter.com/SvFvzncZaY — Oliver Holt (@OllieHolt22) October 24, 2023 All Blacks live up to their name It was as much of a thrill as ever to see the All-Blacks' boots in Saturday night's World Cup final. We live in a world of individualists, sporting boots of every colour and design which say to the world, 'See! Look at me.' No pinks or green fluorescence from these participants who, to a man, wore black boots, immaculately polished. A beautiful symbol of collectivism. The All Blacks lived up to their name at the World Cup with each player sporting black boots Jilly is spot on over diving It's been a pleasure to get to know the writer Jilly Cooper these past few years, while she has been researching the football world for her great new novel, Tackle! Her unquenchable interest in the sport seems unaffected by the travails of her team, Forest Green Rovers, and it strikes me that also she very much has the measure of the sport. She relates her enthusiasm for the Lionesses in one recent interview. 'They're brilliant because they don't fall over and pretend they're dead, do they?' Jilly says. 'If men even get touched on the shoulders, they fall over. They ought to be acting Shakespeare at Stratford.' South Africa Ben Stokes England Cricket Share or comment on this article: IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce e-mail 21 shares Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 18:02:13","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/17/77234679-0-image-a-4_1698773528212.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"13897208f2732c7a144d6a1560b83642","title":"Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!'","link":"https://www.dailymail.co.uk/sport/cricket/article-12694279/Dawid-Malan-vows-England-wont-motions-three-matches-World-Cup-batsman-admits-careers-line-here.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Dawid Malan believes England will spend the last three games of their disastrous World Cup playing not just for their own careers but for the future of head coach Matthew Mott.","content":"Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!' England batsman Dawid Malan has stood out during a miserable month He wants to use match against Australia to restore pride in the team England could be eliminated from the World Cup before Saturday's fixture By Lawrence Booth for the Daily Mail Published: 18:00 GMT, 31 October 2023 | Updated: 20:51 GMT, 31 October 2023 e-mail 10 View comments Dawid Malan believes England will spend the last three games of their disastrous World Cup playing not just for their own careers but for the future of head coach Matthew Mott. During an otherwise miserable month, Malan has stood out, scoring more runs (236), and hitting more fours and sixes (31 and six), than any of his team-mates. But he said he was aware of the pressure being heaped on Mott, and wants to use Saturday’s match against Australia to restore pride to a team who have performed nothing like world champions. ‘Whenever you have a poor campaign, there is always someone who’s going to be targeted - whether it be the captain, players, coach or selectors,’ said Malan. ‘The only way we can get the noise off the coach is by performing. And it is up to us to win these next three games and take that narrative away, because we have not performed.’ Dawid Malan vows England won’t go through motions in last three matches at the World Cup Pressure is mounting on England head coach Matthew Mott after a disastrous World Cup England may yet go into the match against Australia with their fate already sealed. If New Zealand beat South Africa on Wednesday, and Afghanistan beat the Netherlands on Friday, their mathematical elimination will be confirmed. But a top-eight finish in the 10-team league will ensure qualification for the 2025 Champions Trophy in Pakistan, and there is also the carrot of next year’s T20 World Cup defence in the Caribbean and the USA. ‘People’s jobs and players’ careers are being scrutinised,’ said Malan. ‘We have a hell of a lot to play for. It’s definitely not going to be a situation where we just go through the motions.’ Like every other member of the dressing-room these past few weeks, Malan was at a loss to explain England’s ineptitude, though he played down former captain Michael Vaughan’s suggestion that discord had been sown by the mid-tournament announcement of a new set of tiered central contracts. ‘I don’t think that is an excuse,’ said Malan, one of only eight players out of 29 to receive the minimum one-year deal. ‘We have all been around long enough to still be able to perform whether we get contracts or not. We have just not been good enough.’ Malan also admitted that criticism from Eoin Morgan, Jos Buttler’s predecessor, was ‘fair’, but claimed he had no idea what Morgan meant when he said he thought ‘there was something else going on’ beyond a collective loss of form. ‘His job is to have an opinion and he’s totally entitled to that,’ he said. ‘The criticism is fair in the fact that we’ve not been good enough, and we deserve the criticism we’re getting because of it. ‘But I can only comment on us as a group. The boys are still supportive of each other. Hopefully that can turn and we start putting in some performances.’ Australia Cricket England Cricket Share or comment on this article: Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!' e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 18:00:52","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/17/77234517-0-image-a-7_1698772927815.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"2143f9cb201d1bd9eaf5db2f1ac48161","title":"OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops","link":"https://www.dailymail.co.uk/sport/football/article-12694925/OLIVER-HOLT-Money-matters-FIFA-money-doesnt-just-talk-Saudis-involved-shouts-rooftops.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"OLIVER HOLT: As soon as it had become clear the Saudis wanted to host the tournament, everyone knew it was a done deal. With Fifa, money is the only thing that matters.","content":"OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops FIFA has confirmed Saudi Arabia as the sole bidder for the 2034 World Cup Saudi Arabia is now set to dominate the sporting landscape for the next decade Listen to the latest episode of Mail Sport's podcast 'It's All Kicking Off!' By Oliver Holt for MailOnline Published: 18:30 EDT, 31 October 2023 | Updated: 18:57 EDT, 31 October 2023 e-mail 8 View comments There was still a residue of outrage in the reaction when the 2034 World Cup was handed to Saudi Arabia on Tuesday. There were still good people who raged against the machine. Most of all, though, there was sad, grim resignation. As soon as it had become clear the Saudis wanted to host the tournament, everyone knew it was a done deal. With FIFA, money is the only thing that matters. And money doesn’t just talk when the Saudis get involved with sport. It shouts from the rooftops. It buys everything and everyone. It was instructive last week to see the cast of all-time great fighters the Saudis corralled to attend the ‘Battle of the Baddest’ between Tyson Fury and Francis Ngannou in Riyadh. It felt like every boxer who had ever won a belt was there. It was another exercise in excess. If there is any sense of relief, it is that we will at least be spared the grotesque festival of venality that usually accompanies a World Cup bidding process. This time, FIFA haven’t even bothered with a vote. They put blinkers on and followed the money-trail. It was interesting to see that Eddie Howe , the Newcastle United manager who usually pleads ignorance on anything to do with the kingdom that pays his wages, felt sufficiently informed to offer an opinion on the glad tidings about the 2034 tournament. FIFA president Gianni Infantino, left, has overseen the awarding of the 2034 World Cup to Saudi Arabia All-time great boxers were brought to Saudi Arabia for Tyson Fury's bout with Francis Ngannou Newcastle boss Eddie Howe said Saudi Arabia would ensure everything is 'structurally good' Your browser does not support iframes. ‘You can rest assured that everything will be structurally really good,’ Howe said, which was cheering. Howe might be England manager by then, of course. He might even be the Saudi manager given the extent of his fealty to the cause. There will, of course, be issues surrounding the disruption of the European leagues by the logistical challenges posed by another winter World Cup. The Premier League and the rest will just have to suck that up. We never pay too much heed to the disruption summer World Cups cause to other continents. But what remains hard to stomach is FIFA’s continuing blindness to the fact that a World Cup in Saudi Arabia means a World Cup in a kingdom where same-sex relationships are criminalised, women are treated as second-class citizens and human rights abuses flourish unabated. Awarding the World Cup to Saudi Arabia is not a vote for change. It is an empowerment of the status quo. It is a reward for its abuses and its repression. We should not seek to impose our culture on the Saudis but nor should we be complicit in the staging of a tournament in a country where whole swathes of the football community will not just be unwelcome but fearful of persecution and punishment. Saudi Arabia can finance the Saudi Pro League and take players from European leagues and try to bolster attendances and even if, to western tastes, players choosing to ply their trade there in relative anonymity seems regrettable, it is a personal choice. Heading to Saudi Arabia for the World Cup, which is supposed to be a global celebration of the game, which is supposed to be open to all, which is supposed to be a showcase for bringing people together through football, is entirely different. ‘The possibility that FIFA could award Saudi Arabia the 2034 World Cup despite its appalling human rights record and closed door to any monitoring exposes FIFA’s commitments to human rights as a sham,’ said Minky Worden, director of global initiatives at Human Rights Watch. Jordan Henderson is among the European players to have been attracted to Saudi Arabia Saudi Arabia's human rights record under Crown Prince Mohammed Bin Salman, left, has been criticised despite the influx of sporting events heading to the nation The World Cup confirms Saudi Arabia will dominate the sporting landscape for a decade ‘Saudi Arabia’s appalling human rights record has deteriorated under Crown Prince Mohammed Bin Salman’s rule, including mass executions, continued repression of women’s rights under its male guardianship system, and the killing of hundreds of migrants at the Saudi-Yemen border.’ The awarding of the World Cup to Saudi Arabia also means that the kingdom will dominate the sporting landscape for the next 11 years. That was predictable, anyway, but this is confirmation. The axis of world sport is shifting towards the Middle East and this will accelerate it. It may be that the World Cup is Saudi’s endgame in its colonisation of sport. But I doubt it. It is more likely that other ambitious projects will precede it and follow it. What price there will be a Champions League final in Riyadh in 2033? What price that Manchester United play Chelsea in a Premier League match there in 2035? What price the 2035 Cricket World Cup in Saudi Arabia? What price the 2035 Ryder Cup in Jeddah? What price the 2036 Olympic Games in Riyadh? The World Cup will not be the end of Saudi Arabia’s sporting ambitions. It will just be the end of the beginning. IT'S ALL KICKING OFF! It's All Kicking Off is an exciting new podcast from Mail Sport that promises a different take on Premier League football. It is available on MailOnline , Mail+ , YouTube , Apple Music and Spotify . Your browser does not support iframes. Saudi Arabia Saudi Arabia Football Eddie Howe Share or comment on this article: OLIVER HOLT: Money matters to FIFA. And money doesn't just talk when the Saudis get involved, it shouts from the rooftops e-mail Add comment Comments 8 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 22:49:15","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/20/77241107-0-image-a-27_1698784033043.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"d3fcc3f7b14fc5af3f0ba17c4992fafe","title":"Cricket World Cup 2023: Surprises, upsets, unpredictable twists; underdogs shine and giants falter","link":"https://kashmirreader.com/2023/11/01/cricket-world-cup-2023-surprises-upsets-unpredictable-twists-underdogs-shine-and-giants-falter/","keywords":["SPORTS"],"creator":["Hilal Bukhari"],"video_url":null,"description":"The cricket World Cup is going on in India, entertaining masses and testing talents. The teams which were considered to be the softer sides till now like Afghanistan and Netherlands have shown their own class and potential while some of the cricket giants and champions have failed to impress. West Indies could not even qualify […]","content":"The cricket World Cup is going on in India, entertaining masses and testing talents. The teams which were considered to be the softer sides till now like Afghanistan and Netherlands have shown their own class and potential while some of the cricket giants and champions have failed to impress. West Indies could not even qualify for the tournament. For the first time in the whole history of the cricket World Cup, they are not part of the main tournament. Pakistan’s fans are disappointed for what they consider is the team’s worst performance in the whole World Cup history too. However, I think England’s performance is more shocking and downgraded than the other teams. English players consistently play IPL matches here. They are used to the local conditions here. They are the current ODI world champion. Still, they are currently at the bottom of the points table there. Their national cricket infrastructure is much better than Pakistan’s. As far as the Pakistani cricket team is considered I think they do not possess a perfect combination for this tournament. They have not played on the Indian soil for years together. But the so-called stalwarts and some of the cricket legends of that country who criticize the team’s performance and the captain have not achieved much during their own tenures either. Those who cry about the favouritism in the team seem unaware of the facts. I don’t think their selectors had any better options available whom they ignored to choose their favourite instead. But England is possessing the best of their players in the team. You have batters like Jos Buttler, Johnny Baritow, David Malan, Joe Root, bowlers like Woakes, Adil Rashid and Mark Wood and all-rounders like Moeen Ali and Stokes. What else makes the best team? They are the big names in the whole world of cricket still their performances are nowhere near the Netherlands players who are less popular and were less trusted for bringing such great results. The only perfect success story so far in the tournament is the team India which seems to be the most favorite side to lift the trophy this time. The home conditions and the best bowling and batting combination are about to give the Indian cricket lovers the good news they have been waiting for years now. The writer can be reached at [email protected] Cricket World Cup 2023: Surprises, upsets, unpredictable twists; underdogs shine and giants falter added by Hilal Bukhari on 3:19 am November 1, 2023 View all posts by Hilal Bukhari → Hilal Bukhari Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-10-31 21:49:42","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"e285624773554de9ad6f3e26262aa622","title":"Kal Ka Match Kon Jeeta: कल का मैच कौन जीता- पाकिस्तान vs बांग्लादेश","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kon-jeeta-pakistan-vs-bangladesh-31st-match-result-updates-here-840885.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kon Jeeta: बांग्लादेश के खिलाफ जीत हासिल करने के साथ ही पाकिस्तान ने सेमीफाइनल की उम्मीदों को भी जिंदा रखा है।","content":"बांग्लादेश को हराने के साथ ही पाकिस्तान ने वर्ल्ड कप में अपनी तीसरी जीत दर्ज कर ली है। इससे पहले पाकिस्तान की टीम को नीदरलैंड और श्रीलंका के खिलाफ जीत मिली थी। शुरुआती दो मुकाबले जीतने के बाद पाकिस्तान को लगातार चार मैचों में हार का सामना करना पड़ा था। भारत के खिलाफ 14 अक्टूबर को अहमदाबाद के नरेंद्र मोदी स्टेडियम में 7 विकेट से हार झेलने वाली पाकिस्तान की टीम एक बार फिर से जीत की पटरी पर लौट चुकी है। बांग्लादेश के कप्तान शाकिब अल हसन ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया। बांग्लादेश के बल्लेबाज पाकिस्तान के खिलाफ बड़ा स्कोर नहीं बना सके। यही वजह रही की पूरी टीम 204 रनों पर सिमट गई। जवाब में पाकिस्तान की टीम ने आसानी से 205 रन बनाकर मैच को अपने नाम कर लिया। पाकिस्तान के लिए फखर ज़मान ने सबसे ज्यादा 81 रनों की पारी खेली। इस पारी के लिए फखर जमान को प्लेयर ऑफ द मैच का अवार्ड भी दिया गया। फखर ज़मान के अलावा अब्दुल्ला शफीक ने भी 67 रन बनाए। मोहम्मद रिजवान 26 और इफ्तिखार अहमद अंत तक नाबाद रहे। गेंदबाजी की बात करें तो पाकिस्तान की टीम ने इस मुकाबले में शानदार गेंदबाजी की। शाहीन अफरीदी ने पावरप्ले में विकेट लेकर पाकिस्तान को बेहतरीन शुरुआत दिलाई। मोहम्मद वसीम जूनियर और शाहीन अफरीदी ने तीन-तीन विकेट चटकाए। वहीं हारिस रऊफ को दो सफलता मिली। अब्दुल्ला शफीक, फखर जमान, बाबर आजम (कप्तान), मोहम्मद रिजवान (विकेटकीपर), सऊद शकील, आगा सलमान, इफ्तिखार अहमद, उसामा मीर, शाहीन अफरीदी, मोहम्मद वसीम जूनियर, हारिस रऊफ। लिटन दास, तंजीद हसन, नजमुल हुसैन शान्तो, शाकिब अल हसन (कप्तान), मुश्फिकुर रहीम (विकेटकीपर), महमूदुल्लाह, तोहिद हृदोय, मेहदी हसन मिराज, तस्कीन अहमद, मुस्तफिजुर रहमान, शोरिफुल इस्लाम।","pubDate":"2023-10-31 18:30:02","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ea1b2db62bbe3b9932e1cb3f561459f0","title":"Babar Azam Hopes Win Against Bangladesh Will Raise Pakistan's Confidence","link":"https://sports.ndtv.com/cricket/cricket-world-cup-babar-azam-hopes-win-against-bangladesh-will-raise-pakistans-confidence-4533249","keywords":null,"creator":null,"video_url":null,"description":"Pakistan defeated Bangladesh in Kolkata to register their third win in the ongoing ICC World Cup 2023. Wi","content":"After Pakistan registered a 7-wicket victory against Bangladesh, captain Babar Azam lavished praise on his team's outstanding performance in all three departments and said that his side will hope to carry the confidence into the next two games. Pakistan defeated Bangladesh in Kolkata to register their third win in the ongoing ICC World Cup 2023. With this brilliant victory, Pakistan broke their four-match losing streak in the ongoing tournament and moved to 5th in the points table with 6 points. Meanwhile, the ODI World Cup semifinal dream remained unfulfilled for Bangladesh. \"Credit to the boys, the way they played in all three departments. This win hopefully gives confidence in the coming matches. Shaheen started well with the ball. After 15-20 overs, they built a partnership. But our main bowlers struck. The main thing was our bowlers hit good lengths and took wickets,\" Babar Azam said during a post-match presentation. Babar lavished praise on Fakhar Zaman and stated that if the opener bats for 20 to 30 overs, the game would be different. Fakhar made a strong comeback in the 2023 Cricket World Cup, scoring 81 against Bangladesh. This achievement was especially notable given his past troubles with form, which resulted in his expulsion from the team. \"We know how well Fakhar plays when he's going. Good to see him do it. We are trying to win our remaining matches and see where we stand,\" Babar said. Babar thanked the Indian fans for their support of him and Pakistan during the match. Former player Ramiz Raja reminded the Pakistan skipper of the support his team received at Eden Gardens, for which he expressed gratitude. \"I want to thank the fans for supporting me and Pakistan throughout the World Cup,\" he said. Talking about the match, openers Zaman and Shafique scored 81 and 68 respectively while Mohammad Rizwan slammed an unbeaten 26, guiding their team to a 7-wicket triumph. For Bangladesh, Mehidy Hasan Miraz bagged a three-wicket haul. Earlier, Pakistan pacers Mohammad Wasim Jr, Shaheen Afridi and Haris Rauf with sensational spells wreaked havoc on Bangladesh batters to restrict the Bangla Tigers to a low total of 204. Wasim Jr and Shaheen Afridi were the chief destructive duo as they bagged three-wicket hauls respectively while pacer Haris Rauf came together to help the Men in Green bowl Bangladesh out for a low total. Pakistan will next face New Zealand on Saturday at M.Chinnaswamy Stadium in Bengaluru. Advertisement","pubDate":"2023-10-31 18:20:56","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a0fd53af24930298e43f7cfb82e9f272","title":"\"Looking For Answers:\" Bangladesh Skipper Shakib After Loss To Pakistan","link":"https://sports.ndtv.com/cricket/looking-for-answers-bangladesh-skipper-shakib-al-hasan-after-loss-to-pakistan-4533231","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh skipper Shakib Al Hasan admitted that the team is looking for answers for their disappointing campaign but is struggling to find answers","content":"Following his side's loss to Pakistan in their ICC Cricket World Cup match, Bangladesh skipper Shakib Al Hasan admitted that the team is looking for answers for their disappointing campaign but is struggling to find answers and added that something needs to be thought about his batting position. Riding on Fakhar Zaman , Abdullah Shafique 's half-centuries and bowlers' brilliance Pakistan registered a 7-wicket victory over Bangladesh in the ongoing ICC World Cup 2023 at the Eden Gardens in Kolkata on Tuesday. With this brilliant victory, Pakistan broke their four-match losing streak in the ongoing tournament, moving up to 5th in the points table with 6 points. Meanwhile, the ODI World Cup semifinal dream remained unfulfilled for Bangladesh, who have registered their sixth loss. \"Not enough runs. The wicket was really good. We lost early wickets. We had partnerships but not big ones that would allow us to go big in the last ten. We should have bowled better too. Pakistan did well in the first ten overs, credit to them too. We have to think about my batting order. I was batting early, did not score runs. My confidence was low too. In this stage, changing too many things seems difficult. We are trying to force things but it isn't working. At this moment, we have to perform together, which is not happening. We are looking for answers but are not getting it. Everywhere we go, fans come to the ground and are always behind us. They are our biggest strength,\" said Shakib in a post-match presentation. Shakib has made just 104 runs in six innings during this tournament at an average of 17.33, with two 40-plus scores. Coming to the match, Bangladesh elected to bat first. Knocks from Mahmudullah (56 in 70 balls, with six fours and a six), Litton Das (45 in 64 balls, with six fours) and skipper Shakib al Hasan (43 in 64 balls, with four boundaries) came in handy as Bangladesh was bundled out for 204 in 45.1 overs. Shaheen Afridi (3/23), Mohammed Waseem Jr (3/31) and Haris Rauf (2/36) also delivered solid spells with the ball. Iftikhar Ahmed and Usama Mir also got one wicket. In the chase of 205, a returning Fakhar Zaman (81 in 74 balls, with three fours and seven sixes) and Abdullah Shafique (68 in 69 balls, nine fours and two sixes) smashed the fifties that helped Pakistan cruise to a much-needed seven-wicket win. Fakhar received the 'Player of the Match' award for his knock.","pubDate":"2023-10-31 18:14:51","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"42142762fd37fcd808e4367af63caa03","title":"We’re better than that – Dawid Malan deflects England heat from Matthew Mott","link":"https://www.bordercountiesadvertizer.co.uk/sport/national/23892886.better---dawid-malan-deflects-england-heat-matthew-mott/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defending champions England have unravelled in dramatic fashion over the past month.","content":"England arrived in India as reigning champions and among the favourites but have unravelled in dramatic fashion over the past month. After six games they sit bottom of the table in 10th place, with a solitary win against fellow strugglers Bangladesh, putting Mott’s white-ball role under scrutiny. Speculation over the Australian’s position increased when Eoin Morgan, the side’s World Cup-winning former captain, claimed the squad seemed “unsettled” and later suggested England “take a leaf out of Baz’s book” – a direct reference to Test coach Brendon McCullum. Malan, the top run-scorer and solitary centurion in an underperforming lineup, told BBC Sport: “Motty is not the one walking out on the field. “We are being given everything we need to perform. The facilities and work, everything is being done as it always has been, we just haven’t been able to find a way to get wins on the board. It has been frustrating from a players’ point of view because we know we’re better than that. “I’m not involved in selection or any of those things, so I don’t know how that works or who is in charge of all that, but as players we need to take responsibility when we cross that rope.” Malan broadened the focus away from Mott’s future, insisting that everyone involved in the campaign would be feeling the same heat. “I guess whenever you have a poor campaign there is always someone who’s going to be targeted whether it be the captain, players, coach or selectors,” he said. “People’s jobs being scrutinised and players’ careers being scrutinised. We have a hell of a lot to play for in the last three. The only way we can get the noise off the coach is by performing. And it is up to us next three games to win these games and take that narrative away because we have not performed. “I know people say that a lot when their backs are against the wall but genuinely, we still back each other and we’re still here for each other. We just haven’t been able to put those performances out on the pitch.” Malan recently accepted a new one-year central contract with the England and Wales Cricket Board and, at 36, was neither surprised nor aggrieved to miss out on one of the new multi-year offers. He still hopes to play a part in next summer’s T20 World Cup but does not shy away from the fact that he is entering a different phase of his career. Malan confirmed that his latest deal with Yorkshire was as a white-ball only deal, effectively ending a first-class career that brought more than 13,000 runs, 22 Test caps and the high point of an Ashes century in Perth. “I’m not going to be playing four-day cricket, but I still have a contract with Yorkshire to play the Blast and I’ll still be playing the Hundred if I can get a contract in that,” he explained. “I’ll probably try and play as much white-ball cricket as I can for the rest of my career. It’s prioritising spending a bit more time at home because my winters are so busy with internationals or franchise tournaments.” Malan does not know how long his England days will last, but the appetite for fresh blood and renewal of an ageing side may hasten the end for several members of the current squad. With that in mind, he knows the 2025 Champions Trophy may be a step too far for him but remains eager to clinch a top-eight finish in India and guarantee the next generation do not miss out of qualifying for the tournament. “Two years feels a long way. I’m pretty sure I’ll be done but I’d love the guys to play in that,” he said. “If the decision gets made to move on from players, the last thing you want is that we haven’t done well enough to give other players the opportunity in future to play in big tournaments. It’s definitely not going to be a situation where we just go through the motions because we’re potentially out of this World Cup. We have a lot at stake and a lot of pride for England to be in that Champions Trophy in two years’ time.”","pubDate":"2023-10-31 18:11:57","image_url":"https://www.bordercountiesadvertizer.co.uk/resources/images/17391871/?type=app&htype=0","source_id":"bordercountiesadvertiser","source_priority":98087,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"4c127eae02be5fbb1be94ba20d1ff15a","title":"We’re better than that – Dawid Malan deflects England heat from Matthew Mott","link":"https://www.basingstokegazette.co.uk/sport/national/23892886.better---dawid-malan-deflects-england-heat-matthew-mott/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Defending champions England have unravelled in dramatic fashion over the past month.","content":"England arrived in India as reigning champions and among the favourites but have unravelled in dramatic fashion over the past month. After six games they sit bottom of the table in 10th place, with a solitary win against fellow strugglers Bangladesh, putting Mott’s white-ball role under scrutiny. Speculation over the Australian’s position increased when Eoin Morgan, the side’s World Cup-winning former captain, claimed the squad seemed “unsettled” and later suggested England “take a leaf out of Baz’s book” – a direct reference to Test coach Brendon McCullum. Malan, the top run-scorer and solitary centurion in an underperforming lineup, told BBC Sport: “Motty is not the one walking out on the field. “We are being given everything we need to perform. The facilities and work, everything is being done as it always has been, we just haven’t been able to find a way to get wins on the board. It has been frustrating from a players’ point of view because we know we’re better than that. “I’m not involved in selection or any of those things, so I don’t know how that works or who is in charge of all that, but as players we need to take responsibility when we cross that rope.” Malan broadened the focus away from Mott’s future, insisting that everyone involved in the campaign would be feeling the same heat. “I guess whenever you have a poor campaign there is always someone who’s going to be targeted whether it be the captain, players, coach or selectors,” he said. “People’s jobs being scrutinised and players’ careers being scrutinised. We have a hell of a lot to play for in the last three. The only way we can get the noise off the coach is by performing. And it is up to us next three games to win these games and take that narrative away because we have not performed. “I know people say that a lot when their backs are against the wall but genuinely, we still back each other and we’re still here for each other. We just haven’t been able to put those performances out on the pitch.” Malan recently accepted a new one-year central contract with the England and Wales Cricket Board and, at 36, was neither surprised nor aggrieved to miss out on one of the new multi-year offers. He still hopes to play a part in next summer’s T20 World Cup but does not shy away from the fact that he is entering a different phase of his career. Malan confirmed that his latest deal with Yorkshire was as a white-ball only deal, effectively ending a first-class career that brought more than 13,000 runs, 22 Test caps and the high point of an Ashes century in Perth. “I’m not going to be playing four-day cricket, but I still have a contract with Yorkshire to play the Blast and I’ll still be playing the Hundred if I can get a contract in that,” he explained. “I’ll probably try and play as much white-ball cricket as I can for the rest of my career. It’s prioritising spending a bit more time at home because my winters are so busy with internationals or franchise tournaments.” Malan does not know how long his England days will last, but the appetite for fresh blood and renewal of an ageing side may hasten the end for several members of the current squad. With that in mind, he knows the 2025 Champions Trophy may be a step too far for him but remains eager to clinch a top-eight finish in India and guarantee the next generation do not miss out of qualifying for the tournament. “Two years feels a long way. I’m pretty sure I’ll be done but I’d love the guys to play in that,” he said. “If the decision gets made to move on from players, the last thing you want is that we haven’t done well enough to give other players the opportunity in future to play in big tournaments. It’s definitely not going to be a situation where we just go through the motions because we’re potentially out of this World Cup. We have a lot at stake and a lot of pride for England to be in that Champions Trophy in two years’ time.”","pubDate":"2023-10-31 18:11:57","image_url":"https://www.basingstokegazette.co.uk/resources/images/17391871/?type=app&htype=0","source_id":"basingstokegazette","source_priority":967252,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"27d1bbf6f29e0485b8666eb2d17bf5b8","title":"WC 2023: Shreyas Works On 'Weakness'; Rohit, Virat Skip Optional Practice","link":"https://sports.ndtv.com/cricket/cricket-world-cup-2023-shreyas-iyer-works-on-weakness-rohit-sharma-virat-kohli-skip-optional-practice-4531573","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer trained with the aim of overcoming his longstanding struggles ahead of the Cricket World Cup 2023 game against Sri Lanka.","content":"With his vulnerability against the short ball coming to the fore once again, India number four Shreyas Iyer trained with the aim of overcoming his longstanding struggles ahead of the Cricket World Cup 2023 game against Sri Lanka in Mumbai on Thursday. None of the top-order guns — captain Rohit Sharma, Virat Kohli and Shubman Gill — were in attendance for the optional session. Iyer versus the short ball was the focal point. The team's famed bowling attack, which delivered a fabulous 100-run victory over England last Sunday, also opted for rest. Perched at the top of the World Cup points table and with a spot in the semifinals virtually sealed for Rohit and Co, it is only imperative that the team keeps ironing out the areas of concern along the way. Iyer's troubles against the short ball, combined with the lack of big scores as the preferred No 4, is certainly something that the team management and the player want to overcome and it was evident as far as his approach to the session on Tuesday was concerned. The right-handed batter, who is back to his homeground that he shares with skipper Rohit, Suryakumar Yadav and Shardul Thakur in this Indian squad for the World Cup, faced plenty of short balls from throwdown specialists in the session that lasted for nearly two hours under the sun. While he did face some local net bowlers to begin with, the focus point of the session soon turned into having Iyer facing innumerable short balls hurled at him by India's throwdown specialists D Raghavendra, the left-handed Sri Lankan Nuwan Seneviratne and batting coach Vikram Rathour along with a few others. Having long batting stints on either side of the strip on which India will take on Sri Lanka, Iyer was also seen sporting a chest guard while he kept on pulling and hooking the short balls. To his credit, Iyer responded deftly with powerful strikes, sending the ball into the stands or clearing the ropes mostly. Towards the end, Iyer also had India head coach Rahul Dravid feeding him throwdowns and for a change, the batting great also fed a few deliveries to Iyer to drive while the bowling coach Paras Mhambrey watched from a distance. Also among the throwdown bowlers for Iyer was the team's fielding coach T Dilip, whose famous award ceremonies for the best fielder after every match have become a unique feature that fans have been glued to. Advertisement Iyer fell to the short ball in Dharamsala as well as the last game against England in Lucknow. Apart from Iyer's strenuous effort, all-rounder Shardul Thakur also had a long batting session while the others in Ishan Kishan, KL Rahul and Suryakumar had a regulation hit in the nets. All-rounders Ravichandran Ashwin and Ravindra Jadeja did more batting practice than bowling.","pubDate":"2023-10-31 18:09:17","image_url":null,"source_id":"ndtv","source_priority":1204,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"a37fe0fd9abb5669bf9b826df758f5e8","title":"IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce","link":"https://www.dailymail.co.uk/sport/cricket/article-12694147/State-school-cricket-dying-Englands-World-Cup-farce.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"IAN HERBERT: Precisely how England has managed to crash so spectacularly in defence of the World Cup is bewildering, but there are clues.","content":"IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce There are clues as to why England failed so badly to defend their World Cup title Hard-ball cricket is not played at state schools, leaving it out of reach to millions By Ian Herbert for MailOnline Published: 14:00 EDT, 31 October 2023 | Updated: 17:13 EDT, 31 October 2023 e-mail 21 shares 1 View comments Precisely how England, a cricket nation bankrolled by a governing body which turned over £334million in their last financial year, have managed to crash so spectacularly in defence of the World Cup is bewildering, but there are clues. Complacency and lack of interest in a form of cricket they have barely played: 42 ODIs in the past four years, compared with 88 between 2015 and 2019. The rank incompetence of announcing new central contracts mid-tournament, meaning that Ben Stokes declares he would rather maximise his earnings elsewhere than take a three-year offer, in the midst of the World Cup, while David Willey learns he is not good enough to receive any offer as he prepares to bowl against South Africa . Imagine the backlash if the FA timed an announcement like that. Hubris — everywhere. And then there is the problem which really requires vision, intelligence and the longer view. The fact that hard-ball cricket is beyond the reach of millions of our children because it is not played at state schools and is prohibitively expensive to those who may access it through clubs. Only one of England’s top six and three of the entire team smashed by South Africa in Mumbai were state-educated — that one being Stokes, who didn’t move to the UK until he was 12. State-school cricket is dying so we better get used to England's World Cup woe Hard-ball cricket is not played at state schools, leaving it out of reach to millions of kids. Ben Stokes is pictured in 2016 playing with primary school children in Newcastle Of the 12 different English players to have scored centuries in ODIs in the past four years, a mere two went to non-fee-paying schools - Stokes and Moeen Ali. In the Test format, too, England select from a painfully smaller pool than other nations. Five of the 18 openers tried since Andrew Strauss' retirement in 2012 have come from state schools, playing a combined 33 Tests out of 191. Some with an indifference to such numbers will point to how the World Cup was won four years ago with the dice loaded in favour of private school pupils. Then imagine how powerfully England, currently operating at a far lower base level than others, would compete with the elitism taken out. Those with an intelligent and active interest in the health of cricket have identified the sport's inclusion problem in the past year. One of the widely overlooked aspects of the Independent Commission for Equity in Cricket (ICEC) report - a broad and brilliant piece of work - was the stress it placed on the need to remove the barriers to working class children, priced out by the costs. The ECB's response to the report was big on gloss and words, yet maddeningly vague on detail. The report suggested county coaches working with 10-13-year-olds be given a remit to work in state schools. It raised the prospect of free kit and coaching to all children identified as possible future talents through local clubs, removing the obvious impediments to a young player from a poorer background - the £65 cost of a helmet, the £80 bat, the £40 pads. But none of this will be happening any time soon. 'To tackle barriers for state school pupils, we will develop an action plan designed to increase the number of state primary and secondary school students playing cricket,' the ECB declared in its response. And your heart sank. England are all but out of the World Cup in what has been a disastrous defence of their title 🚨 England are all but OUT of the Cricket World Cup after a 100 run defeat to India 🚨 pic.twitter.com/Z38BJPKyZD — Sky Sports Cricket (@SkyCricket) October 29, 2023 Meanwhile, out in the real world, the number of state schools where cricket is played is disappearing off the edge of a cliff. One current England international has discovered that the sport is no longer played at his old state secondary school. The promising relative of another former international has recently drifted away from the pathway talent programme. There have been successful ECB programmes like All Stars and Chance to Shine but this softball cricket is the relatively easy bit. Helping children making the step into hard ball cricket is monumental tough, particularly in the inner cities, where clubs need more coaches, more players willing to become coaches, more parents ready to get involved - and help to clear those barriers to inclusion. The sport's heroes are people like Shahidul Alam Ratan, whose organisation Capital Kids Cricket is trying to attract inner-city London children to the game. We met last year, when I was investigating why there's a lack of racial diversity in the cricket set-up at Middlesex, though his crusade transcends race. Ratan is a force of nature, constantly engaged in the fight to get a cork ball and a bat into the hands of kids. Any kids. Black, white, immigrant, British-born. The ultimate outcome just might be a renewal of that conveyor belt of players which produced Wilf Slack, Gladstone Small, Norman Cowans and others. Our Mail Sport colleague Nasser Hussain helped Capital Kids Cricket launch a 'Clubs in Need' campaign a few months ago. What wouldn't Ratan give for the financial help with coaching and equipment that the ICEC report suggested? He is too polite to point out that the ECB found £1.1million to pay its disastrous chief executive Tom Harrison in the year to January 2023, despite him leaving the organisation the previous June. So is Rick Walton, a writer and tireless champion of the sport in Pembrokeshire, where he is a talent pathway coach for promising young players. Joe Root is one of the few England internationals who were state-educated 'There's virtually no hard-ball cricket in our secondary schools now, because schools don't have the pitches or the groundsmen for their upkeep. Hardly any even have Astroturf strips. They're just reduced to softball games,' Walton tells me. Ratan recently introduced me to Bharath Rajamani of the Canons CC junior girls club, in North West London, which wants to offer its children affordable winter indoor venues to develop their skills. Most school halls are block-booked out to firms running holiday and after-school clubs. The only place Bharath could find this winter was a community hall at a local temple. Out in India, the claims and counterclaims have started. England are 'definitely unsettled,' says Eoin Morgan. Not so says Chris Woakes, who's just been carted around the subcontinent for around ten runs an over. 'We're all working together. There are no cliques.' None of which is material to England's blind spot. The base level of the national team's cricket just isn't that good and when the team are ignominiously eliminated from this tournament in the next few days, you would hope that the question of how to broaden the talent pool beyond the self-selecting middle classes just might surface. Don't hold your breath. They don't get much right... but United have got Sir Bobby tributes spot on If only Manchester United could organise a football team in the way they organised the remembrance of Sir Bobby Charlton. The past week's commemorations have befitted the man, from the two beautiful images of him draped on the front of Old Trafford to the scarf placed on his seat on Sunday. A permanent empty seat would be a fitting symbol of that remembrance. It was very good to see Manchester City uphold Sunday's tribute, too. A minute's applause extremely well observed. Manchester United have got their tributes to club legend Sir Bobby Charlton spot on A wreath placed there by Manchester United chief executive Richard Arnold rests in Sir Bobby Charlton’s seat in the directors’ box at Old Trafford ahead of tonight’s game against FC Copenhagen pic.twitter.com/SvFvzncZaY — Oliver Holt (@OllieHolt22) October 24, 2023 All Blacks live up to their name It was as much of a thrill as ever to see the All-Blacks' boots in Saturday night's World Cup final. We live in a world of individualists, sporting boots of every colour and design which say to the world, 'See! Look at me.' No pinks or green fluorescence from these participants who, to a man, wore black boots, immaculately polished. A beautiful symbol of collectivism. The All Blacks lived up to their name at the World Cup with each player sporting black boots Jilly is spot on over diving It's been a pleasure to get to know the writer Jilly Cooper these past few years, while she has been researching the football world for her great new novel, Tackle! Her unquenchable interest in the sport seems unaffected by the travails of her team, Forest Green Rovers, and it strikes me that also she very much has the measure of the sport. She relates her enthusiasm for the Lionesses in one recent interview. 'They're brilliant because they don't fall over and pretend they're dead, do they?' Jilly says. 'If men even get touched on the shoulders, they fall over. They ought to be acting Shakespeare at Stratford.' South Africa Ben Stokes England Cricket Share or comment on this article: IAN HERBERT: My heart sinks at state-school cricket dying... not England's World Cup farce e-mail 21 shares Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 18:02:13","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/17/77234679-0-image-a-4_1698773528212.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"13897208f2732c7a144d6a1560b83642","title":"Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!'","link":"https://www.dailymail.co.uk/sport/cricket/article-12694279/Dawid-Malan-vows-England-wont-motions-three-matches-World-Cup-batsman-admits-careers-line-here.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Dawid Malan believes England will spend the last three games of their disastrous World Cup playing not just for their own careers but for the future of head coach Matthew Mott.","content":"Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!' England batsman Dawid Malan has stood out during a miserable month He wants to use match against Australia to restore pride in the team England could be eliminated from the World Cup before Saturday's fixture By Lawrence Booth for the Daily Mail Published: 18:00 GMT, 31 October 2023 | Updated: 20:51 GMT, 31 October 2023 e-mail 10 View comments Dawid Malan believes England will spend the last three games of their disastrous World Cup playing not just for their own careers but for the future of head coach Matthew Mott. During an otherwise miserable month, Malan has stood out, scoring more runs (236), and hitting more fours and sixes (31 and six), than any of his team-mates. But he said he was aware of the pressure being heaped on Mott, and wants to use Saturday’s match against Australia to restore pride to a team who have performed nothing like world champions. ‘Whenever you have a poor campaign, there is always someone who’s going to be targeted - whether it be the captain, players, coach or selectors,’ said Malan. ‘The only way we can get the noise off the coach is by performing. And it is up to us to win these next three games and take that narrative away, because we have not performed.’ Dawid Malan vows England won’t go through motions in last three matches at the World Cup Pressure is mounting on England head coach Matthew Mott after a disastrous World Cup England may yet go into the match against Australia with their fate already sealed. If New Zealand beat South Africa on Wednesday, and Afghanistan beat the Netherlands on Friday, their mathematical elimination will be confirmed. But a top-eight finish in the 10-team league will ensure qualification for the 2025 Champions Trophy in Pakistan, and there is also the carrot of next year’s T20 World Cup defence in the Caribbean and the USA. ‘People’s jobs and players’ careers are being scrutinised,’ said Malan. ‘We have a hell of a lot to play for. It’s definitely not going to be a situation where we just go through the motions.’ Like every other member of the dressing-room these past few weeks, Malan was at a loss to explain England’s ineptitude, though he played down former captain Michael Vaughan’s suggestion that discord had been sown by the mid-tournament announcement of a new set of tiered central contracts. ‘I don’t think that is an excuse,’ said Malan, one of only eight players out of 29 to receive the minimum one-year deal. ‘We have all been around long enough to still be able to perform whether we get contracts or not. We have just not been good enough.’ Malan also admitted that criticism from Eoin Morgan, Jos Buttler’s predecessor, was ‘fair’, but claimed he had no idea what Morgan meant when he said he thought ‘there was something else going on’ beyond a collective loss of form. ‘His job is to have an opinion and he’s totally entitled to that,’ he said. ‘The criticism is fair in the fact that we’ve not been good enough, and we deserve the criticism we’re getting because of it. ‘But I can only comment on us as a group. The boys are still supportive of each other. Hopefully that can turn and we start putting in some performances.’ Australia Cricket England Cricket Share or comment on this article: Dawid Malan vows England won't go through motions in last three matches at the World Cup... as batsman admits: 'Our careers are on the line here!' e-mail Add comment Comments 10 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-31 18:00:52","image_url":"https://i.dailymail.co.uk/1s/2023/10/31/17/77234517-0-image-a-7_1698772927815.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"}]}