{"newsArray":[{"title":"एक ही ओवर में पलटा गेम, इन तीन गेंदों में जीता हुआ मैच हारा भारत, वेस्टइंडीज के नाम पहला टी-20","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/west-indies-beat-indian-cricket-team-in-1st-t20i/articleshow/102402477.cms","keywords":null,"creator":null,"video_url":null,"description":"WI vs IND highlights: भारतीय क्रिकेट टीम अपने 200वें टी-20 मुकाबले को यादगार नहीं बना पाई। वेस्टइंडीज ने आखिरी ओवर में 10 रन बचाते हुए पहला टी-20 इंटरनेशनल अपने नाम किया।","content":"वेस्टइंडीज ने जब गुरुवार रात टॉस जीतकर पहले बैटिंग करते हुए 149 रन बनाए तो हर कोई भारतीय टीम को फेवरेट बता रहा था। मगर धीमी होती गई पिच पर लगातार अंतराल में गिरते विकेट ने उसे जीत से चार रन दूर कर दिया। इस तरह ब्रायन लारा स्टेडियम में खेले गए पहले टी-20 को अपने नाम करते हुए मेजबान वेस्टइंडीज ने पांच मैच की सीरीज में 1-0 की लीड हासिल कर ली। अब अगला मुकाबला 6 अगस्त को गुयाना में खेला जाएगा। 150 रन के जवाब में हार्दिक पंड्या की कप्तानी वाली भारतीय टीम 20 ओवर में नौ विकेट खोकर 145 रन ही बना पाई। डेब्यूटेंट तिलक वर्मा ने सबसे ज्यादा 22 गेंद में 39 रन बनाए। वेस्टइंडीज के लिए शेफर्ड, होल्डर और ऑबेय ने 2-2 विकेट झटके। बल्लेबाजी में रोवमैन पॉवेल ने 32 गेंद में 48 रन की कप्तानी पारी खेली। 15वें ओवर की समाप्ति के बाद भारत का स्कोर चार विकेट के नुकसान पर 107 रन था। क्रीज पर हार्दिक पंड्या और संजू सैमसन पूरी तरह सेट थे। जीतने के लिए 30 गेंदों में सिर्फ 37 रन की जरूरत थी। मगर यहां से वेस्टइंडीज ने चमत्कारिक वापसी की। तेज गेंदबाज जेसन होल्डर ने हार्दिक पंड्या (19 गेंद में 19 रन) को क्लीन बोल्ड कर दिया। एक गेंद बाद संजू सैमसन रन आउट हो गए। काईल मेयर्स का डायरेक्ट हिट काम आ गया। तीन गेंद के भीतर गिरे इन दो विकेटों ने भारत को जीत से दूर कर दिया। भारत के लिए आईपीएल 2023 की खोज रहे तिलक वर्मा और मुकेश कुमार ने डेब्यू किया। मुकेश ने एक ही दौरे पर खेल के तीनों फॉर्मट में डेब्यू किया और ऐसा करने वाले वह टी. नटराजन के बाद दूसरे भारतीय खिलाड़ी बने। इसके अलावा वनडे सीरीज में एक भी मैच नहीं खेलने वाले लेग स्पिनर युजवेंद्र चहल ने किफायती गेंदबाजी करते हुए 24 रन देकर दो विकेट लिए तो वर्ल्ड कप के लिए लगभग नजरअंदाज किए जा चुके लेफ्ट आर्म पेसर अर्शदीप सिंह ने 31 रन देकर दो शिकार किए। बाएं हाथ के स्पिनर कुलदीप यादव और कप्तान हार्दिक पंड्या ने कसी गेंदबाजी करते हुए चार ओवर में क्रमश: 20 और 27 रन देकर एक-एक विकेट हासिल किया। टॉस जीतकर बल्लेबाजी करने उतरी वेस्टइंडीज टीम को ब्रेंडन किंग (28) ने अच्छी शुरुआत दिलाई। चार ओवर में स्कोर बिना किसी नुकसान के 29 रन हो चुका था। मगर युजवेंद्र चहल ने अपने पहले और पारी के पांचवें ओवर में किंग और दूसरे सलामी बल्लेबाज काइल मायर्स (01) को तीन गेंद के भीतर आउट करके वेस्टइंडीज को दोहरा झटका दिया। पूरन ने आते ही चहल पर चौका और छक्का मारा जबकि अगले ओवर में अक्षर की लगातार गेंदों पर भी चौका और छक्का जड़ा। पावरप्ले में स्कोर दो विकेट पर 54 रन था। मगर इसके बाद भारतीय गेंदबाजों ने वापसी की। बाएं हाथ के स्पिनर कुलदीप यादव ने जॉनसन चार्ल्स (03) को डेब्यू कर रहे तिलक वर्मा के हाथों कैच कराके तीसरा झटका दिया। भारतीय गेंदबाजों ने बीच के ओवरों में रन गति पर अंकुश लगाया। वेस्टइंडीज के बल्लेबाजों को बाउंड्री के लिए पावरप्ले के बाद 11वें ओवर तक इंतजार करना पड़ा। 15वें ओवर में टीम के रनों का शतक पूरा किया।","pubDate":"2023-08-03 19:36:09","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ijaz Butt Dies: Former Pakistan Wicketkeeper and PCB Chairman Passes Away","link":"https://www.latestly.com/sports/cricket/ijaz-butt-dies-former-pakistan-wicketkeeper-and-pcb-chairman-passes-away-5315648.html","keywords":null,"creator":null,"video_url":null,"description":"Born in Sialkot on 10 March 1938, Ijaz featured in eight Tests for Pakistan from 1959 to 1962. He remained PCB chairman from 2008 to 2011 and during his tenure Pakistan cricket team won the ICC T20 World Cup in 2009. Butt was also the manager of the Pakistan team for a tour of Australia in 1982 and headed the selection committee a couple of times.","content":"Lahore, Aug 3: Former Pakistan wicketkeeper and Pakistan Cricket Board (PCB) chairman Ijaz Butt passed away, here on Thursday. He was 85. Born in Sialkot on 10 March 1938, Ijaz featured in eight Tests for Pakistan from 1959 to 1962. He remained PCB chairman from 2008 to 2011 and during his tenure Pakistan cricket team won the ICC T20 World Cup in 2009. The PCB through its chairman and members of the management committee, board executives and employees expressed its grief and sorrow over the demise of the former Test cricketer. Pakistan Government, PCB Seek Written Assurance From ICC for Babar Azam and His Team’s Security During ICC World Cup 2023 in India: Report . \"On behalf of the PCB, I want to express my deepest condolences on the sad demise of Mr Ijaz Butt,\" said PCB management committee chairperson Zaka Ashraf. \"I had the privilege of knowing him personally and I have nothing but utmost respect for Mr Butt. I offer my deepest condolences to Ijaz Butt's family and friends, and assure them that he will always be remembered for the contributions he made to Pakistan cricket,\" he added. Butt was also the manager of the Pakistan team for a tour of Australia in 1982 and headed the selection committee a couple of times. He served as the secretary of the Board of Control for Cricket in Pakistan -- the precursor to the PCB -- from 1984-88. (The above story first appeared on LatestLY on Aug 04, 2023 12:44 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-03 19:14:18","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND Vs WI 1st T20: West Indies Defeat India By 4 Runs, Take 1-0 Lead","link":"https://news.abplive.com/sports/cricket/ind-vs-wi-1st-t20-score-highlights-india-vs-west-indies-cricket-match-live-telecast-1620470","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"An exceptional win for West Indies after their bowlers put up a magical performance to seal the nail-biting thriller, winning the game by 4 runs, taking a 1-0 lead in this 5-match T20I series. The two-time World Champions proved their worth in the opening game. The Indian team kept suffering blows at regular intervals and never looked to get ahead of the chase at any point in time of the game. Windies’ Jason Holder starred with the ball as he gave away just  19 runs in his four overs including a double-wicket maiden. Akeal Hosein was also economical and took one scalp with Obed McCoy and Romario Shepherd picking up two wickets each.  Earlier, the West Indies won the toss and opted to bat first in Trinidad and Nicholas Pooran (41) and Rovman Powell (48) powered their team to a decent total of 149/6 against India in the first T20I. For India, Arshdeep and Yuzvendra Chahal were the pick of the bowlers as they ended up taking two wickets each. For India, young batter Tilak Varma was the lone warrior who scored 39 runs and tried to put up a fightback but then it was not enough. Apart from Tilak, Suryakumar Yadav made a run-a-ball 21 as he alongside Hardik Pandya, Sanju Samson, and Axar Patel got started well but could not make the most of it. Coming down the order, Arshdeep played a vital knock and took the game to the end but  Romario Shepherd managed to defend 10 runs in the last over to ensure his team’s victory. West Indies Squad: Kyle Mayers, Johnson Charles, Nicholas Pooran(w), Shai Hope, Shimron Hetmyer, Rovman Powell(c), Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Oshane Thomas, Brandon King, Odean Smith, Roston Chase, Romario Shepherd. India Squad: Yashasvi Jaiswal, Ishan Kishan(w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Mukesh Kumar, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Tilak Varma.","content":"An exceptional win for West Indies after their bowlers put up a magical performance to seal the nail-biting thriller, winning the game by 4 runs, taking a 1-0 lead in this 5-match T20I series. The two-time World Champions proved their worth in the opening game. The Indian team kept suffering blows at regular intervals and never looked to get ahead of the chase at any point in time of the game. Windies’ Jason Holder starred with the ball as he gave away just 19 runs in his four overs including a double-wicket maiden. Akeal Hosein was also economical and took one scalp with Obed McCoy and Romario Shepherd picking up two wickets each. Earlier, the West Indies won the toss and opted to bat first in Trinidad and Nicholas Pooran (41) and Rovman Powell (48) powered their team to a decent total of 149/6 against India in the first T20I. For India, Arshdeep and Yuzvendra Chahal were the pick of the bowlers as they ended up taking two wickets each. For India, young batter Tilak Varma was the lone warrior who scored 39 runs and tried to put up a fightback but then it was not enough. Apart from Tilak, Suryakumar Yadav made a run-a-ball 21 as he alongside Hardik Pandya, Sanju Samson, and Axar Patel got started well but could not make the most of it. Coming down the order, Arshdeep played a vital knock and took the game to the end but Romario Shepherd managed to defend 10 runs in the last over to ensure his team’s victory. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); West Indies Squad : Kyle Mayers, Johnson Charles, Nicholas Pooran(w), Shai Hope, Shimron Hetmyer, Rovman Powell(c), Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Oshane Thomas, Brandon King, Odean Smith, Roston Chase, Romario Shepherd. India Squad : Yashasvi Jaiswal, Ishan Kishan(w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Mukesh Kumar, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Tilak Varma.","pubDate":"2023-08-03 19:01:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/04/1b7caf138fb2013b52f9c0064a5d80521691088928648567_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Jonny Bairstow reveals how his anke has held up throughout Ashes after horrific leg break","link":"https://www.businesslend.com/sports/jonny-bairstow-reveals-how-his-anke-has-held-up-during-ashes-after-horrific-leg-break/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport publication for all the most recent information on every little thing from biking to boxing Sign as much as our free sport electronic mail for all the most recent information After conserving wicket within the Ashes, Jonny Bairstow was left assured that his ankle will maintain as much [...] The post Jonny Bairstow reveals how his anke has held up throughout Ashes after horrific leg break appeared first on BusinessLend.","content":"After conserving wicket within the Ashes, Jonny Bairstow was left assured that his ankle will maintain as much as the gruelling schedule forward of the World Cup in October. Ahead of the worldwide summer time, Bairstow was awarded the gloves rather than specialist wicketkeeper Ben Foakes, as his talents with bat in hand in the course of the first Bazball summer time in 2022 earned him a spot within the XI. In September 2022, Bairstow suffered a freak damage, a horrific leg break on the golf course, however simply 9 months later he had returned to the Test fold and with the extra stress on the physique of conserving wicket. He hit out at critics of his conserving in the course of the third Test match at Old Trafford, calling a number of the feedback arguing for Foakes’ return “out of order”. But Bairstow was left happy with how his physique held up all through the collection, though when focus shifts to the white ball format, it is going to be a brand new problem when he takes his position within the discipline and as a specialist batter. “I feel good. The ankle has held up really well. I’m delighted with how it’s held up,” he stated. “There’s naturally an unknown when you’re coming back from it. There’s times when you can turn or you can keep on it or twist on it or whatever. “I don’t know what actually makes it flare up or if it does but it hasn’t done so that’s a fantastic thing for me and gives me a huge amount of confidence going onwards into the white ball stuff where I’ll probably be out in the field a lot more so it’s a different thing completely again.” He added: “I haven’t actually done it [fielding] yet, but it’s something I’m excited to do and I’m delighted as to how it has held up.” “I’m delighted with how free I’m feeling at the moment. You mentioned about not looking hampered with my batting and running between the wickets and I think that’s a great sign.” While Bairstow remained cautious over whether or not he would be capable to take up his normal position as a sweeper on the boundary in the course of the white-ball video games, it was constructive from a participant who has admitted that, at one level, he didn’t know if he would be capable to stroll once more. Zak Crawley was England’s high run-scorer within the Ashes collection While Bairstow was the star of 2022, it was Zak Crawley who completed as England’s highest run scorer of this collection. The final England opener to attain extra runs than the Kent batter was Michael Atherton in 1993, 5 years earlier than Crawley was born, however it was a stat that happy the 25-year-old. “I didn’t know that. I’m pleased with that stat, that’s a good one,” he stated. However with England not taking part in Test cricket once more till the brand new yr when a visit to India calls, it may very well be a unique problem for Crawley. “I don’t really know much about their grounds,” he stated. “Sometimes in India it seams and swings a bit and they’ve got unbelievable seamers as well so hopefully there are a couple of pitches there that are like that as well, that will suit us a bit more. “If it’s spinning, I feel like we play spin really well as well, we’ll just have to adapt [and] see what we get. But they are pretty unknown grounds. “I don’t know if they’re going to be raggers like Ahmedabad and Chennai where we were last time.” F1 schedule 2023: When is the subsequent Grand Prix?","pubDate":"2023-08-03 18:30:44","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"WI vs IND: भारतीय टीम की हुई घनघोर बेइज्जती, वेस्टइंडीज ने पहले टी20 में अंतिम ओवर में रौंदा","link":"https://hindi.oneindia.com/news/sports/cricket/wi-vs-ind-west-indies-defeated-india-by-4-runs-in-first-t20-match-798979.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम की शुरुआत काफी खराब रही। दोनों ही ओपनर सस्ते में आउट हो गए। उनके बाद डेब्यू कर रहे तिलक वर्मा ने तूफानी बल्लेबाजी का प्रदर्शन किया। उनके बल्ले से कुछ रन देखने को मिले। अन्य बल्लेबाज खास नहीं कर पाए।","content":": वेस्टइंडीज ने त्रिनिदाद में भारत के खिलाफ खेले गए पहले टी20 मुकाबले में धमाका कर दिया। टीम इंडिया को 4 रन से हराकर विंडीज ने पांच मैचों की सीरीज में 1-0 से बढ़त हासिल कर ली। पहले खेलते हुए वेस्टइंडीज ने 6 विकेट पर 149 रन बनाए। टीम इंडिया 9 विकेट पर 145 रन बना पाई। वेस्टइंडीज ने टॉस जीतकर बैटिंग करने का निर्णय लिया लेकिन ओपनर काइल मेयर्स को चहल ने 1 रन के स्कोर पर आउट कर दिया। ब्रेंडन किंग अच्छा खेल रहे थे लेकिन वह भी 19 गेंदों में 28 रन के निजी स्कोर पर आउट होकर चलते बने। जॉनसन चार्ल्स को कुलदीप यादव ने 3 रन पर आउट कर विंडीज को तीसरा झटका दिया। इन सबके बीच निकोलस पूरन ने धमाकेदार बल्लेबाजी का प्रदर्शन किया। वह 34 गेंदों का सामना कर 41 रन बना गए और उनके बाद रोवमैन पॉवेल ने धमाका कर दिया। उन्होंने 32 गेंदों में 3 चौके और 3 छक्कों की मदद से 48 रनों की धमाकेदार पारी खेली और विंडीज ने 6 विकेट पर 149 रन बनाए। भारत के लिए चहल और अर्शदीप ने 2-2 विकेट झटके। जवाब में खेलते हुए टीम इंडिया की खराब शुरुआ रही। ओपनर बल्लेबाज ईशान किशन और शुभमन गिल क्रमशः 6 और 3 रन बनाकर आउट हो गए। उनके बाद सूर्यकुमार यादव 21 गेंदों में 21 रन बनाकर चलते बने। तिलक वर्मा ने अपने डेब्यू मैच में तूफानी बैटिंग की और लगने नहीं दिया कि वह पहला मैच खेल रहे हैं। वह 22 गेंदों में 39 रन बनाकर आउट हो गए। पांड्या ने टिककर खेलने का प्रयास किया लेकिन 19 गेंदों में 19 रन बनाकर चलते बने। संजू सैमसन भी नहीं टिके और 12 गेंदों में 12 रन बनाकर आउट हो गए। टीम इंडिया का स्कोर 6 विकेट पर 113 रन हो गया। अक्षर पटेल ने भी प्रयास किया था लेकिन 13 रन बनाकर आउट हो गए। वह बढ़ते हुए जरूरी रन रेट का दबाव सहन नहीं कर पाए। अर्शदीप ने आते ही दो चौके जड़ टीम की उम्मीदें बनाए रखी। अंतिम ओवर में भारत को जीतने के लिए 10 रन चाहिए थे। इसमें कुलदीप यादव आउट हो गए और अर्शदीप 12 पर रन आउट हो गए, अंत में टीम इंडिया 4 रन से हार गई। विंडीज के लिए मैकॉय, होल्डर और रोमारियो शेफर्ड को 2-2 विकेट झटके।","pubDate":"2023-08-03 18:28:56","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies Beat India: पहिल्या टी-20 रोमांचक लढतीत भारताचा 4 धावांनी पराभव, वेस्ट इंडिजने मालिकेत घेतली 1-0 अशी आघाडी","link":"https://marathi.latestly.com/socially/sports/cricket/west-indies-beat-team-india-by-4-runs-in-first-t20-match-lead-1-0-in-series-481641.html","keywords":null,"creator":null,"video_url":null,"description":"पहिल्या T20 सामन्यात वेस्ट इंडिज संघाने टीम इंडियाचा 4 धावांनी पराभव करत मालिकेत 1-0 अशी आघाडी घेतली आहे. तत्पूर्वी, वेस्ट इंडिजचा कर्णधार रोव्हमन पॉवेलने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. प्रथम फलंदाजी करताना वेस्ट इंडिज संघाने निर्धारित 20 षटकांत 6 गडी गमावून 149 धावा केल्या.","content":"IND vs WI 1st T20 2023: टीम इंडिया आणि वेस्ट इंडिज (IND vs WI) यांच्यातील टी-20 मालिकेतील पहिला सामना आज ब्रायन लारा स्टेडियमवर खेळला गेला. पहिल्या T20 सामन्यात वेस्ट इंडिज संघाने टीम इंडियाचा 4 धावांनी पराभव करत मालिकेत 1-0 अशी आघाडी घेतली आहे. तत्पूर्वी, वेस्ट इंडिजचा कर्णधार रोव्हमन पॉवेलने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. प्रथम फलंदाजी करताना वेस्ट इंडिज संघाने निर्धारित 20 षटकांत 6 गडी गमावून 149 धावा केल्या. वेस्ट इंडिजकडून रोव्हमन पॉवेलने सर्वाधिक 48 धावा केल्या. टीम इंडियाकडून युझवेंद्र चहल आणि अर्शदीप सिंग यांनी प्रत्येकी सर्वाधिक दोन विकेट घेतल्या. लक्ष्याचा पाठलाग करताना टीम इंडियाला 20 षटकांत 9 गडी गमावून केवळ 145 धावा करता आल्या. टीम इंडियाकडून टिळक वर्माने सर्वाधिक 39 धावा केल्या. वेस्ट इंडिजकडून रोमारियो शेफर्ड, जेसन होल्डर आणि ओबेड मॅकॉय यांनी प्रत्येकी दोन गडी बाद केले. दोन्ही संघांमधील मालिकेतील दुसरा टी-20 सामना शनिवारी म्हणजेच 5 ऑगस्ट रोजी खेळवला जाणार आहे. 1ST T20I. West Indies Won by 4 Run(s) https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 ('सोशली' (SocialLY) हे आपल्यासाठी ट्विटर, इन्स्टाग्राम आणि यूट्यूब अशा सोशल मीडिया जगातील ताज्या ब्रेकिंग न्यूज, व्हायरल ट्रेंड व माहिती घेऊन येते. वृत्तात एम्बेड केलेली पोस्ट यूजर्सच्या सोशल मीडिया अकाऊंटमधून थेट एम्बेड करण्यात आली आहे. लेटेस्टलीच्या कर्मचाऱ्याने अथवा लेखकाने त्याचे संपादन किंवा त्यात सुधारणा केलेली नाही. सदर पोस्टमधील वस्तुस्थिती, प्रतिक्रियामधून लेटेस्टलीची मते प्रतिबिंबित होत नाहीत. तसेच या मजकूराची जबाबदारी अथवा उत्तरदायीत्व लेटेस्टली स्वीकारत नाही.)","pubDate":"2023-08-03 18:24:39","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"IND vs WI 1st T20 Live Score Update: पहले टी20 मुकाबले में वेस्टइंडीज ने टीम इंडिया को 4 रन से हराया, सीरीज में 1-0 की बनाई बढ़त","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-west-indies-beat-team-india-by-4-runs-in-the-first-t20-match-lead-1-0-in-the-series-1885746.html","keywords":null,"creator":null,"video_url":null,"description":"इससे पहले वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला गया. पहले टी20 मुकाबले में वेस्टइंडीज की टीम ने टीम इंडिया को 4 रनों से हराकर सीरीज में 1-0 की बढ़त बना ली हैं. इससे पहले वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. लक्ष्य का पीछा करने उतरी टीम इंडिया ने 20 ओवर में नौ विकेट खोकर महज 145 रन ही बना सकीं. टीम इंडिया की तरफ से तिलक वर्मा ने सबसे ज्यादा 39 रन बनाए. वेस्टइंडीज की ओर से रोमारियो शेफर्ड, जेसन होल्डर और ओबेड मैककॉय ने सबसे ज्यादा दो-दो विकेट झटके. दोनों टीमों के बीच सीरीज का दूसरा टी20 मुकाबला शनिवार यानी पांच अगस्त को खेला जाएगा. 1ST T20I. West Indies Won by 4 Run(s) https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:21:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st T20 Live Score Update: रोमारियो शेफर्ड ने वेस्टइंडीज को दिलाई आठवीं सफलता, कुलदीप यादव को बनाया अपना शिकार","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-romario-shepherd-gives-west-indies-eighth-success-makes-kuldeep-yadav-his-victim-1885754.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टीम इंडिया के लिए दो खिलाड़ियों को इस मैच में डेब्यू करने का मौका मिला हैं. तेज गेंदबाज मुकेश कुमार और मध्यक्रम के बल्लेबाज तिलक वर्मा ने अपना टी20 इंटरनेशनल डेब्यू किया हैं. दोनों अपना पहला टी20 मैच खेल रहे हैं. इस बीच पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. टीम इंडिया की ये मुकाबला जीतने के लिए 20 ओवर में 150 रन बनाने हैं. लक्ष्य का पीछा करने उतरी टीम इंडिया को आठवां बड़ा झटका लगा हैं. कुलदीप यादव 3 रन बनाकर पवेलियन लौट गए हैं. टीम इंडिया का स्कोर 140/8. 1ST T20I. WICKET! 19.1: Kuldeep Yadav 4(9) b Romario Shepherd, India 140/8 https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:14:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st T20 Live Score Update: टीम इंडिया का सातवां विकेट गिरा, अक्षर पटेल 13 रन बनाकर आउट","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-team-indias-seventh-wicket-fell-akshar-patel-out-after-scoring-13-runs-1885741.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टीम इंडिया के लिए दो खिलाड़ियों को इस मैच में डेब्यू करने का मौका मिला हैं. तेज गेंदबाज मुकेश कुमार और मध्यक्रम के बल्लेबाज तिलक वर्मा ने अपना टी20 इंटरनेशनल डेब्यू किया हैं. दोनों अपना पहला टी20 मैच खेल रहे हैं. इस बीच पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. टीम इंडिया की ये मुकाबला जीतने के लिए 20 ओवर में 150 रन बनाने हैं. लक्ष्य का पीछा करने उतरी टीम इंडिया को सातवां बड़ा झटका लगा हैं. अक्षर पटेल 13 रन बनाकर पवेलियन लौट गए हैं. टीम इंडिया का स्कोर 129/7. 1ST T20I. WICKET! 18.1: Axar Patel 13(11) ct Shimron Hetmyer b Obed McCoy, India 129/7 https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:08:23","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शिमरन हेटमायर ने पलक झपकते सूर्यकुमार का काम तमाम कर दिया, दर्शक बन देखते रह गए मिस्टर-360","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-wi-shimron-hetmyer-take-stuning-catch-of-suryakumar-in-blink-of-eye/articleshow/102402096.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI: भारत के खिलाफ पांच टी20 मैचों की सीरीज के पहले मुकाबले में वेस्टइंडीज के स्टार खिलाड़ी शिमरन हेटमायर ने एक ऐसा कैच लपका जिसे देखकर बल्लेबाजी कर रहे सूर्यकुमार यादव सिर्फ देखते रह गए।","content":"भारत के खिलाफ पहले टी20 मैच में वेस्टइंडीज के स्टार खिलाड़ी शिमरन हेटमायर बल्लेबाजी में पूरी तरह से फ्लॉप रहे। हालांकि फील्डिंग के दौरान उन्होंने मैदान पर कमाल कर दिया। हेटमायर ने शानदार फील्डिंग दिखाते हुए बेहतरीन कैच लपके जिसमें सूर्यकुमार यादव का विकेट भी शामिल था। वेस्टइंडीज के लिए खतरनाक साबित हो रहे सूर्यकुमार यादव जेसन होल्डर ने अपनी जाल में फंसा लिया लेकिन उसे सफलता के रूप में हेटमायर ने बदला। वेस्टइंडीज के द्वारा दिए गए 150 रनों के लक्ष्य का पीछा करने उतरी भारतीय टीम ने पावर प्ले में अपने दोनों ओपनर बल्लेबाज गंवा दिए। इसके बाद सूर्यकुमार यादव बल्लेबाजी के लिए मैदान पर उतरे और उनका साथ देने के लिए आए तिलक वर्मा। इन दोनों के बीच 39 रनों की साझेदारी हुई ही थी कि जेसन होल्डर ने सूर्यकुमार को आउट कर दिया। पारी का 10वां ओवर करने आए होल्डर ने अपनी दूसरी गेंद को धीमी गति से ऑफ स्टंप पर डाली। ओवरपिच हुई इस गेंद पर सूर्यकुमार ने कवर की ओर हवा में शॉट लगाया लेकिन फील्डर शिमरन हेटमायर वहां मौजूद थे जिन्होंने अपने बांए ओर डाईव लगाकर एक शानदार कैच पकड़ लिया। शिमरन हेटमायर का यह कैच इतना बेहतरीन था कि 21 रन बनाकर आउट हुए सूर्यकुमार यादव भी दर्शक बनकर उसे देखते रह गए। अपनी 21 रनों की पारी में सूर्यकुमार यादव ने 21 गेंद का सामना किया जिसमें उन्होंने चौके और सिर्फ एक छक्का लगाया। शिमरन हेटमायर ने सूर्यकुमार यादव का जो कैच लिया वह मैच का टर्निंग पॉइंट साबित हुआ। सूर्या के विकेट के बाद तिलक वर्मा, हार्दिक पंड्या और संजू सैमसन भी सस्ते में निपट गए। ऐसे में टीम इंडिया 20 ओवर में 9 विकेट खोकर 145 रन ही बना सकी और वेस्टइंडीज ने 4 रन से इस मुकाबले को जीत लिया। इस जीत के साथ ही वेस्टइंडीज ने सीरीज में 1-0 की बढ़त बना ली है। वहीं इस मैच में वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी का फैसला लिया था। मुकाबले में पॉवेल और निकोलस पूरन की महत्वपूर्ण पारी से 20 ओवर में 149 रन का स्कोर खड़ा किया था। इसके बाद अपनी कसी हुई गेंदबाजी से भारत को लक्ष्य से पहले ही रोक दिया।","pubDate":"2023-08-03 18:05:24","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एक ही ओवर में पलटा गेम, इन तीन गेंदों में जीता हुआ मैच हारा भारत, वेस्टइंडीज के नाम पहला टी-20","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/west-indies-beat-indian-cricket-team-in-1st-t20i/articleshow/102402477.cms","keywords":null,"creator":null,"video_url":null,"description":"WI vs IND highlights: भारतीय क्रिकेट टीम अपने 200वें टी-20 मुकाबले को यादगार नहीं बना पाई। वेस्टइंडीज ने आखिरी ओवर में 10 रन बचाते हुए पहला टी-20 इंटरनेशनल अपने नाम किया।","content":"वेस्टइंडीज ने जब गुरुवार रात टॉस जीतकर पहले बैटिंग करते हुए 149 रन बनाए तो हर कोई भारतीय टीम को फेवरेट बता रहा था। मगर धीमी होती गई पिच पर लगातार अंतराल में गिरते विकेट ने उसे जीत से चार रन दूर कर दिया। इस तरह ब्रायन लारा स्टेडियम में खेले गए पहले टी-20 को अपने नाम करते हुए मेजबान वेस्टइंडीज ने पांच मैच की सीरीज में 1-0 की लीड हासिल कर ली। अब अगला मुकाबला 6 अगस्त को गुयाना में खेला जाएगा। 150 रन के जवाब में हार्दिक पंड्या की कप्तानी वाली भारतीय टीम 20 ओवर में नौ विकेट खोकर 145 रन ही बना पाई। डेब्यूटेंट तिलक वर्मा ने सबसे ज्यादा 22 गेंद में 39 रन बनाए। वेस्टइंडीज के लिए शेफर्ड, होल्डर और ऑबेय ने 2-2 विकेट झटके। बल्लेबाजी में रोवमैन पॉवेल ने 32 गेंद में 48 रन की कप्तानी पारी खेली। 15वें ओवर की समाप्ति के बाद भारत का स्कोर चार विकेट के नुकसान पर 107 रन था। क्रीज पर हार्दिक पंड्या और संजू सैमसन पूरी तरह सेट थे। जीतने के लिए 30 गेंदों में सिर्फ 37 रन की जरूरत थी। मगर यहां से वेस्टइंडीज ने चमत्कारिक वापसी की। तेज गेंदबाज जेसन होल्डर ने हार्दिक पंड्या (19 गेंद में 19 रन) को क्लीन बोल्ड कर दिया। एक गेंद बाद संजू सैमसन रन आउट हो गए। काईल मेयर्स का डायरेक्ट हिट काम आ गया। तीन गेंद के भीतर गिरे इन दो विकेटों ने भारत को जीत से दूर कर दिया। भारत के लिए आईपीएल 2023 की खोज रहे तिलक वर्मा और मुकेश कुमार ने डेब्यू किया। मुकेश ने एक ही दौरे पर खेल के तीनों फॉर्मट में डेब्यू किया और ऐसा करने वाले वह टी. नटराजन के बाद दूसरे भारतीय खिलाड़ी बने। इसके अलावा वनडे सीरीज में एक भी मैच नहीं खेलने वाले लेग स्पिनर युजवेंद्र चहल ने किफायती गेंदबाजी करते हुए 24 रन देकर दो विकेट लिए तो वर्ल्ड कप के लिए लगभग नजरअंदाज किए जा चुके लेफ्ट आर्म पेसर अर्शदीप सिंह ने 31 रन देकर दो शिकार किए। बाएं हाथ के स्पिनर कुलदीप यादव और कप्तान हार्दिक पंड्या ने कसी गेंदबाजी करते हुए चार ओवर में क्रमश: 20 और 27 रन देकर एक-एक विकेट हासिल किया। टॉस जीतकर बल्लेबाजी करने उतरी वेस्टइंडीज टीम को ब्रेंडन किंग (28) ने अच्छी शुरुआत दिलाई। चार ओवर में स्कोर बिना किसी नुकसान के 29 रन हो चुका था। मगर युजवेंद्र चहल ने अपने पहले और पारी के पांचवें ओवर में किंग और दूसरे सलामी बल्लेबाज काइल मायर्स (01) को तीन गेंद के भीतर आउट करके वेस्टइंडीज को दोहरा झटका दिया। पूरन ने आते ही चहल पर चौका और छक्का मारा जबकि अगले ओवर में अक्षर की लगातार गेंदों पर भी चौका और छक्का जड़ा। पावरप्ले में स्कोर दो विकेट पर 54 रन था। मगर इसके बाद भारतीय गेंदबाजों ने वापसी की। बाएं हाथ के स्पिनर कुलदीप यादव ने जॉनसन चार्ल्स (03) को डेब्यू कर रहे तिलक वर्मा के हाथों कैच कराके तीसरा झटका दिया। भारतीय गेंदबाजों ने बीच के ओवरों में रन गति पर अंकुश लगाया। वेस्टइंडीज के बल्लेबाजों को बाउंड्री के लिए पावरप्ले के बाद 11वें ओवर तक इंतजार करना पड़ा। 15वें ओवर में टीम के रनों का शतक पूरा किया।","pubDate":"2023-08-03 19:36:09","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ijaz Butt Dies: Former Pakistan Wicketkeeper and PCB Chairman Passes Away","link":"https://www.latestly.com/sports/cricket/ijaz-butt-dies-former-pakistan-wicketkeeper-and-pcb-chairman-passes-away-5315648.html","keywords":null,"creator":null,"video_url":null,"description":"Born in Sialkot on 10 March 1938, Ijaz featured in eight Tests for Pakistan from 1959 to 1962. He remained PCB chairman from 2008 to 2011 and during his tenure Pakistan cricket team won the ICC T20 World Cup in 2009. Butt was also the manager of the Pakistan team for a tour of Australia in 1982 and headed the selection committee a couple of times.","content":"Lahore, Aug 3: Former Pakistan wicketkeeper and Pakistan Cricket Board (PCB) chairman Ijaz Butt passed away, here on Thursday. He was 85. Born in Sialkot on 10 March 1938, Ijaz featured in eight Tests for Pakistan from 1959 to 1962. He remained PCB chairman from 2008 to 2011 and during his tenure Pakistan cricket team won the ICC T20 World Cup in 2009. The PCB through its chairman and members of the management committee, board executives and employees expressed its grief and sorrow over the demise of the former Test cricketer. Pakistan Government, PCB Seek Written Assurance From ICC for Babar Azam and His Team’s Security During ICC World Cup 2023 in India: Report . \"On behalf of the PCB, I want to express my deepest condolences on the sad demise of Mr Ijaz Butt,\" said PCB management committee chairperson Zaka Ashraf. \"I had the privilege of knowing him personally and I have nothing but utmost respect for Mr Butt. I offer my deepest condolences to Ijaz Butt's family and friends, and assure them that he will always be remembered for the contributions he made to Pakistan cricket,\" he added. Butt was also the manager of the Pakistan team for a tour of Australia in 1982 and headed the selection committee a couple of times. He served as the secretary of the Board of Control for Cricket in Pakistan -- the precursor to the PCB -- from 1984-88. (The above story first appeared on LatestLY on Aug 04, 2023 12:44 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-03 19:14:18","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND Vs WI 1st T20: West Indies Defeat India By 4 Runs, Take 1-0 Lead","link":"https://news.abplive.com/sports/cricket/ind-vs-wi-1st-t20-score-highlights-india-vs-west-indies-cricket-match-live-telecast-1620470","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"An exceptional win for West Indies after their bowlers put up a magical performance to seal the nail-biting thriller, winning the game by 4 runs, taking a 1-0 lead in this 5-match T20I series. The two-time World Champions proved their worth in the opening game. The Indian team kept suffering blows at regular intervals and never looked to get ahead of the chase at any point in time of the game. Windies’ Jason Holder starred with the ball as he gave away just  19 runs in his four overs including a double-wicket maiden. Akeal Hosein was also economical and took one scalp with Obed McCoy and Romario Shepherd picking up two wickets each.  Earlier, the West Indies won the toss and opted to bat first in Trinidad and Nicholas Pooran (41) and Rovman Powell (48) powered their team to a decent total of 149/6 against India in the first T20I. For India, Arshdeep and Yuzvendra Chahal were the pick of the bowlers as they ended up taking two wickets each. For India, young batter Tilak Varma was the lone warrior who scored 39 runs and tried to put up a fightback but then it was not enough. Apart from Tilak, Suryakumar Yadav made a run-a-ball 21 as he alongside Hardik Pandya, Sanju Samson, and Axar Patel got started well but could not make the most of it. Coming down the order, Arshdeep played a vital knock and took the game to the end but  Romario Shepherd managed to defend 10 runs in the last over to ensure his team’s victory. West Indies Squad: Kyle Mayers, Johnson Charles, Nicholas Pooran(w), Shai Hope, Shimron Hetmyer, Rovman Powell(c), Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Oshane Thomas, Brandon King, Odean Smith, Roston Chase, Romario Shepherd. India Squad: Yashasvi Jaiswal, Ishan Kishan(w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Mukesh Kumar, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Tilak Varma.","content":"An exceptional win for West Indies after their bowlers put up a magical performance to seal the nail-biting thriller, winning the game by 4 runs, taking a 1-0 lead in this 5-match T20I series. The two-time World Champions proved their worth in the opening game. The Indian team kept suffering blows at regular intervals and never looked to get ahead of the chase at any point in time of the game. Windies’ Jason Holder starred with the ball as he gave away just 19 runs in his four overs including a double-wicket maiden. Akeal Hosein was also economical and took one scalp with Obed McCoy and Romario Shepherd picking up two wickets each. Earlier, the West Indies won the toss and opted to bat first in Trinidad and Nicholas Pooran (41) and Rovman Powell (48) powered their team to a decent total of 149/6 against India in the first T20I. For India, Arshdeep and Yuzvendra Chahal were the pick of the bowlers as they ended up taking two wickets each. For India, young batter Tilak Varma was the lone warrior who scored 39 runs and tried to put up a fightback but then it was not enough. Apart from Tilak, Suryakumar Yadav made a run-a-ball 21 as he alongside Hardik Pandya, Sanju Samson, and Axar Patel got started well but could not make the most of it. Coming down the order, Arshdeep played a vital knock and took the game to the end but Romario Shepherd managed to defend 10 runs in the last over to ensure his team’s victory. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); West Indies Squad : Kyle Mayers, Johnson Charles, Nicholas Pooran(w), Shai Hope, Shimron Hetmyer, Rovman Powell(c), Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Oshane Thomas, Brandon King, Odean Smith, Roston Chase, Romario Shepherd. India Squad : Yashasvi Jaiswal, Ishan Kishan(w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Mukesh Kumar, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Tilak Varma.","pubDate":"2023-08-03 19:01:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/04/1b7caf138fb2013b52f9c0064a5d80521691088928648567_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Jonny Bairstow reveals how his anke has held up throughout Ashes after horrific leg break","link":"https://www.businesslend.com/sports/jonny-bairstow-reveals-how-his-anke-has-held-up-during-ashes-after-horrific-leg-break/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport publication for all the most recent information on every little thing from biking to boxing Sign as much as our free sport electronic mail for all the most recent information After conserving wicket within the Ashes, Jonny Bairstow was left assured that his ankle will maintain as much [...] The post Jonny Bairstow reveals how his anke has held up throughout Ashes after horrific leg break appeared first on BusinessLend.","content":"After conserving wicket within the Ashes, Jonny Bairstow was left assured that his ankle will maintain as much as the gruelling schedule forward of the World Cup in October. Ahead of the worldwide summer time, Bairstow was awarded the gloves rather than specialist wicketkeeper Ben Foakes, as his talents with bat in hand in the course of the first Bazball summer time in 2022 earned him a spot within the XI. In September 2022, Bairstow suffered a freak damage, a horrific leg break on the golf course, however simply 9 months later he had returned to the Test fold and with the extra stress on the physique of conserving wicket. He hit out at critics of his conserving in the course of the third Test match at Old Trafford, calling a number of the feedback arguing for Foakes’ return “out of order”. But Bairstow was left happy with how his physique held up all through the collection, though when focus shifts to the white ball format, it is going to be a brand new problem when he takes his position within the discipline and as a specialist batter. “I feel good. The ankle has held up really well. I’m delighted with how it’s held up,” he stated. “There’s naturally an unknown when you’re coming back from it. There’s times when you can turn or you can keep on it or twist on it or whatever. “I don’t know what actually makes it flare up or if it does but it hasn’t done so that’s a fantastic thing for me and gives me a huge amount of confidence going onwards into the white ball stuff where I’ll probably be out in the field a lot more so it’s a different thing completely again.” He added: “I haven’t actually done it [fielding] yet, but it’s something I’m excited to do and I’m delighted as to how it has held up.” “I’m delighted with how free I’m feeling at the moment. You mentioned about not looking hampered with my batting and running between the wickets and I think that’s a great sign.” While Bairstow remained cautious over whether or not he would be capable to take up his normal position as a sweeper on the boundary in the course of the white-ball video games, it was constructive from a participant who has admitted that, at one level, he didn’t know if he would be capable to stroll once more. Zak Crawley was England’s high run-scorer within the Ashes collection While Bairstow was the star of 2022, it was Zak Crawley who completed as England’s highest run scorer of this collection. The final England opener to attain extra runs than the Kent batter was Michael Atherton in 1993, 5 years earlier than Crawley was born, however it was a stat that happy the 25-year-old. “I didn’t know that. I’m pleased with that stat, that’s a good one,” he stated. However with England not taking part in Test cricket once more till the brand new yr when a visit to India calls, it may very well be a unique problem for Crawley. “I don’t really know much about their grounds,” he stated. “Sometimes in India it seams and swings a bit and they’ve got unbelievable seamers as well so hopefully there are a couple of pitches there that are like that as well, that will suit us a bit more. “If it’s spinning, I feel like we play spin really well as well, we’ll just have to adapt [and] see what we get. But they are pretty unknown grounds. “I don’t know if they’re going to be raggers like Ahmedabad and Chennai where we were last time.” F1 schedule 2023: When is the subsequent Grand Prix?","pubDate":"2023-08-03 18:30:44","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"WI vs IND: भारतीय टीम की हुई घनघोर बेइज्जती, वेस्टइंडीज ने पहले टी20 में अंतिम ओवर में रौंदा","link":"https://hindi.oneindia.com/news/sports/cricket/wi-vs-ind-west-indies-defeated-india-by-4-runs-in-first-t20-match-798979.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम की शुरुआत काफी खराब रही। दोनों ही ओपनर सस्ते में आउट हो गए। उनके बाद डेब्यू कर रहे तिलक वर्मा ने तूफानी बल्लेबाजी का प्रदर्शन किया। उनके बल्ले से कुछ रन देखने को मिले। अन्य बल्लेबाज खास नहीं कर पाए।","content":": वेस्टइंडीज ने त्रिनिदाद में भारत के खिलाफ खेले गए पहले टी20 मुकाबले में धमाका कर दिया। टीम इंडिया को 4 रन से हराकर विंडीज ने पांच मैचों की सीरीज में 1-0 से बढ़त हासिल कर ली। पहले खेलते हुए वेस्टइंडीज ने 6 विकेट पर 149 रन बनाए। टीम इंडिया 9 विकेट पर 145 रन बना पाई। वेस्टइंडीज ने टॉस जीतकर बैटिंग करने का निर्णय लिया लेकिन ओपनर काइल मेयर्स को चहल ने 1 रन के स्कोर पर आउट कर दिया। ब्रेंडन किंग अच्छा खेल रहे थे लेकिन वह भी 19 गेंदों में 28 रन के निजी स्कोर पर आउट होकर चलते बने। जॉनसन चार्ल्स को कुलदीप यादव ने 3 रन पर आउट कर विंडीज को तीसरा झटका दिया। इन सबके बीच निकोलस पूरन ने धमाकेदार बल्लेबाजी का प्रदर्शन किया। वह 34 गेंदों का सामना कर 41 रन बना गए और उनके बाद रोवमैन पॉवेल ने धमाका कर दिया। उन्होंने 32 गेंदों में 3 चौके और 3 छक्कों की मदद से 48 रनों की धमाकेदार पारी खेली और विंडीज ने 6 विकेट पर 149 रन बनाए। भारत के लिए चहल और अर्शदीप ने 2-2 विकेट झटके। जवाब में खेलते हुए टीम इंडिया की खराब शुरुआ रही। ओपनर बल्लेबाज ईशान किशन और शुभमन गिल क्रमशः 6 और 3 रन बनाकर आउट हो गए। उनके बाद सूर्यकुमार यादव 21 गेंदों में 21 रन बनाकर चलते बने। तिलक वर्मा ने अपने डेब्यू मैच में तूफानी बैटिंग की और लगने नहीं दिया कि वह पहला मैच खेल रहे हैं। वह 22 गेंदों में 39 रन बनाकर आउट हो गए। पांड्या ने टिककर खेलने का प्रयास किया लेकिन 19 गेंदों में 19 रन बनाकर चलते बने। संजू सैमसन भी नहीं टिके और 12 गेंदों में 12 रन बनाकर आउट हो गए। टीम इंडिया का स्कोर 6 विकेट पर 113 रन हो गया। अक्षर पटेल ने भी प्रयास किया था लेकिन 13 रन बनाकर आउट हो गए। वह बढ़ते हुए जरूरी रन रेट का दबाव सहन नहीं कर पाए। अर्शदीप ने आते ही दो चौके जड़ टीम की उम्मीदें बनाए रखी। अंतिम ओवर में भारत को जीतने के लिए 10 रन चाहिए थे। इसमें कुलदीप यादव आउट हो गए और अर्शदीप 12 पर रन आउट हो गए, अंत में टीम इंडिया 4 रन से हार गई। विंडीज के लिए मैकॉय, होल्डर और रोमारियो शेफर्ड को 2-2 विकेट झटके।","pubDate":"2023-08-03 18:28:56","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies Beat India: पहिल्या टी-20 रोमांचक लढतीत भारताचा 4 धावांनी पराभव, वेस्ट इंडिजने मालिकेत घेतली 1-0 अशी आघाडी","link":"https://marathi.latestly.com/socially/sports/cricket/west-indies-beat-team-india-by-4-runs-in-first-t20-match-lead-1-0-in-series-481641.html","keywords":null,"creator":null,"video_url":null,"description":"पहिल्या T20 सामन्यात वेस्ट इंडिज संघाने टीम इंडियाचा 4 धावांनी पराभव करत मालिकेत 1-0 अशी आघाडी घेतली आहे. तत्पूर्वी, वेस्ट इंडिजचा कर्णधार रोव्हमन पॉवेलने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. प्रथम फलंदाजी करताना वेस्ट इंडिज संघाने निर्धारित 20 षटकांत 6 गडी गमावून 149 धावा केल्या.","content":"IND vs WI 1st T20 2023: टीम इंडिया आणि वेस्ट इंडिज (IND vs WI) यांच्यातील टी-20 मालिकेतील पहिला सामना आज ब्रायन लारा स्टेडियमवर खेळला गेला. पहिल्या T20 सामन्यात वेस्ट इंडिज संघाने टीम इंडियाचा 4 धावांनी पराभव करत मालिकेत 1-0 अशी आघाडी घेतली आहे. तत्पूर्वी, वेस्ट इंडिजचा कर्णधार रोव्हमन पॉवेलने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. प्रथम फलंदाजी करताना वेस्ट इंडिज संघाने निर्धारित 20 षटकांत 6 गडी गमावून 149 धावा केल्या. वेस्ट इंडिजकडून रोव्हमन पॉवेलने सर्वाधिक 48 धावा केल्या. टीम इंडियाकडून युझवेंद्र चहल आणि अर्शदीप सिंग यांनी प्रत्येकी सर्वाधिक दोन विकेट घेतल्या. लक्ष्याचा पाठलाग करताना टीम इंडियाला 20 षटकांत 9 गडी गमावून केवळ 145 धावा करता आल्या. टीम इंडियाकडून टिळक वर्माने सर्वाधिक 39 धावा केल्या. वेस्ट इंडिजकडून रोमारियो शेफर्ड, जेसन होल्डर आणि ओबेड मॅकॉय यांनी प्रत्येकी दोन गडी बाद केले. दोन्ही संघांमधील मालिकेतील दुसरा टी-20 सामना शनिवारी म्हणजेच 5 ऑगस्ट रोजी खेळवला जाणार आहे. 1ST T20I. West Indies Won by 4 Run(s) https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 ('सोशली' (SocialLY) हे आपल्यासाठी ट्विटर, इन्स्टाग्राम आणि यूट्यूब अशा सोशल मीडिया जगातील ताज्या ब्रेकिंग न्यूज, व्हायरल ट्रेंड व माहिती घेऊन येते. वृत्तात एम्बेड केलेली पोस्ट यूजर्सच्या सोशल मीडिया अकाऊंटमधून थेट एम्बेड करण्यात आली आहे. लेटेस्टलीच्या कर्मचाऱ्याने अथवा लेखकाने त्याचे संपादन किंवा त्यात सुधारणा केलेली नाही. सदर पोस्टमधील वस्तुस्थिती, प्रतिक्रियामधून लेटेस्टलीची मते प्रतिबिंबित होत नाहीत. तसेच या मजकूराची जबाबदारी अथवा उत्तरदायीत्व लेटेस्टली स्वीकारत नाही.)","pubDate":"2023-08-03 18:24:39","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"IND vs WI 1st T20 Live Score Update: पहले टी20 मुकाबले में वेस्टइंडीज ने टीम इंडिया को 4 रन से हराया, सीरीज में 1-0 की बनाई बढ़त","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-west-indies-beat-team-india-by-4-runs-in-the-first-t20-match-lead-1-0-in-the-series-1885746.html","keywords":null,"creator":null,"video_url":null,"description":"इससे पहले वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला गया. पहले टी20 मुकाबले में वेस्टइंडीज की टीम ने टीम इंडिया को 4 रनों से हराकर सीरीज में 1-0 की बढ़त बना ली हैं. इससे पहले वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. लक्ष्य का पीछा करने उतरी टीम इंडिया ने 20 ओवर में नौ विकेट खोकर महज 145 रन ही बना सकीं. टीम इंडिया की तरफ से तिलक वर्मा ने सबसे ज्यादा 39 रन बनाए. वेस्टइंडीज की ओर से रोमारियो शेफर्ड, जेसन होल्डर और ओबेड मैककॉय ने सबसे ज्यादा दो-दो विकेट झटके. दोनों टीमों के बीच सीरीज का दूसरा टी20 मुकाबला शनिवार यानी पांच अगस्त को खेला जाएगा. 1ST T20I. West Indies Won by 4 Run(s) https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:21:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st T20 Live Score Update: रोमारियो शेफर्ड ने वेस्टइंडीज को दिलाई आठवीं सफलता, कुलदीप यादव को बनाया अपना शिकार","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-romario-shepherd-gives-west-indies-eighth-success-makes-kuldeep-yadav-his-victim-1885754.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टीम इंडिया के लिए दो खिलाड़ियों को इस मैच में डेब्यू करने का मौका मिला हैं. तेज गेंदबाज मुकेश कुमार और मध्यक्रम के बल्लेबाज तिलक वर्मा ने अपना टी20 इंटरनेशनल डेब्यू किया हैं. दोनों अपना पहला टी20 मैच खेल रहे हैं. इस बीच पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. टीम इंडिया की ये मुकाबला जीतने के लिए 20 ओवर में 150 रन बनाने हैं. लक्ष्य का पीछा करने उतरी टीम इंडिया को आठवां बड़ा झटका लगा हैं. कुलदीप यादव 3 रन बनाकर पवेलियन लौट गए हैं. टीम इंडिया का स्कोर 140/8. 1ST T20I. WICKET! 19.1: Kuldeep Yadav 4(9) b Romario Shepherd, India 140/8 https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:14:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st T20 Live Score Update: टीम इंडिया का सातवां विकेट गिरा, अक्षर पटेल 13 रन बनाकर आउट","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-team-indias-seventh-wicket-fell-akshar-patel-out-after-scoring-13-runs-1885741.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टीम इंडिया के लिए दो खिलाड़ियों को इस मैच में डेब्यू करने का मौका मिला हैं. तेज गेंदबाज मुकेश कुमार और मध्यक्रम के बल्लेबाज तिलक वर्मा ने अपना टी20 इंटरनेशनल डेब्यू किया हैं. दोनों अपना पहला टी20 मैच खेल रहे हैं. इस बीच पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. टीम इंडिया की ये मुकाबला जीतने के लिए 20 ओवर में 150 रन बनाने हैं. लक्ष्य का पीछा करने उतरी टीम इंडिया को सातवां बड़ा झटका लगा हैं. अक्षर पटेल 13 रन बनाकर पवेलियन लौट गए हैं. टीम इंडिया का स्कोर 129/7. 1ST T20I. WICKET! 18.1: Axar Patel 13(11) ct Shimron Hetmyer b Obed McCoy, India 129/7 https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:08:23","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शिमरन हेटमायर ने पलक झपकते सूर्यकुमार का काम तमाम कर दिया, दर्शक बन देखते रह गए मिस्टर-360","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-wi-shimron-hetmyer-take-stuning-catch-of-suryakumar-in-blink-of-eye/articleshow/102402096.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI: भारत के खिलाफ पांच टी20 मैचों की सीरीज के पहले मुकाबले में वेस्टइंडीज के स्टार खिलाड़ी शिमरन हेटमायर ने एक ऐसा कैच लपका जिसे देखकर बल्लेबाजी कर रहे सूर्यकुमार यादव सिर्फ देखते रह गए।","content":"भारत के खिलाफ पहले टी20 मैच में वेस्टइंडीज के स्टार खिलाड़ी शिमरन हेटमायर बल्लेबाजी में पूरी तरह से फ्लॉप रहे। हालांकि फील्डिंग के दौरान उन्होंने मैदान पर कमाल कर दिया। हेटमायर ने शानदार फील्डिंग दिखाते हुए बेहतरीन कैच लपके जिसमें सूर्यकुमार यादव का विकेट भी शामिल था। वेस्टइंडीज के लिए खतरनाक साबित हो रहे सूर्यकुमार यादव जेसन होल्डर ने अपनी जाल में फंसा लिया लेकिन उसे सफलता के रूप में हेटमायर ने बदला। वेस्टइंडीज के द्वारा दिए गए 150 रनों के लक्ष्य का पीछा करने उतरी भारतीय टीम ने पावर प्ले में अपने दोनों ओपनर बल्लेबाज गंवा दिए। इसके बाद सूर्यकुमार यादव बल्लेबाजी के लिए मैदान पर उतरे और उनका साथ देने के लिए आए तिलक वर्मा। इन दोनों के बीच 39 रनों की साझेदारी हुई ही थी कि जेसन होल्डर ने सूर्यकुमार को आउट कर दिया। पारी का 10वां ओवर करने आए होल्डर ने अपनी दूसरी गेंद को धीमी गति से ऑफ स्टंप पर डाली। ओवरपिच हुई इस गेंद पर सूर्यकुमार ने कवर की ओर हवा में शॉट लगाया लेकिन फील्डर शिमरन हेटमायर वहां मौजूद थे जिन्होंने अपने बांए ओर डाईव लगाकर एक शानदार कैच पकड़ लिया। शिमरन हेटमायर का यह कैच इतना बेहतरीन था कि 21 रन बनाकर आउट हुए सूर्यकुमार यादव भी दर्शक बनकर उसे देखते रह गए। अपनी 21 रनों की पारी में सूर्यकुमार यादव ने 21 गेंद का सामना किया जिसमें उन्होंने चौके और सिर्फ एक छक्का लगाया। शिमरन हेटमायर ने सूर्यकुमार यादव का जो कैच लिया वह मैच का टर्निंग पॉइंट साबित हुआ। सूर्या के विकेट के बाद तिलक वर्मा, हार्दिक पंड्या और संजू सैमसन भी सस्ते में निपट गए। ऐसे में टीम इंडिया 20 ओवर में 9 विकेट खोकर 145 रन ही बना सकी और वेस्टइंडीज ने 4 रन से इस मुकाबले को जीत लिया। इस जीत के साथ ही वेस्टइंडीज ने सीरीज में 1-0 की बढ़त बना ली है। वहीं इस मैच में वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी का फैसला लिया था। मुकाबले में पॉवेल और निकोलस पूरन की महत्वपूर्ण पारी से 20 ओवर में 149 रन का स्कोर खड़ा किया था। इसके बाद अपनी कसी हुई गेंदबाजी से भारत को लक्ष्य से पहले ही रोक दिया।","pubDate":"2023-08-03 18:05:24","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एक ही ओवर में पलटा गेम, इन तीन गेंदों में जीता हुआ मैच हारा भारत, वेस्टइंडीज के नाम पहला टी-20","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/west-indies-beat-indian-cricket-team-in-1st-t20i/articleshow/102402477.cms","keywords":null,"creator":null,"video_url":null,"description":"WI vs IND highlights: भारतीय क्रिकेट टीम अपने 200वें टी-20 मुकाबले को यादगार नहीं बना पाई। वेस्टइंडीज ने आखिरी ओवर में 10 रन बचाते हुए पहला टी-20 इंटरनेशनल अपने नाम किया।","content":"वेस्टइंडीज ने जब गुरुवार रात टॉस जीतकर पहले बैटिंग करते हुए 149 रन बनाए तो हर कोई भारतीय टीम को फेवरेट बता रहा था। मगर धीमी होती गई पिच पर लगातार अंतराल में गिरते विकेट ने उसे जीत से चार रन दूर कर दिया। इस तरह ब्रायन लारा स्टेडियम में खेले गए पहले टी-20 को अपने नाम करते हुए मेजबान वेस्टइंडीज ने पांच मैच की सीरीज में 1-0 की लीड हासिल कर ली। अब अगला मुकाबला 6 अगस्त को गुयाना में खेला जाएगा। 150 रन के जवाब में हार्दिक पंड्या की कप्तानी वाली भारतीय टीम 20 ओवर में नौ विकेट खोकर 145 रन ही बना पाई। डेब्यूटेंट तिलक वर्मा ने सबसे ज्यादा 22 गेंद में 39 रन बनाए। वेस्टइंडीज के लिए शेफर्ड, होल्डर और ऑबेय ने 2-2 विकेट झटके। बल्लेबाजी में रोवमैन पॉवेल ने 32 गेंद में 48 रन की कप्तानी पारी खेली। 15वें ओवर की समाप्ति के बाद भारत का स्कोर चार विकेट के नुकसान पर 107 रन था। क्रीज पर हार्दिक पंड्या और संजू सैमसन पूरी तरह सेट थे। जीतने के लिए 30 गेंदों में सिर्फ 37 रन की जरूरत थी। मगर यहां से वेस्टइंडीज ने चमत्कारिक वापसी की। तेज गेंदबाज जेसन होल्डर ने हार्दिक पंड्या (19 गेंद में 19 रन) को क्लीन बोल्ड कर दिया। एक गेंद बाद संजू सैमसन रन आउट हो गए। काईल मेयर्स का डायरेक्ट हिट काम आ गया। तीन गेंद के भीतर गिरे इन दो विकेटों ने भारत को जीत से दूर कर दिया। भारत के लिए आईपीएल 2023 की खोज रहे तिलक वर्मा और मुकेश कुमार ने डेब्यू किया। मुकेश ने एक ही दौरे पर खेल के तीनों फॉर्मट में डेब्यू किया और ऐसा करने वाले वह टी. नटराजन के बाद दूसरे भारतीय खिलाड़ी बने। इसके अलावा वनडे सीरीज में एक भी मैच नहीं खेलने वाले लेग स्पिनर युजवेंद्र चहल ने किफायती गेंदबाजी करते हुए 24 रन देकर दो विकेट लिए तो वर्ल्ड कप के लिए लगभग नजरअंदाज किए जा चुके लेफ्ट आर्म पेसर अर्शदीप सिंह ने 31 रन देकर दो शिकार किए। बाएं हाथ के स्पिनर कुलदीप यादव और कप्तान हार्दिक पंड्या ने कसी गेंदबाजी करते हुए चार ओवर में क्रमश: 20 और 27 रन देकर एक-एक विकेट हासिल किया। टॉस जीतकर बल्लेबाजी करने उतरी वेस्टइंडीज टीम को ब्रेंडन किंग (28) ने अच्छी शुरुआत दिलाई। चार ओवर में स्कोर बिना किसी नुकसान के 29 रन हो चुका था। मगर युजवेंद्र चहल ने अपने पहले और पारी के पांचवें ओवर में किंग और दूसरे सलामी बल्लेबाज काइल मायर्स (01) को तीन गेंद के भीतर आउट करके वेस्टइंडीज को दोहरा झटका दिया। पूरन ने आते ही चहल पर चौका और छक्का मारा जबकि अगले ओवर में अक्षर की लगातार गेंदों पर भी चौका और छक्का जड़ा। पावरप्ले में स्कोर दो विकेट पर 54 रन था। मगर इसके बाद भारतीय गेंदबाजों ने वापसी की। बाएं हाथ के स्पिनर कुलदीप यादव ने जॉनसन चार्ल्स (03) को डेब्यू कर रहे तिलक वर्मा के हाथों कैच कराके तीसरा झटका दिया। भारतीय गेंदबाजों ने बीच के ओवरों में रन गति पर अंकुश लगाया। वेस्टइंडीज के बल्लेबाजों को बाउंड्री के लिए पावरप्ले के बाद 11वें ओवर तक इंतजार करना पड़ा। 15वें ओवर में टीम के रनों का शतक पूरा किया।","pubDate":"2023-08-03 19:36:09","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ijaz Butt Dies: Former Pakistan Wicketkeeper and PCB Chairman Passes Away","link":"https://www.latestly.com/sports/cricket/ijaz-butt-dies-former-pakistan-wicketkeeper-and-pcb-chairman-passes-away-5315648.html","keywords":null,"creator":null,"video_url":null,"description":"Born in Sialkot on 10 March 1938, Ijaz featured in eight Tests for Pakistan from 1959 to 1962. He remained PCB chairman from 2008 to 2011 and during his tenure Pakistan cricket team won the ICC T20 World Cup in 2009. Butt was also the manager of the Pakistan team for a tour of Australia in 1982 and headed the selection committee a couple of times.","content":"Lahore, Aug 3: Former Pakistan wicketkeeper and Pakistan Cricket Board (PCB) chairman Ijaz Butt passed away, here on Thursday. He was 85. Born in Sialkot on 10 March 1938, Ijaz featured in eight Tests for Pakistan from 1959 to 1962. He remained PCB chairman from 2008 to 2011 and during his tenure Pakistan cricket team won the ICC T20 World Cup in 2009. The PCB through its chairman and members of the management committee, board executives and employees expressed its grief and sorrow over the demise of the former Test cricketer. Pakistan Government, PCB Seek Written Assurance From ICC for Babar Azam and His Team’s Security During ICC World Cup 2023 in India: Report . \"On behalf of the PCB, I want to express my deepest condolences on the sad demise of Mr Ijaz Butt,\" said PCB management committee chairperson Zaka Ashraf. \"I had the privilege of knowing him personally and I have nothing but utmost respect for Mr Butt. I offer my deepest condolences to Ijaz Butt's family and friends, and assure them that he will always be remembered for the contributions he made to Pakistan cricket,\" he added. Butt was also the manager of the Pakistan team for a tour of Australia in 1982 and headed the selection committee a couple of times. He served as the secretary of the Board of Control for Cricket in Pakistan -- the precursor to the PCB -- from 1984-88. (The above story first appeared on LatestLY on Aug 04, 2023 12:44 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).","pubDate":"2023-08-03 19:14:18","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"IND Vs WI 1st T20: West Indies Defeat India By 4 Runs, Take 1-0 Lead","link":"https://news.abplive.com/sports/cricket/ind-vs-wi-1st-t20-score-highlights-india-vs-west-indies-cricket-match-live-telecast-1620470","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"An exceptional win for West Indies after their bowlers put up a magical performance to seal the nail-biting thriller, winning the game by 4 runs, taking a 1-0 lead in this 5-match T20I series. The two-time World Champions proved their worth in the opening game. The Indian team kept suffering blows at regular intervals and never looked to get ahead of the chase at any point in time of the game. Windies’ Jason Holder starred with the ball as he gave away just  19 runs in his four overs including a double-wicket maiden. Akeal Hosein was also economical and took one scalp with Obed McCoy and Romario Shepherd picking up two wickets each.  Earlier, the West Indies won the toss and opted to bat first in Trinidad and Nicholas Pooran (41) and Rovman Powell (48) powered their team to a decent total of 149/6 against India in the first T20I. For India, Arshdeep and Yuzvendra Chahal were the pick of the bowlers as they ended up taking two wickets each. For India, young batter Tilak Varma was the lone warrior who scored 39 runs and tried to put up a fightback but then it was not enough. Apart from Tilak, Suryakumar Yadav made a run-a-ball 21 as he alongside Hardik Pandya, Sanju Samson, and Axar Patel got started well but could not make the most of it. Coming down the order, Arshdeep played a vital knock and took the game to the end but  Romario Shepherd managed to defend 10 runs in the last over to ensure his team’s victory. West Indies Squad: Kyle Mayers, Johnson Charles, Nicholas Pooran(w), Shai Hope, Shimron Hetmyer, Rovman Powell(c), Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Oshane Thomas, Brandon King, Odean Smith, Roston Chase, Romario Shepherd. India Squad: Yashasvi Jaiswal, Ishan Kishan(w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Mukesh Kumar, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Tilak Varma.","content":"An exceptional win for West Indies after their bowlers put up a magical performance to seal the nail-biting thriller, winning the game by 4 runs, taking a 1-0 lead in this 5-match T20I series. The two-time World Champions proved their worth in the opening game. The Indian team kept suffering blows at regular intervals and never looked to get ahead of the chase at any point in time of the game. Windies’ Jason Holder starred with the ball as he gave away just 19 runs in his four overs including a double-wicket maiden. Akeal Hosein was also economical and took one scalp with Obed McCoy and Romario Shepherd picking up two wickets each. Earlier, the West Indies won the toss and opted to bat first in Trinidad and Nicholas Pooran (41) and Rovman Powell (48) powered their team to a decent total of 149/6 against India in the first T20I. For India, Arshdeep and Yuzvendra Chahal were the pick of the bowlers as they ended up taking two wickets each. For India, young batter Tilak Varma was the lone warrior who scored 39 runs and tried to put up a fightback but then it was not enough. Apart from Tilak, Suryakumar Yadav made a run-a-ball 21 as he alongside Hardik Pandya, Sanju Samson, and Axar Patel got started well but could not make the most of it. Coming down the order, Arshdeep played a vital knock and took the game to the end but Romario Shepherd managed to defend 10 runs in the last over to ensure his team’s victory. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); West Indies Squad : Kyle Mayers, Johnson Charles, Nicholas Pooran(w), Shai Hope, Shimron Hetmyer, Rovman Powell(c), Jason Holder, Akeal Hosein, Alzarri Joseph, Obed McCoy, Oshane Thomas, Brandon King, Odean Smith, Roston Chase, Romario Shepherd. India Squad : Yashasvi Jaiswal, Ishan Kishan(w), Shubman Gill, Suryakumar Yadav, Sanju Samson, Hardik Pandya(c), Axar Patel, Yuzvendra Chahal, Arshdeep Singh, Umran Malik, Mukesh Kumar, Kuldeep Yadav, Avesh Khan, Ravi Bishnoi, Tilak Varma.","pubDate":"2023-08-03 19:01:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/08/04/1b7caf138fb2013b52f9c0064a5d80521691088928648567_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"english"},{"title":"Jonny Bairstow reveals how his anke has held up throughout Ashes after horrific leg break","link":"https://www.businesslend.com/sports/jonny-bairstow-reveals-how-his-anke-has-held-up-during-ashes-after-horrific-leg-break/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport publication for all the most recent information on every little thing from biking to boxing Sign as much as our free sport electronic mail for all the most recent information After conserving wicket within the Ashes, Jonny Bairstow was left assured that his ankle will maintain as much [...] The post Jonny Bairstow reveals how his anke has held up throughout Ashes after horrific leg break appeared first on BusinessLend.","content":"After conserving wicket within the Ashes, Jonny Bairstow was left assured that his ankle will maintain as much as the gruelling schedule forward of the World Cup in October. Ahead of the worldwide summer time, Bairstow was awarded the gloves rather than specialist wicketkeeper Ben Foakes, as his talents with bat in hand in the course of the first Bazball summer time in 2022 earned him a spot within the XI. In September 2022, Bairstow suffered a freak damage, a horrific leg break on the golf course, however simply 9 months later he had returned to the Test fold and with the extra stress on the physique of conserving wicket. He hit out at critics of his conserving in the course of the third Test match at Old Trafford, calling a number of the feedback arguing for Foakes’ return “out of order”. But Bairstow was left happy with how his physique held up all through the collection, though when focus shifts to the white ball format, it is going to be a brand new problem when he takes his position within the discipline and as a specialist batter. “I feel good. The ankle has held up really well. I’m delighted with how it’s held up,” he stated. “There’s naturally an unknown when you’re coming back from it. There’s times when you can turn or you can keep on it or twist on it or whatever. “I don’t know what actually makes it flare up or if it does but it hasn’t done so that’s a fantastic thing for me and gives me a huge amount of confidence going onwards into the white ball stuff where I’ll probably be out in the field a lot more so it’s a different thing completely again.” He added: “I haven’t actually done it [fielding] yet, but it’s something I’m excited to do and I’m delighted as to how it has held up.” “I’m delighted with how free I’m feeling at the moment. You mentioned about not looking hampered with my batting and running between the wickets and I think that’s a great sign.” While Bairstow remained cautious over whether or not he would be capable to take up his normal position as a sweeper on the boundary in the course of the white-ball video games, it was constructive from a participant who has admitted that, at one level, he didn’t know if he would be capable to stroll once more. Zak Crawley was England’s high run-scorer within the Ashes collection While Bairstow was the star of 2022, it was Zak Crawley who completed as England’s highest run scorer of this collection. The final England opener to attain extra runs than the Kent batter was Michael Atherton in 1993, 5 years earlier than Crawley was born, however it was a stat that happy the 25-year-old. “I didn’t know that. I’m pleased with that stat, that’s a good one,” he stated. However with England not taking part in Test cricket once more till the brand new yr when a visit to India calls, it may very well be a unique problem for Crawley. “I don’t really know much about their grounds,” he stated. “Sometimes in India it seams and swings a bit and they’ve got unbelievable seamers as well so hopefully there are a couple of pitches there that are like that as well, that will suit us a bit more. “If it’s spinning, I feel like we play spin really well as well, we’ll just have to adapt [and] see what we get. But they are pretty unknown grounds. “I don’t know if they’re going to be raggers like Ahmedabad and Chennai where we were last time.” F1 schedule 2023: When is the subsequent Grand Prix?","pubDate":"2023-08-03 18:30:44","image_url":null,"source_id":"businesslend","category":["sports"],"country":["india"],"language":"english"},{"title":"WI vs IND: भारतीय टीम की हुई घनघोर बेइज्जती, वेस्टइंडीज ने पहले टी20 में अंतिम ओवर में रौंदा","link":"https://hindi.oneindia.com/news/sports/cricket/wi-vs-ind-west-indies-defeated-india-by-4-runs-in-first-t20-match-798979.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय टीम की शुरुआत काफी खराब रही। दोनों ही ओपनर सस्ते में आउट हो गए। उनके बाद डेब्यू कर रहे तिलक वर्मा ने तूफानी बल्लेबाजी का प्रदर्शन किया। उनके बल्ले से कुछ रन देखने को मिले। अन्य बल्लेबाज खास नहीं कर पाए।","content":": वेस्टइंडीज ने त्रिनिदाद में भारत के खिलाफ खेले गए पहले टी20 मुकाबले में धमाका कर दिया। टीम इंडिया को 4 रन से हराकर विंडीज ने पांच मैचों की सीरीज में 1-0 से बढ़त हासिल कर ली। पहले खेलते हुए वेस्टइंडीज ने 6 विकेट पर 149 रन बनाए। टीम इंडिया 9 विकेट पर 145 रन बना पाई। वेस्टइंडीज ने टॉस जीतकर बैटिंग करने का निर्णय लिया लेकिन ओपनर काइल मेयर्स को चहल ने 1 रन के स्कोर पर आउट कर दिया। ब्रेंडन किंग अच्छा खेल रहे थे लेकिन वह भी 19 गेंदों में 28 रन के निजी स्कोर पर आउट होकर चलते बने। जॉनसन चार्ल्स को कुलदीप यादव ने 3 रन पर आउट कर विंडीज को तीसरा झटका दिया। इन सबके बीच निकोलस पूरन ने धमाकेदार बल्लेबाजी का प्रदर्शन किया। वह 34 गेंदों का सामना कर 41 रन बना गए और उनके बाद रोवमैन पॉवेल ने धमाका कर दिया। उन्होंने 32 गेंदों में 3 चौके और 3 छक्कों की मदद से 48 रनों की धमाकेदार पारी खेली और विंडीज ने 6 विकेट पर 149 रन बनाए। भारत के लिए चहल और अर्शदीप ने 2-2 विकेट झटके। जवाब में खेलते हुए टीम इंडिया की खराब शुरुआ रही। ओपनर बल्लेबाज ईशान किशन और शुभमन गिल क्रमशः 6 और 3 रन बनाकर आउट हो गए। उनके बाद सूर्यकुमार यादव 21 गेंदों में 21 रन बनाकर चलते बने। तिलक वर्मा ने अपने डेब्यू मैच में तूफानी बैटिंग की और लगने नहीं दिया कि वह पहला मैच खेल रहे हैं। वह 22 गेंदों में 39 रन बनाकर आउट हो गए। पांड्या ने टिककर खेलने का प्रयास किया लेकिन 19 गेंदों में 19 रन बनाकर चलते बने। संजू सैमसन भी नहीं टिके और 12 गेंदों में 12 रन बनाकर आउट हो गए। टीम इंडिया का स्कोर 6 विकेट पर 113 रन हो गया। अक्षर पटेल ने भी प्रयास किया था लेकिन 13 रन बनाकर आउट हो गए। वह बढ़ते हुए जरूरी रन रेट का दबाव सहन नहीं कर पाए। अर्शदीप ने आते ही दो चौके जड़ टीम की उम्मीदें बनाए रखी। अंतिम ओवर में भारत को जीतने के लिए 10 रन चाहिए थे। इसमें कुलदीप यादव आउट हो गए और अर्शदीप 12 पर रन आउट हो गए, अंत में टीम इंडिया 4 रन से हार गई। विंडीज के लिए मैकॉय, होल्डर और रोमारियो शेफर्ड को 2-2 विकेट झटके।","pubDate":"2023-08-03 18:28:56","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies Beat India: पहिल्या टी-20 रोमांचक लढतीत भारताचा 4 धावांनी पराभव, वेस्ट इंडिजने मालिकेत घेतली 1-0 अशी आघाडी","link":"https://marathi.latestly.com/socially/sports/cricket/west-indies-beat-team-india-by-4-runs-in-first-t20-match-lead-1-0-in-series-481641.html","keywords":null,"creator":null,"video_url":null,"description":"पहिल्या T20 सामन्यात वेस्ट इंडिज संघाने टीम इंडियाचा 4 धावांनी पराभव करत मालिकेत 1-0 अशी आघाडी घेतली आहे. तत्पूर्वी, वेस्ट इंडिजचा कर्णधार रोव्हमन पॉवेलने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. प्रथम फलंदाजी करताना वेस्ट इंडिज संघाने निर्धारित 20 षटकांत 6 गडी गमावून 149 धावा केल्या.","content":"IND vs WI 1st T20 2023: टीम इंडिया आणि वेस्ट इंडिज (IND vs WI) यांच्यातील टी-20 मालिकेतील पहिला सामना आज ब्रायन लारा स्टेडियमवर खेळला गेला. पहिल्या T20 सामन्यात वेस्ट इंडिज संघाने टीम इंडियाचा 4 धावांनी पराभव करत मालिकेत 1-0 अशी आघाडी घेतली आहे. तत्पूर्वी, वेस्ट इंडिजचा कर्णधार रोव्हमन पॉवेलने नाणेफेक जिंकून प्रथम फलंदाजी करण्याचा निर्णय घेतला. प्रथम फलंदाजी करताना वेस्ट इंडिज संघाने निर्धारित 20 षटकांत 6 गडी गमावून 149 धावा केल्या. वेस्ट इंडिजकडून रोव्हमन पॉवेलने सर्वाधिक 48 धावा केल्या. टीम इंडियाकडून युझवेंद्र चहल आणि अर्शदीप सिंग यांनी प्रत्येकी सर्वाधिक दोन विकेट घेतल्या. लक्ष्याचा पाठलाग करताना टीम इंडियाला 20 षटकांत 9 गडी गमावून केवळ 145 धावा करता आल्या. टीम इंडियाकडून टिळक वर्माने सर्वाधिक 39 धावा केल्या. वेस्ट इंडिजकडून रोमारियो शेफर्ड, जेसन होल्डर आणि ओबेड मॅकॉय यांनी प्रत्येकी दोन गडी बाद केले. दोन्ही संघांमधील मालिकेतील दुसरा टी-20 सामना शनिवारी म्हणजेच 5 ऑगस्ट रोजी खेळवला जाणार आहे. 1ST T20I. West Indies Won by 4 Run(s) https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 ('सोशली' (SocialLY) हे आपल्यासाठी ट्विटर, इन्स्टाग्राम आणि यूट्यूब अशा सोशल मीडिया जगातील ताज्या ब्रेकिंग न्यूज, व्हायरल ट्रेंड व माहिती घेऊन येते. वृत्तात एम्बेड केलेली पोस्ट यूजर्सच्या सोशल मीडिया अकाऊंटमधून थेट एम्बेड करण्यात आली आहे. लेटेस्टलीच्या कर्मचाऱ्याने अथवा लेखकाने त्याचे संपादन किंवा त्यात सुधारणा केलेली नाही. सदर पोस्टमधील वस्तुस्थिती, प्रतिक्रियामधून लेटेस्टलीची मते प्रतिबिंबित होत नाहीत. तसेच या मजकूराची जबाबदारी अथवा उत्तरदायीत्व लेटेस्टली स्वीकारत नाही.)","pubDate":"2023-08-03 18:24:39","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"Marathi"},{"title":"IND vs WI 1st T20 Live Score Update: पहले टी20 मुकाबले में वेस्टइंडीज ने टीम इंडिया को 4 रन से हराया, सीरीज में 1-0 की बनाई बढ़त","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-west-indies-beat-team-india-by-4-runs-in-the-first-t20-match-lead-1-0-in-the-series-1885746.html","keywords":null,"creator":null,"video_url":null,"description":"इससे पहले वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला गया. पहले टी20 मुकाबले में वेस्टइंडीज की टीम ने टीम इंडिया को 4 रनों से हराकर सीरीज में 1-0 की बढ़त बना ली हैं. इससे पहले वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. लक्ष्य का पीछा करने उतरी टीम इंडिया ने 20 ओवर में नौ विकेट खोकर महज 145 रन ही बना सकीं. टीम इंडिया की तरफ से तिलक वर्मा ने सबसे ज्यादा 39 रन बनाए. वेस्टइंडीज की ओर से रोमारियो शेफर्ड, जेसन होल्डर और ओबेड मैककॉय ने सबसे ज्यादा दो-दो विकेट झटके. दोनों टीमों के बीच सीरीज का दूसरा टी20 मुकाबला शनिवार यानी पांच अगस्त को खेला जाएगा. 1ST T20I. West Indies Won by 4 Run(s) https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:21:38","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st T20 Live Score Update: रोमारियो शेफर्ड ने वेस्टइंडीज को दिलाई आठवीं सफलता, कुलदीप यादव को बनाया अपना शिकार","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-romario-shepherd-gives-west-indies-eighth-success-makes-kuldeep-yadav-his-victim-1885754.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टीम इंडिया के लिए दो खिलाड़ियों को इस मैच में डेब्यू करने का मौका मिला हैं. तेज गेंदबाज मुकेश कुमार और मध्यक्रम के बल्लेबाज तिलक वर्मा ने अपना टी20 इंटरनेशनल डेब्यू किया हैं. दोनों अपना पहला टी20 मैच खेल रहे हैं. इस बीच पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. टीम इंडिया की ये मुकाबला जीतने के लिए 20 ओवर में 150 रन बनाने हैं. लक्ष्य का पीछा करने उतरी टीम इंडिया को आठवां बड़ा झटका लगा हैं. कुलदीप यादव 3 रन बनाकर पवेलियन लौट गए हैं. टीम इंडिया का स्कोर 140/8. 1ST T20I. WICKET! 19.1: Kuldeep Yadav 4(9) b Romario Shepherd, India 140/8 https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:14:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st T20 Live Score Update: टीम इंडिया का सातवां विकेट गिरा, अक्षर पटेल 13 रन बनाकर आउट","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-t20-live-score-update-team-indias-seventh-wicket-fell-akshar-patel-out-after-scoring-13-runs-1885741.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया.","content":"टीम इंडिया और वेस्टइंडीज के बीच टी20 सीरीज का पहला मैच आज ब्रायन लारा स्टेडियम में खेला जा रहा हैं. टीम इंडिया ने हाल ही में टेस्ट और वनडे सीरीज पर कब्ज़ा किया हैं. अब दोनों टीमों के बीच टी20 सीरीज खेली जा रही हैं. इस बीच वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टीम इंडिया के लिए दो खिलाड़ियों को इस मैच में डेब्यू करने का मौका मिला हैं. तेज गेंदबाज मुकेश कुमार और मध्यक्रम के बल्लेबाज तिलक वर्मा ने अपना टी20 इंटरनेशनल डेब्यू किया हैं. दोनों अपना पहला टी20 मैच खेल रहे हैं. इस बीच पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम ने निर्धारित 20 ओवरों में छह विकेट खोकर 149 रन बनाए. वेस्टइंडीज की तरफ से रोवमैन पॉवेल ने सबसे ज्यादा 48 रन बनाए. टीम इंडिया की तरफ से युजवेंद्र चहल और अर्शदीप सिंह ने सबसे ज्यादा दो-दो विकेट चटकाए. टीम इंडिया की ये मुकाबला जीतने के लिए 20 ओवर में 150 रन बनाने हैं. लक्ष्य का पीछा करने उतरी टीम इंडिया को सातवां बड़ा झटका लगा हैं. अक्षर पटेल 13 रन बनाकर पवेलियन लौट गए हैं. टीम इंडिया का स्कोर 129/7. 1ST T20I. WICKET! 18.1: Axar Patel 13(11) ct Shimron Hetmyer b Obed McCoy, India 129/7 https://t.co/AU7RtGPSOn #WIvIND — BCCI (@BCCI) August 3, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-08-03 18:08:23","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"शिमरन हेटमायर ने पलक झपकते सूर्यकुमार का काम तमाम कर दिया, दर्शक बन देखते रह गए मिस्टर-360","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ind-vs-wi-shimron-hetmyer-take-stuning-catch-of-suryakumar-in-blink-of-eye/articleshow/102402096.cms","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI: भारत के खिलाफ पांच टी20 मैचों की सीरीज के पहले मुकाबले में वेस्टइंडीज के स्टार खिलाड़ी शिमरन हेटमायर ने एक ऐसा कैच लपका जिसे देखकर बल्लेबाजी कर रहे सूर्यकुमार यादव सिर्फ देखते रह गए।","content":"भारत के खिलाफ पहले टी20 मैच में वेस्टइंडीज के स्टार खिलाड़ी शिमरन हेटमायर बल्लेबाजी में पूरी तरह से फ्लॉप रहे। हालांकि फील्डिंग के दौरान उन्होंने मैदान पर कमाल कर दिया। हेटमायर ने शानदार फील्डिंग दिखाते हुए बेहतरीन कैच लपके जिसमें सूर्यकुमार यादव का विकेट भी शामिल था। वेस्टइंडीज के लिए खतरनाक साबित हो रहे सूर्यकुमार यादव जेसन होल्डर ने अपनी जाल में फंसा लिया लेकिन उसे सफलता के रूप में हेटमायर ने बदला। वेस्टइंडीज के द्वारा दिए गए 150 रनों के लक्ष्य का पीछा करने उतरी भारतीय टीम ने पावर प्ले में अपने दोनों ओपनर बल्लेबाज गंवा दिए। इसके बाद सूर्यकुमार यादव बल्लेबाजी के लिए मैदान पर उतरे और उनका साथ देने के लिए आए तिलक वर्मा। इन दोनों के बीच 39 रनों की साझेदारी हुई ही थी कि जेसन होल्डर ने सूर्यकुमार को आउट कर दिया। पारी का 10वां ओवर करने आए होल्डर ने अपनी दूसरी गेंद को धीमी गति से ऑफ स्टंप पर डाली। ओवरपिच हुई इस गेंद पर सूर्यकुमार ने कवर की ओर हवा में शॉट लगाया लेकिन फील्डर शिमरन हेटमायर वहां मौजूद थे जिन्होंने अपने बांए ओर डाईव लगाकर एक शानदार कैच पकड़ लिया। शिमरन हेटमायर का यह कैच इतना बेहतरीन था कि 21 रन बनाकर आउट हुए सूर्यकुमार यादव भी दर्शक बनकर उसे देखते रह गए। अपनी 21 रनों की पारी में सूर्यकुमार यादव ने 21 गेंद का सामना किया जिसमें उन्होंने चौके और सिर्फ एक छक्का लगाया। शिमरन हेटमायर ने सूर्यकुमार यादव का जो कैच लिया वह मैच का टर्निंग पॉइंट साबित हुआ। सूर्या के विकेट के बाद तिलक वर्मा, हार्दिक पंड्या और संजू सैमसन भी सस्ते में निपट गए। ऐसे में टीम इंडिया 20 ओवर में 9 विकेट खोकर 145 रन ही बना सकी और वेस्टइंडीज ने 4 रन से इस मुकाबले को जीत लिया। इस जीत के साथ ही वेस्टइंडीज ने सीरीज में 1-0 की बढ़त बना ली है। वहीं इस मैच में वेस्टइंडीज के कप्तान रोवमैन पॉवेल ने टॉस जीतकर पहले बल्लेबाजी का फैसला लिया था। मुकाबले में पॉवेल और निकोलस पूरन की महत्वपूर्ण पारी से 20 ओवर में 149 रन का स्कोर खड़ा किया था। इसके बाद अपनी कसी हुई गेंदबाजी से भारत को लक्ष्य से पहले ही रोक दिया।","pubDate":"2023-08-03 18:05:24","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}