{"newsArray":[{"article_id":"66cd7926c6a16b92a2fca0217156d109","title":"Afghanistan upset Sri Lanka to proceed memorable Cricket World Cup marketing campaign","link":"https://www.businesslend.com/sports/afghanistan-upset-sri-lanka-to-continue-memorable-cricket-world-cup-campaign/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on every little thing from biking to boxing Sign as much as our free sport electronic mail for all the most recent information A spirited Afghanistan upset one other former champion on Monday when Hashmatullah Shahidi’s males defeated 1996 winners Sri [...] The post Afghanistan upset Sri Lanka to proceed memorable Cricket World Cup marketing campaign appeared first on BusinessLend.","content":"A spirited Afghanistan upset one other former champion on Monday when Hashmatullah Shahidi’s males defeated 1996 winners Sri Lanka by seven wickets to proceed their memorable marketing campaign on the 50-overs Cricket World Cup. Their bowlers had laid the inspiration of their third win in six matches after they bowled out Sri Lanka for a below-par 241 in 49.3 overs. Three of their prime 5 batters, together with Shahidi, then produced half-centuries in a scientific chase which they completed in 45.2 overs to maneuver to the fifth place within the factors desk. Azmatullah Omarzai (73) scored the successful run with Shahidi (58) trying on from the opposite finish. Afghanistan, who registered one win within the 2015 World Cup and none in 2019, now have an outright probability of constructing the final 4 in India. “Quite happy and proud of the team,” Shahidi mentioned. “The chase was very professional and I am very happy about it.” Shahidi and his males had surprised holders England and 1992 champions Pakistan earlier within the competitors and so they proved these have been no flukes with yet one more spectacular show in opposition to Sri Lanka. Put into bat, a number of Sri Lankan batters bought their eyes in however couldn’t fairly capitalise on these begins. After the autumn of Dimuth Karunaratne within the sixth over, Kusal Mendis (39) cast half-century partnerships with Pathum Nissanka (46) and Sadeera Samrawickrama (36) to regular the innings. At 134-2 within the twenty eighth over, Sri Lanka regarded effectively positioned to achieve the 275-mark however the plucky Afghans struck at common intervals to peg them again. Angelo Mathews and Maheesh Theekshana raised 45 fast runs for the eighth wicket however Sri Lanka nonetheless fell in need of the 250-mark. Afghan left-arm fast Fazalhaq Farooqi claimed 4-34, which fetched him player-of-the-match award. Afghanistan misplaced Rahmanullah Gurbaz within the first over however Rahmat Shah (62) and Ibrahim Zadran (39) calmed the nerves with a 73-run partnership. Kasun Rajitha dismissed Rahmat however not earlier than the batter had introduced up his second successive fifty of the event. Shahidi and Omarzai blended warning with occasional aggression of their unbroken century stand to take Afghanistan nearer to the goal. With victory in sight, each determined to play their pictures and Azmatullah scored the successful run when he tried to hit a six and was dropped at deep midwicket. “I think we were a little bit short of runs,” Sri Lanka captain Mendis mentioned after their fourth loss in six matches. “We needed 280 or 300 on this pitch. I think the bowlers did well in the first 10 overs but it was tough after that.” Reuters Magic Johnson declared a billionaire by Forbes","pubDate":"2023-10-30 18:07:40","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d0e4709abdd9a0dace9b2c7151b1ea3f","title":"अफगाणिस्तानने तीन विश्वचषक विजेत्यांची जिरवली, सेमी-फायनलच्या आशा ठेवल्या जिवंत","link":"https://marathi.abplive.com/photo-gallery/sports/cricket-afghanistan-defeated-sri-lanka-in-pune-3-wins-out-of-6-matches-for-afghanistan-in-this-world-cup-what-a-period-for-them-1224088","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"अफगाणिस्तानने तीन विश्वचषक विजेत्यांची जिरवली, सेमी-फायनलच्या आशा ठेवल्या जिवंत","content":"पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे. Maratha Reservation: मराठा आरक्षणासाठी राजीनामा द्या; खा. अमोल कोल्हे अन् आंदोलकातील फोन कॉल व्हायरल?","pubDate":"2023-10-30 17:53:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/3e4e2a63b8a6e9315950c1151e4128c51698687952614265_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"d4bcb1a3c23453705996ced965dc6857","title":"अफगाणिस्तानच्या विजयानंतर पाकिस्तान सातव्या स्थानी, श्रीलंकेच्या पराभवानंतर गुणतालिकेत फेरबदल","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-afghanistan-beat-sri-lanka-by-7-wickets-pune-1224083","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023 Points Table Update : पाकिस्तान, इंग्लंड आणि श्रीलंका या विश्वचषक विजेत्या संघाचा पराभव करत अफगाणिस्तान संघाने खळबळ माजवली आहे. अफगाणिस्तान संघाने तिसऱ्या विजयासह उपांत्य फेरीसाठीच्या आपल्या अशा जिवंत ठेवल्या. मात्र, दुसरीकडे श्रीलंकेसाठी आता उपांत्य फेरीची दारे बंद होऊ लागली आहेत. अफगाणिस्तान संघाने श्रीलंकेचा पराभव करत थेट पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने पाकिस्तानलाही मागे टाकलेय. श्रीलंका संघ आता सहाव्या स्थानी घसरलाय. भारतीय संघ गुणतालिकेत अव्वल स्थानावर कायम आहे.   टॉप 4 ची स्थिती काय ? पाकिस्तानविरुद्धच्या विजयानंतर दक्षिण आफ्रिकेनं टॉप-4 मध्ये बदल करत अव्वल स्थान गाठलं होतं. पण आज टीम इंडियाने पुन्हा एकदा अव्वल स्थान काबिज केलेय. टीम इंडिया 12 गुणांसह गुणतालिकेत पहिल्या क्रमांकावर आहे. दक्षिण आफ्रिका गुणतालिकेत दुसऱ्या क्रमांकावर आहे. आफ्रिकेने सहा सामन्यात पाच विजय मिळवले आहेत.  न्यूझीलंड तिसऱ्या क्रमांकावर आहे. मात्र, ऑस्ट्रेलिया चौथ्या स्थानावर आहे.  ऑस्ट्रेलिया आणि न्यूझीलंड यांचे समान गुण आहेत, पण न्यूझीलंड सरस रनरेटमुळे तिसऱ्या क्रमांकावर आहे.  इतर संघाची स्थिती काय ? श्रीलंकेचा पराभव करत अफगाणिस्तानने गुणतालिकेत पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने सहा सामन्यात तीन विजय मिळवलेत. सहा गुणांसह ते पाचव्या स्थानावर आहेत. पाचव्या क्रमांकावर असणारा श्रीलंका संघ सहाव्या स्थानी घसरलाय. श्रीलंका संघाचे सहा सामन्यात चार पराभव झालेत. सहाव्या क्रमांकवर असणारा पाकिस्तान आता सातव्या स्थानी घसरलाय. पाकिस्तान निगेटिव्ह -0.387 च्या नेट रनरेटसह 4 गुण मिळवत सातव्या,  नेदरलँडचा संघ चार गुणांसह आठव्या क्रमांकावर आहे. बांगलादेश निगेटिव्ह -1.338 च्या नेट रनरेटसह 2 गुण मिळवत नवव्या, इंग्लंड निगेटिव्ह -1.652 च्या खराब नेट रनरेटसह 2 गुण मिळवत दहाव्या क्रमांकावर आहे.  अफगाणिस्तानचे विश्वचषकातील आव्हान जिवंत -  आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.","content":"World Cup 2023 Points Table Update : पाकिस्तान, इंग्लंड आणि श्रीलंका या विश्वचषक विजेत्या संघाचा पराभव करत अफगाणिस्तान संघाने खळबळ माजवली आहे. अफगाणिस्तान संघाने तिसऱ्या विजयासह उपांत्य फेरीसाठीच्या आपल्या अशा जिवंत ठेवल्या. मात्र, दुसरीकडे श्रीलंकेसाठी आता उपांत्य फेरीची दारे बंद होऊ लागली आहेत. अफगाणिस्तान संघाने श्रीलंकेचा पराभव करत थेट पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने पाकिस्तानलाही मागे टाकलेय. श्रीलंका संघ आता सहाव्या स्थानी घसरलाय. भारतीय संघ गुणतालिकेत अव्वल स्थानावर कायम आहे. टॉप 4 ची स्थिती काय ? पाकिस्तानविरुद्धच्या विजयानंतर दक्षिण आफ्रिकेनं टॉप-4 मध्ये बदल करत अव्वल स्थान गाठलं होतं. पण आज टीम इंडियाने पुन्हा एकदा अव्वल स्थान काबिज केलेय. टीम इंडिया 12 गुणांसह गुणतालिकेत पहिल्या क्रमांकावर आहे. दक्षिण आफ्रिका गुणतालिकेत दुसऱ्या क्रमांकावर आहे. आफ्रिकेने सहा सामन्यात पाच विजय मिळवले आहेत. न्यूझीलंड तिसऱ्या क्रमांकावर आहे. मात्र, ऑस्ट्रेलिया चौथ्या स्थानावर आहे. ऑस्ट्रेलिया आणि न्यूझीलंड यांचे समान गुण आहेत, पण न्यूझीलंड सरस रनरेटमुळे तिसऱ्या क्रमांकावर आहे. इतर संघाची स्थिती काय ? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रीलंकेचा पराभव करत अफगाणिस्तानने गुणतालिकेत पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने सहा सामन्यात तीन विजय मिळवलेत. सहा गुणांसह ते पाचव्या स्थानावर आहेत. पाचव्या क्रमांकावर असणारा श्रीलंका संघ सहाव्या स्थानी घसरलाय. श्रीलंका संघाचे सहा सामन्यात चार पराभव झालेत. सहाव्या क्रमांकवर असणारा पाकिस्तान आता सातव्या स्थानी घसरलाय. पाकिस्तान निगेटिव्ह -0.387 च्या नेट रनरेटसह 4 गुण मिळवत सातव्या, नेदरलँडचा संघ चार गुणांसह आठव्या क्रमांकावर आहे. बांगलादेश निगेटिव्ह -1.338 च्या नेट रनरेटसह 2 गुण मिळवत नवव्या, इंग्लंड निगेटिव्ह -1.652 च्या खराब नेट रनरेटसह 2 गुण मिळवत दहाव्या क्रमांकावर आहे. अफगाणिस्तानचे विश्वचषकातील आव्हान जिवंत - आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.","pubDate":"2023-10-30 17:40:18","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/4055ea76622bdcce0b31f27ef5135c291698686327951252_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"a529ab644ece6e8c91df7a2972fb84f6","title":"Iwobi Keen To Make Big Impact At Fulham","link":"https://www.completesports.com/iwobi-keen-to-make-big-impact-at-fulham/","keywords":["Nigerian Footballers Abroad"],"creator":["Adeboye Amosu"],"video_url":null,"description":"Alex Iwobi is determined to become a key figure at Premier League club, Fulham. The Nigeria international ended his four-year stay at Everton in the summer, switching over to the Craven Cottage. The move saw Iwobi reunite with Marco Silva, the man who took him to Everton in 2019. The 27-year-old has now vowed to repay Silva's faith in him. “He’s the one that actually got me to Everton. I did speak with him, and he has a lot of faith in me. For a player to have that trust and confidence from the manager allows you to go and express yourself and play with freedom. I just need to repay the faith,\" Iwobi told the Standard. “I have to give credit to Fulham. They were very welcoming with me and I’m enjoying my time here. We just need to climb up the table and get results like we did today.” Read Also:Pakistan vs Bangladesh Cricket World Cup 31 Oct 2023: Odds, Prediction, Tips and Line Ups Iwobi played a key role in Fulham's 1-1 draw against Brighton & Hove Albion at the AMEX Stadium on Sunday. The versatile midfielder was deployed in a new central role and he expressed his desire to stick to the position. \"I do enjoy playing in the middle”, said Iwobi. “I feel like I get the ball a lot more. I like to influence the game as much as I can for the team. “It was an alright performance [from myself]. I feel I could have done a bit better, but the main thing is that we were able to get a point at a difficult stadium.” Iwobi joined Fulham for £22m on the final day of the summer transfer window. He has made six appearances for the London club. The post Iwobi Keen To Make Big Impact At Fulham appeared first on Complete Sports.","content":"Alex Iwobi is determined to become a key figure at Premier League club, Fulham. The Nigeria international ended his four-year stay at Everton in the summer, switching over to the Craven Cottage. The move saw Iwobi reunite with Marco Silva, the man who took him to Everton in 2019. The 27-year-old has now vowed to repay Silva’s faith in him. “He’s the one that actually got me to Everton. I did speak with him, and he has a lot of faith in me. For a player to have that trust and confidence from the manager allows you to go and express yourself and play with freedom. I just need to repay the faith,” Iwobi told the . “I have to give credit to Fulham. They were very welcoming with me and I’m enjoying my time here. We just need to climb up the table and get results like we did today.” Iwobi played a key role in Fulham’s 1-1 draw against Brighton & Hove Albion at the AMEX Stadium on Sunday. The versatile midfielder was deployed in a new central role and he expressed his desire to stick to the position. “I do enjoy playing in the middle”, said Iwobi.","pubDate":"2023-10-30 17:34:34","image_url":null,"source_id":"completesports","source_priority":44611,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e2b68e4329d3539deae76c743653458e","title":"ODI World Cup: Afghanistan slay yet another former world champions","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/30/odi-world-cup-afghanistan-slay-yet-another-former-world-champions-2628446.html","keywords":null,"creator":null,"video_url":null,"description":"After England and Pakistan, Shahidi and Co beat 1996 champs Sri Lanka by seven wickets. PUNE: The last time Afghanistan and Sri Lanka faced each other in the ODIs, it was an electrifying environment at the Gaddafi Stadium. The match went down the wire, as Sri Lanka came on top by just two runs in front of the neutral but passionate crowds in Lahore. The confusion about the Net Run Rate that prevented Afghanistan from making it to the Super Four was the talk of the town and the dejected faces of the Afghan players told the heartbreaking story. Exactly a month from that day, a new challenge was waiting for both teams in India as the 2023 World Cup began in Ahmedabad. A lot has changed since then, Afghanistan before their fixture against Sri Lanka in Pune had four points on the board, an unbelievable result for a team that could not win a single match in the previous edition. Their Team Mentor and former India International Ajay Jadeja believes it is no secret how talented this group of players really is. \"I don’t have to make them believe that they are equals. They believe in themselves. The IPL auction tells them how good they are,\" Jadeja told reporters in Delhi ahead of Afghanistan's match against hosts India. Even after defeats against the likes of Bangladesh, India, and New Zealand, Afghanistan never lost their spirit. Well aware of their strengths, match by match they improved the batting to provide cushion to their bowling might. \"They are all grown up and living up to the expectations in the World Cup,\" Lalchand Rajput, Afghanistan's former head coach told this daily. \"Their spin department is the best in the world. The medium-pacers have improved and they are good now. The only thing they have to do now is to get a good score. That should click. If they get 270-290 on a little bit of a helpful wicket, I think they will make life miserable for others in the tournament,\" he mentioned. That is exactly what the Afghan unit did after their loss to Bangladesh in the tournament opener, courtesy of a batting collapse. Even when it didn't come together against the mighty Indian batting, where Rohit Sharma smashed a record-breaking ton, the batting unit learned lessons from the defeat as Hashmatullah Shahidi and Azmatullah Omarzai added 128 runs for the fourth wicket against Sri Lanka. It was ticking, but not at one time. \"I used to tell them this all the time that they need to get that consistency right because they would be hot one day and cold the other. But now things are changing. They can upset anybody, they need to have that consistency. Over the period of time, they have been improving by playing many matches. And I am sure that maturity has come which means they can be a dangerous side,\" Rajput predicted it all as Afghanistan got ready to face Pakistan in Chennai. At Chepauk, even after their spinners made life hard for Pakistan in the middle, Afghanistan had to chase down 282 runs. But the simplified Afghan Approach, written on the whiteboard, made sure they chased it down. \"I said, we're not going to be able to win this game in 35-40 overs. We're going to have to bat well for 50 overs. And we broke it down to 10-over splits. And the start that (Rahmanullah) Gurbaz and Ibrahim (Zadran) gave us. It made sure that we had the opportunity to finish the game off in the 49th over and we did so that was great,\" Jonathan Trott the current head coach mentioned in the post-match media interaction. With that win against Pakistan, the Afghans added another feather to their cap as they surpassed their previous best in the WCs. With the Sri Lanka challenge waiting in Pune, the question remained the same. Can they keep that consistency? Like Rajput mentioned the spin attack and the developing pace unit, didn't let Sri Lanka settle in the innings and bowled them out for 241. Now came the part where Afghanistan had the opportunity to prove that they have been improving day-by-day in the format. Rajput had a message for the Afghan batters. \"I always believe that the game sense is very important, whether you want to build a partnership and then go hard or just have to go hard from the start. So I think you should have that game sense. Based on what the team requires at that time, you have to build a partnership. You can play the favourite shots after one is well set or after getting a partnership, but you can't lose wickets in a cluster that puts pressure on the team. Adaptability in these situations is of utmost importance along with game sense,\" and the Afghan top order followed it to the last word. After Gurbaz, or the entertainer as Rajput calls him, fell early, Zadran and Rehmat Shah kept the innings going even when they could not hit a boundary for almost 10 overs. The 'Game Sense' and patience prevailed. Half-tons from Shah, captain Hashmatullah Shahidi, and Azmatullah Omarzai took the venom out of the already depleted Sri Lanka attack that could not hold to their chances as Afghanistan registered their third victory of the tournament. After beating Pakistan, Afghanistan thanked the crowd with the victory lap around the Chepauk, at theMCA Stadium in Pune, they again thanked the crowd with another lap. And it looks like they are not getting tired of it at all. And why would they? After all the giant killers have beaten the three former WC winners in the span of just two weeks. \"They have not been playing for even 20 years. Other teams have a history of 100 years,\" is how Jadeja described where this team stands in the history of the game. And at this rate, more marvelous results are waiting for them.","content":"PUNE: The last time Afghanistan and Sri Lanka faced each other in the ODIs, it was an electrifying environment at the Gaddafi Stadium. The match went down the wire, as Sri Lanka came on top by just two runs in front of the neutral but passionate crowds in Lahore. The confusion about the Net Run Rate that prevented Afghanistan from making it to the Super Four was the talk of the town and the dejected faces of the Afghan players told the heartbreaking story. Exactly a month from that day, a new challenge was waiting for both teams in India as the 2023 World Cup began in Ahmedabad. A lot has changed since then, Afghanistan before their fixture against Sri Lanka in Pune had four points on the board, an unbelievable result for a team that could not win a single match in the previous edition. Their Team Mentor and former India International Ajay Jadeja believes it is no secret how talented this group of players really is. \"I don’t have to make them believe that they are equals. They believe in themselves. The IPL auction tells them how good they are,\" Jadeja told reporters in Delhi ahead of Afghanistan's match against hosts India. Even after defeats against the likes of Bangladesh, India, and New Zealand, Afghanistan never lost their spirit. Well aware of their strengths, match by match they improved the batting to provide cushion to their bowling might. \"They are all grown up and living up to the expectations in the World Cup,\" Lalchand Rajput, Afghanistan's former head coach told this daily. \"Their spin department is the best in the world. The medium-pacers have improved and they are good now. The only thing they have to do now is to get a good score. That should click. If they get 270-290 on a little bit of a helpful wicket, I think they will make life miserable for others in the tournament,\" he mentioned. That is exactly what the Afghan unit did after their loss to Bangladesh in the tournament opener, courtesy of a batting collapse. Even when it didn't come together against the mighty Indian batting, where Rohit Sharma smashed a record-breaking ton, the batting unit learned lessons from the defeat as Hashmatullah Shahidi and Azmatullah Omarzai added 128 runs for the fourth wicket against Sri Lanka. It was ticking, but not at one time. \"I used to tell them this all the time that they need to get that consistency right because they would be hot one day and cold the other. But now things are changing. They can upset anybody, they need to have that consistency. Over the period of time, they have been improving by playing many matches. And I am sure that maturity has come which means they can be a dangerous side,\" Rajput predicted it all as Afghanistan got ready to face Pakistan in Chennai. At Chepauk, even after their spinners made life hard for Pakistan in the middle, Afghanistan had to chase down 282 runs. But the simplified Afghan Approach, written on the whiteboard, made sure they chased it down. \"I said, we're not going to be able to win this game in 35-40 overs. We're going to have to bat well for 50 overs. And we broke it down to 10-over splits. And the start that (Rahmanullah) Gurbaz and Ibrahim (Zadran) gave us. It made sure that we had the opportunity to finish the game off in the 49th over and we did so that was great,\" Jonathan Trott the current head coach mentioned in the post-match media interaction. With that win against Pakistan, the Afghans added another feather to their cap as they surpassed their previous best in the WCs. With the Sri Lanka challenge waiting in Pune, the question remained the same. Can they keep that consistency? Like Rajput mentioned the spin attack and the developing pace unit, didn't let Sri Lanka settle in the innings and bowled them out for 241. Now came the part where Afghanistan had the opportunity to prove that they have been improving day-by-day in the format. Rajput had a message for the Afghan batters. \"I always believe that the game sense is very important, whether you want to build a partnership and then go hard or just have to go hard from the start. So I think you should have that game sense. Based on what the team requires at that time, you have to build a partnership. You can play the favourite shots after one is well set or after getting a partnership, but you can't lose wickets in a cluster that puts pressure on the team. Adaptability in these situations is of utmost importance along with game sense,\" and the Afghan top order followed it to the last word. After Gurbaz, or the entertainer as Rajput calls him, fell early, Zadran and Rehmat Shah kept the innings going even when they could not hit a boundary for almost 10 overs. The 'Game Sense' and patience prevailed. Half-tons from Shah, captain Hashmatullah Shahidi, and Azmatullah Omarzai took the venom out of the already depleted Sri Lanka attack that could not hold to their chances as Afghanistan registered their third victory of the tournament. After beating Pakistan, Afghanistan thanked the crowd with the victory lap around the Chepauk, at theMCA Stadium in Pune, they again thanked the crowd with another lap. And it looks like they are not getting tired of it at all. And why would they? After all the giant killers have beaten the three former WC winners in the span of just two weeks. \"They have not been playing for even 20 years. Other teams have a history of 100 years,\" is how Jadeja described where this team stands in the history of the game. And at this rate, more marvelous results are waiting for them.","pubDate":"2023-10-30 17:26:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f2c35eae0c3f26bb6557fc908190fd04","title":"World Cup 2023 : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका... अफगाणिस्तानचा विश्वचषकातील तिसरा विजय","link":"https://marathi.abplive.com/sports/cricket/afghanistan-beat-sri-lanka-by-8-wickets-hashmatullah-shahidi-azmatullah-omarzai-afg-vs-sl-full-match-highlights-world-cup-2023-1224080","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"Afghanistan vs Sri Lanka Full Match Highlights : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.  श्रीलंकेने प्रथम फलंदाजी करताना 241 धावांपर्यंत मजल मारली होती. अफगाणिस्तान संघाने हे आव्हान 45.2 षटकात अवघ्या तीन विकेटच्या मोबदल्यात पार केले. अफगानिस्तानसाठी रहमत शाह याने 62 धावा केल्या. तर कर्णधार हशमतुल्लाह शाहिदी याने 74 चेंडूत दोन चौकार आणि एका षटकाराच्या मदतीने नाबाद 58 धावा जोडल्या. अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये सहा चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा चोपल्या. या दोघांनी मॅच विनिंग 111 धावांची भागिदारी केली.  श्रीलंकेने दिलेल्या 242 धावांच्या आव्हानाचा पाठलाग करताना अफगाणिस्तानची सुरुवात अतिशय खराब झाली. स्टार फलंदाज रहमानुल्लाह गुरबाज पहिल्याच षटकात खातेही न उघडता बाद झाला. पण त्यानंतर अफगाणिस्तानच्या इतर फलंदाजांनी विजयी खेळी केली. रहमत शाह आणि इब्राहिम जादरान यांनी दुसऱ्या विकेटसाठी 73 धावांचे योगदान दिलेय. दोघेही सहज धावा काढत होते, एकेरी दुहेरी धावसंख्येसोबत चौकार आणि षटकारांचा पाऊस पाडत होते. इब्राहिम जादरान याने 57 चेंडूत चार चौकार आणि एका षटकाराच्या मदतीने 39 धावा काढून बाद झाला. त्यानंतर रहमत शाह आणि कर्णधार हशमतुल्लाह शाहिदी यांनीही डाव सावरला.  रहमत शाह याने 74 चेंडूमध्ये चार चौकार आणि एका षटकाराच्या मदतीने 62 धावा केल्या. तीन विकेट गेल्यानंतर कर्णधार शाहिदीने अष्टपैलू अजमतुल्लाह ओमरजई याच्यासोबत विजयी 111 धावांची भागिदारी केली.  हशमतुल्लाह शाहिदी याने 74 चेंडूमध्ये दोन चौकार आणि एका षटकाराच्या मदतीने 58 धावा केल्या. तर अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये 6 चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा केल्या.  दरम्यान, श्रीलंकाकडून दिलशान मदुशंका याने सुरुवातीलाच दोन विकेट घेतल्या. त्याशिवाय कसून रजिता याने एक विकेट घेतली. इतर एकाही गोलंदाजाला यश मिळाले नाही.   ","content":"Afghanistan vs Sri Lanka Full Match Highlights : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे. श्रीलंकेने प्रथम फलंदाजी करताना 241 धावांपर्यंत मजल मारली होती. अफगाणिस्तान संघाने हे आव्हान 45.2 षटकात अवघ्या तीन विकेटच्या मोबदल्यात पार केले. अफगानिस्तानसाठी रहमत शाह याने 62 धावा केल्या. तर कर्णधार हशमतुल्लाह शाहिदी याने 74 चेंडूत दोन चौकार आणि एका षटकाराच्या मदतीने नाबाद 58 धावा जोडल्या. अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये सहा चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा चोपल्या. या दोघांनी मॅच विनिंग 111 धावांची भागिदारी केली. श्रीलंकेने दिलेल्या 242 धावांच्या आव्हानाचा पाठलाग करताना अफगाणिस्तानची सुरुवात अतिशय खराब झाली. स्टार फलंदाज रहमानुल्लाह गुरबाज पहिल्याच षटकात खातेही न उघडता बाद झाला. पण त्यानंतर अफगाणिस्तानच्या इतर फलंदाजांनी विजयी खेळी केली. रहमत शाह आणि इब्राहिम जादरान यांनी दुसऱ्या विकेटसाठी 73 धावांचे योगदान दिलेय. दोघेही सहज धावा काढत होते, एकेरी दुहेरी धावसंख्येसोबत चौकार आणि षटकारांचा पाऊस पाडत होते. इब्राहिम जादरान याने 57 चेंडूत चार चौकार आणि एका षटकाराच्या मदतीने 39 धावा काढून बाद झाला. त्यानंतर रहमत शाह आणि कर्णधार हशमतुल्लाह शाहिदी यांनीही डाव सावरला. रहमत शाह याने 74 चेंडूमध्ये चार चौकार आणि एका षटकाराच्या मदतीने 62 धावा केल्या. तीन विकेट गेल्यानंतर कर्णधार शाहिदीने अष्टपैलू अजमतुल्लाह ओमरजई याच्यासोबत विजयी 111 धावांची भागिदारी केली. हशमतुल्लाह शाहिदी याने 74 चेंडूमध्ये दोन चौकार आणि एका षटकाराच्या मदतीने 58 धावा केल्या. तर अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये 6 चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा केल्या. दरम्यान, श्रीलंकाकडून दिलशान मदुशंका याने सुरुवातीलाच दोन विकेट घेतल्या. त्याशिवाय कसून रजिता याने एक विकेट घेतली. इतर एकाही गोलंदाजाला यश मिळाले नाही. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });","pubDate":"2023-10-30 17:20:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/a4ed6556df6bd74d8b2218e11bfcc0c81698685324529582_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0539c23a4e9b75ae84b60f7d5267dda5","title":"WC 2023: शरणार्थी कैंप से 100वां मैच खेलने तक का सफर, मिलिए अफ़ग़ानिस्तान के सबसे कामयाब गेंदबाज राशिद खान से","link":"https://sports.ndtv.com/hindi/cricket/rashid-khan-journey-from-refugee-camp-to-playing-100th-match-afghanistan-most-successful-bowler-4529322#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Rashid Khan: एकदिवसीय मैचों में राशिद खान अफ़ग़ानिस्तान के लिए सबसे ज्यादा 100 मैचों में 179 विकेट लिए हैं. एक मैच में चार बार पांच विकेट और छह बार चार विकेट लिए हैं. सबसे तेज सौवाँ विकेट लेने के मामले में राशिद खान दूसरे स्थान पर हैं.","content":"Rashid Khan 2001 की बात है. अफ़ग़ानिस्तान से एक पति पत्नी अपने 11 बच्चों के साथ पाकिस्तान की ओर निकल पड़ा. उस समय अफ़ग़ानिस्तान में तालिबान और अमेरिका में लड़ाई चल रही थी. वहां रहना आसान नहीं था. इस परिवार को पाकिस्तान के एक शरणार्थी कैंप में शरण मिली. किसी ने शायद सोचा नहीं होगा कि शरणार्थी कैंप में पला-बढ़ा एक बच्चा एक दिन अफ़ग़ानिस्तान क्रिकेट को एक नयी उंचाई तक पहुंचाएगा. उसकी गिनती अफ़ग़ानिस्तान के बेहतरीन खिलाडियों में होगी और अन्तरराष्ट्रीय एकदिवसीय मैच खेलन में भी शतक बनाएगा. उसने अफ़ग़ानिस्तान के लिए एकदिवसीय मैचों में सबसे ज्यादा विकेट हासिल करने का रिकॉर्ड बनाया है. उसका नाम है राशिद खान है. आज वो अफ़ग़ानियों का सबसे चहेता खिलाड़ी है. आज वो अपने करियर का सौवें एकदिवसीय मैच खेल रहा है. अफ़ग़ानिस्तान जैसी छोटी टीम के लिए ये काफी बड़ी बात है. 20 सितम्बर 1998 को राशिद खान का जन्म अफ़ग़ानिस्तान के नंगरहार में हुआ. उस समय अफ़ग़ानिस्तान में तालिबान का शासन था. 2001 में अमेरिका ने तालिबान पर हमला किया. लोग अपनी जान बचाने के लिए भागने लगे. राशिद खान के पिता अपने 11 बच्चों के साथ पाकिस्तान के तरफ निकल पड़े और वहां एक शरणार्थी कैंप में रहें. राशिद खान तब तीन साल के थे. राशिद खान पेशावर के गलिओं में क्रिकेट खेलने लगे. उन्हें ट्रेनिंग देने के लिए कोई नहीं था. इस टैलेंट को पहचाने के लिए कोई नहीं था. राशिद खान अपने घर में अपने भाईओं के साथ क्रिकेट खेलते थे. घरवाले चाहते थे कि राशिद खान डॉक्टर बने. राशिद पढ़ाई में अच्छे थे. एक बार राशिद खान अपने परिवार को ना बताते हुए अपने दोस्त के साथ क्रिकेट मैच खेलने चले गए और बल्लेबाजी करते हुए उस मैच में 65 रन बना लिए. पहली बार राशिद खान हार्ड बॉल में क्रिकेट खेले. घर में टेप बॉल में खेलते थे. राशिद खान के अंदर आत्मविश्वास आने लगा. उन्हें लगा कि वे एक अच्छा क्रिकेटर बन सकते हैं. क्रिकेट के प्रति उनका प्यार बढ़ते गया. धीरे धीरे राशिद खान अपने दोस्तों के साथ क्रिकेट खेलने लगे फिर घरेलु टीम में खेले. एक बार राशिद खान लाहौर में पाकिस्तान अंडर 19 खिलाफ मैच खेल रहे थे. इस मैच का सीधा प्रसारण टीवी में हो रहा था. राशिद खान के परिवार लोग इस मैच को देख रहे थे. राशिद खान ने इस मैच में 60 रन बनाये. परिवार लोग खुश हो गए और उन्हें लगने लगा कि राशिद खान एक अच्छा खिलाड़ी बन सकते हैं फिर राशिद खान को क्रिकेट खेलने के लिए परमिशन दे दिए. राशिद खान अनिल कुंबले और शाहिद अफरीदी को अपना आइडल मानते हैं. दोनों की गेंदबाजी को देखते हुए अपने गेंदबाजी में सुधार लाये और एक अच्छा गेंदबाज बन गए. राशिद खान को सचिन तेंदुलकर की बल्लेबाजी पसंद है. 2015 में राशिद खान की चयन अफ़ग़ानिस्तान टीम में हुई. 18 अक्टूबर 2015 को राशिद खान अपने का करियर पहला एकदिवसीय मैच ज़िम्बाब्वे के खिलाफ खेला. इस मैच में राशिद ने 8 रन बनाए थे और एक विकेट लिए थे. एकदिवसीय मैचों में राशिद खान अफ़ग़ानिस्तान के लिए सबसे ज्यादा 100 मैचों में 179 विकेट लिए हैं. एक मैच में चार बार पांच विकेट और छह बार चार विकेट लिए हैं. सबसे तेज सौवाँ विकेट लेने के मामले में राशिद खान दूसरे स्थान पर हैं. राशिद खान अपना 44 वां मैच में अपना सौवां विकेट हासिल किये थे. इस मामले में नेपाल के संदीप लामिछाने पहले स्थान पर हैं जो अपने 42वां मैच में सौवाँ विकेट लिए थे. 2017 में सनराइजर्स हैदराबाद ने राशिद खान को 4 करोड़ 30 लाख में खरीदा. इस सीजन में राशिद खान ने हैदराबाद के लिए 17 विकेट लिए थे. 2018 में सनराइजर्स हैदराबाद ने राशिद खान को 9 करोड़ में खरीदा था. 2017 के आईपीएल में शानदार प्रदर्शन के बाद CPL में गयाना अमेजन वॉरियर्स के लिए खेलना शुरू किए और अपने करियर का पहला हैट्रिक लेने में कामयाब हुए. 2018 में एडिलेड स्ट्राइकर्स से जुड़े. इस तरह राशिद खान अलग अलग देशों की फ्रैंचाइजी के साथ जुड़ते गए. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-30 16:48:46","image_url":"https://c.ndtvimg.com/2021-10/p5m0fcv_afghanistan-team-afp_625x300_31_October_21.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"f2ceaf8bc9236f377d4fa8d250fae9d8","title":"Iconic Sri Lankan cricket team supporter ‘Uncle’ Percy Abeysekera passes away","link":"https://www.tribuneindia.com/news/sports/iconic-sri-lankan-cricket-team-supporter-uncle-percy-abeysekera-passes-away-557916","keywords":null,"creator":null,"video_url":null,"description":"Colombo, October 30Percy Abeysekera, the iconic flag-waving, quick-witted supporter of the Sri Lankan cricket team, passed away after a battle with prolonged illness here on Monday.The 87-year-old Abeysekera, who was fondly called as Uncle Percy by fans and cricketers alike, was a constant presence on cricket grounds across the world where his country played.Abeysekera, known for his colourful dressing, began his travels to cheer for the Lankan cricket team from the 1979 World Cup and since then he attended all major cricketing events except the on-going World Cup owing to poor health.His friendship with leading Lankan cricketers like Arjuna Ranatunga, Sanath Jayasuriya and Kumar Sangakkara made him an unavoidable figure in the country's cricketing landscape.Abeysekera also shared cordial relationship with Indian cricketers like MS Dhoni, Virat Kohli and Rohit Sharma. Rohit had visited Abeysekera at his home in Colombo during the recent Asia Cup.Kohli had invited Abeysekera to the Indian dressing room for a short interaction during the tour to Sri Lanka in 2015.However, Abeysekera's health was not at its best over the last year and the Sri Lanka Cricket had recently given him LKR 5 million to meet his medical expenses.","content":"PTI Colombo, October 30 Percy Abeysekera, the iconic flag-waving, quick-witted supporter of the Sri Lankan cricket team, passed away after a battle with prolonged illness here on Monday. The 87-year-old Abeysekera, who was fondly called as Uncle Percy by fans and cricketers alike, was a constant presence on cricket grounds across the world where his country played. Abeysekera, known for his colourful dressing, began his travels to cheer for the Lankan cricket team from the 1979 World Cup and since then he attended all major cricketing events except the on-going World Cup owing to poor health. His friendship with leading Lankan cricketers like Arjuna Ranatunga, Sanath Jayasuriya and Kumar Sangakkara made him an unavoidable figure in the country’s cricketing landscape. Abeysekera also shared cordial relationship with Indian cricketers like MS Dhoni, Virat Kohli and Rohit Sharma. Rohit had visited Abeysekera at his home in Colombo during the recent Asia Cup. Kohli had invited Abeysekera to the Indian dressing room for a short interaction during the tour to Sri Lanka in 2015. However, Abeysekera’s health was not at its best over the last year and the Sri Lanka Cricket had recently given him LKR 5 million to meet his medical expenses. #Cricket","pubDate":"2023-10-30 16:40:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/10/2023_10$largeimg_1435764438.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ec055f4a1b82c29d3cdd465cd3bed5e0","title":"AFG Vs SL: વર્લ્ડકપ 2023માં અફઘાનિસ્તાનની ત્રીજી જીત, શ્રીલંકાને 7 વિકેટથી આપી હાર","link":"https://gujarati.abplive.com/sports/cricket/odi-world-cup-2023-afghanistan-won-by-7-wickets-against-sri-lanka-match-highlights-mca-stadium-863448","keywords":["ક્રિકેટ"],"creator":["એબીપી અસ્મિતા વેબ ટીમ"],"video_url":null,"description":"ICC ODI World Cup 2023 Afghanistan vs Sri Lanka 2023 Highlights:  ODI વર્લ્ડ કપ 2023ની 30મી મેચમાં અફઘાનિસ્તાને શ્રીલંકાને હરાવ્યું છે. પૂણેના મહારાષ્ટ્ર ક્રિકેટ એસોસિએશન સ્ટેડિયમ ખાતે પ્રથમ બેટિંગ કરતા શ્રીલંકાએ 241 રન બનાવ્યા હતા અને અફઘાનિસ્તાને ત્રણ વિકેટ ગુમાવીને લક્ષ્ય હાંસલ કરી લીધો હતો. હાર સાથે શ્રીલંકા માટે આગળનો રસ્તો મુશ્કેલ બની ગયો છે. ઈંગ્લેન્ડ અને પાકિસ્તાન બાદ અફઘાનિસ્તાને પણ શ્રીલંકાને હરાવ્યું છે. જીત સાથે અફઘાનિસ્તાન પોઇન્ટ ટેબલમાં પાંચમાં ક્રમે આવી ગયું છે.","content":"ICC ODI World Cup 2023 Afghanistan vs Sri Lanka 2023 Highlights: ODI વર્લ્ડ કપ 2023ની 30મી મેચમાં અફઘાનિસ્તાને શ્રીલંકાને હરાવ્યું છે. પૂણેના મહારાષ્ટ્ર ક્રિકેટ એસોસિએશન સ્ટેડિયમ ખાતે પ્રથમ બેટિંગ કરતા શ્રીલંકાએ 241 રન બનાવ્યા હતા અને અફઘાનિસ્તાને ત્રણ વિકેટ ગુમાવીને લક્ષ્ય હાંસલ કરી લીધો હતો. હાર સાથે શ્રીલંકા માટે આગળનો રસ્તો મુશ્કેલ બની ગયો છે. ઈંગ્લેન્ડ અને પાકિસ્તાન બાદ અફઘાનિસ્તાને પણ શ્રીલંકાને હરાવ્યું છે. જીત સાથે અફઘાનિસ્તાન પોઇન્ટ ટેબલમાં પાંચમાં ક્રમે આવી ગયું છે. શ્રીલંકાએ પ્રથમ બેટિંગ કરતા 49.3 ઓવરમાં 241 રન બનાવી ઓલઆઉટ થયું હતું. નિસાંકાએ સૌથી વધુ 46 રન બનાવ્યા હતા. કુસલ મેંડિસે 39, સમરવિક્રામાએ 36, મહેશ તીક્ષ્ણાએ 29 રનનું યોગદાન આપ્યું હતું. અફઘાનિસ્તાન તરફથી ફારૂકીએ 34 રનમાં 4 વિકેટ, મુજીબે 38 રનમાં 2 વિકેટ, રાશિદ ખાને 50 રનમાં 1 વિકેટ ઝડપી હતી. અફઘાનિસ્તાને 242 રનના ટાર્ગેટને 45.2 ઓવરમાં 3 વિકેટ ગુમાવી પાર પાડ્યો હતો. ગુરબાઝ ખાતું ખોલાવી શક્યો નહોતો. ઝરદાને 39 અને રહમત શાહે 62 રન બનાવ્યા હતા. શાહીદી 58 રન અને ઓમરઝઇ 73 રન બનાવી નોટ આઉટ રહ્યા હતા. Afghanistan continue their charge towards a top-four finish in #CWC23 with a stupendous win in Pune 👊 #AFGvSL 📝: https://t.co/f6KGeAIahL pic.twitter.com/cCmw8unwDy — ICC (@ICC) October 30, 2023 વન ડે વર્લ્ડ કપમાં અફઘાનિસ્તાની જીત googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); સ્કોટલેન્ડને 1 વિકેટથી હરાવ્યું, ડ્યુનેડિન, 2015 ઇંગ્લેન્ડને 69 રનથી હરાવ્યું, દિલ્હી, 2023 પાકિસ્તાનને 8 વિકેટે હરાવ્યું, ચેન્નાઈ, 2023 શ્રીલંકાને 7 વિકેટે હરાવ્યું, પુણે, 2023 વન ડે વર્લ્ડ કપમાં અફઘાનિસ્તાન વિ શ્રીલંકા 2015 - શ્રીલંકા 4 વિકેટે જીત્યું 2019 - શ્રીલંકા 34 રને જીત્યું 2023 - અફઘાનિસ્તાન 7 વિકેટે જીત્યું વિશ્વ કપમાં સૌથી વધુ મેચો હારનારી ટીમ અફઘાનિસ્તાન સામે હાર સાથે જ શ્રીલંકાના નામે એક શરમજનક રેકોર્ડ પણ નોંધાયો છે. શ્રીલંકા વન ડે વર્લ્ડકપમાં સૌથી વધુ મેચ હારનારી ટીમ બની ગઈ છે. 43 - શ્રીલંકા 42 - ઝિમ્બાબ્વે 37 - ઈંગ્લેન્ડ 36 - પાકિસ્તાન 35 - ન્યુઝીલેન્ડ 35 - વેસ્ટ ઈન્ડિઝ વર્લ્ડ કપમાં અફઘાનિસ્તાન માટે સૌથી મોટી ભાગીદારી (કોઈપણ વિકેટ) 133 - ઇકરામ અલીખિલ અને રહેમત શાહ વિ. WI, લીડ્ઝ, 2019 (2જી) 130 - ઈબ્રાહિમ ઝદરાન અને આર ગુરબાઝ વિરુદ્ધ PAK, ચેન્નાઈ, 2023 (1 લી) 121 - અઝમતુલ્લા ઓમરઝાઈ અને એચ શાહિદી વિ IND, દિલ્હી, 2023 (4થી) 114 - ઈબ્રાહિમ ઝદરાન અને રહેમાનુલ્લા ગુરબાઝ વિરુદ્ધ ENG, દિલ્હી, 2023 (1 લી) 111* - અઝમતુલ્લા ઓમરઝાઈ અને એચ શાહિદી વિ SL, પુણે, 2023 (4થી) 𝐖𝐡𝐚𝐭 𝐚 𝐖𝐢𝐧! 🙌 #AfghanAtalan , banking on an incredible all-round performance, beat @OfficialSLC by 7 wickets to register their third victory at the ICC Men's Cricket World Cup 2023. 👏 Congratulations to the whole Afghan Nation! 😍 #CWC23 | #AFGvSL | #WarzaMaidanGata pic.twitter.com/KEMcySenBd — Afghanistan Cricket Board (@ACBofficials) October 30, 2023","pubDate":"2023-10-30 16:36:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/e1237396bb08c37765d65b96af3969ba169868378652476_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"9433d8c1614c806b63b19bf21d9a8594","title":"AFG vs SL: Afghanistan spark semi-final hopes after 7-wicket win in Pune","link":"https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-sri-lanka-score-pune-azmat-hashmat-fazalhaq-points-table-semifinal-hopes-2455813-2023-10-30?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"AFG vs SL: Afghanistan spark semi-final hopes after 7-wicket win in Pune","content":null,"pubDate":"2023-10-30 16:29:58","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"66cd7926c6a16b92a2fca0217156d109","title":"Afghanistan upset Sri Lanka to proceed memorable Cricket World Cup marketing campaign","link":"https://www.businesslend.com/sports/afghanistan-upset-sri-lanka-to-continue-memorable-cricket-world-cup-campaign/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on every little thing from biking to boxing Sign as much as our free sport electronic mail for all the most recent information A spirited Afghanistan upset one other former champion on Monday when Hashmatullah Shahidi’s males defeated 1996 winners Sri [...] The post Afghanistan upset Sri Lanka to proceed memorable Cricket World Cup marketing campaign appeared first on BusinessLend.","content":"A spirited Afghanistan upset one other former champion on Monday when Hashmatullah Shahidi’s males defeated 1996 winners Sri Lanka by seven wickets to proceed their memorable marketing campaign on the 50-overs Cricket World Cup. Their bowlers had laid the inspiration of their third win in six matches after they bowled out Sri Lanka for a below-par 241 in 49.3 overs. Three of their prime 5 batters, together with Shahidi, then produced half-centuries in a scientific chase which they completed in 45.2 overs to maneuver to the fifth place within the factors desk. Azmatullah Omarzai (73) scored the successful run with Shahidi (58) trying on from the opposite finish. Afghanistan, who registered one win within the 2015 World Cup and none in 2019, now have an outright probability of constructing the final 4 in India. “Quite happy and proud of the team,” Shahidi mentioned. “The chase was very professional and I am very happy about it.” Shahidi and his males had surprised holders England and 1992 champions Pakistan earlier within the competitors and so they proved these have been no flukes with yet one more spectacular show in opposition to Sri Lanka. Put into bat, a number of Sri Lankan batters bought their eyes in however couldn’t fairly capitalise on these begins. After the autumn of Dimuth Karunaratne within the sixth over, Kusal Mendis (39) cast half-century partnerships with Pathum Nissanka (46) and Sadeera Samrawickrama (36) to regular the innings. At 134-2 within the twenty eighth over, Sri Lanka regarded effectively positioned to achieve the 275-mark however the plucky Afghans struck at common intervals to peg them again. Angelo Mathews and Maheesh Theekshana raised 45 fast runs for the eighth wicket however Sri Lanka nonetheless fell in need of the 250-mark. Afghan left-arm fast Fazalhaq Farooqi claimed 4-34, which fetched him player-of-the-match award. Afghanistan misplaced Rahmanullah Gurbaz within the first over however Rahmat Shah (62) and Ibrahim Zadran (39) calmed the nerves with a 73-run partnership. Kasun Rajitha dismissed Rahmat however not earlier than the batter had introduced up his second successive fifty of the event. Shahidi and Omarzai blended warning with occasional aggression of their unbroken century stand to take Afghanistan nearer to the goal. With victory in sight, each determined to play their pictures and Azmatullah scored the successful run when he tried to hit a six and was dropped at deep midwicket. “I think we were a little bit short of runs,” Sri Lanka captain Mendis mentioned after their fourth loss in six matches. “We needed 280 or 300 on this pitch. I think the bowlers did well in the first 10 overs but it was tough after that.” Reuters Magic Johnson declared a billionaire by Forbes","pubDate":"2023-10-30 18:07:40","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d0e4709abdd9a0dace9b2c7151b1ea3f","title":"अफगाणिस्तानने तीन विश्वचषक विजेत्यांची जिरवली, सेमी-फायनलच्या आशा ठेवल्या जिवंत","link":"https://marathi.abplive.com/photo-gallery/sports/cricket-afghanistan-defeated-sri-lanka-in-pune-3-wins-out-of-6-matches-for-afghanistan-in-this-world-cup-what-a-period-for-them-1224088","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"अफगाणिस्तानने तीन विश्वचषक विजेत्यांची जिरवली, सेमी-फायनलच्या आशा ठेवल्या जिवंत","content":"पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे. Maratha Reservation: मराठा आरक्षणासाठी राजीनामा द्या; खा. अमोल कोल्हे अन् आंदोलकातील फोन कॉल व्हायरल?","pubDate":"2023-10-30 17:53:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/3e4e2a63b8a6e9315950c1151e4128c51698687952614265_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"d4bcb1a3c23453705996ced965dc6857","title":"अफगाणिस्तानच्या विजयानंतर पाकिस्तान सातव्या स्थानी, श्रीलंकेच्या पराभवानंतर गुणतालिकेत फेरबदल","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-afghanistan-beat-sri-lanka-by-7-wickets-pune-1224083","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023 Points Table Update : पाकिस्तान, इंग्लंड आणि श्रीलंका या विश्वचषक विजेत्या संघाचा पराभव करत अफगाणिस्तान संघाने खळबळ माजवली आहे. अफगाणिस्तान संघाने तिसऱ्या विजयासह उपांत्य फेरीसाठीच्या आपल्या अशा जिवंत ठेवल्या. मात्र, दुसरीकडे श्रीलंकेसाठी आता उपांत्य फेरीची दारे बंद होऊ लागली आहेत. अफगाणिस्तान संघाने श्रीलंकेचा पराभव करत थेट पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने पाकिस्तानलाही मागे टाकलेय. श्रीलंका संघ आता सहाव्या स्थानी घसरलाय. भारतीय संघ गुणतालिकेत अव्वल स्थानावर कायम आहे.   टॉप 4 ची स्थिती काय ? पाकिस्तानविरुद्धच्या विजयानंतर दक्षिण आफ्रिकेनं टॉप-4 मध्ये बदल करत अव्वल स्थान गाठलं होतं. पण आज टीम इंडियाने पुन्हा एकदा अव्वल स्थान काबिज केलेय. टीम इंडिया 12 गुणांसह गुणतालिकेत पहिल्या क्रमांकावर आहे. दक्षिण आफ्रिका गुणतालिकेत दुसऱ्या क्रमांकावर आहे. आफ्रिकेने सहा सामन्यात पाच विजय मिळवले आहेत.  न्यूझीलंड तिसऱ्या क्रमांकावर आहे. मात्र, ऑस्ट्रेलिया चौथ्या स्थानावर आहे.  ऑस्ट्रेलिया आणि न्यूझीलंड यांचे समान गुण आहेत, पण न्यूझीलंड सरस रनरेटमुळे तिसऱ्या क्रमांकावर आहे.  इतर संघाची स्थिती काय ? श्रीलंकेचा पराभव करत अफगाणिस्तानने गुणतालिकेत पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने सहा सामन्यात तीन विजय मिळवलेत. सहा गुणांसह ते पाचव्या स्थानावर आहेत. पाचव्या क्रमांकावर असणारा श्रीलंका संघ सहाव्या स्थानी घसरलाय. श्रीलंका संघाचे सहा सामन्यात चार पराभव झालेत. सहाव्या क्रमांकवर असणारा पाकिस्तान आता सातव्या स्थानी घसरलाय. पाकिस्तान निगेटिव्ह -0.387 च्या नेट रनरेटसह 4 गुण मिळवत सातव्या,  नेदरलँडचा संघ चार गुणांसह आठव्या क्रमांकावर आहे. बांगलादेश निगेटिव्ह -1.338 च्या नेट रनरेटसह 2 गुण मिळवत नवव्या, इंग्लंड निगेटिव्ह -1.652 च्या खराब नेट रनरेटसह 2 गुण मिळवत दहाव्या क्रमांकावर आहे.  अफगाणिस्तानचे विश्वचषकातील आव्हान जिवंत -  आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.","content":"World Cup 2023 Points Table Update : पाकिस्तान, इंग्लंड आणि श्रीलंका या विश्वचषक विजेत्या संघाचा पराभव करत अफगाणिस्तान संघाने खळबळ माजवली आहे. अफगाणिस्तान संघाने तिसऱ्या विजयासह उपांत्य फेरीसाठीच्या आपल्या अशा जिवंत ठेवल्या. मात्र, दुसरीकडे श्रीलंकेसाठी आता उपांत्य फेरीची दारे बंद होऊ लागली आहेत. अफगाणिस्तान संघाने श्रीलंकेचा पराभव करत थेट पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने पाकिस्तानलाही मागे टाकलेय. श्रीलंका संघ आता सहाव्या स्थानी घसरलाय. भारतीय संघ गुणतालिकेत अव्वल स्थानावर कायम आहे. टॉप 4 ची स्थिती काय ? पाकिस्तानविरुद्धच्या विजयानंतर दक्षिण आफ्रिकेनं टॉप-4 मध्ये बदल करत अव्वल स्थान गाठलं होतं. पण आज टीम इंडियाने पुन्हा एकदा अव्वल स्थान काबिज केलेय. टीम इंडिया 12 गुणांसह गुणतालिकेत पहिल्या क्रमांकावर आहे. दक्षिण आफ्रिका गुणतालिकेत दुसऱ्या क्रमांकावर आहे. आफ्रिकेने सहा सामन्यात पाच विजय मिळवले आहेत. न्यूझीलंड तिसऱ्या क्रमांकावर आहे. मात्र, ऑस्ट्रेलिया चौथ्या स्थानावर आहे. ऑस्ट्रेलिया आणि न्यूझीलंड यांचे समान गुण आहेत, पण न्यूझीलंड सरस रनरेटमुळे तिसऱ्या क्रमांकावर आहे. इतर संघाची स्थिती काय ? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रीलंकेचा पराभव करत अफगाणिस्तानने गुणतालिकेत पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने सहा सामन्यात तीन विजय मिळवलेत. सहा गुणांसह ते पाचव्या स्थानावर आहेत. पाचव्या क्रमांकावर असणारा श्रीलंका संघ सहाव्या स्थानी घसरलाय. श्रीलंका संघाचे सहा सामन्यात चार पराभव झालेत. सहाव्या क्रमांकवर असणारा पाकिस्तान आता सातव्या स्थानी घसरलाय. पाकिस्तान निगेटिव्ह -0.387 च्या नेट रनरेटसह 4 गुण मिळवत सातव्या, नेदरलँडचा संघ चार गुणांसह आठव्या क्रमांकावर आहे. बांगलादेश निगेटिव्ह -1.338 च्या नेट रनरेटसह 2 गुण मिळवत नवव्या, इंग्लंड निगेटिव्ह -1.652 च्या खराब नेट रनरेटसह 2 गुण मिळवत दहाव्या क्रमांकावर आहे. अफगाणिस्तानचे विश्वचषकातील आव्हान जिवंत - आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.","pubDate":"2023-10-30 17:40:18","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/4055ea76622bdcce0b31f27ef5135c291698686327951252_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"a529ab644ece6e8c91df7a2972fb84f6","title":"Iwobi Keen To Make Big Impact At Fulham","link":"https://www.completesports.com/iwobi-keen-to-make-big-impact-at-fulham/","keywords":["Nigerian Footballers Abroad"],"creator":["Adeboye Amosu"],"video_url":null,"description":"Alex Iwobi is determined to become a key figure at Premier League club, Fulham. The Nigeria international ended his four-year stay at Everton in the summer, switching over to the Craven Cottage. The move saw Iwobi reunite with Marco Silva, the man who took him to Everton in 2019. The 27-year-old has now vowed to repay Silva's faith in him. “He’s the one that actually got me to Everton. I did speak with him, and he has a lot of faith in me. For a player to have that trust and confidence from the manager allows you to go and express yourself and play with freedom. I just need to repay the faith,\" Iwobi told the Standard. “I have to give credit to Fulham. They were very welcoming with me and I’m enjoying my time here. We just need to climb up the table and get results like we did today.” Read Also:Pakistan vs Bangladesh Cricket World Cup 31 Oct 2023: Odds, Prediction, Tips and Line Ups Iwobi played a key role in Fulham's 1-1 draw against Brighton & Hove Albion at the AMEX Stadium on Sunday. The versatile midfielder was deployed in a new central role and he expressed his desire to stick to the position. \"I do enjoy playing in the middle”, said Iwobi. “I feel like I get the ball a lot more. I like to influence the game as much as I can for the team. “It was an alright performance [from myself]. I feel I could have done a bit better, but the main thing is that we were able to get a point at a difficult stadium.” Iwobi joined Fulham for £22m on the final day of the summer transfer window. He has made six appearances for the London club. The post Iwobi Keen To Make Big Impact At Fulham appeared first on Complete Sports.","content":"Alex Iwobi is determined to become a key figure at Premier League club, Fulham. The Nigeria international ended his four-year stay at Everton in the summer, switching over to the Craven Cottage. The move saw Iwobi reunite with Marco Silva, the man who took him to Everton in 2019. The 27-year-old has now vowed to repay Silva’s faith in him. “He’s the one that actually got me to Everton. I did speak with him, and he has a lot of faith in me. For a player to have that trust and confidence from the manager allows you to go and express yourself and play with freedom. I just need to repay the faith,” Iwobi told the . “I have to give credit to Fulham. They were very welcoming with me and I’m enjoying my time here. We just need to climb up the table and get results like we did today.” Iwobi played a key role in Fulham’s 1-1 draw against Brighton & Hove Albion at the AMEX Stadium on Sunday. The versatile midfielder was deployed in a new central role and he expressed his desire to stick to the position. “I do enjoy playing in the middle”, said Iwobi.","pubDate":"2023-10-30 17:34:34","image_url":null,"source_id":"completesports","source_priority":44611,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e2b68e4329d3539deae76c743653458e","title":"ODI World Cup: Afghanistan slay yet another former world champions","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/30/odi-world-cup-afghanistan-slay-yet-another-former-world-champions-2628446.html","keywords":null,"creator":null,"video_url":null,"description":"After England and Pakistan, Shahidi and Co beat 1996 champs Sri Lanka by seven wickets. PUNE: The last time Afghanistan and Sri Lanka faced each other in the ODIs, it was an electrifying environment at the Gaddafi Stadium. The match went down the wire, as Sri Lanka came on top by just two runs in front of the neutral but passionate crowds in Lahore. The confusion about the Net Run Rate that prevented Afghanistan from making it to the Super Four was the talk of the town and the dejected faces of the Afghan players told the heartbreaking story. Exactly a month from that day, a new challenge was waiting for both teams in India as the 2023 World Cup began in Ahmedabad. A lot has changed since then, Afghanistan before their fixture against Sri Lanka in Pune had four points on the board, an unbelievable result for a team that could not win a single match in the previous edition. Their Team Mentor and former India International Ajay Jadeja believes it is no secret how talented this group of players really is. \"I don’t have to make them believe that they are equals. They believe in themselves. The IPL auction tells them how good they are,\" Jadeja told reporters in Delhi ahead of Afghanistan's match against hosts India. Even after defeats against the likes of Bangladesh, India, and New Zealand, Afghanistan never lost their spirit. Well aware of their strengths, match by match they improved the batting to provide cushion to their bowling might. \"They are all grown up and living up to the expectations in the World Cup,\" Lalchand Rajput, Afghanistan's former head coach told this daily. \"Their spin department is the best in the world. The medium-pacers have improved and they are good now. The only thing they have to do now is to get a good score. That should click. If they get 270-290 on a little bit of a helpful wicket, I think they will make life miserable for others in the tournament,\" he mentioned. That is exactly what the Afghan unit did after their loss to Bangladesh in the tournament opener, courtesy of a batting collapse. Even when it didn't come together against the mighty Indian batting, where Rohit Sharma smashed a record-breaking ton, the batting unit learned lessons from the defeat as Hashmatullah Shahidi and Azmatullah Omarzai added 128 runs for the fourth wicket against Sri Lanka. It was ticking, but not at one time. \"I used to tell them this all the time that they need to get that consistency right because they would be hot one day and cold the other. But now things are changing. They can upset anybody, they need to have that consistency. Over the period of time, they have been improving by playing many matches. And I am sure that maturity has come which means they can be a dangerous side,\" Rajput predicted it all as Afghanistan got ready to face Pakistan in Chennai. At Chepauk, even after their spinners made life hard for Pakistan in the middle, Afghanistan had to chase down 282 runs. But the simplified Afghan Approach, written on the whiteboard, made sure they chased it down. \"I said, we're not going to be able to win this game in 35-40 overs. We're going to have to bat well for 50 overs. And we broke it down to 10-over splits. And the start that (Rahmanullah) Gurbaz and Ibrahim (Zadran) gave us. It made sure that we had the opportunity to finish the game off in the 49th over and we did so that was great,\" Jonathan Trott the current head coach mentioned in the post-match media interaction. With that win against Pakistan, the Afghans added another feather to their cap as they surpassed their previous best in the WCs. With the Sri Lanka challenge waiting in Pune, the question remained the same. Can they keep that consistency? Like Rajput mentioned the spin attack and the developing pace unit, didn't let Sri Lanka settle in the innings and bowled them out for 241. Now came the part where Afghanistan had the opportunity to prove that they have been improving day-by-day in the format. Rajput had a message for the Afghan batters. \"I always believe that the game sense is very important, whether you want to build a partnership and then go hard or just have to go hard from the start. So I think you should have that game sense. Based on what the team requires at that time, you have to build a partnership. You can play the favourite shots after one is well set or after getting a partnership, but you can't lose wickets in a cluster that puts pressure on the team. Adaptability in these situations is of utmost importance along with game sense,\" and the Afghan top order followed it to the last word. After Gurbaz, or the entertainer as Rajput calls him, fell early, Zadran and Rehmat Shah kept the innings going even when they could not hit a boundary for almost 10 overs. The 'Game Sense' and patience prevailed. Half-tons from Shah, captain Hashmatullah Shahidi, and Azmatullah Omarzai took the venom out of the already depleted Sri Lanka attack that could not hold to their chances as Afghanistan registered their third victory of the tournament. After beating Pakistan, Afghanistan thanked the crowd with the victory lap around the Chepauk, at theMCA Stadium in Pune, they again thanked the crowd with another lap. And it looks like they are not getting tired of it at all. And why would they? After all the giant killers have beaten the three former WC winners in the span of just two weeks. \"They have not been playing for even 20 years. Other teams have a history of 100 years,\" is how Jadeja described where this team stands in the history of the game. And at this rate, more marvelous results are waiting for them.","content":"PUNE: The last time Afghanistan and Sri Lanka faced each other in the ODIs, it was an electrifying environment at the Gaddafi Stadium. The match went down the wire, as Sri Lanka came on top by just two runs in front of the neutral but passionate crowds in Lahore. The confusion about the Net Run Rate that prevented Afghanistan from making it to the Super Four was the talk of the town and the dejected faces of the Afghan players told the heartbreaking story. Exactly a month from that day, a new challenge was waiting for both teams in India as the 2023 World Cup began in Ahmedabad. A lot has changed since then, Afghanistan before their fixture against Sri Lanka in Pune had four points on the board, an unbelievable result for a team that could not win a single match in the previous edition. Their Team Mentor and former India International Ajay Jadeja believes it is no secret how talented this group of players really is. \"I don’t have to make them believe that they are equals. They believe in themselves. The IPL auction tells them how good they are,\" Jadeja told reporters in Delhi ahead of Afghanistan's match against hosts India. Even after defeats against the likes of Bangladesh, India, and New Zealand, Afghanistan never lost their spirit. Well aware of their strengths, match by match they improved the batting to provide cushion to their bowling might. \"They are all grown up and living up to the expectations in the World Cup,\" Lalchand Rajput, Afghanistan's former head coach told this daily. \"Their spin department is the best in the world. The medium-pacers have improved and they are good now. The only thing they have to do now is to get a good score. That should click. If they get 270-290 on a little bit of a helpful wicket, I think they will make life miserable for others in the tournament,\" he mentioned. That is exactly what the Afghan unit did after their loss to Bangladesh in the tournament opener, courtesy of a batting collapse. Even when it didn't come together against the mighty Indian batting, where Rohit Sharma smashed a record-breaking ton, the batting unit learned lessons from the defeat as Hashmatullah Shahidi and Azmatullah Omarzai added 128 runs for the fourth wicket against Sri Lanka. It was ticking, but not at one time. \"I used to tell them this all the time that they need to get that consistency right because they would be hot one day and cold the other. But now things are changing. They can upset anybody, they need to have that consistency. Over the period of time, they have been improving by playing many matches. And I am sure that maturity has come which means they can be a dangerous side,\" Rajput predicted it all as Afghanistan got ready to face Pakistan in Chennai. At Chepauk, even after their spinners made life hard for Pakistan in the middle, Afghanistan had to chase down 282 runs. But the simplified Afghan Approach, written on the whiteboard, made sure they chased it down. \"I said, we're not going to be able to win this game in 35-40 overs. We're going to have to bat well for 50 overs. And we broke it down to 10-over splits. And the start that (Rahmanullah) Gurbaz and Ibrahim (Zadran) gave us. It made sure that we had the opportunity to finish the game off in the 49th over and we did so that was great,\" Jonathan Trott the current head coach mentioned in the post-match media interaction. With that win against Pakistan, the Afghans added another feather to their cap as they surpassed their previous best in the WCs. With the Sri Lanka challenge waiting in Pune, the question remained the same. Can they keep that consistency? Like Rajput mentioned the spin attack and the developing pace unit, didn't let Sri Lanka settle in the innings and bowled them out for 241. Now came the part where Afghanistan had the opportunity to prove that they have been improving day-by-day in the format. Rajput had a message for the Afghan batters. \"I always believe that the game sense is very important, whether you want to build a partnership and then go hard or just have to go hard from the start. So I think you should have that game sense. Based on what the team requires at that time, you have to build a partnership. You can play the favourite shots after one is well set or after getting a partnership, but you can't lose wickets in a cluster that puts pressure on the team. Adaptability in these situations is of utmost importance along with game sense,\" and the Afghan top order followed it to the last word. After Gurbaz, or the entertainer as Rajput calls him, fell early, Zadran and Rehmat Shah kept the innings going even when they could not hit a boundary for almost 10 overs. The 'Game Sense' and patience prevailed. Half-tons from Shah, captain Hashmatullah Shahidi, and Azmatullah Omarzai took the venom out of the already depleted Sri Lanka attack that could not hold to their chances as Afghanistan registered their third victory of the tournament. After beating Pakistan, Afghanistan thanked the crowd with the victory lap around the Chepauk, at theMCA Stadium in Pune, they again thanked the crowd with another lap. And it looks like they are not getting tired of it at all. And why would they? After all the giant killers have beaten the three former WC winners in the span of just two weeks. \"They have not been playing for even 20 years. Other teams have a history of 100 years,\" is how Jadeja described where this team stands in the history of the game. And at this rate, more marvelous results are waiting for them.","pubDate":"2023-10-30 17:26:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f2c35eae0c3f26bb6557fc908190fd04","title":"World Cup 2023 : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका... अफगाणिस्तानचा विश्वचषकातील तिसरा विजय","link":"https://marathi.abplive.com/sports/cricket/afghanistan-beat-sri-lanka-by-8-wickets-hashmatullah-shahidi-azmatullah-omarzai-afg-vs-sl-full-match-highlights-world-cup-2023-1224080","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"Afghanistan vs Sri Lanka Full Match Highlights : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.  श्रीलंकेने प्रथम फलंदाजी करताना 241 धावांपर्यंत मजल मारली होती. अफगाणिस्तान संघाने हे आव्हान 45.2 षटकात अवघ्या तीन विकेटच्या मोबदल्यात पार केले. अफगानिस्तानसाठी रहमत शाह याने 62 धावा केल्या. तर कर्णधार हशमतुल्लाह शाहिदी याने 74 चेंडूत दोन चौकार आणि एका षटकाराच्या मदतीने नाबाद 58 धावा जोडल्या. अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये सहा चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा चोपल्या. या दोघांनी मॅच विनिंग 111 धावांची भागिदारी केली.  श्रीलंकेने दिलेल्या 242 धावांच्या आव्हानाचा पाठलाग करताना अफगाणिस्तानची सुरुवात अतिशय खराब झाली. स्टार फलंदाज रहमानुल्लाह गुरबाज पहिल्याच षटकात खातेही न उघडता बाद झाला. पण त्यानंतर अफगाणिस्तानच्या इतर फलंदाजांनी विजयी खेळी केली. रहमत शाह आणि इब्राहिम जादरान यांनी दुसऱ्या विकेटसाठी 73 धावांचे योगदान दिलेय. दोघेही सहज धावा काढत होते, एकेरी दुहेरी धावसंख्येसोबत चौकार आणि षटकारांचा पाऊस पाडत होते. इब्राहिम जादरान याने 57 चेंडूत चार चौकार आणि एका षटकाराच्या मदतीने 39 धावा काढून बाद झाला. त्यानंतर रहमत शाह आणि कर्णधार हशमतुल्लाह शाहिदी यांनीही डाव सावरला.  रहमत शाह याने 74 चेंडूमध्ये चार चौकार आणि एका षटकाराच्या मदतीने 62 धावा केल्या. तीन विकेट गेल्यानंतर कर्णधार शाहिदीने अष्टपैलू अजमतुल्लाह ओमरजई याच्यासोबत विजयी 111 धावांची भागिदारी केली.  हशमतुल्लाह शाहिदी याने 74 चेंडूमध्ये दोन चौकार आणि एका षटकाराच्या मदतीने 58 धावा केल्या. तर अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये 6 चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा केल्या.  दरम्यान, श्रीलंकाकडून दिलशान मदुशंका याने सुरुवातीलाच दोन विकेट घेतल्या. त्याशिवाय कसून रजिता याने एक विकेट घेतली. इतर एकाही गोलंदाजाला यश मिळाले नाही.   ","content":"Afghanistan vs Sri Lanka Full Match Highlights : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे. श्रीलंकेने प्रथम फलंदाजी करताना 241 धावांपर्यंत मजल मारली होती. अफगाणिस्तान संघाने हे आव्हान 45.2 षटकात अवघ्या तीन विकेटच्या मोबदल्यात पार केले. अफगानिस्तानसाठी रहमत शाह याने 62 धावा केल्या. तर कर्णधार हशमतुल्लाह शाहिदी याने 74 चेंडूत दोन चौकार आणि एका षटकाराच्या मदतीने नाबाद 58 धावा जोडल्या. अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये सहा चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा चोपल्या. या दोघांनी मॅच विनिंग 111 धावांची भागिदारी केली. श्रीलंकेने दिलेल्या 242 धावांच्या आव्हानाचा पाठलाग करताना अफगाणिस्तानची सुरुवात अतिशय खराब झाली. स्टार फलंदाज रहमानुल्लाह गुरबाज पहिल्याच षटकात खातेही न उघडता बाद झाला. पण त्यानंतर अफगाणिस्तानच्या इतर फलंदाजांनी विजयी खेळी केली. रहमत शाह आणि इब्राहिम जादरान यांनी दुसऱ्या विकेटसाठी 73 धावांचे योगदान दिलेय. दोघेही सहज धावा काढत होते, एकेरी दुहेरी धावसंख्येसोबत चौकार आणि षटकारांचा पाऊस पाडत होते. इब्राहिम जादरान याने 57 चेंडूत चार चौकार आणि एका षटकाराच्या मदतीने 39 धावा काढून बाद झाला. त्यानंतर रहमत शाह आणि कर्णधार हशमतुल्लाह शाहिदी यांनीही डाव सावरला. रहमत शाह याने 74 चेंडूमध्ये चार चौकार आणि एका षटकाराच्या मदतीने 62 धावा केल्या. तीन विकेट गेल्यानंतर कर्णधार शाहिदीने अष्टपैलू अजमतुल्लाह ओमरजई याच्यासोबत विजयी 111 धावांची भागिदारी केली. हशमतुल्लाह शाहिदी याने 74 चेंडूमध्ये दोन चौकार आणि एका षटकाराच्या मदतीने 58 धावा केल्या. तर अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये 6 चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा केल्या. दरम्यान, श्रीलंकाकडून दिलशान मदुशंका याने सुरुवातीलाच दोन विकेट घेतल्या. त्याशिवाय कसून रजिता याने एक विकेट घेतली. इतर एकाही गोलंदाजाला यश मिळाले नाही. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });","pubDate":"2023-10-30 17:20:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/a4ed6556df6bd74d8b2218e11bfcc0c81698685324529582_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0539c23a4e9b75ae84b60f7d5267dda5","title":"WC 2023: शरणार्थी कैंप से 100वां मैच खेलने तक का सफर, मिलिए अफ़ग़ानिस्तान के सबसे कामयाब गेंदबाज राशिद खान से","link":"https://sports.ndtv.com/hindi/cricket/rashid-khan-journey-from-refugee-camp-to-playing-100th-match-afghanistan-most-successful-bowler-4529322#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Rashid Khan: एकदिवसीय मैचों में राशिद खान अफ़ग़ानिस्तान के लिए सबसे ज्यादा 100 मैचों में 179 विकेट लिए हैं. एक मैच में चार बार पांच विकेट और छह बार चार विकेट लिए हैं. सबसे तेज सौवाँ विकेट लेने के मामले में राशिद खान दूसरे स्थान पर हैं.","content":"Rashid Khan 2001 की बात है. अफ़ग़ानिस्तान से एक पति पत्नी अपने 11 बच्चों के साथ पाकिस्तान की ओर निकल पड़ा. उस समय अफ़ग़ानिस्तान में तालिबान और अमेरिका में लड़ाई चल रही थी. वहां रहना आसान नहीं था. इस परिवार को पाकिस्तान के एक शरणार्थी कैंप में शरण मिली. किसी ने शायद सोचा नहीं होगा कि शरणार्थी कैंप में पला-बढ़ा एक बच्चा एक दिन अफ़ग़ानिस्तान क्रिकेट को एक नयी उंचाई तक पहुंचाएगा. उसकी गिनती अफ़ग़ानिस्तान के बेहतरीन खिलाडियों में होगी और अन्तरराष्ट्रीय एकदिवसीय मैच खेलन में भी शतक बनाएगा. उसने अफ़ग़ानिस्तान के लिए एकदिवसीय मैचों में सबसे ज्यादा विकेट हासिल करने का रिकॉर्ड बनाया है. उसका नाम है राशिद खान है. आज वो अफ़ग़ानियों का सबसे चहेता खिलाड़ी है. आज वो अपने करियर का सौवें एकदिवसीय मैच खेल रहा है. अफ़ग़ानिस्तान जैसी छोटी टीम के लिए ये काफी बड़ी बात है. 20 सितम्बर 1998 को राशिद खान का जन्म अफ़ग़ानिस्तान के नंगरहार में हुआ. उस समय अफ़ग़ानिस्तान में तालिबान का शासन था. 2001 में अमेरिका ने तालिबान पर हमला किया. लोग अपनी जान बचाने के लिए भागने लगे. राशिद खान के पिता अपने 11 बच्चों के साथ पाकिस्तान के तरफ निकल पड़े और वहां एक शरणार्थी कैंप में रहें. राशिद खान तब तीन साल के थे. राशिद खान पेशावर के गलिओं में क्रिकेट खेलने लगे. उन्हें ट्रेनिंग देने के लिए कोई नहीं था. इस टैलेंट को पहचाने के लिए कोई नहीं था. राशिद खान अपने घर में अपने भाईओं के साथ क्रिकेट खेलते थे. घरवाले चाहते थे कि राशिद खान डॉक्टर बने. राशिद पढ़ाई में अच्छे थे. एक बार राशिद खान अपने परिवार को ना बताते हुए अपने दोस्त के साथ क्रिकेट मैच खेलने चले गए और बल्लेबाजी करते हुए उस मैच में 65 रन बना लिए. पहली बार राशिद खान हार्ड बॉल में क्रिकेट खेले. घर में टेप बॉल में खेलते थे. राशिद खान के अंदर आत्मविश्वास आने लगा. उन्हें लगा कि वे एक अच्छा क्रिकेटर बन सकते हैं. क्रिकेट के प्रति उनका प्यार बढ़ते गया. धीरे धीरे राशिद खान अपने दोस्तों के साथ क्रिकेट खेलने लगे फिर घरेलु टीम में खेले. एक बार राशिद खान लाहौर में पाकिस्तान अंडर 19 खिलाफ मैच खेल रहे थे. इस मैच का सीधा प्रसारण टीवी में हो रहा था. राशिद खान के परिवार लोग इस मैच को देख रहे थे. राशिद खान ने इस मैच में 60 रन बनाये. परिवार लोग खुश हो गए और उन्हें लगने लगा कि राशिद खान एक अच्छा खिलाड़ी बन सकते हैं फिर राशिद खान को क्रिकेट खेलने के लिए परमिशन दे दिए. राशिद खान अनिल कुंबले और शाहिद अफरीदी को अपना आइडल मानते हैं. दोनों की गेंदबाजी को देखते हुए अपने गेंदबाजी में सुधार लाये और एक अच्छा गेंदबाज बन गए. राशिद खान को सचिन तेंदुलकर की बल्लेबाजी पसंद है. 2015 में राशिद खान की चयन अफ़ग़ानिस्तान टीम में हुई. 18 अक्टूबर 2015 को राशिद खान अपने का करियर पहला एकदिवसीय मैच ज़िम्बाब्वे के खिलाफ खेला. इस मैच में राशिद ने 8 रन बनाए थे और एक विकेट लिए थे. एकदिवसीय मैचों में राशिद खान अफ़ग़ानिस्तान के लिए सबसे ज्यादा 100 मैचों में 179 विकेट लिए हैं. एक मैच में चार बार पांच विकेट और छह बार चार विकेट लिए हैं. सबसे तेज सौवाँ विकेट लेने के मामले में राशिद खान दूसरे स्थान पर हैं. राशिद खान अपना 44 वां मैच में अपना सौवां विकेट हासिल किये थे. इस मामले में नेपाल के संदीप लामिछाने पहले स्थान पर हैं जो अपने 42वां मैच में सौवाँ विकेट लिए थे. 2017 में सनराइजर्स हैदराबाद ने राशिद खान को 4 करोड़ 30 लाख में खरीदा. इस सीजन में राशिद खान ने हैदराबाद के लिए 17 विकेट लिए थे. 2018 में सनराइजर्स हैदराबाद ने राशिद खान को 9 करोड़ में खरीदा था. 2017 के आईपीएल में शानदार प्रदर्शन के बाद CPL में गयाना अमेजन वॉरियर्स के लिए खेलना शुरू किए और अपने करियर का पहला हैट्रिक लेने में कामयाब हुए. 2018 में एडिलेड स्ट्राइकर्स से जुड़े. इस तरह राशिद खान अलग अलग देशों की फ्रैंचाइजी के साथ जुड़ते गए. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-30 16:48:46","image_url":"https://c.ndtvimg.com/2021-10/p5m0fcv_afghanistan-team-afp_625x300_31_October_21.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"f2ceaf8bc9236f377d4fa8d250fae9d8","title":"Iconic Sri Lankan cricket team supporter ‘Uncle’ Percy Abeysekera passes away","link":"https://www.tribuneindia.com/news/sports/iconic-sri-lankan-cricket-team-supporter-uncle-percy-abeysekera-passes-away-557916","keywords":null,"creator":null,"video_url":null,"description":"Colombo, October 30Percy Abeysekera, the iconic flag-waving, quick-witted supporter of the Sri Lankan cricket team, passed away after a battle with prolonged illness here on Monday.The 87-year-old Abeysekera, who was fondly called as Uncle Percy by fans and cricketers alike, was a constant presence on cricket grounds across the world where his country played.Abeysekera, known for his colourful dressing, began his travels to cheer for the Lankan cricket team from the 1979 World Cup and since then he attended all major cricketing events except the on-going World Cup owing to poor health.His friendship with leading Lankan cricketers like Arjuna Ranatunga, Sanath Jayasuriya and Kumar Sangakkara made him an unavoidable figure in the country's cricketing landscape.Abeysekera also shared cordial relationship with Indian cricketers like MS Dhoni, Virat Kohli and Rohit Sharma. Rohit had visited Abeysekera at his home in Colombo during the recent Asia Cup.Kohli had invited Abeysekera to the Indian dressing room for a short interaction during the tour to Sri Lanka in 2015.However, Abeysekera's health was not at its best over the last year and the Sri Lanka Cricket had recently given him LKR 5 million to meet his medical expenses.","content":"PTI Colombo, October 30 Percy Abeysekera, the iconic flag-waving, quick-witted supporter of the Sri Lankan cricket team, passed away after a battle with prolonged illness here on Monday. The 87-year-old Abeysekera, who was fondly called as Uncle Percy by fans and cricketers alike, was a constant presence on cricket grounds across the world where his country played. Abeysekera, known for his colourful dressing, began his travels to cheer for the Lankan cricket team from the 1979 World Cup and since then he attended all major cricketing events except the on-going World Cup owing to poor health. His friendship with leading Lankan cricketers like Arjuna Ranatunga, Sanath Jayasuriya and Kumar Sangakkara made him an unavoidable figure in the country’s cricketing landscape. Abeysekera also shared cordial relationship with Indian cricketers like MS Dhoni, Virat Kohli and Rohit Sharma. Rohit had visited Abeysekera at his home in Colombo during the recent Asia Cup. Kohli had invited Abeysekera to the Indian dressing room for a short interaction during the tour to Sri Lanka in 2015. However, Abeysekera’s health was not at its best over the last year and the Sri Lanka Cricket had recently given him LKR 5 million to meet his medical expenses. #Cricket","pubDate":"2023-10-30 16:40:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/10/2023_10$largeimg_1435764438.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ec055f4a1b82c29d3cdd465cd3bed5e0","title":"AFG Vs SL: વર્લ્ડકપ 2023માં અફઘાનિસ્તાનની ત્રીજી જીત, શ્રીલંકાને 7 વિકેટથી આપી હાર","link":"https://gujarati.abplive.com/sports/cricket/odi-world-cup-2023-afghanistan-won-by-7-wickets-against-sri-lanka-match-highlights-mca-stadium-863448","keywords":["ક્રિકેટ"],"creator":["એબીપી અસ્મિતા વેબ ટીમ"],"video_url":null,"description":"ICC ODI World Cup 2023 Afghanistan vs Sri Lanka 2023 Highlights:  ODI વર્લ્ડ કપ 2023ની 30મી મેચમાં અફઘાનિસ્તાને શ્રીલંકાને હરાવ્યું છે. પૂણેના મહારાષ્ટ્ર ક્રિકેટ એસોસિએશન સ્ટેડિયમ ખાતે પ્રથમ બેટિંગ કરતા શ્રીલંકાએ 241 રન બનાવ્યા હતા અને અફઘાનિસ્તાને ત્રણ વિકેટ ગુમાવીને લક્ષ્ય હાંસલ કરી લીધો હતો. હાર સાથે શ્રીલંકા માટે આગળનો રસ્તો મુશ્કેલ બની ગયો છે. ઈંગ્લેન્ડ અને પાકિસ્તાન બાદ અફઘાનિસ્તાને પણ શ્રીલંકાને હરાવ્યું છે. જીત સાથે અફઘાનિસ્તાન પોઇન્ટ ટેબલમાં પાંચમાં ક્રમે આવી ગયું છે.","content":"ICC ODI World Cup 2023 Afghanistan vs Sri Lanka 2023 Highlights: ODI વર્લ્ડ કપ 2023ની 30મી મેચમાં અફઘાનિસ્તાને શ્રીલંકાને હરાવ્યું છે. પૂણેના મહારાષ્ટ્ર ક્રિકેટ એસોસિએશન સ્ટેડિયમ ખાતે પ્રથમ બેટિંગ કરતા શ્રીલંકાએ 241 રન બનાવ્યા હતા અને અફઘાનિસ્તાને ત્રણ વિકેટ ગુમાવીને લક્ષ્ય હાંસલ કરી લીધો હતો. હાર સાથે શ્રીલંકા માટે આગળનો રસ્તો મુશ્કેલ બની ગયો છે. ઈંગ્લેન્ડ અને પાકિસ્તાન બાદ અફઘાનિસ્તાને પણ શ્રીલંકાને હરાવ્યું છે. જીત સાથે અફઘાનિસ્તાન પોઇન્ટ ટેબલમાં પાંચમાં ક્રમે આવી ગયું છે. શ્રીલંકાએ પ્રથમ બેટિંગ કરતા 49.3 ઓવરમાં 241 રન બનાવી ઓલઆઉટ થયું હતું. નિસાંકાએ સૌથી વધુ 46 રન બનાવ્યા હતા. કુસલ મેંડિસે 39, સમરવિક્રામાએ 36, મહેશ તીક્ષ્ણાએ 29 રનનું યોગદાન આપ્યું હતું. અફઘાનિસ્તાન તરફથી ફારૂકીએ 34 રનમાં 4 વિકેટ, મુજીબે 38 રનમાં 2 વિકેટ, રાશિદ ખાને 50 રનમાં 1 વિકેટ ઝડપી હતી. અફઘાનિસ્તાને 242 રનના ટાર્ગેટને 45.2 ઓવરમાં 3 વિકેટ ગુમાવી પાર પાડ્યો હતો. ગુરબાઝ ખાતું ખોલાવી શક્યો નહોતો. ઝરદાને 39 અને રહમત શાહે 62 રન બનાવ્યા હતા. શાહીદી 58 રન અને ઓમરઝઇ 73 રન બનાવી નોટ આઉટ રહ્યા હતા. Afghanistan continue their charge towards a top-four finish in #CWC23 with a stupendous win in Pune 👊 #AFGvSL 📝: https://t.co/f6KGeAIahL pic.twitter.com/cCmw8unwDy — ICC (@ICC) October 30, 2023 વન ડે વર્લ્ડ કપમાં અફઘાનિસ્તાની જીત googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); સ્કોટલેન્ડને 1 વિકેટથી હરાવ્યું, ડ્યુનેડિન, 2015 ઇંગ્લેન્ડને 69 રનથી હરાવ્યું, દિલ્હી, 2023 પાકિસ્તાનને 8 વિકેટે હરાવ્યું, ચેન્નાઈ, 2023 શ્રીલંકાને 7 વિકેટે હરાવ્યું, પુણે, 2023 વન ડે વર્લ્ડ કપમાં અફઘાનિસ્તાન વિ શ્રીલંકા 2015 - શ્રીલંકા 4 વિકેટે જીત્યું 2019 - શ્રીલંકા 34 રને જીત્યું 2023 - અફઘાનિસ્તાન 7 વિકેટે જીત્યું વિશ્વ કપમાં સૌથી વધુ મેચો હારનારી ટીમ અફઘાનિસ્તાન સામે હાર સાથે જ શ્રીલંકાના નામે એક શરમજનક રેકોર્ડ પણ નોંધાયો છે. શ્રીલંકા વન ડે વર્લ્ડકપમાં સૌથી વધુ મેચ હારનારી ટીમ બની ગઈ છે. 43 - શ્રીલંકા 42 - ઝિમ્બાબ્વે 37 - ઈંગ્લેન્ડ 36 - પાકિસ્તાન 35 - ન્યુઝીલેન્ડ 35 - વેસ્ટ ઈન્ડિઝ વર્લ્ડ કપમાં અફઘાનિસ્તાન માટે સૌથી મોટી ભાગીદારી (કોઈપણ વિકેટ) 133 - ઇકરામ અલીખિલ અને રહેમત શાહ વિ. WI, લીડ્ઝ, 2019 (2જી) 130 - ઈબ્રાહિમ ઝદરાન અને આર ગુરબાઝ વિરુદ્ધ PAK, ચેન્નાઈ, 2023 (1 લી) 121 - અઝમતુલ્લા ઓમરઝાઈ અને એચ શાહિદી વિ IND, દિલ્હી, 2023 (4થી) 114 - ઈબ્રાહિમ ઝદરાન અને રહેમાનુલ્લા ગુરબાઝ વિરુદ્ધ ENG, દિલ્હી, 2023 (1 લી) 111* - અઝમતુલ્લા ઓમરઝાઈ અને એચ શાહિદી વિ SL, પુણે, 2023 (4થી) 𝐖𝐡𝐚𝐭 𝐚 𝐖𝐢𝐧! 🙌 #AfghanAtalan , banking on an incredible all-round performance, beat @OfficialSLC by 7 wickets to register their third victory at the ICC Men's Cricket World Cup 2023. 👏 Congratulations to the whole Afghan Nation! 😍 #CWC23 | #AFGvSL | #WarzaMaidanGata pic.twitter.com/KEMcySenBd — Afghanistan Cricket Board (@ACBofficials) October 30, 2023","pubDate":"2023-10-30 16:36:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/e1237396bb08c37765d65b96af3969ba169868378652476_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"9433d8c1614c806b63b19bf21d9a8594","title":"AFG vs SL: Afghanistan spark semi-final hopes after 7-wicket win in Pune","link":"https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-sri-lanka-score-pune-azmat-hashmat-fazalhaq-points-table-semifinal-hopes-2455813-2023-10-30?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"AFG vs SL: Afghanistan spark semi-final hopes after 7-wicket win in Pune","content":null,"pubDate":"2023-10-30 16:29:58","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"66cd7926c6a16b92a2fca0217156d109","title":"Afghanistan upset Sri Lanka to proceed memorable Cricket World Cup marketing campaign","link":"https://www.businesslend.com/sports/afghanistan-upset-sri-lanka-to-continue-memorable-cricket-world-cup-campaign/","keywords":["Sports"],"creator":["Mirza Shehnaz"],"video_url":null,"description":"Sign as much as our free sport e-newsletter for all the most recent information on every little thing from biking to boxing Sign as much as our free sport electronic mail for all the most recent information A spirited Afghanistan upset one other former champion on Monday when Hashmatullah Shahidi’s males defeated 1996 winners Sri [...] The post Afghanistan upset Sri Lanka to proceed memorable Cricket World Cup marketing campaign appeared first on BusinessLend.","content":"A spirited Afghanistan upset one other former champion on Monday when Hashmatullah Shahidi’s males defeated 1996 winners Sri Lanka by seven wickets to proceed their memorable marketing campaign on the 50-overs Cricket World Cup. Their bowlers had laid the inspiration of their third win in six matches after they bowled out Sri Lanka for a below-par 241 in 49.3 overs. Three of their prime 5 batters, together with Shahidi, then produced half-centuries in a scientific chase which they completed in 45.2 overs to maneuver to the fifth place within the factors desk. Azmatullah Omarzai (73) scored the successful run with Shahidi (58) trying on from the opposite finish. Afghanistan, who registered one win within the 2015 World Cup and none in 2019, now have an outright probability of constructing the final 4 in India. “Quite happy and proud of the team,” Shahidi mentioned. “The chase was very professional and I am very happy about it.” Shahidi and his males had surprised holders England and 1992 champions Pakistan earlier within the competitors and so they proved these have been no flukes with yet one more spectacular show in opposition to Sri Lanka. Put into bat, a number of Sri Lankan batters bought their eyes in however couldn’t fairly capitalise on these begins. After the autumn of Dimuth Karunaratne within the sixth over, Kusal Mendis (39) cast half-century partnerships with Pathum Nissanka (46) and Sadeera Samrawickrama (36) to regular the innings. At 134-2 within the twenty eighth over, Sri Lanka regarded effectively positioned to achieve the 275-mark however the plucky Afghans struck at common intervals to peg them again. Angelo Mathews and Maheesh Theekshana raised 45 fast runs for the eighth wicket however Sri Lanka nonetheless fell in need of the 250-mark. Afghan left-arm fast Fazalhaq Farooqi claimed 4-34, which fetched him player-of-the-match award. Afghanistan misplaced Rahmanullah Gurbaz within the first over however Rahmat Shah (62) and Ibrahim Zadran (39) calmed the nerves with a 73-run partnership. Kasun Rajitha dismissed Rahmat however not earlier than the batter had introduced up his second successive fifty of the event. Shahidi and Omarzai blended warning with occasional aggression of their unbroken century stand to take Afghanistan nearer to the goal. With victory in sight, each determined to play their pictures and Azmatullah scored the successful run when he tried to hit a six and was dropped at deep midwicket. “I think we were a little bit short of runs,” Sri Lanka captain Mendis mentioned after their fourth loss in six matches. “We needed 280 or 300 on this pitch. I think the bowlers did well in the first 10 overs but it was tough after that.” Reuters Magic Johnson declared a billionaire by Forbes","pubDate":"2023-10-30 18:07:40","image_url":null,"source_id":"businesslend","source_priority":716394,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"d0e4709abdd9a0dace9b2c7151b1ea3f","title":"अफगाणिस्तानने तीन विश्वचषक विजेत्यांची जिरवली, सेमी-फायनलच्या आशा ठेवल्या जिवंत","link":"https://marathi.abplive.com/photo-gallery/sports/cricket-afghanistan-defeated-sri-lanka-in-pune-3-wins-out-of-6-matches-for-afghanistan-in-this-world-cup-what-a-period-for-them-1224088","keywords":["क्रिकेट"],"creator":["पीटीआय वृत्तसंस्था"],"video_url":null,"description":"अफगाणिस्तानने तीन विश्वचषक विजेत्यांची जिरवली, सेमी-फायनलच्या आशा ठेवल्या जिवंत","content":"पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे. Maratha Reservation: मराठा आरक्षणासाठी राजीनामा द्या; खा. अमोल कोल्हे अन् आंदोलकातील फोन कॉल व्हायरल?","pubDate":"2023-10-30 17:53:00","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/3e4e2a63b8a6e9315950c1151e4128c51698687952614265_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"d4bcb1a3c23453705996ced965dc6857","title":"अफगाणिस्तानच्या विजयानंतर पाकिस्तान सातव्या स्थानी, श्रीलंकेच्या पराभवानंतर गुणतालिकेत फेरबदल","link":"https://marathi.abplive.com/sports/cricket/world-cup-2023-points-table-update-after-afghanistan-beat-sri-lanka-by-7-wickets-pune-1224083","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"World Cup 2023 Points Table Update : पाकिस्तान, इंग्लंड आणि श्रीलंका या विश्वचषक विजेत्या संघाचा पराभव करत अफगाणिस्तान संघाने खळबळ माजवली आहे. अफगाणिस्तान संघाने तिसऱ्या विजयासह उपांत्य फेरीसाठीच्या आपल्या अशा जिवंत ठेवल्या. मात्र, दुसरीकडे श्रीलंकेसाठी आता उपांत्य फेरीची दारे बंद होऊ लागली आहेत. अफगाणिस्तान संघाने श्रीलंकेचा पराभव करत थेट पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने पाकिस्तानलाही मागे टाकलेय. श्रीलंका संघ आता सहाव्या स्थानी घसरलाय. भारतीय संघ गुणतालिकेत अव्वल स्थानावर कायम आहे.   टॉप 4 ची स्थिती काय ? पाकिस्तानविरुद्धच्या विजयानंतर दक्षिण आफ्रिकेनं टॉप-4 मध्ये बदल करत अव्वल स्थान गाठलं होतं. पण आज टीम इंडियाने पुन्हा एकदा अव्वल स्थान काबिज केलेय. टीम इंडिया 12 गुणांसह गुणतालिकेत पहिल्या क्रमांकावर आहे. दक्षिण आफ्रिका गुणतालिकेत दुसऱ्या क्रमांकावर आहे. आफ्रिकेने सहा सामन्यात पाच विजय मिळवले आहेत.  न्यूझीलंड तिसऱ्या क्रमांकावर आहे. मात्र, ऑस्ट्रेलिया चौथ्या स्थानावर आहे.  ऑस्ट्रेलिया आणि न्यूझीलंड यांचे समान गुण आहेत, पण न्यूझीलंड सरस रनरेटमुळे तिसऱ्या क्रमांकावर आहे.  इतर संघाची स्थिती काय ? श्रीलंकेचा पराभव करत अफगाणिस्तानने गुणतालिकेत पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने सहा सामन्यात तीन विजय मिळवलेत. सहा गुणांसह ते पाचव्या स्थानावर आहेत. पाचव्या क्रमांकावर असणारा श्रीलंका संघ सहाव्या स्थानी घसरलाय. श्रीलंका संघाचे सहा सामन्यात चार पराभव झालेत. सहाव्या क्रमांकवर असणारा पाकिस्तान आता सातव्या स्थानी घसरलाय. पाकिस्तान निगेटिव्ह -0.387 च्या नेट रनरेटसह 4 गुण मिळवत सातव्या,  नेदरलँडचा संघ चार गुणांसह आठव्या क्रमांकावर आहे. बांगलादेश निगेटिव्ह -1.338 च्या नेट रनरेटसह 2 गुण मिळवत नवव्या, इंग्लंड निगेटिव्ह -1.652 च्या खराब नेट रनरेटसह 2 गुण मिळवत दहाव्या क्रमांकावर आहे.  अफगाणिस्तानचे विश्वचषकातील आव्हान जिवंत -  आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.","content":"World Cup 2023 Points Table Update : पाकिस्तान, इंग्लंड आणि श्रीलंका या विश्वचषक विजेत्या संघाचा पराभव करत अफगाणिस्तान संघाने खळबळ माजवली आहे. अफगाणिस्तान संघाने तिसऱ्या विजयासह उपांत्य फेरीसाठीच्या आपल्या अशा जिवंत ठेवल्या. मात्र, दुसरीकडे श्रीलंकेसाठी आता उपांत्य फेरीची दारे बंद होऊ लागली आहेत. अफगाणिस्तान संघाने श्रीलंकेचा पराभव करत थेट पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने पाकिस्तानलाही मागे टाकलेय. श्रीलंका संघ आता सहाव्या स्थानी घसरलाय. भारतीय संघ गुणतालिकेत अव्वल स्थानावर कायम आहे. टॉप 4 ची स्थिती काय ? पाकिस्तानविरुद्धच्या विजयानंतर दक्षिण आफ्रिकेनं टॉप-4 मध्ये बदल करत अव्वल स्थान गाठलं होतं. पण आज टीम इंडियाने पुन्हा एकदा अव्वल स्थान काबिज केलेय. टीम इंडिया 12 गुणांसह गुणतालिकेत पहिल्या क्रमांकावर आहे. दक्षिण आफ्रिका गुणतालिकेत दुसऱ्या क्रमांकावर आहे. आफ्रिकेने सहा सामन्यात पाच विजय मिळवले आहेत. न्यूझीलंड तिसऱ्या क्रमांकावर आहे. मात्र, ऑस्ट्रेलिया चौथ्या स्थानावर आहे. ऑस्ट्रेलिया आणि न्यूझीलंड यांचे समान गुण आहेत, पण न्यूझीलंड सरस रनरेटमुळे तिसऱ्या क्रमांकावर आहे. इतर संघाची स्थिती काय ? googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); श्रीलंकेचा पराभव करत अफगाणिस्तानने गुणतालिकेत पाचव्या स्थानी झेप घेतली आहे. अफगाणिस्तान संघाने सहा सामन्यात तीन विजय मिळवलेत. सहा गुणांसह ते पाचव्या स्थानावर आहेत. पाचव्या क्रमांकावर असणारा श्रीलंका संघ सहाव्या स्थानी घसरलाय. श्रीलंका संघाचे सहा सामन्यात चार पराभव झालेत. सहाव्या क्रमांकवर असणारा पाकिस्तान आता सातव्या स्थानी घसरलाय. पाकिस्तान निगेटिव्ह -0.387 च्या नेट रनरेटसह 4 गुण मिळवत सातव्या, नेदरलँडचा संघ चार गुणांसह आठव्या क्रमांकावर आहे. बांगलादेश निगेटिव्ह -1.338 च्या नेट रनरेटसह 2 गुण मिळवत नवव्या, इंग्लंड निगेटिव्ह -1.652 च्या खराब नेट रनरेटसह 2 गुण मिळवत दहाव्या क्रमांकावर आहे. अफगाणिस्तानचे विश्वचषकातील आव्हान जिवंत - आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.","pubDate":"2023-10-30 17:40:18","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/4055ea76622bdcce0b31f27ef5135c291698686327951252_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"a529ab644ece6e8c91df7a2972fb84f6","title":"Iwobi Keen To Make Big Impact At Fulham","link":"https://www.completesports.com/iwobi-keen-to-make-big-impact-at-fulham/","keywords":["Nigerian Footballers Abroad"],"creator":["Adeboye Amosu"],"video_url":null,"description":"Alex Iwobi is determined to become a key figure at Premier League club, Fulham. The Nigeria international ended his four-year stay at Everton in the summer, switching over to the Craven Cottage. The move saw Iwobi reunite with Marco Silva, the man who took him to Everton in 2019. The 27-year-old has now vowed to repay Silva's faith in him. “He’s the one that actually got me to Everton. I did speak with him, and he has a lot of faith in me. For a player to have that trust and confidence from the manager allows you to go and express yourself and play with freedom. I just need to repay the faith,\" Iwobi told the Standard. “I have to give credit to Fulham. They were very welcoming with me and I’m enjoying my time here. We just need to climb up the table and get results like we did today.” Read Also:Pakistan vs Bangladesh Cricket World Cup 31 Oct 2023: Odds, Prediction, Tips and Line Ups Iwobi played a key role in Fulham's 1-1 draw against Brighton & Hove Albion at the AMEX Stadium on Sunday. The versatile midfielder was deployed in a new central role and he expressed his desire to stick to the position. \"I do enjoy playing in the middle”, said Iwobi. “I feel like I get the ball a lot more. I like to influence the game as much as I can for the team. “It was an alright performance [from myself]. I feel I could have done a bit better, but the main thing is that we were able to get a point at a difficult stadium.” Iwobi joined Fulham for £22m on the final day of the summer transfer window. He has made six appearances for the London club. The post Iwobi Keen To Make Big Impact At Fulham appeared first on Complete Sports.","content":"Alex Iwobi is determined to become a key figure at Premier League club, Fulham. The Nigeria international ended his four-year stay at Everton in the summer, switching over to the Craven Cottage. The move saw Iwobi reunite with Marco Silva, the man who took him to Everton in 2019. The 27-year-old has now vowed to repay Silva’s faith in him. “He’s the one that actually got me to Everton. I did speak with him, and he has a lot of faith in me. For a player to have that trust and confidence from the manager allows you to go and express yourself and play with freedom. I just need to repay the faith,” Iwobi told the . “I have to give credit to Fulham. They were very welcoming with me and I’m enjoying my time here. We just need to climb up the table and get results like we did today.” Iwobi played a key role in Fulham’s 1-1 draw against Brighton & Hove Albion at the AMEX Stadium on Sunday. The versatile midfielder was deployed in a new central role and he expressed his desire to stick to the position. “I do enjoy playing in the middle”, said Iwobi.","pubDate":"2023-10-30 17:34:34","image_url":null,"source_id":"completesports","source_priority":44611,"country":["nigeria"],"category":["sports"],"language":"english"},{"article_id":"e2b68e4329d3539deae76c743653458e","title":"ODI World Cup: Afghanistan slay yet another former world champions","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/30/odi-world-cup-afghanistan-slay-yet-another-former-world-champions-2628446.html","keywords":null,"creator":null,"video_url":null,"description":"After England and Pakistan, Shahidi and Co beat 1996 champs Sri Lanka by seven wickets. PUNE: The last time Afghanistan and Sri Lanka faced each other in the ODIs, it was an electrifying environment at the Gaddafi Stadium. The match went down the wire, as Sri Lanka came on top by just two runs in front of the neutral but passionate crowds in Lahore. The confusion about the Net Run Rate that prevented Afghanistan from making it to the Super Four was the talk of the town and the dejected faces of the Afghan players told the heartbreaking story. Exactly a month from that day, a new challenge was waiting for both teams in India as the 2023 World Cup began in Ahmedabad. A lot has changed since then, Afghanistan before their fixture against Sri Lanka in Pune had four points on the board, an unbelievable result for a team that could not win a single match in the previous edition. Their Team Mentor and former India International Ajay Jadeja believes it is no secret how talented this group of players really is. \"I don’t have to make them believe that they are equals. They believe in themselves. The IPL auction tells them how good they are,\" Jadeja told reporters in Delhi ahead of Afghanistan's match against hosts India. Even after defeats against the likes of Bangladesh, India, and New Zealand, Afghanistan never lost their spirit. Well aware of their strengths, match by match they improved the batting to provide cushion to their bowling might. \"They are all grown up and living up to the expectations in the World Cup,\" Lalchand Rajput, Afghanistan's former head coach told this daily. \"Their spin department is the best in the world. The medium-pacers have improved and they are good now. The only thing they have to do now is to get a good score. That should click. If they get 270-290 on a little bit of a helpful wicket, I think they will make life miserable for others in the tournament,\" he mentioned. That is exactly what the Afghan unit did after their loss to Bangladesh in the tournament opener, courtesy of a batting collapse. Even when it didn't come together against the mighty Indian batting, where Rohit Sharma smashed a record-breaking ton, the batting unit learned lessons from the defeat as Hashmatullah Shahidi and Azmatullah Omarzai added 128 runs for the fourth wicket against Sri Lanka. It was ticking, but not at one time. \"I used to tell them this all the time that they need to get that consistency right because they would be hot one day and cold the other. But now things are changing. They can upset anybody, they need to have that consistency. Over the period of time, they have been improving by playing many matches. And I am sure that maturity has come which means they can be a dangerous side,\" Rajput predicted it all as Afghanistan got ready to face Pakistan in Chennai. At Chepauk, even after their spinners made life hard for Pakistan in the middle, Afghanistan had to chase down 282 runs. But the simplified Afghan Approach, written on the whiteboard, made sure they chased it down. \"I said, we're not going to be able to win this game in 35-40 overs. We're going to have to bat well for 50 overs. And we broke it down to 10-over splits. And the start that (Rahmanullah) Gurbaz and Ibrahim (Zadran) gave us. It made sure that we had the opportunity to finish the game off in the 49th over and we did so that was great,\" Jonathan Trott the current head coach mentioned in the post-match media interaction. With that win against Pakistan, the Afghans added another feather to their cap as they surpassed their previous best in the WCs. With the Sri Lanka challenge waiting in Pune, the question remained the same. Can they keep that consistency? Like Rajput mentioned the spin attack and the developing pace unit, didn't let Sri Lanka settle in the innings and bowled them out for 241. Now came the part where Afghanistan had the opportunity to prove that they have been improving day-by-day in the format. Rajput had a message for the Afghan batters. \"I always believe that the game sense is very important, whether you want to build a partnership and then go hard or just have to go hard from the start. So I think you should have that game sense. Based on what the team requires at that time, you have to build a partnership. You can play the favourite shots after one is well set or after getting a partnership, but you can't lose wickets in a cluster that puts pressure on the team. Adaptability in these situations is of utmost importance along with game sense,\" and the Afghan top order followed it to the last word. After Gurbaz, or the entertainer as Rajput calls him, fell early, Zadran and Rehmat Shah kept the innings going even when they could not hit a boundary for almost 10 overs. The 'Game Sense' and patience prevailed. Half-tons from Shah, captain Hashmatullah Shahidi, and Azmatullah Omarzai took the venom out of the already depleted Sri Lanka attack that could not hold to their chances as Afghanistan registered their third victory of the tournament. After beating Pakistan, Afghanistan thanked the crowd with the victory lap around the Chepauk, at theMCA Stadium in Pune, they again thanked the crowd with another lap. And it looks like they are not getting tired of it at all. And why would they? After all the giant killers have beaten the three former WC winners in the span of just two weeks. \"They have not been playing for even 20 years. Other teams have a history of 100 years,\" is how Jadeja described where this team stands in the history of the game. And at this rate, more marvelous results are waiting for them.","content":"PUNE: The last time Afghanistan and Sri Lanka faced each other in the ODIs, it was an electrifying environment at the Gaddafi Stadium. The match went down the wire, as Sri Lanka came on top by just two runs in front of the neutral but passionate crowds in Lahore. The confusion about the Net Run Rate that prevented Afghanistan from making it to the Super Four was the talk of the town and the dejected faces of the Afghan players told the heartbreaking story. Exactly a month from that day, a new challenge was waiting for both teams in India as the 2023 World Cup began in Ahmedabad. A lot has changed since then, Afghanistan before their fixture against Sri Lanka in Pune had four points on the board, an unbelievable result for a team that could not win a single match in the previous edition. Their Team Mentor and former India International Ajay Jadeja believes it is no secret how talented this group of players really is. \"I don’t have to make them believe that they are equals. They believe in themselves. The IPL auction tells them how good they are,\" Jadeja told reporters in Delhi ahead of Afghanistan's match against hosts India. Even after defeats against the likes of Bangladesh, India, and New Zealand, Afghanistan never lost their spirit. Well aware of their strengths, match by match they improved the batting to provide cushion to their bowling might. \"They are all grown up and living up to the expectations in the World Cup,\" Lalchand Rajput, Afghanistan's former head coach told this daily. \"Their spin department is the best in the world. The medium-pacers have improved and they are good now. The only thing they have to do now is to get a good score. That should click. If they get 270-290 on a little bit of a helpful wicket, I think they will make life miserable for others in the tournament,\" he mentioned. That is exactly what the Afghan unit did after their loss to Bangladesh in the tournament opener, courtesy of a batting collapse. Even when it didn't come together against the mighty Indian batting, where Rohit Sharma smashed a record-breaking ton, the batting unit learned lessons from the defeat as Hashmatullah Shahidi and Azmatullah Omarzai added 128 runs for the fourth wicket against Sri Lanka. It was ticking, but not at one time. \"I used to tell them this all the time that they need to get that consistency right because they would be hot one day and cold the other. But now things are changing. They can upset anybody, they need to have that consistency. Over the period of time, they have been improving by playing many matches. And I am sure that maturity has come which means they can be a dangerous side,\" Rajput predicted it all as Afghanistan got ready to face Pakistan in Chennai. At Chepauk, even after their spinners made life hard for Pakistan in the middle, Afghanistan had to chase down 282 runs. But the simplified Afghan Approach, written on the whiteboard, made sure they chased it down. \"I said, we're not going to be able to win this game in 35-40 overs. We're going to have to bat well for 50 overs. And we broke it down to 10-over splits. And the start that (Rahmanullah) Gurbaz and Ibrahim (Zadran) gave us. It made sure that we had the opportunity to finish the game off in the 49th over and we did so that was great,\" Jonathan Trott the current head coach mentioned in the post-match media interaction. With that win against Pakistan, the Afghans added another feather to their cap as they surpassed their previous best in the WCs. With the Sri Lanka challenge waiting in Pune, the question remained the same. Can they keep that consistency? Like Rajput mentioned the spin attack and the developing pace unit, didn't let Sri Lanka settle in the innings and bowled them out for 241. Now came the part where Afghanistan had the opportunity to prove that they have been improving day-by-day in the format. Rajput had a message for the Afghan batters. \"I always believe that the game sense is very important, whether you want to build a partnership and then go hard or just have to go hard from the start. So I think you should have that game sense. Based on what the team requires at that time, you have to build a partnership. You can play the favourite shots after one is well set or after getting a partnership, but you can't lose wickets in a cluster that puts pressure on the team. Adaptability in these situations is of utmost importance along with game sense,\" and the Afghan top order followed it to the last word. After Gurbaz, or the entertainer as Rajput calls him, fell early, Zadran and Rehmat Shah kept the innings going even when they could not hit a boundary for almost 10 overs. The 'Game Sense' and patience prevailed. Half-tons from Shah, captain Hashmatullah Shahidi, and Azmatullah Omarzai took the venom out of the already depleted Sri Lanka attack that could not hold to their chances as Afghanistan registered their third victory of the tournament. After beating Pakistan, Afghanistan thanked the crowd with the victory lap around the Chepauk, at theMCA Stadium in Pune, they again thanked the crowd with another lap. And it looks like they are not getting tired of it at all. And why would they? After all the giant killers have beaten the three former WC winners in the span of just two weeks. \"They have not been playing for even 20 years. Other teams have a history of 100 years,\" is how Jadeja described where this team stands in the history of the game. And at this rate, more marvelous results are waiting for them.","pubDate":"2023-10-30 17:26:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f2c35eae0c3f26bb6557fc908190fd04","title":"World Cup 2023 : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका... अफगाणिस्तानचा विश्वचषकातील तिसरा विजय","link":"https://marathi.abplive.com/sports/cricket/afghanistan-beat-sri-lanka-by-8-wickets-hashmatullah-shahidi-azmatullah-omarzai-afg-vs-sl-full-match-highlights-world-cup-2023-1224080","keywords":["क्रिकेट"],"creator":["एबीपी माझा स्पोर्ट्स डेस्क"],"video_url":null,"description":"Afghanistan vs Sri Lanka Full Match Highlights : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे.  श्रीलंकेने प्रथम फलंदाजी करताना 241 धावांपर्यंत मजल मारली होती. अफगाणिस्तान संघाने हे आव्हान 45.2 षटकात अवघ्या तीन विकेटच्या मोबदल्यात पार केले. अफगानिस्तानसाठी रहमत शाह याने 62 धावा केल्या. तर कर्णधार हशमतुल्लाह शाहिदी याने 74 चेंडूत दोन चौकार आणि एका षटकाराच्या मदतीने नाबाद 58 धावा जोडल्या. अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये सहा चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा चोपल्या. या दोघांनी मॅच विनिंग 111 धावांची भागिदारी केली.  श्रीलंकेने दिलेल्या 242 धावांच्या आव्हानाचा पाठलाग करताना अफगाणिस्तानची सुरुवात अतिशय खराब झाली. स्टार फलंदाज रहमानुल्लाह गुरबाज पहिल्याच षटकात खातेही न उघडता बाद झाला. पण त्यानंतर अफगाणिस्तानच्या इतर फलंदाजांनी विजयी खेळी केली. रहमत शाह आणि इब्राहिम जादरान यांनी दुसऱ्या विकेटसाठी 73 धावांचे योगदान दिलेय. दोघेही सहज धावा काढत होते, एकेरी दुहेरी धावसंख्येसोबत चौकार आणि षटकारांचा पाऊस पाडत होते. इब्राहिम जादरान याने 57 चेंडूत चार चौकार आणि एका षटकाराच्या मदतीने 39 धावा काढून बाद झाला. त्यानंतर रहमत शाह आणि कर्णधार हशमतुल्लाह शाहिदी यांनीही डाव सावरला.  रहमत शाह याने 74 चेंडूमध्ये चार चौकार आणि एका षटकाराच्या मदतीने 62 धावा केल्या. तीन विकेट गेल्यानंतर कर्णधार शाहिदीने अष्टपैलू अजमतुल्लाह ओमरजई याच्यासोबत विजयी 111 धावांची भागिदारी केली.  हशमतुल्लाह शाहिदी याने 74 चेंडूमध्ये दोन चौकार आणि एका षटकाराच्या मदतीने 58 धावा केल्या. तर अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये 6 चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा केल्या.  दरम्यान, श्रीलंकाकडून दिलशान मदुशंका याने सुरुवातीलाच दोन विकेट घेतल्या. त्याशिवाय कसून रजिता याने एक विकेट घेतली. इतर एकाही गोलंदाजाला यश मिळाले नाही.   ","content":"Afghanistan vs Sri Lanka Full Match Highlights : आधी इंग्लंड, मग पाकिस्तान आणि आता श्रीलंका.... अफगाणिस्ताननं तीन बलाढ्य प्रतिस्पर्धी संघांवर विजय मिळवून यंदाचा विश्वचषक गाजवला आहे. पुण्यातल्या एमसीए स्टेडियमवरच्या सामन्यात अफगाणिस्ताननं श्रीलंकेचा सात विकेट्सनी धुव्वा उडवला. या सामन्यात अफगाणिस्तानच्या प्रभावी आक्रमणासमोर श्रीलंकेचा अख्खा डाव २४१ धावांत आटोपला होता. अफगाणिस्तानकडून फाझल हक फारुखीनं चार आणि मुजीब उर रहमाननं दोन फलंदाजांना माघारी धाडलं. अफगाणिस्तानचा रहमानउल्लाह गुरबाज भोपळाही फोडू शकला नाही. पण त्यानंतर अफगाणी फलंदाजांनी प्रत्येक विकेटसाठी भक्कम भागीदारी रचून आपल्या संघाच्या विजयावर शिक्कामोर्तब केलं. अफगाणिस्तानच्या इब्राहिम झादराननं ३९, रहमत शाहनं ६२, हशमत शाहिदीनं नाबाद ५८ आणि अझमत ओमरझाईनं नाबाद ७३ धावांची खेळी उभारली. अफगाणिस्ताननं तीन विजयांसह विश्वचषकाच्या गुणतालिकेत पाचव्या स्थानावर झेप घेतली आहे. तीन विजयासह अफगाणिस्तान संघाने सेमीफायनलचे आव्हान जिवंत ठेवलेय. पुढील तिन्ही सामन्यात अफगाणिस्तान संघाने विजय मिळवल्यास सेमीफायनलचे तिकिट मिळण्याची दाट शक्यता आहे. श्रीलंकेने प्रथम फलंदाजी करताना 241 धावांपर्यंत मजल मारली होती. अफगाणिस्तान संघाने हे आव्हान 45.2 षटकात अवघ्या तीन विकेटच्या मोबदल्यात पार केले. अफगानिस्तानसाठी रहमत शाह याने 62 धावा केल्या. तर कर्णधार हशमतुल्लाह शाहिदी याने 74 चेंडूत दोन चौकार आणि एका षटकाराच्या मदतीने नाबाद 58 धावा जोडल्या. अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये सहा चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा चोपल्या. या दोघांनी मॅच विनिंग 111 धावांची भागिदारी केली. श्रीलंकेने दिलेल्या 242 धावांच्या आव्हानाचा पाठलाग करताना अफगाणिस्तानची सुरुवात अतिशय खराब झाली. स्टार फलंदाज रहमानुल्लाह गुरबाज पहिल्याच षटकात खातेही न उघडता बाद झाला. पण त्यानंतर अफगाणिस्तानच्या इतर फलंदाजांनी विजयी खेळी केली. रहमत शाह आणि इब्राहिम जादरान यांनी दुसऱ्या विकेटसाठी 73 धावांचे योगदान दिलेय. दोघेही सहज धावा काढत होते, एकेरी दुहेरी धावसंख्येसोबत चौकार आणि षटकारांचा पाऊस पाडत होते. इब्राहिम जादरान याने 57 चेंडूत चार चौकार आणि एका षटकाराच्या मदतीने 39 धावा काढून बाद झाला. त्यानंतर रहमत शाह आणि कर्णधार हशमतुल्लाह शाहिदी यांनीही डाव सावरला. रहमत शाह याने 74 चेंडूमध्ये चार चौकार आणि एका षटकाराच्या मदतीने 62 धावा केल्या. तीन विकेट गेल्यानंतर कर्णधार शाहिदीने अष्टपैलू अजमतुल्लाह ओमरजई याच्यासोबत विजयी 111 धावांची भागिदारी केली. हशमतुल्लाह शाहिदी याने 74 चेंडूमध्ये दोन चौकार आणि एका षटकाराच्या मदतीने 58 धावा केल्या. तर अजमतुल्लाह ओमरजई याने 63 चेंडूमध्ये 6 चौकार आणि तीन षटकारांच्या मदतीने नाबाद 73 धावा केल्या. दरम्यान, श्रीलंकाकडून दिलशान मदुशंका याने सुरुवातीलाच दोन विकेट घेतल्या. त्याशिवाय कसून रजिता याने एक विकेट घेतली. इतर एकाही गोलंदाजाला यश मिळाले नाही. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); });","pubDate":"2023-10-30 17:20:57","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/a4ed6556df6bd74d8b2218e11bfcc0c81698685324529582_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"marathi"},{"article_id":"0539c23a4e9b75ae84b60f7d5267dda5","title":"WC 2023: शरणार्थी कैंप से 100वां मैच खेलने तक का सफर, मिलिए अफ़ग़ानिस्तान के सबसे कामयाब गेंदबाज राशिद खान से","link":"https://sports.ndtv.com/hindi/cricket/rashid-khan-journey-from-refugee-camp-to-playing-100th-match-afghanistan-most-successful-bowler-4529322#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Rashid Khan: एकदिवसीय मैचों में राशिद खान अफ़ग़ानिस्तान के लिए सबसे ज्यादा 100 मैचों में 179 विकेट लिए हैं. एक मैच में चार बार पांच विकेट और छह बार चार विकेट लिए हैं. सबसे तेज सौवाँ विकेट लेने के मामले में राशिद खान दूसरे स्थान पर हैं.","content":"Rashid Khan 2001 की बात है. अफ़ग़ानिस्तान से एक पति पत्नी अपने 11 बच्चों के साथ पाकिस्तान की ओर निकल पड़ा. उस समय अफ़ग़ानिस्तान में तालिबान और अमेरिका में लड़ाई चल रही थी. वहां रहना आसान नहीं था. इस परिवार को पाकिस्तान के एक शरणार्थी कैंप में शरण मिली. किसी ने शायद सोचा नहीं होगा कि शरणार्थी कैंप में पला-बढ़ा एक बच्चा एक दिन अफ़ग़ानिस्तान क्रिकेट को एक नयी उंचाई तक पहुंचाएगा. उसकी गिनती अफ़ग़ानिस्तान के बेहतरीन खिलाडियों में होगी और अन्तरराष्ट्रीय एकदिवसीय मैच खेलन में भी शतक बनाएगा. उसने अफ़ग़ानिस्तान के लिए एकदिवसीय मैचों में सबसे ज्यादा विकेट हासिल करने का रिकॉर्ड बनाया है. उसका नाम है राशिद खान है. आज वो अफ़ग़ानियों का सबसे चहेता खिलाड़ी है. आज वो अपने करियर का सौवें एकदिवसीय मैच खेल रहा है. अफ़ग़ानिस्तान जैसी छोटी टीम के लिए ये काफी बड़ी बात है. 20 सितम्बर 1998 को राशिद खान का जन्म अफ़ग़ानिस्तान के नंगरहार में हुआ. उस समय अफ़ग़ानिस्तान में तालिबान का शासन था. 2001 में अमेरिका ने तालिबान पर हमला किया. लोग अपनी जान बचाने के लिए भागने लगे. राशिद खान के पिता अपने 11 बच्चों के साथ पाकिस्तान के तरफ निकल पड़े और वहां एक शरणार्थी कैंप में रहें. राशिद खान तब तीन साल के थे. राशिद खान पेशावर के गलिओं में क्रिकेट खेलने लगे. उन्हें ट्रेनिंग देने के लिए कोई नहीं था. इस टैलेंट को पहचाने के लिए कोई नहीं था. राशिद खान अपने घर में अपने भाईओं के साथ क्रिकेट खेलते थे. घरवाले चाहते थे कि राशिद खान डॉक्टर बने. राशिद पढ़ाई में अच्छे थे. एक बार राशिद खान अपने परिवार को ना बताते हुए अपने दोस्त के साथ क्रिकेट मैच खेलने चले गए और बल्लेबाजी करते हुए उस मैच में 65 रन बना लिए. पहली बार राशिद खान हार्ड बॉल में क्रिकेट खेले. घर में टेप बॉल में खेलते थे. राशिद खान के अंदर आत्मविश्वास आने लगा. उन्हें लगा कि वे एक अच्छा क्रिकेटर बन सकते हैं. क्रिकेट के प्रति उनका प्यार बढ़ते गया. धीरे धीरे राशिद खान अपने दोस्तों के साथ क्रिकेट खेलने लगे फिर घरेलु टीम में खेले. एक बार राशिद खान लाहौर में पाकिस्तान अंडर 19 खिलाफ मैच खेल रहे थे. इस मैच का सीधा प्रसारण टीवी में हो रहा था. राशिद खान के परिवार लोग इस मैच को देख रहे थे. राशिद खान ने इस मैच में 60 रन बनाये. परिवार लोग खुश हो गए और उन्हें लगने लगा कि राशिद खान एक अच्छा खिलाड़ी बन सकते हैं फिर राशिद खान को क्रिकेट खेलने के लिए परमिशन दे दिए. राशिद खान अनिल कुंबले और शाहिद अफरीदी को अपना आइडल मानते हैं. दोनों की गेंदबाजी को देखते हुए अपने गेंदबाजी में सुधार लाये और एक अच्छा गेंदबाज बन गए. राशिद खान को सचिन तेंदुलकर की बल्लेबाजी पसंद है. 2015 में राशिद खान की चयन अफ़ग़ानिस्तान टीम में हुई. 18 अक्टूबर 2015 को राशिद खान अपने का करियर पहला एकदिवसीय मैच ज़िम्बाब्वे के खिलाफ खेला. इस मैच में राशिद ने 8 रन बनाए थे और एक विकेट लिए थे. एकदिवसीय मैचों में राशिद खान अफ़ग़ानिस्तान के लिए सबसे ज्यादा 100 मैचों में 179 विकेट लिए हैं. एक मैच में चार बार पांच विकेट और छह बार चार विकेट लिए हैं. सबसे तेज सौवाँ विकेट लेने के मामले में राशिद खान दूसरे स्थान पर हैं. राशिद खान अपना 44 वां मैच में अपना सौवां विकेट हासिल किये थे. इस मामले में नेपाल के संदीप लामिछाने पहले स्थान पर हैं जो अपने 42वां मैच में सौवाँ विकेट लिए थे. 2017 में सनराइजर्स हैदराबाद ने राशिद खान को 4 करोड़ 30 लाख में खरीदा. इस सीजन में राशिद खान ने हैदराबाद के लिए 17 विकेट लिए थे. 2018 में सनराइजर्स हैदराबाद ने राशिद खान को 9 करोड़ में खरीदा था. 2017 के आईपीएल में शानदार प्रदर्शन के बाद CPL में गयाना अमेजन वॉरियर्स के लिए खेलना शुरू किए और अपने करियर का पहला हैट्रिक लेने में कामयाब हुए. 2018 में एडिलेड स्ट्राइकर्स से जुड़े. इस तरह राशिद खान अलग अलग देशों की फ्रैंचाइजी के साथ जुड़ते गए. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-30 16:48:46","image_url":"https://c.ndtvimg.com/2021-10/p5m0fcv_afghanistan-team-afp_625x300_31_October_21.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"f2ceaf8bc9236f377d4fa8d250fae9d8","title":"Iconic Sri Lankan cricket team supporter ‘Uncle’ Percy Abeysekera passes away","link":"https://www.tribuneindia.com/news/sports/iconic-sri-lankan-cricket-team-supporter-uncle-percy-abeysekera-passes-away-557916","keywords":null,"creator":null,"video_url":null,"description":"Colombo, October 30Percy Abeysekera, the iconic flag-waving, quick-witted supporter of the Sri Lankan cricket team, passed away after a battle with prolonged illness here on Monday.The 87-year-old Abeysekera, who was fondly called as Uncle Percy by fans and cricketers alike, was a constant presence on cricket grounds across the world where his country played.Abeysekera, known for his colourful dressing, began his travels to cheer for the Lankan cricket team from the 1979 World Cup and since then he attended all major cricketing events except the on-going World Cup owing to poor health.His friendship with leading Lankan cricketers like Arjuna Ranatunga, Sanath Jayasuriya and Kumar Sangakkara made him an unavoidable figure in the country's cricketing landscape.Abeysekera also shared cordial relationship with Indian cricketers like MS Dhoni, Virat Kohli and Rohit Sharma. Rohit had visited Abeysekera at his home in Colombo during the recent Asia Cup.Kohli had invited Abeysekera to the Indian dressing room for a short interaction during the tour to Sri Lanka in 2015.However, Abeysekera's health was not at its best over the last year and the Sri Lanka Cricket had recently given him LKR 5 million to meet his medical expenses.","content":"PTI Colombo, October 30 Percy Abeysekera, the iconic flag-waving, quick-witted supporter of the Sri Lankan cricket team, passed away after a battle with prolonged illness here on Monday. The 87-year-old Abeysekera, who was fondly called as Uncle Percy by fans and cricketers alike, was a constant presence on cricket grounds across the world where his country played. Abeysekera, known for his colourful dressing, began his travels to cheer for the Lankan cricket team from the 1979 World Cup and since then he attended all major cricketing events except the on-going World Cup owing to poor health. His friendship with leading Lankan cricketers like Arjuna Ranatunga, Sanath Jayasuriya and Kumar Sangakkara made him an unavoidable figure in the country’s cricketing landscape. Abeysekera also shared cordial relationship with Indian cricketers like MS Dhoni, Virat Kohli and Rohit Sharma. Rohit had visited Abeysekera at his home in Colombo during the recent Asia Cup. Kohli had invited Abeysekera to the Indian dressing room for a short interaction during the tour to Sri Lanka in 2015. However, Abeysekera’s health was not at its best over the last year and the Sri Lanka Cricket had recently given him LKR 5 million to meet his medical expenses. #Cricket","pubDate":"2023-10-30 16:40:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/10/2023_10$largeimg_1435764438.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"ec055f4a1b82c29d3cdd465cd3bed5e0","title":"AFG Vs SL: વર્લ્ડકપ 2023માં અફઘાનિસ્તાનની ત્રીજી જીત, શ્રીલંકાને 7 વિકેટથી આપી હાર","link":"https://gujarati.abplive.com/sports/cricket/odi-world-cup-2023-afghanistan-won-by-7-wickets-against-sri-lanka-match-highlights-mca-stadium-863448","keywords":["ક્રિકેટ"],"creator":["એબીપી અસ્મિતા વેબ ટીમ"],"video_url":null,"description":"ICC ODI World Cup 2023 Afghanistan vs Sri Lanka 2023 Highlights:  ODI વર્લ્ડ કપ 2023ની 30મી મેચમાં અફઘાનિસ્તાને શ્રીલંકાને હરાવ્યું છે. પૂણેના મહારાષ્ટ્ર ક્રિકેટ એસોસિએશન સ્ટેડિયમ ખાતે પ્રથમ બેટિંગ કરતા શ્રીલંકાએ 241 રન બનાવ્યા હતા અને અફઘાનિસ્તાને ત્રણ વિકેટ ગુમાવીને લક્ષ્ય હાંસલ કરી લીધો હતો. હાર સાથે શ્રીલંકા માટે આગળનો રસ્તો મુશ્કેલ બની ગયો છે. ઈંગ્લેન્ડ અને પાકિસ્તાન બાદ અફઘાનિસ્તાને પણ શ્રીલંકાને હરાવ્યું છે. જીત સાથે અફઘાનિસ્તાન પોઇન્ટ ટેબલમાં પાંચમાં ક્રમે આવી ગયું છે.","content":"ICC ODI World Cup 2023 Afghanistan vs Sri Lanka 2023 Highlights: ODI વર્લ્ડ કપ 2023ની 30મી મેચમાં અફઘાનિસ્તાને શ્રીલંકાને હરાવ્યું છે. પૂણેના મહારાષ્ટ્ર ક્રિકેટ એસોસિએશન સ્ટેડિયમ ખાતે પ્રથમ બેટિંગ કરતા શ્રીલંકાએ 241 રન બનાવ્યા હતા અને અફઘાનિસ્તાને ત્રણ વિકેટ ગુમાવીને લક્ષ્ય હાંસલ કરી લીધો હતો. હાર સાથે શ્રીલંકા માટે આગળનો રસ્તો મુશ્કેલ બની ગયો છે. ઈંગ્લેન્ડ અને પાકિસ્તાન બાદ અફઘાનિસ્તાને પણ શ્રીલંકાને હરાવ્યું છે. જીત સાથે અફઘાનિસ્તાન પોઇન્ટ ટેબલમાં પાંચમાં ક્રમે આવી ગયું છે. શ્રીલંકાએ પ્રથમ બેટિંગ કરતા 49.3 ઓવરમાં 241 રન બનાવી ઓલઆઉટ થયું હતું. નિસાંકાએ સૌથી વધુ 46 રન બનાવ્યા હતા. કુસલ મેંડિસે 39, સમરવિક્રામાએ 36, મહેશ તીક્ષ્ણાએ 29 રનનું યોગદાન આપ્યું હતું. અફઘાનિસ્તાન તરફથી ફારૂકીએ 34 રનમાં 4 વિકેટ, મુજીબે 38 રનમાં 2 વિકેટ, રાશિદ ખાને 50 રનમાં 1 વિકેટ ઝડપી હતી. અફઘાનિસ્તાને 242 રનના ટાર્ગેટને 45.2 ઓવરમાં 3 વિકેટ ગુમાવી પાર પાડ્યો હતો. ગુરબાઝ ખાતું ખોલાવી શક્યો નહોતો. ઝરદાને 39 અને રહમત શાહે 62 રન બનાવ્યા હતા. શાહીદી 58 રન અને ઓમરઝઇ 73 રન બનાવી નોટ આઉટ રહ્યા હતા. Afghanistan continue their charge towards a top-four finish in #CWC23 with a stupendous win in Pune 👊 #AFGvSL 📝: https://t.co/f6KGeAIahL pic.twitter.com/cCmw8unwDy — ICC (@ICC) October 30, 2023 વન ડે વર્લ્ડ કપમાં અફઘાનિસ્તાની જીત googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); સ્કોટલેન્ડને 1 વિકેટથી હરાવ્યું, ડ્યુનેડિન, 2015 ઇંગ્લેન્ડને 69 રનથી હરાવ્યું, દિલ્હી, 2023 પાકિસ્તાનને 8 વિકેટે હરાવ્યું, ચેન્નાઈ, 2023 શ્રીલંકાને 7 વિકેટે હરાવ્યું, પુણે, 2023 વન ડે વર્લ્ડ કપમાં અફઘાનિસ્તાન વિ શ્રીલંકા 2015 - શ્રીલંકા 4 વિકેટે જીત્યું 2019 - શ્રીલંકા 34 રને જીત્યું 2023 - અફઘાનિસ્તાન 7 વિકેટે જીત્યું વિશ્વ કપમાં સૌથી વધુ મેચો હારનારી ટીમ અફઘાનિસ્તાન સામે હાર સાથે જ શ્રીલંકાના નામે એક શરમજનક રેકોર્ડ પણ નોંધાયો છે. શ્રીલંકા વન ડે વર્લ્ડકપમાં સૌથી વધુ મેચ હારનારી ટીમ બની ગઈ છે. 43 - શ્રીલંકા 42 - ઝિમ્બાબ્વે 37 - ઈંગ્લેન્ડ 36 - પાકિસ્તાન 35 - ન્યુઝીલેન્ડ 35 - વેસ્ટ ઈન્ડિઝ વર્લ્ડ કપમાં અફઘાનિસ્તાન માટે સૌથી મોટી ભાગીદારી (કોઈપણ વિકેટ) 133 - ઇકરામ અલીખિલ અને રહેમત શાહ વિ. WI, લીડ્ઝ, 2019 (2જી) 130 - ઈબ્રાહિમ ઝદરાન અને આર ગુરબાઝ વિરુદ્ધ PAK, ચેન્નાઈ, 2023 (1 લી) 121 - અઝમતુલ્લા ઓમરઝાઈ અને એચ શાહિદી વિ IND, દિલ્હી, 2023 (4થી) 114 - ઈબ્રાહિમ ઝદરાન અને રહેમાનુલ્લા ગુરબાઝ વિરુદ્ધ ENG, દિલ્હી, 2023 (1 લી) 111* - અઝમતુલ્લા ઓમરઝાઈ અને એચ શાહિદી વિ SL, પુણે, 2023 (4થી) 𝐖𝐡𝐚𝐭 𝐚 𝐖𝐢𝐧! 🙌 #AfghanAtalan , banking on an incredible all-round performance, beat @OfficialSLC by 7 wickets to register their third victory at the ICC Men's Cricket World Cup 2023. 👏 Congratulations to the whole Afghan Nation! 😍 #CWC23 | #AFGvSL | #WarzaMaidanGata pic.twitter.com/KEMcySenBd — Afghanistan Cricket Board (@ACBofficials) October 30, 2023","pubDate":"2023-10-30 16:36:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/e1237396bb08c37765d65b96af3969ba169868378652476_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"9433d8c1614c806b63b19bf21d9a8594","title":"AFG vs SL: Afghanistan spark semi-final hopes after 7-wicket win in Pune","link":"https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-sri-lanka-score-pune-azmat-hashmat-fazalhaq-points-table-semifinal-hopes-2455813-2023-10-30?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"AFG vs SL: Afghanistan spark semi-final hopes after 7-wicket win in Pune","content":null,"pubDate":"2023-10-30 16:29:58","image_url":null,"source_id":"indiatoday","source_priority":2885,"country":["india"],"category":["sports"],"language":"english"}]}