{"newsArray":[{"title":"Benzema tears Chelsea apart with a *real* perfect hat-trick","link":"https://www.football365.com/news/benzema-tears-chelsea-apart-real-madrid-perfect-hat-trick","keywords":["Chelsea","F365 Features","F365 Says","Front Page","Home Page","champions league","Karim Benzema"],"creator":["Dave Tickner"],"video_url":null,"description":"Two great headers and a comical … The post Benzema tears Chelsea apart with a *real* perfect hat-trick appeared first on Football365.","content":"Karim Benzema was the spearhead of a majestic Real Madrid display against a suddenly out-of-sorts Chelsea. The 13-time champions stormed Stamford Bridge to place one foot firmly in the semi-finals.   People often talk of “perfect hat-tricks”, by which they – quite wrongly – mean one comprising a goal scored with each of the head, left foot and right foot. Then there are “German hat-tricks”, which (to my mind needlessly) place extra restrictions on what counts as a proper hat-trick by insisting they must be three consecutive goals scored within the same half. The logical extension of those twin daftnesses is the Perfect German hat-trick. Left-footed, right-footed and headed goals scored without any other goals or a half-time whistle interrupting. At this point you’re raising the difficulty tariff to something approaching cricket’s version of the achievement. But it’s all tish and fipsy. Because the perfect hat-trick was scored tonight at Stamford Bridge by Karim Benzema. Two brilliant goals and a comical one is definitely the best kind of hat-trick. It was also his second consecutive hat-trick in the competition having turned the PSG tie on its head in the last 16. Having emerged from Cristiano Ronaldo’s shadows to become indisputably Real Madrid’s main man he is on Ballon d’Or-winning form right now. More importantly, it’s potentially Champions League-winning form. His first two goals were magnificent, both absurdly difficult and very different headers sent arcing beyond a despairing Edouard Mendy. Key to both, beyond Benzema’s exemplary movement and finishing, was the quality of delivery. The first was created by the equally excellent Vinicius Junior, whose pacy delivery from the left allowed Benzema to get enough on the ball to find the top corner from a good 14 yards out. Then Luka Modric – the second former Spurs schemer to have a lovely old time at Stamford Bridge this week – curled in a beauty from the right which Benzema almost just let hit him on the head and rebound back inside the post. It was reminiscent of a couple of goals at the old White Hart Lane, actually. One scored against Spurs by Edin Dzeko, one by Harry Kane against Arsenal a few years later. But it was better than both, marked out by the freakish apparent effortlessness of it all. It was surely the greatest header anyone at Stamford Bridge had seen for, ooh, a good three minutes. Chelsea at this point were also, it should be noted, a shambles. Madrid’s midfield three had seized full control of the pitch and both Vinicius and Benzema had more than served notice of their threat before the goals came. Chelsea, four days after an embarrassing defeat to Brentford, were being overrun again. Real Madrid are very much like Brentford in many ways. Yet they still got to half-time with a foothold. Kai Havertz – once again proving himself Chelsea’s man for the big occasion – pulled one back with a fine headed goal of his own. Definitely the best headed goal to be only the third best headed goal of the half. FACT. Thomas Tuchel looked to grab the lifeline with significant half-time changes. Off went Andreas Christensen to spare him any more torment from Vinicius. More contentiously but also perfectly understandably based on the evidence of the 45 minutes that had just gone, so too did N’Golo Kante. On came Mateo Kovacic and Hakim Ziyech. This was bold stuff, and it was to Tuchel’s credit that he saw Havertz’s goal before the break as an opportunity but not vindication. Maybe those changes could have turned the tie back in Chelsea’s favour. We’ll never know, because then came the calamity Chelsea’s play had threatened. Mendy left a routine short pass to Antonio Rudiger short. Rudiger, already on a booking, didn’t commit to tackling the onrushing Real Madrid player which was, of course, Benzema and the rest was a formality. Two great goals, one stupid one, and Benzema became only the fourth player to score consecutive Champions League hat-tricks, joining Luiz Adriano and the two you’ve already guessed. That was already more than enough narrative and action for one night, but there was still time for more. Romelu Lukaku came on and touched the ball four times. Two of those touches were headers from which he really should have scored to at least reduce Chelsea’s deficit and offer a slim chance of pulling something out of the fire in Madrid. The contrast from Benzema’s first-half masterclass could not have been more stark. The elite striker at the peak of his powers, and the one struggling desperately to relocate his spark. The post Benzema tears Chelsea apart with a *real* perfect hat-trick appeared first on Football365.","pubDate":"2022-04-06 21:50:59","image_url":null,"source_id":"football365","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cummins smashes equal fastest IPL fifty!","link":"https://www.cairnspost.com.au/sport/cricket/cummins-smashes-equal-fastest-ipl-fifty/video/00a64bd0edccec3adc5ee5c2cc40f621","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Pat Cummins has equalled the fastest ever fifty in the IPL, stunning the crowd with a half century off 14 balls.","content":null,"pubDate":"2022-04-06 21:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"KKR vs MI highlights Hotstar: Yesterday IPL match Pat Cummins batting score","link":"https://thesportsrush.com/cricket-news-kkr-vs-mi-highlights-hotstar-yesterday-ipl-match-pat-cummins-batting-score/","keywords":["Cricket","IPL 2022","KKR","Mumbai Indians","Videos","Indian Premier League","Kolkata Knight riders","MI","Pat Cummins"],"creator":["Dixit Bhargav"],"video_url":null,"description":"KKR vs MI highlights: The Australian Test captain commenced his Indian Premier League 2022 campaign with proper fireworks. If given a prediction poll before the Kolkata Knight Riders vs Mumbai Indians Indian Premier League 2022 match in Pune, fans would’ve voted for anything but fast bowler Pat Cummins registering the joint-fastest half-century in the history… The post KKR vs MI highlights Hotstar: Yesterday IPL match Pat Cummins batting score appeared first on The SportsRush.","content":"KKR vs MI highlights: The Australian Test captain commenced his Indian Premier League 2022 campaign with proper fireworks. If given a prediction poll before the Kolkata Knight Riders vs Mumbai Indians Indian Premier League 2022 match in Pune, fans would’ve voted for anything but fast bowler Pat Cummins registering the joint-fastest half-century in the history of the tournament. No slouch with the bat in hand, Cummins did have a couple of IPL half-centuries under his belt before this match. However, him commencing his sixth IPL season (fifth at KKR) with anything but a performance like his was beyond expectations. Coming in to bat at No. 7 in the 14th over of a 162-run chase, Cummins smashed MI’s bowlers to race his way to 56* (15) with the help of four fours and six sixes as KKR won the match in 16 overs. ALSO READ: Shah Rukh Khan in awe of Pat Cummins after he scores joint-fastest IPL half-century In 18 innings for Knight Riders, Cummins has scored 295 runs at an average and strike rate of 26.81 and 157.75 respectively. Cummins, who hasn’t scored a half-century in 43 T20 innings for other teams, has crossed the 50-run mark thrice for Knight Riders. As far as Indians are concerned, Cummins possesses quite a record against them scoring 160 runs with the help of 10 fours and 13 sixes at a strike rate of 186.04. KKR vs MI highlights Cummins, who hit four sixes and a couple of fours off Mumbai all-rounder Daniel Sams, collected a total of 35 runs off his third over as the left-arm pacer registered the third-worst over in the history of the IPL. I see Pat Cummins has been letting off some steam. — Melinda Farrell (@melindafarrell) April 6, 2022 A carnage in real terms, Cummins’ swashbuckling knock at the Maharashtra Cricket Association Stadium has entered the record books and will be remembered for a long time. Fans can watch the highlights of Cummins’ innings by clicking here and the highlights of the whole match by clicking here. The post KKR vs MI highlights Hotstar: Yesterday IPL match Pat Cummins batting score appeared first on The SportsRush.","pubDate":"2022-04-06 21:12:12","full_description":"KKR vs MI highlights: The Australian Test captain commenced his Indian Premier League 2022 campaign with proper fireworks. If given a prediction poll before the Kolkata Knight Riders vs Mumbai Indians Indian Premier League 2022 match in Pune, fans would’ve voted for anything but fast bowler Pat Cummins registering the joint-fastest half-century in the history of the tournament. No slouch with the bat in hand, Cummins did have a couple of IPL half-centuries under his belt before this match. However, him commencing his sixth IPL season (fifth at KKR) with anything but a performance like his was beyond expectations. Coming in to bat at No. 7 in the 14th over of a 162-run chase, Cummins smashed MI’s bowlers to race his way to 56* (15) with the help of four fours and six sixes as KKR won the match in 16 overs. ALSO READ: Shah Rukh Khan in awe of Pat Cummins after he scores joint-fastest IPL half-century In 18 innings for Knight Riders, Cummins has scored 295 runs at an average and strike rate of 26.81 and 157.75 respectively. Cummins, who hasn’t scored a half-century in 43 T20 innings for other teams, has crossed the 50-run mark thrice for Knight Riders. As far as Indians are concerned, Cummins possesses quite a record against them scoring 160 runs with the help of 10 fours and 13 sixes at a strike rate of 186.04. Cummins, who hit four sixes and a couple of fours off Mumbai all-rounder Daniel Sams, collected a total of 35 runs off his third over as the left-arm pacer registered the third-worst over in the history of the IPL. I see Pat Cummins has been letting off some steam. 👀 — Melinda Farrell (@melindafarrell) April 6, 2022 A carnage in real terms, Cummins’ swashbuckling knock at the Maharashtra Cricket Association Stadium has entered the record books and will be remembered for a long time. Fans can watch the highlights of Cummins’ innings by clicking here and the highlights of the whole match by clicking here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL most expensive over list: Most runs conceded by a bowler in one over in IPL","link":"https://thesportsrush.com/cricket-news-ipl-most-expensive-over-list-most-runs-conceded-by-a-bowler-in-one-over-in-ipl/","keywords":["Cricket","IPL 2022","KKR","Mumbai Indians","Daniel Sams","Indian Premier League","Kolkata Knight riders","MI","Pat Cummins"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IPL most expensive over: The all-rounder from Mumbai Indians leaked as many as 35 runs against Kolkata Knight Riders tonight. Mumbai Indians all-rounder Daniel Sams had a forgettable night where he picked bowling figures of 3-0-50-1 in a losing cause against Kolkata Knight Riders in Pune. Although not justifiable by any means, an economy rate… The post IPL most expensive over list: Most runs conceded by a bowler in one over in IPL appeared first on The SportsRush.","content":"IPL most expensive over: The all-rounder from Mumbai Indians leaked as many as 35 runs against Kolkata Knight Riders tonight. Mumbai Indians all-rounder Daniel Sams had a forgettable night where he picked bowling figures of 3-0-50-1 in a losing cause against Kolkata Knight Riders in Pune. Although not justifiable by any means, an economy rate of 16.66 isn’t a rarity in this format. Playing only his eighth match across third Indian Premier League season, Sams found himself being at the wrong end of his counterpart Pat Cummins scoring a joint-fastest IPL half-century. .@patcummins30 right now: #KKRvMI #IPL2022 pic.twitter.com/0IXQrH9UCF — Wasim Jaffer (@WasimJaffer14) April 6, 2022 Sams, who dismissed Knight Riders captain Shreyas Iyer and had given away just 15 runs in his first two overs, leaked as many as 35 runs in his third over as the opposition registered victory with four overs to spare. A clueless Sams was hit for four sixes and two fours in an over where he also conceded a couple of runs off a no-ball to register the third-worst over in the history of the tournament. Playing his first match of the season, Cummins had himself leaked 49 runs in his four-over spell despite picking crucial wickets of Ishan Kishan and Suryakumar Yadav in the first innings. However, the 28-year old player made amends and how in the second innings at the Maharashtra Cricket Association Stadium on Wednesday. IPL most expensive over list Runs Bowler Team Opposition Ground Year 37 Prasanth Parameshwaran Kochi Tuskera Kerala Royal Challengers Bangalore Bengaluru 2011 37 Harshal Patel Royal Challengers Bangalore Chennai Super Kings Mumbai 2021 35 Daniel Sams Mumbai Indians Kolkata Knight Riders Pune 2022 33 Ravi Bopara Punjab Kings Kolkata Knight Riders Kolkata 2010 33 Parwinder Awana Punjab Kings Chennai Super Kings Mumbai 2014 Sams’ maiden season with the most successful IPL team has seen him picking a lone wicket in three matches at an economy and strike rate of 12.63 and 66 respectively. Such second-rate numbers have it in them to force MI to hand a debut to either of Riley Meredith or Fabian Allen in their next match against Royal Challengers Bangalore on Saturday. Allen’s inclusion will also provide captain Rohit Sharma with a second spin-bowling option and a better big-hitter (than Sams). The post IPL most expensive over list: Most runs conceded by a bowler in one over in IPL appeared first on The SportsRush.","pubDate":"2022-04-06 20:28:51","full_description":"IPL most expensive over: The all-rounder from Mumbai Indians leaked as many as 35 runs against Kolkata Knight Riders tonight. Mumbai Indians all-rounder Daniel Sams had a forgettable night where he picked bowling figures of 3-0-50-1 in a losing cause against Kolkata Knight Riders in Pune. Although not justifiable by any means, an economy rate of 16.66 isn’t a rarity in this format. Playing only his eighth match across third Indian Premier League season, Sams found himself being at the wrong end of his counterpart Pat Cummins scoring a joint-fastest IPL half-century . . @patcummins30 right now: #KKRvMI #IPL2022 pic.twitter.com/0IXQrH9UCF — Wasim Jaffer (@WasimJaffer14) April 6, 2022 Sams, who dismissed Knight Riders captain Shreyas Iyer and had given away just 15 runs in his first two overs, leaked as many as 35 runs in his third over as the opposition registered victory with four overs to spare. A clueless Sams was hit for four sixes and two fours in an over where he also conceded a couple of runs off a no-ball to register the third-worst over in the history of the tournament. Playing his first match of the season, Cummins had himself leaked 49 runs in his four-over spell despite picking crucial wickets of Ishan Kishan and Suryakumar Yadav in the first innings. However, the 28-year old player made amends and how in the second innings at the Maharashtra Cricket Association Stadium on Wednesday. Sams’ maiden season with the most successful IPL team has seen him picking a lone wicket in three matches at an economy and strike rate of 12.63 and 66 respectively. Such second-rate numbers have it in them to force MI to hand a debut to either of Riley Meredith or Fabian Allen in their next match against Royal Challengers Bangalore on Saturday. Allen’s inclusion will also provide captain Rohit Sharma with a second spin-bowling option and a better big-hitter (than Sams).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘Odd decision’: Channel 9 snub misses the mark","link":"https://www.cairnspost.com.au/sport/cricket/odd-decision-cricket-australia-boss-questions-channel-9s-world-cup-snub/news-story/e5a3ad7d1c49cd514a311ae2d80302f4","keywords":["Cricket news and galleries","Kayo","Sport news and galleries","Womens Cricket"],"creator":null,"video_url":null,"description":"Cricket Australia chief executive Nick Hockley has questioned Channel 9’s “odd decision” not to broadcast the Women’s Cricket World Cup in New Zealand.","content":null,"pubDate":"2022-04-06 20:07:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“‘PAT’ DIYE CHAKKE”: Shah Rukh Khan expresses awe of Pat Cummins after he smashes fastest fifty in IPL vs Mumbai Indians","link":"https://thesportsrush.com/cricket-news-pat-diye-chakke-shah-rukh-khan-expresses-awe-of-pat-cummins-after-he-smashes-fastest-fifty-in-ipl-vs-mumbai-indians/","keywords":["Cricket","IPL 2022","KKR","Mumbai Indians","Indian Premier League","IPL","Kolkata Knight riders","MI","Pat Cummins"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shah Rukh Khan expresses awe of Pat Cummins after latter hits the fastest half-century in Indian Premier League history versus Mumbai Indians. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders (KKR) and Mumbai Indians (MI) at Maharashtra Cricket Association Stadium in Pune, a Pat Cummins… The post “‘PAT’ DIYE CHAKKE”: Shah Rukh Khan expresses awe of Pat Cummins after he smashes fastest fifty in IPL vs Mumbai Indians appeared first on The SportsRush.","content":"Shah Rukh Khan expresses awe of Pat Cummins after latter hits the fastest half-century in Indian Premier League history versus Mumbai Indians. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders (KKR) and Mumbai Indians (MI) at Maharashtra Cricket Association Stadium in Pune, a Pat Cummins whirlwind with the bat pinned down the MI bowlers to hand them their third consecutive loss of the ongoing season by 5 wickets. Chasing 161/4 posted by MI in the first innings, and with the ever-dangerous Andre Russell (11 off 5) back in the hut, the KKR fans’ would have hoped their opening batter Venkatesh Iyer (50* off 41) to see their team through with some contributions from the lower middle-order. However, returning from Pakistan shores after a successful tour, Australia Test skipper Pat Cummins, while playing his first match of the ongoing IPL, took the mantle upon himself, as he faced just 15 deliveries to tonk as many as 56 runs to leave the entire witnesses slack-jawed as he sealed the chase with 4 Overs to spare. ALSO READ: Pat Cummins IPL batting record for KKR Shah Rukh Khan expresses awe of Pat Cummins Expressing his joy akin the rest of the Knights, the KKR co-owner and Bollywood superstar Shah Rukh Khan took to his twitter handle to praise Cummins after he smashed the joint fastest half-century in IPL history in mere 14 deliveries. An explicably delighted Shah Rukh exclaimed that while he wished to dance like Andre Russell, he also wished to hug Cummins like the KKR team did after his innings which was glittered with 4 Fours and 6 Sixes. @patcummins30 I want to dance like Andre & hug u like the whole team did. Wow well done @KKRiders and what else is there to say!!!…’PAT’ DIYE CHAKKE!!! — Shah Rukh Khan (@iamsrk) April 6, 2022 The aforementioned fifty was Cummins’ third in IPL history. Interestingly, the 28-year-old had hit his maiden half-century against MI too during the 13th season of the league in 2020. His second fifty came against CSK last year, when he nearly chased down an improbable target after coming in to bat during the 12th Over. The post “‘PAT’ DIYE CHAKKE”: Shah Rukh Khan expresses awe of Pat Cummins after he smashes fastest fifty in IPL vs Mumbai Indians appeared first on The SportsRush.","pubDate":"2022-04-06 19:45:14","full_description":"Shah Rukh Khan expresses awe of Pat Cummins after latter hits the fastest half-century in Indian Premier League history versus Mumbai Indians. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders (KKR) and Mumbai Indians (MI) at Maharashtra Cricket Association Stadium in Pune, a Pat Cummins whirlwind with the bat pinned down the MI bowlers to hand them their third consecutive loss of the ongoing season by 5 wickets. Chasing 161/4 posted by MI in the first innings, and with the ever-dangerous Andre Russell (11 off 5) back in the hut, the KKR fans’ would have hoped their opening batter Venkatesh Iyer (50* off 41) to see their team through with some contributions from the lower middle-order. However, returning from Pakistan shores after a successful tour, Australia Test skipper Pat Cummins, while playing his first match of the ongoing IPL, took the mantle upon himself, as he faced just 15 deliveries to tonk as many as 56 runs to leave the entire witnesses slack-jawed as he sealed the chase with 4 Overs to spare. ALSO READ : Pat Cummins IPL batting record for KKR Expressing his joy akin the rest of the Knights, the KKR co-owner and Bollywood superstar Shah Rukh Khan took to his twitter handle to praise Cummins after he smashed the joint fastest half-century in IPL history in mere 14 deliveries. An explicably delighted Shah Rukh exclaimed that while he wished to dance like Andre Russell, he also wished to hug Cummins like the KKR team did after his innings which was glittered with 4 Fours and 6 Sixes. @patcummins30 I want to dance like Andre & hug u like the whole team did. Wow well done @KKRiders and what else is there to say!!!…’PAT’ DIYE CHAKKE!!! — Shah Rukh Khan (@iamsrk) April 6, 2022 The aforementioned fifty was Cummins’ third in IPL history. Interestingly, the 28-year-old had hit his maiden half-century against MI too during the 13th season of the league in 2020. His second fifty came against CSK last year , when he nearly chased down an improbable target after coming in to bat during the 12th Over.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Aawaaz badhao yaar uska thoda”: Irked Rohit Sharma asks Star Sports crew member to increase volume during presentation ceremony","link":"https://thesportsrush.com/cricket-news-aawaaz-badhao-yaar-uska-thoda-irked-rohit-sharma-asks-star-sports-crew-member-to-increase-volume-during-presentation-ceremony/","keywords":["Cricket","IPL 2022","KKR","Mumbai Indians","Indian Premier League","Kolkata Knight riders","MI","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma asks Star Sports: The captain of Mumbai Indians appeared to be annoyed after team’s third consecutive loss. Kolkata Knight Riders fast bowler Pat Cummins’ joint-fastest IPL half-century was “hard to digest” for a dejected Mumbai Indians captain Rohit Sharma. While Sharma credited Cummins for his third T20 half-century, he admitted that he “never… The post “Aawaaz badhao yaar uska thoda”: Irked Rohit Sharma asks Star Sports crew member to increase volume during presentation ceremony appeared first on The SportsRush.","content":"Rohit Sharma asks Star Sports: The captain of Mumbai Indians appeared to be annoyed after team’s third consecutive loss. Kolkata Knight Riders fast bowler Pat Cummins’ joint-fastest IPL half-century was “hard to digest” for a dejected Mumbai Indians captain Rohit Sharma. While Sharma credited Cummins for his third T20 half-century, he admitted that he “never expected” the Australian Test captain to bat in the game-changing way he did in the recently concluded 14th match of the ongoing 15th season of the Indian Premier League in Pune. “Never expected him [Pat Cummins] to come and play like that. Lot of credit. The pitch got better and better to bat as the game went on. It was holding up initially. “This will be hard to digest, the way it turned out in the last few overs. We have a lot of hard work ahead of us,” Sharma told Star Sports during the post-match presentation ceremony after losing their third consecutive match this season. Cummins, 28, walked out to bat at No. 7 ahead of Sunil Narine when his team needed 61 runs off 41 balls to win the match. A single-handed effort saw the right-handed batter hitting four fours and six sixes at a mind-blowing strike rate of 373.33 to seal the chase in 16 overs. Rohit Sharma asks Star Sports crew member to increase volume during presentation ceremony Sharma believed that they “had the game” till the 15th over but a “brilliant” Cummins turned the tables by hitting as many as 35 runs in one Daniel Sams over. Indians, who have somehow managed to earn the reputation of “slow-starters”, have been able to win a title (in 2015) in spite of losing their first four league phase matches. Sharma, however, wasn’t too pleased with this idea. “I don’t want to be in this position all the time,” an annoyed Sharma mentioned on being asked about a poor start to the season. Sharma’s annoyance was quite visible from his tone before the start of the presentation ceremony. With losing captains not having the privilege of a host standing in front of them, Sharma had asked a crew member, belonging to broadcaster Star Sports, to increase the volume of commentator. “Aawaaz badhao yaar uska thoda [Increase the volume],” an irked Sharma was heard right before the presentation ceremony commenced at the Maharashtra Cricket Association Stadium tonight. Me at every party when my favourite song starts playing.#TATAIPL2022 #KKRHaiTaiyaar #MI @ImRo45 pic.twitter.com/mm7PUVT7XP — Saurav Chakraborty (@saurav_MUFC_98) April 6, 2022 Mumbai will next face an in-form Royal Challengers Bangalore on April 9 at the same venue. The post “Aawaaz badhao yaar uska thoda”: Irked Rohit Sharma asks Star Sports crew member to increase volume during presentation ceremony appeared first on The SportsRush.","pubDate":"2022-04-06 19:23:11","full_description":"Rohit Sharma asks Star Sports: The captain of Mumbai Indians appeared to be annoyed after team’s third consecutive loss. Kolkata Knight Riders fast bowler Pat Cummins’ joint-fastest IPL half-century was “hard to digest” for a dejected Mumbai Indians captain Rohit Sharma. While Sharma credited Cummins for his third T20 half-century , he admitted that he “never expected” the Australian Test captain to bat in the game-changing way he did in the recently concluded 14th match of the ongoing 15th season of the Indian Premier League in Pune. “Never expected him [Pat Cummins] to come and play like that. Lot of credit. The pitch got better and better to bat as the game went on. It was holding up initially. “This will be hard to digest, the way it turned out in the last few overs. We have a lot of hard work ahead of us,” Sharma told Star Sports during the post-match presentation ceremony after losing their third consecutive match this season. Cummins, 28, walked out to bat at No. 7 ahead of Sunil Narine when his team needed 61 runs off 41 balls to win the match. A single-handed effort saw the right-handed batter hitting four fours and six sixes at a mind-blowing strike rate of 373.33 to seal the chase in 16 overs. Sharma believed that they “had the game” till the 15th over but a “brilliant” Cummins turned the tables by hitting as many as 35 runs in one Daniel Sams over. Indians, who have somehow managed to earn the reputation of “slow-starters”, have been able to win a title (in 2015) in spite of losing their first four league phase matches. Sharma, however, wasn’t too pleased with this idea. “I don’t want to be in this position all the time,” an annoyed Sharma mentioned on being asked about a poor start to the season. Sharma’s annoyance was quite visible from his tone before the start of the presentation ceremony. With losing captains not having the privilege of a host standing in front of them, Sharma had asked a crew member, belonging to broadcaster Star Sports, to increase the volume of commentator. “ Aawaaz badhao yaar uska thoda [Increase the volume],” an irked Sharma was heard right before the presentation ceremony commenced at the Maharashtra Cricket Association Stadium tonight. Me at every party when my favourite song starts playing. #TATAIPL2022 #KKRHaiTaiyaar #MI @ImRo45 pic.twitter.com/mm7PUVT7XP — Saurav Chakraborty (@saurav_MUFC_98) April 6, 2022 Mumbai will next face an in-form Royal Challengers Bangalore on April 9 at the same venue.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Is Pat Cummins all rounder: Pat Cummins KKR IPL batting stats and records","link":"https://thesportsrush.com/cricket-news-is-pat-cummins-all-rounder-pat-cummins-kkr-ipl-batting-stats-and-records/","keywords":["Cricket","IPL 2022","KKR","Indian Premier League","IPL","Kolkata Knight riders","Pat Cummins"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Is Pat Cummins all rounder: The Australian Test captain began his IPL 2022 season with a scintillating knock against the Mumbai Indians. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders (KKR) and Mumbai Indians (MI) at Maharashtra Cricket Association Stadium in Pune, Pat Cummins stole… The post Is Pat Cummins all rounder: Pat Cummins KKR IPL batting stats and records appeared first on The SportsRush.","content":"Is Pat Cummins all rounder: The Australian Test captain began his IPL 2022 season with a scintillating knock against the Mumbai Indians. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders (KKR) and Mumbai Indians (MI) at Maharashtra Cricket Association Stadium in Pune, Pat Cummins stole the show with a breathtaking half-century to decimate the Mumbai Indians (MI) by 5 wickets. Chasing 161/4 posted by MI in the first innings, KKR needed another 61 runs in less than 7 Overs, with the destructive Windies all-rounder Andre Russell (11 off 5) back in the hut. While it looked like KKR’s hopes lasted solely on their opening batter Venkatesh Iyer (50* off 41) form here on, the Australian Test skipper Pat Cummins (56* off 15), playing his first match in the ongoing season after his successful tour of Pakistan, left everyone slack-jawed with a 14-ball half-century, to snatch the match from MI’s and Rohit Sharma’s grasp, and chase down the total with 4 Overs to spare. WHAT. A. KNOCK #KKRHaiTaiyaar #KKRvMI #IPL2022pic.twitter.com/RmLZjZdzl3 — KolkataKnightRiders (@KKRiders) April 6, 2022 Is Pat Cummins all rounder Basically roped in as a bowler by the KKR think-tank, Cummins, courtesy of today’s knock with the bat, registered the joint-fastest half-century in IPL history, equalling KL Rahul’s record of 50 off 14 deliveries for Punjab Kings (then Kings XI Punjab) against Delhi Capitals in the year 2018 at Mohali. Moreover, him smashing 35 runs off Daniel Sams during the 16th Over of the chase is the second-most expensive Over in the history of the tournament. While the 28-year-old has no T20I fifty for Australia, this was his third half-century in the IPL, with the maiden one coming against MI as well during the 2020 edition. Pat Cummins KKR IPL batting stats and records Overall, in the IPL, Pat Cummins has batted in a total of 27 innings (38 matches), and has scored 372 runs at an average of 23.25, while striking at 155.00, with the help of three half-centuries. While he smashed the joint-fastest in IPL history versus MI today, his strike rate of 373.33 during the innings which was laden with 4 Fours and 6 Sixes, is also the 5th highest ever in an IPL innings. The post Is Pat Cummins all rounder: Pat Cummins KKR IPL batting stats and records appeared first on The SportsRush.","pubDate":"2022-04-06 18:26:50","full_description":"Is Pat Cummins all rounder: The Australian Test captain began his IPL 2022 season with a scintillating knock against the Mumbai Indians. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders (KKR) and Mumbai Indians (MI) at Maharashtra Cricket Association Stadium in Pune, Pat Cummins stole the show with a breathtaking half-century to decimate the Mumbai Indians (MI) by 5 wickets. Chasing 161/4 posted by MI in the first innings, KKR needed another 61 runs in less than 7 Overs, with the destructive Windies all-rounder Andre Russell (11 off 5) back in the hut. While it looked like KKR’s hopes lasted solely on their opening batter Venkatesh Iyer (50* off 41) form here on, the Australian Test skipper Pat Cummins (56* off 15), playing his first match in the ongoing season after his successful tour of Pakistan, left everyone slack-jawed with a 14-ball half-century, to snatch the match from MI’s and Rohit Sharma’s grasp, and chase down the total with 4 Overs to spare. WHAT. A. KNOCK 🔥 #KKRHaiTaiyaar #KKRvMI #IPL2022 pic.twitter.com/RmLZjZdzl3 — KolkataKnightRiders (@KKRiders) April 6, 2022 Basically roped in as a bowler by the KKR think-tank, Cummins, courtesy of today’s knock with the bat, registered the joint-fastest half-century in IPL history, equalling KL Rahul’s record of 50 off 14 deliveries for Punjab Kings (then Kings XI Punjab) against Delhi Capitals in the year 2018 at Mohali. Moreover, him smashing 35 runs off Daniel Sams during the 16th Over of the chase is the second-most expensive Over in the history of the tournament. While the 28-year-old has no T20I fifty for Australia, this was his third half-century in the IPL , with the maiden one coming against MI as well during the 2020 edition. Overall, in the IPL, Pat Cummins has batted in a total of 27 innings (38 matches), and has scored 372 runs at an average of 23.25, while striking at 155.00, with the help of three half-centuries. For the Kolkata Knight Riders (KKR), the Aussie pacer has scored 295 runs across 18 innings (26 matches) from IPL seasons 2014-2022*, at an average and strike-rate of 26.81 and 157.75 respectively. While he smashed the joint-fastest in IPL history versus MI today, his strike rate of 373.33 during the innings which was laden with 4 Fours and 6 Sixes, is also the 5th highest ever in an IPL innings.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bryce Jackson wins prestigious Allan Edwards Trophy, Shayne Wornes named in Male Team of the Year","link":"https://thewest.com.au/news/albany-advertiser/bryce-jackson-wins-prestigious-allan-edwards-trophy-shayne-wornes-named-in-male-team-of-the-year--c-6351546","keywords":null,"creator":["Calvin Sims"],"video_url":null,"description":"The Allan Edwards Trophy is awarded to the most promising up and coming cricketer who is a good citizen and observes the spirit of cricket.","content":null,"pubDate":"2022-04-06 18:00:00","image_url":"https://images.thewest.com.au/publication/C-6351546/2c67f112f24798434b28d1588e28149f16313ffc-16x9-x0y198w1489h838.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stellar season rewarded as Williams star Rodney Ford named A-grade Cricketer of the Year in UGSCA","link":"https://thewest.com.au/news/narrogin-observer/stellar-season-rewarded-as-williams-star-rodney-ford-named-a-grade-cricketer-of-the-year-in-ugsca--c-6339092","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"Wrap of the Upper Great Southern Cricket Association 2021-22 award winners.","content":null,"pubDate":"2022-04-06 18:00:00","image_url":"https://images.thewest.com.au/publication/C-6339092/59273d89a8f511c2d2c9321bba965c5f2aa3483e-16x9-x0y270w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Stellar season rewarded as Williams star Rodney Ford named A-grade Cricketer of the Year in UGSCA","link":"https://thewest.com.au/news/narrogin-observer/stellar-season-rewarded-as-williams-star-rodney-ford-named-a-grade-cricketer-of-the-year-in-ugsca--c-6339092","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"Wrap of the Upper Great Southern Cricket Association 2021-22 award winners.","content":null,"pubDate":"2022-04-06 18:00:00","image_url":"https://images.thewest.com.au/publication/C-6339092/59273d89a8f511c2d2c9321bba965c5f2aa3483e-16x9-x0y270w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-16-20-updates-2867355","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 17:53:57","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848842290924458.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Sorry vada pav cheen liya”: Virender Sehwag tweets hilariously as Pat Cummins scores Fastest 50 of IPL to thump Mumbai Indians","link":"https://thesportsrush.com/cricket-news-sorry-vada-pav-cheen-liya-virender-sehwag-tweets-hilariously-as-pat-cummins-scores-fastest-50-of-ipl-to-thump-mumbai-indians/","keywords":["Cricket","IPL 2022","KKR","Mumbai Indians","Indian Premier League","Kolkata Knight riders","MI","Pat Cummins","Virender Sehwag"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Fastest 50 of IPL: The Australian Test captain raced his way to a third T20 half-century in a winning cause tonight. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Mumbai Indians in Pune, Kolkata Knight Riders beat Mumbai Indians by 5 wickets to reach… The post “Sorry vada pav cheen liya”: Virender Sehwag tweets hilariously as Pat Cummins scores Fastest 50 of IPL to thump Mumbai Indians appeared first on The SportsRush.","content":"Fastest 50 of IPL: The Australian Test captain raced his way to a third T20 half-century in a winning cause tonight. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Mumbai Indians in Pune, Kolkata Knight Riders beat Mumbai Indians by 5 wickets to reach the top of the points table with three victories under their belt. Chasing a 162-run target on a trickier surface, Kolkata were reduced to 101/5 needing 61 runs to win 41 deliveries. Still the favourites on the back of their all-rounders, no one would’ve thought of them sealing the chase within the next 17 balls. Playing his first match of the season, Australia Test captain Pat Cummins not just scored but thumped the opposition with his third T20 half-century. Batting ahead of Sunil Narine at No. 7, Cummins hit four fours and six sixes to score 56* (15) at an unbelievable strike rate of 373.33.   Twitter reactions on Fastest 50 of IPL by Pat Cummins: Moonh se nivala cheen liya ,, sorry vada pav cheen liya. Pat Cummins, one of the most insane display of clean hitting , 15 ball 56 … Jeera Batti #MIvKKR pic.twitter.com/Npi2TybgP9 — Virender Sehwag (@virendersehwag) April 6, 2022 Too early to say innings of the ipl ??? Jaw dropping !! #IPL2022 #KKRvMI — Rohan Gavaskar (@rohangava9) April 6, 2022 The IPL can leave you befuddled and bamboozled. Discombobulated. Pat Cummins smacking 56 off 15!!!!!!!!!!!!!!!!!!! — Bharath Ramaraj (@Fancricket12) April 6, 2022 I began to compose a Tweet on Cummins and before I could complete, he went from 11 off 3 balls to 46 off 13. — KSR (@KShriniwasRao) April 6, 2022 For more cricket-related news, click here. The post “Sorry vada pav cheen liya”: Virender Sehwag tweets hilariously as Pat Cummins scores Fastest 50 of IPL to thump Mumbai Indians appeared first on The SportsRush.","pubDate":"2022-04-06 17:51:02","full_description":"Fastest 50 of IPL: The Australian Test captain raced his way to a third T20 half-century in a winning cause tonight. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Mumbai Indians in Pune, Kolkata Knight Riders beat Mumbai Indians by 5 wickets to reach the top of the points table with three victories under their belt. Chasing a 162-run target on a trickier surface, Kolkata were reduced to 101/5 needing 61 runs to win 41 deliveries. Still the favourites primarily due to their all-rounders, no one would’ve thought of them sealing the chase within the next 17 balls. Playing his first match of the season, Australia Test captain Pat Cummins not just scored but thumped the opposition with his third T20 half-century. Batting ahead of Sunil Narine at No. 7, Cummins hit four fours and six sixes to score 56* (15) at an unbelievable strike rate of 373.33. Facing fast bowler Tymal Mills, Cummins hit the second and third deliveries he faced for a six and four respectively to get going. In the following over bowled by Jasprit Bumrah, Cummins hit another six and four to bring down the equation to KKR needing 35 runs off 30 balls. Cummins then assaulted a fellow Australian in Daniel Sams to hit the remaining 35 runs in the 16th over. Cummins, who had scored a couple of half-centuries for Knight Riders in the past, equaled Lucknow Super Giants captain KL Rahul’s record of fastest IPL half-century . A hard-hitting innings, among the best played in the history of the IPL, Cummins allured astonishing reactions from one and all including former India batter Virender Sehwag. Taking to his social media platform Twitter handle, Sehwag hilariously tweeted about how Cummins snatched a victory from the opposition’s jaws. Moonh se nivala cheen liya ,, sorry vada pav cheen liya. Pat Cummins, one of the most insane display of clean hitting , 15 ball 56 … Jeera Batti #MIvKKR pic.twitter.com/Npi2TybgP9 — Virender Sehwag (@virendersehwag) April 6, 2022 Too early to say innings of the ipl ??? Jaw dropping !! #IPL2022 #KKRvMI — Rohan Gavaskar (@rohangava9) April 6, 2022 The IPL can leave you befuddled and bamboozled. Discombobulated. Pat Cummins smacking 56 off 15!!!!!!!!!!!!!!!!!!! — Bharath Ramaraj (@Fancricket12) April 6, 2022 I began to compose a Tweet on Cummins and before I could complete, he went from 11 off 3 balls to 46 off 13. 😁 — KSR (@KShriniwasRao) April 6, 2022 For more cricket-related news, click here .","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-11-15-updates-2867289","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 17:08:00","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Kolkata Knight Riders, chasing a target of 162, are 133/5. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Mumbai Indians. Everything related to Kolkata Knight Riders and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Mumbai Indians live score. Do check for Kolkata Knight Riders vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) On middle, Pat drives it to deep mid-wicket for a single. 12 runs off the over. Kolkata need 35 runs in 30 balls. 14.5 overs (4 Runs) FOUR! Full ball, way outside off. Cummins stretches his hand and gets some part of his bat on it. Enough for it to beat the diving short third man fielder and for a boundary. 14.4 overs (6 Runs) SIX! Bang! Cummins is playing a superb cameo here! This is full and on middle. Cummins hammers it over cow corner for a biggie. 14.3 overs (0 Run) Fullish and outside off, driven straight to cover. 14.2 overs (0 Run) A length ball, angling around off. Cummins hangs back and defends it out. 14.1 overs (1 Run) A length ball, slanting around off. Iyer looks to flick it but gets an inside edge onto the pads. It rolls to short third man for a single. That will be fifty for Venkatesh Iyer, he has an unfinished job and he knows it pretty well. Drinks! The game is still evenly poised here. But if Mumbai grabs another two wickets, they would be on top. For now, the required rate is not threatening Kolkata. However, they have been losing wickets at intervals. The equation is pretty simple, 47 runs are needed off 36 balls with 5 wickets in hand. 13.6 overs (4 Runs) FOUR! A length ball, outside off. Cummins plays it late and through backward point for a boundary. A good over for Kolkata despite a wicket. 13.5 overs (6 Runs) SIX! What a shot! A length ball, angling on the pads. Cummins flicks it all the way over square leg for a biggie. 13.4 overs (1 Run) Mills is the best in varying the pace at this time of the game. A slower ball, short and on middle. Iyer tries to hook but gets a leading edge and the ball drops safely at square leg. A single. 13.3 overs (2 Runs) Another top edge to this short ball but it goes well over the keeper. There is a bit of fumble there and the batters will get a couple. 13.2 overs (1 Run) Length and on off, pushed to the left of mid off for a single. Pat Cummins comes to the crease. 13.1 overs (0 Run) OUT! CAUGHT! No big show from Russell and this might just be the game for Mumbai! Mills with yet another brilliantly targeted short ball, on middle. Russell clears his front leg and looks to pull but gets his eyes off. He goes with the shot and manages a top edge, high in the air and to point where Dewald Brevis takes it with ease. Tymal Mills (2-0-24-1) comes back to bowl. 12.6 overs (0 Run) Bangs a short one, angling on middle, Iyer misses his pull. 12.5 overs (2 Runs) Around off, this is worked to deep point for a couple of runs. 12.4 overs (4 Runs) FOUR! Good shot! On a length and down the leg side. Iyer makes room for himself and pulls it to deep square leg for a boundary. 12.3 overs (1 Run) A slower ball, on a length and on middle. Russell is early as he pulls it to deep mid-wicket for a single. 12.2 overs (4 Runs) FOUR! Russell won't mind it how it comes, he just wants to clear the fence. Short of a length and on middle. Russell looks to pull but gets a top edge, over the keeper for a boundary. 12.1 overs (1 Run) A length ball, angling on middle. Iyer taps it to cover for a single. Jasprit Bumrah is back on! He went for two runs in his first over! 11.6 overs (6 Runs) SIX! Russell is off the mark in style! Tossed up, full and on middle. Russell gets low and powers it straight down the ground for a biggie. 11.5 overs (0 Run) Tossed up, on off. Russell looks to heave it but miscues it completely, back to Ashwin. Andre Russell comes to the crease now. 11.4 overs (0 Run) OUT! TAKEN! Another one bites the dust! This is short and on middle but on the slower side. Rana sees a short ball and thinks of clearing it away but does not create enough power. Hits it to deep mid-wicket where Sams takes an easy catch. 11.3 overs (0 Run) Tossed up, on middle. Rana leans and keeps it out. 11.2 overs (1 Run) Fuller, outside off, was the googly. Iyer skips down and guides it to deep point for a single. 11.1 overs (1 Run) A low full toss, on middle, swept to deep square leg for a single. 10.6 overs (1 Run) A slower short ball, on middle. Rana pulls it to deep mid-wicket. Brevis puts in a forward dive and collects it on a bounce. A single. 10.5 overs (6 Runs) SIX! Short and outside off. Rana upper-cuts it well over third man for a biggie. Hits to the shorter side and clears it easily. 10.4 overs (0 Run) Short of a length, outside off. Rana looks to ramp it away but misses. 10.3 overs (1 Run) On middle, pulled away to deep square leg for a single. 10.2 overs (2 Runs) Fuller ball, outside off. Iyer drives it hard and to covers where the fielder half-stops it but does well to slow the pace of the ball and the fielder in the deep will cut it off. Two runs taken. 10.1 overs (4 Runs) FOUR! Streaky! A full ball, angling on middle. Iyer looks to heave it but gets an inside edge to fine leg for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848814724315942.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-6-10-updates-2867237","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 16:54:22","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Kolkata Knight Riders, chasing a target of 162, are 73/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Mumbai Indians. Everything related to Kolkata Knight Riders and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Mumbai Indians live score. Do check for Kolkata Knight Riders vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) No run. Nitish Rana is the new man in. 9.5 overs (0 Run) OUT! CAUGHT! Mumbai strikes at the right time! Murugan Ashwin breaks the partnership! Kolkata lose their third wicket now. 9.4 overs (1 Run) Another googly, shorter ball, outside off. Venkatesh Iyer punches it towards sweeper cover for a single. 9.3 overs (6 Runs) SIX! KABOOM! A loopy delivery, full, around middle. Venkatesh Iyer gets down on his knee and sweeps it over deep square leg for a biggie! 9.2 overs (2 Runs) TWO LEG BYES! A huge shout for LBW, but the umpire says no! That was probably pitching outside. A fuller ball, spinning away from the left-hander, around middle. Venkatesh Iyer looks to reverse-sweep this but he misses. The ball deflects off his pads and goes towards third man. The batters steal two leg byes! One of the overthrow. 9.1 overs (1 Run) Fuller ball, down the leg side. Sam Billings sweeps it towards Jasprit Bumrah at short fine leg, who fumbles a bit and allows the batters to take a single. Drinks! A decent start for Mumbai but Kolkata are doing the repair work brilliantly. Billings is looking in fine form and will hope to continue further. Whichever team controls this middle phase will have a slight edge over their opposition. 105 needed in 66 balls. 8.6 overs (0 Run) Swing and a miss! On a length this time, outside off. Venkatesh Iyer tries to drive this, but he fails to get any bat on it. 8.5 overs (0 Run) Beaten! Tad shorter, outside off. Venkatesh Iyer hangs back and looks to push this away but he misses. 8.4 overs (1 Run) Pitches it up this time, outside off. Sam Billings drives it towards sweeper cover for a single. 8.3 overs (6 Runs) SIX! BANG! Back of a length, around middle. Sam Billings swivels and pulls it over deep square leg for a maximum. 8.2 overs (0 Run) On a length, outside off. Sam Billings taps it towards backward point. 8.1 overs (0 Run) Fuller delivery, around off. Sam Billings shows the full face of the bat and pushes it towards mid off. Basil Thampi is back on. 7.6 overs (0 Run) Much straighter now, onto the stumps, shorter ball. Venkatesh Iyer pushes it back to the bowler. 7.5 overs (1 Run) Slower through the air, full, around middle. Sam Billings sweeps it towards deep square leg. Sam Billings wanted a second run there, but he was sent back by Iyer. Single! 7.4 overs (6 Runs) SIX! High and handsome! A fuller ball, around middle. Sam Billings dances down the pitch, and tonks it high over long on for a biggie! 7.3 overs (1 Run) Shorter ball now, around middle. Venkatesh Iyer pulls it towards deep sqaure leg and rotates the strike. 7.2 overs (1 Run) Fuller this time, around middle. Sam Billings sweeps it towards deep square leg for a single. 7.1 overs (0 Run) Murugan Ashwin begins with a shortish ball, outside off. Sam Billings looks to cut this, but the ball goes off the under edge onto the deck and over the stumps. Murugan Ashwin is into the attack now. 6.6 overs (0 Run) Shorter now, outside off. Venkatesh Iyer pushes it towards cover. 6.5 overs (4 Runs) FOUR! Crunched! Another loopy delivery, full, around middle. Venkatesh Iyer gets down on his knee and sweeps it towards deep mid-wicket for a cracking boundary. 6.4 overs (1 Run) Tosses it up, full, around middle. Sam Billings advances down the pitch and knocks it to long on for a single. 6.3 overs (0 Run) Slower through the air, full, outside off. Sam Billings looks to reverse-sweeps it, but he misse.s 6.2 overs (1 Run) Fullish again, outside off. Venkatesh Iyer drives it towards cover for a single. 6.1 overs (0 Run) Fuller ball, around middle. Venkatesh Iyer defends it out. Sam Billings is the new man in. Also, Tilak Varma to bowl now. 5.6 overs (0 Run) OUT! CAUGHT! Daniel Sams strikes now! This is a big, big wicket! Shreyas Iyer departs for a timid score. A shorter ball, around middle. Shreyas Iyer swivels and pulls it, but he was a little late on his shot. The ball goes towards deep square leg where Tilak Varma grabs it safely. 5.5 overs (1 Run) Tad shorter, around middle. Venkatesh Iyer punches it towards cover for a single. 5.4 overs (4 Runs) FOUR! On a length, outside off. Venkatesh Iyer opens the face of the bat and guides it past point for a boundary. 5.3 overs (0 Run) Pitches it up now, outside off. Venkatesh Iyer drives it towards cover. 5.2 overs (4 Runs) FOUR! Edgy runs! A shorter ball, outside off. Venkatesh Iyer looks to pull this, but the ball goes off the top edge towards third man for a boundary. 5.1 overs (0 Run) Fuller delivery, around off. Venkatesh Iyer pushes it back to the bowler.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848806544677090.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Dewald Brevis family details: When Dewald Brevis admitted wearing AB de Villiers jersey made by mother","link":"https://thesportsrush.com/cricket-news-dewald-brevis-family-details-when-dewald-brevis-admitted-wearing-ab-de-villiers-jersey-made-by-mother/","keywords":["Cricket","IPL 2022","Mumbai Indians","Dewald Brevis","Indian Premier League","IPL","MI"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Dewald Brevis family details: The 18-year-old Proteas batter made his maiden appearance for the Mumbai Indians in the IPL. During the 14th match of the ongoing 15th season of the Indian Premier League at the MCA Stadium in Pune, Kolkata Knight Riders’ skipper Shreyas Iyer invited the Mumbai Indians to bat first post winning the… The post Dewald Brevis family details: When Dewald Brevis admitted wearing AB de Villiers jersey made by mother appeared first on The SportsRush.","content":"Dewald Brevis family details: The 18-year-old Proteas batter made his maiden appearance for the Mumbai Indians in the IPL. During the 14th match of the ongoing 15th season of the Indian Premier League at the MCA Stadium in Pune, Kolkata Knight Riders’ skipper Shreyas Iyer invited the Mumbai Indians to bat first post winning the Toss. MI skipper Rohit Sharma (3 off 12) was dismissed by Umesh Yadav after a scratchy start, as the latter was yet again bang on with his line and length as he has been in the tournament so far. Post Rohit’s dismissal, in came the teenage South African batting sensation Dewald Brewis, who got an opportunity to make his maiden appearance in the IPL, after he replaced Tim David in the playing 11 for the day. Staying true to his reputation, Brewis smashed a boundary off the second delivery of his innings with a lofted on-drive to announce his arrival in the world’s biggest franchise T20 tournament. While his innings lasted mere 19 deliveries, the 29 runs that he scored comprised of two Fours and a couple of Sixes as well. His no-look- six off Varun Chakaravarthy in the cow-corner region during the 8th Over, was the stand-out shot during his brief stint at the crease. Given his age, Brevis looks more “ABCD” than “ABD” right now But has the potential to cover A to Z. Keep an eye on that bat-speed. — KSR (@KShriniwasRao) April 6, 2022 Dewald Brevis family details A huge AB de Villiers fan, ‘Baby AB’, as Dewald Brevis is fondly known as, bears an unbelievable, uncanny resemblance with the former while coming up with some of his aggressive stroke play. The Cricketing fraternity took note of it during the 2022 ICC U19 World Cup, when some of his shots to spinners while shimming down the track, or his back foot punches through the cover region off the pacers strikingly resembled AB de Villiers’ style of batsmanship. One may call it co-incidence, as both Brevis and de Villiers (an even Faf du Plessis) have been schooled in the same educational institution – Affies (Afrikaanse Hoër Seunskool) in Pretoria, South Africa. Born on April 29, 2003 to Yolanda Brevis (mother) and Jack Brevis (father) in Johannesburg, Dewald used to play Cricket during his childhood days along with elder brother Reinart Brevis. Ahead of IPL 2022, the 18-year-old was roped in by MI at INR 3 Crore, after a brilliant run in the 2022 U19 World Cup, where he ended as the highest run-getter while also being adjudged the ‘Player of the tournament’. When Dewald Brevis wore the AB de Villiers jersey made by his mother With a dream to entertain the people like AB de Villiers has done over the years, Dewald Brevis has always considered de Villiers as one of his role-models growing up. His liking for the former Proteas superstar can be ascertained from the fact that he had even got his mother make him the ‘AB de Villiers shirt’ which he fondly used to wear. “AB de Villiers has always been one of my role-models; from a young age, growing up, I [used to] watch him play,” Brevis had exclaimed during an interaction with Cricket Fanatics Magazine last year. “I always wore my AB de Villiers shirt that my mother made for me. [I just love] the way he plays. He has a great mindset and he likes to entertain people. From a young age I was the same – I also wanted to entertain and put up a big show whenever I batted,” he further added. ALSO READ: When Dewald Brevis asked AB de Villiers to wear his jersey number The post Dewald Brevis family details: When Dewald Brevis admitted wearing AB de Villiers jersey made by mother appeared first on The SportsRush.","pubDate":"2022-04-06 16:22:48","full_description":"Dewald Brevis family details: The 18-year-old Proteas batter made his maiden appearance for the Mumbai Indians in the IPL. During the 14th match of the ongoing 15th season of the Indian Premier League at the MCA Stadium in Pune, Kolkata Knight Riders’ skipper Shreyas Iyer invited the Mumbai Indians to bat first post winning the Toss. MI skipper Rohit Sharma (3 off 12) was dismissed by Umesh Yadav after a scratchy start, as the latter was yet again bang on with his line and length as he has been in the tournament so far. Post Rohit’s dismissal, in came the teenage South African batting sensation Dewald Brewis, who got an opportunity to make his maiden appearance in the IPL, after he replaced Tim David in the playing 11 for the day. Staying true to his reputation, Brewis smashed a boundary off the second delivery of his innings with a lofted on-drive to announce his arrival in the world’s biggest franchise T20 tournament. While his innings lasted mere 19 deliveries, the 29 runs that he scored comprised of two Fours and a couple of Sixes as well. His no-look- six off Varun Chakaravarthy in the cow-corner region during the 8th Over, was the stand-out shot during his brief stint at the crease. Given his age, Brevis looks more “ABCD” than “ABD” right now But has the potential to cover A to Z. Keep an eye on that bat-speed. — KSR (@KShriniwasRao) April 6, 2022 A huge AB de Villiers fan, ‘Baby AB’, as Dewald Brevis is fondly known as, bears an unbelievable, uncanny resemblance with the former while coming up with some of his aggressive stroke play. The Cricketing fraternity took note of it during the 2022 ICC U19 World Cup, when some of his shots to spinners while shimming down the track, or his back foot punches through the cover region off the pacers strikingly resembled AB de Villiers’ style of batsmanship. One may call it co-incidence, as both Brevis and de Villiers (an even Faf du Plessis) have been schooled in the same educational institution – Affies (Afrikaanse Hoër Seunskool) in Pretoria, South Africa. Born on April 29, 2003 to Yolanda Brevis (mother) and Jack Brevis (father) in Johannesburg, Dewald used to play Cricket during his childhood days along with elder brother Reinart Brevis. Ahead of IPL 2022, the 18-year-old was roped in by MI at INR 3 Crore, after a brilliant run in the 2022 U19 World Cup, where he ended as the highest run-getter while also being adjudged the ‘Player of the tournament’ . With a dream to entertain the people like AB de Villiers has done over the years, Dewald Brevis has always considered de Villiers as one of his role-models growing up. His liking for the former Proteas superstar can be ascertained from the fact that he had even got his mother make him the ‘AB de Villiers shirt’ which he fondly used to wear. “AB de Villiers has always been one of my role-models; from a young age, growing up, I [used to] watch him play,” Brevis had exclaimed during an interaction with Cricket Fanatics Magazine last year. “I always wore my AB de Villiers shirt that my mother made for me. [I just love] the way he plays. He has a great mindset and he likes to entertain people. From a young age I was the same – I also wanted to entertain and put up a big show whenever I batted,” he further added. ALSO READ : When Dewald Brevis asked AB de Villiers to wear his jersey number","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-1-5-updates-2867177","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 16:05:59","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Kolkata Knight Riders, chasing a target of 162, are 30/1. The live updates of Kolkata Knight Riders vs Mumbai Indians scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Kolkata Knight Riders vs Mumbai Indians, Kolkata Knight Riders vs Mumbai Indians live score, Kolkata Knight Riders vs Mumbai Indians scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (2 Runs) On middle, this is hit to deep mid-wicket for a couple of runs. 4.5 overs (4 Runs) FOUR! DROPPED! Short of a length and angling down the leg side. Shreyas looks to pull but manages some gloves on it. The ball flies past the keeper, Kishan who dives to his left but it was just out of his reach. A boundary. 4.4 overs (0 Run) Short of a length and on off. Shreyas on his toes, drops it to covers. 4.3 overs (0 Run) On a length and on middle. Shreyas hops and blocks it. 4.2 overs (4 Runs) FOUR! Off the mark! A length ball, straight on the pads. Shreyas helps it away past short fine leg for a boundary. Shreyas Iyer, the skipper of Kolkata, comes to bat at number 3. 4.1 overs (0 Run) OUT! TAKEN! The pressure was building on Kolkata and something was bound to happen! Short and on middle. Rahane looks to pull but gets a top edge, in the air and to deep square leg where Daniel Sams reverse cups it. Tymal Mills comes into the attack. 3.6 overs (1 Run) Just two runs off the over! Touch fuller and outside off. Rahane opens the face of the bat and guides it softly to third man for a single. 3.5 overs (0 Run) Bumrah keeps it tight around off and on a length. Rahane steps down and looks to work it away but misses. 3.4 overs (0 Run) On a length and angling around off. Rahane steps across and defends it out. 3.3 overs (1 Run) Length and on off. Iyer dabs it late to third man for a single. 3.2 overs (0 Run) Fuller this time and much away from the batter. Iyer looks to drive and misses. Good start by Bumrah. 3.1 overs (0 Run) A length ball, outside off, angling across. Iyer looks to defend on the back foot but gets beaten on the outside edge. Jasprit Bumrah comes into the attack. 2.6 overs (1 Run) A full toss, on off. Iyer pushes it gently to mid off for a single. 2.5 overs (0 Run) Length ball, outside off. Iyer cuts it to point where Brevis dives to his right and stops it. 2.4 overs (0 Run) This one jags back in, length and on middle. Iyer gets cramped for the room and keeps it out on the deck. 2.3 overs (0 Run) Lovely delivery! On a length and just outside off, straightens off the deck. Iyer looks to defend but misses. 2.2 overs (4 Runs) FOUR! First boundary of the chase! A length ball, on middle. Iyer shuffles and paddles it over short fine leg for a boundary. 2.1 overs (0 Run) A length ball, outside off. Iyer looks to drive but misses. 1.6 overs (1 Run) Too full and on off. Iyer jams it out to covers and scampers across for a quick single. 1.5 overs (1 Run) Length and outside off, this is hit to third man for a run. 1.4 overs (0 Run) An appeal for LBW but there was a thick inside edge! A length ball, slanting around middle from around the wicket. Rahane looks to flick but gets an inside edge onto the pads. 1.3 overs (2 Runs) A length ball, outside off. Rahane steers it to deep backward point and will easily get a couple. 1.2 overs (1 Run) In the air and just short! A length ball, around middle. Iyer mistimes his pull to deep square leg where Brevis puts in a dive forward to catch it but the ball falls just short of him. A single. 1.1 overs (1 Run) Length and on off, pulled away to deep square leg for a single. Who will bowl from the other end? Daniel Sams it is! 0.6 over (0 Run) A length ball, angling on the pads. Iyer misses his tuck and gets hit on the pads. 0.5 over (0 Run) Fullish and on off, pushed to covers. 0.4 over (1 Run) A length ball, on middle. Rahane looks to work on the leg side but closes the face of the bat too early and gets a leading edge, aerially and to third man for a single. 0.3 over (1 Run) A length ball, on middle. Iyer pushes off the inner half of the bat to mid-wicket and takes a quick single. There was a direct-hit at the bowler's end but Iyer was well in. 0.2 over (1 Run) Length ball, on the pads. Rahane tucks it to square leg for a single. 0.1 over (0 Run) A length ball, around off and nips back in. Rahane looks to flick it but misses and gets hit on the pads. An appeal for LBW but it was too high.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848777503375748.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"AB de Villiers jersey number: When Baby AB Dewald Brevis asked AB de Villiers to wear his jersey number during their first meeting","link":"https://thesportsrush.com/cricket-news-ab-de-villiers-jersey-number-when-baby-ab-dewald-brevis-asked-ab-de-villiers-to-wear-his-jersey-number-during-their-first-meeting/","keywords":["Cricket","IPL 2022","AB de Villiers","Dewald Brevis","Indian Premier League","MI","Mumbai Indians"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Dewald Brevis asked AB de Villiers: The uncapped South African batter considers the former captain as his role model. Uncapped South Africa batter Dewald Brevis has justified his potential on his Indian Premier League debut tonight. Playing for Mumbai Indians in Pune, Brevis scored 29 (19) with the help of two eye-catching fours and sixes… The post AB de Villiers jersey number: When Baby AB Dewald Brevis asked AB de Villiers to wear his jersey number during their first meeting appeared first on The SportsRush.","content":"Dewald Brevis asked AB de Villiers: The uncapped South African batter considers the former captain as his role model. Uncapped South Africa batter Dewald Brevis has justified his potential on his Indian Premier League debut tonight. Playing for Mumbai Indians in Pune, Brevis scored 29 (19) with the help of two eye-catching fours and sixes each. Coming in to bat at No. 3 with Mumbai struggling at 6/1 after 17 deliveries, a confident, large-hearted and courageous innings from Brevis saw him leaving a long-lasting impression before being dismissed by Kolkata Knight Riders spinner Varun Chakravarthy. It is Brevis’ this shot-making ability which has forced fans to not just compare him with former South Africa captain AB de Villiers but also nickname him “Baby AB”. Not related to de Villiers by any means, it is Brevis’ sheer ability of playing innovative shots which has earned him this comparision. Having said that, 18-year old Brevis does consider de Villiers to be his “role model”. In an interview with Cricket Fanatics Magazine last year, Brevis had revealed sharing a fanboy moment with de Villiers. “It [first meeting] was an amazing experience – I was just stunned. I was just listening to all the stories he told and I was amazed,” Brevis had told Cricket Fanatics Magazine a year ago. Dewald Brevis asked AB de Villiers to wear his jersey number during their first meeting It is worth mentioning that Brevis studies in the same school (Afrikaanse Hoër Seunskool also known as Affies School) as former South Africa captains de Villiers and Faf du Plessis. de Villiers, who had announced retirement from international cricket almost four years ago, himself agreed with pass on his jersey number 17 to Brevis. Speaking about first-ever meeting with de Villiers at Affies, Brevis disclosed how seeking de Villiers’ permission regarding the jersey was at the top of his mind. “I met AB [AB de Villiers] for the first time at Affies and we sort of had a relationship since then. I asked him then if I could play with the no.17 [shirt] and he said ‘sure, play with it. That’s perfect’. “Growing up and having him as my role-model and being someone I really looked up to in the cricket world, the number 17 has always stood out to me,” he said, adding that he was speechless and “stunned” when he first met De Villiers at the time,” Brevis had said. The post AB de Villiers jersey number: When Baby AB Dewald Brevis asked AB de Villiers to wear his jersey number during their first meeting appeared first on The SportsRush.","pubDate":"2022-04-06 16:05:01","full_description":"Dewald Brevis asked AB de Villiers: The uncapped South African batter considers the former captain as his role model. Uncapped South Africa batter Dewald Brevis has justified his potential on his Indian Premier League debut tonight. Playing for Mumbai Indians in Pune, Brevis scored 29 (19) with the help of two eye-catching fours and sixes each. Coming in to bat at No. 3 with Mumbai struggling at 6/1 after 17 deliveries, a confident, large-hearted and courageous innings from Brevis saw him leaving a long-lasting impression before being dismissed by Kolkata Knight Riders spinner Varun Chakravarthy. It is Brevis’ this shot-making ability which has forced fans to not just compare him with former South Africa captain AB de Villiers but also nickname him “Baby AB”. Not related to de Villiers by any means, it is Brevis’ sheer ability of playing innovative shots which has earned him this comparision. Having said that, 18-year old Brevis does consider de Villiers to be his “role model”. In an interview with Cricket Fanatics Magazine last year, Brevis had revealed sharing a fanboy moment with de Villiers. “It [first meeting] was an amazing experience – I was just stunned. I was just listening to all the stories he told and I was amazed,” Brevis had told Cricket Fanatics Magazine a year ago. It is worth mentioning that Brevis studies in the same school (Afrikaanse Hoër Seunskool also known as Affies School) as former South Africa captains namely de Villiers and Faf du Plessis. de Villiers, who had announced retirement from international cricket almost four years ago, himself agreed to pass on his jersey number 17 to Brevis. Speaking about his first-ever meeting with de Villiers at Affies, Brevis disclosed how seeking de Villiers’ permission regarding the jersey was at the top of his mind. “I met AB [AB de Villiers] for the first time at Affies and we sort of had a relationship since then. I asked him then if I could play with the No. 17 [jersey] and he said ‘sure, play with it. That’s perfect’. “Growing up and having him as my role-model and being someone I really looked up to in the cricket world, the number 17 has always stood out to me,” Brevis had said then.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-16-20-updates-2867083","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 15:44:02","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, Mumbai Indians are 161/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Mumbai Indians. Everything related to Kolkata Knight Riders and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Mumbai Indians live score. Do check for Kolkata Knight Riders vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. We are back for the chase! ... THE RUN CHASE ... Right then! Kolkata need 162 runs to grab their third victory of the tournament. But so far the teams batting here first have won the game. Can Mumbai defend this total? We will find out. Stay tuned for the chase! Suryakumar Yadav is up for a chat. He says it looks like a good score and the pitch looks a bit sticky and feels there are enough runs for the bowlers to defend. Tells that he made some plans with Tilak Varma and it went perfectly for them. Adds that he wanted some time in the middle and he knew that after 15-16 balls, he will find his groove. He confidently says they will win it. Mentions there is not much dew and is excited to go out there again. Kolkata Knight Riders were on cue from the start. They grabbed an early wicket and gave away just 35 runs in the Powerplay. They kept things quiet up until the 14th over. But then it was all Mumbai from there! They leaked 76 runs in the last 5 overs and let the game skip away from them. Umesh Yadav one again was excellent, he grabbed a wicket and gave away just 25 runs in his spell. It is not going to be an easy chase for Kolkata here! After being asked to bat first, Mumbai have done a great job. They did not get the best of starts as their openers never found their rhythm. Rohit Sharma was the first one to depart. Dewald Brevis came in and played a fiery cameo but he failed to go on till the end. After losing Ishan Kishan it was Suryakumar Yadav and Tilak Varma who put together 83 runs and guided Mumbai over 130 runs. Kieron Pollard came in and smashed 22 runs in 5 balls, and helped Mumbai reach a total of 161! It's on to the bowlers now! From 55 for 3 in the 11th over to 161 at the end of the innings, it has been an exceptional recovery from Mumbai! They were struggling at one point but now they have put a fighting total on the board. Kolkata will be a tad disappointed after the start they got. 19.6 overs (6 Runs) SIX! Two sixes in a row! Full ball, outside off. Pollard swings hard again and makes his bat somehow to connect and the ball flies over third man for a maximum. 22 runs off 5 deliveries, Kieron Pollard! Mumbai end at 161 for 4. 19.5 overs (6 Runs) SIX! EDGE AND SIX! 150 up for Mumbai! Short of a length, outside off. Pollard looks to pull but gets a leading edge, well over the third man fence. 19.4 overs (2 Runs) Full ball, slower and around off. Pollard whacks it through square leg and the deep mid-wicket fielder comes across and keeps it down to two. 19.4 overs (1 Run) Wide! Full ball, way outside off. Pollard swings and misses. 19.3 overs (6 Runs) SIX! Powered! Valuable runs! Cummins misses his line slightly and serves it full and outside off. Pollard shuffles across and connects with all the power he has and hits it to long on for a biggie. No chance for the fielder there. 19.2 overs (2 Runs) NOT OUT! Another widish yorker, outside off. Pollard digs it out to long off and calls for the second run immediately. The fielder there throws it to Cummins who whips the bails off but the replay shows Varma made his ground with a superb dive. The bat was slightly in the air but down just in time. That is commitment. Is that a run out? There is a throw at the bowler's end. Tilak Varma dives to make his ground! He is safe. Kieron Pollard walks out to bat now. 19.1 overs (0 Run) OUT! CAUGHT BEHIND! A widish yorker, outside off. Yadav looks to smash it over covers but seems to miss it. There was a sound as the ball passed the bat there though. An appeal for a caught behind but nothing from the umpire. Kolkata take the review. UltraEdge shows a big spike and that will be the end of a superb knock from Suryakumar Yadav. 18.6 overs (0 Run) Bangs a short ball, around off. Varma tries to hook it but misses. 9 runs off the over. 18.5 overs (0 Run) Short of a length and on middle. Varma gets low and looks to ramp it over but played all over it. 18.4 overs (4 Runs) FOUR! Superb shot! A length ball, slanting outside off. Varma hammers it flat and over mid off for a boundary. 18.3 overs (0 Run) A slower short ball, on middle. Varma misses his pull. Only Sam Billings is appealing for a caught behind. Nothing there. 18.2 overs (1 Run) Very full and angling on leg. Yadav squeezes it out behind square on the leg side for a single. 18.1 overs (4 Runs) FOUR! A grand welcome for Suryakumar Yadav! Fifty for him, what a player for Mumbai! Short of a length and outside off. Yadav ramps it and clears short third man for a boundary. Andre Russell comes into the attack. 17.6 overs (1 Run) Leg bye! Shorter, quicker this time, outside off. Yadav looks to sweep it but misses. The keeper fumbles and the batters will get a leg bye, might have brushed the pads on its way. 17.5 overs (4 Runs) FOUR! Timing from Yadav, Exclusive! Short and outside off, slower as well. Yadav had all the time to cut this and hits it past the point fielder for a boundary. 17.4 overs (1 Run) Fuller, floated and outside off. Varma mistimes his heave to deep mid-wicket and the fielder there collects on a bounce. A single. 17.3 overs (1 Run) Narine stays away from the arc and serves it wide outside off. Yadav bottom edges it to short third man for a single. 17.2 overs (6 Runs) SIX! The sound it made off the blade! It came right off the middle of the bat! Tossed up, on off. Yadav slog-sweeps it high over cow corner for a maximum. How badly Mumbai missed Suryakumar Yadav! 17.1 overs (1 Run) Follows Varma on the leg side with a length ball and Varma works it to long on for a single. Sunil Narine (3-0-13-0) comes to the bowl his final over. 16.6 overs (4 Runs) FOUR! 17 off the over! Good back-to-back overs for Mumbai! Flighted, on a length and around off. Yadav steps across and paddles it the deep square leg fence. 16.5 overs (1 Run) Very full and nicely flighted, around off. Tilak pushes it to long off for a run. 16.4 overs (1 Run) Tossed up, full and outside off, might be the googly. Yadav looks to heave it but miscues it completely to deep square leg. A single. 16.3 overs (1 Run) Slightly short and on off, this is hit to deep mid-wicket for a single. 16.2 overs (4 Runs) FOUR! Clears the infield! Full ball, angling outside off. Varma makes room and goes over covers and bags a boundary. The stand between these two crosses the 50 mark now. 16.1 overs (6 Runs) SIX! Perfect start for Mumbai! Tossed up, full and on off. Varma gets low and slog-sweeps it over cow corner for a biggie. Varun Chakaravarthy (3-0-15-1) comes back into the attack. 15.6 overs (1 Run) Shorter and around off, slower again. Varma flat bats it to long on for a single. 13 coming off the over, just what Mumbai wanted. 15.5 overs (4 Runs) FOUR! Good shot! Touch fuller and around off. Varma goes deep in the crease and muscles it well wide of mid off for a boundary. 15.4 overs (1 Run) A length ball, on middle. Yadav rocks back and clears his front foot but mistimes his whip to deep square leg. A single. 15.3 overs (1 Run) Hits the length hard, around off, with lack of pace there, it is pulled away to deep mid-wicket for a single. 15.2 overs (0 Run) A length ball, outside off. Varma swings hard and misses. 15.1 overs (6 Runs) SIX! Improvisation and Mumbai need that at the moment! This is full and way outside off. Varma shuffles across and paddles it brilliantly to hit it all the way over fine leg for a biggie.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848764335459181.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Matchpoint Paradox: Cricket this week: A stellar Women's World Cup, Ross Taylor retires, IPL 2022 first impressions","link":"https://sportstar.thehindu.com/podcast/matchpoint-paradox-cricket-podcast-this-week-womens-world-cup-australia-india-women-ipl-2022-analysis-ross-taylor-retires-pakistan-internationals-host/article38469535.ece","keywords":null,"creator":["Amol Karhadkar"," Vijay Lokapally"," Shayan Acharya"],"video_url":null,"description":"In this episode of Matchpoint Paradox, Amol Karhadkar, Shayan Acharya and Vijay Lokapally look at the major developments in the world of cricket this week.","content":null,"pubDate":"2022-04-06 15:06:26","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-11-15-updates-2867004","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 14:55:52","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Mumbai Indians are 91/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Mumbai Indians. Everything related to Kolkata Knight Riders and Mumbai Indians match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Mumbai Indians live score. Do check for Kolkata Knight Riders vs Mumbai Indians scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (1 Run) 1 run. 14.5 overs (1 Run) Tosses it up, fuller delivery, around middle. Suryakumar Yadav clears his front foot and swipes it towards mid-wicket for a single. 14.4 overs (1 Run) Back of a length, around middle. Tilak Varma swivels and pulls it towards deep square leg for a single. 14.3 overs (1 Run) Much straighter this time, shorter ball, around middle. Suryakumar Yadav knocks it towards long on for a single. 14.2 overs (2 Runs) Quicker, flatter, outside off. Suryakumar Yadav lifts it over cover. Two taken! 14.1 overs (0 Run) Fuller ball, outside off. Suryakumar Yadav looks to sweep this, but he misses and gets rapped on the pads. Sunil Narine is back into the attack. 13.6 overs (1 Run) Another fuller length delivery, around off. Suryakumar Yadav drives uppishly past the bowler, towards mid off for a single. Dar was going down with his momentum so was a hard one to catch it. 13.5 overs (1 Run) Pitches it up again, outside off. Tilak Varma pushes it towards mid off and takes a single. 13.4 overs (1 Run) On a length, outside off. Suryakumar Yadav punches it towards cover for a single. 13.3 overs (4 Runs) FOUR! Lovely shot! Fuller ball again, outside off. Suryakumar Yadav sweeps it towards deep square leg for a boundary. 13.2 overs (1 Run) Shorter ball, around middle. Tilak Varma drags it with the inner half of his bat towards deep square leg for a single. 13.1 overs (0 Run) Fuller ball, darting it on the pads. Tilak Varma looks to flick this but he misses. Drinks! It is high time for Mumbai to change the gears now. Yadav is just finding his groove at the moment while Varma needs to help him and release some pressure. So far, it's all good for Kolkata and they would like to end the innings in the same way. Also, Rasikh Dar is back on. 12.6 overs (6 Runs) SIX! WOW! What a shot by Suryakumar Yadav! Umesh Yadav drops it short again, outside off. Suryakumar Yadav hops and upper cuts it over third man for a biggie! Good over for Mumbai! 12.5 overs (4 Runs) FOUR! Pulled away! A slower ball, short in length, around middle. Suryakumar Yadav waits for it and smashes it over deep mid-wicket for a boundary. 12.4 overs (1 Run) Fuller delivery, darting it on the pads. Tilak Varma flicks it towards fine leg for a single. 12.3 overs (0 Run) In the air.....and SAFE! Oh, dear! Kolkata have missed a golden opportunity there! A shorter ball, around middle. Tilak Varma pulls, but he gets a top edge high just behind the stumps. Sam Billings runs forward for the catch, but he leaves it for Ajinkya Rahane who runs from point to grab the ball. That has to be the keeper's catch there! Nothing wrong from Billings, Rahane called for it but misjudged it completely. 12.2 overs (1 Run) Back of a length, around middle. Suryakumar Yadav pulls it towards deep square leg. Single taken! 12.1 overs (1 Run) On a length, outside off. Tilak Varma taps it towards point and takes a quick single. 11.6 overs (0 Run) Back of a length, spinning in, on the pads. Suryakumar Yadav clears his front foot and tries to pull this but he misses and gets hit on his thigh pad. 11.5 overs (1 Run) Shorter ball, around middle and leg. Tilak Varma pushes it towards deep mid-wicket for a single. 11.4 overs (1 Run) Tosses it up, full, around the pads. Tilak Varma tucks it towards square leg and they take two runs. But, Tilak Varma has taken one short run. Single! 11.3 overs (0 Run) Tad shorter, outside off, quicker as well. Tilak Varma cuts it towards point. 11.2 overs (0 Run) Full again, around middle. Tilak Varma leans and blocks it out. 11.1 overs (1 Run) Fuller delivery, around middle. Suryakumar Yadav knocks it towards long on for a single. Tilak Varma comes in. 10.6 overs (0 Run) OUT! CAUGHT! Ishan Kishan's struggle at the crease ends! This over has just got a lot better for Pat Cummins! He grabs his first wicket of the match. Mumbai are three down now. A shorter ball, outside off. Ishan Kishan pulls this, but the ball goes off the inner half of the bat toward Shreyas Iyer at mid-wicket who pouches it safely. 10.5 overs (1 Run) Another length delivery, around middle. Suryakumar Yadav chips it over for a single. 10.4 overs (0 Run) On a length, outside off. Suryakumar Yadav taps it towards point. No run there! 10.3 overs (0 Run) And again! Good bowling by Pat Cummins! Back of a length, outside off. Suryakumar Yadav once again tries to cut this but he fails to get any bat on it. 10.2 overs (0 Run) Swing and a miss! Shorter ball now, width on offer. Suryakumar Yadav looks to cut this away but he misses. 10.1 overs (0 Run) A fuller ball, around middle. Suryakumar Yadav pushes it back to the bowler.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848735439825650.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-6-10-updates-2866933","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 14:50:08","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Mumbai Indians are 54/2. The live updates of Kolkata Knight Riders vs Mumbai Indians scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Kolkata Knight Riders vs Mumbai Indians, Kolkata Knight Riders vs Mumbai Indians live score, Kolkata Knight Riders vs Mumbai Indians scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (1 Run) Floated, full and on off. Yadav tucks it to deep mid-wicket for a run. 9.5 overs (1 Run) This is full and on middle. Kishan paddles it to deep backward square leg for a single. 9.4 overs (1 Run) Fuller ball, outside off. Yadav drives it to the right of cover where the fielder makes a half-stop and allows a single. 9.3 overs (0 Run) Full and outside off. Yadav pushes it straight to covers. 9.2 overs (1 Run) Tad short and on middle. Kishan hits it in front of square leg for one. 9.1 overs (1 Run) Quicker, flatter and comes with the angle, around off. Yadav pushes it through covers for a single. 50 up for Mumbai! Time-Out! Kolkata have been brilliant with the ball so far. They got rid of Rohit Sharma early and sent back Dewald Brevis as well, who was looking quite dangerous. Ishan Kishan has still not found his groove, but he will want to stick around with Suryakumar Yadav and put a big partnership. 8.6 overs (0 Run) Tossed up, on off. Kishan keeps it out to covers. 8.5 overs (0 Run) The pressure is building on Kishan here! Around off. Blocked out. 8.4 overs (1 Run) Flatter and around off. Yadav works it to long on for one. 8.3 overs (2 Runs) Fuller and on the pads. Yadav whips it to wide of long on and will come back for the second run. 8.2 overs (0 Run) A googly, around off. Yadav chops it to point. 8.1 overs (0 Run) Short, slower and outside off. Yadav dabs it to backward point but fails to get it past the fielder there. 7.6 overs (1 Run) Around off, pushed to long off and Yadav is off the mark with a single. Suryakumar Yadav comes to the crese now. 7.5 overs (0 Run) OUT! STUMPING! Good comeback from Varun Chakaravarthy after going for a six! A flighted ball, outside off, this one keeps low. Brevis goes for the slog-sweep but misses it completely. The keeper collects the ball and whips the bails off. Sam Billings was confident with the appeal and the replay shows Brevis dragged his back foot out and failed to come back inside the line. An easy decision for the third umpire and smart work from Sam Billings behind the stumps. Dewald Brevis's quick cameo comes to an end. Stumping chance! The replays roll in and confirm that Dewald Brevis fails to get his back foot in the crease on time! 7.4 overs (0 Run) Shorter again around middle. Brevis makes room and punches it to cover. No run there. 7.3 overs (0 Run) Quicker and outside off, on the shorter side. Brevis looks to cut it but misses. 7.2 overs (0 Run) Flatter and around off. Brevis slaps it hard but straight to cover. 7.1 overs (6 Runs) SIX! Brevis has a license to take on everyone here! Fuller and around off, a bit of flight and was the googly. Brevis flicks it with the turn and all the way over mid-wicket for a biggie. Varun Chakaravarthy comes to bowl. 6.6 overs (1 Run) Length ball, on middle. Dewald makes room and punches it to long on to end the over with a single. 6.5 overs (1 Run) On middle, it is tucked to deep mid-wicket for a single. 6.4 overs (0 Run) Floated, outside off. Kishan reaches to it and hits it to covers. Nice stop there. 6.3 overs (0 Run) Tossed up, full and outside off. Kishan smashes it back to the bowler. Narine does well to get a hand on it and stop the batters from stealing a single. 6.2 overs (1 Run) Flatter and outside off, cut away to deep point for a single. 6.1 overs (1 Run) Angles a full ball from round the wicket. Kishan drills it to long off for a single. Sunil Narine comes into the attack. 5.6 overs (6 Runs) SIX! Mumbai ending the Powerplay on a high! Not conventional but they will take it. A beautifully targeted short ball, on middle. Brevis looks to pull but gets a top edge and it goes all the way behind the keeper for a maximum. Mumbai are 35 for 1 at the end of the Powerplay! 5.5 overs (1 Run) Length ball, on middle, this one nips back in. Kishan gets cramped for the room and chops it to short third man for a single. 5.4 overs (4 Runs) FOUR! Muscled! This is on a length and outside off. Kishan flat bats it past the bowler and wide of mid on for a boundary. Much needed. 5.3 overs (0 Run) This is short and across, outside off, extra pace and bounce there. Kishan has a feel for it and misses. 5.2 overs (1 Run) A length ball, on middle. A flick of the wrists from Brevis to deep square leg for a single. 5.1 overs (0 Run) Short of a length and angling around off. Brevis punches it to covers.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848731996968281.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, KKR vs MI Live Score: Onus On Ishan Kishan, Dewald Brevis; Mumbai Indians 1 Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1ra3ItdnMtbWktbGl2ZS1zY29yZS11cGRhdGVzLWtvbGthdGEta25pZ2h0LXJpZGVycy12cy1tdW1iYWktaW5kaWFucy1saXZlLXNjb3JlLTI4NjY1ODnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, KKR vs MI Live Score: Onus On Ishan Kishan, Dewald Brevis; Mumbai Indians 1 Down  NDTV SportsMatch Preview - Mumbai vs KKR, Indian Premier League 2022, 14th Match  ESPNcricinfoKKR vs MI Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorChance for MI to make amends against a spirited KKR | Cricbuzz.com - Cricbuzz  CricbuzzLive match blog - Mumbai vs KKR 14th Match 2022 - Cricket Insights  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-04-06 14:36:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Junior AB de Villiers: Dewald Brevis AB de Villiers relationship","link":"https://thesportsrush.com/cricket-news-junior-ab-de-villiers-dewald-brevis-ab-de-villiers-relation/","keywords":["Cricket","IPL 2022","Mumbai Indians","Dewald Brevis","IPL","MI"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Junior AB de Villiers: The 18-year-old rose to fame after impressing one and all during the 2022 ICC U19 World Cup in West Indies. During the 14th match of the ongoing 15th season of the Indian Premier League at the Maharashtra Cricket Association Stadium in Pune, Kolkata Knight Riders (KKR) have won the Toss and… The post Junior AB de Villiers: Dewald Brevis AB de Villiers relationship appeared first on The SportsRush.","content":"Junior AB de Villiers: The 18-year-old rose to fame after impressing one and all during the 2022 ICC U19 World Cup in West Indies. During the 14th match of the ongoing 15th season of the Indian Premier League at the Maharashtra Cricket Association Stadium in Pune, Kolkata Knight Riders (KKR) have won the Toss and elected to field first against five-time IPL champions Mumbai Indians (MI). Continuing with his impressive display of seam bowling so far in the tournament, Umesh Yadav struck again in the Powerplay to dismiss MI skipper Rohit Sharma (3 off 12) in only his second Over. The wicket meant that it was now turn for the 18-year-old young sensation from South Africa, Dewald Brevis to walk in at no.3 in the batting order, with him making his debut appearance in the IPL. Junior AB de Villiers Seemed to be brimming with confidence, and possessing what they call the ‘nerves of steel’, Brevis smashed a boundary with a loft over mid-on to an inswinging delivery from Rasikh Salam, who himself is playing the first match of the ongoing season. “Dewald Brevis kab khelega??” #OneFamily #DilKholKe #MumbaiIndians #KKRvMI pic.twitter.com/cTGolSvDyp — Mumbai Indians (@mipaltan) April 6, 2022 Fort those unaware, the Proteas batter was the talking point of the Cricketing fraternity after he deservedly won the ‘Player of the tournament‘ award during the 2022 ICC U19 World Cup in West Indies. Bearing an uncanny resemblance with the legendary South African and former RCB batter AB de Villiers while coming up with some of his strokeplay, Brevis has fondly been named as Junior AB de Villiers by his well wishers and the Cricket fans. Amassing 506 runs at an average and strike rate of 84.33 and 90.19 respectively during the aforementioned World Cup, the 18-year-old was the highest run-scorer with most half-centuries (3), most hundreds (2), most fours (45) and most sixes (18) in the tournament. Dewald Brevis AB de Villiers relation Despite hailing from the same country, and bearing an unbelievable resemblance with de Villiers while batting, Dewald Brevis is not related to him in any way whatsoever. ALSO READ: “I am nowhere near what AB de Villiers was”- Dewald Brevis The post Junior AB de Villiers: Dewald Brevis AB de Villiers relationship appeared first on The SportsRush.","pubDate":"2022-04-06 14:35:32","full_description":"Junior AB de Villiers: The 18-year-old rose to fame after impressing one and all during the 2022 ICC U19 World Cup in West Indies. During the 14th match of the ongoing 15th season of the Indian Premier League at the Maharashtra Cricket Association Stadium in Pune, Kolkata Knight Riders (KKR) have won the Toss and elected to field first against five-time IPL champions Mumbai Indians (MI). Continuing with his impressive display of seam bowling so far in the tournament, Umesh Yadav struck again in the Powerplay to dismiss MI skipper Rohit Sharma (3 off 12) in only his second Over. The wicket meant that it was now turn for the 18-year-old young sensation from South Africa, Dewald Brevis to walk in at no.3 in the batting order, with him making his debut appearance in the IPL. Seemed to be brimming with confidence, and possessing what they call the ‘nerves of steel’, Brevis smashed a boundary with a loft over mid-on to an inswinging delivery from Rasikh Salam, who himself is playing the first match of the ongoing season. “Dewald Brevis kab khelega??” #OneFamily #DilKholKe #MumbaiIndians #KKRvMI pic.twitter.com/cTGolSvDyp — Mumbai Indians (@mipaltan) April 6, 2022 Fort those unaware, the Proteas batter was the talking point of the Cricketing fraternity after he deservedly won the ‘ Player of the tournament ‘ award during the 2022 ICC U19 World Cup in West Indies. Bearing an uncanny resemblance with the legendary South African and former RCB batter AB de Villiers while coming up with some of his strokeplay, Brevis has fondly been named as Junior AB de Villiers by his well wishers and the Cricket fans. Amassing 506 runs at an average and strike rate of 84.33 and 90.19 respectively during the aforementioned World Cup, the 18-year-old was the highest run-scorer with most half-centuries (3), most hundreds (2), most fours (45) and most sixes (18) in the tournament. Despite hailing from the same country, and bearing an unbelievable resemblance with de Villiers while batting, Dewald Brevis is not related to him in any way whatsoever. ALSO READ : “I am nowhere near what AB de Villiers was”- Dewald Brevis","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Mumbai Indians: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-mumbai-indians-live-score-over-match-14-t20-1-5-updates-2866784","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-06 14:03:46","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637848704186477085.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"From the Archives, 2000: Cronje’s cricket bribery scandal erupts","link":"https://www.smh.com.au/sport/cricket/from-the-archives-2000-cronje-s-cricket-bribery-scandal-erupts-20220315-p5a4v9.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"The South African cricket captain, Hansie Cronje, and three teammates were charged by New Delhi police with match-fixing during the recent one-day series against India.","content":null,"pubDate":"2022-04-06 14:00:00","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"From the Archives, 2000: Cronje’s cricket bribery scandal erupts","link":"https://www.theage.com.au/sport/cricket/from-the-archives-2000-cronje-s-cricket-bribery-scandal-erupts-20220315-p5a4v9.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"The South African cricket captain, Hansie Cronje, and three teammates were charged by New Delhi police with match-fixing during the recent one-day series against India.","content":null,"pubDate":"2022-04-06 14:00:00","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"Baby AB de Villiers name: AB de Villiers son name and Baby ABD Dewald Brevis stats","link":"https://thesportsrush.com/cricket-news-baby-ab-de-villiers-name-ab-de-villiers-son-name-and-baby-abd-dewald-brevis-stats/","keywords":["Cricket","IPL 2022","KKR","Mumbai Indians","Dewald Brevis","Indian Premier League","Kolkata Knight riders","MI","Suryakumar Yadav","Tim David"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Baby AB de Villiers name: Mumbai Indians have handed a debut to an uncapped 18-year old South African cricketer. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Mumbai Indians in Pune, Kolkata Knight Riders captain Shreyas Iyer has won the toss and chose to… The post Baby AB de Villiers name: AB de Villiers son name and Baby ABD Dewald Brevis stats appeared first on The SportsRush.","content":"Baby AB de Villiers name: Mumbai Indians have handed a debut to an uncapped 18-year old South African cricketer. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Mumbai Indians in Pune, Kolkata Knight Riders captain Shreyas Iyer has won the toss and chose to field. “We are gonna bowl first. We are comfortable chasing with a set target in mind. All the teams are equally good and we always have to take that winning mindset and try and back your abilities,” Iyer told Star Sports at the toss. Despite winning two out of their last three matches, Knight Riders have made a couple of changes to their Playing XI. While Australia Test captain Pat Cummins will be playing his first IPL 2022 match, uncapped India pacer Rasikh Salam will be making his debut for Kolkata tonight. “We got two changes. Pat Cummins comes in place of [Tim] Southee and Rasikh Salam comes in for Shivam Mavi. Southee was very supportive and we had a good conversation about the team changes,” Iyer added. Baby AB de Villiers name Mumbai Indians captain Rohit Sharma disclosed that he was looking to bat first at the Maharashtra Cricket Association Stadium tonight. Indians, who have developed a reputation of turning things around despite initial losses, are confident with respect to the remaining 12 matches of the league stage. “We were looking to bat first. We are not looking at what happened in the last two games. We have to play good cricket to win games and that is what we are prepared for. Looks like a good pitch,” Sharma told Star Sports at the toss. Much like KKR, MI have also made a couple of changes to their Playing XI bringing in batters Suryakumar Yadav and Dewald Brevis in place of Anmolpreet Singh and Tim David. Brevis, 18, is an exciting young talent who had won the Man of the Series in the ICC U-19 Cricket World Cup in West Indies earlier this year. Highest run-scorer in the tournament after amassing 506 runs at an average and strike rate of 84.33 and 90.19 respectively, Brevis had scored most half-centuries (3), most hundreds (2), most fours (45) and most sixes (18) in the tournament. “Dewald Brevis kab khelega??” #OneFamily #DilKholKe #MumbaiIndians #KKRvMI pic.twitter.com/cTGolSvDyp — Mumbai Indians (@mipaltan) April 6, 2022 Known to play innovative shots to all parts of a cricket ground, the uncapped South African batter is usually compared to former captain AB de Villiers. However, it is worth a mention that Brevis and de Villiers aren’t related by any means. de Villiers and wife Danielle de Villiers have two sons and a daughter but each one of them is quite young to play competitive cricket. The post Baby AB de Villiers name: AB de Villiers son name and Baby ABD Dewald Brevis stats appeared first on The SportsRush.","pubDate":"2022-04-06 13:53:43","full_description":"Baby AB de Villiers name: Mumbai Indians have handed a debut to an uncapped 18-year old South African cricketer. During the 14th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Mumbai Indians in Pune, Kolkata Knight Riders captain Shreyas Iyer has won the toss and chose to field. “We are gonna bowl first. We are comfortable chasing with a set target in mind. All the teams are equally good and we always have to take that winning mindset and try and back your abilities,” Iyer told Star Sports at the toss. Despite winning two out of their last three matches, Knight Riders have made a couple of changes to their Playing XI. While Australia Test captain Pat Cummins will be playing his first IPL 2022 match, uncapped India pacer Rasikh Salam will be making his debut for Kolkata tonight. “We got two changes. Pat Cummins comes in place of [Tim] Southee and Rasikh Salam comes in for Shivam Mavi. Southee was very supportive and we had a good conversation about the team changes,” Iyer added. Mumbai Indians captain Rohit Sharma disclosed that he was looking to bat first at the Maharashtra Cricket Association Stadium tonight. Indians, who have developed a reputation of turning things around despite initial losses, are confident with respect to the remaining 12 matches of the league stage. “We were looking to bat first. We are not looking at what happened in the last two games. We have to play good cricket to win games and that is what we are prepared for. Looks like a good pitch,” Sharma told Star Sports at the toss. Much like KKR, MI have also made a couple of changes to their Playing XI bringing in batters Suryakumar Yadav and Dewald Brevis in place of Anmolpreet Singh and Tim David. Brevis, 18, is an exciting young talent who had won the Man of the Series in the ICC U-19 Cricket World Cup in West Indies earlier this year. Highest run-scorer in the tournament after amassing 506 runs at an average and strike rate of 84.33 and 90.19 respectively, Brevis had scored most half-centuries (3), most hundreds (2), most fours (45) and most sixes (18) in the tournament. “Dewald Brevis kab khelega??” #OneFamily #DilKholKe #MumbaiIndians #KKRvMI pic.twitter.com/cTGolSvDyp — Mumbai Indians (@mipaltan) April 6, 2022 Known to play innovative shots to all parts of a cricket ground, the uncapped South African batter is usually compared to former captain AB de Villiers. However, it is worth a mention that Brevis and de Villiers aren’t related by any means. de Villiers and wife Danielle de Villiers have two sons and a daughter but each one of them is quite young to play competitive cricket. As far as Brevis’ competitive career is concerned, he has only played nine T20s as of now. In as many innings, the right-handed batter’s 207 runs have come at an average and strike rate of 25.87 and 125.45 respectively.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"From Mewat to Kolkata: Back story of a civil engineer-turned cricketer Shahbaz","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/from-mewat-to-kolkata-back-story-of-a-civil-engineer-turned-cricketer-shahbaz-becoming-a-royal-challenger/articleshow/90689343.cms","keywords":null,"creator":null,"video_url":null,"description":"Kolkata club coach Partha Pratim Chowdhury has witnessed hundreds of cricketers with dreamy eyes flocking the Maidans but never a young man with engineering books accompanying his cricket kits until Shahbaz Ahmed checked in. It was a bit of a novelty even for the middle-aged Chowdhury, associated with Kolkata's first division club Tapan Memorial.","content":null,"pubDate":"2022-04-06 13:40:40","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"County Championship Preview: Hampshire v Somerset - Somerset County Cricket Club","link":"https://news.google.com/__i/rss/rd/articles/CBMiY2h0dHBzOi8vd3d3LnNvbWVyc2V0Y291bnR5Y2MuY28udWsvbmV3cy9jbHViLW5ld3MvY291bnR5LWNoYW1waW9uc2hpcC1wcmV2aWV3LWhhbXBzaGlyZS12LXNvbWVyc2V0L9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"County Championship Preview: Hampshire v Somerset  Somerset County Cricket ClubCounty Championship 2022: Team-by-team guide to the new season  The TimesGlamorgan Cricket: Coach Matthew Maynard wants promotion fight  BBCCounty Championship 2022 season: All you need to know ahead of the start of the domestic summer  Sky SportsEssex vs Kent – Division One – Preview & Prediction | 2022 County Championship  The Stats ZoneView Full coverage on Google News","content":null,"pubDate":"2022-04-06 13:14:22","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"}]}