{"newsArray":[{"title":"Senior players return as PCB names squad for home NZ tour","link":"https://www.nation.com.pk/05-Apr-2023/senior-players-return-as-pcb-names-squad-for-home-nz-tour","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Senior players including the trio of captain Babar Azam, Muhammad Rizwan and Shaheen Shah Afridi returned as Pakistan Cricket Board (PCB) announced full-strength squads for home T20I and ODI series against New Zealand.","content":"LAHORE - Senior players including the trio of captain Babar Azam, Muhammad Rizwan and Shaheen Shah Afridi returned as Pakistan Cricket Board (PCB) announced full-strength squads for home T20I and ODI series against New Zealand. Shaheen had missed five Tests and three ODIs against England and New Zealand post the ICC Men’s T20 World Cup 2022 as he was completing his rehabilitation following a knee injury he had sustained during the first Test against Sri Lanka in Galle in July. He had subsequently missed the second Test against Sri Lanka, ODI series against the Netherlands, ACC Asia Cup in the UAE and the seven-match T20I series in Pakistan. The 22-year-old, who has taken 99 Test, 62 ODI and 58 T20I wickets, staged a remarkable comeback in the HBL Pakistan Super League 8 when he inspired Lahore Qalandars to become the first side to successfully defend the title. Not only that, Shaheen’s own performance was outstanding both with the bat and the ball – he scored 133 runs at a strike rate of 168.35 and grabbed 19 wickets at an economy rate of 9.13. He was rightly named captain of the Team of HBL PSL 2023. Apart from Shaheen, also returning to both the squads are Babar Azam, Fakhar Zaman, Haris Rauf and Muhammad Rizwan. All these players had rested for last month’s threeT20I series against Afghanistan in Sharjah. This means Babar Azam will resume his normal services as captain in the ODI and T20I series against New Zealand, while Shadab will return to his original position as vice-captain. Three young guns – Ihsanullah, Saim Ayub and Zaman Khan – have been retained in the T20I squad following stellar performances in Sharjah, while Ihsanullah has also been added to the ODI squad for the first time in his career. The squad will assemble in Lahore on 6 April where the training camp will commence on 7 April. RAWALPINDI TO HOST TWO ODIS AGAINST NEW ZEALAND The Pakistan Cricket Board (PCB) on Tuesday confirmed Rawalpindi, along with two T20Is and the first ODI, will also host the second ODI against New Zealand. The two ODIs will be played on 27 and 29 April instead of 26 and 30 April, respectively. Karachi, originally scheduled to hold four ODIs, will stage the last three ODIs.","pubDate":"2023-04-04 23:53:36","image_url":"https://www.nation.com.pk/print_images/large/2023-04-05/senior-players-return-as-pcb-names-squad-for-home-nz-tour-1680652411-8738.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ireland strike after making 214 in Bangladesh Test","link":"https://www.nation.com.pk/05-Apr-2023/ireland-strike-after-making-214-in-bangladesh-test","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Left-arm spinner Taijul Islam claimed 5-58 for Bangladesh on Tuesday to help bowl out Ireland for 214 but two early strikes left the one-off Dhaka Test in the balance.","content":"MIRPUR - Left-arm spinner Taijul Islam claimed 5-58 for Bangladesh on Tuesday to help bowl out Ireland for 214 but two early strikes left the one-off Dhaka Test in the balance. Bangladesh took to the crease not long after drinks and were 34-2 at stumps, with Andy McBrine sending back Tamim Iqbal for 21 on the last ball of the day. Mark Adair bowled Najmul Hossain for a duck in the first over of the innings. Mominul Haque was unbeaten on 12 at the end of day’s play with Bangladesh trailing Ireland by 180 runs. Harry Tector earlier topscored with 50 for the tourists, who otherwise struggled to build partnerships after electing to bat first. Shoriful Islam struck early to trap opener Murray Commins for five before Ebadot Hossain and Taijul scalped James McCollum (15) and Andy Balbirnie (16) respectively. Tector, one of the six debutants for Ireland in their first Test since July 2019, put on 74 runs with Curtis Campher for the fourth wicket to steady the innings, rescuing the side from a precarious 48-3. Mehidy Hasan Miraz bowled Tector to break the stand before Taijul made two quick strikes to dismiss Peter Moor (1) and Campher (34), derailing Ireland again. Cameos from Lorcan Tucker (37), McBrine (19) and Adair (32) took the visitors past the 200-run mark. Taijul trapped Adair leg-before to complete his 11th five-wicket haul in Tests and Mehidy wrapped up Ireland’s innings in the next over to finish with 2-43. Ireland have lost all three of their previous Tests since becoming a full member of the International Cricket Council in 2017.","pubDate":"2023-04-04 23:51:18","image_url":"https://www.nation.com.pk/print_images/large/2023-04-05/ireland-strike-after-making-214-in-bangladesh-test-1680652261-5685.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Arrangements for 1st Ramzan Sports Series 2023 under process","link":"https://www.nation.com.pk/05-Apr-2023/arrangements-for-1st-ramzan-sports-series-2023-under-process","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - Director General Sports Punjab Dr Asif Tufail on Tuesday said that top level arrangements are under process for the smooth holding of 1st Ramzan Sports Series 2023 competitions.","content":"LAHORE - Director General Sports Punjab Dr Asif Tufail on Tuesday said that top level arrangements are under process for the smooth holding of 1st Ramzan Sports Series 2023 competitions. It may be noted here that the 1st Ramzan Sports Series 2023 will be organized from April 7 to 11, 2023 on the directives of Punjab Caretaker Chief Minister Mohsin Naqvi. The teams from all divisions will participate in the competitions of hockey, football, kabaddi, badminton and table tennis whereas 12 teams of Lahore cricket clubs will compete in the tape ball cricket event. Dr Asif said all the participating teams will be provided the best facilities during the event. “Ramzan Sports Series will provide a suitable platform to potential athletes of the province to exhibit their talent in the six games.” The SBP DG said overall, 768 men and women athletes from all divisions will take part in the 5-day Ramzan Sports Series. “Besides them there will be 135 team officials to look after multiple team affairs of their respective squads,” he added. Dr Asif said as many as 72 players (8 players per team) and 15 officials will participate in Punjab Badminton Championship of Ramzan Sports Series. “156 players (13 players per team) and 25 in Lahore Cricket Championship, 162 players (18 players per team) and 30 officials in Punjab Hockey Championship, 162 players (18 players per team) and 25 officials in Punjab Football Championship, 144 players (16 players per team) and 25 officials in Punjab Kabaddi Championship while 72 players (8 players per team) and 15 officials will feature in Punjab Table Tennis Championship of Ramzan Sports Series.”","pubDate":"2023-04-04 23:46:04","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Brent keen on Zim’s maiden tour of Thailand","link":"https://www.herald.co.zw/brent-keen-on-zims-maiden-tour-of-thailand/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter ZIMBABWE national senior women’s cricket team coach Gray Brent is excited by the upcoming tour of Thailand as the Lady Chevrons are set to play international cricket for the first time in almost seven months. The brief bilateral tour, which comprises three Women’s Twenty20 International (WT20I) matches, will take place […]","content":"SHANGHAI. — Formula One teams will welcome more than their drivers the breathing space provided by a long April break in a record 23-race season. Fans must wait until the last weekend in the month for the next race in Azerbaijan after Sunday’s triple-stopped Australian Grand Prix in Melbourne, the gap caused by the cancellation […] Ellina Mhlanga Senior Sports Reporter SOME of the Zimbabwe athletes chasing qualification to the 2023 World Athletics Championships had the opportunity to assess their progress in a competitive race when they took part in the Absa Run Your City Gqeberha 10K over the weekend, in South Africa. The trio of Wellington Varevi, Fortunate Chidzivo and […] Tadious Manyepo Sports Reporter DYNAMOS coach Herbert “Jompano” Maruwa will have highly-rated striker Jayden Bakare available for selection in the Glamour Boys’ next Castle Lager Premier Soccer League match against Cranborne Bullets at the National Sports Stadium on Monday next week. The Premiership Rookie of the Year has missed the opening three match-days as Dynamos […]","pubDate":"2023-04-04 22:02:08","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Sri Lanka Cricket provides Cricket Bags for 424 schools","link":"https://www.ft.lk/sports/Sri-Lanka-Cricket-provides-Cricket-Bags-for-424-schools/23-747087","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket distributed Senior Cricket Bags for schools playing in the U17 and U19 cricket tournaments organised by the Sri Lanka Schools Cricket Association. The cricket bag consists of 2 bats, 4 pairs of batting gloves, 3 pairs of batting pads, 3 thigh guards, 2 helmets, 1 pair of pads, 1 pair of wicket-keeping gloves, and a team material bag. The bags were distributed to island-wide schools in collaboration with the District Cricket Associations, which are affiliated with Sri Lanka Cricket. Schools in the districts of Colombo, Gampaha, Kalutara, Galle, Matara, Hambantota, Kandy, Kegalle, Nuwara Eliya, Badulla, Monaragela, Ratnapura, Matale, Anuradhapura, Polonnaruwa, Kurunegala, Puttalam, Ampara, Trincomalee, Batticaloa, Jaffna, Vavuniya Mullativu, Killinocchi, and Mannar, received the cricket bags. This move proposed by the Executive Committee of Sri Lanka Cricket, taking into consideration the current high prices of cricket equipment and the lack of affordability of schools and school cricketers to individually buy such materials, was launched under the “National Pathway Development Program” of Sri Lanka Cricket and focuses on developing the game across the island. Under the initiative, 650 junior cricket bags were distributed to schools participating in the U13 and U15 school cricket competitions of 2022, organised by the Sri Lanka Schools Cricket Association. The program is aimed at helping youngsters from across the country have the opportunity to play the game and create a path for them to represent the country.","pubDate":"2023-04-04 19:01:40","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Boost for Ireland as opener added to squad for second Sri Lanka Test","link":"https://www.ft.lk/sports/Boost-for-Ireland-as-opener-added-to-squad-for-second-Sri-Lanka-Test/23-747090","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Ireland will be boosted by the availability of opener Paul Stirling, who has been added to their squad for the second Test of the Sri Lanka tour. Stirling flew back home after Ireland’s white-ball tour of Bangladesh but will participate in the second Test against Sri Lanka after changes to the schedule. The tour of Sri Lanka was originally set to include a one-off Test and two ODIs, but the limited-overs fixtures were later scrapped to accommodate an additional Test. Stirling has now been added to the 15-member squad for the second Test, with the series starting on 16 April. Both the Test matches will be played in Galle. On Stirling’s selection, Andrew White, national selector at Cricket Ireland stated: “Paul was originally set to join the squad in Sri Lanka for the ODI series that was originally planned. However, with those fixtures now converted to a Test match, and the scheduled Bangladesh T20I series in Ireland postponed, he will now have a greater focus on red-ball cricket and will join the Test squad for that second Test.” Before the series in Sri Lanka, Ireland will first turn their focus on a one-off Test against Bangladesh in Dhaka, starting 4 April. Stirling won’t be a part of that squad. Ireland squad for Sri Lanka Tests: Andrew Balbirnie (c), Mark Adair, Curtis Campher, Murray Commins, George Dockrell, Fionn Hand, Graham Hume, Matthew Humphreys, Tom Mayes, Andrew McBrine, James McCollum, Paul Stirling*, PJ Moor, Harry Tector, Lorcan Tucker, Ben White.","pubDate":"2023-04-04 19:01:40","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India batter Shreyas Iyer likely to miss entire IPL 2023, WTC final","link":"https://thenewsmill.com/2023/04/india-batter-shreyas-iyer-likely-to-miss-entire-ipl-2023-wtc-final/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"India Batter Shreyas Iyer is likely to miss the entire season of the Indian Premier League 2023 and World Test Championship Final against Australia at the Oval stadium in England, according to ESPNcricinfo. Iyer complained about swelling in his lower back during the fourth Test match between India and Australia in Ahmedabad and was not able to bat. He was not able to recover from this recurring back injury and at last, underwent surgery which will keep him away from the field for at least three months. According to ESPNcricinfo, Iyer will be out of the upcoming World Test Championship Final which will be played between India and Australia from June 7 at The Oval in London, England. Iyer, 28, first experienced back discomfort last December just after the conclusion of the Bangladesh tour. He missed the series against New Zealand at home and the first BGT test against Australia. Though he returned to play the second and third tests, the pain resurfaced during the final test, where he fielded for two days. He did not come out to bat during India’s only innings in the match which ended in a draw. After consulting with medical professionals, Iyer was opted out of the first half of IPL. Even though the Kolkata Knight Riders had anticipated he would be back for the second half of the season, it has come to light that he has not been able to train at the National Cricket Academy in Bangalore, where he is receiving rehabilitation under the supervision of the BCCI’s medical team. In the absence of Iyer, who was Kolkata Knight Riders skipper, Nitish Rana is leading the Kolkata side in IPL 2023. (ANI)","pubDate":"2023-04-04 18:31:46","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Shaheen Afridi returns as Pakistan announce white-ball squads for New Zealand series","link":"https://thenewsmill.com/2023/04/shaheen-afridi-returns-as-pakistan-announce-white-ball-squads-for-new-zealand-series/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Pakistan on Tuesday named full-strength squads for the home T20I and ODI series against New Zealand, starting April 14. Shaheen Afridi, who was last seen in international action during the ICC Men’s T20 World Cup in November 2022, is back in both the T20I and ODI squads for the series against New Zealand after a successful recovery from a knee injury. The renowned pacer led Lahore Qalandars to victory in the Pakistan Super League (PSL). With both the bat and the ball, he took the initiative, hitting 133 runs at a strike rate of 168.35 and taking 19 wickets. Along with Shaheen, other players who were rested for the three-match T20I series against Afghanistan in Sharjah include Babar Azam, Mohammad Rizwan, Fakhar Zaman, and Haris Rauf. Afghanistan defeated Pakistan 2-1 in the series, their first bilateral series victory in any format. Ihsanullah, Saim Ayub and Zaman Khan impressed enough during the series in Sharjah to retain their places in the T20I squad against New Zealand. Ihsanullah is also in line for an ODI debut after a maiden call-up in the 50-over format. T20I squad: Babar Azam (c), Shadab Khan (vc), Faheem Ashraf, Fakhar Zaman, Haris Rauf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Rizwan, Naseem Shah, Saim Ayub, Shaheen Shah Afridi, Shan Masood and Zaman Khan. ODI squad: Babar Azam (c), Shadab Khan (vc), Abdullah Shafique, Fakhar Zaman, Haris Rauf, Haris Sohail, Ihsanullah, Imam-ul-Haq, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Salman Ali Agha, Shaheen Shah Afridi, Shan Masood and Usama Mir. Reserves: Abbas Afridi, Abrar Ahmed and Tayyab Tahir. The Pakistan Cricket Board announced that the first ODI in Rawalpindi will be played on April 27. The second ODI has also been moved to April 29 instead of the 28. The venue of the second ODI has also been moved, with Rawalpindi now hosting the second fixture as well. The final three ODIs will still be contested in Karachi. (ANI)","pubDate":"2023-04-04 18:31:40","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Gujarat pacers bounce out frightened DC batters to script six-wicket win","link":"https://www.orissapost.com/gujarat-pacers-bounce-out-frightened-dc-batters-to-script-six-wicket-win/","keywords":["Sports","Delhi Capitals","GT","Gujarat Titans","ipl"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: The inept technique of young Indian batters against top quality fast bowling compounded Delhi Capitals’ worries as they succumbed to an embarrassing six-wicket defeat at the hands of defending champions Gujarat Titans in an IPL match here Tuesday. Mohammed Shami (3/41 in 4 overs) and Alzarri Joseph (2/29 in 4 overs) intimidated the […]","content":"Gujarat pacers bounce out frightened DC batters to script six-wicket win PTI Updated: April 4th, 2023, 23:41 IST in Sports 0 Pic- IPL Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: The inept technique of young Indian batters against top quality fast bowling compounded Delhi Capitals’ worries as they succumbed to an embarrassing six-wicket defeat at the hands of defending champions Gujarat Titans in an IPL match here Tuesday. Mohammed Shami (3/41 in 4 overs) and Alzarri Joseph (2/29 in 4 overs) intimidated the Delhi top-order in the first 10 overs while Rashid Khan (3/31 in 4 overs) hardly faced any trouble keeping the batters under check to restrict the home team to a below-par 162 for 8. Despite Anrich Nortje (2/39 in 4 overs)’s best efforts, young Sai Sudharsan (62 not out off 48 balls) anchored the chase calmly with Titans winning their second successive game in 18. 1 overs. David Miller’s (31 not out off 16 balls) two sixes and four off Mukesh Kumar in the 16th over towards the end sealed DC’s fate decisively. Axar Patel (36 off 22) was DC’s saving grace with bat but since left-handers were batting, David Warner couldn’t give him a single over as the match-up wasn’t compatible. DC have now lost two matches on the trot and while it is early days in the tournament, it will be surprising if this team, with the kind of Indian talent it has, finishes in top five let alone be a title contender. The cupboard in terms both Indian batting and bowling talent looks bare and inadequate while competing with the best in the business. Had Axar not used his long handle to good effect, even 150 would have looked a distant reality for DC. Just a month after Kotla produced a turner for the Test against Australia, the change in nature of the track was palpable as the balls literally flew off the surface. At times, it felt that it wasn’t David Warner (37 off 32 balls) or a Sarafaraz Khan’s (30 off 33 balls) bat that hit the ball but the other way round. Shami literally beat Warner’s bat for fun in his first two overs, often cutting him into half while Alzarri twice forced umpires to call for concussion checks as Sarfaraz and Abhishek Porel (20 off 11 balls) were hit on the head by well-directed bouncers. To be fair, both looked dazed. Even an international like Rilee Rossouw (0) got a Test match like bouncer first up and was snapped brilliantly at backward point by a diving Rahul Tewatia. Not being able to avoid the short ball was more due to lack of technique and not regularly facing bowlers of Shami or Alzarri’s quality became their undoing. Sarfaraz, a heavy-duty scorer in domestic cricket, couldn’t improvise as he found the pace too quick to manoeuvre or improvise his shot selection. The first two games in IPL against international bowlers is a proof that why former chairman Chetan Sharma’s committee or even the current quartet of selectors are wary of picking him for international assignments. A good domestic player, who is out-of-depth against top-grade bowlers. And it’s not Sarfaraz alone. Even Prithvi Shaw isn’t inspiring confidence while facing a bowler of Shami’s calibre. Shaw’s (7) inept technique against fast rising deliveries was once again exposed by the seasoned Shami, who pitched one back of length at a fair pace. The delivery kept climbing on Shaw as he top-edged a pull-shot that was gleefully accepted by Alazarri at mid-on. Mitchell Marsh was bowled for the second time, this time played on off Shami’s bowling as skipper Hardik Pandya very wisely gave him a third over within the Powerplay and the job was done. Skipper Warner, who literally played and missed during the first few overs, still used experience to ride on the pace ad bounce before Alzarri got rid of him. While Gujarat chased, Nortje boled Wriddhiman Saha with a lethal off-cutter and another fast delivery that moved enough to knock back Shubman Gill’s off-stump. DC had some hope when Khaleel Ahmed had Hardik Pandya caught behind but Sudharsan and Vijay Shankar (29) added 53 off 7.2 overs to keep the chase on track. Miller then added finishing touches. PTI Tags: Delhi Capitals GT Gujarat Titans ipl Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Gujarat Titans restrict Delhi Capitals to 162/8 April 4, 2023 Gujarat Titans opt to bowl against Delhi Capitals April 4, 2023 Plan to introduce home and away format in WPL from season 2: IPL chairman Arun Dhumal April 4, 2023 RCB’s Patidar ruled out for entire season, replacement yet to be announced April 4, 2023 MI has invested in youngsters and time for them to show up: Head coach Mark Boucher April 4, 2023 Starc, Zampa will be Australia’s go-to bowlers during ODI World Cup: Ponting April 4, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-04-04 18:11:54","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/04/Gujarat-pacers-bounce-out-frightened-DC-batters-to-script-six-wicket-win.jpg?fit=300%2C238=1","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 के बीच पाकिस्तानी टीम में बड़ा ऐलान, इस तूफानी गेंदबाज की वापसी, बाबर करेंगे कप्तानी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pakistan-team-announced-for-odi-and-t20i-series-vs-new-zealand/articleshow/99248049.cms","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: न्यूजीलैंड के खिलाफ घरेलू श्रृंखला में बाबर आजम ही पाकिस्तान के कप्तान होंगे। इस सीरीज से पहले टीम ट्रेनिंग कैम्प में भाग लेगी, जिसकी शुरुआत 6 अप्रैल से लाहौर में होगी।","content":"न्यूजीलैंड के खिलाफ 14 अप्रैल से शुरू हो रही घरेलू श्रृंखला के लिए बाबर आजम पाकिस्तान की वनडे और टी-20 टीम के कप्तान होंगे। बाबर के अलावा बाएं हाथ के तेज गेंदबाज शाहीन शाह अफरीदी भी नवंबर के बाद पहली बार अंतरराष्ट्रीय क्रिकेट में वापसी करेंगे, उन्होंने पिछले महीने लाहौर कलंदर की कप्तानी करके उसे लगातार दूसरा पाकिस्तान सुपर लीग खिताब दिलाया, लेकिन घुटने की चोट के कारण इंग्लैंड और न्यूजीलैंड के खिलाफ घरेलू श्रृंखला नहीं खेल सके थे। राष्ट्रीय चयनकर्ताओं ने बाबर, शाहीन, हारिस रऊफ, फखर जमां और मोहम्मद रिजवान को शारजाह में अफगानिस्तान के खिलाफ टी-20 श्रृंखला में आराम दिया था। अफगानिस्तान ने वह श्रृंखला 2-1 से जीती। न्यूजीलैंड के खिलाफ श्रृंखलाएं 14 अप्रैल से सात मई के बीच लाहौर, रावलपिंडी और कराची में खेली जाएगी। बाबर आजम (कप्तान), शादाब खान (उप-कप्तान), फहीम अशरफ, फखर जमां, हारिस रऊफ, इफ्तिखार अहमद, इहसानुल्लाह, इमाद वसीम, मोहम्मद हारिस, मोहम्मद नवाज, मोहम्मद रिजवान, नसीम शाह, सईम अयूब। शाहीन शाह अफरीदी, शान मसूद और जमान खान बाबर आजम (कप्तान), शादाब खान (उप-कप्तान), अब्दुल्ला शफीक, फखर जमान, हारिस रऊफ, हारिस सोहेल, इहसानुल्लाह, इमाम-उल-हक, मोहम्मद नवाज, मोहम्मद रिजवान, मोहम्मद वसीम जूनियर, नसीम शाह , सलमान अली आगा, शाहीन शाह अफरीदी, शान मसूद और उसामा मीर। रिजर्व खिलाड़ीः अब्बास अफरीदी, अबरार अहमद और तैय्यब ताहिर","pubDate":"2023-04-04 16:52:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Senior players return as PCB names squad for home NZ tour","link":"https://www.nation.com.pk/05-Apr-2023/senior-players-return-as-pcb-names-squad-for-home-nz-tour","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Senior players including the trio of captain Babar Azam, Muhammad Rizwan and Shaheen Shah Afridi returned as Pakistan Cricket Board (PCB) announced full-strength squads for home T20I and ODI series against New Zealand.","content":"LAHORE - Senior players including the trio of captain Babar Azam, Muhammad Rizwan and Shaheen Shah Afridi returned as Pakistan Cricket Board (PCB) announced full-strength squads for home T20I and ODI series against New Zealand. Shaheen had missed five Tests and three ODIs against England and New Zealand post the ICC Men’s T20 World Cup 2022 as he was completing his rehabilitation following a knee injury he had sustained during the first Test against Sri Lanka in Galle in July. He had subsequently missed the second Test against Sri Lanka, ODI series against the Netherlands, ACC Asia Cup in the UAE and the seven-match T20I series in Pakistan. The 22-year-old, who has taken 99 Test, 62 ODI and 58 T20I wickets, staged a remarkable comeback in the HBL Pakistan Super League 8 when he inspired Lahore Qalandars to become the first side to successfully defend the title. Not only that, Shaheen’s own performance was outstanding both with the bat and the ball – he scored 133 runs at a strike rate of 168.35 and grabbed 19 wickets at an economy rate of 9.13. He was rightly named captain of the Team of HBL PSL 2023. Apart from Shaheen, also returning to both the squads are Babar Azam, Fakhar Zaman, Haris Rauf and Muhammad Rizwan. All these players had rested for last month’s threeT20I series against Afghanistan in Sharjah. This means Babar Azam will resume his normal services as captain in the ODI and T20I series against New Zealand, while Shadab will return to his original position as vice-captain. Three young guns – Ihsanullah, Saim Ayub and Zaman Khan – have been retained in the T20I squad following stellar performances in Sharjah, while Ihsanullah has also been added to the ODI squad for the first time in his career. The squad will assemble in Lahore on 6 April where the training camp will commence on 7 April. RAWALPINDI TO HOST TWO ODIS AGAINST NEW ZEALAND The Pakistan Cricket Board (PCB) on Tuesday confirmed Rawalpindi, along with two T20Is and the first ODI, will also host the second ODI against New Zealand. The two ODIs will be played on 27 and 29 April instead of 26 and 30 April, respectively. Karachi, originally scheduled to hold four ODIs, will stage the last three ODIs.","pubDate":"2023-04-04 23:53:36","image_url":"https://www.nation.com.pk/print_images/large/2023-04-05/senior-players-return-as-pcb-names-squad-for-home-nz-tour-1680652411-8738.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ireland strike after making 214 in Bangladesh Test","link":"https://www.nation.com.pk/05-Apr-2023/ireland-strike-after-making-214-in-bangladesh-test","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Left-arm spinner Taijul Islam claimed 5-58 for Bangladesh on Tuesday to help bowl out Ireland for 214 but two early strikes left the one-off Dhaka Test in the balance.","content":"MIRPUR - Left-arm spinner Taijul Islam claimed 5-58 for Bangladesh on Tuesday to help bowl out Ireland for 214 but two early strikes left the one-off Dhaka Test in the balance. Bangladesh took to the crease not long after drinks and were 34-2 at stumps, with Andy McBrine sending back Tamim Iqbal for 21 on the last ball of the day. Mark Adair bowled Najmul Hossain for a duck in the first over of the innings. Mominul Haque was unbeaten on 12 at the end of day’s play with Bangladesh trailing Ireland by 180 runs. Harry Tector earlier topscored with 50 for the tourists, who otherwise struggled to build partnerships after electing to bat first. Shoriful Islam struck early to trap opener Murray Commins for five before Ebadot Hossain and Taijul scalped James McCollum (15) and Andy Balbirnie (16) respectively. Tector, one of the six debutants for Ireland in their first Test since July 2019, put on 74 runs with Curtis Campher for the fourth wicket to steady the innings, rescuing the side from a precarious 48-3. Mehidy Hasan Miraz bowled Tector to break the stand before Taijul made two quick strikes to dismiss Peter Moor (1) and Campher (34), derailing Ireland again. Cameos from Lorcan Tucker (37), McBrine (19) and Adair (32) took the visitors past the 200-run mark. Taijul trapped Adair leg-before to complete his 11th five-wicket haul in Tests and Mehidy wrapped up Ireland’s innings in the next over to finish with 2-43. Ireland have lost all three of their previous Tests since becoming a full member of the International Cricket Council in 2017.","pubDate":"2023-04-04 23:51:18","image_url":"https://www.nation.com.pk/print_images/large/2023-04-05/ireland-strike-after-making-214-in-bangladesh-test-1680652261-5685.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Arrangements for 1st Ramzan Sports Series 2023 under process","link":"https://www.nation.com.pk/05-Apr-2023/arrangements-for-1st-ramzan-sports-series-2023-under-process","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - Director General Sports Punjab Dr Asif Tufail on Tuesday said that top level arrangements are under process for the smooth holding of 1st Ramzan Sports Series 2023 competitions.","content":"LAHORE - Director General Sports Punjab Dr Asif Tufail on Tuesday said that top level arrangements are under process for the smooth holding of 1st Ramzan Sports Series 2023 competitions. It may be noted here that the 1st Ramzan Sports Series 2023 will be organized from April 7 to 11, 2023 on the directives of Punjab Caretaker Chief Minister Mohsin Naqvi. The teams from all divisions will participate in the competitions of hockey, football, kabaddi, badminton and table tennis whereas 12 teams of Lahore cricket clubs will compete in the tape ball cricket event. Dr Asif said all the participating teams will be provided the best facilities during the event. “Ramzan Sports Series will provide a suitable platform to potential athletes of the province to exhibit their talent in the six games.” The SBP DG said overall, 768 men and women athletes from all divisions will take part in the 5-day Ramzan Sports Series. “Besides them there will be 135 team officials to look after multiple team affairs of their respective squads,” he added. Dr Asif said as many as 72 players (8 players per team) and 15 officials will participate in Punjab Badminton Championship of Ramzan Sports Series. “156 players (13 players per team) and 25 in Lahore Cricket Championship, 162 players (18 players per team) and 30 officials in Punjab Hockey Championship, 162 players (18 players per team) and 25 officials in Punjab Football Championship, 144 players (16 players per team) and 25 officials in Punjab Kabaddi Championship while 72 players (8 players per team) and 15 officials will feature in Punjab Table Tennis Championship of Ramzan Sports Series.”","pubDate":"2023-04-04 23:46:04","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Brent keen on Zim’s maiden tour of Thailand","link":"https://www.herald.co.zw/brent-keen-on-zims-maiden-tour-of-thailand/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter ZIMBABWE national senior women’s cricket team coach Gray Brent is excited by the upcoming tour of Thailand as the Lady Chevrons are set to play international cricket for the first time in almost seven months. The brief bilateral tour, which comprises three Women’s Twenty20 International (WT20I) matches, will take place […]","content":"SHANGHAI. — Formula One teams will welcome more than their drivers the breathing space provided by a long April break in a record 23-race season. Fans must wait until the last weekend in the month for the next race in Azerbaijan after Sunday’s triple-stopped Australian Grand Prix in Melbourne, the gap caused by the cancellation […] Ellina Mhlanga Senior Sports Reporter SOME of the Zimbabwe athletes chasing qualification to the 2023 World Athletics Championships had the opportunity to assess their progress in a competitive race when they took part in the Absa Run Your City Gqeberha 10K over the weekend, in South Africa. The trio of Wellington Varevi, Fortunate Chidzivo and […] Tadious Manyepo Sports Reporter DYNAMOS coach Herbert “Jompano” Maruwa will have highly-rated striker Jayden Bakare available for selection in the Glamour Boys’ next Castle Lager Premier Soccer League match against Cranborne Bullets at the National Sports Stadium on Monday next week. The Premiership Rookie of the Year has missed the opening three match-days as Dynamos […]","pubDate":"2023-04-04 22:02:08","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Sri Lanka Cricket provides Cricket Bags for 424 schools","link":"https://www.ft.lk/sports/Sri-Lanka-Cricket-provides-Cricket-Bags-for-424-schools/23-747087","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket distributed Senior Cricket Bags for schools playing in the U17 and U19 cricket tournaments organised by the Sri Lanka Schools Cricket Association. The cricket bag consists of 2 bats, 4 pairs of batting gloves, 3 pairs of batting pads, 3 thigh guards, 2 helmets, 1 pair of pads, 1 pair of wicket-keeping gloves, and a team material bag. The bags were distributed to island-wide schools in collaboration with the District Cricket Associations, which are affiliated with Sri Lanka Cricket. Schools in the districts of Colombo, Gampaha, Kalutara, Galle, Matara, Hambantota, Kandy, Kegalle, Nuwara Eliya, Badulla, Monaragela, Ratnapura, Matale, Anuradhapura, Polonnaruwa, Kurunegala, Puttalam, Ampara, Trincomalee, Batticaloa, Jaffna, Vavuniya Mullativu, Killinocchi, and Mannar, received the cricket bags. This move proposed by the Executive Committee of Sri Lanka Cricket, taking into consideration the current high prices of cricket equipment and the lack of affordability of schools and school cricketers to individually buy such materials, was launched under the “National Pathway Development Program” of Sri Lanka Cricket and focuses on developing the game across the island. Under the initiative, 650 junior cricket bags were distributed to schools participating in the U13 and U15 school cricket competitions of 2022, organised by the Sri Lanka Schools Cricket Association. The program is aimed at helping youngsters from across the country have the opportunity to play the game and create a path for them to represent the country.","pubDate":"2023-04-04 19:01:40","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Boost for Ireland as opener added to squad for second Sri Lanka Test","link":"https://www.ft.lk/sports/Boost-for-Ireland-as-opener-added-to-squad-for-second-Sri-Lanka-Test/23-747090","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Ireland will be boosted by the availability of opener Paul Stirling, who has been added to their squad for the second Test of the Sri Lanka tour. Stirling flew back home after Ireland’s white-ball tour of Bangladesh but will participate in the second Test against Sri Lanka after changes to the schedule. The tour of Sri Lanka was originally set to include a one-off Test and two ODIs, but the limited-overs fixtures were later scrapped to accommodate an additional Test. Stirling has now been added to the 15-member squad for the second Test, with the series starting on 16 April. Both the Test matches will be played in Galle. On Stirling’s selection, Andrew White, national selector at Cricket Ireland stated: “Paul was originally set to join the squad in Sri Lanka for the ODI series that was originally planned. However, with those fixtures now converted to a Test match, and the scheduled Bangladesh T20I series in Ireland postponed, he will now have a greater focus on red-ball cricket and will join the Test squad for that second Test.” Before the series in Sri Lanka, Ireland will first turn their focus on a one-off Test against Bangladesh in Dhaka, starting 4 April. Stirling won’t be a part of that squad. Ireland squad for Sri Lanka Tests: Andrew Balbirnie (c), Mark Adair, Curtis Campher, Murray Commins, George Dockrell, Fionn Hand, Graham Hume, Matthew Humphreys, Tom Mayes, Andrew McBrine, James McCollum, Paul Stirling*, PJ Moor, Harry Tector, Lorcan Tucker, Ben White.","pubDate":"2023-04-04 19:01:40","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India batter Shreyas Iyer likely to miss entire IPL 2023, WTC final","link":"https://thenewsmill.com/2023/04/india-batter-shreyas-iyer-likely-to-miss-entire-ipl-2023-wtc-final/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"India Batter Shreyas Iyer is likely to miss the entire season of the Indian Premier League 2023 and World Test Championship Final against Australia at the Oval stadium in England, according to ESPNcricinfo. Iyer complained about swelling in his lower back during the fourth Test match between India and Australia in Ahmedabad and was not able to bat. He was not able to recover from this recurring back injury and at last, underwent surgery which will keep him away from the field for at least three months. According to ESPNcricinfo, Iyer will be out of the upcoming World Test Championship Final which will be played between India and Australia from June 7 at The Oval in London, England. Iyer, 28, first experienced back discomfort last December just after the conclusion of the Bangladesh tour. He missed the series against New Zealand at home and the first BGT test against Australia. Though he returned to play the second and third tests, the pain resurfaced during the final test, where he fielded for two days. He did not come out to bat during India’s only innings in the match which ended in a draw. After consulting with medical professionals, Iyer was opted out of the first half of IPL. Even though the Kolkata Knight Riders had anticipated he would be back for the second half of the season, it has come to light that he has not been able to train at the National Cricket Academy in Bangalore, where he is receiving rehabilitation under the supervision of the BCCI’s medical team. In the absence of Iyer, who was Kolkata Knight Riders skipper, Nitish Rana is leading the Kolkata side in IPL 2023. (ANI)","pubDate":"2023-04-04 18:31:46","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Shaheen Afridi returns as Pakistan announce white-ball squads for New Zealand series","link":"https://thenewsmill.com/2023/04/shaheen-afridi-returns-as-pakistan-announce-white-ball-squads-for-new-zealand-series/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Pakistan on Tuesday named full-strength squads for the home T20I and ODI series against New Zealand, starting April 14. Shaheen Afridi, who was last seen in international action during the ICC Men’s T20 World Cup in November 2022, is back in both the T20I and ODI squads for the series against New Zealand after a successful recovery from a knee injury. The renowned pacer led Lahore Qalandars to victory in the Pakistan Super League (PSL). With both the bat and the ball, he took the initiative, hitting 133 runs at a strike rate of 168.35 and taking 19 wickets. Along with Shaheen, other players who were rested for the three-match T20I series against Afghanistan in Sharjah include Babar Azam, Mohammad Rizwan, Fakhar Zaman, and Haris Rauf. Afghanistan defeated Pakistan 2-1 in the series, their first bilateral series victory in any format. Ihsanullah, Saim Ayub and Zaman Khan impressed enough during the series in Sharjah to retain their places in the T20I squad against New Zealand. Ihsanullah is also in line for an ODI debut after a maiden call-up in the 50-over format. T20I squad: Babar Azam (c), Shadab Khan (vc), Faheem Ashraf, Fakhar Zaman, Haris Rauf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Rizwan, Naseem Shah, Saim Ayub, Shaheen Shah Afridi, Shan Masood and Zaman Khan. ODI squad: Babar Azam (c), Shadab Khan (vc), Abdullah Shafique, Fakhar Zaman, Haris Rauf, Haris Sohail, Ihsanullah, Imam-ul-Haq, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Salman Ali Agha, Shaheen Shah Afridi, Shan Masood and Usama Mir. Reserves: Abbas Afridi, Abrar Ahmed and Tayyab Tahir. The Pakistan Cricket Board announced that the first ODI in Rawalpindi will be played on April 27. The second ODI has also been moved to April 29 instead of the 28. The venue of the second ODI has also been moved, with Rawalpindi now hosting the second fixture as well. The final three ODIs will still be contested in Karachi. (ANI)","pubDate":"2023-04-04 18:31:40","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Gujarat pacers bounce out frightened DC batters to script six-wicket win","link":"https://www.orissapost.com/gujarat-pacers-bounce-out-frightened-dc-batters-to-script-six-wicket-win/","keywords":["Sports","Delhi Capitals","GT","Gujarat Titans","ipl"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: The inept technique of young Indian batters against top quality fast bowling compounded Delhi Capitals’ worries as they succumbed to an embarrassing six-wicket defeat at the hands of defending champions Gujarat Titans in an IPL match here Tuesday. Mohammed Shami (3/41 in 4 overs) and Alzarri Joseph (2/29 in 4 overs) intimidated the […]","content":"Gujarat pacers bounce out frightened DC batters to script six-wicket win PTI Updated: April 4th, 2023, 23:41 IST in Sports 0 Pic- IPL Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: The inept technique of young Indian batters against top quality fast bowling compounded Delhi Capitals’ worries as they succumbed to an embarrassing six-wicket defeat at the hands of defending champions Gujarat Titans in an IPL match here Tuesday. Mohammed Shami (3/41 in 4 overs) and Alzarri Joseph (2/29 in 4 overs) intimidated the Delhi top-order in the first 10 overs while Rashid Khan (3/31 in 4 overs) hardly faced any trouble keeping the batters under check to restrict the home team to a below-par 162 for 8. Despite Anrich Nortje (2/39 in 4 overs)’s best efforts, young Sai Sudharsan (62 not out off 48 balls) anchored the chase calmly with Titans winning their second successive game in 18. 1 overs. David Miller’s (31 not out off 16 balls) two sixes and four off Mukesh Kumar in the 16th over towards the end sealed DC’s fate decisively. Axar Patel (36 off 22) was DC’s saving grace with bat but since left-handers were batting, David Warner couldn’t give him a single over as the match-up wasn’t compatible. DC have now lost two matches on the trot and while it is early days in the tournament, it will be surprising if this team, with the kind of Indian talent it has, finishes in top five let alone be a title contender. The cupboard in terms both Indian batting and bowling talent looks bare and inadequate while competing with the best in the business. Had Axar not used his long handle to good effect, even 150 would have looked a distant reality for DC. Just a month after Kotla produced a turner for the Test against Australia, the change in nature of the track was palpable as the balls literally flew off the surface. At times, it felt that it wasn’t David Warner (37 off 32 balls) or a Sarafaraz Khan’s (30 off 33 balls) bat that hit the ball but the other way round. Shami literally beat Warner’s bat for fun in his first two overs, often cutting him into half while Alzarri twice forced umpires to call for concussion checks as Sarfaraz and Abhishek Porel (20 off 11 balls) were hit on the head by well-directed bouncers. To be fair, both looked dazed. Even an international like Rilee Rossouw (0) got a Test match like bouncer first up and was snapped brilliantly at backward point by a diving Rahul Tewatia. Not being able to avoid the short ball was more due to lack of technique and not regularly facing bowlers of Shami or Alzarri’s quality became their undoing. Sarfaraz, a heavy-duty scorer in domestic cricket, couldn’t improvise as he found the pace too quick to manoeuvre or improvise his shot selection. The first two games in IPL against international bowlers is a proof that why former chairman Chetan Sharma’s committee or even the current quartet of selectors are wary of picking him for international assignments. A good domestic player, who is out-of-depth against top-grade bowlers. And it’s not Sarfaraz alone. Even Prithvi Shaw isn’t inspiring confidence while facing a bowler of Shami’s calibre. Shaw’s (7) inept technique against fast rising deliveries was once again exposed by the seasoned Shami, who pitched one back of length at a fair pace. The delivery kept climbing on Shaw as he top-edged a pull-shot that was gleefully accepted by Alazarri at mid-on. Mitchell Marsh was bowled for the second time, this time played on off Shami’s bowling as skipper Hardik Pandya very wisely gave him a third over within the Powerplay and the job was done. Skipper Warner, who literally played and missed during the first few overs, still used experience to ride on the pace ad bounce before Alzarri got rid of him. While Gujarat chased, Nortje boled Wriddhiman Saha with a lethal off-cutter and another fast delivery that moved enough to knock back Shubman Gill’s off-stump. DC had some hope when Khaleel Ahmed had Hardik Pandya caught behind but Sudharsan and Vijay Shankar (29) added 53 off 7.2 overs to keep the chase on track. Miller then added finishing touches. PTI Tags: Delhi Capitals GT Gujarat Titans ipl Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Gujarat Titans restrict Delhi Capitals to 162/8 April 4, 2023 Gujarat Titans opt to bowl against Delhi Capitals April 4, 2023 Plan to introduce home and away format in WPL from season 2: IPL chairman Arun Dhumal April 4, 2023 RCB’s Patidar ruled out for entire season, replacement yet to be announced April 4, 2023 MI has invested in youngsters and time for them to show up: Head coach Mark Boucher April 4, 2023 Starc, Zampa will be Australia’s go-to bowlers during ODI World Cup: Ponting April 4, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-04-04 18:11:54","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/04/Gujarat-pacers-bounce-out-frightened-DC-batters-to-script-six-wicket-win.jpg?fit=300%2C238=1","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 के बीच पाकिस्तानी टीम में बड़ा ऐलान, इस तूफानी गेंदबाज की वापसी, बाबर करेंगे कप्तानी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pakistan-team-announced-for-odi-and-t20i-series-vs-new-zealand/articleshow/99248049.cms","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: न्यूजीलैंड के खिलाफ घरेलू श्रृंखला में बाबर आजम ही पाकिस्तान के कप्तान होंगे। इस सीरीज से पहले टीम ट्रेनिंग कैम्प में भाग लेगी, जिसकी शुरुआत 6 अप्रैल से लाहौर में होगी।","content":"न्यूजीलैंड के खिलाफ 14 अप्रैल से शुरू हो रही घरेलू श्रृंखला के लिए बाबर आजम पाकिस्तान की वनडे और टी-20 टीम के कप्तान होंगे। बाबर के अलावा बाएं हाथ के तेज गेंदबाज शाहीन शाह अफरीदी भी नवंबर के बाद पहली बार अंतरराष्ट्रीय क्रिकेट में वापसी करेंगे, उन्होंने पिछले महीने लाहौर कलंदर की कप्तानी करके उसे लगातार दूसरा पाकिस्तान सुपर लीग खिताब दिलाया, लेकिन घुटने की चोट के कारण इंग्लैंड और न्यूजीलैंड के खिलाफ घरेलू श्रृंखला नहीं खेल सके थे। राष्ट्रीय चयनकर्ताओं ने बाबर, शाहीन, हारिस रऊफ, फखर जमां और मोहम्मद रिजवान को शारजाह में अफगानिस्तान के खिलाफ टी-20 श्रृंखला में आराम दिया था। अफगानिस्तान ने वह श्रृंखला 2-1 से जीती। न्यूजीलैंड के खिलाफ श्रृंखलाएं 14 अप्रैल से सात मई के बीच लाहौर, रावलपिंडी और कराची में खेली जाएगी। बाबर आजम (कप्तान), शादाब खान (उप-कप्तान), फहीम अशरफ, फखर जमां, हारिस रऊफ, इफ्तिखार अहमद, इहसानुल्लाह, इमाद वसीम, मोहम्मद हारिस, मोहम्मद नवाज, मोहम्मद रिजवान, नसीम शाह, सईम अयूब। शाहीन शाह अफरीदी, शान मसूद और जमान खान बाबर आजम (कप्तान), शादाब खान (उप-कप्तान), अब्दुल्ला शफीक, फखर जमान, हारिस रऊफ, हारिस सोहेल, इहसानुल्लाह, इमाम-उल-हक, मोहम्मद नवाज, मोहम्मद रिजवान, मोहम्मद वसीम जूनियर, नसीम शाह , सलमान अली आगा, शाहीन शाह अफरीदी, शान मसूद और उसामा मीर। रिजर्व खिलाड़ीः अब्बास अफरीदी, अबरार अहमद और तैय्यब ताहिर","pubDate":"2023-04-04 16:52:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Senior players return as PCB names squad for home NZ tour","link":"https://www.nation.com.pk/05-Apr-2023/senior-players-return-as-pcb-names-squad-for-home-nz-tour","keywords":["Sports, Newspaper"],"creator":["Our Staff Reporter"],"video_url":null,"description":"LAHORE - Senior players including the trio of captain Babar Azam, Muhammad Rizwan and Shaheen Shah Afridi returned as Pakistan Cricket Board (PCB) announced full-strength squads for home T20I and ODI series against New Zealand.","content":"LAHORE - Senior players including the trio of captain Babar Azam, Muhammad Rizwan and Shaheen Shah Afridi returned as Pakistan Cricket Board (PCB) announced full-strength squads for home T20I and ODI series against New Zealand. Shaheen had missed five Tests and three ODIs against England and New Zealand post the ICC Men’s T20 World Cup 2022 as he was completing his rehabilitation following a knee injury he had sustained during the first Test against Sri Lanka in Galle in July. He had subsequently missed the second Test against Sri Lanka, ODI series against the Netherlands, ACC Asia Cup in the UAE and the seven-match T20I series in Pakistan. The 22-year-old, who has taken 99 Test, 62 ODI and 58 T20I wickets, staged a remarkable comeback in the HBL Pakistan Super League 8 when he inspired Lahore Qalandars to become the first side to successfully defend the title. Not only that, Shaheen’s own performance was outstanding both with the bat and the ball – he scored 133 runs at a strike rate of 168.35 and grabbed 19 wickets at an economy rate of 9.13. He was rightly named captain of the Team of HBL PSL 2023. Apart from Shaheen, also returning to both the squads are Babar Azam, Fakhar Zaman, Haris Rauf and Muhammad Rizwan. All these players had rested for last month’s threeT20I series against Afghanistan in Sharjah. This means Babar Azam will resume his normal services as captain in the ODI and T20I series against New Zealand, while Shadab will return to his original position as vice-captain. Three young guns – Ihsanullah, Saim Ayub and Zaman Khan – have been retained in the T20I squad following stellar performances in Sharjah, while Ihsanullah has also been added to the ODI squad for the first time in his career. The squad will assemble in Lahore on 6 April where the training camp will commence on 7 April. RAWALPINDI TO HOST TWO ODIS AGAINST NEW ZEALAND The Pakistan Cricket Board (PCB) on Tuesday confirmed Rawalpindi, along with two T20Is and the first ODI, will also host the second ODI against New Zealand. The two ODIs will be played on 27 and 29 April instead of 26 and 30 April, respectively. Karachi, originally scheduled to hold four ODIs, will stage the last three ODIs.","pubDate":"2023-04-04 23:53:36","image_url":"https://www.nation.com.pk/print_images/large/2023-04-05/senior-players-return-as-pcb-names-squad-for-home-nz-tour-1680652411-8738.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ireland strike after making 214 in Bangladesh Test","link":"https://www.nation.com.pk/05-Apr-2023/ireland-strike-after-making-214-in-bangladesh-test","keywords":["Sports, Newspaper"],"creator":["Agencies"],"video_url":null,"description":"MIRPUR - Left-arm spinner Taijul Islam claimed 5-58 for Bangladesh on Tuesday to help bowl out Ireland for 214 but two early strikes left the one-off Dhaka Test in the balance.","content":"MIRPUR - Left-arm spinner Taijul Islam claimed 5-58 for Bangladesh on Tuesday to help bowl out Ireland for 214 but two early strikes left the one-off Dhaka Test in the balance. Bangladesh took to the crease not long after drinks and were 34-2 at stumps, with Andy McBrine sending back Tamim Iqbal for 21 on the last ball of the day. Mark Adair bowled Najmul Hossain for a duck in the first over of the innings. Mominul Haque was unbeaten on 12 at the end of day’s play with Bangladesh trailing Ireland by 180 runs. Harry Tector earlier topscored with 50 for the tourists, who otherwise struggled to build partnerships after electing to bat first. Shoriful Islam struck early to trap opener Murray Commins for five before Ebadot Hossain and Taijul scalped James McCollum (15) and Andy Balbirnie (16) respectively. Tector, one of the six debutants for Ireland in their first Test since July 2019, put on 74 runs with Curtis Campher for the fourth wicket to steady the innings, rescuing the side from a precarious 48-3. Mehidy Hasan Miraz bowled Tector to break the stand before Taijul made two quick strikes to dismiss Peter Moor (1) and Campher (34), derailing Ireland again. Cameos from Lorcan Tucker (37), McBrine (19) and Adair (32) took the visitors past the 200-run mark. Taijul trapped Adair leg-before to complete his 11th five-wicket haul in Tests and Mehidy wrapped up Ireland’s innings in the next over to finish with 2-43. Ireland have lost all three of their previous Tests since becoming a full member of the International Cricket Council in 2017.","pubDate":"2023-04-04 23:51:18","image_url":"https://www.nation.com.pk/print_images/large/2023-04-05/ireland-strike-after-making-214-in-bangladesh-test-1680652261-5685.jpg","source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Arrangements for 1st Ramzan Sports Series 2023 under process","link":"https://www.nation.com.pk/05-Apr-2023/arrangements-for-1st-ramzan-sports-series-2023-under-process","keywords":["Sports, Newspaper"],"creator":["Staff Reporter"],"video_url":null,"description":"LAHORE - Director General Sports Punjab Dr Asif Tufail on Tuesday said that top level arrangements are under process for the smooth holding of 1st Ramzan Sports Series 2023 competitions.","content":"LAHORE - Director General Sports Punjab Dr Asif Tufail on Tuesday said that top level arrangements are under process for the smooth holding of 1st Ramzan Sports Series 2023 competitions. It may be noted here that the 1st Ramzan Sports Series 2023 will be organized from April 7 to 11, 2023 on the directives of Punjab Caretaker Chief Minister Mohsin Naqvi. The teams from all divisions will participate in the competitions of hockey, football, kabaddi, badminton and table tennis whereas 12 teams of Lahore cricket clubs will compete in the tape ball cricket event. Dr Asif said all the participating teams will be provided the best facilities during the event. “Ramzan Sports Series will provide a suitable platform to potential athletes of the province to exhibit their talent in the six games.” The SBP DG said overall, 768 men and women athletes from all divisions will take part in the 5-day Ramzan Sports Series. “Besides them there will be 135 team officials to look after multiple team affairs of their respective squads,” he added. Dr Asif said as many as 72 players (8 players per team) and 15 officials will participate in Punjab Badminton Championship of Ramzan Sports Series. “156 players (13 players per team) and 25 in Lahore Cricket Championship, 162 players (18 players per team) and 30 officials in Punjab Hockey Championship, 162 players (18 players per team) and 25 officials in Punjab Football Championship, 144 players (16 players per team) and 25 officials in Punjab Kabaddi Championship while 72 players (8 players per team) and 15 officials will feature in Punjab Table Tennis Championship of Ramzan Sports Series.”","pubDate":"2023-04-04 23:46:04","image_url":null,"source_id":"nation_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Brent keen on Zim’s maiden tour of Thailand","link":"https://www.herald.co.zw/brent-keen-on-zims-maiden-tour-of-thailand/","keywords":["Sport"],"creator":["daniel"],"video_url":null,"description":"Eddie Chikamhi Senior Sports Reporter ZIMBABWE national senior women’s cricket team coach Gray Brent is excited by the upcoming tour of Thailand as the Lady Chevrons are set to play international cricket for the first time in almost seven months. The brief bilateral tour, which comprises three Women’s Twenty20 International (WT20I) matches, will take place […]","content":"SHANGHAI. — Formula One teams will welcome more than their drivers the breathing space provided by a long April break in a record 23-race season. Fans must wait until the last weekend in the month for the next race in Azerbaijan after Sunday’s triple-stopped Australian Grand Prix in Melbourne, the gap caused by the cancellation […] Ellina Mhlanga Senior Sports Reporter SOME of the Zimbabwe athletes chasing qualification to the 2023 World Athletics Championships had the opportunity to assess their progress in a competitive race when they took part in the Absa Run Your City Gqeberha 10K over the weekend, in South Africa. The trio of Wellington Varevi, Fortunate Chidzivo and […] Tadious Manyepo Sports Reporter DYNAMOS coach Herbert “Jompano” Maruwa will have highly-rated striker Jayden Bakare available for selection in the Glamour Boys’ next Castle Lager Premier Soccer League match against Cranborne Bullets at the National Sports Stadium on Monday next week. The Premiership Rookie of the Year has missed the opening three match-days as Dynamos […]","pubDate":"2023-04-04 22:02:08","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Sri Lanka Cricket provides Cricket Bags for 424 schools","link":"https://www.ft.lk/sports/Sri-Lanka-Cricket-provides-Cricket-Bags-for-424-schools/23-747087","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Cricket distributed Senior Cricket Bags for schools playing in the U17 and U19 cricket tournaments organised by the Sri Lanka Schools Cricket Association. The cricket bag consists of 2 bats, 4 pairs of batting gloves, 3 pairs of batting pads, 3 thigh guards, 2 helmets, 1 pair of pads, 1 pair of wicket-keeping gloves, and a team material bag. The bags were distributed to island-wide schools in collaboration with the District Cricket Associations, which are affiliated with Sri Lanka Cricket. Schools in the districts of Colombo, Gampaha, Kalutara, Galle, Matara, Hambantota, Kandy, Kegalle, Nuwara Eliya, Badulla, Monaragela, Ratnapura, Matale, Anuradhapura, Polonnaruwa, Kurunegala, Puttalam, Ampara, Trincomalee, Batticaloa, Jaffna, Vavuniya Mullativu, Killinocchi, and Mannar, received the cricket bags. This move proposed by the Executive Committee of Sri Lanka Cricket, taking into consideration the current high prices of cricket equipment and the lack of affordability of schools and school cricketers to individually buy such materials, was launched under the “National Pathway Development Program” of Sri Lanka Cricket and focuses on developing the game across the island. Under the initiative, 650 junior cricket bags were distributed to schools participating in the U13 and U15 school cricket competitions of 2022, organised by the Sri Lanka Schools Cricket Association. The program is aimed at helping youngsters from across the country have the opportunity to play the game and create a path for them to represent the country.","pubDate":"2023-04-04 19:01:40","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Boost for Ireland as opener added to squad for second Sri Lanka Test","link":"https://www.ft.lk/sports/Boost-for-Ireland-as-opener-added-to-squad-for-second-Sri-Lanka-Test/23-747090","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Ireland will be boosted by the availability of opener Paul Stirling, who has been added to their squad for the second Test of the Sri Lanka tour. Stirling flew back home after Ireland’s white-ball tour of Bangladesh but will participate in the second Test against Sri Lanka after changes to the schedule. The tour of Sri Lanka was originally set to include a one-off Test and two ODIs, but the limited-overs fixtures were later scrapped to accommodate an additional Test. Stirling has now been added to the 15-member squad for the second Test, with the series starting on 16 April. Both the Test matches will be played in Galle. On Stirling’s selection, Andrew White, national selector at Cricket Ireland stated: “Paul was originally set to join the squad in Sri Lanka for the ODI series that was originally planned. However, with those fixtures now converted to a Test match, and the scheduled Bangladesh T20I series in Ireland postponed, he will now have a greater focus on red-ball cricket and will join the Test squad for that second Test.” Before the series in Sri Lanka, Ireland will first turn their focus on a one-off Test against Bangladesh in Dhaka, starting 4 April. Stirling won’t be a part of that squad. Ireland squad for Sri Lanka Tests: Andrew Balbirnie (c), Mark Adair, Curtis Campher, Murray Commins, George Dockrell, Fionn Hand, Graham Hume, Matthew Humphreys, Tom Mayes, Andrew McBrine, James McCollum, Paul Stirling*, PJ Moor, Harry Tector, Lorcan Tucker, Ben White.","pubDate":"2023-04-04 19:01:40","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"India batter Shreyas Iyer likely to miss entire IPL 2023, WTC final","link":"https://thenewsmill.com/2023/04/india-batter-shreyas-iyer-likely-to-miss-entire-ipl-2023-wtc-final/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"India Batter Shreyas Iyer is likely to miss the entire season of the Indian Premier League 2023 and World Test Championship Final against Australia at the Oval stadium in England, according to ESPNcricinfo. Iyer complained about swelling in his lower back during the fourth Test match between India and Australia in Ahmedabad and was not able to bat. He was not able to recover from this recurring back injury and at last, underwent surgery which will keep him away from the field for at least three months. According to ESPNcricinfo, Iyer will be out of the upcoming World Test Championship Final which will be played between India and Australia from June 7 at The Oval in London, England. Iyer, 28, first experienced back discomfort last December just after the conclusion of the Bangladesh tour. He missed the series against New Zealand at home and the first BGT test against Australia. Though he returned to play the second and third tests, the pain resurfaced during the final test, where he fielded for two days. He did not come out to bat during India’s only innings in the match which ended in a draw. After consulting with medical professionals, Iyer was opted out of the first half of IPL. Even though the Kolkata Knight Riders had anticipated he would be back for the second half of the season, it has come to light that he has not been able to train at the National Cricket Academy in Bangalore, where he is receiving rehabilitation under the supervision of the BCCI’s medical team. In the absence of Iyer, who was Kolkata Knight Riders skipper, Nitish Rana is leading the Kolkata side in IPL 2023. (ANI)","pubDate":"2023-04-04 18:31:46","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Shaheen Afridi returns as Pakistan announce white-ball squads for New Zealand series","link":"https://thenewsmill.com/2023/04/shaheen-afridi-returns-as-pakistan-announce-white-ball-squads-for-new-zealand-series/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Pakistan on Tuesday named full-strength squads for the home T20I and ODI series against New Zealand, starting April 14. Shaheen Afridi, who was last seen in international action during the ICC Men’s T20 World Cup in November 2022, is back in both the T20I and ODI squads for the series against New Zealand after a successful recovery from a knee injury. The renowned pacer led Lahore Qalandars to victory in the Pakistan Super League (PSL). With both the bat and the ball, he took the initiative, hitting 133 runs at a strike rate of 168.35 and taking 19 wickets. Along with Shaheen, other players who were rested for the three-match T20I series against Afghanistan in Sharjah include Babar Azam, Mohammad Rizwan, Fakhar Zaman, and Haris Rauf. Afghanistan defeated Pakistan 2-1 in the series, their first bilateral series victory in any format. Ihsanullah, Saim Ayub and Zaman Khan impressed enough during the series in Sharjah to retain their places in the T20I squad against New Zealand. Ihsanullah is also in line for an ODI debut after a maiden call-up in the 50-over format. T20I squad: Babar Azam (c), Shadab Khan (vc), Faheem Ashraf, Fakhar Zaman, Haris Rauf, Iftikhar Ahmed, Ihsanullah, Imad Wasim, Mohammad Haris, Mohammad Nawaz, Mohammad Rizwan, Naseem Shah, Saim Ayub, Shaheen Shah Afridi, Shan Masood and Zaman Khan. ODI squad: Babar Azam (c), Shadab Khan (vc), Abdullah Shafique, Fakhar Zaman, Haris Rauf, Haris Sohail, Ihsanullah, Imam-ul-Haq, Mohammad Nawaz, Mohammad Rizwan, Mohammad Wasim Jnr, Naseem Shah, Salman Ali Agha, Shaheen Shah Afridi, Shan Masood and Usama Mir. Reserves: Abbas Afridi, Abrar Ahmed and Tayyab Tahir. The Pakistan Cricket Board announced that the first ODI in Rawalpindi will be played on April 27. The second ODI has also been moved to April 29 instead of the 28. The venue of the second ODI has also been moved, with Rawalpindi now hosting the second fixture as well. The final three ODIs will still be contested in Karachi. (ANI)","pubDate":"2023-04-04 18:31:40","image_url":null,"source_id":"thenewsmill","category":["sports"],"country":["india"],"language":"english"},{"title":"Gujarat pacers bounce out frightened DC batters to script six-wicket win","link":"https://www.orissapost.com/gujarat-pacers-bounce-out-frightened-dc-batters-to-script-six-wicket-win/","keywords":["Sports","Delhi Capitals","GT","Gujarat Titans","ipl"],"creator":["Post News Network"],"video_url":null,"description":"New Delhi: The inept technique of young Indian batters against top quality fast bowling compounded Delhi Capitals’ worries as they succumbed to an embarrassing six-wicket defeat at the hands of defending champions Gujarat Titans in an IPL match here Tuesday. Mohammed Shami (3/41 in 4 overs) and Alzarri Joseph (2/29 in 4 overs) intimidated the […]","content":"Gujarat pacers bounce out frightened DC batters to script six-wicket win PTI Updated: April 4th, 2023, 23:41 IST in Sports 0 Pic- IPL Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin New Delhi: The inept technique of young Indian batters against top quality fast bowling compounded Delhi Capitals’ worries as they succumbed to an embarrassing six-wicket defeat at the hands of defending champions Gujarat Titans in an IPL match here Tuesday. Mohammed Shami (3/41 in 4 overs) and Alzarri Joseph (2/29 in 4 overs) intimidated the Delhi top-order in the first 10 overs while Rashid Khan (3/31 in 4 overs) hardly faced any trouble keeping the batters under check to restrict the home team to a below-par 162 for 8. Despite Anrich Nortje (2/39 in 4 overs)’s best efforts, young Sai Sudharsan (62 not out off 48 balls) anchored the chase calmly with Titans winning their second successive game in 18. 1 overs. David Miller’s (31 not out off 16 balls) two sixes and four off Mukesh Kumar in the 16th over towards the end sealed DC’s fate decisively. Axar Patel (36 off 22) was DC’s saving grace with bat but since left-handers were batting, David Warner couldn’t give him a single over as the match-up wasn’t compatible. DC have now lost two matches on the trot and while it is early days in the tournament, it will be surprising if this team, with the kind of Indian talent it has, finishes in top five let alone be a title contender. The cupboard in terms both Indian batting and bowling talent looks bare and inadequate while competing with the best in the business. Had Axar not used his long handle to good effect, even 150 would have looked a distant reality for DC. Just a month after Kotla produced a turner for the Test against Australia, the change in nature of the track was palpable as the balls literally flew off the surface. At times, it felt that it wasn’t David Warner (37 off 32 balls) or a Sarafaraz Khan’s (30 off 33 balls) bat that hit the ball but the other way round. Shami literally beat Warner’s bat for fun in his first two overs, often cutting him into half while Alzarri twice forced umpires to call for concussion checks as Sarfaraz and Abhishek Porel (20 off 11 balls) were hit on the head by well-directed bouncers. To be fair, both looked dazed. Even an international like Rilee Rossouw (0) got a Test match like bouncer first up and was snapped brilliantly at backward point by a diving Rahul Tewatia. Not being able to avoid the short ball was more due to lack of technique and not regularly facing bowlers of Shami or Alzarri’s quality became their undoing. Sarfaraz, a heavy-duty scorer in domestic cricket, couldn’t improvise as he found the pace too quick to manoeuvre or improvise his shot selection. The first two games in IPL against international bowlers is a proof that why former chairman Chetan Sharma’s committee or even the current quartet of selectors are wary of picking him for international assignments. A good domestic player, who is out-of-depth against top-grade bowlers. And it’s not Sarfaraz alone. Even Prithvi Shaw isn’t inspiring confidence while facing a bowler of Shami’s calibre. Shaw’s (7) inept technique against fast rising deliveries was once again exposed by the seasoned Shami, who pitched one back of length at a fair pace. The delivery kept climbing on Shaw as he top-edged a pull-shot that was gleefully accepted by Alazarri at mid-on. Mitchell Marsh was bowled for the second time, this time played on off Shami’s bowling as skipper Hardik Pandya very wisely gave him a third over within the Powerplay and the job was done. Skipper Warner, who literally played and missed during the first few overs, still used experience to ride on the pace ad bounce before Alzarri got rid of him. While Gujarat chased, Nortje boled Wriddhiman Saha with a lethal off-cutter and another fast delivery that moved enough to knock back Shubman Gill’s off-stump. DC had some hope when Khaleel Ahmed had Hardik Pandya caught behind but Sudharsan and Vijay Shankar (29) added 53 off 7.2 overs to keep the chase on track. Miller then added finishing touches. PTI Tags: Delhi Capitals GT Gujarat Titans ipl Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Gujarat Titans restrict Delhi Capitals to 162/8 April 4, 2023 Gujarat Titans opt to bowl against Delhi Capitals April 4, 2023 Plan to introduce home and away format in WPL from season 2: IPL chairman Arun Dhumal April 4, 2023 RCB’s Patidar ruled out for entire season, replacement yet to be announced April 4, 2023 MI has invested in youngsters and time for them to show up: Head coach Mark Boucher April 4, 2023 Starc, Zampa will be Australia’s go-to bowlers during ODI World Cup: Ponting April 4, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ","pubDate":"2023-04-04 18:11:54","image_url":"https://i0.wp.com/www.orissapost.com/wp-content/uploads/2023/04/Gujarat-pacers-bounce-out-frightened-DC-batters-to-script-six-wicket-win.jpg?fit=300%2C238=1","source_id":"orissapost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 के बीच पाकिस्तानी टीम में बड़ा ऐलान, इस तूफानी गेंदबाज की वापसी, बाबर करेंगे कप्तानी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/pakistan-team-announced-for-odi-and-t20i-series-vs-new-zealand/articleshow/99248049.cms","keywords":null,"creator":null,"video_url":null,"description":"PAK vs NZ: न्यूजीलैंड के खिलाफ घरेलू श्रृंखला में बाबर आजम ही पाकिस्तान के कप्तान होंगे। इस सीरीज से पहले टीम ट्रेनिंग कैम्प में भाग लेगी, जिसकी शुरुआत 6 अप्रैल से लाहौर में होगी।","content":"न्यूजीलैंड के खिलाफ 14 अप्रैल से शुरू हो रही घरेलू श्रृंखला के लिए बाबर आजम पाकिस्तान की वनडे और टी-20 टीम के कप्तान होंगे। बाबर के अलावा बाएं हाथ के तेज गेंदबाज शाहीन शाह अफरीदी भी नवंबर के बाद पहली बार अंतरराष्ट्रीय क्रिकेट में वापसी करेंगे, उन्होंने पिछले महीने लाहौर कलंदर की कप्तानी करके उसे लगातार दूसरा पाकिस्तान सुपर लीग खिताब दिलाया, लेकिन घुटने की चोट के कारण इंग्लैंड और न्यूजीलैंड के खिलाफ घरेलू श्रृंखला नहीं खेल सके थे। राष्ट्रीय चयनकर्ताओं ने बाबर, शाहीन, हारिस रऊफ, फखर जमां और मोहम्मद रिजवान को शारजाह में अफगानिस्तान के खिलाफ टी-20 श्रृंखला में आराम दिया था। अफगानिस्तान ने वह श्रृंखला 2-1 से जीती। न्यूजीलैंड के खिलाफ श्रृंखलाएं 14 अप्रैल से सात मई के बीच लाहौर, रावलपिंडी और कराची में खेली जाएगी। बाबर आजम (कप्तान), शादाब खान (उप-कप्तान), फहीम अशरफ, फखर जमां, हारिस रऊफ, इफ्तिखार अहमद, इहसानुल्लाह, इमाद वसीम, मोहम्मद हारिस, मोहम्मद नवाज, मोहम्मद रिजवान, नसीम शाह, सईम अयूब। शाहीन शाह अफरीदी, शान मसूद और जमान खान बाबर आजम (कप्तान), शादाब खान (उप-कप्तान), अब्दुल्ला शफीक, फखर जमान, हारिस रऊफ, हारिस सोहेल, इहसानुल्लाह, इमाम-उल-हक, मोहम्मद नवाज, मोहम्मद रिजवान, मोहम्मद वसीम जूनियर, नसीम शाह , सलमान अली आगा, शाहीन शाह अफरीदी, शान मसूद और उसामा मीर। रिजर्व खिलाड़ीः अब्बास अफरीदी, अबरार अहमद और तैय्यब ताहिर","pubDate":"2023-04-04 16:52:38","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"}]}