{"newsArray":[{"article_id":"27ed7bd80865c674e48e0dbc2e282898","title":"Sri Lanka fined for slow over-rate against South Africa","link":"https://www.ft.lk/sports/Sri-Lanka-fined-for-slow-over-rate-against-South-Africa/23-753842","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka has been fined 10% of their match fee for maintaining a slow over-rate against South Africa in Match 4 of the ICC Men’s Cricket World Cup on Saturday. Javagal Srinath of the Emirates ICC Elite Panel of Match Referees imposed the sanction after Dasun Shanaka’s side was ruled to be 2 over(s) short of the target after time allowances were taken into consideration. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined 5% of their match fees for every over if their side fails to bowl in the allotted time. Dasun Shanaka pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing. On-field umpires Richard Illingworth and Shahid Saikat, third umpire Michael Gough and fourth umpire Alex Wharf levelled the charge.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"51d74881c904ad657fdc804c764ed26d","title":"Sri Lanka should take heart from Proteas bashing","link":"https://www.ft.lk/sports/Sri-Lanka-should-take-heart-from-Proteas-bashing/23-753843","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka whose bowlers were put to the sword by South Africa’s batsmen in their opening World Cup match at Delhi should not be disheartened from the pummelling they received at the hands of Quinton de Kock, Rassie van der Dussen and Aidan Markram, but use that experience to improve their bowling skills on flat surfaces which they will come across during their remaining matches of the tournament. The manner in which Markram batted showed that he was in a totally different plane to the rest of the batsmen. He was in such sublime form that any bowling attack would have found it difficult to curb his stroke play. Markram was the first to admit that it was a day where nothing could go wrong for him. “When it’s your day, try to cash in and really make it count,” he said at the post-match media conference. “Luckily, tonight, balls hit gaps. I mean, they don’t always hit gaps. And it could be a different story, but yeah thankful it worked out that way and again it was a really good pitch so that definitely assisted.” Cricketers usually experience that kind of feeling during their careers and on Saturday it was Markram’s day. He raced away to the fastest hundred by anyone at a World Cup off 49 balls and South Africa to the highest ever total in a World Cup game – 428-5. It is nothing to be ashamed of that South Africa scored as many against an inexperienced Sri Lankan bowling attack. South Africa came to the World Cup having hammered Australia for 416-5 in an ODI played at the Centurion where they won by 164 runs less than a month ago. The Australian bowlers who were taken to task were Josh Hazlewood, Marcus Stoinis, Adam Zampa, Michael Nesser and Nathan Ellis. The day before the match Sri Lanka head Coach Chris Silverwood having looked at the Delhi pitch said that it was belter, and it proved so. A total of 754 runs were scored on it surpassing the previous highest aggregate at a World Cup match of 714 between Australia and Bangladesh at Nottingham in 2019. This sort of assault on the Sri Lankan bowlers cannot be ruled out in future matches for as compared to the rest of the nine teams in the competition, Sri Lanka has the least experienced bowling line-up. They sorely missed Wanindu Hasaranga, Dushmantha Chameera and Maheesh Theekshana who was in the dugout watching the carnage that was taking place before him. Theekshana could come into the team for Sri Lanka’s next match against Pakistan at Hyderabad on Tuesday and lend a little bit of experience to what one could describe as an uncooked bowling attack. The four frontline bowlers picked for the match – Rajitha, Madushanka, Pathirana and Wellalage had a total of 59 ODIs and 79 wickets between them. Against such an inexperienced line-up any team on a surface like the one at Delhi would have made merry. It is certainly a big headache for the coaching staff to strategize on how this bowling could contain or take wickets against an opposition if there is no help at all from the wicket. Sri Lanka didn’t have luck on their side either because a couple of half chances and a run out were missed. When your bowling is weak, fielding comes into play in a big way to compensate for it and half chances like the ones that Sri Lanka missed out on should have been taken to encourage the bowling unit. Sri Lanka certainly didn’t have a chance of chasing down South Africa’s massive total but at least they made an effort to put up a decent show with the bat and reach 326. If not for the difference in the wickets lost Sri Lanka could have given South Africa a good run. At the end of 40 overs they were on par with South Africa at 291-8 as against 291-3, the only difference being the loss of wickets. Kusal Mendis, the way he began, looked as if he was determined to chase after Markram’s record-breaking century. But it was too good to last and once he succumbed, the chase simply lost its momentum and it boiled down to how well Sri Lanka could utilise the remaining overs – there were 37 left. They managed to last 32, which raises the question why they are unable to consume their full quota of 50. This is the third successive occasion in this World Cup that Sri Lanka has failed to bat out their full quota, the first two being in the warm-up games. That is one area Sri Lanka needs to really work on for it’s a cardinal sin in ODI cricket not to use your full quota. One encouraging factor to emerge from the match was that Charith Asalanka and skipper Dasun Shanaka managed to spend time in the middle to score fifties. Asalanka has proved time and again that he is rock solid in the middle-order lending that stability which the team needs. As for Shanaka, he could breathe a bit easy having finally managed to come up with a half-century after failures in his past 17 innings. He was not at his best but the innings would give him a world of good for his confidence for the rest of the tournament.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"b45643ef9bc2fe61916658db1de7d2e7","title":"India gifted Asian Games cricket gold over Afghanistan by ranking rule","link":"https://www.ft.lk/sports/India-gifted-Asian-Games-cricket-gold-over-Afghanistan-by-ranking-rule/23-753836","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Gifted an armchair ride by Asian Games organisers, India has taken gold in men’s cricket as the rain-hit T20 final against Afghanistan was decided by the superpower’s superior global ranking. Afghanistan, ranked 10th in the ICC’s T20 rankings versus world number one India, was left with silver on Saturday and powerless to do anything about it after rain halted the match when they were 112 for five after 18.2 overs of the first innings. With India unable to bat a minimum of five overs, and play was abandoned soon after 5 p.m. local time (09:00 GMT), leaving Ruturaj Gaikwad’s team to celebrate victory by default. Deciding results based purely on teams’ global rankings is almost unheard of in cricket, let alone for finals in major tournaments. Most allow spare days so that deciders can be completed if rain washes out play in the original match. If no spare days are provided, a winner is generally declared via tie-breaking criteria based on a team’s performances within the tournament they are playing. Twenty20 cricket has been played at the Asian Games twice before, at Guangzhou 2010 and Incheon 2014, with Bangladesh and then Sri Lanka crowned men’s winners. Afghanistan were runners-up both times, but India did not take part. The rankings rule also helped India’s gold medal-winning women’s team reach the semifinals after rain washed out their quarterfinal against Malaysia. India went on to beat Sri Lanka by 19 runs to be crowned women’s champions last week. Rain also hit the men’s bronze medal playoff won by Bangladesh against Pakistan but held off long enough to at least ensure a contest between the teams.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8b6affa4bf1cfcc4782ed6fb8587d861","title":"Marsh grasses and Kohli flowers: India take game one","link":"https://www.brisbanetimes.com.au/sport/cricket/marsh-grasses-and-kohli-flowers-india-take-game-one-20231008-p5eakr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"Australia will never know what might have happened if Mitch Marsh had taken a difficult catch from Virat Kohli. But afterwards, he stole the match away from them.","content":"For as long as Virat Kohli’s popped top-edged pull from Josh Hazlewood hung in the steamy Chepauk air, so did Australia’s suddenly alive prospects of upsetting India in this World Cup opener, making a distant memory of their pre-tournament woes and perhaps supplanting the host as the team to beat. It had happened here before. The crowd knew it; they gasped. If – when – the catch was taken, it would leave India, already reeling from a trio of top-order ducks, 4/20 in what would surely then be a vain pursuit of Australia’s admittedly modest 199. Its batting order this night was not as dependably deep as in recent years. But wicketkeeper Alex Carey and square leg Mitch Marsh, sprinting towards each other, had no time to establish right of way and a sliding Marsh dropped the catch. In the compounding way of these things, both had earlier made ducks on personally miserable nights. Hazlewood blamed no one. “I think it was Mitch’s catch and Carey got quite close in the end and might have just put Mitch off,” he said. “It’s a dropped catch, one of those things that happened.” It’s not empirically demonstrable, of course, that this was the match in a moment. Hazlewood pooh-poohed the idea. “It was quite early,” he said. “We still felt that new ball – it was doing enough, whether it was in the air or off the wicket, (and) we knew that spin was going to be tough to play. Maybe not as tough as during the day. We certainly felt in the game for quite a while until the partnership grew and grew. They sort of batted us out of it.” Mitch Marsh after being dismissed. Credit: Getty Indeed, the reprieved Kohli was as mistake-free as only he can be – and KL Rahul fell in alongside him – although he eventually fell for a textbook 85. By then, he and Rahul had added 165 and paced their country to the threshold of a four-wicket victory. Rahul finished the match by handsomely driving Australian captain Pat Cummins over long off for six to strand himself on 97 not out, whereupon non-striker Hardik Pandya shook his head at the bittersweetness of it all. In the dewy monsoonal night, Australia’s makeshift spin pair Adam Zampa and Glenn Maxwell were unable to replicate the mesmerising mastery of India’s trio spinners in the afternoon. Moreover, the Indian bowlers as a team – their quicks merit honourable mentions here, too – had so restrained Australia that the batsmen in their turn could make haste slowly, and did. Rahul goes big. Credit: AP It made for a peculiarly downbeat game for these best of rivals, paling beside the pyrotechnics of the first three days. Australia’s 199 was fewer than South Africa had made in their last 20 overs against Sri Lanka in Delhi the night before. Admittedly, this was apples and pears – Sri Lanka’s attack was feeble – but this World Cup appears to be there for the bold to take. South Africa are Australia’s next opponent. The crowd figure was of a piece with the action. At 32,351, it was well short of the stadium’s 40,000 capacity. Not yet in the tournament has a stadium been full, though notionally every match has sold out. Cricket might be a religion in this country, but it belongs to an exclusive brethren. But there’s no mystery; it’s down to chronic disorganisation. Other than that 12-ball, three-wicket counterpunch at the top of India’s innings, this was a largely forgettable opening sally for Australia, in which their recent shortcomings were again exposed: inability to accelerate with the bat and lack of penetration in spin bowling. Hazlewood refuted the idea that the spin department was lacking, saying he regarded Maxwell in India as a frontliner, but conditions had militated against rather than for them this day. Australia, drawing on previous experience, had batted first in the expectation that the pitch would die and batting would become harder as the day wore on, but instead found that was at its most challenging in the afternoon sun. “It was as extreme as it gets,” he said. “It was probably a good examination to get first up, against the best spinners in the tournament. Hopefully, it’ll get a bit easier from hereon in.” From the early loss of Marsh, Australia always felt a wicket over budget. With verifiable batting only to No.7, they did not have the luxury of a wicket to throw away in the cause of a momentum-shifting blast as the Indian spinners wove their characteristic web around Australia. David Warner, Steve Smith and Marnus Labuschagne all toiled in vain to force the pace. When the squeeze became too much, Australia lost 5/30. Smith alone could be said to have been dismissed by an unplayable ball, a Ravindra Jadeja jaffa, straightening past his outside to bowl him. The Indian tweakers are a true ensemble too, each a virtuoso in a different key of their craft. In their collective 30 overs, they took 6/94. Loading If anything, the Australians’ line-up was too orthodox for an era in which 50-over cricket has become a lengthier form of the T20 format. In theory, Marcus Stoinis would change that complexion, and Travis Head, too, if he can get a doctor’s certificate in time. If ever Australia needed a hand, it’s his broken one. India’s innings began as if the sun had gone to their heads. Ishan Kishan and Shreyas Iyer were caught from extravagant drives and captain Rohit Sharma was trapped by a break-back from Josh Hazlewood and after 12 balls, India were 3/2. If Australia had short-changed themselves when batting, suddenly they were trading in a whole new currency. But once Kohli was grassed and he and Rahul settled into their task, and as the dew fell and the crowd rose, Australia’s fangs were slowly drawn. None of the bowlers were embarrassed, but none notably troubled the Indian pair as their partnership grew. Australia prides itself on being a tournament team, rising to occasions, growing into the event. They will need to be now. They have at least eight more games at seven other venues. They know all will differ slightly, which means the Australians will have to adapt their tactics and outlook as they go. That includes the wisdom of batting first and the notion of what constitutes a playable score. “We might come up against these conditions again throughout those eight games,” said Hazlewood. “We might have to reassess and say 260 is a good score rather than 300 plus as we’ve seen on some other grounds.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Cricket World Cup Australian cricket India ODI Greg Baum is chief sports columnist and associate editor with The Age. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-10-08 18:43:49","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"1e145cede3bfd79d76f976ae141475a7","title":"Rain Stays Away in Chennai As India Beat Australia By Six Wickets in ICC Cricket World Cup 2023","link":"https://www.latestly.com/sports/cricket/chennai-weather-updates-live-ind-vs-aus-icc-cricket-world-cup-2023-hourly-rain-forecast-and-weather-report-for-india-vs-australia-cwc-match-at-ma-chidambaram-stadium-5470728.html","keywords":null,"creator":null,"video_url":null,"description":"The Men in Blue begin their sojourn in the ICC Cricket World Cup 2023 against Australia. But rainfall in the past few days in Chennai has posed a threat to this game? Will rain affect this match? Read below to get updates about Chennai weather.","content":"Despite rains in Chennai preceding the match, fortunately it didn't interrupt the game at any point. A complete was possible and in the end, India came out victorious beating Australia in their opening match of the campaign riding on the emphatic performances from KL Rahul and Virat Kohli. There has been no rain so far as the India vs Australia match in ICC Cricket World Cup 2023 has gotten underway, with a bright sunny, sky up above. Players and fans would hope that this remains throughout and there is no rain interrupting this contest. The sun is out and the MA Chidambaram Stadium looks set to host this high-voltage contest. There has been no rain so far with less than two hours to go for the game to begin. Current Scenes of Chennai Stadium, The weather Looks Sunny 🌈 #INDvsAUS pic.twitter.com/IqUYcyDryf — Haroon 🏏🌠 (@HaroonM33120350) October 8, 2023 The weather gods have been kind towards fans today as there has been no sign of rain in Chennai ahead of the India vs Australia match. It has rained in the city in the past few days which has posed a threat over this match as well. The weather at the moment is pretty sunny with patchy clouds. Sunny weather,patchy clouds #Chennai #IndvsAus pic.twitter.com/LlWCDk7eQ5 — Chennai Weather-Raja Ramasamy (@chennaiweather) October 8, 2023 Good news for fans! There's no sign of rain in Chepauk so far hours before the India vs Australia ICC Cricket World Cup 2023 contest. Chennai has been witnessing unpredictable weather in the past few days but it is bright and sunny at the moment. Fans would hope the weather stays this way! It's bright & sunny at Chepauk. [Vimal Kumar] - Great news for cricket fans. pic.twitter.com/lnEHyNxSLb — Johns. (@CricCrazyJohns) October 8, 2023 The MA Chidambaram Stadium in Chennai is set to host India's first match of the ICC Cricket World Cup 2023, against mighty Australia on October 8. The contest has been talked about a lot with home fans expecting India to put up a good show and get off to a winning start to their ICC Men's Cricket World Cup 2023 campaign. India recently did beat Australia in an ODI series and although that would give the Men in Blue some confidence, Rohit Sharma and his team would be well aware of how dangerous Australia really can be if their players fire in unison. However, there remains a rain threat that looms large over this contest in Chennai. India vs Australia ICC Cricket World Cup 2023, Chennai Weather Report: Check Out Rain Forecast and Pitch Report at M Chidambaram Stadium. The capital city has been experiencing inconsistent weather in the past few days and it casts a shadow of uncertainty over this high-octane match as well. An update on the Chennai weather provided by popular cricket commentator Harsha Bhogle might be a cause of worry for fans, who would have an eye on the sky as well today. Bhogle had taken to his official account on X, formerly Twitter, and wrote, \"Bucketing down in Chennai...Very dark.\" There remains a possibility of this match being affected by rain. According to the Indian Meteorological Department (IMD), there is a 12-17% probability of rainfall in Chennai during the match hours. Moreover, there would be cloudy skies during the game. Fans would hope that should there be rain, it merely disrupts the contest for a while rather than washing it out. India could not have any warm-up match leading upto this match with rain washing out both their matches--against England and Netherlands. The Men in Blue would hope that the weather is fine when they take on Australia in this highly-anticipated CWC 2023 contest.","pubDate":"2023-10-08 18:26:53","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6bde044e3d49983f7bdffb3b9ed1fbf6","title":"World Cup 2023: कोहली की इस टिप्स ने किया कमाल, KL राहुल ने मानी विराट की बात, जानें ऑस्ट्रेलिया को कैसे दी मात","link":"https://hindi.latestly.com/sports/cricket/kohli-had-advised-me-to-bat-like-a-test-match-for-some-time-rahulr-1948382.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ नाबाद 97 रन की पारी खेलकर भारत को विश्व कप के अपने पहले मैच में मुश्किल परिस्थितियों से उबार कर छह विकेट की यादगार जीत दिलाने वाले लोकेश राहुल ने कहा कि पूर्व कप्तान विराट कोहली ने शुरुआती ओवरों में विकेटों के पतझड़ के बाद उन्हें टेस्ट मैच की तरह बल्लेबाजी करने की सलाह दी थी.","content":"चेन्नई, 8 अक्टूबर: ऑस्ट्रेलिया के खिलाफ नाबाद 97 रन की पारी खेलकर भारत को विश्व कप के अपने पहले मैच में मुश्किल परिस्थितियों से उबार कर छह विकेट की यादगार जीत दिलाने वाले लोकेश राहुल ने कहा कि पूर्व कप्तान विराट कोहली ने शुरुआती ओवरों में विकेटों के पतझड़ के बाद उन्हें टेस्ट मैच की तरह बल्लेबाजी करने की सलाह दी थी. राहुल अपने शतक से चूक गये लेकिन दो रन पर टीम के तीन विकेट गिरने के बाद उन्होंने कोहली (116 गेंद में 85 रन) के साथ चौथे विकेट के लिए 165 रन की साझेदारी कर भारत का दबदबा बनाया. भारतीय टीम ने जीत के लिए मिले 200 रन के लक्ष्य को 52 गेंद शेष रहते चार विकेट गंवाकर हासिल कर लिया. मैन ऑफ द मैच राहुल ने मैच के बाद कहा, ‘‘ मैं और कोहली ज्यादा बात नहीं कर रहे थे. मैं शुरुआत में संभल कर खेलने की कोशिश कर रहा था. मैं नहाकर ड्रेसिंग रूम में बैठा ही था कि तीन विकेट गिर गये.’’ उन्होने कहा, ‘‘ कोहली ने मुझे कहा कि बिना जोखिम वाले शॉट लगाने के साथ कुछ देर के लिए हमें टेस्ट क्रिकेट की तरह खेलना होगा. पारी की शुरुआती में तेज गेंदबाजों को मदद मिल रही थी लेकिन बाद में ओस के कारण परिस्थितियां बल्लेबाजी के लिए आसान हो गयी.’’ ICC World Cup 2023 Points Table Updated: वर्ल्ड कप में टीम इंडिया का जीत के साथ आगाज़, अंक तालिका पर न्यूजीलैंड का दबदबा बरकरार, यहां देखें सभी टीमों की स्तिथि छक्का लगाकर टीम को जीत दिलाने वाले इस बल्लेबाज ने शतक से चूकने के बारे में कहा, ‘‘ मैं आखिरी पलों में सोच रहा था कि मैं कैसे 100 रन तक पहुंच सकता हूं. मैंने सोचा कि अगर एक चौका और एक छक्का लगाया जाए तो यह संभव हो सकता है. मैंने चौका लगाने की कोशिश की थी लेकिन गेंद का बल्ले से संपर्क ज्यादा अच्छे से हो गया. मुझे इसका कोई मलाल नहीं, मैं कभी और शतक लगा लूंगा.’’ An incredible 97* in the chase when the going got tough 👏👏 KL Rahul receives the Player of the Match award as #TeamIndia start #CWC23 with a 6-wicket win 👌👌 Scorecard ▶️ https://t.co/ToKaGif9ri #CWC23 | #INDvAUS | #TeamIndia | #MeninBlue pic.twitter.com/rY7RfHM1Bf — BCCI (@BCCI) October 8, 2023 भारतीय कप्तान रोहित शर्मा ने भी इस जीत का श्रेय राहुल और कोहली की साझेदारी को दिया. रोहित ने कहा, ‘‘जब हमने शुरुआती तीन विकेट गंवाये तो मैं नर्वस हो गया था. हमने इस दौरान खराब शॉट खेले. ऑस्ट्रेलिया गेंदबाजों को इसका श्रेय दिया जाना चाहिये. हालांकि उसके बाद राहुल और कोहली ने कमाल का खेल दिखाया.’’ रोहित ने ऑस्ट्रेलिया को कम स्कोर पर रोकने के लिए गेंदबाजों और क्षेत्ररक्षकों की सराहना की. उन्होंने कहा, ‘‘ इस तरह से विश्व कप की शुरुआत करना शानदार है. हमने क्षेत्ररक्षण में सुधार के लिए काफी मेहनत की है और आज इसमें मामले में टीम ने अच्छा किया. हमारे खिलाड़ियों ने इन परिस्थितियों का फायदा उठाया.’’ऑस्ट्रेलिया के कप्तान पैट कमिंस ने कहा कि उनकी टीम ने 50 रन कम बनाये थे. End of a magnificent knock from Virat Kohli, who departs for 85 👏👏 #TeamIndia 168/4, with 32 more runs to win. Follow the Match ▶️ https://t.co/ToKaGif9ri #CWC23 | #INDvAUS | #MeninBlue pic.twitter.com/YL4J8DrI6Y — BCCI (@BCCI) October 8, 2023 कमिंस ने कहा, ‘‘ मेरा मानना है कि हमारी टीम ने 50 रन कम बनाये. इस पिच से स्पिनरों को मदद मिल रही थी . भारतीय टीम के पास अच्छे गेंदबाज हैं.’’ उन्होंने कहा, ‘‘हमारी टीम में दो ही स्पिनर थे लेकिन हम 250 के आसपास रन बनाते तो इससे काफी फर्क पड़ सकता था.’’ (यह सिंडिकेटेड न्यूज़ फीड से अनएडिटेड और ऑटो-जेनरेटेड स्टोरी है, ऐसी संभावना है कि लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है)","pubDate":"2023-10-08 18:11:14","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"52efafbb0b00c3f01903194792f7e4ec","title":"World Cup 2023 IND vs AUS: Athiya Shetty, Ayushmann Khurrana and Other Celebs Rejoice Over Team India's Win By Six Wickets","link":"https://www.latestly.com/socially/entertainment/bollywood/world-cup-2023-ind-vs-aus-athiya-shetty-ayushmann-khurrana-and-other-celebs-rejoice-over-team-indias-win-by-six-wickets-5472278.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli and KL Rahul were the best players in today's match! With India's win, the team have kicked-off the World Cup 2023 campaign with a six-wicket victory against Australia in Chennai.","content":"Team India turned victor in today's (Oct 8) ICC Cricket World Cup match against Australia. The Men in Blue defeated Aussies by six-wicket and made the country proud. Not only common man, but even many celebs took to their social media handles and hailed the Indian team for putting up a fab show on field. Right from Riteish Deshmukh, Ayushmann Khurrana and many more, stars celebrated India's victory online. Let's check out their reactions below. ICC Cricket World Cup 2023 Points Table Updated: South Africa Kickstart Campaign With Emphatic 102-Run Victory, New Zealand Continue to be on Top . Riteish Deshmukh Architects of today’s victory - absolute master class by @imVkohli & @klrahul - thundering start for India. #WorldCup2023 #IndVsAus https://t.co/WpX9SJhBTd — Riteish Deshmukh (@Riteishd) October 8, 2023 Nakuul Mehta Great start to the World Cup by Team India. Terrible work by the BOARD to keep loyal paying fans away from the game. #IndVsAus — Nakuul Mehta (@NakuulMehta) October 8, 2023 Sophie Choudry Let’s go Indiaaaaaa 🇮🇳 👏🏼👏🏼 Congrats #teamindia esp @imVkohli and @klrahul … superb innings, wonderful start to our World Cup!!! #WorldCup2023 #KLRahul #ViratKohli — Sophie C (@Sophie_Choudry) October 8, 2023 Ayushmann Khurrana Athiya Shetty (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-10-08 18:03:22","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"413c5bd852e9d002eff122e3e082ade7","title":"Sachin Tendulkar, Virender Sehwag and Other Members of Cricket Fraternity React After India Defeat Australia By Six Wickets in ICC Cricket World Cup 2023 Clash","link":"https://www.latestly.com/socially/sports/cricket/sachin-tendulkar-virender-sehwag-and-other-members-of-cricket-fraternity-react-after-india-defeat-australia-by-six-wickets-in-icc-cricket-world-cup-2023-clash-5472293.html","keywords":null,"creator":null,"video_url":null,"description":"India started their campaign with an emphatic victory against Australia riding on the performances of Virat Kohli and KL Rahul. Elated former cricketers reacted on the memorable win.","content":"India won their first game of the ICC Cricket World Cup 2023 against Australia at Chennai displaying a brilliant all-round performance with both ball and bat. First they squeezed Australia with the spinners crumbling them for only 199 runs and then during the chase, despite being in a dire situation, powered themselves out of it riding on the brilliant knocks of Virat Kohli and KL Rahul and won the match registering first points on the table. Sachin Tendulkar, Virender Sehwag, Irfan Pathan were elated by the performance and took to social media to react. I was surprised to see Australia bat first after winning the toss. Commendable performance by the Indian bowlers to restrict them to 199. Australia started well but I felt they missed a left-arm spinner on this surface. The partnership between Virat and Rahul sealed the game for… pic.twitter.com/qUr21Vaqxb — Sachin Tendulkar (@sachin_rt) October 8, 2023 Virender Sehwag's Reaction Laal Fool, Peela Fool. Rahul and Kohli batting beautiful. A partnership to remember for a long time. भारत को जीत पर बधाई । #WorldCup2023 pic.twitter.com/fQJVLgSt6s — Virender Sehwag (@virendersehwag) October 8, 2023 Irfan Pathan's Reaction India 🇮🇳 started the World Cup campaign with a bang. Team is looking solid. Kohli never disappoints the team when he is really needed. Today was no different. And Kl Rahul is playing with great Klass. jaddu baapu tu to kamal che 👏 #IndVsAus — Irfan Pathan (@IrfanPathan) October 8, 2023 Harbhajan Singh's Reaction What an incredible beginning to India's world cup journey! Victory against Australia will give a boost to confidence of players. Brilliant partnership between @imVkohli and @klrahul paved the way for this unforgettable win! Keep up the momentum. pic.twitter.com/lbtUBzcppf — Harbhajan Turbanator (@harbhajan_singh) October 8, 2023 Wasim Jaffer's Reaction Pressure doesn't get bigger than when you're 2/3 in a WC game vs a charged up Aus. Then to soak the pressure, wrestle the initiative back, and win the game takes something special. This was a partnership for the ages 🙌🏽 Well played 👏🏽 #INDvAUS #CWC2023 pic.twitter.com/QDJ5uuR1TL — Wasim Jaffer (@WasimJaffer14) October 8, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-10-08 17:59:40","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"210e81923f7ae3ffa848a2de049be20f","title":"IND vs AUS: दो रन पर तीन विकेट गिरने के बावजूद मिली जीत तो खुशी से गदगद दिखे रोहित, मैच के बाद दिया बड़ा बयान","link":"https://www.abplive.com/sports/cricket/odi-world-cup-2023-ind-vs-aus-indian-captain-rohit-sharma-s-reaction-after-wining-against-australia-2510832","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"Rohit Sharma's Reaction: भारत ने विश्व कप 2023 का पहला मुकाबला ऑस्ट्रेलिया के खिलाफ खेला, जिसमें मेज़बान भारत ने 6 विकेट से जीत दर्ज की. भारत की इस जीत में केएल राहुल और विराट कोहली ने बल्ले से अहम किरदार अदा किया. वहीं गेंदबाज़ी में रवींद्र जडेजा ने सबसे ज़्यादा विकेट लिए. भारत की ओर से फील्डिंग में काफी चुस्ती दिखाई दी. सिर्फ टीम का टॉप ऑर्डर कमज़ोर रहा, बाकी पूरी टीम ने शानदार खेल दिखाया, जिससे कप्तान रोहित शर्मा काफी खुश दिखाई दिए.  रोहित शर्मा ने मैच के बाद पूरी टीम की तारीफ की. इसके अलावा उन्होंने केएल राहुल और विराट कोहली की बैटिंग की अलग से सराहा. भारतीय कप्तान ने कहा, “बहुत उत्साहित. टॉप पर आकर अच्छी फीलिंग है. टूर्नामेंट की शुरुआत के लिए अच्छा गेम था. मुझे लगा कि यह शानदार था, खासकर फील्डिंग और सभी की तरफ से हमने आज जो प्रयास देखा, इस तरह की कंडीशन मुश्किल होंगी.” भारतीय कप्तान ने आगे कहा, “हमारे गेंदबाज़ों ने परिस्थितियों का अच्छी तरह से इस्तेमाल किया और हमे पता था कि यहां सबके लिए मदद होगी, यहां तक तेज़ गेंदबाज़ों को भी कुछ रिवर्स स्विंग मिली, स्पिनर्स ने अच्छे एरिया में गेंदबाज़ी की और कुल मिलाकर यह शानदार एफर्ट था. मैं घबराया हुआ था, आप इस तरह से अपनी पारी की शुरुआत नहीं करना चाहते हैं, ऑस्ट्रेलियाई गेंदबाज़ों को क्रेडिट क्योंकि उन्होंने अच्छे एरिया में गेंदबाज़ी की लेकिन कुछ खराब शॉट भी रहे. जब आपके आगे ऐसा लक्ष्य होता है तो आप पॉवरप्ले में ज़्यादा से ज़्यादा रन बनाना चाहते हैं.” राहुल विराट की ऐसे की तारीफ भारतीय कप्तान ने केएल राहुल और विराट कोहली की खासकर तारीफ की. उन्होंने कहा, “राहुल और विराट को क्रेडिट जाता है कि कैसे वो चेज की ओर गए. टीम के रूप में यह चुनौती होगी, अलग-अलग परिस्थितियों में जाना और उन्हें अपनाना, जिसे भी परिस्थितिया सूट करेंगी वो आकर काम करेगा. चेन्नई कभी निराश नहीं करता है, वे अपने क्रिकेट से प्यार करते हैं और उनके लिए गर्मी में आकर बैठना और टीम का उत्साह बढ़ाना बहुत कुछ कहता है.”   ये भी पढ़ें... IND vs AUS: 'टेस्ट क्रिकेट की तरह खेला...', प्लेयर ऑफ द मैच बने केएल राहुल ने जीत के स्पेशल प्लान का किया खुलासा","content":"Rohit Sharma's Reaction: भारत ने विश्व कप 2023 का पहला मुकाबला ऑस्ट्रेलिया के खिलाफ खेला, जिसमें मेज़बान भारत ने 6 विकेट से जीत दर्ज की. भारत की इस जीत में केएल राहुल और विराट कोहली ने बल्ले से अहम किरदार अदा किया. वहीं गेंदबाज़ी में रवींद्र जडेजा ने सबसे ज़्यादा विकेट लिए. भारत की ओर से फील्डिंग में काफी चुस्ती दिखाई दी. सिर्फ टीम का टॉप ऑर्डर कमज़ोर रहा, बाकी पूरी टीम ने शानदार खेल दिखाया, जिससे कप्तान रोहित शर्मा काफी खुश दिखाई दिए. रोहित शर्मा ने मैच के बाद पूरी टीम की तारीफ की. इसके अलावा उन्होंने केएल राहुल और विराट कोहली की बैटिंग की अलग से सराहा. भारतीय कप्तान ने कहा, “बहुत उत्साहित. टॉप पर आकर अच्छी फीलिंग है. टूर्नामेंट की शुरुआत के लिए अच्छा गेम था. मुझे लगा कि यह शानदार था, खासकर फील्डिंग और सभी की तरफ से हमने आज जो प्रयास देखा, इस तरह की कंडीशन मुश्किल होंगी.” भारतीय कप्तान ने आगे कहा, “हमारे गेंदबाज़ों ने परिस्थितियों का अच्छी तरह से इस्तेमाल किया और हमे पता था कि यहां सबके लिए मदद होगी, यहां तक तेज़ गेंदबाज़ों को भी कुछ रिवर्स स्विंग मिली, स्पिनर्स ने अच्छे एरिया में गेंदबाज़ी की और कुल मिलाकर यह शानदार एफर्ट था. मैं घबराया हुआ था, आप इस तरह से अपनी पारी की शुरुआत नहीं करना चाहते हैं, ऑस्ट्रेलियाई गेंदबाज़ों को क्रेडिट क्योंकि उन्होंने अच्छे एरिया में गेंदबाज़ी की लेकिन कुछ खराब शॉट भी रहे. जब आपके आगे ऐसा लक्ष्य होता है तो आप पॉवरप्ले में ज़्यादा से ज़्यादा रन बनाना चाहते हैं.” राहुल विराट की ऐसे की तारीफ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); भारतीय कप्तान ने केएल राहुल और विराट कोहली की खासकर तारीफ की. उन्होंने कहा, “राहुल और विराट को क्रेडिट जाता है कि कैसे वो चेज की ओर गए. टीम के रूप में यह चुनौती होगी, अलग-अलग परिस्थितियों में जाना और उन्हें अपनाना, जिसे भी परिस्थितिया सूट करेंगी वो आकर काम करेगा. चेन्नई कभी निराश नहीं करता है, वे अपने क्रिकेट से प्यार करते हैं और उनके लिए गर्मी में आकर बैठना और टीम का उत्साह बढ़ाना बहुत कुछ कहता है.” ये भी पढ़ें... IND vs AUS: 'टेस्ट क्रिकेट की तरह खेला...', प्लेयर ऑफ द मैच बने केएल राहुल ने जीत के स्पेशल प्लान का किया खुलासा","pubDate":"2023-10-08 17:42:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/08/af4cf33c1249f258b72b3f4d333e22271696786680969582_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"8f89d3c004a70b94baea8929a410fa86","title":"Might have to change combinations as per different conditions: Rohit Sharma","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/08/might-have-to-change-combinations-as-per-different-conditions-rohit-sharma-2622056.html","keywords":null,"creator":null,"video_url":null,"description":"However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. CHENNAI: Rohit Sharma on Sunday admitted that the biggest challenge in front of his side would be to play in different conditions, and the Indian captain also did not rule out making changes in team combinations to suit the demands of a particular venue. However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. \"That will be the biggest challenge moving forward because we will play in different conditions. (We) might have to change combinations too and as a team we are prepared to do that,\" said Rohit during the post-match presentation. Rohit was particularly pleased with the team's fielding. \"Good feeling to come out on top. Magnificent, especially the fielding. The fielding was something we really put our effort on. It was a great effort. In conditions like this it can be tough sometimes. We knew there would be assistance for everyone. Seamers got reverse, spinners bowled in nice areas. All in all a great effort,\" he said. Rohit was one of the three top-order India batters to get out for a duck, and the skipper admitted to being nervous with the home team reeling at 2/3 in the second over. \"Yes I was (nervous) to be honest. You don't want to start like that when chasing a target. Credit to Australia, but some loose shots there as well. But that happens, you want to get off the mark and score quickly in the powerplay.\" \"But hats off to Virat and KL - the way they stuck out there to create a match-winning partnership,\" Rohit said. Australian captain Pat Cummins felt his team was 50 runs short of what could have been a challenging total. \"At least 50-odd. It was tough, trying to defend anything under 200. It was a really good bowling attack and their spinners made it tough work out there. \"I wasn't too upset (with just two spinners), we had 20 overs of spin but some more runs on the board would have made the difference,\" Cummins said. When asked about the drop catch by Mitchell Marsh early on in Kohli's innings, Cummins said, \"I have already forgotten about it, it happens, 4/10 would have been a dream start. \"Just one game out of nine, not too much to ponder about but there are some areas we need to get better.\" Arriving at the crease with his team in a spot of bother, Rahul said Kohli had advised him to play out that difficult period like they do in Test cricket. \"Quite honestly, there weren't a lot of conversations (with Kohli). I thought I'd get a good shower and get a break. I was just trying to get my breath back.\" \"Virat said there's a bit in the wicket, so play like Test cricket for a while. There was a bit of help for the pacers with the new ball, and then the spinners also,\" Rahul said. \"In the last 15-20 overs, dew played a part and that helped quite a bit. The ball also skidded on better. However, it was a bit two-paced, it wasn't the easiest of wickets to bat on and it wasn't flat as well.\" \"It was a good cricket wicket, bit for the batters and the bowlers. That's what you get in the south of India, especially in Chennai.","content":"CHENNAI: Rohit Sharma on Sunday admitted that the biggest challenge in front of his side would be to play in different conditions, and the Indian captain also did not rule out making changes in team combinations to suit the demands of a particular venue. However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. \"That will be the biggest challenge moving forward because we will play in different conditions. (We) might have to change combinations too and as a team we are prepared to do that,\" said Rohit during the post-match presentation. Rohit was particularly pleased with the team's fielding. \"Good feeling to come out on top. Magnificent, especially the fielding. The fielding was something we really put our effort on. It was a great effort. In conditions like this it can be tough sometimes. We knew there would be assistance for everyone. Seamers got reverse, spinners bowled in nice areas. All in all a great effort,\" he said. Rohit was one of the three top-order India batters to get out for a duck, and the skipper admitted to being nervous with the home team reeling at 2/3 in the second over. \"Yes I was (nervous) to be honest. You don't want to start like that when chasing a target. Credit to Australia, but some loose shots there as well. But that happens, you want to get off the mark and score quickly in the powerplay.\" \"But hats off to Virat and KL - the way they stuck out there to create a match-winning partnership,\" Rohit said. Australian captain Pat Cummins felt his team was 50 runs short of what could have been a challenging total. \"At least 50-odd. It was tough, trying to defend anything under 200. It was a really good bowling attack and their spinners made it tough work out there. \"I wasn't too upset (with just two spinners), we had 20 overs of spin but some more runs on the board would have made the difference,\" Cummins said. When asked about the drop catch by Mitchell Marsh early on in Kohli's innings, Cummins said, \"I have already forgotten about it, it happens, 4/10 would have been a dream start. \"Just one game out of nine, not too much to ponder about but there are some areas we need to get better.\" Arriving at the crease with his team in a spot of bother, Rahul said Kohli had advised him to play out that difficult period like they do in Test cricket. \"Quite honestly, there weren't a lot of conversations (with Kohli). I thought I'd get a good shower and get a break. I was just trying to get my breath back.\" \"Virat said there's a bit in the wicket, so play like Test cricket for a while. There was a bit of help for the pacers with the new ball, and then the spinners also,\" Rahul said. \"In the last 15-20 overs, dew played a part and that helped quite a bit. The ball also skidded on better. However, it was a bit two-paced, it wasn't the easiest of wickets to bat on and it wasn't flat as well.\" \"It was a good cricket wicket, bit for the batters and the bowlers. That's what you get in the south of India, especially in Chennai.","pubDate":"2023-10-08 17:42:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"27ed7bd80865c674e48e0dbc2e282898","title":"Sri Lanka fined for slow over-rate against South Africa","link":"https://www.ft.lk/sports/Sri-Lanka-fined-for-slow-over-rate-against-South-Africa/23-753842","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka has been fined 10% of their match fee for maintaining a slow over-rate against South Africa in Match 4 of the ICC Men’s Cricket World Cup on Saturday. Javagal Srinath of the Emirates ICC Elite Panel of Match Referees imposed the sanction after Dasun Shanaka’s side was ruled to be 2 over(s) short of the target after time allowances were taken into consideration. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined 5% of their match fees for every over if their side fails to bowl in the allotted time. Dasun Shanaka pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing. On-field umpires Richard Illingworth and Shahid Saikat, third umpire Michael Gough and fourth umpire Alex Wharf levelled the charge.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"51d74881c904ad657fdc804c764ed26d","title":"Sri Lanka should take heart from Proteas bashing","link":"https://www.ft.lk/sports/Sri-Lanka-should-take-heart-from-Proteas-bashing/23-753843","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka whose bowlers were put to the sword by South Africa’s batsmen in their opening World Cup match at Delhi should not be disheartened from the pummelling they received at the hands of Quinton de Kock, Rassie van der Dussen and Aidan Markram, but use that experience to improve their bowling skills on flat surfaces which they will come across during their remaining matches of the tournament. The manner in which Markram batted showed that he was in a totally different plane to the rest of the batsmen. He was in such sublime form that any bowling attack would have found it difficult to curb his stroke play. Markram was the first to admit that it was a day where nothing could go wrong for him. “When it’s your day, try to cash in and really make it count,” he said at the post-match media conference. “Luckily, tonight, balls hit gaps. I mean, they don’t always hit gaps. And it could be a different story, but yeah thankful it worked out that way and again it was a really good pitch so that definitely assisted.” Cricketers usually experience that kind of feeling during their careers and on Saturday it was Markram’s day. He raced away to the fastest hundred by anyone at a World Cup off 49 balls and South Africa to the highest ever total in a World Cup game – 428-5. It is nothing to be ashamed of that South Africa scored as many against an inexperienced Sri Lankan bowling attack. South Africa came to the World Cup having hammered Australia for 416-5 in an ODI played at the Centurion where they won by 164 runs less than a month ago. The Australian bowlers who were taken to task were Josh Hazlewood, Marcus Stoinis, Adam Zampa, Michael Nesser and Nathan Ellis. The day before the match Sri Lanka head Coach Chris Silverwood having looked at the Delhi pitch said that it was belter, and it proved so. A total of 754 runs were scored on it surpassing the previous highest aggregate at a World Cup match of 714 between Australia and Bangladesh at Nottingham in 2019. This sort of assault on the Sri Lankan bowlers cannot be ruled out in future matches for as compared to the rest of the nine teams in the competition, Sri Lanka has the least experienced bowling line-up. They sorely missed Wanindu Hasaranga, Dushmantha Chameera and Maheesh Theekshana who was in the dugout watching the carnage that was taking place before him. Theekshana could come into the team for Sri Lanka’s next match against Pakistan at Hyderabad on Tuesday and lend a little bit of experience to what one could describe as an uncooked bowling attack. The four frontline bowlers picked for the match – Rajitha, Madushanka, Pathirana and Wellalage had a total of 59 ODIs and 79 wickets between them. Against such an inexperienced line-up any team on a surface like the one at Delhi would have made merry. It is certainly a big headache for the coaching staff to strategize on how this bowling could contain or take wickets against an opposition if there is no help at all from the wicket. Sri Lanka didn’t have luck on their side either because a couple of half chances and a run out were missed. When your bowling is weak, fielding comes into play in a big way to compensate for it and half chances like the ones that Sri Lanka missed out on should have been taken to encourage the bowling unit. Sri Lanka certainly didn’t have a chance of chasing down South Africa’s massive total but at least they made an effort to put up a decent show with the bat and reach 326. If not for the difference in the wickets lost Sri Lanka could have given South Africa a good run. At the end of 40 overs they were on par with South Africa at 291-8 as against 291-3, the only difference being the loss of wickets. Kusal Mendis, the way he began, looked as if he was determined to chase after Markram’s record-breaking century. But it was too good to last and once he succumbed, the chase simply lost its momentum and it boiled down to how well Sri Lanka could utilise the remaining overs – there were 37 left. They managed to last 32, which raises the question why they are unable to consume their full quota of 50. This is the third successive occasion in this World Cup that Sri Lanka has failed to bat out their full quota, the first two being in the warm-up games. That is one area Sri Lanka needs to really work on for it’s a cardinal sin in ODI cricket not to use your full quota. One encouraging factor to emerge from the match was that Charith Asalanka and skipper Dasun Shanaka managed to spend time in the middle to score fifties. Asalanka has proved time and again that he is rock solid in the middle-order lending that stability which the team needs. As for Shanaka, he could breathe a bit easy having finally managed to come up with a half-century after failures in his past 17 innings. He was not at his best but the innings would give him a world of good for his confidence for the rest of the tournament.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"b45643ef9bc2fe61916658db1de7d2e7","title":"India gifted Asian Games cricket gold over Afghanistan by ranking rule","link":"https://www.ft.lk/sports/India-gifted-Asian-Games-cricket-gold-over-Afghanistan-by-ranking-rule/23-753836","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Gifted an armchair ride by Asian Games organisers, India has taken gold in men’s cricket as the rain-hit T20 final against Afghanistan was decided by the superpower’s superior global ranking. Afghanistan, ranked 10th in the ICC’s T20 rankings versus world number one India, was left with silver on Saturday and powerless to do anything about it after rain halted the match when they were 112 for five after 18.2 overs of the first innings. With India unable to bat a minimum of five overs, and play was abandoned soon after 5 p.m. local time (09:00 GMT), leaving Ruturaj Gaikwad’s team to celebrate victory by default. Deciding results based purely on teams’ global rankings is almost unheard of in cricket, let alone for finals in major tournaments. Most allow spare days so that deciders can be completed if rain washes out play in the original match. If no spare days are provided, a winner is generally declared via tie-breaking criteria based on a team’s performances within the tournament they are playing. Twenty20 cricket has been played at the Asian Games twice before, at Guangzhou 2010 and Incheon 2014, with Bangladesh and then Sri Lanka crowned men’s winners. Afghanistan were runners-up both times, but India did not take part. The rankings rule also helped India’s gold medal-winning women’s team reach the semifinals after rain washed out their quarterfinal against Malaysia. India went on to beat Sri Lanka by 19 runs to be crowned women’s champions last week. Rain also hit the men’s bronze medal playoff won by Bangladesh against Pakistan but held off long enough to at least ensure a contest between the teams.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8b6affa4bf1cfcc4782ed6fb8587d861","title":"Marsh grasses and Kohli flowers: India take game one","link":"https://www.brisbanetimes.com.au/sport/cricket/marsh-grasses-and-kohli-flowers-india-take-game-one-20231008-p5eakr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"Australia will never know what might have happened if Mitch Marsh had taken a difficult catch from Virat Kohli. But afterwards, he stole the match away from them.","content":"For as long as Virat Kohli’s popped top-edged pull from Josh Hazlewood hung in the steamy Chepauk air, so did Australia’s suddenly alive prospects of upsetting India in this World Cup opener, making a distant memory of their pre-tournament woes and perhaps supplanting the host as the team to beat. It had happened here before. The crowd knew it; they gasped. If – when – the catch was taken, it would leave India, already reeling from a trio of top-order ducks, 4/20 in what would surely then be a vain pursuit of Australia’s admittedly modest 199. Its batting order this night was not as dependably deep as in recent years. But wicketkeeper Alex Carey and square leg Mitch Marsh, sprinting towards each other, had no time to establish right of way and a sliding Marsh dropped the catch. In the compounding way of these things, both had earlier made ducks on personally miserable nights. Hazlewood blamed no one. “I think it was Mitch’s catch and Carey got quite close in the end and might have just put Mitch off,” he said. “It’s a dropped catch, one of those things that happened.” It’s not empirically demonstrable, of course, that this was the match in a moment. Hazlewood pooh-poohed the idea. “It was quite early,” he said. “We still felt that new ball – it was doing enough, whether it was in the air or off the wicket, (and) we knew that spin was going to be tough to play. Maybe not as tough as during the day. We certainly felt in the game for quite a while until the partnership grew and grew. They sort of batted us out of it.” Mitch Marsh after being dismissed. Credit: Getty Indeed, the reprieved Kohli was as mistake-free as only he can be – and KL Rahul fell in alongside him – although he eventually fell for a textbook 85. By then, he and Rahul had added 165 and paced their country to the threshold of a four-wicket victory. Rahul finished the match by handsomely driving Australian captain Pat Cummins over long off for six to strand himself on 97 not out, whereupon non-striker Hardik Pandya shook his head at the bittersweetness of it all. In the dewy monsoonal night, Australia’s makeshift spin pair Adam Zampa and Glenn Maxwell were unable to replicate the mesmerising mastery of India’s trio spinners in the afternoon. Moreover, the Indian bowlers as a team – their quicks merit honourable mentions here, too – had so restrained Australia that the batsmen in their turn could make haste slowly, and did. Rahul goes big. Credit: AP It made for a peculiarly downbeat game for these best of rivals, paling beside the pyrotechnics of the first three days. Australia’s 199 was fewer than South Africa had made in their last 20 overs against Sri Lanka in Delhi the night before. Admittedly, this was apples and pears – Sri Lanka’s attack was feeble – but this World Cup appears to be there for the bold to take. South Africa are Australia’s next opponent. The crowd figure was of a piece with the action. At 32,351, it was well short of the stadium’s 40,000 capacity. Not yet in the tournament has a stadium been full, though notionally every match has sold out. Cricket might be a religion in this country, but it belongs to an exclusive brethren. But there’s no mystery; it’s down to chronic disorganisation. Other than that 12-ball, three-wicket counterpunch at the top of India’s innings, this was a largely forgettable opening sally for Australia, in which their recent shortcomings were again exposed: inability to accelerate with the bat and lack of penetration in spin bowling. Hazlewood refuted the idea that the spin department was lacking, saying he regarded Maxwell in India as a frontliner, but conditions had militated against rather than for them this day. Australia, drawing on previous experience, had batted first in the expectation that the pitch would die and batting would become harder as the day wore on, but instead found that was at its most challenging in the afternoon sun. “It was as extreme as it gets,” he said. “It was probably a good examination to get first up, against the best spinners in the tournament. Hopefully, it’ll get a bit easier from hereon in.” From the early loss of Marsh, Australia always felt a wicket over budget. With verifiable batting only to No.7, they did not have the luxury of a wicket to throw away in the cause of a momentum-shifting blast as the Indian spinners wove their characteristic web around Australia. David Warner, Steve Smith and Marnus Labuschagne all toiled in vain to force the pace. When the squeeze became too much, Australia lost 5/30. Smith alone could be said to have been dismissed by an unplayable ball, a Ravindra Jadeja jaffa, straightening past his outside to bowl him. The Indian tweakers are a true ensemble too, each a virtuoso in a different key of their craft. In their collective 30 overs, they took 6/94. Loading If anything, the Australians’ line-up was too orthodox for an era in which 50-over cricket has become a lengthier form of the T20 format. In theory, Marcus Stoinis would change that complexion, and Travis Head, too, if he can get a doctor’s certificate in time. If ever Australia needed a hand, it’s his broken one. India’s innings began as if the sun had gone to their heads. Ishan Kishan and Shreyas Iyer were caught from extravagant drives and captain Rohit Sharma was trapped by a break-back from Josh Hazlewood and after 12 balls, India were 3/2. If Australia had short-changed themselves when batting, suddenly they were trading in a whole new currency. But once Kohli was grassed and he and Rahul settled into their task, and as the dew fell and the crowd rose, Australia’s fangs were slowly drawn. None of the bowlers were embarrassed, but none notably troubled the Indian pair as their partnership grew. Australia prides itself on being a tournament team, rising to occasions, growing into the event. They will need to be now. They have at least eight more games at seven other venues. They know all will differ slightly, which means the Australians will have to adapt their tactics and outlook as they go. That includes the wisdom of batting first and the notion of what constitutes a playable score. “We might come up against these conditions again throughout those eight games,” said Hazlewood. “We might have to reassess and say 260 is a good score rather than 300 plus as we’ve seen on some other grounds.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Cricket World Cup Australian cricket India ODI Greg Baum is chief sports columnist and associate editor with The Age. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-10-08 18:43:49","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"1e145cede3bfd79d76f976ae141475a7","title":"Rain Stays Away in Chennai As India Beat Australia By Six Wickets in ICC Cricket World Cup 2023","link":"https://www.latestly.com/sports/cricket/chennai-weather-updates-live-ind-vs-aus-icc-cricket-world-cup-2023-hourly-rain-forecast-and-weather-report-for-india-vs-australia-cwc-match-at-ma-chidambaram-stadium-5470728.html","keywords":null,"creator":null,"video_url":null,"description":"The Men in Blue begin their sojourn in the ICC Cricket World Cup 2023 against Australia. But rainfall in the past few days in Chennai has posed a threat to this game? Will rain affect this match? Read below to get updates about Chennai weather.","content":"Despite rains in Chennai preceding the match, fortunately it didn't interrupt the game at any point. A complete was possible and in the end, India came out victorious beating Australia in their opening match of the campaign riding on the emphatic performances from KL Rahul and Virat Kohli. There has been no rain so far as the India vs Australia match in ICC Cricket World Cup 2023 has gotten underway, with a bright sunny, sky up above. Players and fans would hope that this remains throughout and there is no rain interrupting this contest. The sun is out and the MA Chidambaram Stadium looks set to host this high-voltage contest. There has been no rain so far with less than two hours to go for the game to begin. Current Scenes of Chennai Stadium, The weather Looks Sunny 🌈 #INDvsAUS pic.twitter.com/IqUYcyDryf — Haroon 🏏🌠 (@HaroonM33120350) October 8, 2023 The weather gods have been kind towards fans today as there has been no sign of rain in Chennai ahead of the India vs Australia match. It has rained in the city in the past few days which has posed a threat over this match as well. The weather at the moment is pretty sunny with patchy clouds. Sunny weather,patchy clouds #Chennai #IndvsAus pic.twitter.com/LlWCDk7eQ5 — Chennai Weather-Raja Ramasamy (@chennaiweather) October 8, 2023 Good news for fans! There's no sign of rain in Chepauk so far hours before the India vs Australia ICC Cricket World Cup 2023 contest. Chennai has been witnessing unpredictable weather in the past few days but it is bright and sunny at the moment. Fans would hope the weather stays this way! It's bright & sunny at Chepauk. [Vimal Kumar] - Great news for cricket fans. pic.twitter.com/lnEHyNxSLb — Johns. (@CricCrazyJohns) October 8, 2023 The MA Chidambaram Stadium in Chennai is set to host India's first match of the ICC Cricket World Cup 2023, against mighty Australia on October 8. The contest has been talked about a lot with home fans expecting India to put up a good show and get off to a winning start to their ICC Men's Cricket World Cup 2023 campaign. India recently did beat Australia in an ODI series and although that would give the Men in Blue some confidence, Rohit Sharma and his team would be well aware of how dangerous Australia really can be if their players fire in unison. However, there remains a rain threat that looms large over this contest in Chennai. India vs Australia ICC Cricket World Cup 2023, Chennai Weather Report: Check Out Rain Forecast and Pitch Report at M Chidambaram Stadium. The capital city has been experiencing inconsistent weather in the past few days and it casts a shadow of uncertainty over this high-octane match as well. An update on the Chennai weather provided by popular cricket commentator Harsha Bhogle might be a cause of worry for fans, who would have an eye on the sky as well today. Bhogle had taken to his official account on X, formerly Twitter, and wrote, \"Bucketing down in Chennai...Very dark.\" There remains a possibility of this match being affected by rain. According to the Indian Meteorological Department (IMD), there is a 12-17% probability of rainfall in Chennai during the match hours. Moreover, there would be cloudy skies during the game. Fans would hope that should there be rain, it merely disrupts the contest for a while rather than washing it out. India could not have any warm-up match leading upto this match with rain washing out both their matches--against England and Netherlands. The Men in Blue would hope that the weather is fine when they take on Australia in this highly-anticipated CWC 2023 contest.","pubDate":"2023-10-08 18:26:53","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6bde044e3d49983f7bdffb3b9ed1fbf6","title":"World Cup 2023: कोहली की इस टिप्स ने किया कमाल, KL राहुल ने मानी विराट की बात, जानें ऑस्ट्रेलिया को कैसे दी मात","link":"https://hindi.latestly.com/sports/cricket/kohli-had-advised-me-to-bat-like-a-test-match-for-some-time-rahulr-1948382.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ नाबाद 97 रन की पारी खेलकर भारत को विश्व कप के अपने पहले मैच में मुश्किल परिस्थितियों से उबार कर छह विकेट की यादगार जीत दिलाने वाले लोकेश राहुल ने कहा कि पूर्व कप्तान विराट कोहली ने शुरुआती ओवरों में विकेटों के पतझड़ के बाद उन्हें टेस्ट मैच की तरह बल्लेबाजी करने की सलाह दी थी.","content":"चेन्नई, 8 अक्टूबर: ऑस्ट्रेलिया के खिलाफ नाबाद 97 रन की पारी खेलकर भारत को विश्व कप के अपने पहले मैच में मुश्किल परिस्थितियों से उबार कर छह विकेट की यादगार जीत दिलाने वाले लोकेश राहुल ने कहा कि पूर्व कप्तान विराट कोहली ने शुरुआती ओवरों में विकेटों के पतझड़ के बाद उन्हें टेस्ट मैच की तरह बल्लेबाजी करने की सलाह दी थी. राहुल अपने शतक से चूक गये लेकिन दो रन पर टीम के तीन विकेट गिरने के बाद उन्होंने कोहली (116 गेंद में 85 रन) के साथ चौथे विकेट के लिए 165 रन की साझेदारी कर भारत का दबदबा बनाया. भारतीय टीम ने जीत के लिए मिले 200 रन के लक्ष्य को 52 गेंद शेष रहते चार विकेट गंवाकर हासिल कर लिया. मैन ऑफ द मैच राहुल ने मैच के बाद कहा, ‘‘ मैं और कोहली ज्यादा बात नहीं कर रहे थे. मैं शुरुआत में संभल कर खेलने की कोशिश कर रहा था. मैं नहाकर ड्रेसिंग रूम में बैठा ही था कि तीन विकेट गिर गये.’’ उन्होने कहा, ‘‘ कोहली ने मुझे कहा कि बिना जोखिम वाले शॉट लगाने के साथ कुछ देर के लिए हमें टेस्ट क्रिकेट की तरह खेलना होगा. पारी की शुरुआती में तेज गेंदबाजों को मदद मिल रही थी लेकिन बाद में ओस के कारण परिस्थितियां बल्लेबाजी के लिए आसान हो गयी.’’ ICC World Cup 2023 Points Table Updated: वर्ल्ड कप में टीम इंडिया का जीत के साथ आगाज़, अंक तालिका पर न्यूजीलैंड का दबदबा बरकरार, यहां देखें सभी टीमों की स्तिथि छक्का लगाकर टीम को जीत दिलाने वाले इस बल्लेबाज ने शतक से चूकने के बारे में कहा, ‘‘ मैं आखिरी पलों में सोच रहा था कि मैं कैसे 100 रन तक पहुंच सकता हूं. मैंने सोचा कि अगर एक चौका और एक छक्का लगाया जाए तो यह संभव हो सकता है. मैंने चौका लगाने की कोशिश की थी लेकिन गेंद का बल्ले से संपर्क ज्यादा अच्छे से हो गया. मुझे इसका कोई मलाल नहीं, मैं कभी और शतक लगा लूंगा.’’ An incredible 97* in the chase when the going got tough 👏👏 KL Rahul receives the Player of the Match award as #TeamIndia start #CWC23 with a 6-wicket win 👌👌 Scorecard ▶️ https://t.co/ToKaGif9ri #CWC23 | #INDvAUS | #TeamIndia | #MeninBlue pic.twitter.com/rY7RfHM1Bf — BCCI (@BCCI) October 8, 2023 भारतीय कप्तान रोहित शर्मा ने भी इस जीत का श्रेय राहुल और कोहली की साझेदारी को दिया. रोहित ने कहा, ‘‘जब हमने शुरुआती तीन विकेट गंवाये तो मैं नर्वस हो गया था. हमने इस दौरान खराब शॉट खेले. ऑस्ट्रेलिया गेंदबाजों को इसका श्रेय दिया जाना चाहिये. हालांकि उसके बाद राहुल और कोहली ने कमाल का खेल दिखाया.’’ रोहित ने ऑस्ट्रेलिया को कम स्कोर पर रोकने के लिए गेंदबाजों और क्षेत्ररक्षकों की सराहना की. उन्होंने कहा, ‘‘ इस तरह से विश्व कप की शुरुआत करना शानदार है. हमने क्षेत्ररक्षण में सुधार के लिए काफी मेहनत की है और आज इसमें मामले में टीम ने अच्छा किया. हमारे खिलाड़ियों ने इन परिस्थितियों का फायदा उठाया.’’ऑस्ट्रेलिया के कप्तान पैट कमिंस ने कहा कि उनकी टीम ने 50 रन कम बनाये थे. End of a magnificent knock from Virat Kohli, who departs for 85 👏👏 #TeamIndia 168/4, with 32 more runs to win. Follow the Match ▶️ https://t.co/ToKaGif9ri #CWC23 | #INDvAUS | #MeninBlue pic.twitter.com/YL4J8DrI6Y — BCCI (@BCCI) October 8, 2023 कमिंस ने कहा, ‘‘ मेरा मानना है कि हमारी टीम ने 50 रन कम बनाये. इस पिच से स्पिनरों को मदद मिल रही थी . भारतीय टीम के पास अच्छे गेंदबाज हैं.’’ उन्होंने कहा, ‘‘हमारी टीम में दो ही स्पिनर थे लेकिन हम 250 के आसपास रन बनाते तो इससे काफी फर्क पड़ सकता था.’’ (यह सिंडिकेटेड न्यूज़ फीड से अनएडिटेड और ऑटो-जेनरेटेड स्टोरी है, ऐसी संभावना है कि लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है)","pubDate":"2023-10-08 18:11:14","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"52efafbb0b00c3f01903194792f7e4ec","title":"World Cup 2023 IND vs AUS: Athiya Shetty, Ayushmann Khurrana and Other Celebs Rejoice Over Team India's Win By Six Wickets","link":"https://www.latestly.com/socially/entertainment/bollywood/world-cup-2023-ind-vs-aus-athiya-shetty-ayushmann-khurrana-and-other-celebs-rejoice-over-team-indias-win-by-six-wickets-5472278.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli and KL Rahul were the best players in today's match! With India's win, the team have kicked-off the World Cup 2023 campaign with a six-wicket victory against Australia in Chennai.","content":"Team India turned victor in today's (Oct 8) ICC Cricket World Cup match against Australia. The Men in Blue defeated Aussies by six-wicket and made the country proud. Not only common man, but even many celebs took to their social media handles and hailed the Indian team for putting up a fab show on field. Right from Riteish Deshmukh, Ayushmann Khurrana and many more, stars celebrated India's victory online. Let's check out their reactions below. ICC Cricket World Cup 2023 Points Table Updated: South Africa Kickstart Campaign With Emphatic 102-Run Victory, New Zealand Continue to be on Top . Riteish Deshmukh Architects of today’s victory - absolute master class by @imVkohli & @klrahul - thundering start for India. #WorldCup2023 #IndVsAus https://t.co/WpX9SJhBTd — Riteish Deshmukh (@Riteishd) October 8, 2023 Nakuul Mehta Great start to the World Cup by Team India. Terrible work by the BOARD to keep loyal paying fans away from the game. #IndVsAus — Nakuul Mehta (@NakuulMehta) October 8, 2023 Sophie Choudry Let’s go Indiaaaaaa 🇮🇳 👏🏼👏🏼 Congrats #teamindia esp @imVkohli and @klrahul … superb innings, wonderful start to our World Cup!!! #WorldCup2023 #KLRahul #ViratKohli — Sophie C (@Sophie_Choudry) October 8, 2023 Ayushmann Khurrana Athiya Shetty (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-10-08 18:03:22","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"413c5bd852e9d002eff122e3e082ade7","title":"Sachin Tendulkar, Virender Sehwag and Other Members of Cricket Fraternity React After India Defeat Australia By Six Wickets in ICC Cricket World Cup 2023 Clash","link":"https://www.latestly.com/socially/sports/cricket/sachin-tendulkar-virender-sehwag-and-other-members-of-cricket-fraternity-react-after-india-defeat-australia-by-six-wickets-in-icc-cricket-world-cup-2023-clash-5472293.html","keywords":null,"creator":null,"video_url":null,"description":"India started their campaign with an emphatic victory against Australia riding on the performances of Virat Kohli and KL Rahul. Elated former cricketers reacted on the memorable win.","content":"India won their first game of the ICC Cricket World Cup 2023 against Australia at Chennai displaying a brilliant all-round performance with both ball and bat. First they squeezed Australia with the spinners crumbling them for only 199 runs and then during the chase, despite being in a dire situation, powered themselves out of it riding on the brilliant knocks of Virat Kohli and KL Rahul and won the match registering first points on the table. Sachin Tendulkar, Virender Sehwag, Irfan Pathan were elated by the performance and took to social media to react. I was surprised to see Australia bat first after winning the toss. Commendable performance by the Indian bowlers to restrict them to 199. Australia started well but I felt they missed a left-arm spinner on this surface. The partnership between Virat and Rahul sealed the game for… pic.twitter.com/qUr21Vaqxb — Sachin Tendulkar (@sachin_rt) October 8, 2023 Virender Sehwag's Reaction Laal Fool, Peela Fool. Rahul and Kohli batting beautiful. A partnership to remember for a long time. भारत को जीत पर बधाई । #WorldCup2023 pic.twitter.com/fQJVLgSt6s — Virender Sehwag (@virendersehwag) October 8, 2023 Irfan Pathan's Reaction India 🇮🇳 started the World Cup campaign with a bang. Team is looking solid. Kohli never disappoints the team when he is really needed. Today was no different. And Kl Rahul is playing with great Klass. jaddu baapu tu to kamal che 👏 #IndVsAus — Irfan Pathan (@IrfanPathan) October 8, 2023 Harbhajan Singh's Reaction What an incredible beginning to India's world cup journey! Victory against Australia will give a boost to confidence of players. Brilliant partnership between @imVkohli and @klrahul paved the way for this unforgettable win! Keep up the momentum. pic.twitter.com/lbtUBzcppf — Harbhajan Turbanator (@harbhajan_singh) October 8, 2023 Wasim Jaffer's Reaction Pressure doesn't get bigger than when you're 2/3 in a WC game vs a charged up Aus. Then to soak the pressure, wrestle the initiative back, and win the game takes something special. This was a partnership for the ages 🙌🏽 Well played 👏🏽 #INDvAUS #CWC2023 pic.twitter.com/QDJ5uuR1TL — Wasim Jaffer (@WasimJaffer14) October 8, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-10-08 17:59:40","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"210e81923f7ae3ffa848a2de049be20f","title":"IND vs AUS: दो रन पर तीन विकेट गिरने के बावजूद मिली जीत तो खुशी से गदगद दिखे रोहित, मैच के बाद दिया बड़ा बयान","link":"https://www.abplive.com/sports/cricket/odi-world-cup-2023-ind-vs-aus-indian-captain-rohit-sharma-s-reaction-after-wining-against-australia-2510832","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"Rohit Sharma's Reaction: भारत ने विश्व कप 2023 का पहला मुकाबला ऑस्ट्रेलिया के खिलाफ खेला, जिसमें मेज़बान भारत ने 6 विकेट से जीत दर्ज की. भारत की इस जीत में केएल राहुल और विराट कोहली ने बल्ले से अहम किरदार अदा किया. वहीं गेंदबाज़ी में रवींद्र जडेजा ने सबसे ज़्यादा विकेट लिए. भारत की ओर से फील्डिंग में काफी चुस्ती दिखाई दी. सिर्फ टीम का टॉप ऑर्डर कमज़ोर रहा, बाकी पूरी टीम ने शानदार खेल दिखाया, जिससे कप्तान रोहित शर्मा काफी खुश दिखाई दिए.  रोहित शर्मा ने मैच के बाद पूरी टीम की तारीफ की. इसके अलावा उन्होंने केएल राहुल और विराट कोहली की बैटिंग की अलग से सराहा. भारतीय कप्तान ने कहा, “बहुत उत्साहित. टॉप पर आकर अच्छी फीलिंग है. टूर्नामेंट की शुरुआत के लिए अच्छा गेम था. मुझे लगा कि यह शानदार था, खासकर फील्डिंग और सभी की तरफ से हमने आज जो प्रयास देखा, इस तरह की कंडीशन मुश्किल होंगी.” भारतीय कप्तान ने आगे कहा, “हमारे गेंदबाज़ों ने परिस्थितियों का अच्छी तरह से इस्तेमाल किया और हमे पता था कि यहां सबके लिए मदद होगी, यहां तक तेज़ गेंदबाज़ों को भी कुछ रिवर्स स्विंग मिली, स्पिनर्स ने अच्छे एरिया में गेंदबाज़ी की और कुल मिलाकर यह शानदार एफर्ट था. मैं घबराया हुआ था, आप इस तरह से अपनी पारी की शुरुआत नहीं करना चाहते हैं, ऑस्ट्रेलियाई गेंदबाज़ों को क्रेडिट क्योंकि उन्होंने अच्छे एरिया में गेंदबाज़ी की लेकिन कुछ खराब शॉट भी रहे. जब आपके आगे ऐसा लक्ष्य होता है तो आप पॉवरप्ले में ज़्यादा से ज़्यादा रन बनाना चाहते हैं.” राहुल विराट की ऐसे की तारीफ भारतीय कप्तान ने केएल राहुल और विराट कोहली की खासकर तारीफ की. उन्होंने कहा, “राहुल और विराट को क्रेडिट जाता है कि कैसे वो चेज की ओर गए. टीम के रूप में यह चुनौती होगी, अलग-अलग परिस्थितियों में जाना और उन्हें अपनाना, जिसे भी परिस्थितिया सूट करेंगी वो आकर काम करेगा. चेन्नई कभी निराश नहीं करता है, वे अपने क्रिकेट से प्यार करते हैं और उनके लिए गर्मी में आकर बैठना और टीम का उत्साह बढ़ाना बहुत कुछ कहता है.”   ये भी पढ़ें... IND vs AUS: 'टेस्ट क्रिकेट की तरह खेला...', प्लेयर ऑफ द मैच बने केएल राहुल ने जीत के स्पेशल प्लान का किया खुलासा","content":"Rohit Sharma's Reaction: भारत ने विश्व कप 2023 का पहला मुकाबला ऑस्ट्रेलिया के खिलाफ खेला, जिसमें मेज़बान भारत ने 6 विकेट से जीत दर्ज की. भारत की इस जीत में केएल राहुल और विराट कोहली ने बल्ले से अहम किरदार अदा किया. वहीं गेंदबाज़ी में रवींद्र जडेजा ने सबसे ज़्यादा विकेट लिए. भारत की ओर से फील्डिंग में काफी चुस्ती दिखाई दी. सिर्फ टीम का टॉप ऑर्डर कमज़ोर रहा, बाकी पूरी टीम ने शानदार खेल दिखाया, जिससे कप्तान रोहित शर्मा काफी खुश दिखाई दिए. रोहित शर्मा ने मैच के बाद पूरी टीम की तारीफ की. इसके अलावा उन्होंने केएल राहुल और विराट कोहली की बैटिंग की अलग से सराहा. भारतीय कप्तान ने कहा, “बहुत उत्साहित. टॉप पर आकर अच्छी फीलिंग है. टूर्नामेंट की शुरुआत के लिए अच्छा गेम था. मुझे लगा कि यह शानदार था, खासकर फील्डिंग और सभी की तरफ से हमने आज जो प्रयास देखा, इस तरह की कंडीशन मुश्किल होंगी.” भारतीय कप्तान ने आगे कहा, “हमारे गेंदबाज़ों ने परिस्थितियों का अच्छी तरह से इस्तेमाल किया और हमे पता था कि यहां सबके लिए मदद होगी, यहां तक तेज़ गेंदबाज़ों को भी कुछ रिवर्स स्विंग मिली, स्पिनर्स ने अच्छे एरिया में गेंदबाज़ी की और कुल मिलाकर यह शानदार एफर्ट था. मैं घबराया हुआ था, आप इस तरह से अपनी पारी की शुरुआत नहीं करना चाहते हैं, ऑस्ट्रेलियाई गेंदबाज़ों को क्रेडिट क्योंकि उन्होंने अच्छे एरिया में गेंदबाज़ी की लेकिन कुछ खराब शॉट भी रहे. जब आपके आगे ऐसा लक्ष्य होता है तो आप पॉवरप्ले में ज़्यादा से ज़्यादा रन बनाना चाहते हैं.” राहुल विराट की ऐसे की तारीफ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); भारतीय कप्तान ने केएल राहुल और विराट कोहली की खासकर तारीफ की. उन्होंने कहा, “राहुल और विराट को क्रेडिट जाता है कि कैसे वो चेज की ओर गए. टीम के रूप में यह चुनौती होगी, अलग-अलग परिस्थितियों में जाना और उन्हें अपनाना, जिसे भी परिस्थितिया सूट करेंगी वो आकर काम करेगा. चेन्नई कभी निराश नहीं करता है, वे अपने क्रिकेट से प्यार करते हैं और उनके लिए गर्मी में आकर बैठना और टीम का उत्साह बढ़ाना बहुत कुछ कहता है.” ये भी पढ़ें... IND vs AUS: 'टेस्ट क्रिकेट की तरह खेला...', प्लेयर ऑफ द मैच बने केएल राहुल ने जीत के स्पेशल प्लान का किया खुलासा","pubDate":"2023-10-08 17:42:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/08/af4cf33c1249f258b72b3f4d333e22271696786680969582_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"8f89d3c004a70b94baea8929a410fa86","title":"Might have to change combinations as per different conditions: Rohit Sharma","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/08/might-have-to-change-combinations-as-per-different-conditions-rohit-sharma-2622056.html","keywords":null,"creator":null,"video_url":null,"description":"However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. CHENNAI: Rohit Sharma on Sunday admitted that the biggest challenge in front of his side would be to play in different conditions, and the Indian captain also did not rule out making changes in team combinations to suit the demands of a particular venue. However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. \"That will be the biggest challenge moving forward because we will play in different conditions. (We) might have to change combinations too and as a team we are prepared to do that,\" said Rohit during the post-match presentation. Rohit was particularly pleased with the team's fielding. \"Good feeling to come out on top. Magnificent, especially the fielding. The fielding was something we really put our effort on. It was a great effort. In conditions like this it can be tough sometimes. We knew there would be assistance for everyone. Seamers got reverse, spinners bowled in nice areas. All in all a great effort,\" he said. Rohit was one of the three top-order India batters to get out for a duck, and the skipper admitted to being nervous with the home team reeling at 2/3 in the second over. \"Yes I was (nervous) to be honest. You don't want to start like that when chasing a target. Credit to Australia, but some loose shots there as well. But that happens, you want to get off the mark and score quickly in the powerplay.\" \"But hats off to Virat and KL - the way they stuck out there to create a match-winning partnership,\" Rohit said. Australian captain Pat Cummins felt his team was 50 runs short of what could have been a challenging total. \"At least 50-odd. It was tough, trying to defend anything under 200. It was a really good bowling attack and their spinners made it tough work out there. \"I wasn't too upset (with just two spinners), we had 20 overs of spin but some more runs on the board would have made the difference,\" Cummins said. When asked about the drop catch by Mitchell Marsh early on in Kohli's innings, Cummins said, \"I have already forgotten about it, it happens, 4/10 would have been a dream start. \"Just one game out of nine, not too much to ponder about but there are some areas we need to get better.\" Arriving at the crease with his team in a spot of bother, Rahul said Kohli had advised him to play out that difficult period like they do in Test cricket. \"Quite honestly, there weren't a lot of conversations (with Kohli). I thought I'd get a good shower and get a break. I was just trying to get my breath back.\" \"Virat said there's a bit in the wicket, so play like Test cricket for a while. There was a bit of help for the pacers with the new ball, and then the spinners also,\" Rahul said. \"In the last 15-20 overs, dew played a part and that helped quite a bit. The ball also skidded on better. However, it was a bit two-paced, it wasn't the easiest of wickets to bat on and it wasn't flat as well.\" \"It was a good cricket wicket, bit for the batters and the bowlers. That's what you get in the south of India, especially in Chennai.","content":"CHENNAI: Rohit Sharma on Sunday admitted that the biggest challenge in front of his side would be to play in different conditions, and the Indian captain also did not rule out making changes in team combinations to suit the demands of a particular venue. However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. \"That will be the biggest challenge moving forward because we will play in different conditions. (We) might have to change combinations too and as a team we are prepared to do that,\" said Rohit during the post-match presentation. Rohit was particularly pleased with the team's fielding. \"Good feeling to come out on top. Magnificent, especially the fielding. The fielding was something we really put our effort on. It was a great effort. In conditions like this it can be tough sometimes. We knew there would be assistance for everyone. Seamers got reverse, spinners bowled in nice areas. All in all a great effort,\" he said. Rohit was one of the three top-order India batters to get out for a duck, and the skipper admitted to being nervous with the home team reeling at 2/3 in the second over. \"Yes I was (nervous) to be honest. You don't want to start like that when chasing a target. Credit to Australia, but some loose shots there as well. But that happens, you want to get off the mark and score quickly in the powerplay.\" \"But hats off to Virat and KL - the way they stuck out there to create a match-winning partnership,\" Rohit said. Australian captain Pat Cummins felt his team was 50 runs short of what could have been a challenging total. \"At least 50-odd. It was tough, trying to defend anything under 200. It was a really good bowling attack and their spinners made it tough work out there. \"I wasn't too upset (with just two spinners), we had 20 overs of spin but some more runs on the board would have made the difference,\" Cummins said. When asked about the drop catch by Mitchell Marsh early on in Kohli's innings, Cummins said, \"I have already forgotten about it, it happens, 4/10 would have been a dream start. \"Just one game out of nine, not too much to ponder about but there are some areas we need to get better.\" Arriving at the crease with his team in a spot of bother, Rahul said Kohli had advised him to play out that difficult period like they do in Test cricket. \"Quite honestly, there weren't a lot of conversations (with Kohli). I thought I'd get a good shower and get a break. I was just trying to get my breath back.\" \"Virat said there's a bit in the wicket, so play like Test cricket for a while. There was a bit of help for the pacers with the new ball, and then the spinners also,\" Rahul said. \"In the last 15-20 overs, dew played a part and that helped quite a bit. The ball also skidded on better. However, it was a bit two-paced, it wasn't the easiest of wickets to bat on and it wasn't flat as well.\" \"It was a good cricket wicket, bit for the batters and the bowlers. That's what you get in the south of India, especially in Chennai.","pubDate":"2023-10-08 17:42:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"27ed7bd80865c674e48e0dbc2e282898","title":"Sri Lanka fined for slow over-rate against South Africa","link":"https://www.ft.lk/sports/Sri-Lanka-fined-for-slow-over-rate-against-South-Africa/23-753842","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka has been fined 10% of their match fee for maintaining a slow over-rate against South Africa in Match 4 of the ICC Men’s Cricket World Cup on Saturday. Javagal Srinath of the Emirates ICC Elite Panel of Match Referees imposed the sanction after Dasun Shanaka’s side was ruled to be 2 over(s) short of the target after time allowances were taken into consideration. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined 5% of their match fees for every over if their side fails to bowl in the allotted time. Dasun Shanaka pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing. On-field umpires Richard Illingworth and Shahid Saikat, third umpire Michael Gough and fourth umpire Alex Wharf levelled the charge.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"51d74881c904ad657fdc804c764ed26d","title":"Sri Lanka should take heart from Proteas bashing","link":"https://www.ft.lk/sports/Sri-Lanka-should-take-heart-from-Proteas-bashing/23-753843","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka whose bowlers were put to the sword by South Africa’s batsmen in their opening World Cup match at Delhi should not be disheartened from the pummelling they received at the hands of Quinton de Kock, Rassie van der Dussen and Aidan Markram, but use that experience to improve their bowling skills on flat surfaces which they will come across during their remaining matches of the tournament. The manner in which Markram batted showed that he was in a totally different plane to the rest of the batsmen. He was in such sublime form that any bowling attack would have found it difficult to curb his stroke play. Markram was the first to admit that it was a day where nothing could go wrong for him. “When it’s your day, try to cash in and really make it count,” he said at the post-match media conference. “Luckily, tonight, balls hit gaps. I mean, they don’t always hit gaps. And it could be a different story, but yeah thankful it worked out that way and again it was a really good pitch so that definitely assisted.” Cricketers usually experience that kind of feeling during their careers and on Saturday it was Markram’s day. He raced away to the fastest hundred by anyone at a World Cup off 49 balls and South Africa to the highest ever total in a World Cup game – 428-5. It is nothing to be ashamed of that South Africa scored as many against an inexperienced Sri Lankan bowling attack. South Africa came to the World Cup having hammered Australia for 416-5 in an ODI played at the Centurion where they won by 164 runs less than a month ago. The Australian bowlers who were taken to task were Josh Hazlewood, Marcus Stoinis, Adam Zampa, Michael Nesser and Nathan Ellis. The day before the match Sri Lanka head Coach Chris Silverwood having looked at the Delhi pitch said that it was belter, and it proved so. A total of 754 runs were scored on it surpassing the previous highest aggregate at a World Cup match of 714 between Australia and Bangladesh at Nottingham in 2019. This sort of assault on the Sri Lankan bowlers cannot be ruled out in future matches for as compared to the rest of the nine teams in the competition, Sri Lanka has the least experienced bowling line-up. They sorely missed Wanindu Hasaranga, Dushmantha Chameera and Maheesh Theekshana who was in the dugout watching the carnage that was taking place before him. Theekshana could come into the team for Sri Lanka’s next match against Pakistan at Hyderabad on Tuesday and lend a little bit of experience to what one could describe as an uncooked bowling attack. The four frontline bowlers picked for the match – Rajitha, Madushanka, Pathirana and Wellalage had a total of 59 ODIs and 79 wickets between them. Against such an inexperienced line-up any team on a surface like the one at Delhi would have made merry. It is certainly a big headache for the coaching staff to strategize on how this bowling could contain or take wickets against an opposition if there is no help at all from the wicket. Sri Lanka didn’t have luck on their side either because a couple of half chances and a run out were missed. When your bowling is weak, fielding comes into play in a big way to compensate for it and half chances like the ones that Sri Lanka missed out on should have been taken to encourage the bowling unit. Sri Lanka certainly didn’t have a chance of chasing down South Africa’s massive total but at least they made an effort to put up a decent show with the bat and reach 326. If not for the difference in the wickets lost Sri Lanka could have given South Africa a good run. At the end of 40 overs they were on par with South Africa at 291-8 as against 291-3, the only difference being the loss of wickets. Kusal Mendis, the way he began, looked as if he was determined to chase after Markram’s record-breaking century. But it was too good to last and once he succumbed, the chase simply lost its momentum and it boiled down to how well Sri Lanka could utilise the remaining overs – there were 37 left. They managed to last 32, which raises the question why they are unable to consume their full quota of 50. This is the third successive occasion in this World Cup that Sri Lanka has failed to bat out their full quota, the first two being in the warm-up games. That is one area Sri Lanka needs to really work on for it’s a cardinal sin in ODI cricket not to use your full quota. One encouraging factor to emerge from the match was that Charith Asalanka and skipper Dasun Shanaka managed to spend time in the middle to score fifties. Asalanka has proved time and again that he is rock solid in the middle-order lending that stability which the team needs. As for Shanaka, he could breathe a bit easy having finally managed to come up with a half-century after failures in his past 17 innings. He was not at his best but the innings would give him a world of good for his confidence for the rest of the tournament.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"b45643ef9bc2fe61916658db1de7d2e7","title":"India gifted Asian Games cricket gold over Afghanistan by ranking rule","link":"https://www.ft.lk/sports/India-gifted-Asian-Games-cricket-gold-over-Afghanistan-by-ranking-rule/23-753836","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Gifted an armchair ride by Asian Games organisers, India has taken gold in men’s cricket as the rain-hit T20 final against Afghanistan was decided by the superpower’s superior global ranking. Afghanistan, ranked 10th in the ICC’s T20 rankings versus world number one India, was left with silver on Saturday and powerless to do anything about it after rain halted the match when they were 112 for five after 18.2 overs of the first innings. With India unable to bat a minimum of five overs, and play was abandoned soon after 5 p.m. local time (09:00 GMT), leaving Ruturaj Gaikwad’s team to celebrate victory by default. Deciding results based purely on teams’ global rankings is almost unheard of in cricket, let alone for finals in major tournaments. Most allow spare days so that deciders can be completed if rain washes out play in the original match. If no spare days are provided, a winner is generally declared via tie-breaking criteria based on a team’s performances within the tournament they are playing. Twenty20 cricket has been played at the Asian Games twice before, at Guangzhou 2010 and Incheon 2014, with Bangladesh and then Sri Lanka crowned men’s winners. Afghanistan were runners-up both times, but India did not take part. The rankings rule also helped India’s gold medal-winning women’s team reach the semifinals after rain washed out their quarterfinal against Malaysia. India went on to beat Sri Lanka by 19 runs to be crowned women’s champions last week. Rain also hit the men’s bronze medal playoff won by Bangladesh against Pakistan but held off long enough to at least ensure a contest between the teams.","pubDate":"2023-10-08 19:22:46","image_url":null,"source_id":"ft_lk","source_priority":1390226,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"8b6affa4bf1cfcc4782ed6fb8587d861","title":"Marsh grasses and Kohli flowers: India take game one","link":"https://www.brisbanetimes.com.au/sport/cricket/marsh-grasses-and-kohli-flowers-india-take-game-one-20231008-p5eakr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Greg Baum"],"video_url":null,"description":"Australia will never know what might have happened if Mitch Marsh had taken a difficult catch from Virat Kohli. But afterwards, he stole the match away from them.","content":"For as long as Virat Kohli’s popped top-edged pull from Josh Hazlewood hung in the steamy Chepauk air, so did Australia’s suddenly alive prospects of upsetting India in this World Cup opener, making a distant memory of their pre-tournament woes and perhaps supplanting the host as the team to beat. It had happened here before. The crowd knew it; they gasped. If – when – the catch was taken, it would leave India, already reeling from a trio of top-order ducks, 4/20 in what would surely then be a vain pursuit of Australia’s admittedly modest 199. Its batting order this night was not as dependably deep as in recent years. But wicketkeeper Alex Carey and square leg Mitch Marsh, sprinting towards each other, had no time to establish right of way and a sliding Marsh dropped the catch. In the compounding way of these things, both had earlier made ducks on personally miserable nights. Hazlewood blamed no one. “I think it was Mitch’s catch and Carey got quite close in the end and might have just put Mitch off,” he said. “It’s a dropped catch, one of those things that happened.” It’s not empirically demonstrable, of course, that this was the match in a moment. Hazlewood pooh-poohed the idea. “It was quite early,” he said. “We still felt that new ball – it was doing enough, whether it was in the air or off the wicket, (and) we knew that spin was going to be tough to play. Maybe not as tough as during the day. We certainly felt in the game for quite a while until the partnership grew and grew. They sort of batted us out of it.” Mitch Marsh after being dismissed. Credit: Getty Indeed, the reprieved Kohli was as mistake-free as only he can be – and KL Rahul fell in alongside him – although he eventually fell for a textbook 85. By then, he and Rahul had added 165 and paced their country to the threshold of a four-wicket victory. Rahul finished the match by handsomely driving Australian captain Pat Cummins over long off for six to strand himself on 97 not out, whereupon non-striker Hardik Pandya shook his head at the bittersweetness of it all. In the dewy monsoonal night, Australia’s makeshift spin pair Adam Zampa and Glenn Maxwell were unable to replicate the mesmerising mastery of India’s trio spinners in the afternoon. Moreover, the Indian bowlers as a team – their quicks merit honourable mentions here, too – had so restrained Australia that the batsmen in their turn could make haste slowly, and did. Rahul goes big. Credit: AP It made for a peculiarly downbeat game for these best of rivals, paling beside the pyrotechnics of the first three days. Australia’s 199 was fewer than South Africa had made in their last 20 overs against Sri Lanka in Delhi the night before. Admittedly, this was apples and pears – Sri Lanka’s attack was feeble – but this World Cup appears to be there for the bold to take. South Africa are Australia’s next opponent. The crowd figure was of a piece with the action. At 32,351, it was well short of the stadium’s 40,000 capacity. Not yet in the tournament has a stadium been full, though notionally every match has sold out. Cricket might be a religion in this country, but it belongs to an exclusive brethren. But there’s no mystery; it’s down to chronic disorganisation. Other than that 12-ball, three-wicket counterpunch at the top of India’s innings, this was a largely forgettable opening sally for Australia, in which their recent shortcomings were again exposed: inability to accelerate with the bat and lack of penetration in spin bowling. Hazlewood refuted the idea that the spin department was lacking, saying he regarded Maxwell in India as a frontliner, but conditions had militated against rather than for them this day. Australia, drawing on previous experience, had batted first in the expectation that the pitch would die and batting would become harder as the day wore on, but instead found that was at its most challenging in the afternoon sun. “It was as extreme as it gets,” he said. “It was probably a good examination to get first up, against the best spinners in the tournament. Hopefully, it’ll get a bit easier from hereon in.” From the early loss of Marsh, Australia always felt a wicket over budget. With verifiable batting only to No.7, they did not have the luxury of a wicket to throw away in the cause of a momentum-shifting blast as the Indian spinners wove their characteristic web around Australia. David Warner, Steve Smith and Marnus Labuschagne all toiled in vain to force the pace. When the squeeze became too much, Australia lost 5/30. Smith alone could be said to have been dismissed by an unplayable ball, a Ravindra Jadeja jaffa, straightening past his outside to bowl him. The Indian tweakers are a true ensemble too, each a virtuoso in a different key of their craft. In their collective 30 overs, they took 6/94. Loading If anything, the Australians’ line-up was too orthodox for an era in which 50-over cricket has become a lengthier form of the T20 format. In theory, Marcus Stoinis would change that complexion, and Travis Head, too, if he can get a doctor’s certificate in time. If ever Australia needed a hand, it’s his broken one. India’s innings began as if the sun had gone to their heads. Ishan Kishan and Shreyas Iyer were caught from extravagant drives and captain Rohit Sharma was trapped by a break-back from Josh Hazlewood and after 12 balls, India were 3/2. If Australia had short-changed themselves when batting, suddenly they were trading in a whole new currency. But once Kohli was grassed and he and Rahul settled into their task, and as the dew fell and the crowd rose, Australia’s fangs were slowly drawn. None of the bowlers were embarrassed, but none notably troubled the Indian pair as their partnership grew. Australia prides itself on being a tournament team, rising to occasions, growing into the event. They will need to be now. They have at least eight more games at seven other venues. They know all will differ slightly, which means the Australians will have to adapt their tactics and outlook as they go. That includes the wisdom of batting first and the notion of what constitutes a playable score. “We might come up against these conditions again throughout those eight games,” said Hazlewood. “We might have to reassess and say 260 is a good score rather than 300 plus as we’ve seen on some other grounds.” News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Cricket World Cup Australian cricket India ODI Greg Baum is chief sports columnist and associate editor with The Age. Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-10-08 18:43:49","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"1e145cede3bfd79d76f976ae141475a7","title":"Rain Stays Away in Chennai As India Beat Australia By Six Wickets in ICC Cricket World Cup 2023","link":"https://www.latestly.com/sports/cricket/chennai-weather-updates-live-ind-vs-aus-icc-cricket-world-cup-2023-hourly-rain-forecast-and-weather-report-for-india-vs-australia-cwc-match-at-ma-chidambaram-stadium-5470728.html","keywords":null,"creator":null,"video_url":null,"description":"The Men in Blue begin their sojourn in the ICC Cricket World Cup 2023 against Australia. But rainfall in the past few days in Chennai has posed a threat to this game? Will rain affect this match? Read below to get updates about Chennai weather.","content":"Despite rains in Chennai preceding the match, fortunately it didn't interrupt the game at any point. A complete was possible and in the end, India came out victorious beating Australia in their opening match of the campaign riding on the emphatic performances from KL Rahul and Virat Kohli. There has been no rain so far as the India vs Australia match in ICC Cricket World Cup 2023 has gotten underway, with a bright sunny, sky up above. Players and fans would hope that this remains throughout and there is no rain interrupting this contest. The sun is out and the MA Chidambaram Stadium looks set to host this high-voltage contest. There has been no rain so far with less than two hours to go for the game to begin. Current Scenes of Chennai Stadium, The weather Looks Sunny 🌈 #INDvsAUS pic.twitter.com/IqUYcyDryf — Haroon 🏏🌠 (@HaroonM33120350) October 8, 2023 The weather gods have been kind towards fans today as there has been no sign of rain in Chennai ahead of the India vs Australia match. It has rained in the city in the past few days which has posed a threat over this match as well. The weather at the moment is pretty sunny with patchy clouds. Sunny weather,patchy clouds #Chennai #IndvsAus pic.twitter.com/LlWCDk7eQ5 — Chennai Weather-Raja Ramasamy (@chennaiweather) October 8, 2023 Good news for fans! There's no sign of rain in Chepauk so far hours before the India vs Australia ICC Cricket World Cup 2023 contest. Chennai has been witnessing unpredictable weather in the past few days but it is bright and sunny at the moment. Fans would hope the weather stays this way! It's bright & sunny at Chepauk. [Vimal Kumar] - Great news for cricket fans. pic.twitter.com/lnEHyNxSLb — Johns. (@CricCrazyJohns) October 8, 2023 The MA Chidambaram Stadium in Chennai is set to host India's first match of the ICC Cricket World Cup 2023, against mighty Australia on October 8. The contest has been talked about a lot with home fans expecting India to put up a good show and get off to a winning start to their ICC Men's Cricket World Cup 2023 campaign. India recently did beat Australia in an ODI series and although that would give the Men in Blue some confidence, Rohit Sharma and his team would be well aware of how dangerous Australia really can be if their players fire in unison. However, there remains a rain threat that looms large over this contest in Chennai. India vs Australia ICC Cricket World Cup 2023, Chennai Weather Report: Check Out Rain Forecast and Pitch Report at M Chidambaram Stadium. The capital city has been experiencing inconsistent weather in the past few days and it casts a shadow of uncertainty over this high-octane match as well. An update on the Chennai weather provided by popular cricket commentator Harsha Bhogle might be a cause of worry for fans, who would have an eye on the sky as well today. Bhogle had taken to his official account on X, formerly Twitter, and wrote, \"Bucketing down in Chennai...Very dark.\" There remains a possibility of this match being affected by rain. According to the Indian Meteorological Department (IMD), there is a 12-17% probability of rainfall in Chennai during the match hours. Moreover, there would be cloudy skies during the game. Fans would hope that should there be rain, it merely disrupts the contest for a while rather than washing it out. India could not have any warm-up match leading upto this match with rain washing out both their matches--against England and Netherlands. The Men in Blue would hope that the weather is fine when they take on Australia in this highly-anticipated CWC 2023 contest.","pubDate":"2023-10-08 18:26:53","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"6bde044e3d49983f7bdffb3b9ed1fbf6","title":"World Cup 2023: कोहली की इस टिप्स ने किया कमाल, KL राहुल ने मानी विराट की बात, जानें ऑस्ट्रेलिया को कैसे दी मात","link":"https://hindi.latestly.com/sports/cricket/kohli-had-advised-me-to-bat-like-a-test-match-for-some-time-rahulr-1948382.html","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया के खिलाफ नाबाद 97 रन की पारी खेलकर भारत को विश्व कप के अपने पहले मैच में मुश्किल परिस्थितियों से उबार कर छह विकेट की यादगार जीत दिलाने वाले लोकेश राहुल ने कहा कि पूर्व कप्तान विराट कोहली ने शुरुआती ओवरों में विकेटों के पतझड़ के बाद उन्हें टेस्ट मैच की तरह बल्लेबाजी करने की सलाह दी थी.","content":"चेन्नई, 8 अक्टूबर: ऑस्ट्रेलिया के खिलाफ नाबाद 97 रन की पारी खेलकर भारत को विश्व कप के अपने पहले मैच में मुश्किल परिस्थितियों से उबार कर छह विकेट की यादगार जीत दिलाने वाले लोकेश राहुल ने कहा कि पूर्व कप्तान विराट कोहली ने शुरुआती ओवरों में विकेटों के पतझड़ के बाद उन्हें टेस्ट मैच की तरह बल्लेबाजी करने की सलाह दी थी. राहुल अपने शतक से चूक गये लेकिन दो रन पर टीम के तीन विकेट गिरने के बाद उन्होंने कोहली (116 गेंद में 85 रन) के साथ चौथे विकेट के लिए 165 रन की साझेदारी कर भारत का दबदबा बनाया. भारतीय टीम ने जीत के लिए मिले 200 रन के लक्ष्य को 52 गेंद शेष रहते चार विकेट गंवाकर हासिल कर लिया. मैन ऑफ द मैच राहुल ने मैच के बाद कहा, ‘‘ मैं और कोहली ज्यादा बात नहीं कर रहे थे. मैं शुरुआत में संभल कर खेलने की कोशिश कर रहा था. मैं नहाकर ड्रेसिंग रूम में बैठा ही था कि तीन विकेट गिर गये.’’ उन्होने कहा, ‘‘ कोहली ने मुझे कहा कि बिना जोखिम वाले शॉट लगाने के साथ कुछ देर के लिए हमें टेस्ट क्रिकेट की तरह खेलना होगा. पारी की शुरुआती में तेज गेंदबाजों को मदद मिल रही थी लेकिन बाद में ओस के कारण परिस्थितियां बल्लेबाजी के लिए आसान हो गयी.’’ ICC World Cup 2023 Points Table Updated: वर्ल्ड कप में टीम इंडिया का जीत के साथ आगाज़, अंक तालिका पर न्यूजीलैंड का दबदबा बरकरार, यहां देखें सभी टीमों की स्तिथि छक्का लगाकर टीम को जीत दिलाने वाले इस बल्लेबाज ने शतक से चूकने के बारे में कहा, ‘‘ मैं आखिरी पलों में सोच रहा था कि मैं कैसे 100 रन तक पहुंच सकता हूं. मैंने सोचा कि अगर एक चौका और एक छक्का लगाया जाए तो यह संभव हो सकता है. मैंने चौका लगाने की कोशिश की थी लेकिन गेंद का बल्ले से संपर्क ज्यादा अच्छे से हो गया. मुझे इसका कोई मलाल नहीं, मैं कभी और शतक लगा लूंगा.’’ An incredible 97* in the chase when the going got tough 👏👏 KL Rahul receives the Player of the Match award as #TeamIndia start #CWC23 with a 6-wicket win 👌👌 Scorecard ▶️ https://t.co/ToKaGif9ri #CWC23 | #INDvAUS | #TeamIndia | #MeninBlue pic.twitter.com/rY7RfHM1Bf — BCCI (@BCCI) October 8, 2023 भारतीय कप्तान रोहित शर्मा ने भी इस जीत का श्रेय राहुल और कोहली की साझेदारी को दिया. रोहित ने कहा, ‘‘जब हमने शुरुआती तीन विकेट गंवाये तो मैं नर्वस हो गया था. हमने इस दौरान खराब शॉट खेले. ऑस्ट्रेलिया गेंदबाजों को इसका श्रेय दिया जाना चाहिये. हालांकि उसके बाद राहुल और कोहली ने कमाल का खेल दिखाया.’’ रोहित ने ऑस्ट्रेलिया को कम स्कोर पर रोकने के लिए गेंदबाजों और क्षेत्ररक्षकों की सराहना की. उन्होंने कहा, ‘‘ इस तरह से विश्व कप की शुरुआत करना शानदार है. हमने क्षेत्ररक्षण में सुधार के लिए काफी मेहनत की है और आज इसमें मामले में टीम ने अच्छा किया. हमारे खिलाड़ियों ने इन परिस्थितियों का फायदा उठाया.’’ऑस्ट्रेलिया के कप्तान पैट कमिंस ने कहा कि उनकी टीम ने 50 रन कम बनाये थे. End of a magnificent knock from Virat Kohli, who departs for 85 👏👏 #TeamIndia 168/4, with 32 more runs to win. Follow the Match ▶️ https://t.co/ToKaGif9ri #CWC23 | #INDvAUS | #MeninBlue pic.twitter.com/YL4J8DrI6Y — BCCI (@BCCI) October 8, 2023 कमिंस ने कहा, ‘‘ मेरा मानना है कि हमारी टीम ने 50 रन कम बनाये. इस पिच से स्पिनरों को मदद मिल रही थी . भारतीय टीम के पास अच्छे गेंदबाज हैं.’’ उन्होंने कहा, ‘‘हमारी टीम में दो ही स्पिनर थे लेकिन हम 250 के आसपास रन बनाते तो इससे काफी फर्क पड़ सकता था.’’ (यह सिंडिकेटेड न्यूज़ फीड से अनएडिटेड और ऑटो-जेनरेटेड स्टोरी है, ऐसी संभावना है कि लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है)","pubDate":"2023-10-08 18:11:14","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"52efafbb0b00c3f01903194792f7e4ec","title":"World Cup 2023 IND vs AUS: Athiya Shetty, Ayushmann Khurrana and Other Celebs Rejoice Over Team India's Win By Six Wickets","link":"https://www.latestly.com/socially/entertainment/bollywood/world-cup-2023-ind-vs-aus-athiya-shetty-ayushmann-khurrana-and-other-celebs-rejoice-over-team-indias-win-by-six-wickets-5472278.html","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli and KL Rahul were the best players in today's match! With India's win, the team have kicked-off the World Cup 2023 campaign with a six-wicket victory against Australia in Chennai.","content":"Team India turned victor in today's (Oct 8) ICC Cricket World Cup match against Australia. The Men in Blue defeated Aussies by six-wicket and made the country proud. Not only common man, but even many celebs took to their social media handles and hailed the Indian team for putting up a fab show on field. Right from Riteish Deshmukh, Ayushmann Khurrana and many more, stars celebrated India's victory online. Let's check out their reactions below. ICC Cricket World Cup 2023 Points Table Updated: South Africa Kickstart Campaign With Emphatic 102-Run Victory, New Zealand Continue to be on Top . Riteish Deshmukh Architects of today’s victory - absolute master class by @imVkohli & @klrahul - thundering start for India. #WorldCup2023 #IndVsAus https://t.co/WpX9SJhBTd — Riteish Deshmukh (@Riteishd) October 8, 2023 Nakuul Mehta Great start to the World Cup by Team India. Terrible work by the BOARD to keep loyal paying fans away from the game. #IndVsAus — Nakuul Mehta (@NakuulMehta) October 8, 2023 Sophie Choudry Let’s go Indiaaaaaa 🇮🇳 👏🏼👏🏼 Congrats #teamindia esp @imVkohli and @klrahul … superb innings, wonderful start to our World Cup!!! #WorldCup2023 #KLRahul #ViratKohli — Sophie C (@Sophie_Choudry) October 8, 2023 Ayushmann Khurrana Athiya Shetty (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-10-08 18:03:22","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"413c5bd852e9d002eff122e3e082ade7","title":"Sachin Tendulkar, Virender Sehwag and Other Members of Cricket Fraternity React After India Defeat Australia By Six Wickets in ICC Cricket World Cup 2023 Clash","link":"https://www.latestly.com/socially/sports/cricket/sachin-tendulkar-virender-sehwag-and-other-members-of-cricket-fraternity-react-after-india-defeat-australia-by-six-wickets-in-icc-cricket-world-cup-2023-clash-5472293.html","keywords":null,"creator":null,"video_url":null,"description":"India started their campaign with an emphatic victory against Australia riding on the performances of Virat Kohli and KL Rahul. Elated former cricketers reacted on the memorable win.","content":"India won their first game of the ICC Cricket World Cup 2023 against Australia at Chennai displaying a brilliant all-round performance with both ball and bat. First they squeezed Australia with the spinners crumbling them for only 199 runs and then during the chase, despite being in a dire situation, powered themselves out of it riding on the brilliant knocks of Virat Kohli and KL Rahul and won the match registering first points on the table. Sachin Tendulkar, Virender Sehwag, Irfan Pathan were elated by the performance and took to social media to react. I was surprised to see Australia bat first after winning the toss. Commendable performance by the Indian bowlers to restrict them to 199. Australia started well but I felt they missed a left-arm spinner on this surface. The partnership between Virat and Rahul sealed the game for… pic.twitter.com/qUr21Vaqxb — Sachin Tendulkar (@sachin_rt) October 8, 2023 Virender Sehwag's Reaction Laal Fool, Peela Fool. Rahul and Kohli batting beautiful. A partnership to remember for a long time. भारत को जीत पर बधाई । #WorldCup2023 pic.twitter.com/fQJVLgSt6s — Virender Sehwag (@virendersehwag) October 8, 2023 Irfan Pathan's Reaction India 🇮🇳 started the World Cup campaign with a bang. Team is looking solid. Kohli never disappoints the team when he is really needed. Today was no different. And Kl Rahul is playing with great Klass. jaddu baapu tu to kamal che 👏 #IndVsAus — Irfan Pathan (@IrfanPathan) October 8, 2023 Harbhajan Singh's Reaction What an incredible beginning to India's world cup journey! Victory against Australia will give a boost to confidence of players. Brilliant partnership between @imVkohli and @klrahul paved the way for this unforgettable win! Keep up the momentum. pic.twitter.com/lbtUBzcppf — Harbhajan Turbanator (@harbhajan_singh) October 8, 2023 Wasim Jaffer's Reaction Pressure doesn't get bigger than when you're 2/3 in a WC game vs a charged up Aus. Then to soak the pressure, wrestle the initiative back, and win the game takes something special. This was a partnership for the ages 🙌🏽 Well played 👏🏽 #INDvAUS #CWC2023 pic.twitter.com/QDJ5uuR1TL — Wasim Jaffer (@WasimJaffer14) October 8, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-10-08 17:59:40","image_url":null,"source_id":"latestly","source_priority":5523,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"210e81923f7ae3ffa848a2de049be20f","title":"IND vs AUS: दो रन पर तीन विकेट गिरने के बावजूद मिली जीत तो खुशी से गदगद दिखे रोहित, मैच के बाद दिया बड़ा बयान","link":"https://www.abplive.com/sports/cricket/odi-world-cup-2023-ind-vs-aus-indian-captain-rohit-sharma-s-reaction-after-wining-against-australia-2510832","keywords":["Cricket"],"creator":["एबीपी लाइव"],"video_url":null,"description":"Rohit Sharma's Reaction: भारत ने विश्व कप 2023 का पहला मुकाबला ऑस्ट्रेलिया के खिलाफ खेला, जिसमें मेज़बान भारत ने 6 विकेट से जीत दर्ज की. भारत की इस जीत में केएल राहुल और विराट कोहली ने बल्ले से अहम किरदार अदा किया. वहीं गेंदबाज़ी में रवींद्र जडेजा ने सबसे ज़्यादा विकेट लिए. भारत की ओर से फील्डिंग में काफी चुस्ती दिखाई दी. सिर्फ टीम का टॉप ऑर्डर कमज़ोर रहा, बाकी पूरी टीम ने शानदार खेल दिखाया, जिससे कप्तान रोहित शर्मा काफी खुश दिखाई दिए.  रोहित शर्मा ने मैच के बाद पूरी टीम की तारीफ की. इसके अलावा उन्होंने केएल राहुल और विराट कोहली की बैटिंग की अलग से सराहा. भारतीय कप्तान ने कहा, “बहुत उत्साहित. टॉप पर आकर अच्छी फीलिंग है. टूर्नामेंट की शुरुआत के लिए अच्छा गेम था. मुझे लगा कि यह शानदार था, खासकर फील्डिंग और सभी की तरफ से हमने आज जो प्रयास देखा, इस तरह की कंडीशन मुश्किल होंगी.” भारतीय कप्तान ने आगे कहा, “हमारे गेंदबाज़ों ने परिस्थितियों का अच्छी तरह से इस्तेमाल किया और हमे पता था कि यहां सबके लिए मदद होगी, यहां तक तेज़ गेंदबाज़ों को भी कुछ रिवर्स स्विंग मिली, स्पिनर्स ने अच्छे एरिया में गेंदबाज़ी की और कुल मिलाकर यह शानदार एफर्ट था. मैं घबराया हुआ था, आप इस तरह से अपनी पारी की शुरुआत नहीं करना चाहते हैं, ऑस्ट्रेलियाई गेंदबाज़ों को क्रेडिट क्योंकि उन्होंने अच्छे एरिया में गेंदबाज़ी की लेकिन कुछ खराब शॉट भी रहे. जब आपके आगे ऐसा लक्ष्य होता है तो आप पॉवरप्ले में ज़्यादा से ज़्यादा रन बनाना चाहते हैं.” राहुल विराट की ऐसे की तारीफ भारतीय कप्तान ने केएल राहुल और विराट कोहली की खासकर तारीफ की. उन्होंने कहा, “राहुल और विराट को क्रेडिट जाता है कि कैसे वो चेज की ओर गए. टीम के रूप में यह चुनौती होगी, अलग-अलग परिस्थितियों में जाना और उन्हें अपनाना, जिसे भी परिस्थितिया सूट करेंगी वो आकर काम करेगा. चेन्नई कभी निराश नहीं करता है, वे अपने क्रिकेट से प्यार करते हैं और उनके लिए गर्मी में आकर बैठना और टीम का उत्साह बढ़ाना बहुत कुछ कहता है.”   ये भी पढ़ें... IND vs AUS: 'टेस्ट क्रिकेट की तरह खेला...', प्लेयर ऑफ द मैच बने केएल राहुल ने जीत के स्पेशल प्लान का किया खुलासा","content":"Rohit Sharma's Reaction: भारत ने विश्व कप 2023 का पहला मुकाबला ऑस्ट्रेलिया के खिलाफ खेला, जिसमें मेज़बान भारत ने 6 विकेट से जीत दर्ज की. भारत की इस जीत में केएल राहुल और विराट कोहली ने बल्ले से अहम किरदार अदा किया. वहीं गेंदबाज़ी में रवींद्र जडेजा ने सबसे ज़्यादा विकेट लिए. भारत की ओर से फील्डिंग में काफी चुस्ती दिखाई दी. सिर्फ टीम का टॉप ऑर्डर कमज़ोर रहा, बाकी पूरी टीम ने शानदार खेल दिखाया, जिससे कप्तान रोहित शर्मा काफी खुश दिखाई दिए. रोहित शर्मा ने मैच के बाद पूरी टीम की तारीफ की. इसके अलावा उन्होंने केएल राहुल और विराट कोहली की बैटिंग की अलग से सराहा. भारतीय कप्तान ने कहा, “बहुत उत्साहित. टॉप पर आकर अच्छी फीलिंग है. टूर्नामेंट की शुरुआत के लिए अच्छा गेम था. मुझे लगा कि यह शानदार था, खासकर फील्डिंग और सभी की तरफ से हमने आज जो प्रयास देखा, इस तरह की कंडीशन मुश्किल होंगी.” भारतीय कप्तान ने आगे कहा, “हमारे गेंदबाज़ों ने परिस्थितियों का अच्छी तरह से इस्तेमाल किया और हमे पता था कि यहां सबके लिए मदद होगी, यहां तक तेज़ गेंदबाज़ों को भी कुछ रिवर्स स्विंग मिली, स्पिनर्स ने अच्छे एरिया में गेंदबाज़ी की और कुल मिलाकर यह शानदार एफर्ट था. मैं घबराया हुआ था, आप इस तरह से अपनी पारी की शुरुआत नहीं करना चाहते हैं, ऑस्ट्रेलियाई गेंदबाज़ों को क्रेडिट क्योंकि उन्होंने अच्छे एरिया में गेंदबाज़ी की लेकिन कुछ खराब शॉट भी रहे. जब आपके आगे ऐसा लक्ष्य होता है तो आप पॉवरप्ले में ज़्यादा से ज़्यादा रन बनाना चाहते हैं.” राहुल विराट की ऐसे की तारीफ googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); भारतीय कप्तान ने केएल राहुल और विराट कोहली की खासकर तारीफ की. उन्होंने कहा, “राहुल और विराट को क्रेडिट जाता है कि कैसे वो चेज की ओर गए. टीम के रूप में यह चुनौती होगी, अलग-अलग परिस्थितियों में जाना और उन्हें अपनाना, जिसे भी परिस्थितिया सूट करेंगी वो आकर काम करेगा. चेन्नई कभी निराश नहीं करता है, वे अपने क्रिकेट से प्यार करते हैं और उनके लिए गर्मी में आकर बैठना और टीम का उत्साह बढ़ाना बहुत कुछ कहता है.” ये भी पढ़ें... IND vs AUS: 'टेस्ट क्रिकेट की तरह खेला...', प्लेयर ऑफ द मैच बने केएल राहुल ने जीत के स्पेशल प्लान का किया खुलासा","pubDate":"2023-10-08 17:42:06","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/08/af4cf33c1249f258b72b3f4d333e22271696786680969582_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"8f89d3c004a70b94baea8929a410fa86","title":"Might have to change combinations as per different conditions: Rohit Sharma","link":"http://www.newindianexpress.com/sport/cricket/2023/oct/08/might-have-to-change-combinations-as-per-different-conditions-rohit-sharma-2622056.html","keywords":null,"creator":null,"video_url":null,"description":"However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. CHENNAI: Rohit Sharma on Sunday admitted that the biggest challenge in front of his side would be to play in different conditions, and the Indian captain also did not rule out making changes in team combinations to suit the demands of a particular venue. However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. \"That will be the biggest challenge moving forward because we will play in different conditions. (We) might have to change combinations too and as a team we are prepared to do that,\" said Rohit during the post-match presentation. Rohit was particularly pleased with the team's fielding. \"Good feeling to come out on top. Magnificent, especially the fielding. The fielding was something we really put our effort on. It was a great effort. In conditions like this it can be tough sometimes. We knew there would be assistance for everyone. Seamers got reverse, spinners bowled in nice areas. All in all a great effort,\" he said. Rohit was one of the three top-order India batters to get out for a duck, and the skipper admitted to being nervous with the home team reeling at 2/3 in the second over. \"Yes I was (nervous) to be honest. You don't want to start like that when chasing a target. Credit to Australia, but some loose shots there as well. But that happens, you want to get off the mark and score quickly in the powerplay.\" \"But hats off to Virat and KL - the way they stuck out there to create a match-winning partnership,\" Rohit said. Australian captain Pat Cummins felt his team was 50 runs short of what could have been a challenging total. \"At least 50-odd. It was tough, trying to defend anything under 200. It was a really good bowling attack and their spinners made it tough work out there. \"I wasn't too upset (with just two spinners), we had 20 overs of spin but some more runs on the board would have made the difference,\" Cummins said. When asked about the drop catch by Mitchell Marsh early on in Kohli's innings, Cummins said, \"I have already forgotten about it, it happens, 4/10 would have been a dream start. \"Just one game out of nine, not too much to ponder about but there are some areas we need to get better.\" Arriving at the crease with his team in a spot of bother, Rahul said Kohli had advised him to play out that difficult period like they do in Test cricket. \"Quite honestly, there weren't a lot of conversations (with Kohli). I thought I'd get a good shower and get a break. I was just trying to get my breath back.\" \"Virat said there's a bit in the wicket, so play like Test cricket for a while. There was a bit of help for the pacers with the new ball, and then the spinners also,\" Rahul said. \"In the last 15-20 overs, dew played a part and that helped quite a bit. The ball also skidded on better. However, it was a bit two-paced, it wasn't the easiest of wickets to bat on and it wasn't flat as well.\" \"It was a good cricket wicket, bit for the batters and the bowlers. That's what you get in the south of India, especially in Chennai.","content":"CHENNAI: Rohit Sharma on Sunday admitted that the biggest challenge in front of his side would be to play in different conditions, and the Indian captain also did not rule out making changes in team combinations to suit the demands of a particular venue. However, Rohit heaved a sigh of relief after India recovered from a precarious 2/3 to beat Australia by six wickets and begin their campaign in the showpiece on a positive note. \"That will be the biggest challenge moving forward because we will play in different conditions. (We) might have to change combinations too and as a team we are prepared to do that,\" said Rohit during the post-match presentation. Rohit was particularly pleased with the team's fielding. \"Good feeling to come out on top. Magnificent, especially the fielding. The fielding was something we really put our effort on. It was a great effort. In conditions like this it can be tough sometimes. We knew there would be assistance for everyone. Seamers got reverse, spinners bowled in nice areas. All in all a great effort,\" he said. Rohit was one of the three top-order India batters to get out for a duck, and the skipper admitted to being nervous with the home team reeling at 2/3 in the second over. \"Yes I was (nervous) to be honest. You don't want to start like that when chasing a target. Credit to Australia, but some loose shots there as well. But that happens, you want to get off the mark and score quickly in the powerplay.\" \"But hats off to Virat and KL - the way they stuck out there to create a match-winning partnership,\" Rohit said. Australian captain Pat Cummins felt his team was 50 runs short of what could have been a challenging total. \"At least 50-odd. It was tough, trying to defend anything under 200. It was a really good bowling attack and their spinners made it tough work out there. \"I wasn't too upset (with just two spinners), we had 20 overs of spin but some more runs on the board would have made the difference,\" Cummins said. When asked about the drop catch by Mitchell Marsh early on in Kohli's innings, Cummins said, \"I have already forgotten about it, it happens, 4/10 would have been a dream start. \"Just one game out of nine, not too much to ponder about but there are some areas we need to get better.\" Arriving at the crease with his team in a spot of bother, Rahul said Kohli had advised him to play out that difficult period like they do in Test cricket. \"Quite honestly, there weren't a lot of conversations (with Kohli). I thought I'd get a good shower and get a break. I was just trying to get my breath back.\" \"Virat said there's a bit in the wicket, so play like Test cricket for a while. There was a bit of help for the pacers with the new ball, and then the spinners also,\" Rahul said. \"In the last 15-20 overs, dew played a part and that helped quite a bit. The ball also skidded on better. However, it was a bit two-paced, it wasn't the easiest of wickets to bat on and it wasn't flat as well.\" \"It was a good cricket wicket, bit for the batters and the bowlers. That's what you get in the south of India, especially in Chennai.","pubDate":"2023-10-08 17:42:00","image_url":null,"source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"}]}