{"newsArray":[{"title":"‘I had no idea’: How Shane Watson won the mental battle","link":"https://www.watoday.com.au/sport/cricket/i-had-no-idea-how-shane-watson-won-the-mental-battle-20221104-p5bvpx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Shane Watson is adamant cricket’s leaders across the world need to recognise that mental skills are the game’s next frontier.","content":null,"pubDate":"2022-11-11 00:30:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"T20 WC Semi Final | “Had scored 180+ runs…” – Coach Dravid’s reasons for failure","link":"https://thenewsglory.com/t20-wc-semi-final-had-scored-180-runs-coach-dravids-reasons-for-failure/","keywords":["Sports","Cricket","Dravid","Indian team","Rahul Dravid","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Adelaide: In the semi-final of the ongoing T20 World Cup, the Indian cricket team suffered a heavy defeat against England. The defeat of the Indian team, which was considered as one of the teams to win the trophy, has left the fans very sad. The Indian team, which entered the knockouts with the honor of […]","content":"Adelaide : In the semi-final of the ongoing T20 World Cup, the Indian cricket team suffered a heavy defeat against England. The defeat of the Indian team, which was considered as one of the teams to win the trophy, has left the fans very sad. The Indian team, which entered the knockouts with the honor of being the only team to win 4 matches in the Super 12 rounds, was criticized for not being able to take a single wicket of the England team. Talking about the reasons behind the defeat, India’s coach Rahul Dravid said, “We have been good throughout the World Cup series. But today is not our day. It will help if we score a lot of runs in important matches. Even in the current series, India is one of the teams to score 180+ runs. We have done it two or three times. But today at the end of 15 overs we scored 15 to 20 runs less. However, we played well in the last five overs. Looking at England’s batting, we realized that we were much less than 15 to 20 runs. Surely 180 to 185 runs should have been scored on this pitch. I think the outcome of the match might have changed if we had done that.”","pubDate":"2022-11-10 22:47:14","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Two sides to a coin – Sachin’s tweet in support of Indian players","link":"https://thenewsglory.com/two-sides-to-a-coin-sachins-tweet-in-support-of-indian-players/","keywords":["Sports","England","Indian team","Sachin","sachin tendulkar","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Delhi: Cricket legend Sachin has posted in support of the Indian team who lost to the England team in the T20 World Cup semi-final match. India lost to England in the T20 World Cup semi-final in Adelaide. After this, criticisms have arisen on the Indian team. Fans are expressing their displeasure. Meanwhile, former Indian cricketer […]","content":"Delhi : Cricket legend Sachin has posted in support of the Indian team who lost to the England team in the T20 World Cup semi-final match. India lost to England in the T20 World Cup semi-final in Adelaide. After this, criticisms have arisen on the Indian team. Fans are expressing their displeasure. Meanwhile, former Indian cricketer Virender Sehwag slammed the Indian batting unit for not showing aggressive play in the semi-final. Similarly, Sachin has also expressed his opinion. After India’s defeat, Sachin tweeted in support, “A coin has two sides. Like life has two sides. If we celebrate our team’s success as our own, we should also accept our team’s failure.”","pubDate":"2022-11-10 21:46:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ruthless England OBLITERATE India to reach T20 World Cup F","link":"https://www.themercury.com.au/sport/cricket/ruthless-england-obliterate-india-to-reach-t20-world-cup-f/video/a70361efdddd801903eb5abda96884e6","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A record partnership between Jos Buttler and Alex Hales has seen England romp home to a 10-wicket victory against India to reach the World Cup T20 Final.","content":"Cricket: A record partnership between Jos Buttler and Alex Hales has seen England romp home to a 10-wicket victory against India to reach the World Cup T20 Final.","pubDate":"2022-11-10 20:09:22","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"England vs Pakistan live stream FREE – how to watch T20 cricket World Cup final without paying a penny","link":"https://insidexpress.com/sports-athletics/england-vs-pakistan-live-stream-free-how-to-watch-t20-cricket-world-cup-final-without-paying-a-penny/","keywords":["Sports & Athletics","cricket","Cup","England","final","Free","Live","Pakistan","paying","Penny","stream","T20","Watch","World"],"creator":["The Insidexpress"],"video_url":null,"description":"THE entire nation will be able to tune in to England’s T20 cricket World Cup final against Pakistan. Sky Sports have agreed to share the broadcasting rights of Sunday’s final… From The Insidexpress, England vs Pakistan live stream FREE – how to watch T20 cricket World Cup final without paying a penny by The Insidexpress.","content":"THE entire nation will be able to tune in to England’s T20 cricket World Cup final against Pakistan. Sky Sports have agreed to share the broadcasting rights of Sunday’s final with free-to-air broadcaster Channel 4. England captain Jos Buttler was happy to hear that the final would be on free-to-air television. Credit: PA The sports channel had been the exclusive UK rights holders to the tournament and has been airing games on their channels. The deal was reportedly agreed in principle before England’s semi-final clash against India . Jos Buttler ‘s side swept aside their opponents in a ten-wicket victory, in which he and Alex Hales chased down the target of 169 runs by themselves. The win set-up a final between England and Pakistan , who beat New Zealand in their semi-final match. The match will be shown on Channel 4 and for free on Sky’s Showcase channel. Captain Buttler admitted that he was happy to hear the news that the game will be accessible for everyone after the game against India. He said: “We’d be immensely happy with that. That would be fantastic for the game in our country, as many eyes as we can get on that final would be great. “That’d be brilliant if that happens. It’s important that we always look to grow our game and showcase cricket to the next generation especially, so we’d really welcome that if that was possible.” The match will start at 8am GMT at the MCG in Melbourne, 30 years on from their match in the 50-over final. Jonathan Licht, Sky Sports managing director, said: “We know the importance of this game, so we are pleased to be able to share this great sporting moment with our whole nation thanks to our strong relationship with Channel 4. “Whether you’re supporting England or Pakistan, this will be one to remember.” Ian Katz, chief content officer at Channel 4, added: “We are thrilled that Channel 4 and Sky have struck this deal to make another great national sporting moment available on free-to-air television to audiences across the UK. “As the days draw in, some thrilling international cricket from the southern hemisphere should offer some welcome cheer.” It follows similar deals to the ones that saw Emma Raducanu’s US Open final victory and Lewis Hamilton’s world title shoot-out with Max Verstappen be shown on Channel 4. Publisher 1 0 0 0 Share 1 Tweet 0 Pin it 0 Share 0","pubDate":"2022-11-10 19:49:11","image_url":"https://www.thesun.co.uk/wp-content/uploads/2022/11/england-captain-jos-buttler-prior-773097290.jpg","source_id":"insidexpress","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Experts slam India’s ‘timid’ Power-play approach after embarrassing semifinal defeat","link":"https://kashmirreader.com/2022/11/11/experts-slam-indias-timid-power-play-approach-after-embarrassing-semifinal-defeat/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Adelaide: Former cricketers Shane Watson, Wasim Akram and Nasser Hussain slammed India’s ‘timid’ batting approach following team’s embarrassing exit from the T20 World Cup, here on Thursday. England hammered India by 10 wickets with Alex Hales and Jos Buttler striking powerful half-centuries. As it was the case in the Group stage, India played conservatively in […]","content":"Adelaide: Former cricketers Shane Watson, Wasim Akram and Nasser Hussain slammed India’s ‘timid’ batting approach following team’s embarrassing exit from the T20 World Cup, here on Thursday. England hammered India by 10 wickets with Alex Hales and Jos Buttler striking powerful half-centuries. As it was the case in the Group stage, India played conservatively in the powerplay managing only 38 runs while England’s approach was the opposite as they raced to 63 in six overs. Ahead of the T20 World Cup, India had adopted a more aggressive batting approach but the likes of Rohit Sharma and K L Rahul were unable to unleash themselves on the big stage. There was a sense of deja vu with India’s abject surrender though they had exited from the previous edition 12 months ago in round one itself. “India were too timid with the bat. Unfortunately, Rohit and KL have not been able to take the game on in the first six overs. They have got the firepower but you have to take the game on in T20 cricket,” former Australia all-rounder Watson told Star Sports. “Hardik was able to take the game on but India should have attacked 6-8 overs earlier.” As England skipper Buttler hit the winning six, Nasser Hussain on air remarked : “India were timid upfront and England have taken them down.” Former Pakistan captain Wasim Akram said India’s slow start cost them the game. “Their start was slow and they could not recover from that. 190 probably would have been a good total on this wicket. They accelerated late, if it wasn’t for Hardik Pandya, India would not have even got a respectable total. “Their captain (Rohit) looked out of touch and then of course Virat got his fifty but he took 40 balls to do that. That was the difference,” Akram told A Sports. Former India selector Sarandeep Singh too gave his assessment on the game. “Unfortunately for India, Rahul and Rohit could not find form in the big games, putting pressure on Virat and Suryakumar, who both can’t perform game after game,” he told PTI referring to Kohli and Surya’s splendid run. —PTI Experts slam India’s ‘timid’ Power-play approach after embarrassing semifinal defeat added by Press Trust of India on 12:52 am November 11, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-11-10 19:22:35","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Dravid plea sums up world cricket’s delicate balance","link":"https://www.watoday.com.au/sport/cricket/dravid-plea-sums-up-world-cricket-s-delicate-balance-20221110-p5bxar.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"India’s ban on players in overseas leagues, consequent inability to win a Twenty20 World Cup since the dawn of the IPL, may just be the price of Test cricket’s global survival","content":"India’s ban on players taking part in overseas leagues, and a consequent inability to win a Twenty20 World Cup since the dawn of the Indian Premier League 14 years ago, may just be the price of Test cricket’s global survival. That was the earnest takeaway of India’s thoughtful coach Rahul Dravid after a night on which England, a team stacked with Big Bash League veterans led by the match award winner Alex Hales and captain Jos Buttler, raced away to a victory that set up a replay of the 1992 ODI World Cup final against England at the MCG. Cricket’s tectonic plates will be shifting in parallel with the buildup to the tournament decider, as the International Cricket Council board meets to decide on the re-election of the current chair, Greg Barclay, before discussions begin on how to divide up the $US3 billion ($4.5 billion) broadcast rights deal recently agreed with Disney Star. That money comes almost entirely from the enormous size of the Indian market, which has also made the IPL cricket’s biggest commercial property by far. And yet the embargo on Indian players going to overseas T20 leagues such as the BBL is having the counterweight effect of restricting the national team’s array of experience and ability to win trophies. For Dravid, one of cricket’s soundest minds, the flow-on effects are numerous. It was startling, but not entirely inaccurate, for him to speak of how West Indies cricket has devolved due to T20 franchise clashes with its home season over the past decade. “There’s no doubt about it that England, a lot of their players have come here and played in this tournament, it’s certainly showed,” Dravid said. “It’s tough, I think it’s very difficult for Indian cricket because a lot of these tournaments happen right in the peak of our season. It’s a huge challenge for us. Yes, I think a lot of our boys maybe do miss out on the opportunities of playing in a lot of these leagues, but it’s really up to the BCCI to make that decision. Jos Buttler and Alex Hales celebrate England’s victory. Credit: Getty Images “The thing is, it’s right in the middle of our season and with the kind of demand there would be for Indian players, if you allowed all the Indian players to play in these leagues, we would not have domestic cricket. Our domestic cricket, our Ranji Trophy would be finished, and that would mean Test cricket would be finished.” For Jay Shah, the BCCI’s secretary and representative on the ICC board, these sorts of balances must also be considered when he confers with Barclay over how much of the global rights deal India will demand for itself.","pubDate":"2022-11-10 19:00:00","image_url":null,"source_id":"watoday","country":["australia"],"category":["sports"],"language":"english"},{"title":"Must play without fear: Sehwag criticized the Indian team","link":"https://thenewsglory.com/must-play-without-fear-sehwag-criticized-the-indian-team/","keywords":["Sports","Cricket","Indian team","Sevak","T20 WC","T20 World Cup.","Virender Sehwag"],"creator":["The News Glory"],"video_url":null,"description":"Adelaide: India lost to England in the T20 World Cup semi-final in Adelaide. After this, criticisms have arisen on the Indian team. Fans are expressing their displeasure. Meanwhile, former Indian cricketer Virender Sehwag has slammed the Indian batting unit for not showing aggressive play in the semi-finals. Sehwag said, “None of the Indian batsmen are […]","content":"Adelaide : India lost to England in the T20 World Cup semi-final in Adelaide. After this, criticisms have arisen on the Indian team. Fans are expressing their displeasure. Meanwhile, former Indian cricketer Virender Sehwag has slammed the Indian batting unit for not showing aggressive play in the semi-finals. Sehwag said, “None of the Indian batsmen are playing fearless cricket today. If they don’t play fearlessly on the field, they will have to leave the match. So at least they can keep the opposition scared. Not even that. Fearless cricket is gone now. Even if you lose, at least lose. On a favorable batting pitch, the Indian players did not score enough runs. And England’s bowling was not challenged at all. Had more runs been scored, something might have happened. In the last two T20 World Cups, there has been no major difference in the Indian team. In the last T20 World Cup, they lost to Pakistan by 10 wickets and exited. They were very vocal about bringing some changes in the team then. But there were only one or two changes. Mostly the same faces that played in the last World Cup, nothing has changed, the attitude is the same. Only Virat Kohli has scored in critical matches,” he said.","pubDate":"2022-11-10 18:43:12","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler heaps praise on England after their stunning semi-final win against India","link":"https://www.dailymail.co.uk/sport/cricket/article-11413509/Jos-Buttler-heaps-praise-England-stunning-semi-final-win-against-India.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler cast his mind back seven years to the nadir of England's white-ball cricket at this same Adelaide Oval ground and contrasted it with the near perfect performance over India on Thursday.","content":"'A fantastic performance against a formidable team': Captain Jos Buttler heaps praise on England after their stunning semi-final win against India - and vows his side are 'incredibly dangerous' heading into Sunday's final England smashed India on Thursday to reach the 2022 Twenty20 World Cup final Jos Buttler and Alex Hales hit a superb 170-run partnership to chase India's total The England captain admitted it was a 'by far the best' his team had played so far His side will face Pakistan in Sunday's final after their win against New Zealand Buttler lay the ghost of the Adelaide Oval having lost there to Bangladesh in 2015 By Paul Newman for MailOnline Published: 17:19 GMT, 10 November 2022 | Updated: 18:04 GMT, 10 November 2022 e-mail 1 View comments Jos Buttler cast his mind back seven years to the nadir of England’s white-ball cricket at this same Adelaide Oval ground and contrasted it with the near perfect performance over India on Thursday that took his side to the Twenty20 World Cup final. Defeat by Bangladesh here in the 2015 50-over World Cup became a watershed moment for England’s white-ball cricket and led to the transformation that has seen them reach at least the semi-finals in five world tournaments since. Now England are in the final of this T20 World Cup, where they will play Pakistan , and have the chance to unite the 50-over and T20 world titles after a comprehensive dismantling of favourites India. Jos Buttler led his England side to a superb win against India in the T20 World Cup semi-final RELATED ARTICLES Previous 1 Next England will take on Pakistan in a huge T20 World Cup final... Jos Buttler and Alex Hales demolish India and blast England... Kevin Pietersen and Gary Lineker lead praise for 'ruthless'... T20 World Cup bosses set to take DRASTIC action to save... Share this article Share ‘It was a little bit different to seven years ago,’ said Buttler, one of five survivors from that miserable World Cup. ‘This was just a fantastic performance against a formidable team and I’m immensely proud of the guys. ‘That was by far the best we have played in this tournament. To do that on a day like today in such a high pressure game is very satisfying.’ England totally outclassed India, surpassing their 168 for six by 10 wickets with fully four overs to go, Buttler and Alex Hales hitting 10 sixes between them to silence the vast majority of India fans in a 40,000 crowd at the Adelaide Oval. ‘We are a good team and that’s where that performance came from,’ said Buttler in answer to a question about England’s patchy form in reaching the semi-finals, including defeat by Ireland in the group stages and narrow victories over Afghanistan and Sri Lanka. The captain insisted England were 'incredibly dangerous' ahead of Sunday's World Cup final He and Alex Hales put together a 170-run partnership to chase down India's total with ease ‘We have some brilliant players in our team and when we play at our best we’re a tough team to beat. 'We are incredibly dangerous. I never thought we were favourites and we haven’t played as well as we can do in this tournament yet still we find ourselves in a final of a World Cup and we saved our best performance so far for the semi-final.’ Buttler paid tribute to Alex Hales, unbeaten on 86 with seven of those sixes, who was only called up for this World Cup after three years in the wilderness when Jonny Bairstow suffered a badly broken leg in a freakish accident while playing golf. Bangladesh defeated Buttler and England at the Adelaide Oval in the 2015 50-over World Cup ‘Alex has been performing well for a long period of time,’ said Buttler. ‘Unfortunately he hasn’t been able to get back in due to other players playing brilliantly well. An opportunity arose here and in the last three matches in particular his form has been absolutely fantastic. It was great to tuck in behind him tonight and bat at the other end.’ Now England move on to Melbourne for Sunday’s final in a match, as Sportsmail revealed, that Sky will share with free to air television, a move Buttler welcomed. ‘I’d be immensely happy with that,’ said the England captain. ‘That would be fantastic for the game in our country. As many eyes as we can get on that final would be great. It’s important that we always look for ways to grow our game and showcase cricket.’ RELATED ARTICLES Previous 1 Next England will take on Pakistan in a huge T20 World Cup final... Jos Buttler and Alex Hales demolish India and blast England... Kevin Pietersen and Gary Lineker lead praise for 'ruthless'... T20 World Cup bosses set to take DRASTIC action to save... Share this article Share Share or comment on this article: Jos Buttler heaps praise on England after their stunning semi-final win against India e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have been moderated in advance. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2022-11-10 18:04:45","image_url":"https://i.dailymail.co.uk/1s/2022/11/10/18/64417125-0-image-a-131_1668103475915.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"When do England play Pakistan in the T20 World Cup final and what TV channel is it on?","link":"https://metro.co.uk/2022/11/10/when-do-england-play-pakistan-in-the-t20-world-cup-final-and-what-tv-channel-is-it-on-17737897/","keywords":["Cricket","Sport","Cricket World Cup","England cricket","Jos Buttler","Pakistan Cricket"],"creator":["Harry Thomas-Humphreys"],"video_url":null,"description":"England are one game away from glory.","content":"Jos Buttler will lead England into the World Cup final (Picture: Mark Kolbe/Getty Images) England have reached the final of the T20 World Cup in Australia after a stunning 10 wicket victory over India in the semi-final. Jos Buttler and Alex Hales produced an incredible partnership of 170 to sweep England into their second white ball final in three years. But with large swathes of the public set to cheer on England in the final against Pakistan, fans have been keen to find out how they can witness what they hope will be a piece of English cricket history. Well thankfully, Metro.co.uk is on hand to tell you what time England are playing in the final and how you can watch it on TV. When is the Cricket World Cup final? The T20 World Cup final will take place on Sunday, November 13. The match will begin at 8am GMT at the 100,000 capacity Melbourne Cricket Ground. The match will be a repeat of the 1992 ODI final which saw Pakistan break English hearts to lift the trophy – that game also took place at the famous cricket stadium in Melbourne. England are just one game away from yet more Cricket immortality (Picture: Sarah Reed/Getty Images) England’s only T20 World Cup win came in the West Indies in 2010, whilst Pakistan won the tournament a year earlier when it was staged in England. What TV channel will England vs Pakistan be on? As well as being shown on Sky Sports Main Event and Sky Sports Cricket, the final will also be shown live and for free on Channel 4. This will mean that millions of fans will be able to watch the showpiece event during Sunday breakfast time on free-to-air television. Sky has adopted a policy of sharing matches of national significance with terrestrial partners in recent years. More: CricketAlex Hales and Jos Buttler destroy India to send England into T20 World Cup finalRohit Sharma blames India bowlers for crushing T20 World Cup defeat to EnglandWhat time is England vs India in the T20 World Cup and what TV channel is it on? England’s dramatic ODI World Cup final victory over New Zealand in 2019 was also broadcast on Channel 4. Sky Sports managing director Jonathan Licht said: ‘We know the importance of this game, so we are pleased to be able to share this great sporting moment with our whole nation thanks to our strong relationship with Channel 4. ‘Whether you’re supporting England or Pakistan, this will be one to remember.’ MORE : Babar Azam and Kane Williamson speak out after Pakistan beat New Zealand to reach T20 World Cup final MORE : Jos Buttler: Adelaide humiliation in 2015 was catalyst to white ball success Follow Metro across our social channels, on Facebook, Twitter and Instagram Share your views in the comments below","pubDate":"2022-11-10 17:46:01","image_url":null,"source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Miss you Captain Dhoni! – Fans reaction after India’s T20 WC semi-final defeat","link":"https://thenewsglory.com/miss-you-captain-dhoni-fans-reaction-after-indias-t20-wc-semi-final-defeat/","keywords":["Sports","Cricket","Dhoni","India","MS Dhoni","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"In the current T20 World Cup series, the Indian cricket team suffered a very bad defeat in the semi-final against England. After that, the fans are criticizing Indian team captain Rohit Sharma, team management, BCCI and unsophisticated players. At the same time, some people asked, ‘What would it be like if only Dhoni was there […]","content":"In the current T20 World Cup series, the Indian cricket team suffered a very bad defeat in the semi-final against England. After that, the fans are criticizing Indian team captain Rohit Sharma, team management, BCCI and unsophisticated players. At the same time, some people asked, ‘What would it be like if only Dhoni was there this time?’ They are sharing the fame of former captain Dhoni on social media. He is the captain of the Indian cricket team who has won three ICC titles namely T20 World Cup (2007), 50 Over World Cup (2011) and Champions Trophy (2013). That is history. Dhoni, who has captained a total of 9 ICC series, secured these 3 victories for the team. Now fans are remembering him. Dhoni has captained India in three of the five ICC series they have won. Some of the comments shared by fans about Dhoni on social media. Dhoni forgot one thing while promoting Oriyava. It’s just that he’s not in the team. Dhoni is the only player who comes to our memories whenever the Indian team loses. There is no substitute for Dhoni sir. Indian cricket fans miss Dhoni a lot on the field. Winning a trophy is an art. 130 crore people miss Dhoni. Unfortunately while doing advertisement of #Oreo biscuit, @msdhoni forgot he is not there in current team. Missing captaincy of Dhoni #Dhoni #INDvENG #T20Iworldcup2022 pic.twitter.com/focxMEVHzr This is how Dhoni’s record goes on. Dhoni’s last international cricket match was the semi-final of the 2019 50 Over World Cup. He then announced his retirement. He is currently playing IPL cricket for Chennai Super Kings.","pubDate":"2022-11-10 17:42:12","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Brilliant performance but don’t want to pat ourselves before final: Jos Buttler","link":"https://www.tribuneindia.com/news/sports/brilliant-performance-but-dont-want-to-pat-ourselves-before-final-jos-buttler-449659","keywords":null,"creator":null,"video_url":null,"description":"Adelaide, November 10England captain Jos Buttler termed his team's 10-wicket victory in the T20 World Cup semi-final as \"brilliant\" but said he wouldn't want to get too ahead of himself before the final against Pakistan on Sunday.England dished out a dominating performance as they restricted India to 168 for six and then knocked off the runs with four overs to spare and without losing a single wicket.\"Yeah, it's a brilliant performance. To play so well in a semifinal of a World Cup is great. Don't want to get too far ahead of ourselves and sort of pat ourselves too much on the back for tonight. We're obviously into a final which we're really looking forward to,\" said Buttler after playing a key role with his 80 not out.\"We enjoyed the game this evening, and we can talk about it in the changing rooms and enjoy that performance, but I don't want us to get too far ahead of ourselves. We've come up against a Pakistan team in red-up form in a final of a World Cup.\"And again, that's going to be such an amazing occasion, one we'll go and enjoy as much as we can and express ourselves and try and show off our talent.\" Asked if it was one of the finest T20I performance by an English team, he agreed instantly.\"Yeah, yeah, absolutely. Every game you play it's a great honour. Yeah, to play against India in this kind of environment, in a fantastic cricket stadium, absolutely, it's immensely satisfying,\" he said.While some of the Indian players' feedback to their coach Rahul Dravid was about the pitch being tacky (slow), Buttler was completely dismissive of that notion.\"I don't think so really. Obviously, there was a little bit of spin in the wicket when you drove into the surface, but I thought it was a good wicket. The groundsman was telling me before the game it was a good wicket, and glad to trust him,\" he said.He also added that the track suited both teams equally.\"I think it suited both teams. I thought the wicket was good. If a team can score 170 for none, it's a good pitch. Adil Rashid bowled brilliantly today. He was outstanding. His performance was great.\" Hardik Pandya smashed a 33-ball 63 to prop up India's total and Buttler said his performance at the back-end shows that the wicket was good.\"Yeah, absolutely. I think the way they played in the back 10 overs they scored heavily in that period, which I think showed what a good wicket it was. The dimensions can be tough to defend, as well. So yeah, I was confident in the wicket,\" he said.\"I thought the first 12, 14 overs of our bowling innings was outstanding. I think taking that early wicket, the way we set them back, the way we held them put a lot of pressure. Fantastic innings from Hardik Pandya to get them up to that score.\"","content":null,"pubDate":"2022-11-10 16:41:43","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1621558933.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC Semi Final | Indian bowlers bowled out – England progress to final with win without loss","link":"https://thenewsglory.com/t20-wc-semi-final-indian-bowlers-bowled-out-england-progress-to-final-with-win-without-loss/","keywords":["Sports","Cricket","England","India","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Adelaide: In the ongoing T20 World Cup series, the England team has advanced to the final after defeating India. The team’s openers Alex Hales and Buttler both bowled the Indian bowlers. The team was doing this from the first over of the second innings. Both did not lose their wickets till the end. England chased […]","content":"Adelaide: In the ongoing T20 World Cup series, the England team has advanced to the final after defeating India. The team’s openers Alex Hales and Buttler both bowled the Indian bowlers. The team was doing this from the first over of the second innings. Both did not lose their wickets till the end. England chased down the target of 169 runs. It is noteworthy that the team that won the toss chose bowling in this match. Buttler hit three boundaries in the first over bowled by Indian bowler Bhuvneshwar Kumar. From there, Alex Hales turned the action to his own side. Hales scored 86 off 47 balls. Buttler scored 80 off 49 balls. The England team hit 13 fours and 10 sixes. At the end of 16 overs, the team scored 170 runs and crossed the target. With this, England will play the final against Pakistan on Sunday. Bhuvneshwar Kumar, Shami, Arshdeep Singh, Akshar Patel, Ashwin, Pandya could not take the wicket of England batsmen. England has registered a quality win by 10 wickets. Indian Innings: KL Rahul and captain Rohit Sharma were the openers for the Indian team in this match held at the Adelaide Cricket Ground. Rahul got out for just 5 runs. Rohit Sharma then put on a small partnership of 47 runs with Kohli. He was dismissed for 27 runs off 28 balls. Suryakumar Yadav who came next scored 14 runs in 10 balls and got out. After that, Hardik Pandya came to the field. India scored 100 runs for the loss of 3 wickets at the end of 15 overs. In the second ball of the 16th over, Virat Kohli was unable to play the ball thrown by Chris Jordan and fell on the field. However, he hit a boundary in the next ball. Besides, Kohli had reached a new milestone by crossing 4000 runs in T20 cricket. He was out after forming a partnership of 61 runs with Pandya. He had scored 50 runs in 40 balls. It included 4 fours and 1 six. Pandya smashed his half century in 29 balls. Rishabh Pant was run out for 6 runs. Pandya scored 63 runs off 33 balls and got out on the last ball of the first innings. It included 4 fours and 5 sixes. At the end of 20 overs, India scored 168 runs for the loss of 6 wickets.","pubDate":"2022-11-10 16:39:04","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"English players showed advantage of playing in BBL: Dravid","link":"https://www.orissapost.com/english-players-showed-advantage-of-playing-in-bbl-dravid/","keywords":["Sports","Rahul Dravid","T20 World cup"],"creator":["Post News Network"],"video_url":null,"description":"Adelaide: An extensive experience of playing the Big Bash League in Australia contributed to Jos Buttler and Alex Hales’ absolute dominance over India in the second T20 World Cup semifinal, said head coach Rahul Dravid Thursday. Buttler (80 not out) and Hales (86 not out) added 169 runs in just 16 overs to complete embarrass […]","content":"English players showed advantage of playing in BBL: Dravid PTI Updated: November 10th, 2022, 22:06 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Adelaide: An extensive experience of playing the Big Bash League in Australia contributed to Jos Buttler and Alex Hales’ absolute dominance over India in the second T20 World Cup semifinal, said head coach Rahul Dravid Thursday. Buttler (80 not out) and Hales (86 not out) added 169 runs in just 16 overs to complete embarrass India by 10 wickets in a high-profile semifinal. Hales has played the maximum amount of BBL among current English group, having donned the Melbourne Renegades and Sydney Thunder’s jerseys. “I mean, sure, there’s no doubt about it the fact that England — a lot of their players have come here and played. In this tournament, it certainly showed. It’s tough,” Dravid admitted that the winners had an advantage. Buttler has also played for the Thunders and both the England openers have plied their trade against local team Adelaide Strikers at this very ground here. The BCCI doesn’t allow any active Indian cricketer to play in overseas T20 leagues. “I think it’s very difficult for Indian cricket because a lot of these tournaments happen right in the peak of our season,” said Dravid when asked if playing in the BBL would benefit the Indians. “I think it’s a huge challenge for us. Yes, I think a lot of our boys maybe do miss out on the opportunities of playing in a lot of these leagues, but if you were to — it’s really up to the BCCI to make that decision,” he landed the ball on parent body’s court. The BBL is held right at the time of Ranji Trophy and hence there is no chance that any Indian youngsters will get a chance to play. Giving players a chance to play other leagues will finish India’s domestic tourneys. “The thing is it’s (BBL) right in the middle of our season, and with the kind of demand there would be for Indian players, if you allowed all of them to play in these leagues, we would not have a domestic cricket,” he said. “Our domestic trophy, our Ranji trophy would be finished, and that would mean Test cricket would be finished,” Dravid said. The BCCI would face a catch-22 situation if they open the doors for its players to ply their trade in foreign leagues. “I know a lot of people talk about it, but we have to be very careful when we — we have to understand the challenges that Indian cricket faces or the BCCI would face in a situation like this.” If Indian players are allowed in other leagues, Dravid feels Indian cricket will become like West Indies, which is struggling to keep the Test format afloat. “You’d see all our boys — like a lot of boys being asked to play leagues right bang in the middle of our season. We’ve seen what that’s done to West Indian cricket, and I would definitely not want Indian cricket to go that way. “It would certainly affect our Ranji trophy; it would affect Test cricket. Indian boys playing Test cricket is pretty important for the Test game, as well, I would think,” he added. We were 20 runs short in Powerplay overs ========================== Dravid agreed that on the day, the team wasn’t good enough against England. “Over the last year, we have played some good T20 cricket. Even in this tournament, I think we’ve had our moments. But on the day we were just not good enough here,” he said. For Dravid, the loss in another knockout game is “disappointing but not a debacle”. “Yeah, it’s disappointing. Debacle I’m not sure is the right word, but disappointing certainly.” The coach was the first one to admit that they fell short of par score by posting 168 for six. “Maybe when the game started, the boys were saying it was a little bit tacky, it was a little bit slower. Having said that, they bowled really well. “I thought they were really good up front. They hit really good lengths, didn’t really let us get away. We felt at that 15-over mark we felt we were probably 15-20 short, and we really had a good last five overs,” he said. No swing for Bhuvi, Arshdeep ================== The new ball didn’t swing for both Bhuvneshwar Kumar and Arshdeep Singh and that was one major reason for India’s heavy defeat. “The ball didn’t swing here probably as much as it has in other parts of Australia or in other conditions. Played a little bit into their hands, and class players like that, both Buttler and Hales, I thought their partnership was fantastic. “I think they just put the pressure on us, never let that go, and even when our spinners came on a wicket that we thought we might be able to control the game,” he reasoned. PTI Tags: Rahul Dravid T20 World cup Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Devastated, gutted, hurt: Pandya after T20 World Cup exit November 10, 2022 Indian women’s team to play tri-series in SA ahead of next year’s T20 WC November 10, 2022 England crush India by 10 wickets, set up T20 World Cup final against Pakistan November 10, 2022 India set England 169 to win in second semi-final November 10, 2022 “Always rub salt into the wound”: Qatar Airways CEO to World Cup critics November 10, 2022 England opt to bowl against India in second semi-final November 10, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-11-10 16:36:40","image_url":"https://www.orissapost.com/wp-content/uploads/2022/01/Rahul-Dravid-300x214.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: Yuzvendra Chahal should have been first-choice spinner, says Harbhajan after India's loss to England","link":"http://www.firstpost.com/firstcricket/sports-news/t20-world-cup-yuzvendra-chahal-should-have-been-first-choice-spinner-says-harbhajan-after-indias-loss-to-england-11607251.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup: Yuzvendra Chahal should have been first-choice spinner, says Harbhajan after India's loss to England","content":"Cricket T20 World Cup: Yuzvendra Chahal should have been first-choice spinner, says Harbhajan after India's loss to England Harbhajan Singh also criticised India's batting in the first 10 overs saying they played it like an ODI match. FirstCricket Staff November 10th, 2022 21:39:55 IST R Ashwin (left) with Yuzvendra Chahal in a file photo. AP Following India’s exit in the semifinals of the T20 World Cup with a lopsided 10-wicket loss to England in Adelaide on Thursday, cricketer-turn commentator Harbhajan Singh questioned why Yuzvendra Chahal didn’t feature in any of the matches at all, crucially against England, who have often struggled against spin. T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | Photos Rohit Sharma remained persistent with R Ashwin and Axar Patel as spinners for the tournament. Ashwin picked six wickets while Patel scalped three. On Thursday in particular, the duo failed to pick wickets with Ashwin giving 27 runs in two overs while Patel was ineffective with 30 runs in four overs. “I don’t know what are the reasons that a champion bowler (Yuzvendra Chahal) is not in the team. He must have done something to someone that he is not getting a game. With his credentials he should have been your first-choice spinner,” Harbhajan said on an India Today show. Congratulations Jos the Boss @josbuttler and @ECB_cricket for getting into the finals of T20 World Cup .. incredible batting @AlexHales1 pic.twitter.com/FHgn7k8mNF — Harbhajan Turbanator (@harbhajan_singh) November 10, 2022 The 42-year-old retired off spinner was unhappy with India’s meek surrender in the game while questioning India’s batting strategy in the first 10 overs as just 62 runs came off it with Indian batting heavyweights Rohit Sharma and Virat Kohli struggling to score at a pace. “It is hurting, more because that we did not fight at all. India batted like ODI in first 10-12 overs like they still had 40 more overs to play. India should learn this format from England. They played like champions. It is very disappointing to see India’s approach throughout the tournament where they did not look like they would score more than 35 runs,” he said. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 10, 2022 21:39:55 IST Tags: Cricket Harbhajan Singh India Vs England T20 World Cup Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-10 16:09:55","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/R-Ashwin-Yuzvendra-Chahal.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"From losing vs India to beating NZ in semis, how Pakistan fans have connected 1992 and 2022 campaigns","link":"https://www.firstpost.com/firstcricket/sports-news/from-losing-vs-india-to-beating-nz-in-semis-how-pakistan-fans-have-connected-1992-and-2022-campaigns-11604151.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"From losing vs India to beating NZ in semis, how Pakistan fans have connected 1992 and 2022 campaigns","content":"Pakistan continued their fairytale run in the 2022 T20 World Cup with an emphatic victory over New Zealand in the semi-final in Sydney on Thursday.The Men in Green are considered one of the most unpredictable teams in the sport and they well and truly lived up to that billing in the first-ever T20 World Cup hosted in Australia.A team that was staring at an early flight back home after back-to-back defeats earlier in the tournament would produce a miraculous comeback from out of nowhere and, aided by external factors, progress into the knockouts.With the momentum firmly in their favour, they landed a knockout blow on the Black Caps, a team that had finished runners-up last year and entered the tournament final as one of the strong title favourites.One could go to the extent of saying that Babar Azam’s men played like ‘Cornered Tigers’ in this tournament, much like the one Imran Khan led three decades back on this very soil in their only victorious 50-over World Cup campaign.Pakistan fans, in fact, have been busy drawing comparisons between the 1992 and the 2022 campaigns, hoping Babar lifts the trophy much like future Pakistan Prime Minister Khan did back then.We take a look at some of those comparisons below:Losing their first match at the MCGPakistan began their 1992 campaign with a 10-wicket loss against West Indies in a game where only two wickets had fallen in a little over 96 overs of play as opening batter Ramiz Raja’s unbeaten 102 went in vain. Pakistan posted 220/2 on the board, but their bowling unit would fail to come up with solutions as Desmond Haynes (93 not out) and Brian Lara (88 retired hurt) made merry at the Melbourne Cricket Ground.Three decades later, Pakistan would begin their T20 World Cup campaign with a defeat at the ‘G’, albeit against arch-rivals India.Losing against IndiaIndia and Pakistan had never faced each other in a World Cup before the 1992 event. And at the Sydney Cricket Ground, India would come out victorious by 43 runs in a game widely remembered for Javed Miandad’s little chat with Kiran More followed by his jumping antics. India’s victory would also mark the beginning of Pakistan’s jinx against their neighbours, as they would not beat the Men in Blue in an ODI or T20I World Cup until Dubai 2021.Much like 1992, Pakistan lost against India in the 2022 edition as well, thanks to a miraculous knock from Virat Kohli in Melbourne.Similarities between WC 1992 & T20 WC 2022:1. Australia were the defending champions after winning their 1st title (ODI & T20Is) 2. Australia were the hosts 3. Pakistan lost to India in group stages 4. Australia were eliminated in group stages 5. Pakistan beat NZ in SFs— Sarang Bhalerao (@bhaleraosarang) November 9, 2022 Facing an early flight back homeAfter their 10-wicket loss against West Indies in 1992, Pakistan fought back with a 53-run win against Zimbabwe but were staring at the barrel again after suffering back-to-back losses against India and South Africa. And it could very well have been three defeats in a row had the match against England, in which they were bowled out for 74 batting first, not rained off.Fast forward to 2022, and Pakistani fans were being subjected to “Qualified for Karachi” memes after their team lost to India and Zimbabwe in their first two outings of the campaign.Winning three matches on the trot to qualify for the knockoutsIn 1992, they had beaten tournament hosts Australia in a decisive game by 48 runs to get their campaign back on track before registering victories against Sri Lanka and New Zealand, finishing a point ahead of Australia and West Indies.In 2022, Pakistan would collect their first points with a win against the Netherlands, before well and truly igniting their knockout hopes with a comprehensive win against South Africa.It was ultimately on the final day when the Netherlands shocked the Proteas and they beat Bangladesh, that they officially qualified.Beating New Zealand in the semisPakistan might have a miserable record against India across World Cups, but they certainly have the edge over New Zealand, especially in the semi-finals. After beating New Zealand in their final round-robin match in 1992, they would face the Black Caps again just three days later, where Inzamam-ul-Haq produced the knock of a lifetime (60 off 37) to set up a four-wicket win in a 264-run chase.Pak’s chances of qualifying (let alone winning the comp) stood at 3% when they were 43 for 4 v SA, requiring to win that game, Ned beat SA & Pak beat Ban. Less than a week later they’re in the final & have won four in a row. I believe I should say ‘Qudrat ka Nizzam’. #T20WorldCup— Freddie Wilde (@fwildecricket) November 9, 2022 The Pakistani victory was even more one-sided three decades later, this time the Pakistanis strolling to a seven-wicket win against the Kiwis in Sydney, thanks to a solid opening partnership between skipper Babar Azam and wicketkeeper Mohammad Rizwan.Facing England in the finalEngland’s commanding 10-wicket victory over India in the second semi-final of the 2022 T20 World Cup in Adelaide threw up yet another similarity — that of a Pakistan-England final at the Melbourne Cricket Ground.Openers Alex Hales and Jos Buttler made mincemeat of a hapless Indian bowling unit, chasing the 169-run target down without ever breaking a sweat to confirm the side’s second T20 World Cup final in three editions.England’s journey to the 1992 World Cup final, however, was as easy as they would collect a 19-run win against South Africa in a game that is widely remembered for the Duckworth-Lewis fiasco in a rain-marred game in Sydney, with Ian Botham’s side winning by 19 runs.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-10 15:33:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Pakistan-lap-of-honour-New-Zealand-T20-World-Cup-semifinal-AP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup: 'How many series did Rohit Sharma play this year?' asks Ajay Jadeja after Adelaide debacle","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-how-many-series-did-rohit-sharma-play-this-year-asks-ajay-jadeja-after-adelaide-debacle-11607161.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup: 'How many series did Rohit Sharma play this year?' asks Ajay Jadeja after Adelaide debacle","content":"India’s T20 World Cup ended in a disaster on Thursday when England handed the Men in Blue a 10-wicket drubbing in Adelaide in a lopsided encounter. Following the loss, former Indian cricketer Ajay Jadeja, who once served as the team’s vice-captain, felt that India’s captain Rohit Sharma was at fault for not spending enough time with the team.T20 World Cup Home | Schedule | Results | Points Table | T20 World Cup News | PhotosRohit Sharma also had a miserable World Cup as he shot just one fifty in the tournament (against Zimbabwe) and aggregated 116 runs at an average of just 19.33.“Main ek baat bolunga jo chubhegi agar Rohit Sharma sunenge (I would say one thing which might hurt Rohit Sharma. If you have to make a team as captain, you have to stick with the side for the entire year,” Jadeja said on Cricbuzz. “How many series did Rohit Sharma play this year? I’m not saying this in hindsight, I’ve been saying this since before. Even in New Zealand, the coach isn’t travelling.”#TeamIndia put up a fight but it was England who won the match.We had a solid run till the semifinal & enjoyed a solid support from the fans.Scorecard ▶️ https://t.co/5t1NQ2iUeJ #T20WorldCup | #INDvENG pic.twitter.com/5qPAiu8LcL— BCCI (@BCCI) November 10, 2022Jadeja further took a shot at India’s recent decision to play multiple captains during the year as India played Hardik Pandya, Rishabh Pant, and Shikhar Dhawan among others as captains on multiple tours.“Ghar ka ek hi buzurg hona chahiye, saat buzurg honge toh bhi dikkat hai. (There should only be one leader in the team. If there are 7, it would be difficult).” the former India player said further.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-11-10 15:32:47","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/Rohit-Sharma-1-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: Mamelodi Sundowns’ Rhulani Mokwena bats for beleaguered Proteas captain Temba Bavuma","link":"https://www.iol.co.za/sport/cricket/proteas/watch-mamelodi-sundowns-rhulani-mokwena-bats-for-beleaguered-proteas-captain-temba-bavuma-6e448301-3fef-4f6b-87b3-1d713e95fce2","keywords":null,"creator":["Smiso Msomi"],"video_url":null,"description":"Mamelodi Sundowns head coach Rhulani Mokwena believes the media and cricket fans are being too harsh on Proteas captain Temba Bavuma.","content":null,"pubDate":"2022-11-10 15:10:18","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/a4a7d63c-02e3-5f50-ab28-e0cf57278d3d&operation=CROP&offset=0x90&resize=4498x2528","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Highlights | IND vs ENG 2nd T20 Semi-final Scorecard, ENG 170-0: England do a Pakistan on India, win - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMipAFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2NyaWNrZXQvbGl2ZS11cGRhdGVzL2hpZ2hsaWdodHMtaW5kLXZzLWVuZy0ybmQtdDIwLXNlbWktZmluYWwtc2NvcmVjYXJkLWVuZy0xNzAtMC1lbmdsYW5kLWRvLWEtcGFraXN0YW4tb24taW5kaWEtd2luLWJ5LTEwLXdpY2tldHMtMjUzMjg4NdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights | IND vs ENG 2nd T20 Semi-final Scorecard, ENG 170-0: England do a Pakistan on India, win  Zee NewsLive match blog - India vs England 2nd Semi-Final 2022/23 - Cricket Insights  ESPNcricinfoIndia Vs England Live Match Today | India Vs England Semi Final | T20 World Cup Live | News18 Live  CNN-News18Jay Bhanushali reacts to India's semi-final loss with funny video about bowlers  Hindustan TimesIndia vs England, T20 World Cup 2022: Hales and Buttler hammer IND at Adelaide by 10 wickets  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-11-10 14:59:17","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"‘India did not deserve to meet us in MCG….Indian cricket is at the lowest right now’: Shoaib Akhtar post England’s 10 wicket win","link":"https://indianexpress.com/article/sports/cricket/india-did-not-deserve-to-meet-us-in-mcg-indian-cricket-is-at-the-lowest-right-now-shoaib-akhtar-post-englands-10-wicket-win-8261465/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-11-10 14:49:11","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC 2022: सेमीफाइनल हारने के बाद भारतीय टीम का जमकर उड़ा मजाक, सोशल मीडिया पर आई मीम्स की बाढ़","link":"https://www.abplive.com/sports/cricket/t20-world-cup-2022-memes-and-reactions-after-india-vs-england-match-2256646","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"India vs England Memes: टी20 वर्ल्ड कप 2022 में इंग्लैंड के खिलाफ भारतीय टीम की करारी हार के बाद सोशल मीडिया पर मीम्स की बाढ़ आ गई है. भारतीय टीम की हार के बाद सोशल मीडिया पर लोग तरह-तरह से अपने रिएक्शन दे रहे हैं और इस दौरान कई ऐसे मजाकिया ट्वीट देखने को मिले हैं जिन्हें देखने के बाद आप अपनी हंसी नहीं रोक पाएंगे. जैसे ही भारत को इंग्लैंड के खिलाफ हार मिली उसके तुरंत बाद ही सोशल मीडिया पर जमकर हलचल देखने को मिली. खासतौर से पाकिस्तानी क्रिकेट फैंस ने भारतीय टीम का जमकर मजाक उड़ाया है. दरअसल जब पाकिस्तान की टीम सुपर-12 से ही बाहर होने की कगार पर थी तब उनके खूब मौज लिए गए थे और अब उसी के जवाब में भारतीय टीम को सोशल मीडिया पर ये जलालत झेलनी पड़ रही है. Yeh Rishi Sunak ka gussa humpe kyu nikal rahe hai — Tanmay Bhat (@thetanmay) November 10, 2022 Hello Babar? Ye final mei kese attay hain? #INDvsENG pic.twitter.com/toaV8loyV1 — Ihtisham Ul Haq (@iihtishamm) November 10, 2022 India Pak final could have been bigger but …….. Tweeting from Lahore @WasimJaffer14 #INDvsENG #T20Iworldcup2022 pic.twitter.com/V1lWxgHBam — Imran Nazir (@realimrannazir4) November 10, 2022 Indian Cricket Team is Biggest #chokers World Cricket. #INDvsENG #INDvENG pic.twitter.com/QA1j7gbOlK — Vishwajit Patil (@_VishwajitPatil) November 10, 2022 Boycott IPL so that the Indian Team can focus on international cricket. #BoycottIPL #BCCI pic.twitter.com/YJQiPZqJuY — ɅMɅN DUВΞY (@imAmanDubey) November 10, 2022 इंग्लिश ओपनर्स ने जमकर की भारतीय गेंदबाजों की धुलाई इंग्लैंड के खिलाफ मुकाबले में भारत ने पहले बल्लेबाजी करते हुए 168 रनों का स्कोर बनाया था. हार्दिक पांड्या ने भारत के लिए 33 गेंदों में 63 रनों की धुआंधार पारी खेली थी. यदि हार्दिक की पारी को हटा दिया जाए तो भारतीय टीम एक अच्छे स्कोर तक पहुंचने के लिए काफी संघर्ष कर रही थी. अंतिम पांच ओवरों में हार्दिक ने धुआंधार बल्लेबाजी की और भारत को एक ऐसे स्कोर तक पहुंचाया था जहां से उनके मैच जीतने की संभावनाएं दिख रही थी.  हालांकि इंग्लैंड के बल्लेबाजों ने बिना कोई गलती करते हुए केवल 16 ओवरों में ही मैच समाप्त कर दिया और भारत को करारी हार दी. इंग्लैंड के लिए ओपनर बल्लेबाजों एलेक्स हेल्स और जोस बटलर ने ताबड़तोड़ अंदाज में बल्लेबाजी की. यह भी पढ़ें: IND vs ENG: खराब कप्तानी की वजह से टीम इंडिया को सेमीफाइनल में करना पड़ा हार का सामना? मैच में हुई ये गलतियां","content":"India vs England Memes: टी20 वर्ल्ड कप 2022 में इंग्लैंड के खिलाफ भारतीय टीम की करारी हार के बाद सोशल मीडिया पर मीम्स की बाढ़ आ गई है. भारतीय टीम की हार के बाद सोशल मीडिया पर लोग तरह-तरह से अपने रिएक्शन दे रहे हैं और इस दौरान कई ऐसे मजाकिया ट्वीट देखने को मिले हैं जिन्हें देखने के बाद आप अपनी हंसी नहीं रोक पाएंगे. जैसे ही भारत को इंग्लैंड के खिलाफ हार मिली उसके तुरंत बाद ही सोशल मीडिया पर जमकर हलचल देखने को मिली. खासतौर से पाकिस्तानी क्रिकेट फैंस ने भारतीय टीम का जमकर मजाक उड़ाया है. दरअसल जब पाकिस्तान की टीम सुपर-12 से ही बाहर होने की कगार पर थी तब उनके खूब मौज लिए गए थे और अब उसी के जवाब में भारतीय टीम को सोशल मीडिया पर ये जलालत झेलनी पड़ रही है. Yeh Rishi Sunak ka gussa humpe kyu nikal rahe hai — Tanmay Bhat (@thetanmay) November 10, 2022 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); News Reels Hello Babar? Ye final mei kese attay hain? #INDvsENG pic.twitter.com/toaV8loyV1 — Ihtisham Ul Haq (@iihtishamm) November 10, 2022 India Pak final could have been bigger but …….. Tweeting from Lahore @WasimJaffer14 #INDvsENG #T20Iworldcup2022 pic.twitter.com/V1lWxgHBam — Imran Nazir (@realimrannazir4) November 10, 2022 Indian Cricket Team is Biggest #chokers World Cricket. #INDvsENG #INDvENG pic.twitter.com/QA1j7gbOlK — Vishwajit Patil (@_VishwajitPatil) November 10, 2022 Boycott IPL so that the Indian Team can focus on international cricket. #BoycottIPL #BCCI pic.twitter.com/YJQiPZqJuY — ɅMɅN DUВΞY (@imAmanDubey) November 10, 2022 इंग्लिश ओपनर्स ने जमकर की भारतीय गेंदबाजों की धुलाई इंग्लैंड के खिलाफ मुकाबले में भारत ने पहले बल्लेबाजी करते हुए 168 रनों का स्कोर बनाया था. हार्दिक पांड्या ने भारत के लिए 33 गेंदों में 63 रनों की धुआंधार पारी खेली थी. यदि हार्दिक की पारी को हटा दिया जाए तो भारतीय टीम एक अच्छे स्कोर तक पहुंचने के लिए काफी संघर्ष कर रही थी. अंतिम पांच ओवरों में हार्दिक ने धुआंधार बल्लेबाजी की और भारत को एक ऐसे स्कोर तक पहुंचाया था जहां से उनके मैच जीतने की संभावनाएं दिख रही थी. हालांकि इंग्लैंड के बल्लेबाजों ने बिना कोई गलती करते हुए केवल 16 ओवरों में ही मैच समाप्त कर दिया और भारत को करारी हार दी. इंग्लैंड के लिए ओपनर बल्लेबाजों एलेक्स हेल्स और जोस बटलर ने ताबड़तोड़ अंदाज में बल्लेबाजी की. यह भी पढ़ें: IND vs ENG: खराब कप्तानी की वजह से टीम इंडिया को सेमीफाइनल में करना पड़ा हार का सामना? मैच में हुई ये गलतियां var _fireSc=!0;document.addEventListener(\"scroll\",(e=>{if(_fireSc){var c=document.createElement(\"script\");c.src=\"//asset.fwpub1.com/js/embed-feed.js\",c.async=!0,document.getElementsByTagName(\"head\")[0].appendChild(c),_fireSc=!1}}));","pubDate":"2022-11-10 14:30:59","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"'This Sunday, it’s: 152/0 vs 170/0': Pakistan PM Shehbaz Sharif takes a dig at India's semi-final loss against England","link":"https://www.firstpost.com/firstcricket/sports-news/this-sunday-its-152-0-vs-170-0-pakistan-pm-shehbaz-sharif-takes-a-dig-at-indias-semi-final-loss-against-england-11606651.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"'This Sunday, it’s: 152/0 vs 170/0': Pakistan PM Shehbaz Sharif takes a dig at India's semi-final loss against England","content":"Cricket 'This Sunday, it’s: 152/0 vs 170/0': Pakistan PM Shehbaz Sharif takes a dig at India's semi-final loss against England India suffered a defeat in the semi-final against England in the T20 World Cup 2022 as Alex Hales and Jos Buttler chased the target with utmost ease. FirstCricket Staff November 10th, 2022 20:00:34 IST India lost to England in the semi-final. AP Pakistan PM Shehbaz Sharif took a dig at India’s semi-final loss to England in the T20 World Cup 2022 on Thursday. The Rohit Sharma-led side bowed out of the tournament after losing to England in the semis as the English side chased down a target of 169 runs with no casualties and four overs to spare. During the last edition of the T20 World Cup, Pakistan had thumped India by 10 wickets, chasing a target of 152 runs. This was also Pakistan’s first win in a World Cup fixture against India. Mentioning the same, Sharif tweeted, “So, this Sunday, it’s: 152/0 vs 170/0 #T20WorldCup”. So, this Sunday, it’s: 152/0 vs 170/0 🇵🇰 🇬🇧 #T20WorldCup — Shehbaz Sharif (@CMShehbaz) November 10, 2022 The Babar Azam-led side reached the final after beating New Zealand in the semi-final and will now take on England in the title clash on Sunday in Melbourne. Talking about the encounter between India and England, Jos Buttler and Alex Hales thoroughly dominated the Indian batting unit and chased down the target with four overs to spare. Earlier, India rode on some fine batting from Virat Kohli and a late surge from Hardik Pandya to put 168/6 in 20 overs, but they felt 20 runs short of a par score. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 10, 2022 20:00:34 IST Tags: Cricket T20 World Cup T20 World Cup England T20 World Cup India Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-10 14:30:34","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/England-PM-Shariff.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup India vs England: Buttler and Hales show, India’s toothless bowling and more taking points","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-india-vs-england-buttler-and-hales-show-indias-toothless-bowling-and-more-taking-points-11606881.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup India vs England: Buttler and Hales show, India’s toothless bowling and more taking points","content":"Cricket T20 World Cup India vs England: Buttler and Hales show, India’s toothless bowling and more taking points England decimated India by 10 wickets in a 169-run chase as Jos Buttler and Alex Hales tore into the already weak Indian bowling lineup. FirstCricket Staff November 10th, 2022 19:55:43 IST Jos Buttler and Alex Hales stitched the highest partnership in T20 World Cups. AP Another ICC event knockout match ended on the wrong side for India as they lost to England by 10 wickets at the Adelaide Oval and put a full stop to the 2022 T20 World Cup campaign. While India looked average throughout the semi-final, England looked at their precarious best and decimated the Indian bowling lineup winning the match by 10 wickets . T20 World Cup: Full coverage | Schedule | Results | Points Table | News | Photos Virat Kohli and Hardik Pandya ensured India posted a reasonable total of 168/6 after 20 overs, but India fell 20 runs short of a defendable total as the second innings proved. India could not create even half chances to dismiss Jos Buttler or Alex Hales and the duo smashed individual half-centuries while chasing the target in 16 overs. While England can talk about this all day, Indians will find it hard to talk about it. But we have some important talking points from the match. Read: India fall short in planning, execution, and courage against England in the semi-final Jos Buttler-Alex Hales partnership The English openers came to the stage at the perfect time and played one of the most perfect innings of their life as they not only decimated the Indian bowlers but were clinical with their power hitting and placements. View this post on Instagram A post shared by ICC (@icc) Each and every shot was played in gaps and no chances were given to the Indian fielders to catch or inculcate a runout. Interestingly, no DRS was required in the second innings either. Jos Buttler started with a flurry of boundaries in the first over, and Alex Hales took over the mettle subsequently as Buttler played the second fiddle. Once India seemed out of the contest, Buttler as well pulled his gun out of the cover and smashed the Indian bowlers for some mighty sixes including a 100-metre six to Mohammad Shami. The duo stitched a 170-run partnership with Buttler scoring 80 from 49 deliveries (nine 4s, three 6s) and Hales contributing 86 from 47 balls (four 4s, seven 6s). India’s weak bowling lineup exposed On the contrary, the Indian bowlers were no match for England’s opening pair. Bhuvneshwar Kumar was hit for three boundaries in the first over, and probably that set the tone for England. England took only three overs to match India’s powerplay score and Rohit Sharma introduced Axar Patel in the powerplay, something he has not done often. India’s bowling was exposed against Bangladesh as well, but they were somehow able to recover against an emotional opposition. But England was thoroughly professional. 4 overs to spare! 🤯 — England Cricket (@englandcricket) November 10, 2022 India couldn’t create any chances for wickets and the English openers were allowed to finish the game as early as 24 deliveries. Rohit Sharma’s bowling changes as well seemed a bit lusterless as Shami was brought back in the 14 th over after he bowled his first over inside the powerplay. But by that time, the damage had already been done with England just 29 runs short of victory. Only Arshdeep Singh and Axar Patel had an economy rate of less than 10 – 7.5 runs per over each. It seemed like India’s already weak bowling was exposed at an important juncture in the tournament. Hardik Pandya’s innings at the death If India can take heart from anything in the semi-final, it would be Hardik Pandya’s blistering half-century in the death overs. Hardik came to the crease in the 12 th over and scored at less than run-a-ball in the initial phase. But once he got settled, he tore into the England death bowling and scored 63 runs from 33 deliveries with four boundaries and five maximums. Hardik’s late carnage helped India to score 47 runs in the last three overs and took the total beyond 160s, which looked to be settling around 150s at the 15 th over mark. Virat Kohli’s return to imperious form Virat Kohli was, alongside Suryakumar Yadav, the only Indian batter at his imperious best throughout the World Cup. He once again took the charge of the innings with a fine half-century when the other end was not supportive of him. But he is used to it, and probably the team tends to misuse it, quite too often. Kohli’s 50 came at 40 balls and might seem like he could have been better with his strike rate, but this is how Kohli is known to build his innings and tear into the bowling at the death overs. Albeit, he couldn’t against England. However, he has returned to his previous best, it seems at the moment, and India’s run machine might add a few more stars to his name in the coming time. One of the stars added against England was the 4,000 run mark in T20Is – the first batter to achieve this feat. But the Indian batting lineup has to ensure to reduce the burden on him and take the onus in future matches. Indian openers’ poor form One of the prime reasons that Kohli has to face the heat of the burden is the poor form India’s openers went through in the T20 World Cup. Rohit hit only one half-century – against the Netherlands, whereas KL Rahul hit two – against Bangladesh and Zimbabwe. It would safe to conclude that they failed to play to their strengths against decent bowling line-ups and if not for Virat Kohli and Suryakumar Yadav, India would have been eliminated at the group stage itself. Right in the feels. pic.twitter.com/fomESPYnr3 — England Cricket (@englandcricket) November 10, 2022 There will be severe scrutiny against the duo, despite them being at the helm of affairs, and rightly so. More so with a lot of young openers in the pipeline in the domestic circuit, it is going to be difficult to justify the places of the openers after a below-par performance at the ICC event. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: November 10, 2022 19:55:43 IST Tags: Cricket India Vs England T20 World Cup T20 World Cup England Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-11-10 14:25:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/11/England-vs-India.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Enoch Nkwe keeps eye on the future as Cricket SA tries to show accountability for latest Proteas failure","link":"https://www.iol.co.za/sport/cricket/proteas/enoch-nkwe-keeps-eye-on-the-future-as-cricket-sa-tries-to-show-accountability-for-latest-proteas-failure-7fb57b24-c90a-4381-b196-61eb09d30ade","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Enoch Nkwe believes that the best way that CSA can show accountability for the Proteas’ latest World Cup failure is to have better mechanisms in place ahead of future ICC events.","content":null,"pubDate":"2022-11-10 14:02:58","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/da4126f4-1d0f-5333-b62c-4ff7611bc7f6&operation=CROP&offset=0x250&resize=2742x1541","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Ajay Jadeja's \"7 Buzurg\" Taunt At Indian Team After Semi-Final Defeat To England | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90MjAtd29ybGQtY3VwLTIwMjIvYWpheS1qYWRlamFzLTctYnV6dXJnLXRhdW50LWF0LWluZGlhbi10ZWFtLWFmdGVyLXNlbWktZmluYWwtZGVmZWF0LXRvLWVuZ2xhbmQtMzUwODQ5NtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ajay Jadeja's \"7 Buzurg\" Taunt At Indian Team After Semi-Final Defeat To England | Cricket News  NDTV SportsRohit Sharma: We just didn't turn up with the ball  ESPNcricinfoIndia weighing up wicketkeeper decision for England semi  ReutersWatch: Rohit Sharma Cries In Dugout After India's Semi-Final Defeat vs England, Video Goes Viral  NDTV SportsWatch: Dravid consoles teary-eyed Rohit in heartbreaking scenes after India loss  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-11-10 13:44:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"You can’t teach anyone to handle pressure: Rohit Sharma","link":"https://www.tribuneindia.com/news/sports/you-cant-teach-anyone-to-handle-pressure-rohit-sharma-449636","keywords":null,"creator":null,"video_url":null,"description":"Adelaide, November 10India skipper Rohit Sharma on Thursday said that his players crumbled under pressure in a high-stakes T20 World Cup semifinal against England.He blamed their insipid bowling performance for the humiliating 10-wicket loss.Defending 169, Indian bowlers cut a sorry figure as England openers Alex Hales and Jos Buttler made a mockery of the chase, completing the task with four overs to spare.\"Pretty disappointed how it turned out today. We batted well at the back end to get that score. We were not up to the mark with the ball. It was definitely not a wicket where a team can come and chase it down in 16 overs. With the ball we couldn't turn up today,\" Rohit said at the post-match presentation.\"When it comes to knockout stages, it's all about handling the pressure. Depends on the individual as well. You can't teach anyone to handle pressure. When these guys play the playoffs in the IPL and all that, those are high-pressure games, and they're able to handle it.\"The way we started with the ball was not ideal. We were a little nervy.\" Hales and Buttler didn't put a foot wrong and the India skipper praised the English openers for their flawless knock.\"You got to give credit to their openers, they played really well. I thought it swung a bit in the first over, but not from the right areas. We know the runs are scored square of the wicket, we were aware about it.\"When we won the first game, it showed a lot of character. The game against Bangladesh, it was a tricky one. I thought we held our nerve and kept executing our plans. Couldn't do that today.\" England skipper Jos Buttler lauded the team for scripting a remarkable turnaround after the shocking loss to Ireland early in the tournament.\"The character we have shown since then (England's loss against Ireland) - it has been amazing. We came here very excited, there was a very good feeling,\" he said.\"Everyone from 1 to 11 - stood up today. We always want to start fast and aggressive. Rashid was batting at 11, that's incredible to know that we have such depth.\" Buttler, who had the best view as Hales went hammer and tongs, praised his opening partner for his breathtaking knock. \"Hales used the dimensions well and he has shown his form. He was brilliant today. It's important to enjoy this, it was a brilliant performance from us,\" he said.Chris Jordon did most of the damage, returning with 3 for 43 after coming into the semifinals as a replacement for an injured Mark Wood.\"We need to give special credit to Jordan, to bowl three overs at the death coming into the semi-final, it was a tough job. He handled the pressure towards the end pretty well, especially bowling against a world class player like Hardik Pandya,\" Buttler said.Hales, who was adjudged the Player of the Match, for his scintillating 47-ball knock, said it was a \"special knock\" and the \"best night of his career\" as he never expected to play in another World Cup.\"It will be right up there for sure (referring to a perfect innings). Huge occasion, India in a semifinal of a World Cup, really happy with the way I played and it is as special as it gets,\" said Hales, who hit four boundaries and as many as seven sixes.\"This is one of the best grounds to bat in especially in the powerplay, a really good surface and great value for good cricket shots, this is a ground I have good memories of and enjoy batting here.\" Hales had joined the England team for this World Cup after a three-year exile following his failed recreational drug test in 2019.\"I never thought I would play in a World Cup again, so to get the chance is a very special feeling, in a country (Australia) that I love and spend a lot of time in, tonight is one of the best night's of my career.\"","content":null,"pubDate":"2022-11-10 13:41:45","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1708902064.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Indian skipper Rohit Sharma almost breaks down in dugout after England shatter India’s T20 World Cup dream in semi-final","link":"https://www.tribuneindia.com/news/trending/watch-indian-skipper-rohit-sharma-almost-breaks-down-in-dugout-after-england-shatter-indias-t20-world-cup-dream-in-semi-final-449634","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, November 10The high-octane T20 World Cup semi-final ended up in disappointment for Men in Blue's fans after England thrashed India by 10 wickets at the Adelaide Oval. The widespread despair over the shattering of big World Cup dream has become quite prevalent across cricket fans in India.A video has been doing the rounds on social media where Indian skipper Rohit Sharma could be seen getting emotional in the dugout. Rohit's emotional outburst was so profound that head coach Rahul Dravid came up to him to console. Twitterati too found the video heart-breaking and extended their support to the captain. Rohit crying 😭💔.This hurts me as a fan🥺😭#INDvENG @ImRo45 #ind #WCT20 #SemiFinals #SemiFinalT20WC pic.twitter.com/5BjnGITLx5— Dboss dada cult 👊🏻𝐊𝐫𝐚𝐧𝐭𝐢 𝐨𝐧 𝐣𝐚𝐧𝟐𝟔 (@Darshancult45) November 10, 2022This is my worst day of the decade. My hero is crying 😭💔 @ImRo45 . pic.twitter.com/rXOsbQxADx— Vishal. (@SportyVishal) November 10, 2022Rohit Sharma is crying in the dugout after the game.#INDvENG #T20WorldCup pic.twitter.com/xyBoliGmjR— Neelabh (@CricNeelabh) November 10, 2022#RohitSharma𓃵 literally crying 💔💔@ImRo45 don't worry champ ! I am with you💙#T20WorldCup2022 #INDvsENG #TeamIndia pic.twitter.com/meksbEhewr— ROLEX - D (@Dharun_45) November 10, 2022Pain💔. My man is crying 🥲.@ImRo45 .#RohitSharma𓃵 pic.twitter.com/4NA7v7G6Ep— I STAN RO45 (@vins_tweetz) November 10, 2022He Is Crying. 😭💔@ImRo45 #RohitSharma𓃵 #T20WorldCup #INDvsENG pic.twitter.com/JKFAFvuixP— Ayush Tiwari_RS4️⃣5️⃣ (@Ayush_Tiwarii45) November 10, 2022","content":null,"pubDate":"2022-11-10 13:41:21","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1028384387.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 WC | KL Rahul who missed the opening – trolling fans","link":"https://thenewsglory.com/t20-wc-kl-rahul-who-missed-the-opening-trolling-fans/","keywords":["Sports","Cricket","India","KL Rahul","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Adelaide: Indian cricket team’s opener KL Rahul got out for just 5 runs in the semi-final against England in the ongoing T20 World Cup series. Frustrated fans have trolled him for his poor performance. England team has won and advanced to the final. In this series, he scored 4 runs against Pakistan, 9 runs against […]","content":"Adelaide: Indian cricket team’s opener KL Rahul got out for just 5 runs in the semi-final against England in the ongoing T20 World Cup series. Frustrated fans have trolled him for his poor performance. England team has won and advanced to the final. In this series, he scored 4 runs against Pakistan, 9 runs against Netherlands, 9 runs against South Africa, 50 runs against Bangladesh and 51 runs against Zimbabwe. He scored 5 against England in the semi-final. A total of 128 runs in 6 innings. The Indian team did not start well in this series. Rahul’s poor performance is also a reason for that.","pubDate":"2022-11-10 13:37:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Conservative India needs T20 reboot: Rohit, Rahul, Kohli misfits as Top 3 - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvY29uc2VydmF0aXZlLWluZGlhLW5lZWRzLXQyMC1yZWJvb3Qtcm9oaXQtcmFodWwta29obGktbWlzZml0cy1hcy10b3AtMy04MjYxMzcyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Conservative India needs T20 reboot: Rohit, Rahul, Kohli misfits as Top 3  The Indian ExpressPlayers Who Can Replace Rohit Sharma As India's T20I Captain After T20 World Cup 2022  ICC CRICKET SCHEDULENothing changed: Rohit Sharma-Rahul Dravid combo fails T20 World Cup 2022 challenge  India TodayIndia T20 WC Exit: Chetan Sharma set to lose his JOB after Adelaide mauling, CAC to appoint NEW Selection Committee, Follow LIVE  InsideSport3 players who could replace Rohit Sharma as Indian T20I captain after T20 World Cup 2022  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2022-11-10 13:31:06","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler reveals the big decisions that set up huge win over India - T20 World Cup","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LnQyMHdvcmxkY3VwLmNvbS9uZXdzLzI5MDEyNDnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler reveals the big decisions that set up huge win over India  T20 World CupIs India's Approach To T20 Cricket Outdated? Harbhajan Singh Shares His Views | India Vs England  India TodayHales and Buttler break records, Kohli passes 4000  ESPNcricinfoJos Buttler yearns for 'tangibles' to go with England's expansive playing style | Cricbuzz.com - Cricbuzz  CricbuzzPragyan Ojha Questions Rohit Sharma's Team Selection As Yuzvendra Chahal Gets Snubbed | Ind Vs Eng  India TodayView Full coverage on Google News","content":null,"pubDate":"2022-11-10 13:30:21","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}