{"newsArray":[{"title":"दो करारी हार, फिर पलटवार... 1983 वर्ल्ड कप में पहले मैच से फाइनल तक कैसा था टीम इंडिया का सफर","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/team-india-path-to-victory-in-1983-world-cup/articleshow/101251828.cms","keywords":null,"creator":null,"video_url":null,"description":"1983 World Cup: भारत ने 1983 वर्ल्ड कप का खिताब आज ही के दिन जीता था। कपिल देव की कप्तानी में भारतीय टीम एक समय टूर्नामेंट में मुश्किल स्थिति में थी। लगातार दो मैच में भारत को वेस्टइंडीज और ऑस्ट्रेलिया से हार मिली थी। लेकिन इसके बाद टीम ने पलटवार किया।","content":"40 साल पहले भारत ने आज ही के दिन नामुमकिन को मुमकिन कर दिया है। कपिल देव की कप्तानी में भारत ने वेस्टइंडीज को हराकर 1983 वर्ल्ड कप को अपने नाम किया था। 1983 से पहले 1975 और 1979 वर्ल्ड कप खेला गया था। इन दोनों टूर्नामेंट को मिलाकर भारत ने सिर्फ एक ही मैच जीता था। वहीं वेस्टइंडीज पहले दो वर्ल्ड कप की चैंपियन थी और तीसरे में भी जीत की प्रबल दावेदार। इसके बाद भी भारत ने सभी को चौंकाते हुए टूर्नामेंट को अपने नाम किया। इसी वर्ल्ड कप के बाद से भारत में क्रिकेट की सूरत बदल गई। हम आपको टूर्नामेंट में भारत के सफर के बारे में बताते हैं। भारत ने अपने पहले ही मुकाबले में वेस्टइंडीज को हरा दिया था। मैनचेस्टर में खेले गए मुकाबले में टीम इंडिया ने यशपाल शर्मा की 89 रनों की पारी की मदद से 262 रन बनाए। तब वनडे मुकाबले 60 ओवर के होते थे। रोजर बिन्नी और रवि शास्त्री ने 3-3 विकेट लेकर भारत को 34 रनों से जीत दिला दी। भारत ने इसके बाद जिम्बाब्वे को 5 विकेट से हराया। इस मैच में पहले खेलते हुए जिम्बाब्वे ने 155 रन बनाए। मदन लाल को तीन विकेट मिले। भारत ने 5 विकेट खोकर लक्ष्य हासिल कर लिया। संदीप पाटिल ने अर्धशतकीय पारी खेली। भारत को इसके बाद लगातार दो मैचों में हार मिली। ऑस्ट्रेलिया ने 162 रनों के बड़े अंतर से हराया। फिर वेस्टइंडीज के खिलाफ 66 रनों की हार मिली। ऑस्ट्रेलिया वाले मुकाबले में ट्रेवर चैपल ने 110 और वेस्टइंडीज वाले मुकाबले में विव रिचर्ड्स ने 119 रनों की पारी खेली। जिम्बाब्वे के खिलाफ मुकाबले में भारतीय टीम ने 17 रन पर 5 विकेट खो दिए थे। इसके बाद कपिल देव ने ऐतिहासिक 175 रनों की पारी खेली। यह वनडे में किसी भी भारतीय बल्लेबाज का पहला शतक था। इस शतक ने भारत को 266 रनों तक पहुंचा दिया। जिम्बाब्वे की पारी 235 रनों पर ही सिमट गई। अपने आखिरी ग्रुप मुकाबले में भारत ने ऑस्ट्रेलिया से हार का बदला ले लिया। पहले बैटिंग करते हुए भारत ने 247 रन बनाए। ऑस्ट्रेलिया की मजबूत बैटिंग लाइन सिर्फ 129 रनों पर सिमट गई। बीसीसीआई के वर्तमान अध्यक्ष रोजर बिन्नी ने 29 रन देकर 4 विकेट लिए। सेमीफाइनल मुकाबले में भारत के सामने मेजबान इंग्लैंड की चुनौती थी। इंग्लिश पारी 213 रनों पर सिमट गई। उनका कोई बल्लेबाज 40 तक भी नहीं पहुंच पाया। कपिल देव को 3 जबकि रोजर बिन्नी और मोहिंदर अमरनाथ को 2-2 विकेट मिले। संदीप सिंह की 32 गेंदों पर 51 रनों की तूफानी पारी ने भारत को जीत दिला दी। यशपाल शर्मा ने 61 जबकि मोहिंदर अमरनाथ ने 46 रनों की पारी खेली। भारत ने फाइनल मैच में पहले बैटिंग करते हुए 183 रन बनाए। श्रीकांत ने 38 रनों की पारी खेली। वेस्टइंडीज के लिए सर एंडी रॉबर्ट्स ने 3 विकेट लिए। मैल्कम मार्शल और माइकल होल्डिंग को 2-2 विकेट मिले। वेस्टइंडीज की खूंखार बैंटिंग के सामने यह आसान लक्ष्य लग रहा था। विव रिचर्ड्स तूफानी अंदाज में बैटिंग भी कर रहे थे। लेकिन 28 गेंदों पर 33 रन बनाकर वह आउट हुए और वेस्टइंडीज की पारी पटरी से उतर गई। कैरेबियन टीम 140 पर ऑलआउट हो गई। भारत ने मैच को 43 रनों से जीतकर खिताब अपने नाम कर लिया।","pubDate":"2023-06-25 05:33:52","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"...तो खत्म हो गया श्रेयर अय्यर का करियर! इंजरी के चलते एशिया कप के साथ WC भी खेलना मुश्किल","link":"https://navbharattimes.indiatimes.com/sports/cricket/asia-cup/shreyas-iyer-in-doubt-for-asia-cup-and-world-cup/articleshow/101251505.cms","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer: मुंबई के बेहद प्रतिभावान बल्लेबाज का करियर इंजरी की वजह से चौपट होता नजर आ रहा है। सर्जरी के बावजूद श्रेयस अय्यर पीठ की चोट से उबर ही नहीं पा रहे हैं।","content":"भारतीय क्रिकेट टीम के लिए बुरी खबर है। इंजर्ड प्लेयर्स वापसी के लिए जूझ रहे हैं। वनडे वर्ल्ड कप ईयर में यह टीम इंडिया के लिए किसी झटके से कम नहीं है। खबर है कि मिडिल ऑर्डर के मुख्य बल्लेबाज श्रेयस अय्यर अबतक इंजरी से उबर नहीं पाए हैं, उनकी एशिया कप में मौजूदगी भी संदिग्ध है। हमारे सहयोगी टाइम्स ऑफ इंडिया के सूत्रों ने बताया कि अगस्त-सितंबर में होने वाले एशिया कप तक अय्यर शायद ही फिट हो पाए। अप्रैल में श्रेयस अय्यर ने सर्जरी करवाई थी, जिसके बाद वह वर्ल्ड टेस्ट चैंपियनशिप में नहीं खेल पाए थे और अब उन्हें जुलाई-अगस्त में होने वाले वेस्टइंडीज दौरे के लिए भी नहीं चुना गया है। सूत्रों की माने तो अय्यर ने हाल ही में नेशनल क्रिकेट अकादमी में पीठ के दर्द से परेशान होकर इंजेक्शन लगाया था। सफल ऑपरेशन के बावजूद उनका बैक परेशान कर रहा है। सर्जरी के वक्त श्रेयस अय्यर के दिमाग में वर्ल्ड कप तक वापसी की योजना चल रही थी, लेकिन मौजूदा हालातों को देखते हुए उनका एशिया कप में भी खेलना मुश्किल लग रहा है। 28 साल के श्रेयस अय्यर मुंबई से आते हैं। 2017 में डेब्यू करने के बाद से बीते कुछ साल में वह टीम के अहम सदस्य बन गए थे। 2021 में तो उन्हें टेस्ट पदार्पण का भी मौका मिल गया, लेकिन लगातार चोटिल होने के चलते वह टीम में अपनी जगह नहीं बचा पाते। आईपीएल में कोलकाता नाइटराइडर्स की कप्तानी करने वाले श्रेयस अय्यर 2023 का पूरा सीजन ही नहीं खेल पाए। इस बीच हमारे सूत्रों ने ये भी बताया कि वर्ल्ड कप के बहुप्रतीक्षित शेड्यूल का ऐलान इसी हफ्ते हो जाएगा। मेजबान शहरों का नाम तय हो चुका है, सिर्फ औपचारिक घोषणा ही बची है।","pubDate":"2023-06-25 04:53:22","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI: 'मेरे चयन की खबर सुन पिताजी की आंखों में आ गए थे आंसू', यशस्वी जायसवाल ने बताया कैसा था परिवार का रिएक्शन","link":"https://www.abplive.com/sports/cricket/yashasvi-jaiswal-says-my-father-started-crying-after-hearing-the-news-of-my-selection-in-indian-team-for-west-indies-tour-2439223","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Yashasvi Jaiswal, India vs West Indies: वेस्टइंडीज दौरे के लिए 23 जून को टेस्ट और वनडे सीरीज के लिए भारतीय टीम का एलान किया गया था. 2 मैचों की टेस्ट सीरीज के लिए टीम में बाएं हाथ के युवा बल्लेबाज यशस्वी जायसवाल को भी जगह मिली है. वर्ल्ड टेस्ट चैंपियनशिप (WTC) फाइनल मुकाबले में जायसवाल को टीम के साथ रिजर्व खिलाड़ी के तौर पर जोड़ा गया था. अब टेस्ट टीम में चयन होने के बाद यशस्वी ने पहली बार अपनी और परिवार की प्रतिक्रिया के बारे में खुलकर बात की है. यशस्वी जायसवाल ने अपने चयन के कुछ समय बाद ही पीटीआई को दिए बयान में बताया कि जब मेरे चयन की खबर मेरे पिता को मिली तो वह रोने लगे थे. अभी मैं अपनी मां से नहीं मिला हूं, कुछ समय के बाद मैं उनसे भी मिलने जाऊंगा. विंडीज सीरीज की तैयारियों के लिए यशस्वी जायसवाल को दौरे पर रवाना होने से पहले बेंगलुरु स्थित राष्ट्रीय क्रिकेट अकादमी में अगले कुछ दिनों तक समय बिताना है. इसको लेकर जायसवाल ने कहा कि टीम में चयन होने के बाद मैं काफी अच्छा महसूस कर रहा हूं. मैं अपना सर्वश्रेष्ठ प्रदर्शन करने की कोशिश करूंगा. मैं उत्साहित जरूर हूं, लेकिन मैदान पर खुद को साबित भी करना चाहता हूं. टीम में चयन होने के बाद आपको थोड़ी बेचैनी होती है, लेकिन यह अच्छा अहसास भी है. सीनियर खिलाड़ियों से काफी कुछ सीखा अपनी तैयारियों को लेकर यशस्वी जायसवाल ने आगे कहा कि उन्होंने इस दौरे की तैयारी को लेकर कप्तान रोहित शर्मा, विराट कोहली और अजिंक्य रहाणे से बात की है. सबसे बातचीत में एक चीज जो सामने आई वह यह कि मुझे अपनी चीजों को आसान रखने की कोशिश करनी होगी. मैंने इन सभी से काफी कुछ सीखा है. लेकिन जब आप मैदान पर खेल रहे होते हैं तो चीजें आपको ही करनी होती हैं. यह भी पढ़ें... Watch: फील्डिंग टीम की गलती से रन आउट हुए बल्लेबाज! देखें सोशल मीडिया पर वायरल वीडियो","content":"Yashasvi Jaiswal, India vs West Indies: वेस्टइंडीज दौरे के लिए 23 जून को टेस्ट और वनडे सीरीज के लिए भारतीय टीम का एलान किया गया था. 2 मैचों की टेस्ट सीरीज के लिए टीम में बाएं हाथ के युवा बल्लेबाज यशस्वी जायसवाल को भी जगह मिली है. वर्ल्ड टेस्ट चैंपियनशिप (WTC) फाइनल मुकाबले में जायसवाल को टीम के साथ रिजर्व खिलाड़ी के तौर पर जोड़ा गया था. अब टेस्ट टीम में चयन होने के बाद यशस्वी ने पहली बार अपनी और परिवार की प्रतिक्रिया के बारे में खुलकर बात की है. यशस्वी जायसवाल ने अपने चयन के कुछ समय बाद ही पीटीआई को दिए बयान में बताया कि जब मेरे चयन की खबर मेरे पिता को मिली तो वह रोने लगे थे. अभी मैं अपनी मां से नहीं मिला हूं, कुछ समय के बाद मैं उनसे भी मिलने जाऊंगा. विंडीज सीरीज की तैयारियों के लिए यशस्वी जायसवाल को दौरे पर रवाना होने से पहले बेंगलुरु स्थित राष्ट्रीय क्रिकेट अकादमी में अगले कुछ दिनों तक समय बिताना है. इसको लेकर जायसवाल ने कहा कि टीम में चयन होने के बाद मैं काफी अच्छा महसूस कर रहा हूं. मैं अपना सर्वश्रेष्ठ प्रदर्शन करने की कोशिश करूंगा. मैं उत्साहित जरूर हूं, लेकिन मैदान पर खुद को साबित भी करना चाहता हूं. टीम में चयन होने के बाद आपको थोड़ी बेचैनी होती है, लेकिन यह अच्छा अहसास भी है. सीनियर खिलाड़ियों से काफी कुछ सीखा googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); अपनी तैयारियों को लेकर यशस्वी जायसवाल ने आगे कहा कि उन्होंने इस दौरे की तैयारी को लेकर कप्तान रोहित शर्मा, विराट कोहली और अजिंक्य रहाणे से बात की है. सबसे बातचीत में एक चीज जो सामने आई वह यह कि मुझे अपनी चीजों को आसान रखने की कोशिश करनी होगी. मैंने इन सभी से काफी कुछ सीखा है. लेकिन जब आप मैदान पर खेल रहे होते हैं तो चीजें आपको ही करनी होती हैं. यह भी पढ़ें... Watch: फील्डिंग टीम की गलती से रन आउट हुए बल्लेबाज! देखें सोशल मीडिया पर वायरल वीडियो","pubDate":"2023-06-25 04:10:13","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/ba714fc6fa0ae88330f31b1d0941835c1687663905650786_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"World Cup Qualifiers: इन तीन टीमों का वर्ल्ड कप खेलने का सपना टूटा, अब 6 टीमों के बीच सुपर-10 में पहुंचने की होगी जंग","link":"https://www.abplive.com/sports/cricket/icc-cricket-world-cup-qualifiers-2023-points-table-nepal-united-states-uae-aireland-out-of-race-2439235","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"World Cup Qualifiers 2023 Points Table: जिम्बाब्वे में 18 जून से 2023 वनडे वर्ल्ड कप के क्वालीफायर मैच खेले जा रहे हैं. 10 टीमों के बीच वनडे वर्ल्ड कप के बचे दो स्थानों के लिए जंग हो रही थी. अब इनमें से चार टीमों का वर्ल्ड कप में पहुंचने का सपना टूट गया है. बीते शनिवार को होस्ट जिम्बाब्वे में वेस्टइंडीज को हराया और पूरी तरह से प्वाइंट्स टेबल को बदल दिया.  अभी तक आधिकारिक तौर पर नेपाल, यूनाइटेड स्टेट्स और यूएई की टीम वर्ल्ड कप के सुपर-10 में पहुंचने की रेस से बाहर हुई हैं. हालांकि, आयरलैंड भी अपने पहले दो मैच हार चुकी है. आज उसका मुकाबला श्रीलंका से होगा. अगर आज आयरलैंड हार जाती है तो वो भी वनडे वर्ल्ड कप के मेन इवेंट में पहुंचने की रेस से बाहर हो जाएगी.  प्वाइंट्स टेबल का ताज़ा हाल बता दें कि क्वालीफायर राउंड में 10 टीमों को दो ग्रुप में बांटा गया है. ग्रुप ए से जिम्बाब्वे, नीदरलैंड और वेस्टइंडीज ने सुपर-6 के लिए क्वालीफाई किया है. वहीं ग्रुप बी से अभी कोई भी टीम सुपर-6 में नहीं पहुंची है. हालांकि, श्रीलंका, ओमान और स्कॉटलैंड के सुपर-6 में जाने के सबसे ज्यादा चांस हैं.  टॉप-2 टीमें करेंगे मेन इवेंट में क्वालीफाई  आपकी जानकारी के लिए बता दें कि 2023 वनडे वर्ल्ड कप 10 टीमों के बीच खेला जाएगा. इसके लिए आठ टीमें सीधे तौर पर क्वालीफाई हो चुकी हैं. वहीं अंतिम दो टीमें क्वालीफाइंग राउंड से पहुंचेंगी.  इन आठ टीमों ने सीधे तौर पर किया क्वालीफाई 2023 वनडे वर्ल्ड कप के लिए होस्ट भारत, पाकिस्तान, बांग्लादेश, अफगानिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, ऑस्ट्रेलिया और इंग्लैंड ने सीधे तौर पर क्वालीफाई किया है. अब बाकी दो टीमें क्वालीफायर राउंड से आएंगी. फिर अक्टूबर-नवंबर में मेन इवेंट खेला जाएगा. अपने घर पर खेलने की वजह से टीम इंडिया वर्ल्ड कप में बतौर फेवरेट उतरेगी.  यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","content":"World Cup Qualifiers 2023 Points Table: जिम्बाब्वे में 18 जून से 2023 वनडे वर्ल्ड कप के क्वालीफायर मैच खेले जा रहे हैं. 10 टीमों के बीच वनडे वर्ल्ड कप के बचे दो स्थानों के लिए जंग हो रही थी. अब इनमें से चार टीमों का वर्ल्ड कप में पहुंचने का सपना टूट गया है. बीते शनिवार को होस्ट जिम्बाब्वे में वेस्टइंडीज को हराया और पूरी तरह से प्वाइंट्स टेबल को बदल दिया. अभी तक आधिकारिक तौर पर नेपाल, यूनाइटेड स्टेट्स और यूएई की टीम वर्ल्ड कप के सुपर-10 में पहुंचने की रेस से बाहर हुई हैं. हालांकि, आयरलैंड भी अपने पहले दो मैच हार चुकी है. आज उसका मुकाबला श्रीलंका से होगा. अगर आज आयरलैंड हार जाती है तो वो भी वनडे वर्ल्ड कप के मेन इवेंट में पहुंचने की रेस से बाहर हो जाएगी. प्वाइंट्स टेबल का ताज़ा हाल बता दें कि क्वालीफायर राउंड में 10 टीमों को दो ग्रुप में बांटा गया है. ग्रुप ए से जिम्बाब्वे, नीदरलैंड और वेस्टइंडीज ने सुपर-6 के लिए क्वालीफाई किया है. वहीं ग्रुप बी से अभी कोई भी टीम सुपर-6 में नहीं पहुंची है. हालांकि, श्रीलंका, ओमान और स्कॉटलैंड के सुपर-6 में जाने के सबसे ज्यादा चांस हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); टॉप-2 टीमें करेंगे मेन इवेंट में क्वालीफाई आपकी जानकारी के लिए बता दें कि 2023 वनडे वर्ल्ड कप 10 टीमों के बीच खेला जाएगा. इसके लिए आठ टीमें सीधे तौर पर क्वालीफाई हो चुकी हैं. वहीं अंतिम दो टीमें क्वालीफाइंग राउंड से पहुंचेंगी. इन आठ टीमों ने सीधे तौर पर किया क्वालीफाई 2023 वनडे वर्ल्ड कप के लिए होस्ट भारत, पाकिस्तान, बांग्लादेश, अफगानिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, ऑस्ट्रेलिया और इंग्लैंड ने सीधे तौर पर क्वालीफाई किया है. अब बाकी दो टीमें क्वालीफायर राउंड से आएंगी. फिर अक्टूबर-नवंबर में मेन इवेंट खेला जाएगा. अपने घर पर खेलने की वजह से टीम इंडिया वर्ल्ड कप में बतौर फेवरेट उतरेगी. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","pubDate":"2023-06-25 04:04:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/a8060b5404f029792c52bd55ecc650951687664944098143_original.jpeg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Asia Cup 2023: टीम इंडिया के लिए बुरी खबर, एशिया कप तक इन 2 स्टार खिलाड़ियों के फिट होने की उम्मीद कम","link":"https://www.abplive.com/sports/cricket/kl-rahul-and-shreyas-iyer-unlikely-to-be-fit-for-upcoming-asia-cup-2023-2439194","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"KL Rahul And Shreyas Iyer Doubtful For Asia Cup 2023: भारतीय क्रिकेट टीम के कई खिलाड़ी इस समय अपनी चोटों से उबर रहे हैं. इसी में 2 प्रमुख नाम केएल राहुल और श्रेयस अय्यर भी शामिल हैं. राहुल जिनको आईपीएल के 16वें सीजन के दौरान चोट लगी थी. वह सर्जरी के बाद अपनी रिहैब की प्रक्रिया को शुरू कर चुके हैं. लेकिन उनके एशिया कप तक वापसी की उम्मीद काफी कम जताई जा रही है. ऐसा ही कुछ पूरे आईपीएल सीजन से बाहर रहने वाले श्रेयस अय्यर को लेकर भी है. केएल राहुल और श्रेयस अय्यर दोनों ही खिलाड़ियों ने अपनी-अपनी चोट की सर्जरी कराई है. इसके बाद इन दोनों के एशिया कप 2023 से वापसी की उम्मीद जताई जा रही थी. अभी राहुल और अय्यर को पूरी तरह से फिट होने में अधिक समय लगेगा. राहुल जहां अभी राष्ट्रीय क्रिकेट अकादमी (NCA) में हैं. वहीं अय्यर भी अपनी रिकवरी पर ध्यान दे रहे हैं. एशिया कप 2023 का आयोजन 31 अगस्त से 17 सितंबर तक होना है. हाइब्रिड मॉडल के तहत खेले जाने वाले इस बार के एशिया कप में टीम इंडिया अपने सभी मुकाबले श्रीलंका में खेलेगी. वनडे वर्ल्ड कप की तैयारियों को देखते हुए टीम इंडिया के लिए यह बड़ा झटका माना जा सकता है. वर्ल्ड कप के लिए मुख्य टीम का एलान करने लिए 29 अगस्त की डेडलाइन आईसीसी की तरफ से निर्धारित की गई है. जसप्रीत बुमराह की फिटनेस पर आया यह अपडेट सामने पिछले साल से टीम इंडिया से बाहर चल रहे तेज गेंदबाज जसप्रीत बुमराह भी अब तेजी के साथ फिट हो रहे हैं. रिपोर्ट्स के अनुसार वह अब तक 70 फीसदी तक फिट हो चुके हैं. ऐसे में बुमराह को आयरलैंड के दौरे पर जाने वाली भारतीय टीम का हिस्सा बनाया जा सकता है. भारतीय टीम को अगस्त महीने में एशिया कप से पहले आयरलैंड के खिलाफ सीरीज खेलनी है. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","content":"KL Rahul And Shreyas Iyer Doubtful For Asia Cup 2023: भारतीय क्रिकेट टीम के कई खिलाड़ी इस समय अपनी चोटों से उबर रहे हैं. इसी में 2 प्रमुख नाम केएल राहुल और श्रेयस अय्यर भी शामिल हैं. राहुल जिनको आईपीएल के 16वें सीजन के दौरान चोट लगी थी. वह सर्जरी के बाद अपनी रिहैब की प्रक्रिया को शुरू कर चुके हैं. लेकिन उनके एशिया कप तक वापसी की उम्मीद काफी कम जताई जा रही है. ऐसा ही कुछ पूरे आईपीएल सीजन से बाहर रहने वाले श्रेयस अय्यर को लेकर भी है. केएल राहुल और श्रेयस अय्यर दोनों ही खिलाड़ियों ने अपनी-अपनी चोट की सर्जरी कराई है. इसके बाद इन दोनों के एशिया कप 2023 से वापसी की उम्मीद जताई जा रही थी. अभी राहुल और अय्यर को पूरी तरह से फिट होने में अधिक समय लगेगा. राहुल जहां अभी राष्ट्रीय क्रिकेट अकादमी (NCA) में हैं. वहीं अय्यर भी अपनी रिकवरी पर ध्यान दे रहे हैं. एशिया कप 2023 का आयोजन 31 अगस्त से 17 सितंबर तक होना है. हाइब्रिड मॉडल के तहत खेले जाने वाले इस बार के एशिया कप में टीम इंडिया अपने सभी मुकाबले श्रीलंका में खेलेगी. वनडे वर्ल्ड कप की तैयारियों को देखते हुए टीम इंडिया के लिए यह बड़ा झटका माना जा सकता है. वर्ल्ड कप के लिए मुख्य टीम का एलान करने लिए 29 अगस्त की डेडलाइन आईसीसी की तरफ से निर्धारित की गई है. जसप्रीत बुमराह की फिटनेस पर आया यह अपडेट सामने googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); पिछले साल से टीम इंडिया से बाहर चल रहे तेज गेंदबाज जसप्रीत बुमराह भी अब तेजी के साथ फिट हो रहे हैं. रिपोर्ट्स के अनुसार वह अब तक 70 फीसदी तक फिट हो चुके हैं. ऐसे में बुमराह को आयरलैंड के दौरे पर जाने वाली भारतीय टीम का हिस्सा बनाया जा सकता है. भारतीय टीम को अगस्त महीने में एशिया कप से पहले आयरलैंड के खिलाफ सीरीज खेलनी है. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","pubDate":"2023-06-25 03:41:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/f2e438e9919e0490e0eec383ffe8dd601687660128997786_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Adani launches ‘Jeetenge Hum’ campaign, 1983 team joins in","link":"http://www.newindianexpress.com/sport/cricket/2023/jun/25/adani-launches-jeetenge-hum-campaign-1983-team-joins-in-2588283.html","keywords":null,"creator":null,"video_url":null,"description":"According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. CHENNAI: The Adani Group launched a campaign for the 50-over World Cup on Saturday. On Adani Day, Adani Group collaborated with the heroes of the 1983 World Cup Cricket victory to launch the ‘Jeetenge Hum’ campaign, displaying unwavering support for Indian team for the highly anticipated ICC ODI Cricket World Cup later this year. According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. “Led by Chairman Gautam Adani, the campaign sets ablaze with heartfelt wishes, kindling outpouring of support from the 1983 World Cup-winning cricket legends and passionate fans. The campaign encourages Indian cricket fans to unite as one, and rally behind Team India with #JeetengeHum on Twitter and Instagram, backing the team’s quest for victory and boosting their morale,” said the statement. “Cricket is a binding force in our country invoking a wide spectrum of emotions. Legends are not born, they are made through resilience and perseverance. Team India must have had both these attributes that led us to win the World Cup in 1983.” “With the hope of seeing history repeat itself, join us and the legends in wishing the Indian Cricket Team for the upcoming World Cup through #JeetengeHum,” said Gautam Adani, Chairman, of Adani Group in a statement. The 1983 World Cup-winning captain, Kapil Dev, too lent his support saying, “We are honoured to unite with the Adani Group in rallying Team India for the ODI World Cup 2023. This campaign symbolises the excitement and the indomitable spirit that propelled us to victory in 1983. In preparation for the World Cup 2023, it is imperative for the team to foster a collective mindset that centers on wholeheartedly committing to giving their absolute best. The true measure of success lies not solely in the outcome, but in the unwavering dedication to the relentless pursuit of personal excellence.” Roger Binny, one of the heroes of the 1983 team and the Board of Control for Cricket in India (BCCI) president, said, “Being part of the 1983 World Cup-winning team was an incredible journey filled with determination and team spirit. Together, we believe in the potential of our current players to bring back the coveted trophy. Let’s unite as fans and inspire them to create history!”","content":"CHENNAI: The Adani Group launched a campaign for the 50-over World Cup on Saturday. On Adani Day, Adani Group collaborated with the heroes of the 1983 World Cup Cricket victory to launch the ‘Jeetenge Hum’ campaign, displaying unwavering support for Indian team for the highly anticipated ICC ODI Cricket World Cup later this year. According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. “Led by Chairman Gautam Adani, the campaign sets ablaze with heartfelt wishes, kindling outpouring of support from the 1983 World Cup-winning cricket legends and passionate fans. The campaign encourages Indian cricket fans to unite as one, and rally behind Team India with #JeetengeHum on Twitter and Instagram, backing the team’s quest for victory and boosting their morale,” said the statement. “Cricket is a binding force in our country invoking a wide spectrum of emotions. Legends are not born, they are made through resilience and perseverance. Team India must have had both these attributes that led us to win the World Cup in 1983.” “With the hope of seeing history repeat itself, join us and the legends in wishing the Indian Cricket Team for the upcoming World Cup through #JeetengeHum,” said Gautam Adani, Chairman, of Adani Group in a statement. The 1983 World Cup-winning captain, Kapil Dev, too lent his support saying, “We are honoured to unite with the Adani Group in rallying Team India for the ODI World Cup 2023. This campaign symbolises the excitement and the indomitable spirit that propelled us to victory in 1983. In preparation for the World Cup 2023, it is imperative for the team to foster a collective mindset that centers on wholeheartedly committing to giving their absolute best. The true measure of success lies not solely in the outcome, but in the unwavering dedication to the relentless pursuit of personal excellence.” Roger Binny, one of the heroes of the 1983 team and the Board of Control for Cricket in India (BCCI) president, said, “Being part of the 1983 World Cup-winning team was an incredible journey filled with determination and team spirit. Together, we believe in the potential of our current players to bring back the coveted trophy. Let’s unite as fans and inspire them to create history!”","pubDate":"2023-06-25 03:00:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"40 साल पहले लॉर्ड्स पर तिरंगा लहराने की कहानी, कपिल की कप्तानी में जीता 1983 का क्रिकेट वर्ल्डकप","link":"https://hindi.oneindia.com/news/sports/cricket/india-1983-prudential-cup-aka-icc-cricket-world-cup-lords-kapil-dev-784467.html","keywords":null,"creator":null,"video_url":null,"description":"India 1983 के 25 जून की तारीख भुला नहीं सकता। इसी दिन अंग्रेजों की सरजमीं पर तिरंगा लहराया था। कहानी क्रिकेट में चैंपियन बनने की है।","content":"खेल की दुनिया में India 1983 को कभी न भूलने वाला साल मानता है। ऐसा इसलिए क्योंकि आजादी के बाद अलग-अलग क्षेत्रों में खुद को संगठित और खड़ा करने का प्रयास कर रहा था, लेकिन खेल की दुनिया में क्रिकेट भारत के लिए बहुत चुनौतीपूर्ण था। ऐसे समय में भी कपिल देव की कप्तानी में क्रिकेट का मक्का कहे जाने वाले लॉर्ड्स क्रिकेट ग्राउंड पर भारतीय क्रिकेटर्स ने कामयाबी की ऐसी इबारत लिखी, जिसने दुनिया का ध्यान भारत की तरफ खींचा। लॉर्ड्स क्रिकेट ग्राउंड पर जब भारतीय क्रिकेटर्स केवल 183 रनों पर ऑलआउट हुए तो ऐसा लगा कि तत्कालीन वर्ल्ड चैंपियन और लगातार दो विश्वकप जीतने वाली वेस्टइंडीज भारत को कभी न भूलने वाली हार का स्वाद चखाएगी। हालांकि, क्रिकेट की दुनिया में एक बहुत मशहूर कहावत है, अनिश्चितताओं से भरा खेल और आखिरी गेंद फेंके जाने तक नतीजे केवल अनुमान होते हैं। ऐसा ही कुछ हुआ 25 जून, 1983 के दिन। सर विवियन रिचर्ड्स जैसे विस्फोटक और ऑल टाइम ग्रेट बैटर वाली वेस्टइंडीज भारतीय गेंदबाजों के सामने 183 रनों का स्कोर भी हासिल नहीं कर सकी और इंग्लैंड के लॉर्ड्स क्रिकेट ग्राउंड पर 40 साल पहले इतिहास रचा गया। आज के आईसीसी वनडे क्रिकेट वर्ल्डकप को 1983 में प्रूडेंशियल कप कहा जाता था। 1975 और 1979 के विश्वकप में अपनी बादशाहत साबित कर चुकी वेस्टइंडीज लॉर्ड्स में लगातार तीसरी बार इतिहास रचने की दहलीज पर थी। 25 जून 1983 का वो दिन ऐतिहासिक बना भी, लेकिन भारत के लिए। कपिल की कप्तानी में इंडिया के लड़ाकों ने परीकथा जैसा प्रदर्शन किया और 60 ओवर के खेल में वेस्टइंडीज को 183 रनों का टारगेट अचीव नहीं करने दिया। 52 ओवरों में वेस्टइंडीज ऑलआउट हो गई। तीन विकेट लेने वाले मोहिंदर अमरनाथ मैन ऑफ द मैच चुने गए। क्रिकेट को फॉलो करने वाले सर्वसम्मति से इस बात को मानते हैं कि 1983 की जीत स्पोर्ट्स की दुनिया में टर्निंग प्वाइंट रही है। दो वर्ल्डकप जीत चुकी टीम जिसमें विव रिचर्ड्स, क्लाइव लॉयड और गॉर्डन ग्रीनिज जैसे दिग्गज शामिल हों, उसे 183 रनों के टारगेट के सामने केवल 140 रनों पर समेट देने को अगर अश्वमेध के घोड़े थामने जैसा पराक्रम कहा जाए तो अतिश्योक्ति नहीं। विव रिचर्ड्स का जिक्र इसलिए क्योंकि उनके पास ऐसा कौशल था जिससे वे अकेले दम पर 183 रन बनाने की कूवत रखते थे। इसका सबूत एक साल से भी कम समय बाद मिला जब उन्होंने मार्च, 1984 में वनडे करियर की बेस्ट इनिंग खेली। इंग्लैंड के खिलाफ रिचर्ड्स की 189 रनों की पारी को ऑल टाइम ग्रेट में गिना जाता है। सर विव को पूरा सम्मान, लेकिन आज बात भारतीय क्रिकेट की। 25 जून की शाम का जिक्र कर कपिल देव कई बार कह चुके हैं कि उन्हें गर्व है ऐसी टीम का हिस्सा बनने पर जिसमें सीनियर्स के होने पर भी उनके कंधों पर कप्तानी का दारोमदार सौंपा गया। विश्वकप जीतने के बाद पहले लॉर्ड्स और फिर इंग्लैंड के होटलों में सेलिब्रेशन का माहौल कैसा था? इस पर कपिल ने एक इंटरव्यू में बताया था कि कई खिलाड़ियों ने वाइन का जमकर लुत्फ उठाया था। खेल समीक्षक इस ऐतिहासिक जीत का सूत्रधार कपिल को मानते हैं। ऐसा इसलिए क्योंकि पहले इसी वर्ल्डकप में कपिल ने 175 नाबाद की बेहद जरूरी और ऐतिहासिक पारी खेली और फिर फाइनल मैच में विव रिचर्ड्स का ऐसा कैच लपका जिस पर एक नजर में यकीन कर पाना आज भी मुश्किल है। मीडिया के सीमित संसाधनों के कारण लॉर्ड्स के उस ऐतिहासिक मोमेंट को आज भी दर्शक मिस करते हैं। दरअसल, फाइनल के दिन बीबीसी के लोग हड़ताल पर थे। इस कारण मैच का रुख पलटने वाले मदन लाल और अमरनाथ सरीखे लीजेंड को आज की युवा पीढ़ी रियल टाइम तस्वीरों और वीडियो से नहीं जान सकी। अंग्रेजों की सरजमीं पर सेमीफाइनल मुकाबले में इंग्लैंड को मात देकर लॉर्ड्स क्रिकेट ग्राउंड पर फाइनल का टिकट पाने वाली टीम इंडिया को अंडरडॉग माना गया। खुद मदन लाल बताते हैं कि भारत को जीत का दावेदार माना ही नहीं गया, लेकिन मैच-दर-मैच मिली जीत के बाद अगले मैच में भी जीतने की उम्मीद की रौशनी तेज होती गई। मदन लाल की नजरों में सबसे अहम बात हौसला और आत्मविश्वास न खोना रहा। फाइनल से पहले वेस्टइंडीज और ऑस्ट्रेलिया से मात खाने के बाद भी टीम एकजुट रही। जीतने का जज्बा कम नहीं हुआ। उन्होंने एक इंटरव्यू में कहा, जिम्बाब्वे के खिलाफ महज 17 रन के टोटल पर पांच बल्लेबाजों का आउट होना ऐसा था, जब लगा कि अब टूर्नामेंट से बाहर होना तय है। हालांकि, जब कपिल ने 175 रनों की पारी खेली और भारत जीत गया तो टीम का कॉन्फिडेंस अलग स्तर पर पहुंच गया। ऐसा लगा, कि जब इतनी बुरी कंडीशन से कमबैक हो सकता है तो आगे भी जीत सकते हैं। मदन लाल की नजरों में रोजर बिन्नी, कपिल देव और बलविंदर संधू के अलावा कपिल की स्विंग बॉलिंग जीत के अहम फैक्टर्स में एक रही। कपिल की कप्तानी पर अमरनाथ बताते हैं कि उनका बेफिक्र अंदाज सबसे बड़ी कुंजी रही। जैसा खेलने का अंदाज वैसी ही कप्तानी। टीम में अनुभव और युवा जोश का संतुलन था। 40 साल पुराने गोल्डन मोमेंट्स को याद कर अमरनाथ बताते हैं कि वेस्टइंडीज के 8 विकेट गिरने के बाद लगने लगा था कि वर्ल्डकप उनके कब्जे में आ चुका है। आखिरी विकेट की औपचारिकता जल्द पूरी करने की ललक थी। तत्कालीन राष्ट्रपति ज्ञानी जैल सिंह ने भी विश्वविजेता टीम के स्वदेश लौटने के बाद पूरी टीम को सम्मानित किया था। टीम भावना की मिसाल इस बात से भी मिलती है कि 14 सदस्यीय टीम में सुनील वॉल्सन एक ऐसे खिलाड़ी रहे, जिन्हें एक भी मुकाबले में मैदान पर उतरने का मौका नहीं मिल सका। वे जीत का मंजर याद कर बताते हैं कि लॉर्ड्स पर दर्शकों का हुजूम इस कदर उमड़ा कि खिलाड़ियों को पवेलियन की तरफ भागना पड़ा। आज चार दशकों के बाद जब टीम की इस ऐतिहासिक कामयाबी का जिक्र हो रहा है, कहना गलत नहीं होगा कि खेल के प्रति समर्पण और जुनून दशकों पुरानी इस एवरग्रीन टीम से सीखने की जरूरत है। खासकर ऐसे समय में जब क्रिकेट में तकनीक, पैसे और ग्लैमर का बोलबाला है।","pubDate":"2023-06-25 02:51:53","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Batting rootstar","link":"http://www.newindianexpress.com/sport/cricket/2023/jun/25/batting-rootstar-2588279.html","keywords":null,"creator":null,"video_url":null,"description":"England’s batter has not just adapted to the firebrand cricket of the team, but is thriving. Swaroop Swaminathan speaks with his formative coach to find out more about the transition. In the formative days of Bazball, England was treated to a speech by skipper Ben Stokes. The still newly-appointed captain had watched Elvis before the rescheduled fifth Test of the India — England series. Stokes, a totemic figure himself, was so inspired by what he saw on screen. Basically, Stokes, in his speech on the first morning of the Test, challenged his team to be ‘rock stars’. Easier said than done. Some have the persona ingrained in them. Others? Not so much. Joe Root, for instance, is more suited to being a class prefect than a rock star. More squeaky clean Yorkshire lad and less the Memphis’ King. But Bazball isn’t about trying and imitating something or someone. It was about creating an environment of fun, with entertainment being one of the primary currencies in town. The fine print — finding the best route to success — was the destination but there would be no arguments about the journey. Root said as much after his match-winning 100 against India in the 5th Test in July 2022. “Ben wanted us to be entertainers. He mentioned trying to be rock stars on the field,” Root had said. “It’s about trying to have fun and relish every opportunity you get to showcase what you are about and put on a show for everyone. I do not think I will ever be able to feel or look like a rock star, but for 10 seconds I might have done today.” Root may not admit it but he’s been a rockstar in England whites ever since Brendon McCullum and Stokes decided to reshape the England team in their image. If the one compelling story of Test cricket over the last year has been the side’s almost complete reversal of fortune, England’s No. 4 is the one penning some of the prose in the story. After the Ashes Down Under in the winter of 2021, Root looked broken, a leader of a ship with a broken steering and a lost compass. These days, he’s the leader of the band doing Elvis impersonations and reverse-ramping one of the best bowlers of the 21st century. To speak about Root’s last 12 months, the ideal starting point is the way he has exploited the space behind the slip cordon. According to data provided by CricViz to this daily, “Since McCullum took over, he’s played 15 scoop shots, scoring 40 runs’ in the process”. The year before that? “In 2021-22, Root played only one scoop shot off seamers, scoring one run,” CricViz added. Kevin Sharp, one of his first coaches at Yorkshire, alluded to this very shot when speaking about his former ward. “He has always been a consistent player for many years,” he told this daily. “They are playing with no fear, really. I think what has happened is that Joe too has certainly expanded his shot selection at Test level by playing some of the ramps, for example.” If the ramp is a primer to understand Root under the McCullum-Stokes combination, a wider picture is necessary to know what the No. 4 has brought to the new regime. While the likes of Jonny Bairstow, Harry Brook and Ollie Pope (all to varying degrees) have provided the ballast, Root’s essentially the one with the oil, their bellwether batter, somebody who has made telling contributions across three continents. Out of the 14 Tests he has played under Stokes, he has made a 50 or above in nine. He’s been the world leader for centuries (five), most scores above 50 (10), most fours (132) and most runs (1279). He may be considered a technically proficient batter, but he has also been able to live with the ultra-aggressive approach. His career strike rate till May 2022 was 54.65. Under the new regime, that’s jumped to 76.35 while averaging almost 18 runs more. Sharp isn’t surprised. “He has always been one of the leaders of the batting unit, he tries to put pressure on the opposition bowlers. He has been around long enough and experienced enough to be able to take on those responsibilities. “I am not surprised because he’s always thinking ahead of the game, what he needs to do to get better. When he practices, he always practices for the big occasion and the next big challenge. When he was 12, he was preparing like a county batter would do. When he was 16, he was preparing like a Test batter.” While the debate in India continues about the benefits of featuring in the IPL before a big-ticket red-ball series, Root opined that featuring in the IPL was better preparation for this year’s Ashes than turning out for Yorkshire. “Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here. I am not saying it’s not important or a good standard. (But) for where I am in my career, am I going to learn more about myself in that environment,” he had told UK media during the Test against Ireland in early June. “Am I really going to be prepared better for an Ashes series facing lower-pace bowling on some nibbly wickets, when hopefully we will play on good pitches against high pace and a high-quality spinner? I don’t think so. By going to the IPL, learning and experiencing something new, and discussing the game with some of the greats, like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year, it would set me up best. I feel ready, I have another week’s prep and some time together as a squad.” Sharp provides further insight. “He’s (Root) is very versatile,” he said. “There’s a difference between playing cricket and knowing how to play cricket... the very fact that the England management allowed these guys to play the IPL just before the Ashes is a vote of confidence. We know you can play Test cricket. Go out there and come back with those experiences and use them in the Test arena.” Speaking with former players, Sharp says, is also something Root likes to do. Especially to work on the mental side of his game. As an example, when he faced the problem of converting 50s into 100s. “He would talk to other players, past players, talk to psychologists, talk to anyone who would give him the necessary information to help him with the process. Now he’s so wise and smart... he’s probably had so many experiences, and he’s now revelling in the fact that he can try something in an environment that allows him to do so. If you make a mistake, ‘it’s okay’.” That, ultimately, is Root’s batting. Distilled to its very essence.","content":"In the formative days of Bazball, England was treated to a speech by skipper Ben Stokes. The still newly-appointed captain had watched Elvis before the rescheduled fifth Test of the India — England series. Stokes, a totemic figure himself, was so inspired by what he saw on screen. Basically, Stokes, in his speech on the first morning of the Test, challenged his team to be ‘rock stars’. Easier said than done. Some have the persona ingrained in them. Others? Not so much. Joe Root, for instance, is more suited to being a class prefect than a rock star. More squeaky clean Yorkshire lad and less the Memphis’ King. But Bazball isn’t about trying and imitating something or someone. It was about creating an environment of fun, with entertainment being one of the primary currencies in town. The fine print — finding the best route to success — was the destination but there would be no arguments about the journey. Root said as much after his match-winning 100 against India in the 5th Test in July 2022. “Ben wanted us to be entertainers. He mentioned trying to be rock stars on the field,” Root had said. “It’s about trying to have fun and relish every opportunity you get to showcase what you are about and put on a show for everyone. I do not think I will ever be able to feel or look like a rock star, but for 10 seconds I might have done today.” Root may not admit it but he’s been a rockstar in England whites ever since Brendon McCullum and Stokes decided to reshape the England team in their image. If the one compelling story of Test cricket over the last year has been the side’s almost complete reversal of fortune, England’s No. 4 is the one penning some of the prose in the story. After the Ashes Down Under in the winter of 2021, Root looked broken, a leader of a ship with a broken steering and a lost compass. These days, he’s the leader of the band doing Elvis impersonations and reverse-ramping one of the best bowlers of the 21st century. To speak about Root’s last 12 months, the ideal starting point is the way he has exploited the space behind the slip cordon. According to data provided by CricViz to this daily, “Since McCullum took over, he’s played 15 scoop shots, scoring 40 runs’ in the process”. The year before that? “In 2021-22, Root played only one scoop shot off seamers, scoring one run,” CricViz added. Kevin Sharp, one of his first coaches at Yorkshire, alluded to this very shot when speaking about his former ward. “He has always been a consistent player for many years,” he told this daily. “They are playing with no fear, really. I think what has happened is that Joe too has certainly expanded his shot selection at Test level by playing some of the ramps, for example.” If the ramp is a primer to understand Root under the McCullum-Stokes combination, a wider picture is necessary to know what the No. 4 has brought to the new regime. While the likes of Jonny Bairstow, Harry Brook and Ollie Pope (all to varying degrees) have provided the ballast, Root’s essentially the one with the oil, their bellwether batter, somebody who has made telling contributions across three continents. Out of the 14 Tests he has played under Stokes, he has made a 50 or above in nine. He’s been the world leader for centuries (five), most scores above 50 (10), most fours (132) and most runs (1279). He may be considered a technically proficient batter, but he has also been able to live with the ultra-aggressive approach. His career strike rate till May 2022 was 54.65. Under the new regime, that’s jumped to 76.35 while averaging almost 18 runs more. Sharp isn’t surprised. “He has always been one of the leaders of the batting unit, he tries to put pressure on the opposition bowlers. He has been around long enough and experienced enough to be able to take on those responsibilities. “I am not surprised because he’s always thinking ahead of the game, what he needs to do to get better. When he practices, he always practices for the big occasion and the next big challenge. When he was 12, he was preparing like a county batter would do. When he was 16, he was preparing like a Test batter.” While the debate in India continues about the benefits of featuring in the IPL before a big-ticket red-ball series, Root opined that featuring in the IPL was better preparation for this year’s Ashes than turning out for Yorkshire. “Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here. I am not saying it’s not important or a good standard. (But) for where I am in my career, am I going to learn more about myself in that environment,” he had told UK media during the Test against Ireland in early June. “Am I really going to be prepared better for an Ashes series facing lower-pace bowling on some nibbly wickets, when hopefully we will play on good pitches against high pace and a high-quality spinner? I don’t think so. By going to the IPL, learning and experiencing something new, and discussing the game with some of the greats, like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year, it would set me up best. I feel ready, I have another week’s prep and some time together as a squad.” Sharp provides further insight. “He’s (Root) is very versatile,” he said. “There’s a difference between playing cricket and knowing how to play cricket... the very fact that the England management allowed these guys to play the IPL just before the Ashes is a vote of confidence. We know you can play Test cricket. Go out there and come back with those experiences and use them in the Test arena.” Speaking with former players, Sharp says, is also something Root likes to do. Especially to work on the mental side of his game. As an example, when he faced the problem of converting 50s into 100s. “He would talk to other players, past players, talk to psychologists, talk to anyone who would give him the necessary information to help him with the process. Now he’s so wise and smart... he’s probably had so many experiences, and he’s now revelling in the fact that he can try something in an environment that allows him to do so. If you make a mistake, ‘it’s okay’.” That, ultimately, is Root’s batting. Distilled to its very essence.","pubDate":"2023-06-25 02:49:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"2023 ODI वर्ल्ड कप के बाद किसे मिलनी चाहिए टीम इंडिया की कप्तानी? रवि शास्त्री ने बताई अपनी पसंद","link":"https://www.abplive.com/sports/cricket/who-should-get-captaincy-of-team-india-after-2023-odi-world-cup-ravi-shastri-took-name-of-hardik-pandya-2439199","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Ravi Shastri Named Hardik Pandya New White Ball Captain: इस साल के अंत में भारत में खेले जाने वाले 2023 वनडे वर्ल्ड कप के बाद संभवत: भारतीय क्रिकेट टीम को सीमित ओवर की क्रिकेट में एक नया कप्तान मिल जाएगा. हालांकि, इसकी चर्चा अभी से शुरू हो गई है. इस बीच टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने बताया है कि वनडे वर्ल्ड कप के बाद किसे टीम इंडिया की कप्तानी मिलनी चाहिए.  रवि शास्त्री का मानना है कि 2023 वनडे वर्ल्ड कप के बाद रोहित शर्मा से वनडे और टी20 इंटरनेशनल की कप्तानी छीन लेनी चाहिए और हार्दिक पांड्या को दोनों फॉर्मेट में नियमित कप्तान बना देना चाहिए. बता दें कि 2022 टी20 वर्ल्ड कप में भारत के खराब प्रदर्शन के बाद से हार्दिक ही टी20 में कप्तानी कर रहे हैं.  द वीक को दिए इंटरव्यू में पूर्व हेड कोच रवि शास्त्री ने कहा, \"मुझे लगता है कि हार्दिक पांड्या की बॉडी टेस्ट क्रिकेट का सामना नहीं कर पाएगी. ऐसे में 2023 वनडे वर्ल्ड कप के बाद उन्हें सीमित ओवरों की कप्तानी संभालनी चाहिए. वर्ल्ड कप में रोहित शर्मा कप्तान होंगे, इसमें कोई शक नहीं है.\" हार्दिक आईपीएल से बने कप्तानी के दावेदार गौरतलब है कि पहले टीम इंडिया के भविष्य के कप्तान के रूप में ऋषभ पंत और केएल राहुल को देखा जा रहा था. फिर इस लिस्ट में श्रेयस अय्यर का नाम भी जुड़ा. हालांकि, इसके बाद आईपीएल 2022 में गुजरात टाइटंस ने हार्दिक पांड्या को अपनी टीम की कप्तानी सौंपी, फिर क्या था मानो हार्दिक के तेवर ही बदल गए. पहली बार कप्तानी में ही हार्दिक ने गुजरात को खिताब जिता दिया और फिर हर कोई उनकी कप्तानी का मुरीद हो गया.  इसके बाद 2022 टी20 वर्ल्ड कप के बाद हार्दिक को भारत की टी20 टीम का कप्तान बनाया गया. यहां भी उन्होंने दिग्गजों को अपनी कप्तानी से प्रभावित किया. फिर आईपीएल 2023 में उनकी कप्तानी में गुजरात ने फाइनल तक का सफर तय किया. अब हर कोई हार्दिक को भविष्य के कप्तान के रूप में देख रहा है.  यह भी पढ़ें... AUSW vs ENGW: टैमी ब्यूमोंट के नाम दर्ज हुआ ऐतिहासिक रिकॉर्ड, इंग्लैंड महिला टीम के लिए दोहरा शतक लगाने वाली पहली बल्लेबाज","content":"Ravi Shastri Named Hardik Pandya New White Ball Captain: इस साल के अंत में भारत में खेले जाने वाले 2023 वनडे वर्ल्ड कप के बाद संभवत: भारतीय क्रिकेट टीम को सीमित ओवर की क्रिकेट में एक नया कप्तान मिल जाएगा. हालांकि, इसकी चर्चा अभी से शुरू हो गई है. इस बीच टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने बताया है कि वनडे वर्ल्ड कप के बाद किसे टीम इंडिया की कप्तानी मिलनी चाहिए. रवि शास्त्री का मानना है कि 2023 वनडे वर्ल्ड कप के बाद रोहित शर्मा से वनडे और टी20 इंटरनेशनल की कप्तानी छीन लेनी चाहिए और हार्दिक पांड्या को दोनों फॉर्मेट में नियमित कप्तान बना देना चाहिए. बता दें कि 2022 टी20 वर्ल्ड कप में भारत के खराब प्रदर्शन के बाद से हार्दिक ही टी20 में कप्तानी कर रहे हैं. द वीक को दिए इंटरव्यू में पूर्व हेड कोच रवि शास्त्री ने कहा, \"मुझे लगता है कि हार्दिक पांड्या की बॉडी टेस्ट क्रिकेट का सामना नहीं कर पाएगी. ऐसे में 2023 वनडे वर्ल्ड कप के बाद उन्हें सीमित ओवरों की कप्तानी संभालनी चाहिए. वर्ल्ड कप में रोहित शर्मा कप्तान होंगे, इसमें कोई शक नहीं है.\" हार्दिक आईपीएल से बने कप्तानी के दावेदार googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); गौरतलब है कि पहले टीम इंडिया के भविष्य के कप्तान के रूप में ऋषभ पंत और केएल राहुल को देखा जा रहा था. फिर इस लिस्ट में श्रेयस अय्यर का नाम भी जुड़ा. हालांकि, इसके बाद आईपीएल 2022 में गुजरात टाइटंस ने हार्दिक पांड्या को अपनी टीम की कप्तानी सौंपी, फिर क्या था मानो हार्दिक के तेवर ही बदल गए. पहली बार कप्तानी में ही हार्दिक ने गुजरात को खिताब जिता दिया और फिर हर कोई उनकी कप्तानी का मुरीद हो गया. इसके बाद 2022 टी20 वर्ल्ड कप के बाद हार्दिक को भारत की टी20 टीम का कप्तान बनाया गया. यहां भी उन्होंने दिग्गजों को अपनी कप्तानी से प्रभावित किया. फिर आईपीएल 2023 में उनकी कप्तानी में गुजरात ने फाइनल तक का सफर तय किया. अब हर कोई हार्दिक को भविष्य के कप्तान के रूप में देख रहा है. यह भी पढ़ें... AUSW vs ENGW: टैमी ब्यूमोंट के नाम दर्ज हुआ ऐतिहासिक रिकॉर्ड, इंग्लैंड महिला टीम के लिए दोहरा शतक लगाने वाली पहली बल्लेबाज","pubDate":"2023-06-25 02:42:11","image_url":"https://wcstatic.abplive.in/en/prod/wp-content/uploads/2018/08/veUZ6GQ6p7.JPG","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"1983 World Cup: 40 साल पहले आज ही के दिन भारत ने रचा था इतिहास, वर्ल्ड चैंपियन बन दुनिया को किया हैरान","link":"https://hindi.oneindia.com/news/sports/cricket/on-this-day-40-years-ago-india-win-the-1983-world-cup-know-here-details-784509.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट इतिहास में आज के दिन की अहमियत बहुत ज्यादा है। 25 जून 1983 को भारत ने पहली बार वर्ल्ड कप का खिताब जीता था। भारतीय टीम को इस वर्ल्ड कप में जीत का दावेदार नहीं माना जा रहा था। लेकिन टीम इंडिया ने खिताब अपने नाम कर सभी को हैरान कर दिया।","content":"भारतीय पूर्व दिग्गज ऑलराउंडर कपिल देव की कप्तानी में टीम ने पहली बार 25 जून को वर्ल्ड के खिताब पर कब्जा जमाया था। आज से ठीक 40 साल पहले लंदन के लॉर्ड्स मैदान पर लगातार 2 बार वर्ल्ड कप जीत चुकी वेस्टइंडीज को हराकर भारत ने जीत दर्ज की। भारत की इस जीत से पूरी दुनिया हैरान रह गई थी। भारतीय टीम वर्ल्ड कप जीत जाएगी, इस बात की उम्मीद किसी को नहीं थी। भारत के सामने वेस्टइंडीज का पलड़ा भारी दिखाई पड़ रहा था। लेकिन भारतीय गेंदबाजों की जबरदस्त बॉलिंग की बदौलत भारत ने इस मुकाबले को अपने नाम किया। भारत की इस जीत में कप्तान कपिल देव का भी बड़ा हाथ रहा था। वर्ल्ड कप के फाइनल मुकाबले में भारतीय टीम ने पहले बल्लेबाजी करते हुए 183 रन बनाए थे। भारतीय टीम के स्कोर को देखकर ऐसा लग रहा था कि वेस्टइंडीज की टीम इस मुकाबले को आसानी से जीत जाएगी। लेकिन भारतीय गेंदबाजों ने ऐसा होने नहीं दिया। भारत ने वेस्टइंडीज टीम को महज 140 रन पर ऑलआउट कर खिताब अपने नाम किया। फाइनल मैच में भारत की और से मदन लाल और मोहिंदर अमरनाथ ने तीन-तीन विकेट झटकने का काम किया था। इन दोनों की जबरदस्त गेंदबाजी के कारण ही भारत इस मुकाबले को आसानी से जीतने में सफल रहा। इस मैच में भारत के लिए कोई भी बल्लेबाज अर्धशतक नहीं लगा सका था। कृष्माचारी श्रीकांत ने टीम के लिए सबसे अधिक 38 रन बनाए थे। सुनील गावस्कर, क्रिस श्रीकांत, मोहिंदर अमरनाथ, यशपाल शर्मा, संदीप पाटिल, कपिल देव (कप्तान), कीर्ति आजाद, रोजर बिन्नी, मदन लाल, सैयद किरमानी (विकेटकीपर), बलविंदर संधू। सर गॉर्डन ग्रीनिज, डेसमंड हेन्स, सर विव रिचर्ड्स, सर क्लाइव लॉयड (कप्तान), लैरी गोम्स, फौड बाचस, जेफ डुजॉन (विकेटकीपर), मैल्कम मार्शल, सर एंडी रॉबर्ट्स, जोएल गार्नर, माइकल होल्डिंग। It's been 40 years now since India won their maiden World Cup, in England. The Kapil Dev led side created history beating public favorites WI in the Final. Mohinder Amarnath won POTM awards in the Semis and the Final. A victory that changed the future of cricket in India.","pubDate":"2023-06-25 02:41:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दो करारी हार, फिर पलटवार... 1983 वर्ल्ड कप में पहले मैच से फाइनल तक कैसा था टीम इंडिया का सफर","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/team-india-path-to-victory-in-1983-world-cup/articleshow/101251828.cms","keywords":null,"creator":null,"video_url":null,"description":"1983 World Cup: भारत ने 1983 वर्ल्ड कप का खिताब आज ही के दिन जीता था। कपिल देव की कप्तानी में भारतीय टीम एक समय टूर्नामेंट में मुश्किल स्थिति में थी। लगातार दो मैच में भारत को वेस्टइंडीज और ऑस्ट्रेलिया से हार मिली थी। लेकिन इसके बाद टीम ने पलटवार किया।","content":"40 साल पहले भारत ने आज ही के दिन नामुमकिन को मुमकिन कर दिया है। कपिल देव की कप्तानी में भारत ने वेस्टइंडीज को हराकर 1983 वर्ल्ड कप को अपने नाम किया था। 1983 से पहले 1975 और 1979 वर्ल्ड कप खेला गया था। इन दोनों टूर्नामेंट को मिलाकर भारत ने सिर्फ एक ही मैच जीता था। वहीं वेस्टइंडीज पहले दो वर्ल्ड कप की चैंपियन थी और तीसरे में भी जीत की प्रबल दावेदार। इसके बाद भी भारत ने सभी को चौंकाते हुए टूर्नामेंट को अपने नाम किया। इसी वर्ल्ड कप के बाद से भारत में क्रिकेट की सूरत बदल गई। हम आपको टूर्नामेंट में भारत के सफर के बारे में बताते हैं। भारत ने अपने पहले ही मुकाबले में वेस्टइंडीज को हरा दिया था। मैनचेस्टर में खेले गए मुकाबले में टीम इंडिया ने यशपाल शर्मा की 89 रनों की पारी की मदद से 262 रन बनाए। तब वनडे मुकाबले 60 ओवर के होते थे। रोजर बिन्नी और रवि शास्त्री ने 3-3 विकेट लेकर भारत को 34 रनों से जीत दिला दी। भारत ने इसके बाद जिम्बाब्वे को 5 विकेट से हराया। इस मैच में पहले खेलते हुए जिम्बाब्वे ने 155 रन बनाए। मदन लाल को तीन विकेट मिले। भारत ने 5 विकेट खोकर लक्ष्य हासिल कर लिया। संदीप पाटिल ने अर्धशतकीय पारी खेली। भारत को इसके बाद लगातार दो मैचों में हार मिली। ऑस्ट्रेलिया ने 162 रनों के बड़े अंतर से हराया। फिर वेस्टइंडीज के खिलाफ 66 रनों की हार मिली। ऑस्ट्रेलिया वाले मुकाबले में ट्रेवर चैपल ने 110 और वेस्टइंडीज वाले मुकाबले में विव रिचर्ड्स ने 119 रनों की पारी खेली। जिम्बाब्वे के खिलाफ मुकाबले में भारतीय टीम ने 17 रन पर 5 विकेट खो दिए थे। इसके बाद कपिल देव ने ऐतिहासिक 175 रनों की पारी खेली। यह वनडे में किसी भी भारतीय बल्लेबाज का पहला शतक था। इस शतक ने भारत को 266 रनों तक पहुंचा दिया। जिम्बाब्वे की पारी 235 रनों पर ही सिमट गई। अपने आखिरी ग्रुप मुकाबले में भारत ने ऑस्ट्रेलिया से हार का बदला ले लिया। पहले बैटिंग करते हुए भारत ने 247 रन बनाए। ऑस्ट्रेलिया की मजबूत बैटिंग लाइन सिर्फ 129 रनों पर सिमट गई। बीसीसीआई के वर्तमान अध्यक्ष रोजर बिन्नी ने 29 रन देकर 4 विकेट लिए। सेमीफाइनल मुकाबले में भारत के सामने मेजबान इंग्लैंड की चुनौती थी। इंग्लिश पारी 213 रनों पर सिमट गई। उनका कोई बल्लेबाज 40 तक भी नहीं पहुंच पाया। कपिल देव को 3 जबकि रोजर बिन्नी और मोहिंदर अमरनाथ को 2-2 विकेट मिले। संदीप सिंह की 32 गेंदों पर 51 रनों की तूफानी पारी ने भारत को जीत दिला दी। यशपाल शर्मा ने 61 जबकि मोहिंदर अमरनाथ ने 46 रनों की पारी खेली। भारत ने फाइनल मैच में पहले बैटिंग करते हुए 183 रन बनाए। श्रीकांत ने 38 रनों की पारी खेली। वेस्टइंडीज के लिए सर एंडी रॉबर्ट्स ने 3 विकेट लिए। मैल्कम मार्शल और माइकल होल्डिंग को 2-2 विकेट मिले। वेस्टइंडीज की खूंखार बैंटिंग के सामने यह आसान लक्ष्य लग रहा था। विव रिचर्ड्स तूफानी अंदाज में बैटिंग भी कर रहे थे। लेकिन 28 गेंदों पर 33 रन बनाकर वह आउट हुए और वेस्टइंडीज की पारी पटरी से उतर गई। कैरेबियन टीम 140 पर ऑलआउट हो गई। भारत ने मैच को 43 रनों से जीतकर खिताब अपने नाम कर लिया।","pubDate":"2023-06-25 05:33:52","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"...तो खत्म हो गया श्रेयर अय्यर का करियर! इंजरी के चलते एशिया कप के साथ WC भी खेलना मुश्किल","link":"https://navbharattimes.indiatimes.com/sports/cricket/asia-cup/shreyas-iyer-in-doubt-for-asia-cup-and-world-cup/articleshow/101251505.cms","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer: मुंबई के बेहद प्रतिभावान बल्लेबाज का करियर इंजरी की वजह से चौपट होता नजर आ रहा है। सर्जरी के बावजूद श्रेयस अय्यर पीठ की चोट से उबर ही नहीं पा रहे हैं।","content":"भारतीय क्रिकेट टीम के लिए बुरी खबर है। इंजर्ड प्लेयर्स वापसी के लिए जूझ रहे हैं। वनडे वर्ल्ड कप ईयर में यह टीम इंडिया के लिए किसी झटके से कम नहीं है। खबर है कि मिडिल ऑर्डर के मुख्य बल्लेबाज श्रेयस अय्यर अबतक इंजरी से उबर नहीं पाए हैं, उनकी एशिया कप में मौजूदगी भी संदिग्ध है। हमारे सहयोगी टाइम्स ऑफ इंडिया के सूत्रों ने बताया कि अगस्त-सितंबर में होने वाले एशिया कप तक अय्यर शायद ही फिट हो पाए। अप्रैल में श्रेयस अय्यर ने सर्जरी करवाई थी, जिसके बाद वह वर्ल्ड टेस्ट चैंपियनशिप में नहीं खेल पाए थे और अब उन्हें जुलाई-अगस्त में होने वाले वेस्टइंडीज दौरे के लिए भी नहीं चुना गया है। सूत्रों की माने तो अय्यर ने हाल ही में नेशनल क्रिकेट अकादमी में पीठ के दर्द से परेशान होकर इंजेक्शन लगाया था। सफल ऑपरेशन के बावजूद उनका बैक परेशान कर रहा है। सर्जरी के वक्त श्रेयस अय्यर के दिमाग में वर्ल्ड कप तक वापसी की योजना चल रही थी, लेकिन मौजूदा हालातों को देखते हुए उनका एशिया कप में भी खेलना मुश्किल लग रहा है। 28 साल के श्रेयस अय्यर मुंबई से आते हैं। 2017 में डेब्यू करने के बाद से बीते कुछ साल में वह टीम के अहम सदस्य बन गए थे। 2021 में तो उन्हें टेस्ट पदार्पण का भी मौका मिल गया, लेकिन लगातार चोटिल होने के चलते वह टीम में अपनी जगह नहीं बचा पाते। आईपीएल में कोलकाता नाइटराइडर्स की कप्तानी करने वाले श्रेयस अय्यर 2023 का पूरा सीजन ही नहीं खेल पाए। इस बीच हमारे सूत्रों ने ये भी बताया कि वर्ल्ड कप के बहुप्रतीक्षित शेड्यूल का ऐलान इसी हफ्ते हो जाएगा। मेजबान शहरों का नाम तय हो चुका है, सिर्फ औपचारिक घोषणा ही बची है।","pubDate":"2023-06-25 04:53:22","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI: 'मेरे चयन की खबर सुन पिताजी की आंखों में आ गए थे आंसू', यशस्वी जायसवाल ने बताया कैसा था परिवार का रिएक्शन","link":"https://www.abplive.com/sports/cricket/yashasvi-jaiswal-says-my-father-started-crying-after-hearing-the-news-of-my-selection-in-indian-team-for-west-indies-tour-2439223","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Yashasvi Jaiswal, India vs West Indies: वेस्टइंडीज दौरे के लिए 23 जून को टेस्ट और वनडे सीरीज के लिए भारतीय टीम का एलान किया गया था. 2 मैचों की टेस्ट सीरीज के लिए टीम में बाएं हाथ के युवा बल्लेबाज यशस्वी जायसवाल को भी जगह मिली है. वर्ल्ड टेस्ट चैंपियनशिप (WTC) फाइनल मुकाबले में जायसवाल को टीम के साथ रिजर्व खिलाड़ी के तौर पर जोड़ा गया था. अब टेस्ट टीम में चयन होने के बाद यशस्वी ने पहली बार अपनी और परिवार की प्रतिक्रिया के बारे में खुलकर बात की है. यशस्वी जायसवाल ने अपने चयन के कुछ समय बाद ही पीटीआई को दिए बयान में बताया कि जब मेरे चयन की खबर मेरे पिता को मिली तो वह रोने लगे थे. अभी मैं अपनी मां से नहीं मिला हूं, कुछ समय के बाद मैं उनसे भी मिलने जाऊंगा. विंडीज सीरीज की तैयारियों के लिए यशस्वी जायसवाल को दौरे पर रवाना होने से पहले बेंगलुरु स्थित राष्ट्रीय क्रिकेट अकादमी में अगले कुछ दिनों तक समय बिताना है. इसको लेकर जायसवाल ने कहा कि टीम में चयन होने के बाद मैं काफी अच्छा महसूस कर रहा हूं. मैं अपना सर्वश्रेष्ठ प्रदर्शन करने की कोशिश करूंगा. मैं उत्साहित जरूर हूं, लेकिन मैदान पर खुद को साबित भी करना चाहता हूं. टीम में चयन होने के बाद आपको थोड़ी बेचैनी होती है, लेकिन यह अच्छा अहसास भी है. सीनियर खिलाड़ियों से काफी कुछ सीखा अपनी तैयारियों को लेकर यशस्वी जायसवाल ने आगे कहा कि उन्होंने इस दौरे की तैयारी को लेकर कप्तान रोहित शर्मा, विराट कोहली और अजिंक्य रहाणे से बात की है. सबसे बातचीत में एक चीज जो सामने आई वह यह कि मुझे अपनी चीजों को आसान रखने की कोशिश करनी होगी. मैंने इन सभी से काफी कुछ सीखा है. लेकिन जब आप मैदान पर खेल रहे होते हैं तो चीजें आपको ही करनी होती हैं. यह भी पढ़ें... Watch: फील्डिंग टीम की गलती से रन आउट हुए बल्लेबाज! देखें सोशल मीडिया पर वायरल वीडियो","content":"Yashasvi Jaiswal, India vs West Indies: वेस्टइंडीज दौरे के लिए 23 जून को टेस्ट और वनडे सीरीज के लिए भारतीय टीम का एलान किया गया था. 2 मैचों की टेस्ट सीरीज के लिए टीम में बाएं हाथ के युवा बल्लेबाज यशस्वी जायसवाल को भी जगह मिली है. वर्ल्ड टेस्ट चैंपियनशिप (WTC) फाइनल मुकाबले में जायसवाल को टीम के साथ रिजर्व खिलाड़ी के तौर पर जोड़ा गया था. अब टेस्ट टीम में चयन होने के बाद यशस्वी ने पहली बार अपनी और परिवार की प्रतिक्रिया के बारे में खुलकर बात की है. यशस्वी जायसवाल ने अपने चयन के कुछ समय बाद ही पीटीआई को दिए बयान में बताया कि जब मेरे चयन की खबर मेरे पिता को मिली तो वह रोने लगे थे. अभी मैं अपनी मां से नहीं मिला हूं, कुछ समय के बाद मैं उनसे भी मिलने जाऊंगा. विंडीज सीरीज की तैयारियों के लिए यशस्वी जायसवाल को दौरे पर रवाना होने से पहले बेंगलुरु स्थित राष्ट्रीय क्रिकेट अकादमी में अगले कुछ दिनों तक समय बिताना है. इसको लेकर जायसवाल ने कहा कि टीम में चयन होने के बाद मैं काफी अच्छा महसूस कर रहा हूं. मैं अपना सर्वश्रेष्ठ प्रदर्शन करने की कोशिश करूंगा. मैं उत्साहित जरूर हूं, लेकिन मैदान पर खुद को साबित भी करना चाहता हूं. टीम में चयन होने के बाद आपको थोड़ी बेचैनी होती है, लेकिन यह अच्छा अहसास भी है. सीनियर खिलाड़ियों से काफी कुछ सीखा googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); अपनी तैयारियों को लेकर यशस्वी जायसवाल ने आगे कहा कि उन्होंने इस दौरे की तैयारी को लेकर कप्तान रोहित शर्मा, विराट कोहली और अजिंक्य रहाणे से बात की है. सबसे बातचीत में एक चीज जो सामने आई वह यह कि मुझे अपनी चीजों को आसान रखने की कोशिश करनी होगी. मैंने इन सभी से काफी कुछ सीखा है. लेकिन जब आप मैदान पर खेल रहे होते हैं तो चीजें आपको ही करनी होती हैं. यह भी पढ़ें... Watch: फील्डिंग टीम की गलती से रन आउट हुए बल्लेबाज! देखें सोशल मीडिया पर वायरल वीडियो","pubDate":"2023-06-25 04:10:13","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/ba714fc6fa0ae88330f31b1d0941835c1687663905650786_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"World Cup Qualifiers: इन तीन टीमों का वर्ल्ड कप खेलने का सपना टूटा, अब 6 टीमों के बीच सुपर-10 में पहुंचने की होगी जंग","link":"https://www.abplive.com/sports/cricket/icc-cricket-world-cup-qualifiers-2023-points-table-nepal-united-states-uae-aireland-out-of-race-2439235","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"World Cup Qualifiers 2023 Points Table: जिम्बाब्वे में 18 जून से 2023 वनडे वर्ल्ड कप के क्वालीफायर मैच खेले जा रहे हैं. 10 टीमों के बीच वनडे वर्ल्ड कप के बचे दो स्थानों के लिए जंग हो रही थी. अब इनमें से चार टीमों का वर्ल्ड कप में पहुंचने का सपना टूट गया है. बीते शनिवार को होस्ट जिम्बाब्वे में वेस्टइंडीज को हराया और पूरी तरह से प्वाइंट्स टेबल को बदल दिया.  अभी तक आधिकारिक तौर पर नेपाल, यूनाइटेड स्टेट्स और यूएई की टीम वर्ल्ड कप के सुपर-10 में पहुंचने की रेस से बाहर हुई हैं. हालांकि, आयरलैंड भी अपने पहले दो मैच हार चुकी है. आज उसका मुकाबला श्रीलंका से होगा. अगर आज आयरलैंड हार जाती है तो वो भी वनडे वर्ल्ड कप के मेन इवेंट में पहुंचने की रेस से बाहर हो जाएगी.  प्वाइंट्स टेबल का ताज़ा हाल बता दें कि क्वालीफायर राउंड में 10 टीमों को दो ग्रुप में बांटा गया है. ग्रुप ए से जिम्बाब्वे, नीदरलैंड और वेस्टइंडीज ने सुपर-6 के लिए क्वालीफाई किया है. वहीं ग्रुप बी से अभी कोई भी टीम सुपर-6 में नहीं पहुंची है. हालांकि, श्रीलंका, ओमान और स्कॉटलैंड के सुपर-6 में जाने के सबसे ज्यादा चांस हैं.  टॉप-2 टीमें करेंगे मेन इवेंट में क्वालीफाई  आपकी जानकारी के लिए बता दें कि 2023 वनडे वर्ल्ड कप 10 टीमों के बीच खेला जाएगा. इसके लिए आठ टीमें सीधे तौर पर क्वालीफाई हो चुकी हैं. वहीं अंतिम दो टीमें क्वालीफाइंग राउंड से पहुंचेंगी.  इन आठ टीमों ने सीधे तौर पर किया क्वालीफाई 2023 वनडे वर्ल्ड कप के लिए होस्ट भारत, पाकिस्तान, बांग्लादेश, अफगानिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, ऑस्ट्रेलिया और इंग्लैंड ने सीधे तौर पर क्वालीफाई किया है. अब बाकी दो टीमें क्वालीफायर राउंड से आएंगी. फिर अक्टूबर-नवंबर में मेन इवेंट खेला जाएगा. अपने घर पर खेलने की वजह से टीम इंडिया वर्ल्ड कप में बतौर फेवरेट उतरेगी.  यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","content":"World Cup Qualifiers 2023 Points Table: जिम्बाब्वे में 18 जून से 2023 वनडे वर्ल्ड कप के क्वालीफायर मैच खेले जा रहे हैं. 10 टीमों के बीच वनडे वर्ल्ड कप के बचे दो स्थानों के लिए जंग हो रही थी. अब इनमें से चार टीमों का वर्ल्ड कप में पहुंचने का सपना टूट गया है. बीते शनिवार को होस्ट जिम्बाब्वे में वेस्टइंडीज को हराया और पूरी तरह से प्वाइंट्स टेबल को बदल दिया. अभी तक आधिकारिक तौर पर नेपाल, यूनाइटेड स्टेट्स और यूएई की टीम वर्ल्ड कप के सुपर-10 में पहुंचने की रेस से बाहर हुई हैं. हालांकि, आयरलैंड भी अपने पहले दो मैच हार चुकी है. आज उसका मुकाबला श्रीलंका से होगा. अगर आज आयरलैंड हार जाती है तो वो भी वनडे वर्ल्ड कप के मेन इवेंट में पहुंचने की रेस से बाहर हो जाएगी. प्वाइंट्स टेबल का ताज़ा हाल बता दें कि क्वालीफायर राउंड में 10 टीमों को दो ग्रुप में बांटा गया है. ग्रुप ए से जिम्बाब्वे, नीदरलैंड और वेस्टइंडीज ने सुपर-6 के लिए क्वालीफाई किया है. वहीं ग्रुप बी से अभी कोई भी टीम सुपर-6 में नहीं पहुंची है. हालांकि, श्रीलंका, ओमान और स्कॉटलैंड के सुपर-6 में जाने के सबसे ज्यादा चांस हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); टॉप-2 टीमें करेंगे मेन इवेंट में क्वालीफाई आपकी जानकारी के लिए बता दें कि 2023 वनडे वर्ल्ड कप 10 टीमों के बीच खेला जाएगा. इसके लिए आठ टीमें सीधे तौर पर क्वालीफाई हो चुकी हैं. वहीं अंतिम दो टीमें क्वालीफाइंग राउंड से पहुंचेंगी. इन आठ टीमों ने सीधे तौर पर किया क्वालीफाई 2023 वनडे वर्ल्ड कप के लिए होस्ट भारत, पाकिस्तान, बांग्लादेश, अफगानिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, ऑस्ट्रेलिया और इंग्लैंड ने सीधे तौर पर क्वालीफाई किया है. अब बाकी दो टीमें क्वालीफायर राउंड से आएंगी. फिर अक्टूबर-नवंबर में मेन इवेंट खेला जाएगा. अपने घर पर खेलने की वजह से टीम इंडिया वर्ल्ड कप में बतौर फेवरेट उतरेगी. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","pubDate":"2023-06-25 04:04:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/a8060b5404f029792c52bd55ecc650951687664944098143_original.jpeg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Asia Cup 2023: टीम इंडिया के लिए बुरी खबर, एशिया कप तक इन 2 स्टार खिलाड़ियों के फिट होने की उम्मीद कम","link":"https://www.abplive.com/sports/cricket/kl-rahul-and-shreyas-iyer-unlikely-to-be-fit-for-upcoming-asia-cup-2023-2439194","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"KL Rahul And Shreyas Iyer Doubtful For Asia Cup 2023: भारतीय क्रिकेट टीम के कई खिलाड़ी इस समय अपनी चोटों से उबर रहे हैं. इसी में 2 प्रमुख नाम केएल राहुल और श्रेयस अय्यर भी शामिल हैं. राहुल जिनको आईपीएल के 16वें सीजन के दौरान चोट लगी थी. वह सर्जरी के बाद अपनी रिहैब की प्रक्रिया को शुरू कर चुके हैं. लेकिन उनके एशिया कप तक वापसी की उम्मीद काफी कम जताई जा रही है. ऐसा ही कुछ पूरे आईपीएल सीजन से बाहर रहने वाले श्रेयस अय्यर को लेकर भी है. केएल राहुल और श्रेयस अय्यर दोनों ही खिलाड़ियों ने अपनी-अपनी चोट की सर्जरी कराई है. इसके बाद इन दोनों के एशिया कप 2023 से वापसी की उम्मीद जताई जा रही थी. अभी राहुल और अय्यर को पूरी तरह से फिट होने में अधिक समय लगेगा. राहुल जहां अभी राष्ट्रीय क्रिकेट अकादमी (NCA) में हैं. वहीं अय्यर भी अपनी रिकवरी पर ध्यान दे रहे हैं. एशिया कप 2023 का आयोजन 31 अगस्त से 17 सितंबर तक होना है. हाइब्रिड मॉडल के तहत खेले जाने वाले इस बार के एशिया कप में टीम इंडिया अपने सभी मुकाबले श्रीलंका में खेलेगी. वनडे वर्ल्ड कप की तैयारियों को देखते हुए टीम इंडिया के लिए यह बड़ा झटका माना जा सकता है. वर्ल्ड कप के लिए मुख्य टीम का एलान करने लिए 29 अगस्त की डेडलाइन आईसीसी की तरफ से निर्धारित की गई है. जसप्रीत बुमराह की फिटनेस पर आया यह अपडेट सामने पिछले साल से टीम इंडिया से बाहर चल रहे तेज गेंदबाज जसप्रीत बुमराह भी अब तेजी के साथ फिट हो रहे हैं. रिपोर्ट्स के अनुसार वह अब तक 70 फीसदी तक फिट हो चुके हैं. ऐसे में बुमराह को आयरलैंड के दौरे पर जाने वाली भारतीय टीम का हिस्सा बनाया जा सकता है. भारतीय टीम को अगस्त महीने में एशिया कप से पहले आयरलैंड के खिलाफ सीरीज खेलनी है. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","content":"KL Rahul And Shreyas Iyer Doubtful For Asia Cup 2023: भारतीय क्रिकेट टीम के कई खिलाड़ी इस समय अपनी चोटों से उबर रहे हैं. इसी में 2 प्रमुख नाम केएल राहुल और श्रेयस अय्यर भी शामिल हैं. राहुल जिनको आईपीएल के 16वें सीजन के दौरान चोट लगी थी. वह सर्जरी के बाद अपनी रिहैब की प्रक्रिया को शुरू कर चुके हैं. लेकिन उनके एशिया कप तक वापसी की उम्मीद काफी कम जताई जा रही है. ऐसा ही कुछ पूरे आईपीएल सीजन से बाहर रहने वाले श्रेयस अय्यर को लेकर भी है. केएल राहुल और श्रेयस अय्यर दोनों ही खिलाड़ियों ने अपनी-अपनी चोट की सर्जरी कराई है. इसके बाद इन दोनों के एशिया कप 2023 से वापसी की उम्मीद जताई जा रही थी. अभी राहुल और अय्यर को पूरी तरह से फिट होने में अधिक समय लगेगा. राहुल जहां अभी राष्ट्रीय क्रिकेट अकादमी (NCA) में हैं. वहीं अय्यर भी अपनी रिकवरी पर ध्यान दे रहे हैं. एशिया कप 2023 का आयोजन 31 अगस्त से 17 सितंबर तक होना है. हाइब्रिड मॉडल के तहत खेले जाने वाले इस बार के एशिया कप में टीम इंडिया अपने सभी मुकाबले श्रीलंका में खेलेगी. वनडे वर्ल्ड कप की तैयारियों को देखते हुए टीम इंडिया के लिए यह बड़ा झटका माना जा सकता है. वर्ल्ड कप के लिए मुख्य टीम का एलान करने लिए 29 अगस्त की डेडलाइन आईसीसी की तरफ से निर्धारित की गई है. जसप्रीत बुमराह की फिटनेस पर आया यह अपडेट सामने googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); पिछले साल से टीम इंडिया से बाहर चल रहे तेज गेंदबाज जसप्रीत बुमराह भी अब तेजी के साथ फिट हो रहे हैं. रिपोर्ट्स के अनुसार वह अब तक 70 फीसदी तक फिट हो चुके हैं. ऐसे में बुमराह को आयरलैंड के दौरे पर जाने वाली भारतीय टीम का हिस्सा बनाया जा सकता है. भारतीय टीम को अगस्त महीने में एशिया कप से पहले आयरलैंड के खिलाफ सीरीज खेलनी है. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","pubDate":"2023-06-25 03:41:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/f2e438e9919e0490e0eec383ffe8dd601687660128997786_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Adani launches ‘Jeetenge Hum’ campaign, 1983 team joins in","link":"http://www.newindianexpress.com/sport/cricket/2023/jun/25/adani-launches-jeetenge-hum-campaign-1983-team-joins-in-2588283.html","keywords":null,"creator":null,"video_url":null,"description":"According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. CHENNAI: The Adani Group launched a campaign for the 50-over World Cup on Saturday. On Adani Day, Adani Group collaborated with the heroes of the 1983 World Cup Cricket victory to launch the ‘Jeetenge Hum’ campaign, displaying unwavering support for Indian team for the highly anticipated ICC ODI Cricket World Cup later this year. According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. “Led by Chairman Gautam Adani, the campaign sets ablaze with heartfelt wishes, kindling outpouring of support from the 1983 World Cup-winning cricket legends and passionate fans. The campaign encourages Indian cricket fans to unite as one, and rally behind Team India with #JeetengeHum on Twitter and Instagram, backing the team’s quest for victory and boosting their morale,” said the statement. “Cricket is a binding force in our country invoking a wide spectrum of emotions. Legends are not born, they are made through resilience and perseverance. Team India must have had both these attributes that led us to win the World Cup in 1983.” “With the hope of seeing history repeat itself, join us and the legends in wishing the Indian Cricket Team for the upcoming World Cup through #JeetengeHum,” said Gautam Adani, Chairman, of Adani Group in a statement. The 1983 World Cup-winning captain, Kapil Dev, too lent his support saying, “We are honoured to unite with the Adani Group in rallying Team India for the ODI World Cup 2023. This campaign symbolises the excitement and the indomitable spirit that propelled us to victory in 1983. In preparation for the World Cup 2023, it is imperative for the team to foster a collective mindset that centers on wholeheartedly committing to giving their absolute best. The true measure of success lies not solely in the outcome, but in the unwavering dedication to the relentless pursuit of personal excellence.” Roger Binny, one of the heroes of the 1983 team and the Board of Control for Cricket in India (BCCI) president, said, “Being part of the 1983 World Cup-winning team was an incredible journey filled with determination and team spirit. Together, we believe in the potential of our current players to bring back the coveted trophy. Let’s unite as fans and inspire them to create history!”","content":"CHENNAI: The Adani Group launched a campaign for the 50-over World Cup on Saturday. On Adani Day, Adani Group collaborated with the heroes of the 1983 World Cup Cricket victory to launch the ‘Jeetenge Hum’ campaign, displaying unwavering support for Indian team for the highly anticipated ICC ODI Cricket World Cup later this year. According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. “Led by Chairman Gautam Adani, the campaign sets ablaze with heartfelt wishes, kindling outpouring of support from the 1983 World Cup-winning cricket legends and passionate fans. The campaign encourages Indian cricket fans to unite as one, and rally behind Team India with #JeetengeHum on Twitter and Instagram, backing the team’s quest for victory and boosting their morale,” said the statement. “Cricket is a binding force in our country invoking a wide spectrum of emotions. Legends are not born, they are made through resilience and perseverance. Team India must have had both these attributes that led us to win the World Cup in 1983.” “With the hope of seeing history repeat itself, join us and the legends in wishing the Indian Cricket Team for the upcoming World Cup through #JeetengeHum,” said Gautam Adani, Chairman, of Adani Group in a statement. The 1983 World Cup-winning captain, Kapil Dev, too lent his support saying, “We are honoured to unite with the Adani Group in rallying Team India for the ODI World Cup 2023. This campaign symbolises the excitement and the indomitable spirit that propelled us to victory in 1983. In preparation for the World Cup 2023, it is imperative for the team to foster a collective mindset that centers on wholeheartedly committing to giving their absolute best. The true measure of success lies not solely in the outcome, but in the unwavering dedication to the relentless pursuit of personal excellence.” Roger Binny, one of the heroes of the 1983 team and the Board of Control for Cricket in India (BCCI) president, said, “Being part of the 1983 World Cup-winning team was an incredible journey filled with determination and team spirit. Together, we believe in the potential of our current players to bring back the coveted trophy. Let’s unite as fans and inspire them to create history!”","pubDate":"2023-06-25 03:00:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"40 साल पहले लॉर्ड्स पर तिरंगा लहराने की कहानी, कपिल की कप्तानी में जीता 1983 का क्रिकेट वर्ल्डकप","link":"https://hindi.oneindia.com/news/sports/cricket/india-1983-prudential-cup-aka-icc-cricket-world-cup-lords-kapil-dev-784467.html","keywords":null,"creator":null,"video_url":null,"description":"India 1983 के 25 जून की तारीख भुला नहीं सकता। इसी दिन अंग्रेजों की सरजमीं पर तिरंगा लहराया था। कहानी क्रिकेट में चैंपियन बनने की है।","content":"खेल की दुनिया में India 1983 को कभी न भूलने वाला साल मानता है। ऐसा इसलिए क्योंकि आजादी के बाद अलग-अलग क्षेत्रों में खुद को संगठित और खड़ा करने का प्रयास कर रहा था, लेकिन खेल की दुनिया में क्रिकेट भारत के लिए बहुत चुनौतीपूर्ण था। ऐसे समय में भी कपिल देव की कप्तानी में क्रिकेट का मक्का कहे जाने वाले लॉर्ड्स क्रिकेट ग्राउंड पर भारतीय क्रिकेटर्स ने कामयाबी की ऐसी इबारत लिखी, जिसने दुनिया का ध्यान भारत की तरफ खींचा। लॉर्ड्स क्रिकेट ग्राउंड पर जब भारतीय क्रिकेटर्स केवल 183 रनों पर ऑलआउट हुए तो ऐसा लगा कि तत्कालीन वर्ल्ड चैंपियन और लगातार दो विश्वकप जीतने वाली वेस्टइंडीज भारत को कभी न भूलने वाली हार का स्वाद चखाएगी। हालांकि, क्रिकेट की दुनिया में एक बहुत मशहूर कहावत है, अनिश्चितताओं से भरा खेल और आखिरी गेंद फेंके जाने तक नतीजे केवल अनुमान होते हैं। ऐसा ही कुछ हुआ 25 जून, 1983 के दिन। सर विवियन रिचर्ड्स जैसे विस्फोटक और ऑल टाइम ग्रेट बैटर वाली वेस्टइंडीज भारतीय गेंदबाजों के सामने 183 रनों का स्कोर भी हासिल नहीं कर सकी और इंग्लैंड के लॉर्ड्स क्रिकेट ग्राउंड पर 40 साल पहले इतिहास रचा गया। आज के आईसीसी वनडे क्रिकेट वर्ल्डकप को 1983 में प्रूडेंशियल कप कहा जाता था। 1975 और 1979 के विश्वकप में अपनी बादशाहत साबित कर चुकी वेस्टइंडीज लॉर्ड्स में लगातार तीसरी बार इतिहास रचने की दहलीज पर थी। 25 जून 1983 का वो दिन ऐतिहासिक बना भी, लेकिन भारत के लिए। कपिल की कप्तानी में इंडिया के लड़ाकों ने परीकथा जैसा प्रदर्शन किया और 60 ओवर के खेल में वेस्टइंडीज को 183 रनों का टारगेट अचीव नहीं करने दिया। 52 ओवरों में वेस्टइंडीज ऑलआउट हो गई। तीन विकेट लेने वाले मोहिंदर अमरनाथ मैन ऑफ द मैच चुने गए। क्रिकेट को फॉलो करने वाले सर्वसम्मति से इस बात को मानते हैं कि 1983 की जीत स्पोर्ट्स की दुनिया में टर्निंग प्वाइंट रही है। दो वर्ल्डकप जीत चुकी टीम जिसमें विव रिचर्ड्स, क्लाइव लॉयड और गॉर्डन ग्रीनिज जैसे दिग्गज शामिल हों, उसे 183 रनों के टारगेट के सामने केवल 140 रनों पर समेट देने को अगर अश्वमेध के घोड़े थामने जैसा पराक्रम कहा जाए तो अतिश्योक्ति नहीं। विव रिचर्ड्स का जिक्र इसलिए क्योंकि उनके पास ऐसा कौशल था जिससे वे अकेले दम पर 183 रन बनाने की कूवत रखते थे। इसका सबूत एक साल से भी कम समय बाद मिला जब उन्होंने मार्च, 1984 में वनडे करियर की बेस्ट इनिंग खेली। इंग्लैंड के खिलाफ रिचर्ड्स की 189 रनों की पारी को ऑल टाइम ग्रेट में गिना जाता है। सर विव को पूरा सम्मान, लेकिन आज बात भारतीय क्रिकेट की। 25 जून की शाम का जिक्र कर कपिल देव कई बार कह चुके हैं कि उन्हें गर्व है ऐसी टीम का हिस्सा बनने पर जिसमें सीनियर्स के होने पर भी उनके कंधों पर कप्तानी का दारोमदार सौंपा गया। विश्वकप जीतने के बाद पहले लॉर्ड्स और फिर इंग्लैंड के होटलों में सेलिब्रेशन का माहौल कैसा था? इस पर कपिल ने एक इंटरव्यू में बताया था कि कई खिलाड़ियों ने वाइन का जमकर लुत्फ उठाया था। खेल समीक्षक इस ऐतिहासिक जीत का सूत्रधार कपिल को मानते हैं। ऐसा इसलिए क्योंकि पहले इसी वर्ल्डकप में कपिल ने 175 नाबाद की बेहद जरूरी और ऐतिहासिक पारी खेली और फिर फाइनल मैच में विव रिचर्ड्स का ऐसा कैच लपका जिस पर एक नजर में यकीन कर पाना आज भी मुश्किल है। मीडिया के सीमित संसाधनों के कारण लॉर्ड्स के उस ऐतिहासिक मोमेंट को आज भी दर्शक मिस करते हैं। दरअसल, फाइनल के दिन बीबीसी के लोग हड़ताल पर थे। इस कारण मैच का रुख पलटने वाले मदन लाल और अमरनाथ सरीखे लीजेंड को आज की युवा पीढ़ी रियल टाइम तस्वीरों और वीडियो से नहीं जान सकी। अंग्रेजों की सरजमीं पर सेमीफाइनल मुकाबले में इंग्लैंड को मात देकर लॉर्ड्स क्रिकेट ग्राउंड पर फाइनल का टिकट पाने वाली टीम इंडिया को अंडरडॉग माना गया। खुद मदन लाल बताते हैं कि भारत को जीत का दावेदार माना ही नहीं गया, लेकिन मैच-दर-मैच मिली जीत के बाद अगले मैच में भी जीतने की उम्मीद की रौशनी तेज होती गई। मदन लाल की नजरों में सबसे अहम बात हौसला और आत्मविश्वास न खोना रहा। फाइनल से पहले वेस्टइंडीज और ऑस्ट्रेलिया से मात खाने के बाद भी टीम एकजुट रही। जीतने का जज्बा कम नहीं हुआ। उन्होंने एक इंटरव्यू में कहा, जिम्बाब्वे के खिलाफ महज 17 रन के टोटल पर पांच बल्लेबाजों का आउट होना ऐसा था, जब लगा कि अब टूर्नामेंट से बाहर होना तय है। हालांकि, जब कपिल ने 175 रनों की पारी खेली और भारत जीत गया तो टीम का कॉन्फिडेंस अलग स्तर पर पहुंच गया। ऐसा लगा, कि जब इतनी बुरी कंडीशन से कमबैक हो सकता है तो आगे भी जीत सकते हैं। मदन लाल की नजरों में रोजर बिन्नी, कपिल देव और बलविंदर संधू के अलावा कपिल की स्विंग बॉलिंग जीत के अहम फैक्टर्स में एक रही। कपिल की कप्तानी पर अमरनाथ बताते हैं कि उनका बेफिक्र अंदाज सबसे बड़ी कुंजी रही। जैसा खेलने का अंदाज वैसी ही कप्तानी। टीम में अनुभव और युवा जोश का संतुलन था। 40 साल पुराने गोल्डन मोमेंट्स को याद कर अमरनाथ बताते हैं कि वेस्टइंडीज के 8 विकेट गिरने के बाद लगने लगा था कि वर्ल्डकप उनके कब्जे में आ चुका है। आखिरी विकेट की औपचारिकता जल्द पूरी करने की ललक थी। तत्कालीन राष्ट्रपति ज्ञानी जैल सिंह ने भी विश्वविजेता टीम के स्वदेश लौटने के बाद पूरी टीम को सम्मानित किया था। टीम भावना की मिसाल इस बात से भी मिलती है कि 14 सदस्यीय टीम में सुनील वॉल्सन एक ऐसे खिलाड़ी रहे, जिन्हें एक भी मुकाबले में मैदान पर उतरने का मौका नहीं मिल सका। वे जीत का मंजर याद कर बताते हैं कि लॉर्ड्स पर दर्शकों का हुजूम इस कदर उमड़ा कि खिलाड़ियों को पवेलियन की तरफ भागना पड़ा। आज चार दशकों के बाद जब टीम की इस ऐतिहासिक कामयाबी का जिक्र हो रहा है, कहना गलत नहीं होगा कि खेल के प्रति समर्पण और जुनून दशकों पुरानी इस एवरग्रीन टीम से सीखने की जरूरत है। खासकर ऐसे समय में जब क्रिकेट में तकनीक, पैसे और ग्लैमर का बोलबाला है।","pubDate":"2023-06-25 02:51:53","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Batting rootstar","link":"http://www.newindianexpress.com/sport/cricket/2023/jun/25/batting-rootstar-2588279.html","keywords":null,"creator":null,"video_url":null,"description":"England’s batter has not just adapted to the firebrand cricket of the team, but is thriving. Swaroop Swaminathan speaks with his formative coach to find out more about the transition. In the formative days of Bazball, England was treated to a speech by skipper Ben Stokes. The still newly-appointed captain had watched Elvis before the rescheduled fifth Test of the India — England series. Stokes, a totemic figure himself, was so inspired by what he saw on screen. Basically, Stokes, in his speech on the first morning of the Test, challenged his team to be ‘rock stars’. Easier said than done. Some have the persona ingrained in them. Others? Not so much. Joe Root, for instance, is more suited to being a class prefect than a rock star. More squeaky clean Yorkshire lad and less the Memphis’ King. But Bazball isn’t about trying and imitating something or someone. It was about creating an environment of fun, with entertainment being one of the primary currencies in town. The fine print — finding the best route to success — was the destination but there would be no arguments about the journey. Root said as much after his match-winning 100 against India in the 5th Test in July 2022. “Ben wanted us to be entertainers. He mentioned trying to be rock stars on the field,” Root had said. “It’s about trying to have fun and relish every opportunity you get to showcase what you are about and put on a show for everyone. I do not think I will ever be able to feel or look like a rock star, but for 10 seconds I might have done today.” Root may not admit it but he’s been a rockstar in England whites ever since Brendon McCullum and Stokes decided to reshape the England team in their image. If the one compelling story of Test cricket over the last year has been the side’s almost complete reversal of fortune, England’s No. 4 is the one penning some of the prose in the story. After the Ashes Down Under in the winter of 2021, Root looked broken, a leader of a ship with a broken steering and a lost compass. These days, he’s the leader of the band doing Elvis impersonations and reverse-ramping one of the best bowlers of the 21st century. To speak about Root’s last 12 months, the ideal starting point is the way he has exploited the space behind the slip cordon. According to data provided by CricViz to this daily, “Since McCullum took over, he’s played 15 scoop shots, scoring 40 runs’ in the process”. The year before that? “In 2021-22, Root played only one scoop shot off seamers, scoring one run,” CricViz added. Kevin Sharp, one of his first coaches at Yorkshire, alluded to this very shot when speaking about his former ward. “He has always been a consistent player for many years,” he told this daily. “They are playing with no fear, really. I think what has happened is that Joe too has certainly expanded his shot selection at Test level by playing some of the ramps, for example.” If the ramp is a primer to understand Root under the McCullum-Stokes combination, a wider picture is necessary to know what the No. 4 has brought to the new regime. While the likes of Jonny Bairstow, Harry Brook and Ollie Pope (all to varying degrees) have provided the ballast, Root’s essentially the one with the oil, their bellwether batter, somebody who has made telling contributions across three continents. Out of the 14 Tests he has played under Stokes, he has made a 50 or above in nine. He’s been the world leader for centuries (five), most scores above 50 (10), most fours (132) and most runs (1279). He may be considered a technically proficient batter, but he has also been able to live with the ultra-aggressive approach. His career strike rate till May 2022 was 54.65. Under the new regime, that’s jumped to 76.35 while averaging almost 18 runs more. Sharp isn’t surprised. “He has always been one of the leaders of the batting unit, he tries to put pressure on the opposition bowlers. He has been around long enough and experienced enough to be able to take on those responsibilities. “I am not surprised because he’s always thinking ahead of the game, what he needs to do to get better. When he practices, he always practices for the big occasion and the next big challenge. When he was 12, he was preparing like a county batter would do. When he was 16, he was preparing like a Test batter.” While the debate in India continues about the benefits of featuring in the IPL before a big-ticket red-ball series, Root opined that featuring in the IPL was better preparation for this year’s Ashes than turning out for Yorkshire. “Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here. I am not saying it’s not important or a good standard. (But) for where I am in my career, am I going to learn more about myself in that environment,” he had told UK media during the Test against Ireland in early June. “Am I really going to be prepared better for an Ashes series facing lower-pace bowling on some nibbly wickets, when hopefully we will play on good pitches against high pace and a high-quality spinner? I don’t think so. By going to the IPL, learning and experiencing something new, and discussing the game with some of the greats, like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year, it would set me up best. I feel ready, I have another week’s prep and some time together as a squad.” Sharp provides further insight. “He’s (Root) is very versatile,” he said. “There’s a difference between playing cricket and knowing how to play cricket... the very fact that the England management allowed these guys to play the IPL just before the Ashes is a vote of confidence. We know you can play Test cricket. Go out there and come back with those experiences and use them in the Test arena.” Speaking with former players, Sharp says, is also something Root likes to do. Especially to work on the mental side of his game. As an example, when he faced the problem of converting 50s into 100s. “He would talk to other players, past players, talk to psychologists, talk to anyone who would give him the necessary information to help him with the process. Now he’s so wise and smart... he’s probably had so many experiences, and he’s now revelling in the fact that he can try something in an environment that allows him to do so. If you make a mistake, ‘it’s okay’.” That, ultimately, is Root’s batting. Distilled to its very essence.","content":"In the formative days of Bazball, England was treated to a speech by skipper Ben Stokes. The still newly-appointed captain had watched Elvis before the rescheduled fifth Test of the India — England series. Stokes, a totemic figure himself, was so inspired by what he saw on screen. Basically, Stokes, in his speech on the first morning of the Test, challenged his team to be ‘rock stars’. Easier said than done. Some have the persona ingrained in them. Others? Not so much. Joe Root, for instance, is more suited to being a class prefect than a rock star. More squeaky clean Yorkshire lad and less the Memphis’ King. But Bazball isn’t about trying and imitating something or someone. It was about creating an environment of fun, with entertainment being one of the primary currencies in town. The fine print — finding the best route to success — was the destination but there would be no arguments about the journey. Root said as much after his match-winning 100 against India in the 5th Test in July 2022. “Ben wanted us to be entertainers. He mentioned trying to be rock stars on the field,” Root had said. “It’s about trying to have fun and relish every opportunity you get to showcase what you are about and put on a show for everyone. I do not think I will ever be able to feel or look like a rock star, but for 10 seconds I might have done today.” Root may not admit it but he’s been a rockstar in England whites ever since Brendon McCullum and Stokes decided to reshape the England team in their image. If the one compelling story of Test cricket over the last year has been the side’s almost complete reversal of fortune, England’s No. 4 is the one penning some of the prose in the story. After the Ashes Down Under in the winter of 2021, Root looked broken, a leader of a ship with a broken steering and a lost compass. These days, he’s the leader of the band doing Elvis impersonations and reverse-ramping one of the best bowlers of the 21st century. To speak about Root’s last 12 months, the ideal starting point is the way he has exploited the space behind the slip cordon. According to data provided by CricViz to this daily, “Since McCullum took over, he’s played 15 scoop shots, scoring 40 runs’ in the process”. The year before that? “In 2021-22, Root played only one scoop shot off seamers, scoring one run,” CricViz added. Kevin Sharp, one of his first coaches at Yorkshire, alluded to this very shot when speaking about his former ward. “He has always been a consistent player for many years,” he told this daily. “They are playing with no fear, really. I think what has happened is that Joe too has certainly expanded his shot selection at Test level by playing some of the ramps, for example.” If the ramp is a primer to understand Root under the McCullum-Stokes combination, a wider picture is necessary to know what the No. 4 has brought to the new regime. While the likes of Jonny Bairstow, Harry Brook and Ollie Pope (all to varying degrees) have provided the ballast, Root’s essentially the one with the oil, their bellwether batter, somebody who has made telling contributions across three continents. Out of the 14 Tests he has played under Stokes, he has made a 50 or above in nine. He’s been the world leader for centuries (five), most scores above 50 (10), most fours (132) and most runs (1279). He may be considered a technically proficient batter, but he has also been able to live with the ultra-aggressive approach. His career strike rate till May 2022 was 54.65. Under the new regime, that’s jumped to 76.35 while averaging almost 18 runs more. Sharp isn’t surprised. “He has always been one of the leaders of the batting unit, he tries to put pressure on the opposition bowlers. He has been around long enough and experienced enough to be able to take on those responsibilities. “I am not surprised because he’s always thinking ahead of the game, what he needs to do to get better. When he practices, he always practices for the big occasion and the next big challenge. When he was 12, he was preparing like a county batter would do. When he was 16, he was preparing like a Test batter.” While the debate in India continues about the benefits of featuring in the IPL before a big-ticket red-ball series, Root opined that featuring in the IPL was better preparation for this year’s Ashes than turning out for Yorkshire. “Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here. I am not saying it’s not important or a good standard. (But) for where I am in my career, am I going to learn more about myself in that environment,” he had told UK media during the Test against Ireland in early June. “Am I really going to be prepared better for an Ashes series facing lower-pace bowling on some nibbly wickets, when hopefully we will play on good pitches against high pace and a high-quality spinner? I don’t think so. By going to the IPL, learning and experiencing something new, and discussing the game with some of the greats, like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year, it would set me up best. I feel ready, I have another week’s prep and some time together as a squad.” Sharp provides further insight. “He’s (Root) is very versatile,” he said. “There’s a difference between playing cricket and knowing how to play cricket... the very fact that the England management allowed these guys to play the IPL just before the Ashes is a vote of confidence. We know you can play Test cricket. Go out there and come back with those experiences and use them in the Test arena.” Speaking with former players, Sharp says, is also something Root likes to do. Especially to work on the mental side of his game. As an example, when he faced the problem of converting 50s into 100s. “He would talk to other players, past players, talk to psychologists, talk to anyone who would give him the necessary information to help him with the process. Now he’s so wise and smart... he’s probably had so many experiences, and he’s now revelling in the fact that he can try something in an environment that allows him to do so. If you make a mistake, ‘it’s okay’.” That, ultimately, is Root’s batting. Distilled to its very essence.","pubDate":"2023-06-25 02:49:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"2023 ODI वर्ल्ड कप के बाद किसे मिलनी चाहिए टीम इंडिया की कप्तानी? रवि शास्त्री ने बताई अपनी पसंद","link":"https://www.abplive.com/sports/cricket/who-should-get-captaincy-of-team-india-after-2023-odi-world-cup-ravi-shastri-took-name-of-hardik-pandya-2439199","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Ravi Shastri Named Hardik Pandya New White Ball Captain: इस साल के अंत में भारत में खेले जाने वाले 2023 वनडे वर्ल्ड कप के बाद संभवत: भारतीय क्रिकेट टीम को सीमित ओवर की क्रिकेट में एक नया कप्तान मिल जाएगा. हालांकि, इसकी चर्चा अभी से शुरू हो गई है. इस बीच टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने बताया है कि वनडे वर्ल्ड कप के बाद किसे टीम इंडिया की कप्तानी मिलनी चाहिए.  रवि शास्त्री का मानना है कि 2023 वनडे वर्ल्ड कप के बाद रोहित शर्मा से वनडे और टी20 इंटरनेशनल की कप्तानी छीन लेनी चाहिए और हार्दिक पांड्या को दोनों फॉर्मेट में नियमित कप्तान बना देना चाहिए. बता दें कि 2022 टी20 वर्ल्ड कप में भारत के खराब प्रदर्शन के बाद से हार्दिक ही टी20 में कप्तानी कर रहे हैं.  द वीक को दिए इंटरव्यू में पूर्व हेड कोच रवि शास्त्री ने कहा, \"मुझे लगता है कि हार्दिक पांड्या की बॉडी टेस्ट क्रिकेट का सामना नहीं कर पाएगी. ऐसे में 2023 वनडे वर्ल्ड कप के बाद उन्हें सीमित ओवरों की कप्तानी संभालनी चाहिए. वर्ल्ड कप में रोहित शर्मा कप्तान होंगे, इसमें कोई शक नहीं है.\" हार्दिक आईपीएल से बने कप्तानी के दावेदार गौरतलब है कि पहले टीम इंडिया के भविष्य के कप्तान के रूप में ऋषभ पंत और केएल राहुल को देखा जा रहा था. फिर इस लिस्ट में श्रेयस अय्यर का नाम भी जुड़ा. हालांकि, इसके बाद आईपीएल 2022 में गुजरात टाइटंस ने हार्दिक पांड्या को अपनी टीम की कप्तानी सौंपी, फिर क्या था मानो हार्दिक के तेवर ही बदल गए. पहली बार कप्तानी में ही हार्दिक ने गुजरात को खिताब जिता दिया और फिर हर कोई उनकी कप्तानी का मुरीद हो गया.  इसके बाद 2022 टी20 वर्ल्ड कप के बाद हार्दिक को भारत की टी20 टीम का कप्तान बनाया गया. यहां भी उन्होंने दिग्गजों को अपनी कप्तानी से प्रभावित किया. फिर आईपीएल 2023 में उनकी कप्तानी में गुजरात ने फाइनल तक का सफर तय किया. अब हर कोई हार्दिक को भविष्य के कप्तान के रूप में देख रहा है.  यह भी पढ़ें... AUSW vs ENGW: टैमी ब्यूमोंट के नाम दर्ज हुआ ऐतिहासिक रिकॉर्ड, इंग्लैंड महिला टीम के लिए दोहरा शतक लगाने वाली पहली बल्लेबाज","content":"Ravi Shastri Named Hardik Pandya New White Ball Captain: इस साल के अंत में भारत में खेले जाने वाले 2023 वनडे वर्ल्ड कप के बाद संभवत: भारतीय क्रिकेट टीम को सीमित ओवर की क्रिकेट में एक नया कप्तान मिल जाएगा. हालांकि, इसकी चर्चा अभी से शुरू हो गई है. इस बीच टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने बताया है कि वनडे वर्ल्ड कप के बाद किसे टीम इंडिया की कप्तानी मिलनी चाहिए. रवि शास्त्री का मानना है कि 2023 वनडे वर्ल्ड कप के बाद रोहित शर्मा से वनडे और टी20 इंटरनेशनल की कप्तानी छीन लेनी चाहिए और हार्दिक पांड्या को दोनों फॉर्मेट में नियमित कप्तान बना देना चाहिए. बता दें कि 2022 टी20 वर्ल्ड कप में भारत के खराब प्रदर्शन के बाद से हार्दिक ही टी20 में कप्तानी कर रहे हैं. द वीक को दिए इंटरव्यू में पूर्व हेड कोच रवि शास्त्री ने कहा, \"मुझे लगता है कि हार्दिक पांड्या की बॉडी टेस्ट क्रिकेट का सामना नहीं कर पाएगी. ऐसे में 2023 वनडे वर्ल्ड कप के बाद उन्हें सीमित ओवरों की कप्तानी संभालनी चाहिए. वर्ल्ड कप में रोहित शर्मा कप्तान होंगे, इसमें कोई शक नहीं है.\" हार्दिक आईपीएल से बने कप्तानी के दावेदार googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); गौरतलब है कि पहले टीम इंडिया के भविष्य के कप्तान के रूप में ऋषभ पंत और केएल राहुल को देखा जा रहा था. फिर इस लिस्ट में श्रेयस अय्यर का नाम भी जुड़ा. हालांकि, इसके बाद आईपीएल 2022 में गुजरात टाइटंस ने हार्दिक पांड्या को अपनी टीम की कप्तानी सौंपी, फिर क्या था मानो हार्दिक के तेवर ही बदल गए. पहली बार कप्तानी में ही हार्दिक ने गुजरात को खिताब जिता दिया और फिर हर कोई उनकी कप्तानी का मुरीद हो गया. इसके बाद 2022 टी20 वर्ल्ड कप के बाद हार्दिक को भारत की टी20 टीम का कप्तान बनाया गया. यहां भी उन्होंने दिग्गजों को अपनी कप्तानी से प्रभावित किया. फिर आईपीएल 2023 में उनकी कप्तानी में गुजरात ने फाइनल तक का सफर तय किया. अब हर कोई हार्दिक को भविष्य के कप्तान के रूप में देख रहा है. यह भी पढ़ें... AUSW vs ENGW: टैमी ब्यूमोंट के नाम दर्ज हुआ ऐतिहासिक रिकॉर्ड, इंग्लैंड महिला टीम के लिए दोहरा शतक लगाने वाली पहली बल्लेबाज","pubDate":"2023-06-25 02:42:11","image_url":"https://wcstatic.abplive.in/en/prod/wp-content/uploads/2018/08/veUZ6GQ6p7.JPG","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"1983 World Cup: 40 साल पहले आज ही के दिन भारत ने रचा था इतिहास, वर्ल्ड चैंपियन बन दुनिया को किया हैरान","link":"https://hindi.oneindia.com/news/sports/cricket/on-this-day-40-years-ago-india-win-the-1983-world-cup-know-here-details-784509.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट इतिहास में आज के दिन की अहमियत बहुत ज्यादा है। 25 जून 1983 को भारत ने पहली बार वर्ल्ड कप का खिताब जीता था। भारतीय टीम को इस वर्ल्ड कप में जीत का दावेदार नहीं माना जा रहा था। लेकिन टीम इंडिया ने खिताब अपने नाम कर सभी को हैरान कर दिया।","content":"भारतीय पूर्व दिग्गज ऑलराउंडर कपिल देव की कप्तानी में टीम ने पहली बार 25 जून को वर्ल्ड के खिताब पर कब्जा जमाया था। आज से ठीक 40 साल पहले लंदन के लॉर्ड्स मैदान पर लगातार 2 बार वर्ल्ड कप जीत चुकी वेस्टइंडीज को हराकर भारत ने जीत दर्ज की। भारत की इस जीत से पूरी दुनिया हैरान रह गई थी। भारतीय टीम वर्ल्ड कप जीत जाएगी, इस बात की उम्मीद किसी को नहीं थी। भारत के सामने वेस्टइंडीज का पलड़ा भारी दिखाई पड़ रहा था। लेकिन भारतीय गेंदबाजों की जबरदस्त बॉलिंग की बदौलत भारत ने इस मुकाबले को अपने नाम किया। भारत की इस जीत में कप्तान कपिल देव का भी बड़ा हाथ रहा था। वर्ल्ड कप के फाइनल मुकाबले में भारतीय टीम ने पहले बल्लेबाजी करते हुए 183 रन बनाए थे। भारतीय टीम के स्कोर को देखकर ऐसा लग रहा था कि वेस्टइंडीज की टीम इस मुकाबले को आसानी से जीत जाएगी। लेकिन भारतीय गेंदबाजों ने ऐसा होने नहीं दिया। भारत ने वेस्टइंडीज टीम को महज 140 रन पर ऑलआउट कर खिताब अपने नाम किया। फाइनल मैच में भारत की और से मदन लाल और मोहिंदर अमरनाथ ने तीन-तीन विकेट झटकने का काम किया था। इन दोनों की जबरदस्त गेंदबाजी के कारण ही भारत इस मुकाबले को आसानी से जीतने में सफल रहा। इस मैच में भारत के लिए कोई भी बल्लेबाज अर्धशतक नहीं लगा सका था। कृष्माचारी श्रीकांत ने टीम के लिए सबसे अधिक 38 रन बनाए थे। सुनील गावस्कर, क्रिस श्रीकांत, मोहिंदर अमरनाथ, यशपाल शर्मा, संदीप पाटिल, कपिल देव (कप्तान), कीर्ति आजाद, रोजर बिन्नी, मदन लाल, सैयद किरमानी (विकेटकीपर), बलविंदर संधू। सर गॉर्डन ग्रीनिज, डेसमंड हेन्स, सर विव रिचर्ड्स, सर क्लाइव लॉयड (कप्तान), लैरी गोम्स, फौड बाचस, जेफ डुजॉन (विकेटकीपर), मैल्कम मार्शल, सर एंडी रॉबर्ट्स, जोएल गार्नर, माइकल होल्डिंग। It's been 40 years now since India won their maiden World Cup, in England. The Kapil Dev led side created history beating public favorites WI in the Final. Mohinder Amarnath won POTM awards in the Semis and the Final. A victory that changed the future of cricket in India.","pubDate":"2023-06-25 02:41:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"दो करारी हार, फिर पलटवार... 1983 वर्ल्ड कप में पहले मैच से फाइनल तक कैसा था टीम इंडिया का सफर","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/team-india-path-to-victory-in-1983-world-cup/articleshow/101251828.cms","keywords":null,"creator":null,"video_url":null,"description":"1983 World Cup: भारत ने 1983 वर्ल्ड कप का खिताब आज ही के दिन जीता था। कपिल देव की कप्तानी में भारतीय टीम एक समय टूर्नामेंट में मुश्किल स्थिति में थी। लगातार दो मैच में भारत को वेस्टइंडीज और ऑस्ट्रेलिया से हार मिली थी। लेकिन इसके बाद टीम ने पलटवार किया।","content":"40 साल पहले भारत ने आज ही के दिन नामुमकिन को मुमकिन कर दिया है। कपिल देव की कप्तानी में भारत ने वेस्टइंडीज को हराकर 1983 वर्ल्ड कप को अपने नाम किया था। 1983 से पहले 1975 और 1979 वर्ल्ड कप खेला गया था। इन दोनों टूर्नामेंट को मिलाकर भारत ने सिर्फ एक ही मैच जीता था। वहीं वेस्टइंडीज पहले दो वर्ल्ड कप की चैंपियन थी और तीसरे में भी जीत की प्रबल दावेदार। इसके बाद भी भारत ने सभी को चौंकाते हुए टूर्नामेंट को अपने नाम किया। इसी वर्ल्ड कप के बाद से भारत में क्रिकेट की सूरत बदल गई। हम आपको टूर्नामेंट में भारत के सफर के बारे में बताते हैं। भारत ने अपने पहले ही मुकाबले में वेस्टइंडीज को हरा दिया था। मैनचेस्टर में खेले गए मुकाबले में टीम इंडिया ने यशपाल शर्मा की 89 रनों की पारी की मदद से 262 रन बनाए। तब वनडे मुकाबले 60 ओवर के होते थे। रोजर बिन्नी और रवि शास्त्री ने 3-3 विकेट लेकर भारत को 34 रनों से जीत दिला दी। भारत ने इसके बाद जिम्बाब्वे को 5 विकेट से हराया। इस मैच में पहले खेलते हुए जिम्बाब्वे ने 155 रन बनाए। मदन लाल को तीन विकेट मिले। भारत ने 5 विकेट खोकर लक्ष्य हासिल कर लिया। संदीप पाटिल ने अर्धशतकीय पारी खेली। भारत को इसके बाद लगातार दो मैचों में हार मिली। ऑस्ट्रेलिया ने 162 रनों के बड़े अंतर से हराया। फिर वेस्टइंडीज के खिलाफ 66 रनों की हार मिली। ऑस्ट्रेलिया वाले मुकाबले में ट्रेवर चैपल ने 110 और वेस्टइंडीज वाले मुकाबले में विव रिचर्ड्स ने 119 रनों की पारी खेली। जिम्बाब्वे के खिलाफ मुकाबले में भारतीय टीम ने 17 रन पर 5 विकेट खो दिए थे। इसके बाद कपिल देव ने ऐतिहासिक 175 रनों की पारी खेली। यह वनडे में किसी भी भारतीय बल्लेबाज का पहला शतक था। इस शतक ने भारत को 266 रनों तक पहुंचा दिया। जिम्बाब्वे की पारी 235 रनों पर ही सिमट गई। अपने आखिरी ग्रुप मुकाबले में भारत ने ऑस्ट्रेलिया से हार का बदला ले लिया। पहले बैटिंग करते हुए भारत ने 247 रन बनाए। ऑस्ट्रेलिया की मजबूत बैटिंग लाइन सिर्फ 129 रनों पर सिमट गई। बीसीसीआई के वर्तमान अध्यक्ष रोजर बिन्नी ने 29 रन देकर 4 विकेट लिए। सेमीफाइनल मुकाबले में भारत के सामने मेजबान इंग्लैंड की चुनौती थी। इंग्लिश पारी 213 रनों पर सिमट गई। उनका कोई बल्लेबाज 40 तक भी नहीं पहुंच पाया। कपिल देव को 3 जबकि रोजर बिन्नी और मोहिंदर अमरनाथ को 2-2 विकेट मिले। संदीप सिंह की 32 गेंदों पर 51 रनों की तूफानी पारी ने भारत को जीत दिला दी। यशपाल शर्मा ने 61 जबकि मोहिंदर अमरनाथ ने 46 रनों की पारी खेली। भारत ने फाइनल मैच में पहले बैटिंग करते हुए 183 रन बनाए। श्रीकांत ने 38 रनों की पारी खेली। वेस्टइंडीज के लिए सर एंडी रॉबर्ट्स ने 3 विकेट लिए। मैल्कम मार्शल और माइकल होल्डिंग को 2-2 विकेट मिले। वेस्टइंडीज की खूंखार बैंटिंग के सामने यह आसान लक्ष्य लग रहा था। विव रिचर्ड्स तूफानी अंदाज में बैटिंग भी कर रहे थे। लेकिन 28 गेंदों पर 33 रन बनाकर वह आउट हुए और वेस्टइंडीज की पारी पटरी से उतर गई। कैरेबियन टीम 140 पर ऑलआउट हो गई। भारत ने मैच को 43 रनों से जीतकर खिताब अपने नाम कर लिया।","pubDate":"2023-06-25 05:33:52","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"...तो खत्म हो गया श्रेयर अय्यर का करियर! इंजरी के चलते एशिया कप के साथ WC भी खेलना मुश्किल","link":"https://navbharattimes.indiatimes.com/sports/cricket/asia-cup/shreyas-iyer-in-doubt-for-asia-cup-and-world-cup/articleshow/101251505.cms","keywords":null,"creator":null,"video_url":null,"description":"Shreyas Iyer: मुंबई के बेहद प्रतिभावान बल्लेबाज का करियर इंजरी की वजह से चौपट होता नजर आ रहा है। सर्जरी के बावजूद श्रेयस अय्यर पीठ की चोट से उबर ही नहीं पा रहे हैं।","content":"भारतीय क्रिकेट टीम के लिए बुरी खबर है। इंजर्ड प्लेयर्स वापसी के लिए जूझ रहे हैं। वनडे वर्ल्ड कप ईयर में यह टीम इंडिया के लिए किसी झटके से कम नहीं है। खबर है कि मिडिल ऑर्डर के मुख्य बल्लेबाज श्रेयस अय्यर अबतक इंजरी से उबर नहीं पाए हैं, उनकी एशिया कप में मौजूदगी भी संदिग्ध है। हमारे सहयोगी टाइम्स ऑफ इंडिया के सूत्रों ने बताया कि अगस्त-सितंबर में होने वाले एशिया कप तक अय्यर शायद ही फिट हो पाए। अप्रैल में श्रेयस अय्यर ने सर्जरी करवाई थी, जिसके बाद वह वर्ल्ड टेस्ट चैंपियनशिप में नहीं खेल पाए थे और अब उन्हें जुलाई-अगस्त में होने वाले वेस्टइंडीज दौरे के लिए भी नहीं चुना गया है। सूत्रों की माने तो अय्यर ने हाल ही में नेशनल क्रिकेट अकादमी में पीठ के दर्द से परेशान होकर इंजेक्शन लगाया था। सफल ऑपरेशन के बावजूद उनका बैक परेशान कर रहा है। सर्जरी के वक्त श्रेयस अय्यर के दिमाग में वर्ल्ड कप तक वापसी की योजना चल रही थी, लेकिन मौजूदा हालातों को देखते हुए उनका एशिया कप में भी खेलना मुश्किल लग रहा है। 28 साल के श्रेयस अय्यर मुंबई से आते हैं। 2017 में डेब्यू करने के बाद से बीते कुछ साल में वह टीम के अहम सदस्य बन गए थे। 2021 में तो उन्हें टेस्ट पदार्पण का भी मौका मिल गया, लेकिन लगातार चोटिल होने के चलते वह टीम में अपनी जगह नहीं बचा पाते। आईपीएल में कोलकाता नाइटराइडर्स की कप्तानी करने वाले श्रेयस अय्यर 2023 का पूरा सीजन ही नहीं खेल पाए। इस बीच हमारे सूत्रों ने ये भी बताया कि वर्ल्ड कप के बहुप्रतीक्षित शेड्यूल का ऐलान इसी हफ्ते हो जाएगा। मेजबान शहरों का नाम तय हो चुका है, सिर्फ औपचारिक घोषणा ही बची है।","pubDate":"2023-06-25 04:53:22","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI: 'मेरे चयन की खबर सुन पिताजी की आंखों में आ गए थे आंसू', यशस्वी जायसवाल ने बताया कैसा था परिवार का रिएक्शन","link":"https://www.abplive.com/sports/cricket/yashasvi-jaiswal-says-my-father-started-crying-after-hearing-the-news-of-my-selection-in-indian-team-for-west-indies-tour-2439223","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Yashasvi Jaiswal, India vs West Indies: वेस्टइंडीज दौरे के लिए 23 जून को टेस्ट और वनडे सीरीज के लिए भारतीय टीम का एलान किया गया था. 2 मैचों की टेस्ट सीरीज के लिए टीम में बाएं हाथ के युवा बल्लेबाज यशस्वी जायसवाल को भी जगह मिली है. वर्ल्ड टेस्ट चैंपियनशिप (WTC) फाइनल मुकाबले में जायसवाल को टीम के साथ रिजर्व खिलाड़ी के तौर पर जोड़ा गया था. अब टेस्ट टीम में चयन होने के बाद यशस्वी ने पहली बार अपनी और परिवार की प्रतिक्रिया के बारे में खुलकर बात की है. यशस्वी जायसवाल ने अपने चयन के कुछ समय बाद ही पीटीआई को दिए बयान में बताया कि जब मेरे चयन की खबर मेरे पिता को मिली तो वह रोने लगे थे. अभी मैं अपनी मां से नहीं मिला हूं, कुछ समय के बाद मैं उनसे भी मिलने जाऊंगा. विंडीज सीरीज की तैयारियों के लिए यशस्वी जायसवाल को दौरे पर रवाना होने से पहले बेंगलुरु स्थित राष्ट्रीय क्रिकेट अकादमी में अगले कुछ दिनों तक समय बिताना है. इसको लेकर जायसवाल ने कहा कि टीम में चयन होने के बाद मैं काफी अच्छा महसूस कर रहा हूं. मैं अपना सर्वश्रेष्ठ प्रदर्शन करने की कोशिश करूंगा. मैं उत्साहित जरूर हूं, लेकिन मैदान पर खुद को साबित भी करना चाहता हूं. टीम में चयन होने के बाद आपको थोड़ी बेचैनी होती है, लेकिन यह अच्छा अहसास भी है. सीनियर खिलाड़ियों से काफी कुछ सीखा अपनी तैयारियों को लेकर यशस्वी जायसवाल ने आगे कहा कि उन्होंने इस दौरे की तैयारी को लेकर कप्तान रोहित शर्मा, विराट कोहली और अजिंक्य रहाणे से बात की है. सबसे बातचीत में एक चीज जो सामने आई वह यह कि मुझे अपनी चीजों को आसान रखने की कोशिश करनी होगी. मैंने इन सभी से काफी कुछ सीखा है. लेकिन जब आप मैदान पर खेल रहे होते हैं तो चीजें आपको ही करनी होती हैं. यह भी पढ़ें... Watch: फील्डिंग टीम की गलती से रन आउट हुए बल्लेबाज! देखें सोशल मीडिया पर वायरल वीडियो","content":"Yashasvi Jaiswal, India vs West Indies: वेस्टइंडीज दौरे के लिए 23 जून को टेस्ट और वनडे सीरीज के लिए भारतीय टीम का एलान किया गया था. 2 मैचों की टेस्ट सीरीज के लिए टीम में बाएं हाथ के युवा बल्लेबाज यशस्वी जायसवाल को भी जगह मिली है. वर्ल्ड टेस्ट चैंपियनशिप (WTC) फाइनल मुकाबले में जायसवाल को टीम के साथ रिजर्व खिलाड़ी के तौर पर जोड़ा गया था. अब टेस्ट टीम में चयन होने के बाद यशस्वी ने पहली बार अपनी और परिवार की प्रतिक्रिया के बारे में खुलकर बात की है. यशस्वी जायसवाल ने अपने चयन के कुछ समय बाद ही पीटीआई को दिए बयान में बताया कि जब मेरे चयन की खबर मेरे पिता को मिली तो वह रोने लगे थे. अभी मैं अपनी मां से नहीं मिला हूं, कुछ समय के बाद मैं उनसे भी मिलने जाऊंगा. विंडीज सीरीज की तैयारियों के लिए यशस्वी जायसवाल को दौरे पर रवाना होने से पहले बेंगलुरु स्थित राष्ट्रीय क्रिकेट अकादमी में अगले कुछ दिनों तक समय बिताना है. इसको लेकर जायसवाल ने कहा कि टीम में चयन होने के बाद मैं काफी अच्छा महसूस कर रहा हूं. मैं अपना सर्वश्रेष्ठ प्रदर्शन करने की कोशिश करूंगा. मैं उत्साहित जरूर हूं, लेकिन मैदान पर खुद को साबित भी करना चाहता हूं. टीम में चयन होने के बाद आपको थोड़ी बेचैनी होती है, लेकिन यह अच्छा अहसास भी है. सीनियर खिलाड़ियों से काफी कुछ सीखा googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); अपनी तैयारियों को लेकर यशस्वी जायसवाल ने आगे कहा कि उन्होंने इस दौरे की तैयारी को लेकर कप्तान रोहित शर्मा, विराट कोहली और अजिंक्य रहाणे से बात की है. सबसे बातचीत में एक चीज जो सामने आई वह यह कि मुझे अपनी चीजों को आसान रखने की कोशिश करनी होगी. मैंने इन सभी से काफी कुछ सीखा है. लेकिन जब आप मैदान पर खेल रहे होते हैं तो चीजें आपको ही करनी होती हैं. यह भी पढ़ें... Watch: फील्डिंग टीम की गलती से रन आउट हुए बल्लेबाज! देखें सोशल मीडिया पर वायरल वीडियो","pubDate":"2023-06-25 04:10:13","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/ba714fc6fa0ae88330f31b1d0941835c1687663905650786_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"World Cup Qualifiers: इन तीन टीमों का वर्ल्ड कप खेलने का सपना टूटा, अब 6 टीमों के बीच सुपर-10 में पहुंचने की होगी जंग","link":"https://www.abplive.com/sports/cricket/icc-cricket-world-cup-qualifiers-2023-points-table-nepal-united-states-uae-aireland-out-of-race-2439235","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"World Cup Qualifiers 2023 Points Table: जिम्बाब्वे में 18 जून से 2023 वनडे वर्ल्ड कप के क्वालीफायर मैच खेले जा रहे हैं. 10 टीमों के बीच वनडे वर्ल्ड कप के बचे दो स्थानों के लिए जंग हो रही थी. अब इनमें से चार टीमों का वर्ल्ड कप में पहुंचने का सपना टूट गया है. बीते शनिवार को होस्ट जिम्बाब्वे में वेस्टइंडीज को हराया और पूरी तरह से प्वाइंट्स टेबल को बदल दिया.  अभी तक आधिकारिक तौर पर नेपाल, यूनाइटेड स्टेट्स और यूएई की टीम वर्ल्ड कप के सुपर-10 में पहुंचने की रेस से बाहर हुई हैं. हालांकि, आयरलैंड भी अपने पहले दो मैच हार चुकी है. आज उसका मुकाबला श्रीलंका से होगा. अगर आज आयरलैंड हार जाती है तो वो भी वनडे वर्ल्ड कप के मेन इवेंट में पहुंचने की रेस से बाहर हो जाएगी.  प्वाइंट्स टेबल का ताज़ा हाल बता दें कि क्वालीफायर राउंड में 10 टीमों को दो ग्रुप में बांटा गया है. ग्रुप ए से जिम्बाब्वे, नीदरलैंड और वेस्टइंडीज ने सुपर-6 के लिए क्वालीफाई किया है. वहीं ग्रुप बी से अभी कोई भी टीम सुपर-6 में नहीं पहुंची है. हालांकि, श्रीलंका, ओमान और स्कॉटलैंड के सुपर-6 में जाने के सबसे ज्यादा चांस हैं.  टॉप-2 टीमें करेंगे मेन इवेंट में क्वालीफाई  आपकी जानकारी के लिए बता दें कि 2023 वनडे वर्ल्ड कप 10 टीमों के बीच खेला जाएगा. इसके लिए आठ टीमें सीधे तौर पर क्वालीफाई हो चुकी हैं. वहीं अंतिम दो टीमें क्वालीफाइंग राउंड से पहुंचेंगी.  इन आठ टीमों ने सीधे तौर पर किया क्वालीफाई 2023 वनडे वर्ल्ड कप के लिए होस्ट भारत, पाकिस्तान, बांग्लादेश, अफगानिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, ऑस्ट्रेलिया और इंग्लैंड ने सीधे तौर पर क्वालीफाई किया है. अब बाकी दो टीमें क्वालीफायर राउंड से आएंगी. फिर अक्टूबर-नवंबर में मेन इवेंट खेला जाएगा. अपने घर पर खेलने की वजह से टीम इंडिया वर्ल्ड कप में बतौर फेवरेट उतरेगी.  यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","content":"World Cup Qualifiers 2023 Points Table: जिम्बाब्वे में 18 जून से 2023 वनडे वर्ल्ड कप के क्वालीफायर मैच खेले जा रहे हैं. 10 टीमों के बीच वनडे वर्ल्ड कप के बचे दो स्थानों के लिए जंग हो रही थी. अब इनमें से चार टीमों का वर्ल्ड कप में पहुंचने का सपना टूट गया है. बीते शनिवार को होस्ट जिम्बाब्वे में वेस्टइंडीज को हराया और पूरी तरह से प्वाइंट्स टेबल को बदल दिया. अभी तक आधिकारिक तौर पर नेपाल, यूनाइटेड स्टेट्स और यूएई की टीम वर्ल्ड कप के सुपर-10 में पहुंचने की रेस से बाहर हुई हैं. हालांकि, आयरलैंड भी अपने पहले दो मैच हार चुकी है. आज उसका मुकाबला श्रीलंका से होगा. अगर आज आयरलैंड हार जाती है तो वो भी वनडे वर्ल्ड कप के मेन इवेंट में पहुंचने की रेस से बाहर हो जाएगी. प्वाइंट्स टेबल का ताज़ा हाल बता दें कि क्वालीफायर राउंड में 10 टीमों को दो ग्रुप में बांटा गया है. ग्रुप ए से जिम्बाब्वे, नीदरलैंड और वेस्टइंडीज ने सुपर-6 के लिए क्वालीफाई किया है. वहीं ग्रुप बी से अभी कोई भी टीम सुपर-6 में नहीं पहुंची है. हालांकि, श्रीलंका, ओमान और स्कॉटलैंड के सुपर-6 में जाने के सबसे ज्यादा चांस हैं. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); टॉप-2 टीमें करेंगे मेन इवेंट में क्वालीफाई आपकी जानकारी के लिए बता दें कि 2023 वनडे वर्ल्ड कप 10 टीमों के बीच खेला जाएगा. इसके लिए आठ टीमें सीधे तौर पर क्वालीफाई हो चुकी हैं. वहीं अंतिम दो टीमें क्वालीफाइंग राउंड से पहुंचेंगी. इन आठ टीमों ने सीधे तौर पर किया क्वालीफाई 2023 वनडे वर्ल्ड कप के लिए होस्ट भारत, पाकिस्तान, बांग्लादेश, अफगानिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, ऑस्ट्रेलिया और इंग्लैंड ने सीधे तौर पर क्वालीफाई किया है. अब बाकी दो टीमें क्वालीफायर राउंड से आएंगी. फिर अक्टूबर-नवंबर में मेन इवेंट खेला जाएगा. अपने घर पर खेलने की वजह से टीम इंडिया वर्ल्ड कप में बतौर फेवरेट उतरेगी. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","pubDate":"2023-06-25 04:04:42","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/a8060b5404f029792c52bd55ecc650951687664944098143_original.jpeg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Asia Cup 2023: टीम इंडिया के लिए बुरी खबर, एशिया कप तक इन 2 स्टार खिलाड़ियों के फिट होने की उम्मीद कम","link":"https://www.abplive.com/sports/cricket/kl-rahul-and-shreyas-iyer-unlikely-to-be-fit-for-upcoming-asia-cup-2023-2439194","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"KL Rahul And Shreyas Iyer Doubtful For Asia Cup 2023: भारतीय क्रिकेट टीम के कई खिलाड़ी इस समय अपनी चोटों से उबर रहे हैं. इसी में 2 प्रमुख नाम केएल राहुल और श्रेयस अय्यर भी शामिल हैं. राहुल जिनको आईपीएल के 16वें सीजन के दौरान चोट लगी थी. वह सर्जरी के बाद अपनी रिहैब की प्रक्रिया को शुरू कर चुके हैं. लेकिन उनके एशिया कप तक वापसी की उम्मीद काफी कम जताई जा रही है. ऐसा ही कुछ पूरे आईपीएल सीजन से बाहर रहने वाले श्रेयस अय्यर को लेकर भी है. केएल राहुल और श्रेयस अय्यर दोनों ही खिलाड़ियों ने अपनी-अपनी चोट की सर्जरी कराई है. इसके बाद इन दोनों के एशिया कप 2023 से वापसी की उम्मीद जताई जा रही थी. अभी राहुल और अय्यर को पूरी तरह से फिट होने में अधिक समय लगेगा. राहुल जहां अभी राष्ट्रीय क्रिकेट अकादमी (NCA) में हैं. वहीं अय्यर भी अपनी रिकवरी पर ध्यान दे रहे हैं. एशिया कप 2023 का आयोजन 31 अगस्त से 17 सितंबर तक होना है. हाइब्रिड मॉडल के तहत खेले जाने वाले इस बार के एशिया कप में टीम इंडिया अपने सभी मुकाबले श्रीलंका में खेलेगी. वनडे वर्ल्ड कप की तैयारियों को देखते हुए टीम इंडिया के लिए यह बड़ा झटका माना जा सकता है. वर्ल्ड कप के लिए मुख्य टीम का एलान करने लिए 29 अगस्त की डेडलाइन आईसीसी की तरफ से निर्धारित की गई है. जसप्रीत बुमराह की फिटनेस पर आया यह अपडेट सामने पिछले साल से टीम इंडिया से बाहर चल रहे तेज गेंदबाज जसप्रीत बुमराह भी अब तेजी के साथ फिट हो रहे हैं. रिपोर्ट्स के अनुसार वह अब तक 70 फीसदी तक फिट हो चुके हैं. ऐसे में बुमराह को आयरलैंड के दौरे पर जाने वाली भारतीय टीम का हिस्सा बनाया जा सकता है. भारतीय टीम को अगस्त महीने में एशिया कप से पहले आयरलैंड के खिलाफ सीरीज खेलनी है. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","content":"KL Rahul And Shreyas Iyer Doubtful For Asia Cup 2023: भारतीय क्रिकेट टीम के कई खिलाड़ी इस समय अपनी चोटों से उबर रहे हैं. इसी में 2 प्रमुख नाम केएल राहुल और श्रेयस अय्यर भी शामिल हैं. राहुल जिनको आईपीएल के 16वें सीजन के दौरान चोट लगी थी. वह सर्जरी के बाद अपनी रिहैब की प्रक्रिया को शुरू कर चुके हैं. लेकिन उनके एशिया कप तक वापसी की उम्मीद काफी कम जताई जा रही है. ऐसा ही कुछ पूरे आईपीएल सीजन से बाहर रहने वाले श्रेयस अय्यर को लेकर भी है. केएल राहुल और श्रेयस अय्यर दोनों ही खिलाड़ियों ने अपनी-अपनी चोट की सर्जरी कराई है. इसके बाद इन दोनों के एशिया कप 2023 से वापसी की उम्मीद जताई जा रही थी. अभी राहुल और अय्यर को पूरी तरह से फिट होने में अधिक समय लगेगा. राहुल जहां अभी राष्ट्रीय क्रिकेट अकादमी (NCA) में हैं. वहीं अय्यर भी अपनी रिकवरी पर ध्यान दे रहे हैं. एशिया कप 2023 का आयोजन 31 अगस्त से 17 सितंबर तक होना है. हाइब्रिड मॉडल के तहत खेले जाने वाले इस बार के एशिया कप में टीम इंडिया अपने सभी मुकाबले श्रीलंका में खेलेगी. वनडे वर्ल्ड कप की तैयारियों को देखते हुए टीम इंडिया के लिए यह बड़ा झटका माना जा सकता है. वर्ल्ड कप के लिए मुख्य टीम का एलान करने लिए 29 अगस्त की डेडलाइन आईसीसी की तरफ से निर्धारित की गई है. जसप्रीत बुमराह की फिटनेस पर आया यह अपडेट सामने googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); पिछले साल से टीम इंडिया से बाहर चल रहे तेज गेंदबाज जसप्रीत बुमराह भी अब तेजी के साथ फिट हो रहे हैं. रिपोर्ट्स के अनुसार वह अब तक 70 फीसदी तक फिट हो चुके हैं. ऐसे में बुमराह को आयरलैंड के दौरे पर जाने वाली भारतीय टीम का हिस्सा बनाया जा सकता है. भारतीय टीम को अगस्त महीने में एशिया कप से पहले आयरलैंड के खिलाफ सीरीज खेलनी है. यह भी पढ़ें... Jasprit Bumrah Comeback: 'बुमराह के मामले में जल्दबाजी नहीं करनी चाहिए; शाहीन अफरीदी का उदाहरण देकर रवि शास्त्री ने किया सतर्क","pubDate":"2023-06-25 03:41:59","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/25/f2e438e9919e0490e0eec383ffe8dd601687660128997786_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Adani launches ‘Jeetenge Hum’ campaign, 1983 team joins in","link":"http://www.newindianexpress.com/sport/cricket/2023/jun/25/adani-launches-jeetenge-hum-campaign-1983-team-joins-in-2588283.html","keywords":null,"creator":null,"video_url":null,"description":"According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. CHENNAI: The Adani Group launched a campaign for the 50-over World Cup on Saturday. On Adani Day, Adani Group collaborated with the heroes of the 1983 World Cup Cricket victory to launch the ‘Jeetenge Hum’ campaign, displaying unwavering support for Indian team for the highly anticipated ICC ODI Cricket World Cup later this year. According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. “Led by Chairman Gautam Adani, the campaign sets ablaze with heartfelt wishes, kindling outpouring of support from the 1983 World Cup-winning cricket legends and passionate fans. The campaign encourages Indian cricket fans to unite as one, and rally behind Team India with #JeetengeHum on Twitter and Instagram, backing the team’s quest for victory and boosting their morale,” said the statement. “Cricket is a binding force in our country invoking a wide spectrum of emotions. Legends are not born, they are made through resilience and perseverance. Team India must have had both these attributes that led us to win the World Cup in 1983.” “With the hope of seeing history repeat itself, join us and the legends in wishing the Indian Cricket Team for the upcoming World Cup through #JeetengeHum,” said Gautam Adani, Chairman, of Adani Group in a statement. The 1983 World Cup-winning captain, Kapil Dev, too lent his support saying, “We are honoured to unite with the Adani Group in rallying Team India for the ODI World Cup 2023. This campaign symbolises the excitement and the indomitable spirit that propelled us to victory in 1983. In preparation for the World Cup 2023, it is imperative for the team to foster a collective mindset that centers on wholeheartedly committing to giving their absolute best. The true measure of success lies not solely in the outcome, but in the unwavering dedication to the relentless pursuit of personal excellence.” Roger Binny, one of the heroes of the 1983 team and the Board of Control for Cricket in India (BCCI) president, said, “Being part of the 1983 World Cup-winning team was an incredible journey filled with determination and team spirit. Together, we believe in the potential of our current players to bring back the coveted trophy. Let’s unite as fans and inspire them to create history!”","content":"CHENNAI: The Adani Group launched a campaign for the 50-over World Cup on Saturday. On Adani Day, Adani Group collaborated with the heroes of the 1983 World Cup Cricket victory to launch the ‘Jeetenge Hum’ campaign, displaying unwavering support for Indian team for the highly anticipated ICC ODI Cricket World Cup later this year. According to a press statement, the Adani Group has started an unstoppable spirit for Team India for the upcoming World Cup, marking the momentous 40th anniversary of India’s historic conquest. “Led by Chairman Gautam Adani, the campaign sets ablaze with heartfelt wishes, kindling outpouring of support from the 1983 World Cup-winning cricket legends and passionate fans. The campaign encourages Indian cricket fans to unite as one, and rally behind Team India with #JeetengeHum on Twitter and Instagram, backing the team’s quest for victory and boosting their morale,” said the statement. “Cricket is a binding force in our country invoking a wide spectrum of emotions. Legends are not born, they are made through resilience and perseverance. Team India must have had both these attributes that led us to win the World Cup in 1983.” “With the hope of seeing history repeat itself, join us and the legends in wishing the Indian Cricket Team for the upcoming World Cup through #JeetengeHum,” said Gautam Adani, Chairman, of Adani Group in a statement. The 1983 World Cup-winning captain, Kapil Dev, too lent his support saying, “We are honoured to unite with the Adani Group in rallying Team India for the ODI World Cup 2023. This campaign symbolises the excitement and the indomitable spirit that propelled us to victory in 1983. In preparation for the World Cup 2023, it is imperative for the team to foster a collective mindset that centers on wholeheartedly committing to giving their absolute best. The true measure of success lies not solely in the outcome, but in the unwavering dedication to the relentless pursuit of personal excellence.” Roger Binny, one of the heroes of the 1983 team and the Board of Control for Cricket in India (BCCI) president, said, “Being part of the 1983 World Cup-winning team was an incredible journey filled with determination and team spirit. Together, we believe in the potential of our current players to bring back the coveted trophy. Let’s unite as fans and inspire them to create history!”","pubDate":"2023-06-25 03:00:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"40 साल पहले लॉर्ड्स पर तिरंगा लहराने की कहानी, कपिल की कप्तानी में जीता 1983 का क्रिकेट वर्ल्डकप","link":"https://hindi.oneindia.com/news/sports/cricket/india-1983-prudential-cup-aka-icc-cricket-world-cup-lords-kapil-dev-784467.html","keywords":null,"creator":null,"video_url":null,"description":"India 1983 के 25 जून की तारीख भुला नहीं सकता। इसी दिन अंग्रेजों की सरजमीं पर तिरंगा लहराया था। कहानी क्रिकेट में चैंपियन बनने की है।","content":"खेल की दुनिया में India 1983 को कभी न भूलने वाला साल मानता है। ऐसा इसलिए क्योंकि आजादी के बाद अलग-अलग क्षेत्रों में खुद को संगठित और खड़ा करने का प्रयास कर रहा था, लेकिन खेल की दुनिया में क्रिकेट भारत के लिए बहुत चुनौतीपूर्ण था। ऐसे समय में भी कपिल देव की कप्तानी में क्रिकेट का मक्का कहे जाने वाले लॉर्ड्स क्रिकेट ग्राउंड पर भारतीय क्रिकेटर्स ने कामयाबी की ऐसी इबारत लिखी, जिसने दुनिया का ध्यान भारत की तरफ खींचा। लॉर्ड्स क्रिकेट ग्राउंड पर जब भारतीय क्रिकेटर्स केवल 183 रनों पर ऑलआउट हुए तो ऐसा लगा कि तत्कालीन वर्ल्ड चैंपियन और लगातार दो विश्वकप जीतने वाली वेस्टइंडीज भारत को कभी न भूलने वाली हार का स्वाद चखाएगी। हालांकि, क्रिकेट की दुनिया में एक बहुत मशहूर कहावत है, अनिश्चितताओं से भरा खेल और आखिरी गेंद फेंके जाने तक नतीजे केवल अनुमान होते हैं। ऐसा ही कुछ हुआ 25 जून, 1983 के दिन। सर विवियन रिचर्ड्स जैसे विस्फोटक और ऑल टाइम ग्रेट बैटर वाली वेस्टइंडीज भारतीय गेंदबाजों के सामने 183 रनों का स्कोर भी हासिल नहीं कर सकी और इंग्लैंड के लॉर्ड्स क्रिकेट ग्राउंड पर 40 साल पहले इतिहास रचा गया। आज के आईसीसी वनडे क्रिकेट वर्ल्डकप को 1983 में प्रूडेंशियल कप कहा जाता था। 1975 और 1979 के विश्वकप में अपनी बादशाहत साबित कर चुकी वेस्टइंडीज लॉर्ड्स में लगातार तीसरी बार इतिहास रचने की दहलीज पर थी। 25 जून 1983 का वो दिन ऐतिहासिक बना भी, लेकिन भारत के लिए। कपिल की कप्तानी में इंडिया के लड़ाकों ने परीकथा जैसा प्रदर्शन किया और 60 ओवर के खेल में वेस्टइंडीज को 183 रनों का टारगेट अचीव नहीं करने दिया। 52 ओवरों में वेस्टइंडीज ऑलआउट हो गई। तीन विकेट लेने वाले मोहिंदर अमरनाथ मैन ऑफ द मैच चुने गए। क्रिकेट को फॉलो करने वाले सर्वसम्मति से इस बात को मानते हैं कि 1983 की जीत स्पोर्ट्स की दुनिया में टर्निंग प्वाइंट रही है। दो वर्ल्डकप जीत चुकी टीम जिसमें विव रिचर्ड्स, क्लाइव लॉयड और गॉर्डन ग्रीनिज जैसे दिग्गज शामिल हों, उसे 183 रनों के टारगेट के सामने केवल 140 रनों पर समेट देने को अगर अश्वमेध के घोड़े थामने जैसा पराक्रम कहा जाए तो अतिश्योक्ति नहीं। विव रिचर्ड्स का जिक्र इसलिए क्योंकि उनके पास ऐसा कौशल था जिससे वे अकेले दम पर 183 रन बनाने की कूवत रखते थे। इसका सबूत एक साल से भी कम समय बाद मिला जब उन्होंने मार्च, 1984 में वनडे करियर की बेस्ट इनिंग खेली। इंग्लैंड के खिलाफ रिचर्ड्स की 189 रनों की पारी को ऑल टाइम ग्रेट में गिना जाता है। सर विव को पूरा सम्मान, लेकिन आज बात भारतीय क्रिकेट की। 25 जून की शाम का जिक्र कर कपिल देव कई बार कह चुके हैं कि उन्हें गर्व है ऐसी टीम का हिस्सा बनने पर जिसमें सीनियर्स के होने पर भी उनके कंधों पर कप्तानी का दारोमदार सौंपा गया। विश्वकप जीतने के बाद पहले लॉर्ड्स और फिर इंग्लैंड के होटलों में सेलिब्रेशन का माहौल कैसा था? इस पर कपिल ने एक इंटरव्यू में बताया था कि कई खिलाड़ियों ने वाइन का जमकर लुत्फ उठाया था। खेल समीक्षक इस ऐतिहासिक जीत का सूत्रधार कपिल को मानते हैं। ऐसा इसलिए क्योंकि पहले इसी वर्ल्डकप में कपिल ने 175 नाबाद की बेहद जरूरी और ऐतिहासिक पारी खेली और फिर फाइनल मैच में विव रिचर्ड्स का ऐसा कैच लपका जिस पर एक नजर में यकीन कर पाना आज भी मुश्किल है। मीडिया के सीमित संसाधनों के कारण लॉर्ड्स के उस ऐतिहासिक मोमेंट को आज भी दर्शक मिस करते हैं। दरअसल, फाइनल के दिन बीबीसी के लोग हड़ताल पर थे। इस कारण मैच का रुख पलटने वाले मदन लाल और अमरनाथ सरीखे लीजेंड को आज की युवा पीढ़ी रियल टाइम तस्वीरों और वीडियो से नहीं जान सकी। अंग्रेजों की सरजमीं पर सेमीफाइनल मुकाबले में इंग्लैंड को मात देकर लॉर्ड्स क्रिकेट ग्राउंड पर फाइनल का टिकट पाने वाली टीम इंडिया को अंडरडॉग माना गया। खुद मदन लाल बताते हैं कि भारत को जीत का दावेदार माना ही नहीं गया, लेकिन मैच-दर-मैच मिली जीत के बाद अगले मैच में भी जीतने की उम्मीद की रौशनी तेज होती गई। मदन लाल की नजरों में सबसे अहम बात हौसला और आत्मविश्वास न खोना रहा। फाइनल से पहले वेस्टइंडीज और ऑस्ट्रेलिया से मात खाने के बाद भी टीम एकजुट रही। जीतने का जज्बा कम नहीं हुआ। उन्होंने एक इंटरव्यू में कहा, जिम्बाब्वे के खिलाफ महज 17 रन के टोटल पर पांच बल्लेबाजों का आउट होना ऐसा था, जब लगा कि अब टूर्नामेंट से बाहर होना तय है। हालांकि, जब कपिल ने 175 रनों की पारी खेली और भारत जीत गया तो टीम का कॉन्फिडेंस अलग स्तर पर पहुंच गया। ऐसा लगा, कि जब इतनी बुरी कंडीशन से कमबैक हो सकता है तो आगे भी जीत सकते हैं। मदन लाल की नजरों में रोजर बिन्नी, कपिल देव और बलविंदर संधू के अलावा कपिल की स्विंग बॉलिंग जीत के अहम फैक्टर्स में एक रही। कपिल की कप्तानी पर अमरनाथ बताते हैं कि उनका बेफिक्र अंदाज सबसे बड़ी कुंजी रही। जैसा खेलने का अंदाज वैसी ही कप्तानी। टीम में अनुभव और युवा जोश का संतुलन था। 40 साल पुराने गोल्डन मोमेंट्स को याद कर अमरनाथ बताते हैं कि वेस्टइंडीज के 8 विकेट गिरने के बाद लगने लगा था कि वर्ल्डकप उनके कब्जे में आ चुका है। आखिरी विकेट की औपचारिकता जल्द पूरी करने की ललक थी। तत्कालीन राष्ट्रपति ज्ञानी जैल सिंह ने भी विश्वविजेता टीम के स्वदेश लौटने के बाद पूरी टीम को सम्मानित किया था। टीम भावना की मिसाल इस बात से भी मिलती है कि 14 सदस्यीय टीम में सुनील वॉल्सन एक ऐसे खिलाड़ी रहे, जिन्हें एक भी मुकाबले में मैदान पर उतरने का मौका नहीं मिल सका। वे जीत का मंजर याद कर बताते हैं कि लॉर्ड्स पर दर्शकों का हुजूम इस कदर उमड़ा कि खिलाड़ियों को पवेलियन की तरफ भागना पड़ा। आज चार दशकों के बाद जब टीम की इस ऐतिहासिक कामयाबी का जिक्र हो रहा है, कहना गलत नहीं होगा कि खेल के प्रति समर्पण और जुनून दशकों पुरानी इस एवरग्रीन टीम से सीखने की जरूरत है। खासकर ऐसे समय में जब क्रिकेट में तकनीक, पैसे और ग्लैमर का बोलबाला है।","pubDate":"2023-06-25 02:51:53","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Batting rootstar","link":"http://www.newindianexpress.com/sport/cricket/2023/jun/25/batting-rootstar-2588279.html","keywords":null,"creator":null,"video_url":null,"description":"England’s batter has not just adapted to the firebrand cricket of the team, but is thriving. Swaroop Swaminathan speaks with his formative coach to find out more about the transition. In the formative days of Bazball, England was treated to a speech by skipper Ben Stokes. The still newly-appointed captain had watched Elvis before the rescheduled fifth Test of the India — England series. Stokes, a totemic figure himself, was so inspired by what he saw on screen. Basically, Stokes, in his speech on the first morning of the Test, challenged his team to be ‘rock stars’. Easier said than done. Some have the persona ingrained in them. Others? Not so much. Joe Root, for instance, is more suited to being a class prefect than a rock star. More squeaky clean Yorkshire lad and less the Memphis’ King. But Bazball isn’t about trying and imitating something or someone. It was about creating an environment of fun, with entertainment being one of the primary currencies in town. The fine print — finding the best route to success — was the destination but there would be no arguments about the journey. Root said as much after his match-winning 100 against India in the 5th Test in July 2022. “Ben wanted us to be entertainers. He mentioned trying to be rock stars on the field,” Root had said. “It’s about trying to have fun and relish every opportunity you get to showcase what you are about and put on a show for everyone. I do not think I will ever be able to feel or look like a rock star, but for 10 seconds I might have done today.” Root may not admit it but he’s been a rockstar in England whites ever since Brendon McCullum and Stokes decided to reshape the England team in their image. If the one compelling story of Test cricket over the last year has been the side’s almost complete reversal of fortune, England’s No. 4 is the one penning some of the prose in the story. After the Ashes Down Under in the winter of 2021, Root looked broken, a leader of a ship with a broken steering and a lost compass. These days, he’s the leader of the band doing Elvis impersonations and reverse-ramping one of the best bowlers of the 21st century. To speak about Root’s last 12 months, the ideal starting point is the way he has exploited the space behind the slip cordon. According to data provided by CricViz to this daily, “Since McCullum took over, he’s played 15 scoop shots, scoring 40 runs’ in the process”. The year before that? “In 2021-22, Root played only one scoop shot off seamers, scoring one run,” CricViz added. Kevin Sharp, one of his first coaches at Yorkshire, alluded to this very shot when speaking about his former ward. “He has always been a consistent player for many years,” he told this daily. “They are playing with no fear, really. I think what has happened is that Joe too has certainly expanded his shot selection at Test level by playing some of the ramps, for example.” If the ramp is a primer to understand Root under the McCullum-Stokes combination, a wider picture is necessary to know what the No. 4 has brought to the new regime. While the likes of Jonny Bairstow, Harry Brook and Ollie Pope (all to varying degrees) have provided the ballast, Root’s essentially the one with the oil, their bellwether batter, somebody who has made telling contributions across three continents. Out of the 14 Tests he has played under Stokes, he has made a 50 or above in nine. He’s been the world leader for centuries (five), most scores above 50 (10), most fours (132) and most runs (1279). He may be considered a technically proficient batter, but he has also been able to live with the ultra-aggressive approach. His career strike rate till May 2022 was 54.65. Under the new regime, that’s jumped to 76.35 while averaging almost 18 runs more. Sharp isn’t surprised. “He has always been one of the leaders of the batting unit, he tries to put pressure on the opposition bowlers. He has been around long enough and experienced enough to be able to take on those responsibilities. “I am not surprised because he’s always thinking ahead of the game, what he needs to do to get better. When he practices, he always practices for the big occasion and the next big challenge. When he was 12, he was preparing like a county batter would do. When he was 16, he was preparing like a Test batter.” While the debate in India continues about the benefits of featuring in the IPL before a big-ticket red-ball series, Root opined that featuring in the IPL was better preparation for this year’s Ashes than turning out for Yorkshire. “Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here. I am not saying it’s not important or a good standard. (But) for where I am in my career, am I going to learn more about myself in that environment,” he had told UK media during the Test against Ireland in early June. “Am I really going to be prepared better for an Ashes series facing lower-pace bowling on some nibbly wickets, when hopefully we will play on good pitches against high pace and a high-quality spinner? I don’t think so. By going to the IPL, learning and experiencing something new, and discussing the game with some of the greats, like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year, it would set me up best. I feel ready, I have another week’s prep and some time together as a squad.” Sharp provides further insight. “He’s (Root) is very versatile,” he said. “There’s a difference between playing cricket and knowing how to play cricket... the very fact that the England management allowed these guys to play the IPL just before the Ashes is a vote of confidence. We know you can play Test cricket. Go out there and come back with those experiences and use them in the Test arena.” Speaking with former players, Sharp says, is also something Root likes to do. Especially to work on the mental side of his game. As an example, when he faced the problem of converting 50s into 100s. “He would talk to other players, past players, talk to psychologists, talk to anyone who would give him the necessary information to help him with the process. Now he’s so wise and smart... he’s probably had so many experiences, and he’s now revelling in the fact that he can try something in an environment that allows him to do so. If you make a mistake, ‘it’s okay’.” That, ultimately, is Root’s batting. Distilled to its very essence.","content":"In the formative days of Bazball, England was treated to a speech by skipper Ben Stokes. The still newly-appointed captain had watched Elvis before the rescheduled fifth Test of the India — England series. Stokes, a totemic figure himself, was so inspired by what he saw on screen. Basically, Stokes, in his speech on the first morning of the Test, challenged his team to be ‘rock stars’. Easier said than done. Some have the persona ingrained in them. Others? Not so much. Joe Root, for instance, is more suited to being a class prefect than a rock star. More squeaky clean Yorkshire lad and less the Memphis’ King. But Bazball isn’t about trying and imitating something or someone. It was about creating an environment of fun, with entertainment being one of the primary currencies in town. The fine print — finding the best route to success — was the destination but there would be no arguments about the journey. Root said as much after his match-winning 100 against India in the 5th Test in July 2022. “Ben wanted us to be entertainers. He mentioned trying to be rock stars on the field,” Root had said. “It’s about trying to have fun and relish every opportunity you get to showcase what you are about and put on a show for everyone. I do not think I will ever be able to feel or look like a rock star, but for 10 seconds I might have done today.” Root may not admit it but he’s been a rockstar in England whites ever since Brendon McCullum and Stokes decided to reshape the England team in their image. If the one compelling story of Test cricket over the last year has been the side’s almost complete reversal of fortune, England’s No. 4 is the one penning some of the prose in the story. After the Ashes Down Under in the winter of 2021, Root looked broken, a leader of a ship with a broken steering and a lost compass. These days, he’s the leader of the band doing Elvis impersonations and reverse-ramping one of the best bowlers of the 21st century. To speak about Root’s last 12 months, the ideal starting point is the way he has exploited the space behind the slip cordon. According to data provided by CricViz to this daily, “Since McCullum took over, he’s played 15 scoop shots, scoring 40 runs’ in the process”. The year before that? “In 2021-22, Root played only one scoop shot off seamers, scoring one run,” CricViz added. Kevin Sharp, one of his first coaches at Yorkshire, alluded to this very shot when speaking about his former ward. “He has always been a consistent player for many years,” he told this daily. “They are playing with no fear, really. I think what has happened is that Joe too has certainly expanded his shot selection at Test level by playing some of the ramps, for example.” If the ramp is a primer to understand Root under the McCullum-Stokes combination, a wider picture is necessary to know what the No. 4 has brought to the new regime. While the likes of Jonny Bairstow, Harry Brook and Ollie Pope (all to varying degrees) have provided the ballast, Root’s essentially the one with the oil, their bellwether batter, somebody who has made telling contributions across three continents. Out of the 14 Tests he has played under Stokes, he has made a 50 or above in nine. He’s been the world leader for centuries (five), most scores above 50 (10), most fours (132) and most runs (1279). He may be considered a technically proficient batter, but he has also been able to live with the ultra-aggressive approach. His career strike rate till May 2022 was 54.65. Under the new regime, that’s jumped to 76.35 while averaging almost 18 runs more. Sharp isn’t surprised. “He has always been one of the leaders of the batting unit, he tries to put pressure on the opposition bowlers. He has been around long enough and experienced enough to be able to take on those responsibilities. “I am not surprised because he’s always thinking ahead of the game, what he needs to do to get better. When he practices, he always practices for the big occasion and the next big challenge. When he was 12, he was preparing like a county batter would do. When he was 16, he was preparing like a Test batter.” While the debate in India continues about the benefits of featuring in the IPL before a big-ticket red-ball series, Root opined that featuring in the IPL was better preparation for this year’s Ashes than turning out for Yorkshire. “Championship cricket is the bedrock of our domestic game and I am not trying to bag it with what I say here. I am not saying it’s not important or a good standard. (But) for where I am in my career, am I going to learn more about myself in that environment,” he had told UK media during the Test against Ireland in early June. “Am I really going to be prepared better for an Ashes series facing lower-pace bowling on some nibbly wickets, when hopefully we will play on good pitches against high pace and a high-quality spinner? I don’t think so. By going to the IPL, learning and experiencing something new, and discussing the game with some of the greats, like Kumar Sangakkara and Brian Lara, I thought that not just for the Ashes, but the rest of the year, it would set me up best. I feel ready, I have another week’s prep and some time together as a squad.” Sharp provides further insight. “He’s (Root) is very versatile,” he said. “There’s a difference between playing cricket and knowing how to play cricket... the very fact that the England management allowed these guys to play the IPL just before the Ashes is a vote of confidence. We know you can play Test cricket. Go out there and come back with those experiences and use them in the Test arena.” Speaking with former players, Sharp says, is also something Root likes to do. Especially to work on the mental side of his game. As an example, when he faced the problem of converting 50s into 100s. “He would talk to other players, past players, talk to psychologists, talk to anyone who would give him the necessary information to help him with the process. Now he’s so wise and smart... he’s probably had so many experiences, and he’s now revelling in the fact that he can try something in an environment that allows him to do so. If you make a mistake, ‘it’s okay’.” That, ultimately, is Root’s batting. Distilled to its very essence.","pubDate":"2023-06-25 02:49:00","image_url":null,"source_id":"newindianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"2023 ODI वर्ल्ड कप के बाद किसे मिलनी चाहिए टीम इंडिया की कप्तानी? रवि शास्त्री ने बताई अपनी पसंद","link":"https://www.abplive.com/sports/cricket/who-should-get-captaincy-of-team-india-after-2023-odi-world-cup-ravi-shastri-took-name-of-hardik-pandya-2439199","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Ravi Shastri Named Hardik Pandya New White Ball Captain: इस साल के अंत में भारत में खेले जाने वाले 2023 वनडे वर्ल्ड कप के बाद संभवत: भारतीय क्रिकेट टीम को सीमित ओवर की क्रिकेट में एक नया कप्तान मिल जाएगा. हालांकि, इसकी चर्चा अभी से शुरू हो गई है. इस बीच टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने बताया है कि वनडे वर्ल्ड कप के बाद किसे टीम इंडिया की कप्तानी मिलनी चाहिए.  रवि शास्त्री का मानना है कि 2023 वनडे वर्ल्ड कप के बाद रोहित शर्मा से वनडे और टी20 इंटरनेशनल की कप्तानी छीन लेनी चाहिए और हार्दिक पांड्या को दोनों फॉर्मेट में नियमित कप्तान बना देना चाहिए. बता दें कि 2022 टी20 वर्ल्ड कप में भारत के खराब प्रदर्शन के बाद से हार्दिक ही टी20 में कप्तानी कर रहे हैं.  द वीक को दिए इंटरव्यू में पूर्व हेड कोच रवि शास्त्री ने कहा, \"मुझे लगता है कि हार्दिक पांड्या की बॉडी टेस्ट क्रिकेट का सामना नहीं कर पाएगी. ऐसे में 2023 वनडे वर्ल्ड कप के बाद उन्हें सीमित ओवरों की कप्तानी संभालनी चाहिए. वर्ल्ड कप में रोहित शर्मा कप्तान होंगे, इसमें कोई शक नहीं है.\" हार्दिक आईपीएल से बने कप्तानी के दावेदार गौरतलब है कि पहले टीम इंडिया के भविष्य के कप्तान के रूप में ऋषभ पंत और केएल राहुल को देखा जा रहा था. फिर इस लिस्ट में श्रेयस अय्यर का नाम भी जुड़ा. हालांकि, इसके बाद आईपीएल 2022 में गुजरात टाइटंस ने हार्दिक पांड्या को अपनी टीम की कप्तानी सौंपी, फिर क्या था मानो हार्दिक के तेवर ही बदल गए. पहली बार कप्तानी में ही हार्दिक ने गुजरात को खिताब जिता दिया और फिर हर कोई उनकी कप्तानी का मुरीद हो गया.  इसके बाद 2022 टी20 वर्ल्ड कप के बाद हार्दिक को भारत की टी20 टीम का कप्तान बनाया गया. यहां भी उन्होंने दिग्गजों को अपनी कप्तानी से प्रभावित किया. फिर आईपीएल 2023 में उनकी कप्तानी में गुजरात ने फाइनल तक का सफर तय किया. अब हर कोई हार्दिक को भविष्य के कप्तान के रूप में देख रहा है.  यह भी पढ़ें... AUSW vs ENGW: टैमी ब्यूमोंट के नाम दर्ज हुआ ऐतिहासिक रिकॉर्ड, इंग्लैंड महिला टीम के लिए दोहरा शतक लगाने वाली पहली बल्लेबाज","content":"Ravi Shastri Named Hardik Pandya New White Ball Captain: इस साल के अंत में भारत में खेले जाने वाले 2023 वनडे वर्ल्ड कप के बाद संभवत: भारतीय क्रिकेट टीम को सीमित ओवर की क्रिकेट में एक नया कप्तान मिल जाएगा. हालांकि, इसकी चर्चा अभी से शुरू हो गई है. इस बीच टीम इंडिया के पूर्व हेड कोच रवि शास्त्री ने बताया है कि वनडे वर्ल्ड कप के बाद किसे टीम इंडिया की कप्तानी मिलनी चाहिए. रवि शास्त्री का मानना है कि 2023 वनडे वर्ल्ड कप के बाद रोहित शर्मा से वनडे और टी20 इंटरनेशनल की कप्तानी छीन लेनी चाहिए और हार्दिक पांड्या को दोनों फॉर्मेट में नियमित कप्तान बना देना चाहिए. बता दें कि 2022 टी20 वर्ल्ड कप में भारत के खराब प्रदर्शन के बाद से हार्दिक ही टी20 में कप्तानी कर रहे हैं. द वीक को दिए इंटरव्यू में पूर्व हेड कोच रवि शास्त्री ने कहा, \"मुझे लगता है कि हार्दिक पांड्या की बॉडी टेस्ट क्रिकेट का सामना नहीं कर पाएगी. ऐसे में 2023 वनडे वर्ल्ड कप के बाद उन्हें सीमित ओवरों की कप्तानी संभालनी चाहिए. वर्ल्ड कप में रोहित शर्मा कप्तान होंगे, इसमें कोई शक नहीं है.\" हार्दिक आईपीएल से बने कप्तानी के दावेदार googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); गौरतलब है कि पहले टीम इंडिया के भविष्य के कप्तान के रूप में ऋषभ पंत और केएल राहुल को देखा जा रहा था. फिर इस लिस्ट में श्रेयस अय्यर का नाम भी जुड़ा. हालांकि, इसके बाद आईपीएल 2022 में गुजरात टाइटंस ने हार्दिक पांड्या को अपनी टीम की कप्तानी सौंपी, फिर क्या था मानो हार्दिक के तेवर ही बदल गए. पहली बार कप्तानी में ही हार्दिक ने गुजरात को खिताब जिता दिया और फिर हर कोई उनकी कप्तानी का मुरीद हो गया. इसके बाद 2022 टी20 वर्ल्ड कप के बाद हार्दिक को भारत की टी20 टीम का कप्तान बनाया गया. यहां भी उन्होंने दिग्गजों को अपनी कप्तानी से प्रभावित किया. फिर आईपीएल 2023 में उनकी कप्तानी में गुजरात ने फाइनल तक का सफर तय किया. अब हर कोई हार्दिक को भविष्य के कप्तान के रूप में देख रहा है. यह भी पढ़ें... AUSW vs ENGW: टैमी ब्यूमोंट के नाम दर्ज हुआ ऐतिहासिक रिकॉर्ड, इंग्लैंड महिला टीम के लिए दोहरा शतक लगाने वाली पहली बल्लेबाज","pubDate":"2023-06-25 02:42:11","image_url":"https://wcstatic.abplive.in/en/prod/wp-content/uploads/2018/08/veUZ6GQ6p7.JPG","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"1983 World Cup: 40 साल पहले आज ही के दिन भारत ने रचा था इतिहास, वर्ल्ड चैंपियन बन दुनिया को किया हैरान","link":"https://hindi.oneindia.com/news/sports/cricket/on-this-day-40-years-ago-india-win-the-1983-world-cup-know-here-details-784509.html","keywords":null,"creator":null,"video_url":null,"description":"भारतीय क्रिकेट इतिहास में आज के दिन की अहमियत बहुत ज्यादा है। 25 जून 1983 को भारत ने पहली बार वर्ल्ड कप का खिताब जीता था। भारतीय टीम को इस वर्ल्ड कप में जीत का दावेदार नहीं माना जा रहा था। लेकिन टीम इंडिया ने खिताब अपने नाम कर सभी को हैरान कर दिया।","content":"भारतीय पूर्व दिग्गज ऑलराउंडर कपिल देव की कप्तानी में टीम ने पहली बार 25 जून को वर्ल्ड के खिताब पर कब्जा जमाया था। आज से ठीक 40 साल पहले लंदन के लॉर्ड्स मैदान पर लगातार 2 बार वर्ल्ड कप जीत चुकी वेस्टइंडीज को हराकर भारत ने जीत दर्ज की। भारत की इस जीत से पूरी दुनिया हैरान रह गई थी। भारतीय टीम वर्ल्ड कप जीत जाएगी, इस बात की उम्मीद किसी को नहीं थी। भारत के सामने वेस्टइंडीज का पलड़ा भारी दिखाई पड़ रहा था। लेकिन भारतीय गेंदबाजों की जबरदस्त बॉलिंग की बदौलत भारत ने इस मुकाबले को अपने नाम किया। भारत की इस जीत में कप्तान कपिल देव का भी बड़ा हाथ रहा था। वर्ल्ड कप के फाइनल मुकाबले में भारतीय टीम ने पहले बल्लेबाजी करते हुए 183 रन बनाए थे। भारतीय टीम के स्कोर को देखकर ऐसा लग रहा था कि वेस्टइंडीज की टीम इस मुकाबले को आसानी से जीत जाएगी। लेकिन भारतीय गेंदबाजों ने ऐसा होने नहीं दिया। भारत ने वेस्टइंडीज टीम को महज 140 रन पर ऑलआउट कर खिताब अपने नाम किया। फाइनल मैच में भारत की और से मदन लाल और मोहिंदर अमरनाथ ने तीन-तीन विकेट झटकने का काम किया था। इन दोनों की जबरदस्त गेंदबाजी के कारण ही भारत इस मुकाबले को आसानी से जीतने में सफल रहा। इस मैच में भारत के लिए कोई भी बल्लेबाज अर्धशतक नहीं लगा सका था। कृष्माचारी श्रीकांत ने टीम के लिए सबसे अधिक 38 रन बनाए थे। सुनील गावस्कर, क्रिस श्रीकांत, मोहिंदर अमरनाथ, यशपाल शर्मा, संदीप पाटिल, कपिल देव (कप्तान), कीर्ति आजाद, रोजर बिन्नी, मदन लाल, सैयद किरमानी (विकेटकीपर), बलविंदर संधू। सर गॉर्डन ग्रीनिज, डेसमंड हेन्स, सर विव रिचर्ड्स, सर क्लाइव लॉयड (कप्तान), लैरी गोम्स, फौड बाचस, जेफ डुजॉन (विकेटकीपर), मैल्कम मार्शल, सर एंडी रॉबर्ट्स, जोएल गार्नर, माइकल होल्डिंग। It's been 40 years now since India won their maiden World Cup, in England. The Kapil Dev led side created history beating public favorites WI in the Final. Mohinder Amarnath won POTM awards in the Semis and the Final. A victory that changed the future of cricket in India.","pubDate":"2023-06-25 02:41:35","image_url":null,"source_id":"oneindia","category":["sports"],"country":["india"],"language":"hindi"}]}