{"newsArray":[{"article_id":"42eed33784d2e972df625e5b9b62563d","title":"Premier League icon mocked Gareth Southgate after Australia beat England","link":"https://www.dailystar.co.uk/sport/football/mark-schwarzer-gareth-southgate-england-31176991","keywords":["Sport"],"creator":null,"video_url":null,"description":"England boss Gareth Southgate has warned his players they risk handing Australia bragging rights if they slip up in their friendly at Wembley on Wednesday night","content":"has warned his stars to be aware of the Aussie boasting if they slip up at Wembley. The Three Lions boss has bad memories of team-mate Mark Schwarzer turning up with an inflatable kangaroo after the Socceroos beat England when they last met in 2003 at Upton Park. Southgate’s side are set to lock horns with the Aussies tonight as he implored fringe players to be given an opportunity to take their chance. Despite rivalries between the nations being bigger in cricket and rugby, his other concern is avoiding a repeat of 2003 when Schwarzer rubbed the 3-1 win in on his return to the North East. The England boss said: “We’ve talked to the players about the England-Australia sporting rivalry and we know what that means. \"I played with a lot of Aussies and when they beat us at Upton Park they were pretty quick to come back to Middlesbrough. Schwarzer had a blow up kangaroo under his arm and he was making hay with it all. “There’s plenty of rivalry going on. \"I think it is generally a sporting rivalry. I suppose I keep having to say to our players before these games ‘Look lads, this another country that doesn’t particularly like us, so get prepared for that, they want to make hay and beat us’. They’ll be highly motivated.\" Southgate may give some players a chance tonight that may not feature in Tuesday’s Euro 2024 qualifier with Italy to show they’re worth a spot in his squad for next summer. He said: \"We have six matches before we name a squad in all likelihood for a European Championship. And so if people are going to have the chance to force their way into that squad, or that team, we need to play them. Prime Video is available as part of the Amazon Prime membership, which costs £8.99 per month or £95 annually for an individual. Prime Student You can also sign-up for Prime Video on its own for £5.99 per month, however, you won’t get the other benefits that come with Prime — like free One-Day Delivery and Same-Day Delivery on eligible orders and fast grocery delivery and pickup. £5.99 per month for Prime Video only, or £8.99 per month for Amazon Prime membership \"And also when you are keeping a squad and a spirit of a squad together people need the chance to play to really feel part of that. It is an important night for a lot of players, they will recognise that.\"","pubDate":"2023-10-12 22:06:55","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31176963.ece/ALTERNATES/s98/0_Goalkeeper-Mark-Schwarzer-of-Australia-attempts-to-tackle-Michael-Owen-of-England.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"182fcdff42897e2faa7c8e8dc2aa7b95","title":"Joyriders wreck cricket pitch again","link":"https://times-age.co.nz/sports/joyriders-wreck-cricket-pitch-again/","keywords":["Cricket","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Vandalism at Masterton’s Queen Elizabeth Park Oval has forced the moving of tomorrow’s inaugural North vs South match to the Hadlow artificial pitch. The game for the ‘Seth Rance Bat’ was to be the first on grass this season and was being used by new Post Office Hotel Wairarapa coach Mark Childs as an important […]","content":"Vandalism at Masterton’s Queen Elizabeth Park Oval has forced the moving of tomorrow’s inaugural North vs South match to the Hadlow artificial pitch. The game for the ‘Seth Rance Bat’ was to be the first on grass this season and was being used by new Post Office Hotel Wairarapa coach Mark Childs as an important buildup for the first Furlong Cup match in a fortnight against Taranaki. However, damage caused by a car to the outfield and across the northern end of the pitch block left Wairarapa Cricket with no option but to move the game from their traditional home, much to the frustration of general manager Simon Roseingrave. “It’s disappointing because we’ve probably had the best spring for a few years; the season has felt the best planned it has been for a few years; everybody was ready to go, and the North-South fixture, which was the inaugural game and an exciting way to start the season and we don’t have the use of our main facility,” Roseingrave said. “It makes us nervous in terms of when the season can get on the block. We’re still hopeful for the Bidwill Cup on the 21st, but it all depends on what Rec Services can do to fix it with a bit of rolling and cutting and see what it looks like.” Roseingrave reckoned that it’s probably the fourth or fifth time in his 10 years in the role that such vandalism has occurred, and he intends to talk with Masterton District Council to see what security improvements can be made. “There’s no way we want to block off the park because it’s such a fantastic asset to the whole community, but we just need some community understanding about how it impacts an organisation like us.” The Masterton District Council has asked police to review CCTV footage from the area to identify the culprits. The council’s manager of community facilities and activities, Corin Haines, confirmed the park was unsafe to play on and would be closed to cricket this weekend. “A huge amount of work has been done to prepare the pitch for the cricket season after a very wet winter,” Haines said. “To see carefully prepared turf ripped up by this act of idiocy is heartbreaking, even for people not involved in cricket.” Haines said any information on who is responsible should be passed to police. It is thought the vehicle accessed the park via the green space opposite the Trust House Recreation Centre at about 3.45 a.m. yesterday. Despite Mark Childs’ disappointment that the players won’t get their first chance to play on grass, he is keen to see a step up from their first outing last Saturday. That one-day game resulted in a loss to Petone-Riverside, who scored 278 after being 160–6. Wairarapa fell about 40 runs short, with Robbie Anderson [40] and Ethan Childs [35] impressing in an opening stand of 75 before the latter was forced to retire after putting out his shoulder when playing a drive over cover. The injury could also have ramifications for the bowling depth for the start of the rep season, with the allrounder a spearhead in the medium-pace attack. Jack Wakeling also stood out with a half-century. Mark Childs said tomorrow’s game will be played under Furlong Cup conditions, with 112 overs for the day, and the team batting first limited to 60 overs. The teams will play for the ‘Seth Rance Bat’ to add a bit of spice to the contest. The South side has been boosted with some players from North clubs so they can field a competitive team. Play will get underway at 10.30 am. North – Robbie Anderson [c], George Deans, Jeremy Anderson, Mark Steventon, Jaco Vorster, Jack Wakeling, Nathan Elliott, Samuel Payne, Shamal Perera, Hugo Wakeling, Patrick Wootton, Trey Bidois South – Quinn Childs [c], Hayden Ray, Caleb Burling, Robbie Speers, Rudo Erasmus, Seth Rance, Ed Lord, Cuong “Chopper” Troung, James Church, Angus Jaspers, Guyan Dissanayake, Alex Mason","pubDate":"2023-10-12 21:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/10/RS507423_20231012_091801-scaled-e1697091093597-1024x942.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"db2c3fc5c1824072110ddd22754f7aa1","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.southwalesguardian.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.southwalesguardian.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0cf9764000211fab3655117debaa4e5d","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.northwalespioneer.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.northwalespioneer.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0a5280c5fdfcc0dac0f5ac53458d3a4d","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.northwaleschronicle.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ed07a99a935dfc954013152e95973d6c","title":"F1 great Hakkinen to mentor Indian F2 driver Maini","link":"https://www.hindustantimes.com/sports/others/f1-great-hakkinen-to-mentor-indian-f2-driver-maini-101697133770097.html","keywords":null,"creator":null,"video_url":null,"description":"Maini is currently India’s best hope to enter F1 after Daruvala, will be switching to Formula E next year after signing a contract with Maserati last month","content":"Indian racing driver Kush Maini will be mentored by two-time Formula 1 world champion Mika Hakkinen to help the 23-year-old realise his dream of racing at the pinnacle of motorsport. Kush Maini is currently driving for Campos Racing. Maini is currently driving for Campos Racing in his rookie season in Formula 2 – the primary feeder series for F1 – and has bagged 60 points that includes a podium in Melbourne to be 11th in the championship, a spot better than compatriot Jehan Daruvala. We're now on WhatsApp. Click to join. Maini is currently India’s best hope to enter F1 after Daruvala, who after driving for four seasons in F2, will be switching to Formula E next year after signing a contract with Maserati last month. Hakkinen is throwing his weight behind the young prodigy, stating their target is very clear: “F1 is our objective.” The Finn’s track record in mentoring aspiring F1 drivers is well known, having played a significant role in the development of 10-time race winner and current Alfa Romeo Sauber driver Valtteri Bottas. Having an F1 champion in your corner means a young driver can focus on the essentials over a race weekend, learn how to win bragging rights within a team and optimise communications. It also provides powerful business leverage, connecting with sponsors. With Hakkinen applying his management techniques and processes, Maini believes that he can challenge at the front in 2024 F2. “From next year, my approach and that of my team is going to be a lot more structured thanks to Mika. Having a trainer who's looking after your nutrition at the track and a mind coach looking after anything you're going through on a race weekend will allow me to focus on driving. Basically, the way Mika works is you narrow down everything to the point where the driver just has one job,\" said Maini. Maini, who hails from Bengaluru, is the younger brother of Arjun Maini, who raced in F2 and was a development driver for Haas F1 team. He currently competes in sports car racing for Mercedes AMG in Europe. “I've watched Mika since I was very young. And I know everything he has achieved in this sport. So just for him to believe that I could reach Formula One shows that we've done something right in these last 15 years. It’s a massive weapon you have in your arsenal when you have Mika Hakkinen standing behind you,” said Maini. “Having Mika behind me, my whole team being created now and not having to stress about racing, it's a very exciting time for myself and I feel I haven't showed anywhere near what I am capable of in the car.\" Known as ‘The Flying Finn’, the 55-year-old Hakkinen won two F1 championships in 1998 and 1999 for McLaren and was the great Michael Schumacher’s primary adversary in those years. During his time in F1 that ranged from 1991 to 2001, Hakkinen notched 20 race wins, 51 podiums and 26 pole positions. \"I have a lot of experience from working with Valtteri Bottas seeing him developing and growing as a driver. More recently I’ve been following Kush, understanding his abilities, his talent for driving. It’s a very interesting journey together to develop, to be an even more of a professional racing driver. F1 is our objective, not forgetting the current situation (in F2),\" said Hakkinen. Hakkinen will not be a blow-by-blow driver coach, teaching Maini cornering techniques. “I don't think I have to put my nose into that,” added the Finn. Hakkinen defines his role as leveraging the tools of “communication and the network that I have. These assets are very powerful when looking after a young talented driver. I've been an ambassador and part of F1 since 1991. It's an asset and the power that I have to take this young driver into the right places at the right time.” “Of course, India is an enormous, powerful country. I’m part of bringing a young driver from India to Formula One, bringing these mega companies, learning to understand the opportunities that F1 can bring them. And vice versa, what F1 can experience and create with India. I can only see beautiful success stories,\" said Hakkinen. India hosted three Formula 1 races at the Buddh International Circuit (BIC) in Greater Noida from 2011 to 2013 before the Indian Grand Prix ran into tax, bureaucratic and financial hurdles. The country has also produced two F1 drivers; Narain Karthikeyan, who did two full seasons in 2005 and 2012 and half a season in 2011, and Karun Chandhok, who raced half a season in 2010 and one race in 2011 in F1. \"India is going to be very powerful and I want all Indians to know Kush Maini, I want everybody in India cheering him. I want them to feel that he's going to be a winner in F1. Of course, it requires very hard work and a lot of sacrifices. Because of my experience in this motor racing world, I do understand (the importance of) timing, being in the right team, having the right partners, working with the right people is crucial,” said Hakkinen. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics Formula One","pubDate":"2023-10-12 18:09:34","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/12/1600x900/157b47fc-b481-dfd0-b8f9-c1185d96b3bf_1669136771097_1697133906975.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"df276849ed4ce25c5047fef84ae95ccf","title":"Neeraj has potential to become a star as big as Bolt: Eaton","link":"https://www.hindustantimes.com/cricket/neeraj-has-potential-to-become-a-star-as-big-as-bolt-eaton-101697133442096.html","keywords":null,"creator":null,"video_url":null,"description":"Two-time Olympic champion in the decathlon, Ashton Eaton, feels that the Indian, and not Lyles, could be the man to match the Jamaican in the popularity stakes","content":"It has been six years since Usain Bolt hung up his golden shoes, but the world of athletics is still searching for the next mega star who can take the sport to newer heights like the eight-time Olympic champion did. India's Neeraj Chopra in action.(PTI) Many have suggested that six-time world champion Noah Lyles could be the star track and field is searching for — he runs the same events as Bolt, has a magnetic personality and the closest anyone has come to matching the Jamaican’s world records. But two-time Olympic champion in decathlon Ashton Eaton feels that India’s Neeraj Chopra and not Lyles could be that celebrity. We're now on WhatsApp. Click to join. \"Neeraj is great. Bolt was the right archetype... 100m, 200m are popular events, his name is Bolt, he is flashy which captured the attention of the track and field audience in the world but maybe somebody like Neeraj can surpass him because he has got the support of one of the most populous places in the world,\" said Eaton, who landed here on Thursday as the international event ambassador for the Vedanta Delhi Half Marathon on Sunday. “Maybe there’s a way that India pushes him to that level or even beyond. Neeraj is right now more popular on social media than all the top competing track athletes on all their platforms combined. He has 7.2 million followers on Instagram. Lyles has (slightly more than) half a million. But then we look at Bolt and he has 13.5 million and he's not even competing anymore. So, Neeraj has the potential because of the population here. Plus, he is in advertisements everywhere. He is a very busy guy.” Eaton knows a thing or two about defending an Olympic crown. He is one of those rare athletes who won successive Olympic gold medals at London 2012 and Rio 2016. Next year, Chopra will be in the same spot as he will be defending his javelin gold in Paris. The javelin superstar last week won the Asian Games gold in Hangzhou which was the first time the reigning world champion defended a major title. But it wasn’t before compatriot Kishore Jena pushed Chopra to throw his season’s best throw of 88.88m to win the competition. Though Chopra has been in sizzling form this year, but in Paris 2024 he will be the target with all others aiming to snatch the crown off his head. “I think he is going to have a lot more pressure. When you’re young, nobody expects you to win. If you don’t win then they’re like ‘it’s alright, you tried’. If you win, it’s like wow. Next time when you don’t win there will be questions like ‘What’s your problem? What happened? If you do win, you were supposed to. So, it’s a different kind of an approach. Every single person he talks to will be like: can you do the double? In case he doesn’t, you'll be like Neeraj what happened? You were supposed to win,\" said Eaton, who is the only man to have crossed the 9,000-point barrier twice in decathlon. Chopra himself admitted that defending the title in Paris will be a huge challenge since maintaining top form consistently isn’t easy. \"Defending my Olympic gold could be tough because there is pressure and expectations from the people. Maintaining top form for many years is challenging but my endeavour will be to prepare in the best possible way and give my best in Paris,\" Chopra, who on Thursday was nominated along with 10 others for the Men’s World Athlete of the Year, told PTI. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics Neeraj Chopra Usain Bolt","pubDate":"2023-10-12 18:07:18","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/12/1600x900/PTI10-04-2023-000598A-0_1697133500967_1697133605615.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"597a9ed5167757c286c9f1102c7bbac9","title":"AUS vs SA: સાઉથ આફ્રિકાએ 5 વખતના વિશ્વ ચેમ્પિયન ઓસ્ટ્રેલીયાને 134 રને હરાવ્યું","link":"https://gujarati.abplive.com/sports/cricket/world-cup-2023-south-africa-beat-australia-by-134-runs-861280","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"AUS vs SA Match Report:  ભારત બાદ ઓસ્ટ્રેલિયાની દક્ષિણ આફ્રિકા સામે પણ હાર થઈ છે. પેટ કમિન્સની ટીમને 134 રનના વિશાળ અંતરથી હારનો સામનો કરવો પડ્યો છે. ઓસ્ટ્રેલિયાને જીતવા માટે 312 રનનો ટાર્ગેટ હતો. પરંતુ કાંગારૂ ટીમ 40.5 ઓવરમાં 177 રન પર જ સિમિત રહી હતી. આ રીતે ટેમ્બા બાવુમાની ટીમને મોટી જીત મળી છે.   A second successive #CWC23 ton helps Quinton de Kock win the @aramco #POTM ⚡#AUSvSA pic.twitter.com/eK1iogZQ6n — ICC (@ICC) October 12, 2023 સાઉથ આફ્રિકાના બોલરો સામે ઓસ્ટ્રેલિયાનો ટોપ ઓર્ડર ધરાશાયી  દક્ષિણ આફ્રિકાના 311 રનના જવાબમાં કાંગારૂ ટીમની શરૂઆત ખૂબ જ ખરાબ રહી હતી. ઓસ્ટ્રેલિયાનો ઓપનર મિચેલ માર્શ 7 રન બનાવીને આઉટ થયો હતો. આ પછી ડેવિડ વોર્નર 27 બોલમાં 13 રન બનાવીને પેવેલિયન ગયો હતો. આ સિલસિલો અહીં અટક્યો ન હતો… આ પછી જોશ ઇંગ્લિશ, ગ્લેન મેક્સવેલ અને માર્કસ સ્ટોઇનિસ પણ સસ્તામાં આઉટ થયા હતા. ઓસ્ટ્રેલિયાના 5 બેટ્સમેન 65 રન બનાવીને પેવેલિયન પરત ફર્યા હતા. આ ટીમને 70 રનના સ્કોર પર છઠ્ઠો ઝટકો લાગ્યો હતો. જો કે માર્નસ લાબુશેન અને મિશેલ સ્ટાર્ક વચ્ચે 69 રનની ભાગીદારી થઈ હતી. બંને ખેલાડીઓએ હારના માર્જિનને ઘટાડવાનો પૂરો પ્રયાસ કર્યો હતો, પરંતુ મિચેલ સ્ટાર્ક 51 બોલમાં 27 રન બનાવીને આઉટ થયો હતો. આ પછી માર્નસ લાબુશેન પણ કેશવ મહારાજના બોલ પર આઉટ થયો હતો. આવી રહીકાંગારૂ બેટ્સમેનની હાલત... મિશેલ માર્શને માર્કો યોન્સેને આઉટ કર્યો હતો. તો બીજી તરફ, ડેવિડ વોર્નર લુંગી એનગિડીના બોલ પર આઉટ થયો હચો. કાગિસો રબાડાના બોલ પર સ્ટીવ સ્મિથ પેવેલિયન પરત ફર્યો હતો. જોશ ઈંગ્લિશને કાગીસો રબાડાએ બોલ્ડ આઉટ કર્યો હતો. કેશવ મહારાજના બોલ પર ઓસ્ટ્રેલિયાનો ઓલરાઉન્ડર ગ્લેન મેક્સવેલ પણ આસાન કેચ આપી બેઠો હતો. જો કે ઓસ્ટ્રેલિયન ટીમને માર્કસ સ્ટોઈનિસને જે રીતે આઉટ આપવામાં આવ્યો તે પસંદ ન આવ્યું. માર્કસ સ્ટોઇનિસને આઉટ આપ્યા બાદ થયો વિવાદ વાસ્તવમાં, કાગિસો રબાડાના બોલ પર આઉટ થયા બાદ માર્કસ સ્ટોઇનિસ ખૂબ જ નાખુશ દેખાતો હતો. માર્કસ સ્ટોઇનિસ અમ્પાયર સાથે વાત કરતો રહ્યો, પરંતુ થર્ડ અમ્પાયરે માન્યું કે બોલ ઓસ્ટ્રેલિયન ઓલરાઉન્ડરના ગ્લોવ્ઝમાં વાગીને ગયો હતો. આ રીતે માર્કસ સ્ટોઈનિસને પેવેલિયન પરત ફરવું પડ્યું હતું. દક્ષિણ આફ્રિકા માટે કાગિસો રબાડા સૌથી સફળ બોલર રહ્યો હતો. કાગિસો રબાડાએ 10 ઓવરમાં 23 રન આપીને 3 વિકેટ લીધી હતી. માર્કો યોન્સેન, કેશવ મહારાજ અને તબરેઝ શમ્સીને 1-1 સફળતા મળી. લુંગી એનગિડીએ ડેવિડ વોર્નરને આઉટ કર્યો હતો. ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીત્યો હતો આ પહેલા ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીતીને બોલિંગ કરવાનો નિર્ણય લીધો હતો. દક્ષિણ આફ્રિકાએ 50 ઓવરમાં 7 વિકેટે 311 રન બનાવ્યા હતા. દક્ષિણ આફ્રિકા તરફથી ક્વિન્ટન ડી કોકે 106 બોલમાં 109 રન બનાવ્યા હતા. એડન માર્કરમે 44 બોલમાં 56 રન બનાવ્યા હતા. ઓસ્ટ્રેલિયા તરફથી મિચેલ સ્ટાર્ક અને ગ્લેન મેક્સવેલે 2-2 વિકેટ ઝડપી હતી. આ સિવાય જોશ હેઝલવુડ, પેટ કમિન્સ અને એડમ ઝમ્પાને 1-1 સફળતા મળી હતી.","content":"AUS vs SA Match Report: ભારત બાદ ઓસ્ટ્રેલિયાની દક્ષિણ આફ્રિકા સામે પણ હાર થઈ છે. પેટ કમિન્સની ટીમને 134 રનના વિશાળ અંતરથી હારનો સામનો કરવો પડ્યો છે. ઓસ્ટ્રેલિયાને જીતવા માટે 312 રનનો ટાર્ગેટ હતો. પરંતુ કાંગારૂ ટીમ 40.5 ઓવરમાં 177 રન પર જ સિમિત રહી હતી. આ રીતે ટેમ્બા બાવુમાની ટીમને મોટી જીત મળી છે. A second successive #CWC23 ton helps Quinton de Kock win the @aramco #POTM ⚡ #AUSvSA pic.twitter.com/eK1iogZQ6n — ICC (@ICC) October 12, 2023 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); સાઉથ આફ્રિકાના બોલરો સામે ઓસ્ટ્રેલિયાનો ટોપ ઓર્ડર ધરાશાયી દક્ષિણ આફ્રિકાના 311 રનના જવાબમાં કાંગારૂ ટીમની શરૂઆત ખૂબ જ ખરાબ રહી હતી. ઓસ્ટ્રેલિયાનો ઓપનર મિચેલ માર્શ 7 રન બનાવીને આઉટ થયો હતો. આ પછી ડેવિડ વોર્નર 27 બોલમાં 13 રન બનાવીને પેવેલિયન ગયો હતો. આ સિલસિલો અહીં અટક્યો ન હતો… આ પછી જોશ ઇંગ્લિશ, ગ્લેન મેક્સવેલ અને માર્કસ સ્ટોઇનિસ પણ સસ્તામાં આઉટ થયા હતા. ઓસ્ટ્રેલિયાના 5 બેટ્સમેન 65 રન બનાવીને પેવેલિયન પરત ફર્યા હતા. આ ટીમને 70 રનના સ્કોર પર છઠ્ઠો ઝટકો લાગ્યો હતો. જો કે માર્નસ લાબુશેન અને મિશેલ સ્ટાર્ક વચ્ચે 69 રનની ભાગીદારી થઈ હતી. બંને ખેલાડીઓએ હારના માર્જિનને ઘટાડવાનો પૂરો પ્રયાસ કર્યો હતો, પરંતુ મિચેલ સ્ટાર્ક 51 બોલમાં 27 રન બનાવીને આઉટ થયો હતો. આ પછી માર્નસ લાબુશેન પણ કેશવ મહારાજના બોલ પર આઉટ થયો હતો. આવી રહીકાંગારૂ બેટ્સમેનની હાલત... મિશેલ માર્શને માર્કો યોન્સેને આઉટ કર્યો હતો. તો બીજી તરફ, ડેવિડ વોર્નર લુંગી એનગિડીના બોલ પર આઉટ થયો હચો. કાગિસો રબાડાના બોલ પર સ્ટીવ સ્મિથ પેવેલિયન પરત ફર્યો હતો. જોશ ઈંગ્લિશને કાગીસો રબાડાએ બોલ્ડ આઉટ કર્યો હતો. કેશવ મહારાજના બોલ પર ઓસ્ટ્રેલિયાનો ઓલરાઉન્ડર ગ્લેન મેક્સવેલ પણ આસાન કેચ આપી બેઠો હતો. જો કે ઓસ્ટ્રેલિયન ટીમને માર્કસ સ્ટોઈનિસને જે રીતે આઉટ આપવામાં આવ્યો તે પસંદ ન આવ્યું. માર્કસ સ્ટોઇનિસને આઉટ આપ્યા બાદ થયો વિવાદ વાસ્તવમાં, કાગિસો રબાડાના બોલ પર આઉટ થયા બાદ માર્કસ સ્ટોઇનિસ ખૂબ જ નાખુશ દેખાતો હતો. માર્કસ સ્ટોઇનિસ અમ્પાયર સાથે વાત કરતો રહ્યો, પરંતુ થર્ડ અમ્પાયરે માન્યું કે બોલ ઓસ્ટ્રેલિયન ઓલરાઉન્ડરના ગ્લોવ્ઝમાં વાગીને ગયો હતો. આ રીતે માર્કસ સ્ટોઈનિસને પેવેલિયન પરત ફરવું પડ્યું હતું. દક્ષિણ આફ્રિકા માટે કાગિસો રબાડા સૌથી સફળ બોલર રહ્યો હતો. કાગિસો રબાડાએ 10 ઓવરમાં 23 રન આપીને 3 વિકેટ લીધી હતી. માર્કો યોન્સેન, કેશવ મહારાજ અને તબરેઝ શમ્સીને 1-1 સફળતા મળી. લુંગી એનગિડીએ ડેવિડ વોર્નરને આઉટ કર્યો હતો. ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીત્યો હતો આ પહેલા ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીતીને બોલિંગ કરવાનો નિર્ણય લીધો હતો. દક્ષિણ આફ્રિકાએ 50 ઓવરમાં 7 વિકેટે 311 રન બનાવ્યા હતા. દક્ષિણ આફ્રિકા તરફથી ક્વિન્ટન ડી કોકે 106 બોલમાં 109 રન બનાવ્યા હતા. એડન માર્કરમે 44 બોલમાં 56 રન બનાવ્યા હતા. ઓસ્ટ્રેલિયા તરફથી મિચેલ સ્ટાર્ક અને ગ્લેન મેક્સવેલે 2-2 વિકેટ ઝડપી હતી. આ સિવાય જોશ હેઝલવુડ, પેટ કમિન્સ અને એડમ ઝમ્પાને 1-1 સફળતા મળી હતી.","pubDate":"2023-10-12 17:19:25","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/12/a8ebbe41880ae2533dd804ad9e9b9fe91697130575427397_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"e425c615fd776415ec9db21cf3e67b83","title":"Kal Ka Match Kaun Jeeta: कल का मैच कौन जीता- ऑस्ट्रेलिया vs दक्षिण अफ्रीका","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kaun-jeeta-australia-vs-south-africa-world-cup-2023-832841.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kaun Jeeta: कल का मैच ऑस्ट्रेलिया और दक्षिण अफ्रीका के बीच खेला गया। ऑस्ट्रेलिया की टीम को दक्षिण अफ्रीका के सामने हार का सामना करना पड़ा।","content":"कल का मैच दक्षिण अफ्रीका और ऑस्ट्रेलिया के बीच खेला गया था। लखनऊ में खेले गए इस मुकाबले में दक्षिण अफ्रीका पूरी तरह से हावी रही। पहले बैटिंग करते हुए दक्षिण अफ्रीका ने 7 विकेट पर 311 रनों का स्कोर खड़ा किया। जवाब में खेलते हुए ऑस्ट्रेलियाई टीम 177 रन बनाकर आउट हो गई। दक्षिण अफ्रीका के लिए धाकड़ फॉर्म में चल रहे ओपनर बल्लेबाज क्विंटन डी कॉक ने एक बार फिर से धमाका कर दिया। डी कॉक के बल्ले से शतकीय पारी देखने को मिली। वह 106 रन बनाकर आउट हो गए। उनके अलावा एडेन मार्करम के बल्ले भी अर्धशतक देखने को मिला। दक्षिण अफ़्रीकी टीम का स्कोर एक समय 350 से ऊपर जाने वाला था लेकिन ऑस्ट्रेलियाई गेंदबाजों ने वापसी कर ली। ऑस्ट्रेलिया के लिए सबसे ज्यादा विकेट लेने वाले गेंदबाज मिचेल स्टार्क और ग्लेन मैक्सवेल थे। दोनों के खाते में 2-2 विकेट आए। जवाबी पारी में खेलते हुए ऑस्ट्रेलियाई टीम ने एक के बाद एक विकेट गंवाए। दक्षिण अफ़्रीकी गेंदबाजों ने कंगारुओं को संभलने का मौका ही नहीं दिया। सबसे ज्यादा रन बनाने वाले बल्लेबाज मार्नस लाबुशेन थे। उनके बल्ले से 46 रनों की पारी देखने को मिली। ऑस्ट्रेलियाई टीम 177 रन बनाकर आउट हो गई। रबाडा ने घातक गेंदबाजी का प्रदर्शन करते हुए 3 विकेट अपने नाम किये। उनके अलावा केशव महाराज और मार्को यानसेन को 2-2 विकेट मिले उनके अलावा तबरेज शम्सी के खाते में भी कुल 2 विकेट आए। ऑस्ट्रेलिया की टीम को लगातार इस वर्ल्ड कप में दूसरी बार हार का सामना करना पड़ा है। क्विंटन डी कॉक (विकेटकीपर), टेम्बा बावुमा (कप्तान), रासी वान डेर डुसेन, एडेन मार्कराम, हेनरिक क्लासेन, डेविड मिलर, मार्को जानसन, केशव महाराज, लुंगी एनगिडी, कैगिसो रबाडा, तबरेज़ शम्सी। डेविड वार्नर, मिशेल मार्श, स्टीवन स्मिथ, मार्नस लाबुशेन, जोश इंग्लिस (डब्ल्यू), ग्लेन मैक्सवेल, मार्कस स्टोइनिस, पैट कमिंस (सी), मिशेल स्टार्क, एडम ज़म्पा, जोश हेज़लवुड।","pubDate":"2023-10-12 17:11:33","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a7156056011dfea60fa3c3d1f38bfd02","title":"ज़िला स्तरीय क्रिकेट चयन प्रतियोगिता सम्पन्न","link":"https://avadhnama.com/district-level-cricket-selection-competition-concluded/","keywords":["Marquee","Sports","Uttar Pradesh","avadhnama","District level cricket selection competition concluded"],"creator":["Farheen Rizvi"],"video_url":null,"description":"अवधनामा संवाददाता इटावा। जिला स्तरीय क्रिकेट चयन प्रतियोगिता अंडर 14 वर्ष का उद्घाटन डॉ.अजंट सिंह यादव अध्यक्ष इटावा अर्बन कोओपरेटिव बैंक के मुख्य आतिथ्य में महात्मा ज्योतिबा फुले स्पोर्ट स्टेडियम में संपन्न हुआ।विशिष्ट अतिथि डॉ मुकेश यादव,परमजीत सिंह जिला क्रीड़ा अधिकारी इटावा,राजेंद्र प्रसाद अध्यक्ष प्रधानाचार्य परिषद,महामंत्री, संजय शर्मा प्रधानाचार्यगण गुफरान अहमद,जगदीश सिंह,बृजेश कुमार ,डॉक्टर शिव […] The post ज़िला स्तरीय क्रिकेट चयन प्रतियोगिता सम्पन्न appeared first on Avadhnama.","content":"जिला स्तरीय क्रिकेट चयन प्रतियोगिता अंडर 14 वर्ष का उद्घाटन डॉ.अजंट सिंह यादव अध्यक्ष इटावा अर्बन कोओपरेटिव बैंक के मुख्य आतिथ्य में महात्मा ज्योतिबा फुले स्पोर्ट स्टेडियम में संपन्न हुआ।विशिष्ट अतिथि डॉ मुकेश यादव,परमजीत सिंह जिला क्रीड़ा अधिकारी इटावा,राजेंद्र प्रसाद अध्यक्ष प्रधानाचार्य परिषद,महामंत्री, संजय शर्मा प्रधानाचार्यगण गुफरान अहमद,जगदीश सिंह,बृजेश कुमार ,डॉक्टर शिव कुमार,पवन यादव आदि उपस्थित रहे।संयोजक डॉ.उमेश यादव ने मुख्य अतिथि,विशिष्ट अतिथि को शाल भेंट कर एवं सभी प्रधानाचार्ययों को प्रतीक चिन्ह देकर स्वागत किया।मुख्य अतिथि ने अपने संबोधन में कहा कि खिलाड़ियों को अभ्यास निरंतर करते रहना चाहिए और प्रतियोगिताओं में प्रतिभा करना चाहिए,साथ ही सभी खिलाड़ियों को आशीर्वाद प्रदान कर परिचय प्राप्त किया और मंडलीय प्रतिस्पर्धा के लिए सुभाशीश दिया।चयन समिति में जनपद के व्यायाम शिक्षक आशुतोष वर्मा आशा वशिष्ठ नाजिश शाहिद रमेश कुमार हिमांशु आदि की महत्वपूर्ण भूमिका रही।चयन प्रतियोगिता में जनपद के तीन दर्जन खिलाड़ी प्रतियोगिता में आये।चयनित प्रतिभागी मंडलीय क्रीडा प्रतियोगिता में प्रतिभाग करेंगे प्रतियोगिता में श्री चित्रगुप्त इंटर कॉलेज के शिक्षक राकेश डॉ विपिन कुमार संतोष कुमार सिंह रमेश चौधरी चेतन जैन आदि का सहयोग रहा।अंत में संयोजक ने सभी अतिथियों का आभार व्यक्त किया।","pubDate":"2023-10-12 17:00:43","image_url":null,"source_id":"avadhnama","source_priority":20736955,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"42eed33784d2e972df625e5b9b62563d","title":"Premier League icon mocked Gareth Southgate after Australia beat England","link":"https://www.dailystar.co.uk/sport/football/mark-schwarzer-gareth-southgate-england-31176991","keywords":["Sport"],"creator":null,"video_url":null,"description":"England boss Gareth Southgate has warned his players they risk handing Australia bragging rights if they slip up in their friendly at Wembley on Wednesday night","content":"has warned his stars to be aware of the Aussie boasting if they slip up at Wembley. The Three Lions boss has bad memories of team-mate Mark Schwarzer turning up with an inflatable kangaroo after the Socceroos beat England when they last met in 2003 at Upton Park. Southgate’s side are set to lock horns with the Aussies tonight as he implored fringe players to be given an opportunity to take their chance. Despite rivalries between the nations being bigger in cricket and rugby, his other concern is avoiding a repeat of 2003 when Schwarzer rubbed the 3-1 win in on his return to the North East. The England boss said: “We’ve talked to the players about the England-Australia sporting rivalry and we know what that means. \"I played with a lot of Aussies and when they beat us at Upton Park they were pretty quick to come back to Middlesbrough. Schwarzer had a blow up kangaroo under his arm and he was making hay with it all. “There’s plenty of rivalry going on. \"I think it is generally a sporting rivalry. I suppose I keep having to say to our players before these games ‘Look lads, this another country that doesn’t particularly like us, so get prepared for that, they want to make hay and beat us’. They’ll be highly motivated.\" Southgate may give some players a chance tonight that may not feature in Tuesday’s Euro 2024 qualifier with Italy to show they’re worth a spot in his squad for next summer. He said: \"We have six matches before we name a squad in all likelihood for a European Championship. And so if people are going to have the chance to force their way into that squad, or that team, we need to play them. Prime Video is available as part of the Amazon Prime membership, which costs £8.99 per month or £95 annually for an individual. Prime Student You can also sign-up for Prime Video on its own for £5.99 per month, however, you won’t get the other benefits that come with Prime — like free One-Day Delivery and Same-Day Delivery on eligible orders and fast grocery delivery and pickup. £5.99 per month for Prime Video only, or £8.99 per month for Amazon Prime membership \"And also when you are keeping a squad and a spirit of a squad together people need the chance to play to really feel part of that. It is an important night for a lot of players, they will recognise that.\"","pubDate":"2023-10-12 22:06:55","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31176963.ece/ALTERNATES/s98/0_Goalkeeper-Mark-Schwarzer-of-Australia-attempts-to-tackle-Michael-Owen-of-England.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"182fcdff42897e2faa7c8e8dc2aa7b95","title":"Joyriders wreck cricket pitch again","link":"https://times-age.co.nz/sports/joyriders-wreck-cricket-pitch-again/","keywords":["Cricket","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Vandalism at Masterton’s Queen Elizabeth Park Oval has forced the moving of tomorrow’s inaugural North vs South match to the Hadlow artificial pitch. The game for the ‘Seth Rance Bat’ was to be the first on grass this season and was being used by new Post Office Hotel Wairarapa coach Mark Childs as an important […]","content":"Vandalism at Masterton’s Queen Elizabeth Park Oval has forced the moving of tomorrow’s inaugural North vs South match to the Hadlow artificial pitch. The game for the ‘Seth Rance Bat’ was to be the first on grass this season and was being used by new Post Office Hotel Wairarapa coach Mark Childs as an important buildup for the first Furlong Cup match in a fortnight against Taranaki. However, damage caused by a car to the outfield and across the northern end of the pitch block left Wairarapa Cricket with no option but to move the game from their traditional home, much to the frustration of general manager Simon Roseingrave. “It’s disappointing because we’ve probably had the best spring for a few years; the season has felt the best planned it has been for a few years; everybody was ready to go, and the North-South fixture, which was the inaugural game and an exciting way to start the season and we don’t have the use of our main facility,” Roseingrave said. “It makes us nervous in terms of when the season can get on the block. We’re still hopeful for the Bidwill Cup on the 21st, but it all depends on what Rec Services can do to fix it with a bit of rolling and cutting and see what it looks like.” Roseingrave reckoned that it’s probably the fourth or fifth time in his 10 years in the role that such vandalism has occurred, and he intends to talk with Masterton District Council to see what security improvements can be made. “There’s no way we want to block off the park because it’s such a fantastic asset to the whole community, but we just need some community understanding about how it impacts an organisation like us.” The Masterton District Council has asked police to review CCTV footage from the area to identify the culprits. The council’s manager of community facilities and activities, Corin Haines, confirmed the park was unsafe to play on and would be closed to cricket this weekend. “A huge amount of work has been done to prepare the pitch for the cricket season after a very wet winter,” Haines said. “To see carefully prepared turf ripped up by this act of idiocy is heartbreaking, even for people not involved in cricket.” Haines said any information on who is responsible should be passed to police. It is thought the vehicle accessed the park via the green space opposite the Trust House Recreation Centre at about 3.45 a.m. yesterday. Despite Mark Childs’ disappointment that the players won’t get their first chance to play on grass, he is keen to see a step up from their first outing last Saturday. That one-day game resulted in a loss to Petone-Riverside, who scored 278 after being 160–6. Wairarapa fell about 40 runs short, with Robbie Anderson [40] and Ethan Childs [35] impressing in an opening stand of 75 before the latter was forced to retire after putting out his shoulder when playing a drive over cover. The injury could also have ramifications for the bowling depth for the start of the rep season, with the allrounder a spearhead in the medium-pace attack. Jack Wakeling also stood out with a half-century. Mark Childs said tomorrow’s game will be played under Furlong Cup conditions, with 112 overs for the day, and the team batting first limited to 60 overs. The teams will play for the ‘Seth Rance Bat’ to add a bit of spice to the contest. The South side has been boosted with some players from North clubs so they can field a competitive team. Play will get underway at 10.30 am. North – Robbie Anderson [c], George Deans, Jeremy Anderson, Mark Steventon, Jaco Vorster, Jack Wakeling, Nathan Elliott, Samuel Payne, Shamal Perera, Hugo Wakeling, Patrick Wootton, Trey Bidois South – Quinn Childs [c], Hayden Ray, Caleb Burling, Robbie Speers, Rudo Erasmus, Seth Rance, Ed Lord, Cuong “Chopper” Troung, James Church, Angus Jaspers, Guyan Dissanayake, Alex Mason","pubDate":"2023-10-12 21:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/10/RS507423_20231012_091801-scaled-e1697091093597-1024x942.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"db2c3fc5c1824072110ddd22754f7aa1","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.southwalesguardian.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.southwalesguardian.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0cf9764000211fab3655117debaa4e5d","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.northwalespioneer.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.northwalespioneer.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0a5280c5fdfcc0dac0f5ac53458d3a4d","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.northwaleschronicle.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ed07a99a935dfc954013152e95973d6c","title":"F1 great Hakkinen to mentor Indian F2 driver Maini","link":"https://www.hindustantimes.com/sports/others/f1-great-hakkinen-to-mentor-indian-f2-driver-maini-101697133770097.html","keywords":null,"creator":null,"video_url":null,"description":"Maini is currently India’s best hope to enter F1 after Daruvala, will be switching to Formula E next year after signing a contract with Maserati last month","content":"Indian racing driver Kush Maini will be mentored by two-time Formula 1 world champion Mika Hakkinen to help the 23-year-old realise his dream of racing at the pinnacle of motorsport. Kush Maini is currently driving for Campos Racing. Maini is currently driving for Campos Racing in his rookie season in Formula 2 – the primary feeder series for F1 – and has bagged 60 points that includes a podium in Melbourne to be 11th in the championship, a spot better than compatriot Jehan Daruvala. We're now on WhatsApp. Click to join. Maini is currently India’s best hope to enter F1 after Daruvala, who after driving for four seasons in F2, will be switching to Formula E next year after signing a contract with Maserati last month. Hakkinen is throwing his weight behind the young prodigy, stating their target is very clear: “F1 is our objective.” The Finn’s track record in mentoring aspiring F1 drivers is well known, having played a significant role in the development of 10-time race winner and current Alfa Romeo Sauber driver Valtteri Bottas. Having an F1 champion in your corner means a young driver can focus on the essentials over a race weekend, learn how to win bragging rights within a team and optimise communications. It also provides powerful business leverage, connecting with sponsors. With Hakkinen applying his management techniques and processes, Maini believes that he can challenge at the front in 2024 F2. “From next year, my approach and that of my team is going to be a lot more structured thanks to Mika. Having a trainer who's looking after your nutrition at the track and a mind coach looking after anything you're going through on a race weekend will allow me to focus on driving. Basically, the way Mika works is you narrow down everything to the point where the driver just has one job,\" said Maini. Maini, who hails from Bengaluru, is the younger brother of Arjun Maini, who raced in F2 and was a development driver for Haas F1 team. He currently competes in sports car racing for Mercedes AMG in Europe. “I've watched Mika since I was very young. And I know everything he has achieved in this sport. So just for him to believe that I could reach Formula One shows that we've done something right in these last 15 years. It’s a massive weapon you have in your arsenal when you have Mika Hakkinen standing behind you,” said Maini. “Having Mika behind me, my whole team being created now and not having to stress about racing, it's a very exciting time for myself and I feel I haven't showed anywhere near what I am capable of in the car.\" Known as ‘The Flying Finn’, the 55-year-old Hakkinen won two F1 championships in 1998 and 1999 for McLaren and was the great Michael Schumacher’s primary adversary in those years. During his time in F1 that ranged from 1991 to 2001, Hakkinen notched 20 race wins, 51 podiums and 26 pole positions. \"I have a lot of experience from working with Valtteri Bottas seeing him developing and growing as a driver. More recently I’ve been following Kush, understanding his abilities, his talent for driving. It’s a very interesting journey together to develop, to be an even more of a professional racing driver. F1 is our objective, not forgetting the current situation (in F2),\" said Hakkinen. Hakkinen will not be a blow-by-blow driver coach, teaching Maini cornering techniques. “I don't think I have to put my nose into that,” added the Finn. Hakkinen defines his role as leveraging the tools of “communication and the network that I have. These assets are very powerful when looking after a young talented driver. I've been an ambassador and part of F1 since 1991. It's an asset and the power that I have to take this young driver into the right places at the right time.” “Of course, India is an enormous, powerful country. I’m part of bringing a young driver from India to Formula One, bringing these mega companies, learning to understand the opportunities that F1 can bring them. And vice versa, what F1 can experience and create with India. I can only see beautiful success stories,\" said Hakkinen. India hosted three Formula 1 races at the Buddh International Circuit (BIC) in Greater Noida from 2011 to 2013 before the Indian Grand Prix ran into tax, bureaucratic and financial hurdles. The country has also produced two F1 drivers; Narain Karthikeyan, who did two full seasons in 2005 and 2012 and half a season in 2011, and Karun Chandhok, who raced half a season in 2010 and one race in 2011 in F1. \"India is going to be very powerful and I want all Indians to know Kush Maini, I want everybody in India cheering him. I want them to feel that he's going to be a winner in F1. Of course, it requires very hard work and a lot of sacrifices. Because of my experience in this motor racing world, I do understand (the importance of) timing, being in the right team, having the right partners, working with the right people is crucial,” said Hakkinen. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics Formula One","pubDate":"2023-10-12 18:09:34","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/12/1600x900/157b47fc-b481-dfd0-b8f9-c1185d96b3bf_1669136771097_1697133906975.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"df276849ed4ce25c5047fef84ae95ccf","title":"Neeraj has potential to become a star as big as Bolt: Eaton","link":"https://www.hindustantimes.com/cricket/neeraj-has-potential-to-become-a-star-as-big-as-bolt-eaton-101697133442096.html","keywords":null,"creator":null,"video_url":null,"description":"Two-time Olympic champion in the decathlon, Ashton Eaton, feels that the Indian, and not Lyles, could be the man to match the Jamaican in the popularity stakes","content":"It has been six years since Usain Bolt hung up his golden shoes, but the world of athletics is still searching for the next mega star who can take the sport to newer heights like the eight-time Olympic champion did. India's Neeraj Chopra in action.(PTI) Many have suggested that six-time world champion Noah Lyles could be the star track and field is searching for — he runs the same events as Bolt, has a magnetic personality and the closest anyone has come to matching the Jamaican’s world records. But two-time Olympic champion in decathlon Ashton Eaton feels that India’s Neeraj Chopra and not Lyles could be that celebrity. We're now on WhatsApp. Click to join. \"Neeraj is great. Bolt was the right archetype... 100m, 200m are popular events, his name is Bolt, he is flashy which captured the attention of the track and field audience in the world but maybe somebody like Neeraj can surpass him because he has got the support of one of the most populous places in the world,\" said Eaton, who landed here on Thursday as the international event ambassador for the Vedanta Delhi Half Marathon on Sunday. “Maybe there’s a way that India pushes him to that level or even beyond. Neeraj is right now more popular on social media than all the top competing track athletes on all their platforms combined. He has 7.2 million followers on Instagram. Lyles has (slightly more than) half a million. But then we look at Bolt and he has 13.5 million and he's not even competing anymore. So, Neeraj has the potential because of the population here. Plus, he is in advertisements everywhere. He is a very busy guy.” Eaton knows a thing or two about defending an Olympic crown. He is one of those rare athletes who won successive Olympic gold medals at London 2012 and Rio 2016. Next year, Chopra will be in the same spot as he will be defending his javelin gold in Paris. The javelin superstar last week won the Asian Games gold in Hangzhou which was the first time the reigning world champion defended a major title. But it wasn’t before compatriot Kishore Jena pushed Chopra to throw his season’s best throw of 88.88m to win the competition. Though Chopra has been in sizzling form this year, but in Paris 2024 he will be the target with all others aiming to snatch the crown off his head. “I think he is going to have a lot more pressure. When you’re young, nobody expects you to win. If you don’t win then they’re like ‘it’s alright, you tried’. If you win, it’s like wow. Next time when you don’t win there will be questions like ‘What’s your problem? What happened? If you do win, you were supposed to. So, it’s a different kind of an approach. Every single person he talks to will be like: can you do the double? In case he doesn’t, you'll be like Neeraj what happened? You were supposed to win,\" said Eaton, who is the only man to have crossed the 9,000-point barrier twice in decathlon. Chopra himself admitted that defending the title in Paris will be a huge challenge since maintaining top form consistently isn’t easy. \"Defending my Olympic gold could be tough because there is pressure and expectations from the people. Maintaining top form for many years is challenging but my endeavour will be to prepare in the best possible way and give my best in Paris,\" Chopra, who on Thursday was nominated along with 10 others for the Men’s World Athlete of the Year, told PTI. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics Neeraj Chopra Usain Bolt","pubDate":"2023-10-12 18:07:18","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/12/1600x900/PTI10-04-2023-000598A-0_1697133500967_1697133605615.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"597a9ed5167757c286c9f1102c7bbac9","title":"AUS vs SA: સાઉથ આફ્રિકાએ 5 વખતના વિશ્વ ચેમ્પિયન ઓસ્ટ્રેલીયાને 134 રને હરાવ્યું","link":"https://gujarati.abplive.com/sports/cricket/world-cup-2023-south-africa-beat-australia-by-134-runs-861280","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"AUS vs SA Match Report:  ભારત બાદ ઓસ્ટ્રેલિયાની દક્ષિણ આફ્રિકા સામે પણ હાર થઈ છે. પેટ કમિન્સની ટીમને 134 રનના વિશાળ અંતરથી હારનો સામનો કરવો પડ્યો છે. ઓસ્ટ્રેલિયાને જીતવા માટે 312 રનનો ટાર્ગેટ હતો. પરંતુ કાંગારૂ ટીમ 40.5 ઓવરમાં 177 રન પર જ સિમિત રહી હતી. આ રીતે ટેમ્બા બાવુમાની ટીમને મોટી જીત મળી છે.   A second successive #CWC23 ton helps Quinton de Kock win the @aramco #POTM ⚡#AUSvSA pic.twitter.com/eK1iogZQ6n — ICC (@ICC) October 12, 2023 સાઉથ આફ્રિકાના બોલરો સામે ઓસ્ટ્રેલિયાનો ટોપ ઓર્ડર ધરાશાયી  દક્ષિણ આફ્રિકાના 311 રનના જવાબમાં કાંગારૂ ટીમની શરૂઆત ખૂબ જ ખરાબ રહી હતી. ઓસ્ટ્રેલિયાનો ઓપનર મિચેલ માર્શ 7 રન બનાવીને આઉટ થયો હતો. આ પછી ડેવિડ વોર્નર 27 બોલમાં 13 રન બનાવીને પેવેલિયન ગયો હતો. આ સિલસિલો અહીં અટક્યો ન હતો… આ પછી જોશ ઇંગ્લિશ, ગ્લેન મેક્સવેલ અને માર્કસ સ્ટોઇનિસ પણ સસ્તામાં આઉટ થયા હતા. ઓસ્ટ્રેલિયાના 5 બેટ્સમેન 65 રન બનાવીને પેવેલિયન પરત ફર્યા હતા. આ ટીમને 70 રનના સ્કોર પર છઠ્ઠો ઝટકો લાગ્યો હતો. જો કે માર્નસ લાબુશેન અને મિશેલ સ્ટાર્ક વચ્ચે 69 રનની ભાગીદારી થઈ હતી. બંને ખેલાડીઓએ હારના માર્જિનને ઘટાડવાનો પૂરો પ્રયાસ કર્યો હતો, પરંતુ મિચેલ સ્ટાર્ક 51 બોલમાં 27 રન બનાવીને આઉટ થયો હતો. આ પછી માર્નસ લાબુશેન પણ કેશવ મહારાજના બોલ પર આઉટ થયો હતો. આવી રહીકાંગારૂ બેટ્સમેનની હાલત... મિશેલ માર્શને માર્કો યોન્સેને આઉટ કર્યો હતો. તો બીજી તરફ, ડેવિડ વોર્નર લુંગી એનગિડીના બોલ પર આઉટ થયો હચો. કાગિસો રબાડાના બોલ પર સ્ટીવ સ્મિથ પેવેલિયન પરત ફર્યો હતો. જોશ ઈંગ્લિશને કાગીસો રબાડાએ બોલ્ડ આઉટ કર્યો હતો. કેશવ મહારાજના બોલ પર ઓસ્ટ્રેલિયાનો ઓલરાઉન્ડર ગ્લેન મેક્સવેલ પણ આસાન કેચ આપી બેઠો હતો. જો કે ઓસ્ટ્રેલિયન ટીમને માર્કસ સ્ટોઈનિસને જે રીતે આઉટ આપવામાં આવ્યો તે પસંદ ન આવ્યું. માર્કસ સ્ટોઇનિસને આઉટ આપ્યા બાદ થયો વિવાદ વાસ્તવમાં, કાગિસો રબાડાના બોલ પર આઉટ થયા બાદ માર્કસ સ્ટોઇનિસ ખૂબ જ નાખુશ દેખાતો હતો. માર્કસ સ્ટોઇનિસ અમ્પાયર સાથે વાત કરતો રહ્યો, પરંતુ થર્ડ અમ્પાયરે માન્યું કે બોલ ઓસ્ટ્રેલિયન ઓલરાઉન્ડરના ગ્લોવ્ઝમાં વાગીને ગયો હતો. આ રીતે માર્કસ સ્ટોઈનિસને પેવેલિયન પરત ફરવું પડ્યું હતું. દક્ષિણ આફ્રિકા માટે કાગિસો રબાડા સૌથી સફળ બોલર રહ્યો હતો. કાગિસો રબાડાએ 10 ઓવરમાં 23 રન આપીને 3 વિકેટ લીધી હતી. માર્કો યોન્સેન, કેશવ મહારાજ અને તબરેઝ શમ્સીને 1-1 સફળતા મળી. લુંગી એનગિડીએ ડેવિડ વોર્નરને આઉટ કર્યો હતો. ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીત્યો હતો આ પહેલા ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીતીને બોલિંગ કરવાનો નિર્ણય લીધો હતો. દક્ષિણ આફ્રિકાએ 50 ઓવરમાં 7 વિકેટે 311 રન બનાવ્યા હતા. દક્ષિણ આફ્રિકા તરફથી ક્વિન્ટન ડી કોકે 106 બોલમાં 109 રન બનાવ્યા હતા. એડન માર્કરમે 44 બોલમાં 56 રન બનાવ્યા હતા. ઓસ્ટ્રેલિયા તરફથી મિચેલ સ્ટાર્ક અને ગ્લેન મેક્સવેલે 2-2 વિકેટ ઝડપી હતી. આ સિવાય જોશ હેઝલવુડ, પેટ કમિન્સ અને એડમ ઝમ્પાને 1-1 સફળતા મળી હતી.","content":"AUS vs SA Match Report: ભારત બાદ ઓસ્ટ્રેલિયાની દક્ષિણ આફ્રિકા સામે પણ હાર થઈ છે. પેટ કમિન્સની ટીમને 134 રનના વિશાળ અંતરથી હારનો સામનો કરવો પડ્યો છે. ઓસ્ટ્રેલિયાને જીતવા માટે 312 રનનો ટાર્ગેટ હતો. પરંતુ કાંગારૂ ટીમ 40.5 ઓવરમાં 177 રન પર જ સિમિત રહી હતી. આ રીતે ટેમ્બા બાવુમાની ટીમને મોટી જીત મળી છે. A second successive #CWC23 ton helps Quinton de Kock win the @aramco #POTM ⚡ #AUSvSA pic.twitter.com/eK1iogZQ6n — ICC (@ICC) October 12, 2023 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); સાઉથ આફ્રિકાના બોલરો સામે ઓસ્ટ્રેલિયાનો ટોપ ઓર્ડર ધરાશાયી દક્ષિણ આફ્રિકાના 311 રનના જવાબમાં કાંગારૂ ટીમની શરૂઆત ખૂબ જ ખરાબ રહી હતી. ઓસ્ટ્રેલિયાનો ઓપનર મિચેલ માર્શ 7 રન બનાવીને આઉટ થયો હતો. આ પછી ડેવિડ વોર્નર 27 બોલમાં 13 રન બનાવીને પેવેલિયન ગયો હતો. આ સિલસિલો અહીં અટક્યો ન હતો… આ પછી જોશ ઇંગ્લિશ, ગ્લેન મેક્સવેલ અને માર્કસ સ્ટોઇનિસ પણ સસ્તામાં આઉટ થયા હતા. ઓસ્ટ્રેલિયાના 5 બેટ્સમેન 65 રન બનાવીને પેવેલિયન પરત ફર્યા હતા. આ ટીમને 70 રનના સ્કોર પર છઠ્ઠો ઝટકો લાગ્યો હતો. જો કે માર્નસ લાબુશેન અને મિશેલ સ્ટાર્ક વચ્ચે 69 રનની ભાગીદારી થઈ હતી. બંને ખેલાડીઓએ હારના માર્જિનને ઘટાડવાનો પૂરો પ્રયાસ કર્યો હતો, પરંતુ મિચેલ સ્ટાર્ક 51 બોલમાં 27 રન બનાવીને આઉટ થયો હતો. આ પછી માર્નસ લાબુશેન પણ કેશવ મહારાજના બોલ પર આઉટ થયો હતો. આવી રહીકાંગારૂ બેટ્સમેનની હાલત... મિશેલ માર્શને માર્કો યોન્સેને આઉટ કર્યો હતો. તો બીજી તરફ, ડેવિડ વોર્નર લુંગી એનગિડીના બોલ પર આઉટ થયો હચો. કાગિસો રબાડાના બોલ પર સ્ટીવ સ્મિથ પેવેલિયન પરત ફર્યો હતો. જોશ ઈંગ્લિશને કાગીસો રબાડાએ બોલ્ડ આઉટ કર્યો હતો. કેશવ મહારાજના બોલ પર ઓસ્ટ્રેલિયાનો ઓલરાઉન્ડર ગ્લેન મેક્સવેલ પણ આસાન કેચ આપી બેઠો હતો. જો કે ઓસ્ટ્રેલિયન ટીમને માર્કસ સ્ટોઈનિસને જે રીતે આઉટ આપવામાં આવ્યો તે પસંદ ન આવ્યું. માર્કસ સ્ટોઇનિસને આઉટ આપ્યા બાદ થયો વિવાદ વાસ્તવમાં, કાગિસો રબાડાના બોલ પર આઉટ થયા બાદ માર્કસ સ્ટોઇનિસ ખૂબ જ નાખુશ દેખાતો હતો. માર્કસ સ્ટોઇનિસ અમ્પાયર સાથે વાત કરતો રહ્યો, પરંતુ થર્ડ અમ્પાયરે માન્યું કે બોલ ઓસ્ટ્રેલિયન ઓલરાઉન્ડરના ગ્લોવ્ઝમાં વાગીને ગયો હતો. આ રીતે માર્કસ સ્ટોઈનિસને પેવેલિયન પરત ફરવું પડ્યું હતું. દક્ષિણ આફ્રિકા માટે કાગિસો રબાડા સૌથી સફળ બોલર રહ્યો હતો. કાગિસો રબાડાએ 10 ઓવરમાં 23 રન આપીને 3 વિકેટ લીધી હતી. માર્કો યોન્સેન, કેશવ મહારાજ અને તબરેઝ શમ્સીને 1-1 સફળતા મળી. લુંગી એનગિડીએ ડેવિડ વોર્નરને આઉટ કર્યો હતો. ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીત્યો હતો આ પહેલા ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીતીને બોલિંગ કરવાનો નિર્ણય લીધો હતો. દક્ષિણ આફ્રિકાએ 50 ઓવરમાં 7 વિકેટે 311 રન બનાવ્યા હતા. દક્ષિણ આફ્રિકા તરફથી ક્વિન્ટન ડી કોકે 106 બોલમાં 109 રન બનાવ્યા હતા. એડન માર્કરમે 44 બોલમાં 56 રન બનાવ્યા હતા. ઓસ્ટ્રેલિયા તરફથી મિચેલ સ્ટાર્ક અને ગ્લેન મેક્સવેલે 2-2 વિકેટ ઝડપી હતી. આ સિવાય જોશ હેઝલવુડ, પેટ કમિન્સ અને એડમ ઝમ્પાને 1-1 સફળતા મળી હતી.","pubDate":"2023-10-12 17:19:25","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/12/a8ebbe41880ae2533dd804ad9e9b9fe91697130575427397_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"e425c615fd776415ec9db21cf3e67b83","title":"Kal Ka Match Kaun Jeeta: कल का मैच कौन जीता- ऑस्ट्रेलिया vs दक्षिण अफ्रीका","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kaun-jeeta-australia-vs-south-africa-world-cup-2023-832841.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kaun Jeeta: कल का मैच ऑस्ट्रेलिया और दक्षिण अफ्रीका के बीच खेला गया। ऑस्ट्रेलिया की टीम को दक्षिण अफ्रीका के सामने हार का सामना करना पड़ा।","content":"कल का मैच दक्षिण अफ्रीका और ऑस्ट्रेलिया के बीच खेला गया था। लखनऊ में खेले गए इस मुकाबले में दक्षिण अफ्रीका पूरी तरह से हावी रही। पहले बैटिंग करते हुए दक्षिण अफ्रीका ने 7 विकेट पर 311 रनों का स्कोर खड़ा किया। जवाब में खेलते हुए ऑस्ट्रेलियाई टीम 177 रन बनाकर आउट हो गई। दक्षिण अफ्रीका के लिए धाकड़ फॉर्म में चल रहे ओपनर बल्लेबाज क्विंटन डी कॉक ने एक बार फिर से धमाका कर दिया। डी कॉक के बल्ले से शतकीय पारी देखने को मिली। वह 106 रन बनाकर आउट हो गए। उनके अलावा एडेन मार्करम के बल्ले भी अर्धशतक देखने को मिला। दक्षिण अफ़्रीकी टीम का स्कोर एक समय 350 से ऊपर जाने वाला था लेकिन ऑस्ट्रेलियाई गेंदबाजों ने वापसी कर ली। ऑस्ट्रेलिया के लिए सबसे ज्यादा विकेट लेने वाले गेंदबाज मिचेल स्टार्क और ग्लेन मैक्सवेल थे। दोनों के खाते में 2-2 विकेट आए। जवाबी पारी में खेलते हुए ऑस्ट्रेलियाई टीम ने एक के बाद एक विकेट गंवाए। दक्षिण अफ़्रीकी गेंदबाजों ने कंगारुओं को संभलने का मौका ही नहीं दिया। सबसे ज्यादा रन बनाने वाले बल्लेबाज मार्नस लाबुशेन थे। उनके बल्ले से 46 रनों की पारी देखने को मिली। ऑस्ट्रेलियाई टीम 177 रन बनाकर आउट हो गई। रबाडा ने घातक गेंदबाजी का प्रदर्शन करते हुए 3 विकेट अपने नाम किये। उनके अलावा केशव महाराज और मार्को यानसेन को 2-2 विकेट मिले उनके अलावा तबरेज शम्सी के खाते में भी कुल 2 विकेट आए। ऑस्ट्रेलिया की टीम को लगातार इस वर्ल्ड कप में दूसरी बार हार का सामना करना पड़ा है। क्विंटन डी कॉक (विकेटकीपर), टेम्बा बावुमा (कप्तान), रासी वान डेर डुसेन, एडेन मार्कराम, हेनरिक क्लासेन, डेविड मिलर, मार्को जानसन, केशव महाराज, लुंगी एनगिडी, कैगिसो रबाडा, तबरेज़ शम्सी। डेविड वार्नर, मिशेल मार्श, स्टीवन स्मिथ, मार्नस लाबुशेन, जोश इंग्लिस (डब्ल्यू), ग्लेन मैक्सवेल, मार्कस स्टोइनिस, पैट कमिंस (सी), मिशेल स्टार्क, एडम ज़म्पा, जोश हेज़लवुड।","pubDate":"2023-10-12 17:11:33","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a7156056011dfea60fa3c3d1f38bfd02","title":"ज़िला स्तरीय क्रिकेट चयन प्रतियोगिता सम्पन्न","link":"https://avadhnama.com/district-level-cricket-selection-competition-concluded/","keywords":["Marquee","Sports","Uttar Pradesh","avadhnama","District level cricket selection competition concluded"],"creator":["Farheen Rizvi"],"video_url":null,"description":"अवधनामा संवाददाता इटावा। जिला स्तरीय क्रिकेट चयन प्रतियोगिता अंडर 14 वर्ष का उद्घाटन डॉ.अजंट सिंह यादव अध्यक्ष इटावा अर्बन कोओपरेटिव बैंक के मुख्य आतिथ्य में महात्मा ज्योतिबा फुले स्पोर्ट स्टेडियम में संपन्न हुआ।विशिष्ट अतिथि डॉ मुकेश यादव,परमजीत सिंह जिला क्रीड़ा अधिकारी इटावा,राजेंद्र प्रसाद अध्यक्ष प्रधानाचार्य परिषद,महामंत्री, संजय शर्मा प्रधानाचार्यगण गुफरान अहमद,जगदीश सिंह,बृजेश कुमार ,डॉक्टर शिव […] The post ज़िला स्तरीय क्रिकेट चयन प्रतियोगिता सम्पन्न appeared first on Avadhnama.","content":"जिला स्तरीय क्रिकेट चयन प्रतियोगिता अंडर 14 वर्ष का उद्घाटन डॉ.अजंट सिंह यादव अध्यक्ष इटावा अर्बन कोओपरेटिव बैंक के मुख्य आतिथ्य में महात्मा ज्योतिबा फुले स्पोर्ट स्टेडियम में संपन्न हुआ।विशिष्ट अतिथि डॉ मुकेश यादव,परमजीत सिंह जिला क्रीड़ा अधिकारी इटावा,राजेंद्र प्रसाद अध्यक्ष प्रधानाचार्य परिषद,महामंत्री, संजय शर्मा प्रधानाचार्यगण गुफरान अहमद,जगदीश सिंह,बृजेश कुमार ,डॉक्टर शिव कुमार,पवन यादव आदि उपस्थित रहे।संयोजक डॉ.उमेश यादव ने मुख्य अतिथि,विशिष्ट अतिथि को शाल भेंट कर एवं सभी प्रधानाचार्ययों को प्रतीक चिन्ह देकर स्वागत किया।मुख्य अतिथि ने अपने संबोधन में कहा कि खिलाड़ियों को अभ्यास निरंतर करते रहना चाहिए और प्रतियोगिताओं में प्रतिभा करना चाहिए,साथ ही सभी खिलाड़ियों को आशीर्वाद प्रदान कर परिचय प्राप्त किया और मंडलीय प्रतिस्पर्धा के लिए सुभाशीश दिया।चयन समिति में जनपद के व्यायाम शिक्षक आशुतोष वर्मा आशा वशिष्ठ नाजिश शाहिद रमेश कुमार हिमांशु आदि की महत्वपूर्ण भूमिका रही।चयन प्रतियोगिता में जनपद के तीन दर्जन खिलाड़ी प्रतियोगिता में आये।चयनित प्रतिभागी मंडलीय क्रीडा प्रतियोगिता में प्रतिभाग करेंगे प्रतियोगिता में श्री चित्रगुप्त इंटर कॉलेज के शिक्षक राकेश डॉ विपिन कुमार संतोष कुमार सिंह रमेश चौधरी चेतन जैन आदि का सहयोग रहा।अंत में संयोजक ने सभी अतिथियों का आभार व्यक्त किया।","pubDate":"2023-10-12 17:00:43","image_url":null,"source_id":"avadhnama","source_priority":20736955,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"42eed33784d2e972df625e5b9b62563d","title":"Premier League icon mocked Gareth Southgate after Australia beat England","link":"https://www.dailystar.co.uk/sport/football/mark-schwarzer-gareth-southgate-england-31176991","keywords":["Sport"],"creator":null,"video_url":null,"description":"England boss Gareth Southgate has warned his players they risk handing Australia bragging rights if they slip up in their friendly at Wembley on Wednesday night","content":"has warned his stars to be aware of the Aussie boasting if they slip up at Wembley. The Three Lions boss has bad memories of team-mate Mark Schwarzer turning up with an inflatable kangaroo after the Socceroos beat England when they last met in 2003 at Upton Park. Southgate’s side are set to lock horns with the Aussies tonight as he implored fringe players to be given an opportunity to take their chance. Despite rivalries between the nations being bigger in cricket and rugby, his other concern is avoiding a repeat of 2003 when Schwarzer rubbed the 3-1 win in on his return to the North East. The England boss said: “We’ve talked to the players about the England-Australia sporting rivalry and we know what that means. \"I played with a lot of Aussies and when they beat us at Upton Park they were pretty quick to come back to Middlesbrough. Schwarzer had a blow up kangaroo under his arm and he was making hay with it all. “There’s plenty of rivalry going on. \"I think it is generally a sporting rivalry. I suppose I keep having to say to our players before these games ‘Look lads, this another country that doesn’t particularly like us, so get prepared for that, they want to make hay and beat us’. They’ll be highly motivated.\" Southgate may give some players a chance tonight that may not feature in Tuesday’s Euro 2024 qualifier with Italy to show they’re worth a spot in his squad for next summer. He said: \"We have six matches before we name a squad in all likelihood for a European Championship. And so if people are going to have the chance to force their way into that squad, or that team, we need to play them. Prime Video is available as part of the Amazon Prime membership, which costs £8.99 per month or £95 annually for an individual. Prime Student You can also sign-up for Prime Video on its own for £5.99 per month, however, you won’t get the other benefits that come with Prime — like free One-Day Delivery and Same-Day Delivery on eligible orders and fast grocery delivery and pickup. £5.99 per month for Prime Video only, or £8.99 per month for Amazon Prime membership \"And also when you are keeping a squad and a spirit of a squad together people need the chance to play to really feel part of that. It is an important night for a lot of players, they will recognise that.\"","pubDate":"2023-10-12 22:06:55","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31176963.ece/ALTERNATES/s98/0_Goalkeeper-Mark-Schwarzer-of-Australia-attempts-to-tackle-Michael-Owen-of-England.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"182fcdff42897e2faa7c8e8dc2aa7b95","title":"Joyriders wreck cricket pitch again","link":"https://times-age.co.nz/sports/joyriders-wreck-cricket-pitch-again/","keywords":["Cricket","Sport"],"creator":["Chris Cogdale"],"video_url":null,"description":"Vandalism at Masterton’s Queen Elizabeth Park Oval has forced the moving of tomorrow’s inaugural North vs South match to the Hadlow artificial pitch. The game for the ‘Seth Rance Bat’ was to be the first on grass this season and was being used by new Post Office Hotel Wairarapa coach Mark Childs as an important […]","content":"Vandalism at Masterton’s Queen Elizabeth Park Oval has forced the moving of tomorrow’s inaugural North vs South match to the Hadlow artificial pitch. The game for the ‘Seth Rance Bat’ was to be the first on grass this season and was being used by new Post Office Hotel Wairarapa coach Mark Childs as an important buildup for the first Furlong Cup match in a fortnight against Taranaki. However, damage caused by a car to the outfield and across the northern end of the pitch block left Wairarapa Cricket with no option but to move the game from their traditional home, much to the frustration of general manager Simon Roseingrave. “It’s disappointing because we’ve probably had the best spring for a few years; the season has felt the best planned it has been for a few years; everybody was ready to go, and the North-South fixture, which was the inaugural game and an exciting way to start the season and we don’t have the use of our main facility,” Roseingrave said. “It makes us nervous in terms of when the season can get on the block. We’re still hopeful for the Bidwill Cup on the 21st, but it all depends on what Rec Services can do to fix it with a bit of rolling and cutting and see what it looks like.” Roseingrave reckoned that it’s probably the fourth or fifth time in his 10 years in the role that such vandalism has occurred, and he intends to talk with Masterton District Council to see what security improvements can be made. “There’s no way we want to block off the park because it’s such a fantastic asset to the whole community, but we just need some community understanding about how it impacts an organisation like us.” The Masterton District Council has asked police to review CCTV footage from the area to identify the culprits. The council’s manager of community facilities and activities, Corin Haines, confirmed the park was unsafe to play on and would be closed to cricket this weekend. “A huge amount of work has been done to prepare the pitch for the cricket season after a very wet winter,” Haines said. “To see carefully prepared turf ripped up by this act of idiocy is heartbreaking, even for people not involved in cricket.” Haines said any information on who is responsible should be passed to police. It is thought the vehicle accessed the park via the green space opposite the Trust House Recreation Centre at about 3.45 a.m. yesterday. Despite Mark Childs’ disappointment that the players won’t get their first chance to play on grass, he is keen to see a step up from their first outing last Saturday. That one-day game resulted in a loss to Petone-Riverside, who scored 278 after being 160–6. Wairarapa fell about 40 runs short, with Robbie Anderson [40] and Ethan Childs [35] impressing in an opening stand of 75 before the latter was forced to retire after putting out his shoulder when playing a drive over cover. The injury could also have ramifications for the bowling depth for the start of the rep season, with the allrounder a spearhead in the medium-pace attack. Jack Wakeling also stood out with a half-century. Mark Childs said tomorrow’s game will be played under Furlong Cup conditions, with 112 overs for the day, and the team batting first limited to 60 overs. The teams will play for the ‘Seth Rance Bat’ to add a bit of spice to the contest. The South side has been boosted with some players from North clubs so they can field a competitive team. Play will get underway at 10.30 am. North – Robbie Anderson [c], George Deans, Jeremy Anderson, Mark Steventon, Jaco Vorster, Jack Wakeling, Nathan Elliott, Samuel Payne, Shamal Perera, Hugo Wakeling, Patrick Wootton, Trey Bidois South – Quinn Childs [c], Hayden Ray, Caleb Burling, Robbie Speers, Rudo Erasmus, Seth Rance, Ed Lord, Cuong “Chopper” Troung, James Church, Angus Jaspers, Guyan Dissanayake, Alex Mason","pubDate":"2023-10-12 21:00:00","image_url":"https://dw35i5ezvh1dd.cloudfront.net/wp-content/uploads/2023/10/RS507423_20231012_091801-scaled-e1697091093597-1024x942.jpg","source_id":"times_age","source_priority":2219296,"country":["new zealand"],"category":["sports"],"language":"english"},{"article_id":"db2c3fc5c1824072110ddd22754f7aa1","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.southwalesguardian.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.southwalesguardian.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0cf9764000211fab3655117debaa4e5d","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.northwalespioneer.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.northwalespioneer.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0a5280c5fdfcc0dac0f5ac53458d3a4d","title":"FA would face criticism one way or another for conflict response – Southgate","link":"https://www.northwaleschronicle.co.uk/sport/national/23852546.fa-face-criticism-one-way-another-conflict-response---southgate/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Culture Secretary Lucy Frazer was “extremely disappointed” by the FA’s decision not to light up the Wembley arch in colours of the Israeli flag.","content":"England manager Gareth Southgate accepts the Football Association would have been “criticised in one way or another” for its response to the Israel and Palestine conflict. Following attacks by Hamas militants on the country’s territory last weekend, the FA had faced calls to illuminate the Wembley arch in the colours of the Israeli flag before Friday’s friendly between England and Australia. The Hamas attacks have led to the Israeli government responding with airstrikes on the Gaza Strip, with a ground invasion also reported to be a possibility. I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA. — Lucy Frazer (@lucyfrazermp) The British Government had written to UK sports bodies encouraging them to mark events in Israel appropriately. The FA, though, announced in a statement on Thursday that players would wear black armbands and that a period of silence would be observed instead to remember the victims of the conflict. Culture Secretary Lucy Frazer said she was left “extremely disappointed” by the decision not to light up Wembley. The Board of Deputies of British Jews also criticised the FA statement – pointing out that it made “no mention of the mass terrorist murders of hundreds of innocent Israelis last Saturday”. England manager Southgate was asked for his thoughts on the FA’s stance at Thursday’s pre-match press conference ahead of the Australia game, and accepted it was “one of the most complex situations in the world”. Southgate said: “Firstly (there have been) incredibly harrowing pictures. (Our) thoughts and feelings are to everybody who has suffered, who have lost relatives and friends in these attacks. It is incredibly disturbing to see. “On a broader scale, in my lifetime it is one of the most complex situations in the world and I think everybody is grappling with how best to deal with that. “I don’t know what it is like to walk in the shoes of people on either side of that conflict. What I do know is people at the FA will have consulted with everybody they possibly can and will have tried to make the best decision with good intentions. “Clearly whatever decision they came to would have been criticised in one way or another, so I also recognise how difficult it was for them. I wasn’t involved in those discussions, (but) they went on for a long time I know. “They (FA) have decided to take the stance they have and we will get on with that.” The FA said flags, replica kits and other representations of nationality beyond those related to England or Australia would not be allowed inside Wembley on Friday. The Culture Secretary also criticised the FA’s stance in a post on social media on Thursday evening. Wembley remembers the victims of the conflict in Israel and Palestine. — The FA (@FA) “I am extremely disappointed by the FA’s decision not to light up the Wembley Stadium arch following last weekend’s horrific terrorist attacks in Israel, and have made my views clear to the FA,” Frazer wrote on X, formerly known as Twitter. “It is especially disappointing in light of the FA’s bold stance on other terrorist attacks in the recent past. Words and actions matter. The Government is clear: we stand with Israel.” Teams in the EFL and Premier League will pay tribute to the victims of the conflict in their next rounds of matches. There will also be a period of silence ahead of kick-off at the weekend’s matches in the Women’s Super League, Women’s Championship and Women’s National League to “remember the innocent victims of the devastating events in Israel and Palestine.” ECB statement on recent events in Israel and Palestine. — England and Wales Cricket Board (@ECB_cricket) The England and Wales Cricket Board released a statement on Thursday which read: “We deplore the appalling loss of innocent life following recent events in Israel and Palestine. “Our thoughts and prayers are with the families and friends of all the innocent victims, and those who are still missing, as well as the communities who are affected. “While sport seems trivial compared to the harrowing scenes we have all watched, it is also an opportunity for people to come together and remind ourselves that there’s far more that brings us together, than divides us. We should now all unify in our hope for peace.” England cricketer Moeen Ali has deleted an Instagram post featuring the Palestinian flag and a quote from Malcolm X. Moeen then put up a new post, without the flag but containing the same Malcolm X quote: “If you’re not careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing.” The International Olympic Committee said its executive board members had “expressed their very strong feelings over these tragic events in the recent days” at the start of Thursday’s meeting in Mumbai and “express their deepest sympathy with the innocent victims of this terrible violence”.","pubDate":"2023-10-12 20:26:11","image_url":"https://www.northwaleschronicle.co.uk/resources/images/17327158/?type=app&htype=0","source_id":"northwaleschronicle","source_priority":2822327,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ed07a99a935dfc954013152e95973d6c","title":"F1 great Hakkinen to mentor Indian F2 driver Maini","link":"https://www.hindustantimes.com/sports/others/f1-great-hakkinen-to-mentor-indian-f2-driver-maini-101697133770097.html","keywords":null,"creator":null,"video_url":null,"description":"Maini is currently India’s best hope to enter F1 after Daruvala, will be switching to Formula E next year after signing a contract with Maserati last month","content":"Indian racing driver Kush Maini will be mentored by two-time Formula 1 world champion Mika Hakkinen to help the 23-year-old realise his dream of racing at the pinnacle of motorsport. Kush Maini is currently driving for Campos Racing. Maini is currently driving for Campos Racing in his rookie season in Formula 2 – the primary feeder series for F1 – and has bagged 60 points that includes a podium in Melbourne to be 11th in the championship, a spot better than compatriot Jehan Daruvala. We're now on WhatsApp. Click to join. Maini is currently India’s best hope to enter F1 after Daruvala, who after driving for four seasons in F2, will be switching to Formula E next year after signing a contract with Maserati last month. Hakkinen is throwing his weight behind the young prodigy, stating their target is very clear: “F1 is our objective.” The Finn’s track record in mentoring aspiring F1 drivers is well known, having played a significant role in the development of 10-time race winner and current Alfa Romeo Sauber driver Valtteri Bottas. Having an F1 champion in your corner means a young driver can focus on the essentials over a race weekend, learn how to win bragging rights within a team and optimise communications. It also provides powerful business leverage, connecting with sponsors. With Hakkinen applying his management techniques and processes, Maini believes that he can challenge at the front in 2024 F2. “From next year, my approach and that of my team is going to be a lot more structured thanks to Mika. Having a trainer who's looking after your nutrition at the track and a mind coach looking after anything you're going through on a race weekend will allow me to focus on driving. Basically, the way Mika works is you narrow down everything to the point where the driver just has one job,\" said Maini. Maini, who hails from Bengaluru, is the younger brother of Arjun Maini, who raced in F2 and was a development driver for Haas F1 team. He currently competes in sports car racing for Mercedes AMG in Europe. “I've watched Mika since I was very young. And I know everything he has achieved in this sport. So just for him to believe that I could reach Formula One shows that we've done something right in these last 15 years. It’s a massive weapon you have in your arsenal when you have Mika Hakkinen standing behind you,” said Maini. “Having Mika behind me, my whole team being created now and not having to stress about racing, it's a very exciting time for myself and I feel I haven't showed anywhere near what I am capable of in the car.\" Known as ‘The Flying Finn’, the 55-year-old Hakkinen won two F1 championships in 1998 and 1999 for McLaren and was the great Michael Schumacher’s primary adversary in those years. During his time in F1 that ranged from 1991 to 2001, Hakkinen notched 20 race wins, 51 podiums and 26 pole positions. \"I have a lot of experience from working with Valtteri Bottas seeing him developing and growing as a driver. More recently I’ve been following Kush, understanding his abilities, his talent for driving. It’s a very interesting journey together to develop, to be an even more of a professional racing driver. F1 is our objective, not forgetting the current situation (in F2),\" said Hakkinen. Hakkinen will not be a blow-by-blow driver coach, teaching Maini cornering techniques. “I don't think I have to put my nose into that,” added the Finn. Hakkinen defines his role as leveraging the tools of “communication and the network that I have. These assets are very powerful when looking after a young talented driver. I've been an ambassador and part of F1 since 1991. It's an asset and the power that I have to take this young driver into the right places at the right time.” “Of course, India is an enormous, powerful country. I’m part of bringing a young driver from India to Formula One, bringing these mega companies, learning to understand the opportunities that F1 can bring them. And vice versa, what F1 can experience and create with India. I can only see beautiful success stories,\" said Hakkinen. India hosted three Formula 1 races at the Buddh International Circuit (BIC) in Greater Noida from 2011 to 2013 before the Indian Grand Prix ran into tax, bureaucratic and financial hurdles. The country has also produced two F1 drivers; Narain Karthikeyan, who did two full seasons in 2005 and 2012 and half a season in 2011, and Karun Chandhok, who raced half a season in 2010 and one race in 2011 in F1. \"India is going to be very powerful and I want all Indians to know Kush Maini, I want everybody in India cheering him. I want them to feel that he's going to be a winner in F1. Of course, it requires very hard work and a lot of sacrifices. Because of my experience in this motor racing world, I do understand (the importance of) timing, being in the right team, having the right partners, working with the right people is crucial,” said Hakkinen. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics Formula One","pubDate":"2023-10-12 18:09:34","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/12/1600x900/157b47fc-b481-dfd0-b8f9-c1185d96b3bf_1669136771097_1697133906975.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"df276849ed4ce25c5047fef84ae95ccf","title":"Neeraj has potential to become a star as big as Bolt: Eaton","link":"https://www.hindustantimes.com/cricket/neeraj-has-potential-to-become-a-star-as-big-as-bolt-eaton-101697133442096.html","keywords":null,"creator":null,"video_url":null,"description":"Two-time Olympic champion in the decathlon, Ashton Eaton, feels that the Indian, and not Lyles, could be the man to match the Jamaican in the popularity stakes","content":"It has been six years since Usain Bolt hung up his golden shoes, but the world of athletics is still searching for the next mega star who can take the sport to newer heights like the eight-time Olympic champion did. India's Neeraj Chopra in action.(PTI) Many have suggested that six-time world champion Noah Lyles could be the star track and field is searching for — he runs the same events as Bolt, has a magnetic personality and the closest anyone has come to matching the Jamaican’s world records. But two-time Olympic champion in decathlon Ashton Eaton feels that India’s Neeraj Chopra and not Lyles could be that celebrity. We're now on WhatsApp. Click to join. \"Neeraj is great. Bolt was the right archetype... 100m, 200m are popular events, his name is Bolt, he is flashy which captured the attention of the track and field audience in the world but maybe somebody like Neeraj can surpass him because he has got the support of one of the most populous places in the world,\" said Eaton, who landed here on Thursday as the international event ambassador for the Vedanta Delhi Half Marathon on Sunday. “Maybe there’s a way that India pushes him to that level or even beyond. Neeraj is right now more popular on social media than all the top competing track athletes on all their platforms combined. He has 7.2 million followers on Instagram. Lyles has (slightly more than) half a million. But then we look at Bolt and he has 13.5 million and he's not even competing anymore. So, Neeraj has the potential because of the population here. Plus, he is in advertisements everywhere. He is a very busy guy.” Eaton knows a thing or two about defending an Olympic crown. He is one of those rare athletes who won successive Olympic gold medals at London 2012 and Rio 2016. Next year, Chopra will be in the same spot as he will be defending his javelin gold in Paris. The javelin superstar last week won the Asian Games gold in Hangzhou which was the first time the reigning world champion defended a major title. But it wasn’t before compatriot Kishore Jena pushed Chopra to throw his season’s best throw of 88.88m to win the competition. Though Chopra has been in sizzling form this year, but in Paris 2024 he will be the target with all others aiming to snatch the crown off his head. “I think he is going to have a lot more pressure. When you’re young, nobody expects you to win. If you don’t win then they’re like ‘it’s alright, you tried’. If you win, it’s like wow. Next time when you don’t win there will be questions like ‘What’s your problem? What happened? If you do win, you were supposed to. So, it’s a different kind of an approach. Every single person he talks to will be like: can you do the double? In case he doesn’t, you'll be like Neeraj what happened? You were supposed to win,\" said Eaton, who is the only man to have crossed the 9,000-point barrier twice in decathlon. Chopra himself admitted that defending the title in Paris will be a huge challenge since maintaining top form consistently isn’t easy. \"Defending my Olympic gold could be tough because there is pressure and expectations from the people. Maintaining top form for many years is challenging but my endeavour will be to prepare in the best possible way and give my best in Paris,\" Chopra, who on Thursday was nominated along with 10 others for the Men’s World Athlete of the Year, told PTI. \"Exciting news! Hindustan Times is now on WhatsApp Channels Subscribe today by clicking the link and stay updated with the latest news!\" Click here! Catch all the Latest World Cup news and Live score along with India vs Australia Live Score and World Cup Schedule related updates on Hindustan Times Website and APPs SHARE THIS ARTICLE ON ABOUT THE AUTHOR Sandip Sikdar From badminton to cricket, Sandip Sikdar writes on many sporting disciplines. He has the experience of working in digital, news agency as well as print organisations. Motorsport remains his first love. ...view detail Topics Neeraj Chopra Usain Bolt","pubDate":"2023-10-12 18:07:18","image_url":"https://www.hindustantimes.com/ht-img/img/2023/10/12/1600x900/PTI10-04-2023-000598A-0_1697133500967_1697133605615.jpg","source_id":"hindustantimes","source_priority":933,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"597a9ed5167757c286c9f1102c7bbac9","title":"AUS vs SA: સાઉથ આફ્રિકાએ 5 વખતના વિશ્વ ચેમ્પિયન ઓસ્ટ્રેલીયાને 134 રને હરાવ્યું","link":"https://gujarati.abplive.com/sports/cricket/world-cup-2023-south-africa-beat-australia-by-134-runs-861280","keywords":["ક્રિકેટ"],"creator":["gujarati.abplive.com"],"video_url":null,"description":"AUS vs SA Match Report:  ભારત બાદ ઓસ્ટ્રેલિયાની દક્ષિણ આફ્રિકા સામે પણ હાર થઈ છે. પેટ કમિન્સની ટીમને 134 રનના વિશાળ અંતરથી હારનો સામનો કરવો પડ્યો છે. ઓસ્ટ્રેલિયાને જીતવા માટે 312 રનનો ટાર્ગેટ હતો. પરંતુ કાંગારૂ ટીમ 40.5 ઓવરમાં 177 રન પર જ સિમિત રહી હતી. આ રીતે ટેમ્બા બાવુમાની ટીમને મોટી જીત મળી છે.   A second successive #CWC23 ton helps Quinton de Kock win the @aramco #POTM ⚡#AUSvSA pic.twitter.com/eK1iogZQ6n — ICC (@ICC) October 12, 2023 સાઉથ આફ્રિકાના બોલરો સામે ઓસ્ટ્રેલિયાનો ટોપ ઓર્ડર ધરાશાયી  દક્ષિણ આફ્રિકાના 311 રનના જવાબમાં કાંગારૂ ટીમની શરૂઆત ખૂબ જ ખરાબ રહી હતી. ઓસ્ટ્રેલિયાનો ઓપનર મિચેલ માર્શ 7 રન બનાવીને આઉટ થયો હતો. આ પછી ડેવિડ વોર્નર 27 બોલમાં 13 રન બનાવીને પેવેલિયન ગયો હતો. આ સિલસિલો અહીં અટક્યો ન હતો… આ પછી જોશ ઇંગ્લિશ, ગ્લેન મેક્સવેલ અને માર્કસ સ્ટોઇનિસ પણ સસ્તામાં આઉટ થયા હતા. ઓસ્ટ્રેલિયાના 5 બેટ્સમેન 65 રન બનાવીને પેવેલિયન પરત ફર્યા હતા. આ ટીમને 70 રનના સ્કોર પર છઠ્ઠો ઝટકો લાગ્યો હતો. જો કે માર્નસ લાબુશેન અને મિશેલ સ્ટાર્ક વચ્ચે 69 રનની ભાગીદારી થઈ હતી. બંને ખેલાડીઓએ હારના માર્જિનને ઘટાડવાનો પૂરો પ્રયાસ કર્યો હતો, પરંતુ મિચેલ સ્ટાર્ક 51 બોલમાં 27 રન બનાવીને આઉટ થયો હતો. આ પછી માર્નસ લાબુશેન પણ કેશવ મહારાજના બોલ પર આઉટ થયો હતો. આવી રહીકાંગારૂ બેટ્સમેનની હાલત... મિશેલ માર્શને માર્કો યોન્સેને આઉટ કર્યો હતો. તો બીજી તરફ, ડેવિડ વોર્નર લુંગી એનગિડીના બોલ પર આઉટ થયો હચો. કાગિસો રબાડાના બોલ પર સ્ટીવ સ્મિથ પેવેલિયન પરત ફર્યો હતો. જોશ ઈંગ્લિશને કાગીસો રબાડાએ બોલ્ડ આઉટ કર્યો હતો. કેશવ મહારાજના બોલ પર ઓસ્ટ્રેલિયાનો ઓલરાઉન્ડર ગ્લેન મેક્સવેલ પણ આસાન કેચ આપી બેઠો હતો. જો કે ઓસ્ટ્રેલિયન ટીમને માર્કસ સ્ટોઈનિસને જે રીતે આઉટ આપવામાં આવ્યો તે પસંદ ન આવ્યું. માર્કસ સ્ટોઇનિસને આઉટ આપ્યા બાદ થયો વિવાદ વાસ્તવમાં, કાગિસો રબાડાના બોલ પર આઉટ થયા બાદ માર્કસ સ્ટોઇનિસ ખૂબ જ નાખુશ દેખાતો હતો. માર્કસ સ્ટોઇનિસ અમ્પાયર સાથે વાત કરતો રહ્યો, પરંતુ થર્ડ અમ્પાયરે માન્યું કે બોલ ઓસ્ટ્રેલિયન ઓલરાઉન્ડરના ગ્લોવ્ઝમાં વાગીને ગયો હતો. આ રીતે માર્કસ સ્ટોઈનિસને પેવેલિયન પરત ફરવું પડ્યું હતું. દક્ષિણ આફ્રિકા માટે કાગિસો રબાડા સૌથી સફળ બોલર રહ્યો હતો. કાગિસો રબાડાએ 10 ઓવરમાં 23 રન આપીને 3 વિકેટ લીધી હતી. માર્કો યોન્સેન, કેશવ મહારાજ અને તબરેઝ શમ્સીને 1-1 સફળતા મળી. લુંગી એનગિડીએ ડેવિડ વોર્નરને આઉટ કર્યો હતો. ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીત્યો હતો આ પહેલા ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીતીને બોલિંગ કરવાનો નિર્ણય લીધો હતો. દક્ષિણ આફ્રિકાએ 50 ઓવરમાં 7 વિકેટે 311 રન બનાવ્યા હતા. દક્ષિણ આફ્રિકા તરફથી ક્વિન્ટન ડી કોકે 106 બોલમાં 109 રન બનાવ્યા હતા. એડન માર્કરમે 44 બોલમાં 56 રન બનાવ્યા હતા. ઓસ્ટ્રેલિયા તરફથી મિચેલ સ્ટાર્ક અને ગ્લેન મેક્સવેલે 2-2 વિકેટ ઝડપી હતી. આ સિવાય જોશ હેઝલવુડ, પેટ કમિન્સ અને એડમ ઝમ્પાને 1-1 સફળતા મળી હતી.","content":"AUS vs SA Match Report: ભારત બાદ ઓસ્ટ્રેલિયાની દક્ષિણ આફ્રિકા સામે પણ હાર થઈ છે. પેટ કમિન્સની ટીમને 134 રનના વિશાળ અંતરથી હારનો સામનો કરવો પડ્યો છે. ઓસ્ટ્રેલિયાને જીતવા માટે 312 રનનો ટાર્ગેટ હતો. પરંતુ કાંગારૂ ટીમ 40.5 ઓવરમાં 177 રન પર જ સિમિત રહી હતી. આ રીતે ટેમ્બા બાવુમાની ટીમને મોટી જીત મળી છે. A second successive #CWC23 ton helps Quinton de Kock win the @aramco #POTM ⚡ #AUSvSA pic.twitter.com/eK1iogZQ6n — ICC (@ICC) October 12, 2023 googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); સાઉથ આફ્રિકાના બોલરો સામે ઓસ્ટ્રેલિયાનો ટોપ ઓર્ડર ધરાશાયી દક્ષિણ આફ્રિકાના 311 રનના જવાબમાં કાંગારૂ ટીમની શરૂઆત ખૂબ જ ખરાબ રહી હતી. ઓસ્ટ્રેલિયાનો ઓપનર મિચેલ માર્શ 7 રન બનાવીને આઉટ થયો હતો. આ પછી ડેવિડ વોર્નર 27 બોલમાં 13 રન બનાવીને પેવેલિયન ગયો હતો. આ સિલસિલો અહીં અટક્યો ન હતો… આ પછી જોશ ઇંગ્લિશ, ગ્લેન મેક્સવેલ અને માર્કસ સ્ટોઇનિસ પણ સસ્તામાં આઉટ થયા હતા. ઓસ્ટ્રેલિયાના 5 બેટ્સમેન 65 રન બનાવીને પેવેલિયન પરત ફર્યા હતા. આ ટીમને 70 રનના સ્કોર પર છઠ્ઠો ઝટકો લાગ્યો હતો. જો કે માર્નસ લાબુશેન અને મિશેલ સ્ટાર્ક વચ્ચે 69 રનની ભાગીદારી થઈ હતી. બંને ખેલાડીઓએ હારના માર્જિનને ઘટાડવાનો પૂરો પ્રયાસ કર્યો હતો, પરંતુ મિચેલ સ્ટાર્ક 51 બોલમાં 27 રન બનાવીને આઉટ થયો હતો. આ પછી માર્નસ લાબુશેન પણ કેશવ મહારાજના બોલ પર આઉટ થયો હતો. આવી રહીકાંગારૂ બેટ્સમેનની હાલત... મિશેલ માર્શને માર્કો યોન્સેને આઉટ કર્યો હતો. તો બીજી તરફ, ડેવિડ વોર્નર લુંગી એનગિડીના બોલ પર આઉટ થયો હચો. કાગિસો રબાડાના બોલ પર સ્ટીવ સ્મિથ પેવેલિયન પરત ફર્યો હતો. જોશ ઈંગ્લિશને કાગીસો રબાડાએ બોલ્ડ આઉટ કર્યો હતો. કેશવ મહારાજના બોલ પર ઓસ્ટ્રેલિયાનો ઓલરાઉન્ડર ગ્લેન મેક્સવેલ પણ આસાન કેચ આપી બેઠો હતો. જો કે ઓસ્ટ્રેલિયન ટીમને માર્કસ સ્ટોઈનિસને જે રીતે આઉટ આપવામાં આવ્યો તે પસંદ ન આવ્યું. માર્કસ સ્ટોઇનિસને આઉટ આપ્યા બાદ થયો વિવાદ વાસ્તવમાં, કાગિસો રબાડાના બોલ પર આઉટ થયા બાદ માર્કસ સ્ટોઇનિસ ખૂબ જ નાખુશ દેખાતો હતો. માર્કસ સ્ટોઇનિસ અમ્પાયર સાથે વાત કરતો રહ્યો, પરંતુ થર્ડ અમ્પાયરે માન્યું કે બોલ ઓસ્ટ્રેલિયન ઓલરાઉન્ડરના ગ્લોવ્ઝમાં વાગીને ગયો હતો. આ રીતે માર્કસ સ્ટોઈનિસને પેવેલિયન પરત ફરવું પડ્યું હતું. દક્ષિણ આફ્રિકા માટે કાગિસો રબાડા સૌથી સફળ બોલર રહ્યો હતો. કાગિસો રબાડાએ 10 ઓવરમાં 23 રન આપીને 3 વિકેટ લીધી હતી. માર્કો યોન્સેન, કેશવ મહારાજ અને તબરેઝ શમ્સીને 1-1 સફળતા મળી. લુંગી એનગિડીએ ડેવિડ વોર્નરને આઉટ કર્યો હતો. ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીત્યો હતો આ પહેલા ઓસ્ટ્રેલિયાના કેપ્ટન પેટ કમિન્સે ટોસ જીતીને બોલિંગ કરવાનો નિર્ણય લીધો હતો. દક્ષિણ આફ્રિકાએ 50 ઓવરમાં 7 વિકેટે 311 રન બનાવ્યા હતા. દક્ષિણ આફ્રિકા તરફથી ક્વિન્ટન ડી કોકે 106 બોલમાં 109 રન બનાવ્યા હતા. એડન માર્કરમે 44 બોલમાં 56 રન બનાવ્યા હતા. ઓસ્ટ્રેલિયા તરફથી મિચેલ સ્ટાર્ક અને ગ્લેન મેક્સવેલે 2-2 વિકેટ ઝડપી હતી. આ સિવાય જોશ હેઝલવુડ, પેટ કમિન્સ અને એડમ ઝમ્પાને 1-1 સફળતા મળી હતી.","pubDate":"2023-10-12 17:19:25","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/12/a8ebbe41880ae2533dd804ad9e9b9fe91697130575427397_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"gujarati"},{"article_id":"e425c615fd776415ec9db21cf3e67b83","title":"Kal Ka Match Kaun Jeeta: कल का मैच कौन जीता- ऑस्ट्रेलिया vs दक्षिण अफ्रीका","link":"https://hindi.oneindia.com/news/sports/cricket/kal-ka-match-kaun-jeeta-australia-vs-south-africa-world-cup-2023-832841.html","keywords":null,"creator":null,"video_url":null,"description":"Kal Ka Match Kaun Jeeta: कल का मैच ऑस्ट्रेलिया और दक्षिण अफ्रीका के बीच खेला गया। ऑस्ट्रेलिया की टीम को दक्षिण अफ्रीका के सामने हार का सामना करना पड़ा।","content":"कल का मैच दक्षिण अफ्रीका और ऑस्ट्रेलिया के बीच खेला गया था। लखनऊ में खेले गए इस मुकाबले में दक्षिण अफ्रीका पूरी तरह से हावी रही। पहले बैटिंग करते हुए दक्षिण अफ्रीका ने 7 विकेट पर 311 रनों का स्कोर खड़ा किया। जवाब में खेलते हुए ऑस्ट्रेलियाई टीम 177 रन बनाकर आउट हो गई। दक्षिण अफ्रीका के लिए धाकड़ फॉर्म में चल रहे ओपनर बल्लेबाज क्विंटन डी कॉक ने एक बार फिर से धमाका कर दिया। डी कॉक के बल्ले से शतकीय पारी देखने को मिली। वह 106 रन बनाकर आउट हो गए। उनके अलावा एडेन मार्करम के बल्ले भी अर्धशतक देखने को मिला। दक्षिण अफ़्रीकी टीम का स्कोर एक समय 350 से ऊपर जाने वाला था लेकिन ऑस्ट्रेलियाई गेंदबाजों ने वापसी कर ली। ऑस्ट्रेलिया के लिए सबसे ज्यादा विकेट लेने वाले गेंदबाज मिचेल स्टार्क और ग्लेन मैक्सवेल थे। दोनों के खाते में 2-2 विकेट आए। जवाबी पारी में खेलते हुए ऑस्ट्रेलियाई टीम ने एक के बाद एक विकेट गंवाए। दक्षिण अफ़्रीकी गेंदबाजों ने कंगारुओं को संभलने का मौका ही नहीं दिया। सबसे ज्यादा रन बनाने वाले बल्लेबाज मार्नस लाबुशेन थे। उनके बल्ले से 46 रनों की पारी देखने को मिली। ऑस्ट्रेलियाई टीम 177 रन बनाकर आउट हो गई। रबाडा ने घातक गेंदबाजी का प्रदर्शन करते हुए 3 विकेट अपने नाम किये। उनके अलावा केशव महाराज और मार्को यानसेन को 2-2 विकेट मिले उनके अलावा तबरेज शम्सी के खाते में भी कुल 2 विकेट आए। ऑस्ट्रेलिया की टीम को लगातार इस वर्ल्ड कप में दूसरी बार हार का सामना करना पड़ा है। क्विंटन डी कॉक (विकेटकीपर), टेम्बा बावुमा (कप्तान), रासी वान डेर डुसेन, एडेन मार्कराम, हेनरिक क्लासेन, डेविड मिलर, मार्को जानसन, केशव महाराज, लुंगी एनगिडी, कैगिसो रबाडा, तबरेज़ शम्सी। डेविड वार्नर, मिशेल मार्श, स्टीवन स्मिथ, मार्नस लाबुशेन, जोश इंग्लिस (डब्ल्यू), ग्लेन मैक्सवेल, मार्कस स्टोइनिस, पैट कमिंस (सी), मिशेल स्टार्क, एडम ज़म्पा, जोश हेज़लवुड।","pubDate":"2023-10-12 17:11:33","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"a7156056011dfea60fa3c3d1f38bfd02","title":"ज़िला स्तरीय क्रिकेट चयन प्रतियोगिता सम्पन्न","link":"https://avadhnama.com/district-level-cricket-selection-competition-concluded/","keywords":["Marquee","Sports","Uttar Pradesh","avadhnama","District level cricket selection competition concluded"],"creator":["Farheen Rizvi"],"video_url":null,"description":"अवधनामा संवाददाता इटावा। जिला स्तरीय क्रिकेट चयन प्रतियोगिता अंडर 14 वर्ष का उद्घाटन डॉ.अजंट सिंह यादव अध्यक्ष इटावा अर्बन कोओपरेटिव बैंक के मुख्य आतिथ्य में महात्मा ज्योतिबा फुले स्पोर्ट स्टेडियम में संपन्न हुआ।विशिष्ट अतिथि डॉ मुकेश यादव,परमजीत सिंह जिला क्रीड़ा अधिकारी इटावा,राजेंद्र प्रसाद अध्यक्ष प्रधानाचार्य परिषद,महामंत्री, संजय शर्मा प्रधानाचार्यगण गुफरान अहमद,जगदीश सिंह,बृजेश कुमार ,डॉक्टर शिव […] The post ज़िला स्तरीय क्रिकेट चयन प्रतियोगिता सम्पन्न appeared first on Avadhnama.","content":"जिला स्तरीय क्रिकेट चयन प्रतियोगिता अंडर 14 वर्ष का उद्घाटन डॉ.अजंट सिंह यादव अध्यक्ष इटावा अर्बन कोओपरेटिव बैंक के मुख्य आतिथ्य में महात्मा ज्योतिबा फुले स्पोर्ट स्टेडियम में संपन्न हुआ।विशिष्ट अतिथि डॉ मुकेश यादव,परमजीत सिंह जिला क्रीड़ा अधिकारी इटावा,राजेंद्र प्रसाद अध्यक्ष प्रधानाचार्य परिषद,महामंत्री, संजय शर्मा प्रधानाचार्यगण गुफरान अहमद,जगदीश सिंह,बृजेश कुमार ,डॉक्टर शिव कुमार,पवन यादव आदि उपस्थित रहे।संयोजक डॉ.उमेश यादव ने मुख्य अतिथि,विशिष्ट अतिथि को शाल भेंट कर एवं सभी प्रधानाचार्ययों को प्रतीक चिन्ह देकर स्वागत किया।मुख्य अतिथि ने अपने संबोधन में कहा कि खिलाड़ियों को अभ्यास निरंतर करते रहना चाहिए और प्रतियोगिताओं में प्रतिभा करना चाहिए,साथ ही सभी खिलाड़ियों को आशीर्वाद प्रदान कर परिचय प्राप्त किया और मंडलीय प्रतिस्पर्धा के लिए सुभाशीश दिया।चयन समिति में जनपद के व्यायाम शिक्षक आशुतोष वर्मा आशा वशिष्ठ नाजिश शाहिद रमेश कुमार हिमांशु आदि की महत्वपूर्ण भूमिका रही।चयन प्रतियोगिता में जनपद के तीन दर्जन खिलाड़ी प्रतियोगिता में आये।चयनित प्रतिभागी मंडलीय क्रीडा प्रतियोगिता में प्रतिभाग करेंगे प्रतियोगिता में श्री चित्रगुप्त इंटर कॉलेज के शिक्षक राकेश डॉ विपिन कुमार संतोष कुमार सिंह रमेश चौधरी चेतन जैन आदि का सहयोग रहा।अंत में संयोजक ने सभी अतिथियों का आभार व्यक्त किया।","pubDate":"2023-10-12 17:00:43","image_url":null,"source_id":"avadhnama","source_priority":20736955,"country":["india"],"category":["sports"],"language":"hindi"}]}