{"newsArray":[{"title":"DC vs PBKS Head to Head in IPL history: Delhi Capitals and Punjab Kings stats and records 2022 IPL","link":"https://thesportsrush.com/cricket-news-dc-vs-pbks-head-to-head-in-ipl-history-delhi-capitals-and-punjab-kings-stats-and-records-2022-ipl/","keywords":["Cricket","Delhi Capitals","IPL 2022","Punjab Kings","DC","Indian Premier League","PBKS"],"creator":["Dixit Bhargav"],"video_url":null,"description":"DC vs PBKS Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 31. The 32nd match of the ongoing 15th season of the Indian Premier League will be played between Delhi Capitals and Punjab Kings tonight. A change in venue from Pune to Mumbai… The post DC vs PBKS Head to Head in IPL history: Delhi Capitals and Punjab Kings stats and records 2022 IPL appeared first on The SportsRush.","content":"DC vs PBKS Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 31. The 32nd match of the ongoing 15th season of the Indian Premier League will be played between Delhi Capitals and Punjab Kings tonight. A change in venue from Pune to Mumbai due to a COVID-19 scare means that Maharashtra Cricket Association Stadium and Brabourne Stadium will be hosting 14 and 16 league matches this season respectively. In the five matches that Delhi have played this season, they have won two and lost three to be at the eighth position on the points table. Punjab, on the contrary, are at a position above on the back of winning and losing three matches each this season till now. Shahrukh c̶a̶n̶ hit ‘em all #PunjabKings #SaddaPunjab #IPL2022 #ਸਾਡਾਪੰਜਾਬ #DCvPBKS @shahrukh_35 pic.twitter.com/THzT5Dz3ih — Punjab Kings (@PunjabKingsIPL) April 19, 2022 It is worth a mention that Capitals have won and lost a couple of matches each across three seasons at the Cricket Club of India thus far. Meanwhile, Kings have won one and lost two out of their three outings at this venue across two seasons. DC vs PBKS Head to Head in IPL history Total number of matches played: 28 Matches won by DC: 13 Matches won by PBKS: 15 Matches played in April: 15 (DC 8, PBKS 7) Matches played in India: 24 (DC 11, PBKS 13) Matches played at Brabourne Stadium: 0 (DC 0, PBKS 0) DC average score against PBKS: 145 PBKS average score against DC: 145 Most runs for DC: 245 (David Warner) Most runs for PBKS: 298 (Mayank Agarwal) Most wickets for DC: 5 (Axar Patel) Most wickets for PBKS: 14 (Sandeep Sharma) Most catches for DC: 6 (Rishabh Pant) Most catches for PBKS: 4 (Mayank Agarwal) Although for different teams, current PBKS opening batters Mayank Agarwal and Shikhar Dhawan were the two top-scorers in the last DC vs PBKS contest held in Ahmedabad almost a year ago. While Delhi had won that match comfortably, Agarwal and Dhawan would be looking to improve Punjab’s recent record (four losses in last five matches) against Delhi. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post DC vs PBKS Head to Head in IPL history: Delhi Capitals and Punjab Kings stats and records 2022 IPL appeared first on The SportsRush.","pubDate":"2022-04-19 19:26:04","full_description":"DC vs PBKS Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 31. The 32nd match of the ongoing 15th season of the Indian Premier League will be played between Delhi Capitals and Punjab Kings tonight. A change in venue from Pune to Mumbai due to a COVID-19 scare means that Maharashtra Cricket Association Stadium and Brabourne Stadium will be hosting 14 and 16 league matches this season respectively. In the five matches that Delhi have played this season, they have won two and lost three to be at the eighth position on the points table. Punjab, on the contrary, are at a position above on the back of winning and losing three matches each this season till now. Shahrukh c̶a̶n̶ hit ‘em all #PunjabKings #SaddaPunjab #IPL2022 #ਸਾਡਾਪੰਜਾਬ #DCvPBKS @shahrukh_35 pic.twitter.com/THzT5Dz3ih — Punjab Kings (@PunjabKingsIPL) April 19, 2022 It is worth a mention that Capitals have won and lost a couple of matches each across three seasons at the Cricket Club of India thus far. Meanwhile, Kings have won one and lost two out of their three outings at this venue across two seasons. Total number of matches played: 28 Matches won by DC: 13 Matches won by PBKS: 15 Matches played in April: 15 (DC 8, PBKS 7) Matches played in India: 24 (DC 11, PBKS 13) Matches played at Brabourne Stadium: 0 (DC 0, PBKS 0) DC average score against PBKS: 145 PBKS average score against DC: 145 Most runs for DC: 245 (David Warner) Most runs for PBKS: 298 (Mayank Agarwal) Most wickets for DC: 5 (Axar Patel) Most wickets for PBKS: 14 (Sandeep Sharma) Most catches for DC: 6 (Rishabh Pant) Most catches for PBKS: 4 (Mayank Agarwal) Although for different teams, current PBKS opening batters Mayank Agarwal and Shikhar Dhawan were the two top-scorers in the last DC vs PBKS contest held in Ahmedabad almost a year ago. While Delhi had won that match comfortably, Agarwal and Dhawan would be looking to improve Punjab’s recent record (four losses in last five matches) against Delhi. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highlights, Tata IPL 2022 LSG vs RCB, Full cricket score: Hazlewood stars as Bangalore win by 18 runs - Firstpost","link":"https://news.google.com/__i/rss/rd/articles/CBMiowFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL2ZpcnN0Y3JpY2tldC9zcG9ydHMtbmV3cy9oaWdobGlnaHRzLXRhdGEtaXBsLTIwMjItbHNnLXZzLXJjYi1mdWxsLWNyaWNrZXQtc2NvcmUtaGF6bGV3b29kLXN0YXJzLWFzLWJhbmdhbG9yZS13aW4tYnktMTgtcnVucy0xMDU2OTMwMS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Highlights, Tata IPL 2022 LSG vs RCB, Full cricket score: Hazlewood stars as Bangalore win by 18 runs  FirstpostIPL 2022, LSG vs RCB Live Score Updates: Bangalore defeat Lucknow by 18 runs  The Indian ExpressLSG v RCB, Preview: Game Day | IPL 2022  Royal Challengers BangaloreLSG vs RCB Match Prediction- Who Will Win Today's IPL Match Between Lucknow Super Giants And Royal Challengers Bangalore, IPL 2022, Match 31  Cricket AddictorSlog-overs woes resurface at RCB | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-04-19 18:25:31","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-16-20-updates-2902199","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 17:34:03","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637860062346764041.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-11-15-updates-2902080","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 17:33:16","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637860061881820218.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-6-10-updates-2901960","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 17:01:54","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Lucknow Super Giants, chasing a target of 182, are 85/3. The live updates of Lucknow Super Giants vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Lucknow Super Giants vs Royal Challengers Bangalore, Lucknow Super Giants vs Royal Challengers Bangalore live score, Lucknow Super Giants vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (0 Run) Quicker one and on middle. Pandya keeps it out. 9.5 overs (6 Runs) SIX! Top shot! Tossed up, full and on off. Pandya goes inside-out over covers and clears the fielder in the deep with ease. A biggie. 9.4 overs (1 Run) Leg bye! Flatter and outside off. Hooda comes down the track and looks to work it away on the leg side but misses. An appeal for LBW but that was way outside off. 9.3 overs (0 Run) Full and outside off. Hooda looks to push to covers but mistimes it to mid-wicket where Virat Kohli makes a good stop. 9.2 overs (4 Runs) FOUR! Well played! Full and drifting down on the pads. Hooda gets low and paddles it through square leg for a boundary. 9.1 overs (0 Run) A googly, on middle. Hooda rocks back and pushes it to mid-wicket. Strategic break! KL Rahul was looking really solid at the crease but Bangalore got the better off him via a review which has put them right on top in this game. Lucknow though still have some batting left in their rank. They would hope the batters focus on building stands and taking it deep. An enticing phase awaits. Also, Wanindu Hasaranga comes into the attack now for Bangalore to work his magic in the middle overs. 8.6 overs (0 Run) Stump to stump, fuller and on middle. Pandya defends it out. 8.5 overs (0 Run) Short and on middle. Pandya tucks it to mid-wicket where the fielder collects on a bounce. 8.4 overs (0 Run) Quicker one, on off. Pushed back to the bowler. 8.3 overs (6 Runs) SIX! Tossed up, on off. Pandya skips down and tonks it over long on for a biggie. 8.2 overs (1 Run) Full and on off. Deepak Hooda pushes it to cover for one. 8.1 overs (1 Run) Floated and full, on leg. Krunal Pandya tries to sweep it away but misses. The ball rolls out of his pads. The batters cross for a leg bye. 7.6 overs (0 Run) OUT! CAUGHT BEHIND! A superb review from Bangalore and they have got the dangerous KL Rahul here. This is on a length and down the leg side. Rahul seems to miss his flick. An appeal for caught behind but nothing is given. Bangalore though are interested and challenge the decision. UltraEdge shows a spike as the ball passes the bat and KL Rahul will have to walk back. Actually, only Harshal Patel was putting up an appeal, even the keeper wasn't interested at all. Normally, you will see a keeper doing all the convincing part. Deepak Hooda is the new man in. Review! Bangalore take a review for caught behind. The UltraEdge shows there is a spike as the ball passes the blade. 7.6 overs (5 Runs) Five wides! Bonus runs! Bangs a short ball, on middle. Rahul leaves it alone. The keeper can't do much about it other than collect it from the fence. 7.5 overs (4 Runs) FOUR! A length ball, outside off. Rahul cuts it hard, past backward point for a boundary. 7.4 overs (0 Run) Short of a length, angling around middle. Rahul shuffles across and looks to pull but misses. The keeper collects and appeals but there was nothing on it. Bangalore are not interested to review it as well. 7.3 overs (1 Run) Length ball, outside off. Pandya knocks it to deep point and settles for a single. 7.2 overs (0 Run) Around off. Kept out. 7.1 overs (4 Runs) FOUR! Good shot! On a length, outside off. A back-foot punch from Pandya, through covers. The fielder in the deep gives a chase but the ball beats him and races away into the fence. Change. Harshal Patel comes into the attack now. 6.6 overs (1 Run) On middle, an easy single as this is tucked away to square leg. 50 up for Lucknow. 6.5 overs (2 Runs) Tossed up, on leg. Pandya sweeps it to deep square leg. The batters see a bit of fumble and take two runs. 6.4 overs (2 Runs) Darted on the pads, it is flicked behind square on the leg side for a couple. 6.3 overs (0 Run) Flatter and on middle. Pandya pushes it straight to mid-wicket. 6.2 overs (1 Run) Fuller again, Rahul drives it on the up and to sweeper cover for a single. 6.1 overs (0 Run) Full and angling on off, pushed back to the bowler. Change. Shahbaz Ahmed (1-0-7-0) comes back into the attack. 5.6 overs (4 Runs) FOUR! Yet again, superb timing! This is full and angling on off. Pandya drives it through covers for consecutive boundaries. 5.5 overs (4 Runs) FOUR! Straight as you like! Pandya has been timing well. On a length and on middle. Pandya punches it straight past the bowler and beats mid off for a boundary. 5.4 overs (0 Run) Fuller ball and on middle. Pandya drives it with good timing but straight to mid off. 5.3 overs (1 Run) Short ball, on off. Rahul rides it as he pulls it to deep square leg for a single. 5.2 overs (1 Run) Length ball, on off. Pandya punches it to mid off for a quick single. 5.1 overs (1 Run) Length and on off. Rahul drops it to covers for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637860043058773269.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Dinesh Karthik kids: Dinesh Karthik wife name nand family details","link":"https://thesportsrush.com/cricket-news-dinesh-karthik-kids-dinesh-karthik-wife-name-nand-family-details/","keywords":["Cricket","IPL 2022","dinesh karthik","DIpika Pallikal"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Dinesh Karthik kids: Dinesh Karthik has been in tremendous form for the Royal Challengers Bangalore in IPL 2022. Royal Challengers Bangalore have played some terrific cricket this season, and Dinesh Karthik has played an incredible part in it. Karthik single-handedly led Royal Challengers Bangalore’s run chase against Rajasthan Royals and Kolkata Knight Riders. Against Delhi… The post Dinesh Karthik kids: Dinesh Karthik wife name nand family details appeared first on The SportsRush.","content":"Dinesh Karthik kids: Dinesh Karthik has been in tremendous form for the Royal Challengers Bangalore in IPL 2022. Royal Challengers Bangalore have played some terrific cricket this season, and Dinesh Karthik has played an incredible part in it. Karthik single-handedly led Royal Challengers Bangalore’s run chase against Rajasthan Royals and Kolkata Knight Riders. Against Delhi Capitals as well, the RCB were struggling to post a respectable score, but Karthik again proved his masterclass. He smashed 28 runs in the Mustafizur Rahman’s over, and in the end, RCB won that game as well. In this season, Karthik has scored 210 runs at an average of 210.00, whereas his S/R has been 205.88. He has smashed 15 sixes so far in this season of the IPL. RCB bought Dinesh Karthik for an amount of INR 5.5 crores in the auction. KKR bought Karthik in IPL 2018 mega auction and made him the captain of the side. Dinesh Karthik kids Dinesh Karthik is married to Indian squash player Dipika Pallikal, and both of them got married in 2015. Dipika Pallikal has won Arjuna Award in 2012 and Padma Shri in 2014. Dipika is Karthik’s second wife. Dinesh Karthik and Dipika Pallikal were blessed with two twin baby boys in 2021, and they announced it on social media as well. Kabir Pallikal Karthik and Zian Pallikal Karthik are the name of two boys. “And just like that 3 became 5 Dipika and I have been blessed with two beautiful baby boys Kabir Pallikal Karthik Zian Pallikal Karthik and we could not be happier,” the couple wrote on Twitter. And just like that 3 became 5 Dipika and I have been blessed with two beautiful baby boys Kabir Pallikal Karthik Zian Pallikal Karthik and we could not be happier pic.twitter.com/Rc2XqHvPzU — DK (@DineshKarthik) October 28, 2021 Dinesh Karthik was born to Krishna Kumar (Father) & Padma Rani (Mother). He has a brother named Vinesh who is younger than him. He does not have any sisters.   The post Dinesh Karthik kids: Dinesh Karthik wife name nand family details appeared first on The SportsRush.","pubDate":"2022-04-19 16:51:47","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-1-5-updates-2901865","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 16:15:47","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Lucknow Super Giants, chasing a target of 182, are 34/2. The live updates of Lucknow Super Giants vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Lucknow Super Giants vs Royal Challengers Bangalore, Lucknow Super Giants vs Royal Challengers Bangalore live score, Lucknow Super Giants vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) OUT! CAUGHT! Josh Hazlewood picks up his second wicket in the second over. Bangalore right on top at the moment. 4.5 overs (0 Run) Back of a length, outside off. Manish Pandey stays back and guides it to the left of backward point. Wanindu Hasaranga there dives to that side and makes a sharp stop by one hand. 4.4 overs (1 Run) A length ball, around off. KL Rahul pushes it to backward point for a single. 4.3 overs (6 Runs) SIX! ALL THE WAY! Back of a length, on the bodyline. KL Rahul stays back and pulls it towards deep square leg. It directly lands on the advertising board on the ropes and its a maximum. 4.2 overs (1 Run) Short ball, outside off. Pandey works it down to third man for one. 4.1 overs (1 Run) Length ball, around the hips. KL Rahul tucks it to square leg for a single. 3.6 overs (0 Run) On the stumps. Pandey defends it out solidly. 3.5 overs (4 Runs) FOUR! Excellent delivery but the luck is with Pandey this time. Floated and full, on off. The ball grips and turns away with some extra bounce. It takes the outside edge and races down to the fence at third man. 3.4 overs (0 Run) Fuller, angled into the pads, Manish Pandey flicks it to mid-wicket. 3.3 overs (1 Run) Quicker and fuller, on off. KL Rahul pushes it gently to covers for one. 3.2 overs (1 Run) Tossed up, on off. Manish Pandey pushes it to cover for one. He gets off the mark now. 3.1 overs (1 Run) Flatter, on the stumps. Rahul taps it to point for a quick single. Shahbaz Ahmed to bowl now. 2.6 overs (0 Run) Good length, outside off. This one flies off the deck. Manish Pandey leaves it alone for the keeper. An outstanding over by Josh Hazlewood comes to an end. Three runs and a wicket off it. Manish Pandey walks out to the middle. 2.5 overs (0 Run) OUT! CAUGHT AT SLIPS! Josh Hazlewood makes the new ball dance and gets the better of Quinton de Kock. A length ball, pitching on middle and leg, it leaves the batsman with some extra bounce as it is angled across the left-hander. Quinton de Kock goes flirting away from his body and ends up getting a thick outside edge. Dinesh Karthik looks to dive initially for the catch but then pulls out. Credit to Glenn Maxwell for staying focused as he takes a step to his right at first slip to pouch it comfortably. Bangalore get the early breakthrough they were looking for. 2.4 overs (1 Run) Good length, on off. KL Rahul picks up the length very quickly and pulls it to deep mid-wicket for just a single. 2.3 overs (0 Run) A length ball, angled down leg. KL Rahul stays back, tries to flick it away but misses. He get pinged on his pads. Josh Hazlewood makes a stifled appeal but the umpire shows no interest. 2.2 overs (1 Run) Back of a length, around off. Quinton de Kock dabs it to point for a quick single. 2.1 overs (1 Run) Good length, on top of off. KL Rahul hops inside the crease and flicks it to the leg side for a single. Just one over for Siraj as Josh Hazlewood will bowl now. 1.6 overs (1 Run) Floated, full and on leg. KL Rahul flicks it through mid-wicket for one run. 1.5 overs (0 Run) Loopy ball, angled down leg. KL Rahul tries to sweep it away but misses. The ball brushes the pads on its way to the keeper. 1.4 overs (0 Run) Quicker and fuller, on middle and leg. KL Rahul stays back and tucks it to the leg side. 1.3 overs (0 Run) On the stumps, KL Rahul defends it out solidly. 1.2 overs (2 Runs) Darted on the pads, KL Rahul flicks it to the leg side for one. 1.2 overs (1 Run) WIDE! This one lands down leg. KL Rahul leaves it alone. Wide called. 1.1 overs (1 Run) Short ball, outside off, moving away. Quinton de Kock cuts it through covers for one. Who will bowl from the other end? It is Glenn Maxwell. 0.6 over (4 Runs) FOUR! Back-to-back boundaries. This is incredible placement. Full length, on the pads. KL Rahul stays back and flicks it through mid-wicket off his pads. The ball races away. 0.5 over (4 Runs) FOUR! KL Rahul gets off the mark with a boundary and spoils a good start for Siraj. Full-length ball, outside off. KL Rahul leans in and creams it through the gap at covers for a boundary. 0.4 over (0 Run) Full length, outside off. KL Rahul blocks it out watchfully. Two dots in a row now. This has been a solid start by Mohammed Siraj so far. 0.3 over (0 Run) A length ball, on off. KL Rahul blocks it out solidly. Halt in play! Quinton de Kock gets hit on the left glove and he looks in a bit of pain. The physio is out to assist him. Looks fine and we are ready to resume. 0.2 over (1 Run) Nasty hit! A length ball, on middle and leg. It climbs on the batsman. Quinton de Kock gets it to the leg side off his gloves. The batters cross for a single, but Quinton de Kock seems to be in some pain. 0.1 over (0 Run) Full length, on off. Quinton de Kock drives it to cover. The fielder there gets quick to the ball and underarms it towards the non-striker's end and also denies the single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637860015396920242.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-16-20-updates-2901695","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 15:43:53","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 20.0 overs, Royal Challengers Bangalore are 181/6. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Royal Challengers Bangalore. Everything related to Lucknow Super Giants and Royal Challengers Bangalore match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Royal Challengers Bangalore live score. Do check for Lucknow Super Giants vs Royal Challengers Bangalore scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. We are ready for the chase. THE CHASE... Right then! 182 is the target for Lucknow. Just like Faf du Plessis, someone needs to anchor the innings for Lucknow and they will rely on KL Rahul to be the one. An exciting chase is on the other side of this break. Jason Holder is in for a quick chat. He says there is something in the wicket for the spinners. Mentions the batters should make full use of the Powerplay. Adds that the ball did not grip much in the first innings. Says that the target is chaseable and they just have to get off to a solid start. Lucknow will be a tad disappointed that despite creating so much pressure early on, they have to chase a big score. Chameera started well with two big wickets but leaked runs later. Lucknow created pressure from one end but the bowlers did not capitalize from the other side, that just helped Bangalore to get stability. Bishnoi struggled with his lines while Khan and Holder were decent today. Bangalore were in all sorts of trouble with their top order all being sent back inside the Powerplay but the good thing was they had their skipper out. He needed to play the anchor innings and he played it brilliantly. Despite wickets falling at the other end, Bangalore were scoring at a really good rate. Faf du Plessis and Shahbaz Ahmed started the repair work and built a stand of 70 to help the ship get stable. Ahmed played his part and the eyes were again on Karthik who is in the form of his life. He played his part but it was all about Faf du Plessis who stood almost till the end and helped Bangalore to 181. A magnificent innings from Faf du Plessis who missed out on his maiden century in this tournament by just four runs. He started slowly but unleashed himself as the game progressed and played yet another superb knock. Bangalore will be really happy with the score. After the start they had, it was their skipper, Faf who stood up when it mattered the most and his 96 has helped Bangalore put a defendable score. 19.6 overs (0 Run) A dot to end the innings! A slower length ball, on the stumps. Harshal Patel tries to heave it away but misses. Bangalore end with 181/6. Harshal Patel walks out. 19.5 overs (0 Run) OUT! CAUGHT! Faf du Plessis walks back on 96. This is the second time in his Indian T20 League career that he perishes at 96. Back of a length, on the bodyline. Faf du Plessis stays back and pulls it to deep square leg. He does not connect it well and fails to get the desired distance on it. Marcus Stoinis makes no mistake in the deep this time. 19.4 overs (1 Run) A single now as this is worked to long on. 19.3 overs (1 Run) Short ball, on off. Faf du Plessis pulls it to deep mid-wicket for one. 19.2 overs (1 Run) DROPPED! Marcus Stoinis drops an easy chance in the deep. Short ball, on off. Dinesh Karthik pulls it to deep square leg. No one would've thought Marcus Stoinis would spill it out but you know how the game works. 19.1 overs (1 Run) Full toss, on the pads. Faf du Plessis flicks it to deep square leg for a single. Who will bowl the final over? It is Jason Holder. 18.6 overs (6 Runs) SIX! BANG! Dinesh Karthik breaks the shackles now! Full length, outside off. Dinesh Karthik latches onto it and smokes it over the long off fence for a maximum. 18.5 overs (1 Run) Full toss, on off. Faf du Plessis flicks it to deep square leg for a single. 18.4 overs (2 Runs) A length ball, on off. Faf du Plessis lofts it over covers for two runs. 18.4 overs (1 Run) WIDE! Full length, wide outside off. Just outside the tramline says the umpire. Faf du Plessis leaves it alone, as the umpire signals a wide. 18.3 overs (1 Run) Fuller, wide outside off. Dinesh Karthik reaches out and pushes it to backward point for one. 18.2 overs (1 Run) Back of a length, outside off. Faf du Plessis cuts it hard through backward point for one more. A great start to the penultimate over by Avesh Khan. 18.1 overs (1 Run) Full length, outside off. Dinesh Karthik moves to that side, sweeps it through square leg for a single. 17.6 overs (4 Runs) FOUR! Classic shot! Touch short, outside off. Faf du Plessis stays back, waits for it and guides it down the ground to third man for a boundary. 14 runs off the over, Ravi Bishnoi ends his spell of 4 overs with 47 runs. 17.5 overs (2 Runs) Faf du Plessis has been on the crease since the start but there are no signs of tired legs. Fuller, on the pads. Faf du Plessis flicks it to the leg side for two more. This is really good running. 17.4 overs (4 Runs) FOUR! Faf du Plessis is on a roll here. A short ball, on off. Faf du Plessis stands tall and pulls it through mid-wicket for a solid boundary. 17.3 overs (0 Run) Short outside off. Faf du Plessis cuts it through point. 17.2 overs (2 Runs) Two more runs! Ravi Bishnoi bowls it short, on the body. Faf du Plessis swivels on the back foot and pulls it to deep square leg for two. 17.1 overs (2 Runs) Looped up, on middle and leg. Faf du Plessis flicks it through square leg for two runs. This is really good running. Ravi Bishnoi to end his spell here. 16.6 overs (1 Run) On a length, around off. Faf du Plessis hits it to long off for a single. 16.5 overs (1 Run) A length ball, on middle and leg. Dinesh Karthik works it to mid-wicket off the inner half for one. 16.4 overs (1 Run) Length ball, on middle and leg. Faf du Plessis tucks it to the leg side for one more. 16.3 overs (2 Runs) Short ball, wide outside off. Faf du Plessis cuts it to deep point for a brace. 16.2 overs (4 Runs) FOUR! Slapped! Faf du Plessis is batting on some other deck it seems. Full-length ball, outside off. Faf du Plessis drills it through covers for a boundary. 16.1 overs (1 Run) Full length, on the pads. Dinesh Karthik flicks it through square leg for one. 15.6 overs (2 Runs) Back of a length, on the stumps. Faf du Plessis pulls it through deep square leg for a brace. 15.5 overs (1 Run) Length ball, around the hips. Dinesh Karthik flicks it to square leg for a single. 15.4 overs (1 Run) Back of a length, on off. Faf du Plessis pulls it to the leg side for a single. 15.3 overs (4 Runs) FOUR! Glorious shot! Full length, on off. Faf du Plessis sees the ball clearly and lofts it over the bowler's head. It goes over the fence on a bounce. Drinks! It is the perfect stage for Dinesh Karthik to do, what he is doing this season. Faf du Plessis alongside is pressing the gas and he will look to stay till the end. Lucknow on the other hand, will hope to build on this wicket and pull things back in their control now. 15.2 overs (0 Run) OUT! RUN OUT! Shahbaz Ahmed runs himself out and he has to walk back to the pavilion now. A length ball, outside off. Faf du Plessis crunches it to cover, but straight at KL Rahul who is placed there. Shahbaz Ahmed ventures out looking for a single but was sent back by Faf du Plessis. KL Rahul throws the ball to Jason Holder who turns quickly to rid of the bails. The umpire takes it upstairs to confirm the run out. The replays show Shahbaz Ahmed did not have any part of the blade behind the crease when the bails were lit up. A run out appeal! Shahbaz Ahmed is in trouble at the bowler's end. The replay shows the bat is on the crease while the bails are clipped off. It is touch and go and the big screen shows OUT. 15.1 overs (1 Run) On a length, outside off. Shahbaz Ahmed punches it through covers for a single. 15.1 overs (1 Run) WIDE! A loosenerto start with. The bowlers now starting to feel the pressure. A length ball, wide outside the tramline. Shahbaz Ahmed leaves it alone. Wide called.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859996248749154.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-11-15-updates-2901589","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 15:15:49","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 15.1 overs, Royal Challengers Bangalore are 132/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Lucknow Super Giants and Royal Challengers Bangalore. Everything related to Lucknow Super Giants and Royal Challengers Bangalore match will be available on Sports.NDTV.com . Stay updated with Lucknow Super Giants vs Royal Challengers Bangalore live score. Do check for Lucknow Super Giants vs Royal Challengers Bangalore scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 14.6 overs (6 Runs) SIX! 13 runs off the power! Bangalore in a pole position now. A full ball, in the arc for du Plessis who hangs back and tonks it over long on for a maximum. Hits it with ease. 14.5 overs (1 Run) Another single as Ahmed hits this full ball to long on. 14.4 overs (1 Run) Loopy ball, on middle, eased down to long on for one. 14.3 overs (0 Run) Quicker one and targeting the stumps. Faf du Plessis keeps it out. 14.2 overs (4 Runs) FOUR! Pierces the gap! Pandya drops it shot and du Plessis will any day dispatch this. he hits it in between long on and deep mid-wicket for a boundary. 14.1 overs (1 Run) Tad short and on off. Ahmed steps across and hits it to square leg for one. 13.6 overs (1 Run) Dropped! A chance for Lucknow to strike but Bishnoi has butterfingers today! Tossed up, around off, a googly. Ahmed looks to slog-sweep but gets a top edge, back over the bowler's head. Ravi Bishnoi runs back and tries to catch this skier but fails. A single. 13.5 overs (1 Run) Fifty by Faf du Plessis, a skippers knock from him and he knows the job is half-done. He will look to stick around till the end. Darted on the pads, du Plessis tucks it to deep mid-wicket for one. 13.4 overs (6 Runs) SIX! Faf du Plessis is in for a while and he will look to up the ante now. Tossed up, on middle, might be the googly. Faf du Plessis hits through the line, well over long on for a biggie. 13.3 overs (0 Run) Tossed up, full and outside off, pushed to point. 13.2 overs (1 Run) On a length and around off. Ahmed guides it to point and hurls across to complete the run. 13.1 overs (1 Run) Short and outside off, cut away to deep point for one. 12.6 overs (2 Runs) Overpitched, outside off,driven to deep cover and the batters again take two runs. Quite comfortably as the throw was wayward. 12.5 overs (2 Runs) Length ball from around the wicket, on middle. Ahmed flicks with soft hands to deep square leg and collects brace. 12.4 overs (1 Run) Short, slower and outside off, du Plessis knocks it to deep cover for a single. 12.3 overs (0 Run) Again, Chameera gets the better of Faf du Plessis! He sees him again shape for a scoop and does not give him any room. Faf du Plessis shuffles on the off side but misses. 12.2 overs (1 Run) On middle, eased down to long on for a single. Faf du Plessis has hurt his wrist. He is holding his left hand after taking the single. The throw from KL Rahul hits him directlly on the hand, but he looks fine to continue. Dushmantha Chameera also checks with the batter. Such a nice gesture by the bowler. 12.1 overs (1 Run) Chameera sees du Plessis shape to scoop this and cramps for the room with a fuller ball. Faf du Plessis miscues it on the off side for a single. There is a throw on the bowler's side and the ball hits Faf du Plessis near his wrists. 11.6 overs (1 Run) A googly, around off, du Plessis hits it to point for a single. 100 up for Bangalore. Despite losing early wickets, they are scoring at a very good rate. 11.5 overs (2 Runs) Good running! Touch short and on middle, du Plessis tucks it to mid-wicket and they take two runs easily before the ball is thrown to the keeper. 11.4 overs (4 Runs) FOUR! Much needed one! Fuller and outside off. Faf du Plessis smashes it past the bowler and it races away to the fence. 11.3 overs (0 Run) Full and on off. Punched to covers. 11.2 overs (0 Run) Flatter and on off. This one bounces off the deck, du Plessis hangs back and keeps it out. 11.1 overs (1 Run) Tossed up, around off. Ahmed slog-sweeps it to deep mid-wicket for a single. 10.6 overs (1 Run) Flatter, quicker and angling across, outside off. Ahmed works it in front of square leg for a single. 10.5 overs (1 Run) Around off, pushed to sweeper cover for a single. 10.4 overs (1 Run) Ahmed shuffles across early, Pandya serves it on the pads, it is clipped to deep square leg for one. 10.3 overs (1 Run) This one skids through, on middle, du Plessis nudges it to deep mid-wicket for one. 10.2 overs (1 Run) Touch fuller and around middle. Ahmed flicks it to deep square leg for a single. 10.1 overs (0 Run) Tossed up, around off. Ahmed steps across and blocks it.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859979406969464.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England cricket: Stuart Broad and Chris Woakes out for third round of County Championship","link":"https://www.dailymail.co.uk/sport/cricket/article-10732093/England-cricket-Stuart-Broad-Chris-Woakes-round-County-Championship.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"RICHARD GIBSON: Chris Woakes has suffered an injury set back while Stuart Broad is delaying his build-up to the Test series against New Zealand in June.","content":null,"pubDate":"2022-04-19 15:04:19","image_url":"https://i.dailymail.co.uk/1s/2022/04/19/15/56792843-0-image-m-67_1650380212280.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IPL 2022, LSG vs RCB Live Score Updates: Faf & Shahbaz keep Bangalore steady - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiY2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWxzZy12cy1yY2ItbGl2ZS1jcmlja2V0LXNjb3JlLW9ubGluZS03ODc2MzkzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, LSG vs RCB Live Score Updates: Faf & Shahbaz keep Bangalore steady  The Indian ExpressHarshal Patel gears up for the Lucknow challenge | IPL 2022  Royal Challengers BangaloreLSG vs RCB Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Super Giants vs RCB, Indian Premier League 2022, 31st Match  ESPNcricinfoLSG vs RCB: Everything you need to know | IPL 2022 | 12th Man TV  Royal Challengers BangaloreView Full coverage on Google News","content":null,"pubDate":"2022-04-19 14:55:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-6-10-updates-2901459","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 14:51:53","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 10.1 overs, Royal Challengers Bangalore are 87/4. The live updates of Lucknow Super Giants vs Royal Challengers Bangalore scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Lucknow Super Giants vs Royal Challengers Bangalore, Lucknow Super Giants vs Royal Challengers Bangalore live score, Lucknow Super Giants vs Royal Challengers Bangalore scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 9.6 overs (4 Runs) FOUR! Pulled away nicely! Back of a length, on off. Faf du Plessis stands tall and pulls it through mid-wicket. It races away to the boundary. 8 runs come off the over. 9.5 overs (1 Run) Back of a length, outside off. Shahbaz Ahmed cuts it through point for a single. 9.5 overs (1 Run) WIDE! Very well stopped by Quinton de Kock. Slower one, short ball, outside off, swinging away late. Quinton de Kock dives to his left to make a half-stop. Wide called. 9.4 overs (1 Run) A length ball, outside off, some extra bounce again by Holder. Faf du Plessis stays inside the crease and defends it to the off side awkwardly with one hand. 9.3 overs (0 Run) Fuller, on the off stump. Faf du Plessis blocks it into the deck watchfully. 9.2 overs (0 Run) A length ball, on top of off. It extracts some extra bounce off the deck. Faf du Plessis stays back and tries to flick it away but gets an inside edge on his pads. 9.1 overs (1 Run) Back of a length, outside off. Shahbaz Ahmed works it to third man for one. Drinks! Bangalore are in a spot of bother but the good thing is they have their skipper still out. With Shahbaz Ahmed there and Dinesh Karthik still to come. Bangalore will look to post a decent score. Lucknow have been really good so far and the short aim will be to control the middle phase. 8.6 overs (1 Run) Length ball, on the stumps. Shahbaz Ahmed steers it down to third man for a single. 14 runs off the over. Marcus Stoinis could not capitalize on the pressure put by Jason Holder. 8.6 overs (1 Run) WIDE! ALength ball, down leg, Shahbaz Ahmed does not chase it at all. The umpire signals a wide without any hesitation. 8.5 overs (1 Run) Length ball, on the pads. Faf du Plessis flicks it through square leg for a single. 8.4 overs (4 Runs) FOUR! Second boundary of the over. This is brilliant from Faf du Plessis. Full-length ball, outside off. Faf du Plessis prods and drives it past mid off for a boundary. 8.3 overs (1 Run) Length ball, outside off. Shahbaz Ahmed guides it to third man for a single. 8.2 overs (4 Runs) FOUR! Shahbaz Ahmed is on the charge! Good-length ball, outside off. Shahbaz Ahmed stays back and cuts it hard to beat backward point and bag a boundary. 8.1 overs (2 Runs) A short ball, on off. Shahbaz Ahmed pulls it to deep square leg for a brace. Marcus Stoinis is into the attack now. 7.6 overs (1 Run) Back of a length, on fourth stump. Shahbaz Ahmed guides it to backward point for an easy single this time. Three runs and a wicket off it. Jason Holder couldn't have asked for better start to his spell. 7.5 overs (1 Run) A length ball, around the hips, with some extra bounce off the deck. Faf du Plessis tucks it awkwardly to mid-wicket and scampers across for a quick single. 7.4 overs (1 Run) A short ball, landing outside off, Shahbaz Ahmed stands back and cuts it to deep point for a single. He gets off the mark now. 7.3 overs (0 Run) A length ball, around off, angled across the left-hander. Shahbaz Ahmed stays back and dabs it to point. Shahbaz Ahmed is the new man in. 7.2 overs (0 Run) OUT! CAUGHT! Jason Holder strikes only on his second delivery. Bangalore in a spot of bother. It is a full-length ball, angled into the pads. Suyash Prabhudessai comes down the track and tries to flick it to the leg side, but he was a tad early into his shot. The ball takes the splice of his blade and lobs towards short mid-wicket. Krunal Pandya stationed there takes a dolly. 7.1 overs (0 Run) Jason Holder asking the right questions straightaway! A length ball, in the corridor of uncertainty. Suyash Prabhudessai tries to defend it out but misses. Jason Holder to bowl now. 6.6 overs (4 Runs) FOUR! Ravi Bishnoi goes for 15 in his first over. It is full and wide outside off. Faf du Plessis latches onto it and drives it through the cover region. KL Rahul there misfields and the ball races away. 6.5 overs (1 Run) Floated and full, on off. Suyash Prabhudessai gets it to mid-wicket off the inner half. They cross for one. 6.4 overs (6 Runs) SIX! SMASHED! Suyash Prabhudessai makes the most of the Free Hit. This boundary will surely spoil the over for Bishnoi. Fuller, outside off. Suyash Prabhudessai smokes it over the long off fence for a biggie. 6.4 overs (1 Run) Short ball, outside off. Suyash Prabhudessai steers it to short third man yet again. Although, this time the umpire signals a no ball, as the bowler oversteps. A Free Hit to follow. 6.3 overs (0 Run) Length, outside off. Suyash Prabhudessai waits for it and guides it to short third man. 6.2 overs (1 Run) Darted on the pads. Faf du Plessis flicks it to the leg side for one. 6.1 overs (1 Run) Tossed up, on off. Suyash Prabhudessai punches it to cover for a single. 6.1 overs (1 Run) WIDE! Floated and full, wide outside off, it turns away a bit. Suyash Prabhudessai lets it be. Wide called. Ravi Bishnoi is into the attack. 5.6 overs (0 Run) A dot to end the over! Fuller, angled into the pads. Faf du Plessis pushes it back to the bowler. A wicket-taking over by Krunal Pandya comes to an end. Bangalore are 47/3 at the end of the Powerplay. 5.5 overs (1 Run) Fuller, on leg. Suyash Prabhudessai makes room and slaps it down the ground for a single. 5.4 overs (1 Run) Length ball, on middle and leg. Faf du Plessis tucks it to mid-wicket for one more. 5.3 overs (1 Run) On the pads, Suyash Prabhudessai flicks it to mid-wicket for a single. He gets off the mark instantly. Suyash Prabhudessai walks out. 5.2 overs (0 Run) OUT! CAUGHT! Glenn Maxwell tries to be innovative but pays the price instead. It is tossed up, full and on off. Glenn Maxwell shuffles across and reverse-sweeps it to the left of short fine leg. Jason Holder who is stationed there moves to his left, puts in a full stretched dive and plucks the ball out of thin air with one hand. Incredible fielding. Glenn Maxwell trudges back to the pavilion. Bangalore lose three wickets inside the Powerplay. 5.1 overs (1 Run) Flatter and angled into the pads. Faf du Plessis stays back and tucks it to mid-wicket for one.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859965045034609.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Kohli's expression after first-ball duck goes viral, sets Twitter on fire - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93YXRjaC12aXJhdC1rb2hsaS1zLWV4cHJlc3Npb24tYWZ0ZXItcGVyaXNoaW5nLWZvci1maXJzdC1iYWxsLWR1Y2staW4tbHNnLXZzLXJjYi1tYXRjaC1nb2VzLXZpcmFsLXNldHMtdHdpdHRlci1vbi1maXJlLTEwMTY1MDM3ODQwMDM5OS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Kohli's expression after first-ball duck goes viral, sets Twitter on fire  Hindustan TimesTwitterverse Left Disappointed As Virat Kohli Falls For A Golden Duck Against LSG  Cricket AddictorKL Rahul has improved his leadership qualities: Wasim Jaffer  CricTrackerWarner shares heartfelt image of daughters getting emotional following his dismissal  Gulf News\"Last Time I Saw Him He Was Commentating\": AB de Villiers In Awe Of Dinesh Karthik  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-04-19 14:37:18","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli totals runs in IPL 2022: Virat Kohli last 10 innings in IPL","link":"https://thesportsrush.com/cricket-news-virat-kohli-totals-runs-in-ipl-2022-virat-kohli-last-10-innings-in-ipl/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","RCB","Deepak Hooda","Dushmantha Chameera","Indian Premier League","LSG","Royal Challengers Bangalore","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Virat Kohli last 10 innings: The former captain of Royal Challengers Bangalore is struggling for runs in Indian Premier League 2022. During the 31st match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Royal Challengers Bangalore in Navi Mumbai, former Royal Challengers Bangalore captain Virat Kohli has registered… The post Virat Kohli totals runs in IPL 2022: Virat Kohli last 10 innings in IPL appeared first on The SportsRush.","content":"Virat Kohli last 10 innings: The former captain of Royal Challengers Bangalore is struggling for runs in Indian Premier League 2022. During the 31st match of the ongoing 15th season of the Indian Premier League between Lucknow Super Giants and Royal Challengers Bangalore in Navi Mumbai, former Royal Challengers Bangalore captain Virat Kohli has registered a rare first-ball duck. It all happened on the last delivery of the first over when Kohli’s attempt to push a Lucknow Super Giants fast bowler Dushmantha Chameera delivery resulted in his dismissal. Fielding at backward point, all-rounder Deepak Hooda grabbed a straightforward catch as RCB lost wickets on consecutive deliveries. Coming in to bat at No. 3 in the same over, Kohli continued his lean patch after walking back to the pavilion without scoring at the Dr DY Patil Sports Academy tonight. From being part of a couple of runs-outs to timing the ball straight to fielders, Kohli has provided enough signs of a batter being in a quintessential poor form. In seven innings this season, Kohli’s 119 runs have come at an average of 19.83 and a strike rate of 123.95. Kohli’s cup of misery o overflowing. Barely 100 runs so far this season, golden duck today — Cricketwallah (@cricketwallah) April 19, 2022 With captain Faf du Plessis and all-rounder Glenn Maxwell batting in the middle after RCB being reduced to 7/2 in the first over, the team would be hoping for their senior overseas duo to come good tonight. Virat Kohli last 10 innings As far as Kohli’s last 10 innings in the IPL are concerned, Kohli’s 167 runs have come at an average and strike rate of 18.55 and 118.43 respectively. The last time when Kohli had scored an IPL half-century was against Mumbai Indians at the Dubai International Cricket Stadium during IPL 2021 Phase 2. Readers must note that Royal Challengers were asked to bat first by Super Giants captain KL Rahul in this match. Both the teams didn’t make any change to their Playing XI tonight. The post Virat Kohli totals runs in IPL 2022: Virat Kohli last 10 innings in IPL appeared first on The SportsRush.","pubDate":"2022-04-19 14:28:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Gauti bhai ne 2-3 baar aawaaz di SKY SKY”: Suryakumar Yadav shares how Gautam Gambhir nicknamed him SKY","link":"https://thesportsrush.com/cricket-news-gauti-bhai-ne-2-3-baar-aawaaz-di-sky-sky-suryakumar-yadav-shares-how-gautam-gambhir-nicknamed-him-sky/","keywords":["Cricket","Gautam Gambhir","Sky","Suryakumar Yadav"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Suryakumar Yadav has shared the story behind getting his nickname “SKY” by Gautam Gambhir during his stint with Kolkata Knight Riders. Indian batter Suryakumar Yadav has been one of India’s most consistent batters in the recent past. He recently appeared on the show “Breakfast with Champions”, where he talked about a lot of topics, such… The post “Gauti bhai ne 2-3 baar aawaaz di SKY SKY”: Suryakumar Yadav shares how Gautam Gambhir nicknamed him SKY appeared first on The SportsRush.","content":"Suryakumar Yadav has shared the story behind getting his nickname “SKY” by Gautam Gambhir during his stint with Kolkata Knight Riders. Indian batter Suryakumar Yadav has been one of India’s most consistent batters in the recent past. He recently appeared on the show “Breakfast with Champions”, where he talked about a lot of topics, such as how he met his wife and more. On the show, Suryakumar Yadav also revealed how he got his nickname “SKY”. Suryakumar Yadav reveals how he got his nickname “SKY” Suryakumar Yadav made his IPL debut for Mumbai Indians in 2012, but the actual turnaround of his career started in 2014. Kolkata Knight Riders bought Surya in 2014, and he was given regular chances in the side. In the first season, he impressed everyone by scoring 160 runs at a strike-rate of 140.17. Kolkata Knight Riders used him as a lower-order batter, which reaped them great rewards. Suryakumar revealed that he got his nickname “SKY” from Gautam Gambhir during IPL 2014. On the show “Breakfast with Champions”, Surya revealed the story. “In 2014, when I was with KKR, Gauti (Gambhir) Bhai began calling me SKY”, Suryakumar revealed. “When I didn’t respond, he came and said ‘Bro, I’m calling you only, look at your initials.'” “And then I realised it’s SKY.” Recommending some yoga poses to keep fit Stretch yourself. SKY is the limit #INDvENG #Cricket #T20I #SuryakumarYadav pic.twitter.com/F1yPu2pmUm — KolkataKnightRiders (@KKRiders) March 18, 2021 Suryakumar Yadav revealed that Gautam Gambhir was the first one who believed in his ability. Gautam used to scold him as well whenever he used to do something wrong, and Surya agreed that Gautam played an important part in his career. Surya stayed in Kolkata Knight Riders from 2014 to 2017. In 2018, Mumbai Indians bought Suryakumar Yadav, and this took Surya’s career to a whole new level. He scored 512 runs in his very first season with the Mumbai Indians, and he is still an important part of the Mumbai Indians’ core group. Mumbai Indians retained Surya alongside Rohit Sharma, Jasprit Bumrah and Kieron Pollard ahead of IPL 2022 auction. In IPL, Suryakumar Yadav has scored 2541 runs at an average of 30.61, courtesy of 15 half-centuries. He has won three IPL titles in his career. The post “Gauti bhai ne 2-3 baar aawaaz di SKY SKY”: Suryakumar Yadav shares how Gautam Gambhir nicknamed him SKY appeared first on The SportsRush.","pubDate":"2022-04-19 13:56:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lucknow Super Giants vs Royal Challengers Bangalore Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/lucknow-super-giants-vs-royal-challengers-bangalore-live-score-over-match-31-t20-1-5-updates-2901231","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Lucknow Super Giants vs Royal Challengers Bangalore from Dr. DY Patil Sports Academy, Navi Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-19 13:36:05","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637859919555569808.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav wife: Who is Devisha Shetty? Suryakumar Yadav love story","link":"https://thesportsrush.com/cricket-news-suryakumar-yadav-wife-who-is-devisha-shetty-suryakumar-yadav-love-story/","keywords":["Cricket","Devisha Shetty","MI","Suryakumar Yadav"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Suryakumar Yadav wife: Suryakumar Yadav has told multiple times that his wife Devisha Shetty has played a big role in his career. Mumbai Indians have been performing poorly in the Indian Premier League, but Suryakumar Yadav has been ever consistent for them. Suryakumar Yadav recently appeared on the show “Breakfast with Champions”, where he talked… The post Suryakumar Yadav wife: Who is Devisha Shetty? Suryakumar Yadav love story appeared first on The SportsRush.","content":"Suryakumar Yadav wife: Suryakumar Yadav has told multiple times that his wife Devisha Shetty has played a big role in his career. Mumbai Indians have been performing poorly in the Indian Premier League, but Suryakumar Yadav has been ever consistent for them. Suryakumar Yadav recently appeared on the show “Breakfast with Champions”, where he talked about various topics of his cricketing journey. He also laid down the importance of his wife in shaping his career. Suryakumar Yadav wife Suryakumar Yadav has said that his wife Devisha Shetty has played a huge part in shaping his career. In a recent episode of “Breakfast with Champions”, Suryakumar revealed the love story with his wife Devisha Shetty. Surya revealed that he met his wife during his college days in 2010. Surya revealed that he asked his friend to introduce him to Devisha, and both of them started taking via BBM. He also said that both of them used to fight, but everything went right all along. Suryakumar Yadav used to do well for Mumbai Indians, but he was not cracking in the Indian national team. Both Suryakumar and Divisha got married in 2016, and Surya said that she made him realize what he has done in the last few years. Devisha asked Suryakumar to focus on his cricket and leave all the distractions. Surya told that he played alongside KL Rahul, Jasprit Bumrah and Axar Patel, who all had represented India till then. Wishing this #OneFamily all the on five years of togetherness Happy Anniversary, Surya and Devisha #MumbaiIndians @surya_14kumar pic.twitter.com/kYh2MaSjjg — Mumbai Indians (@mipaltan) July 7, 2021 Suryakumar Yadav has been a consistent performer in the Indian Premier League and other domestic tournaments, but he was not getting his place in the national side. He finally got the chance to make his India debut in 2021 against England in the T20Is. He revealed that his wife gave him an important lesson after the game. “It was 4 am in the morning and she said ‘your journey actually starts now'”, Suryakumar Yadav said. “Your real cricket journey that you worked hard for 10 years…starts now. This is not the endpoint, you can enjoy it tonight,” Surya added on his wife’s advice.   The post Suryakumar Yadav wife: Who is Devisha Shetty? Suryakumar Yadav love story appeared first on The SportsRush.","pubDate":"2022-04-19 13:12:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Gal truth bomb rocks Ponga amid contract chaos","link":"https://wwos.nine.com.au/nrl/2022-knights-kalyn-ponga-contract-dolphins-paul-gallen-2gb-radio/c57d0110-7c31-4733-a5cc-c376082b9f6f","keywords":null,"creator":["wwos"],"video_url":null,"description":"Paul Gallen has dropped a truth bomb on Kalyn Ponga amid the contract negotiations of the Newcastle superstar.","content":"Paul Gallen has dropped a truth bomb on Kalyn Ponga after Phil Gould shredded the media for turning the contract negotiations of the Knights phenom into a \"circus\".Gould on Monday night launched a scathing attack on the media amid the tug-of-war between the Knights and Dolphins for Ponga's signature, slamming the thirst of journalists to have answers immediately instead of patiently waiting for the Newcastle co-captain to decide on his own terms.\"I would say ignore the media and just get on with your own negotiations and your own business,\" Gould said on Nine's 100% Footy.\"The only circus around here has been created by the media.\"READ MORE: Stubborn Rooster's blunt message to incoming aceREAD MORE: Former Aussie cricket star in coma after heart attackREAD MORE: Gallen taking 'big risk' as title fight confirmedPonga is tossing up whether to trigger an option in his favour to remain at Newcastle for the next two years or shun the Knights and join the Dolphins.Media coverage of Ponga's contract talks have grown more intense by the week – and Gallen doesn't see an issue with it.Stream the NRL premiership 2022 live and free on 9Now.\"This is part and parcel of the game. This is what you do. When you sign big-money contracts and you're a high-profile player, you attract attention and you attract media attention,\" Gallen said on 2GB's Wide World of Sports radio.\"At the end of the day, the media are the ones that virtually pay these blokes' bills. If it wasn't a sport so covered by the media and people weren't so interested, they wouldn't get paid the money they get paid.\"He signed a contract like that, he chose to have a contract like that, (so) he's got to deal with the consequences.\"Ponga has repeatedly pointed out the role of his manager in a bid to divert attention away from himself, but Gallen warned the Queensland State of Origin fullback against it.\"Kalyn is the boss and he has to make the decision and that's what a lot of players (say): 'my management is looking after me, my manager is looking after me'. That's what they say. A lot of people say it,\" Gallen said.\"But you know what? At the end of the day it reflects on you. You're the person signing the contract, you're the one running out on the field. It reflects on you.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-04-19 13:12:43","full_description":"Paul Gallen has dropped a truth bomb on Kalyn Ponga after Phil Gould shredded the media for turning the contract negotiations of the Knights phenom into a \"circus\". Gould on Monday night launched a scathing attack on the media amid the tug-of-war between the Knights and Dolphins for Ponga's signature , slamming the thirst of journalists to have answers immediately instead of patiently waiting for the Newcastle co-captain to decide on his own terms. \"I would say ignore the media and just get on with your own negotiations and your own business,\" Gould said on Nine's 100% Footy . \"The only circus around here has been created by the media.\" READ MORE: Stubborn Rooster's blunt message to incoming ace READ MORE: Former Aussie cricket star in coma after heart attack READ MORE: Gallen taking 'big risk' as title fight confirmed Ponga is tossing up whether to trigger an option in his favour to remain at Newcastle for the next two years or shun the Knights and join the Dolphins . Media coverage of Ponga's contract talks have grown more intense by the week – and Gallen doesn't see an issue with it. Stream the NRL premiership 2022 live and free on 9Now . \"This is part and parcel of the game. This is what you do. When you sign big-money contracts and you're a high-profile player, you attract attention and you attract media attention,\" Gallen said on 2GB's Wide World of Sports radio . \"At the end of the day, the media are the ones that virtually pay these blokes' bills. If it wasn't a sport so covered by the media and people weren't so interested, they wouldn't get paid the money they get paid. \"He signed a contract like that, he chose to have a contract like that, (so) he's got to deal with the consequences.\" Ponga has repeatedly pointed out the role of his manager in a bid to divert attention away from himself, but Gallen warned the Queensland State of Origin fullback against it. \"Kalyn is the boss and he has to make the decision and that's what a lot of players (say): 'my management is looking after me, my manager is looking after me'. That's what they say. A lot of people say it,\" Gallen said. \"But you know what? At the end of the day it reflects on you. You're the person signing the contract, you're the one running out on the field. It reflects on you.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/04/424265/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav Reveals Name Of Player Who Gave Him The Nickname \"SKY\"","link":"https://sports.ndtv.com/cricket/suryakumar-yadav-reveals-name-of-player-who-gave-him-the-nickname-sky-2901025","keywords":null,"creator":null,"video_url":null,"description":"In a conversation with seasoned cricket presenter Gaurav Kapur, on his show \"Breakfast with Champions\", Suryakumar revealed how he got his nickname \"SKY\" and who gave it to him.","content":null,"pubDate":"2022-04-19 12:42:09","image_url":"https://c.ndtvimg.com/2022-04/9aocldvg_suryakumar-yadav-bcci_625x300_09_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Dinesh Karthik makes me feel like I want to go back and play some cricket again: Ab de Villiers hails RCB star","link":"https://www.indiatoday.in/sports/ipl-2022/story/dinesh-karthik-makes-me-feel-like-i-want-to-go-back-and-play-some-cricket-again-ab-de-villiers-hails-rcb-star-1939366-2022-04-19?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Dinesh Karthik makes me feel like I want to go back and play some cricket again: Ab de Villiers","content":null,"pubDate":"2022-04-19 12:21:33","full_description":"Former RCB star AB de Villiers has hailed Dinesh Karthik as a '360 degree' player, saying that RCB keeper makes him feel like he wanted to go back and play some cricket again. Notably, Virat had told Karthik that AB de Villiers would be proud to see him finishing games for RCB in IPL. Karthik has donned the finisher's hat for RCB and has been hitting the ball fluently for his new franchise Royal Challengers Bangalore this season. The veteran wicketkeeper has produced effective knocks of 32, 14, 44, 7, 34, and 66 with an astonishing strike rate of 209.57. By remaining unbeaten in five of the six innings, he is averaging 197.00. IPL 2022 FULL COVERAGE \"The form he is at this moment and he has already won RCB 2-3 games. He looks like he is in the form of his life. I don't know where that comes from because he hasn't played a lot of cricket. But man, he looks in good form and he plays around the wicket 360 degrees. He almost makes me feel like I want to go back and play some cricket again, watching him play. He gets me excited, plays under pressure in the middle order and he's got a lot of experience and if he keeps his form up there is a good chance that RCB are going a long way up,\" he said. AB admitted that he was shocked to see Dinesh Karthik batting for Bangalore in IPL 2022 adding that he has had no cricket exposure in the last few months and was commentating in England before the second leg of IPL 2021. \"I was incredibly surprised and I didn't expect it. I have always known that he is a very capable player, a nitty-gritty kind of a guy. He likes the high-pressure situations and he's a busy player at the wicket. But he hasn't played a lot of cricket. The last time I saw him before IPL he was commentating in the UK. He wasn't playing a lot of domestic cricket and I though he is possibly at the end of his career finishing. But he surprised us all I think with the intent and energy,\" Live TV --- ENDS --- ALSO READ | Suryakumar Yadav reveals how Gautam Gambhir’s belief changed his entire career","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler redefining role of opener with T20's most cherished record on the horizon","link":"https://uk.sports.yahoo.com/news/jos-buttler-redefining-role-opener-115841214.html?src=rss","keywords":["Sports"],"creator":["The Telegraph"],"video_url":null,"description":"Test cricket is awash with numbers showing batting mastery: 99.94, Don Bradman’s average, retains the most mystique. The nearest that Twenty20 yet has to an equivalent is 973: the number of runs that Virat Kohli scored in his 2016 Indian Premier League season.","content":"Test cricket is awash with numbers showing batting mastery: 99.94, Don Bradman’s average, retains the most mystique. The nearest that Twenty20 yet has to an equivalent is 973: the number of runs that Virat Kohli scored in his 2016 Indian Premier League season.","pubDate":"2022-04-19 11:58:41","image_url":null,"source_id":"yahoo_hk","country":["hong kong"],"category":["sports"],"language":"chinese"},{"title":"Stubborn Rooster's blunt message to incoming superstar","link":"https://wwos.nine.com.au/nrl/2022-roosters-storm-brandon-smith-sam-verrills-contract/16d5f72f-96b8-438d-b6cf-c336af33a94f","keywords":null,"creator":["wwos"],"video_url":null,"description":"Superstar hooker Brandon Smith might have a fight on his hands when he arrives at the Roosters after this season.","content":"The arrival of Brandon Smith at the Roosters is looming, but incumbent Tricolours hooker Sam Verrills says making way for the superstar rake is not in the picture.Smith has won an NRL premiership, is New Zealand's Test No.9 and is the reigning Dally M hooker of the year.Melbourne rates him so highly that he was preferred over the magnificent Harry Grant as the Storm's chief hooker in 2021.READ MORE: AFL's defiant message amid umpiring controversyREAD MORE: Former Aussie cricket star in coma after heart attackREAD MORE: Gallen taking 'big risk' as title fight confirmedIt took a well-documented off-season from hell for Smith to be stripped of the mantle.The 25-year-old is expected to make the Roosters' No.9 jumper his own in about six months' time – but Verrills is defiant.\"I know he's coming... I'm not silly. I know he's coming,\" Verrills told reporters.\"He's a good player, as well. I'm not dumb about that.\"But I'm definitely going to put my foot forward and try to cement the spot.\"Verrills is contracted to the Roosters until the end of 2024, but on so many occasions what's written on paper hasn't stopped a player from departing early.Nine's Danny Weidler prodded in the press conference with Verrills, asking if he saw the signing of Smith as a chance to take his rugby league career elsewhere.Stream the NRL premiership 2022 live and free on 9Now.\"Definitely not,\" Verrills said.\"I only see it as a challenge.\"A broken thumb wiped Verrills from the first five rounds of this season, but the 23-year-old returned for the Roosters' match against the Warriors on Sunday, won by the Tricolours 22-14.Drew Hutchison started at hooker in the Warriors clash and Verrills on the bench, but their roles have been reversed for the Roosters' traditional Anzac Day game against the Dragons.Verrills has played 34 NRL games since debuting in 2019.Melbourne coach Craig Bellamy is using Smith as a bench player in the larrikin's final season at the Storm.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-04-19 11:41:00","full_description":"The arrival of Brandon Smith at the Roosters is looming, but incumbent Tricolours hooker Sam Verrills says making way for the superstar rake is not in the picture. Smith has won an NRL premiership, is New Zealand's Test No.9 and is the reigning Dally M hooker of the year. Melbourne rates him so highly that he was preferred over the magnificent Harry Grant as the Storm's chief hooker in 2021. READ MORE: AFL's defiant message amid umpiring controversy READ MORE: Former Aussie cricket star in coma after heart attack READ MORE: Gallen taking 'big risk' as title fight confirmed It took a well-documented off-season from hell for Smith to be stripped of the mantle. The 25-year-old is expected to make the Roosters' No.9 jumper his own in about six months' time – but Verrills is defiant. \"I know he's coming... I'm not silly. I know he's coming,\" Verrills told reporters. \"He's a good player, as well. I'm not dumb about that. \"But I'm definitely going to put my foot forward and try to cement the spot.\" Verrills is contracted to the Roosters until the end of 2024, but on so many occasions what's written on paper hasn't stopped a player from departing early. Nine's Danny Weidler prodded in the press conference with Verrills, asking if he saw the signing of Smith as a chance to take his rugby league career elsewhere. Stream the NRL premiership 2022 live and free on 9Now . \"Definitely not,\" Verrills said. \"I only see it as a challenge.\" A broken thumb wiped Verrills from the first five rounds of this season, but the 23-year-old returned for the Roosters' match against the Warriors on Sunday, won by the Tricolours 22-14. Drew Hutchison started at hooker in the Warriors clash and Verrills on the bench, but their roles have been reversed for the Roosters' traditional Anzac Day game against the Dragons . Verrills has played 34 NRL games since debuting in 2019. Melbourne coach Craig Bellamy is using Smith as a bench player in the larrikin's final season at the Storm. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/04/424263/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Karthik can do a finisher role for India in T20 World Cup, says Gavaskar","link":"https://telanganatoday.com/ipl-2022-karthik-can-do-a-finisher-role-for-india-in-t20-world-cup-says-gavaskar","keywords":["News","Sport","Dinesh Karthik","Indian Premier League (IPL)","Royal Challengers Bangalore (RCB)","Sunil Gavaskar"],"creator":["IANS"],"video_url":null,"description":"Mumbai: Dinesh Karthik, who has been finishing games for Royal Challengers Bangalore (RCB) in Indian Premier League (IPL), has got praises from legendary Sunil Gavaskar. The former Indian captain Gavaskar backed Karthik, saying the wicketkeeper-batter is capable of changing the complexion of the game in the IPL 2022 with his batting exploits. He added that […]","content":"Mumbai: Dinesh Karthik, who has been finishing games for Royal Challengers Bangalore (RCB) in Indian Premier League (IPL), has got praises from legendary Sunil Gavaskar. The former Indian captain Gavaskar backed Karthik, saying the wicketkeeper-batter is capable of changing the complexion of the game in the IPL 2022 with his batting exploits. He added that the senior Indian cricketer will do the same for the national side during the T20 World Cup. “Of course, he’ll be the RCB player to watch out for in the game against Lucknow. He’s just changing the complexion of the game with his performance. He’s doing it for his team. He said he wants to be a part of the Indian Team for the T20 World Cup. So what I am saying is don’t look at his age, just look at what he’s producing. He’s doing the job that you can expect him to do at number 6 or 7 at the World Cup,” Gavaskar said on Cricket Live on Star Sports. Former Australian cricketer Matthew Hayden claimed RCB’s senior batting trio of Faf du Plessis, Virat Kohli and Glenn Maxwell will fire against LSG in their upcoming contest. “The RCB have got some good mix of talent and there are a few players who are going to have a crack in the game. RCB have their captain Faf du Plessis who scored an impressive 88 in the first game but his form has tapered off a little bit. Of course, they’ve got Glenn Maxwell there as well. He has also made a few footprints in the tournament. So with Virat, Maxi and Faf, expect fireworks from them,” Hayden said. Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-19 11:12:19","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Virat Kohli vs Ravi Bishnoi in IPL: Virat Kohli at DY Patil Stadium IPL stats and records","link":"https://thesportsrush.com/cricket-news-virat-kohli-vs-ravi-bishnoi-in-ipl-virat-kohli-at-dy-patil-stadium-ipl-stats-and-records/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","RCB vs LSG","Virat Kohli"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Virat Kohli vs Ravi Bishnoi in IPL: The battle between Virat Kohli and Ravi Bishnoi will be an interesting one in LSG vs RCB IPL 2022 match. Royal Challengers Bangalore and Lucknow Super Giants will be up against each other in the league game of IPL 2022 at the DY Patil in Stadium. Both teams… The post Virat Kohli vs Ravi Bishnoi in IPL: Virat Kohli at DY Patil Stadium IPL stats and records appeared first on The SportsRush.","content":"Virat Kohli vs Ravi Bishnoi in IPL: The battle between Virat Kohli and Ravi Bishnoi will be an interesting one in LSG vs RCB IPL 2022 match. Royal Challengers Bangalore and Lucknow Super Giants will be up against each other in the league game of IPL 2022 at the DY Patil in Stadium. Both teams have won four of their six games in the tournament so far. For RCB, Dinesh Karthik has been their main man this season, but the duo of Virat Kohli and Faf du Plessis has failed this season. Virat Kohli is not having his best IPL season, and he would want to take on the Lucknow Super Giants’ bowlers. Virat Kohli vs Ravi Bishnoi in IPL The battle between Virat Kohli can be an intriguing one to watch out for. Both Virat and Bishnoi have played much against each other, but Bishnoi has an upper hand on the former RCB captain. Kohli has scored 17 runs on 19 balls of Bishnoi at a strike-rate of 89.47. Bishnoi has not been able to dismiss Virat, but he has certainly kept him under control. It is worth noting that Virat Kohli has struggled against leg-spinners in international cricket as well. Adam Zampa and Adil Rashid have troubled Virat Kohli in international cricket. Virat Kohli has been struggling this season as well with the bat, he has scored 119 IPL 2022 runs at 23.80. Bishnoi has scalped five wickets in six games this season at an economy of 7.16. Game Day mood: Focused. Have a great Tuesday, 12th Man Army! #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #ನಮ್ಮRCB #LSGvRCB pic.twitter.com/x0JbkgqyYC — Royal Challengers Bangalore (@RCBTweets) April 19, 2022 Virat Kohli at DY Patil Stadium IPL stats and records Kohli has not enjoyed batting at the DY Patil Stadium in IPL. Virat has played six IPL games so far at this venue, where he has scored 63 runs at an average of 21.00. He has a strike-rate of 136.96 at this venue. 41* is Virat’s highest score on this ground, which he scored against Punjab Kings this season. Virat has been struggling to find his form since the last season, and he has not been great this season as well for the franchise. Out of six games at this venue, three games have been played this season only. The post Virat Kohli vs Ravi Bishnoi in IPL: Virat Kohli at DY Patil Stadium IPL stats and records appeared first on The SportsRush.","pubDate":"2022-04-19 11:05:30","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: THIS former SRH player gets out on duck, has car STOLEN; fans share hilarious jokes - WATCH","link":"https://zeenews.india.com/cricket/ipl-2022-former-srh-player-carlos-brathwaite-gets-out-on-duck-has-car-stolen-fans-share-hilarious-jokes-watch-2455297.html","keywords":null,"creator":null,"video_url":null,"description":"Things didn't go well for Carlos Brathwaite as he failed to pick up a wicket, conceding 31 runs in his four overs. He was then out for a first-ball duck as Knowle and Dorridge Cricket Club lost by 12 runs. To add to the misery, he found out that his car too had been stolen.","content":null,"pubDate":"2022-04-19 10:42:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Dutch cricket coach Ryan Campbell in intensive care after heart attack","link":"https://www.dutchnews.nl/news/2022/04/dutch-cricket-coach-ryan-campbell-in-intensive-care-after-heart-attack/","keywords":["Sport"],"creator":["robin"],"video_url":null,"description":"The coach of the Dutch national cricket team has had a heart attack during a family holiday in Britain and...","content":null,"pubDate":"2022-04-19 10:40:14","image_url":null,"source_id":"dutchnews","country":["netherland"],"category":["sports"],"language":"english"},{"title":"Dale Steyn on Umran Malik: He will play international cricket soon","link":"https://sportstar.thehindu.com/cricket/ipl/ipl-news/sunrisers-hyderabad-umran-malik-fast-bowler-dale-steyn-kane-williamson-cricket-ipl-2022/article38477195.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Former South Africa pacer Steyn, who is currently the fast bowling coach of Sunrisers Hyderabad, lauded the youngster from Jammu for clocking 150kmph consistently.","content":null,"pubDate":"2022-04-19 10:23:59","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Ryan Campbell: Australia’s cricket community united in hope after another shock heart attack","link":"https://thewest.com.au/sport/cricket/ryan-campbell-australias-cricket-community-united-in-hope-after-another-shock-heart-attack--c-6495841","keywords":null,"creator":["Steve Butler"],"video_url":null,"description":"A daring and swashbuckling cricket innovator, former WA star Ryan Campbell now has the Australian cricket community hoping he survives a shock heart attack at a London playground during the Easter weekend.","content":null,"pubDate":"2022-04-19 10:13:50","image_url":"https://images.thewest.com.au/publication/C-6495841/4f440d92efc602be9b5dcd8833ff0c8e0566ab1c-16x9-x1y0w2446h1376.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Dinesh Karthik can play finisher’s role for India at T20 World Cup 2022, says THIS cricket legend","link":"https://zeenews.india.com/cricket/dinesh-karthik-can-play-finisher-s-role-for-india-at-t20-world-cup-2022-says-this-cricket-legend-sunil-gavaskar-2455265.html","keywords":null,"creator":null,"video_url":null,"description":"Dinesh Karthik has produced effective knocks of 32, 14, 44, 7, 34 and 66 with an astonishing strike-rate of 209.57. By remaining unbeaten in five of the six innings, he is averaging 197.00.","content":null,"pubDate":"2022-04-19 09:52:00","full_description":"Impressed with the way Royal Challengers Bangalore wicketkeeper Dinesh Karthik is making his bat talk in IPL 2022, the legendary Indian opener Sunil Gavaskar reckons that the veteran keeper-batter can play the role of a finisher for the Indian team in the T20 World Cup 2022 later this year. Karthik has been hitting the ball fluently for his new franchise Royal Challengers Bangalore this season. The former Kolkata Knight Riders skipper has produced effective knocks of 32, 14, 44, 7, 34 and 66 with an astonishing strike-rate of 209.57. By remaining unbeaten in five of the six innings, he is averaging 197.00. “He said he wants to be a part of the Indian Team for the T20 World Cup. So what I am saying is don't look at his age, just look at what he's producing,” Gavaskar told Star Sports. Muthoot Blue Soch Champion: Dinesh Karthik #PlayBold #WeAreChallengers #IPL2022 #Mission2022 #RCB #nmmRCB pic.twitter.com/kuxrSsNsQb — Royal Challengers Bangalore (@RCBTweets) April 18, 2022 Karthik’s best this season came (66 not out from 34 balls) against Delhi Capitals in their last outing when he took on the experienced Mustafizur Rahman and Indian left-arm pacer Khaleel Ahmed with his fantastic strokeplay to power them to a match-winning 189/5. RCB won the match by 16 runs and Karthik was adjudged Player-of-the-match. “He’s just changing the complexion of the game with his performance. He’s doing it for his team. He's doing the job that you can expect him to do at number 6 or 7 at the (T20) World Cup (in October-November),” Gavaskar added. A veteran of 26 Tests, 94 ODIs and 32 T20Is, the 36-year-old last played for India in the heartbreaking semi-final loss to New Zealand in the ICC 50-over World Cup in 2019. (with PTI inputs)","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"DC vs PBKS match shifted to Mumbai from Pune due to virus outbreak","link":"https://telanganatoday.com/dc-vs-pbks-match-shifted-to-mumbai-from-pune-due-to-virus-outbreak","keywords":["Cricket","IPL","News","Sport","DC vs PBKS","Delhi Capitals","IPL 2022","Punjab Kings","virus outbreak"],"creator":["PTI"],"video_url":null,"description":"Mumbai: The upcoming IPL match between COVID-hit Delhi Capitals and Punjab Kings was on Tuesday shifted to Mumbai from Pune following a virus outbreak in the Risabh Pant-led team. In a statement, the BCCI said it has moved Wednesday’s game to Brabourne stadium to ensure no COVID infection goes undetected in the bio-bubble. Five members […]","content":"Mumbai: The upcoming IPL match between COVID-hit Delhi Capitals and Punjab Kings was on Tuesday shifted to Mumbai from Pune following a virus outbreak in the Risabh Pant-led team. In a statement, the BCCI said it has moved Wednesday’s game to Brabourne stadium to ensure no COVID infection goes undetected in the bio-bubble. Five members of Delhi Capitals, including Australian all-rounder Mitchell Marsh have tested positive for the virus. Physio Patrick Farhart, sports massage therapist Chetan Kumar, team doctor Abhijit Salvi and social media content team member Akash Mane have also got the infection. “The Board of Control for Cricket in India on Tuesday announced a change of venue for Match No. 32 – Delhi Capital versus Punjab Kings from MCA Stadium, Pune to Brabourne – CCI scheduled on April 20th, 2022, to avoid any further incident due to any undetected case during a long-distance bus journey in a closed environment,” said the BCCI in a statement. Delhi Capitals will only be cleared to play the game after RTPCR tests on Wednesday morning. All the other players and support staff have returned negative in tests conducted on Tuesday. “The COVID positive cases are under isolation and medical observation. They will be tested on Day 6 and 7 and subject to both the tests being negative they will be re-integrated into the Delhi Capitals bio-secure bubble. “From April 16th onwards, the entire Delhi Capitals contingent has been put under a daily RT-PCR testing procedure. The 4th round of RT-PCR tests conducted on April 19th have returned negative. “The Delhi Capitals contingent will undergo another round of RT-PCR testing on the morning of April 20th,” the BCCI added. Delhi Capitals’ opponents Punjab Kings were supposed to travel to Pune on Tuesday but were asked to stay back in Mumbai. “We were supposed to travel to Pune but we have been asked to stay back in Mumbai,” a Punjab team official told PTI. On Monday, the virus threatened to derail the IPL again after Marsh tested positive. He had undergone two RT-PCR tests with the first one coming negative but the subsequent test returned positive. This was after Marsh complained of sore throat and mild fever. It is understood that the Australian all-rounder showed some symptoms and a Rapid Antigen Test was performed which came positive. It could have been due to the fact that he was undergoing rehab under physio Farhart, who tested positive last week. The players are in quarantine since Monday. With COVID cases rising outside the IPL bio-bubble, the virus threat inside the controlled environment has also increased. Last season, the tournament had to be suspended midway due to the second wave. It was resumed and completed in the UAE in September-October.   Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-19 09:48:40","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"}]}