{"newsArray":[{"title":"Purple Cap in IPL 2023: Who has Picked Most Wickets in 16th Season of Indian Premier League?","link":"https://thesportsrush.com/cricket-news-purple-cap-in-ipl-2023-who-has-picked-most-wickets-in-16th-season-of-indian-premier-league/","keywords":["Cricket","IPL 2023","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"A primary reason behind Gujarat Titans‘ success in two consecutive seasons of the Indian Premier League is their bowling prowess. As cliched as it sounds, the notion of “bowlers win tournaments” has been proved factually correct more often than not irrespective of the format. Although not among the highest wicket-takers in what was a title… The post Purple Cap in IPL 2023: Who has Picked Most Wickets in 16th Season of Indian Premier League? appeared first on The SportsRush.","content":"A primary reason behind ‘ success in two consecutive seasons of the Indian Premier League is their bowling prowess. As cliched as it sounds, the notion of “bowlers win tournaments” has been proved factually correct more often than not irrespective of the format. Advertisement Although not among the highest wicket-takers in what was a title winning season for them, Gujarat fast bowler and vice-captain were their highest wicket-takers in IPL 2022. In the ongoing , the two currently top the list of highest wicket-takers on the back of picking 23 wickets each in the 13 matches that they’ve played till now. With IPL 2023 into its business end now, bowlers have managed to dominate batters on a regular basis especially due to the wear and tear of pitches across the country. Advertisement The most recent match of the season between Titans and registered a rare occasion of one bowler picking a five-wicket haul and two bowlers dismissing four batters each. While this happened at a Narendra Modi Stadium pitch where a batter even managed to score a century, pitches in cities such as Lucknow, Chennai, Delhi and Hyderabad have not remained conducive for stroke-making as the season has progressed. Set to be remembered for the respective comebacks of several veteran bowlers, IPL 2023 will also be known for spinners calling the shots on most occasions. Not a surprise by any means for a T20 competition being played in India, readers must note that four out of the Top Five bowlers with most wickets are spin bowlers. Furthermore, three of them are conventional right-arm leg-spinners. The balance, however, is maintained when the Top 10 wicket-takers are considered on the back of the presence of five pacers and spinners each at this point in time. Advertisement","pubDate":"2023-05-15 19:15:17","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"‘Why be divisive?’ Rugby wrestles with the Voice to parliament","link":"https://www.smh.com.au/sport/rugby-union/why-be-divisive-rugby-wrestles-with-the-voice-to-parliament-20230515-p5d8fx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Georgina Robinson"],"video_url":null,"description":"One of Australia’s most successful Super Rugby sides has weighed into the debate over the Indigenous Voice to parliament.","content":"Rugby Australia is facing pressure from within to take a neutral stance on the Indigenous Voice to Parliament, with at least one Super Rugby club urging the governing body not to mix sport and politics. Brumbies chairman Matthew Nobbs said the ACT Rugby board had taken the unanimous view that the club should not take a position on the matter and hoped RA would do the same. “It was agreed unanimously by our board that we don’t think politics should play a part in sport and it’s an individual’s preference,” Nobbs said. “There’s no way in the world that we would muzzle our players, they will be free to express themselves as they wish, but we do not believe it is the Brumbies’ role to support a position.” Rugby, along with cricket and netball, is one of the last major professional and participation sports not to have voiced its support for the yes campaign ahead of a referendum on the matter that will be held later this year. Despite reports earlier this year the governing bodies making up the Coalition of Major Professional and Participation Sports had given an undertaking to Prime Minister Anthony Albanese they would support the yes campaign, RA appears in no rush to go public with a stance. The Brumbies want to stay out of the debate on the Indigenous Voice to parliament. Credit: Getty The organisation has sent correspondence to its member unions asking them for feedback and sent the following statement to this masthead: “RA is committed to the reconciliation process. We are discussing the matter internally and remain in the process of engaging with our stakeholders, including our First Nations Committee.” A ring-around of the Super Rugby clubs on Monday found four of the five professional teams had not yet raised the issue with their playing groups, despite its prominence on the national agenda. Queensland Rugby could not be reached for comment. Further discussions with club officials and administrators, who did not want to comment publicly, indicated some supported making a statement in support of the Voice, while a minority - including the Brumbies - felt strongly about steering clear of the matter. The Rugby Union Players’ Association did not return this masthead’s calls. Nobbs said the Brumbies board had discussed the matter twice and was firm in its opinion, but emphasised that wanting to stay neutral as an organisation was not the same as supporting the no campaign. “We have an extremely strong association with Indigenous people. We run out in an Indigenous jumper once or twice a year, our training gear is closely aligned to indigenous themes and [winger] Andy Muirhead is a great role model for Indigenous players and the community,” he said. Another Super Rugby source said they were worried the issue would bring more division in the game. “Why does Rugby Australia have to be involved in politics? Why does any sport have to be,” they said. “People go and enjoy, consume and follow sport because it’s a break from the usual rigmarole. Why be divisive?” The news came after the NRL last week spoke out in support of the voice to parliament , joining Football Australia, Tennis Australia and the Australian Olympic Committee as either explicitly backing the yes campaign or reiterating their support for the Uluru statement from the heart, which calls for an Indigenous voice in the constitution. The AFL has not formally backed the yes campaign but is widely expected to, with each club encouraged to formulate their own position and report it back into head office. In a statement on Tuesday morning, the NRL said it was “committed to the Aboriginal and Torres Strait Islander Voice”. “True change comes through listening, learning and taking action – and we encourage everyone in the rugby league community to get informed by the facts, and use their voice, so that we can move forward together,” a spokesperson said. Watch all the action from the Super Rugby Pacific with every match streaming ad-free, live and on demand on Stan Sport .","pubDate":"2023-05-15 19:00:00","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPL 2023 CSK VS KKR: Nitish Rana fined for maintaining slow over-rate","link":"https://www.livemint.com/sports/cricket-news/ipl-2023-csk-vs-kkr-nitish-rana-fined-for-maintaining-slow-overrate-11684171417600.html","keywords":null,"creator":null,"video_url":null,"description":"Due to this Rana has been fined ₹24 lakh and the rest of the playing eleven including impact substitutes have been fined as well.","content":null,"pubDate":"2023-05-15 17:26:58","image_url":"https://www.livemint.com/lm-img/img/2023/05/15/1600x900/Nitish_Rana_1684171575760_1684171575920.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Here's why Gujarat Titans are wearing lavender kits for home game against Sunrisers Hyderabad","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-heres-why-gujarat-titans-are-wearing-lavender-kits-for-home-game-against-sunrisers-hyderabad-12600052.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Here's why Gujarat Titans are wearing lavender kits for home game against Sunrisers Hyderabad","content":"Gujarat Titans (GT) decided to ditch their navy blue kit for the IPL 2023 clash against Sunrisers Hyderabad (SRH) in Ahmedabad on Monday, opting to don lavender-coloured outfits instead. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ The defending champions and current table leaders decided to wear a different hue for their last home game of the season in support of the fight against cancer. Lavender is a colour that is associated with all types of cancer, and the Hardik Pandya-led franchise intends to raise awareness about the importance of early detection and prevention of the disease as well as lifestyle changes that can play a big role in combating cancer. Looking sharp in their lavender kits, the Gujarat Titans shows support for the fight against cancer! Show your support for this noble initiative with a💜 in the comments ✍🏻#GTvSRH | #AavaDe | #TATAIPL 2023 pic.twitter.com/v0nrH9mgZM — Gujarat Titans (@gujarat_titans) May 15, 2023 “It is a special initiative to support cancer patients. This is just our way of showing our support,” GT skipper Pandya said at toss ahead of the 62nd match of the season. The Sunrisers meanwhile, opted to field after skipper Aiden Markram won the toss, with both teams making multiple changes to their lineups. While the ‘Orange Army’ decided to bring Marco Jansen back into their XI in place of Glenn Phillips, Gujarat drafted Sai Sudharsan, Yash Dayal and Dasun Shanaka into the team, with Sri Lanka captain Shanaka making his IPL debut. A victory for Gujarat would confirm their place in the IPL 2023 playoffs and effectively knock Hyderabad out. A win for the ninth-placed SRH, though, would keep them mathematically alive though they would still rely on a host of other results going their way for them to finish in the top four. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 15:16:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Gujarat-Titans-lavender-kit-GT-SRH-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'We believe MS Dhoni is going to play next season as well,' says CSK CEO Kasi Viswanathan","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-we-believe-ms-dhoni-is-going-to-play-next-season-as-well-says-csk-ceo-kasi-viswanathan-12599602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'We believe MS Dhoni is going to play next season as well,' says CSK CEO Kasi Viswanathan","content":"While fans and experts widely believe the 2023 edition to be MS Dhoni’s last dance in the Indian Premier League (IPL), Chennai Super Kings (CSK) CEO Kasi Viswanathan expects the veteran wicketkeeper-batter to continue playing till at least next year. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ “We believe MS Dhoni is going to play next season as well,” Viswanathan said in a video shared by the four-time IPL champions on their social media channels after playing their final league match of the season at the MA Chidambaram Stadium, their home ground. “I hope fans will continue to support us like every time,” added the CSK CEO. A night of gratitude and infinite #Yellove #YellorukkumThanks #WhistlePodu 🦁💛 pic.twitter.com/1FTdgN7Z2c — Chennai Super Kings (@ChennaiIPL) May 14, 2023 Dhoni himself had dropped the occasional hint at this being his final run with CSK though he is yet to make a confirmatory statement on the same. “All said and done, it’s the last phase of my career, however long I play,” is what the 2011 World Cup-winning captain had said after his team’s victory over Sunrisers Hyderabad (SRH) at Chepauk on 21 April. Dhoni, similarly, made mention of the F-word after CSK’s away clash against Kolkata Knight Riders at the Eden Gardens on 23 April. “I will just say thanks for the support, they came in big numbers. Most of these guys will come in a KKR jersey next time. They are trying to give me a farewell, so thanks a lot to the crowd,” Dhoni said after the game. Dhoni and Co have received tremendous support away from home this season, with venues such as Mumbai’s Wankhede Stadium, Bengaluru’s M Chinnaswamy Stadium and Kolkata’s Eden Gardens bathed in yellow rather than blue, red and purple respectively, the colours of their respective home teams. The 2023 season was also the first time in four years that CSK were playing at their home ground of Chepauk. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 14:25:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/MS-Dhoni-CSK-MI-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC New Rules: WTC फाइनल से पहले आईसीसी ने बदले तीन नियम, फ्री हिट पर बल्लेबाजों को और होगा फायदा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/icc-3-new-rules-international-cricket-ahead-of-ind-vs-aus-wtc-final-test/articleshow/100256170.cms","keywords":null,"creator":null,"video_url":null,"description":"आईसीसी यानी इंटरनेशनल क्रिकेट काउंसिल ने अंतरराष्ट्रीय क्रिकेट के नियमों में 3 बड़े बदलाव किए हैं। इन तीन में से जो सबसे ज्यादा सुर्खियां बटोर रहा है, वो है सोफ्ट सिग्नल।","content":null,"pubDate":"2023-05-15 14:23:16","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ICC scraps 'unnecessary' soft signal ahead of WTC final","link":"https://thewest.com.au/sport/cricket/icc-scraps-unnecessary-soft-signal-ahead-of-wtc-final-c-10661674","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Soft signal consigned to history before Australia's World Test Championship tie with India as cricket authorities put onus on catches entirely on TV umpire.","content":null,"pubDate":"2023-05-15 14:18:39","image_url":"https://images.thewest.com.au/publication/C-10661674/ae1a0cbbeed97c0f53292b82e9438109055d44c3-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Don’t panic! Australia’s Lyon urges calm in face of ‘Bazball’","link":"https://www.fijitimes.com/dont-panic-australias-lyon-urges-calm-in-face-of-bazball/","keywords":["Other Sports","Sport","Bazball","Don't panic! Australia's Lyon urges calm in face of 'Bazball'","England Cricket"],"creator":["Reuters Reuters"],"video_url":null,"description":"SYDNEY (Reuters) – Australia off-spinner Nathan Lyon believes the ‘Bazball’ style of play only works if the opposition panics and has urged his team mates to remain calm in the face of England’s aggressive batting in the upcoming Ashes series. England have won 10 of their last 12 tests since captain Ben Stokes and coach […]","content":"FILE PHOTO: Cricket - Third Test - England v South Africa - The Oval, London, Britain - September 8, 2022 England head coach Brendon McCullum before the start of play Action Images via Reuters/Andrew Boyers SYDNEY (Reuters) – Australia off-spinner Nathan Lyon believes the ‘Bazball’ style of play only works if the opposition panics and has urged his team mates to remain calm in the face of England’s aggressive batting in the upcoming Ashes series. England have won 10 of their last 12 tests since captain Ben Stokes and coach Brendon ‘Baz’ McCullum took over and introduced the high-risk, high-reward style of play. “You look at the way they played against New Zealand, South Africa and Pakistan, they have been able to force the opposition into panicking,” Lyon told Australian Associated Press (AAP). “We just have to worry about us. Control what we can control and worry about what is in our backyard and not be worried about what they’re doing. “If we make sure we have really good plans and stick to them, everything will go okay.” The 35-year-old said Australia needed to focus on executing their own gameplan and avoid the kind of batting collapses that marred their tour of India earlier this year. “We shouldn’t panic anyway,” Lyon said. “We panicked in India and we saw what happened. If we can learn from that experience and play our way and our brand it will be okay.” Lyon said he was not interested in pre-series chatter about England arranging flatter pitches or shorter boundaries or changing their approach to counter Australia. “We have to worry about us,” he added. “We will be really well planned … I think we will be in really good shape. “We’re not buying into the fact they have to do it against Australian bowlers. We just keep nailing our process and worrying about us.” Lyon has played in the last six Ashes series, winning three and drawing one. Australia’s bid to retain the urn for the fourth straight series begins at Edgbaston on June 16.","pubDate":"2023-05-15 14:08:21","image_url":null,"source_id":"fijitimes","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Babar Azam’s Captaincy Journey Extends to World Cup 2023 Announced by PCB","link":"https://enews.hamariweb.com/sports/babar-azams-captaincy-journey-extends-to-world-cup-2023-announced-by-pcb/","keywords":["Cricket","Sports","Babar Azam","Cricket World Cup 2023","ICC Cricket World Cup 2023","PCB"],"creator":["Rida Shahid"],"video_url":null,"description":"The Pakistan Cricket Board (PCB) has made a significant decision by retaining Babar Azam as the captain of the national cricket team until the highly anticipated World Cup in 2023. The unanimous decision was reached by top officials including Najam Sethi, Haroon Rashid, and Mickey Arthur. Babar Azam will lead the team in all the […] The post Babar Azam’s Captaincy Journey Extends to World Cup 2023 Announced by PCB appeared first on Online English News - Latest Education, Business & Trending Enews.","content":"The Pakistan Cricket Board (PCB) has made a significant decision by retaining Babar Azam as the captain of the national cricket team until the highly anticipated World Cup in 2023. The unanimous decision was reached by top officials including Najam Sethi, Haroon Rashid, and Mickey Arthur. Babar Azam will lead the team in all the upcoming series preceding the World Cup, which will be hosted in India. This includes exciting test matches against Sri Lanka, the prestigious Asia Cup, and three thrilling ODIs against Afghanistan. Sources close to the matter strongly believe that there is no better candidate than Babar Azam to match his outstanding leadership skills and cricketing prowess. They have full faith in his ability to guide the team through challenging situations. Najam Sethi, Chairman of the management committee, recently expressed his confidence in Babar Azam, stating that there is no superior alternative for the captaincy. This statement strongly indicates the PCB’s commitment to retaining Babar Azam as the captain. The news has brought immense joy to cricket fans across the nation who eagerly anticipate Babar Azam’s continued captaincy and success in leading the team to the World Cup 2023.","pubDate":"2023-05-15 14:00:00","image_url":null,"source_id":"hamariweb","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Umpires no longer required to give 'soft signal' after ICC makes multiple tweaks to playing conditions","link":"https://www.firstpost.com/firstcricket/sports-news/umpires-no-longer-required-to-give-soft-signal-after-icc-makes-multiple-tweaks-to-playing-conditions-12599542.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Umpires no longer required to give 'soft signal' after ICC makes multiple tweaks to playing conditions","content":"The International Cricket Council (ICC) on Monday introduced several changes to their playing conditions, the most prominent of which was doing away with the on-field umpire’s soft signal during referrals. According to an official release from the ICC, the recommendations, which were proposed by the Men’s Cricket Committee led by former India captain Sourav Ganguly and endorsed by the Women’s Cricket Committee, were formally ratified by the Chief Executives Committee on Monday. The new rules state that umpires will no longer have to give a soft signal while referring decisions to the TV umpire. Umpires were, until now, required to give a soft signal when it came referring catches that were difficult to judge on field; the TV umpire would then rule in favour of the soft signal if replays weren’t conclusive enough. “Soft signals have been discussed at previous cricket committee meetings over the last couple of years. The committee deliberated this at length and concluded that soft signals were unnecessary and at times confusing since referrals of catches may seem inconclusive in replays,” Ganguly was quoted as saying in the release. Besides doing away with the soft signal rule, the ICC also made the use of helmets mandatory for batters facing fast bowlers and for wicketkeepers when standing close to the stumps — which also extended to other fielders standing close to the batter such as silly point and short leg. “We also discussed player safety, which is very important for us. The committee decided that it was best to make the use of helmets mandatory in certain positions to ensure the safety of players,” added Ganguly, who until recently had served as the Board of Control for Cricket in India (BCCI) president. The third change introduced in the rule had to do with runs scored off a Free Hit, wherein “any runs scored off a Free Hit when the ball hits the stumps will count as runs scored, to be consistent with all other runs scored from a free hit.” The release further stated that the changes would come into effect from 1 June on the opening day of the one-off Test between England and Ireland at Lord’s. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 13:17:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/05/ICC-1_opt.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Purple Cap in IPL 2023: Who has Picked Most Wickets in 16th Season of Indian Premier League?","link":"https://thesportsrush.com/cricket-news-purple-cap-in-ipl-2023-who-has-picked-most-wickets-in-16th-season-of-indian-premier-league/","keywords":["Cricket","IPL 2023","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"A primary reason behind Gujarat Titans‘ success in two consecutive seasons of the Indian Premier League is their bowling prowess. As cliched as it sounds, the notion of “bowlers win tournaments” has been proved factually correct more often than not irrespective of the format. Although not among the highest wicket-takers in what was a title… The post Purple Cap in IPL 2023: Who has Picked Most Wickets in 16th Season of Indian Premier League? appeared first on The SportsRush.","content":"A primary reason behind ‘ success in two consecutive seasons of the Indian Premier League is their bowling prowess. As cliched as it sounds, the notion of “bowlers win tournaments” has been proved factually correct more often than not irrespective of the format. Advertisement Although not among the highest wicket-takers in what was a title winning season for them, Gujarat fast bowler and vice-captain were their highest wicket-takers in IPL 2022. In the ongoing , the two currently top the list of highest wicket-takers on the back of picking 23 wickets each in the 13 matches that they’ve played till now. With IPL 2023 into its business end now, bowlers have managed to dominate batters on a regular basis especially due to the wear and tear of pitches across the country. Advertisement The most recent match of the season between Titans and registered a rare occasion of one bowler picking a five-wicket haul and two bowlers dismissing four batters each. While this happened at a Narendra Modi Stadium pitch where a batter even managed to score a century, pitches in cities such as Lucknow, Chennai, Delhi and Hyderabad have not remained conducive for stroke-making as the season has progressed. Set to be remembered for the respective comebacks of several veteran bowlers, IPL 2023 will also be known for spinners calling the shots on most occasions. Not a surprise by any means for a T20 competition being played in India, readers must note that four out of the Top Five bowlers with most wickets are spin bowlers. Furthermore, three of them are conventional right-arm leg-spinners. The balance, however, is maintained when the Top 10 wicket-takers are considered on the back of the presence of five pacers and spinners each at this point in time. Advertisement","pubDate":"2023-05-15 19:15:17","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"‘Why be divisive?’ Rugby wrestles with the Voice to parliament","link":"https://www.smh.com.au/sport/rugby-union/why-be-divisive-rugby-wrestles-with-the-voice-to-parliament-20230515-p5d8fx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Georgina Robinson"],"video_url":null,"description":"One of Australia’s most successful Super Rugby sides has weighed into the debate over the Indigenous Voice to parliament.","content":"Rugby Australia is facing pressure from within to take a neutral stance on the Indigenous Voice to Parliament, with at least one Super Rugby club urging the governing body not to mix sport and politics. Brumbies chairman Matthew Nobbs said the ACT Rugby board had taken the unanimous view that the club should not take a position on the matter and hoped RA would do the same. “It was agreed unanimously by our board that we don’t think politics should play a part in sport and it’s an individual’s preference,” Nobbs said. “There’s no way in the world that we would muzzle our players, they will be free to express themselves as they wish, but we do not believe it is the Brumbies’ role to support a position.” Rugby, along with cricket and netball, is one of the last major professional and participation sports not to have voiced its support for the yes campaign ahead of a referendum on the matter that will be held later this year. Despite reports earlier this year the governing bodies making up the Coalition of Major Professional and Participation Sports had given an undertaking to Prime Minister Anthony Albanese they would support the yes campaign, RA appears in no rush to go public with a stance. The Brumbies want to stay out of the debate on the Indigenous Voice to parliament. Credit: Getty The organisation has sent correspondence to its member unions asking them for feedback and sent the following statement to this masthead: “RA is committed to the reconciliation process. We are discussing the matter internally and remain in the process of engaging with our stakeholders, including our First Nations Committee.” A ring-around of the Super Rugby clubs on Monday found four of the five professional teams had not yet raised the issue with their playing groups, despite its prominence on the national agenda. Queensland Rugby could not be reached for comment. Further discussions with club officials and administrators, who did not want to comment publicly, indicated some supported making a statement in support of the Voice, while a minority - including the Brumbies - felt strongly about steering clear of the matter. The Rugby Union Players’ Association did not return this masthead’s calls. Nobbs said the Brumbies board had discussed the matter twice and was firm in its opinion, but emphasised that wanting to stay neutral as an organisation was not the same as supporting the no campaign. “We have an extremely strong association with Indigenous people. We run out in an Indigenous jumper once or twice a year, our training gear is closely aligned to indigenous themes and [winger] Andy Muirhead is a great role model for Indigenous players and the community,” he said. Another Super Rugby source said they were worried the issue would bring more division in the game. “Why does Rugby Australia have to be involved in politics? Why does any sport have to be,” they said. “People go and enjoy, consume and follow sport because it’s a break from the usual rigmarole. Why be divisive?” The news came after the NRL last week spoke out in support of the voice to parliament , joining Football Australia, Tennis Australia and the Australian Olympic Committee as either explicitly backing the yes campaign or reiterating their support for the Uluru statement from the heart, which calls for an Indigenous voice in the constitution. The AFL has not formally backed the yes campaign but is widely expected to, with each club encouraged to formulate their own position and report it back into head office. In a statement on Tuesday morning, the NRL said it was “committed to the Aboriginal and Torres Strait Islander Voice”. “True change comes through listening, learning and taking action – and we encourage everyone in the rugby league community to get informed by the facts, and use their voice, so that we can move forward together,” a spokesperson said. Watch all the action from the Super Rugby Pacific with every match streaming ad-free, live and on demand on Stan Sport .","pubDate":"2023-05-15 19:00:00","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPL 2023 CSK VS KKR: Nitish Rana fined for maintaining slow over-rate","link":"https://www.livemint.com/sports/cricket-news/ipl-2023-csk-vs-kkr-nitish-rana-fined-for-maintaining-slow-overrate-11684171417600.html","keywords":null,"creator":null,"video_url":null,"description":"Due to this Rana has been fined ₹24 lakh and the rest of the playing eleven including impact substitutes have been fined as well.","content":null,"pubDate":"2023-05-15 17:26:58","image_url":"https://www.livemint.com/lm-img/img/2023/05/15/1600x900/Nitish_Rana_1684171575760_1684171575920.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Here's why Gujarat Titans are wearing lavender kits for home game against Sunrisers Hyderabad","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-heres-why-gujarat-titans-are-wearing-lavender-kits-for-home-game-against-sunrisers-hyderabad-12600052.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Here's why Gujarat Titans are wearing lavender kits for home game against Sunrisers Hyderabad","content":"Gujarat Titans (GT) decided to ditch their navy blue kit for the IPL 2023 clash against Sunrisers Hyderabad (SRH) in Ahmedabad on Monday, opting to don lavender-coloured outfits instead. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ The defending champions and current table leaders decided to wear a different hue for their last home game of the season in support of the fight against cancer. Lavender is a colour that is associated with all types of cancer, and the Hardik Pandya-led franchise intends to raise awareness about the importance of early detection and prevention of the disease as well as lifestyle changes that can play a big role in combating cancer. Looking sharp in their lavender kits, the Gujarat Titans shows support for the fight against cancer! Show your support for this noble initiative with a💜 in the comments ✍🏻#GTvSRH | #AavaDe | #TATAIPL 2023 pic.twitter.com/v0nrH9mgZM — Gujarat Titans (@gujarat_titans) May 15, 2023 “It is a special initiative to support cancer patients. This is just our way of showing our support,” GT skipper Pandya said at toss ahead of the 62nd match of the season. The Sunrisers meanwhile, opted to field after skipper Aiden Markram won the toss, with both teams making multiple changes to their lineups. While the ‘Orange Army’ decided to bring Marco Jansen back into their XI in place of Glenn Phillips, Gujarat drafted Sai Sudharsan, Yash Dayal and Dasun Shanaka into the team, with Sri Lanka captain Shanaka making his IPL debut. A victory for Gujarat would confirm their place in the IPL 2023 playoffs and effectively knock Hyderabad out. A win for the ninth-placed SRH, though, would keep them mathematically alive though they would still rely on a host of other results going their way for them to finish in the top four. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 15:16:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Gujarat-Titans-lavender-kit-GT-SRH-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'We believe MS Dhoni is going to play next season as well,' says CSK CEO Kasi Viswanathan","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-we-believe-ms-dhoni-is-going-to-play-next-season-as-well-says-csk-ceo-kasi-viswanathan-12599602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'We believe MS Dhoni is going to play next season as well,' says CSK CEO Kasi Viswanathan","content":"While fans and experts widely believe the 2023 edition to be MS Dhoni’s last dance in the Indian Premier League (IPL), Chennai Super Kings (CSK) CEO Kasi Viswanathan expects the veteran wicketkeeper-batter to continue playing till at least next year. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ “We believe MS Dhoni is going to play next season as well,” Viswanathan said in a video shared by the four-time IPL champions on their social media channels after playing their final league match of the season at the MA Chidambaram Stadium, their home ground. “I hope fans will continue to support us like every time,” added the CSK CEO. A night of gratitude and infinite #Yellove #YellorukkumThanks #WhistlePodu 🦁💛 pic.twitter.com/1FTdgN7Z2c — Chennai Super Kings (@ChennaiIPL) May 14, 2023 Dhoni himself had dropped the occasional hint at this being his final run with CSK though he is yet to make a confirmatory statement on the same. “All said and done, it’s the last phase of my career, however long I play,” is what the 2011 World Cup-winning captain had said after his team’s victory over Sunrisers Hyderabad (SRH) at Chepauk on 21 April. Dhoni, similarly, made mention of the F-word after CSK’s away clash against Kolkata Knight Riders at the Eden Gardens on 23 April. “I will just say thanks for the support, they came in big numbers. Most of these guys will come in a KKR jersey next time. They are trying to give me a farewell, so thanks a lot to the crowd,” Dhoni said after the game. Dhoni and Co have received tremendous support away from home this season, with venues such as Mumbai’s Wankhede Stadium, Bengaluru’s M Chinnaswamy Stadium and Kolkata’s Eden Gardens bathed in yellow rather than blue, red and purple respectively, the colours of their respective home teams. The 2023 season was also the first time in four years that CSK were playing at their home ground of Chepauk. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 14:25:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/MS-Dhoni-CSK-MI-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC New Rules: WTC फाइनल से पहले आईसीसी ने बदले तीन नियम, फ्री हिट पर बल्लेबाजों को और होगा फायदा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/icc-3-new-rules-international-cricket-ahead-of-ind-vs-aus-wtc-final-test/articleshow/100256170.cms","keywords":null,"creator":null,"video_url":null,"description":"आईसीसी यानी इंटरनेशनल क्रिकेट काउंसिल ने अंतरराष्ट्रीय क्रिकेट के नियमों में 3 बड़े बदलाव किए हैं। इन तीन में से जो सबसे ज्यादा सुर्खियां बटोर रहा है, वो है सोफ्ट सिग्नल।","content":null,"pubDate":"2023-05-15 14:23:16","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ICC scraps 'unnecessary' soft signal ahead of WTC final","link":"https://thewest.com.au/sport/cricket/icc-scraps-unnecessary-soft-signal-ahead-of-wtc-final-c-10661674","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Soft signal consigned to history before Australia's World Test Championship tie with India as cricket authorities put onus on catches entirely on TV umpire.","content":null,"pubDate":"2023-05-15 14:18:39","image_url":"https://images.thewest.com.au/publication/C-10661674/ae1a0cbbeed97c0f53292b82e9438109055d44c3-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Don’t panic! Australia’s Lyon urges calm in face of ‘Bazball’","link":"https://www.fijitimes.com/dont-panic-australias-lyon-urges-calm-in-face-of-bazball/","keywords":["Other Sports","Sport","Bazball","Don't panic! Australia's Lyon urges calm in face of 'Bazball'","England Cricket"],"creator":["Reuters Reuters"],"video_url":null,"description":"SYDNEY (Reuters) – Australia off-spinner Nathan Lyon believes the ‘Bazball’ style of play only works if the opposition panics and has urged his team mates to remain calm in the face of England’s aggressive batting in the upcoming Ashes series. England have won 10 of their last 12 tests since captain Ben Stokes and coach […]","content":"FILE PHOTO: Cricket - Third Test - England v South Africa - The Oval, London, Britain - September 8, 2022 England head coach Brendon McCullum before the start of play Action Images via Reuters/Andrew Boyers SYDNEY (Reuters) – Australia off-spinner Nathan Lyon believes the ‘Bazball’ style of play only works if the opposition panics and has urged his team mates to remain calm in the face of England’s aggressive batting in the upcoming Ashes series. England have won 10 of their last 12 tests since captain Ben Stokes and coach Brendon ‘Baz’ McCullum took over and introduced the high-risk, high-reward style of play. “You look at the way they played against New Zealand, South Africa and Pakistan, they have been able to force the opposition into panicking,” Lyon told Australian Associated Press (AAP). “We just have to worry about us. Control what we can control and worry about what is in our backyard and not be worried about what they’re doing. “If we make sure we have really good plans and stick to them, everything will go okay.” The 35-year-old said Australia needed to focus on executing their own gameplan and avoid the kind of batting collapses that marred their tour of India earlier this year. “We shouldn’t panic anyway,” Lyon said. “We panicked in India and we saw what happened. If we can learn from that experience and play our way and our brand it will be okay.” Lyon said he was not interested in pre-series chatter about England arranging flatter pitches or shorter boundaries or changing their approach to counter Australia. “We have to worry about us,” he added. “We will be really well planned … I think we will be in really good shape. “We’re not buying into the fact they have to do it against Australian bowlers. We just keep nailing our process and worrying about us.” Lyon has played in the last six Ashes series, winning three and drawing one. Australia’s bid to retain the urn for the fourth straight series begins at Edgbaston on June 16.","pubDate":"2023-05-15 14:08:21","image_url":null,"source_id":"fijitimes","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Babar Azam’s Captaincy Journey Extends to World Cup 2023 Announced by PCB","link":"https://enews.hamariweb.com/sports/babar-azams-captaincy-journey-extends-to-world-cup-2023-announced-by-pcb/","keywords":["Cricket","Sports","Babar Azam","Cricket World Cup 2023","ICC Cricket World Cup 2023","PCB"],"creator":["Rida Shahid"],"video_url":null,"description":"The Pakistan Cricket Board (PCB) has made a significant decision by retaining Babar Azam as the captain of the national cricket team until the highly anticipated World Cup in 2023. The unanimous decision was reached by top officials including Najam Sethi, Haroon Rashid, and Mickey Arthur. Babar Azam will lead the team in all the […] The post Babar Azam’s Captaincy Journey Extends to World Cup 2023 Announced by PCB appeared first on Online English News - Latest Education, Business & Trending Enews.","content":"The Pakistan Cricket Board (PCB) has made a significant decision by retaining Babar Azam as the captain of the national cricket team until the highly anticipated World Cup in 2023. The unanimous decision was reached by top officials including Najam Sethi, Haroon Rashid, and Mickey Arthur. Babar Azam will lead the team in all the upcoming series preceding the World Cup, which will be hosted in India. This includes exciting test matches against Sri Lanka, the prestigious Asia Cup, and three thrilling ODIs against Afghanistan. Sources close to the matter strongly believe that there is no better candidate than Babar Azam to match his outstanding leadership skills and cricketing prowess. They have full faith in his ability to guide the team through challenging situations. Najam Sethi, Chairman of the management committee, recently expressed his confidence in Babar Azam, stating that there is no superior alternative for the captaincy. This statement strongly indicates the PCB’s commitment to retaining Babar Azam as the captain. The news has brought immense joy to cricket fans across the nation who eagerly anticipate Babar Azam’s continued captaincy and success in leading the team to the World Cup 2023.","pubDate":"2023-05-15 14:00:00","image_url":null,"source_id":"hamariweb","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Umpires no longer required to give 'soft signal' after ICC makes multiple tweaks to playing conditions","link":"https://www.firstpost.com/firstcricket/sports-news/umpires-no-longer-required-to-give-soft-signal-after-icc-makes-multiple-tweaks-to-playing-conditions-12599542.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Umpires no longer required to give 'soft signal' after ICC makes multiple tweaks to playing conditions","content":"The International Cricket Council (ICC) on Monday introduced several changes to their playing conditions, the most prominent of which was doing away with the on-field umpire’s soft signal during referrals. According to an official release from the ICC, the recommendations, which were proposed by the Men’s Cricket Committee led by former India captain Sourav Ganguly and endorsed by the Women’s Cricket Committee, were formally ratified by the Chief Executives Committee on Monday. The new rules state that umpires will no longer have to give a soft signal while referring decisions to the TV umpire. Umpires were, until now, required to give a soft signal when it came referring catches that were difficult to judge on field; the TV umpire would then rule in favour of the soft signal if replays weren’t conclusive enough. “Soft signals have been discussed at previous cricket committee meetings over the last couple of years. The committee deliberated this at length and concluded that soft signals were unnecessary and at times confusing since referrals of catches may seem inconclusive in replays,” Ganguly was quoted as saying in the release. Besides doing away with the soft signal rule, the ICC also made the use of helmets mandatory for batters facing fast bowlers and for wicketkeepers when standing close to the stumps — which also extended to other fielders standing close to the batter such as silly point and short leg. “We also discussed player safety, which is very important for us. The committee decided that it was best to make the use of helmets mandatory in certain positions to ensure the safety of players,” added Ganguly, who until recently had served as the Board of Control for Cricket in India (BCCI) president. The third change introduced in the rule had to do with runs scored off a Free Hit, wherein “any runs scored off a Free Hit when the ball hits the stumps will count as runs scored, to be consistent with all other runs scored from a free hit.” The release further stated that the changes would come into effect from 1 June on the opening day of the one-off Test between England and Ireland at Lord’s. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 13:17:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/05/ICC-1_opt.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Purple Cap in IPL 2023: Who has Picked Most Wickets in 16th Season of Indian Premier League?","link":"https://thesportsrush.com/cricket-news-purple-cap-in-ipl-2023-who-has-picked-most-wickets-in-16th-season-of-indian-premier-league/","keywords":["Cricket","IPL 2023","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"A primary reason behind Gujarat Titans‘ success in two consecutive seasons of the Indian Premier League is their bowling prowess. As cliched as it sounds, the notion of “bowlers win tournaments” has been proved factually correct more often than not irrespective of the format. Although not among the highest wicket-takers in what was a title… The post Purple Cap in IPL 2023: Who has Picked Most Wickets in 16th Season of Indian Premier League? appeared first on The SportsRush.","content":"A primary reason behind ‘ success in two consecutive seasons of the Indian Premier League is their bowling prowess. As cliched as it sounds, the notion of “bowlers win tournaments” has been proved factually correct more often than not irrespective of the format. Advertisement Although not among the highest wicket-takers in what was a title winning season for them, Gujarat fast bowler and vice-captain were their highest wicket-takers in IPL 2022. In the ongoing , the two currently top the list of highest wicket-takers on the back of picking 23 wickets each in the 13 matches that they’ve played till now. With IPL 2023 into its business end now, bowlers have managed to dominate batters on a regular basis especially due to the wear and tear of pitches across the country. Advertisement The most recent match of the season between Titans and registered a rare occasion of one bowler picking a five-wicket haul and two bowlers dismissing four batters each. While this happened at a Narendra Modi Stadium pitch where a batter even managed to score a century, pitches in cities such as Lucknow, Chennai, Delhi and Hyderabad have not remained conducive for stroke-making as the season has progressed. Set to be remembered for the respective comebacks of several veteran bowlers, IPL 2023 will also be known for spinners calling the shots on most occasions. Not a surprise by any means for a T20 competition being played in India, readers must note that four out of the Top Five bowlers with most wickets are spin bowlers. Furthermore, three of them are conventional right-arm leg-spinners. The balance, however, is maintained when the Top 10 wicket-takers are considered on the back of the presence of five pacers and spinners each at this point in time. Advertisement","pubDate":"2023-05-15 19:15:17","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"‘Why be divisive?’ Rugby wrestles with the Voice to parliament","link":"https://www.smh.com.au/sport/rugby-union/why-be-divisive-rugby-wrestles-with-the-voice-to-parliament-20230515-p5d8fx.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Georgina Robinson"],"video_url":null,"description":"One of Australia’s most successful Super Rugby sides has weighed into the debate over the Indigenous Voice to parliament.","content":"Rugby Australia is facing pressure from within to take a neutral stance on the Indigenous Voice to Parliament, with at least one Super Rugby club urging the governing body not to mix sport and politics. Brumbies chairman Matthew Nobbs said the ACT Rugby board had taken the unanimous view that the club should not take a position on the matter and hoped RA would do the same. “It was agreed unanimously by our board that we don’t think politics should play a part in sport and it’s an individual’s preference,” Nobbs said. “There’s no way in the world that we would muzzle our players, they will be free to express themselves as they wish, but we do not believe it is the Brumbies’ role to support a position.” Rugby, along with cricket and netball, is one of the last major professional and participation sports not to have voiced its support for the yes campaign ahead of a referendum on the matter that will be held later this year. Despite reports earlier this year the governing bodies making up the Coalition of Major Professional and Participation Sports had given an undertaking to Prime Minister Anthony Albanese they would support the yes campaign, RA appears in no rush to go public with a stance. The Brumbies want to stay out of the debate on the Indigenous Voice to parliament. Credit: Getty The organisation has sent correspondence to its member unions asking them for feedback and sent the following statement to this masthead: “RA is committed to the reconciliation process. We are discussing the matter internally and remain in the process of engaging with our stakeholders, including our First Nations Committee.” A ring-around of the Super Rugby clubs on Monday found four of the five professional teams had not yet raised the issue with their playing groups, despite its prominence on the national agenda. Queensland Rugby could not be reached for comment. Further discussions with club officials and administrators, who did not want to comment publicly, indicated some supported making a statement in support of the Voice, while a minority - including the Brumbies - felt strongly about steering clear of the matter. The Rugby Union Players’ Association did not return this masthead’s calls. Nobbs said the Brumbies board had discussed the matter twice and was firm in its opinion, but emphasised that wanting to stay neutral as an organisation was not the same as supporting the no campaign. “We have an extremely strong association with Indigenous people. We run out in an Indigenous jumper once or twice a year, our training gear is closely aligned to indigenous themes and [winger] Andy Muirhead is a great role model for Indigenous players and the community,” he said. Another Super Rugby source said they were worried the issue would bring more division in the game. “Why does Rugby Australia have to be involved in politics? Why does any sport have to be,” they said. “People go and enjoy, consume and follow sport because it’s a break from the usual rigmarole. Why be divisive?” The news came after the NRL last week spoke out in support of the voice to parliament , joining Football Australia, Tennis Australia and the Australian Olympic Committee as either explicitly backing the yes campaign or reiterating their support for the Uluru statement from the heart, which calls for an Indigenous voice in the constitution. The AFL has not formally backed the yes campaign but is widely expected to, with each club encouraged to formulate their own position and report it back into head office. In a statement on Tuesday morning, the NRL said it was “committed to the Aboriginal and Torres Strait Islander Voice”. “True change comes through listening, learning and taking action – and we encourage everyone in the rugby league community to get informed by the facts, and use their voice, so that we can move forward together,” a spokesperson said. Watch all the action from the Super Rugby Pacific with every match streaming ad-free, live and on demand on Stan Sport .","pubDate":"2023-05-15 19:00:00","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPL 2023 CSK VS KKR: Nitish Rana fined for maintaining slow over-rate","link":"https://www.livemint.com/sports/cricket-news/ipl-2023-csk-vs-kkr-nitish-rana-fined-for-maintaining-slow-overrate-11684171417600.html","keywords":null,"creator":null,"video_url":null,"description":"Due to this Rana has been fined ₹24 lakh and the rest of the playing eleven including impact substitutes have been fined as well.","content":null,"pubDate":"2023-05-15 17:26:58","image_url":"https://www.livemint.com/lm-img/img/2023/05/15/1600x900/Nitish_Rana_1684171575760_1684171575920.jpg","source_id":"livemint","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Here's why Gujarat Titans are wearing lavender kits for home game against Sunrisers Hyderabad","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-heres-why-gujarat-titans-are-wearing-lavender-kits-for-home-game-against-sunrisers-hyderabad-12600052.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Here's why Gujarat Titans are wearing lavender kits for home game against Sunrisers Hyderabad","content":"Gujarat Titans (GT) decided to ditch their navy blue kit for the IPL 2023 clash against Sunrisers Hyderabad (SRH) in Ahmedabad on Monday, opting to don lavender-coloured outfits instead. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ The defending champions and current table leaders decided to wear a different hue for their last home game of the season in support of the fight against cancer. Lavender is a colour that is associated with all types of cancer, and the Hardik Pandya-led franchise intends to raise awareness about the importance of early detection and prevention of the disease as well as lifestyle changes that can play a big role in combating cancer. Looking sharp in their lavender kits, the Gujarat Titans shows support for the fight against cancer! Show your support for this noble initiative with a💜 in the comments ✍🏻#GTvSRH | #AavaDe | #TATAIPL 2023 pic.twitter.com/v0nrH9mgZM — Gujarat Titans (@gujarat_titans) May 15, 2023 “It is a special initiative to support cancer patients. This is just our way of showing our support,” GT skipper Pandya said at toss ahead of the 62nd match of the season. The Sunrisers meanwhile, opted to field after skipper Aiden Markram won the toss, with both teams making multiple changes to their lineups. While the ‘Orange Army’ decided to bring Marco Jansen back into their XI in place of Glenn Phillips, Gujarat drafted Sai Sudharsan, Yash Dayal and Dasun Shanaka into the team, with Sri Lanka captain Shanaka making his IPL debut. A victory for Gujarat would confirm their place in the IPL 2023 playoffs and effectively knock Hyderabad out. A win for the ninth-placed SRH, though, would keep them mathematically alive though they would still rely on a host of other results going their way for them to finish in the top four. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 15:16:02","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Gujarat-Titans-lavender-kit-GT-SRH-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: 'We believe MS Dhoni is going to play next season as well,' says CSK CEO Kasi Viswanathan","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-we-believe-ms-dhoni-is-going-to-play-next-season-as-well-says-csk-ceo-kasi-viswanathan-12599602.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: 'We believe MS Dhoni is going to play next season as well,' says CSK CEO Kasi Viswanathan","content":"While fans and experts widely believe the 2023 edition to be MS Dhoni’s last dance in the Indian Premier League (IPL), Chennai Super Kings (CSK) CEO Kasi Viswanathan expects the veteran wicketkeeper-batter to continue playing till at least next year. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ “We believe MS Dhoni is going to play next season as well,” Viswanathan said in a video shared by the four-time IPL champions on their social media channels after playing their final league match of the season at the MA Chidambaram Stadium, their home ground. “I hope fans will continue to support us like every time,” added the CSK CEO. A night of gratitude and infinite #Yellove #YellorukkumThanks #WhistlePodu 🦁💛 pic.twitter.com/1FTdgN7Z2c — Chennai Super Kings (@ChennaiIPL) May 14, 2023 Dhoni himself had dropped the occasional hint at this being his final run with CSK though he is yet to make a confirmatory statement on the same. “All said and done, it’s the last phase of my career, however long I play,” is what the 2011 World Cup-winning captain had said after his team’s victory over Sunrisers Hyderabad (SRH) at Chepauk on 21 April. Dhoni, similarly, made mention of the F-word after CSK’s away clash against Kolkata Knight Riders at the Eden Gardens on 23 April. “I will just say thanks for the support, they came in big numbers. Most of these guys will come in a KKR jersey next time. They are trying to give me a farewell, so thanks a lot to the crowd,” Dhoni said after the game. Dhoni and Co have received tremendous support away from home this season, with venues such as Mumbai’s Wankhede Stadium, Bengaluru’s M Chinnaswamy Stadium and Kolkata’s Eden Gardens bathed in yellow rather than blue, red and purple respectively, the colours of their respective home teams. The 2023 season was also the first time in four years that CSK were playing at their home ground of Chepauk. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 14:25:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/MS-Dhoni-CSK-MI-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC New Rules: WTC फाइनल से पहले आईसीसी ने बदले तीन नियम, फ्री हिट पर बल्लेबाजों को और होगा फायदा","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/icc-3-new-rules-international-cricket-ahead-of-ind-vs-aus-wtc-final-test/articleshow/100256170.cms","keywords":null,"creator":null,"video_url":null,"description":"आईसीसी यानी इंटरनेशनल क्रिकेट काउंसिल ने अंतरराष्ट्रीय क्रिकेट के नियमों में 3 बड़े बदलाव किए हैं। इन तीन में से जो सबसे ज्यादा सुर्खियां बटोर रहा है, वो है सोफ्ट सिग्नल।","content":null,"pubDate":"2023-05-15 14:23:16","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"ICC scraps 'unnecessary' soft signal ahead of WTC final","link":"https://thewest.com.au/sport/cricket/icc-scraps-unnecessary-soft-signal-ahead-of-wtc-final-c-10661674","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Soft signal consigned to history before Australia's World Test Championship tie with India as cricket authorities put onus on catches entirely on TV umpire.","content":null,"pubDate":"2023-05-15 14:18:39","image_url":"https://images.thewest.com.au/publication/C-10661674/ae1a0cbbeed97c0f53292b82e9438109055d44c3-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Don’t panic! Australia’s Lyon urges calm in face of ‘Bazball’","link":"https://www.fijitimes.com/dont-panic-australias-lyon-urges-calm-in-face-of-bazball/","keywords":["Other Sports","Sport","Bazball","Don't panic! Australia's Lyon urges calm in face of 'Bazball'","England Cricket"],"creator":["Reuters Reuters"],"video_url":null,"description":"SYDNEY (Reuters) – Australia off-spinner Nathan Lyon believes the ‘Bazball’ style of play only works if the opposition panics and has urged his team mates to remain calm in the face of England’s aggressive batting in the upcoming Ashes series. England have won 10 of their last 12 tests since captain Ben Stokes and coach […]","content":"FILE PHOTO: Cricket - Third Test - England v South Africa - The Oval, London, Britain - September 8, 2022 England head coach Brendon McCullum before the start of play Action Images via Reuters/Andrew Boyers SYDNEY (Reuters) – Australia off-spinner Nathan Lyon believes the ‘Bazball’ style of play only works if the opposition panics and has urged his team mates to remain calm in the face of England’s aggressive batting in the upcoming Ashes series. England have won 10 of their last 12 tests since captain Ben Stokes and coach Brendon ‘Baz’ McCullum took over and introduced the high-risk, high-reward style of play. “You look at the way they played against New Zealand, South Africa and Pakistan, they have been able to force the opposition into panicking,” Lyon told Australian Associated Press (AAP). “We just have to worry about us. Control what we can control and worry about what is in our backyard and not be worried about what they’re doing. “If we make sure we have really good plans and stick to them, everything will go okay.” The 35-year-old said Australia needed to focus on executing their own gameplan and avoid the kind of batting collapses that marred their tour of India earlier this year. “We shouldn’t panic anyway,” Lyon said. “We panicked in India and we saw what happened. If we can learn from that experience and play our way and our brand it will be okay.” Lyon said he was not interested in pre-series chatter about England arranging flatter pitches or shorter boundaries or changing their approach to counter Australia. “We have to worry about us,” he added. “We will be really well planned … I think we will be in really good shape. “We’re not buying into the fact they have to do it against Australian bowlers. We just keep nailing our process and worrying about us.” Lyon has played in the last six Ashes series, winning three and drawing one. Australia’s bid to retain the urn for the fourth straight series begins at Edgbaston on June 16.","pubDate":"2023-05-15 14:08:21","image_url":null,"source_id":"fijitimes","category":["sports"],"country":["Fiji"],"language":"english"},{"title":"Babar Azam’s Captaincy Journey Extends to World Cup 2023 Announced by PCB","link":"https://enews.hamariweb.com/sports/babar-azams-captaincy-journey-extends-to-world-cup-2023-announced-by-pcb/","keywords":["Cricket","Sports","Babar Azam","Cricket World Cup 2023","ICC Cricket World Cup 2023","PCB"],"creator":["Rida Shahid"],"video_url":null,"description":"The Pakistan Cricket Board (PCB) has made a significant decision by retaining Babar Azam as the captain of the national cricket team until the highly anticipated World Cup in 2023. The unanimous decision was reached by top officials including Najam Sethi, Haroon Rashid, and Mickey Arthur. Babar Azam will lead the team in all the […] The post Babar Azam’s Captaincy Journey Extends to World Cup 2023 Announced by PCB appeared first on Online English News - Latest Education, Business & Trending Enews.","content":"The Pakistan Cricket Board (PCB) has made a significant decision by retaining Babar Azam as the captain of the national cricket team until the highly anticipated World Cup in 2023. The unanimous decision was reached by top officials including Najam Sethi, Haroon Rashid, and Mickey Arthur. Babar Azam will lead the team in all the upcoming series preceding the World Cup, which will be hosted in India. This includes exciting test matches against Sri Lanka, the prestigious Asia Cup, and three thrilling ODIs against Afghanistan. Sources close to the matter strongly believe that there is no better candidate than Babar Azam to match his outstanding leadership skills and cricketing prowess. They have full faith in his ability to guide the team through challenging situations. Najam Sethi, Chairman of the management committee, recently expressed his confidence in Babar Azam, stating that there is no superior alternative for the captaincy. This statement strongly indicates the PCB’s commitment to retaining Babar Azam as the captain. The news has brought immense joy to cricket fans across the nation who eagerly anticipate Babar Azam’s continued captaincy and success in leading the team to the World Cup 2023.","pubDate":"2023-05-15 14:00:00","image_url":null,"source_id":"hamariweb","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Umpires no longer required to give 'soft signal' after ICC makes multiple tweaks to playing conditions","link":"https://www.firstpost.com/firstcricket/sports-news/umpires-no-longer-required-to-give-soft-signal-after-icc-makes-multiple-tweaks-to-playing-conditions-12599542.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Umpires no longer required to give 'soft signal' after ICC makes multiple tweaks to playing conditions","content":"The International Cricket Council (ICC) on Monday introduced several changes to their playing conditions, the most prominent of which was doing away with the on-field umpire’s soft signal during referrals. According to an official release from the ICC, the recommendations, which were proposed by the Men’s Cricket Committee led by former India captain Sourav Ganguly and endorsed by the Women’s Cricket Committee, were formally ratified by the Chief Executives Committee on Monday. The new rules state that umpires will no longer have to give a soft signal while referring decisions to the TV umpire. Umpires were, until now, required to give a soft signal when it came referring catches that were difficult to judge on field; the TV umpire would then rule in favour of the soft signal if replays weren’t conclusive enough. “Soft signals have been discussed at previous cricket committee meetings over the last couple of years. The committee deliberated this at length and concluded that soft signals were unnecessary and at times confusing since referrals of catches may seem inconclusive in replays,” Ganguly was quoted as saying in the release. Besides doing away with the soft signal rule, the ICC also made the use of helmets mandatory for batters facing fast bowlers and for wicketkeepers when standing close to the stumps — which also extended to other fielders standing close to the batter such as silly point and short leg. “We also discussed player safety, which is very important for us. The committee decided that it was best to make the use of helmets mandatory in certain positions to ensure the safety of players,” added Ganguly, who until recently had served as the Board of Control for Cricket in India (BCCI) president. The third change introduced in the rule had to do with runs scored off a Free Hit, wherein “any runs scored off a Free Hit when the ball hits the stumps will count as runs scored, to be consistent with all other runs scored from a free hit.” The release further stated that the changes would come into effect from 1 June on the opening day of the one-off Test between England and Ireland at Lord’s. Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-15 13:17:25","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2020/05/ICC-1_opt.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"}]}