{"newsArray":[{"title":"News24.com | WATCH | Klaasen writes himself into the early annals of SA20 with absurdly dominant century","link":"https://www.news24.com/sport/Cricket/SA20/watch-klaasen-writes-himself-into-the-early-annals-of-sa20-with-absurdly-dominant-century-20230205","keywords":null,"creator":null,"video_url":null,"description":"Heinrich Klaasen's unbeaten 104 off just 44 deliveries in Durban Super Giants' 151-run thumping of Pretoria Capitals was so masterfully crafted that it bordered on absurdity.","content":"Heinrich Klaasen's unbeaten 104 off just 44 deliveries in Durban Super Giants' 151-run thumping of Pretoria Capitals was so masterfully crafted that it bordered on absurdity. The increasingly formidable Proteas middle-order technician was in command from the outset after being promoted to No 3, hitting ten fours and six sixes in a display worthy of having a prominent early entry into the history of the fledgling SA20. He reached his maiden T20 century off just 43 balls, which is easily the quickest of the tournament to date. Super Giants' total is the fourth-highest on South African soil and the tallest ever recorded at SuperSport Park. In the greater scheme of things, the victory margin is the second-biggest by runs on South African soil, just behind Sri Lanka's 172-run demolition of Kenya at the Wanderers in the first ever T20 World Cup back in 2007. All the stats aside, enjoy the highlights of one of the greatest T20 knocks played by a South African.","pubDate":"2023-02-05 20:16:24","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Heat vow to bounce back from BBL final heartbreak","link":"https://www.smh.com.au/sport/cricket/heat-to-bounce-back-from-bbl-final-heartbreak-20230206-p5ci3k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Brisbane captain Jimmy Peirson says his team will come back bigger and better after their hopes of breaking their decade-long title drought were brought to an end on Saturday.","content":"Brisbane Heat captain Jimmy Peirson has promised that his team will come back bigger and better next season following their BBL final heartbreak. The Heat’s hopes of breaking their decade-long title drought were brought to an end on Saturday night when they suffered a five-wicket loss to the Perth Scorchers in front of 53,886 fans at Optus Stadium. Brisbane were in the box seat to claim victory after running out Scorchers captain Ashton Turner for 53 and leaving the home side requiring 39 runs from the last 19 balls. But 19-year-old rookie Cooper Connolly (25 not out off 11 balls) and full-time accountant Nick Hobson (18 not out off seven balls) pulled off some clutch late boundaries to get the hosts over the line with four balls to spare. Heat skipper Jimmy Peirson, right, with James Bazley during the Big Bash League final defeate against the Perth Scorchers on Saturday. Credit: Paul Kane/Getty Images Just making the final was a huge achievement for the Heat, who were sitting last on the table 22 days ago. The re-introduction of their Test stars - Usman Khawaja, Marnus Labuschagne and Matt Renshaw - helped spark the Heat, who won three away finals to make the decider. Josh Brown of the Heat reacts after dropping a catch off Cooper Connolly. Credit: Getty Peirson said he was “immensely proud” of his players, and he feels like his team are on the verge of creating something special. “The group isn’t full of household names like other teams,” he said. “My vision for this team is making the most of our parts and I think we are starting to do that. “We have the right personnel. Throw our Test guys into the mix and overseas players we had - we are building towards something. “This season has given us tremendous confidence in what we can do. We’ll come back bigger and better next year.” Nick Hobson hits the winning runs for the of the Scorchers in BBL final at Optus Stadium, Perth, on Saturday. Credit: Paul Kane/Getty Images The Scorchers have now won five titles - including the past two. Their method of building their squad around their State-contracted players has worked a charm. It’s a tactic the Heat are following. “We’re adopting a similar template,” Peirson said. “They’ve kept their state players; a core of players they have had for years and we look at our squad now and they are mostly Queensland state representatives. “The beauty of that is you’re training together all year around and you’re having those conversations, rather than (having) six or seven from interstate and the overseas guys.” AAP","pubDate":"2023-02-05 20:12:15","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Heinrich Klaasen carries Super Giants to crushing victory over Capitals","link":"https://www.citizen.co.za/sport/cricket/heinrich-klaasen-super-giants-capitals-sa20/","keywords":["Cricket","heinrich klaasen","SA20"],"creator":["Wesley Botton"],"video_url":null,"description":"Klaasen ran rampant, rocketing his way to an unbeaten 104 runs to secure his maiden T20 century.","content":"Heinrich Klaasen continued to flaunt his spectacular form on Sunday, laying the foundation with a superb century as Durban’s Super Giants earned a crushing 151-run victory over the Pretoria Capitals in their SA20 clash in Centurion. After losing the toss and being sent in to bat, the Super Giants got off to a spectacular start, with captain Quinton de Kock and Ben McDermott sharing 76 runs for the first wicket. Just as they looked to be running away with it, however, De Kock was caught and bowled by James Neetham after smashing a quickfire 43 runs off just 20 balls. ALSO READ: Pretoria Capitals win last ball thriller against MI Cape Town McDermott also got his teeth stuck in before he too was removed by paceman Dwaine Pretorious midway through the innings. He fell for 41 runs from 24 deliveries. Klaasen then ran rampant, rocketing his way to a magnificent unbeaten 104 runs to secure his maiden T20 century. He hammered 10 fours and cleared the boundary rope six times, at a remarkable strike rate of 236.36. Matthew Breetzke also contributed an unbeaten 46 runs off 21 deliveries as the visitors closed out their innings on 254/4. In response, the Capitals batting line-up completely capitulated under the pressure. They were bundled out for just 103 runs, with tail-ender Eathan Bosch top-scoring with 23 runs. Junior Dala was the best of the Super Giants bowlers, returning figures of 3/33. While the Capitals had already secured a home playoff before the match, and retained their place at the top of the log after a dominant campaign in the inaugural SA20 competition, the fifth-placed Super Giants did well to keep their slim semifinal hopes alive by picking up a bonus-point win.","pubDate":"2023-02-05 18:59:49","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/IMG_20230205_204932_1500_x_1000_pixel.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"India skipper says that mental fitness is massive at a world cup","link":"https://www.thesouthafrican.com/sport/cricket/india-skipper-mental-fitness-world-cup-breaking-february-2023/","keywords":["Cricket","Featured","ICC Women’s T20 World Cup 2023","India"],"creator":["James Richardson"],"video_url":null,"description":"Former India skipper Mithali Raj has stressed the need to be in a good mental space heading into a World Cup.","content":"Former India skipper Mithali Raj has stressed the need to be in a good mental space heading into a World Cup. Mental fitness is massive at a world cup Raj conceded that Australia are the big favourites heading into the ICC Women’s T20 World Cup 2023 in South Africa. “The ICC Women’s T20 World Cup 2023 will get underway soon and while most of the preparation has already been done, the challenge will be to ensure the players are ready mentally. “For an event like this, you have to do so much work on the mental side. It is so important to be in a very good mental space. The clearer and more composed you are, the more natural your performances will be and your cricket will start to flow. ALSO READ: Kevin Pietersen says South Africa is loving its cricket again “Going into the tournament in South Africa, I think everyone would agree that Australia are the favourites, and deservedly so. I am expecting, tight, competitive matches. “They are so difficult to beat because they bat deep and have an excellent batting line-up. There are not many teams who can rival them in terms of big hitters, and the fact they have numerous players who can play a similar role means that if one fails, others can step in. “We saw recently that when they toured India although that was a very competitive series but when it came down to it, more often than not, it was Australia who came out on top. “Having said that, while Australia are definitely favourites, we have seen India and England play some of their best cricket in the knockout stages of tournaments so I would not write them off. India also have the knack of bringing their best against Australia.” India have a chance in South Africa India’s chances will be largely dependent on the top order according to Raj. “Smriti Mandhana is playing well and is a match winner,” Raj added. “Harmanpreet Kaur has looked in good form too but we have to beat Australia and England you need others batters to come to the party. ALSO READ: Aiden Markram delighted with the Sunrisers’ English legion “I hope Shafali Verma and Richa Ghosh also have a good run at the World Cup considering they have gained so much experience of the conditions in South Africa. “The bowling will be tested and that is where we need to see an improvement. I am excited about some of the young players coming through and there is definitely some talent in the Under-19s team which I had the chance to see play at the inaugural ICC Under-19s Women’s T20 World Cup. ALSO READ: Proteas hoping home advantage will help break ICC tournament duck “The conditions in South Africa will make life easier for those batters who can negotiate bounce. If you can deal with the bounce, there are runs to be had square of the wicket, and the cricket can be very pleasing to the eye. The seamers should thrive as well, even if it might be a bit trickier for the wrist-spinners in particular but if you give it a tweak you will get purchase off the wicket.” CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-05 18:12:26","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Forgotten Indigenous All Stars finally awarded green and gold honour","link":"https://www.smh.com.au/sport/nrl/forgotten-indigenous-all-stars-finally-awarded-green-and-gold-honour-20230203-p5chnm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Dan Walsh"],"video_url":null,"description":"Rugby league’s Indigenous pioneers were offered just $190 each and could not wear their country’s colours. Fifty years on, they’re getting the recognition they deserve.","content":"Aboriginal and Torres Strait Islander readers are warned that the following article contains images of deceased persons. Fifty years ago a collection of shearers, labourers and footballers boarded a plane at Mascot airport for rugby league’s version of cricket’s fabled 1868 Indigenous tour of England. The 1973 Indigenous All Stars team at Mascot airport ahead of their historic trip to New Zealand. Credit: Victor Wright snr Unlike their cricketing counterparts, the 1973 Aboriginal All Stars went largely sight unseen in wider rugby league circles, both at the time of their landmark tour to New Zealand and in the decades since. Until now. Half a century after being emphatically denied the chance to wear green and gold by the ARL, and offered just $190 in tour funding by the governing body, the original Indigenous All Stars will finally have the red carpet rolled out for them. “Not being able to wear green and gold back then, that hurt like nothing else,” Ron Mason, one of the touring All Stars captains and an icon of south coast rugby league, says. The 1973 Indigenous All Stars face up to their Kiwi opponents. Credit: Victor Wright snr “There was a lot of racism in footy back then of course so we shouldn’t have been that surprised, but we went and represented our people. And the memories and bond of that tour still stick with all of us today.” Surviving members and families of the touring party — which included famous names like Mundine, Tallis and Widders — will finally be presented with commemorative green and gold jerseys this year. Thirteen players and officials able to travel will be feted in Rotorua during All Stars week, joining the current side as the NRL rolls out long-overdue acknowledgment for one of the most significant teams in Indigenous rugby league history. ‘More recognition in New Zealand than we did in our own country’ Conceived during the early days of the Koori Knockout competition, Indigenous officials began plotting a 10-day, nine-game tour from Auckland to Christchurch in late 1972. They did so with little help from rugby league’s top brass, and active opposition when it came to wearing traditional colours, largely because the ARL was not involved in selecting the sides. “The ARL didn’t want a bar of it, there was no way we were going to be wearing the national colours on their watch,” Dr Bob Morgan OAM, one of the tour managers, says. “Of course, you couldn’t get more Australian than this mob, could you? They offered us $190 as an afterthought, which was sad because this was the equivalent of the first Indigenous cricket tour 100 years earlier.” ‘Most of the boys were terrified on that plane, let me tell you.’ Famed Indigenous activist Charlie Perkins is lauded by surviving players as the “angel of a man” who helped secure $14,000 in funding for the tour through the National Aboriginal Sports Foundation. Probables v Possibles matches were played up and down Queensland and NSW, with the sky blue and maroon eventually paired as the colours of the tourists’ uniform at the suggestion of TV pundit and dual international Rex Mossop. “Just like the 1908 Australian team, of course, even though we weren’t allowed to wear the green and gold,” prop Victor Wright jnr chuckles. With Rabbitohs and Indigenous legend Eric Simms helping to pick the side and a 30-strong playing contingent featuring two players from the Northern Territory, and the wider touring party including a baby relative of tour manager Douggie Scott, the Aboriginal All Stars took flight. Terry Wickey clears a scrum for Penrith in 1979, with Arthur Beetson watching on. Credit: Fairfax Media “And most of the boys were terrified on that plane, let me tell you,” Morgan laughs. “No one had passports back then so it helped that we were travelling in a big group, but that’s just how it was for a lot of fellas back then. Rugby league opened a lot of doors for people, and at that time we found much more recognition in New Zealand than we did in our own country.” With players like Mason (Panthers), Bruce Stewart (Roosters) and Wally Tallis, father of Queensland’s Gorden, joined by future first-graders Ambrose Morgan and Thomas Moylan (Rabbitohs) and Terry Wickey (Panthers and Raiders), the tourists’ top side was competitive to say the least. Kiwi audiences remain stunned that flying winger Mickey Mundine — uncle to Anthony — never played first grade. He still can’t quite believe the size of his Maori opponents. The All Stars team touches down in New Zealand. Credit: Victor Wright snr “One leg on them would be twice the size of both of mine!” The Indigenous players remember their team bus being greeted by massive crowds as they covered more than 12,000 kilometres, traditional hangis and cultural receptions wherever they went. In return, the tourists’ own troupe of traditional dancers from the Northern Territory would offer their own rain dances in response to thundering hakas from the locals. “They’d been in drought all summer, so when it rained straight afterwards, those boys were the most popular people in the country,” Wright says. “There was so much rain in Rotorua that the roads were completely flooded, and we had to go the long way around.” Dean Widders grew up with stories of the tour from his uncle Bill, and points to the formation of all-Indigenous teams like the Moree Boomerangs off the back of the 1973 pioneers. “Rugby league has always led the way for Indigenous people and been part of our identity,” Widders says. Months of painstaking research by the NRL’s Alanah Scholes and Corey Rosser and subsequent ringarounds have reconnected old teammates, unearthed forgotten photos and documents and helped bridge a gap that was allowed to widen for decades. Aboriginal All Stars Don Carter and Victor Wright jnr (right). Credit: Victor Wright snr “Rugby league was a way for our mob to leave the reserves and missions, playing the game offered freedom of movement at the time,” Scholes says as both the daughter of Victor Wright and the NRL’s Reconciliation Action Plan manager. “The history of the game and our people, rugby league brought people together and allowed us to be treated as people. “This team wanted to represent their country and wear those colours proudly. Unfortunately they weren’t able to, so it’s important we acknowledge them.” For Morgan and the players still around, the long-overdue recognition means the world. “It’s a little bit like the apology from Kevin Rudd in 2008,” Morgan says. “We can’t change the past, but it’s important to learn from it and this team helped change rugby league and life in general for Indigenous people in this country.” Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-05 18:00:00","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations","link":"https://www.firstpost.com/firstcricket/sports-news/delhi-house-court-favours-shikhar-dhawan-orders-ex-wife-to-avoid-making-defamatory-allegations-12107022.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations","content":"Cricket Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations Shikhar Dhawan was left with no other option but to ask for the court’s intervention and seek a legal injunction after his wife had shared false messages to several people including the Delhi Capitals owner. FirstCricket Staff February 5th, 2023 23:12:22 IST Shikhar Dhawan and his ex-wife in a file image. Screengrab from Twitter video The Patiala House Court in New Delhi District ruled in cricketer Shikhar Dhawan’s favour and ordered his now estranged wife Aesha Mukherji to not share anything on social media that is defamatory to the cricketer. The court also categorically denied Mukherji to not speak to friends, relatives, media, or any other person in a manner that could tarnish Dhawan’s reputation. The House Court, however, asked Aesha – an Australian citizen – to take the legal route and voice her grievances (if any) to competent authorities in India or Australia. “Reputation of a person is dear to everyone and is considered as property of highest degree because materialistic property can be regained after loss but reputation cannot be regained once damaged. Therefore, it has got to be protected. However, it is equally true that if anyone has a lawful grievance against someone, he or she cannot be restrained from venting out his or her grievance to the concerned authority,” Bar and Bench quoted the judge saying in the order passed on 1 February. “Therefore, in these circumstances, she is hereby restrained till further order from circulating any of her grievance against Dhawan or her version of the dispute involved herein or the alleged defamatory and false material against him, to social media, to print media, or to any other’ forum or to friends, relatives or colleagues of the parties,” the judge added. Delhi court restrains estranged wife of Shikhar Dhawan from making defamatory allegations against the cricketer report by @NarsiBenwal #ShikharDhawan @SDhawan25 https://t.co/5MWVV4gEUe — Bar & Bench (@barandbench) February 4, 2023 The decision came after Dhawan had filed a plea seeking an injunction against Mukherji. Dhawan had claimed that Mukherji had been threatening him that she would tarnish the cricketer’s reputation and ruin his career, circulating some information to everyone. Dhawan, in his plea, claimed that Mukherjee had already shared several messages to a few people including the owner of Delhi Capitals Dheeraj Malhotra, alleging that he did not give her any money and that she was compelled to take money from her daughter’s boyfriend. Dhawan, on the contrary, shared details and pointed out that he had been paying Australian dollars 17,500 each month for school fees, uniforms, and other stuff. Consequentially, Dhawan was left with no other option but to ask for the court’s intervention and seek a legal injunction against such false and negative publicity that would tarnish his reputation and stature as an international cricketer. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: February 05, 2023 23:12:22 IST Tags: Cricket Shikhar Dhawan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-02-05 17:42:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/02/Shikhar-Dhawan.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"How India-Pakistan cricket thrived in Pervez Musharraf's rule","link":"https://timesofindia.indiatimes.com/sports/cricket/news/how-india-pakistan-cricket-thrived-in-pervez-musharrafs-rule/articleshow/97627117.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan's former military ruler Pervez Musharraf, the architect of the Kargil War in 1999, loved his cricket. Musharraf, who passed away in a Dubai hospital on Sunday, used cricket as a strong diplomatic tool to improve relations between the two countries when he led Pakistan first as Chief Executive and then President.","content":"KARACHI: Pakistan's former military ruler Pervez Musharraf , the architect of the Kargil War in 1999, loved his cricket. Musharraf, who passed away in a Dubai hospital on Sunday, used cricket as a strong diplomatic tool to improve relations between the two countries when he led Pakistan first as Chief Executive and then President. An avid follower of the game, Musharraf wasted no time in bringing his blue eyed boy, Lt-General Tauqir Zia , as chairman of the cricket board soon after his military coup in October 1999. But in 2003 the moment he learnt that Tauqir's son Junaid had played for Pakistan, Musharraf asked the PCB chairman to resign as he saw the entire episode as a conflict of interest. Musharraf then brought in former career diplomat and ex foreign secretary, Shaharyar Khan , who had served as ambassador in New Delhi, to head the cricket board. And a few months later, Shaharyar fulfilled Musharraf's ambition of having the Indian team tour Pakistan. Before Musharraf's coup, Pakistan had been to India in early 1999 when Atal Bihari Vajpayee was Indian Prime Minister but after that there were no bilateral exchanges between the two countries until 2004. The Indian team led by Saurav Ganguly came in March-April 2004 and it turned out to be a famous diplomatic success for the military ruler as the top names from India including government ministers and celebrities were invited to Pakistan to watch the matches with red carpet treatment laid out for them. The tour was a success with Musharraf wasting no opportunity to have photo shoots with the Indian team and his famous remarks about MS Dhoni's hairstyle became a hit in both countries. His meeting with the Indian team players were all exercises aimed at softening relations between the two countries and to portray himself as a moderate and liberal leader. And the plan worked to a great extent as never in the tenure of a Pakistani premier or President did so many Indo-Pak bilateral series take place than in Musharraf's tenure. After the 2004 series, India came again to Pakistan in early 2006 while the Pakistan team also toured India for full Test series first in 2005 and then in 2007 returning to Pakistan in 2008 for the Asia Cup. Before Musharraf's time, bilateral tours between the two countries had been far and few with huge gaps in between. Pakistan went to India in 1979-80 after a gap of nearly 18 years and India came to Pakistan in 1978/79 for the first time since 1954/55. Ironically these tours in the late 70s also took place during the tenure of another military dictator, General Zia ul Haq , who also used cricket diplomacy to reduce tensions. Musharraf himself wasted no opportunity to show up at cricket matches even in India when Pakistan was playing. In 2005, he turned up at the Feroze Shah Kotla ground to a warm welcome.","pubDate":"2023-02-05 17:28:38","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"1st Test, Day 2: Maiden ton for Tagenarine Chanderpaul against Zimbabwe","link":"https://timesofindia.indiatimes.com/sports/cricket/news/1st-test-day-2-maiden-test-ton-for-tagenarine-chanderpaul-against-zimbabwe/articleshow/97627046.cms","keywords":null,"creator":null,"video_url":null,"description":"Tagenarine Chanderpaul struck his first Test century and fellow opener Kraigg Brathwaite also reached three figures as the West Indies reached 221 without loss on Sunday after a rain-affected second day of the first Test against Zimbabwe in Bulawayo. Captain Brathwaite recorded his 12th Test ton as he made 116 while Chanderpaul, son of West Indies great Shivnarine, closed on 101.","content":"BULAWAYO: Tagenarine Chanderpaul struck his first Test century and fellow opener Kraigg Brathwaite also reached three figures as the West Indies reached 221 without loss on Sunday after a rain-affected second day of the first Test against Zimbabwe in Bulawayo. Captain Brathwaite recorded his 12th Test ton as he made 116 while Chanderpaul, son of West Indies great Shivnarine, closed on 101. It is the highest opening partnership by West Indians since Chris Gayle and Kieran Powell scored 254 against New Zealand in Antigua 11 years ago. Saturday's play had been abandoned because of rain soon after lunch with the tourists 112-0 and the inclement weather intervened again. Play was only able to start at 1500 local time (1300 GMT) on Sunday after sawdust had been scattered across the damp areas in the outfield. As was the case on the opening day, the West Indies openers took few chances, scoring at fewer than two and half runs per over against some tight Zimbabwe bowling on a sluggish pitch. Brathwaite, who has been in a rich run of form, looked the more comfortable and was the first to reach his century. By the close he had faced 246 balls and hit seven fours. Chanderpaul was more circumspect although there were moments when he played like his father who only retired from Test cricket eight years ago, having racked up 30 centuries in 164 Tests. While it took his father 19 Tests to reach his first century, Chanderpaul junior has needed just three. The 26-year-old left-hander only made his debut in Perth against Australia in November when he scored 51 and 45. He followed that with 47 and 17 in Adelaide and looked at home alongside Brathwaite in Bulawayo. He struck 10 fours and a six during the course of his innings, bringing up his century with a neat tuck behind square for a single. \"He (Chanderpaul) looks to be world-class and is a top opener,\" said Brathwaite at the close. \"Glad we have got some big partnerships thus far and would love to continue.\" Each of the Zimbabwe bowlers deserves credit for keeping a tight rein on the West Indies scoring, spinner Wellington Masakadza conceding just 30 runs from a tight 16 overs which included six maidens. The match, which is the first for the West Indies with Brian Lara acting as performance mentor, is the first of two in a Test series in Bulawayo. The second is scheduled to start on February 12.","pubDate":"2023-02-05 17:19:31","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Big steps for Asians in UFC","link":"https://businessmirror.com.ph/2023/02/06/big-steps-for-asians-in-ufc/","keywords":["Column","Sports","Featured"],"creator":["BusinessMirror"],"video_url":null,"description":"INDIAN mixed martial arts fighter Anshul Jubli knocked out Indonesian Jeka Seragih in the second round of their light heavyweight match at UFC Fight Night Sunday.","content":"INDIAN mixed martial arts fighter Anshul Jubli knocked out Indonesian Jeka Seragih in the second round of their light heavyweight match at UFC Fight Night Sunday. Jubli is only the second India born fighter to enter the world famous Octagon and the first to win a match. His predecessor Bharat Khandare lost his first and only fight (after which he was suspended and eventually released for doping). Jubli fought in the Road to the UFC that was rolled out prior to UFC 280 in Singapore in June of 2022. Although with his advancing to the finals of the Road to the UFC, he and Seragih were able to secure UFC contracts. The win solidifies Jubli’s place as he has won three of his fights (including two in the Road to the UFC) in the world’s top combat sports organization. The fighter from Uttrakashi, Jubli was tabbed as an underdog as his Indonesian foe knocked out all his three opponents heading into this UFC Fight Night clash. But Jubli battered Seragih to earn the win. And it was instant karma for the Indonesian whose childish antics including sticking out his tongue at the Indian totally backfired on him. “India is here,” exclaimed Jubli to the UFC Apex crowd and to Bleachers’ Brew. What he is doing for Indian mixed martial arts is massive. While cricket and chess are the top sports in India with basketball and football growing, Jubli asserts that wrestling, boxing and mixed martial arts are on the rise. A victory would certainly generate more interest in combat sports and the UFC. And now Anshul is 7-0 in his MMA career. During an exclusive interview with Jubli—who I specifically asked for—he was humble at all times. Never boasted about anything despite the fact that he was undefeated heading into his first official UFC match. Jubli told Bleachers’ Brew: “I hope to be for India what Manny Pacquaio was for Filipinos.” While Manny wasn’t the first Filipino world boxing champion, he is by far the most accomplished and famous. No doubt, inspiring many many more to follow in his footsteps. I took special interest in this particular match between Jubli and Seragih because it was between two Asian fighters. The Road to UFC program was specifically for Asian fighters and two Filipinos participated in the tournament. Unfortunately, both got booted out after their very first fight. One of those fighters, John Adajar, looked like he was going to beat his Korean foe, Han Seul Kim, as he staggered him on a couple of occasions. But a mistake committed by Adajar when he got to the canvas saw him tap out due to a triangle armbar. Watching that live as it happened, I thought that the mis take was also because wrestling and jiu jitsu are not natural sports to Filipinos. I had a feeling that if his Korean foe got him to the mat, he could reverse the tide. That was one time I hoped I was wrong. The Filipinos who have done well in the UFC are all Fil-Ams. Like Anshul Jubli, I am waiting for the first homegrown star to make an impact; a real significant impact in the UFC. Week in and out, as much as I enjoy interviewing the top fighters in the world, I always will have an interest in Asian fighters. And speaking of Asian fighters, Filipino-Australian Josh Culibao (10-1-1) will be fighting this coming UFC 284 (February 12 in Australia). He will be up against Armenian Melsik Baghdasaryan (7-1-0) in a featherweight match in the preliminary rounds. Culibao is 2-1-1 in the UFC. A win will certainly boost his stock in the UFC. However, it will not be an easy fight as the Armenian is also 2-0 in the UFC. Next week is going to be exciting. Now, I would love to also see the effect of Anshul Jubli’s win in India that is targeted as the next big thing after China in terms of being a global economic power, sports and culture.","pubDate":"2023-02-05 16:09:00","image_url":null,"source_id":"businessmirror","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Faf du Plessis powers Joburg Super Kings into SA20 semi-finals","link":"https://www.iol.co.za/sport/cricket/domestic/faf-du-plessis-powers-joburg-super-kings-into-sa20-semi-finals-c9d848bd-85e1-44f5-9686-562102816b62","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Faf du Plessis scored a brilliant 92 off 61 balls as Joburg Super Kings beat Sunrisers Eastern Cape to book their spot in the semi-finals of the SA20.","content":"Johannesburg — Faf du Plessis sent another timely reminder to the Proteas selectors that he remains one of the premier limited-overs batters in the world at a raucous Wanderers on Sunday. Du Plessis followed his maiden Betway SA20 century with another T20 masterclass as his 92 off 61 balls booked the Joburg Super Kings’ place in the semi-finals later this week. The former Proteas captain looked a class apart from the other batters on show as he still managed to time the ball sweetly on a sluggish Wanderers pitch. He also once again dominated the 119-run opening stand with Reeza Hendricks as the latter played a supporting hand with 40 off 36 balls. It followed their 157-run partnership against Durban’s Super Giants. An illustration of how tough the surface was to bat was illustrated after Hendricks’ departure. The Sunrisers reigned in the JSK batting unit as the home team managed just a further 41 runs in 5.4 overs while losing five wickets to finish on 160/6. Proteas seamer Sisanda Magala (2/24) was excellent during this period, while captain Aiden Markam (2/7) picked up the Super Kings’ new Aussie recruit Matthew Wade and Donovan Ferreira in a golden over. The Sunrisers’ chase began in the worst possible fashion with the Super Kings dominating the PowerPlay. The visitors lost three crucial wickets for just 29 runs with Adam Rossington (1), Jordan Hermann (5) and JJ Smuts (0) being dismissed cheaply. Super Kings tearaway Gerald Coetzee was certainly charging in at the Bullring as he beat both Hermann and Smuts for pace. Throughout this frenetic period for the Sunrisers, it was Temba Bavuma that maintained his composure though. The Proteas limited-overs captain was fresh off a golden duck in Betway SA20 debut, but he looked much more assured on his beloved Wanderers patch. Bavuma kept the Sunrisers’ flame alive with a 34-ball 50 (5x4, 2x6) that was highlighted with a sweet maximum over mid-wicket off Romario Shepherd. Unfortunately for Bavuma and the Sunrisers there was no further support besides Aiden Markram’s 34 as Super Kings debutant Kyle Simmonds ran through the visitors’ middle-order as the visitors finished on 136/9. Simmonds showed great control from the Corlett Drive End to finish impressive figures of 3/24 before Maheesh Theekshana took over to complete the job with 2/31. Scorecard Joburg Super Kings: 160/6 (Du Plessis 92, Hendricks 40, Magala 2/24, Markram 2/7) Sunrisers Eastern Cape: 136/9 (Bavuma 50, Markram 34, Simmonds 3/23, Theekshana 2/31) Super Kings won by 24 runs @ ZaahierAdams IOL Sport Share","pubDate":"2023-02-05 15:34:04","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/b7a0cb50-1e1d-5953-9708-61298200de33&operation=CROP&offset=0x150&resize=2399x1350","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | WATCH | Klaasen writes himself into the early annals of SA20 with absurdly dominant century","link":"https://www.news24.com/sport/Cricket/SA20/watch-klaasen-writes-himself-into-the-early-annals-of-sa20-with-absurdly-dominant-century-20230205","keywords":null,"creator":null,"video_url":null,"description":"Heinrich Klaasen's unbeaten 104 off just 44 deliveries in Durban Super Giants' 151-run thumping of Pretoria Capitals was so masterfully crafted that it bordered on absurdity.","content":"Heinrich Klaasen's unbeaten 104 off just 44 deliveries in Durban Super Giants' 151-run thumping of Pretoria Capitals was so masterfully crafted that it bordered on absurdity. The increasingly formidable Proteas middle-order technician was in command from the outset after being promoted to No 3, hitting ten fours and six sixes in a display worthy of having a prominent early entry into the history of the fledgling SA20. He reached his maiden T20 century off just 43 balls, which is easily the quickest of the tournament to date. Super Giants' total is the fourth-highest on South African soil and the tallest ever recorded at SuperSport Park. In the greater scheme of things, the victory margin is the second-biggest by runs on South African soil, just behind Sri Lanka's 172-run demolition of Kenya at the Wanderers in the first ever T20 World Cup back in 2007. All the stats aside, enjoy the highlights of one of the greatest T20 knocks played by a South African.","pubDate":"2023-02-05 20:16:24","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Heat vow to bounce back from BBL final heartbreak","link":"https://www.smh.com.au/sport/cricket/heat-to-bounce-back-from-bbl-final-heartbreak-20230206-p5ci3k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Brisbane captain Jimmy Peirson says his team will come back bigger and better after their hopes of breaking their decade-long title drought were brought to an end on Saturday.","content":"Brisbane Heat captain Jimmy Peirson has promised that his team will come back bigger and better next season following their BBL final heartbreak. The Heat’s hopes of breaking their decade-long title drought were brought to an end on Saturday night when they suffered a five-wicket loss to the Perth Scorchers in front of 53,886 fans at Optus Stadium. Brisbane were in the box seat to claim victory after running out Scorchers captain Ashton Turner for 53 and leaving the home side requiring 39 runs from the last 19 balls. But 19-year-old rookie Cooper Connolly (25 not out off 11 balls) and full-time accountant Nick Hobson (18 not out off seven balls) pulled off some clutch late boundaries to get the hosts over the line with four balls to spare. Heat skipper Jimmy Peirson, right, with James Bazley during the Big Bash League final defeate against the Perth Scorchers on Saturday. Credit: Paul Kane/Getty Images Just making the final was a huge achievement for the Heat, who were sitting last on the table 22 days ago. The re-introduction of their Test stars - Usman Khawaja, Marnus Labuschagne and Matt Renshaw - helped spark the Heat, who won three away finals to make the decider. Josh Brown of the Heat reacts after dropping a catch off Cooper Connolly. Credit: Getty Peirson said he was “immensely proud” of his players, and he feels like his team are on the verge of creating something special. “The group isn’t full of household names like other teams,” he said. “My vision for this team is making the most of our parts and I think we are starting to do that. “We have the right personnel. Throw our Test guys into the mix and overseas players we had - we are building towards something. “This season has given us tremendous confidence in what we can do. We’ll come back bigger and better next year.” Nick Hobson hits the winning runs for the of the Scorchers in BBL final at Optus Stadium, Perth, on Saturday. Credit: Paul Kane/Getty Images The Scorchers have now won five titles - including the past two. Their method of building their squad around their State-contracted players has worked a charm. It’s a tactic the Heat are following. “We’re adopting a similar template,” Peirson said. “They’ve kept their state players; a core of players they have had for years and we look at our squad now and they are mostly Queensland state representatives. “The beauty of that is you’re training together all year around and you’re having those conversations, rather than (having) six or seven from interstate and the overseas guys.” AAP","pubDate":"2023-02-05 20:12:15","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Heinrich Klaasen carries Super Giants to crushing victory over Capitals","link":"https://www.citizen.co.za/sport/cricket/heinrich-klaasen-super-giants-capitals-sa20/","keywords":["Cricket","heinrich klaasen","SA20"],"creator":["Wesley Botton"],"video_url":null,"description":"Klaasen ran rampant, rocketing his way to an unbeaten 104 runs to secure his maiden T20 century.","content":"Heinrich Klaasen continued to flaunt his spectacular form on Sunday, laying the foundation with a superb century as Durban’s Super Giants earned a crushing 151-run victory over the Pretoria Capitals in their SA20 clash in Centurion. After losing the toss and being sent in to bat, the Super Giants got off to a spectacular start, with captain Quinton de Kock and Ben McDermott sharing 76 runs for the first wicket. Just as they looked to be running away with it, however, De Kock was caught and bowled by James Neetham after smashing a quickfire 43 runs off just 20 balls. ALSO READ: Pretoria Capitals win last ball thriller against MI Cape Town McDermott also got his teeth stuck in before he too was removed by paceman Dwaine Pretorious midway through the innings. He fell for 41 runs from 24 deliveries. Klaasen then ran rampant, rocketing his way to a magnificent unbeaten 104 runs to secure his maiden T20 century. He hammered 10 fours and cleared the boundary rope six times, at a remarkable strike rate of 236.36. Matthew Breetzke also contributed an unbeaten 46 runs off 21 deliveries as the visitors closed out their innings on 254/4. In response, the Capitals batting line-up completely capitulated under the pressure. They were bundled out for just 103 runs, with tail-ender Eathan Bosch top-scoring with 23 runs. Junior Dala was the best of the Super Giants bowlers, returning figures of 3/33. While the Capitals had already secured a home playoff before the match, and retained their place at the top of the log after a dominant campaign in the inaugural SA20 competition, the fifth-placed Super Giants did well to keep their slim semifinal hopes alive by picking up a bonus-point win.","pubDate":"2023-02-05 18:59:49","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/IMG_20230205_204932_1500_x_1000_pixel.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"India skipper says that mental fitness is massive at a world cup","link":"https://www.thesouthafrican.com/sport/cricket/india-skipper-mental-fitness-world-cup-breaking-february-2023/","keywords":["Cricket","Featured","ICC Women’s T20 World Cup 2023","India"],"creator":["James Richardson"],"video_url":null,"description":"Former India skipper Mithali Raj has stressed the need to be in a good mental space heading into a World Cup.","content":"Former India skipper Mithali Raj has stressed the need to be in a good mental space heading into a World Cup. Mental fitness is massive at a world cup Raj conceded that Australia are the big favourites heading into the ICC Women’s T20 World Cup 2023 in South Africa. “The ICC Women’s T20 World Cup 2023 will get underway soon and while most of the preparation has already been done, the challenge will be to ensure the players are ready mentally. “For an event like this, you have to do so much work on the mental side. It is so important to be in a very good mental space. The clearer and more composed you are, the more natural your performances will be and your cricket will start to flow. ALSO READ: Kevin Pietersen says South Africa is loving its cricket again “Going into the tournament in South Africa, I think everyone would agree that Australia are the favourites, and deservedly so. I am expecting, tight, competitive matches. “They are so difficult to beat because they bat deep and have an excellent batting line-up. There are not many teams who can rival them in terms of big hitters, and the fact they have numerous players who can play a similar role means that if one fails, others can step in. “We saw recently that when they toured India although that was a very competitive series but when it came down to it, more often than not, it was Australia who came out on top. “Having said that, while Australia are definitely favourites, we have seen India and England play some of their best cricket in the knockout stages of tournaments so I would not write them off. India also have the knack of bringing their best against Australia.” India have a chance in South Africa India’s chances will be largely dependent on the top order according to Raj. “Smriti Mandhana is playing well and is a match winner,” Raj added. “Harmanpreet Kaur has looked in good form too but we have to beat Australia and England you need others batters to come to the party. ALSO READ: Aiden Markram delighted with the Sunrisers’ English legion “I hope Shafali Verma and Richa Ghosh also have a good run at the World Cup considering they have gained so much experience of the conditions in South Africa. “The bowling will be tested and that is where we need to see an improvement. I am excited about some of the young players coming through and there is definitely some talent in the Under-19s team which I had the chance to see play at the inaugural ICC Under-19s Women’s T20 World Cup. ALSO READ: Proteas hoping home advantage will help break ICC tournament duck “The conditions in South Africa will make life easier for those batters who can negotiate bounce. If you can deal with the bounce, there are runs to be had square of the wicket, and the cricket can be very pleasing to the eye. The seamers should thrive as well, even if it might be a bit trickier for the wrist-spinners in particular but if you give it a tweak you will get purchase off the wicket.” CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-05 18:12:26","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Forgotten Indigenous All Stars finally awarded green and gold honour","link":"https://www.smh.com.au/sport/nrl/forgotten-indigenous-all-stars-finally-awarded-green-and-gold-honour-20230203-p5chnm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Dan Walsh"],"video_url":null,"description":"Rugby league’s Indigenous pioneers were offered just $190 each and could not wear their country’s colours. Fifty years on, they’re getting the recognition they deserve.","content":"Aboriginal and Torres Strait Islander readers are warned that the following article contains images of deceased persons. Fifty years ago a collection of shearers, labourers and footballers boarded a plane at Mascot airport for rugby league’s version of cricket’s fabled 1868 Indigenous tour of England. The 1973 Indigenous All Stars team at Mascot airport ahead of their historic trip to New Zealand. Credit: Victor Wright snr Unlike their cricketing counterparts, the 1973 Aboriginal All Stars went largely sight unseen in wider rugby league circles, both at the time of their landmark tour to New Zealand and in the decades since. Until now. Half a century after being emphatically denied the chance to wear green and gold by the ARL, and offered just $190 in tour funding by the governing body, the original Indigenous All Stars will finally have the red carpet rolled out for them. “Not being able to wear green and gold back then, that hurt like nothing else,” Ron Mason, one of the touring All Stars captains and an icon of south coast rugby league, says. The 1973 Indigenous All Stars face up to their Kiwi opponents. Credit: Victor Wright snr “There was a lot of racism in footy back then of course so we shouldn’t have been that surprised, but we went and represented our people. And the memories and bond of that tour still stick with all of us today.” Surviving members and families of the touring party — which included famous names like Mundine, Tallis and Widders — will finally be presented with commemorative green and gold jerseys this year. Thirteen players and officials able to travel will be feted in Rotorua during All Stars week, joining the current side as the NRL rolls out long-overdue acknowledgment for one of the most significant teams in Indigenous rugby league history. ‘More recognition in New Zealand than we did in our own country’ Conceived during the early days of the Koori Knockout competition, Indigenous officials began plotting a 10-day, nine-game tour from Auckland to Christchurch in late 1972. They did so with little help from rugby league’s top brass, and active opposition when it came to wearing traditional colours, largely because the ARL was not involved in selecting the sides. “The ARL didn’t want a bar of it, there was no way we were going to be wearing the national colours on their watch,” Dr Bob Morgan OAM, one of the tour managers, says. “Of course, you couldn’t get more Australian than this mob, could you? They offered us $190 as an afterthought, which was sad because this was the equivalent of the first Indigenous cricket tour 100 years earlier.” ‘Most of the boys were terrified on that plane, let me tell you.’ Famed Indigenous activist Charlie Perkins is lauded by surviving players as the “angel of a man” who helped secure $14,000 in funding for the tour through the National Aboriginal Sports Foundation. Probables v Possibles matches were played up and down Queensland and NSW, with the sky blue and maroon eventually paired as the colours of the tourists’ uniform at the suggestion of TV pundit and dual international Rex Mossop. “Just like the 1908 Australian team, of course, even though we weren’t allowed to wear the green and gold,” prop Victor Wright jnr chuckles. With Rabbitohs and Indigenous legend Eric Simms helping to pick the side and a 30-strong playing contingent featuring two players from the Northern Territory, and the wider touring party including a baby relative of tour manager Douggie Scott, the Aboriginal All Stars took flight. Terry Wickey clears a scrum for Penrith in 1979, with Arthur Beetson watching on. Credit: Fairfax Media “And most of the boys were terrified on that plane, let me tell you,” Morgan laughs. “No one had passports back then so it helped that we were travelling in a big group, but that’s just how it was for a lot of fellas back then. Rugby league opened a lot of doors for people, and at that time we found much more recognition in New Zealand than we did in our own country.” With players like Mason (Panthers), Bruce Stewart (Roosters) and Wally Tallis, father of Queensland’s Gorden, joined by future first-graders Ambrose Morgan and Thomas Moylan (Rabbitohs) and Terry Wickey (Panthers and Raiders), the tourists’ top side was competitive to say the least. Kiwi audiences remain stunned that flying winger Mickey Mundine — uncle to Anthony — never played first grade. He still can’t quite believe the size of his Maori opponents. The All Stars team touches down in New Zealand. Credit: Victor Wright snr “One leg on them would be twice the size of both of mine!” The Indigenous players remember their team bus being greeted by massive crowds as they covered more than 12,000 kilometres, traditional hangis and cultural receptions wherever they went. In return, the tourists’ own troupe of traditional dancers from the Northern Territory would offer their own rain dances in response to thundering hakas from the locals. “They’d been in drought all summer, so when it rained straight afterwards, those boys were the most popular people in the country,” Wright says. “There was so much rain in Rotorua that the roads were completely flooded, and we had to go the long way around.” Dean Widders grew up with stories of the tour from his uncle Bill, and points to the formation of all-Indigenous teams like the Moree Boomerangs off the back of the 1973 pioneers. “Rugby league has always led the way for Indigenous people and been part of our identity,” Widders says. Months of painstaking research by the NRL’s Alanah Scholes and Corey Rosser and subsequent ringarounds have reconnected old teammates, unearthed forgotten photos and documents and helped bridge a gap that was allowed to widen for decades. Aboriginal All Stars Don Carter and Victor Wright jnr (right). Credit: Victor Wright snr “Rugby league was a way for our mob to leave the reserves and missions, playing the game offered freedom of movement at the time,” Scholes says as both the daughter of Victor Wright and the NRL’s Reconciliation Action Plan manager. “The history of the game and our people, rugby league brought people together and allowed us to be treated as people. “This team wanted to represent their country and wear those colours proudly. Unfortunately they weren’t able to, so it’s important we acknowledge them.” For Morgan and the players still around, the long-overdue recognition means the world. “It’s a little bit like the apology from Kevin Rudd in 2008,” Morgan says. “We can’t change the past, but it’s important to learn from it and this team helped change rugby league and life in general for Indigenous people in this country.” Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-05 18:00:00","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations","link":"https://www.firstpost.com/firstcricket/sports-news/delhi-house-court-favours-shikhar-dhawan-orders-ex-wife-to-avoid-making-defamatory-allegations-12107022.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations","content":"Cricket Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations Shikhar Dhawan was left with no other option but to ask for the court’s intervention and seek a legal injunction after his wife had shared false messages to several people including the Delhi Capitals owner. FirstCricket Staff February 5th, 2023 23:12:22 IST Shikhar Dhawan and his ex-wife in a file image. Screengrab from Twitter video The Patiala House Court in New Delhi District ruled in cricketer Shikhar Dhawan’s favour and ordered his now estranged wife Aesha Mukherji to not share anything on social media that is defamatory to the cricketer. The court also categorically denied Mukherji to not speak to friends, relatives, media, or any other person in a manner that could tarnish Dhawan’s reputation. The House Court, however, asked Aesha – an Australian citizen – to take the legal route and voice her grievances (if any) to competent authorities in India or Australia. “Reputation of a person is dear to everyone and is considered as property of highest degree because materialistic property can be regained after loss but reputation cannot be regained once damaged. Therefore, it has got to be protected. However, it is equally true that if anyone has a lawful grievance against someone, he or she cannot be restrained from venting out his or her grievance to the concerned authority,” Bar and Bench quoted the judge saying in the order passed on 1 February. “Therefore, in these circumstances, she is hereby restrained till further order from circulating any of her grievance against Dhawan or her version of the dispute involved herein or the alleged defamatory and false material against him, to social media, to print media, or to any other’ forum or to friends, relatives or colleagues of the parties,” the judge added. Delhi court restrains estranged wife of Shikhar Dhawan from making defamatory allegations against the cricketer report by @NarsiBenwal #ShikharDhawan @SDhawan25 https://t.co/5MWVV4gEUe — Bar & Bench (@barandbench) February 4, 2023 The decision came after Dhawan had filed a plea seeking an injunction against Mukherji. Dhawan had claimed that Mukherji had been threatening him that she would tarnish the cricketer’s reputation and ruin his career, circulating some information to everyone. Dhawan, in his plea, claimed that Mukherjee had already shared several messages to a few people including the owner of Delhi Capitals Dheeraj Malhotra, alleging that he did not give her any money and that she was compelled to take money from her daughter’s boyfriend. Dhawan, on the contrary, shared details and pointed out that he had been paying Australian dollars 17,500 each month for school fees, uniforms, and other stuff. Consequentially, Dhawan was left with no other option but to ask for the court’s intervention and seek a legal injunction against such false and negative publicity that would tarnish his reputation and stature as an international cricketer. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: February 05, 2023 23:12:22 IST Tags: Cricket Shikhar Dhawan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-02-05 17:42:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/02/Shikhar-Dhawan.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"How India-Pakistan cricket thrived in Pervez Musharraf's rule","link":"https://timesofindia.indiatimes.com/sports/cricket/news/how-india-pakistan-cricket-thrived-in-pervez-musharrafs-rule/articleshow/97627117.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan's former military ruler Pervez Musharraf, the architect of the Kargil War in 1999, loved his cricket. Musharraf, who passed away in a Dubai hospital on Sunday, used cricket as a strong diplomatic tool to improve relations between the two countries when he led Pakistan first as Chief Executive and then President.","content":"KARACHI: Pakistan's former military ruler Pervez Musharraf , the architect of the Kargil War in 1999, loved his cricket. Musharraf, who passed away in a Dubai hospital on Sunday, used cricket as a strong diplomatic tool to improve relations between the two countries when he led Pakistan first as Chief Executive and then President. An avid follower of the game, Musharraf wasted no time in bringing his blue eyed boy, Lt-General Tauqir Zia , as chairman of the cricket board soon after his military coup in October 1999. But in 2003 the moment he learnt that Tauqir's son Junaid had played for Pakistan, Musharraf asked the PCB chairman to resign as he saw the entire episode as a conflict of interest. Musharraf then brought in former career diplomat and ex foreign secretary, Shaharyar Khan , who had served as ambassador in New Delhi, to head the cricket board. And a few months later, Shaharyar fulfilled Musharraf's ambition of having the Indian team tour Pakistan. Before Musharraf's coup, Pakistan had been to India in early 1999 when Atal Bihari Vajpayee was Indian Prime Minister but after that there were no bilateral exchanges between the two countries until 2004. The Indian team led by Saurav Ganguly came in March-April 2004 and it turned out to be a famous diplomatic success for the military ruler as the top names from India including government ministers and celebrities were invited to Pakistan to watch the matches with red carpet treatment laid out for them. The tour was a success with Musharraf wasting no opportunity to have photo shoots with the Indian team and his famous remarks about MS Dhoni's hairstyle became a hit in both countries. His meeting with the Indian team players were all exercises aimed at softening relations between the two countries and to portray himself as a moderate and liberal leader. And the plan worked to a great extent as never in the tenure of a Pakistani premier or President did so many Indo-Pak bilateral series take place than in Musharraf's tenure. After the 2004 series, India came again to Pakistan in early 2006 while the Pakistan team also toured India for full Test series first in 2005 and then in 2007 returning to Pakistan in 2008 for the Asia Cup. Before Musharraf's time, bilateral tours between the two countries had been far and few with huge gaps in between. Pakistan went to India in 1979-80 after a gap of nearly 18 years and India came to Pakistan in 1978/79 for the first time since 1954/55. Ironically these tours in the late 70s also took place during the tenure of another military dictator, General Zia ul Haq , who also used cricket diplomacy to reduce tensions. Musharraf himself wasted no opportunity to show up at cricket matches even in India when Pakistan was playing. In 2005, he turned up at the Feroze Shah Kotla ground to a warm welcome.","pubDate":"2023-02-05 17:28:38","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"1st Test, Day 2: Maiden ton for Tagenarine Chanderpaul against Zimbabwe","link":"https://timesofindia.indiatimes.com/sports/cricket/news/1st-test-day-2-maiden-test-ton-for-tagenarine-chanderpaul-against-zimbabwe/articleshow/97627046.cms","keywords":null,"creator":null,"video_url":null,"description":"Tagenarine Chanderpaul struck his first Test century and fellow opener Kraigg Brathwaite also reached three figures as the West Indies reached 221 without loss on Sunday after a rain-affected second day of the first Test against Zimbabwe in Bulawayo. Captain Brathwaite recorded his 12th Test ton as he made 116 while Chanderpaul, son of West Indies great Shivnarine, closed on 101.","content":"BULAWAYO: Tagenarine Chanderpaul struck his first Test century and fellow opener Kraigg Brathwaite also reached three figures as the West Indies reached 221 without loss on Sunday after a rain-affected second day of the first Test against Zimbabwe in Bulawayo. Captain Brathwaite recorded his 12th Test ton as he made 116 while Chanderpaul, son of West Indies great Shivnarine, closed on 101. It is the highest opening partnership by West Indians since Chris Gayle and Kieran Powell scored 254 against New Zealand in Antigua 11 years ago. Saturday's play had been abandoned because of rain soon after lunch with the tourists 112-0 and the inclement weather intervened again. Play was only able to start at 1500 local time (1300 GMT) on Sunday after sawdust had been scattered across the damp areas in the outfield. As was the case on the opening day, the West Indies openers took few chances, scoring at fewer than two and half runs per over against some tight Zimbabwe bowling on a sluggish pitch. Brathwaite, who has been in a rich run of form, looked the more comfortable and was the first to reach his century. By the close he had faced 246 balls and hit seven fours. Chanderpaul was more circumspect although there were moments when he played like his father who only retired from Test cricket eight years ago, having racked up 30 centuries in 164 Tests. While it took his father 19 Tests to reach his first century, Chanderpaul junior has needed just three. The 26-year-old left-hander only made his debut in Perth against Australia in November when he scored 51 and 45. He followed that with 47 and 17 in Adelaide and looked at home alongside Brathwaite in Bulawayo. He struck 10 fours and a six during the course of his innings, bringing up his century with a neat tuck behind square for a single. \"He (Chanderpaul) looks to be world-class and is a top opener,\" said Brathwaite at the close. \"Glad we have got some big partnerships thus far and would love to continue.\" Each of the Zimbabwe bowlers deserves credit for keeping a tight rein on the West Indies scoring, spinner Wellington Masakadza conceding just 30 runs from a tight 16 overs which included six maidens. The match, which is the first for the West Indies with Brian Lara acting as performance mentor, is the first of two in a Test series in Bulawayo. The second is scheduled to start on February 12.","pubDate":"2023-02-05 17:19:31","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Big steps for Asians in UFC","link":"https://businessmirror.com.ph/2023/02/06/big-steps-for-asians-in-ufc/","keywords":["Column","Sports","Featured"],"creator":["BusinessMirror"],"video_url":null,"description":"INDIAN mixed martial arts fighter Anshul Jubli knocked out Indonesian Jeka Seragih in the second round of their light heavyweight match at UFC Fight Night Sunday.","content":"INDIAN mixed martial arts fighter Anshul Jubli knocked out Indonesian Jeka Seragih in the second round of their light heavyweight match at UFC Fight Night Sunday. Jubli is only the second India born fighter to enter the world famous Octagon and the first to win a match. His predecessor Bharat Khandare lost his first and only fight (after which he was suspended and eventually released for doping). Jubli fought in the Road to the UFC that was rolled out prior to UFC 280 in Singapore in June of 2022. Although with his advancing to the finals of the Road to the UFC, he and Seragih were able to secure UFC contracts. The win solidifies Jubli’s place as he has won three of his fights (including two in the Road to the UFC) in the world’s top combat sports organization. The fighter from Uttrakashi, Jubli was tabbed as an underdog as his Indonesian foe knocked out all his three opponents heading into this UFC Fight Night clash. But Jubli battered Seragih to earn the win. And it was instant karma for the Indonesian whose childish antics including sticking out his tongue at the Indian totally backfired on him. “India is here,” exclaimed Jubli to the UFC Apex crowd and to Bleachers’ Brew. What he is doing for Indian mixed martial arts is massive. While cricket and chess are the top sports in India with basketball and football growing, Jubli asserts that wrestling, boxing and mixed martial arts are on the rise. A victory would certainly generate more interest in combat sports and the UFC. And now Anshul is 7-0 in his MMA career. During an exclusive interview with Jubli—who I specifically asked for—he was humble at all times. Never boasted about anything despite the fact that he was undefeated heading into his first official UFC match. Jubli told Bleachers’ Brew: “I hope to be for India what Manny Pacquaio was for Filipinos.” While Manny wasn’t the first Filipino world boxing champion, he is by far the most accomplished and famous. No doubt, inspiring many many more to follow in his footsteps. I took special interest in this particular match between Jubli and Seragih because it was between two Asian fighters. The Road to UFC program was specifically for Asian fighters and two Filipinos participated in the tournament. Unfortunately, both got booted out after their very first fight. One of those fighters, John Adajar, looked like he was going to beat his Korean foe, Han Seul Kim, as he staggered him on a couple of occasions. But a mistake committed by Adajar when he got to the canvas saw him tap out due to a triangle armbar. Watching that live as it happened, I thought that the mis take was also because wrestling and jiu jitsu are not natural sports to Filipinos. I had a feeling that if his Korean foe got him to the mat, he could reverse the tide. That was one time I hoped I was wrong. The Filipinos who have done well in the UFC are all Fil-Ams. Like Anshul Jubli, I am waiting for the first homegrown star to make an impact; a real significant impact in the UFC. Week in and out, as much as I enjoy interviewing the top fighters in the world, I always will have an interest in Asian fighters. And speaking of Asian fighters, Filipino-Australian Josh Culibao (10-1-1) will be fighting this coming UFC 284 (February 12 in Australia). He will be up against Armenian Melsik Baghdasaryan (7-1-0) in a featherweight match in the preliminary rounds. Culibao is 2-1-1 in the UFC. A win will certainly boost his stock in the UFC. However, it will not be an easy fight as the Armenian is also 2-0 in the UFC. Next week is going to be exciting. Now, I would love to also see the effect of Anshul Jubli’s win in India that is targeted as the next big thing after China in terms of being a global economic power, sports and culture.","pubDate":"2023-02-05 16:09:00","image_url":null,"source_id":"businessmirror","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Faf du Plessis powers Joburg Super Kings into SA20 semi-finals","link":"https://www.iol.co.za/sport/cricket/domestic/faf-du-plessis-powers-joburg-super-kings-into-sa20-semi-finals-c9d848bd-85e1-44f5-9686-562102816b62","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Faf du Plessis scored a brilliant 92 off 61 balls as Joburg Super Kings beat Sunrisers Eastern Cape to book their spot in the semi-finals of the SA20.","content":"Johannesburg — Faf du Plessis sent another timely reminder to the Proteas selectors that he remains one of the premier limited-overs batters in the world at a raucous Wanderers on Sunday. Du Plessis followed his maiden Betway SA20 century with another T20 masterclass as his 92 off 61 balls booked the Joburg Super Kings’ place in the semi-finals later this week. The former Proteas captain looked a class apart from the other batters on show as he still managed to time the ball sweetly on a sluggish Wanderers pitch. He also once again dominated the 119-run opening stand with Reeza Hendricks as the latter played a supporting hand with 40 off 36 balls. It followed their 157-run partnership against Durban’s Super Giants. An illustration of how tough the surface was to bat was illustrated after Hendricks’ departure. The Sunrisers reigned in the JSK batting unit as the home team managed just a further 41 runs in 5.4 overs while losing five wickets to finish on 160/6. Proteas seamer Sisanda Magala (2/24) was excellent during this period, while captain Aiden Markam (2/7) picked up the Super Kings’ new Aussie recruit Matthew Wade and Donovan Ferreira in a golden over. The Sunrisers’ chase began in the worst possible fashion with the Super Kings dominating the PowerPlay. The visitors lost three crucial wickets for just 29 runs with Adam Rossington (1), Jordan Hermann (5) and JJ Smuts (0) being dismissed cheaply. Super Kings tearaway Gerald Coetzee was certainly charging in at the Bullring as he beat both Hermann and Smuts for pace. Throughout this frenetic period for the Sunrisers, it was Temba Bavuma that maintained his composure though. The Proteas limited-overs captain was fresh off a golden duck in Betway SA20 debut, but he looked much more assured on his beloved Wanderers patch. Bavuma kept the Sunrisers’ flame alive with a 34-ball 50 (5x4, 2x6) that was highlighted with a sweet maximum over mid-wicket off Romario Shepherd. Unfortunately for Bavuma and the Sunrisers there was no further support besides Aiden Markram’s 34 as Super Kings debutant Kyle Simmonds ran through the visitors’ middle-order as the visitors finished on 136/9. Simmonds showed great control from the Corlett Drive End to finish impressive figures of 3/24 before Maheesh Theekshana took over to complete the job with 2/31. Scorecard Joburg Super Kings: 160/6 (Du Plessis 92, Hendricks 40, Magala 2/24, Markram 2/7) Sunrisers Eastern Cape: 136/9 (Bavuma 50, Markram 34, Simmonds 3/23, Theekshana 2/31) Super Kings won by 24 runs @ ZaahierAdams IOL Sport Share","pubDate":"2023-02-05 15:34:04","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/b7a0cb50-1e1d-5953-9708-61298200de33&operation=CROP&offset=0x150&resize=2399x1350","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"},{"title":"News24.com | WATCH | Klaasen writes himself into the early annals of SA20 with absurdly dominant century","link":"https://www.news24.com/sport/Cricket/SA20/watch-klaasen-writes-himself-into-the-early-annals-of-sa20-with-absurdly-dominant-century-20230205","keywords":null,"creator":null,"video_url":null,"description":"Heinrich Klaasen's unbeaten 104 off just 44 deliveries in Durban Super Giants' 151-run thumping of Pretoria Capitals was so masterfully crafted that it bordered on absurdity.","content":"Heinrich Klaasen's unbeaten 104 off just 44 deliveries in Durban Super Giants' 151-run thumping of Pretoria Capitals was so masterfully crafted that it bordered on absurdity. The increasingly formidable Proteas middle-order technician was in command from the outset after being promoted to No 3, hitting ten fours and six sixes in a display worthy of having a prominent early entry into the history of the fledgling SA20. He reached his maiden T20 century off just 43 balls, which is easily the quickest of the tournament to date. Super Giants' total is the fourth-highest on South African soil and the tallest ever recorded at SuperSport Park. In the greater scheme of things, the victory margin is the second-biggest by runs on South African soil, just behind Sri Lanka's 172-run demolition of Kenya at the Wanderers in the first ever T20 World Cup back in 2007. All the stats aside, enjoy the highlights of one of the greatest T20 knocks played by a South African.","pubDate":"2023-02-05 20:16:24","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Heat vow to bounce back from BBL final heartbreak","link":"https://www.smh.com.au/sport/cricket/heat-to-bounce-back-from-bbl-final-heartbreak-20230206-p5ci3k.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Justin Chadwick"],"video_url":null,"description":"Brisbane captain Jimmy Peirson says his team will come back bigger and better after their hopes of breaking their decade-long title drought were brought to an end on Saturday.","content":"Brisbane Heat captain Jimmy Peirson has promised that his team will come back bigger and better next season following their BBL final heartbreak. The Heat’s hopes of breaking their decade-long title drought were brought to an end on Saturday night when they suffered a five-wicket loss to the Perth Scorchers in front of 53,886 fans at Optus Stadium. Brisbane were in the box seat to claim victory after running out Scorchers captain Ashton Turner for 53 and leaving the home side requiring 39 runs from the last 19 balls. But 19-year-old rookie Cooper Connolly (25 not out off 11 balls) and full-time accountant Nick Hobson (18 not out off seven balls) pulled off some clutch late boundaries to get the hosts over the line with four balls to spare. Heat skipper Jimmy Peirson, right, with James Bazley during the Big Bash League final defeate against the Perth Scorchers on Saturday. Credit: Paul Kane/Getty Images Just making the final was a huge achievement for the Heat, who were sitting last on the table 22 days ago. The re-introduction of their Test stars - Usman Khawaja, Marnus Labuschagne and Matt Renshaw - helped spark the Heat, who won three away finals to make the decider. Josh Brown of the Heat reacts after dropping a catch off Cooper Connolly. Credit: Getty Peirson said he was “immensely proud” of his players, and he feels like his team are on the verge of creating something special. “The group isn’t full of household names like other teams,” he said. “My vision for this team is making the most of our parts and I think we are starting to do that. “We have the right personnel. Throw our Test guys into the mix and overseas players we had - we are building towards something. “This season has given us tremendous confidence in what we can do. We’ll come back bigger and better next year.” Nick Hobson hits the winning runs for the of the Scorchers in BBL final at Optus Stadium, Perth, on Saturday. Credit: Paul Kane/Getty Images The Scorchers have now won five titles - including the past two. Their method of building their squad around their State-contracted players has worked a charm. It’s a tactic the Heat are following. “We’re adopting a similar template,” Peirson said. “They’ve kept their state players; a core of players they have had for years and we look at our squad now and they are mostly Queensland state representatives. “The beauty of that is you’re training together all year around and you’re having those conversations, rather than (having) six or seven from interstate and the overseas guys.” AAP","pubDate":"2023-02-05 20:12:15","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Heinrich Klaasen carries Super Giants to crushing victory over Capitals","link":"https://www.citizen.co.za/sport/cricket/heinrich-klaasen-super-giants-capitals-sa20/","keywords":["Cricket","heinrich klaasen","SA20"],"creator":["Wesley Botton"],"video_url":null,"description":"Klaasen ran rampant, rocketing his way to an unbeaten 104 runs to secure his maiden T20 century.","content":"Heinrich Klaasen continued to flaunt his spectacular form on Sunday, laying the foundation with a superb century as Durban’s Super Giants earned a crushing 151-run victory over the Pretoria Capitals in their SA20 clash in Centurion. After losing the toss and being sent in to bat, the Super Giants got off to a spectacular start, with captain Quinton de Kock and Ben McDermott sharing 76 runs for the first wicket. Just as they looked to be running away with it, however, De Kock was caught and bowled by James Neetham after smashing a quickfire 43 runs off just 20 balls. ALSO READ: Pretoria Capitals win last ball thriller against MI Cape Town McDermott also got his teeth stuck in before he too was removed by paceman Dwaine Pretorious midway through the innings. He fell for 41 runs from 24 deliveries. Klaasen then ran rampant, rocketing his way to a magnificent unbeaten 104 runs to secure his maiden T20 century. He hammered 10 fours and cleared the boundary rope six times, at a remarkable strike rate of 236.36. Matthew Breetzke also contributed an unbeaten 46 runs off 21 deliveries as the visitors closed out their innings on 254/4. In response, the Capitals batting line-up completely capitulated under the pressure. They were bundled out for just 103 runs, with tail-ender Eathan Bosch top-scoring with 23 runs. Junior Dala was the best of the Super Giants bowlers, returning figures of 3/33. While the Capitals had already secured a home playoff before the match, and retained their place at the top of the log after a dominant campaign in the inaugural SA20 competition, the fifth-placed Super Giants did well to keep their slim semifinal hopes alive by picking up a bonus-point win.","pubDate":"2023-02-05 18:59:49","image_url":"https://media.citizen.co.za/wp-content/uploads/2023/02/IMG_20230205_204932_1500_x_1000_pixel.jpg","source_id":"citizen","category":["sports"],"country":["south africa"],"language":"english"},{"title":"India skipper says that mental fitness is massive at a world cup","link":"https://www.thesouthafrican.com/sport/cricket/india-skipper-mental-fitness-world-cup-breaking-february-2023/","keywords":["Cricket","Featured","ICC Women’s T20 World Cup 2023","India"],"creator":["James Richardson"],"video_url":null,"description":"Former India skipper Mithali Raj has stressed the need to be in a good mental space heading into a World Cup.","content":"Former India skipper Mithali Raj has stressed the need to be in a good mental space heading into a World Cup. Mental fitness is massive at a world cup Raj conceded that Australia are the big favourites heading into the ICC Women’s T20 World Cup 2023 in South Africa. “The ICC Women’s T20 World Cup 2023 will get underway soon and while most of the preparation has already been done, the challenge will be to ensure the players are ready mentally. “For an event like this, you have to do so much work on the mental side. It is so important to be in a very good mental space. The clearer and more composed you are, the more natural your performances will be and your cricket will start to flow. ALSO READ: Kevin Pietersen says South Africa is loving its cricket again “Going into the tournament in South Africa, I think everyone would agree that Australia are the favourites, and deservedly so. I am expecting, tight, competitive matches. “They are so difficult to beat because they bat deep and have an excellent batting line-up. There are not many teams who can rival them in terms of big hitters, and the fact they have numerous players who can play a similar role means that if one fails, others can step in. “We saw recently that when they toured India although that was a very competitive series but when it came down to it, more often than not, it was Australia who came out on top. “Having said that, while Australia are definitely favourites, we have seen India and England play some of their best cricket in the knockout stages of tournaments so I would not write them off. India also have the knack of bringing their best against Australia.” India have a chance in South Africa India’s chances will be largely dependent on the top order according to Raj. “Smriti Mandhana is playing well and is a match winner,” Raj added. “Harmanpreet Kaur has looked in good form too but we have to beat Australia and England you need others batters to come to the party. ALSO READ: Aiden Markram delighted with the Sunrisers’ English legion “I hope Shafali Verma and Richa Ghosh also have a good run at the World Cup considering they have gained so much experience of the conditions in South Africa. “The bowling will be tested and that is where we need to see an improvement. I am excited about some of the young players coming through and there is definitely some talent in the Under-19s team which I had the chance to see play at the inaugural ICC Under-19s Women’s T20 World Cup. ALSO READ: Proteas hoping home advantage will help break ICC tournament duck “The conditions in South Africa will make life easier for those batters who can negotiate bounce. If you can deal with the bounce, there are runs to be had square of the wicket, and the cricket can be very pleasing to the eye. The seamers should thrive as well, even if it might be a bit trickier for the wrist-spinners in particular but if you give it a tweak you will get purchase off the wicket.” CLICK HERE TO READ MORE ARTICLES BY JAMES RICHARDSON","pubDate":"2023-02-05 18:12:26","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Forgotten Indigenous All Stars finally awarded green and gold honour","link":"https://www.smh.com.au/sport/nrl/forgotten-indigenous-all-stars-finally-awarded-green-and-gold-honour-20230203-p5chnm.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Dan Walsh"],"video_url":null,"description":"Rugby league’s Indigenous pioneers were offered just $190 each and could not wear their country’s colours. Fifty years on, they’re getting the recognition they deserve.","content":"Aboriginal and Torres Strait Islander readers are warned that the following article contains images of deceased persons. Fifty years ago a collection of shearers, labourers and footballers boarded a plane at Mascot airport for rugby league’s version of cricket’s fabled 1868 Indigenous tour of England. The 1973 Indigenous All Stars team at Mascot airport ahead of their historic trip to New Zealand. Credit: Victor Wright snr Unlike their cricketing counterparts, the 1973 Aboriginal All Stars went largely sight unseen in wider rugby league circles, both at the time of their landmark tour to New Zealand and in the decades since. Until now. Half a century after being emphatically denied the chance to wear green and gold by the ARL, and offered just $190 in tour funding by the governing body, the original Indigenous All Stars will finally have the red carpet rolled out for them. “Not being able to wear green and gold back then, that hurt like nothing else,” Ron Mason, one of the touring All Stars captains and an icon of south coast rugby league, says. The 1973 Indigenous All Stars face up to their Kiwi opponents. Credit: Victor Wright snr “There was a lot of racism in footy back then of course so we shouldn’t have been that surprised, but we went and represented our people. And the memories and bond of that tour still stick with all of us today.” Surviving members and families of the touring party — which included famous names like Mundine, Tallis and Widders — will finally be presented with commemorative green and gold jerseys this year. Thirteen players and officials able to travel will be feted in Rotorua during All Stars week, joining the current side as the NRL rolls out long-overdue acknowledgment for one of the most significant teams in Indigenous rugby league history. ‘More recognition in New Zealand than we did in our own country’ Conceived during the early days of the Koori Knockout competition, Indigenous officials began plotting a 10-day, nine-game tour from Auckland to Christchurch in late 1972. They did so with little help from rugby league’s top brass, and active opposition when it came to wearing traditional colours, largely because the ARL was not involved in selecting the sides. “The ARL didn’t want a bar of it, there was no way we were going to be wearing the national colours on their watch,” Dr Bob Morgan OAM, one of the tour managers, says. “Of course, you couldn’t get more Australian than this mob, could you? They offered us $190 as an afterthought, which was sad because this was the equivalent of the first Indigenous cricket tour 100 years earlier.” ‘Most of the boys were terrified on that plane, let me tell you.’ Famed Indigenous activist Charlie Perkins is lauded by surviving players as the “angel of a man” who helped secure $14,000 in funding for the tour through the National Aboriginal Sports Foundation. Probables v Possibles matches were played up and down Queensland and NSW, with the sky blue and maroon eventually paired as the colours of the tourists’ uniform at the suggestion of TV pundit and dual international Rex Mossop. “Just like the 1908 Australian team, of course, even though we weren’t allowed to wear the green and gold,” prop Victor Wright jnr chuckles. With Rabbitohs and Indigenous legend Eric Simms helping to pick the side and a 30-strong playing contingent featuring two players from the Northern Territory, and the wider touring party including a baby relative of tour manager Douggie Scott, the Aboriginal All Stars took flight. Terry Wickey clears a scrum for Penrith in 1979, with Arthur Beetson watching on. Credit: Fairfax Media “And most of the boys were terrified on that plane, let me tell you,” Morgan laughs. “No one had passports back then so it helped that we were travelling in a big group, but that’s just how it was for a lot of fellas back then. Rugby league opened a lot of doors for people, and at that time we found much more recognition in New Zealand than we did in our own country.” With players like Mason (Panthers), Bruce Stewart (Roosters) and Wally Tallis, father of Queensland’s Gorden, joined by future first-graders Ambrose Morgan and Thomas Moylan (Rabbitohs) and Terry Wickey (Panthers and Raiders), the tourists’ top side was competitive to say the least. Kiwi audiences remain stunned that flying winger Mickey Mundine — uncle to Anthony — never played first grade. He still can’t quite believe the size of his Maori opponents. The All Stars team touches down in New Zealand. Credit: Victor Wright snr “One leg on them would be twice the size of both of mine!” The Indigenous players remember their team bus being greeted by massive crowds as they covered more than 12,000 kilometres, traditional hangis and cultural receptions wherever they went. In return, the tourists’ own troupe of traditional dancers from the Northern Territory would offer their own rain dances in response to thundering hakas from the locals. “They’d been in drought all summer, so when it rained straight afterwards, those boys were the most popular people in the country,” Wright says. “There was so much rain in Rotorua that the roads were completely flooded, and we had to go the long way around.” Dean Widders grew up with stories of the tour from his uncle Bill, and points to the formation of all-Indigenous teams like the Moree Boomerangs off the back of the 1973 pioneers. “Rugby league has always led the way for Indigenous people and been part of our identity,” Widders says. Months of painstaking research by the NRL’s Alanah Scholes and Corey Rosser and subsequent ringarounds have reconnected old teammates, unearthed forgotten photos and documents and helped bridge a gap that was allowed to widen for decades. Aboriginal All Stars Don Carter and Victor Wright jnr (right). Credit: Victor Wright snr “Rugby league was a way for our mob to leave the reserves and missions, playing the game offered freedom of movement at the time,” Scholes says as both the daughter of Victor Wright and the NRL’s Reconciliation Action Plan manager. “The history of the game and our people, rugby league brought people together and allowed us to be treated as people. “This team wanted to represent their country and wear those colours proudly. Unfortunately they weren’t able to, so it’s important we acknowledge them.” For Morgan and the players still around, the long-overdue recognition means the world. “It’s a little bit like the apology from Kevin Rudd in 2008,” Morgan says. “We can’t change the past, but it’s important to learn from it and this team helped change rugby league and life in general for Indigenous people in this country.” Sports news, results and expert commentary. Sign up for our Sport newsletter .","pubDate":"2023-02-05 18:00:00","image_url":null,"source_id":"smh","category":["sports"],"country":["australia"],"language":"english"},{"title":"Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations","link":"https://www.firstpost.com/firstcricket/sports-news/delhi-house-court-favours-shikhar-dhawan-orders-ex-wife-to-avoid-making-defamatory-allegations-12107022.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations","content":"Cricket Delhi House Court favours Shikhar Dhawan, orders ex-wife to avoid making defamatory allegations Shikhar Dhawan was left with no other option but to ask for the court’s intervention and seek a legal injunction after his wife had shared false messages to several people including the Delhi Capitals owner. FirstCricket Staff February 5th, 2023 23:12:22 IST Shikhar Dhawan and his ex-wife in a file image. Screengrab from Twitter video The Patiala House Court in New Delhi District ruled in cricketer Shikhar Dhawan’s favour and ordered his now estranged wife Aesha Mukherji to not share anything on social media that is defamatory to the cricketer. The court also categorically denied Mukherji to not speak to friends, relatives, media, or any other person in a manner that could tarnish Dhawan’s reputation. The House Court, however, asked Aesha – an Australian citizen – to take the legal route and voice her grievances (if any) to competent authorities in India or Australia. “Reputation of a person is dear to everyone and is considered as property of highest degree because materialistic property can be regained after loss but reputation cannot be regained once damaged. Therefore, it has got to be protected. However, it is equally true that if anyone has a lawful grievance against someone, he or she cannot be restrained from venting out his or her grievance to the concerned authority,” Bar and Bench quoted the judge saying in the order passed on 1 February. “Therefore, in these circumstances, she is hereby restrained till further order from circulating any of her grievance against Dhawan or her version of the dispute involved herein or the alleged defamatory and false material against him, to social media, to print media, or to any other’ forum or to friends, relatives or colleagues of the parties,” the judge added. Delhi court restrains estranged wife of Shikhar Dhawan from making defamatory allegations against the cricketer report by @NarsiBenwal #ShikharDhawan @SDhawan25 https://t.co/5MWVV4gEUe — Bar & Bench (@barandbench) February 4, 2023 The decision came after Dhawan had filed a plea seeking an injunction against Mukherji. Dhawan had claimed that Mukherji had been threatening him that she would tarnish the cricketer’s reputation and ruin his career, circulating some information to everyone. Dhawan, in his plea, claimed that Mukherjee had already shared several messages to a few people including the owner of Delhi Capitals Dheeraj Malhotra, alleging that he did not give her any money and that she was compelled to take money from her daughter’s boyfriend. Dhawan, on the contrary, shared details and pointed out that he had been paying Australian dollars 17,500 each month for school fees, uniforms, and other stuff. Consequentially, Dhawan was left with no other option but to ask for the court’s intervention and seek a legal injunction against such false and negative publicity that would tarnish his reputation and stature as an international cricketer. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: February 05, 2023 23:12:22 IST Tags: Cricket Shikhar Dhawan Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-02-05 17:42:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/02/Shikhar-Dhawan.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"How India-Pakistan cricket thrived in Pervez Musharraf's rule","link":"https://timesofindia.indiatimes.com/sports/cricket/news/how-india-pakistan-cricket-thrived-in-pervez-musharrafs-rule/articleshow/97627117.cms","keywords":null,"creator":null,"video_url":null,"description":"Pakistan's former military ruler Pervez Musharraf, the architect of the Kargil War in 1999, loved his cricket. Musharraf, who passed away in a Dubai hospital on Sunday, used cricket as a strong diplomatic tool to improve relations between the two countries when he led Pakistan first as Chief Executive and then President.","content":"KARACHI: Pakistan's former military ruler Pervez Musharraf , the architect of the Kargil War in 1999, loved his cricket. Musharraf, who passed away in a Dubai hospital on Sunday, used cricket as a strong diplomatic tool to improve relations between the two countries when he led Pakistan first as Chief Executive and then President. An avid follower of the game, Musharraf wasted no time in bringing his blue eyed boy, Lt-General Tauqir Zia , as chairman of the cricket board soon after his military coup in October 1999. But in 2003 the moment he learnt that Tauqir's son Junaid had played for Pakistan, Musharraf asked the PCB chairman to resign as he saw the entire episode as a conflict of interest. Musharraf then brought in former career diplomat and ex foreign secretary, Shaharyar Khan , who had served as ambassador in New Delhi, to head the cricket board. And a few months later, Shaharyar fulfilled Musharraf's ambition of having the Indian team tour Pakistan. Before Musharraf's coup, Pakistan had been to India in early 1999 when Atal Bihari Vajpayee was Indian Prime Minister but after that there were no bilateral exchanges between the two countries until 2004. The Indian team led by Saurav Ganguly came in March-April 2004 and it turned out to be a famous diplomatic success for the military ruler as the top names from India including government ministers and celebrities were invited to Pakistan to watch the matches with red carpet treatment laid out for them. The tour was a success with Musharraf wasting no opportunity to have photo shoots with the Indian team and his famous remarks about MS Dhoni's hairstyle became a hit in both countries. His meeting with the Indian team players were all exercises aimed at softening relations between the two countries and to portray himself as a moderate and liberal leader. And the plan worked to a great extent as never in the tenure of a Pakistani premier or President did so many Indo-Pak bilateral series take place than in Musharraf's tenure. After the 2004 series, India came again to Pakistan in early 2006 while the Pakistan team also toured India for full Test series first in 2005 and then in 2007 returning to Pakistan in 2008 for the Asia Cup. Before Musharraf's time, bilateral tours between the two countries had been far and few with huge gaps in between. Pakistan went to India in 1979-80 after a gap of nearly 18 years and India came to Pakistan in 1978/79 for the first time since 1954/55. Ironically these tours in the late 70s also took place during the tenure of another military dictator, General Zia ul Haq , who also used cricket diplomacy to reduce tensions. Musharraf himself wasted no opportunity to show up at cricket matches even in India when Pakistan was playing. In 2005, he turned up at the Feroze Shah Kotla ground to a warm welcome.","pubDate":"2023-02-05 17:28:38","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"1st Test, Day 2: Maiden ton for Tagenarine Chanderpaul against Zimbabwe","link":"https://timesofindia.indiatimes.com/sports/cricket/news/1st-test-day-2-maiden-test-ton-for-tagenarine-chanderpaul-against-zimbabwe/articleshow/97627046.cms","keywords":null,"creator":null,"video_url":null,"description":"Tagenarine Chanderpaul struck his first Test century and fellow opener Kraigg Brathwaite also reached three figures as the West Indies reached 221 without loss on Sunday after a rain-affected second day of the first Test against Zimbabwe in Bulawayo. Captain Brathwaite recorded his 12th Test ton as he made 116 while Chanderpaul, son of West Indies great Shivnarine, closed on 101.","content":"BULAWAYO: Tagenarine Chanderpaul struck his first Test century and fellow opener Kraigg Brathwaite also reached three figures as the West Indies reached 221 without loss on Sunday after a rain-affected second day of the first Test against Zimbabwe in Bulawayo. Captain Brathwaite recorded his 12th Test ton as he made 116 while Chanderpaul, son of West Indies great Shivnarine, closed on 101. It is the highest opening partnership by West Indians since Chris Gayle and Kieran Powell scored 254 against New Zealand in Antigua 11 years ago. Saturday's play had been abandoned because of rain soon after lunch with the tourists 112-0 and the inclement weather intervened again. Play was only able to start at 1500 local time (1300 GMT) on Sunday after sawdust had been scattered across the damp areas in the outfield. As was the case on the opening day, the West Indies openers took few chances, scoring at fewer than two and half runs per over against some tight Zimbabwe bowling on a sluggish pitch. Brathwaite, who has been in a rich run of form, looked the more comfortable and was the first to reach his century. By the close he had faced 246 balls and hit seven fours. Chanderpaul was more circumspect although there were moments when he played like his father who only retired from Test cricket eight years ago, having racked up 30 centuries in 164 Tests. While it took his father 19 Tests to reach his first century, Chanderpaul junior has needed just three. The 26-year-old left-hander only made his debut in Perth against Australia in November when he scored 51 and 45. He followed that with 47 and 17 in Adelaide and looked at home alongside Brathwaite in Bulawayo. He struck 10 fours and a six during the course of his innings, bringing up his century with a neat tuck behind square for a single. \"He (Chanderpaul) looks to be world-class and is a top opener,\" said Brathwaite at the close. \"Glad we have got some big partnerships thus far and would love to continue.\" Each of the Zimbabwe bowlers deserves credit for keeping a tight rein on the West Indies scoring, spinner Wellington Masakadza conceding just 30 runs from a tight 16 overs which included six maidens. The match, which is the first for the West Indies with Brian Lara acting as performance mentor, is the first of two in a Test series in Bulawayo. The second is scheduled to start on February 12.","pubDate":"2023-02-05 17:19:31","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Big steps for Asians in UFC","link":"https://businessmirror.com.ph/2023/02/06/big-steps-for-asians-in-ufc/","keywords":["Column","Sports","Featured"],"creator":["BusinessMirror"],"video_url":null,"description":"INDIAN mixed martial arts fighter Anshul Jubli knocked out Indonesian Jeka Seragih in the second round of their light heavyweight match at UFC Fight Night Sunday.","content":"INDIAN mixed martial arts fighter Anshul Jubli knocked out Indonesian Jeka Seragih in the second round of their light heavyweight match at UFC Fight Night Sunday. Jubli is only the second India born fighter to enter the world famous Octagon and the first to win a match. His predecessor Bharat Khandare lost his first and only fight (after which he was suspended and eventually released for doping). Jubli fought in the Road to the UFC that was rolled out prior to UFC 280 in Singapore in June of 2022. Although with his advancing to the finals of the Road to the UFC, he and Seragih were able to secure UFC contracts. The win solidifies Jubli’s place as he has won three of his fights (including two in the Road to the UFC) in the world’s top combat sports organization. The fighter from Uttrakashi, Jubli was tabbed as an underdog as his Indonesian foe knocked out all his three opponents heading into this UFC Fight Night clash. But Jubli battered Seragih to earn the win. And it was instant karma for the Indonesian whose childish antics including sticking out his tongue at the Indian totally backfired on him. “India is here,” exclaimed Jubli to the UFC Apex crowd and to Bleachers’ Brew. What he is doing for Indian mixed martial arts is massive. While cricket and chess are the top sports in India with basketball and football growing, Jubli asserts that wrestling, boxing and mixed martial arts are on the rise. A victory would certainly generate more interest in combat sports and the UFC. And now Anshul is 7-0 in his MMA career. During an exclusive interview with Jubli—who I specifically asked for—he was humble at all times. Never boasted about anything despite the fact that he was undefeated heading into his first official UFC match. Jubli told Bleachers’ Brew: “I hope to be for India what Manny Pacquaio was for Filipinos.” While Manny wasn’t the first Filipino world boxing champion, he is by far the most accomplished and famous. No doubt, inspiring many many more to follow in his footsteps. I took special interest in this particular match between Jubli and Seragih because it was between two Asian fighters. The Road to UFC program was specifically for Asian fighters and two Filipinos participated in the tournament. Unfortunately, both got booted out after their very first fight. One of those fighters, John Adajar, looked like he was going to beat his Korean foe, Han Seul Kim, as he staggered him on a couple of occasions. But a mistake committed by Adajar when he got to the canvas saw him tap out due to a triangle armbar. Watching that live as it happened, I thought that the mis take was also because wrestling and jiu jitsu are not natural sports to Filipinos. I had a feeling that if his Korean foe got him to the mat, he could reverse the tide. That was one time I hoped I was wrong. The Filipinos who have done well in the UFC are all Fil-Ams. Like Anshul Jubli, I am waiting for the first homegrown star to make an impact; a real significant impact in the UFC. Week in and out, as much as I enjoy interviewing the top fighters in the world, I always will have an interest in Asian fighters. And speaking of Asian fighters, Filipino-Australian Josh Culibao (10-1-1) will be fighting this coming UFC 284 (February 12 in Australia). He will be up against Armenian Melsik Baghdasaryan (7-1-0) in a featherweight match in the preliminary rounds. Culibao is 2-1-1 in the UFC. A win will certainly boost his stock in the UFC. However, it will not be an easy fight as the Armenian is also 2-0 in the UFC. Next week is going to be exciting. Now, I would love to also see the effect of Anshul Jubli’s win in India that is targeted as the next big thing after China in terms of being a global economic power, sports and culture.","pubDate":"2023-02-05 16:09:00","image_url":null,"source_id":"businessmirror","category":["sports"],"country":["philippines"],"language":"english"},{"title":"Faf du Plessis powers Joburg Super Kings into SA20 semi-finals","link":"https://www.iol.co.za/sport/cricket/domestic/faf-du-plessis-powers-joburg-super-kings-into-sa20-semi-finals-c9d848bd-85e1-44f5-9686-562102816b62","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Faf du Plessis scored a brilliant 92 off 61 balls as Joburg Super Kings beat Sunrisers Eastern Cape to book their spot in the semi-finals of the SA20.","content":"Johannesburg — Faf du Plessis sent another timely reminder to the Proteas selectors that he remains one of the premier limited-overs batters in the world at a raucous Wanderers on Sunday. Du Plessis followed his maiden Betway SA20 century with another T20 masterclass as his 92 off 61 balls booked the Joburg Super Kings’ place in the semi-finals later this week. The former Proteas captain looked a class apart from the other batters on show as he still managed to time the ball sweetly on a sluggish Wanderers pitch. He also once again dominated the 119-run opening stand with Reeza Hendricks as the latter played a supporting hand with 40 off 36 balls. It followed their 157-run partnership against Durban’s Super Giants. An illustration of how tough the surface was to bat was illustrated after Hendricks’ departure. The Sunrisers reigned in the JSK batting unit as the home team managed just a further 41 runs in 5.4 overs while losing five wickets to finish on 160/6. Proteas seamer Sisanda Magala (2/24) was excellent during this period, while captain Aiden Markam (2/7) picked up the Super Kings’ new Aussie recruit Matthew Wade and Donovan Ferreira in a golden over. The Sunrisers’ chase began in the worst possible fashion with the Super Kings dominating the PowerPlay. The visitors lost three crucial wickets for just 29 runs with Adam Rossington (1), Jordan Hermann (5) and JJ Smuts (0) being dismissed cheaply. Super Kings tearaway Gerald Coetzee was certainly charging in at the Bullring as he beat both Hermann and Smuts for pace. Throughout this frenetic period for the Sunrisers, it was Temba Bavuma that maintained his composure though. The Proteas limited-overs captain was fresh off a golden duck in Betway SA20 debut, but he looked much more assured on his beloved Wanderers patch. Bavuma kept the Sunrisers’ flame alive with a 34-ball 50 (5x4, 2x6) that was highlighted with a sweet maximum over mid-wicket off Romario Shepherd. Unfortunately for Bavuma and the Sunrisers there was no further support besides Aiden Markram’s 34 as Super Kings debutant Kyle Simmonds ran through the visitors’ middle-order as the visitors finished on 136/9. Simmonds showed great control from the Corlett Drive End to finish impressive figures of 3/24 before Maheesh Theekshana took over to complete the job with 2/31. Scorecard Joburg Super Kings: 160/6 (Du Plessis 92, Hendricks 40, Magala 2/24, Markram 2/7) Sunrisers Eastern Cape: 136/9 (Bavuma 50, Markram 34, Simmonds 3/23, Theekshana 2/31) Super Kings won by 24 runs @ ZaahierAdams IOL Sport Share","pubDate":"2023-02-05 15:34:04","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/b7a0cb50-1e1d-5953-9708-61298200de33&operation=CROP&offset=0x150&resize=2399x1350","source_id":"iol","category":["sports"],"country":["south africa"],"language":"english"}]}