{"newsArray":[{"title":"Cricket: Devon Conway leads Black Caps to first ODI win in Pakistan in more than 26 years","link":"https://www.newstalkzb.co.nz/news/sport/cricket-devon-conway-leads-black-caps-to-first-odi-win-in-pakistan-in-more-than-26-years/","keywords":null,"creator":null,"video_url":null,"description":"New Zealand’s spinners strangled Pakistan on a turning wicket to win the second ODI by 79 runs today and level the three-match series 1-1. Devon Conway hit a brilliant 101 and captain Kane Williamson scored 85 before New Zealand lost nine wickets for 78 runs and got bowled out for 261 against the leftarm spin of Mohammad Nawaz (4-38) and fast bowler Naseem Shah (3-58). Williamson perfectly outmanouvred Pakistan on the wicket and included an additional spinner Ish Sodhi in place of fast Henry Shipley to bowl out the home team for 182 in 43 overs. It is New Zealand’s fourth ever ODI win against Pakistan on home soil and first since December 1996, with this tour ending a 20-year gap between trips to Pakistan. Captain Babar Azam fought the lone battle for his 79 off 114 balls before Sodhi (2-38) wrapped up the game by having Babar stumped through some smart glove work behind the wicket from Tom Latham, and No. 11 Haris Rauf holed out at long off without scoring. “We had Ish Sodhi, who has been bowling really well,” Williamson said. “We knew it would be a tough chase. We knew we had to get little bit out of the surface … and got to a par total in the end.” Pakistan won the first match by six wickets and the teams will now meet in the series-decider on Friday at the same venue. “When the spinners came on, it was turning sharply,” Babar said. “The pitch in Karachi is always better in the second innings, but played differently today and the spinners were getting a lot more help.” Earlier, Naseem yet again gave Pakistan a perfect start when he had Finn Allen dismissed in his first over. But Conway and Williamson showed lot of aggression against pace and spin with Pakistan’s fielders missing a number of chances. Nawaz dropped a difficult return catch when Conway was on 29. Williamson was twice dropped in the space of Mohammad Wasim’s four deliveries soon after he completed his half century when first Haris Sohail couldn’t hold on to a sharp catch over his head at short midwicket and then Mohammad Rizwan dropped a low catch down the leg side as the ball brushed Williamson’s gloves. Conway accelerated more after completing his half century off 57 balls and needed a further 32 balls to raise his hundred as both batters bettered New Zealand’s previous best second wicket-stand of 159 against Pakistan in an ODI shared between Williamson and Martin Guptill at Auckland in 2016. But Pakistan came back strongly through Nawaz once Naseem returned and had Conway clean bowled with the ball that just moved enough to knock back the lefthander’s off stump in the 30th over. Nawaz dismissed Daryl Mithcell, Latham, Glenn Phillips and also knocked back the top of Williamson’s stumps as he conceded just 14 runs in his last five overs and claimed four wickets. Mitchell Santner played a little cameo of 37 off 42 balls and helped New Zealand cross the 250-run mark before he got run out off the penultimate ball. Pakistan couldn’t recover once it lost Fakhar Zaman and Imam-ul-Haq for only nine runs against Tim Southee and the pace of Lockie Ferguson, who beat Imam with a 152kph short-pitched ball and had him caught off a top-edge. New Zealand spinners Michael Bracewell (1-29) and Santner (1-34) then got plenty of assistance off the wicket and didn’t allow even the experienced Babar to score freely before Pakistan got bowled out with seven overs to spare. Conway said after the win that Williamson played a big part in his century when he felt under pressure. “We certainly were targeting 300, especially in the position we were in. That partnership that Kane and I put on was crucial for the team. Losing Finn Allen quite early put us under a little bit of pressure but luckily Kane and I steadied the ship a little bit. “I’ve got to give a lot of credit to Kane. There was a few times during my innings where I felt under pressure. I felt I was going to play a loose shot and he keep saying to me ‘just hang in there. Keep looking straight and be patient. If it’s going to be tough now it’s still going to be tough later’. So, a lot of credit goes to Kane,” he said.","content":null,"pubDate":"2023-01-11 21:30:00","image_url":"https://www.newstalkzb.co.nz/media/qumcq0it/new-zealands-devon-conway-celebrates-after-scoring-his-second-odi-century-ap.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Cricket fan pulls off incredible one-handed catch in stands before taking plaudits","link":"https://www.mirror.co.uk/sport/cricket/cricket-catch-t20-south-africa-28932181","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Fraser Watson)"],"video_url":null,"description":"The SA20 clash between the Joburg Super Kings and Durban Super Giants went down to the final over, but it was a spectator who stole the show with an amazing catch","content":null,"pubDate":"2023-01-11 20:43:29","image_url":"https://i2-prod.mirror.co.uk/incoming/article28932462.ece/ALTERNATES/s615/0_MIRRORCRICKETCATCH.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"&#8220;We&#8217;ve the best seats in the house&#8221; - Alan Neill on umpiring and helping the next generation","link":"https://www.cricketireland.ie/news/article/weve-the-best-seats-in-the-house-alan-neill-on-umpiring-and-helping-the-nex","keywords":null,"creator":null,"video_url":null,"description":"Umpires are an essential part of our game and over the next couple of months IACUS (Irish Association of Cricket Umpires and Scorers) will be running cricket umpire courses that aim to attract and grow the pool of new umpiring talent in Ireland. And the training is being led by one of Ireland's best, Alan Neill.","content":null,"pubDate":"2023-01-11 15:30:28","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Tickets for Ind vs NZ ODI match in Hyderabad to be sold online","link":"https://telanganatoday.com/tickets-for-ind-vs-nz-odi-match-in-hyderabad-to-be-sold-online","keywords":["Hyderabad","News","Sport","India","New Zealand"],"creator":["Telangana Today"],"video_url":null,"description":"Speaking to media on Wednesday, the former Indian captain said that they will not sell the tickets off-line and fans can buy tickets on Paytm.","content":"Hyderabad: Taking a cue from the ticketing fiasco at the Gymkhana in September for the India vs Australia match that left scores injured while trying to buy tickets, the Hyderabad Cricket Association president Mohd Azharuddin revealed that the tickets for the upcoming India vs New Zealand ODI, scheduled to be held at the Rajiv Gandhi International Cricket Stadium on January 18, will be sold online alone from January 13. Speaking to media on Wednesday, the former Indian captain said that they will not sell the tickets off-line and fans can buy tickets on Paytm. Hyderabad is hosting an ODI match after a gap of four years and the officials said they are making all arrangements to make the match a grand success. The fans, who buy tickets online, must collect the physical tickets at LB Stadium and Gachibowli Stadium from January 15 to 18 from 10 am to 3 pm. The ticket will be sold online from January 13 to 16 in installments. 6,000 tickets will go on sale on January 13 while seven thousand tickets will go on sale on each day on January 14 and 15. The remaining tickets will be sold on January 16. The capacity of the stadium is 39,112 while 29,417 tickets will be put on sale. One can buy up to four tickets online. New Zealand will have their first practice session on January 15 while the Indian team will arrive in the city on January 16.  ","pubDate":"2023-01-11 14:42:46","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"The Spin | Here’s the catch: cricket’s unique moment is being lost in all the angles","link":"https://www.theguardian.com/sport/2023/jan/11/heres-the-catch-cricket-unique-moment-is-being-lost-in-all-the-angles-spin","keywords":["Cricket","Australia cricket team","South Africa cricket team","Australia sport","Sport"],"creator":["James Wallace"],"video_url":null,"description":"Third umpire rulings in Sydney casting doubt on three big moments highlight the way technology is killing the thrillThere’s a feeling on a cricket field that is unlike any other. Players at all levels go misty-eyed and weak at the knees when they try to describe it. If you’ve played the game at some point then maybe you’ve experienced it too? Can you guess?The pinched single on 99 to bring up a hard-earned hundred? Nope. The surge of joy upon hearing the ball scud into the stumps? Afraid not. That feeling that courses through hands, wrist and then gut when you connect with a ball so sweetly it soars for six? Nah. Continue reading...","content":null,"pubDate":"2023-01-11 12:15:16","image_url":"https://i.guim.co.uk/img/media/12b77c100a3aebb3e5ee7e0c80d81d8774aec743/0_25_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=3772d99c98e4157fe6302a0ecea450cb","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"ICC Latest Rankings: Virat Kohli, Rohit Sharma and Usman Khwaja make notable gains | READ","link":"https://www.indiatvnews.com/sports/cricket/icc-latest-rankings-virat-kohli-rohit-sharma-and-usman-khwaja-make-notable-gains-test-odi-t20i-t20-ind-vs-sl-pak-vs-nz-aus-vs-sa-2023-01-11-838384","keywords":null,"creator":null,"video_url":null,"description":"ICC Latest Rankings: Earlier today the International Cricket Council (ICC) announced the latest rankings and it has brought in some very good news for the Indian and the Aussie batters. Australian left-handed batter Usman Khwaja made huge gains owing to his stellar ton against South Africa in the third Test match in Sydney. Interestingly Khwaja remained unbeaten on 195 as skipper Pat Cummins declared the innings to keep the contest alive in a rain-hit match.","content":null,"pubDate":"2023-01-11 11:38:50","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant won't played in IPL 2023, confirms Sourav Ganguly","link":"https://www.thehansindia.com/sports/cricket/rishabh-pant-wont-played-in-ipl-2023-confirms-sourav-ganguly-777261","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Rishabh Pant met with a car accident last monthHe is currently being treated at Kokilaben Ambani Hospital Pant has undergone knee surgery in Mumbai","content":"Rishabh Pant won’t played in IPL 2023, confirms Sourav GangulyRishabh Pant won’t played in IPL 2023, confirms Sourav GangulyFormer Board of Control for Cricket in India (BCCI) chief Sourav Ganguly has confirmed Rishabh Pant will miss the Indian Premier League (IPL) 2023 and his absence will affect Delhi Capitals (DC).Pant met with a freak accident last month on the Delhi-Dehradun highway when his Mercedes collided with a road divider. While Pant jumped out of the car, the vehicle soon burst into flames. The wicketkeeper-batsman is being treated at the Kokilaben Ambani Hospital, and his ligament injury is expected to heal in three to four months. The IPL 2023 season is set to begin in the last week of March. If Pant, the captain of DC, cannot compete in the upcoming season, Australia's David Warner is expected to lead the side. Warner previously was the captain of Sunrisers Hyderabad (SRH), who won the coveted title in 2016 under Warner's leadership. \"It will take time to heal. We cannot do anything. It's an accident. He is just 23. He has got a lot of time. Rishabh Pant will not be available for the IPL. I am in connection with DC. It will be a great IPL. We will do well. Pant's injury will affect DC,\" Ganguly told reporters in Kolkata.Meanwhile, Ganguly, who stepped down as BCCI president last year, is expected to join DC as Director of Cricket. Last year, Pant-led DC failed to make it to the playoffs, finishing fifth in the table with 14 points.Soon after the accident, Pant was taken to Dehradun's Max Hospital, where he received emergency care before the BCCI airlifted him to Mumbai for further treatment.\"Rishabh has two cuts on his forehead, a ligament tear in his right knee and has also hurt his right wrist, ankle, toe and has suffered abrasion injuries on his back,\" the BCCI said in a statement last week. Dr Dinshaw Pardiwala operated on Pant at the Kokilaben Dhirubhai Ambani Hospital in Mumbai. His knee surgery was complex as it involved both ACL & MCL surgeries.\"Rishabh Pant has successfully undergone knee ligament surgery on Friday. He will be under observation. Further course of action and rehabilitation will be advised by Dr. Dinshaw Pardiwala and followed by the BCCI sports science and medicine team,\" a BCCI source was quoted as saying in an interview.Pant was not part of the India squads for the T20I and ODI home series against Sri Lanka. He was due to head to the National Cricket Academy (NCA) in Bengaluru for strength and conditioning before the Border-Gavaskar Trophy in February.The 25-year-old Indian cricketer last played in the Test series in Bangladesh, which India won 2-0.","pubDate":"2023-01-11 11:19:10","image_url":"https://assets.thehansindia.com/h-upload/2023/01/11/500x300_1329461-sourav-ganguly.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"PCB में Babar Azam के खिलाफ हो रही है साजिश! पूर्व पाकिस्तानी कप्तान मिसबाह-उल-हक का बड़ा दावा","link":"https://sports.ndtv.com/hindi/cricket/theres-attempt-to-weaken-babar-azams-position-former-pakistan-captain-misbah-ul-haq-claims-3683002#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"पाकिस्तान के सबसे सफल टेस्ट कप्तान मिसबाह उल हक (Misbah-ul-Haq) का मानना ​​है कि लगातार बदलावों ने टेस्ट टीम को कमजोर और परेशान कर दिया था और यह हाल के दिनों में इंग्लैंड (PAK vs ENG) और न्यूजीलैंड के खिलाफ (PAK vs NZ) टीम के कमजोर प्रदर्शन में दिखा.","content":"Pakistan Cricket: पूर्व कप्तान और कोच मिसबाह उल हक (Misbah-ul-Haq) का मानना है कि पाकिस्तान क्रिकेट बोर्ड (PCB) में कुछ लोग मौजूदा कप्तान बाबर आजम (Babar Azam) की स्थिति को कमजोर करने की कोशिश कर रहे हैं. उन्होंने साथ ही कहा कि इससे टीम के ड्रेसिंग रूम पर प्रतिकूल प्रभाव पड़ेगा.मिसबाह ने मंगलवार को लाहौर में संवाददाताओं से कहा, “क्रिकेट मेरे खून में है और मैं हर समय क्रिकेट मैच देखता हूं और क्रिकेट के बारे में पढ़ता हूं. और मैं देख रहा हूं कि टीम में बाबर आजम की स्थिति कमजोर हो रही है.”बोर्ड के साथ तीन साल का अनुबंध होने के बावजूद मिसबाह को सितंबर 2021 में पूर्व अध्यक्ष रमीज राजा (Ramiz Raja) ने मुख्य कोच के रूप में इस्तीफा देने के लिए कहा था. मिसबाह ने कहा कि बाबर की प्रेस कॉन्फ्रेंस देखकर कोई भी इसे आसानी से देख सकता है.उन्होंने कहा, “उनसे पूछे जा रहे कुछ सवालों को देखें जो संकेत देते हैं कि एक कप्तान के रूप में उन्हें कमजोर किया जा रहा है और मुझे डर है कि इसका टीम के ड्रेसिंग रूम पर प्रतिकूल प्रभाव पड़ेगा.”* VIDEO: मोहम्मद शमी ने नॉन स्ट्राइक में खड़े दासुन शनाका को आउट किया, रोहित शर्मा ने वापस ली अपील* Video: “मैं हमेशा के लिए नहीं खेलने वाला हूं..”, विराट कोहली ने मैच के बाद ऐसा कह कर बढ़ाई फैंस की धड़कनेंसाल 2019-2020 में मुख्य कोच और मुख्य चयनकर्ता के शक्तिशाली पदों पर रहे मिसबाह ने कहा कि अगर क्रिकेट बोर्ड (PCB) को बाबर (Babar Azam) की कप्तानी के साथ समस्या है तो उन्हें उसके और चयनकर्ताओं के साथ बैठकर इस पर चर्चा करनी चाहिए.मिस्बाह ने कहा, “अगर आप इस तरह किसी पर दबाव बनाते हैं तो इससे टीम को परेशानी होगी और यह पाकिस्तान क्रिकेट के लिए अच्छा नहीं है.”पाकिस्तान के सबसे सफल टेस्ट कप्तान का मानना ​​है कि लगातार बदलावों ने टेस्ट टीम को कमजोर और परेशान कर दिया था और यह हाल के दिनों में इंग्लैंड (PAK vs ENG) और न्यूजीलैंड के खिलाफ (PAK vs NZ) टीम के कमजोर प्रदर्शन में दिखा.उन्होंने कहा, “काफी मेहनत और समय के बाद टेस्ट टीमें बनाई जाती हैं और बार-बार बदलाव से मदद नहीं मिलती. हमारी टेस्ट टीम अच्छी थी लेकिन बदलावों ने सब कुछ बिगाड़ दिया.”उन्होंने अंत में कहा, \"पाकिस्तान के पास सफेद गेंद की बहुत अच्छी टीम है, इसलिए कम से कम उन प्रारूपों में उन्हें कोई समस्या नहीं है. मैं व्यक्तिगत रूप से अंत तक बाबर का समर्थन करूंगा.\"* IND vs SL: उमरान मलिक ने स्पीड गन में खुद को पछाड़ा, सबसे तेज गेंद फेंक कर बनाया नया रिकॉर्डVirat Kohli ने श्रीलंका के खिलाफ पहले वनडे में शानदार शतक जड़कर बनाया बड़ा रिकॉर्ड","pubDate":"2023-01-11 11:13:15","image_url":"https://c.ndtvimg.com/2023-01/tpu21nv_babar-azam_625x300_09_January_23.jpg?im=FeatureCrop,algorithm=dnn,width=806,height=605","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"\"I'm The Worst Player Around...\": Kohli On How He Overcame His Lean Patch","link":"https://sports.ndtv.com/cricket/im-the-worst-player-around-virat-kohli-on-how-he-overcame-his-lean-patch-3681900","keywords":null,"creator":null,"video_url":null,"description":"After smashing his 73rd international ton, Virat Kohli opened up on expectations during his lean run in international cricket","content":null,"pubDate":"2023-01-11 11:00:25","image_url":null,"source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"SA20: Good news for Mumbai Indians ahead of IPL 2023 | READ","link":"https://www.indiatvnews.com/sports/cricket/sa20-good-news-for-mumbai-indians-ahead-of-ipl-2023-dewald-brevis-jofra-archer-updates-paarl-royals-mi-cape-town-2023-01-11-838351","keywords":null,"creator":null,"video_url":null,"description":"SA20: Cricket South Africa has finally joined the trend of franchise cricket. Their league SA20 has finally started and the craze is expected to catch up in the upcoming days. The first match was an absolute thriller and it was witness to a few records that were made and broken. Interestingly, it is majorly the Indian Premier League franchise owners who have a stake in Cricket South Africa's T20 league. The franchise owners of IPL will certainly have their eyeballs set on this league. ","content":null,"pubDate":"2023-01-11 10:21:13","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"First-class cricket में सबसे तेज तिहरा शतक लगाने वाले टॉप 5 भारतीय बल्लेबाज, जानें पहले नंबर पर कौन है..","link":"https://sports.ndtv.com/hindi/cricket/fastest-triple-hundred-in-first-class-cricket-of-indian-cricketers-prithvi-shaw-rohit-sharma-virendra-sehwag-rohit-sharma-3682675#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Fastest triple hundred in first-class cricket of Indian cricketers: पृथ्वी शॉ (Prithvi Shaw) ने रणजी ट्रॉफी में असम के खिलाफ मैच में तूफानी 379 रन की पारी खेलकर धमाल मचा दिया. शॉ ने असम के खिलाफ मैच में 326 गेंद पर तिहरा शतक लगाने का कमाल कर दिखाया है.","content":"Prithvi Shaw Ranji Trophy: पृथ्वी शॉ (Prithvi Shaw) ने रणजी ट्रॉफी में असम के खिलाफ मैच में तूफानी 379 रन की पारी खेलकर धमाल मचा दिया. शॉ ने असम के खिलाफ मैच में 326 गेंद पर तिहरा शतक लगाने का कमाल कर दिखाया है. इतना ही नहीं जैसे ही पृथ्वी 377 रन का आंकड़ा छूआ वैसे ही वो रणजी ट्रॉफी के इतिहास में मुंबई की ओर से सबसे बड़ी पारी खेलने वाले बल्लेबाज भी बन गए हैं. पृथ्वी शॉ ने 1990-91 में संजय मांजरेकर द्वारा बनाए गए 377 रन के रिकॉर्ड को तोड़ दिया है. वह रणजी ट्रॉफी के इतिहास में मुंबई की ओर से सबसे बड़ी पारी खेलने वाले बल्लेबाज बन गए हैं. वहीं, रणजी ट्रॉफी के इतिहास में सबसे बड़ी पारी खेलने वाले बल्लेबाज बी॰ बी॰ निम्बालकर हैं जिन्होंने 1948-49 में महाराष्ट्र की ओर से खेलते हुए नाबाद 443 रन की पारी सौराष्ट्र के खिलाफ खेला था. बता दें कि शॉ का फर्स्ट क्लास क्रिकेट में यह पहला तिहरा शतक है. फर्स्ट क्वलास क्रिकेट में सबसे तेज तिहरा शतक लगाने वाले भारतीय बल्लेबाजबता दें कि फर्स्ट क्लास क्रिकेट में सबसे तेज तिहरा शतक लगाने का रिकॉर्ड वीरेंद्र सहवाग के नाम हैं. सहवाग ने साल 2007-08 में साउथ अफ्रीका के खिलाफ चेन्नई टेस्ट मैच के दौरान 278 गेंद पर तिहरा शतक जमाया था. जो भारत की ओर से फर्स्ट क्वलास क्रिकेट में बनाया गया सबसे तेज तिहरा शतक का रिकॉर्ड है. दूसरे नंबर पर केदार जाधव हैं जिन्होंने नवंबर 2012 में रणजी ट्रॉफी के मैच में महाराष्ट्र की ओर से खेलते हुए उत्तर प्रदेश के खिलाफ 327 रन बनाए थे जिसमें उन्होंने 300 रन 285 गेंद पर ठोक दिए थे. तीसरे नंबर पर मेघालय के पुनीत बिष्ट (Punit Bisht) हैं जिन्होंने 2018/19 के रणजी ट्रॉफी में सिक्किम के खिलाफ मैच में केवल 291 गेंद पर तिहरा शतक ठोक दिया था. चौथे नंबर पर रोहित शर्मा  हैं जिन्होंने 312 गेंद पर तिहरा शतक लगाने का कमाल किया है.  2009/10 रणजी ट्रॉफी में रोहित ने मुंबई की ओर से खेलते हुए गुजरात के खिलाफ केवल 312 गेंद पर जिहरा शतक लगाया था. पांचवें नंबर पर ऋषभ पंत हैं जिन्होंने 2016/17 रणजी ट्रॉफी में दिल्ली की ओर से खेलते हुए महाराष्ट्र के खिलाफ 320 गेंद पर तिहरा शतक ठोका था. फर्स्ट क्लास क्रिकेट में सबसे तेज तिहरा शतक #1 वीरेंद्र सहवाग (278 गेंदे)#2 केदार जाधव (285 गेंदे)#3 पुनीत बिष्ट (291 गेंदे)#4 रोहित शर्मा (312 गेंदे)#5 ऋषभ पंत (320 गेंद)#6 पृथ्वी शॉ (326 गेंद)ये भी पढ़े- Video: मोहम्मद सिराज की गेंद बुलेट की रफ्तार से सीधे स्टंप में घुस गई, बल्लेबाज ने हाथ खड़ा कर दिया रोहित शर्मा ने बताया, क्यों शमी द्वारा शनाका को 'रन आउट' किए जाने के बाद वापस ली अपील और बनाने दिया शतकWatch: उमरान मलिक ने गोली की स्पीड से फेंकी गेंद, 156 KMPH की रफ्तार से बॉल फेंककर मचाया बवालस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-01-11 09:53:31","image_url":"https://c.ndtvimg.com/2023-01/jgid12a8_prithvi-shaw_625x300_11_January_23.jpg?output-quality=80=1278:*","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket: Live updates - Black Caps v Pakistan, 2nd ODI","link":"https://www.nzherald.co.nz/sport/cricket-live-updates-black-caps-v-pakistan-2nd-odi/NAB7IPXC6JFH5OPBBVJ2DRESYU/","keywords":null,"creator":null,"video_url":null,"description":"Live updates of the second ODI in Karachi.","content":null,"pubDate":"2023-01-11 09:20:00","image_url":"https://www.nzherald.co.nz/resizer/fwLcLQjmWrggyqoRN40ouMSNGeo=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/SOKORLHKUZDTHNQRUAFW23XH34.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Pakistan vs New Zealand 2nd ODI Match Prediction – Who will win today's match between PAK vs NZ? - CricTracker","link":"https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5jcmljdHJhY2tlci5jb20vY3JpY2tldC1tYXRjaC1wcmVkaWN0aW9ucy9wYWtpc3Rhbi12cy1uZXctemVhbGFuZC0ybmQtb2RpLW1hdGNoLXByZWRpY3Rpb24td2hvLXdpbGwtd2luLXRvZGF5cy1tYXRjaC1iZXR3ZWVuLXBhay12cy1uei_SAZkBaHR0cHM6Ly93d3cuY3JpY3RyYWNrZXIuY29tL2NyaWNrZXQtbWF0Y2gtcHJlZGljdGlvbnMvcGFraXN0YW4tdnMtbmV3LXplYWxhbmQtMm5kLW9kaS1tYXRjaC1wcmVkaWN0aW9uLXdoby13aWxsLXdpbi10b2RheXMtbWF0Y2gtYmV0d2Vlbi1wYWstdnMtbnovP2FtcD0x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs New Zealand 2nd ODI Match Prediction – Who will win today's match between PAK vs NZ?  CricTrackerPAK vs NZ Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- New Zealand Tour of Pakistan, 2nd ODI  Cricket AddictorLIVE | PAK vs NZ 2nd ODI, Score: Naseem Gives Breakthrough; Conway Departs For 101  India.comNew Zealand to bat first against Pakistan in second ODI  Geo NewsPAK vs NZ Dream11 Prediction, 2nd ODI, New Zealand tour of Pakistan Team By Expert, 11 JAN 2023  KhelTalkView Full coverage on Google News","content":null,"pubDate":"2023-01-11 09:15:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka Live Cricket Score, Quick Scorecard and Summary - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9jcmlja2V0L2xpdmUtc2NvcmVjYXJkLWluZGlhLXZzLXNyaS1sYW5rYS1saXZlLXNjb3JlLWluc2wwMTEwMjAyMzIxOTU4My_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka Live Cricket Score, Quick Scorecard and Summary  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2023-01-11 08:47:48","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Jo Bhi Mujhe Ye Opportunity Diya\": Suryakumar Yadav's Epic Reaction On Interviewing Virat Kohli. Watch | Cricket News - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1zcmktbGFua2EtMjAyMy9qby1iaGktbXVqaGUteWUtb3Bwb3J0dW5pdHktZGl5YS1zdXJ5YWt1bWFyLXlhZGF2cy1lcGljLXJlYWN0aW9uLW9uLWludGVydmlld2luZy12aXJhdC1rb2hsaS13YXRjaC0zNjgyMDg20gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Jo Bhi Mujhe Ye Opportunity Diya\": Suryakumar Yadav's Epic Reaction On Interviewing Virat Kohli. Watch | Cricket News  NDTV SportsWhat Sachin Told Virat After Guwahati 100  Rediff.comKohli, Rohit, Gill star in India's comfortable win | Cricbuzz.com - Cricbuzz  CricbuzzIndia vs Sri Lanka - Watch: Virat Kohli Stares At Hardik Pandya After Allrounder Denies Second Run D..  NDTV Sports'When I'm not playing well, I'm the worst player around'  Rediff.comView Full coverage on Google News","content":null,"pubDate":"2023-01-11 08:01:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2023: PCB chief Sethi 'wants to discuss' Asia Cup hosting issue if Jay Shah attends ILT20 opener","link":"https://www.indiatvnews.com/sports/cricket/asia-cup-host-india-vs-pakistan-asia-cup-2023-pcb-chief-najam-sethi-wants-to-discuss-asia-cup-hosting-issue-if-jay-shah-attends-ilt20-opener-2023-01-11-838300","keywords":null,"creator":null,"video_url":null,"description":"Pakistan Cricket Board chairman Najam Sethi intends to have a chat with Jay Shah regarding his country's Asia Cup hosting rights if the Board of Control for Cricket in India (BCCI) secretary decides to attend the opening ceremony of the International League T20 on Thursday. Najam will be using this opportunity to work on relations with the ACC members and ensure that the Asia Cup is held as scheduled in Pakistan in September this year.","content":null,"pubDate":"2023-01-11 07:42:35","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"मिकी आर्थर ने पाकिस्‍तान का कोच बनने से किया इनकार, अब इस दिग्‍गज पर डोरे डाल रहा पीसीबी","link":"https://hindi.news18.com/news/sports/cricket-mickey-arthur-rejected-the-offer-to-become-the-head-coach-of-the-pakistan-cricket-team-5200879.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Pakistan Cricket Team New Coach : पाकिस्‍तान क्रिकेट बोर्ड (PCB) सकलेन मुश्‍ताक (Saqlain Mushtaq) की जगह मिकी आर्थर (Mickey Arthur) को नेशनल टीम का कोच बनाना चाहता है. इसके लिए पीसीबी ने आर्थर को ऑफर दिया था लेकिन, उन्‍होंने यह जिम्‍मेदारी लेने से इनकार कर दिया है. मिकी एक बार पहले भी पाकिस्‍तान टीम को कोचिंग दे चुके हैं.","content":null,"pubDate":"2023-01-11 07:29:31","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/12/micky-arthour-16720415733x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"'I was cranky; it wasn't fair on Anushka,' says Virat Kohli as he admits to being in denial about his form","link":"https://www.indiatvnews.com/sports/cricket/virat-kohli-as-he-admits-to-being-in-denial-about-his-form-says-i-was-cranky-it-wasn-t-fair-on-anushka-2023-01-11-838293","keywords":null,"creator":null,"video_url":null,"description":"Virat Kohli admitted that was in denial about not being at his best in terms of his cricket and that made him cranky with his close ones.  In the 1st ODI of the 3-match series vs Sri Lanka, Kohli hit his 73rd 100 off just 87 deliveries. ","content":null,"pubDate":"2023-01-11 07:29:20","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Chetan Sharma to Ankola, here's how BCCI selectors fared in their cricketing careers | Know numbers","link":"https://www.indiatvnews.com/sports/cricket/chetan-sharma-to-ankola-here-s-how-bcci-selectors-fared-in-their-cricketing-careers-know-numbers-2023-01-11-838281","keywords":null,"creator":null,"video_url":null,"description":"BCCI, on January 7, announced All-India Senior Men Selection Committee.Chetan Sharma retained the position after being sacked post India's performance at the T20 World Cup 2022. The Cricket Advisory Committee recommended him for the post.","content":null,"pubDate":"2023-01-11 06:51:38","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: India captain Rohit praised for withdrawing 'Mankad' run-out appeal","link":"https://www.straitstimes.com/sport/cricket-india-captain-rohit-praised-for-withdrawing-mankad-run-out-appeal","keywords":null,"creator":null,"video_url":null,"description":"January 11, 2023 2:02 PMRohit’s sportsmanship was lauded by former Sri Lankan cricketers.","content":null,"pubDate":"2023-01-11 06:02:47","image_url":null,"source_id":"straitstimes","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Umran Malik clocks 156 kph in 1st ODI against SL, becomes India's fastest bowler","link":"https://thenorthlines.com/umran-malik-clocks-156-kph-in-1st-odi-against-sl-becomes-indias-fastest-bowler/","keywords":["India","Sports"],"creator":["Northlines"],"video_url":null,"description":"GUWAHATI, January 10: India’s pace sensation Umran Malik set the speed gun on fire after bowling a 156 kph delivery in the first ODI against Sri Lanka at the Barsapara Cricket Stadium, Guwahati on Tuesday. Malik bettered his own record of becoming the fastest Indian pacer. The speedster bowled the delivery in his second over […] The post Umran Malik clocks 156 kph in 1st ODI against SL, becomes India's fastest bowler appeared first on Northlines.","content":"GUWAHATI, January 10: India’s pace sensation Umran Malik set the speed gun on fire after bowling a 156 kph delivery in the first ODI against Sri Lanka at the Barsapara Cricket Stadium, Guwahati on Tuesday. Malik bettered his own record of becoming the fastest Indian pacer. The speedster bowled the delivery in his second over (14th over of the inning) of his first spell. The right-arm pacer clocked in 155 kph on the speed radar in the first T20I against Sri Lanka to become the fastest Indian bowler overshadowing Jasprit Bumrah’s record. The Jammu-born pacer surpassed Bumrah’s record of 153.36 kph to earn the tag of being the fastest Indian bowler. The delivery was not only the fastest of the match but was pivotal too as it got rid of Sri Lanka captain Dasun Shanaka who was bamboozling the Indian attack up until then. Malik turned the match on its head for the hosts as Shanaka was dismissed for 45 off 27 balls on the 155 kph lightning-quick delivery, leaving Sri Lanka in a spot of bother needing 34 off 20 balls with just three wickets in hand. Mohammed Shami is third on the list for bowling the fastest delivery. He racked up his pace to 153.3 kph while Navdeep Saini is fourth recording 152.85 kph on the speed gun. However, Malik has attained speeds greater than 155 kph. He clocked in 156.9 kph while playing in the IPL 2022 for the Sunrisers Hyderabad against Delhi Daredevils. The delivery was the second fastest of IPL 2022 just behind Lockie Ferguson’s 157.3 kph delivery. Virat Kohli’s 45th ODI century and half-centuries from the Indian openers propelled India to their 22nd 300-plus ODI total against Sri Lanka in the first ODI of the three-match series. Shubhman Gill (70) and Rohit Sharma (83) laid a perfect platform for the Indian batters as they stitched a 143-run opening stand. Virat’s 113 made sure that India did not lose momentum as KL Rahul (39) and Shreyas Iyer (28) chipped in with useful cameos as the hosts posted a mammoth total of 373 runs.The post Umran Malik clocks 156 kph in 1st ODI against SL, becomes India's fastest bowler appeared first on Northlines.","pubDate":"2023-01-11 05:46:29","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Zimbabwe cricket icon Sinikiwe Mpofu dies less than a month after husband","link":"https://www.foxsports.com.au/cricket/zimbabwe-cricket-icon-sinikiwe-mpofu-dies-less-than-a-month-after-husband/news-story/f64a1f9a2afd90c727936f7f8f3236d3","keywords":null,"creator":null,"video_url":null,"description":"Zimbabwe cricket trailblazer Sinikiwe Mpofu has died aged 37.","content":null,"pubDate":"2023-01-11 05:33:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ganguly provides big update on Pant's availability for DC in IPL 2023 - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMinAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zb3VyYXYtZ2FuZ3VseS1wcm92aWRlcy1iaWctdXBkYXRlLW9uLXJpc2hhYmgtcGFudC1zLWF2YWlsYWJpbGl0eS1mb3ItZGVsaGktY2FwaXRhbHMtaW4taXBsLTIwMjMtMTAxNjczNDEyMjk5MjgyLmh0bWzSAaABaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2NyaWNrZXQvc291cmF2LWdhbmd1bHktcHJvdmlkZXMtYmlnLXVwZGF0ZS1vbi1yaXNoYWJoLXBhbnQtcy1hdmFpbGFiaWxpdHktZm9yLWRlbGhpLWNhcGl0YWxzLWluLWlwbC0yMDIzLTEwMTY3MzQxMjI5OTI4Mi1hbXAuaHRtbA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ganguly provides big update on Pant's availability for DC in IPL 2023  Hindustan TimesDada Reveals If Rishabh Will Play IPL  Rediff.comRishabh Pant Will Get Rs 16 Crore Without Playing A Single Match In IPL 2023, Know What Is The Rule Of BCCI  ICC CRICKET SCHEDULEIPL 2023: Delhi Capitals Director of Cricket Sourav Ganguly confirms Rishabh Pant to miss IPL 2023, DC looking for new captain: Follow LIVE  InsideSportSourav Ganguly Confirms 'Rishabh Pant Will Not be Available For IPL 2023'  News18View Full coverage on Google News","content":null,"pubDate":"2023-01-11 05:24:14","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Women’s IPL will change cricket landscape forever, says Jess Jonassen","link":"https://www.theguardian.com/sport/2023/jan/11/womens-ipl-will-change-cricket-landscape-forever-says-jess-jonassen","keywords":["Women's cricket","Cricket","Australia sport","Sport"],"creator":["Australian Associated Press"],"video_url":null,"description":"‘It puts the game on the map even more,’ says AustralianAllrounder puts her hand up to join one of Indian franchisesJess Jonassen has achieved everything women’s cricket has to offer, and says 2023 can be a life-changing year for herself and female participants around the world.The Australian allrounder has been watching with interest the build-up to the inaugural Women’s IPL in India, where five or six teams are expected to contest a new tournament in March after the completion of the Women’s Twenty20 World Cup in South Africa. Continue reading...","content":null,"pubDate":"2023-01-11 05:21:04","image_url":"https://i.guim.co.uk/img/media/9066cc88c77b0376935754e08dbe23977011c93c/0_244_5080_3049/master/5080.jpg?width=460&quality=85&auto=format&fit=max&s=2336258fde6255cbd1703e5ecef892ac","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"IND vs AUS Test Series: भारत के खिलाफ टेस्ट सीरीज के लिए ऑस्ट्रेलियाई टीम का ऐलान, खास रणनीति के तहत चुने गए खिलाड़ी","link":"https://sports.ndtv.com/hindi/cricket/australia-test-squad-for-tour-of-india-full-list-four-spinners-included-in-the-aussie-squad-for-the-four-test-tour-3681533#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"Australia Test squad for tour of India full list: भारत के खिलाफ 4 टेस्ट मैचों की सीरीज से लिए ऑस्ट्रेलियाई टीम का ऐलान., एक नहीं बल्कि 4 स्पिनरों को मिली टेस्ट टीम में जगह","content":"IND vs AUS Test Series: भारत के खिलाफ टेस्ट सीरीज के लिए ऑस्ट्रेलियाई टीम (Australia Team) का ऐलान हो गया है. भारत के खिलाफ टेस्ट सीरीज के लिए ऑस्ट्रेलियाई टीम ने 4 स्पिनरों को अपनी टीम में जगह दी है. बता दें कि टेस्ट मैच का आगाज 9 फरवरी से होने वाला है. भारत दौरे पर ऑस्ट्रेलियाई टीम 4 टेस्ट मैच और 3 वनडे मैच खेलेगी. विश्व टेस्ट चैंपियनशिप के मद्देनजर यह टेस्ट सीरीज भारत के लिए काफी अहम होने वाला है. भारत की पिच स्पिनरों को मदद करती है, यही कारण है कि ऑस्ट्रेलियाई टेस्ट टीम में 4 स्पिनरों को जगह मिली है. जिसमें  नाथन लियोन, टोड मर्फी, मिशेल स्वेपसन और एश्टन एगर शामिल है. यानि भारत के खिलाफ ऑस्ट्रेलियाई टीम भारत के  बल्लेबाजों के खिलाफ स्पिन गेंदबाजों की रणनीति पर जोर देने की कोशिश करेगी. इसके अलावा साल 2019 के बाद पीटर हैंड्सकॉम्ब की ऑस्ट्रेलियाई टेस्ट टीम में वापसी हुई है. भारत टेस्ट सीरीज के लिए ऑस्ट्रेलियाई टीम:पैट कमिंस (कप्तान), एश्टन एगर, स्कॉट बोलैंड, एलेक्स केरी, कैमरून ग्रीन, पीटर हैंड्सकॉम्ब, जोश हेजलवुड, ट्रैविस हेड, उस्मान ख्वाजा, मारनस लबसचगने, नाथन लियोन, लांस मॉरिस, टोड मर्फी, मैथ्यू रेनशॉ, स्टीव स्मिथ (उपकप्तान), मिशेल स्टार्क, मिशेल स्वेपसन, डेविड वार्नरFour spinners included in the Aussie squad for the four-Test tour #INDvAUS pic.twitter.com/1ITzFS0xA1— cricket.com.au (@cricketcomau) January 11, 2023 भारत Vs ऑस्ट्रेलिया टेस्ट सीरीज9-13 फरवरी: पहला टेस्ट, नागपुर17-21 फरवरी: दूसरा टेस्ट, दिल्ली1-5 मार्च: तीसरा टेस्ट, धर्मशाला9-13 मार्च: चौथा टेस्ट, अहमदाबादवनडे सीरीज शे़ड्यूल17 मार्च: पहला वनडे, मुंबई, शाम 7 बजे 19 मार्च: दूसरा वनडे, विजाग, शाम 7 बजे 22 मार्च: तीसरा वनडे, चेन्नई, शाम 7 बजेये भी पढ़े- Video: मोहम्मद सिराज की गेंद बुलेट की रफ्तार से सीधे स्टंप में घुस गई, बल्लेबाज ने हाथ खड़ा कर दिया रोहित शर्मा ने बताया, क्यों शमी द्वारा शनाका को 'रन आउट' किए जाने के बाद वापस ली अपील और बनाने दिया शतकWatch: उमरान मलिक ने गोली की स्पीड से फेंकी गेंद, 156 KMPH की रफ्तार से बॉल फेंककर मचाया बवालस्पोर्ट्स से जुड़ी खबर के लिए सब्सक्राइब करें NDTV Sports HIndi","pubDate":"2023-01-11 04:12:31","image_url":"https://c.ndtvimg.com/2023-01/er6glqa_pat-cummins-afp_625x300_09_January_23.jpg","source_id":"ndtv_in","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Club cricket injury puts Test recall in doubt","link":"https://wwos.nine.com.au/cricket/australian-tour-of-india-2023-peter-handscomb-set-for-scans-after-injury-scare/0ca7f6dd-ab7f-41aa-9c37-24edb77667fb","keywords":null,"creator":["wwos"],"video_url":null,"description":"An untimely injury in club cricket has put the \"deserved\" Test recall of Peter Handscomb under a cloud, despite his call-up.","content":"One of Australia's comeback kids might have his dreams of a Test recall dashed after he was injured in club cricket. ﻿Hours before being included in the 18-man squad for Australia's tour of India, ﻿Peter Handscomb collapsed in pain and eventually left the field while playing on Tuesday night.Opening the batting for St Kilda against Melbourne in the Victorian Super Slam - the state's T20 competition - Handscomb smacked his second six of the day before falling to the ground in pain and retiring hurt.﻿READ MORE: Truth about star batters' off-field relationship﻿READ MORE: Ronaldo's $310m 2030 World Cup job revealed﻿READ MORE: Cummins admits to 'naivety' as captaincy arrivedHe left the field on 16 off 8 balls, and did not return.It looked as though the damage was done a few balls prior, when he took a short delivery to the body.https://twitter.com/tmlew_/status/1612720986671181825While nothing has been confirmed yet, he has been sent for scans with the hopes that the injury is just bruising, rather than something more serious.Chairman of selectors Geroge Bailey gave Handscomb a ringing endorsement when the squad was locked in.﻿\"Peter Handscomb deserves his place back in the squad,\" he said.\"His domestic form has been strong recently and Pete has proven he can perform at Test level.\"His experience against spin on the subcontinent is valuable and he is also an exceptionally good close to the wicket catcher.\"Handscomb's last opportunity to shine against international-level crickets came in last 2022, when he played in a Cricket Australia XI match against South Africa before the Test series, making 9 in the first dig and retiring out on 48 in the second.﻿The 31-year-old recorded 29 innings across 16 Tests between 2016 and 2019, notching two centuries and further four fifties. ﻿For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here﻿","pubDate":"2023-01-11 03:42:45","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2023/01/478944/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Dewald Brevis lights up opening night at SA20 | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTI1MTQ1L2Rld2FsZC1icmV2aXMtbGlnaHRzLXVwLW9wZW5pbmctbmlnaHQtYXQtc2EyMC1jcmljYnV6emNvbdIBZ2h0dHA6Ly9tLmNyaWNidXp6LmNvbS9hbXAvY3JpY2tldC1uZXdzLzEyNTE0NS9kZXdhbGQtYnJldmlzLWxpZ2h0cy11cC1vcGVuaW5nLW5pZ2h0LWF0LXNhMjAtY3JpY2J1enpjb20?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Dewald Brevis lights up opening night at SA20 | Cricbuzz.com - Cricbuzz  CricbuzzLive match blog - Royals vs MI Cape Town 1st Match 2022/23 - Cricket Insights  ESPNcricinfoDewald Brevis, Jofra Archer Star as MI Cape Town Begin With a Confident Win over Paarl Royals  News18Teen sensation Dewald Brevis bludgeons Paarl Royals' bowling attack as MI Cape Town win SA20 opener  IOLCT vs PRL Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- SA T20 League  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-01-11 03:22:26","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Rohit withdrew Mankading appeal against Shanaka - Rediff.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vd3d3LnJlZGlmZi5jb20vY3JpY2tldC9yZXBvcnQvcm9oaXQtd2l0aGRyYXdzLW1hbmthZGluZy1hcHBlYWwtc3JpLWxhbmthLWd1d2FoYXRpLW9kaS8yMDIzMDExMC5odG3SAWxodHRwczovL20ucmVkaWZmLmNvbS9hbXAvY3JpY2tldC9yZXBvcnQvcm9oaXQtd2l0aGRyYXdzLW1hbmthZGluZy1hcHBlYWwtc3JpLWxhbmthLWd1d2FoYXRpLW9kaS8yMDIzMDExMC5odG0?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Why Rohit withdrew Mankading appeal against Shanaka  Rediff.comIND vs SL: \"I Doff My Cap To You!”: Sanath Jayasuriya Praised Rohit Sharma's Sportsmanship 'Real Winner' After India Withdrew Mankad Appeal  Cricket AddictorIndia vs Sri Lanka - Watch: Mohammed Shami Runs Out Dasun Shanaka At Non-Striker's End. Rohit Sharma..  NDTV SportsRecent Match Report - India vs Sri Lanka 1st ODI 2022/23  ESPNcricinfoFeels good when the captain backs you - Shubman Gill | Cricbuzz.com  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2023-01-11 03:19:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Understanding the Popularity of Sports Betting Among Kenyan Youth","link":"https://nairobiwire.com/2023/01/understanding-the-popularity-of-sports-betting-among-kenyan-youth.html","keywords":["sports"],"creator":["Nick Mwangi"],"video_url":null,"description":"Sports betting is a growing trend among Kenyan youth, and with the rise of mobile technology and access to the internet, more and more young people aged 20 to 32 are taking part in sports betting. While the possibility for financial gain is one reason for its popularity, several additional variables contribute to its overall […] The post Understanding the Popularity of Sports Betting Among Kenyan Youth appeared first on Nairobi Wire.","content":"Sports betting is a growing trend among Kenyan youth, and with the rise of mobile technology and access to the internet, more and more young people aged 20 to 32 are taking part in sports betting. While the possibility for financial gain is one reason for its popularity, several additional variables contribute to its overall appeal. For one thing, sports betting on platforms like Betway allows people to take part in a form of entertainment that is both engaging and exciting. Not only does it provide an opportunity for socializing, but it also helps build communities around shared interests. In addition, sports betting may open up new avenues of research for fans, providing them with insights about their preferred teams and players. All these factors combined help explain why sports betting has become so popular among Kenyan youth today. Social media’s role in influencing sports betting In recent years, the rise of social media has had a profound impact on Kenyan youth’s love for sports betting. As more and more individuals move their lives online, sports betting sites like Betway and similar apps have become more accessible than ever, especially among younger generations. Through targeted advertising campaigns, companies can reach out to potential customers and create a positive image of their product or service. Additionally, social media provides an easy way for users to share information about their experiences with different sports betting sites, which can further influence other users’ decisions when it comes to placing bets. Finally, social media can be used to discuss and debate sports betting, allowing users to gain insight into different perspectives on the issue. Sports Kenyan youth prefer to bet on Bets on popular sports in Kenya, such as football, rugby, cricket, and basketball, are especially popular among young people. Football is the most popular sport in Kenya, and it is no surprise that it is also the most popular sport for Kenyan youth to bet on. Rugby is another popular sport in Kenya, and many young people enjoy betting on this sport as well. Cricket has been gaining popularity in recent years, and more Kenyan youth are beginning to bet on this sport. Basketball has also become increasingly popular among Kenyan youth, with many of them placing bets on games both locally and internationally using sportsbooks. The impact of sports betting on the Kenyan economy The gambling industry’s influence on Kenya’s GDP has been substantial. Millions of Kenyan shillings have been brought in as tax money, and it has, directly and indirectly, employed thousands of people. Over KES 200 billion is generated yearly by the business, making it one of the country’s top earners. Sports betting has also helped to boost tourism in Kenya, as more people are drawn to the country due to its vibrant sports betting scene. All in all, sports betting on sites has had a positive impact on the Kenyan economy and will continue to do so for years to come. In conclusion, the popularity of sports betting among Kenyan youth is driven by a combination of factors such as access to technology, financial incentives, and the perception that gambling provides an opportunity for social interaction. The post Understanding the Popularity of Sports Betting Among Kenyan Youth appeared first on Nairobi Wire.","pubDate":"2023-01-11 03:10:33","image_url":null,"source_id":"nairobiwire","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Rishabh Pant Accident: Delhi Capitals director of cricket Sourav Ganguly confirms wicketkeeper OUT of IPL 2023, hunt for new captain is on","link":"https://zeenews.india.com/cricket/rishabh-pant-accident-delhi-capitals-director-of-cricket-sourav-ganguly-confirms-wicketkeeper-out-of-ipl-2023-hunt-for-new-captain-is-on-2560124.html","keywords":null,"creator":null,"video_url":null,"description":"Former Board of Control for Cricket in India (BCCI) president Sourav Ganguly, who has been appointed Delhi Capitals Director of Cricket, confirmed that Pant will be unavailable for IPL 2023 and DC is in hunt for a new skipper for the upcoming season.","content":null,"pubDate":"2023-01-11 02:56:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"}]}