{"newsArray":[{"title":"Can Sineth change the fortunes of Royal against Thomians?","link":"http://island.lk/can-sineth-change-the-fortunes-of-royal-against-thomians/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"After suffering back-to-back defeats at the hands of Trinity, Royal will look forward to shrugging off disappointments of the tail end of the season against arch-rivals S. Thomas’ when the two teams meet in the 144th Battle of the Blues starting at the SSC on March 15. Dasis Manchanayake led Royal have mustered the support […]","content":"After suffering back-to-back defeats at the hands of Trinity, Royal will look forward to shrugging off disappointments of the tail end of the season against arch-rivals S. Thomas’ when the two teams meet in the 144th Battle of the Blues starting at the SSC on March 15. Dasis Manchanayake led Royal have mustered the support of Sri Lanka Cricket to field their Sri Lanka Under 19 player Sineth Jayawardena at the historic encounter. Jayawardena and two other Sri Lanka Under 19 players have received exemptions to play their respective Big Matches despite being selected in the Youth team to take part in a tri-nation tournament in UAE. Jayawardena was not a part of the Royal teams that suffered defeats at the hands of Trinity. Royal have won without and with him this season, but it seems that the team that had entered the past two Big Matches as favourties want to leave no stone unturned in fighting their arch-rivals. His stay was limited to 38 first innings balls at the last edition and when spectators return to the annual encounter after a lapse of two years Jayawardena will be one of the key players to watch. The top-order batsman could be the only change to the team that played the Under 19 Division I Tier ‘A’ quarter-final match against Trinity. The defeats at the hands of Trinity were probably the only disappointments experienced by Royal in a five-match league tournament involving 18 teams this season as they reached the business end of the tourney. The Thomians on the other hand could not reach the last eight despite remaining unbeaten in Group ‘Z’ of the Tier ‘A’ tournament. They registered four outright victories but all came during the third term on highly favourable home ground conditions where they dismissed teams batting first for low scores. They were the underdogs for two consecutive Big Matches but this time the team led by Romesh Mendis have shrugged off that tag and are on par with Royal. Mendis is the batsman to watch in the Thomian camp. Both teams possess formidable pace attacks and that department could determine the outcome of the 144th encounter. (RF) Published on By By the time the seventh over of the first innings was completed, Gujarat Giants had slipped to 33 for 7 after opting to bat as Marizanne Kapp was breathing fire with a spell that tore apart their batting. By the time the seventh over of the chase was bowled, Shafali Verma had taken Delhi Capitals within three runs of victory. It was complete obliteration of the Giants, first by Kapp’s 5 for 15 and then by Shafali’s 28-ball 76 not out, which included 10 fours and 5 sixes, as the Capitals returned to winning ways with a comprehensive 10-wicket victory, going past Giants’ total of 105 in just 7.1 overs. Brief scores: 105/9 in 20 overs (Kim Garth 32*; Marizanne Kapp 5-15, Shikha Pandey 3-26) 107/0 in 7.1 overs (Shafali Verma 76*, Meg Lanning 21*) Published on By A dominant performance from South Africa with the ball in the final innings helped them cleansweep the two-match Test series against West Indies on Saturday (March 11). South Africa, favourites to clinch the game by stumps on the third day, were rampant with the ball after setting the visitors a target of 391. West Indies were reduced to 34/6 at one stage before getting all out eventually for 106. Resuming at 287/7, the hosts lost skipper Temba Bavuma early for 172. Kagiso Rabada cleared the ropes a couple of times that helped them go past 300 before Jason Holder brought an end to the innings. A target of 391 was always going to be a tall task for a side that had failed to get anywhere closer to 300 so far in the series. Even though the visitors made a watchful start, scoring 20 off the first 10 overs without a wicket, South Africa made inroads after breaking that stand. Rabada proved to be Kraigg Brathwaite’s nemesis again as he got one delivery to come back in after pitching to trap the skipper leg-before-wicket. Raymon Reifer then bagged a second-ball duck as he edged a delivery going down leg to the keeper in the same over. Simon Harmer then got into the act as Tagenarine Chanderpaul edged a delivery to second slip to reduce the visitors to 25/3. The procession continued as Harmer then got rid of Jermaine Blackwood whereas Keshav Maharaj got one to turn big to breach Roston Chase’s defence before successfully getting a call in his favour for lbw against Kyle Mayers. But while celebrating the wicket, Maharaj suffered a freak injury and had to be stretchered off the field. At 34/6, the result was a foregone conclusion as Joshua Da Silva and Holder came out swinging post the lunch break. Da Silva hammered Harmer for a six en route to making 34 whereas Holder found the boundary four times in his 19. The two players added 58 for the seventh wicket in their breezy partnership before Gerald Coetzee broke the stand. He breached Da Silva’s defence as well a few overs later before Harmer completed the formalities. Brief scores: South Africa 320 (Aiden Markram 96; Kyle Mayers 3-32) 321 (Temba Bavuma 172; Kyle Mayers 3-46) West Indies 251 (Jason Holder 81*; Gerald Coetzee 3-41) 106 (Joshua Da Silva 34; Gerald Coetzee 3-37) Published on By Shubman Gill’s second Test century led India’s confident reply to Australia’s 480 on the third day in Ahmedabad. The opener put up fifty-plus stands with Rohit Sharma, Cheteshwar Pujara and Virat Kohli, who also helped himself to his first fifty in 16 innings. On a pitch that held true for the third day running, Australia found the going tough to break through but struck once in every session, the last of which was Gill who was LBW to Nathan Lyon. Until then Gill had looked solid in the company of Kohli, as the duo played the attritional game well, and took every boundary opportunity that came their way. Brief Scores : 480 (Usman Khawaja 180, Cameron Green 114; R Ashwin 6-91) 289/3 (Shubman Gill 128, Virat Kohli 59*, Cheteshwar Pujara 42)","pubDate":"2023-03-11 23:40:45","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live: NZ Aim To Gain Advantage","link":"https://sports.ndtv.com/cricket/new-zealand-vs-sri-lanka-1st-test-day-4-live-score-updates-nz-aim-to-gain-advantage-vs-sl-3853305","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live Score Updates: NZ aim to gain advantage over SL.","content":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live Score Updates: Sri Lanka look to strengthen their position on Day 4 of the first Test encounter against New Zealand in Christchurch. At the end of Day 3, Sri Lanka were 83 for three in their second innings with a lead of 65 runs. Angelo Mathews was not out 20 while Prabath Jayasuriya was batting on two. For the Kiwis, Blair Tickner took three crucial wickets. Earlier, Daryll Mitchell slammed a gritty century and Matt Henry scored 72 as New Zealand recovered from 151 for five to 373 and was able to take a 18-run lead. ( LIVE SCORECARD ) No run. No run. Bye. Short and on off. Angelo Mathews pulls it hard to square leg. Lands short! Daryl Mitchell comes 'round the wicket and goes short, on off. Dinesh Chandimal miscues his pull shot and fortunately it lands short of Michael Bracewell at square leg. Good length, on leg stump. Angelo Mathews flicks it behind square on the leg side off his hips. One taken. Daryl Mitchell is introduced into the attack. An inswinger, full and on off. Dinesh Chandimal shuffles and defends it watchfully. Halt! Dinesh Chandimal has taken a blow on his right glove and has called for the physio straightway. The physio sprints out onto the field and tapes the finger of the batter. After receiving treatment, Chandimal puts his gloves back on and we are all set to resume. Woah! Dinesh Chandimal gets pinged on his gloves! It is a length ball, on off. It flies off the deck and catches Dinesh Chandimal by surprise here. He goes back and tries to defend it but takes a blow on his finger. A dot now! Third one of the over. A length ball, wide of off. Dinesh Chandimal shuffles across and makes a good leave. Shorter, too wide. Angelo Mathews cuts it to deep point but only for one as there is protection in the deep. Much fuller, but still very wide to bother Angelo Mathews as he makes yet another leave. Good length, outside off. Angelo Mathews leaves it alone for the keeper. On the pads, flicked to square leg for one. Runs are coming quite easily now for Sri Lanka. The lead moves to 120 runs. Floated and full, around off. Dinesh Chandimal uses his feet and tucks it to mid-wicket for one. He racks up 5000 runs in his Test career. A single now as this is full one is knocked down to long on. Slightly short, outside off. Angelo Mathews punches it through point off the back foot. The call is for two and get it. Dinesh Chandimal charges down the wicket and flicks this full ball to wide long on for a single. Fuller, outside off. Dinesh Chandimal blocks it on his front foot. A wild swing and a miss! Back of a length, wide outside off, shaping further away. Angelo Mathews goes after it, but misses it completely. Almost carries! It is a full-length ball, outside off. Angelo Mathews drives it back to the bowler but off the inner half. Tim Southee collects it on a bounce. Outside off, left alone. FOUR! Nicely played. Back of a length, on the body. Angelo Mathews heaves it across the line and places it really well to pierce the gap in the deep beind square on the leg side. The ball sneaks into the boundary. Good length, outside off. Angelo Mathews makes the leave. Tim Southee goes full and on off. Angelo Mathews drives it nonchalantly towards mid off. Blair Tickner is quick to get to his right and make a stop. Tossed up, on off. Dinesh Chandimal tucks it to short mid-wicket. 5 runs off the over. Full and on off, blocked solidly. A single now as this is pushed to the off side. FOUR! Angelo Mathews now getting into the act. It is a full delivery. Angelo Mathews gets low and sweeps this to deep mid-wicket from outside off. It races into the fence. A bit quicker, and full, on off. Angelo Mathews pushes it to the left of the bowler. Floated, full and on off. Dinesh Chandimal gets to the pitch of it and flicks it down to long on for a single. Much fuller this time, wide outside off, shaping further away. Angelo Mathews shoulders his arms at it. A good end to the over. Sri Lanka now lead by 104 runs. It is a full-length ball, on off. Angelo Mathews pats it back to the bowler. It is full, tailing into the pads. Dinesh Chandimal clips it to mid-wicket and gets a single. A sharp bouncer this time, on middle. Dinesh Chandimal ducks under it. FOUR! Powerfully hit. Back of a length, on off. Dinesh Chandimal gets on top of it and pulls it through mid-wicket for a boundary. Tim Southee hurls in a length ball, that comes back in from outside off. Dinesh Chandimal gets forward and defends. Floated and full, outside off. Angelo Mathews strides in and defends it off the bottom half. Full, on leg. Dinesh Chandimal flicks it to square leg and crosses. Tossed up, full and outside off. Dinesh Chandimal lunges and blocks it into the deck. Darted on the pads, tucked towards mid-wicket. Dinesh Chandimal now uses his feet to this full one, and clips it to short mid-wicket. Michael Bracewell starts with a full one, on off. Dinesh Chandimal prods and nudges it to mid-wicket. Time for some spin as Michael Bracewell comes on to bowl. A maiden for Tim Southee! It is a full ball, on off, nips away a touch. Angelo Mathews defends it with full face. Outside off, left alone without any trouble. Full length, in the channel. Angelo Mathews prods and blocks it back to the bowler. Good length, wide of off. Angelo Mathews leaves it alone. It is much fuller, on middle and leg. Angelo Mathews clips it towards mid-wicket.","pubDate":"2023-03-11 18:36:04","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"LLC 2023: एक ही ओवर में तीन विकेट, कुल 4 शिकार, हरभजन सिंह ने तो क्रिस गेल की वाट लगा दी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/llc-2023-harbhajan-singh-takes-four-wickets-bowled-chris-gayle-around-his-legs-watch-video/articleshow/98570772.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends league cricket 2023 में इंडिया महाराजा अब भी अपनी पहली जीत की तलाश में भटक रही है। वेस्ट एंड पार्क इंटरनेशनल क्रिकेट स्टेडियम में शनिवार रात मुकाबले मेंवर्ल्ड जायंट्स ने दो रन से जीत दर्ज की।","content":"कतर में खेले जा रहे लीजेंड्स लीग क्रिकेट टूर्नामेंट में इंडिया महाराजास को लगातार दूसरी हार झेलनी पड़ी। वर्ल्ड जायंट्स ने शनिवार रात इंडिया महाराजा को दो रन से हरा दिया। कप्तान गौतम गंभीर की लगातार दूसरी फिफ्टी बेकार गई, इससे पहले उद्घाटन मैच में शुक्रवार रात एशिया लायंस ने भी इंडिया महाराजा को हराया था। इस दिल तोड़ने वाली हार के बीच हरभजन सिंह की कातिलाना गेंदबाजी ने पूरी दुनिया का मन मोह लिया है। दो ओवर में भज्जी ने सिर्फ 13 रन देकर चार बड़े विकेट चटकाए, जिसमें तीन शिकार तो एक ही ओवर में किए। दरअसल, वर्ल्ड जायंट्स के कप्तान आरोन फिंच ने टॉस जीतकर पहले बल्लेबाजी का फैसला किया। उन्होंने क्रिस गेल के साथ पारी की शुरुआत की, लेकिन वेस्टइंडीज के पूर्व सलामी बल्लेबाज भारत महाराजा के गेंदबाजों को ज्यादा नुकसान नहीं पहुंचा सके क्योंकि अनुभवी ऑफ स्पिनर हरभजन सिंह ने उन्हें तीसरे ही ओवर में चलता किया। लेग स्टंप के बाहर फेंकी एक धीमी गति की बॉल को वाइड समझकर गेल ने छोड़ना चाहा, लेकिन शार्प टर्न लेते हुए गेंद सीधे लेग स्टंप में घुस गई। 4 रन पर गेल की पारी का अंत करने के बाद भज्जी को अगला मौका 16वें ओवर में मिला। यह टर्बनेटर का दूसरा ओवर था, जिसकी छह गेंदों में उन्होंने तीन शिकार कर डाले। पहली गेंद पर आयरलैंड वाले केविन ओ ब्रायन (4) को मोहम्मद कैफ के हाथों कैच आउट करवाने के बाद तीसरी गेंद पर रॉस टेलर (1) और पांचवीं पर मोर्न वैन विक (1) को चलता किया। इस ओवर में उन्होंने सिर्फ दो रन दिए। यहीं से वर्ल्ड जायंट्स की रनगति पर भी अंकुश लगा। एक वक्त स्कोर आसानी से 200 रन के पार जाते लग रहा था, जो बाद में 166/8 तक ही सीमित रहा। इस बीच कप्तान आरोन फिंच ने 53 जबकि शेन वॉटसन ने 55 रन बनाए। इंडिया महाराजा ने 167 रन के लक्ष्य को साधने की पूरी कोशिश की, लेकिन सफलता हाथ नहीं लगी। कप्तान गौतम गंभीर और रॉबिन उथप्पा ने मिलकर अच्छी शुरुआत दिलाई थी, लेकिन उसके बाद कोई अच्छी साझेदारी नहीं हुई। गौतम गंभीर ने 42 गेंद में 68 रन बनाए। वर्ल्ड जायंट्स की ओर से रिकॉर्डो पॉवोल सबसे सफल गेंदबाज रहे, जिन्होंने 3 ओवर में 16 रन देकर 2 विकेट चटकाए।","pubDate":"2023-03-11 18:33:59","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jhye Richardson To Miss IPL 2023 Due To Injury, Unlikely To Play Ashes","link":"https://sports.ndtv.com/cricket/jhye-richardson-to-miss-ipl-2023-unlikely-to-play-ashes-series-3852511","keywords":null,"creator":null,"video_url":null,"description":"Jhye Richardson suffered a recurrence of hamstring issues while playing club cricket last week, during his attempt to return to action.","content":"Australian quick Jhye Richardson will be missing the upcoming edition of the Indian Premier League (IPL) and is also likely to miss the Ashes series against England after undergoing surgery to overcome issues in his hamstring. Richardson suffered a recurrence of hamstring issues while playing club cricket last week, during his attempt to return to action after pulling his hamstring during the Big Bash League (BBL). He was also ruled out of the ODI series against India starting from March 17. He took the surgery option in order to find a long-term solution. He was due to represent Mumbai Indians (MI) in IPL after a stint with Punjab Kings in 2021. \"Injuries are a big part of cricket, that's a fact,\" Richardson tweeted as quoted by ESPNCricinfo. \"Frustrating? Absolutely. But I am now in a scenario where I can get back to doing what I love and work bloody hard to become an even better player than before. One step back, two steps forward. Let's do this,\" added Richardson. Richardson's body has let him down during the last two seasons as he had undergone major shoulder surgery in 2019, which led to him missing the ICC Cricket World Cup and the Ashes that year. After taking a maiden five-wicket haul in Tests in Adelaide in December 2021, his first Test since his shoulder injury, but a nagging heel injury ruled out of the next match and he has not featured in the longer format ever since. Jhye played in T20I and ODI series during the 2022 tour to Sri Lanka. He had an interrupted pre-season for Western Australia. His soft-tissue concerns led to him playing just two Sheffield Shield and one Marsh Cup match before BBL. \"Obviously it is devastating that he has re-injured that hamstring again and he is going to miss a significant amount of time to get his hamstring right,\" Western Australia coach Adam Voges said. \"We all feel for Jhye and we are hopeful that whatever they come with as a solution can fix his hamstring and we get him back out there because it has been a tough 12 months for him,\" concluded Voges.","pubDate":"2023-03-11 17:55:56","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Steve Smith and Marnus Labuschagne hilariously race against one another to the dressing room","link":"https://www.sportskeeda.com/cricket/news-watch-steve-smith-marnus-labuschagne-hilariously-race-one-another-dressing-room?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Day 3 of the fourth Test between India and Australia at the Narendra Modi Stadium in Ahmedabad witnessed an amusing incident between Steve Smith and Marnus Labuschagne during a break session. The two batting stalwarts appeared to be racing against one another while going into the dressing room, with Usman Khawaja walking calmly behind the pair. While Smith started behind Labuschagne, the captain got ahead of his teammate soon enough. You can watch a video of this light moment below: Smith and Labuschagne have arguably been one of the most prolific batting pairs in the last year and a half. The duo first came together during the fourth Test in Manchester of the 2019 Ashes series and have continued to pile on the runs against almost teams. Labuschagne is also the number-one-ranked Test batter in the world. The right-hander hasn't been at his best in the ongoing Test series, registering a high score of just 38 in six innings. The 33-year-old came out to bat after Marnus Labuschagne departed for three but inside-edged a delivery onto the stumps as he ended with 38 off 135 balls. However, the New South Wales batter received immense praise for his captaincy skills, especially after leading Australia to a nine-wicket victory in Indore. Following two humbling losses in Nagpur and Delhi, the visitors bounced back well on the back of some exceptional bowling performances. Their commanding win also ensured them a spot in the World Test Championship (WTC) final, which is set to be played in June at The Oval. India are yet to book a place in the WTC decider and need a win to do so or require Sri Lanka to lose at least one Test in their ongoing series against New Zealand . Usman Khawaja has been Australia's batting star in Ahmedabad after his splendid 180, while Cameron Green also starred with 114. Their massive contributions shepherded Australia to 480. In response, the hosts are 289-3 at the end of Day 3. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-03-11 17:41:33","image_url":"https://staticc.sportskeeda.com/editor/2023/03/76000-16785374259954-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL: Shafali, Kapp Fire Delhi Capitals To 10-wicket Win vs Gujarat Giants","link":"https://sports.ndtv.com/cricket/shafali-kapp-fire-dc-to-10-wicket-win-against-gg-in-wpl-3853102","keywords":null,"creator":null,"video_url":null,"description":"Shafali Verma smashed a 19-ball fifty as Delhi Capitals thrashed Gujarat Giants by 10 wickets in the Women's Premier League.","content":"Shafali Verma's explosive unbeaten half-century and Marizanne Kapp's sensational five-wicket haul fired Delhi Capitals to a massive 10-wicket win against Gujarat Giants in the Women's Premier League on Saturday. Kapp broke the back of Gujarat Giants' innings with a stunning spell of 4-0-15-5, taking the top four wickets in the line-up as Delhi bowlers produced a clinical display to keep the opponents to a lowly 105 for 9 at the DY Patil Stadium here. In reply, Shafali came out firing on all cylinders, clobbering 10 fours and five sixes to produce a ruthless knock of 76 not out off 28 balls in the company of captain Meg Lanning (21 not out from 15 balls) as DC completed the chase in a mere 7.1 overs. Delhi Capitals made their intentions clear right from the word go, with Shafali taking a special liking for the Gujarat bowler Ashleigh Gardner, smacking her for four fours and a six in the fourth over to collect 23 runs. Shafali continued to attack, this time hitting Tanuja Kanwar for a couple of sixes to help Delhi knock off the majority of their target, with 87 runs coming in the powerplay. Shafali brought up her second half-century in the WPL, from just 19 balls as the senior pro in Lanning happily chose to take the backseat and enjoy the right-handed batter's power hitting, which tore apart the Gujarat's bowling attack. Earlier, Kapp produced a stunning spell at the top to reduce the Giants to a precarious 33 for 6 after seven overs, a position from which they could never recover. After Kapp set the tone, the others continued to apply constant pressure on the Gujarat batters. India's left-arm spinner Radha Yadav returned with figures of 4-0-19-1, Minnu Mani gave away just 18 runs in her three overs and Australia's Jess Jonassen conceded 19 runs from her four overs. The seasoned Shikha Pandey also had a memorable outing, taking 3 for 26 from her four overs. Kim Garth (32 not out) and Georgia Wareham tried to weather the storm and get some much-needed runs for their side, but their efforts could only provide Gujarat Giants' innings some respectability. While Gujarat's lower order, which did bulk of the scoring, did not attempt risky strokes for quick runs, they also could not find gaps for boundaries. There were no boundaries hit between overs 13-16. Additionally, not a single six was hit in Gujarat Giants' innings. Kapp provided Delhi with a perfect start, cleaning up Sabbhineni Meghana (0) and Wolvaardt (1) before trapping the big gun Ashleigh Gardner (0) leg-before to leave the Giants tottering at 9 for 3 inside the first three overs. Pandey made matters worse for Gujarat, getting Dayalan Hemlatha (5) caught behind by wicketkeeper Taniya Bhatia, and Kapp then snaffled the big wicket of the in-form Harleen Deol (20), who was pinned in front of the stumps with the ball nipping back in. Deol, the third highest run-scorer in the league and her team's best batter, looked promising during her stay in the middle as she cracked four boundaries to make 20 off 14 balls.","pubDate":"2023-03-11 17:16:10","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"This half-century might get converted into a double hundred\" - Sunil Gavaskar lauds Virat Kohli's knock in 4th IND vs AUS Test","link":"https://www.sportskeeda.com/cricket/news-this-half-century-might-get-converted-double-hundred-sunil-gavaskar-lauds-virat-kohli-s-knock-4th-ind-vs-aus-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Kartik Iyer"],"video_url":null,"description":null,"content":"Sunil Gavaskar expects Virat Kohli to convert his half-century in the fourth and final Test of the Border-Gavaskar Trophy into a double hundred. Kohli was unbeaten on 59 as India ended Day 3 at 289/3 at the Narendra Modi Stadium in Ahmedabad on Saturday, March 11. The hosts still trail Australia by 191 runs with seven first-innings wickets in hand heading into the penultimate day of the series. During a discussion on Star Sports, Gavaskar opined that Virat Kohli might convert his fifty into a massive three-figure score, elaborating: The former Indian skipper feels the modern batting great would want to compensate for his prolonged lean patch in Test cricket, observing: Kohli last scored a ton in the longest format in the pink-ball Test against Bangladesh in November 2019. He has managed 1087 runs at an underwhelming average of 27.17 in 24 matches since that century. Sanjay Bangar was pleased with Kohli's approach against the spinners on Saturday, saying: The former Indian batting coach was particularly appreciative of Kohli's wristwork, explaining: Kohli strung together a 58-run third-wicket partnership with Shubman Gill (128) before the latter was trapped in front of the wickets by Nathan Lyon. The former Indian skipper and Ravindra Jadeja (16*) have so far added 44 runs for the fourth wicket. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : Will Virat Kohli score a century on Day 4 of the Ahmedabad Test? Yes No 36 votes Quick Links","pubDate":"2023-03-11 16:53:04","image_url":"https://staticc.sportskeeda.com/editor/2023/03/8fe58-16785374343963-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"[Watch] Fans in Narendra Modi Stadium chant Rishabh Pant's name as Nathan Lyon fields near the boundary on day 3 of 4th India vs Australia Test","link":"https://www.sportskeeda.com/cricket/news-watch-fans-narendra-modi-stadium-chant-rishabh-pant-s-name-nathan-lyon-fields-near-boundary-day-3-4th-india-vs-australia-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Balakrishna"],"video_url":null,"description":null,"content":"Ahmedabad fans indulged in fun banter with Nathan Lyon when he was fielding near the boundary on Day 3 of the fourth Test between India and Australia (Saturday, March 11). Fans chanted Rishabh Pant's name repeatedly as Lyon tried to concentrate on the match. Pant and Lyon have a history between them in Test cricket. During the previous two Border-Gavaskar trophy series in Australia, the duo engaged in intense battles on the cricket field. Pant is currently out of action as he is recovering from an accident in December. A fan took to Twitter to give a glimpse of the incident involving the audience and Nathan Lyon at the Narendra Modi stadium by sharing a video. You can watch it below: Team India's top-order batted sensibly to bring their team back into the match after Australia scaled a huge total of 480 in their first innings. Shubman Gill led the way by compiling a magnificent century, his second in the Test format. Virat Kohli (59*), Cheteshwar Pujara (42), and Rohit Sharma played supporting roles with their contributions as India ended Day 3 with 289/3 on the scoreboard. The hosts trail by 191 runs going into the fourth day of the series finale. Shubman Gill shed light on his knock after the play, saying: Instagram Post Do you think India can still win the 4th Test? Sound off your views in the comments section. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-03-11 16:42:46","image_url":"https://staticc.sportskeeda.com/editor/2023/03/e0aae-16785353442288-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets","link":"https://www.firstpost.com/firstcricket/sports-news/gujarat-giants-vs-delhi-capitals-highlights-wpl-2023-match-9-in-mumbai-delhi-thrash-gujarat-by-10-wickets-12275852.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets","content":"Cricket Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets WPL 2023 LIVE Score, GG vs DC Get WPL 2023 live score and latest updates from Gujarat Giants vs Delhi Capitals Women's Premier League match at Firstpost FirstCricket Staff March 11th, 2023 21:55:37 IST GG vs DC, WPL 2023 LIVE Score: Captains Meg Lanning and Sneh Rana pose for a picture ahead of toss in Match 9 of WPL 2023 between Gujarat Giants and Delhi Capitals. Sportzpics FP commentary Quick Scorecard Full scorecard Ball by ball commentary Gujarat Giants Vs Delhi Capitals At Dr. DY Patil Sports Academy, Navi Mumbai, 11 March, 2023 11 March, 2023 Starts 19:30 (IST) Match Ended Gujarat Giants 105/9 (20.0 ov) Match 9 Delhi Capitals 107/0 (7.1 ov) Delhi Capitals beat Gujarat Giants by 10 wickets Toss report: Gujarat Giants announced two changes in their playing XI after winning the toss and opting to bat against Delhi Capitals in the Women’s Premier League (WPL) in Mumbai. South African opener Laura Wolvaardt and Australian leg-spinner Georgia Wareham were included in place of Sophia Dunkley and Annabel Sutherland. Wolvaardt, who played a key role in South Africa’s run to the final of the T20 World Cup last month, had earlier been announced as injured skipper Beth Mooney’s replacement, with Indian all-rounder Sneh Rana taking over the leadership duties. The Capitals, meanwhile, will be hoping to return to winning ways after getting outplayed by the Mumbai Indians in what was their first defeat of the inaugural WPL. The Meg Lanning-led side, which started off with commanding victories over Royal Challengers Bangalore and UP Warriorz, were bowled out for a paltry 105 with MI chasing the target down with eight wickets and five overs to spare. Teams: Delhi Capitals : Meg Lanning (c), Shafali Verma, Jemimah Rodrigues, Laura Harris, Marizanne Kapp, Jess Jonassen, Taniya Bhatia (wk), Minnu Mani, Radha Yadav, Shikha Pandey, Tara Norris Gujarat Giants : S Meghana, Laura Wolvaardt, Harleen Deol, Ashleigh Gardner, Dayalan Hemalatha, Georgia Wareham, Sneh Rana (c), Kim Garth, Sushma Verma (wk), Tanuja Kanwar, Mansi Joshi Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 11, 2023 21:55:37 IST Tags: Cricket Delhi Capitals Gujarat Giants Wpl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-11 16:25:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Meg-Lanning-Sneh-Rana-WPL-2023-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad?","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-virat-kohli-century-loading-will-the-wait-be-finally-over-at-ahmedabad-12276082.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad?","content":"Cricket India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad? Still unbeaten on 59, Kohli has the best possible chance to end his long wait for a Test hundred which he last scored in the November 2019 Test against Bangladesh Sahil Malhotra March 11th, 2023 21:55:28 IST Virat Kohli plays a cover drive on Day 3 of the fourth Test between India and Australia in Ahmedabad. Sportzpics for BCCI In the 62nd over of the Indian innings, commentator Harsha Bhogle was furious when the DRS replays were being displayed on the giant screen. It wasn’t because of Cheteshwar Pujara not getting the big score after a solid start or the fact that he went with the DRS on a call which looked plumb in front. The veteran commentator’s anger was directed towards the Ahmedabad crowd, which moments after replays confirmed no bat on that LBW shout, rushed to the edge of the stands and started chanting “Kohli, Kohli”. The umpire was yet to officially announce that the decision stayed and before Pujara could even sink in the moment and commence the toughest walk, the crowd was chanting for Kohli, the next man in to bat. Report: Gill, Kohli lead India’s fightback in Ahmedabad “It’s disrespect to Pujara when the DRS is on,” Bhogle was not a happy man as “Kohli, Kohli” only grew louder. The moment arrived and Pujara, after scoring a 121-ball 42, took the long staircase back to the hut. The fans didn’t have to wait for Kohli to descend the same staircase as the former Indian skipper was already in the dugout near the ropes and walked out to the middle. Not in the manner Bhogle would have liked. A lot was at stake for Kohli. The right-hander was undergoing a lean patch with the bat in Tests and was in desperate need of a big score against his name. Read: Gill takes the giant Test stride with fluent 128 against Australia Nagpur, Delhi and Indore were turners where most struggled but Kohli batted beautifully in Delhi but the big score continued to elude him. With the scoreboard reading 187/2, the 34-year-old couldn’t have asked for a better time and strip to return to his prime days. No matter how much the pitch and conditions suit batting, there’s still work to be done and Kohli would have known that. Few deliveries tested the right-hander early in the innings and he didn’t look in control against both Nathan Lyon and Todd Murphy. He was jabbing harder than what was required on this surface and looked tentative while defending. Oohs and aahs were in plenty but Kohli was happy to work around for singles and stole a few in the circle too. Ease vs pace Mitchell Starc returned to the attack in the 73rd over of the innings and was set to bowl to Kohli who was going to face seam for the first time in the series. Over the last three Tests, Kohli didn’t face a single delivery by a seamer. Steve Smith wanted to use Starc’s angle to his advantage but the move backfired as two boundaries in that over allowed Kohli to just ease himself in. A leaning off-drive and an easy clip off the pads moved Kohli from 9 to 17 and there was no looking back since then. 🏏 @imVkohli 🆚 Mitchell Starc Quality shots on display 👌👌 #TeamIndia 🇮🇳 | #INDvAUS | @mastercardindia pic.twitter.com/4J9vHV9GGm — BCCI (@BCCI) March 11, 2023 Before Starc’s introduction, Kohli was under the pump at just eight runs off 31 balls but looked positive after the first few boundaries and collected 23 off the next 27 balls. The bad balls were put away and he just looked to score. Even during the deliveries, he defended, Kohli got into scoring positions and had a positive approach. Something which worked for him. The long wait Since January 2022, the last time he scored a fifty in Tests, Kohli for sure has tried a lot of things but nothing has worked in the 15 innings. He looked very solid in the 44-run knock during the Delhi Test and seemed to have found a template against off-spin. He just kept planting the front foot forward and keep working them towards the region between long-on and mid-wicket for singles. Smith did try to plug that area with a silly mid-on and a mid-wicket but Kohli continued finding the little gap and kept rotating the strike. No wonder it was his most productive shot and helped him collect around 30% of the runs he scored today. Still unbeaten on 59, Kohli has the best possible chance to end an even longer wait. The wait for a Test hundred which he last scored in the November 2019 Test against Bangladesh. There have been few crucial hands in between but the three digits have eluded him. There will surely be a loud cheer, just like it was when he walked back unbeaten at stumps, when he walks out to bat again in the morning session and Kohli now has a golden opportunity to turn that into a roar with the long-awaited hundred. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 11, 2023 21:55:28 IST Tags: Cricket India Vs Australia India Vs Australia 2023 Virat Kohli Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-11 16:25:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Virat-Kohli-Australia-Ahmedabad-Day-3-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Can Sineth change the fortunes of Royal against Thomians?","link":"http://island.lk/can-sineth-change-the-fortunes-of-royal-against-thomians/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"After suffering back-to-back defeats at the hands of Trinity, Royal will look forward to shrugging off disappointments of the tail end of the season against arch-rivals S. Thomas’ when the two teams meet in the 144th Battle of the Blues starting at the SSC on March 15. Dasis Manchanayake led Royal have mustered the support […]","content":"After suffering back-to-back defeats at the hands of Trinity, Royal will look forward to shrugging off disappointments of the tail end of the season against arch-rivals S. Thomas’ when the two teams meet in the 144th Battle of the Blues starting at the SSC on March 15. Dasis Manchanayake led Royal have mustered the support of Sri Lanka Cricket to field their Sri Lanka Under 19 player Sineth Jayawardena at the historic encounter. Jayawardena and two other Sri Lanka Under 19 players have received exemptions to play their respective Big Matches despite being selected in the Youth team to take part in a tri-nation tournament in UAE. Jayawardena was not a part of the Royal teams that suffered defeats at the hands of Trinity. Royal have won without and with him this season, but it seems that the team that had entered the past two Big Matches as favourties want to leave no stone unturned in fighting their arch-rivals. His stay was limited to 38 first innings balls at the last edition and when spectators return to the annual encounter after a lapse of two years Jayawardena will be one of the key players to watch. The top-order batsman could be the only change to the team that played the Under 19 Division I Tier ‘A’ quarter-final match against Trinity. The defeats at the hands of Trinity were probably the only disappointments experienced by Royal in a five-match league tournament involving 18 teams this season as they reached the business end of the tourney. The Thomians on the other hand could not reach the last eight despite remaining unbeaten in Group ‘Z’ of the Tier ‘A’ tournament. They registered four outright victories but all came during the third term on highly favourable home ground conditions where they dismissed teams batting first for low scores. They were the underdogs for two consecutive Big Matches but this time the team led by Romesh Mendis have shrugged off that tag and are on par with Royal. Mendis is the batsman to watch in the Thomian camp. Both teams possess formidable pace attacks and that department could determine the outcome of the 144th encounter. (RF) Published on By By the time the seventh over of the first innings was completed, Gujarat Giants had slipped to 33 for 7 after opting to bat as Marizanne Kapp was breathing fire with a spell that tore apart their batting. By the time the seventh over of the chase was bowled, Shafali Verma had taken Delhi Capitals within three runs of victory. It was complete obliteration of the Giants, first by Kapp’s 5 for 15 and then by Shafali’s 28-ball 76 not out, which included 10 fours and 5 sixes, as the Capitals returned to winning ways with a comprehensive 10-wicket victory, going past Giants’ total of 105 in just 7.1 overs. Brief scores: 105/9 in 20 overs (Kim Garth 32*; Marizanne Kapp 5-15, Shikha Pandey 3-26) 107/0 in 7.1 overs (Shafali Verma 76*, Meg Lanning 21*) Published on By A dominant performance from South Africa with the ball in the final innings helped them cleansweep the two-match Test series against West Indies on Saturday (March 11). South Africa, favourites to clinch the game by stumps on the third day, were rampant with the ball after setting the visitors a target of 391. West Indies were reduced to 34/6 at one stage before getting all out eventually for 106. Resuming at 287/7, the hosts lost skipper Temba Bavuma early for 172. Kagiso Rabada cleared the ropes a couple of times that helped them go past 300 before Jason Holder brought an end to the innings. A target of 391 was always going to be a tall task for a side that had failed to get anywhere closer to 300 so far in the series. Even though the visitors made a watchful start, scoring 20 off the first 10 overs without a wicket, South Africa made inroads after breaking that stand. Rabada proved to be Kraigg Brathwaite’s nemesis again as he got one delivery to come back in after pitching to trap the skipper leg-before-wicket. Raymon Reifer then bagged a second-ball duck as he edged a delivery going down leg to the keeper in the same over. Simon Harmer then got into the act as Tagenarine Chanderpaul edged a delivery to second slip to reduce the visitors to 25/3. The procession continued as Harmer then got rid of Jermaine Blackwood whereas Keshav Maharaj got one to turn big to breach Roston Chase’s defence before successfully getting a call in his favour for lbw against Kyle Mayers. But while celebrating the wicket, Maharaj suffered a freak injury and had to be stretchered off the field. At 34/6, the result was a foregone conclusion as Joshua Da Silva and Holder came out swinging post the lunch break. Da Silva hammered Harmer for a six en route to making 34 whereas Holder found the boundary four times in his 19. The two players added 58 for the seventh wicket in their breezy partnership before Gerald Coetzee broke the stand. He breached Da Silva’s defence as well a few overs later before Harmer completed the formalities. Brief scores: South Africa 320 (Aiden Markram 96; Kyle Mayers 3-32) 321 (Temba Bavuma 172; Kyle Mayers 3-46) West Indies 251 (Jason Holder 81*; Gerald Coetzee 3-41) 106 (Joshua Da Silva 34; Gerald Coetzee 3-37) Published on By Shubman Gill’s second Test century led India’s confident reply to Australia’s 480 on the third day in Ahmedabad. The opener put up fifty-plus stands with Rohit Sharma, Cheteshwar Pujara and Virat Kohli, who also helped himself to his first fifty in 16 innings. On a pitch that held true for the third day running, Australia found the going tough to break through but struck once in every session, the last of which was Gill who was LBW to Nathan Lyon. Until then Gill had looked solid in the company of Kohli, as the duo played the attritional game well, and took every boundary opportunity that came their way. Brief Scores : 480 (Usman Khawaja 180, Cameron Green 114; R Ashwin 6-91) 289/3 (Shubman Gill 128, Virat Kohli 59*, Cheteshwar Pujara 42)","pubDate":"2023-03-11 23:40:45","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live: NZ Aim To Gain Advantage","link":"https://sports.ndtv.com/cricket/new-zealand-vs-sri-lanka-1st-test-day-4-live-score-updates-nz-aim-to-gain-advantage-vs-sl-3853305","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live Score Updates: NZ aim to gain advantage over SL.","content":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live Score Updates: Sri Lanka look to strengthen their position on Day 4 of the first Test encounter against New Zealand in Christchurch. At the end of Day 3, Sri Lanka were 83 for three in their second innings with a lead of 65 runs. Angelo Mathews was not out 20 while Prabath Jayasuriya was batting on two. For the Kiwis, Blair Tickner took three crucial wickets. Earlier, Daryll Mitchell slammed a gritty century and Matt Henry scored 72 as New Zealand recovered from 151 for five to 373 and was able to take a 18-run lead. ( LIVE SCORECARD ) No run. No run. Bye. Short and on off. Angelo Mathews pulls it hard to square leg. Lands short! Daryl Mitchell comes 'round the wicket and goes short, on off. Dinesh Chandimal miscues his pull shot and fortunately it lands short of Michael Bracewell at square leg. Good length, on leg stump. Angelo Mathews flicks it behind square on the leg side off his hips. One taken. Daryl Mitchell is introduced into the attack. An inswinger, full and on off. Dinesh Chandimal shuffles and defends it watchfully. Halt! Dinesh Chandimal has taken a blow on his right glove and has called for the physio straightway. The physio sprints out onto the field and tapes the finger of the batter. After receiving treatment, Chandimal puts his gloves back on and we are all set to resume. Woah! Dinesh Chandimal gets pinged on his gloves! It is a length ball, on off. It flies off the deck and catches Dinesh Chandimal by surprise here. He goes back and tries to defend it but takes a blow on his finger. A dot now! Third one of the over. A length ball, wide of off. Dinesh Chandimal shuffles across and makes a good leave. Shorter, too wide. Angelo Mathews cuts it to deep point but only for one as there is protection in the deep. Much fuller, but still very wide to bother Angelo Mathews as he makes yet another leave. Good length, outside off. Angelo Mathews leaves it alone for the keeper. On the pads, flicked to square leg for one. Runs are coming quite easily now for Sri Lanka. The lead moves to 120 runs. Floated and full, around off. Dinesh Chandimal uses his feet and tucks it to mid-wicket for one. He racks up 5000 runs in his Test career. A single now as this is full one is knocked down to long on. Slightly short, outside off. Angelo Mathews punches it through point off the back foot. The call is for two and get it. Dinesh Chandimal charges down the wicket and flicks this full ball to wide long on for a single. Fuller, outside off. Dinesh Chandimal blocks it on his front foot. A wild swing and a miss! Back of a length, wide outside off, shaping further away. Angelo Mathews goes after it, but misses it completely. Almost carries! It is a full-length ball, outside off. Angelo Mathews drives it back to the bowler but off the inner half. Tim Southee collects it on a bounce. Outside off, left alone. FOUR! Nicely played. Back of a length, on the body. Angelo Mathews heaves it across the line and places it really well to pierce the gap in the deep beind square on the leg side. The ball sneaks into the boundary. Good length, outside off. Angelo Mathews makes the leave. Tim Southee goes full and on off. Angelo Mathews drives it nonchalantly towards mid off. Blair Tickner is quick to get to his right and make a stop. Tossed up, on off. Dinesh Chandimal tucks it to short mid-wicket. 5 runs off the over. Full and on off, blocked solidly. A single now as this is pushed to the off side. FOUR! Angelo Mathews now getting into the act. It is a full delivery. Angelo Mathews gets low and sweeps this to deep mid-wicket from outside off. It races into the fence. A bit quicker, and full, on off. Angelo Mathews pushes it to the left of the bowler. Floated, full and on off. Dinesh Chandimal gets to the pitch of it and flicks it down to long on for a single. Much fuller this time, wide outside off, shaping further away. Angelo Mathews shoulders his arms at it. A good end to the over. Sri Lanka now lead by 104 runs. It is a full-length ball, on off. Angelo Mathews pats it back to the bowler. It is full, tailing into the pads. Dinesh Chandimal clips it to mid-wicket and gets a single. A sharp bouncer this time, on middle. Dinesh Chandimal ducks under it. FOUR! Powerfully hit. Back of a length, on off. Dinesh Chandimal gets on top of it and pulls it through mid-wicket for a boundary. Tim Southee hurls in a length ball, that comes back in from outside off. Dinesh Chandimal gets forward and defends. Floated and full, outside off. Angelo Mathews strides in and defends it off the bottom half. Full, on leg. Dinesh Chandimal flicks it to square leg and crosses. Tossed up, full and outside off. Dinesh Chandimal lunges and blocks it into the deck. Darted on the pads, tucked towards mid-wicket. Dinesh Chandimal now uses his feet to this full one, and clips it to short mid-wicket. Michael Bracewell starts with a full one, on off. Dinesh Chandimal prods and nudges it to mid-wicket. Time for some spin as Michael Bracewell comes on to bowl. A maiden for Tim Southee! It is a full ball, on off, nips away a touch. Angelo Mathews defends it with full face. Outside off, left alone without any trouble. Full length, in the channel. Angelo Mathews prods and blocks it back to the bowler. Good length, wide of off. Angelo Mathews leaves it alone. It is much fuller, on middle and leg. Angelo Mathews clips it towards mid-wicket.","pubDate":"2023-03-11 18:36:04","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"LLC 2023: एक ही ओवर में तीन विकेट, कुल 4 शिकार, हरभजन सिंह ने तो क्रिस गेल की वाट लगा दी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/llc-2023-harbhajan-singh-takes-four-wickets-bowled-chris-gayle-around-his-legs-watch-video/articleshow/98570772.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends league cricket 2023 में इंडिया महाराजा अब भी अपनी पहली जीत की तलाश में भटक रही है। वेस्ट एंड पार्क इंटरनेशनल क्रिकेट स्टेडियम में शनिवार रात मुकाबले मेंवर्ल्ड जायंट्स ने दो रन से जीत दर्ज की।","content":"कतर में खेले जा रहे लीजेंड्स लीग क्रिकेट टूर्नामेंट में इंडिया महाराजास को लगातार दूसरी हार झेलनी पड़ी। वर्ल्ड जायंट्स ने शनिवार रात इंडिया महाराजा को दो रन से हरा दिया। कप्तान गौतम गंभीर की लगातार दूसरी फिफ्टी बेकार गई, इससे पहले उद्घाटन मैच में शुक्रवार रात एशिया लायंस ने भी इंडिया महाराजा को हराया था। इस दिल तोड़ने वाली हार के बीच हरभजन सिंह की कातिलाना गेंदबाजी ने पूरी दुनिया का मन मोह लिया है। दो ओवर में भज्जी ने सिर्फ 13 रन देकर चार बड़े विकेट चटकाए, जिसमें तीन शिकार तो एक ही ओवर में किए। दरअसल, वर्ल्ड जायंट्स के कप्तान आरोन फिंच ने टॉस जीतकर पहले बल्लेबाजी का फैसला किया। उन्होंने क्रिस गेल के साथ पारी की शुरुआत की, लेकिन वेस्टइंडीज के पूर्व सलामी बल्लेबाज भारत महाराजा के गेंदबाजों को ज्यादा नुकसान नहीं पहुंचा सके क्योंकि अनुभवी ऑफ स्पिनर हरभजन सिंह ने उन्हें तीसरे ही ओवर में चलता किया। लेग स्टंप के बाहर फेंकी एक धीमी गति की बॉल को वाइड समझकर गेल ने छोड़ना चाहा, लेकिन शार्प टर्न लेते हुए गेंद सीधे लेग स्टंप में घुस गई। 4 रन पर गेल की पारी का अंत करने के बाद भज्जी को अगला मौका 16वें ओवर में मिला। यह टर्बनेटर का दूसरा ओवर था, जिसकी छह गेंदों में उन्होंने तीन शिकार कर डाले। पहली गेंद पर आयरलैंड वाले केविन ओ ब्रायन (4) को मोहम्मद कैफ के हाथों कैच आउट करवाने के बाद तीसरी गेंद पर रॉस टेलर (1) और पांचवीं पर मोर्न वैन विक (1) को चलता किया। इस ओवर में उन्होंने सिर्फ दो रन दिए। यहीं से वर्ल्ड जायंट्स की रनगति पर भी अंकुश लगा। एक वक्त स्कोर आसानी से 200 रन के पार जाते लग रहा था, जो बाद में 166/8 तक ही सीमित रहा। इस बीच कप्तान आरोन फिंच ने 53 जबकि शेन वॉटसन ने 55 रन बनाए। इंडिया महाराजा ने 167 रन के लक्ष्य को साधने की पूरी कोशिश की, लेकिन सफलता हाथ नहीं लगी। कप्तान गौतम गंभीर और रॉबिन उथप्पा ने मिलकर अच्छी शुरुआत दिलाई थी, लेकिन उसके बाद कोई अच्छी साझेदारी नहीं हुई। गौतम गंभीर ने 42 गेंद में 68 रन बनाए। वर्ल्ड जायंट्स की ओर से रिकॉर्डो पॉवोल सबसे सफल गेंदबाज रहे, जिन्होंने 3 ओवर में 16 रन देकर 2 विकेट चटकाए।","pubDate":"2023-03-11 18:33:59","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jhye Richardson To Miss IPL 2023 Due To Injury, Unlikely To Play Ashes","link":"https://sports.ndtv.com/cricket/jhye-richardson-to-miss-ipl-2023-unlikely-to-play-ashes-series-3852511","keywords":null,"creator":null,"video_url":null,"description":"Jhye Richardson suffered a recurrence of hamstring issues while playing club cricket last week, during his attempt to return to action.","content":"Australian quick Jhye Richardson will be missing the upcoming edition of the Indian Premier League (IPL) and is also likely to miss the Ashes series against England after undergoing surgery to overcome issues in his hamstring. Richardson suffered a recurrence of hamstring issues while playing club cricket last week, during his attempt to return to action after pulling his hamstring during the Big Bash League (BBL). He was also ruled out of the ODI series against India starting from March 17. He took the surgery option in order to find a long-term solution. He was due to represent Mumbai Indians (MI) in IPL after a stint with Punjab Kings in 2021. \"Injuries are a big part of cricket, that's a fact,\" Richardson tweeted as quoted by ESPNCricinfo. \"Frustrating? Absolutely. But I am now in a scenario where I can get back to doing what I love and work bloody hard to become an even better player than before. One step back, two steps forward. Let's do this,\" added Richardson. Richardson's body has let him down during the last two seasons as he had undergone major shoulder surgery in 2019, which led to him missing the ICC Cricket World Cup and the Ashes that year. After taking a maiden five-wicket haul in Tests in Adelaide in December 2021, his first Test since his shoulder injury, but a nagging heel injury ruled out of the next match and he has not featured in the longer format ever since. Jhye played in T20I and ODI series during the 2022 tour to Sri Lanka. He had an interrupted pre-season for Western Australia. His soft-tissue concerns led to him playing just two Sheffield Shield and one Marsh Cup match before BBL. \"Obviously it is devastating that he has re-injured that hamstring again and he is going to miss a significant amount of time to get his hamstring right,\" Western Australia coach Adam Voges said. \"We all feel for Jhye and we are hopeful that whatever they come with as a solution can fix his hamstring and we get him back out there because it has been a tough 12 months for him,\" concluded Voges.","pubDate":"2023-03-11 17:55:56","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Steve Smith and Marnus Labuschagne hilariously race against one another to the dressing room","link":"https://www.sportskeeda.com/cricket/news-watch-steve-smith-marnus-labuschagne-hilariously-race-one-another-dressing-room?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Day 3 of the fourth Test between India and Australia at the Narendra Modi Stadium in Ahmedabad witnessed an amusing incident between Steve Smith and Marnus Labuschagne during a break session. The two batting stalwarts appeared to be racing against one another while going into the dressing room, with Usman Khawaja walking calmly behind the pair. While Smith started behind Labuschagne, the captain got ahead of his teammate soon enough. You can watch a video of this light moment below: Smith and Labuschagne have arguably been one of the most prolific batting pairs in the last year and a half. The duo first came together during the fourth Test in Manchester of the 2019 Ashes series and have continued to pile on the runs against almost teams. Labuschagne is also the number-one-ranked Test batter in the world. The right-hander hasn't been at his best in the ongoing Test series, registering a high score of just 38 in six innings. The 33-year-old came out to bat after Marnus Labuschagne departed for three but inside-edged a delivery onto the stumps as he ended with 38 off 135 balls. However, the New South Wales batter received immense praise for his captaincy skills, especially after leading Australia to a nine-wicket victory in Indore. Following two humbling losses in Nagpur and Delhi, the visitors bounced back well on the back of some exceptional bowling performances. Their commanding win also ensured them a spot in the World Test Championship (WTC) final, which is set to be played in June at The Oval. India are yet to book a place in the WTC decider and need a win to do so or require Sri Lanka to lose at least one Test in their ongoing series against New Zealand . Usman Khawaja has been Australia's batting star in Ahmedabad after his splendid 180, while Cameron Green also starred with 114. Their massive contributions shepherded Australia to 480. In response, the hosts are 289-3 at the end of Day 3. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-03-11 17:41:33","image_url":"https://staticc.sportskeeda.com/editor/2023/03/76000-16785374259954-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL: Shafali, Kapp Fire Delhi Capitals To 10-wicket Win vs Gujarat Giants","link":"https://sports.ndtv.com/cricket/shafali-kapp-fire-dc-to-10-wicket-win-against-gg-in-wpl-3853102","keywords":null,"creator":null,"video_url":null,"description":"Shafali Verma smashed a 19-ball fifty as Delhi Capitals thrashed Gujarat Giants by 10 wickets in the Women's Premier League.","content":"Shafali Verma's explosive unbeaten half-century and Marizanne Kapp's sensational five-wicket haul fired Delhi Capitals to a massive 10-wicket win against Gujarat Giants in the Women's Premier League on Saturday. Kapp broke the back of Gujarat Giants' innings with a stunning spell of 4-0-15-5, taking the top four wickets in the line-up as Delhi bowlers produced a clinical display to keep the opponents to a lowly 105 for 9 at the DY Patil Stadium here. In reply, Shafali came out firing on all cylinders, clobbering 10 fours and five sixes to produce a ruthless knock of 76 not out off 28 balls in the company of captain Meg Lanning (21 not out from 15 balls) as DC completed the chase in a mere 7.1 overs. Delhi Capitals made their intentions clear right from the word go, with Shafali taking a special liking for the Gujarat bowler Ashleigh Gardner, smacking her for four fours and a six in the fourth over to collect 23 runs. Shafali continued to attack, this time hitting Tanuja Kanwar for a couple of sixes to help Delhi knock off the majority of their target, with 87 runs coming in the powerplay. Shafali brought up her second half-century in the WPL, from just 19 balls as the senior pro in Lanning happily chose to take the backseat and enjoy the right-handed batter's power hitting, which tore apart the Gujarat's bowling attack. Earlier, Kapp produced a stunning spell at the top to reduce the Giants to a precarious 33 for 6 after seven overs, a position from which they could never recover. After Kapp set the tone, the others continued to apply constant pressure on the Gujarat batters. India's left-arm spinner Radha Yadav returned with figures of 4-0-19-1, Minnu Mani gave away just 18 runs in her three overs and Australia's Jess Jonassen conceded 19 runs from her four overs. The seasoned Shikha Pandey also had a memorable outing, taking 3 for 26 from her four overs. Kim Garth (32 not out) and Georgia Wareham tried to weather the storm and get some much-needed runs for their side, but their efforts could only provide Gujarat Giants' innings some respectability. While Gujarat's lower order, which did bulk of the scoring, did not attempt risky strokes for quick runs, they also could not find gaps for boundaries. There were no boundaries hit between overs 13-16. Additionally, not a single six was hit in Gujarat Giants' innings. Kapp provided Delhi with a perfect start, cleaning up Sabbhineni Meghana (0) and Wolvaardt (1) before trapping the big gun Ashleigh Gardner (0) leg-before to leave the Giants tottering at 9 for 3 inside the first three overs. Pandey made matters worse for Gujarat, getting Dayalan Hemlatha (5) caught behind by wicketkeeper Taniya Bhatia, and Kapp then snaffled the big wicket of the in-form Harleen Deol (20), who was pinned in front of the stumps with the ball nipping back in. Deol, the third highest run-scorer in the league and her team's best batter, looked promising during her stay in the middle as she cracked four boundaries to make 20 off 14 balls.","pubDate":"2023-03-11 17:16:10","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"This half-century might get converted into a double hundred\" - Sunil Gavaskar lauds Virat Kohli's knock in 4th IND vs AUS Test","link":"https://www.sportskeeda.com/cricket/news-this-half-century-might-get-converted-double-hundred-sunil-gavaskar-lauds-virat-kohli-s-knock-4th-ind-vs-aus-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Kartik Iyer"],"video_url":null,"description":null,"content":"Sunil Gavaskar expects Virat Kohli to convert his half-century in the fourth and final Test of the Border-Gavaskar Trophy into a double hundred. Kohli was unbeaten on 59 as India ended Day 3 at 289/3 at the Narendra Modi Stadium in Ahmedabad on Saturday, March 11. The hosts still trail Australia by 191 runs with seven first-innings wickets in hand heading into the penultimate day of the series. During a discussion on Star Sports, Gavaskar opined that Virat Kohli might convert his fifty into a massive three-figure score, elaborating: The former Indian skipper feels the modern batting great would want to compensate for his prolonged lean patch in Test cricket, observing: Kohli last scored a ton in the longest format in the pink-ball Test against Bangladesh in November 2019. He has managed 1087 runs at an underwhelming average of 27.17 in 24 matches since that century. Sanjay Bangar was pleased with Kohli's approach against the spinners on Saturday, saying: The former Indian batting coach was particularly appreciative of Kohli's wristwork, explaining: Kohli strung together a 58-run third-wicket partnership with Shubman Gill (128) before the latter was trapped in front of the wickets by Nathan Lyon. The former Indian skipper and Ravindra Jadeja (16*) have so far added 44 runs for the fourth wicket. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : Will Virat Kohli score a century on Day 4 of the Ahmedabad Test? Yes No 36 votes Quick Links","pubDate":"2023-03-11 16:53:04","image_url":"https://staticc.sportskeeda.com/editor/2023/03/8fe58-16785374343963-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"[Watch] Fans in Narendra Modi Stadium chant Rishabh Pant's name as Nathan Lyon fields near the boundary on day 3 of 4th India vs Australia Test","link":"https://www.sportskeeda.com/cricket/news-watch-fans-narendra-modi-stadium-chant-rishabh-pant-s-name-nathan-lyon-fields-near-boundary-day-3-4th-india-vs-australia-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Balakrishna"],"video_url":null,"description":null,"content":"Ahmedabad fans indulged in fun banter with Nathan Lyon when he was fielding near the boundary on Day 3 of the fourth Test between India and Australia (Saturday, March 11). Fans chanted Rishabh Pant's name repeatedly as Lyon tried to concentrate on the match. Pant and Lyon have a history between them in Test cricket. During the previous two Border-Gavaskar trophy series in Australia, the duo engaged in intense battles on the cricket field. Pant is currently out of action as he is recovering from an accident in December. A fan took to Twitter to give a glimpse of the incident involving the audience and Nathan Lyon at the Narendra Modi stadium by sharing a video. You can watch it below: Team India's top-order batted sensibly to bring their team back into the match after Australia scaled a huge total of 480 in their first innings. Shubman Gill led the way by compiling a magnificent century, his second in the Test format. Virat Kohli (59*), Cheteshwar Pujara (42), and Rohit Sharma played supporting roles with their contributions as India ended Day 3 with 289/3 on the scoreboard. The hosts trail by 191 runs going into the fourth day of the series finale. Shubman Gill shed light on his knock after the play, saying: Instagram Post Do you think India can still win the 4th Test? Sound off your views in the comments section. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-03-11 16:42:46","image_url":"https://staticc.sportskeeda.com/editor/2023/03/e0aae-16785353442288-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets","link":"https://www.firstpost.com/firstcricket/sports-news/gujarat-giants-vs-delhi-capitals-highlights-wpl-2023-match-9-in-mumbai-delhi-thrash-gujarat-by-10-wickets-12275852.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets","content":"Cricket Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets WPL 2023 LIVE Score, GG vs DC Get WPL 2023 live score and latest updates from Gujarat Giants vs Delhi Capitals Women's Premier League match at Firstpost FirstCricket Staff March 11th, 2023 21:55:37 IST GG vs DC, WPL 2023 LIVE Score: Captains Meg Lanning and Sneh Rana pose for a picture ahead of toss in Match 9 of WPL 2023 between Gujarat Giants and Delhi Capitals. Sportzpics FP commentary Quick Scorecard Full scorecard Ball by ball commentary Gujarat Giants Vs Delhi Capitals At Dr. DY Patil Sports Academy, Navi Mumbai, 11 March, 2023 11 March, 2023 Starts 19:30 (IST) Match Ended Gujarat Giants 105/9 (20.0 ov) Match 9 Delhi Capitals 107/0 (7.1 ov) Delhi Capitals beat Gujarat Giants by 10 wickets Toss report: Gujarat Giants announced two changes in their playing XI after winning the toss and opting to bat against Delhi Capitals in the Women’s Premier League (WPL) in Mumbai. South African opener Laura Wolvaardt and Australian leg-spinner Georgia Wareham were included in place of Sophia Dunkley and Annabel Sutherland. Wolvaardt, who played a key role in South Africa’s run to the final of the T20 World Cup last month, had earlier been announced as injured skipper Beth Mooney’s replacement, with Indian all-rounder Sneh Rana taking over the leadership duties. The Capitals, meanwhile, will be hoping to return to winning ways after getting outplayed by the Mumbai Indians in what was their first defeat of the inaugural WPL. The Meg Lanning-led side, which started off with commanding victories over Royal Challengers Bangalore and UP Warriorz, were bowled out for a paltry 105 with MI chasing the target down with eight wickets and five overs to spare. Teams: Delhi Capitals : Meg Lanning (c), Shafali Verma, Jemimah Rodrigues, Laura Harris, Marizanne Kapp, Jess Jonassen, Taniya Bhatia (wk), Minnu Mani, Radha Yadav, Shikha Pandey, Tara Norris Gujarat Giants : S Meghana, Laura Wolvaardt, Harleen Deol, Ashleigh Gardner, Dayalan Hemalatha, Georgia Wareham, Sneh Rana (c), Kim Garth, Sushma Verma (wk), Tanuja Kanwar, Mansi Joshi Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 11, 2023 21:55:37 IST Tags: Cricket Delhi Capitals Gujarat Giants Wpl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-11 16:25:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Meg-Lanning-Sneh-Rana-WPL-2023-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad?","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-virat-kohli-century-loading-will-the-wait-be-finally-over-at-ahmedabad-12276082.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad?","content":"Cricket India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad? Still unbeaten on 59, Kohli has the best possible chance to end his long wait for a Test hundred which he last scored in the November 2019 Test against Bangladesh Sahil Malhotra March 11th, 2023 21:55:28 IST Virat Kohli plays a cover drive on Day 3 of the fourth Test between India and Australia in Ahmedabad. Sportzpics for BCCI In the 62nd over of the Indian innings, commentator Harsha Bhogle was furious when the DRS replays were being displayed on the giant screen. It wasn’t because of Cheteshwar Pujara not getting the big score after a solid start or the fact that he went with the DRS on a call which looked plumb in front. The veteran commentator’s anger was directed towards the Ahmedabad crowd, which moments after replays confirmed no bat on that LBW shout, rushed to the edge of the stands and started chanting “Kohli, Kohli”. The umpire was yet to officially announce that the decision stayed and before Pujara could even sink in the moment and commence the toughest walk, the crowd was chanting for Kohli, the next man in to bat. Report: Gill, Kohli lead India’s fightback in Ahmedabad “It’s disrespect to Pujara when the DRS is on,” Bhogle was not a happy man as “Kohli, Kohli” only grew louder. The moment arrived and Pujara, after scoring a 121-ball 42, took the long staircase back to the hut. The fans didn’t have to wait for Kohli to descend the same staircase as the former Indian skipper was already in the dugout near the ropes and walked out to the middle. Not in the manner Bhogle would have liked. A lot was at stake for Kohli. The right-hander was undergoing a lean patch with the bat in Tests and was in desperate need of a big score against his name. Read: Gill takes the giant Test stride with fluent 128 against Australia Nagpur, Delhi and Indore were turners where most struggled but Kohli batted beautifully in Delhi but the big score continued to elude him. With the scoreboard reading 187/2, the 34-year-old couldn’t have asked for a better time and strip to return to his prime days. No matter how much the pitch and conditions suit batting, there’s still work to be done and Kohli would have known that. Few deliveries tested the right-hander early in the innings and he didn’t look in control against both Nathan Lyon and Todd Murphy. He was jabbing harder than what was required on this surface and looked tentative while defending. Oohs and aahs were in plenty but Kohli was happy to work around for singles and stole a few in the circle too. Ease vs pace Mitchell Starc returned to the attack in the 73rd over of the innings and was set to bowl to Kohli who was going to face seam for the first time in the series. Over the last three Tests, Kohli didn’t face a single delivery by a seamer. Steve Smith wanted to use Starc’s angle to his advantage but the move backfired as two boundaries in that over allowed Kohli to just ease himself in. A leaning off-drive and an easy clip off the pads moved Kohli from 9 to 17 and there was no looking back since then. 🏏 @imVkohli 🆚 Mitchell Starc Quality shots on display 👌👌 #TeamIndia 🇮🇳 | #INDvAUS | @mastercardindia pic.twitter.com/4J9vHV9GGm — BCCI (@BCCI) March 11, 2023 Before Starc’s introduction, Kohli was under the pump at just eight runs off 31 balls but looked positive after the first few boundaries and collected 23 off the next 27 balls. The bad balls were put away and he just looked to score. Even during the deliveries, he defended, Kohli got into scoring positions and had a positive approach. Something which worked for him. The long wait Since January 2022, the last time he scored a fifty in Tests, Kohli for sure has tried a lot of things but nothing has worked in the 15 innings. He looked very solid in the 44-run knock during the Delhi Test and seemed to have found a template against off-spin. He just kept planting the front foot forward and keep working them towards the region between long-on and mid-wicket for singles. Smith did try to plug that area with a silly mid-on and a mid-wicket but Kohli continued finding the little gap and kept rotating the strike. No wonder it was his most productive shot and helped him collect around 30% of the runs he scored today. Still unbeaten on 59, Kohli has the best possible chance to end an even longer wait. The wait for a Test hundred which he last scored in the November 2019 Test against Bangladesh. There have been few crucial hands in between but the three digits have eluded him. There will surely be a loud cheer, just like it was when he walked back unbeaten at stumps, when he walks out to bat again in the morning session and Kohli now has a golden opportunity to turn that into a roar with the long-awaited hundred. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 11, 2023 21:55:28 IST Tags: Cricket India Vs Australia India Vs Australia 2023 Virat Kohli Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-11 16:25:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Virat-Kohli-Australia-Ahmedabad-Day-3-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Can Sineth change the fortunes of Royal against Thomians?","link":"http://island.lk/can-sineth-change-the-fortunes-of-royal-against-thomians/","keywords":["Sports"],"creator":["Thilina Walpola"],"video_url":null,"description":"After suffering back-to-back defeats at the hands of Trinity, Royal will look forward to shrugging off disappointments of the tail end of the season against arch-rivals S. Thomas’ when the two teams meet in the 144th Battle of the Blues starting at the SSC on March 15. Dasis Manchanayake led Royal have mustered the support […]","content":"After suffering back-to-back defeats at the hands of Trinity, Royal will look forward to shrugging off disappointments of the tail end of the season against arch-rivals S. Thomas’ when the two teams meet in the 144th Battle of the Blues starting at the SSC on March 15. Dasis Manchanayake led Royal have mustered the support of Sri Lanka Cricket to field their Sri Lanka Under 19 player Sineth Jayawardena at the historic encounter. Jayawardena and two other Sri Lanka Under 19 players have received exemptions to play their respective Big Matches despite being selected in the Youth team to take part in a tri-nation tournament in UAE. Jayawardena was not a part of the Royal teams that suffered defeats at the hands of Trinity. Royal have won without and with him this season, but it seems that the team that had entered the past two Big Matches as favourties want to leave no stone unturned in fighting their arch-rivals. His stay was limited to 38 first innings balls at the last edition and when spectators return to the annual encounter after a lapse of two years Jayawardena will be one of the key players to watch. The top-order batsman could be the only change to the team that played the Under 19 Division I Tier ‘A’ quarter-final match against Trinity. The defeats at the hands of Trinity were probably the only disappointments experienced by Royal in a five-match league tournament involving 18 teams this season as they reached the business end of the tourney. The Thomians on the other hand could not reach the last eight despite remaining unbeaten in Group ‘Z’ of the Tier ‘A’ tournament. They registered four outright victories but all came during the third term on highly favourable home ground conditions where they dismissed teams batting first for low scores. They were the underdogs for two consecutive Big Matches but this time the team led by Romesh Mendis have shrugged off that tag and are on par with Royal. Mendis is the batsman to watch in the Thomian camp. Both teams possess formidable pace attacks and that department could determine the outcome of the 144th encounter. (RF) Published on By By the time the seventh over of the first innings was completed, Gujarat Giants had slipped to 33 for 7 after opting to bat as Marizanne Kapp was breathing fire with a spell that tore apart their batting. By the time the seventh over of the chase was bowled, Shafali Verma had taken Delhi Capitals within three runs of victory. It was complete obliteration of the Giants, first by Kapp’s 5 for 15 and then by Shafali’s 28-ball 76 not out, which included 10 fours and 5 sixes, as the Capitals returned to winning ways with a comprehensive 10-wicket victory, going past Giants’ total of 105 in just 7.1 overs. Brief scores: 105/9 in 20 overs (Kim Garth 32*; Marizanne Kapp 5-15, Shikha Pandey 3-26) 107/0 in 7.1 overs (Shafali Verma 76*, Meg Lanning 21*) Published on By A dominant performance from South Africa with the ball in the final innings helped them cleansweep the two-match Test series against West Indies on Saturday (March 11). South Africa, favourites to clinch the game by stumps on the third day, were rampant with the ball after setting the visitors a target of 391. West Indies were reduced to 34/6 at one stage before getting all out eventually for 106. Resuming at 287/7, the hosts lost skipper Temba Bavuma early for 172. Kagiso Rabada cleared the ropes a couple of times that helped them go past 300 before Jason Holder brought an end to the innings. A target of 391 was always going to be a tall task for a side that had failed to get anywhere closer to 300 so far in the series. Even though the visitors made a watchful start, scoring 20 off the first 10 overs without a wicket, South Africa made inroads after breaking that stand. Rabada proved to be Kraigg Brathwaite’s nemesis again as he got one delivery to come back in after pitching to trap the skipper leg-before-wicket. Raymon Reifer then bagged a second-ball duck as he edged a delivery going down leg to the keeper in the same over. Simon Harmer then got into the act as Tagenarine Chanderpaul edged a delivery to second slip to reduce the visitors to 25/3. The procession continued as Harmer then got rid of Jermaine Blackwood whereas Keshav Maharaj got one to turn big to breach Roston Chase’s defence before successfully getting a call in his favour for lbw against Kyle Mayers. But while celebrating the wicket, Maharaj suffered a freak injury and had to be stretchered off the field. At 34/6, the result was a foregone conclusion as Joshua Da Silva and Holder came out swinging post the lunch break. Da Silva hammered Harmer for a six en route to making 34 whereas Holder found the boundary four times in his 19. The two players added 58 for the seventh wicket in their breezy partnership before Gerald Coetzee broke the stand. He breached Da Silva’s defence as well a few overs later before Harmer completed the formalities. Brief scores: South Africa 320 (Aiden Markram 96; Kyle Mayers 3-32) 321 (Temba Bavuma 172; Kyle Mayers 3-46) West Indies 251 (Jason Holder 81*; Gerald Coetzee 3-41) 106 (Joshua Da Silva 34; Gerald Coetzee 3-37) Published on By Shubman Gill’s second Test century led India’s confident reply to Australia’s 480 on the third day in Ahmedabad. The opener put up fifty-plus stands with Rohit Sharma, Cheteshwar Pujara and Virat Kohli, who also helped himself to his first fifty in 16 innings. On a pitch that held true for the third day running, Australia found the going tough to break through but struck once in every session, the last of which was Gill who was LBW to Nathan Lyon. Until then Gill had looked solid in the company of Kohli, as the duo played the attritional game well, and took every boundary opportunity that came their way. Brief Scores : 480 (Usman Khawaja 180, Cameron Green 114; R Ashwin 6-91) 289/3 (Shubman Gill 128, Virat Kohli 59*, Cheteshwar Pujara 42)","pubDate":"2023-03-11 23:40:45","image_url":null,"source_id":"island","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live: NZ Aim To Gain Advantage","link":"https://sports.ndtv.com/cricket/new-zealand-vs-sri-lanka-1st-test-day-4-live-score-updates-nz-aim-to-gain-advantage-vs-sl-3853305","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live Score Updates: NZ aim to gain advantage over SL.","content":"New Zealand vs Sri Lanka, 1st Test, Day 4 Live Score Updates: Sri Lanka look to strengthen their position on Day 4 of the first Test encounter against New Zealand in Christchurch. At the end of Day 3, Sri Lanka were 83 for three in their second innings with a lead of 65 runs. Angelo Mathews was not out 20 while Prabath Jayasuriya was batting on two. For the Kiwis, Blair Tickner took three crucial wickets. Earlier, Daryll Mitchell slammed a gritty century and Matt Henry scored 72 as New Zealand recovered from 151 for five to 373 and was able to take a 18-run lead. ( LIVE SCORECARD ) No run. No run. Bye. Short and on off. Angelo Mathews pulls it hard to square leg. Lands short! Daryl Mitchell comes 'round the wicket and goes short, on off. Dinesh Chandimal miscues his pull shot and fortunately it lands short of Michael Bracewell at square leg. Good length, on leg stump. Angelo Mathews flicks it behind square on the leg side off his hips. One taken. Daryl Mitchell is introduced into the attack. An inswinger, full and on off. Dinesh Chandimal shuffles and defends it watchfully. Halt! Dinesh Chandimal has taken a blow on his right glove and has called for the physio straightway. The physio sprints out onto the field and tapes the finger of the batter. After receiving treatment, Chandimal puts his gloves back on and we are all set to resume. Woah! Dinesh Chandimal gets pinged on his gloves! It is a length ball, on off. It flies off the deck and catches Dinesh Chandimal by surprise here. He goes back and tries to defend it but takes a blow on his finger. A dot now! Third one of the over. A length ball, wide of off. Dinesh Chandimal shuffles across and makes a good leave. Shorter, too wide. Angelo Mathews cuts it to deep point but only for one as there is protection in the deep. Much fuller, but still very wide to bother Angelo Mathews as he makes yet another leave. Good length, outside off. Angelo Mathews leaves it alone for the keeper. On the pads, flicked to square leg for one. Runs are coming quite easily now for Sri Lanka. The lead moves to 120 runs. Floated and full, around off. Dinesh Chandimal uses his feet and tucks it to mid-wicket for one. He racks up 5000 runs in his Test career. A single now as this is full one is knocked down to long on. Slightly short, outside off. Angelo Mathews punches it through point off the back foot. The call is for two and get it. Dinesh Chandimal charges down the wicket and flicks this full ball to wide long on for a single. Fuller, outside off. Dinesh Chandimal blocks it on his front foot. A wild swing and a miss! Back of a length, wide outside off, shaping further away. Angelo Mathews goes after it, but misses it completely. Almost carries! It is a full-length ball, outside off. Angelo Mathews drives it back to the bowler but off the inner half. Tim Southee collects it on a bounce. Outside off, left alone. FOUR! Nicely played. Back of a length, on the body. Angelo Mathews heaves it across the line and places it really well to pierce the gap in the deep beind square on the leg side. The ball sneaks into the boundary. Good length, outside off. Angelo Mathews makes the leave. Tim Southee goes full and on off. Angelo Mathews drives it nonchalantly towards mid off. Blair Tickner is quick to get to his right and make a stop. Tossed up, on off. Dinesh Chandimal tucks it to short mid-wicket. 5 runs off the over. Full and on off, blocked solidly. A single now as this is pushed to the off side. FOUR! Angelo Mathews now getting into the act. It is a full delivery. Angelo Mathews gets low and sweeps this to deep mid-wicket from outside off. It races into the fence. A bit quicker, and full, on off. Angelo Mathews pushes it to the left of the bowler. Floated, full and on off. Dinesh Chandimal gets to the pitch of it and flicks it down to long on for a single. Much fuller this time, wide outside off, shaping further away. Angelo Mathews shoulders his arms at it. A good end to the over. Sri Lanka now lead by 104 runs. It is a full-length ball, on off. Angelo Mathews pats it back to the bowler. It is full, tailing into the pads. Dinesh Chandimal clips it to mid-wicket and gets a single. A sharp bouncer this time, on middle. Dinesh Chandimal ducks under it. FOUR! Powerfully hit. Back of a length, on off. Dinesh Chandimal gets on top of it and pulls it through mid-wicket for a boundary. Tim Southee hurls in a length ball, that comes back in from outside off. Dinesh Chandimal gets forward and defends. Floated and full, outside off. Angelo Mathews strides in and defends it off the bottom half. Full, on leg. Dinesh Chandimal flicks it to square leg and crosses. Tossed up, full and outside off. Dinesh Chandimal lunges and blocks it into the deck. Darted on the pads, tucked towards mid-wicket. Dinesh Chandimal now uses his feet to this full one, and clips it to short mid-wicket. Michael Bracewell starts with a full one, on off. Dinesh Chandimal prods and nudges it to mid-wicket. Time for some spin as Michael Bracewell comes on to bowl. A maiden for Tim Southee! It is a full ball, on off, nips away a touch. Angelo Mathews defends it with full face. Outside off, left alone without any trouble. Full length, in the channel. Angelo Mathews prods and blocks it back to the bowler. Good length, wide of off. Angelo Mathews leaves it alone. It is much fuller, on middle and leg. Angelo Mathews clips it towards mid-wicket.","pubDate":"2023-03-11 18:36:04","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"LLC 2023: एक ही ओवर में तीन विकेट, कुल 4 शिकार, हरभजन सिंह ने तो क्रिस गेल की वाट लगा दी","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/llc-2023-harbhajan-singh-takes-four-wickets-bowled-chris-gayle-around-his-legs-watch-video/articleshow/98570772.cms","keywords":null,"creator":null,"video_url":null,"description":"Legends league cricket 2023 में इंडिया महाराजा अब भी अपनी पहली जीत की तलाश में भटक रही है। वेस्ट एंड पार्क इंटरनेशनल क्रिकेट स्टेडियम में शनिवार रात मुकाबले मेंवर्ल्ड जायंट्स ने दो रन से जीत दर्ज की।","content":"कतर में खेले जा रहे लीजेंड्स लीग क्रिकेट टूर्नामेंट में इंडिया महाराजास को लगातार दूसरी हार झेलनी पड़ी। वर्ल्ड जायंट्स ने शनिवार रात इंडिया महाराजा को दो रन से हरा दिया। कप्तान गौतम गंभीर की लगातार दूसरी फिफ्टी बेकार गई, इससे पहले उद्घाटन मैच में शुक्रवार रात एशिया लायंस ने भी इंडिया महाराजा को हराया था। इस दिल तोड़ने वाली हार के बीच हरभजन सिंह की कातिलाना गेंदबाजी ने पूरी दुनिया का मन मोह लिया है। दो ओवर में भज्जी ने सिर्फ 13 रन देकर चार बड़े विकेट चटकाए, जिसमें तीन शिकार तो एक ही ओवर में किए। दरअसल, वर्ल्ड जायंट्स के कप्तान आरोन फिंच ने टॉस जीतकर पहले बल्लेबाजी का फैसला किया। उन्होंने क्रिस गेल के साथ पारी की शुरुआत की, लेकिन वेस्टइंडीज के पूर्व सलामी बल्लेबाज भारत महाराजा के गेंदबाजों को ज्यादा नुकसान नहीं पहुंचा सके क्योंकि अनुभवी ऑफ स्पिनर हरभजन सिंह ने उन्हें तीसरे ही ओवर में चलता किया। लेग स्टंप के बाहर फेंकी एक धीमी गति की बॉल को वाइड समझकर गेल ने छोड़ना चाहा, लेकिन शार्प टर्न लेते हुए गेंद सीधे लेग स्टंप में घुस गई। 4 रन पर गेल की पारी का अंत करने के बाद भज्जी को अगला मौका 16वें ओवर में मिला। यह टर्बनेटर का दूसरा ओवर था, जिसकी छह गेंदों में उन्होंने तीन शिकार कर डाले। पहली गेंद पर आयरलैंड वाले केविन ओ ब्रायन (4) को मोहम्मद कैफ के हाथों कैच आउट करवाने के बाद तीसरी गेंद पर रॉस टेलर (1) और पांचवीं पर मोर्न वैन विक (1) को चलता किया। इस ओवर में उन्होंने सिर्फ दो रन दिए। यहीं से वर्ल्ड जायंट्स की रनगति पर भी अंकुश लगा। एक वक्त स्कोर आसानी से 200 रन के पार जाते लग रहा था, जो बाद में 166/8 तक ही सीमित रहा। इस बीच कप्तान आरोन फिंच ने 53 जबकि शेन वॉटसन ने 55 रन बनाए। इंडिया महाराजा ने 167 रन के लक्ष्य को साधने की पूरी कोशिश की, लेकिन सफलता हाथ नहीं लगी। कप्तान गौतम गंभीर और रॉबिन उथप्पा ने मिलकर अच्छी शुरुआत दिलाई थी, लेकिन उसके बाद कोई अच्छी साझेदारी नहीं हुई। गौतम गंभीर ने 42 गेंद में 68 रन बनाए। वर्ल्ड जायंट्स की ओर से रिकॉर्डो पॉवोल सबसे सफल गेंदबाज रहे, जिन्होंने 3 ओवर में 16 रन देकर 2 विकेट चटकाए।","pubDate":"2023-03-11 18:33:59","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Jhye Richardson To Miss IPL 2023 Due To Injury, Unlikely To Play Ashes","link":"https://sports.ndtv.com/cricket/jhye-richardson-to-miss-ipl-2023-unlikely-to-play-ashes-series-3852511","keywords":null,"creator":null,"video_url":null,"description":"Jhye Richardson suffered a recurrence of hamstring issues while playing club cricket last week, during his attempt to return to action.","content":"Australian quick Jhye Richardson will be missing the upcoming edition of the Indian Premier League (IPL) and is also likely to miss the Ashes series against England after undergoing surgery to overcome issues in his hamstring. Richardson suffered a recurrence of hamstring issues while playing club cricket last week, during his attempt to return to action after pulling his hamstring during the Big Bash League (BBL). He was also ruled out of the ODI series against India starting from March 17. He took the surgery option in order to find a long-term solution. He was due to represent Mumbai Indians (MI) in IPL after a stint with Punjab Kings in 2021. \"Injuries are a big part of cricket, that's a fact,\" Richardson tweeted as quoted by ESPNCricinfo. \"Frustrating? Absolutely. But I am now in a scenario where I can get back to doing what I love and work bloody hard to become an even better player than before. One step back, two steps forward. Let's do this,\" added Richardson. Richardson's body has let him down during the last two seasons as he had undergone major shoulder surgery in 2019, which led to him missing the ICC Cricket World Cup and the Ashes that year. After taking a maiden five-wicket haul in Tests in Adelaide in December 2021, his first Test since his shoulder injury, but a nagging heel injury ruled out of the next match and he has not featured in the longer format ever since. Jhye played in T20I and ODI series during the 2022 tour to Sri Lanka. He had an interrupted pre-season for Western Australia. His soft-tissue concerns led to him playing just two Sheffield Shield and one Marsh Cup match before BBL. \"Obviously it is devastating that he has re-injured that hamstring again and he is going to miss a significant amount of time to get his hamstring right,\" Western Australia coach Adam Voges said. \"We all feel for Jhye and we are hopeful that whatever they come with as a solution can fix his hamstring and we get him back out there because it has been a tough 12 months for him,\" concluded Voges.","pubDate":"2023-03-11 17:55:56","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"Watch: Steve Smith and Marnus Labuschagne hilariously race against one another to the dressing room","link":"https://www.sportskeeda.com/cricket/news-watch-steve-smith-marnus-labuschagne-hilariously-race-one-another-dressing-room?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Day 3 of the fourth Test between India and Australia at the Narendra Modi Stadium in Ahmedabad witnessed an amusing incident between Steve Smith and Marnus Labuschagne during a break session. The two batting stalwarts appeared to be racing against one another while going into the dressing room, with Usman Khawaja walking calmly behind the pair. While Smith started behind Labuschagne, the captain got ahead of his teammate soon enough. You can watch a video of this light moment below: Smith and Labuschagne have arguably been one of the most prolific batting pairs in the last year and a half. The duo first came together during the fourth Test in Manchester of the 2019 Ashes series and have continued to pile on the runs against almost teams. Labuschagne is also the number-one-ranked Test batter in the world. The right-hander hasn't been at his best in the ongoing Test series, registering a high score of just 38 in six innings. The 33-year-old came out to bat after Marnus Labuschagne departed for three but inside-edged a delivery onto the stumps as he ended with 38 off 135 balls. However, the New South Wales batter received immense praise for his captaincy skills, especially after leading Australia to a nine-wicket victory in Indore. Following two humbling losses in Nagpur and Delhi, the visitors bounced back well on the back of some exceptional bowling performances. Their commanding win also ensured them a spot in the World Test Championship (WTC) final, which is set to be played in June at The Oval. India are yet to book a place in the WTC decider and need a win to do so or require Sri Lanka to lose at least one Test in their ongoing series against New Zealand . Usman Khawaja has been Australia's batting star in Ahmedabad after his splendid 180, while Cameron Green also starred with 114. Their massive contributions shepherded Australia to 480. In response, the hosts are 289-3 at the end of Day 3. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-03-11 17:41:33","image_url":"https://staticc.sportskeeda.com/editor/2023/03/76000-16785374259954-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"WPL: Shafali, Kapp Fire Delhi Capitals To 10-wicket Win vs Gujarat Giants","link":"https://sports.ndtv.com/cricket/shafali-kapp-fire-dc-to-10-wicket-win-against-gg-in-wpl-3853102","keywords":null,"creator":null,"video_url":null,"description":"Shafali Verma smashed a 19-ball fifty as Delhi Capitals thrashed Gujarat Giants by 10 wickets in the Women's Premier League.","content":"Shafali Verma's explosive unbeaten half-century and Marizanne Kapp's sensational five-wicket haul fired Delhi Capitals to a massive 10-wicket win against Gujarat Giants in the Women's Premier League on Saturday. Kapp broke the back of Gujarat Giants' innings with a stunning spell of 4-0-15-5, taking the top four wickets in the line-up as Delhi bowlers produced a clinical display to keep the opponents to a lowly 105 for 9 at the DY Patil Stadium here. In reply, Shafali came out firing on all cylinders, clobbering 10 fours and five sixes to produce a ruthless knock of 76 not out off 28 balls in the company of captain Meg Lanning (21 not out from 15 balls) as DC completed the chase in a mere 7.1 overs. Delhi Capitals made their intentions clear right from the word go, with Shafali taking a special liking for the Gujarat bowler Ashleigh Gardner, smacking her for four fours and a six in the fourth over to collect 23 runs. Shafali continued to attack, this time hitting Tanuja Kanwar for a couple of sixes to help Delhi knock off the majority of their target, with 87 runs coming in the powerplay. Shafali brought up her second half-century in the WPL, from just 19 balls as the senior pro in Lanning happily chose to take the backseat and enjoy the right-handed batter's power hitting, which tore apart the Gujarat's bowling attack. Earlier, Kapp produced a stunning spell at the top to reduce the Giants to a precarious 33 for 6 after seven overs, a position from which they could never recover. After Kapp set the tone, the others continued to apply constant pressure on the Gujarat batters. India's left-arm spinner Radha Yadav returned with figures of 4-0-19-1, Minnu Mani gave away just 18 runs in her three overs and Australia's Jess Jonassen conceded 19 runs from her four overs. The seasoned Shikha Pandey also had a memorable outing, taking 3 for 26 from her four overs. Kim Garth (32 not out) and Georgia Wareham tried to weather the storm and get some much-needed runs for their side, but their efforts could only provide Gujarat Giants' innings some respectability. While Gujarat's lower order, which did bulk of the scoring, did not attempt risky strokes for quick runs, they also could not find gaps for boundaries. There were no boundaries hit between overs 13-16. Additionally, not a single six was hit in Gujarat Giants' innings. Kapp provided Delhi with a perfect start, cleaning up Sabbhineni Meghana (0) and Wolvaardt (1) before trapping the big gun Ashleigh Gardner (0) leg-before to leave the Giants tottering at 9 for 3 inside the first three overs. Pandey made matters worse for Gujarat, getting Dayalan Hemlatha (5) caught behind by wicketkeeper Taniya Bhatia, and Kapp then snaffled the big wicket of the in-form Harleen Deol (20), who was pinned in front of the stumps with the ball nipping back in. Deol, the third highest run-scorer in the league and her team's best batter, looked promising during her stay in the middle as she cracked four boundaries to make 20 off 14 balls.","pubDate":"2023-03-11 17:16:10","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"\"This half-century might get converted into a double hundred\" - Sunil Gavaskar lauds Virat Kohli's knock in 4th IND vs AUS Test","link":"https://www.sportskeeda.com/cricket/news-this-half-century-might-get-converted-double-hundred-sunil-gavaskar-lauds-virat-kohli-s-knock-4th-ind-vs-aus-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Kartik Iyer"],"video_url":null,"description":null,"content":"Sunil Gavaskar expects Virat Kohli to convert his half-century in the fourth and final Test of the Border-Gavaskar Trophy into a double hundred. Kohli was unbeaten on 59 as India ended Day 3 at 289/3 at the Narendra Modi Stadium in Ahmedabad on Saturday, March 11. The hosts still trail Australia by 191 runs with seven first-innings wickets in hand heading into the penultimate day of the series. During a discussion on Star Sports, Gavaskar opined that Virat Kohli might convert his fifty into a massive three-figure score, elaborating: The former Indian skipper feels the modern batting great would want to compensate for his prolonged lean patch in Test cricket, observing: Kohli last scored a ton in the longest format in the pink-ball Test against Bangladesh in November 2019. He has managed 1087 runs at an underwhelming average of 27.17 in 24 matches since that century. Sanjay Bangar was pleased with Kohli's approach against the spinners on Saturday, saying: The former Indian batting coach was particularly appreciative of Kohli's wristwork, explaining: Kohli strung together a 58-run third-wicket partnership with Shubman Gill (128) before the latter was trapped in front of the wickets by Nathan Lyon. The former Indian skipper and Ravindra Jadeja (16*) have so far added 44 runs for the fourth wicket. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : Will Virat Kohli score a century on Day 4 of the Ahmedabad Test? Yes No 36 votes Quick Links","pubDate":"2023-03-11 16:53:04","image_url":"https://staticc.sportskeeda.com/editor/2023/03/8fe58-16785374343963-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"[Watch] Fans in Narendra Modi Stadium chant Rishabh Pant's name as Nathan Lyon fields near the boundary on day 3 of 4th India vs Australia Test","link":"https://www.sportskeeda.com/cricket/news-watch-fans-narendra-modi-stadium-chant-rishabh-pant-s-name-nathan-lyon-fields-near-boundary-day-3-4th-india-vs-australia-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Balakrishna"],"video_url":null,"description":null,"content":"Ahmedabad fans indulged in fun banter with Nathan Lyon when he was fielding near the boundary on Day 3 of the fourth Test between India and Australia (Saturday, March 11). Fans chanted Rishabh Pant's name repeatedly as Lyon tried to concentrate on the match. Pant and Lyon have a history between them in Test cricket. During the previous two Border-Gavaskar trophy series in Australia, the duo engaged in intense battles on the cricket field. Pant is currently out of action as he is recovering from an accident in December. A fan took to Twitter to give a glimpse of the incident involving the audience and Nathan Lyon at the Narendra Modi stadium by sharing a video. You can watch it below: Team India's top-order batted sensibly to bring their team back into the match after Australia scaled a huge total of 480 in their first innings. Shubman Gill led the way by compiling a magnificent century, his second in the Test format. Virat Kohli (59*), Cheteshwar Pujara (42), and Rohit Sharma played supporting roles with their contributions as India ended Day 3 with 289/3 on the scoreboard. The hosts trail by 191 runs going into the fourth day of the series finale. Shubman Gill shed light on his knock after the play, saying: Instagram Post Do you think India can still win the 4th Test? Sound off your views in the comments section. Get IND vs AUS Live Score updates for 4th Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-03-11 16:42:46","image_url":"https://staticc.sportskeeda.com/editor/2023/03/e0aae-16785353442288-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets","link":"https://www.firstpost.com/firstcricket/sports-news/gujarat-giants-vs-delhi-capitals-highlights-wpl-2023-match-9-in-mumbai-delhi-thrash-gujarat-by-10-wickets-12275852.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets","content":"Cricket Gujarat Giants vs Delhi Capitals Highlights, WPL 2023 Match 9 in Mumbai: Delhi thrash Gujarat by 10 wickets WPL 2023 LIVE Score, GG vs DC Get WPL 2023 live score and latest updates from Gujarat Giants vs Delhi Capitals Women's Premier League match at Firstpost FirstCricket Staff March 11th, 2023 21:55:37 IST GG vs DC, WPL 2023 LIVE Score: Captains Meg Lanning and Sneh Rana pose for a picture ahead of toss in Match 9 of WPL 2023 between Gujarat Giants and Delhi Capitals. Sportzpics FP commentary Quick Scorecard Full scorecard Ball by ball commentary Gujarat Giants Vs Delhi Capitals At Dr. DY Patil Sports Academy, Navi Mumbai, 11 March, 2023 11 March, 2023 Starts 19:30 (IST) Match Ended Gujarat Giants 105/9 (20.0 ov) Match 9 Delhi Capitals 107/0 (7.1 ov) Delhi Capitals beat Gujarat Giants by 10 wickets Toss report: Gujarat Giants announced two changes in their playing XI after winning the toss and opting to bat against Delhi Capitals in the Women’s Premier League (WPL) in Mumbai. South African opener Laura Wolvaardt and Australian leg-spinner Georgia Wareham were included in place of Sophia Dunkley and Annabel Sutherland. Wolvaardt, who played a key role in South Africa’s run to the final of the T20 World Cup last month, had earlier been announced as injured skipper Beth Mooney’s replacement, with Indian all-rounder Sneh Rana taking over the leadership duties. The Capitals, meanwhile, will be hoping to return to winning ways after getting outplayed by the Mumbai Indians in what was their first defeat of the inaugural WPL. The Meg Lanning-led side, which started off with commanding victories over Royal Challengers Bangalore and UP Warriorz, were bowled out for a paltry 105 with MI chasing the target down with eight wickets and five overs to spare. Teams: Delhi Capitals : Meg Lanning (c), Shafali Verma, Jemimah Rodrigues, Laura Harris, Marizanne Kapp, Jess Jonassen, Taniya Bhatia (wk), Minnu Mani, Radha Yadav, Shikha Pandey, Tara Norris Gujarat Giants : S Meghana, Laura Wolvaardt, Harleen Deol, Ashleigh Gardner, Dayalan Hemalatha, Georgia Wareham, Sneh Rana (c), Kim Garth, Sushma Verma (wk), Tanuja Kanwar, Mansi Joshi Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 11, 2023 21:55:37 IST Tags: Cricket Delhi Capitals Gujarat Giants Wpl Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-11 16:25:37","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Meg-Lanning-Sneh-Rana-WPL-2023-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad?","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-australia-virat-kohli-century-loading-will-the-wait-be-finally-over-at-ahmedabad-12276082.html","keywords":["First Cricket News"],"creator":["Sahil Malhotra"],"video_url":null,"description":"India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad?","content":"Cricket India vs Australia: 'Virat Kohli Century Loading ...' Will the wait be finally over at Ahmedabad? Still unbeaten on 59, Kohli has the best possible chance to end his long wait for a Test hundred which he last scored in the November 2019 Test against Bangladesh Sahil Malhotra March 11th, 2023 21:55:28 IST Virat Kohli plays a cover drive on Day 3 of the fourth Test between India and Australia in Ahmedabad. Sportzpics for BCCI In the 62nd over of the Indian innings, commentator Harsha Bhogle was furious when the DRS replays were being displayed on the giant screen. It wasn’t because of Cheteshwar Pujara not getting the big score after a solid start or the fact that he went with the DRS on a call which looked plumb in front. The veteran commentator’s anger was directed towards the Ahmedabad crowd, which moments after replays confirmed no bat on that LBW shout, rushed to the edge of the stands and started chanting “Kohli, Kohli”. The umpire was yet to officially announce that the decision stayed and before Pujara could even sink in the moment and commence the toughest walk, the crowd was chanting for Kohli, the next man in to bat. Report: Gill, Kohli lead India’s fightback in Ahmedabad “It’s disrespect to Pujara when the DRS is on,” Bhogle was not a happy man as “Kohli, Kohli” only grew louder. The moment arrived and Pujara, after scoring a 121-ball 42, took the long staircase back to the hut. The fans didn’t have to wait for Kohli to descend the same staircase as the former Indian skipper was already in the dugout near the ropes and walked out to the middle. Not in the manner Bhogle would have liked. A lot was at stake for Kohli. The right-hander was undergoing a lean patch with the bat in Tests and was in desperate need of a big score against his name. Read: Gill takes the giant Test stride with fluent 128 against Australia Nagpur, Delhi and Indore were turners where most struggled but Kohli batted beautifully in Delhi but the big score continued to elude him. With the scoreboard reading 187/2, the 34-year-old couldn’t have asked for a better time and strip to return to his prime days. No matter how much the pitch and conditions suit batting, there’s still work to be done and Kohli would have known that. Few deliveries tested the right-hander early in the innings and he didn’t look in control against both Nathan Lyon and Todd Murphy. He was jabbing harder than what was required on this surface and looked tentative while defending. Oohs and aahs were in plenty but Kohli was happy to work around for singles and stole a few in the circle too. Ease vs pace Mitchell Starc returned to the attack in the 73rd over of the innings and was set to bowl to Kohli who was going to face seam for the first time in the series. Over the last three Tests, Kohli didn’t face a single delivery by a seamer. Steve Smith wanted to use Starc’s angle to his advantage but the move backfired as two boundaries in that over allowed Kohli to just ease himself in. A leaning off-drive and an easy clip off the pads moved Kohli from 9 to 17 and there was no looking back since then. 🏏 @imVkohli 🆚 Mitchell Starc Quality shots on display 👌👌 #TeamIndia 🇮🇳 | #INDvAUS | @mastercardindia pic.twitter.com/4J9vHV9GGm — BCCI (@BCCI) March 11, 2023 Before Starc’s introduction, Kohli was under the pump at just eight runs off 31 balls but looked positive after the first few boundaries and collected 23 off the next 27 balls. The bad balls were put away and he just looked to score. Even during the deliveries, he defended, Kohli got into scoring positions and had a positive approach. Something which worked for him. The long wait Since January 2022, the last time he scored a fifty in Tests, Kohli for sure has tried a lot of things but nothing has worked in the 15 innings. He looked very solid in the 44-run knock during the Delhi Test and seemed to have found a template against off-spin. He just kept planting the front foot forward and keep working them towards the region between long-on and mid-wicket for singles. Smith did try to plug that area with a silly mid-on and a mid-wicket but Kohli continued finding the little gap and kept rotating the strike. No wonder it was his most productive shot and helped him collect around 30% of the runs he scored today. Still unbeaten on 59, Kohli has the best possible chance to end an even longer wait. The wait for a Test hundred which he last scored in the November 2019 Test against Bangladesh. There have been few crucial hands in between but the three digits have eluded him. There will surely be a loud cheer, just like it was when he walked back unbeaten at stumps, when he walks out to bat again in the morning session and Kohli now has a golden opportunity to turn that into a roar with the long-awaited hundred. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: March 11, 2023 21:55:28 IST Tags: Cricket India Vs Australia India Vs Australia 2023 Virat Kohli Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-03-11 16:25:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/03/Virat-Kohli-Australia-Ahmedabad-Day-3-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"}]}