{"newsArray":[{"title":"“Spoon-feeding doesn’t really help”: MS Dhoni reveals leaving CSK captaincy decisions to Ravindra Jadeja after first two IPL 2022 matches","link":"https://thesportsrush.com/cricket-news-spoon-feeding-doesnt-really-help-ms-dhoni-reveals-leaving-csk-captaincy-decisions-to-ravindra-jadeja-after-first-two-ipl-2022-matches/","keywords":["Cricket","CSK","IPL 2022","Sunrisers Hyderabad","chennai super kings","csk","Indian Premier League","MS Dhoni","Ravindra Jadeja","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"MS Dhoni: The legendary captain discussed about bowling plans and a sudden captaincy change at Chennai Super Kings. Chennai Super Kings captain Mahendra Singh Dhoni termed their opening batters putting together a record partnership right after his reinstatement to the leadership role as a “co-incidence”. A 182-run opening partnership between Ruturaj Gaikwad and Devon Conway… The post “Spoon-feeding doesn’t really help”: MS Dhoni reveals leaving CSK captaincy decisions to Ravindra Jadeja after first two IPL 2022 matches appeared first on The SportsRush.","content":"MS Dhoni: The legendary captain discussed about bowling plans and a sudden captaincy change at Chennai Super Kings. Chennai Super Kings captain Mahendra Singh Dhoni termed their opening batters putting together a record partnership right after his reinstatement to the leadership role as a “co-incidence”. A 182-run opening partnership between Ruturaj Gaikwad and Devon Conway against Sunrisers Hyderabad at the Maharashtra Cricket Association Stadium tonight played a vital role in CSK registering a 13-run victory; their third of the season. “It’s one of those coincidence where we got off to a good start and forced the bowlers to bowl the areas where we wanted to hit. The kind of target we got was a very good one. The phase that really worked for us was where the spinners were bowling after 6 overs,” Dhoni told Star Sports at the toss. Leading a Playing XI comprising of a couple of rookie new-ball bowlers, Dhoni laid emphasis on remaining patient with them to ensure that they don’t find themselves “lost” especially whilst leaking runs. Dhoni, 40, also shared an anecdotal example in the form of how he tells his bowlers to focus on dot deliveries in a high-scoring contest. “I always tell my bowlers, you may get hit for four sixes in an over but the two balls that you save, ultimately in a high-scoring game, those are the two deliveries that will help you win the game. “Because a lot of bowlers, after getting 3-4 sixes, they will be like let’s get done with it but that one boundary or even instead of sixes if you get hit for 2 fours that will help you in a game. I don’t know if they believe in that theory, but it really works,” Dhoni added. MS Dhoni reveals leaving CSK captaincy decisions to Ravindra Jadeja after first two IPL 2022 matches While a sudden change in captaincy at Super Kings did come as a shock to many last night, the management would be relieved to see the team returning to winning ways under Dhoni. Adding weight to CSK CEO Kasi Viswanathan’s statement around Ravindra Jadeja being hinted about getting more responsibility last season, Dhoni considered that the southpaw had got “enough” time to prepare for captaincy. Contrary to the general perception, Dhoni admitted to providing “information” to Jadeja but only for the first two matches of the season. Other than leading Super Kings to two victories and six defeats in eight matches in his maiden captaincy stint, what has even more surprised more people is Jadeja’s substandard form across departments. In addition to dropping catches, all Jadeja has scored this season is 113 runs and picked five wickets in nine matches. Thalaivan Irukkindraan! #SRHvCSK #WhistlePodu #Yellove pic.twitter.com/WKgFGm1OC1 — Chennai Super Kings (@ChennaiIPL) May 1, 2022 “Between me and [Ravindra] Jadeja, he knew last season itself that he will be given a chance to captain this year. He knew and got enough time to prepare. What is important is you want him to lead the side and I wanted that transition to happen. In the first two games, there was information going in towards Jaddu and after that I left it to him to decide which angle to bowl and all that,” Dhoni further said. “At the end of the season, you don’t want him to feel as the captaincy was done by someone else and I’m just going for toss. Spoon-feeding doesn’t really help captain. On the field, you have to take those crucial decisions and you have to take responsibility for those decisions.” The post “Spoon-feeding doesn’t really help”: MS Dhoni reveals leaving CSK captaincy decisions to Ravindra Jadeja after first two IPL 2022 matches appeared first on The SportsRush.","pubDate":"2022-05-01 19:11:53","full_description":"MS Dhoni: The legendary captain discussed about bowling plans and a sudden captaincy change at Chennai Super Kings. Chennai Super Kings captain Mahendra Singh Dhoni termed their opening batters putting together a record partnership right after his reinstatement to the leadership role as a “co-incidence”. A 182-run opening partnership between Ruturaj Gaikwad and Devon Conway against Sunrisers Hyderabad at the Maharashtra Cricket Association Stadium tonight played a vital role in CSK registering a 13-run victory; their third of the season. “It’s one of those coincidence where we got off to a good start and forced the bowlers to bowl the areas where we wanted to hit. The kind of target we got was a very good one. The phase that really worked for us was where the spinners were bowling after 6 overs,” Dhoni told Star Sports at the toss. Leading a Playing XI comprising of a couple of rookie new-ball bowlers, Dhoni laid emphasis on remaining patient with them to ensure that they don’t find themselves “lost” especially whilst leaking runs. Dhoni, 40, also shared an anecdotal example in the form of how he tells his bowlers to focus on dot deliveries in a high-scoring contest. “I always tell my bowlers, you may get hit for four sixes in an over but the two balls that you save, ultimately in a high-scoring game, those are the two deliveries that will help you win the game. “Because a lot of bowlers, after getting 3-4 sixes, they will be like let’s get done with it but that one boundary or even instead of sixes if you get hit for 2 fours that will help you in a game. I don’t know if they believe in that theory, but it really works,” Dhoni added. While a sudden change in captaincy at Super Kings did come as a shock to many last night, the management would be relieved to see the team returning to winning ways under Dhoni . Adding weight to CSK CEO Kasi Viswanathan’s statement around Ravindra Jadeja being hinted about getting more responsibility last season, Dhoni considered that the southpaw had got “enough” time to prepare for captaincy. Contrary to the general perception, Dhoni admitted to providing “information” to Jadeja but only for the first two matches of the season. Other than leading Super Kings to two victories and six defeats in eight matches in his maiden captaincy stint , what has even more surprised more people is Jadeja’s substandard form across departments. In addition to dropping catches, all Jadeja has scored this season is 113 runs and picked five wickets in nine matches. Thalaivan Irukkindraan! 🦁 #SRHvCSK #WhistlePodu #Yellove 💛 pic.twitter.com/WKgFGm1OC1 — Chennai Super Kings (@ChennaiIPL) May 1, 2022 “Between me and [Ravindra] Jadeja, he knew last season itself that he will be given a chance to captain this year. He knew and got enough time to prepare. What is important is you want him to lead the side and I wanted that transition to happen. In the first two games, there was information going in towards Jaddu and after that I left it to him to decide which angle to bowl and all that,” Dhoni further said. “At the end of the season, you don’t want him to feel as the captaincy was done by someone else and I’m just going for toss. Spoon-feeding doesn’t really help captain. On the field, you have to take those crucial decisions and you have to take responsibility for those decisions.”","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"KKR hope to end top-order woes, losing streak against Royals","link":"https://kashmirreader.com/2022/05/02/kkr-hope-to-end-top-order-woes-losing-streak-against-royals/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Mumbai: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday. The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR […]","content":"Mumbai: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday. The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR have been forced to make regularly at the top of the order. Venkatesh’s performances have been underwhelming to say the least after a season that helped him get into the Indian team. After his struggles at the top, the team tried him in the middle-order but that too did not work. The southpaw was back opening alongside Aaron Finch in the last game but runs deserted him again. Making the play-offs from here looks improbable for KKR who desperately need to find their best XI and stick with it for the remainder of the competition. “A lot of chopping and changing is happening, it’s been difficult to set up the right combination, with all injuries not helping as well. We need to stick together, play some fearless cricket, not be conservative with the bat. “Five more matches remaining, we need to play well, show belief and give something back to the team and the management, forget about the past, start fresh and back your instinct,” said skipper Shreyas Iyer after the last game. Shreyas has had a decent run as a batter with 290 runs at 36.25 but he has not got enough support from his teammates. In his first season as KKR captain, Shreyas has shown promise but needs to inspire his troops to script a turnaround. Alongside Venkatesh, the dismal run of another retained player Varun Chakaravarthy has hurt the team. However, the move to drop him in the previous game did not yield the desired results as KKR lost their fifth game in a row. The trio of Tim Southee, Umesh Yadav and Sunil Narine has been impressive and will be aiming to keep the in-form Jos Buttler quiet. Rajasthan rely a lot on Buttler and his 566 runs at 70.75 are a big reason why they find themselves in the top-four. As the Englishman can’t be expected to fire in every game, skipper Sanju Samson needs to step up and be more consistent. They are arguably the best bowling side in the competition but could not defend 159 in their previous game against Mumbai Indians due to heavy dew. With 19 wickets at 13.68, Yuzvendra Chahal leads the bowling charts this season and alongside R Ashwin, Trent Boult and Prasidh Krishna, the Rajasthan attack has the ability to defend even below-par totals. However, Royals will be looking for a much-improved batting effort to minimise the dew factor. Match starts 7.30 IST. —PTI       Press Trust of Indiakashmirreader.com","pubDate":"2022-05-01 19:09:17","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Kuldeep needed positive environment, love and attention: Ponting","link":"https://kashmirreader.com/2022/05/02/kuldeep-needed-positive-environment-love-and-attention-ponting/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Mumbai: A phenomenal talent like Kuldeep Yadav required a “positive environment” filled with a lot of “love and attention” to blossom and he got that at Delhi Capitals, head coach Ricky Ponting said. The left-arm wrist spinner, who is currently second in the list of wicket-takers with 17 scalps, had a rough three years prior […]","content":"Mumbai: A phenomenal talent like Kuldeep Yadav required a “positive environment” filled with a lot of “love and attention” to blossom and he got that at Delhi Capitals, head coach Ricky Ponting said. The left-arm wrist spinner, who is currently second in the list of wicket-takers with 17 scalps, had a rough three years prior to this IPL edition after being confined to bench by the erstwhile national team management and also not getting enough support from his previous IPL team Kolkata Knight Riders. Add to that a major knee surgery that ruled him out of last IPL. “We are really pleased for him, he was one of our main targets in the auction. We are giving him a lot of love and attention. He’s a terrific young guy and this talented left-arm leg-spinner really seems to be thriving in this (positive) environment,” Ponting said on Star Sports’ Cricket Live. At a base price of Rs 2 crore, Kuldeep was a steal for the DC management at a time when most of the franchises were sceptical about how he would measure up post surgery, having not played a lot of cricket prior to that. In the case of Kuldeep, the DC management has tried to create a protective environment in which the Kanpur player feels secured, and that has led to him bowling beautifully. “We are all pretty wrapped with him and make sure that we keep things in line with him and not let him get too far ahead of himself. And at the moment he’s bowling beautifully.” —PTI     Press Trust of Indiakashmirreader.com","pubDate":"2022-05-01 19:09:03","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"KKR hope to end top-order woes, losing run vs Royals","link":"https://www.thehansindia.com/sports/cricket/kkr-hope-to-end-top-order-woes-losing-run-vs-royals-740636","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday.","content":"Pat Cummins and Venkatesh Iyer of Kolkata Knight Riders greet each other after an IPL matchPat Cummins and Venkatesh Iyer of Kolkata Knight Riders greet each other after an IPL matchMumbai: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday.The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR have been forced to make regularly at the top of the order. Venkatesh's performances have been underwhelming to say the least after a season that helped him get into the Indian team. After his struggles at the top, the team tried him in the middle-order but that too did not work. The southpaw was back opening alongside Aaron Finch in the last game but runs deserted him again. Making the play-offs from here looks improbable for KKR who desperately need to find their best XI and stick with it for the remainder of the competition. \"A lot of chopping and changing is happening, it's been difficult to set up the right combination, with all injuries not helping as well. We need to stick together, play some fearless cricket, not be conservative with the bat. \"Five more matches remaining, we need to play well, show belief and give something back to the team and the management, forget about the past, start fresh and back your instinct,\" said skipper Shreyas Iyer after the last game. Rajasthan rely a lot on Buttler and his 566 runs at 70.75 are a big reason why they find themselves in the top-four. As the Englishman can't be expected to fire in every game, skipper Sanju Samson needs to step up and be more consistent. ","pubDate":"2022-05-01 19:00:20","full_description":"Pat Cummins and Venkatesh Iyer of Kolkata Knight Riders greet each other after an IPL match Mumbai: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday. The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR have been forced to make regularly at the top of the order. Venkatesh's performances have been underwhelming to say the least after a season that helped him get into the Indian team. After his struggles at the top, the team tried him in the middle-order but that too did not work. The southpaw was back opening alongside Aaron Finch in the last game but runs deserted him again. Making the play-offs from here looks improbable for KKR who desperately need to find their best XI and stick with it for the remainder of the competition. \"A lot of chopping and changing is happening, it's been difficult to set up the right combination, with all injuries not helping as well. We need to stick together, play some fearless cricket, not be conservative with the bat. \"Five more matches remaining, we need to play well, show belief and give something back to the team and the management, forget about the past, start fresh and back your instinct,\" said skipper Shreyas Iyer after the last game. Rajasthan rely a lot on Buttler and his 566 runs at 70.75 are a big reason why they find themselves in the top-four. As the Englishman can't be expected to fire in every game, skipper Sanju Samson needs to step up and be more consistent.","image_url":"https://assets.thehansindia.com/h-upload/2022/05/01/500x300_1289847-kkr.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - Super Kings vs Sunrisers 46th Match 2022 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9pbmRpYW4tcHJlbWllci1sZWFndWUtMjAyMi0xMjk4NDIzL3N1bnJpc2Vycy1oeWRlcmFiYWQtdnMtY2hlbm5haS1zdXBlci1raW5ncy00NnRoLW1hdGNoLTEzMDQwOTIvbWF0Y2gtcmVwb3J00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - Super Kings vs Sunrisers 46th Match 2022  ESPNcricinfoIPL 2022, SRH vs CSK Highlights: Chennai Super Kings Romp To Victory vs SunRisers Hyderabad On MS Dhoni's Return As Captain  NDTV SportsIPL News Live Updates: Gaikwad, Conway set up CSK's 13-run win over SRH  Economic TimesIPL 2022 Highlights, SRH vs CSK: Dhoni starts with a win, CSK beat SRH  Hindustan TimesSRH vs CSK: Revealed - Why Dwayne Bravo Is Not Included In CSK's Playing XI Today  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-05-01 18:36:02","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Does CSK has chance for playoffs: Is it possible for CSK to enter playoffs in 2022 IPL?","link":"https://thesportsrush.com/cricket-news-does-csk-has-chance-for-playoffs-is-it-possible-for-csk-to-enter-playoffs-in-2022-ipl/","keywords":["Cricket","CSK","IPL 2022","Sunrisers Hyderabad","chennai super kings","csk","Indian Premier League","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Does CSK has chance for playoffs: Chennai Super Kings have won their third Indian Premier League 2022 match tonight. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Chennai Super Kings beat Sunrisers Hyderabad by 13 runs to return to winning… The post Does CSK has chance for playoffs: Is it possible for CSK to enter playoffs in 2022 IPL? appeared first on The SportsRush.","content":"Does CSK has chance for playoffs: Chennai Super Kings have won their third Indian Premier League 2022 match tonight. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Chennai Super Kings beat Sunrisers Hyderabad by 13 runs to return to winning ways. Chasing a 203-run target, Sunrisers lost wickets at regular intervals after the powerplay to continue to dent their own progress. As a result, they fell short of the target in spite of a brisk 58-run opening partnership between Abhishek Sharma (39) and Kane Williamson (47). While wicket-keeper batter Nicholas Pooran contributed with a 24th T20 half-century, him scoring a hard-hitting 64* (33) with the help of three fours and six sixes to bring up his third IPL half-century (maiden vs CSK) wasn’t enough to power SRH to their sixth victory of the season. Super Kings pacer Mukesh Choudhary might did leak 46 runs in his four overs but him dismissing Sharma, Rahul Tripathi (0), Shashank Singh (15) and Washington Sundar (2) played a game-changing role in the second innings. Chennai captain Mahendra Singh Dhoni, who was reinstated into captaincy only a night ago, lost the toss to witness his opening batters Ruturaj Gaikwad (99) and Devon Conway (85) registering the fourth-highest opening partnership in the history of the IPL. Readers must note that a 182-run partnership is the highest for any wicket this season in addition to being the highest-ever partnership between two batters playing for CSK. Does CSK has chance for playoffs? In spite of a victory at the Maharashtra Cricket Association Stadium tonight, Super Kings continue to be at the penultimate position on the points table. CSK, who have won three and lost six out of their nine IPL 2022 matches thus far, will have to win their remaining five matches in order to stand a chance to qualify for the playoffs. CSK fans right now #CSKvSRH #IPL2022 #CSK pic.twitter.com/4BUCJSA2OG — Wasim Jaffer (@WasimJaffer14) May 1, 2022 While the same would see them finishing IPL 2022 league phase with eight victories, another loss this season will bring NRR (Net Run Rate) into play. Two or more losses in the remaining matches will nullify all chances of Chennai qualifying for IPL 2022 playoffs. The post Does CSK has chance for playoffs: Is it possible for CSK to enter playoffs in 2022 IPL? appeared first on The SportsRush.","pubDate":"2022-05-01 17:44:48","full_description":"Does CSK has chance for playoffs: Chennai Super Kings have won their third Indian Premier League 2022 match tonight. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Chennai Super Kings beat Sunrisers Hyderabad by 13 runs to return to winning ways. Chasing a 203-run target, Sunrisers lost wickets at regular intervals after the powerplay to continue to dent their own progress. As a result, they fell short of the target in spite of a brisk 58-run opening partnership between Abhishek Sharma (39) and Kane Williamson (47). While wicket-keeper batter Nicholas Pooran contributed with a 24th T20 half-century, him scoring a hard-hitting 64* (33) with the help of three fours and six sixes to bring up his third IPL half-century (maiden vs CSK) wasn’t enough to power SRH to their sixth victory of the season. Super Kings pacer Mukesh Choudhary might did leak 46 runs in his four overs but him dismissing Sharma, Rahul Tripathi (0), Shashank Singh (15) and Washington Sundar (2) played a game-changing role in the second innings. Chennai captain Mahendra Singh Dhoni, who was reinstated into captaincy only a night ago, lost the toss to witness his opening batters Ruturaj Gaikwad (99) and Devon Conway (85) registering the fourth-highest opening partnership in the history of the IPL. Readers must note that a 182-run partnership is the highest for any wicket this season in addition to being the highest-ever partnership between two batters playing for CSK. In spite of a victory at the Maharashtra Cricket Association Stadium tonight, Super Kings continue to be at the penultimate position on the points table. CSK, who have won three and lost six out of their nine IPL 2022 matches thus far, will have to win their remaining five matches in order to stand a chance to qualify for the playoffs. CSK fans right now #CSKvSRH #IPL2022 #CSK pic.twitter.com/4BUCJSA2OG — Wasim Jaffer (@WasimJaffer14) May 1, 2022 While the same would see them finishing IPL 2022 league phase with eight victories, another loss this season will bring NRR (Net Run Rate) into play. Two or more losses in the remaining matches will nullify all chances of Chennai qualifying for IPL 2022 playoffs.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"CSK highest opening partnership: IPL highest 1st wicket partnership for Chennai Super Kings","link":"https://thesportsrush.com/cricket-news-csk-highest-opening-partnership-ipl-highest-1st-wicket-partnership-for-chennai-super-kings/","keywords":["Cricket","CSK","IPL 2022","Sunrisers Hyderabad","chennai super kings","csk","Devon Conway","Indian Premier League","Ruturaj Gaikwad","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"CSK highest opening partnership: Chennai Super Kings opening batters put together highest-ever opening partnership for the franchise tonight. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Chennai Super Kings opening batters Ruturaj Gaikwad (99) and Devon Conway (85*) stitched a… The post CSK highest opening partnership: IPL highest 1st wicket partnership for Chennai Super Kings appeared first on The SportsRush.","content":"CSK highest opening partnership: Chennai Super Kings opening batters put together highest-ever opening partnership for the franchise tonight. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Chennai Super Kings opening batters Ruturaj Gaikwad (99) and Devon Conway (85*) stitched a magnificent 182-run opening stand to propel their team to 202/2 in 20 overs. Highest IPL 2022 partnership, it is also the highest-ever partnership for Super Kings, against Sunrisers and at the Maharashtra Cricket Association Stadium in the history of the biggest T20 tournament across the globe. While Gaikwad scored six fours and sixes each at a strike rate of 173.68 before getting out in the 18th over, Conway hit eight fours and four sixes at a strike rate of 154.54. Gaikwad, who narrowly missed out on a second IPL century, returned back to the dugout after scoring his ninth IPL half-century, second against Hyderabad and at his home ground. The stroke-filled knock also witnessed Gaikwad crossing the 1,000-run mark in the IPL. Dominant partner in the partnership right from the start, Gaikwad’s contest against the pacers especially Umran Malik was worth watching. He doesn’t get a hundred, but what a spectacular knock by Ruturaj Gaikwad pic.twitter.com/7JV4xNunS7 — ESPN India (@ESPNIndia) May 1, 2022 Conway, on the other hand, registered his maiden IPL half-century in only his second innings. From scoring 15 (19) till the eighth over, the left-handed batter did pretty well to score 70 runs on the remaining 36 deliveries tonight. CSK highest opening partnership in IPL history Runs Batters Opposition Venue Year 182 Ruturaj Gaikwad & Devon Conway Sunrisers Hyderabad MCA Stadium 2022 181* Shane Watson & Faf du Plessis Kings XI Punjab Dubai International Cricket Stadium 2020 159 Michael Hussey & Murali Vijay Royal Challengers Bangalore MA Chidambaram Stadium 2011 139* Murali Vijay & Michael Hussey Kings XI Punjab PCA Stadium 2013 134 Shane Watson & Ambati Rayudu Sunrisers Hyderabad MCA Stadium 2018 The post CSK highest opening partnership: IPL highest 1st wicket partnership for Chennai Super Kings appeared first on The SportsRush.","pubDate":"2022-05-01 17:02:26","full_description":"CSK highest opening partnership: Chennai Super Kings opening batters put together highest-ever opening partnership for the franchise tonight. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Chennai Super Kings opening batters Ruturaj Gaikwad (99) and Devon Conway (85*) stitched a magnificent 182-run opening stand to propel their team to 202/2 in 20 overs. Highest IPL 2022 partnership , it is also the highest-ever partnership for Super Kings, against Sunrisers and at the Maharashtra Cricket Association Stadium in the history of the biggest T20 tournament across the globe. While Gaikwad scored six fours and sixes each at a strike rate of 173.68 before getting out in the 18th over, Conway hit eight fours and four sixes at a strike rate of 154.54. Gaikwad, who narrowly missed out on a second IPL century , returned back to the dugout after scoring his ninth IPL half-century, second against Hyderabad and at his home ground. The stroke-filled knock also witnessed Gaikwad crossing the 1,000-run mark in the IPL. Dominant partner in the partnership right from the start, Gaikwad’s contest against the pacers especially Umran Malik was worth watching. He doesn’t get a hundred, but what a spectacular knock by Ruturaj Gaikwad 👏 pic.twitter.com/7JV4xNunS7 — ESPN India (@ESPNIndia) May 1, 2022 Conway, on the other hand, registered his maiden IPL half-century in only his second innings. From scoring 15 (19) till the eighth over, the left-handed batter did pretty well to score 70 runs on the remaining 36 deliveries tonight.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Highest partnership in IPL 2022: Highest 1st wicket partnership in IPL 2022","link":"https://thesportsrush.com/cricket-news-highest-partnership-in-ipl-2022-highest-1st-wicket-partnership-in-ipl-2022/","keywords":["Cricket","CSK","IPL 2022","Sunrisers Hyderabad","chennai super kings","csk","Devon Conway","Indian Premier League","Ruturaj Gaikwad","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest partnership in IPL 2022: The opening pair of Chennai Super Kings has put together the highest partnership of this season. Reinstatement of legendary captain Mahendra Singh Dhoni in the leadership role seems to have provided a breath of fresh air for defending champions Chennai Super Kings in the ongoing 15th season of the Indian… The post Highest partnership in IPL 2022: Highest 1st wicket partnership in IPL 2022 appeared first on The SportsRush.","content":"Highest partnership in IPL 2022: The opening pair of Chennai Super Kings has put together the highest partnership of this season. Reinstatement of legendary captain Mahendra Singh Dhoni in the leadership role seems to have provided a breath of fresh air for defending champions Chennai Super Kings in the ongoing 15th season of the Indian Premier League. Playing their ninth match of the season against Sunrisers Hyderabad in Pune, opening batters Ruturaj Gaikwad and Devon Conway put together the highest IPL 2022 partnership in a must-win contest. Not been in the best of forms this season, Gaikwad didn’t let an opportunity of generating impact at his home ground of Maharashtra Cricket Association Stadium go waste tonight. Conway, on the other hand, also justified his potential in what is his second match of the season after spending a lot of time on the bench. Pune born Ruturaj Gaikwad playing at his home ground on Maharashtra Day #CSKvSRH #IPL2022 pic.twitter.com/eNTNAQhp8L — Wasim Jaffer (@WasimJaffer14) May 1, 2022 Having scored only 40 runs in the powerplay, Gaikwad and Conway got their eyes in before setting the stage on fire once the fielding restrictions were lifted. What followed was the right-left combination scoring as many as 142 runs in the next 71 deliveries. All in all, a 107-ball 182-run partnership saw Gaikwad and Conway registering the fourth-highest opening partnership in the history of the IPL. Readers must note that it is the highest-ever partnership between two batters playing for CSK. Highest partnership in IPL 2022 Runs Batters Wicket Team Opposition Venue 182 Ruturaj Gaikwad & Devon Conway 1st Chennai Super Kings Sunrisers Hyderabad MCA Stadium 165 Robin Uthappa & Shivam Dube 3rd Chennai Super Kings Royal Challengers Bangalore DY Patil 155 Jos Buttler & Devdutt Padikkal 1st Rajasthan Royals Delhi Capitals Wankhede 118 Faf du Plessis & Virat Kohli 2nd Royal Challengers Bangalore Punjab Kings DY Patil 110 Shikhar Dhawan & Bhanuka Rajapaksa 2nd Punjab Kings Chennai Super Kings Wankhede While Gaikwad scored 99 (57) with the help of six fours and as many sixes to become the fifth batter to get out on 99 in the IPL, Conway returned with 85* (55) comprising of eight fours and four sixes to power Super Kings to 202/2 in 20 overs. Highest 1st wicket partnership in IPL 2022 Runs Batters Team Opposition Venue 182 Ruturaj Gaikwad & Devon Conway Chennai Super Kings Sunrisers Hyderabad MCA Stadium 155 Jos Buttler & Devdutt Padikkal Rajasthan Royals Delhi Capitals Wankhede Stadium 99 KL Rahul & Quinton de Kock Lucknow Super Giants Chennai Super Kings Brabourne Stadium 97 Mayank Agarwal & Shikhar Dhawan Punjab Kings Mumbai Indians MCA Stadium 97 Jos Buttler & Devdutt Padikkal Rajasthan Royals Kolkata Knight Riders Brabourne Stadium The post Highest partnership in IPL 2022: Highest 1st wicket partnership in IPL 2022 appeared first on The SportsRush.","pubDate":"2022-05-01 16:03:18","full_description":"Highest partnership in IPL 2022: The opening pair of Chennai Super Kings has put together the highest partnership of this season. Reinstatement of legendary captain Mahendra Singh Dhoni in the leadership role seems to have provided a breath of fresh air for defending champions Chennai Super Kings in the ongoing 15th season of the Indian Premier League. Playing their ninth match of the season against Sunrisers Hyderabad in Pune, opening batters Ruturaj Gaikwad and Devon Conway put together the highest IPL 2022 partnership in a must-win contest. Not been in the best of forms this season, Gaikwad didn’t let an opportunity of generating impact at his home ground of Maharashtra Cricket Association Stadium go waste tonight. Conway, on the other hand, also justified his potential in what is his second match of the season after spending a lot of time on the bench. Pune born Ruturaj Gaikwad playing at his home ground on Maharashtra Day 😉 #CSKvSRH #IPL2022 pic.twitter.com/eNTNAQhp8L — Wasim Jaffer (@WasimJaffer14) May 1, 2022 Having scored only 40 runs in the powerplay, Gaikwad and Conway got their eyes in before setting the stage on fire once the fielding restrictions were lifted. What followed was the right-left combination scoring as many as 142 runs in the next 71 deliveries. All in all, a 107-ball 182-run partnership saw Gaikwad and Conway registering the fourth-highest opening partnership in the history of the IPL. Readers must note that it is the highest-ever partnership between two batters playing for CSK. While Gaikwad scored 99 (57) with the help of six fours and as many sixes to become the fifth batter to get out on 99 in the IPL , Conway returned with 85* (55) comprising of eight fours and four sixes to power Super Kings to 202/2 in 20 overs.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Mohsin Khan cricketer biography: Lucknow Super Giants bowler Mohsin Khan family details","link":"https://thesportsrush.com/cricket-news-mohsin-khan-cricketer-biography-lucknow-super-giants-bowler-mohsin-khan-family-details/","keywords":["Cricket","IPL 2022","Lucknow Super Giants","LSG","Mohsin Khan"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Mohsin Khan cricketer biography: Mohsin Ali was adjudged Man of the Match for his brilliant performance in the IPL 2022 game. In the 46th league game of the Indian Premier League 2022 game between Lucknow Super Giants and Delhi Capitals, Mohsin Khan was won the player of the match for his incredible performance. Mohsin Khan,… The post Mohsin Khan cricketer biography: Lucknow Super Giants bowler Mohsin Khan family details appeared first on The SportsRush.","content":"Mohsin Khan cricketer biography: Mohsin Ali was adjudged Man of the Match for his brilliant performance in the IPL 2022 game. In the 46th league game of the Indian Premier League 2022 game between Lucknow Super Giants and Delhi Capitals, Mohsin Khan was won the player of the match for his incredible performance. Mohsin Khan, who just made his debut this year only delivered an incredible performance. Lucknow Super Giants scored 195 runs in the first innings, courtesy of half-centuries from KL Rahul and Deepak Hooda. Shardul Thakur scalped three wickets for the Delhi Capitals. Delhi Capitals, in reply, had a brilliant start in the powerplay overs, but Mohsin Khan bowled an incredible spell in the match. He scalped four wickets by conceding just 16 runs in four overs. He took the big wickets of David Warner, Rishabh Pant and Rovman Powell. Mohsin Khan cricketer biography Mohsin Khan comes from very humble family background. Multan Khan is the father of Mohsin Khan, who is a sub-inspector. In a recent interview with Deepak Hooda, Hooda shared and recounted his journey. He mentioned how he fulfilled the dream of his parents. Lucknow Super Giants bought Mohsin Khan for a price of INR 20 Lacs in the IPL 2022 auction. Mohsin Khan was a part of Mumbai Indians in the part, but he never got many opportunities. “Happy to accomplish my parents’ dream of playing in the IPL.” Pace sensation @mohsin07khan reflects on his ongoing #TATAIPL experience in a chat with @HoodaOnFire post @LucknowIPL‘s win in Pune. – By @Moulinparikh Full interview #PBKSvLSGhttps://t.co/iDVyPTIKCt pic.twitter.com/QU3k5o4MuI — IndianPremierLeague (@IPL) April 30, 2022 “I was with the Mumbai Indians for the last three years and it’s a big team so I didn’t get an opportunity really but I learned a lot. Now here at LSG, the team is strong, support staff and management have been really supportive,” Mohsin Khan said. “They just tell me to back my strengths and do what I have been doing in domestic cricket. Skipper KL Rahul and coaches have asked me to add a few things to my arsenal and will keep working hard.” Mohsin Khan said that his parents were waiting for his opportunity for the last three years. He also dedicated his performances for both of them.   The post Mohsin Khan cricketer biography: Lucknow Super Giants bowler Mohsin Khan family details appeared first on The SportsRush.","pubDate":"2022-05-01 16:03:17","full_description":"Mohsin Khan cricketer biography: Mohsin Ali was adjudged Man of the Match for his brilliant performance in the IPL 2022 game. In the 46th league game of the Indian Premier League 2022 game between Lucknow Super Giants and Delhi Capitals, Mohsin Khan was won the player of the match for his incredible performance. Mohsin Khan, who just made his debut this year only delivered an incredible performance. Lucknow Super Giants scored 195 runs in the first innings, courtesy of half-centuries from KL Rahul and Deepak Hooda. Shardul Thakur scalped three wickets for the Delhi Capitals. Delhi Capitals, in reply, had a brilliant start in the powerplay overs, but Mohsin Khan bowled an incredible spell in the match. He scalped four wickets by conceding just 16 runs in four overs. He took the big wickets of David Warner, Rishabh Pant and Rovman Powell. Mohsin Khan comes from very humble family background. Multan Khan is the father of Mohsin Khan, who is a sub-inspector. In a recent interview with Deepak Hooda, Hooda shared and recounted his journey. He mentioned how he fulfilled the dream of his parents. Lucknow Super Giants bought Mohsin Khan for a price of INR 20 Lacs in the IPL 2022 auction. Mohsin Khan was a part of Mumbai Indians in the part, but he never got many opportunities. 🗣 “Happy to accomplish my parents’ dream of playing in the IPL.” Pace sensation @mohsin07khan reflects on his ongoing #TATAIPL experience in a chat with @HoodaOnFire post @LucknowIPL ‘s win in Pune. 👏 👏 – By @Moulinparikh Full interview 🔽 #PBKSvLSG https://t.co/iDVyPTIKCt pic.twitter.com/QU3k5o4MuI — IndianPremierLeague (@IPL) April 30, 2022 “I was with the Mumbai Indians for the last three years and it’s a big team so I didn’t get an opportunity really but I learned a lot. Now here at LSG, the team is strong, support staff and management have been really supportive,” Mohsin Khan said. “They just tell me to back my strengths and do what I have been doing in domestic cricket. Skipper KL Rahul and coaches have asked me to add a few things to my arsenal and will keep working hard.” Mohsin Khan said that his parents were waiting for his opportunity for the last three years. He also dedicated his performances for both of them.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Ruturaj Gaikwad gets out on 99; check out the best reactions","link":"https://www.indiatvnews.com/sports/cricket/ipl-2022-ruturaj-gaikwad-gets-out-on-99-check-out-the-best-twitter-reactions-2022-05-01-773515","keywords":null,"creator":null,"video_url":null,"description":"Maharashtra Cricket Association Stadium witnessed absolute carnage as Ruturaj Gaikwad smashed the bowlers all over the park on his way to a heartbreaking but brilliantly made 99.","content":null,"pubDate":"2022-05-01 15:52:03","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL preview: KKR hope to end losing streak against RR","link":"https://telanganatoday.com/ipl-preview-kkr-hope-to-end-losing-streak-against-rr","keywords":["News","Sport","IPL","Kolkata Knight Riders","Rajasthan Royals","Shreyas Iyer"],"creator":["Telangana Today"],"video_url":null,"description":"Mumbai: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday. The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR […]","content":"Mumbai: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday. The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR have been forced to make regularly at the top of the order. Venkatesh’s performances have been underwhelming to say the least after a season that helped him get into the Indian team. After his struggles at the top, the team tried him in the middle-order but that too did not work. The southpaw was back opening alongside Aaron Finch in the last game but runs deserted him again. Making the play-offs from here looks improbable for KKR who desperately need to find their best XI and stick with it for the remainder of the competition. “A lot of chopping and changing is happening, it’s been difficult to set up the right combination, with all injuries not helping as well. We need to stick together, play some fearless cricket, not be conservative with the bat. “Five more matches remaining, we need to play well, show belief and give something back to the team and the management, forget about the past, start fresh and back your instinct,” said skipper Shreyas Iyer after the last game. Shreyas has had a decent run as a batter with 290 runs at 36.25 but he has not got enough support from his teammates. In his first season as KKR captain, Shreyas has shown promise but needs to inspire his troops to script a turnaround. Alongside Venkatesh, the dismal run of another retained player Varun Chakaravarthy has hurt the team. However, the move to drop him in the previous game did not yield the desired results as KKR lost their fifth game in a row. The trio of Tim Southee, Umesh Yadav and Sunil Narine has been impressive and will be aiming to keep the in-form Jos Buttler quiet. Rajasthan rely a lot on Buttler and his 566 runs at 70.75 are a big reason why they find themselves in the top-four. As the Englishman can’t be expected to fire in every game, skipper Sanju Samson needs to step up and be more consistent. They are arguably the best bowling side in the competition but could not defend 159 in their previous game against Mumbai Indians due to heavy dew. With 19 wickets at 13.68, Yuzvendra Chahal leads the bowling charts this season and alongside R Ashwin, Trent Boult and Prasidh Krishna, the Rajasthan attack has the ability to defend even below-par totals. However, Royals will be looking for a much-improved batting effort to minimise the dew factor. Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-05-01 15:28:41","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs CSK Live Updates: Ruturaj Gaikwad On A Roll, SunRisers Hyderabad Clueless vs Rampant Chennai Super Kings Openers - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMinAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1zcmgtdnMtY3NrLWxpdmUtY3JpY2tldC1zY29yZS1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLWNoZW5uYWktc3VwZXIta2luZ3MtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5MzcwNzfSAaIBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjIvbGl2ZS1pcGwtc2NvcmUtc3JoLXZzLWNzay1saXZlLWNyaWNrZXQtc2NvcmUtc3VucmlzZXJzLWh5ZGVyYWJhZC12cy1jaGVubmFpLXN1cGVyLWtpbmdzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTM3MDc3L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs CSK Live Updates: Ruturaj Gaikwad On A Roll, SunRisers Hyderabad Clueless vs Rampant Chennai Super Kings Openers  NDTV Sports#IPL2022 | #SRHvCSK, Match 46: Preview  CricbuzzMatch Preview - Super Kings vs Sunrisers, Indian Premier League 2022, 46th Match  ESPNcricinfoSRH vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket Addictor#SRHvCSK | Cricbuzz Comm Box: Match 46, Hyderabad v Chennai, 1st innings  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-05-01 14:57:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-chennai-super-kings-live-score-over-match-46-t20-6-10-updates-2937326","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-01 14:35:46","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Chennai Super Kings are 87/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Chennai Super Kings. Everything related to Sunrisers Hyderabad and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Chennai Super Kings live score. Do check for Sunrisers Hyderabad vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) Lands it full and outside off, Conway drives this time but finds the cover fielder. At the halfway mark, Chennai are 85/0! 9.5 overs (0 Run) Fullish and on off, angling in, Conway pushes it back to the bowler. 9.5 overs (1 Run) Wide! Sliding down the leg side, Conway tries to flick but misses. 9.4 overs (1 Run) Fuller and around off, it's driven through covers for a single. 9.3 overs (4 Runs) FOUR! Edgy! The quicker you bowl, the faster you travel. Umran Malik clocks 154 kph, as informed by the on-air commentator and bangs it short outside off. Ruturaj Gaikwad shapes up for the pull shot but then tries to back out. The ball though takes the top edge and flies behind the keeper for a boundary. FIFTY FOR GAIKWAD! This has been an excellent knock from him so far. 9.2 overs (4 Runs) MISFIELD AND FOUR! That's a top shot to start with. Fuller and around off, Ruturaj Gaikwad times his straight drive from the sweet spot of his bat and it races down the ground. The long on fielder slides but fails to stop cleanly and it touches the fence. 9.1 overs (1 Run) Full and angling in around off, at 145.5 kph, Conway drives it to mid off and scampers across to the other end. 8.6 overs (1 Run) Fires it full and around off, Devon Conway uses his feet but fails to middle his shot this time. Ends up dragging it off the inner half to long on. A single to complete the over, 14 from the over. Chennai have stepped on the gas after the Powerplay! 8.5 overs (1 Run) A touch short and around leg, Gaikwad eases it by going down on one knee towards deep backward square leg. Another run. 8.4 overs (1 Run) Fuller and flatter on off, swept to deep square leg for a run. 8.3 overs (6 Runs) SIX! What a shot! Fantastic footwork by the Kiwi as he gives the charge to a full ball and smashes it over long off for a biggie. 8.2 overs (4 Runs) FOUR! Easy pickings! Fuller in length and it's darted down the leg side, Conway goes down to sweep and it takes the inner edge and races wide of short fine leg for a boundary. 8.1 overs (1 Run) Quicker and shorter around leg, Gaikwad bends his back knee and sweeps it behind square leg for a run. Strategic break! The Chennai openers have ensured that they do not lose early wickets and it seems that Ruturaj Gaikwad has cut loose in the middle. Conway has struggled a bit with his timing but he is playing second fiddle to Gaikwad at the moment. Hyderabad will need to pick wickets as Chennai bat pretty deep. 7.6 overs (1 Run) Short and on off, pulled to deep mid-wicket for a single. 13 from the first over of Umran Malik. 7.5 overs (0 Run) Run out chance! A touch short and outside off at 126 kph, Gaikwad taps it down to short third man and Devon Conway comes running in, searching for a run. He is sent back and the bowler collects the throw in the middle of the pitch. Umran tries to blindly back-flick it onto the stumps at his end but misses. Devon survives a scare. 7.4 overs (6 Runs) SIX! Ruturaj Gaikwad is targeting Umran Malik here! At 145 clicks, Malik delivers it on a length around off, Ruturaj Gaikwad latches onto it and smites it over wide long on. 7.3 overs (4 Runs) FOUR! Poor delivery and punished! Umran Malik goes short again but offers plenty of width outside off, Gaikwad stays back and slaps it over covers. 50 up! 7.2 overs (0 Run) Digs it in short, around off at 138.9 kph, Ruturaj Gaikwad pulls but finds the mid-wicket fielder. 7.1 overs (2 Runs) MISHIT! Umran delivers it on a length and wide outside off, at 139 clicks, Gaikwad jumps down the track and throws his bat at it. It flies off the top edge and clears mid off. They take a couple. Time for some serious pace, as Umran Malik comes to bowl. 6.6 overs (0 Run) Flighted and full, around off, it's driven back to the bowler. 7 from Markram's first. 6.5 overs (0 Run) Loopy and full, around off, this time Conway plays the reverse-batted sweep shot but finds point. 6.4 overs (1 Run) Tossed up, full and on middle, Ruturaj Gaikwad steps down the track and heaves it over mid-wicket for a single. 6.3 overs (1 Run) Fuller again, around off, Conway sweeps again but this time towards deep square leg. He will get a single. 6.2 overs (4 Runs) FOUR! Shot! This will release some pressure that was building on Conway due to his slow scoring rate. Fuller one, around middle and leg, Devon Conway goes down and sweeps it sweetly towards long leg for a boundary. 6.1 overs (1 Run) Markram begins with a long hop on middle, Ruturaj Gaikwad goes deep inside the crease and pulls it to deep mid-wicket for a run. Aiden Markram comes into the attack. He replaces T Natarajan. 5.6 overs (0 Run) Extra bounce on this length delivery, Conway stays back and tries to run it down to third man. But it takes the bottom edge and rolls behind to the keeper. At the end of the Powerplay, Chennai are 40/0! 5.5 overs (0 Run) A fraction too full and around middle, Conway flicks it with the angle but finds the diving mid-wicket fielder. 5.4 overs (1 Run) A touch short in length, around middle and leg, Ruturaj Gaikwad wrists it through square leg and scoots to the other end. 5.3 overs (1 Run) Serves it on a good length and close to off, Devon Conway walks across the stumps and nudges it behind square leg for one. 5.2 overs (1 Run) Angling away from the batter, on a length, Ruturaj Gaikwad taps it down towards backward point and steals a quick run. 5.1 overs (6 Runs) SIX! Out of here! Gaikwad has been very severe on this length particularly. Short in length, around leg, Ruturaj Gaikwad pulls it disdainfully over backward square leg for a maximum. 1000 runs in the Indian T20 League for him!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637870323387062020.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Live Score, SRH vs CSK: Ruturaj Gaikwad, Devon Conway start strong - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pcGwtMjAyMi1saXZlLWNyaWNrZXQtc2NvcmUtc3JoLXZzLWNzay10MjAtbWF0Y2gtZnVsbC1zY29yZWNhcmQtbGF0ZXN0LXVwZGF0ZXMtMTAxNjUxNDAwNjQ5NzI5Lmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Live Score, SRH vs CSK: Ruturaj Gaikwad, Devon Conway start strong  Hindustan Times#IPL2022 | #SRHvCSK, Match 46: Preview  CricbuzzMatch Preview - Super Kings vs Sunrisers, Indian Premier League 2022, 46th Match  ESPNcricinfoSRH vs CSK Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorHYD vs CHE 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match 46 of Indian T20 League 2022  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-05-01 14:31:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Chennai Super Kings: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-chennai-super-kings-live-score-over-match-46-t20-1-5-updates-2937204","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Chennai Super Kings from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-01 14:05:37","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Chennai Super Kings are 37/0. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Chennai Super Kings. Everything related to Sunrisers Hyderabad and Chennai Super Kings match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Chennai Super Kings live score. Do check for Sunrisers Hyderabad vs Chennai Super Kings scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (1 Run) A full ball, on middle. Ruturaj Gaikwad drives it towards mid on and takes a quick run. 4.5 overs (4 Runs) FOUR! UP AND OVER! Slightly short and around off. Gaikwad gets on top of the ball and pulls it in front of square on the leg side, over the mid-wicket fielder for a boundary. Top shot! 4.4 overs (0 Run) Natarajan hits the deck hard, around off. Gaikwad stands tall and dabs it towards cover. 4.3 overs (1 Run) Leg bye! Back of a length, angling in late. Conway gets cramped for room and fails to get any bat on it. The ball hits the front pad and rolls towards point for a leg bye. 4.2 overs (1 Run) Edged but safe! A length ball, around off and shaping away slightly. Gaikwad looks to block with hard hands. The ball takes the outside edge and goes towards the short third man fielder, on the bounce. A single taken. 4.1 overs (1 Run) This is a good-length ball, angling in from middle. Devon Conway nudges it to the leg side and rotates the strike. Change in bowling. T Natarajan is ready to deliver the fifth the over. 3.6 overs (0 Run) On a length, around middle. Ruturaj Gaikwad tucks it to mid-wicket. 3.5 overs (1 Run) Back of a length, outside off. Devon Conway steers it to third man for a single. 3.4 overs (3 Runs) Top effort in the deep from Washington Sundar! Short ball, around middle, Gaikwad blazes his pull shot in front of square on the leg side. Washington Sundar scoots across to his left and puts in a dive to stop the racing ball. It once again starts to roll away towards the fence and Sundar recovers in time to dive and pick up the ball. But, while trying to get up, his right hand brushes his right knee and the ball gets deflected away to his left. At last, he neatly gets up to hold the ball and throws it back in play. Three runs are taken. 3.3 overs (1 Run) Leg bye! Short of a length, around leg. Conway misses his nudge on the leg side and gets hit on his thigh pad. The ball rolls towards short fine leg for another leg bye. 3.2 overs (0 Run) Good-length ball, jagging back in from off. Conway manages to block it back to the bowler. 3.1 overs (0 Run) Full and outside off. Conway drives it towards the mid off fielder. 2.6 overs (1 Run) Back of a length, outside off. Devon Conway steers it to third man and settles for a run. He will retain the strike. 2.5 overs (4 Runs) FOUR! WHACKED! That is a shot and a half from the southpaw! Slightly short, around middle, Conway hangs back and pulls it in front of square on the leg side for a boundary. 2.4 overs (2 Runs) TWO LEG BYES! A length ball, around leg. Conway misses his flick and gets hit high on his pad. The ball rolls towards Umran Malik at short fine leg who misfields and the batters collect two leg byes. 2.3 overs (1 Run) A bit full and around middle, Gaikwad works it to mid on and bags another single. 2.2 overs (1 Run) Good running between the wickets! A length ball, around off. Conway taps it to the off side and his partner calls him through for a quick run. 2.1 overs (0 Run) This lands on a length, around middle. Conway defends it back to the bowler. 1.6 overs (0 Run) Jansen hits the deck hard, just outside off. Gaikwad has a poke at it but the ball whizzes past the outside edge. Good comeback from Marco Jansen after conceding a maximum. 1.5 overs (0 Run) A length ball, around off. Gaikwad defends it to the off side. 1.4 overs (0 Run) A full ball, on middle. Gaikwad flicks it towards mid-wicket. 1.3 overs (6 Runs) SIX! BANG! A short ball, around middle, Ruturaj Gaikwad sits back and swivel-pulls it over fine leg for a biggie. 1.2 overs (0 Run) Good-length ball, just outside off. Ruturaj Gaikwad drives it towards the cover fielder who fumbles and Devon Conway at the non-striker's end survives as he was looking for a quick run. Update - Lucknow have beaten Delhi in a close game by 6 runs to move to number 2 in the table. 1.1 overs (0 Run) Good shot for none! Full and around off. Gaikwad drives but finds the cover fielder. Who will bowl the second over? It's going to be Marco Jansen. 0.6 over (1 Run) Full and outside off. Gaikwad drives it towards mid off and scampers through to the other end. 3 runs off the first over! 0.5 over (0 Run) Good-length delivery, around off. Gaikwad guides it towards the short third man fielder and looks for a quick run but is wisely sent back by his partner at the other end. 0.4 over (0 Run) Play and a miss! Short of a length, just outside off and shaping away a tad. Gaikwad stays back and looks to cut hard but he fails to make any connection. 0.3 over (0 Run) Slightly fuller, outside off. Gaikwad prods and pushes it towards the extra cover fielder. 0.2 over (1 Run) On a length, around middle, Conway flicks it through the leg side for a run. He too gets off the mark. 0.1 over (1 Run) Back of a length, around off. Gaikwad stays back and just steers it to third man. He gets off the mark with a single. Chennai are up and running straightaway! Right then, we are ready to get underway with the second game of the evening. The players walk out to the middle. Ruturaj Gaikwad has a new opening partner in Devon Conway. Bhuvneshwar Kumar is ready to bowl the first over. Here we go... MS Dhoni, the skipper of Chennai, says that we will definitely see him in the yellow jersey next year, whether it is the same one or the other one, that remains to be seen. Adds that injuries are part and parcel of the game but they need to identify the areas where they need to work on. Tells that they need to bowl better and not concede too many runs along with taking the catches. Informs that they have made two changes to their side - Simarjeet Singh and Devon Conway come in for Shivam Dube and Dwayne Bravo. Kane Williamson, the captain of Hyderabad, says that they have chased well and they also want to use the conditions upfront with the ball. Adds that they lost a close game and today is yet another opportunity for them. Informs that they are going UNCHANGED. Chennai (Playing XI) - Ruturaj Gaikwad, Robin Uthappa, Devon Conway (In for Dwayne Bravo), Ambati Rayudu, Simarjeet Singh (In for Shivam Dube), Ravindra Jadeja, MS Dhoni (C/WK), Mitchell Santner, Dwaine Pretorius, Maheesh Theekshana, Mukesh Choudhary. Hyderabad (Unchanged Playing XI) - Abhishek Sharma, Kane Williamson (C), Rahul Tripathi, Aiden Markram, Nicholas Pooran (WK), Washington Sundar, Shashank Singh, Marco Jansen, Bhuvneshwar Kumar, T Natarajan, Umran Malik. TOSS - Hyderabad have won the toss and they have elected to BOWL first. Update from Match 45 - There is another game going on at the moment in Mumbai and it is Delhi who require 83 more runs to win off 48 balls against Lucknow. The big-hitters, Rishabh Pant and Rovman Powell are at the crease and Delhi would certainly fancy their chances. You can keep switching tabs and enjoy the coverage of both games. The Kane Williamson-led Hyderabad side was on a 5-game winning streak until they met Gujarat at the Wankhede Stadium where they were handed a defeat on the last ball of the match. They are a power-packed bowling unit and the form of their opening batter, Abhishek Sharma has done wonders for them. Will they be able to bounce back and register their sixth win of the season? We shall find that soon. Stick around for toss and further updates. With MS Dhoni back at the helm, the 4-time champions would be looking to turn things around in the second half of this season. After winning the last-ball thriller against Mumbai, Chennai failed to carry on with the winning momentum and suffered a defeat in their next game against Punjab. They have been inconsistent in all the departments and would be keen to make amends against Hyderabad. The Yellow team needs to get back to winning ways as soon as possible if they are to stand a chance of making it to the playoffs. Things are heating up in the Indian T20 League as we are approaching the business end of the tournament and we have another cracker of a game lined up, folks. It is the defending champions, Chennai who will be taking on Hyderabad at the MCA Stadium in Pune. On that note, a very warm welcome to our coverage. ... Match Day ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637870305305322542.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Simarjeet Singh cricketer IPL stats: Why DJ Bravo not playing today’s IPL 2022 match between SRH and CSK?","link":"https://thesportsrush.com/cricket-news-simarjeet-singh-cricketer-ipl-stats-why-dj-bravo-not-playing-todays-ipl-2022-match-between-srh-and-csk/","keywords":["Cricket","CSK","IPL 2022","Sunrisers Hyderabad","chennai super kings","csk","Devon Conway","Dwayne Bravo","Indian Premier League","Shivam Dube","Simarjeet Singh","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why DJ Bravo not playing today: Defending champions Chennai Super Kings have made a couple of changes to their Playing XI for this match. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Sunrisers Hyderabad captain Kane Williamson has won the… The post Simarjeet Singh cricketer IPL stats: Why DJ Bravo not playing today’s IPL 2022 match between SRH and CSK? appeared first on The SportsRush.","content":"Why DJ Bravo not playing today: Defending champions Chennai Super Kings have made a couple of changes to their Playing XI for this match. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Sunrisers Hyderabad captain Kane Williamson has won the toss and chose to bowl. “We are going to bowl first. For us, we have done it something well, we’ll try to make use of the conditions with the ball. It was a close game [vs Gujarat Titans], today is another opportunity as a team,” Williamson told Star Sports at the toss. In spite of losing their last match at the Wankhede Stadium on Friday, Sunrisers have looked at prevailing with the same Playing XI which had won them five matches in a row. Cool vs Calm! #SRHvCSK #Yellove #WhistlePodu pic.twitter.com/6X6myb46mS — Chennai Super Kings (@ChennaiIPL) May 1, 2022 Why is DJ Bravo not playing vs SRH today? Returning to captaincy after a sudden mid-season change, Chennai Super Kings captain Mahendra Singh Dhoni laid emphasis on a better fielding performance in a season where their chances of qualifying for the playoffs remain very little. “You need to realise the current situation. We have dropped catches, those are the things you want to omit. Those are the areas you need to work on,” Dhoni told Star Sports at the toss. Unlike Hyderabad, Chennai have made a couple of changes to their Playing XI. Batter Devon Conway and debutant pacer Simarjeet Singh have replaced all-rounders Shivam Dube and Dwayne Bravo in the XI. Readers must note that Dhoni wasn’t asked about the rationale behind making these changes. Habitual of managing Bravo’s workload, CSK might have thought of doing the same in case of a slight niggle to the 38-year old player. Having picked 14 wickets in eight matches at an average of 18.50, an economy rate of 8.73 and a strike rate of 12.7, Bravo is Super Kings’ highest wicket-taker this season. Simarjeet, who represents Delhi in domestic cricket, will be making his IPL debut tonight. Readers must note that Simarjeet had made headlines after he was among the five net bowlers who had traveled alongside the senior Indian team to their tour of Sri Lanka last year. Having replaced Arjun Tendulkar at Mumbai Indians during IPL 2021 Phase 2, Simarjeet hadn’t got an opportunity to play any match for them. During IPL 2022 mega auction held in Bengaluru earlier this year, Chennai bought the 24-year old player for his base price of INR 20 lakh. In 20 T20s, Simarjeet has picked 24 wickets at an average of 20.33, an economy rate of 7.45 and a strike rate of 16.3. The post Simarjeet Singh cricketer IPL stats: Why DJ Bravo not playing today’s IPL 2022 match between SRH and CSK? appeared first on The SportsRush.","pubDate":"2022-05-01 13:59:51","full_description":"Why DJ Bravo not playing today: Defending champions Chennai Super Kings have made a couple of changes to their Playing XI for this match. During the 46th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Chennai Super Kings in Pune, Sunrisers Hyderabad captain Kane Williamson has won the toss and chose to bowl. “We are going to bowl first. For us, we have done it something well, we’ll try to make use of the conditions with the ball. It was a close game [vs Gujarat Titans], today is another opportunity as a team,” Williamson told Star Sports at the toss. In spite of losing their last match at the Wankhede Stadium on Friday, Sunrisers have looked at prevailing with the same Playing XI which had won them five matches in a row. Cool vs Calm! 🧊😌 #SRHvCSK #Yellove #WhistlePodu 🦁💛 pic.twitter.com/6X6myb46mS — Chennai Super Kings (@ChennaiIPL) May 1, 2022 Returning to captaincy after a sudden mid-season change, Chennai Super Kings captain Mahendra Singh Dhoni laid emphasis on a better fielding performance in a season where their chances of qualifying for the playoffs remain very little . “You need to realise the current situation. We have dropped catches, those are the things you want to omit. Those are the areas you need to work on,” Dhoni told Star Sports at the toss. Unlike Hyderabad, Chennai have made a couple of changes to their Playing XI. Batter Devon Conway and debutant pacer Simarjeet Singh have replaced all-rounders Shivam Dube and Dwayne Bravo in the XI. Readers must note that Dhoni wasn’t asked about the rationale behind making these changes. Habitual of managing Bravo’s workload, CSK might have thought of doing the same in case of a slight niggle to the 38-year old player. Having picked 14 wickets in eight matches at an average of 18.50, an economy rate of 8.73 and a strike rate of 12.7, Bravo is Super Kings’ highest wicket-taker this season. Simarjeet, who represents Delhi in domestic cricket, will be making his IPL debut tonight. Readers must note that Simarjeet had made headlines after he was among the five net bowlers who had traveled alongside the senior Indian team to their tour of Sri Lanka last year. Having replaced Arjun Tendulkar at Mumbai Indians during IPL 2021 Phase 2, Simarjeet hadn’t got an opportunity to play any match for them. During IPL 2022 mega auction held in Bengaluru earlier this year, Chennai bought the 24-year old player for his base price of INR 20 lakh. In 20 T20s, Simarjeet has picked 24 wickets at an average of 20.33, an economy rate of 7.45 and a strike rate of 16.3.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"AP High Court emerge champs of HCA A Division T-20 League","link":"https://telanganatoday.com/ap-high-court-emerge-champs-of-hca-a-division-t-20-league","keywords":["News","Sport","Air India","Andhra Pradesh High Court","HCA A division","Rajiv Gandhi International Cricket Stadium"],"creator":["Telangana Today"],"video_url":null,"description":"Hyderabad: Sher Singh scored 56 runs and picked up two wickets for 20 to guide Andhra Pradesh High Court to a four-run victory over Air India in the final of the HCA A Division Institutions T-20 League cum Knockout Tournament held at the Rajiv Gandhi International Cricket Stadium, Hyderabad on Sunday. Batting first, Andhra Pradesh […]","content":"Hyderabad: Sher Singh scored 56 runs and picked up two wickets for 20 to guide Andhra Pradesh High Court to a four-run victory over Air India in the final of the HCA A Division Institutions T-20 League cum Knockout Tournament held at the Rajiv Gandhi International Cricket Stadium, Hyderabad on Sunday. Batting first, Andhra Pradesh High Court rode on Sher Singh’s half-century and Sai Keerth Babji’s 49 to post 156/6 in 20 overs. Later, Saaksham Gogia returned with three wickets for 35 to guide their side to lift the trophy. For, Air India Jatin Mehta scored 49 and Prabhu Kiran scalped three wickets for 21. Brief scores: A P High Court 152/6 in 20 overs (Sher Singh 56, Sai Keerth Babji 49; Prabhu Kiran 3/21, S Raju 2/25) bt Air India 148/7 in 20 overs (Jatin Mehta 49; Saaksham Gogia 3/35, Sher Singh 2/20). Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-05-01 13:54:01","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"“I would have Alex Hales available for selection”: Rob Key ready to consider Alex Hales for selection in England cricket squad","link":"https://thesportsrush.com/cricket-news-i-would-have-alex-hales-available-for-selection-rob-key-ready-to-consider-alex-hales-for-selection-in-england-cricket-squad/","keywords":["Cricket","IPL 2022","Alex Hales","ECB","Rob Key"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Alex Hales has been out of the English team for almost three years now, but Rob Key has hinted at a career lifeline for him. England cricket team is moving under a new era in red-ball after the announcement of Ben Stokes as the new captain of the side. He has replaced Joe Root, who… The post “I would have Alex Hales available for selection”: Rob Key ready to consider Alex Hales for selection in England cricket squad appeared first on The SportsRush.","content":"Alex Hales has been out of the English team for almost three years now, but Rob Key has hinted at a career lifeline for him. England cricket team is moving under a new era in red-ball after the announcement of Ben Stokes as the new captain of the side. He has replaced Joe Root, who resigned after the West Indies tour. England have been one of the best sides in the white-ball cricket in the recent past, but there is also scope for improvement. Hales has been smashing runs all over the world in T20 cricket, but he has been constantly ignored in the side. Hales has scored 2419 ODI runs, courtesy of 6 centuries, whereas he has also scored 1644 T20I runs. In overall T20s, Hales has scored 9471 runs at a smashing strike-rate of 146.08, courtesy of five centuries. Rob Key ready to consider Alex Hales Alex Hales has been out of favour in England’s cricket team since the 2019 ICC Cricket World Cup. Hales was a part of England’s squad for the world cup, but he failed a drug test prior to the tournament. England were forced to take James Vince instead of Hales in the tournament. England eventually won the tournament, but Alex Hales lost his place permanently in the team. Alex Hales also served a 21-day ban for his drug failure. It is said England’s captain Eoin Morgan is the main man behind Alex Hales’ absence from the team as he was quite disappointed over Hales’ action. In 2018, Hales was engaged in a night brawl in Bristol, and he was banned along with Ben Stokes. He was then given a chance, but the 2019 incident proved costly to him. 11 Tests, 70 ODIs, 60 T20Is 4636 runs including seven centuries First England batter to make a century in men’s T20Is Happy birthday to Alex Hales pic.twitter.com/HgLWwjtJsg — ICC (@ICC) January 3, 2022 However, the new director of English cricket, Rob Key has hinted at a career lifeline for the English opener. Key has said that Hales can certainly be given a chance, but there is no surety as there are a lot of top-order options available on the side. “I will have to speak to the people involved in that decision, but I would have Alex Hales available for selection,” Key said. “I think he has done his time. But does that mean he gets in the team? That’s a different debate.” Alex Hales was selected to play for Kolkata Knight Riders in IPL 2022, but he pulled out due to bio-bubble reasons. The post “I would have Alex Hales available for selection”: Rob Key ready to consider Alex Hales for selection in England cricket squad appeared first on The SportsRush.","pubDate":"2022-05-01 13:21:55","full_description":"Alex Hales has been out of the English team for almost three years now, but Rob Key has hinted at a career lifeline for him. England cricket team is moving under a new era in red-ball after the announcement of Ben Stokes as the new captain of the side. He has replaced Joe Root, who resigned after the West Indies tour. England have been one of the best sides in the white-ball cricket in the recent past, but there is also scope for improvement. Hales has been smashing runs all over the world in T20 cricket, but he has been constantly ignored in the side. Hales has scored 2419 ODI runs, courtesy of 6 centuries, whereas he has also scored 1644 T20I runs. In overall T20s, Hales has scored 9471 runs at a smashing strike-rate of 146.08, courtesy of five centuries. Alex Hales has been out of favour in England’s cricket team since the 2019 ICC Cricket World Cup. Hales was a part of England’s squad for the world cup, but he failed a drug test prior to the tournament. England were forced to take James Vince instead of Hales in the tournament. England eventually won the tournament, but Alex Hales lost his place permanently in the team. Alex Hales also served a 21-day ban for his drug failure. It is said England’s captain Eoin Morgan is the main man behind Alex Hales’ absence from the team as he was quite disappointed over Hales’ action. In 2018, Hales was engaged in a night brawl in Bristol, and he was banned along with Ben Stokes. He was then given a chance, but the 2019 incident proved costly to him. 🔹 11 Tests, 70 ODIs, 60 T20Is 🔹 4636 runs including seven centuries 🔹First England batter to make a century in men’s T20Is Happy birthday to Alex Hales 🍰 pic.twitter.com/HgLWwjtJsg — ICC (@ICC) January 3, 2022 However, the new director of English cricket, Rob Key has hinted at a career lifeline for the English opener. Key has said that Hales can certainly be given a chance, but there is no surety as there are a lot of top-order options available on the side. “I will have to speak to the people involved in that decision, but I would have Alex Hales available for selection,” Key said. “I think he has done his time. But does that mean he gets in the team? That’s a different debate.” Alex Hales was selected to play for Kolkata Knight Riders in IPL 2022, but he pulled out due to bio-bubble reasons.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"NBA, NFL stars invest in Indian cricket franchise","link":"https://www.iol.co.za/sport/cricket/international/nba-nfl-stars-invest-in-indian-cricket-franchise-f07536e5-0dc3-45f5-a876-f74beab3921b","keywords":null,"creator":["AFP"],"video_url":null,"description":"US basketball star Chris Paul and American football players Larry Fitzgerald and Kelvin Beachum have invested in IPL side the Rajasthan Royals.","content":null,"pubDate":"2022-05-01 12:50:11","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/da6a468b-936a-5429-a49d-e2f07f1412ec&operation=CROP&offset=0x125&resize=4164x2339","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IPL Live: MS Dhoni Back As Captain As CSK Take On SRH","link":"https://sports.ndtv.com/cricket/live-ipl-score-srh-vs-csk-live-cricket-score-sunrisers-hyderabad-vs-chennai-super-kings-live-scoreboard-and-updates-2937077","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SunRisers Hyderabad vs Chennai Super Kings Live IPL Score Updates: SunRisers Hyderabad take on Chennai Super Kings at the Maharashtra Cricket Association Stadium in Pune on Sunday.","content":null,"pubDate":"2022-05-01 12:40:11","full_description":"SunRisers Hyderabad (SRH) face Chennai Super Kings (CSK) in Match 46 of the ongoing Indian Premier League (IPL) 2022 season, at the Maharashtra Cricket Association Stadium in Pune on Sunday. SRH are currently fourth in the IPL 2022 Points Table with 10 points from eight fixtures (including five wins and three defeats). In their previous outing, SRH crashed to a defeat against Gujarat Titans (GT), losing by five wickets. But the franchise also had many positives to look at including Umran Malik 's five-wicket haul. Meanwhile, CSK are ninth in the standings with four points from eight fixtures (two wins and six losses). The franchise lost to Punjab Kings (PBKS) in their previous fixture, losing by 11 runs. The upcoming fixture will also see MS Dhoni take over CSK's captaincy from Ravindra Jadeja . Jadeja had taken over the baton from Dhoni ahead of the ongoing season but hasn't been at his best yet. ( LIVE SCORECARD ) Here's how the IPL 2022 points table looks:","image_url":"https://c.ndtvimg.com/2022-05/k61ai56o_dhoni-kane-bcci-ipl_625x300_01_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Faster than Umran Malik? Pakistan's Mohammad Sami claims to have bowled the fastest ball in cricket","link":"https://zeenews.india.com/cricket/watch-faster-than-umran-malik-pakistans-mohammad-sami-claims-to-have-bowled-the-fastest-ball-in-cricket-2459334.html","keywords":null,"creator":null,"video_url":null,"description":"Sami, who represented Pakistan in 36 Tests, 87 ODIs, and 13 T20Is, said that the bowlers who have breached the 160 kph mark have only been able to do so on a few occasions.","content":null,"pubDate":"2022-05-01 12:36:00","full_description":"Sunrisers Hyderabad pacer Umran Malik has become the talk of the town for his fast and furious bowling in the ongoing IPL 2022. In the match against Gujarat Titans, the 22-year-old clocked 153 KMPH which is the fastest ball in the history of IPL. However, a former Pakistan pacer has claimed that he has bowled faster than Umran. In fact, his claim makes him the fastest bowler in the history of cricket, faster than Shoaib Akhtar. #OnThisDay in 2002, Mohammad Sami recorded an ODI hat-trick against West Indies at the Sharjah Cricket Stadium. Pakistan won the match by 51 runs to take an unassailable 2-0 lead in the three match series. Scorecard: https://t.co/kDZBHY6Srk pic.twitter.com/CqBFEvhlmU — Pakistan Cricket (@TheRealPCB) February 15, 2022 Sami, who had made a devastating pair for Pakistan with fast bowler Shoaib Akhtar, claimed that he had breached the 160 kph mark on two occasions during a game and that his speeds were better than Akhtar. Pakistan's pacer Akhtar recorded the fastest delivery ever in international cricket (161.3 kph) against New Zealand in 2002. \"I bowled two balls at more than 160kmph in a match, one was 162 and the other was 164. After that, it was said that the bowling machine (speed gun) was not working. So, the balls were not counted,\" Sami told paktv.tv. Sami, who represented Pakistan in 36 Tests, 87 ODIs, and 13 T20Is, said that the bowlers who have breached the 160 kph mark have only been able to do so on a few occasions. Officially, Sami has recorded the fastest deliveries in his international career at 156.4 kph during an ODI against Zimbabwe in Sharjah in 2003. \"Even if you look at bowling history overall, the bowlers who have crossed the 160 kph-limited have done it only once or twice. It's not like they kept doing it continuously\" he said. The former Pakistan speedster debuted against New Zealand at Auckland Test in March 2001 and played his final game for the side against Australia in March 2016. -With Inputs From IANS","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Good to have Natarajan in contention; bowls very well in death overs, says Gavaskar","link":"https://telanganatoday.com/good-to-have-natarajan-in-contention-bowls-very-well-in-death-overs-says-gavaskar","keywords":["News","Sport","IPL 2022","Natarajan","Sunil Gavaskar","T20 World Cup"],"creator":["IANS"],"video_url":null,"description":"Pune: Former India captain and legendary batter Sunil Gavaskar reckons it’s good to have Sunrisers Hyderabad’s left-arm pacer, T. Natarajan, in contention for making a comeback into the squad in the run-up to Men’s T20 World Cup later in the year in Australia. After missing out on the second half of IPL 2021 due to […]","content":"Pune: Former India captain and legendary batter Sunil Gavaskar reckons it’s good to have Sunrisers Hyderabad’s left-arm pacer, T. Natarajan, in contention for making a comeback into the squad in the run-up to Men’s T20 World Cup later in the year in Australia. After missing out on the second half of IPL 2021 due to Covid-19 and issues with his knee, Natarajan has been troubling the batters with toe crushing yorkers and tidy bowling in the death overs of IPL 2022, picking 15 wickets in eight matches at an average of 17.40 and economy rate of 8.41. “It’s good to see him do well because for some time it seemed as if India had lost him. It’s good to have him back in contention because he bowls very well, particularly in between 16th and 20th over. He’ll be very much in contention (for Team India) for his ability to bowl well in the death overs,” said Gavaskar on Cricket Live show on Star Sports. Gavaskar also believes that the Tamil Nadu pacer has put behind the disappointments of missing out on a large chunk of matches due to injuries as well as Covid-18 and is presenting a case for himself for selection in the Men’s T20 World Cup in Australia, a country where he made a sparkling debut in all formats of international cricket during the 2020/21 tour. “I think it’s a matter of confidence. Last year, perhaps, he wasn’t on top of his game because of the injury situation. Right now he’s full of confidence, he’s had a bit of a break, and he’s fresh and raring to go. He recognises that there is a T20 World Cup in four months and he wants to be on that flight to Australia.” Gavaskar further observed that in IPL 2022, Natarajan is now looking to swing the ball late apart from bowling his trademark yorkers. “He’s always been a yorker specialist but what we’ve seen in recent times is the way he’s managing to move the ball late which deceives the batsmen. So, it’s good to see that improvement in Natarajan.” Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-05-01 12:24:19","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"“Try and copy KL Rahul bat” Michael Vaughan urges kids to follow KL Rahul’s all-format game","link":"https://thesportsrush.com/cricket-news-try-and-copy-kl-rahul-bat-michael-vaughan-urges-kids-to-follow-kl-rahuls-all-format-game/","keywords":["Cricket","IPL 2022","DC vs LSG","KL Rahul","Michael vaughan"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Michael Vaughan has praised KL Rahul after his brilliant half-century against Delhi Capitals in the league match of IPL 2022. In the 45th league match of IPL 2022 between Delhi Capitals and Lucknow Super Giants, KL Rahul again proved his class with the bat. The orange cap winner of IPL 2020, KL Rahul has been… The post “Try and copy KL Rahul bat” Michael Vaughan urges kids to follow KL Rahul’s all-format game appeared first on The SportsRush.","content":"Michael Vaughan has praised KL Rahul after his brilliant half-century against Delhi Capitals in the league match of IPL 2022. In the 45th league match of IPL 2022 between Delhi Capitals and Lucknow Super Giants, KL Rahul again proved his class with the bat. The orange cap winner of IPL 2020, KL Rahul has been one of the most consistent batters in the Indian Premier League history. Against Delhi Capitals, Lucknow lost the wicket of Quinton de Kock early, but Rahul stitched a brilliant partnership of 95 runs for the 2nd wicket with Deepak Hooda. Rahul completed his half-century in 35 balls by taking a single on Chetan Sakariya’s delivery. This is KL Rahul’s 2nd half-century of the tournament, and he has also smashed two centuries against Mumbai Indians this season. He is at the 2nd position in the race of orange cap after Jos Buttler. Michael Vaughan praises KL Rahul Former English captain Michael Vaughan had a lot of praise for KL Rahul after his brilliant half-century against the Delhi Capitals. Vaughan said that the kids should watch KL Rahul bat, and they can use his technique in all three formats of the game. “Kids..Just try and copy KL Rahul bat.. A game that can flow across all formats .. a delight to watch!” Michael Vaughan tweeted. Kids .. Just try and copy @klrahul11 bat .. A game that can flow across all formats .. a delight to watch ! #IPL2022 — Michael Vaughan (@MichaelVaughan) May 1, 2022 KL Rahul has become a constant in the Indian cricket team in all three formats of the game. The technique of KL Rahul has been appreciated by many around the world. Rahul’s ability to play at number five in ODIs and open in T20Is & Tests makes him an incredible player for the side. Earlier this year, KL Rahul also lead the Indian test team in the absence of Virat Kohli and Rohit Sharma in South Africa. India, although lost that game, but the selection of Rahul was pretty obvious as captain. He has been appointed as the vice-captain of the Indian team under Rohit Sharma. KL Rahul has scored 2547 test runs at an average of 35.37, courtesy of 7 centuries. He has also scored 1634 ODI uns and 1831 ODI runs in his career so far. The post “Try and copy KL Rahul bat” Michael Vaughan urges kids to follow KL Rahul’s all-format game appeared first on The SportsRush.","pubDate":"2022-05-01 11:47:53","full_description":"Michael Vaughan has praised KL Rahul after his brilliant half-century against Delhi Capitals in the league match of IPL 2022. In the 45th league match of IPL 2022 between Delhi Capitals and Lucknow Super Giants, KL Rahul again proved his class with the bat. The orange cap winner of IPL 2020, KL Rahul has been one of the most consistent batters in the Indian Premier League history. Against Delhi Capitals, Lucknow lost the wicket of Quinton de Kock early, but Rahul stitched a brilliant partnership of 95 runs for the 2nd wicket with Deepak Hooda. Rahul completed his half-century in 35 balls by taking a single on Chetan Sakariya’s delivery. This is KL Rahul’s 2nd half-century of the tournament, and he has also smashed two centuries against Mumbai Indians this season. He is at the 2nd position in the race of orange cap after Jos Buttler. Former English captain Michael Vaughan had a lot of praise for KL Rahul after his brilliant half-century against the Delhi Capitals. Vaughan said that the kids should watch KL Rahul bat, and they can use his technique in all three formats of the game. “Kids..Just try and copy KL Rahul bat.. A game that can flow across all formats .. a delight to watch!” Michael Vaughan tweeted. Kids .. Just try and copy @klrahul11 bat .. A game that can flow across all formats .. a delight to watch ! #IPL2022 — Michael Vaughan (@MichaelVaughan) May 1, 2022 KL Rahul has become a constant in the Indian cricket team in all three formats of the game. The technique of KL Rahul has been appreciated by many around the world. Rahul’s ability to play at number five in ODIs and open in T20Is & Tests makes him an incredible player for the side. Earlier this year, KL Rahul also lead the Indian test team in the absence of Virat Kohli and Rohit Sharma in South Africa. India, although lost that game, but the selection of Rahul was pretty obvious as captain. He has been appointed as the vice-captain of the Indian team under Rohit Sharma. KL Rahul has scored 2547 test runs at an average of 35.37, courtesy of 7 centuries. He has also scored 1634 ODI uns and 1831 ODI runs in his career so far.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Live Score, DC vs LSG: Rahul, Hooda score fifties, LSG eye big total - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMisAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pcGwtMjAyMi1saXZlLWNyaWNrZXQtc2NvcmUtZGVsaGktY2FwaXRhbHMtdnMtbHVja25vdy1zdXBlci1naWFudHMtdDIwLW1hdGNoLWZ1bGwtc2NvcmVjYXJkLWRjLXZzLWxzZy1sYXRlc3QtdXBkYXRlcy0xMDE2NTEzOTE2OTE4MzcuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Live Score, DC vs LSG: Rahul, Hooda score fifties, LSG eye big total  Hindustan TimesDelhi Capitals vs Lucknow Super Giants Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Capitals vs Super Giants, Indian Premier League 2022, 45th Match  ESPNcricinfoIPL 2022, DC vs LSG Live Updates: KL Rahul Key As Deepak Hooda Departs After Scoring Fifty vs LSG  NDTV SportsDC vs LSG Dream11 Prediction, Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates For Match 45  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-05-01 11:24:55","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, DC vs LSG Live Score Updates: KL Rahul, Deepak Hooda put Lucknow on charge - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWRjLXZzLWxzZy1saXZlLXNjb3JlLXVwZGF0ZXMtNzg5NjAzOC_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, DC vs LSG Live Score Updates: KL Rahul, Deepak Hooda put Lucknow on charge  The Indian ExpressDelhi Capitals vs Lucknow Super Giants Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Capitals vs Super Giants, Indian Premier League 2022, 45th Match  ESPNcricinfoIPL 2022, DC vs LSG Live Updates: KL Rahul, Deepak Hooda On The Charge As DC Bowlers Toil  NDTV SportsDC vs LSG Live Score, IPL 2022: KL Rahul, Deepak Hooda steady Lucknow  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-05-01 11:08:04","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, DC vs LSG Live Updates: KL Rahul, Deepak Hooda Steady LSG After DC Snag Quinton De Kock Early - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1kYy12cy1sc2ctbGl2ZS1jcmlja2V0LXNjb3JlLWRlbGhpLWNhcGl0YWxzLXZzLWx1Y2tub3ctc3VwZXItZ2lhbnRzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTM2NDMz0gGdAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2xpdmUtaXBsLXNjb3JlLWRjLXZzLWxzZy1saXZlLWNyaWNrZXQtc2NvcmUtZGVsaGktY2FwaXRhbHMtdnMtbHVja25vdy1zdXBlci1naWFudHMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5MzY0MzMvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, DC vs LSG Live Updates: KL Rahul, Deepak Hooda Steady LSG After DC Snag Quinton De Kock Early  NDTV SportsDelhi Capitals vs Lucknow Super Giants Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorMatch Preview - Capitals vs Super Giants, Indian Premier League 2022, 45th Match  ESPNcricinfoDC vs LSG Live Score, IPL 2022: Lucknow lose Quinton de Kock after a quick start  Times of IndiaDC vs LSG Dream11 Prediction, Fantasy Cricket Tips, Playing XI, Pitch Report & Injury Updates For Match 45  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-05-01 10:38:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Lucknow Super Giants Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-lucknow-super-giants-live-score-over-match-45-t20-6-10-updates-2936757","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Lucknow Super Giants from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-01 10:35:56","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.1 overs, Lucknow Super Giants are 95/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Delhi Capitals and Lucknow Super Giants. Everything related to Delhi Capitals and Lucknow Super Giants match will be available on Sports.NDTV.com . Stay updated with Delhi Capitals vs Lucknow Super Giants live score. Do check for Delhi Capitals vs Lucknow Super Giants scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) On a good length and on middle, Rahul eases it towards mid wicket and gets a single. He keeps his strike. 9.5 overs (6 Runs) SIX! That has gone a long way! This is right in the arc, full and on middle, Rahul clears his front leg and lofts it over the long on fence for a biggie. They are taking Kuldeep to the cleaners here. 9.4 overs (1 Run) Now Hooda takes one as he eases this down to long on. 9.3 overs (4 Runs) FOUR! Shouts of 'catch it' from Rishabh Pant behind the stumps but this has been hit very hard. A fuller one on middle, Hooda drives it over covers. The ball goes into the ropes for a boundary. 9.2 overs (1 Run) Rahul somehow managed to sweep that! On middle, he slips as he tries to play it, still manages to get it through square leg for a single. 9.1 overs (1 Run) Tossed up delivery, Hooda sweeps it on the full and through square leg for a single. 8.6 overs (0 Run) A flatter one on middle, Rahul pushes it towards mid off. 8.5 overs (1 Run) Hooda comes down the track yet again, the length is shortened again, this is worked through mid-wicket for one. 8.4 overs (1 Run) Shorter and around off, Rahul slaps it through covers and takes one. 8.3 overs (1 Run) On a full length and on middle, Hooda plays it towards mid on for a single. 8.2 overs (4 Runs) FOUR! That has been hit like a rocket! What a shot! Flatter and outside off, this is hammered through extra cover and it races away to the fence. Superb shot. 8.1 overs (0 Run) A fuller one on off, Hooda eases it towards point. DRINKS! It has been a good start for Lucknow and their skipper, Rahul is again looking well set for a big one. Shardul Thakur got rid of Quinton de Kock but not before the opening partnership led the foundation. Hooda is looking positive in the crease too and it is upto Delhi now to take wickets in these middle overs to stem the run flow. 7.6 overs (1 Run) On a shortish length and slower through the air. Hooda knocks it down to long off for yet another single. 7.5 overs (1 Run) On a length, around middle and turning into KL Rahul who works it through mid-wicket for one. 7.4 overs (1 Run) Very full, on leg stump and Hooda flicks it through square leg for a single. 7.3 overs (4 Runs) FOUR! Overpitched and punished. This is a half-volley outside off and Hooda creams it in front of square on the off side for a boundary. 7.2 overs (1 Run) Quicker and flatter, on off. This is pushed towards covers for one. 7.1 overs (4 Runs) FOUR! KL Rahul greets Kuldeep Yadav with a sumptuous straight drive. This is floated up very full and on off stump. Rahul goes deep and drills it back past the bowler. Shardul Thakur slides in from long off and tries to stop it with his feet but it is a boundary. Kuldeep Yadav, the star of this season for Delhi is into the attack. 6.6 overs (1 Run) On off, played through the cover region for a run. 6.5 overs (1 Run) Axar sees Hooda using his feet and drags his length back a bit. Hooda forces the ball down to deep mid-wicket and rotates the strike. 6.4 overs (1 Run) Sliding onto the pads and this is just eased through mid-wicket for one by Rahul. 6.3 overs (0 Run) Flatter this time, on off. Rahul gets an inside edge back onto the deck as he looks to work it away through covers. 6.2 overs (0 Run) Nicely drifted into middle and leg by Axar. Rahul pushes it towards short cover. 6.1 overs (1 Run) Floated up full and around off, this is driven towards sweeper cover for a single. Will we see another over from Shardul Thakur after a wicket in his first over? No, Pant decides to go for a spinner and brings Axar Patel back into the attack. Patel gave away just 3 runs in his first over. 5.6 overs (1 Run) On a good length, around middle Hooda wrists it towards square leg and picks up a single. At the end of the Powerplay, Lucknow are sitting pretty with 57/1! 5.5 overs (0 Run) On middle, blocked out by Hooda. 5.4 overs (2 Runs) Good running! A touch fuller and on the pads. Hooda clips it away through mid-wicket and calls for two straight away and they get it with ease in the end. 5.3 overs (0 Run) Good length, on a righter line on off stump. Hooda nudges it out on the leg side. 5.2 overs (4 Runs) FOUR! Nicely done by Deepak Hooda. Pace on this time and slanted across off, Hooda pierces the gap between point and backward and finds the fence. 5.1 overs (1 Run) Back of a length, angled across the left-hander. Rahul rocks back and plays it through cover-point for a single. 50 comes up for Lucknow.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637870179475036374.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"CSK vs SRH Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Chennai vs Hyderabad","link":"https://www.indiatvnews.com/sports/cricket/csk-vs-srh-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-chennai-super-kings-vs-sunrisers-hyderabad-2022-05-01-773447","keywords":null,"creator":null,"video_url":null,"description":"CSK vs SRH Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Chennai Super Kings vs Sunrisers Hyderabad Match Details","content":null,"pubDate":"2022-05-01 10:12:27","full_description":"Chennai Super Kings vs Sunrisers Hyderabad 2022, Match No. 46 Sunday, 7:30 PM Maharashtra Cricket Association Stadium, Pune , , Shashank Singh, Abhishek Sharma(c), Ruturaj Gaikwad, , , , T Natarajan, Maheesh Theekshana, Umran Malik(vc) Robin Uthappa, Ruturaj Gaikwad, , Ambati Rayudu, Shivam Dube, Ravindra Jadeja, MS Dhoni, Dwaine Pretorius, Dwayne Bravo, Mukesh Choudhary, Maheesh Theekshana , Abhishek Sharma, Rahul Tripathi, Aiden Markram, Nicholas Pooran, Shashank Singh, Washington Sundar, , T Natarajan, Marco Jansen, Umran Malik Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). The match will be streamed live on Hotstar Sunday, 1st May 7:30 PM IST Maharashtra Cricket Association Stadium, Pune Ruturaj Gaikwad, Robin Uthappa, Ambati Rayudu, Shivam Dube, Ravindra Jadeja, MS Dhoni, , Dwaine Pretorius, Dwayne Bravo, Mukesh Choudhary, Maheesh Theekshana, Chris Jordan, Moeen Ali, Devon Conway, Tushar Deshpande, Hari Nishanth, N Jagadeesan, Subhranshu Senapati, Prashant Solanki, KM Asif, Simarjeet Singh, Rajvardhan Hangargekar, Matheesha Pathirana, Bhagath Varma Abhishek Sharma, Kane Williamson, Rahul Tripathi, Aiden Markram, Nicholas Pooran, Shashank Singh, Washington Sundar, Marco Jansen, Bhuvneshwar Kumar, Umran Malik, T Natarajan, Sean Abbott, Ravikumar Samarth, Shreyas Gopal, Jagadeesha Suchith, Glenn Phillips, Vishnu Vinod, Priyam Garg, Kartik Tyagi, Romario Shepherd, Fazalhaq Farooqi, Abdul Samad, Saurabh Dubey","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi Capitals vs Lucknow Super Giants: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/delhi-capitals-vs-lucknow-super-giants-live-score-over-match-45-t20-1-5-updates-2936610","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Delhi Capitals vs Lucknow Super Giants from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-01 09:46:07","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Lucknow Super Giants are 54/1. The live updates of Delhi Capitals vs Lucknow Super Giants scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Delhi Capitals vs Lucknow Super Giants, Delhi Capitals vs Lucknow Super Giants live score, Delhi Capitals vs Lucknow Super Giants scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) On a length, around off. Hooda punches it straight to the short cover-point fielder. Good over from Shardul Thakur 8 runs and a wicket from it. 4.5 overs (1 Run) Tight line this time. On a length, on off. Rahul dabs it with soft hands square on the off side for a single. 4.5 overs (1 Run) WIDE! Thakur goes fuller and down the leg side. Rahul looks to flick it but misses. 4.4 overs (1 Run) A length delivery, on off. Hooda punches it to left of mid off for a single. 4.3 overs (4 Runs) FOUR! Just like Quinton de Kock, Deepak Hooda also gets off the mark with a boundary. A fullish delivery, around off. Hooda drives and gets the inside edge. The ball goes past stumps and into the fine leg fence. Deepak Hooda comes in at number 3. 4.2 overs (0 Run) OUT! CAUGHT! Shardul Thakur strikes and breaks this dangerous looking opening partnership. Thakur serves a fullish delivery, outside off. It is a bit wide and slower in pace and Quinton de Kock tries reaching for it. He miscues it and the ball goes high in the air towards backward point. The fielder there Lalit Yadav takes the catch and Delhi get the much-needed breakthrough. 4.1 overs (1 Run) Back of a length, outside off. Rahul looks to drag it towards the leg side but mistimes it and takes a single as the ball rolls in the ring on the leg side. Back to pace now from Rishabh Pant as Shardul Thakur is brought into the attack. 3.6 overs (4 Runs) FOUR! Boundary to end the over and after a good last over from Axar this one produces 16 runs! Slightly shorter, around off. Quinton de Kock makes a bit of room and slaps it through cover-point for a boundary. 3.5 overs (1 Run) Tough chance gone down! A fuller delivery on off. Rahul slams it right of the bowler. Lalit Yadav gets some a hand on it but it is too quick and does not stick. A single taken towards mid on. 3.4 overs (4 Runs) FOUR! Playing with the field now! A flatter delivery on off. Rahul gets across and sweeps it fine past short fine leg for a boundary. 3.3 overs (6 Runs) SIX! Rahul was itching to go for a big shot and he connects this quite well. A tossed up delivery on off. Rahul skips down the track and lofts it over wide long off for a maximum. 3.2 overs (0 Run) Pushes this at 96.8 kph, on off. rahul tries to work it away towards the leg side but gets the leading edge. The ball falls short of the bowler. 3.1 overs (1 Run) Lalit Yadav starts with a flatter delivery, around off. Quinton de Kock mistimes his cut shot towards the off side and takes a single. Spin from both ends now as Lalit Yadav is inserted into the attack. 2.6 overs (0 Run) Patel fires it on off and slightly on the shorter side. Rahul punches it to mid off. Good over from Axar just 3 from it. 2.5 overs (0 Run) Cannot find the gap again! A flatter delivery on middle. Rahul makes room and slaps it to the cover fielder again. 2.4 overs (0 Run) Another quicker one and outside off. Rahul cuts but it goes straight to the cover fielder. 2.3 overs (0 Run) A flatter delivery on middle. Rahul pushes it towards the leg side. 2.3 overs (1 Run) WIDE! Patel goes wide outside off and Rahul leaves it alone. The umpire calls it wide but it was a close call. 2.2 overs (1 Run) A slightly shorter delivery angling into off from over the wicket. Quinton de Kock nudges it to mid-wicket for a single. 2.1 overs (1 Run) Patel starts with a fuller delivery on off. Rahul drives it to long off for a single. Early change in the bowling as Axar Patel comes on to bowl. 1.6 overs (4 Runs) FOUR! Another boundary and 16 from this over! A fullish delivery, outside off. Quinton de Kock leans towards it and lifts it over the in-field in the cover region for a boundary. 1.5 overs (6 Runs) SIX! First maximum of the game! Back of a length, on off. Not much pace on the ball to trouble Quinton de Kock and he pulls it over deep mid-wicket for a maximum. 1.5 overs (2 Runs) TWO WIDES! Chetan Sakariya serves this down the leg side at 122.4 kph. Rahul looks to work it towards the leg side, he misses. Pant fails to collect it cleanly too and a bye is taken. 1.4 overs (1 Run) A slower delivery this time, on a length, around off. Quinton de Kock cuts it to cover-point without much timing for a single. 1.3 overs (1 Run) Chetan Sakariya lands this one on a length, around off at 131.9 kph. Rahul leans forward and defends it towards the off side for a single. 1.2 overs (1 Run) On a length, on middle. Quinton de Kock pushes it to mid on and takes a single. 1.1 overs (1 Run) Back of a length, around off. Rahul dabs it towards point for a single. Chetan Sakariya, the other left-arm pacer in the Delhi side to share the new ball with Mustafizur Rahman. 0.6 over (0 Run) So 6 runs from the first over! A fullish delivery, around off. Quinton de Kock looks to drive it away but misses. 0.5 over (0 Run) Rahman bowls this full and down the leg side. Quinton de Kock looks to clip it but misses and the ball brushes his pads. Pant dives to his right and does not catch it but half-stops it. 0.4 over (0 Run) Nicely played but a dot ball! A full ball, on middle and Quinton de Kock drives it to mid on. 0.3 over (1 Run) Rahul is off the mark as well! Overpitched delivery on middle and a bit of shape into the batter. Rahul works it right of mid on for a single. 0.2 over (1 Run) Goes fuller again on middle. Quinton de Kock pushes it to mid on for a single. 0.1 over (4 Runs) FOUR! Quinton de Kock and Lucknow are underway with a boundary! Unlucky for Mustafizur Rahman but Lucknow will take it. It is a full delivery on off. Quinton de Kock looks to drive it towards the off side but gets the inside edge of his blade. The ball goes past the stumps towards the fine leg fence. We are ready for play! The two umpires make their way out to the middle, followed by the players of Delhi. The dynamic opening pair of KL Rahul and Quinton de Kock also stride out to the middle. Mustafizur Rahman has the new ball in hand and is raring to go. Let's play... Rishabh Pant, the skipper of Delhi, says that they don't mind bowling first and tells that this is a new wicket and no one has played in it so lets see how it behaves. Tells that they are focussing on cricket and they are looking to improve. Informs that they are playing an unchanged XI. Mentions that Nortje is coming off well in practice and he is getting back to his best. KL Rahul, the skipper of Lucknow, says that they will have a bat first as the wicket looks good and they want to put runs on the board. Adds they defended a total last time around and hence, backs the guys to do it again. Adds that mistakes do happen and after the last match they had a chat and the guys are honest enough to accept and try to improve. Informs that Krishnappa Gowtham is in for Avesh Khan because Avesh is still recovering from an injury and Krishnappa Gowtham will come into play against the opposition's left-handers. Delhi (Unchanged Playing XI) - Prithvi Shaw, David Warner, Mitchell Marsh, Lalit Yadav, Rishabh Pant (C) (WK), Rovman Powell, Axar Patel, Shardul Thakur, Kuldeep Yadav, Mustafizur Rahman, Chetan Sakariya. Lucknow (Playing XI) - Quinton de Kock (WK), KL Rahul (C), Deepak Hooda, Krunal Pandya, Marcus Stoinis, Ayush Badoni, Jason Holder, Krishnappa Gowtham (In place of Avesh Khan), Dushmantha Chameera, Mohsin Khan, Ravi Bishnoi. TOSS - The coin goes up and lands in favour of Lucknow. They have elected to BAT first. PITCH REPORT - Kevin Pietersen is pitchside. He says that the wicket looks good and talks about the dimensions saying that nowadays the batters don't care about that. Adds that the wickets are getting slower and hence, the pacers need to vary their line and length as well along with the pace. Reckons 160-170 is a good score on this wicket. Lucknow seem a really balanced unit with a lot of firepower in the batting and the bowling. They are on a two-game winning streak and will be looking to make it 3. Lucknow also got the better of Delhi earlier in the season, so they have a bit of an upper hand. Who will come out on top? Toss and teams in a bit… Delhi, just haven't clicked as a unit so far. They haven't managed to put in consistent performances. Yes, they have had their issues but they need to start racking up the wins from here on. They'll be confident heading into this fixture and will hope to match their performance from the last game. On Saturday, we finally saw Mumbai bag its first points of the season. Also, Bangalore lost its third game in a row. That loss now gives Delhi a chance to topple them in the table with a win here. They though are up against a high-flying Lucknow side who can move to second place with a victory. Both the sides head into this game on the back of a win and this promises to be a cracker. On that note, welcome to the coverage. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637870149590597937.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Kolkata Knight Riders hope to end top-order woes, losing streak against Rajasthan Royals","link":"https://www.tribuneindia.com/news/ipl-2022/ipl-2022-kolkata-knight-riders-hope-to-end-top-order-woes-losing-streak-against-rajasthan-royals-390938","keywords":null,"creator":null,"video_url":null,"description":"Mumbai, May 1Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday.The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR have been forced to make regularly at the top of the order.Venkatesh's performances have been underwhelming to say the least after a season that helped him get into the Indian team. After his struggles at the top, the team tried him in the middle-order but that too did not work.The southpaw was back opening alongside Aaron Finch in the last game but runs deserted him again.Making the play-offs from here looks improbable for KKR who desperately need to find their best XI and stick with it for the remainder of the competition.\"A lot of chopping and changing is happening, it's been difficult to set up the right combination, with all injuries not helping as well. We need to stick together, play some fearless cricket, not be conservative with the bat.\"Five more matches remaining, we need to play well, show belief and give something back to the team and the management, forget about the past, start fresh and back your instinct,\" said skipper Shreyas Iyer after the last game.Shreyas has had a decent run as a batter with 290 runs at 36.25 but he has not got enough support from his teammates. In his first season as KKR captain, Shreyas has shown promise but needs to inspire his troops to script a turnaround.Alongside Venkatesh, the dismal run of another retained player Varun Chakaravarthy has hurt the team. However, the move to drop him in the previous game did not yield the desired results as KKR lost their fifth game in a row.The trio of Tim Southee, Umesh Yadav and Sunil Narine has been impressive and will be aiming to keep the in-form Jos Buttler quiet.Rajasthan rely a lot on Buttler and his 566 runs at 70.75 are a big reason why they find themselves in the top-four. As the Englishman can't be expected to fire in every game, skipper Sanju Samson needs to step up and be more consistent.They are arguably the best bowling side in the competition but could not defend 159 in their previous game against Mumbai Indians due to heavy dew.With 19 wickets at 13.68, Yuzvendra Chahal leads the bowling charts this season and alongside R Ashwin, Trent Boult and Prasidh Krishna, the Rajasthan attack has the ability to defend even below-par totals.However, Royals will be looking for a much-improved batting effort to minimise the dew factor.Teams (from):Kolkata Knight Riders: Shreyas Iyer (captain), Aaron Finch, Abhijeet Tomar, Ajinkya Rahane, Baba Indrajith, Nitish Rana, Pratham Singh, Rinku Singh, Ashok Sharma, Pat Cummins, Rasikh Dar, Shivam Mavi, Tim Southee, Umesh Yadav, Varun Chakaravarthy, Aman Khan, Andre Russell, Anukul Roy, Chamika Karunaratne, Mohammed Nabi, Ramesh Kumar, Sunil Narine, Venkatesh Iyer, Sam Billings, Sheldon Jackson.Rajasthan Royals squad for 2022 IPL: Sanju Samson, Jos Buttler, Yashasvi Jaiswal, Ravichandran Ashwin, Trent Boult, Shimron Hetmyer, Devdutt Padikkal, Prasidh Krishna, Yuzvendra Chahal, Riyan Parag, KC Cariappa, Navdeep Saini, Obed McCoy, Anunay Singh, Kuldeep Sen, Karun Nair, Dhruv Jurel, Tejas Baroka, Kuldip Yadav, Shubham Garhwal, James Neesham, Nathan Coulter-Nile, Rassie van der Dussen, Daryl Mitchell.Match starts at 7.30 pm IST.","content":null,"pubDate":"2022-05-01 08:35:16","full_description":"PTI Mumbai, May 1 Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Royals and snap their five-match losing streak in the IPL here on Monday. The form of Venkatesh Iyer, who is experiencing second season blues, has a lot to do with the changes KKR have been forced to make regularly at the top of the order. Venkatesh’s performances have been underwhelming to say the least after a season that helped him get into the Indian team. After his struggles at the top, the team tried him in the middle-order but that too did not work. The southpaw was back opening alongside Aaron Finch in the last game but runs deserted him again. Making the play-offs from here looks improbable for KKR who desperately need to find their best XI and stick with it for the remainder of the competition. “A lot of chopping and changing is happening, it’s been difficult to set up the right combination, with all injuries not helping as well. We need to stick together, play some fearless cricket, not be conservative with the bat. “Five more matches remaining, we need to play well, show belief and give something back to the team and the management, forget about the past, start fresh and back your instinct,” said skipper Shreyas Iyer after the last game. Shreyas has had a decent run as a batter with 290 runs at 36.25 but he has not got enough support from his teammates. In his first season as KKR captain, Shreyas has shown promise but needs to inspire his troops to script a turnaround. Alongside Venkatesh, the dismal run of another retained player Varun Chakaravarthy has hurt the team. However, the move to drop him in the previous game did not yield the desired results as KKR lost their fifth game in a row. The trio of Tim Southee, Umesh Yadav and Sunil Narine has been impressive and will be aiming to keep the in-form Jos Buttler quiet. Rajasthan rely a lot on Buttler and his 566 runs at 70.75 are a big reason why they find themselves in the top-four. As the Englishman can’t be expected to fire in every game, skipper Sanju Samson needs to step up and be more consistent. They are arguably the best bowling side in the competition but could not defend 159 in their previous game against Mumbai Indians due to heavy dew. With 19 wickets at 13.68, Yuzvendra Chahal leads the bowling charts this season and alongside R Ashwin, Trent Boult and Prasidh Krishna, the Rajasthan attack has the ability to defend even below-par totals. However, Royals will be looking for a much-improved batting effort to minimise the dew factor. Teams (from): Kolkata Knight Riders: Shreyas Iyer (captain), Aaron Finch, Abhijeet Tomar, Ajinkya Rahane, Baba Indrajith, Nitish Rana, Pratham Singh, Rinku Singh, Ashok Sharma, Pat Cummins, Rasikh Dar, Shivam Mavi, Tim Southee, Umesh Yadav, Varun Chakaravarthy, Aman Khan, Andre Russell, Anukul Roy, Chamika Karunaratne, Mohammed Nabi, Ramesh Kumar, Sunil Narine, Venkatesh Iyer, Sam Billings, Sheldon Jackson. Rajasthan Royals squad for 2022 IPL: Sanju Samson, Jos Buttler, Yashasvi Jaiswal, Ravichandran Ashwin, Trent Boult, Shimron Hetmyer, Devdutt Padikkal, Prasidh Krishna, Yuzvendra Chahal, Riyan Parag, KC Cariappa, Navdeep Saini, Obed McCoy, Anunay Singh, Kuldeep Sen, Karun Nair, Dhruv Jurel, Tejas Baroka, Kuldip Yadav, Shubham Garhwal, James Neesham, Nathan Coulter-Nile, Rassie van der Dussen, Daryl Mitchell. Match starts at 7.30 pm IST.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_621820059.JPG","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"}]}