{"newsArray":[{"title":"IPC ministry moves summary; Sethi set to return as PCB boss","link":"https://www.thenews.com.pk/print/1022180-ipc-ministry-moves-summary-sethi-set-to-return-as-pcb-boss","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Ministry of Inter-provincial Coordination has finally moved the summary, late Tuesday evening, to include two new Pakistan Cricket Board Governing Board members in place of existing one, for Prime Minister Shehbaz Sharif’s approval.Najam Sethi, who is all set to become new...","content":null,"pubDate":"2022-12-21 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"England complete historic series ‘sweep’ in Pakistan","link":"https://www.arabtimesonline.com/news/england-complete-historic-series-sweep-in-pakistan/","keywords":["Sports","cricket","England vs Pakistan"],"creator":["Arab Times"],"video_url":null,"description":"Relentless Poms power to eight-wicket win in final Test England’s players pose for photograph with the trophy after winning the third Test and series against Pakistan, in Karachi, Pakistan. (AP) KARACHI, Pakistan, Dec 20, (AP): Ben Stokes finished unbeaten as his relentless England lineup powered to an eight-wicket win in the third and final cricket … The post England complete historic series ‘sweep’ in Pakistan appeared first on ARAB TIMES - KUWAIT NEWS.","content":"This post has been read 699 times! KARACHI, Pakistan, Dec 20, (AP): Ben Stokes finished unbeaten as his relentless England lineup powered to an eight-wicket win in the third and final cricket Test on Tuesday to complete an historic series sweep in Pakistan. England started the day needing a further 55 runs for victory and reached 170-2 within 38 minutes to secure its second successive win with more than a day to spare in their first test tour to Pakistan in 17 years. It was Pakistan’s first ever 3-0 loss in a three-Test series on home soil. Pakistan fell for 216 against 18-year-old legspinner Rehan Ahmed (5-48) in the second innings, setting England a modest target of 167 for victory. Ben Duckett resumed Day 4 on 50 and remained unbeaten on 82 off 78 balls and skipper Stokes signed off his team’s dominant ‘Bazball’ brand of aggressive cricket by finishing 35 not out. “The commitment and mindset have been top drawer,” Stokes said. “It comes down to belief that I have and the 10 other guys. That resonates around everyone, the confidence everyone has has given me so much confidence in myself too.” Pakistan spinner Abrar Ahmed could have finished the series with 18 wickets in two test matches, but Agha Salman couldn’t hold onto a difficult chance from Stoke at longon with England just 19 runs away from a memorable win. “Definitely disappointment as a team, we are not good enough to fight back,” Pakistan captain Babar Azam said. “We were good in patches, but we lost back-to-back wickets in the first innings and that moment cost us.” England won the first Test on a fl at wicket in Rawalpindi by 74 runs in dimming light on the last day before recording a thrilling 26-run win at Multan on a slow turning track inside four days. Rehan Ahmed, on debut, conquered Pakistan’s batters in the team’s fortress – National Stadium – on Day 3 and England had motored to 112-2 in the final session through aggressive batting of Zak Crawley (41) and Duckett. “We’ve got a process we want to play but the challenge was the different pitches for every test,” Stokes said. “We stuck to our gameplans and adapted really well, particularly with the ball. Whoever I threw it to they seemed to deliver.” It was a just a third loss for Pakistan at the National Stadium in 45 Test matches and first in 15 years. England were the first team to beat Pakistan there in a Test match in 2000 before South Africa won a Test match here seven years later. The 3-0 drubbing was also Pakistan’s fourth successive test loss at home after Australia beat them in the final test earlier this year to win the two-Test series 1-0. Pakistan were kept at bay throughout the last three weeks and unable to find the right combination to counter England’s aggressive gameplan, which began at home this summer and now has seen them winning nine of the last 10 Test matches. England’s only loss in that period was against South Africa at Lord’s before the Proteas got beaten 2-1 in the series. England set the tone of a clean sweep in Pakistan when four of their batters smashed centuries on the opening day of the first Test and the visitors racked up world-record 506-4. Young Harry Brook filled perfectly in the shoes of injured Jonny Bairstow with three successive test centuries on tour and amassed 468 runs. “Every person has stood up at some point, but Harry Brook has been unbelievable for us,” Stokes said. “He’s set Pakistan on fire, the calmness and belief is high class.” Brook’s 111 at Karachi in the first innings fetched England a vital first innings lead of 50 runs before Pakistan capitulated against Ahmed’s legspin in the second innings. “Probably my best tour so far, to win 3-0 here, no-one’s done it before,” Brook said after being named both player of the match and player of the series. This post has been read 700 times! KUWAIT CITY, Nov 7: Friday Nov 6 marks … You must be to post a comment.","pubDate":"2022-12-20 19:25:38","image_url":null,"source_id":"arabtimesonline","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Rohit Sharma ruled out of India vs Bangladesh 2nd Test: Details","link":"https://www.thehansindia.com/sports/cricket/rohit-sharma-ruled-out-of-india-vs-bangladesh-2nd-test-details-774206","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India defeated Bangladesh by 188 runs in the 1st TestRohit Sharma is currently in MumbaiHe suffered a thumb injury during the 2nd ODI","content":"India captain Rohit Sharma has been ruled out of the second Test against Bangladesh after failing to recover from a thumb injury.In his absence, stand-in skipper KL Rahul will continue to lead in the second and final game, which is scheduled to begin on Thursday at the Shere Bangla National Stadium, Dhaka.Along with Rohit, fast bowler Navdeep Saini was also ruled out of the second Test owing to an abdominal muscle strain, the Board of Control for Cricket in India (BCCI) announced on Tuesday.The Indian skipper, who is currently in Mumbai, suffered an injury to his left thumb during the second One-Day International (ODI) between India and Bangladesh in Dhaka.\"The Medical Team is of the opinion that the injury needs some more time to heal completely before the Indian captain can bat and field with full intensity. He will continue his rehab and will not be available for the second and final Test against Bangladesh,\" read BCCI's statement.Saini, meanwhile, will now report to the National Cricket Academy (NCA) for further management of his injury, the statement further read.It is believed that Rohit would have managed to bat through the Test but concerns remained over the risk involved while fielding.Rohit last played in Tests during India's two-match series at home against Sri Lanka earlier this year in March. The Indian team won both games that were played in Mohali and Bengaluru. In the three innings he batted in, Rohit did not score a single half-century and managed 90 runs. India's updated squad for 2nd Test against Bangladesh: KL Rahul (c), Shubman Gill, Cheteshwar Pujara (vc), Virat Kohli, Shreyas Iyer, Rishabh Pant (wk), KS Bharat (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Shardul Thakur, Mohd. Siraj, Umesh Yadav, Abhimanyu Easwaran, Saurabh Kumar, Jaydev UnadkatIndia thrashed Bangladesh by 188 runs in the first Test last week in Chattogram. Kuldeep Yadav, who picked up eight wickets, was named the Player of the Match, while the likes of Cheteshwar Pujara and Shubman Gill scored a century each. The win marked KL Rahul's first victory as India's captain on his second attempt. He had previously led the team in the Johannesburg Test against South Africa earlier this year. India lost the match by seven wickets. The right-handed batter has also captained India in seven ODIs, of which India have won four - three against Zimbabwe and one against Bangladesh.Reflecting on his first Test win as captain, Rahul said that he was delighted to have a Test victory as India's captain.\"Feels good now that the game is over that I have a victory as a captain. I would have wanted my first game (as captain) to also start off with a win, but unfortunately, that didn't happen. Happy that we played good cricket. To get this win was really important for us. Like anyone else, the first victory is sweet and happy and hopefully, we can build on this. The focus will be on the next game now and trying to win the series,\" said Rahul in a video posted by BCCI TV.","pubDate":"2022-12-20 17:34:14","image_url":"https://assets.thehansindia.com/h-upload/2022/12/20/500x300_1326147-rohit-sharma.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"5th women’s T20: Australia crush India by 54 runs, clinch series","link":"https://telanganatoday.com/5th-womens-t20-australia-crush-india-by-54-runs-clinch-series","keywords":["News","Sport","Australia","India","Women's T20"],"creator":["PTI"],"video_url":null,"description":"Heather Graham became only the second woman cricketer from her country to take a T20 hat-trick","content":"Mumbai: Heather Graham became only the second woman cricketer from her country to take a T20 hat-trick as Australia crushed India by 54 runs in the final match to clinch the five-game series 4-1 here on Tuesday. Graham (4/8 from 2 overs) was the star performer with the ball for Australia as she first dismissed Devika Vaidya and Radha Yadav in the last two deliveries of the 13th over. She then returned in the final over of the innings to not only claim a hat-trick with the opening ball in the form of Renuka Singh but also picked up the prized scalp of Deepti Sharma (53 off 34) in the final delivery. Australian pacer Megan Schutt was the first woman from her country to claim a hat-trick in T20 cricket in 2018. Sent into bat, Asheigh Gardner (66 not out off 32) and Grace Harris (64 not out off 35) struck explosive unbeaten half-centuries to power Australia to an imposing 196 for four. The Indian bowlers cut a sorry figure after initial success as Gardner and Harris stitched an attacking unbeaten 129 off just 62 balls to fire Australia to their highest total of the series. The asking rate was too tall for India as they kept losing wickets at regular intervals to be bowled out for 142. India started their big chase with a bang with vice-captain Smriti Mandhana (4) pulling Darcie Brown across the square-leg boundary in the first delivery of the innings. But Mandhana’s stay was short-lived as two balls later she holed out to Grace Harris at forward square leg, looking to flick the ball. One-down Harleen Deol came all out attacking and struck a boundary through point and gully from her first ball of the innings. Shafali Verma (13) then got a reprieve in the third over when she was dropped by Harris at point after the batter miscued a shot. But it was not Shafali’s day as she was caught by Annabel Sutherland off the bowling of Gardner at long-on. Harleen Deol played a 16-ball 24-run cameo before becoming a victim of an unnecessary run out. Things turned bad to worse when skipper Harmanpreet Kaur departed. Introduced into the attack in the ninth over, Annabel Sutherland struck gold with her first delivery, trapping Harmanpreet infront of wicket as the batter failed to gauge the length of the delivery. Wicketkeeper-batter Richa Ghosh struck two boundaries before perishing and then Heather Graham dismissed Devika Vaidya and Radha Yadav in consecutive deliveries to be in the fray for a hat-trick, which she completed in the final over of the match. Earlier, Gardner remained unbeaten on 66 off 32 balls with the help of 11 boundaries and one six, while Harris made 64 not out of 35 balls during which she struck six fours and four hits over the fence. Electing to bowl, India started brightly, dismissing Beth Mooney (2) and Phoebe Litchfield (11) cheaply inside four overs. Thereafter, skipper Tahila McGrath (26 off 26) and Ellyse Perry (18 of 14) shared 38 runs for the third wicket to stabilise the innings. Just when the partnership was looking dangerous, Shafali Verma fooled McGrath with a tossed up delivery which spun just enough to beat the bat of an aggressive McGrath to be stumped by Richa Ghosh.","pubDate":"2022-12-20 17:27:43","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"David Warner Has No Plans To Retire From Test Cricket: Agent","link":"https://sports.ndtv.com/cricket/david-warner-has-no-plans-to-retire-from-test-cricket-agent-3624206","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"David Warner's agent, James Erskine, said he didn't believe the opener will quit Test cricket at the conclusion of the three-Test series against the Proteas at Sydney.","content":null,"pubDate":"2022-12-20 16:49:22","image_url":"https://c.ndtvimg.com/2022-12/aim8681g_david-warner-afp_625x300_03_December_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"England inflict first-ever 3-0 Test whitewash on Pakistan","link":"https://www.kuwaittimes.com/england-inflict-first-ever-3-0-test-whitewash-on-pakistan/","keywords":["Cricket","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"KARACHI: England beat Pakistan by eight wickets in the third and final Test in Karachi Tuesday to sweep the series 3-0 and hand the Pakistanis their first home whitewash. “It won’t really sink in until we get home or in the new year,” skipper Ben Stokes said after securing what was only England’s second series … The post England inflict first-ever 3-0 Test whitewash on Pakistan appeared first on Kuwait Times.","content":"KARACHI: England beat Pakistan by eight wickets in the third and final Test in Karachi Tuesday to sweep the series 3-0 and hand the Pakistanis their first home whitewash. “It won’t really sink in until we get home or in the new year,” skipper Ben Stokes said after securing what was only England’s second series whitewash in the subcontinent, following a similar result in Sri Lanka in 2018. Resuming on 112-2, England reached the modest 167-run target in just 38 minutes, with Ben Duckett and Stokes finishing unbeaten on 82 and 35 respectively. England won the first Test in Rawalpindi by 74 runs and the second in Multan by 26 runs. This was England’s first Test tour of Pakistan since 2005, having refused to tour the South Asian country in the years since because of security concerns. Duckett cracked his 12th boundary off fast bowler Mohammad Wasim to seal the victory on the fourth day, with England finishing on 170-2. Agha Salman dropped Stokes off spinner Abrar Ahmed on 22 and with just 19 needed for victory. With nine wins in their past 10 matches, England have vindicated their newly adopted freewheeling approach to Test cricket dubbed “Bazball”, after the nickname of coach Brendon McCullum. McCullum and Stokes took charge of a misfiring side in May that had won just one of their previous 17 Tests, including a 4-0 humiliation in the Ashes in Australia. England played power-packed cricket right from the start of the Pakistan tour, smashing 506-4 in Rawalpindi to set a record for the most team runs on the opening day of a Test. Four batters – Zak Crawley, Ollie Pope, Harry Brook and Duckett – scored hundreds that day, another record. Stokes was also bold in his captaincy, setting a tantalizing 343-run target for Pakistan in Rawalpindi and then setting unusual fields to get wickets. Stuck to the task Stokes praised England’s adaptability on slow pitches. “We’ve got a process we want to play but the challenge was the different pitches for every Test,” he said “I know it’s a cliched thing, but being out in the subcontinent is one of the hardest places to do it.” Stokes said his bowlers stuck to the task well. “We were particularly good with the ball,” he Stokes. “Whoever I threw it to they seemed to deliver. The commitment and mindset has been top drawer.” Stokes singled out Brook, the man of the match in Karachi and player of the series. “Every person has stood up at some point, but Brook has been unbelievable for us. He’s set Pakistan on fire, the calmness and belief is high class.” Brook finished with 468 runs that included three hundreds – the most in the series. Stokes also had warm words for leg-spinner Rehan Ahmed, who at 18 years and 128 days became England’s youngest Test player and then the youngest in the world to take five wickets on debut. “For an 18-year-old to come into his first Test match and have such a cricket-savvy brain – especially under Test-match pressure – was really good for us,” said Stokes. Pakistan’s Babar Azam said he has no intention of giving up the captaincy despite overseeing the whitewash. “Definitely, it’s a big disappointment as a team,” said Azam. “We are not good enough to fight back. We lost back-to-back wickets here, were good in patches only and that cost us.” Asked if he would quit the captaincy to concentrate on batting, Azam told a news conference he still enjoyed the challenge. “Captaincy is a matter of honor for me. I will do whatever best I can for my country and for myself,” he said. Pakistan’s problems were compounded by injuries to their fast bowlers, with Shaheen Shah Afridi ruled out before the series with a knee injury. Haris Rauf and Naseem Shah missed the last two Tests with fitness problems. But Pakistan suffered major batting collapses, losing their last six wickets for 108 in the first innings in Karachi and seven for 52 in the second. Tuesday’s defeat means it is also the first time Pakistan have lost four home Tests on the trot, having been beaten by Australia in Lahore in March. – AFP The post England inflict first-ever 3-0 Test whitewash on Pakistan appeared first on Kuwait Times.","pubDate":"2022-12-20 15:19:50","image_url":null,"source_id":"kuwaittimes","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"What Ronnie O’Sullivan said about the Sports Personality of the Year Awards in the past as snooker star is nominated in 2022","link":"https://talksport.com/sport/snooker/1282821/ronnie-osullivan-spoty-awards-2022-tyson-fury/","keywords":["Snooker","Sport"],"creator":["Karan Tejwani"],"video_url":null,"description":null,"content":"Ronnie O’Sullivan has been nominated for Sport’s Personality of the Year, but has been scathing about the awards in the past. The Rocket was nominated this year after winning his seventh world title in May, but he has previously said the award is a popularity contest with winners based on what sport they play. O’Sullivan won a seventh world title in May and is the greatest ever snooker playerGetty O’Sullivan has been nominated alongside footballer Beth Mead, England Test cricket captain Ben Stokes, gymnast Jessica Gadirova, athlete Jake Wightman and curling’s Eve Muirhead. O’Sullivan previously felt snooker wasn’t big enough to be nominated for the award, let alone have a winner, and that is why he didn’t agree with it. “You’re competing with Formula One, tennis, golf and the Olympics,” he said in 2016. “They give it like 10 seconds on BBC Sports Personality – it’s a complete insult to the sport [snooker]. But it’s what they think of it and what they believe it warrants, and that says it all really.” “I’m so happy I don’t get nominated because I never would want to go,” he claimed a year later. “It’s not my type of thing – standing around at some gathering. It’s not my scene and I really hope I never get nominated. “I won’t ever get that one. I don’t know why. I don’t think I’ll be in the hunt. I don’t think so. It’s not one I want to win. I’m not bothered about awards, trophies or accolades.” Steve Davis is the only snooker player to win the award and that was in 1998. O’Sullivan has been critical of the SPOTY awardsGetty Most read in Sport LOOKALIKE Boxer dressed as Muhammad Ali is floored as he suffers first defeat of career Awkward 'I feel like I haven’t earned this' - Jake Paul reluctantly accepts WBA title Friends 'Man's a p**** s***house' - Fury jokingly tells Joshua to 'sever ties' with his dad OUT COLD Boxing's KO saw former heavyweight-turned bouncer Francis floor aggressive punter WORRY Spence does not want to fight 44-year-old Pacquiao because of infamous Ali loss Spat Ex-Man United defender McGrath calls out McGregor for tweets mocking Irish comedian It took until 2020 for O’Sullivan to get his first nomination, but he failed to finish in the top three. “I can’t think of any other British sportsman that’s been as successful as I have,” he told Eurosport’s feature Seventh Heaven in October. “There probably is one but I can’t quite think of one. “Breaking the major record, 21 majors, equalling Stephen Hendry’s seven world titles, I think that resonates with people. I’ve been around a long time and the British public have supported me really, really well. “It would be nice [to win SPOTY] but obviously I understand that there are other sportspeople out there that maybe come ahead of me in the popularity stakes. It’s probably more of a popularity contest and what type of sport you play.” He is not the only British sporting great who has an issue with the awards. Tyson Fury famously threatened legal action against the BBC if he was nominated in 2021 – the year of his trilogy with Deontay Wilder. Fury is the WBC heavyweight world champion, but hates the SPOTY awardsGetty “It means nothing to me, and I don’t need it or want it,” Fury told The Daily Telegraph. “In fact, they will hear from my solicitors if they do put me on the list. Give it to someone who needs it. I don’t. “We know who the sports personality of the year is anyway – it’s me. “Who does what I do, goes through a war in Las Vegas, entertains the fans, and then sings to the audience?” talkSPORT BET OFFER OF THE DAY Get up to £25 in free bets + 25 free spins* – CLAIM HERE 18+ New customers only. Opt in, bet up to £25 (min. £10) on selected events at odds of 2.00+, in 7 days. Get up to £25 in free bets on selected events + 25 Free Spins on D10S Maradona slot. Bonuses expire in 7 days. Card payments only. T&Cs apply, see below. begambleaware.org | Please gamble responsibly SEE ALL FREE BETS HERE","pubDate":"2022-12-20 14:56:40","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Prem stars for Amberpet at HCA A3 Division League","link":"https://telanganatoday.com/prem-stars-for-amberpet-at-hca-a3-division-league","keywords":["News","Sport","HCA","HCA A3 division league","Hyderabad"],"creator":["Telangana Today"],"video_url":null,"description":"G Prem hit an unbeaten century while Hemanth scored half-century to guide SA Amberpet to a thumping 61-run win","content":"Home | Sport | Prem Stars For Amberpet At Hca A3 Division League Prem stars for Amberpet at HCA A3 Division League G Prem hit an unbeaten century while Hemanth scored half-century to guide SA Amberpet to a thumping 61-run win By Telangana Today Updated On - 07:52 PM, Tue - 20 December 22 Hyderabad: G Prem hit an unbeaten century (132 no) while Hemanth scored half-century (58) to guide SA Amberpet to a thumping 61-run win over Reliance in the HCA A-3 Division One Day League Championship held in Hyderabad on Tuesday. Reliance’s JA Prem’s 107-ball 111 went in vain. In another match, Rithik snared five for 21 while Sriman picked-up four for 14 as Safilguda defeated Adnan Cricket Club. Also Read Prem’s ton wins a thriller for SA Amberpet at HCA A3 division league Brief Scores: S A Amberpet 274/3 in 45 overs (G Prem 132no, Hemanth 58) bt Reliance 213 in 43.3 overs (J A Prem 111); Secunderabad Club 276/3 in 30 overs (C V Anand 101, Anuraag Haridas 84) bt Sagar CC 101 in 29.4 overs (M S Shravan 3/15); Safilguda 192/8 in 35 overs (Harshith 54; Tofique 3/23) bt Adnan CC 152 in 28.4 overs (Sriman 4/14, Ritik 5/21). Lal Bahadur PG 260/4 in 35 overs (Sai Pavan 57, Siddhartha 50, Nitin Nayak 101) bt Gagan Mahal 89 in 26.2 overs (Syed Muqeet 3/17, Hrishikesh 3/14). Top Performers Centurions: G Prem 132no, J A Prem 111, CV Anand 101, Nitin Nayak 101 Five or more wickets: Ritik 5/21 Follow Us : Tags HCA HCA A3 division league Hyderabad Related News Telangana men’s team crowned champions at Flag Football Championship Traffic restrictions at LB Stadium on Wednesday Hyderabad: Revision of fares of prepaid cabs operating at RGIA Hyderabad: Mild tension at a school in old city Hyderabad CP CV Anand launches new online system for issue of licenses EME Club emerge champions at Hyderabad Black Hawks Volleyball championship","pubDate":"2022-12-20 14:22:33","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy | Suryakumar Yadav smashes 80-ball 90 on First-Class return","link":"https://www.thehindu.com/sport/cricket/ranji-trophy-suryakumar-yadav-smashes-80-ball-90-on-first-class-return/article66285508.ece","keywords":null,"creator":["\n         PTI  \n    "],"video_url":null,"description":"Suryakumar Yadav, who has arguably been the best batter in white-ball cricket over the past 12 months, played his first Ranji Trophy game for Mumbai in almost three years","content":null,"pubDate":"2022-12-20 14:10:02","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"‘He had some character about him’ – Barry Hearn reveals he was dropped twice in sparring by Eddie Hearn when he was younger","link":"https://talksport.com/sport/boxing/1282594/barry-hearn-reveals-dropped-twice-sparring-eddie-hearn/","keywords":["Boxing","Sport"],"creator":["Cameron Temple"],"video_url":null,"description":null,"content":"Eddie and Barry Hearn have made quite the team in the business world, but back in the day they came to blows. Barry is the founder of Matchroom Sport that encompasses darts, fishing and snooker, among others, with their biggest sport being boxing, which is where Eddie takes over. Eddie Hearn took over the reigns at Matchroom Boxing from his father BarryGetty Images - Getty As a pair they have built a hugely successful empire in part due to the values that Barry instilled in Eddie as a youngster, one of those attributes being competitive nature. Barry recently appeared on the High Performance Podcast and he spoke about some of his parenting techniques with Eddie as a child. “We would play cricket and I wouldn’t hold back,” Barry revealed. “I was quite a quick bowler when I was younger and I bowled flat out to him, it didn’t matter what age he was. “If you want to be in this game, then find out. “When I thought he was going a little bit public school-ish, I took him down to the gym and we had what was supposed to be a proper three-round fight. Eddie may promote some of the biggest name boxers in the world, but if his spar with Barry is anything to go by, he can handle himself in the ring tooMark Robinson/Matchroom Most read in Boxing LOOKALIKE Boxer dressed as Muhammad Ali is floored as he suffers first defeat of career Awkward 'I feel like I haven’t earned this' - Jake Paul reluctantly accepts WBA title Friends 'Man's a p**** s***house' - Fury jokingly tells Joshua to 'sever ties' with his dad OUT COLD Boxing's KO saw former heavyweight-turned bouncer Francis floor aggressive punter WORRY Spence does not want to fight 44-year-old Pacquiao because of infamous Ali loss UPDATED Boxing schedule 2023: Results and dates including Tyson Fury and Anthony Joshua “He dropped me twice in the second round and we never had the third round. “But, I left happier than he did, because I found out something about my son that I hoped was inside him. “He didn’t swallow it, he had some character about him and he took a couple, not many, and he handed it out. It was nice. “He was just disappointed that he didn’t get the chance to go one extra round!” talkSPORT BET OFFER OF THE DAY Get up to £25 in free bets + 25 free spins* – CLAIM HERE 18+ New customers only. Opt in, bet up to £25 (min. £10) on selected events at odds of 2.00+, in 7 days. Get up to £25 in free bets on selected events + 25 Free Spins on D10S Maradona slot. Bonuses expire in 7 days. Card payments only. T&Cs apply, see below. begambleaware.org | Please gamble responsibly SEE ALL FREE BETS HERE","pubDate":"2022-12-20 13:52:11","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Ross Adair called up; Tucker and Tector franchise cricket deals","link":"https://www.cricketireland.ie/news/article/ross-adair-called-up-tucker-and-tector-franchise-cricket-deals","keywords":null,"creator":null,"video_url":null,"description":"DUBLIN – Northern Knights’ Ross Adair will join brother Mark in the Ireland Men’s squad that departs for Zimbabwe in early January, while Lorcan Tucker and Harry Tector have been granted permission by Cricket Ireland to play in T20 franchise tournaments.","content":null,"pubDate":"2022-12-20 13:49:04","image_url":null,"source_id":"cricketireland","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Suryakumar Yadav returns to first-class cricket with bang, smashes 80-ball 90 in Ranji Trophy match","link":"https://www.indiatvnews.com/sports/cricket/suryakumar-yadav-returns-to-first-class-cricket-with-bang-smashes-80-ball-90-in-ranji-trophy-match-2022-12-20-832766","keywords":null,"creator":null,"video_url":null,"description":"Suryakumar Yadav is currently playing for his team Mumbai in the Ranji Trophy and is performing amazingly. He smashed 90 runs in 80 deliveries in his first Ranji Trophy game in almost three years. He last played a first-class game way back in February 2020.","content":null,"pubDate":"2022-12-20 13:36:26","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Warner has no plans to retire from Test cricket, says his agent","link":"https://indianexpress.com/article/sports/cricket/warner-has-no-plans-to-retire-from-test-cricket-says-his-agent-8335220/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-12-20 13:10:13","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Rahane, Yashasvi slam centuries to power Mumbai to 457/3 on Day 1","link":"https://telanganatoday.com/ranji-trophy-rahane-yashasvi-slam-centuries-to-power-mumbai-to-457-3-on-day-1","keywords":["News","Sport","Ajinkya Rahane","Hyderabad","Mumbai","Ranji Trophy"],"creator":["Telangana Today"],"video_url":null,"description":"Skipper Ajinkya Rahane slammed unbeaten century while Yashasvi Jaiswal hit a ton to power Mumbai to 457/3 in 90 overs on the Day One","content":"Hyderabad: Skipper Ajinkya Rahane slammed unbeaten century (139 batting) and Yashasvi Jaiswal hit a ton (162) to power Mumbai to 457/3 in 90 overs on the Day One of the Group B Ranji Trophy match against Hyderabad at the Sharad Pawar Cricket Academy BKC, Mumbai on Tuesday. Asked to bat first, opener Prithvi Shaw was out for 19 in fourth over for Kartikeya Kak. For the second wicket Yashasvi and Suryakumar Yadav added a 153 runs partnership. Suryakumar’s 80-ball 90 knock comprised 15 fours and a six. Surya, who has arguably been the best batter in white-ball cricket over the past 12 months, approached the red ball game with the same aggressive intent that he is known for in the shorter formats. Jaiswal continued his rich vein of form with a sublime 162 off 95 balls. Rahane added a 206-run partnership with Yashasvi for the third wicket and added another unbeaten 75 for the fourth wicket with SN Khan (40 batting). Rahane’s century included 18 boundaries and two over them. For Hyderabad, Shashank M snared two wickets while Kartikeya Kak scalped one. Scores: Mumbai: Prithvi Shaw c †Prateek Reddy b Kartikeya Kak 19 (21b, 4×4), Yashasvi Jaiswal c Jaiswal b Shashank 162 (195b, 27×4, 1×6), Suryakumar Yadav lbw b Shashank 90 (80b, 15×4, 1×6), Ajinkya Rahane (c) batting 139 (190b, 18×4, 2×6), Sarfaraz Khan batting 40 (55b, 6×4), Extras: (lb 6, nb 1) 7; Total: (For 3 wkts in 90 overs) 457; Fall of wickets: 1-23, 2-176, 3-382; Bowling: Rakshan Readdi 12-0-60-0, Kartikeya Kak 13-1-70-1, Ravi Teja 15-3-59-0, Tanay Thyagarajan 28-1-139-0, Mehrotra Shashank 18-0-87-2, Rohit Rayudu 4-0-36-0","pubDate":"2022-12-20 13:03:38","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"David Warner has no plans to retire from Test cricket says his agent","link":"https://www.indiatvnews.com/sports/cricket/david-warner-has-no-plans-to-retire-from-test-cricket-says-his-agent-2022-12-20-832750","keywords":null,"creator":null,"video_url":null,"description":"David Warner has no plans to retire from Test cricket, his agent has said after former players from his country suggested that the Australia opener should consider retirement from the longest format of cricket.","content":null,"pubDate":"2022-12-20 12:52:18","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs ENG: आइसलैंड क्रिकेट ने पाकिस्तानी टीम का उड़ाया मजाक, कहा- हम 0.7 रन प्रति ओवर बनाएंगे, ना कि 7 रन प्रति ओवर","link":"https://www.abplive.com/sports/cricket/after-pakistan-defeat-against-england-iceland-cricket-trolled-babar-azam-team-by-tweet-goes-viral-on-social-media-2286859","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"PAK vs ENG 3rd Test: इंग्लैंड ने पाकिस्तान को तीसरे टेस्ट मैच में 8 विकेट से हरा दिया है. इस तरह इंग्लैंड ने टेस्ट सीरीज 3-0 से अपने नाम कर लिया. कराची टेस्ट में इंग्लैंड को मैच जीतने के लिए 170 रनों की दरकार थी. बेन स्टोक्स की टीम ने 2 विकेट पर लक्ष्य हासिल कर लिया. इस तरह पाकिस्तान टीम को घरेलू सरजमीं पर 3-0 से करारी हार का सामना करना पड़ा. वहीं, इंग्लैंड की पहली पारी में शानदार शतकीय पारी खेलने वाले हैरी ब्रूक को प्लेयर ऑफ द मैच चुना गया. बहरहाल, पाकिस्तान की हार के बाद ट्विटर आइसलैंड क्रिकेट का एक ट्वीट तेजी से वायरल हो रहा है. 'हम 0.7 रन प्रति ओवर बनाएंगे, ना कि 7 रन प्रति ओवर...' दरअसल, आइसलैंड क्रिकेट ने ट्विटर पर पाकिस्तान की हार का मजाक उड़ाया है. इस ट्वीट में लिखा है कि पाकिस्तान क्रिकेट बोर्ड के लिए मैसेज, हमारी टीम पाकिस्तान आकर 3-0 से हारने को तैयार हैं, हमें बुरी तरह पीटा जाए... और बता दें कि हम 0.7 रन प्रति ओवर बनाएंगे, ना कि 7 रन प्रति ओवर. बहरहाल, आइसलैंड क्रिकेट ने पाकिस्तान को जमकर ट्रोल किया है. सोशल मीडिया फैंस इंग्लैंड के खिलाफ पाकिस्तान की हार पर आइसलैंड क्रिकेट के ट्वीट पर लगातार मजे ले रहे हैं. इंग्लैंड के खिलाफ पाकिस्तान  की हार पर आइसलैंड क्रिकेट का यह ट्वीट खूब वायरल हो रहा है. Message to @TheRealPCB, we are happy to come and tour Pakistan and lose 3-0, getting chopped up and sugared like marmalade. Just letting you know in the interests of balance. And we will score at 0.7 not 7.0 an over. — Iceland Cricket (@icelandcricket) December 19, 2022 Of course, for our new fans, there was that one time in 2018 when we got a bit excited about making our Test debuts against Pakistan, only to find out that @ICC had said Ireland not Iceland. We were fully ready to begin our loss, scoring at 0.7 an over! pic.twitter.com/8nPqAVTtmO — Iceland Cricket (@icelandcricket) December 20, 2022 'हम हारने को पूरी तरह तैयार हैं...' इसके अलावा आइसलैंड क्रिकेट ने एक और ट्वीट किया है. दरअसल, इस ट्वीट में कहा है कि साल 2018 में एक वक्त था, जब हम पाकिस्तान के खिलाफ टेस्ट मैच खेलने को लेकर उत्साहित थे. वह हमारा डेब्यू टेस्ट मैच होता, लेकिन आईसीसी ने कहा कि आइसलैंड नहीं बल्कि आयरलैंड खेलेगा. हम हारने को पूरी तरह तैयार हैं. साथ ही हम 0.7 रन प्रति ओवर रन बनाएंगे. गौरतलब है कि इंग्लैंड ने कराची टेस्ट में पाकिस्तान को 8 विकेट से हरा दिया है. इस तरह बेन स्टोक्स की टीम ने 3 टेस्ट मैचों की सीरीज 3-0 से अपने नाम कर लिया. वहीं, इंग्लैंड के खिलाफ घरेलू सरजमीं पर शर्मनाक हार के बाद पाकिस्तान टीम को काफी फजीहत का सामना करना पड़ा रहा है. सोशल मीडिया फैंस बाबर आजम की टीम को जमकर ट्रोल कर रहे हैं. ये भी पढ़ें- IPL Auction 2023: दीपक चाहर हैं चोटिल, CSK की बढ़ सकती है समस्या, नीलामी में इन गेंदबाजों पर लगाएगी दांव IPL Auction: पिछले सीज़न से कितनी अलग है इस बार की नीलामी, जानिए क्या होंगे नियम और इस साल कौन है नीलामीकर्ता","content":null,"pubDate":"2022-12-20 12:19:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/20/ce1c1e0a9fd13f9822da27073b5dc56d1671538405760428_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-ICC rates Gabba pitch &#039;below average&#039; after two-day test","link":"https://www.thestar.com.my/sport/cricket/2022/12/20/cricket-icc-rates-gabba-pitch-039below-average039-after-two-day-test","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Brisbane's Gabba cricket ground has received one demerit point after the International Cricket Council (ICC) on Tuesday rated the pitch for the first test between Australia and South Africa - which ended in two days - \"below average\". Read full story","content":null,"pubDate":"2022-12-20 11:04:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/20/1870675.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Beth Mead, Ben Stokes among Sports Personality of the Year nominees","link":"https://www.sportsmole.co.uk/off-the-pitch/england-women/news/mead-stokes-among-sports-personality-of-the-year-nominees_502404.html","keywords":["Off The Pitch","Football","Cricket","Winter Sports","Snooker","Gymnastics","Athletics","England Women","Football","England","Great Britain","Beth Mead","Ben Stokes","Eve Muirhead","Ronnie O'Sullivan","Jessica Gadirova","Jake Wightman","Steve Cram","502404"],"creator":null,"video_url":null,"description":"England footballer Beth Mead and England cricket captain Ben Stokes are among the six nominees for the 2022 Sports Personality of the Year award.","content":null,"pubDate":"2022-12-20 10:30:10","image_url":"https://sm.imgix.net/22/28/beth-mead.jpg","source_id":"sportsmole","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"\"There's Maverick In It And Genius In A Lot Of It\": McCullum On Stokes","link":"https://sports.ndtv.com/cricket/stokesy-is-only-going-to-get-better-and-better-mccullum-3622470","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"The former New Zealand batter, credited with bringing about a radical change in England's approach to playing Test cricket, said the team has performed incredibly well to win the series in Pakistan.","content":null,"pubDate":"2022-12-20 10:26:56","image_url":"https://c.ndtvimg.com/2022-07/q09htrj_brendon-mccullum-ben-stokes-afp_625x300_22_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Injured cricket India captain Rohit Sharma ruled out of second test against Bangladesh","link":"https://www.livemint.com/sports/cricket-news/injured-cricket-india-captain-rohit-sharma-ruled-out-of-second-test-against-bangladesh-11671526916296.html","keywords":null,"creator":["Livemint"],"video_url":null,"description":"Fast bowler Navdeep Saini, too, has been ruled out of the second test against Bangladesh, India's cricket board said","content":null,"pubDate":"2022-12-20 09:11:52","image_url":"https://images.livemint.com/img/2022/12/20/1600x900/CRICKET-WC-2022-T20-IND-ZIM-39_1671527149899_1671527149899_1671527170163_1671527170163.jpg","source_id":"livemint","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: प्रेस कॉन्फ्रेंस में कप्तानी की ओलाचना को लेकर आया सवाल, बाबर आजम ने कुछ इस तरह दिया जवाब","link":"https://www.abplive.com/sports/cricket/babar-azam-reaction-to-criticism-on-his-captaincy-after-defeat-against-england-2286636","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"Babar Azam's Captaincy: बाबर आजम (Babar Azam) भले ही इस साल टेस्ट क्रिकेट में एक हजार रन पूरे कर चुके हैं लेकिन वह अपने उस रंग में नहीं है, जिसके लिए उन्हें जाना जाता है. इस साल उनकी कप्तानी को लेकर भी कई सवाल उठे हैं. पाकिस्तान के कई पूर्व क्रिकेटर्स यह तक कह चुके हैं कि बाबर को कप्तानी छोड़कर अपनी बल्लेबाजी पर फोकस करना चाहिए. इंग्लैंड के खिलाफ 0-3 से सीरीज गंवाने के बाद प्रेस कॉन्फ्रेंस में भी बाबर से उनकी कप्तानी की आलोचनाओं को लेकर सवाल पूछा गया, जिस पर उन्होंने विस्तार से जवाब दिया. एक रिपोर्टर ने बाबर से पूछा कि आपकी कप्तानी की बहुत आलोचना हो रही है तो क्या आपको नहीं लगता कि कप्तानी छोड़कर बल्लेबाजी पर ही फोकस करना चाहिए? इस पर बाबर ने कहा, 'मैं बल्लेबाजी के दौरान कप्तानी वाले दबाव को महसूस नहीं करता. बल्कि मैं इसे एंजॉय करता हूं.  और इससे (कप्तानी से) मेरी बल्लेबाजी बिल्कुल प्रभावित नहीं होती है. कप्तानी करना एक सम्मान की बात है. मैं हमेशा अपना सर्वश्रेष्ठ देने की कोशिश करता हूं. पहले पाकिस्तान बाकी सब चीजें बाद में.' Babar Azam responds to a question about his role as Test captain.#PAKvENG pic.twitter.com/PSSvOzqqLE — Grassroots Cricket (@grassrootscric) December 20, 2022 बल्लेबाजी और कप्तानी दोनों में फ्लॉप हो रहे बाबरइस साल पाकिस्तान को अपनी सरज़मीं पर ऑस्ट्रेलिया और इंग्लैंड के हाथों टेस्ट सीरीज गंवानी पड़ी है. इंग्लैंड के खिलाफ उसे टी20 सीरीज में भी हार झेलनी पड़ी थी. एशिया कप में हार और टी20 वर्ल्ड कप के शुरुआती मुकाबलों में टीम के खराब प्रदर्शन का ठिकरा भी बाबर की कप्तानी पर फोड़ा गया था. बाबर पिछले कुछ महीनों से बल्लेबाजी में भी फ्लॉप रहे हैं. ऐसे में उनकी कप्तानी की लगातार आलोचना हो रही है. यह भी पढ़ें... FIFA WC 2022: सऊदी अरब से हार और फिर नीदरलैंड्स और फ्रांस से जोरदार टक्कर, ऐसा रहा अर्जेंटीना के चैंपियन बनने का पूरा सफर","content":null,"pubDate":"2022-12-20 09:04:58","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/20/d02a3729ed1368bfaf194bc758f9630a1671526061449300_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-Removing fear of failure has helped England, says McCullum","link":"https://www.thestar.com.my/sport/cricket/2022/12/20/cricket-removing-fear-of-failure-has-helped-england-says-mccullum","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England head coach Brendon McCullum said removing the fear of failure has helped the talent in his team come through after they became the first test side to complete a 3-0 whitewash in Pakistan on Tuesday. Read full story","content":null,"pubDate":"2022-12-20 08:49:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/20/1870509.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-India captain Rohit to miss second test against Bangladesh","link":"https://www.thestar.com.my/sport/cricket/2022/12/20/cricket-india-captain-rohit-to-miss-second-test-against-bangladesh","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India's cricket board (BCCI) said on Tuesday that captain Rohit Sharma and fast bowler Navdeep Saini have been ruled out of the second and final test against Bangladesh. Read full story","content":null,"pubDate":"2022-12-20 08:35:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/20/1870443.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Stokes has 'special' belief in England team | 'There's no fear of failure'","link":"https://www.skysports.com/cricket/news/12040/12771784/england-captain-ben-stokes-says-he-has-special-belief-in-his-team-after-no-fear-cricket-earns-3-0-sweep-in-pakistan","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes spoke of the \"seriously special\" belief he has in his team after their fearless brand of cricket yielded a ninth win in 10 Tests since he became captain and a historic 3-0 sweep in Pakistan.","content":null,"pubDate":"2022-12-20 08:00:00","image_url":"https://e2.365dm.com/22/12/1920x1080/ben-stokes-test-cricket-karachi_6001899.jpg?20221220075004","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"WTC Points Table: पाकिस्तान की टीम वेस्टइंडीज से भी फिसड्‌डी, प्वाइंट टेबल में और लुढ़की","link":"https://hindi.news18.com/news/sports/cricket-wtc-points-table-australia-no-1-and-team-india-no-2-pakistan-slips-at-no-7-position-babar-azam-5082245.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"WTC Points Table: पाकिस्तान का (Pakistan Cricket Team) टेस्ट क्रिकेट में खराब प्रदर्शन जारी है. ऑस्ट्रेलिया से अंतिम टेस्ट हारने के बाद उसे इंग्लैंड से भी तीनों टेस्ट (PAK vs ENG) में हार मिली. इस कारण टीम को वर्ल्ड टेस्ट चैंपियनशिप में बड़ा नुकसान उठाना पड़ा है.","content":null,"pubDate":"2022-12-20 07:59:35","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/12/pakistan-16699880493x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"History is made by England – Pakistan suffer a whitewash defeat at home for the first time","link":"https://thenewsglory.com/history-is-made-by-england-pakistan-suffer-a-whitewash-defeat-at-home-for-the-first-time/","keywords":["Sports","eng vs pak","England","England made history","History","Pakistan","White wash"],"creator":["The News Glory"],"video_url":null,"description":"Karachi: Pakistan lost to England in the 3rd Test match held in Karachi. After that, England team led by Stokes defeated Pakistan 3-0 at home and won the Test series. England had already won the first two Tests of the three-Test series between Pakistan and England. In this case, the third Test match was held […]","content":"Karachi: Pakistan lost to England in the 3rd Test match held in Karachi. After that, England team led by Stokes defeated Pakistan 3-0 at home and won the Test series. England had already won the first two Tests of the three-Test series between Pakistan and England. In this case, the third Test match was held in Karachi. In this, the Pakistan team scored 304 runs in the first innings, while the England team scored 354 runs. Pakistan were bowled out for 216 runs in the 2nd innings. In this match, England’s 18-year-old leg-spinner Rehaan Ahmed took 5 wickets and became the youngest player to take 5 wickets on debut. England, who came into the field thinking that they would win if they scored 167 runs, came down to say that there is no old-style calmness and it is all about luck. The team, which was 112/2 in 17 overs yesterday, and after arriving this morning, Ben Stokes and Ben Duckett showed urgency to reach the target and completed the whitewash 3-0. Yesterday opener Jack Crawley smashed 41 runs off 41 balls with 7 fours and was left LP to leg spinner Abrar Ahmed. Then England dropped Rayhan Ahmed. He came down as soon as he arrived and revealed that he was also into the ‘baseball’ approach by hitting sixes. Rayhan Ahmed’s 10 runs off 8 balls with 2 fours didn’t last long. Abrar was bowled on the ball and got out. Ben Stokes and Ben Duckett complete the win today. Ben Stokes has won 9 of his last 10 Test matches under his captaincy. He is on his way to equaling Steve Waugh’s streak of Test wins. Australia can only check this Brendon McCullum / Ben Stokes action in the next Ashes series. England had won only 1 of 17 Tests before Ben Stokes became captain. The Stokes / McCullum partnership has brought about a paradigm shift, a change of mindset in England’s approach to cricket. Also, as it changes the course of Test cricket as a whole, other teams are forced to rethink themselves. England’s new approach has been nicknamed ‘Bazball’ in the cricketing world. That means Brendon McCullum’s nickname is ‘Baz’. The first casualty of this new approach was a 3-0 victory over New Zealand. Next, India scored 378 runs in the 4th innings in quick succession against England. Then South Africa won 2-1 and the same baseball wild durbar happened. Now Pakistan is completely trapped by England and fragmented.","pubDate":"2022-12-20 07:51:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Shock contenders to replace David Warner","link":"https://www.couriermail.com.au/sport/cricket/i-am-ready-contenders-primed-to-replace-david-warner-and-usman-khawaja-in-test-side/news-story/4ef8aedc6899c1a1ca6b3f785fd3e0b1","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"After more than half a decade of searching, Australia finally found an opening partner for David Warner earlier this year — albeit by accident.","content":"An untimely Covid-19 scare for Travis Head opened the door for Usman Khawaja to make his long-awaited return to Test cricket, and the Queenslander has been an absolute marvel in Australian whites ever since.Watch Australia v South Africa. Every test match live and ad-break in play on Kayo. New to Kayo? Start your free trial now >But all good things must come to an end.Warner and Khawaja are entering the twilight of their playing careers, both aged 36 and nearing retirement. Meanwhile, Warner’s recent form has sparked speculation he may not even board the plane to India next month.It’s almost a certainty Australia will begin hunting for a new opening partnership in the next 12 to 24 months — and there are already several candidates.“It’s good to see we’ve got a bit of depth in that area,” former Australian Test batter Michael Hussey told foxsports.com.au last month.“David Warner’s made it public that he might only play Test cricket for another 12 months, and obviously Usman Khawaja’s coming into the twilight of his career as well, so who knows how long he’ll want to keep playing for.“It’s going to be important to have a couple of really good players that have had some Test match experience to fill those two pairs of massive shoes.”MARCUS HARRISCurrently a member of the Australian Test squad, Harris is the undisputed next cab off the rank.The Victorian, who most recently represented Australia during last summer’s triumphant Ashes campaign, is coming off a successful 12 months in red-ball cricket.Harris accumulated 726 runs at 42.70 in nine first-class matches for Gloucestershire over the winter, including three centuries, and the opener’s fine form continued after returning home in September, scoring 288 runs in four Sheffield Shield matches at 41.14, headlined by a century against Western Australia in October.More recently, he smacked a classy 73 against the West Indies during the Prime Minister’s XI match at Canberra’s Manuka Oval.But critics will inevitably point towards Harris’ mediocre Test record and ask whether the 30-year-old deserves another chance. The left-hander has averaged 25.29 with the bat in 14 matches, statistically making him the second-worst Australian opener in Test history.However, countless Australian batters have dominated the Test arena after being axed and refining their craft at domestic level — Khawaja, Matthew Hayden and Steve Smith to name a few.MATTHEW RENSHAWAnother left-handed opener with international experience, Renshaw has been widely tipped for a return to the Test side in the near future.The Queenslander made his Test debut in November 2016 as a 20-year-old, scoring a maiden century against Pakistan at the SCG later that summer.But following a disappointing Test tour of Bangladesh in 2017, he was axed in favour of Cameron Bancroft.Renshaw took a break from cricket in early 2020 after being dropped from Queensland’s Sheffield Shield side, but has been one of the Bulls’ most prolific run-scorers since his return.The 26-year-old is averaging 51.66 in the Sheffield Shield this summer, scoring an unbeaten double-century against New South Wales in Sydney.Renshaw then turned heads during last month’s Prime Minister’s XI match against the West Indies in Canberra, smacking 81 and 101 not out against the pink Kookaburra.It’s also worth noting Renshaw has Test experience in the subcontinent, scoring two fifties against India in early 2017.“I am ready,” Renshaw told AAP when asked about the possibility of a Test re-call earlier this month.“The last few years I have definitely re-thought about how I go about my cricket.“The Aussie stuff is important but you can get caught up with your mindset and trying to play for that, rather than just playing for my team and doing well for Queensland.“That is the big learning I have had, along with enjoying my cricket. If (a Test recall) comes then it comes. It will take care of itself.”TRAVIS HEADHead has been a marvel in the Australian Test side this summer, winning back-to-back Player of the Match accolades for entertaining knocks in Adelaide and Brisbane.The left-hander currently averages 44.55 in the five-day format, accumulating more than 2000 Test runs since his debut in 2018.But despite his success at No. 5, Head has emerged as a surprise contender to replace Warner at the top of the order.News Corp reports that Head could be considered a like-for-like replacement for Warner if the veteran opener decides to hang up the boots before the Border-Gavaskar Trophy.Although this solution might seem outlandish at first glance, Head’s aggressive batting style undeniably mirrors that of Warner, while the middle-order vacancy would create room for another all-round option — perhaps Mitchell Marsh or Glenn Maxwell.And Head wouldn’t need to look far for inspiration — former national coach Justin Langer and Australian teammate Khawaja both started their Test careers in the middle order before flourishing as openers.But sceptics will pose an obvious retort: Why change a winning formula?“I don’t think Travis Head will open the batting for Australia in red-ball cricket,” former Australian all-rounder Simon O’Donnell told SEN Breakfast on Tuesday morning.“He’s found his slot, and he’s fantastic in it.”The South Australian has also been earmarked as Aaron Finch’s replacement in the ODI team, expected to open the batting for Australia at next year’s World Cup in India.CAMERON BANCROFTAnother forgotten Test opener, Bancroft was one of the countless cricketers Australia trialled at the top of the order alongside David Warner over the past decade.It was seemingly a match made in heaven when the duo scored an unbeaten 173-run opening partnership on Bancroft’s Test debut, but the Cape Town ball-tampering saga put both of their careers on pause.However, the West Australian was rushed back into the Test side ahead of the 2019 Ashes series following a prolific stint in the County Championship, but he was axed in favour of Marcus Harris ahead of the Headingley fixture.More than three years later, Bancroft is once again in contention for a Test recall following an impressive start to this summer’s Sheffield Shield, plundering 483 runs in six matches to become the tournament’s second-leading run-scorer.The 30-year-old is the only cricketer with three Sheffield Shield centuries this season, while nobody else in the competition has faced more than 1000 deliveries, highlighting his longevity at the crease.Fans will inevitably be divided on whether Bancroft deserves another opportunity at Test level, but national selectors would find it difficult to ignore him if he maintains this run of form.WILL PUCOVSKIThe one-Test wonder who can’t catch a break, Pucovski is at risk of becoming the forgotten man of Australian cricket.Once earmarked as a future great of the game, Pucovski’s career has been plagued by mental health and frustrating injury setbacks.The Victorian has suffered nearly a dozen concussion scares, one of which delayed his Test debut until January last year, where he scored an impressive half-century against India at the SCG.But a fielding mishap on the final day of the New Year’s Test sidelined the youngster for the series decider in Brisbane, opening the door for Marcus Harris’ return.An undeniable talent, Pucovski averages 48.97 at first-class level with six Sheffield Shield centuries to his name.The 24-year-old got his summer off a blistering start by cracking an unbeaten 193 in Victoria’s second XI pre-season fixture against New South Wales in Coffs Harbour, surviving 404 deliveries and 682 minutes at the crease.But he is currently taking a break from cricket, stepping away from the sport in October for personal reasons.Pucovski is still in Australia’s future Test plans, joining an eight-man squad of developing players sent to train at the MRF Academy in Chennai earlier this year.Hopefully the stars align and Pucovski gets another opportunity to prove his worth in Australian whites.HENRY HUNTHe may not be a household name, but Hunt has been turning heads in the Sheffield Shield over the past 24 months.The South Australian was the fourth-leading run-scorer in the Sheffield Shield last summer with 601 runs in eight matches, becoming the only cricketer to muster three centuries in the competition.Hunt boasts all the attributes of an old-fashioned opening batter — patience, discipline, technique and endurance.The 25-year-old pushed his Test credentials with a match-saving performance against Victoria in October, surviving 326 deliveries at the crease in the fourth innings to clinch a draw from the jaws of defeat.But he hasn’t been able to convert starts into big scores this summer, currently averaging 31.00 in the Sheffield Shield with two fifties in 10 knocks.Hunt won’t be on the plane to India next month, but he’s not far from earning a coveted baggy green.SAM WHITEMANAnother player who has been dominating in the Sheffield Shield circuit over the past 18 months, Whiteman is a smokey to earn a Test debut.The West Australian opener was the second-leading run-scorer in the Sheffield Shield last season, plundering 641 runs at 58.27 in seven matches.Whiteman has also enjoyed a successful start to his 2022/23 campaign, scoring 390 runs at 43.33 in six matches, including a classy century against South Australia in Perth last month.The 30-year-old was selected for Cricket Australia’s recent tour match against South Africa in Brisbane, but he struggled against the formidable Proteas attack, registering scores of 11 and 1.Whiteman’s glovework could also be considered a bonus — having a reserve wicketkeeper in the starting XI is always handy in case of injury.TEAGUE WYLLIERemember the name.Earlier this summer, the West Australian teenager became the Sheffield Shield’s youngest centurion since Ricky Ponting following a breakthrough knock against New South Wales.Playing in just his third first-class match, Wyllie scored 104 on a tricky WACA deck to become the first person born after 2003 to score a Sheffield Shield century, achieving the feat against a bowling attack featuring four Australian representatives.Speaking to the ICC earlier this year, Wyllie compared his batting style to that of Indian legend Rahul Dravid, who was renowned for his impenetrable defence.“I‘m a very stodgy kind of opener who just tries to bat the innings,” he explained.“I wouldn‘t say there’s one particular player that I’ve modelled my game on, but I consider myself to bat a little like Dravid. I like to bat long periods of time and not give my wicket my way.”Wyllie became the second youngest cricketer to win a Sheffield Shield final last summer, behind only Test captain Pat Cummins, helping Western Australia break its 23-year title drought.Speaking to CODE Sports in October, West Australian coach Adam Voges earmarked Wyllie as a young talent to keep an eye on this summer.“He’s quite a big guy, he’s got a physical presence when he’s at the crease,” he said.“Technically he’s really solid. He’s been an opening batter pretty much all of his career, so technically he’s sound.”ASHLEY CHANDRASINGHE Another batting prodigy who burst into the spotlight earlier this summer, Ashley Chandrasinghe compiled an old-fashioned century on Sheffield Shield debut in November, scoring an unbeaten 119 against Tasmania at Hobart’s Bellerive Oval.His 311-ball century was the second-slowest Sheffield Shield ton for a Victorian, narrowly behind Shawn Craig’s 316-ball ton against Tasmania in January 1999.Chandrasinghe modelled his batting technique off modern greats Michael Hussey and Kumar Sangakkara, and he undeniably boasts their temperament and patience when at the crease, making just one run from his first 49 balls against Tasmania.After he was dumped from the Victorian state pathways in 2019, Chandrasinghe decided to ply his trade in the Northern Territory; an unusual choice considering the federal territory doesn’t have a Sheffield Shield side.But he turned heads during the recent winter season by plundering five consecutive centuries for Waratah in the Darwin Premier competition, breaking the all-time record.“He’s just getting started,” Waratahs coach Udara Weerasinghe told NT News earlier this year.“He’s one of those players who knows where their off stump is.“Champions are made when nobody is watching, that’s my story for him.”Last month, Chandrasinghe combined with Will Pucovski for a 270-run opening partnership during Victoria’s second XI pre-season fixture against New South Wales in Coffs Harbour.“I think he has all the attributes, the personal qualities as well as the talent to go to the highest level,” Waratahs club president Simon Matthias told the News Corp publication.“He’s perfectly suited to four-day cricket, and that’s why I think he’s really got a strong future at first-class level.”","pubDate":"2022-12-20 07:24:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sustainable or fad? How Bazball will change Aussie cricket","link":"https://www.couriermail.com.au/sport/cricket/cricket-news-australia-assistant-coach-dan-vettori-talks-gabba-pitch-bazball/news-story/28bf15092846b371a497a8f216d2cae0","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian bowling coach Dan Vettori reckons if you thought the Gabba was the ultimate green monster you didn‘t spend Christmas in New Zealand 20 years ago.","content":"Former champion New Zealand spinner Vettori conceded bowlers had conditions well in their favour in the two-day Test between Australia and South Africa at the Gabba, but added “I think I’ve seen worse.’’“I played in two Test matches where I did not bowl a ball,’’ he said. “They just pop up from time to time. It is a challenge for a batting group every time.’’Those matches were consecutive Tests against India in 2002, in Wellington where the Kiwis (247 and 0-36) beat India (161 and 121) and then triumphed again in Hamilton where New Zealand (94 and 6-160) and beat India (99 and 154) by four wickets with Vettori a spectator in both games on grassy green decks.Like most bowlers who toiled for too many endless hours on unresponsive decks Vettori failed see a huge sense of injustice at the two days of batting carnage at the Gabba.“I just it was just really tough conditions and once in a while as a bowling group you don’t mind that.“Just because of the nature of how good those bowling attacks were they probably embellished it a bit. So you wouldn’t want to play on it every day but I think for occasional Test matches its not the worst thing.’’What did you think of The Gabba's two-day Test?“It was definitely amplified because of the standard of the bowling. People talk about these two attacks being potentially the best in the world. “And thewicket did a lot. But I think we saw through Travis Head’s innings, Steve Smith and (Kyle) Verreynne if you got in you could score on it.’’What do you think of 'Bazball?'Vettori is likely to be with the squad for next year’s Ashes when they take on his former Kiwi sipper Brendon McCullum as the coach who has revolutionised English cricket with their rampaging “Bazball’’ style of play.He has not been surprised by the cavalier approach but nor does he feel Australia necessarily have to change the tempo of their own game.“That’s just Brendan’s nature. There’s positivity in everything he does. To turn a team around purely by doing that is what he did with New Zealand when he was captain. For it to happen so quickly with England is incredible,” he said. “The key is to still have the ability to play your own style of cricket. Teams have been swept up. They put so much pressure on you through that scoring rate. The hardest thing to do is be able to sit back and say these guys are doing well. We have to give them respect. We can’t just go harder and harder.’’","pubDate":"2022-12-20 07:13:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Vettori stumped as Warner delivers wrong&#039;un with Bali joke","link":"https://www.thestar.com.my/sport/cricket/2022/12/20/cricket-vettori-stumped-as-warner-delivers-wrong039un-with-bali-joke","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - Australia opener David Warner may have lost form with the bat but showed on Tuesday his sense of humour remains intact as he sent officials scrambling with a social media post suggesting he was holidaying in Bali in the lead-up to the 'Boxing Day' test. Read full story","content":null,"pubDate":"2022-12-20 06:14:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/20/1870117.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-England complete historic whitewash in Pakistan","link":"https://www.thestar.com.my/sport/cricket/2022/12/20/cricket-england-win-third-test-by-eight-wickets-complete-clean-sweep-in-pakistan","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) -England's bold brand of cricket brought more accolades on Tuesday as they became the first test team to complete a 3-0 whitewash in Pakistan with their eight-wicket victory in the third and final match in Karachi. Read full story","content":null,"pubDate":"2022-12-20 05:51:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/20/1870091.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"}]}