{"newsArray":[{"title":"Making of a monster: Teenager Litchfield on her way to cricket superstardom","link":"https://www.brisbanetimes.com.au/sport/cricket/making-of-a-monster-the-australian-teen-on-her-way-to-cricket-superstardom-20230117-p5cd53.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Daniel Brettig"],"video_url":null,"description":"Look out world. Nineteen-year-old Phoebe Litchfield has built her power, learnt from superstar teammates and adapted skills from her youth to become a batting monster in the making.","content":null,"pubDate":"2023-01-17 04:56:07","image_url":null,"source_id":"brisbanetimes","country":["australia"],"category":["sports"],"language":"english"},{"title":"Women’s IPL T20 Cricket | Viacom 18 bought the broadcasting rights for Rs 951 crore","link":"https://thenewsglory.com/womens-ipl-t20-cricket-viacom-18-bought-the-broadcasting-rights-for-rs-951-crore/","keywords":["Sports","Cricket","game","India","Women","Women's IPL"],"creator":["The News Glory"],"video_url":null,"description":"New Delhi: The Board of Control for Cricket in India (BCCI) has announced that Viacom 18 has bid for the rights to broadcast the women’s IPL T20 cricket series for Rs 951 crore. BCCI to host IPL T20 cricket series for women for the first time. All the matches of this series will be played […]","content":"New Delhi: The Board of Control for Cricket in India (BCCI) has announced that Viacom 18 has bid for the rights to broadcast the women’s IPL T20 cricket series for Rs 951 crore. BCCI to host IPL T20 cricket series for women for the first time. All the matches of this series will be played in Mumbai with 5 teams participating. The details of the participating teams are expected to be announced later this month. Preparations are being made to hold the next tournament in the first week of March. In this case, the BCCI held the auction for the broadcasting rights of the women’s IPL T20 cricket series in Mumbai yesterday. Viacom 18, Disney Star and Sony participated in the auction. Viacom 18 bid for the TV and digital rights to telecast the matches for the next 5 years for Rs 951 crore. In this way, for a match in the women’s IPL T20 cricket series, Rs. 7.09 crores to BCCI, Viacom 18. In June last year, Viacom 18 acquired the digital rights of the men’s IPL T20 cricket series for Rs. 23,758 crore was bid for.","pubDate":"2023-01-17 03:32:18","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"U19 World Cup Cricket | Shabali Verma, Swetha in action Indian women’s team won","link":"https://thenewsglory.com/u19-world-cup-cricket-shabali-verma-swetha-in-action-indian-womens-team-won/","keywords":["Sports","game","India","U19 World Cup","U19 World Cup Cricket","women cricket","Women's cricket"],"creator":["The News Glory"],"video_url":null,"description":"Binoni: Shabali Verma and Shweta Sherawat led the Indian team to a 122-run win over the United Arab Emirates in the Women’s Under-19 T20 World Cup series. The Women’s Under-19 T20 Cricket World Cup Cricket Series is being held in South Africa. In this, the Indian team clashed with the United Arab Emirates yesterday. Batting […]","content":"Binoni: Shabali Verma and Shweta Sherawat led the Indian team to a 122-run win over the United Arab Emirates in the Women’s Under-19 T20 World Cup series. The Women’s Under-19 T20 Cricket World Cup Cricket Series is being held in South Africa. In this, the Indian team clashed with the United Arab Emirates yesterday. Batting first, the Indian team scored 219 runs for the loss of 3 wickets in 20 overs. Openers captain Shabali Verma scored 78 runs in 34 balls with 12 fours and 4 sixes and Shweta Sherawat scored 74 runs in 49 balls with 10 fours. The pair put on an impressive 111 for the first wicket in 8.3 overs. Richa Ghosh scored 49 runs off 29 balls with 2 sixes and 5 fours while Gongadi Trisha added 11 runs. Batting with a target of 220 runs, the UAE team managed to score only 97 runs for the loss of 5 wickets in 20 overs. Mahika Kaur scored 26, Lavanya Keni and Theertha added 16 runs. After winning by 122 runs, the Indian team is leading the table with 4 points in the ‘D’ category. In the first match, the Indian team won against the host South Africa by 7 wickets.","pubDate":"2023-01-17 03:32:18","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Bizarre Delivery In Cricket: शेल्डन कॉट्रेल की 'बवाल बॉल', बल्लेबाज ने खेलने के लिए लगाई दौड़... वीरेंद्र सहवाग ने भी पीट लिया सिर","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/video-virender-sehwag-surprise-reaction-on-sheldon-cottrell-bizarre-delivery-international-league-t20/articleshow/97045132.cms","keywords":null,"creator":null,"video_url":null,"description":"Sheldon Cottrell Bizarre Delivery in Desert Vipers vs Sharjah Warriors: भारतीय पूर्व क्रिकेटर वीरेंद्र सहवाग उस वक्त हैरान रह गए, जबकि शेल्डन कॉट्रेल ने इंटरनेशनल लीग टी-20 में गेंद क्रीज से करीब 6 फीट दूर फेंक दिया।","content":null,"pubDate":"2023-01-17 03:30:19","image_url":null,"source_id":"navbharattimes","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Gavaskar's verdict on Rohit, Kohli's T20I future amid BCCI's continuous silence - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiuwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zdW5pbC1nYXZhc2thci1naXZlcy12ZXJkaWN0LW9uLXZpcmF0LWtvaGxpLXJvaGl0LXNoYXJtYS1zLXQyMGktZnV0dXJlLWFtaWQtYmNjaS1zLXNpbGVuY2Utb3Zlci1hYnNlbmNlLWZyb20tbmV3LXplYWxhbmQtc2VyaWVzLTEwMTY3Mzg2MTA0ODg2MC5odG1s0gG_AWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9jcmlja2V0L3N1bmlsLWdhdmFza2FyLWdpdmVzLXZlcmRpY3Qtb24tdmlyYXQta29obGktcm9oaXQtc2hhcm1hLXMtdDIwaS1mdXR1cmUtYW1pZC1iY2NpLXMtc2lsZW5jZS1vdmVyLWFic2VuY2UtZnJvbS1uZXctemVhbGFuZC1zZXJpZXMtMTAxNjczODYxMDQ4ODYwLWFtcC5odG1s?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Gavaskar's verdict on Rohit, Kohli's T20I future amid BCCI's continuous silence  Hindustan TimesIndia Vs New Zealand: Schedule, Full Squads, Fixture, Timing, Streaming, And All You Need To Know | New Zealand Tour Of India 2023 | IND Vs NZ  ICC CRICKET SCHEDULEIND vs NZ 2023 ODI and T20I series: Full Schedule, Live Streaming, Full Squads, all you need to know about...  Zee NewsIndia vs New Zealand 2023: Confirmed Playing 11 for 1st ODI  AK4TSay1 Cricalytics\"That doesn't mean that they have moved on\"- Sunil Gavaskar explains why Rohit Sharma & Virat Kohli have been left out from NZ T20Is  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2023-01-17 01:50:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Rugby: Carlos Spencer’s teenage son Payton among new All Blacks Sevens signings","link":"https://www.newstalkzb.co.nz/news/sport/rugby-carlos-spencer-s-teenage-son-payton-among-new-all-blacks-sevens-signings/","keywords":null,"creator":null,"video_url":null,"description":"All Blacks great Carlos Spencer’s teenage son is among three new additions to the New Zealand Sevens side. Hamilton Boys’ High School’s Payton Spencer, Kelston Boys’ High School’s Xavier Tito-Harris and recent New Zealand debutant Tepaea Cook-Savage have signed two-year deals with the All Blacks Sevens. All Blacks Sevens head coach Clark Laidlaw said it’s great to have three young, but quality additions to the squad. “We are really excited about for the next couple of seasons, these three young players have lots of potential, it will be great to see them develop as rugby players but personally too on and off the field.” Spencer, a product from Hamilton Boys’ High School, has no shortage of talent. An exceptional fullback and cricketer in his own right, he has taken up the challenge of rugby sevens. Laidlaw said the 18 year-old has impressed coaches with his ability to learn the sevens format. “Obviously really good stock, coming from his dad Carlos Spencer. He is a great athlete, typical Hamilton Boys’ knows how to work hard, knows how to train really well and is a great product of their system. He has a good skill set, a beautiful passer, a big, tall rangy athlete. “He has not played a lot of sevens, he has played a lot of cricket over the summer and is outstanding. We are excited how quickly he can pick up the game, and his ability to play sevens. It has been great to see his skills develop during induction over the last couple of weeks,” said Laidlaw. Spencer said he was excited for the opportunity and is eager to learn from a group of talented individuals both on and off the field. “I haven’t played much sevens, mainly fifteens, but I am glad I have come to sevens, the boys and the culture is great. It hasn’t been easy; it hasn’t been that hard either, it is still rugby. Been a fullback in fifteens, mounts well shifting to sevens.” Looking ahead to the future, Spencer also has his sights set on the Olympics squad. “To go to the Olympics is my dream, which is the same for everyone playing in rugby sevens. It’s a huge sporting event,” said Spencer. Payton Spencer in action for Hamilton Boys' High School. Photo / Photosport After making his mark in rugby league, Tito-Harris has decided to focus on sevens. “Xavier has played a lot of rugby league and has had some good opportunities to pursue the sport but has instead chosen to come to here and start his professional career with the sevens for the next couple of seasons,” Laidlaw said. “He is skilful has x-factor on the ball and is an attacking threat. I am looking forward to seeing him mature and develop as a rugby sevens player, he has just turned 18 in camp the other week, which was cool to celebrate with the team.” Tito-Harris said he was excited for the opportunity and is ready to make his mark in the All Blacks Sevens environment. “I have mostly played rugby league, then played sevens through school. I played at the World Schools Sevens tournament and that is where Clark picked me up. It wasn’t an easy decision to sign on, but the culture of the team and the boys was what convinced me.” “I’m definitely enjoying it, there is a lot more running, but getting plenty of help from the boys. One of my biggest goals coming into this team, is setting my sights on the Olympics in Paris in 2024.” Tepaea Cook-Savage also signed on with the All Blacks Sevens at the end of last year, following his debut in Cape Town. “He has played a bit of sevens, with Waikato, in the National Sevens and for their NPC side. He is a little bit more mature than Spencer and Tito-Harris but is an outstanding young professional and we have been blown away with his diligence and ability to pick up information quickly. This has been demonstrated already when he played in Cape Town, he never really looked out of place. We have high hopes with him coming into our outside backs and looking forward to seeing what he will achieve,” said Laidlaw. The 21-year old said he is grateful for the knowledge and experience he has had thus far. “It has been an awesome couple of months. Debuting in Cape Town was unreal. I’m grateful to be able to go to work alongside so many talented and experienced players. I’m always learning and the experience I have already gained from playing in Cape Town has been invaluable. I am looking forward to the 2023 season.” The All Black Sevens will compete at the New Zealand Sevens in Hamilton this weekend.","content":"All Blacks great Carlos Spencer’s teenage son is among three new additions to the New Zealand Sevens side. Hamilton Boys’ High School’s Payton Spencer, Kelston Boys’ High School’s Xavier Tito-Harris and recent New Zealand debutant Tepaea Cook-Savage have signed two-year deals with the All Blacks Sevens. All Blacks Sevens head coach Clark Laidlaw said it’s great to have three young, but quality additions to the squad. “We are really excited about for the next couple of seasons, these three young players have lots of potential, it will be great to see them develop as rugby players but personally too on and off the field.” Spencer, a product from Hamilton Boys’ High School, has no shortage of talent. An exceptional fullback and cricketer in his own right, he has taken up the challenge of rugby sevens. Laidlaw said the 18 year-old has impressed coaches with his ability to learn the sevens format. “Obviously really good stock, coming from his dad Carlos Spencer. He is a great athlete, typical Hamilton Boys’ knows how to work hard, knows how to train really well and is a great product of their system. He has a good skill set, a beautiful passer, a big, tall rangy athlete. “He has not played a lot of sevens, he has played a lot of cricket over the summer and is outstanding. We are excited how quickly he can pick up the game, and his ability to play sevens. It has been great to see his skills develop during induction over the last couple of weeks,” said Laidlaw. Spencer said he was excited for the opportunity and is eager to learn from a group of talented individuals both on and off the field. “I haven’t played much sevens, mainly fifteens, but I am glad I have come to sevens, the boys and the culture is great. It hasn’t been easy; it hasn’t been that hard either, it is still rugby. Been a fullback in fifteens, mounts well shifting to sevens.” Looking ahead to the future, Spencer also has his sights set on the Olympics squad. “To go to the Olympics is my dream, which is the same for everyone playing in rugby sevens. It’s a huge sporting event,” said Spencer. After making his mark in rugby league, Tito-Harris has decided to focus on sevens. “Xavier has played a lot of rugby league and has had some good opportunities to pursue the sport but has instead chosen to come to here and start his professional career with the sevens for the next couple of seasons,” Laidlaw said. “He is skilful has x-factor on the ball and is an attacking threat. I am looking forward to seeing him mature and develop as a rugby sevens player, he has just turned 18 in camp the other week, which was cool to celebrate with the team.” Tito-Harris said he was excited for the opportunity and is ready to make his mark in the All Blacks Sevens environment. “I have mostly played rugby league, then played sevens through school. I played at the World Schools Sevens tournament and that is where Clark picked me up. It wasn’t an easy decision to sign on, but the culture of the team and the boys was what convinced me.” “I’m definitely enjoying it, there is a lot more running, but getting plenty of help from the boys. One of my biggest goals coming into this team, is setting my sights on the Olympics in Paris in 2024.” Tepaea Cook-Savage also signed on with the All Blacks Sevens at the end of last year, following his debut in Cape Town. “He has played a bit of sevens, with Waikato, in the National Sevens and for their NPC side. He is a little bit more mature than Spencer and Tito-Harris but is an outstanding young professional and we have been blown away with his diligence and ability to pick up information quickly. This has been demonstrated already when he played in Cape Town, he never really looked out of place. We have high hopes with him coming into our outside backs and looking forward to seeing what he will achieve,” said Laidlaw. The 21-year old said he is grateful for the knowledge and experience he has had thus far. “It has been an awesome couple of months. Debuting in Cape Town was unreal. I’m grateful to be able to go to work alongside so many talented and experienced players. I’m always learning and the experience I have already gained from playing in Cape Town has been invaluable. I am looking forward to the 2023 season.” The All Black Sevens will compete at the New Zealand Sevens in Hamilton this weekend.","pubDate":"2023-01-16 22:31:59","image_url":"https://www.newstalkzb.co.nz/media/1r0mkvb2/payton-spencer-in-action-for-the-new-zealand-schools-side-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Women’s Indian Premier League agrees £95m broadcast rights deal - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIzL2phbi8xNi93b21lbnMtaW5kaWFuLXByZW1pZXItbGVhZ3VlLWFncmVlcy05NW0tYnJvYWRjYXN0LXJpZ2h0cy1kZWFsLWNyaWNrZXTSAXNodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vc3BvcnQvMjAyMy9qYW4vMTYvd29tZW5zLWluZGlhbi1wcmVtaWVyLWxlYWd1ZS1hZ3JlZXMtOTVtLWJyb2FkY2FzdC1yaWdodHMtZGVhbC1jcmlja2V0?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Women’s Indian Premier League agrees £95m broadcast rights deal  The GuardianViacom18 bags WIPL media rights for 2023-27 cycle | Cricbuzz.com - Cricbuzz  CricbuzzWomen’s IPL media rights: A game well begun  Exchange4MediaWIPL: ₹950 crore bonanza for women’s cricket  Hindustan TimesWomen's IPL: Viacom 18 wins media rights, to pay INR 7.09 crore per match  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2023-01-16 21:52:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka team manager asked to submit report on record defeat against India","link":"https://kashmirreader.com/2023/01/17/sri-lanka-team-manager-asked-to-submit-report-on-record-defeat-against-india/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"COLOMBO: Sri Lanka Cricket (SLC) has given the manager of the team touring India five days to submit his report on the world record defeat at the hands of Rohit Sharma’s side in the third and final ODI at Thiruvananthapuram. India annihilated a clueless Sri Lanka by a record 317 runs to sweep the three-match […]","content":"COLOMBO: Sri Lanka Cricket (SLC) has given the manager of the team touring India five days to submit his report on the world record defeat at the hands of Rohit Sharma’s side in the third and final ODI at Thiruvananthapuram. India annihilated a clueless Sri Lanka by a record 317 runs to sweep the three-match series on Sunday. Shubman Gill scored a century to complement Virat Kohli’s unbeaten 166 as the duo helped the hosts to a massive 390 for 5 in 50 overs. Sri Lanka were then dismissed for 73 in 22 overs, with Mohammed Siraj taking four wickets. A day after the humiliating defeat, SLC asked the team manager to submit his report, and told him to incorporate the views of skipper Dasun Shanaka and head coach Chris Silverwood, among others. “Sri Lanka Cricket (SLC) has directed the Manager of the National Team to submit a report pertaining to Sri Lanka’s heavy defeat faced against India in the 3rd ODI, which was played on the 15th January 2023 at Thiruvananthapuram,” said a statement issued by SLC on Monday. “The report should consist of views of the Captain, the Head Coach, and the selection panel and also the team manager pertaining to the loss,” added the statement. The statement added that the report would help SLC “understand the background” for the team’s poor performance. “SLC has requested the Team Manager to submit the ‘Report’, within a 5-day period. The report will enable Sri Lanka Cricket to review and understand the background to the team’s dismal performances during the final ODI, which it lost by 317 runs after being bowled out in 22 overs,” added the statement. In November last year, a five-member panel had been constituted to find out the reason for Sri Lanka’s dismal performance in the T20 World Cup in Australia. The panel did not find any conclusive evidence to suggest that the debacle had to do with the selection process being influenced by the cult group ‘Born Again’. —Agencies     Press Trust of Indiakashmirreader.com","pubDate":"2023-01-16 20:17:25","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"See you on the field soon: Rishabh Pant tweets on recovering from accident","link":"https://thenewsglory.com/see-you-on-the-field-soon-rishabh-pant-tweets-on-recovering-from-accident/","keywords":["Sports","Cricket","game","Hope","India","Rishabh Pant"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: Cricketer Rishabh Pant, who is recovering from an accident, tweeted that they will meet soon on the field. These hopeful words of his are meant to comfort his fans and cricket enthusiasts. On December 30, 2022, Rishabh Pant was traveling alone in a car on the Delhi-Dehradun National Highway when he hit a barricade […]","content":"Mumbai: Cricketer Rishabh Pant, who is recovering from an accident, tweeted that they will meet soon on the field. These hopeful words of his are meant to comfort his fans and cricket enthusiasts. On December 30, 2022, Rishabh Pant was traveling alone in a car on the Delhi-Dehradun National Highway when he hit a barricade in the middle of the road and met with an accident. The accident took place near Roorkee. As the car was on fire, he was trapped in it and was rescued by passers-by immediately. He was later admitted to the hospital for treatment. In this accident, he sustained two cuts on his forehead. Torn ligament in right knee. His right wrist, ankle and toe were also injured. Abrasion injuries were sustained on the back. He was initially treated at a private hospital in Dehradun and was admitted to Mumbai’s Kokilapen Dhirubhai Ambani Hospital and Medical Research Institute a few weeks ago for treatment. He was told that he would undergo surgery on the joint. “I am grateful for your support during this time. I would like to inform you that my surgery has been completed successfully. I am starting my recovery journey from injury. I am ready to face the challenges ahead of me. Thanks Govt and BCCI. At this time I would like to express my heartfelt thanks to all of you fans, teammates, doctors and physios for your kind words and encouragement. See you soon on the field,” Pant tweeted. \r From the bottom of my heart, I would also like to thank all my fans, teammates, doctors and the physios for your kind words and encouragement. Looking forward to see you all on the field. #grateful #blessed","pubDate":"2023-01-16 19:47:39","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"News24.com | Langeveldt to leave Proteas men's team while Maketa's future to be debated","link":"https://www.news24.com/sport/Cricket/Proteas/langeveldt-to-leave-proteas-mens-team-while-maketas-future-to-be-debated-20230116","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa's director of cricket Enoch Nkwe confirmed that bowling coach Charl Langeveldt would not be part of the new Proteas men's team coaching dispensation.","content":"Cricket South Africa's director of cricket Enoch Nkwe confirmed that bowling coach Charl Langeveldt would not be part of the new Proteas men's team coaching dispensation. Langeveldt, who represented the Proteas in six Tests, 72 ODIs, and nine T20s, joined the men's national team coaching roster in December 2019 under Mark Boucher. The bowling group has steadily grown in leaps and bounds under his tutelage, but most coaching appointments generally come with internal personnel changes. READ | Proteas to rely on another interim coach for crucial England series, Walter to have selection say CSA formally announced the appointments of Shukri Conrad and Rob Walter as the red and white ball coaches, respectively, on Monday. Nkwe said Langeveldt, who will join the Punjab Kings as their bowling coach, has been an excellent acquisition for the men's team, but they also respect his decision to move on. \"Someone like Charl Langeveldt has already indicated that he's going to be moving on. He's been in the international space for the past four years, but he's not necessarily lost to the system,\" Nkwe said \"He's looking at other opportunities because it is very hard for other coaches to sustain their well-being over a four to eight-year period. \"We respect his decision, and he's got an opportunity now with the Indian Premier League, but we'll also look at ways of how he can add value to the system in a different role. The appointments of Conrad and Walter also left a question mark with regards to Malibongwe Maketa, the former Warriors coach who lent a helping hand with the men's Test side in Australia. Maketa, who was Otis Gibson's assistant from 2017 until 2019, had stated his intentions of being the national team coach. He was also on the shortlist but didn’t make the final cut, with Nkwe saying they'll be meeting with him later this week to discuss his future. READ | Shukri Conrad, Rob Walter unveiled as new Proteas coaches \"We are in a process and we're drafting clearer plans for him. We will be meeting him this week with Vincent Barnes,\" Nkwe said. \"It's not just about the work in the high-performance environment, we also need to be realistic in terms of the plans for him for the next two years. \"He has played a huge role in our system, so he brings a lot of value, and we mustn't forget that. We need to look at how he fits into the picture strategically over the next five years.\"","pubDate":"2023-01-16 19:44:56","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"India-Sri Lanka ODI: Citing high levy, ‘poor’ Kerala cricket fans boycott the match","link":"https://www.thehindubusinessline.com/news/sports/india-sri-lanka-odi-poor-kerala-cricket-fans-boycott-match-citing-high-levy/article66382623.ece","keywords":null,"creator":["\n        BL Thiruvananthapuram  Bureau  \n    "],"video_url":null,"description":"The State Minister’s remark that ‘let-them-eat-cake’ stance added fire to the fuel","content":"By BL Thiruvananthapuram Bureau Desolate cricket fans points to Kerala Sports Minister V Abdurahiman’s ‘let-them-eat-cake’ stance denying them a sumptuous run feast offered by Virat Kohli and Subhuman Gill in India’s famous victory over Sri Lanka in the third and final one-dayer here on Sunday. The Greenfield Stadium was a mutate spectator to the controversy raging in the lead-up up to the match, blamed on ‘insensitive comments’ made by the minister in response to fan’s ire over a higher entertainment tax levy. It had been jacked up from five per cent to 12 per cent leaving the tickets beyond the reach of those with meagre resources, Akhil, anardent fan said. Abdurahiman suggested those who cannot afford need not watch the match. Where is the need for reducing the tax, he wondered. Irate fans ran a ‘boycott cricket’ campaign protesting high ticket prices. There were only 16,000 spectators on Sunday out of the 45,000-capacity stadium, with 10,000 being the complimentary passes. Akhil was one of them. Shashi Tharoor, Congress MP from Thiruvananthapuram, an avid cricket fan himself and who watched the match, chose to strike a neutral stance saying irrespective of what the Sports Minister had said, people should not have avoided the match. “People not turning up was a loss. It was not a loss for the minister. He got some headlines. It was a loss to cricket and to those who love the sport,” he said. Tharoor said the minister could have avoided saying what he said and the public ought to have not boycotted the match. “I saw some campaigns on social media calling for a boycott of the match. It appears their campaign was effective. I think it was illogical to boycott it. I was fortunate to watch the match, and so were those who came here,” the Congress MP said. Leader of Opposition in the State Assembly VD Satheesan faulted the minister for precipitating the issue. He should not have tested people’s self-esteem. But MV Govindan, CPI(M) State secretary, sought to tone down the heat saying the minister meant only to say that those who are poor may not be able to watch the match. It was the media who blew this out of proportion. Hosts Kerala Cricket Association said the low turnout may be due to the ongoing Sabarimala season, the Pongal festival and CBSE exams scheduled onMonday. Another reason could be that the last cricket match held here was three months back, and many would have opted to watch from the confines of home. With India already winning the series could be the reason for a low ticket sales, said Thiruvananthapuram Corporation Mayor Arya Rajendran It is likely that some of the fans gave it a miss since it was an ODI and not a 20-20 fixture. She did not think increase in entertainment tax was the main reason for the empty gallery. The tax rate was finalised after discussions with the State government and the Kerala Cricket Association.","pubDate":"2023-01-16 19:29:56","image_url":null,"source_id":"thehindubusinessline","country":["india"],"category":["sports"],"language":"english"},{"title":"Will Kohli break Sachin’s record of 100 centuries? – Answer by Sunil Gavaskar","link":"https://thenewsglory.com/will-kohli-break-sachins-record-of-100-centuries-answer-by-sunil-gavaskar/","keywords":["Sports","100 cents","Hundred Centuries","India","sachin tendulkar","Sunil Gavaskar","Virat Kohli"],"creator":["The News Glory"],"video_url":null,"description":"Mumbai: Sunil Gavaskar was asked whether another Indian cricketer, Virat Kohli, will beat former Indian cricketer Sachin Tendulkar’s record of 100 centuries. He has given his answer. Virat Kohli was unable to score a century for about a thousand days in international cricket. But in recent days he has registered 3 hundreds in a span […]","content":"Mumbai: Sunil Gavaskar was asked whether another Indian cricketer, Virat Kohli, will beat former Indian cricketer Sachin Tendulkar’s record of 100 centuries. He has given his answer. Virat Kohli was unable to score a century for about a thousand days in international cricket. But in recent days he has registered 3 hundreds in a span of just 30 days. He has scored 3 centuries in his last 4 ODIs.","pubDate":"2023-01-16 18:46:44","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa announce appointment of new men's team head coaches - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzMwMjQ4ODPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South Africa announce appointment of new men's team head coaches  ICC CricketLangeveldt departure dampens Conrad, Walter arrival | Cricbuzz.com - Cricbuzz  CricbuzzFocus on 2027 ODI WC and No. 1 Test spot as Conrad and Walter take charge of South Africa  ESPNcricinfoSouthAfrica Cricket Coach: CSA appoints Rob Walter & Shukri Conrad as new coaches as Mark Boucher replacements, Check Details  InsideSportSouth Africa names new coaches for Test, limited-overs cricket teams  SportstarView Full coverage on Google News","content":null,"pubDate":"2023-01-16 18:35:33","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: Kolisi’s special speech to cricket counterparts","link":"https://www.thesouthafrican.com/sport/watch-siya-kolisi-special-speech-cricket-counterparts-breaking-16-january-2023/","keywords":["Sport","Featured","Siya Kolisi"],"creator":["Craig Lewis"],"video_url":null,"description":"Springbok captain Siya Kolisi made his presence felt at a SA20 cricket match on Sunday, including offering a special speech.","content":"Springbok captain Siya Kolisi made his presence felt at a SA20 cricket match on Sunday, including offering a special speech.","pubDate":"2023-01-16 17:10:33","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","country":["south africa"],"category":["sports"],"language":"english"},{"title":"New storm in Pakistan cricket! Babar Azam's private, intimate videos allegedly get leaked; fans react - Times Now","link":"https://news.google.com/__i/rss/rd/articles/CBMingFodHRwczovL3d3dy50aW1lc25vd25ld3MuY29tL3Nwb3J0cy9jcmlja2V0L25ldy1zdG9ybS1pbi1wYWtpc3Rhbi1jcmlja2V0LWJhYmFyLWF6YW1zLXByaXZhdGUtaW50aW1hdGUtdmlkZW9zLWFsbGVnZWRseS1nZXQtbGVha2VkLWZhbnMtcmVhY3QtYXJ0aWNsZS05NzAzNjY3M9IBogFodHRwczovL3d3dy50aW1lc25vd25ld3MuY29tL3Nwb3J0cy9jcmlja2V0L25ldy1zdG9ybS1pbi1wYWtpc3Rhbi1jcmlja2V0LWJhYmFyLWF6YW1zLXByaXZhdGUtaW50aW1hdGUtdmlkZW9zLWFsbGVnZWRseS1nZXQtbGVha2VkLWZhbnMtcmVhY3QtYXJ0aWNsZS05NzAzNjY3My9hbXA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"New storm in Pakistan cricket! Babar Azam's private, intimate videos allegedly get leaked; fans react  Times NowPak Sexting Scandal: Babar Azam's private videos leaked, internet stunned | Details  Hindustan Times“Aur isko Kohli banna hai…” Twitterati roast Babar Azam after his private videos, intimate chats allegedly surface online  Circle of Cricket\"Another Attempt For Defamation\": Twitter Reacts After Babar Azam Is Caught In A Honey Trap, Sexting Video Goes Viral  Cricket Addictor'Aur isko Kohli banna hai': Babar Azam's intimate videos, chats allegedly leak  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2023-01-16 16:15:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Viacom18 secures women’s IPL media rights for <span class='webrupee'>₹</span>951 cr","link":"https://www.livemint.com/news/india/viacom18-secures-women-s-ipl-media-rights-for-951-cr-11673885289155.html","keywords":null,"creator":["Varuni Khosla"],"video_url":null,"description":"The Reliance Industries Ltd-controlled-broadcaster will pay a per-match fee of ₹7.09 crore for the five-year duration of the rights for the women’s T20 cricket league","content":null,"pubDate":"2023-01-16 16:11:06","image_url":"https://images.livemint.com/img/2023/01/16/1600x900/WIPL-will-have-five-teams-and-22-matches-in-the-fi_1673180799746_1673885390354_1673885390354.jpg","source_id":"livemint","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's U-19 T20 World Cup | Shafali Verma, Shweta Sehrawat lead India crush UAE, team continue to rise","link":"https://www.indiatvnews.com/sports/cricket/womens-u-19-t20-world-cup-shafali-verma-shweta-sehrawat-lead-india-crush-uae-team-continue-to-rise-in-tournament-indian-women-s-team-south-africa-2023-01-16-839764","keywords":null,"creator":null,"video_url":null,"description":"Women's U-19 T20 World Cup | Riding on some mouthwatering batting display and some brilliant bowling, the Indian U-19 Women's team outclassed UAE in their second match of the Women's U-19 T20 World Cup. The Indian team displayed a dominant game of cricket. Captain Shafali Verma, Shweta Sehrawat and Richa Ghosh helped India register a big total of 219 runs on board before the bowlers wrapped UAE's innings for 97/5. With the win, India have consolidated their top spot in Group D.","content":null,"pubDate":"2023-01-16 15:05:57","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"दो भारतीय बल्‍लेबाज, दोनों को कतई पसंद नहीं था क्रिकेट, जब खेले तो गेंदबाजों के छक्‍के छुड़ाकर बने &#039;सिक्‍सर किंग&#039;","link":"https://hindi.news18.com/news/knowledge/ck-naidu-yuvraj-singh-indian-cricket-batsmen-sixer-king-in-indian-cricket-team-indian-captains-cricket-news-hindi-5230545.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Cricket in History - भारतीय क्रिकेट टीम के दो प्‍लेयर्स ने ये साबित किया है कि मनपसंद गेम खेलने पर ही बेहतरीन प्रदर्शन होगा, ये जरूरी नहीं है. भारतीय क्रिकेट टीम के ये दोनों बल्‍लेबाज अपनी मर्जी के खिलाफ क्रिकेट खेले और दुनिया में अपने नाम का लोहा मनवाया. दोनों को इंडियन क्रिकेट में माना जाता है सिक्‍सर किंग.","content":null,"pubDate":"2023-01-16 14:31:05","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/01/History-of-Cricket-16738785003x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Meg Lanning returns but Phoebe Litchfield steals show as Australia crush Pakistan - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIzL2phbi8xNi9hdXN0cmFsaWEtcGFraXN0YW4td29tZW4tZmlyc3Qtb25lLWRheS1pbnRlcm5hdGlvbmFsLW1hdGNoLXJlcG9ydNIBb2h0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIzL2phbi8xNi9hdXN0cmFsaWEtcGFraXN0YW4td29tZW4tZmlyc3Qtb25lLWRheS1pbnRlcm5hdGlvbmFsLW1hdGNoLXJlcG9ydA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Meg Lanning returns but Phoebe Litchfield steals show as Australia crush Pakistan  The GuardianFresh Aussies win big on back of Litchfield, Lanning fifties | Australia v Pakistan 2022-23  cricket.com.auMeg Lanning and Phoebe Litchfield shine as Australia cruises to victory over Pakistan in opening ODI  ABC NewsLanning stuns in dream return as 19yo debutant pulls off seven-year Aussie first  Fox SportsLitchfield, Lanning star in opening ODI victory | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2023-01-16 14:06:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘Mate, just ramp’: ‘Cooked’ Heat star reveals true ‘mastermind’ behind final-ball heroics - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMi6AFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvZG9tZXN0aWMtY3JpY2tldC9iaWctYmFzaC9icmlzYmFuZS1oZWF0L2JibC1zY29yZXMtcmVzdWx0cy0yMDIzLW1hdHQtcmVuc2hhdy1pbnNwaXJlcy1icmlzYmFuZS1oZWF0LXRvLXdpbi1vdmVyLW1lbGJvdXJuZS1zdGFycy1sYXVkcy1tYXR0aGV3LWt1aG5lbWFubi9uZXdzLXN0b3J5L2FjYTBhNjRlZDZiNmEzYjMzMjQ4NWIwYzVhMDRlNDRj0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Mate, just ramp’: ‘Cooked’ Heat star reveals true ‘mastermind’ behind final-ball heroics  Fox SportsRenshaw's mighty 90* inspires Heat to heart-stopping win | BBL|12  cricket.com.au‘What a finish’: Last-ball madness stuns BBL  news.com.auTest star’s outrageous last-ball gamble pays off as Bevan-like knock wins thriller for Heat  Fox SportsHeat season still alive thanks to Renshaw's heroics  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2023-01-16 13:04:40","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Babar Azam Scandal: Pakistan skipper honey trapped? pictures and videos allegedly leaked","link":"https://www.indiatvnews.com/sports/cricket/babar-azam-scandal-pakistan-skipper-honey-trapped-pictures-and-videos-allegedly-leaked-ramiz-raja-shahid-afridi-pc-pak-vs-nz-2023-01-16-839720","keywords":null,"creator":null,"video_url":null,"description":"Babar Azam Scandal: Pakistan Cricket is caught in yet another controversy. A lot has been going around the Pakistan team and their board, but in a fresh set of controversy that has been doing the round, Pakistan's skipper for all formats Babar Azam has been alleged of sexting. The pictures and videos of the Pakistan skipper have surfaced online. Currently, Azam is facing a heavy backlash after the Pakistan team's dismal outings in the longest form of the game.","content":null,"pubDate":"2023-01-16 12:13:48","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Conrad tasked with restoring South Africa's Test fortunes","link":"https://ewn.co.za/2023/01/16/conrad-tasked-with-restoring-south-africa-s-test-fortunes","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa on Monday announced Shukri Conrad and Rob Walter as coaches of the country's Test and limited overs teams respectively.","content":null,"pubDate":"2023-01-16 12:01:57","image_url":null,"source_id":"ewn","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs SL | Sri Lanka Cricket seeks report from Team manager on team's record loss vs India in 3rd ODI","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sl-sri-lanka-cricket-seeks-report-from-team-manager-on-teams-record-loss-vs-india-in-3rd-odi-ind-vs-sl-3rd-odi-dasun-shanaka-virat-kohli-rohit-2023-01-16-839711","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL | Sri Lanka Cricket (SLC) is seeking reasons for the team's record loss against India in the 3rd and final ODI of the three-match series in Thiruvananthapuram. The islanders lost the 3rd ODI by a record margin of 317 runs against India and drew a blank in the win column in the series. Dasun Shanaka's side was chasing 391 run target and got folded for just 73. ","content":null,"pubDate":"2023-01-16 11:56:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's IPL will be a game-changer for women's cricket and cricket in general: Mithali","link":"https://www.indiatoday.in/sports/cricket/story/womens-ipl-wipl-media-rights-bcci-jay-shah-mithali-raj-womens-cricket-2322241-2023-01-16?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Women's IPL will be a game-changer for women's cricket and cricket in general: Mithali","content":null,"pubDate":"2023-01-16 10:45:24","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"News24.com | Proteas to rely on another interim coach for crucial England series, Walter to have selection say","link":"https://www.news24.com/sport/Cricket/Proteas/proteas-to-rely-on-another-interim-coach-for-crucial-england-series-walter-to-have-selection-say-20230116","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa's director of cricket Enoch Nkwe says Proteas white ball coach Rob Walter will have a say in who plays in the England ODI series later this month.","content":null,"pubDate":"2023-01-16 10:25:12","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs SL 3rd ODI: WWE Superstar praises Virat Kohli, says he'll go past Sachin Tendulkar","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sl-3rd-odi-wwe-superstar-praises-virat-kohli-says-he-ll-go-past-sachin-tendulkar-drew-mcintyre-century-ton-greenfield-international-stadium-2023-01-16-839673","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL 3rd ODI: Virat Kohli undoubtedly is in a league of his own and there are no second thoughts about it. After a bad patch of three long years, Kohli has resumed his regular duties and with 3 centuries from four games, he seems to have found his mojo yet again. Kohli has been a stalwart in Indian cricket and he has continuously delivered with his bat for India. He went past Mahela Jayawardene to become the fifth-highest ODI run scorer in history.","content":null,"pubDate":"2023-01-16 10:08:52","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Root recalls memories of playing in India: Passion for cricket is evident in stadium","link":"https://www.indiatoday.in/sports/cricket/story/joe-root-recalls-fond-memories-of-playing-in-india-passion-for-cricket-is-evident-when-you-walk-into-stadium-2322216-2023-01-16?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Root recalls memories of playing in India: Passion for cricket is evident in stadium","content":null,"pubDate":"2023-01-16 10:02:03","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Shukri Conrad tasked with restoring Proteas Test fortunes: Good luck!","link":"https://www.thesouthafrican.com/sport/cricket/proteas/shukri-conrad-tasked-restoring-proteas-test-fortunes-csa-breaking-16-january-2023/","keywords":["Proteas","Featured","GLcbdudia","latest cricket news","rob walter","shukri conrad"],"creator":["AFP"],"video_url":null,"description":"Cricket South Africa has announced Shukri Conrad and Rob Walter as coaches of the country's Test and limited overs teams, respectively.","content":"Cricket South Africa has announced Shukri Conrad and Rob Walter as coaches of the country's Test and limited overs teams, respectively.","pubDate":"2023-01-16 09:54:15","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Shubman Gill last 10 innings score ODIs: Shubman Gill last 10 ODI innings full list","link":"https://thesportsrush.com/cricket-news-shubman-gill-last-10-innings-score-odis-shubman-gill-last-10-odi-innings-full-list/","keywords":["Cricket","India","Shubman Gill"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Having first represented India in the ODI format almost four years ago, batter Shubman Gill has started to first dominate the same format after finally getting a consistent run in the national team. Gill, 23, has not only justified the selectors and team management’s decision to play him ahead of veteran batter Shikhar Dhawan but… The post Shubman Gill last 10 innings score ODIs: Shubman Gill last 10 ODI innings full list appeared first on The SportsRush.","content":"Having first represented India in the ODI format almost four years ago, batter Shubman Gill has started to first dominate the same format after finally getting a consistent run in the national team. Gill, 23, has not only justified the selectors and team management’s decision to play him ahead of veteran batter Shikhar Dhawan but not even let a vast majority of people remember the latter in the recently concluded three-match ODI series against Sri Lanka. Second-highest run-scorer behind former India captain and Player of the Series Virat Kohli, Gill scored a century and half-century each across three ODIs. The right-handed batter was mature enough to acknowledge that he missed opportunities to score daddy hundreds in both the matches where he crossed the 50-run mark. Heartiest Congratulations to @ShubmanGill & @imVkohli for their spectacular centuries #IndVsSL — Shikhar Dhawan (@SDhawan25) January 15, 2023 Gill, who kept Kohli’s advice in his mind whilst scoring his second ODI century in Thiruvananthapuram on Sunday, will be looking to further stretch out this purple patch especially in this format with a World Cup to be player later in the year. “Felt very good. Always good when you convert a start to a big one. When you are batting with someone like Rohit [Sharma] bhai or Virat [Kohli] bhai, you don’t have to do much. We were just talking about whom to target and when to target,” Gill had told host broadcaster Star Sports during the mid-innings break yesterday.. Shubman Gill last 10 innings score ODIs In his last 10 ODI innings dating back to August 2022, Gill has scored 525 runs at an average of 58.33 and a strike rate of 108.24 with the help of two centuries and half-centuries each. Shubman Gill last 10 ODI innings full list Match 1 – 116 (97) vs Sri Lanka at Greenfield International Stadium Match 2 – 21 (25) vs Sri Lanka at Eden Gardens Match 3 – 70 (60) vs Sri Lanka at Barsapara Cricket Stadium Match 4 – 13 (22) vs New Zealand at Hagley Oval Match 5 – 45* (42) vs New Zealand at Seddon Park Match 6 – 50 (65) vs New Zealand at Eden Park Match 7 – 49 (57) vs South Africa at Arun Jaitley Stadium Match 8 – 28 (26) vs South Africa at JSCA International Stadium Complex Match 9 – 3 (13) vs South Africa at Bharat Ratne Shri Atal Bihari Vajpayee Ekana Cricket Stadium Match 10 – 130 (97) vs Zimbabwe at Harare Sports Club The post Shubman Gill last 10 innings score ODIs: Shubman Gill last 10 ODI innings full list appeared first on The SportsRush.","pubDate":"2023-01-16 09:41:46","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Most Player of the Series in international cricket: Who has won Most Man of the Series in international cricket?","link":"https://thesportsrush.com/cricket-news-most-player-of-the-series-in-international-cricket-who-has-won-most-man-of-the-series-in-international-cricket/","keywords":["Cricket","India","Sachin Tendulkar","Sri Lanka tour of India 2023","Virat Kohli"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Virat Kohli is back at his very best, and he is now scoring centuries for fun. He has now scored three centuries in his four ODIs, and it is looking like this year will be of King Kohli. Virat scored 166* runs in just 110 balls against Sri Lanka in the 3rd ODI, and the… The post Most Player of the Series in international cricket: Who has won Most Man of the Series in international cricket? appeared first on The SportsRush.","content":"Virat Kohli is back at his very best, and he is now scoring centuries for fun. He has now scored three centuries in his four ODIs, and it is looking like this year will be of King Kohli. Virat scored 166* runs in just 110 balls against Sri Lanka in the 3rd ODI, and the way in which he batted after completing his century was just amazing to watch. For his excellent century, he won the Man of the Match and also the Man of the Series award. This was Virat’s 20th Man of the Series award, and he has now equaled Sachin Tendulkar’s record for the most number of Man of the Series awards won. This was Virat’s 46th ODI century, and he is just 4 shy of breaking Sachin’s record. Apart from equalling Sachin’s record of most number of Man of the Series awards, Virat also broke a few other records as well. He has now entered the top-5 list of highest ODI run-scorers. He has surpassed Mahela Jayawardene to enter the list, Virat now has 12,754 ODI runs as compared to Mahela’s 12,650. Virat also broke the record for scoring the fastest ODI 150 on Indian soil. He scored 150 runs in just 106 balls, it is interesting that he took just 21 balls to reach 100 to 150 runs. He also has surpassed Sachin in scoring the most unbeaten centuries. Virat now has 16 unbeaten centuries as compared to Sachin’s 15. Most Player of the Series in international cricket Apart from Sachin and Virat, there are two other Asians in the top-5 list of most Man of the Series awards. Shakib al Hasan, Jacques Kallis and Sanath Jayasuriya are the other three names on the top-5 list. Sachin, Kallis and Jayasuriya played very less T20I cricket and that’s why they did not win any awards in T20Is. S No. Player Span Matches Series Awards Tests ODIs T20Is 1 Virat Kohli 2008-2023 487 148 20 3 10 7 2 Sachin Tendulkar 1989-2013 664 183 20 5 15 0 3 Shakib al Hasan 2006-2022 398 145 16 5 7 4 4 Jaques Kallis 1995-2014 519 148 15 9 6 0 5 Sanath Jayasuriya 1989-2011 586 176 13 2 11 0 The post Most Player of the Series in international cricket: Who has won Most Man of the Series in international cricket? appeared first on The SportsRush.","pubDate":"2023-01-16 09:36:56","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}