{"newsArray":[{"title":"Fresh Health Setback For NZ Great Chris Cairns With Cancer Diagnosis","link":"https://sports.ndtv.com/cricket/fresh-health-setback-for-new-zealand-great-chris-cairns-with-cancer-diagnosis-2750369","keywords":null,"creator":null,"video_url":null,"description":"New Zealand cricket great Chris Cairns revealed Saturday he has suffered a further health setback and has been diagnosed with bowel cancer.","content":null,"pubDate":"2022-02-05 03:35:54","full_description":"New Zealand cricket great Chris Cairns revealed Saturday he has suffered a further health setback and has been diagnosed with bowel cancer. Cairns was only discharged from hospital last week, five months after he underwent a life-saving heart operation and was then paralysed by a subsequent stroke. \"Another fight ahead but here's hoping this one is a swift upper cut and over in the first round,\" the 51-year-old, one of the world's top all-rounders in the early 2000s, said on social media. \"I was told yesterday I have bowel cancer... big shock and not what I was expecting. \"So, as I prepare for another round of conversations with surgeons and specialists, I keep remembering how lucky I am to be here in the first place.\" The Canberra-based Cairns required urgent heart surgery last September following an aortic dissection, which is a tear in the inner layer of the body's main artery. During the operation he suffered a stroke which left him paralysed in both legs. Cairns played 62 Tests for New Zealand between 1989 and 2004, averaging 29.4 with the ball and 33.53 with the bat. He hit 87 sixes, a Test world record at the time, and was the sixth player to achieve the all-rounders' double of 200 wickets and 3,000 runs. Promoted However, his on-field achievements were overshadowed by match-fixing allegations, strongly denied by Cairns, that resulted in two court cases. He was cleared on both occasions but complained his reputation had been \"scorched\" regardless.","image_url":"https://c.ndtvimg.com/2021-08/oghruckg_chris-cairns-afp_625x300_20_August_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Justin Langer exit: Christina Matthews slams Cricket Australia’s treatment of outgoing Aussie coach","link":"https://thewest.com.au/sport/cricket/justin-langer-exit-christina-matthews-slams-cricket-australias-treatment-of-outgoing-aussie-coach-c-5578008","keywords":null,"creator":["Braden Quartermaine"],"video_url":null,"description":"WA Cricket CEO Christina Matthews has conceded Justin Langer is a “hard-arse” as a coach, but said no one was more honest or generous and slammed Cricket Australia’s treatment of the WA legend.","content":null,"pubDate":"2022-02-05 03:28:36","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5578008/4d89f7e709fc4d70daa9370ce2c48b3a3f7af1c1-16x9-x0y391w2335h1313.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"“I think it’s been almost embarrassing the way Cricket Australia have handled”: Ricky Ponting lashes out at Cricket Australia after Justin Langer’s resignation as coach","link":"https://thesportsrush.com/cricket-news-i-think-its-been-almost-embarrassing-the-way-cricket-australia-have-handled-ricky-ponting-lashes-out-at-cricket-australia-after-justin-langers-resignation-as-coach/","keywords":["Cricket","cricket australia","Justin Langer","Ricky Ponting"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ricky Ponting has expressed his rage on Cricket Australia. after Justin Langer stepped down as the coach of the Australian team. In a shocking state of affairs, Justin Langer stepped down as the coach of the Australian national cricket team. The current contract of Langer was set to expire mid-way this season. Australia won the… The post “I think it’s been almost embarrassing the way Cricket Australia have handled”: Ricky Ponting lashes out at Cricket Australia after Justin Langer’s resignation as coach appeared first on The SportsRush.","content":"Ricky Ponting has expressed his rage on Cricket Australia. after Justin Langer stepped down as the coach of the Australian team. In a shocking state of affairs, Justin Langer stepped down as the coach of the Australian national cricket team. The current contract of Langer was set to expire mid-way this season. Australia won the T20 World Cup under Langer in 2021, whereas they also retain the Ashes. Under Langer, Australia won two Ashes, but it was not enough for him. The management company of Justin revealed the news via statement. “DSEG confirms that our client Justin Langer has this morning tendered his resignation as coach of the Australian men’s cricket team,” the statement read. Justin Langer was set to rest for the Sri Lanka T20Is, but there is a Pakistan tour next. The team will leave for Pakistan in three weeks, and the assistant coach Andrew McDonald is set to lead them. Andrew McDonald is the favourite to replace Langer for the long term, but Ricky Ponting’s name is also taking rounds. Ricky Ponting calls it a “Sad Day” for Australian cricket Ricky Ponting calls Justin Langer his brother, and both of them are managed by the same company. He said that Langer definitely wanted to continue, and he played a huge part in Australia’s revival after sandpaper gate. “It is a really sad day as far as Australian cricket is concerned. If you look back it has been a really poor six months on the whole in the way that Cricket Australia has handled some of the better people in the Australian cricket – Justin Langer and Tim Paine. I think it’s been almost embarrassing the way they have handled those two cases,” Ponting said. “He mustn’t have had the full backing of the board. Me knowing Justin the way that I do, he was very keen to continue in the role, as he should have been after what’s been the best coaching period of his international career having just won the T20 World Cup and then the 4-0 result in the Ashes.” Ponting says it was a small group of players not supporting Langer. Adds that the treatment of Langer and Paine by Cricket Australia is “embarrassing” — Peter Lalor (@plalor) February 5, 2022 Ricky Ponting believes that the players and some other people influenced the CA. He said that during his time, the players would not get involved much in these things. “Never in my time as a player or as captain of the team did us as a player group ever influence what a board was thinking as far as appointments of coaches,” he said. “It seems this time like the players, and maybe a couple of the other personnel around the Australian cricket team, might have been influenced Cricket Australia into making the decision that they have.”     The post “I think it’s been almost embarrassing the way Cricket Australia have handled”: Ricky Ponting lashes out at Cricket Australia after Justin Langer’s resignation as coach appeared first on The SportsRush.","pubDate":"2022-02-05 03:22:07","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer resigns as Australia coach after declining short-term extension - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvYXVzdHJhbGlhLW5ld3MtanVzdGluLWxhbmdlci1yZXNpZ25zLWFzLWF1c3RyYWxpYS1tZW4tcy1oZWFkLWNvYWNoLTEyNzQwMTnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Justin Langer resigns as Australia coach after declining short-term extension  ESPNcricinfoJustin Langer Delivers Shock Resignation As Australia Head Coach  NDTVSports.comJustin Langer resigns as Australia coach day after Cricket Australia board discussed his future  India TodayPonting labels Langer resignation 'a sad day for Australian cricket'  ESPNcricinfoJustin Langer steps down as Australia coach  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-02-05 03:14:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Justin Langer Did Not Accept Short-Term Extension: Cricket Australia","link":"https://sports.ndtv.com/cricket/justin-langer-did-not-accept-short-term-extension-to-his-current-contract-cricket-australia-2750357","keywords":null,"creator":null,"video_url":null,"description":"The contract extension offered to Justin was the result of a thorough review process that evaluated many factors including future requirements of the team and the upcoming extensive schedule of...","content":null,"pubDate":"2022-02-05 03:09:02","full_description":"Cricket Australia on Saturday accepted men's team head coach Justin Langer's resignation. \"Justin was offered a short-term extension to his current contract, which sadly he has opted not to accept,\" stated an official Cricket Australia release. The contract extension offered to Justin was the result of a thorough review process that evaluated many factors including future requirements of the team and the upcoming extensive schedule of fixtures. The extension was approved by the CA Board and was put to Justin last night. It included the opportunity to defend the T20 World Cup title in Australia at the end of this year. Justin informed CA this morning he was not accepting the offer and would resign with immediate effect. Cricket Australia CEO Nick Hockley said: \"Justin has been an outstanding coach of the Australian men's team over the past four years. He has restored the trust in the team and his legacy is assured.\" \"We are extremely proud of his achievements since he took over in 2018, including the recent T20 World Cup victory and Ashes success. We are naturally disappointed Justin has decided against continuing as a coach but respect his decision and wish him all the best in the future,\" he added. Promoted Andrew McDonald has been appointed as interim head coach.","image_url":"https://c.ndtvimg.com/2021-07/4onmlpn_justin-langer-twitter_625x300_01_July_21.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Langer quits effective immediately","link":"https://www.news.com.au/sport/cricket/langer-quits-effective-immediately/video/d8d4ed65313af14c66a58223098a1294","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Justin Langer has resigned as coach of the Australian Men's Cricket Team effective immediately following a marathon 8-hour Cricket Australia board meeting where his fate was decided.","content":null,"pubDate":"2022-02-05 03:04:09","full_description":null,"image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer exit: Cricket Australia reveal short-term contract extension was rejected","link":"https://thewest.com.au/sport/australian-cricket-team/cricket-australia-break-silence-after-justin-langers-resignation-reveal-short-term-deal-was-rejected-c-5577811","keywords":null,"creator":["Jordan McArdle"],"video_url":null,"description":"Cricket Australia has released a statement after Justin Langer’s bombshell resignation, revealing the national coach “sadly” opted not to accept a short-term contract extension.","content":null,"pubDate":"2022-02-05 03:03:55","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5577811/d094c510259858299c49af3a1b2bd441b481f145-16x9-x0y199w2898h1630.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Langer resigns as Australian coach","link":"https://sportstar.thehindu.com/cricket/langer-resigns-as-australian-coach-cricket-australia-news/article38381127.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Justin Langer has resigned as coach of the Australian men's cricket team, his management company said on Saturday.","content":null,"pubDate":"2022-02-05 02:54:40","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussie greats fume at ‘garbage’ Langer move","link":"https://www.news.com.au/sport/cricket/really-sad-day-former-australian-teammates-fume-at-justin-langers-resignation/news-story/b433eed2dfd3370ce10a51187d838bcc","keywords":null,"creator":null,"video_url":null,"description":"Justin Langer’s resignation has sparked a passionate response from Australian sporting fans and ex-teammates, with former Test captain Ricky Ponting calling it “a really sad day as far as Australian cricket is concerned”.","content":null,"pubDate":"2022-02-05 02:32:00","full_description":"Justin Langer’s resignation has sparked a passionate response from Australian sporting fans and ex-teammates, with former Test captain Ricky Ponting calling it “a really sad day as far as Australian cricket is concerned”. On Saturday, Langer’s management company DSEG confirmed that the 51-year-old had tendered his resignation , stepping down as coach of the Australian men’s cricket team with immediate effect. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > Langer replaced Darren Lehmann as national men’s coach following the infamous ball-tampering saga of March 2018, but after Australia lost the Border-Gavaskar Trophy on home soil twice in three years, reports emerged of player dissatisfaction within the national set-up. A crisis meeting between CA chiefs and senior players was needed last year to address Langer’s breakdown in relationship with the players, sparking suggestions he was in danger of not having his contract renewed. On Friday, the Cricket Australia board met to discuss Langer’s contract, which was set to expire in June, confirming they would enter “confidential discussions” with the former Australian opener to ensure an outcome “as soon as possible”. CA offered the West Australian a short-term contract, but he turned it down and stepped away from the role. Assistant coach Andrew McDonald has been appointed interim head coach ahead of next month’s Pakistan tour. “The contract extension offered to Justin was the result of a thorough review process that evaluated many factors including future requirements of the team and the upcoming extensive schedule of fixtures,” CA said in a statement. “The extension was approved by the CA Board and was put to Justin last night. It included the opportunity to defend the T20 World Cup title in Australia at the end of this year. “Justin informed CA this morning he was not accepting the offer and would resign with immediate effect.” According to reports, Langer’s management company announced his resignation on social media before Cricket Australia had been informed of the decision. Langer’s resignation comes after Australia secured its maiden T20 World Cup title in November and retained the Ashes with a comprehensive 4-0 series triumph a few weeks ago. Speaking on ABC Radio, Ponting suggested Langer had been pushed out of the coaching role after a “small group” of players refused to support him. “It is a really sad day as far as Australian cricket is concerned and if you look back it has been a really poor six months on the whole in the way that Cricket Australia has handled some of the better people in the Australian cricket — Justin Langer and Tim Paine — and I think it’s been almost embarrassing the way they have handled those two cases,” Ponting said. “He mustn’t have had the full backing of the board. Me knowing Justin the way that I do, he was very keen to continue in the role, as he should have been after what’s been the best coaching period of his international career having just won the T20 World Cup and then the 4-0 result in the Ashes. “It seems like a very strange time for a coach to be departing. “Reading the tea leaves it sounds like a few — and as he says to me a small group in the playing group and a couple of other staff around the team — haven’t entirely loved the way he has gone about it. “That’s been enough to force a man who has put his life and heart and soul into Australian cricket and done a sensational job at turning around the culture and the way the Australian team has been looked at in the last few years to push him out of the job.” Several other former teammates and Australian cricket greats have jumped to Langer’s defence in the aftermath of the contract saga. Former Australian opener Matthew Hayden told ABC Radio on Saturday: “It was absolutely clear that no one backed him. If you listen to the Australian captain speak the other day, there was not one mention of any sort of commendation or support. “That would have been extremely hurtful. “How do you reckon he’d be going? To hear the Australian captain on Sunrise offer no support and commendation. How would you feel? “And now we hear Pat Cummins saying, ‘This is a high performance environment, we all go through a high performance review’. I’m sorry Pat but that’s garbage … this just reeks of being orchestrated.” Long-time friend and West Australian teammate Damien Martyn tweeted: “It’s crazy … Took us from our darkest days to here.” Former Australian bowler Mitchell Johnson wrote on Instagram: “It‘s very disappointing to watch the treatment of one of the very best humans in cricket, on & off the field. Makes you wonder how the future looks & also makes you wonder why would you want to coach the Australian cricket team.” Justin Langer resigns. As good a man & coach as youâll ever find. What an appalling disrespectful schemozzle this has been. Embarrassing. #langer #CricketAustralia Sad to hear the JL call.. a situation handled so poorly and he deserved so much better. Those involved would want to hope the wins keep coming #langer #CricketAustralia I interrupt my Twatter break to say this. Justin Langer is one of Australia's greatest sportsmen. Not just his skill, talent & legendary work ethic. But his humility, integrity, generosity & grace. I don't care for the sport, but you'll struggle to meet a better bloke. #JL Consider this: would Cummins and co be going down this path - knowing full well that they are going to have the shit kicked out of them by all the former greats and the vast majority of fans - if they didnât genuinely believe it was the right thing for the future of their team? Channel 7 commentator Alison Mitchell tweeted: “It’s a pretty sad situation when the winning Ashes coach has to go. Clash of methods or personalities or both, no one can dispute Justin Langer’s passion for his country or, being from WA, the immense family sacrifices he made in recent times in particular.” Langer’s manager James Henderson posted: “As a player Justin retired on top after a 5-0 Ashes whitewash. Today, despite the views of a faceless few, he finishes his time as Australian cricket coach winning the T20 World Cup and the Ashes. Lest we forget what JL took over in 2018.” CA chief executive Nick Hockley said in a statement: “Justin has been an outstanding coach of the Australian men’s team over the past four years. “He has restored the trust in the team and his legacy is assured. “We are extremely proud of his achievements since he took over in 2018, including the recent T20 World Cup victory and Ashes success. “We are naturally disappointed Justin has decided against continuing as coach but respect his decision and wish him all the best in the future. “I would like to sincerely thank Justin and also his family for all that they have given to Australian cricket over the past four years, for which we remain eternally grateful.” On Thursday, Australian men’s Test captain Pat Cummins refused to endorse Langer as coach. “It’s in Cricket Australia’s hands,” he said when asked if he wanted Langer in charge. “JLs been doing a fantastic job, he’s been there for four years, his contract is obviously up soon, they’re just going through an evaluation process at the moment, which I think is fair, the right thing to do. We all get evaluated all the time as cricketers. It’s part of a high-performance environment. “That process is happening, it’s a decision for Cricket Australia and we just have to wait.” Langer will fly back home to Perth for the first time in six months on Saturday. He won 15 of his 27 Tests as Australian men’s coach since taking charge in 2018. After months of speculation about his contract, Justin Langer has resigned as coach of the Australian men’s cricket team. Justin Langer’s future as Australia’s men’s cricket coach is still in limbo after a marathon board meeting. Border issues will mean a first-ever moment for the 120-year-old Sheffield Shield competition, which is set to resume next week.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia finish third at U19 World Cup","link":"https://www.perthnow.com.au/sport/cricket/australia-finish-third-at-u19-world-cup-c-5577660","keywords":null,"creator":["Ed Jackson"],"video_url":null,"description":"Australia have beaten Afghanistan by two wickets to claim third place at the Under-19 cricket World Cup in the West Indies.","content":null,"pubDate":"2022-02-05 02:26:30","full_description":"An all-round display from Nivethan Radhakrishnan has secured Australia a two-wicket win over Afghanistan and third place in the Under-19 cricket World Cup in the West Indies. Indian-born Radhakrishnan took 3-31 with the ball as Afghanistan set Australia a target of 201 in the third-place playoff in Antigua, before scoring a half-century as Australia claimed victory with just five balls to spare. While the ambidextrous Tasmanian recruit stood out with bat and ball, Australia were also aided by a good bowling display from William Salzmann who finished with 3-43 and reduced Afghanistan to 2-15 with early breakthroughs. Radhakrishnan top-scored in Australia's chase with 66 off 96 balls while opener Campbell Kellaway also posted a half-century, making 51 off 82 deliveries. \"What we've done as a group through this World Cup has been marvellous,\" Radhakrishnan said. \"The boys have gone through so much physically and mentally. I think we've represented Australia the best we could have. \"To get third place and in a thriller like this where everyone was involved couldn't be prouder of ourselves.\" England and India face off in the final of the tournament at the Sir Vivian Richards Cricket Ground in Antigua on Saturday (0000 Sunday AEDT).","image_url":"https://images.perthnow.com.au/publication/C-5577660/d76dd85cb3156fd00b9f3946eb993a8c899d8486-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia finish third at U19 World Cup","link":"https://thewest.com.au/sport/cricket/australia-finish-third-at-u19-world-cup-c-5577658","keywords":null,"creator":["Ed Jackson"],"video_url":null,"description":"Australia have beaten Afghanistan by two wickets to claim third place at the Under-19 cricket World Cup in the West Indies.","content":null,"pubDate":"2022-02-05 02:26:29","full_description":"An all-round display from Nivethan Radhakrishnan has secured Australia a two-wicket win over Afghanistan and third place in the Under-19 cricket World Cup in the West Indies. Indian-born Radhakrishnan took 3-31 with the ball as Afghanistan set Australia a target of 201 in the third-place playoff in Antigua, before scoring a half-century as Australia claimed victory with just five balls to spare. While the ambidextrous Tasmanian recruit stood out with bat and ball, Australia were also aided by a good bowling display from William Salzmann who finished with 3-43 and reduced Afghanistan to 2-15 with early breakthroughs. Radhakrishnan top-scored in Australia's chase with 66 off 96 balls while opener Campbell Kellaway also posted a half-century, making 51 off 82 deliveries. \"What we've done as a group through this World Cup has been marvellous,\" Radhakrishnan said. \"The boys have gone through so much physically and mentally. I think we've represented Australia the best we could have. \"To get third place and in a thriller like this where everyone was involved couldn't be prouder of ourselves.\" England and India face off in the final of the tournament at the Sir Vivian Richards Cricket Ground in Antigua on Saturday (0000 Sunday AEDT).","image_url":"https://images.thewest.com.au/publication/C-5577658/d76dd85cb3156fd00b9f3946eb993a8c899d8486-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer resigns as Australia cricket coach following CA board meeting - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL2ZlYi8wNS9qdXN0aW4tbGFuZ2VyLXJlc2lnbnMtYXMtYXVzdHJhbGlhLWNyaWNrZXQtY29hY2gtZm9sbG93aW5nLWNhLWJvYXJkLW1lZXRpbmfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Justin Langer resigns as Australia cricket coach following CA board meeting  The GuardianTelling detail in Justin Langer resignation  NEWS.com.auJustin Langer resigns as Australian men's cricket team head coach  ABC NewsLanger's roller-coaster ride as Aust coach  Illawarra MercuryAustralian cricket coach Justin Langer resigns  Wide World of SportsView Full coverage on Google News","content":null,"pubDate":"2022-02-05 02:23:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie greats fume at ‘garbage’ Langer move","link":"https://www.cairnspost.com.au/sport/cricket/really-sad-day-former-australian-teammates-fume-at-justin-langers-resignation/news-story/b433eed2dfd3370ce10a51187d838bcc","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Justin Langer’s resignation has sparked a passionate response from Australian sporting fans and ex-teammates, with former Test captain Ricky Ponting calling it “a really sad day as far as Australian cricket is concerned”.","content":null,"pubDate":"2022-02-05 02:11:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer exit: Former greats lash out at lack of support for resigned Australian cricket coach","link":"https://thewest.com.au/sport/cricket/justin-langer-exit-former-greats-lash-out-at-lack-of-support-for-resigned-australian-cricket-coach-c-5577491","keywords":null,"creator":["Chris Robinson & Braden Quartermaine"],"video_url":null,"description":"Australian cricket greats have lashed the treatment of departing coach Justin Langer, with Ricky Ponting describing Langer’s exit as coach as ‘almost embarrassing’.","content":null,"pubDate":"2022-02-05 02:01:34","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5577491/432ccfa968109face8fe75842723790b26fcc42b-16x9-x0y88w5156h2900.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ponting slams CA over Langer treatment","link":"https://www.perthnow.com.au/sport/cricket/ponting-slams-ca-over-langer-treatment-c-5577523","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Ricky Ponting has labelled Cricket Australia's handling of Justin Langer's exit as \"embarrassing\", joining former coach John Buchanan in slamming the situation.","content":null,"pubDate":"2022-02-05 02:01:21","full_description":"Ricky Ponting has slammed Cricket Australia over the treatment meted out to Justin Langer, labelling it as \"embarrassing\". Just moments after it was revealed Langer had resigned from his post and would not coach Australia again, Ponting came out in support of his ex-teammate. In a telling radio interview, Ponting claimed it was clear Langer had been pushed by Cricket Australia given he wanted to continue on in the role. \"It's been a really poor six months with the way Cricket Australia have handled some of the better people in Australian cricket,\" Ponting told ABC. \"Those being Justin Langer and Tim Paine (at the start of the summer). \"I think it's been almost embarrassing the way they handled those two cases.\" Ponting admitted he was disappointed Pat Cummins had not publicly backed the coach, but said he understood the captain was in a difficult situation. Ponting claimed it was \"a very small group\" of players and other support staff that had grown tired of Langer's intense style, prompting his exit after a 4-0 Ashes win and maiden Twenty20 World Cup victory. \"That's been enough to force a man that has put his life and heart and soul into Australian cricket,\" Ponting said. \"And (someone who has) done a sensational job of turning around the culture and the way the Australian cricket team has been looked at over the past three or four years. \"I actually think it's a really sad day as far as Australian cricket is concerned.\" Ponting's comments come after former coach John Buchanan blasted CA's treatment of Langer on Friday night, after a seven-hour board meeting ended with them wanting to talk with him further. \"I just think Cricket Australia have really hung Justin out to dry, and whether they are going to reappoint him or not going to reappoint him, it's just become a real saga and I really don't understand why it has to be,\" Buchanan told 4BC radio. \"When he came in he was asked to do two things and that was to fix the culture of the team, make the Australian cricket team a likeable team again. \"Play hard, play fair and win some games. \"It just seems to be a drama that didn't need to occur. \"It's a very difficult job but one that he has demonstrated over four years or so that he has coped with very well.\"","image_url":"https://images.perthnow.com.au/publication/C-5577523/a19f5450ab01a21cf581320b03a8fe46e702ed88-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Ponting slams CA over Langer treatment","link":"https://thewest.com.au/sport/cricket/ponting-slams-ca-over-langer-treatment-c-5577521","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Ricky Ponting has labelled Cricket Australia's handling of Justin Langer's exit as \"embarrassing\", joining former coach John Buchanan in slamming the situation.","content":null,"pubDate":"2022-02-05 02:01:21","full_description":"Ricky Ponting has slammed Cricket Australia over the treatment meted out to Justin Langer, labelling it as \"embarrassing\". Just moments after it was revealed Langer had resigned from his post and would not coach Australia again, Ponting came out in support of his ex-teammate. In a telling radio interview, Ponting claimed it was clear Langer had been pushed by Cricket Australia given he wanted to continue on in the role. \"It's been a really poor six months with the way Cricket Australia have handled some of the better people in Australian cricket,\" Ponting told ABC. \"Those being Justin Langer and Tim Paine (at the start of the summer). \"I think it's been almost embarrassing the way they handled those two cases.\" Ponting admitted he was disappointed Pat Cummins had not publicly backed the coach, but said he understood the captain was in a difficult situation. Ponting claimed it was \"a very small group\" of players and other support staff that had grown tired of Langer's intense style, prompting his exit after a 4-0 Ashes win and maiden Twenty20 World Cup victory. \"That's been enough to force a man that has put his life and heart and soul into Australian cricket,\" Ponting said. \"And (someone who has) done a sensational job of turning around the culture and the way the Australian cricket team has been looked at over the past three or four years. \"I actually think it's a really sad day as far as Australian cricket is concerned.\" Ponting's comments come after former coach John Buchanan blasted CA's treatment of Langer on Friday night, after a seven-hour board meeting ended with them wanting to talk with him further. \"I just think Cricket Australia have really hung Justin out to dry, and whether they are going to reappoint him or not going to reappoint him, it's just become a real saga and I really don't understand why it has to be,\" Buchanan told 4BC radio. \"When he came in he was asked to do two things and that was to fix the culture of the team, make the Australian cricket team a likeable team again. \"Play hard, play fair and win some games. \"It just seems to be a drama that didn't need to occur. \"It's a very difficult job but one that he has demonstrated over four years or so that he has coped with very well.\"","image_url":"https://images.thewest.com.au/publication/C-5577521/a19f5450ab01a21cf581320b03a8fe46e702ed88-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Who will win today Pakistan Super League match: Who is expected to win Peshawar Zalmi vs Multan Sultans PSL 2022 match?","link":"https://thesportsrush.com/cricket-news-who-will-win-today-pakistan-super-league-match-who-is-expected-to-win-islamabad-united-vs-multan-sultans-psl-2022-match-2/","keywords":["Cricket","Peshawar vs Multan","PSL 2022","PSL Match Prediction"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Peshawar Zalmi vs Multan Sultans: The SportsRush brings you the analysis and match-prediction of the Pakistan Super League game. Peshawar Zalmi will lock horns against Multan Sultans in the league game of the PSL 2022. The match will be played at the National Cricket Stadium in Karachi. The Zalmis have won two of their four… The post Who will win today Pakistan Super League match: Who is expected to win Peshawar Zalmi vs Multan Sultans PSL 2022 match? appeared first on The SportsRush.","content":"Peshawar Zalmi vs Multan Sultans: The SportsRush brings you the analysis and match-prediction of the Pakistan Super League game. Peshawar Zalmi will lock horns against Multan Sultans in the league game of the PSL 2022. The match will be played at the National Cricket Stadium in Karachi. The Zalmis have won two of their four games, whereas the Sultans have won all four of their games. The game will be live on Sony Six from 8.00 PM IST. Who will win today PSL 2022 match: Peshawar Zalmi vs Multan Sultans Pitch Report The pitch has been excellent for batting this season. There is an even bounce on the track, whereas the boundaries are small as well. Both teams would want to chase because of the dew factor. Peshawar Zalmi preview Multan Sultans are the defending champions, and they have won all four of their games this season. Mohammad Rizwan is the captain of the side and has scored two half-centuries, whereas Shan Masood has also scored two half-centuries. Sohaib Maqsood had a terrific PSL 2021, whereas Rilee Rossouw and Tim David are looking in excellent form as well. Khushdil Shah has scalped nine wickets in the tournament, whereas Tahir and Willey have scalped seven wickets each. This time is looking in fine form. Probable XI: Mohammad Rizwan, Shan Masood, Sohaib Maqsood, Rilee Rossouw, Khushdil Shah, Tim David, David Willey, Shahnawaz Dahani, Abbas Afridi, Rumman Raees, Imran Tahir. Malik Masterclass yet again! 40 looks good on you, @realshoaibmalik #HBLPSL7 I #LevelHai l #KKvPZ pic.twitter.com/ueL4PSgHWn — PakistanSuperLeague (@thePSLt20) February 4, 2022 Multan Sultans preview Peshawar Zalmi lost in the final last year, and they have won two of their four games this season. Kamran Akmal has been a consistent player, whereas Hazratullah Zazai is also an asset as an opener. Shoaib Malik has batted well in the middle-order, whereas Sherfane Rutherford has been brilliant as a finisher. The Batting of this side looks great, but the problem is in the bowling department. Qadir has been their best bowler with four wickets so far, whereas Wahab Riaz has been wicketless. Saqib Mahmood is expected to play this game. Probable XI: Kamran Akmal, Hazratullah Zazai, Haider Ali, Shoaib Malik, Hussain Talat, Sherfane Rutherford, Ben Cutting, Wahab Riaz, Mohammad Umar, Saqib Mahmood, Usman Qadir. Match Prediction Islamabad United are the favourites to win this game. The post Who will win today Pakistan Super League match: Who is expected to win Peshawar Zalmi vs Multan Sultans PSL 2022 match? appeared first on The SportsRush.","pubDate":"2022-02-05 02:00:54","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"African Cup: Egypt set up final date with Senegal","link":"https://www.tribuneindia.com/news/sports/african-cup-egypt-set-up-final-date-with-senegal-367227","keywords":null,"creator":null,"video_url":null,"description":"Yaounde Liverpool teammates Mohamed Salah and Sadio Mane — African football's stars — will be facing off as rivals. Salah didn't even get a chance to take a penalty for Egypt in a 3-1 shootout victory over Cameroon in the African Cup of Nations semifinals. Kaec (Saudi Arabia) Kapur best Indian at T-17 as 4 Indians make cut Indian golfer Shiv Kapur endured a tough second round, carding a disappointing 2-over 72 on a windy day but managed to stay as the best-placed Indian at the Saudi International here today. Kapur slipped to tied-17 from T-4 overnight. Shubhankar Sharma (67-71), Rashid Khan (66-75) and Viraj Madappa 71-72) also made the cut. Vasco 10-man Kerala ride on down NorthEast United Ten-man Kerala Blasters FC moved to second spot in the points table with a spirited performance to down NorthEast United FC 2-1 in the Indian Super League here today. Bengaluru PKL: Haryana Steelers stun Bengal Warriors 46-29 Haryana Steelers produced an all-round effort to register a sensational 46-29 win over defending champions Bengal Warriors in the Pro Kabaddi League here today. — Agencies London England sack Thorpe as Silverwood leaves after Ashes debacle Former batter Graham Thorpe was today sacked as England's assistant coach after the team's humiliating Ashes series loss in Australia. \"Graham Thorpe has left his position as England men's assistant coach,\" England and Wales Cricket Board (ECB) said in a statement. The 52-year-old became the third person to depart following the exit of England's chief coach Chris Silverwood and director of cricket Ashley Giles in the wake of the team's 0-4 loss to Australia. \"I've been very fortunate to have worked with so many good players and coaches who I consider my friends for life,\" Thorpe said in a statement issued by the ECB. The England team is due to depart for the Caribbean on February 24 but the ECB has not announced any interim coaching appointments. AP","content":null,"pubDate":"2022-02-05 01:32:50","full_description":"Yaounde Liverpool teammates Mohamed Salah and Sadio Mane — African football’s stars — will be facing off as rivals. Salah didn't even get a chance to take a penalty for Egypt in a 3-1 shootout victory over Cameroon in the African Cup of Nations semifinals. Kaec (Saudi Arabia) Kapur best Indian at T-17 as 4 Indians make cut Indian golfer Shiv Kapur endured a tough second round, carding a disappointing 2-over 72 on a windy day but managed to stay as the best-placed Indian at the Saudi International here today. Kapur slipped to tied-17 from T-4 overnight. Shubhankar Sharma (67-71), Rashid Khan (66-75) and Viraj Madappa 71-72) also made the cut. Vasco 10-man Kerala ride on down NorthEast United Ten-man Kerala Blasters FC moved to second spot in the points table with a spirited performance to down NorthEast United FC 2-1 in the Indian Super League here today. Bengaluru PKL: Haryana Steelers stun Bengal Warriors 46-29 Haryana Steelers produced an all-round effort to register a sensational 46-29 win over defending champions Bengal Warriors in the Pro Kabaddi League here today. — Agencies London England sack Thorpe as Silverwood leaves after Ashes debacle Former batter Graham Thorpe was today sacked as England's assistant coach after the team's humiliating Ashes series loss in Australia. \"Graham Thorpe has left his position as England men's assistant coach,\" England and Wales Cricket Board (ECB) said in a statement. The 52-year-old became the third person to depart following the exit of England's chief coach Chris Silverwood and director of cricket Ashley Giles in the wake of the team's 0-4 loss to Australia. \"I've been very fortunate to have worked with so many good players and coaches who I consider my friends for life,\" Thorpe said in a statement issued by the ECB. The England team is due to depart for the Caribbean on February 24 but the ECB has not announced any interim coaching appointments. AP","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_974393745.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Ahmedabad to Antigua, words of wisdom from Virat Kohli","link":"https://www.tribuneindia.com/news/sports/ahmedabad-to-antigua-words-of-wisdom-from-virat-kohli-367211","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, February 3Virat Kohli knows exactly how it feels to be on the top of the world when one has barely attained the age to get a driving licence.Kohli also knows how it feels when criticism flies thick and fast after one doesn't perform as per potential after a global trophy. And no one knows more than Kohli how it feels to be a world-beater at a level where it matters the most.So it wasn't just a \"good but a great morning\" for the likes of Rajvardhan Hangargekar, Kaushal Tambe, and Yash Dhull when, from their hotel rooms in Antigua, they got connected with the former India captain, who is in Ahmedabad. Led by Dhull, India U-19 will take on England in the final of the Under-19 World Cup tomorrow. U-19 is just another stop and even if they win the title, there is certainly no guarantee that life will be bed of roses for them.The 33-year-old Kohli knows a thing or two about winning a high-pressure final at the junior level, having led India to victory over South Africa in the final of the 2008 edition in Kuala Lumpur. Fourteen summers have passed by, and in that time Kohli became India's most successful Test captain, and also scored over 20,000 international runs.\"It was really good to interact with you Virat Kohli bhaiyya. Learnt some important things about life and cricket from you which will help us in getting better in upcoming times,\" wrote Hangargekar, the team's premier pace-bowling all-rounder, on social media.\"Some valuable tips from the GOAT before the final,\" wrote spinner Kaushal Tambe.Their head coach, Hrishikesh Kanitkar, was also present, listening intently to what one of the world's greatest batters had to tell his wards. —","content":null,"pubDate":"2022-02-05 01:32:41","full_description":"PTI New Delhi, February 3 Virat Kohli knows exactly how it feels to be on the top of the world when one has barely attained the age to get a driving licence. Kohli also knows how it feels when criticism flies thick and fast after one doesn't perform as per potential after a global trophy. And no one knows more than Kohli how it feels to be a world-beater at a level where it matters the most. So it wasn’t just a \"good but a great morning\" for the likes of Rajvardhan Hangargekar, Kaushal Tambe, and Yash Dhull when, from their hotel rooms in Antigua, they got connected with the former India captain, who is in Ahmedabad. Led by Dhull, India U-19 will take on England in the final of the Under-19 World Cup tomorrow. U-19 is just another stop and even if they win the title, there is certainly no guarantee that life will be bed of roses for them. The 33-year-old Kohli knows a thing or two about winning a high-pressure final at the junior level, having led India to victory over South Africa in the final of the 2008 edition in Kuala Lumpur. Fourteen summers have passed by, and in that time Kohli became India’s most successful Test captain, and also scored over 20,000 international runs. \"It was really good to interact with you Virat Kohli bhaiyya. Learnt some important things about life and cricket from you which will help us in getting better in upcoming times,\" wrote Hangargekar, the team's premier pace-bowling all-rounder, on social media. \"Some valuable tips from the GOAT before the final,\" wrote spinner Kaushal Tambe. Their head coach, Hrishikesh Kanitkar, was also present, listening intently to what one of the world's greatest batters had to tell his wards. —","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1341186620.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Rule tweaks behind big ODI totals: Sachin","link":"https://thewest.com.au/sport/cricket/rule-tweaks-behind-big-odi-totals-sachin-c-5577285","keywords":null,"creator":["Amlan Chakraborty"],"video_url":null,"description":"Indian batting great Sachin Tendulkar says a slew of new rules have led to ballooning totals in one-day international cricket.","content":null,"pubDate":"2022-02-05 01:29:07","full_description":"Sachin Tendulkar takes nothing away from the current crop of batsmen but the Indian great believes a slew of rule changes have led to ballooning scores in one-day cricket. India will become the first team to play 1000 one-day internationals when they host the West Indies in Sunday's series-opener in Ahmedabad. Tendulkar has featured in 463 of them and his tally of 18,426 runs remains an unmatched benchmark even a decade after he played the last of his ODIs. \"I wouldn't take away any credit from batters, but rules and conditions have changed,\" the 48-year-old told Reuters in a telephone interview. \"Batters' strike rates are way higher than it used to be in the 1990s, and bowlers' economy rates are also higher ... average runs scored in 50 overs today is way more than it was in the 1990s. \"Two new balls, field restrictions and change in match timings - these elements have changed the game over the years.\" Bowling with two new balls has effectively killed reverse swing in one-day cricket, according to Tendulkar, whose 49 ODI centuries remains a record. \"I haven't seen much of reverse swing. Maybe it reverses a little bit 46th over onwards, because the ball is actually 23-overs old. \"With one new ball, it would begin reversing from the 24th over and you bowl another 26 overs with that.\" The current crop of batsmen have also been spared the trouble of facing a discoloured ball, the former India captain said. \"When the ball gets discoloured, you don't see it spinning in the air. That's when an off-spinner's doosra or a leg-spinner's googly becomes more effective. \"Also when the discoloured ball is reversing, you don't pick the shiny side and the scruffed-up side. You take a fraction longer and the fraction lost made a batter's life more difficult.\" The rule requiring five players inside the ring has encouraged batsmen to go over the top and the advent of day-night matches has also worked in their favour, said Tendulkar. \"ODIs would start at 9 o'clock and there was more life in the surface at 9 o'clock in the morning. \"It made a huge difference. You had to bat differently, you had to plan differently.\" Tendulkar quit international cricket in 2013 with 100 centuries to his name, which also included the first ODI double hundred by a male cricketer. He feels bowlers have become more defensive since his retirement and he would not alter anything about his batting if he were to play today. \"I would have continued batting the same way,\" said Tendulkar. \"In the 1999 World Cup match against Pakistan, Wasim Akram was bowling the 47th over with a slip. Would you see something like that in today's cricket? No chance.\"","image_url":"https://images.thewest.com.au/publication/C-5577285/dee619199a72f8f67d67c9965f44ad96760902e8-16x9-x0y75w800h450.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rule tweaks behind big ODI totals: Sachin","link":"https://www.perthnow.com.au/sport/cricket/rule-tweaks-behind-big-odi-totals-sachin-c-5577287","keywords":null,"creator":["Amlan Chakraborty"],"video_url":null,"description":"Indian batting great Sachin Tendulkar says a slew of new rules have led to ballooning totals in one-day international cricket.","content":null,"pubDate":"2022-02-05 01:29:07","full_description":"Sachin Tendulkar takes nothing away from the current crop of batsmen but the Indian great believes a slew of rule changes have led to ballooning scores in one-day cricket. India will become the first team to play 1000 one-day internationals when they host the West Indies in Sunday's series-opener in Ahmedabad. Tendulkar has featured in 463 of them and his tally of 18,426 runs remains an unmatched benchmark even a decade after he played the last of his ODIs. \"I wouldn't take away any credit from batters, but rules and conditions have changed,\" the 48-year-old told Reuters in a telephone interview. \"Batters' strike rates are way higher than it used to be in the 1990s, and bowlers' economy rates are also higher ... average runs scored in 50 overs today is way more than it was in the 1990s. \"Two new balls, field restrictions and change in match timings - these elements have changed the game over the years.\" Bowling with two new balls has effectively killed reverse swing in one-day cricket, according to Tendulkar, whose 49 ODI centuries remains a record. \"I haven't seen much of reverse swing. Maybe it reverses a little bit 46th over onwards, because the ball is actually 23-overs old. \"With one new ball, it would begin reversing from the 24th over and you bowl another 26 overs with that.\" The current crop of batsmen have also been spared the trouble of facing a discoloured ball, the former India captain said. \"When the ball gets discoloured, you don't see it spinning in the air. That's when an off-spinner's doosra or a leg-spinner's googly becomes more effective. \"Also when the discoloured ball is reversing, you don't pick the shiny side and the scruffed-up side. You take a fraction longer and the fraction lost made a batter's life more difficult.\" The rule requiring five players inside the ring has encouraged batsmen to go over the top and the advent of day-night matches has also worked in their favour, said Tendulkar. \"ODIs would start at 9 o'clock and there was more life in the surface at 9 o'clock in the morning. \"It made a huge difference. You had to bat differently, you had to plan differently.\" Tendulkar quit international cricket in 2013 with 100 centuries to his name, which also included the first ODI double hundred by a male cricketer. He feels bowlers have become more defensive since his retirement and he would not alter anything about his batting if he were to play today. \"I would have continued batting the same way,\" said Tendulkar. \"In the 1999 World Cup match against Pakistan, Wasim Akram was bowling the 47th over with a slip. Would you see something like that in today's cricket? No chance.\"","image_url":"https://images.perthnow.com.au/publication/C-5577287/dee619199a72f8f67d67c9965f44ad96760902e8-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Justin Langer has this morning tendered his resignation”: Justin Langer steps down as Australian cricket team coach on an immediate basis","link":"https://thesportsrush.com/cricket-news-justin-langer-has-this-morning-tendered-his-resignation-justin-langer-steps-down-as-australian-cricket-team-coach-on-an-immediate-basis/","keywords":["Cricket","Australia Cricket","cricket australia","Justn Langer"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Justin Langer has resigned from the position of Australian Cricket Team’s head coach on an immediate basis. In a shocking state of affairs, Justin Langer has stepped down as the coach of the Australian cricket team. The current contract of Langer was set to expire mid-way this season. Although, Fox Cricket reported that Langer had… The post “Justin Langer has this morning tendered his resignation”: Justin Langer steps down as Australian cricket team coach on an immediate basis appeared first on The SportsRush.","content":"Justin Langer has resigned from the position of Australian Cricket Team’s head coach on an immediate basis. In a shocking state of affairs, Justin Langer has stepped down as the coach of the Australian cricket team. The current contract of Langer was set to expire mid-way this season. Although, Fox Cricket reported that Langer had a heated argument with the Cricket Australia board last week. Cricket Australia denied those rumours, but the resignation of Langer has again ignited the topic. According to Fox Cricket, CA met with Langer regarding his future. The CA offered Langer a short-term contract of 15 months. Although, Justin Langer rejected the offer as he sees this as a trial-period offer. For the full four-year contract, it is believed that CA had asked Langer to re-apply for the job again. This was taken in a very angry manner by Langer. Langer said that he won’t re-apply, but he deserves a multi-year deal considering his performances. Justin Langer leaves on an immediate basis The management company of Justin revealed the news via statement. “DSEG confirms that our client Justin Langer has this morning tendered his resignation as coach of the Australian men’s cricket team,” the statement read. DSEG confirms that our client Justin Langer has this morning tendered his resignation as coach of the Australian mens cricket team. The resignation follows a meeting with Cricket Australia last evening. The resignation is effective immediately. — DSEG (@DSEGWorldwide) February 5, 2022 Justin Langer was set to rest for the Sri Lanka T20Is, but there is a Pakistan tour next. The team will leave for Pakistan in three weeks, and the assistant coach Andrew McDonald is set to lead them. Many former cricketers backed Justin Langer to stay, but he has now formally resigned. Just about a few months ago, Justin Langer’s position was under scrutiny. Australia lost to India at home, whereas they also lost on the West Indies and Bangladesh tours. However, winning the T20 Cup raised Langer’s stocks, whereas this Ashes’ win was the cherry on the cake. Langer joined the broken Australian team after the infamous Sand Paper gate incident. After the Ashes, Langer said that he won’t want to leave as well.   The post “Justin Langer has this morning tendered his resignation”: Justin Langer steps down as Australian cricket team coach on an immediate basis appeared first on The SportsRush.","pubDate":"2022-02-05 01:17:38","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Australian men’s cricket coach Justin Langer resigns","link":"https://uk.sports.yahoo.com/news/australian-men-cricket-coach-justin-005313668.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-05 00:53:13","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Aussies claim 3rd in U19 ODI World Cup","link":"https://www.cairnspost.com.au/sport/cricket/aussies-claim-3rd-in-u19-odi-world-cup/video/666ff0a5b23b29ace6ca0f5a45950b26","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia has claimed third place at the u19 ICC ODI World Cup with a thrilling final over victory over Afghanistan.","content":null,"pubDate":"2022-02-05 00:52:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Australia confirm first tour of Pakistan in 24 years","link":"https://www.thenews.com.pk/print/930909-australia-confirm-first-tour-of-pakistan-in-24-years","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Pindi Stadium will host five international matches including the inaugural Test of three-match series of the long-awaited Australian cricket team tour starting from the 27th of this month.Pakistan Cricket Board in coordination with Cricket Australia has revised the already scheduled...","content":null,"pubDate":"2022-02-05 00:51:53","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Cricket: Afghanistan to tour Bangladesh","link":"https://www.thenews.com.pk/print/930914-cricket-afghanistan-to-tour-bangladesh","keywords":null,"creator":null,"video_url":null,"description":"DHAKA: The Afghanistan cricket team will arrive in Bangladesh later this month to play three one-day internationals and two Twenty20 matches, the Bangladesh Cricket Board said as the visitors seek to bolster their 2023 World Cup qualifying bid.Afghanistan sealed a series whitewash of the...","content":null,"pubDate":"2022-02-05 00:51:53","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pakistan finish 5th in U-19 cricket world cup","link":"https://www.thenews.com.pk/print/930919-pakistan-finish-5th-in-u-19-cricket-world-cup","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Captain Qasim Akram led Pakistan to a thumping 238 runs win against Sri Lanka for the fifth position playoff in ICC Under-19 Men’s Cricket World Cup at the Sir Vivian Richards Cricket Ground Antigua.Qasim Akram smashed 135 not out as Pakistan hit up 365 fo 3 in 50 overs and then...","content":null,"pubDate":"2022-02-05 00:51:53","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Gladiators may pick Hamza to replace Hasnain","link":"https://www.thenews.com.pk/print/930908-gladiators-may-pick-hamza-to-replace-hasnain","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Quetta Gladiators are considering picking left-arm pacer Mir Hamza as a replacement for their speedster Mohammad Hasnain who was on Friday suspended after his bowling action was found illegal.Hasnain has been suspended from international cricket and PSL.A source in the Gladiators told...","content":null,"pubDate":"2022-02-05 00:51:53","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Langer resigns as Australia cricket coach","link":"https://www.busseltonmail.com.au/story/7608278/langer-resigns-as-australia-cricket-coach/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-05 00:41:38","full_description":null,"image_url":"https://transform.newsnow.io/transform/v1/crop/frm/silverstone-feed-data/654696cc-a873-4e17-b4a3-285ad183f28d.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail","country":["australia"],"category":["sports"],"language":"english"},{"title":"Justin Langer ‘so happy’ to be home after quitting role as Australian cricket coach","link":"https://thewest.com.au/sport/justin-langer/justin-langer-so-happy-to-be-home-after-quitting-role-as-australian-cricket-coach-c-5576940","keywords":null,"creator":["Joe Spagnolo"],"video_url":null,"description":"Justin Langer has spoken after returning to WA following his decision to quit as head coach of the Australian cricket team.","content":null,"pubDate":"2022-02-05 00:38:43","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5576940/0cfc8212b5874586e2f29ccae90591e21951255f-16x9-x0y235w4503h2533.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"}]}