{"newsArray":[{"title":"The Ashes: Steve Smith on his growth ahead of defining series","link":"https://thewest.com.au/sport/cricket/the-ashes-steve-smith-on-his-growth-ahead-of-defining-series-c-4829637","keywords":null,"creator":["Sam Landsberger"],"video_url":null,"description":"Steve Smith says he has grown a thicker skin to cope with the criticism shadowing his every move as he prepares to become the most hands-on vice-captain Test cricket has ever seen.","content":null,"pubDate":"2021-12-05 23:55:49","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4829637/057803c3978c939e2a6290a7afbc81642b36c112-16x9-x0y432w5568h3132.jpg","source_id":"thewest"},{"title":"‘Get stuffed WA’: Proof state has lost the plot","link":"https://www.cairnspost.com.au/sport/cricket/get-stuffed-wa-shameless-ashes-grab-proves-state-has-officially-lost-the-plot/news-story/b3d3107e0408a83e7294465169d615aa","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Aussie cricket fans have laughed off suggestions from Western Australia it should host the second Ashes Test in a swap with Adelaide despite the state’s tough border restrictions.","content":null,"pubDate":"2021-12-05 23:30:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Sixers embarrass Stars in BBL11 opener","link":"https://www.news.com.au/sport/cricket/sixers-embarrass-stars-in-bbl11-opener/video/43883809d15ad60cf6c63a2bf37548ae","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The Sydney Sixers have kicked off their Big Bash title defence in style with a record 152 run win over the Melbourne Stars at Sydney Cricket Ground.","content":null,"pubDate":"2021-12-05 22:44:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Proof WA has officially lost the plot","link":"https://www.news.com.au/sport/cricket/get-stuffed-wa-shameless-ashes-grab-proves-state-has-officially-lost-the-plot/news-story/b3d3107e0408a83e7294465169d615aa","keywords":null,"creator":null,"video_url":null,"description":"Aussie cricket fans have laughed off suggestions from Western Australia it should host the second Ashes Test in a swap with Adelaide despite the state’s tough border restrictions.","content":null,"pubDate":"2021-12-05 22:13:00","full_description":"Aussie cricket fans have laughed off suggestions from Western Australia it should host the second Ashes Test in a swap with Adelaide despite the state’s tough border restrictions. WA Premier Mark McGowan appeared to crush any hope Perth had of hosting the fifth Ashes Test in January when he said recently all players, staff and broadcast personnel would need to quarantine for 14 days after flying in from Sydney, where the fourth Test is being played. Sport’s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > The final Test of the five-match series at Optus Stadium was originally scheduled to begin on January 14 — just 11 days after the SCG Test begins on January 5 — but widespread reports suggest Cricket Australia will soon announce an alternative venue, either Hobart or another Test in Melbourne, because of logistical difficulties around WA’s border and quarantine regulations. The West Australian reports the WA government is desperate to avoid a second straight summer without a Test match and is considering trying to poach the second Ashes Test from Adelaide, scheduled to get underway on December 16. “If cricket isn’t able to meet our border rules for the fifth Test in Perth, then they should move the second Test to Perth instead,” Perth Sport and Recreation Minister Tony Buti told The West Australian . “It’s a no-brainer. As long as Queensland stays Covid-free then the teams can fly in ahead of the pink ball day-night Test, which is due to start on December 16. “The simple solution would be to bring that Test here while South Australia manages its Covid outbreak. Adelaide can then host the fifth Test originally scheduled for Perth. “They (the teams) could fly straight into Perth after the Brisbane Test. Then no one will need to worry about quarantine and Covid protocols.” McGowan’s approval ratings soared in WA as he oversaw the strictest border closure in the country, but the Premier has come under from those in other states for keeping Australian citizens locked out of the west. It’s why cricket fans can’t believe Perth would make such a brazen bid to steal the second Ashes Test from Adelaide. Cricket writer Daniel Brettig tweeted: “Yeah we can’t host a Test match in mid-January but we’ll try steal the one locked into Adelaide Oval for mid-December and complain when we inevitably don’t get it. Galaxy brain stuff from the WA government #Ashes.” Sports reporter Mark Gottlieb wrote: “‘No brainer’ is the correct description … just the wrong definition.” Journalist James Massola added: “Pretty sure that WA gave up its right to demand Ashes Tests when it stopped being part of Australia.” Broadcast journalist Michael Smyth said: “First we’ll lock you out, then try to nick your Test … Get stuffed WA.” WA want second test and swap it with Adelaide. pic.twitter.com/2nEFghFETl Perth wanting to swap tests with Adelaide. Lol. ð #Ashes pic.twitter.com/VVUJyKUPAE Meanwhile, Australia has confirmed its starting XI for the first Test at the Gabba, beginning on Wednesday. New captain Pat Cummins revealed on the weekend Travis Head had beaten Usman Khawaja for the vacant middle order berth, and Mitchell Starc had fought off competition from West Australian quick Jhye Richardson. The selectors’ decision to pick Starc ahead of Richardson comes after public comments from Aussie legend Shane Warne calling for the left-arm paceman to be dropped . Australia XI for First Ashes Test: Marcus Harris, David Warner, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey (wk), Pat Cummins (c), Mitch Starc, Nathan Lyon, Josh Hazlewood. After a record loss to open the Big Bash season, the Melbourne Stars are hoping for an influx of star power. Missing the first rolling lockout of the KFC SuperCoach BBL season doesn’t have to mean you miss out on the prizes — here are four teams you could still choose packed full of stars. The opening match of the Big Bash League season has been a diabolical disaster for the Melbourne Stars as records were crushed.","image_url":null,"source_id":"news"},{"title":"Yorkshire set to appoint Darren Gough as new director of cricket following exodus of staff in wake of Azeem Rafiq racism row","link":"https://talksport.com/sport/cricket/996452/yorkshire-darren-gough-azeem-rafiq-racism-row/","keywords":["Cricket","Sport","Yorkshire"],"creator":["Oliver Dawnay"],"video_url":null,"description":"Darren Gough will be named Yorkshire’s new director of Cricket on Monday, talkSPORT understands. The 51-year-old has been a regular on the talkSPORT airwaves since retiring in 2008, but has always retained ambitions to coach since retiring in 2008. A Yorkshire man born and bred, the former England seamer spent 15 years on the playing […]","content":"Darren Gough will be named Yorkshire’s new director of Cricket on Monday, talkSPORT understands. The 51-year-old has been a regular on the talkSPORT airwaves since retiring in 2008, but has always retained ambitions to coach since retiring in 2008. Goughie looks set to be handed the reins at his former clubGETTY A Yorkshire man born and bred, the former England seamer spent 15 years on the playing staff at Headingley across two spell and is understood to be viewed as the ideal figurehead for the club in light of the Azeem Rafiq racism scandal. His arrival comes after the majority of the club’s staff were let go. Yorkshire’s long-serving director of cricket Martyn Moxon and head coach Andrew Gale became the latest high-profile departures earlier this week. Their departures follow those of club president Roger Hutton, who stepped down on November 5, and chief executive Mark Arthur, who resigned a week later following widespread condemnation of Yorkshire over its handling of a racism investigation and the treatment of former player Rafiq. Goughie has been a talkSPORT regular for several years Both Moxon and Gale were heavily criticised at the Department for Culture, Media and Sport (DCMS) hearing at Westminster while Rafiq repeated his call for them to step down from their roles at the club. Gough was made an MBE for services to cricket and charity last year. He played 58 Test matches for England between 1994 and 2003. He took 229 wickets at an average of 28.39. His white-ball career went through to 2006 and saw him take 235 one-day international wickets at 26.42.","pubDate":"2021-12-05 22:07:47","full_description":"Darren Gough will be named Yorkshire’s new director of Cricket on Monday, talkSPORT understands. The 51-year-old has been a regular on the talkSPORT airwaves since retiring in 2008, but has always retained ambitions to coach since retiring in 2008. A Yorkshire man born and bred, the former England seamer spent 15 years on the playing staff at Headingley across two spell and is understood to be viewed as the ideal figurehead for the club in light of the Azeem Rafiq racism scandal. His arrival comes after the majority of the club’s staff were let go. Yorkshire’s long-serving director of cricket Martyn Moxon and head coach Andrew Gale became the latest high-profile departures earlier this week. Their departures follow those of club president Roger Hutton, who stepped down on November 5, and chief executive Mark Arthur, who resigned a week later following widespread condemnation of Yorkshire over its handling of a racism investigation and the treatment of former player Rafiq. Both Moxon and Gale were heavily criticised at the Department for Culture, Media and Sport (DCMS) hearing at Westminster while Rafiq repeated his call for them to step down from their roles at the club. Gough was made an MBE for services to cricket and charity last year. He played 58 Test matches for England between 1994 and 2003. He took 229 wickets at an average of 28.39. His white-ball career went through to 2006 and saw him take 235 one-day international wickets at 26.42.","image_url":null,"source_id":"talksport"},{"title":"NSD vs UDK Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Inter District T20 2021, Match 28","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nsd-vs-udk-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-inter-district-t20-2021-match-28?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-05 19:14:56","full_description":"Nadia Super Dazzlers will take on Uttar Dinajpur Kulik Bird in the 28th match of the Bengal Inter District T20 2021 at the Bengal Cricket Academy Ground in Kalyani on Monday. This game will be crucial for both the teams as their fates are dependent on the result of this match. Nadia Super Dazzlers and Uttar Dinajpur Kulik Bird can both book a quarter-final spot with a win in this game. Nadia have won two games and they are on top of Group B with 10 points. Meanwhile, Uttar Dinajpur began their campaign with two wins on the trot. However, a 29-run loss to Hooghly Rivers has left them desperate, needing a win in this game. NSD XI Soumyajit Roy, Arnab Sikdar, Amit Santra, Ayan Gupta, Tapan Koiri, Arupkumar Saha, Rakesh Dutta (wk), Raj Kumar Pal (c), Sanjoy Sadhukhan, Soumodip Bagchi, Susanta Das UDK XI Aniket Jha, Debasish Saha (c), Satu Chowdhury, Rabi Sankar Prasad, Debayan Kiskoo, Arnab Mondal, Narayan Rana, Anup Sanyashi, Sandip Baishnab, Nabhnil Saha, Bibek Das NSD vs UDK, Bengal Inter District T20 2021, Match 28 Date and Time: December 6, 2021, 12:45 PM IST Venue: Bengal Cricket Academy Ground, Kalyani The surface was initially favorable for the bowlers. However, it’s getting better to bat on with time. One can expect healthy competition between bat and ball on this pitch. The team winning the toss should choose to bat first. Wicketkeeper D Saha is a great wicketkeeper choice for your Dream11 fantasy side. He has been consistent in all three matches so far and will be looking for another big knock here. Batters A Gupta is an important batter for Nadia Super Dazzlers. Gupta is also capable of doing well with the ball. Gupta has been fantastic over the last couple of matches. In the last game, he scored 88 runs in just 40 balls and also picked up a wicket. R Sankar Prasad has been outstanding for Uttar Dinajpur Kulik Bird in the competition. He has scored 58 runs with the bat and has also taken six wickets. He will be a wise captaincy choice for your NSD vs UDK Dream11 fantasy side. All-rounders S Chowdhury has plenty of experience and he’s an excellent all-round asset. Chowdhury has scored 59 runs and has also taken three wickets so far. S Roy is another player you must have in your Dream11 fantasy side. He picked up two wickets in the last game and will be looking at a better outing with the bat. Bowlers N Rana has also enjoyed tremendous success with the ball. He has scalped three wickets so far. R Sankar Prasad (UDK) – 264 points A Gupta (NSD) – 234 points N Rana (UDK) – 178 points S Chowdhury (UDK) – 165 points R Kumar Pal (NSD) – 147 points R Sankar Prasad: 58 runs and 6 wickets A Gupta: 88 runs and 3 wickets N Rana: 35 runs and 3 wickets S Chowdhury: 59 runs and 3 wickets R Kumar Pal: 3 wickets Fantasy Suggestion #1: D Saha, R Sankar Prasad, A Gupta, A Jha, S Chowdhury, S Roy, B Das, A Sikdar, N Rana, R Kumar Pal, S Bagchi Captain: R Sankar Prasad , Vice-Captain: A Gupta Fantasy Suggestion #2: D Saha, R Sankar Prasad, A Gupta, A Jha, A Santra, S Chowdhury, S Roy, B Das, N Rana, R Kumar Pal, S Bagchi Captain: S Chowdhury , Vice-Captain: S Roy.","image_url":"https://static.sportskeeda.com/editor/2021/12/463fa-16387237568309-1920.jpg","source_id":"sportskeeda"},{"title":"BCCI Keen On Replacing Virat Kohli With Rohit Sharma As The Indian ODI Captain- Reports - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMikgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vbmV3LXplYWxhbmQtdG91ci1vZi1pbmRpYS0yMDIxL2JjY2kta2Vlbi1vbi1yZXBsYWNpbmctdmlyYXQta29obGktd2l0aC1yb2hpdC1zaGFybWEtYXMtdGhlLWluZGlhbi1vZGktY2FwdGFpbi1yZXBvcnRzL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"BCCI Keen On Replacing Virat Kohli With Rohit Sharma As The Indian ODI Captain- Reports  Cricket AddictorSA Team Selection: Virat's ODI captaincy, Ishant's place in Test, back-up No. 3 up for discussion  Times of IndiaIndia's Tour To South Africa Gets BCCI's Nod | The Omicron Threat  India TodayIndia vs South Africa: India's Test Squad vs South Africa (Predicted)  Cricket AddictorBCCI confirms revised South Africa itinerary, govt advisory awaited  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2021-12-05 16:47:53","image_url":null,"source_id":"google"},{"title":"Mumbai Test: Tough to bounce back after being bowled out for 62 but we'll keep fighting, says Rachin Ravindra - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMirQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L211bWJhaS10ZXN0LXRvdWdoLXRvLWJvdW5jZS1iYWNrLWFmdGVyLWJlaW5nLWJvd2xlZC1vdXQtZm9yLTYyLWJ1dC13ZS1sbC1rZWVwLWZpZ2h0aW5nLXNheXMtcmFjaGluLXJhdmluZHJhLTE4ODQ0MzYtMjAyMS0xMi0wNdIBsQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2FtcC9zcG9ydHMvY3JpY2tldC9zdG9yeS9tdW1iYWktdGVzdC10b3VnaC10by1ib3VuY2UtYmFjay1hZnRlci1iZWluZy1ib3dsZWQtb3V0LWZvci02Mi1idXQtd2UtbGwta2VlcC1maWdodGluZy1zYXlzLXJhY2hpbi1yYXZpbmRyYS0xODg0NDM2LTIwMjEtMTItMDU?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Mumbai Test: Tough to bounce back after being bowled out for 62 but we'll keep fighting, says Rachin Ravindra  India TodayMumbai Test: Why NZ did not fold out in the second innings as they had in the first  The Indian Express2nd Test: India push for victory in second Test versus New Zealand after Ajaz Patel record  Hindustan TimesIND vs NZ, 2nd Test: Tough to Bounce Back After Being Bowled Out for 60-odd, Says Rachin Ravindra  News18New Zealand bundled out for 62: A look at lowest totals by Kiwis against India in Test cricket  WIONView Full coverage on Google News","content":null,"pubDate":"2021-12-05 15:59:26","image_url":null,"source_id":"google"},{"title":"Cricket-Windies white-ball captain Pollard ruled out of Pakistan tour","link":"https://www.thestar.com.my/sport/cricket/2021/12/05/cricket-windies-white-ball-captain-pollard-ruled-out-of-pakistan-tour","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - West Indies' white-ball captain Kieron Pollard has been ruled out of the side's tour of Pakistan this month after failing to recover from the hamstring injury he suffered during the Twenty20 World Cup. Read full story","content":null,"pubDate":"2021-12-05 15:42:00","full_description":"(Reuters) - West Indies' white-ball captain Kieron Pollard has been ruled out of the side's tour of Pakistan this month after failing to recover from the hamstring injury he suffered during the Twenty20 World Cup. West Indies will play three T20s and three 50-over matches in Pakistan starting on Dec. 13 in what will be the first visit by an international side since England and New Zealand pulled out of scheduled tours this year for security reasons. \"Pollard will undergo rehabilitation work in Trinidad ... and will be reassessed in a few weeks ahead of the upcoming home tours against Ireland and England in January 2022,\" Cricket West Indies said in a statement on Sunday. West Indies, who failed to reach the T20 World Cup semi-finals, have picked several uncapped players in two 15-man squads for the tour of Pakistan. Nicholas Pooran will lead the Caribbean side in the T20s while Shai Hope will captain the team in the 50-over matches. (Reporting by Sudipto Ganguly in Mumbai; editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/05/1394093.jpg","source_id":"thestar_my"},{"title":"Watch | Axar Patel: Good to dominate in a home Test","link":"https://sportstar.thehindu.com/cricket-videos/india-vs-new-zealand-axar-patel-on-declaration-home-test-performance-all-rounder-post-match-press-conference/article37855081.ece","keywords":null,"creator":["Team Sportstar"],"video_url":null,"description":"Axar Patel on the timing of India's declaration, dominating the World Test Champion New Zealand in a home Test and his evolution as an all-rounder in international cricket.","content":null,"pubDate":"2021-12-05 14:51:58","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Cricket fraternity extends warm wishes to Shikhar Dhawan on his 36th birthday","link":"https://www.sportskeeda.com/cricket/news-the-cricket-fraternity-extends-warm-wishes-to-shikhar-dhawan-on-36th-birthday?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Balakrishna"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-05 13:18:02","full_description":"The cricket community extended its warm wishes to Indian opener Shikhar Dhawan as he turned 36 on Sunday. Dhawan was last seen on the cricket field during IPL 2021 when he opened the innings for the Delhi Capitals. Dhawan has been overlooked for the Indian T20 team even though he has performed phenomenally in the IPL over the last few years. The emergence of younger, more aggressive opening batters like KL Rahul and Ishan Kishan has been the prime reason behind the snubbing of Dhawan in the T20I format. However, the veteran batter is still the first choice opener in one-day internationals. Shikhar Dhawan's former and current teammates were quick to wish him a happy birthday through their official social media handles. Prithvi Shaw , his opening partner at the Delhi Capitals, led the wishes by posting a special message on Instagram. Soon, other cricketers joined Shaw in wishing 'Gabbar' a wonderful birthday. Instagram Post Delhi Capitals recently released Shikhar Dhawan from their squad ahead of the mega auction as they opted to retain Prithvi Shaw, Rishabh Pant, Axar Patel and Anrich Nortje . Dhawan has had a stellar record in the IPL in the last few seasons, which makes him a potentially hot commodity in the upcoming mega auction. Former Indian batter Aakash Chopra also echoed similar views as he believes multiple teams will be vying for an opportunity to sign the 36-year-old at the auction. Shikhar Dhawan was the fourth-highest run-scorer in IPL 2021. He amassed 587 runs across 16 games at an average of 39.13 and played a vital role in the Delhi Capitals campaign this season.","image_url":"https://static.sportskeeda.com/editor/2021/12/8197f-16387074335523-1920.jpg","source_id":"sportskeeda"},{"title":"India vs New Zealand, 2nd Test: Ravichandran Ashwin Turns It On As India Aim For Four Day Finish - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZGlhLXZzLW5ldy16ZWFsYW5kLTJuZC10ZXN0LXJhdmljaGFuZHJhbi1hc2h3aW4tdHVybnMtaXQtb24tYXMtaW5kaWEtYWltLWZvci1mb3VyLWRheS1maW5pc2gtMjYzODEwOdIBngFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZGlhLXZzLW5ldy16ZWFsYW5kLTJuZC10ZXN0LXJhdmljaGFuZHJhbi1hc2h3aW4tdHVybnMtaXQtb24tYXMtaW5kaWEtYWltLWZvci1mb3VyLWRheS1maW5pc2gtMjYzODEwOS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 2nd Test: Ravichandran Ashwin Turns It On As India Aim For Four Day Finish  NDTVSports.comThese kind of things probably don't sink in till much later: Ajaz Patel  CricbuzzAshwin Took a Review After Getting Clean Bowled and Fans Had a Field Day With Memes  News18More destiny than planning: Anil Kumble | Cricket News  Times of IndiaMy name will definitely be going up on the Honours Board now - Ajaz Patel | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-05 12:55:00","image_url":null,"source_id":"google"},{"title":"GG vs JK Dream11 Team Prediction Lanka Premier League T20 Match 1: Captain, Fantasy Cricket Hints, Probable Playing 11s- Galle Gladiators vs Jaffna Kings, Team News For Today’s T20 at R Premadasa Stadium at 7:30 PM IST December 5 Sunday","link":"https://zeenews.india.com/cricket/gg-vs-jk-dream11-team-prediction-lanka-premier-league-t20-match-1-captain-fantasy-cricket-hints-probable-playing-11s-galle-gladiators-vs-jaffna-kings-team-news-for-today-s-t20-at-r-premadasa-stadium-at-730-pm-ist-december-5-sunday-2416366.html","keywords":null,"creator":null,"video_url":null,"description":"Galle Gladiators vs Jaffna Kings Dream11 Team Prediction Lanka Premier League T20 - Check My Dream11 Team, Best players list of GG vs JK, Lanka Premier League T20, Jaffna Kings Dream11 Team Player List, Galle Gladiators Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips Galle Gladiators vs Jaffna Kings, Fantasy Cricket Tips Galle Gladiators vs Jaffna Kings LPL T20, Fantasy Playing Tips - Lanka Premier League T20.","content":null,"pubDate":"2021-12-05 12:43:00","full_description":"GG vs JK Dream11 Team Prediction Galle Gladiators vs Jaffna Kings Final 2021: Galle Gladiators vs Jaffna Kings Dream11 Team Prediction Lanka Premier League T20- Fantasy Playing Tips, Captain, Probable XIs For Today’s GG vs JK at R.Premadasa Stadium: In the season-opening contest of Lanka Premier League T20 tournament, defending champions Jaffna Kings will take on Galle Gladiators at the R.Premadasa Stadium on Sunday. The Lanka Premier League T20 GG vs JK match will start at 7:30 PM IST – December 5. Stallions take on a strong Galle Gladiators side who have several explosive players in their ranks. MATCH DETAILS TOSS: The Lanka Premier League T20 toss between Jaffna Kings and Galle Gladiators will take place at 7 PM IST – December 5. Time: 7:30 PM IST. Venue: R.Premadasa Stadium. GG vs JK My Dream11 Team Krishan Arachchige, Danushka Gunathilaka, Bhanuka Rajapaksa (vc), Kusal Mendis, Avishka Fernando (C), Thisara Perera, Pulina Tharanga, Isuru Udana, Usman Khan Shinwari, Tabraiz Shamsi, Maheesh Theekshana. GG vs JK Probable Playing XIs Galle Gladiators: Bhanuka Rajapaksa (C), Danushka Gunathilaka, Kusal Mendis, Mohammad Hafeez, Sarfaraz Ahmed (wk), Samit Patel, Tabraiz Shamsi, Dhananjaya Lakshan, Dilshan Madushanka, Mohammad Amir and Kevin Koththigoda. Jaffna Kings: Rahmanullah Gurbaz (wk), Upul Tharanga, Avishka Fernando, Shoaib Malik, Thisara Perera (C), Wanindu Hasaranga, Suranga Lakmal, Chaturanga de Silva, Vijayakanth Viyaskanth, Wahab Riaz and Maheesh Theekshana. GG vs JK Squads Galle Gladiators: Kusal Mendis, Angelo Jayasinghe, Bhanuka Rajapaksa (Captain), Sarfaraz Ahmed (wk), Danushka Gunathilaka, Dhananjaya Lakshan, Lahiru Madushanka, Mohammed Shamaaz, Suminda Lakshan, Tabraiz Shamsi, Anwar Ali, Pulina Tharanga, Nuwan Thushara, Dilshan Madushanka, Ashian Daniel, Kevin Koththigoda. Jaffna Kings: Avishka Fernando, Ashan Randika, Shoaib Malik, Chaturanga de Silva, Thisara Perera (Captain), Krishan Arachchige (wk), Suranga Lakmal, Usman Shinwari, Shammu Ashan, Ashen Bandara, Praveen Jayawickrama, Vijayakanth Viyaskanth, Jayden Seales, Maheesh Theekshana, Theivendiram Dinoshan, Chamika Gunasekara, Rathnaraja Thanuradan. Check Dream11 Prediction/ JK Dream11 Team/ GG Dream11 Team/ Jaffna Kings Dream11 Team Prediction/ Galle Gladiators Dream11 Team Prediction/ Dream11 Guru Tips – Lanka Premier League T20/ Fantasy Cricket Tips and more.","image_url":null,"source_id":"zeenews"},{"title":"'Biggest waste of time': England's former Ashes hero Kevin Pietersen reacts to West Ham stat","link":"https://www.hitc.com/en-gb/2021/12/05/west-ham-kevin-pietersen-corners/","keywords":["Competitions","Football","Premier League","Teams","West Ham United","kevin pietersen"],"creator":["Olly Dawes"],"video_url":null,"description":"West Ham United beat Chelsea 3-2 on Saturday afternoon – but Kevin Pietersen is baffled by their goalscoring record from corners. We’re just days away... The post 'Biggest waste of time': England's former Ashes hero Kevin Pietersen reacts to West Ham stat appeared first on HITC.","content":"Photo by Ashley Allen – ECB/ECB via Getty Images West Ham United beat Chelsea 3-2 on Saturday afternoon – but Kevin Pietersen is baffled by their goalscoring record from corners. We’re just days away from the start of The Ashes as England head to Australia in an attempt to win back the urn. Many have become heroes for England in the past with outstanding Ashes displays, and Pietersen was one of them. From his his almost brash 2005 debut to the domination of the 2010/11 tour, Pietersen has been a gold standard for Ashes batting since the turn of the century. What If Adama Traore Had END PRODUCT?! Football Manager 2022 ExperimentBridTV7046What If Adama Traore Had END PRODUCT?! Football Manager 2022 Experiment913427913427centerUCsIwxKQajD9zPQA4SufVXggElecspo (Youtube)https://yt3.ggpht.com/a/AATXAJxUznA4lOkmaqkQUT9LEkoByQ5fpNm5IHUYaw=s800-c-k-c0xffffffff-no-rj-mo13872 Despite being just days away from the start of the Ashes, Pietersen has been offering his take on football rather than cricket. Pietersen comments on West Ham corner record West Ham are the Premier League’s most dangerous team from set pieces, but didn’t need to score from them to beat Chelsea. Still, Pietersen saw that West Ham boast the Premier League’s best record for scoring from corners this season. Photo by Jacques Feeney/Offside/Offside via Getty Images West Ham have scored six times from corners this season, which is pretty good for this stage of the campaign. Pietersen wasn’t impressed though, suggesting that corners are the ‘biggest waste of time in football’. Pietersen seemingly feels that, given the number of corners taken, six goals show it’s an inefficient attacking method. David Moyes would likely disagree, and so did many West Ham fans in the replies to Pietersen’s tweet. Just seen a stat that says West Ham have scored the most goals from corners this season – 6! 6???????????? How many corners have been taken?! The biggest waste of time in football! Nothing attacking about it!— Kevin Pietersen (@KP24) December 4, 2021 Photo by Alex Pantling/Getty Images The post 'Biggest waste of time': England's former Ashes hero Kevin Pietersen reacts to West Ham stat appeared first on HITC.","pubDate":"2021-12-05 12:32:00","full_description":null,"image_url":null,"source_id":"hitc"},{"title":"IND vs NZ: India on cusp of series win as NZ continue to struggle on Day 2","link":"https://zeenews.india.com/cricket/ind-vs-nz-india-on-cusp-of-series-win-as-nz-continue-to-struggle-on-day-2-2416362.html","keywords":null,"creator":null,"video_url":null,"description":"What will hurt New Zealand team most in this defeat is the fact that this is the game where one of its own — Ajaz Patel, equalled the world record and grabbed a match-haul of 14 wickets, something that no one has ever done against India in Test cricket.","content":null,"pubDate":"2021-12-05 12:24:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"BAN vs PAK: Shakib Al Hasan enjoys on wet covers after play gets called off due to rain","link":"https://zeenews.india.com/cricket/ban-vs-pak-shakib-al-hasan-enjoys-on-wet-covers-after-play-gets-called-off-due-to-rain-2416356.html","keywords":null,"creator":null,"video_url":null,"description":"Persistent rain and a wet outfield ensured only 6.2 overs were bowled on day two of the second Test between Bangladesh and Pakistan at the Sher-e-Bangla National Cricket Stadium, here on Sunday.","content":null,"pubDate":"2021-12-05 11:52:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Bangladesh v Pakistan: Rain limits play on Day 2 of 2nd test","link":"https://www.indiatvnews.com/sports/cricket/bangladesh-v-pakistan-rain-limits-play-on-day-2-of-2nd-test-ban-vs-pak-748214","keywords":null,"creator":null,"video_url":null,"description":"The majority of play on day two of the second cricket test between Bangladesh and Pakistan was washed out due to persistent rain on Sunday.","content":null,"pubDate":"2021-12-05 11:49:52","full_description":"The majority of play on day two of the second cricket test between Bangladesh and Pakistan was washed out due to persistent rain on Sunday. Just 6.2 overs from a possible 98 were possible as Pakistan resumed the day on 161-2 and reached 188-2 before the umpires called it a day. Skipper was batting on 71 with Azhar Ali on 52 at stumps. Rain and bad light also interrupted the game on day one, allowing just two sessions. As the game started after the lunch session on Sunday, Babar resumed with a boundary through fine leg off pacer Khaled Ahmed, showing his intention to score quick runs. Azhar also hit a boundary in the second ball he faced off pacer Ebadot Hossain. He then struck two consecutive fours in Ebadot’s next over to reach his 34th test fifty off 126 balls just before rain forced the postponement. Left-arm spinner Taijul Islam, who didn’t bowl on day two, remains Bangladesh's biggest threat with match figures of 2-49. Pakistan won the first test by eight wickets and leads the two-match series 1-0.","image_url":null,"source_id":"indiatvnews"},{"title":"X factor in BBL: What is X factor subs in BBL? How many substitutes can be made in a Big Bash League match?","link":"https://thesportsrush.com/cricket-news-x-factor-in-bbl-what-is-x-factor-subs-in-bbl-how-many-substitutes-can-be-made-in-a-big-bash-league-match/","keywords":["Cricket","BBL 11","Big Bash League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"X factor in BBL: X-factor substitute was among the three new innovative rule changes made to the Big Bash League last year. During the first match of the ongoing 11th season of the Big Bash League between Sydney Sixers and Melbourne Stars in Sydney, defending champions Sydney Sixers have registered a thumping victory in the… The post X factor in BBL: What is X factor subs in BBL? How many substitutes can be made in a Big Bash League match? appeared first on The SportsRush.","content":"X factor in BBL: X-factor substitute was among the three new innovative rule changes made to the Big Bash League last year. During the first match of the ongoing 11th season of the Big Bash League between Sydney Sixers and Melbourne Stars in Sydney, defending champions Sydney Sixers have registered a thumping victory in the tournament opener. In what is a 152-run win at the Sydney Cricket Ground, it is the biggest-ever victory (by margin of runs) in the Big Bash League. Chasing a mammoth 214-run target, all Stars could manage was 61/10 in 11,1 overs as veteran spinner Steve O’Keefe registered match-winning bowling figures of 4-0-14-4. Asked to bat first by Stars captain Glenn Maxwell (5) in the first innings, Sixers put on board a formidable 213/4 in 20 overs on the back of individual half-centuries from wicket-keeper batter Josh Philippe (83) and captain Moises Henriques (76*). No team has ever lost a Big Bash match by 150+ runs and come back to win the tournament. #BBL11 — Scott Bailey (@ScottBaileyAAP) December 5, 2021 What is X factor in BBL? Fans must have noticed both the teams had named a couple of players each as their “X-factor” substitutes in addition to their respective Playing XIs during the bat flip. While the two players for Sixers were pacer Nick Winter and Benjamin Manenti, Stars had named spinners Clint Hinchliffe and Tom O’Connell as their potential substitutes. Readers must note that X-factor rule was among the three innovative rules introduced in the Big Bash League last year. The rule is a modified version of the ‘Super Sub’ rule which was introduced in international cricket a decade-and-a-half ago. According to BBL’s X-factor rule, captains submit two more names in addition to their respective Playing XIs. At the 10-over mark of the first innings, each team has an option of swapping one out of the aforementioned two players as their ‘X-factor’ player. ALSO READ: What is Power Surge in Big Bash League? Having said that, the same doesn’t mean that anyone from the Playing XI can be substituted. For teams batting first, batters who would be batting at the 10-over mark or have been dismissed before it can’t be substituted. Only the batters who are yet to bat by the 10th over can be substituted. For teams bowling first, only bowlers who have bowled a solitary over by the 10-over mark will be allowed to substitute. Anyone with more than one over to his name wouldn’t be allowed to be swapped. The post X factor in BBL: What is X factor subs in BBL? How many substitutes can be made in a Big Bash League match? appeared first on The SportsRush.","pubDate":"2021-12-05 11:49:10","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Young guns guide Norths to Cricket Far North title","link":"https://www.cairnspost.com.au/sport/cfn-backyard-bowling-machine-helps-toshach-lift-game/news-story/75ec09f489a586fb5dded90d4395a2d6","keywords":["Cairns News and Galleries","Cairns Post","Local Cricket","Sport","Sport news and galleries","Top News"],"creator":null,"video_url":null,"description":"An unbeaten 46-run stand between teenage talents Elisha Ayson and Jesleen Patel led Norths to a six-wicket victory against Mulgrave in Sunday’s Cricket Far North Ladies 30 Overs grand final at Griffiths Park.","content":null,"pubDate":"2021-12-05 11:41:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"BAN vs PAK: Rain washes out most of Day 2 action with Pakistan 188/2","link":"https://zeenews.india.com/cricket/ban-vs-pak-rain-washes-out-most-of-day-2-action-with-pakistan-188/2-2416350.html","keywords":null,"creator":null,"video_url":null,"description":"The majority of play on day two of the second cricket test between Bangladesh and Pakistan was washed out due to persistent rain on Sunday.","content":null,"pubDate":"2021-12-05 11:06:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Shakib Al Hasan slide video: Bangladeshi all-rounder slides on wet covers on a rainy day in viral video","link":"https://thesportsrush.com/cricket-news-shakib-al-hasan-slide-video-bangladeshi-all-rounder-slides-on-wet-covers-on-a-rainy-day-in-viral-video/","keywords":["Cricket","Bangladesh","Pakistan","Pakistan tour of Bangladesh 2021","Shakib Al Hasan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Shakib Al Hasan slide: The Bangladeshi all-rounder appeared to be enjoying his time after play was suspended due to rain on Day 2. As was the case on Day 1, Day 2 of the second Test of the ongoing Pakistan’s tour of Bangladesh in Mirpur has also been severely affected by inclement weather conditions. Persistent… The post Shakib Al Hasan slide video: Bangladeshi all-rounder slides on wet covers on a rainy day in viral video appeared first on The SportsRush.","content":"Shakib Al Hasan slide: The Bangladeshi all-rounder appeared to be enjoying his time after play was suspended due to rain on Day 2. As was the case on Day 1, Day 2 of the second Test of the ongoing Pakistan’s tour of Bangladesh in Mirpur has also been severely affected by inclement weather conditions. Persistent rain throughout the day allowed only 38 balls to be bowled in the afternoon session. After multiple delays in inspections and start of plays, umpires had decided to conduct a brief period of play before the tea break. Post the tea break, players were expected to play for four hours to complete a total of 66 overs on Day 2. Having said that, rain gods forced players to take an early tea break and then prevented them from coming out to play in the evening session. Much like his captain Babar Azam, veteran Pakistan batter Azhar Ali also completed his half-century as the visitors scored 27 runs today. Other than numerous fans, the senior Pakistani duo would also be hoping for rain to allow players to take the field on Day 3. As far as the highlight of the day is concerned, Bangladesh all-rounder Shakib Al Hasan somewhat attempted to make up for the lack of on-field entertainment. After the play was called-off for the day in the afternoon, a childlike Shakib ran towards wet covers only to slide on them and splash water. Shakib, who pulled off a smooth slide atop the covers, seemed quite ecstatic after executing the move at the Shere Bangla National Stadium today. In the 15 overs that Shakib has bowled in this match so far, he has given away 33 runs without picking a wicket. Shakib Al Hasan slide on wet covers after play was called-off on Day 2 Excitement when the play is officially called off for the day @Sah75official #BANvPAK pic.twitter.com/4ewyRqM23u — Sikandar Bakht (@ImSikandarB) December 5, 2021 For more cricket-related news, click here. The post Shakib Al Hasan slide video: Bangladeshi all-rounder slides on wet covers on a rainy day in viral video appeared first on The SportsRush.","pubDate":"2021-12-05 10:56:44","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Ashes 2021-22: Australia set to play Head and Starc in opening Test at GABBA","link":"https://www.indiatvnews.com/sports/cricket/ashes-2021-22-australia-set-to-play-travis-head-and-mitchell-starc-in-opening-test-at-gabba-confirms-captain-pat-cummins-748205","keywords":null,"creator":null,"video_url":null,"description":"New Australia captain Pat Cummins has confirmed batsman Travis Head and fast bowler Mitchell Starc will play in the first Ashes cricket Test. Cummins said that Head is set to be picked ahead of Usman Khawaja in this week's first Ashes Test at the Gabba, while the early call on left-arm quick Mitchell Starc, as a new ball bowler, means the hosts have now settled on a line-up well ahead of Wednesday's toss.","content":null,"pubDate":"2021-12-05 10:26:17","full_description":"New Australia captain has confirmed batsman Travis Head and fast bowler Mitchell Starc will play in the first Ashes cricket Test. Cummins said that Head is set to be picked ahead of in this week's first Ashes Test at the Gabba, while the early call on left-arm quick Mitchell Starc, as a new ball bowler, means the hosts have now settled on a line-up well ahead of Wednesday's toss. “It was a tight one, the selectors make the call, but both are really good options, with really strong form,” said Cummins at a pre-Series media event with both team captains on Sunday. “Experience is great from Uzzie (Khawaja) and we're really lucky to have that in the squad.\" \"But Trav's been playing a lot for us the last couple of years, churned out runs in England and Australia and is ready to go.” Cummins said he was leaning towards allowing Starc - who held his place in Australia's bowling quartet ahead of and Michael Neser - to join Josh Hazelwood as the new ball pairing in Brisbane. “No (I haven't decided) is the honest answer; I probably won't (open) first-up, but we've been quite fluid in recent years, pending the situation,” Cummins said. “Maybe (I will if it's) late in the day and with only a couple of overs to bowl and I feel I want to have a crack.” “Starcy's great .. we knew we had three weeks building up and he's been building up nicely, he was fast (in training on Saturday), swinging the ball big,” Cummins said. Head had lost his place in the side to Matthew Wade but he was recalled for the tour of South Africa that was subsequently called off due to COVID-19. England captain was less forthcoming about England's lineup as it attempts to win its first series in Australia since 2011. Root admitted he is yet to settle on his side and whether he would select an all-out pace attack at the pace-friendly Gabba and leave out spinner Jack Leach.","image_url":null,"source_id":"indiatvnews"},{"title":"Birthday wishes pour in for Shikhar Dhawan","link":"https://timesofindia.indiatimes.com/sports/off-the-field/birthday-wishes-pour-in-for-shikhar-dhawan/articleshow/88105152.cms","keywords":null,"creator":null,"video_url":null,"description":"International Cricket Council (ICC) extended birthday greetings to India batter Shikhar Dhawan as he turned 36 on Sunday.","content":null,"pubDate":"2021-12-05 10:25:41","full_description":null,"image_url":null,"source_id":"toi"},{"title":"Henriques brings up the half century","link":"https://www.news.com.au/sport/cricket/henriques-brings-up-the-half-century/video/a870db56c4e592d1249e66114e8972ea","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Sydney Sixers star Moses Henriques has managed tp slam a big six on opening night to bring up 50 runs against the stars.","content":null,"pubDate":"2021-12-05 10:16:08","full_description":null,"image_url":null,"source_id":"news"},{"title":"Stars let one fall out of the sky","link":"https://www.news.com.au/sport/cricket/stars-let-one-fall-out-of-the-sky/video/01c5baa2fe9a1ecc782e42b1665e19e8","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The Melbourne Stars have let a certain catch go begging in their opening game against the Sydney Sixers.","content":null,"pubDate":"2021-12-05 09:56:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Stars let one fall out of the sky","link":"https://www.cairnspost.com.au/sport/cricket/stars-let-one-fall-out-of-the-sky/video/01c5baa2fe9a1ecc782e42b1665e19e8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Melbourne Stars have let a certain catch go begging in their opening game against the Sydney Sixers.","content":null,"pubDate":"2021-12-05 09:56:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Rain interrupts Bangladesh-Pakistan Test","link":"https://www.perthnow.com.au/sport/cricket/rain-interrupts-bangladesh-pakistan-test-c-4825266","keywords":null,"creator":["AAP"],"video_url":null,"description":"Rain has washed out most of the second day's play in the cricket Test between Bangladesh and Pakistan in Dhaka.","content":null,"pubDate":"2021-12-05 09:52:13","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4825266/0a1c6b78ec560c5dba13a128da72031bfa6860c8-16x9-x0y75w800h450.jpg","source_id":"perthnow"},{"title":"Rain interrupts Bangladesh-Pakistan Test","link":"https://thewest.com.au/sport/cricket/rain-interrupts-bangladesh-pakistan-test-c-4825256","keywords":null,"creator":["AAP"],"video_url":null,"description":"Rain has washed out most of the second day's play in the cricket Test between Bangladesh and Pakistan in Dhaka.","content":null,"pubDate":"2021-12-05 09:51:49","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4825256/0a1c6b78ec560c5dba13a128da72031bfa6860c8-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"India vs New Zealand, 2nd Test: New Zealand's Ajaz Patel Registers Massive Test Record Against India.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZC12cy1uei0ybmQtdGVzdC1hamF6LXBhdGVsLXJlZ2lzdGVycy1tYXNzaXZlLXRlc3QtcmVjb3JkLWFnYWluc3QtaW5kaWEtMjYzNzk1N9IBiQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pbmRpYS12cy1uZXctemVhbGFuZC0yMDIxL2luZC12cy1uei0ybmQtdGVzdC1hamF6LXBhdGVsLXJlZ2lzdGVycy1tYXNzaXZlLXRlc3QtcmVjb3JkLWFnYWluc3QtaW5kaWEtMjYzNzk1Ny9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs New Zealand, 2nd Test: New Zealand's Ajaz Patel Registers Massive Test Record Against India..  NDTVSports.comThese kind of things probably don't sink in till much later: Ajaz Patel  CricbuzzAshwin calls for review after being clean bowled  Deccan HeraldWatch: Virat Kohli And Rahul Dravid Walk To The New Zealand Dugout To Congratulate Ajaz Patel After Stumps On Day 2  Cricket AddictorMy name will definitely be going up on the Honours Board now - Ajaz Patel | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2021-12-05 09:14:00","image_url":null,"source_id":"google"},{"title":"Four more: Kiwi can’t repeat 10-wicket perfection, but has all-time Test best... as India dominates - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiwAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvY3JpY2tldC0yMDIxLWluZGlhLXZzLW5ldy16ZWFsYW5kLXNlY29uZC10ZXN0LWFqYXotcGF0ZWwtZm9sbG93dXAtdG8tMTAtd2lja2V0LWhhdWwtMTQtd2lja2V0cy10ZXN0LXJlY29yZC1uZXdzL25ld3Mtc3RvcnkvYjY1OGVjZDNiNTc0ZjRlOWRmOTVmNjUyMmFkN2FkOGTSAcABaHR0cHM6Ly93d3cuZm94c3BvcnRzLmNvbS5hdS9jcmlja2V0L2NyaWNrZXQtMjAyMS1pbmRpYS12cy1uZXctemVhbGFuZC1zZWNvbmQtdGVzdC1hamF6LXBhdGVsLWZvbGxvd3VwLXRvLTEwLXdpY2tldC1oYXVsLTE0LXdpY2tldHMtdGVzdC1yZWNvcmQtbmV3cy9uZXdzLXN0b3J5L2I2NThlY2QzYjU3NGY0ZTlkZjk1ZjY1MjJhZDdhZDhk?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Four more: Kiwi can’t repeat 10-wicket perfection, but has all-time Test best... as India dominates  Fox SportsIndia set New Zealand 540-run Test target  Illawarra MercuryBlack Caps batters routed to undo Patel's perfect 10  cricket.com.auNew Zealand’s Ajaz Patel becomes third man in history to take 10 wickets in an innings  NEWS.com.auPerfect 10! Patel spins into rare club  Illawarra MercuryView Full coverage on Google News","content":null,"pubDate":"2021-12-05 09:10:00","image_url":null,"source_id":"google"}]}