{"newsArray":[{"title":"Rain forces IPL final into reserve day","link":"https://www.ft.lk/sports/Rain-forces-IPL-final-into-reserve-day/23-748859","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Heavy rain and thunderstorms in Ahmedabad on Sunday forced the Indian Premier League final between holders Gujarat Titans and Chennai Super Kings into a reserve day for the first time. Rain began 35 minutes before the toss and went on for over two hours and 40 minutes before it stopped and raised hopes for the game to begin at the world's biggest cricket stadium. But a second downpour washed out the day, leaving thousands of fans, who had taken shelter in the covered areas of the 132,000-seater stadium, disappointed. The ground was a sorry soggy sight when officials called off play for the day and a message on the giant screen, for the fans, read “please keep your physical tickets safe!”. The action will begin on Monday with an IPL final heading for a reserve day for the first time in its 16-year-long history. The weather department of the western city predicts a slim (10%) chance for evening rains on Monday as well.","pubDate":"2023-05-28 22:14:24","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"CSK Runner Up Image Viral On Narendra Modi Stadium Giant Screen Creates Speculations","link":"https://www.thetimesofbengal.com/sports/csk-runner-up-image-viral-on-narendra-modi-stadium-giant-screen-creates-speculations/?utm_source=rss&utm_medium=rss&utm_campaign=csk-runner-up-image-viral-on-narendra-modi-stadium-giant-screen-creates-speculations","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023 Final: ‘CSK Runner Up’ Viral Image On Narendra Modi Stadium Giant Screen Creates Speculations The Narendra Modi Stadium in Ahmedabad will host the IPL 2023 final between Chennai Super Kings and Gujarat Titans.\r The viral picture that has created speculations. (Image: Twitter) New Delhi: There can’t be any big occasion when […] The post CSK Runner Up Image Viral On Narendra Modi Stadium Giant Screen Creates Speculations first appeared on The Times of Bengal.","content":"New Delhi: There can’t be any big occasion when Mahendra Singh Dhoni takes the field. The two-time World Cup-winning former Indian captain will take the field one last time in the ongoing Indian Premier League (IPL) 2023 when he leads Chennai Super Kings against Gujarat Titans in the final at the Narendra Modi Stadium in Ahmedabad on Sunday. However, ahead of the highly-anticipated IPL 2023 final, an image from the venue has created quite a buzz among the netizens. In the image, the giant screen showed ‘Runner up Chennai Super Kings’ written on it and is going viral on social media, creating a confusion among the cricket fans. While India.com is has not verified the authentication of the image, people in the know have stated that it might have been a screen-testing, a regular drill before every match. A similar test have been done for Gujarat Titans as well. Meanwhile, the game which was to start at 7:30 PM IST, is yet to commence as it have been raining heavily. If at all the match doesn’t start on Sunday, there is a reserve day (May 29) in store for the game. If the situations do not permit the game even on the reserve day, Gujarat Titans are likely to be declared champion owing to their table-top finish after the league stage. Meanwhile, Gujarat Titans is playing their second consecutive IPL final after winning the title last year. For four-time winners Chennai Super Kings, it is their 10th IPL final, all under talismanic Mahendra Singh Dhoni. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-28 16:04:54","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC Final: Yashasvi Jaiswal replaces Ruturaj Gaikwad in India's standby players list","link":"https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-standby-india-vs-australia-wtc-final-2023-squad-2385637-2023-05-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"WTC Final: Yashasvi Jaiswal replaces Ruturaj Gaikwad in India's standby players list","content":null,"pubDate":"2023-05-28 15:07:33","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain?","link":"https://www.thetimesofbengal.com/sports/what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain-2/?utm_source=rss&utm_medium=rss&utm_campaign=what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain-2","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand […] The post What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? first appeared on The Times of Bengal.","content":"New Delhi: Chennai Super Kings lock horns with defending champions Gujarat Titans in the 16th final of the Indian Premier League on Sunday at the Narendra Stadium in Ahmedabad. Rumours are also peaking high at the same time that this blockbuster finale will mark the end of CSK captain MS Dhoni’s cricketing career. The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand will be fighting for Dhoni and make it equal with Mumbai on most trophies won. But what happens if the IPL Final gets washed out due to rain ? As of now it’s pelting in Ahmedabad and if not a single ball is bowled due to the harsh weather conditions, then there will be a reserve day on Monday. No overs will be lost till 9:35 PM. A minimum of 5 overs need to be bowled for a match to take place. The cut-off time for a 5-over match is 12:06 am. If the match gets stopped in between the play then quite obviously Duckworth-Lewis (DLS) method will come into play to determine the winner. If the rain play spoilsport on the reserve day again and no overs are bowled, then Gujarat will walk away with the title as they topped the league phase ahead of Chennai. Gujarat Titans Squad: Wriddhiman Saha(w), Shubman Gill, Sai Sudharsan, Hardik Pandya(c), Vijay Shankar, David Miller, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami, Joshua Little, Srikar Bharat, Shivam Mavi, Odean Smith, Ravisrinivasan Sai Kishore, Pradeep Sangwan, Matthew Wade, Jayant Yadav, Dasun Shanaka, Abhinav Manohar, Alzarri Joseph, Darshan Nalkande, Urvil Patel, Yash Dayal. Chennai Super Kings Squad: Ruturaj Gaikwad, Devon Conway, Shivam Dube, Ajinkya Rahane, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Moeen Ali, Deepak Chahar, Tushar Deshpande, Maheesh Theekshana, Matheesha Pathirana, Mitchell Santner, Subhranshu Senapati, Shaik Rasheed, Akash Singh, Ben Stokes, Dwaine Pretorius, Sisanda Magala, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Bhagath Varma, Nishant Sindhu. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-28 15:06:57","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 final: GT vs CSK | Rain delays toss in final between Chennai and Gujarat","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-final-gujarat-titans-vs-chennai-super-kings-in-ahmedabad-on-may-28/article66904474.ece","keywords":null,"creator":null,"video_url":null,"description":"If the IPL final is affected by rains or washed out on the day of the match, the game can be played on the next day which is treated as a reserve day.","content":null,"pubDate":"2023-05-28 13:50:13","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC chairman, chief executive to visit Pakistan on May 30","link":"https://en.dailypakistan.com.pk/28-May-2023/icc-chairman-chief-executive-to-visit-pakistan-on-may-30","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE: ICC Chairman Greg Barclay and Chief Executive Geoff Allardice have announced their upcoming two-day visit to Pakistan, scheduled for May 30th.","content":"LAHORE: ICC Chairman Greg Barclay and Chief Executive Geoff Allardice have announced their upcoming two-day visit to Pakistan, scheduled for May 30th. This visit holds immense significance as it will be Barclay's first trip to Pakistan and the first time an ICC chairman has toured the country since 2008 when Ray Mali, the former president, visited. The Pakistan Cricket Board (PCB) shared in a press release that this joint visit of the top two ICC officials marks a remarkable moment, as it has been almost two decades since both officials visited Pakistan together. While Allardice has had prior visits to the country, serving as the ICC’s General Manager for Cricket and subsequently as the Chief Executive, Barclay’s presence reinforces the ICC’s dedication to engaging with cricketing nations worldwide. Upon their arrival in Lahore on Tuesday morning, Barclay and Allardice are scheduled to meet with prominent figures from the PCB, including Najam Sethi, the Chair of the PCB Management Committee, Barrister Salman Naseer, the PCB Chief Operating Officer, and other officials. The discussions during the visit are expected to encompass a wide range of subjects related to mutual interests and cooperation. The visit takes place against the backdrop of strained relations between Pakistan and India, specifically concerning the upcoming Asia Cup and World Cup. Political tensions have severely impacted bilateral cricket matches between the two nations, leading to matches being limited to multi-team events held in neutral venues. In response to safety concerns, India has declined to travel to Pakistan for the Asia Cup scheduled for September. To address these concerns, the PCB has proposed a “hybrid model” where the matches could be held in the United Arab Emirates, allowing India to participate while addressing their security apprehensions. Additionally, PCB’s Najam Sethi has indicated the possibility of Pakistan boycotting this year’s World Cup if they lose the hosting rights for the Asia Cup. Such a decision would be a response to the evolving situation and would emphasize the crucial importance of hosting rights for Pakistan. The visit of ICC Chairman Greg Barclay and Chief Executive Geoff Allardice to Pakistan carries both symbolic and practical implications. It underscores the ICC’s commitment to supporting and engaging with cricketing nations and highlights their efforts to address the challenges and complexities associated with bilateral cricket in the region.","pubDate":"2023-05-28 13:30:00","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-28/icc-chairman-chief-executive-to-visit-pakistan-on-may-30-1685279199-4887.png","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ashes 2023: Smith has had a lot of success against us recently, says Anderson","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-steve-smith-has-had-a-lot-of-success-against-us-in-recent-times-says-james-anderson-2385615-2023-05-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2023: Smith has had a lot of success against us recently, says Anderson","content":null,"pubDate":"2023-05-28 13:25:25","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-chennai-super-kings-ambati-rayudu-announces-retirement/article66904518.ece","keywords":null,"creator":null,"video_url":null,"description":"In a tweet on May 28, 38-year-old Ambati Rayudu said that there won't be any U-turn this time around after scoring 139 runs in 15 games","content":null,"pubDate":"2023-05-28 13:12:51","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"सचिन तेंदुलकर हुए शुभमन गिल के बल्लेबाजी के मुरीद, आइए जानते है क्या लिखा ट्वीट में","link":"https://jantaserishta.com/sports/sachin-tendulkar-admires-shubman-gills-batting-lets-know-what-was-written-in-the-tweet-2387639","keywords":["खेल"],"creator":["suraj"],"video_url":null,"description":null,"content":"खेल: आईपीएल 2023 में शुभमन गिल ने बल्ले से कमाल का परफॉर्मेंस किया। इस सीजन अब तक उन्होंने तीन शतक जड़े। शुभमन गिल की तूफानी बल्लेबाजी के बदौतल गुजरात टाइटंस ने लगातार दूसरी बार फाइनल में इंट्री मार ली है। इस सीजन गिल ने 16 मैचों में 60.70 की औसत से 851 रन बनाया है। पिछले चार मैचों में गिल ने तीन सेंचुरी मारी है। शानदार लय में दिख रहे गिल लीग के आखिरी मुकाबले में गिल ने रॉयल चैलेंजर्स बैंगलोर के खिलाफ शतक जड़ा। इसके बाद क्वालीफायर2 मुकाबले में गिल ने मुंबई इंडियंस के खिलाफ 60 गेंदों पर 129 रन की पारी खेली। इस तूफानी पारी के दौरान गिल ने 10 छक्के जड़े। सचिन ने की गिल की तारीफ इस मैच के बाद सचिन तेंदुलकर ने गिल को लेकर एक शानदार ट्वीट किया। तेंदुलकर ने कहा कि उन्हें गिल की बल्लेबाजी की सबसे अच्छी बात उनकी टेंपरामेंट लगती है। Shubman Gill's performance this season has been nothing short of unforgettable, marked by two centuries that left an indelible impact. One century ignited @mipaltan's hopes, while the other dealt them a crushing blow. Such is the unpredictable nature of cricket! वो बिना हड़बड़ी के बल्लेबाजी करते हैं, उनके अंदर रन बनाने की भूख है और उनकी रनिंग बिटविन द विकेट भी काफी शानदार है।","pubDate":"2023-05-28 12:47:08","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs CSK : 15 लाख अंदर, अब 12 पर नजर, निशाने पर ‘मैराथन मैन’, गुजरात के खूंखार बैटर की राह रोकेगा धोनी का धुरंधर!","link":"https://hindi.news18.com/news/sports/cricket-ipl-final-2023-gt-vs-csk-shubhman-gill-or-shivam-dubey-can-become-the-batsman-with-most-sixes-6341973.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL Final 2023 : गुजरात टाइटंस का ओपनर भले ही चेन्‍नई सुपर किंग्‍स के खिलाफ फाइनल में एक भी रन ना बना पाए, लेकिन 15 लाख रुपये उसकी पॉकेट में जा चुके हैं. तूफानी बल्‍लेबाज की नजर लगी है अब 12 लाख रुपये पर. ऐसा करने के लिए उसे ‘मैराथन मैन’ का रिकॉर्ड तोड़ना होगा. यह बहुत मुश्किल भी नहीं. बस, 4 शॉट की बात है.","content":null,"pubDate":"2023-05-28 12:44:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shubman-Gill-vs-rcb-16847157003x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rain forces IPL final into reserve day","link":"https://www.ft.lk/sports/Rain-forces-IPL-final-into-reserve-day/23-748859","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Heavy rain and thunderstorms in Ahmedabad on Sunday forced the Indian Premier League final between holders Gujarat Titans and Chennai Super Kings into a reserve day for the first time. Rain began 35 minutes before the toss and went on for over two hours and 40 minutes before it stopped and raised hopes for the game to begin at the world's biggest cricket stadium. But a second downpour washed out the day, leaving thousands of fans, who had taken shelter in the covered areas of the 132,000-seater stadium, disappointed. The ground was a sorry soggy sight when officials called off play for the day and a message on the giant screen, for the fans, read “please keep your physical tickets safe!”. The action will begin on Monday with an IPL final heading for a reserve day for the first time in its 16-year-long history. The weather department of the western city predicts a slim (10%) chance for evening rains on Monday as well.","pubDate":"2023-05-28 22:14:24","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"CSK Runner Up Image Viral On Narendra Modi Stadium Giant Screen Creates Speculations","link":"https://www.thetimesofbengal.com/sports/csk-runner-up-image-viral-on-narendra-modi-stadium-giant-screen-creates-speculations/?utm_source=rss&utm_medium=rss&utm_campaign=csk-runner-up-image-viral-on-narendra-modi-stadium-giant-screen-creates-speculations","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023 Final: ‘CSK Runner Up’ Viral Image On Narendra Modi Stadium Giant Screen Creates Speculations The Narendra Modi Stadium in Ahmedabad will host the IPL 2023 final between Chennai Super Kings and Gujarat Titans.\r The viral picture that has created speculations. (Image: Twitter) New Delhi: There can’t be any big occasion when […] The post CSK Runner Up Image Viral On Narendra Modi Stadium Giant Screen Creates Speculations first appeared on The Times of Bengal.","content":"New Delhi: There can’t be any big occasion when Mahendra Singh Dhoni takes the field. The two-time World Cup-winning former Indian captain will take the field one last time in the ongoing Indian Premier League (IPL) 2023 when he leads Chennai Super Kings against Gujarat Titans in the final at the Narendra Modi Stadium in Ahmedabad on Sunday. However, ahead of the highly-anticipated IPL 2023 final, an image from the venue has created quite a buzz among the netizens. In the image, the giant screen showed ‘Runner up Chennai Super Kings’ written on it and is going viral on social media, creating a confusion among the cricket fans. While India.com is has not verified the authentication of the image, people in the know have stated that it might have been a screen-testing, a regular drill before every match. A similar test have been done for Gujarat Titans as well. Meanwhile, the game which was to start at 7:30 PM IST, is yet to commence as it have been raining heavily. If at all the match doesn’t start on Sunday, there is a reserve day (May 29) in store for the game. If the situations do not permit the game even on the reserve day, Gujarat Titans are likely to be declared champion owing to their table-top finish after the league stage. Meanwhile, Gujarat Titans is playing their second consecutive IPL final after winning the title last year. For four-time winners Chennai Super Kings, it is their 10th IPL final, all under talismanic Mahendra Singh Dhoni. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-28 16:04:54","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC Final: Yashasvi Jaiswal replaces Ruturaj Gaikwad in India's standby players list","link":"https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-standby-india-vs-australia-wtc-final-2023-squad-2385637-2023-05-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"WTC Final: Yashasvi Jaiswal replaces Ruturaj Gaikwad in India's standby players list","content":null,"pubDate":"2023-05-28 15:07:33","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain?","link":"https://www.thetimesofbengal.com/sports/what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain-2/?utm_source=rss&utm_medium=rss&utm_campaign=what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain-2","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand […] The post What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? first appeared on The Times of Bengal.","content":"New Delhi: Chennai Super Kings lock horns with defending champions Gujarat Titans in the 16th final of the Indian Premier League on Sunday at the Narendra Stadium in Ahmedabad. Rumours are also peaking high at the same time that this blockbuster finale will mark the end of CSK captain MS Dhoni’s cricketing career. The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand will be fighting for Dhoni and make it equal with Mumbai on most trophies won. But what happens if the IPL Final gets washed out due to rain ? As of now it’s pelting in Ahmedabad and if not a single ball is bowled due to the harsh weather conditions, then there will be a reserve day on Monday. No overs will be lost till 9:35 PM. A minimum of 5 overs need to be bowled for a match to take place. The cut-off time for a 5-over match is 12:06 am. If the match gets stopped in between the play then quite obviously Duckworth-Lewis (DLS) method will come into play to determine the winner. If the rain play spoilsport on the reserve day again and no overs are bowled, then Gujarat will walk away with the title as they topped the league phase ahead of Chennai. Gujarat Titans Squad: Wriddhiman Saha(w), Shubman Gill, Sai Sudharsan, Hardik Pandya(c), Vijay Shankar, David Miller, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami, Joshua Little, Srikar Bharat, Shivam Mavi, Odean Smith, Ravisrinivasan Sai Kishore, Pradeep Sangwan, Matthew Wade, Jayant Yadav, Dasun Shanaka, Abhinav Manohar, Alzarri Joseph, Darshan Nalkande, Urvil Patel, Yash Dayal. Chennai Super Kings Squad: Ruturaj Gaikwad, Devon Conway, Shivam Dube, Ajinkya Rahane, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Moeen Ali, Deepak Chahar, Tushar Deshpande, Maheesh Theekshana, Matheesha Pathirana, Mitchell Santner, Subhranshu Senapati, Shaik Rasheed, Akash Singh, Ben Stokes, Dwaine Pretorius, Sisanda Magala, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Bhagath Varma, Nishant Sindhu. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-28 15:06:57","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 final: GT vs CSK | Rain delays toss in final between Chennai and Gujarat","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-final-gujarat-titans-vs-chennai-super-kings-in-ahmedabad-on-may-28/article66904474.ece","keywords":null,"creator":null,"video_url":null,"description":"If the IPL final is affected by rains or washed out on the day of the match, the game can be played on the next day which is treated as a reserve day.","content":null,"pubDate":"2023-05-28 13:50:13","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC chairman, chief executive to visit Pakistan on May 30","link":"https://en.dailypakistan.com.pk/28-May-2023/icc-chairman-chief-executive-to-visit-pakistan-on-may-30","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE: ICC Chairman Greg Barclay and Chief Executive Geoff Allardice have announced their upcoming two-day visit to Pakistan, scheduled for May 30th.","content":"LAHORE: ICC Chairman Greg Barclay and Chief Executive Geoff Allardice have announced their upcoming two-day visit to Pakistan, scheduled for May 30th. This visit holds immense significance as it will be Barclay's first trip to Pakistan and the first time an ICC chairman has toured the country since 2008 when Ray Mali, the former president, visited. The Pakistan Cricket Board (PCB) shared in a press release that this joint visit of the top two ICC officials marks a remarkable moment, as it has been almost two decades since both officials visited Pakistan together. While Allardice has had prior visits to the country, serving as the ICC’s General Manager for Cricket and subsequently as the Chief Executive, Barclay’s presence reinforces the ICC’s dedication to engaging with cricketing nations worldwide. Upon their arrival in Lahore on Tuesday morning, Barclay and Allardice are scheduled to meet with prominent figures from the PCB, including Najam Sethi, the Chair of the PCB Management Committee, Barrister Salman Naseer, the PCB Chief Operating Officer, and other officials. The discussions during the visit are expected to encompass a wide range of subjects related to mutual interests and cooperation. The visit takes place against the backdrop of strained relations between Pakistan and India, specifically concerning the upcoming Asia Cup and World Cup. Political tensions have severely impacted bilateral cricket matches between the two nations, leading to matches being limited to multi-team events held in neutral venues. In response to safety concerns, India has declined to travel to Pakistan for the Asia Cup scheduled for September. To address these concerns, the PCB has proposed a “hybrid model” where the matches could be held in the United Arab Emirates, allowing India to participate while addressing their security apprehensions. Additionally, PCB’s Najam Sethi has indicated the possibility of Pakistan boycotting this year’s World Cup if they lose the hosting rights for the Asia Cup. Such a decision would be a response to the evolving situation and would emphasize the crucial importance of hosting rights for Pakistan. The visit of ICC Chairman Greg Barclay and Chief Executive Geoff Allardice to Pakistan carries both symbolic and practical implications. It underscores the ICC’s commitment to supporting and engaging with cricketing nations and highlights their efforts to address the challenges and complexities associated with bilateral cricket in the region.","pubDate":"2023-05-28 13:30:00","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-28/icc-chairman-chief-executive-to-visit-pakistan-on-may-30-1685279199-4887.png","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ashes 2023: Smith has had a lot of success against us recently, says Anderson","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-steve-smith-has-had-a-lot-of-success-against-us-in-recent-times-says-james-anderson-2385615-2023-05-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2023: Smith has had a lot of success against us recently, says Anderson","content":null,"pubDate":"2023-05-28 13:25:25","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-chennai-super-kings-ambati-rayudu-announces-retirement/article66904518.ece","keywords":null,"creator":null,"video_url":null,"description":"In a tweet on May 28, 38-year-old Ambati Rayudu said that there won't be any U-turn this time around after scoring 139 runs in 15 games","content":null,"pubDate":"2023-05-28 13:12:51","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"सचिन तेंदुलकर हुए शुभमन गिल के बल्लेबाजी के मुरीद, आइए जानते है क्या लिखा ट्वीट में","link":"https://jantaserishta.com/sports/sachin-tendulkar-admires-shubman-gills-batting-lets-know-what-was-written-in-the-tweet-2387639","keywords":["खेल"],"creator":["suraj"],"video_url":null,"description":null,"content":"खेल: आईपीएल 2023 में शुभमन गिल ने बल्ले से कमाल का परफॉर्मेंस किया। इस सीजन अब तक उन्होंने तीन शतक जड़े। शुभमन गिल की तूफानी बल्लेबाजी के बदौतल गुजरात टाइटंस ने लगातार दूसरी बार फाइनल में इंट्री मार ली है। इस सीजन गिल ने 16 मैचों में 60.70 की औसत से 851 रन बनाया है। पिछले चार मैचों में गिल ने तीन सेंचुरी मारी है। शानदार लय में दिख रहे गिल लीग के आखिरी मुकाबले में गिल ने रॉयल चैलेंजर्स बैंगलोर के खिलाफ शतक जड़ा। इसके बाद क्वालीफायर2 मुकाबले में गिल ने मुंबई इंडियंस के खिलाफ 60 गेंदों पर 129 रन की पारी खेली। इस तूफानी पारी के दौरान गिल ने 10 छक्के जड़े। सचिन ने की गिल की तारीफ इस मैच के बाद सचिन तेंदुलकर ने गिल को लेकर एक शानदार ट्वीट किया। तेंदुलकर ने कहा कि उन्हें गिल की बल्लेबाजी की सबसे अच्छी बात उनकी टेंपरामेंट लगती है। Shubman Gill's performance this season has been nothing short of unforgettable, marked by two centuries that left an indelible impact. One century ignited @mipaltan's hopes, while the other dealt them a crushing blow. Such is the unpredictable nature of cricket! वो बिना हड़बड़ी के बल्लेबाजी करते हैं, उनके अंदर रन बनाने की भूख है और उनकी रनिंग बिटविन द विकेट भी काफी शानदार है।","pubDate":"2023-05-28 12:47:08","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs CSK : 15 लाख अंदर, अब 12 पर नजर, निशाने पर ‘मैराथन मैन’, गुजरात के खूंखार बैटर की राह रोकेगा धोनी का धुरंधर!","link":"https://hindi.news18.com/news/sports/cricket-ipl-final-2023-gt-vs-csk-shubhman-gill-or-shivam-dubey-can-become-the-batsman-with-most-sixes-6341973.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL Final 2023 : गुजरात टाइटंस का ओपनर भले ही चेन्‍नई सुपर किंग्‍स के खिलाफ फाइनल में एक भी रन ना बना पाए, लेकिन 15 लाख रुपये उसकी पॉकेट में जा चुके हैं. तूफानी बल्‍लेबाज की नजर लगी है अब 12 लाख रुपये पर. ऐसा करने के लिए उसे ‘मैराथन मैन’ का रिकॉर्ड तोड़ना होगा. यह बहुत मुश्किल भी नहीं. बस, 4 शॉट की बात है.","content":null,"pubDate":"2023-05-28 12:44:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shubman-Gill-vs-rcb-16847157003x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Rain forces IPL final into reserve day","link":"https://www.ft.lk/sports/Rain-forces-IPL-final-into-reserve-day/23-748859","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Heavy rain and thunderstorms in Ahmedabad on Sunday forced the Indian Premier League final between holders Gujarat Titans and Chennai Super Kings into a reserve day for the first time. Rain began 35 minutes before the toss and went on for over two hours and 40 minutes before it stopped and raised hopes for the game to begin at the world's biggest cricket stadium. But a second downpour washed out the day, leaving thousands of fans, who had taken shelter in the covered areas of the 132,000-seater stadium, disappointed. The ground was a sorry soggy sight when officials called off play for the day and a message on the giant screen, for the fans, read “please keep your physical tickets safe!”. The action will begin on Monday with an IPL final heading for a reserve day for the first time in its 16-year-long history. The weather department of the western city predicts a slim (10%) chance for evening rains on Monday as well.","pubDate":"2023-05-28 22:14:24","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"CSK Runner Up Image Viral On Narendra Modi Stadium Giant Screen Creates Speculations","link":"https://www.thetimesofbengal.com/sports/csk-runner-up-image-viral-on-narendra-modi-stadium-giant-screen-creates-speculations/?utm_source=rss&utm_medium=rss&utm_campaign=csk-runner-up-image-viral-on-narendra-modi-stadium-giant-screen-creates-speculations","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports IPL 2023 Final: ‘CSK Runner Up’ Viral Image On Narendra Modi Stadium Giant Screen Creates Speculations The Narendra Modi Stadium in Ahmedabad will host the IPL 2023 final between Chennai Super Kings and Gujarat Titans.\r The viral picture that has created speculations. (Image: Twitter) New Delhi: There can’t be any big occasion when […] The post CSK Runner Up Image Viral On Narendra Modi Stadium Giant Screen Creates Speculations first appeared on The Times of Bengal.","content":"New Delhi: There can’t be any big occasion when Mahendra Singh Dhoni takes the field. The two-time World Cup-winning former Indian captain will take the field one last time in the ongoing Indian Premier League (IPL) 2023 when he leads Chennai Super Kings against Gujarat Titans in the final at the Narendra Modi Stadium in Ahmedabad on Sunday. However, ahead of the highly-anticipated IPL 2023 final, an image from the venue has created quite a buzz among the netizens. In the image, the giant screen showed ‘Runner up Chennai Super Kings’ written on it and is going viral on social media, creating a confusion among the cricket fans. While India.com is has not verified the authentication of the image, people in the know have stated that it might have been a screen-testing, a regular drill before every match. A similar test have been done for Gujarat Titans as well. Meanwhile, the game which was to start at 7:30 PM IST, is yet to commence as it have been raining heavily. If at all the match doesn’t start on Sunday, there is a reserve day (May 29) in store for the game. If the situations do not permit the game even on the reserve day, Gujarat Titans are likely to be declared champion owing to their table-top finish after the league stage. Meanwhile, Gujarat Titans is playing their second consecutive IPL final after winning the title last year. For four-time winners Chennai Super Kings, it is their 10th IPL final, all under talismanic Mahendra Singh Dhoni. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-28 16:04:54","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"WTC Final: Yashasvi Jaiswal replaces Ruturaj Gaikwad in India's standby players list","link":"https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-standby-india-vs-australia-wtc-final-2023-squad-2385637-2023-05-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"WTC Final: Yashasvi Jaiswal replaces Ruturaj Gaikwad in India's standby players list","content":null,"pubDate":"2023-05-28 15:07:33","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain?","link":"https://www.thetimesofbengal.com/sports/what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain-2/?utm_source=rss&utm_medium=rss&utm_campaign=what-happens-if-ipl-final-2023-between-gujarat-titans-and-chennai-super-kings-gets-washed-out-due-to-rain-2","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Home Sports What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand […] The post What Happens If IPL Final 2023 Between Gujarat Titans and Chennai Super Kings Gets Washed Out Due to Rain? first appeared on The Times of Bengal.","content":"New Delhi: Chennai Super Kings lock horns with defending champions Gujarat Titans in the 16th final of the Indian Premier League on Sunday at the Narendra Stadium in Ahmedabad. Rumours are also peaking high at the same time that this blockbuster finale will mark the end of CSK captain MS Dhoni’s cricketing career. The stage is all set for an epic clash as Gujarat are on the verge of becoming the first side after Chennai to retain the title in consecutive years. Chennai on the other hand will be fighting for Dhoni and make it equal with Mumbai on most trophies won. But what happens if the IPL Final gets washed out due to rain ? As of now it’s pelting in Ahmedabad and if not a single ball is bowled due to the harsh weather conditions, then there will be a reserve day on Monday. No overs will be lost till 9:35 PM. A minimum of 5 overs need to be bowled for a match to take place. The cut-off time for a 5-over match is 12:06 am. If the match gets stopped in between the play then quite obviously Duckworth-Lewis (DLS) method will come into play to determine the winner. If the rain play spoilsport on the reserve day again and no overs are bowled, then Gujarat will walk away with the title as they topped the league phase ahead of Chennai. Gujarat Titans Squad: Wriddhiman Saha(w), Shubman Gill, Sai Sudharsan, Hardik Pandya(c), Vijay Shankar, David Miller, Rahul Tewatia, Rashid Khan, Mohit Sharma, Noor Ahmad, Mohammed Shami, Joshua Little, Srikar Bharat, Shivam Mavi, Odean Smith, Ravisrinivasan Sai Kishore, Pradeep Sangwan, Matthew Wade, Jayant Yadav, Dasun Shanaka, Abhinav Manohar, Alzarri Joseph, Darshan Nalkande, Urvil Patel, Yash Dayal. Chennai Super Kings Squad: Ruturaj Gaikwad, Devon Conway, Shivam Dube, Ajinkya Rahane, Ambati Rayudu, MS Dhoni(w/c), Ravindra Jadeja, Moeen Ali, Deepak Chahar, Tushar Deshpande, Maheesh Theekshana, Matheesha Pathirana, Mitchell Santner, Subhranshu Senapati, Shaik Rasheed, Akash Singh, Ben Stokes, Dwaine Pretorius, Sisanda Magala, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Bhagath Varma, Nishant Sindhu. $(document).ready(function(){ $('#commentbtn').on(\"click\",function(){ (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"https://connect.facebook.net/en_US/all.js#xfbml=1&appId=178196885542208\"; fjs.parentNode.insertBefore(js, fjs); }(document, 'script', 'facebook-jssdk')); $(\".cmntbox\").toggle(); }); }); Source link","pubDate":"2023-05-28 15:06:57","image_url":null,"source_id":"the_tob","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023 final: GT vs CSK | Rain delays toss in final between Chennai and Gujarat","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-final-gujarat-titans-vs-chennai-super-kings-in-ahmedabad-on-may-28/article66904474.ece","keywords":null,"creator":null,"video_url":null,"description":"If the IPL final is affected by rains or washed out on the day of the match, the game can be played on the next day which is treated as a reserve day.","content":null,"pubDate":"2023-05-28 13:50:13","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"ICC chairman, chief executive to visit Pakistan on May 30","link":"https://en.dailypakistan.com.pk/28-May-2023/icc-chairman-chief-executive-to-visit-pakistan-on-may-30","keywords":["Sports"],"creator":["Web Desk"],"video_url":null,"description":"LAHORE: ICC Chairman Greg Barclay and Chief Executive Geoff Allardice have announced their upcoming two-day visit to Pakistan, scheduled for May 30th.","content":"LAHORE: ICC Chairman Greg Barclay and Chief Executive Geoff Allardice have announced their upcoming two-day visit to Pakistan, scheduled for May 30th. This visit holds immense significance as it will be Barclay's first trip to Pakistan and the first time an ICC chairman has toured the country since 2008 when Ray Mali, the former president, visited. The Pakistan Cricket Board (PCB) shared in a press release that this joint visit of the top two ICC officials marks a remarkable moment, as it has been almost two decades since both officials visited Pakistan together. While Allardice has had prior visits to the country, serving as the ICC’s General Manager for Cricket and subsequently as the Chief Executive, Barclay’s presence reinforces the ICC’s dedication to engaging with cricketing nations worldwide. Upon their arrival in Lahore on Tuesday morning, Barclay and Allardice are scheduled to meet with prominent figures from the PCB, including Najam Sethi, the Chair of the PCB Management Committee, Barrister Salman Naseer, the PCB Chief Operating Officer, and other officials. The discussions during the visit are expected to encompass a wide range of subjects related to mutual interests and cooperation. The visit takes place against the backdrop of strained relations between Pakistan and India, specifically concerning the upcoming Asia Cup and World Cup. Political tensions have severely impacted bilateral cricket matches between the two nations, leading to matches being limited to multi-team events held in neutral venues. In response to safety concerns, India has declined to travel to Pakistan for the Asia Cup scheduled for September. To address these concerns, the PCB has proposed a “hybrid model” where the matches could be held in the United Arab Emirates, allowing India to participate while addressing their security apprehensions. Additionally, PCB’s Najam Sethi has indicated the possibility of Pakistan boycotting this year’s World Cup if they lose the hosting rights for the Asia Cup. Such a decision would be a response to the evolving situation and would emphasize the crucial importance of hosting rights for Pakistan. The visit of ICC Chairman Greg Barclay and Chief Executive Geoff Allardice to Pakistan carries both symbolic and practical implications. It underscores the ICC’s commitment to supporting and engaging with cricketing nations and highlights their efforts to address the challenges and complexities associated with bilateral cricket in the region.","pubDate":"2023-05-28 13:30:00","image_url":"https://en.dailypakistan.com.pk/digital_images/large/2023-05-28/icc-chairman-chief-executive-to-visit-pakistan-on-may-30-1685279199-4887.png","source_id":"dailypakistanen","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Ashes 2023: Smith has had a lot of success against us recently, says Anderson","link":"https://www.indiatoday.in/sports/cricket/story/ashes-2023-steve-smith-has-had-a-lot-of-success-against-us-in-recent-times-says-james-anderson-2385615-2023-05-28?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Ashes 2023: Smith has had a lot of success against us recently, says Anderson","content":null,"pubDate":"2023-05-28 13:25:25","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Indian Premier League 2023 | Chennai Super Kings’ Ambati Rayudu announces retirement","link":"https://www.thehindu.com/sport/cricket/indian-premier-league-2023-chennai-super-kings-ambati-rayudu-announces-retirement/article66904518.ece","keywords":null,"creator":null,"video_url":null,"description":"In a tweet on May 28, 38-year-old Ambati Rayudu said that there won't be any U-turn this time around after scoring 139 runs in 15 games","content":null,"pubDate":"2023-05-28 13:12:51","image_url":null,"source_id":"thehindu","category":["sports"],"country":["india"],"language":"english"},{"title":"सचिन तेंदुलकर हुए शुभमन गिल के बल्लेबाजी के मुरीद, आइए जानते है क्या लिखा ट्वीट में","link":"https://jantaserishta.com/sports/sachin-tendulkar-admires-shubman-gills-batting-lets-know-what-was-written-in-the-tweet-2387639","keywords":["खेल"],"creator":["suraj"],"video_url":null,"description":null,"content":"खेल: आईपीएल 2023 में शुभमन गिल ने बल्ले से कमाल का परफॉर्मेंस किया। इस सीजन अब तक उन्होंने तीन शतक जड़े। शुभमन गिल की तूफानी बल्लेबाजी के बदौतल गुजरात टाइटंस ने लगातार दूसरी बार फाइनल में इंट्री मार ली है। इस सीजन गिल ने 16 मैचों में 60.70 की औसत से 851 रन बनाया है। पिछले चार मैचों में गिल ने तीन सेंचुरी मारी है। शानदार लय में दिख रहे गिल लीग के आखिरी मुकाबले में गिल ने रॉयल चैलेंजर्स बैंगलोर के खिलाफ शतक जड़ा। इसके बाद क्वालीफायर2 मुकाबले में गिल ने मुंबई इंडियंस के खिलाफ 60 गेंदों पर 129 रन की पारी खेली। इस तूफानी पारी के दौरान गिल ने 10 छक्के जड़े। सचिन ने की गिल की तारीफ इस मैच के बाद सचिन तेंदुलकर ने गिल को लेकर एक शानदार ट्वीट किया। तेंदुलकर ने कहा कि उन्हें गिल की बल्लेबाजी की सबसे अच्छी बात उनकी टेंपरामेंट लगती है। Shubman Gill's performance this season has been nothing short of unforgettable, marked by two centuries that left an indelible impact. One century ignited @mipaltan's hopes, while the other dealt them a crushing blow. Such is the unpredictable nature of cricket! वो बिना हड़बड़ी के बल्लेबाजी करते हैं, उनके अंदर रन बनाने की भूख है और उनकी रनिंग बिटविन द विकेट भी काफी शानदार है।","pubDate":"2023-05-28 12:47:08","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs CSK : 15 लाख अंदर, अब 12 पर नजर, निशाने पर ‘मैराथन मैन’, गुजरात के खूंखार बैटर की राह रोकेगा धोनी का धुरंधर!","link":"https://hindi.news18.com/news/sports/cricket-ipl-final-2023-gt-vs-csk-shubhman-gill-or-shivam-dubey-can-become-the-batsman-with-most-sixes-6341973.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"IPL Final 2023 : गुजरात टाइटंस का ओपनर भले ही चेन्‍नई सुपर किंग्‍स के खिलाफ फाइनल में एक भी रन ना बना पाए, लेकिन 15 लाख रुपये उसकी पॉकेट में जा चुके हैं. तूफानी बल्‍लेबाज की नजर लगी है अब 12 लाख रुपये पर. ऐसा करने के लिए उसे ‘मैराथन मैन’ का रिकॉर्ड तोड़ना होगा. यह बहुत मुश्किल भी नहीं. बस, 4 शॉट की बात है.","content":null,"pubDate":"2023-05-28 12:44:57","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/05/Shubman-Gill-vs-rcb-16847157003x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}