{"newsArray":[{"title":"“I’m all for Jhye Richardson”: Shane Warne backs Jhye Richardson to play over Mitchell Starc in The Ashes 2021-22 test at Brisbane","link":"https://thesportsrush.com/cricket-news-im-all-for-jhye-richardson-shane-warne-backs-jhye-richardson-to-play-over-mitchell-starc-in-the-ashes-2021-22-test-at-brisbane/","keywords":["Cricket","Jhye Richardson","Shane Warne","The Ashes"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"The Ashes 2021-22: Shane Warne wants Jhye Richardson to play over Mitchell Starc in the first game of the summer at the Gabba. The Ashes 2021-22 is set to start from 8 December 2021 at the Gabba. Australia have recalled Usman Khawaja and Jhye Richardson in the side. Pat Cummins has been named the new… The post “I’m all for Jhye Richardson”: Shane Warne backs Jhye Richardson to play over Mitchell Starc in The Ashes 2021-22 test at Brisbane appeared first on The SportsRush.","content":"The Ashes 2021-22: Shane Warne wants Jhye Richardson to play over Mitchell Starc in the first game of the summer at the Gabba. The Ashes 2021-22 is set to start from 8 December 2021 at the Gabba. Australia have recalled Usman Khawaja and Jhye Richardson in the side. Pat Cummins has been named the new captain, whereas Steve Smith is the new vice-captain. It is said that Usman Khawaja & Travis Head will battle for the number five slot, whereas the rest of the ten men are fixed. However, Australian legend Shane Warne has questioned the position of Mitchell Starc. Warne believes Starc is not a sure starter and he is “not bowling well enough” Warne wants Jhye Richardson to start over Mitchell Starc in the first test. Starc has 255 test wickets under his belt, but he managed to scalp just 11 wickets last summer against India. Richardson has been on fire this season, he has scalped 23 wickets in just four Sheffield Games at an average of 13.43. “He (Starc) needs to find a bit of rhythm and some form,” Warne said. “He had a really poor (Twenty20) World Cup. He’s just not bowling well enough. “It’s too important at the Gabba. So I’m all for Jhye Richardson.” How about those figures for Jhye Richardson #SheffieldShield pic.twitter.com/V1Vzr9jVYn — 7Cricket (@7Cricket) November 12, 2021 Shane Warne also commented on Nathan Lyon, and he wants Mitchell Swepson to get a chance. “Lyon had a poor summer last year, so did Mitchell Starc, so that’s where Australia really struggled. Lyon’s form isn’t great,” Warne said. “I hope Swepson gives an option for the selectors then to say ‘well, you know, Nathan’s not bowling that well or we want to play two spinners’, put some pressure on Nathan Lyon.” The Ashes 2021-22: Michael Clarke backs Mitchell Starc to play Former Aussie captain Michael Clarke believes that the team will go with the pace trio of Starc-Hazlewood-Cummins. According to Clarke, Australia have not played red-ball cricket for a long time. He believes Starc deserves as much as Cummins or Hazlewood to be in the eleven. “If the three quicks are saying to the medical staff that they feel fine, they’ve got the workload in and they’ve ticked all the boxes, I think they will start with Starc, Hazlewood and Cummins.” “Those three quicks have bowled well together. They just won a World Cup together. I think they’d want to bowl together. They’re in the same boat. If Mitchell Starc is not fit, why is Hazlewood fit? Why is Cummins fit?” For Australia, Jhye Richarson is the fast-bowling backup, whereas Mitch Swepson is the spin backup. Michael Neser is also an option for the pace-bowling role. The post “I’m all for Jhye Richardson”: Shane Warne backs Jhye Richardson to play over Mitchell Starc in The Ashes 2021-22 test at Brisbane appeared first on The SportsRush.","pubDate":"2021-11-30 05:10:34","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Ex-skipper’s crucial advice for Cummins revealed","link":"https://www.cairnspost.com.au/sport/cricket/how-pat-cummins-called-upon-former-australian-cricket-captains-for-wisdom/news-story/745254aa98cc8e55411431e5bfe9e876","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"The bottomless wisdom of Stephen Waugh is sought too infrequently in Australian cricket, so Pat Cummins knew he couldn’t waste the chance.","content":null,"pubDate":"2021-11-30 05:00:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ashes: WA Premier Mark McGowan dashes hopes of Perth hosting fifth Ashes Test","link":"https://thewest.com.au/news/ashes-wa-premier-mark-mcgowan-dashes-hopes-of-perth-hosting-fifth-ashes-test-c-4758467","keywords":null,"creator":["Alex Conrad"],"video_url":null,"description":"Cricket fans in Perth look set to miss out on the Ashes in their own backyard after the West Australian Premier confirmed their worst fears.","content":null,"pubDate":"2021-11-30 04:47:43","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4758467/7e9e5ddfd288d403e4fe3843e6d57499eb9dcd3a-16x9-x0y0w2048h1152.jpg","source_id":"thewest"},{"title":"Ashes: WA Premier Mark McGowan dashes hopes of Perth hosting fifth Ashes Test","link":"https://www.perthnow.com.au/sport/ashes-wa-premier-mark-mcgowan-dashes-hopes-of-perth-hosting-fifth-ashes-test-c-4758463","keywords":null,"creator":["Alex Conrad"],"video_url":null,"description":"Cricket fans in Perth look set to miss out on the Ashes in their own backyard after the West Australian Premier confirmed their worst fears.","content":null,"pubDate":"2021-11-30 04:47:10","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4758463/7e9e5ddfd288d403e4fe3843e6d57499eb9dcd3a-16x9-x0y0w2048h1152.jpg","source_id":"perthnow"},{"title":"It was about trying to bat long periods against a strong side: Williamson","link":"https://www.sentinelassam.com/sports-news/it-was-about-trying-to-bat-long-periods-against-a-strong-side-williamson-565483","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"New Zealand captain Kane Williamson said on Monday that the plan on day five of the first Test was about trying to bat long periods against ‘a very strong' Indian team. He acknowledged the contributions, especially the last-wicket pair of Rachin Ravindra and Ajaz Patel.","content":"KANPUR: New Zealand captain Kane Williamson said on Monday that the plan on day five of the first Test was about trying to bat long periods against 'a very strong' Indian team. He acknowledged the contributions, especially the last-wicket pair of Rachin Ravindra and Ajaz Patel.\"I suppose the beauty of Test cricket really, where there can be a lot of excitement in a draw. For us, coming into the day, it was about trying to bat long periods against a very strong side, that too against a formidable Indian attack. It was about trying to take the game as deep as possible and then Ashwin picked up a few wickets, put us under a bit of pressure along the way,\" said Williamson in the post-match press conference. \"But a number of really valuable contributions got us to that point. When a win was out of the question, draw was the next best option to try and fight for. A lot of effort went in to try and achieve that. The two at the end, Rachin in his first Test match and Ajaz as well showed a lot of ticker to bat those few overs against high quality, world-class spin, especially with dim light. So, it was a really exciting day,\" added Williamson. IANS Also Read: How To Control Uric Acid With Ayurveda: Check Here Now Also Watch:","pubDate":"2021-11-30 04:45:17","full_description":"KANPUR: New Zealand captain Kane Williamson said on Monday that the plan on day five of the first Test was about trying to bat long periods against 'a very strong' Indian team. He acknowledged the contributions, especially the last-wicket pair of Rachin Ravindra and Ajaz Patel. \"I suppose the beauty of Test cricket really, where there can be a lot of excitement in a draw. For us, coming into the day, it was about trying to bat long periods against a very strong side, that too against a formidable Indian attack. It was about trying to take the game as deep as possible and then Ashwin picked up a few wickets, put us under a bit of pressure along the way,\" said Williamson in the post-match press conference. \"But a number of really valuable contributions got us to that point. When a win was out of the question, draw was the next best option to try and fight for. A lot of effort went in to try and achieve that. The two at the end, Rachin in his first Test match and Ajaz as well showed a lot of ticker to bat those few overs against high quality, world-class spin, especially with dim light. So, it was a really exciting day,\" added Williamson. IANS Also Read: How To Control Uric Acid With Ayurveda: Check Here Now Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/11/30/275749-kane.jpg","source_id":"sentinel"},{"title":"IPL franchise sales a warning for Australian cricket, not an invitation","link":"https://www.smh.com.au/sport/cricket/ipl-franchise-sales-a-warning-for-australian-cricket-not-an-invitation-20211118-p59a6t.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Australia has consistently produced world-beating cricket teams, and there is little reason to fear it is not sustainable. So, why should Australian cricket chase more money?","content":null,"pubDate":"2021-11-30 04:38:03","full_description":"“For the desire of money is the root of all evils: which some coveting have erred from the faith, and have entangled themselves in many sorrows.” Thus spake Saint Paul and what he said in the 1st century AD, is as relevant today. Following the recent sale of two new franchises by the BCCI in its vaunted milch cow, the Indian Premier League, for about $2.3 billion, talk has resurfaced in Australian cricket to allow private equity into the game, most likely through selling stakes in BBL franchises. Former Cricket NSW CEO Andrew Jones wrote a brilliant, definitive treatise on why Australian cricket should be wary of private equity . Cricket followers the world over are dazzled by the amount of money the BCCI generates. Its unencumbered assets are estimated to exceed an eye-watering $5 billion. Apart from the sale of franchises, most of that money has been generated by television rights and the BCCI’s glittering IPL with attached media rights. It reflects the massive following and incredible passion cricket commands in that country. But it must be remembered that cricket in India has little to no competition from other sports, unlike Australia, and India is 60 times Australia’s population. The abbreviation, BCCI, stands for the Board of Control for Cricket in India; “control” being the operative word. There has been no effort, even in these woke times, to drop “control” from the name. It is a point little understood and even less appreciated. No office-bearer of the BCCI is elected without the implicit consent of the Indian government, which effortlessly calls the shots. The IPL has sold two new franchises for $2.5 billion. Credit: Getty Australia has consistently produced the world’s best cricket team for most of the past 150 years, despite a small populace, and (cycles apart) there is little reason to fear it is not sustainable. We produced champion teams with whatever resources we generated. There has never been more money in cricket than now. So, why should Australian cricket channel Oliver Twist and want more? Why is it never enough? How is any sale of stakes in cricket going to be viewed by the estimated 150,000 people who selflessly volunteer for our game throughout Australia, every summer weekend? Haven’t we built the game on the back of their blood, sweat and tears? It beats me why arguments are advanced, every few years, to sell off the family silver (stakes in cricket) to the barbarians at the gate (private equity). Are we wilfully blind to the fate of our former state-owned institutions and organisations which have been privatised such as Telstra (Telecom Australia), the Commonwealth Bank, the Commonwealth Serum Laboratories (CSL Ltd), Qantas etc? What has happened post-privatisation, except the enrichment of a motley crew of Gordon Gekkos? Oh yes, a rise in costs and fall in service standards. Will these altruistic private equity geniuses show us innovative ways of monetising cricket, without affecting its noble soul? Will their objectives be strengthening and growing the game in Australia, or merely worshipping Mammon? Do we seriously believe the two are compatible? If they are incompatible, how will their differences be settled? Will cricket be the winner? Australian cricket has nothing coercive in its armoury to “persuade” an intransigent, disaffected or recalcitrant franchisee, while IPL franchisees know the old Indian idiom well: “If you want to live in the water, you cannot pick a fight with the crocodile”. Their relationships with the BCCI are unfailingly cordial. We should simply stop dreaming about making ever more money and, dare I say it, even spending more on the grassroots development of the game. Cut the cloth to suit the purse. It would be interesting to see how much of the money CA generated in the past decade or two has gone straight into the game’s grassroots development. Past captains of Australia and past directors of CA that I have spoken to are adamant that cricket, at both the state and federal level, is increasingly bloated with bureaucracy and overheads. Before we talk of the money running down or out and exploring alternative funding streams, cricket needs to introspect, do a hard audit and publicly share how it is spending its money. Darshak Mehta OAM is the co-founder of cricket-based charities, The LBW Trust and The Chappell Foundation. A businessman, investor and philanthropist, he was an informal advisor to the Australian cricket team on three tours of India. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh"},{"title":"IPL franchise sales a warning for Australian cricket, not an invitation","link":"https://www.theage.com.au/sport/cricket/ipl-franchise-sales-a-warning-for-australian-cricket-not-an-invitation-20211118-p59a6t.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Australia has consistently produced world-beating cricket teams, and there is little reason to fear it is not sustainable. So, why should Australian cricket chase more money?","content":null,"pubDate":"2021-11-30 04:38:03","full_description":"“For the desire of money is the root of all evils: which some coveting have erred from the faith, and have entangled themselves in many sorrows.” Thus spake Saint Paul and what he said in the 1st century AD, is as relevant today. Following the recent sale of two new franchises by the BCCI in its vaunted milch cow, the Indian Premier League, for about $2.3 billion, talk has resurfaced in Australian cricket to allow private equity into the game, most likely through selling stakes in BBL franchises. Former Cricket NSW CEO Andrew Jones wrote a brilliant, definitive treatise on why Australian cricket should be wary of private equity . Cricket followers the world over are dazzled by the amount of money the BCCI generates. Its unencumbered assets are estimated to exceed an eye-watering $5 billion. Apart from the sale of franchises, most of that money has been generated by television rights and the BCCI’s glittering IPL with attached media rights. It reflects the massive following and incredible passion cricket commands in that country. But it must be remembered that cricket in India has little to no competition from other sports, unlike Australia, and India is 60 times Australia’s population. The abbreviation, BCCI, stands for the Board of Control for Cricket in India; “control” being the operative word. There has been no effort, even in these woke times, to drop “control” from the name. It is a point little understood and even less appreciated. No office-bearer of the BCCI is elected without the implicit consent of the Indian government, which effortlessly calls the shots. The IPL has sold two new franchises for $2.5 billion. Credit: Getty Australia has consistently produced the world’s best cricket team for most of the past 150 years, despite a small populace, and (cycles apart) there is little reason to fear it is not sustainable. We produced champion teams with whatever resources we generated. There has never been more money in cricket than now. So, why should Australian cricket channel Oliver Twist and want more? Why is it never enough? How is any sale of stakes in cricket going to be viewed by the estimated 150,000 people who selflessly volunteer for our game throughout Australia, every summer weekend? Haven’t we built the game on the back of their blood, sweat and tears? It beats me why arguments are advanced, every few years, to sell off the family silver (stakes in cricket) to the barbarians at the gate (private equity). Are we wilfully blind to the fate of our former state-owned institutions and organisations which have been privatised such as Telstra (Telecom Australia), the Commonwealth Bank, the Commonwealth Serum Laboratories (CSL Ltd), Qantas etc? What has happened post-privatisation, except the enrichment of a motley crew of Gordon Gekkos? Oh yes, a rise in costs and fall in service standards. Will these altruistic private equity geniuses show us innovative ways of monetising cricket, without affecting its noble soul? Will their objectives be strengthening and growing the game in Australia, or merely worshipping Mammon? Do we seriously believe the two are compatible? If they are incompatible, how will their differences be settled? Will cricket be the winner? Australian cricket has nothing coercive in its armoury to “persuade” an intransigent, disaffected or recalcitrant franchisee, while IPL franchisees know the old Indian idiom well: “If you want to live in the water, you cannot pick a fight with the crocodile”. Their relationships with the BCCI are unfailingly cordial. We should simply stop dreaming about making ever more money and, dare I say it, even spending more on the grassroots development of the game. Cut the cloth to suit the purse. It would be interesting to see how much of the money CA generated in the past decade or two has gone straight into the game’s grassroots development. Past captains of Australia and past directors of CA that I have spoken to are adamant that cricket, at both the state and federal level, is increasingly bloated with bureaucracy and overheads. Before we talk of the money running down or out and exploring alternative funding streams, cricket needs to introspect, do a hard audit and publicly share how it is spending its money. Darshak Mehta OAM is the co-founder of cricket-based charities, The LBW Trust and The Chappell Foundation. A businessman, investor and philanthropist, he was an informal advisor to the Australian cricket team on three tours of India. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage"},{"title":"“It doesn’t make sense to me”: Shane Warne expresses his disappointment over not having David Warner in Australia’s leadership role","link":"https://thesportsrush.com/cricket-news-it-doesnt-make-sense-to-me-shane-warne-expresses-his-disappointment-over-not-having-david-warner-in-australias-leadership-role/","keywords":["Cricket","David Warner","Shane Warne","The Ashes"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Steve Smith is formally back as Australia’s vice-captain, but Shane Warne wanted David Warner to have that opportunity. After all the speculations, Pat Cummins is the new test captain of Australia. He will be Australia’s 47th test captain, whereas he is the first pacer to lead Australia in 65 years. Steve Smith is the new… The post “It doesn’t make sense to me”: Shane Warne expresses his disappointment over not having David Warner in Australia’s leadership role appeared first on The SportsRush.","content":"Steve Smith is formally back as Australia’s vice-captain, but Shane Warne wanted David Warner to have that opportunity. After all the speculations, Pat Cummins is the new test captain of Australia. He will be Australia’s 47th test captain, whereas he is the first pacer to lead Australia in 65 years. Steve Smith is the new vice-captain, and he is formally back in the leadership role. The return of Smith in the leadership role has been under scrutiny. During the sandpaper gate, Steve Smith was the captain of the side, whereas David Warner was the vice-captain. Both of them were removed from their respective duties after the game. Tim Paine then took over the leadership role and Australia retained the Ashes under him in 2019. Shane Warne believes David Warner deserves to be in a leadership role Shane Warne is surprised that Steve Smith is back in the leadership role, whereas Warner is left out. It is said that Warner has been banned for life for any type of leadership role in the side. Warner believes that Warner has the best cricketing brain in the team. According to Warne, If Smith can come back, then Warner can too. #OnThisDay two years ago, David Warner became the 27th man to hit a Test triple-hundred. Only Brian Lara has gone on to hit 400. Will anyone ever break his record? pic.twitter.com/SZXxxRn94S — Wisden (@WisdenCricket) November 30, 2021 “With Sandpapergate back in South Africa a few years ago, how can the captain be allowed to take up another leadership role where a player like David Warner, who’s probably got the best cricket brain in the team, isn’t allowed to?” Warne asked. “If you’re going to ban a player but allow the captain to have another chance, it doesn’t make sense to me.” “I would’ve thought they’re either both available again, and we’ve all moved on, and we’ve put that in the past, and you can be captain or vice-captain again, or you can’t … I don’t think you can pick and choose one player or not.” However, Pat Cummins has fully backed Steve Smith as his vice-captain. According to Cummins, Steve is the best player to assist him during the game. The first Ashes 2021 test will be played at the Gabba from 8th December 2021.   The post “It doesn’t make sense to me”: Shane Warne expresses his disappointment over not having David Warner in Australia’s leadership role appeared first on The SportsRush.","pubDate":"2021-11-30 04:10:13","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Bangladesh vs Pakistan, 1st Test, Day 5 Live Cricket Score","link":"https://sports.ndtv.com/cricket/bangladesh-vs-pakistan-1st-test-day-5-live-cricket-score-2630047","keywords":null,"creator":null,"video_url":null,"description":"BAN vs PAK, 1st Test live: Pakistan will look to seal victory on the final day of the opening Test against Bangladesh in Chattogram.","content":null,"pubDate":"2021-11-30 03:35:43","full_description":"Pakistan will look to seal victory on the final day after openers Abid Ali and Abdullah Shafique scored individual fifties as they ended Day 4 of the first Test on a high against Bangladesh in the opening Test in Chattogram. The visitors were comfortably placed at 109/0 at Stumps on Day 4 and need just 93 more runs to win on the final day. Earlier, Bangladesh struggled at the crease as they set Pakistan a target of 202 runs. Batting first, hosts Bangladesh had put up a first innings total of 330 runs with Liton Das going on to make his maiden ton and Hasan Ali being the pick of the Pakistan bowlers with his five-wicket haul. They then bowled Pakistan out for 286 to take a first innings lead of 44 runs. Abid Ali scored a century for Pakistan while Taijul Islam picked seven wickets in the innings. In their second innings, Bangladesh were bowled out for a total of 157, with Liton top-scoring for the hosts with a knock of 59 and Shaheen Afridi picking five wickets for Pakistan. ( LIVE SCORECARD ) 2 runs. Full ball, on off. Abdullah Shafique defends this off the front foot towards mid on. Full ball, on off. Abdullah Shafique drives it to covers. Drifting on the pads this time. Abdullah Shafique flicks it to fine leg. The fielder there fumbles a little and the batters take a couple. Abu Jayed bowls this down the leg side. Abdullah Shafique looks to flick it away but the ball is way too down the leg side. On a length, on off. Abdullah Shafique defends this solidly off the back foot. Change. Abu Jayed (2-0-13-0) is back on. FOUR! He makes it three in a row! Just a tad short again, on off. Abid Ali gets deep in his crease and punches it through covers for another boundary. Just 70 more needed. FOUR! Another one! Shorter length this time. Abid Ali hangs back and pulls it towards deep mid-wicket for another boundary. FOUR! Runs are coming quickly for Pakistan here! Fuller delivery on middle. Abid Ali whips it off his legs and gets it past diving mid on fielder for a boundary. Shorter length, around off. Abid Ali cuts it to the point fielder. An arm ball this time on middle. Abid Ali defends this off the back foot. Tossed up on off. Defended off the front foot. Full ball, on middle. Abdullah Shafique drives it to short mid-wicket. Short ball this time on off. Abdullah Shafique ducks under it comfortably. On a length, on off. Abdullah Shafique defends this off the front foot. FOUR! CLASSY SHOT! Half-volley on middle. Abdullah Shafique presents the full face of his blade and drives it past mid on for a beautiful boundary. Overpitched on off. Abdullah Shafique drives it straight back to the bowler. Back of a length, around off. Abdullah Shafique gets on the back foot and punches it through covers for a couple. Tossed up again on off. Abid Ali defends this off the front foot towards the off side.","image_url":"https://c.ndtvimg.com/2021-11/aic6sqc_abid-ali-afp_625x300_30_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"“I didn’t really understand the logic”: Moises Henriques expresses disappointment over not being selected in Australia’s Ashes 2021 squad","link":"https://thesportsrush.com/cricket-news-i-didnt-really-understand-the-logic-moises-henriques-expresses-disappointment-over-not-being-selected-in-australias-ashes-2021-squad/","keywords":["Cricket","Ashes","Ashes 2021","Moises Henriques"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ashes 2021: All-rounder Moises Henriques is disappointed over not being picked in Australia’s Ashes 2021 squad. Moises Henriques has shown his disappointment over not being selected in Australia’s Ashes squad. Henriques was a part of the 19-men squad that was set to play two tests in South Africa. It is worth noting that he is… The post “I didn’t really understand the logic”: Moises Henriques expresses disappointment over not being selected in Australia’s Ashes 2021 squad appeared first on The SportsRush.","content":"Ashes 2021: All-rounder Moises Henriques is disappointed over not being picked in Australia’s Ashes 2021 squad. Moises Henriques has shown his disappointment over not being selected in Australia’s Ashes squad. Henriques was a part of the 19-men squad that was set to play two tests in South Africa. It is worth noting that he is the only available player of that squad to be left out. After all the speculations, Pat Cummins is the new test captain of Australia. He will be Australia’s 47th test captain, whereas he is the first pacer to lead Australia in 65 years. Steve Smith is the new vice-captain, and he is formally back in the leadership role. Usman Khawaja and Jhye Richardson have also made their comebacks. Ashes 2021: Moises Henriques “didn’t really understand the logic” Apart from the Ashes squad, Moises is even omitted from the Australia-A squad. Henriques is set to lead Sydney Sixers for their third straight title in the Big Bash League. Henriques has not played any four-day game between the break and he believes it’s a “huge fall”. Moises last played a test game in 2016 against Sri Lanka. “I have a different view to what the selectors do,” he told reporters, per cricket.com.au. “To be picked on one Test tour and be told that I was there and thereabouts to be playing on that tour, then the next Test tour rolls around and you’re not in the best 25. “It’s a huge fall, considering I hadn’t played any other four-day games or (Sheffield) Shield games in that break.” “I didn’t agree with the process of it all. I didn’t really understand the logic.” Easy to forget Moises Henriques was selected for the cancelled SA Test tour in March. He could have batted at 5. A delayed IPL + the fact he didn’t want to quarantine for 2 weeks in Syd meant he missed NSW’s first two Shield games & has been leapfrogged by others. @FoxCricket — Tom Morris (@tommorris32) November 24, 2021 Henriques insists that he still has the utmost respect for George Bailey. However, he does not agree with his decision. “You don’t necessarily agree, but you both understand that is OK, we’ve got to move forward,” he said. “Even when he’s delivering bad news … he’s been honest and told me his point of view.” George Bailey confirms Moises’ test career is “not-over” After the announcement of the squads, George Bailey also confirmed that it is not the end of Henriques’ test career. “We know he’s a quality player and he’s been particularly consistent, but I guess it’s a slight difference of our Ashes focus of trying to win the here and now versus the balance of the Australia A-game,” he said. “It’s just unfortunate we haven’t been able to see him play any cricket up until this point.” Australia and England will face each other in the first Ashes test from 8 December 2021 at the Gabba. The post “I didn’t really understand the logic”: Moises Henriques expresses disappointment over not being selected in Australia’s Ashes 2021 squad appeared first on The SportsRush.","pubDate":"2021-11-30 03:25:09","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Feeling at home","link":"https://www.tribuneindia.com/news/sports/feeling-at-home-344600","keywords":null,"creator":null,"video_url":null,"description":"Kanpur, November 29 Debutant Rachin Ravindra and No. 11 batsman Ajaz Patel combined in a stunning rearguard to secure New Zealand's thrilling draw in the opening Test against India today. Chasing 284 for victory on a final day surface, New Zealand were in tatters at 155/9 with at least eight overs to go and the light steadily fading at the Green Park Stadium. End of streak The draw breaks a sequence of 14 successive results (win/loss) in Tests in India. It was the longest streak. There were 13 results in a row in India between 1988 and 1994 Rachin in his first Test match and Ajaz as well showed a lot of character — Kane Williamson, New Zealand skipper Their last batting pair of Ravindra and Patel faced relentless spin from both ends with a shoal of close-in fielders around the bat but managed to survive the last 52 balls to deny India. \"I suppose the beauty of Test cricket really, where there can be a lot of excitement,\" New Zealand captain Kane Williamson said of what he called \"an exciting day\". \"Obviously when the win was out of the question, a draw is the next best option to try and fight for, and there was a lot of effort going into trying to achieve that. Rachin in his first Test match and Ajaz as well showed a lot of character to bat those few overs there against high-quality, world class spin as the light was dimming.\" Floodgates opened After a wicketless morning session, seamer Umesh Yadav struck with the first ball after lunch to break the 76-run stand between overnight batsmen Will Somerville and Tom Latham. Somerville had walked out as nightwatchman after Will Young's late dismissal on Sunday but played like a specialist batsman for his 36 off 110 balls. His dismissal opened the floodgates for India's three-pronged spin attack. Ravichandran Ashwin (3/35) cut short Latham's industrious knock of 52 and Ravindra Jadeja (4/40) dismissed veteran Ross Taylor on the stroke of tea. The onus was on Williamson to save the match but the New Zealand captain fell for 24, trapped leg-before by a Jadeja delivery that kept low. Although wickets kept tumbling, time was also running out for India as the on-field umpires kept checking the light-meter readings. India deployed seven fielders around the bat but were still thwarted by the over-my-body defiance from Ravindra and Patel. Ravindra faced 91 balls for his 18 not out, while Patel survived 23 balls to stay unbeaten on two. — Reuters","content":null,"pubDate":"2021-11-30 02:41:53","full_description":"Kanpur, November 29 Debutant Rachin Ravindra and No. 11 batsman Ajaz Patel combined in a stunning rearguard to secure New Zealand’s thrilling draw in the opening Test against India today. Chasing 284 for victory on a final day surface, New Zealand were in tatters at 155/9 with at least eight overs to go and the light steadily fading at the Green Park Stadium. End of streak The draw breaks a sequence of 14 successive results (win/loss) in Tests in India. It was the longest streak. There were 13 results in a row in India between 1988 and 1994 Rachin in his first Test match and Ajaz as well showed a lot of character — Kane Williamson, New Zealand skipper Their last batting pair of Ravindra and Patel faced relentless spin from both ends with a shoal of close-in fielders around the bat but managed to survive the last 52 balls to deny India. “I suppose the beauty of Test cricket really, where there can be a lot of excitement,” New Zealand captain Kane Williamson said of what he called “an exciting day”. “Obviously when the win was out of the question, a draw is the next best option to try and fight for, and there was a lot of effort going into trying to achieve that. Rachin in his first Test match and Ajaz as well showed a lot of character to bat those few overs there against high-quality, world class spin as the light was dimming.” Floodgates opened After a wicketless morning session, seamer Umesh Yadav struck with the first ball after lunch to break the 76-run stand between overnight batsmen Will Somerville and Tom Latham. Somerville had walked out as nightwatchman after Will Young’s late dismissal on Sunday but played like a specialist batsman for his 36 off 110 balls. His dismissal opened the floodgates for India’s three-pronged spin attack. Ravichandran Ashwin (3/35) cut short Latham’s industrious knock of 52 and Ravindra Jadeja (4/40) dismissed veteran Ross Taylor on the stroke of tea. The onus was on Williamson to save the match but the New Zealand captain fell for 24, trapped leg-before by a Jadeja delivery that kept low. Although wickets kept tumbling, time was also running out for India as the on-field umpires kept checking the light-meter readings. India deployed seven fielders around the bat but were still thwarted by the over-my-body defiance from Ravindra and Patel. Ravindra faced 91 balls for his 18 not out, while Patel survived 23 balls to stay unbeaten on two. — Reuters","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/11/2021_11$largeimg_1578656036.jpg","source_id":"tribuneindia"},{"title":"Ashwin keeps cool after going past Harbhajan","link":"https://www.tribuneindia.com/news/sports/ashwin-keeps-cool-after-going-past-harbhajan-344603","keywords":null,"creator":null,"video_url":null,"description":"kanpur, November 29 \"Feels absolutely nothing at all.\" With these words off-spinner Ravichandran Ashwin today played down his milestone of becoming India's third-highest wicket-taker in the Test cricket. Ashwin dismissed Tom Latham to claim his 418th Test wicket and go past Harbhajan Singh on the final day of the opening Test against New Zealand here. Only Anil Kumble and Kapil Dev are ahead of him in the overall standings. After India could not close out the game, Ashwin was asked what the milestone made him feel. \"Absolutely nothing at all. These are milestones that are constantly kept on tab, it's wonderful. Ever since Rahul bhai has taken over, he's kept saying how many wickets you take, how many runs you make in 10 years' time, you won't remember them,\" Ashwin said. \"It's the memories that matters so I want to have some special memories going forward in the next 3-4 years.\" He is also the third-highest wicket-taker among active Test cricketers. — PTI","content":null,"pubDate":"2021-11-30 02:41:53","full_description":"kanpur, November 29 “Feels absolutely nothing at all.” With these words off-spinner Ravichandran Ashwin today played down his milestone of becoming India’s third-highest wicket-taker in the Test cricket. Ashwin dismissed Tom Latham to claim his 418th Test wicket and go past Harbhajan Singh on the final day of the opening Test against New Zealand here. Only Anil Kumble and Kapil Dev are ahead of him in the overall standings. After India could not close out the game, Ashwin was asked what the milestone made him feel. “Absolutely nothing at all. These are milestones that are constantly kept on tab, it’s wonderful. Ever since Rahul bhai has taken over, he’s kept saying how many wickets you take, how many runs you make in 10 years’ time, you won’t remember them,” Ashwin said. “It’s the memories that matters so I want to have some special memories going forward in the next 3-4 years.” He is also the third-highest wicket-taker among active Test cricketers. — PTI","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/11/2021_11$largeimg_1540953758.jpg","source_id":"tribuneindia"},{"title":"Was inspired by Harbhajan's famous spell against Australia in 2001: Ashwin","link":"https://www.business-standard.com/article/news-ani/was-inspired-by-harbhajan-singh-s-famous-spell-against-australia-in-2001-ashwin-121113000153_1.html","keywords":null,"creator":null,"video_url":null,"description":"India spinner Ravichandran Ashwin has said that surpassing Harbhajan Singh's tally of 417 Test wickets is a \"wonderful milestone\".Ashwin on Monday had surpassed Harbhajan Singh to become the country's third-highest wicket-taker in Test cricket. Ashwin scalped the wicket of Tom Latham (52) to go past the milestone.\"These are numbers that are just happening because of the effort I have been putting in. I am trying to enjoy my game. I am not worried about what number I am surpassing, it is a wonderful milestone. When Harbhajan Singh bowled that famous spell against Australia in 2001, I did not think I would be an off-spinner one day,\" Ashwin told teammate Shreyas Iyer in a video posted on bcci.tv.\"I was inspired by him and here I am. Actually, I was more of a batter, and a lot of people know this story. After that 2001 Border-Gavaskar Trophy, I decided to take up spin bowling. That's how I started, I have been on my action for a while, don't know whether I can copy Harbhajan's style ...","content":null,"pubDate":"2021-11-30 02:41:00","full_description":"India spinner Ravichandran Ashwin has said that surpassing Harbhajan Singh's tally of 417 Test wickets is a \"wonderful milestone\". Ashwin on Monday had surpassed Harbhajan Singh to become the country's third-highest wicket-taker in Test cricket. Ashwin scalped the wicket of Tom Latham (52) to go past the milestone. \"These are numbers that are just happening because of the effort I have been putting in. I am trying to enjoy my game. I am not worried about what number I am surpassing, it is a wonderful milestone. When Harbhajan Singh bowled that famous spell against Australia in 2001, I did not think I would be an off-spinner one day,\" Ashwin told teammate Shreyas Iyer in a video posted on bcci.tv. \"I was inspired by him and here I am. Actually, I was more of a batter, and a lot of people know this story. After that 2001 Border-Gavaskar Trophy, I decided to take up spin bowling. That's how I started, I have been on my action for a while, don't know whether I can copy Harbhajan's style now,\" he added. The off-spinner had equalled Harbhajan's tally of 417 wickets on Sunday after he dismissed Will Young on Day 4. New Zealand managed to survive by the barest of margins on the last day of the first Test against India after a gritty performance from their lower-order batters insured that visitors walked away with a draw here at Green Park, Kanpur on Monday. \"It is still sinking in the fact that we could not win, we were so close yet so far. Tough thing to get over for me, it happened once in Jamaica. It takes some time for me as a bowler, it just did not happen today,\" said Ashwin. \"I mean it is a matter of pride. You play for India, I had my 200th wicket on the same ground and now I surpassed Harbhajan Singh's tally on this ground. I had not played the last Test in Christchurch before the Coronavirus (COVID-19) pandemic, god has been kind and I have been able to turn it around,\" he added. Team India managed to take eight wickets on Day 5 of the ongoing first Test but some late drama and stout-hearted performance from visitors' batters clawed back victory from the jaws of hosts. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211130/thumb-121113000153.jpg","source_id":"business-standard"},{"title":"‘Huge fall’: Forgotten star baffled by Test axing","link":"https://www.news.com.au/sport/cricket/i-didnt-really-understand-veteran-allrounder-moises-henriques-baffled-by-test-axing/news-story/c9570814b93b9900e229b9d284bed73e","keywords":null,"creator":null,"video_url":null,"description":"Moises Henriques was on track for a long-awaited return to Test cricket earlier this year, but the New South Wales veteran suddenly finds himself well out of contention through no fault of his own.","content":null,"pubDate":"2021-11-30 02:16:00","full_description":"Moises Henriques was on track for a long-awaited return to Test cricket earlier this year, but the New South Wales veteran suddenly finds himself well out of contention through no fault of his own. Henriques was part of the Australian Test squad for last summer’s Border-Gavaskar Trophy, but was not selected during the four-match series against India. The all-rounder was also named in the Australian squad scheduled to tour South Africa in February, but the Test series was postponed due to Covid-19 concerns. Sport‘s greatest rivalry is just around the corner and you can catch the Ashes live and ad-break free during play. New to Kayo? Start your free trial today > Matthew Wade had been omitted from the squad, and several pundits believed Henriques would have replaced the Tasmanian at No. 5 in the South Africa tour went ahead. But earlier this month, the 34-year-old was not named in either of the Australian squads that travelled to Queensland ahead of the Ashes. Henriques did not play any first-class cricket between March and November due to Indian Premier League commitments, and that lack of red-ball cricket at least partly contributed to his axing. “I have a different view to what the selectors do,” Henriques said. “To be picked on one Test tour and be told that I was there and thereabouts to be playing on that tour, then the next Test tour rolls around and you‘re not in the best 25. “It‘s a huge fall, considering I hadn’t played any other four-day games or (Sheffield) Shield games in that break. “I didn‘t agree with the process of it all. “I didn‘t really understand the logic. “But it‘s not my job to understand the logic either. “It‘s just my job to go out and keep playing as well as I can.” Henriques has been one of the most consistent performers in the Sheffield Shield over the past 24 months – since September 2019, he has amassed 1145 runs at 60.26 in the first-class competition, scoring five centuries and three fifties in that time. Last year, he was named joint Sheffield Shield Player of the Season alongside Victorian batter Nic Maddinson. Speaking to reporters earlier this month, national selector George Bailey said it was “unfortunate” that Henriques had not had an opportunity to push his case for selection since returning from the second leg of the IPL. Henriques delayed his return from the United Arab Emirates to avoid hotel quarantine and subsequently missed the Blues’ first two Sheffield Shield matches of the summer. When he finally joined the New South Wales side ahead of last week’s first-class match against Victoria at the MCG, the Australia and Australia A squads had already been announced. T20 World Cup hero Mitchell Marsh and Queensland batter Matt Renshaw were included in the Australia A squad, with both seemingly leapfrogging Henriques in the pecking order. “Unfortunate for him, that we haven’t been able to see him play any cricket up until this point,” Bailey said. “I‘ve been in good contact with Mo and he knows that not being here, certainly as part of the A squad, is not necessarily the end for him. “We know he‘s a quality player and he’s been particularly consistent, but I guess it’s a slight difference of our Ashes focus of trying to win the here and now versus the balance of the Australia A game.” Henriques made his Test debut back in 2013, but has only represented Australia in the game’s longest format on four occasions – his last appearance in the Baggy Green came more than five years ago. Regardless, Henriques is adamant he can make a long-awaited return to the Test side if he continues piling on the runs at domestic level. “I still believe if I score enough runs, keep banging the door down and keep doing what I know I can do well, then I‘ll still play another Test match for Australia,” he said. Henriques will lead the Sydney Sixers in the eleventh edition of the Big Bash League this summer, with the men in pink hunting for a third consecutive title. The Sixers will face the Melbourne Stars for their tournament opener at the SCG on Sunday, with the first ball scheduled for 7.15pm AEDT. Australia and Australia A will play a three-day internal match in Brisbane starting on Wednesday, but Queensland’s dreary weather threatens to interrupt the squad’s Ashes preparations. The first Test between Australia and England gets underway on Wednesday, December 8 at the Gabba. The start of the BBL season is just days away but it’s not too late to join the KFC SuperCoach BBL action and win some amazing prizes. Here’s how to pick a team in five minutes. Cricket fans were at the edge of their seat as India desperately searched for a decisive wicket against world Test champions New Zealand. Shane Warne has pitched an idea for the Ashes series to be saved from Western Australia’s uncertainty with something never seen before.","image_url":null,"source_id":"news"},{"title":"EVERY delivery of the Black Caps last wicket defiance","link":"https://www.news.com.au/sport/cricket/every-delivery-of-the-black-caps-last-wicket-defiance/video/c50e85b8cb1aa6177364a2ab598c94d3","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The last wicket partnership between Rachin Ravindra and Ajaz Patel saw off 52-deliveries in fading light to deny India victory in the First Test.","content":null,"pubDate":"2021-11-30 02:04:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Cricket: Poor preparation, distractions no concern for England&#039;s Buttler","link":"https://www.thestar.com.my/sport/cricket/2021/11/30/cricket-poor-preparation-distractions-no-concern-for-england039s-buttler","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - England's Jos Buttler believes the team that deals best with the disrupted preparations and distractions around a \"unique\" Ashes series will have the best chance of walking away with the spoils. Read full story","content":null,"pubDate":"2021-11-30 01:49:00","full_description":"SYDNEY (Reuters) - England's Jos Buttler believes the team that deals best with the disrupted preparations and distractions around a \"unique\" Ashes series will have the best chance of walking away with the spoils. The wicketkeeper-batsman and his team mates from England's Twenty20 World Cup campaign finally emerged from quarantine and joined up with the rest of the test squad on the Gold Coast on Tuesday. The Queensland rain might have thrown another spanner into the works by washing out the first day of an intra-squad match, but Buttler was phlegmatic about his lack of red-ball preparation ahead of next week's first test in Brisbane. \"In this day and age, lots of us go between formats quite often. In the COVID era things have changed quite a lot as well, with quarantine rules making certain things a little bit trickier,\" he told reporters. \"I do think it's something that you just have to deal with as a modern player, to be able to walk into situations without having full preparation. \"No team should be using that as excuses, you can still turn up on that first day and play a really good test match.\" Before agreeing to tour, England's players negotiated hard over the restrictions they would be playing under during the five tests around the country, particularly the right to bring their families with them to Australia. The arrival of the Omicron coronavirus variant on Australian shores could potentially force Cricket Australia to move the fifth test away from Perth, or to adjust the conditions for players and their families. Buttler, however, was reluctant to engage in debates about hypothetical situations. \"I find it tiring to talk about it when you don't know,\" he said. \"That's not for me to worry about at the minute. There's a week to go until the first test here and all our energies are focused on that.\" Other distractions for the England team have come from the racism row that has engulfed the English game, while Australia have been dealing with the fallout from the 'sexting' scandal that cost them their captain, Tim Paine. Buttler said he would be taking a \"fearless\" approach to his first test tour of Australia and maintained he would be focusing purely on the cricket as England attempt to wrest back the Ashes. \"Around the Ashes, there's always certain things go on and the guys that can deal with the distractions an Ashes series throws up ... is the team that's going to play best,\" the 31-year-old added. (Editing by Peter Rutherford)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/11/30/1386822.jpg","source_id":"thestar_my"},{"title":"Cricket: Poor preparation, distractions no concern for England's Buttler  ","link":"https://www.channelnewsasia.com/sport/cricket-poor-preparation-distractions-no-concern-englands-buttler-2346761","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-11-30 01:44:41","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--GDje6bT7--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-11-30t014352z_1_lynxmpehat01p_rtroptp_3_cricket-test-eng-ind.jpg?itok=zY2jRIoq","source_id":"channelnewsasia"},{"title":"'Fascinating how Jadeja is preferred over him': NZ great wonders how 'best in the world' Ashwin 'regularly gets dropped' - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMixgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmQtdnMtbnotZmFzY2luYXRpbmctaG93LWphZGVqYS1pcy1wcmVmZXJyZWQtb3Zlci1oaW0tbnotZ3JlYXQtZGFuaWVsLXZldHRvcmktd29uZGVycy1ob3ctYmVzdC1pbi10aGUtd29ybGQtYXNod2luLXJlZ3VsYXJseS1nZXRzLWRyb3BwZWQtMTAxNjM4MjM2MTIyODY1Lmh0bWzSAcoBaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2NyaWNrZXQvaW5kLXZzLW56LWZhc2NpbmF0aW5nLWhvdy1qYWRlamEtaXMtcHJlZmVycmVkLW92ZXItaGltLW56LWdyZWF0LWRhbmllbC12ZXR0b3JpLXdvbmRlcnMtaG93LWJlc3QtaW4tdGhlLXdvcmxkLWFzaHdpbi1yZWd1bGFybHktZ2V0cy1kcm9wcGVkLTEwMTYzODIzNjEyMjg2NS1hbXAuaHRtbA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Fascinating how Jadeja is preferred over him': NZ great wonders how 'best in the world' Ashwin 'regularly gets dropped'  Hindustan TimesHighlights, India vs New Zealand 2021, Full Cricket .. Patel conjure miraculous escape as match ends in draw  FirstpostIndia vs New Zealand, 1st Test Day 5 Highlights: Tailenders and bad light help New Zealand pull off a thrilling draw  Times of IndiaDraw is fantastic considering disjointed preparations: Williamson  The Indian ExpressIND vs NZ 2021, 1st Test, Day 5 Highlights: New Zealand Eke Out a Thrilling Draw vs India at Kanpur  News18View Full coverage on Google News","content":null,"pubDate":"2021-11-30 01:42:01","image_url":null,"source_id":"google"},{"title":"Ashes 2021-22: Shane Warne attempts to steal fifth Test from Perth over border rules, backs MCG","link":"https://www.perthnow.com.au/sport/the-ashes/ashes-2021-22-shane-warne-attempts-to-steal-fifth-test-from-perth-over-border-rules-backs-mcg--c-4754746","keywords":null,"creator":["Samantha Rogers"],"video_url":null,"description":"Australian cricket legend Shane Warne says he wants to see Perth’s fifth Ashes Test moved to the MCG as a gift to sport-starved Melbournians.","content":null,"pubDate":"2021-11-30 01:39:00","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4754746/8b7588f3133cbe9f681b3c723e4f8bc6b6b1fab1-16x9-x1y0w2446h1376.jpg","source_id":"perthnow"},{"title":"Warner leadership ban 'doesn't make sense'","link":"https://wwos.nine.com.au/cricket/ashes-shane-warne-on-david-warner-steve-smith-penalties/c4326655-f96b-4d3f-8b63-ce642dc6b4ca","keywords":null,"creator":["wwos"],"video_url":null,"description":"Shane Warne says David Warner and Steve Smith should have been given the same opportunity for a return to Test leadership.","content":"Test great Shane Warne has voiced his bewilderment at how David Warner was overlooked for a leadership position in favour of Steve Smith, after the former Test skipper was appointed vice captain last week.Warne struggled to fathom how Warner was left out of the running, while Smith was restored to a leadership position, on account of differing punishments for their roles in 'Sandpapergate'.Warner and Smith both played central parts in the 2018 ball-tampering scandal, resulting in Smith receiving a two-year leadership suspension and Warner accepting a lifetime leadership ban.READ MORE: Judges' scorecards almost rob George Kambosos of historic titleREAD MORE: Umpire's shocker remains after NZ batter takes too long to challengeREAD MORE: Frank Williams, Williams F1 team founder, dies at 79As both men played their part in the controversy, Warne was disappointed and confused as to how Smith could be welcomed back to a leadership role while Warner was barred.\"With Sandpapergate back in South Africa a few years ago, how can the captain be allowed to take up another leadership role where a player like David Warner, who's probably got the best cricket brain in the team, isn't allowed to?\" he said.\"If you're going to ban a player but allow the captain to have another chance, it doesn't make sense to me.\"I would've thought they're either both available again, and we've all moved on, and we've put that in the past, and you can be captain or vice-captain again, or you can't ... I don't think you can pick and choose one player or not.\"Former Australia cricket captain Ian Chappell was also angered by the dissimilar punishments dished out to Warner and Smith, arguing that Cricket Australia should have shown more consistency.\"I wish that Cricket Australia had made a clean break, but for Cricket Australia to get anything right at the moment is asking a bit much,\" Chappell told 2GB's WWOS Radio last week.\"... Either Steve Smith has a two-year ban from captaincy and so does David Warner, or Steve Smith has a life ban and so does Dave Warner. Same thing.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-11-30 01:30:40","full_description":"Test great Shane Warne has voiced his bewilderment at how David Warner was overlooked for a leadership position in favour of Steve Smith, after the former Test skipper was appointed vice captain last week. Warne struggled to fathom how Warner was left out of the running, while Smith was restored to a leadership position, on account of differing punishments for their roles in 'Sandpapergate'. Warner and Smith both played central parts in the 2018 ball-tampering scandal, resulting in Smith receiving a two-year leadership suspension and Warner accepting a lifetime leadership ban. READ MORE: Judges' scorecards almost rob George Kambosos of historic title READ MORE: Umpire's shocker remains after NZ batter takes too long to challenge READ MORE: Frank Williams, Williams F1 team founder, dies at 79 As both men played their part in the controversy, Warne was disappointed and confused as to how Smith could be welcomed back to a leadership role while Warner was barred. \"With Sandpapergate back in South Africa a few years ago, how can the captain be allowed to take up another leadership role where a player like David Warner, who's probably got the best cricket brain in the team, isn't allowed to?\" he said. \"If you're going to ban a player but allow the captain to have another chance, it doesn't make sense to me. \"I would've thought they're either both available again, and we've all moved on, and we've put that in the past, and you can be captain or vice-captain again, or you can't ... I don't think you can pick and choose one player or not.\" Former Australia cricket captain Ian Chappell was also angered by the dissimilar punishments dished out to Warner and Smith , arguing that Cricket Australia should have shown more consistency. \"I wish that Cricket Australia had made a clean break, but for Cricket Australia to get anything right at the moment is asking a bit much,\" Chappell told 2GB's WWOS Radio last week. \"... Either Steve Smith has a two-year ban from captaincy and so does David Warner, or Steve Smith has a life ban and so does Dave Warner. Same thing.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/396226/pickerimage.jpg","source_id":"nine"},{"title":"Secrets behind Australia's canny World Cup win","link":"https://wwos.nine.com.au/rugby/rugby-world-cup-2027-australia-bid-hosting-rights-nick-mcardle-explainer/a7c44347-7a0a-4ac5-873e-6ec36169692b","keywords":null,"creator":["wwos"],"video_url":null,"description":"Nick McArdle explains why Australia is in the box seat to host the 2027 Rugby World Cup - and what happens next.","content":"A conversation at my local over the weekend...\"This whole Rugby World Cup bid thing. So Australia's got the 2027 tournament right?\"Yeah... sort of.\"But the old blokes with the leather patches over there in London or Dublin or wherever it is... they reckon we're the preferred candidate?\"Yeah, we are but they don't actually officially award it until May next year.Watch the 2022 Super Rugby Pacific season on Stan Sport. Start your seven day free trial here!\"Yeah, but we're the only country they're talking to… what did Kearnsy call it, 'targeted dialogue?'Yeah, it's virtually ours but there's still a way to go.\"So what's the hold up?\"And that right there is a good question.What is the hold up? What's changed from the way World Rugby (WR) normally runs the process and what put Australia ahead of the game?READ MORE: Wallabies caught up in rugby's COVID-19 chaosREAD MORE: Legend's big legacy call for 2027 Rugby World CupREAD MORE: 'Tarnished' Aussie ref gets apology from SpringboksAlright. Here goes.For the first time in World Cup history, 2027 will be run as a genuine joint venture between the host nation and WR.WR will be hands on in the planning and delivery and because it's never been done before the details are still being worked out. It's all the granular stuff – operational components, governance, organisational structure, the legal documentation to confirm who's doing what, when and how.In the past, the host union has set up a local organising committee (LOC) which worked in partnership with WR. Now it'll be essentially one organisation.Between now and May, Rugby Australia (RA) will work with WR to sort out that joint venture so everyone is clear on their roles and responsibilities.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!The hope is to reduce costs by making the most of resources that already exist at WR. In the past there were often two people doing the one role, one from the LOC and one at WR.And the framework that's decided now will be the template for RWC to come. A cut and paste model that can be picked up and put into future host nations. It'll be a much leaner and more efficient, streamlined operation. It also has the potential to open opportunities for emerging nations to have a crack.RA sources say the chief executive of the organising committee isn't guaranteed to be an Aussie. It's the third biggest sporting event in the world so that appointment will be made based on merit not where the candidate was born or where they live. There'll be a worldwide search.And here's a key to Australia's success. Phil Kearns and his team have been advocating for a joint venture model all along. They've pushed for it from very early in the process because they identified the inefficiencies in the old structure and realised it wasn't sustainable. That put us ahead of the game.The joint venture model is also reflective of what's happening around the world with other major sporting events – the FIFA women's football World Cup, Cricket World Cups - those international federations have huge input into how things are run locally.While RA believes in the new structure it insists it will work hard to make sure Australia, as a host nation, isn't any worse off financially. Profit share is an ongoing discussion but Australia's bid team says it's happy with where things sit right now. Both parties understand each other's expectations but have yet to formally agree.There's pressure, and all at RA feel it, to wring as much out of this opportunity as possible. The deal must set the Australian game up for success. The profit must leave a legacy far beyond 2028 or 2029. The money needs to help grow the game for decades into the future. More than $40m profit from the 2003 World Cup was squandered when the then ARU wanted to ring fence the cash and the states said no. That can't happen again.What happens next?The most immediate challenge is to lock in government support at both state and federal level. And there should be significant financial support because the RWC is the third biggest sporting event in the world. It generates significant economic impact – 13,000 jobs, 200,000 international visitors, $1 billion dollars in direct visitor expenditure. Plenty of heads on plenty of beds.And being in an exclusive partnership with WR holds some sway when it comes to those government discussions. There's no fear of a 2023 scenario where you have one candidate going in as WR's \"preferred host\" (South Africa) only to see another secure the rights in a last minute flurry (France). So government will cough up in a big way. The question right now is how much?This has been a team effort all along. While Sir Rod Eddington and his high profile bid board smoothed the way in London, RA CEO Andy Marinos and bid boss Kearns will always credit the grunt work done by RA executive Anthony French, operations and planning guru Alicia Keogh, marketing manager Liz Manawaiti and media man Tom Kennedy. Kearns will keep reminding them the work's not done yet. He likens it to the 75th minute of a Test match where they've just hit the lead and they have to close it out. Love a good sporting cliché.World Rugby needs us as much as we need them...This is a test case and it is critically important for WR that it works because the World Cup funds the game. It generates in excess of 95 per cent of WR's revenues. That revenue drives everything – the women's game, sevens, development in emerging nations, medical research and the list goes on.So the decision to move to a new model has really played into Australia's hands. We're seen as a safe pair of hands. If you're implementing change you want to do it with people you know you can work with and that you trust.","pubDate":"2021-11-30 01:22:01","full_description":"A conversation at my local over the weekend... \"This whole Rugby World Cup bid thing. So Australia's got the 2027 tournament right?\" Yeah... sort of. \"But the old blokes with the leather patches over there in London or Dublin or wherever it is... they reckon we're the preferred candidate?\" Yeah, we are but they don't actually officially award it until May next year. Watch the 2022 Super Rugby Pacific season on Stan Sport. Start your seven day free trial here! \"Yeah, but we're the only country they're talking to… what did Kearnsy call it, 'targeted dialogue?' Yeah, it's virtually ours but there's still a way to go. \"So what's the hold up?\" And that right there is a good question. What is the hold up? What's changed from the way World Rugby (WR) normally runs the process and what put Australia ahead of the game? READ MORE: Wallabies caught up in rugby's COVID-19 chaos READ MORE: Legend's big legacy call for 2027 Rugby World Cup READ MORE: 'Tarnished' Aussie ref gets apology from Springboks Alright. Here goes. For the first time in World Cup history, 2027 will be run as a genuine joint venture between the host nation and WR. WR will be hands on in the planning and delivery and because it's never been done before the details are still being worked out. It's all the granular stuff – operational components, governance, organisational structure, the legal documentation to confirm who's doing what, when and how. In the past, the host union has set up a local organising committee (LOC) which worked in partnership with WR. Now it'll be essentially one organisation. Between now and May, Rugby Australia (RA) will work with WR to sort out that joint venture so everyone is clear on their roles and responsibilities. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here! The hope is to reduce costs by making the most of resources that already exist at WR. In the past there were often two people doing the one role, one from the LOC and one at WR. And the framework that's decided now will be the template for RWC to come. A cut and paste model that can be picked up and put into future host nations. It'll be a much leaner and more efficient, streamlined operation. It also has the potential to open opportunities for emerging nations to have a crack. RA sources say the chief executive of the organising committee isn't guaranteed to be an Aussie. It's the third biggest sporting event in the world so that appointment will be made based on merit not where the candidate was born or where they live. There'll be a worldwide search. And here's a key to Australia's success. Phil Kearns and his team have been advocating for a joint venture model all along. They've pushed for it from very early in the process because they identified the inefficiencies in the old structure and realised it wasn't sustainable. That put us ahead of the game. The joint venture model is also reflective of what's happening around the world with other major sporting events – the FIFA women's football World Cup, Cricket World Cups - those international federations have huge input into how things are run locally. While RA believes in the new structure it insists it will work hard to make sure Australia, as a host nation, isn't any worse off financially. Profit share is an ongoing discussion but Australia's bid team says it's happy with where things sit right now. Both parties understand each other's expectations but have yet to formally agree. There's pressure, and all at RA feel it, to wring as much out of this opportunity as possible. The deal must set the Australian game up for success. The profit must leave a legacy far beyond 2028 or 2029. The money needs to help grow the game for decades into the future. More than $40m profit from the 2003 World Cup was squandered when the then ARU wanted to ring fence the cash and the states said no. That can't happen again. What happens next? The most immediate challenge is to lock in government support at both state and federal level. And there should be significant financial support because the RWC is the third biggest sporting event in the world. It generates significant economic impact – 13,000 jobs, 200,000 international visitors, $1 billion dollars in direct visitor expenditure. Plenty of heads on plenty of beds. And being in an exclusive partnership with WR holds some sway when it comes to those government discussions. There's no fear of a 2023 scenario where you have one candidate going in as WR's \"preferred host\" (South Africa) only to see another secure the rights in a last minute flurry (France). So government will cough up in a big way. The question right now is how much? This has been a team effort all along. While Sir Rod Eddington and his high profile bid board smoothed the way in London, RA CEO Andy Marinos and bid boss Kearns will always credit the grunt work done by RA executive Anthony French, operations and planning guru Alicia Keogh, marketing manager Liz Manawaiti and media man Tom Kennedy. Kearns will keep reminding them the work's not done yet. He likens it to the 75th minute of a Test match where they've just hit the lead and they have to close it out. Love a good sporting cliché. World Rugby needs us as much as we need them... This is a test case and it is critically important for WR that it works because the World Cup funds the game. It generates in excess of 95 per cent of WR's revenues. That revenue drives everything – the women's game, sevens, development in emerging nations, medical research and the list goes on. So the decision to move to a new model has really played into Australia's hands. We're seen as a safe pair of hands. If you're implementing change you want to do it with people you know you can work with and that you trust.","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/395668/pickerimage.jpg","source_id":"nine"},{"title":"Root reiterates he cannot recall racism at Yorkshire","link":"https://www.thenews.com.pk/print/912793-root-reiterates-he-cannot-recall-racism-at-yorkshire","keywords":null,"creator":null,"video_url":null,"description":"LONDON: England captain Joe Root said Monday he stood by his statement that he could not recall witnessing any instances of racism at Yorkshire as English cricket grapples with the fallout from the scandal.The game in England has been rocked by damaging revelations from Pakistan-born former...","content":null,"pubDate":"2021-11-30 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Game deteriorated after department teams' closure: Misbah","link":"https://www.thenews.com.pk/print/912794-game-deteriorated-after-department-teams-closure-misbah","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Pakistan’s former captain and former head coach and chief selector Misbah-ul-Haq believes that the quality of the game has deteriorated due to the closure of department cricket.Talking to a group of journalists here on Monday, Misbah said that the departments were taking care of the...","content":null,"pubDate":"2021-11-30 01:00:00","full_description":null,"image_url":null,"source_id":"thenews"},{"title":"Fox Theatre: Aussie Stars relive Lyon’s missed runout","link":"https://www.news.com.au/sport/cricket/fox-theatre-aussie-stars-relive-lyons-missed-runout/video/84ad85cb8280d8ca7308afce06d91151","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Pat Cummins, Nathan Lyon and Steve Smith take a look back at Nathan Lyon's infamous missed runout during the 2019 Ashes.","content":null,"pubDate":"2021-11-30 00:56:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Leschenault Cricket Club father-son duo Rowan and Shane Jamieson pile on 137 runs against Hay Park","link":"https://thewest.com.au/news/harvey-waroona-reporter/leschenault-cricket-club-father-son-duo-rowan-and-shane-jamieson-pile-on-137-runs-against-hay-park-ng-b882078498z","keywords":null,"creator":["Luke McPherson"],"video_url":null,"description":"A heartwarming partnership caught the attention of the crowd at the Leschenault cricket ground earlier in November, with a father-son duo sharing the pitch for more than 33 overs.","content":null,"pubDate":"2021-11-30 00:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/B882078498Z/1638172741437_GMG3I9F57.1-2.jpg","source_id":"thewest"},{"title":"Josh Inglis power hitting on display in England","link":"https://www.news.com.au/sport/cricket/josh-inglis-power-hitting-on-display-in-england/video/85c2c0a4e7d54050a9dde8ae5da83be7","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Josh Inglis has emerged as a frontrunner to replace Tim Paine and nab himself a baggy green, watch some of his power hitting when playing for Leicestershire County.","content":null,"pubDate":"2021-11-29 22:52:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"All-time classic nail-biter leaves cricket world in awe","link":"https://wwos.nine.com.au/cricket/india-vs-new-zealand-first-test-draw-kane-williamson-reaction/0f77ebb7-5a49-48b6-9788-75f0dc526113","keywords":null,"creator":["wwos"],"video_url":null,"description":"The first Test between India and New Zealand went down to the wire, drawing praise from around the cricket world.","content":"New Zealand captain Kane Williamson has praised the \"old school Test cricket\" on display as the Kiwis held on for a thrilling draw against India in Kanpur.Needing 284 for victory on the final day, New Zealand finished on 9/165, with the last pair of Rachin Ravindra and Ajaz Patel surviving for 52 balls before bad light brought an early end to the match.Ravindra, the 22-year-old on Test debut, faced 91 balls for his 18, keeping the Indian spinners, led by Ravi Jadeja (4-40) and Ravichandran Ashwin (3-35), at bay.READ MORE: England great baffled by Steve Smith callREAD MORE: Kambosos eyeing home-based title defenceREAD MORE: Warne swings axe in brutal Ashes selection call\"It was old school test cricket, trying to bat out a day and survive which isn't seen all that often in recent years,\" Williamson said.\"It was good fun and nice to come away with the draw in the end.\"That's the beauty of test cricket where there can be excitement in the draw.\"Williamson himself faced 112 balls for 24, while nightwatchman Will Somerville occupied the crease for 110 balls for 36, and opener Tom Latham faced 146 balls in compiling 52.https://twitter.com/Gmaxi_32/status/1465270977307176961?ref_src=twsrc%5Etfwhttps://twitter.com/davidwarner31/status/1465279875061796866?ref_src=twsrc%5EtfwAustralian stars Glenn Maxwell and David Warner were among those to tweet their appreciation of such a tense draw.\"How good is Test cricket,\" Warner wrote.\"Five days, tough cricket played by both teams and it ends in a draw. That's why we love it.\"It's New Zealand's 10th consecutive Test match without defeat, an all-time record for that country.The Kiwis haven't lost since being defeated by Australia in Sydney in January 2020, since then winning eight and drawing two matches.\"Coming into the day we were aware that all three results were possible,\" Williamson said.https://twitter.com/JimmyNeesh/status/1465272614625026056?ref_src=twsrc%5Etfwhttps://twitter.com/virendersehwag/status/1465295000024014857?ref_src=twsrc%5Etfw\"Having said that there was a lot of hard work to do to give yourself a chance to chase versus trying to chase too early and finding yourselves in a sticky position. It was a matter of trying to take the day deep. And if we were close we would have had a crack if we were in the right position. But we weren't in the end.\"India were able to put us under pressure throughout the sessions. Scoring was tough to come by, and there was a lot of navigating low bounce and balls that spun and those sort of things.\"If things unfold ideally, then it would have been great to try and get close to the desired result. Having said that, I think going through that second session, it was quickly off the cards. Then we saw a lot of contributions from the guys where they really knuckled down and fought hard to get a draw in the end. That was the next best thing for us.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-11-29 21:58:10","full_description":"New Zealand captain Kane Williamson has praised the \"old school Test cricket\" on display as the Kiwis held on for a thrilling draw against India in Kanpur. Needing 284 for victory on the final day, New Zealand finished on 9/165, with the last pair of Rachin Ravindra and Ajaz Patel surviving for 52 balls before bad light brought an early end to the match. Ravindra, the 22-year-old on Test debut, faced 91 balls for his 18, keeping the Indian spinners, led by Ravi Jadeja (4-40) and Ravichandran Ashwin (3-35), at bay. READ MORE: England great baffled by Steve Smith call READ MORE: Kambosos eyeing home-based title defence READ MORE: Warne swings axe in brutal Ashes selection call \"It was old school test cricket, trying to bat out a day and survive which isn't seen all that often in recent years,\" Williamson said. \"It was good fun and nice to come away with the draw in the end. \"That's the beauty of test cricket where there can be excitement in the draw.\" Williamson himself faced 112 balls for 24, while nightwatchman Will Somerville occupied the crease for 110 balls for 36, and opener Tom Latham faced 146 balls in compiling 52. Australian stars Glenn Maxwell and David Warner were among those to tweet their appreciation of such a tense draw. \"How good is Test cricket,\" Warner wrote. \"Five days, tough cricket played by both teams and it ends in a draw. That's why we love it.\" It's New Zealand's 10th consecutive Test match without defeat, an all-time record for that country. The Kiwis haven't lost since being defeated by Australia in Sydney in January 2020, since then winning eight and drawing two matches. \"Coming into the day we were aware that all three results were possible,\" Williamson said. \"Having said that there was a lot of hard work to do to give yourself a chance to chase versus trying to chase too early and finding yourselves in a sticky position. It was a matter of trying to take the day deep. And if we were close we would have had a crack if we were in the right position. But we weren't in the end. \"India were able to put us under pressure throughout the sessions. Scoring was tough to come by, and there was a lot of navigating low bounce and balls that spun and those sort of things. \"If things unfold ideally, then it would have been great to try and get close to the desired result. Having said that, I think going through that second session, it was quickly off the cards. Then we saw a lot of contributions from the guys where they really knuckled down and fought hard to get a draw in the end. That was the next best thing for us.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/11/396112/pickerimage.jpg","source_id":"nine"},{"title":"Resolute Black Caps deny India in dramatic draw","link":"https://www.news.com.au/sport/cricket/resolute-black-caps-deny-india-in-dramatic-draw/video/4b9cf602f1702e206b9a54a6a3a2e5ba","keywords":null,"creator":null,"video_url":null,"description":"Cricket: New Zealand have held on to pull out a dramatic draw in their first Test against India, finishing Day at 165/9.","content":null,"pubDate":"2021-11-29 21:40:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Resolute Black Caps deny India in dramatic draw","link":"https://www.cairnspost.com.au/sport/cricket/resolute-black-caps-deny-india-in-dramatic-draw/video/4b9cf602f1702e206b9a54a6a3a2e5ba","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: New Zealand have held on to pull out a dramatic draw in their first Test against India, finishing Day at 165/9.","content":null,"pubDate":"2021-11-29 21:40:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Ben Stokes uninjured despite training scare","link":"https://www.news.com.au/sport/cricket/ben-stokes-uninjured-despite-training-scare/video/9e2e6b5b17b041acaee7e87ad9c64a53","keywords":null,"creator":null,"video_url":null,"description":"Cricket: England skipper Joe Root admits the team was worried when star all-rounder Ben Stokes was hit on the forearm during a nets session.","content":null,"pubDate":"2021-11-29 21:28:09","full_description":null,"image_url":null,"source_id":"news"}]}