{"newsArray":[{"title":"Cricket-Struggling Crawley likely to retain place after McCullum backing","link":"https://www.thestar.com.my/sport/cricket/2022/08/21/cricket-struggling-crawley-likely-to-retain-place-after-mccullum-backing","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - England are likely to persist with opener Zak Crawley in the second test against South Africa after coach Brendon McCullum threw his weight behind the struggling opener. Read full story","content":null,"pubDate":"2022-08-21 04:57:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/21/1705593.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"World of cricket: Bumrah ruled out of Asia Cup","link":"https://sportstar.thehindu.com/cricket/jasprit-bumrah-ruled-out-of-asia-cup-world-of-cricket-rudi-koertzen-passes-away/article65790535.ece","keywords":null,"creator":["\n        Abhishek Mukherjee  \n    "],"video_url":null,"description":"Jasprit Bumrah has a back injury and has been ruled out of Asia Cup; former umpire Rudi Koertzen passes away aged 73.","content":null,"pubDate":"2022-08-21 04:30:13","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Who will replace injured Shaheen Shah Afridi in Asia Cup 2022 squad? Pakistan fans confused, check reacts","link":"https://zeenews.india.com/cricket/who-will-replace-injured-shaheen-shah-afridi-in-asia-cup-2022-squad-pakistan-fans-confused-check-reacts-2499598.html","keywords":null,"creator":null,"video_url":null,"description":"Take a look at the reactions of Pakistan fans as they are confused who to pick for the Asia Cup 2022 to replace injured Shaheen Shah Afridi. However, the last call will be with the national selectors of the Pakistan men's cricket team.","content":"Shaheen Shah Afridi's knee injury ruling him out of Asia Cup 2022 has started a new debate in Pakistan. That which bowler should not replace the pace sensation. Shaheen, who is clearly Pakistan's best fast bowler across formats, will be tough to replace, especially in a multi-nation tournament like Asia Cup 2022 but some fans believe that there should be a like-for-like replacement . A left-arm pacer should be replaced by a left-arm pacer only and many are forwarding names of Wahab Riaz and Mohammad Amir to selectors on Twitter. There are others who feel Hasan Ali, who was not a part of the squad earlier, will become an automatic pick in the squad as he is the next in line. Mir Hamza, again a left-arm pacer, and Zaman Khan's name have also been thrown on the table. Take a look at the reactions of Pakistan fans as they are confused who to pick for the Asia Cup 2022. However, the last call will be with the national selectors of the Pakistan men's cricket team. Pakistan cannot deprive themselves from a left arm fast bowler in AsiaCup 2022. Mir Hamza can be considered as a major option to replace Shaheen Shah Afridi. Mir has experience and knows the art of swinging the new ball as well. Mir Hamza can become a surprise card in AsiaCup! — Arfa Feroz Zake (@ArfaSays_) August 20, 2022 Hassan Ali is Likely To Replace Shaheen Shah Afridi in Asia Cup Squad. (Source - Cricket Pakistan) — Maham Fatima (@Maham0fficial_2) August 20, 2022 #Amir Shaheen Shah Afridi ruled out of Asia cup. Now Muhammad Amir is the perfect replacement pls bring him back ____ #Amir #AsiaCup2022 #ShaheenShahAfridi pic.twitter.com/tFDCeanbIq pic.twitter.com/4zXFLd115P — Zafar Ullah (@Az365865724) August 20, 2022 Who should replace Shaheen Shah Afridi for #AsiaCup2022 ? — Israr Ahmed Hashmi (@IamIsrarHashmi) August 20, 2022 Amir and Riaz are one of the most unlikeliest selections as they are not on selectors' radar anymore. Hasan Ali, Mir Hamza could be the two bowlers the selectors pick between, knowing their recent exploits. In absence of Shaheen, onus to perform will drop on the likes of Haris Rauf and Naseem Shah. Babar Azam will be banking on them to ensure Shaheen's absence is not felt during the Asia Cup 2022, that kickstarts on August 27. Both Rauf and Naseem are having a good time vs Netherlands, picking wickets in abundance and this good form is needed ahead of theall-important Asia Cup clash vs India. Pakistan are expected to meet India not just once but thrice in the tournament. Firstly, at the group stage then in the Super 4 and if all things go well for both the countries, then in the final as well. Meanwhile, reactions have started coming in since the announcement that Shaheen will no more be a part of Pakistan squad for Asia Cup 2022, with Waqar Younis saying that his non-selection will be big relief for India. Check his comments here .","pubDate":"2022-08-21 04:12:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Shadab Khan introduces Babar Azam as cricket's 'Cristianal Messi' to Manchester United legend","link":"https://www.indiatoday.in/sports/cricket/story/watch-shadab-khan-introduces-babar-azam-as-cricket-s-cristianal-messi-to-manchester-united-legend-1990555-2022-08-21?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Watch: Shadab introduces Babar as cricket's 'Cristianal Messi' to United legend","content":null,"pubDate":"2022-08-21 03:57:39","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Hooda stabilește un record mondial unic după ce India a învins Zimbabwe într-un al doilea meci internațional","link":"https://www.obiectivtulcea.ro/deepak-hooda-stabileste-un-record-mondial-unic-dupa-ce-india-a-invins-zimbabwe-intr-un-al-doilea-meci-international/","keywords":["sport"],"creator":["Sidony Cato"],"video_url":null,"description":"Deepak Hooda nu a pierdut niciun meci de la debutul său internațional Foto: AP punctele...","content":"Deepak Hooda nu a pierdut niciun meci de la debutul său internațional Foto: AP Echipa Indiei și-a continuat cursa de aur în cricket cu bile albă, reclamând o altă victorie în serie sâmbătă (20 august) la Harare Cricket Ground. După ce a câștigat primul joc fără a transpira cu 10 wickets, Men in Blue a avut o ieșire confortabilă în al doilea joc, când au câștigat acasă o victorie de cinci wicket. Ind vs Zim: India condusă de KL Rahul dobândește recordul mondial masiv pentru Pakistan, după ce și-a asigurat o serie de victorii în Zimbabwe ZIM VS IND: Distanța de la trei porturi Shardol Thakur a ajutat India să câștige 5 porți, victorie în serie completă Cu victoria sa, Deepak Hoda a stabilit un record mondial unic. De la debutul său cu echipa națională la începutul acestui an, jucătorul polivalent nu a înfruntat încă nicio înfrângere în niciun meci internațional. De-a lungul carierei sale, India a câștigat toate meciurile la care Hooda a jucat unsprezece. Acestea includ 7 unități ODI și 9 T20I. Seria de 16 victorii consecutive a lui Hooda este cea mai mare pentru orice jucător din istoria internațională de cricket după debutul său. Hoda l-a depășit pe superstarul român Satvik Nadegutla, care a câștigat 15 meciuri consecutive după ce a debutat. Sud-africanul David Miller și internaționalul român Shantano Vachist au câștigat 13 meciuri la rând după ce au debutat. Hoda a impresionat în ambele forme de la debut și și-a asigurat un loc în echipa Indiei pentru Cupa Asiei și pare că va călători în Australia pentru Cupa Mondială T20 2022. Deepak Hooda va egala „record mondial unic” dacă India va învinge Zimbabwe în deschiderea seriei ODI Urmărește: Sanju Samson ia o reținere acrobatică pentru a-l elimina pe Takudzwanach Kaetano în al doilea meci ODI împotriva lui ZIM „Creator. Rezolvator de probleme premiat. Evanghelist muzical. Introvertit incurabil”.","pubDate":"2022-08-21 03:42:49","image_url":null,"source_id":"obiectivtulcea","country":["romania"],"category":["sports"],"language":"romanian"},{"title":"David Warner: ‘It’s important for me to give back’","link":"https://www.cairnspost.com.au/sport/cricket/david-warner-its-important-for-me-to-give-back/video/42449b8199fd14b37f66a6adff01b793","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: David Warner says he feels it is important to 'give back' after signing a deal with the Sydney Thunder for two years.","content":null,"pubDate":"2022-08-21 03:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"High-profile cricket couple call it quits","link":"https://www.cairnspost.com.au/sport/peter-siddle-and-anna-weatherlike-split-after-five-years-of-marriage/news-story/27f4c480e573215e3a1c622742d8d1c3","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian cricket star Peter Siddle and Anna Weatherlake have reportedly ended their marriage after five years.","content":"Sport Don't miss out on the headlines from Sport. Followed categories will be added to My News. Australian cricket star Peter Siddle and Anna Weatherlake have reportedly ended their marriage after five years. Siddle and Weatherlake tied the knot in 2017 after the couple got engaged in 2015. Stream Over 50 Sports Live & On-Demand with Kayo. New to Kayo? Start your free trial now > Images on social media showed Weatherlake soaking up the European sun with her new beau – Victorian builder Nick McKimm, according to The Daily Telegraph . The pair uploaded several images showing them getting close as they lived it up with friends on the Greek Islands. Anna and Nick. Picture: Instagram Nick and Anna. Picture: Instagram Siddle, the former Victorian and Australian fast bowler popped the question to his blonde beauty during a weekend getaway on the Mornington Peninsula two after winning the Sheffield Shield in 2015. The pair had been together for four years before Siddle got down on one knee with the help of one of the couple’s dogs. “Every night before bed we take the collars off our dogs, so I started taking Oscar’s off and there was a diamond ring hanging from the end of it. I couldn’t believe it,” Weatherlake said. “I didn’t even realise, I went to pass the collar to Sids to put on the bedside table and he just stared at me and the collar and then I noticed it.’’ The couple in 2020. (AAP Image/Scott Barbour) NO ARCHIVING The couple in 2019. (Photo by Graham Denholm/Getty Images) Siddle opened up on his alcohol struggles on Neroli Meadows’ podcast Ordineroli Speaking in 2020, revealing the toll it was taking on him and his relationships. “I was partying too hard, and it was getting out of control,” he said. “All my relationships that were real close to me, I was just in a way lying to them all. “I’d got myself in some bad situations that could’ve cost myself a relationship with my now wife. “She comes home to my place with someone else in the room with me, I don’t remember much because I was in the state I was in pretty much every weekend. “That was when I broke down. Yes, I’d f***ed up, but I knew that I wanted her to be in my life. “I begged her to death, but also, I knew things had to change then. “I was living two lives in a way. I was living the party boy life and trying to be a cricketer. “Not just a cricketer who rocks up on the weekend and plays 40 overs and then hangs out with the boys. I was an Australian cricketer, at the time pretty much close to the peak of my powers, and I was throwing it all away.” Siddle walked away from the alcohol and as of 2020 had gone almost eight years without a drink. Originally published as Peter Siddle and Anna Weatherlike split after five years of marriage More related stories AFL ‘Deserved better’: Rutten’s teary final message as coach Ben Rutten was reduced to tears in the rooms after Saturday night’s loss. Here’s what he had to say. Read more AFL AFL coach axed effective immediately After a tumultuous week of constant speculation, Essendon coach Ben Rutten has finally been dealt the killer blow from the board. Read more","pubDate":"2022-08-21 03:25:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"'Shaheen Afridi's injury is..': Waqar Younis takes DIG at India ahead of IND vs PAK Asia Cup clash, fans give fitting reply","link":"https://zeenews.india.com/cricket/shaheen-shah-afridis-injury-is-big-relief-for-waqar-younis-takes-a-dig-at-rohit-sharma-and-co-ahead-of-india-vs-pakistan-asia-cup-2022-clash-2499581.html","keywords":null,"creator":null,"video_url":null,"description":"The talks have started in Pakistan cricket over who could replace Shaheen in the squad. Former Pakistan pacer and coach Waqar Younis feels that absence of Shaheen due to his injury will come as a big relief for the Indian top-order batters.","content":"With Pakistan pace sensation Shaheen Shah Afridi ruled out of the Asia Cup 2022 due to a knee injury which is a big blow for Babar Azam's team . Shaheen played a big role in Pakistan's massive win India at the T20 World Cup 2021. Pakistan had beaten India by 10 wickets in the opening game of the mega event. Shaheen had, in fact, played a huge role in Pakistan reaching the semi-finals of the competition where they lost to Australia. It is true that his absence now gives Rohit Sharma's India an edge over Pakistan and weakens their playing XI as well. The talks have started in Pakistan cricket over who could replace Shaheen in the squad. Former Pakistan pacer and coach Waqar Younis feels that absence of Shaheen due to his injury will come as a big relief for the Indian top-order batters. Rohit, KL Rahul and Virat Kohli are supposed to be India's top 3. Last year at T20 World Cup, Shaheen has dismissed Rohit and Rahul in similar fashion in just his opening spell. Pakistan fans feel that he could have done the same this year also as India's right-handed batters at the top have problems facing quality left-arm swing bowling. Younis wrote on his Twitter: \"Shaheen’s injury Big relief for the Indian top order batsmen. Sad we won’t be seeing him in #AsiaCup2022 Get fit soon Champ @iShaheenAfridi.\" But his comments did not go down well with the Indian fans who slammed him for making an 'immature' comment, arguing that Indians have now chalked out a plan for Shaheen. Some of the India fans reminded Younis about the Mathew Wade over in the semi-finals of the T20 World Cup when the Aussie smashed him all over the park to take his side to victory and knock Pakistan out of tournament while others suggested to postpone Asia Cup so that Shaheen could be fit and playing for Pakistan vs India. Check out Younis' take and fans reactions below. Every day is not sunday — Manthan Patel (@Manthan9094) August 20, 2022 Every day is not sunday — Manthan Patel (@Manthan9094) August 20, 2022 Kuch din ke liye piche krade Asia cup fit ho jaye toh khel lena — Rakku Maurya1718 (@MauryaRakku) August 20, 2022 Bhai pagla gaye kya? We indians really wanted him this Asia Cup, we know our potentials.. saari hekdi nikal dete isbar. This chap couldn't 20 in an over against Mathew Wade. WC 2003 and WC 2019, these examples are enough for our potentials, dont wanna count more. — hmmm (@sc1m1tar__) August 20, 2022 Don't know about the Pakistanis and their team!! Whether they want to win against india or they want to win the asia cup!! Cuz u can win asia cup even without winning against india or vice versa!! It's ok!! When a nations cricketing benchmark is india wt can we expect __ — harsha (@tangudu_harsha) August 20, 2022","pubDate":"2022-08-21 03:03:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"David Warner finally set for BBL return after shock Sydney Thunder deal","link":"https://www.foxsports.com.au/cricket/cricket-2022-big-bash-david-warner-warner-signs-rumours-cricket-australia-uae-t20-league-major-news-contract-two-year-deal/news-story/45823c1f816f62dbbda8c0825778da8f","keywords":null,"creator":null,"video_url":null,"description":"David Warner has ended any speculation surrounding his future, with the cricket great focused on supporting the “next generation” after signing a two-year deal with the Sydney Thunder.","content":"David Warner has ended any speculation surrounding his future, with the cricket great focused on supporting the “next generation” after signing a two-year deal with the Sydney Thunder. Warner has been heavily linked with a lucrative offer to join the new UAE T20 League during the summer, after South Africa pulled out of a three-match ODI series with Australia. While the veteran of 91 T20 internationals had reportedly asked for permission to join the competition , he’s set to return to the Big Bash instead. Watch South Africa’s Tour of England. Every ODI & T20 Live & On-Demand on Kayo. New to Kayo? Start your free trial now > The 35-year-old hasn’t represented the Thunder since the third Big Bash season, where he played just one game in the iconic lime green jersey. In a statement released on Sunday morning, the Sydney Thunder described Warner as “one of the biggest coups in the history” of the BBL. The Thunder have revealed that Warner will be available for up to five regular season matches, as well as finals, after his international commitments come to an end. Warner said that he’s “really excited” about returning to the Big Bash this season, as he revealed why he decided to sign the deal. “I’m really excited to get back to the Big Bash with the club where I started,” Warner told the Sydney Thunder. “I care deeply about the game, and I am conscious that the conditions that I enjoy as a professional cricketer have largely come from other senior players who have come before me. “That is how the game is structured and I understand that my contribution to the future of the BBL will hopefully benefit the next generation of players long after I am retired.” Warner has played just two games for the Sydney Thunder, and he’s scored at least a fifty on both occasions. South Africa smash England in First Test | 01:31 In the first ever Sydney Thunder game, the talented run scorer scored 102 not out against the Melbourne Stars. With 96 Tests and 133 ODI’s to his name as well, Warner will bring plenty of experience to a team who were among the better teams last time out – finishing third at the end of the regular season. Head coach Trevor Bayliss said that Warner can help “inspire many” kids to fall in love with the sport. “Davey’s record on the field speaks for itself and I have no doubt he already has, and will continue to, inspire many, many kids to play and love cricket,” Bayliss said. “He is also a passionate and committed family man and that aligns very well with Thunder’s culture and the family nature of the Thunder Nation supporters. “The club has a tremendous group of young talented batters and leaders, with the likes of Jason Sangha, Ollie Davies, Matt Gilkes and Baxter Holt They will all benefit greatly from Davey’s experience and guidance.”","pubDate":"2022-08-21 02:50:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mohammed Shami's love affair with pace continues, Indian speedster buys new car | READ","link":"https://www.indiatvnews.com/sports/cricket/mohammed-shami-s-love-affair-with-pace-continues-indian-speedster-buys-new-car-read-2022-08-21-801669","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket superstar and express pace bowler Mohammed Shami is on a break after the England ODI series as he isn't in team India's scheme of things in the T20I format. The express pacer hasn't been selected for the Asia Cup and it looks almost certain that he wouldn't be selected in the World T20I squad. As of now he isn't playing any international cricket and might take the field for India when Australia tour India for their limited series. Making full use of this break, Shami is spending time with his family and doing the things that he loves. The Indian pacer might be away from cricket for a while, but his love affair with speed continues to reflect in his choices.","content":"Indian cricket superstar and express pace bowler is on a break after the England ODI series as he isn't in team India's scheme of things in the T20I format. The express pacer hasn't been selected for the Asia Cup and it looks almost certain that he wouldn't be selected in the World T20I squad. As of now he isn't playing any international cricket and might take the field for India when Australia tour India for their limited series. Making full use of this break, Shami is spending time with his family and doing the things that he loves. The Indian pacer might be away from cricket for a while, but his love affair with speed continues to reflect in his choices. Mohammed Shami recently bought himself a beautiful sports car and has shared the news with his fans via his social media handles. The Gujarat Titans bowler seems pretty excited about his new car and has posted multiple videos on his Instagram account. It is pretty evident from the video that the new car has made Shami extremely happy and he just can't stop going gaga over it. Seeing Shami all happy and excited, his fans have congratulated him and have also passed on their good wishes. Though Shami hasn't revealed enough about his new ride, let's dive in and see what his new car is all about. The Indian pacer is now the proud owner of the Jaguar F-Type. The Jaguar F-type has many variants, but as far as the basic variant is considered, it might have cost him around INR 97.93 Lakhs whose on-road price goes up to INR 1 crore. One of the most amazing features of this car is that it can go up to 0 to 100 km/hr in a matter of 5.7 seconds. Apart from these, the car has many advanced features. It has a mileage of 12.3kms. The car consists of V8 331 kW which is an extremely powerful engine. The car has two petrol engines and can consistently operate at 297 km/hr.","pubDate":"2022-08-21 02:47:52","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"NED vs PAK Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s NED vs PAK 3rd ODI match at Hazelaarweg, Rotterdam, 230 PM IST, August 21","link":"https://zeenews.india.com/cricket/ned-vs-pak-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ned-vs-pak-3rd-odi-match-at-hazelaarweg-rotterdam-230-pm-ist-august-21-2499570.html","keywords":null,"creator":null,"video_url":null,"description":"Netherlands vs Pakistan Dream11 Team Prediction Netherlands vs Pakistan 3rd ODI match - Check My Dream11 Team, Best players list of NED vs PAK, Netherlands Dream11 Team Player List, Pakistan Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Babar Azam-led Pakistan will have a golden chance to inflict a 3-0 clean sweep over Netherlands in their own backyard when the two sides meet each other in the third and final ODI of the series on Sunday (August 21). Pakistan won the first ODI by 16 runs while winning the second game by a margin of 7 wickets. Their captain Babar has been in tremendous form at the moment, with two quality fifties in the two games so far. He will look to convert the fifties into a big hundred in the 3rd ODI. The 2nd ODI saw Mohammad Rizwan also play a crafty knock. With plenty of runs to score in the chase and Babar back to the hut, Rizwan ensured there were no further hiccups as he stroked a 69 off 82 balls to see his side through and take a 2-0 lead in the three-match series. His knock included 6 fours and 1 six each. Not to forget, the contribution from Agha Salman as well who played a quickfire knock of 50 off 35 balsl that included 5 fours and 2 sixes. __ pic.twitter.com/xnZhxjZoWV — Pakistan Cricket (@TheRealPCB) August 20, 2022 With the ball, Haris Rauf has been exceptional as he picked 3 wickets in the Thursday game vs Netherlands. But a word for Naseen Shah as well. He has been having a great time in Netherlands, picking wickets in the first over of his spell, a habit that Shaheen Shah Afridi has developed. Shaheen, who has been ruled out of Asa Cup 2022, due to an injury has not played a single game vs Netherlands in this series but thanks to Naseem's outbursts in the first spell, his absence has not been felt yet. Pakistan vs Netherlands Dream 11 Prediction: Captain: Imam ul Haq Vice-captain: Stephan Myburgh Suggested Playing XI for Pakistan vs Netherlands 3rd One Day International Dream11 Fantasy Cricket: Batsmen: Imam ul Haq, Fakhar Zaman, Stephan Myburgh, Tom Cooper Wicket-keeper: Mohammad Rizwan All-rounders: Mohammad Nawaz, Bas de Leede Bowlers: Naseem Shah, Shahnawaz Dahani, Paul van Meekeran, Shariz Ahmad Predicted Playing XIs: Pakistan: Imam ul Haq, Fakhar Zaman, Babar Azam, Mohammad Rizwan, Agha Salman, Khushdil Shah, Mohammad Nawaz, Mohammad Nawaz, Naseem Shah, Shahnawaz Dahani, Mohammad Wasim Jr Netherlands: Max O’Dowd, Stephan Myburgh, Bas de Leede, Tom Cooper, Scott Edwards (c & wk), Teja Nidamanuru, Logan van Beek, Tim Pringle, Fred Klaassen, Paul van Meekeran, Shariz Ahmad","pubDate":"2022-08-21 02:28:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Dipika Pallikal shares a never-seen-before PIC with husband Dinesh Karthik, Netizens are in awe - See Inside","link":"https://zeenews.india.com/cricket/dipika-pallikal-shares-a-never-seen-before-pic-with-husband-dinesh-karthik-netizens-are-in-awe-see-inside-2499555.html","keywords":null,"creator":null,"video_url":null,"description":"Karthik is busy playing cricket for India's T20 side, marking his return to the national side after more than 2 years all thanks to his exploits in IPL 2022 with Royal Challengers Bangalore (RCB). Karthik will soon be joining Team India squad for the Asia Cup 2022, the first match being vs Pakistan on August 28.","content":"Dinesh Karthik and Dipika Pallikal are one of the sweetest celebrity couples in India, who just celebrated their 7th marriage anniversary. Dinesh and Dipika had got married via both hindu and christian ceremonies. Dinesh had shared an adorable pic on August 18 with wifey to makr their 7 years while Dipika did the same on August 20. The hindu marriage had taken place on August 19 while they had been wedded as per chrisitianity rituals on August 20. Dipika shared a lovely pic with husband in which they can be seen hugging each other tightly. The picture is from their marriage, 7 years ago. The picture has melted hearts of both of their fans. Netizens are dropping heart emojis and congratulating the couple for completing seven years together. One fan wrote in comments: \"U r awe..n dk is love\". Another dropped a comment: \"Happy anniversary to both of you. My fav sports couples.\" Check out the pic. View this post on Instagram A post shared by Dipika Pallikal Karthik (@dipikapallikal) Karthik is busy playing cricket for India's T20 side, marking his return to the national side after more than 2 years all thanks to his exploits in IPL 2022 with Royal Challengers Bangalore (RCB). Karthik will soon be joining Team India squad for the Asia Cup 2022 , the first match being vs Pakistan on August 28 . On the other hand, Dipika is a successful squash player from India recently won a medal for the country at the Commonwealth Games 2022. She won the mixed doubles bronze in squas at CWG 2022 alongwith Saurav Ghosal. After winning her only medal at CWG this year, she shared her happiness of having won this medal, saying: \"It’s not been an easy ride to get here. This has only been possible because of my family, my team and the different people I had around me to always push me to try and be the best version of myself.\"","pubDate":"2022-08-21 01:50:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Durand Cup: Lcoal favourites ATK Mohun Bagan shocked","link":"https://www.tribuneindia.com/news/sports/durand-cup-lcoal-favourites-atk-mohun-bagan-shocked-423776","keywords":null,"creator":null,"video_url":null,"description":"Kolkata Chennaiyin FC failed to go past Army Red and dropped points after an intense 2-2 draw, while Rajasthan United FC upset ATK Mohun Bagan 3-2 in the Durand Cup here today. Kolkata Jhulan set for international retirement at Lord's? Veteran pacer Jhulan Goswami, the leading wicket-taker in the women's international cricket, is all set to retire at the hallowed Lord's during India's third and final ODI against England on September 24, according to a report. Jhulan will be given a \"proper farewell\" as she could not say \"goodbye on the field\", ESPNCricinfo reported, quoting a board official. Bridgetown (Barbados) New Zealand beat West Indies by 50 runs in 2nd ODI Finn Allen made 96 and Tim Southee took 4/22 as New Zealand beat West Indies by 50 runs under the Duckworth-Lewis system in the second One-day International to level the three-match series. New Zealand made 212 batting first and West Indies were in dire straits at 27/6 until a long rain break and bold late-order batting changed the course of the match on Friday. Karachi Shaheen Afridi ruled out of Asia Cup, England series Pakistan's lead pacer Shaheen Shah Afridi was on Saturday ruled out of the upcoming Asia Cup and the home series against England with a knee injury, dealing a massive blow to the team's prospects. New Delhi Neeraj can compete in Lausanne Diamond League Javelin thrower Neeraj Chopra, can compete in the Lausanne Diamond League Meeting on August 26 if he is \"medically fit\", according to the president of the Athletics Federation of India. — Agencies","content":"Kolkata Chennaiyin FC failed to go past Army Red and dropped points after an intense 2-2 draw, while Rajasthan United FC upset ATK Mohun Bagan 3-2 in the Durand Cup here today. Kolkata Jhulan set for international retirement at Lord’s? Veteran pacer Jhulan Goswami, the leading wicket-taker in the women’s international cricket, is all set to retire at the hallowed Lord’s during India’s third and final ODI against England on September 24, according to a report. Jhulan will be given a “proper farewell” as she could not say “goodbye on the field”, ESPNCricinfo reported, quoting a board official. Bridgetown (Barbados) New Zealand beat West Indies by 50 runs in 2nd ODI Finn Allen made 96 and Tim Southee took 4/22 as New Zealand beat West Indies by 50 runs under the Duckworth-Lewis system in the second One-day International to level the three-match series. New Zealand made 212 batting first and West Indies were in dire straits at 27/6 until a long rain break and bold late-order batting changed the course of the match on Friday. Karachi Shaheen Afridi ruled out of Asia Cup, England series Pakistan’s lead pacer Shaheen Shah Afridi was on Saturday ruled out of the upcoming Asia Cup and the home series against England with a knee injury, dealing a massive blow to the team’s prospects. New Delhi Neeraj can compete in Lausanne Diamond League Javelin thrower Neeraj Chopra, can compete in the Lausanne Diamond League Meeting on August 26 if he is “medically fit”, according to the president of the Athletics Federation of India. — Agencies","pubDate":"2022-08-21 01:38:57","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_1344855608.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Injured Shaheen to miss Asia Cup, England series","link":"https://www.thenews.com.pk/print/984133-injured-shaheen-to-miss-asia-cup-england-series","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Shaheen Shah, the tormentor of India in the T20 World Cup match last year, will be missing out on the action on August 28 when the two arch-rivals clash in the Asia Cup.Shaheen’s return to international cricket has been delayed for another four to six weeks meaning he will not be...","content":"ISLAMABAD: Shaheen Shah, the tormentor of India in the T20 World Cup match last year, will be missing out on the action on August 28 when the two arch-rivals clash in the Asia Cup. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Shaheen’s return to international cricket has been delayed for another four to six weeks meaning he will not be in a position to represent the country in Asia Cup and later in the home series against England. “Shaheen has been advised six weeks rest by the PCB Medical Advisory Committee and independent specialists following the latest scans and MRI reports. This means Shaheen has been ruled out of the ACC T20 Asia Cup and home series against England but is expected to return to competitive cricket in October with the New Zealand T20I tri-series, which will be followed by the ICC Men’s T20 World Cup Australia 2022,” Pakistan Cricket Board (PCB) said on Saturday. 'The News' has learnt that MRI conducted on Shaheen in Rotterdam the other day suggested that the ligament problem because of the overflow of knee fluid still persists. “The moment he injured himself in Sri Lanka while diving some of the knee fluid slipped out of the knee making adjacent ligament fragile. Until fluid completely dries out, chances of his return to international cricket are bleak,” one of the specialists accompanying the team said. He said that he required at least six weeks of rest before a fresh MRI test. “We want to see Shaheen completely fit before he returns to international cricket. It will be extremely difficult for Shaheen to come straight into international cricket. He will need rehabilitation,” he added. Meanwhile, the PCB selectors have started discussions on his replacement for the Asia Cup. “Besides being the best fast bowler in the business, Shaheen also adds variety into the attack, being a left arm bowler. We don’t have any outstanding left-arm pacer to replace him for the Asia Cup. We are considering our options and hopefully will be in a position to finalise his replacement in a couple of days,” a selector told 'The News'. The most likely to be considered for replacing Shaheen are Mohammad Hasnain and Hasan Ali. Shaheen will stay with the squad to complete his rehabilitation. The Pakistan side will arrive in Dubai from Rotterdam on Monday (tomorrow). PCB Chief Medical Officer, Dr Najeebullah Soomro said he had spoken with Shaheen about this. “He is a brave young man who has vowed to come back strongly to serve his country and team. Although he has made progress during his rehabilitation in Rotterdam, it is now clear he will require more time and is likely to return to competitive cricket in October. “PCB’s Sports & Exercise Medicine Department will be working closely with the player over the coming weeks to ensure his safe return to competitive cricket.”","pubDate":"2022-08-21 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Netherlands vs Pakistan 3rd ODI Livestream Details: When and where to watch NED vs PAK, cricket schedule, TV timing in India","link":"https://zeenews.india.com/cricket/netherlands-vs-pakistan-3rd-odi-livestream-details-when-and-where-to-watch-ned-vs-pak-cricket-schedule-tv-timing-in-india-2499545.html","keywords":null,"creator":null,"video_url":null,"description":"Scott Edwards-led Netherlands will take on Babar Azam’s Pakistan in the third ODI series in Rotterdam on Sunday (August 21). Pakistan have sealed the series 2-0.","content":"After winning the first 2 ODIs easily, Babar Azam-led Pakistan will aim to make a clean sweep in the 2nd ODI vs Netherlands on Sunday (August 21). The visitors won the first ODI by 16 runs while they clinched the 2nd match by a margin of 7 wickets. These ODIs are a chance for the team to prepare for the Asia Cup 2022 that kcikstarts on August 27 in UAE. Pakistan captain Babar Azam has been in phenomenal form, scoring 2 fifties so far in the series. He scored a well-crafted 74 off 85 balls in 1st ODI that included 6 fours and 1 six while he smashed 57 off 65 balls in 2nd ODI, that included 7 fours. Every player of our playing 11 is a match winner. Wishing my team the best of luck for upcoming Asia Cup. To the fans, keep me in your prayers for my quick recovery. I'll be back soon Inshallah pic.twitter.com/jW9gGpWWQX — Shaheen Shah Afridi (@iShaheenAfridi) August 20, 2022 Pakistan however have received a massive blow in form of injury of their ace pace bowler Shaheen Shah Afridi who has been ruled out due to an injury. He has already missed the first 2 games of the series and won't feature in the third match as well. Pakistan could have still survived in this series vs Netherlands but what matters is Asia Cup 2022 where Shaheen won't be available and it could affect team's chances in the tournment. Match Details When will the Netherlands vs Pakistan 3rd ODI match be played? The Netherlands vs Pakistan 3rd ODI match will be played on Sunday (August 21). Where will the Netherlands vs Pakistan 3rd ODI match be played? The Netherlands vs Pakistan 3rd ODI match will be played at Hazelaarweg, Rotterdam. What time will the Netherlands vs Pakistan 3rd ODI match start? The Netherlands vs Pakistan 2nd ODI match will start at 230 PM IST. How can I watch Netherlands vs Pakistan 3rd ODI match on TV in India? The Netherlands vs Pakistan 3rd ODI match will be not be available on TV in India. How can I follow the live streaming of the Netherlands vs Pakistan 3rd ODI match? The Netherlands vs Pakistan 3rd ODI match will be streamed live on FanCode website and app.","pubDate":"2022-08-21 00:52:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Boost for Big Bash as Warner returns after nine-year absence","link":"https://www.thestar.com.my/sport/cricket/2022/08/21/cricket-boost-for-big-bash-as-warner-returns-after-nine-year-absence","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - David Warner will play in the Big Bash League (BBL) for the first time in 10 seasons around the new year in a major coup for the Australian competition in an increasingly crowded Twenty20 marketplace. Read full story","content":"SYDNEY (Reuters) - David Warner will play in the Big Bash League (BBL) for the first time in 10 seasons around the new year in a major coup for the Australian competition in an increasingly crowded Twenty20 marketplace. The 35-year-old Australia opener had been linked to the new International League T20 (ILT20) in the United Arab Emirates which, along with another new competition in South Africa, will go head-to-head with the BBL early next year. Warner will bring his star power to the Sydney Thunder at the conclusion of the test series against South Africa in early January and could play as many as five matches, the team said in a news release on Sunday. \"I'm really excited to get back to the Big Bash with the club where I started,\" said Warner, who played one game for the Thunder in each of the first and third seasons of BBL. \"I care deeply about the game, and I am conscious that the conditions that I enjoy as a professional cricketer have largely come from other senior players who have come before me. \"That is how the game is structured and I understand that my contribution to the future of the BBL will hopefully benefit the next generation of players long after I am retired.\" The Thunder said they had not yet appointed a new captain for the season after the departure of Usman Khawaja to the Brisbane Heat. Although Warner would be a natural choice, he is currently ineligible under the terms of the lifetime ban from leadership positions in Australian cricket imposed on him for his part in the 2018 Newlands ball-tampering scandal. With Indian Premier League (IPL) millions backing the leagues in the UAE and South Africa, Cricket Australia face far more competition for marquee names than they have in past years. A number of top players have nominated for the BBL's inaugural draft on Aug. 28, however, including Afghan spinner Rashid Khan and West Indian T20 stalwarts Kieron Pollard and Dwayne Bravo. The 12th edition of the BBL will run from Dec. 13 to Feb. 4. (Reporting by Nick Mulvenney; Editing by Daniel Wallis)","pubDate":"2022-08-21 00:07:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/21/1705511.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"India-Pak Asia Cup clash marks return of greatest rivalry on UAE soil","link":"https://www.thehansindia.com/sports/india-pak-asia-cup-clash-marks-return-of-greatest-rivalry-on-uae-soil-758559","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"After two years of delay caused by the Covid-19 pandemic and a shift in venue due to the economic crisis in Sri Lanka, the Asia Cup is finally going to happen in the UAE from August 27 to September 11.","content":"New Delhi: After two years of delay caused by the Covid-19 pandemic and a shift in venue due to the economic crisis in Sri Lanka, the Asia Cup is finally going to happen in the UAE from August 27 to September 11.What makes this year's tournament, to be held in the T20 format in Dubai and Sharjah, special is that it will also mark the return of the greatest rivalry in men's cricket -- India vs Pakistan. The return of the Asia Cup to the UAE also brings back the tradition of India-Pakistan matches being played in the country through the 1980s and 1990s, mainly in Sharjah. India, the defending champions and seven-time winners of the trophy, will be looking to retain their throne as the best in Asia. A successful defence of the Asia Cup title ahead of the Men's T20 World Cup in Australia in October-November, where they will be facing Pakistan too on October 23, will be a huge boost for India, who have embraced an attacking style of play with the bat since their early exit from the tournament last year. Pakistan, who had a stunning run to the semifinals in the UAE in the T20 World Cup last year, will be looking to be the prime challengers and do an encore of their 10-wicket victory over India during the mega event. There are high chances that the greatest rivalry featuring India and Pakistan will not only happen once or twice, but potentially thrice in the tournament if both teams make it to the finals. After the group stage match on August 28 at the Dubai International Stadium, India and Pakistan will be well on track to face each other in the Super Four stage and, who knows, there could be a tantalising title clash too. In Asia Cup, India have faced Pakistan 14 times, winning eight matches while ending up on the losing side on five occasions. Five of those eight wins have come in India's last six meetings with Pakistan in the Asia Cup since 2010. The last time India lost to Pakistan was in 2014, in Mirpur, Bangladesh. At a time where there is no bilateral cricket between the two teams, an India-Pakistan clash in box-office events like Asia Cup and World Cups is more like touch and go. Of late, India had been the dominator in the big-ticket clash, until Pakistan changed the script last year in Dubai. Shaheen Shah Afridi, Imad Wasim, Hasan Ali, Haris Rauf clicked well in unison to keep India to 151. Captain Babar Azam and his deputy Mohammad Rizwan then finished off the chase with half-centuries, peppered with such precision without being broken by the Indian bowlers for a 01-wicket victory which broke their World Cup hoodoo against them. Unarguably, an India-Pakistan clash is the biggest eyeballs-grabbing match in the cricketing world, financially as well as social media views-wise. But with the hype and pressure around, it is also a match, which will test the mental toughness and temperament of a player. Performing big in India-Pakistan matches can hand a cricketer cult status if he leads the side to a victory while for the losing side, massive backlash is in store back home. Come August 28, an evening blockbuster awaits fans from both India and Pakistan when Babar Azam and Rohit Sharma lead their teams on the field at the Dubai International Stadium to write another chapter of the greatest rivalry in the world of cricket.","pubDate":"2022-08-20 18:08:09","image_url":"https://assets.thehansindia.com/h-upload/2022/08/20/500x300_1308761-aisa-cup.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India take unassailable series lead","link":"https://www.thehansindia.com/sports/cricket/india-take-unassailable-series-lead-758557","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Bowlers, Samson shine in five-wicket win over Zimbabwe in 2nd ODI of 3-match series","content":"Harare: A disciplined bowling show, led by Shardul Thakur's three wickets, and an unbeaten 43 by wicketkeeper-batter Sanju Samson helped India beat Zimbabwe by five wickets in the second ODI at Harare Sports Club on Saturday.With this win, India also take an unassailable 2-0 lead in the three-match series, with Monday's match becoming a dead rubber. The five-wicket victory also means that this was India's 14th win on the trot over Zimbabwe in ODI cricket. After Thakur's 3-38 in seven overs and the rest of the bowlers took a wicket each to bowl Zimbabwe out for just 161 in 38.1 overs, the visitors were in some discomfort at 97-4 in their chase of 167. But Samson, who hit three fours and four sixes in his unbeaten 43 off 39 balls and Deepak Hooda (25, including three fours) shared a 56-run stand to get the match in India's favour with 146 balls remaining. K.L. Rahul's promotion as opener backfired as he was trapped plumb lbw while attempting to flick off Victor Nyauchi. Shikhar Dhawan was aggressive and used his feet well to hit four good-looking boundaries. But he was undone by a well-directed bouncer from Tanaka Chivanga as he pulled but it got big on him and skied to square leg. Ishan Kishan chopped onto his stumps off Luke Jongwe to depart cheaply. But Shubman Gill, batting at three, was at his classy best, bringing out his signature short-arm jab while oozing class with his off-side boundaries and driving straight down the ground with the full face of the bat. Gill's promising knock ended at 33 when he got a top-edge on a slash straight to deep third man. From 97-4 in 14 overs, Hooda and Samson joined forces to take India over the line. Samson brought up India's hundred by driving in the gap between cover and mid-off off Jongwe while Hooda ramped a short ball over the keeper for another boundary in the 16th over. Samson was in his element, smoking Chivanga down the ground for a boundary before slamming Sikandar Raza in the next over through the same region for another four and followed it up by dispatching over long-on for six. After Hooda hit Brad Evans for a boundary through cover, Samson used his feet to smack back-to-back sixes off Sean Williams in the 23rd over. On Williams' slower ball, Samson danced down the pitch to smash down the ground. On the very next ball, Williams dropped short and Samson pulled flat over fine leg for another six. Though Hooda was castled by a yorker from Raza to end the 56-run partnership for the fifth wicket, Samson finished off the chase in style with a huge six over long-on to seal the match and series in India's favour. Earlier, pushed into batting first, the opening pair of Takudzwanashe Kaitano and Innocent Kaia were cautious against the new ball, especially with Mohammed Siraj getting the ball to swing away beautifully. Siraj got the first breakthrough when he shaped the ball away to square up Kaitano. The batter had no other option but to nick behind, and Samson dived full length to his left to complete a one-handed stunning catch. Thakur's short ball down leg beat Innocent Kaia for pace and he gloved behind to Samson. He had his second wicket in the 12th over when captain Regis Chakabva, who promoted himself in the batting order, was undone by extra bounce and nicked to second slip. Zimbabwe's troubles increased when Wesley Madhevere tried to defend, but nicked behind off Prasidh Krishna as the hosts' lost their top four batters for just 11 runs. Their in-form batter Raza cut straight to backward point off Kuldeep Yadav as Zimbabwe lost half of their side for 72 runs. Williams tried to counter-attack with three boundaries and a six. But in a bid to go big, he slogged straight into the hands of the deep square leg off Hooda. Thakur, coming into the eleven in place of Deepak Chahar, struck again as he shattered Jongwe's stumps while Patel got his first wicket with Evans chopping onto his stumps. Burl used a mix of luck and some mighty shots to fetch boundaries and push Zimbabwe's score past 150. But he ran out of support from the other end as Nyauchi and Chivanga were out in quick succession, summing up Zimbabwe's day with the bat.Brief scores: Zimbabwe 161 all out in 38.1 overs (Sean Williams 42; Ryan Burl 39 not out; Shardul Thakur 3-38, Deepak Hooda 1-6) lost to India 167-5 in 25.4 overs (Sanju Samson 43 not out, Shikhar Dhawan 33; Luke Jongwe 2-33, Sikandar Raza 1-16) by five wickets.","pubDate":"2022-08-20 18:06:09","image_url":"https://assets.thehansindia.com/h-upload/2022/08/20/500x300_1308759-sports.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: All you need to know about the four-team qualifying tournament before the main event on 27 August","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-all-you-need-to-know-about-the-four-team-qualifying-tournament-before-the-main-event-on-27-august-11087931.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Asia Cup 2022: All you need to know about the four-team qualifying tournament before the main event on 27 August","content":"Cricket Asia Cup 2022: All you need to know about the four-team qualifying tournament before the main event on 27 August The four teams will play each other in a round-robin format to decide the qualifier that joins India and Pakistan in group B of the Asia Cup. FirstCricket Staff August 20th, 2022 23:18:49 IST Hong Kong gave India a major scar at the 2018 Asia Cup. ICC/Twitter 2022 Asia Cup qualifiers kicked off on 20 August, Saturday between four teams – Singapore, Hong Kong, United Arab Emirates (UAE), and Kuwait in Muscat. The qualifiers were originally scheduled to be played in Kuala Lumpur in 2020 but were later shifted to Sri Lanka along with the main tournament. Subsequently, owing to the economic crisis in Sri Lanka, and with the main tournament being moved to the UAE, the qualifiers were also shifted to Muscat in Oman. The four teams will play each other in a round-robin format to decide the qualifier that joins India and Pakistan in group B of the Asia Cup Here are all the details about the qualifying tournament – Which teams will participate in the Asia Cup 2022 qualifiers, and how were they selected? Singapore and Hong Kong were selected based on their performance in the Eastern Regional Qualifiers as they finished as the top two teams in the regional qualifiers. Similarly, UAE and Kuwait were the top two teams in the Western Regional Qualifiers and were selected for the qualifiers. Where will the Asia Cup 2022 qualifiers be played? All the matches of the qualifiers will be played at the Oman Cricket Academy Ground 1 in Muscat. What will be the format of the Asia Cup 2022 qualifiers, and how many matches will be played? A total of six matches will be played in the qualifying tournament. Each team will the other three once in a round-robin format. The top-ranked team on the basis of points, or Net Run Rate (NRR) (in case of similar points) will qualify for the main tournament. There will be no final match played between the top two teams. Who will the qualifying team play in the main tournament? The qualifying team will join the high octane group of India and Pakistan in the main tournament. What is the schedule of the Asia Cup 2022 qualifiers? 20 August 2022, Saturday – 19.30 IST – Hong Kong vs Singapore 21 August 2022, Sunday – 19.30 IST – Kuwait vs UAE 22 August 2022, Monday – 19.30 IST – Singapore vs UAE 23 August 2022, Tuesday – 19.30 IST – Hong Kong vs Kuwait 24 August 2022, Wednesday – 16.30 IST – Singapore vs Kuwait 24 August 2022, Wednesday – 19.30 IST – UAE vs Hong Kong The race to ace the #AsiaCup Qualifiers starts today! 😍 Which will be the 1️⃣ team from these 4️⃣ to advance and keep their 🏆 hopes alive? Predict 👇. pic.twitter.com/RiUQrdIPgt — Star Sports (@StarSportsIndia) August 20, 2022 Where can you Live stream the Asia Cup 2022 qualifiers? The Asia Cup 2022 qualifiers will be broadcasted live on the Star Sports Network. The matches can also be live streamed online on FanCode App and Website. Squads: UAE: CP Rizwan (c), Chirag Suri, Muhammad Waseem, Vriitya Aravind, Ahmed Raza, Basil Hameed, Rohan Mustafa, Kashif Daud, Karthik Meiyappan, Aryan Lakra, Sultan Ahmad, Junaid Siddique, Fahad Nawaz, Zahoor Khan, Zawar Farid, Alishan Sharafu, Sabir Ali Singapore: Amjad Mahboob (c), Vinoth Baskaran, Surendran Chandramohan, Aman Desai, Aritra Dutta, Rezza Gaznavi, Neil Karnik, Anantha Krishna, Arjun Mutreja, Rohan Rangarajan, Manpreet Sing, Aryaman Sunil, Navin Param, Janak Prakash, Akshay Puri Kuwait: Mohammed Aslam (c), Nawaf Ahmed, Mohammad Amin, Meet Bhavsar, Adnan Idrees, Muhammad Kashif, Shiraz Khan, Sayed Monib, Edson Silva, Bilal Tahir, Ali Zaheer Usman Patel, Yasin Patel, Shahrukh Quddus, Ravija Sandaruwan, Mohamed Shafeeq, Haroon Shahid Hong Kong: Nizakat Khan (c), Kinchit Shah, Zeeshan Ali, Ateeq Iqbal, Aizaz Khan, Ehsan Khan, Scott McKechnie, Mohammad Ghazanfar, Yasim Murtaza, Dhananjay Rao, Wajid Shah, Ayush Shukla, Ahan Trivedi, Mohammad Waheed, Haroon Arshad, Babar Hayat, Aftab Hussain Team form: United Arab Emirates: UAE starts as the favourites for the tournament. However, they will play under a new captain as the earlier captain Ahmed Raza was removed as captain just a day before the tournament. If the team is divided into two groups of sorts due to such an abrupt decision, they might look out of their place in the qualifying tournament. Unbelievable for UAE to have replaced Ahmed Raza as their T20 skipper just days before the Asia Cup Qualifiers. Unwarranted, especially before a big tournament. Back in 2015, Khurram Khan was replaced by Mohammad Tauqir as captain right before the World Cup in AUS & NZ. https://t.co/xFHaiYFC0C — Amey Pethkar (@ameypethkar9) August 19, 2022 Singapore: Singapore were the Eastern Regional Qualifiers champions, but will play the qualifying tournament without their star player Tim David, who is trying his luck to be part of the Australian set-up. Singapore’s latest outing in the short format was at the second T20 global qualifier in Zimbabwe last month, where they failed miserably and lost all their matches. Kuwait: Kuwait created a sort of an upset as they finished second in the Western Regional Qualifiers, ahead of Oman. They will be high on confidence coming on the back of a 5-0 whitewash of Bahrain Hong Kong: Hong Kong was a part of the 2018 Asia Cup and would prove to be a strong competition against the other three. They also gave a major upset scar to India at the 2018 tournament. However, since then, they lost their captain Anshuman Rath to the Indian domestic circuit and have struggled a bit in recent times. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: August 20, 2022 23:18:49 IST Tags: Asia Cup 2022 Cricket Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-08-20 17:48:49","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Hong-Kong.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe: Watch — 'Can I touch you?' local fan asks India seamer Deepak Chahar","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-zimbabwe-watch-can-i-touch-you-local-fan-asks-india-seamer-deepak-chahar-11086831.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Zimbabwe: Watch — 'Can I touch you?' local fan asks India seamer Deepak Chahar","content":"Cricket India vs Zimbabwe: Watch — 'Can I touch you?' local fan asks India seamer Deepak Chahar Chahar made a triumphant comeback after a six-month injury layoff with a match-winning spell of 3/27 in the first ODI against Zimbabwe, and was seen hanging out with fans after the game. FirstCricket Staff August 20th, 2022 23:01:44 IST File image of India seamer Deepak Chahar. Image credit: BCCI/Twitter India seamer Deepak Chahar certainly is making plenty of fans in what is turning out to be a very productive tour of Zimbabwe. Chahar made a triumphant comeback after a six-month injury layoff with a match-winning spell of 3/27 in the first ODI against the home team, earning the Player of the Match award for the same. A dominant India restricted Zimbabwe to 189 before romping to a 10-wicket victory to go 1-0 up in the series. After the game, Chahar decided to catch up with some of the local fans, obliging to their requests for pictures and selfies. One group of female fans was particularly smitten by the Chennai Super Kings bowler, with one among them going to the extent of asking him, \"Can I touch you?\" The video was shared by journalist Vimal Kumar, who is presently covering the tour, on his YouTube channel. Watch it here: Chahar, however, sat out of the second one-dayer on Saturday, presumably due to a niggle, with Delhi Capitals' Shardul Thakur taking his spot in the XI. Team India once again dished out a clinical bowling performance, restricting the Chevrons to 161 after opting to field with Thakur emerging as the standout Indian bowler with figures of 3/38. The Zimbabwean bowling unit, however, didn't appear as listless this time around. While they failed to break the opening partnership in the previous game, they did manage to put the Indian batters under a bit of pressure by collecting wickets at regular intervals. Skipper KL Rahul was dismissed for just 1 in his first innings in a competitive game since the IPL after walking out to open alongside Shikhar Dhawan. Wicketkeeper-batter Ishan Kishan's poor form continued as he was dismissed for 6. Both Dhawan and Shubman Gill, who had opened in the previous game, were dismissed for 33 each. India lost four wickets inside 100 runs and nervousness cramped in the Indian dressing room. However, Sanju Samson and Deepak Hooda registered a 56-run fifth-wicket stand to ensure no further hiccups. India eventually chased the target in 26th over, with five wickets to spare. The two teams will meet again for the final clash of the tour on Monday. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: August 20, 2022 23:01:44 IST Tags: Deepak Chahar India India Vs Zimbabwe India Vs Zimbabwe 2022 Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-08-20 17:31:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Deepak-Chahar-vs-ZIM-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“Big relief for the Indian top-order batsmen”: Waqar Younis reckons Shaheen Afridi’s absence from Asia Cup 2022 a relieving news for India’s top-order","link":"https://thesportsrush.com/cricket-news-big-relief-for-the-indian-top-order-batsmen-waqar-younis-reckons-shaheen-afridis-absence-from-asia-cup-2022-a-relieving-news-for-indias-top-order/","keywords":["Cricket","Shaheen Afridi","Team India","Waqar Younis"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Waqar Younis reckons Shaheen Afridi’s injury has come as a welcome news for India’s top-order, with latter being ruled out of Asia Cup 2022. Pakistan’s unarguably one of the most successful pacers in the past few years, Shaheen Shah Afridi, has been ruled out of the upcoming Asia Cup 2022, scheduled to commence from August… The post “Big relief for the Indian top-order batsmen”: Waqar Younis reckons Shaheen Afridi’s absence from Asia Cup 2022 a relieving news for India’s top-order appeared first on The SportsRush.","content":"Waqar Younis reckons Shaheen Afridi’s injury has come as a welcome news for India’s top-order, with latter being ruled out of Asia Cup 2022. Pakistan’s unarguably one of the most successful pacers in the past few years, Shaheen Shah Afridi, has been ruled out of the upcoming Asia Cup 2022, scheduled to commence from August 27 in UAE. Having sustained a knee injury during Pakistan’s first Test match against Sri Lanka at Galle last month, Afridi, has been prescribed a “four to six weeks rest” by the PCB’s medical advisory committee, thereby also ruling him out of the seven-match T20I series at home against England next month, post the imminent Asia Cup. The development has left the Pakistan fans in an absolute state of disarray, as the squad is now devoid of any left-arm pacer, which has been a cause of trouble for the Indian top-order off-late, especially in the T20 format. Fans even took to social media to request the PCB to include their retired international star Mohammad Amir in the squad, who had in June last year, considered to come out of retirement, provided his grievances are addressed. Legendary Pakistani pacer Waqar Younis too, took to his social media handle to remark that Shaheen’s injury, which has consequently ruled him out of the Asia Cup, has come as a sigh of relief for the renowned Indian top-order batters. It is worth of a mention, that Afridi had got rid Rohit Sharma, KL Rahul ,and later Virat Kohli as well, during the T20 World Cup last year, as Pakistan marched on towards a memorable 10-wicket victory against their arch-rivals. Waqar also wished the left-arm pacer for a speedy recovery, while also expressing his disappointment on him no longer being a part of the Asia Cup. Shaheen’s injury Big relief for the Indian top order batsmen. Sad we won’t be seeing him in #AsiaCup2022 Get fit soon Champ @iShaheenAfridi pic.twitter.com/Fosph7yVHs — Waqar Younis (@waqyounis99) August 20, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-20 17:23:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Deepak Hooda Proves To Be India's Lucky Charm, Sets Unique World Record - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3ppbWJhYndlLXZzLWluZGlhLTIwMjIvZGVlcGFrLWhvb2RhLXByb3Zlcy10by1iZS1pbmRpYXMtbHVja3ktY2hhcm0tc2V0cy11bmlxdWUtd29ybGQtcmVjb3JkLTMyNzE3ODjSAYIBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vemltYmFid2UtdnMtaW5kaWEtMjAyMi9kZWVwYWstaG9vZGEtcHJvdmVzLXRvLWJlLWluZGlhcy1sdWNreS1jaGFybS1zZXRzLXVuaXF1ZS13b3JsZC1yZWNvcmQtMzI3MTc4OC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Deepak Hooda Proves To Be India's Lucky Charm, Sets Unique World Record  NDTV SportsRecent Match Report - Zimbabwe vs India 2nd ODI 2022  ESPNcricinfoIND vs ZIM: 'Justice For Deepak Chahar'- Twitter Reacts After Indian Pacer Was Benched In Second ODI Against Zimbabwe  Cricket Addictor'Can I touch you?': Zimbabwe bowler's family's unexpected meet with India star  Hindustan TimesWatch: Sanju Samson's Acrobatic One-Handed Catch Gets India First Wicket vs Zimbabwe In Second ODI  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-08-20 17:08:51","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'Can I touch you,' female fan asks Deepak Chahar before clicking photo - Watch","link":"https://zeenews.india.com/cricket/ind-vs-zim-1st-odi-fan-asks-deepak-chahar-can-i-touch-you-before-clicking-photo-watch-2499517.html","keywords":null,"creator":null,"video_url":null,"description":"With this win, India also take an unassailable 2-0 lead in the three-match series, with Monday's match becoming a dead rubber. The five-wicket victory also means that this was India's 14th win on the trot over Zimbabwe in ODI cricket.","content":"Premier India all-rounder Deepak Chahar, who is making comeback to the Indian squad after recovering from injury, has impressed cricket experts around the world in his very first match against Zimbabwe on Thursday where the right-arm pacer picked three wickets. Chahar removed the top three batsmen of the Zimbabwe batting lineup. With the extraordinary performance, Chahar got famous in Harare in no time. A female fan who wanted to click a photo with an India all-rounder came close to him and asked if she can touch him. After getting the permission of the cricketer the fan put her arms on Chahar's shoulder. “We are very happy, he was so humble and cute,” another one said when asked about their interaction with Chahar. Here's the video of Chahar's interaction with fans - Fan girl of #Deepakchahar from Zimbabwe ! #CricketTwitter pic.twitter.com/566Iim1hi0 — (@_Alone_1820) August 20, 2022 Meanwhile, in the second ODI, A disciplined bowling show, led by Shardul Thakur's three wickets, and an unbeaten 43 by wicketkeeper-batter Sanju Samson helped India beat Zimbabwe by five wickets in the second ODI at Harare Sports Club on Saturday. With this win, India also take an unassailable 2-0 lead in the three-match series, with Monday's match becoming a dead rubber. The five-wicket victory also means that this was India's 14th win on the trot over Zimbabwe in ODI cricket. After Thakur's 3-38 in seven overs and the rest of the bowlers took a wicket each to bowl Zimbabwe out for just 161 in 38.1 overs, the visitors were in some discomfort at 97-4 in their chase of 167. But Samson, who hit three fours and four sixes in his unbeaten 43 off 39 balls and Deepak Hooda (25, including three fours) shared a 56-run stand to get the match in India's favour with 146 balls remaining. K.L. Rahul's promotion as opener backfired as he was trapped plumb lbw while attempting to flick off Victor Nyauchi. Shikhar Dhawan was aggressive and used his feet well to hit four good-looking boundaries. But he was undone by a well-directed bouncer from Tanaka Chivanga as he pulled but it got big on him and skied to square leg. Ishan Kishan chopped onto his stumps off Luke Jongwe to depart cheaply. But Shubman Gill, batting at three, was at his classy best, bringing out his signature short-arm jab while oozing class with his off-side boundaries and driving straight down the ground with the full face of the bat. Gill's promising knock ended at 33 when he got a top-edge on a slash straight to deep third man. From 97-4 in 14 overs, Hooda and Samson joined forces to take India over the line. Samson brought up India's hundred by driving in the gap between cover and mid-off off Jongwe while Hooda ramped a short ball over the keeper for another boundary in the 16th over. Samson was in his element, smoking Chivanga down the ground for a boundary before slamming Sikandar Raza in the next over through the same region for another four and followed it up by dispatching over long-on for six. After Hooda hit Brad Evans for a boundary through cover, Samson used his feet to smack back-to-back sixes off Sean Williams in the 23rd over. On Williams' slower ball, Samson danced down the pitch to smash down the ground. On the very next ball, Williams dropped short and Samson pulled flat over fine leg for another six. Though Hooda was castled by a yorker from Raza to end the 56-run partnership for the fifth wicket, Samson finished off the chase in style with a huge six over long-on to seal the match and series in India's favour. Earlier, pushed into batting first, the opening pair of Takudzwanashe Kaitano and Innocent Kaia were cautious against the new ball, especially with Mohammed Siraj getting the ball to swing away beautifully. Siraj got the first breakthrough when he shaped the ball away to square up Kaitano. The batter had no other option but to nick behind, and Samson dived full length to his left to complete a one-handed stunning catch. Thakur's short ball down leg beat Innocent Kaia for pace and he gloved behind to Samson. He had his second wicket in the 12th over when captain Regis Chakabva, who promoted himself in the batting order, was undone by extra bounce and nicked to second slip. Zimbabwe's troubles increased when Wesley Madhevere tried to defend, but nicked behind off Prasidh Krishna as the hosts' lost their top four batters for just 11 runs. Their in-form batter Raza cut straight to backward point off Kuldeep Yadav as Zimbabwe lost half of their side for 72 runs. Williams tried to counter-attack with three boundaries and a six. But in a bid to go big, he slogged straight into the hands of the deep square leg off Hooda. Thakur, coming into the eleven in place of Deepak Chahar, struck again as he shattered Jongwe's stumps while Patel got his first wicket with Evans chopping onto his stumps. Burl used a mix of luck and some mighty shots to fetch boundaries and push Zimbabwe's score past 150. But he ran out of support from the other end as Nyauchi and Chivanga were out in quick succession, summing up Zimbabwe's day with the bat.","pubDate":"2022-08-20 16:22:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“M trending on Twitter but why”: Mohammad Amir scratches his head as Pakistan fans trend him across social media post Shaheen Afridi’s injury news ruling him out of Asia Cup 2022","link":"https://thesportsrush.com/cricket-news-m-trending-on-twitter-but-why-mohammad-amir-scratches-his-head-as-pakistan-fans-trend-him-across-social-media-post-shaheen-afridis-injury-news-ruling-him-out-of-asia-cup-2022/","keywords":["Cricket","Asia Cup 2022","Mohammad Amir","Shaheen Afridi"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Mohammad Amir scratches his head as Pakistan Cricket fans trend him on Twitter, ever since Shaheen Afridi is ruled out of Asia Cup 2022. Team Pakistan and their ardent fans were handed a heavy blow on Saturday, as a knee injury ruled their ace fast bowler Shaheen Shah Afridi out of the imminent Asia Cup… The post “M trending on Twitter but why”: Mohammad Amir scratches his head as Pakistan fans trend him across social media post Shaheen Afridi’s injury news ruling him out of Asia Cup 2022 appeared first on The SportsRush.","content":"Mohammad Amir scratches his head as Pakistan Cricket fans trend him on Twitter, ever since Shaheen Afridi is ruled out of Asia Cup 2022. Team Pakistan and their ardent fans were handed a heavy blow on Saturday, as a knee injury ruled their ace fast bowler Shaheen Shah Afridi out of the imminent Asia Cup 2022. It is learnt that Afridi failed to recover from the right knee ligament injury which he had sustained during the first Test of Pakistan’s tour of Sri Lanka the previous month. While he was included in the team’s squad for the ongoing tour of Netherlands, the injury seems to be a grave one, as he has also been ruled out of the seven-match T20I series at home against England next month, post the Asia Cup in UAE. A “four to six weeks rest” has been prescribed by the PCB’s medical advisory committee, as the board might well not afford to miss the services of their champion pacer during the T20 World Cup in Australia starting October. The Pakistan fans, while expressing their disappointment over their ace left-arm pacer’s exclusion from the squad, started trending another experienced left-arm pacer – Mohammad Amir, across the social media platforms. The reason might well have to to with the fact that be it Afridi or Amir, the Indian batting line-up has struggled to get them away, as was the case during Pakistan’s rare, yet memorable wins during the 2017 Champions Trophy final, and the 2021 T20 World Cup opening match against the arch-rivals. Also, with the Indian top-order’s (in particular) recent struggles against left-arm pace bowling off-late in the T20 format, the fans opine that Shaheen was their best bet to make a dent in the strong Indian batting line-up. Apart from Amir, other left-arm pacers in Wahab Riaz and Mir Hamza were also trending on the micro-blogging site, as fans yearned for their inclusion in the Asia Cup 2022 squad. https://t.co/8dLDq6eW8U This is why — ٰImran Siddique (@imransiddique89) August 20, 2022 For those unaware, Amir had, in December 2020, decided to retire from international Cricket citing ‘mental torture’ and ‘hostile environment’ he faced at the hands of team management. However, in June last year, the 30-year-old had yet again announced that he was open to come out of retirement provided his concerns are addressed and attended to.","pubDate":"2022-08-20 16:20:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“It makes zero sense that there is no first-class cricket going on”: Alastair Cook slams England for their preparation in tests gainst South Africa","link":"https://thesportsrush.com/cricket-news-it-makes-zero-sense-that-there-is-no-first-class-cricket-going-on-alastair-cook-slams-england-for-their-preparation-in-tests-gainst-south-africa/","keywords":["Cricket","Alastair Cook","South Africa tour of England 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Former England captain Alastair Cook has criticized the lack of preparation of the home side after their defeat against South Africa. South Africa defeated the English team in just over two days at the Lord’s test and gave a befitting reply to the “Bazball” theory. The English batters have been playing with a counter-attacking approach… The post “It makes zero sense that there is no first-class cricket going on”: Alastair Cook slams England for their preparation in tests gainst South Africa appeared first on The SportsRush.","content":"Former England captain Alastair Cook has criticized the lack of preparation of the home side after their defeat against South Africa. South Africa defeated the English team in just over two days at the Lord’s test and gave a befitting reply to the “Bazball” theory . The English batters have been playing with a counter-attacking approach since the arrival of Brendon McCullum, but the Proteas bowlers made them dance to their rhythm. England lost the match by an innings and 12 runs, where the batters of the side failed in both innings. The pacers of the South African team took 18 of England’s 20 wickets. After the defeat, Ben Stokes said that they won’t change their approach of playing in the next game as well. Alastair Cook, who has been one of England’s best-ever batters has also criticized the English team. He has pointed out the lack of practice by the home side. Alastair Cook has slammed the English team for their lack of practice before the test series against South Africa. Cook highlighted that there is no first-class cricket going on at the moment, and the players are generally coming on the back of practice in the white-ball matches. “What is weird is we normally talk about the touring side running into a series with not enough match practice,” Cook said on BBC’s Test match special. “We always say it’s such an advantage in the first game England normally have in Test series. We’re talking about the structure of the game so much, we’re talking about when should cricket be played… it makes zero sense that there is no first-class cricket going on for anyone to play when there’s a Test match series going on.” I’m repeating myself, but don’t care: I think Alastair Cook is the just a sublime presence in the @bbctms box. I could listen to him all day – about cricket – or about eating cod with pork scratchings, or hummus and gravy. 🎙 🏏 👏 — Ned 🚲 Boulting (@nedboulting) August 19, 2022 Cook has said that the scheduling of the matches has to be changed. The players are coming on the back of the Hundred and Royal One Day Cup competitions instead of red-ball matches. After playing the test against India, the English team’s players have played just white-ball cricket. “That has to change. There is no excuse for it. That has to change,” Cook added.","pubDate":"2022-08-20 15:17:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Watch: Fans chant 'Samson, Samson' with 1 run to win; this is how Sanju responds - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMiqgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC93YXRjaC10ZWFtLWluZGlhLWZhbnMtaW4temltYmFid2UtY2hhbnQtc2Ftc29uLXNhbXNvbi13aXRoLTEtcnVuLXRvLXdpbi1pbi0ybmQtb2RpLXRoaXMtaXMtaG93LXNhbmp1LXJlc3BvbmRlZC0xMDE2NjEwMDY2Mzg5MTguaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Fans chant 'Samson, Samson' with 1 run to win; this is how Sanju responds  Hindustan TimesRecent Match Report - Zimbabwe vs India 2nd ODI 2022  ESPNcricinfoIND vs ZIM: 'Justice For Deepak Chahar'- Twitter Reacts After Indian Pacer Was Benched In Second ODI Against Zimbabwe  Cricket Addictor'Can I touch you?': Zimbabwe bowler's family's unexpected meet with India star  Hindustan TimesDeepak Hooda Proves To Be India's Lucky Charm, Sets Unique World Record  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-08-20 15:14:28","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe: ‘Good for some of the guys to get time in the middle’ says KL Rahul after second ODI","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-zimbabwe-good-for-some-of-the-guys-to-get-time-in-the-middle-says-kl-rahul-after-second-odi-11087621.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Zimbabwe: ‘Good for some of the guys to get time in the middle’ says KL Rahul after second ODI","content":"Cricket India vs Zimbabwe: ‘Good for some of the guys to get time in the middle’ says KL Rahul after second ODI KL Rahul said that the change in batting order didn't work, but he will try to score runs in the third match. Samson won man of the match, and was happier with his wicket-keeping than his batting. FirstCricket Staff August 20th, 2022 20:32:30 IST India's Deepak Hooda, left, and Sang Samson walk off the pitch on the second day of the One-Day International cricket match between Zimbabwe and India at Harare Sports Club in Harare, Zimbabwe, Saturday, Aug, 20, 2022. (AP Photo/Tsvangirayi Mukwazhi) Indian captain KL Rahul said that the revised batting order didn’t work but it was good for several guys to get a chance to bat out in the middle. India chased the target of 162 , losing five wickets in the process, unlike the first ODI wherein they won unscathed. “We bat deep and it's good for some of the guys to get time in the middle. We weren't nervous [after losing some early wickets],” Rahul said at the post-match presentation about the team’s batting effort. Stand-in captain Rahul, who is making a comeback to the side after quite a while didn’t trouble the scorers as he got out LBW for one run of Victor Nyauchi’s bowling . The first match star batters Shikhar Dhawan and Shubman Gill as well got off to a good start but both were dismissed for 33. That's that from the 2nd ODI. #TeamIndia win by 5 wickets and take an unassailable 2-0 lead in the series. Scorecard - https://t.co/RDdvga1BXI #ZIMvIND pic.twitter.com/AeG4OsDPQO — BCCI (@BCCI) August 20, 2022 “It didn't work [laughs, on the changed batting order], I wanted to get some runs but it didn't happen. Hopefully in the next game. They have some quality bowlers in the attack and they bowled well to Bangladesh, I watched it on the television. The bowlers did come hard, they're tall and big and strong boys,” Rahul added. This gave a chance to the middle order to spend some time on the crease and take the team past the victory line. “Good challenge for us as batters, but we bat deep so it wasn't a worry. We're here to play good cricket and win,” Rahul said about the middle order finishing the match for India. Sanju Samson and Deepak Hooda finished the match for India. Samson was also awarded the man of the match for his 43 off 39 deliveries and taking three catches behind the wickets, one of which was a one-handed blinder . Samson was happier with his wicket-keeping than his batting and expressed so at the post-match presentation. “How much ever time you spend in the middle feels good. I really enjoyed keeping and contributing to the win. In this match, the fast bowlers picked the length much quicker and I really enjoyed keeping.” However, Samson while being excellent behind the stumps, also missed out on a stumping opportunity of Axar Patel’s bowling towards the fag end of Zimbabwe's batting. Sanju Samson is adjudged Player of the Match for his match winning knock of 43* as India win by 5 wickets. Scorecard - https://t.co/6G5iy3rRFu #ZIMvIND pic.twitter.com/Bv8znhTJSM — BCCI (@BCCI) August 20, 2022 Samson said the wicket keepers are generally habituated to listening about their failures. “I took three catches but I missed a stumping too; as keepers, we're used to listening to things we didn't do well.” Earlier, Rahul didn’t miss out on being thankful to the fans for coming out in large numbers to support Men in Blue. “It's a great turnout today, it's a weekend, and wherever we go across the world we get good support from Indian fans, so thanks to them.” Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: August 20, 2022 20:32:30 IST Tags: India Vs Zimbabwe Kl Rahul Sanju Samson Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-08-20 15:02:30","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/Samson-Hooda.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Zimbabwe: Men in Blue continue winning run, go 2-0 up in the series","link":"https://www.firstpost.com/photos/india-vs-zimbabwe-men-in-blue-continue-winning-run-go-2-0-up-in-the-series-11087541.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Zimbabwe: Men in Blue continue winning run, go 2-0 up in the series","content":"Photos India vs Zimbabwe: Men in Blue continue winning run, go 2-0 up in the series India were in a spot of bother at 97/4 when Deepak Hooda and Sanju Samson joined hands to provide resistance to the side as the two batters chipped in with a partnership of 56 runs for the fifth wicket FirstCricket Staff August 20, 2022 20:28:24 IST 1 /8 India sealed a five-wicket win against Zimbabwe, chasing a target of 162 in the second ODI, and took a 2-0 lead in the series. AP 2 /8 India were in a spot of bother at 97/4 when Deepak Hooda and Sanju Samson joined hands to provide resistance to the side as the two batters chipped in with a partnership of 56 runs for the fifth wicket. Hooda was later out for 25 off 36, but played some eye-catching shots during his stay. AP 3 /8 Sanju Samson returned unbeaten at 43 off 39 and took the side over the line. He also won the man of the match award for his batting as well as three catches behind the stumps. AP 4 /8 The Zimbabwe bowlers did put up a great fight as they picked wickets at regular intervals and sent the likes of KL Rahul, Shikhar Dhawan, Ishan Kishan, and Shubman Gill back in the hut before India could cross the 100-run mark. AP 5 /8 India had lost an early wicket in the chase in the form of KL Rahul, but Shubman Gill and Shikhar Dhawan scored 42 runs for the second wicket. While Dhawan struck 33 off 21, Gill scored 33 off 34. AP 6 /8 Earlier, in the day, the Indian pacers rattled the Zimbabwe batting unit and the side was eventually bowled out for 161. AP 7 /8 Shardul Thakur picked up a total of three wickets in this match, ending the innings as the highest wicket taker. AP 8 /8 Ryan Burl tried to take the Zimbabwe to a respectable score, but kept losing wickets at the opposite end. He ended with 39* off 47 deliveries, being the second highest scorer. AP","pubDate":"2022-08-20 14:58:24","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/08/India-vs-Zimbabwe-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Jhulan Goswami set to retire after Lord's match","link":"https://www.indiatvnews.com/sports/cricket/jhulan-goswami-set-to-retire-after-lord-s-match-india-vs-england-indw-vs-engw-lord-s-bcci-2022-08-20-801603","keywords":null,"creator":null,"video_url":null,"description":"India's veteran bowler Jhulan Goswami announced her retirement from cricket. She is set to play her farewell match on 24th August against England.","content":"India's veteran bowler Jhulan Goswami announced her retirement from cricket. She is set to play her farewell match on 24th August against England. After the BCCI announced the ODI squad against England on Friday, she gave her final statement. According to ESPNCricinfo, she stated that she will be playing her last match in Lord's. India Women's cricket team has recently uplifted itself in the last couple of years. Goswami is one of those players who has played a huge part in the upliftment. The veteran bowler Goswami debuted for India at the age of 19 in 2002. She tops the list of highest wicket-takers in the world with a tally of 352 wickets in all formats. She has played six ODI World Cups for India and has scalped 252 wickets in ODIs. The bowler has played 252 ODIs, 44 Tests and 56 T20Is, so far. Her previous ODI was against Sri Lanka in July. She got injured during the game and was not picked for the next matches. Jhulan who played her last T20 in 2018 and her last Test in 2021, is going to turn 40 years old in three months. , who was one of her closest teammates also retired from the team earlier this year. The BCCI wanted to give Jhulan a proper farewell match on their field but due to her fitness issues and injuries, the event couldn't take place.","pubDate":"2022-08-20 14:52:28","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Classy knock”: Rajasthan Royals CEO praises Sanju Samson for his match-winning knock vs Zimbabwe in 2nd ODI","link":"https://thesportsrush.com/cricket-news-classy-knock-rajasthan-royals-ceo-praises-sanju-samson-for-his-match-winning-knock-vs-zimbabwe-in-2nd-odi/","keywords":["Cricket","India tour of Zimbabwe 2022","rajasthan royals","RR","Sanju Samson"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rajasthan Royals CEO praises Sanju Samson as the latter had brilliant day with both bat and the wicket-keeping gloves on in Harare. During the second ODI of the ongoing India’s tour of Zimbabwe at the Harare Sports Club, India prevailed against the hosts by 5 wickets, and thereby also seal the series 2-0 with a… The post “Classy knock”: Rajasthan Royals CEO praises Sanju Samson for his match-winning knock vs Zimbabwe in 2nd ODI appeared first on The SportsRush.","content":"Rajasthan Royals CEO praises Sanju Samson as the latter had brilliant day with both bat and the wicket-keeping gloves on in Harare. During the second ODI of the ongoing India’s tour of Zimbabwe at the Harare Sports Club, India prevailed against the hosts by 5 wickets, and thereby also seal the series 2-0 with a match yet to go. With KL Rahul back in the side after an injury and battling against COVID-19, more so in the capacity of a skipper, fans were left with some raised eyebrows as he opted to bowl first post winning the Toss. The bowlers, for the second successive occasion, did not let the team down, as each one of them chipped in with at least a wicket against their name. Shardul Thakur (7-0-38-3), who was roped in the playing XI today in place of last ODI’s ‘player of the match’ Deepak Chahar, was the pick of the bowlers, as the Zimbabwean line-up were bundled up for 161 in 38.1 Overs. Bereft of any match practice since February this year, KL Rahul did open the batting in place of Shubman Gill , but perished at the score of 1(5), as pacer Victor Nyauchi trapped him in front of the stumps. Gill (33 off 34) and Shikhar Dhawan (33 off 21) yet again looked in fantastic touch, but lost their wickets after a promising start to hand the hosts some inroads. However, India were always in control of the chase as a half-century stand between Sanju Samson (43* off 39) and Deepak Hooda (25 off 36) ensured that they nailed the chase in mere 25.4 Overs. Samson, for his scintillating knock comprising 3 Fours and 4 mighty Sixes, at a strike rate of 110.26, was awarded the ‘player of the match’. Skipper of the IPL franchise Rajasthan Royals (RR), Samson, found words of appreciation from the franchise’s CEO Jake Lush McCrum, as the latter termed it a classy knock, played by the 27-year-old, who lead RR to their only second IPL final appearance this year, since 2008. Classy knock once again from @IamSanjuSamson 🇮🇳 — Jake Lush McCrum (@JakeLushMcCrum) August 20, 2022 For more Cricket-related news, click here .","pubDate":"2022-08-20 14:49:04","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}