{"newsArray":[{"title":"Cricket Australia reveals venue for fifth Ashes Test","link":"https://wwos.nine.com.au/cricket/ashes-hobart-to-host-fifth-test-after-perth-stripped-of-match/b01d1e5c-96dd-4e76-92a4-9aa9179ddca1","keywords":null,"creator":["wwos"],"video_url":null,"description":"Cricket Australia has finally made the call on where the fifth and final Ashes Test will be played after Perth lost the match.","content":"Cricket Australia has confirmed Hobart's Blundstone Arena will host the fifth Ashes Test, after Perth was stripped of the right to stage the match.It's the first time Hobart has hosted an Ashes match, as well as the first time a day-night Test will be played in Tasmania.Blundstone Arena has been given the nod for the day-night match, after beating out opposition from both Melbourne and Sydney, with the MCG and SCG keen to stage a second match.READ MORE: Legend defends Cummins' captaincy despite England resistanceREAD MORE: Former England captain questions Australia's resolveASHES WRAP: Hazlewood absence raises eyebrows late on Day 3Melbourne will host the traditional Boxing Day Test, followed by the SCG on January 5-9, and Hobart on January 14-18.Perth was stripped of the right to host the match earlier this month over the state's insistence that players, broadcast staff and officials would need to quarantine for two weeks following the Sydney Test, making it impossible for Optus Stadium to host the match.\"We are delighted to announce that Blundstone Arena in Hobart will be hosting an Ashes Test match for the first time and thank the Tasmanian Government for its support,\" CA CEO Nick Hockley said in a statement.\"I would like to thank all the States and Territories who took part in this process. The submissions we received were outstanding and we had no doubt that each of the venues that took part would have hosted a wonderful event. \"There were a range of considerations, including commercial, logistical and operational factors and on the balance of these, the CA board agreed on Blundstone Arena being the most appropriate venue to host the fifth Vodafone Men's Ashes Test. \"We also acknowledge the postponement of the Australia and Afghanistan Test due to take place in Hobart earlier in the year played a part in the decision.\"Cricket Tasmania CEO, Dominic Baker, described the announcement as \"a great day not just for Tasmanian cricket, but for Tasmania in general\".\"This will be without a doubt the biggest sporting event Tasmania has ever hosted,\" he said. \"While the circumstances that have led us to be able to have the opportunity to host this Test are undoubtedly unique, we are thrilled that Tasmanians will have this once-in-a-lifetime opportunity to witness an Ashes Test in their own backyard. \"Blundstone Arena is a world-class venue, and we are excited to work with Cricket Australia and the Ashes broadcast partners to show that to the world. As a one-sixth owner of Cricket Australia, we are thrilled that our state's contribution to Australian cricket has been recognised in this way.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-10 23:26:21","full_description":"Cricket Australia has confirmed Hobart's Blundstone Arena will host the fifth Ashes Test, after Perth was stripped of the right to stage the match. It's the first time Hobart has hosted an Ashes match, as well as the first time a day-night Test will be played in Tasmania. Blundstone Arena has been given the nod for the day-night match, after beating out opposition from both Melbourne and Sydney, with the MCG and SCG keen to stage a second match. READ MORE: Legend defends Cummins' captaincy despite England resistance READ MORE: Former England captain questions Australia's resolve ASHES WRAP: Hazlewood absence raises eyebrows late on Day 3 Melbourne will host the traditional Boxing Day Test, followed by the SCG on January 5-9, and Hobart on January 14-18. Perth was stripped of the right to host the match earlier this month over the state's insistence that players, broadcast staff and officials would need to quarantine for two weeks following the Sydney Test, making it impossible for Optus Stadium to host the match. \"We are delighted to announce that Blundstone Arena in Hobart will be hosting an Ashes Test match for the first time and thank the Tasmanian Government for its support,\" CA CEO Nick Hockley said in a statement. \"I would like to thank all the States and Territories who took part in this process. The submissions we received were outstanding and we had no doubt that each of the venues that took part would have hosted a wonderful event. \"There were a range of considerations, including commercial, logistical and operational factors and on the balance of these, the CA board agreed on Blundstone Arena being the most appropriate venue to host the fifth Vodafone Men's Ashes Test. \"We also acknowledge the postponement of the Australia and Afghanistan Test due to take place in Hobart earlier in the year played a part in the decision.\" Cricket Tasmania CEO, Dominic Baker, described the announcement as \"a great day not just for Tasmanian cricket, but for Tasmania in general\". \"This will be without a doubt the biggest sporting event Tasmania has ever hosted,\" he said. \"While the circumstances that have led us to be able to have the opportunity to host this Test are undoubtedly unique, we are thrilled that Tasmanians will have this once-in-a-lifetime opportunity to witness an Ashes Test in their own backyard. \"Blundstone Arena is a world-class venue, and we are excited to work with Cricket Australia and the Ashes broadcast partners to show that to the world. As a one-sixth owner of Cricket Australia, we are thrilled that our state's contribution to Australian cricket has been recognised in this way.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/398525/pickerimage.jpg","source_id":"nine"},{"title":"Hobart to stage the fifth Ashes test says Cricket Australia","link":"https://www.channelnewsasia.com/sport/hobart-stage-fifth-ashes-test-says-cricket-australia-2373111","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-10 23:24:25","full_description":"MELBOURNE: Hobart will stage the fifth Ashes test between Australia and England in place of Perth, which was stripped of the hosting rights on Monday (Dec 11) because of Western Australia border controls, Cricket Australia said on Saturday. Hobart's Bellerive Oval, which was scheduled to host a test against Afghanistan in November before it was postponed in the wake of the Taliban takeover of the country, will host its first Ashes clash from Jan. 14-18. Melbourne, which will stage the third test in the series, and Sydney, which will be the venue for the fourth, had both offered to replace Perth - options that would have provided much greater revenue for Cricket Australia (CA). \"I would like to thank all the States and Territories who took part in this process,\" CA boss Nick Hockley said in a statement. \"The submissions we received were outstanding and we had no doubt that each of the venues that took part would have hosted a wonderful event. \"We also acknowledge the postponement of the Australia and Afghanistan Test due to take place in Hobart earlier in the year played a part in the decision.” The picturesque Bellerive ground holds 19,500 but has attracted far fewer fans than that for previous test matches with one journalist famously counting the crowd one-by-one during the series against Sri Lanka in 2012. Hobart last hosted a test when South Africa toured in 2016-17. Western Australia's requirement for travellers from New South Wales to quarantine for 14 days made it impossible for the teams to complete the fourth test in Sydney on Jan. 9 and be free to start the fifth match on Jan. 14. The state has largely managed to keep COVID-19 out for the duration of the pandemic by cutting itself off from the rest of Australia and the world. Given that success, the government was not prepared to compromise on its protocols even to ensure that the Ashes test went ahead. That means the 60,000-seater Perth Stadium, built at a cost of AUS$1.6 billion (US$1.14 billion) and completed in 2018, will miss out on test cricket for the second year in a row. The stadium, which replaced the WACA ground as Western Australia's test venue, hosted tests against India in 2018 and New Zealand in 2019.","image_url":null,"source_id":"channelnewsasia"},{"title":"Hobart to host fifth men's Ashes Test","link":"https://thewest.com.au/sport/cricket/hobart-to-host-fifth-mens-ashes-test-c-4906485","keywords":null,"creator":["Rob Forsaith"],"video_url":null,"description":"Cricket Australia has confirmed the fifth men's Ashes Test will be a pink-ball match in Hobart.","content":null,"pubDate":"2021-12-10 23:09:56","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4906485/b5086157df27bf193c01f7e519d0047736bdee33-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"Hobart to host fifth men's Ashes Test","link":"https://www.perthnow.com.au/sport/cricket/hobart-to-host-fifth-mens-ashes-test-c-4906482","keywords":null,"creator":["Rob Forsaith"],"video_url":null,"description":"Cricket Australia has confirmed the fifth men's Ashes Test will be a pink-ball match in Hobart.","content":null,"pubDate":"2021-12-10 23:09:45","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-4906482/b5086157df27bf193c01f7e519d0047736bdee33-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"Hobart awarded fifth Ashes Test ahead of MCG, SCG","link":"https://www.theage.com.au/sport/cricket/hobart-awarded-fifth-ashes-test-ahead-of-mcg-scg-20211211-p59gqo.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia has confirmed that the fifth Ashes Test, removed from Perth due to COVID-19 border issues and difficulties, will officially be played in Hobart.","content":null,"pubDate":"2021-12-10 23:00:33","full_description":"Cricket Australia has confirmed that the fifth Ashes Test, removed from Perth due to COVID-19 border issues and difficulties, will officially be played in Hobart. The MCG and SCG had also made bids for the pink-ball Test . In a statement on Saturday morning, Cricket Australia CEO Nick Hockley said: “We are delighted to announce that Blundstone Arena in Hobart will be hosting an Ashes Test match for the first time and thank the Tasmanian government for its support. “I would like to thank all the states and territories who took part in this process. The submissions we received were outstanding and we had no doubt that each of the venues that took part would have hosted a wonderful event. “There were a range of considerations, including commercial, logistical and operational factors and on the balance of these, the CA board agreed on Blundstone Arena being the most appropriate venue to host the fifth men’s Ashes Test. “We also acknowledge the postponement of the Australia and Afghanistan Test due to take place in Hobart earlier in the year played a part in the decision.” More to come","image_url":null,"source_id":"theage"},{"title":"Hobart awarded fifth Ashes Test ahead of MCG, SCG","link":"https://www.smh.com.au/sport/cricket/hobart-awarded-fifth-ashes-test-ahead-of-mcg-scg-20211211-p59gqo.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":null,"video_url":null,"description":"Cricket Australia has confirmed that the fifth Ashes Test, removed from Perth due to COVID-19 border issues and difficulties, will officially be played in Hobart.","content":null,"pubDate":"2021-12-10 23:00:33","full_description":"Cricket Australia has confirmed that the fifth Ashes Test, removed from Perth due to COVID-19 border issues and difficulties, will officially be played in Hobart. The MCG and SCG had also made bids for the pink-ball Test . In a statement on Saturday morning, Cricket Australia CEO Nick Hockley said: “We are delighted to announce that Blundstone Arena in Hobart will be hosting an Ashes Test match for the first time and thank the Tasmanian government for its support. “I would like to thank all the states and territories who took part in this process. The submissions we received were outstanding and we had no doubt that each of the venues that took part would have hosted a wonderful event. “There were a range of considerations, including commercial, logistical and operational factors and on the balance of these, the CA board agreed on Blundstone Arena being the most appropriate venue to host the fifth men’s Ashes Test. “We also acknowledge the postponement of the Australia and Afghanistan Test due to take place in Hobart earlier in the year played a part in the decision.” More to come","image_url":null,"source_id":"smh"},{"title":"Ashes live updates: Joe Root and Dawid Malan batting England back into first Test at the Gabba - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMibGh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIxLTEyLTExL2FzaGVzLWZpcnN0LXRlc3QtZGF5LWZvdXItbGl2ZS11cGRhdGVzLWpvZS1yb290LWRhd2lkLW1hbGFuLzEwMDY3Njc3NtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ashes live updates: Joe Root and Dawid Malan batting England back into first Test at the Gabba  ABC NewsFirst Ashes Test, day 3 live updates: Aussies embroiled in fresh DRS drama  NEWS.com.auHead explodes to thrill Gabba with hard-hitting 152 | Men's Ashes 2021-22  cricket.com.auMauled Leach got a hospital pass: Tufnell  PerthNowRoot and Malan lead dogged England fightback on day three of first Ashes Test  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2021-12-10 22:52:34","image_url":null,"source_id":"google"},{"title":"Can Poms seal rare win Down Under in Ashes series?","link":"https://www.bangkokpost.com/sports/2230175/can-poms-seal-rare-win-down-under-in-ashes-series-","keywords":null,"creator":null,"video_url":null,"description":"The Poms and the Baggy Greens are at it again in the Ashes and for most people who follow cricket, it probably wasn't a huge surprise which team came out on top in the early skirmishes at the Gabba in Brisbane.","content":null,"pubDate":"2021-12-10 21:00:00","full_description":"The Poms and the Baggy Greens are at it again in the Ashes and for most people who follow cricket, it probably wasn't a huge surprise which team came out on top in the early skirmishes at the Gabba in Brisbane. The BBC called England's first innings performance \"woeful\" while the referred to it as \"England's horror show\". The settled for \"batting nightmare\". A good start for England was essential to give them confidence, but just the opposite happened with opening bat Rory Burns clean bowled by Mitchell Starc in the very first ball of the series. Hardly an auspicious omen. It wasn't long before the score was 11-3 with England captain Joe Root already back in the pavilion, out for a duck. That is not how Test matches are won, let alone Ashes matches. Eventually, England made it to 147 which might be a good score in snooker but is disaster in Test cricket. They only reached that figure thanks to some gritty performances from Jos Butler, Ollie Pope and Haseeb Hameed. Australia incidentally overhauled that score with just one wicket down thanks to a fine partnership between David Warner and Marnus Labuschagne. To be fair, the Aussie bowlers were top class led by their new captain Pat Cummins who took five wickets. When it came to England's turn in the field, there was already a psychological blow the visitors had to cope with. It was the first time in 15 years that England have gone into an Ashes Test without either Jimmy Anderson or Stuart Broad in the bowling attack. The English selectors must have quickly regretted that decision. Although the seam attack of Ollie Robinson, Chris Woakes and Mark Wood bowled quite tidily, spinner Jack Leach conceded a massive 95 runs from 11 overs, taking just one wicket. Making the most of Leach's friendly offerings were Warner and then Travis Head with a magnificent quick-fire century, eventually finishing on 152. An injury to Ben Stokes did not help the England bowling cause. Robinson briefly gave England some hope taking two wickets in consecutive balls but that was the extent of their joy as Head continued on his merry way. There are admittedly extenuating circumstances that led to England's poor battling display. All their warm-up games were washed out and they came into the first Test without any of the normal preparations, and it looked like it. As BBC commentator and former England player Jonathan Agnew wrote \"England's batsmen were like rabbits caught in headlights.\" While England have performed well at home in the Ashes, when they embark on their tours of Australia there has always been a sense of trepidation, and not without reason. Finishing \"On Top Down Under\" has only happened twice in the past 39 years. Owing to Covid restrictions, there was only a smattering of England fans at the Gabba but those who were there would not have been happy that the Barmy Army trumpet was already launching into the Great Escape after just one over of the series. Over the years the Gabba has not been a happy hunting ground for England. Six of their last eight visits to Brisbane have ended in defeat and the last time they won there was in the days of Mike Gatting back in the 1986/87 series. No wonder it is nicknamed the \"Gabbatoir.\" England's last success in Australia came in the 2010/11 series spearheaded by a superb batting display from England skipper Alastair Cook which saw him finish the series with an amazing average of 127. Over to you Captain Root.","image_url":null,"source_id":"bangkokpost"},{"title":"NSD vs SPT Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Inter District T20 2021, Semi Final 1","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/nsd-vs-spt-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-inter-district-t20-2021-semi-final-1?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-10 19:15:44","full_description":"The Nadia Super Dazzlers will take on the South 24-PGS Tigers in the first Semi-Final of the Bengal Inter District T20 2021 on Saturday, December 11. The Bengal Cricket Academy Ground in Kalyani will host this game. The Nadia Super Dazzlers have been amazing in the competition. They’ve made it to the semi-final and have the final in their sights. The Dazzlers defeated Howrah Diamond by 47 runs in the quarter-finals. Meanwhile, the South 24-PGS Tigers defeated Siliguri Bikash in their quarter-final. Siliguri Bikash were one of the favorites in the competition and a win against them will be a massive morale boost for the Tigers. NSD XI Surbodip Debnath , Arnab Sikdar , Tapan Koiri, Ayan Gupta , Amit Santra, Tanujit Acharjee, Tanmoy Paramanick, Sanjoy Sadhukhan, Soumodip Bagchi, Susanta Das, Raj Kumar Pal. SPT XI Sourav Mondal, Mrinmoy Nayak, Shuvam Dey, Dip Chatterjee , Koushik Giri , Supriya Sil, Soumya Das, Chandan Singh-I, Sandipan Dey, Jitender Shaw, Mohd Naushad Sagheer. Match: NSD vs SPT, Bengal Inter District T20 2021, Semi Final 1. Date and Time: 11th December, 2021, 8:45 AM IST. Venue: Bengal Cricket Academy Ground, Kalyani. The surface has become more balanced over the last few games and both bowlers and batters will find equal assistance. Rain could play a pivotal role in this game too and winning the toss might prove to be crucial. Wicketkeeper S Debnath is a great wicketkeeper choice for your Dream11 Fantasy Side. He’s safe behind the stumps and can also add important runs. Debnath scored 45 runs in the quarter-finals. Batters A Gupta has been one of the standout players for the Nadia Super Dazzlers. Gupta has been phenomenal with the bat and has also been a decent bowler. He has scored 105 runs in three matches and has also picked up three wickets. Gupta can be a decent multiplier choice for your NSD vs SPT Dream11 Fantasy Side. All-rounders S Sadhukhan is a great all-round player who will be looking to have a big influence here. Sadhukhan has done immensely well with the ball and has already picked up seven wickets in three matches at an economy rate of 6.55. S Dey is another player you must have on your Dream11 Fantasy Team. He has been in incredible form over the last three games, scoring 58 runs and has also picked up three wickets. Bowlers R Kumar Pal could prove to be lethal with the ball here. He has picked up four wickets in three matches so far. A Gupta (NSD) – 255 points R Kumar Pal (NSD) – 226 points S Sadhukhan (NSD) – 217 points S Dey (SPT) – 215 points S Bagchi (NSD) – 196 points A Gupta: 105 runs and 3 wickets R Kumar Pal: 25 runs and 4 wickets S Sadhukhan: 7 wickets S Dey: 58 runs and 3 wickets S Bagchi: 6 wickets Fantasy Suggestion #1: S Debnath, A Gupta, T Koiri, S Dey, S Sadhukhan, S Dey, K Giri, S Mondal, R Kumar Pal, S Bagchi, M Nayak. Captain: A Gupta | Vice-Captain: S Sadhukhan. Fantasy Suggestion #2: S Debnath, A Gupta, T Koiri, S Dey, D Chatterjee, S Sadhukhan, S Dey, K Giri, R Kumar Pal, S Bagchi, M Nayak. Captain: Sandipan Dey | Vice-Captain: R Kumar Pal. Try the new Fantasy Team Builder!","image_url":"https://static.sportskeeda.com/editor/2021/12/8faab-16391596212886-1920.jpg","source_id":"sportskeeda"},{"title":"NPC vs BUB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Bengal Inter District T20 2021, Semi Final 2","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/npc-vs-bub-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-bengal-inter-district-t20-2021-semi-final-2?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-10 19:15:44","full_description":"North 24-PGS Champs (NPC) will take on Burdwan Blues (BUB) in the second semi-final of the Bengal Inter District T20 2021 at the Bengal Cricket Academy Ground in Kalyani on Saturday. North 24-PGS were the runners-up last season, and they’d like to go all the way this time around. Their performances have been fabulous in the competition, and would be expected to win against Burdwan Blues. They beat Hooghly River by 12 runs in the quarter-final. Meanwhile, Burdwan Blues are coming off consecutive wins. They defeated Dare Devil Dakshin Dinajpur by nine wickets in the quarter-final. Koushik Ghosh, Prosenjit Kr Das, Sandipan Das Sr, Dipanjan Mukherjee, Pankaj Shaw, Uddipan Mukherjee, Suman Saha, Vineet Maurya, Prabhat Maurya, Raju Haldar, Rahul Basfore. Abhisek Banerjee, Nikhil Sinha, Abhijit Bhagat, Shubham Chatterjee, Arnab Ghosh, Debapriya Gosh, Suman Das, Azaz Ansari, Sanjib Kumar Singh, Bhupender Singh, Arka Sarkar. Match: NPC vs BUB, Bengal Inter District T20 2021, Semi-Final 2. Date and Time: 11th December, 2021; 12:45 PM IST. Venue: Bengal Cricket Academy Ground, Kalyani. The surface has been a balanced one in the last few games, so both bowlers and batters should find equal assistance. Rain could play a key role in this game too, so winning the toss might prove to be crucial. S Saha is a good bet for the wicketkeeper position in your Dream11 Fantasy team. He can score key runs. S Das Sr is a talented player who can fetch a lot of fantasy points for your team. He has scored 167 runs, and also picked up two wickets thus far. He could be a great multiplier choice for your NPC vs BUB Dream11 Fantasy side. Meanwhile, K Ghosh provides a steady flow of runs at the top of the order for his team. He has accumulated 137 runs at an average of 34.25 in the tournament thus far. D Mukherjee could be one to watch out for in this game. He has been a valuable all-round asset for the team. A Ansari has been extremely successful in recent games for his team in the tournament thus far. He will be expected to lead the bowling unit for his team. S Das Sr (NPC) – 299 points. A Ansari (BUB) – 230 points. D Mukherjee (NPC) – 224 points. S Saha (NPC) – 218 points. K Ghosh (NPC) – 205 points. S Das Sr: 167 runs and 2 wickets. A Ansari: 37 runs and 4 wickets. D Mukherjee: 35 runs and 5 wickets. S Saha: 69 runs. Fantasy Suggestion #1: S Saha, S Das Sr, K Ghosh, P Shaw, A Bhagat, A Banerjee, D Mukherjee, V Maurya, A Ansari, R Halder, A Sarkar. Captain: S Das Sr. Vice-Captain: D Mukherjee. Fantasy Suggestion #2: S Saha, N Sinha, S Das Sr, K Ghosh, A Banerjee, D Mukherjee, V Maurya, A Ansari, R Halder, A Sarkar, R Basfore. Captain: A Ansari. Vice-Captain: K Ghosh. Try the new Fantasy Team Builder!","image_url":"https://static.sportskeeda.com/editor/2021/12/0dffd-16391591867706-1920.jpg","source_id":"sportskeeda"},{"title":"Ashes 2021, Australia vs England, live cricket scores, first Test day four: Stream, how to watch, Joe Root century, Brisbane weather, rain","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-australia-vs-england-live-cricket-scores-first-test-day-four-stream-how-to-watch-joe-root-century-brisbane-weather-rain/news-story/81e6bb0cafbaa829df1033e26ee6b1eb","keywords":null,"creator":null,"video_url":null,"description":"Australia will look to nip a brewing resistance by England in the bud when play resumes on Day 4 of the first Ashes Test at The Gabba.","content":null,"pubDate":"2021-12-10 19:00:00","full_description":"Australia will look to nip a brewing resistance by England in the bud when play resumes on Day 4 of the first Ashes Test at The Gabba. The home side entered day three with all the momentum having dismissed England for just 147 and opening up a 278-run lead, but the visitors were inspired by skipper Joe Root as they started to bring in the margin. Dismissed for just a duck in the first innings, Root recorded an unbeaten 86 runs and was backed up by No.3 Dawid Malan, who also sits unbeaten on 80 - follow day four in our live blog below from 10.30am! Catch every moment of The Ashes live and ad-break free during play on Kayo. Join now for just $5 for 2-months Kayo Basic. New customers only, ends 13th Dec. DAY 3 WRAP MATCH CENTRE With England now just 58 runs adrift of Australia, spin bowler Nathan Lyon remains stranded on 399 Test wickets after 24 overs without reward on Friday. Australian cricket great Kerry O’Keeffe noted during the final session on Friday that, after a lacklustre start to the Test, “we have a game cricket”. Aussie spin king Shane Warne later added: “Make no mistake, if England can go close to winning, or if not win, it’s got to be one of the greatest Test wins of all time. It has to be. “If these two are still in and can get through the second new ball and the bowlers are getting tired, then the likes of Ben Stokes, Ollie Pope, Jos Buttler all come in — they could seriously get a good lead. “So this game is way, way, way away from being over.” MORE CRICKET NEWS ‘STILL FEELING PAIN SIX WEEKS LATER’: Doubt over subbed Warner’s return from ‘severe’ rib injury ‘STUPIDEST THING I’VE SEEN ON A CRICKET FIELD’: England blasted for ‘damaging’ Stokes management TALKING POINTS: Poms in spin as one mistake creates more; worrying sign for Smith Australia XI: Marcus Harris, David Warner, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey (wk), Pat Cummins (c), Mitch Starc, Nathan Lyon, Josh Hazlewood. England XI: Joe Root (c), Rory Burns, Jos Buttler (wk), Haseeb Hameed, Jack Leach, Dawid Malan, Ollie Pope, Ollie Robinson, Ben Stokes, Chris Woakes, Mark Wood. Follow the day four action in our blog below! Can’t see the blog? Tap here","image_url":null,"source_id":"foxsports"},{"title":"Pakistan vs West Indies 1st T20I Live Telecast Channel in India and Pakistan: When and where to watch PAK vs WI Karachi T20I?","link":"https://thesportsrush.com/cricket-news-pakistan-vs-west-indies-1st-t20i-live-telecast-channel-in-india-and-pakistan-when-and-where-to-watch-pak-vs-wi-karachi-t20i/","keywords":["Cricket","West Indies tour of Pakistan 2021"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Pakistan vs West Indies 1st T20I Live Telecast Channel: The SportsRush present before you the timing and live streaming details of the first PAK vs WI T20I. The West Indies team arrived in Pakistan on Thursday for a three-match T20I series and as many ODI matches in the port city of Karachi. All the six… The post Pakistan vs West Indies 1st T20I Live Telecast Channel in India and Pakistan: When and where to watch PAK vs WI Karachi T20I? appeared first on The SportsRush.","content":"Pakistan vs West Indies 1st T20I Live Telecast Channel: The SportsRush present before you the timing and live streaming details of the first PAK vs WI T20I. The West Indies team arrived in Pakistan on Thursday for a three-match T20I series and as many ODI matches in the port city of Karachi. All the six matches will take place at the National Stadium in Karachi, with the tour opener to take place on December 13 with the first of the three T20 International. A Pakistan official said a 26-member party had flown to Karachi early Thursday before being escorted by heavy security to the team hotel. This would be West Indies’ first visit to Pakistan since 2018. During their last tour to Pakistan the Windies side were decimated by Pakistan 3-0 in the three match T20I series. The imminent limited Overs series is of utmost significance given the harsh treatment meted out to the Pakistan Cricket Board (PCB) and Pakistan fans prior to the 2021 T20 World Cup wherein New Zealand, and a week later England decided not to go ahead with their respective White ball series tours. While the New Zealand camp pulled out in the eleventh hour of the start of the first ODI in September citing a possible security threat, England followed suit by postponing the series (both men’s and women’s) due to concerns over “mental and physical wellbeing” of its players. While New Zealand had quit their first tour to the country in 18 years, it would have been the first tour of Pakistan by an England women’s team in its history and the first by their male counterparts since 2005. Coming back to the upcoming series, team Pakistan are high on confidence ever since their successful T20 World Cup campaign, followed by a clean sweep against Bangladesh in the recently concluded T2oI and Test series. World no.1 white ball batter has checked-in for #PAKvWI Excited to watch him bat from 13 December? We know, you are pic.twitter.com/phBtwxC3tp — Pakistan Cricket (@TheRealPCB) December 10, 2021 Team West Indies, on the other hand, would be without their T20I regulars in Evin Lewis, Shimron Hetmyer, Andre Russell and Lendl Simmons- all opting out due to personal reasons. Former skipper Jason Holder is being rested, while Fabian Allen and Obed McCoy are out because of injuries. Last week captain Kieron Pollard also withdrew through a hamstring injury, leaving the Twenty20 leadership to Nicholas Pooran and ODIs to Shai Hope. Pakistan thus, under the leadership of Babar Azam would certainly start as favourites. Pakistan vs West Indies 1st ODI Live Telecast Channel in India and Pakistan Going by the past record, and having confirmed by the Sony Sports network, the Pakistan vs West Indies T20Is and ODIs would be telecast on Sony Six in India. The match will only be available in English commentary. Online users can stream the match on Sony’s streaming application named Sony LIV. As far as the fans in Pakistan are concerned, ASports and PTV Sports will provide the live telecast of the Karachi T20Is followed by the ODIs. Date – 13/12/2021 (Monday). Match start Time – 06:00 PM (Pakistan), 06:30 PM (India) and 08:00 AM (West Indies). TV Channel – Sony Six (India), PTV Sports and ASports (Pakistan). Online platform – Sony LIV (India).     The post Pakistan vs West Indies 1st T20I Live Telecast Channel in India and Pakistan: When and where to watch PAK vs WI Karachi T20I? appeared first on The SportsRush.","pubDate":"2021-12-10 18:39:10","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Ashes 2021-22: Test cricket has different rules for different injuries and it’ll inevitably cause problems","link":"https://thewest.com.au/sport/cricket/ashes-2021-22-test-cricket-has-different-rules-for-different-injuries-and-itll-inevitably-cause-problems-c-4900512","keywords":null,"creator":["Craig O'Donoghue"],"video_url":null,"description":"With concussion sub rules already in place for cricket, surely it’s time for a debate about how to handle serious mid-game injuries.","content":null,"pubDate":"2021-12-10 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4900512/39d11688005018eb5a534022d18cc4ff261937e9-16x9-x1y0w2446h1376.jpg","source_id":"thewest"},{"title":"Cricket excluded from provisional list of 2028 Los Angeles Olympics","link":"https://sportstar.thehindu.com/cricket/cricket-excluded-from-provisional-list-of-2028-los-angeles-olympics/article37928505.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"Cricket, which made its maiden and only appearance in 1900 Paris Olympics where it was played between just two countries, failed to make the provisional cut for the LA Games.","content":null,"pubDate":"2021-12-10 17:41:10","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"Cricket, 3 other Olympic sports excluded from provisional list of 2028 Los Angeles Games","link":"https://indianexpress.com/article/sports/sport-others/cricket-3-other-olympic-sports-excluded-from-provisional-list-of-2028-los-angeles-games-7666802/","keywords":["Sport Others","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-10 17:26:02","full_description":"Cricket’s bid for an Olympic spot received a jolt when it was excluded from the provisional list of 28 sports for the 2028 Los Angeles Games, along with three other sports, by the International Olympic Committee (IOC). Cricket, which has featured at the Olympics just once in 1900 Paris Games, weightlifting and modern pentathlon have failed to make the cut for the LA Games on Thursday. The IOC has given boxing and weightlifting federations 18 months time to set their house in order to be considered for the LA Games as these sport was plagued by issues of corruption and doping. In modern pentathlon’s case, the Olympic body has asked it to remove equestrian jumping from the event. Twenty-eight sports, including skateboarding, sport climbing and surfing, will be proposed for inclusion in the @LA28 #Olympics Initial Sports Programme at the IOC Session in February 2022. #IOCEB https://t.co/AjbMyRySXZ — IOC MEDIA (@iocmedia) December 9, 2021 Athletics, archery, badminton, basketball, tennis and wrestling are some of the sports that have been provisionally added to the Los Angeles Olympics programme. In 1990 Paris Games, cricket made its maiden and only appearance where it was played between just two countries. Top Sports News Now We had requested Virat not to step down as T20I captain: Sourav Ganguly Ashes: Joe Root and Dawid Malan lead stirring England fightback The inside story: Why Rohit replaced Kohli as India's white-ball captain Click here for more Besides Olympics, the other multi-sport in which cricket featured was only in the 1998 Commonwealth Games. Cricket, however, will make its return to the Commonwealth Games in next year’s Birmingham CWG in the form of a women’s Twenty20 event. In August this year, the ICC had started preparations for cricket’s inclusion in the Olympics. But the IOC takes into consideration a sport’s popularity, cost, complexity, uniqueness and relevance towards young people as factors before including them in the Olympic programme. The ICC, cricket’s governing body, currently has 12 full members and 94 associate members. Skateboarding, surfing and sports climbing, which made successful Olympic debuts in Tokyo, have managed to retain their spots. The provisional list of 28 sports will be submitted for approval at the IOC session in February next year.","image_url":null,"source_id":"indianexpress"},{"title":"“Wasn’t okay with three wicketkeepers being picked for the World Cup”: Ravi Shastri reckons Shreyas Iyer or Ambati Rayudu should’ve been included in India’s squad for 2019 Cricket World Cup","link":"https://thesportsrush.com/cricket-news-wasnt-okay-with-three-wicketkeepers-being-picked-for-the-world-cup-ravi-shastri-reckons-shreyas-iyer-or-ambati-rayudu-shouldve-been-included-in-indias-squad-for-2019-cricket-world-cup/","keywords":["Cricket","Ambati Rayadu","BCCI","Ravi Shastri","shreyas iyer","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ravi Shastri reckons Shreyas Iyer or Ambati Rayudu should’ve made it to Team India’s squad for the 2019 ICC World Cup held in England. Former Indian team coach Ravi Shastri, whose tenure ended after the 2021 T20 World Cup has finally come up with his candid views regarding his days as the head coach of… The post “Wasn’t okay with three wicketkeepers being picked for the World Cup”: Ravi Shastri reckons Shreyas Iyer or Ambati Rayudu should’ve been included in India’s squad for 2019 Cricket World Cup appeared first on The SportsRush.","content":"Ravi Shastri reckons Shreyas Iyer or Ambati Rayudu should’ve made it to Team India’s squad for the 2019 ICC World Cup held in England. Former Indian team coach Ravi Shastri, whose tenure ended after the 2021 T20 World Cup has finally come up with his candid views regarding his days as the head coach of the team. Shastri was appointed head coach in 2017 after India’s loss in the final of the ICC Champions Trophy against Pakistan and stayed in the position till his term came to an end in November 2021. The 59-year-old had an illustrious career, bidding adieu with a number of unprecedented success, especially on foreign soil, something that he has been vocal about since he relinquished his post. He, however does not have an ICC Trophy to boast of. Team India played the 2019 World Cup in England, the 2019 ICC Test Championship, and the 2021 T20 World Cup under his coaching stint. Speaking about India’s 2019 World Cup campaign, where they lost to New Zealand in the semis, Shastri has expressed his displeasure regarding the team selection before and during the World Cup. Ravi Shastri reckons Shreyas Iyer or Ambati Rayudu should’ve made it to the squad The former team India batter, turned back the clock, during an interview with the Times of India, and jogged down the memory lane to reminisce how he was dissatisfied with the selection committee opting for three wicketkeeper batters in the side. He was of the view back then, that either one of Ambati Rayadu or Shreyas Iyer should have been picked, although he had no say in the matter and as a coach was expected to bring out the best amongst the selected lot. “I had no say in that (team selection). But I wasn’t okay with three wicketkeepers being picked for the World Cup. Either Ambati or Shreyas could’ve come in. “What was the logic in having MS Dhoni, Rishabh [Pant] and Dinesh [Karthik] all together?”, remarked Shastri. The former head coach further said, “But I never interfered with the selectors’ work, except when I was asked for feedback or as part of a general discussion.” Ravi Shastri tells TOI he had no say in non-selection of Ambati Rayudu for 2019 World Cup. But what he can’t understand is, how could selectors pick 3 wicket-keepers? “They might as well have included Ambati or Shreyas.” Was one of the biggest WC selection blunders, no doubt. — KSR (@KShriniwasRao) December 10, 2021 It is worth mentioning that Ambati Rayudu was excluded from Team India’s squad for the 2019 World Cup despite averaging around 50 at number 4 for India. A couple of ordinary performances in the series prior to the World Cup meant that, all rounder Vijay Shankar was given the nod ahead of him given the latter’s ‘3-D skills’ in each of the three departments of the game.     The post “Wasn’t okay with three wicketkeepers being picked for the World Cup”: Ravi Shastri reckons Shreyas Iyer or Ambati Rayudu should’ve been included in India’s squad for 2019 Cricket World Cup appeared first on The SportsRush.","pubDate":"2021-12-10 16:16:56","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"David Warner injury update: Has David Warner been ruled out of Gabba Test match in Brisbane?","link":"https://thesportsrush.com/cricket-news-david-warner-injury-update-has-david-warner-been-ruled-out-of-gabba-test-match-in-brisbane/","keywords":["Cricket","Ashes 2021-22","Australia vs England","David Warner"],"creator":["Gurpreet Singh"],"video_url":null,"description":"David Warner injury update: David Warner did not field on Day 3 after suffering an injury while batting on Day 2 of first Ashes Test. After a dominating display of batting by the Aussies on Day 2 of the first Ashes Test at The Gabba in Brisbane, the English batters, taking full advantage of a… The post David Warner injury update: Has David Warner been ruled out of Gabba Test match in Brisbane? appeared first on The SportsRush.","content":"David Warner injury update: David Warner did not field on Day 3 after suffering an injury while batting on Day 2 of first Ashes Test. After a dominating display of batting by the Aussies on Day 2 of the first Ashes Test at The Gabba in Brisbane, the English batters, taking full advantage of a beautiful batting deck, turned the tables to claw their way back handsomely on Day 3. Earlier in the day, Australia managed to stretch their lead from 196 at the end of Day 2, to 278 after batting for just under two hours to end their first innings at 425/10. Travis Head (152 off 148), was the last batter to be dismissed after putting on a stellar display of batsmanship in the first innings. England in reply, having lost Rory Burns (13 off 27) and Haseeb Hamed (27 off 58) with mere 61 runs on the board were in some spot of bother, but skipper Joe Root (86* off 158) and Southpaw David Malan (80 off 177) rose on to the occasion and continued to bat defiantly till stumps on Day 3 adding together a total of 159* runs to take the English total to 220/2 with just a 58 run deficit before they set a target. Joe Root raises the bat, England’s first fifty of the #Ashes series pic.twitter.com/yBj8s6gUaB — cricket.com.au (@cricketcomau) December 10, 2021 To add to the Aussie woes, their opening batter David Warner was not seen on the field the entirety of Day 3 after going through an injury scare. David Warner injury update: Has David Warner been ruled out of The Gabba Test? Warner did not take to the field at all on Friday (Day 3) having suffered severe bruising to his ribs after being struck two nasty blows while batting on day 2 when he made an important 94 in Australia’s first innings. A short ball from Ben Stokes at an individual score of 26 targeted at the ribs, followed by yet another blow at the similar spot by speedster Mark Wood later in his innings meant Warner had to be sent for scans later in the day. The fact that he did not take the field for the entirety of Day 3, did raise some suspicions, but the good news for him and his fans is that those scans showed no break of ribs. There is no official word on his present condition, apart that the Australian camp expect him bat in their second innings despite the clear discomfort. Cameras spotted him resting in the rooms with what appeared to be an ice pack on his right ribcage. With England batting the way they are at the moment, the 35-year-old might well have to make another contribution with the bat, and it remains to be seen if he is sent to open or not. Former Aussie skipper Ricky Ponting expressed his concern after noticing Warner’s state on Day 3. “It’s a worry that he’s not out there at all,” Ponting told cricket.com.au on Friday. “We’ll have a better idea when he bats or if he bats at all in the second innings. “I noticed that after he got hit, he came out after one of the breaks and you could see that he had a little (chest) guard over that area. “I got a bit worried about it then because I’ve never seen him with a chest guard on before. “Even if it’s just bruising, I would think that he’d be out there fielding so there might be a bit more to it than what we’re hearing,” Ponting further remarked.             The post David Warner injury update: Has David Warner been ruled out of Gabba Test match in Brisbane? appeared first on The SportsRush.","pubDate":"2021-12-10 15:21:38","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Raj Angad and Harnoor, carrying the family legacy forward in style","link":"https://sportstar.thehindu.com/cricket/raj-angad-bawa-tarlochan-hockey-cricket-u-19-asia-cup-squad-harnoor-singh/article37926857.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Raj Angad is the grandson of hockey legend Tarlochan Bawa, while Harnoor's grandfather Rajinder Singh and father Birinder Singh were involved with cricket in Punjab.","content":null,"pubDate":"2021-12-10 14:24:37","full_description":null,"image_url":null,"source_id":"sportstar"},{"title":"England’s Dawid Malan provides the run support that Joe Root has missed all year | Andy Bull","link":"https://www.theguardian.com/sport/blog/2021/dec/10/cricket-england-dawid-malan-provides-the-support-joe-root-has-missed-all-year","keywords":["England cricket team","Australia cricket team","Australia sport","The Ashes","Ashes 2021-22","Cricket","Sport"],"creator":["Andy Bull"],"video_url":null,"description":"While Root has had a brilliant 2021 at the crease, his teammates have let him down but Malan has come good at the right timeAnd on the third day, some hope. The game changed as that 156-run partnership between Joe Root and Dawid Malan stretched on through the afternoon, the miseries for England of the first two innings receded, replaced by the promise of a better contest ahead. Root’s 86 was a vital sign that his duck in the first innings was an aberration, while Malan’s 80was, in a way, even more important. England won’t win anything if Root doesn’t score runs, but the truth is, they don’t necessarily win much when he does, either. He peeled off a flawless 180 not out against India at Lord’s in August and they were still beaten by 151.Just after tea at the Gabba, Root hit his 1,482nd run of 2021. It is a record for the most runs scored by an Englishman in a single year of Test cricket. On screen they showed the top five in the list. There was Michael Vaughan, of course, in 2002, Jonny Bairstow in 2016, and Root himself, in 2015 and 2016. It’s interesting, flicking through them, to see how well their teammates played around them at the time. In 2002, every member of England’s top six scored at least 500 runs; in 2015, so did Alastair Cook, Ben Stokes, Ian Bell and Moeen Ali; in 2016, Cook, Ali, and Stokes did it again, and so did Alex Hales. Continue reading...","content":null,"pubDate":"2021-12-10 13:31:11","full_description":"A nd on the third day, some hope. The game changed as that 156-run partnership between Joe Root and Dawid Malan stretched on through the afternoon, the miseries for England of the first two innings receded, replaced by the promise of a better contest ahead. Root’s 86 was a vital sign that his duck in the first innings was an aberration, while Malan’s 80was, in a way, even more important. England won’t win anything if Root doesn’t score runs, but the truth is, they don’t necessarily win much when he does, either. He peeled off a flawless 180 not out against India at Lord’s in August and they were still beaten by 151. Just after tea at the Gabba, Root hit his 1,482nd run of 2021. It is a record for the most runs scored by an Englishman in a single year of Test cricket. On screen they showed the top five in the list. There was Michael Vaughan, of course, in 2002, Jonny Bairstow in 2016, and Root himself, in 2015 and 2016. It’s interesting, flicking through them, to see how well their teammates played around them at the time. In 2002, every member of England’s top six scored at least 500 runs; in 2015, so did Alastair Cook, Ben Stokes, Ian Bell and Moeen Ali; in 2016, Cook, Ali, and Stokes did it again, and so did Alex Hales. This time around, no one has. In fact, while everyone’s been watching Root close in on one record, his teammates have been threatening another. This year the next-best batsman is Rory Burns, who has scored 492 runs. The last time England’s second-leading run scorer made so few was back in 1999, when England lost to New Zealand at home, and slipped to the bottom of the world rankings. In the long history of English cricket, it’s never happened that their leading batsman has scored more than 1,000 runs while the next best of his teammates has scored fewer than 500. The closest comparison is 1963, when Ken Barrington made 1,015, and Ted Dexter 583. All of which is another way of saying that the man who may be England’s greatest-ever batsman is playing in what is likely England’s weakest-ever batting line-up. They have put on 32 fifty-run partnerships this year, Root has been involved in 20 of them. They’ve put on 10 hundred-run partnerships, and Root has been involved in eight of those. He has scored six centuries, his 24 teammates have managed one. The business of captaincy, selecting teams, switching bowlers, picking out fields, managing people and handling the press is enough of a burden without the back-breaking load of carrying such a deadweight batting unit. The men around him owe him more. Which is why Malan’s innings mattered. It wasn’t perfect, he said himself “I did get away with it a bit”. There was a miscued pull that landed in front of Marcus Harris at square leg, an edge off Josh Hazlewood that flew over the slips, another off Pat Cummins that fell just short of Alex Carey, and an unsuccessful review for a catch behind which, he said later, he didn’t hit. He was beaten inside and out, played-and-missed almost 20 deliveries. And in among it, he hit some glorious cricket shots, crisp drives, swishy pulls, stylish glances. As the afternoon wore on, it got easier for him, then, as the bowlers changed and he started to cramp, it became harder again. But he persisted. That was what England needed. The irony is when England started planning for this series a year ago, Malan wasn’t part of their thinking. He’s only here because Zak Crawley’s form was so poor the selectors were compelled to look elsewhere. And here he was, a guy who had put together scores of 56, 140, 54, and 62 against these very same bowlers, on these very same grounds, on tour four years previously. England, in the meantime, had apparently decided they were so flush with batting talent they could do without him. The decision to drop him didn’t make that much sense at the time. “It may be that his game is better suited to overseas conditions,” said Ed Smith, who was chair of selectors. Malan, 34, comes across as a little insecure. He has spoken openly about how he was convinced that none of his teammates thought he was good enough to be playing Test cricket even after he scored that century in Perth in December 2017, and you can imagine how Smith’s words compounded that. Now here he was, making the most of his second chance he had long since given up on getting. After stumps he spoke about a moment midway through the afternoon: “I actually said to Rooty when we were both on 40 or 50, or similar scores, and the Barmy Army were singing, I said to him, ‘I’ve really missed this, someone trying to blow my head off, and the adrenaline going playing against the best bowlers’.” Anyone who can go through that and come out laughing and smiling about it has a dash of what England need right now.","image_url":"https://i.guim.co.uk/img/media/b74d87c7ac4b766fb36f871698e7f3eb28cd40ac/0_47_4000_2401/master/4000.jpg?width=460&quality=85&auto=format&fit=max&s=b0114c4174ca1b48ab364de98dc8893d","source_id":"theguardian"},{"title":"Dilip Vengsarkar addresses Rohit replacing Kohli as ODI captain; whether split captaincy will work in Indian cricket - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMivAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9kaWxpcC12ZW5nc2Fya2FyLWFkZHJlc3Nlcy1yb2hpdC1zaGFybWEtcmVwbGFjaW5nLXZpcmF0LWtvaGxpLWFzLW9kaS1jYXB0YWluLXdoZXRoZXItc3BsaXQtY2FwdGFpbmN5LXdpbGwtd29yay1pbi1pbmRpYW4tY3JpY2tldC0xMDE2MzkxNDEwNjc4MzMuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Dilip Vengsarkar addresses Rohit replacing Kohli as ODI captain; whether split captaincy will work in Indian cricket  Hindustan Times\"It Was Bound To Happen\": Aakash Chopra On Virat Kohli Being Sacked As ODI Captain  NDTVSports.comDifferent captains for different formats a wise move. Allows Kohli to focus on his batting  ThePrintSourav Ganguly: 'Had requested Virat not to step down as T20I captain'  ESPNcricinfoFor Kohli, the game has changed  Scroll.inView Full coverage on Google News","content":null,"pubDate":"2021-12-10 13:26:39","image_url":null,"source_id":"google"},{"title":"AJM vs SHA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Emirates D10 2021, Match 13","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ajm-vs-sha-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-emirates-d10-2021-match-13?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-10 13:16:53","full_description":"Ajman will take on Sharjah in the 13th match of the Emirates D10 2021 at the Sharjah Cricket Stadium in Sharjah on Friday. After suffering consecutive defeats against Fujairah and Abu Dhabi, Ajman managed to bounce back in the next game against Dubai. They defeated Dubai by chasing down their score of 95 in the last game. Ajman will hope to continue with the same winning momentum in the tournament. Meanwhile, this will be Sharjah’s second match of the day. They’ve lost their first couple of matches against Dubai and Fujairah. However, Sharjah too beat Emirates Blues in their most recent match by chasing down their score of 116. AJM XI Safeer Tariq (wk), Sagar Kalyan, Qasim Muhammad, Nasir Aziz (c), Sultan Ahmed, Rahul Chopra, Hafeez ur Rehman, Waqas Ahmed, Muhammad Sadiq, Abdul Shakoor, Faris Faisal SHA XI Fayyaz Ahmad (c), Khalid Shah (wk), Unaib Rehman, Umair Ali, Kashif Daud, Renjith Mani, Hassan Khan, Ansar Khan, Hazrat Bilal, Ali Anwaar, Syam Ramesh AJM vs SHA, Emirates D10 2021, Match 13 Date and Time: 10th December, 2021, 8:30 PM IST Venue: Sharjah Cricket Stadium, Sharjah The surface at the Sharjah Cricket Stadium is batting-friendly and batters will enjoy their time on this pitch. Spinners are likely to find plenty of assistance as well and a score of 110 could prove to be par. Wicketkeeper K Shah did immensely well over the last couple of matches. Against Emirates Blues, he scored 45 runs and his innings included six boundaries and four sixes. Batters Q Muhammad is a talented player who can fetch a lot of fantasy points for your team. Muhammad has batted at the top of the order for Ajman and was in great form in the last match. He can also roll up his sleeves and bowl a few overs. All-rounders U Ali will be the player to watch out for in this match. Ali scored 45 runs in the previous match and also picked up a wicket. Ali could also prove to be a fine multiplier choice for your AJM vs SHA Dream11 Fantasy Team. Bowlers A Anwar will be tasked with leading the bowling unit for his team. He has picked up three wickets over the last couple of matches. U Ali (SHA) – 245 points K Shah (SHA) – 209 points Q Muhammad (AJM) – 168 points A Anwar (SHA) – 154 points K Daud (SHA) – 133 points U Ali: 63 runs and 2 wickets K Shah: 105 runs Q Muhammad: 57 runs and 2 wickets A Anwar: 4 wickets K Daud: 37 runs and 2 wickets Fantasy Suggestion #1: K Shah, Q Muhammad, A Khan, S Kalyan, U Ali, K Daud, W Ahmed, A Anwar, H Bilal, H Ur Rehman, N Aziz Captain: U Ali , Vice-Captain: K Shah Fantasy Suggestion #2: K Shah, R Chopra, Q Muhammad, A Khan, S Kalyan, U Ali, K Daud, W Ahmed, A Anwar, H Ur Rehman, N Aziz Captain: Q Muhammad , Vice-Captain: K Daud Try the new Fantasy Team Builder!","image_url":"https://static.sportskeeda.com/editor/2021/12/b5e5c-16391393354122-1920.jpg","source_id":"sportskeeda"},{"title":"FUJ vs EMB Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Emirates D10, Match 14","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/fuj-vs-emb-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-for-emirates-d10?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-10 13:16:53","full_description":"Fujairah will be up against the Emirates Blues in the 14th match of the Emirates D10 2021/22 on 10th December at the Sharjah Cricket Association Stadium. Fujairah have been excellent so far this season and have managed to win all three games which places them at the top of the points table. They defeated Abu Dhabi by 30 runs in their previous game and will now aim to extend their winning run to four matches. The Emirates Blues, on the other hand, have also done well in the tournament, and have two wins in three matches. After winning their first two games, they suffered their maiden defeat against Sharjah by seven wickets in their previous encounter and will look to get back to winning ways once again. Fujairah Waseem Muhammad (C), Maroof Merchant, Ali Khan, Mujahid Amin, Asif Khan, Zeeshan Abid, Omer Farooq, Hamdan Tahir (WK), Usman Khan, Saqib Manshad, Raja Akifullah Khan Emirates Blues Chundangapoyil Rizwan (C), Zawar Farid, Fahad Nawaz, Aryan Lakra, Ansh Tandon, Rahul Bhatia, Mohammed Faraazuddin, Mohammad Boota(WK), Sabir Rao, Alishan Sharafu, Danish Qureshi Match : Fujairah vs Emirates Blues, Emirates D10 Date and Time: 10th December, 11:00 PM IST Venue : Sharjah Cricket Association Stadium The pitch at the Sharjah Cricket Association Stadium is generally favorable for spinners. However, in the last few games played here, batters have dominated the proceedings by making full use of the shorter boundaries. The average first innings score in the last three games is approximately around 110 runs. Wicketkeeper Muhammad Boota: Boota has been a consistent performer for the Blues and has provided them with quick starts at the top. He has scored 78 runs in three games while also being effective behind the stumps. Batters Usman Khan: Usman is an explosive middle order batter who has the ability to score all around the park. He has managed to score 77 runs so far and will aim to add more runs to his total. CP Rizwan: Rizwan has made useful contributions for the Blues in both departments of the game. He has scored 40 runs so far and picked up two wickets with the ball. All-rounders Waseem Muhammad: Waseem has led Fujairah from the front scoring 37 runs as well as taking six wickets in the tournament so far. He is a top captain pick for your dream11 team. Aryan Lakra: Aryan has been a vital cog for the Blues this season. He has been reliable with the ball taking five wickets and that too at a miser economy rate. Bowlers Mujahid Amin: Mujahid is the leading wicket taker of this season so far, having picked up seven wickets in just three matches. He is a player to watch out for in this game. Danish Qureshi: Danish is another wise pick from the bowling department. He has grabbed three wickets in two games and is expected to add a couple more in this match. Waseem Muhammad: 283 points Mujahid Amin: 237 points Aryan Lakra: 201 points Akifullah Khan: 184 points Muhammad Boota: 162 points Waseem Muhammad: 3 matches, 37 runs and 6 wickets Mujahid Amin: 3 matches, 7 wickets Aryan Lakra: 3 matches, 5 wickets Akifullah Khan: 3 matches, 6 wickets Muhammad Boota: 3 matches, 78 runs Fantasy Suggestion #1 : Muhammad Boota, Usman Khan, Asif Khan, CP Rizwan, Zeeshan Abid, Waseem Muhammad, Aryan Lakra, Rahul Bhatia, Mujahid Amin, Akifullah Khan, Danish Qureshi Captain: Waseem Muhammad Vice-Captain: Mujahid Amin Fantasy Suggestion #2: Muhammad Boota, Usman Khan, Alishan Sharafu, CP Rizwan, Ansh Tandon, Waseem Muhammad, Aryan Lakra, Omer Farooq, Mujahid Amin, Akifullah Khan, Danish Qureshi Captain: Aryan Lakra Vice Captain: Usman Khan Try the new Fantasy Team Builder!","image_url":"https://static.sportskeeda.com/editor/2021/12/77725-16391366054850-1920.jpg","source_id":"sportskeeda"},{"title":"WA facing facing prospect of summer of virtually no cricket","link":"https://thewest.com.au/sport/cricket/wa-facing-facing-prospect-of-summer-of-virtually-no-cricket-c-4901270","keywords":null,"creator":["Braden Quartermaine"," Ben Horne and Julian Linden"],"video_url":null,"description":"Perth’s summer of cricket has been all-but scrubbed, with Perth Scorchers losing their prized home Boxing Day clash and facing being locked out of their home State for most of the Big Bash League.","content":null,"pubDate":"2021-12-10 12:01:54","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-4901270/628e71aa92054a5fad053cad13b37c8dc3404b36-16x9-x0y209w4000h2250.jpg","source_id":"thewest"},{"title":"Khawaja best replacement if Warner injured: Ponting | cricket.com.au - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL3JpY2t5LXBvbnRpbmctdXNtYW4ta2hhd2FqYS10by1yZXBsYWNlLWRhdmlkLXdhcm5lci1yaWItaW5qdXJ5LWZvcmNlcy1oaW0tb3V0LWFkZWxhaWRlLXRlc3QvMjAyMS0xMi0xMNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Khawaja best replacement if Warner injured: Ponting | cricket.com.au  cricket.com.au‘Severely bruised’: David Warner under injury cloud after ‘nasty blow’  NEWS.com.auAussies handed big Warner boost as star set to play on with ‘severe’ rib injury  Fox SportsEngland skipper Joe Root digs deep  The AustralianAustralian star David Warner off the field with 'severely bruised ribs'  Wide World of SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-10 10:40:56","image_url":null,"source_id":"google"},{"title":"Joe Root and England refuse to buckle at the Ashes – The Final Word podcast","link":"https://www.theguardian.com/sport/audio/2021/dec/10/joe-root-and-england-refuse-to-buckle-at-the-ashes-the-final-word-podcast","keywords":["Ashes 2021-22","The Ashes","Australia sport","Cricket","England cricket team","Australia cricket team","Sport"],"creator":["Presented by Emma John"," Adam Collins and Geoff Lemon. Produced by Joe Koning. The Final Word is produced by Bad Producer Productions and edited by James Hurley. Executive producers Gabrielle Jackson and Melanie Tait"],"video_url":null,"description":"Emma John offers her thoughts on day three of the first Test before Adam Collins and Geoff Lemon share their views from the GabbaDo you know a lost cause when you see one? Emma hails the nerveless Joe Root and Dawid Malan for refusing to fold on day three of the first Test, setting up a proper contest at the Gabba.Adam and Geoff echo those thoughts as the England pair showed excellent temperament, with the rules of Test cricket continuing to be thrown out of the window and giving Australia plenty to think about. Continue reading...","content":null,"pubDate":"2021-12-10 10:24:27","full_description":"Emma John offers her thoughts on day three of the first Test before Adam Collins and Geoff Lemon share their views from the Gabba How to listen to podcasts: everything you need to know","image_url":"https://i.guim.co.uk/img/media/2613441b740519157de873e02c72bb6a13c8ef46/0_129_4038_2423/master/4038.jpg?width=460&quality=85&auto=format&fit=max&s=d3f85ef547986ef527134313f4145736","source_id":"theguardian"},{"title":"Ravi Shastri makes comment on Rohit Sharma becoming India's ODI and T20I captain","link":"https://zeenews.india.com/cricket/ravi-shastri-makes-comment-on-rohit-sharma-becoming-indias-odi-and-t20i-captain-2418077.html","keywords":null,"creator":null,"video_url":null,"description":"With Rahul Dravid taking charge as the head coach of the Indian men's cricket team and Rohit Sharma named the captain of both ODI and T20I teams, a new era has begun in Indian cricket, bringing curtains down on the Virat Kohli-Ravi Shastri era.","content":null,"pubDate":"2021-12-10 10:19:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"Hardik Pandya To Announce His Retirement Before IPL 2022: Reports","link":"https://www.sentinelassam.com/sports/cricket/hardik-pandya-to-announce-his-retirement-before-ipl-2022-reports-567207","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The reports further revealed that Pandya has spoken about the same with BCCI. And there are possibilities of him saying Good Bye to the longest format of the game before IPL 2022.","content":"New Delhi: Due to prolong fitness issue, Hardik Pandya might announce his retirement from the long format of the cricket game i.e. Test cricket.Notably, the injuries have kept him out of bowling action in the recent years and according to media reports, the cricketer has asked the Board of Control for Cricket in India (BCCI) not to consider him for the upcoming South Africa tour.The reports further revealed that Pandya has spoken about the same with BCCI. And there are possibilities of him saying Good Bye to the longest format of the game before IPL 2022.Recently, questions were raised on his bowling in the T20 World Cup and in cash-league tournament IPL; he stayed away from the ball. However, it's not only Pandya's fitness, but his form too has remained a hot topic for the discussion in the cricket fraternity. He has failed to show class cricket which he known for.In the recent concluded T20 World Cup, he played his last international T20 match on November 8, 2021 where he did not get a chance to show his skills both with bat and ball. On the other hand, 11 against Pakistan, 14 against Australia, 12 against England, and when it comes to IPL matches, his score in the last three matches of Mumbai have been 10, 05 and 17. So, it wouldn't be wrong to say that his form is not in a great position.When it comes Hardik Pandya career, he has so far played 11 Test match where he scored 532 with the help 1 century and 5 half century. In T20 format, the 28-year-old cricketer has scored 553 runs in 54 matches with a strike rate of 146.On the other hand, in One Day International (ODI) he has scored 1286 in 66 matches. When it comes to bowling, the statistics shows that Pandya has taken 17 wickets in 11 Tests, 57 wickets in 63 ODIs, and 42 wickets in 54 matches of T20.Also read:Batter of Virat Kohli's quality always required in team: Rohit SharmaAlso watch:","pubDate":"2021-12-10 10:16:02","full_description":"New Delhi: Due to prolong fitness issue, Hardik Pandya might announce his retirement from the long format of the cricket game i.e. Test cricket. Notably, the injuries have kept him out of bowling action in the recent years and according to media reports, the cricketer has asked the Board of Control for Cricket in India (BCCI) not to consider him for the upcoming South Africa tour. The reports further revealed that Pandya has spoken about the same with BCCI. And there are possibilities of him saying Good Bye to the longest format of the game before IPL 2022. Recently, questions were raised on his bowling in the T20 World Cup and in cash-league tournament IPL; he stayed away from the ball. However, it's not only Pandya's fitness, but his form too has remained a hot topic for the discussion in the cricket fraternity. He has failed to show class cricket which he known for. In the recent concluded T20 World Cup, he played his last international T20 match on November 8, 2021 where he did not get a chance to show his skills both with bat and ball. On the other hand, 11 against Pakistan, 14 against Australia, 12 against England, and when it comes to IPL matches, his score in the last three matches of Mumbai have been 10, 05 and 17. So, it wouldn't be wrong to say that his form is not in a great position. When it comes Hardik Pandya career, he has so far played 11 Test match where he scored 532 with the help 1 century and 5 half century. In T20 format, the 28-year-old cricketer has scored 553 runs in 54 matches with a strike rate of 146. On the other hand, in One Day International (ODI) he has scored 1286 in 66 matches. When it comes to bowling, the statistics shows that Pandya has taken 17 wickets in 11 Tests, 57 wickets in 63 ODIs, and 42 wickets in 54 matches of T20. Also read: Batter of Virat Kohli's quality always required in team: Rohit Sharma Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/10/280452-nanannana.jpg","source_id":"sentinel"},{"title":"'Either Ambati Rayudu or Shreyas Iyer Could’ve Come In'-Ravi Shastri Looks Back at 2019 Cricket World Cup G - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvZWl0aGVyLWFtYmF0aS1yYXl1ZHUtb3Itc2hyZXlhcy1peWVyLWNvdWxkdmUtY29tZS1pbi1yYXZpLXNoYXN0cmktbG9va3MtYmFjay1hdC0yMDE5LWNyaWNrZXQtd29ybGQtY3VwLWdhZmZlLTQ1NDA4ODAuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'Either Ambati Rayudu or Shreyas Iyer Could’ve Come In'-Ravi Shastri Looks Back at 2019 Cricket World Cup G  News18EXCLUSIVE: Though there were many firsts, there is also the disappointment of failing at three ICC tourna  Times of IndiaFormer India Head Coach Ravi Shastri Shares His Views On Rohit Sharma's Captaincy  NDTVSports.comAn attempt was made to ensure I didn't get India coach job in 2017: Ravi Shastri  India TodayRavi Shastri Reckons Keeping MS Dhoni, Rishabh Pant and Dinesh Karthik In 2019 World Cup Semi Final Was Beyon  India.comView Full coverage on Google News","content":null,"pubDate":"2021-12-10 10:10:42","image_url":null,"source_id":"google"},{"title":"The Ashes: Marnus Labuschagne not surprised by England's fightback, 'Test cricket is meant to be hard'","link":"https://www.indiatoday.in/sports/cricket/story/the-ashes-marnus-labuschagne-joe-root-dawid-malan-england-australia-fightback-gabba-1886385-2021-12-10?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: Marnus Labuschagne not surprised by England's fightback, 'It's Test cricket'","content":null,"pubDate":"2021-12-10 09:44:05","full_description":"Australia's Marnus Labuschagne said that he is not surprised by how Joe Root and Dawid Malan managed to drag England back into the match on Day 3 and that the hosts will now be looking to make the most of the new ball on the fourth day at the Gabba. Bundled out for a meagre 147 in their first innings, England produced a vastly improved batting display in the second to finish day three on 220-2, still 58 runs behind at the Gabba. The visitors were in a precarious spot at 61/2 but captain Root and Malan went on to add 159 runs for the third wicket. \"It's Test cricket, you never expect any Test nation, especially when you're playing England in the Ashes, to come in and roll over and you're going to knock them over,\" Labuschagne, who contributed 74 to Australia's first innings total of 425, told reporters. \"Test cricket is a grind, it's meant to be hard, otherwise it wouldn't mean so much to both countries. So for us, it's just a day at the office and we make sure we come back tomorrow, review our plans how we bowled today, and come up with some ideas and get those last eight weeks.\" Root and Malan will start Saturday with overnight scores of 86 and 80 respectively and will be looking to get England as far as ahead of Australia's first innings total as possible. Australia, on the other hand, are looking at the new ball too skittle England out as quickly as possible and possibly get a low target to chase or even record an unlikely innings win. \"The new ball is crucial. There can be long partnerships and then all of a sudden you can lose bang-bang-bang quick wickets,\" Labuschagne said. \"If we can put that new ball in the right areas and get a couple of wickets with that new ball, it can really turn quickly.\" Labuschagne also said that he was not aware of opener David Warner's status. Warner, who scored 94, was hit by Mark Wood and Ben Stokes on Thursday and while scans showed no break, the 35-year-old has suffered severe bruising. \"Those two blows to the rib, that's why he was not fielding today. I don't really know too much about that apart from that,\" he said. Live TV Also Read | The Ashes: Joe Root closes in on Sachin Tendulkar, Sunil Gavaskar for most Test runs in a calendar year Also Read | The Ashes: Ben Stokes's lack of preparation a huge concern for England, says Michael Hussey","image_url":null,"source_id":"indiatoday"},{"title":"Malan admits he thought Test cricket had passed him by","link":"https://sportstar.thehindu.com/cricket/dawid-malan-admits-test-cricket-passed-him-by-england-vs-australia-1st-ashes-test-gabba/article37923935.ece","keywords":null,"creator":["AFP"],"video_url":null,"description":"The 34-year-old South African-born Dawid Malan was speaking after his gritty 80 not out in England's second innings against Australia in the first Ashes Test at the Gabba.","content":null,"pubDate":"2021-12-10 09:32:12","full_description":null,"image_url":null,"source_id":"sportstar"}]}