{"newsArray":[{"title":"INSIDE COUNTY CRICKET: Daniel Bell-Drummond on making history","link":"https://www.dailymail.co.uk/sport/cricket/article-12293185/INSIDE-COUNTY-CRICKET-Daniel-Bell-Drummond-making-history.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE INTERVIEW BY HENRY CLARK: Bell-Drummond ground the toiling Northamptonshire attack into the dirt not with explosive hitting but with good, old-fashioned batting.","content":"900 runs, nine hours... and two pints of Guinness! Kent batsman Daniel Bell-Drummond on making history, with a little help from their No 11 Bell-Drummond became the fourth Kent man to hit 300 in a fortnight ago The milestone was at risk when Arshdeep Singh started to attack the bowlers He had watched his friend Sean Dickson hit 300 and wanted to do the same By Henry Clark For Mailonline Updated: 18:19 EDT, 12 July 2023 e-mail View comments Imagine being within touching distance of a triple century but stranded at the non-striker’s end, relying on your team’s No 11 to see out the over and get you back on strike. Terrifying, right? That’s the predicament Daniel Bell-Drummond found himself in against Northamptonshire in the County Championship two weeks ago. In nearly nine hours at the crease, the immovable Kent No 3 compiled a historic innings of the highest order. Bell-Drummond ground the toiling Northamptonshire attack into the dirt not with explosive hitting but with good, old-fashioned batting — namely a solid defence and clever strike rotation. The fact only 110 of his 300 runs were scored in boundaries tells you everything. In a stand of 318 for the second wicket with Tawanda Muyeye, who made 179, he skipped to a century and then breezed to a double ton. By the time Bell-Drummond had made 290, Kent were six wickets down. But three quick dismissals early on day three brought their final batsman, Arshdeep Singh, to the crease with Bell-Drummond on 293. Daniel Bell-Drummond became the fourth Kent man to hit 300 in an innings against Northamptonshire The milestone was in doubt when Arshdeep Singh arrived at the crease and started to attack The two players high-fived as they passed on Bell-Drummond's way to his 300 in the game While Singh is a tidy left-arm fast bowler, a batter he is not. The Indian averages 14 in First-Class cricket and plays in a manner which makes Bazball seem conservative. ‘There were a few things going through my head,’ Bell-Drummond tells Mail Sport of the moment Singh came out to the middle and started swinging for the hills. ‘I was obviously thinking, “What is he doing?” but I was so shattered that I wasn’t really concentrating on him. I did tell him, “Stick with me here”. But of course he was just going to do his own thing. ‘It was nerve-wracking when he tried to start hitting sixes. I’m glad he stayed there because he got out the next ball after I went to 300! It was very funny.’ With a simple jab into the leg side, Bell-Drummond reached his triple hundred, becoming only the fourth Kent player to achieve the milestone. The club’s history books are a fitting place for the 29-year-old who is Kent through-and-through, having joined the club’s academy aged six. Bell-Drummond went into the match on the back of a century against Middlesex in the T20 Blast He is now injured, and frustrated not to be able to cash in on his positive form against Warwickshire this week While he has long been one of the premier white-ball openers on the county circuit, Bell-Drummond had experienced an indifferent start to 2023 in the County Championship. But just two days on from making 111 from 58 deliveries against Middlesex in the Vitality Blast at Canterbury, Bell-Drummond was recalled to the side and back in his whites at the County Ground. ‘I wanted to make a statement having been dropped,’ he admits. ‘I wouldn’t say I was feeling like I never have done before at the crease. But once I got in, I said, “Whatever happens, they’re going to have to get me out, I’m not going to give it away”.’ Bell-Drummond jokes the toughest part of his innings was being on 271 not out overnight and dealing with noise from off the pitch ahead of his final push. He says: ‘Everyone was messaging saying, “I’m going to be watching tomorrow when you get your 300”, and I’m thinking, “Nothing is guaranteed here!”’ Among the names he joined in the county’s exclusive 300 club was former team-mate and good friend Sean Dickson. Bell-Drummond had the best seat in the house for Dickson’s record-breaking innings when he smashed 318, also against Northants, at Beckenham in 2017. Bell-Drummond's friend and former team-mate Sean Dickson, now of Somersert, rang him to congratulate him ‘I opened the batting with him and got 49… I thought I did quite well!’ he jokes. ‘But Joe Denly got 182 and Sean got 318. I remember watching from the balcony at Beckenham when he got the triple. I couldn’t have been prouder and I thought, “Damn, I want to do that one day”. ‘We’ve been through a lot of tough times facing the new ball, sometimes on tricky wickets, and I’m glad I can be in the record books with him after spending so much time at the crease with him. He rang me straight afterwards.’ You’d think celebrations would be in order after an innings of that magnitude, especially as it helped Kent to an emphatic victory. But the relentless nature of the domestic schedule meant that festivities were low-key. Bell-Drummond reveals that he enjoyed a couple of Guinnesses in the hotel bar after his achievement ‘I just had a couple of Guinnesses in the hotel bar,’ Bell-Drummond reveals. ‘Everyone was so tired. I was just trying to reply to messages most of the evening. Then we had to go back out for day four and field again.’ A hamstring strain kept Bell-Drummond out of Kent’s match with Warwickshire this week and while he was frustrated not to be able to cash in on his rich vein of form, it has given him time to reflect on his innings of a lifetime. ‘Sometimes you don’t realise the gravity of things,’ he says. ‘The love I was shown and the messages I received from family and friends meant so much. ‘It was a fairytale… 300 on the dot. It was a day I will never, ever forget.’ Share or comment on this article: INSIDE COUNTY CRICKET: Daniel Bell-Drummond on making history e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 22:19:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/22/73151881-0-image-m-20_1689197805294.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Williams misses out on Player of the Month award","link":"https://www.chronicle.co.zw/williams-misses-out-on-player-of-the-month-award/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com CHEVRONS star all-rounder, Sean Williams missed out on making history and becoming the second Zimbabwean to win the prestigious International Cricket Council (ICC) Player of the Month award. Williams was nominated for the Player of the Month for June but lost to record breaking Sri Lankan spinner, Wanindu Hasaranga. The other player […]","content":"The Chronicle CHEVRONS star all-rounder, Sean Williams missed out on making history and becoming the second Zimbabwean to win the prestigious International Cricket Council (ICC) Player of the Month award. Williams was nominated for the Player of the Month for June but lost to record breaking Sri Lankan spinner, Wanindu Hasaranga. The other player nominated together with Williams and Hasaranga was Australian batter, Travis Head. Williams’ nomination came after the 36-year-old has been enjoying a purple patch during the recently ended 2023 Men’s Cricket World Cup Qualifiers which took place in Zimbabwe. He was a shining light for Zimbabwe and from the seven innings in the Qualifiers, he has scored a massive 600 runs at an average of 100 per match. However, in the month of June when he played five matches, Williams scored 532 runs at an average of 133, coming from three centuries against Nepal, the United States of America (USA) and Oman, and came at a staggering strike rate of 148.60. He scored 91 more runs in the Chevrons’ win over the Netherlands. His June tally became the third-most runs scored in five consecutive ODI innings, with Indian great, Kohli and Pakistan stalwart, Babar Azam making the top two. Hasaranga became the first spinner in history to take three consecutive five-wicket hauls in ODI cricket, setting Sri Lanka on course for qualification to the ICC Men’s Cricket World Cup in India which starts on 5 October. The voting was conducted among a specialist panel comprising ICC Hall of Famers, former international players, media representatives and global cricket fans registered at icc-cricket.com. – @brandon_malvin","pubDate":"2023-07-12 22:03:29","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"COURT REPORT: Svitolina's route to the semis was as hard as it gets","link":"https://www.dailymail.co.uk/sport/tennis/article-12292829/COURT-REPORT-Svitolinas-route-semis-hard-gets.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MATTHEW LAMBERT AT WIMBLEDON: ELINA Svitolina's route to the semi-finals has been as tough as they come. Four of her five opponents have been former Grand Slam champions.","content":"COURT REPORT: Elina Svitolina's route to the semis was as hard as it gets and Jannik Sinner gets little practice ahead of Novak Djokovic tie... while the players with the most winners and unforced errors are revealed The semi-finals are set in singles competition and will commence on Thursday Elina Svitolina will face Marketa Vondrousova ahead of a potential final Carlos Alcaraz has produced the most unforced errors and double faults so far Latest Wimbledon 2023 news, including schedule, travel updates and results By Matthew Lambert for the Daily Mail Updated: 22:45, 12 July 2023 e-mail View comments The semi-finals of Wimbledon are on the horizon with Thursday to play host to the women's singles on Centre Court. The men's doubles will also continue on Thursday, while the women's doubles and men's singles will have to wait until Friday. Wednesday saw Carlos Alcaraz and Daniil Medvedev progress , while the competition moved one step closer to players from Ukraine and Belarus facing off in the women's singles following a victory for Aryna Sabalenka . The day saw plenty more action, too, with England cricket captain Ben Stokes throwing down a few serves, the crowd finding Kader Nouni's confusion amusing and a focus on Jannik Sinner's draw. Here is Mail Sport's Court Report from Wimbledon by Matthew Lambert. Elina Svitolina's route to the semi-finals of Wimbledon has been as tough as they come Jannik Sinner meanwhile, has had a favourable draw - though faces Novak Djokovic next Elina has it tough Elina Svitolina’s route to Thursday's semi-finals has been as tough as they come. Four of her five opponents have been former Grand Slam champions: Venus Williams, Sofia Kenin, Victoria Azarenka and Iga Swiatek. Jannik on easy street Jannik Sinner, meanwhile, has had a saintly draw. These are the ranks of the players he has taken out en route to the last four: 111, 98, 79, 85, 92. You can only beat what’s in front of you but it’s not ideal preparation for facing Novak Djokovic. Fans in fits over Nouni confusion Umpire Kader Nouni’s rich caramel purr is the best voice in tennis. But the Centre Court crowd picked an unfortunate time to suddenly find it hilarious — the Frenchman having got muddled with the set score in the Jabeur-Rybakina clash. Umpire Kader Nouni left fans giggling when he got muddled with the set score during Wednesday's Jabeur-Rybakina clash New bowls please! England Test captain Ben Stokes was at Wimbledon on Wednesday and he sent down a couple of serves in the Vodafone speed gun booth. Mail Sport can reveal that his two efforts were clocked at 86 and 92mph! Aces are high for super Sabalenka Now the semi-finals are set, here’s a look at who is leading the various tallies in the singles events: WHO LEADS THE WAY? Men Women Aces: Sinner, Medvedev 57 Double faults: Alcaraz 20 Break points saved: Alcaraz 81 per cent Winners: Djokovic 209 Unforced errors: Alcaraz 121 Aces: Sabalenka 35 Double faults: Sabalenka 18 Break points saved: Jabeur Winners: Svitolina 132 Unforced errors: Svitolina 127 Share or comment on this article: COURT REPORT: Svitolina's route to the semis was as hard as it gets e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 21:45:34","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/22/73149341-0-image-m-60_1689195853099.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 1st Test 2023: Ravi Ashwin’s Five-Wicket Haul Headlines Dominant Day 1 for India in Dominica","link":"https://www.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-2023-ravi-ashwins-five-wicket-haul-headlines-dominant-day-1-for-india-in-dominica-5261678.html","keywords":null,"creator":null,"video_url":null,"description":"At stumps on Day 1, India were 80/0 in 23 overs, trailing West Indies by just 70 runs. Captain Rohit Sharma scored 30 runs while Yashasvi Jaiswal added 40 on his debut.","content":"Ravichandran Ashwin returned to the Indian team in style, taking a five-wicket haul and absolutely demolishing West Indies on Day 1 of the first Test in Dominica on Wednesday, July 12. The ace off-spinner, who was left out of the Indian playing XI that lost the WTC final in June, made a statement as he not only became the third Indian bowler to get to 700 international wickets but also starred with a five-wicket haul that knocked the breath out of the West Indies batting line-up. Ravindra Jadeja (3/26) too, had a good day with three wickets, with Mohammed Siraj (1/25) and Shardul Thakur (1/15) scalping one apiece. West Indies, bowled out for just 150, needed a big performance from their bowlers first up, but that did not happen with Indian captain Rohit Sharma and Yashasvi Jaiswal remaining unbeaten. Ravi Ashwin Becomes Third Indian Bowler To Take 700 Wickets in International Cricket, Achieves Feat by Dismissing Alzarri Joseph in IND vs WI 1st Test 2023. Ravichandran Ashwin Headlines India's Dominance on Day 1 Stumps day 1, India trail by 70 runs #WIvIND #RallywithWI pic.twitter.com/DsFdsZzr8J — Windies Cricket (@windiescricket) July 12, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-12 21:35:40","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right","link":"https://www.dailymail.co.uk/sport/cricket/article-12292645/PAUL-NIXON-Jonny-Bairstows-mistakes-stop-footwork-right.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"PAUL NIXON: The whole world has been watching when Bairstow has made mistakes and I have felt for him. But he has done some really good things with the gloves, too.","content":"PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right... he has done some really good things with the gloves despite the errors Jonny Bairstow can perform with more consistency if he improves his footwork Despite the mistakes that he has made, Bairstow has done some good things Bairstow was out for a long time with injury and needs to build up momentum By Paul Nixon For The Daily Mail Updated: 22:30 BST, 12 July 2023 e-mail View comments Jonny Bairstow has faced a real test of his character in this Ashes. To keep wicket for England when you don’t do it day in, day out is a tough job and when the ball is thundering through at 95mph, as it was from Mark Wood at Headingley, it’s particularly challenging. The whole world has been watching when Bairstow has made mistakes and I have felt for him. But he has done some really good things with the gloves, too. We have to remember Jonny was out for a long time with injury and it seems he has not had enough repetitions of those power positions — when you are crouched down and ready to spring up — movement and foot positioning. This England attack provide different challenges for a keeper. Chris Woakes swings it away but also has his wobble seam ball that nips back with an over-the-top action. Stuart Broad goes a bit wider and that can drag the keeper’s weight inside, down leg side, so you have to be really strong and keep your head on the outside edge. If Jonny Bairstow can get his footwork right then he will be able to cut out the errors And for Wood’s extra pace it’s easy to make the mistake of standing a bit taller because you’re deeper. You have to challenge yourself to stay in that power position longer. There has been an excessive amount of seam movement and swing after the ball has gone past the bat during this series and with the wobble seam delivery, shaping it back in off the seam, your foot movement has to be particularly good. We all think of Bairstow as this strong, dominant batsman in the perfect mould for the terrific way England are playing but you can take confidence into your batting from your keeping and there are signs that Jonny is low on that confidence. After Ollie Pope got injured in the second Test I would have brought Ben Foakes back But what is pleasing as a coach is that he’s never actually looked out of nick with the bat and he’s been a bit unlucky with a couple of drag-ons. His balance has remained good and he’s not falling over so the alarm bells are not ringing yet for me. After Ollie Pope got injured in the second Test at Lord’s, I would have moved Jonny up to No 3 and brought Ben Foakes back but I can fully understand why England went the way they did. They have to take 20 wickets and Moeen Ali is one of the biggest spinners of the ball we’ve got. Keepers get their rhythm from the bowlers and understanding their mindsets. Once they are in that rhythm, they will make fewer and fewer mistakes. I’ve no doubt that will be the case with Jonny in the last two Tests as long as his confidence hasn’t been too badly hit. Once Bairstow manages to get into his rhythm he will make fewer and fewer mistakes Share or comment on this article: PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 21:30:06","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/19/73146105-0-image-m-207_1689187798466.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Test, Day 1: R Ashwin Registers Five-Wicket Haul As India Dominate WI","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-1st-test-day-1-ravichandran-ashwin-registers-five-wicket-haul-as-india-dominate-west-indies-4202371","keywords":null,"creator":null,"video_url":null,"description":"Nursing a bruised ego after WTC final snub last month, Ravichandran Ashwin made the best possible comeback as his 33rd five-wicket haul put India in the driver's seat against a below-par West Indies on the first day of the opening Test.","content":"Nursing a bruised ego after WTC final snub last month, Ravichandran Ashwin made the best possible comeback as his 33rd five-wicket haul put India in the driver's seat against a below-par West Indies on the first day of the opening Test, in Dominica on Wednesday. Ashwin justified his top billing in ICC Test bowlers' ranking with figures of 5 for 60 in 24.3 overs to decimate West Indies for a lowly 150 in 64.3 overs with Ravindra Jadeja (3/26 in 14 overs) beautifully complementing him to make life miserable for the home team batters. With more than an hour available for batting skipper Rohit Sharma (30 batting, 65 balls) and debutant Yashasvi Jaiswal (40 batting, 73 balls) added 80 runs for the opening stand to bring down first innings deficit to 70 going into second day. The new pair looked comfortable as there is not much help for the bowlers with Indian skipper hitting his customary 'Nataraja' pull-shot and soothing straight drive. Jaiswal also hardly showed any signs of nerves as he played close to his body for better part of evening. But the opening day's honours went to Ashwin, whose un-matchable artistry was too much to handle for an under-cooked batting line-up. Making full use of the slow two-paced track that also offered turn and bounce, Ashwin had reasons to be chuffed as he became third Indian bowler after Anil Kumble (956 wickets) and Harbhajan Singh (711) to complete 700 scalps across formats in international cricket. He also achieved the distinction of being first Indian bowler to dismiss father and son when he got rid of Shivnarine Chanderpaul 's son Tagenarine, having dismissed the father on his Test debut in 2011. Save debutant left-hander Alick Athanaze (47 off 99), who batted responsibly till his dismissal, none of the Caribbean batters had the technique to survive on a slow turner as none of them could even cross 20-run mark. Ashwin varied his pace, bowling a few sliders and pushing some other deliveries across to right handers while effectively using the drift to bowl conventional off-breaks to left-handers. The tireless Mohammed Siraj (12-2-25-1) also deserves a lot of credit as he bowled a beautiful fuller length during first session, changed his tactic to use a lot more bouncers post-lunch to hurry the batters on a slow track. One such delivery accounted for Jason Holder , who took the bait and was holed out at square leg boundary for the fielder stationed for that mistimed pull-shot. Advertisement Siraj was also brilliant on the field as his diving catch at mid-off to dismiss Jermaine Blackwood off Jadeja's bowling was top notch effort. The decision to bat on a track that offered turn and bounce on very first day, backfired for Caribbean batters, most of whom lacked requisite patience to deal with it. Shardul Thakur (7-3-15-1), operating as the third seamer in overseas conditions for the first time, continued with his happy knack of picking wickets with Jaydev Unadkat (7-2-17-0) also doing his job commendably. Opting to bat first, West Indies openers Chanderpaul (12, 44 balls) and skipper Kraigg Brathwaite (20 off 46 balls) went into a shell during the first hour as both Siraj and Unadkat beating the outside edge of both batters on multiple occasions. The pressure created by the pace duo did reap dividends as Ashwin slowed the pace of his deliveries, used the available drift to a good advantage to make life uncomfortable for the two openers. There was a nice loop and he did challenge both inside and outside edge during the second hour. Tagenarine's stance and trigger shuffle from leg to off-stump does have an uncanny resemblance with his illustrious father Shivnarine although he is slightly more side-on compared to his 'Old Man'. Sensing his shuffle, Ashwin got one to hang in the air and drift into the southpaw, who played inside the line only to find it beat his outside edge after pitching and there was a death rattle. West Indies skipper Brathwaite, easily the best Test batter in the side over the last five years, was increasingly getting frustrated as Ashwin bowled slightly quicker at times to him. He did try to hit out of trouble with a slog swept boundary but the canny operator fired one across the line, inducing Brathwaite to go for a mindless bottom-handed slog over mid-on. However the mistimed slog only became easiest skiers for skipper Rohit Sharma stationed at cover. Left-handed Raymon Reifer (2 off 18 balls) never looked in control as Siraj softened him up with some short balls. So when Thakur, who is a notch slower came into the attack, he wanted to come on front-foot and get his cover drive going. Thakur quickly slipped one across the stumps and the thick outside edge was snapped by a diving Ishant Kishan behind the stumps. In the post lunch session, Athanaze, who looked most comfortable against Ashwin did hit some lusty blows but was done in by slowness of the track as he couldn't time a short ball and the skier was gobbled up by Thakur. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-07-12 21:26:10","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test Day 1 Stumps: पहले दिन का खेल हुआ खत्म, सलामी बल्लेबाज रोहित शर्मा और यशस्वी जयसवाल ने पारी को संभाला; टीम इंडिया का स्कोर 80/0","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-the-first-days-play-is-over-openers-rohit-sharma-and-yashasvi-jaiswal-handled-the-innings-team-indias-score-800-1862718.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. पहले दिन का खेल खत्म हो गया हैं. पहले दिन का खेल ख़त्म होने तक टीम इंडिया ने 23 ओवर में बिना विकेट गवाएं 80 रन बना लिए हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. पहले दिन का खेल खत्म हो गया हैं. पहले दिन का खेल ख़त्म होने तक टीम इंडिया ने 23 ओवर में बिना विकेट गवाएं 80 रन बना लिए हैं. कप्तान रोहित शर्मा 30 और यशस्वी जयसवाल 40 रन बनाकर खेल रहे हैं. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. Stumps on Day 1. Domination by India in Dominica with Ashwin & Jadeja are the bowling stars and fantastic batting by Jaiswal 40* & Rohit 30*. India 80 for 0, trailing by 70 runs in the first innings. pic.twitter.com/ynYMRTK5jf — Johns. (@CricCrazyJohns) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 21:18:57","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st Test Day 1 Live Score Update: बारिश की वजह से खेल रुका, टीम इंडिया का स्कोर 66/0","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-game-stopped-due-to-rain-team-india-score-660-1862713.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं. पिछली बार साल 2011 में इस मैदान पर मुकाबला ड्रॉ छूटा था. टीम इंडिया यहां अब तक एक ही मैच खेल पाई है. यह टीम इंडिया का दूसरा टेस्ट हैं. इस बीच वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. पहली पारी में बल्लेबाजी करने उतरी टीम इंडिया के लिए यशस्वी और रोहित ने अर्धशतकीय साझेदारी पूरी की. टीम इंडिया ने 15.5 ओवरों में 66 रन बनाए. रोहित शर्मा 28 रन और यशस्वी जायसवाल 28 रन बनाकर खेल रहे हैं. इन दोनों ने 95 गेंदों में 66 रन बनाए हैं. इस बीच बारिश की वजह से खेल को रोक दिया गया हैं. Rain stopped play. India 66 for 0 with Rohit 28* & Jaiswal 28* in the middle - fantastic batting by the openers. pic.twitter.com/xkPH5bJ1NW — Johns. (@CricCrazyJohns) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 20:47:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st Test Day 1 Live Score Update: रोहित शर्मा और यशस्वी जयसवाल ने पूरी की अर्धशतकीय साझेदारी, टीम इंडिया का स्कोर 50 रनों के पार","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-rohit-sharma-and-yashasvi-jaiswal-completed-half-century-partnership-team-indias-score-crossed-50-runs-1862709.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं. पिछली बार साल 2011 में इस मैदान पर मुकाबला ड्रॉ छूटा था. टीम इंडिया यहां अब तक एक ही मैच खेल पाई है. यह टीम इंडिया का दूसरा टेस्ट हैं. इस बीच वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. पहली पारी में बल्लेबाजी करने उतरी टीम इंडिया के लिए यशस्वी और रोहित ने अर्धशतकीय साझेदारी पूरी की. टीम इंडिया ने 13 ओवरों में 54 रन बनाए. रोहित 26 रन और यशस्वी 18 रन बनाकर खेल रहे हैं. इन दोनों ने 78 गेंदों में 54 रन बनाए हैं. 5⃣0⃣-run stand! 🤝 #TeamIndia off to a solid start, courtesy Captain @ImRo45 & debutant @ybj_19 🙌 Follow the match ▶️ https://t.co/FWI05P4Bnd #WIvIND pic.twitter.com/ys9kkbWh93 — BCCI (@BCCI) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 20:40:50","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Alice Capsey says England can play even better after levelling Ashes series","link":"https://www.independent.co.uk/sport/cricket/kate-cross-alice-capsey-australia-heather-knight-ashes-b2374254.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"The tourists led 6-0 after winning the solitary Test and the opening T20 game.","content":"Alice Capsey warned Australia that England are yet to play their best cricket despite levelling the Women’s Ashes by winning the opening ODI at Bristol. England secured a nerve-shredding two-wicket win to wipe out the 6-0 deficit suffered after losing the series’ solitary Test and the opening T20 clash. Australia need to win only one of the two remaining ODIs at Southampton and Taunton to retain the Ashes but they have now lost three consecutive games for the first time since 2017. “We were 6-0 down but we took a lot of confidence from the Test match because we saw how close we were to winning that,” said number three batter Capsey, 18, who struck 40 from 34 balls in England’s victorious reply of 267 for eight. “We had another narrow loss in the opening T20 at Edgbaston, but we were pretty confident that once we got that first win we would go on a streak. “The whole series we haven’t been at our best. In the T20s we were playing at 80 per cent and we weren’t at our best again here. “But to get over the line in pressure moments when previously we would have crumbled a little bit is great. We were so calm out there, which is something we have focused on. “It’s really exciting we haven’t played our best cricket and it’s six-all.” The power hitting of Capsey and Tammy Beaumont was in danger of going to waste after England had reached 103 for one in the 12th over, chasing 264 to win. Wickets fell at regular intervals and it was left to skipper Heather Knight and Kate Cross , coming in at 10, to get England over the line. Cross joined Knight in the 44th over, with their partnership of 32 proving pivotal as England triumphed with 11 balls to spare. Knight made 75 from 86 balls while Cross’ cameo of 19 from 20 deliveries included an audacious ramp shot over the head of Australia’s wicketkeeping captain Alyssa Healey. Capsey said: “Crossy batted brilliantly – she can bat at three! She came in and played to her strengths. “We saw her bravery whether it was the ramp or hitting Jonno (Jess Jonassen) down the ground. It was unbelievable to watch. “She loves the ramp and probably plays it the best out of the whole group. If you don’t see a Kate Cross ramp you might be asking her: ‘Are you OK?'” Looking ahead to the Ashes’ climax, Capsey added: “We’ve shown a lot of fight in this series that previously we might not have. “Australia are the most successful cricket team and we knew it was going to be a real challenge. “We were the underdogs coming into the series but we have put the pressure on the Aussies. They are still a quality side and we go again at the Ageas (in Southampton).” Australia benefited from the hosts spilling four catches while wicketkeeper Amy Jones missed out on a stumping from a legside wide. “It would have been really nice to snatch that one at the end when they were under the pump and eight down,” said Australia batter Beth Mooney, who top scored for the tourists with an unbeaten 81. “We certainly haven’t put out best foot forward at this point and we know we’ve got to give a lot more when it comes to executing our skills. “I don’t think we’re that far off. Unfortunately we didn’t capitalise on the opportunities to put pressure on England. “We’ve let ourselves down in the last couple of games, but there’s no complacency.”","pubDate":"2023-07-12 20:36:25","image_url":"https://static.independent.co.uk/2023/07/12/21/81a84f50064954b7279d0cc0a2abf395Y29udGVudHNlYXJjaGFwaSwxNjg5MjgwMDYx-2.72976797.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"INSIDE COUNTY CRICKET: Daniel Bell-Drummond on making history","link":"https://www.dailymail.co.uk/sport/cricket/article-12293185/INSIDE-COUNTY-CRICKET-Daniel-Bell-Drummond-making-history.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE INTERVIEW BY HENRY CLARK: Bell-Drummond ground the toiling Northamptonshire attack into the dirt not with explosive hitting but with good, old-fashioned batting.","content":"900 runs, nine hours... and two pints of Guinness! Kent batsman Daniel Bell-Drummond on making history, with a little help from their No 11 Bell-Drummond became the fourth Kent man to hit 300 in a fortnight ago The milestone was at risk when Arshdeep Singh started to attack the bowlers He had watched his friend Sean Dickson hit 300 and wanted to do the same By Henry Clark For Mailonline Updated: 18:19 EDT, 12 July 2023 e-mail View comments Imagine being within touching distance of a triple century but stranded at the non-striker’s end, relying on your team’s No 11 to see out the over and get you back on strike. Terrifying, right? That’s the predicament Daniel Bell-Drummond found himself in against Northamptonshire in the County Championship two weeks ago. In nearly nine hours at the crease, the immovable Kent No 3 compiled a historic innings of the highest order. Bell-Drummond ground the toiling Northamptonshire attack into the dirt not with explosive hitting but with good, old-fashioned batting — namely a solid defence and clever strike rotation. The fact only 110 of his 300 runs were scored in boundaries tells you everything. In a stand of 318 for the second wicket with Tawanda Muyeye, who made 179, he skipped to a century and then breezed to a double ton. By the time Bell-Drummond had made 290, Kent were six wickets down. But three quick dismissals early on day three brought their final batsman, Arshdeep Singh, to the crease with Bell-Drummond on 293. Daniel Bell-Drummond became the fourth Kent man to hit 300 in an innings against Northamptonshire The milestone was in doubt when Arshdeep Singh arrived at the crease and started to attack The two players high-fived as they passed on Bell-Drummond's way to his 300 in the game While Singh is a tidy left-arm fast bowler, a batter he is not. The Indian averages 14 in First-Class cricket and plays in a manner which makes Bazball seem conservative. ‘There were a few things going through my head,’ Bell-Drummond tells Mail Sport of the moment Singh came out to the middle and started swinging for the hills. ‘I was obviously thinking, “What is he doing?” but I was so shattered that I wasn’t really concentrating on him. I did tell him, “Stick with me here”. But of course he was just going to do his own thing. ‘It was nerve-wracking when he tried to start hitting sixes. I’m glad he stayed there because he got out the next ball after I went to 300! It was very funny.’ With a simple jab into the leg side, Bell-Drummond reached his triple hundred, becoming only the fourth Kent player to achieve the milestone. The club’s history books are a fitting place for the 29-year-old who is Kent through-and-through, having joined the club’s academy aged six. Bell-Drummond went into the match on the back of a century against Middlesex in the T20 Blast He is now injured, and frustrated not to be able to cash in on his positive form against Warwickshire this week While he has long been one of the premier white-ball openers on the county circuit, Bell-Drummond had experienced an indifferent start to 2023 in the County Championship. But just two days on from making 111 from 58 deliveries against Middlesex in the Vitality Blast at Canterbury, Bell-Drummond was recalled to the side and back in his whites at the County Ground. ‘I wanted to make a statement having been dropped,’ he admits. ‘I wouldn’t say I was feeling like I never have done before at the crease. But once I got in, I said, “Whatever happens, they’re going to have to get me out, I’m not going to give it away”.’ Bell-Drummond jokes the toughest part of his innings was being on 271 not out overnight and dealing with noise from off the pitch ahead of his final push. He says: ‘Everyone was messaging saying, “I’m going to be watching tomorrow when you get your 300”, and I’m thinking, “Nothing is guaranteed here!”’ Among the names he joined in the county’s exclusive 300 club was former team-mate and good friend Sean Dickson. Bell-Drummond had the best seat in the house for Dickson’s record-breaking innings when he smashed 318, also against Northants, at Beckenham in 2017. Bell-Drummond's friend and former team-mate Sean Dickson, now of Somersert, rang him to congratulate him ‘I opened the batting with him and got 49… I thought I did quite well!’ he jokes. ‘But Joe Denly got 182 and Sean got 318. I remember watching from the balcony at Beckenham when he got the triple. I couldn’t have been prouder and I thought, “Damn, I want to do that one day”. ‘We’ve been through a lot of tough times facing the new ball, sometimes on tricky wickets, and I’m glad I can be in the record books with him after spending so much time at the crease with him. He rang me straight afterwards.’ You’d think celebrations would be in order after an innings of that magnitude, especially as it helped Kent to an emphatic victory. But the relentless nature of the domestic schedule meant that festivities were low-key. Bell-Drummond reveals that he enjoyed a couple of Guinnesses in the hotel bar after his achievement ‘I just had a couple of Guinnesses in the hotel bar,’ Bell-Drummond reveals. ‘Everyone was so tired. I was just trying to reply to messages most of the evening. Then we had to go back out for day four and field again.’ A hamstring strain kept Bell-Drummond out of Kent’s match with Warwickshire this week and while he was frustrated not to be able to cash in on his rich vein of form, it has given him time to reflect on his innings of a lifetime. ‘Sometimes you don’t realise the gravity of things,’ he says. ‘The love I was shown and the messages I received from family and friends meant so much. ‘It was a fairytale… 300 on the dot. It was a day I will never, ever forget.’ Share or comment on this article: INSIDE COUNTY CRICKET: Daniel Bell-Drummond on making history e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 22:19:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/22/73151881-0-image-m-20_1689197805294.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Williams misses out on Player of the Month award","link":"https://www.chronicle.co.zw/williams-misses-out-on-player-of-the-month-award/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com CHEVRONS star all-rounder, Sean Williams missed out on making history and becoming the second Zimbabwean to win the prestigious International Cricket Council (ICC) Player of the Month award. Williams was nominated for the Player of the Month for June but lost to record breaking Sri Lankan spinner, Wanindu Hasaranga. The other player […]","content":"The Chronicle CHEVRONS star all-rounder, Sean Williams missed out on making history and becoming the second Zimbabwean to win the prestigious International Cricket Council (ICC) Player of the Month award. Williams was nominated for the Player of the Month for June but lost to record breaking Sri Lankan spinner, Wanindu Hasaranga. The other player nominated together with Williams and Hasaranga was Australian batter, Travis Head. Williams’ nomination came after the 36-year-old has been enjoying a purple patch during the recently ended 2023 Men’s Cricket World Cup Qualifiers which took place in Zimbabwe. He was a shining light for Zimbabwe and from the seven innings in the Qualifiers, he has scored a massive 600 runs at an average of 100 per match. However, in the month of June when he played five matches, Williams scored 532 runs at an average of 133, coming from three centuries against Nepal, the United States of America (USA) and Oman, and came at a staggering strike rate of 148.60. He scored 91 more runs in the Chevrons’ win over the Netherlands. His June tally became the third-most runs scored in five consecutive ODI innings, with Indian great, Kohli and Pakistan stalwart, Babar Azam making the top two. Hasaranga became the first spinner in history to take three consecutive five-wicket hauls in ODI cricket, setting Sri Lanka on course for qualification to the ICC Men’s Cricket World Cup in India which starts on 5 October. The voting was conducted among a specialist panel comprising ICC Hall of Famers, former international players, media representatives and global cricket fans registered at icc-cricket.com. – @brandon_malvin","pubDate":"2023-07-12 22:03:29","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"COURT REPORT: Svitolina's route to the semis was as hard as it gets","link":"https://www.dailymail.co.uk/sport/tennis/article-12292829/COURT-REPORT-Svitolinas-route-semis-hard-gets.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MATTHEW LAMBERT AT WIMBLEDON: ELINA Svitolina's route to the semi-finals has been as tough as they come. Four of her five opponents have been former Grand Slam champions.","content":"COURT REPORT: Elina Svitolina's route to the semis was as hard as it gets and Jannik Sinner gets little practice ahead of Novak Djokovic tie... while the players with the most winners and unforced errors are revealed The semi-finals are set in singles competition and will commence on Thursday Elina Svitolina will face Marketa Vondrousova ahead of a potential final Carlos Alcaraz has produced the most unforced errors and double faults so far Latest Wimbledon 2023 news, including schedule, travel updates and results By Matthew Lambert for the Daily Mail Updated: 22:45, 12 July 2023 e-mail View comments The semi-finals of Wimbledon are on the horizon with Thursday to play host to the women's singles on Centre Court. The men's doubles will also continue on Thursday, while the women's doubles and men's singles will have to wait until Friday. Wednesday saw Carlos Alcaraz and Daniil Medvedev progress , while the competition moved one step closer to players from Ukraine and Belarus facing off in the women's singles following a victory for Aryna Sabalenka . The day saw plenty more action, too, with England cricket captain Ben Stokes throwing down a few serves, the crowd finding Kader Nouni's confusion amusing and a focus on Jannik Sinner's draw. Here is Mail Sport's Court Report from Wimbledon by Matthew Lambert. Elina Svitolina's route to the semi-finals of Wimbledon has been as tough as they come Jannik Sinner meanwhile, has had a favourable draw - though faces Novak Djokovic next Elina has it tough Elina Svitolina’s route to Thursday's semi-finals has been as tough as they come. Four of her five opponents have been former Grand Slam champions: Venus Williams, Sofia Kenin, Victoria Azarenka and Iga Swiatek. Jannik on easy street Jannik Sinner, meanwhile, has had a saintly draw. These are the ranks of the players he has taken out en route to the last four: 111, 98, 79, 85, 92. You can only beat what’s in front of you but it’s not ideal preparation for facing Novak Djokovic. Fans in fits over Nouni confusion Umpire Kader Nouni’s rich caramel purr is the best voice in tennis. But the Centre Court crowd picked an unfortunate time to suddenly find it hilarious — the Frenchman having got muddled with the set score in the Jabeur-Rybakina clash. Umpire Kader Nouni left fans giggling when he got muddled with the set score during Wednesday's Jabeur-Rybakina clash New bowls please! England Test captain Ben Stokes was at Wimbledon on Wednesday and he sent down a couple of serves in the Vodafone speed gun booth. Mail Sport can reveal that his two efforts were clocked at 86 and 92mph! Aces are high for super Sabalenka Now the semi-finals are set, here’s a look at who is leading the various tallies in the singles events: WHO LEADS THE WAY? Men Women Aces: Sinner, Medvedev 57 Double faults: Alcaraz 20 Break points saved: Alcaraz 81 per cent Winners: Djokovic 209 Unforced errors: Alcaraz 121 Aces: Sabalenka 35 Double faults: Sabalenka 18 Break points saved: Jabeur Winners: Svitolina 132 Unforced errors: Svitolina 127 Share or comment on this article: COURT REPORT: Svitolina's route to the semis was as hard as it gets e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 21:45:34","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/22/73149341-0-image-m-60_1689195853099.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 1st Test 2023: Ravi Ashwin’s Five-Wicket Haul Headlines Dominant Day 1 for India in Dominica","link":"https://www.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-2023-ravi-ashwins-five-wicket-haul-headlines-dominant-day-1-for-india-in-dominica-5261678.html","keywords":null,"creator":null,"video_url":null,"description":"At stumps on Day 1, India were 80/0 in 23 overs, trailing West Indies by just 70 runs. Captain Rohit Sharma scored 30 runs while Yashasvi Jaiswal added 40 on his debut.","content":"Ravichandran Ashwin returned to the Indian team in style, taking a five-wicket haul and absolutely demolishing West Indies on Day 1 of the first Test in Dominica on Wednesday, July 12. The ace off-spinner, who was left out of the Indian playing XI that lost the WTC final in June, made a statement as he not only became the third Indian bowler to get to 700 international wickets but also starred with a five-wicket haul that knocked the breath out of the West Indies batting line-up. Ravindra Jadeja (3/26) too, had a good day with three wickets, with Mohammed Siraj (1/25) and Shardul Thakur (1/15) scalping one apiece. West Indies, bowled out for just 150, needed a big performance from their bowlers first up, but that did not happen with Indian captain Rohit Sharma and Yashasvi Jaiswal remaining unbeaten. Ravi Ashwin Becomes Third Indian Bowler To Take 700 Wickets in International Cricket, Achieves Feat by Dismissing Alzarri Joseph in IND vs WI 1st Test 2023. Ravichandran Ashwin Headlines India's Dominance on Day 1 Stumps day 1, India trail by 70 runs #WIvIND #RallywithWI pic.twitter.com/DsFdsZzr8J — Windies Cricket (@windiescricket) July 12, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-12 21:35:40","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right","link":"https://www.dailymail.co.uk/sport/cricket/article-12292645/PAUL-NIXON-Jonny-Bairstows-mistakes-stop-footwork-right.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"PAUL NIXON: The whole world has been watching when Bairstow has made mistakes and I have felt for him. But he has done some really good things with the gloves, too.","content":"PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right... he has done some really good things with the gloves despite the errors Jonny Bairstow can perform with more consistency if he improves his footwork Despite the mistakes that he has made, Bairstow has done some good things Bairstow was out for a long time with injury and needs to build up momentum By Paul Nixon For The Daily Mail Updated: 22:30 BST, 12 July 2023 e-mail View comments Jonny Bairstow has faced a real test of his character in this Ashes. To keep wicket for England when you don’t do it day in, day out is a tough job and when the ball is thundering through at 95mph, as it was from Mark Wood at Headingley, it’s particularly challenging. The whole world has been watching when Bairstow has made mistakes and I have felt for him. But he has done some really good things with the gloves, too. We have to remember Jonny was out for a long time with injury and it seems he has not had enough repetitions of those power positions — when you are crouched down and ready to spring up — movement and foot positioning. This England attack provide different challenges for a keeper. Chris Woakes swings it away but also has his wobble seam ball that nips back with an over-the-top action. Stuart Broad goes a bit wider and that can drag the keeper’s weight inside, down leg side, so you have to be really strong and keep your head on the outside edge. If Jonny Bairstow can get his footwork right then he will be able to cut out the errors And for Wood’s extra pace it’s easy to make the mistake of standing a bit taller because you’re deeper. You have to challenge yourself to stay in that power position longer. There has been an excessive amount of seam movement and swing after the ball has gone past the bat during this series and with the wobble seam delivery, shaping it back in off the seam, your foot movement has to be particularly good. We all think of Bairstow as this strong, dominant batsman in the perfect mould for the terrific way England are playing but you can take confidence into your batting from your keeping and there are signs that Jonny is low on that confidence. After Ollie Pope got injured in the second Test I would have brought Ben Foakes back But what is pleasing as a coach is that he’s never actually looked out of nick with the bat and he’s been a bit unlucky with a couple of drag-ons. His balance has remained good and he’s not falling over so the alarm bells are not ringing yet for me. After Ollie Pope got injured in the second Test at Lord’s, I would have moved Jonny up to No 3 and brought Ben Foakes back but I can fully understand why England went the way they did. They have to take 20 wickets and Moeen Ali is one of the biggest spinners of the ball we’ve got. Keepers get their rhythm from the bowlers and understanding their mindsets. Once they are in that rhythm, they will make fewer and fewer mistakes. I’ve no doubt that will be the case with Jonny in the last two Tests as long as his confidence hasn’t been too badly hit. Once Bairstow manages to get into his rhythm he will make fewer and fewer mistakes Share or comment on this article: PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 21:30:06","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/19/73146105-0-image-m-207_1689187798466.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Test, Day 1: R Ashwin Registers Five-Wicket Haul As India Dominate WI","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-1st-test-day-1-ravichandran-ashwin-registers-five-wicket-haul-as-india-dominate-west-indies-4202371","keywords":null,"creator":null,"video_url":null,"description":"Nursing a bruised ego after WTC final snub last month, Ravichandran Ashwin made the best possible comeback as his 33rd five-wicket haul put India in the driver's seat against a below-par West Indies on the first day of the opening Test.","content":"Nursing a bruised ego after WTC final snub last month, Ravichandran Ashwin made the best possible comeback as his 33rd five-wicket haul put India in the driver's seat against a below-par West Indies on the first day of the opening Test, in Dominica on Wednesday. Ashwin justified his top billing in ICC Test bowlers' ranking with figures of 5 for 60 in 24.3 overs to decimate West Indies for a lowly 150 in 64.3 overs with Ravindra Jadeja (3/26 in 14 overs) beautifully complementing him to make life miserable for the home team batters. With more than an hour available for batting skipper Rohit Sharma (30 batting, 65 balls) and debutant Yashasvi Jaiswal (40 batting, 73 balls) added 80 runs for the opening stand to bring down first innings deficit to 70 going into second day. The new pair looked comfortable as there is not much help for the bowlers with Indian skipper hitting his customary 'Nataraja' pull-shot and soothing straight drive. Jaiswal also hardly showed any signs of nerves as he played close to his body for better part of evening. But the opening day's honours went to Ashwin, whose un-matchable artistry was too much to handle for an under-cooked batting line-up. Making full use of the slow two-paced track that also offered turn and bounce, Ashwin had reasons to be chuffed as he became third Indian bowler after Anil Kumble (956 wickets) and Harbhajan Singh (711) to complete 700 scalps across formats in international cricket. He also achieved the distinction of being first Indian bowler to dismiss father and son when he got rid of Shivnarine Chanderpaul 's son Tagenarine, having dismissed the father on his Test debut in 2011. Save debutant left-hander Alick Athanaze (47 off 99), who batted responsibly till his dismissal, none of the Caribbean batters had the technique to survive on a slow turner as none of them could even cross 20-run mark. Ashwin varied his pace, bowling a few sliders and pushing some other deliveries across to right handers while effectively using the drift to bowl conventional off-breaks to left-handers. The tireless Mohammed Siraj (12-2-25-1) also deserves a lot of credit as he bowled a beautiful fuller length during first session, changed his tactic to use a lot more bouncers post-lunch to hurry the batters on a slow track. One such delivery accounted for Jason Holder , who took the bait and was holed out at square leg boundary for the fielder stationed for that mistimed pull-shot. Advertisement Siraj was also brilliant on the field as his diving catch at mid-off to dismiss Jermaine Blackwood off Jadeja's bowling was top notch effort. The decision to bat on a track that offered turn and bounce on very first day, backfired for Caribbean batters, most of whom lacked requisite patience to deal with it. Shardul Thakur (7-3-15-1), operating as the third seamer in overseas conditions for the first time, continued with his happy knack of picking wickets with Jaydev Unadkat (7-2-17-0) also doing his job commendably. Opting to bat first, West Indies openers Chanderpaul (12, 44 balls) and skipper Kraigg Brathwaite (20 off 46 balls) went into a shell during the first hour as both Siraj and Unadkat beating the outside edge of both batters on multiple occasions. The pressure created by the pace duo did reap dividends as Ashwin slowed the pace of his deliveries, used the available drift to a good advantage to make life uncomfortable for the two openers. There was a nice loop and he did challenge both inside and outside edge during the second hour. Tagenarine's stance and trigger shuffle from leg to off-stump does have an uncanny resemblance with his illustrious father Shivnarine although he is slightly more side-on compared to his 'Old Man'. Sensing his shuffle, Ashwin got one to hang in the air and drift into the southpaw, who played inside the line only to find it beat his outside edge after pitching and there was a death rattle. West Indies skipper Brathwaite, easily the best Test batter in the side over the last five years, was increasingly getting frustrated as Ashwin bowled slightly quicker at times to him. He did try to hit out of trouble with a slog swept boundary but the canny operator fired one across the line, inducing Brathwaite to go for a mindless bottom-handed slog over mid-on. However the mistimed slog only became easiest skiers for skipper Rohit Sharma stationed at cover. Left-handed Raymon Reifer (2 off 18 balls) never looked in control as Siraj softened him up with some short balls. So when Thakur, who is a notch slower came into the attack, he wanted to come on front-foot and get his cover drive going. Thakur quickly slipped one across the stumps and the thick outside edge was snapped by a diving Ishant Kishan behind the stumps. In the post lunch session, Athanaze, who looked most comfortable against Ashwin did hit some lusty blows but was done in by slowness of the track as he couldn't time a short ball and the skier was gobbled up by Thakur. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-07-12 21:26:10","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test Day 1 Stumps: पहले दिन का खेल हुआ खत्म, सलामी बल्लेबाज रोहित शर्मा और यशस्वी जयसवाल ने पारी को संभाला; टीम इंडिया का स्कोर 80/0","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-the-first-days-play-is-over-openers-rohit-sharma-and-yashasvi-jaiswal-handled-the-innings-team-indias-score-800-1862718.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. पहले दिन का खेल खत्म हो गया हैं. पहले दिन का खेल ख़त्म होने तक टीम इंडिया ने 23 ओवर में बिना विकेट गवाएं 80 रन बना लिए हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. पहले दिन का खेल खत्म हो गया हैं. पहले दिन का खेल ख़त्म होने तक टीम इंडिया ने 23 ओवर में बिना विकेट गवाएं 80 रन बना लिए हैं. कप्तान रोहित शर्मा 30 और यशस्वी जयसवाल 40 रन बनाकर खेल रहे हैं. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. Stumps on Day 1. Domination by India in Dominica with Ashwin & Jadeja are the bowling stars and fantastic batting by Jaiswal 40* & Rohit 30*. India 80 for 0, trailing by 70 runs in the first innings. pic.twitter.com/ynYMRTK5jf — Johns. (@CricCrazyJohns) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 21:18:57","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st Test Day 1 Live Score Update: बारिश की वजह से खेल रुका, टीम इंडिया का स्कोर 66/0","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-game-stopped-due-to-rain-team-india-score-660-1862713.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं. पिछली बार साल 2011 में इस मैदान पर मुकाबला ड्रॉ छूटा था. टीम इंडिया यहां अब तक एक ही मैच खेल पाई है. यह टीम इंडिया का दूसरा टेस्ट हैं. इस बीच वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. पहली पारी में बल्लेबाजी करने उतरी टीम इंडिया के लिए यशस्वी और रोहित ने अर्धशतकीय साझेदारी पूरी की. टीम इंडिया ने 15.5 ओवरों में 66 रन बनाए. रोहित शर्मा 28 रन और यशस्वी जायसवाल 28 रन बनाकर खेल रहे हैं. इन दोनों ने 95 गेंदों में 66 रन बनाए हैं. इस बीच बारिश की वजह से खेल को रोक दिया गया हैं. Rain stopped play. India 66 for 0 with Rohit 28* & Jaiswal 28* in the middle - fantastic batting by the openers. pic.twitter.com/xkPH5bJ1NW — Johns. (@CricCrazyJohns) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 20:47:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st Test Day 1 Live Score Update: रोहित शर्मा और यशस्वी जयसवाल ने पूरी की अर्धशतकीय साझेदारी, टीम इंडिया का स्कोर 50 रनों के पार","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-rohit-sharma-and-yashasvi-jaiswal-completed-half-century-partnership-team-indias-score-crossed-50-runs-1862709.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं. पिछली बार साल 2011 में इस मैदान पर मुकाबला ड्रॉ छूटा था. टीम इंडिया यहां अब तक एक ही मैच खेल पाई है. यह टीम इंडिया का दूसरा टेस्ट हैं. इस बीच वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. पहली पारी में बल्लेबाजी करने उतरी टीम इंडिया के लिए यशस्वी और रोहित ने अर्धशतकीय साझेदारी पूरी की. टीम इंडिया ने 13 ओवरों में 54 रन बनाए. रोहित 26 रन और यशस्वी 18 रन बनाकर खेल रहे हैं. इन दोनों ने 78 गेंदों में 54 रन बनाए हैं. 5⃣0⃣-run stand! 🤝 #TeamIndia off to a solid start, courtesy Captain @ImRo45 & debutant @ybj_19 🙌 Follow the match ▶️ https://t.co/FWI05P4Bnd #WIvIND pic.twitter.com/ys9kkbWh93 — BCCI (@BCCI) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 20:40:50","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Alice Capsey says England can play even better after levelling Ashes series","link":"https://www.independent.co.uk/sport/cricket/kate-cross-alice-capsey-australia-heather-knight-ashes-b2374254.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"The tourists led 6-0 after winning the solitary Test and the opening T20 game.","content":"Alice Capsey warned Australia that England are yet to play their best cricket despite levelling the Women’s Ashes by winning the opening ODI at Bristol. England secured a nerve-shredding two-wicket win to wipe out the 6-0 deficit suffered after losing the series’ solitary Test and the opening T20 clash. Australia need to win only one of the two remaining ODIs at Southampton and Taunton to retain the Ashes but they have now lost three consecutive games for the first time since 2017. “We were 6-0 down but we took a lot of confidence from the Test match because we saw how close we were to winning that,” said number three batter Capsey, 18, who struck 40 from 34 balls in England’s victorious reply of 267 for eight. “We had another narrow loss in the opening T20 at Edgbaston, but we were pretty confident that once we got that first win we would go on a streak. “The whole series we haven’t been at our best. In the T20s we were playing at 80 per cent and we weren’t at our best again here. “But to get over the line in pressure moments when previously we would have crumbled a little bit is great. We were so calm out there, which is something we have focused on. “It’s really exciting we haven’t played our best cricket and it’s six-all.” The power hitting of Capsey and Tammy Beaumont was in danger of going to waste after England had reached 103 for one in the 12th over, chasing 264 to win. Wickets fell at regular intervals and it was left to skipper Heather Knight and Kate Cross , coming in at 10, to get England over the line. Cross joined Knight in the 44th over, with their partnership of 32 proving pivotal as England triumphed with 11 balls to spare. Knight made 75 from 86 balls while Cross’ cameo of 19 from 20 deliveries included an audacious ramp shot over the head of Australia’s wicketkeeping captain Alyssa Healey. Capsey said: “Crossy batted brilliantly – she can bat at three! She came in and played to her strengths. “We saw her bravery whether it was the ramp or hitting Jonno (Jess Jonassen) down the ground. It was unbelievable to watch. “She loves the ramp and probably plays it the best out of the whole group. If you don’t see a Kate Cross ramp you might be asking her: ‘Are you OK?'” Looking ahead to the Ashes’ climax, Capsey added: “We’ve shown a lot of fight in this series that previously we might not have. “Australia are the most successful cricket team and we knew it was going to be a real challenge. “We were the underdogs coming into the series but we have put the pressure on the Aussies. They are still a quality side and we go again at the Ageas (in Southampton).” Australia benefited from the hosts spilling four catches while wicketkeeper Amy Jones missed out on a stumping from a legside wide. “It would have been really nice to snatch that one at the end when they were under the pump and eight down,” said Australia batter Beth Mooney, who top scored for the tourists with an unbeaten 81. “We certainly haven’t put out best foot forward at this point and we know we’ve got to give a lot more when it comes to executing our skills. “I don’t think we’re that far off. Unfortunately we didn’t capitalise on the opportunities to put pressure on England. “We’ve let ourselves down in the last couple of games, but there’s no complacency.”","pubDate":"2023-07-12 20:36:25","image_url":"https://static.independent.co.uk/2023/07/12/21/81a84f50064954b7279d0cc0a2abf395Y29udGVudHNlYXJjaGFwaSwxNjg5MjgwMDYx-2.72976797.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"INSIDE COUNTY CRICKET: Daniel Bell-Drummond on making history","link":"https://www.dailymail.co.uk/sport/cricket/article-12293185/INSIDE-COUNTY-CRICKET-Daniel-Bell-Drummond-making-history.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"EXCLUSIVE INTERVIEW BY HENRY CLARK: Bell-Drummond ground the toiling Northamptonshire attack into the dirt not with explosive hitting but with good, old-fashioned batting.","content":"900 runs, nine hours... and two pints of Guinness! Kent batsman Daniel Bell-Drummond on making history, with a little help from their No 11 Bell-Drummond became the fourth Kent man to hit 300 in a fortnight ago The milestone was at risk when Arshdeep Singh started to attack the bowlers He had watched his friend Sean Dickson hit 300 and wanted to do the same By Henry Clark For Mailonline Updated: 18:19 EDT, 12 July 2023 e-mail View comments Imagine being within touching distance of a triple century but stranded at the non-striker’s end, relying on your team’s No 11 to see out the over and get you back on strike. Terrifying, right? That’s the predicament Daniel Bell-Drummond found himself in against Northamptonshire in the County Championship two weeks ago. In nearly nine hours at the crease, the immovable Kent No 3 compiled a historic innings of the highest order. Bell-Drummond ground the toiling Northamptonshire attack into the dirt not with explosive hitting but with good, old-fashioned batting — namely a solid defence and clever strike rotation. The fact only 110 of his 300 runs were scored in boundaries tells you everything. In a stand of 318 for the second wicket with Tawanda Muyeye, who made 179, he skipped to a century and then breezed to a double ton. By the time Bell-Drummond had made 290, Kent were six wickets down. But three quick dismissals early on day three brought their final batsman, Arshdeep Singh, to the crease with Bell-Drummond on 293. Daniel Bell-Drummond became the fourth Kent man to hit 300 in an innings against Northamptonshire The milestone was in doubt when Arshdeep Singh arrived at the crease and started to attack The two players high-fived as they passed on Bell-Drummond's way to his 300 in the game While Singh is a tidy left-arm fast bowler, a batter he is not. The Indian averages 14 in First-Class cricket and plays in a manner which makes Bazball seem conservative. ‘There were a few things going through my head,’ Bell-Drummond tells Mail Sport of the moment Singh came out to the middle and started swinging for the hills. ‘I was obviously thinking, “What is he doing?” but I was so shattered that I wasn’t really concentrating on him. I did tell him, “Stick with me here”. But of course he was just going to do his own thing. ‘It was nerve-wracking when he tried to start hitting sixes. I’m glad he stayed there because he got out the next ball after I went to 300! It was very funny.’ With a simple jab into the leg side, Bell-Drummond reached his triple hundred, becoming only the fourth Kent player to achieve the milestone. The club’s history books are a fitting place for the 29-year-old who is Kent through-and-through, having joined the club’s academy aged six. Bell-Drummond went into the match on the back of a century against Middlesex in the T20 Blast He is now injured, and frustrated not to be able to cash in on his positive form against Warwickshire this week While he has long been one of the premier white-ball openers on the county circuit, Bell-Drummond had experienced an indifferent start to 2023 in the County Championship. But just two days on from making 111 from 58 deliveries against Middlesex in the Vitality Blast at Canterbury, Bell-Drummond was recalled to the side and back in his whites at the County Ground. ‘I wanted to make a statement having been dropped,’ he admits. ‘I wouldn’t say I was feeling like I never have done before at the crease. But once I got in, I said, “Whatever happens, they’re going to have to get me out, I’m not going to give it away”.’ Bell-Drummond jokes the toughest part of his innings was being on 271 not out overnight and dealing with noise from off the pitch ahead of his final push. He says: ‘Everyone was messaging saying, “I’m going to be watching tomorrow when you get your 300”, and I’m thinking, “Nothing is guaranteed here!”’ Among the names he joined in the county’s exclusive 300 club was former team-mate and good friend Sean Dickson. Bell-Drummond had the best seat in the house for Dickson’s record-breaking innings when he smashed 318, also against Northants, at Beckenham in 2017. Bell-Drummond's friend and former team-mate Sean Dickson, now of Somersert, rang him to congratulate him ‘I opened the batting with him and got 49… I thought I did quite well!’ he jokes. ‘But Joe Denly got 182 and Sean got 318. I remember watching from the balcony at Beckenham when he got the triple. I couldn’t have been prouder and I thought, “Damn, I want to do that one day”. ‘We’ve been through a lot of tough times facing the new ball, sometimes on tricky wickets, and I’m glad I can be in the record books with him after spending so much time at the crease with him. He rang me straight afterwards.’ You’d think celebrations would be in order after an innings of that magnitude, especially as it helped Kent to an emphatic victory. But the relentless nature of the domestic schedule meant that festivities were low-key. Bell-Drummond reveals that he enjoyed a couple of Guinnesses in the hotel bar after his achievement ‘I just had a couple of Guinnesses in the hotel bar,’ Bell-Drummond reveals. ‘Everyone was so tired. I was just trying to reply to messages most of the evening. Then we had to go back out for day four and field again.’ A hamstring strain kept Bell-Drummond out of Kent’s match with Warwickshire this week and while he was frustrated not to be able to cash in on his rich vein of form, it has given him time to reflect on his innings of a lifetime. ‘Sometimes you don’t realise the gravity of things,’ he says. ‘The love I was shown and the messages I received from family and friends meant so much. ‘It was a fairytale… 300 on the dot. It was a day I will never, ever forget.’ Share or comment on this article: INSIDE COUNTY CRICKET: Daniel Bell-Drummond on making history e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 22:19:58","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/22/73151881-0-image-m-20_1689197805294.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Williams misses out on Player of the Month award","link":"https://www.chronicle.co.zw/williams-misses-out-on-player-of-the-month-award/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Brandonmalvin9@gmail.com CHEVRONS star all-rounder, Sean Williams missed out on making history and becoming the second Zimbabwean to win the prestigious International Cricket Council (ICC) Player of the Month award. Williams was nominated for the Player of the Month for June but lost to record breaking Sri Lankan spinner, Wanindu Hasaranga. The other player […]","content":"The Chronicle CHEVRONS star all-rounder, Sean Williams missed out on making history and becoming the second Zimbabwean to win the prestigious International Cricket Council (ICC) Player of the Month award. Williams was nominated for the Player of the Month for June but lost to record breaking Sri Lankan spinner, Wanindu Hasaranga. The other player nominated together with Williams and Hasaranga was Australian batter, Travis Head. Williams’ nomination came after the 36-year-old has been enjoying a purple patch during the recently ended 2023 Men’s Cricket World Cup Qualifiers which took place in Zimbabwe. He was a shining light for Zimbabwe and from the seven innings in the Qualifiers, he has scored a massive 600 runs at an average of 100 per match. However, in the month of June when he played five matches, Williams scored 532 runs at an average of 133, coming from three centuries against Nepal, the United States of America (USA) and Oman, and came at a staggering strike rate of 148.60. He scored 91 more runs in the Chevrons’ win over the Netherlands. His June tally became the third-most runs scored in five consecutive ODI innings, with Indian great, Kohli and Pakistan stalwart, Babar Azam making the top two. Hasaranga became the first spinner in history to take three consecutive five-wicket hauls in ODI cricket, setting Sri Lanka on course for qualification to the ICC Men’s Cricket World Cup in India which starts on 5 October. The voting was conducted among a specialist panel comprising ICC Hall of Famers, former international players, media representatives and global cricket fans registered at icc-cricket.com. – @brandon_malvin","pubDate":"2023-07-12 22:03:29","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"COURT REPORT: Svitolina's route to the semis was as hard as it gets","link":"https://www.dailymail.co.uk/sport/tennis/article-12292829/COURT-REPORT-Svitolinas-route-semis-hard-gets.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"MATTHEW LAMBERT AT WIMBLEDON: ELINA Svitolina's route to the semi-finals has been as tough as they come. Four of her five opponents have been former Grand Slam champions.","content":"COURT REPORT: Elina Svitolina's route to the semis was as hard as it gets and Jannik Sinner gets little practice ahead of Novak Djokovic tie... while the players with the most winners and unforced errors are revealed The semi-finals are set in singles competition and will commence on Thursday Elina Svitolina will face Marketa Vondrousova ahead of a potential final Carlos Alcaraz has produced the most unforced errors and double faults so far Latest Wimbledon 2023 news, including schedule, travel updates and results By Matthew Lambert for the Daily Mail Updated: 22:45, 12 July 2023 e-mail View comments The semi-finals of Wimbledon are on the horizon with Thursday to play host to the women's singles on Centre Court. The men's doubles will also continue on Thursday, while the women's doubles and men's singles will have to wait until Friday. Wednesday saw Carlos Alcaraz and Daniil Medvedev progress , while the competition moved one step closer to players from Ukraine and Belarus facing off in the women's singles following a victory for Aryna Sabalenka . The day saw plenty more action, too, with England cricket captain Ben Stokes throwing down a few serves, the crowd finding Kader Nouni's confusion amusing and a focus on Jannik Sinner's draw. Here is Mail Sport's Court Report from Wimbledon by Matthew Lambert. Elina Svitolina's route to the semi-finals of Wimbledon has been as tough as they come Jannik Sinner meanwhile, has had a favourable draw - though faces Novak Djokovic next Elina has it tough Elina Svitolina’s route to Thursday's semi-finals has been as tough as they come. Four of her five opponents have been former Grand Slam champions: Venus Williams, Sofia Kenin, Victoria Azarenka and Iga Swiatek. Jannik on easy street Jannik Sinner, meanwhile, has had a saintly draw. These are the ranks of the players he has taken out en route to the last four: 111, 98, 79, 85, 92. You can only beat what’s in front of you but it’s not ideal preparation for facing Novak Djokovic. Fans in fits over Nouni confusion Umpire Kader Nouni’s rich caramel purr is the best voice in tennis. But the Centre Court crowd picked an unfortunate time to suddenly find it hilarious — the Frenchman having got muddled with the set score in the Jabeur-Rybakina clash. Umpire Kader Nouni left fans giggling when he got muddled with the set score during Wednesday's Jabeur-Rybakina clash New bowls please! England Test captain Ben Stokes was at Wimbledon on Wednesday and he sent down a couple of serves in the Vodafone speed gun booth. Mail Sport can reveal that his two efforts were clocked at 86 and 92mph! Aces are high for super Sabalenka Now the semi-finals are set, here’s a look at who is leading the various tallies in the singles events: WHO LEADS THE WAY? Men Women Aces: Sinner, Medvedev 57 Double faults: Alcaraz 20 Break points saved: Alcaraz 81 per cent Winners: Djokovic 209 Unforced errors: Alcaraz 121 Aces: Sabalenka 35 Double faults: Sabalenka 18 Break points saved: Jabeur Winners: Svitolina 132 Unforced errors: Svitolina 127 Share or comment on this article: COURT REPORT: Svitolina's route to the semis was as hard as it gets e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 21:45:34","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/22/73149341-0-image-m-60_1689195853099.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"IND vs WI 1st Test 2023: Ravi Ashwin’s Five-Wicket Haul Headlines Dominant Day 1 for India in Dominica","link":"https://www.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-2023-ravi-ashwins-five-wicket-haul-headlines-dominant-day-1-for-india-in-dominica-5261678.html","keywords":null,"creator":null,"video_url":null,"description":"At stumps on Day 1, India were 80/0 in 23 overs, trailing West Indies by just 70 runs. Captain Rohit Sharma scored 30 runs while Yashasvi Jaiswal added 40 on his debut.","content":"Ravichandran Ashwin returned to the Indian team in style, taking a five-wicket haul and absolutely demolishing West Indies on Day 1 of the first Test in Dominica on Wednesday, July 12. The ace off-spinner, who was left out of the Indian playing XI that lost the WTC final in June, made a statement as he not only became the third Indian bowler to get to 700 international wickets but also starred with a five-wicket haul that knocked the breath out of the West Indies batting line-up. Ravindra Jadeja (3/26) too, had a good day with three wickets, with Mohammed Siraj (1/25) and Shardul Thakur (1/15) scalping one apiece. West Indies, bowled out for just 150, needed a big performance from their bowlers first up, but that did not happen with Indian captain Rohit Sharma and Yashasvi Jaiswal remaining unbeaten. Ravi Ashwin Becomes Third Indian Bowler To Take 700 Wickets in International Cricket, Achieves Feat by Dismissing Alzarri Joseph in IND vs WI 1st Test 2023. Ravichandran Ashwin Headlines India's Dominance on Day 1 Stumps day 1, India trail by 70 runs #WIvIND #RallywithWI pic.twitter.com/DsFdsZzr8J — Windies Cricket (@windiescricket) July 12, 2023 (SocialLY brings you all the latest breaking news, viral trends and information from social media world, including Twitter, Instagram and Youtube. The above post is embeded directly from the user's social media account and LatestLY Staff may not have modified or edited the content body. The views and facts appearing in the social media post do not reflect the opinions of LatestLY, also LatestLY does not assume any responsibility or liability for the same.)","pubDate":"2023-07-12 21:35:40","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"english"},{"title":"PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right","link":"https://www.dailymail.co.uk/sport/cricket/article-12292645/PAUL-NIXON-Jonny-Bairstows-mistakes-stop-footwork-right.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"PAUL NIXON: The whole world has been watching when Bairstow has made mistakes and I have felt for him. But he has done some really good things with the gloves, too.","content":"PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right... he has done some really good things with the gloves despite the errors Jonny Bairstow can perform with more consistency if he improves his footwork Despite the mistakes that he has made, Bairstow has done some good things Bairstow was out for a long time with injury and needs to build up momentum By Paul Nixon For The Daily Mail Updated: 22:30 BST, 12 July 2023 e-mail View comments Jonny Bairstow has faced a real test of his character in this Ashes. To keep wicket for England when you don’t do it day in, day out is a tough job and when the ball is thundering through at 95mph, as it was from Mark Wood at Headingley, it’s particularly challenging. The whole world has been watching when Bairstow has made mistakes and I have felt for him. But he has done some really good things with the gloves, too. We have to remember Jonny was out for a long time with injury and it seems he has not had enough repetitions of those power positions — when you are crouched down and ready to spring up — movement and foot positioning. This England attack provide different challenges for a keeper. Chris Woakes swings it away but also has his wobble seam ball that nips back with an over-the-top action. Stuart Broad goes a bit wider and that can drag the keeper’s weight inside, down leg side, so you have to be really strong and keep your head on the outside edge. If Jonny Bairstow can get his footwork right then he will be able to cut out the errors And for Wood’s extra pace it’s easy to make the mistake of standing a bit taller because you’re deeper. You have to challenge yourself to stay in that power position longer. There has been an excessive amount of seam movement and swing after the ball has gone past the bat during this series and with the wobble seam delivery, shaping it back in off the seam, your foot movement has to be particularly good. We all think of Bairstow as this strong, dominant batsman in the perfect mould for the terrific way England are playing but you can take confidence into your batting from your keeping and there are signs that Jonny is low on that confidence. After Ollie Pope got injured in the second Test I would have brought Ben Foakes back But what is pleasing as a coach is that he’s never actually looked out of nick with the bat and he’s been a bit unlucky with a couple of drag-ons. His balance has remained good and he’s not falling over so the alarm bells are not ringing yet for me. After Ollie Pope got injured in the second Test at Lord’s, I would have moved Jonny up to No 3 and brought Ben Foakes back but I can fully understand why England went the way they did. They have to take 20 wickets and Moeen Ali is one of the biggest spinners of the ball we’ve got. Keepers get their rhythm from the bowlers and understanding their mindsets. Once they are in that rhythm, they will make fewer and fewer mistakes. I’ve no doubt that will be the case with Jonny in the last two Tests as long as his confidence hasn’t been too badly hit. Once Bairstow manages to get into his rhythm he will make fewer and fewer mistakes Share or comment on this article: PAUL NIXON: Jonny Bairstow's mistakes will stop if he can get his footwork right e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-07-12 21:30:06","image_url":"https://i.dailymail.co.uk/1s/2023/07/12/19/73146105-0-image-m-207_1689187798466.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"1st Test, Day 1: R Ashwin Registers Five-Wicket Haul As India Dominate WI","link":"https://sports.ndtv.com/cricket/west-indies-vs-india-1st-test-day-1-ravichandran-ashwin-registers-five-wicket-haul-as-india-dominate-west-indies-4202371","keywords":null,"creator":null,"video_url":null,"description":"Nursing a bruised ego after WTC final snub last month, Ravichandran Ashwin made the best possible comeback as his 33rd five-wicket haul put India in the driver's seat against a below-par West Indies on the first day of the opening Test.","content":"Nursing a bruised ego after WTC final snub last month, Ravichandran Ashwin made the best possible comeback as his 33rd five-wicket haul put India in the driver's seat against a below-par West Indies on the first day of the opening Test, in Dominica on Wednesday. Ashwin justified his top billing in ICC Test bowlers' ranking with figures of 5 for 60 in 24.3 overs to decimate West Indies for a lowly 150 in 64.3 overs with Ravindra Jadeja (3/26 in 14 overs) beautifully complementing him to make life miserable for the home team batters. With more than an hour available for batting skipper Rohit Sharma (30 batting, 65 balls) and debutant Yashasvi Jaiswal (40 batting, 73 balls) added 80 runs for the opening stand to bring down first innings deficit to 70 going into second day. The new pair looked comfortable as there is not much help for the bowlers with Indian skipper hitting his customary 'Nataraja' pull-shot and soothing straight drive. Jaiswal also hardly showed any signs of nerves as he played close to his body for better part of evening. But the opening day's honours went to Ashwin, whose un-matchable artistry was too much to handle for an under-cooked batting line-up. Making full use of the slow two-paced track that also offered turn and bounce, Ashwin had reasons to be chuffed as he became third Indian bowler after Anil Kumble (956 wickets) and Harbhajan Singh (711) to complete 700 scalps across formats in international cricket. He also achieved the distinction of being first Indian bowler to dismiss father and son when he got rid of Shivnarine Chanderpaul 's son Tagenarine, having dismissed the father on his Test debut in 2011. Save debutant left-hander Alick Athanaze (47 off 99), who batted responsibly till his dismissal, none of the Caribbean batters had the technique to survive on a slow turner as none of them could even cross 20-run mark. Ashwin varied his pace, bowling a few sliders and pushing some other deliveries across to right handers while effectively using the drift to bowl conventional off-breaks to left-handers. The tireless Mohammed Siraj (12-2-25-1) also deserves a lot of credit as he bowled a beautiful fuller length during first session, changed his tactic to use a lot more bouncers post-lunch to hurry the batters on a slow track. One such delivery accounted for Jason Holder , who took the bait and was holed out at square leg boundary for the fielder stationed for that mistimed pull-shot. Advertisement Siraj was also brilliant on the field as his diving catch at mid-off to dismiss Jermaine Blackwood off Jadeja's bowling was top notch effort. The decision to bat on a track that offered turn and bounce on very first day, backfired for Caribbean batters, most of whom lacked requisite patience to deal with it. Shardul Thakur (7-3-15-1), operating as the third seamer in overseas conditions for the first time, continued with his happy knack of picking wickets with Jaydev Unadkat (7-2-17-0) also doing his job commendably. Opting to bat first, West Indies openers Chanderpaul (12, 44 balls) and skipper Kraigg Brathwaite (20 off 46 balls) went into a shell during the first hour as both Siraj and Unadkat beating the outside edge of both batters on multiple occasions. The pressure created by the pace duo did reap dividends as Ashwin slowed the pace of his deliveries, used the available drift to a good advantage to make life uncomfortable for the two openers. There was a nice loop and he did challenge both inside and outside edge during the second hour. Tagenarine's stance and trigger shuffle from leg to off-stump does have an uncanny resemblance with his illustrious father Shivnarine although he is slightly more side-on compared to his 'Old Man'. Sensing his shuffle, Ashwin got one to hang in the air and drift into the southpaw, who played inside the line only to find it beat his outside edge after pitching and there was a death rattle. West Indies skipper Brathwaite, easily the best Test batter in the side over the last five years, was increasingly getting frustrated as Ashwin bowled slightly quicker at times to him. He did try to hit out of trouble with a slog swept boundary but the canny operator fired one across the line, inducing Brathwaite to go for a mindless bottom-handed slog over mid-on. However the mistimed slog only became easiest skiers for skipper Rohit Sharma stationed at cover. Left-handed Raymon Reifer (2 off 18 balls) never looked in control as Siraj softened him up with some short balls. So when Thakur, who is a notch slower came into the attack, he wanted to come on front-foot and get his cover drive going. Thakur quickly slipped one across the stumps and the thick outside edge was snapped by a diving Ishant Kishan behind the stumps. In the post lunch session, Athanaze, who looked most comfortable against Ashwin did hit some lusty blows but was done in by slowness of the track as he couldn't time a short ball and the skier was gobbled up by Thakur. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2023-07-12 21:26:10","image_url":null,"source_id":"ndtv","category":["sports"],"country":["india"],"language":"english"},{"title":"IND vs WI 1st Test Day 1 Stumps: पहले दिन का खेल हुआ खत्म, सलामी बल्लेबाज रोहित शर्मा और यशस्वी जयसवाल ने पारी को संभाला; टीम इंडिया का स्कोर 80/0","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-the-first-days-play-is-over-openers-rohit-sharma-and-yashasvi-jaiswal-handled-the-innings-team-indias-score-800-1862718.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. पहले दिन का खेल खत्म हो गया हैं. पहले दिन का खेल ख़त्म होने तक टीम इंडिया ने 23 ओवर में बिना विकेट गवाएं 80 रन बना लिए हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी हो गया हैं. पहले दिन का खेल खत्म हो गया हैं. पहले दिन का खेल ख़त्म होने तक टीम इंडिया ने 23 ओवर में बिना विकेट गवाएं 80 रन बना लिए हैं. कप्तान रोहित शर्मा 30 और यशस्वी जयसवाल 40 रन बनाकर खेल रहे हैं. इससे पहले वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. Stumps on Day 1. Domination by India in Dominica with Ashwin & Jadeja are the bowling stars and fantastic batting by Jaiswal 40* & Rohit 30*. India 80 for 0, trailing by 70 runs in the first innings. pic.twitter.com/ynYMRTK5jf — Johns. (@CricCrazyJohns) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 21:18:57","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st Test Day 1 Live Score Update: बारिश की वजह से खेल रुका, टीम इंडिया का स्कोर 66/0","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-game-stopped-due-to-rain-team-india-score-660-1862713.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं. पिछली बार साल 2011 में इस मैदान पर मुकाबला ड्रॉ छूटा था. टीम इंडिया यहां अब तक एक ही मैच खेल पाई है. यह टीम इंडिया का दूसरा टेस्ट हैं. इस बीच वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. पहली पारी में बल्लेबाजी करने उतरी टीम इंडिया के लिए यशस्वी और रोहित ने अर्धशतकीय साझेदारी पूरी की. टीम इंडिया ने 15.5 ओवरों में 66 रन बनाए. रोहित शर्मा 28 रन और यशस्वी जायसवाल 28 रन बनाकर खेल रहे हैं. इन दोनों ने 95 गेंदों में 66 रन बनाए हैं. इस बीच बारिश की वजह से खेल को रोक दिया गया हैं. Rain stopped play. India 66 for 0 with Rohit 28* & Jaiswal 28* in the middle - fantastic batting by the openers. pic.twitter.com/xkPH5bJ1NW — Johns. (@CricCrazyJohns) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 20:47:53","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"IND vs WI 1st Test Day 1 Live Score Update: रोहित शर्मा और यशस्वी जयसवाल ने पूरी की अर्धशतकीय साझेदारी, टीम इंडिया का स्कोर 50 रनों के पार","link":"https://hindi.latestly.com/socially/sports/cricket/ind-vs-wi-1st-test-day-1-live-score-update-rohit-sharma-and-yashasvi-jaiswal-completed-half-century-partnership-team-indias-score-crossed-50-runs-1862709.html","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं.","content":"टीम इंडिया और वेस्टइंडीज के बीच 2 टेस्ट मैचों की सीरीज का पहला मुकाबला डोमिनिका के विंडसॉर पार्क में खेला जा रहा हैं. इस मैच के साथ ही टीम इंडिया अपने वर्ल्ड टेस्ट चैंपियनशिप सायकल का आगाज भी कर रहीं हैं. डोमिनिका में टीम इंडिया 13 साल बाद कोई टेस्ट मैच खेल रहा हैं. पिछली बार साल 2011 में इस मैदान पर मुकाबला ड्रॉ छूटा था. टीम इंडिया यहां अब तक एक ही मैच खेल पाई है. यह टीम इंडिया का दूसरा टेस्ट हैं. इस बीच वेस्टइंडीज के कप्तान क्रैग ब्रैथवेट ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया. टॉस जीतकर पहले बल्लेबाजी करने उतरी वेस्टइंडीज की टीम पहली पारी में महज 64.3 ओवर में 150 रन बनाकर सिमट गई. वेस्टइंडीज की तरफ से एलिक अथानाज़ ने सबसे ज्यादा 47 रन बनाए. टीम इंडिया की ओर से आर अश्विन ने सबसे ज्यादा 5 विकेट चटकाए. पहली पारी में बल्लेबाजी करने उतरी टीम इंडिया के लिए यशस्वी और रोहित ने अर्धशतकीय साझेदारी पूरी की. टीम इंडिया ने 13 ओवरों में 54 रन बनाए. रोहित 26 रन और यशस्वी 18 रन बनाकर खेल रहे हैं. इन दोनों ने 78 गेंदों में 54 रन बनाए हैं. 5⃣0⃣-run stand! 🤝 #TeamIndia off to a solid start, courtesy Captain @ImRo45 & debutant @ybj_19 🙌 Follow the match ▶️ https://t.co/FWI05P4Bnd #WIvIND pic.twitter.com/ys9kkbWh93 — BCCI (@BCCI) July 12, 2023 (SocialLY के साथ पाएं लेटेस्ट ब्रेकिंग न्यूज, वायरल ट्रेंड और सोशल मीडिया की दुनिया से जुड़ी सभी खबरें. यहां आपको ट्विटर, इंस्टाग्राम और यूट्यूब पर वायरल होने वाले हर कंटेंट की सीधी जानकारी मिलेगी. ऊपर दिखाया गया पोस्ट अनएडिटेड कंटेंट है, जिसे सीधे सोशल मीडिया यूजर्स के अकाउंट से लिया गया है. लेटेस्टली स्टाफ द्वारा इसमें कोई बदलाव या एडिट नहीं किया गया है. सोशल मीडिया पोस्ट लेटेस्टली के विचारों और भावनाओं का प्रतिनिधित्व नहीं करता है, हम इस पोस्ट में मौजूद किसी भी कंटेंट के लिए कोई जिम्मेदारी या दायित्व स्वीकार नहीं करते हैं.)","pubDate":"2023-07-12 20:40:50","image_url":null,"source_id":"latestly","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Alice Capsey says England can play even better after levelling Ashes series","link":"https://www.independent.co.uk/sport/cricket/kate-cross-alice-capsey-australia-heather-knight-ashes-b2374254.html","keywords":["Cricket","Sport"],"creator":["Phil Blanche"],"video_url":null,"description":"The tourists led 6-0 after winning the solitary Test and the opening T20 game.","content":"Alice Capsey warned Australia that England are yet to play their best cricket despite levelling the Women’s Ashes by winning the opening ODI at Bristol. England secured a nerve-shredding two-wicket win to wipe out the 6-0 deficit suffered after losing the series’ solitary Test and the opening T20 clash. Australia need to win only one of the two remaining ODIs at Southampton and Taunton to retain the Ashes but they have now lost three consecutive games for the first time since 2017. “We were 6-0 down but we took a lot of confidence from the Test match because we saw how close we were to winning that,” said number three batter Capsey, 18, who struck 40 from 34 balls in England’s victorious reply of 267 for eight. “We had another narrow loss in the opening T20 at Edgbaston, but we were pretty confident that once we got that first win we would go on a streak. “The whole series we haven’t been at our best. In the T20s we were playing at 80 per cent and we weren’t at our best again here. “But to get over the line in pressure moments when previously we would have crumbled a little bit is great. We were so calm out there, which is something we have focused on. “It’s really exciting we haven’t played our best cricket and it’s six-all.” The power hitting of Capsey and Tammy Beaumont was in danger of going to waste after England had reached 103 for one in the 12th over, chasing 264 to win. Wickets fell at regular intervals and it was left to skipper Heather Knight and Kate Cross , coming in at 10, to get England over the line. Cross joined Knight in the 44th over, with their partnership of 32 proving pivotal as England triumphed with 11 balls to spare. Knight made 75 from 86 balls while Cross’ cameo of 19 from 20 deliveries included an audacious ramp shot over the head of Australia’s wicketkeeping captain Alyssa Healey. Capsey said: “Crossy batted brilliantly – she can bat at three! She came in and played to her strengths. “We saw her bravery whether it was the ramp or hitting Jonno (Jess Jonassen) down the ground. It was unbelievable to watch. “She loves the ramp and probably plays it the best out of the whole group. If you don’t see a Kate Cross ramp you might be asking her: ‘Are you OK?'” Looking ahead to the Ashes’ climax, Capsey added: “We’ve shown a lot of fight in this series that previously we might not have. “Australia are the most successful cricket team and we knew it was going to be a real challenge. “We were the underdogs coming into the series but we have put the pressure on the Aussies. They are still a quality side and we go again at the Ageas (in Southampton).” Australia benefited from the hosts spilling four catches while wicketkeeper Amy Jones missed out on a stumping from a legside wide. “It would have been really nice to snatch that one at the end when they were under the pump and eight down,” said Australia batter Beth Mooney, who top scored for the tourists with an unbeaten 81. “We certainly haven’t put out best foot forward at this point and we know we’ve got to give a lot more when it comes to executing our skills. “I don’t think we’re that far off. Unfortunately we didn’t capitalise on the opportunities to put pressure on England. “We’ve let ourselves down in the last couple of games, but there’s no complacency.”","pubDate":"2023-07-12 20:36:25","image_url":"https://static.independent.co.uk/2023/07/12/21/81a84f50064954b7279d0cc0a2abf395Y29udGVudHNlYXJjaGFwaSwxNjg5MjgwMDYx-2.72976797.jpg?width=1200&auto=webp","source_id":"independentuk","category":["sports"],"country":["united kingdom"],"language":"english"}]}