{"newsArray":[{"title":"West Indies cricketer Devon Thomas handed ICC ban after being charged with match-fixing","link":"https://7news.com.au/sport/cricket/west-indies-cricketer-devon-thomas-handed-icc-ban-after-being-charged-with-match-fixing-c-10749023","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"The batter, who played against Australia last summer, is also accused of concealing and destroying evidence.","content":"West Indies batter Devon Thomas, who played a Test match against in December, has been charged with match-fixing by the and provisionally banned from playing. The ICC laid seven charges against Thomas relating to alleged attempts to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence. Watch, Stream & Catch Up with Australia's Home of Cricket on Four of the charges relate to matches in the Sri Lanka Premier League T20 tournament in 2021. Two relate to matches in the Caribbean Premier League T20 competition in the same year. One relates to matches in the T10 Cricket League in the United Arab Emirates, also in 2021. The ICC, in a release, also claimed that Thomas did not co-operate with the anti-corruption officials during the investigation. Besides the fixing allegation, the governing body also charged the 33-year-old with allegedly failing to report corrupt approaches. Thomas has 14 days to respond to the charges, the Dubai-based ICC said on Tuesday. Thomas’s only Test appearance came against Australia in December at Adelaide Oval. He made 19 and 12 as the hosts won by 419 runs. He did not play in subsequent Tests in Zimbabwe and South Africa. Thomas has played 21 one-day internationals, although his last came 10 years ago. He has played in 12 T20 games for West Indies between 2009 and 2022.","pubDate":"2023-05-23 22:22:49","image_url":"https://images.7news.com.au/publication/C-10749023/4d501df89ba4add404f4dcbdf43cba77fede4d41-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"West Indies batter Thomas suspended for match-fixing","link":"https://www.samaaenglish.tv/news/40036292/sports-west-indies-batter-thomas-suspended-for-match-fixing","keywords":["Sports"],"creator":null,"video_url":null,"description":"West Indies batter Devon Thomas has been provisionally banned for match-fixing, the International Cricket Council (ICC) announced on Tuesday. Thomas, 33, who has represented his country in all three formats, has been charged with breaching rules by three governing bodies. “The International Cricket Council (ICC), on behalf of Sri Lanka Cricket (SLC), the Emirates Cricket Board (ECB) and the Caribbean Premier League (CPL), has charged West Indies player Devon Thomas with seven counts under their anti-corruption codes and he has been provisionally suspended with immediate effect,” the ICC said. “Mr Thomas has 14 days from 23 May 2023 to respond to the charges,” it added. Thomas, has been named in the West Indies’ squad for next month’s one-day series with the UAE. “CWI (Cricket West Indies) is not directly involved in the process but remains firm in denouncing corruption in cricket, and fully supports the ICC ACU in its efforts to uphold the integrity of the sport,” the body said. “In collaboration with ICC and the West Indies Players’ Association (WIPA), CWI remains committed to sensitizing and educating our players and officials on anti-corruption in sports,” it added.","content":"Thomas, 33, who has represented his country in all three formats, has been charged with breaching rules by three governing bodies. “The International Cricket Council (ICC), on behalf of Sri Lanka Cricket (SLC), the Emirates Cricket Board (ECB) and the Caribbean Premier League (CPL), has charged West Indies player Devon Thomas with seven counts under their anti-corruption codes and he has been provisionally suspended with immediate effect,” the ICC said. “Mr Thomas has 14 days from 23 May 2023 to respond to the charges,” it added. Thomas, has been named in the West Indies’ squad for next month’s one-day series with the UAE. “CWI (Cricket West Indies) is not directly involved in the process but remains firm in denouncing corruption in cricket, and fully supports the ICC ACU in its efforts to uphold the integrity of the sport,” the body said. “In collaboration with ICC and the West Indies Players’ Association (WIPA), CWI remains committed to sensitizing and educating our players and officials on anti-corruption in sports,” it added.","pubDate":"2023-05-23 18:42:54","image_url":"https://i.samaaenglish.tv/large/2023/05/232342425e40437.jpg?r=234254","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"पुरुषों का क्रिकेट विश्व कप 2023: आईसीसी ने क्वालीफायर के लिए वार्म-अप कार्यक्रम जारी किए","link":"https://jantaserishta.com/sports/mens-cricket-world-cup-2023-icc-releases-warm-up-schedule-for-qualifiers-2367895","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"दुबई (एएनआई): आईसीसी द्वारा जिम्बाब्वे में आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर टूर्नामेंट से पहले वार्म-अप जुड़नार की पुष्टि की गई है। सभी 10 टीमें 18 जून को क्वालीफ़ायर की शुरुआत से पहले कुल दो अभ्यास मैच खेलेंगी, जिसमें पक्षों को महत्वपूर्ण इवेंट की शुरुआत से पहले कुछ मूल्यवान मैच अभ्यास प्राप्त करने होंगे। ICC के अनुसार गुरुवार 15 जून को उसी सप्ताह के दौरान होने वाले खेलों के दूसरे सेट के साथ वार्म-अप जुड़नार के शुरुआती दिन मंगलवार, 13 जून को हर टीम एक्शन में होगी। क्वालीफायर के लिए जिम्बाब्वे में 10 टीमें साल के अंत में 2023 विश्व कप में दो स्थानों के लिए संघर्ष कर रही हैं, शीर्ष दो टीमें सुपर सिक्स चरण के पूरा होने पर फाइनल में पहुंच रही हैं और एक स्थान अर्जित कर रही हैं। 50 ओवर का शोकेस। ICC ने आगामी ICC मेन्स क्रिकेट वर्ल्ड कप 2023 के क्वालीफायर मैचों के कार्यक्रम की भी घोषणा की है। दो बार के विजेता वेस्टइंडीज और 1996 के चैंपियन श्रीलंका आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर के लिए अलग-अलग समूहों में हैं जो 18 जून से 9 जुलाई के बीच जिम्बाब्वे में होंगे। टूर्नामेंट के मेजबान जिम्बाब्वे, नीदरलैंड, नेपाल और संयुक्त राज्य अमेरिका के साथ ग्रुप ए में वेस्टइंडीज को ड्रा किया गया। और श्रीलंका ग्रुप बी में है जहां द्वीप राष्ट्र को आयरलैंड, स्कॉटलैंड, ओमान और संयुक्त अरब अमीरात के खिलाफ मैच खेलने हैं। वार्म-अप जुड़नार: मंगलवार, 13 जून वेस्टइंडीज बनाम स्कॉटलैंड, हरारे स्पोर्ट्स क्लब जिम्बाब्वे बनाम ओमान, ताकाशिंगा क्रिकेट क्लब नेपाल बनाम यूएई, ओल्ड हैरियंस क्रिकेट क्लब श्रीलंका बनाम नीदरलैंड, क्वींस स्पोर्ट्स क्लब आयरलैंड बनाम यूएसए, बुलावायो एथलेटिक क्लब गुरुवार, 15 जून नेपाल बनाम ओमान, हरारे स्पोर्ट्स क्लब वेस्ट इंडीज बनाम संयुक्त अरब अमीरात, ताकाशिंगा क्रिकेट क्लब जिम्बाब्वे बनाम स्कॉटलैंड, ओल्ड हैरियंस क्रिकेट क्लब आयरलैंड बनाम नीदरलैंड्स, क्वींस स्पोर्ट्स क्लब श्रीलंका बनाम यूएसए, बुलावायो एथलेटिक क्लब (एएनआई)","pubDate":"2023-05-23 16:51:14","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs CSK, LIVE Cricket Score, IPL 2023 Qualifier 1 in Chennai: GT 59/2, target: 173; Gill, Shanaka rebuild GT innings","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-csk-live-cricket-score-ipl-2023-qualifier-1-match-scorecard-live-update-gujarat-titans-vs-chennai-super-kings-indian-premier-league-live-streaming-today-12636922.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs CSK, LIVE Cricket Score, IPL 2023 Qualifier 1 in Chennai: GT 59/2, target: 173; Gill, Shanaka rebuild GT innings","content":"22:16 (IST)GT vs CSK Qualifier 1 LIVE Score After 9 overs,Gujarat Titans 59/2 ( Shubman Gill 32 , Dasun Shanaka 6) Though Gill firmly sweeps Jadeja towards the vacant midwicket fence to collect his second boundary off the senior left-arm spinner, the last three overs have belonged to the Chennai spinners with Jadeja and Theekshana hardly giving Gill and Dasun Shanaka any room to breathe. Between the two boundaries that Gill collected at the start of the seventh and off the final ball of the ninth, GT collected just 10 runs in 16 balls, with the required rate now going past 10-an-over.22:14 (IST)GT vs CSK Qualifier 1 LIVE Score FOUR! Gill welcomes Jadeja into the attack with a boundary, cutting behind square to collect his third boundary. Gujarat, meanwhile, are yet to reach the 50-mark despite the innings going past the powerplay. GT 45/2  22:07 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 6 overs,Gujarat Titans 41/2 ( Shubman Gill 20 , Dasun Shanaka 0) OUT! Hardik Pandya joins Wriddhiman Saha in the Gujarat Titans dressing room after cutting a short, wide delivery from Maheesh Theekshana straight to Ravindra Jadeja at backward point as Maheesh Theekshana strikes in his first over of the evening! Excellent first over from the Sri Lankan offie with just two coming off it along with Pandya's wicket as the defending champions reach 41/2 at the end of the powerplay, needing another 132 to win off 84. Pandya c Jadeja b Theekshana 8(7)22:01 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 5 overs,Gujarat Titans 39/1 ( Shubman Gill 19 , Hardik Pandya (C) 7) FOUR! Gill waits for the ball to climb, before pulling it over the midwicket region. Wasn't exactly the best of shots from the opener, but manages to send it towards the fence in any case. Ruins what was turning out to be a superb second over from Chahar. Tushar Deshpande, meanwhile, went for 10 in the previous over, conceding a boundary each to GT skipper Pandya and Gill.21:56 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 3 overs,Gujarat Titans 22/1 ( Shubman Gill 9 , Hardik Pandya (C) 0) OUT! Deepak Chahar draws first blood as Wriddhiman Saha holes out to the man standing at deep square leg while looking to clear the boundary rope himself, departing for 12. Skipper Hardik Pandya joins Gill at the centre after Chahar ends what was turning out to be a very expensive over on a good note. Saha c Pathirana b Chahar 12(11)21:54 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score SIX! Shubman Gill collects the first maximum of the Gujarat Titans chase, flicking a full delivery from Deepak Chahar over the fine leg region! GT 15/0  21:44 (IST)After 2 overs,Gujarat Titans 9/0 ( Wriddhiman Saha (W) 7 , Shubman Gill 2) Tushar Deshpande comes into the attack from the other end. In the fifth ball, Gill plays a risky drive Chahar, moving from the mid-on position, makes a diving effort but can only get fingertips on it. Six off the over. 21:39 (IST)After 1 overs,Gujarat Titans 3/0 ( Wriddhiman Saha (W) 2 , Shubman Gill 1) A very tidy start from Deepak Chahar, who opens the bowling for CSK. Just three runs off the first over, with both Wriddhiman Saha and Shubman Gill getting off the mark. 21:37 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Right. Time for the run-chase. Gujarat Titans need 173 runs to win. An impact substation from CSK, who bring in Matheesha Pathirana in place of Shivam Dube. GT, too make a change, with Mohit Sharma making way for Vijay Shankar. 21:16 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score OUT! Pin-drop silence at Chepauk as CSK leader MS Dhoni perishes after hitting straight to his GT counterpart Hardik Pandya standing at cover, perishing for 1 in what potentially is his final appearance at the MA Chidambaram Stadium! Mohit Sharma grabs his second wicket off his penultimate ball of the evening. CSK 155/6 Dhoni c Pandya b Mohit 1(2)21:14 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 18 overs,Chennai Super Kings 148/5 ( Ravindra Jadeja 10 , MS Dhoni (C) (W) 0) OUT! Rashid Khan grabs his only wicket off his final delivery of the evening as Ambati Rayudu perishes right after smashing the Afghan superstar for a maximum over deep square leg, miscuing the ball towards deep midwicket where Dasun Shanaka latches on to the ball to complete the catch. Huge cheer at the Chepauk after Rayudu's dismissal as 'Thala' makes his way to the centre. Rayudu c Shanaka b Rashid 17(9)20:58 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 16 overs,Chennai Super Kings 131/4 ( Ambati Rayudu 6 , Ravindra Jadeja 4) OUT! Chennai continue losing wickets in pairs as Devon Conway, who was set on 40, perishes at the start of Mohammed Shami's third over after holing out to Rashid Khan at deep midwicket. Gujarat once again claw back with two quick wickets just when Chennai appear to be hitting the gas pedal. Tidy third over from Shami, with six coming off it along with the wicket. Two new faces in Jadeja and Rayudu at the centre. Conway c Rashid b Shami 40(34)20:55 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score OUT! Darshan Nalkande finally gets his first wicket of the season as Ajinkya Rahane's cameo comes to an end! After smashing Nalkande for a six in the previous delivery, Rahane ends up cutting a short-of-length ball outside off straight to the fielder at backward point to depart for 17. CSK 121/4 Rahane c Gill b Nalkande 17(10)20:48 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 14 overs,Chennai Super Kings 107/2 ( Devon Conway 35 , Ajinkya Rahane 8) Rashid Khan returns on the other side of the strategic timeout. Though he does not give away any boundaries in his third, Conway and Rahane are able to keep the scoreboard ticking with the ones and twos, with eight coming off the Afghan's third. Chennai's run rate is less than eight at the moment, and they will need a couple of big overs if they are to push for a 180-run total on this surface.20:42 (IST)GT vs CSK LIVE Score After 13 overs,Chennai Super Kings 99/2 ( Devon Conway 31 , Ajinkya Rahane 4) Ahmad signs off with figures of 1/29, dismissing Dube in his final over. Meanwhile, Ajinkya Rahane, who has been one of the standout performers for Chennai this season, joins Conway, who is in dire of a quick burst of runs, at the centre. Darshan Nalkande returns in the 13th over, and he bowls out a tidy over with five coming off the 13th over before the umpire signals for the second time-out of the evening.20:31 (IST)GT vs CSK LIVE Score BOWLED! One wicket quickly leads to another as Noor Ahmad foxes Shivam Dube with the wrong un'. Dube attempts a wild heave towards the midwicket region, with the ball sneaking through his defence after holding its line and crashing into the stumps, uprooting the middle pole. CSK 90/2 Dube b Ahmad 1(3) 20:29 (IST)GT vs CSK LIVE Score OUT! Mohit Sharma with the breakthrough as the Titans finally end the solid opening partnership between Ruturaj Gaikwad and Devon Conway. The former departs after mishitting a short-of-length delivery from the veteran seamer, offering David Miller at long on the easiest of grabs. Departs for 60, scoring another 58 runs getting a reprieve thanks a no-ball by Darshan Nalkande. Gaikwad c Miller b Mohit 60(44)20:27 (IST)GT vs CSK LIVE Score After 10 overs,Chennai Super Kings 85/0 ( Ruturaj Gaikwad 59 , Devon Conway 24) Chennai Super Kings are powering along nicely at the halfway stage of their innings, going at eight-and-a-half an over with Gaikwad batting on 59. They'll be hoping to score even more aggressively in the second half of the innings. For the defending champions, a wicket is an absolute must, and the earlier it comes, the better. 20:18 (IST)GT vs CSK LIVE Score FOUR! Fine way for Ruturaj Gaikwad to bring up his third half-century of the season as well as his 13th overall in the IPL! Decides to take the aerial route against a short, wide delivery from Mohit Sharma, guiding it behind point with the fielder running to his right from third man unable to get to it in time. Gaikwad brings up the milestone in 36 deliveries, collecting six fours along the way! CSK 69/0  20:16 (IST)GT vs CSK LIVE Score After 8 overs,Chennai Super Kings 64/0 ( Ruturaj Gaikwad 46 , Devon Conway 16) Another nine-run over from Rashid, who had been labelled as GT's \"Trump Card\" against CSK on this surface by Virender Sehwag ahead of the game, with Gaikwad collecting another boundary off the spin superstar — this time cutting it behind point. That is followed by a relatively tidy over from Noor with a brace and four singles coming off it. CSK are going at eight-an-over, and they will be hoping to accelerate later on.20:08 (IST)GT vs CSK Qualifier 1 LIVE Score After 6 overs,Chennai Super Kings 49/0 ( Ruturaj Gaikwad 33 , Devon Conway 14) Gujarat Titans decide to deploy their Afghan spin twins for the last two overs of the powerplay. Gaikwad pinches a couple of doubles off Rashid in his first over before going for a lofted drive over the cover region for a boundary in a nine-run over. Noor Ahmed also concedes nine in his first over, both Gaikwad and Conway collecting a boundary each in this over. End of a decent powerplay for Chennai, which could have gone in an entirely different direction had Nalkande not overstepped earlier.19:57 (IST)GT vs CSK Qualifier 1 LIVE Score After 4 overs,Chennai Super Kings 31/0 ( Ruturaj Gaikwad 19 , Devon Conway 10) FOUR! And now Conway collects his first boundary of the evening, guiding the length ball square on the off side by playing it late, ruining what was turning out to be an excellent second over!19:56 (IST)GT vs CSK Qualifier 1 LIVE Score FOUR! And now Shami concedes his first boundary of the evening as Gaikwad decides to push a full, wide delivery from the veteran pacer through the covers for his second four of the evening! CSK 23/0 after 319:54 (IST)GT vs CSK Qualifier 1 LIVE Score After 2 overs, CSK 18/0 (Ruturaj Gaikwad 14, Devon Conway 2) NO BALL! Gaikwad gets a lifeline early after Nalkande dismisses him off what is his third ball of the season, only to find out that he overstepped. To make matters worse for GT, Gaikwad collects a SIX! and a FOUR off the next two balls!19:40 (IST)GT vs CSK Qualifier 1 LIVE Score After 1 over, CSK 4/0 (Ruturaj Gaikwad 2, Devon Conway 1) Tidy start for Shami, with just four coming off it. Gaikwad opens the account for Chennai with a brace off the third delivery, and gets off strike with a leg-bye two balls later. Devon Conway keeps the strike with a single off the last ball.19:38 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Ruturaj Gaikwad walks out to open the Chennai Super Kings innings alongside Devon Conway as Mohammed Shami gears up to bowl the first over. Can Gaikwad and Conway get Chennai off to another solid start? Stay tuned to find out.19:13 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Teams: Gujarat Titans: Shubman Gill, Wriddhiman Saha(w), Hardik Pandya(c), Dasun Shanaka, David Miller, Rahul Tewatia, Rashid Khan, Darshan Nalkande, Mohit Sharma, Noor Ahmad, Mohammed Shami Chennai Super Kings: Ruturaj Gaikwad, Devon Conway, Ajinkya Rahane, Ambati Rayudu, Shivam Dube, Moeen Ali, Ravindra Jadeja, MS Dhoni(w/c), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana19:08 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score MS Dhoni, Chennai Super Kings captain: We wanted to bowl first as well. GT are an excellent side and have chased so well through the tournament. It has been excellent right from the first game. What the guys have shown is maturity. What is important is to learn in the tournament from the start to the end. I feel it will slow down as the game progresses, but a lot depends on the dew factor. It’s the same squad.19:04 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Hardik Pandya, Gujarat Titans captain: We heard dew will be coming in later. If you know you can be in top two, it can be a different pressure. We focused on making sure we keep playing good cricket. The kind of players we have, we don’t just play one style. From batters and bowlers, we have adapted quite well. Just one change, Darshan Nalkande comes in.19:04 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score TOSS: Gujarat Titans win the toss, and skipper Hardik Pandya opts to field 18:55 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score “It is very dry. Rashid Khan and Noor are really going to make an impact. Top six of both sides must get off to a flier. Once they are under pressure, you start getting wickets,” says Matthew Hayden in his analysis of the Chepauk wicket.18:51 (IST)\"You need to be a proper devil to hate Mahendra Singh Dhoni\" Gujarat Titans captain Hardik Pandya opens up on his relationship with Chennai Super Kings leader MS Dhoni, against whom he will be squaring off at the MA Chidambaram Stadium in Chennai later today, adding that MSD was like a brother he could chill around with. Click here to read the full story 18:40 (IST)GT vs CSK, IPL 2023 Qualifier 1 weather update The evening at Chepauk is expected to be hot on Tuesday, with temperatures that could hit 30 °C. The dew factor could play a big part in the run-chase. The chasing team have won four out of seven matches this season at Chepauk. According to the visuals coming in from Chennai the moment, things look pretty clear at the moment in the Tamil Nadu capital.18:30 (IST)Rashid to be GT's trump card against CSK: Sehwag Spin sensation Rashid Khan had started the season on a slow note and had been expensive in his spells early on in the season, but turned things around in style soon enough to not just catch up with the rest of the pack, but to go level with Purple Cap holder Mohammed Shami at the end of the league stage. And according to Indian batting icon Virender Sehwag, he will be key to GT's hopes of beating CSK in Chennai for the first time ever. \"Rashid Khan is the trump card for Gujarat. If they want wickets, they bring him. And then the way Hardik has used Rashid, it is commendable. Rashid likes to break partnerships and now he has become the most successful bowler of this season on the basis of his excellent performance,\" said Sehwag. Click here to read the full story18:16 (IST)  GT vs CSK: Form guide (Last five matches) GT: W W L W W CSK: W L W W NR Both Gujarat and Chennai won each of their last league encounters; while CSK thrashed Delhi Capitals by 77 runs at the Arun Jaitley Stadium to confirm a second-place finish, GT chased down the 198-run target set by Royal Challengers Bangalore in Bengaluru to knock them out of the playoffs race.18:00 (IST)Gujarat Titans vs Chennai Super Kings head-to-head record: 17 April 2022 in Pune: Gujarat Titans won by three wickets 15 May 2022 in Mumbai (Wankhede): Gujarat Titans won by seven wickets 31 March 2023 in Ahmedabad: Gujarat Titans won by five wickets17:45 (IST)CSK, at Chepauk, stand in GT's way of second straight final IPL Qualifier 1 will see these similar yet very different teams go against each other at Chepauk in what is expected to be a cracker of a contest. CSK will enjoy home advantage but they’ve not been as impregnable at home as in the past. Gujarat Titans, meanwhile, will now hope they’ve shed the weary legs and minds after playing late on Sunday night and the travel that came after it. Click here to read the IPL 2023 Qualifier 1 Preview17:28 (IST)Hello and welcome to our coverage of the 2023 Indian Premier League (IPL) Qualifier 1, with defending champions Gujarat Titans taking on four-time winners Chennai Super Kings at the MA Chidambaram Stadium in Chennai with the winner of today's game directly qualifying for the final. GT vs CSK Qualifier 1 LIVE Score: GT 59/2 after 9; Though Shubman Gill manages to collect the odd boundary ever now and then, the Chennai Super Kings spinners are keeping things tight in the overs after the powerplay. GT vs CSK Qualifier 1 preview: Defending champions Gujarat Titans take on four-time winners Chennai Super Kings in Qualifier 1 as 2023 Indian Premier League (IPL) playoffs get underway at the MA Chidambaram Stadium in Chennai on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ GT and CSK, the two teams that squared off in the tournament opener at Ahmedabad’s Narendra Modi Stadium on 31 March, finished in the top two slots with 20 and 17 points respectively with the Titans topping the table for a second season in a row since making their debut last year along with the Lucknow Super Giants (LSG). CSK were tied with LSG on 17 points, given the fixture between the two at Lucknow’s Ekana Stadium earlier this month had been rained off, but finished ahead on the table due to their superior Net Run Rate. As far as the head-to-head record between the two teams goes, it’s 3-0 in favour of Gujarat at the moment. The Hardik Pandya-led side have pulled off a hat-trick of chases against MS Dhoni and Co — winning by three wickets and seven wickets last season. In the first game of the 16th edition, Gujarat managed to chase down the 179-run target set by Chennai with five wickets and four deliveries to spare. While the winner of this contest progresses directly into the final that takes place at the Narendra Modi Stadium this Sunday, the loser will have another shot at making the final as they take on the winner of the Eliminator between LSG and Mumbai Indians, which takes place on Wednesday, 24 May. Teams: Gujarat Titans: Shubman Gill, Wriddhiman Saha(w), Hardik Pandya(c), Dasun Shanaka, David Miller, Rahul Tewatia, Rashid Khan, Darshan Nalkande, Mohit Sharma, Noor Ahmad, Mohammed Shami Chennai Super Kings: Ruturaj Gaikwad, Devon Conway, Ajinkya Rahane, Ambati Rayudu, Shivam Dube, Moeen Ali, Ravindra Jadeja, MS Dhoni(w/c), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-23 16:48:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Deepak-Chahar-celebrates-IPL-2023-Qualifier-1-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"रिद्धिमान साहा के खिलाफ फील्डिंग सजाने की सबसे बड़ी 'साजिश', धोनी का सानी नहीं","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/wriddhiman-saha-traps-in-ms-dhoni-plan-gt-vs-csk-ipl-2023/articleshow/100454307.cms","keywords":null,"creator":null,"video_url":null,"description":"GT vs CSK: महेंद्र सिंह धोनी ने आईपीएल 2023 में एक बार फिर अपनी कप्तानी का लोहा मनवाया। उन्होंने गुजरात टाइटंस के ओपनर रिद्धिमान साहा के लिए जो जाल बिछाया था, वो उसमें फंस गए। चेन्नई सुपर किंग्स और गुजरात टाइटंस के बीच सीजन का पहला क्वालिफायर खेला जा रहा है।","content":"महेंद्र सिंह धोनी (MS Dhoni) 2007 से कप्तानी कर रहे हैं। भारत के साथ ही वह आईपीएल के सबसे सफल कप्तानों में शामिल हैं। 41 साल की उम्र में भी वह चेन्नई सुपर किंग्स के लिए आईपीएल (IPL 2023) में खेल रहे हैं। भले ही उनका बल्ला पहले जैसा नहीं चल रहा लेकिन कप्तानी और प्लानिंग में धोनी आज भी भारी पड़ रहे हैं। गुजरात टाइटंस और चेन्नई सुपर किंग्स (GT vs CSK) के बीच खेले जा रहे आईपीएल 2023 के पहले क्वालिफायर में एक बार फिर मास्टरमाइंड धोनी देखने को मिले। गुजरात टाइटंस के बल्लेबाज रिद्धिमान साहा काफी पुल शॉट खेलते हैं। पटकी हुई गेंद देखने ही वह पुल शॉट लगा देते हैं। चेपॉक की पिच धीमी है और कई बार गेंद फंसकर आती है और यह शॉट खेलना मुश्किल हो जाता है। ऐसे में धोनी ने डीप स्क्वायर लेग के फील्डर को बाउंड्री लाइन से काफी अंदर खड़ा किया। दीपक चाहर ने तीसरे ओवर की अंतिम गेंद पटकी हुई फेंकी और साहा ने इसे पुल किया। गेंद सीधे धोनी के लगाए फील्डर के हाथों में चली गई। जब साहा का विकेट गिरा तो दीपक चाहर का रिक्शन साफ बता रहा था कि प्लानिंग काम कर गई। महेंद्र सिंह धोनी के चेहरे पर भी संतुष्टि साफ दिख रही थी। क्योंकि साहा गुजरात के लिए पावरप्ले में काफी तेजी से रन बनाते हैं। इस मैच में उन्होंने 11 गेंदों पर 12 रनों की पारी खेली। चेन्नई सुपरकिंग्स ने इंडियन प्रीमियर लीग के पहले क्वालीफायर मैच में गुजरात टाइटंस के खिलाफ पहले बल्लेबाजी करते हुए सात विकेट पर 172 रन बनाये। चेन्नई के लिए सलामी बल्लेबाज रुतुराज गायकवाड़ ने सबसे ज्यादा 60 रन बनाये। गुजरात ने दूसरे ही ओवर में उन्हें जीवनदान दिया था। गुजरात के लिए मोहित शर्मा और मोहम्मद शमी ने दो-दो विकेट लिये।","pubDate":"2023-05-23 16:46:23","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पुरुषों का क्रिकेट विश्व कप 2023: आईसीसी ने क्वालीफायर के लिए वार्म-अप कार्यक्रम जारी किए","link":"https://jantaserishta.com/sports/mens-cricket-world-cup-2023-icc-releases-warm-up-fixtures-for-qualifier-2367861","keywords":["खेल"],"creator":["Gulabi Jagat"],"video_url":null,"description":null,"content":"दुबई (एएनआई): आ ईसीसी द्वारा जिम्बाब्वे में आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर टूर्नामेंट से पहले वार्म-अप जुड़नार की पुष्टि की गई है। सभी 10 टीमें 18 जून को क्वालीफ़ायर की शुरुआत से पहले कुल दो अभ्यास मैच खेलेंगी, जिसमें पक्षों को महत्वपूर्ण इवेंट की शुरुआत से पहले कुछ मूल्यवान मैच अभ्यास प्राप्त करने होंगे। ICC के अनुसार गुरुवार 15 जून को उसी सप्ताह के दौरान होने वाले खेलों के दूसरे सेट के साथ वार्म-अप जुड़नार के शुरुआती दिन मंगलवार, 13 जून को हर टीम एक्शन में होगी। क्वालीफायर के लिए जिम्बाब्वे में 10 टीमें साल के अंत में 2023 विश्व कप में दो स्थानों के लिए संघर्ष कर रही हैं, शीर्ष दो टीमें सुपर सिक्स चरण के पूरा होने पर फाइनल में पहुंच रही हैं और एक स्थान अर्जित कर रही हैं। 50 ओवर का शोकेस। ICC ने आगामी ICC मेन्स क्रिकेट वर्ल्ड कप 2023 के क्वालीफायर मैचों के कार्यक्रम की भी घोषणा की है। दो बार के विजेता वेस्टइंडीज और 1996 के चैंपियन श्रीलंका आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर के लिए अलग-अलग समूहों में हैं जो 18 जून से 9 जुलाई के बीच जिम्बाब्वे में होंगे। टूर्नामेंट के मेजबान जिम्बाब्वे, नीदरलैंड, नेपाल और संयुक्त राज्य अमेरिका के साथ ग्रुप ए में वेस्टइंडीज को ड्रा किया गया। और श्रीलंका ग्रुप बी में है जहां द्वीप राष्ट्र को आयरलैंड, स्कॉटलैंड, ओमान और संयुक्त अरब अमीरात के खिलाफ मैच खेलने हैं। वार्म-अप जुड़नार: मंगलवार, 13 जून वेस्टइंडीज बनाम स्कॉटलैंड, हरारे स्पोर्ट्स क्लब जिम्बाब्वे बनाम ओमान, ताकाशिंगा क्रिकेट क्लब नेपाल बनाम यूएई, ओल्ड हैरियंस क्रिकेट क्लब श्रीलंका बनाम नीदरलैंड, क्वींस स्पोर्ट्स क्लब आयरलैंड बनाम यूएसए, बुलावायो एथलेटिक क्लब गुरुवार, 15 जून नेपाल बनाम ओमान, हरारे स्पोर्ट्स क्लब वेस्ट इंडीज बनाम संयुक्त अरब अमीरात, ताकाशिंगा क्रिकेट क्लब जिम्बाब्वे बनाम स्कॉटलैंड, ओल्ड हैरियंस क्रिकेट क्लब आयरलैंड बनाम नीदरलैंड्स, क्वींस स्पोर्ट्स क्लब श्रीलंका बनाम यूएसए, बुलावायो एथलेटिक क्लब (एएनआई)","pubDate":"2023-05-23 16:40:48","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एलेप्पी एक्सप्रेस पर सवार थे धोनी लेकिन मोहित ने चेन खींच दी, चेले ने ही थाला को फंसाया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ms-dhoni-out-on-just-1-run-by-mohit-sharma-in-ipl-qualifier-1-csk-vs-gt/articleshow/100453936.cms","keywords":null,"creator":null,"video_url":null,"description":"CSK vs GT Highlights: गुजरात टाइटंस के खिलाफ आईपीएल 2023 के ओपनिंग मैच में 7 गेंद में नाबाद 14 रन बनाने वाले माही इस बार 2 गेंद में सिर्फ 1 रन बनाकर आउट हो गए। मोहित शर्मा ने उन्हें स्लोअर में फंसाया।","content":null,"pubDate":"2023-05-23 16:35:52","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies batter Devon Thomas suspended for alleged fixing in Lanka Premier League","link":"https://indianexpress.com/article/sports/cricket/west-indies-batter-devon-thomas-suspended-for-alleged-fixing-in-lanka-premier-league-8625306/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-23 16:30:01","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"GT vs CSK: Noor Ahmad castles Shivam Dube with unplayable delivery; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-csk-noor-ahmad-castles-shivam-dube-with-unplayable-delivery-watch-video-12637992.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs CSK: Noor Ahmad castles Shivam Dube with unplayable delivery; watch video","content":"Gujarat Titans’ (GT) Afghan spinner Noor Ahmad has been in fine form this Indian Premier League (IPL) season, and maintained it with the dismissal of Chennai Super Kings’ (CSK) Shivam Dube during Qualifier 1 at Chepauk on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Noor was bowling the 12th over of the CSK innings. He delivered a full length ball on off, but the ball ended up spinning sharply, and that eventually deceived Dube, dismantling the leg stump. You miss, I hit 😎 Noor Ahmad gets Shivam Dube with a beauty 🎯 Follow the match ▶️ https://t.co/LRYaj7cLY9#TATAIPL | #Qualifier1 | #GTvCSK pic.twitter.com/OjtjAsXLXT — IndianPremierLeague (@IPL) May 23, 2023 Dube, who has been impressive with the bat this season, scoring 386 runs from 15 matches, was dismissed just for one run. With the wicket, Noor Ahmad improved his wickets tally to 14 scalps from 11 matches. The winner of the GT vs CSK Qualifier 1 contest earns direct qualification to Sunday’s final in Ahmedabad, while the losing team takes on the winners of Wednesday’s Eliminator between Lucknow Super Giants (LSG) and Mumbai Indians (MI). Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-23 16:27:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Noor-Ahmad-GT-vs-CSK-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies batter Devon Thomas charged with match fixing by ICC","link":"https://telanganatoday.com/west-indies-batter-devon-thomas-charged-with-match-fixing-by-icc","keywords":["News","Sport","Devon Thomas","ICC","match fixing","West Indies"],"creator":["AP"],"video_url":null,"description":"ICC laid seven charges against Thomas relating to attempting to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence","content":"Dubai: West Indies batter Devon Thomas was charged with match fixing by the International Cricket Council and provisionally banned from playing on Tuesday. The ICC laid seven charges against Thomas relating to attempting to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence. Four of the charges relate to matches in the Lanka Premier League Twenty20 tournament in Sri Lanka in 2021. Two relate to matches in the Caribbean Premier League T20 competition in the same year and one relates to matches in the T10 Cricket League in United Arab Emirates, also in 2021. The 33-year-old Thomas has 14 days from Tuesday to respond to the charges, the Dubai-based ICC said.Thomas has played 21 one-day internationals, although his last came 10 years ago. He has played in 12 T20 games for West Indies between 2009 and 2022. His only test appearance came against Australia in December.","pubDate":"2023-05-23 16:20:45","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies cricketer Devon Thomas handed ICC ban after being charged with match-fixing","link":"https://7news.com.au/sport/cricket/west-indies-cricketer-devon-thomas-handed-icc-ban-after-being-charged-with-match-fixing-c-10749023","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"The batter, who played against Australia last summer, is also accused of concealing and destroying evidence.","content":"West Indies batter Devon Thomas, who played a Test match against in December, has been charged with match-fixing by the and provisionally banned from playing. The ICC laid seven charges against Thomas relating to alleged attempts to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence. Watch, Stream & Catch Up with Australia's Home of Cricket on Four of the charges relate to matches in the Sri Lanka Premier League T20 tournament in 2021. Two relate to matches in the Caribbean Premier League T20 competition in the same year. One relates to matches in the T10 Cricket League in the United Arab Emirates, also in 2021. The ICC, in a release, also claimed that Thomas did not co-operate with the anti-corruption officials during the investigation. Besides the fixing allegation, the governing body also charged the 33-year-old with allegedly failing to report corrupt approaches. Thomas has 14 days to respond to the charges, the Dubai-based ICC said on Tuesday. Thomas’s only Test appearance came against Australia in December at Adelaide Oval. He made 19 and 12 as the hosts won by 419 runs. He did not play in subsequent Tests in Zimbabwe and South Africa. Thomas has played 21 one-day internationals, although his last came 10 years ago. He has played in 12 T20 games for West Indies between 2009 and 2022.","pubDate":"2023-05-23 22:22:49","image_url":"https://images.7news.com.au/publication/C-10749023/4d501df89ba4add404f4dcbdf43cba77fede4d41-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"West Indies batter Thomas suspended for match-fixing","link":"https://www.samaaenglish.tv/news/40036292/sports-west-indies-batter-thomas-suspended-for-match-fixing","keywords":["Sports"],"creator":null,"video_url":null,"description":"West Indies batter Devon Thomas has been provisionally banned for match-fixing, the International Cricket Council (ICC) announced on Tuesday. Thomas, 33, who has represented his country in all three formats, has been charged with breaching rules by three governing bodies. “The International Cricket Council (ICC), on behalf of Sri Lanka Cricket (SLC), the Emirates Cricket Board (ECB) and the Caribbean Premier League (CPL), has charged West Indies player Devon Thomas with seven counts under their anti-corruption codes and he has been provisionally suspended with immediate effect,” the ICC said. “Mr Thomas has 14 days from 23 May 2023 to respond to the charges,” it added. Thomas, has been named in the West Indies’ squad for next month’s one-day series with the UAE. “CWI (Cricket West Indies) is not directly involved in the process but remains firm in denouncing corruption in cricket, and fully supports the ICC ACU in its efforts to uphold the integrity of the sport,” the body said. “In collaboration with ICC and the West Indies Players’ Association (WIPA), CWI remains committed to sensitizing and educating our players and officials on anti-corruption in sports,” it added.","content":"Thomas, 33, who has represented his country in all three formats, has been charged with breaching rules by three governing bodies. “The International Cricket Council (ICC), on behalf of Sri Lanka Cricket (SLC), the Emirates Cricket Board (ECB) and the Caribbean Premier League (CPL), has charged West Indies player Devon Thomas with seven counts under their anti-corruption codes and he has been provisionally suspended with immediate effect,” the ICC said. “Mr Thomas has 14 days from 23 May 2023 to respond to the charges,” it added. Thomas, has been named in the West Indies’ squad for next month’s one-day series with the UAE. “CWI (Cricket West Indies) is not directly involved in the process but remains firm in denouncing corruption in cricket, and fully supports the ICC ACU in its efforts to uphold the integrity of the sport,” the body said. “In collaboration with ICC and the West Indies Players’ Association (WIPA), CWI remains committed to sensitizing and educating our players and officials on anti-corruption in sports,” it added.","pubDate":"2023-05-23 18:42:54","image_url":"https://i.samaaenglish.tv/large/2023/05/232342425e40437.jpg?r=234254","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"पुरुषों का क्रिकेट विश्व कप 2023: आईसीसी ने क्वालीफायर के लिए वार्म-अप कार्यक्रम जारी किए","link":"https://jantaserishta.com/sports/mens-cricket-world-cup-2023-icc-releases-warm-up-schedule-for-qualifiers-2367895","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"दुबई (एएनआई): आईसीसी द्वारा जिम्बाब्वे में आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर टूर्नामेंट से पहले वार्म-अप जुड़नार की पुष्टि की गई है। सभी 10 टीमें 18 जून को क्वालीफ़ायर की शुरुआत से पहले कुल दो अभ्यास मैच खेलेंगी, जिसमें पक्षों को महत्वपूर्ण इवेंट की शुरुआत से पहले कुछ मूल्यवान मैच अभ्यास प्राप्त करने होंगे। ICC के अनुसार गुरुवार 15 जून को उसी सप्ताह के दौरान होने वाले खेलों के दूसरे सेट के साथ वार्म-अप जुड़नार के शुरुआती दिन मंगलवार, 13 जून को हर टीम एक्शन में होगी। क्वालीफायर के लिए जिम्बाब्वे में 10 टीमें साल के अंत में 2023 विश्व कप में दो स्थानों के लिए संघर्ष कर रही हैं, शीर्ष दो टीमें सुपर सिक्स चरण के पूरा होने पर फाइनल में पहुंच रही हैं और एक स्थान अर्जित कर रही हैं। 50 ओवर का शोकेस। ICC ने आगामी ICC मेन्स क्रिकेट वर्ल्ड कप 2023 के क्वालीफायर मैचों के कार्यक्रम की भी घोषणा की है। दो बार के विजेता वेस्टइंडीज और 1996 के चैंपियन श्रीलंका आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर के लिए अलग-अलग समूहों में हैं जो 18 जून से 9 जुलाई के बीच जिम्बाब्वे में होंगे। टूर्नामेंट के मेजबान जिम्बाब्वे, नीदरलैंड, नेपाल और संयुक्त राज्य अमेरिका के साथ ग्रुप ए में वेस्टइंडीज को ड्रा किया गया। और श्रीलंका ग्रुप बी में है जहां द्वीप राष्ट्र को आयरलैंड, स्कॉटलैंड, ओमान और संयुक्त अरब अमीरात के खिलाफ मैच खेलने हैं। वार्म-अप जुड़नार: मंगलवार, 13 जून वेस्टइंडीज बनाम स्कॉटलैंड, हरारे स्पोर्ट्स क्लब जिम्बाब्वे बनाम ओमान, ताकाशिंगा क्रिकेट क्लब नेपाल बनाम यूएई, ओल्ड हैरियंस क्रिकेट क्लब श्रीलंका बनाम नीदरलैंड, क्वींस स्पोर्ट्स क्लब आयरलैंड बनाम यूएसए, बुलावायो एथलेटिक क्लब गुरुवार, 15 जून नेपाल बनाम ओमान, हरारे स्पोर्ट्स क्लब वेस्ट इंडीज बनाम संयुक्त अरब अमीरात, ताकाशिंगा क्रिकेट क्लब जिम्बाब्वे बनाम स्कॉटलैंड, ओल्ड हैरियंस क्रिकेट क्लब आयरलैंड बनाम नीदरलैंड्स, क्वींस स्पोर्ट्स क्लब श्रीलंका बनाम यूएसए, बुलावायो एथलेटिक क्लब (एएनआई)","pubDate":"2023-05-23 16:51:14","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs CSK, LIVE Cricket Score, IPL 2023 Qualifier 1 in Chennai: GT 59/2, target: 173; Gill, Shanaka rebuild GT innings","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-csk-live-cricket-score-ipl-2023-qualifier-1-match-scorecard-live-update-gujarat-titans-vs-chennai-super-kings-indian-premier-league-live-streaming-today-12636922.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs CSK, LIVE Cricket Score, IPL 2023 Qualifier 1 in Chennai: GT 59/2, target: 173; Gill, Shanaka rebuild GT innings","content":"22:16 (IST)GT vs CSK Qualifier 1 LIVE Score After 9 overs,Gujarat Titans 59/2 ( Shubman Gill 32 , Dasun Shanaka 6) Though Gill firmly sweeps Jadeja towards the vacant midwicket fence to collect his second boundary off the senior left-arm spinner, the last three overs have belonged to the Chennai spinners with Jadeja and Theekshana hardly giving Gill and Dasun Shanaka any room to breathe. Between the two boundaries that Gill collected at the start of the seventh and off the final ball of the ninth, GT collected just 10 runs in 16 balls, with the required rate now going past 10-an-over.22:14 (IST)GT vs CSK Qualifier 1 LIVE Score FOUR! Gill welcomes Jadeja into the attack with a boundary, cutting behind square to collect his third boundary. Gujarat, meanwhile, are yet to reach the 50-mark despite the innings going past the powerplay. GT 45/2  22:07 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 6 overs,Gujarat Titans 41/2 ( Shubman Gill 20 , Dasun Shanaka 0) OUT! Hardik Pandya joins Wriddhiman Saha in the Gujarat Titans dressing room after cutting a short, wide delivery from Maheesh Theekshana straight to Ravindra Jadeja at backward point as Maheesh Theekshana strikes in his first over of the evening! Excellent first over from the Sri Lankan offie with just two coming off it along with Pandya's wicket as the defending champions reach 41/2 at the end of the powerplay, needing another 132 to win off 84. Pandya c Jadeja b Theekshana 8(7)22:01 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 5 overs,Gujarat Titans 39/1 ( Shubman Gill 19 , Hardik Pandya (C) 7) FOUR! Gill waits for the ball to climb, before pulling it over the midwicket region. Wasn't exactly the best of shots from the opener, but manages to send it towards the fence in any case. Ruins what was turning out to be a superb second over from Chahar. Tushar Deshpande, meanwhile, went for 10 in the previous over, conceding a boundary each to GT skipper Pandya and Gill.21:56 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 3 overs,Gujarat Titans 22/1 ( Shubman Gill 9 , Hardik Pandya (C) 0) OUT! Deepak Chahar draws first blood as Wriddhiman Saha holes out to the man standing at deep square leg while looking to clear the boundary rope himself, departing for 12. Skipper Hardik Pandya joins Gill at the centre after Chahar ends what was turning out to be a very expensive over on a good note. Saha c Pathirana b Chahar 12(11)21:54 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score SIX! Shubman Gill collects the first maximum of the Gujarat Titans chase, flicking a full delivery from Deepak Chahar over the fine leg region! GT 15/0  21:44 (IST)After 2 overs,Gujarat Titans 9/0 ( Wriddhiman Saha (W) 7 , Shubman Gill 2) Tushar Deshpande comes into the attack from the other end. In the fifth ball, Gill plays a risky drive Chahar, moving from the mid-on position, makes a diving effort but can only get fingertips on it. Six off the over. 21:39 (IST)After 1 overs,Gujarat Titans 3/0 ( Wriddhiman Saha (W) 2 , Shubman Gill 1) A very tidy start from Deepak Chahar, who opens the bowling for CSK. Just three runs off the first over, with both Wriddhiman Saha and Shubman Gill getting off the mark. 21:37 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Right. Time for the run-chase. Gujarat Titans need 173 runs to win. An impact substation from CSK, who bring in Matheesha Pathirana in place of Shivam Dube. GT, too make a change, with Mohit Sharma making way for Vijay Shankar. 21:16 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score OUT! Pin-drop silence at Chepauk as CSK leader MS Dhoni perishes after hitting straight to his GT counterpart Hardik Pandya standing at cover, perishing for 1 in what potentially is his final appearance at the MA Chidambaram Stadium! Mohit Sharma grabs his second wicket off his penultimate ball of the evening. CSK 155/6 Dhoni c Pandya b Mohit 1(2)21:14 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 18 overs,Chennai Super Kings 148/5 ( Ravindra Jadeja 10 , MS Dhoni (C) (W) 0) OUT! Rashid Khan grabs his only wicket off his final delivery of the evening as Ambati Rayudu perishes right after smashing the Afghan superstar for a maximum over deep square leg, miscuing the ball towards deep midwicket where Dasun Shanaka latches on to the ball to complete the catch. Huge cheer at the Chepauk after Rayudu's dismissal as 'Thala' makes his way to the centre. Rayudu c Shanaka b Rashid 17(9)20:58 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 16 overs,Chennai Super Kings 131/4 ( Ambati Rayudu 6 , Ravindra Jadeja 4) OUT! Chennai continue losing wickets in pairs as Devon Conway, who was set on 40, perishes at the start of Mohammed Shami's third over after holing out to Rashid Khan at deep midwicket. Gujarat once again claw back with two quick wickets just when Chennai appear to be hitting the gas pedal. Tidy third over from Shami, with six coming off it along with the wicket. Two new faces in Jadeja and Rayudu at the centre. Conway c Rashid b Shami 40(34)20:55 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score OUT! Darshan Nalkande finally gets his first wicket of the season as Ajinkya Rahane's cameo comes to an end! After smashing Nalkande for a six in the previous delivery, Rahane ends up cutting a short-of-length ball outside off straight to the fielder at backward point to depart for 17. CSK 121/4 Rahane c Gill b Nalkande 17(10)20:48 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 14 overs,Chennai Super Kings 107/2 ( Devon Conway 35 , Ajinkya Rahane 8) Rashid Khan returns on the other side of the strategic timeout. Though he does not give away any boundaries in his third, Conway and Rahane are able to keep the scoreboard ticking with the ones and twos, with eight coming off the Afghan's third. Chennai's run rate is less than eight at the moment, and they will need a couple of big overs if they are to push for a 180-run total on this surface.20:42 (IST)GT vs CSK LIVE Score After 13 overs,Chennai Super Kings 99/2 ( Devon Conway 31 , Ajinkya Rahane 4) Ahmad signs off with figures of 1/29, dismissing Dube in his final over. Meanwhile, Ajinkya Rahane, who has been one of the standout performers for Chennai this season, joins Conway, who is in dire of a quick burst of runs, at the centre. Darshan Nalkande returns in the 13th over, and he bowls out a tidy over with five coming off the 13th over before the umpire signals for the second time-out of the evening.20:31 (IST)GT vs CSK LIVE Score BOWLED! One wicket quickly leads to another as Noor Ahmad foxes Shivam Dube with the wrong un'. Dube attempts a wild heave towards the midwicket region, with the ball sneaking through his defence after holding its line and crashing into the stumps, uprooting the middle pole. CSK 90/2 Dube b Ahmad 1(3) 20:29 (IST)GT vs CSK LIVE Score OUT! Mohit Sharma with the breakthrough as the Titans finally end the solid opening partnership between Ruturaj Gaikwad and Devon Conway. The former departs after mishitting a short-of-length delivery from the veteran seamer, offering David Miller at long on the easiest of grabs. Departs for 60, scoring another 58 runs getting a reprieve thanks a no-ball by Darshan Nalkande. Gaikwad c Miller b Mohit 60(44)20:27 (IST)GT vs CSK LIVE Score After 10 overs,Chennai Super Kings 85/0 ( Ruturaj Gaikwad 59 , Devon Conway 24) Chennai Super Kings are powering along nicely at the halfway stage of their innings, going at eight-and-a-half an over with Gaikwad batting on 59. They'll be hoping to score even more aggressively in the second half of the innings. For the defending champions, a wicket is an absolute must, and the earlier it comes, the better. 20:18 (IST)GT vs CSK LIVE Score FOUR! Fine way for Ruturaj Gaikwad to bring up his third half-century of the season as well as his 13th overall in the IPL! Decides to take the aerial route against a short, wide delivery from Mohit Sharma, guiding it behind point with the fielder running to his right from third man unable to get to it in time. Gaikwad brings up the milestone in 36 deliveries, collecting six fours along the way! CSK 69/0  20:16 (IST)GT vs CSK LIVE Score After 8 overs,Chennai Super Kings 64/0 ( Ruturaj Gaikwad 46 , Devon Conway 16) Another nine-run over from Rashid, who had been labelled as GT's \"Trump Card\" against CSK on this surface by Virender Sehwag ahead of the game, with Gaikwad collecting another boundary off the spin superstar — this time cutting it behind point. That is followed by a relatively tidy over from Noor with a brace and four singles coming off it. CSK are going at eight-an-over, and they will be hoping to accelerate later on.20:08 (IST)GT vs CSK Qualifier 1 LIVE Score After 6 overs,Chennai Super Kings 49/0 ( Ruturaj Gaikwad 33 , Devon Conway 14) Gujarat Titans decide to deploy their Afghan spin twins for the last two overs of the powerplay. Gaikwad pinches a couple of doubles off Rashid in his first over before going for a lofted drive over the cover region for a boundary in a nine-run over. Noor Ahmed also concedes nine in his first over, both Gaikwad and Conway collecting a boundary each in this over. End of a decent powerplay for Chennai, which could have gone in an entirely different direction had Nalkande not overstepped earlier.19:57 (IST)GT vs CSK Qualifier 1 LIVE Score After 4 overs,Chennai Super Kings 31/0 ( Ruturaj Gaikwad 19 , Devon Conway 10) FOUR! And now Conway collects his first boundary of the evening, guiding the length ball square on the off side by playing it late, ruining what was turning out to be an excellent second over!19:56 (IST)GT vs CSK Qualifier 1 LIVE Score FOUR! And now Shami concedes his first boundary of the evening as Gaikwad decides to push a full, wide delivery from the veteran pacer through the covers for his second four of the evening! CSK 23/0 after 319:54 (IST)GT vs CSK Qualifier 1 LIVE Score After 2 overs, CSK 18/0 (Ruturaj Gaikwad 14, Devon Conway 2) NO BALL! Gaikwad gets a lifeline early after Nalkande dismisses him off what is his third ball of the season, only to find out that he overstepped. To make matters worse for GT, Gaikwad collects a SIX! and a FOUR off the next two balls!19:40 (IST)GT vs CSK Qualifier 1 LIVE Score After 1 over, CSK 4/0 (Ruturaj Gaikwad 2, Devon Conway 1) Tidy start for Shami, with just four coming off it. Gaikwad opens the account for Chennai with a brace off the third delivery, and gets off strike with a leg-bye two balls later. Devon Conway keeps the strike with a single off the last ball.19:38 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Ruturaj Gaikwad walks out to open the Chennai Super Kings innings alongside Devon Conway as Mohammed Shami gears up to bowl the first over. Can Gaikwad and Conway get Chennai off to another solid start? Stay tuned to find out.19:13 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Teams: Gujarat Titans: Shubman Gill, Wriddhiman Saha(w), Hardik Pandya(c), Dasun Shanaka, David Miller, Rahul Tewatia, Rashid Khan, Darshan Nalkande, Mohit Sharma, Noor Ahmad, Mohammed Shami Chennai Super Kings: Ruturaj Gaikwad, Devon Conway, Ajinkya Rahane, Ambati Rayudu, Shivam Dube, Moeen Ali, Ravindra Jadeja, MS Dhoni(w/c), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana19:08 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score MS Dhoni, Chennai Super Kings captain: We wanted to bowl first as well. GT are an excellent side and have chased so well through the tournament. It has been excellent right from the first game. What the guys have shown is maturity. What is important is to learn in the tournament from the start to the end. I feel it will slow down as the game progresses, but a lot depends on the dew factor. It’s the same squad.19:04 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Hardik Pandya, Gujarat Titans captain: We heard dew will be coming in later. If you know you can be in top two, it can be a different pressure. We focused on making sure we keep playing good cricket. The kind of players we have, we don’t just play one style. From batters and bowlers, we have adapted quite well. Just one change, Darshan Nalkande comes in.19:04 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score TOSS: Gujarat Titans win the toss, and skipper Hardik Pandya opts to field 18:55 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score “It is very dry. Rashid Khan and Noor are really going to make an impact. Top six of both sides must get off to a flier. Once they are under pressure, you start getting wickets,” says Matthew Hayden in his analysis of the Chepauk wicket.18:51 (IST)\"You need to be a proper devil to hate Mahendra Singh Dhoni\" Gujarat Titans captain Hardik Pandya opens up on his relationship with Chennai Super Kings leader MS Dhoni, against whom he will be squaring off at the MA Chidambaram Stadium in Chennai later today, adding that MSD was like a brother he could chill around with. Click here to read the full story 18:40 (IST)GT vs CSK, IPL 2023 Qualifier 1 weather update The evening at Chepauk is expected to be hot on Tuesday, with temperatures that could hit 30 °C. The dew factor could play a big part in the run-chase. The chasing team have won four out of seven matches this season at Chepauk. According to the visuals coming in from Chennai the moment, things look pretty clear at the moment in the Tamil Nadu capital.18:30 (IST)Rashid to be GT's trump card against CSK: Sehwag Spin sensation Rashid Khan had started the season on a slow note and had been expensive in his spells early on in the season, but turned things around in style soon enough to not just catch up with the rest of the pack, but to go level with Purple Cap holder Mohammed Shami at the end of the league stage. And according to Indian batting icon Virender Sehwag, he will be key to GT's hopes of beating CSK in Chennai for the first time ever. \"Rashid Khan is the trump card for Gujarat. If they want wickets, they bring him. And then the way Hardik has used Rashid, it is commendable. Rashid likes to break partnerships and now he has become the most successful bowler of this season on the basis of his excellent performance,\" said Sehwag. Click here to read the full story18:16 (IST)  GT vs CSK: Form guide (Last five matches) GT: W W L W W CSK: W L W W NR Both Gujarat and Chennai won each of their last league encounters; while CSK thrashed Delhi Capitals by 77 runs at the Arun Jaitley Stadium to confirm a second-place finish, GT chased down the 198-run target set by Royal Challengers Bangalore in Bengaluru to knock them out of the playoffs race.18:00 (IST)Gujarat Titans vs Chennai Super Kings head-to-head record: 17 April 2022 in Pune: Gujarat Titans won by three wickets 15 May 2022 in Mumbai (Wankhede): Gujarat Titans won by seven wickets 31 March 2023 in Ahmedabad: Gujarat Titans won by five wickets17:45 (IST)CSK, at Chepauk, stand in GT's way of second straight final IPL Qualifier 1 will see these similar yet very different teams go against each other at Chepauk in what is expected to be a cracker of a contest. CSK will enjoy home advantage but they’ve not been as impregnable at home as in the past. Gujarat Titans, meanwhile, will now hope they’ve shed the weary legs and minds after playing late on Sunday night and the travel that came after it. Click here to read the IPL 2023 Qualifier 1 Preview17:28 (IST)Hello and welcome to our coverage of the 2023 Indian Premier League (IPL) Qualifier 1, with defending champions Gujarat Titans taking on four-time winners Chennai Super Kings at the MA Chidambaram Stadium in Chennai with the winner of today's game directly qualifying for the final. GT vs CSK Qualifier 1 LIVE Score: GT 59/2 after 9; Though Shubman Gill manages to collect the odd boundary ever now and then, the Chennai Super Kings spinners are keeping things tight in the overs after the powerplay. GT vs CSK Qualifier 1 preview: Defending champions Gujarat Titans take on four-time winners Chennai Super Kings in Qualifier 1 as 2023 Indian Premier League (IPL) playoffs get underway at the MA Chidambaram Stadium in Chennai on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ GT and CSK, the two teams that squared off in the tournament opener at Ahmedabad’s Narendra Modi Stadium on 31 March, finished in the top two slots with 20 and 17 points respectively with the Titans topping the table for a second season in a row since making their debut last year along with the Lucknow Super Giants (LSG). CSK were tied with LSG on 17 points, given the fixture between the two at Lucknow’s Ekana Stadium earlier this month had been rained off, but finished ahead on the table due to their superior Net Run Rate. As far as the head-to-head record between the two teams goes, it’s 3-0 in favour of Gujarat at the moment. The Hardik Pandya-led side have pulled off a hat-trick of chases against MS Dhoni and Co — winning by three wickets and seven wickets last season. In the first game of the 16th edition, Gujarat managed to chase down the 179-run target set by Chennai with five wickets and four deliveries to spare. While the winner of this contest progresses directly into the final that takes place at the Narendra Modi Stadium this Sunday, the loser will have another shot at making the final as they take on the winner of the Eliminator between LSG and Mumbai Indians, which takes place on Wednesday, 24 May. Teams: Gujarat Titans: Shubman Gill, Wriddhiman Saha(w), Hardik Pandya(c), Dasun Shanaka, David Miller, Rahul Tewatia, Rashid Khan, Darshan Nalkande, Mohit Sharma, Noor Ahmad, Mohammed Shami Chennai Super Kings: Ruturaj Gaikwad, Devon Conway, Ajinkya Rahane, Ambati Rayudu, Shivam Dube, Moeen Ali, Ravindra Jadeja, MS Dhoni(w/c), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-23 16:48:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Deepak-Chahar-celebrates-IPL-2023-Qualifier-1-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"रिद्धिमान साहा के खिलाफ फील्डिंग सजाने की सबसे बड़ी 'साजिश', धोनी का सानी नहीं","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/wriddhiman-saha-traps-in-ms-dhoni-plan-gt-vs-csk-ipl-2023/articleshow/100454307.cms","keywords":null,"creator":null,"video_url":null,"description":"GT vs CSK: महेंद्र सिंह धोनी ने आईपीएल 2023 में एक बार फिर अपनी कप्तानी का लोहा मनवाया। उन्होंने गुजरात टाइटंस के ओपनर रिद्धिमान साहा के लिए जो जाल बिछाया था, वो उसमें फंस गए। चेन्नई सुपर किंग्स और गुजरात टाइटंस के बीच सीजन का पहला क्वालिफायर खेला जा रहा है।","content":"महेंद्र सिंह धोनी (MS Dhoni) 2007 से कप्तानी कर रहे हैं। भारत के साथ ही वह आईपीएल के सबसे सफल कप्तानों में शामिल हैं। 41 साल की उम्र में भी वह चेन्नई सुपर किंग्स के लिए आईपीएल (IPL 2023) में खेल रहे हैं। भले ही उनका बल्ला पहले जैसा नहीं चल रहा लेकिन कप्तानी और प्लानिंग में धोनी आज भी भारी पड़ रहे हैं। गुजरात टाइटंस और चेन्नई सुपर किंग्स (GT vs CSK) के बीच खेले जा रहे आईपीएल 2023 के पहले क्वालिफायर में एक बार फिर मास्टरमाइंड धोनी देखने को मिले। गुजरात टाइटंस के बल्लेबाज रिद्धिमान साहा काफी पुल शॉट खेलते हैं। पटकी हुई गेंद देखने ही वह पुल शॉट लगा देते हैं। चेपॉक की पिच धीमी है और कई बार गेंद फंसकर आती है और यह शॉट खेलना मुश्किल हो जाता है। ऐसे में धोनी ने डीप स्क्वायर लेग के फील्डर को बाउंड्री लाइन से काफी अंदर खड़ा किया। दीपक चाहर ने तीसरे ओवर की अंतिम गेंद पटकी हुई फेंकी और साहा ने इसे पुल किया। गेंद सीधे धोनी के लगाए फील्डर के हाथों में चली गई। जब साहा का विकेट गिरा तो दीपक चाहर का रिक्शन साफ बता रहा था कि प्लानिंग काम कर गई। महेंद्र सिंह धोनी के चेहरे पर भी संतुष्टि साफ दिख रही थी। क्योंकि साहा गुजरात के लिए पावरप्ले में काफी तेजी से रन बनाते हैं। इस मैच में उन्होंने 11 गेंदों पर 12 रनों की पारी खेली। चेन्नई सुपरकिंग्स ने इंडियन प्रीमियर लीग के पहले क्वालीफायर मैच में गुजरात टाइटंस के खिलाफ पहले बल्लेबाजी करते हुए सात विकेट पर 172 रन बनाये। चेन्नई के लिए सलामी बल्लेबाज रुतुराज गायकवाड़ ने सबसे ज्यादा 60 रन बनाये। गुजरात ने दूसरे ही ओवर में उन्हें जीवनदान दिया था। गुजरात के लिए मोहित शर्मा और मोहम्मद शमी ने दो-दो विकेट लिये।","pubDate":"2023-05-23 16:46:23","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पुरुषों का क्रिकेट विश्व कप 2023: आईसीसी ने क्वालीफायर के लिए वार्म-अप कार्यक्रम जारी किए","link":"https://jantaserishta.com/sports/mens-cricket-world-cup-2023-icc-releases-warm-up-fixtures-for-qualifier-2367861","keywords":["खेल"],"creator":["Gulabi Jagat"],"video_url":null,"description":null,"content":"दुबई (एएनआई): आ ईसीसी द्वारा जिम्बाब्वे में आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर टूर्नामेंट से पहले वार्म-अप जुड़नार की पुष्टि की गई है। सभी 10 टीमें 18 जून को क्वालीफ़ायर की शुरुआत से पहले कुल दो अभ्यास मैच खेलेंगी, जिसमें पक्षों को महत्वपूर्ण इवेंट की शुरुआत से पहले कुछ मूल्यवान मैच अभ्यास प्राप्त करने होंगे। ICC के अनुसार गुरुवार 15 जून को उसी सप्ताह के दौरान होने वाले खेलों के दूसरे सेट के साथ वार्म-अप जुड़नार के शुरुआती दिन मंगलवार, 13 जून को हर टीम एक्शन में होगी। क्वालीफायर के लिए जिम्बाब्वे में 10 टीमें साल के अंत में 2023 विश्व कप में दो स्थानों के लिए संघर्ष कर रही हैं, शीर्ष दो टीमें सुपर सिक्स चरण के पूरा होने पर फाइनल में पहुंच रही हैं और एक स्थान अर्जित कर रही हैं। 50 ओवर का शोकेस। ICC ने आगामी ICC मेन्स क्रिकेट वर्ल्ड कप 2023 के क्वालीफायर मैचों के कार्यक्रम की भी घोषणा की है। दो बार के विजेता वेस्टइंडीज और 1996 के चैंपियन श्रीलंका आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर के लिए अलग-अलग समूहों में हैं जो 18 जून से 9 जुलाई के बीच जिम्बाब्वे में होंगे। टूर्नामेंट के मेजबान जिम्बाब्वे, नीदरलैंड, नेपाल और संयुक्त राज्य अमेरिका के साथ ग्रुप ए में वेस्टइंडीज को ड्रा किया गया। और श्रीलंका ग्रुप बी में है जहां द्वीप राष्ट्र को आयरलैंड, स्कॉटलैंड, ओमान और संयुक्त अरब अमीरात के खिलाफ मैच खेलने हैं। वार्म-अप जुड़नार: मंगलवार, 13 जून वेस्टइंडीज बनाम स्कॉटलैंड, हरारे स्पोर्ट्स क्लब जिम्बाब्वे बनाम ओमान, ताकाशिंगा क्रिकेट क्लब नेपाल बनाम यूएई, ओल्ड हैरियंस क्रिकेट क्लब श्रीलंका बनाम नीदरलैंड, क्वींस स्पोर्ट्स क्लब आयरलैंड बनाम यूएसए, बुलावायो एथलेटिक क्लब गुरुवार, 15 जून नेपाल बनाम ओमान, हरारे स्पोर्ट्स क्लब वेस्ट इंडीज बनाम संयुक्त अरब अमीरात, ताकाशिंगा क्रिकेट क्लब जिम्बाब्वे बनाम स्कॉटलैंड, ओल्ड हैरियंस क्रिकेट क्लब आयरलैंड बनाम नीदरलैंड्स, क्वींस स्पोर्ट्स क्लब श्रीलंका बनाम यूएसए, बुलावायो एथलेटिक क्लब (एएनआई)","pubDate":"2023-05-23 16:40:48","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एलेप्पी एक्सप्रेस पर सवार थे धोनी लेकिन मोहित ने चेन खींच दी, चेले ने ही थाला को फंसाया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ms-dhoni-out-on-just-1-run-by-mohit-sharma-in-ipl-qualifier-1-csk-vs-gt/articleshow/100453936.cms","keywords":null,"creator":null,"video_url":null,"description":"CSK vs GT Highlights: गुजरात टाइटंस के खिलाफ आईपीएल 2023 के ओपनिंग मैच में 7 गेंद में नाबाद 14 रन बनाने वाले माही इस बार 2 गेंद में सिर्फ 1 रन बनाकर आउट हो गए। मोहित शर्मा ने उन्हें स्लोअर में फंसाया।","content":null,"pubDate":"2023-05-23 16:35:52","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies batter Devon Thomas suspended for alleged fixing in Lanka Premier League","link":"https://indianexpress.com/article/sports/cricket/west-indies-batter-devon-thomas-suspended-for-alleged-fixing-in-lanka-premier-league-8625306/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-23 16:30:01","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"GT vs CSK: Noor Ahmad castles Shivam Dube with unplayable delivery; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-csk-noor-ahmad-castles-shivam-dube-with-unplayable-delivery-watch-video-12637992.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs CSK: Noor Ahmad castles Shivam Dube with unplayable delivery; watch video","content":"Gujarat Titans’ (GT) Afghan spinner Noor Ahmad has been in fine form this Indian Premier League (IPL) season, and maintained it with the dismissal of Chennai Super Kings’ (CSK) Shivam Dube during Qualifier 1 at Chepauk on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Noor was bowling the 12th over of the CSK innings. He delivered a full length ball on off, but the ball ended up spinning sharply, and that eventually deceived Dube, dismantling the leg stump. You miss, I hit 😎 Noor Ahmad gets Shivam Dube with a beauty 🎯 Follow the match ▶️ https://t.co/LRYaj7cLY9#TATAIPL | #Qualifier1 | #GTvCSK pic.twitter.com/OjtjAsXLXT — IndianPremierLeague (@IPL) May 23, 2023 Dube, who has been impressive with the bat this season, scoring 386 runs from 15 matches, was dismissed just for one run. With the wicket, Noor Ahmad improved his wickets tally to 14 scalps from 11 matches. The winner of the GT vs CSK Qualifier 1 contest earns direct qualification to Sunday’s final in Ahmedabad, while the losing team takes on the winners of Wednesday’s Eliminator between Lucknow Super Giants (LSG) and Mumbai Indians (MI). Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-23 16:27:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Noor-Ahmad-GT-vs-CSK-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies batter Devon Thomas charged with match fixing by ICC","link":"https://telanganatoday.com/west-indies-batter-devon-thomas-charged-with-match-fixing-by-icc","keywords":["News","Sport","Devon Thomas","ICC","match fixing","West Indies"],"creator":["AP"],"video_url":null,"description":"ICC laid seven charges against Thomas relating to attempting to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence","content":"Dubai: West Indies batter Devon Thomas was charged with match fixing by the International Cricket Council and provisionally banned from playing on Tuesday. The ICC laid seven charges against Thomas relating to attempting to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence. Four of the charges relate to matches in the Lanka Premier League Twenty20 tournament in Sri Lanka in 2021. Two relate to matches in the Caribbean Premier League T20 competition in the same year and one relates to matches in the T10 Cricket League in United Arab Emirates, also in 2021. The 33-year-old Thomas has 14 days from Tuesday to respond to the charges, the Dubai-based ICC said.Thomas has played 21 one-day internationals, although his last came 10 years ago. He has played in 12 T20 games for West Indies between 2009 and 2022. His only test appearance came against Australia in December.","pubDate":"2023-05-23 16:20:45","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies cricketer Devon Thomas handed ICC ban after being charged with match-fixing","link":"https://7news.com.au/sport/cricket/west-indies-cricketer-devon-thomas-handed-icc-ban-after-being-charged-with-match-fixing-c-10749023","keywords":null,"creator":["Digital Staff"],"video_url":null,"description":"The batter, who played against Australia last summer, is also accused of concealing and destroying evidence.","content":"West Indies batter Devon Thomas, who played a Test match against in December, has been charged with match-fixing by the and provisionally banned from playing. The ICC laid seven charges against Thomas relating to alleged attempts to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence. Watch, Stream & Catch Up with Australia's Home of Cricket on Four of the charges relate to matches in the Sri Lanka Premier League T20 tournament in 2021. Two relate to matches in the Caribbean Premier League T20 competition in the same year. One relates to matches in the T10 Cricket League in the United Arab Emirates, also in 2021. The ICC, in a release, also claimed that Thomas did not co-operate with the anti-corruption officials during the investigation. Besides the fixing allegation, the governing body also charged the 33-year-old with allegedly failing to report corrupt approaches. Thomas has 14 days to respond to the charges, the Dubai-based ICC said on Tuesday. Thomas’s only Test appearance came against Australia in December at Adelaide Oval. He made 19 and 12 as the hosts won by 419 runs. He did not play in subsequent Tests in Zimbabwe and South Africa. Thomas has played 21 one-day internationals, although his last came 10 years ago. He has played in 12 T20 games for West Indies between 2009 and 2022.","pubDate":"2023-05-23 22:22:49","image_url":"https://images.7news.com.au/publication/C-10749023/4d501df89ba4add404f4dcbdf43cba77fede4d41-16x9-x0y0w1280h720.jpg","source_id":"7news","category":["sports"],"country":["australia"],"language":"english"},{"title":"West Indies batter Thomas suspended for match-fixing","link":"https://www.samaaenglish.tv/news/40036292/sports-west-indies-batter-thomas-suspended-for-match-fixing","keywords":["Sports"],"creator":null,"video_url":null,"description":"West Indies batter Devon Thomas has been provisionally banned for match-fixing, the International Cricket Council (ICC) announced on Tuesday. Thomas, 33, who has represented his country in all three formats, has been charged with breaching rules by three governing bodies. “The International Cricket Council (ICC), on behalf of Sri Lanka Cricket (SLC), the Emirates Cricket Board (ECB) and the Caribbean Premier League (CPL), has charged West Indies player Devon Thomas with seven counts under their anti-corruption codes and he has been provisionally suspended with immediate effect,” the ICC said. “Mr Thomas has 14 days from 23 May 2023 to respond to the charges,” it added. Thomas, has been named in the West Indies’ squad for next month’s one-day series with the UAE. “CWI (Cricket West Indies) is not directly involved in the process but remains firm in denouncing corruption in cricket, and fully supports the ICC ACU in its efforts to uphold the integrity of the sport,” the body said. “In collaboration with ICC and the West Indies Players’ Association (WIPA), CWI remains committed to sensitizing and educating our players and officials on anti-corruption in sports,” it added.","content":"Thomas, 33, who has represented his country in all three formats, has been charged with breaching rules by three governing bodies. “The International Cricket Council (ICC), on behalf of Sri Lanka Cricket (SLC), the Emirates Cricket Board (ECB) and the Caribbean Premier League (CPL), has charged West Indies player Devon Thomas with seven counts under their anti-corruption codes and he has been provisionally suspended with immediate effect,” the ICC said. “Mr Thomas has 14 days from 23 May 2023 to respond to the charges,” it added. Thomas, has been named in the West Indies’ squad for next month’s one-day series with the UAE. “CWI (Cricket West Indies) is not directly involved in the process but remains firm in denouncing corruption in cricket, and fully supports the ICC ACU in its efforts to uphold the integrity of the sport,” the body said. “In collaboration with ICC and the West Indies Players’ Association (WIPA), CWI remains committed to sensitizing and educating our players and officials on anti-corruption in sports,” it added.","pubDate":"2023-05-23 18:42:54","image_url":"https://i.samaaenglish.tv/large/2023/05/232342425e40437.jpg?r=234254","source_id":"samaaenglish","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"पुरुषों का क्रिकेट विश्व कप 2023: आईसीसी ने क्वालीफायर के लिए वार्म-अप कार्यक्रम जारी किए","link":"https://jantaserishta.com/sports/mens-cricket-world-cup-2023-icc-releases-warm-up-schedule-for-qualifiers-2367895","keywords":["खेल"],"creator":["Rani Sahu"],"video_url":null,"description":null,"content":"दुबई (एएनआई): आईसीसी द्वारा जिम्बाब्वे में आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर टूर्नामेंट से पहले वार्म-अप जुड़नार की पुष्टि की गई है। सभी 10 टीमें 18 जून को क्वालीफ़ायर की शुरुआत से पहले कुल दो अभ्यास मैच खेलेंगी, जिसमें पक्षों को महत्वपूर्ण इवेंट की शुरुआत से पहले कुछ मूल्यवान मैच अभ्यास प्राप्त करने होंगे। ICC के अनुसार गुरुवार 15 जून को उसी सप्ताह के दौरान होने वाले खेलों के दूसरे सेट के साथ वार्म-अप जुड़नार के शुरुआती दिन मंगलवार, 13 जून को हर टीम एक्शन में होगी। क्वालीफायर के लिए जिम्बाब्वे में 10 टीमें साल के अंत में 2023 विश्व कप में दो स्थानों के लिए संघर्ष कर रही हैं, शीर्ष दो टीमें सुपर सिक्स चरण के पूरा होने पर फाइनल में पहुंच रही हैं और एक स्थान अर्जित कर रही हैं। 50 ओवर का शोकेस। ICC ने आगामी ICC मेन्स क्रिकेट वर्ल्ड कप 2023 के क्वालीफायर मैचों के कार्यक्रम की भी घोषणा की है। दो बार के विजेता वेस्टइंडीज और 1996 के चैंपियन श्रीलंका आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर के लिए अलग-अलग समूहों में हैं जो 18 जून से 9 जुलाई के बीच जिम्बाब्वे में होंगे। टूर्नामेंट के मेजबान जिम्बाब्वे, नीदरलैंड, नेपाल और संयुक्त राज्य अमेरिका के साथ ग्रुप ए में वेस्टइंडीज को ड्रा किया गया। और श्रीलंका ग्रुप बी में है जहां द्वीप राष्ट्र को आयरलैंड, स्कॉटलैंड, ओमान और संयुक्त अरब अमीरात के खिलाफ मैच खेलने हैं। वार्म-अप जुड़नार: मंगलवार, 13 जून वेस्टइंडीज बनाम स्कॉटलैंड, हरारे स्पोर्ट्स क्लब जिम्बाब्वे बनाम ओमान, ताकाशिंगा क्रिकेट क्लब नेपाल बनाम यूएई, ओल्ड हैरियंस क्रिकेट क्लब श्रीलंका बनाम नीदरलैंड, क्वींस स्पोर्ट्स क्लब आयरलैंड बनाम यूएसए, बुलावायो एथलेटिक क्लब गुरुवार, 15 जून नेपाल बनाम ओमान, हरारे स्पोर्ट्स क्लब वेस्ट इंडीज बनाम संयुक्त अरब अमीरात, ताकाशिंगा क्रिकेट क्लब जिम्बाब्वे बनाम स्कॉटलैंड, ओल्ड हैरियंस क्रिकेट क्लब आयरलैंड बनाम नीदरलैंड्स, क्वींस स्पोर्ट्स क्लब श्रीलंका बनाम यूएसए, बुलावायो एथलेटिक क्लब (एएनआई)","pubDate":"2023-05-23 16:51:14","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"GT vs CSK, LIVE Cricket Score, IPL 2023 Qualifier 1 in Chennai: GT 59/2, target: 173; Gill, Shanaka rebuild GT innings","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-csk-live-cricket-score-ipl-2023-qualifier-1-match-scorecard-live-update-gujarat-titans-vs-chennai-super-kings-indian-premier-league-live-streaming-today-12636922.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs CSK, LIVE Cricket Score, IPL 2023 Qualifier 1 in Chennai: GT 59/2, target: 173; Gill, Shanaka rebuild GT innings","content":"22:16 (IST)GT vs CSK Qualifier 1 LIVE Score After 9 overs,Gujarat Titans 59/2 ( Shubman Gill 32 , Dasun Shanaka 6) Though Gill firmly sweeps Jadeja towards the vacant midwicket fence to collect his second boundary off the senior left-arm spinner, the last three overs have belonged to the Chennai spinners with Jadeja and Theekshana hardly giving Gill and Dasun Shanaka any room to breathe. Between the two boundaries that Gill collected at the start of the seventh and off the final ball of the ninth, GT collected just 10 runs in 16 balls, with the required rate now going past 10-an-over.22:14 (IST)GT vs CSK Qualifier 1 LIVE Score FOUR! Gill welcomes Jadeja into the attack with a boundary, cutting behind square to collect his third boundary. Gujarat, meanwhile, are yet to reach the 50-mark despite the innings going past the powerplay. GT 45/2  22:07 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 6 overs,Gujarat Titans 41/2 ( Shubman Gill 20 , Dasun Shanaka 0) OUT! Hardik Pandya joins Wriddhiman Saha in the Gujarat Titans dressing room after cutting a short, wide delivery from Maheesh Theekshana straight to Ravindra Jadeja at backward point as Maheesh Theekshana strikes in his first over of the evening! Excellent first over from the Sri Lankan offie with just two coming off it along with Pandya's wicket as the defending champions reach 41/2 at the end of the powerplay, needing another 132 to win off 84. Pandya c Jadeja b Theekshana 8(7)22:01 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 5 overs,Gujarat Titans 39/1 ( Shubman Gill 19 , Hardik Pandya (C) 7) FOUR! Gill waits for the ball to climb, before pulling it over the midwicket region. Wasn't exactly the best of shots from the opener, but manages to send it towards the fence in any case. Ruins what was turning out to be a superb second over from Chahar. Tushar Deshpande, meanwhile, went for 10 in the previous over, conceding a boundary each to GT skipper Pandya and Gill.21:56 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 3 overs,Gujarat Titans 22/1 ( Shubman Gill 9 , Hardik Pandya (C) 0) OUT! Deepak Chahar draws first blood as Wriddhiman Saha holes out to the man standing at deep square leg while looking to clear the boundary rope himself, departing for 12. Skipper Hardik Pandya joins Gill at the centre after Chahar ends what was turning out to be a very expensive over on a good note. Saha c Pathirana b Chahar 12(11)21:54 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score SIX! Shubman Gill collects the first maximum of the Gujarat Titans chase, flicking a full delivery from Deepak Chahar over the fine leg region! GT 15/0  21:44 (IST)After 2 overs,Gujarat Titans 9/0 ( Wriddhiman Saha (W) 7 , Shubman Gill 2) Tushar Deshpande comes into the attack from the other end. In the fifth ball, Gill plays a risky drive Chahar, moving from the mid-on position, makes a diving effort but can only get fingertips on it. Six off the over. 21:39 (IST)After 1 overs,Gujarat Titans 3/0 ( Wriddhiman Saha (W) 2 , Shubman Gill 1) A very tidy start from Deepak Chahar, who opens the bowling for CSK. Just three runs off the first over, with both Wriddhiman Saha and Shubman Gill getting off the mark. 21:37 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Right. Time for the run-chase. Gujarat Titans need 173 runs to win. An impact substation from CSK, who bring in Matheesha Pathirana in place of Shivam Dube. GT, too make a change, with Mohit Sharma making way for Vijay Shankar. 21:16 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score OUT! Pin-drop silence at Chepauk as CSK leader MS Dhoni perishes after hitting straight to his GT counterpart Hardik Pandya standing at cover, perishing for 1 in what potentially is his final appearance at the MA Chidambaram Stadium! Mohit Sharma grabs his second wicket off his penultimate ball of the evening. CSK 155/6 Dhoni c Pandya b Mohit 1(2)21:14 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 18 overs,Chennai Super Kings 148/5 ( Ravindra Jadeja 10 , MS Dhoni (C) (W) 0) OUT! Rashid Khan grabs his only wicket off his final delivery of the evening as Ambati Rayudu perishes right after smashing the Afghan superstar for a maximum over deep square leg, miscuing the ball towards deep midwicket where Dasun Shanaka latches on to the ball to complete the catch. Huge cheer at the Chepauk after Rayudu's dismissal as 'Thala' makes his way to the centre. Rayudu c Shanaka b Rashid 17(9)20:58 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 16 overs,Chennai Super Kings 131/4 ( Ambati Rayudu 6 , Ravindra Jadeja 4) OUT! Chennai continue losing wickets in pairs as Devon Conway, who was set on 40, perishes at the start of Mohammed Shami's third over after holing out to Rashid Khan at deep midwicket. Gujarat once again claw back with two quick wickets just when Chennai appear to be hitting the gas pedal. Tidy third over from Shami, with six coming off it along with the wicket. Two new faces in Jadeja and Rayudu at the centre. Conway c Rashid b Shami 40(34)20:55 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score OUT! Darshan Nalkande finally gets his first wicket of the season as Ajinkya Rahane's cameo comes to an end! After smashing Nalkande for a six in the previous delivery, Rahane ends up cutting a short-of-length ball outside off straight to the fielder at backward point to depart for 17. CSK 121/4 Rahane c Gill b Nalkande 17(10)20:48 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score After 14 overs,Chennai Super Kings 107/2 ( Devon Conway 35 , Ajinkya Rahane 8) Rashid Khan returns on the other side of the strategic timeout. Though he does not give away any boundaries in his third, Conway and Rahane are able to keep the scoreboard ticking with the ones and twos, with eight coming off the Afghan's third. Chennai's run rate is less than eight at the moment, and they will need a couple of big overs if they are to push for a 180-run total on this surface.20:42 (IST)GT vs CSK LIVE Score After 13 overs,Chennai Super Kings 99/2 ( Devon Conway 31 , Ajinkya Rahane 4) Ahmad signs off with figures of 1/29, dismissing Dube in his final over. Meanwhile, Ajinkya Rahane, who has been one of the standout performers for Chennai this season, joins Conway, who is in dire of a quick burst of runs, at the centre. Darshan Nalkande returns in the 13th over, and he bowls out a tidy over with five coming off the 13th over before the umpire signals for the second time-out of the evening.20:31 (IST)GT vs CSK LIVE Score BOWLED! One wicket quickly leads to another as Noor Ahmad foxes Shivam Dube with the wrong un'. Dube attempts a wild heave towards the midwicket region, with the ball sneaking through his defence after holding its line and crashing into the stumps, uprooting the middle pole. CSK 90/2 Dube b Ahmad 1(3) 20:29 (IST)GT vs CSK LIVE Score OUT! Mohit Sharma with the breakthrough as the Titans finally end the solid opening partnership between Ruturaj Gaikwad and Devon Conway. The former departs after mishitting a short-of-length delivery from the veteran seamer, offering David Miller at long on the easiest of grabs. Departs for 60, scoring another 58 runs getting a reprieve thanks a no-ball by Darshan Nalkande. Gaikwad c Miller b Mohit 60(44)20:27 (IST)GT vs CSK LIVE Score After 10 overs,Chennai Super Kings 85/0 ( Ruturaj Gaikwad 59 , Devon Conway 24) Chennai Super Kings are powering along nicely at the halfway stage of their innings, going at eight-and-a-half an over with Gaikwad batting on 59. They'll be hoping to score even more aggressively in the second half of the innings. For the defending champions, a wicket is an absolute must, and the earlier it comes, the better. 20:18 (IST)GT vs CSK LIVE Score FOUR! Fine way for Ruturaj Gaikwad to bring up his third half-century of the season as well as his 13th overall in the IPL! Decides to take the aerial route against a short, wide delivery from Mohit Sharma, guiding it behind point with the fielder running to his right from third man unable to get to it in time. Gaikwad brings up the milestone in 36 deliveries, collecting six fours along the way! CSK 69/0  20:16 (IST)GT vs CSK LIVE Score After 8 overs,Chennai Super Kings 64/0 ( Ruturaj Gaikwad 46 , Devon Conway 16) Another nine-run over from Rashid, who had been labelled as GT's \"Trump Card\" against CSK on this surface by Virender Sehwag ahead of the game, with Gaikwad collecting another boundary off the spin superstar — this time cutting it behind point. That is followed by a relatively tidy over from Noor with a brace and four singles coming off it. CSK are going at eight-an-over, and they will be hoping to accelerate later on.20:08 (IST)GT vs CSK Qualifier 1 LIVE Score After 6 overs,Chennai Super Kings 49/0 ( Ruturaj Gaikwad 33 , Devon Conway 14) Gujarat Titans decide to deploy their Afghan spin twins for the last two overs of the powerplay. Gaikwad pinches a couple of doubles off Rashid in his first over before going for a lofted drive over the cover region for a boundary in a nine-run over. Noor Ahmed also concedes nine in his first over, both Gaikwad and Conway collecting a boundary each in this over. End of a decent powerplay for Chennai, which could have gone in an entirely different direction had Nalkande not overstepped earlier.19:57 (IST)GT vs CSK Qualifier 1 LIVE Score After 4 overs,Chennai Super Kings 31/0 ( Ruturaj Gaikwad 19 , Devon Conway 10) FOUR! And now Conway collects his first boundary of the evening, guiding the length ball square on the off side by playing it late, ruining what was turning out to be an excellent second over!19:56 (IST)GT vs CSK Qualifier 1 LIVE Score FOUR! And now Shami concedes his first boundary of the evening as Gaikwad decides to push a full, wide delivery from the veteran pacer through the covers for his second four of the evening! CSK 23/0 after 319:54 (IST)GT vs CSK Qualifier 1 LIVE Score After 2 overs, CSK 18/0 (Ruturaj Gaikwad 14, Devon Conway 2) NO BALL! Gaikwad gets a lifeline early after Nalkande dismisses him off what is his third ball of the season, only to find out that he overstepped. To make matters worse for GT, Gaikwad collects a SIX! and a FOUR off the next two balls!19:40 (IST)GT vs CSK Qualifier 1 LIVE Score After 1 over, CSK 4/0 (Ruturaj Gaikwad 2, Devon Conway 1) Tidy start for Shami, with just four coming off it. Gaikwad opens the account for Chennai with a brace off the third delivery, and gets off strike with a leg-bye two balls later. Devon Conway keeps the strike with a single off the last ball.19:38 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Ruturaj Gaikwad walks out to open the Chennai Super Kings innings alongside Devon Conway as Mohammed Shami gears up to bowl the first over. Can Gaikwad and Conway get Chennai off to another solid start? Stay tuned to find out.19:13 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Teams: Gujarat Titans: Shubman Gill, Wriddhiman Saha(w), Hardik Pandya(c), Dasun Shanaka, David Miller, Rahul Tewatia, Rashid Khan, Darshan Nalkande, Mohit Sharma, Noor Ahmad, Mohammed Shami Chennai Super Kings: Ruturaj Gaikwad, Devon Conway, Ajinkya Rahane, Ambati Rayudu, Shivam Dube, Moeen Ali, Ravindra Jadeja, MS Dhoni(w/c), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana19:08 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score MS Dhoni, Chennai Super Kings captain: We wanted to bowl first as well. GT are an excellent side and have chased so well through the tournament. It has been excellent right from the first game. What the guys have shown is maturity. What is important is to learn in the tournament from the start to the end. I feel it will slow down as the game progresses, but a lot depends on the dew factor. It’s the same squad.19:04 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score Hardik Pandya, Gujarat Titans captain: We heard dew will be coming in later. If you know you can be in top two, it can be a different pressure. We focused on making sure we keep playing good cricket. The kind of players we have, we don’t just play one style. From batters and bowlers, we have adapted quite well. Just one change, Darshan Nalkande comes in.19:04 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score TOSS: Gujarat Titans win the toss, and skipper Hardik Pandya opts to field 18:55 (IST)GT vs CSK, IPL 2023 Qualifier 1 LIVE Score “It is very dry. Rashid Khan and Noor are really going to make an impact. Top six of both sides must get off to a flier. Once they are under pressure, you start getting wickets,” says Matthew Hayden in his analysis of the Chepauk wicket.18:51 (IST)\"You need to be a proper devil to hate Mahendra Singh Dhoni\" Gujarat Titans captain Hardik Pandya opens up on his relationship with Chennai Super Kings leader MS Dhoni, against whom he will be squaring off at the MA Chidambaram Stadium in Chennai later today, adding that MSD was like a brother he could chill around with. Click here to read the full story 18:40 (IST)GT vs CSK, IPL 2023 Qualifier 1 weather update The evening at Chepauk is expected to be hot on Tuesday, with temperatures that could hit 30 °C. The dew factor could play a big part in the run-chase. The chasing team have won four out of seven matches this season at Chepauk. According to the visuals coming in from Chennai the moment, things look pretty clear at the moment in the Tamil Nadu capital.18:30 (IST)Rashid to be GT's trump card against CSK: Sehwag Spin sensation Rashid Khan had started the season on a slow note and had been expensive in his spells early on in the season, but turned things around in style soon enough to not just catch up with the rest of the pack, but to go level with Purple Cap holder Mohammed Shami at the end of the league stage. And according to Indian batting icon Virender Sehwag, he will be key to GT's hopes of beating CSK in Chennai for the first time ever. \"Rashid Khan is the trump card for Gujarat. If they want wickets, they bring him. And then the way Hardik has used Rashid, it is commendable. Rashid likes to break partnerships and now he has become the most successful bowler of this season on the basis of his excellent performance,\" said Sehwag. Click here to read the full story18:16 (IST)  GT vs CSK: Form guide (Last five matches) GT: W W L W W CSK: W L W W NR Both Gujarat and Chennai won each of their last league encounters; while CSK thrashed Delhi Capitals by 77 runs at the Arun Jaitley Stadium to confirm a second-place finish, GT chased down the 198-run target set by Royal Challengers Bangalore in Bengaluru to knock them out of the playoffs race.18:00 (IST)Gujarat Titans vs Chennai Super Kings head-to-head record: 17 April 2022 in Pune: Gujarat Titans won by three wickets 15 May 2022 in Mumbai (Wankhede): Gujarat Titans won by seven wickets 31 March 2023 in Ahmedabad: Gujarat Titans won by five wickets17:45 (IST)CSK, at Chepauk, stand in GT's way of second straight final IPL Qualifier 1 will see these similar yet very different teams go against each other at Chepauk in what is expected to be a cracker of a contest. CSK will enjoy home advantage but they’ve not been as impregnable at home as in the past. Gujarat Titans, meanwhile, will now hope they’ve shed the weary legs and minds after playing late on Sunday night and the travel that came after it. Click here to read the IPL 2023 Qualifier 1 Preview17:28 (IST)Hello and welcome to our coverage of the 2023 Indian Premier League (IPL) Qualifier 1, with defending champions Gujarat Titans taking on four-time winners Chennai Super Kings at the MA Chidambaram Stadium in Chennai with the winner of today's game directly qualifying for the final. GT vs CSK Qualifier 1 LIVE Score: GT 59/2 after 9; Though Shubman Gill manages to collect the odd boundary ever now and then, the Chennai Super Kings spinners are keeping things tight in the overs after the powerplay. GT vs CSK Qualifier 1 preview: Defending champions Gujarat Titans take on four-time winners Chennai Super Kings in Qualifier 1 as 2023 Indian Premier League (IPL) playoffs get underway at the MA Chidambaram Stadium in Chennai on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ GT and CSK, the two teams that squared off in the tournament opener at Ahmedabad’s Narendra Modi Stadium on 31 March, finished in the top two slots with 20 and 17 points respectively with the Titans topping the table for a second season in a row since making their debut last year along with the Lucknow Super Giants (LSG). CSK were tied with LSG on 17 points, given the fixture between the two at Lucknow’s Ekana Stadium earlier this month had been rained off, but finished ahead on the table due to their superior Net Run Rate. As far as the head-to-head record between the two teams goes, it’s 3-0 in favour of Gujarat at the moment. The Hardik Pandya-led side have pulled off a hat-trick of chases against MS Dhoni and Co — winning by three wickets and seven wickets last season. In the first game of the 16th edition, Gujarat managed to chase down the 179-run target set by Chennai with five wickets and four deliveries to spare. While the winner of this contest progresses directly into the final that takes place at the Narendra Modi Stadium this Sunday, the loser will have another shot at making the final as they take on the winner of the Eliminator between LSG and Mumbai Indians, which takes place on Wednesday, 24 May. Teams: Gujarat Titans: Shubman Gill, Wriddhiman Saha(w), Hardik Pandya(c), Dasun Shanaka, David Miller, Rahul Tewatia, Rashid Khan, Darshan Nalkande, Mohit Sharma, Noor Ahmad, Mohammed Shami Chennai Super Kings: Ruturaj Gaikwad, Devon Conway, Ajinkya Rahane, Ambati Rayudu, Shivam Dube, Moeen Ali, Ravindra Jadeja, MS Dhoni(w/c), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-23 16:48:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Deepak-Chahar-celebrates-IPL-2023-Qualifier-1-Sportzpics-640.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"रिद्धिमान साहा के खिलाफ फील्डिंग सजाने की सबसे बड़ी 'साजिश', धोनी का सानी नहीं","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/wriddhiman-saha-traps-in-ms-dhoni-plan-gt-vs-csk-ipl-2023/articleshow/100454307.cms","keywords":null,"creator":null,"video_url":null,"description":"GT vs CSK: महेंद्र सिंह धोनी ने आईपीएल 2023 में एक बार फिर अपनी कप्तानी का लोहा मनवाया। उन्होंने गुजरात टाइटंस के ओपनर रिद्धिमान साहा के लिए जो जाल बिछाया था, वो उसमें फंस गए। चेन्नई सुपर किंग्स और गुजरात टाइटंस के बीच सीजन का पहला क्वालिफायर खेला जा रहा है।","content":"महेंद्र सिंह धोनी (MS Dhoni) 2007 से कप्तानी कर रहे हैं। भारत के साथ ही वह आईपीएल के सबसे सफल कप्तानों में शामिल हैं। 41 साल की उम्र में भी वह चेन्नई सुपर किंग्स के लिए आईपीएल (IPL 2023) में खेल रहे हैं। भले ही उनका बल्ला पहले जैसा नहीं चल रहा लेकिन कप्तानी और प्लानिंग में धोनी आज भी भारी पड़ रहे हैं। गुजरात टाइटंस और चेन्नई सुपर किंग्स (GT vs CSK) के बीच खेले जा रहे आईपीएल 2023 के पहले क्वालिफायर में एक बार फिर मास्टरमाइंड धोनी देखने को मिले। गुजरात टाइटंस के बल्लेबाज रिद्धिमान साहा काफी पुल शॉट खेलते हैं। पटकी हुई गेंद देखने ही वह पुल शॉट लगा देते हैं। चेपॉक की पिच धीमी है और कई बार गेंद फंसकर आती है और यह शॉट खेलना मुश्किल हो जाता है। ऐसे में धोनी ने डीप स्क्वायर लेग के फील्डर को बाउंड्री लाइन से काफी अंदर खड़ा किया। दीपक चाहर ने तीसरे ओवर की अंतिम गेंद पटकी हुई फेंकी और साहा ने इसे पुल किया। गेंद सीधे धोनी के लगाए फील्डर के हाथों में चली गई। जब साहा का विकेट गिरा तो दीपक चाहर का रिक्शन साफ बता रहा था कि प्लानिंग काम कर गई। महेंद्र सिंह धोनी के चेहरे पर भी संतुष्टि साफ दिख रही थी। क्योंकि साहा गुजरात के लिए पावरप्ले में काफी तेजी से रन बनाते हैं। इस मैच में उन्होंने 11 गेंदों पर 12 रनों की पारी खेली। चेन्नई सुपरकिंग्स ने इंडियन प्रीमियर लीग के पहले क्वालीफायर मैच में गुजरात टाइटंस के खिलाफ पहले बल्लेबाजी करते हुए सात विकेट पर 172 रन बनाये। चेन्नई के लिए सलामी बल्लेबाज रुतुराज गायकवाड़ ने सबसे ज्यादा 60 रन बनाये। गुजरात ने दूसरे ही ओवर में उन्हें जीवनदान दिया था। गुजरात के लिए मोहित शर्मा और मोहम्मद शमी ने दो-दो विकेट लिये।","pubDate":"2023-05-23 16:46:23","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"पुरुषों का क्रिकेट विश्व कप 2023: आईसीसी ने क्वालीफायर के लिए वार्म-अप कार्यक्रम जारी किए","link":"https://jantaserishta.com/sports/mens-cricket-world-cup-2023-icc-releases-warm-up-fixtures-for-qualifier-2367861","keywords":["खेल"],"creator":["Gulabi Jagat"],"video_url":null,"description":null,"content":"दुबई (एएनआई): आ ईसीसी द्वारा जिम्बाब्वे में आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर टूर्नामेंट से पहले वार्म-अप जुड़नार की पुष्टि की गई है। सभी 10 टीमें 18 जून को क्वालीफ़ायर की शुरुआत से पहले कुल दो अभ्यास मैच खेलेंगी, जिसमें पक्षों को महत्वपूर्ण इवेंट की शुरुआत से पहले कुछ मूल्यवान मैच अभ्यास प्राप्त करने होंगे। ICC के अनुसार गुरुवार 15 जून को उसी सप्ताह के दौरान होने वाले खेलों के दूसरे सेट के साथ वार्म-अप जुड़नार के शुरुआती दिन मंगलवार, 13 जून को हर टीम एक्शन में होगी। क्वालीफायर के लिए जिम्बाब्वे में 10 टीमें साल के अंत में 2023 विश्व कप में दो स्थानों के लिए संघर्ष कर रही हैं, शीर्ष दो टीमें सुपर सिक्स चरण के पूरा होने पर फाइनल में पहुंच रही हैं और एक स्थान अर्जित कर रही हैं। 50 ओवर का शोकेस। ICC ने आगामी ICC मेन्स क्रिकेट वर्ल्ड कप 2023 के क्वालीफायर मैचों के कार्यक्रम की भी घोषणा की है। दो बार के विजेता वेस्टइंडीज और 1996 के चैंपियन श्रीलंका आगामी आईसीसी पुरुष क्रिकेट विश्व कप क्वालीफायर के लिए अलग-अलग समूहों में हैं जो 18 जून से 9 जुलाई के बीच जिम्बाब्वे में होंगे। टूर्नामेंट के मेजबान जिम्बाब्वे, नीदरलैंड, नेपाल और संयुक्त राज्य अमेरिका के साथ ग्रुप ए में वेस्टइंडीज को ड्रा किया गया। और श्रीलंका ग्रुप बी में है जहां द्वीप राष्ट्र को आयरलैंड, स्कॉटलैंड, ओमान और संयुक्त अरब अमीरात के खिलाफ मैच खेलने हैं। वार्म-अप जुड़नार: मंगलवार, 13 जून वेस्टइंडीज बनाम स्कॉटलैंड, हरारे स्पोर्ट्स क्लब जिम्बाब्वे बनाम ओमान, ताकाशिंगा क्रिकेट क्लब नेपाल बनाम यूएई, ओल्ड हैरियंस क्रिकेट क्लब श्रीलंका बनाम नीदरलैंड, क्वींस स्पोर्ट्स क्लब आयरलैंड बनाम यूएसए, बुलावायो एथलेटिक क्लब गुरुवार, 15 जून नेपाल बनाम ओमान, हरारे स्पोर्ट्स क्लब वेस्ट इंडीज बनाम संयुक्त अरब अमीरात, ताकाशिंगा क्रिकेट क्लब जिम्बाब्वे बनाम स्कॉटलैंड, ओल्ड हैरियंस क्रिकेट क्लब आयरलैंड बनाम नीदरलैंड्स, क्वींस स्पोर्ट्स क्लब श्रीलंका बनाम यूएसए, बुलावायो एथलेटिक क्लब (एएनआई)","pubDate":"2023-05-23 16:40:48","image_url":null,"source_id":"jantaserishta","category":["sports"],"country":["india"],"language":"hindi"},{"title":"एलेप्पी एक्सप्रेस पर सवार थे धोनी लेकिन मोहित ने चेन खींच दी, चेले ने ही थाला को फंसाया","link":"https://navbharattimes.indiatimes.com/sports/cricket/iplt20/news/ms-dhoni-out-on-just-1-run-by-mohit-sharma-in-ipl-qualifier-1-csk-vs-gt/articleshow/100453936.cms","keywords":null,"creator":null,"video_url":null,"description":"CSK vs GT Highlights: गुजरात टाइटंस के खिलाफ आईपीएल 2023 के ओपनिंग मैच में 7 गेंद में नाबाद 14 रन बनाने वाले माही इस बार 2 गेंद में सिर्फ 1 रन बनाकर आउट हो गए। मोहित शर्मा ने उन्हें स्लोअर में फंसाया।","content":null,"pubDate":"2023-05-23 16:35:52","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"West Indies batter Devon Thomas suspended for alleged fixing in Lanka Premier League","link":"https://indianexpress.com/article/sports/cricket/west-indies-batter-devon-thomas-suspended-for-alleged-fixing-in-lanka-premier-league-8625306/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2023-05-23 16:30:01","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"GT vs CSK: Noor Ahmad castles Shivam Dube with unplayable delivery; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/gt-vs-csk-noor-ahmad-castles-shivam-dube-with-unplayable-delivery-watch-video-12637992.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"GT vs CSK: Noor Ahmad castles Shivam Dube with unplayable delivery; watch video","content":"Gujarat Titans’ (GT) Afghan spinner Noor Ahmad has been in fine form this Indian Premier League (IPL) season, and maintained it with the dismissal of Chennai Super Kings’ (CSK) Shivam Dube during Qualifier 1 at Chepauk on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Noor was bowling the 12th over of the CSK innings. He delivered a full length ball on off, but the ball ended up spinning sharply, and that eventually deceived Dube, dismantling the leg stump. You miss, I hit 😎 Noor Ahmad gets Shivam Dube with a beauty 🎯 Follow the match ▶️ https://t.co/LRYaj7cLY9#TATAIPL | #Qualifier1 | #GTvCSK pic.twitter.com/OjtjAsXLXT — IndianPremierLeague (@IPL) May 23, 2023 Dube, who has been impressive with the bat this season, scoring 386 runs from 15 matches, was dismissed just for one run. With the wicket, Noor Ahmad improved his wickets tally to 14 scalps from 11 matches. The winner of the GT vs CSK Qualifier 1 contest earns direct qualification to Sunday’s final in Ahmedabad, while the losing team takes on the winners of Wednesday’s Eliminator between Lucknow Super Giants (LSG) and Mumbai Indians (MI). Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2023-05-23 16:27:21","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/05/Noor-Ahmad-GT-vs-CSK-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"West Indies batter Devon Thomas charged with match fixing by ICC","link":"https://telanganatoday.com/west-indies-batter-devon-thomas-charged-with-match-fixing-by-icc","keywords":["News","Sport","Devon Thomas","ICC","match fixing","West Indies"],"creator":["AP"],"video_url":null,"description":"ICC laid seven charges against Thomas relating to attempting to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence","content":"Dubai: West Indies batter Devon Thomas was charged with match fixing by the International Cricket Council and provisionally banned from playing on Tuesday. The ICC laid seven charges against Thomas relating to attempting to fix the outcome of games and obstructing investigations by concealing, tampering with or destroying evidence. Four of the charges relate to matches in the Lanka Premier League Twenty20 tournament in Sri Lanka in 2021. Two relate to matches in the Caribbean Premier League T20 competition in the same year and one relates to matches in the T10 Cricket League in United Arab Emirates, also in 2021. The 33-year-old Thomas has 14 days from Tuesday to respond to the charges, the Dubai-based ICC said.Thomas has played 21 one-day internationals, although his last came 10 years ago. He has played in 12 T20 games for West Indies between 2009 and 2022. His only test appearance came against Australia in December.","pubDate":"2023-05-23 16:20:45","image_url":null,"source_id":"telanganatoday","category":["sports"],"country":["india"],"language":"english"}]}