{"newsArray":[{"title":"Aussie cricketer’s ‘horrible’ act sparks outrage","link":"https://www.news.com.au/sport/cricket/cricketers-horrible-act-in-victorian-grade-match-sparks-outrage/news-story/68fb16b6fd7653da4325bd64976a1c31","keywords":null,"creator":null,"video_url":null,"description":"A Victorian grade cricket match has become the centre of heated debate after a bowler secured victory with two “Mankad” dismissals on the weekend.","content":null,"pubDate":"2022-02-22 22:19:00","full_description":"A Victorian grade cricket match has become the centre of heated debate after a bowler secured victory with two “Mankad” dismissals on the weekend. During Saturday’s second-grade contest at Walton Galt Reserve, Kingston Hawthorn paceman Sen Sathyajith ran out two Casey South Melbourne batters at the nonstriker’s end to help his club clinch a 13-run win. Watch every match of the ICC Women’s Cricket World Cup LIVE & FREE on Kayo Freebies. Join free now and start streaming instantly. Casey South Melbourne were set a target of 204 for victory, and the visitors got themselves into a commanding position at 5/172 in the 40th over. But after a couple of quick wickets fell, Sathyajith ran out No. 8 batter Isaiah Jassal at the nonstriker’s end to leave the Swans reeling at 8/181. And then with 14 runs required for victory, Sathyajith once again attempted the “Mankad” run out to dismiss No. 9 batter Sachin Halangode, securing the tense win. Footage of the decisive wicket circulated social media platforms this week, provoking outrage from the Australian cricket community. Although the “Mankad” is completely within the Laws of Cricket, many still consider it to be against the Spirit of the Game. It remains a divisive topic in the sport. Former Victorian wicketkeeper Adam Crosthwaite tweeted: “This is so bad. This is horrible. Cannot believe the people in this post praising the bowler. Are you kidding?” pic.twitter.com/6HHRSb9W57 Bit of drama in the @vicpremcricket Second XI today after the bowler, without delivering the ball, ran out the batsman at the non-striker's end. It was the last wicket of the match and apparently the second such dismissal of the innings. Oh boy. To win the game! (Ignore score strap down the bottom). Second Mankad for the innings. https://t.co/rAVduERK03 According to Fox Cricket , the Hawks attempted the “Mankad” on at least two other occasions during the innings. The Herald Sun reported that Premier Cricket manager Liam Murphy is investigating the incident. “Some people think it’s ordinary and not within the spirit of cricket. Others say it’s a law of the game and it is what it is,” Hawks president Brett Sebire told The Herald Sun . Law 41.16 was amended in 2017 to say: “If the nonstriker is out of their ground from the moment the ball comes into play to the instant when the bowler would normally have been expected to release the ball, the bowler is permitted to attempt to run them out. Whether the attempt is successful or not, the ball shall not count as one in the over. “If the bowler fails in an attempt to run out the nonstriker, the umpire shall call and signal dead ball as soon as possible.” Indian spin bowler Ravichandran Ashwin made headlines in 2019 for running out England batter Jos Buttler at the nonstriker’s end in the Indian Premier League. “To clarify, it has never been in the Laws that a warning should be given to the nonstriker and nor is it against the spirit of cricket to run out a nonstriker who is seeking to gain an advantage by leaving his/her ground early,” he explained at the time. “It is there in the rules of the game. I don’t know where the understanding of the spirit of the game comes from because quite naturally if it’s there in the rules, it’s there.” Australian cricket great Shane Warne led a chorus of outrage, condemning Ashwin’s act on social media. “So disappointed in Ravi Ashwin as a captain and as a person,” he wrote. “All captains sign the IPL wall and agree to play in the spirit of the game. (Ashwin) had no intention of delivering the ball — so it should have been called a dead ball. “Ashwin’s actions were simply disgraceful and I hope the BCCI doesn’t condone this sort of behaviour in the IPL. “Any player in the game that does that to anyone is an embarrassment to the game and as captain it’s even more disgraceful.” Cameroon cricketer Maeva Douma became a cult hero last year for dismissing four Uganda batters via “Mankad” in one innings during the ICC Women’s T20 World Cup Africa Region Qualifiers. The controversial tactic is named after Indian cricketer Vinoo Mankad, who twice ran out Australian opener Bill Brown during a Test of match at the SCG in 1947. The Covid-19 pandemic hadn’t even started the last time this Australian star played state cricket. Australian selectors have allowed several stars to miss limited-overs matches in Pakistan before they head to the Indian Premier League. Former Australian seamer Chris Tremain has rediscovered his career-best form, claiming his best Sheffield Shield figures in three years.","image_url":null,"source_id":"news","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie cricketer’s ‘horrible’ act sparks outrage","link":"https://www.cairnspost.com.au/sport/cricket/cricketers-horrible-act-in-victorian-grade-match-sparks-outrage/news-story/68fb16b6fd7653da4325bd64976a1c31","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"A Victorian grade cricket match has become the centre of heated debate after a bowler secured victory with two “Mankad” dismissals on the weekend.","content":null,"pubDate":"2022-02-22 22:19:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"DA COSTA: India follows England in cleaning house of cricket veterans","link":"https://torontosun.com/sports/other-sports/da-costa-india-follows-england-in-cleaning-house-of-cricket-veterans","keywords":null,"creator":["Norm Da Costa"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-22 22:16:38","full_description":"With spring in the air, it’s time to clean house. England got the ball rolling last week by excluding the royalty of English fast bowling — James Anderson and Stuart Broad — from its tour of the West Indies next month. Not to be outdone, India jumped on the bandwagon by giving the heave-ho to Ajinkya Rahane and Cheteshwar Pujara , the spine of the country’s batting in recent years. Both will miss the Test series against Sri Lanka, and worse still, this could well be curtains up for the pair unless they can rattle up the scoreboard in the local Ranji Trophy tournament. Both sets of players were given the same old tired excuse that their omission did not signal the end of their international careers, but the selectors were casting their net far and wide looking for younger options. It was difficult to buy this rationale in the case of Anderson and Broad, as both are at the top of their game. But in the case of Pujara and Rahane, the selectors may have made the right choice, as India has a glut of world-class batsmen ready to fill the void. The Indian selectors did not stop there. They also shut the door on long-time pace ace Ishant Sharma and wicket-keeper batsman Wriddhiman Saha . While Sharma was informed the Test door was left ajar for his return depending on his showing in the Ranji Trophy, Saha was told the door had effectively been slammed shut in his case. This was a baffling turn of events after his spot on the Test squad had been assured by Sourav Ganguly , president of the Indian board. But India’s chief selector Chetan Sharma disagreed and new coach Rahul Dravid apparently told Saha he should retire. I can’t believe that the classy Dravid would stoop to this level, but it appears Ganguly isn’t playing with a straight bat. He sowed confusion at the Twenty20 World Cup last November over Virat Kohli ’s decision to step down as T20 skipper. Following an exchange of words, Kohli also gave up captaincy of the other two formats as well. His boots will now be filled by opening batsman Rohit Sharma , who has been named Kohli’s replacement in all three formats. The announcement was made on the weekend by chief selector Chetan Sharma, and his comments are expected to create more controversy in the cricket-mad country. “As far as Rohit Sharma is concerned, he is the No. 1 cricketer of our country, he is playing all three formats of the game,” he said. In India and elsewhere, Kohli is still recognized as the No. 1 batsman, and one wonders why the selector would try to propagate more division. Meanwhile, Rohit Sharma led India to a 3-0 Twenty20 sweep of visiting West Indies. Seamer Harshal Patel took three for 22 to help India defeat the Windies by 17 runs. The visitors were restricted to 167 for nine after India had put on 185 for five behind Suryakumar Yadav ’s belligerent 65 off 31 balls. Nicholas Pooran was the top batsman for the Windies with 61 off 47 balls. PROTEAS SMASHED After the dizzying heights of winning the Test series against India, South Africa was brought to its knees by New Zealand. South Africa arrived in New Zealand sporting a proud record of never having lost a Test series to the Kiwis, but that record appears in danger. The Proteas were thrashed by an innings and 276 runs in Christchurch in an encounter that lasted less than seven sessions. It wasn’t pretty as Dean Elgar ’s team was bundled out for 95 and 111. The damage in both innings were done by pacemen, with Matt Henry bagging seven for 23 and veteran Tim Southee grabbing five for 35 in the second innings. The Blackcaps plundered the Proteas’ bowling for 482 runs with Henry Nicholls getting his eighth Test century and Tom Blundell falling just short of 100. Elgar stated the obvious that the team was totally outclassed, but added he didn’t think off-field issues facing the team played a role in this thrashing. Head coach Mark Boucher has been charged with gross misconduct by Cricket South Africa over charges of racial discrimination. “I don’t see that as being an influence within our camp,’’ said Elgar. “I guess individuals can maybe answer that, but I don’t see it as having an impact over the last few days.” CANADA OUT Canada crashed out of the Twenty20 World Cup qualifying tournament played in Oman. After losing to Oman, Canada was required to defeat Nepal, but got thrashed by eight wickets. Canada was dismissed for a paltry 80 and Nepal reached 81 for two in 14.1 overs. Meanwhile, Ireland and the United Arab Emirates secured their tickets to the final, to be played in Australia later this year, with easy wins. Ireland posted 165 for seven and then dismissed Oman for 105. The other semifinal was also one-sided, with the UAE beating Nepal by 68 runs. UAE made 175 for seven and Nepal managed a meagre 107.","image_url":null,"source_id":"torontosun","country":["canada"],"category":["sports"],"language":"english"},{"title":"Australia’s white ball depth to be tested against Pakistan","link":"https://www.cairnspost.com.au/sport/cricket/australias-white-ball-depth-to-be-tested-against-pakistan/video/891a61cebc70f885d4afe69699a03f27","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Australia's white ball depth will be tested when they travel to Pakistan, with a number of stars set to be rested for that leg of the tour.","content":null,"pubDate":"2022-02-22 20:54:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Canadian cricketers down Germany at ICC T20 World Cup qualifier","link":"https://www.cheknews.ca/canadian-cricketers-down-germany-at-icc-t20-world-cup-qualifier-956477/","keywords":["Sports"],"creator":["The Canadian Press"],"video_url":null,"description":"Matthew Spoors hit an unbeaten 73 to help Canada defeat Germany by six wickets in classification play Tuesday at the ICC Men's T20 World Cup Qualifier A. The post Canadian cricketers down Germany at ICC T20 World Cup qualifier appeared first on CHEK.","content":"MUSCAT, Oman – Matthew Spoors hit an unbeaten 73 to help Canada defeat Germany by six wickets in classification play Tuesday at the ICC Men’s T20 World Cup Qualifier A. The Canadian men will now face Bahrain on Thursday to decide fifth place at the eight-country tournament. The United Arab Emirates and Ireland won their semifinals Tuesday to book their ticket to the ICC T20 World Cup 2022 in Australia later this year. The U.A.E. defeated Nepal by 68 runs while Ireland posted a 56-run victory over Oman. Bahrain beat the Philippines by 91 runs in the classification round. The Germans made life difficult for Canada, which reached its victory target of 132 with just three balls to spare. Canada won the toss and elected to field first, restricting the Germans to 131 for six in their 20 overs at the Al Amerat Cricket Ground. Michael Richardson led the German batsmen with 35 runs off 33 balls before being bowled by Spoors. The post Canadian cricketers down Germany at ICC T20 World Cup qualifier appeared first on CHEK.","pubDate":"2022-02-22 19:00:49","full_description":null,"image_url":null,"source_id":"cheknews","country":["canada"],"category":["sports"],"language":"english"},{"title":"Wriddhiman Saha Explains Why He Won't Name \"Journalist\" Who Threatened Him - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvd3JpZGRoaW1hbi1zYWhhLWV4cGxhaW5zLXdoeS1oZS13b250LW5hbWUtam91cm5hbGlzdC13aG8tdGhyZWF0ZW5lZC1oaW0tMjc4MjkzMNIBdWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvd3JpZGRoaW1hbi1zYWhhLWV4cGxhaW5zLXdoeS1oZS13b250LW5hbWUtam91cm5hbGlzdC13aG8tdGhyZWF0ZW5lZC1oaW0tMjc4MjkzMC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Wriddhiman Saha Explains Why He Won't Name \"Journalist\" Who Threatened Him  NDTVSports.comICA condemns threatening messages to Wriddhiman Saha, India cricket, Ganguly | Cricbuzz.com - Cricbuzz  CricbuzzBCCI: 'We will speak to Saha and want to know if he was threatened'  ESPNcricinfo\"Why I Didn't Reveal Journalist Name\": Wriddhiman Saha On Explosive Tweet  NDTV Sports'He's 37, But His Fitness and Performance Are Alright'-Wriddhiman Saha Childhood Coach  News18View Full coverage on Google News","content":null,"pubDate":"2022-02-22 14:56:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ireland, UAE secure qualification for 2022 T20 WC | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTIxMTczL2lyZWxhbmQtdWFlLXNlY3VyZS1xdWFsaWZpY2F0aW9uLWZvci0yMDIyLXQyMC13b3JsZC1jdXAtY3JpY2J1enpjb23SAXFodHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjExNzMvaXJlbGFuZC11YWUtc2VjdXJlLXF1YWxpZmljYXRpb24tZm9yLTIwMjItdDIwLXdvcmxkLWN1cC1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ireland, UAE secure qualification for 2022 T20 WC | Cricbuzz.com - Cricbuzz  CricbuzzUAE and Ireland qualify for ICC T20 World Cup  The Indian ExpressCAN vs GER Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- T20 World Cup Qualifier A  Cricket AddictorUAE, Ireland Qualify For ICC T20 World Cup  NDTVSports.comIreland qualifies for ICC Mens T20 World Cup  Cricket WorldView Full coverage on Google News","content":null,"pubDate":"2022-02-22 14:29:20","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"'I'll Not Hold Back': Wriddhiman Saha Issues Warning To Journalist, Says 'I Was Hurt and Offended' - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMijAFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaWxsLW5vdC1ob2xkLWJhY2std3JpZGRoaW1hbi1zYWhhLWlzc3Vlcy13YXJuaW5nLXRvLWpvdXJuYWxpc3QtZGVuaWVzLWV4cG9zaW5nLXRoZS1uYW1lLTQ3OTk3OTUuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"'I'll Not Hold Back': Wriddhiman Saha Issues Warning To Journalist, Says 'I Was Hurt and Offended'  News18ICA condemns threatening messages to Wriddhiman Saha, India cricket, Ganguly | Cricbuzz.com - Cricbuzz  CricbuzzBCCI: 'We will speak to Saha and want to know if he was threatened'  ESPNcricinfo\"Why I Didn't Reveal Journalist Name\": Wriddhiman Saha On Explosive Tweet  NDTV Sports'If BCCI ask me to reveal the name, I would...': Wriddhiman Saha breaks silence on reporter threat case  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-22 13:25:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Seven unvaccinated India U-19 players were denied entry into Caribbean and told to 'go back'","link":"https://www.tribuneindia.com/news/sports/seven-unvaccinated-india-u-19-players-were-denied-entry-into-caribbean-and-told-to-go-back-372108","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, February 22The Covid-19 outbreak in its camp was not the only off-field challenge the Indian team overcame on its way to the U-19 World Cup triumph.India's problems began on arrival in the Caribbean islands, with as many as seven unvaccinated members of the side detained at the airport for more than 24 hours, requiring the government to step in and resolve the issue.This was after a long flight from Dubai to Port-of-Spain via Amsterdam.Left-arm pacer Ravi Kumar, who played a huge role in the team's unprecedented fifth World Cup triumph, and opener Angkrish Raghuvanshi were among the players who were told to \"go back to India\" as they were not jabbed.Team manager Lobzang G. Tenzing, who came to their rescue with the help of the ICC and colleagues in the BCCI, narrated the \"harrowing experience\" of the players. The India and Trinidad government, too, had to step in to resolve the situation.\"After we landed at Port-of-Spain, we had to take a charter flight to Guyana but seven of our boys were stopped as they were not vaccinated. We tried to explain to the immigration officials that India had not started their vaccination yet but they instructed us to take the next flight out of the country,\" Tenzing, who heads the Sikkim Cricket Association, told PTI.\"We were surrounded by security guys of the airlines as if we would run away from there. And as the argument was on with airline and immigration officials, the only Lufthansa flight available had departed and the next one was after three days. That gave us time to negotiate with local authorities.\"\"I decided to stay with the boys and we had to stay in a shady hotel near the airport for the night. It was only after the intervention of ICC and local government the matter could be resolved. It was quite a harrowing experience for the boys,\" he recalled.This happened in the first week of January when India started the vaccination drive for the 15-18 age group.In the Caribbean for the biggest event of their lives, the players were inconsolable.It was not just five players, entire administrative team got down with Covid. The Indian contingent's troubles in the Caribbean had only begun and soon after the detained players were allowed to join the team in Guyana, a Covid outbreak jeopardised the team's participation in the tournament.The squad did not have its captain Yash Dhull and his deputy Shaik Rasheed for two of the three league games due to Covid-19.The players testing positive only came to light before the second league game against Ireland but the virus in the camp came when the team's SLO Ravindran returned a positive test during a five-day quarantine in Guyana.Team manager Tenzing and the logistics manager then got infected, sending the contingent into an administrative crisis. \"In all probability, our SLO caught the virus on the way to Caribbean from Dubai where we were playing the Asia Cup. And gradually it spread in the camp. \"The RTPCR test results would take as long as 48 hours and that contributed to the problem,\" said the Sikkim cricket chief, having played the role of the troubleshooter.\"Tournament bio-bubble was a joke, the authorities were lethargic\". The ICC had organised the event with the help of Cricket West Indies. In a challenging time like this, the Caribbean was not the best place to organise a big event like the U-19 WC, felt Tenzing.\"It poses additional logistical issues and people were lethargic.\" The Indian team had the most comfortable stay in Antigua where they played knockouts and the toughest time in Guyana where they quarantined before playing their opener against South Africa.\"Our time in Guyana was tough to say the least. When I and my colleagues were down with COVID, no medical help was provided, no doctor, no medicines. Our team physio came to our rescue. It was like a system failure.\"In the hotel we stayed there were no separate floors for teams. We were staying on the same floor as other hotel guests. There was nobody to man the isolation period. The rooms did not have regular running water and players faced food issues.\"Luckily few Indian restaurants close by helped us on that front. \"During practice games, the stadium had no water in the washrooms. I can safely say we, state units and the BCCI do a much better job staging domestic events in a bio-secure environment,\" added Tenzing.","content":null,"pubDate":"2022-02-22 12:32:35","full_description":"PTI New Delhi, February 22 The Covid-19 outbreak in its camp was not the only off-field challenge the Indian team overcame on its way to the U-19 World Cup triumph. India’s problems began on arrival in the Caribbean islands, with as many as seven unvaccinated members of the side detained at the airport for more than 24 hours, requiring the government to step in and resolve the issue. This was after a long flight from Dubai to Port-of-Spain via Amsterdam. Left-arm pacer Ravi Kumar, who played a huge role in the team’s unprecedented fifth World Cup triumph, and opener Angkrish Raghuvanshi were among the players who were told to “go back to India” as they were not jabbed. Team manager Lobzang G. Tenzing, who came to their rescue with the help of the ICC and colleagues in the BCCI, narrated the “harrowing experience” of the players. The India and Trinidad government, too, had to step in to resolve the situation. “After we landed at Port-of-Spain, we had to take a charter flight to Guyana but seven of our boys were stopped as they were not vaccinated. We tried to explain to the immigration officials that India had not started their vaccination yet but they instructed us to take the next flight out of the country,” Tenzing, who heads the Sikkim Cricket Association, told PTI. “We were surrounded by security guys of the airlines as if we would run away from there. And as the argument was on with airline and immigration officials, the only Lufthansa flight available had departed and the next one was after three days. That gave us time to negotiate with local authorities.” “I decided to stay with the boys and we had to stay in a shady hotel near the airport for the night. It was only after the intervention of ICC and local government the matter could be resolved. It was quite a harrowing experience for the boys,” he recalled. This happened in the first week of January when India started the vaccination drive for the 15-18 age group. In the Caribbean for the biggest event of their lives, the players were inconsolable. It was not just five players, entire administrative team got down with Covid. The Indian contingent’s troubles in the Caribbean had only begun and soon after the detained players were allowed to join the team in Guyana, a Covid outbreak jeopardised the team’s participation in the tournament. The squad did not have its captain Yash Dhull and his deputy Shaik Rasheed for two of the three league games due to Covid-19. The players testing positive only came to light before the second league game against Ireland but the virus in the camp came when the team’s SLO Ravindran returned a positive test during a five-day quarantine in Guyana. Team manager Tenzing and the logistics manager then got infected, sending the contingent into an administrative crisis. “In all probability, our SLO caught the virus on the way to Caribbean from Dubai where we were playing the Asia Cup. And gradually it spread in the camp. “The RTPCR test results would take as long as 48 hours and that contributed to the problem,” said the Sikkim cricket chief, having played the role of the troubleshooter. “Tournament bio-bubble was a joke, the authorities were lethargic”. The ICC had organised the event with the help of Cricket West Indies. In a challenging time like this, the Caribbean was not the best place to organise a big event like the U-19 WC, felt Tenzing. “It poses additional logistical issues and people were lethargic.” The Indian team had the most comfortable stay in Antigua where they played knockouts and the toughest time in Guyana where they quarantined before playing their opener against South Africa. “Our time in Guyana was tough to say the least. When I and my colleagues were down with COVID, no medical help was provided, no doctor, no medicines. Our team physio came to our rescue. It was like a system failure. “In the hotel we stayed there were no separate floors for teams. We were staying on the same floor as other hotel guests. There was nobody to man the isolation period. The rooms did not have regular running water and players faced food issues. “Luckily few Indian restaurants close by helped us on that front. “During practice games, the stadium had no water in the washrooms. I can safely say we, state units and the BCCI do a much better job staging domestic events in a bio-secure environment,” added Tenzing. #BCCI #ICC #u 19 world cup","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1338197329.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Always keep the fire inside you burning: Yuvraj dedicates a heartfelt note to Virat","link":"https://www.tribuneindia.com/news/sports/always-keep-the-fire-inside-you-burning-yuvraj-dedicates-a-heartfelt-note-to-virat-372101","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, February 22 Former Indian all-rounder Yuvraj Singh has penned down an emotional note for Indian skipper and former captain Virat Kohli. Yuvraj applauded latter for his contribution to Indian cricket with his utmost discipline and dedication. Yuvraj further asserted that Virat's legacy will serve as inspiration for the future generations of cricket. \"Virat, I've seen you grow as a cricketer and as a person. From that young boy in the nets who would walk shoulder-to-shoulder with the legends of Indian cricket, you're now a legend yourself leading the way for a new generation. Your discipline in the nets, passion on the field and dedication to the sport inspires every young kid in this country to pick up the bat and dream of putting on the blue jersey one day,\" wrote Yuvraj in the letter. Yuvraj also rejuvenated his memories with Virat, be it playing on field or the time they had spent together off the field. Along with the heartfelt letter, Yuvraj has also dedicated special pair of shoe to Virat, celebrating his career and time as captain which has brought smiles to millions of fans all over the world. \"You have elevated your level of cricket every single year and achieved so much already in this wonderful game. You have been a legendary captain and a fantastic leader. Always keep the fire inside you burning. You're a superstar. Here's a special golden boot for you. Keep making the country proud,\" he added. To the little boy from Delhi @imvkohliI want to dedicate this special shoe to you,celebrating your career n time as captain which has brought smiles to millions of fans all over the world. I hope you stay the way YOU are, play the way YOU do and keep making the country proud! pic.twitter.com/mwVPPh0JwU — Yuvraj Singh (@YUVSTRONG12) February 22, 2022 Yuvraj Singh had announced retirement from all forms of the game.","content":null,"pubDate":"2022-02-22 11:32:47","full_description":"Tribune Web Desk Chandigarh, February 22 Former Indian all-rounder Yuvraj Singh has penned down an emotional note for Indian skipper and former captain Virat Kohli. Yuvraj applauded latter for his contribution to Indian cricket with his utmost discipline and dedication. Yuvraj further asserted that Virat’s legacy will serve as inspiration for the future generations of cricket. \"Virat, I've seen you grow as a cricketer and as a person. From that young boy in the nets who would walk shoulder-to-shoulder with the legends of Indian cricket, you're now a legend yourself leading the way for a new generation. Your discipline in the nets, passion on the field and dedication to the sport inspires every young kid in this country to pick up the bat and dream of putting on the blue jersey one day,\" wrote Yuvraj in the letter. Yuvraj also rejuvenated his memories with Virat, be it playing on field or the time they had spent together off the field. Along with the heartfelt letter, Yuvraj has also dedicated special pair of shoe to Virat, celebrating his career and time as captain which has brought smiles to millions of fans all over the world. \"You have elevated your level of cricket every single year and achieved so much already in this wonderful game. You have been a legendary captain and a fantastic leader. Always keep the fire inside you burning. You're a superstar. Here's a special golden boot for you. Keep making the country proud,\" he added. To the little boy from Delhi @imvkohli I want to dedicate this special shoe to you,celebrating your career n time as captain which has brought smiles to millions of fans all over the world. I hope you stay the way YOU are, play the way YOU do and keep making the country proud! pic.twitter.com/mwVPPh0JwU Yuvraj Singh had announced retirement from all forms of the game. #virat kohli #yuvraj singh","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1259113651.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh vs Afghanistan 1st ODI Live Telecast Channel in India and Bangladesh: When and where to watch BAN vs AFG Chattogram ODI?","link":"https://thesportsrush.com/cricket-news-bangladesh-vs-afghanistan-1st-odi-live-telecast-channel-in-india-and-bangladesh-when-and-where-to-watch-ban-vs-afg-chattogram-odi/","keywords":["Cricket","Afghanistan","Afghanistan tour of Bangladesh 2022","Bangladesh"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Bangladesh vs Afghanistan 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of the 1st BAN vs AFG ODI. With multiple players from both the teams coming on the back of respective Bangladesh Premier League and Pakistan Super League stints, they will now lock horns against each other… The post Bangladesh vs Afghanistan 1st ODI Live Telecast Channel in India and Bangladesh: When and where to watch BAN vs AFG Chattogram ODI? appeared first on The SportsRush.","content":"Bangladesh vs Afghanistan 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of the 1st BAN vs AFG ODI. With multiple players from both the teams coming on the back of respective Bangladesh Premier League and Pakistan Super League stints, they will now lock horns against each other in the first ODI of Afghanistan’s tour of Bangladesh 2022 at the Zahur Ahmed Chowdhury Stadium tomorrow. Having last played an ODI against each other during the ICC Cricket World Cup 2019 in Southampton, Bangladesh and Afghanistan will resume their ODI rivalry after more than 30 months. In eight ODIs against each other till date, Bangladesh have a slight 5-3 lead. Among the four ODIs in Bangladesh, both the hosts and visitors have won twice each. Snapshots from #AfghanAtalan‘s first training session under the interim head coach Stuart Law in Chattogram ahead of the ODI series vs #AFGvBD pic.twitter.com/cZM3YicGkI — Afghanistan Cricket Board (@ACBofficials) February 20, 2022 Set to host an ODI after more than a year, Chattogram will be hosting Afghanistan for the first time in an ODI on Wednesday. Bangladesh, who have played 20 ODIs at this venue thus far, have won 13 and lost seven over the years. Bangladesh vs Afghanistan 1st ODI Live Telecast Channel in India and Bangladesh Continuing with a latest trend, international cricket in Bangladesh will once again not be available for television viewing in India. Hence, Indian fans will have to do with a streaming platform to follow Afghanistan’s tour of Bangladesh 2022. Digital mode of viewing isn’t novel for the Indian fans as they have been consuming international cricket in New Zealand, West Indies and Ireland via streaming platforms in the recent years. Streaming platform Fan Code will be streaming this series at a nominal price. Unlike recent times, Fan Code have made a provision for a one-match pass. Interested fans can buy the same on the website or mobile application of FanCode by paying INR 9 (53% discounted price). On the other hand, Indian fans who wish to buy a pass for the whole series (three ODIs and two T20Is), will have to pay a 51% discounted price of INR 49. As far as the Bangladeshi fans are concerned, they will be able to follow Chattogram ODIs on T Sports. There’s also a strong possibility of the matches being live streamed on the YouTube channel of T Sports. Date – 23/02/2022 (Wednesday). Match start Time – 10:30 AM (India) and 11:00 AM (Bangladesh). TV Channel – Not available (India) and T Sports (Bangladesh). Online platform – FanCode (India) and T Sports YouTube channel (Bangladesh). The post Bangladesh vs Afghanistan 1st ODI Live Telecast Channel in India and Bangladesh: When and where to watch BAN vs AFG Chattogram ODI? appeared first on The SportsRush.","pubDate":"2022-02-22 10:48:46","full_description":"Bangladesh vs Afghanistan 1st ODI Live Telecast Channel: The SportsRush presents before you the timing and live streaming details of the 1st BAN vs AFG ODI. With multiple players from both the teams coming on the back of respective Bangladesh Premier League and Pakistan Super League stints, they will now lock horns against each other in the first ODI of Afghanistan’s tour of Bangladesh 2022 at the Zahur Ahmed Chowdhury Stadium tomorrow. Having last played an ODI against each other during the ICC Cricket World Cup 2019 in Southampton, Bangladesh and Afghanistan will resume their ODI rivalry after more than 30 months. In eight ODIs against each other till date, Bangladesh have a slight 5-3 lead. Among the four ODIs in Bangladesh, both the hosts and visitors have won twice each. 📸📸 Snapshots from #AfghanAtalan ‘s first training session under the interim head coach Stuart Law in Chattogram ahead of the ODI series vs 🇧🇩 💪💪 #AFGvBD pic.twitter.com/cZM3YicGkI — Afghanistan Cricket Board (@ACBofficials) February 20, 2022 Set to host an ODI after more than a year, Chattogram will be hosting Afghanistan for the first time in an ODI on Wednesday. Bangladesh, who have played 20 ODIs at this venue thus far, have won 13 and lost seven over the years. Continuing with a latest trend, international cricket in Bangladesh will once again not be available for television viewing in India. Hence, Indian fans will have to do with a streaming platform to follow Afghanistan’s tour of Bangladesh 2022. Digital mode of viewing isn’t novel for the Indian fans as they have been consuming international cricket in New Zealand, West Indies and Ireland via streaming platforms in the recent years. Streaming platform Fan Code will be streaming this series at a nominal price. Unlike recent times, Fan Code have made a provision for a one-match pass. Interested fans can buy the same on the website or mobile application of FanCode by paying INR 9 (53% discounted price). On the other hand, Indian fans who wish to buy a pass for the whole series (three ODIs and two T20Is), will have to pay a 51% discounted price of INR 49. As far as the Bangladeshi fans are concerned, they will be able to follow Chattogram ODIs on T Sports. There’s also a strong possibility of the matches being live streamed on the YouTube channel of T Sports. Date – 23/02/2022 (Wednesday). Match start Time – 10:30 AM (India) and 11:00 AM (Bangladesh). TV Channel – Not available (India) and T Sports (Bangladesh). Online platform – FanCode (India) and T Sports YouTube channel (Bangladesh).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Aim Is To Stay Positive And Be \"Willing To Take Some Risks\": Tim David","link":"https://sports.ndtv.com/cricket/ipl-2022-aim-is-to-have-positive-approach-and-be-willing-to-take-some-risks-says-tim-david-2782452","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022: Tim David was snapped up by Mumbai Indians after a bidding war in the mega auction and represents Singapore in international cricket.","content":null,"pubDate":"2022-02-22 10:22:38","full_description":"Currently trying to pick Kieron Pollard and Rohit Sharma's brains, Mumbai Indians' Rs 8.25 crore big-hitting recruit Tim David says he will be \"willing to take some risks\" in the upcoming IPL, as that is his approach. The power-hitter from Australia, who has so far earned his international stripes for his birthplace of Singapore and not the country where he was raised, was snapped up by MI after a fierce bidding war in the IPL mega auction recently. A great admirer of Pollard, David has been trying to imitate the power game of the veteran West Indian swashbuckler heading into the 15th edition of the lucrative league, and feels the two of them can do a lot together. \"It is an exciting idea to bat with him. Polly is someone I have admired for his power-hitting and have looked at some of his innings to see how I can do that myself. If we could get going in the middle and death overs, we could take a few games away,\" David told mumbaiindians.com. On skipper Rohit and his approach, David said, \"Rohit Sharma is a world-class player. He just looks so effortless when he bats, it's very admirable. It is a huge bonus to be able to spend time with class players and try to pick their brains a little bit. \"I try to keep it simple. I could come in a lot of different situations but my aim is always to have a positive approach and be willing to take some risks. Sometimes it may not come off but there is no better feeling than hitting one off the middle of the bat and it going for a big six.\" David has experience of playing for various franchises across the world -- Royal Challengers Bangalore in 2021 IPL, Perth Scorchers and Hobart Hurricanes in the Big Bash League, Lahore Qalandars and Multan Sultans in the Pakistan Super League, Southern Brave in The Hundred and Saint Lucia Kings in the Caribbean Premier League. MI head coach Mahela Jayawardene, who has worked with David in the Hundred, might have had a say in the selection of what he terms a \"hot property\" in the shortest format. \"I think he is a hot property at the moment. In T20 cricket, he is known as a power-hitter. We have always had those options at Mumbai Indians. \"When we plan the auction and when we knew we had funds available after the Jofra Archer bid, we took into account the auction dynamics because a lot of the uncapped players were available and Tim became a great target for us,\" Jayawardene said. The Sri Lankan batting great and former captain added, \"Like we have the Bumrah-Jofra combination to look forward to, we can have the Pollard-Tim David combination at the back-end of the innings. \"Tim is a much improved player in the last few months and he is still young. We look forward to have him in the dressing room. You saw the price (8.25 Crore), it kept going up and many teams were interested in him, not just us. I am sure he will have a fabulous IPL career.\" David has represented Singapore in international cricket in 14 T20Is, scoring 558 runs at an average of 46.5 and a strike rate of 158.52 since his debut against Qatar in July 2019. Promoted The 25-year-old David is looking forward to utilise the opportunity of facing people like Jasprit Bumrah at MI nets to prepare himself better for the tournament. \"One bowler I am looking forward to facing the most in the nets is Bumrah. I know it sounds strange because he is one of the best in the world but I believe it will be great to test myself against him. I am sure it is going to be hard work.\"","image_url":"https://c.ndtvimg.com/2021-08/nvm04p78_tim-david_625x300_22_August_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"WA squad tests negative after batter Jayden Goodwin’s COVID diagnosis","link":"https://thewest.com.au/sport/cricket/wa-squad-tests-negative-after-batter-jayden-goodwins-covid-diagnosis-c-5797754","keywords":null,"creator":["Braden Quartermaine"],"video_url":null,"description":"WA Cricket confident COVID has not spread through the squad beyond Jayden Goodwin’s diagnosis.","content":null,"pubDate":"2022-02-22 09:41:35","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5797754/97d1106010be17c481a4db228e1bf1989b048838-16x9-x0y80w3176h1787.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"\"Why I Didn't Reveal Journalist Name\": Wriddhiman Saha On Explosive Tweet - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvd3JpZGRoaW1hbi1zYWhhLXNheXMtaGUtd2lsbC1ub3QtcmV2ZWFsLWlkZW50aXR5LW9mLWpvdXJuYWxpc3QtMjc4MjA5OdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Why I Didn't Reveal Journalist Name\": Wriddhiman Saha On Explosive Tweet  NDTV SportsICA condemns threatening messages to Wriddhiman Saha, India cricket, Ganguly | Cricbuzz.com - Cricbuzz  Cricbuzz'If BCCI ask me to reveal the name, I would...': Wriddhiman Saha breaks silence on reporter threat case  Hindustan Times\"Shocking\": Ravi Shastri Asks Sourav Ganguly To Step In After Wriddhiman Saha Shares Screenshot Of M..  NDTV Sports'Better Ways to Ask For an Interview': Gautam Gambhir on Wriddhiman Saha Being Threatened For Snubbing a Jo  News18View Full coverage on Google News","content":null,"pubDate":"2022-02-22 09:16:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"PAK vs AUS tickets: Australia tour of Pakistan 2022 tickets","link":"https://thesportsrush.com/cricket-news-pak-vs-aus-tickets-australia-tour-of-pakistan-2022-tickets/","keywords":["Cricket","Australia","Australia tour of Pakistan 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"PAK vs AUS tickets 2022: The SportsRush present before you full ticketing details for Australia’s tour of Pakistan 2022. Australia will become the first team among “The Big Three” cricketing nations to resume playing international cricket in Pakistan from next month. In what will be their first Pakistan tour in 24 years, Australia will be… The post PAK vs AUS tickets: Australia tour of Pakistan 2022 tickets appeared first on The SportsRush.","content":"PAK vs AUS tickets 2022: The SportsRush present before you full ticketing details for Australia’s tour of Pakistan 2022. Australia will become the first team among “The Big Three” cricketing nations to resume playing international cricket in Pakistan from next month. In what will be their first Pakistan tour in 24 years, Australia will be playing three Tests, three ODIs and a T20I between March 4 – April 5. With New Zealand’s last-minute withdrawal having a negative impact on England’s tour as well, Australia traveling to Pakistan for an all-format tour will mean the world to cricket in Pakistan. It was this morning that CA (Cricket Australia) had announced a 16-member white-ball squad for the tour of Pakistan. With a lone T20I to be played, Australia haven’t named separate ODI and T20I squads. Despite senior quartet of Pat Cummins, Mitchell Starc, Josh Hazlewood and David Warner not named in the white-ball squad, they (in addition to players touring Pakistan) are quite likely to miss few matches of Indian Premier League 2022. PAK vs AUS tickets Pakistani spectators’ hunger of watching top-level cricket in their own country is currently being seen in Pakistan Super League 2022. Hence, there is no reason as to why they wouldn’t be eagerly waiting for the upcoming Pakistan vs Australia series. Readers must note that Rawalpindi (first Test, three ODIs and one-off T20I), Karachi (second Test) and Lahore (third Test) have been shortlisted as the three venues for this series. Has anyone else lost interest in this PSL? I’m just looking forward to the #PAKvAUS series now — Haroon (@hazharoon) February 21, 2022 With Rawalpindi not getting to host any PSL 2022 match, fans are anticipated to fill the Rawalpindi Cricket Stadium next month onward. The city had last hosted a Pakistan vs South Africa Test match last year. As far as the tickets for these matches are concerned, they are yet to be put on sale for general public. However, as was the case in PSL 7, Pakistan vs Australia tickets are also likely to be available on BookMe. The post PAK vs AUS tickets: Australia tour of Pakistan 2022 tickets appeared first on The SportsRush.","pubDate":"2022-02-22 08:53:36","full_description":"PAK vs AUS tickets 2022: The SportsRush present before you full ticketing details for Australia’s tour of Pakistan 2022. Australia will become the first team among “The Big Three” cricketing nations to resume playing international cricket in Pakistan from next month. In what will be their first Pakistan tour in 24 years, Australia will be playing three Tests, three ODIs and a T20I between March 4 – April 5. With New Zealand’s last-minute withdrawal having a negative impact on England’s tour as well, Australia traveling to Pakistan for an all-format tour will mean the world to cricket in Pakistan. It was this morning that CA (Cricket Australia) had announced a 16-member white-ball squad for the tour of Pakistan. With a lone T20I to be played, Australia haven’t named separate ODI and T20I squads. Despite senior quartet of Pat Cummins, Mitchell Starc, Josh Hazlewood and David Warner not named in the white-ball squad, they (in addition to players touring Pakistan) are quite likely to miss few matches of Indian Premier League 2022 . Pakistani spectators’ hunger of watching top-level cricket in their own country is currently being seen in Pakistan Super League 2022. Hence, there is no reason as to why they wouldn’t be eagerly waiting for the upcoming Pakistan vs Australia series. Readers must note that Rawalpindi (first Test, three ODIs and one-off T20I), Karachi (second Test) and Lahore (third Test) have been shortlisted as the three venues for this series. Has anyone else lost interest in this PSL? I’m just looking forward to the #PAKvAUS series now👀🤩 — Haroon (@hazharoon) February 21, 2022 With Rawalpindi not getting to host any PSL 2022 match, fans are anticipated to fill the Rawalpindi Cricket Stadium next month onward. The city had last hosted a Pakistan vs South Africa Test match last year. As far as the tickets for these matches are concerned, they are yet to be put on sale for general public. However, as was the case in PSL 7 , Pakistan vs Australia tickets are also likely to be available on BookMe.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Indian Cricketers' Association Issues Statement In Favour Of Wriddhiman Saha, Condemns Journalist's .. - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9jcmlja2V0L2luZGlhbi1jcmlja2V0ZXJzLWFzc29jaWF0aW9uLWlzc3Vlcy1zdGF0ZW1lbnQtaW4tZmF2b3VyLW9mLXdyaWRkaGltYW4tc2FoYS1jb25kZW1ucy1qb3VybmFsaXN0cy10aHJlYXRzLTI3ODIxOTnSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Indian Cricketers' Association Issues Statement In Favour Of Wriddhiman Saha, Condemns Journalist's ..  NDTV SportsICA condemns threatening messages to Wriddhiman Saha, India cricket, Ganguly | Cricbuzz.com - Cricbuzz  CricbuzzBCCI: 'We will speak to Saha and want to know if he was threatened'  ESPNcricinfo\"Why I Didn't Reveal Journalist Name\": Wriddhiman Saha On Explosive Tweet  NDTV Sports'If BCCI ask me to reveal the name, I would...': Wriddhiman Saha breaks silence on reporter threat case  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-02-22 08:52:23","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Women's ODI World Cup: Match officials for league stage announced","link":"https://www.indiatvnews.com/sports/cricket/womens-odi-world-cup-match-officials-for-league-stage-announced-2022-02-22-760937","keywords":null,"creator":null,"video_url":null,"description":"International Cricket Council (ICC) on Tuesday announced the match officials for the league stages of the upcoming Women's Cricket World Cup 2022, which is to be played across six venues in New Zealand from March 4 to April 3.","content":null,"pubDate":"2022-02-22 08:51:34","full_description":"International Cricket Council (ICC) on Tuesday announced the match officials for the league stages of the upcoming Women's Cricket World Cup 2022, which is to be played across six venues in New Zealand from March 4 to April 3. \"The International Cricket Council's commitment to support women officials reflects in the appointments with several making their ICC Women's Cricket World Cup debuts starting with the tournament opener between the West Indies and hosts New Zealand at the Bay Oval in Tauranga,\" stated in an official ICC release. Former South Africa player Shandre Fritz, who featured in 2005, 2009, and 2013 World Cups, will be the Match Referee in a Women's World Cup match for the first time in the opener, as will her compatriot Lauren Agenbag, the first woman from her country to umpire a T20I International. Sharfuddoula Ibne Shahid (on-field), Alex Wharf (third umpire), and Sue Redfern (fourth umpire) will be the other officials for the match. Apart from Agenbeg, Fritz, and Redfern, the other women officiating in the tournament are Match Referee GS Lakshmi and Umpires Kim Cotton, Claire Polosak, Eloise Sheridan, and Jacqueline Williams. Adrian Griffith, ICC Senior Manager - Umpires and Referees, said the appointments were part of ICC's policy of nurturing the best available talent in different countries. \"We are proud to announce eight women Match Officials in our team for the tournament. We had six women Match Officials at the ICC Women's T20 World Cup in 2020 and the steady upward path is as per our plans and keeping with our long-term vision,\" said Adrian Griffith in a statement. \"But while we have been continuously increasing the number of women officials, there have been no concessions and all of them deserve to be there. The appointments are based on merit, and they have made it to the top level because of their skill and perseverance,\" she added. The postings for the semifinals will be announced at the end of the round-robin stage while those for the final will be made after the semifinals. Gary Baxter, GS Lakshmi, Shandre Fritz. Umpires: Lauren Agenbag, Kim Cotton, Ahmad Shah Pakteen, Ruchira Palliyaguruge, Claire Polosak, Suzanne Redfern, Langton Rusere, Sharfuddoula Ibne Shahid, Eloise Sheridan, Alexander Wharf, Jacqueline Williams, Paul Wilson.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Bookme pk PSL tickets: Full PSL final tickets booking process","link":"https://thesportsrush.com/cricket-news-bookme-pk-psl-tickets-full-psl-final-tickets-booking-process/","keywords":["Cricket","Pakistan Super League","PSL","PSL tickets"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Bookme pk PSL tickets: The Pakistan Super League has reached it’s playoff stages, and the tickets are available for the mega-events. The Pakistan Super League 2022 has reached its business end. Multan Sultans, Lahore Qalandars, Peshawar Zalmi, and Islamabad United have qualified for the playoffs of the tournament. Karachi Kings and Quetta Gladiators got knocked… The post Bookme pk PSL tickets: Full PSL final tickets booking process appeared first on The SportsRush.","content":"Bookme pk PSL tickets: The Pakistan Super League has reached it’s playoff stages, and the tickets are available for the mega-events. The Pakistan Super League 2022 has reached its business end. Multan Sultans, Lahore Qalandars, Peshawar Zalmi, and Islamabad United have qualified for the playoffs of the tournament. Karachi Kings and Quetta Gladiators got knocked out after finishing at the bottom two positions. Multan Sultans and Lahore Qalandars will take on in the Qualifier game, whereas Peshawar Zalmi will be up against Islamabad United in the Eliminator 1 game. The winner of the Qualifier game will reach the finals, whereas the loser will get one more chance. The winner of the Eliminator 1 will face the loser of the Qualifier to reach the final of the tournament. The Qualifier will be played on 23 February 2022, whereas the final will take place on 27 February 2022. Lahore’s Gaddafi Stadium will host all the playoff games of PSL 2022. Bookme pk PSL tickets The craze has been great amongst the fans for the PSL games. Karachi’s leg of the tournament was a bit low, but the spectators have arrived in numbers for the Lahore leg. The great audience interest is a boost for the Pakistan Cricket Board as well. With an all-important Australian series coming, the interest of the home fans is a big boost for the board. The spectators in Pakistan can book their tickets from the Book Me website and app. A new lot of the tickets have been allotted for the fans. In terms of the available tickets, 1000 PKR is the minimum amount, whereas 3000 PKR is the maximum amount for the fans. LAST CHANCE to grab your tickets for the playoffs! #HBLPSL7 #LevelHai pic.twitter.com/SsoJp2ccHr — PakistanSuperLeague (@thePSLt20) February 22, 2022 All you have to do is click on the “Cricket” icon on the homepage. The next page will require you to click on “Book PSL 7 tickets”. Subsequently, select the preferred match and click on Book Me. To easily reach the Book Me page for booking tickets of PSL 7 matches at Gaddafi Stadium, click here. There are still a lot of tickets left, so the fans can book their place in the Gaddafi Stadium.   The post Bookme pk PSL tickets: Full PSL final tickets booking process appeared first on The SportsRush.","pubDate":"2022-02-22 08:47:51","full_description":"Bookme pk PSL tickets: The Pakistan Super League has reached it’s playoff stages, and the tickets are available for the mega-events. The Pakistan Super League 2022 has reached its business end. Multan Sultans, Lahore Qalandars, Peshawar Zalmi, and Islamabad United have qualified for the playoffs of the tournament. Karachi Kings and Quetta Gladiators got knocked out after finishing at the bottom two positions. Multan Sultans and Lahore Qalandars will take on in the Qualifier game, whereas Peshawar Zalmi will be up against Islamabad United in the Eliminator 1 game. The winner of the Qualifier game will reach the finals, whereas the loser will get one more chance. The winner of the Eliminator 1 will face the loser of the Qualifier to reach the final of the tournament. The Qualifier will be played on 23 February 2022, whereas the final will take place on 27 February 2022. Lahore’s Gaddafi Stadium will host all the playoff games of PSL 2022. The craze has been great amongst the fans for the PSL games. Karachi’s leg of the tournament was a bit low, but the spectators have arrived in numbers for the Lahore leg. The great audience interest is a boost for the Pakistan Cricket Board as well. With an all-important Australian series coming, the interest of the home fans is a big boost for the board. The spectators in Pakistan can book their tickets from the Book Me website and app. A new lot of the tickets have been allotted for the fans. In terms of the available tickets, 1000 PKR is the minimum amount, whereas 3000 PKR is the maximum amount for the fans. LAST CHANCE to grab your tickets for the playoffs! #HBLPSL7 #LevelHai pic.twitter.com/SsoJp2ccHr — PakistanSuperLeague (@thePSLt20) February 22, 2022 All you have to do is click on the “Cricket” icon on the homepage. The next page will require you to click on “Book PSL 7 tickets”. Subsequently, select the preferred match and click on Book Me. To easily reach the Book Me page for booking tickets of PSL 7 matches at Gaddafi Stadium, click here . There are still a lot of tickets left, so the fans can book their place in the Gaddafi Stadium.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"‘No contact’: Bayliss says he hasn’t been interviewed to replace Langer","link":"https://www.theage.com.au/sport/cricket/no-contact-bayliss-says-he-hasn-t-been-interviewed-to-replace-langer-20220222-p59yq6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Former England coach Trevor Bayliss has not heard from Cricket Australia as discussions continue around a replacement for Justin Langer.","content":null,"pubDate":"2022-02-22 07:53:35","full_description":"England’s former World Cup winning coach Trevor Bayliss has not been spoken to about Australia’s vacant coaching position. Bayliss sent a simple message to the Sydney Morning Herald and The Age saying “no contact” when asked if he had been interviewed for the position. Former England coach (right) Trevor Bayliss with Justin Langer before the Ashes Test at Lord’s in 2019. Credit: PA Images This increases the likelihood that interim coach Andrew McDonald , the popular favour to replace Justin Langer, will be offered the role if he receives clarity from Cricket Australia over the responsibilities of head coach. Chairman of the selectors George Bailey tacitly endorsed the current structure of McDonald and assistant coaches Michael Di Venuto and Jeff Vaughan during a press conference on Tuesday announcing Australia’s white ball squad to tour Pakistan . “Essentially what you’re after is trying to find the very best person for the role, and you want to keep them in there as long as possible,” Bailey said. “If that means that they don’t do absolutely every tour that’s fine. “The three assistants, including Andrew as interim coach, have all had head-coaching experience. “Even if you just looked internally, there are three guys there that could manage taking on head coach roles for specific tours if that was required.” Australia’s chairman of selectors George Bailey chats with paceman Scott Boland during an Ashes training session at Blundstone Arena. Credit: Getty Images Former coach Darren Lehmann believes the role is too big for one person across three different formats and should be split, with Ricky Ponting in the frame to become Twenty20 coach back in 2018 before circumstances changed. Bailey is not so sure. “It’s the people involved who would be key to that. This [white ball component of the Pakistan tour] is a good example, isn’t it?” he said. “There are different series where some players are available, and some players aren’t, just through managing multi-format players. “Imagine if you were in charge of just one format, and you weren’t getting access to the best players all the time, then that can have an impact. “But if that’s something you’ve worked through with the other coach then that can be worked through. “I don’t think there’s an easy answer. I don’t think there’s a one-size-fits-all [approach] and I don’t necessarily think whichever structure is landed on by Cricket Australia will necessarily be the right one when you next have to make that appointment.” Bayliss, a former NSW coach, took Sri Lanka to the 2011 World Cup final and won the title with England in 2019 . The current mentor to the Sydney Thunder, he has consistently said that the only international coaching job he would consider was Australia’s. However, he was always respectful that Langer held the position, praising the recent Australian Cricket Hall of Fame inductee and making it clear the job wasn’t available. As pressure mounted on Langer because of his volatility, which unsettled the dressing room, Bayliss’ simple and straightforward comments prompted a conspiracy theory suggesting the “NSW mafia” wanted to replace Langer with Bayliss. This gathered pace when two English journalists wrote during the Ashes that senior players, who are predominantly from NSW, including Test captain Pat Cummins, were overheard in a bar discussing Bayliss as a possible replacement coach. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage","country":["australia"],"category":["sports"],"language":"english"},{"title":"‘No contact’: Bayliss says he hasn’t been interviewed to replace Langer","link":"https://www.smh.com.au/sport/cricket/no-contact-bayliss-says-he-hasn-t-been-interviewed-to-replace-langer-20220222-p59yq6.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Former England coach Trevor Bayliss has not heard from Cricket Australia as discussions continue around a replacement for Justin Langer.","content":null,"pubDate":"2022-02-22 07:53:35","full_description":"England’s former World Cup winning coach Trevor Bayliss has not been spoken to about Australia’s vacant coaching position. Bayliss sent a simple message to the Sydney Morning Herald and The Age saying “no contact” when asked if he had been interviewed for the position. Former England coach (right) Trevor Bayliss with Justin Langer before the Ashes Test at Lord’s in 2019. Credit: PA Images This increases the likelihood that interim coach Andrew McDonald , the popular favour to replace Justin Langer, will be offered the role if he receives clarity from Cricket Australia over the responsibilities of head coach. Chairman of the selectors George Bailey tacitly endorsed the current structure of McDonald and assistant coaches Michael Di Venuto and Jeff Vaughan during a press conference on Tuesday announcing Australia’s white ball squad to tour Pakistan . “Essentially what you’re after is trying to find the very best person for the role, and you want to keep them in there as long as possible,” Bailey said. “If that means that they don’t do absolutely every tour that’s fine. “The three assistants, including Andrew as interim coach, have all had head-coaching experience. “Even if you just looked internally, there are three guys there that could manage taking on head coach roles for specific tours if that was required.” Australia’s chairman of selectors George Bailey chats with paceman Scott Boland during an Ashes training session at Blundstone Arena. Credit: Getty Images Former coach Darren Lehmann believes the role is too big for one person across three different formats and should be split, with Ricky Ponting in the frame to become Twenty20 coach back in 2018 before circumstances changed. Bailey is not so sure. “It’s the people involved who would be key to that. This [white ball component of the Pakistan tour] is a good example, isn’t it?” he said. “There are different series where some players are available, and some players aren’t, just through managing multi-format players. “Imagine if you were in charge of just one format, and you weren’t getting access to the best players all the time, then that can have an impact. “But if that’s something you’ve worked through with the other coach then that can be worked through. “I don’t think there’s an easy answer. I don’t think there’s a one-size-fits-all [approach] and I don’t necessarily think whichever structure is landed on by Cricket Australia will necessarily be the right one when you next have to make that appointment.” Bayliss, a former NSW coach, took Sri Lanka to the 2011 World Cup final and won the title with England in 2019 . The current mentor to the Sydney Thunder, he has consistently said that the only international coaching job he would consider was Australia’s. However, he was always respectful that Langer held the position, praising the recent Australian Cricket Hall of Fame inductee and making it clear the job wasn’t available. As pressure mounted on Langer because of his volatility, which unsettled the dressing room, Bayliss’ simple and straightforward comments prompted a conspiracy theory suggesting the “NSW mafia” wanted to replace Langer with Bayliss. This gathered pace when two English journalists wrote during the Ashes that senior players, who are predominantly from NSW, including Test captain Pat Cummins, were overheard in a bar discussing Bayliss as a possible replacement coach. Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"smh","country":["australia"],"category":["sports"],"language":"english"},{"title":"“Virat Kohli has just dropped off a little bit”: When Shane Warne picked his top-5 current test batters list","link":"https://thesportsrush.com/cricket-news-virat-kohli-has-just-dropped-off-a-little-bit-when-shane-warne-picked-his-top-5-current-test-batters-list/","keywords":["Cricket","Shane Warne","Steve Smith","Virat Kohli"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"During the Ashes 2021-22, Shane Warne picked his current top-5 test batters. Steve Smith topped the list, whereas Virat Kohli also featured. Shane Warne is arguably one of the greatest players to ever play the game. He was the first bowler in the world to claim 700 test wickets. He ended his career with 708… The post “Virat Kohli has just dropped off a little bit”: When Shane Warne picked his top-5 current test batters list appeared first on The SportsRush.","content":"During the Ashes 2021-22, Shane Warne picked his current top-5 test batters. Steve Smith topped the list, whereas Virat Kohli also featured. Shane Warne is arguably one of the greatest players to ever play the game. He was the first bowler in the world to claim 700 test wickets. He ended his career with 708 test wickets, whereas he has 293 ODI wickets under his belt. Warne also bowled the “Ball of the Century” in the 1993 Ashes. Apart from his on-field records, Warne has had a lot of controversies throughout his career. He failed the drug test ahead of the 2003 World Cup. Warne even passed on the critical information to a bookmaker about the game. He has also been in a rift with Muttiah Muralitharan, Arjuna Ranatunga and Steve Waugh. Despite all the off-field controversies, Warne is hugely admired in the cricketing circuit. Shane Warne picks his top-5 test batters During the Ashes 2021-22, Shane Warne was working for Fox Cricket. Shane Warne picked his top-current test batters during the segment. Shane Warne picked Australian vice-captain Steve Smith at the top position. Warne said that Smith is an all-condition player and has the ability to play against different bowling attacks. “I’ve got Steve Smith. In all conditions and against all bowling attacking across all times, Smith is outstanding,” Warne said on Fox Cricket. “Best cricketer on the planet. Love him. I think he’s great for the game.” – Shane Warne on Virat Kohli. @imVkohli @ShaneWarne pic.twitter.com/xm9SZ4KwqP — Harsh (@100off52) December 13, 2021 However, Steve Smith had an average outing in the Ashes. Warne picked Joe Root at the second position. Root had a year to remember in 2021 in terms of individual performances. Root scored 1708 test runs in 2021 at 61.00, with six centuries and four half-centuries. Kane Williamson was at the third position in Warne’s list. “Joe Root is number two. He has made 6 hundreds in this calendar year. Kane Williamson is always in thereabouts,” said Warne. Shane Warne picked Virat Kohli and Marnus Labuschagne as the final two batters. Although, Warner said that Virat Kohli moved down in the list due to his recent failures. “Virat Kohli has just dropped off a little bit, and then Marnus (Labuschagne) rounds up the top-5 for me,” Warne added. The post “Virat Kohli has just dropped off a little bit”: When Shane Warne picked his top-5 current test batters list appeared first on The SportsRush.","pubDate":"2022-02-22 07:43:01","full_description":"During the Ashes 2021-22, Shane Warne picked his current top-5 test batters. Steve Smith topped the list, whereas Virat Kohli also featured. Shane Warne is arguably one of the greatest players to ever play the game. He was the first bowler in the world to claim 700 test wickets. He ended his career with 708 test wickets, whereas he has 293 ODI wickets under his belt. Warne also bowled the “Ball of the Century” in the 1993 Ashes. Apart from his on-field records, Warne has had a lot of controversies throughout his career. He failed the drug test ahead of the 2003 World Cup. Warne even passed on the critical information to a bookmaker about the game. He has also been in a rift with Muttiah Muralitharan , Arjuna Ranatunga and Steve Waugh . Despite all the off-field controversies, Warne is hugely admired in the cricketing circuit. During the Ashes 2021-22, Shane Warne was working for Fox Cricket. Shane Warne picked his top-current test batters during the segment. Shane Warne picked Australian vice-captain Steve Smith at the top position. Warne said that Smith is an all-condition player and has the ability to play against different bowling attacks. “I’ve got Steve Smith. In all conditions and against all bowling attacking across all times, Smith is outstanding,” Warne said on Fox Cricket. “Best cricketer on the planet. Love him. I think he’s great for the game.” – Shane Warne on Virat Kohli. @imVkohli @ShaneWarne pic.twitter.com/xm9SZ4KwqP — Harsh (@100off52) December 13, 2021 However, Steve Smith had an average outing in the Ashes. Warne picked Joe Root at the second position. Root had a year to remember in 2021 in terms of individual performances. Root scored 1708 test runs in 2021 at 61.00, with six centuries and four half-centuries. Kane Williamson was at the third position in Warne’s list. “Joe Root is number two. He has made 6 hundreds in this calendar year. Kane Williamson is always in thereabouts,” said Warne. Shane Warne picked Virat Kohli and Marnus Labuschagne as the final two batters. Although, Warner said that Virat Kohli moved down in the list due to his recent failures. “Virat Kohli has just dropped off a little bit, and then Marnus (Labuschagne) rounds up the top-5 for me,” Warne added.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"You have elevated your level of cricket every year: Yuvraj to Virat Kohli","link":"https://www.indiatvnews.com/sports/cricket/you-have-elevated-your-level-of-cricket-every-year-yuvraj-singh-to-virat-kohli-2022-02-22-760906","keywords":null,"creator":null,"video_url":null,"description":"Former India all-rounder Yuvraj Singh on Tuesday wrote a heartfelt letter to batter Virat Kohli and said that he has seen the southpaw grow as a cricketer and as a person.","content":null,"pubDate":"2022-02-22 07:20:07","full_description":"Former India all-rounder Yuvraj Singh on Tuesday wrote a heartfelt letter to batter and said that he has seen the southpaw grow as a cricketer and as a person. In the letter, Yuvraj commended Kohli for his dedication and discipline towards his craft that serves as an inspiration for the future generation. \"Virat, I've seen you grow as a cricketer and as a person. From that young boy in the nets who would walk shoulder-to-shoulder with the legends of Indian cricket, you're now a legend yourself leading the way for a new generation. Your discipline in the nets, passion on the field, and dedication to the sport inspire every young kid in this country to pick up the bat and dream of putting on the blue jersey one day,\" wrote Yuvraj in the letter. The swashbuckling batter, who holds the record of fastest fifty in T20 Internationals, also recounted the memories spent together with Kohli, be it scoring runs for the country or sharing lighter moments off the field. \"You have elevated your level of cricket every single year and achieved so much already in this wonderful game. You have been a legendary captain and a fantastic leader. Always keep the fire inside you burning. You're a superstar. Here's a special golden boot for you. Keep making the country proud,\" he added. Yuvraj, who shares a close association with sports brand PUMA alongside Kohli, also took the occasion to gift one of India's most successful captains a special edition of PUMA's golden boots.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"On This Day: Shoaib Akhtar bowled fastest delivery in international cricket","link":"https://indianexpress.com/article/sports/cricket/this-day-that-year-shoaib-akhtar-clocked-fastest-delivery-in-international-cricket-7785021/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-22 06:53:27","full_description":"Pakistan speedster Shoaib Akhtar aka ‘Rawalpindi Express’ was an almost one-of-a-kind bowler, who heightened the effect of raw pace to a degree rarely seen at the highest level of the game. On 22 February 2003, the Pakistani pacer bowled the quickest delivery, 161.3 kph (100.23 mph), against England in the ICC World Cup fixture at Cape Town. #OnThisDay in 2003, @shoaib100mph registered his name in the record books by bowling the fastest ball officially recorded at 100.2 MPH in @cricketworldcup match against England. Batting at number 11, Shoaib also scored a 16-ball 43 – record at that time. pic.twitter.com/wthbZn19rp — Pakistan Cricket (@TheRealPCB) February 22, 2022 The batter facing Akhtar’s fearsome bowling was former England opener, Nick Knight. The rest five balls of that over were recorded at speeds of 153.3 kph, 158.4 kph, 158.5 kph, 157.4 kph and 159.5 kph — the average being 158.06 kph. By doing so, Akhtar became the first man to cross the 100 mph barrier. Akhtar has bagged 178 wickets in 46 Tests, 247 wickets in 163 ODIs, and 19 wickets in 15 T20Is. Shaun Tait, born on February 22, 1983, bowled the second faster ball in cricket history. The Australian pacer clocked 161.1 kph (100.10 mph) against England in 2010 at Lord’s. Another Aussie Brett Lee, too, is the joint-second in the list of bowling fast. He had clocked 161.1 kph against New Zealand at Napier in 2005.","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia’s richest man Mukesh Ambani joins $5 billion IPL fight, taking on Amazon, Disney, for jewel in cricket’s crown","link":"https://www.scmp.com/sport/cricket/article/3167924/asias-richest-man-mukesh-ambani-joins-5-billion-ipl-fight-taking?utm_source=rss_feed","keywords":null,"creator":["Bloomberg"],"video_url":null,"description":"Mukesh Ambani’s conglomerate is bringing together a consortium aiming to outbid entertainment giants Amazon, Disney and Sony for the telecast rights to the Indian Premier League – a prize that could be worth $5 billion or more in the cricket-crazy nation of almost 1.4 billion people.Helmed by Asia’s richest man, Reliance Industries Ltd and its television partner Viacom Inc are in talks to include James Murdoch-founded Lupa Systems LLC as well as Comcast Corp in the consortium, according to…","content":null,"pubDate":"2022-02-22 06:15:13","image_url":"https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/02/22/128128bc-cd45-4530-8a9d-b6465faaa896_c86aa3a1.jpg?itok=5adLESfW","source_id":"scmp","country":["china"],"category":["sports"],"language":"english"},{"title":"Wriddhiman Saha Controversy: Cricketer Unwilling To Reveal Name Of The Threatening Journo","link":"https://www.sentinelassam.com/sports/cricket/wriddhiman-saha-controversy-cricketer-unwilling-to-reveal-name-of-the-threatening-journo-579514","keywords":["Breaking News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Saha stated that he doesn’t want to ruin the journalist’s career by revealing his identity. ICA representative on the IPL Governing Council, Pragya Ojha ensured legal support in pursuing the matter.","content":"NEW DELHI: Indian International Cricketer Wriddhiman Saha has now become the key topic of discussions among the Indian cricket fraternity since he had shared the threatening messages of a Journalist on social media.Several Indian former cricketers have requested the BCCI president Saurav Ganguly to get all details about the matter through proper investigation. Soon after this on Monday 21 February the treasurer Arun Dhumal gave confirmation that the board would discuss with Saha and ask him to tell the name of the mentioned journalist. The veteran wicket-keeper batsman seems like he will not disclose the name or any other details of the journalist even after the BCCI (Board of Control for Cricket In India) has been repeatedly asking him about the name of the particular journalist. In his tweet on Saturday 19 February, Saha shared the screenshot of the message of a journalist which reads \"You did not call, I'll never interview you again, I don't take insults kindly and I'll remember this.\"After all of my contributions to Indian cricket..this is what I face from a so called \"Respected\" journalist! This is where the journalism has gone. pic.twitter.com/woVyq1sOZX— Wriddhiman Saha (@Wriddhipops) February 19, 2022Since the expose of the threatening messages on the microblogging site, Saha has been in limelight as cricket fans along with cricket authorities and media are much curious to know about the said journalist. However, Saha doesn't want to ruin the career of the journalist therefore he continues to be strong with opinion in not disclosing who the journalist is. On speaking with the media, the cricketer stated that he had no intention of harming someone's career to pull a person down and it is only for this reason that he had not mentioned the journalist's name in his tweet. He further added that his key intention of posting the tweet was to expose the truth that there are people from media who do such activities that disrespect a player's wish. Saha made it clear that he had no intention is sharing the identity of the person earlier and neither does he wants to reveal it now. He also mentioned that the person who did this knows it well and he didn't want players to face such things. He wanted to let the person know that whatever he did was not correct and no one else should repeat such things. Meanwhile, the cricketer informed that Ganguly has not yet contacted him but the representative of ICA on the IPL Governing Council, Pragya Ojha contacted him about the matter and ensured him all support from BCCI in pursuing the issue legally. Also read: India clear about World Cup team combination: DravidAlso watch: ","pubDate":"2022-02-22 06:13:36","full_description":"NEW DELHI: Indian International Cricketer Wriddhiman Saha has now become the key topic of discussions among the Indian cricket fraternity since he had shared the threatening messages of a Journalist on social media. Several Indian former cricketers have requested the BCCI president Saurav Ganguly to get all details about the matter through proper investigation. Soon after this on Monday 21 February the treasurer Arun Dhumal gave confirmation that the board would discuss with Saha and ask him to tell the name of the mentioned journalist. The veteran wicket-keeper batsman seems like he will not disclose the name or any other details of the journalist even after the BCCI (Board of Control for Cricket In India) has been repeatedly asking him about the name of the particular journalist. In his tweet on Saturday 19 February, Saha shared the screenshot of the message of a journalist which reads \"You did not call, I'll never interview you again, I don't take insults kindly and I'll remember this.\" After all of my contributions to Indian cricket..this is what I face from a so called \"Respected\" journalist! This is where the journalism has gone. pic.twitter.com/woVyq1sOZX Since the expose of the threatening messages on the microblogging site, Saha has been in limelight as cricket fans along with cricket authorities and media are much curious to know about the said journalist. However, Saha doesn't want to ruin the career of the journalist therefore he continues to be strong with opinion in not disclosing who the journalist is. On speaking with the media, the cricketer stated that he had no intention of harming someone's career to pull a person down and it is only for this reason that he had not mentioned the journalist's name in his tweet. He further added that his key intention of posting the tweet was to expose the truth that there are people from media who do such activities that disrespect a player's wish. Saha made it clear that he had no intention is sharing the identity of the person earlier and neither does he wants to reveal it now. He also mentioned that the person who did this knows it well and he didn't want players to face such things. He wanted to let the person know that whatever he did was not correct and no one else should repeat such things. Meanwhile, the cricketer informed that Ganguly has not yet contacted him but the representative of ICA on the IPL Governing Council, Pragya Ojha contacted him about the matter and ensured him all support from BCCI in pursuing the issue legally. Also read: India clear about World Cup team combination: Dravid Also watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/22/315601-wriddhiman-saha-biography.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Birmingham Unicorns: Zoom meetings to playing at Edgbaston","link":"https://www.skysports.com/cricket/news/12040/12547976/birmingham-unicorns-trailblazing-lgbt-inclusive-cricket-club-who-want-to-make-sport-open-for-all","keywords":null,"creator":null,"video_url":null,"description":"Birmingham Unicorns are thought to be only the second LGBT+ inclusive cricket club in the world. The popular idea to form the club came during lockdown in 2020 with the new members first meeting on Zoom but now training at Edgbaston.","content":null,"pubDate":"2022-02-22 06:00:00","full_description":"Last Updated: 21/02/22 7:02pm Birmingham Unicorns are thought to be only the second LGBT+ inclusive cricket club in the world. The popular idea to form the club came during lockdown in 2020 with the new members first meeting on Zoom but now training at Edgbaston. The team are set to play in their second full season, and its founding member will soon join Warwickshire's Members Committee to improve the cricket county's inclusion and diversity. On their website the Unicorns describe the team as \"a place where all LGBTQ+ people and their allies can come to play cricket, be themselves and socialise with others from the community. We encourage everyone to be themselves, free of judgement, giving all the opportunity to be part of a cricketing family\". In less than 18 months, the Birmingham Unicorns went from Zoom meetings to a social to meet each other to practising together, and then playing their first match against Graces who were the world's first LGBT+ club. The idea for a new club came from Lachlan Smith who is now the founder and chair of the Midlands team. He told Sky Sports News : \"It all started in the first Covid lockdown. I was aware that everybody was feeling isolated, people were having mental health problems. And I know for the LGBT+ community that can be particularly profound and it was at the time. \"As a cricketer myself, I thought playing sports is a great way to help you with your mental health. And if I could open the doors for more LGBT+ people to play cricket, that would be great. \"But I thought who knows whether people actually want to do it?\" Smith was surprised by the interest from the first survey he carried out. He said: \"People found out about the club or the idea for the club and they wanted to join. \"It snowballed from there and so here we are two years later, about to enter our second season, and we're a club that focuses on enabling LGBT+ people to play cricket in a supportive environment.\" The club also welcome those who are not from similar backgrounds, who they describe as \"allies\". \"It's not just for the LGBT community. Anybody can come and play for us, particularly if they're new to the sport and don't quite know where to start. We try to provide an environment where people can have a go,\" Smith added. Hattie Wright, one of approximately 20 playing members, praises the atmosphere at the newly-formed club. She said: \"You just need to look around [training] there's smiles, there's happiness. Everyone just feels joy, liberated. There's no airs and graces about anything. We're family here. \"We haven't known each other two years yet. We first all met together on a social event with the Graces team from down south. And that was the first time we met face to face. We've seen each other on Zoom, but it's like we've known each other all our lives. That unity you can't get anywhere else.\" On June 13 two LGBT+ teams faced each other for the first time when Graces, based in London, faced Birmingham Unicorns. Before the historic match ECB chief executive Tom Harrison said: \"It's really fantastic to see two teams like Graces and Unicorns - teams formed with LGBTQ+ inclusion at their heart - joining together to take part in this historic match. PLAYERS WANTED! If you want to get involved in playing 🏏 for Birmingham Unicorns CC, we want to hear from you!! Regardless of gender, race, age, ability or sexuality, everyone is welcome! 🏳️‍🌈🏳️‍⚧️🏏🦄 pic.twitter.com/eM8d1PCh9Q \"Teams like Graces and Unicorns, and events like Sunday's, can play a big role in helping to further welcome LGBTQ+ cricket fans and cricket players alike, and I'm really excited about the game of cricket coming together to break down barriers and become more inclusive.\" The 40-over match took place at Weoley Hill Cricket Club in Birmingham. Graces made 227-8 in their innings thanks to a century from Matt Earl. Birmingham Unicorns fell 39 runs short as they finished on 189-6. The match was also streamed on YouTube with over 1,500 views and dozens of good luck messages for the players. \" We had commentators there commentating. The game was live streamed. We had viewers all over the world, significant viewers in parts of Asia and India as well, which was fantastic,\" Smith told Sky Sports News . \"But it just felt like it was the first step in making a real change in cricket.\" Stephen Hallam, treasurer for the Unicorns, has been surprised by the huge level of interest in the team. He said: \"I had no idea it was as groundbreaking as it was, and hopefully it will start to spur other clubs around the country. There will definitely be demand in other cities. \"We've got quite a wide range in terms of location where people come from. It's not just Birmingham it's all over the West Midlands, so hopefully there'll be lots more clubs follow our leads. That's the aim for the future. \" Warwickshire's chief executive Stuart Cain praised the work of the Birmingham Unicorns for being an open and inclusive place to play cricket. He said: \"You have to give people a safe and welcome environment. And so I think to say there's a club that understands the LGBTQ community, it welcomes and it creates a safe environment for them to play, helps them step over the threshold and start playing club cricket. Please use Chrome browser for a more accessible video player \"And then once they're doing that, it makes other clubs realise, this is just another form of people that just love cricket, regardless of their background and who they are and what they are.\" Smith says his experience of playing cricket has been largely positive but says even though he has played at supportive clubs, a few bad experiences for players can \"niggle at and wear away at you\". He added: \"The environment in which they're playing there might be banter or conversation or things said which are inherently homophobic, transphobic or biphobic, and that just makes it feel like you can't come out. \"And I certainly experienced that for a few years before I came out as a cricketer, and I wasn't sure if I wanted to because the environment doesn't feel quite right. A lot of the language used by my team-mates, by club members, by opposition players made me feel uncomfortable in the sport. \"So although it wasn't directed at me, it was sort of the wider environment that made it a bit more uncomfortable.\" Warwickshire made a commitment to help the Birmingham Unicorns which has included coaching sessions with first-team coach Mark Robinson and director of cricket Paul Farbrace. Cain said: \"Last year we helped them in terms of profile and platform, so we raised awareness with our social channels and through the website that Unicorns existed. Then through the cricket board we helped them get set up with kit and getting off the ground. So a lot of people stepped forward then and joined the club. We helped with access to the cricket centre. \"Mark Robinson and Paul Farbrace came down and took coaching sessions which I'm not sure if that scared or helped! Please use Chrome browser for a more accessible video player \"And then Lachlan Smith will be joining our Members Committee in the next couple of months. So he'll sit right at the top of the club in terms of helping us understand and advise us on making sure that Edgbaston, the Cricket Centre, the Academy just feels a safe and welcome place for all. Cain was speaking to Sky Sports News during a training session at Edgbaston for the Unicorns and has a vision for the city's first LGBT+ inclusive team. \"The ambition is that they'll play in the league in the next two to three years and then after that hopefully should get to a point where you don't need specialist teams, but you've raised awareness enough that everyone feels safe and welcome regardless of the team.\" We ( @bhamunicorns ) & @Graces_Cricket outlined some ways that #cricket clubs can be #inclsuive for the #LGBTQ community ( https://t.co/N18ihK71pa ) - what other ideas are there? Good practice examples? Experiences to share? Reply or DM - I'd love to hear about them #CricketTwitter Warwickshire recently became one of the first sporting organisations to announce a new Multifaith charter. It was created with input from representatives from Buddhism, Christianity, Hinduism, Islam, Jain, Judaism and Sikhism in the West Midlands. The club have promised to learn more about \"the needs of different faiths\" and create \"a safe, welcoming environment for players, staff and visitors\". Alongside this they will have \"tangible initiatives to drive inclusivity regardless of race, religion, gender, sexuality, class, social mobility, neural or physical ability\". Cain says hearing the recent powerful evidence from Azeem Rafiq has pushed them to act quicker. He said: \"We'd already started our journey to make sure that we reflect the communities that we serve in the offices, on the terraces and on the field. 𝙀𝙙𝙜𝙗𝙖𝙨𝙩𝙤𝙣 𝙛𝙤𝙧 𝙀𝙫𝙚𝙧𝙮𝙤𝙣𝙚 Today we become one of the first sporting organisations in the country to launch a Multifaith Charter as part of the new Edgbaston for Everyone initiative. 📝 https://t.co/UjCPZeBNqm pic.twitter.com/mXbMKp8ee0 \"But I think what happened with Azeem Rafiq just showed us that we haven't done enough and we weren't moving fast enough. So it just gave us a fresh impetus really to get behind some of this stuff and not talk about it, but just do it. \"So it's about actions, isn't it? What we've done with the Unicorns, what we've done with a multi-faith charter, what we're going to do at Edgbaston next season in terms of the way that will change things. \"They're just small steps on a journey that never ends. I don't think you can ever get your head around this properly and sit back and relax and go 'we've done a great job here'. Please use Chrome browser for a more accessible video player \"I think you just got to keep learning, keep listening, keep talking and keep changing. And hopefully what we want to get to is over six, 12, 18, 24 months people look back and go: 'Yeah it feels different at Edgbaston'.\"","image_url":"https://e1.365dm.com/22/02/1920x1080/skysports-cricket-birmingham-unicorns_5681432.jpg?20220221184440","source_id":"skysports","country":["united states of america","united kingdom","australia"],"category":["sports"],"language":"english"},{"title":"NZ-W vs IND-W: Richa Ghosh registers fastest fifty for Indian batter in ODIs","link":"https://www.indiatvnews.com/sports/cricket/nz-w-vs-ind-w-richa-ghosh-registers-fastest-fifty-for-indian-batter-in-odis-2022-02-22-760886","keywords":null,"creator":null,"video_url":null,"description":"Batter Richa Ghosh on Tuesday recorded the fastest fifty by an Indian batter in women's ODI cricket.","content":null,"pubDate":"2022-02-22 05:58:18","full_description":"Batter Richa Ghosh on Tuesday recorded the fastest fifty by an Indian batter in women's ODI cricket. She achieved the feat in the ongoing fourth ODI against New Zealand here at the John Davies Oval, Queenstown. Ghosh brought up her fifty off just 26 balls with the help of four 4s and four 6s. She departed after playing a knock of 52 runs. The ongoing fourth ODI was curtailed to 20-overs per side after rain played spoilsport. Earlier, Amelia Kerr played a knock of 68 runs from 33 balls with the help of 11 fours and 1 six as New Zealand posted 191/5 against India. Suzie Bates and Sophie Devine also played useful innings of 41 and 32 as the White Ferns posted a score of more than the 190-run mark. Amy Satterthwaite also chipped in with a knock of 32 runs from 16 balls. For India, Renuka Singh returned with two wickets.","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Cricket Australia grants NoC to David Warner, Pat Cummins to take part in league from THIS date","link":"https://zeenews.india.com/cricket/ipl-2022-cricket-australia-grants-noc-to-david-warner-pat-cummins-to-take-part-in-league-from-this-date-2438707.html","keywords":null,"creator":null,"video_url":null,"description":"Australia will tour Pakistan for the first time since 1998 for three Test matches, three ODIs, and one T20I. The last match will be played on April 5.","content":null,"pubDate":"2022-02-22 05:11:00","full_description":"Cricket Australia have granted a No-Objection Certificate to their centrally-contracted players to participate in the Indian Premier League (IPL) 2022 season from April 6. The likes of David Warner, Pat Cummins and Glenn Maxwell will miss the white-ball series against Pakistan, but Cricket Australia will not release its contracted stars to join IPL immediately. Sources in Cricket Australia confirmed that the players would only be available for their franchises once the tour of Pakistan concludes. “Yes, we have granted NoCs to our players to be available for their franchises from April 6 in the IPL. The players can be available only after the Pakistan tour concludes,” the sourced told news agency ANI. Australia will tour Pakistan for the first time since 1998 for three Test matches, three ODIs, and one T20I. The last match will be played on April 5. ICYMI: Australia have named their squad for three ODIs and one T20 against Pakistan #PAKvAUS See the full details here: https://t.co/LYj33si8de pic.twitter.com/fM8ykVieHR — cricket.com.au (@cricketcomau) February 22, 2022 The Test-playing contingent and staff are due to depart for Pakistan later this week while white ball players and staff will join mid-tour for the One-Day Internationals and T20 International. Warner and Mitchell Marsh will be playing for Delhi Capitals while Glenn Maxwell and Josh Hazlewood will represent Royal Challengers Bangalore. The IPL 2022 season is expected to start in the last week of March. Australia’s ODI and T20 squad: Aaron Finch (c), Sean Abbott, Ashton Agar, Jason Behrendorff, Alex Carey, Nathan Ellis, Cameron Green, Travis Head, Josh Inglis, Marnus Labuschagne, Mitchell Marsh, Ben McDermott, Kane Richardson, Steve Smith, Marcus Stoinis, Adam Zampa. (with ANI inputs)","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"India are World No. 1 in T20 cricket","link":"https://www.sentinelassam.com/sports-news/india-are-world-no-1-in-t20-cricket-579495","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"India’s 3-0 whitewash of West Indies in the T20I series helped them overtake England at the top of the ICC Men’s T20I Team Rankings released on Monday.","content":"Dubai: India's 3-0 whitewash of West Indies in the T20I series helped them overtake England at the top of the ICC Men's T20I Team Rankings released on Monday.The triumph helped India leapfrog England at the top of the T20 team rankings, with Rohit Sharma's side now matching the top rating of 269. While England and India both have the same rating (269), India have a total of 10,484 points, 10 more than England's 10,474. Pakistan (rating of 266), New Zealand (255) and South Africa (253) round out the top five countries, while Australia (249) remain in sixth after their 4-1 series victory over Sri Lanka. India are fourth in the ODI rankings with a rating of 110, with New Zealand (121), England (119) and Australia (116) occupying the top-three spots. IANS Also Read: SC Agrees To Hear Plea Seeking Cancellation Of Class X and XII Offline Board ExamAlso Watch:","pubDate":"2022-02-22 04:54:05","full_description":"Dubai: India's 3-0 whitewash of West Indies in the T20I series helped them overtake England at the top of the ICC Men's T20I Team Rankings released on Monday. The triumph helped India leapfrog England at the top of the T20 team rankings, with Rohit Sharma's side now matching the top rating of 269. While England and India both have the same rating (269), India have a total of 10,484 points, 10 more than England's 10,474. Pakistan (rating of 266), New Zealand (255) and South Africa (253) round out the top five countries, while Australia (249) remain in sixth after their 4-1 series victory over Sri Lanka. India are fourth in the ODI rankings with a rating of 110, with New Zealand (121), England (119) and Australia (116) occupying the top-three spots. IANS Also Read: SC Agrees To Hear Plea Seeking Cancellation Of Class X and XII Offline Board Exam Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2022/02/22/315529-00.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Aussie cricket selector defends shock star omissions from Tour","link":"https://au.sports.yahoo.com/cricket-2022-aussie-selector-defends-shock-star-omissions-from-tour-044913980.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-22 04:49:13","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-02/2b4854d0-939a-11ec-bfb5-c7115601b81c","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"}]}