{"newsArray":[{"article_id":"41760d8e6c2c77a1d26bc78579c6cbaa","title":"Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move'","link":"https://www.dailymail.co.uk/sport/cricket/article-12722273/Pat-Cummins-reveals-Glenn-Maxwells-incredible-injury-battle-201-run-World-Cup-innings-thats-hailed-best-literally-move.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Maxwell hit 10 sixes and 21 boundaries in his stunning knock - partly because he was in so much pain he could hardly walk, let alone run between wickets.","content":"Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move' Maxwell rescued Aussies with stunning knock vs Afghanistan Skipper Cummins labelled it the greatest ODI innings ever Said batter was a 'freak' for overcoming injury battle in India By Ian Chadband For Australian Associated Press Published: 21:43, 7 November 2023 | Updated: 21:43, 7 November 2023 e-mail 1 View comments Glenn Maxwell, Australia 's 'Big Show', has delivered the ultimate show of his pyrotechnic career, leaving the cricket world saluting what his captain Pat Cummins believes is the greatest innings ever played in a one-day international . The amazing Maxwell, barely able to walk as he hobbled along with a back issue and terrible cramping in Mumbai , somehow still blitzed an unbetean 201 - on effectively one leg - to drag Australia from 7-91, past Afghanistan's total of 5-291 by three wickets, and into the World Cup semis. 'I think that's the greatest ODI innings,' said Cummins, who had the best view in the Wankhede Stadium of the carnage as he contributed a crucial, unbeaten 12 at the other end in their unbroken, match-winning stand of 202 for the eighth wicket on Tuesday. Maxwell hit 10 sixes and 21 boundaries in his incredible knock despite battling severe cramp 'It's the best I've ever seen, probably the greatest ODI innings ever. We're just chatting about it, all the players, and we've decided it's one of those days where you just go 'I was there in the stadium the day Glenn Maxwell chased down that total by himself'. 'It's just a one-man show. I'm up the other end and don't see any gaps in the field, don't see where I'm going to score a boundary - and yet it seems like every time he sees that, it still just runs away for four. It looks so easy. 'He still can't move, and yet still manages to hit a six over the third man with a reverse – he's a freak.' Maxwell finished the job with the winning six - his 10th of the innings to go with 21 fours - and like so many of the big hits, had to pull it off magically with minimal foot movement because his cramping was so debilitating. Cummins (left) branded Maxwell (right) a 'freak' after he single-handedly saved Australia from disaster with an innings for the ages At one stage Cummins even told the next batter, Adam Zampa, to come down to the ground because Maxwell 'literally couldn't move' 'Maxi was out of this world. I couldn't even get on strike! You just let him do his thing when he's doing that - how am I going to say anything to someone who's like that?' laughed Cummins. 'Even from 200 behind, he was still mapping a way we could win the game. I was just trying to survive!' Still, it was only with about 20 minutes left that Cummins felt Australia could really pull off the miracle, even believing that the 35-year-old might have to be 'stretched off' with his cramping woes. 'His back was cramping pretty early on, then just hamstrings, calves. For one over he said his toe was gone,' reported Cummins. Australia's physiotherapist (pictured treating Maxwell) advised Cummins that taking the batter off the field could actually make his condition worse 'I kind of signalled to Zamps (next batter Adam Zampa) to get down here because he literally couldn't move and then the physio kind of convinced Maxi that if he came off, it might be worse off.' Maxwell - as long as he avoids the sort of golf buggy accident that waylaid him for the previous game - should be fine for the rest of a tournament where he's already hit the fastest World Cup hundred ever off 40 balls and now has Australia's highest-ever ODI score. 'I'm sure it will be fine for the next game - plenty of hydration, he'll be in the ice bath I'm sure, but it will be okay,' smiled Cummins. Pat Cummins Mumbai Afghanistan Share or comment on this article: Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move' e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:43:03","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/21/77523381-0-image-m-12_1699393238634.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"36b15f35f52f501b516ecff567dc8d14","title":"‘No other team would’ve done such a disgraceful act’: Mathews blasts Shakib, Bangladesh for timed out dismissal","link":"https://kashmirreader.com/2023/11/08/no-other-team-wouldve-done-such-a-disgraceful-act-mathews-blasts-shakib-bangladesh-for-timed-out-dismissal/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: Sri Lanka all-rounder Angelo Mathews launched a no-holds-barred attack on Shakib Al Hasan and the Bangladesh team for not using ‘common sense’ and withdrawing the appeal of timed out against him during a World Cup 2023 match at the Arun Jaitely Stadium in Delhi on Monday. Mathews became the first-ever cricketer in international […]","content":"New Delhi: Sri Lanka all-rounder Angelo Mathews launched a no-holds-barred attack on Shakib Al Hasan and the Bangladesh team for not using ‘common sense’ and withdrawing the appeal of timed out against him during a World Cup 2023 match at the Arun Jaitely Stadium in Delhi on Monday. Mathews became the first-ever cricketer in international cricket to be timed out when Bangladesh appealed in the 25th over of Sri Lanka’s innings. Richard Illingworth and Marias Erasmus, the on-field umpires, asked Shakib twice if he would like to withdraw his appeal considering that the batter’s helmet strap broke but upon that he wouldn’t, they gave Mathews out. According to the ICC playing conditions, a new batter has to be ready to play the next ball within two minutes of the previous batter’s dismissal. The umpires said Mathews had crossed the two-minute mark even before the strap of his helmet broke and hence was given out. Mathews, however, denied the same and alleged that he had video proof to support his claims. The former Sri Lanka captain said it was a ‘disgraceful’ act from Shakib. “I don’t know where the common sense went, because obviously it’s obviously disgraceful from Shakib and Bangladesh if they want to play cricket like that obviously stooped down to that level I think there’s something wrong drastically because – if I got late if I got past my two minutes to get to the crease and in the law says you have to be ready within the two minutes and I was there two minutes 45 or 50 seconds – I still had after my helmet broke off, I still had five more seconds to go. And the umpires also have said to our coaches that they didn’t see my helmet breaking. I mean, I was just asking for my helmet,” Mathews told reporters after Bangladesh won the match by three wickets. The veteran all-rounder, who celebrated Shakib’s wicket by towards his wrist to suggest a time out, said he had the utmost respect for the Bangladesh captain but things changed after Monday’s incident. ‘Shakib had choice to withdraw appeal but he didn’t’ “I mean, see, up to today, I had utmost respect for him and Bangladesh team. Obviously, you all play to win. And if it’s within the rule, it’s fine. But the rule clearly says, in my incident today, within two minutes I was there. We have video evidence. We will put out a statement later on. We have video evidence, footage, everything was looked. I’m not just coming and saying things here. I’m talking with proof,” he added. Mathews said no other team apart from Bangladesh would have done such a thing. “I don’t think any other team would do that because it was black and white. It was equipment, the helmet coming off and it was a safety issue as well, because we know that without a helmet, I cannot face a bowler. And it was just there to be seen. It was not about anyone being disrespectful. “Yes, Shakib had the option of – he knew that this was not time-wasting or I was there within my time. And he had the choice of, but he decided to go the other way. And my personal opinion is, if it was any other team, they wouldn’t have done it.” Stating that he was in complete shock, Mathews said he hadn’t seen a team stopping so low in his 15-year-long career. The Sri Lanka veteran said it might not have made a difference in the outcome of the match but common sense should have been used. “I think in my 15 years of career, I’ve never seen a team going down to that level because obviously the umpires also admitted that it’s equipment malfunction, and they could have gone upstairs and checked again. “Yeah, I mean, what’s the point not checking at that time and then saying it afterwards? Because I’m not saying if I was there, we could have won the match. It’s a different story. But still, you need to have your common sense in terms of using technology. And also, it was clearly a malfunction. I mean, it just came off. You know, I didn’t mean to pull it and break it. “I still had my time as well and I was in complete shock,” he said. Agencies ‘No other team would’ve done such a disgraceful act’: Mathews blasts Shakib, Bangladesh for timed out dismissal added by KR Desk on 2:58 am November 8, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-11-07 21:28:01","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ea7b9e965aa772e4fdd663b7540288c","title":"Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification","link":"https://www.dailymail.co.uk/sport/cricket/article-12721537/Harry-Brook-Gus-Atkinson-set-return-England-seek-avoid-new-low-beating-World-Cup-minnows-Netherlands-alive-Champions-Trophy-qualification-hopes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Defeat by the Netherlands in Pune would not simply enhance their status as the laughing stock of the World Cup, but leave them in serious danger of failing to qualify for Champions Trophy in 2025.","content":"Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification Harry Brook and Gus Atkinson set to return for England against the Netherlands Defeat on Friday could prompt a rethink over future of head coach Matthew Mott Managing director Rob Key flies in on Friday, ahead of final World Cup match By Lawrence Booth for the Daily Mail Published: 17:08 GMT, 7 November 2023 | Updated: 21:18 GMT, 7 November 2023 e-mail 5 View comments Not in their worst nightmares could England have envisaged the scenario that awaits them on Friday. Defeat by the Netherlands in Pune would not simply enhance their status as the laughing stock of the World Cup, but leave them in serious danger of failing to qualify for the Champions Trophy in 2025. It is a double whammy no one predicted. And despite the suggestion that head coach Matthew Mott is safe in his position, there is little doubt that a sixth successive loss - which would be their worst ODI sequence since 2009 - may encourage a rethink, only 18 months into his four-year contract. When managing director Rob Key flies in to Kolkata on Friday, ahead of England's final match against Pakistan, he will ostensibly be helping to pick two white-ball squads for the pre-Christmas jaunt in the Caribbean. But he would not be doing his job if he didn't seek insight into how England's title defence has proved as flat as the local naan bread. Harry Brook and Gus Atkinson set to return for England against the Netherlands on Friday Managing director Rob Key flies in to Kolkata on Friday, ahead of England's final match It said much about the depths they have plumbed that, before a crucial game that could determine the futures of some of his colleagues, fielding coach Carl Hopkinson was the man charged with talking to the media. This was hardly his fault, but it was hard to avoid the conclusion that England have given up trying to explain the farce. On Monday, for the first time all tour, they didn't offer a talking head. Now, they were dipping into the backroom staff. Hopkinson spoke gamely about England's failure to 'execute under pressure', a phrase that covers a multitude of sins, and defended Ben Stokes' decision to stay on until the end of the World Cup, rather than fly home for immediate knee surgery to ensure he is fit to return to India in the new year for five Tests. But it all felt like going through the motions, which has been a theme of their tournament. Even Hopkinson's well-meaning assessment of Mott didn't quite assuage fears that England's head coach is a fundamentally good man who lacks the edge to alter their fortunes. 'First and foremost, Motty's a relaxed character,' he said. 'He's got a lot of experience in lots of different avenues that he can bring to the party when things aren't going well, but equally when they do go well, like they did this time last year.' In fairness to Hopkinson, England have fielded well in India, their catching success rate of 85 per cent placing them joint-top of the 10 teams. But on every other metric they have been also rans, scoring only one of the tournament's top 25 totals, and possessing none of its top 20 run-scorers, none of its top 20 six-hitters, and only one - Adil Rashid - of its top 28 wicket-takers. England have been poor. Worse, they have been invisible. There is little choice but to freshen things up, with Harry Brook and Gus Atkinson - both scandalously overlooked for the last three matches - in contention. Liam Livingstone, who has averaged 10 with the bat and 52 with the ball, and Mark Wood, who has a knee niggle, could make way. Another World Cup defeat could prompt a rethink over future of head coach Matthew Mott Above all, England have to find a way - any way - of beating a Dutch side who have been energised by wins over South Africa and Bangladesh, and who know a struggling side trading on former glories when they see it. County pros such as Roelof van der Merwe (Somerset), Colin Ackermann (Leicestershire) and Paul van Meekeren (Gloucestershire) will need no second invitation to smear more egg on English faces. The Netherlands' bowling coach Ryan van Niekerk was too polite to say so, describing England as 'world champions', which technically remains true, if increasingly irrelevant - just as England's world-record 498 for four against the Dutch in Amsterdam in 2022 has faded from memory. He also cautioned: 'Never underestimate a wounded buffalo. They can produce incredible performances at any moment, and we're preparing for the best England possible.' That has been another theme: opponents keep waiting for the backlash that never comes. Whisper it, but the Netherlands have the verve and the drive to repeat their T20 World Cup wins over England at Lord's in 2009 and Chittagong in 2014. If they do, Key will have more on his plate than ever seemed possible. India England Cricket The Netherlands Share or comment on this article: Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:18:30","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/18/77517381-0-image-a-4_1699380335867.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd94a3e57a0c12bc5340448413bf40c7","title":"Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai","link":"https://www.dailymail.co.uk/sport/cricket/article-12721359/Glenn-Maxwell-saves-Australia-Cricket-star-hits-one-greatest-innings-rescue-Pat-Cummins-rounder-denying-Afghanistan-famous-victory-Mumbai.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AT THE WANKHEDE STADIUM, MUMBAI: In the end, it took something truly heroic from Glenn Maxwell to deny Afghanistan another famous scalp and take Australia through.","content":"Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai Glenn Maxwell hit one of the greatest innings of all time He rescued Australia from a shock defeat by Afghanistan Maxwell battled severe cramp to get his side the victory By Aadam Patel For The Daily Mail Published: 16:45 GMT, 7 November 2023 | Updated: 21:12 GMT, 7 November 2023 e-mail 126 shares 110 View comments The city of Mumbai with its famous maidans is steeped in cricketing history and this iconic ground alone would have seen many a special innings. Not least from some of its most famous sons like Sachin Tendulkar and Sunil Gavaskar. But in all of its years, it would never have seen an innings as utterly insane, as utterly ridiculous as the double hundred it witnessed from Australia 's Glenn Maxwell, who battled through a back injury and body cramps against Afghanistan, to snatch a three-wicket win from the jaws of defeat. 'It's pretty cool,' said Maxwell as he stood in the changing rooms after the match to avoid further cramping. 'It's a bit fresh and I'm a bit numb to it right now but it was great fun. It just felt like it was me and Patty (Cummins) having fun out there. I've never been in a position where I've had full body cramps like that but it probably made the job simple for me,' added Maxwell. Glenn Maxwell produced one of the greatest innings of all time for Australia Pat Cummins' side were at one point 91-7 before Maxwell rescued his team He battled severe cramps after returning from concussion on Tuesday As he heaved Mujeeb ul Rahman into the stands to secure Australia's place in the World Cup semi-finals, the entirety of the Wankhede rose in appreciation of a gladiatorial innings for the ages. Maxwell had arrived in the middle three hours earlier in a chase of 292 to face a hat-trick ball with Pat Cummins' side 49 for four, after Afghanistan's quicks had caused carnage. That he was even in the side was remarkable, after he fell off a golf buggy last Monday and was ruled out of their win over England due to concussion. With the hat-trick ball, Azmatullah Ozarzai found Maxwell's outside edge but the ball failed to carry to the wicketkeeper Hamid Alikhil. When Alikhil pulled off a stunning reflex catch to remove Mitchell Starc, Australia were reeling at 91 for seven and Jonathan Trott's men were on their way to yet another famous scalp. Ultimately, it was only the heroic Maxwell who denied them, smashing 21 fours and 10 sixes on his way to an unbeaten 201 off 128 deliveries. He was dropped twice on 24 and 33 and was halfway back to the pavilion on 27 when he realised his review was successful. Alongside Cummins, the pair put on an unbroken record eighth-wicket partnership of 202, of which Cummins himself contributed just 12 off 68 deliveries. He must have felt like a spectator on the other end with the best seat in the house as Maxwell quite literally, stood and delivered. 'It's the greatest ODI innings I've ever seen,' said Cummins. 'It's probably the greatest ODI innings ever. The lads were chatting with each other and saying how it's one of those days where you just go, I was there in the stadium the day Glenn Maxwell chased down the total all by himself,' the Australia captain added. At one stage, with 55 runs still needed, Maxwell fell flat on the floor with his body cramping up while finishing a run. Not for the first time in the innings, Adam Zampa was waiting on the boundary edge to come out to bat as Australia's physio Nick Jones came out but again, Maxwell somehow found the sheer will to carry on through the pain. He could not run but continued to clear the ropes with ease, playing off one leg at times. From that point, the 35-year-old dealt in boundaries alone, with 50 of Australia's last 56 runs coming with fours and sixes. With 21 needed off four overs, Maxwell needed just four balls as he finished Afghanistan off going six, six, four and six off consecutive deliveries to cap off the greatest of innings and add Australia's first ever ODI double hundred to the fastest World Cup century he scored against the Netherlands earlier in the tournament. For Afghanistan, it was a huge missed opportunity on a night when they could have put themselves on the brink of a historic first World Cup semi-final. 'It was a world-class innings but we certainly helped him along the way,' admitted Trott. 'When you get an opportunity against a side like Australia, you've got to grab it. But full credit to him. The way he played was phenomenal. He deserved to win that game.' Mumbai Australia Cricket Afghanistan Share or comment on this article: Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai e-mail 126 shares Add comment Comments 110 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:12:58","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/19/77519687-0-image-a-17_1699384117127.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"fd185a1f3de2ccb6223461567314d178","title":"Maxwell powers Australia to win over Afghanistan","link":"https://dailymailnews.pk/maxwell-powers-australia-to-win-over-afghanistan/","keywords":["Sport"],"creator":["DM NEWS"],"video_url":null,"description":"Sports Desk MUMBAI: Glenn Maxwell on Tuesday shocked Afghanistan as Australia inflicted a three-wicket defeat on the former in a thrilling group match of the ongoing ICC Men’s Cricket World Cup in Mumbai, India. The Aussie batter played one of the greatest innings in the history of the World Cup, hitting an astonishing unbeaten double-century. […]","content":"MUMBAI: Glenn Maxwell on Tuesday shocked Afghanistan as Australia inflicted a three-wicket defeat on the former in a thrilling group match of the ongoing ICC Men’s Cricket World Cup in Mumbai, India. The Aussie batter played one of the greatest innings in the history of the World Cup, hitting an astonishing unbeaten double-century. Maxwell, 35, terrorised Afghanistan’s bowlers and hit them all over the park as he, alongside skipper Pat Cummins, snatched victory from the jaws of defeat. The 35-year-old came to bat when his side was 49-4 after Josh Inglis had just lost his wicket for a golden duck. However, Maxwell got a life on two different occasions as he was dropped by Hashmatullah Shahidi and Mujeeb ur Rehman. Afghanistan’s bowlers caused all kinds of trouble for Australian batters in the early overs and were on the way to a certain victory. Still, Maxwell alone became the reason for their pain as the right-handed destructive batter gave no choice or chance to Shahidi’s men. Maxwell was largely supported by Cummins who played a calm and sensible knock, scoring 12 runs in 68 balls. The 35-year-old also suffered cramps and, in the last few overs, he was unable to run while also playing shots without using any footwork. Glenn Maxwell became the first ever batter to score a 200 in a chase in ODIs and also the first player to score 2 centuries in a WC edition batting at No. 5 or lower. Batting first, Ibrahim Zadran was the standout player as he became the first Afghani batter to score a century in the history of the World Cup. While other Afghani batters failed to score big it was Zadran who came as an opener and stayed till the very end, helping his side to reach a good total. Rashid Khan significantly supported Zadran during the last five overs as the all-rounder played a rapid knock, scoring 35 off just 18 deliveries with two fours and three sixes. Rahmat Shah (30), skipper Hashmatullah Shahidi (26) and Azmatullah Omarzai (22) were the other contributors to the winning side. No Australia bowler other than Josh Hazlewood bowled up to the expectations as the right-handed pacer only conceded 39 runs in nine overs and also took two important wickets. Afghanistan will now play another important and must-win match against South Africa on November 9. Meanwhile, Australia will take on Bangladesh on November 11 in their last group match.","pubDate":"2023-11-07 20:15:40","image_url":null,"source_id":"dailymailnews","source_priority":24862659,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"682210202f6c175f4643b507d5ac3fd2","title":"Cummins hails Maxwell double ton as 'greatest ODI innings ever!'","link":"https://www.skysports.com/cricket/news/20876/13002925/glenn-maxwell-australia-captain-pat-cummins-hails-match-winning-double-hundred-as-greatest-odi-innings-ever","keywords":null,"creator":null,"video_url":null,"description":"Australia captain Pat Cummins described Glenn Maxwell's astonishing double hundred that secured a miraculous Cricket World Cup victory over Afghanistan as \"the greatest ODI innings that has ever happened.\"","content":"Australia captain Pat Cummins described Glenn Maxwell's astonishing double hundred that secured a miraculous Cricket World Cup victory over Afghanistan as \"the greatest ODI innings that has ever happened.\" Maxwell was joined by Cummins at the crease with Australia reeling at 91-7, chasing 292 for victory against Afghanistan in Mumbai, before he smashed an unbeaten 201 off 128 balls in an unbroken stand of 202 in which Cummins contributed just 12. An injured Maxwell, nursing various cramps, recorded Australia's highest individual ODI score and became only the third player to hit a World Cup double ton. His spectacular one-legged cameo included 21 fours and 10 sixes. Please use Chrome browser for a more accessible video player \"It has to be the greatest ODI innings that has ever happened,\" Cummins said in his post-match interview. \"Maxi was just ridiculous. I don't know how he did it; he was out of this world. \"When he is chasing, he always has a plan, so even from 200 behind, he was still mapping out a way to win the game.\" The Australia captain later added: \"It's just a one-man show. It looks so easy. Heroic Maxwell lead Australia into semis Watch the World Cup and more with NOW Cricket World Cup - fixtures and results Cricket World Cup - latest standings \"He can't move and still manages to hit a six [over] the third man with reverse. He's a freak. And when you're up against someone like that as a bowler, you don't have many options... \"We're just chatting about it, all the players, and we've decided it's one of those days where you just go, 'I was there in the stadium the day Glenn Maxwell chased down that total by himself.'\" Tuesday's win secured Australia a semi-final spot in the World Cup, the five-time winners confirming their place with a game to spare after winning six in a row. Cummins said improving the team's net run-rate was initially top of his mind when he walked out to join Maxwell, and it was not until the final 20 minutes that he actually believed that Australia could win. \"When I went out there, I thought if we can somehow scratch the 200, our net run-rate should be pretty good [to still try and qualify] for the semis,\" he said. \"When Maxi got his 100, I kind of thought, 'wow, we're within 120 or something.' At that point I still thought, 'no way.' \"I reckon it wasn't until the spinners were just about done and there was maybe 40 off 40 [balls], where I thought, 'okay even if Maxi gets out here, I reckon the other guys can get it done.'\" England take on the Netherlands on Wednesday in Pune with coverage from 8am ahead of the first ball at 8.30am on Sky Sports Cricket. The defending champions are out of the World Cup but can still qualify for the Champions Trophy if they finish in the top seven. Stream the Cricket World Cup and more top sport with NOW","pubDate":"2023-11-07 19:21:00","image_url":"https://e0.365dm.com/23/11/1920x1080/skysports-glenn-maxwell-australia_6352249.jpg?20231107203940","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"899c4385d9f51097992926f38df4dbe1","title":"England and Netherlands set to fight for Champions Trophy spot","link":"https://www.skysports.com/cricket/news/20876/13001973/cricket-world-cup-england-and-netherlands-fight-for-champions-trophy-spot-in-game-of-expectation-vs-privilege","keywords":null,"creator":null,"video_url":null,"description":"While a spot in the World Cup semi-finals is no longer possible for both England and Netherlands, their match could determine who will compete in the Champions Trophy.","content":"While a spot in the World Cup semi-finals is no longer possible for both England and Netherlands, their match could determine who will compete in the Champions Trophy. Jos Buttler's eliminated England side sit rock bottom of the table with just one win out of seven and two points, while Netherlands are two spots above with two wins and four points to their name. The top eight in this tournament will claim spots in the Champions Trophy 2025, the top seven if Pakistan finish out of those spots. Please use Chrome browser for a more accessible video player One win might be enough for the Netherlands to take one of those spots and two definitely should be. With the tough test of runaway leaders India in their last game, they will be looking at England as their best opportunity to get one of those wins wrapped up. Despite facing an England side low on confidence, Netherlands' Bas de Leede believes the \"expectation\" still firmly lies with England heading into the match. \"As a title-defending team there is a huge pressure on you straight away, especially when you don't get a great start, and I'm sure there is added pressure for them now on this game,\" said De Leede. Please use Chrome browser for a more accessible video player \"For us it's a privilege to be playing for a spot in the Champions Trophy, for them it's an expectation to finish at least in the top eight. Cricket World Cup - fixtures and results Cricket World Cup - latest standings Watch the World Cup and more with NOW 2023 Men's Cricket World Cup homepage \"Of course England are a dangerous side, they have such quality in the batting and bowling departments, but two wins in this campaign is pretty good for us and we feel as a group there is more out there for us. \"The proof is there in the South Africa game. To see what we have been practising come off against a team like that was great to see and gave us a lot of confidence as a team. Please use Chrome browser for a more accessible video player \"It's a massive opportunity, 100 per cent. It's in the back of our heads that if we do manage to win this game it would help enormously to qualify and that would be huge for Dutch cricket. \"If we did qualify for the Champions Trophy it would secure another seven games against the best teams. That's how we keep progressing as a national team and it's in our hands. We kind of felt like we were gate-crashing here so to come through would be massive.\" Former England fast bowler Steve Harmison believes England need to start making \"big decisions\", starting with putting Harry Brook back in the side. Brook played the first four matches of England's campaign but was then dropped when England opted for fewer batters in their line-up against Sri Lanka. Please use Chrome browser for a more accessible video player \"I struggle to understand how Brook doesn't get on. I know we've been picking world champions, but they're not playing at a champions' level,\" said Harmison. \"England should have been brave enough to say, 'this bloke needs to play'. We are talking about someone who is the best we've produced in a long time. He's not the finished article by any means, but he probably makes our best XI. \"The problem is England are picking names who haven't performed and hoping it gets better. One bad game turns to two, two turns to three. It needs leadership and a bit of bravery to make a big decision.\" Watch England's penultimate Cricket World Cup match, against Netherlands in Pune, live on Sky Sports Cricket from 8am on Wednesday (8.30am first ball). You can also stream the tournament without a contract through NOW.","pubDate":"2023-11-07 19:00:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-england-cricket-cricket-world-cup_6350692.jpg?20231106145815","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"892647fb4d12e6f81690fa850f5085fa","title":"‘I’m a bit numb’: Maxwell snatches victory with amazing double century","link":"https://www.brisbanetimes.com.au/sport/cricket/i-m-a-bit-numb-maxwell-snatches-victory-with-amazing-double-century-20231107-p5ei7c.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Glenn Maxwell smashed an extraordinary 201 not out to give Australia the most remarkable of victories over Afghanistan and a place in the World Cup semi-finals.","content":"The most incredible double century from a debilitated Glenn Maxwell has driven Australia to one of the most amazing World Cup victories of all time, beating Afghanistan by three wickets to shore up a semi-final berth. Riddled with cramp and collapsing in pain at one stage, Maxwell finished unbeaten on 201 from just 128 balls, finishing the match with a six to claim victory, Australia’s sixth in a row. It was just the third double century in World Cup history and the first in a run chase. Victory came with his 10th six to go with 21 fours in a partnership of 202 with Pat Cummins, who made just 12 not out from 68 balls as Australia recovered from a seemingly hopeless 7/91 to finish 7/293, winning with 19 balls remaining. “It’s pretty cool,” Maxwell said he stood bracing himself in the change rooms after the match to avoid further cramping. “It’s so fresh at the moment. I’m a bit numb to it. It was great. It was great fun. “It just felt like it was me and Patty (Cummins) just having fun out there. I’ll probably reflect a little bit more over the next few days and hopefully recover and get some movement back in my hamstrings and calves, but it’s a bit sore at the moment. Just a fortnight ago Maxwell scored the fastest century in World Cup history from just 40 balls against the Netherlands, while last week he fell off the back of a golf cart , suffering concussion which ruled him out of last Saturday’s victory over England . Glenn Maxwell celebrates a remarkable Australian victory. Credit: AP Third-placed Australia will now meet second-placed South Africa in a semi-final next week, with both teams sitting on six wins from eight matches, while unbeaten India’s semi-final opponent will come from New Zealand, Pakistan and Afghanistan, who all have four wins with a match to play. Australia’s match against Bangladesh on Saturday now has no bearing on the finals. Cummins described Maxwell’s performance as “the greatest one-day innings ever.” “We were just chatting about it, all the players, and we’ve decided it’s one of those days where you just go, I was there in the stadium the day Glenn Maxwell chased down that total by himself’,” the captain said. Cummins thought that Maxwell’s heroic innings was over and he would be forced to retire hurt as he collapsed after taking a run on 147, suffering multiple cramps, with Australia still needing 55 from 58 balls. The captain summoned No.10 Adam Zampa to come down from the change rooms. Australian captain Pat Cummins was a patient foil for the rampant Maxwell. Credit: AP “He (Maxwell) literally couldn’t move, then the physio (Ben Jones) was out there obviously and he kind of convinced Maxie that if he came off, he might be worse off. ‘Try and hang out there, stand up, and that’s probably your best bet. Because once you go off with that much cramp, there’s no guarantee you’re going to get back out there’.” Maxwell was forced to swing while rooted to the crease unable to run as he mounted what had initially appeared a hopeless rearguard action. Surviving a leg before wicket review on 27, and dropped catch on 33, Maxwell’s first 100 runs came in 76 balls with the second 50 in 25 balls. But there were no exuberant celebrations with more than a 100 still needed at a run a ball. Ibrahim Zadran’s maiden World Cup century for Afghanistan looked like stealing the headlines for much of the match. Credit: Getty It was Australia’s highest successful World Cup run chase, bettering the 287 they made against New Zealand in the 1996 quarter-final at Chennai. As Afghanistan began claiming Australian wickets they became increasingly chirpy, with Rashid Khan and David Warner having an extended and animated conversation, while Mitch Marsh, returning to the team following a trip home to mourn the death of his grandfather, turned his head and pointed his bat towards a celebrating Afghanistan huddle when he was dismissed for 24 from 11 balls. Loading In a night of firsts, Ibrahim Zadran scored Afghanistan’s maiden World Cup century – 129 from 143 balls with three sixes and eight fours – propelling the country to their highest World Cup score of 5/291. It looked for some time Afghanistan may also claim their first ODI victory over Australia, until Maxwell intervened. Watch every Australian game plus other big match-ups live and free on Nine, 9Gem and 9Now. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Cricket World Cup Australian cricket Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-11-07 18:52:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f4d5b4cdddbd87d6cb5a7339a6d8e154","title":"World Cup 2023: Sri Lanka court restores sacked cricket board","link":"https://www.newsr.in/n/Sports/1zpogeedom/World-Cup-2023-Sri-Lanka-court-restores-sacked.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Earlier, the Sri Lanka Sports Minister Roshan Ranasinghe suspended the whole Sri Lanka Cricket (SLC) board, the Sri Lanka-based Daily Mirror reported on Monday. Reported by DNA 1 hour ago.","content":"Tuesday, 7 November 2023 ( 2 hours ago ) Earlier, the Sri Lanka Sports Minister Roshan Ranasinghe suspended the whole Sri Lanka Cricket (SLC) board, the Sri Lanka-based Daily Mirror reported on Monday. 👓 View full article","pubDate":"2023-11-07 18:22:39","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f73751d91b878710074dd10675d7246c","title":"'I feel shocking' - Maxwell on making a double century with cramp","link":"https://www.newsr.in/n/Sports/1zpogeedks/feel-shocking-Maxwell-on-making.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Glenn Maxwell says he feels \"shocking\" after battling cramp to score an incredible double century and lead Australia to a stunning comeback win against Afghanistan at the Cricket World Cup. Reported by BBC Sport 1 hour ago.","content":"Tuesday, 7 November 2023 ( 2 hours ago ) Glenn Maxwell says he feels \"shocking\" after battling cramp to score an incredible double century and lead Australia to a stunning comeback win against Afghanistan at the Cricket World Cup. 👓 View full article","pubDate":"2023-11-07 18:13:43","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"41760d8e6c2c77a1d26bc78579c6cbaa","title":"Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move'","link":"https://www.dailymail.co.uk/sport/cricket/article-12722273/Pat-Cummins-reveals-Glenn-Maxwells-incredible-injury-battle-201-run-World-Cup-innings-thats-hailed-best-literally-move.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Maxwell hit 10 sixes and 21 boundaries in his stunning knock - partly because he was in so much pain he could hardly walk, let alone run between wickets.","content":"Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move' Maxwell rescued Aussies with stunning knock vs Afghanistan Skipper Cummins labelled it the greatest ODI innings ever Said batter was a 'freak' for overcoming injury battle in India By Ian Chadband For Australian Associated Press Published: 21:43, 7 November 2023 | Updated: 21:43, 7 November 2023 e-mail 1 View comments Glenn Maxwell, Australia 's 'Big Show', has delivered the ultimate show of his pyrotechnic career, leaving the cricket world saluting what his captain Pat Cummins believes is the greatest innings ever played in a one-day international . The amazing Maxwell, barely able to walk as he hobbled along with a back issue and terrible cramping in Mumbai , somehow still blitzed an unbetean 201 - on effectively one leg - to drag Australia from 7-91, past Afghanistan's total of 5-291 by three wickets, and into the World Cup semis. 'I think that's the greatest ODI innings,' said Cummins, who had the best view in the Wankhede Stadium of the carnage as he contributed a crucial, unbeaten 12 at the other end in their unbroken, match-winning stand of 202 for the eighth wicket on Tuesday. Maxwell hit 10 sixes and 21 boundaries in his incredible knock despite battling severe cramp 'It's the best I've ever seen, probably the greatest ODI innings ever. We're just chatting about it, all the players, and we've decided it's one of those days where you just go 'I was there in the stadium the day Glenn Maxwell chased down that total by himself'. 'It's just a one-man show. I'm up the other end and don't see any gaps in the field, don't see where I'm going to score a boundary - and yet it seems like every time he sees that, it still just runs away for four. It looks so easy. 'He still can't move, and yet still manages to hit a six over the third man with a reverse – he's a freak.' Maxwell finished the job with the winning six - his 10th of the innings to go with 21 fours - and like so many of the big hits, had to pull it off magically with minimal foot movement because his cramping was so debilitating. Cummins (left) branded Maxwell (right) a 'freak' after he single-handedly saved Australia from disaster with an innings for the ages At one stage Cummins even told the next batter, Adam Zampa, to come down to the ground because Maxwell 'literally couldn't move' 'Maxi was out of this world. I couldn't even get on strike! You just let him do his thing when he's doing that - how am I going to say anything to someone who's like that?' laughed Cummins. 'Even from 200 behind, he was still mapping a way we could win the game. I was just trying to survive!' Still, it was only with about 20 minutes left that Cummins felt Australia could really pull off the miracle, even believing that the 35-year-old might have to be 'stretched off' with his cramping woes. 'His back was cramping pretty early on, then just hamstrings, calves. For one over he said his toe was gone,' reported Cummins. Australia's physiotherapist (pictured treating Maxwell) advised Cummins that taking the batter off the field could actually make his condition worse 'I kind of signalled to Zamps (next batter Adam Zampa) to get down here because he literally couldn't move and then the physio kind of convinced Maxi that if he came off, it might be worse off.' Maxwell - as long as he avoids the sort of golf buggy accident that waylaid him for the previous game - should be fine for the rest of a tournament where he's already hit the fastest World Cup hundred ever off 40 balls and now has Australia's highest-ever ODI score. 'I'm sure it will be fine for the next game - plenty of hydration, he'll be in the ice bath I'm sure, but it will be okay,' smiled Cummins. Pat Cummins Mumbai Afghanistan Share or comment on this article: Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move' e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:43:03","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/21/77523381-0-image-m-12_1699393238634.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"36b15f35f52f501b516ecff567dc8d14","title":"‘No other team would’ve done such a disgraceful act’: Mathews blasts Shakib, Bangladesh for timed out dismissal","link":"https://kashmirreader.com/2023/11/08/no-other-team-wouldve-done-such-a-disgraceful-act-mathews-blasts-shakib-bangladesh-for-timed-out-dismissal/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: Sri Lanka all-rounder Angelo Mathews launched a no-holds-barred attack on Shakib Al Hasan and the Bangladesh team for not using ‘common sense’ and withdrawing the appeal of timed out against him during a World Cup 2023 match at the Arun Jaitely Stadium in Delhi on Monday. Mathews became the first-ever cricketer in international […]","content":"New Delhi: Sri Lanka all-rounder Angelo Mathews launched a no-holds-barred attack on Shakib Al Hasan and the Bangladesh team for not using ‘common sense’ and withdrawing the appeal of timed out against him during a World Cup 2023 match at the Arun Jaitely Stadium in Delhi on Monday. Mathews became the first-ever cricketer in international cricket to be timed out when Bangladesh appealed in the 25th over of Sri Lanka’s innings. Richard Illingworth and Marias Erasmus, the on-field umpires, asked Shakib twice if he would like to withdraw his appeal considering that the batter’s helmet strap broke but upon that he wouldn’t, they gave Mathews out. According to the ICC playing conditions, a new batter has to be ready to play the next ball within two minutes of the previous batter’s dismissal. The umpires said Mathews had crossed the two-minute mark even before the strap of his helmet broke and hence was given out. Mathews, however, denied the same and alleged that he had video proof to support his claims. The former Sri Lanka captain said it was a ‘disgraceful’ act from Shakib. “I don’t know where the common sense went, because obviously it’s obviously disgraceful from Shakib and Bangladesh if they want to play cricket like that obviously stooped down to that level I think there’s something wrong drastically because – if I got late if I got past my two minutes to get to the crease and in the law says you have to be ready within the two minutes and I was there two minutes 45 or 50 seconds – I still had after my helmet broke off, I still had five more seconds to go. And the umpires also have said to our coaches that they didn’t see my helmet breaking. I mean, I was just asking for my helmet,” Mathews told reporters after Bangladesh won the match by three wickets. The veteran all-rounder, who celebrated Shakib’s wicket by towards his wrist to suggest a time out, said he had the utmost respect for the Bangladesh captain but things changed after Monday’s incident. ‘Shakib had choice to withdraw appeal but he didn’t’ “I mean, see, up to today, I had utmost respect for him and Bangladesh team. Obviously, you all play to win. And if it’s within the rule, it’s fine. But the rule clearly says, in my incident today, within two minutes I was there. We have video evidence. We will put out a statement later on. We have video evidence, footage, everything was looked. I’m not just coming and saying things here. I’m talking with proof,” he added. Mathews said no other team apart from Bangladesh would have done such a thing. “I don’t think any other team would do that because it was black and white. It was equipment, the helmet coming off and it was a safety issue as well, because we know that without a helmet, I cannot face a bowler. And it was just there to be seen. It was not about anyone being disrespectful. “Yes, Shakib had the option of – he knew that this was not time-wasting or I was there within my time. And he had the choice of, but he decided to go the other way. And my personal opinion is, if it was any other team, they wouldn’t have done it.” Stating that he was in complete shock, Mathews said he hadn’t seen a team stopping so low in his 15-year-long career. The Sri Lanka veteran said it might not have made a difference in the outcome of the match but common sense should have been used. “I think in my 15 years of career, I’ve never seen a team going down to that level because obviously the umpires also admitted that it’s equipment malfunction, and they could have gone upstairs and checked again. “Yeah, I mean, what’s the point not checking at that time and then saying it afterwards? Because I’m not saying if I was there, we could have won the match. It’s a different story. But still, you need to have your common sense in terms of using technology. And also, it was clearly a malfunction. I mean, it just came off. You know, I didn’t mean to pull it and break it. “I still had my time as well and I was in complete shock,” he said. Agencies ‘No other team would’ve done such a disgraceful act’: Mathews blasts Shakib, Bangladesh for timed out dismissal added by KR Desk on 2:58 am November 8, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-11-07 21:28:01","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ea7b9e965aa772e4fdd663b7540288c","title":"Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification","link":"https://www.dailymail.co.uk/sport/cricket/article-12721537/Harry-Brook-Gus-Atkinson-set-return-England-seek-avoid-new-low-beating-World-Cup-minnows-Netherlands-alive-Champions-Trophy-qualification-hopes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Defeat by the Netherlands in Pune would not simply enhance their status as the laughing stock of the World Cup, but leave them in serious danger of failing to qualify for Champions Trophy in 2025.","content":"Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification Harry Brook and Gus Atkinson set to return for England against the Netherlands Defeat on Friday could prompt a rethink over future of head coach Matthew Mott Managing director Rob Key flies in on Friday, ahead of final World Cup match By Lawrence Booth for the Daily Mail Published: 17:08 GMT, 7 November 2023 | Updated: 21:18 GMT, 7 November 2023 e-mail 5 View comments Not in their worst nightmares could England have envisaged the scenario that awaits them on Friday. Defeat by the Netherlands in Pune would not simply enhance their status as the laughing stock of the World Cup, but leave them in serious danger of failing to qualify for the Champions Trophy in 2025. It is a double whammy no one predicted. And despite the suggestion that head coach Matthew Mott is safe in his position, there is little doubt that a sixth successive loss - which would be their worst ODI sequence since 2009 - may encourage a rethink, only 18 months into his four-year contract. When managing director Rob Key flies in to Kolkata on Friday, ahead of England's final match against Pakistan, he will ostensibly be helping to pick two white-ball squads for the pre-Christmas jaunt in the Caribbean. But he would not be doing his job if he didn't seek insight into how England's title defence has proved as flat as the local naan bread. Harry Brook and Gus Atkinson set to return for England against the Netherlands on Friday Managing director Rob Key flies in to Kolkata on Friday, ahead of England's final match It said much about the depths they have plumbed that, before a crucial game that could determine the futures of some of his colleagues, fielding coach Carl Hopkinson was the man charged with talking to the media. This was hardly his fault, but it was hard to avoid the conclusion that England have given up trying to explain the farce. On Monday, for the first time all tour, they didn't offer a talking head. Now, they were dipping into the backroom staff. Hopkinson spoke gamely about England's failure to 'execute under pressure', a phrase that covers a multitude of sins, and defended Ben Stokes' decision to stay on until the end of the World Cup, rather than fly home for immediate knee surgery to ensure he is fit to return to India in the new year for five Tests. But it all felt like going through the motions, which has been a theme of their tournament. Even Hopkinson's well-meaning assessment of Mott didn't quite assuage fears that England's head coach is a fundamentally good man who lacks the edge to alter their fortunes. 'First and foremost, Motty's a relaxed character,' he said. 'He's got a lot of experience in lots of different avenues that he can bring to the party when things aren't going well, but equally when they do go well, like they did this time last year.' In fairness to Hopkinson, England have fielded well in India, their catching success rate of 85 per cent placing them joint-top of the 10 teams. But on every other metric they have been also rans, scoring only one of the tournament's top 25 totals, and possessing none of its top 20 run-scorers, none of its top 20 six-hitters, and only one - Adil Rashid - of its top 28 wicket-takers. England have been poor. Worse, they have been invisible. There is little choice but to freshen things up, with Harry Brook and Gus Atkinson - both scandalously overlooked for the last three matches - in contention. Liam Livingstone, who has averaged 10 with the bat and 52 with the ball, and Mark Wood, who has a knee niggle, could make way. Another World Cup defeat could prompt a rethink over future of head coach Matthew Mott Above all, England have to find a way - any way - of beating a Dutch side who have been energised by wins over South Africa and Bangladesh, and who know a struggling side trading on former glories when they see it. County pros such as Roelof van der Merwe (Somerset), Colin Ackermann (Leicestershire) and Paul van Meekeren (Gloucestershire) will need no second invitation to smear more egg on English faces. The Netherlands' bowling coach Ryan van Niekerk was too polite to say so, describing England as 'world champions', which technically remains true, if increasingly irrelevant - just as England's world-record 498 for four against the Dutch in Amsterdam in 2022 has faded from memory. He also cautioned: 'Never underestimate a wounded buffalo. They can produce incredible performances at any moment, and we're preparing for the best England possible.' That has been another theme: opponents keep waiting for the backlash that never comes. Whisper it, but the Netherlands have the verve and the drive to repeat their T20 World Cup wins over England at Lord's in 2009 and Chittagong in 2014. If they do, Key will have more on his plate than ever seemed possible. India England Cricket The Netherlands Share or comment on this article: Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:18:30","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/18/77517381-0-image-a-4_1699380335867.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd94a3e57a0c12bc5340448413bf40c7","title":"Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai","link":"https://www.dailymail.co.uk/sport/cricket/article-12721359/Glenn-Maxwell-saves-Australia-Cricket-star-hits-one-greatest-innings-rescue-Pat-Cummins-rounder-denying-Afghanistan-famous-victory-Mumbai.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AT THE WANKHEDE STADIUM, MUMBAI: In the end, it took something truly heroic from Glenn Maxwell to deny Afghanistan another famous scalp and take Australia through.","content":"Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai Glenn Maxwell hit one of the greatest innings of all time He rescued Australia from a shock defeat by Afghanistan Maxwell battled severe cramp to get his side the victory By Aadam Patel For The Daily Mail Published: 16:45 GMT, 7 November 2023 | Updated: 21:12 GMT, 7 November 2023 e-mail 126 shares 110 View comments The city of Mumbai with its famous maidans is steeped in cricketing history and this iconic ground alone would have seen many a special innings. Not least from some of its most famous sons like Sachin Tendulkar and Sunil Gavaskar. But in all of its years, it would never have seen an innings as utterly insane, as utterly ridiculous as the double hundred it witnessed from Australia 's Glenn Maxwell, who battled through a back injury and body cramps against Afghanistan, to snatch a three-wicket win from the jaws of defeat. 'It's pretty cool,' said Maxwell as he stood in the changing rooms after the match to avoid further cramping. 'It's a bit fresh and I'm a bit numb to it right now but it was great fun. It just felt like it was me and Patty (Cummins) having fun out there. I've never been in a position where I've had full body cramps like that but it probably made the job simple for me,' added Maxwell. Glenn Maxwell produced one of the greatest innings of all time for Australia Pat Cummins' side were at one point 91-7 before Maxwell rescued his team He battled severe cramps after returning from concussion on Tuesday As he heaved Mujeeb ul Rahman into the stands to secure Australia's place in the World Cup semi-finals, the entirety of the Wankhede rose in appreciation of a gladiatorial innings for the ages. Maxwell had arrived in the middle three hours earlier in a chase of 292 to face a hat-trick ball with Pat Cummins' side 49 for four, after Afghanistan's quicks had caused carnage. That he was even in the side was remarkable, after he fell off a golf buggy last Monday and was ruled out of their win over England due to concussion. With the hat-trick ball, Azmatullah Ozarzai found Maxwell's outside edge but the ball failed to carry to the wicketkeeper Hamid Alikhil. When Alikhil pulled off a stunning reflex catch to remove Mitchell Starc, Australia were reeling at 91 for seven and Jonathan Trott's men were on their way to yet another famous scalp. Ultimately, it was only the heroic Maxwell who denied them, smashing 21 fours and 10 sixes on his way to an unbeaten 201 off 128 deliveries. He was dropped twice on 24 and 33 and was halfway back to the pavilion on 27 when he realised his review was successful. Alongside Cummins, the pair put on an unbroken record eighth-wicket partnership of 202, of which Cummins himself contributed just 12 off 68 deliveries. He must have felt like a spectator on the other end with the best seat in the house as Maxwell quite literally, stood and delivered. 'It's the greatest ODI innings I've ever seen,' said Cummins. 'It's probably the greatest ODI innings ever. The lads were chatting with each other and saying how it's one of those days where you just go, I was there in the stadium the day Glenn Maxwell chased down the total all by himself,' the Australia captain added. At one stage, with 55 runs still needed, Maxwell fell flat on the floor with his body cramping up while finishing a run. Not for the first time in the innings, Adam Zampa was waiting on the boundary edge to come out to bat as Australia's physio Nick Jones came out but again, Maxwell somehow found the sheer will to carry on through the pain. He could not run but continued to clear the ropes with ease, playing off one leg at times. From that point, the 35-year-old dealt in boundaries alone, with 50 of Australia's last 56 runs coming with fours and sixes. With 21 needed off four overs, Maxwell needed just four balls as he finished Afghanistan off going six, six, four and six off consecutive deliveries to cap off the greatest of innings and add Australia's first ever ODI double hundred to the fastest World Cup century he scored against the Netherlands earlier in the tournament. For Afghanistan, it was a huge missed opportunity on a night when they could have put themselves on the brink of a historic first World Cup semi-final. 'It was a world-class innings but we certainly helped him along the way,' admitted Trott. 'When you get an opportunity against a side like Australia, you've got to grab it. But full credit to him. The way he played was phenomenal. He deserved to win that game.' Mumbai Australia Cricket Afghanistan Share or comment on this article: Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai e-mail 126 shares Add comment Comments 110 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:12:58","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/19/77519687-0-image-a-17_1699384117127.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"fd185a1f3de2ccb6223461567314d178","title":"Maxwell powers Australia to win over Afghanistan","link":"https://dailymailnews.pk/maxwell-powers-australia-to-win-over-afghanistan/","keywords":["Sport"],"creator":["DM NEWS"],"video_url":null,"description":"Sports Desk MUMBAI: Glenn Maxwell on Tuesday shocked Afghanistan as Australia inflicted a three-wicket defeat on the former in a thrilling group match of the ongoing ICC Men’s Cricket World Cup in Mumbai, India. The Aussie batter played one of the greatest innings in the history of the World Cup, hitting an astonishing unbeaten double-century. […]","content":"MUMBAI: Glenn Maxwell on Tuesday shocked Afghanistan as Australia inflicted a three-wicket defeat on the former in a thrilling group match of the ongoing ICC Men’s Cricket World Cup in Mumbai, India. The Aussie batter played one of the greatest innings in the history of the World Cup, hitting an astonishing unbeaten double-century. Maxwell, 35, terrorised Afghanistan’s bowlers and hit them all over the park as he, alongside skipper Pat Cummins, snatched victory from the jaws of defeat. The 35-year-old came to bat when his side was 49-4 after Josh Inglis had just lost his wicket for a golden duck. However, Maxwell got a life on two different occasions as he was dropped by Hashmatullah Shahidi and Mujeeb ur Rehman. Afghanistan’s bowlers caused all kinds of trouble for Australian batters in the early overs and were on the way to a certain victory. Still, Maxwell alone became the reason for their pain as the right-handed destructive batter gave no choice or chance to Shahidi’s men. Maxwell was largely supported by Cummins who played a calm and sensible knock, scoring 12 runs in 68 balls. The 35-year-old also suffered cramps and, in the last few overs, he was unable to run while also playing shots without using any footwork. Glenn Maxwell became the first ever batter to score a 200 in a chase in ODIs and also the first player to score 2 centuries in a WC edition batting at No. 5 or lower. Batting first, Ibrahim Zadran was the standout player as he became the first Afghani batter to score a century in the history of the World Cup. While other Afghani batters failed to score big it was Zadran who came as an opener and stayed till the very end, helping his side to reach a good total. Rashid Khan significantly supported Zadran during the last five overs as the all-rounder played a rapid knock, scoring 35 off just 18 deliveries with two fours and three sixes. Rahmat Shah (30), skipper Hashmatullah Shahidi (26) and Azmatullah Omarzai (22) were the other contributors to the winning side. No Australia bowler other than Josh Hazlewood bowled up to the expectations as the right-handed pacer only conceded 39 runs in nine overs and also took two important wickets. Afghanistan will now play another important and must-win match against South Africa on November 9. Meanwhile, Australia will take on Bangladesh on November 11 in their last group match.","pubDate":"2023-11-07 20:15:40","image_url":null,"source_id":"dailymailnews","source_priority":24862659,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"682210202f6c175f4643b507d5ac3fd2","title":"Cummins hails Maxwell double ton as 'greatest ODI innings ever!'","link":"https://www.skysports.com/cricket/news/20876/13002925/glenn-maxwell-australia-captain-pat-cummins-hails-match-winning-double-hundred-as-greatest-odi-innings-ever","keywords":null,"creator":null,"video_url":null,"description":"Australia captain Pat Cummins described Glenn Maxwell's astonishing double hundred that secured a miraculous Cricket World Cup victory over Afghanistan as \"the greatest ODI innings that has ever happened.\"","content":"Australia captain Pat Cummins described Glenn Maxwell's astonishing double hundred that secured a miraculous Cricket World Cup victory over Afghanistan as \"the greatest ODI innings that has ever happened.\" Maxwell was joined by Cummins at the crease with Australia reeling at 91-7, chasing 292 for victory against Afghanistan in Mumbai, before he smashed an unbeaten 201 off 128 balls in an unbroken stand of 202 in which Cummins contributed just 12. An injured Maxwell, nursing various cramps, recorded Australia's highest individual ODI score and became only the third player to hit a World Cup double ton. His spectacular one-legged cameo included 21 fours and 10 sixes. Please use Chrome browser for a more accessible video player \"It has to be the greatest ODI innings that has ever happened,\" Cummins said in his post-match interview. \"Maxi was just ridiculous. I don't know how he did it; he was out of this world. \"When he is chasing, he always has a plan, so even from 200 behind, he was still mapping out a way to win the game.\" The Australia captain later added: \"It's just a one-man show. It looks so easy. Heroic Maxwell lead Australia into semis Watch the World Cup and more with NOW Cricket World Cup - fixtures and results Cricket World Cup - latest standings \"He can't move and still manages to hit a six [over] the third man with reverse. He's a freak. And when you're up against someone like that as a bowler, you don't have many options... \"We're just chatting about it, all the players, and we've decided it's one of those days where you just go, 'I was there in the stadium the day Glenn Maxwell chased down that total by himself.'\" Tuesday's win secured Australia a semi-final spot in the World Cup, the five-time winners confirming their place with a game to spare after winning six in a row. Cummins said improving the team's net run-rate was initially top of his mind when he walked out to join Maxwell, and it was not until the final 20 minutes that he actually believed that Australia could win. \"When I went out there, I thought if we can somehow scratch the 200, our net run-rate should be pretty good [to still try and qualify] for the semis,\" he said. \"When Maxi got his 100, I kind of thought, 'wow, we're within 120 or something.' At that point I still thought, 'no way.' \"I reckon it wasn't until the spinners were just about done and there was maybe 40 off 40 [balls], where I thought, 'okay even if Maxi gets out here, I reckon the other guys can get it done.'\" England take on the Netherlands on Wednesday in Pune with coverage from 8am ahead of the first ball at 8.30am on Sky Sports Cricket. The defending champions are out of the World Cup but can still qualify for the Champions Trophy if they finish in the top seven. Stream the Cricket World Cup and more top sport with NOW","pubDate":"2023-11-07 19:21:00","image_url":"https://e0.365dm.com/23/11/1920x1080/skysports-glenn-maxwell-australia_6352249.jpg?20231107203940","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"899c4385d9f51097992926f38df4dbe1","title":"England and Netherlands set to fight for Champions Trophy spot","link":"https://www.skysports.com/cricket/news/20876/13001973/cricket-world-cup-england-and-netherlands-fight-for-champions-trophy-spot-in-game-of-expectation-vs-privilege","keywords":null,"creator":null,"video_url":null,"description":"While a spot in the World Cup semi-finals is no longer possible for both England and Netherlands, their match could determine who will compete in the Champions Trophy.","content":"While a spot in the World Cup semi-finals is no longer possible for both England and Netherlands, their match could determine who will compete in the Champions Trophy. Jos Buttler's eliminated England side sit rock bottom of the table with just one win out of seven and two points, while Netherlands are two spots above with two wins and four points to their name. The top eight in this tournament will claim spots in the Champions Trophy 2025, the top seven if Pakistan finish out of those spots. Please use Chrome browser for a more accessible video player One win might be enough for the Netherlands to take one of those spots and two definitely should be. With the tough test of runaway leaders India in their last game, they will be looking at England as their best opportunity to get one of those wins wrapped up. Despite facing an England side low on confidence, Netherlands' Bas de Leede believes the \"expectation\" still firmly lies with England heading into the match. \"As a title-defending team there is a huge pressure on you straight away, especially when you don't get a great start, and I'm sure there is added pressure for them now on this game,\" said De Leede. Please use Chrome browser for a more accessible video player \"For us it's a privilege to be playing for a spot in the Champions Trophy, for them it's an expectation to finish at least in the top eight. Cricket World Cup - fixtures and results Cricket World Cup - latest standings Watch the World Cup and more with NOW 2023 Men's Cricket World Cup homepage \"Of course England are a dangerous side, they have such quality in the batting and bowling departments, but two wins in this campaign is pretty good for us and we feel as a group there is more out there for us. \"The proof is there in the South Africa game. To see what we have been practising come off against a team like that was great to see and gave us a lot of confidence as a team. Please use Chrome browser for a more accessible video player \"It's a massive opportunity, 100 per cent. It's in the back of our heads that if we do manage to win this game it would help enormously to qualify and that would be huge for Dutch cricket. \"If we did qualify for the Champions Trophy it would secure another seven games against the best teams. That's how we keep progressing as a national team and it's in our hands. We kind of felt like we were gate-crashing here so to come through would be massive.\" Former England fast bowler Steve Harmison believes England need to start making \"big decisions\", starting with putting Harry Brook back in the side. Brook played the first four matches of England's campaign but was then dropped when England opted for fewer batters in their line-up against Sri Lanka. Please use Chrome browser for a more accessible video player \"I struggle to understand how Brook doesn't get on. I know we've been picking world champions, but they're not playing at a champions' level,\" said Harmison. \"England should have been brave enough to say, 'this bloke needs to play'. We are talking about someone who is the best we've produced in a long time. He's not the finished article by any means, but he probably makes our best XI. \"The problem is England are picking names who haven't performed and hoping it gets better. One bad game turns to two, two turns to three. It needs leadership and a bit of bravery to make a big decision.\" Watch England's penultimate Cricket World Cup match, against Netherlands in Pune, live on Sky Sports Cricket from 8am on Wednesday (8.30am first ball). You can also stream the tournament without a contract through NOW.","pubDate":"2023-11-07 19:00:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-england-cricket-cricket-world-cup_6350692.jpg?20231106145815","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"892647fb4d12e6f81690fa850f5085fa","title":"‘I’m a bit numb’: Maxwell snatches victory with amazing double century","link":"https://www.brisbanetimes.com.au/sport/cricket/i-m-a-bit-numb-maxwell-snatches-victory-with-amazing-double-century-20231107-p5ei7c.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Glenn Maxwell smashed an extraordinary 201 not out to give Australia the most remarkable of victories over Afghanistan and a place in the World Cup semi-finals.","content":"The most incredible double century from a debilitated Glenn Maxwell has driven Australia to one of the most amazing World Cup victories of all time, beating Afghanistan by three wickets to shore up a semi-final berth. Riddled with cramp and collapsing in pain at one stage, Maxwell finished unbeaten on 201 from just 128 balls, finishing the match with a six to claim victory, Australia’s sixth in a row. It was just the third double century in World Cup history and the first in a run chase. Victory came with his 10th six to go with 21 fours in a partnership of 202 with Pat Cummins, who made just 12 not out from 68 balls as Australia recovered from a seemingly hopeless 7/91 to finish 7/293, winning with 19 balls remaining. “It’s pretty cool,” Maxwell said he stood bracing himself in the change rooms after the match to avoid further cramping. “It’s so fresh at the moment. I’m a bit numb to it. It was great. It was great fun. “It just felt like it was me and Patty (Cummins) just having fun out there. I’ll probably reflect a little bit more over the next few days and hopefully recover and get some movement back in my hamstrings and calves, but it’s a bit sore at the moment. Just a fortnight ago Maxwell scored the fastest century in World Cup history from just 40 balls against the Netherlands, while last week he fell off the back of a golf cart , suffering concussion which ruled him out of last Saturday’s victory over England . Glenn Maxwell celebrates a remarkable Australian victory. Credit: AP Third-placed Australia will now meet second-placed South Africa in a semi-final next week, with both teams sitting on six wins from eight matches, while unbeaten India’s semi-final opponent will come from New Zealand, Pakistan and Afghanistan, who all have four wins with a match to play. Australia’s match against Bangladesh on Saturday now has no bearing on the finals. Cummins described Maxwell’s performance as “the greatest one-day innings ever.” “We were just chatting about it, all the players, and we’ve decided it’s one of those days where you just go, I was there in the stadium the day Glenn Maxwell chased down that total by himself’,” the captain said. Cummins thought that Maxwell’s heroic innings was over and he would be forced to retire hurt as he collapsed after taking a run on 147, suffering multiple cramps, with Australia still needing 55 from 58 balls. The captain summoned No.10 Adam Zampa to come down from the change rooms. Australian captain Pat Cummins was a patient foil for the rampant Maxwell. Credit: AP “He (Maxwell) literally couldn’t move, then the physio (Ben Jones) was out there obviously and he kind of convinced Maxie that if he came off, he might be worse off. ‘Try and hang out there, stand up, and that’s probably your best bet. Because once you go off with that much cramp, there’s no guarantee you’re going to get back out there’.” Maxwell was forced to swing while rooted to the crease unable to run as he mounted what had initially appeared a hopeless rearguard action. Surviving a leg before wicket review on 27, and dropped catch on 33, Maxwell’s first 100 runs came in 76 balls with the second 50 in 25 balls. But there were no exuberant celebrations with more than a 100 still needed at a run a ball. Ibrahim Zadran’s maiden World Cup century for Afghanistan looked like stealing the headlines for much of the match. Credit: Getty It was Australia’s highest successful World Cup run chase, bettering the 287 they made against New Zealand in the 1996 quarter-final at Chennai. As Afghanistan began claiming Australian wickets they became increasingly chirpy, with Rashid Khan and David Warner having an extended and animated conversation, while Mitch Marsh, returning to the team following a trip home to mourn the death of his grandfather, turned his head and pointed his bat towards a celebrating Afghanistan huddle when he was dismissed for 24 from 11 balls. Loading In a night of firsts, Ibrahim Zadran scored Afghanistan’s maiden World Cup century – 129 from 143 balls with three sixes and eight fours – propelling the country to their highest World Cup score of 5/291. It looked for some time Afghanistan may also claim their first ODI victory over Australia, until Maxwell intervened. Watch every Australian game plus other big match-ups live and free on Nine, 9Gem and 9Now. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Cricket World Cup Australian cricket Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-11-07 18:52:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f4d5b4cdddbd87d6cb5a7339a6d8e154","title":"World Cup 2023: Sri Lanka court restores sacked cricket board","link":"https://www.newsr.in/n/Sports/1zpogeedom/World-Cup-2023-Sri-Lanka-court-restores-sacked.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Earlier, the Sri Lanka Sports Minister Roshan Ranasinghe suspended the whole Sri Lanka Cricket (SLC) board, the Sri Lanka-based Daily Mirror reported on Monday. Reported by DNA 1 hour ago.","content":"Tuesday, 7 November 2023 ( 2 hours ago ) Earlier, the Sri Lanka Sports Minister Roshan Ranasinghe suspended the whole Sri Lanka Cricket (SLC) board, the Sri Lanka-based Daily Mirror reported on Monday. 👓 View full article","pubDate":"2023-11-07 18:22:39","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f73751d91b878710074dd10675d7246c","title":"'I feel shocking' - Maxwell on making a double century with cramp","link":"https://www.newsr.in/n/Sports/1zpogeedks/feel-shocking-Maxwell-on-making.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Glenn Maxwell says he feels \"shocking\" after battling cramp to score an incredible double century and lead Australia to a stunning comeback win against Afghanistan at the Cricket World Cup. Reported by BBC Sport 1 hour ago.","content":"Tuesday, 7 November 2023 ( 2 hours ago ) Glenn Maxwell says he feels \"shocking\" after battling cramp to score an incredible double century and lead Australia to a stunning comeback win against Afghanistan at the Cricket World Cup. 👓 View full article","pubDate":"2023-11-07 18:13:43","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"41760d8e6c2c77a1d26bc78579c6cbaa","title":"Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move'","link":"https://www.dailymail.co.uk/sport/cricket/article-12722273/Pat-Cummins-reveals-Glenn-Maxwells-incredible-injury-battle-201-run-World-Cup-innings-thats-hailed-best-literally-move.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Maxwell hit 10 sixes and 21 boundaries in his stunning knock - partly because he was in so much pain he could hardly walk, let alone run between wickets.","content":"Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move' Maxwell rescued Aussies with stunning knock vs Afghanistan Skipper Cummins labelled it the greatest ODI innings ever Said batter was a 'freak' for overcoming injury battle in India By Ian Chadband For Australian Associated Press Published: 21:43, 7 November 2023 | Updated: 21:43, 7 November 2023 e-mail 1 View comments Glenn Maxwell, Australia 's 'Big Show', has delivered the ultimate show of his pyrotechnic career, leaving the cricket world saluting what his captain Pat Cummins believes is the greatest innings ever played in a one-day international . The amazing Maxwell, barely able to walk as he hobbled along with a back issue and terrible cramping in Mumbai , somehow still blitzed an unbetean 201 - on effectively one leg - to drag Australia from 7-91, past Afghanistan's total of 5-291 by three wickets, and into the World Cup semis. 'I think that's the greatest ODI innings,' said Cummins, who had the best view in the Wankhede Stadium of the carnage as he contributed a crucial, unbeaten 12 at the other end in their unbroken, match-winning stand of 202 for the eighth wicket on Tuesday. Maxwell hit 10 sixes and 21 boundaries in his incredible knock despite battling severe cramp 'It's the best I've ever seen, probably the greatest ODI innings ever. We're just chatting about it, all the players, and we've decided it's one of those days where you just go 'I was there in the stadium the day Glenn Maxwell chased down that total by himself'. 'It's just a one-man show. I'm up the other end and don't see any gaps in the field, don't see where I'm going to score a boundary - and yet it seems like every time he sees that, it still just runs away for four. It looks so easy. 'He still can't move, and yet still manages to hit a six over the third man with a reverse – he's a freak.' Maxwell finished the job with the winning six - his 10th of the innings to go with 21 fours - and like so many of the big hits, had to pull it off magically with minimal foot movement because his cramping was so debilitating. Cummins (left) branded Maxwell (right) a 'freak' after he single-handedly saved Australia from disaster with an innings for the ages At one stage Cummins even told the next batter, Adam Zampa, to come down to the ground because Maxwell 'literally couldn't move' 'Maxi was out of this world. I couldn't even get on strike! You just let him do his thing when he's doing that - how am I going to say anything to someone who's like that?' laughed Cummins. 'Even from 200 behind, he was still mapping a way we could win the game. I was just trying to survive!' Still, it was only with about 20 minutes left that Cummins felt Australia could really pull off the miracle, even believing that the 35-year-old might have to be 'stretched off' with his cramping woes. 'His back was cramping pretty early on, then just hamstrings, calves. For one over he said his toe was gone,' reported Cummins. Australia's physiotherapist (pictured treating Maxwell) advised Cummins that taking the batter off the field could actually make his condition worse 'I kind of signalled to Zamps (next batter Adam Zampa) to get down here because he literally couldn't move and then the physio kind of convinced Maxi that if he came off, it might be worse off.' Maxwell - as long as he avoids the sort of golf buggy accident that waylaid him for the previous game - should be fine for the rest of a tournament where he's already hit the fastest World Cup hundred ever off 40 balls and now has Australia's highest-ever ODI score. 'I'm sure it will be fine for the next game - plenty of hydration, he'll be in the ice bath I'm sure, but it will be okay,' smiled Cummins. Pat Cummins Mumbai Afghanistan Share or comment on this article: Pat Cummins reveals Glenn Maxwell's incredible injury battle during 201-run World Cup innings that's been hailed as the best EVER: 'He literally couldn't move' e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:43:03","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/21/77523381-0-image-m-12_1699393238634.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"36b15f35f52f501b516ecff567dc8d14","title":"‘No other team would’ve done such a disgraceful act’: Mathews blasts Shakib, Bangladesh for timed out dismissal","link":"https://kashmirreader.com/2023/11/08/no-other-team-wouldve-done-such-a-disgraceful-act-mathews-blasts-shakib-bangladesh-for-timed-out-dismissal/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"New Delhi: Sri Lanka all-rounder Angelo Mathews launched a no-holds-barred attack on Shakib Al Hasan and the Bangladesh team for not using ‘common sense’ and withdrawing the appeal of timed out against him during a World Cup 2023 match at the Arun Jaitely Stadium in Delhi on Monday. Mathews became the first-ever cricketer in international […]","content":"New Delhi: Sri Lanka all-rounder Angelo Mathews launched a no-holds-barred attack on Shakib Al Hasan and the Bangladesh team for not using ‘common sense’ and withdrawing the appeal of timed out against him during a World Cup 2023 match at the Arun Jaitely Stadium in Delhi on Monday. Mathews became the first-ever cricketer in international cricket to be timed out when Bangladesh appealed in the 25th over of Sri Lanka’s innings. Richard Illingworth and Marias Erasmus, the on-field umpires, asked Shakib twice if he would like to withdraw his appeal considering that the batter’s helmet strap broke but upon that he wouldn’t, they gave Mathews out. According to the ICC playing conditions, a new batter has to be ready to play the next ball within two minutes of the previous batter’s dismissal. The umpires said Mathews had crossed the two-minute mark even before the strap of his helmet broke and hence was given out. Mathews, however, denied the same and alleged that he had video proof to support his claims. The former Sri Lanka captain said it was a ‘disgraceful’ act from Shakib. “I don’t know where the common sense went, because obviously it’s obviously disgraceful from Shakib and Bangladesh if they want to play cricket like that obviously stooped down to that level I think there’s something wrong drastically because – if I got late if I got past my two minutes to get to the crease and in the law says you have to be ready within the two minutes and I was there two minutes 45 or 50 seconds – I still had after my helmet broke off, I still had five more seconds to go. And the umpires also have said to our coaches that they didn’t see my helmet breaking. I mean, I was just asking for my helmet,” Mathews told reporters after Bangladesh won the match by three wickets. The veteran all-rounder, who celebrated Shakib’s wicket by towards his wrist to suggest a time out, said he had the utmost respect for the Bangladesh captain but things changed after Monday’s incident. ‘Shakib had choice to withdraw appeal but he didn’t’ “I mean, see, up to today, I had utmost respect for him and Bangladesh team. Obviously, you all play to win. And if it’s within the rule, it’s fine. But the rule clearly says, in my incident today, within two minutes I was there. We have video evidence. We will put out a statement later on. We have video evidence, footage, everything was looked. I’m not just coming and saying things here. I’m talking with proof,” he added. Mathews said no other team apart from Bangladesh would have done such a thing. “I don’t think any other team would do that because it was black and white. It was equipment, the helmet coming off and it was a safety issue as well, because we know that without a helmet, I cannot face a bowler. And it was just there to be seen. It was not about anyone being disrespectful. “Yes, Shakib had the option of – he knew that this was not time-wasting or I was there within my time. And he had the choice of, but he decided to go the other way. And my personal opinion is, if it was any other team, they wouldn’t have done it.” Stating that he was in complete shock, Mathews said he hadn’t seen a team stopping so low in his 15-year-long career. The Sri Lanka veteran said it might not have made a difference in the outcome of the match but common sense should have been used. “I think in my 15 years of career, I’ve never seen a team going down to that level because obviously the umpires also admitted that it’s equipment malfunction, and they could have gone upstairs and checked again. “Yeah, I mean, what’s the point not checking at that time and then saying it afterwards? Because I’m not saying if I was there, we could have won the match. It’s a different story. But still, you need to have your common sense in terms of using technology. And also, it was clearly a malfunction. I mean, it just came off. You know, I didn’t mean to pull it and break it. “I still had my time as well and I was in complete shock,” he said. Agencies ‘No other team would’ve done such a disgraceful act’: Mathews blasts Shakib, Bangladesh for timed out dismissal added by KR Desk on 2:58 am November 8, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-11-07 21:28:01","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"7ea7b9e965aa772e4fdd663b7540288c","title":"Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification","link":"https://www.dailymail.co.uk/sport/cricket/article-12721537/Harry-Brook-Gus-Atkinson-set-return-England-seek-avoid-new-low-beating-World-Cup-minnows-Netherlands-alive-Champions-Trophy-qualification-hopes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Defeat by the Netherlands in Pune would not simply enhance their status as the laughing stock of the World Cup, but leave them in serious danger of failing to qualify for Champions Trophy in 2025.","content":"Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification Harry Brook and Gus Atkinson set to return for England against the Netherlands Defeat on Friday could prompt a rethink over future of head coach Matthew Mott Managing director Rob Key flies in on Friday, ahead of final World Cup match By Lawrence Booth for the Daily Mail Published: 17:08 GMT, 7 November 2023 | Updated: 21:18 GMT, 7 November 2023 e-mail 5 View comments Not in their worst nightmares could England have envisaged the scenario that awaits them on Friday. Defeat by the Netherlands in Pune would not simply enhance their status as the laughing stock of the World Cup, but leave them in serious danger of failing to qualify for the Champions Trophy in 2025. It is a double whammy no one predicted. And despite the suggestion that head coach Matthew Mott is safe in his position, there is little doubt that a sixth successive loss - which would be their worst ODI sequence since 2009 - may encourage a rethink, only 18 months into his four-year contract. When managing director Rob Key flies in to Kolkata on Friday, ahead of England's final match against Pakistan, he will ostensibly be helping to pick two white-ball squads for the pre-Christmas jaunt in the Caribbean. But he would not be doing his job if he didn't seek insight into how England's title defence has proved as flat as the local naan bread. Harry Brook and Gus Atkinson set to return for England against the Netherlands on Friday Managing director Rob Key flies in to Kolkata on Friday, ahead of England's final match It said much about the depths they have plumbed that, before a crucial game that could determine the futures of some of his colleagues, fielding coach Carl Hopkinson was the man charged with talking to the media. This was hardly his fault, but it was hard to avoid the conclusion that England have given up trying to explain the farce. On Monday, for the first time all tour, they didn't offer a talking head. Now, they were dipping into the backroom staff. Hopkinson spoke gamely about England's failure to 'execute under pressure', a phrase that covers a multitude of sins, and defended Ben Stokes' decision to stay on until the end of the World Cup, rather than fly home for immediate knee surgery to ensure he is fit to return to India in the new year for five Tests. But it all felt like going through the motions, which has been a theme of their tournament. Even Hopkinson's well-meaning assessment of Mott didn't quite assuage fears that England's head coach is a fundamentally good man who lacks the edge to alter their fortunes. 'First and foremost, Motty's a relaxed character,' he said. 'He's got a lot of experience in lots of different avenues that he can bring to the party when things aren't going well, but equally when they do go well, like they did this time last year.' In fairness to Hopkinson, England have fielded well in India, their catching success rate of 85 per cent placing them joint-top of the 10 teams. But on every other metric they have been also rans, scoring only one of the tournament's top 25 totals, and possessing none of its top 20 run-scorers, none of its top 20 six-hitters, and only one - Adil Rashid - of its top 28 wicket-takers. England have been poor. Worse, they have been invisible. There is little choice but to freshen things up, with Harry Brook and Gus Atkinson - both scandalously overlooked for the last three matches - in contention. Liam Livingstone, who has averaged 10 with the bat and 52 with the ball, and Mark Wood, who has a knee niggle, could make way. Another World Cup defeat could prompt a rethink over future of head coach Matthew Mott Above all, England have to find a way - any way - of beating a Dutch side who have been energised by wins over South Africa and Bangladesh, and who know a struggling side trading on former glories when they see it. County pros such as Roelof van der Merwe (Somerset), Colin Ackermann (Leicestershire) and Paul van Meekeren (Gloucestershire) will need no second invitation to smear more egg on English faces. The Netherlands' bowling coach Ryan van Niekerk was too polite to say so, describing England as 'world champions', which technically remains true, if increasingly irrelevant - just as England's world-record 498 for four against the Dutch in Amsterdam in 2022 has faded from memory. He also cautioned: 'Never underestimate a wounded buffalo. They can produce incredible performances at any moment, and we're preparing for the best England possible.' That has been another theme: opponents keep waiting for the backlash that never comes. Whisper it, but the Netherlands have the verve and the drive to repeat their T20 World Cup wins over England at Lord's in 2009 and Chittagong in 2014. If they do, Key will have more on his plate than ever seemed possible. India England Cricket The Netherlands Share or comment on this article: Harry Brook and Gus Atkinson set to return as England seek to avoid new low by beating World Cup minnows Netherlands and keep their hopes alive of Champions Trophy qualification e-mail Add comment Comments 5 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:18:30","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/18/77517381-0-image-a-4_1699380335867.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd94a3e57a0c12bc5340448413bf40c7","title":"Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai","link":"https://www.dailymail.co.uk/sport/cricket/article-12721359/Glenn-Maxwell-saves-Australia-Cricket-star-hits-one-greatest-innings-rescue-Pat-Cummins-rounder-denying-Afghanistan-famous-victory-Mumbai.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"AADAM PATEL AT THE WANKHEDE STADIUM, MUMBAI: In the end, it took something truly heroic from Glenn Maxwell to deny Afghanistan another famous scalp and take Australia through.","content":"Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai Glenn Maxwell hit one of the greatest innings of all time He rescued Australia from a shock defeat by Afghanistan Maxwell battled severe cramp to get his side the victory By Aadam Patel For The Daily Mail Published: 16:45 GMT, 7 November 2023 | Updated: 21:12 GMT, 7 November 2023 e-mail 126 shares 110 View comments The city of Mumbai with its famous maidans is steeped in cricketing history and this iconic ground alone would have seen many a special innings. Not least from some of its most famous sons like Sachin Tendulkar and Sunil Gavaskar. But in all of its years, it would never have seen an innings as utterly insane, as utterly ridiculous as the double hundred it witnessed from Australia 's Glenn Maxwell, who battled through a back injury and body cramps against Afghanistan, to snatch a three-wicket win from the jaws of defeat. 'It's pretty cool,' said Maxwell as he stood in the changing rooms after the match to avoid further cramping. 'It's a bit fresh and I'm a bit numb to it right now but it was great fun. It just felt like it was me and Patty (Cummins) having fun out there. I've never been in a position where I've had full body cramps like that but it probably made the job simple for me,' added Maxwell. Glenn Maxwell produced one of the greatest innings of all time for Australia Pat Cummins' side were at one point 91-7 before Maxwell rescued his team He battled severe cramps after returning from concussion on Tuesday As he heaved Mujeeb ul Rahman into the stands to secure Australia's place in the World Cup semi-finals, the entirety of the Wankhede rose in appreciation of a gladiatorial innings for the ages. Maxwell had arrived in the middle three hours earlier in a chase of 292 to face a hat-trick ball with Pat Cummins' side 49 for four, after Afghanistan's quicks had caused carnage. That he was even in the side was remarkable, after he fell off a golf buggy last Monday and was ruled out of their win over England due to concussion. With the hat-trick ball, Azmatullah Ozarzai found Maxwell's outside edge but the ball failed to carry to the wicketkeeper Hamid Alikhil. When Alikhil pulled off a stunning reflex catch to remove Mitchell Starc, Australia were reeling at 91 for seven and Jonathan Trott's men were on their way to yet another famous scalp. Ultimately, it was only the heroic Maxwell who denied them, smashing 21 fours and 10 sixes on his way to an unbeaten 201 off 128 deliveries. He was dropped twice on 24 and 33 and was halfway back to the pavilion on 27 when he realised his review was successful. Alongside Cummins, the pair put on an unbroken record eighth-wicket partnership of 202, of which Cummins himself contributed just 12 off 68 deliveries. He must have felt like a spectator on the other end with the best seat in the house as Maxwell quite literally, stood and delivered. 'It's the greatest ODI innings I've ever seen,' said Cummins. 'It's probably the greatest ODI innings ever. The lads were chatting with each other and saying how it's one of those days where you just go, I was there in the stadium the day Glenn Maxwell chased down the total all by himself,' the Australia captain added. At one stage, with 55 runs still needed, Maxwell fell flat on the floor with his body cramping up while finishing a run. Not for the first time in the innings, Adam Zampa was waiting on the boundary edge to come out to bat as Australia's physio Nick Jones came out but again, Maxwell somehow found the sheer will to carry on through the pain. He could not run but continued to clear the ropes with ease, playing off one leg at times. From that point, the 35-year-old dealt in boundaries alone, with 50 of Australia's last 56 runs coming with fours and sixes. With 21 needed off four overs, Maxwell needed just four balls as he finished Afghanistan off going six, six, four and six off consecutive deliveries to cap off the greatest of innings and add Australia's first ever ODI double hundred to the fastest World Cup century he scored against the Netherlands earlier in the tournament. For Afghanistan, it was a huge missed opportunity on a night when they could have put themselves on the brink of a historic first World Cup semi-final. 'It was a world-class innings but we certainly helped him along the way,' admitted Trott. 'When you get an opportunity against a side like Australia, you've got to grab it. But full credit to him. The way he played was phenomenal. He deserved to win that game.' Mumbai Australia Cricket Afghanistan Share or comment on this article: Glenn Maxwell saves Australia! Cricket star hits one of the greatest EVER innings to rescue Pat Cummins' side with the all-rounder denying Afghanistan a famous victory in Mumbai e-mail 126 shares Add comment Comments 110 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-11-07 21:12:58","image_url":"https://i.dailymail.co.uk/1s/2023/11/07/19/77519687-0-image-a-17_1699384117127.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"fd185a1f3de2ccb6223461567314d178","title":"Maxwell powers Australia to win over Afghanistan","link":"https://dailymailnews.pk/maxwell-powers-australia-to-win-over-afghanistan/","keywords":["Sport"],"creator":["DM NEWS"],"video_url":null,"description":"Sports Desk MUMBAI: Glenn Maxwell on Tuesday shocked Afghanistan as Australia inflicted a three-wicket defeat on the former in a thrilling group match of the ongoing ICC Men’s Cricket World Cup in Mumbai, India. The Aussie batter played one of the greatest innings in the history of the World Cup, hitting an astonishing unbeaten double-century. […]","content":"MUMBAI: Glenn Maxwell on Tuesday shocked Afghanistan as Australia inflicted a three-wicket defeat on the former in a thrilling group match of the ongoing ICC Men’s Cricket World Cup in Mumbai, India. The Aussie batter played one of the greatest innings in the history of the World Cup, hitting an astonishing unbeaten double-century. Maxwell, 35, terrorised Afghanistan’s bowlers and hit them all over the park as he, alongside skipper Pat Cummins, snatched victory from the jaws of defeat. The 35-year-old came to bat when his side was 49-4 after Josh Inglis had just lost his wicket for a golden duck. However, Maxwell got a life on two different occasions as he was dropped by Hashmatullah Shahidi and Mujeeb ur Rehman. Afghanistan’s bowlers caused all kinds of trouble for Australian batters in the early overs and were on the way to a certain victory. Still, Maxwell alone became the reason for their pain as the right-handed destructive batter gave no choice or chance to Shahidi’s men. Maxwell was largely supported by Cummins who played a calm and sensible knock, scoring 12 runs in 68 balls. The 35-year-old also suffered cramps and, in the last few overs, he was unable to run while also playing shots without using any footwork. Glenn Maxwell became the first ever batter to score a 200 in a chase in ODIs and also the first player to score 2 centuries in a WC edition batting at No. 5 or lower. Batting first, Ibrahim Zadran was the standout player as he became the first Afghani batter to score a century in the history of the World Cup. While other Afghani batters failed to score big it was Zadran who came as an opener and stayed till the very end, helping his side to reach a good total. Rashid Khan significantly supported Zadran during the last five overs as the all-rounder played a rapid knock, scoring 35 off just 18 deliveries with two fours and three sixes. Rahmat Shah (30), skipper Hashmatullah Shahidi (26) and Azmatullah Omarzai (22) were the other contributors to the winning side. No Australia bowler other than Josh Hazlewood bowled up to the expectations as the right-handed pacer only conceded 39 runs in nine overs and also took two important wickets. Afghanistan will now play another important and must-win match against South Africa on November 9. Meanwhile, Australia will take on Bangladesh on November 11 in their last group match.","pubDate":"2023-11-07 20:15:40","image_url":null,"source_id":"dailymailnews","source_priority":24862659,"country":["pakistan"],"category":["sports"],"language":"english"},{"article_id":"682210202f6c175f4643b507d5ac3fd2","title":"Cummins hails Maxwell double ton as 'greatest ODI innings ever!'","link":"https://www.skysports.com/cricket/news/20876/13002925/glenn-maxwell-australia-captain-pat-cummins-hails-match-winning-double-hundred-as-greatest-odi-innings-ever","keywords":null,"creator":null,"video_url":null,"description":"Australia captain Pat Cummins described Glenn Maxwell's astonishing double hundred that secured a miraculous Cricket World Cup victory over Afghanistan as \"the greatest ODI innings that has ever happened.\"","content":"Australia captain Pat Cummins described Glenn Maxwell's astonishing double hundred that secured a miraculous Cricket World Cup victory over Afghanistan as \"the greatest ODI innings that has ever happened.\" Maxwell was joined by Cummins at the crease with Australia reeling at 91-7, chasing 292 for victory against Afghanistan in Mumbai, before he smashed an unbeaten 201 off 128 balls in an unbroken stand of 202 in which Cummins contributed just 12. An injured Maxwell, nursing various cramps, recorded Australia's highest individual ODI score and became only the third player to hit a World Cup double ton. His spectacular one-legged cameo included 21 fours and 10 sixes. Please use Chrome browser for a more accessible video player \"It has to be the greatest ODI innings that has ever happened,\" Cummins said in his post-match interview. \"Maxi was just ridiculous. I don't know how he did it; he was out of this world. \"When he is chasing, he always has a plan, so even from 200 behind, he was still mapping out a way to win the game.\" The Australia captain later added: \"It's just a one-man show. It looks so easy. Heroic Maxwell lead Australia into semis Watch the World Cup and more with NOW Cricket World Cup - fixtures and results Cricket World Cup - latest standings \"He can't move and still manages to hit a six [over] the third man with reverse. He's a freak. And when you're up against someone like that as a bowler, you don't have many options... \"We're just chatting about it, all the players, and we've decided it's one of those days where you just go, 'I was there in the stadium the day Glenn Maxwell chased down that total by himself.'\" Tuesday's win secured Australia a semi-final spot in the World Cup, the five-time winners confirming their place with a game to spare after winning six in a row. Cummins said improving the team's net run-rate was initially top of his mind when he walked out to join Maxwell, and it was not until the final 20 minutes that he actually believed that Australia could win. \"When I went out there, I thought if we can somehow scratch the 200, our net run-rate should be pretty good [to still try and qualify] for the semis,\" he said. \"When Maxi got his 100, I kind of thought, 'wow, we're within 120 or something.' At that point I still thought, 'no way.' \"I reckon it wasn't until the spinners were just about done and there was maybe 40 off 40 [balls], where I thought, 'okay even if Maxi gets out here, I reckon the other guys can get it done.'\" England take on the Netherlands on Wednesday in Pune with coverage from 8am ahead of the first ball at 8.30am on Sky Sports Cricket. The defending champions are out of the World Cup but can still qualify for the Champions Trophy if they finish in the top seven. Stream the Cricket World Cup and more top sport with NOW","pubDate":"2023-11-07 19:21:00","image_url":"https://e0.365dm.com/23/11/1920x1080/skysports-glenn-maxwell-australia_6352249.jpg?20231107203940","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"899c4385d9f51097992926f38df4dbe1","title":"England and Netherlands set to fight for Champions Trophy spot","link":"https://www.skysports.com/cricket/news/20876/13001973/cricket-world-cup-england-and-netherlands-fight-for-champions-trophy-spot-in-game-of-expectation-vs-privilege","keywords":null,"creator":null,"video_url":null,"description":"While a spot in the World Cup semi-finals is no longer possible for both England and Netherlands, their match could determine who will compete in the Champions Trophy.","content":"While a spot in the World Cup semi-finals is no longer possible for both England and Netherlands, their match could determine who will compete in the Champions Trophy. Jos Buttler's eliminated England side sit rock bottom of the table with just one win out of seven and two points, while Netherlands are two spots above with two wins and four points to their name. The top eight in this tournament will claim spots in the Champions Trophy 2025, the top seven if Pakistan finish out of those spots. Please use Chrome browser for a more accessible video player One win might be enough for the Netherlands to take one of those spots and two definitely should be. With the tough test of runaway leaders India in their last game, they will be looking at England as their best opportunity to get one of those wins wrapped up. Despite facing an England side low on confidence, Netherlands' Bas de Leede believes the \"expectation\" still firmly lies with England heading into the match. \"As a title-defending team there is a huge pressure on you straight away, especially when you don't get a great start, and I'm sure there is added pressure for them now on this game,\" said De Leede. Please use Chrome browser for a more accessible video player \"For us it's a privilege to be playing for a spot in the Champions Trophy, for them it's an expectation to finish at least in the top eight. Cricket World Cup - fixtures and results Cricket World Cup - latest standings Watch the World Cup and more with NOW 2023 Men's Cricket World Cup homepage \"Of course England are a dangerous side, they have such quality in the batting and bowling departments, but two wins in this campaign is pretty good for us and we feel as a group there is more out there for us. \"The proof is there in the South Africa game. To see what we have been practising come off against a team like that was great to see and gave us a lot of confidence as a team. Please use Chrome browser for a more accessible video player \"It's a massive opportunity, 100 per cent. It's in the back of our heads that if we do manage to win this game it would help enormously to qualify and that would be huge for Dutch cricket. \"If we did qualify for the Champions Trophy it would secure another seven games against the best teams. That's how we keep progressing as a national team and it's in our hands. We kind of felt like we were gate-crashing here so to come through would be massive.\" Former England fast bowler Steve Harmison believes England need to start making \"big decisions\", starting with putting Harry Brook back in the side. Brook played the first four matches of England's campaign but was then dropped when England opted for fewer batters in their line-up against Sri Lanka. Please use Chrome browser for a more accessible video player \"I struggle to understand how Brook doesn't get on. I know we've been picking world champions, but they're not playing at a champions' level,\" said Harmison. \"England should have been brave enough to say, 'this bloke needs to play'. We are talking about someone who is the best we've produced in a long time. He's not the finished article by any means, but he probably makes our best XI. \"The problem is England are picking names who haven't performed and hoping it gets better. One bad game turns to two, two turns to three. It needs leadership and a bit of bravery to make a big decision.\" Watch England's penultimate Cricket World Cup match, against Netherlands in Pune, live on Sky Sports Cricket from 8am on Wednesday (8.30am first ball). You can also stream the tournament without a contract through NOW.","pubDate":"2023-11-07 19:00:00","image_url":"https://e2.365dm.com/23/11/1920x1080/skysports-england-cricket-cricket-world-cup_6350692.jpg?20231106145815","source_id":"skysports","source_priority":831,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"892647fb4d12e6f81690fa850f5085fa","title":"‘I’m a bit numb’: Maxwell snatches victory with amazing double century","link":"https://www.brisbanetimes.com.au/sport/cricket/i-m-a-bit-numb-maxwell-snatches-victory-with-amazing-double-century-20231107-p5ei7c.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Malcolm Conn"],"video_url":null,"description":"Glenn Maxwell smashed an extraordinary 201 not out to give Australia the most remarkable of victories over Afghanistan and a place in the World Cup semi-finals.","content":"The most incredible double century from a debilitated Glenn Maxwell has driven Australia to one of the most amazing World Cup victories of all time, beating Afghanistan by three wickets to shore up a semi-final berth. Riddled with cramp and collapsing in pain at one stage, Maxwell finished unbeaten on 201 from just 128 balls, finishing the match with a six to claim victory, Australia’s sixth in a row. It was just the third double century in World Cup history and the first in a run chase. Victory came with his 10th six to go with 21 fours in a partnership of 202 with Pat Cummins, who made just 12 not out from 68 balls as Australia recovered from a seemingly hopeless 7/91 to finish 7/293, winning with 19 balls remaining. “It’s pretty cool,” Maxwell said he stood bracing himself in the change rooms after the match to avoid further cramping. “It’s so fresh at the moment. I’m a bit numb to it. It was great. It was great fun. “It just felt like it was me and Patty (Cummins) just having fun out there. I’ll probably reflect a little bit more over the next few days and hopefully recover and get some movement back in my hamstrings and calves, but it’s a bit sore at the moment. Just a fortnight ago Maxwell scored the fastest century in World Cup history from just 40 balls against the Netherlands, while last week he fell off the back of a golf cart , suffering concussion which ruled him out of last Saturday’s victory over England . Glenn Maxwell celebrates a remarkable Australian victory. Credit: AP Third-placed Australia will now meet second-placed South Africa in a semi-final next week, with both teams sitting on six wins from eight matches, while unbeaten India’s semi-final opponent will come from New Zealand, Pakistan and Afghanistan, who all have four wins with a match to play. Australia’s match against Bangladesh on Saturday now has no bearing on the finals. Cummins described Maxwell’s performance as “the greatest one-day innings ever.” “We were just chatting about it, all the players, and we’ve decided it’s one of those days where you just go, I was there in the stadium the day Glenn Maxwell chased down that total by himself’,” the captain said. Cummins thought that Maxwell’s heroic innings was over and he would be forced to retire hurt as he collapsed after taking a run on 147, suffering multiple cramps, with Australia still needing 55 from 58 balls. The captain summoned No.10 Adam Zampa to come down from the change rooms. Australian captain Pat Cummins was a patient foil for the rampant Maxwell. Credit: AP “He (Maxwell) literally couldn’t move, then the physio (Ben Jones) was out there obviously and he kind of convinced Maxie that if he came off, he might be worse off. ‘Try and hang out there, stand up, and that’s probably your best bet. Because once you go off with that much cramp, there’s no guarantee you’re going to get back out there’.” Maxwell was forced to swing while rooted to the crease unable to run as he mounted what had initially appeared a hopeless rearguard action. Surviving a leg before wicket review on 27, and dropped catch on 33, Maxwell’s first 100 runs came in 76 balls with the second 50 in 25 balls. But there were no exuberant celebrations with more than a 100 still needed at a run a ball. Ibrahim Zadran’s maiden World Cup century for Afghanistan looked like stealing the headlines for much of the match. Credit: Getty It was Australia’s highest successful World Cup run chase, bettering the 287 they made against New Zealand in the 1996 quarter-final at Chennai. As Afghanistan began claiming Australian wickets they became increasingly chirpy, with Rashid Khan and David Warner having an extended and animated conversation, while Mitch Marsh, returning to the team following a trip home to mourn the death of his grandfather, turned his head and pointed his bat towards a celebrating Afghanistan huddle when he was dismissed for 24 from 11 balls. Loading In a night of firsts, Ibrahim Zadran scored Afghanistan’s maiden World Cup century – 129 from 143 balls with three sixes and eight fours – propelling the country to their highest World Cup score of 5/291. It looked for some time Afghanistan may also claim their first ODI victory over Australia, until Maxwell intervened. Watch every Australian game plus other big match-ups live and free on Nine, 9Gem and 9Now. Sports news, results and expert commentary. Sign up for our Sport newsletter . Save Log in , register or subscribe to save articles for later. License this article Cricket World Cup Australian cricket Malcolm Conn is Chief Cricket Writer. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-11-07 18:52:00","image_url":null,"source_id":"brisbanetimes","source_priority":189315,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f4d5b4cdddbd87d6cb5a7339a6d8e154","title":"World Cup 2023: Sri Lanka court restores sacked cricket board","link":"https://www.newsr.in/n/Sports/1zpogeedom/World-Cup-2023-Sri-Lanka-court-restores-sacked.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Earlier, the Sri Lanka Sports Minister Roshan Ranasinghe suspended the whole Sri Lanka Cricket (SLC) board, the Sri Lanka-based Daily Mirror reported on Monday. Reported by DNA 1 hour ago.","content":"Tuesday, 7 November 2023 ( 2 hours ago ) Earlier, the Sri Lanka Sports Minister Roshan Ranasinghe suspended the whole Sri Lanka Cricket (SLC) board, the Sri Lanka-based Daily Mirror reported on Monday. 👓 View full article","pubDate":"2023-11-07 18:22:39","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"f73751d91b878710074dd10675d7246c","title":"'I feel shocking' - Maxwell on making a double century with cramp","link":"https://www.newsr.in/n/Sports/1zpogeedks/feel-shocking-Maxwell-on-making.htm","keywords":["Sports"],"creator":null,"video_url":null,"description":"Glenn Maxwell says he feels \"shocking\" after battling cramp to score an incredible double century and lead Australia to a stunning comeback win against Afghanistan at the Cricket World Cup. Reported by BBC Sport 1 hour ago.","content":"Tuesday, 7 November 2023 ( 2 hours ago ) Glenn Maxwell says he feels \"shocking\" after battling cramp to score an incredible double century and lead Australia to a stunning comeback win against Afghanistan at the Cricket World Cup. 👓 View full article","pubDate":"2023-11-07 18:13:43","image_url":null,"source_id":"newsr","source_priority":29095901,"country":["india"],"category":["sports"],"language":"english"}]}