{"newsArray":[{"title":"Josh Inglis To Make Debut For Australia In 1st T20I Against Sri Lanka","link":"https://sports.ndtv.com/cricket/josh-inglis-to-make-debut-for-australia-in-1st-t20i-against-sri-lanka-confirms-aaron-finch-2759731","keywords":null,"creator":null,"video_url":null,"description":"Australia and Sri Lanka will square off in the first T20I on Friday at the Sydney Cricket Ground. Finch also confirmed that Inglis will be batting at No.3 for Australia in the first T20I.","content":null,"pubDate":"2022-02-10 03:22:35","full_description":"Australia skipper Aaron Finch on Thursday confirmed that Josh Inglis will make his debut in the upcoming first T20I of the five-match series against Sri Lanka. Australia and Sri Lanka will square off in the first T20I on Friday at the Sydney Cricket Ground. Finch also confirmed that Inglis will be batting at No.3 for Australia in the first T20I. Inglish will replace Mitchell Marsh in the lineup while Ben McDermott will open the batting in place of David Warner and these two are the only changes from the Australia side that won the T20 World Cup final last year, reported cricket.com.au. Marsh and Warner have been rested from the series against Sri Lanka and Travis Head is unavailable for the first three games as he will be playing Sheffield Shield for South Australia. \"Ben McDermott has been in unbelievable nick so to get him at the top of the order was really crucial for us. And Josh Inglis has been someone who has been shuffled around the order a little bit. His selection is a sign of how well he's played over the last couple of years, but also how great he was around the group at the T20 World Cup,\" cricket.com.au quoted Finch as saying. Promoted \"He hasn't got the runs he would have liked throughout the Big Bash as he has done in the past. But he was playing slightly different roles. So it's a great opportunity for him,\" he added. Australia playing XI for 1st T20I: Ben McDermott, Aaron Finch (c), Josh Inglis, Steve Smith, Glenn Maxwell, Marcus Stoinis, Matthew Wade (wk), Pat Cummins, Mitchell Starc, Adam Zampa, Josh Hazlewood.","image_url":"https://c.ndtvimg.com/2021-11/jo7jiui_aaron-finch-afp_625x300_13_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Andrew Strauss Reveals Joe Root's New Batting Position In Tests","link":"https://sports.ndtv.com/cricket/first-thing-joe-root-said-andrew-strauss-on-england-captains-new-batting-position-in-tests-2759724","keywords":null,"creator":null,"video_url":null,"description":"interim managing director of England Men's Cricket, Andrew Strauss talked about captain Joe Root's batting position in the upcoming West Indies series.","content":null,"pubDate":"2022-02-10 03:13:42","full_description":"Andrew Strauss, the interim managing director of England Men's Cricket has revealed that skipper Joe Root himself instigated the move to bat at No.3 in the upcoming Test series against West Indies. While batting at No.4, Root managed to score 1,777 runs last year including six hundreds in the 17 Tests he played. \"The first thing Root said in selection was that he was very keen to bat three moving forward. That came from him; that was his request. And I think everyone agrees that that's probably a healthy thing for the England cricket team at the moment,\" Strauss told Sky Sports News, as reported by ESPNcricinfo. \"Our issues have been in the top three, top of the order. So we're going to see a new opening partnership out there with Alex Lees coming in and Joe's stepping up to No. 3 - that gives a bit of space in the middle order for some of those less experienced players to show what they can do but also show what they can do more consistently, which has been the big problem,\" he added. England Men's selection panel, consisting of Andrew Strauss, interim head coach Paul Collingwood and head scout James Taylor, on Tuesday, named a 16-strong squad for the three-match Test tour of the Caribbean starting next month. Eight players - James Anderson, Dom Bess, Sam Billings, Stuart Broad, Rory Burns, Jos Buttler, Haseeb Hameed, and Dawid Malan - who featured in the recent Ashes series, missed out on selection. Promoted The three-match Test series forms part of the ICC World Test Championship. Joe Root's team will be looking to climb the rankings after a disappointing start to the second edition of the Championship. At the end of the two-year cycle, the top two teams will compete in the ICC World Test Championship Final due to be staged in 2023. England squad: Joe Root (C), Jonny Bairstow, Zak Crawley, Matthew Fischer, Ben Foakes, Dan Lawrence, Jack Leach, Alex Lees, Saqib Mahmood, Craig Overton, Matthew Parkinson, Ollie Pope, Ollie Robinson, Ben Stokes, Chris Woakes, Mark Wood.","image_url":"https://c.ndtvimg.com/2021-12/m1qp0eu8_joe-root-batting-test-afp_625x300_26_December_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Josh Inglis’ selection is a sign of how well he’s played over the last couple of years”: Aaron Finch confirms Josh Inglis will make his debut in Australia vs Sri Lanka first T20I","link":"https://thesportsrush.com/cricket-news-josh-inglis-selection-is-a-sign-of-how-well-hes-played-over-the-last-couple-of-years-aaron-finch-confirms-josh-inglis-will-make-his-debut-in-australia-vs-sri-lanka-first-t20i/","keywords":["Cricket","Australia vs Sri Lanka","cricket australia","Josh Inglis"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Australia vs Sri Lanka: Josh Inglis will make his international debut in the first T20I, whereas Ben McDermott will open the innings. Australia have announced their playing eleven for the first T20I against Sri Lanka. Aaron Finch has confirmed that Josh Inglis is set to make his debut at the Sydney Cricket Ground. Ben McDermott,… The post “Josh Inglis’ selection is a sign of how well he’s played over the last couple of years”: Aaron Finch confirms Josh Inglis will make his debut in Australia vs Sri Lanka first T20I appeared first on The SportsRush.","content":"Australia vs Sri Lanka: Josh Inglis will make his international debut in the first T20I, whereas Ben McDermott will open the innings. Australia have announced their playing eleven for the first T20I against Sri Lanka. Aaron Finch has confirmed that Josh Inglis is set to make his debut at the Sydney Cricket Ground. Ben McDermott, the highest run-scorer of BBL 11 is set to open with Aaron Finch. Josh Inglis and Ben McDermott will replace Mitch Marsh and David Warner from the usual squad. The trio of Josh Hazlewood, Pat Cummins, and Mitch Starc is back, whereas Adam Zampa will be the lone spinner. Glenn Maxwell and Marcus Stoinis are back in the mix, whereas Ashton Agar misses out despite a strong BBL 11 campaign. Australia vs Sri Lanka T20Is: Josh Inglis to debut Ahead of the game, Finch confirmed that Matthew Wade will don the gloves. Wade will bat at the lower order, whereas Josh Inglis will play as a batter. He also confirmed that Ben McDermott will open alongside him in the game. “Wadey’s the keeper, he did a fantastic job throughout the World Cup,” Finch said. “We see that being his role, really nailing down that No.7 role going forward.” “Ben McDermott has been in unbelievable nick so to get him at the top of the order was really crucial for us” BREAKING: Australian captain Aaron Finch confirms that Josh Inglis will make his international debut on Friday, and will bat at No. 3 in the first T20 against Sri Lanka at the SCG.#AUSvSL — Nic Savage (@nic_savage1) February 10, 2022 Aaron Finch had a lot of praise for the debutant Josh Inglis. He said that Inglis was brilliant with the group in the World Cup and has been consistent. “Inglis has been someone who has been shuffled around the order a little bit,” Finch added. “(His selection) is a sign of how well he’s played over the last couple of years, but also how great he was around the group at the T20 World Cup.” “He hasn’t got the runs he would have liked throughout the Big Bash as he has done in the past. But he was playing slightly different roles. So it’s a great opportunity for him.” Australia Playing XI: Aaron Finch, Ben McDermott, Josh Inglis, Steve Smith, Glenn Maxwell, Marcus Stoinis, Matthew Wade, Pat Cummins, Mitchell Starc, Josh Hazlewood, Adam Zampa. The post “Josh Inglis’ selection is a sign of how well he’s played over the last couple of years”: Aaron Finch confirms Josh Inglis will make his debut in Australia vs Sri Lanka first T20I appeared first on The SportsRush.","pubDate":"2022-02-10 03:01:48","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dhull in Delhi Ranji squad, Ishant opts out","link":"https://www.tribuneindia.com/news/sports/dhull-in-delhi-ranji-squad-ishant-opts-out-368660","keywords":null,"creator":null,"video_url":null,"description":"New delhi: Yash Dhull, the captain of India's victorious U-19 World Cup squad, was today included in the Delhi side for the Ranji Trophy, beginning February 17, while senior India pacer Ishant Sharma has made himself unavailable for selection. \"His confidence his high and even though he hasn't played a lot of red-ball matches, we want him to get a taste of First-Class cricket,\" a selector said.","content":null,"pubDate":"2022-02-10 02:32:35","full_description":"PTI New delhi: Yash Dhull, the captain of India’s victorious U-19 World Cup squad, was today included in the Delhi side for the Ranji Trophy, beginning February 17, while senior India pacer Ishant Sharma has made himself unavailable for selection. “His confidence his high and even though he hasn’t played a lot of red-ball matches, we want him to get a taste of First-Class cricket,” a selector said.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_568357149.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Series killers","link":"https://www.tribuneindia.com/news/sports/series-killers-368663","keywords":null,"creator":null,"video_url":null,"description":"Ahmedabad, February 9India clinched a series win over West Indies after pacer Prasidh Krishna tore through the tourists' top- order today, taking four wickets to lead India to a 44-run victory in the second One-day International.Building on their six-wicket win Sunday over West Indies in the opening ODI on Sunday, India defended a modest total of 237/9 to take an unassailable 2-0 lead in the three-match series.Asked to bat, India set West Indies a target of 238, with Suryakumar Yadav top scoring for the hosts with 64 runs from 83 balls.Yadav put together a 90-run stand with KL Rahul (49), which came to an end when a mix-up between the batters led to Rahul being run out.For the West Indies, Alzarri Joseph and Odean Smith took two wickets apiece, with captain Kieron Pollard missing out on the match due to a \"niggle\".\"There were some challenges. The partnership between Rahul and Surya had a lot of maturity,\" said skipper Rohit Sharma. \"We got to a respectable total in the end. We knew we could fight it out. The entire unit came out and bowled superbly.\"West Indies were jolted early in their reply after Krishna (4/12) dismissed opener Brandon King and Darren Bravo in successive overs, before getting the wicket of Nicholas Pooran (9) in the 20th over.Shamarh Brooks (44) provided some resistance before he became Deepak Hooda's first wicket in international cricket, missing out on his fifty when he holed out to long on.Smith then provided the West Indies a glimmer of hope towards the end of the innings with a knock of 24, which included a couple of sixes, but West Indies were eventually bowled out for 193 inside 46 overs. —","content":null,"pubDate":"2022-02-10 02:32:01","full_description":"PTI Ahmedabad, February 9 India clinched a series win over West Indies after pacer Prasidh Krishna tore through the tourists’ top- order today, taking four wickets to lead India to a 44-run victory in the second One-day International. Building on their six-wicket win Sunday over West Indies in the opening ODI on Sunday, India defended a modest total of 237/9 to take an unassailable 2-0 lead in the three-match series. Asked to bat, India set West Indies a target of 238, with Suryakumar Yadav top scoring for the hosts with 64 runs from 83 balls. Yadav put together a 90-run stand with KL Rahul (49), which came to an end when a mix-up between the batters led to Rahul being run out. For the West Indies, Alzarri Joseph and Odean Smith took two wickets apiece, with captain Kieron Pollard missing out on the match due to a “niggle”. “There were some challenges. The partnership between Rahul and Surya had a lot of maturity,” said skipper Rohit Sharma. “We got to a respectable total in the end. We knew we could fight it out. The entire unit came out and bowled superbly.” West Indies were jolted early in their reply after Krishna (4/12) dismissed opener Brandon King and Darren Bravo in successive overs, before getting the wicket of Nicholas Pooran (9) in the 20th over. Shamarh Brooks (44) provided some resistance before he became Deepak Hooda’s first wicket in international cricket, missing out on his fifty when he holed out to long on. Smith then provided the West Indies a glimmer of hope towards the end of the innings with a knock of 24, which included a couple of sixes, but West Indies were eventually bowled out for 193 inside 46 overs. —","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_1968744376.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"How Pat Cummins set Aussie legends straight","link":"https://www.cairnspost.com.au/sport/cricket/how-pat-cummins-set-aussie-legends-straight-in-justin-langer-affair/news-story/1581b4649affa9c623637506be03afc7","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"There were no winners from Justin Langer’s messy divorce with Cricket Australia — it was a trainwreck that left everyone looking worse off, with one possible exception.","content":null,"pubDate":"2022-02-10 01:29:00","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Pat Cummins stands tall amid mess of Justin Langer's axing by Cricket Australia - Wide World of Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3d3b3MubmluZS5jb20uYXUvY3JpY2tldC9qdXN0aW4tbGFuZ2VyLWF4aW5nLXBhdC1jdW1taW5zLWF1c3RyYWxpYW4tY2FwdGFpbi1yaWdodC1tYW4tZm9yLXRoZS1qb2IvYWMwNzU3ZGItYmQzZi00NGI4LTk3YmItZTE0N2I2NDc2Yzg10gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pat Cummins stands tall amid mess of Justin Langer's axing by Cricket Australia  Wide World of SportsPat Cummins thanks Justin Langer for his time as Australia's head coach, but says team needs 'new style'  ABC NewsAnother perfect delivery from Cummins, but this is what he was really saying  Sydney Morning HeraldStrauss considering JL for England job  Fox Sports‘Players love him’: Big rally for Langer’s replacement  NEWS.com.auView Full coverage on Google News","content":null,"pubDate":"2022-02-10 01:15:17","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Strauss considering Langer for England job","link":"https://www.cairnspost.com.au/sport/cricket/strauss-considering-langer-for-england-job/video/7e9e2af5074804c9e89b6355b5d28060","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: England's interim cricket chief Andrew Strauss hasn't ruled out Justin Langer from contention for the vacant coaching role.","content":null,"pubDate":"2022-02-10 01:04:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"PCB extends Saqlain's tenure for another year","link":"https://www.thenews.com.pk/print/932228-pcb-extends-saqlain-s-tenure-for-another-year","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Pakistan Cricket Board has extended Saqlain Mushtaq’s tenure for another year, clarifying that he never resigned from the post.At the same time, former Australian Test speedster Shaun Tait has been hired as a bowling coach.“Saqlain has never resigned nor have we issued...","content":null,"pubDate":"2022-02-10 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pakistan blind cricket team announced for SA series","link":"https://www.thenews.com.pk/print/932231-pakistan-blind-cricket-team-announced-for-sa-series","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: The Pakistan Blind Cricket Council has announced 15 players of the national team and officials for the ODI series between Pakistan and South Africa.Nisar Ali will be the captain and Zafar Iqbal vice-captain for the three-match series to be played in Karachi from February 28 to March...","content":null,"pubDate":"2022-02-10 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Australia's T20I tour of New Zealand abandoned","link":"https://www.thenews.com.pk/print/932222-australia-s-t20i-tour-of-new-zealand-abandoned","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE: Australia’s three-match T20I tour of New Zealand in March has been abandoned after there were no managed isolation quarantine spots available for the Australian team.New Zealand Cricket and Cricket Australia have agreed to abandon the series scheduled to be played over four days...","content":null,"pubDate":"2022-02-10 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Prince steps down as BD batting coach","link":"https://www.thenews.com.pk/print/932239-prince-steps-down-as-bd-batting-coach","keywords":null,"creator":null,"video_url":null,"description":"DHAKA: Former South African batsman Ashwell Prince stepped down as the batting coach of the Bangladesh national cricket team Wednesday, the country’s cricket authorities said.“We have received the resignation letter from Prince today through an email. His resignation has been...","content":null,"pubDate":"2022-02-10 01:00:00","full_description":"DHAKA: Former South African batsman Ashwell Prince stepped down as the batting coach of the Bangladesh national cricket team Wednesday, the country’s cricket authorities said. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ “We have received the resignation letter from Prince today through an email. His resignation has been accepted,” Bangladesh Cricket Board chief executive officer Nizamuddin Chowdhury told AFP. Nizamuddin said Prince cited personal reasons for his resignation. His departure coincided with the appointment of former head coach Jamie Siddons as the side’s batting consultant. Australian Siddons, who coached Bangladesh from 2008 to 2011, took up the role on a two-year contract earlier this month. Prince was appointed as full-time batting consultant of Bangladesh in August last year until the 2022 Twenty20 World Cup, after working with the side during a series against Zimbabwe. The 44-year old left-hander was capped 119 times by South Africa across all three formats. In their next series Bangladesh will host Afghanistan this month and next for three one-day internationals and Twenty20 internationals.","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"PCB extends Saqlain's tenure for another year","link":"https://www.thenews.com.pk/print/932228-pcb-extends-saqlain-s-tenure-for-another-year","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Pakistan Cricket Board has extended Saqlain Mushtaq’s tenure for another year, clarifying that he never resigned from the post.At the same time, former Australian Test speedster Shaun Tait has been hired as a bowling coach.“Saqlain has never resigned nor have we issued...","content":null,"pubDate":"2022-02-10 01:00:00","full_description":null,"image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Anderson and Broad ‘very disappointed’ by shock axe... but Test careers are STILL not over","link":"https://www.foxsports.com.au/cricket/cricket-news-2022-england-vs-west-indies-test-tour-james-anderson-and-stuart-broad-andrew-strauss-reveals-reason-for-axe/news-story/ab25b3758d62d5af0c4cc7a28777e739","keywords":null,"creator":null,"video_url":null,"description":"Andrew Strauss says he is adamant that James Anderson and Stuart Broad still have a future in Test cricket after England’s two most successful Test bowlers were left out of next month’s tour of the West Indies.","content":null,"pubDate":"2022-02-09 22:01:00","full_description":"Andrew Strauss says he is adamant that James Anderson and Stuart Broad still have a future in Test cricket after England’s two most successful Test bowlers were left out of next month’s tour of the West Indies. The pacemen were omitted from a 16-man squad announced on Tuesday for a three-match series in the Caribbean despite boasting 1,177 Test wickets between them as England seek to bounce back from their Ashes debacle. “They were both very disappointed and that doesn’t surprise me,” England and Wales Cricket Board interim managing director Strauss told Sky Sports. Watch The Dettol T20 Series Australia vs Sri Lanka. Every Game Live & On-Demand on Kayo. New to Kayo? Start your free trial now > NEW FOX CRICKET PODCAST - Shane Warne: ‘What is Cricket Australia doing!?’ Listen below or subscribe in iTunes or Spotify “They’re both very passionate about playing for England. I hope that they understand the rationale for the decision and also they understand that no one is saying this is the end of the road for either of them. “Their job right at the moment is to get themselves fired up to go for the start of the international summer in June.” Anderson, who has 640 Test wickets, and fellow pace bowler Broad, who has 537 scalps, are among eight players axed from the squad that suffered a humiliating 4-0 Ashes series loss in Australia. Strauss has also presided over the departures of managing director Ashley Giles, head coach Chris Silverwood and batting coach Graham Thorpe in a shake-up of England’s backroom staff. There have long been suggestions the 39-year-old Anderson and 35-year-old Broad have held too much sway over England captain Joe Root, who is continuing in his post despite the Ashes defeat. But Strauss, who captained successful England sides featuring Anderson and Broad, said: “This is more about us finding a bowling resource that’s capable of winning away from home and obviously you need a lot of variety in your attack to do that, that’s blatantly obvious.” Although England have won just one Test series in the Caribbean in 54 years, Strauss justified the decision to omit the outstanding new-ball pair by saying it was a chance to see other bowlers perform. READ MORE ‘One heck of a payoff line’: Pat digs in with defiant final word on JL exit — Read statement in FULL ‘More calm, composed’: Cummins reveals why Langer had to go as Aussie coach Cummins hits back at ex-players, ‘absolutely disagrees’ with Johnson’s ‘gutless’ whack Pat fires back 'I can hang my head high' | 00:19 - England ‘reset’ - “It’s the start of a new cycle and is a refresh and a reset and that dressing room will feel very different without Broad and Anderson in it,” he said. “But I wouldn’t in any way want people to think Broad and Anderson aren’t thoroughly professional in everything they do in an England shirt. “That’s why they’ve been as successful as they have been in England colours and they still have a lot to offer, both on and off the field.” England did not once manage a total of 300 in the five-match Ashes series, with Strauss revealing star batsman Root had asked to move up to number three in a bid to shore up the faltering top order. “That was his request and I think everyone agreed that was probably a healthy thing for the England team at the moment,” said Strauss. With Rory Burns and Haseeb Hameed both axed, Durham batsman Alex Lees is set to be given a run facing the new ball. “Our issues have been at the top of the order so we’re going to see a new opening partnership out there with Alex Lees coming in,” said Strauss. “Joe’s stepping up to three gives a bit of space in the middle order for some of those less experienced players to show what they can do.”","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"India claim ODI series win over West Indies with a game to spare","link":"https://www.cairnspost.com.au/sport/cricket/india-claim-odi-series-win-over-west-indies-with-a-game-to-spare/video/ed0a25e1c4bb6e3fcdb9b318d9fb101f","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: A superb four wicket performance from Prasidh Krishna has seen India cruise to a 44-run victory in their second ODI against the West Indies.","content":null,"pubDate":"2022-02-09 21:52:09","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"TAR vs CAG Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Gibraltar T10, Final","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/tar-vs-cag-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-gibraltar-t10-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-09 19:11:54","full_description":"Tarik will take on the Calpe Giants in the final of the European Cricket T10 Gibraltar 2022 on Thursday, February 10, at the Europa Sports Complex. Tarik have had a great run in the tournament, finishing in top spot with six wins in eight game. In their last league outing, they beat Bavaria comfortably by eight wickets to qualify for the final. Meanwhile, the Calpe Giants made their way to the final after finishing second, with five wins in eight games. After winning five consecutive games, they suffered a 40-run defeat in their last encounter against the Sloggers. Shaun Ainsworth, Marc Gouws, Michael Kelly, Amit Malhotra, Sebastian Maynard,Maanav Nayak, Sameer Nayak, Avinash Pai(c)(wk), Harshdeep Singh, Sukhjit Singh, James Templeton. Dave Barley, Gareth Bunday, Matthew Clenahan, Paul Edgeller (C), Jack Horrocks, Sam Houghton, David Jacobs (wk), Joseph Marples, Thomas Orton, David Robeson, Lee Sims. Match: Tarik vs Calpe Giants, Final. Date and Time: Thursday, February 10, 12:00 AM IST. Venue: Europa Sports Complex. The wicket at the Europa Sports Complex has been ideal for batting. Teams have racked up scores of above 100 with ease on this surface. The team winning the toss will most likely opt to bat first. Avinash Pai: Pai has led Tarik from the front with the bat. He has managed to score 190 runs in eight games while also grabbing a solitary wicket. Joseph Marples: Marples hasn’t had much success with the bat, but has been decent with the ball. In seven games, he has picked up five wickets. Sameer Nayak: Nayak has made valuable contributions with the bat. He has scored 151 runs in six games. Paul Edgeller: Edgeller is the leading run-getter for the Calpe Giants. In eight games, he has scored 167 runs while also taking four wickets. Marc Gows: Gows has performed extremely well in both departments. He has scored 196 runs in seven outings, and has also taken three wickets. Michael Kelly: Kelly has been a consistent wicket-taker for Tarik. He has picked seven wickets in six outings so far in the tournament. Jack Horrocks: Horrocks hasn’t had much game time this season. However, he has takentwo wickets in three outings. Paul Edgeller: 416 points Marc Gows: 409 points Avinash Pai: 378 points Sameer Nayak: 340 points Michael Kelly: 277 points Paul Edgeller: 8 matches, 167 runs, 4 wickets Marc Gows: 7 matches, 196 runs, 3 wickets Avinash Pai: 8 matches, 190 runs, 1 wicket Sameer Nayak: 6 matches, 151 runs, 1 wicket Michael Kelly: 6 matches, 7 wickets Fantasy Suggestion #1: Avinash Pai, Joseph Marples, Sameer Nayak, Paul Edgeller, Marc Gows, Michael Kelly, Jack Horrocks, San Houghton, David Robeson, Amit Malhotra, Lee Sims Captain: Paul Edgeller Vice-Captain: Michael Kelly Fantasy Suggestion #2: Avinash Pai, Joseph Marples, Sameer Nayak, Paul Edgeller, Marc Gows, Michael Kelly, Jack Horrocks, Matthew Clenahan, Sukhjeet Singh, Maanav Nayak, Shaun Ainsworth Captain: Avinash Pai Vice-Captain: Marc Gows","image_url":"https://static.sportskeeda.com/editor/2022/02/cc82c-16444309228623-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"“The England squad for the West Indies tour!”: Kevin Pietersen laughs-off at England Test squad for series vs West Indies","link":"https://thesportsrush.com/cricket-news-the-england-squad-for-the-west-indies-tour-kevin-pietersen-laughs-off-at-england-test-squad-for-series-vs-west-indies/","keywords":["Cricket","England","kevin pietersen"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen laughs-off at England Test squad after ECB drop James Anderson and Stuart Broad for the tour of West Indies. The England and Wales Cricket Board (ECB) have taken some tough measures ever since their team’s 0-4 drubbing against the Australian side last month. While the board sacked key position holders in the coaching… The post “The England squad for the West Indies tour!”: Kevin Pietersen laughs-off at England Test squad for series vs West Indies appeared first on The SportsRush.","content":"Kevin Pietersen laughs-off at England Test squad after ECB drop James Anderson and Stuart Broad for the tour of West Indies. The England and Wales Cricket Board (ECB) have taken some tough measures ever since their team’s 0-4 drubbing against the Australian side last month. While the board sacked key position holders in the coaching staff, including head coach Chris Silverwood a few days ago, they have now dropped as many as eight players who recently played during the 5-match Ashes series, from the Test squad for the upcoming 3-match series against West Indies, scheduled to commence from March 8. The surprise omissions include the experienced fast bowling duo of James Anderson and Stuart Broad. ALSO READ: Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion Kevin Pietersen laughs-off at England Test squad Former England skipper Kevin Pietersen post the 16-member England Test squad announcement, took to his social media handle to perhaps ridicule the selection panel which also comprised the newly-appointed interim director-Andrew Strauss. The England squad for the West Indies tour — Kevin Pietersen (@KP24) February 9, 2022 It is worth mentioning that, Pietersen has, on a consistent basis taken potshots at his former skipper, ever since he has been handed the aforementioned post of responsibility. The 41-year-old had also criticized Strauss a few days ago for suggesting Justin Langer’s name as one of the suited alternatives for England’s head coach post. Moreover, Pietersen has, ever since England’s loss at the MCG against Australia last year, kept on reiterating his proposal of revamping England’s County Championship structure, which (as per him) is doing nothing but promoting mediocre players and mediocre Cricket. A few days ago, the former England batter had also come up with a list of 7 batters who should be handed the next 10 Tests to play for England. The list was suggestive of a batting order which might do wonders for the team in the upcoming series. It included Mark Stoneman and Zak Crawley as the opening batters, and also the likes of Yorkshire’s Harry Brook, and present White-ball sensation Liam Livingstone. Stoneman Crawley Root Brook Bairstow Livingstone Stokes Give that top 7 in that batting order the next 10 Test matches… — Kevin Pietersen (@KP24) February 6, 2022 For more Cricket-related news, click here. The post “The England squad for the West Indies tour!”: Kevin Pietersen laughs-off at England Test squad for series vs West Indies appeared first on The SportsRush.","pubDate":"2022-02-09 18:44:53","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Dhull named in Delhi Ranji squad, Ishant makes himself unavailable for selection","link":"https://www.thehansindia.com/sports/cricket/dhull-named-in-delhi-ranji-squad-ishant-makes-himself-unavailable-for-selection-728543","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Yash Dhull, the captain of India's victorious U-19 World Cup squad, was on Wednesday included in the Delhi side for the Ranji Trophy, beginning February 17, while senior India pacer Ishant Sharma has made himself unavailable for selection.","content":"New Delhi: Yash Dhull, the captain of India's victorious U-19 World Cup squad, was on Wednesday included in the Delhi side for the Ranji Trophy, beginning February 17, while senior India pacer Ishant Sharma has made himself unavailable for selection.The Dhull-led India U-19 side was felicitated by BCCI in Ahmedabad on Wednesday during the second ODI against West Indies. Since he could not play the domestic red-ball tournament at U-19 level due to his white ball commitments with the Indian team, Dhull will get taste of red cherry at the much tougher first-class level. \"His confidence his high and even though he hasn't played a lot of red ball matches, we want him to get a taste of first class cricket,\" a selector told PTI. With his future uncertain in the Indian team, veteran pacer Ishant has communicated to DDCA president Rohan Jaitley that he is not available for selection for the state team. Left-arm pacer Pradeep Sangwan will captain the side. Dhull has not had any time to rest after the triumph in the Caribbean last week. Dhull, who with the rest of the team landed in India on Tuesday morning, will make a quick visit to his hometown Delhi on Thursday morning before joining the squad in Guwahati later in the day. Squad: Pradeep Sangwan, Nitish Rana, Dhruv Shorey , Priyansh Arya , Yash Dhull, Khsitij Sharma, Jonty Sidhu, Himmat Singh, Lalit Yadav , Anuj Rawat Wk, Lakshay Thareja wk, Navdeep Saini, Simarjit Singh , Mayank Yadav, Kuldeep Yadav, Vikas Mishra, Shivang Vashist, Shivam Sharma. COVID reserves: Dev Lakra, Hrithik Shokeen.","pubDate":"2022-02-09 18:01:16","full_description":null,"image_url":"https://assets.thehansindia.com/h-upload/2022/02/09/500x300_1254493-yash-dhull.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Three key inclusions for Albany and Districts in all or nothing Country Cup clash with Bunbury","link":"https://thewest.com.au/news/albany-advertiser/three-key-inclusions-for-albany-and-districts-in-all-or-nothing-country-cup-clash-with-bunbury-c-5620643","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The Whalers will travel to Harvey to take on country cricket powerhouse Bunbury and Districts Cricket Association in round three of the 50-over white ball, four team competition.","content":null,"pubDate":"2022-02-09 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5620643/ca4317fc3dc405a6f530cb3ca921a60b933eb3e6-16x9-x0y189w3641h2048.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mt Barker jump to third on the Albany and Districts Junior Cricket Association under-14s ladder with tense win","link":"https://thewest.com.au/news/albany-advertiser/mt-barker-jump-to-third-on-the-albany-and-districts-junior-cricket-association-under-14s-ladder-with-tense-win-c-5629213","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The Bulls have leapfrogged the Blues into third place on the back of their one-wicket victory in round 10.","content":null,"pubDate":"2022-02-09 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5629213/291a367cbbbfc1cf12c159074f3c36dc79c21ed7-16x9-x0y179w4482h2521.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Leeming Spartan Cricket Club’s top team tests negative to COVID-19 after isolation","link":"https://www.perthnow.com.au/local-news/perthnow-melville/leeming-spartan-cricket-clubs-top-team-tests-negative-to-covid-19-after-isolation-c-5563950","keywords":null,"creator":["Kristie Lim"],"video_url":null,"description":"The top order at Leeming Spartan Cricket Club are back after being put into a 14-day quarantine period due to a player testing positive last month.","content":null,"pubDate":"2022-02-09 18:00:00","full_description":"Players from Leeming Spartan Cricket Club’s top team have tested negative to COVID-19 following 14 days in quarantine brought on after a teammate contracted the virus last month. One of the club’s One-Day A (ODA) players developed symptoms on January 23. President Peter Coombs said the club discovered the player had came into contact with the virus two days earlier. “As a result, at lunchtime on January 25, the Health Department ordered that all 11 players who played in the ODA team on January 22 commence a 14 (day quarantine),” he said. After isolating for two weeks, the club confirmed all players had tested negative on their second test while the player with the virus had recovered. “All other testing done by other players and families have also proved to be negative,” Mr Coombs said. “The support, thoughts and well wishes shown from not only within the Spartan cricket family but the wider cricket community has been overwhelming, with one opposition captain and his wife offering to make meals for the 11 players that are under lockdown along with the club committee delivering support packages to their homes.” Mr Coombs said it was pleasing to see players immediately engage, undergo testing, and forwarding their COVID-19 vaccinations and boosters. “Our club certainly dodged a bullet as far as a full lockdown, but please be mindful that the COVID-19 issue is alive and well, and we need to be very diligent, wear masks as instructed, have vaccination certificates at hand and if you feel the symptoms, please get tested,” he said.","image_url":"https://images.perthnow.com.au/publication/C-5563950/4077dfcb77eadcfe095f4d55154e2fbe16dfcac2-16x9-x0y143w2756h1550.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Three key inclusions for Albany and Districts in all or nothing Country Cup clash with Bunbury","link":"https://thewest.com.au/news/albany-advertiser/three-key-inclusions-for-albany-and-districts-in-all-or-nothing-country-cup-clash-with-bunbury-c-5620643","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The Whalers will travel to Harvey to take on country cricket powerhouse Bunbury and Districts Cricket Association in round three of the 50-over white ball, four team competition.","content":null,"pubDate":"2022-02-09 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5620643/ca4317fc3dc405a6f530cb3ca921a60b933eb3e6-16x9-x0y189w3641h2048.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Winning streak continues for Broomehill as they stitch up top spot in Great Southern Cricket Association","link":"https://thewest.com.au/news/great-southern-herald/winning-streak-continues-for-broomehill-as-they-stitch-up-top-spot-in-great-southern-cricket-association-c-5599121","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"They recorded their 10th straight win to remain undefeated, prevailing by six wickets on their home deck on Saturday.","content":null,"pubDate":"2022-02-09 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5599121/8cb35d2977e2d0202fc9b36d2f79aea2fcd7b7a1-16x9-x0y270w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Odean Smith: Need to be consistent when playing ODIs","link":"https://sportstar.thehindu.com/cricket/ind-vs-wi-2nd-odi-india-west-indies-odean-smith-press-conference-ahmedabad/article38403899.ece","keywords":null,"creator":["Shayan Acharya"],"video_url":null,"description":"Odean Smith considers all-rounder Andre Russell as a role model since they both play “similar kind of cricket”.","content":null,"pubDate":"2022-02-09 17:25:26","full_description":null,"image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs WI: Rohit Sharma Reveals Why Rishabh Pant Opened Along With Him In 2nd ODI - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vd2VzdC1pbmRpZXMtdG91ci1vZi1pbmRpYS0yMDIyL3JvaGl0LXNoYXJtYS1yZXZlYWxzLXdoeS1yaXNoYWJoLXBhbnQtb3BlbmVkLWFsb25nLXdpdGgtaGltLWluLXRoZS0ybmQtb2RpL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs WI: Rohit Sharma Reveals Why Rishabh Pant Opened Along With Him In 2nd ODI  Cricket AddictorPant experiment doesn’t come off, but step in right direction  The Indian ExpressIND vs WI 2022 | Twitter reacts as Rohit Sharma gets DRS right to dismiss Darren Bravo  SportsCafeIND vs WI: Here's Why Rishabh Pant Is Opening With Rohit Sharma For India vs West In The 2nd ODI  Cricket AddictorRishabh Pant was one-off experiment not permanent solution: Rohit Sharma  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-02-09 17:13:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“Not a permanent thing”: Rohit Sharma confirms Shikhar Dhawan will replace Rishabh Pant as his opening partner in 3rd ODI","link":"https://thesportsrush.com/cricket-news-not-a-permanent-thing-rohit-sharma-confirms-shikhar-dhawan-will-replace-rishabh-pant-as-his-opening-partner-in-3rd-odi/","keywords":["Cricket","India Cricket Team","India","rishabh pant","Rohit Sharma","Shikhar Dhawan","West Indies","West Indies tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Shikhar Dhawan will replace Rishabh Pant: The Indian captain talked about their unique opening combination in the second ODI. India white-ball captain Rohit Sharma has commenced his full-time captaincy career with a series victory against West Indies. India pulling off a 44-run victory in the second ODI at the Narendra Modi Stadium has gained them… The post “Not a permanent thing”: Rohit Sharma confirms Shikhar Dhawan will replace Rishabh Pant as his opening partner in 3rd ODI appeared first on The SportsRush.","content":"Shikhar Dhawan will replace Rishabh Pant: The Indian captain talked about their unique opening combination in the second ODI. India white-ball captain Rohit Sharma has commenced his full-time captaincy career with a series victory against West Indies. India pulling off a 44-run victory in the second ODI at the Narendra Modi Stadium has gained them an unassailable 2-0 lead in this three-match series. The fact that India won the second ODI despite scoring 237/9 after being asked to bat by West Indies stand-in captain Nicholas Pooran speaks highly about their comeback in the second innings on Wednesday. “Obviously, winning the series is a good feeling. There were some challenges. The [91-run] partnership between [Lokesh] Rahul and Surya [Suryakumar Yadav] had a lot of maturity. We got to a respectable total in the end. We knew we could fight it out. The entire unit came out and bowled superbly,” Sharma told Star Sports during the post-match presentation ceremony. Sharma, who lauded his bowlers in general for bundling out the opposition for 193 in 46 overs, was wax lyrical about fast bowler Prasidh Krishna in particular. Playing his sixth ODI, Krishna picked career-best bowling figures of 9-3-12-4 to be declared Man of the Match for the first time in international cricket. “I have never seen a spell like that in India for a long time now. Bowled with a lot of pace and kept it going. The others complimented him [Prasidh Krishna]. When you have five bowlers and Deepak [Hooda] being sixth, you always need to keep rotating the bowlers,” Sharma added. Rohit Sharma confirms that Shikhar Dhawan will replace Rishabh Pant as his opening partner India’s solitary change for this match lied in including vice-captain Lokesh Rahul for batter Ishan Kishan. When a lot of fans and experts were left dejected with the prospect of India opening the batting with Rahul yet again, India sent wicket-keeper batter Rishabh Pant (18) to partner Sharma at the top of the order. Pant, who mis-timed a pull off Odean Smith in the 12th over, might not have justified his promotion but the move came as an intriguing one for fans. Not wanting to give false hopes, Sharma was quick clarify that opening the batting with Pant was just a one-off thing especially with veteran batter Shikhar Dhawan set to return in the third ODI after recovering from COVID-19. “I have been asked to try different things, so that [opening with Rishabh Pant] was something different [laughs]. We wanted to try it one game and is not a permanent thing. Shikhar [Dhawan] should be back for the next game,” Sharma mentioned. pic.twitter.com/ETwIrPcAdZ — Shikhar Dhawan (@SDhawan25) February 9, 2022 Having already won the series, India would be keen to provide more opportunities to reserve players in the last match of the series on February 11 at the same venue. The post “Not a permanent thing”: Rohit Sharma confirms Shikhar Dhawan will replace Rishabh Pant as his opening partner in 3rd ODI appeared first on The SportsRush.","pubDate":"2022-02-09 16:58:48","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs WI 2nd ODI Man of the Match: Who was awarded Man of the Match in India vs West Indies Ahmedabad ODI today?","link":"https://thesportsrush.com/cricket-news-ind-vs-wi-2nd-odi-man-of-the-match-who-was-awarded-man-of-the-match-in-india-vs-west-indies-ahmedabad-odi-today/","keywords":["Cricket","India","West Indies","West Indies tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs WI 2nd ODI Man of the Match: The Indian fast bowler won his maiden match award at the Narendra Modi Stadium tonight. During the second ODI of the ongoing West Indies’ tour of India in Ahmedabad, India beat West Indies by 44 runs to gain an unassailable 2-0 lead in a three-match series.… The post IND vs WI 2nd ODI Man of the Match: Who was awarded Man of the Match in India vs West Indies Ahmedabad ODI today? appeared first on The SportsRush.","content":"IND vs WI 2nd ODI Man of the Match: The Indian fast bowler won his maiden match award at the Narendra Modi Stadium tonight. During the second ODI of the ongoing West Indies’ tour of India in Ahmedabad, India beat West Indies by 44 runs to gain an unassailable 2-0 lead in a three-match series. Asked to bat first by West Indies stand-in captain Nicholas Pooran (9), India scored a mediocre 237/9 in 50 overs. While a top-order failure was rescued by a 91-run partnership for the fourth wicket between vice-captain Lokesh Rahul (49) and batter Suryakumar Yadav (64), lack of boundaries in the third powerplay didn’t let the hosts put on board a dominating total. Playing only his sixth ODI, Yadav played a career-best innings comprising of five fours. With 67 deliveries remaining when he was dismissed, Yadav would be keen to finish the innings for India in the near future. Playing his first overseas ODI, West Indies all-rounder Odean Smith was the pick of their bowlers on the back of bowling figures of 7-0-29-2. In addition to Smith, West Indies fast bowler Alzarri Joseph also picked a couple of wickets to impress former India spinner Harbhajan Singh in particular. IND vs WI 2nd ODI Man of the Match Also playing his sixth ODI, India fast bowler Prasidh Krishna picked career-best bowling figures of 9-3-12-4. Figures which are rarely found in even Test cricket these days, Krishna’s match-winning performance played a crucial role behind dismissing West Indies for 193 in 46 overs. Bowling first change in the first over unlike the first ODI at the same venue, all it took Krishna to make early inroads into the West Indian batting lineup was three deliveries. Within his first seven deliveries, Krishna had sent back Brandon King (18) and Darren Bravo (1) to the pavilion to hand an early advantage to the team. Krishna’s first spell of 4-2-3-2 was followed by him dismissing Pooran on just the fourth delivery of the second spell. While credit also goes to India captain Rohit Sharma for his exceptional rotation of bowlers, Krishna’s wise use saw him closing the match by picking his fourth wicket in the form of Kemar Roach (0). Bharat Arun, former India bowling coach, in a recent chat had rated Prasidh Krishna highly, saying he has the mental fortitude, pace and heart to bowl fast. Krishna showing his skills now. — Ayan (@ayan_acharya13) February 9, 2022 “I have been striving hard to do this for a long time. So, I am very happy that we won. I was still looking to hit the good areas. When I came in to bat, I knew it was still seaming. Experimenting wasn’t possible as there was not much to defend. So, I stuck to good lines. I want to be as consistent as possible,” Krishna told Star Sports after winning his maiden Man of the Match award in international cricket. The post IND vs WI 2nd ODI Man of the Match: Who was awarded Man of the Match in India vs West Indies Ahmedabad ODI today? appeared first on The SportsRush.","pubDate":"2022-02-09 16:27:04","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs West Indies Live Score Ball by Ball, India vs West Indies 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-west-indies-live-score-over-2nd-odi-odi-46-50-updates-2759228","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between India vs West Indies from Narendra Modi Stadium, Ahmedabad. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-02-09 16:03:55","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 46.0 overs, West Indies, chasing a target of 238, are 193. The live updates of India vs West Indies scorecard is also available. It is the perfect platform to follow your favourite teams in India vs West Indies 2022. Keep a track on your favourite batsmen and bowlers through India vs West Indies 2022 today match, ball by ball commentary, India vs West Indies, India vs West Indies live score, India vs West Indies scorecard. Follow the excitement of the India vs West Indies 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. Nicholas Pooran, the skipper of West Indies, says that they lost the game with the bat as they did not get any big partnerships. Adds that the more they play together, they will hopefully get better. He praises Odean Smith for his all-round show and says that with more experience, he will get better. Mentions that they want to do better with the bat in the final game and says that Kieron Pollard should be fine for the last match. First, a word with Shardul Thakur. The pacer says that if dew comes in then a partnership can build and the batters can take the game away. Adds that the pacers were bowling really well as there was assistance in the pitch. Adds that if they take wickets up front then the game gets away from the team that is chasing. Tells that they used short balls really well and it was in the plan and strategy to bowl like it. Stay tuned for the interviews. A good game for India in the field as all the bowlers did well. Washington Sundar was a bit expensive at the start but finished well by getting the big wicket of Odean Smith. The captaincy from Rohit Sharma was also quite good as he rotated the bowlers well. They kept giving him wickets at the right point and India were never really in big trouble. Rohit Sharma must be commended for the way he marshaled his troops and handled his bowling resources. Prasidh Krishna was the pick of the bowlers with his 4 wickets while the rest of the bowlers had a good game too. Shamarh Brooks did put on a 41-run stand with Akeal Hosein but when it was broken, the game looked done. But the stand between Fabian Allen and Akeal Hosein gave West Indies hope. The pair added 42 runs and there might have been a few nerves in the Indian camp when they were batting. Right then Mohammed Siraj took his first wicket to break the stand and Shardul Thakur got a wicket in the next over to send back both the set batters. Odean Smith then got a few boundaries and kept the chase alive but he never really looked very threatening and India had enough quality in their ranks to seal the game. West Indies needed a good start if they were to chase this down. The opening stand between Brandon King and Shai Hope looked good for a while before they were separated in the 8th over. After that, the middle order of West Indies put on another sorry show. It was only Shamarh Brooks who looked in good touch in the middle. The Indian bowlers were breathing fire with Prasidh Krishna striking thrice to rock the middle order of the West Indies. A victory for India and they have sealed the 3-match series! They did not have the biggest of totals but bowled really well to defend it. A sweet victory but it will be a tough loss for West Indies. They had done really well with the ball but could not back it up with the bat. 45.6 overs (0 Run) OUT! LBW! Prasidh Krishna gets the last wicket and India seal the series as they go 2-0 up. A length ball, straight on middle. Kemar Roach shuffles and looks to flick but misses and gets hit on the pads. An appeal and up goes the finger. India win by 44 runs. 45.5 overs (0 Run) A slower full ball, on middle. Blocked out. 45.4 overs (0 Run) Shorter, on the body. Kemar Roach looks to evade but gets hit on the arm. 45.3 overs (0 Run) Full, on off. Blocked back to the bowler. 45.2 overs (0 Run) On a length, on off. Roach works it to point. 45.1 overs (0 Run) Slower yorker, outside off. Blocked out.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637800392255173018.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh players IPL 2022 availability: Will Shakib Al Hasan and Mustafizur Rahman miss some part of IPL 2022?","link":"https://thesportsrush.com/cricket-news-bangladesh-players-ipl-2022-availability-will-shakib-al-hasan-and-mustafizur-rahman-miss-some-part-of-ipl-2022/","keywords":["Cricket","Bangladesh","Indian Premier League","IPL 2022","mustafizur rahman","Shakib Al Hasan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Bangladesh players IPL 2022 availability: There’s a possibility of leading Bangladeshi players missing a few IPL 2022 matches. Former captain Shakib Al Hasan, wicket-keeper batter Liton Das and fast bowling-trio of Mustafizur Rahman, Taskin Ahmed and Shoriful Islam are the five Bangladeshi players who have been shortlisted for Indian Premier League 2022 auction. While Shakib… The post Bangladesh players IPL 2022 availability: Will Shakib Al Hasan and Mustafizur Rahman miss some part of IPL 2022? appeared first on The SportsRush.","content":"Bangladesh players IPL 2022 availability: There’s a possibility of leading Bangladeshi players missing a few IPL 2022 matches. Former captain Shakib Al Hasan, wicket-keeper batter Liton Das and fast bowling-trio of Mustafizur Rahman, Taskin Ahmed and Shoriful Islam are the five Bangladeshi players who have been shortlisted for Indian Premier League 2022 auction. While Shakib (71 matches for Kolkata Knight Riders and Sunrisers Hyderabad) and Rahman (39 matches for Sunrisers Hyderabad, Mumbai Indians and Rajasthan Royals) have played in the IPL in the past, the remaining three players would be hoping for a maiden bid coming their way later this week. ALSO READ: Full list of players in IPL auction 2022 Currently playing the ongoing Bangladesh Premier League 2022, Shakib and Rahman are the highest wicket-takers at this point in time. Shakib and Islam are also present among Top 10 run-scorers and Top 10 wicket-takers respectively. Meanwhile, Das and Ahmed are yet to justify their potential this season. Bangladesh players IPL 2022 availability Assuming that Bangladeshi players find a buyer in the imminent mega auction, their availability for the whole season will be doubtful as Bangladesh are scheduled to tour South Africa for three ODIs and two Test matches between March 18 – April 11. Talking particularly about Shakib, he has ruled himself out of a two-match Test series against South Africa. The development means that Shakib will be available to join his IPL franchise (assuming he gets bought) after the third ODI in Centurion on March 23. “Shakib [Al Hasan] will certainly play the ODIs against South Africa and though he did not say anything regarding his availability for the Test series, he informed that he will be available for the two-match Test series against Sri Lanka,” BCB (Bangladesh Cricket Board) cricket operation chairman Jalal Yunus was quoted as saying by Cricbuzz. ALSO READ: How many IPL 2022 matches will Australian cricketers miss? Apart from the South Africa tour, Bangladesh are also slated to host Sri Lanka for a two-match Test series between May 8-23. With Shakib already confirming his availability for the same, IPL teams will have to keep that in mind before bidding for him. Despite his availability from the first week (assuming that IPL 2022 begins from March 27), Shakib will travel back for over two weeks during the business end of the tournament. Rahman, on the other hand, will be available to play in the IPL after the ODI series in South Africa as he rarely plays Test cricket. However, multi-format players namely Das, Ahmed and Islam’s chances of making an IPL debut could be hindered due to their very limited availability. The post Bangladesh players IPL 2022 availability: Will Shakib Al Hasan and Mustafizur Rahman miss some part of IPL 2022? appeared first on The SportsRush.","pubDate":"2022-02-09 16:01:51","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“I think they deserve better”: Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion from England Test squad for West Indies tour","link":"https://thesportsrush.com/cricket-news-i-think-they-deserve-better-nasser-hussain-laments-over-james-anderson-and-stuart-broads-exclusion-from-england-test-squad-for-west-indies-tour/","keywords":["Cricket","England","James Anderson","Nasser Hussain","Stuart Broad"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion from England’s 16-member squad for West Indies tour. The England and Wales Cricket Board (ECB) have announced a 16-member England Test squad for the tour of West Indies set to commence from March 8. Taking strict measures, the board has dropped their experienced fast bowling… The post “I think they deserve better”: Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion from England Test squad for West Indies tour appeared first on The SportsRush.","content":"Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion from England’s 16-member squad for West Indies tour. The England and Wales Cricket Board (ECB) have announced a 16-member England Test squad for the tour of West Indies set to commence from March 8. Taking strict measures, the board has dropped their experienced fast bowling duo of James Anderson and Stuart Broad, who are part of the eight overall omitted players from England’s Ashes series squad, which they lost 0-4 Down Under. Speaking on the veteran duo’s exclusion from the squad, Andrew Strauss, England’s newly appointed interim head coach has explicably stated that their omission, by no means indicated the end of the road of their careers. “In respect of James Anderson and Stuart Broad, I want to emphasize this does not mean the end for them as England players. We feel that it is important to look at some exciting new bowling potential and give some added responsibility to other players who have featured previously”, Strauss stated. “No one doubts the quality and experience that James and Stuart bring to the England set-up. It will be up to the new managing director and permanent head coach to decide on whether they will be involved this summer and beyond,” he further added. Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion Meanwhile, former England skipper Naseer Hussain has expressed his disappointment on the same, exclaiming that he ‘really feels’ for the two veteran pacers given that they are nearing the peak of their respective careers, and a huge gap between series might not be suitable for their longevity. “It’s not easy at their age to suddenly have a massive gap (between series), and I really feel for Broad and Anderson. I think they deserved a little bit better. The toil, and the pain, the sweat, the hours at the gym, to get to where they are, to get back to fitness after carrying injuries; they know they’ve not got long left, they know it might be a matter of months, a year maybe, and they would want to play every Cricket possible to make sure that they are there right at the end of their careers saying ‘I got as much out of myself as I possibly could’. I hope this isn’t the end, because I think they deserve better,” remarked Hussain during an interaction with Sky Sports. “I hope this isn’t the end because I think they deserve better” Nasser Hussain gives his thoughts on Broad and Anderson being left out of the squad for the West Indies test pic.twitter.com/iAubMETtl4 — Sky Sports Cricket (@SkyCricket) February 9, 2022 England are scheduled to play a three-match Test series against the Windies beginning March 8. James Anderson, Stuart Broad, Haseeb Hameed, Dawid Malan, Jos Buttler are some of the notable omissions from the squad. England Test squad for WI tour: Joe Root (c), Jonathan Bairstow, Zak Crawley, Matthew Fisher, Ben Foakes, Dan Lawrence, Jack Leach, Alex Lees, Saqib Mahmood, Craig Overton, Matthew Parkinson, Ollie Pope, Ollie Robinson, Ben Stokes, Chris Woakes, Mark Wood. The post “I think they deserve better”: Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion from England Test squad for West Indies tour appeared first on The SportsRush.","pubDate":"2022-02-09 15:45:38","full_description":null,"image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}