{"newsArray":[{"title":"Highest successful run chase in T20 international: Highest run chase in T20Is full list","link":"https://thesportsrush.com/cricket-news-highest-successful-run-chase-in-t20-international-highest-run-chase-in-t20is-full-list/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest successful run chase in T20 international: The South African pair put on display a match-winning partnership at the Arun Jaitley Stadium tonight. During the first T20I of the ongoing South Africa’s tour of India in Delhi, South Africa beat India by 7 wickets to gain a 1-0 lead in a five-match series. Chasing a… The post Highest successful run chase in T20 international: Highest run chase in T20Is full list appeared first on The SportsRush.","content":"Highest successful run chase in T20 international: The South African pair put on display a match-winning partnership at the Arun Jaitley Stadium tonight. During the first T20I of the ongoing South Africa’s tour of India in Delhi, South Africa beat India by 7 wickets to gain a 1-0 lead in a five-match series. Chasing a 212-run target, South Africa thrived on the back of a match-winning 63-ball 131-run fourth-wicket partnership between batters Rassie van der Dussen (75*) and David Miller (64*). Needing 126 runs in 10 overs with van der Dussen struggling at one end and Miller quite new to the crease, the odds were unequivocally against the Proteas when both these batters defied both the probability and Indian bowling attack to win with five balls remaining in the match. Miller, who played a titular role in Gujarat Lions lifting Indian Premier League 2022 title in their inaugural season, managed to bring the same form and confidence to international cricket hitting four fours and five sixes at a strike rate of 206.45 on Thursday. van der Dussen, on the other hand, didn’t find an apt rhythm needed for a 200+ run chase for a large part of his knock at the Feroz Shah Kotla last night. Having scored 30 (32) till the 16th over, the right-hand batter finally broke the shackles to score 45 runs off his next 14 balls (including five fours and four sixes in the death overs). Simply sensational #INDvSA #BePartOfIt pic.twitter.com/UWJsxRWuLq — Cricket South Africa (@OfficialCSA) June 9, 2022 Highest successful run chase in T20 international Sealing a 212-run chase resulted in South Africa registering the ninth-highest T20I run-chase, highest for them, highest against India and highest at the Arun Jaitley Stadium. Having already sealed a 200-run chase against India in Dharamsala seven years ago, this is South Africa’s second such milestone against India. Team Target Opposition Ground Year Australia 244 New Zealand Auckland 2018 West Indies 232 South Africa Johannesburg 2015 England 230 South Africa Mumbai 2016 England 223 South Africa Centurion 2020 Bangladesh 215 Sri Lanka Colombo 2018 The post Highest successful run chase in T20 international: Highest run chase in T20Is full list appeared first on The SportsRush.","pubDate":"2022-06-10 03:01:24","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India versus South Africa: In a lost cause, India's T20 batting formula for the future emerges - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvaW5kaWEtdnMtc291dGgtYWZyaWNhLTFzdC10MjAtaW5kaWFzLXQyMC1iYXR0aW5nLWZvcm11bGEtZm9yLXRoZS1mdXR1cmUtZW1lcmdlcy03OTYxMzMxL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India versus South Africa: In a lost cause, India's T20 batting formula for the future emerges  The Indian ExpressLive Cricket Score - India vs South Africa, 1st T20I | Cricbuzz.com - Cricbuzz  CricbuzzNeed to plan better as a bowling department: Ishan Kishan refuses to pin the blame on one individual  India TodayIND vs SA 1st T20 Highlights: David Miller and RVD propel SA to record-breaking win  The Indian ExpressDelhi Metro extends train timings for T20 match today. See revised schedule  MoneycontrolView Full coverage on Google News","content":null,"pubDate":"2022-06-10 01:26:52","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Hasnain celebrates return, signs up for Oval Invincibles","link":"https://www.thenews.com.pk/print/964815-hasnain-celebrates-return-signs-up-for-oval-invincibles","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Mohammad Hasnain is celebrating his return to competitive cricket after signing up for the Oval Invincibles for The Hundred.Pakistan Cricket Board on Thursday announced that Mohammad Hasnain’s bowling action has been found to be legal after the amount of elbow extension in the...","content":"ISLAMABAD: Mohammad Hasnain is celebrating his return to competitive cricket after signing up for the Oval Invincibles for The Hundred. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Pakistan Cricket Board (PCB) on Thursday announced that Mohammad Hasnain’s bowling action has been found to be legal after the amount of elbow extension in the reassessment was within the 15-degree level of tolerance permitted under the ICC Illegal Bowling Regulations. The youngster is expected to be seen in action in his first competitive outing on August 7 against Welsh Fire at Cardiff. In case of his selection in playing XI it will be his first outing since he was banned in January 2022 following the tests conducted on his bowling action at the ICC’s accredited testing centre in Lahore. “I’m overjoyed to be joining Oval Invincibles. The Hundred looked like great fun last year and I can’t wait to get involved. The opportunity to play alongside stars like Sunil Narine, Jason Roy and the Curran brothers is hugely exciting. I’m really looking forward to getting back out on the field again,” Hasnain said while reacting to the news on his selection for The Hundred. Following his suspension, Hasnain underwent reassessment of his bowling action on May 21 at the ICC’s accredited testing centre in Lahore and the report was again verified by the Cricket Australia’s independent experts, as required under the ICC regulations. Hasnain was reported for a suspect bowling action in January during Cricket Australia’s domestic cricket competition. Meanwhile, some well-known international faces will be seen in action in The Hundred that include Afghanistan’s Noor Ahmad (Welsh Fire), Birmingham Phoenix’s Imran Tahir (South Africa), Australian Ben McDermott, who will play for London Spirit, Namibia’s Davis Wiese (Northern Super Charges).","pubDate":"2022-06-10 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Tauqeer Zia backs Ramiz as PCB chairman","link":"https://www.thenews.com.pk/print/964820-tauqeer-zia-backs-ramiz-as-pcb-chairman","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Former Pakistan Cricket Board chairman Lt Gen Tauqeer Zia has said that Chairman Ramiz Raja is working on the right track and urged to give him time to do more.Talking to media during his visit to Lahore Qalandars high performance centre, Tauqeer Zia said, “I remember the first...","content":"LAHORE: Former Pakistan Cricket Board chairman Lt Gen (Retd) Tauqeer Zia has said that Chairman Ramiz Raja is working on the right track and urged to give him time to do more. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Talking to media during his visit to Lahore Qalandars high performance centre, Tauqeer Zia said, “I remember the first press conference of Ramiz Raja. He is working according to the laid out plan he gave. But on this occasion, the issue of departmental cricket is different. You have to follow what is written in the constitution but apart from that so far Ramiz has done the right thing.” He said that whoever is brought as the PCB chairman he should be separated from politics and given three years’ time to perform. “Najam Sethi should also have completed his three years. Everyone has his own vision and he should be given it time to do so,” he said. Former chairman PCB said that Pakistan is going through difficult times at the moment and cricket is not important. “Change is constant thing but not at the moment, so the government should pay attention to the situation in the country, let cricket run as it is and don't worry about it.” Tauqeer Zia further said that Ramiz knows Pakistan cricket. “He has been a captain and has been playing department cricket, so he knows how to take cricket from grass root level.”","pubDate":"2022-06-10 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Australian great Ponting returns to Big Bash in off-field role","link":"https://www.thenews.com.pk/print/964830-australian-great-ponting-returns-to-big-bash-in-off-field-role","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY: Australian cricket great and current Delhi Capitals coach Ricky Ponting on Thursday signed a three-year deal as head of strategy for the Tasmanian Hurricanes in Australia’s Big Bash League.The Hurricanes have never won the domestic T20 competition in their 11-year history and...","content":null,"pubDate":"2022-06-10 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Indian cricketers break record","link":"https://www.thenews.com.pk/print/964831-indian-cricketers-break-record","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI: An Indian cricket team broke a 129-year-old first-class record as nine batsmen hit half-centuries in the domestic Ranji Trophy.Bengal amassed a mammoth 773 for 7 declared on Wednesday in the first innings of their quarter-final against Jharkhand in Bangalore. Two batsmen scored...","content":null,"pubDate":"2022-06-10 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"129yo record broken in absurd cricket scenes","link":"https://www.cairnspost.com.au/sport/cricket/indian-cricket-team-breaks-129yearold-batting-record/news-story/cf842e8dc0fc1563798cbdafe869babd","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"An Indian cricket team has broken a 129-year-old first-class record, with nine batters hitting half-centuries in the domestic Ranji Trophy.","content":null,"pubDate":"2022-06-10 00:07:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-COVID rules NZ skipper Williamson out of second England test","link":"https://www.thestar.com.my/sport/cricket/2022/06/10/cricket-covid-rules-nz-skipper-williamson-out-of-second-england-test","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - New Zealand skipper Kane Williamson will miss the second test against England starting on Friday at Trent Bridge after testing positive for COVID-19 on the eve of the match. Read full story","content":"(Reuters) - New Zealand skipper Kane Williamson will miss the second test against England starting on Friday at Trent Bridge after testing positive for COVID-19 on the eve of the match. Williamson, his country's best batsman, will begin five days of isolation and be replaced as captain by Tom Latham, New Zealand Cricket said in a statement. Experienced opener Hamish Rutherford, who is in England playing in a domestic Twenty20 competition, will come into the squad. \"It's such a shame for Kane to be forced to withdraw on the eve of such an important match,\" said New Zealand coach Gary Stead. \"We're all feeling for him at this time and know how disappointed he will be.\" New Zealand crashed to a five-wicket loss at Lord's on Sunday to go 1-0 down in the three-match series. The final test will take place at Headingley from June 23. The Black Caps have already lost all-rounder Colin de Grandhomme for the series due to a heel injury. He was replaced in the squad by Michael Bracewell. (Reporting by Nick Mulvenney; Editing by Muralikumar Anantharaman)","pubDate":"2022-06-09 23:49:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/10/1617359.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"NZ captain Williamson out of second Test","link":"https://www.perthnow.com.au/sport/cricket/nz-captain-williamson-out-of-second-test-c-7115431","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"New Zealand cricket captain Kane Williamson is out of the second Test against England at Trent Bridge on Friday after testing positive for COVID-19.","content":"New Zealand captain Kane Williamson will miss the second Test against England at Trent Bridge starting on Friday after the Black Caps captain tested positive for COVID-19 on the eve of the match. New Zealand Cricket said Williamson used a rapid antigen test after experiencing minor symptoms and he has begun five days of isolation. Coach Gary Stead confirmed Hamish Rutherford will join the squad as Williamson's replacement, and Tom Latham will captain the side in Williamson's absence. \"It's such a shame for Kane to be forced to withdraw on the eve of such an important match,\" Stead said. \"We're all feeling for him at this time and know how disappointed he will be. \"Hamish was with the Test squad earlier in the tour and has been playing for the Leicestershire Foxes in the Vitality T20 Blast.\" The rest of the touring party have returned negative rapid antigen test results and will continue following the tour health protocols of symptom reporting and subsequent testing if required. Williamson's side is fighting to keep the series alive in Nottingham this week and his absence is a blow to their hopes of levelling the scores. England triumphed over New Zealand in the first Test at Lord's with a match-winning century from former captain Joe Root. Williamson earlier said he was disappointed by comments from ICC chair Greg Barclay, who said there could be a reduction of Test cricket in the near future. Barclay, a Kiwi administrator who took office at the ICC in 2020, ruffled feathers during last week's Lord's Test when he suggested the next four-year cycle of international fixtures would mean many full member nations play fewer Tests. He warned of \"unfortunate consequences\" caused by the rise of Twenty20 leagues and indicated the schedule for countries outside the financial powerhouses of India, England and Australia would be impacted. That idea left a sour taste for Williamson, who captained the Black Caps to victory in last year's inaugural World Test Championship. \"We love our Test cricket, as do all the countries that have the opportunity to do it. \"Most of us come from an area where it is the pinnacle of the game and that's certainly how we feel. \"We want to see more of it and hope that, with the other formats which are also great, interest in the game grows. That would be ideal.\"","pubDate":"2022-06-09 23:37:46","image_url":"https://images.perthnow.com.au/publication/C-7115431/820ba7a4ce32b66a8ea7f378a87087ea0abedc7c-16x9-x0y75w800h450.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket legend Ricky Ponting returning to Hobart Hurricanes, could hire Tim Paine","link":"https://www.foxsports.com.au/cricket/australia/cricket-legend-ricky-ponting-returning-to-hobart-hurricanes-could-hire-tim-paine/news-story/b2760cea89c03d9440f693cd0e6192d7","keywords":null,"creator":null,"video_url":null,"description":"Former Australian cricket captain Ricky Ponting has signed a three-year deal to become head of strategy at the Hobart Hurricanes and believes Tim Paine would fit “perfectly” with his vision for the BBL franchise.","content":"Former Australian cricket captain Ricky Ponting has signed a three-year deal to become head of strategy at the Hobart Hurricanes and believes Tim Paine would fit “perfectly” with his vision for the BBL franchise. Ponting has already started searching for Adam Griffith’s replacement as head coach, and while former Australian coach Justin Langer is at the top of his mind, Ponting says there are “pages and pages” of candidates he’ll consider for the position. Ponting could have his work cut out for him luring Paine to the Hurricanes; the ex-Test captain has been on mental health leave from professional cricket since November when it came to light he had sent sexually explicit messages to a former Cricket Tasmania employee. While Ponting did not explicitly say he was considering Paine for the head coaching role, he said he would “never say never” when it came to offering him a position somewhere at the franchise. “What I’d like to achieve with the Hurricanes would be to bring as many great Tasmanian people back around the franchise as possible,” said Ponting, who played for the Hurricanes in BBL|01 and BBL|02. “I think Tim Paine fits perfectly into that mould. So if he’s ever ready to walk back with the purple shirt on, I’m sure lots of Tasmanians would like to see him involved.” Watch Australia’s Tour of Sri Lanka. Every T20, ODI and Test Match Live & On-Demand on Kayo. First T20 Starts 7th Jun 11:30PM AEST. New to Kayo? Try 14-Days Free Now > Launceston-born Ricky Ponting in action for the Hurricanes during the early days of the BBL. Source: News Limited The successful applicant for the head coaching job will be someone with whom Ponting has a good relationship, given he’ll work with the coach on match and list strategy for BBL|12 and beyond. Ponting and Langer are close, having played Test cricket alongside one another in Australia’s “golden era” of the 2000s. Ponting also confirmed Langer had told him of his desire to coach again but said he was unsure whether his friend would need more time away from the limelight; Langer only left his post as Australian cricket coach in February. “(Langer) is probably the one that’s I’ve spoken to the most about it so far,” Ponting said. “We’ve been having a bit of dialogue through the last six or seven months, to be honest. Nothing’s finalised with Justin yet. “He definitely wants to coach again. I think he’s got a bit more thinking to do as far as a commitment is concerned through the summer. Every chat I’ve had with him so far, he wants to coach again.” Ponting would welcome Tim Paine to the Hurricanes. Picture: Ryan Pierse/Getty Images Source: Supplied Ponting said he needed a coach who could inspire the dressing room on the Hurricanes’ quest for their maiden BBL title. “I know JL would do a great job if he was the one,” Ponting said. “I’ve got pages and pages of names of guys that I think would do a great job. I haven’t necessarily put them in order yet and I’ll tick them off over the next few weeks.” In terms of the Hurricanes’ playing list, Ponting said at the top of his wishlist were a “high-quality overseas spinner” and “someone who can bat in the top order and potentially bowl a couple of overs of spin”. He said unwanted BBL superstar Chris Lynn hadn’t figured in his plans just yet; the Brisbane Heat informed Lynn in May that his services wouldn’t be required in BBL|12. “If I look at (Hurricanes batters) Wade, McDermott, Short, David, I’m not sure that I’m picking Chris Lynn ahead of many of those guys,” Ponting said. Ponting captained the Australian cricket team in its so-called ‘golden era’ of the 2000s. Picture: Robert Cianflone/Getty Images Source: Getty Images Since retiring from playing, Ponting has proven himself an adept coach and analyst of the shortest format. He guided the Delhi Capitals to their first IPL final in 2020 and then to the game before the final in the tournament that followed. Ponting briefly served as an assistant to Australian coach Darren Lehmann in 2018 but has previously cited “time commitments” for his inability to take on a bigger role with the national side. Ponting is also regarded as one of the most insightful members of Channel 7’s BBL commentary team, which he said could prove an asset for the Hurricanes. “Having commentated so much on the BBL, my knowledge of the oppositions’ players is probably going to be as good as anyone’s,” Ponting said. “I’m looking forward to getting to work and securing the best coach for what we need, then building a plan for the team to execute next season. “With a few tweaks in a couple of key areas, I believe the Hurricanes have the foundations to win our first BBL trophy.”","pubDate":"2022-06-09 23:12:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"New Zealand’s Test plans in tatters after Kane Williamson catches Covid-19","link":"https://www.theguardian.com/sport/2022/jun/09/kane-williamson-test-cricket-england-new-zealand-trent-bridge","keywords":["England v New Zealand 2022","Cricket","England cricket team","New Zealand cricket team","Sport"],"creator":["Ali Martin at Trent Bridge"],"video_url":null,"description":"Black Caps captain ruled out of Test at Trent BridgeTom Latham to be stand-in skipper as Williamson isolatesNew Zealand saw their hopes of levelling the ongoing series against England suffer a significant setback after Kane Williamson, captain and leading batsman, was ruled out of today’s second Test after contracting Covid-19.Williamson was present at training on Thursday and in an upbeat pre-match press conference extolled the virtues of Test cricket in response to a recent forecast from Greg Barclay, chair of the International Cricket Council, that the format will shrink in future. Continue reading...","content":"New Zealand saw their hopes of levelling the ongoing series against England suffer a significant setback after Kane Williamson, captain and leading batsman, was ruled out of today’s second Test after contracting Covid-19. Williamson was present at training on Thursday and in an upbeat pre-match press conference extolled the virtues of Test cricket in response to a recent forecast from Greg Barclay, chair of the International Cricket Council, that the format will shrink in future. Ben Stokes promises England will be ‘even more positive’ in second Test Read more But late in the evening news broke that the 31-year-old has tested positive for the virus. A five-day isolation period follows – Williamson could in theory return for the third Test at Headingley – and now Tom Latham will lead the tourists in Nottingham as they look to fight back from the five-wicket defeat at Lord’s. Asked earlier for his response to Barclay’s prediction that Test cricket will be cut amid the rise of domestic Twenty20 leagues, Williamson said: “We love our Test cricket, as do all nations who have the opportunity to play it. It’s the pinnacle of the sport and we want to see more of it. There’s a number of people who have to make decisions but there’s certainly a love for it among Test nations.” Quick Guide Possible teams for the second Test at Trent Bridge Show England: Alex Lees, Zak Crawley, Ollie Pope, Joe Root, Jonny Bairstow, Ben Stokes (capt), Ben Foakes (wkt), Matt Potts, Jack Leach, Stuart Broad, Jimmy Anderson. New Zealand: Tom Latham (capt)*, Will Young, Hamish Rutherford, Devon Conway, Henry Nicholls, Daryl Mitchell, Tom Blundell (wkt), Kyle Jamieson, Tim Southee, Neil Wagner, Trent Boult. *Kane Williamson ruled out due to Covid positive Was this helpful? Thank you for your feedback. New Zealand, the world champions, already battle for fixtures and this three-match series against England is a rarity. Their lack of fixtures is demonstrated by the fact that Williamson made his Test debut in 2010, two years prior to Joe Root, and before his positive result was in line for an 88th cap to Root’s 119th. Williamson has 24 Test centuries – two fewer than Root – but had been battling for form on tour. After a poor IPL campaign of one half-century and a strike-rate below 100, the right-hander suffered a golden duck in their solitary warm-up and was nicked off early in both innings at Lord’s by the England debutant Matt Potts. Though New Zealand lost a tight series opener that could have gone either way, those two failures for Williamson were overcome as Daryl Mitchell (108) and Tom Blundell (96) at least fired in their second innings. England’s batting unit remains far more reliant on Root’s class – even if Ben Stokes and Ben Foakes supported his celestial unbeaten 115 in the run chase – and this is another case of hoping the support cast step up. This did not occur in Nottingham last year, when Root’s scores of 64 and 109 against India – perhaps his finest Test century – made for another lone-hand performance in a rain-affected draw. As Root explained after hitting the winning runs at Lord’s last Sunday, he was also defying the strains of captaincy. Tom Latham will be New Zealand’s stand-in captain at Trent Bridge. Photograph: Lindsey Parnaby/AFP/Getty Images “You can end up taking it home and it can affect your personal situation, which Joe was very brave to say,” said Stokes, when asked if those comments served as a reminder of what he himself has signed up for as Root’s successor. “Joe, without that added pressure of being captain, it was almost like he was 18 again and I’m pretty sure it won’t be long before he is snipping people’s socks again,” Williamson said. “It’s great he doesn’t have that mountain of added pressure of being captain on his shoulders, he can just go out there and score the runs like he does.” At a training session that began with a penalty shootout and Brendon McCullum, the head coach, as one of the goalkeepers, Stokes once again named his XI a day before the toss. In theory, England are unchanged as they seek a first series win for their new captain, even if Matt Parkinson drops out after acting as a concussion sub for Jack Leach. It looks a sensible call in terms of Leach’s incumbency and the history of Trent Bridge. Seamers are likely to lead the way, with Stuart Broad positively bouncing about his latest homecoming. But while hot takes were inevitable when English cricket briefly resumed its maddening relationship with leg-spin, Parkinson should not take his instant demotion after a surprise Test debut as an implied criticism. The Spin: sign up and get our weekly cricket email. A hard pitch with a tinge of green awaits at a ground where New Zealand have won once, through the genius of Richard Hadlee in 1986. Williamson was unsure of his team prior to his positive Covid test and though Colin de Grandhomme’s heel injury had opened up a slot for Henry Nicholls in the middle order after a calf injury, opener Hamish Rutherford has now joined the squad from Leicestershire. Williamson’s uncertainty chiefly surrounded the make-up of his bowling attack. Though the medium pace of Mitchell could in theory pick up the slack in De Grandhomme’s absence, it may be that Neil Wagner, tenacious purveyor of left-arm seam, replaces the spin of Ajaz Patel. Complicating this temptation to play an all-seam attack is the expectation of bright sunshine over the course of the five days. Like talk of a reduction in the number of Test matches played in future, it is a forecast that is slightly troubling the tourists.","pubDate":"2022-06-09 22:59:38","image_url":"https://i.guim.co.uk/img/media/bbd84cacae803ba3ef37e71d990d3dea92d6b369/0_57_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=af90ee863325077bcd3fbdaaca0ede07","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"ENG vs NZ Trent Bridge Cricket Stadium pitch report: Nottingham pitch report England vs New Zealand 2nd Test today match","link":"https://thesportsrush.com/cricket-news-eng-vs-nz-trent-bridge-cricket-stadium-pitch-report-nottingham-pitch-report-england-vs-new-zealand-2nd-test-today-match/","keywords":["Cricket","England","New Zealand","New Zealand tour of England 2022","Nottingham"],"creator":["Gurpreet Singh"],"video_url":null,"description":"ENG vs NZ Trent Bridge Cricket Stadium pitch report: High in confidence England will take on the Kiwis during the 2nd Test at Nottingham. The second encounter of the ongoing three-match Test series between England and New Zealand will take place at the Trent Bridge in Nottingham. A crafty bowling display by the pace bowling… The post ENG vs NZ Trent Bridge Cricket Stadium pitch report: Nottingham pitch report England vs New Zealand 2nd Test today match appeared first on The SportsRush.","content":"ENG vs NZ Trent Bridge Cricket Stadium pitch report: High in confidence England will take on the Kiwis during the 2nd Test at Nottingham. The second encounter of the ongoing three-match Test series between England and New Zealand will take place at the Trent Bridge in Nottingham. A crafty bowling display by the pace bowling trio of James Anderson, Stuart Broad, and the debut pacer Matty Potts, coupled with a century of the highest order by Joe Root during the 4th innings meant that England finally managed to end their victory drought, with a five-wicket win at the Lord’s Cricket Ground. New Zealand, on the other hand, were let down primarily by their batters, with the likes of Tom Latham, Will Young, and skipper Kane Williamson returning back with low scores in both their innings. England too, have plenty to ponder upon as far as their batting line-up is concerned, as had it not been for their bowlers, their first innings collapse might have led to their downfall in the Test. All in all, a lip-smacking contest awaits at the Trent Bridge today, with seamers likely to dominate the proceedings yet again. Final training ahead of the second Test ✅ 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZ 🇳🇿 pic.twitter.com/PzthEG0vnd — England Cricket (@englandcricket) June 9, 2022 As has been the reputation of the wicket at the Trent Bridge for Tests in the past, expect the pace attack from both the sides to trouble the opposition batters right away with the swing and bounce on offer off the deck. Moreover, the pitch also had a decent cover of grass with just a few hours left for the play to start, to further bring smiles on the pacers’ faces. With an average first and second innings score at the venue being 313 and 298 runs respectively, expect the track to offer more or less equal assistance to both the batters and bowlers alike. Having said that, the pitch is likely to ease out for the batters as the match progresses.","pubDate":"2022-06-09 19:02:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA | Miller breaks India’s record, Dassault – South Africa win first T20","link":"https://thenewsglory.com/ind-vs-sa-miller-breaks-indias-record-dassault-south-africa-win-first-t20/","keywords":["Sports","Cricket","India","Indian team","South Africa"],"creator":["The News Glory"],"video_url":null,"description":"Delhi: The South African cricket team is touring India and playing in the five-match T20 series. The South African team easily defeated India in the first T20 match of the series. Captain Temba Bauma, along with Quinton de Gock, gave the South Africans the lead as they chased down a target of 212 for victory. […]","content":"Delhi: The South African cricket team is touring India and playing in the five-match T20 series. The South African team easily defeated India in the first T20 match of the series. Captain Temba Bauma, along with Quinton de Gock, gave the South Africans the lead as they chased down a target of 212 for victory. The pair lasted up to 2.2 overs. Bhuvneshwar Kumar split the pair. Bauma tied the innings for 10 for the first wicket. All-rounder Twain Pretorius made an entry in the One Town space as a surprise. Like the entry, Sixer rained down action and surprise. However failed to last long. He was bowled out for 29 by Herschelle Patel for his slow bowling, followed by Quinton de Kock for 22. This was followed by Vander Dasson and David Miller, who led the team to victory. The duo put on an action-packed half-century and won the toss and elected to bat first. Miller scored 64 and Wander Dusson 75. In T20 cricket, the Indian team has won 12 matches in a row. Earlier, Afghanistan and Romania had won 12 matches in a row. India had equaled this record last February. India are expected to become the first team to record 13 consecutive wins if they win today’s match. However, David Miller and Wander Dusson combined to break the record set by the Indian team. Indian team innings: South African captain Bauma, who won the toss, chose to bowl. Rishabh Bandh leads the Indian team as captain. Ishant Kishan and Rudraj Kejriwal were the opening batsmen. Both scored 57 runs for the first wicket. Rudraj was out for 23 off 15 balls. Ishant Kishan formed a partnership of 80 runs with Shreyas Iyer who followed. Kishan was out for 76 off 48 balls. His innings included 3 sixes and 11 fours. He has been in poor form throughout the 15th IPL season and has returned to form with a return to the Indian team. Shreyas was out for 36 runs. Then Captain Bandh and Hardik Pandya joined. Both were busy accumulating runs fast. With that they formed a partnership of 46 off 18 balls. Bandh was out for 29 runs. Pandya scored 31 off 12 balls. Dinesh Karthik took a run. At the end of 20 overs, India scored 211 runs for the loss of 4 wickets. .","pubDate":"2022-06-09 18:26:24","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Ind vs SA 1st T20I: Miller magic stuns India, South Africa take 1-0 lead","link":"https://www.business-standard.com/article/pti-stories/miller-magic-stun-india-in-first-t20-122060901250_1.html","keywords":null,"creator":null,"video_url":null,"description":"David Miller carried his sensational IPL form to international cricket as South Africa made a mockery of the Indian bowling attack and raced to a seven-wicket win in the opening T20 here on Thursday","content":"David Miller carried his sensational IPL form to international cricket as South Africa made a mockery of the Indian bowling attack to gun down their highest ever run-chase and race to a seven wicket win in the opening T20 here on Thursday. Rassie Van der Dussen (71 not out off 45 ) and Miller (64 not out off 31) shared an unbeaten 131-run stand to chase down a stiff 212-run target with ridiculous ease and five balls to spare. India had posted an imposing to 211 for four with the help of Ishan Kishan (76 off 48 balls), new skipper Rishabh Pant (29 off 16) and Hardik Pandya (31 off 12). However, it was not meant to be as the Indians were outdone by the brilliance of Miller and van der Dussen, who toyed with the opposition attack. South Africa skipper Temba Bavuma (10) and Quinton de Kock (22) were off to a flyer as they raced to 22/0 in the first two overs. However, the ever-reliable Bhuvneshwar Kumar bowled a brilliant leg-cutter to dismiss Bavuma. Dwayne Pretorius (29 off 13) and de Kock then took leg spinner Yuzvendra Chahal and Hardik to the cleaners. While Chahal gave away 16 runs, Hardik, whose return to bowling was highly anticipated ahead of the series, leaked 18 runs and was slammed for three sixes by Pretorius, including one that was 91m long. Harshal Patel finally broke the partnership as he bamboozled Pretorius with a slow full toss. The Indian bowlers kept striking at regular intervals and limit the boundaries, slowing the proceedings. But Killer Miller' had different ideas. Continuing his stellar run from the IPL, the Southpaw smashed a total of three sixes and a couple of fours in the 12th and 13th over to get South Africa back in the game, while van der Dussen played the perfect second fiddle. With 80 needed off the last six. Miller brought up his fifth T20 half-century. India had the opportunity to break the dangerous partnership between Miller and van der Dussen but Shreyas was guilty of dropping the latter at deep midwicket on 29. The drop cost India dearly as van der Dussen pummelled Harshal to submission. The South African hit three sixes and a four. After that, it was a six-hitting fest as both the batters hit five maximums each. Earlier, India were off to a bright start after being asked to bat. The hosts plundered 13 runs off the first over with Kishan hitting back-to-back fours as Bavuma opted to open with spinner Keshav Maharaj. Rectifying his mistake, Bavuma bought pace spearhead Kagiso Rabada into the attack, who restricted the scoring giving away two runs in the following over. Kishan seemed to be struggling with Anrich Nortje's pace but alongside Rituraj Gaikwad (23) kept on stealing boundaries and sixes with ease at the Arun Jaitley Stadium. Gaikwad was dropped on 17 by Dwayne Pretorius at the beginning of the seventh over. However, the right-hander couldn't capitalize on the reprieve as he was caught at midwicket by Bavuma off Wayne Parnell, who made a comeback to the South African side for the first time since 2017. Kishan and new-man Shreyas Iyer (36) continued to score runs at will as India raced to 100 runs in 9.4 overs. The visitors also seemed a tad sloppy on the field, missing catches and a stumping opportunity. Iyer then hit Tabraiz Shamsi for a couple of sixes over long-on. Kishan brought up his third T20 fifty in style as he whacked Maharaj for a six-over dip midwicket. In the groove, he then took the spinner to the cleaners in his next over launching the ball for back-to-back sixes before hitting two fours. However, Maharaj finally redeemed himself as Ishan hit the length ball straight in the hands of David Miller at wide long-on. Iyer too departed soon after. Captain Pant and his deputy Pandya, who returned to the side after leading his side Gujarat Titans to the IPL title, then hit a flurry of fours and sixes to provide the final flourish. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-06-09 18:19:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220609/thumb-122060901250.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Former test batsmen Graeme Wood and Mike Veletta quit WA Cricket Association board amid growing tension","link":"https://thewest.com.au/sport/cricket/former-test-batsmen-graeme-wood-and-mike-veletta-quit-wa-cricket-association-board-amid-growing-tension-c-7112826","keywords":null,"creator":["Jackson Barrett"],"video_url":null,"description":"Former Test batsmen Graeme Wood and Mike Veletta have quit the WA Cricket Association board amid growing tension within the organisation.","content":null,"pubDate":"2022-06-09 18:00:00","image_url":"https://images.thewest.com.au/publication/C-7112826/2b816c6205db9751bf4feee8f489d09dab7cf087-16x9-x398y176w1394h784.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA 3rd T20 tickets: Vishakhapatnam cricket match tickets Paytm T20 trophy 2022 tickets booking start date","link":"https://thesportsrush.com/cricket-news-ind-vs-sa-3rd-t20-tickets-vishakhapatnam-cricket-match-tickets-paytm-t20-trophy-2022-tickets-booking-start-date/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022","Vishakhapatnam ODI"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs SA 3rd T20 tickets: The five-match T20I series would be the first series post pandemic to be played without bio-bubble restrictions. Having not lost a T20I series on their tour to India, South Africa, with the already underway five-match T20I series, have a great opportunity to keep their record intact, with the Indian… The post IND vs SA 3rd T20 tickets: Vishakhapatnam cricket match tickets Paytm T20 trophy 2022 tickets booking start date appeared first on The SportsRush.","content":"IND vs SA 3rd T20 tickets: The five-match T20I series would be the first series post pandemic to be played without bio-bubble restrictions. Having not lost a T20I series on their tour to India, South Africa, with the already underway five-match T20I series, have a great opportunity to keep their record intact, with the Indian Cricket team playing in the absence of most of their experienced players. On the other hand, the South African team, under the leadership of Temba Bavuma, have toured India with a nearly full strength squad. With the first two T20Is to take place at New Delhi and Cuttack, the action would shift towards the southern part of India, at the Dr. Y.S. Rajashekhar Reddy ACA-VDCA Cricket Stadium in Vishakhapatnam, which will host its first international match after three years. Team India have played mere two T20Is till date at this venue. While they had won against Sri Lanka in February 2016, they bowed down against Australia in the year 2019. The third T20 at Vizag is scheduled to take place on June 14 (Tuesday) from 7 pm onwards. While there are no points for guessing that the stadium would be absolutely jam-packed with Cricket lovers, with the COVID-19 restrictions no longer in place, the online tickets would be available to the fans from INR 600 onwards, and will go all the way to INR 6,000 offering the best of seats for the viewing experience. Fans can book the online tickets to the venue via the ‘Paytm Insider’ or simply by logging in to www.insider.in. Thus, readers are advised to keep following the ticket booking section by clicking here at regular intervals, as sales of tickets might take place at a rapid pace. Also, it is worth of a mention, that one can book only a maximum of two tickets via the online payment process.","pubDate":"2022-06-09 17:43:17","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-South Africa&#039;s Miller and Van der Dussen blitz India","link":"https://www.thestar.com.my/sport/cricket/2022/06/10/cricket-south-africa039s-miller-and-van-der-dussen-blitz-india","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - David Miller and Rassie van der Dussen smashed blistering half-centuries to lead South Africa to a thrilling seven-wicket win over India in the first Twenty20 International on Thursday. Read full story","content":null,"pubDate":"2022-06-09 17:36:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/06/10/1617278.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Ambani-Murdoch vs Jeff Bezos – the heavyweight IPL media rights battle - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9leHBsYWluZWQvYW1iYW5pLW11cmRvdWNoLXZzLWplZmYtYmV6b3MtdGhlLWhlYXZ5d2VpZ2h0LWlwbC1tZWRpYS1yaWdodHMtYmF0dGxlLTc5NjEyNDQv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ambani-Murdoch vs Jeff Bezos – the heavyweight IPL media rights battle  The Indian ExpressIPL media rights: BCCI makes modifications to few clauses | Cricbuzz.com - Cricbuzz  CricbuzzIPL set for blockbuster media rights deal for 2023-27 cycle  ESPNcricinfoIPL Media Rights Tender: Just 2 Days to go, BCCI Meets Potential Bidders: Follow LIVE UPDATES  InsideSportBezos and Ambani to Clash In Cricket Auction  BloombergView Full coverage on Google News","content":null,"pubDate":"2022-06-09 17:07:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - Zimbabwe vs Afghanistan 3rd ODI 2022 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL2FmZ2hhbmlzdGFuLWluLXppbWJhYndlLTIwMjItMTMxMDkxOC96aW1iYWJ3ZS12cy1hZmdoYW5pc3Rhbi0zcmQtb2RpLTEzMTA5NDUvbWF0Y2gtcmVwb3J00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - Zimbabwe vs Afghanistan 3rd ODI 2022  ESPNcricinfoAfghanistan survive scare to complete cleansweep | Cricbuzz.com - Cricbuzz  CricbuzzZIM vs AFG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Afghanistan Tour of Zimbabwe, 3rd ODI  Cricket Addictor3rd ODI: Rashid Khan, Mohammad Nabi Star as Afghanistan Complete Whitewash Over Zimbabwe  News18Afghanistan bowl out Zimbabwe for 135 in third ODI  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-06-09 16:48:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Dinesh Karthik debut in international cricket: Why Dinesh Karthik helmet is different in cricket?","link":"https://thesportsrush.com/cricket-news-dinesh-karthik-debut-in-international-cricket-why-dinesh-karthik-helmet-is-different-in-cricket/","keywords":["Cricket","dinesh karthik","Dinesh Karthik helmet","India","South Africa","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Dinesh Karthik debut in international cricket: The 37-year-old has marked his return back to international Cricket after three years. With team India all set to register a world record of winning 13 consecutive T20I matches at the Arun Jaitley Stadium in New Delhi, the 37-year-old wicket-keeper batter from Tamil Nadu, Dinesh Karthik has made a… The post Dinesh Karthik debut in international cricket: Why Dinesh Karthik helmet is different in cricket? appeared first on The SportsRush.","content":"Dinesh Karthik debut in international cricket: The 37-year-old has marked his return back to international Cricket after three years. With team India all set to register a world record of winning 13 consecutive T20I matches at the Arun Jaitley Stadium in New Delhi, the 37-year-old wicket-keeper batter from Tamil Nadu, Dinesh Karthik has made a comeback to international Cricket after three years, courtesy of his commendable finishing skills which were on display during the recently concluded IPL 2022. With Rishabh Pant making his T20I captaincy debut, and Ishan Kishan slotted as the opener due to KL Rahul’s unavailability, Karthik is the third wicket-keeper batter included in the playing 11 during India’s ongoing first T20I against South Africa. However, with Hardik Pandya sent in to bat at number 5 in the batting order, all Karthik could manage was to face mere couple of deliveries after the fall of fourth wicket during the 20th Over. Dinesh Karthik debut in international cricket Before the ongoing T20I against South Africa, Karthik last played in Indian colours during the first semi-final of the 2019 ICC Cricket World Cup versus New Zealand at Manchester. As far as the Tamil Nadu wicket-keeper’s international debut for team India is concerned, the same came way back in September 2004, against England at the Lord’s Cricket Ground, during India’s 3rd ODI of the tour of England. Karthik made his Test debut in the same year against Australia in November 2004, at the Wankhede Stadium in Mumbai. In the T20I format, the 37-year-old made his debut during team India’s first ever match in the format against South Africa in the year 2006. Karthik even went on to become the ‘Player of the match’ that was played in Johannesburg. Johannesburg (2006) Delhi (2022) .@DineshKarthik is still going strong #DineshKarthik #INDvsSA #Cricket #T20Is pic.twitter.com/QRE0TYwxGZ — Wisden India (@WisdenIndia) June 9, 2022 Why Dinesh Karthik helmet is different in cricket? During his short time at the crease today, Dinesh Karthik was yet again seen donning his peculiar and an uncommon helmet, which is different than the ones players normally wear while batting. While there is no specific reason for his choice, one of the those might perhaps be its light weight that may cause minimum disturbance while going for the shots, especially against the short deliveries. The post Dinesh Karthik debut in international cricket: Why Dinesh Karthik helmet is different in cricket? appeared first on The SportsRush.","pubDate":"2022-06-09 16:13:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA: 7 Best Tweets On Dinesh Karthik’s Fairytale Comeback - The Cricket Lounge","link":"https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vdGhlY3JpY2tldGxvdW5nZS5jb20vMjAyMi8wNi9pbmQtdnMtc2EtNy1iZXN0LXR3ZWV0cy1vbi1kaW5lc2gta2FydGhpay1mYWlyeXRhbGUtY29tZWJhY2sv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: 7 Best Tweets On Dinesh Karthik’s Fairytale Comeback  The Cricket LoungeIND vs SA: 'The Whole World Is Excited, Not Just India'- Irfan Pathan Believes Rahul Dravid 'Will Back' Star Youngster In SA T20I Series  Cricket Addictor‘The whole world is excited’: Pathan believes Dravid ‘will back’ star youngster  Hindustan TimesRahul Dravid's Penchant for Perfection Will Benefit New Look India  News18IND vs SA: Watch - Wasim Jaffer Aptly Describes Dinesh Karthik's Comeback To The Indian Side  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-06-09 15:38:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Highest T20 score international: Highest T20I score team innings full list","link":"https://thesportsrush.com/cricket-news-highest-t20-score-international-highest-t20i-score-team-innings-full-list/","keywords":["Cricket","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest T20 score international: India have registered their eighth-highest innings total in the shortest format tonight. During the first T20I of the ongoing South Africa’s tour of India in Delhi, India have set a 212-run target in spite of scoring just 35/0 in the first five overs after being put in to bat by visiting… The post Highest T20 score international: Highest T20I score team innings full list appeared first on The SportsRush.","content":"Highest T20 score international: India have registered their eighth-highest innings total in the shortest format tonight. During the first T20I of the ongoing South Africa’s tour of India in Delhi, India have set a 212-run target in spite of scoring just 35/0 in the first five overs after being put in to bat by visiting captain Temba Bavuma. A 40-ball 80-run second-wicket partnership between batters Ishan Kishan (76) and Shreyas Iyer (36) was a game-changing moment for the Indian innings providing a much-needed momentum for scoring 211/4 in 20 overs. In what was his third T20I half-century, Kishan dominated the proceedings particularly against left-arm spinner Keshav Maharaj by hitting 11 fours and three sixes at a strike rate of 158.33. Leading for the first time in international cricket, Rishabh Pant was also among the starts scoring 29 (16) with the help of two fours and sixes each before getting out to his Delhi Capitals teammate Anrich Nortje in the final over. Pant sharing an 18-ball 46-run fourth-wicket partnership alongside Hardik Pandya (31*) played a crucial role behind India crossing the 200-run mark at the Arun Jaitley Stadium tonight. Pandya, making an international comeback after seven months, hit two fours and three sixes at a strike rate of 258.33. That’s a pretty impressive performance from India’s alternate batting line-up. And they have a laid a good template for the seniors to follow #INDvsSA — Sambit Bal (@sambitbal) June 9, 2022 For South Africa, Kagiso Rabada and Tabriaz Shamsi failed to pick a wicket on Thursday. On the contrary, Wayne Parnell, Dwaine Pretorius, Anrich Nortje and Keshav Maharaj picked a wicket apiece at the Feroz Shah Kotla. Highest T20 score international matches   Team Score Overs Opposition Ground Year Afghanistan 278/3 20 Ireland Dehradun 2019 Czech Republic 278/4 20 Turkey Ilfov County 2019 Australia 263/3 20 Sri Lanka Pallekele 2016 Sri Lanka 260/6 20 Kenya Johannesburg 2007 India 260/5 20 Sri Lanka Indore 2017 The post Highest T20 score international: Highest T20I score team innings full list appeared first on The SportsRush.","pubDate":"2022-06-09 15:24:11","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Can West Indies upset Pakistan's convenient blueprint? | Cricbuzz.com - Cricbuzz - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LmNyaWNidXp6LmNvbS9jcmlja2V0LW5ld3MvMTIyNTUzL2Nhbi13ZXN0LWluZGllcy11cHNldC1wYWtpc3RhbnMtY29udmVuaWVudC1ibHVlcHJpbnQtY3JpY2J1enpjb23SAW5odHRwOi8vbS5jcmljYnV6ei5jb20vYW1wL2NyaWNrZXQtbmV3cy8xMjI1NTMvY2FuLXdlc3QtaW5kaWVzLXVwc2V0LXBha2lzdGFucy1jb252ZW5pZW50LWJsdWVwcmludC1jcmljYnV6emNvbQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Can West Indies upset Pakistan's convenient blueprint? | Cricbuzz.com - Cricbuzz  CricbuzzShort Highlights | Pakistan vs West Indies | 1st ODI 2022 | PCB | MO2T  Pakistan CricketBabar breaks more records as Pakistan defeat West Indies  International Cricket CouncilPak vs WI: Pakistan, Windies eager to make impact in hot-weather ODI series  The News InternationalBabar ton helps Pakistan draw first blood | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-06-09 15:17:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Old name of Arun Jaitley Stadium: Why Feroz Shah Kotla stadium renamed?","link":"https://thesportsrush.com/cricket-news-old-name-of-arun-jaitley-stadium-why-feroz-shah-kotla-stadium-renamed/","keywords":["Cricket","Arun Jaitley Stadium","India","South Africa","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Old name of Arun Jaitley Stadium: After the Eden Gardens in Kolkata, this stadium is the second-oldest functional one in India. During the first T20I of the ongoing South Africa’s tour of India at the Arun Jaitley Stadium in Delhi, Proteas skipper Temba Bavuma won the Toss and elected to field first on what looks… The post Old name of Arun Jaitley Stadium: Why Feroz Shah Kotla stadium renamed? appeared first on The SportsRush.","content":"Old name of Arun Jaitley Stadium: After the Eden Gardens in Kolkata, this stadium is the second-oldest functional one in India. During the first T20I of the ongoing South Africa’s tour of India at the Arun Jaitley Stadium in Delhi, Proteas skipper Temba Bavuma won the Toss and elected to field first on what looks like an excellent pitch to bat on. With team India playing without their experienced stars in Virat Kohli, Rohit Sharma, Jasprit Bumrah, and KL Rahul (to name a few), wicket-keeper batter Rishabh Pant has become the second-youngest Indian to make his captaincy debut in the T20 format. The stadium is hosting its seventh T20I match, with teams batting first winning three of them, while teams chasing having won thrice as well. 9⃣4⃣9⃣ Days Later International Cricket returns to #QilaKotla Dilli, excited to watch #INDvSA at the Arun Jaitley Stadium? pic.twitter.com/b0qJDUrvsw — Delhi Capitals (@DelhiCapitals) June 9, 2022 Old name of Arun Jaitley Stadium Located at the Bahadur Shah Zafar Marg in New Delhi, the stadium was established in the year 1883 and was named as the Feroz Shah Kotla Stadium, for having been situated near the Kotla fort. However, on August 27, 2019, the DDCA (Delhi District Cricket Association) decided to rename the stadium in honour of late Arun Jaitley, the former Finance minister of India and DDCA president. The decision to rename the stadium was announced after three days of Mr.Jaitley’s unfortunate demise and was ultimately officially renamed at a function that took place on September 12, 2019. The present DDCA president Rajat Sharma, while explaining the reason behind renaming the stadium said, “It was Arun Jaitley’s support and encouragement that players like Virat Kohli, Virender Sehwag, Gautam Gambhir, Ashish Nehra, Rishabh Pant and many others could make India proud.” The decision to rename the stadium was met with a fair share of criticism as well, with former India cricketer Bishan Singh Bedi even going on to request the DDCA to remove his name from the spectators’ stand, which was named after him in the year 2017. Bedi was visibly unamused by the DDCA’s decision to erect Jaitley’s statue at the stadium, and has also accused the latter of charges of nepotism during his 14-year reign as the DDCA president. The post Old name of Arun Jaitley Stadium: Why Feroz Shah Kotla stadium renamed? appeared first on The SportsRush.","pubDate":"2022-06-09 15:10:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA, 1st Innings Highlights: टीम इंडिया ने दिया 212 रनों का लक्ष्य, ईशान किशन ने खेली तूफानी पारी","link":"https://www.abplive.com/sports/cricket/ind-vs-sl-1st-t20-india-given-the-target-of-212-runs-against-south-africa-at-arun-jaitley-stadium-2142635","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs South Africa, 1st T20I Delhi:</strong> भारत ने दक्षिण अफ्रीका को जीत के लिए 212 रनों &nbsp;का लक्ष्य &nbsp;दिया. टीम के लिए ईशान किशन ने शानदार पारी खेली. उन्होंने 48 गेंदों में 76 रन बनाए. वहीं कप्तान ऋषभ पंत ने 29 रनों &nbsp;की तूफानी पारी खेली. हार्दिक पांड्या 31 रन बनाकर नाबाद रहे.</p> <p style=\"text-align: justify;\">टॉस हारकर पहले बैटिंग करने उतरी टीम इंडिया के लिए ईशान किशन और ऋतुराज गायकवाड़ ओपनिंग करने आए. इस दौरान किशन 48 गेंदों का सामना करते हुए 76 रन बनाकर आउट हो गए. उनकी इस पारी में 11 चौके और 3 छक्के शामिल रहे. जबकि ऋतुराज 15 गेंदों में 23 रन बनाकर आउट हुए. उन्होंने इस पारी में 3 छक्के जड़े. श्रेयस अय्यर 36 रन बनाकर आउट हुए. उन्होंने 27 गेंदों में 3 चौके और एक छक्का लगाया.</p> <p style=\"text-align: justify;\">अंत में हार्दिक पांड्या और ऋषभ पंत ने अच्छी पारियां खेलीं. पंत 16 गेंदों में 29 रन बनाकर आउट हुए. उनकी इस पारी में 2 चौके और 2 छक्के शामिल रहे. जबकि पांड्या 12 गेंदों में 3 छक्कों और 2 चौकों की मदद से 31 रन बनाकर नाबाद रहे. दिनेश कार्तिक सिर्फ दो गेंदें ही खेल पाए. वे एक रन बनाकर नाबाद रहे. 3</p> <p style=\"text-align: justify;\">दक्षिण अफ्रीका के लिए एनरिक नॉर्टजे ने 4 ओवरों में 36 रन देकर एक विकेट लिया. केशव महाराज ने 3 ओवरों में 43 रन देकर एक विकेट लिया. वेन पार्नेल ने 4 ओवरों में 32 रन देकर एक विकेट लिया. ड्वेन प्रीटोरियस को भी एक विकेट लिया. उन्होंने 3 ओवरों में 35 रन दिया.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-1st-t20-team-india-playing-xi-dinesh-karthik-comeback-avesh-khan-rishabh-pant-delhi-2142597\">IND vs SA 1st T20: कार्तिक की 3 साल बाद टीम इंडिया में हुई वापसी, उमरान को प्लेइंग इलेवन में नहीं मिली जगह</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-kuldeep-yadav-wrote-an-emotional-post-after-being-out-of-the-t20-series-2142551\"><strong>IND vs SA: टी20 सीरीज से बाहर होने के बाद कुलदीप यादव ने लिखा भावुक पोस्ट, जानिए क्या कहा</strong></a></p>","content":null,"pubDate":"2022-06-09 15:08:16","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs SA T20: साउथ अफ्रीका सीरीज से बाहर होने के बाद कुलदीप यादव का बड़ा बयान, भारतीय टीम के लिए कही ये बात","link":"https://www.abplive.com/sports/cricket/after-being-ruled-out-of-the-t20i-series-against-south-africa-due-to-injury-kuldeep-yadav-said-that-he-is-disappointed-to-be-dropped-from-the-team-but-will-make-strong-comeback-soon-2142601","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Kuldeep Yadav:</strong> चाइनामैन बॉलर कुलदीप यादव साउथ अफ्रीका के खिलाफ टी20 सीरीज का हिस्सा नहीं होंगे. दरअसल, इस सीरीज के लिए कुलदीप यादव का चयन किया गया था. लेकिन दिल्ली में होने वाले पहले टी20 मैच से पहले कुलदीप यादव चोटिल हो गए. अब इस स्पिनर ने बड़ा बयान दिया है. उन्होंने कहा कि टीम से बाहर होने पर निराश हैं लेकिन जल्दी ही एक मजबूती से वापसी करेंगे. उन्होंने कहा कि मैं हर तरह से टीम का समर्थन कर रहा हूं. मुझे उम्मीद है कि इस सीरीज में भारतीय खिलाड़ी अपना सौ फीसदी देंगे.</p> <p style=\"text-align: justify;\"><strong>साउथ अफ्रीका सीरीज में ऋषभ पंत होंगे कप्तान</strong></p> <p style=\"text-align: justify;\">गौरतलब है कि भारतीय टीम साउथ अफ्रीका के खिलाफ 5 टी20 मैचों की सीरीज खेल रही है. इस सीरीज के लिए विराट कोहली, रोहित शर्मा और जसप्रीत बुमराह जैसे खिलाड़ियों को आराम दिया गया है. जबकि अर्शदीप सिंह और उमरान मलिक जैसे खिलाड़ियों को पहली बार भारतीय टीम में शामिल किया गया है. दरअसल, इस सीरीज के लिए केएल राहुल को भारतीय टीम का कप्तान बनाया गया था. लेकिन केएल राहुल के चोटिल होने के बाद ऋषभ पंत को भारतीय टीम का कप्तान बनाया गया है. वहीं, हार्दिक पांड्या उप कप्तान की भूमिका में होंगे.</p> <p style=\"text-align: justify;\"><strong>हार्दिक पांड्या भारतीय टीम के उप कप्तान बने</strong></p> <p style=\"text-align: justify;\">इससे पहले हार्दिक पांड्या की अगुवाई में गुजरात टाइटंस ने इस सीजन खिताब अपने नाम किया. गौरतलब है कि IPL में गुजरात टाइटंस का यह पहला सीजन था. हार्दिक पांड्या ने इस सीजन कप्तानी के अलावा बैट और बॉल दोनों से शानदार प्रदर्शन किया. गुजरात टाइटंस लीग स्टेज में 20 प्वॉइंट्स के साथ प्वॉइंट्स टेबल में टॉप पर रही. हार्दिक पांड्या ने इस सीजन 15 मैचों में 458 रन बनाए. वहीं, गेंदबाजी में भी शानदार प्रदर्शन करते हुए 8 विकेट अपने नाम किया.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-cricket-score-live-updates-india-vs-south-africa-1st-t20-live-telecast-online-2142484\">IND vs SA T20 Score Live: दक्षिण अफ्रीका ने टॉस जीतकर किया फील्डिंग का फैसला, देखें प्लेइंग इलेवन</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-1st-t20-team-india-playing-xi-dinesh-karthik-comeback-avesh-khan-rishabh-pant-delhi-2142597\">IND vs SA 1st T20: कार्तिक की 3 साल बाद टीम इंडिया में हुई वापसी, उमरान को प्लेइंग इलेवन में नहीं मिली जगह</a><br /></strong></p>","content":null,"pubDate":"2022-06-09 14:38:13","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Stats: Mumbai's margin breaks 92-year-old record, Bengal batters shatter 129-year-old record - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L3N0YXRzLXJhbmppLXRyb3BoeS0yMDIxLTIyLW11bWJhaXMtbWFyZ2luLWJyZWFrcy05Mi15ZWFyLW9sZC1yZWNvcmQtYmVuZ2FsLWJhdHRlcnMtc2hhdHRlci0xMjkteWVhci1vbGQtcmVjb3JkLTEzMTkwMTTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Stats: Mumbai's margin breaks 92-year-old record, Bengal batters shatter 129-year-old record  ESPNcricinfoRanji Trophy 2022: Mumbai Records Biggest-Ever Win In First-Class Cricket | Image Of The Day  India TodayRanji Trophy: Mumbai Defeat Uttarakhand By 725 Runs, Register Highest-Ever Win Margin In First-Class..  NDTV SportsRecent Match Report - Mumbai vs Uttarakhand 2nd quarter final 2021/22-2022  ESPNcricinfoMumbai break 92-year-old record for the highest margin of victory  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-06-09 14:22:24","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Mohammad Shami: 'मुझे 4 महीने बिताने का मौका मिले तो फिर उन्हें इंडिया का बेस्ट ऑलराउंडर बना दूंगा', इस खिलाड़ी पर शमी का बयान","link":"https://www.abplive.com/sports/cricket/indian-fast-bowler-mohammad-shami-said-that-if-i-get-a-chance-to-spend-4-months-with-mohsin-khan-then-i-will-make-him-india-s-best-all-rounder-2142578","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Mohsin Khan:</strong> लखनऊ सुपर जॉइंट्स के तेज गेंदबाज मोहसिन खान ने इस आपीएल अपनी गेंदबाजी से खासा प्रभावित किया. खासकर, मोहिसिन ने अपनी स्पीड और कंट्रोल से दिग्गजों को प्रभावित किया. अब मोहसिन खान के कोच बदरूद्दीन सिद्दीकी ने बड़ा बयान दिया है. उन्होंने कहा कि भारतीय तेज गेंदबाज मोहम्मद शमी ने IPL ऑक्शन के दौरान कहा था कि अगर मोहसिन खान को उन्हें 4 महीने के लिए दे दिया जाए तो वे उन्हें भारत का बेस्ट ऑलराउंडर बना देंगे. दरअसल, उस वक्त मोहम्मद शमी ने मोहसिन खान की बल्लेबाजी की जमकर तारीफ खी थी.</p> <p style=\"text-align: justify;\"><strong>'मैं मोहसिन को इंडिया का बेस्ट ऑलराउंडर बना दूंगा'</strong></p> <p style=\"text-align: justify;\">मोहसिन खान के कोच ने उस पल को याद किया, जब IPL ऑक्शन चल रहा था उस वक्त मैं मोहम्मद शमी के साथ उसके फॉर्म हाउस में बैठा हुआ था. इस दौरान मोहम्मद शमी ने मेरे से कहा कि अगर मोहसिन के साथ मुझे 4 महीने बिताने का मौका मिले तो फिर मैं उन्हें इंडिया का बेस्ट ऑलराउंडर बना दूंगा. उन्होंने कहा कि मोहसिन खान बहुत शानदार बल्लेबाज हैं. लखनऊ सुपर जॉइंट्स के कप्तान केएल राहुल ने भी कहा था कि मोहसिन के अंदर गेम की काफी अच्छी समझ है. लखनऊ सुपर जॉइंट्स ने मेगा ऑक्शन में मोहसिन खान को महज 20 लाख रूपए में अपने नाम किया था.</p> <p style=\"text-align: justify;\"><strong>अपनी बैटिंग क्षमता से भी किया प्रभावित</strong></p> <p style=\"text-align: justify;\">IPL 2022 सीजन में मोहसिन खान का प्रदर्शन काफी शानदार रहा. इस सीजन मोहसिन ने 9 मैचों में 14.07 की ऐवरेज से 13 विकेट अपने नाम किया. जबकि इस दौरान इकॉनमी 5.97 की रही. दरअसल, कई दिग्गजों का मानना है कि अगर मोहसिन खान को सीजन की शुरूआत से खेलने का मौका मिलता तो वो टूर्नामेंट के टॉप-5 विकेट लेने वाले गेंदबाजों में होते. इसके अलावा मोहसिन खान को 3 मैचों में बैटिंग करने का मौका मिला. इस दौरान उन्होंने 23 रन बनाए, जबकि 2 पारियों में नॉट आउट रहे.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/bcci-shares-team-india-practice-session-video-before-ind-vs-sa-1st-t20-2142479\">IND vs SA 1st T20: दक्षिण अफ्रीका से मुकाबले के लिए तैयार है टीम इंडिया, वीडियो में देखें पिछले तीन दिनों की मेहनत</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-cricket-score-live-updates-india-vs-south-africa-1st-t20-live-telecast-online-2142484\">IND vs SA T20 Score Live: दक्षिण अफ्रीका ने टॉस जीतकर किया फील्डिंग का फैसला, देखें प्लेइंग इलेवन</a><br /></strong></p>","content":null,"pubDate":"2022-06-09 14:16:37","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Jay Z’s RocNation to lend Cricket SA a hand","link":"https://www.iol.co.za/sport/cricket/proteas/jay-zs-rocnation-to-lend-cricket-sa-a-hand-412e5bc1-d984-47c3-b723-c141d888ab89","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Roc Nation has already carved a niche for itself in South Africa through its backing of Springbok captain Siya Kolisi and its partnerships with the Sharks rugby union and Mamelodi Sundowns football club.","content":null,"pubDate":"2022-06-09 14:12:08","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/4c6f7df0-fcea-5a72-b144-5cc0aab067c6&operation=CROP&offset=0x101&resize=2448x1376","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"IND vs SA T20: पूर्व भारतीय खिलाड़ी का बड़ा बयान, कहा- इस वजह से रवि अश्विन को भारतीय टीम में होना चाहिए था","link":"https://www.abplive.com/sports/cricket/former-indian-cricketer-mohammad-kaif-said-that-off-spinner-ravi-ashwin-should-be-in-indian-squad-for-south-africa-t20-series-2142532","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Mohammad Kaif On Ravi Ashwin</strong>: भारतीय टीम साउथ अफ्रीका के खिलाफ 5 टी20 मैचों की सीरीज खेलेगी. इस सीरीज के लिए रोहित शर्मा, विराट कोहली और जसप्रीत बुमराह जैसे खिलाड़ियों को आराम दिया गया. जिसके बाद केएल राहुल को भारतीय टीम का कप्तान बनाया गया. लेकिन चोट के कारण केएल राहुल अब पूरी सीरीज से बाहर हो गए. केएल राहुल के बाहर के बाद ऋषभ पंत को भारतीय टीम का कप्तान बनाया गया. जबकि हार्दिक पांड्या इस टीम के उप कप्तान होंगे. आज शाम इस सीरीज का पहला दिल्ली के फिरोजशाह कोटला स्टेडियम में मैच खेला जाएगा.</p> <p style=\"text-align: justify;\"><strong>'बैटिंग में भी योगदान दे सकते हैं अश्विन'</strong></p> <p style=\"text-align: justify;\">साउथ अफ्रीका के खिलाफ इस टी20 सीरीज में रवि अश्विन भारतीय टीम का हिस्सा नहीं हैं. पूर्व भारतीय क्रिकेटर मोहम्मद कैफ का मानना है कि साउथ अफ्रीका के खिलाफ 5 टी20 मैचों की इस सीरीज में रवि अश्विन को भारतीय टीम का हिस्सा होना चाहिए. मोहम्मद कैफ के मुताबिक, रवि अश्विन पॉवरप्ले ओवर में बॉलिंग करने के अलावा जरूरत पड़ने पर बैटिंग भी कर सकते हैं. दरअसल, रवि अश्विन पिछले टी20 वर्ल्ड कप में भारतीय टीम का हिस्सा थे. पूर्व भारतीय क्रिकेटर ने कहा कि किसी लेग स्पिनर की जगह रवि अश्विन को टीम में शामिल किया जा सकता था.</p> <p style=\"text-align: justify;\"><strong>IPL में बैट और बॉल दोनों से चमके रवि अश्विन</strong></p> <p style=\"text-align: justify;\">दिग्गज भारतीय स्पिनर रवि अश्विन अब तक 86 टेस्ट मैचों में 442 विकेट अपने नाम कर चुके हैं. गौरतलब है कि पिछले टी20 वर्ल्ड कप के लिए अश्विन का 4 साल बाद भारतीय टीम में वापसी हुई थी. वहीं, इस सीजन रवि अश्विन ने राजस्थान रॉयल्स के लिए 191 रन बनाए. जबकि 17 मैचों में 12 विकेट अपने नाम किया. इस सीरीज के लिए युवा तेज गेंदबाज उमरान मलिक और अर्शदीप सिंह को भारतीय टीम में शामिल किया गया है. पूर्व भारतीय क्रिकेटर मोहम्मद कैफ ने युवा खिलाड़ियों को टीम में शामिल करने के फैसले की तारीफ की.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/fans-excited-about-first-t20-match-between-india-and-south-africa-2142495\">IND vs SA 1st T20: पूर्व क्रिकेटर ने शेयर किया मजेदार मीम्स, पहले मैच को लेकर सोशल मीडिया पर जबरदस्त उत्साह</a><br /></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/bcci-shares-team-india-practice-session-video-before-ind-vs-sa-1st-t20-2142479\"><strong>IND vs SA 1st T20: दक्षिण अफ्रीका से मुकाबले के लिए तैयार है टीम इंडिया, वीडियो में देखें पिछले तीन दिनों की मेहनत</strong></a></p>","content":null,"pubDate":"2022-06-09 14:09:12","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"}]}