{"newsArray":[{"title":"England quick shatters 25-year cricket record","link":"https://www.cairnspost.com.au/sport/cricket/outstanding-reece-topley-breaks-alltime-england-record-in-odi-triumph-over-india/news-story/7edc28fdea49fda44d22badde6022ea0","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"England has bounced back from a humiliating 10-wicket defeat against India to secure a convincing 100-run victory in the second one-day international at Lord’s, with left-arm seamer Reece Topley claiming career-best figures of 6/24.","content":"England has bounced back from a humiliating 10-wicket defeat against India to secure a convincing 100-run victory in the second one-day international at Lord’s, with left-arm seamer Reece Topley claiming career-best figures of 6/24. The 28-year-old broke the all-time England record for best bowling figures in a men’s ODI, previously held for 17 years by former all-rounder and current assistant coach Paul Collingwood. Watch South Africa’s Tour of England. Every ODI & T20 Live & On-Demand on Kayo. New to Kayo? Start your free trial now > After removing both Indian openers cheaply in the Powerplay, Topley cleaned up the tail to help roll the tourists for 146 in 38.5 overs, equalling the three-match series at 1-1. He also became the first English cricketer to take five wickets in an ODI at Lord’s since 1997, when the great Darren Gough snared 5/44 against Australia. “It’s an outstanding story, the way he’s gone through the ups and downs, the stress fractures,” former England captain Nasser Hussain told Sky Sports. “He’s bowled well in white-ball cricket of late and as well in that T20 game at Trent Bridge when everyone else was going around the park. “It’s his place now and when you get figures like that, with so many big games coming up and England are looking for bowlers with a long list of injuries … if some bowler can stand up and continue to put in performance after performance then you’re almost saying, ‘You can’t leave me out’.” Reece Topley of England celebrates after dismissing Prasidh Krishna. Photo by Mike Hewitt/Getty Images Best bowling figures for England in men’s ODIs 6/24 — Reece Topley vs IND, 2022 6/31 — Paul Collingwood vs BAN, 2005 6/45 — Chris Woakes vs AUS, 2011 6/47 — Chris Woakes vs SL, 2014 5/15 — Mark Ealham vs ZIM, 2000 India won the toss and elected to field first in London, with England registering a defendable total of 246 despite nobody in the starting XI reaching 50. All-rounders Moeen Ali and David Willey combined for a crucial 62-run partnership for the sixth wicket, scoring 47 and 41 respectively. Leg-spinner Yuzvendra Chahal claimed 4/47 in an impressive 10-over spell, including the vital wickets of Jonny Bairstow, Joe Root and Ben Stokes. In response, India crumbled to 4/31 in the 12th over, with captain Rohit Sharma and wicketkeeper Rishabh Pant both returning to the sheds without troubling the scorers. Former Indian skipper Virat Kohli was removed for 16 after fishing at a Willey delivery outside off stump — an all too familiar mode of dismissal for the 33-year-old. It extends his unwanted streak of innings in international cricket without a century to 78. Pakistan captain Babar Azam voiced his support for the Indian superstar, posting to Twitter: “This too shall pass. Stay strong.” This too shall pass. Stay strong. #ViratKohli pic.twitter.com/ozr7BFFgXt — Babar Azam (@babarazam258) July 14, 2022 Topley made his international debut in 2015, but four years of his career were blighted by injuries, with the paceman suffering four separate stress fractures of his back. “It means a lot, it makes it all worthwhile to be honest,” he said. “It is everyone’s dream to play for England. I just want to pull the shirt on as many times as I can and play my part. It is a privilege every time. “It was a terrific team performance to bounce back from defeat the other day and I’m just happy that I played my part.” England captain Jos Buttler, well-placed to assess Topley’s bowling from his position as wicketkeeper, said: “He’s a very popular member of the team and I’m delighted for him. “He’s had quite an interesting story. For him to come back from that and to take 6/24 at Lord’s is an incredibly special performance. “It’s a tribute to his perseverance and his outlook on life and the game. He’s had really tough experiences, not knowing if he would play again, and that’s given him a real sense of perspective and a real enjoyment when he’s playing. “He’s got all the attributes to be a fantastic international bowler and I’m delighted for him to get those results today.” The decisive third ODI between England and India will take place on Sunday at Old Trafford. “It’s going to be an exciting one, obviously a lot to look forward to,” Sharma said. “Quick turnaround for us, we need to regroup, understand what we didn’t do well as a team and try and see what we can do better. More Coverage Historic first as Big Bash schedule revealed Smith ‘should be banned’ for huge error “We’ll get there and see the conditions and adapt.” — with AFP Originally published as ‘Outstanding’: Reece Topley breaks all-time England record in ODI triumph over India More related stories Cricket Why ‘spiritual’ leader is not calling it quits Steve O’Keefe was cooked at the end of the last BBL season, but the veteran spinner is going around again largely for this reason. Read more Cricket Logical next step for all-conquering Aussies As Australia prepares to go for Commonwealth Games gold, captain Meg Lanning has put an Olympic medal on her agenda. Read more","pubDate":"2022-07-14 22:47:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Have your say: Should David Warner’s leadership ban lifted?","link":"https://www.cairnspost.com.au/sport/cricket/cricket-news-david-warners-leadership-ban-set-to-continue/news-story/b1f2b86516da247f0fc93895245dd3e3","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket Australia has lauded David Warner for his “outstanding’’ leadership but has declined to lift the life ban on him having an official role.","content":null,"pubDate":"2022-07-14 22:18:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"County cricket: Surrey’s Aaron Hardie earns laurels in last-gasp win over Yorkshire","link":"https://www.theguardian.com/sport/live/2022/jul/14/county-cricket-lancashire-v-somerset-glamorgan-v-nottinghamshire-live","keywords":["Cricket","County Championship","County Championship Division One","County Championship Division Two","Sport"],"creator":["Tanya Aldred"],"video_url":null,"description":"Australian all-rounder hit the winning runs on his Championship debut as the leaders beat the rain to pull off a dramatic winA couple of early wickets, one at Sophia Gardens - where Notts will do well to last the day, one at Canterbury, where Northants are now six down, with a wicket for Matt Milnes.To the business of the day: Lancashire have declared, 178 ahead. Somerset young guns, the floor is yours. Continue reading...","content":null,"pubDate":"2022-07-14 20:27:25","image_url":"https://i.guim.co.uk/img/media/490cbcc2fc068b04b81e17405fa83314ab219f35/0_43_2933_1761/master/2933.jpg?width=460&quality=85&auto=format&fit=max&s=4d812bd8f84eac03ff54a43a0a8f9d0f","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"“This too shall pass”: Babar Azam lends support to Virat Kohli after another batting failure in ENG vs IND 2nd ODI","link":"https://thesportsrush.com/cricket-news-this-too-shall-pass-babar-azam-lends-support-to-virat-kohli-after-another-batting-failure-in-eng-vs-ind-2nd-odi/","keywords":["Cricket","babar azam","India tour of England 2022","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Babar Azam lends support to Virat Kohli as latter’s lean patch of form in international Cricket continues during the second ODI at Lord’s. During the second ODI of the ongoing India’s tour of England at the iconic Lord’s Cricket Ground in London, team India were humbled by the English bowlers as they suffered a 100-run… The post “This too shall pass”: Babar Azam lends support to Virat Kohli after another batting failure in ENG vs IND 2nd ODI appeared first on The SportsRush.","content":"Babar Azam lends support to Virat Kohli as latter’s lean patch of form in international Cricket continues during the second ODI at Lord’s. During the second ODI of the ongoing India’s tour of England at the iconic Lord’s Cricket Ground in London, team India were humbled by the English bowlers as they suffered a 100-run defeat while chasing a rather ordinary target of 247. The spotlight was yet again on former team India skipper Virat Kohli, who was drafted in the playing XI after missing the first ODI due to a groin injury. Playing perhaps his most-suited format, and touted as the one that might possibly end the extended drought of international runs under his name, Kohli, after a promising start with three glorious boundaries, edged one through to the wicket-keeper to end a 16-run innings off 25 deliveries. With the team reduced to 31/4 after Kohli’s wicket, it was all but curtains for India, as eventually all they could manage was a paltry 146 in 38.5 Overs. Reece Topley was the star of the England bowling line-up, as he not only picked up his maiden six-wicket haul, but now also boasts of a career-best bowling figures (9.5-2-24-6) ever by an England player in ODIs. ALSO READ: Virat Kohli’s recent ODI form Babar Azam lends support to Virat Kohli Pakistan skipper Babar Azam, post yet another batting failure by Virat Kohli, took to his social media handle to lend a shoulder to the latter, thereby exhibiting a gem of a sporting gesture for a champion batter struggling to get back to his run-scoring ways. Babar posted a picture from last year’s T20 World Cup in UAE ahead of the India versus Pakistan encounter, with Kohli placing his right arm around Babar’s shoulder in the frame, bearing the caption – “This too shall pass. Stay strong”. This too shall pass. Stay strong. #ViratKohli pic.twitter.com/ozr7BFFgXt — Babar Azam (@babarazam258) July 14, 2022 Virat Kohli scored his last international century two-and-a half-years ago in November 2019, against Bangladesh during the day/night Test match at the Eden Gardens, Kolkata. His last ODI century too came in the year 2019 (August), against West Indies at the Port of Spain. Nothing has gone the 33-year-old’s way ever since he stepped down as the team’s T20I skipper last year, with not a single match-winning contribution coming from his end across formats. The post “This too shall pass”: Babar Azam lends support to Virat Kohli after another batting failure in ENG vs IND 2nd ODI appeared first on The SportsRush.","pubDate":"2022-07-14 20:20:32","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2nd ODI highlights 2022: Yesterday match result who won IND vs ENG 2nd ODI at Lord’s","link":"https://thesportsrush.com/cricket-news-ind-vs-eng-2nd-odi-highlights-2022-yesterday-match-result-who-won-ind-vs-eng-2nd-odi-at-lords/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs ENG 2nd ODI highlights: The home team has managed to register an unexpected victory at Lord’s tonight. During the second ODI of India’s tour of England 2022 at Lord’s, England beat India by a mammoth 100 runs to not let the third ODI at Old Trafford convert into a dead-rubber. India, who would’ve… The post IND vs ENG 2nd ODI highlights 2022: Yesterday match result who won IND vs ENG 2nd ODI at Lord’s appeared first on The SportsRush.","content":"IND vs ENG 2nd ODI highlights: The home team has managed to register an unexpected victory at Lord’s tonight. During the second ODI of India’s tour of England 2022 at Lord’s, England beat India by a mammoth 100 runs to not let the third ODI at Old Trafford convert into a dead-rubber. India, who would’ve successfully chased a 247-run target in nine out of 10 times, appeared to have been tangled by the 10th time on this particular occasion. A terrible batting performance on a batting-friendly surface saw India scoring all of 146 in 38.5 overs. Losing wickets from the third over, the Indian innings never looked like gaining any momentum on Thursday. Hence, losing out on an opportunity of gaining an unassailable 2-0 series lead. In what was his maiden ODI five-wicket haul, fast bowler Reece Topley was the pick of the English bowlers with bowling figures of 9.5-2-26-6. Readers must note that Topley’s dismissals comprised of Rohit Sharma (0), Shikhar Dhawan (9), Suryakumar Yadav (27), Mohammed Shami (23), Yuzvendra Chahal (3) and Prasidh Krishna (3). Only the fourth ODI six-wicket haul among English bowlers, Topley has registered the best-ever figures by an English bowler in this format. Therefore, it wasn’t much of a surprise that the 28-year old bowler was declared the Player of the Match for the first time in his 17-match ODI career. IND vs ENG 2nd ODI highlights In what was a day-night match for the English audiences and a night match for the Indian audiences, the latter are expected to have missed the second innings because of a late finish on a weekday. A round of applause for Reece Topley as he enters the Pavilion #LoveLords | #ENGvIND pic.twitter.com/iTrKv9jx5d — Lord’s Cricket Ground (@HomeOfCricket) July 14, 2022 While these fans can watch highlights of the second ODI by going through videos on the social media handles of England Cricket and Sony Sports Network, a special highlights package has also been uploaded on the YouTube channel of England Cricket. The post IND vs ENG 2nd ODI highlights 2022: Yesterday match result who won IND vs ENG 2nd ODI at Lord’s appeared first on The SportsRush.","pubDate":"2022-07-14 20:20:19","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Reece Topley gets best England ODI figures EVER as he takes incredible 6-24 to down India at Lord’s","link":"https://www.thesun.co.uk/sport/19205139/reece-topley-england-odi-record-india/","keywords":["Cricket","Sport"],"creator":["John Etheridge"],"video_url":null,"description":"REECE TOPLEY reaped an incredible harvest of wickets and finished with England’s best figures of all time in one-day international cricket. The 6ft 7ins left-armer took 6-24 as England crushed India by 100 runs at Lord’s in the second 50-over match. Topley’s historic elevation is a tribute to the perseverance of a man once so […]","content":"REECE TOPLEY reaped an incredible harvest of wickets and finished with England’s best figures of all time in one-day international cricket. The 6ft 7ins left-armer took 6-24 as England crushed India by 100 runs at Lord’s in the second 50-over match. Reece Topley finished with England’s best figures of all time in one-day international cricketGetty PAHe took 6-24 as England crushed India by 100 runs at Lord’s[/caption] Topley’s historic elevation is a tribute to the perseverance of a man once so distraught by his seemingly endless injuries that he feared he would never play again. He has endured a string of stress fractures and surgery and moved from Essex to Hampshire to Sussex and to Surrey in an attempt to find fitness and a permanent home. Topley, 28, is praying his torment is a thing of the past and now he has been Player of the Match in two of his last three internationals. He helped England win the third and final T20 match at Trent Bridge on Sunday with 3-22 and he doubled his haul here. READ MORE SPORT GET YOUR GOSS Cristiano Ronaldo offered £2.4m-a-WEEK, Messi new PSG deal prepared THE OPEN 2022 Cameron Young leads with McIlroy on -6 as Tiger Woods struggles at St Andrews England made only 236 all out but Topley removed both openers as England reduced India to 31-4 and kept striking on his way to analysis that overtakes Paul Collingwood’s 6-31 against Bangladesh at Trent Bridge in 2005. This victory was certainly welcome for Buttler after England lost the T20 series 2-1 and were humiliated by ten wickets at the Oval on Tuesday. Buttler said: “Toppers has been fantastic, it was a special day for him. I’m delighted for him. He’s a very popular member of the team who brings energy to the group. “He has an interesting story, coming into the game at such a young age with Essex and then all the back trouble and not knowing if he would play again. Most read in Cricket MOR THE MERRIER Jos Buttler gives Eoin Morgan two bottles of wine worth £880 JOS TRYING England in crushing ten-wicket defeat to India as Buttler's nightmare continues COW CORNER Watch hilarious fake IPL held on FARM as scammers arrested for conning bettors NEW BALLS PLEASE Watch Warner go down in pain after being hit in balls with flying BAIL VAUGHAN STEPS AWAY Vaughan steps down from BBC role after being charged in racism scandal HIT FOR SIX Chaos at England Test match vs New Zealand as fight breaks out in stands FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS “It’s given him a perspective and a real enjoyment when he is playing. He has all the attributes to be a fantastic international bowler. “We didn’t bat particularly well but still managed to get to a challenging total. We were still positive and knew we needed early wickets to put India under pressure. We showed a lot of character.” India’s top order was blown away on a two-paced pitch that offered uneven bounce. Rohit Sharma, Shikhar Dhawan, Rishabh Pant and Virat Kohli might be superstars but they had no answer to the relatively unheralded trio of Topley, David Willey and Brydon Carse. Wickets continued to fall and no Indian batsman reached 30.    Earlier, England collapsed from 41-0 to 102-5 with variations of the sweep shot frequently causing their downfall. Jason Roy clipped a catch straight to deep backward square and then Jonny Bairstow was bowled sweeping, Joe Root lbw attempting the same shot and Ben Stokes leg before aiming a reverse sweep. Wrist-spinner Yuzvendra Chahal accounted for the first three sweepers and added a fourth wicket when Moeen Ali’s slog sweep nestled in deep mid-wicket’s hands. Willey contributed 41 but Moeen’s 47 was England’s highest score. It was three years to the day since their memorable World Cup triumph in 2019 when they squeezed past New Zealand by virtue of hitting more boundaries as the match and super over were both tied. Most of the batsmen remain but, although nowhere near as bad as being routed for just 110 all out 48 hours previously, England are struggling to fire with the bat in white-ball cricket at the moment.","pubDate":"2022-07-14 20:15:05","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Topley Takes Record Figures! | Highlights - England v India | 2nd Men's Royal London ODI 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9WnEtT3RINFhpc03SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Topley Takes Record Figures! | Highlights - England v India | 2nd Men's Royal London ODI 2022  England & Wales Cricket BoardEngland beat India by 100 runs in second ODI to level series – as it happened  The GuardianReece Topley claims record six-for as England level series with Lord's hammering of India  Sky SportsReece Topley stars as England hammer India by 100 runs to square one-day series  The TelegraphEngland post 246 as they battle to keep one-day series alive against India  Alloa AdvertiserView Full coverage on Google News","content":null,"pubDate":"2022-07-14 20:06:46","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"ENG vs IND: Reece Topley registers best-ever figures by an England bowler in ODI cricket","link":"https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-reece-topley-registers-best-ever-figures-by-an-england-bowler-in-odi-cricket-1975783-2022-07-15?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Reece Topley registers best-ever figures by an England bowler in ODI cricket","content":null,"pubDate":"2022-07-14 19:30:57","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC bans Bangladesh pacer, Shohidul Islam, for failing dope test","link":"https://www.indiatvnews.com/sports/cricket/icc-bans-bangladesh-pacer-shohidul-islam-for-failing-dope-test-2022-07-15-792180","keywords":null,"creator":null,"video_url":null,"description":"The International Cricket Council is extremely strict with doping policies and anybody who falls guilty under this clause is punished severely by the global body. In recent developments, in this case, Bangladesh pacer Shohidul Islam was handed a 10-month-long ban for failing an out-of-competition dope test conducted in March. The Bangladeshi pacer's urine sample returned as positive for Clomifene which has been classified as a Specified Substance under WADA's Prohibited List. This drug has been listed as prohibited both in-competition as well as out-of-competition.","content":"The International Cricket Council is extremely strict with doping policies and anybody who falls guilty under this clause is punished severely by the global body. In recent developments, in this case, Bangladesh pacer Shohidul Islam was handed a 10-month-long ban for failing an out-of-competition dope test conducted in March. The Bangladeshi pacer's urine sample returned as positive for Clomifene which has been classified as a Specified Substance under WADA's Prohibited List. This drug has been listed as prohibited both in-competition as well as out-of-competition. \"Bangladesh pacer Shohidul Islam has been suspended for 10 months after pleading guilty to breaching Article 2.1 of the ICC Anti-Doping Code. After admitting the offense, Shohidul has been suspended from all forms of cricket for 10 months\", said ICC in a statement. While handing out the suspension, the ICC confirmed that Shohidul had inadvertently ingested the prohibited substance in the form of medicine that he had been legitimately prescribed for therapeutic purposes. Shohidul also testified that he had no intention to use the prohibited substance for performance enhancement. The 10-month suspension has been backdated to May 28, the day he admitted to the offense, meaning the Bangladesh pacer will be eligible to play from March 28, 2023. The 27-year-old pacer has played a solitary T20I for Bangladesh, where he picked up the wicket of Mohammad Rizwan in the third and final match of the series which Pakistan won 3-0. He has been part of Bangladesh's traveling squads for series against New Zealand and South Africa but did not get any game time. He was also a part of the Bangladesh Test and T20I squad for the ongoing tour of the West Indies but missed out due to a side strain. (Inputs from PTI)","pubDate":"2022-07-14 19:19:03","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"What happened to Virat Kohli: When will Virat Kohli score a century?","link":"https://thesportsrush.com/cricket-news-what-happened-to-virat-kohli-when-will-virat-kohli-score-a-century/","keywords":["Cricket","India tour of England 2022","Virat Kohli"],"creator":["Gurpreet Singh"],"video_url":null,"description":"When will Virat Kohli score a century: The former team India skipper got out cheaply during the second ODI versus England at Lord’s. During the second ODI of the ongoing India’s tour of England at the iconic Lord’s Cricket Ground in London, team India’s mainstay at number three in the batting order – Virat Kohli… The post What happened to Virat Kohli: When will Virat Kohli score a century? appeared first on The SportsRush.","content":"When will Virat Kohli score a century: The former team India skipper got out cheaply during the second ODI versus England at Lord’s. During the second ODI of the ongoing India’s tour of England at the iconic Lord’s Cricket Ground in London, team India’s mainstay at number three in the batting order – Virat Kohli headed back towards the pavilion cheaply after yet another promising start. En route the rather under par target of 247, Kohli arrived at the crease post skipper Rohit Sharma getting Out on a Duck in the third Over itself. Having taken eight deliveries to get off-the-mark, Kohli did look like getting into the groove, hitting three Fours off pacer Reece Topley to get along with his innings. However, a poke outside the off-stump channel towards wicket-keeper Jos Buttler off the same bowler, meant that Kohli’s 25-ball innings ended at the score of 16, with his team reeling at 31/4 into the 12th Over. Virat Kohli scored his last international century two-and-a half-years ago in November 2019, against Bangladesh during the day/night Test match at the Eden Gardens, Kolkata. His last ODI century too came in the year 2019 (August), against West Indies at the Port of Spain. Although he has scored 10 half-centuries post his aforementioned last ODI century, he is far from being reflective of the old, vintage Virat Kohli, who is renowned expecially for nailing the run chases with consummate ease by staying right till the end. Virat Kohli’s last century: in Tests – November 2019 (33 innings ago) in ODIs – August 2019 (23 innings ago) in T20s – none in 91 innings #Cricket #ENGvsIND — Saj Sadiq (@SajSadiqCricket) July 14, 2022 If one takes a look at Kohli’s last 20 ODI innings , an average of over 40 is enough to not draw sharp criticisms, but the bar set by King Kohli in the 43 ODI centuries which he has hit till date, is quite high for a Cricket fan to not get itchy and restless after such an extended dry spell of run-scoring form. Moreover, with him being rested for the upcoming limited-Overs series against West Indies despite the poor run-of-form, things do not look promising as far as his century, or even his next winning knock, or more worse, even his place in team India’s squad for the upcoming T20 World Cup in Australia is concerned.","pubDate":"2022-07-14 19:00:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs England 2nd ODI Live Score: Rohit falls early, ENG keep up the pressure - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMimAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pbmRpYS12cy1lbmdsYW5kLTJuZC1vZGktbGl2ZS1zY29yZS11cGRhdGVzLWluZC12cy1lbmctdG9kYXktbWF0Y2gtbGF0ZXN0LXNjb3JlY2FyZC1hdC1sb3Jkcy0xMDE2NTc3ODk3Mzg3NjkuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England 2nd ODI Live Score: Rohit falls early, ENG keep up the pressure  Hindustan TimesIndia vs England 2nd ODI Live Cricket score and ball by ball commentary: India lose Rohit, Dhawan, Pant, Kohli, SKY - Firstcricket News  FirstpostThis Indian group of white-ball experts have been built on the back of IPL: Michael Vaughan  CricTrackerIndia vs England 2nd ODI LIVE Score: Reece Topley removes Suryakumar Yadav, India five down  Times of IndiaRohit Sharma-Shikhar Dhawan reach milestone, pair complete 5000 partnership runs as openers  myKhelView Full coverage on Google News","content":null,"pubDate":"2022-07-14 18:02:56","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Why Joe Root is not playing T20 international cricket: Is Joe Root retired from T20Is?","link":"https://thesportsrush.com/cricket-news-why-joe-root-is-not-playing-t20-international-cricket-is-joe-root-retired-from-t20is/","keywords":["Cricket","Joe Root"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Why Joe Root is not playing T20 international cricket: The former England skipper played his last T20I more than three years ago. Former England Test skipper Joe Root is perhaps enjoying the best phase of his Cricketing career as far as the Test format is concerned. Back-to-back centuries in the very first couple of Tests… The post Why Joe Root is not playing T20 international cricket: Is Joe Root retired from T20Is? appeared first on The SportsRush.","content":"Why Joe Root is not playing T20 international cricket: The former England skipper played his last T20I more than three years ago. Former England Test skipper Joe Root is perhaps enjoying the best phase of his Cricketing career as far as the Test format is concerned. Back-to-back centuries in the very first couple of Tests against New Zealand after relinquishing his Test captaincy, saw Root play some outrageous shots including reverse sweeps and ramps towards the third man region for maximums. He repeated the same during the the rescheduled fifth Test against India at Edgbaston with utmost perfection, perhaps suggestive of the fact that he has all the shots in book to get back into the England T20I squad. As far as his last T2OI is concerned, the 31-year-old played it back in May 2019, during England’s lone T20I against Pakistan in Cardiff. In fact, Root made his ODI comeback too after a one-year gap in the ongoing three-match home series against India, having last played in the format against Sri Lanka in July last year. Joe Root, Jonny Bairstow and Ben Stokes will feature together in England’s ODI squad to face India. The last time they all featured together in a ODI format was day in 2019… pic.twitter.com/17ZDX095QE — bet365 (@bet365) July 12, 2022 Why Joe Root is not playing T20 international cricket Most-capped and recently retired England’s former limited Overs skipper Eoin Morgan had stated before last year’s T20I World Cup in UAE, that Root was indeed in the plans for a place in the squad. However, he ultimately failed to make the cut in the final 15-member squad. It is worth of a mention that Root was England’s highest run-scorer during the 2016 T20 World Cup in India where his team agonizingly lost to the West Indies in the final. His 249 runs across six games were scored at an average of 49.80 and an impressive strike rate of 146.67. However, it was primarily due to ECB’s rest-and rotate policy that Root had marked his unavailability in the T20 side post the grand event, and the emergence of some of the most ferocious power-hitters in the side has now made it quite challenging for Root to break it into the T20 side. Also, ever since the emergence of COVID-19, a packed international schedule has meant that Tests and limited Overs series against different teams have been taking place with very little breathing space, and with Root being a crucial part of the Test side, his entry into the T20I side had taken a further dent. However, despite it all the champion batter still is quite hopeful of breaking into the T20I side quite soon. The post Why Joe Root is not playing T20 international cricket: Is Joe Root retired from T20Is? appeared first on The SportsRush.","pubDate":"2022-07-14 18:01:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Last 10 innings of Virat Kohli ODI: Virat Kohli last 20 ODI innings score","link":"https://thesportsrush.com/cricket-news-last-10-innings-of-virat-kohli-odi-virat-kohli-last-20-odi-innings-score/","keywords":["Cricket","England","India","India tour of England 2022","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Last 10 innings of Virat Kohli ODI: The former Indian captain looked good before getting out for a low score yet again today. Walk out to bat. Look positive. Hit a few exquisite boundaries. Get out without converting a start. Repeat. If memes around the famous “Eat Sleep Repeat” format based on former India captain… The post Last 10 innings of Virat Kohli ODI: Virat Kohli last 20 ODI innings score appeared first on The SportsRush.","content":"Last 10 innings of Virat Kohli ODI: The former Indian captain looked good before getting out for a low score yet again today. Walk out to bat. Look positive. Hit a few exquisite boundaries. Get out without converting a start. Repeat. If memes around the famous “Eat Sleep Repeat” format based on former India captain Virat Kohli’s current batting template would ever be made, it would replicate the aforementioned process. Kohli, 33, managed to repeat the same in the ongoing second ODI of India’s tour of England at Lord’s. Coming out to bat at No. 3 in the third over of a 247-run chase, Kohli scored 16 (25) with the help of three fours before getting out. Kohli, who hadn’t scored a run on his first eight balls, drove England pacer Reece Topley down the ground for an elegant boundary. Topley, who continued to bowl full to Kohli in his next over, conceded two more boundaries. While Kohli’s second boundary was a replica of the first one, his third one was through the mid-off region. Three eye-catching boundaries were enough to make fans believe that Kohli has provided early signs of ending his lean patch today. While fans didn’t think twice before believing the same, Kohli ended up edging a David Willey delivery to England captain Jos Buttler behind the stumps in the 12th over. This is some spell. Kohli departs… Scorecard/clips: https://t.co/VpwTb5GMkV #ENGvIND pic.twitter.com/E9eVd3AC9a — England Cricket (@englandcricket) July 14, 2022 Beaten by his Royal Challengers Bangalore teammate on a few occasions before eventually nicking him, a dejected Kohli walked back to the pavilion post shattering hopes of his bountiful fans yet again. Last 10 innings of Virat Kohli ODI In his last 10 ODI innings, Kohli has scored 287 runs at an average and strike rate of 28.70 and 79.28 respectively. In spite of scoring four half-centuries in this period, Kohli’s <30 average doesn’t speak highly about the remaining innings. Virat Kohli last 20 ODI innings score As far as Kohli’s last 20 innings in this format are concerned, the right-handed batter has scored 803 runs at an average of 40.15 and a strike rate of 88.24 including 10 half-centuries. ALSO READ: Virat Kohli last 10 T20 innings full list A half-century every second innings is quite unreal for a cricketer but the lack of an match-winning knock justifying Kohli’s standards is further forming the impression of him struggling badly in ODIs. The post Last 10 innings of Virat Kohli ODI: Virat Kohli last 20 ODI innings score appeared first on The SportsRush.","pubDate":"2022-07-14 17:57:12","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jones wants Chappell-like England resolve","link":"https://www.perthnow.com.au/sport/rugby-union/jones-wants-chappell-like-england-resolve-c-7526025","keywords":null,"creator":["Melissa Woods"],"video_url":null,"description":"England rugby coach Eddie Jones says he wants his team to play like they own the SCG, as former Australian cricket captain Ian Chappell did during his hey-day.","content":"Eddie Jones has conjured ghosts of the SCG past to help England conquer the Wallabies in their deciding rugby Test in Sydney. The master coach has based the England team at Coogee - his former stomping ground - as preparations ramped up for Saturday's third Test, which will crown the inaugural Ella-Mobbs trophy winner. With the Test just up the road at the famous cricket ground being the first since 1986 - and possibly the last with the rebuilt Sydney Football Stadium soon to open - Jones tapped into the history of the venue as a theme for his team. He referenced the bitter 1970-71 Ashes series when England quick John Snow felled Australian tail-ender Terry Jenner, as well as NRL club South Sydney's glory days. \"It's a famous old ground and I've got great memories going out and watching Souths play - the great old days of Souths, and watching many an Ashes Test series,\" said Jones. \"I was out there when (John) Snow knocked out (Terry] Jenner and there was obviously the bit of discourse going on between the fans and John Snow. \"And I was watching when Ian Chappell strode on for his first time as Australian captain. \"That's how we want to play on Saturday, like Ian Chappell walked on the the field and owned it. \"We want to play with plenty of purpose, play with plenty of energy, play together and we're looking forward to the challenge.\" A Randwick rugby stalwart, Jones has called on some former teammates, including World Cup-winning flanker Simon Poidevin, who brought his rugby-playing son Christian to assist with training. Jones said some of his players were unaware of the cachet Poidevin senior carried. \"The younger players don't know who he is - they just see some old guy with a dog. A pretty fit old guy with a dog,\" Jones said. \"But he's chatted to a few of our players and we had almost a traditional Randwick barbecue yesterday. The only thing that was missing was the beers. \"That was good fun. It's been a really good week for the players. They've trained hard and recovered well.\" While he was in high spirits following their Brisbane win, Jones also gave the Australian team a slap, feeling the Wallabies, who only flew into Sydney from their Gold Coast camp late Thursday, could have done more to promote the game. \"I've been disappointed in the media coverage,\" he said. \"There's always a battle with NRL and AFL, isn't it? We know that. We need rugby to be bit more prominent and I think we're doing our bit. \"I've been to a charity lunch today, going out to coach in the community tonight. We're trying to build the game up - a one-all decider. There's got to be equal effort from the other team too.\"","pubDate":"2022-07-14 17:36:33","image_url":"https://images.perthnow.com.au/publication/C-7526025/7b9c6ea98c91d87d5a7783507bb0d1033112a3bc-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma ducks in international cricket: Rohit Sharma 0 out in ODI cricket full list","link":"https://thesportsrush.com/cricket-news-rohit-sharma-ducks-in-international-cricket-rohit-sharma-0-out-in-odi-cricket-full-list/","keywords":["Cricket","England","India","India tour of England 2022","Rohit Sharma"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rohit Sharma ducks in international cricket: The Indian captain failed to open his account in the second ODI. During the second ODI of the ongoing India’s tour of England at Lord’s, India captain Rohit Sharma registered a rare duck in international cricket becoming the first Indian batter to be dismissed in a 247-run chase today.… The post Rohit Sharma ducks in international cricket: Rohit Sharma 0 out in ODI cricket full list appeared first on The SportsRush.","content":"Rohit Sharma ducks in international cricket: The Indian captain failed to open his account in the second ODI. During the second ODI of the ongoing India’s tour of England at Lord’s, India captain Rohit Sharma registered a rare duck in international cricket becoming the first Indian batter to be dismissed in a 247-run chase today. Opening the batting with Shikhar Dhawan (9), Sharma started his innings by playing a maiden over off England pacer Reece Topley. India got off the mark when Sharma collected four leg byes in Topley’s second over. It was in the same over that Topley managed to beat Sharma’s attempt of driving him down the ground. Beaten on the inside edge, Sharma witnessed the ball hitting his front pad. Given out on the spot by umpire Richard Kettleborough, Sharma opted to challenge the decision after having a discussion with Dhawan. In what was a futile move, Sharma ended up losing a review for the team as the ball would’ve crashed right in the middle of his stumps. As a result, the 35-year old player returned to the pavilion after scoring 0 (10). The perfect start! Scorecard/clips: https://t.co/VpwTb5GMkV #ENGvIND pic.twitter.com/kuPcpz9xXb — England Cricket (@englandcricket) July 14, 2022 Rohit Sharma ducks in international cricket In what is Sharma’s 14th duck in ODIs, it is his 25th in international cricket. Readers must note that Sharma is way below in the list of most ducks in international cricket. Rohit Sharma 0 out in ODI cricket full list S. No. Runs Balls Dismissal Opposition Ground Year 1 0 2 Caught Sri Lanka Brisbane 2008 2 0 2 LBW Sri Lanka Dambulla 2008 3 0 2 Caught West Indies Kingston 2009 4 0 1 LBW Bangladesh Dambulla 2010 5 0 2 LBW Sri Lanka Dambulla 2010 6 0 5 Caught Australia Brisbane 2012 7 0 5 Bowled Sri Lanka Hambantota 2012 8 0 1 LBW Sri Lanka Colombo 2012 9 0 6 Run-out South Africa Melbourne 2015 10 0 2 Caught Bangladesh Mirpur 2015 11 0 3 LBW Pakistan London (Oval) 2017 12 0 6 Caught South Africa Cape Town 2018 13 0 6 Caught Australia Nagpur 2019 14 0 10 LBW England London (Lord’s) 2022 The post Rohit Sharma ducks in international cricket: Rohit Sharma 0 out in ODI cricket full list appeared first on The SportsRush.","pubDate":"2022-07-14 17:29:57","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Old Trafford Manchester pitch report: Old Trafford cricket ground pitch report India vs England 3rd ODI","link":"https://thesportsrush.com/cricket-news-old-trafford-manchester-pitch-report-old-trafford-cricket-ground-pitch-report-india-vs-england-3rd-odi/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Old Trafford Manchester pitch report: The SportsRush brings you the pitch report of England vs India 3rd ODI match. Manchester’s Old Trafford Stadium will host the 3rd and final ODI of the 3-match ODI series between England and India. The stadium was set to host the 5th test last year, but it was postponed due… The post Old Trafford Manchester pitch report: Old Trafford cricket ground pitch report India vs England 3rd ODI appeared first on The SportsRush.","content":"Old Trafford Manchester pitch report: The SportsRush brings you the pitch report of England vs India 3rd ODI match. Manchester’s Old Trafford Stadium will host the 3rd and final ODI of the 3-match ODI series between England and India. The stadium was set to host the 5th test last year, but it was postponed due to Covid. This match is definitely an important one for the Manchester board. This series has been dominated by the Indian bowlers so far, and the batters of the English team have certainly struggled. The crowd in Manchester would want to see an even encounter with the bat and the ball, and the track of Manchester will definitely want to live up to the expectations. Old Trafford Manchester pitch report The Old Trafford stadium in Manchester is one such stadium where there is help for every kind of player. This ground is famous for producing some competitive tracks in the past, and the same can be expected in this match as well. The pitch at Old Trafford is a brownish one, which will provide assistance to the batters overall. There is an even bounce on the wicket, and the batters will be able to play their shots easily by trusting the pace and bounce. However, the pacers will be able to swing the ball in the initial overs of the game. The day Eoin Morgan lit up @EmiratesOT Congratulations on a fantastic international career, @Eoin16! pic.twitter.com/sKWDzHWMdX — Emirates Old Trafford (@EmiratesOT) June 28, 2022 It has been seen that the spinners come lively in the middle-overs in Manchester, the brownish track will provide some assistance to the spinners. The last match here was played between England and Australia in 2020, where both sides scored over 300 runs, but the spinners of both sides got wickets. Overall, this track is a brilliant one to bat on overall, whereas the outfield is also very fast which makes the job of the fielders tough. The boundaries are also not that big on this ground. The weather is expected to stay clear, and the teams won’t mind batting first here. The post Old Trafford Manchester pitch report: Old Trafford cricket ground pitch report India vs England 3rd ODI appeared first on The SportsRush.","pubDate":"2022-07-14 17:18:38","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG 2nd ODI Live Score Updates: Rohit Sharma falls early, Virat Kohli in the middle - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiZWh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmRpYS12cy1lbmdsYW5kLTJuZC1vZGktbGl2ZS1zY29yZS11cGRhdGVzLTgwMjc3NDMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ENG 2nd ODI Live Score Updates: Rohit Sharma falls early, Virat Kohli in the middle  The Indian ExpressIndia vs England 2nd ODI Live Cricket score and ball by ball commentary: India lose Rohit for a duck in 247-run chase - Firstcricket News  FirstpostThis Indian group of white-ball experts have been built on the back of IPL: Michael Vaughan  CricTrackerIndia vs England 2nd ODI LIVE Score: India lose Rohit Sharma early after a nervy start  Times of IndiaLive Cricket Score - England vs India, 2nd ODI | Cricbuzz.com - Cricbuzz  CricbuzzView Full coverage on Google News","content":null,"pubDate":"2022-07-14 16:42:24","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Chahal shines as India bowl out England for 246 in second ODI","link":"https://www.thestar.com.my/sport/cricket/2022/07/15/cricket-chahal-shines-as-india-bowl-out-england-for-246-in-second-odi","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) - Yuzvendra Chahal ripped through England's middle-order as the Indian attack dominated again to bowl out the home side for 246 inside 50 overs in the second one-day international of their three-match series at Lord's on Thursday. Read full story","content":"LONDON (Reuters) - Yuzvendra Chahal ripped through England's middle-order as the Indian attack dominated again to bowl out the home side for 246 inside 50 overs in the second one-day international of their three-match series at Lord's on Thursday. Chahal ended with figures of 4-47, claiming the prized scalps of Jonny Bairstow, Joe Root and Ben Stokes in a quality display of leg-spin bowling. England were put into bat and Jason Roy was the first to depart, chipping a Hardik Pandya delivery to fine leg after a scratchy 23, while Bairstow continued his rich vein of form before being cleaned up by Chahal for a breezy 38. England's attempt to rebuild came unstuck after Chahal trapped Root (11) and Stokes (21) leg before wicket before skipper Jos Buttler missed a straight ball off Mohammed Shami (1-48) to be dismissed for four. Liam Livingstone took the attack to Pandya but the bowler got his revenge when the Lancastrian holed out in the deep after an entertaining run-a-ball 33. It took a late rally from Moeen Ali (47) and David Willey (41) to push England close to 250. India lead the series 1-0 following a thumping 10-wicket win in the opening game at the Oval. (Reporting by Dhruv Munjal in Bengaluru, editing by Pritha Sarkar)","pubDate":"2022-07-14 16:34:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/15/1659746.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"MS Dhoni and Suresh Raina photos: Legendary CSK pair spotted watching IND vs ENG 2nd ODI at Lord’s","link":"https://thesportsrush.com/cricket-news-ms-dhoni-and-suresh-raina-photos-legendary-csk-pair-spotted-watching-ind-vs-eng-2nd-odi-at-lords/","keywords":["Cricket","csk","India tour of England 2022","MS Dhoni","Suresh Raina"],"creator":["Gurpreet Singh"],"video_url":null,"description":"MS Dhoni and Suresh Raina photos: Apart from the legendary duo, former India off-spinner Harbhajan Singh was also present at the Lord’s. During the second ODI of India’s tour of England at the iconic Lord’s Cricket Ground, team India, courtesy of another clinical bowling performance have bundled up Jos Buttler’s men for 246 in 49… The post MS Dhoni and Suresh Raina photos: Legendary CSK pair spotted watching IND vs ENG 2nd ODI at Lord’s appeared first on The SportsRush.","content":"MS Dhoni and Suresh Raina photos: Apart from the legendary duo, former India off-spinner Harbhajan Singh was also present at the Lord’s. During the second ODI of India’s tour of England at the iconic Lord’s Cricket Ground, team India, courtesy of another clinical bowling performance have bundled up Jos Buttler’s men for 246 in 49 Overs. The opening bowling pair of Jasprit Bumrah (10-1-49-2) and Mohammed Shami (10-0-48-1) yet again troubled the English top-order, beating them on either side of their bat’s edges on multiple occasions, albeit with very little luck. After getting off to a decent enough start, the English batters were just not up for the leg-spin challenge, as Yuzvendra Chahal (10-0-47-4) bagged a four-fer, to puncture the spirits of the England fans, reducing them to a 148/6 at one point in time. However, a half-century stand between Moeen Ali (47 off 64) and David Willey (41 off 49) meant that the lower-middle order have now at least given some total to their bowlers to bowl before the strong Indian batting line-up. MS Dhoni and Suresh Raina photos Gracing the ongoing ODI with their presence are the legendary India and Chennai Super Kings (CSK) duo of Mahendra Singh Dhoni and Suresh Raina, who were spotted together and got themselves clicked during the England innings. Along with them, the likes of former India off-spinner Harbhajan Singh, legendary batter Sachin Tendulkar, and BCCI president Sourav Ganguly were also spotted inside the iconic venue.   View this post on Instagram   A post shared by Suresh Raina (@sureshraina3) Great watching the boys in blue @harbhajan_singh @msdhoni pic.twitter.com/1UEGAzEG7R — Suresh Raina (@ImRaina) July 14, 2022 Half of the Batch of 2011 World Cup final India team is in Lord’s: Dhoni, Sachin, Raina, Kohli, Harbhajan pic.twitter.com/3SiIgCSNop — Ishika Pandey (@Ishika_Pandey45) July 14, 2022 As for MS Dhoni, the former India skipper is currently on a vacation in the UK. The legendary cricketer had also celebrated his 41st birthday in the country, and was also seen cheering for team India during their recently concluded second and third T20I against England. Moreover, Dhoni was also spotted enjoying the Wimbledon quarter-final match between Rafael Nadal and Taylor Fritz a few days ago. The post MS Dhoni and Suresh Raina photos: Legendary CSK pair spotted watching IND vs ENG 2nd ODI at Lord’s appeared first on The SportsRush.","pubDate":"2022-07-14 16:27:20","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"England vs India: England vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/england-vs-india-live-score-over-2nd-odi-odi-46-50-updates-3158764","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.","content":"Follow the England vs India, 2022 live cricket score on Sports.NDTV.com . After 49.0 overs, England are 246. Get live score, ball by ball commentary and much more. Keep track of England vs India, 2022 today match between England and India. Everything related to England and India match will be available on Sports.NDTV.com . Stay updated with England vs India live score. Do check for England vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. ... THE RUN CHASE ... India on the other hand have shown why their bowling attack is so highly rated. They were on the money and extracted the most off the pitch. The opening bowlers were on fire and were really unlucky to not pick more wickets. Overall they conceded a few runs through short balls but bowled to a plan and kept regularly picking at the English wickets. Yuzvendra Chahal was the pick of the bowlers as he ended up taking 4 wickets while conceding only 47 runs in his full quota of 10 overs. Hardik Pandya and Jasprit Bumrah contributed with 2 wickets each and overall all the bowlers performed wonderfully to bowl out their opponents. Their batters do have an opportunity here to secure the series. Can they do so? Or will England pull off something special? We will find out. Stay tuned for the second essay! The English openers started tentatively but managed to negotiate the new ball and preserve their wickets with a little bit of luck. However, both gave away their wickets after getting off to a decent start and the batters that followed kept up with the aggressive approach but did not last long. Eventually, England found themselves reeling at 102 for the loss of 5 wickets. Liam Livingstone played a cameo and perished in a short-ball hitting competition against Hardik Pandya. It was the partnership between Moeen Ali and David Willey of 62 runs that pushed the total beyond the 200 mark. Both of them though fell short of their half centuries and now they will have to come out with some intent with the ball if they have to win this game. Rohit Sharma will be absolutely thrilled with the performance of his bowlers after winning the toss. The pitch was not as helpful as the one we saw at The Oval and despite that, they have managed to bowl out and restrict this strong English batting lineup to a total of 246. They would be silently confident of achieving this target and sealing the series. 48.6 overs (0 Run) OUT! CLEANED HIM UP! A classical Jasprit Bumrah dismissal! He finishes the innings off with a lovely delivery! A pacey, yorker-length delivery, on target this time, on the off pole. Reece Topley makes room, clears his front foot and tries to slash this away but he misses. The ball goes on to shatter the stumps. England are bundled out for 246! 48.5 overs (1 Run) Short this time, around middle. Craig Overton pulls it towards mid-wicket for a run. 48.4 overs (1 Run) Third yorker in the over! Around middle. Reece Topley knocks it towards mid on and scampers across to the other end. Virat Kohli there scores a direct hit at the non-striker's end but Reece Topley is well in! 48.3 overs (0 Run) Another one in the blockhole! This is just away from the off pole. Reece Topley once again fails to squeeze it out. 48.2 overs (0 Run) Nothing off the Free Hit! A yorker, outside off. Reece Topley fails to dig this one out. 48.2 overs (1 Run) No ball! A length ball, around middle and off. Reece Topley swings his bat at it but he fails to get any connection on that! Jasprit Bumrah has overstepped here and a no ball is called! Free Hit is coming up! 48.1 overs (1 Run) A dipping full toss, around middle and off. Craig Overton knocks it towards long on and takes a single. 47.6 overs (0 Run) Full and outside off. Reece Topley makes room and looks to hoick this one but he misses. 47.5 overs (2 Runs) Full and outside off. Reece Topley pushes it towards point for a brace. 47.4 overs (0 Run) OUT! LBW! Prasidh Krishna gets hit first wicket of the game as well and England are now 9 down! Initially, it looked like he got some bat on it, but there was a muted appeal from Prasidh Krishna there for LBW and the umpire did agree to that one! A length ball, around middle. Brydon Carse swivels and tries to pull this one but he misses and gets hit near his groin area. He departs after the umpire raises his finger! 47.3 overs (2 Runs) Fullish ball, outside off. Brydon Carse finally gets some bat onto the ball. He hits it towards point. They take a single. The fielder throws it towards the stumps at the non-striker's but he misses. The batters sneak in another run as well. 47.3 overs (1 Run) Wide! Wide of off, yorker-length delivery. Brydon Carse leaves it alone. Wide called! 47.2 overs (0 Run) Slower one, on a length. Brydon Carse looks to heave this but he misses again. 47.1 overs (0 Run) A yorker-length delivery, outside off. Brydon Carse fails to dig this one out. 46.6 overs (0 Run) OUT! CAUGHT! India have finally got rid of David Willey! But he has played a vital knock here for England! Jasprit Bumrah gets his first wicket of the game. He serves it on a length, slower in pace, around middle. David Willey looks to heave this but he gets undone by the lack of pace and ends up lobbing up towards long on. Shreyas Iyer (sub) catches it after he juggles it once. 46.5 overs (1 Run) Another slower one, on a length, outside off. Craig Overton pushes it towards point for a single. 46.4 overs (1 Run) Very full this time, around middle. David Willey knocks it towards long off for a single. 46.3 overs (0 Run) Slower one this time, full and outside off. David Willey taps it towards point. 46.2 overs (2 Runs) CLOSE CALL! On a length, around middle. David Willey heaves it towards long on. They take the first one run fast and leave the crease for the second run as well. Shreyas Iyer (sub) there collects the ball on a bounce and throws it towards Jasprit Bumrah, who fails to grab the ball. Two taken! 46.1 overs (6 Runs) SIX! BANG! These are important runs for England! Jasprit Bumrah hits the deck hard and serves a short ball, around middle. David Willey pulls it over deep square leg for a biggie. 45.6 overs (2 Runs) Two Leg byes! A yorker-length delivery, down the leg side. Craig Overton tries to squeeze this one away, but the ball goes off his pads and towards fine leg. The batters sneak in two leg byes! 45.5 overs (1 Run) Tad slower now, at 124 clicks, on a length, and on the pads. David Willey tucks it in the vacant mid-wicket region. Hardik Pandya runs there and cuts it out. Single taken! 45.4 overs (1 Run) Slightly short again, around off. Craig Overton pulls it firmly but finds Shikhar Dhawan at deep mid-wicket. Only a single! 45.3 overs (0 Run) Well bowled once again! Angling in, on a length, around middle and leg. Craig Overton pushes it back to Hardik Pandya. 45.2 overs (0 Run) Swing and a miss! Fraction shorter on this occasion, outside off, at 135 clicks. Craig Overton stays in his crease and tries to pull this but he misses. 45.1 overs (1 Run) Shorter ball, around middle. David Willey swivels and pulls it towards deep square leg for a single.","pubDate":"2022-07-14 15:55:32","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637934307239267821.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Shreyas Iyer selected for West Indies T20Is; Twitter questions selectors for backing out-of-form batter","link":"https://www.indiatvnews.com/sports/cricket/shreyas-iyer-selected-for-west-indies-t20is-twitter-questions-selectors-for-backing-out-of-form-batter-sanju-samson-2022-07-14-792140","keywords":null,"creator":null,"video_url":null,"description":"The Indian team is playing musical chairs with the Indian cricket team and the players who are gearing up for the T20I world cup. The Indian team management and the leadership group is rotating players in different series and trying to determine a perfect eleven which will take the field in the T20I world cup which is scheduled to be played in Australia later this year. After the IPL, the Indian team took on South Africa in a five-match T20I series which ended in a series draw. With the seniors rested for the Proteas series, the onus was on the youngsters to prove their mettle but they crumbled under pressure and could not perform.","content":null,"pubDate":"2022-07-14 15:35:34","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/england-vs-india-live-score-over-2nd-odi-odi-36-40-updates-3158579","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.","content":"Follow the England vs India, 2022 live cricket score on Sports.NDTV.com . After 40.3 overs, England are 207/6. Get live score, ball by ball commentary and much more. Keep track of England vs India, 2022 today match between England and India. Everything related to England and India match will be available on Sports.NDTV.com . Stay updated with England vs India live score. Do check for England vs India scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 39.6 overs (1 Run) 1 run. 39.5 overs (0 Run) No run. 39.4 overs (1 Run) 1 run. 39.3 overs (4 Runs) FOUR! Edgy runs! Length, outside off. David Willey leans to drive but the ball goes off his outside edge towards third man for a boundary. That brings up the 50-run stand between these two! 39.2 overs (1 Run) Leg bye! On a length, on the pads. Moeen Ali looks to flick this one but he misses. The ball deflects off his pads and goes towards square leg. Leg bye taken! 39.1 overs (0 Run) Swing and a miss! On a length from 'round the wicket, outside off. Moeen Ali throws his bat at it but he fails to get any connection on that one. Mohammad Shami (7-0-32-1) is back on! 38.6 overs (0 Run) Jasprit Bumrah continues bowling on a good length outside off, David Willey guides this towards point. 38.5 overs (0 Run) On a good length this time outside off, David Willey hits this towards mid off. 38.4 overs (4 Runs) FOUR! Short ball concedes another boundary! Albeit a top edge! Jasprit Bumrah hits the pitch hard on a shorter length and aims for the body. David Willey swings his bat and gets a top edge towards the fine leg boundary for four more runs! 38.3 overs (0 Run) Jasprit Bumrah goes full and on middle, takes some pace off the ball. David Willey knocks this towards cover. 38.2 overs (0 Run) Jasprit Bumrah serves this straight and on a good length, David Willey defends this to the left of the bowler. 38.1 overs (1 Run) On a good length outside off. Moeen Ali guides this to deep cover-point for a single. 37.6 overs (0 Run) Tad shorter, darting it on the pads now. David Willey hangs back and nudges it towards mid-wicket. 37.5 overs (0 Run) Change of angle now! Yuzvendra Chahal goes 'round the wicket, serves a fuller ball, outside off. David Willey leans to block this one but the ball goes off his inner half and towards square leg. 37.4 overs (0 Run) A googly, shorter one, outside off. David Willey uses the depth of the crease and blocks it out. 37.3 overs (1 Run) Loopy ball, very full, around middle. Moeen Ali knocks it down to long on for a single. 37.2 overs (4 Runs) FOUR! Top shot! Tosses it up, full, around middle, a leg-break. Moeen Ali gets down on his knee and sweeps it towards deep square leg for a boundary. 37.1 overs (0 Run) Tad quicker, full, and on the pads. Moeen Ali works it away towards mid-wicket. 36.6 overs (6 Runs) SIX! Second maximum of the over and this time from the bat of David Willey! Prasidh Krishna goes short once again and angling down leg. David Willey pulls and helps the ball on its way over the third-man fence for six more runs! The short ball may have picked up wickets but is conceding a lot of runs! 15 runs of the over from Prasidh Krishna! 36.5 overs (1 Run) Goes full outside off, Moeen Ali swings and gets an outside edge towards third man for a single. 36.4 overs (1 Run) Prasidh Krishna bangs this in short and angles it into the batter. David Willey works this away awkwardly towards square leg for a single. 36.3 overs (1 Run) Prasidh Krishna goes full outside off, Moeen Ali guides this to deep point for a single. 36.2 overs (6 Runs) SIX! What a shot! Prasidh Krishna angles this into the pads from a good length. Moeen Ali is in the perfect position to pick it up off his legs over the deep backward square leg boundary for a biggie! Moeen Ali is playing a wonderful inning here! 36.1 overs (0 Run) Prasidh Krishna serves this one on a good length outside off, Moeen Ali fends this towards backward point. 35.6 overs (0 Run) Tosses this one up, full, around middle. David Willey blocks it out. 35.5 overs (0 Run) A leg-break, on the pads, shortish ball. David Willey flicks it towards square leg. 35.4 overs (0 Run) Fuller now, slower through the air, around middle. David Willey presses forward and blocks it out. 35.3 overs (1 Run) Touch shorter, spinning in, around middle and leg. Moeen Ali works it away towards square leg for a single. 35.2 overs (0 Run) Tosses it up again, tad shorter, around middle. Moeen Ali pulls this one and finds the fielder at square leg. 35.1 overs (1 Run) Loopy ball, full, around middle. David Willey knocks it down to long on for a single.","pubDate":"2022-07-14 15:06:21","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637934277725053996.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG commentators: Sony Ten 3 Hindi commentators for IND vs ENG ODI series 2022","link":"https://thesportsrush.com/cricket-news-ind-vs-eng-commentators-sony-ten-3-hindi-commentators-for-ind-vs-eng-odi-series-2022/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND vs ENG commentators: The SportsRush present before you a list of Sony Sports Network commentators for England vs India ODIs. The Indian bowling lineup has managed to put England on the back foot for the second time in a row in the ongoing three-match ODI series. India captain Rohit Sharma winning the toss and… The post IND vs ENG commentators: Sony Ten 3 Hindi commentators for IND vs ENG ODI series 2022 appeared first on The SportsRush.","content":"IND vs ENG commentators: The SportsRush present before you a list of Sony Sports Network commentators for England vs India ODIs. The Indian bowling lineup has managed to put England on the back foot for the second time in a row in the ongoing three-match ODI series. India captain Rohit Sharma winning the toss and opting to bowl first for the second consecutive time has proved to be the right decision for him. Indian fast bowlers didn’t put on a carnage in the second ODI at Lord’s like the first one at The Oval. However, a more collective performance including domination by spinner Yuzvendra Chahal has reduced England to 148/6 in 29 overs. Been bundled out by this time after failing to cope up against seam and swing on Tuesday, English batters were mostly dismissed whilst playing their shots today. Unsuccessful attempt of a flick, slog sweep, sweep, reverse sweep and pull hurt the home team as batters were dismissed at regular intervals. India legends galore at Lord’s. @SGanguly99, @sachin_rt, @msdhoni & @ImRaina #LoveLords | #ENGvIND pic.twitter.com/XcTd6tcbIp — Lord’s Cricket Ground (@HomeOfCricket) July 14, 2022 Having bowled only a couple of overs in the first match, Chahal has been the pick of the Indian bowlers today thus far dismissing the likes of Jonny Bairstow (38), Joe Root (11) and Jos Buttler (4). IND vs ENG commentators 2022 Indian audiences, who are watching this tour on Sony Sports Network, are listening to the voices of eight former Indian cricketers who are working as commentators for the Sony. Former batters Virender Sehwag, Sanjay Manjrekar, Ajay Jadeja and Mohammad Kaif, former wicket-keeper batter Saba Karim and former fast bowlers in Ajit Agarkar, Ashish Nehra and Vivek Razdan are calling these matches from Sony’s studio in Mumbai. Readers must note that these eight aforementioned names are calling the matches on Sony Ten 3 in Hindi. Additionally, some of them are doubling up as English commentators as well. The post IND vs ENG commentators: Sony Ten 3 Hindi commentators for IND vs ENG ODI series 2022 appeared first on The SportsRush.","pubDate":"2022-07-14 14:54:33","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Lords ground size: Lords boundary length Nursery End and Pavilion End","link":"https://thesportsrush.com/cricket-news-lords-ground-size-lords-boundary-length-nursery-end-and-pavilion-end/","keywords":["Cricket","England","India","India tour of England 2022","lords"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Lords ground size: The SportsRush brings you the size of the boundaries of the Lord’s cricket ground in London. England and India are up against each other in the 2nd ODI of the 3-match ODI series at the iconic Lord’s cricket stadium. India won the toss and opted to field again, where the Indian bowlers… The post Lords ground size: Lords boundary length Nursery End and Pavilion End appeared first on The SportsRush.","content":"Lords ground size: The SportsRush brings you the size of the boundaries of the Lord’s cricket ground in London. England and India are up against each other in the 2nd ODI of the 3-match ODI series at the iconic Lord’s cricket stadium. India won the toss and opted to field again, where the Indian bowlers proved their class yet again. Yuzvendra Chahal bowled a tremendous spell, and he took the wickets of Jonny Bairstow, Joe Root and Ben Stokes in quick succession. Jasprit Bumrah and Mohammed Shami were again brilliant with their line and lengths. At the 30-over mark, England were struggling yet again in the match. The Lord’s cricket ground is one of the most iconic grounds in the world. This pitch has always been a neutral surface, where the bowlers have got their rewards for good bowling, whereas the batters can also trust the bounce on the track, and the fast outfield makes their job easier. There are some really big boundaries at the Lord’s which also bring the spinners into the match, and the bowlers can also vary their lengths accordingly. The mid-wicket boundaries of this stadium are quite large, and the bowlers can take advantage of them. This stadium is famous for producing sporting wickets. A wonderful setting 👌 #LoveLords | #ENGvIND pic.twitter.com/EX3Zv8FClG — Lord’s Cricket Ground (@HomeOfCricket) July 14, 2022 Talking about the lengths from the nursery end, the straight boundary is 84 metres long, whereas the mid-wicket and cover boundaries are 91 metres and 88 metres respectively. So, all three of the boundaries are quite big as compared to the other venues, and it is tough for the batters to clear the boundaries. The square leg and point boundaries are around 68 metres each, and this is the smallest part of the ground. Behind the wicket, the fine leg and third man boundaries are 72 metres each. So, even these boundaries are quite big as compared to any stadiums in the world.","pubDate":"2022-07-14 14:35:58","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Stars Descend At Lord's: Dhoni, Sachin, Ganguly, Harbhajan In Attendance","link":"https://sports.ndtv.com/cricket/ms-dhoni-sachin-tendulkar-sourav-ganguly-harbhajan-singh-suresh-raina-stars-descend-at-lords-see-pics-3158471","keywords":null,"creator":null,"video_url":null,"description":"Several former Indian cricket team stars including MS Dhoni, Sourav Ganguly, Sachin Tendulkar, Harbhajan Singh, Suresh Raina were present at the Lord's for the second ODI","content":null,"pubDate":"2022-07-14 14:22:36","image_url":"https://c.ndtvimg.com/2022-07/9trocre8_dhoni-raina_120x90_14_July_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC bans Bangladesh pacer Shohidul for failing dope test","link":"https://sportstar.thehindu.com/cricket/icc-bans-bangladesh-pacer-shohidul-for-failing-doping-test-cricket/article65640356.ece","keywords":null,"creator":["\n        AFP  \n    "],"video_url":null,"description":"The International Cricket Council announced a 10-month ban on Bangladesh pace bowler Shohidul Islam from all cricketing activities.","content":null,"pubDate":"2022-07-14 14:17:57","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: Cheteshwar Pujara turns BOWLER, bowls leg spin in Sussex vs Leicestershire match","link":"https://zeenews.india.com/cricket/watch-cheteshwar-pujara-turns-bowler-bowls-leg-spin-in-sussex-vs-leicestershire-2485383.html","keywords":null,"creator":null,"video_url":null,"description":"Chesteshwar Pujara turned into a leg-spinner for Sussex in a county cricket match.","content":null,"pubDate":"2022-07-14 14:15:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Indoor stadium, sports fields: Olympic transformation for inner-city raceway","link":"https://www.couriermail.com.au/sport/seq-olympics-2032/brisbane-city-council-reveals-plan-to-move-old-albion-park-raceway-to-build-breakfcast-creek-sports-precinct/news-story/05f958a605bf9ffd8776f857e19b0153","keywords":["Brisbane City","CM QLD News and Photos","Future QLD","QLD Politics","SEQ Olympics Bid 2032"],"creator":null,"video_url":null,"description":"Brisbane’s old Albion Park Raceway will be moved and the precinct around it will undergo a revolutionary transformation, with plans for a new indoor sports stadium, playing fields and community space.","content":"Brisbane Lord Mayor Adrian Schrinner will on Friday unveil plans for the “Breakfast Creek Sports Precinct” that would be built as part of the infrastructure needed for the Olympics and Paralympics in 2032.Under the proposal, Albion Park, the home to metropolitan harness and greyhound racing, would move to different venues and Brothers Rugby Union Club and its two playing fields would shift south from Crosby Park and have three new fields where the raceway is now. Albion ParkA series of multi-use sporting fields and a baseball field would also be located there. A new indoor sports centre would then be built at Brothers’ current fields on Crosby Road that would host Olympic and Paralympic basketball – and then be home to a variety of community sports after 2032, including netball, volleyball and badminton. Queensland Cricket’s Allan Border Field would remain in its current location but be boosted by additional seating.Cr Schrinner said he wanted to ensure the once in a lifetime opportunity of hosting the Games would be seized to transform the “unique” 29ha inner-city site. “This plan can be part of that legacy by transforming an under-utilised and tired area of our city into a thriving precinct that would stage local, national and international sports events all year round,” he said. Albion Park has been the home of metro harness racing since 1968 and greyhounds since the early 1990s.albion racewayA spokesman for Racing Queensland confirmed plans were under way to move the raceway, with development approvals being sought for the Greater Brisbane Greyhound Centre near Ipswich – and a new home for harness racing “being finalised”. Brothers Rugby Union president Geoff Rodgers said the move would help set the club up for the next 50 years.Queensland Cricket has a long-term vision for Allan Border Field, just reopened after $19m upgrades to lighting, irrigation and training facilities. Chief executive Terry Svenson said it would host international teams preparing ahead of the ICC World T20 Cup, as well as the Queensland Bulls and Queensland Fire team playing Marsh Sheffield Shield, Marsh One Day Cup, Women’s National Cricket League and the WBBL Brisbane Heat returning to the venue for the first time in three years for the Weber Women’s Big Bash League that will be played under lights.“Looking ahead, Allan Border Field should play a significant role in ensuring cricket is able to stage matches like the ones just mentioned once the Gabba is unavailable,” he said.“If cricket was included in the Olympics by 2032, then Allan Border Field could certainly play a role, for training or playing purposes.”Cr Schrinner said a “green spine” walkway that could host community events would run through the centre of the precinct, connecting Crosby Road to Breakfast Creek. “This is a really exciting proposal and we’ve already been working closely with the Queensland Government, Brothers Rugby and Queensland Cricket on these plans,” Cr Schrinner said.“I’m confident that this could be a sports and recreation precinct we can all be proud of, one that incorporates dedicated accessible facilities at the outset while offering expanded facilities for sports that are aiming to grow their participation among women.”Council’s economic development and Games committee chair Krista Adams said the precinct plan included an innovative water harvesting and reclamation system to help maintain the fields.Download the Courier Mail app","pubDate":"2022-07-14 13:53:00","image_url":null,"source_id":"couriermail","country":["australia"],"category":["sports"],"language":"english"},{"title":"India vs England 2nd ODI LIVE Score: Mohammed Shami Castles Jos Buttler, England Four Down - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiZmh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9lbmdsYW5kLXZzLWluZGlhLTJuZC1vZGktMjAyMi1saXZlLXNjb3JlLXVwZGF0ZXMtMzE1NzE3ONIBbGh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9lbmdsYW5kLXZzLWluZGlhLTJuZC1vZGktMjAyMi1saXZlLXNjb3JlLXVwZGF0ZXMtMzE1NzE3OC9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs England 2nd ODI LIVE Score: Mohammed Shami Castles Jos Buttler, England Four Down  NDTV SportsIndia vs England 2nd ODI Live Score: Yuzvendra Chahal removes Jonny Bairstow, England two down  Times of IndiaIndia vs England 2nd ODI Live Cricket score and ball by ball commentary: Chahal, Shami strike; England 102/4 at Lord's - Firstcricket News  Firstpost'Hopefully, He Recovers': Here's What Jasprit Bumrah Said About Virat Kohli's Availability for 2nd ODI at L  News18Rohit Sharma-Shikhar Dhawan reach milestone, pair complete 5000 partnership runs as openers  myKhelView Full coverage on Google News","content":null,"pubDate":"2022-07-14 13:38:58","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Malahide Cricket Club Ground Dublin pitch report: Ireland vs New Zealand 3rd ODI pitch report The Village","link":"https://thesportsrush.com/cricket-news-malahide-cricket-club-ground-dublin-pitch-report-ireland-vs-new-zealand-3rd-odi-pitch-report-the-village/","keywords":["Cricket","Ireland","New Zealand","New Zealand tour of Ireland"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Malahide Cricket Club Ground Dublin pitch report: The SportsRush brings you the pitch report of the Ireland vs New Zealand 3rd ODI match. Ireland will take on New Zealand in the 3rd ODI of the 3-match ODI series at the Malahide Stadium in Dublin. New Zealand have already won the initial two games, and they… The post Malahide Cricket Club Ground Dublin pitch report: Ireland vs New Zealand 3rd ODI pitch report The Village appeared first on The SportsRush.","content":"Malahide Cricket Club Ground Dublin pitch report: The SportsRush brings you the pitch report of the Ireland vs New Zealand 3rd ODI match. Ireland will take on New Zealand in the 3rd ODI of the 3-match ODI series at the Malahide Stadium in Dublin. New Zealand have already won the initial two games, and they are aiming for a whitewash, whereas the hosts are playing for respect in this match. The Blackcaps rested the majority of their main players for the series, but still, they have managed to play well. Ireland have disappointed in the series so far, and they would want to perform better here. The pitch at the Malahide Stadium in Dublin is one of the best out there for the batters. A total of 605 runs were made in the first ODI, and the batters loved batting there. The last match was an exception for the batters, but it is generally a brilliant track for the batters. A flat track is expected at the Malahide stadium, which will offer an even amount of bounce. The batters will love batting here, and they can trust the bounce of the wicket to play their shots accordingly. The outfield of the ground is quite fast as well, and once placed in the gap, it will be difficult for the fielders to stop the ball from reaching the boundary. Hear from @FinnAllen32 about developing his approach to One Day cricket and batting with skipper @Tomlatham2 . #IREvNZ pic.twitter.com/X2wYS53WMz — BLACKCAPS (@BLACKCAPS) July 13, 2022 A total of 18 ODIs have been played on this ground. Out of those 18 matches, 11 matches have been won by the chasing teams, and 7 games have been won by the teams batting first. The average 1st innings score at this ground is 267 runs. The smaller boundaries at this ground make the work even easier for the batters. In a respite for the bowlers, the pitch was offering some assistance to the pacers, and the overcast conditions can help them in this match as well. Overall, we can expect a high-scoring encounter.","pubDate":"2022-07-14 13:36:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}