{"newsArray":[{"title":"Laura Wolvaardt’s way with the bat makes SA believe we will win a World Cup","link":"https://www.dailymaverick.co.za/article/2023-02-27-laura-wolvaardts-way-with-the-bat-makes-sa-believe-we-will-win-a-world-cup/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"In the dying overs of the final of the Women’s T20 World Cup, Laura Wolvaardt provided the country with a glimmer of hope that a cricket World Cup trophy will (eventually) come to South Africa. The post Laura Wolvaardt’s way with the bat makes SA believe we will win a World Cup appeared first on Daily Maverick.","content":"When Laura Wolvaardt’s wooden blade thrashed Australian bowlers Tahlia McGrath and Georgia Wareham to all parts of the luscious Newlands cricket ground in consecutive overs at Sunday’s T20 Women’s World Cup final, belief flooded across South Africa – even if for just a short while. Laura Wolvaardt of South Africa in action against Bangladesh. (Photo: Ashley Vlotman / Gallo Images) Players of South Africa and Australia make their way on to the Newlands, Cape Town field for the ICC Women’s T20 World Cup Final on 26 February 2023. (Photo: Mike Hewitt / Getty Images) Tazmin Brits of South Africa takes a catch to dismiss Ellyse Perry of Australia during the 2023 ICC Women’s T20 World Cup final. (Photo: Ashley Vlotman / Gallo Images) Perhaps this was the moment. Just maybe, a senior South African cricket team would go where no other side has gone and clinch a cricket World Cup trophy. It wasn’t to be and she was dismissed by Megan Schutt two overs later and that hope was destroyed. And, as the old sporting adage goes: “It’s the hope that kills you.” That hope has been dangled and snatched away from South Africa’s cricket-loving public over the past month. Visit Daily Maverick’s home page for more news, analysis and investigations South Africa came into the Women’s T20 World Cup off the back of a tri-series win over West Indies and India. They defeated India in the final of the mini-competition to claim victory. The confidence-boosting win provided hope that South Africa could finally break the country’s cricket World Cup hoodoo. Just a week later, they lost the curtain-raiser of the Women’s T20 tournament to Sri Lanka by three runs – and that hope shrunk again. But the team put their World Cup goals back on track when they found their mojo against New Zealand three days later. The South Africans then only managed to scrape past Bangladesh in their final group-stage match, which made a semifinal loss seem inevitable against the then unbeaten England. But the South Africans stepped up to produce a hope-renewing six-wicket victory over the English , the second-ranked team in the world, in the semifinal. They once more instilled belief that the improbable was possible. Chloe Tryon of South Africa fields in the ICC Women’s T20 World Cup final match against Australia at Newlands Cricket Ground. (Photo: Ashley Vlotman / Gallo Images) Fast bowler Shabnim Ismail of South Africa celebrates the wicket of Georgia Wareham of Australia in the ICC Women’s T20 World Cup final at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The Proteas were always going to be the underdogs against Australia, who were battling for their sixth consecutive T20 World Cup title against a South African side making their first appearance in a final. But fans queued for hours the day before the final to secure tickets as more than 13,000 joyous supporters in Cape Town believed that this could finally be South Africa’s day after years of cricketing heartbreak. Australia posted a competitive total of 156 for four after captain Meg Lanning won the toss and elected to bat first. South Africa’s chase got off to a poor start, sitting on 22 for one after the six-over powerplay. The scoring-rate quickly shot up to more than 10 runs an over as South Africa’s hopes of a World Cup miracle slowly drifted away. Read more in Daily Maverick : “ SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown ” But once Wolvaardt finally got going and her glorious straight blade struck the white leather slung toward her into the Oaks grass embankment off Wareham’s bowling – for her third maximum – the miracle was on the cards once more. “Laura Wolvaardt, she’s a world-class player,” said Wareham after the starlet’s innings of 61 off 48 deliveries. “I was definitely nervous when she was bombing me over my head.” Her untimely dismissal meant this World Cup dream was crushed and Australia took the World Cup honours by 19 runs – but, fortunately for South Africa, Wolvaardt has many more World Cups and many more such innings in store. “You want your players to step up on the big occasion and that’s exactly what she did. She showed her class again today at just the [young] age of 23,” said Proteas captain Suné Luus after the match. “For us as a team, it’s very exciting to know that she’s going to be here for the next 10 years. I’m so excited to be next to her and see her break all the records in the near future.” Despite the loss, there remains a sense of excitement and expectation that this team, with magical players such as Wolvaardt, will seal South Africa’s first World Cup triumph when the 50-over iteration rolls around in Bangladesh next year. DM","pubDate":"2023-02-26 22:03:16","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown","link":"https://www.dailymaverick.co.za/article/2023-02-26-sa-fail-at-final-hurdle-as-australia-clinch-record-sixth-womens-t20-world-cup-crown/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Despite a valiant effort, the Proteas Women were outplayed by a confident Australian outfit, losing by 19 runs in the final at Newlands on Sunday. The post SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown appeared first on Daily Maverick.","content":"Australia captured their sixth Women’s T20 World Cup with a routine 19-run victory over South Africa at Newlands cricket ground in Cape Town on Sunday, 29 February. It was South Africa’s first appearance in a World Cup final whereas Australia were featuring in their seventh. The difference on the day was the experience of the Aussies in big-match situations. There wasn’t a major separation in performance between the two teams, but all the big moments belonged to Australia. Australia players celebrate with the trophy after winning the ICC Women ’ s T20 World Cup final against South Africa at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The first one came through luck when Australian captain Meg Lanning won the toss. She elected to bat first – a tactic both teams employed in their respective successful semifinals. Australian Beth Mooney played a sublime innings at the top of the order, striking 74 runs off 53 deliveries. Her innings contained nine fours and one six and she was ably supported by several teammates. The 156 posted by the Aussies was always going to be a daunting chase for a team playing in their first final. And so it was as every batter outside of starlet Laura Wolvaardt – who scored an incredible 61 off 48 deliveries – failed to put any runs of note on the board. South Africa’s chase got off to a characteristically measured start. But in the tense situation of a World Cup final, the pressure created by a slow start destroyed any chance of a successful run-chase by the host country. Newlands was packed for the final. (Photo: Mike Hewitt / Getty Images) Wolvaardt and Tazmin Brits scored 17 runs in the first five overs before the latter was dismissed for 10 runs off 17 balls. Every batter who came to the wicket after was immediately under pressure as the scoring rate stood at nine to the over. Stalwart Marizanne Kapp struck two quick fours, but South Africa still posted their lowest powerplay score of the tournament – 22 for one. Kapp was dismissed shortly after for a run-a-ball 11 before captain Suné Luus was run out after a terrible mix-up between herself and Wolvaardt. With South Africa well behind the required run rate, Wolvaardt and Chloe Tryon gave the capacity 13,860 Newlands crowd a glimmer of hope. Tahlia McGrath bowled two no balls in the 13th over and Wolvaardt smashed the second free hit – as a result of McGrath overstepping – for a massive six. She and Tryon took 14 off the over. The 14th and 15th over went for 25 as Wolvaardt brought up her third consecutive half century off 43 deliveries. But when the opener was trapped lbw by Megan Schutt in the 17th, it signalled the dimming of the last bit of hope for the South Africans. A couple of lusty blows by Tryon and Sinalo Jaftha at the end was not enough for South Africa to lift their first senior World Cup trophy. Australia’s comprehensive 156 for six was hard work for the No 1 team. Wickets tumbled consistently throughout their innings, but Mooney carried her bat and kept the innings together with typically sublime stroke-making. Australia had an uncharacteristically circumspect powerplay – not playing any shots of authority, but still capitalising on the loose balls. Healy and Mooney helped guide the cautious start to 36 for no loss. Healy mistimed a shorter wide ball by Kapp straight to Nadine de Klerk at cover, who took an easy catch. Shabnim Ismail cranked up the pressure by bowling the first maiden of the tournament in the sixth over to restrict Australia to 36 for one, their lowest powerplay total of the tournament. Surprisingly, Lanning pushed herself down the order from No 3, where she has batted throughout her career. She sent in big-hitter Ashleigh Gardner, who was carded to come in at No 4, ahead of her. The experiment paid off as Gardner took to the spin of Nonkululeko Mlaba and the medium pace of De Klerk. She hit Mlaba for consecutive fours before playing two elegant drives for six off De Klerk – one over mid-off and one over cover, helping Australia to 73 for one after 10 overs. Captain Luus turned to her experienced players in Kapp and Tryon as the former built pressure with tight lines and lengths before the latter struck the telling blow, dismissing Gardner for 29 off 21 deliveries. The thunderous ball striker tried to go downtown again, but only managed to sky it to Luus at long off. Nonkululeko Mlaba of South Africa celebrates taking the wicket of Grace Harris of Australia during the ICC Women’s T20 World Cup final at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The pair of Mooney and Gardner shared a 46-run, 41-delivery second-wicket partnership. Australia’s go-to finisher Grace Harris then strutted in at No 4, but was soon back in the sheds after running past a Mlaba delivery that knocked her leg stump bail off its groove. Visit Daily Maverick’s home page for more news, analysis and investigations When Lanning finally joined Mooney at the crease at No 5, Kapp employed a short ball tactic to the captain which restricted the scoring. The tactic worked a treat and Lanning holed out off another Kapp short ball to Tryon at square leg, who took a tidy catch, sliding to her left. Mooney, from the other end, continued on her merry way, bringing up a second half-century in two games after scoring 54 off 37 in the semifinal against India. This one was more erratic, coming off 44 deliveries, but it was equally important for her team. From that point, the No 2-ranked batter in the world opened her shoulders and scored her next 24 runs in only nine deliveries. South Africa maintained a slow over rate throughout Australia’s innings and they could have only three fielders outside the inner ring by the final over, which was bowled by Ismail. That 20th over had it all. Mooney struck the first ball for a massive six before thwarting the second for an elegant four – both straight down the ground. She was then dropped at backward point by Wolvaardt on the third delivery before Ismail went bang-bang. She first dismissed Ellyse Perry with a slower ball that was caught by Brits, and then she cleaned up Georgia Wareham with an on-pace delivery on the fourth and fifth delivery. Perry’s wicket took Ismail to the outright leading wicket-taker in Women’s T20 World Cup history with 42, and Wareham’s scalp took her to 43. With Ismail on a hat-trick on the final delivery, Tahlia McGrath, the No 1 ranked T20 batter in the world who strangely came in at eight – managed to get some bat on the last ball and take her side to 156. DM","pubDate":"2023-02-26 21:00:22","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Schutt's relief at overcoming 'scary' spell to win Cup","link":"https://thewest.com.au/sport/cricket/schutts-relief-at-overcoming-scary-spell-to-win-cup-c-9878564","keywords":null,"creator":["Annesha Ghosh"],"video_url":null,"description":"Australia pace bowler Megan Schutt reckons their T20 World Cup win didn't come easily as they had to overcome a \"scary\" spell before lifting the trophy.","content":"Megan Schutt has admitted her relief that Australia overcame a \"scary\" spell when it felt their T20 World Cup victory might just be slipping away - and was adamant that their relentless winning streak never feels boring. Before her team went on to annex a sixth title in Cape Town on Sunday, South Africa's attacking 55-run fourth-wicket stand in their chase had put Australia \"under the pump\" in the final, reckoned Schutt. But with the game threatening to swing the hosts' way at the death at Newlands, it was Schutt herself who speared in a momentum-changing full ball in the 17th over which got things back on track for the serial winners. The delivery trapped opener Laura Wolvaardt lbw, breaking the half-centurion's fifty stand with Chloe Tryon, and it led to South Africa eventually falling 19 runs short. \"She (Wolvaardt) was hitting them bloody nicely - and so was Chloe,\" reflected Schutt, who shares the Adelaide Strikers dressing room with Wolvaardt. \"So, it was honestly quite scary there towards the end. \"We were under the pump, don't get me wrong ... she probably tried to play me too square and that did her in but she was hitting down the ground beautifully. Crucial wicket, but just lucky that it came off.\" Schutt, who was part of the Australian side that botched a 148-run defence in the 2016 T20 World Cup final against West Indies, said winning three 20-over world titles since then has been gratifying. \"Pretty bloody special. I mean, people keep having digs at us that winning is boring - but it's not boring for us,\" the 30-year-old said. \"Every time that we come, we come to win and this is another one we got to do in front of a crowd that felt like bloody 70,000 people. It was so damn loud, so really cool.\" Schutt took 4-0-23-1 in the final, a momentous day for the team that coincided with Meg Lanning's personal milestone of 100 T20Is as captain. Schutt attributed a large part of the team's success on the day, and across major events in recent years, to Lanning's equanimity. \"I think because she's a pretty calm character kind of rubs off on us,\" Schutt said. \"She presents this calmness. I mean, her chat before this game was cool because it was a bit more ampie, a few swear words in there - Meg doesn't swear a lot! - so that was really cool. \"She's been a leader for so long that she knows what people need to succeed -- whether that's individually or as a team.\" Head coach Shelley Nitschke also had praise for Alyssa Healy, who stood in for Lanning during her five-month break. \"Alyssa has done a fantastic job in her absence,\" Nitschke said. \"But I think Meg coming back had the team really lift, she's such a strong leader. \"I think the difference with her is now she's just back and she's just enjoying herself. She's enjoying her cricket. \"She's laughing out there, which is pleasing for everyone and we're just happy to see that.\" The day was doubly special for Nitschke, too. Having won her first World Cup as a player in South Africa 18 years ago, the 46-year-old has now added a world title to her CV as Australia's head coach, after replacing Matthew Mott in the job last year. \"It's an amazing feeling. The first one I won as a player was the first one I've been involved in as a coach, so I guess it's gone full circle.\" Sign up for our emails","pubDate":"2023-02-26 20:35:08","image_url":"https://images.thewest.com.au/publication/C-9878564/f631ddbf5b85e09466a48004c59ba5cb9c0a92da-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Shaheen Afridi PSL 8: Mohammad Haris bat breaks into two pieces by Shaheen Shah Afridi express pace in PSL 2023","link":"https://thesportsrush.com/cricket-news-shaheen-afridi-psl-8-mohammad-haris-bat-breaks-into-two-pieces-by-shaheen-shah-afridi-express-pace-in-psl-2023/","keywords":["Cricket","Videos","Lahore Qalandars","Mohammad Haris","Pakistan Super League","Peshawar Zalmi","PSL 2023","PSL 8","Shaheen Shah Afridi"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Peshawar Zalmi wicket-keeper batter Mohammad Haris (0) has become the latest victim of Lahore Qalandars captain Shaheen Shah Afridi’s new-ball spectacle. Perhaps the most embarrassing outing of Haris’ career especially during a televised match saw him looking absolutely clueless on both the balls that he faced off Afridi. Opening the batting with captain Babar Azam… The post Shaheen Afridi PSL 8: Mohammad Haris bat breaks into two pieces by Shaheen Shah Afridi express pace in PSL 2023 appeared first on The SportsRush.","content":"Peshawar Zalmi wicket-keeper batter Mohammad Haris (0) has become the latest victim of Lahore Qalandars captain Shaheen Shah Afridi’s new-ball spectacle. Perhaps the most embarrassing outing of Haris’ career especially during a saw him looking absolutely clueless on both the balls that he faced off Afridi. Opening the batting with captain Babar Azam (7), Haris’ attempt to defend an Afridi delivery on the first ball of the innings saw his bat breaking into a couple of pieces. Haris, who was pretty much left with only the handle in his hand, had no option than to immediately ask for a new bat. Haris, however, couldn’t make use of the new bat either as he failed to make contact with the ball on the following delivery. A pinpoint in-swinging yorker targeted at hitting the stumps achieved its target after the right-handed batter played all around a ball which would’ve been difficult to just defend. Chasing a gargantuan 242-run target, Zalmi put on display a disastrous start on the back of losing their opening batters within the first three overs. It was on the penultimate delivery of his second over that Afridi produced a near-replica of Haris’ dismissal to send Azam back to the pavilion for the second time in the history of the PSL. First ball: Bat broken ⚡ Second ball: Stumps rattled 🎯 PACE IS PACE, YAAR 🔥🔥 | | — PakistanSuperLeague (@thePSLt20) Shaheen Shah Afridi 🫡 — Shai Hope (@shaidhope) Afridi, 22, ended up picking his fifth T20 five-wicket haul in a prototypical lead-from-the-front effort. In what was his second five-fer in the PSL, it witnessed the left-arm bowler also dismissing the likes of Wahab Riaz (0), Saad Masood (16) and James Neesham (12). It is worth noting that Qalandars beat Zalmi by 40 runs in the recently concluded 15th match of the ongoing eighth season of the Pakistan Super League. First PSL 8 match at the Gaddafi Stadium, it was a high-scoring entertainer allowing the home team to register the in the history of the tournament. A shambolic start was recovered to a large extent due to individual half-centuries by PZ batters Tom Kohler-Cadmore (55) and Saim Ayub (51). However, the duo falling within six deliveries after sharing a 44-ball 91-run third-wicket partnership led to the team’s downfall especially with the middle-order not contributing as per the need of the hour. Afridi’s decision of batting first after winning the toss was well-supported by his batters as Fakhar Zaman (96) and Abdullah Shafique (75) stitched a 69-ball 120-run second-wicket partnership before wicket-keeper batter Sam Billing (45*) put on board an apt finishing act. Only the second PSL 2023 double-header day, the above mentioned contest followed Karachi Kings vs Multan Sultans afternoon match. Fumbling big time to get bundled out for 101 in 16.3 overs in a 168-run chase, Sultans lost that match by as many as 66 runs at the National Stadium.","pubDate":"2023-02-26 19:10:35","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"News24.com | 'It was the most special day': Skipper Luus proud of Proteas despite World Cup heartache","link":"https://www.news24.com/sport/Cricket/Proteas/it-was-the-most-special-day-skipper-luus-proud-of-proteas-despite-world-cup-heartache-20230226","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Sune Luus expressed her pride in her teammates after they lost their T20 World Cup final to Australia.","content":"The wait for a first-ever Cricket World Cup trophy continues for South Africa, but Proteas women's captain, Sune Luus, says she is immensely proud of what her charges achieved at their home T20 showpiece. READ | Heroic Proteas fall short in World Cup final despite Wolvaardt fireworks South Africa lost by 19 runs to six-time champions Australia in the T20 World Cup final at Newlands on Sunday, bringing the curtain down on an epic campaign that ended with 14 000 packing into the iconic stadium to support this side as they broke barriers. No Proteas side had ever contested a World Cup final, and very few would have predicted that the Proteas would be the first to do it here. They were overwhelming underdogs in their semi-final against England at the same venue on Friday, but they got over that hurdle only to meet the greatest women's cricket side in history in the tournament decider. Australia have played in the last six T20 World Cup finals, and while they were certainly pushed by the Proteas at times on Sunday, they were largely comfortable in getting over the line. What is of far more significance, though, is that this Proteas side stunned the cricketing world on their journey, winning over an often sceptical South African public in the process. The crowd on Sunday roared throughout, cheering every run that came off a South African bat. That, Luus says, is the takeaway from this tournament. \"I'm definitely proud of every teammate of mine. We've done an incredible job to get to the final, and I think to put up a fight against a team like Australia ... I just feel really proud,\" she told media after the match. \"It was the most special day we could ask for. When we started this tournament, I don't think this was something we envisioned. \"We were hoping it wasn't going to be too embarrassing with empty stadiums. We just hoped a few people would come to the games, so to see this has been next-level. \"The country was really behind us, and it was something we never really thought would happen. It was such an honour to have that opportunity to inspire a nation and to have them come out and watch us play - it was such a blessing.\" The Proteas were naturally disappointed at the end of the occasion, but Luus herself said she had been largely composed. \"You always think about a World Cup final and what it will feel like, but I was pretty chilled throughout the day. I still watched a couple of movies this morning,\" she said. \"You go through waves. There are excitement levels and a few nerves here and there. We obviously thought we had a chance while we were batting, so it obviously gives you that extra bit of excitement. \"We would have loved to win, but for us to play in a final with a sell-out crowd was amazing. \"We got a sniff of how a final is, and we now have the heartache of not winning a final. At next year's World Cup, when we get there again, it's not going to be a big thing for us anymore. \"This was a massive opportunity for our girls and they did extremely well. We gave them (Australia) a good run for their money. It obviously wasn't the result we wanted, but I just have positive feelings right now.\" The skipper also congratulated the Australians while acknowledging that South African cricket still had a long way to go from a professionalism point of view. \"They're a well-oiled machine,\" Luus said. \"Their level of professionalism is insane, and they're a team the world has been looking up to for a very long time. They're there for a reason. \"If you look at their structures and pipelines, everything is just lining up and everything is in order. It's something as a country we're definitely striving for.\"","pubDate":"2023-02-26 19:00:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"मुंबई इंडियंस को लगा बड़ा झटका, आईपीएल 2023 से बाहर हो सकते हैं जसप्रीत बुमराह, सामने आई बड़ी अपडेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jasprit-bumrah-likely-to-miss-ipl-2023-due-to-injury-reports/articleshow/98255997.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और मुंबई इंडियंस के चाहने वाले जसप्रीत बुमराह के चोट से उबरने का बेसब्री से इंतजार कर रहे हैं। लेकिन अब ऐसी खबर सामने आ रही है कि जिसे सुनकर भारतीय क्रिकेट टीम और मुंबई इंडियंस के फैंस के होश उड़ जाएंगे। दरअसल, बुमराह को अभी ठीक होने में अधिक समय लगेगा।","content":"भारतीय क्रिकेट टीम के अनुभवी तेज गेंदबाज जसप्रीत बुमराह सितंबर 2022 से क्रिकेट के मैदान से दूर चल रहे हैं। कमर में लगी चोट के कारण उन्होंने लंबे समय से अंतरराष्ट्रीय क्रिकेट नहीं खेला है। हालांकि पहले कयास लगाए जा रहे थे कि जस्सी बॉर्डर गावस्कर ट्रॉफी तक पूरी तरह से ठीक हो जाएंगे। लेकिन ऐसा नहीं हुआ। वहीं उसके बाद कहा जाने लगा कि आईपीएल 2023 के शुरू होने तक बुमराह फिट हो जाएंगे। लेकिन अब उनको लेकर जैसी खबरें सामने आ रही हैं, उससे न तो भारतीय टीम खुश होगी और न तो मुंबई इंडियंस। मीडिया रिपोर्ट्स के अनुसार, भारतीय टीम और मुंबई इंडियंस के स्टार तेज गेंदबाज जसप्रीत बुमराह का आईपीएल 2023 तक फिट होना मुश्किल है। वहीं खबरें यह भी हैं कि जून में खेले जाने वाले आईसीसी वर्ल्ड टेस्ट चैंपियनशिप 2023 के फाइनल तक भी जस्सी फिट नहीं हो पाएंगे। जोकि भारतीय टीम और मुंबई इंडियंस के लिए चिंता का विषय है। ऐसा भी बताया जा रहा है कि बुमराह की चोट जैसी शुरुआत में सोची जा रहा थी उससे कई अधिक गंभीर है, गौरतलब है कि बुमराह पीठ की चोट से उबरने में सहज महसूस नहीं कर रहे हैं। रिपोर्ट्स के मुताबिक, भारतीय मैनेजमेंट अब जसप्रीत बुमराह को अक्टूबर-नवंबर तक भारत में होने वाले वनडे विश्वकप से पहले फिट करने की योजना बना रहा है। क्योंकि बुमराह भारत के मुख्य खिलाड़ियों में से एक हैं। भारत को अगर आगामी वनडे विश्वकप जीतना है तो बुमराह का टीम में होना उतना ही जरूरी है जितना कप्तान रोहित शर्मा और विराट कोहली का है। बुमराह के अगर इंटरनेशनल करियर की बात करें तो, उन्होंने भारत के लिए 30 टेस्ट, 72 वनडे और 60 T20 मुकाबले खेले हैं। जिसमें जसप्रीत ने क्रमश: 128, 121 और 70 विकेट झटके हैं। वहीं अपने आईपीएल करियर में जसप्रीत बुमराह ने खेले गए 120 मैचों में मुंबई इंडियंस के लिए 145 लिए हैं।","pubDate":"2023-02-26 18:46:04","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"टीम की हार में भी इतिहास रच गई शबनिम इस्माइल, टी20 विश्व कप में बनी सफल गेंदबाज","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/shabnim-ismail-became-the-highest-wicket-taker-in-t20-world-cup-south-africa-lost-to-australia-in-final/articleshow/98255728.cms","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's T20 WC: आईसीसी महिला टी20 विश्व कप 2023 के फाइनल में साउथ अफ्रीका को 19 रन से हार का सामना करना पड़ा। इस मैच में साउथ अफ्रीका की तेज गेंदबाज शबनिम इस्माइल ने शानदार गेंदबाजी। इसके साथ ही उनके नाम एक बड़ा रिकॉर्ड भी दर्ज हो गया। शबनम टी20 विश्व कप में सबसे अधिक विकेट लेने वाली गेंदबाज बन गई हैं।","content":"आईसीसी महिला टी20 विश्व कप 2023 के फाइनल में साउथ अफ्रीका को ऑस्ट्रेलिया के खिलाफ 19 रनों से करारी हार मिली। इस मैच में साउथ अफ्रीका के सामने 157 रनों का लक्ष्य था लेकिन वह 20 ओवर में 6 विकेट के नुकसान पर 137 रन ही बना सकी। हालांकि टीम को फाइनल में हार जरूर मिली और वह चैंपियन नहीं पाई लेकिन तेज गेंदबाज शबनिम इस्माइल के नाम एक विश्व रिकॉर्ड दर्ज हो गया। शबनिम ने मैच में साउथ अफ्रीका के लिए 4 ओवर में 26 रन देकर दो विकेट अपने नाम किए। इसके साथ ही शबनिम के नाम टी20 विश्व कप के इतिहास में सबसे अधिक विकेट लेने का रिकॉर्ड दर्ज हो गया है। शबनिम टी20 विश्व कप में 32वां मैच खेलने उतरी थी। इस तरह आईसीसी के टूर्नामेंट में उनके नाम 43 विकेट दर्ज हो गए हैं। इस मामले में शबनिम ने इंग्लैंड की आन्या श्रबसोल को पीछे छोड़ा जिन्होंने टी20 विश्व कप में 41 लिए थे। हालांकि शबनिम की इस दमदार खेल के बावजूद साउथ अफ्रीका की टीम पहली बार विश्व चैंपियन बनने से चूक गई। साउथ अफ्रीका को फाइनल मैच में 19 रन से हराकर छठी बार टी20 विश्व कप की ट्रॉफी को उठाया। ऑस्ट्रेलियाई टीम सातवीं बार फाइनल में पहुंची थी। टी20 विश्व कप 2023 में ऑस्ट्रेलिया की टीम को एक भी मुकाबले में हार का सामना नहीं करना पड़ा। सेमीफाइनल में भारत के पास मौका था कि वह ऑस्ट्रेलिया को हरा कर फाइनल में अपनी जगह बनाती लेकिन यहां भी कंगारू टीम ने बाजी मार ली और भारत को हरा दिया। ऑस्ट्रेलिया के लिए फाइनल मैच में ओपनर बल्लेबाज बेथ मूनी धमाकेदार बल्लेबाजी की थी। मूनी ने 53 गेंद में शानदार 74 रनों की पारी खेली जिसमें उन्होंने 9 चौके और 1 छक्का भी लगाय। मूनी की इस बल्लेबाजी के कारण ही ऑस्ट्रेलिया की टीम ने 156 रन के स्कोर पर पहुंच पाई। मूनी के अलावा एश्ले गार्डनर ने भी 29 रनों का महत्वपूर्ण योगदान दिया। वहीं विकेटकीपर बल्लेबाज एलिसा हिली ने भी 17 रनों की पारी खेली।","pubDate":"2023-02-26 18:15:19","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"सेमीफाइनल में भारत को जख्म देने वाली गार्डनर ने फाइनल में भी किया कमाल, बनी प्लेयर ऑफ द टूर्नामेंट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ashleigh-gardner-won-player-of-tournament-award-icc-t20-women-worldcup-2023/articleshow/98255642.cms","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया ने आईसीसी टी20 विश्वकप 2023 के फाइनल में मेजबान दक्षिण अफ्रीका को 19 रन से करारी शिकस्त दी है। जिसके चलते वह छठी बार वर्ल्ड चैंपियन बन गए हैं। वहीं एश्ले गार्डनर को उनकी पूरे टूर्नामेंट में जबरदस्त परफॉरमेंस के लिए \"प्लेयर ऑफ द टूर्नामेंट' के अवॉर्ड से भी नवाजा गया है।","content":"दक्षिण अफ्रीका और ऑस्ट्रेलिया के बीच महिला टी20 विश्वकप 2023 का फाइनल मुकाबला 26 फरवरी रविवार को केपटाउन के न्यूलैंड्स क्रिकेट ग्राउंड में खेला गया। जिसमें ऑस्ट्रेलिया ने मेजबानों को 19 रन से मात दी और छठी बार आईसीसी टी20 महिला वर्ल्डकप की चमचमाती ट्रॉफी अपने नाम कर ली। वहीं कंगारू टीम की स्टार ऑलराउंडर एश्ले गार्डनर को 'प्लेयर ऑफ द टूर्नामेंट' चुना गया। जिसके बाद उन्होंने बड़ा बयान भी दिया है। ऑस्ट्रेलिया क्रिकेट टीम की स्टार ऑलराउंडर एशले गार्डनर ने प्लेयर ऑफ द टूर्नामेंट चुने जाने के बाद कहा कि वे (ऑस्ट्रेलिया टीम) पिछले विश्वकप के बाद से ही इस वर्ल्डकप को जीतने के बारे में बात कर रहे थे। साथ ही उन्होंने इस बात का भी जिक्र किया कि वह इस टूर्नामेंट में कई चरणों में जीतने की स्थिति में नहीं थे। एश्ले गार्डनर ने कहा ' हम पिछले विश्व कप के बाद से इस पल के लिए तरस रहे थे। हम कुछ फेजिज में जीतने की स्थिति में नहीं थे।' आपको बता दें कि भारत और ऑस्ट्रेलिया के बीच खेले गए विश्वकप के पहले सेमीफाइनल में एश्ले गार्डनर ने अपनी टीम के लिए बल्ले से महत्वपूर्ण पारी खेली थी। उन्होंने 5 चौकों की मदद से महज 18 गेंदों में 31 रन जड़े थे। इस दौरान उनका स्ट्राइक रेट 172.72 का था। एश्ले ने भारत के खिलाफ खेली गई इस पारी को टूर्नामेंट की अपनी सबसे बेहतरीन पारी माना है। उन्होंने कहा, 'भारत के खिलाफ सेमीफाइनल में बल्ले से प्रदर्शन मेरे लिए इस टूर्नामेंट का सर्वश्रेष्ठ था। हमने यह टूर्नामेंट जीत लिया है। हमने ऐसा करने के बारे में बात करते थे, इसलिए वास्तव में मुझे गर्व है। मेरी गेंदबाजी में विश्वास है। मैंने बिग बैश में भी काफी गेंदबाजी की थी। शुक्र है कि मेरी फॉर्म इंटरनेशनल क्रिकेट में भी आ गया।' एश्ले गार्डनर ने टी20 वर्ल्डकप 2023 में खेले गए 6 मुकाबलों में 12.50 की औसत से गेंदबाजी करते हुए 10 विकेट झटके। तो वहीं बल्ले से उन्होंने कुल 110 रन भी बनाए। एश्ले का प्रदर्शन दक्षिण अफ्रीका के खिलाफ फाइनल में भी सांतवे आसमान पर था। उन्होंने पहले बल्लेबाजी करते हुए 29 रन की अच्छी पारी खेली। फिर उसके बाद 4 ओवर में सिर्फ 20 रन देकर 1 बहुमूल्य विकेट भी झटका।","pubDate":"2023-02-26 18:02:17","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Who would you pick? Spin trio set for Indore, Renshaw on the outer","link":"https://www.theage.com.au/sport/cricket/who-would-you-pick-spin-trio-set-for-indore-renshaw-on-the-outer-20230226-p5cnoj.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"The Age and The Sydney Morning Herald convened a selection panel of former greats to pick a team to claw back some momentum when the India Test series resumes on Wednesday.","content":"Scroll down to see who our panel of selection experts has picked for the third Test, starting Wednesday in Indore. And have your say by voting for your preferred XI. Delhi: Barring an unexpectedly grassy pitch, Australia are set to keep their seldom-seen spin trio configuration in concert with the recalled Cameron Green and Mitchell Starc for the Indore Test. Australia went 2-0 down to India in a hectic second Test match in Delhi, but it was not the returns of the three spinners Nathan Lyon, Todd Murphy and Matt Kuhnemann that put them there. Todd Murphy leaps with joy after Matt Kuhnemann claims Virat Kohli for a maiden Test wicket. Credit: Getty Images. A selection of experts polled by The Age and The Sydney Morning Herald have pointed strongly towards the retention of three spinners now that Green and Starc are available. Mark Taylor, Brad Haddin, Matthew Hayden and Mitchell Johnson all included Murphy, Kuhnemann and Lyon in their teams. The record of the central Indian venue, switched for Dharamshala at late notice by the BCCI, is one of sharp spin and lavish returns for Ravichandran Ashwin in particular. With that in mind, Starc and Green loom as enablers for the retention of Kuhnemann and Murphy alongside senior spin bowler Lyon. Of the experts consulted, only former Australian captain and selector Greg Chappell argued for the choice of a second specialist fast bowler, naming Scott Boland ahead of Kuhnemann. “Pick our best bats and best bowlers, play to our strengths and bat with more discipline,” Chappell explained. Johnson came through with the other outlier, suggesting Travis Head should captain the side rather than Steve Smith. Peter Handscomb, who has acquitted himself ably with the bat in the first two Tests without going on to a century, stated that Murphy and Kuhnemann should be persevered with after what they showed together in Delhi. “We had a debutant and a second-gamer bowling in tandem trying to win a Test match for Australia, and it’s not often that happens,” Handscomb said. “I was excited for those two boys, and they’ll both be better for it. They bowled very well, and they’ll get more rewards if we keep backing it all in. “There’s a lot of excitement as well with the first two games. It’s so fickle, small moments over here can mean a big difference, so yes we’ve lost these two Tests, once very convincingly and in the other we were in a very good position, but it’s only small moments that would change that to a win for us.” Starc bowled quickly and well in Australia’s final Delhi training session before flying to Indore on Sunday afternoon, while Green also showed decent rhythm when bowling almost exclusively around the wicket to the touring side’s left-handers. Selection intrigue: Cameron Green. Credit: Getty Images With Pat Cummins out of the Test and possibly the series as he spends precious time at home with his mother in palliative care, Australia’s options for Indore are somewhat simplified. Head is set to keep opening alongside Usman Khawaja, while David Warner spends time at home as his fractured elbow heals. Green is certain to replace Matt Renshaw after the Queenslander’s underwhelming displays in the first two Tests, the second where he played one innings as a concussion substitute for Warner. While highly rated as a long-term player for the future, Renshaw’s three innings in India so far have been characterised by imprecision in dealing with his first few balls, resulting in a trio of lbw dismissals: once to Ravindra Jadeja and twice to Ashwin. The only other options in the squad are the back-up pace bowlers Boland and Lance Morris, who remained in India on standby for the event of Cummins not returning in time for the Indore Test. But their chances of playing rest chiefly on scenarios where there is either an injury to one of the first-choice bowlers, or the surface happens to exhibit the sorts of lively qualities enjoyed by the Australian XI that beat India in Nagpur in 2004 to seal the team’s only Test series win in India for the past 50 years. Taylor’s team Mark Taylor wants to see the best four bowlers picked for the conditions, meaning that in the event of a spinning track, Matt Kuhnemann plays, but if there is some help for the seamers, Scott Boland takes his place. Travis Head is opening only as a stopgap on south Asian pitches: a long-term replacement for Warner still needs to be found. Haddin’s team A very similar configuration to Taylor’s, favouring the three spin bowlers alongside Cameron Green and Mitchell Starc. It’s a long way from the teams fielded on Haddin’s 2008 tour of India, where Cameron White was the sole chosen spin bowler for three Tests, before Jason Krejza made his Nagpur debut in the last. Chappell’s team Picking the best bowlers available is a key tenet of Greg Chappell’s XI, meaning the outstanding displays of Boland in Test cricket thus far outweigh the conditional factors that saw Kuhnemann make his debut in Delhi. At the same time, he is looking to see all players bat with more discipline. Johnson’s team Much discussion was provoked by the dumping of Head for the first Test in Nagpur. On his recall for Delhi, Head played a second innings of 43 that was brimful of attacking shots – enough to make India briefly nervous. Johnson has underlined Head’s importance to the future of the team by naming him as his preferred captain. Hayden’s team Of the five experts consulted, only Hayden has been present in India for each of the first two Tests. His team favours a triumvirate of spin bowlers after watching closely the conditions presented in Nagpur, Delhi and likely to be repeated for Indore. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-02-26 18:00:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Carolina Marin fan Adita Rao overcomes injury to enter semifinals of badminton nationals","link":"https://indianexpress.com/article/sports/badminton/carolina-marin-fan-adita-rao-overcomes-injury-to-enter-semifinals-of-badminton-nationals-8468193/","keywords":["Badminton","Sports"],"creator":["Shivani Naik"],"video_url":null,"description":null,"content":"Back in December when in practice ahead of the junior nationals, Adita Rao twisted her leg, hurt a ligament and suffered a side strain. The trauma was fresh, and the worrying about aggravating it persistent. Yet, there is the natural speed in her feet – honed in the last six months, but perhaps inherited from her athlete mother – that has propelled her into the semifinals of the Badminton Senior Nationals at Balewadi. It was the foot-speed that helped her negate the big game of the talented and fit Ira Sharma in the quarterfinals, as she made a surprise run into the last four alongside Aakarshi Kashyap, Ashmita Chaliha and Anupama Upadhyay. Reading her opponent’s game and using her own quick reach at the net with an effective lunge, Adita, seeded third, would win in straight games 21-16, 21-15. Recommended for you 1 Is the All England just another port of call on the badminton Tour? 2 PV Sindhu parts ways with coach Park Tae-Sang; to be helped by ex-All England champion Hafiz Hashim 3 PV Sindhu and coach Park Tae-Sang part ways The Thane girl, who now trains in Anand (Gujarat) at coach Amrish Shinde’s academy, is herself surprised at how her game has held up, though she’s begun popping painkillers by the quarterfinals stage. “After I tripped in practice, there was that fear when striding. But I’m surprised and happy at how I’ve been playing. It’s the speed that’s brought me till here,” she says. A struggler for most of her junior years, it was serendipity that kept her in badminton and took her to Anand. She started playing at age 11 in Thane under Shinde, but soon the Railways coach moved to Hyderabad at the national camp to hone his own coaching skills. Meanwhile, Adita, 13 then, switched academies in Mumbai , travelling to Goregaon to train. Her career was dawdling away when Shinde returned to set up an academy in Gujarat. Adita would follow a full seven years after she first started training with him. This time in 2021, the training would be more rounded and focus on accentuating her strengths. Her mother, the original sprinter in the family, would leave a lucrative corporate job to move to Anand with her. “For my speed, I do a lot of cardio and running. I’m a bit of a gym freak,” she says, adding, “though I hate running. It’s not my cup of tea, but it has to be done.” Fighting spirit Fashioning herself after Carolina Marin, her favourite player, Adita says she almost wants to copy the Spaniard. “Not exactly copy because that’s tough, but I like playing aggressive like her and do shout like her on court!” she says. An attacking speedy shuttler, Adita is also a good improviser on court and known for her tenacity, and will fight till the last shuttle drops to the floor. “She’s quite tenacious. She’ll sprint, she’ll dive. She was always very hard-working,” Shinde commends. Her smash is not shabby, and alongside the buzzing retrieving, Adita has quite the package of skills when moving into the seniors – the transitioning being the faltering step of most juniors. The foot-speed needed some upper body balancing. “She had speed, but not the upper body stability to go with that earlier. In the last six months, we’ve worked on that. That’s why the results are showing,” the coach says. Advertisement Adita plays Ashmita in the semifinals on Monday, possibly the toughest opponent in Pune and the title contender. “It will be very tough against Ashmita, and we’ll try our best that Adita stays level with her and then let’s see.” Ashmita herself has the strokes, the attack and the international game pace that troubles opponents and outplays them literally. Adita will try to stave off the run of points that Ashmita can rack up. Adita’s doctor doesn’t know she’s been on court, despite him warning her that it could take up to four months to fully recover from her injuries. “The coach said let’s try and Pune’s been a happy hunting ground for me. When I played my first senior ranking tournament here, I reached the finals. Now I’m in the semis. I’m feeling good about my attacking game,” Adita says, adding that she hopes she can hit yet another speed gear with her hand-speed which isn’t as quick as her feet- yet. Advertisement For someone who was barely Maharashtra Top 4 and would struggle to breach the quarters barrier in her junior days, the onset of a senior career has brought glad tidings. There are not many who eagerly wait to get going on the senior circuit, but Adita can’t wait to get started. Aakarshi vs Anupama Almora teenager Anupama made her first semifinal of the Senior Nationals on Sunday, after first making the quarters in 2019. “But I want a medal now,” she would insist. A swimmer initially, she would move to badminton seeing the exploits of Lakshya Sen. “I used to be a swimmer. But there were no role models in swimming. Badminton had Saina (Nehwal) didi and (PV) Sindhu didi. And they won big trophies,” she would add, starting out under DK Sen before moving to Bangalore . Anupama’s father Naveen played cricket, and was determined his children will have a well-rounded childhood revolving not just around academics. She likes watching tennis and is a huge (Novak) Djokovic fan. “I wanted my kids to have that balance in life so that studies wouldn’t lead to depression. In sport, your heart learns to take a hit and bounce back. Every day is a new day.” Also Read Why America doesn’t care for Badminton Parupalli Kashyap loses passport in Amsterdam, Rajyavardhan Rathore sends... PV Sindhu opens campaign against Russian Evgeniya in China Open Winter of discontent continues for India’s shuttlers as Lakshya Sen surre... The family would put up a small Decathlon net during COVID and Naveen would himself learn the sport just so he could impart training to his daughter. “I’m a joker of all trades, master of none. But I thought I should learn badminton so I could help her! COVID was a tough time for the family and I myself had a close call, landing in the hospital. But now everything is on track,” he would say.","pubDate":"2023-02-26 17:59:42","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Laura Wolvaardt’s way with the bat makes SA believe we will win a World Cup","link":"https://www.dailymaverick.co.za/article/2023-02-27-laura-wolvaardts-way-with-the-bat-makes-sa-believe-we-will-win-a-world-cup/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"In the dying overs of the final of the Women’s T20 World Cup, Laura Wolvaardt provided the country with a glimmer of hope that a cricket World Cup trophy will (eventually) come to South Africa. The post Laura Wolvaardt’s way with the bat makes SA believe we will win a World Cup appeared first on Daily Maverick.","content":"When Laura Wolvaardt’s wooden blade thrashed Australian bowlers Tahlia McGrath and Georgia Wareham to all parts of the luscious Newlands cricket ground in consecutive overs at Sunday’s T20 Women’s World Cup final, belief flooded across South Africa – even if for just a short while. Laura Wolvaardt of South Africa in action against Bangladesh. (Photo: Ashley Vlotman / Gallo Images) Players of South Africa and Australia make their way on to the Newlands, Cape Town field for the ICC Women’s T20 World Cup Final on 26 February 2023. (Photo: Mike Hewitt / Getty Images) Tazmin Brits of South Africa takes a catch to dismiss Ellyse Perry of Australia during the 2023 ICC Women’s T20 World Cup final. (Photo: Ashley Vlotman / Gallo Images) Perhaps this was the moment. Just maybe, a senior South African cricket team would go where no other side has gone and clinch a cricket World Cup trophy. It wasn’t to be and she was dismissed by Megan Schutt two overs later and that hope was destroyed. And, as the old sporting adage goes: “It’s the hope that kills you.” That hope has been dangled and snatched away from South Africa’s cricket-loving public over the past month. Visit Daily Maverick’s home page for more news, analysis and investigations South Africa came into the Women’s T20 World Cup off the back of a tri-series win over West Indies and India. They defeated India in the final of the mini-competition to claim victory. The confidence-boosting win provided hope that South Africa could finally break the country’s cricket World Cup hoodoo. Just a week later, they lost the curtain-raiser of the Women’s T20 tournament to Sri Lanka by three runs – and that hope shrunk again. But the team put their World Cup goals back on track when they found their mojo against New Zealand three days later. The South Africans then only managed to scrape past Bangladesh in their final group-stage match, which made a semifinal loss seem inevitable against the then unbeaten England. But the South Africans stepped up to produce a hope-renewing six-wicket victory over the English , the second-ranked team in the world, in the semifinal. They once more instilled belief that the improbable was possible. Chloe Tryon of South Africa fields in the ICC Women’s T20 World Cup final match against Australia at Newlands Cricket Ground. (Photo: Ashley Vlotman / Gallo Images) Fast bowler Shabnim Ismail of South Africa celebrates the wicket of Georgia Wareham of Australia in the ICC Women’s T20 World Cup final at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The Proteas were always going to be the underdogs against Australia, who were battling for their sixth consecutive T20 World Cup title against a South African side making their first appearance in a final. But fans queued for hours the day before the final to secure tickets as more than 13,000 joyous supporters in Cape Town believed that this could finally be South Africa’s day after years of cricketing heartbreak. Australia posted a competitive total of 156 for four after captain Meg Lanning won the toss and elected to bat first. South Africa’s chase got off to a poor start, sitting on 22 for one after the six-over powerplay. The scoring-rate quickly shot up to more than 10 runs an over as South Africa’s hopes of a World Cup miracle slowly drifted away. Read more in Daily Maverick : “ SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown ” But once Wolvaardt finally got going and her glorious straight blade struck the white leather slung toward her into the Oaks grass embankment off Wareham’s bowling – for her third maximum – the miracle was on the cards once more. “Laura Wolvaardt, she’s a world-class player,” said Wareham after the starlet’s innings of 61 off 48 deliveries. “I was definitely nervous when she was bombing me over my head.” Her untimely dismissal meant this World Cup dream was crushed and Australia took the World Cup honours by 19 runs – but, fortunately for South Africa, Wolvaardt has many more World Cups and many more such innings in store. “You want your players to step up on the big occasion and that’s exactly what she did. She showed her class again today at just the [young] age of 23,” said Proteas captain Suné Luus after the match. “For us as a team, it’s very exciting to know that she’s going to be here for the next 10 years. I’m so excited to be next to her and see her break all the records in the near future.” Despite the loss, there remains a sense of excitement and expectation that this team, with magical players such as Wolvaardt, will seal South Africa’s first World Cup triumph when the 50-over iteration rolls around in Bangladesh next year. DM","pubDate":"2023-02-26 22:03:16","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown","link":"https://www.dailymaverick.co.za/article/2023-02-26-sa-fail-at-final-hurdle-as-australia-clinch-record-sixth-womens-t20-world-cup-crown/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Despite a valiant effort, the Proteas Women were outplayed by a confident Australian outfit, losing by 19 runs in the final at Newlands on Sunday. The post SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown appeared first on Daily Maverick.","content":"Australia captured their sixth Women’s T20 World Cup with a routine 19-run victory over South Africa at Newlands cricket ground in Cape Town on Sunday, 29 February. It was South Africa’s first appearance in a World Cup final whereas Australia were featuring in their seventh. The difference on the day was the experience of the Aussies in big-match situations. There wasn’t a major separation in performance between the two teams, but all the big moments belonged to Australia. Australia players celebrate with the trophy after winning the ICC Women ’ s T20 World Cup final against South Africa at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The first one came through luck when Australian captain Meg Lanning won the toss. She elected to bat first – a tactic both teams employed in their respective successful semifinals. Australian Beth Mooney played a sublime innings at the top of the order, striking 74 runs off 53 deliveries. Her innings contained nine fours and one six and she was ably supported by several teammates. The 156 posted by the Aussies was always going to be a daunting chase for a team playing in their first final. And so it was as every batter outside of starlet Laura Wolvaardt – who scored an incredible 61 off 48 deliveries – failed to put any runs of note on the board. South Africa’s chase got off to a characteristically measured start. But in the tense situation of a World Cup final, the pressure created by a slow start destroyed any chance of a successful run-chase by the host country. Newlands was packed for the final. (Photo: Mike Hewitt / Getty Images) Wolvaardt and Tazmin Brits scored 17 runs in the first five overs before the latter was dismissed for 10 runs off 17 balls. Every batter who came to the wicket after was immediately under pressure as the scoring rate stood at nine to the over. Stalwart Marizanne Kapp struck two quick fours, but South Africa still posted their lowest powerplay score of the tournament – 22 for one. Kapp was dismissed shortly after for a run-a-ball 11 before captain Suné Luus was run out after a terrible mix-up between herself and Wolvaardt. With South Africa well behind the required run rate, Wolvaardt and Chloe Tryon gave the capacity 13,860 Newlands crowd a glimmer of hope. Tahlia McGrath bowled two no balls in the 13th over and Wolvaardt smashed the second free hit – as a result of McGrath overstepping – for a massive six. She and Tryon took 14 off the over. The 14th and 15th over went for 25 as Wolvaardt brought up her third consecutive half century off 43 deliveries. But when the opener was trapped lbw by Megan Schutt in the 17th, it signalled the dimming of the last bit of hope for the South Africans. A couple of lusty blows by Tryon and Sinalo Jaftha at the end was not enough for South Africa to lift their first senior World Cup trophy. Australia’s comprehensive 156 for six was hard work for the No 1 team. Wickets tumbled consistently throughout their innings, but Mooney carried her bat and kept the innings together with typically sublime stroke-making. Australia had an uncharacteristically circumspect powerplay – not playing any shots of authority, but still capitalising on the loose balls. Healy and Mooney helped guide the cautious start to 36 for no loss. Healy mistimed a shorter wide ball by Kapp straight to Nadine de Klerk at cover, who took an easy catch. Shabnim Ismail cranked up the pressure by bowling the first maiden of the tournament in the sixth over to restrict Australia to 36 for one, their lowest powerplay total of the tournament. Surprisingly, Lanning pushed herself down the order from No 3, where she has batted throughout her career. She sent in big-hitter Ashleigh Gardner, who was carded to come in at No 4, ahead of her. The experiment paid off as Gardner took to the spin of Nonkululeko Mlaba and the medium pace of De Klerk. She hit Mlaba for consecutive fours before playing two elegant drives for six off De Klerk – one over mid-off and one over cover, helping Australia to 73 for one after 10 overs. Captain Luus turned to her experienced players in Kapp and Tryon as the former built pressure with tight lines and lengths before the latter struck the telling blow, dismissing Gardner for 29 off 21 deliveries. The thunderous ball striker tried to go downtown again, but only managed to sky it to Luus at long off. Nonkululeko Mlaba of South Africa celebrates taking the wicket of Grace Harris of Australia during the ICC Women’s T20 World Cup final at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The pair of Mooney and Gardner shared a 46-run, 41-delivery second-wicket partnership. Australia’s go-to finisher Grace Harris then strutted in at No 4, but was soon back in the sheds after running past a Mlaba delivery that knocked her leg stump bail off its groove. Visit Daily Maverick’s home page for more news, analysis and investigations When Lanning finally joined Mooney at the crease at No 5, Kapp employed a short ball tactic to the captain which restricted the scoring. The tactic worked a treat and Lanning holed out off another Kapp short ball to Tryon at square leg, who took a tidy catch, sliding to her left. Mooney, from the other end, continued on her merry way, bringing up a second half-century in two games after scoring 54 off 37 in the semifinal against India. This one was more erratic, coming off 44 deliveries, but it was equally important for her team. From that point, the No 2-ranked batter in the world opened her shoulders and scored her next 24 runs in only nine deliveries. South Africa maintained a slow over rate throughout Australia’s innings and they could have only three fielders outside the inner ring by the final over, which was bowled by Ismail. That 20th over had it all. Mooney struck the first ball for a massive six before thwarting the second for an elegant four – both straight down the ground. She was then dropped at backward point by Wolvaardt on the third delivery before Ismail went bang-bang. She first dismissed Ellyse Perry with a slower ball that was caught by Brits, and then she cleaned up Georgia Wareham with an on-pace delivery on the fourth and fifth delivery. Perry’s wicket took Ismail to the outright leading wicket-taker in Women’s T20 World Cup history with 42, and Wareham’s scalp took her to 43. With Ismail on a hat-trick on the final delivery, Tahlia McGrath, the No 1 ranked T20 batter in the world who strangely came in at eight – managed to get some bat on the last ball and take her side to 156. DM","pubDate":"2023-02-26 21:00:22","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Schutt's relief at overcoming 'scary' spell to win Cup","link":"https://thewest.com.au/sport/cricket/schutts-relief-at-overcoming-scary-spell-to-win-cup-c-9878564","keywords":null,"creator":["Annesha Ghosh"],"video_url":null,"description":"Australia pace bowler Megan Schutt reckons their T20 World Cup win didn't come easily as they had to overcome a \"scary\" spell before lifting the trophy.","content":"Megan Schutt has admitted her relief that Australia overcame a \"scary\" spell when it felt their T20 World Cup victory might just be slipping away - and was adamant that their relentless winning streak never feels boring. Before her team went on to annex a sixth title in Cape Town on Sunday, South Africa's attacking 55-run fourth-wicket stand in their chase had put Australia \"under the pump\" in the final, reckoned Schutt. But with the game threatening to swing the hosts' way at the death at Newlands, it was Schutt herself who speared in a momentum-changing full ball in the 17th over which got things back on track for the serial winners. The delivery trapped opener Laura Wolvaardt lbw, breaking the half-centurion's fifty stand with Chloe Tryon, and it led to South Africa eventually falling 19 runs short. \"She (Wolvaardt) was hitting them bloody nicely - and so was Chloe,\" reflected Schutt, who shares the Adelaide Strikers dressing room with Wolvaardt. \"So, it was honestly quite scary there towards the end. \"We were under the pump, don't get me wrong ... she probably tried to play me too square and that did her in but she was hitting down the ground beautifully. Crucial wicket, but just lucky that it came off.\" Schutt, who was part of the Australian side that botched a 148-run defence in the 2016 T20 World Cup final against West Indies, said winning three 20-over world titles since then has been gratifying. \"Pretty bloody special. I mean, people keep having digs at us that winning is boring - but it's not boring for us,\" the 30-year-old said. \"Every time that we come, we come to win and this is another one we got to do in front of a crowd that felt like bloody 70,000 people. It was so damn loud, so really cool.\" Schutt took 4-0-23-1 in the final, a momentous day for the team that coincided with Meg Lanning's personal milestone of 100 T20Is as captain. Schutt attributed a large part of the team's success on the day, and across major events in recent years, to Lanning's equanimity. \"I think because she's a pretty calm character kind of rubs off on us,\" Schutt said. \"She presents this calmness. I mean, her chat before this game was cool because it was a bit more ampie, a few swear words in there - Meg doesn't swear a lot! - so that was really cool. \"She's been a leader for so long that she knows what people need to succeed -- whether that's individually or as a team.\" Head coach Shelley Nitschke also had praise for Alyssa Healy, who stood in for Lanning during her five-month break. \"Alyssa has done a fantastic job in her absence,\" Nitschke said. \"But I think Meg coming back had the team really lift, she's such a strong leader. \"I think the difference with her is now she's just back and she's just enjoying herself. She's enjoying her cricket. \"She's laughing out there, which is pleasing for everyone and we're just happy to see that.\" The day was doubly special for Nitschke, too. Having won her first World Cup as a player in South Africa 18 years ago, the 46-year-old has now added a world title to her CV as Australia's head coach, after replacing Matthew Mott in the job last year. \"It's an amazing feeling. The first one I won as a player was the first one I've been involved in as a coach, so I guess it's gone full circle.\" Sign up for our emails","pubDate":"2023-02-26 20:35:08","image_url":"https://images.thewest.com.au/publication/C-9878564/f631ddbf5b85e09466a48004c59ba5cb9c0a92da-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Shaheen Afridi PSL 8: Mohammad Haris bat breaks into two pieces by Shaheen Shah Afridi express pace in PSL 2023","link":"https://thesportsrush.com/cricket-news-shaheen-afridi-psl-8-mohammad-haris-bat-breaks-into-two-pieces-by-shaheen-shah-afridi-express-pace-in-psl-2023/","keywords":["Cricket","Videos","Lahore Qalandars","Mohammad Haris","Pakistan Super League","Peshawar Zalmi","PSL 2023","PSL 8","Shaheen Shah Afridi"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Peshawar Zalmi wicket-keeper batter Mohammad Haris (0) has become the latest victim of Lahore Qalandars captain Shaheen Shah Afridi’s new-ball spectacle. Perhaps the most embarrassing outing of Haris’ career especially during a televised match saw him looking absolutely clueless on both the balls that he faced off Afridi. Opening the batting with captain Babar Azam… The post Shaheen Afridi PSL 8: Mohammad Haris bat breaks into two pieces by Shaheen Shah Afridi express pace in PSL 2023 appeared first on The SportsRush.","content":"Peshawar Zalmi wicket-keeper batter Mohammad Haris (0) has become the latest victim of Lahore Qalandars captain Shaheen Shah Afridi’s new-ball spectacle. Perhaps the most embarrassing outing of Haris’ career especially during a saw him looking absolutely clueless on both the balls that he faced off Afridi. Opening the batting with captain Babar Azam (7), Haris’ attempt to defend an Afridi delivery on the first ball of the innings saw his bat breaking into a couple of pieces. Haris, who was pretty much left with only the handle in his hand, had no option than to immediately ask for a new bat. Haris, however, couldn’t make use of the new bat either as he failed to make contact with the ball on the following delivery. A pinpoint in-swinging yorker targeted at hitting the stumps achieved its target after the right-handed batter played all around a ball which would’ve been difficult to just defend. Chasing a gargantuan 242-run target, Zalmi put on display a disastrous start on the back of losing their opening batters within the first three overs. It was on the penultimate delivery of his second over that Afridi produced a near-replica of Haris’ dismissal to send Azam back to the pavilion for the second time in the history of the PSL. First ball: Bat broken ⚡ Second ball: Stumps rattled 🎯 PACE IS PACE, YAAR 🔥🔥 | | — PakistanSuperLeague (@thePSLt20) Shaheen Shah Afridi 🫡 — Shai Hope (@shaidhope) Afridi, 22, ended up picking his fifth T20 five-wicket haul in a prototypical lead-from-the-front effort. In what was his second five-fer in the PSL, it witnessed the left-arm bowler also dismissing the likes of Wahab Riaz (0), Saad Masood (16) and James Neesham (12). It is worth noting that Qalandars beat Zalmi by 40 runs in the recently concluded 15th match of the ongoing eighth season of the Pakistan Super League. First PSL 8 match at the Gaddafi Stadium, it was a high-scoring entertainer allowing the home team to register the in the history of the tournament. A shambolic start was recovered to a large extent due to individual half-centuries by PZ batters Tom Kohler-Cadmore (55) and Saim Ayub (51). However, the duo falling within six deliveries after sharing a 44-ball 91-run third-wicket partnership led to the team’s downfall especially with the middle-order not contributing as per the need of the hour. Afridi’s decision of batting first after winning the toss was well-supported by his batters as Fakhar Zaman (96) and Abdullah Shafique (75) stitched a 69-ball 120-run second-wicket partnership before wicket-keeper batter Sam Billing (45*) put on board an apt finishing act. Only the second PSL 2023 double-header day, the above mentioned contest followed Karachi Kings vs Multan Sultans afternoon match. Fumbling big time to get bundled out for 101 in 16.3 overs in a 168-run chase, Sultans lost that match by as many as 66 runs at the National Stadium.","pubDate":"2023-02-26 19:10:35","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"News24.com | 'It was the most special day': Skipper Luus proud of Proteas despite World Cup heartache","link":"https://www.news24.com/sport/Cricket/Proteas/it-was-the-most-special-day-skipper-luus-proud-of-proteas-despite-world-cup-heartache-20230226","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Sune Luus expressed her pride in her teammates after they lost their T20 World Cup final to Australia.","content":"The wait for a first-ever Cricket World Cup trophy continues for South Africa, but Proteas women's captain, Sune Luus, says she is immensely proud of what her charges achieved at their home T20 showpiece. READ | Heroic Proteas fall short in World Cup final despite Wolvaardt fireworks South Africa lost by 19 runs to six-time champions Australia in the T20 World Cup final at Newlands on Sunday, bringing the curtain down on an epic campaign that ended with 14 000 packing into the iconic stadium to support this side as they broke barriers. No Proteas side had ever contested a World Cup final, and very few would have predicted that the Proteas would be the first to do it here. They were overwhelming underdogs in their semi-final against England at the same venue on Friday, but they got over that hurdle only to meet the greatest women's cricket side in history in the tournament decider. Australia have played in the last six T20 World Cup finals, and while they were certainly pushed by the Proteas at times on Sunday, they were largely comfortable in getting over the line. What is of far more significance, though, is that this Proteas side stunned the cricketing world on their journey, winning over an often sceptical South African public in the process. The crowd on Sunday roared throughout, cheering every run that came off a South African bat. That, Luus says, is the takeaway from this tournament. \"I'm definitely proud of every teammate of mine. We've done an incredible job to get to the final, and I think to put up a fight against a team like Australia ... I just feel really proud,\" she told media after the match. \"It was the most special day we could ask for. When we started this tournament, I don't think this was something we envisioned. \"We were hoping it wasn't going to be too embarrassing with empty stadiums. We just hoped a few people would come to the games, so to see this has been next-level. \"The country was really behind us, and it was something we never really thought would happen. It was such an honour to have that opportunity to inspire a nation and to have them come out and watch us play - it was such a blessing.\" The Proteas were naturally disappointed at the end of the occasion, but Luus herself said she had been largely composed. \"You always think about a World Cup final and what it will feel like, but I was pretty chilled throughout the day. I still watched a couple of movies this morning,\" she said. \"You go through waves. There are excitement levels and a few nerves here and there. We obviously thought we had a chance while we were batting, so it obviously gives you that extra bit of excitement. \"We would have loved to win, but for us to play in a final with a sell-out crowd was amazing. \"We got a sniff of how a final is, and we now have the heartache of not winning a final. At next year's World Cup, when we get there again, it's not going to be a big thing for us anymore. \"This was a massive opportunity for our girls and they did extremely well. We gave them (Australia) a good run for their money. It obviously wasn't the result we wanted, but I just have positive feelings right now.\" The skipper also congratulated the Australians while acknowledging that South African cricket still had a long way to go from a professionalism point of view. \"They're a well-oiled machine,\" Luus said. \"Their level of professionalism is insane, and they're a team the world has been looking up to for a very long time. They're there for a reason. \"If you look at their structures and pipelines, everything is just lining up and everything is in order. It's something as a country we're definitely striving for.\"","pubDate":"2023-02-26 19:00:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"मुंबई इंडियंस को लगा बड़ा झटका, आईपीएल 2023 से बाहर हो सकते हैं जसप्रीत बुमराह, सामने आई बड़ी अपडेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jasprit-bumrah-likely-to-miss-ipl-2023-due-to-injury-reports/articleshow/98255997.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और मुंबई इंडियंस के चाहने वाले जसप्रीत बुमराह के चोट से उबरने का बेसब्री से इंतजार कर रहे हैं। लेकिन अब ऐसी खबर सामने आ रही है कि जिसे सुनकर भारतीय क्रिकेट टीम और मुंबई इंडियंस के फैंस के होश उड़ जाएंगे। दरअसल, बुमराह को अभी ठीक होने में अधिक समय लगेगा।","content":"भारतीय क्रिकेट टीम के अनुभवी तेज गेंदबाज जसप्रीत बुमराह सितंबर 2022 से क्रिकेट के मैदान से दूर चल रहे हैं। कमर में लगी चोट के कारण उन्होंने लंबे समय से अंतरराष्ट्रीय क्रिकेट नहीं खेला है। हालांकि पहले कयास लगाए जा रहे थे कि जस्सी बॉर्डर गावस्कर ट्रॉफी तक पूरी तरह से ठीक हो जाएंगे। लेकिन ऐसा नहीं हुआ। वहीं उसके बाद कहा जाने लगा कि आईपीएल 2023 के शुरू होने तक बुमराह फिट हो जाएंगे। लेकिन अब उनको लेकर जैसी खबरें सामने आ रही हैं, उससे न तो भारतीय टीम खुश होगी और न तो मुंबई इंडियंस। मीडिया रिपोर्ट्स के अनुसार, भारतीय टीम और मुंबई इंडियंस के स्टार तेज गेंदबाज जसप्रीत बुमराह का आईपीएल 2023 तक फिट होना मुश्किल है। वहीं खबरें यह भी हैं कि जून में खेले जाने वाले आईसीसी वर्ल्ड टेस्ट चैंपियनशिप 2023 के फाइनल तक भी जस्सी फिट नहीं हो पाएंगे। जोकि भारतीय टीम और मुंबई इंडियंस के लिए चिंता का विषय है। ऐसा भी बताया जा रहा है कि बुमराह की चोट जैसी शुरुआत में सोची जा रहा थी उससे कई अधिक गंभीर है, गौरतलब है कि बुमराह पीठ की चोट से उबरने में सहज महसूस नहीं कर रहे हैं। रिपोर्ट्स के मुताबिक, भारतीय मैनेजमेंट अब जसप्रीत बुमराह को अक्टूबर-नवंबर तक भारत में होने वाले वनडे विश्वकप से पहले फिट करने की योजना बना रहा है। क्योंकि बुमराह भारत के मुख्य खिलाड़ियों में से एक हैं। भारत को अगर आगामी वनडे विश्वकप जीतना है तो बुमराह का टीम में होना उतना ही जरूरी है जितना कप्तान रोहित शर्मा और विराट कोहली का है। बुमराह के अगर इंटरनेशनल करियर की बात करें तो, उन्होंने भारत के लिए 30 टेस्ट, 72 वनडे और 60 T20 मुकाबले खेले हैं। जिसमें जसप्रीत ने क्रमश: 128, 121 और 70 विकेट झटके हैं। वहीं अपने आईपीएल करियर में जसप्रीत बुमराह ने खेले गए 120 मैचों में मुंबई इंडियंस के लिए 145 लिए हैं।","pubDate":"2023-02-26 18:46:04","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"टीम की हार में भी इतिहास रच गई शबनिम इस्माइल, टी20 विश्व कप में बनी सफल गेंदबाज","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/shabnim-ismail-became-the-highest-wicket-taker-in-t20-world-cup-south-africa-lost-to-australia-in-final/articleshow/98255728.cms","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's T20 WC: आईसीसी महिला टी20 विश्व कप 2023 के फाइनल में साउथ अफ्रीका को 19 रन से हार का सामना करना पड़ा। इस मैच में साउथ अफ्रीका की तेज गेंदबाज शबनिम इस्माइल ने शानदार गेंदबाजी। इसके साथ ही उनके नाम एक बड़ा रिकॉर्ड भी दर्ज हो गया। शबनम टी20 विश्व कप में सबसे अधिक विकेट लेने वाली गेंदबाज बन गई हैं।","content":"आईसीसी महिला टी20 विश्व कप 2023 के फाइनल में साउथ अफ्रीका को ऑस्ट्रेलिया के खिलाफ 19 रनों से करारी हार मिली। इस मैच में साउथ अफ्रीका के सामने 157 रनों का लक्ष्य था लेकिन वह 20 ओवर में 6 विकेट के नुकसान पर 137 रन ही बना सकी। हालांकि टीम को फाइनल में हार जरूर मिली और वह चैंपियन नहीं पाई लेकिन तेज गेंदबाज शबनिम इस्माइल के नाम एक विश्व रिकॉर्ड दर्ज हो गया। शबनिम ने मैच में साउथ अफ्रीका के लिए 4 ओवर में 26 रन देकर दो विकेट अपने नाम किए। इसके साथ ही शबनिम के नाम टी20 विश्व कप के इतिहास में सबसे अधिक विकेट लेने का रिकॉर्ड दर्ज हो गया है। शबनिम टी20 विश्व कप में 32वां मैच खेलने उतरी थी। इस तरह आईसीसी के टूर्नामेंट में उनके नाम 43 विकेट दर्ज हो गए हैं। इस मामले में शबनिम ने इंग्लैंड की आन्या श्रबसोल को पीछे छोड़ा जिन्होंने टी20 विश्व कप में 41 लिए थे। हालांकि शबनिम की इस दमदार खेल के बावजूद साउथ अफ्रीका की टीम पहली बार विश्व चैंपियन बनने से चूक गई। साउथ अफ्रीका को फाइनल मैच में 19 रन से हराकर छठी बार टी20 विश्व कप की ट्रॉफी को उठाया। ऑस्ट्रेलियाई टीम सातवीं बार फाइनल में पहुंची थी। टी20 विश्व कप 2023 में ऑस्ट्रेलिया की टीम को एक भी मुकाबले में हार का सामना नहीं करना पड़ा। सेमीफाइनल में भारत के पास मौका था कि वह ऑस्ट्रेलिया को हरा कर फाइनल में अपनी जगह बनाती लेकिन यहां भी कंगारू टीम ने बाजी मार ली और भारत को हरा दिया। ऑस्ट्रेलिया के लिए फाइनल मैच में ओपनर बल्लेबाज बेथ मूनी धमाकेदार बल्लेबाजी की थी। मूनी ने 53 गेंद में शानदार 74 रनों की पारी खेली जिसमें उन्होंने 9 चौके और 1 छक्का भी लगाय। मूनी की इस बल्लेबाजी के कारण ही ऑस्ट्रेलिया की टीम ने 156 रन के स्कोर पर पहुंच पाई। मूनी के अलावा एश्ले गार्डनर ने भी 29 रनों का महत्वपूर्ण योगदान दिया। वहीं विकेटकीपर बल्लेबाज एलिसा हिली ने भी 17 रनों की पारी खेली।","pubDate":"2023-02-26 18:15:19","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"सेमीफाइनल में भारत को जख्म देने वाली गार्डनर ने फाइनल में भी किया कमाल, बनी प्लेयर ऑफ द टूर्नामेंट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ashleigh-gardner-won-player-of-tournament-award-icc-t20-women-worldcup-2023/articleshow/98255642.cms","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया ने आईसीसी टी20 विश्वकप 2023 के फाइनल में मेजबान दक्षिण अफ्रीका को 19 रन से करारी शिकस्त दी है। जिसके चलते वह छठी बार वर्ल्ड चैंपियन बन गए हैं। वहीं एश्ले गार्डनर को उनकी पूरे टूर्नामेंट में जबरदस्त परफॉरमेंस के लिए \"प्लेयर ऑफ द टूर्नामेंट' के अवॉर्ड से भी नवाजा गया है।","content":"दक्षिण अफ्रीका और ऑस्ट्रेलिया के बीच महिला टी20 विश्वकप 2023 का फाइनल मुकाबला 26 फरवरी रविवार को केपटाउन के न्यूलैंड्स क्रिकेट ग्राउंड में खेला गया। जिसमें ऑस्ट्रेलिया ने मेजबानों को 19 रन से मात दी और छठी बार आईसीसी टी20 महिला वर्ल्डकप की चमचमाती ट्रॉफी अपने नाम कर ली। वहीं कंगारू टीम की स्टार ऑलराउंडर एश्ले गार्डनर को 'प्लेयर ऑफ द टूर्नामेंट' चुना गया। जिसके बाद उन्होंने बड़ा बयान भी दिया है। ऑस्ट्रेलिया क्रिकेट टीम की स्टार ऑलराउंडर एशले गार्डनर ने प्लेयर ऑफ द टूर्नामेंट चुने जाने के बाद कहा कि वे (ऑस्ट्रेलिया टीम) पिछले विश्वकप के बाद से ही इस वर्ल्डकप को जीतने के बारे में बात कर रहे थे। साथ ही उन्होंने इस बात का भी जिक्र किया कि वह इस टूर्नामेंट में कई चरणों में जीतने की स्थिति में नहीं थे। एश्ले गार्डनर ने कहा ' हम पिछले विश्व कप के बाद से इस पल के लिए तरस रहे थे। हम कुछ फेजिज में जीतने की स्थिति में नहीं थे।' आपको बता दें कि भारत और ऑस्ट्रेलिया के बीच खेले गए विश्वकप के पहले सेमीफाइनल में एश्ले गार्डनर ने अपनी टीम के लिए बल्ले से महत्वपूर्ण पारी खेली थी। उन्होंने 5 चौकों की मदद से महज 18 गेंदों में 31 रन जड़े थे। इस दौरान उनका स्ट्राइक रेट 172.72 का था। एश्ले ने भारत के खिलाफ खेली गई इस पारी को टूर्नामेंट की अपनी सबसे बेहतरीन पारी माना है। उन्होंने कहा, 'भारत के खिलाफ सेमीफाइनल में बल्ले से प्रदर्शन मेरे लिए इस टूर्नामेंट का सर्वश्रेष्ठ था। हमने यह टूर्नामेंट जीत लिया है। हमने ऐसा करने के बारे में बात करते थे, इसलिए वास्तव में मुझे गर्व है। मेरी गेंदबाजी में विश्वास है। मैंने बिग बैश में भी काफी गेंदबाजी की थी। शुक्र है कि मेरी फॉर्म इंटरनेशनल क्रिकेट में भी आ गया।' एश्ले गार्डनर ने टी20 वर्ल्डकप 2023 में खेले गए 6 मुकाबलों में 12.50 की औसत से गेंदबाजी करते हुए 10 विकेट झटके। तो वहीं बल्ले से उन्होंने कुल 110 रन भी बनाए। एश्ले का प्रदर्शन दक्षिण अफ्रीका के खिलाफ फाइनल में भी सांतवे आसमान पर था। उन्होंने पहले बल्लेबाजी करते हुए 29 रन की अच्छी पारी खेली। फिर उसके बाद 4 ओवर में सिर्फ 20 रन देकर 1 बहुमूल्य विकेट भी झटका।","pubDate":"2023-02-26 18:02:17","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Who would you pick? Spin trio set for Indore, Renshaw on the outer","link":"https://www.theage.com.au/sport/cricket/who-would-you-pick-spin-trio-set-for-indore-renshaw-on-the-outer-20230226-p5cnoj.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"The Age and The Sydney Morning Herald convened a selection panel of former greats to pick a team to claw back some momentum when the India Test series resumes on Wednesday.","content":"Scroll down to see who our panel of selection experts has picked for the third Test, starting Wednesday in Indore. And have your say by voting for your preferred XI. Delhi: Barring an unexpectedly grassy pitch, Australia are set to keep their seldom-seen spin trio configuration in concert with the recalled Cameron Green and Mitchell Starc for the Indore Test. Australia went 2-0 down to India in a hectic second Test match in Delhi, but it was not the returns of the three spinners Nathan Lyon, Todd Murphy and Matt Kuhnemann that put them there. Todd Murphy leaps with joy after Matt Kuhnemann claims Virat Kohli for a maiden Test wicket. Credit: Getty Images. A selection of experts polled by The Age and The Sydney Morning Herald have pointed strongly towards the retention of three spinners now that Green and Starc are available. Mark Taylor, Brad Haddin, Matthew Hayden and Mitchell Johnson all included Murphy, Kuhnemann and Lyon in their teams. The record of the central Indian venue, switched for Dharamshala at late notice by the BCCI, is one of sharp spin and lavish returns for Ravichandran Ashwin in particular. With that in mind, Starc and Green loom as enablers for the retention of Kuhnemann and Murphy alongside senior spin bowler Lyon. Of the experts consulted, only former Australian captain and selector Greg Chappell argued for the choice of a second specialist fast bowler, naming Scott Boland ahead of Kuhnemann. “Pick our best bats and best bowlers, play to our strengths and bat with more discipline,” Chappell explained. Johnson came through with the other outlier, suggesting Travis Head should captain the side rather than Steve Smith. Peter Handscomb, who has acquitted himself ably with the bat in the first two Tests without going on to a century, stated that Murphy and Kuhnemann should be persevered with after what they showed together in Delhi. “We had a debutant and a second-gamer bowling in tandem trying to win a Test match for Australia, and it’s not often that happens,” Handscomb said. “I was excited for those two boys, and they’ll both be better for it. They bowled very well, and they’ll get more rewards if we keep backing it all in. “There’s a lot of excitement as well with the first two games. It’s so fickle, small moments over here can mean a big difference, so yes we’ve lost these two Tests, once very convincingly and in the other we were in a very good position, but it’s only small moments that would change that to a win for us.” Starc bowled quickly and well in Australia’s final Delhi training session before flying to Indore on Sunday afternoon, while Green also showed decent rhythm when bowling almost exclusively around the wicket to the touring side’s left-handers. Selection intrigue: Cameron Green. Credit: Getty Images With Pat Cummins out of the Test and possibly the series as he spends precious time at home with his mother in palliative care, Australia’s options for Indore are somewhat simplified. Head is set to keep opening alongside Usman Khawaja, while David Warner spends time at home as his fractured elbow heals. Green is certain to replace Matt Renshaw after the Queenslander’s underwhelming displays in the first two Tests, the second where he played one innings as a concussion substitute for Warner. While highly rated as a long-term player for the future, Renshaw’s three innings in India so far have been characterised by imprecision in dealing with his first few balls, resulting in a trio of lbw dismissals: once to Ravindra Jadeja and twice to Ashwin. The only other options in the squad are the back-up pace bowlers Boland and Lance Morris, who remained in India on standby for the event of Cummins not returning in time for the Indore Test. But their chances of playing rest chiefly on scenarios where there is either an injury to one of the first-choice bowlers, or the surface happens to exhibit the sorts of lively qualities enjoyed by the Australian XI that beat India in Nagpur in 2004 to seal the team’s only Test series win in India for the past 50 years. Taylor’s team Mark Taylor wants to see the best four bowlers picked for the conditions, meaning that in the event of a spinning track, Matt Kuhnemann plays, but if there is some help for the seamers, Scott Boland takes his place. Travis Head is opening only as a stopgap on south Asian pitches: a long-term replacement for Warner still needs to be found. Haddin’s team A very similar configuration to Taylor’s, favouring the three spin bowlers alongside Cameron Green and Mitchell Starc. It’s a long way from the teams fielded on Haddin’s 2008 tour of India, where Cameron White was the sole chosen spin bowler for three Tests, before Jason Krejza made his Nagpur debut in the last. Chappell’s team Picking the best bowlers available is a key tenet of Greg Chappell’s XI, meaning the outstanding displays of Boland in Test cricket thus far outweigh the conditional factors that saw Kuhnemann make his debut in Delhi. At the same time, he is looking to see all players bat with more discipline. Johnson’s team Much discussion was provoked by the dumping of Head for the first Test in Nagpur. On his recall for Delhi, Head played a second innings of 43 that was brimful of attacking shots – enough to make India briefly nervous. Johnson has underlined Head’s importance to the future of the team by naming him as his preferred captain. Hayden’s team Of the five experts consulted, only Hayden has been present in India for each of the first two Tests. His team favours a triumvirate of spin bowlers after watching closely the conditions presented in Nagpur, Delhi and likely to be repeated for Indore. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-02-26 18:00:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Carolina Marin fan Adita Rao overcomes injury to enter semifinals of badminton nationals","link":"https://indianexpress.com/article/sports/badminton/carolina-marin-fan-adita-rao-overcomes-injury-to-enter-semifinals-of-badminton-nationals-8468193/","keywords":["Badminton","Sports"],"creator":["Shivani Naik"],"video_url":null,"description":null,"content":"Back in December when in practice ahead of the junior nationals, Adita Rao twisted her leg, hurt a ligament and suffered a side strain. The trauma was fresh, and the worrying about aggravating it persistent. Yet, there is the natural speed in her feet – honed in the last six months, but perhaps inherited from her athlete mother – that has propelled her into the semifinals of the Badminton Senior Nationals at Balewadi. It was the foot-speed that helped her negate the big game of the talented and fit Ira Sharma in the quarterfinals, as she made a surprise run into the last four alongside Aakarshi Kashyap, Ashmita Chaliha and Anupama Upadhyay. Reading her opponent’s game and using her own quick reach at the net with an effective lunge, Adita, seeded third, would win in straight games 21-16, 21-15. Recommended for you 1 Is the All England just another port of call on the badminton Tour? 2 PV Sindhu parts ways with coach Park Tae-Sang; to be helped by ex-All England champion Hafiz Hashim 3 PV Sindhu and coach Park Tae-Sang part ways The Thane girl, who now trains in Anand (Gujarat) at coach Amrish Shinde’s academy, is herself surprised at how her game has held up, though she’s begun popping painkillers by the quarterfinals stage. “After I tripped in practice, there was that fear when striding. But I’m surprised and happy at how I’ve been playing. It’s the speed that’s brought me till here,” she says. A struggler for most of her junior years, it was serendipity that kept her in badminton and took her to Anand. She started playing at age 11 in Thane under Shinde, but soon the Railways coach moved to Hyderabad at the national camp to hone his own coaching skills. Meanwhile, Adita, 13 then, switched academies in Mumbai , travelling to Goregaon to train. Her career was dawdling away when Shinde returned to set up an academy in Gujarat. Adita would follow a full seven years after she first started training with him. This time in 2021, the training would be more rounded and focus on accentuating her strengths. Her mother, the original sprinter in the family, would leave a lucrative corporate job to move to Anand with her. “For my speed, I do a lot of cardio and running. I’m a bit of a gym freak,” she says, adding, “though I hate running. It’s not my cup of tea, but it has to be done.” Fighting spirit Fashioning herself after Carolina Marin, her favourite player, Adita says she almost wants to copy the Spaniard. “Not exactly copy because that’s tough, but I like playing aggressive like her and do shout like her on court!” she says. An attacking speedy shuttler, Adita is also a good improviser on court and known for her tenacity, and will fight till the last shuttle drops to the floor. “She’s quite tenacious. She’ll sprint, she’ll dive. She was always very hard-working,” Shinde commends. Her smash is not shabby, and alongside the buzzing retrieving, Adita has quite the package of skills when moving into the seniors – the transitioning being the faltering step of most juniors. The foot-speed needed some upper body balancing. “She had speed, but not the upper body stability to go with that earlier. In the last six months, we’ve worked on that. That’s why the results are showing,” the coach says. Advertisement Adita plays Ashmita in the semifinals on Monday, possibly the toughest opponent in Pune and the title contender. “It will be very tough against Ashmita, and we’ll try our best that Adita stays level with her and then let’s see.” Ashmita herself has the strokes, the attack and the international game pace that troubles opponents and outplays them literally. Adita will try to stave off the run of points that Ashmita can rack up. Adita’s doctor doesn’t know she’s been on court, despite him warning her that it could take up to four months to fully recover from her injuries. “The coach said let’s try and Pune’s been a happy hunting ground for me. When I played my first senior ranking tournament here, I reached the finals. Now I’m in the semis. I’m feeling good about my attacking game,” Adita says, adding that she hopes she can hit yet another speed gear with her hand-speed which isn’t as quick as her feet- yet. Advertisement For someone who was barely Maharashtra Top 4 and would struggle to breach the quarters barrier in her junior days, the onset of a senior career has brought glad tidings. There are not many who eagerly wait to get going on the senior circuit, but Adita can’t wait to get started. Aakarshi vs Anupama Almora teenager Anupama made her first semifinal of the Senior Nationals on Sunday, after first making the quarters in 2019. “But I want a medal now,” she would insist. A swimmer initially, she would move to badminton seeing the exploits of Lakshya Sen. “I used to be a swimmer. But there were no role models in swimming. Badminton had Saina (Nehwal) didi and (PV) Sindhu didi. And they won big trophies,” she would add, starting out under DK Sen before moving to Bangalore . Anupama’s father Naveen played cricket, and was determined his children will have a well-rounded childhood revolving not just around academics. She likes watching tennis and is a huge (Novak) Djokovic fan. “I wanted my kids to have that balance in life so that studies wouldn’t lead to depression. In sport, your heart learns to take a hit and bounce back. Every day is a new day.” Also Read Why America doesn’t care for Badminton Parupalli Kashyap loses passport in Amsterdam, Rajyavardhan Rathore sends... PV Sindhu opens campaign against Russian Evgeniya in China Open Winter of discontent continues for India’s shuttlers as Lakshya Sen surre... The family would put up a small Decathlon net during COVID and Naveen would himself learn the sport just so he could impart training to his daughter. “I’m a joker of all trades, master of none. But I thought I should learn badminton so I could help her! COVID was a tough time for the family and I myself had a close call, landing in the hospital. But now everything is on track,” he would say.","pubDate":"2023-02-26 17:59:42","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"},{"title":"Laura Wolvaardt’s way with the bat makes SA believe we will win a World Cup","link":"https://www.dailymaverick.co.za/article/2023-02-27-laura-wolvaardts-way-with-the-bat-makes-sa-believe-we-will-win-a-world-cup/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"In the dying overs of the final of the Women’s T20 World Cup, Laura Wolvaardt provided the country with a glimmer of hope that a cricket World Cup trophy will (eventually) come to South Africa. The post Laura Wolvaardt’s way with the bat makes SA believe we will win a World Cup appeared first on Daily Maverick.","content":"When Laura Wolvaardt’s wooden blade thrashed Australian bowlers Tahlia McGrath and Georgia Wareham to all parts of the luscious Newlands cricket ground in consecutive overs at Sunday’s T20 Women’s World Cup final, belief flooded across South Africa – even if for just a short while. Laura Wolvaardt of South Africa in action against Bangladesh. (Photo: Ashley Vlotman / Gallo Images) Players of South Africa and Australia make their way on to the Newlands, Cape Town field for the ICC Women’s T20 World Cup Final on 26 February 2023. (Photo: Mike Hewitt / Getty Images) Tazmin Brits of South Africa takes a catch to dismiss Ellyse Perry of Australia during the 2023 ICC Women’s T20 World Cup final. (Photo: Ashley Vlotman / Gallo Images) Perhaps this was the moment. Just maybe, a senior South African cricket team would go where no other side has gone and clinch a cricket World Cup trophy. It wasn’t to be and she was dismissed by Megan Schutt two overs later and that hope was destroyed. And, as the old sporting adage goes: “It’s the hope that kills you.” That hope has been dangled and snatched away from South Africa’s cricket-loving public over the past month. Visit Daily Maverick’s home page for more news, analysis and investigations South Africa came into the Women’s T20 World Cup off the back of a tri-series win over West Indies and India. They defeated India in the final of the mini-competition to claim victory. The confidence-boosting win provided hope that South Africa could finally break the country’s cricket World Cup hoodoo. Just a week later, they lost the curtain-raiser of the Women’s T20 tournament to Sri Lanka by three runs – and that hope shrunk again. But the team put their World Cup goals back on track when they found their mojo against New Zealand three days later. The South Africans then only managed to scrape past Bangladesh in their final group-stage match, which made a semifinal loss seem inevitable against the then unbeaten England. But the South Africans stepped up to produce a hope-renewing six-wicket victory over the English , the second-ranked team in the world, in the semifinal. They once more instilled belief that the improbable was possible. Chloe Tryon of South Africa fields in the ICC Women’s T20 World Cup final match against Australia at Newlands Cricket Ground. (Photo: Ashley Vlotman / Gallo Images) Fast bowler Shabnim Ismail of South Africa celebrates the wicket of Georgia Wareham of Australia in the ICC Women’s T20 World Cup final at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The Proteas were always going to be the underdogs against Australia, who were battling for their sixth consecutive T20 World Cup title against a South African side making their first appearance in a final. But fans queued for hours the day before the final to secure tickets as more than 13,000 joyous supporters in Cape Town believed that this could finally be South Africa’s day after years of cricketing heartbreak. Australia posted a competitive total of 156 for four after captain Meg Lanning won the toss and elected to bat first. South Africa’s chase got off to a poor start, sitting on 22 for one after the six-over powerplay. The scoring-rate quickly shot up to more than 10 runs an over as South Africa’s hopes of a World Cup miracle slowly drifted away. Read more in Daily Maverick : “ SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown ” But once Wolvaardt finally got going and her glorious straight blade struck the white leather slung toward her into the Oaks grass embankment off Wareham’s bowling – for her third maximum – the miracle was on the cards once more. “Laura Wolvaardt, she’s a world-class player,” said Wareham after the starlet’s innings of 61 off 48 deliveries. “I was definitely nervous when she was bombing me over my head.” Her untimely dismissal meant this World Cup dream was crushed and Australia took the World Cup honours by 19 runs – but, fortunately for South Africa, Wolvaardt has many more World Cups and many more such innings in store. “You want your players to step up on the big occasion and that’s exactly what she did. She showed her class again today at just the [young] age of 23,” said Proteas captain Suné Luus after the match. “For us as a team, it’s very exciting to know that she’s going to be here for the next 10 years. I’m so excited to be next to her and see her break all the records in the near future.” Despite the loss, there remains a sense of excitement and expectation that this team, with magical players such as Wolvaardt, will seal South Africa’s first World Cup triumph when the 50-over iteration rolls around in Bangladesh next year. DM","pubDate":"2023-02-26 22:03:16","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown","link":"https://www.dailymaverick.co.za/article/2023-02-26-sa-fail-at-final-hurdle-as-australia-clinch-record-sixth-womens-t20-world-cup-crown/","keywords":null,"creator":["Keanan Hemmonsbey"],"video_url":null,"description":"Despite a valiant effort, the Proteas Women were outplayed by a confident Australian outfit, losing by 19 runs in the final at Newlands on Sunday. The post SA fail at final hurdle as Australia clinch record sixth Women’s T20 World Cup crown appeared first on Daily Maverick.","content":"Australia captured their sixth Women’s T20 World Cup with a routine 19-run victory over South Africa at Newlands cricket ground in Cape Town on Sunday, 29 February. It was South Africa’s first appearance in a World Cup final whereas Australia were featuring in their seventh. The difference on the day was the experience of the Aussies in big-match situations. There wasn’t a major separation in performance between the two teams, but all the big moments belonged to Australia. Australia players celebrate with the trophy after winning the ICC Women ’ s T20 World Cup final against South Africa at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The first one came through luck when Australian captain Meg Lanning won the toss. She elected to bat first – a tactic both teams employed in their respective successful semifinals. Australian Beth Mooney played a sublime innings at the top of the order, striking 74 runs off 53 deliveries. Her innings contained nine fours and one six and she was ably supported by several teammates. The 156 posted by the Aussies was always going to be a daunting chase for a team playing in their first final. And so it was as every batter outside of starlet Laura Wolvaardt – who scored an incredible 61 off 48 deliveries – failed to put any runs of note on the board. South Africa’s chase got off to a characteristically measured start. But in the tense situation of a World Cup final, the pressure created by a slow start destroyed any chance of a successful run-chase by the host country. Newlands was packed for the final. (Photo: Mike Hewitt / Getty Images) Wolvaardt and Tazmin Brits scored 17 runs in the first five overs before the latter was dismissed for 10 runs off 17 balls. Every batter who came to the wicket after was immediately under pressure as the scoring rate stood at nine to the over. Stalwart Marizanne Kapp struck two quick fours, but South Africa still posted their lowest powerplay score of the tournament – 22 for one. Kapp was dismissed shortly after for a run-a-ball 11 before captain Suné Luus was run out after a terrible mix-up between herself and Wolvaardt. With South Africa well behind the required run rate, Wolvaardt and Chloe Tryon gave the capacity 13,860 Newlands crowd a glimmer of hope. Tahlia McGrath bowled two no balls in the 13th over and Wolvaardt smashed the second free hit – as a result of McGrath overstepping – for a massive six. She and Tryon took 14 off the over. The 14th and 15th over went for 25 as Wolvaardt brought up her third consecutive half century off 43 deliveries. But when the opener was trapped lbw by Megan Schutt in the 17th, it signalled the dimming of the last bit of hope for the South Africans. A couple of lusty blows by Tryon and Sinalo Jaftha at the end was not enough for South Africa to lift their first senior World Cup trophy. Australia’s comprehensive 156 for six was hard work for the No 1 team. Wickets tumbled consistently throughout their innings, but Mooney carried her bat and kept the innings together with typically sublime stroke-making. Australia had an uncharacteristically circumspect powerplay – not playing any shots of authority, but still capitalising on the loose balls. Healy and Mooney helped guide the cautious start to 36 for no loss. Healy mistimed a shorter wide ball by Kapp straight to Nadine de Klerk at cover, who took an easy catch. Shabnim Ismail cranked up the pressure by bowling the first maiden of the tournament in the sixth over to restrict Australia to 36 for one, their lowest powerplay total of the tournament. Surprisingly, Lanning pushed herself down the order from No 3, where she has batted throughout her career. She sent in big-hitter Ashleigh Gardner, who was carded to come in at No 4, ahead of her. The experiment paid off as Gardner took to the spin of Nonkululeko Mlaba and the medium pace of De Klerk. She hit Mlaba for consecutive fours before playing two elegant drives for six off De Klerk – one over mid-off and one over cover, helping Australia to 73 for one after 10 overs. Captain Luus turned to her experienced players in Kapp and Tryon as the former built pressure with tight lines and lengths before the latter struck the telling blow, dismissing Gardner for 29 off 21 deliveries. The thunderous ball striker tried to go downtown again, but only managed to sky it to Luus at long off. Nonkululeko Mlaba of South Africa celebrates taking the wicket of Grace Harris of Australia during the ICC Women’s T20 World Cup final at Newlands Cricket Ground in Cape Town on 26 February 2023. (Photo: Ashley Vlotman / Gallo Images) The pair of Mooney and Gardner shared a 46-run, 41-delivery second-wicket partnership. Australia’s go-to finisher Grace Harris then strutted in at No 4, but was soon back in the sheds after running past a Mlaba delivery that knocked her leg stump bail off its groove. Visit Daily Maverick’s home page for more news, analysis and investigations When Lanning finally joined Mooney at the crease at No 5, Kapp employed a short ball tactic to the captain which restricted the scoring. The tactic worked a treat and Lanning holed out off another Kapp short ball to Tryon at square leg, who took a tidy catch, sliding to her left. Mooney, from the other end, continued on her merry way, bringing up a second half-century in two games after scoring 54 off 37 in the semifinal against India. This one was more erratic, coming off 44 deliveries, but it was equally important for her team. From that point, the No 2-ranked batter in the world opened her shoulders and scored her next 24 runs in only nine deliveries. South Africa maintained a slow over rate throughout Australia’s innings and they could have only three fielders outside the inner ring by the final over, which was bowled by Ismail. That 20th over had it all. Mooney struck the first ball for a massive six before thwarting the second for an elegant four – both straight down the ground. She was then dropped at backward point by Wolvaardt on the third delivery before Ismail went bang-bang. She first dismissed Ellyse Perry with a slower ball that was caught by Brits, and then she cleaned up Georgia Wareham with an on-pace delivery on the fourth and fifth delivery. Perry’s wicket took Ismail to the outright leading wicket-taker in Women’s T20 World Cup history with 42, and Wareham’s scalp took her to 43. With Ismail on a hat-trick on the final delivery, Tahlia McGrath, the No 1 ranked T20 batter in the world who strangely came in at eight – managed to get some bat on the last ball and take her side to 156. DM","pubDate":"2023-02-26 21:00:22","image_url":null,"source_id":"dailymaverick","category":["sports"],"country":["south africa"],"language":"english"},{"title":"Schutt's relief at overcoming 'scary' spell to win Cup","link":"https://thewest.com.au/sport/cricket/schutts-relief-at-overcoming-scary-spell-to-win-cup-c-9878564","keywords":null,"creator":["Annesha Ghosh"],"video_url":null,"description":"Australia pace bowler Megan Schutt reckons their T20 World Cup win didn't come easily as they had to overcome a \"scary\" spell before lifting the trophy.","content":"Megan Schutt has admitted her relief that Australia overcame a \"scary\" spell when it felt their T20 World Cup victory might just be slipping away - and was adamant that their relentless winning streak never feels boring. Before her team went on to annex a sixth title in Cape Town on Sunday, South Africa's attacking 55-run fourth-wicket stand in their chase had put Australia \"under the pump\" in the final, reckoned Schutt. But with the game threatening to swing the hosts' way at the death at Newlands, it was Schutt herself who speared in a momentum-changing full ball in the 17th over which got things back on track for the serial winners. The delivery trapped opener Laura Wolvaardt lbw, breaking the half-centurion's fifty stand with Chloe Tryon, and it led to South Africa eventually falling 19 runs short. \"She (Wolvaardt) was hitting them bloody nicely - and so was Chloe,\" reflected Schutt, who shares the Adelaide Strikers dressing room with Wolvaardt. \"So, it was honestly quite scary there towards the end. \"We were under the pump, don't get me wrong ... she probably tried to play me too square and that did her in but she was hitting down the ground beautifully. Crucial wicket, but just lucky that it came off.\" Schutt, who was part of the Australian side that botched a 148-run defence in the 2016 T20 World Cup final against West Indies, said winning three 20-over world titles since then has been gratifying. \"Pretty bloody special. I mean, people keep having digs at us that winning is boring - but it's not boring for us,\" the 30-year-old said. \"Every time that we come, we come to win and this is another one we got to do in front of a crowd that felt like bloody 70,000 people. It was so damn loud, so really cool.\" Schutt took 4-0-23-1 in the final, a momentous day for the team that coincided with Meg Lanning's personal milestone of 100 T20Is as captain. Schutt attributed a large part of the team's success on the day, and across major events in recent years, to Lanning's equanimity. \"I think because she's a pretty calm character kind of rubs off on us,\" Schutt said. \"She presents this calmness. I mean, her chat before this game was cool because it was a bit more ampie, a few swear words in there - Meg doesn't swear a lot! - so that was really cool. \"She's been a leader for so long that she knows what people need to succeed -- whether that's individually or as a team.\" Head coach Shelley Nitschke also had praise for Alyssa Healy, who stood in for Lanning during her five-month break. \"Alyssa has done a fantastic job in her absence,\" Nitschke said. \"But I think Meg coming back had the team really lift, she's such a strong leader. \"I think the difference with her is now she's just back and she's just enjoying herself. She's enjoying her cricket. \"She's laughing out there, which is pleasing for everyone and we're just happy to see that.\" The day was doubly special for Nitschke, too. Having won her first World Cup as a player in South Africa 18 years ago, the 46-year-old has now added a world title to her CV as Australia's head coach, after replacing Matthew Mott in the job last year. \"It's an amazing feeling. The first one I won as a player was the first one I've been involved in as a coach, so I guess it's gone full circle.\" Sign up for our emails","pubDate":"2023-02-26 20:35:08","image_url":"https://images.thewest.com.au/publication/C-9878564/f631ddbf5b85e09466a48004c59ba5cb9c0a92da-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"Shaheen Afridi PSL 8: Mohammad Haris bat breaks into two pieces by Shaheen Shah Afridi express pace in PSL 2023","link":"https://thesportsrush.com/cricket-news-shaheen-afridi-psl-8-mohammad-haris-bat-breaks-into-two-pieces-by-shaheen-shah-afridi-express-pace-in-psl-2023/","keywords":["Cricket","Videos","Lahore Qalandars","Mohammad Haris","Pakistan Super League","Peshawar Zalmi","PSL 2023","PSL 8","Shaheen Shah Afridi"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Peshawar Zalmi wicket-keeper batter Mohammad Haris (0) has become the latest victim of Lahore Qalandars captain Shaheen Shah Afridi’s new-ball spectacle. Perhaps the most embarrassing outing of Haris’ career especially during a televised match saw him looking absolutely clueless on both the balls that he faced off Afridi. Opening the batting with captain Babar Azam… The post Shaheen Afridi PSL 8: Mohammad Haris bat breaks into two pieces by Shaheen Shah Afridi express pace in PSL 2023 appeared first on The SportsRush.","content":"Peshawar Zalmi wicket-keeper batter Mohammad Haris (0) has become the latest victim of Lahore Qalandars captain Shaheen Shah Afridi’s new-ball spectacle. Perhaps the most embarrassing outing of Haris’ career especially during a saw him looking absolutely clueless on both the balls that he faced off Afridi. Opening the batting with captain Babar Azam (7), Haris’ attempt to defend an Afridi delivery on the first ball of the innings saw his bat breaking into a couple of pieces. Haris, who was pretty much left with only the handle in his hand, had no option than to immediately ask for a new bat. Haris, however, couldn’t make use of the new bat either as he failed to make contact with the ball on the following delivery. A pinpoint in-swinging yorker targeted at hitting the stumps achieved its target after the right-handed batter played all around a ball which would’ve been difficult to just defend. Chasing a gargantuan 242-run target, Zalmi put on display a disastrous start on the back of losing their opening batters within the first three overs. It was on the penultimate delivery of his second over that Afridi produced a near-replica of Haris’ dismissal to send Azam back to the pavilion for the second time in the history of the PSL. First ball: Bat broken ⚡ Second ball: Stumps rattled 🎯 PACE IS PACE, YAAR 🔥🔥 | | — PakistanSuperLeague (@thePSLt20) Shaheen Shah Afridi 🫡 — Shai Hope (@shaidhope) Afridi, 22, ended up picking his fifth T20 five-wicket haul in a prototypical lead-from-the-front effort. In what was his second five-fer in the PSL, it witnessed the left-arm bowler also dismissing the likes of Wahab Riaz (0), Saad Masood (16) and James Neesham (12). It is worth noting that Qalandars beat Zalmi by 40 runs in the recently concluded 15th match of the ongoing eighth season of the Pakistan Super League. First PSL 8 match at the Gaddafi Stadium, it was a high-scoring entertainer allowing the home team to register the in the history of the tournament. A shambolic start was recovered to a large extent due to individual half-centuries by PZ batters Tom Kohler-Cadmore (55) and Saim Ayub (51). However, the duo falling within six deliveries after sharing a 44-ball 91-run third-wicket partnership led to the team’s downfall especially with the middle-order not contributing as per the need of the hour. Afridi’s decision of batting first after winning the toss was well-supported by his batters as Fakhar Zaman (96) and Abdullah Shafique (75) stitched a 69-ball 120-run second-wicket partnership before wicket-keeper batter Sam Billing (45*) put on board an apt finishing act. Only the second PSL 2023 double-header day, the above mentioned contest followed Karachi Kings vs Multan Sultans afternoon match. Fumbling big time to get bundled out for 101 in 16.3 overs in a 168-run chase, Sultans lost that match by as many as 66 runs at the National Stadium.","pubDate":"2023-02-26 19:10:35","image_url":null,"source_id":"thesportsrush","category":["sports"],"country":["australia","united kingdom","india","united states of america"],"language":"english"},{"title":"News24.com | 'It was the most special day': Skipper Luus proud of Proteas despite World Cup heartache","link":"https://www.news24.com/sport/Cricket/Proteas/it-was-the-most-special-day-skipper-luus-proud-of-proteas-despite-world-cup-heartache-20230226","keywords":null,"creator":null,"video_url":null,"description":"Proteas captain Sune Luus expressed her pride in her teammates after they lost their T20 World Cup final to Australia.","content":"The wait for a first-ever Cricket World Cup trophy continues for South Africa, but Proteas women's captain, Sune Luus, says she is immensely proud of what her charges achieved at their home T20 showpiece. READ | Heroic Proteas fall short in World Cup final despite Wolvaardt fireworks South Africa lost by 19 runs to six-time champions Australia in the T20 World Cup final at Newlands on Sunday, bringing the curtain down on an epic campaign that ended with 14 000 packing into the iconic stadium to support this side as they broke barriers. No Proteas side had ever contested a World Cup final, and very few would have predicted that the Proteas would be the first to do it here. They were overwhelming underdogs in their semi-final against England at the same venue on Friday, but they got over that hurdle only to meet the greatest women's cricket side in history in the tournament decider. Australia have played in the last six T20 World Cup finals, and while they were certainly pushed by the Proteas at times on Sunday, they were largely comfortable in getting over the line. What is of far more significance, though, is that this Proteas side stunned the cricketing world on their journey, winning over an often sceptical South African public in the process. The crowd on Sunday roared throughout, cheering every run that came off a South African bat. That, Luus says, is the takeaway from this tournament. \"I'm definitely proud of every teammate of mine. We've done an incredible job to get to the final, and I think to put up a fight against a team like Australia ... I just feel really proud,\" she told media after the match. \"It was the most special day we could ask for. When we started this tournament, I don't think this was something we envisioned. \"We were hoping it wasn't going to be too embarrassing with empty stadiums. We just hoped a few people would come to the games, so to see this has been next-level. \"The country was really behind us, and it was something we never really thought would happen. It was such an honour to have that opportunity to inspire a nation and to have them come out and watch us play - it was such a blessing.\" The Proteas were naturally disappointed at the end of the occasion, but Luus herself said she had been largely composed. \"You always think about a World Cup final and what it will feel like, but I was pretty chilled throughout the day. I still watched a couple of movies this morning,\" she said. \"You go through waves. There are excitement levels and a few nerves here and there. We obviously thought we had a chance while we were batting, so it obviously gives you that extra bit of excitement. \"We would have loved to win, but for us to play in a final with a sell-out crowd was amazing. \"We got a sniff of how a final is, and we now have the heartache of not winning a final. At next year's World Cup, when we get there again, it's not going to be a big thing for us anymore. \"This was a massive opportunity for our girls and they did extremely well. We gave them (Australia) a good run for their money. It obviously wasn't the result we wanted, but I just have positive feelings right now.\" The skipper also congratulated the Australians while acknowledging that South African cricket still had a long way to go from a professionalism point of view. \"They're a well-oiled machine,\" Luus said. \"Their level of professionalism is insane, and they're a team the world has been looking up to for a very long time. They're there for a reason. \"If you look at their structures and pipelines, everything is just lining up and everything is in order. It's something as a country we're definitely striving for.\"","pubDate":"2023-02-26 19:00:55","image_url":"https://scripts.24.co.za/img/sites/sport24.png","source_id":"news24","category":["sports"],"country":["south africa"],"language":"english"},{"title":"मुंबई इंडियंस को लगा बड़ा झटका, आईपीएल 2023 से बाहर हो सकते हैं जसप्रीत बुमराह, सामने आई बड़ी अपडेट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/jasprit-bumrah-likely-to-miss-ipl-2023-due-to-injury-reports/articleshow/98255997.cms","keywords":null,"creator":null,"video_url":null,"description":"टीम इंडिया और मुंबई इंडियंस के चाहने वाले जसप्रीत बुमराह के चोट से उबरने का बेसब्री से इंतजार कर रहे हैं। लेकिन अब ऐसी खबर सामने आ रही है कि जिसे सुनकर भारतीय क्रिकेट टीम और मुंबई इंडियंस के फैंस के होश उड़ जाएंगे। दरअसल, बुमराह को अभी ठीक होने में अधिक समय लगेगा।","content":"भारतीय क्रिकेट टीम के अनुभवी तेज गेंदबाज जसप्रीत बुमराह सितंबर 2022 से क्रिकेट के मैदान से दूर चल रहे हैं। कमर में लगी चोट के कारण उन्होंने लंबे समय से अंतरराष्ट्रीय क्रिकेट नहीं खेला है। हालांकि पहले कयास लगाए जा रहे थे कि जस्सी बॉर्डर गावस्कर ट्रॉफी तक पूरी तरह से ठीक हो जाएंगे। लेकिन ऐसा नहीं हुआ। वहीं उसके बाद कहा जाने लगा कि आईपीएल 2023 के शुरू होने तक बुमराह फिट हो जाएंगे। लेकिन अब उनको लेकर जैसी खबरें सामने आ रही हैं, उससे न तो भारतीय टीम खुश होगी और न तो मुंबई इंडियंस। मीडिया रिपोर्ट्स के अनुसार, भारतीय टीम और मुंबई इंडियंस के स्टार तेज गेंदबाज जसप्रीत बुमराह का आईपीएल 2023 तक फिट होना मुश्किल है। वहीं खबरें यह भी हैं कि जून में खेले जाने वाले आईसीसी वर्ल्ड टेस्ट चैंपियनशिप 2023 के फाइनल तक भी जस्सी फिट नहीं हो पाएंगे। जोकि भारतीय टीम और मुंबई इंडियंस के लिए चिंता का विषय है। ऐसा भी बताया जा रहा है कि बुमराह की चोट जैसी शुरुआत में सोची जा रहा थी उससे कई अधिक गंभीर है, गौरतलब है कि बुमराह पीठ की चोट से उबरने में सहज महसूस नहीं कर रहे हैं। रिपोर्ट्स के मुताबिक, भारतीय मैनेजमेंट अब जसप्रीत बुमराह को अक्टूबर-नवंबर तक भारत में होने वाले वनडे विश्वकप से पहले फिट करने की योजना बना रहा है। क्योंकि बुमराह भारत के मुख्य खिलाड़ियों में से एक हैं। भारत को अगर आगामी वनडे विश्वकप जीतना है तो बुमराह का टीम में होना उतना ही जरूरी है जितना कप्तान रोहित शर्मा और विराट कोहली का है। बुमराह के अगर इंटरनेशनल करियर की बात करें तो, उन्होंने भारत के लिए 30 टेस्ट, 72 वनडे और 60 T20 मुकाबले खेले हैं। जिसमें जसप्रीत ने क्रमश: 128, 121 और 70 विकेट झटके हैं। वहीं अपने आईपीएल करियर में जसप्रीत बुमराह ने खेले गए 120 मैचों में मुंबई इंडियंस के लिए 145 लिए हैं।","pubDate":"2023-02-26 18:46:04","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"टीम की हार में भी इतिहास रच गई शबनिम इस्माइल, टी20 विश्व कप में बनी सफल गेंदबाज","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/shabnim-ismail-became-the-highest-wicket-taker-in-t20-world-cup-south-africa-lost-to-australia-in-final/articleshow/98255728.cms","keywords":null,"creator":null,"video_url":null,"description":"ICC Women's T20 WC: आईसीसी महिला टी20 विश्व कप 2023 के फाइनल में साउथ अफ्रीका को 19 रन से हार का सामना करना पड़ा। इस मैच में साउथ अफ्रीका की तेज गेंदबाज शबनिम इस्माइल ने शानदार गेंदबाजी। इसके साथ ही उनके नाम एक बड़ा रिकॉर्ड भी दर्ज हो गया। शबनम टी20 विश्व कप में सबसे अधिक विकेट लेने वाली गेंदबाज बन गई हैं।","content":"आईसीसी महिला टी20 विश्व कप 2023 के फाइनल में साउथ अफ्रीका को ऑस्ट्रेलिया के खिलाफ 19 रनों से करारी हार मिली। इस मैच में साउथ अफ्रीका के सामने 157 रनों का लक्ष्य था लेकिन वह 20 ओवर में 6 विकेट के नुकसान पर 137 रन ही बना सकी। हालांकि टीम को फाइनल में हार जरूर मिली और वह चैंपियन नहीं पाई लेकिन तेज गेंदबाज शबनिम इस्माइल के नाम एक विश्व रिकॉर्ड दर्ज हो गया। शबनिम ने मैच में साउथ अफ्रीका के लिए 4 ओवर में 26 रन देकर दो विकेट अपने नाम किए। इसके साथ ही शबनिम के नाम टी20 विश्व कप के इतिहास में सबसे अधिक विकेट लेने का रिकॉर्ड दर्ज हो गया है। शबनिम टी20 विश्व कप में 32वां मैच खेलने उतरी थी। इस तरह आईसीसी के टूर्नामेंट में उनके नाम 43 विकेट दर्ज हो गए हैं। इस मामले में शबनिम ने इंग्लैंड की आन्या श्रबसोल को पीछे छोड़ा जिन्होंने टी20 विश्व कप में 41 लिए थे। हालांकि शबनिम की इस दमदार खेल के बावजूद साउथ अफ्रीका की टीम पहली बार विश्व चैंपियन बनने से चूक गई। साउथ अफ्रीका को फाइनल मैच में 19 रन से हराकर छठी बार टी20 विश्व कप की ट्रॉफी को उठाया। ऑस्ट्रेलियाई टीम सातवीं बार फाइनल में पहुंची थी। टी20 विश्व कप 2023 में ऑस्ट्रेलिया की टीम को एक भी मुकाबले में हार का सामना नहीं करना पड़ा। सेमीफाइनल में भारत के पास मौका था कि वह ऑस्ट्रेलिया को हरा कर फाइनल में अपनी जगह बनाती लेकिन यहां भी कंगारू टीम ने बाजी मार ली और भारत को हरा दिया। ऑस्ट्रेलिया के लिए फाइनल मैच में ओपनर बल्लेबाज बेथ मूनी धमाकेदार बल्लेबाजी की थी। मूनी ने 53 गेंद में शानदार 74 रनों की पारी खेली जिसमें उन्होंने 9 चौके और 1 छक्का भी लगाय। मूनी की इस बल्लेबाजी के कारण ही ऑस्ट्रेलिया की टीम ने 156 रन के स्कोर पर पहुंच पाई। मूनी के अलावा एश्ले गार्डनर ने भी 29 रनों का महत्वपूर्ण योगदान दिया। वहीं विकेटकीपर बल्लेबाज एलिसा हिली ने भी 17 रनों की पारी खेली।","pubDate":"2023-02-26 18:15:19","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"सेमीफाइनल में भारत को जख्म देने वाली गार्डनर ने फाइनल में भी किया कमाल, बनी प्लेयर ऑफ द टूर्नामेंट","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/ashleigh-gardner-won-player-of-tournament-award-icc-t20-women-worldcup-2023/articleshow/98255642.cms","keywords":null,"creator":null,"video_url":null,"description":"ऑस्ट्रेलिया ने आईसीसी टी20 विश्वकप 2023 के फाइनल में मेजबान दक्षिण अफ्रीका को 19 रन से करारी शिकस्त दी है। जिसके चलते वह छठी बार वर्ल्ड चैंपियन बन गए हैं। वहीं एश्ले गार्डनर को उनकी पूरे टूर्नामेंट में जबरदस्त परफॉरमेंस के लिए \"प्लेयर ऑफ द टूर्नामेंट' के अवॉर्ड से भी नवाजा गया है।","content":"दक्षिण अफ्रीका और ऑस्ट्रेलिया के बीच महिला टी20 विश्वकप 2023 का फाइनल मुकाबला 26 फरवरी रविवार को केपटाउन के न्यूलैंड्स क्रिकेट ग्राउंड में खेला गया। जिसमें ऑस्ट्रेलिया ने मेजबानों को 19 रन से मात दी और छठी बार आईसीसी टी20 महिला वर्ल्डकप की चमचमाती ट्रॉफी अपने नाम कर ली। वहीं कंगारू टीम की स्टार ऑलराउंडर एश्ले गार्डनर को 'प्लेयर ऑफ द टूर्नामेंट' चुना गया। जिसके बाद उन्होंने बड़ा बयान भी दिया है। ऑस्ट्रेलिया क्रिकेट टीम की स्टार ऑलराउंडर एशले गार्डनर ने प्लेयर ऑफ द टूर्नामेंट चुने जाने के बाद कहा कि वे (ऑस्ट्रेलिया टीम) पिछले विश्वकप के बाद से ही इस वर्ल्डकप को जीतने के बारे में बात कर रहे थे। साथ ही उन्होंने इस बात का भी जिक्र किया कि वह इस टूर्नामेंट में कई चरणों में जीतने की स्थिति में नहीं थे। एश्ले गार्डनर ने कहा ' हम पिछले विश्व कप के बाद से इस पल के लिए तरस रहे थे। हम कुछ फेजिज में जीतने की स्थिति में नहीं थे।' आपको बता दें कि भारत और ऑस्ट्रेलिया के बीच खेले गए विश्वकप के पहले सेमीफाइनल में एश्ले गार्डनर ने अपनी टीम के लिए बल्ले से महत्वपूर्ण पारी खेली थी। उन्होंने 5 चौकों की मदद से महज 18 गेंदों में 31 रन जड़े थे। इस दौरान उनका स्ट्राइक रेट 172.72 का था। एश्ले ने भारत के खिलाफ खेली गई इस पारी को टूर्नामेंट की अपनी सबसे बेहतरीन पारी माना है। उन्होंने कहा, 'भारत के खिलाफ सेमीफाइनल में बल्ले से प्रदर्शन मेरे लिए इस टूर्नामेंट का सर्वश्रेष्ठ था। हमने यह टूर्नामेंट जीत लिया है। हमने ऐसा करने के बारे में बात करते थे, इसलिए वास्तव में मुझे गर्व है। मेरी गेंदबाजी में विश्वास है। मैंने बिग बैश में भी काफी गेंदबाजी की थी। शुक्र है कि मेरी फॉर्म इंटरनेशनल क्रिकेट में भी आ गया।' एश्ले गार्डनर ने टी20 वर्ल्डकप 2023 में खेले गए 6 मुकाबलों में 12.50 की औसत से गेंदबाजी करते हुए 10 विकेट झटके। तो वहीं बल्ले से उन्होंने कुल 110 रन भी बनाए। एश्ले का प्रदर्शन दक्षिण अफ्रीका के खिलाफ फाइनल में भी सांतवे आसमान पर था। उन्होंने पहले बल्लेबाजी करते हुए 29 रन की अच्छी पारी खेली। फिर उसके बाद 4 ओवर में सिर्फ 20 रन देकर 1 बहुमूल्य विकेट भी झटका।","pubDate":"2023-02-26 18:02:17","image_url":null,"source_id":"navbharattimes","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Who would you pick? Spin trio set for Indore, Renshaw on the outer","link":"https://www.theage.com.au/sport/cricket/who-would-you-pick-spin-trio-set-for-indore-renshaw-on-the-outer-20230226-p5cnoj.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"The Age and The Sydney Morning Herald convened a selection panel of former greats to pick a team to claw back some momentum when the India Test series resumes on Wednesday.","content":"Scroll down to see who our panel of selection experts has picked for the third Test, starting Wednesday in Indore. And have your say by voting for your preferred XI. Delhi: Barring an unexpectedly grassy pitch, Australia are set to keep their seldom-seen spin trio configuration in concert with the recalled Cameron Green and Mitchell Starc for the Indore Test. Australia went 2-0 down to India in a hectic second Test match in Delhi, but it was not the returns of the three spinners Nathan Lyon, Todd Murphy and Matt Kuhnemann that put them there. Todd Murphy leaps with joy after Matt Kuhnemann claims Virat Kohli for a maiden Test wicket. Credit: Getty Images. A selection of experts polled by The Age and The Sydney Morning Herald have pointed strongly towards the retention of three spinners now that Green and Starc are available. Mark Taylor, Brad Haddin, Matthew Hayden and Mitchell Johnson all included Murphy, Kuhnemann and Lyon in their teams. The record of the central Indian venue, switched for Dharamshala at late notice by the BCCI, is one of sharp spin and lavish returns for Ravichandran Ashwin in particular. With that in mind, Starc and Green loom as enablers for the retention of Kuhnemann and Murphy alongside senior spin bowler Lyon. Of the experts consulted, only former Australian captain and selector Greg Chappell argued for the choice of a second specialist fast bowler, naming Scott Boland ahead of Kuhnemann. “Pick our best bats and best bowlers, play to our strengths and bat with more discipline,” Chappell explained. Johnson came through with the other outlier, suggesting Travis Head should captain the side rather than Steve Smith. Peter Handscomb, who has acquitted himself ably with the bat in the first two Tests without going on to a century, stated that Murphy and Kuhnemann should be persevered with after what they showed together in Delhi. “We had a debutant and a second-gamer bowling in tandem trying to win a Test match for Australia, and it’s not often that happens,” Handscomb said. “I was excited for those two boys, and they’ll both be better for it. They bowled very well, and they’ll get more rewards if we keep backing it all in. “There’s a lot of excitement as well with the first two games. It’s so fickle, small moments over here can mean a big difference, so yes we’ve lost these two Tests, once very convincingly and in the other we were in a very good position, but it’s only small moments that would change that to a win for us.” Starc bowled quickly and well in Australia’s final Delhi training session before flying to Indore on Sunday afternoon, while Green also showed decent rhythm when bowling almost exclusively around the wicket to the touring side’s left-handers. Selection intrigue: Cameron Green. Credit: Getty Images With Pat Cummins out of the Test and possibly the series as he spends precious time at home with his mother in palliative care, Australia’s options for Indore are somewhat simplified. Head is set to keep opening alongside Usman Khawaja, while David Warner spends time at home as his fractured elbow heals. Green is certain to replace Matt Renshaw after the Queenslander’s underwhelming displays in the first two Tests, the second where he played one innings as a concussion substitute for Warner. While highly rated as a long-term player for the future, Renshaw’s three innings in India so far have been characterised by imprecision in dealing with his first few balls, resulting in a trio of lbw dismissals: once to Ravindra Jadeja and twice to Ashwin. The only other options in the squad are the back-up pace bowlers Boland and Lance Morris, who remained in India on standby for the event of Cummins not returning in time for the Indore Test. But their chances of playing rest chiefly on scenarios where there is either an injury to one of the first-choice bowlers, or the surface happens to exhibit the sorts of lively qualities enjoyed by the Australian XI that beat India in Nagpur in 2004 to seal the team’s only Test series win in India for the past 50 years. Taylor’s team Mark Taylor wants to see the best four bowlers picked for the conditions, meaning that in the event of a spinning track, Matt Kuhnemann plays, but if there is some help for the seamers, Scott Boland takes his place. Travis Head is opening only as a stopgap on south Asian pitches: a long-term replacement for Warner still needs to be found. Haddin’s team A very similar configuration to Taylor’s, favouring the three spin bowlers alongside Cameron Green and Mitchell Starc. It’s a long way from the teams fielded on Haddin’s 2008 tour of India, where Cameron White was the sole chosen spin bowler for three Tests, before Jason Krejza made his Nagpur debut in the last. Chappell’s team Picking the best bowlers available is a key tenet of Greg Chappell’s XI, meaning the outstanding displays of Boland in Test cricket thus far outweigh the conditional factors that saw Kuhnemann make his debut in Delhi. At the same time, he is looking to see all players bat with more discipline. Johnson’s team Much discussion was provoked by the dumping of Head for the first Test in Nagpur. On his recall for Delhi, Head played a second innings of 43 that was brimful of attacking shots – enough to make India briefly nervous. Johnson has underlined Head’s importance to the future of the team by naming him as his preferred captain. Hayden’s team Of the five experts consulted, only Hayden has been present in India for each of the first two Tests. His team favours a triumvirate of spin bowlers after watching closely the conditions presented in Nagpur, Delhi and likely to be repeated for Indore. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-02-26 18:00:00","image_url":null,"source_id":"theage","category":["sports"],"country":["australia"],"language":"english"},{"title":"Carolina Marin fan Adita Rao overcomes injury to enter semifinals of badminton nationals","link":"https://indianexpress.com/article/sports/badminton/carolina-marin-fan-adita-rao-overcomes-injury-to-enter-semifinals-of-badminton-nationals-8468193/","keywords":["Badminton","Sports"],"creator":["Shivani Naik"],"video_url":null,"description":null,"content":"Back in December when in practice ahead of the junior nationals, Adita Rao twisted her leg, hurt a ligament and suffered a side strain. The trauma was fresh, and the worrying about aggravating it persistent. Yet, there is the natural speed in her feet – honed in the last six months, but perhaps inherited from her athlete mother – that has propelled her into the semifinals of the Badminton Senior Nationals at Balewadi. It was the foot-speed that helped her negate the big game of the talented and fit Ira Sharma in the quarterfinals, as she made a surprise run into the last four alongside Aakarshi Kashyap, Ashmita Chaliha and Anupama Upadhyay. Reading her opponent’s game and using her own quick reach at the net with an effective lunge, Adita, seeded third, would win in straight games 21-16, 21-15. Recommended for you 1 Is the All England just another port of call on the badminton Tour? 2 PV Sindhu parts ways with coach Park Tae-Sang; to be helped by ex-All England champion Hafiz Hashim 3 PV Sindhu and coach Park Tae-Sang part ways The Thane girl, who now trains in Anand (Gujarat) at coach Amrish Shinde’s academy, is herself surprised at how her game has held up, though she’s begun popping painkillers by the quarterfinals stage. “After I tripped in practice, there was that fear when striding. But I’m surprised and happy at how I’ve been playing. It’s the speed that’s brought me till here,” she says. A struggler for most of her junior years, it was serendipity that kept her in badminton and took her to Anand. She started playing at age 11 in Thane under Shinde, but soon the Railways coach moved to Hyderabad at the national camp to hone his own coaching skills. Meanwhile, Adita, 13 then, switched academies in Mumbai , travelling to Goregaon to train. Her career was dawdling away when Shinde returned to set up an academy in Gujarat. Adita would follow a full seven years after she first started training with him. This time in 2021, the training would be more rounded and focus on accentuating her strengths. Her mother, the original sprinter in the family, would leave a lucrative corporate job to move to Anand with her. “For my speed, I do a lot of cardio and running. I’m a bit of a gym freak,” she says, adding, “though I hate running. It’s not my cup of tea, but it has to be done.” Fighting spirit Fashioning herself after Carolina Marin, her favourite player, Adita says she almost wants to copy the Spaniard. “Not exactly copy because that’s tough, but I like playing aggressive like her and do shout like her on court!” she says. An attacking speedy shuttler, Adita is also a good improviser on court and known for her tenacity, and will fight till the last shuttle drops to the floor. “She’s quite tenacious. She’ll sprint, she’ll dive. She was always very hard-working,” Shinde commends. Her smash is not shabby, and alongside the buzzing retrieving, Adita has quite the package of skills when moving into the seniors – the transitioning being the faltering step of most juniors. The foot-speed needed some upper body balancing. “She had speed, but not the upper body stability to go with that earlier. In the last six months, we’ve worked on that. That’s why the results are showing,” the coach says. Advertisement Adita plays Ashmita in the semifinals on Monday, possibly the toughest opponent in Pune and the title contender. “It will be very tough against Ashmita, and we’ll try our best that Adita stays level with her and then let’s see.” Ashmita herself has the strokes, the attack and the international game pace that troubles opponents and outplays them literally. Adita will try to stave off the run of points that Ashmita can rack up. Adita’s doctor doesn’t know she’s been on court, despite him warning her that it could take up to four months to fully recover from her injuries. “The coach said let’s try and Pune’s been a happy hunting ground for me. When I played my first senior ranking tournament here, I reached the finals. Now I’m in the semis. I’m feeling good about my attacking game,” Adita says, adding that she hopes she can hit yet another speed gear with her hand-speed which isn’t as quick as her feet- yet. Advertisement For someone who was barely Maharashtra Top 4 and would struggle to breach the quarters barrier in her junior days, the onset of a senior career has brought glad tidings. There are not many who eagerly wait to get going on the senior circuit, but Adita can’t wait to get started. Aakarshi vs Anupama Almora teenager Anupama made her first semifinal of the Senior Nationals on Sunday, after first making the quarters in 2019. “But I want a medal now,” she would insist. A swimmer initially, she would move to badminton seeing the exploits of Lakshya Sen. “I used to be a swimmer. But there were no role models in swimming. Badminton had Saina (Nehwal) didi and (PV) Sindhu didi. And they won big trophies,” she would add, starting out under DK Sen before moving to Bangalore . Anupama’s father Naveen played cricket, and was determined his children will have a well-rounded childhood revolving not just around academics. She likes watching tennis and is a huge (Novak) Djokovic fan. “I wanted my kids to have that balance in life so that studies wouldn’t lead to depression. In sport, your heart learns to take a hit and bounce back. Every day is a new day.” Also Read Why America doesn’t care for Badminton Parupalli Kashyap loses passport in Amsterdam, Rajyavardhan Rathore sends... PV Sindhu opens campaign against Russian Evgeniya in China Open Winter of discontent continues for India’s shuttlers as Lakshya Sen surre... The family would put up a small Decathlon net during COVID and Naveen would himself learn the sport just so he could impart training to his daughter. “I’m a joker of all trades, master of none. But I thought I should learn badminton so I could help her! COVID was a tough time for the family and I myself had a close call, landing in the hospital. But now everything is on track,” he would say.","pubDate":"2023-02-26 17:59:42","image_url":null,"source_id":"indianexpress","category":["sports"],"country":["india"],"language":"english"}]}