{"newsArray":[{"title":"SL vs PAK, 1st Test: Cricketing action in the island nation continues despite lives being at a standstill","link":"https://www.indiatvnews.com/sports/cricket/sl-vs-pak-1st-test-cricketing-action-in-the-island-nation-continues-despite-lives-being-at-a-standstill-day-1-live-updates-live-scores-2022-07-16-792485","keywords":null,"creator":null,"video_url":null,"description":"Galle| It just seems like yesterday that the Sri Lankan tigers pulled off a Test match win against the mighty Aussies who were playing dominant Test cricket under the leadership of pacer Pat Cummins. Australia defeated Sri Lanka in the first Test match but Sri Lanka returned the favor by inflicting a heavy loss on the Aussies by an innings which leveled the series for the hosts. After the conclusion of the Australia series, it is now time for Pakistan to take on Sri Lanka for a two-match Test series.","content":"Galle| It just seems like yesterday that the Sri Lankan tigers pulled off a Test match win against the mighty Aussies who were playing dominant Test cricket under the leadership of pacer . Australia defeated Sri Lanka in the first Test match but Sri Lanka returned the favor by inflicting a heavy loss on the Aussies by an innings which leveled the series for the hosts. After the conclusion of the Australia series, it is now time for Pakistan to take on Sri Lanka for a two-match Test series. Right now Sri Lanka is facing one of the worst economic they have seen since their independence. There is a shortage of basic amenities such as fuel, medicine, and food, their president has resigned and this has brought the country to a standstill. It is the spirit of the people that have kept the country going and so has its passion for the game. There are a lot of protests going on in the country at the moment, crowds have hijacked the president's house and things just keep on getting worse but no protestor or political party has tried to put the game in a bad light as they know that these tours generate foreign exchange which is important for Sri Lanka at the moment. The Australian tour pumped in an estimated USD 2 million to Sri Lanka Cricket. This resulted in the tourism industry benefitting with hundreds of Australian fans turning up for the matches that ended in a 1-1 draw. On the flip side, the Pakistan series will not generate as much as revenue but looking at the economic crisis, the tour holds a lot more value. The Sri Lankan government is trying its best to host the Asia Cup later next month, but there are chances that the multi-nation event might get shifted to the United Arab Emirates. Just like the Australian series, the Asia Cup will generate several million dollars for Sri Lanka and this in many ways will help the island nation to come out of the crisis.","pubDate":"2022-07-16 05:54:12","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Babar Azam's message to Kohli: 'This too shall pass. Stay strong'","link":"https://www.sentinelassam.com/sports/cricket/babar-azams-message-to-kohli-this-too-shall-pass-stay-strong-602801","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Babar Azam posted an image of him walking with Kohli on twitter and wrote, “This too shall pass. Stay strong. #ViratKohli.”","content":"LAHORE: Pakistan skipper Babar Azam has come out in support of the embattled Virat Kohli , whose lean patch with the bat has extended for more than two years, saying this phase too shall pass and he will come out stronger. Recently, legendary cricketers such as Kapil Dev and Sunil Gavaskar have been critical of Kohli's performance, with the former saying he should be dropped from the side and the latter indicating that some senior players are getting preferential treatment by being allowed to pick and choose which series they want to play. While Kohli continues to dish out one lacklustre performance after another, making just 16 runs in the second ODI against England on Thursday, which India lost by 100 runs at Lord's after he missed the first game with a groin injury, Babar Azam took to social media to back one of India's most successful former captains. The right-handed Kohli has now gone 77 consecutive international innings without reaching three figures, after scores of 1 and 11 in the T20I series against England and failures in the rescheduled fifth Test at Edgbaston. India's T20I squad to take on the West Indies is also missing Kohli's name, with Jasprit Bumrah and Yuzvendra Chahal rested for the same tour. With a T20 World Cup around the corner in Australia and World Test Championship points needed to keep up in a race for next year's final, Kohli's place in the team has been debated by fans and former legends, though his Pakistani counterpart has extended his support via social media. Babar Azam posted an image of him walking with Kohli on twitter and wrote, \"This too shall pass. Stay strong. #ViratKohli.\" Fans, though, were surprised with Azam's concern for the India batter, saying he shouldn't be praising a rival team cricketer. While Kohli's stocks have plummeted, Babar Azam has been going great guns in all three formats of the game. Making international centuries in recent series against Australia and the West Indies, as well as a T20I half-century against Australia in Lahore last month, the Pakistan skipper is top of the list in the ICC batting rankings for both ODI and T20Is, and fourth in Test cricket. IANS Also Read: India fast bowler Navdeep Saini signs up with Kent English County Also Watch:","pubDate":"2022-07-16 04:30:00","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/16/365134-virat-kohli-and-babar-azam.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"India fast bowler Navdeep Saini signs up with Kent English County","link":"https://www.sentinelassam.com/sports/cricket/india-fast-bowler-navdeep-saini-signs-up-with-kent-english-county-602794","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Saini, 29, has represented India in two Tests, eight ODIs and 11 T20Is, picking two, six and 13 wickets respectively.","content":"LONDON: English County side Kent on Friday announced that they have signed up India fast bowler Navdeep Saini for up to three matches in County Championship and five Royal London Cup matches, subject to visa and regulatory approval. Saini, 29, has represented India in two Tests, eight ODIs and 11 T20I s, picking two, six and 13 wickets respectively. He was last seen in the Indian jersey during their white-ball tour of Sri Lanka last year. Saini plays for Delhi in domestic cricket and represented Rajasthan Royals in IPL 2022. Saini also becomes the fifth Indian player to sign up for the English domestic cricket season in 2022 after Cheteshwar Pujara (Sussex), Washington Sundar (Lancashire), Krunal Pandya (Warwickshire) and Umesh Yadav (Middlesex). IANS Also Read: Nordea Open: Pablo Carreno Busta reaches Bastad semi final Also Watch:","pubDate":"2022-07-16 04:16:42","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/16/365122-navdeep-saini-signs-up-with-kent-for-county-championship-royal-london-1406909.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC media rights: Global body stresses on going e-auction way in case of tie","link":"https://www.indiatvnews.com/sports/cricket/icc-media-rights-global-body-stresses-on-going-e-auction-way-in-case-of-tie-protocol-of-sealed-bids-still-in-place-2022-07-16-792456","keywords":null,"creator":null,"video_url":null,"description":"After the IPL media rights auction and all the frenzy surrounding it, the International Cricket Council (ICC) has now announced that it is open to accepting bids for the new media rights starting in 2024. ICC looks to release the first \"Invitation To Tender\" (ITT) for the next cycle of ICC events that begins in the year 2024. On June 20, Monday, the ICC announced that the bid is targeted at the Indian market only with six different packages available TV only, digital-only, or a combination of both.","content":"After the media rights auction and all the frenzy surrounding it, the International Cricket Council (ICC) has now announced that it is open to accepting bids for the new media rights starting in 2024. ICC looks to release the first \"Invitation To Tender\" (ITT) for the next cycle of ICC events that begins in the year 2024. On June 20, Monday, the ICC announced that the bid is targeted at the Indian market only with six different packages available TV only, digital-only, or a combination of both. Earlier this year, broadcast giant Viacom 18 sealed the IPL media rights deal, courtesy of a record INR 23,578 crore bid via an e-auction and it looks like ICC is all set to go the same way. The ICC has stated that it is open to going towards e-auctions for the sale of media rights if the bidders quote an identical sum of money in the opening round. The ICC media rights auction stands on a very different ground this time around as this is the first time when men’s and women’s rights will be sold separately, and the parties interested can bid for 16 Men’s events (over 8 years) and six Women’s events (over 4 years), totaling 362* and 103* matches respectively. The broadcasters or channels in contention will have to submit a probable bid for the first four years of the men's event. On the other hand, the option for submitting bids for an eight-year partnership is also in place. Clearing the air around all the confusion surrounding the bids, the ICC on June 13, 2022, sent out a clarification that states that the bidding process for the 2024 cycle will begin in August. International cricket consistently attracts huge audiences and that is driving significant interest from broadcasters for ICC events. We have more than one billion fans that passionately follow the game globally, and they will be looking forward to seeing the best players in the world competing for cricket’s most prestigious trophies. “There has been a notable amount of rise in engagement in women’s cricket over the last five years and considering that we have curated a long-term strategic commitment to propel that growth and unbundling the rights for our women’s events will play a huge role in that. As of now, we are looking for a broadcast partner who gets excited by the role and will play a vital role in growing the women’s game and ensuring that more fans than ever before can enjoy it\", said ICC Chief Executive Geoff Allardice","pubDate":"2022-07-16 03:36:20","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Reece Topley takes six as England thump India to level ODI series","link":"https://www.sentinelassam.com/sports/cricket/reece-topley-takes-six-as-england-thump-india-to-level-odi-series-602787","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"With England finding some nip off the pitch, they were able to keep Rohit Sharma and Shikhar Dhawan in check with maidens in the first two overs.","content":"LONDON: Tall left-arm quick Reece Topley claimed his career-best figures in ODI cricket as England defeated India by 100 runs in the second ODI at Lord's on Thursday to level the three-match series at 1-1. After the Indian bowlers, led by Yuzvendra Chahal (4-47) bowled out England for 246, Topley made use of the favourable conditions and varied his pace to pick 6-24 in 9.5 overs, the best figures by any England bowler in ODI history as India crashed to 146 all out in 38.5 overs, taking the series to a winner-takes-it-all decider at Manchester on Sunday. With England finding some nip off the pitch, they were able to keep Rohit Sharma and Shikhar Dhawan in check with maidens in the first two overs. To'ley's show began by taking out Sharma for a ten-ball duck, getting one to come and hit the back pad. Virat Kohli, back after a groin niggle kept him out of the first ODI, looked gorgeous while playing a straight drive, on drive and cover drive against Topley. But the tall left-arm quick came back strongly to take out a scratchy Dhawan, getting him to flick off his gloves and carried behind to Buttler. India continued to wither under pressure as Rishabh Pant smacked a Brydon Carse full toss straight to mid-on. In the next over, left-arm quick David Willey claimed the big scalp of Kohli as he tried to chase a wide ball away from the body and gave an easy catch to Buttler. From 31-4, Suryakumar Yadav tried to get India's chase on track through a 42-run partnership with Hardik Pandya. But Topley, coming back for his second spell, made an immediate impact, cramping a fluent Yadav for room and chopped onto his stumps. Pandya then had a brief 28-run partnership with Ravindra Jadeja, which was snapped by Moeen Ali bowling a wide ball away fro' the former's hitting arc. By then, Pandya was into the sweep and holed out to square leg. Mohammed Shami played the long handle to perfection, hitting two fours and a majestic lofted six down the ground. But Topley brought back for his third spell of the day, got Shami to miscue a fuller slower ball in the air, and was caught by a charging mid-on. Liam Livingstone immediately struck with his part-time spin as Jadeja was clean-bowled while going for a flick. Topley claimed his five-fer by castling Chahal and two balls later, got Prasidh Krishna to edge behind to Buttler to seal a resounding win for England after a ten-wicket thrashing in the first ODI. Earlier, Chahal scalped four big wickets in the middle overs to lead another brilliant bowling show for India. It was a da' on which India's bowlers struck at regular intervals, pushing England on the backfoot to deliver a strong performance with the ball. Brief scores: England 246 in 49 overs (Moeen Ali 47, David Willey 41; Yuzvendra Chahal 4-47, Hardik Pandya 2-28) beat India 146 in 38.5 overs (Hardik Pandya 29, Ravindra Jadeja 29; Reece Topley 6-24, Liam Livingstone 1-4) by 100 runs. IANS Also Read: France into Women's European Championship quarterfinals by beating Belgium Also Watch:","pubDate":"2022-07-16 03:34:34","image_url":"https://assets.sentinelassam.com/h-upload/2022/07/16/365106-14topley-dhawan-wkt.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs IND: Yuzvendra Chahal impresses Bradd Hogg, former Australian showers praises on Indian spinner","link":"https://www.indiatvnews.com/sports/cricket/eng-vs-ind-yuzvendra-chahal-impresses-bradd-hogg-former-australian-showers-praises-on-indian-spinner-3rd-odi-old-trafford-manchester-2022-07-16-792445","keywords":null,"creator":null,"video_url":null,"description":"The India and England white-ball series is living up to all the hype and expectation that was built around it. The hosts were beaten by India in the three-match T20I series by 2-1 and the ODI series as of now stands leveled at 1 match each. The Indian outfit has lately changed its template of playing limited overs cricket and it feels similar to what former England captain Eoin Morgan had done with the English team which fetched them the ODI World Cup in the year 2019.","content":"The India and England white-ball series is living up to all the hype and expectation that was built around it. The hosts were beaten by India in the three-match T20I series by 2-1 and the ODI series as of now stands leveled at 1 match each. The Indian outfit has lately changed its template of playing limited overs cricket and it feels similar to what former England captain had done with the English team which fetched them the ODI World Cup in the year 2019. India had outplayed England completely in the first ODI match that was played at the KIA Oval and inflicted a 10-wicket loss over the hosts. In the next T20I match, England defeated India by a margin of 100 runs. But irrespective of the result, it was one player who stood out and showed some sort of fight in the second ODI and it was none other than Yuzvendra Chahal. The right arm-spinner was quick to trap England's main batters including the likes of , , , and Ben Stokes which ensured that the hosts were never reaching the 300 mark as they bundled out for 246 odd runs. The Indian leg-spinner is having an excellent run this year as he claimed the highest number of wickets in this year's Indian Premier League ( ) and bowed out of the star-studded event with the purple cap. Chahal, who turns 32 this year was somehow becoming very predictable with his bowling and skills and he was dropped out of the T20I world cup due to these persisting problems last year. The Gurugram-based leggie brought some notable changes to his game and since then he was been extremely handy with the ball and bails his team out whenever required. Former Australian spinner and Kolkata Knight Riders veteran Brad Hogg has now taken note of this and he has showered praises on Chahal's bowling. Brad Hogg feels that Yuzvendra Chahal will be India's trump card at the T20I World Cup which is slated to be held in Australia in October and November later this year. After being dropped from the T20I World Cup last year, Chahal has played 20 white ball games across two formats and taken 26 wickets.","pubDate":"2022-07-16 02:29:48","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"SL vs PAK Dream11 Team Prediction, Fantasy Cricket Hints: Sri Lanka vs Pakistan","link":"https://zeenews.india.com/cricket/sl-vs-pak-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-sl-vs-pak-1st-test-at-galle-international-stadium-galle-10-00-pm-ist-july-16-2485882.html","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka vs Pakistan Dream11 Team Prediction SL vs PAK, 1st Test - Check My Dream11 Team, Best players list of SL vs PAK, Ireland Dream11 Team Player List, New Zealand Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Sri Lanka will host Pakistan in the 2 matches Test series which starts from Saturday. Galle International Stadium will host the 1st Test between the sides. Sri Lanka made a terrific comeback in the 2nd Test where they beat Australia by an innings and 39 runs to level the series 1-1. With their win, the ICC World Test Championship Standings have changed drastically as they move to the 3rd spot with a PCT of 54.17%. Prabath Jayasuriya who made a stunning debut against Australia will keep his spot whereas left-arm spinners Lasith Embuldeniya and Praveen Jayawickrama have been overlooked for this series. Dinesh Chandimal who played his career-best knock against Australia in the 2nd Test will be the man to watch out for. They will be tested for sure as Pakistan to has a good bowling attack. Captains pose with the #SLvPAK Test series trophy : @OfficialSLC #BackTheBoysInGreen pic.twitter.com/M4vr1sMNfP — Pakistan Cricket (@TheRealPCB) July 15, 2022 Pakistan on the other hand, are heading into this series on the back of a home series defeat against Australia 1-0. The last time they toured Sri Lanka way back in 2015 and lost the series 2-1. A lot of things have changed over the course of time and they are a completely different unit right now and will fancy their chances of taking an early lead in the series. It will be a crucial series for them considering their position in the ICC World Test Championship standings where they are placed in the 4th spot with a PCT of 52.38 %. Babar Azam is confident of side doing well in this series. Match Details Sri Lanka vs Pakistan, 1st Test Venue: Galle International Stadium, Galle Date & Time: 16th July-20th July at 10:00 AM IST and Local Time Live Streaming: Sony Sports Network and Sony LIV SL vs PAK, 1st Test Probable Playing XIs Sri Lanka Pathum Nissanka, Dimuth Karunaratne (c), Kusal Mendis, Angelo Mathews, Dinesh Chandimal, Kamindu Mendis, Niroshan Dickwella (wk), Ramesh Mendis, Maheesh Theekshana, Prabath Jayasuriya, Kasun Rajitha, Oshada Fernando Pakistan Imam Ul Haq, Shan Masood, Azhar Ali, Babar Azam (c), Fawad Alam, Mohammad Rizwan (wk), Faheem Ashraf, Yasir Shah, Shaheen Shah Afridi, Hasan Ali, Nauman Ali Top Picks Batters Babar Azam Angelo Mathews All-Rounders Dhananjaya de Silva Bowlers Yasir Shah Prabath Jayasuriya: Wicketkeeper Dinesh Chandimal Dream 11 for SL vs PAK 1st Test Mohammad Rizwan, Dinesh Chandimal (c), Imam Ul Haq, Dimuth Karunaratne, Babar Azam (vc), Angelo Mathews, Faheem Ashraf, Dhananjaya de Silva, Yasir Shah, Shaheen Afridi, Prabath Jayasuriya","pubDate":"2022-07-16 02:28:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Oldest cricket club in U.S. turns 150","link":"https://www.japantimes.co.jp/sports/2022/07/16/more-sports/cricket-2/us-cricket-club-150/","keywords":["Sports"],"creator":["No Author"],"video_url":null,"description":"Baseball is America's national pastime, but in New York, a cricket club is celebrating 150 years not out thanks to the city's large immigrant communities.","content":"New York – Baseball is America’s national pastime, but in New York, a cricket club is celebrating 150 years not out thanks to the city’s large immigrant communities. Staten Island Cricket Club (SICC) is the oldest continuously active cricket club in the United States, with matches played there every year since it was founded by British armed forces officers and Wall Street traders in 1872. This could be due to a conflict with your ad-blocking or security software. Please add japantimes.co.jp and piano.io to your list of allowed sites. If this does not resolve the issue or you are unable to add the domains to your allowlist, please see this support page . We humbly apologize for the inconvenience. In a time of both misinformation and too much information, quality journalism is more crucial than ever. By subscribing, you can help us get the story right.","pubDate":"2022-07-16 01:45:34","image_url":"https://cdn-japantimes.com/wp-content/uploads/2022/07/np_file_171051.jpeg","source_id":"japantimes","country":["japan"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma questioned, Virat Kohli marked","link":"https://www.tribuneindia.com/news/sports/rohit-sharma-questioned-virat-kohli-marked-412854","keywords":null,"creator":null,"video_url":null,"description":"London, July 15Virat Kohli, who had missed India's 10-wicket win over England in the first ODI due to an injury, was in the spotlight after the 100-run defeat in the second ODI.India were bowled out for 146 in 38.5 overs on Thursday night at Lord's, with Reece Topley finishing with 6/24 in 9.5 overs.Kohli, who had started with a flourish, was dismissed in familiar fashion when he chased a ball far outside the off-stump, falling to David Willey for 16 off 25 balls.Skipper Rohit Sharma, out for a 10-ball duck, extended full support to Kohli, who has been going through a prolonged lean patch.Sharma looked agitated during the post-match press conference as he interrupted a journalist before he could complete his question on Kohli's poor run of form.Why speculation?\"Kyun ho rahi hain, yaar. Matlab mujhe samajh mein nahi aata, bhai. (Why is there so much of discussion... I can't understand this),\" he said. \"He has played so many matches, over such a long period of time. He is such a great batter, so he does not need reassurance.\"If Sharma's support was not enough, his English counterpart Jos Buttler too backed Kohli to regain his touch, and said a big knock is \"always due\" from a player of his calibre.\"I suppose in a little way it's quite refreshing for the rest of us that he (Kohli) is human and can have a couple of low scores as wellhellip; But look, he has been one of the best players, if not the best player, in ODI cricket in the world,\" the English skipper said.","content":null,"pubDate":"2022-07-16 01:37:50","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_216603008.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Supreme Court to hear BCCI’s constitution amendment plea next week","link":"https://www.tribuneindia.com/news/sports/supreme-court-to-hear-bccis-constitution-amendment-plea-next-week-412857","keywords":null,"creator":null,"video_url":null,"description":"New Delhi, July 15The Supreme Court today agreed to hear next week the Board of Control for Cricket in India's (BCCI) plea seeking to amend its constitution with regard to the tenure of its office-bearers, including president Sourav Ganguly and secretary Jay Shah.Representing BCCI, senior advocate PS Patwalia told a Bench led by Chief Justice of India (CJI) NV Ramana that the application was filed two years ago but it could not be listed due to the Covid pandemic. \"Please list this matter for urgent hearing because amendments to the constitution have been in the pipeline for two years,\" Patwalia said.Following a spot-fixing scandal in the IPL, the Justice Lodha Committee had recommended reforms in BCCI, and the recommendations were accepted by the top court. According to its recommendations, there should be a three-year cooling-off period for the BCCI's office-bearers.","content":null,"pubDate":"2022-07-16 01:37:18","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/7/2022_7$largeimg_1311053215.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England announces squad for ODI and T20I series against South Africa; Adil Rashid returns","link":"https://www.indiatvnews.com/sports/cricket/england-announces-squad-for-odi-and-t20i-series-against-south-africa-adil-rashid-returns-2022-07-16-792434","keywords":null,"creator":null,"video_url":null,"description":"The English side is currently taking on team India in a three-match ODI series which is leveled at 1-1 as of now with the series decider scheduled to be played on Sunday at Old Trafford. Before this, the English white-ball team had clashed against team India in a three-match T20I series which they lost by 2-1. England's white-ball cricket team is a fairly new unit with their captain Eoin Morgan retiring from all forms of the game and Jos Buttler taking over as the captain. The pressure of captaincy seems to be weighing the Rajasthan Royals veteran down as he is not being able to deliver what is expected out of him with the bat.","content":"The English side is currently taking on team India in a three-match ODI series which is leveled at 1-1 as of now with the series decider scheduled to be played on Sunday at Old Trafford. Before this, the English white-ball team had clashed against team India in a three-match T20I series which they lost by 2-1. England's white-ball cricket team is a fairly new unit with their captain retiring from all forms of the game and taking over as the captain. The pressure of captaincy seems to be weighing the Rajasthan Royals veteran down as he is not being able to deliver what is expected out of him with the bat. The English and Wales Cricket Board (ECB) on Friday, July 15, announced the English white-ball squad for the upcoming T20I and ODI series against South Africa National Cricket Team. Before this, the Proteas team had visited India for a five-match T20I series and they ended up faring extremely well at it. With India hosting the South African team, fans and experts had expected them to dominate and outplay the opposition, but the gritty Proteas team defeated India in the initial two matches of the five-match T20I series. South Africa's UK challenge begins on July 19 and will go on till July 31. Both the teams have their sights set on the T20I world cup and they will have loads of work to do, especially England who are plagued by injury concerns at the moment and are only picking players who are completely fit and are ready to take the field. Courtesy of his amazing performances in four Test matches, Durham's right-arm pacer Matthew Potts has been called up for the English ODI team. Yorkshire leg-spinner Adil Rashid returns to both the ODI and T20I squads and the 34-year-old Yorkshire leg-spinner will want to have an impact on all the games that he plays. The Jos Buttler-led side will also see the return of Yorkshire wicketkeeper-batsman who was rested when India took the field against England in the T20I series. Owing to workload and fitness concerns, Ben Stokes has been rested for the T20I series and he is also set to miss The Hundred competition. Jos Buttler (captain), , Jonathan Bairstow, Brydon Carse, Sam Curran, Liam Livingstone, Craig Overton, Matthew Potts, Adil Rashid, , , Phil Salt, Ben Stokes, Reece Topley, David Willey. Jos Buttler (captain), Moeen Ali, Jonathan Bairstow, Harry Brook, Sam Curran, Richard Gleeson, Chris Jordan, Liam Livingstone, Dawid Malan, Adil Rashid, Jason Roy, Phil Salt, Reece Topley, David Willey.","pubDate":"2022-07-16 01:27:30","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"No money for Commonwealth Games, Sri Lankan athletes get a cricket boost","link":"https://indianexpress.com/article/sports/cricket/no-money-for-commonwealth-games-sri-lankan-athletes-get-a-cricket-boost-8032390/","keywords":["Cricket","Sports"],"creator":["Mihir Vasavda"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-16 01:27:15","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Reece Topley: How music and micro-economics helped England's Lord's hero return to cricket after 4 stress fractures in 5 years - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMipgFodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvc3BvcnRzL2NyaWNrZXQvaW5kLXZzLWVuZy1yZWVjZS10b3BsZXktbXVzaWMtYW5kLW1pY3JvLWVjb25vbWljcy1oZWxwZWQtZW5nbGFuZHMtbG9yZHMtcmV0dXJuLXRvLWNyaWNrZXQtNC1zdHJlc3MtZnJhY3R1cmVzLTgwMzA0MTMv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Reece Topley: How music and micro-economics helped England's Lord's hero return to cricket after 4 stress fractures in 5 years  The Indian ExpressJuly 14 marks the moment Reece Topley moved to the top of the English ODI game  ESPNcricinfoIndia vs England: Reece Topley Registers Best England Bowling Figures In An ODI With Six-Wicket Haul..  NDTV Sports'It's His Place Now..': Ex-England Cricketer Lauds Reece Topley's Performance  News18\"Rohit Sharma's wicket was outstanding\" - Aakash Chopra lauds Reece Topley's spell in 2nd India vs England ODI  SportskeedaView Full coverage on Google News","content":null,"pubDate":"2022-07-16 01:08:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps hang on to steal one-run victory over Ireland","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-hang-on-to-steal-one-run-victory-over-ireland/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps have done it again, sneaking home against Ireland and winning the third one-day international by a single run. Ireland looked to be coasting with five overs to go in Dublin, in their hunt to overtake the Black Caps' formidable 360 runs. Centuries from Paul Stirling (120) and Harry Tector (108) set the platform for Ireland, who at one stage were at 271 for three, but quick wickets and tight bowling saw the Irish's chase start to collapse. The hosts still had a shot and needed 10 runs off the final over, and then three runs from the final ball. But they could only scramble through for a bye on the last ball, giving the Kiwis the victory by the slimmest of margins and the 3-0 series sweep. It was the second heartbreaking loss for Ireland, who could have won the first ODI if not for the heroics of Black Caps all-rounder Michael Bracewell. Earlier, New Zealand reached 360 for six with opener Martin Guptill, who took out the player of the match award, top scoring with 115. Black Caps captain Tom Latham was delighted with the way his side responded to Ireland's challenge. \"We saw it as the best wicket we've seen [all series] … We thought we would get a good score on the board and we'll be able to defend it. \"Full credit to the way Ireland came out and played. I thought Harry [Tector] and Paul Stirling put on a wonderful partnership. They certainly put us under pressure but really happy with the way our guys responded, especially in the last 10 overs being put under all that pressure by a quality side. It's nice that we came out on top.\" The Black Caps bowlers managed to get the job done in the end, with Mitch Santner's three for 71 crucial in the second spell. Matt Henry was also massive, bagging four for 68. Latham praised Santner and the rest of the bowling team. \"[Santner] was great. Obviously he's a world class bowler who has great control. And certainly in those phases of the game when guys are coming at him, he's a pretty crafty customer. I thought all the guys that came in that back end were looking to take wickets and they were pretty clear on the plans, in terms of what they wanted to do. I thought it was a great effort towards the back end.\" The Black Caps will next face Ireland in a three-match T20 series, starting on Tuesday morning (3am).","content":"The Black Caps have done it again, sneaking home against Ireland and winning the third one-day international by a single run. Ireland looked to be coasting with five overs to go in Dublin, in their hunt to overtake the Black Caps' formidable 360 runs. Centuries from Paul Stirling (120) and Harry Tector (108) set the platform for Ireland, who at one stage were at 271 for three, but quick wickets and tight bowling saw the Irish's chase start to collapse. The hosts still had a shot and needed 10 runs off the final over, and then three runs from the final ball. But they could only scramble through for a bye on the last ball, giving the Kiwis the victory by the slimmest of margins and the 3-0 series sweep. It was the second heartbreaking loss for Ireland, who could have won the first ODI if not for the heroics of Black Caps all-rounder Michael Bracewell. Earlier, New Zealand reached 360 for six with opener Martin Guptill, who took out the player of the match award, top scoring with 115. Black Caps captain Tom Latham was delighted with the way his side responded to Ireland's challenge. \"We saw it as the best wicket we've seen [all series] … We thought we would get a good score on the board and we'll be able to defend it. \"Full credit to the way Ireland came out and played. I thought Harry [Tector] and Paul Stirling put on a wonderful partnership. They certainly put us under pressure but really happy with the way our guys responded, especially in the last 10 overs being put under all that pressure by a quality side. It's nice that we came out on top.\" The Black Caps bowlers managed to get the job done in the end, with Mitch Santner's three for 71 crucial in the second spell. Matt Henry was also massive, bagging four for 68. Latham praised Santner and the rest of the bowling team. \"[Santner] was great. Obviously he's a world class bowler who has great control. And certainly in those phases of the game when guys are coming at him, he's a pretty crafty customer. I thought all the guys that came in that back end were looking to take wickets and they were pretty clear on the plans, in terms of what they wanted to do. I thought it was a great effort towards the back end.\" The Black Caps will next face Ireland in a three-match T20 series, starting on Tuesday morning (3am).","pubDate":"2022-07-16 00:34:20","image_url":"https://www.newstalkzb.co.nz/media/qnegyqxu/black-caps-getty.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Agha set to make debut, Fawad out","link":"https://www.thenews.com.pk/print/974055-agha-set-to-make-debut-fawad-out","keywords":null,"creator":null,"video_url":null,"description":"GALLE: All-rounder Salman Ali Agha will make his debut when Pakistan take on Sri Lanka in their first Test at Galle International Cricket Stadium here on Saturday.Leg-spinner Yasir Shah and all-rounder Mohammad Nawaz return to the side as seasoned batsman Fawad Alam who struggled during the recent...","content":"GALLE: All-rounder Salman Ali Agha will make his debut when Pakistan take on Sri Lanka in their first Test at Galle International Cricket Stadium here on Saturday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Leg-spinner Yasir Shah and all-rounder Mohammad Nawaz return to the side as seasoned batsman Fawad Alam who struggled during the recent home series against Australia was dropped. Salman was added to the 18-player squad for this series following an impressive run in the Quaid-e-Azam Trophy first-class tournament in the last three years. In 18 matches, since 2019-20 season, the right-hander has scored 1,629 runs at a strong average of 56.19. The 28-year-old has smashed five centuries and eight half-centuries. His off-spin snared 25 wickets. Yasir - who was instrumental in Pakistan’s 2-1 Test series win in 2015, snaring 24 wickets – will play his first Test since August 2021 after recovering from a thumb injury. Mohammad Nawaz will return after almost six years as the 28-year-old last played a Test in November 2016. Fawad has played 15 Tests since his return to the longest format in 2019. In these 15 Tests, he has scored four centuries. But he failed to manage even one fifty against Australia during the recent series. Pakistan’s XI for first Test: Babar Azam (c), Mohammad Rizwan (vc, wk), Abdullah Shafique, Azhar Ali, Hasan Ali, Imam-ul-Haq, Mohammad Nawaz, Naseem Shah, Salman Ali Agha, Shaheen Afridi and Yasir Shah.","pubDate":"2022-07-16 00:06:06","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Willey back in love with cricket","link":"https://www.thenews.com.pk/print/974061-willey-back-in-love-with-cricket","keywords":null,"creator":null,"video_url":null,"description":"LONDON: David Willey said he had found his love of cricket again after being given a second chance at an England career.The 32-year-old all-rounder helped set up Sunday’s one-day international series decider against India by starring with both bat and ball as England drew level at 1-1 in a...","content":"LONDON: David Willey said he had found his love of cricket again after being given a second chance at an England career. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ The 32-year-old all-rounder helped set up Sunday’s one-day international series decider against India by starring with both bat and ball as England drew level at 1-1 in a three-match contest with a 100-run win at Lord’s on Thursday. He made a valuable 41 with the bat and then the left-arm quick captured the prize wicket of Virat Kohli just when the star batsman was threatening to cut loose. The 32-year-son of former England batsman David Willey has been retained in the squad for Sunday’s concluding ODI against India at Old Trafford rather than be released to captain Yorkshire in Saturday’s T20 Blast finals day at Edgbaston. It is all a far cry from when he was dropped from the England squad on the eve of their triumphant 2019 50-over World Cup campaign, with Willey replaced by newly-available fast bowler Jofra Archer. But he has found joy in cricket again since being recalled by England in the Covid-affected 2020 season. “I had a bit of a patch when I didn’t bowl as well, around the time of the World Cup, and I fell out of love with the game,” he said. “But I’ve found my enjoyment and love again. When you have that, it makes you hungry to keep improving, expanding your game, developing as a player. “If you stand still, you go backwards. I think I have continued to try to improve and my love for the game helps that. “Everyone enjoys the dressing room because it’s a great place to be and that’s reflected in performances over the years.”","pubDate":"2022-07-16 00:06:06","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Benazirabad clinch Sindh leg of City Cricket tournament","link":"https://www.thenews.com.pk/print/974067-benazirabad-clinch-sindh-leg-of-city-cricket-tournament","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Shaheed Benazirabad won the Sindh-leg of the two-day City Cricket Association Tournament 2022-23 on the basis of a better run-rate after their final against Hyderabad ended in a draw here at the Hanif Mohammad High Performance Centre at the National Stadium.After the first day’s...","content":"KARACHI: Shaheed Benazirabad won the Sindh-leg of the two-day City Cricket Association Tournament 2022-23 on the basis of a better run-rate after their final against Hyderabad ended in a draw here at the Hanif Mohammad High Performance Centre at the National Stadium. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ After the first day’s play was washed out due to rain, the match started on day two. Shaheed Benazirabad’s captain Haris Khan won the toss and opted to field first. Hyderabad managed to score 277 for six in 57 overs on the back of captain Fardeen’s 62-ball 61, which included seven fours and one six. Dawood Khan top-scored with a quick-fire 75 off 56 balls and struck eight fours and two sixes. For Shaheed Benazirabad, right-arm leg-spinner Jawad Ali bagged four wickets for 60. In return, half-centuries by Haris (60,68b, nine fours) and Saddam Hussain (58,113b, eight fours, one six) helped Shaheed Benazirabad post 171 for seven in 45 overs. When stumps were drawn for the day Shaheed Benazirabad were declared winners on the basis of better run-rate. After the win, Shaheed Benazirabad’s captain Haris Khan said: “The players had the commitment to do well in the tournament and ended up winning the tournament. Our coach guided us really well and we executed the plan successfully on the field.” In the four-group 17-team Sindh-leg, Shaheed Benazirabad topped Pool B with 15 points, while Hyderabad topped Pool C with 23 points to qualify for the semi-finals. The other two teams to qualify for the semi-finals were Karachi Zone VI from Pool A with 33 points and Karachi Zone IV from Pool D with 14 points. The first semi-final was played between Karachi Zone VI and Hyderabad at the Hanif Mohammad HPC National Stadium Ground in Karachi from 6 to 7 July. On first innings lead, Hyderabad were declared winners and qualified for the final. The star performers for Hyderabad in the first semi-final were Mustafa Nasir (four for 43) and wicketkeeper-batter Akbar Khan (89,58b, six fours, eight sixes). In the second semi-final played between Shaheed Benazirabad and Karachi Zone IV at the UBL Sports Complex in Karachi, only 25.3 overs were bowled when play was stopped due to rain and no further play was possible. Shaheed Benazirabad were declared winners on the basis of more points in the group stage compared to Karachi Zone IV. Faizan Khan representing Karachi Zone V topped the batting charts with 410 runs from three matches at 102.50. Mirpurkhas’ Mohammad Saddam was second on the list with 384 runs from four outings in the tournament. Mohammad Tariq Khan, representing Karachi Zone VI, topped the bowling charts with 35 wickets from five matches. Second on the list was right-arm leg-spinner Arif Yaqoob who bagged 24 wickets from three matches.","pubDate":"2022-07-16 00:06:06","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"The Wallabies are hurting – one final effort is needed from England to seal the series in Sydney","link":"https://247newsaroundtheworld.com/sports/the-wallabies-are-hurting-one-final-effort-is-needed-from-england-to-seal-the-series-in-sydney/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World Days after Australia was gripped by a savage rugby league contest, England are… The post The Wallabies are hurting – one final effort is needed from England to seal the series in Sydney appeared first on 247 News Around The World.","content":"Days after Australia was gripped by a savage rugby league contest, England are ready to prove that fire-and-brimstone brutality exists in union too, as they strive to clinch series glory with another show of force. On Wednesday, this country came to a stand-still for the State of Origin decider between Queensland and New South Wales. Queensland triumphed and it was hailed as a shuddering oval-ball classic which has resonated on the other side of the cross-code divide, ahead of a winner-takes-all showdown at the Sydney Cricket Ground on Saturday. Days after Australia was gripped by a savage rugby league contest, England are ready to prove fire-and-brimstone brutality exists in union too, as they strive to clinch series glory in Sydney Eddie Jones’ men are hoping to clinch the three-Test series 2-1 in their decider on Saturday AUSTRALIA VS ENGLAND: THREE KEY BATTLES Nic White v Danny Care There shouldn’t be any shortage of chat and chirp in this individual duel between wily scrum-halves. White has aggravated England with his claims of dirty tricks, but is also the heartbeat of the Wallaby side. Care is back as a veteran and is an assured presence for the visitors. He is a man capable of adding precious attacking urgency. Taniela Tupou v Ellis Genge This head-to-head was a focal point last week and it should be again. Genge was fired up by the thought of being slighted by his front-row rival and went on to lead the cavalry charge up front for England. But Tupou scored a try on his return for the Wallabies and is a heavyweight threat. A big scrum and carrying battle awaits. Samu Kerevi v Owen Farrell Last week in Brisbane, Farrell relished ripping the ball from Kerevi’s grasp, a feat few have managed to achieve against the Wallabies’ wrecking ball. If you can stop Kerevi, you go a long way towards stopping Australia as a whole. This is not a like-for-like contest, but both men are absolutely vital to their teams’ chances. Kerevi has tried to develop a kicking game, while Farrell’s points are vital for England in their quest for victory. England plan to channel similar passion and intensity to shock the Wallabies again. With victory, they will win the new Ella-Mobbs Trophy as a reward for turning around a 1-0 deficit. Last week, it was Richard Cockerill who issued an eve-of-Test statement of intent which his pack backed up in fine style on the way to victory in Brisbane. On Friday, England’s forwards coach was at it again, to leave the hosts in no doubt about the ferocity coming their way. ‘We have two teams who are playing for the Test series so we are both going to be going at it,’ said the former England hooker. ‘They’ve talked themselves up, so we are going to have to match that and more. We are going to come with more physicality and with even more purpose. ‘It’s all on the line. We lost the first Test, everyone wrote us off and we were under pressure. ‘Under-pressure English teams come back really well and the boys were unbelievable in Brisbane. ‘We are looking forward to it. You want rivalry, don’t you? You want spikiness to games. ‘I don’t watch rugby league, but I watched Origin because they were going to run into each other like mad men. ‘The first 15-20 minutes (on Saturday), let’s bring it on because that’s what it is all about.’ Jamie George and his fellow England forwards must withstand a backlash from the Wallaby pack. ‘We know Dave Rennie and Michael Hooper are going to be pumping those guys up, making sure they come out firing,’ George said. ‘They’ll have steam coming out of their ears. No problem. We need to be aware that they’re a hurt animal. ‘We experienced a loss in the first Test and we know how it feels. We know the reaction it invokes. We don’t worry ourselves too much with that.’ This series has been gently simmering. Last week, Taniela Tupou’s comments about Ellis Genge managed to antagonise the England prop so much that he turned his fury on to Australia with a thunderous performance. This week, Wallaby scrum-half Nic White’s claims of English ‘dirty tricks’ have lit another fuse in the visitors’ camp. Last week, Richard Cockerill gave a statement of intent which his pack backed up in fine style – On Friday, he did it again to leave the hosts in no doubt about the ferocity coming their way The former Exeter player suggested that England have been guilty of pre-meditated wind-up tactics but Cockerill’s retort was: ‘I didn’t see one of our blokes getting sent off for a head-butt.’ That was in reference to the incident which saw Australia lock Darcy Swain dismissed in Perth, after Jonny Hill had shoved him in the face and pulled his hair. ‘We don’t want to give away silly penalties, but we don’t want to hold the guys back either,’ added Cockerill. ‘I keep hearing about the niggle that England have brought. I don’t know how Aussie rugby is, but I don’t see that as niggle. It has been pretty tame. ‘We just have to get on with our game with a good set piece, tackle hard, clean rucks, be as physical as we can, abrasive as we can and be within the laws of the game.’ An explosive contest is in prospect and it will require one final, herculean effort from a shattered England squad, at the end of a gruelling season. It is their last game before a well-earned rest. Hooker Jamie George said he expected Wallabies captain Michael Hooper (left) and head coach Dave Rennie (right) to send the players out firing, with ‘steam coming out of their ears’ It will be fascinating to see if England go hard and direct again, as they did for the majority of last week’s match. Or whether the selection of Danny Care to start at scrum-half hints at a revised plan to run the Wallabies off their feet. If it does become another punishing arm-wrestle between the sides, here’s hoping that there are not more concussions and broken limbs which have scarred this series so far. Eddie Jones’s side need to reignite the fire within, but this time they won’t have quite the same level of desperation to fuel it. The pressure has eased after the Brisbane win, but the stakes remain high. For all their improvements under Rennie, Australia are not yet a formidable force, especially without Quade Cooper and Will Skelton. For all their improvements under Rennie, Australia are not yet a formidable force, especially without No 10 Quade Cooper (above) – so England should now be expected to seal the series So England — as diminished as they are by a long casualty list — should now be expected to harness fresh momentum and seal the series. Ideally, the outline of a clear plan should be taking shape too by now, with just over a year until the next World Cup in France. Others are ahead in the evolutionary curve, so England need to catch up, in terms of sifting personnel and honing a tactical blueprint. But, once again, the result is the main thing. It always is. ‘We want to win the series,’ said Cockerill. ‘We came to win the series.’ Quite right. If England finish the job here, it will salvage their season. Post source: Daily mail Share on Social Media twitter facebook pinterest linkedin tumblr reddit whatsapp telegram","pubDate":"2022-07-15 22:49:38","image_url":null,"source_id":"247newsaroundtheworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Weather of Galle international stadium 1st Test: Pakistan vs Sri Lanka 1st Test 2022 day 1 weather forecast at Galle","link":"https://thesportsrush.com/cricket-news-weather-of-galle-international-stadium-1st-test-pakistan-vs-sri-lanka-1st-test-2022-day-1-weather-forecast-at-galle/","keywords":["Cricket","Galle","Galle International stadium","Pakistan tour of Sri Lanka 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Weather of Galle international stadium 1st Test: Pakistan would take on the high-on-confidence Sri Lankan side during the 1st Test at Galle. Despite the country being bogged down by an unprecedented economic crisis, the Sri Lankan Cricket team, akin the common Sri Lanka populace, have managed to put up a great fight against stronger opponents,… The post Weather of Galle international stadium 1st Test: Pakistan vs Sri Lanka 1st Test 2022 day 1 weather forecast at Galle appeared first on The SportsRush.","content":"Weather of Galle international stadium 1st Test: Pakistan would take on the high-on-confidence Sri Lankan side during the 1st Test at Galle. Despite the country being bogged down by an unprecedented economic crisis, the Sri Lankan Cricket team, akin the common Sri Lanka populace, have managed to put up a great fight against stronger opponents, as was on display during their recently concluded all-format series against Australia at home. The Dimuth Karunaratne-led side now await the Pakistan challenge, with Babar Azam at the helm ready to take them on at very venue – the Galle international stadium , where the former handed Australia an innings defeat to draw the Test series 1-1. With the first of the two-match Test series starting today, the visitors have surprisingly decided to play three fast bowlers, on a track which has continuously assisted the spinners match after match. Pakistan do bring back their champion leg-spinner Yasir Shah though, who returns to the side after almost a year. Sri Lanka, on the other hand, are likely to go in with three spinners, the attack which led the way against Australia recently. Pakistan team practicing in Galle ahead of the first Test starting tomorrow. #SLvPak pic.twitter.com/BMiIKyRPAD — Mazher Arshad (@MazherArshad) July 15, 2022 As per Accuweather , the sun is expected to shine nice and bright during the start of play, but with only around an hour into the morning session, there is a forecast of rain with 40% chances of the same. While the sun would hide back into the clouds from here on, clouds would engulf the entire stadium till the time of stumps on day 1 of the first Test between the two Asian rivals. The temperature is likely to remain ‘hot’ the entire day with ‘extremely humid’ conditions in store as well. All in all, barring the maximum of an hour delay during the morning session, expect the rain Gods to not mark their further presence during the entire day of the Test.","pubDate":"2022-07-15 20:53:10","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Edgbaston Birmingham pitch report Vitality Blast finals day 2022: Edgbaston T20 Blast finals day pitch report","link":"https://thesportsrush.com/cricket-news-edgbaston-birmingham-pitch-report-vitality-blast-finals-day-2022-edgbaston-t20-blast-finals-day-pitch-report/","keywords":["Cricket","T20 Blast","T20 Blast 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Edgbaston Birmingham pitch report Vitality Blast finals day 2022: The Blast’s 20th season ends with the Finals Day at Edgbaston on Saturday. The T20 Blast’s ongoing season would conclude with the Finals day to be played at the Edgbaston Cricket Ground, in Birmingham on Saturday. The first semi-final would take place between Yorkshire and Lancashire,… The post Edgbaston Birmingham pitch report Vitality Blast finals day 2022: Edgbaston T20 Blast finals day pitch report appeared first on The SportsRush.","content":"Edgbaston Birmingham pitch report Vitality Blast finals day 2022: The Blast’s 20th season ends with the Finals Day at Edgbaston on Saturday. The T20 Blast’s ongoing season would conclude with the Finals day to be played at the Edgbaston Cricket Ground, in Birmingham on Saturday. The first semi-final would take place between Yorkshire and Lancashire, while the second semi-final would see Hampshire take on Somerset. It is worth of a mention that as many as six England international players, who were bound to represent their respective counties, would have to unfortunately miss the grand finale, as they are scheduled to feature in the third and final T20I against England, with the series tied at 1-1. Jos Buttler and Liam Livingstone from Lancashire, Jonny Bairstow, Joe Root and Willey (all from Yorkshire), and all-rounder Craig Overturn (Somerset) will unfortunately not feature in the semi-final and the subsequent final and the are ruled out of the same. Over to @MattyRevis and Dom Bess for a preview of tomorrow @VitalityBlast Finals Day #OneRose pic.twitter.com/gSdpHbEDUF — Yorkshire CCC (@YorkshireCCC) July 15, 2022 Edgbaston Birmingham pitch report Vitality Blast finals day 2022 This is the same venue where Hampshire’s wicket-keeper batter Ben McDermott and skipper James Vince gave their side an ideal start to post over 180 in the first innings, and lay the foundation for a massive 104-run victory in the Quarter-final against Warwickshire. Also, this is the same venue where England completed their massive 4th innings heist ever in Test match history to chase down 378, while scoring at around five runs per Over on an average throughout the chase. The above mentions are to state the batting friendly nature of the Edgbaston pitch, which would yet again stay true to its nature today as well. Having said that, the new ball would assist the seamers early on with some movement off the deck, and would perhaps be the ideal time to put some pressure on the opposition batting line-up, which is highly likely to dominate as the game progresses. All in all, expect all the three fixtures today to be high-scoring ones, with the captains winning the Toss likely to bowl first and prefer to chase the target down. The post Edgbaston Birmingham pitch report Vitality Blast finals day 2022: Edgbaston T20 Blast finals day pitch report appeared first on The SportsRush.","pubDate":"2022-07-15 19:43:08","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"The state of play in the Ranji Trophy","link":"https://www.thehindu.com/sport/cricket/the-state-of-play-in-the-ranji-trophy/article65645497.ece","keywords":null,"creator":["\n        P.K. Ajith Kumar  \n    "],"video_url":null,"description":"India’s premier domestic cricket tournament has improved over the years, but more needs to be done to bolster its relevance and health","content":"A triumph to remember: Madhya Pradesh lifted the Ranji Trophy in 2021-22 By the time he was trapped lbw by Jalaj Saxena at the Saurashtra Cricket Association Ground in Rajkot on a warm Saturday morning in March, Yash Dubey had batted for 881 minutes and faced 591 balls. The 23-year-old, who was opening the innings for the first time in his career, had made 289. It was a monumental innings, without which Madhya Pradesh would not have been able to pile up 585 for nine (declared) against Kerala in that Ranji Trophy league match. With his heroic effort, Dubey had batted Kerala out of not just that league match but the tournament as well. Some three months later, Dubey would play another significant innings, in the final of the Ranji Trophy against Mumbai at Bengaluru. His 133 laid the foundation for another 500-plus score for Madhya Pradesh, which went on to win the match by six wickets and claim its maiden Ranji Trophy title. (Holkar won the Ranji Trophy four times in the 1940s and early 1950s before it was dissolved and replaced by a Madhya Bharat team, which later became part of the Madhya Pradesh team). Madhya Pradesh’s triumph and Dubey’s innings at Rajkot tell us a great deal about the Ranji Trophy. Even the career of the bowler who denied him what had looked an almost inevitable triple hundred tells us something about Indian cricket’s premier domestic tournament. Madhya Pradesh isn’t the only underdog to lift the Ranji Trophy in recent times. In the tournament’s previous edition (2019-20), Saurashtra was the champion. In 2016-17, Gujarat was the winner, and a year later, it was Vidarbha’s turn. Gujarat and Vidarbha, too, were kissing the Ranji Trophy for the first time. In the 88-year history of the tournament, Mumbai has been the champion 41 times, 15 of which were part of a stunning streak of successive titles from 1958-59 to 1972-73. It has contested the final on six other occasions. Two other powerhouses of Indian cricket, Karnataka and Delhi, have been champions eight and seven times respectively. So when teams with less strong traditions in cricket such as Gujarat or Uttar Pradesh (the champion in 2005-2006) go on to win the Ranji Trophy, that shows the game is growing across the country. That fact is reflected in the composition of the Indian team, especially beginning with the M.S. Dhoni era. Amol Muzumdar, Mumbai’s coach and its run-machine during his playing days, believes the BCCI can take credit for the drastic improvement in the domestic game, having built the infrastructure around the country. “Every team [in the Ranji Trophy] has got a structure to it and every team has the infrastructure,” he says. “There is a system in place and it is working for every team.” True, these days you can find excellent grounds in lesser known places such as Dindigul (Tamil Nadu), Krishnagiri (Kerala), Lahli (Haryana) or Kalyani (Bengal). The grounds are well-maintained and many of them have other facilities, such as gyms, too. But the kind of wickets you come across may not always be suitable for quality cricket. If Dubey could have been tempted to set up home on that wicket in Rajkot, there are also square turners, where lasting 15 minutes is an achievement for a top-order player. Because of such pitches — made by the host associations to help their teams win — the BCCI had even tried conducting Ranji matches at neutral venues. That experiment did not quite work, though. Not that you don’t find sporting wickets for Ranji games. For instance, the wickets at Rajkot for the matches before the decider between Kerala and Madhya Pradesh were excellent, and among the best on the domestic circuit: they encouraged both the bowlers and the batters with the right technique and temperament. But unfortunately, for what would prove the most important contest of the group, there was a wicket on which the first innings of the team batting second was not completed. Muzumdar offers a solution. “Let the Ranji games be played over five days, instead of four,” he says. That, he thinks, will take the pitch out of the equation. “Once the fifth day is added, you will not have to worry about the pitch, it will deteriorate on its own and the spinners will come into play. And our domestic cricket lacks quality spinners. In red-ball cricket, I cannot see anyone beyond R. Ashwin and Ravindra Jadeja.” The Ranji Trophy has changed in so many ways since Muzumdar’s days. Earlier, it was played on a zonal basis. So you had teams like Tamil Nadu and Karnataka competing in the South Zone or Mumbai and Maharashtra battling it out in the West Zone, with the top teams qualifying for the knock-out stage. That meant fewer games, but after the teams were divided into groups irrespective of the region, everybody began to get more games. In the pre-COVID seasons, a team would get at least eight games, even if it didn’t make it to the knock-out stage. “They opted for the current system because earlier there could be a couple of good players in a weaker side and limited opportunities would not allow them to showcase their talents,” says former India opener W.V. Raman, who forced his way into the national squad with his big scores in the South Zone Ranji Trophy. There was considerably less money in domestic cricket at that time. You hardly could have entertained thoughts of making a living by merely being a domestic cricketer. After the increase in remuneration announced by the BCCI last year, a cricketer gets paid between ₹40,000 and ₹60,000 per day. So from just one Ranji match, a player can earn up to ₹2,40,000. Playing more games is beneficial for players — and not just financially. “The current format is far better because not only do you get more games but you also get to play different teams, unlike the zonal system when you played the same teams every season,” says Jalaj, one of India’s finest all-rounders, who made his Ranji debut for Madhya Pradesh in 2005-06 and then moved to Kerala. He is one of those unfortunate players who have not been able to make the national team despite a stellar career in First Class cricket (6,368 runs at an average of 35.57 and 360 wickets at 26.91). Muzumdar thinks Ranji Trophy performances should be rewarded, citing the example of Sarfaraz Khan, who scored 982 runs at an average of 122.75 and hit four hundreds this season. And his career First Class average is 81.61 after 25 matches. “The form won’t last life-long,” points out Muzumdar, who believes a player has to be picked when in form. And he knows it; he went through several purple patches but had to end his career as one of the finest batters never to have played for India (11,167 runs in First Class cricket). Raman played 11 Tests and 27 ODIs for India. The Ranji Trophy was his primary ‘preparation’ for international cricket. “We didn’t have the ‘A’ matches, the Duleep Trophy was a level higher than the Ranji Trophy, but the gap with international cricket was huge,” he recalls. Raman is happy with the way things are in the Ranji Trophy at the moment. Dav Whatmore, the World Cup-winning coach from Australia, once told this writer that First Class cricket in India was as good as in any other country. But he said DRS had to be introduced and that the averages from the Plate division were inflated. There have been concerns that many domestic players are keener about white-ball cricket in this IPL era. “Even junior cricketers now want to concentrate on power-hitting,” says Biju George, a Thiruvananthapuram-based coach who has an eye for catching them young (Sanju Samson is among his wards). He, however, ensures that they learn how to play the ball along the ground first. And there are men, like Muzumdar, who continue to remind the kids of such things at the National Cricket Academy and elsewhere. “If the Ranji Trophy is strong and competitive, Indian cricket will be strong and competitive,” he says. “It is the nursery of Indian cricket.” Our code of editorial values Printable version | Jul 15, 2022 11:40:57 pm | https://www.thehindu.com/sport/cricket/the-state-of-play-in-the-ranji-trophy/article65645497.ece © THG PUBLISHING PVT LTD.","pubDate":"2022-07-15 18:10:52","image_url":null,"source_id":"thehindu","country":["india"],"category":["sports"],"language":"english"},{"title":"Wallabies’ hopes in series decider hang on lessons of past SCG encounters | Angus Fontaine","link":"https://www.theguardian.com/sport/blog/2022/jul/16/wallabies-hopes-in-series-decider-hang-on-lessons-of-past-scg-encounters","keywords":["Australia rugby union team","England rugby union team","Rugby union","Australia sport","Sport","Australia news"],"creator":["Angus Fontaine"],"video_url":null,"description":"Saturday’s Test in Sydney will be a street fight in which Australia must match England for mongrel, then punish them with speed and skillThe first rugby international staged at the Sydney Cricket Ground was on 24 June, 1899. Australia wore sky blue jerseys, fielded two five-eighths and played two men in the front row. The British XV, featuring players from all four Home Nations, employed a tactic of dribbling the ball upfield at their feet in a rush. But it didn’t work. After being locked at 3-3 for most of the Test, Australia scored two converted tries in the final seven minutes to win 13-3.According to referee, WG Gerrard, Australia won because “they kept slogging all the time. They were workers not waiters. The English forwards were waiting for chances that never came. And the reason why the chances did not come was because [the Australians] were too fast. They swept on in a body and did not allow the game to become an open one.” Continue reading...","content":null,"pubDate":"2022-07-15 17:30:45","image_url":"https://i.guim.co.uk/img/media/267ff5e0d687e508a6ff6f18b068aa5593fe115c/0_56_4847_2910/master/4847.jpg?width=460&quality=85&auto=format&fit=max&s=cffd2371e3beef1d27953fb93dd03f5c","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Ben Stokes pulls out of the Hundred and T20 series to focus on Test cricket","link":"https://www.theguardian.com/sport/2022/jul/15/david-willey-to-miss-t20-blast-finals-day-as-england-refuse-to-release-stars","keywords":["England cricket team","Ben Stokes","Yorkshire","Cricket","Sport"],"creator":["Simon Burnton"],"video_url":null,"description":"England captain will prepare for series against South AfricaYorkshire’s Willey not released for T20 Blast Finals DayBen Stokes has pulled out of the Hundred as well as the forthcoming T20 series against South Africa as he prioritises Test cricket over white-ball competitions following his appointment as England captain.Stokes made two appearances for Northern Superchargers last summer and was expected to play for them again in the competition’s second season, but will instead rest and prepare for the three Tests against South Africa in August and September. Continue reading...","content":null,"pubDate":"2022-07-15 16:55:33","image_url":"https://i.guim.co.uk/img/media/3b600991186d72f29d32d68b835fa8d09c65cc9c/0_172_7832_4699/master/7832.jpg?width=460&quality=85&auto=format&fit=max&s=cc132e6173e5a29d937e716d4db48a01","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Virat Kohli doesn’t need any reassurance: Rohit Sharma","link":"https://telanganatoday.com/virat-kohli-doesnt-need-any-reassurance-rohit-sharma","keywords":["News","Sport","England","India","Rohit Sharma","Virat Kohli"],"creator":["PTI"],"video_url":null,"description":"London: India skipper Rohit Sharma has once again come out in support of Virat Kohli after the batter was out for 16 in the second ODI against England to extend his prolonged lean patch. At the post-match press conference following the team’s 100-run drubbing to England here on Thursday, Rohit looked agitated as he interrupted […]","content":"Home | Sport | Virat Kohli Doesnt Need Any Reassurance Rohit Sharma Virat Kohli doesn’t need any reassurance: Rohit Sharma By PTI Published: Published Date - 10:09 PM, Fri - 15 July 22 London: India skipper Rohit Sharma has once again come out in support of Virat Kohli after the batter was out for 16 in the second ODI against England to extend his prolonged lean patch. At the post-match press conference following the team’s 100-run drubbing to England here on Thursday, Rohit looked agitated as he interrupted a scribe even before he could complete his question on Kohli’s poor run of form. “Kyun ho rahi hain, yaar. Matlab mujhe samajh mein nahi aata, bhai. (Why is there so much of discussion… I can’t understand this),” Rohit said. “He has played so many matches, over such a long period of time. He is such a great batter, so he does not need reassurance.” If Rohit’s support was not enough, his English counterpart Jos Buttler too backed Kohli to regain his touch, and said a big knock is “always due” from a player of his calibre. Making a comeback after sitting out the first ODI because of a groin strain, Kohli was dismissed after striking three boundaries at Lord’s, once again leading to discussions on his poor form. In the preceding T20I series Kohli had scores of 1 and 11, and was also dismissed cheaply in the fifth Test against England, forcing legends such as Kapil Dev to wonder why he could not be dropped. But Rohit maintained the the Indian No. 3 does not need any reassurance and his spot in the team is secure. “As I have said previously, form can go up and down, it’s part and parcel for every cricketer’s career. Even the greatest of the cricketer would have his share of ups and downs. “For someone who has won so many matches for India, you need one or two innings to bounce back. That’s what I feel and I am sure all those who follow cricket will think similarly. I know there’s been discussions going on but we have to understand we have seen for years, players go through ups and downs, but quality never goes away, we have to keep that in mind.” “Look at his past records, the number of hundreds, his average. He has the experience. You have slump even in personal life.” Just before the Indian team arrived at Lord’s for the second match, the BCCI had announced the squad for the upcoming T20I series in the West Indies, which did not include Kohli. It is said that he had asked for rest. Echoing Rohit’s views, Buttler too backed the 33-year-old Kohli. “I suppose in a little way it’s quite refreshing for the rest of us that he (Kohli) is human and he can have a couple of low scores as well, but look he has been one of the best players, if not the best player in ODI cricket in the world,” the English skipper said. “So he’s been a fantastic player for so many years and all batters, it just proves, go through runs of form where they don’t perform as well as they can do sometimes, but certainly as an opposition captain, you know a player of that class is always due, so you’re hoping that it doesn’t come against us,” said Buttler. Opting to field, the Rohit-led side had England tottering for 148/6 only to let them recover to 246. The total proved more than enough as India suffered a top-order collapse before being bundled out for 146 in 38.5 overs. “This is also a challenge for us, whenever we lose five-six early wickets we too have to learn how our lower order too can make runs,” he said. Follow Us : Tags England India Rohit Sharma Virat Kohli Related News Rupee at life-time low to hit imports, overseas education, travel Blockchain platform 5ire raises $100 mn, becomes 105th unicorn in India This too shall pass. Stay strong: Babar Azam’s message to Virat Kohli India reports 20,038 new COVID-19 cases, 47 fatalities IND vs ENG, 2nd ODI: England beat India by 100 runs, level 3-match series 1-1 Kerala reports first monkeypox case in India","pubDate":"2022-07-15 16:39:51","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Smith reckons England can reach Euros semis if they put on another ‘A-star’ display after Norway rout","link":"https://www.thesun.ie/sport/9105855/kelly-smith-england-womens-euros/","keywords":["Sport","Football","Women's Euro","Women's football"],"creator":["Sandra Brobbey"],"video_url":null,"description":"KELLY SMITH reckons England’s thrashing of Norway is one of the best Lionesses’ displays she has ever seen. And the Lionesses legend is backing the tournament’s hosts to reach the semis if they can put on an A-star quarters display. Monday’s stunning 8-0 victory secured a Euros quarter-final clash against either Spain or Denmark even […]","content":"KELLY SMITH reckons England's thrashing of Norway is one of the best Lionesses' displays she has ever seen. And the Lionesses legend is backing the tournament's hosts to reach the semis if they can put on an A-star quarters display. Monday's stunning 8-0 victory secured a Euros quarter-final clash against either Spain or Denmark even before tonight's final Group A game against Northern Ireland. However, the team will play without boss Sarina Wiegman in the dugout after the England chief tested positive for Covid-19. Assistant coach Arjan Veurink will oversee the Lionesses' efforts this evening with the team targeting a final group stage win. However, the FA say Wiegman will remain in remote contact with the players and technical staff. Of England's display against Norway, Smith said: \"It was a top-class performance. \"I've never seen one like that in my life from a women's national team. It was just unreal. \"England smelled blood and kept their foot on the pedal. \"To go in at half-time 6-0 up is unheard of in a Euros game. \"It showed the way this England team is right now with their constant belief and focus. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS \"It was fun to watch, made me proud to be English, and proud I've played for the national team.\" The stunning result, the biggest win in Euros history, has Lionesses fans dreaming of a first major trophy. Smith was a member of the last England side to contest a Euros final back in 2009 when they lost 6-2 to Germany. And the former Lioness is confident this team will be far too strong for their Spanish or Danish opponents. Smith, who scored 46 times in 117 internationals, added: \"If it is Spain, it will be tough against the most technically gifted side in the tournament. \"But if England can deliver another A-star display, they will reach the semis.\" The Lionesses have gone 16 games unbeaten under Wiegman, scoring eight or more goals in six of those matches. Ellen White nabbed a brace against Norway while Arsenal ace Beth Mead hit a hat-trick adding to her strike in an opening 1-0 group win against Austria. On Thursday Wiegman indicated she was unlikely to make many changes to the side for the Northern Ireland fixture Women’s sport is on the rise not only with football but also with cricket, athletics and rugby Ex-Arsenal star Smith added: \"I'd probably start Alessia Russo and I'd give minutes to Chloe Kelly. \"But I'd keep Mead in, with the way she is playing.\" Smith has teamed up with gym firm David Lloyd to share details of some of her fitness regimes from her playing days, routines she still follows on a daily basis Smith, who is a mother of two, said: “With having a hectic lifestyle in the media and with the work that I do, I need to stay on top of my game. “I do six exercises that I've done pretty much my whole career, which have helped with my strength, agility and flexibility.\" Thirteen years ago, just over 1.2million TV viewers across the country tuned in to watch Smith and her England team-mates in the Euros 2009 final. This week a peak audience of 4.1million watched England trounce Norway, a new UK record for TV viewing of a Women’s Euros fixture. Smith, now a pundit for BBC Sport, said: “The game has evolved full circle since I was playing, and I'm pleased I've played a part in that. “That England’s three group games were sold out and not playing in five or 6000-seater stadiums shows just how much interest there is. “Women’s sport is on the rise not only with football but also with cricket, athletics and rugby.”","pubDate":"2022-07-15 15:28:20","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: PCB wants Sri Lanka to retain hosting rights despite civil unrest","link":"https://www.indiatvnews.com/sports/cricket/asia-cup-2022-pcb-wants-sri-lanka-to-retain-hosting-rights-despite-civil-unrest-2022-07-15-792396","keywords":null,"creator":null,"video_url":null,"description":"The Pakistan Cricket Board will support Sri Lanka in its bid to host the Asia Cup from August 27 despite civil and political unrest in the island nation.","content":null,"pubDate":"2022-07-15 15:13:45","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Galle international stadium pitch report 1st Test: Sri Lanka vs Pakistan 1st Test match pitch report at Galle","link":"https://thesportsrush.com/cricket-news-galle-international-stadium-pitch-report-1st-test-sri-lanka-vs-pakistan-1st-test-match-pitch-report-at-galle/","keywords":["Cricket","Galle","Galle International stadium","Pakistan tour of Sri Lanka 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Galle international stadium pitch report 1st Test: The Asian rivals would take on each other in a Test series after more than two years. Pakistan would lock horns against Sri Lanka in the first of the two-match Test series at the Galle international Stadium from July 16 (Saturday) onwards. Sri Lanka, led by Dimuth Karunaratne,… The post Galle international stadium pitch report 1st Test: Sri Lanka vs Pakistan 1st Test match pitch report at Galle appeared first on The SportsRush.","content":"Galle international stadium pitch report 1st Test: The Asian rivals would take on each other in a Test series after more than two years. Pakistan would lock horns against Sri Lanka in the first of the two-match Test series at the Galle international Stadium from July 16 (Saturday) onwards. Sri Lanka, led by Dimuth Karunaratne, after receiving a 10-wicket shellacking from Australia during the first Test match at this very venue, bounced back in some style with an inexperienced squad during the second Test to level the series 1-1. They would certainly start as favourites not only with confidence by their side, but also with a much better understanding of the pitch and the conditions on offer. Pakistan, on the other hand, would play the longest format after more than three months, having last played against Australia at home during the three-match series, which they lost 0-1. The last time Sri Lanka and Pakistan faced each other in a Test match series, Pakistan had clinched the same 1-0 at home in December 2019. Captains pose with the #SLvPAK Test series trophy : @OfficialSLC #BackTheBoysInGreen pic.twitter.com/M4vr1sMNfP — Pakistan Cricket (@TheRealPCB) July 15, 2022 ALSO READ: Sri Lanka vs Pakistan 1st Test Live Telecast details Galle international stadium pitch report 1st Test The pitch at the Galle international stadium tomorrow, would yet again be dry in nature. As has been the case in the previous quite a few Tests at this venue, the spinners are highly likely to dominate the proceedings and might as well be the deciding factor with respect to the outcome of the opening Test match between these two Asian rivals. Prabath Jayasuriya, who picked 12 wickets in his Test debut versus Australia a few days ago, is almost certain to play, with the team likely to field in a total of three spinners on this spin heavy track. Pakistan, on the other hand have excluded Sajid Khan from their 18-member squad, but would be buoyed by the return back of the champion leg-spinner Yasir Shah, who is making a comeback after almost a year. While spin is likely to be the king at Galle tomorrow onwards, batting is likely to be the easiest especially on the first couple of days. Thus, expect the captain winning the Toss to opt to bat first tomorrow. The post Galle international stadium pitch report 1st Test: Sri Lanka vs Pakistan 1st Test match pitch report at Galle appeared first on The SportsRush.","pubDate":"2022-07-15 15:13:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"PCB wants Sri Lanka to retain Asia Cup 2022 hosting rights despite civil unrest","link":"https://sportstar.thehindu.com/cricket/pakistan-cricket-backs-sri-lanka-to-host-asia-cup-2022/article65644266.ece","keywords":null,"creator":["\n        PTI  \n    "],"video_url":null,"description":"The Pakistan Cricket Board will back the island nation to host this year’s Asia Cup despite the civil and political unrest in the country.","content":null,"pubDate":"2022-07-15 15:10:31","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Manchester United defender Eric Bailly produces stunning assist for Marcus Rashford days after creating goal against Liverpool","link":"https://talksport.com/football/1150937/manchester-united-eric-bailly-assist-marcus-rashford-liverpool/","keywords":["Football","Premier League"],"creator":["Sam May"],"video_url":null,"description":"Eric Bailly produced another superb assist as Manchester United defeated Melbourne Victory 4-1 in their second pre-season match of the summer. Bailly, 28, impressed for Erik ten Hag’s side and laid on striker Rashford for the Red Devils’ third goal of the game. The Ivory Coast international picked up the ball in the centre circle […]","content":"Eric Bailly produced another superb assist as Manchester United defeated Melbourne Victory 4-1 in their second pre-season match of the summer. Bailly, 28, impressed for Erik ten Hag’s side and laid on striker Rashford for the Red Devils’ third goal of the game. Bailly impressed for Manchester United and assisted Marcus Rashfordgetty The Ivory Coast international picked up the ball in the centre circle before going on a darting run past one man. He then slotted the ball through four defenders, picking out Rashford in the process, who fired under the goalkeeper to score on 78 minutes. United had earlier found themselves 1-0 down inside five minutes, when Chris Ikonomidis put the hosts ahead. It delighted the home crowd, as the Aussie’s around the stadium sang ‘you’re getting sacked in the morning’, in the direction of Ten Hag. The Red Devils did level through Scott McTominay two minutes before half-time, though, before Fred put his side ahead deep into added time at the end of the first 45 minutes. Bailly produced his moment of magic for Rashford to score on 78 minutes making it 3-1, and Edmund Lupancu put through his own net right at the death to complete the scoring. Bailly started in his own half for Manchester UnitedParamount+ And Bailly quickly surged forward up the pitchParamount+ Bailly’s pass set Rashford free to scoreParamount+ Marcus Rashford goal for Manchester United vs Melbourne Victory.Eric Bailly with another great run. Two assists from deep in two matches.pic.twitter.com/ZKBJhKUerF— Lij (@ElijahKyama) July 15, 2022 Most read in Football news Man United confirm Eriksen, Ronaldo rejects stunning offer, Spurs to seal another deal annoyed Can transfer listed by Dortmund for 'irritating' behaviour, and moaned at Liverpool hope Leeds 'not worse off' selling key duo and new signings 'could be superstars' thoughtful Why England will wear maroon socks and white kit vs Northern Ireland huge Sterling, Koulibaly and another defender in - Chelsea XI to fight rivals for title WOW Arsenal fans track planes and stalk trees for transfers as Tielemans becomes new target Bailly had previously earned high praise following his impressive second-half display as United beat Liverpool 4-0 in their first pre-season game in Bangkok, Thailand on Tuesday. He was involved in his side’s fourth goal, storming from his box to the opposition’s, before Facundo Pellistri slotted in past Liverpool goalkeeper Adrian. The defender will be hoping to cement a place in Ten Hag’s side ahead of the new season, with United set to sign centre-back Lisandro Martinez from Ajax. United face Crystal Palace next at the Melbourne Cricket Ground on Tuesday in their third pre-season clash of the summer, with Ten Hag hoping to make it three wins from three. Offers Of The Day 888sport – Get 100% Bonus up to £100* – CLAIM HERE £/$/€10 min deposit using promo code “TOP100” • The bonus will be applied once the full deposit amount has been wagered at least twice with cumulative odds of 1.50 or greater • To withdraw any winnings from your bonus, you must wager the bonus amount up to 5 times­ • All deposit and bonus wagering requirements must be completed within 60 days • This offer may not be combined with any other offer • Wagering limit of £/$/€50 per bet Applies • Restrictions apply to withdrawals, payment methods and countries & full T&Cs apply. 18+ Begambleaware.org SEE MORE FREE BET OFFERS HERE","pubDate":"2022-07-15 14:59:42","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Manchester United golea al Melbourne en amistoso","link":"https://www.liderendeportes.com/noticias/futbol/europeo/manchester-united-golea-al-melbourne-en-amistoso/","keywords":["Europeo","Fútbol"],"creator":["Líder en Deportes"],"video_url":null,"description":"En el equipo australiano jugó en los últimos minutos el portugués Nani, un exjugador de los 'Diablos Rojos' La entrada Manchester United golea al Melbourne en amistoso se publicó primero en Líder en deportes.","content":"El Manchester United no tuvo excesivos problemas para vencer 4-1 al Melbourne Victory, este viernes en un partido amistoso disputado en Australia y en el que brilló el francés Anthony Martial. El martes, el United había estrenado la nueva etapa con su entrenador Erik Ten Hag con una goleada 4-0 sobre el Liverpool, en un amistoso en Tailandia. Martial aprovechó la ausencia de Cristiano Ronaldo, no presente en esta gira de pretemporada, para ser la estrella del United. Lee también: Ofrecen cifra astronómica por Cristiano Ronaldo El Melbourne se adelantó ante los 74.000 espectadores del Melbourne Cricket Ground con un tanto en el minuto 5, pero Scott McTominay igualó en el 43 y Martial puso ya en ventaja a los ingleses, en el 45+1. En la segunda parte, Ten Hag revolucionó su plantel. Marcus Rashford firmó el tercero en el 78 y el defensa australiano Edmond Lupancu, en propia puerta, puso el 4-1 definitivo. «Nos vimos con 1-0 abajo, pero nos mantuvimos tranquilos», destacó Ten Hag. En el Melbourne, jugó en los últimos minutos el portugués Nani, un exjugador del Manchester United. En su gira por Australia, el Manchester United tiene ahora previsto medirse al Crystal Palace el 19 de julio y luego al Aston Villa (23 de julio), antes del inicio de la Premier League, el 5 de agosto. AFP La entrada Manchester United golea al Melbourne en amistoso se publicó primero en Líder en deportes.","pubDate":"2022-07-15 14:42:31","image_url":null,"source_id":"liderendeportes","country":["venezuela"],"category":["sports"],"language":"spanish"}]}