{"newsArray":[{"title":"AA vs CS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Ford Trophy, Match 29","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/aa-vs-cs-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-ford-trophy-match-29?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-23 19:30:21","full_description":"The Auckland Aces will take on the Central Stags in the 29th match of the Ford Trophy 2021-22 on Thursday, February 24, 2022. The match will be played at the Eden Park Outer Oval in Auckland. Both Auckland Aces and Central Stags will play the finals after this last league match. Auckland will finish second and so far have five wins and three losses in eight games. They defeated the Otago Volts by 96 runs in their previous match. Meanwhile, the Central Districts have won five of their nine matches while losing none to finish in the top spot. They come into this match on the back of a two-wicket win over the Wellington Firebirds. Auckland Aces Martin Guptill, George Worker, Glenn Phillips, Mark Chapman, Robert O'Donnell (c), Ben Horne (wk), Sean Solia, William Somerville, Adithya Ashok, Ben Lister, Simon Keene Central Stags Ben Smith, Bayley Wiggins (wk), Brad Schmulian, Ross Taylor, Tom Bruce (c), Josh Clarkson, Doug Bracewell, Adam Milne, Seth Rance, Joey Field, Jayden Lennox Match: Auckland Aces vs. Central Stags, Match 29 Date and Time: Thursday, February 24, at 3:30 AM IST Venue: Eden Park Outer Oval, Auckland The pitch at Eden Park Outer Oval in Auckland is ideal for seamers. There is a lot of grass cover on the surface which helps the pacers to extract movement. A total of around 290 would be a challenging one at this venue. Wicketkeeper Glenn Phillips: Glenn Phillips has been a top all-round performer for the Aces. He has managed to score 350 runs in eight games at an average of 50 while also picking up four wickets. Batters George Worker: Worker is leading the run-scoring charts by a mile. He has racked up 468 runs in eight games at an average of 58.50 and a strike rate of 90.52. Martin Guptill: Guptill has showcased why he is known as one of the best openers in the world. He has scored 344 runs in six outings at an average of 57.33 and a strike rate of over 100. All-rounders Doug Bracewell: Doug has made vital contributions in both departments of the game. He has scored 102 runs at a strike rate of 154.55 and has grabbed seven wickets at an economy of 5.81. Mark Chapman: Chapman has been crucial with the bat in the middle order. He has managed to score 285 runs in eight games at an average of 35.62 Bowlers William Somerville: Somerville has been a vital contributor with the ball while also scoring handy runs down the order. He has grabbed nine wickets in seven games at an economy of 4.44. Seth Rance: Rance is currently the second-highest wicket-taker in the tournament. He has picked up 11 wickets in just five games at an economy of 3.98. Glenn Phillips: 621 points George Worker: 617 points Martin Guptill: 476 points William Somerville: 438 points Mark Chapman: 419 points Glenn Phillips: Eight matches, 350 runs, four wickets George Worker: Eight matches, 468 runs Martin Guptill: Six matches, 344 runs Seth Rance: Five matches, 11 wickets Doug Bracewell: Five matches, 102 runs, seven wickets Fantasy Suggestion #1 : Glenn Phillips, George Worker, Martin Guptill, Mark Chapman, Doug Bracewell, William Somerville, Seth Rance, Ben Horne, Ross Taylor, Seam Solia, Adam Milne Captain : George Worker Vice-Captain : Seth Rance Fantasy Suggestion #2 : Glenn Phillips, George Worker, Martin Guptill, Mark Chapman, Doug Bracewell, William Somerville, Seth Rance, Bayley Wiggins, Robert O'Donnell, Josh Clarkson, Adithya Ashok Captain : Martin Guptill Vice-Captain : Glenn Phillips.","image_url":"https://static.sportskeeda.com/editor/2022/02/7c124-16456419650002-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Lake Grace seal top-two finish in Upper Great Southern Cricket Association on back of brilliant partnership","link":"https://thewest.com.au/news/narrogin-observer/lake-grace-seal-top-two-finish-in-upper-great-southern-cricket-association-on-back-of-brilliant-partnership-c-5792474","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"A wrap of the round 13 results from the Upper Great Southern Cricket Association A-grade competition on Saturday.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":"A brilliant century from opener Kalan Joyce sealed a top-two finish for Lake Grace in the Upper Great Southern Cricket Association A-grade competition after an emphatic victory in the penultimate round on Saturday. Lake Grace sit a game clear on top of the ladder heading into the final round, on the back of their eighth win of the season in round 13. Joyce smacked a superb 106 off 134 balls as he guided his side to a commanding 218-run victory over Harrismith on their home deck. Batting first, Lake Grace made a formidable 5-308 that was set up by Joyce while Jack Carruthers played an important cameo. Lake Grace were 2-73 after a 67-run stand between Dylan Brooks (52) and Joyce. Brooks’ departure brought Carruthers to the wicket and he combined with Joyce for a 165-run stand to take their side past 200. Carruthers fell just short of a century, bowled for an impressive 93 from only 77 balls, which included 13 fours and two sixes. Riley Spark (2-48) removed Carruthers but Joyce kept going, notching triple figures as he added 54 runs with Aidan Liddelow (27 ) to finish off the innings. Joyce hit 12 fours in his unbeaten innings that lasted 162 minutes. Harrismith lost constant wickets in the run chase, with their opening partnership of 34 between Ashley Groves (32) and Luke Crouch (3) their biggest of the game. They lost 6-22 late to be bowled out for 90 in 22.5 overs as Brooks starred with 6-19 for Lake Grace. Pingelly-Noonebin recorded a vital win in their quest for a premiership three-peat. They jumped to third after finishing seven-wicket winners over Cuballing, led by a half century from Jack Blechynden (59 not out) at Cuballing. Four wickets from Tom Munns and an unbeaten 67 from Nick Corner guided Towns to a seven-wicket win over Williams in Williams. Just four points separate Pingelly-Noonebin (third), Wandering (fourth) and Williams (fifth) going into the final round. The UGSCA will meet on Thursday night to discuss their finals format with the uncertainty around COVID-19. Meanwhile the Belt-Up Country Cup grand final between Albany and Districts Cricket Association and the WA Invitational XI will be played at Clayton Road Oval in Narrogin on Sunday. Both sides have won two games heading into the decider, however WA Invitational XI finished 137-run winners over the same opponent at the same ground in round one. The WA Invitational XI is set to contain a handful of Uppers players. The match will start at 11am on Sunday.","image_url":"https://images.thewest.com.au/publication/C-5792474/9b72d21709dd6088fe57e65d431b90d6e196d1dd-16x9-x762y466w519h292.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Old Dogs and Brad Hogg fall short against Young Guns in Upper Great Southern Cricket Association T20 Slam","link":"https://thewest.com.au/news/narrogin-observer/old-dogs-and-brad-hogg-fall-short-against-young-guns-in-upper-great-southern-cricket-association-t20-slam-c-5790313","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"Australian cricket champion Brad Hogg a hit in Upper Great Southern Cricket Association’s T20 Slam.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5790313/0c0fcb0abafc2bfef67676d6f72d692b98c4d5ca-16x9-x0y502w5184h2916.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Broomehill suffer first loss of Great Southern Cricket Association season in round 14","link":"https://thewest.com.au/news/great-southern-herald/broomehill-suffer-first-loss-of-great-southern-cricket-association-season-in-round-14-c-5778556","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"Broomehill suffered their first loss of the season in round 14 on their home deck but will still finish as minor premiers, sitting 13 points clear of Tambellup going into the final round this Saturday.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5778556/56b562bdbc89f61852c173c44dbcf1d1d438fcc6-16x9-x0y347w2835h1595.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Manypeaks and Royals to face off in Albany and Districts Cricket Association under-17s grand final","link":"https://thewest.com.au/news/albany-advertiser/manypeaks-and-royals-to-face-off-in-albany-and-districts-cricket-association-under-17s-grand-final-c-5812607","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"The under-17s grand final will be played on Monday, March 7, between Royals and Manypeaks.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":"Royals finished the Albany and Districts Cricket Association under-17 season on top of the ladder after finishing 49-run winners over Collingwood Park on Sunday. The Lions notched their eighth win of the season to finish well clear on top ahead of Manypeaks. Ryley Valli led the way in the Lions’ victory, whacking a superb 71 from 63 balls that included nine fours and three sixes at Turf East. Valli and Devon Jefferis both retired after opening the batting together, while Caleb Haua (39) and Riley Bessen (28) also contributed well with the bat. Jefferis was the last batter removed for 59 off 50 that included seven fours and two sixes as his side posted 285, with Valli unbeaten. Jed Schwarzbach (3-29) and O’Shea Durack (3-44) did the damage with the ball for Park. Park made a good fist of the run chase but were behind the required rate and ran out of overs as they finished on 9-236. Rory Luscombe made 48 and was supported by O’Shea Durack (42). Jed Schwarzbach (38) and Harvey Taylor (35no) also contributed but they fell to a sixth loss of the season. Clay Michael (2-28) and Davey Wignall (2-32) were impressive with the ball for the Lions. Railways finished their season on a positive note, prevailing by 121 over Manypeaks at Turf South. The Tigers set up the win with a terrific batting performance, with their opening three batters Billy O’Meara (54), Milan Jaggi (50) and Mohit Jaggi (52) all retiring not out as they reached 200 without losing a wicket. Cooper Edwards added 40 and Lachlan Tindale made 31 as the Tigers finished on 3-286, while Riley Wood snared 2-40 for Peaks. In the run chase Peaks could make only 165, with Angus McSweeney top-scoring with 39 and Cameron Walsh and Wood adding 22 each. Mohit Jaggi snared 3-18 for the Tigers in their second win of the season. In the under-17s competition the top two sides qualify for the grand final, which will be played on Monday, March 7, between the Lions and Peaks. The under-14s grand final will be played on Saturday, March 5, the under-10 season will finish on March 4 and the under-12s on March 5.","image_url":"https://images.thewest.com.au/publication/C-5812607/a3cc0cd0b55f47663a24823d8b2bef9e1eeadec9-16x9-x0y210w4032h2268.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Perth Scorchers fitness guru Warren Andrews recruited by IPL’s Lucknow after Justin Langer recommendation","link":"https://thewest.com.au/sport/perth-scorchers/perth-scorchers-fitness-guru-warren-andrews-recruited-by-ipls-lucknow-after-justin-langer-recommendation-c-5810437","keywords":null,"creator":["Jordan McArdle"],"video_url":null,"description":"Highly-rated WA Cricket and Perth Scorchers fitness guru Warren Andrews is off to the Indian Premier League after a recommendation from ex-Australian coach Justin Langer.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5810437/2e83255c2a785c4a8527dc09443e73857bc9fd97-16x9-x0y101w2151h1210.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"All-rounder Kane Pinney returns for Manypeaks while Royals go into A-grade preliminary final unchanged","link":"https://thewest.com.au/news/albany-advertiser/all-rounder-kane-pinney-returns-for-manypeaks-while-royals-go-into-a-grade-preliminary-final-unchanged--c-5807864","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"For the third successive season Royals and Manypeaks will clash in the Albany and Districts Cricket Association A-grade preliminary final.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5807864/3e1dc123f525472fdffd794262dd26604049ea08-16x9-x0y234w4488h2525.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sixth win of the Great Southern Cricket Association season for Kendenup after downing Wanderers","link":"https://thewest.com.au/news/great-southern-herald/sixth-win-of-the-great-southern-cricket-association-season-for-kendenup-after-downing-wanderers-c-5778625","keywords":null,"creator":["Taj Stubber"],"video_url":null,"description":"Kendenup will take plenty of confidence into the finals, as they face Wanderers in their elimination final on March 12.","content":null,"pubDate":"2022-02-23 18:00:00","full_description":"A terrific all-round performance from Clinton Gilbert guided Kendenup to a comfortable seven-wicket win over Wanderers in the Great Southern Cricket Association on Saturday. But with Tambellup also winning in round 14 it ended Kendenup’s chances of finishing in the top-two and securing a finals double chance. Kendenup will take plenty of confidence into the finals, when they face Wanderers in their elimination final on March 12. Gilbert returned neat bowling figures before blasting an unbeaten half century to guide his side home in just 20 overs on their home deck. Kyle Sinclair and Toby Quartermaine put on 47 runs for the opening stand before Jeremy Groves removed the latter for 21 and then picked up Brock Green soon after. Tyron Pinney and Kyle Sinclair put on 30 together to take their side towards triple figures before Sinclair fell for a patient 42. That was Gilbert’s first wicket and it also triggered a collapse for Wanderers as they lost 7-14. Callum Gribble ripped through Wanderers middle and lower order with four wickets and despite some resistance from Pinney and Ryan Sinclair they were bowled out for 118 in the 44th over. Pinney made 16 but was run out and Ryan Sinclair finished unbeaten on 14. Gribble snared impressive figures of 4-13 off nine overs while Gilbert took 2-8 from six overs, three of which were maidens, and Groves added 2-16. Kendenup fell to 2-12 in the run chase as Elijiah Quartermaine snared the key wickets of Scott Hillman and Keegan Berry. However Jarred Beech and Clinton Gilbert steadied the ship with a 40-run stand before Beech was bowled for 19. But through brothers, Clinton and Matt Gilbert, Kendenup cruised home as they put on a 69-run partnership. Kendenup finished on 3-121. The pair went at more than six an over to guide their side to a sixth victory. Clinton Gilbert finished on 61 off 49 balls while Matt Gilbert was unbeaten on 16. Elijiah Quartermaine snared 2-21 for Wanderers but they suffered their eighth loss of the season.","image_url":"https://images.thewest.com.au/publication/C-5778625/17ff27cf8dc22c6fe73f74083fa9bb5574d2e305-16x9-x30y357w4302h2420.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Rauf reprimanded for slapping team-mate in PSL match: PCB source","link":"https://sportstar.thehindu.com/cricket/haris-rauf-reprimanded-for-slapping-team-mate-in-psl-match/article38436464.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"A source in the Pakistan Cricket Board (PCB) said match referee Ali Naqvi only reprimanded Rauf since neither of the umpires had reported the incident to him in Lahore Qalandars' match against Peshawar Zalmi.","content":null,"pubDate":"2022-02-23 17:30:21","full_description":"Pakistan fast bowler Haris Rauf escaped with a reprimand after he was seen slapping his Lahore Qalandars teammate Kamran Ghulam in a Pakistan Super League match. A source in the Pakistan Cricket Board (PCB) said match referee Ali Naqvi only reprimanded Rauf since neither of the umpires had reported the incident to him in Lahore Qalandars' match against Peshawar Zalmi Former Pakistan all-rounder Shahid Afridi and some other ex players, however, felt that Rauf was out of line. “I don’t think it was an incident that should have happened in a match with the world watching, it doesn’t leave a good impression even if Haris didn’t mean it,” Afridi said. 'Grateful' Root says time for fresh start after Ashes drubbing “I hope Haris learns from this incident because it was in bad taste and in future if he repeats it he will be in big trouble,” he added. The incident caused plenty of criticism on Rauf on social media with many users censuring the fast bowler for his action. Many cricket fans called out Rauf for his action, wondering how a Pakistan team player could react in such a manner just because Ghulam had earlier dropped a catch of his bowling.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"'Grateful' Root says time for fresh start after Ashes drubbing","link":"https://sportstar.thehindu.com/cricket/grateful-root-says-time-for-fresh-start-after-ashes-drubbing/article38436462.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Root survived the axe following a 4-0 drubbing in Australia even as director of cricket Ashley Giles, head coach Chris Silverwood and batting coach Graham Thorpe were sacked in the series aftermath.","content":null,"pubDate":"2022-02-23 17:27:16","full_description":"England captain Joe Root said on Wednesday that it was time for a fresh start after their Ashes debacle and that he was grateful to be given the opportunity to take the team forward, ahead of their tour to the West Indies. Root survived the axe following a 4-0 drubbing in Australia even as director of cricket Ashley Giles, head coach Chris Silverwood and batting coach Graham Thorpe were sacked in the series aftermath. RELATED | England head coach Silverwood steps down after Ashes humiliation \"Clearly it was a disappointing tour and we massively underperformed,\" Root told reporters. \"I think off the back of it we have to use this opportunity for a fresh start. As Straussy's (interim director Andrew Strauss) mentioned, a bit of a reset... I'm very grateful that I've got the opportunity to do that as captain. \"I know there's a lot of hard work ahead, and I'm very much looking forward to that challenge. And that starts on this tour first. It's a real opportunity that we've got to take with both hands.\" England travels to the Caribbean for a three- series that gets underway in Antigua on March 8. Selectors have made wholesale changes for the series, with veteran fast bowling duo James Anderson and Stuart Broad the most notable omissions. Root, however, insisted, that it wasn't the end of the road for the pair who have more than 1,100 Test wickets between them. \"I've spoken both to Stuart and Jimmy... they're obviously disappointed, angry... at no point, no one is saying this is the end for them,\" said the 31-year-old. \"... If we're in a position where they can come back into this team, then great, that's only going to strengthen things. So a lot can happen between now and then.\" READ | Interim coach McDonald yet to discuss full-time role with Cricket Australia Speaking on the Tailenders podcast, Anderson, England's highest Test wicket-taker with 640 scalps, said he still had much to offer. \"I'm praying this isn't the end... I've got one more go at digging deep. I've got a lot left to offer -- I've still got the hunger and passion to play,\" said the 39-year-old. \"It was a shock and a disappointment to get that call but having processed it, it's important I try to focus on stuff I can control and that's showing people what I can do with the ball in my hand.\"","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Match Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc2VyaWVzL3NyaS1sYW5rYS1pbi1pbmRpYS0yMDIxLTIyLTEyNzg2NjUvaW5kaWEtdnMtc3JpLWxhbmthLTFzdC10MjBpLTEyNzg2ODQvbWF0Y2gtcHJldmlld9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Match Preview - India vs Sri Lanka, Sri Lanka in India 2021/22, 1st T20I  ESPNcricinfoIndia v Sri Lanka | 1st T20I | Preview  Royal Challengers BangaloreIND vs SL: India's Predicted Playing XI Against Sri Lanka- Sri Lanka Tour of India 2022, 1st T20I  Cricket AddictorIND vs SL 2022, 1st T20 Probable XIs: How The Two Teams Could Line up For The Series Opener  News18India vs Sri Lanka, 1st T20I Stats Preview: Players records and approaching milestones  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-02-23 17:20:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"WATCH: Indian women's cricket team wicketkeeper Richa Ghosh idolises MS Dhoni","link":"https://zeenews.india.com/cricket/watch-indian-womens-cricket-team-wicketkeeper-richa-ghosh-idolises-ms-dhoni-2439225.html","keywords":null,"creator":null,"video_url":null,"description":"Richa Ghosh, wicketkeeper in Indian women's cricket team, entered history books when she smashed fifty off just 26 balls in the fourth ODI against New Zealand.","content":null,"pubDate":"2022-02-23 17:11:00","full_description":"Richa Ghosh, wicketkeeper in Indian women's cricket team, entered history books when she smashed fifty off just 26 balls in the fourth ODI against New Zealand. Despite her quickfire knock, India could not win the match but Ghosh's efforts was praise by everyone. her innings included 4 fours and 4 sixes. Speaking to Mithali Raj at BCCI Women's Twitter channel, Ghosh spoke of how she felt after completing the fifty. \"The feeling is unique. First fifty for me. Last time, I got out in Australia on 44. So it felt good,\" Ghosh told her captain. Raj then threw another question at Ghosh that who she idolises. Ghosh said that she idolises two men. His father, who introduced cricket to her and the former Indian captain MS Dhoni, who she grew up watching hit sixes and fours, on TV. She said, \"I used to follow my father when I was a kid. I did my training with father only when I started off in cricket. When I started watching cricket, I saw Dhoni and his power hitting and he came my idol.\" Watch the video here: She raced to a record half-century in the 4th WODI against New Zealand & has now won high praise from #TeamIndia captain @M_Raj03 _ _ Here's @13richaghosh speaking on her remarkable feat ahead of the 5th #NZWvINDW WODI __ https://t.co/ARYVfRsAUt pic.twitter.com/jFdVE20KyI — BCCI Women (@BCCIWomen) February 23, 2022 India have failed to open account in New Zealand so far, losing all matches. They have lost four ODIs after losing the Only T20I. They will hope to sign off on good note with win in fifth and last ODI.","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“They are obviously disappointed and angry”: Joe Root exclaims James Anderson and Stuart Broad are livid post their selection snub for England’s tour of West Indies","link":"https://thesportsrush.com/cricket-news-they-are-obviously-disappointed-and-angry-joe-root-exclaims-james-anderson-and-stuart-broad-are-livid-post-their-selection-snub-for-englands-tour-of-west-indies/","keywords":["Cricket","England tour of West Indies 2022","James Anderson","Joe Root","Stuart Broad"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Joe Root exclaims James Anderson and Stuart Broad are in a state of anger following their exclusion from England Test team for WI tour. Ever since their 0-4 drubbing by Australia during the Ashes 2021-22 series, the England and Wales Cricket board (ECB) have come up with some strict measures in quest of a revamp.… The post “They are obviously disappointed and angry”: Joe Root exclaims James Anderson and Stuart Broad are livid post their selection snub for England’s tour of West Indies appeared first on The SportsRush.","content":"Joe Root exclaims James Anderson and Stuart Broad are in a state of anger following their exclusion from England Test team for WI tour. Ever since their 0-4 drubbing by Australia during the Ashes 2021-22 series, the England and Wales Cricket board (ECB) have come up with some strict measures in quest of a revamp. It all began with the axing of the board’s director of Cricket Ashley Giles, and was followed by the removals of the on fire head coach Chris Silverwood and assistant coach Graham Thorpe from their respective posts. ECB, however, came under fire yet again when they dropped their veteran pacers in the longest format- James Anderson and Stuart Broad from the 16-member squad set play against the West Indies in a 3-match Test series from March 8. Andrew Strauss, England’s appointed interim head coach back then, had stated, “In respect of James Anderson and Stuart Broad, I want to emphasize this does not mean the end for them as England players. We feel that it is important to look at some exciting new bowling potential and give some added responsibility to other players who have featured previously”. “No one doubts the quality and experience that James and Stuart bring to the England set-up. It will be up to the new managing director and permanent head coach to decide on whether they will be involved this summer and beyond,” he further added. Jimmy has spoken out about his England future pic.twitter.com/TcI0EirDXh — England’s Barmy Army (@TheBarmyArmy) February 23, 2022 Joe Root exclaims James Anderson and Stuart Broad are disappointed and angry England Test skipper Joe Root, who received ECB’s backing despite the Ashes debacle, exclaimed that the experienced fast bowling duo are angry and disappointment post their selection snub, but has reiterated Strauss’ initial stance that it is not the end of their careers despite the age catching up. “I have spoken to both Stuart and Jimmy. They are obviously disappointed and angry. Stu (Stuart Broad) in particular has voiced that quite publicly and you would expect that. I have got a huge amount of respect for all of them but at no point has no-one said this is the end for them,” remarked Root. ALSO READ: Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion Root then went on to state that the duo might return for the team’s this summer’s home Tests against the likes of New Zealand, India, and South Africa. “The fact they are not there is more that there are different roles people have to fill. They have taken the new ball for such a long period of time in English cricket, they have been leaders of the attack an they’ve done an extremely good job and I have a lot of respect for that. If we come away from this tour as victors and also gained a lot of knowledge on a number of other players and then there’s Jimmy and Broad to add back into things, we’re in a really strong position,” Root remarked. England will play the first of the 3-match Test series against the West Indies on March 8 in Antigua. They lost the 5-match T20I series 2-3 against them the previous month. The post “They are obviously disappointed and angry”: Joe Root exclaims James Anderson and Stuart Broad are livid post their selection snub for England’s tour of West Indies appeared first on The SportsRush.","pubDate":"2022-02-23 16:32:31","full_description":"Joe Root exclaims James Anderson and Stuart Broad are in a state of anger following their exclusion from England Test team for WI tour. Ever since their 0-4 drubbing by Australia during the Ashes 2021-22 series, the England and Wales Cricket board (ECB) have come up with some strict measures in quest of a revamp. It all began with the axing of the board’s director of Cricket Ashley Giles, and was followed by the removals of the on fire head coach Chris Silverwood and assistant coach Graham Thorpe from their respective posts. ECB, however, came under fire yet again when they dropped their veteran pacers in the longest format- James Anderson and Stuart Broad from the 16-member squad set play against the West Indies in a 3-match Test series from March 8. Andrew Strauss, England’s appointed interim head coach back then, had stated, “In respect of James Anderson and Stuart Broad, I want to emphasize this does not mean the end for them as England players. We feel that it is important to look at some exciting new bowling potential and give some added responsibility to other players who have featured previously”. “No one doubts the quality and experience that James and Stuart bring to the England set-up. It will be up to the new managing director and permanent head coach to decide on whether they will be involved this summer and beyond,” he further added. Jimmy has spoken out about his England future 🐐 pic.twitter.com/TcI0EirDXh — England’s Barmy Army (@TheBarmyArmy) February 23, 2022 England Test skipper Joe Root, who received ECB’s backing despite the Ashes debacle, exclaimed that the experienced fast bowling duo are angry and disappointment post their selection snub, but has reiterated Strauss’ initial stance that it is not the end of their careers despite the age catching up. “I have spoken to both Stuart and Jimmy. They are obviously disappointed and angry. Stu (Stuart Broad) in particular has voiced that quite publicly and you would expect that. I have got a huge amount of respect for all of them but at no point has no-one said this is the end for them,” remarked Root. ALSO READ : Nasser Hussain laments over James Anderson and Stuart Broad’s exclusion Root then went on to state that the duo might return for the team’s this summer’s home Tests against the likes of New Zealand, India, and South Africa. “The fact they are not there is more that there are different roles people have to fill. They have taken the new ball for such a long period of time in English cricket, they have been leaders of the attack an they’ve done an extremely good job and I have a lot of respect for that. If we come away from this tour as victors and also gained a lot of knowledge on a number of other players and then there’s Jimmy and Broad to add back into things, we’re in a really strong position,” Root remarked. England will play the first of the 3-match Test series against the West Indies on March 8 in Antigua. They lost the 5-match T20I series 2-3 against them the previous month.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"\"Was Keen To Do My Rehab Properly\": Jadeja On Lengthy Absence From Team","link":"https://sports.ndtv.com/cricket/was-keen-to-do-my-rehab-properly-ravindra-jadeja-on-lengthy-absence-from-team-india-2785383","keywords":null,"creator":null,"video_url":null,"description":"The southpaw is an integral part of the team across all formats and said that he wanted to undergo therehabilitation process properly and also said that he had been practising in theNational Cricket...","content":null,"pubDate":"2022-02-23 15:53:03","full_description":"All-rounder Ravindra Jadeja is back in the Indian team for the upcoming series against Sri Lanka, after an absence of more than two months, which saw him miss the entire tour of South Africa. Jadeja, who was undergoing rehab due to an injury break explained the reason behind his lengthy absence from international cricket in a video posted by BCCI on Twitter as Jadeja joined his teammates in the nets ahead of the T20I series. \"Good to be back in the Indian team and really looking forward to play the T20 series and the Test series. It feels great to be back after 2-2.5 months and get a chance to play for India,\" Jadeja said in a video tweeted by the Board of Control for Cricket in India (BCCI). The southpaw is an integral part of the team across all formats and said that he wanted to undergo the rehabilitation process properly and also said that he had been practising in the National Cricket Academy (NCA) in Bengaluru. ???? ???? \"I'm excited to be back and raring to go.\" Say Hello to all-rounder @imjadeja and vice-captain @Jaspritbumrah93 as they join #TeamIndia for the Sri Lanka series. ???? ???? @Paytm | #INDvSL pic.twitter.com/gpWG3UESjv \"I was very keen to do my rehab properly and also I was working hard on my fitness at NCA. So I am really excited for the upcoming series. I have been practicing in Bangalore, working on my bowling and batting and I was in touch. Today, I felt very good after coming here and doing my first session,\" he said. Jadeja is back in the team along with premier paceman Jasprit Bumrah, who was rested for India's recent series against the West Indies. Promoted India would expect the duo to make a significant contribution in the three-match series as they are without the duo of Virat Kohli and Rishabh Pant, who have been rested for the T20Is. India will also miss key players Suryakumar Yadav and Deepak Chahar who have both been sidelined due to injuries.","image_url":"https://c.ndtvimg.com/2021-11/ohsvb7ko_ravindra-jadeja_650x400_03_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Rahul Dravid didn't say anything wrong to Wriddhiman Saha, says former selector","link":"https://zeenews.india.com/cricket/rahul-dravid-didnt-say-anything-wrong-to-wriddhiman-saha-says-former-selector-sarandeep-singh-2439209.html","keywords":null,"creator":null,"video_url":null,"description":"Wriddhiman Saha made a big statement when he revealed that India head coach Rahul Dravid had asked him to consider retirement, telling him that he will no more be considered for Test cricket.","content":null,"pubDate":"2022-02-23 15:52:00","full_description":"Wriddhiman Saha made a big statement when he revealed that India head coach Rahul Dravid had asked him to consider retirement, telling him that he will no more be considered for Test cricket. Saha took that talk with Dravid in a wrong way, feels former North Zone selector and cricketer Sarandeep Singh, who has backed India men`s head coach Rahul Dravid`s comments on the wicket-keeper. \"I don`t think Dravid said anything wrong, this is the time when Saha should think about himself he is 37 years old. He will not get selected for the last eleven so why does he wants to be selected in the team to just sit on the bench when we have a young wicketkeeper,\" Sarandeep Singh told ANI. \"Pant is first priority of the team and he will play for a long time,\" he added.Wriddhiman Saha on Tuesday refused to reveal the name of the journalist who threatened him after the Indian wicketkeeper-batter was dropped from the squad against Sri Lanka. On Saturday when Saha was dropped from the Test team for Sri Lanka, the batter took to Twitter to share how a \"respected journalist\" approached him for an interview and how the messages soon became threatening. Saha notably didn`t reveal the name of the journalist. On Saha not revealing the journalist, Sarandeep said: \"Saha should speak on to this clearly also take the name of the journalist. Only Saha can tell who he is protecting.\" The former cricketer also opened about Hardik Pandya not getting selected in the Indian team, as he said: \"There should be a protocol if you perform well in Ranji then only you can be selected for the international team.\" With ANI inputs","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND VS SL: 'Comfortable' batting at any position, says Mayank Agarwal","link":"https://www.thehansindia.com/sports/cricket/ind-vs-sl-comfortable-batting-at-any-position-says-mayank-agarwal-730582","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Mayank was named in India’s 18-man Test squad for SL seriesIndia and SL are set to play two Tests next monthTheir T20I series is due to begin on Thursday (Feb. 24)","content":"India batsman Mayank Agarwal India batsman Mayank Agarwal India batsman Mayank Agarwal has said he is \"comfortable\" batting at any position but enjoys opening the innings most. Mayank had an impressive run with the bat in Test during India's home series against New Zealand and an away series against South Africa. As a result, the Karnataka batsman was named in India's 18-man squad for the upcoming Test series against Sri Lanka. \"The role of an opener is key in Test cricket because, in a five-day game, it is the openers who set up the day for the batters to follow. It's something that I have done all my life. I really enjoy doing that. With that being said, I don't just always want to open the batting. I am also comfortable batting at any position the team wants me to bat, at any given situation,\" Mayank said in a statement, according to ANI. Mayank finished as the leading run-scorer in the two-match Test series against the BlackCaps last year. He scored 242 runs in four innings at an average of 60.50. He managed 135 runs in the Rainbow Nation, where Team India suffered a series defeat. India are set to host Sri Lanka in a five-match series, starting Thursday (Feb. 24). It includes three T20Is and two Tests. Mayank has also highlighted the importance of the upcoming Test series and explained the reason behind India's mentality of winning every game. \"I am very excited to be part of the squad and part of the Indian Test team. I am really looking forward to contributing to the team's success. Every Test series is of utmost importance because of the World Test Championship. Each Test carries points. The collective thinking of our team is to pick up a win in every match that we play and try to get the maximum points we can from all the Test matches,\" the Karnataka batsman added further. IND VS SL: Want to make it count with the bat, says Mayank Over the past couple of decades, Sri Lanka have built a reputation of having a brilliant spin-bowling attack, especially in Tests. They are also known for giving the new ball to their spinners, which could make batting a tad tough for the opening batsmen. But Mayank said that he is prepared for any curveball Sri Lanka might throw at them. \"In India, as an opening batsman, you still have to be very good in facing the spin. Personally, it does not faze me if you open the bowling with spin or pace. We have grown up playing spin all our lives. Personally, my mindset would not change much. I would look to do what an opener sets out to do. Give a good start, set up the scores for the team and make it count. One of the advantages the openers have, with all the difficulties that come their way, is that they have the opportunity to score big runs,\" Mayank added. Ahead of the Indian Premier League (IPL) 2022 mega auction, Punjab Kings (PBKS) retained only two players, including Mayank. IPL 2022: PBKS did well at auction, says Mayank Mayank, who is expected to be a significant role in PBKS's IPL 2022 campaign, also spoke about his goal for the season. \"I believe, as a Punjab Kings player who has been retained, we did really well at the auction. I have always played any tournament to win and that's the same goal for me in the IPL. I will go into the IPL 2022 to win it for Punjab Kings, as I have always done every season that I have been part of the franchise,\" said Mayank. The 31-year-old batter also mentioned that his focus is not on the T20 World Cup 2022 and will just try to give his best for PBKS in the IPL 2022. \"I am not thinking too much about the selection in the India T20 squad for the T20 World Cup this year. My thought process is to play well, put in the performances, make sure my team wins, and hope for the best. Whatever happens after that, is okay with me,\" Mayank signed off.","pubDate":"2022-02-23 15:38:55","full_description":"India batsman Mayank Agarwal India batsman Mayank Agarwal has said he is \"comfortable\" batting at any position but enjoys opening the innings most. Mayank had an impressive run with the bat in Test during India's home series against New Zealand and an away series against South Africa. As a result, the Karnataka batsman was named in India's 18-man squad for the upcoming Test series against Sri Lanka. \"The role of an opener is key in Test cricket because, in a five-day game, it is the openers who set up the day for the batters to follow. It's something that I have done all my life. I really enjoy doing that. With that being said, I don't just always want to open the batting. I am also comfortable batting at any position the team wants me to bat, at any given situation,\" Mayank said in a statement, according to ANI. Mayank finished as the leading run-scorer in the two-match Test series against the BlackCaps last year. He scored 242 runs in four innings at an average of 60.50. He managed 135 runs in the Rainbow Nation, where Team India suffered a series defeat. India are set to host Sri Lanka in a five-match series, starting Thursday (Feb. 24). It includes three T20Is and two Tests. Mayank has also highlighted the importance of the upcoming Test series and explained the reason behind India's mentality of winning every game. \"I am very excited to be part of the squad and part of the Indian Test team. I am really looking forward to contributing to the team's success. Every Test series is of utmost importance because of the World Test Championship. Each Test carries points. The collective thinking of our team is to pick up a win in every match that we play and try to get the maximum points we can from all the Test matches,\" the Karnataka batsman added further. IND VS SL: Want to make it count with the bat, says Mayank Over the past couple of decades, Sri Lanka have built a reputation of having a brilliant spin-bowling attack, especially in Tests. They are also known for giving the new ball to their spinners, which could make batting a tad tough for the opening batsmen. But Mayank said that he is prepared for any curveball Sri Lanka might throw at them. \"In India, as an opening batsman, you still have to be very good in facing the spin. Personally, it does not faze me if you open the bowling with spin or pace. We have grown up playing spin all our lives. Personally, my mindset would not change much. I would look to do what an opener sets out to do. Give a good start, set up the scores for the team and make it count. One of the advantages the openers have, with all the difficulties that come their way, is that they have the opportunity to score big runs,\" Mayank added. Ahead of the Indian Premier League (IPL) 2022 mega auction, Punjab Kings (PBKS) retained only two players, including Mayank. IPL 2022: PBKS did well at auction, says Mayank Mayank, who is expected to be a significant role in PBKS's IPL 2022 campaign, also spoke about his goal for the season. \"I believe, as a Punjab Kings player who has been retained, we did really well at the auction. I have always played any tournament to win and that's the same goal for me in the IPL. I will go into the IPL 2022 to win it for Punjab Kings, as I have always done every season that I have been part of the franchise,\" said Mayank. The 31-year-old batter also mentioned that his focus is not on the T20 World Cup 2022 and will just try to give his best for PBKS in the IPL 2022. \"I am not thinking too much about the selection in the India T20 squad for the T20 World Cup this year. My thought process is to play well, put in the performances, make sure my team wins, and hope for the best. Whatever happens after that, is okay with me,\" Mayank signed off.","image_url":"https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278396-mayank-agarwal.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SL commentators 2022: Full list of Star Sports commentators for India vs Sri Lanka T20Is","link":"https://thesportsrush.com/cricket-news-ind-vs-sl-commentators-2022-full-list-of-star-sports-commentators-for-india-vs-sri-lanka-t20is/","keywords":["Cricket","india vs sri lanka","Sri Lanka tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs SL commentators 2022: The SportsRush present before you a list of Star Sports commentators for India vs Sri Lanka T20Is. On the back of successive clean sweeps in the T20I series against New Zealand and then against West Indies, Rohit Sharma could not have asked for a better start to his captaincy career… The post IND vs SL commentators 2022: Full list of Star Sports commentators for India vs Sri Lanka T20Is appeared first on The SportsRush.","content":"IND vs SL commentators 2022: The SportsRush present before you a list of Star Sports commentators for India vs Sri Lanka T20Is. On the back of successive clean sweeps in the T20I series against New Zealand and then against West Indies, Rohit Sharma could not have asked for a better start to his captaincy career for the Indian Cricket team. His busy schedule would have no breathing space as team India are set to commence with another 3-match T20I home series, against Sri Lanka this time around. The first T20I would take place at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow, while the HPCA stadium in Dharamsala would host the remaining two T20Is. As far as Sri Lanka is concerned, the Dasun Shanaka-led side have arrived India on the back of a 1-4 T20Is series loss against Australia Down Under. Team India would be without the services of all-rounder Deepak Chahar and the ‘Player of the series’ during the recently concluded T20Is against the Windies, Suryakumar Yadav. Both the players sustained injuries during the third T20I. On the other hand, Sri Lanka would commence their campaign without the presence of opener batter Avishka Fernando, and bowlers Nuwan Thushara And Ramesh Mendis- all of who were part of the team during the five-match T20I series against Australia. They have been ruled out due to injuries as well. Moreover, their star all-rounder Wanindu Hasaranga has also been ruled out of the T20Is series as he has not yet recovered from COVID-19. We are happy to welcome our Back of the Jersey branding sponsor for Sri Lanka tour of India 2022 – @Wolf777news #INDvSL pic.twitter.com/aXarTINxwh — Sri Lanka Cricket (@OfficialSLC) February 23, 2022 IND vs SL commentators 2022 The Star Sports Network, as part of their contract would be the sole broadcaster of the 3-match T20I series between the two sides as well as the two Tests which would follow soon after. The English commentary team would comprise the legendary Sunil Gavaskar, former India pacer Ajit Agarkar, and former Sri Lankan all-rounder Russell Arnold. As far as the Hindi commentators are concerned, the likes former Indian team players in Aakash Chopra, Sanjay Bangar, Irfan Pathan, and Deep Dasgupta would grace the viewers with their comments and analysis. The Star Sports network have not yet confirmed the commentators’ names for their respective Tamil, Telugu, and Kannada channels. English – Sunil Gavaskar, Ajit Agarkar, and Russell Arnold. Hindi – Aakash Chopra, Sanjay Bangar, Irfan Pathan, and Deep Dasgupta. The post IND vs SL commentators 2022: Full list of Star Sports commentators for India vs Sri Lanka T20Is appeared first on The SportsRush.","pubDate":"2022-02-23 15:08:03","full_description":"IND vs SL commentators 2022 : The SportsRush presents before you a list of Star Sports commentators for India vs Sri Lanka T20Is. On the back of successive clean sweeps in the T20I series against New Zealand and then against West Indies, Rohit Sharma could not have asked for a better start to his captaincy career for the Indian Cricket team. His busy schedule would have no breathing space as team India are set to commence with another 3-match T20I home series, against Sri Lanka this time around. The first T20I would take place at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow, while the HPCA stadium in Dharamsala would host the remaining two T20Is. As far as Sri Lanka is concerned, the Dasun Shanaka-led side have arrived India on the back of a 1-4 T20Is series loss against Australia Down Under. Team India would be without the services of all-rounder Deepak Chahar and the ‘Player of the series’ during the recently concluded T20Is against the Windies, Suryakumar Yadav. Both the players sustained injuries during the third T20I. On the other hand, Sri Lanka would commence their campaign without the presence of opener batter Avishka Fernando, and bowlers Nuwan Thushara And Ramesh Mendis- all of who were part of the team during the five-match T20I series against Australia. They have been ruled out due to injuries as well. Moreover, their star all-rounder Wanindu Hasaranga has also been ruled out of the T20Is series as he has not yet recovered from COVID-19. We are happy to welcome our Back of the Jersey branding sponsor for Sri Lanka tour of India 2022 – @Wolf777news #INDvSL pic.twitter.com/aXarTINxwh — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) February 23, 2022 The Star Sports Network , as part of their contract would be the sole broadcaster of the 3-match T20I series between the two sides as well as the two Tests which would follow soon after. The English commentary team would comprise the legendary Sunil Gavaskar, former India pacer Ajit Agarkar, and former Sri Lankan all-rounder Russell Arnold. As far as the Hindi commentators are concerned, the likes former Indian team players in Aakash Chopra, Sanjay Bangar, Irfan Pathan, and Deep Dasgupta would grace the viewers with their comments and analysis. The Star Sports network have not yet confirmed the commentators’ names for their respective Tamil, Telugu, and Kannada channels. English – Sunil Gavaskar, Ajit Agarkar, and Russell Arnold. Hindi – Aakash Chopra, Sanjay Bangar, Irfan Pathan, and Deep Dasgupta.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pak vs Aus: Nawaz Ruled Out, Naseem, Sarfaraz Named Traveling Reserves","link":"https://sports.ndtv.com/cricket/pakistan-vs-australia-mohammad-nawaz-ruled-out-of-test-series-naseem-shah-sarfaraz-ahmed-named-traveling-reserves-2785258","keywords":null,"creator":null,"video_url":null,"description":"Pakistan vs Australia: Pakistan all-rounder Mohammad Nawaz has been ruled out of the Australia series with a foot injury, the Pakistan Cricket Board said on Wednesday.","content":null,"pubDate":"2022-02-23 14:58:58","full_description":"Pakistan all-rounder Mohammad Nawaz has been ruled out of the Australia series with a foot injury, the Pakistan Cricket Board (PCB) said on Wednesday. Australia will tour Pakistan for three Tests, three ODIs, and one T20I. The first Test will be played in Rawalpindi from March 4. \"Mohammad Nawaz has been ruled out of the series with a foot injury. He will not be replaced in the side,\" PCB said in a statement. Naseem Shah and Sarfaraz Ahmed have been added as traveling reserves. They will only be considered for selection if there is an injury. \"Mohammad Haris has been added to the reserve players list. However, he, along with Kamran Ghulam, Mohammad Abbas, and Yasir Shah have been advised to participate in the Pakistan Cup, which commences on 2 March. If required, they will be drafted into the side,\" PCB said. Meanwhile, Test players who attended a training camp in Karachi and those not involved in PSL 2022 playoffs will arrive in Islamabad on Wednesday. After observing a three-day room isolation, they will hold a training session on Sunday. Promoted Also, Test players involved in the PSL 2022 playoffs will travel to Islamabad in a bubble on Monday and will participate in a training session on March 1. Pakistan squad: Babar Azam (captain), Mohammad Rizwan (vice-captain), Abdullah Shafique, Azhar Ali, Faheem Ashraf, Fawad Alam, Haris Rauf, Hasan Ali, Imam-ul-Haq, Nauman Ali, Sajid Khan, Saud Shakeel, Shaheen Shah Afridi, Shan Masood and Zahid Mahmood","image_url":"https://c.ndtvimg.com/2020-08/6b01c41g_naseem-shah_120x90_21_August_20.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Olympics say goodbye to Asia after a star-crossed run","link":"https://www.cheknews.ca/olympics-say-goodbye-to-asia-after-a-star-crossed-run-957375/","keywords":["Sports","olympics"],"creator":["Nicholas Pescod"],"video_url":null,"description":"BEIJING (AP) – The Olympics have said goodbye to Asia after a star-crossed run, and it’s unclear when they’ll be back after the continent hosted four of the last eight Games. The earliest the Summer Games could return is 2036, and the favourite could be the world’s most populous country — not China, as you […] The post Olympics say goodbye to Asia after a star-crossed run appeared first on CHEK.","content":"BEIJING (AP) – The Olympics have said goodbye to Asia after a star-crossed run, and it’s unclear when they’ll be back after the continent hosted four of the last eight Games. The earliest the Summer Games could return is 2036, and the favourite could be the world’s most populous country — not China, as you might expect, but India. India’s population is expected to overtake China’s 1.4 billion in the next decade, and it is lobbying for the western city of Ahmedabad to be the host city for 2036, with events elsewhere, including New Delhi, the capital. “India is in a race for hosting 2036,” Narinder Batra, president of the Indian Olympic Committee, told The Associated Press. He offered few other details. In a show of support, the IOC has scheduled the annual meeting of its full membership for next year in the western Indian metropolis of Mumbai. It’s a signal the courting has begun. Delivering the pitch: Indian IOC member Nita Ambani, who is married to Mukesh Ambani, the chairman of India’s multinational conglomerate Reliance Industries. The family fortune has been estimated at $100 billion. As it did with China, the IOC can envision India as a new frontier that will yield deep-pocketed sponsors, television rights deals and generous government support. Departing Asia means returning to familiar terrain: the Summer Games in Paris in 2024, the 2026 Winter Games in Milan-Cortina, and the 2028 Summer Games in Los Angeles. Brisbane is also lined up for the 2032 Summer Olympics, a return to Australia 32 years after Sydney. Brisbane is certain to add cricket to its sports menu and, of course, it would stay in place for India, where the sport has the world’s most fervent following. The Asia focus started with the 2008 Beijing Olympics, a grand coming-out party that many hoped would change China. Instead, China used to Games to change how it was viewed. The Asia run enriched the IOC with lucrative billion-dollar sponsorship deals with China’s Alibaba and Japan’s Toyota, put down roots in the world’s most populous continent and featured a return to South Korea 30 years after the 1988 Seoul Olympics were credited with helping to usher in democracy. Asia has also generated consistently bad public relations for the IOC. This includes a state-sponsored doping scandal from the 2014 Sochi Winter Olympics that lingers and surfaced again with allegations in Beijing against Russian figure skater Kamila Valieva. There was IOC vote-buying linked to the award of the Tokyo Olympics, which forced the resignation of the head of Japan’s Olympic Committee, Tsunekazu Takeda, and a diplomatic boycott of the just-finished Beijing Games centered on human rights abuses that also dogged Beijing in 2008. Add in the 2016 Games in Rio de Janeiro. This was another nontraditional stop that caused problems. It saw the organizing committee face bankruptcy and Carlos Nuzman, the head of the committee, convicted of corruption, money laundering and tax evasion. The former IOC member is appealing. “The IOC I think is viewed as a villain globally at this time, and they have to do something to change their image,” said Robert Baade, a sports economist at Lake Forest College outside Chicago. ”I’m not sure that’s going to happen at any time soon.“ Baade is the co-author of “Going for Gold: The Economics of the Olympics,” a study that looks at the costs and benefits of the Games. “It’s these little things, the five-star hotels, the elitism, the privilege that the IOC displays – and its eurocentrism,” Baade added. Christophe Dubi, the Olympic Games’ executive director, acknowledged India has expressed strong interest, but declined to name other countries that have. Several Chinese cities have been mentioned as possibilities, along with Jakarta, Indonesia, Seoul and others. “We have to respect that some are speaking confidentially to us because the public authorities are not fully on board, or sometimes governments are interested but it’s not the right timing,” Dubi said. The IOC no longer runs a wide-open bidding process, instead selecting cities in which it has interest – and vice versa. It puts the selection in the hands of the IOC leadership rather than with IOC members. The 2036 host is unlikely to be picked until after the next IOC presidential election in 2025. The other return to Asia could come with the 2030 Winter Olympics, where Sapporo, Japan – the 1972 Winter host – is probably the favorite. Also in the mix could be Vancouver, Salt Lake City and a Spanish bid, perhaps from Barcelona. The Japanese news agency Kyodo, citing unidentified sources, has reported that Sapporo and the IOC are in talks and a decision could come before the end of the year. The city has put the cost at $2.4 billion to $2.6 billion. The IOC owes Japan a favor after the one-year delay of the 2020 Olympics cost organizers an added $2 billion. Dubi would not confirm any of this but said the IOC was lucky to have Japan and China organizing the last two Olympics in the middle of the pandemic. “I think we were very fortunate to have them as partners,” Dubi said. “I don’t say that others could not have done it. But if you had to pick two countries where it was always doable and where you wouldn’t have doubts that they could pull it off – it’s those two.” The post Olympics say goodbye to Asia after a star-crossed run appeared first on CHEK.","pubDate":"2022-02-23 14:47:13","full_description":null,"image_url":null,"source_id":"cheknews","country":["canada"],"category":["sports"],"language":"english"},{"title":"Two options for England’s left-back conundrum, Twitter fans and…","link":"https://www.football365.com/news/england-sessegnon-tottenham-cresswell-west-ham-twitter-manchester-city-mailbox","keywords":["Front Page","Home Page","Liverpool","Mailbox","Manchester City","Manchester United","News","Tottenham Hotspur","West Ham United","mailbox","Mails","Ryan sessegnon"],"creator":["Editor F365"],"video_url":null,"description":"Who holds the answer to the … The post Two options for England’s left-back conundrum, Twitter fans and… appeared first on Football365.","content":"Who holds the answer to the left-back conundrum for England? Plus, toxic Twitter, Manchester City bottlers, women’s football and lots more… Send your thoughts to theeditor@football365.com…   England’s left-back conundrum A bit of discussion going on about the potential England squad at the moment, which I am always up for. What strikes me is that, while we have more right backs than you could shake a stick at, we only have one currently available left back, apparently, and it’s Luke Shaw who’s been crap all season. So I have to wonder, what are our options there? Gareth is obviously a fan of moving Trippier across to the other side, but now he’s injured too and it doesn’t work very well anyway. Saka is theoretically an option as a wing back, but he’s now establishing himself as a forward very effectively so maybe not any more. So this leaves, to my mind, two currently unexplored options. The first is Ryan Sessegnon, who ticks all the England pathway boxes and is currently doing… okay, filling in for Reguilon. However, he’ll almost certainly be back on the bench once Reggie is available again and can’t really complain too much about that. He’s under possibly the best manager to develop into a quality wing back with Conte, so it might be worth taking a chance on integrating him into the England setup sooner rather than later. And we know Gareth loves a defender with a bit of pace. Option number two, my preference, is West Ham’s Aaron Cresswell. Pros: he already has 3 England caps under Southgate, he’s brilliant at set pieces, he’s a pretty solid defender, he can play as part of a back 4 or 5, he’s part of a team performing extremely well. Cons: he’s 32, has some injury concerns and not a lot of pace. But as far as I can see, that’s about it. There’s been a lot of talk lately about calling up Jarrod Bowen, and absolutely justifiably so, but is he maybe the wrong West Ham player to be talking about? Harry (I feel dirty praising a West Ham player, but respect where it’s due), THFC.   ‘Twitter fans’ Interesting piece from Johnny Nic about the negative, toxic twitterati fans. What i’d add is that the rise of this behaviour has coincided with the rise in gambling on players values, either at the bookies or through sites where you actually earn/lose money if a players value changes. I personally doubt the two are connected, but when you consider that twitter (and social media) is used for dark purposes, and that the anonymity provided allows anybody to pretend to be something they are not, just to invoke reactions it can’t be discounted out of hand. Take the comments section on this site. It’s filled with trolls with fake names, some with multiple accounts having fake conversations with themselves, specifically targeting certain supporters of certain clubs because they know they’ll get a reaction. I can’t tell if this helps or hinders F365, but it always intrigues me that for a site which talks about toxicity of some segments of fans, that it enables it to happen anyway. Given how murky this environment is when it comes to intentions, maybe it is just people who get their kicks from making someone angry, but it wouldn’t surprise me if money is lurking somewhere behind too (not in f365 comments, but on Twitter/insta/etc). Rob, Worthing   I just don’t need any other league… Some of you lot say the womens’ game is not as good as the quality is not as good as the mens game. And the same has just been said about the Italian league too. I’m living in South Africa where the quality of football is very poor in my opinion and I can’t bear to watch it despite trying on a few occasions. However, I’d like to add a different perspective that I feel is more understandable, will be relatable to some and at the very least more defensible against the woke police. I don’t do twitter. I do the facebook. I don’t do Telegram or discord or any of these things, I do WhatsApp. I just don’t have the time or the need to have something else that essentially fills exactly the same need. Similarly, the football I watch fills an entertainment need and I don’t need a different form of it to add on top. I have been watching football since before the premier league started. Yes, football really did exist pre -1992. And I used to watch a hell of a lot more games than I currently do. Now, I pretty much watch Utd games and England games and not much else. I just don’t have time for more than that unless I want to ignore my family most evenings and all weekend. I have “invested” a lot of time in the premier league. I know the history, I know the teams, I know the country, I know the players and I love the football for its entertainment (more often than not). That is not to say there are not other forms of entertaining football out there and I have tried to watch womens football, African football, Spanish football, Italian football, amongst others and it is not as entertaining to me in comparison to what I know and love. That doesn’t mean it’s crap. I just don’t need it. Are you going to convince an Italian that he/she must watch the premier league because it’s just better? Why would he/she bother to watch the Italian league when the quality just isn’t the same. Maybe being Italian, being brought up in Italy with a more successful footballing heritage than England and living in Italy might make them want to watch their own league. Each to their own… Having said all that, being a cricket fan as well, I am the same about that sport. I didn’t need to watch county games as international one days and tests were enough. I didn’t need anything more. Until T20 came along and I realised I wanted that too. So until someone invents a version of football that is different enough and exciting enough to get me hooked such as 5 a side tournament or a version where yellow cards are replaced by an offended player getting one free punch or kick against the foluer then I’m happy to just occasionally watch a non-utd or non-england footy game to prove to myself that everything else is just not as good as what I love to watch. Jon, Cape Town (And can we now all admit that Utd selling Lukaku, the man with the touch of a baby elephant, for roughly the same fee we bought him for is actually one of our only ever good bits of transfer business? And if you have to ask what would constitue bottling then you’ll never really understand. Now get back to work)   Lovely… Morning All, Ok, Jon, yes, thank you, I’m fine now, thanks for that consoling arm… To Manjo, if you think that was a minor meltdown, maybe you should get to more places than your settee watching old LFC videos because your foamer mates do love an epic meltdown. Plus, if you’re going to accuse City of cheating, (something to be *proven* to be incorrect, much to your chagrin, I’m sure. You probably really wanted us to be found guilty, even though the facts were shown to be otherwise) looking back at your clubs’ list of misdemeanors is genuinely disturbing. Without going into lengthy details, I’ll just summerise as…”transfer database hacking, tapping up senior and youth players and having to publicly apologise for it, defending Luis Suarez, allowing the district of Anfield to go to shit so you can pick up the surrounding houses on the cheap, Fenway sanctioned for cheating in the NFL, taking money from sponsors convicted of breaking international sanctions against Iran, declaring a world record transfer profit and then asking the Taxpayer to pay for your furloughed staff, trying to trademark the word “Liverpool” (WTF??) so the city in which you’re based (well, probably not YOU, Manjo) couldn’t use its’ own name, sneer at the Liverpool mayor for having the balls to worry that crowds would gather after a title win…which is exactly what happened, of course (trying to set fire to the Liver Buildings??? What?) and, at the very least, complicity in the bottling of the opposition coach on the way to the ground. I could go on but I’d be accused of having a meltdown. Good luck against Leeds (hopefully, the breeze will ease for you) To Mark, exactly. Imagine the noise if City had adopted those tactics? Just trying to help Levenshulme Blue, Manchester19 PS. Is that the sound of a James Outram I can hear, scrabbling for his laptop…?   Manchester City bottlers? Of course they’ll be called bottlers. Liverpool fans will think of any excuse to feel hard done by. Rob   Lee asks today whether City will be labelled ‘bottlers’ if they don’t win the league. God, I hope not. If the incredibly unlikely happens, and City don’t win the league, then I’d ask everyone not to use the word. I hate the word bottler. It’s become largely meaningless. If you lose a game, or a title, or a cup final you ‘bottled’ it. Teams can’t lose a game anymore without the b-word being thrown out, especially on Twitter. It’s almost as bad as people who use ‘fraud’, which is seemingly just applied to any manager who isn’t doing very well (or sometimes bizarrely those that are). Guess what. Teams lose games. It doesn’t mean they bottled it. The 13/14 season is a prime example, because to say Liverpool bottled it is completely inaccurate. After 24 games, Liverpool were 4th and 8 points off 1st. No one considered them title contenders. They then won 12 of their next 14 games, picking up 47 points out of a possible 52. In what world is that bottling it? The one game they lost was to a classic Mourinho Chelsea performance, largely caused by one mistake from one player. Even if they had won the Palace game, they still wouldn’t have won the league. Liverpool needed to win 13 out of 14 games, and draw the other to win the title that year. To say they bottled it for failing to achieve that is ludicrous. If you are 10 points clear with 5 games to go and fail to win any games, that might be called bottling it. But losing a single game, or a number of games over the course of a season is just what teams do. So please can we stop with the bottle talk (and PLEASE stop fraud). It’s juvenile and completely inaccurate in the vast majority of cases. Mike, LFC, London Women’s football In response to BT. I think as soon as people stop comparing ALL of the characteristics of Men’s football to the Women’s game they can start to enjoy it for what it is. And that is a technically and tactically entertaining style of football(mostly). Watch it if you like it, don’t if you don’t, it’s that simple. I don’t watch my son play and turn my back because they were unable to execute the same gameplan as Man City do, I watch because I enjoy it, completely on its own merits. It’s not necessarily misogynist, it’s more likely an aversion to change. It happens in all walks of life, anything different happens and the barriers come up and strange criticisms emerge. It’s an odd facet of human nature. Steve (THFC)   Wading carefully into piranha infested waters with this one, but while BT makes a fair case for the amount of time a sport has been embedded in a country being a factor, they do make one miss-step. Let’s look at another sport, to start with – Tennis. Men’s matches are 5 sets, women’s 3. Why is that, if not an acceptance of some physical / stamina differences? (That’s a question, not a statement – if i’m wrong I truly want to know.) BT talks about the suggestion that “women are less capable of doing something physical than men”, and says it isn’t true. Outside sport, it fundamentally is. Doesn’t mean women can’t work in building, but it does mean they can’t carry as much. That’s perfectly fine. Not all men are stronger than all women, many women are far more gifted in other areas and likewise so are many men in others – we all have our own strengths and weakness. But as a base average, men are physically stronger than women. That’s a scientific fact. Look at any discipline in athletics – gymnastics may be the appropriate exception. However, strength and fitness aren’t the only factors in football. I would suggest that while time a sport is played is definitely a factor, so is investment. Women footballers can be perfectly capable of playing excellent football. What has definitely lacked has been investment, coaching, facilities and as these have been increased here in the UK so has the overall standard. Next it will be that women can see a serious future as footballers, so the sheer numbers of women playing the sport – from kick arounds in the park or at 5-a-sides to professional level – increase. That will see far more players of higher standards in the sport (presumably less in others). As my partner always says, she could have been a professional skiier but she’s never had the chance to find out, having never had the chance when younger. I want to see greater investment in women’s sport, they are just as deserving of the opportunities it gives. But will we see a day where the women’s game and the men’s is equal if we put the best of the best on each side against each other? I don’t think so. Would Serena Williams beat Djokovic? That’s not misogynism, that’s realism. But then can’t we just appreciate that they are different? That we are different? One doesn’t have to be better than the other. FWIW, my foot-eye coordination is pretty average at best – never really developed it as a kid – but my hand-eye coordination is much better. So I gave up playing as much football and played more hockey because they’re similar games but worked better to my skillset. It’s ok that men and women aren’t the same. Or maybe I’m just a dinosaur, and Johnny Nic / thayden will do another piece about my outdated attitudes. Badwolf   Man Utd points… * A little late, but is Yusuf Kampala really saying ,that profilgacy and our defense giving up late goal’s ,when we look in control are progress?? If anything these performances have been like bad Ole games from the 2 full years (the games that ended up being draws ) …I’m with Jon the true test is March …Ole’interim numbers at this point we’re better ( 29 to 22 in 11 games ) and he had to play the likes of Spurs early . * can Liverpool fans stop pointing out what manager ,we need next by making comparisons to their journey , truth is we could be anywhere , we could as someone said be at the Daglish period (I find that disparaging as we have made less horrible signings ) ,the Evans Era (Strange as his predecessors have won a few 2nd rate trophies ,or we could be one summer from the whole picture becoming clearer and being contenders ( or in other words next year could be our year lolz)….. *Speaking of next year here’s a scary thought what of if the plan is not to buy a central midfielder , instead we just let Garner come up from the loan route and Make him Matic’s replacement …any thoughts ? Timi, Mufc   Proof that Rio reads F365? Rio mocks ‘Liverpool are flying’ comments with bizarre Rangnick claim. Date published: Wednesday 23rd February 2022 11:40 – Joe Williams And Ferdinand has claimed that “only Man City have picked up more points since he has come” Ferdinand mocks ‘Liverpool are flying’ comments with bizarre Rangnick stat (football365.com) Mediawatch Date published: Wednesday 9th February 2022 7:24 – Editor F365 It remains the case that Manchester City are the only team to earn more Premier League points than Manchester United since Rangnick’s first match on December 5. Manchester United might as well have stuck with Solskjaer – and here is the damning proof (football365.com) This is the second time that I have written in about that nonsense Mediawatch article with its selective use of stats. I expect this tripe from Rio but F365 should be better at counting games. Maybe The Editor owes Joe Williams a drink. Alex, South London   Time to beat my drum (again) I always enjoy reading the massive cross thread of” conspiracy theories” (Arsenal) …” Dark Arts” ( tactical fouls)and of course my own favourite recurring nightmare ” time wasting”. Having read a couple of Man City fans views on the ( apparently) extremely exaggerated time wasting tactics …I am afraid to say it is time for me to dust down my faithful ” Let’s do away with subjective injury time” drum again. Briefly it would mean EVERY game would last exactly the same length as only the ball in play time would count towards the total( 60 minutes?) …Just think of it…no real point to time wasting other than to slightly disrupt flow of games, remove the art of ridiculous ” bring off the guy furthest away” substitutions…… make pointless .deliberate arguments with referees about the most trivial of matters……All these things would be pretty much redundant. Now ….either I am a genius( which for the record I am not) OR this must have been discussed and dismissed by the powers that be for reasons way beyond the comprehension of this non genius brain. I promise this is the last time I shall write in on this subject( I think) my time is up Phil( can’t think of what to put in here) Liasides   Players that left England and achieved? In response to the question “Is there other players out there that left England and achieved as much?” from Paul (MUFC) Dublin. Cristiano Ronaldo and Gerard Pique did okay after leaving England. Hakim, Sri Lanka   The post Two options for England’s left-back conundrum, Twitter fans and… appeared first on Football365.","pubDate":"2022-02-23 14:28:18","full_description":"Who holds the answer to the left-back conundrum for England? Plus, toxic Twitter, Manchester City bottlers, women’s football and lots more… Send your thoughts to theeditor@football365.com … England’s left-back conundrum A bit of discussion going on about the potential England squad at the moment, which I am always up for. What strikes me is that, while we have more right backs than you could shake a stick at, we only have one currently available left back, apparently, and it’s Luke Shaw who’s been crap all season. So I have to wonder, what are our options there? Gareth is obviously a fan of moving Trippier across to the other side, but now he’s injured too and it doesn’t work very well anyway. Saka is theoretically an option as a wing back, but he’s now establishing himself as a forward very effectively so maybe not any more. So this leaves, to my mind, two currently unexplored options. The first is Ryan Sessegnon, who ticks all the England pathway boxes and is currently doing… okay, filling in for Reguilon. However, he’ll almost certainly be back on the bench once Reggie is available again and can’t really complain too much about that. He’s under possibly the best manager to develop into a quality wing back with Conte, so it might be worth taking a chance on integrating him into the England setup sooner rather than later. And we know Gareth loves a defender with a bit of pace. Option number two, my preference, is West Ham’s Aaron Cresswell. Pros: he already has 3 England caps under Southgate, he’s brilliant at set pieces, he’s a pretty solid defender, he can play as part of a back 4 or 5, he’s part of a team performing extremely well. Cons: he’s 32, has some injury concerns and not a lot of pace. But as far as I can see, that’s about it. There’s been a lot of talk lately about calling up Jarrod Bowen, and absolutely justifiably so, but is he maybe the wrong West Ham player to be talking about? Harry (I feel dirty praising a West Ham player, but respect where it’s due), THFC. ‘Twitter fans’ Interesting piece from Johnny Nic about the negative, toxic twitterati fans . What i’d add is that the rise of this behaviour has coincided with the rise in gambling on players values, either at the bookies or through sites where you actually earn/lose money if a players value changes. I personally doubt the two are connected, but when you consider that twitter (and social media) is used for dark purposes, and that the anonymity provided allows anybody to pretend to be something they are not, just to invoke reactions it can’t be discounted out of hand. Take the comments section on this site. It’s filled with trolls with fake names, some with multiple accounts having fake conversations with themselves, specifically targeting certain supporters of certain clubs because they know they’ll get a reaction. I can’t tell if this helps or hinders F365, but it always intrigues me that for a site which talks about toxicity of some segments of fans, that it enables it to happen anyway. Given how murky this environment is when it comes to intentions, maybe it is just people who get their kicks from making someone angry, but it wouldn’t surprise me if money is lurking somewhere behind too (not in f365 comments, but on Twitter/insta/etc). Rob, Worthing I just don’t need any other league… Some of you lot say the womens’ game is not as good as the quality is not as good as the mens game. And the same has just been said about the Italian league too. I’m living in South Africa where the quality of football is very poor in my opinion and I can’t bear to watch it despite trying on a few occasions. However, I’d like to add a different perspective that I feel is more understandable, will be relatable to some and at the very least more defensible against the woke police. I don’t do twitter. I do the facebook. I don’t do Telegram or discord or any of these things, I do WhatsApp. I just don’t have the time or the need to have something else that essentially fills exactly the same need. Similarly, the football I watch fills an entertainment need and I don’t need a different form of it to add on top. I have been watching football since before the premier league started. Yes, football really did exist pre -1992. And I used to watch a hell of a lot more games than I currently do. Now, I pretty much watch Utd games and England games and not much else. I just don’t have time for more than that unless I want to ignore my family most evenings and all weekend. I have “invested” a lot of time in the premier league. I know the history, I know the teams, I know the country, I know the players and I love the football for its entertainment (more often than not). That is not to say there are not other forms of entertaining football out there and I have tried to watch womens football, African football, Spanish football, Italian football, amongst others and it is not as entertaining to me in comparison to what I know and love. That doesn’t mean it’s crap. I just don’t need it. Are you going to convince an Italian that he/she must watch the premier league because it’s just better? Why would he/she bother to watch the Italian league when the quality just isn’t the same. Maybe being Italian, being brought up in Italy with a more successful footballing heritage than England and living in Italy might make them want to watch their own league. Each to their own… Having said all that, being a cricket fan as well, I am the same about that sport. I didn’t need to watch county games as international one days and tests were enough. I didn’t need anything more. Until T20 came along and I realised I wanted that too. So until someone invents a version of football that is different enough and exciting enough to get me hooked such as 5 a side tournament or a version where yellow cards are replaced by an offended player getting one free punch or kick against the foluer then I’m happy to just occasionally watch a non-utd or non-england footy game to prove to myself that everything else is just not as good as what I love to watch. Jon, Cape Town (And can we now all admit that Utd selling Lukaku, the man with the touch of a baby elephant, for roughly the same fee we bought him for is actually one of our only ever good bits of transfer business? And if you have to ask what would constitue bottling then you’ll never really understand. Now get back to work) Lovely… Morning All, Ok, Jon, yes, thank you, I’m fine now, thanks for that consoling arm… To Manjo, if you think that was a minor meltdown, maybe you should get to more places than your settee watching old LFC videos because your foamer mates do love an epic meltdown. Plus, if you’re going to accuse City of cheating, (something to be *proven* to be incorrect, much to your chagrin, I’m sure. You probably really wanted us to be found guilty, even though the facts were shown to be otherwise) looking back at your clubs’ list of misdemeanors is genuinely disturbing. Without going into lengthy details, I’ll just summerise as…”transfer database hacking, tapping up senior and youth players and having to publicly apologise for it, defending Luis Suarez, allowing the district of Anfield to go to shit so you can pick up the surrounding houses on the cheap, Fenway sanctioned for cheating in the NFL, taking money from sponsors convicted of breaking international sanctions against Iran, declaring a world record transfer profit and then asking the Taxpayer to pay for your furloughed staff, trying to trademark the word “Liverpool” (WTF??) so the city in which you’re based (well, probably not YOU, Manjo) couldn’t use its’ own name, sneer at the Liverpool mayor for having the balls to worry that crowds would gather after a title win…which is exactly what happened, of course (trying to set fire to the Liver Buildings??? What?) and, at the very least, complicity in the bottling of the opposition coach on the way to the ground. I could go on but I’d be accused of having a meltdown. Good luck against Leeds (hopefully, the breeze will ease for you) To Mark, exactly. Imagine the noise if City had adopted those tactics? Just trying to help Levenshulme Blue, Manchester19 PS. Is that the sound of a James Outram I can hear, scrabbling for his laptop…? Manchester City bottlers? Of course they’ll be called bottlers . Liverpool fans will think of any excuse to feel hard done by. Rob Lee asks today whether City will be labelled ‘bottlers’ if they don’t win the league. God, I hope not. If the incredibly unlikely happens, and City don’t win the league, then I’d ask everyone not to use the word. I hate the word bottler. It’s become largely meaningless. If you lose a game, or a title, or a cup final you ‘bottled’ it. Teams can’t lose a game anymore without the b-word being thrown out, especially on Twitter. It’s almost as bad as people who use ‘fraud’, which is seemingly just applied to any manager who isn’t doing very well (or sometimes bizarrely those that are). Guess what. Teams lose games. It doesn’t mean they bottled it. The 13/14 season is a prime example, because to say Liverpool bottled it is completely inaccurate. After 24 games, Liverpool were 4th and 8 points off 1st. No one considered them title contenders. They then won 12 of their next 14 games, picking up 47 points out of a possible 52. In what world is that bottling it? The one game they lost was to a classic Mourinho Chelsea performance, largely caused by one mistake from one player. Even if they had won the Palace game, they still wouldn’t have won the league. Liverpool needed to win 13 out of 14 games, and draw the other to win the title that year. To say they bottled it for failing to achieve that is ludicrous. If you are 10 points clear with 5 games to go and fail to win any games, that might be called bottling it. But losing a single game, or a number of games over the course of a season is just what teams do. So please can we stop with the bottle talk (and PLEASE stop fraud). It’s juvenile and completely inaccurate in the vast majority of cases. Mike, LFC, London Women’s football In response to BT. I think as soon as people stop comparing ALL of the characteristics of Men’s football to the Women’s game they can start to enjoy it for what it is. And that is a technically and tactically entertaining style of football(mostly). Watch it if you like it, don’t if you don’t, it’s that simple. I don’t watch my son play and turn my back because they were unable to execute the same gameplan as Man City do, I watch because I enjoy it, completely on its own merits. It’s not necessarily misogynist, it’s more likely an aversion to change. It happens in all walks of life, anything different happens and the barriers come up and strange criticisms emerge. It’s an odd facet of human nature. Steve (THFC) Wading carefully into piranha infested waters with this one, but while BT makes a fair case for the amount of time a sport has been embedded in a country being a factor, they do make one miss-step. Let’s look at another sport, to start with – Tennis. Men’s matches are 5 sets, women’s 3. Why is that, if not an acceptance of some physical / stamina differences? (That’s a question, not a statement – if i’m wrong I truly want to know.) BT talks about the suggestion that “women are less capable of doing something physical than men”, and says it isn’t true. Outside sport, it fundamentally is. Doesn’t mean women can’t work in building, but it does mean they can’t carry as much. That’s perfectly fine. Not all men are stronger than all women, many women are far more gifted in other areas and likewise so are many men in others – we all have our own strengths and weakness. But as a base average, men are physically stronger than women. That’s a scientific fact. Look at any discipline in athletics – gymnastics may be the appropriate exception. However, strength and fitness aren’t the only factors in football. I would suggest that while time a sport is played is definitely a factor, so is investment. Women footballers can be perfectly capable of playing excellent football. What has definitely lacked has been investment, coaching, facilities and as these have been increased here in the UK so has the overall standard. Next it will be that women can see a serious future as footballers, so the sheer numbers of women playing the sport – from kick arounds in the park or at 5-a-sides to professional level – increase. That will see far more players of higher standards in the sport (presumably less in others). As my partner always says, she could have been a professional skiier but she’s never had the chance to find out, having never had the chance when younger. I want to see greater investment in women’s sport, they are just as deserving of the opportunities it gives. But will we see a day where the women’s game and the men’s is equal if we put the best of the best on each side against each other? I don’t think so. Would Serena Williams beat Djokovic? That’s not misogynism, that’s realism. But then can’t we just appreciate that they are different? That we are different? One doesn’t have to be better than the other. FWIW, my foot-eye coordination is pretty average at best – never really developed it as a kid – but my hand-eye coordination is much better. So I gave up playing as much football and played more hockey because they’re similar games but worked better to my skillset. It’s ok that men and women aren’t the same. Or maybe I’m just a dinosaur, and Johnny Nic / thayden will do another piece about my outdated attitudes. Badwolf Man Utd points… * A little late, but is Yusuf Kampala really saying ,that profilgacy and our defense giving up late goal’s ,when we look in control are progress?? If anything these performances have been like bad Ole games from the 2 full years (the games that ended up being draws ) …I’m with Jon the true test is March …Ole’interim numbers at this point we’re better ( 29 to 22 in 11 games ) and he had to play the likes of Spurs early . * can Liverpool fans stop pointing out what manager ,we need next by making comparisons to their journey , truth is we could be anywhere , we could as someone said be at the Daglish period (I find that disparaging as we have made less horrible signings ) ,the Evans Era (Strange as his predecessors have won a few 2nd rate trophies ,or we could be one summer from the whole picture becoming clearer and being contenders ( or in other words next year could be our year lolz)….. *Speaking of next year here’s a scary thought what of if the plan is not to buy a central midfielder , instead we just let Garner come up from the loan route and Make him Matic’s replacement …any thoughts ? Timi, Mufc Proof that Rio reads F365? Rio mocks ‘Liverpool are flying’ comments with bizarre Rangnick claim. Date published: Wednesday 23rd February 2022 11:40 – Joe Williams And Ferdinand has claimed that “only Man City have picked up more points since he has come” Ferdinand mocks ‘Liverpool are flying’ comments with bizarre Rangnick stat (football365.com) Mediawatch Date published: Wednesday 9th February 2022 7:24 – Editor F365 It remains the case that Manchester City are the only team to earn more Premier League points than Manchester United since Rangnick’s first match on December 5. Manchester United might as well have stuck with Solskjaer – and here is the damning proof (football365.com) This is the second time that I have written in about that nonsense Mediawatch article with its selective use of stats. I expect this tripe from Rio but F365 should be better at counting games. Maybe The Editor owes Joe Williams a drink. Alex, South London Time to beat my drum (again) I always enjoy reading the massive cross thread of” conspiracy theories” (Arsenal) …” Dark Arts” ( tactical fouls)and of course my own favourite recurring nightmare ” time wasting”. Having read a couple of Man City fans views on the ( apparently) extremely exaggerated time wasting tactics …I am afraid to say it is time for me to dust down my faithful ” Let’s do away with subjective injury time” drum again. Briefly it would mean EVERY game would last exactly the same length as only the ball in play time would count towards the total( 60 minutes?) …Just think of it…no real point to time wasting other than to slightly disrupt flow of games, remove the art of ridiculous ” bring off the guy furthest away” substitutions…… make pointless .deliberate arguments with referees about the most trivial of matters……All these things would be pretty much redundant. Now ….either I am a genius( which for the record I am not) OR this must have been discussed and dismissed by the powers that be for reasons way beyond the comprehension of this non genius brain. I promise this is the last time I shall write in on this subject( I think) my time is up Phil( can’t think of what to put in here) Liasides Players that left England and achieved? In response to the question “Is there other players out there that left England and achieved as much?” from Paul (MUFC) Dublin. Cristiano Ronaldo and Gerard Pique did okay after leaving England. Hakim, Sri Lanka","image_url":null,"source_id":"football365","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"PHT vs BG Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Sharjah CBFS T10 2022, 3rd Quarter-Final","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/pht-vs-bg-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-sharjah-cbfs-t10-2022-3rd-quarter-final?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-23 13:32:17","full_description":"Prim Height Transport will take on Brother Gas in the third quarter-final of the Sharjah CBFS T10 2022 at the Sharjah Cricket Stadium in UAE on Wednesday. In the group stages of the tournament, Prim Height Transport secured three wins in five matches. They arrive into this game on the back of an impressive win. They defeated the Alubond Tigers by nine wickets in their last match and are expected to continue with the same momentum here as well. Brother Gas, meanwhile, won four of their five group stage games. They finished second in Group B and will be hoping to qualify for the semis with a win here. PHT XI Jean Miguel Podosky, Jordan Alegre, Gurbhupinder Chohan, Henry Tyler, Grant Russ(w), Kapil Kumar, Vimal Kumar, Jonathan Hill(c), Richard Goodwin, Huzaifa Mohammed, Daniel Smith. BG XI Dawood Ejaz, Mohammad Azhar (C), Tanvir Javed, Zeeshan Abid, Saqib Manshad, Hamdan Tahir (wk), Mohammad Waseem, Mujahid Amin., Jiju Janardhanan, Zahid Ali, Omer Farooq. PHT vs BG, Sharjah CBFS T10 2022, 3rd Quarter-Final Date and Time: February 23, 2022, 9:00 PM IST Venue: Sharjah Cricket Stadium, Sharjah, UAE Judging by previous games, the track seems to be a batting paradise. High scores are pretty common on this ground as the ball skids and comes on to the bat quite well. 120 could prove to be the par score at this venue and the side winning the toss should ideally opt to bat first. Wicketkeeper H Tahir will be a valuable choice for the wicketkeeper position for your Dream11 fantasy team. He has scored 116 runs at a strike rate of 161.11 and will be expecting a big knock here. Batters U Khan is the top-scorer for Brother Gas in the Sharjah CFBS so far. He has amassed 204 runs in five matches at an average of 51 and has a mind-blowing strike rate of 224.18. A Gul is the highest scorer for Prim Height Transport and has amassed 146 runs and has been dismissed only once. Gul also has a wonderful strike rate of 202.78. All-rounders R Khaliq has been performing well with the ball. He has picked up five wickets in four matches at an average of 11.60. Bowlers M Azhar has been on song for Brother Gas and has wreaked havoc with his bowling. He has scalped 10 wickets in only five matches at a stunning average of 8.20. U Khan (BG) – 359 points M Azhar (BG) – 346 points A Gul (PHT) – 277 points H Tahir (BG) – 207 points R Khaliq (PHT) – 205 points U Khan: 204 runs M Azhar: 10 wickets A Gul: 146 runs H Tahir: 116 runs R Khaliq: 5 wickets Fantasy Suggestion #1: H Tahir, A Ur Rehman, U Khan, A Gul, J Janardhanan, R Khaliq, O Farooq, R Zaman, M Azhar, H Bilal, S Manshad Captain: U Khan , Vice-Captain: M Azhar Fantasy Suggestion #2: H Tahir, U Khan, A Gul, J Janardhanan, A Khan, R Khaliq, O Farooq, F Ghulam, M Azhar, H Bilal, S Manshad Captain: R Khaliq , Vice-Captain: A Gul.","image_url":"https://static.sportskeeda.com/editor/2022/02/93bbe-16456203092632-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"PCK vs BRE Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for European Cricket League 2022, Match 14","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/pck-vs-bre-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-european-cricket-league-2022-match-14?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-02-23 13:32:17","full_description":"Prague CC Kings will take on Brescia in the 14th match of the European Cricket League 2022 at the Cartama Oval in Cartama, Spain on Wednesday. Prague CC Kings began the campaign with a 10-wicket win over ZTB. However, they went on to lose their next two successive matches. They were defeated by Cluj by 17 runs in the previous match and are currently fifth in the standings. Meanwhile, Brescia suffered successive defeats to open their campaign. They bounced back strongly to secure a 162-run victory over ZTB in the previous match. They are fourth in the table and have the same number of points as Prague CC Kings. PCK XI Sudhir Gladson, Jahangir Wani, Laxminarayanan Selvan, Hilal Ahmad, Arun Ashokan, Sharan Ramakrishnan, Sudita Udugalage, Sameera Maduranga, Prakash Sadasivan, Kushal Mendon, Sudesh Wickramasekara. BRE XI Qalab Sajjad, Babar Hussain, Ahmadullah Safi, Imran Naveed, Shadnan Khan, Bashar Khan, Javed Muhammad, Basharat Ali, Yasir Dullu, Naveed Chaudhary, Imad Khan. PCK vs BRE, European Cricket League 2022, Match 14 Date and Time: 23rd February, 2022, 7:30 PM IST Venue: Cartama Oval, Cartama Judging by previous games, the track seems to be a batting paradise. High scores are pretty common on this ground as the ball skids and comes on to the bat quite well. 120 could prove to be the par score at this venue and the side winning the toss should ideally opt to bat first. Wicketkeeper H. Ahmad is a destructive batter who could prove to be a wise choice behind the stumps too. He has scored 50 runs at a strike rate of 166.66 so far. Batters B. Hussain is another responsible cricketer who could prove to be pivotal. He smashed an incredible century at a terrific strike rate of 300 in the last match. Hussain has amassed 124 runs in three matches so far. All-rounders S. Wickramasekara is the highest run-scorer for Prague CC Kings with 70 runs at a strike rate of over 225. He has also picked up a wicket and could prove to be a great multiplier choice for your PCK vs BRE Dream11 Fantasy Team. Bowlers B. Ali is in great touch and can prove to be a superb bowler. He has already collected four wickets in three matches. S. Wickramasekara (PCK) – 358 points B. Ali (BRE) – 248 points B. Hussain (BRE) – 223 points S. Maduranga (PCK) – 207 points H. Ahmad (PCK) – 159 points S. Wickramasekara: 70 runs and 1 wicket B. Ali: 4 wickets B. Hussain: 124 runs S. Maduranga: 4 wickets H. Ahmad: 50 runs Fantasy Suggestion #1: H. Ahmad, I. Khan, B. Hussain, N. Chaudhary, A. Ashokan, S. Wickramasekara, S. Khan, A. Raza Islam, B. Ali, S. Maduranga, A. Hassan Sittar Captain: S. Wickramasekara , Vice-Captain: B. Ali Fantasy Suggestion #2: H. Ahmad, I. Khan, B. Hussain, N. Chaudhary, A. Ashokan, S. Sundareswaran, S. Wickramasekara, S. Khan, B. Ali, S. Maduranga, A. Safi Captain: B. Hussain , Vice-Captain: S. Maduranga","image_url":"https://static.sportskeeda.com/editor/2022/02/f4945-16456186543944-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Bangladesh vs Afghanistan, 1st ODI, Afghanistan tour of Bangladesh, 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiT2h0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1jb21tZW50YXJ5LzQzOTUxL2FmaWYtbWVoaWR5LXNjcmlwdC1zdHVubmluZy13aW7SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs Afghanistan, 1st ODI, Afghanistan tour of Bangladesh, 2022  CricbuzzRecent Match Report - Afghanistan vs Bangladesh 1st ODI 2021/22  ESPNcricinfoBAN vs AFG Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Afghanistan Tour of Bangladesh, 1st ODI  Cricket AddictorBangladesh vs Afghanistan, 1st ODI: Bangladesh Pair Record 2nd Highest 7th Wicket Partnership In ODI..  NDTVSports.comMatch Preview - Afghanistan vs Bangladesh, Afghanistan in Bangladesh 2021/22, 1st ODI  ESPNcricinfoView Full coverage on Google News","content":null,"pubDate":"2022-02-23 13:07:34","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Sri Lanka 2022: India's Predicted Playing XI For First T20I - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9zcmktbGFua2EtdG91ci1vZi1pbmRpYS0yMDIyL2luZGlhLXZzLXNyaS1sYW5rYS0yMDIyLWluZGlhcy1wcmVkaWN0ZWQtcGxheWluZy14aS1mb3ItZmlyc3QtdDIwaS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs Sri Lanka 2022: India's Predicted Playing XI For First T20I  Cricket AddictorIndia vs Sri Lanka T20 Series, Preview: Hosts aim for another series sweep  NEWS9 liveIndia vs Sri Lanka 1st T20 Prediction – Who will win the match between IND vs SL?  CricTrackerIndia vs Sri Lanka: Head To Head Records, Sri Lanka Tour of India 2022, 1st T20I  Cricket AddictorIND vs SL T20 Series LIVE Broadcast: 8 Star Channels to broadcast IND vs SL live in 5 languages  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-02-23 12:53:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Interim coach McDonald yet to discuss full-time role with Cricket Australia","link":"https://sportstar.thehindu.com/cricket/interim-coach-andrew-mcdonald-yet-to-discuss-full-time-role-with-cricket-australia/article38436275.ece","keywords":null,"creator":["Reuters"],"video_url":null,"description":"Langer, who guided Australia to its maiden Twenty20 World Cup in November and a 4-0 Ashes triumph against England last month, rejected a short-term extension and resigned this month.","content":null,"pubDate":"2022-02-23 12:40:12","full_description":"Australia's interim coach Andrew McDonald said he has yet to hold formal discussions with governing body Cricket Australia about the possibility of taking up the full-time role following the exit of Justin Langer. Langer, who guided Australia to its maiden Twenty20 World Cup in November and a 4-0 Ashes triumph against England last month, rejected a short-term extension and resigned this month. READ | Jadeja: Feels good to play for India after two months McDonald was appointed on an interim basis ahead of the team's tour of Pakistan next month and is considered a front-runner for the permanent role, having effectively served as Langer's deputy since 2019. \"I haven't had any conversations either way,\" McDonald told reporters on Wednesday. \"It's really just been bedding down the interim role until the end of Pakistan (tour) and getting to work on the preparations, getting to work on the team. \"I'm very happy with whatever timelines they (Cricket Australia) want to work within. It won't become a distraction, that will just be happening in the background.\" Cricket Australia chairman Lachie Henderson said on Monday that the governing body is open to splitting the head coach's role, conceding it was taxing for one person to coach across formats. RELATED | Australia open to splitting coaching role after Langer exit \"Clearly I have to make a decision before that if the process is run to the timeline Cricket Australia are giving,\" McDonald added. \"We'll work through it once we see what the job looks like.\" Former England coach Trevor Bayliss, who has also been linked with the Australia head coach job, told the Sydney Morning Herald on Tuesday there had been \"no contact\" when asked if he had been interviewed for the position.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 schedule: Tournament to be played at four venues, final to take place on THIS date - Zee News","link":"https://news.google.com/__i/rss/rd/articles/CBMiiAFodHRwczovL3plZW5ld3MuaW5kaWEuY29tL2NyaWNrZXQvaXBsLTIwMjItc2NoZWR1bGUtdG91cm5hbWVudC10by1iZS1wbGF5ZWQtYXQtZm91ci12ZW51ZXMtZmluYWwtdG8tdGFrZS1wbGFjZS1vbi10aGlzLWRhdGUtMjQzOTE1Ni5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 schedule: Tournament to be played at four venues, final to take place on THIS date  Zee NewsIPL 2022 set to have 55 matches in Mumbai, 15 in Pune | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 Schedule, Teams, Start Date, Players List, Match List  Cricket AddictorIPL 2022 to be Held in Mumbai And Pune; Final on May 29: Report  News18CSK, RR, PBKS, DC, MI, KKR, RCB, SRH, GT, LSG Squad: IPL 2022 Date and Schedule  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-02-23 12:28:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Interim coach McDonald yet to discuss full-time role with Cricket Australia","link":"https://www.channelnewsasia.com/sport/interim-coach-mcdonald-yet-discuss-full-time-role-cricket-australia-2515031","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-23 12:23:14","full_description":"Australia's interim coach Andrew McDonald said he has yet to hold formal discussions with governing body Cricket Australia about the possibility of taking up the full-time role following the exit of Justin Langer. Langer, who guided Australia to their maiden Twenty20 World Cup in November and a 4-0 Ashes triumph against England last month, rejected a short-term extension and resigned this month. McDonald was appointed on an interim basis ahead of the team's tour of Pakistan next month and is considered a front-runner for the permanent role, having effectively served as Langer's deputy since 2019. \"I haven't had any conversations either way,\" McDonald told reporters on Wednesday (Feb 23). \"It's really just been bedding down the interim role until the end of Pakistan (tour) and getting to work on the preparations, getting to work on the team. \"I'm very happy with whatever timelines they (Cricket Australia) want to work within. It won't become a distraction, that will just be happening in the background.\" Cricket Australia chairman Lachie Henderson said on Monday that the governing body is open to splitting the head coach's role, conceding it was taxing for one person to coach across formats. \"Clearly I have to make a decision before that if the process is run to the timeline Cricket Australia are giving,\" McDonald added. \"We'll work through it once we see what the job looks like.\" Former England coach Trevor Bayliss, who has also been linked with the Australia head coach job, told the Sydney Morning Herald on Tuesday there had been \"no contact\" when asked if he had been interviewed for the position.","image_url":"https://onecms-res.cloudinary.com/image/upload/s--HI2LRyPy--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2022-02-23t122314z_1_lynxmpei1m0j7_rtroptp_3_cricket-england-australia.jpg?itok=WmR3IJoB","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"Interim coach McDonald yet to discuss full-time role with Cricket Australia","link":"https://www.channelnewsasia.com/sport/interim-coach-mcdonald-yet-discuss-role-cricket-2515031","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-02-23 12:23:00","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--HI2LRyPy--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2022-02-23t122314z_1_lynxmpei1m0j7_rtroptp_3_cricket-england-australia.jpg?itok=WmR3IJoB","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"“Will’s indicated that he wants to keep playing”: Chris Rogers confirms Will Pucovski is aiming to continue playing at the highest level","link":"https://thesportsrush.com/cricket-news-wills-indicated-that-he-wants-to-keep-playing-chris-rogers-confirms-will-pucovski-is-aiming-to-continue-playing-at-the-highest-level/","keywords":["Cricket"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Will Pucovski has confirmed to Victoria Cricket that he is willing to continue playing at the highest level despite his 11th concussion. Will Pucovski has to be the unluckiest cricketer on the circuit right now. He made his much-awaited return to cricket, but yet another concussion forced him to leave the field. He got hit… The post “Will’s indicated that he wants to keep playing”: Chris Rogers confirms Will Pucovski is aiming to continue playing at the highest level appeared first on The SportsRush.","content":"Will Pucovski has confirmed to Victoria Cricket that he is willing to continue playing at the highest level despite his 11th concussion. Will Pucovski has to be the unluckiest cricketer on the circuit right now. He made his much-awaited return to cricket, but yet another concussion forced him to leave the field. He got hit on his head by a volleyball during warm-ups and faced the symptoms on the field. There is no date regarding his comeback right now. Pucovski suffered his 10th concussion in November and was ruled out of Ashes 2021-22. The 23-year old opener from Victoria is highly rated, but he has been really unlucky. He made his debut last year against India, and he also scored a half-century in it. However, he injured his shoulder during the game and missed the rest of the series. Pucovski has scored 1816 first-class runs at an astonishing average of 53.41, with the help of six centuries. After Pucovski’s latest concussion, there are many calls in the media for him to retire. Victorian captain Peter Handscomb said that they want the well-being of Will Pucocvski, and the doctors can only take the call. Chris Rogers confirms Will Pucovski wants to continue Victoria coach Chris Rogers has confirmed that Will Pucovski has expressed his desire to play at the highest level. There is no set date for his return, but he won’t take the retirement route. “There’s conversations that are happening in the background. Will’s indicated that he wants to keep playing, so we just have to weigh up everything that’s happening at the moment,” Rogers said on SEN radio. He’s been in and around Junction Oval a few times over the four days of the Shield game (last weekend against Queensland) and he is coming in tomorrow (Thursday).” A sight for sore eyes, Will Pucovski back batting in the #SheffieldShield pic.twitter.com/GGKGJ7bfWc — 7Cricket (@7Cricket) February 10, 2022 “We’ll have a chat with him then to see how he’s going.” “I think he’s pretty hopeful, we just have to have those conversations and make sure that everything’s okay. I’m sure that that’ll play out.” Victorian cricket association has confirmed that all the decisions will be taken considering the well being and safety of Will.   The post “Will’s indicated that he wants to keep playing”: Chris Rogers confirms Will Pucovski is aiming to continue playing at the highest level appeared first on The SportsRush.","pubDate":"2022-02-23 11:21:02","full_description":"Will Pucovski has confirmed to Victoria Cricket that he is willing to continue playing at the highest level despite his 11th concussion. Will Pucovski has to be the unluckiest cricketer on the circuit right now. He made his much-awaited return to cricket, but yet another concussion forced him to leave the field. He got hit on his head by a volleyball during warm-ups and faced the symptoms on the field. There is no date regarding his comeback right now. Pucovski suffered his 10th concussion in November and was ruled out of Ashes 2021-22. The 23-year old opener from Victoria is highly rated, but he has been really unlucky. He made his debut last year against India, and he also scored a half-century in it. However, he injured his shoulder during the game and missed the rest of the series. Pucovski has scored 1816 first-class runs at an astonishing average of 53.41, with the help of six centuries. After Pucovski’s latest concussion, there are many calls in the media for him to retire. Victorian captain Peter Handscomb said that they want the well-being of Will Pucocvski, and the doctors can only take the call. Victoria coach Chris Rogers has confirmed that Will Pucovski has expressed his desire to play at the highest level. There is no set date for his return, but he won’t take the retirement route. “There’s conversations that are happening in the background. Will’s indicated that he wants to keep playing, so we just have to weigh up everything that’s happening at the moment,” Rogers said on SEN radio. He’s been in and around Junction Oval a few times over the four days of the Shield game (last weekend against Queensland) and he is coming in tomorrow (Thursday).” A sight for sore eyes, Will Pucovski back batting in the #SheffieldShield 👊 pic.twitter.com/GGKGJ7bfWc — 7Cricket (@7Cricket) February 10, 2022 “We’ll have a chat with him then to see how he’s going.” “I think he’s pretty hopeful, we just have to have those conversations and make sure that everything’s okay. I’m sure that that’ll play out.” Victorian cricket association has confirmed that all the decisions will be taken considering the well being and safety of Will.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SL Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Sri Lanka Tour of India, 1st T20I - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMisgFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L2luZC12cy1zbC1kcmVhbTExLXByZWRpY3Rpb24tZmFudGFzeS1jcmlja2V0LXRpcHMtZHJlYW0xMS10ZWFtLXBsYXlpbmcteGktcGl0Y2gtcmVwb3J0LWluanVyeS11cGRhdGUtc3JpLWxhbmthLXRvdXItb2YtaW5kaWEtMXN0LXQyMGkv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SL Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Sri Lanka Tour of India, 1st T20I  Cricket AddictorIndia vs Sri Lanka T20 Series, Preview: Hosts aim for another series sweep  NEWS9 liveIndia vs Sri Lanka: India’s Predicted Playing XI for 1st T20I  CricTrackerIndia vs Sri Lanka: Head To Head Records, Sri Lanka Tour of India 2022, 1st T20I  Cricket AddictorIndia vs Sri Lanka, 1st T20I Live Streaming: When and where to watch  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-02-23 11:20:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"}]}