{"newsArray":[{"title":"It was just Fantastic to See Kohli Taking Test Cricket So Seriously: Smith","link":"https://www.sentinelassam.com/sports/cricket/it-was-just-fantastic-to-see-kohli-taking-test-cricket-so-seriously-smith-608700","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"“It’s just iconic nations that are contributing to Test cricket at the moment. India led the way in Test cricket under Virat Kohli.\", said Smith","content":"LONDON, Aug 20: Former South Africa skipper Graeme Smith applauded the attitude India had towards Test cricket when Virat Kohli was captain, saying it was fantastic to see him take the longest format of the game extremely seriously.Kohli, who became full-time Test captain in 2015 after MS Dhoni announced his retirement from the format, led India to 40 wins out of 68 Tests as skipper while losing 17 and drawing 11 matches. He stepped down from Test captaincy as India lost 2-1 in South Africa in January, with a win percentage of 58.82 while registering memorable wins in overseas and home conditions.\"With Test cricket, it's just iconic nations or the big cricketing nations that are contributing to Test cricket at the moment. India led a (the) way in Test cricket under Virat Kohli. It was just fantastic; he took Test cricket so seriously in world cricket. They lead the way with that,\" said Smith on 'Sky Sports' during day three's action between England and South Africa at Lord's.At the same time, Smith pointed out that only a small number of nations are contributing to Test match action in the world. \"But as long as we've got competitive teams, you're not going to have 10, 11, 12, 13 or 14 competitive teams. You might only be down to five or six nations that play Test cricket at this level.\"Smith, who is also the commissioner of South Africa's new upcoming T20 league, further explained why the new T20 league was needed from a financial perspective. \"It's certainly going to be an investment into our game that South African cricket desperately needed.\"\"The pressures on nations like New Zealand, West Indies, South Africa to stay financially sustainable to keep up with England, India, and the world game to stay competitive is hugely important. I don't think world cricket can afford South Africa or any one of the top nations to start fading away.\"To have all players from South Africa available for the inaugural edition of the new T20 league, the ODI series against Australia in January was forfeited, an implication of which is that they have lost out on 30 points in the World Cup Super League tally, risking their automatic qualification for ODI World Cup in India next year.\"For four weeks of an entire year, the priority will be the league. I feel that if we hadn't done this South African cricket could have probably lost eight to ten players to this UAE league. People also look at those three ODIs wrong.\"\"Yes, South Africa hasn't handled ODI cricket as well and it should never be in this position. But for South Africa to be in Australia out of their key part of the summer financially is a huge stress for them. It's like asking England not to play during your summer.\"\"The commitment that South African cricket made to go for the three Test matches is good for the game. It's something that won't happen often,\" concluded Smith. IANSAlso Read : AGRI & ALLIED PRODUCTS: Assam's exports crossed Rs 1,799 crore in 2021-22Also Watch : ","pubDate":"2022-08-22 08:49:32","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377341-was-just-fantastic-to-see-virat-kohli-taking-test-cricket-so-seriously-graeme-smith.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM 3rd ODI Live Score Updates: KL Rahul departs for 30, Brad Evans provides the breakthrough for Zimbabwe - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvY3JpY2tldC9pbmQtdnMtemltLTNyZC1vZGktbGl2ZS1zY29yZS11cGRhdGVzLTgxMDQyMTYv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs ZIM 3rd ODI Live Score Updates: KL Rahul departs for 30, Brad Evans provides the breakthrough for Zimbabwe  The Indian ExpressIND vs ZIM: India's Predicted Playing XI Against Zimbabwe, 3rd ODI  Cricket AddictorMatch Preview - India vs Zimbabwe, India in Zimbabwe 2022, 3rd ODI  ESPNcricinfoIndia vs Zimbabwe Live Score 3rd ODI: Dhawan, Gill steady after Rahul falls  Hindustan TimesClean sweep on cards for India against weak Zimbabwe  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2022-08-22 08:34:59","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"CSA T20 League: Chennai Super Kings-owned franchise elated to have Du Plessis","link":"https://www.indiatvnews.com/sports/cricket/csa-t20-league-chennai-super-kings-owned-franchise-elated-to-have-du-plessis-2022-08-22-801963","keywords":null,"creator":null,"video_url":null,"description":"CSA T20 League: Throwing their hat into the glamorous and money-minting world of T20 leagues, Cricket South Africa earlier this year announced that they are sure about starting their version of the Indian Premier League (IPL). Needless to say, the Indian Premier League has done loads of good to the Indian cricketing system and also to the other cricketing nations. With questions looming over the relevance of the bilateral series, especially the ODI format, as of now it seems that franchise & T20 league cricket is the only way forward in the gentleman's game.","content":"Throwing their hat into the glamorous and money-minting world of T20 leagues, Cricket South Africa earlier this year announced that they are sure about starting their version of the Indian Premier League ( ). Needless to say, the Indian Premier League has done loads of good to the Indian cricketing system and also to the other cricketing nations. With questions looming over the relevance of the bilateral series, especially the ODI format, as of now it seems that franchise & T20 league cricket is the only way forward in the gentleman's game. The Chennai Super Kings-owned Johannesburg franchise spoke high praises of former South African captain on Sunday and said that the former CSK star will have a pivotal role to play as one of its marquee players in the inaugural edition of the CSA T20 league. Coincidentally Du Plessis has been a former Chennai Super Kings (CSK) player himself from 2011-2021. The former South Africa captain recently moved to Royal Challengers Bangalore in the year 2022 after the mega auctions. \" \", said the Chennai Super Kings franchise. The Johannesburg franchise owned by Chennai Super Kings also roped in England all-rounder , Sri Lankan spinner Maheesh Theekshana, West Indies all-rounder Romario Shepherd, and South African fast bowler Gerald Coetzee. The Franchise further added that \" \", the franchise further added.","pubDate":"2022-08-22 07:55:52","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"India-Pakistan Asia Cup tie tickets sell out","link":"https://www.sentinelassam.com/sports/cricket/india-pakistan-asia-cup-tie-tickets-sell-out-608679","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Indian national and Sharjah resident Saad said that he logged into the ticket portal from multiple computers to get tickets.","content":"DUBAI, Aug 20: Cricket fans have gone to extremes to get tickets for the much-awaited India vs Pakistan match to be played in Dubai on August 28. The first batch of tickets for the clash between the archrivals was sold out within three hours on August 15. IANS spoke to some lucky people who got a chance to buy tickets in the first batch. Indian national and Sharjah resident Saad said that he logged into the ticket portal from multiple computers to get tickets. \"I queued up on the site from 8 a.m. I saw updates about ticket sales and opened the website on four computers at once. I was lucky as I managed to buy tickets within 20 minutes.\" IANS Also Read : Assam: Police Arrest Two Persons For Allegedly Attacking Each Other In Sonitpur Also Watch :","pubDate":"2022-08-22 07:52:29","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377271-fans-pour-dirhams-as-india-pak-asia-cup-tie-tickets-sell-out.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Shaheen Afridi's replacement named in Pakistan's Asia Cup squad - ICC Cricket","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI3NTUxOTHSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shaheen Afridi's replacement named in Pakistan's Asia Cup squad  ICC CricketAfter Pakistan Great's \"Big Relief For India\" Tweet, Irfan Pathan's Reply  NDTV Sports‘With no Bumrah India bowling attack looks weak, but with no Afridi Pakistan…'  Hindustan TimesAsia Cup 2022: Pakistan Cricket Board Announces Replacement for Injured Shaheen Shah Afridi  News18\"Told Him Not To Dive\": Ex-Pakistan Captain On Shaheen Afridi's Injury  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-08-22 07:46:47","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"“It has changed my perspective towards cricket”: Sanju Samson credits IPL captaincy stint for evolving as a cricketer","link":"https://thesportsrush.com/cricket-news-it-has-changed-my-perspective-towards-cricket-sanju-samson-credits-ipl-captaincy-stint-for-evolving-as-a-cricketer/","keywords":["Cricket","India","India tour of Zimbabwe 2022","Indian Premier League","rajasthan royals","RR","Sanju Samson","Zimbabwe"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Sanju Samson credits IPL captaincy stint: The Indian wicket-keeper batter believes he has benefited from the Indian Premier League. India wicket-keeper batter Sanju Samson believes in looking for positives in all life and career situations. Samson, 27, was referring to playing only 22 international matches across formats despite debuting seven years ago. While playing even… The post “It has changed my perspective towards cricket”: Sanju Samson credits IPL captaincy stint for evolving as a cricketer appeared first on The SportsRush.","content":"Sanju Samson credits IPL captaincy stint: The Indian wicket-keeper batter believes he has benefited from the Indian Premier League. India wicket-keeper batter Sanju Samson believes in looking for positives in all life and career situations. Samson, 27, was referring to playing only 22 international matches across formats despite debuting seven years ago. While playing even one match for India is a dream for thousands of cricketers around the country, 16 T20Is and six ODIs are considered less for Samson primarily due to his sheer talent. Often criticized for not doing justice to his potential across formats, Samson had scored a match-winning 43* (39) including playing the winning shot in a 162-run chase in the second ODI against Zimbabwe on Saturday. The first time’s always special. 🏆🇮🇳 pic.twitter.com/C4Xw9ETKn6 — Rajasthan Royals (@rajasthanroyals) August 20, 2022 “I am a believer that whatever you go through in your career, you have to take it in a positive manner. I really enjoyed playing domestic cricket in the last four-five years. It is challenging to do well there and that has made me be a better player,” Samson told the host broadcaster before the start of the third ODI in Harare. A regular face in the Indian Premier League, Samson has credited not just playing but leading in the biggest T20 tournament around the world as a reason behind his evolution as a cricketer. “It has changed my perspective towards cricket. Earlier, I used to think only about my batting, my game. Captaincy helps bring about a different mindset – think about others as well apart from your game,” Samson added. Been leading Rajasthan Royals for a couple of seasons now, Samson had powered them to the final of IPL 2022 but couldn’t get past champions Gujarat Titans in the last match. Samson, who enjoys a loyal fan-base across social media platforms, enjoys an equally solid fan-following from the stands as well. Expressing surprise at the same for someone who hasn’t played a lot of international cricket, Samson acknowledged his fellow Malayalis for supporting him. “I feel surprised that despite playing very little for India, I get good support. I feel there are a lot more Malayalis as I hear cheers of ‘Chetta, Chetta’ which makes me feel proud. I am really proud to be a Malayali and represent my country as a Malayali cricketer,” Samson concluded.","pubDate":"2022-08-22 07:39:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India-Pakistan Asia Cup Clash Marks Return of the Greatest Rivalry on UAE Soil","link":"https://www.sentinelassam.com/sports/cricket/india-pakistan-asia-cup-clash-marks-return-of-the-greatest-rivalry-on-uae-soil-608667","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"This return brings back the tradition of India-Pakistan matches being played in the country through the 1980s and 1990s, mainly in Sharjah.","content":"NEW DELHI, Aug 20: After two years of delay caused by the Covid-19 pandemic and a shift in venue due to the economic crisis in Sri Lanka, the Asia Cup is finally going to happen in the UAE from August 27 to September 11. What makes this year's tournament, to be held in the T20 format in Dubai and Sharjah, special is that it will also mark the return of the greatest rivalry in men's cricket -- India vs Pakistan. The return of the Asia Cup to the UAE also brings back the tradition of India-Pakistan matches being played in the country through the 1980s and 1990s, mainly in Sharjah. India, the defending champions and seven-time winners of the trophy, will be looking to retain their throne as the best in Asia. A successful defence of the Asia Cup title ahead of the Men's T20 World Cup in Australia in October-November, where they will be facing Pakistan too on October 23, will be a huge boost for India, who have embraced an attacking style of play with the bat since their early exit from the tournament last year. Pakistan, who had a stunning run to the semifinals in the UAE in the T20 World Cup last year, will be looking to be the prime challengers and do an encore of their 10-wicket victory over India during the mega event. There are high chances that the greatest rivalry featuringIndia and Pakistan will not only happen once or twice, but potentially thrice in the tournament if both teams make it to the finals. After the group stage match on August 28 at the Dubai International Stadium, India and Pakistan will be well on track to face each other in the Super Four stage and, who knows, there could be a tantalising title clash too. In Asia Cup, India have faced Pakistan 14 times, winning eight matches while ending up on the losing side on five occasions. Five of those eight wins have come in India's last six meetings with Pakistan in the Asia Cup since 2010. The last time India lost to Pakistan was in 2014, in Mirpur, Bangladesh. At a time where there is no bilateral cricket between the two teams, an India-Pakistan clash in box-office events like Asia Cup and World Cups is more like touch and go. Of late, India had been the dominator in the big-ticket clash, until Pakistan changed the script last year in Dubai. Shaheen Shah Afridi, Imad Wasim, Hasan Ali, Haris Rauf clicked well in unison to keep India to 151. Captain Babar Azam and his deputy Mohammad Rizwan then finished off the chase with half-centuries, peppered with such precision without being broken by the Indian bowlers for a 01-wicket victory which broke their World Cup hoodoo against them. Unarguably, an India-Pakistan clash is the biggest eyeballs-grabbing match in the cricketing world, financially as well as social media views-wise. But with the hype and pressure around, it is also a match, which will test the mental toughness and temperament of a player. Performing big in India-Pakistan matches can hand a cricketer cult status if he leads the side to a victory while for the losing side, massive backlash is in store back home. Come August 28, an evening blockbuster awaits fans from both India and Pakistan when Babar Azam and Rohit Sharma lead their teams on the field at the Dubai International Stadium to write another chapter of the greatest rivalry in the world of cricket. IANS Also Read : Panel on xatras gives data-acquiring format across Assam Also Watch :","pubDate":"2022-08-22 07:27:19","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377254-compressasiacup2022.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"“Always wondered why IPL teams haven’t given him a longer rope”: Harsha Bhogle questions IPL teams for not giving opportunities to Jimmy Neesham","link":"https://thesportsrush.com/cricket-news-always-wondered-why-ipl-teams-havent-given-him-a-longer-rope-harsha-bhogle-questions-ipl-teams-for-not-giving-opportunities-to-jimmy-neesham/","keywords":["Cricket","Harsha Bhogle","Jimmy Neesham IPL"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Jimmy Neesham has been in great form lately, and Harsha Bhogle has asked the IPL franchises about the lack of opportunities for him. New Zealand all-rounder Jimmy Neesham is in some form in International cricket this year. During the 3rd ODI match between New Zealand and West Indies, Neesham smashed 34 runs in just 11… The post “Always wondered why IPL teams haven’t given him a longer rope”: Harsha Bhogle questions IPL teams for not giving opportunities to Jimmy Neesham appeared first on The SportsRush.","content":"Jimmy Neesham has been in great form lately, and Harsha Bhogle has asked the IPL franchises about the lack of opportunities for him. New Zealand all-rounder Jimmy Neesham is in some form in International cricket this year. During the 3rd ODI match between New Zealand and West Indies, Neesham smashed 34 runs in just 11 balls at a strike-rate of 309.09 on a sluggish track to help his side win the game. In T20Is this year, Neesham has scored 191 runs at an incredible strike-rate of 207.71, whereas he has scalped 4 wickets with the ball as well. The performances of Neesham has been acknowledged by many around the world, and Harsha Bhogle has now also asked the IPL franchises about the ignorance of Jimmy Neesham in the IPL. Harsha Bhogle questions IPL teams about Jimmy Neesham Famous Indian commentator Harsha Bhogla has questioned the franchise for not giving a long rope to Jimmy Neesham. He said that the way Neesham has played in the T20 Leagues around the world, he deserves a defined role in the side and he can win the games on his own. “For the kind of player, Jimmy Neesham is, I’ve always wondered why IPL teams haven’t given him a longer rope. 14 games in 8 years with a silly SR and avg isn’t him. Look at what he does in T20I & in other leagues! With a few games together and a clearly defined role, he can win games,” Harsha Bhogle tweeted. For the kind of player @JimmyNeesh is, I’ve always wondered why IPL teams haven’t given him a longer rope. 14 games in 8 years with a silly SR and avg isn’t him. Look at what he does in T20I & in other leagues! With a few games together and a clearly defined role,he can win games — Harsha Bhogle (@bhogleharsha) August 22, 2022 It is surprising that Neesham has just played a total of 14 IPL games in his career, where he has scored just 92 runs and has scalped 8 wickets with the ball. He has played Delhi, Rajasthan, Mumbai and Punjab so far in his IPL career. Neesham was bought by Rajasthan Royals in IPL 2022, but he played just a couple of matches for them. The way Neesham has played in the T20 Blast and international cricket this year, he certainly has raised his stocks and can be a valuable option for the Royals next year. The post “Always wondered why IPL teams haven’t given him a longer rope”: Harsha Bhogle questions IPL teams for not giving opportunities to Jimmy Neesham appeared first on The SportsRush.","pubDate":"2022-08-22 07:14:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cricket-Russell, Boult among Big Bash&#039;s &#039;Platinum&#039; dozen","link":"https://www.thestar.com.my/sport/cricket/2022/08/22/cricket-russell-boult-among-big-bash039s-039platinum039-dozen","keywords":null,"creator":null,"video_url":null,"description":"MELBOURNE (Reuters) - Australia's Big Bash League has unveiled 12 marquee players for the first round of Sunday's draft, including 10 who are likely to exit the tournament before the halfway stage to play in other Twenty20 leagues that will run concurrently in January. Read full story","content":null,"pubDate":"2022-08-22 07:09:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/08/22/1706811.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM: Zimbabwe Cricket dedicates 2nd ODI to fight against childhood cancer","link":"https://indianexpress.com/article/sports/cricket/ind-vs-zim-zimbabwe-cricket-dedicates-2nd-odi-to-fight-against-childhood-cancer-8104407/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Zimbabwe Cricket, who is hosting India for three-match ODI seires, has come forward to support the battle against childhood cancer by dedicating the second ODI between India and Zimbabwe, played on Saturday at Harare Sports Club. India won the match by five wickets and took an unassailable 2-0 lead. The cricket board of Zimbabwe said in a statement that they are supporting The NGO- KidzCan Zimbabwe- whose mandate includes providing chemotherapy drugs, bus fares, diagnostics, nutritional requirements and psychosocial support to children suffering from cancer in the country. Zimbabwe national team players Regis Chakabva, Sikandar Raza and Bradley Evans had visited the children’s oncology ward at Parirenyatwa Hospital on the eve of the second ODI against India. They donated hampers and toys to each of the 26 young cancer patients in the ward. A framed playing shirt signed by the Zimbabwe squad was also presented to Kidzcan Zimbabwe Chairman Dave Mills, who was accompanied by seven-year-old eye cancer survivor Takunda Maguhu. Subscriber Only Stories View All Premium ExplainSpeaking: How should public sector banks be privatised? Premium 19 states cross pre-Covid GSDP levels in FY22; Kerala, UP lag Premium In window for Congress chief election, disquiet and speculation but no co... Premium Explained: US jobs-recession paradox Buy now at Freedom Sale prices Takunda also received a signed cricket ball from the player of the match, India wicketkeeper-batter Sanju Samson, before he posed for pictures with Zimbabwe Captain Chakabva and his India counterpart KL Rahul .","pubDate":"2022-08-22 06:32:45","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Tezpur District Sports Association introduces incentive awards for sportspersons","link":"https://www.sentinelassam.com/north-east-india-news/local-sports/tezpur-district-sports-association-introduces-incentive-awards-for-sportspersons-608633","keywords":["Sports,Local Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Tezpur District Sports Association took a new initiative in the field of sports in the district today. A financial assistance sports incentive award was launched in memory of Dr. Anand Chandra Sharma,","content":"OUR CORRESPONDENT TEZPUR: The Tezpur District Sports Association took a new initiative in the field of sports in the district today. A financial assistance sports incentive award was launched in memory of Dr. Anand Chandra Sharma, who represented Assam in the Ranji Trophy in cricket and Guwahati University in football. The award, named \"Dr. Anand Chandra Sharma Sports Incentive Award\", will be funded by a private trust established by members of Dr Sharma's family. For this award, the Tezpur District Sports Association will select one or more young athletes every year who are in real need of financial assistance and they must be atleast state level medal winners of \" Olympic Games\". The awards were presented at the inaugural ceremony of the final match of the 'A' Division Football League at Pole field today. The 2022 awards were presented to boxer Chitra Raj Limbu and runner Rimjim Saikia with a certificate and a check of Rs. 25,000 each. Limbu won gold medal in the 48 kg category at the Assam Youth Olympics held this year and represented Assam in the National Boxing Championships. Rimjim Saikia won gold medals in the 100m and 200m events at the Assam Youth Olympics held this year. Rimjim won the bronze medal in the 2020 National Athletics Championships also. Also Read: All Assam Major Ranking Table Tennis tournament in Golaghat District Also Watch: Noida administrationa demolished the illegal construction at the resident of Shrikant Tyagi #shorts","pubDate":"2022-08-22 06:16:17","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377195-sports.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Pandit as head coach of an IPL side marks a new beginning for Indian coaches","link":"https://www.sentinelassam.com/sports-news/pandit-as-head-coach-of-an-ipl-side-marks-a-new-beginning-for-indian-coaches-608618","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The women’s IPL is finally happening. March 2023 will see the women take centre stage prior to the already established world-class product that is the men’s Indian Premier League.","content":"ANJUM CHOPRA The women's IPL is finally happening. March 2023 will see the women take centre stage prior to the already established world-class product that is the men's Indian Premier League. While it will enhance the women's game with more competitive cricket, it will be in complete contrast to the men's game, which has had an overload of game time. England Test captain Ben Stokes deciding to quit ODIs and New Zealand pace bowler Trent Boult not opting for a central contract indicates the possible pathway forward for some well-established men's players. IPL side Kolkata Knight Riders decided to fill the vacancy of head coach left vacant by Brendon McCullum's departure by appointing Chandrakant Pandit. Pandit's name is synonymous with delivering consistent results in domestic cricket. Someone who has played the game at the highest level, he has seen all the corridors through which players walk. He comes from an era where technique and temperament were the basis to become a complete player and then learning patience to construct a long innings. For him, cricket did not change irrespective of the state, the player or the team. While commentating in domestic cricket during the Ranji Trophy knockout matches earlier this season, I saw Madhya Pradesh (the team Pandit coached) had no fear of failure. No, not in the sense that the batters played extravagant shots, but their overall approach — be it in the semis or final. It was a cool, calm, collected side. MP didn't have the big names playing for them. They didn't seem too perturbed competing against the more established names in the rival teams. They just followed their path. They backed their homework, followed the instructions and stuck to their beliefs. To get the better of Bengal in the semifinal and overpower a fancied Mumbai team in the final, MP needed to remain consistent. Ahead of the final against Mumbai, I could feel that Aditya Srivastava was more nervous than Prithvi Shaw! But nervousness is not a weakness. Aditya and his team showed that. Asked to bowl, MP didn't have it easy against the aggressive batting of Mumbai. But before the end of play on Day 1, MP had got themselves back into the contest and eventually won the title. Chandrakant Pandit's accession to the role of head coach of an IPL franchise marks a new beginning for Indian coaches. There is always a first time. His methodology with the IPL team might be different but he thrives on a strong base. He always says cricket is still the same. I believe it too. To hit the ball over the bowler's head, one needs to learn to defend the ball and then drive along the ground. Lofting is an extension of the arms but the base is similar in both the strokes. BCCI has a very structured coaching programme. With the women's IPL approaching, there might be a similarity initially in leaning back on home coaching talent playing second fiddle to foreign coaches, but there is no surety. It will become crucial for Indian women coaches to put their hands up and be counted in. The men's game has hit overdrive but the women's game is in the progression stage. It might not take a very long time to pick up speed but yes, any compromise in the basics of the game might pose a challenge. You cannot always hit the ball out of the park to score runs; sometimes grafting for ones and twos also keeps the scoreboard moving. Game on ladies — both players and coaches. (Anjum Chopra is a former captain of the Indian women's cricket team. The views expressed here are personal). Also Read: Kolkata Knight Riders appoint Chandrakant Pandit as new head coach Also Watch: Noida administrationa demolished the illegal construction at the resident of Shrikant Tyagi #shorts","pubDate":"2022-08-22 05:54:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377176-ipl.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Special GB of ACA held in Tezpur","link":"https://www.sentinelassam.com/sports/cricket/special-gb-of-aca-held-in-tezpur-608602","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"It was decided to constitute an organising committee under the chairmanship of Assam CM, for the ensuing T20I match between India and South Africa on Oct 2.","content":"Sports Reporter GUWAHATI, Aug 20: The Special General Body Meeting of the Assam Cricket Association was held today at the newly constructed Tezpur Convention Centre, Tezpur today. The meeting was presided over by its president Romen Dutta and it was attended by several other ACA officials including secretary Devajit Saikia along with representatives from each of the 42 affiliated units. During the meeting, it was decided to constitute an organising committee under the chairmanship of Chief Minister Himanta Biswa Sarma, for the ensuing T20I match between India and South Africa scheduled to be held in Guwahati on October 2. Several important decisions relating to the game of Cricket were also taken including appointment of coaches and other technical staff of the Assam team for the forthcoming senior and other age-group tournaments of the BCCI. The meeting also mourned the untimely demise of Abdul Matin, former secretary of the Assam Cricket Association, and Amitabh Choudhary, former joint secretary of BCCI . It was further decided that a family pension amounting to Rs. 20000 would be given to the widow of Abdul Matin, who was a noted cricket administrator of Assam. Another crucial decision that was taken during the meeting was regarding certain issues about the Apex Council of Assam Cricket Association and its term. Application would be moved either Supreme Court or the Gauhati High Court with respect to certain constitutional issues. It was also decided that a separate legal team would be constituted by Assam Cricket Association for this purpose. Later ACA officials, accompanied by Deba Kumar Mishra, DC, Sonitpur, visited a plot of land for inspection at Teleria, Tezpur, where an exclusive cricket complex would be built under the ongoing infrastructure development programme of the Assam Cricket Association. Meanwhile, the Veteran Cricket Association of Assam today welcomed the decision of the Assam Cricket Association to provide a family pension to the widow of Abdul Matin. The secretary of the Association Nasir Gul Khan said, \"It's a good decision and for this we give thanks to the ACA.\" Also Read : Assam: Police Nab Cachar College Principal For Violating Protocol During Grade III & Grade IV Exam Also Watch :","pubDate":"2022-08-22 05:29:24","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377157-22e8f81fec4ca720b34491ed7a5dda1f.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"David Warner calls upon Cricket Australia (CA) to revoke captaincy ban","link":"https://www.sentinelassam.com/sports-news/david-warner-calls-upon-cricket-australia-ca-to-revoke-captaincy-ban-608601","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"After signing a two-year deal with Sydney Thunder to return to the Big Bash League, star opener David Warner has called on Cricket Australia (CA) for overturning his lifetime ban on holding any captaincy position.","content":"SYDNEY: After signing a two-year deal with Sydney Thunder to return to the Big Bash League, star opener David Warner has called on Cricket Australia (CA) for overturning his lifetime ban on holding any captaincy position. Warner was the most heavily punished of the three players involved in the 2018 ball-tampering incident against South Africa in Cape Town -- alongside Steven Smith and Cameron Bancroft. The left-handed batter was prevented from holding any leadership position in Australian cricket for the rest of his career. However, there is growing sentiment that the decision needs to be overturned to allow Warner to captain in the BBL at least, an ESPNcricinfo report said. Thunder will also need a new captain for the 2022-23 season after Usman Khawaja moved to Brisbane Heat. \"That hasn't really been brought to the table. As I've said plenty of times off the record, it's upon the board to reach out to me and open their doors. Then I can sit down and have an honest conversation with them,\" Warner said on Sunday. \"The board has changed since back in 2018 and when all those sanctions were dealt with. It would be great to have a conversation with them and see where we are at,\" he added. Notably, Australia Test captain Pat Cummins has been a strong supporter of overturning the ban on Warner. \"I don't see why not. He's a brilliant leader. I hope so,\" Cummins said at the recent Chappell Foundation dinner at the SCG. Meanwhile, Smith, who was captain at Newlands in 2018, was given a two-year leadership ban and last year led Australia in the second Test against England in Adelaide when Cummins was ruled out due to being a Covid-19 close contact. However, regardless of whether he has a captaincy position in Australian cricket again, the 35-year-old Warner believes he can play a leadership role. (IANS) Also Read: BBL: David Warner set to sign with Sydney Thunder Also Watch: Guwahati Weather Stands at 35°C, Google Says It Feels Like 47°C","pubDate":"2022-08-22 05:19:01","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377148-david-warner.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Asia Cup returns to its original home","link":"https://www.sentinelassam.com/sports/cricket/asia-cup-returns-to-its-original-home-608600","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The Sharjah Cricket Stadium is ready to welcome the tournament once again when it hosts four key matches starting August 30.","content":"SHARJAH, Aug 20: The Sharjah Cricket Stadium played host to the inaugural Asia Cup in 1984 and it is ready to welcome the tournament once again when it hosts four key matches starting August 30. The iconic venue announced major refurbishments last year, including an all-new VIP hospitality experience comprising 11 VIP suites and a state-of-the-art Royal suite. As a founding member of the Asian Cricket Council , Abdul Rahman Bukhatir was instrumental in the initial success of this tournament and believes this was the first major step in the future ascendency of Asian teams in the cricketing hierarchy, not to mention Sharjah's reputation as a world-class cricketing venue and its inclusion in the Guinness World Records for hosting the maximum One-Day International matches at a single venue (245). After a gap of 11 years, the fifth Asia Cup was also hosted for the second time in Sharjah in 1995. India, Pakistan, Sri Lanka and Bangladesh took part in that edition with India winning its third straight and fourth overall Asia Cup. But Bukhatir and Sharjah have done so much more for Asian cricket than just play host. In 2010, he offered the stadium to the Afghanistan Cricket Board who at the time didn't have the required turf facilities. Thanks to this access to world-class facilities, they were able to hone their skills and become a full member of ACC and ICC. Over the years, Afghanistan has hosted Pakistan and Australia in bilateral games in Sharjah being their home venue, and it is a matter of great pride that they will be playing Bangladesh on August 30 in Sharjah. \"Come August 27, the 15th Asia Cup will take place in Sharjah and Dubai. It has been a very fruitful 40 years and I am delighted we are hosts again. The initiative begun in 1984 has paid off and I see it as one of my most satisfying achievements,\" said Bukhatir, the father of UAE cricket and founder of Sharjah Cricket Stadium. \"Life has really come full circle and we are so excited to be hosting the Asia Cup once again in 2022. Our stadium is globally renowned for breaking records, having the best fans and the most exciting finishes and I imagine this tournament will be no different. The stadium upgrades are complete and so is our team, so see you soon in Sharjah for another epic tournament,\" added Khalaf Bukhatir, CEO of Sharjah Cricket Stadium. The Asia Cup 2022 tournament will get underway in the UAE, hosted by Sri Lanka, from August 27. Defending champions India, Pakistan, Sri Lanka, Bangladesh and Afghanistan will be joined by a qualifier. The tournament will be played in a double round-robin and knockout format. India and Pakistan will be joined by the winner of the qualifying tournament in Group A, while Sri Lanka, Bangladesh and Afghanistan are slotted in Group B. A total of 13 matches will take place during the tournament with the final scheduled in Dubai on September 11. IANS Also Read : Assam: Police Nab Cachar College Principal For Violating Protocol During Grade III & Grade IV Exam Also Watch :","pubDate":"2022-08-22 05:17:42","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377144-sharjah.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"2026 Commonwealth Games: Shooting, archery, wrestling, judo apply for inclusion","link":"https://www.sentinelassam.com/sports-news/2026-commonwealth-games-shooting-archery-wrestling-judo-apply-for-inclusion-608598","keywords":["Sports"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"Applications have been received from shooting, wrestling, archery and 3x3 basketball among others to be included in the programme for the 2026 Commonwealth Games in Victoria State in Australia.","content":"MELBOURNE: Applications have been received from shooting, wrestling, archery and 3x3 basketball among others to be included in the programme for the 2026 Commonwealth Games in Victoria State in Australia. Among the other sports that have applied to be included in the \"three or four\" sports that are likely to be added to the 16 already shortlisted are judo, coastal rowing, beach rowing and taekwondo. Saturday was the last day to apply for being included in Victoria 2026 Commonwealth Games. The organising committee had initially proposed 16 regular sports and six para-sports to be part of the Games. Aquatics, athletics , badminton, boxing, beach volleyball, T20 cricket, cycling, gymnastics, hockey, lawn bowls, netball, rugby sevens, squash, table tennis, triathlon and weightlifting are the 16 sports already on the programme. Six Para sports -- athletics, swimming, lawn bowls, triathlon, table tennis and powerlifting -- are also due to be contested. Competitions will be held in four regional centres Geelong, Bendigo, Ballarat and Gippsland besides Melbourne Cricket Ground, which will host the opening and closing ceremonies. While shooting and archery were left out for the just-concluded Commonwealth Games in Birmingham. Judo, 3x3 basketball and wrestling all appeared at Birmingham 2022 but have not yet been confirmed for Victoria. Following a huge furore over the exclusion of shooting, both in Australia and countries like India, Victoria 2026 chief executive Jeroen Weimar had a few weeks back informed that \"three or four\" more sports are likely to be added. Meanwhile, shootings got a boost for their inclusion after Shooting Australia proposed the Wellsford Rifle Range near Melbourne, which hosted full-bore rifle events of Melbourne 2006 Commonwealth Games, and the Victorian State Range at Echucha, 81 kilometres from Bendigo as possible venues that could be refurbished for the CWG. (IANS) Also Read: Assam Rifles felicitates Commonwealth Games gold medalist Naib Subedar Jeremy Lalrinnunga Also Watch: Assam: Major Boost For War Against Drugs, Cops Seize Huge Drugs Consignment","pubDate":"2022-08-22 05:07:56","image_url":"https://assets.sentinelassam.com/h-upload/2022/08/22/377136-commonwealth-games.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"ZIM vs IND Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of Zimbabwe, 3rd ODI - Cricket Addictor","link":"https://news.google.com/__i/rss/rd/articles/CBMisQFodHRwczovL2NyaWNrZXRhZGRpY3Rvci5jb20vZmFudGFzeS1jcmlja2V0L3ppbS12cy1pbmQtZHJlYW0xMS1wcmVkaWN0aW9uLWZhbnRhc3ktY3JpY2tldC10aXBzLWRyZWFtMTEtdGVhbS1wbGF5aW5nLXhpLXBpdGNoLXJlcG9ydC1pbmp1cnktdXBkYXRlLWluZGlhLXRvdXItb2YtemltYmFid2UtM3JkLW9kaS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ZIM vs IND Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- India Tour of Zimbabwe, 3rd ODI  Cricket AddictorMatch Preview - Zimbabwe vs India, India in Zimbabwe 2022, 3rd ODI  ESPNcricinfoZimbabwe vs India 3rd ODI Livestream Details: When and where to watch IND vs ZIM, cricket schedule, TV timi...  Zee NewsIND vs ZIM: India's Predicted Playing XI Against Zimbabwe, 3rd ODI  Cricket AddictorMatch preview: Clean sweep on cards for India against weak Zimbabwe  OrissaPOSTView Full coverage on Google News","content":null,"pubDate":"2022-08-22 05:01:32","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Recent Match Report - West Indies vs New Zealand 3rd ODI 2022 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiiAFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9uZXctemVhbGFuZC10b3VyLW9mLXdlc3QtaW5kaWVzLTIwMjItMTMxNzg4OC93ZXN0LWluZGllcy12cy1uZXctemVhbGFuZC0zcmQtb2RpLTEzMTc5MTMvbWF0Y2gtcmVwb3J00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - West Indies vs New Zealand 3rd ODI 2022  ESPNcricinfoWI vs NZ Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- New Zealand Tour of West Indies, 3rd ODI  Cricket AddictorWI vs NZ: Batters power New Zealand to maiden ODI series win in West Indies  India TodayWest Indies vs New Zealand: Kyle Mayers ton in vain as Kiwis clinch ODI series - Firstpost  FirstpostWI vs NZ Highlights: Latham, Mitchell stars as NewZealand chase 302 to clinch series 2-1: Watch NZ beat WI 3RD ODI Highlights  InsideSportView Full coverage on Google News","content":null,"pubDate":"2022-08-22 04:37:31","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Tim Paine, former Australian cricket captain, back in training in hopes to join Tasmanian Premier League - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA4LTIyL3RpbS1wYWluZS1tYWtlcy1yZXR1cm4tdG8tY3JpY2tldC1pbi10YXNtYW5pYS8xMDEzNTYyNjbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tim Paine, former Australian cricket captain, back in training in hopes to join Tasmanian Premier League  ABC NewsTim Paine set for shock cricket return as secret comeback bid revealed  Fox SportsFormer Australian Test captain Tim Paine set for comeback after training with home state Tasmania  The West AustralianFormer Australia skipper Paine back in training in Tasmania  ReutersTim Paine's return to first-class cricket confirmed  SENView Full coverage on Google News","content":null,"pubDate":"2022-08-22 04:28:22","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: David Warner’s Big Bash signing could be the kickstart the competition needs","link":"https://www.perthnow.com.au/sport/cricket-david-warners-big-bash-signing-could-be-the-kickstart-the-competition-needs-c-7963632","keywords":null,"creator":["Russell Gould"],"video_url":null,"description":"David Warner’s addition to the Big Bash is already creating the buzz cricket officials hoped for.","content":"David Warner’s new Sydney Thunder teammates are already buzzing at the prospect of the batting star joining them for the Big Bash fully confident his commitment will extend beyond just showing up for games. The veteran Australian opener declared it was “important to give back for the future of our game” as he signed a landmark two-year contract . He should be available for games at the back end of this season. Young gun Ollie Davies has experienced playing one-day cricket with Warner for NSW and said he was all in when he made those fleeting state appearances and couldn’t wait to link up with him again in the Big Bash. “During the 2021 pandemic sort of pre-season, I trained with him a fair bit, so I got to know him well then and then played, I think, three March Cup games together,” Davies said on Monday. “It’s been hard. I haven’t sort of seen him for probably close to a year now, so I haven’t spoken to him for a while, but I’m hoping that when he comes back in I’ll be able to hopefully build a relationship there and learn a lot off him. “I think it is from January onwards that he’ll be able to play for us. It’s really exciting. We only just found out the news. There was talk previously that he might be coming around, but to get locked in is pretty exciting. He’s a class player and hopefully I get to learn off him a lot and, better than that, play with him.” Davies said he expected Warner would do more than just turn up to games despite a hectic international summer of Test cricket, which will make him unavailable for most of this year’s tournament. “I know that he definitely did that when he was playing for the (NSW) Blues and the Marsh Cup,” he said. “And in comparison to that, I think the Big Bash is on a bit of a higher profile at the moment than the Marsh Cup, so I’m hoping that that will be the case because he showed up for all the Blues stuff. “I’m just really excited to have heard the news over the last couple of days and then to get it all locked in. It’s pretty exciting.” Warner’s Australian Test teammate, Alex Carey, who expressed his ongoing commitment to the Big Bash with the Adelaide Strikers despite his increased international appearances, said it was “huge” to have the opener in the competition. “At the back end of a tough couple of years, it‘s really exciting. Obviously, David Warner’s huge for the comp,” he said. Warner has also expressed his desire to be a leader for Thunder’s young stars, including Davies, with team officials asking Cricket Australia officials for urgent clarification over the future of his captaincy ban.","pubDate":"2022-08-22 04:11:19","image_url":"https://images.perthnow.com.au/publication/C-7963632/385209a20325d79287eabe99d9a5df46afc7bec2-16x9-x0y192w2048h1152.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"IND Vs ZIM 3rd ODI: Predicted Playing XI, Timing, and Pitch Report","link":"https://www.business-standard.com/article/sports/ind-vs-zim-3rd-odi-predicted-playing-xi-timing-and-pitch-report-122082200145_1.html","keywords":null,"creator":null,"video_url":null,"description":"India Cricket team to eye for another clean sweep as they face Zimbabwe in the final match of the One Day International series at Harare Sports Club. Read this article to know everything","content":null,"pubDate":"2022-08-22 04:09:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220822/thumb-122082200145.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Ex-Test skipper Paine eyes cricket return","link":"https://www.perthnow.com.au/sport/cricket/ex-test-skipper-paine-eyes-cricket-return-c-7963152","keywords":null,"creator":["Steve Larkin"],"video_url":null,"description":"Former Australian Test captain Tim Paine is returning to training in Tasmania as he eyes a comeback to cricket.","content":"Tim Paine could be back playing in Tasmania in six weeks as Australia's former Test captain prepares for his cricket comeback. Paine is training with Tasmania's state squad as an uncontracted player as he plots a return for the first time since losing the Test captaincy in a sexting controversy. The 37-year-old took time away from the sport after standing down as Test skipper in November last year. Paine never retired but wasn't contracted on Tasmania's playing roster for this summer. But Cricket Tasmania say Paine is back in training. Tasmania's first outing this summer is a one-dayer on September 28 against South Australia but Paine is aiming to return in club ranks. Cricket Tasmania's grade competition, the Premier League, starts in early October. Tasmania's opening Sheffield Shield game begins on October 6. \"We can confirm that Tim has returned to training with the aim at this stage to play in the CTPL this season,\" a Cricket Tasmania spokesperson said. The governing body declined further comment but Paine has another powerful ally in fellow Tasmanian and ex-Test skipper Ricky Ponting. Ponting, recently appointed as head of strategy for Hobart Hurricanes, has openly stated his desire for Paine to again play for the BBL franchise. Paine quit the Test captaincy after admitting involvement in a lewd text exchange with a female former employee of Cricket Tasmania in late 2017. Cricket Australia secretly investigated at the time and exonerated Paine of wrongdoing, but he stepped down on the eve of last year's Ashes series when made aware the text exchange would become public. Paine's successor as Test captain, Pat Cummins, said the wicketkeeper hasn't been forgotten. \"Someone like Painey, firstly as a mate you want to make sure he's okay. \"We all make mistakes,\" Cummins said last week. \"He did the wrong thing but he tried to fix the situation as best as he could ... I really feel for him.\"","pubDate":"2022-08-22 03:42:33","image_url":"https://images.perthnow.com.au/publication/C-7963152/d447d97466bf9a16486e7a09d5613d7dbf889af1-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"This is what Pakistan ex-cricketer Shahid Afridi replied to a fan's question on Virat Kohli's future","link":"https://www.tribuneindia.com/news/sports/this-is-what-pakistan-ex-cricketer-shahid-afridi-replied-to-a-fans-question-on-virat-kohlis-future-424155","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, August 22 Cricket fans are eagerly waiting for the face-off on Sunday in Dubai in which arch-rivals India and Pakistan will lock horns at the Asia Cup 2022. It will be after T20 world cup clash that both the team would face each other. And as Virat Kohli return to play after a long break, all eyes will be on him and his performance after he came under the scanner for the fall in his form. On Kohli's comeback, former Pakistan cricketer Shahid Afridi said: \"It's in his own hands.\" It was in a question-answer session on Twitter, the former Pakistan captain was asked about Virat's future in the game. Afridi replies, \"It's in his own hands.\" #AskLalaWhat about Virat's future — 𝗦𝗢𝗛𝗔𝗠 (@Only17Matters) August 21, 2022 Virat Kholi Didn't get a century from 1000+ Days. What's your views on it?#AskLala @SAfridiOfficial 🔥 — Huzaifa Butt (@HuzaifaAfridian) August 21, 2022 The last time when India played Pakistan in Dubai, he top-scored with a 49-ball 57.","content":null,"pubDate":"2022-08-22 03:38:34","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_2090498401.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"UAE vs Singapore, Asia Cup Qualifiers: Where To Watch Live Streaming?","link":"https://sports.ndtv.com/cricket/uae-vs-singapore-asia-cup-qualifiers-when-and-where-to-watch-live-telecast-live-streaming-3274363","keywords":null,"creator":null,"video_url":null,"description":"UAE and Singapore will be squaring off against each other in Match 3 of the Asia Cup qualifiers on Monday at Al Amerat Cricket Ground, Oman","content":null,"pubDate":"2022-08-22 03:17:45","image_url":"https://c.ndtvimg.com/2020-11/h6i1pnfg_cricket-bat-ball-afp_625x300_20_November_20.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"3rd ODI: Pakistan secured 9-run win against Netherlands, clinch series 3-0","link":"https://www.business-standard.com/article/sports/3rd-odi-pakistan-secured-9-run-win-against-netherlands-clinch-series-3-0-122082200007_1.html","keywords":null,"creator":null,"video_url":null,"description":"Despite the 0-3 loss, the Netherlands showcased fight and played some exemplary cricket right through the series","content":"The Netherlands produced a compelling performance to come close to beating Pakistan in the third and final ODI but the visitors held their nerve to win by nine runs and clinch the series 3-0, here on Sunday. Despite the 0-3 loss, the Netherlands showcased fight and played some exemplary cricket right through the series. After winning the toss and opting to bat first, Pakistan didn't have a great start as the Netherlands' bowlers impressed with the new ball. Vivian Kingma prized out debutant Abdullah Shafique in the second over of the innings. Fakhar Zaman and Babar Azam then rebuilt for Pakistan. However, the Netherlands managed to find a breakthrough when Logan van Beek cleaned up Zaman (26) in the 18th over. Agha Salman gave Babar fine company as the skipper completed his ninth fifty-plus score in his last 10 innings. Pakistan lost three wickets in quick succession in the middle overs as the Netherlands made a strong comeback. Salman, Khushdil Shah and Mohammad Haris were dismissed in the space of 31 runs. Babar continued edging close to a hundred, but he couldn't eventually get there as a stunning return catch from Aryan Dutt ended his knock, nine short of a ton. Pakistan were eventually bowled out for 206 in 49.4 overs. In reply, the Netherlands too had a poor start. Naseem Shah continued to make a strong impression on the tour as he sent back Max O'Dowd and Musa Ahmed inside the first 10 overs to give Pakistan a rousing start. The 19-year-old speedster was in fine rhythm and finished his first spell with figures of 5-0-14-2. He returned later at a crucial point in the game to clean up skipper Scott Edwards and added another wicket, that of Teja Nidamanuru, later to break a threatening half-century stand. Naseem finished with career-best figures of 5 for 33, bringing Pakistan back into the contest every time he came on with the ball. Naseem was ably supported by Mohammad Wasim, who picked up the big wickets of Vikramjit Singh and Tom Cooper to finish with a four-wicket haul. However, the host didn't give up that easily. Led by opener Vikramjit and in-form Cooper, the Netherlands pushed Pakistan in the run chase. Vikramjit completed his second half-century in the series while Cooper made it three fifties in three outings. But, neither innings was quite enough to give the Netherlands the final push needed for a win. While Vikramjit's innings came to an end on 50 as he nicked Wasim to the wicketkeeper, Cooper kept the Netherlands in the hunt until late in the run chase, only to miscue a slog off the same bowler in the 46th over to be dismissed for 62. The Netherlands' tail pulled them close to the target, but they eventually were bowled out for 197-10 in 49.2 overs and couldn't cross the final hurdle. Brief scores: Pakistan 206 in 49.4 overs (Babar Azam 91, Mohammad Nawaz 27; Bas de Leede 3-50, Vivian Kingma 2-15) beat Netherlands 197 in 49.2 overs (Tom Cooper 62, Vikramjit Singh 50; Naseem Shah 5-33, Mohammad Wasim Jr. 4-36) by 9 runs. --IANS avn/bsk (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-08-22 02:39:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220822/thumb-122082200007.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ZIM Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND vs ZIM 3rd ODI at Harare, 1245 PM IST, August 22","link":"https://zeenews.india.com/cricket/ind-vs-zim-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-vs-zim-3rd-odi-at-harare-1245-pm-ist-august-22-2499967.html","keywords":null,"creator":null,"video_url":null,"description":"India vs Zimbabwe Dream11 Team Prediction India vs Zimbabwe 3rd ODI match - Check My Dream11 Team, Best players list of IND vs ZIM, India Dream11 Team Player List, Zimbabwe Africa Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"When India takes to the field during the third and final ODI against Zimbabwe in Harare, a clean sweep will be on their minds, while for Zimbabwe the focus will be on presenting a good challenge to the visitors and walking away with a consolation victory. The final ODI between both sides will be played in Harare on Monday (August 22). India has an unassailable 2-0 lead in the series after winning the first two matches by ten and five wickets respectively. For India, eyes will be once again on the opening duo of Shikhar Dhawan and KL Rahul. Shikhar has displayed solid form in ODIs this year and one more solid knock is all he needs to stay in contention for ICC Cricket World Cup 2023 contention before another opportunity knocks on his doors again. On the other hand, KL will be aiming to get among runs as he gears up for Asia Cup 2022. Ending another tour on high will be in the mind of Shubman Gill. Ever since getting a chance to play on a tour of the West Indies, Gill has not disappointed with the bat. Another good inning will seal his position as a trustworthy backup opener or even a regular opener for Team India. Rahul Tripathi and all-rounder Shahbaz Ahmed will also be hoping to get their maiden Indian caps and make the most of it after delivering good performances in IPL. India’s bowling has been brilliant on this tour with nothing to complain about. Spinner Axar Patel sits at the top of the bowling charts with four wickets. It will be another opportunity for him to prove his worth. Pacers like Mohammed Siraj, Prasidh Krishna and Shardul Thakur will also be eyeing one more good performance to end the tour on a high. On the other hand, Zimbabwe has a lot of mess that they would be looking forward to solving. Their batting has been subpar in both matches. The side could not even cross the 200-run mark. Openers Innocent Kaia and Takudzwanashe Kaitano will have to deliver a positive and steady start to set the foundation for a better total. Sikandar Raza, Ryan Burl and captain Regis Chakabva will also have to lend support to openers as batters. Match Details India vs Zimbabwe, 3rd ODI Venue: Harare Sports Club, Harare Date & Time: August 22 at 1245 PM IST Live Streaming and TV details: Sony Sports Network and SonyLIV website and app IND vs ZIM 3rd ODI Dream11 Prediction Wicketkeeper: Sanju Samson Batters: KL Rahul, Shubman Gill, Ryan Burl, Rahul Tripathi All-rounders: Sikandar Raza, Deepak Hooda, Sean Williams Bowlers: Deepak Chahar, Luke Jongwe, Shardul Thakur Captain: Shubman Gill Vice-captain: Deepak Chahar IND vs ZIM 3rd ODI Predicted 11 India: KL Rahul (c), Ruturaj Gaikwad, Shubaman Gill, Rahul Tripathi, Sanju Samson (wk), Deepak Hooda, Shahbaz Ahmed, Shardul Thakur, Deepak Chahar, Avesh Khan, Kuldeep Yadav. Zimbabwe: Takudzwanashe Kaitano, Innocent Kaia, Milton Shumba, Sean Williams, Sikandar Raza, Regis Chakabva (c & wk), Ryan Burl, Luke Jongwe, Brad Evans, Victor Nyauchi, Tanaka Chivanga.","pubDate":"2022-08-22 02:38:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Tim Paine's staggering return to cricket after sexting scandal","link":"https://au.sports.yahoo.com/cricket-2022-tim-piane-staggering-return-sexting-scandal-015207513.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-08-22 01:52:07","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-08/27730110-21bc-11ed-9d99-4ed01b7dcb6e","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Zimbabwe vs India 3rd ODI Livestream Details: When and where to watch IND vs ZIM, cricket schedule, TV timing in India","link":"https://zeenews.india.com/cricket/zimbabwe-vs-india-3rd-odi-livestream-details-when-and-where-to-watch-ind-vs-zim-cricket-schedule-tv-timing-in-india-2499948.html","keywords":null,"creator":null,"video_url":null,"description":"Regis Chakabva’s Zimbabwe will take on KL Rahul-led Team India in the third and final ODI match in Harare on Monday (August 22). India lead series 2-0.","content":"A fancied Indian team is a shoo-in to complete a 3-0 ODI series sweep against a Zimbabwe side that has been struggling to put up even a semblance of a fight. Having done exceedingly well to not just turn up but trump their hapless opponents on all fronts in the preceding two matches, India will enter the third and final ODI knowing well that the script is unlikely to change at the Harare Sports Complex on Monday (August 22). This will translate to the visiting team getting yet another opportunity to carry out experimentation keeping the bigger picture in mind -- next year’s ICC 50-over World Cup. Stand-in skipper KL Rahul has done quite well to keep the players motivated enough to go out in the middle, grab the chances with both hands, and cement their places in the side that is gearing up for big battles in the coming times. India win by 5 wickets and go 2-up in the 3-match series! Match summary #ZIMvIND | #KajariaODISeries | #VisitZimbabwe pic.twitter.com/Nh7EST9JLq — Zimbabwe Cricket (@ZimCricketv) August 20, 2022 There is no doubt that they have not faced the kind of examination that would have helped them develop further as cricketers, but those who are looking to get a longer run at the top level would certainly not mind the experience. If the 161 all out in the second game is any evidence, the home team continues to look for a quick fix to its batting woes, while the bowlers are also not able to trouble the Indian batting line-up that has some of the top ODI players in its ranks. For proof, one can take a look at Shikhar Dhawan’s statistics in the 50-over format. The extremely talented Shubhman Gill should not be content with whatever he has achieved so far on the tour, and will certainly look to have another go at the Zimbabwe bowlers. The move to promote himself up the order did not work in the second match but that will not deter Rahul from trying it out one more time. His stay at the crease in the second ODI lasted just nine balls as he could score just one run off five balls. In the absence of the front-line bowlers, this attack has performed extremely well and showed what it is capable of, and the quality of opposition is no reason to undermine the efforts of committed people like Deepak Chahar, Mohammed Siraj, Shardul Thakur, Prasidh Krishna and Axar Patel. Among the batters, Ishan Kishan, if he gets another chance to bat, will look to overcome the failure of the second game with a good knock. Match Details When will the India vs Zimbabwe 3rd ODI match be played? The India vs Zimbabwe 3rd ODI match will be played on Monday (August 22). Where will the India vs Zimbabwe 3rd ODI match be played? The India vs Zimbabwe 3rd ODI match will be played at the Harare Sports Club. What time will the India vs Zimbabwe 3rd ODI match start? The India vs Zimbabwe 3rd ODI match will start at 1245 PM IST. How can I watch India vs Zimbabwe 3rd ODI match on TV in India? The India vs Zimbabwe 3rd ODI match will be available on Sony Sports Network in India. How can I follow the live streaming of the India vs Zimbabwe 3rd ODI match? The India vs Zimbabwe 3rd ODI match will be streamed live on SonyLiv website and app.","pubDate":"2022-08-22 01:46:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Tim Paine set for shock cricket return as secret comeback bid revealed - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMisAFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2NyaWNrZXQtYXVzdHJhbGlhLTIwMjItbmV3cy10aW0tcGFpbmUtc2V0LWZvci1zaGVmZmllbGQtc2hpZWxkLWNvbWViYWNrLXdpdGgtdGFzbWFuaWEvbmV3cy1zdG9yeS8yNTY5NmNiN2EyYzZiYTM4OWQ4ODQwZTAwMzc5YTUwNdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Tim Paine set for shock cricket return as secret comeback bid revealed  Fox SportsFormer Australian Test captain Tim Paine set for comeback after training with home state Tasmania  The West AustralianTim Paine's return to first-class cricket confirmed  SENFormer Australia skipper Paine back in training in Tasmania  ReutersTim Paine, former Australian cricket captain, back in training in hopes to join Tasmanian Premier League  ABC NewsView Full coverage on Google News","content":null,"pubDate":"2022-08-22 00:47:00","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Priyank Panchal likely to lead in 4-day games against New Zealand A","link":"https://www.tribuneindia.com/news/sports/panchal-likely-to-lead-in-4-day-games-against-new-zealand-a-424059","keywords":null,"creator":null,"video_url":null,"description":"New Delhi Gujarat opener Priyank Panchal is likely to lead India A in three four-day games against New Zealand A, beginning in Bengaluru from September 1. It is also learnt that former India captain Ajinkya Rahane's comeback to competitive cricket will happen in Duleep Trophy. New Delhi Mirabai, Jeremy, Achinta to skip Asian Championship Olympics silver medallist Mirabai Chanu and seven other top Indian weightlifters will fly to the USA on Tuesday for a three-and-half-week strength and conditioning training camp. Chanu will be accompanied by 2022 Commonwealth Games medallists Jeremy Lalrinnunga, Achinta Sheuli, Sanket Sargar, Bindyarani Devi, Gurdeep Singh and former 2018 CWG champion RV Rahul and Asian Championship gold medallist Jhilli Dalabehra. Meanwhile, the senior weightlifters will miss this year's Asian Championships, opting to focus on the World meet instead, which is a qualifying event for the Paris Olympics. The Asian Championships are scheduled to take place in Manama, Bahrain from October 6 to 16. Guwahati Army Green beat NorthEast United 3-1 Skipper PC Lallawmkima scored a brace as Army Green made a winning start to their Durand Cup campaign by inflicting a 3-1 defeat on NorthEast United FC. New Delhi Chain wins rifle prone T5 title at shooting trials Seasoned shooter Chain Singh won the men's 50m rifle prone T5 title while Olympics medallist Vijay Kumar finished third in the 25m rapid fire pistol T5 at the national shooting selection trials. — Agencies","content":"New Delhi Gujarat opener Priyank Panchal is likely to lead India A in three four-day games against New Zealand A, beginning in Bengaluru from September 1. It is also learnt that former India captain Ajinkya Rahane’s comeback to competitive cricket will happen in Duleep Trophy. New Delhi Mirabai, Jeremy, Achinta to skip Asian Championship Olympics silver medallist Mirabai Chanu and seven other top Indian weightlifters will fly to the USA on Tuesday for a three-and-half-week strength and conditioning training camp. Chanu will be accompanied by 2022 Commonwealth Games medallists Jeremy Lalrinnunga, Achinta Sheuli, Sanket Sargar, Bindyarani Devi, Gurdeep Singh and former 2018 CWG champion RV Rahul and Asian Championship gold medallist Jhilli Dalabehra. Meanwhile, the senior weightlifters will miss this year’s Asian Championships, opting to focus on the World meet instead, which is a qualifying event for the Paris Olympics. The Asian Championships are scheduled to take place in Manama, Bahrain from October 6 to 16. Guwahati Army Green beat NorthEast United 3-1 Skipper PC Lallawmkima scored a brace as Army Green made a winning start to their Durand Cup campaign by inflicting a 3-1 defeat on NorthEast United FC. New Delhi Chain wins rifle prone T5 title at shooting trials Seasoned shooter Chain Singh won the men’s 50m rifle prone T5 title while Olympics medallist Vijay Kumar finished third in the 25m rapid fire pistol T5 at the national shooting selection trials. — Agencies","pubDate":"2022-08-22 00:38:36","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_1126949095.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"}]}