{"newsArray":[{"title":"Pedestrian struck, cop car hit in wild car chase across Adelaide","link":"https://www.perthnow.com.au/news/pedestrian-struck-cop-car-hit-in-wild-car-chase-across-adelaide-c-6658394","keywords":null,"creator":["Holly Hales"],"video_url":null,"description":"The moment a suburban cricket match was interrupted by a wild car chase in Adelaide has been captured in incredible footage.","content":null,"pubDate":"2022-05-02 23:48:07","full_description":"Innocent bystanders were struck by an out-of-control stolen car after its driver allegedly took part in a wild pursuit that included a dash across a cricket pitch, police say. The chase happened in Adelaide on Sunday after the red Holden Commodore’s owner spotted his car being driven in Largs Bay at about 3.20pm. Shortly after, the owner approached the thieves and was allegedly threatened by a person in the car who was holding an axe before driving off. Police joined the pursuit which carried on across the backstreets of North Adelaide. The car allegedly crashed into two people before hitting a police car on the corner of Barton Terrace West. The vehicle soon ploughed through parklands and onto a cricket pitch where a match was underway, according to player Kuldeep Dhungana. “The car was coming straight to us but luckily the driver changed the direction,” he told Nine News. “It could have easily been a lot worse because the speed that car was going was really huge, even a small collision could be life-threatening.” No one was injured in any of the crashes. The vehicle was found abandoned a short time later at Bowden, with its two occupants swiftly arrested by police. A 29-year-old Parkside man and a Para Hills West man, 26, were arrested and are expected to be charged with a string of offences.","image_url":"https://images.perthnow.com.au/publication/C-6658394/ca333252af14fa2d695f18749d73be86f9cc0492-16x9-x226y0w1447h814.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"KKR cruise to seven wicket win despite Finch failure","link":"https://www.cairnspost.com.au/sport/cricket/kkr-cruise-to-seven-wicket-win-despite-finch-failure/video/50c56162f769fcd8be57c97e47f9db0c","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Despite another single figure outing for Aaron Finch, the Kolkata Knight Riders have recorded a seven wicket win over the Rajasthan Royals.","content":null,"pubDate":"2022-05-02 22:27:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Wide rules in cricket: Was it a wide ball in cricket match between KKR and RR in 2022 IPL?","link":"https://thesportsrush.com/cricket-news-wide-rules-in-cricket-was-it-a-wide-ball-in-cricket-match-between-kkr-and-rr-in-2022-ipl/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Indian Premier League","IPL","Kolkata Knight riders","rajasthan royals","RR"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Wide rules in cricket: There was quite some confusion during the penultimate Over of the match with Wide calls seeming harsh for the RR camp. During the 47th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, the Kolkata Knight Riders (KKR) defeated the Rajasthan Royals (RR) by… The post Wide rules in cricket: Was it a wide ball in cricket match between KKR and RR in 2022 IPL? appeared first on The SportsRush.","content":"Wide rules in cricket: There was quite some confusion during the penultimate Over of the match with Wide calls seeming harsh for the RR camp. During the 47th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, the Kolkata Knight Riders (KKR) defeated the Rajasthan Royals (RR) by 7 wickets, as the former get another small lease of life going further into the tournament. Chasing the target of 153 handed by RR, Kolkata got off to yet another poor start provided by their yet another set of openers – Aaron Finch (4 off 7) and Baba Indrajith (15 off 16), with both returning back within the Powerplay. However, a couple of match-saving partnerships, first between Shreyas Iyer (34 off 32) and Nitish Rana (48* off 37) for the third wicket (comprising 60 runs) and then between Rana and Rinku Singh (42* off 23) for the fourth wicket (comprising 66 runs), meant that KKR managed to get over the line, and finally end their five-match losing streak in the season. However, during the 19th Over of the chase being bowled by Prasidh Krishna, RR’s skipper cum wicket-keeper Sanju Samson was visibly unhappy with umpire Nitin Pandit on at least a couple of occasions, after the latter adjudged a couple of deliveries as ‘Wide’ with 18 runs required of the final two Overs. Was it a wide ball adjudged by Nitin Pandit during the 19th Over bowled by Prasidh Krishna? It all began on the third delivery of the Over, Krishna fired a wide delivery outside the off-stump to which the umpire ruled the delivery as ‘Wide’. Although the batter Rinku Singh did move a bit outside the off-stump, it was a marginal and perhaps a fair call. However, one delivery later, Krishna bowled a short delivery outside the ‘Wide’ dictating line, to which Rinku shuffled quite far across, only for umpire Pandit to again signal it a ‘Wide’. The shuffle by Rinku was quite far across, and Samson from behind the stumps was rightly annoyed with the umpire, and perhaps in fit of anger and desperation went for a caught dismissal DRS, but to no avail. Again, on the final delivery of the Over, the bowler bowled a delivery way outside the Wide line, after Rinku shuffled yet again. This time too, the batter went almost towards the ninth or the tenth stump from his striking guard, as he failed to connect the ball by a whisker. The umpire, yet again, took no breather whatsoever, to rule it a ‘Wide’ for the third time, as a livid Sanju also fumbled to let the batters sneak in a Bye. The RR skipper had a brief chat with the umpire, but again leading to no affirmative action. Is it wide ball?? #IPL2022 #IPL #IPL20222 #KKRvRR @IamSanjuSamsonnot was upset with the decision… Funny thing is he took #drs for wide ball.. First time I guess.. Any idea pic.twitter.com/bpc2QY8BKz — I m sum!t (@sumitganguly191) May 2, 2022 Wide rules in cricket As per MCC’s Law 22.1 under the head ‘Judging a Wide’, law 22.1.1 states – If the bowler bowls a ball, not being a No ball, the umpire shall adjudge it a Wide if, according to the definition in 22.1.2, the ball passes wide of where the striker is standing and which also would have passed wide of the striker standing in a normal guard position. Law 22.1.2 states that – The ball will be considered as passing wide of the striker unless it is sufficiently within reach for him/her to be able to hit it with the bat by means of a normal cricket stroke. As per the aforementioned rules, the final two ‘Wides’ seemed to be harsh on RR, more so given the stage at the which the match was in. Having said that, it all boils down to the discretion of the Umpire, who has the final say.     The post Wide rules in cricket: Was it a wide ball in cricket match between KKR and RR in 2022 IPL? appeared first on The SportsRush.","pubDate":"2022-05-02 19:19:50","full_description":"Wide rules in cricket: There was quite some confusion during the penultimate Over of the match with Wide calls seeming harsh for the RR camp. During the 47th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, the Kolkata Knight Riders (KKR) defeated the Rajasthan Royals (RR) by 7 wickets, as the former get another small lease of life going further into the tournament. Chasing the target of 153 handed by RR, Kolkata got off to yet another poor start provided by their yet another set of openers – Aaron Finch (4 off 7) and Baba Indrajith (15 off 16), with both returning back within the Powerplay. However, a couple of match-saving partnerships, first between Shreyas Iyer (34 off 32) and Nitish Rana (48* off 37) for the third wicket (comprising 60 runs) and then between Rana and Rinku Singh (42* off 23) for the fourth wicket (comprising 66 runs), meant that KKR managed to get over the line, and finally end their five-match losing streak in the season. However, during the 19th Over of the chase being bowled by Prasidh Krishna, RR’s skipper cum wicket-keeper Sanju Samson was visibly unhappy with umpire Nitin Pandit on at least a couple of occasions, after the latter adjudged a couple of deliveries as ‘Wide’ with 18 runs required of the final two Overs. It all began on the third delivery of the Over, Krishna fired a wide delivery outside the off-stump to which the umpire ruled the delivery as ‘Wide’. Although the batter Rinku Singh did move a bit outside the off-stump, it was a marginal and perhaps a fair call. However, one delivery later, Krishna bowled a short delivery outside the ‘Wide’ dictating line, to which Rinku shuffled quite far across, only for umpire Pandit to again signal it a ‘Wide’. The shuffle by Rinku was quite far across, and Samson from behind the stumps was rightly annoyed with the umpire, and perhaps in fit of anger and desperation went for a caught dismissal DRS, but to no avail. Again, on the final delivery of the Over, the bowler bowled a delivery way outside the Wide line, after Rinku shuffled yet again. This time too, the batter went almost towards the ninth or the tenth stump from his striking guard, as he failed to connect the ball by a whisker. The umpire, yet again, took no breather whatsoever, to rule it a ‘Wide’ for the third time, as a livid Sanju also fumbled to let the batters sneak in a Bye. The RR skipper had a brief chat with the umpire, but again leading to no affirmative action. Is it wide ball?? #IPL2022 #IPL #IPL20222 #KKRvRR @IamSanjuSamsonnot was upset with the decision… Funny thing is he took #drs for wide ball.. First time I guess.. Any idea 💡💡 pic.twitter.com/bpc2QY8BKz — I m sum!t (@sumitganguly191) May 2, 2022 As per MCC’s Law 22.1 under the head ‘Judging a Wide’, law 22.1.1 states – If the bowler bowls a ball, not being a No ball, the umpire shall adjudge it a Wide if, according to the definition in 22.1.2, the ball passes wide of where the striker is standing and which also would have passed wide of the striker standing in a normal guard position. Law 22.1.2 states that – The ball will be considered as passing wide of the striker unless it is sufficiently within reach for him/her to be able to hit it with the bat by means of a normal cricket stroke. As per the aforementioned rules, the final two ‘Wides’ seemed to be harsh on RR, more so given the stage at the which the match was in. Having said that, it all boils down to the discretion of the Umpire, who has the final say.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Rinku Singh KKR IPL salary: Rinku Singh net worth","link":"https://thesportsrush.com/cricket-news-rinku-singh-kkr-ipl-salary-rinku-singh-net-worth/","keywords":["Cricket","IPL 2022","KKR","Indian Premier League","IPL","Kolkata Knight riders","Rinku Singh"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Rinku Singh KKR IPL salary: The 24-year-old played a crucial knock under pressure to take his side home in a must- win match. During the 47th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, the Kolkata Knight Riders (KKR) defeated the Rajasthan Royals (RR) by 7… The post Rinku Singh KKR IPL salary: Rinku Singh net worth appeared first on The SportsRush.","content":"Rinku Singh KKR IPL salary: The 24-year-old played a crucial knock under pressure to take his side home in a must- win match. During the 47th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, the Kolkata Knight Riders (KKR) defeated the Rajasthan Royals (RR) by 7 wickets, to end their five-match losing streak and still remain in contention, although by a whisker, in the race towards the playoffs. En route the target of 153 runs handed by the Sanju Samson-led side, KKR, with the help of some sensible, patient batting by their skipper Shreyas Iyer (34 off 32), Nitish Rana (48* off 37), and Rinku Singh (42* off 23), managed to get over the line with five deliveries to spare. After yet another poor start provided by the KKR openers, Iyer and Rana collaborated together while putting on a 60-run stand for the 3rd wicket off 43 deliveries, to bring their side back into the chase. However, with Iyer’s departure during the 13th Over, it was the match-winning partnership of 66 runs between Rana and Rinku Singh, that guided them towards a much-needed victory. Rinku, with his aggressive knock at a strike rate of 182.61, and with the assistance of 6 Fours and a Six, was the one who upped the ante during the final phase of the innings, and was thus fittingly awarded the ‘Player of the Match’ award. There is a beautiful story everyday in the #TATAIPL. Today was Rinku Singh putting Aligarh on the cricket map. Was so incredibly cool at the end — Harsha Bhogle (@bhogleharsha) May 2, 2022 Rinku Singh KKR IPL salary Rinku Singh was roped in by the KKR at the bidding amount of INR 55 Lakh during the mega auction, after offering his services at a base price of INR 20 Lakh. The left-handed batter from Uttar Pradesh, in fact, has been a part of the KKR since the 2018 edition of the IPL. There is no official report confirming on the net worth of the Southpaw batter. However, after being bought by KKR at INR 80 lakh during the 2018 auction, Rinku’s net worth is in excess of at least a Crore rupees as of the year 2021. The post Rinku Singh KKR IPL salary: Rinku Singh net worth appeared first on The SportsRush.","pubDate":"2022-05-02 18:27:26","full_description":"Rinku Singh KKR IPL salary: The 24-year-old played a crucial knock under pressure to take his side home in a must- win match. During the 47th match of the ongoing 15th season of the Indian Premier League at the Wankhede Stadium in Mumbai, the Kolkata Knight Riders (KKR) defeated the Rajasthan Royals (RR) by 7 wickets, to end their five-match losing streak and still remain in contention, although by a whisker, in the race towards the playoffs. En route the target of 153 runs handed by the Sanju Samson-led side, KKR, with the help of some sensible, patient batting by their skipper Shreyas Iyer (34 off 32), Nitish Rana (48* off 37), and Rinku Singh (42* off 23), managed to get over the line with five deliveries to spare. After yet another poor start provided by the KKR openers, Iyer and Rana collaborated together while putting on a 60-run stand for the 3rd wicket off 43 deliveries, to bring their side back into the chase. However, with Iyer’s departure during the 13th Over, it was the match-winning partnership of 66 runs between Rana and Rinku Singh, that guided them towards a much-needed victory. Rinku, with his aggressive knock at a strike rate of 182.61, and with the assistance of 6 Fours and a Six, was the one who upped the ante during the final phase of the innings, and was thus fittingly awarded the ‘Player of the Match’ award. There is a beautiful story everyday in the #TATAIPL . Today was Rinku Singh putting Aligarh on the cricket map. Was so incredibly cool at the end — Harsha Bhogle (@bhogleharsha) May 2, 2022 Rinku Singh was roped in by the KKR at the bidding amount of INR 55 Lakh during the mega auction, after offering his services at a base price of INR 20 Lakh. The left-handed batter from Uttar Pradesh, in fact, has been a part of the KKR since the 2018 edition of the IPL. There is no official report confirming on the net worth of the Southpaw batter. However, after being bought by KKR at INR 80 lakh during the 2018 auction, Rinku’s net worth is in excess of at least a Crore rupees as of the year 2021.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 Highlights, KKR vs RR: Rinku Singh leads KKR to 7-wicket win - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9pcGwtMjAyMi1ra3ItdnMtcnItbGl2ZS1jcmlja2V0LXNjb3JlLWtvbGthdGEta25pZ2h0LXJpZGVycy12cy1yYWphc3RoYW4tcm95YWxzLWZ1bGwtc2NvcmVjYXJkLTEwMTY1MTQ4ODAwNDgxMy5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 Highlights, KKR vs RR: Rinku Singh leads KKR to 7-wicket win  Hindustan TimesTwitter Reacts As Venkatesh Iyer Gets Dropped From KKR Playing XI After String Of Poor Performances  Cricket AddictorLive Cricket Score - KKR v RR, Match 47, IPL 2022 | Cricbuzz.com - Cricbuzz  Cricbuzz10 Best Pictures Of Rishabh Pant’s Rumoured Girlfriend Isha Negi  The Cricket LoungeIPL 2022, KKR vs RR | Twitter reacts as Prasidh Krishna hilariously hits Trent Boult with a wayward throw  SportsCafeView Full coverage on Google News","content":null,"pubDate":"2022-05-02 18:12:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Cheteshwar Pujara County cricket: C Pujara total runs in County Championship 2022","link":"https://thesportsrush.com/cricket-news-cheteshwar-pujara-county-cricket-c-pujara-total-runs-in-county-championship-2022/","keywords":["Cricket","Cheteshwar Pujara","County Championship 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Cheteshwar Pujara County cricket: The right-handed batter from Saurashtra has displayed a fine form in the ongoing County Championship 2022. Having missed the first match of the ongoing County Championship Division Two 2022 against Nottinghamshire due to visa issues, team India and Sussex batter Cheteshwar Pujara has piled up huge scores in the following three… The post Cheteshwar Pujara County cricket: C Pujara total runs in County Championship 2022 appeared first on The SportsRush.","content":"Cheteshwar Pujara County cricket: The right-handed batter from Saurashtra has displayed a fine form in the ongoing County Championship 2022. Having missed the first match of the ongoing County Championship Division Two 2022 against Nottinghamshire due to visa issues, team India and Sussex batter Cheteshwar Pujara has piled up huge scores in the following three matches for his side. After a consistent run of poor form for his national side, Pujara was dropped from the Test team following India’s series loss against South Africa in January this year. With the 34-year-old also remaining unsold during the mega auction for IPL 2022, the County Championship in the UK had to be the stage for the veteran batter to find his lost form back, and he did grab the same with both hands. While he could just manage to score 6 (15) in the first innings for Sussex in his first match of the season against Derbyshire, he backed it up with a fine unbeaten double century – 201* (387) in the second innings to Draw the match for his side. In his side’s next encounter against Worcestershire, Pujara smashed yet another century (109) in the first innings, with the assistance of 16 Fours. Cheteshwar Pujara County cricket Continuing with his purple patch of form, the veteran batter scored his second double hundred of the season – 203 (334), against Durham this time around, with the assistance of 24 Fours. Great effort by the boys A result in our favour at the home ground would have been nicer. On to the next one! @SussexCCC #County pic.twitter.com/ysLy1dyCIz — cheteshwar pujara (@cheteshwar1) May 1, 2022 With the aforementioned double ton, the Saurashtra batter became only the second Indian to smash two scores above the 200-run mark, joining Mohammad Azharuddin, who had scored 212 (in the year 1991) and 205 (in the year 1994) while playing for Derbyshire. Moreover, in what was his 15th first-class double-century, Pujara is now two double tons ahead of Sri Lanka’s Kumar Sangakkara (with 13) to further cement his place at the top of the list of most scores of 200+ amongst Asian batters. Overall, with scores of 6 (15), 201* (387), 109 (206), 12 (22), and 203 (334) in the championship so far, Pujara has amassed 531 runs across 5 innings at an average of 132.75. The post Cheteshwar Pujara County cricket: C Pujara total runs in County Championship 2022 appeared first on The SportsRush.","pubDate":"2022-05-02 17:54:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022 KKR vs RR Live Update and Score: Boult removes Iyer to jolt KKR","link":"https://www.firstpost.com/firstcricket/sports-news/kkr-vs-rr-live-cricket-score-ipl-2022-live-update-kolkata-knight-riders-vs-rajasthan-royals-live-streaming-online-10622321.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022 KKR vs RR Live Update and Score: Boult removes Iyer to jolt KKR","content":"23:10 (IST)Prasidh Krishna to bowl the penultimate over...23:08 (IST)After 18 overs,Kolkata Knight Riders 135/3 ( Nitish Rana 39 , Rinku Singh 32)Live Score KKR vs RRA good over for KKR. Rinku Singh playing a gem here. He sets the platform with a couple of FOURS off the first two balls. Then takes a couple. There is an LBW appeal turned down. RR didn't opt for a review, replays showed it was clipping leg, umpire's call. Three runs off the last three balls make it 13 off the over. 18 needed off 12 now.23:04 (IST)FOURS! Lovely placement. Rinku Singh backs away a touch and smacks it through extra cover, off Chahal. He then comes down and heaves it over mid-wicket for consecutive FOURS. 23 needed off 16.23:03 (IST)After 17 overs,Kolkata Knight Riders 122/3 ( Nitish Rana 39 , Rinku Singh 21)Live Score KKR vs RRA decent over under pressure. Prasidh gives away 8 runs, Rinku Singh pulled one over short fine leg for a FOUR. 31 needed off 18 now.23:01 (IST)FOUR! Nicely done by Rinku Singh, Short from Prasidh Krishna, Rinku Singh pulls it over short fine leg. 32 needed off 20.23:00 (IST)Just short! Great effort from Boult. Rana gets a thick outside edge, Boult comes charging in from third man but it falls just short. He goes well to get a hand to it.22:55 (IST)After 16 overs,Kolkata Knight Riders 114/3 ( Nitish Rana 38 , Rinku Singh 15)Live Score KKR vs RRA very good comeback from Kuldeep in that over. After a DOT, Rinku Singh flicked one for a SIX off the second ball. Kuldeep however ramped up speeds and gave away just a single off the rest four balls. 7 runs off the over. 39 needed off 24 balls now.22:51 (IST)SIX! What a shot! Full on the pads from Kuldeep, Rinku Singh flicks it over long leg. What wrists! 40 needed off 28 now!22:49 (IST)After 15 overs,Kolkata Knight Riders 107/3 ( Nitish Rana 38 , Rinku Singh 8)Live Score KKR vs RRAshwin is brought back with two lefties at the crease. They deal in singles and twos. There are four singles and a two. No boundaries. 6 runs off the over. 46 needed off 30.22:44 (IST)After 14 overs,Kolkata Knight Riders 101/3 ( Nitish Rana 34 , Rinku Singh 6)Live Score KKR vs RRA mixed couple of overs for RR. Boult gets the wicket of Iyer but also gives away 11 runs. Rana steers one to third man for a deft FOUR and then Rinku Singh throws his bat at a wide one and edges it to third man for another FOUR. Chahal though pulls things back a bit, giving away just five singles. 16 runs and a wicket off the last two overs. 52 needed off 36 balls now.22:39 (IST)FOUR! Edgy! A touch wide from Boult, Rinku Singh chases and gets an edge which goes fine to third man.22:38 (IST)OUT! Boult has Iyer caught behind. Great review by Sanju Samson. The umpire had signalled it as a wide but replays showed a spike. It brushed the glove. Short and down the leg side, Iyer looks to pull but ends up gloving it to the keeper.22:36 (IST)FOUR! Great placement. Rana stays in his crease and dabs it wide of short third man, off Boult.22:32 (IST)After 12 overs,Kolkata Knight Riders 85/2 ( Shreyas Iyer (C) 33 , Nitish Rana 25)Live Score KKR vs RRKKR upping the ante now. Rana goes after Ashwin. He takes 14 off the first three balls. Disturbs his lines with a couple of reverse sweeps. The next three balls yield two singles. 16 runs off the Ashwin over. Iyer then lofts one over wide long on off Chahal for a SIX as they take 10 runs off the Chahal over. 26 runs off the last two overs.22:30 (IST)SIX! Brilliant use of the feet! Iyer charges downa nd lofts it over wide long on, off Chahal.22:27 (IST)4 6 4 Rana taking the attack to Ashwin. 14 off the first 3 balls. Rana gets down and reverse sweeps the first one over short third man. He then heaves the next one over deep mid-wicket for a SIX. He then again reverse sweeps the next one over short third man.22:25 (IST)After 10 overs,Kolkata Knight Riders 59/2 ( Shreyas Iyer (C) 26 , Nitish Rana 8)Live Score KKR vs RRAshwin bowls a frugal over and gives away just four singles. He beat Rana's outside edge with a ripper which grips and turns viciously off the pitch. Kuldeep Sen is then brought back, he doesn't get his lines right, a legsidish delivery runs away for two WIDES and then a touch widish delivery is cracked away for FOUR by Iyer through extra cover. There was another WIDE as he directs the yorker down the leg side. He then fires one on the leg stump, Iyer trickles it to fine leg for a couple. Iyer has a heart in mouth moment off the last ball as he flicks one uppishly and it falls just short of the short mid-wicket fielder. 9 runs off the Kuldeep over. 13 runs off the last two overs. 94 needed off 60.22:21 (IST)FOUR! Shreyas Iyer backs away and thumps it through extra cover, off Kuldeep.22:13 (IST)After 8 overs,Kolkata Knight Riders 46/2 ( Shreyas Iyer (C) 18 , Nitish Rana 6)Live Score KKR vs RRSpinners into action now. Ashwin starts off conceding a FOUR off the first ball. However, he bounces back well and concedes just four singles off the rest five balls. 8 runs off the over. Chahal then bowls a tight over, bowls mostly flighted balls and gives away six runs. 14 runs off the last two overs. 107 needed off 72 balls. 22:09 (IST)FOUR! Iyer cracks it through point, off Ashwin.22:06 (IST)After 6 overs,Kolkata Knight Riders 32/2 ( Shreyas Iyer (C) 10 , Nitish Rana 0)A very good powerplay for RR, they have sent back the openers - Finch and Indrajith and conceded just 32. Boult again bowls a tight over and concedes just 4. Prasidh follows up with another good one as he sends back Indrajith after he scooped him for a FOUR. 11 runs and a wicket off the last two overs.22:01 (IST)FOUR AND OUT! Prasidh Krishna strikes. Indrajith departs. Indrajith scoops one over fine leg for FOUR. But Prasidh follows up with a fast bouncer, Indrajith looks to pull but ends up getting a top edge to fine leg.22:00 (IST)Run out missed! Indrajith is lucky to be still out in the middle. Iyer taps it to the off side and scampers through for a single, Prasidh picks it up on his follow through and misses his direct hit as Indrajith dives in. Had he hit, Indrajith was a goner!21:53 (IST)After 4 overs,Kolkata Knight Riders 21/1 ( Baba Indrajith (W) 10 , Shreyas Iyer (C) 5)Live Score KKR vs RRA very good couple of overs for RR. Boult bowls another decent over. He too is getting his speeds up to 140kph. He gives away just four runs. Kuldeep then strikes in his first over as he makes Finch drag one on. Though Shreyas hits a FOUR first ball, Kuldeep bounces back well and concedes just two off the rest of the over. 6 runs and a wicket off it. 10 runs and a wicket off the last two overs.21:50 (IST)FOUR! Shreyas off the mark in style! Stays in his crease and cuts it wide of backward point, off Kuldeep.21:48 (IST)OUT! Kuldeep Sen strikes. Finch drags it on. Good length delivery outside off, at 146kph, Finch looks to cut but ends up dragging it onto the stumps.21:44 (IST)Ouch! Indrajith drives one to mid on and scampers through for a single, the mid on fielder, Prasidh Krishna misfires his throw and it hits Boult who is on his way, on the foot. Thankfully he is okay and there are smiles all around.21:42 (IST)After 2 overs,Kolkata Knight Riders 11/0 ( Baba Indrajith (W) 7 , Aaron Finch 3)Live Score KKR vs RRA good start from Prasidh Krishna despite the FOUR being hit. He ramped good pace and was constantly in the 140s. Indrajith flicked one for a FOUR but there was just a single after that. Prasidh beat Indrajith with a beauty in that over. 5 runs off the over.21:39 (IST)FOUR! Brilliant timing! On middle and leg, Indrajith flicks it wide of mid on, it races away.21:38 (IST)After 1 overs,Kolkata Knight Riders 6/0 ( Baba Indrajith (W) 2 , Aaron Finch 3)Live Score KKR vs RRA decent start from Boult. He didn't get much movement, in the air or off the pitch. But he was largely disciplined apart from the legside WIDE. 6 runs off the first over.21:33 (IST)Back for the chase. Aaron Finch and Baba Indrajith are the openers. Trent Boult will start off proceedings.21:20 (IST)After 20 overs,Rajasthan Royals 152/5 ( Shimron Hetmyer 27 , Ravichandran Ashwin 6)Hetmyer provides late surge to propel #RR to 152/5. Is it enough though? A decent last over for RR. After a single, Hetmyer cracked a FOUR over extra cover. But Mavi bounced back well with a couple of DOT balls. There is a two, a WIDE and a two again off the last two balls. 10 off the last over. 30 off the last two overs. 21:14 (IST)FOUR! Nicely placed! Full outside off from Mavi, Hetmyer smacks it over extra cover.21:13 (IST)Mavi to bowl the final over.21:11 (IST)After 19 overs,Rajasthan Royals 142/5 ( Shimron Hetmyer 19 , Ravichandran Ashwin 5)Live Score KKR vs RRA brilliant over for RR. Hetmyer starts off with a couple of sixes off the first two balls. Southee erred in line and length, bowled a couple of WIDES as well. Either he was too full or too short. They take 20 off the over. 21:07 (IST)SIX! 6 & 6Hetmyer taking on Southee. In the slot from Southee, Hetmyer swings it over deep mid-wicket.21:05 (IST)SIX! Hetmyer gets his first boundary. Swings this one over deep mid-wicket off Southee.21:04 (IST)After 18 overs,Rajasthan Royals 122/5 ( Shimron Hetmyer 2 , Ravichandran Ashwin 4)Live Score KKR vs RRDespite getting hit for a SIX, Southee ends up bowling a brilliant over. He gives away just a leg bye off the first four balls. Then gets his for a SIX by Parag. But then, Southee got his man, caught at deep mid-wicket. Seven runs and a wicket off the Southee over. Mavi then bowls another very good over. Removes Samson off the first ball and concedes just seven (he bowled waist height No ball but conceded just a single off the Free Hit). 14 runs and two wickets off the last two overs.20:59 (IST)OUT! Mavi sends back Samson. HUGE WICKET. Rinku Singh with a very good catch. It's a slower good length delivery outside off, Samson goes for a swing across the line but mistimes it high in the air, Rinku Singh at deep mid-wicket judges it well and takes a very good catch.20:56 (IST)OUT! Southee gets his man. SIX and OUT. Parag holes out to deep mid-wicket. It's the slower one this time, Parag swings again, doesn't get it off the middle and helps it to the deep mid-wicket fielder.20:54 (IST)SIX! Hammered! A touch short from Southee, Parag swings it over deep mid-wicket. 20:52 (IST)NOT OUT! Samson is given out LBW. But he reviews it. Replays show it was missing leg.20:49 (IST)After 16 overs,Rajasthan Royals 108/3 ( Sanju Samson (C) (W) 54 , Riyan Parag 13)Live Score KKR vs RRA good couple of overs for KKR. Umesh gives away just one run off five balls but then Finch misfields at the fence off the last ball and gives away a boundary. 5 runs off the Umesh over. Narine gives away just three singles off the next over. 8 runs off the last two overs. 20:43 (IST)FOUR! Misfield from Finch. Parag cuts it wide of third man, Finch misfields at the fence and lets it through.20:40 (IST)After 14 overs,Rajasthan Royals 100/3 ( Sanju Samson (C) (W) 51 , Riyan Parag 8)Live Score KKR vs RRRR looking to up the ante. Southee drifts one onto the pads, Samson trickles it to fine leg for FOUR. Nair then shows first signs of aggression as he smacks one over extra cover. They take 12 off the Southee over. Roy however, jolts RR with the wicket of Karun Nair. After four singles off four balls, Parag smacks it straight down the ground for a SIX. 10 off the Anukul Roy over. 22 off the last two overs and a wicket lost.20:38 (IST)SIX! Parag smacks it straight down the ground, Roy. Powerful shot.20:37 (IST)FIFTY for Samson. He gets there off just 38 balls. His 17th 50 in IPL.20:36 (IST)OUT! Anukul Roy strikes. Karun Nair holes out to deep mid-wicket. Nair charges down the track and looks to heave it across the line, doesn't get it off the middle and helps it into the hands of the deep mid-wicket fielder.20:32 (IST)FOUR! Brilliant shot from Nair! Backs away and smashes it over extra cover, off Southee.20:30 (IST)FOUR! Poor delivery! On the pads from Southee, Samson trickles it to fine leg.Kolkata Knight Riders vs Rajasthan Royals (KKR vs RR) Live Score Update: A decent over under pressure. Prasidh gives away 8 runs, Rinku Singh pulled one over short fine leg for a FOUR. 31 needed off 18 now.Preview: Kolkata Knight Riders (KKR) will be hoping to snap a five-game losing run when they take on Rajasthan Royals (RR) in Match 47 of the Indian Premier League (IPL) 2022 at the Wankhede Stadium in Mumbai.KKR, being led by ex-Delhi Capitals skipper Shreyas Iyer this season, got off to a promising start with three wins in their first four games. The two-time champions though, have fallen far behind in the points table since that promising start, losing five games in a row including a narrow seven-run loss in a high-scoring thriller against Rajasthan, the side they face on Monday.Rajasthan themselves are coming on the back of a defeat, suffering a five-wicket loss on Saturday at the hands of Mumbai Indians, who collected their first win of the season in their ninth attempt. Rajasthan were restricted to 158/6 after being asked to bat, with Suryakumar Yadav (51) and N Tilak Varma (35) laying the foundation for the victory with an 81-run third-wicket stand. Mumbai eventually got home with four balls to spare, with all-rounder Tim David providing the finishing touch with an unbeaten 20 off 9 balls.RR currently are sitting at the third spot on the IPL 2022 table with six wins from nine outings. KKR, on the other hand, are eighth on the table with just six points in nine games, desperately needing a win to keep their hopes of finishing in the top four at the end of the group stage alive.Here's everything you need to know as far as the upcoming match is concerned:When will the Kolkata Knight Riders vs Rajasthan Royals match be played?The KKR vs RR IPL 2022 match will take place on 2 May 2022.Where will the Kolkata Knight Riders vs Rajasthan Royals match be held?The KKR vs RR IPL 2022 match will be held at Wankhede Stadium in Mumbai.What time will the Kolkata Knight Riders vs Rajasthan Royals match start?The KKR vs RR IPL 2022 match will begin from 7:30 pm on Monday. The coin will be tossed in front of the captains at 7 pm.Where can you watch the KKR vs RR IPL 2022 match on TV and online?The KKR vs RR IPL 2022 match will be broadcast live on Star Sports Network channels — Star Sports 1 HD, Star Sports Select 1, Star Sports Select 1 HD (Dugout) and Star Sports 1. The match between SunRisers Hyderabad and Chennai Super Kings will also be streamed live on Disney+ Hotstar.You can also follow firstpost.com to check out the live scores updates and live commentary of the KKR vs RR IPL 2022 match.Complete Squads:Kolkata Knight Riders: Aaron Finch, Pat Cummins, Shreyas Iyer (c), Andre Russell, Chamika Karunaratne, Sheldon Jackson, Sunil Narine, Sam Billings, Umesh Yadav, Varun Chakravarthy, Aman Hakim Khan, Tim Southee, Mohammad Nabi, Baba Indrajith, Ajinkya Rahane, Rinku Singh, Venkatesh Iyer, Anukul Roy, Shivam Mavi, Pratham Singh, Nitish Rana, Abhijeet Tomar, Ashok Sharma, Ramesh Kumar, Harshit RanaRajasthan Royals: Jos Buttler, Sanju Samson (c), Yashasvi Jaiswal, Shimron Hetmyer, Ravichandran Ashwin, Yuzvendra Chahal, Prasidh Krishna, Riyan Parag, Nathan Coulter-Nile, Devdutt Padikkal, Navdeep Saini, Karun Nair, Rassie van der Dussen, Anunay Singh, James Neesham, Daryl Mitchell, Dhruv Jurel, Shubham Garhwal, Kuldip Yadav, Kuldeep Sen, Obed McCoy, Tejas Baroka, KC CariappaRead all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 17:33:26","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Sanju-Samson-Shreyas-Iyer-RR-KKR-IPL-2022-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, KKR vs RR Live Score Updates: Kolkata Knight Riders Lose Openers Early In Chase Of 153 vs Rajasthan Royals - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9saXZlLWlwbC1zY29yZS1ra3ItdnMtcnItbGl2ZS1jcmlja2V0LXNjb3JlLWtvbGthdGEta25pZ2h0LXJpZGVycy12cy1yYWphc3RoYW4tcm95YWxzLWxpdmUtc2NvcmVib2FyZC1hbmQtdXBkYXRlcy0yOTM5NzM10gGgAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2xpdmUtaXBsLXNjb3JlLWtrci12cy1yci1saXZlLWNyaWNrZXQtc2NvcmUta29sa2F0YS1rbmlnaHQtcmlkZXJzLXZzLXJhamFzdGhhbi1yb3lhbHMtbGl2ZS1zY29yZWJvYXJkLWFuZC11cGRhdGVzLTI5Mzk3MzUvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, KKR vs RR Live Score Updates: Kolkata Knight Riders Lose Openers Early In Chase Of 153 vs Rajasthan Royals  NDTV SportsMatch Preview - Royals vs KKR, Indian Premier League 2022, 47th Match  ESPNcricinfoKKR vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorLive Cricket Score - KKR v RR, Match 47, IPL 2022 | Cricbuzz.com - Cricbuzz  CricbuzzIPL 2022 Live Score, KKR vs RR: Kolkata Knight Riders lose Aaron Finch early  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-05-02 16:41:50","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022 KKR vs RR Live Score Updates: Anukul Roy snares Nair, Sanju brings up his 50 - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWtrci12cy1yci1saXZlLXNjb3JlLW9ubGluZS03ODk3ODEwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022 KKR vs RR Live Score Updates: Anukul Roy snares Nair, Sanju brings up his 50  The Indian ExpressMatch Preview - KKR vs Royals, Indian Premier League 2022, 47th Match  ESPNcricinfoKKR vs RR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorIPL 2022 Live Score, KKR vs RR: Samson leads RR fightback after KKR get Buttler  Hindustan Times10 Best Pictures Of Rishabh Pant’s Rumoured Girlfriend Isha Negi  The Cricket LoungeView Full coverage on Google News","content":null,"pubDate":"2022-05-02 15:12:41","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Rajasthan Royals Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-rajasthan-royals-live-score-over-match-47-t20-6-10-updates-2940147","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Rajasthan Royals from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-02 14:39:40","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Rajasthan Royals are 64/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Rajasthan Royals. Everything related to Kolkata Knight Riders and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Rajasthan Royals live score. Do check for Kolkata Knight Riders vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) This is floated around leg stump, Samson makes room and drives it past the bowler towards long off for another single. Tidy over from Anukul Roy, just the four singles off it. 9.5 overs (0 Run) On off, pushed away towards covers. 9.4 overs (0 Run) Nicely bowled! A bit of an arm-ball, quicker and just darted into the pads. Sanju Samson hangs on the back foot and nudges it out on the off side. 9.3 overs (1 Run) Just keeping the scoreboard ticking now these two. On middle, flicked through mid-wicket for a run. 9.2 overs (1 Run) Roy shortens his length and bowls it on middle. Samson rocks back and pushes it down to long on for one more. 9.1 overs (1 Run) Nicely drifted into middle and leg, Nair just eases it down to long on for a single. 8.6 overs (1 Run) On a good length and on off, Nair drives it towards covers and gets a single. 8.5 overs (1 Run) On middle, this is pushed down to long on for one. 8.4 overs (1 Run) Angled into the pads, this is worked down to fine leg for one. DRINKS! After a sedate start, Jos Buttler and Sanju Samson were building on a partnership with the skipper being the aggressor but the wicket of Buttler will certainly slow it down once again. Kolkata have done well so far to keep the scoring rate in check and getting rid of the dangerman will give them further confidence. There is still a long way to go but a couple of more wickets and Kolkata will have a good grip on the innings. Also, Karun Nair walks out to bat now. 8.3 overs (0 Run) OUT! CAUGHT! A full-length delivery on middle, Buttler tries to flick it over long on but couldn't connect well. A brilliant catch by the fielder. Huge wicket and a timely one as Buttler was looking to get going. 8.2 overs (4 Runs) FOUR! That is not a good effort by Narine and it is not for the first time in the gap! This is angled into the pads, Buttler goes for a hoick! It goes off the inner half towards backward square leg. Narine runs to his left from fine leg and just sticks a leg out. It hits the leg and goes over the fence for a boundary. 8.1 overs (1 Run) A fuller one on middle, Samson eases it towards mid-wicket and gets a single. 8.1 overs (1 Run) WIDE! Down the leg side to begin with! Wided. Sanju Samson pulled up a muscle as he turned to run on the last ball. The physio is out and Samson is receiving some treatment. The good news for Rajasthan is that he is back on his feet and is ready to continue. Also, Tim Southee is brought into the attack. 7.6 overs (2 Runs) Two to end! Buttler plays the paddle scoop, he plays it nice and fine. Anukul Roy at deep backward square leg, runs to his right, dives and pushes it back in. He though fails to pick it up cleanly and the ball is rolling towards the ropes. He does not let it hit it though and saves two for his side. They do take it upstairs to check but replays show he has done fine. 7.5 overs (1 Run) Angled into the pads, Samson works it through mid-wicket for one. He is holding his back and seems to be struggling a little. 7.4 overs (0 Run) Flatter and on middle, Samson pushes it back to the bowler. 7.3 overs (0 Run) Angled into the pads, Samson works it to mid-wicket. 7.2 overs (4 Runs) FOUR! That is a outstanding shot! Brilliant! Flatter and just outside off, not a lot of width on offer. Samson waits and then plays it behind point for a boundary. 7.1 overs (0 Run) Flatter and outside off, Samson looks to push at it, it goes off the outer half to the man at short third man. Sunil Narine (1-0-5-0) comes back in to replace Anukul Roy. 6.6 overs (1 Run) A yorker to end then! Full and outside off, Samson jams it through point for one. 6.5 overs (1 Run) This one lands safe! This is what happens when you are in form, even the mis-hits fall in no man's land! A slower one on middle, Buttler is done in by the lack of pace. He mistimes it high up in the air but it lands safe in the mid on region. One taken. 6.4 overs (0 Run) Timed well but does not find the gap! Length and on off, Buttler pushes it on the up but to covers. 6.3 overs (2 Runs) Kolkata have done well in the field! Good work from Russell this time! On the pads, Buttler works it through backward square leg. Russell in the deep, runs to his right, slides and keeps it down to two. 6.2 overs (0 Run) He really looked to hit that hard! It was there to be hit though! Fuller and outside off, Buttler looks to go over covers but misses. 6.1 overs (0 Run) Length and on off, Buttler pushes it to covers. Shivam Mavi comes into the attack now. 5.6 overs (6 Runs) SIX! That is trademark Sanju Samson! What a shot. The last ball spoils the over but still, it is a good Powerplay for Kolkata. Rajasthan are 38 for 1 after it. Sanju makes room, this is bowled full and on middle, he lofts it nonchalantly over the cover fence for a biggie. 5.5 overs (2 Runs) Good work by Mavi again! On middle, this is chipped over the bowler's head. Mavi at long off, runs to his right, dives and keeps it down to two. 5.4 overs (1 Run) Good fielding! Buttler steps out and makes it into a full toss, it is hit to the right of long off who covers ground quickly and keeps it down to one. 5.3 overs (1 Run) Another single! Fuller and on off, this is eased down to long off for one. 5.2 overs (1 Run) Flatter and on middle, Buttler stays back and pushes it down to long off for one. 5.1 overs (0 Run) Slightly shorter and around off, Buttler slaps it but to covers.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637871189723698203.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Race on between Jos Buttler and KL Rahul to the top-four hitters' list","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-race-on-between-jos-buttler-and-kl-rahul-to-the-top-four-hitters-list-10625891.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Race on between Jos Buttler and KL Rahul to the top-four hitters' list","content":"It's amazing how boundaries play an important role in T20s despite the excessive focus on sixes. One glance at the most fours list would give a clear idea about its importance. The top five list is dominated by players whose sides are also in the top half of the points table.At number one is Rajasthan Royals opener Jos Buttler. What a season he is having. It took him about three-four games to rise to the top of the Orange Cap list, the most sixes list, and the most fours list and since then the England right-hander has continued to maintain a healthy lead over all his competitors. Buttler has so far hit 47 fours in 9 matches. Add his 36 sixes too to the list and you have the most fierce ball-striker in this IPL.In the second spot is Lucknow Super Giants skipper KL Rahul with 38 fours in 10 matches. It won't be an exaggeration to term Rahul as IPL's Mr Consistent. His performance in the last three seasons of the IPL has been simply superb. It doesn't matter which side he plays for but runs keep flowing from his bat on a regular basis.Sunrisers Hyderabad opener Abhishek Sharma has been like a breath of fresh air in this IPL. He is at number 3 in the most fours list. Credit must be given to SRH team management for showing faith in the young left-hander and backing him to continue open the batting despite a few failures at the start of the tournament. He has hit 36 fours so far.You would always expect Delhi Capitals' Prithvi Shaw to be in the most fours list. Such is the style of Shaw's batting, that the bulk of his runs in the powerplay come from boundaries. The attacking right-hander is at number four with 35 fours in 9 matches.David Warner is another batter who deals in boundaries. The Delhi Capitals opener is at number 5 with 33 fours in just 7 matches.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 14:13:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Buttler-RR-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Anukul Roy IPL 2022 price: Why is Venkatesh Iyer not playing today’s IPL 2022 match between Kolkata Knight Riders and Rajasthan Royals?","link":"https://thesportsrush.com/cricket-news-anukul-roy-ipl-2022-price-why-is-venkatesh-iyer-not-playing-todays-ipl-2022-match-between-kolkata-knight-riders-and-rajasthan-royals/","keywords":["Cricket","IPL 2022","KKR","Rajasthan Royals","Anukul Roy","Indian Premier League","Kolkata Knight riders","rajasthan royals","RR","shivam mavi","Venkatesh Iyer"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Venkatesh Iyer not playing today: Kolkata Knight Riders have made a couple of changes to their Playing XI for this match. During the 47th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Rajasthan Royals at the Wankhede Stadium, Kolkata Knight Riders captain Shreyas Iyer has won… The post Anukul Roy IPL 2022 price: Why is Venkatesh Iyer not playing today’s IPL 2022 match between Kolkata Knight Riders and Rajasthan Royals? appeared first on The SportsRush.","content":"Why Venkatesh Iyer not playing today: Kolkata Knight Riders have made a couple of changes to their Playing XI for this match. During the 47th match of the ongoing 15th season of the Indian Premier League between Kolkata Knight Riders and Rajasthan Royals at the Wankhede Stadium, Kolkata Knight Riders captain Shreyas Iyer has won the toss and chose to bowl. “We will bowl first, seems like a used wicket. Considering the dew factor, it helps us in the second innings. We have lost many close games. The chat is always been positive cricket. We need to play fearless cricket,” Iyer told Star Sports at the toss. Asked to bat first after losing yet another toss, Rajasthan Royals captain Sanju Samson joked about looking to win a toss in the remaining matches of the season. Samson also confirmed a lone change in the form of batter Karun Nair replacing batter Daryl Mitchell in the Playing XI. One change in the XI, no change in our support! The boys are taiyaar for #KKRvRR. #HallaBol | #KKRvRR | #IPL2022 | @Dream11 pic.twitter.com/6iFO6pK68P — Rajasthan Royals (@rajasthanroyals) May 2, 2022 “Nothing different today, looking forward to winning some tosses going forward [laughs]. In this format, the margin for error is very small. We have put in a great standard. Nothing much to improve on,” Samson told Star Sports at the toss. Why is Venkatesh Iyer not playing vs Rajasthan Royals today? At the eighth position on the points table, Knight Riders’ desperation is quite visible from the two changes that they’ve made this season. After dropping a retained player in spinner Varun Chakravarthy in their last match against Delhi Capitals, KKR have now dropped another retained player in all-rounder Venkatesh Iyer. While debutant all-rounder Anukul Roy has been included in Venkatesh Iyer’s place, pacer Shivam Mavi has come in for Harshit Rana. While Mavi has been included because of his past record against Royals (12 wickets in seven matches at an economy and strike rate of 7.10 and 13.58 respectively), Shreyas particularly emphasized on getting an extra bowling option with Roy replacing Venkatesh. ALSO READ: Are Shreyas Iyer and Venkatesh Iyer related to each other? In nine innings this season, Venkatesh has managed 132 runs at an average and strike rate of 16.50 and 97.77 respectively. On the bowling front, Venkatesh’s three IPL 2022 overs cost his team 38 runs without any wicket. Roy, 23, was part of the U-19 World Cup-winning Indian squad under Prithvi Shaw in 2018. Apart from representing Jharkhand in domestic cricket, Roy played a solitary match for Mumbai Indians (vs Chennai Super Kings three years ago) across four seasons. Readers must note that Kolkata bought him for his base price of INR 20 lakh during the mega auction held in Bengaluru earlier this year. The post Anukul Roy IPL 2022 price: Why is Venkatesh Iyer not playing today’s IPL 2022 match between Kolkata Knight Riders and Rajasthan Royals? appeared first on The SportsRush.","pubDate":"2022-05-02 13:59:25","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Captain MS Dhoni loses cool at Mukesh Choudhary in SRH vs CSK clash","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-captain-ms-dhoni-loses-cool-at-mukesh-choudhary-in-srh-vs-csk-clash-10625721.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Captain MS Dhoni loses cool at Mukesh Choudhary in SRH vs CSK clash","content":"Chennai Super Kings seem to have got their momentum back with MS Dhoni once again assuming captaincy of the Yellow Army. The team bounced back from its recent defeats with a 13-run victory over Sunrisers Hyderabad.The game stretched into a nail-biting final over as fans were eager to know if CSK would get back its Midas touch under ‘Thala’ Dhoni. However, there was a moment in the match when the ‘Captain Cool’ seemed to have lost his cool.The incident took place in the final over when CSK bowler Mukesh Choudhary bowled a leg-side delivery to SRH batter Nicholas Pooran. The delivery was declared a wide. Dhoni was seen furiously gesticulating towards the fielders on the offside, indicating that Choudhary should have gone wide of off-stump in his delivery.The 25-year-old was then smashed for two consecutive sixes by Pooran. But the effort came in too late for SRH, as they lost the encounter by 13 runs. Mukesh Choudhary scalped 4 wickets for 46 runs in the game, emerging as the best bowler for CSK.Speaking at the post-match conference, the young bowler stated that Dhoni had told him “to bowl stump to stump and not try anything fancy” before the start of the final over.As for Captain Cool himself, the wicketkeeper-batter stated that he only had one piece of advice for all bowlers in T20 cricket. “I always told my bowlers, you may get hit for 4 sixes in an over, but the 2 balls that you save - ultimately in a high-scoring game - those are the 2 deliveries that will help you win the game,” he asserted in the post-match interview.Dhoni explained his point, elaborating that after giving away 3-4 sixes in an over, many bowlers feel like they should just “get done with it”. However, if they get hit for a four instead of a six, even that could help them in the match. The CSK skipper added that while he doesn’t know if bowlers believe in the theory “but it really works.”With this win, Chennai Super Kings have registered their third victory in the tournament. They will clash with Faf du Plessis’ Royal Challengers Bangalore next.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram. ","pubDate":"2022-05-02 13:47:20","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Dhoni-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Kolkata Knight Riders vs Rajasthan Royals: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/kolkata-knight-riders-vs-rajasthan-royals-live-score-over-match-47-t20-1-5-updates-2939933","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Kolkata Knight Riders vs Rajasthan Royals from Wankhede Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-05-02 13:45:39","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 5.1 overs, Rajasthan Royals are 27/1. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Kolkata Knight Riders and Rajasthan Royals. Everything related to Kolkata Knight Riders and Rajasthan Royals match will be available on Sports.NDTV.com . Stay updated with Kolkata Knight Riders vs Rajasthan Royals live score. Do check for Kolkata Knight Riders vs Rajasthan Royals scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 4.6 overs (0 Run) Around off, pushed to covers. No run there. 4.5 overs (4 Runs) FOUR! Just over! A length ball, outside off. Samson tries to go over mid off and gets enough elevation for the ball to travel over the leaping mid off fielder. A boundary. 4.4 overs (4 Runs) FOUR! Fullish delivery, outside off. Samson throws his bat at it and the ball goes off the cue end of the bat to the third man fence. 4.4 overs (1 Run) First bouncer we have seen in this innings, on middle. Samson evades it quite well. Okay, a no ball is given as Yadav has overstepped and now a Free-hit is coming up. 4.3 overs (1 Run) On middle, pulled away to deep square leg for one. 4.3 overs (1 Run) Wide! An appeal for caught behind but not given! A length ball, angling down the leg side. Buttler misses his pull. Might have been the thigh pad there. Actually, there was nothing. 4.2 overs (0 Run) Yadav comes back by targeting the stumps and Buttler keeps it out. 4.1 overs (4 Runs) FOUR! In the gap! Overpitched, outside off. Buttler leans into his shot as he drives it through covers for a boundary. 3.6 overs (0 Run) A solid back foot defense to end the over. 3.5 overs (4 Runs) FOUR! Finally a boundary for Rajasthan and Samson is off the mark! Flatter and outside off. Samson punches it off the back foot through covers. Anukul Roy chases and dives but to no avail. 3.4 overs (0 Run) Narine drops it short and outside off. Samson punches it straight to Russell at covers. 3.3 overs (1 Run) A run after nine deliveries. Fuller ball, on middle, Buttler works it to mid on for a single. 3.2 overs (0 Run) Tosses it up, full and on off, blocked back to the bowler. 3.1 overs (0 Run) Tossed up, on off, pushed to covers. Sunil Narine comes into the attack now. 2.6 overs (0 Run) A length ball, outside off. Samson punches it to cover-point. Buttler wants a quick single but is sent back on time. There is a shy at the bowler's end but the fielder misses. Brilliant over from Umesh Yadav, a wicket-maiden! 2.5 overs (0 Run) Yadav keeps it tight by targeting the stumps, on middle. Samson turns it to square leg. 2.4 overs (0 Run) Yadav serves a full ball, around off. Samson again keeps it out. 2.3 overs (0 Run) Tad fuller and outside off. Samson again blocks it out. 2.2 overs (0 Run) A length ball, on off. Blocked out. The skipper, Sanju Samson is in at number 3. 2.1 overs (0 Run) OUT! CAUGHT AND BOWLED! Umesh Yadav continues to be impressive this season. This is full and around off. Padikkal leans and tries to work it on the leg side but gets a leading edge straight back to Yadav. Umesh Yadav does ever so well to stretch his right hand out and the ball sticks nicely in his palms. He fumbles a bit but kept his eyes on the ball. Good start by Kolkata. 1.6 overs (0 Run) Another arm ball, full and around middle. Buttler takes the charge and tries to heave it but misses and gets hit on the pads. Good start by Anukul Roy. 1.5 overs (1 Run) Touch short at 92 clicks. Padikkal nudges it to deep square leg for a single. 1.4 overs (1 Run) An arm ball, fuller and on middle. Buttler pushes it to long off for a single. 1.3 overs (1 Run) Darted on the pads, it is flicked through mid-wicket for a single. 1.2 overs (0 Run) Full, quicker now, around off. Padikkal pushes it to mid off. 1.1 overs (0 Run) Tossed up, on off. Padikkal blocks it out. Anukul Roy, the left-arm off-spinner to start from the opposite end. 0.6 over (0 Run) On middle, tucked to mid-wicket. 0.5 over (0 Run) Beauty of a delivery! A length ball, in the channel of uncertainty, outside off. Buttler is made to play that as he tries to poke at it but the ball nips away off the deck and whizzes past the outside edge. 0.4 over (0 Run) Length ball, around off. Buttler is a bit late as he looks to punch but gets an inside edge onto his thigh pads. 0.3 over (4 Runs) FOUR! Pierces the gap! That was not intended to meet the boundary but that's how good Buttler is this season. Full ball, on off. Buttler looks to push on the off side but mistimes it past mid on. Tim Southee from mid off chases it back and puts in a dive but fails to keep it away from the fence. 0.2 over (0 Run) Touch fuller and around off. Buttler brings a straight bat down to defend on the off side. 0.1 over (0 Run) A length ball, outside off, bit of late swing there. Buttler shoulders arms to it. We are ready for play! The two umpires are out in the middle and they are followed by the players of Kolkata. Rajasthan openers Jos Buttler and Devdutt Padikkal stride out to the middle as well. Umesh Yadav has the new ball in hand and is raring to go. Let's play... Shimron Hetmyer is down for a chat. Hetmyer says it is just about giving himself chance, earlier he was not taking time to get set but now he takes a couple of balls to see what the pitch is doing. Adds that his wife is his biggest supporter. Mentions that from Buttler, he tries to learn the reverse sweep and even the scoop. Shares that batting looks easy from the outside but he loves playing here and it is a nice ground for the batters. Rajasthan skipper, Sanju Samson says that they are looking forward to winning a few matches on the trot now. Adds that the margin of error in this tournament is so small that even after playing good cricket, they lost the previous match. Informs that Karun Nair comes in place of Daryl Mitchell and the reason for the change is the combination of the side and also the conditions. Shreyas Iyer, the skipper of Kolkata says they will bowl first as the pitch looks like a used one and considering the dew factor helping in the second innings. Tells that they have lost too many close games but they try to play positive cricket and now they'll try to play fearless cricket. Informs there are two changes. Mentions it's important to have the right combinations and are trying to give players as many games as possible. Rajasthan (Playing XI) - Jos Buttler, Devdutt Padikkal, Sanju Samson (C/WK), Karun Nair (In place of Daryl Mitchell), Shimron Hetmyer, Riyan Parag, Trent Boult, Ravichandran Ashwin, Kuldeep Sen, Prasidh Krishna and Yuzvendra Chahal. Kolkata (Playing XI) - Aaron Finch, Baba Indrajith (WK), Shreyas Iyer (C), Rinku Singh, Nitish Rana, Andre Russell, Sunil Narine, Anukul Roy (In place of Anukul Roy), Umesh Yadav, Tim Southee and Shivam Mavi (in place of Harshit Rana). TOSS - The toss goes in the favour of Kolkata and they have elected to BOWL first. PITCH REPORT - Matthew Hayden is near the pitch. He says it looks like a very hard surface and it's extremely dry. Adds that yesterday they saw a big total posted by Lucknow and with similar conditions, you can expect a high-scoring game tonight. Informs there will be a little bit of spin on offer and the captain winning the toss should elect to bat first. Rajasthan were going toe-to-toe with Gujarat at the top of the table but currently sit in the third position on the table and they too need a win here in order to keep the chasing pack at bay. Jos Buttler continues to lead the scoring charts but needs more support from those around him if Rajasthan are to go the distance because the bowling has generally been very consistent with two experienced spinners bossing play. So, will Kolkata recover from their slump? Or will Rajasthan get back to their best? We'll find out soon. Toss and team news in a bit. Kolkata had three wins from their first four games but an abysmal run of five straight losses has put them on the brink. They still are in the mix for a playoff spot but they need to start winning soon. Umesh Yadav has been one bright light for them but they need more consistent performances from the experienced bunch of Shreyas Iyer, Andre Russell and Sunil Narine. After a fascinating Super Sunday that saw Lucknow inch closer to sealing a playoffs spot and also saw the return of MS Dhoni as Chennai skipper, leading them to a win that keeps their hopes alive comes Manic Monday. In match number 47, a struggling Kolkata side squares off against a Rajasthan team that is looking to bounce back after their loss against Mumbai last time around. It promises to be a fascinating encounter as desperation does bring out the best in players. On that note, welcome to the coverage. ... MATCH DAY ...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637871157311098501.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Dale Steyn gets shirt signed by CSK skipper MS Dhoni; internet in awe","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-dale-steyn-gets-shirt-signed-by-csk-skipper-ms-dhoni-internet-in-awe-10625951.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: Dale Steyn gets shirt signed by CSK skipper MS Dhoni; internet in awe","content":"Despite retiring from international cricket, MS Dhoni continues to be one of the most celebrated cricketers across the globe. Much to everyone's expectation, Dhoni was the main man at Pune’s MCA Stadium on Sunday night, where a sea of yellow army turned up to watch the man in action after getting back the captaincy from Ravindra Jadeja. With Dhoni at helm, Chennai Super Kings registered a 13-run win over SunRisers Hyderabad.Post match, during the customary meet and greet sessions between both the two teams, the CSK captain was seen sharing some tips with young SRH players Umran Malik and Nicholas Pooran. But what caught everyone’s eye was legendary pacer Dale Steyn meeting Dhoni and even getting a t-shirt signed by the former India captain. The legendary Proteas fast bowler, who is now part of SunRisers’ support staff, approached Dhoni with a request for an autograph. The CSK captain obliged and signed his orange jersey. It was a special moment as this involved none other than a former cricketer of the game instead of a common fan. Pictures of Steyn taking Dhoni’s autograph has gone viral on the internet and fans have been expressing their emotions on seeing the two legends in one frame.Several other SRH players also came forward and took autographs from Dhoni after the match. Few of them also spent some time with the CSK captain, asking him about various aspects of the game.In Sunday's match, Ruturaj Gaikwad and Devon Conway’s brilliant six-hitting exhibition and a four-wicket haul from Mukesh Choudhary helped CSK notch up a 13-run win over SRH.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram. ","pubDate":"2022-05-02 13:42:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Steyn-and-Dhoni-640_Sportzpics.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"CWA vs SKI Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Jamaica T10 2022, Match 27","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/cwa-vs-ski-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-jamaica-t10-2022-match-27?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-05-02 13:27:19","full_description":"The Cornwall Warriors will take on the Surrey Kings in the 27th match of the Jamaica T10 2022 at Sabina Park in Kingston on Monday. The Surrey Kings won the last fixture between the two sides and will be quite confident heading into this game. The Kings are second in the table and are arriving into this match after conceding a defeat in their previous encounter. On the other hand, the Cornwall Warriors won their last league fixture by six wickets and would love to do the same here. Andre McCarthy and Mikheil Silver were the key performers for them. CWA XI Paul Palmer, Ockeeno Farquharson, Omar Samuels, Andre McCarthy, Damian Ebanks (c), Jevoy Spence (wk), Kerry Holness, Derval Green, Damian Bryce, Jerome Daley, Jermaine Levy SKI XI Kennar Lewis, Jermaine Blackwood (c), Andre McCarthy, Oraine Williams, Brad Barnes, Jeavor Royal, Shalome Parnell, Kymani Wilson (wk) Aldane Thomas, Andre Dennis, Patrick Harty CWA vs SKI, Jamaica T10 2022, Match 27 Date and Time: May 2, 2022, 9:15 PM IST Venue: Sabina Park, Kingston Pace bowlers might find some assistance with the new ball in the early stages of the game. Scores of 100 will be expected at this venue as the batters will also find purchase. Most of the games have been won by the side setting the target. Wicketkeeper J Spence is an immense choice for the wicket-keeper role. He is a difficult player to stop once he gets going with the bat. Batters Despite being listed as a pure batter, O Williams has displayed his all-round abilities. He has scored 48 runs but more importantly, has scalped six wickets for his side. J Blackwood is one of the most experienced campaigners in the entire league. He has amassed 114 runs in eight matches at a strike rate of 167.65. All-rounders A McCarthy is the second-highest run-scorer for the Surrey Kings with 121 runs at a strike rate of 188.24. He’s also scalped three wickets and is a great choice as far as the captaincy pick of your CWA vs SKI Dream11 fantasy team is concerned. Bowlers J Royal is another important player to have in your Dream11 fantasy side. He has scored 120 runs and has also picked up two wickets. A McCarthy (SKI) – 342 points A McCarthy-I (CWA) – 319 points O Williams (SKI) – 302 points D Ebanks (CWA) – 260 points J Royal (SKI) – 259 points A McCarthy: 121 runs and 3 wickets A McCarthy-I: 92 runs and 4 wickets O Williams: 48 runs and 6 wickets D Ebanks: 60 runs and 5 wickets J Royal: 120 runs and 2 wickets Fantasy Suggestion #1: J Spence, O Williams, K Lewis, K Holness, J Blackwood, A McCarthy, A McCarthy-I, D Ebanks, J Royal, S Parnell, A Dennis Captain: A McCarthy , Vice-Captain: A McCarthy-I Fantasy Suggestion #2: J Spence, O Williams, K Lewis, K Holness, J Blackwood, A McCarthy, A McCarthy-I, D Ebanks, J Royal, S Parnell, P Palmer Captain: O Williams , Vice-Captain: J Royal.","image_url":"https://static.sportskeeda.com/editor/2022/05/92957-16514946632733-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"CSA announces Momentum Proteas' contracted squad for 2022/23","link":"https://ewn.co.za/2022/05/02/csa-announces-momentum-proteas-contracted-squad-for-2022-23","keywords":null,"creator":null,"video_url":null,"description":"In the lead up to that schedule, Cricket South Africa on Monday announced a list of 15 players who have been awarded national contracts for the 2022/23 season.","content":null,"pubDate":"2022-05-02 12:53:38","image_url":null,"source_id":"ewn","country":["south africa"],"category":["sports"],"language":"english"},{"title":"“If there is no coach in there, it will be a chance for Ben to grab hold of it”: Michael Atherton backs Ben Stokes to take charge without a new head coach","link":"https://thesportsrush.com/cricket-news-if-there-is-no-coach-in-there-it-will-be-a-chance-for-ben-to-grab-hold-of-it-michael-atherton-backs-ben-stokes-to-take-charge-without-a-new-head-coach/","keywords":["Cricket","Ben Stokes","ECB","England cricket team"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Ben Stokes is the new test captain of England and Michael Atherton has backed him to do well even without the head coach. The English cricket team will start their new era in tests under the captaincy of Ben Stokes. After an abysmal Ashes 2021-22 and disappointing West Indies tour, Joe Root resigned as the… The post “If there is no coach in there, it will be a chance for Ben to grab hold of it”: Michael Atherton backs Ben Stokes to take charge without a new head coach appeared first on The SportsRush.","content":"Ben Stokes is the new test captain of England and Michael Atherton has backed him to do well even without the head coach. The English cricket team will start their new era in tests under the captaincy of Ben Stokes. After an abysmal Ashes 2021-22 and disappointing West Indies tour, Joe Root resigned as the captain of the side. Apart from Joe Root, Chris Silverwood was also sacked as the head coach of the side. After Ben Stokes’ arrival, some important decisions have already been made. Rob Key has confirmed that Ben Stokes wants both James Anderson and Stuart Broad to be a part of his side. Both of the veteran pacers were left out of the West Indies tour, and it was said that they are out of favour now. Michael Atherton backs Ben Stokes to do well without a head coach England’s new Test cricket captain is appointed but, the head coach’s position is still vacant. According to many reports, Gary Kirsten is set to become the new head coach of the side, but there is nothing official yet. 6th May is the last date to submit the job applications. Former English captain Michael Atherton has backed Stokes to mould the side well even in the absence of the head coach. He said Ben Stokes has the ability to run the dressing room according to his vision. Thanks for all the messages, proud day for me and my family. I love playing cricket for England, see you at Lord’s pic.twitter.com/AvgN4DDLah — Ben Stokes (@benstokes38) April 28, 2022 “Ben Stokes will be his own man; he has got a chance to shape that team now and take it in a different direction,” Atherton told Sky Sports News. “There may not be a coach in place in time. These things go through a process; I think May 6 is when job applications close and June 2 is the first Test match. That’s quite tight.” “If there is no coach in there, it will be a chance for Ben to absolutely grab hold of it, mould the team and say ‘this is the way we’re going to run things.'” The new director of English cricket, Rob Key has said that a new head coach will be named ahead of the test series against New Zealand. Stokes, who has captained England once in tests will start his journey as the skipper against New Zealand in June.   The post “If there is no coach in there, it will be a chance for Ben to grab hold of it”: Michael Atherton backs Ben Stokes to take charge without a new head coach appeared first on The SportsRush.","pubDate":"2022-05-02 12:51:16","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IPL 2022: Jos Buttler continues to enjoy healthy lead in six-hitters' list","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-jos-buttler-continues-to-enjoy-healthy-lead-in-six-hitters-list-10625781.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: Jos Buttler continues to enjoy healthy lead in six-hitters' list","content":"As many as 99 players have at least hit one six in the ongoing Indian Premier League proving that the pitches have been conducive for strokeplay. After five weeks of non-stop action in IPL 2022, it is who is leading the most sixes' list by individual batters.The Rajasthan Royals batter has already hit 36 sixes in IPL 2022 in just 9 matches, averaging four per innings. Buttler is having a season to remember. He is also at the top of the Orange Cap list for the highest run-scorer of the tournament. The right-handed opener has so far amassed 566 runs at an average of 70.75 and a strike rate of 155. Buttler's performance at the top has been RR's main driving force this year.At number two in the most sixes list is Kolkata Knight Riders all-rounder Andre Russell. You would generally expect Russell to be on this list always. The West Indies big-hitter, who managed to register the unique record of hitting four sixes in an over and also taking four wickets in an over in the same match has so far hit 22 sixes in 9 matches.Punjab Kings' England dasher Liam Livingstone is at the third spot. Livingstone has a big reputation for being a big hitter and he has done his reputation no harm in this IPL by smashing 20 sixes for PBKS in 9 matches.In the fourth spot is Rajasthan Royals captain Sanju Samson. The right-hander has also hit 20 sixes in the same number of matches as Livingstone but is behind him on strike rate. Samson, however, won't be entirely pleased with the kind of season he is having. He is yet to register a big score and play a leading role in winning a match for his franchise.Lucknow Super Giants captain KL Rahul who is giving a tough fight to Buttler for the Orange Cap is at number five on the six hitter's list. The stylish LSG opener has so far smashed 20 sixes in 10 matches.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 12:48:50","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Jos-Buttler-DC-RR-IPL-2022-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"“I have always wanted to play county cricket”: Chris Lynn expresses delight on joining Northamptonshire for T20 Blast 2022","link":"https://thesportsrush.com/cricket-news-i-have-always-wanted-to-play-county-cricket-chris-lynn-expresses-delight-on-joining-northamptonshire-for-t20-blast-2022/","keywords":["Cricket","Chris Lynn","County Cricket","Northamptonshire","T20 Blast"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"T20 Blast 2022: Northamptonshire have completed the signing of Australia’s Chris Lynn for the upcoming season. Northamptonshire have secured the services of Australian opener Chris Lynn for this year’s T20 Blast. Chris Lynn will be available to play for the whole duration of the tournament this season. Lynn is Northamptonshire’s 2nd overseas signing this year… The post “I have always wanted to play county cricket”: Chris Lynn expresses delight on joining Northamptonshire for T20 Blast 2022 appeared first on The SportsRush.","content":"T20 Blast 2022: Northamptonshire have completed the signing of Australia’s Chris Lynn for the upcoming season. Northamptonshire have secured the services of Australian opener Chris Lynn for this year’s T20 Blast. Chris Lynn will be available to play for the whole duration of the tournament this season. Lynn is Northamptonshire’s 2nd overseas signing this year after New Zealand’s all-rounder Jimmy Neesham. Jimmy Neesham played for Essex Eagles in the T20 Blast 2021, whereas this will be the first-ever stint for Lynn. Lynn is regarded as one of the most lethal openers in the circuit, but his form has certainly dipped in the last couple of seasons. Lynn, who is the highest-ever run-scorer in the BBL history managed to score just 215 runs at 17.91 for Brisbane Heat in BBL11. He managed to score just one half-century in the tournament. Overall, he has scored 3005 runs in BBL at 34.54, whereas his strike-rate has been 148.83. He has smashed 180 sixes in the history of BBL. Chris Lynn signs with Northamptonshire for T20 Blast Chris Lynn has expressed his delight on signing with Northamptonshire for the upcoming T20 Blast. Lynn said that he always wanted to play County Cricket in England, and he is hopeful of having some good performances. “I have always wanted to play county cricket and I’m really looking forward to joining up with Northamptonshire for the Vitality Blast,” Lynn said. “I am hopeful that I can contribute with some good performances and also try to entertain the Steelback fans this summer.” Genuinely think this lands in Abington Park. Chris Lynn is a Steelback. pic.twitter.com/FXMWc7n5zI — Northamptonshire CCC (@NorthantsCCC) May 2, 2022 Chris Lynn played for Northern Superchargers in The Hundred tournament last year, but this will be his first proper experience in the English county cricket. Josh Cobb, captain of Northamptonshire’s T20 team has also praised the signing of Lynn by the club. “To get someone of Lynn’s quality is an excellent signing,” Cobb said. “Lynn’s captained the Brisbane Heat for a number of years too so for me personally he brings those leadership qualities as well.” Overall, Chris Lynn has scored 6140 T20 runs at a brilliant strike-rate of 142.19, courtesy of 2 centuries and 40 half-centuries. The post “I have always wanted to play county cricket”: Chris Lynn expresses delight on joining Northamptonshire for T20 Blast 2022 appeared first on The SportsRush.","pubDate":"2022-05-02 11:49:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Santosh Trophy: Malayali entrepreneur promises Rs 1 crore to Kerala if they beat West Bengal","link":"https://www.firstpost.com/sports/santosh-trophy-malayali-entrepreneur-promises-rs-1-crore-to-kerala-if-they-beat-west-bengal-10624591.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Santosh Trophy: Malayali entrepreneur promises Rs 1 crore to Kerala if they beat West Bengal","content":"Kerala is set to host West Bengal on Monday to play the final of the 75th National Football Championship, Santosh Trophy at the Manjeri Payyanad Stadium in Malappuram, Kerala.West Bengal holds the record of winning the tournament 32 times while Kerala has lifted the trophy only six times.Shamsheer Vayalil, a UAE-based Malayali entrepreneur, has promised a cash prize of ₹1 crore to the Kerala football team if they win the game.The MD of VPS Healthcare, Shamsheer is also the son-in-law of a billionaire businessman. Shamsheer took to Twitter to announce the reward.Team Kerala, all the best for today's #SantoshTrophyFinal. Happy to announce a cash prize of Rs. 1 crore if they lift this coveted trophy in Indian football. #ComeOnKerala pic.twitter.com/pdxfLnfzsP— Dr. Shamsheer Vayalil (@drshamsheervp) May 2, 2022West Bengal will try to exact revenge for the 2-0 defeat handed to them by Kerala in the group stage.The last time West Bengal and Kerala clashed in the final of the competition was during the 2017/18 season. Then Kerala had defeated Bengal 4-2 (2-2) on penalties to lift the trophy at the Salt Lake Stadium in Kolkata, West Bengal.West Bengal and Kerala have met on the field 31 times till date. Kerala won eight times while West Bengal stole the game away on 15 occasions. The remaining eight matches ended in draws.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 11:35:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/santosh-trophy-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Rohit Sharma behind Kuldeep Yadav’s resurgence, says spinner's childhood coach","link":"https://www.firstpost.com/firstcricket/sports-news/rohit-sharma-is-behind-kuldeep-yadavs-resurgence-says-spinners-childhood-coach-10625321.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Rohit Sharma behind Kuldeep Yadav’s resurgence, says spinner's childhood coach","content":"Delhi Capitals' new recruit Kuldeep Yadav has been making headlines with his consistent bowling performances for the franchise. The Chinaman has already scalped 17 wickets in nine games for the side including two four-fors.After being benched and then getting released by his former team (Kolkata Knight Riders), Kuldeep's resurgence story has come up as a perfect script and his childhood coach Kapil Dev Pandey is pretty satisfied with the \"opportunities\" that his ward has got in the DC camp.“Kuldeep thanks Delhi Capitals for providing him with this opportunity. Kuldeep is repaying Delhi’s trust in him. (Rishabh) Pant and (Ricky) Ponting provided Kuldeep with mental assistance,\" he said during an interaction with Times of India.The coach elaborated he has got free hand from both Rishabh Pant and Ricky Ponting to go out and express himself.“Kuldeep has been instructed by Ponting and Pant to go to the middle and express himself, and he is doing so. Ponting and Pant have backed Kuldeep completely. You receive more when your captain and coach support you. “How can I help you?” Pandey added.Pandey also credited Rohit Sharma and said the India skipper is the reason for Kuldeep's comeback as the spinner hadn't really got much of the chances in the past despite having wickets under his belt.“Whenever captains trusted him, Kuldeep delivered. He has a good record in Tests. He has two hat-tricks in ODIs. He has a good T20I record. But still, he didn’t get enough opportunities. This is really shocking. Kuldeep’s career is protected because of Rohit Sharma,\" Pandey said.“Rohit is the man behind Kuldeep’s resurgence. He is a fantastic captain and he knows how to find talent in a big group of players. Ahead of the IPL, Rohit called Kuldeep and gave him the chance (against the West Indies). Kuldeep delivered too by taking two wickets,” he added.The coach also said that when Virat Kohli was the captain of the side, he preferred Axar Patel because of his batting abilities.“Every captain has their own style of captaining and picking players. Kuldeep played a lot of cricket under Virat. Virat wants experience in the side. He went with Ashwin and Jadeja.\"“He preferred Axar ahead of Kuldeep because of Axar’s batting capabilities. A captain has to trust his players,” the coach said.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 11:33:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Kuldeep-Yadav-640-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"KKR vs RR Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Kolkata vs Rajasthan","link":"https://www.indiatvnews.com/sports/cricket/kkr-vs-rr-dream11-ipl-2022-fantasy-cricket-tips-dream-11-probable-playing-xi-for-kolkata-knight-riders-vs-rajasthan-royals-2022-05-02-773694","keywords":null,"creator":null,"video_url":null,"description":"KKR vs RR Dream11 IPL 2022: Fantasy Cricket Tips, Dream 11, Probable Playing XI for Kolkata Knight Riders vs Rajasthan Royals Match Details","content":null,"pubDate":"2022-05-02 10:48:37","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: 'Captain change, result change' — Twitter reacts as Dhoni-led CSK beat SRH","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-captain-change-result-change-twitter-reacts-as-dhoni-led-csk-beat-srh-10623501.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022: 'Captain change, result change' — Twitter reacts as Dhoni-led CSK beat SRH","content":"MS Dhoni was back at the helm for the Chennai Super Kings and with his arrival, the defending champions stamped their dominance as they beat the Sunrisers Hyderabad by 13 runs in Sunday's match.Ruturaj Gaikwad walked out to open with Devon Conway and the duo looked in imperious form. While Gaikwad stole the show with a breath-taking innings of 99, Devon Conway, after a slow start, kicked on with a brilliant 85 as they powered CSK to 202 for the loss of 2 wickets in the first innings.In response, the Sunisers Hyderabad got off to a flying start as they were on 46 at the end of 4 overs. They added 50 runs for the first wicket and this was when Mukesh Chaudhary brought CSK back in the contest as he got rid of Abhishek Sharma and Rahul Tripathi off consecutive deliveries.At the end of powerplay overs, SRH were at 58 for 2. MS Dhoni was in his elements as CSK snuck in few quite overs of spin in the middle phase. Aiden Markram and Nicholas Pooran kept the required rate in check and frequent boundaries kept SRH on track. However, Markram was dismissed by Mitchell Santner and then CSK was able to once again keep a lid on the scoring rate.In the final five overs, SRH needed 72 runs and a lot of focus was on Nicholas Pooran. Mukesh came back and got rid of Shashank Singh and Washington Sundar to end with 4 wickets as SRH needed 50 runs off the final 2 overs.Pooran reached his 50 off 29 deliveries, but the game was out of his reach and with two more sixes in the final over, he was able to reduce the margin of defeat for the SunRisers Hyderabad.This is how Twitter reacted to this win by CSK:Ravi Shastri was impressed with Ruturaj Gaikwad. Vinay Kumar praised the calmness of Ruturaj. Amit Mishra was hopeful Ruturaj will score more runs. Suresh Raina was happy with the dominant performance by CSK. Here are other reactions:  Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 10:43:46","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/MS-Dhoni-640-2.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket legend ‘dug my hole in Australia’","link":"https://www.cairnspost.com.au/sport/cricket/cricket-great-chris-cairns-opens-up-on-horrendous-matchfixing-trials/news-story/824a19ed9106f86fe8a0d1df8e35cb5c","keywords":["Cricket news and galleries","Sport news and galleries"],"creator":null,"video_url":null,"description":"New Zealand cricket great Chris Cairns feels he can talk candidly about the pain of match-fixing allegations brought against him now that he has survived multiple health scares.","content":null,"pubDate":"2022-05-02 10:33:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Explainer: How Real Madrid won a record 35th LaLiga title","link":"https://www.firstpost.com/sports/explainer-how-real-madrid-won-a-record-35th-laliga-title-10622501.html","keywords":["Sports"],"creator":["FP Explainers"],"video_url":null,"description":"Explainer: How Real Madrid won a record 35th LaLiga title","content":"With a comfortable win over Espanyol on the weekend, Real Madrid pulled off a record 35th LaLiga title. What makes the triumph even more special is the fact that they grabbed the silverware with four league matches – including a home game against crosstown rivals and last year’s champions Atletico Madrid – to go. This represents them with the opportunity to get the customary ‘Guard of Honours’ from their arch-rivals.However, the triumph was tougher than it seems as the season came up with its sets of issues and makes for a good review on how Madrid waved the storm to their third LaLiga title in six seasons.Return of Ancelotti as managerWith the departure of Zinedine Zidane at the culmination of the previous season, club president Florentino Perez turned to ‘the peacemaker’ Carlo Ancelotti to settle down a troubled Real locker room, which seemed distorted with Sergio Ramos’s departure and the presence of a rebel in Gareth Bale.@MrAncelotti #CAMPEON35 pic.twitter.com/9FKzWEHkfo— Real Madrid C.F. (@realmadrid) May 1, 2022To Ancelotti’s credit, the Italian tactician picked up from where Zidane and used the same core of players with pretty much the same style of play. Of course, there were some major reshuffles at the back but the front line and midfield had a familiar look.What Ancelotti, who won the much-awaited ‘La Decima’ (Club’s 10th Champions League title) in 2014, brought with him was his hunger for the league title as he missed out on it from a favourable position during his maiden season in charge of the club. The 62-year-old Italian, who has now won the title in all top five leagues of Europe, understood early into the season that star names Bale and Eden Hazard are unreliable and showed faith in indigenous talents in Marco Asensio and Lucas Vazquez, who made some telling contributions during the season. However, there was only one guy in the squad on whom Ancelotti could solely rely on bringing results when things go didn’t as per plan and that was Karim Benzema.Benzema turns a superstarPlaying in the shadow of Cristiano Ronaldo for the majority of his career, Benzema was always seen as the guy who sacrificed personal glory for the greater good. The 34-year-old French striker was impactful in the previous season as well with 30 goals in 46 games but those decisive goals in big matches were still lacking and kept him away from the superstar status.✅ 81 POINTS 25 WINS ⚽️ 73 GOALS SCORED 29 GOALS CONCEDED 40 POINTS AT HOME @Benzema TOP SCORERThe best stats from @realmadriden’s season!— LaLiga English (@LaLigaEN) May 1, 2022A smart No 9 like Benzema understood that well and came out a better version of himself in 2021-22 season. That has been reflected in his goal tally as he scored 42 goals in as many games so far while surpassing his previous league goal tally of 23 by three more strikes already. Turning more effective in the matches that mattered the most, the Frenchman scored 18 goals in his last 13 appearances. And for a change, he had a deputy in a Brazilian wunderkind, who finally quantified his performance to match the enormous quality he possessed.Vinicius Jr. comes of ageVinicius Junior dazzled Santiago Bernabeu with his trickery and street-smart football since he was signed by the club four years ago. However, he often came out as a headless chicken, who didn’t know when to leave the ball for his teammate or make that pass after taking out two-three defenders, even inside the box.To the club’s credit, they remained patient with their multi-million purchase and gave him the time to prosper. The 21-year-old Brazilian repaid the faith shown in him with a breakout season that saw him score 14 times so far to form the best-attacking trio with Benzema and Asensio (10 goals). But the potency in attack would have meant little if not for the side’s sturdy defence.Defensive stability despite Ramos and Varane's departureConceding just 29 goals in 34 games, Real Madrid's defence formed the second most successful defensive side in the league. In fact, the team only has to pat themselves for being so tight, especially after the departure of their club legend Sergio Ramos and Raphael Varane.¡DAVID ALABA, DAVID ALABA! @David_Alaba | #CAMPEON35 pic.twitter.com/6U1CcSgWNl— Real Madrid C.F. (@realmadrid) May 1, 2022Being second-placed Sevilla by just a goal in the goal-conceded chart, Real Madrid's defence never showed any frailties in the league campaign. The bulk of that praise falls on goalkeeper Thibaut Courtois, newly signed David Alaba and Brazilian defender Eder Militao. The trio often combined and more often than not put in solo shifts in some memorable efforts to save Real’s blushes, especially when defensive midfielder Casemiro didn’t have his best season.Youngsters bring competition in midfieldCasemiro's place in the squad isn't for granted anymore with the likes of Federico Valverde and Eduardo Camavinga chipping in. The young duo were crucial in bringing that agility and pace at the heart of Madrid’s game and were something that was found wanting in Madrid’s midfield. @lukamodric10 @Casemiro @ToniKroosA golden trident in the midfield of @realmadriden. #LaLigaSantander pic.twitter.com/aQH7NCupDI— LaLiga English (@LaLigaEN) May 1, 2022The likes of Luka Modric and Toni Kroos, who were often deemed slow and predictable, had to stretch their limits. As a result the 36-year-old Croatian midfield magician earned the cult status as a legend of the club with some brilliant performances. Kroos, who started off slowly, too returned to excellent form and had presented Ancelotti with the luxury of having options in the midfield when other departments were found short-staffed in quality.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 10:00:19","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/05/Real-madrid.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"When Dhoni lost his cool on Mukesh Choudhary but later complimented him","link":"https://telanganatoday.com/when-dhoni-lost-his-cool-on-mukesh-choudhary-but-later-complimented-him","keywords":["Cricket","IPL","News","Sport","Dhoni","Mukesh Choudhary"],"creator":["IANS"],"video_url":null,"description":"Pune: Chennai Supuer Kings skipper Mahendra Singh Dhoni was seen losing his cool on young pacer Mukesh Choudhary, who while bowling the last over in Sunrisers Hyderabad’s chase, sent down a wide ball. With hard-hitter Nicholas Pooran going great guns — the West Indian ended up smashing an unbeaten 64 off just 33 deliveries at a […]","content":"Pune: Chennai Supuer Kings skipper Mahendra Singh Dhoni was seen losing his cool on young pacer Mukesh Choudhary, who while bowling the last over in Sunrisers Hyderabad’s chase, sent down a wide ball. With hard-hitter Nicholas Pooran going great guns — the West Indian ended up smashing an unbeaten 64 off just 33 deliveries at a strike rate of nearly 194 — every ball was crucial, but Choudhary angled one towards the leg side of the batter, which unfortunately was called a wide by the umpire. Dhoni, who was leading CSK for the first time this season after Ravindra Jadeja stepped down following a string of unimpressive performances by the franchise, looked agitated as he supposedly gave instructions to Choudhary to bowl a proper line. Apparently, Dhoni wanted the pacer to bowl wide of the off-stump as the skipper had fortified the field placement on the off side. However, Choudhary, who emerged the most successful CSK bowler on the day, returning figures of 4-0-46-4 and halting Sunrisers’ charge of a 203-run winning target, said post-match that the skipper didn’t tell him “anything special” in the final over. “At the end, MS Dhoni didn’t tell me anything special about that last over. He just told me to bowl stump to stump, avoid no balls and not try anything fancy,” said Choudhary. Dhoni later compliment Choudhary for his bowling performance, saying, “It’s easy for us batsmen to criticise them (young bowlers) at times but there is a lot of pressure on them. Slowly once they get mature, that’s when they start soaking that pressure and want to be under the pump. “It’s good to see Mukesh (Choudhary) doing that for us. He took a few games, now he’s bowling well. You can get away with a lot of things in first-class cricket and age-group cricket. But over here you can’t really get away with too many things. You need to be consistent, need to know what you’re doing and accept the shortcomings. Unless you accept the shortcoming, the process of becoming strong in the areas you’re weak takes more time. So acceptance and honesty is the key,” added Dhoni.","pubDate":"2022-05-02 09:45:02","full_description":"Home | Cricket | When Dhoni Lost His Cool On Mukesh Choudhary But Later Complimented Him When Dhoni lost his cool on Mukesh Choudhary but later complimented him By IANS Published: Published Date - 03:15 PM, Mon - 2 May 22 Pune: Chennai Supuer Kings skipper Mahendra Singh Dhoni was seen losing his cool on young pacer Mukesh Choudhary, who while bowling the last over in Sunrisers Hyderabad’s chase, sent down a wide ball. With hard-hitter Nicholas Pooran going great guns — the West Indian ended up smashing an unbeaten 64 off just 33 deliveries at a strike rate of nearly 194 — every ball was crucial, but Choudhary angled one towards the leg side of the batter, which unfortunately was called a wide by the umpire. Dhoni, who was leading CSK for the first time this season after Ravindra Jadeja stepped down following a string of unimpressive performances by the franchise, looked agitated as he supposedly gave instructions to Choudhary to bowl a proper line. Apparently, Dhoni wanted the pacer to bowl wide of the off-stump as the skipper had fortified the field placement on the off side. However, Choudhary, who emerged the most successful CSK bowler on the day, returning figures of 4-0-46-4 and halting Sunrisers’ charge of a 203-run winning target, said post-match that the skipper didn’t tell him “anything special” in the final over. “At the end, MS Dhoni didn’t tell me anything special about that last over. He just told me to bowl stump to stump, avoid no balls and not try anything fancy,” said Choudhary. Dhoni later compliment Choudhary for his bowling performance, saying, “It’s easy for us batsmen to criticise them (young bowlers) at times but there is a lot of pressure on them. Slowly once they get mature, that’s when they start soaking that pressure and want to be under the pump. “It’s good to see Mukesh (Choudhary) doing that for us. He took a few games, now he’s bowling well. You can get away with a lot of things in first-class cricket and age-group cricket. But over here you can’t really get away with too many things. You need to be consistent, need to know what you’re doing and accept the shortcomings. Unless you accept the shortcoming, the process of becoming strong in the areas you’re weak takes more time. So acceptance and honesty is the key,” added Dhoni. Follow Us : Tags Dhoni Mukesh Choudhary Related News IPL 2022: Dominant Chennai Super Kings down Sunrisers Hyderabad Does MSD’s reputation as finisher demoralise the bowlers? Hogg convinced it does IPL 2022: Wishes pour in as Dhoni finishes things off in style against MI Dhoni wants to groom Jadeja as future India captain: Danish Kaneria Dhoni to be seen in new age graphic novel ‘Atharva – The Origin’ Dhoni is one of the sharpest cricket minds I have encountered: Greg Chappell","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Shami told Mohsin that he is better than him, says coach - The Indian Express","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9zcG9ydHMvaXBsL2lwbC0yMDIyLWxzZy1zaGFtaS10b2xkLW1vaHNpbi10aGF0LWhlLWlzLWJldHRlci10aGFuLWhpbS1zYXlzLWNvYWNoLTc4OTc1NjEv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Shami told Mohsin that he is better than him, says coach  The Indian ExpressMohsin has delivered from the get go, has both pace & variations: Lisa Sthalekar  CricbuzzIPL 2022: Mohammad Shami Told Mohsin Khan That He Is Better Than Him, Says Coach  Cricket AddictorFully-loaded performer: Mohsin Khan  ESPNcricinfoMohsin Khan rides IPL fast-track to spotlight  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-05-02 09:44:46","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, Purple Cap: Yuzvendra Chahal, Kuldeep Yadav in race to grab Purple Cap","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-purple-cap-yuzvendra-chahal-kuldeep-yadav-in-race-to-grab-purple-cap-10624341.html","keywords":["First Cricket News"],"creator":["FP Trending"],"video_url":null,"description":"IPL 2022, Purple Cap: Yuzvendra Chahal, Kuldeep Yadav in race to grab Purple Cap","content":"Thanks to the true pitches in all four venues - MCA Stadium in Pune, Brabourne Stadium in Mumbai, DY Patil Sports Complex in Navi Mumbai and Wankhede Stadium in Mumbai - the seamers have had a great time in IPL 2022 so far. So much that six out of 10 in the current Purple Cap list for the highest wicket-taker of the season are genuine fast bowlers.The likes of Umran Malik, Umesh Yadav, T Natarajan, and Mohammed Shami have really enjoyed the pace and bounce at disposal in the four venues in Maharashtra.That, however, doesn't mean that the spinners haven't had their share. They in fact are ruling the top five. Three of them are in the top five with Yuzvendra Chahal and Kuldeep Yadav leading the pack.The Rajasthan Royals leg-spinner has already taken 19 wickets in 9 matches at a staggering average of 13.68. His India teammate Kuldeep Yadav, who represents the Delhi Capitals now, may have said that he wants Chahal to finish as the Purple Cap winner of the 15th edition of the Indian Premier League with all his heart but he himself has performed exceedingly well this year to emerge as a genuine contender.Yadav is number two on the list with 17 wickets in 9 matches. It has been quite a turnaround for someone who had played no matches last year and got only five in the previous edition.At number 3 in the Purple Cap list is SRH medium pacer T Natarajan. The left-arm seamer has had a great comeback this year after missing most of the last edition due to an injury. Natarajan has also taken 17 wickets in 9 matches but is behind Kuldeep based on a higher economy rate than the left-arm wrist spinner.RCB's Sri Lankan spinner Wanindu Hasaranga, with 15 wickets in 10 matches at an economy rate of 8.02, is currently at No. 4.Umran Malik, the toast of the nation, is in the fifth spot. SRH's decision to show immense faith in the tearaway quick and retain him has paid rich dividends. The right-arm seamer from Jammu and Kashmir, who recently bowled the fastest delivery of the IPL at 154 km/h, has scalped 15 wickets in 9 matches so far.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 09:08:52","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Chahal-Sportzpics-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: How players have fared against their former teams","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2022-how-players-have-fared-against-their-former-teams-10624491.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2022: How players have fared against their former teams","content":"The Indian Premier League (IPL) franchises fired on all cylinders ahead of the 2022 season and spent big amount of money during the mega auctions. There was plenty of movement before the first name went under the hammer and some leading players shifted base, mostly to the newer teams. The ones which didn't attract interest from the teams ahead of the auctions, triggered bidding wars during the two-day mega auction. We now take a look at how the players who had shifted bases have fared so far against their former teams:Kuldeep Yadav (Delhi Capitals) vs KKRDelhi Capitals probably made one of the finest decisions when they included Kuldeep Yadav in the side during the mega auctions. After being benched and then released by his former franchise KKR, the chinaman bowler has left a huge impression while donning the DC jersey.In 9 matches that he has played for the Capitals, Kuldeep has scalped 17 wickets so far, including a couple of four-wicket hauls.Incidentally, both of his four-fers have come against the Knight Riders. In the first game against KKR, Kuldeep returned with figures of 4/35. DC won that match by 44 runs after bundling out KKR for 171 while chasing a target of 216.In the second game that was held at Wankhede Stadium, the spinner had figures of 4/14 in three overs. After restricting the Knight Riders at 146/9 in 20 overs, DC chased down the target with four wickets in hand.Yuzvendra Chahal (Rajasthan Royals) vs RCBAfter being released by the Royal Challengers Bangalore, Yuzvendra Chahal was picked by Rajasthan Royals in the mega auctions. Chahal has been one of the most consistent players for his new team.The leg-spinner has faced his former team RCB twice in the competition so far and has had a decent outing on both the occasions. While he returned with a couple of wickets at the cost of 15 runs in 4 overs in the first clash at Wankhede Stadium, he didn’t pick any wickets in the second match in Pune but only gave 23 runs in 4 overs.RCB though won the first match by 4 wickets after chasing down a target of 170 runs but the Royals made it 1-1 with a 29-run win in the second. The Bangalore side was bowled out for 115 while chasing 145 in that encounter.KL Rahul (Lucknow Super Giants) vs Punjab KingsLucknow Super Giants had roped in KL Rahul as the captain of the side and the decision has certainly turned out to be a great one for the team so far. Lucknow are presently sitting at number two spot in the points and are now nearing a spot in the playoffs.Moreover, skipper KL Rahul has been in sublime touch after he has already notched up a couple of tons and as many fifties in a span of 10 games and has scored over 450 runs.While KL has been scoring runs, the right-hander who had earlier played for Punjab Kings, failed to leave a mark during the match against his former franchise in Pune.He only managed to score 6 off 11 deliveries as LSG put up 153/8 in 20 overs. The bowlers led from the front in the tight defence but runs didn't quite come from Rahul against a team led by his good friend Mayank Agarwal.Krunal Pandya (LSG)Lucknow Super Giants bought Krunal Pandya during the mega auctions and the left-handed all-rounder has come pretty handy for the side, particularly with the ball.Krunal has played two matches against his former team, Mumbai Indians and had a good outing especially in the second clash.The two sides first met at Brabourne Stadium where LSG posted 199/4 in 20 overs and then restricted MI to 181/9 to win the match by 18 runs. Pandya remained unbeaten at 1 off 1 and returned with figures of 0/16 in two overs. But the left-hander then made a strong comeback in the second match as he scalped three wickets for 19 runs in 4 overs. LSG won that match by 36 runs after restricting MI to 132/8 while chasing 169 at Wankhede Stadium.Rashid Khan (GT) vs SRHThe Afghanistan spinner Rashid Khan had been an important member of the Sunrisers Hyderabad setup for quite sometime before he was eventually released by the franchise.The right-arm bowler was then included by the Gujarat Titans. Rashid has played two games against his former team, SRH and has managed to pick only one wicket.In the first clash, the spinner returned with figures of 1/28 in 4 overs but his efforts couldn’t really help the side as SRH chased down the target of 163 with five balls to spare at DY Patil Stadium.The two sides then returned for the clash at Wankhede Stadium where Rashid leaked some runs as he gave away 45 in overs but compensated it with an unbeaten 31 off 11 balls as GT went over the line with five wickets in hand.Shreyas Iyer (KKR) vs DCShreyas Iyer changed his base from Delhi Capitals to Kolkata Knight Riders and the franchise handed him the captaincy as well. Iyer struggled with the bat a bit in the starting but returned back to form in a decent manner and showed intent against his former team. While he scored 54 in the first clash at Brabourne Stadium, Shreyas notched up 42 at Wankhede Stadium. Both of his knocks came in a losing cause.Read all the Latest News, Trending News, Cricket News, IPL Live Score, IPL 2022 schedule, IPL 2022 Points table and Entertainment News. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-05-02 09:04:39","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/04/Kuldeep-Yadav-continued-to-haunt-his-former-side-KKR-as-he-again-picked-a-four-for-to-break-the-backbone-of-their-batting-order.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"}]}