{"newsArray":[{"title":"INDW vs PAKW T20 2022 records: IND W vs PAK W head to head record in T20 history","link":"https://thesportsrush.com/cricket-news-indw-vs-pakw-t20-2022-records-ind-w-vs-pak-w-head-to-head-record-in-t20-history/","keywords":["Cricket","India","Pakistan","Women's Asia Cup 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"IND W vs PAK W head to head: The SportsRush presents for you the Head to Head statistics for IND-W vs PAK-W T20I. The 13th match of the ongoing Women’s Asia Cup 2022 will be played between India Women and Pakistan Women today. A high-profile contest between arch rivals will be their second Women’s T20I… The post INDW vs PAKW T20 2022 records: IND W vs PAK W head to head record in T20 history appeared first on The SportsRush.","content":"IND W vs PAK W head to head: The SportsRush presents for you the Head to Head statistics for IND-W vs PAK-W T20I. The 13th match of the ongoing Women’s Asia Cup 2022 will be played between India Women and Pakistan Women today. A high-profile contest between arch rivals will be their second Women’s T20I of 2022. It was during Commonwealth Games 2022 Women’s Cricket Competition just over a couple of months ago when India had defeated Pakistan comprehensively by 8 wickets at Edgbaston. In fact, India have won all their last five Women’s T20Is against Pakistan to have a phenomenal overall head-to-head record. As far as Asia Cup 2022 standings are concerned, both the teams will be playing their fourth league match in a few hours from now. While India are the table-toppers on the back of three wins in as many matches, Pakistan are at the second position after recently losing against Thailand. ALSO READ: Pitch report of Sylhet International Cricket Stadium for India vs Pakistan Women’s Asia Cup 2022 match Scheduled to face each other in Sylhet after eight and a half years, it doesn’t need to be told that the match will be followed across the globe. IND W vs PAK W head to head record in T20 history Total number of matches played: 12 Matches won by IND-W: 10 Matches won by PAK-W: 2 Matches played in Bangladesh: 1 (IND-W 1, PAK-W 0) Matches played at neutral venues: 11 (IND-W 10, PAK-W 1) Matches played at Sylhet International Cricket Stadium: 1 (IND-W 1, PAK-W 0) IND-W average score against PAK-W: 108.6 PAK-W average score against IND-W: 95.8 Most runs for IND-W: 170 (Smriti Mandhana) Most runs for PAK-W: 148 (Bismah Maroof) Most wickets for IND-W: 3 (Harmanpreet Kaur) Most wickets for PAK-W: 8 (Nida Dar) Most catches for IND-W: 8 (Harmanpreet Kaur) Most catches for PAK-W: 3 (Bismah Maroof, Javeria Khan and Nida Dar) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post INDW vs PAKW T20 2022 records: IND W vs PAK W head to head record in T20 history appeared first on The SportsRush.","pubDate":"2022-10-07 01:49:53","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sandeep arrested on rape charges","link":"https://www.thenews.com.pk/print/997772-sandeep-arrested-on-rape-charges","keywords":null,"creator":null,"video_url":null,"description":"Ag AFPKATHMANDU: Cricket star Sandeep Lamichhane returned to Nepal and was immediately arrested on Thursday, nearly a month after a court issued a warrant over the alleged rape of a 17-year-old girl.Lamichhane, a poster boy for the growing popularity of cricket in Nepal, was taken into custody...","content":null,"pubDate":"2022-10-07 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Danish hits double century as Sindh beat Northern","link":"https://www.thenews.com.pk/print/997768-danish-hits-double-century-as-sindh-beat-northern","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Danish Aziz’s unbeaten double century led Sindh to a five-wicket win over Northern on the final day of their second round four-day fixture of the Cricket Associations Championship here at the UBL Sports Complex on Thursday.Meanwhile, Balochistan defeated Central Punjab by 43 runs...","content":null,"pubDate":"2022-10-07 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Pretorius out of T20 World Cup","link":"https://www.thenews.com.pk/print/997765-pretorius-out-of-t20-world-cup","keywords":null,"creator":null,"video_url":null,"description":"LUCKNOW: South Africa’s Dwaine Pretorius has been ruled out of the ongoing One-day International series in India and the Twenty20 World Cup with a broken thumb, the country’s cricket board said on Thursday.The bowling all-rounder sustained the injury during the third T20 on Tuesday,...","content":null,"pubDate":"2022-10-07 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Thailand stun Pakistan in Women Asia Cup","link":"https://www.thenews.com.pk/print/997767-thailand-stun-pakistan-in-women-asia-cup","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Thailand beat Pakistan by four wickets to hand Pakistan their first loss in the ACC Women’s T20 Asia Cup at the Sylhet International Cricket Stadium on Thursday morning.Pakistan bowlers bowled well but failed to stop Thailand from reaching the modest 117-run target. Thailand chased...","content":null,"pubDate":"2022-10-07 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"ICC Cricket World Cup Super League points table (Updated) as on October 6 after IND vs SA 2022 1st ODI","link":"https://www.sportskeeda.com/cricket-news/news-ind-vs-sa-2022-icc-cricket-world-cup-super-league-points-table-updated-october-6?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Vinay Chhabria"],"video_url":null,"description":null,"content":null,"pubDate":"2022-10-06 20:31:44","image_url":"https://static.sportskeeda.com/editor/2022/10/3e893-16650772313472-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: \"I don't think India are necessarily favorites or playing the best cricket\" - Steve Harmison","link":"https://www.sportskeeda.com/cricket-news/news-t20-world-cup-2022-i-think-india-necessarily-favorites-playing-best-cricket-steve-harmison?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket News"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Former cricketer Steve Harmison believes Australia and England have the potential to trouble India in the T20 World Cup 2022 , starting on October 16. While Harmison feels the Men in Blue have plenty of match-winners, he thinks they are not playing the best cricket. Australia, the defending champions and hosts, clinched their maiden crown last year, beating New Zealand by eight wickets in Dubai. India, on the other hand, look like a formidable unit and have won their last seven out of eight bilateral T20I series. Speaking to OnlineCricketBetting, Harmison stated that the format's unpredictability means any team can win on their day based on individual brilliance. The former pacer also feels that Australia, New Zealand, India, England, and Pakistan have plenty of match-winners. He said: The former Durham seamer continued: England, who led their white-ball revolution in 2015, recently won the seven-match T20I series in Pakistan, getting their preparations back on track. In contrast, Pakistan have struggled, losing the Asia Cup final against Sri Lanka, followed by the T20 rubber to England. Harmison also claimed that collective performances can only win a team an ICC event and backed England to do the same. He added: England were one of the most dominant sides in last year's edition before losing to New Zealand in the semi-finals. Poll : 0 votes Quick Links","pubDate":"2022-10-06 20:31:44","image_url":"https://static.sportskeeda.com/editor/2022/10/2fee6-16650814428811-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranchi Stadium pitch report: IND vs SA 2nd ODI pitch report JSCA International Stadium Complex","link":"https://thesportsrush.com/cricket-news-ranchi-stadium-pitch-report-ind-vs-sa-2nd-odi-pitch-report-jsca-international-stadium-complex/","keywords":["Cricket","JSCA Stadium","ranchi","South Africa tour of India 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ranchi Stadium pitch report: The JSCA Stadium in Ranchi has hosted a total of four One-Day Internationals till date. Team India fell agonizingly short of chasing the South African total down by 9 runs, during the first of the three-match ODI series against South Africa at Lucknow, and will be expected to quickly shrug-off the… The post Ranchi Stadium pitch report: IND vs SA 2nd ODI pitch report JSCA International Stadium Complex appeared first on The SportsRush.","content":"Ranchi Stadium pitch report: The JSCA Stadium in Ranchi has hosted a total of four One-Day Internationals till date. Team India fell agonizingly short of chasing the South African total down by 9 runs, during the first of the three-match ODI series against South Africa at Lucknow, and will be expected to quickly shrug-off the disappointment, as they will travel to the capital city of Jharkhand next, to play the second ODI in a couple of days time, at the Jharkhand State Cricket Association Stadium. Team India have now lost four consecutive ODI matches against the Proteas, having lost the three-match away series 0-3 earlier this year as well. Having said that, there were quite a few positives as well for the side in the batting department. While Shreyas Iyer continued with his brilliant run-of form in the format of-late with a quick fire fifty under pressure, wicket-keeper batter Sanju Samson yet again proved why he is such a highly-rated batter, as he almost steered the ship towards victory. Also, the contribution of Shardul Thakur-the batter, after having also impressed earlier with the ball as well , was yet another positive takeaway, as the team will now look to level the series in Ranchi on Sunday. Ranchi Stadium pitch report The JSCA stadium in Ranchi hosted its last ODI back in March 2019, when Australia got the better of the Indian side by 32 runs, despite Virat Kohli smashing a century (123 off 95) while chasing the target of 314 runs. The Ranchi pitch has over the years been more suited for the batters, with the average first innings score during the four ODIs which have taken place at this venue being 253.5 runs. As for the bowlers, the spinners are likely to come into the game right away with the semi-new ball, as the pitch will grip and turn for them, more or less akin the first ODI pitch at Lucknow. Seamers, on the other hand, are less likely to get much significant purchase off the deck, with little or no movement likely on offer. All in all, expect the batters from both the sides to have a day out on Sunday, with a 300+ run-chase likely on the cards. The post Ranchi Stadium pitch report: IND vs SA 2nd ODI pitch report JSCA International Stadium Complex appeared first on The SportsRush.","pubDate":"2022-10-06 19:13:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Shreyas Iyer last 10 innings in ODI: Shreyas Iyer last 10 ODI innings full list","link":"https://thesportsrush.com/cricket-news-shreyas-iyer-last-10-innings-in-odi-shreyas-iyer-last-10-odi-innings-full-list/","keywords":["Cricket","India","shreyas iyer","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Shreyas Iyer last 10 innings: The Indian vice-captain counterattacked from the word go under testing circumstances tonight. India fell short by 9 runs in the recently concluded first ODI against South Africa in Lucknow. However, a valiant batting performance will be remembered for vice-captain Shreyas Iyer (50) and wicket-keeper batter Sanju Samson (86*) scoring fighting… The post Shreyas Iyer last 10 innings in ODI: Shreyas Iyer last 10 ODI innings full list appeared first on The SportsRush.","content":"India fell short by 9 runs in the recently concluded first ODI against South Africa in Lucknow. However, a batting performance will be remembered for vice-captain Shreyas Iyer (50) and wicket-keeper batter Sanju Samson (86*) scoring fighting individual half-centuries. Not among the biggest of partnerships by any angle but a 54-ball 67-run fifth-wicket partnership broke the shackles at a time when India had slipped into a shell. With neither of their Top Four batters striking at more than 55, it was Iyer who was brave enough to play his shots from the word go. It was at that exact time that South African spinners, Keshav Maharaj in particular, were making full use of the conditions by turning the ball square at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium. Realizing the demand at hand with needing to score around nine runs per over, a courageous Iyer stepped out of his crease to hit Tabraiz Shamsi for a boundary down the ground. A rally of boundaries followed soon as the right-handed batter hit six of them on the next 13 balls that he faced. An array of shots, including a couple of lucky ones, saw Iyer dominating both Shamsi and pacer Lungi Ngidi. Iyer, who hit a total of eight fours at a strike rate of 135.13 in his 50 (37), reminded one of his counterattacking in India vs Sri Lanka second Test match on a rank turner in Bengaluru earlier this year. In some form this year especially in this format, Iyer has scored 370 runs in his last 10 ODI innings at an average and strike rate of 37 and 91.35 respectively. As far as 2022 is concerned, Iyer’s 345 runs have come at an average and strike rate of 43.12 and 92 respectively. In what was Iyer’s 12th ODI half-century tonight, it was his sixth at home, fourth in 2022, third under Shikhar Dhawan (4) and at No. 5 and first against South Africa.","pubDate":"2022-10-06 18:52:31","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“David Miller and Heinrich Klaasen Played Positively, Stung Together A Partnership And Took Us To A Good Score”- Temba Bavuma After Winning 1st ODI Against India","link":"https://www.thetimesofbengal.com/sports/david-miller-and-heinrich-klaasen-played-positively-stung-together-a-partnership-and-took-us-to-a-good-score-temba-bavuma-after-winning-1st-odi-against-india/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"South African Cricket Team grabbed an invaluable 10 Super League Points. South Africa won the match by 9 runs only but they were in control of the match and made a statement that they are not finished yet in the ODI format. The match was a rain-affected one due to which the contest was 40 […]","content":"South African Cricket Team grabbed an invaluable 10 Super League Points. South Africa won the match by 9 runs only but they were in control of the match and made a statement that they are not finished yet in the ODI format. The match was a rain-affected one due to which the contest was 40 overs per side. Temba Bavuma once again struggled to get some significant runs under his belt. The management’s decision to make him bat at the No.3 position didn’t work quite well. The pitch was by no means easy and as we all know the batter needs time to get his eye in the middle. Temba Bavuma. Pic Credits: Twitter The skipper was spot-on with his captaincy as he rotated his bowlers quite well. The batter needs to be patient as we all have seen that he has tasted success against big teams. The Proteas would be aware that changing captain at this moment can be risky. Temba Bavuma would be hoping that the team continues this winning momentum; at the same time, they should not get complacent as losing two back-to-back games won’t take any time as India would be well prepared for any challenge. A Good fight at the end – Temba Bavuma During the post-match presentation, the Skipper Temba Bavuma was asked about the nail-biting thriller. “A good fight at the end, obviously Sanju pushed us at the end, but the boys stood firm and took us to the win.” David Miller and Heinrich Klaasen played Positively- Temba Bavuma “There wasn’t much grass on the surface, we lost a couple of wickets in the middle overs, myself and Aiden (Markram), but the boys knuckled down. Miller and Klaasen played positively, stung together a partnership, and took us to a good score.” David Miller and Heinrich Klaasen. Pic Credits: Twitter I thought We Lost Our Way In the Middle Overs- Temba Bavuma “Bowling upfront was good, in the first 15 overs by KG and Parnell. I thought we lost our way in the middle overs, and gave away far too many runs, but in the end, the result did go our way and I’m happy with that.” Also Read: Watch: Shardul Thakur Knocks Over Struggling Temba Bavuma With A Jaffa In IND vs SA 1st ODI !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 18:19:26","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"“Valiant effort from Sanju Samson”: Virender Sehwag praises Sanju Samson for his top-notch innings while chasing vs South Africa during Lucknow ODI","link":"https://thesportsrush.com/cricket-news-valiant-effort-from-sanju-samson-virender-sehwag-praises-sanju-samson-for-his-top-notch-innings-while-chasing-vs-south-africa-during-lucknow-odi/","keywords":["Cricket","Sanju Samson","South Africa tour of India 2022","Virender Sehwag"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Virender Sehwag praises Sanju Samson for his exemplary innings which ended in a losing cause versus South Africa during the first ODI. During the first ODI between India and South Africa at The Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow, a Sanju Samson master class with the bat forced the crowd to stand up… The post “Valiant effort from Sanju Samson”: Virender Sehwag praises Sanju Samson for his top-notch innings while chasing vs South Africa during Lucknow ODI appeared first on The SportsRush.","content":"Virender Sehwag praises Sanju Samson for his exemplary innings which ended in a losing cause versus South Africa during the first ODI. During the first ODI between India and South Africa at The Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow, a Sanju Samson master class with the bat forced the crowd to stand up on their feet in awe, despite team India bowing down in the contest by 9 runs. En route the target of 250 in 40 Overs, team India had to bear the brunt of a sluggish start provided by its top-order batters, which breached the 50-run mark as late as the 18th Over. WATCH: Kuldeep Yadav dismisses Aiden Markram with a classical leg-spinner’s delivery The pair of debutant Ruturaj Gaikwad (19 off 42) and Ishan Kishan (20 off 37) were troubled by some immaculate line and length bowling from the Proteas bowlers, who were further assisted with more than decent help from the pitch as well. The duo did stitch together a 40-run partnership for the third wicket, but chew up quite a many deliveries (69) in the process, with the required run-rate skyrocketing past every Over. Virender Sehwag praises Sanju Samson However, Sanju Samson then managed to stitch a couple of quick fire partnerships – worth 67 runs off mere 54 deliveries alongside Shreyas Iyer (50 off 37) for the fifth wicket, and then for the sixth wicket with Shardul Thakur (33 off 31) constituting 93 runs off mere 66 deliveries, to stage a staggering comeback into the chase. However, with India batting with a long tail, things went down South post Thakur’s dismissal, ultimately leaving Samson with 30 runs to hit off the last Over. The Kerala batter gave his all right till the end, as she smashed Tabraiz Shamsi for a Six and three Fours in the final Six deliveries, but agonizingly fell short of the target the moment he failed to mistime the fourth delivery. Former India batter Virender Sehwag, took to his social media handle to praise Samson’s valiant knock of 86 runs in mere 63 deliveries (9 x Fours, 3 x Sixes) That was a valiant effort from Sanju Samson. Tough luck but a very high quality innings. — Virender Sehwag (@virendersehwag) October 6, 2022 Team India will play the next ODI against South Africa at the JSCA International Stadium in Ranchi on October 9. The post “Valiant effort from Sanju Samson”: Virender Sehwag praises Sanju Samson for his top-notch innings while chasing vs South Africa during Lucknow ODI appeared first on The SportsRush.","pubDate":"2022-10-06 18:09:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs SA: The Way Shreyas, Samson And Shardul Batted Was Excellent – Shikhar Dhawan After 9-run Loss To South Africa In 1st ODI","link":"https://www.thetimesofbengal.com/sports/ind-vs-sa-the-way-shreyas-samson-and-shardul-batted-was-excellent-shikhar-dhawan-after-9-run-loss-to-south-africa-in-1st-odi/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"India National Cricket Team under the leadership of Shikhar Dhawan lost by 9 runs against Temba Bavuma’s South Africa National Cricket Team in the ODI series opener at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow on Thursday, October 6. India won the toss and invited South Africa to bat first in […]","content":"India National Cricket Team under the leadership of Shikhar Dhawan lost by 9 runs against Temba Bavuma’s South Africa National Cricket Team in the ODI series opener at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow on Thursday, October 6. India won the toss and invited South Africa to bat first in the match. The Proteas posted a score of 249/4 on the board while batting first. Opener Quinton de Kock scored good 48 runs off 54 balls. Also, David Miller and Heinrich Klaasen had an unbeaten 138-run partnership in 103 balls. Heinrich Klaasen smashed 74 runs off 64 balls and David Miller scored 75 runs off 63 balls. David Miller and Heinrich Klaasen. Pic Credits: Twitter ICC Teams Rankings | ICC Players Rankings Chasing the target, Shikhar Dhawan, Shubman Gill, Ishan Kishan and Ruturaj Gaikwad all failed to make any good contributions with the bat. Shreyas Iyer and Shardul Thakur batted brilliantly while wicketkeeper-batter Sanju Samson played an absolutely stunning knock. Iyer smashed 50 runs, Thakur scored 33 runs and the star wicketkeeper-batter Samson smashed a terrific 86* runs off 63 balls, including 9 fours and 3 sixes. However, Samson didn’t get much support from the tailenders and India faced a defeat in the match. We gave away too many runs on a wicket that swung and spun – Shikhar Dhawan Shikhar Dhawan. (Photo: Twitter) During the post-match presentation ceremony, Shikhar Dhawan said that he is proud of the way players played in the match. He especially showered praise on Shreyas Iyer, Sanju Samson and Shardul Thakur for their brilliant batting performances in the match. He said: “Quite proud of the way the boys played the game, we didn’t get a good start, but the way Shreyas, Samson and Shardul batted was excellent.” Shikhar Dhawan admitted that the bowlers leaked too many runs and the fielding of the side was also poor. He said: “We gave away too many runs on a wicket that swung and spun, the fielding wasn’t great, but this was a good learning experience for us.” Sanju Samson. (Photo: Twitter) Also Read: IND vs SA: The ODI Series Will Boost T20 World Cup Standby Players In Getting Into A Groove: Shikhar Dhawan Get All Cricket match prediction and fantasy Tips – CLICK HERE Cricket Match Prediction | T20 World Cup Match Prediction | Today Match Fantasy Prediction | Fantasy Cricket Tips | Cricket News and Updates | Cricket Live Score !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 18:03:28","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Hannans primed for EGCA title defence","link":"https://thewest.com.au/news/kalgoorlie-miner/hannans-primed-for-egca-title-defence-c-8465824","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Xavier Bochat to coach Hannans for first half of 2022-23 Eastern Goldfields Cricket Association season.","content":null,"pubDate":"2022-10-06 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8465824/71ae2644d47f4f0da800dfa25cdd2865cfa4ca62-16x9-x0y209w4000h2250.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket-S Africa beat India despite Samson blitz in Lucknow","link":"https://www.thestar.com.my/sport/cricket/2022/10/07/cricket-s-africa-beat-india-despite-samson-blitz-in-lucknow","keywords":null,"creator":null,"video_url":null,"description":"NEW DELHI (Reuters) - South Africa survived Sanju Samson's late onslaught to beat a depleted India by nine runs in the rain-affected opening one-day international in Lucknow on Thursday. Read full story","content":null,"pubDate":"2022-10-06 17:52:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Twitter Reacts As Sanju Samson’s Valiant Effort Goes In Vain And South Africa Register 9-Run Win Over India In 1st ODI In Lucknow","link":"https://www.thetimesofbengal.com/sports/twitter-reacts-as-sanju-samsons-valiant-effort-goes-in-vain-and-south-africa-register-9-run-win-over-india-in-1st-odi-in-lucknow/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"The first ODI of the three-match ODI series between Shikhar Dhawan-led India National Cricket Team and Temba Bavuma-led South Africa National Cricket Team, which is part of the ongoing South Africa tour of India 2022, was played at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow on Thursday, October 6. South Africa […]","content":"The first ODI of the three-match ODI series between Shikhar Dhawan-led India National Cricket Team and Temba Bavuma-led South Africa National Cricket Team, which is part of the ongoing South Africa tour of India 2022, was played at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow on Thursday, October 6. South Africa National Cricket Team won by 9 runs against India National Cricket Team in the ODI series opener to take a 1-0 lead and bag crucial ICC World Cup Super League points. ICC Teams Rankings | ICC Players Rankings Earlier, there was a delay in the commencement of the play due to the rain in the city and it became a 40-overs-per-side contest. India National Cricket Team won the toss and opted to bowl first in the match. Batter Ruturaj Gaikwad and leg-spinner Ravi Bishnoi made their ODI debuts for India. On the other hand, Heinrich Klaasen, Janneman Malan and Tabraiz Shamsi were back in South Africa playing XI for the ODI game. Quinton de Kock. Pic Credits: Twitter Quinton de Kock and Janneman Malan opened the innings for the Proteas and batted cautiously. They looked decent out in the middle and had a 49-run stand in 73 balls before pace bowler Shardul Thakur cleaned up Janneman Malan for 22 in the 13th over. Soon, Shardul also castled skipper Temba Bavuma for 8 in the 15th over with an absolute jaffa. In the very next over, left-arm wrist spinner Kuldeep Yadav castled Aiden Markram for a 5-ball duck with an absolutely incredible delivery. Meanwhile, wicketkeeper-batter Quinton de Kock fell just 2 runs short of a half-century as he got out LBW at the score of 48. His Lucknow Super Giants (LSG) teammate in the Indian Premier League (IPL), leg-spinner Ravi Bishnoi, was the one to bag his wicket. David Miller and Heinrich Klaasen. Pic Credits: Twitter Then, David Miller and Heinrich Klaasen displayed a batting masterclass. Both the batters looked in good touch against Indian bowlers and they batted with a good strike rate. They had an unbeaten 138-run partnership in 103 balls. Heinrich Klaasen smashed 74 runs off 64 balls and David Miller scored 75 runs off 63 balls. In the end, the Proteas posted 246 for 4. During the run-chase, Indian openers – Shubman Gill and Shikhar Dhawan – got out after scoring just 3 and 4 runs respectively. Debutant Ruturaj Gaikwad batted awfully and scored 42-ball 19 while Ishan Kishan scored poor 20 runs off 37 balls. Meanwhile, the 27-year-old Shreyas Iyer played one of his best knocks in international cricket. He smashed fantastic 50 runs off 37 balls, including 8 fours. Sanju Samson ( PC Twitter) Then, Sanju Samson and Shardul Thakur had a brilliant 93-run partnership in 66 balls, before the latter was cleaned up by Lungi Ngidi for 33. In the end, wicketkeeper-batter Sanju Samson played an outstanding knock and smashed 4 boundaries in the last over when India needed 30 runs off 6 balls to win. However, his efforts were not enough and India faced defeat in the match. The star wicketkeeper-batter smashed 86 runs off 63 balls, including 9 fours and 3 sixes. Here’s How Twitter Reacted To The ODI Series Opener Between India and South Africa: Top stuff @IamSanjuSamson almost pulled it towards us .. Good luck going forward team India .. well played @ProteasMenCSA #INDvsSA — Harbhajan Turbanator (@harbhajan_singh) October 6, 2022 What a gritty player he is, an innings to remember. Sadly couldn’t take India home but the intent @IamSanjuSamson showed was just amazing to see. #IndvSA pic.twitter.com/KEWha7sWno — Amit Mishra (@MishiAmit) October 6, 2022 That was a valiant effort from Sanju Samson. Tough luck but a very high quality innings. — Virender Sehwag (@virendersehwag) October 6, 2022 Well played Sanju Samson. Hard luck for now winning the game — Irfan Pathan (@IrfanPathan) October 6, 2022 Top class from sanju Samson, very aggressive, very impressive, you deserve the applause!! @IamSanjuSamson — Mohammad Kaif (@MohammadKaif) October 6, 2022 Not the desired result for his team. But Happy for Sanju Samson – 86 not out. Highest ODI score will give him great belief and confidence going forward. — Ian Raphael Bishop (@irbishi) October 6, 2022 India could have won it. There was no need for Avesh Khan to slog blindly, just give the strike to Samson. Anyway…#INDvSA — Subhayan Chakraborty (@CricSubhayan) October 6, 2022 Sanju Samson you beauty. — CricketMAN2 (@ImTanujSingh) October 6, 2022 What a knock by Sanju Samson – 86* in just 63 balls with 9 fours and 3 sixes. Almost took India over the line, an innings worth a million appreciation! Take a bow, Sanju! pic.twitter.com/ygD2s72XWM — Mufaddal Vohra (@mufaddal_vohra) October 6, 2022 I live life on simple terms. I see Sanju slander, I block it. — Sonali (@samtanisonali1) October 6, 2022 Samson has played just 2 of the last 9 deliveries. Piss poor from the lower-order. Could have just given him the strike. — Venkata Krishna B (@venkatatweets) October 6, 2022 If Sanju Samson could have faced at least 2 or 3 balls in the 39th over, game could have changed but still what a fightback lead by Samson, Shreyas and Thakur without the big boys. — Johns. (@CricCrazyJohns) October 6, 2022 Nevertheless, well tried Samson. The quality was there to see and like @crickashish217 said, hardly a shot in anger. Hopefully more such knocks to come from him. https://t.co/EWRrFnj5Aj — Gurkirat Singh Gill (@gurkiratsgill) October 6, 2022 Respect, Sanju V Samson. — Rajasthan Royals (@rajasthanroyals) October 6, 2022 How can he not be even in the standbys for the T20 World Cup? But so happy to finally see him getting to do this in Indian colors. There was never any doubt about his talent. Not since people saw him as a teenager for @rajasthanroyals a decade ago. #SanjuSamson #IndvSA — TheRandomCricketPhotosGuy (@RandomCricketP1) October 6, 2022 Just brilliant @IamSanjuSamson what an innings — Ishan Yadav Mahal (@BeingIshanCric) October 6, 2022 Sanju Samson, ice cool under pressure, a wry smile and some brutal, calculated hitting #INDvSA — Rohit Sankar (@imRohit_SN) October 6, 2022 If only the tail gave Samson a few more balls. Three. Even two. — Abhishek Mukherjee (@ovshake42) October 6, 2022 In an ideal world, Sanju Samson would have been one of the first names in India’s T20 World Cup squad. But here he is! Trying to prove his worth, despite proving it numerous times before. #INDvSA — Prasenjit Dey (@CricPrasen) October 6, 2022 Rabada wasn’t hit for a single boundary, till he came across Lord Thakur. Who flat batted him for 2 boundaries over his head and then scooped him over fine leg! — Gurkirat Singh Gill (@gurkiratsgill) October 6, 2022 Shardul Thakur in this ODI match against South Africa: •8-1-35-2 with the ball.•33(31) with the bat. A terrific All-round performance by Shardul. pic.twitter.com/8Jz5R2Acu1 — CricketMAN2 (@ImTanujSingh) October 6, 2022 “Who’s your prime bowler?” “Bring him in front of Shardul Thakur.” — Silly Point (@FarziCricketer) October 6, 2022 Shardul Thakur na match ek tarfa haarne deta hai, na jeetne. — Silly Point (@FarziCricketer) October 6, 2022 Highest ODI career batting averages for Indiamin 7 inns65.50 – Sanju Samson62.75 – Shubman Gill57.68 – Virat Kohli50.23 – MS Dhoni#IndvSA #IndvsSA — Mohandas Menon (@mohanstatsman) October 6, 2022 Not the desired result for his team. But Happy for Sanju Samson – 86 not out. Highest ODI score will give him great belief and confidence going forward. — Ian Raphael Bishop (@irbishi) October 6, 2022 Well fought #SanjuSamson @IamSanjuSamson #INDvsSA pic.twitter.com/AeLTi6JPd6 — ROHIT Era (@TheRohitEra) October 6, 2022 What a inning #SanjuSamson well played champ..#INDvsSA pic.twitter.com/Z6lLK87tAg — Mukesh Kumar (@_Alex_Chaudhary) October 6, 2022 One of the greatest innings in 2022 #SanjuSamson #INDvsSA pic.twitter.com/y9PLvNhnRu — raushan (@Gulshan59526580) October 6, 2022 Virat Kohli is literally ruining the career of our deserving middle order batsmen like Sanju Samson and Deepak Hooda .#ViratKohli𓃟 pic.twitter.com/EjylZnWYn0 — 𝐂𝐚𝐩𝐭𝐚𝐢𝐧 (@Captain45_) October 6, 2022 Well played 86(63)*#SanjuSamson U have won millions of heart today. Lone warrior #INDvsSA #INDvSA#SanjuSamson pic.twitter.com/dgJbPkEcXY — DILIP KUMAR (किसान पुत्र) (@JakharDILIP_2) October 6, 2022 Well Played Sanju Samson 2nd Highest ODI Score by Indian WK against SA #INDvsSA pic.twitter.com/P5lb8xIDPH — 𝑺𝒉𝒆𝒃𝒂𝒔 (@Shebas_10dulkar) October 6, 2022 Just an appreciation tweet for Sanju Samson….Well fought champ..Chetta #INDvsSA #INDvSAODI #SanjuSamson pic.twitter.com/f0EBTsJoqh — Navneet MSDian (@MSDian067) October 6, 2022 Hey #BCCI Look What He Done Today!! pic.twitter.com/IWRi3zntFc — × ചാർളി ⱼD × (@Mr_Magician_93) October 6, 2022 Sanju Samson You Beauty . Well played man ! #INDvsSA l #INDvSA l #SanjuSamson . pic.twitter.com/ZV2XMV2aGp — Vishwajit Patil (@_VishwajitPatil) October 6, 2022 Chasing 250+ after top order collapse is not easy until u r @RishabhPant17 pic.twitter.com/0mxk7q7cK5 — Trishank (@trishank_vk) October 6, 2022 @IamSanjuSamson — Ishan Yadav Mahal (@BeingIshanCric) October 6, 2022 Few boxes well ticked – Sanju Samson with a fine effort.– Shreyas Iyer played a handy knock, promised so much more.– Shardul Thakur again proving all-round utility.– Kuldeep Yadav bowled with great confidence. Creditable that they came this close against such a big score. — Debayan Sen (ਦੇਬਾਯਨ) (@debayansen) October 6, 2022 Tabraiz Shamsi appreciated Sanju Samson’s innings after the match. pic.twitter.com/b5Bk0PDtwr — CricketMAN2 (@ImTanujSingh) October 6, 2022 If I had a choice between Deepak Hooda and Sanju Samson for a place in the World Cup squad, I know who I would choose. — Joy Bhattacharjya (@joybhattacharj) October 6, 2022 Also Read: Watch: Shardul Thakur Knocks Over Struggling Temba Bavuma With A Jaffa In IND vs SA 1st ODI Get All Cricket match prediction and fantasy Tips – CLICK HERE Cricket Match Prediction | T20 World Cup Match Prediction | Today Match Fantasy Prediction | Fantasy Cricket Tips | Cricket News and Updates | Cricket Live Score !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 17:47:35","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa Live Score Ball by Ball, India vs South Africa 2022/23 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-south-africa-live-score-over-1st-odi-odi-36-40-updates-3409106","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Live Updates of Today Match between India vs South Africa from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":"Follow the India vs South Africa 2022/23 live cricket score on Sports.NDTV.com . After 40.0 overs, India, chasing a target of 250, are 240/8. Get live score, ball by ball commentary and much more. Keep track of India vs South Africa 2022/23 today match between India and South Africa. Everything related to India and South Africa match will be available on Sports.NDTV.com . Stay updated with India vs South Africa live score. Do check for India vs South Africa scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. That is it from this game. South Africa take the lead in the three-match series. We move to Ranchi for the 2nd ODI. That match is on the 9th of this month and will start at 1.30 pm IST (8 am GMT). Do join us for the build up. Goodbye! Heinrich Klaasen is the Player of the Match. He says it was not easy to bat but his experienced and practice helped him. Adds he enjoys batting aginst India but he is happy to win for the team Temba Bavuma, the skipper of South Africa says it got tight in the end but they stuck to the plans. Adds the pitch was tricky to bat on but David Miller and Heinrich Klaasen did really well. On the bowling, they did well at the start, they lost the momentum in the middle but end of the day they got the results. ...Presentation coming up... Earlier in the day, after electing to bowl, India had South Africa in trouble at 3 down for not a lot but a superb 100-plus stand between David Miller and Heinrich Klaasen saw them get to the 250-run mark which proved to be enough. For India, this innings was about two people, Sanju Samson and Shreyas Iyer. It is because of them India got as close as they did. Had the two not played, it could have been an embarrassing loss for the Indians as the top order failed miserably. The early wickets and the controlled bowling earlier on did the job. The likes of Kagiso Rabada, Wayne Parnell, Keshav Maharaj and Tabraiz Shamsi really pushed India onto the back foot by taking 4 early on. Then there was a fightback from the Indians courtesy Iyer and Samson and then Samson and Thakur. Ngidi though did brilliantly towards the end as he got the important wickets at crucial times which helped his side get over the line. A solid win in the end for South Africa and much-needed. It though got a lot closer than they would have liked but they'll be happy they held their nerve and managed to take a 1-0 lead in the series. Sanju Samson played a wonderful innings but it went in vain. It could have been a lot more different if he took the strike in the 19th over. 39.6 overs (1 Run) A single to end the entertainment! Great effort by Samson! On middle, tucked to mid-wicket for a single. South Africa win by 9 runs. What a game! 39.5 overs (4 Runs) FOUR! This is full and outside off. Samson comes down the track and drives it to long off for a boundary. 39.4 overs (0 Run) DOT BALL! GOLD FOR SHAMSI! Tossed up on middle. Samson slog-sweeps it to deep square leg. Samson denies the single and keeps the strike. 39.3 overs (4 Runs) FOUR! Tabraiz Shamsi in tremendous pressure! 15 runs needed now! Tossed up on middle. In the slot again and Samson launches it over the bowler to long on for a boundary. 39.2 overs (4 Runs) FOUR! 19 runs needed now! What a thriller this is turning out to be! Flatter, slower and on leg. Samson clears his front leg and pulls it to deep mid-wicket for a boundary. 39.1 overs (6 Runs) SIX! GAME ON! The game is not over yet! This is full and in the slot on middle. Samson powers it over mid-wicket for a biggie. 23 runs needed now. 39.1 overs (1 Run) Wide! This is short, slower and down the leg side. Samson fails to pull. 38.6 overs (4 Runs) FOUR! This is full and outside off. Ravi Bishnoi heaves but toe ends his shot to third man for a boundary. 30 runs needed in the last over. Sanju Samson in the strike. Tabraiz Shamsi to bowl. 38.6 overs (1 Run) Two wickets for Rabada as well! Okay, hang on! Ravi Bishnoi starts to walk back but is told to turn back as Kagiso Rabada has overstepped! A length ball, outside off. Ravi Bishnoi mistimes his cut and it goes to cover where Bavuma takes it. A no ball is called and a free hit will follow. 38.5 overs (0 Run) OUT! TAKEN! A length ball, outside off, Avesh Khan swings his bat, It goes more off the top edge and to covers where Temba Bavuma takes a more simple catch. 38.4 overs (0 Run) On a length and outside off. Avesh swings and misses again. 38.3 overs (2 Runs) Dropped! Short of a length and outside off. Khan swings but slices it over point. Lungi Ngidi runs back, gets both hands on it but was stretching to take it. He fumbles and two runs are taken. 38.2 overs (0 Run) Another swing and miss. Length ball, outside off. Khan fails to connect again. Khan needs to just give the strike to Samson. He has already wasted two balls. 38.1 overs (0 Run) On a length and just top of off. Khan has a wild swing but misses. 37.6 overs (0 Run) A potential match-winning over from Ngidi! Two wickets from it! Short and outside off. Samson swings again and misses. 37 runs needed in 12 balls. 37.6 overs (1 Run) Wide! Length ball, way outside off. Samson slashes and misses. 37.5 overs (1 Run) Shorter and on middle. Khan tucks it to mid-wicket for a single. 37.4 overs (0 Run) OUT! CAUGHT! Another one bites the dust! Superb catch from the skipper! Two in two for Ngidi and South Africa are making a fine comeback! This is full, slow and outside off. Yadav just chips it in the air. It goes to cover where Temba Bavuma runs behind and takes a tumbling catch. Everything depends on Sanju Samson from here on now. Lungi Ngidi is on a Hat-trick. 39 runs needed in 14 balls. 37.3 overs (0 Run) OUT! TAKEN! Finally, Thakur goes and South Africa get the much needed wicket! They get a way back in! This is touch fuller and outside off. Thakur drives on the up but fails to get enough elevation to clear mid off. Keshav Maharaj there dives to his left and holds onto it. 39 runs needed in 15 balls. A wonderful came from Shardul Thakur comes to an end. 37.2 overs (1 Run) On a length and on middle. Samson plays it to long on for one. 37.1 overs (4 Runs) FOUR! Poor delivery! A juicy full toss on middle. Samson helps it away past short fine leg for a boundary. 37.1 overs (1 Run) Wide! Sees Samson shuffle across and Ngidi serves this way outside off. Left alone. 36.6 overs (4 Runs) FOUR! Three boundaries in the over! Stand and deliver stuff! too short and outside off. Thakur thumps it over mid off for a boundary. 45 runs needed from the last three. 36.5 overs (4 Runs) FOUR! Boundaries are flowing now! What a shot this is! On a length and on middle. Thakur scoops it well over fine leg for a boundary. 36.4 overs (0 Run) Short in length, outside off. Thakur plays it straight to extra-cover. 36.3 overs (1 Run) On a length and outside off, pushed to covers for a single. 36.2 overs (1 Run) Outside off, cut to deep point for a single. 36.1 overs (4 Runs) FOUR! Thakur is playing a gem of a cameo here. Length ball, outside off. Thakur slaps it over mid off for another boundary. That is three in a row for India. 35.6 overs (4 Runs) FOUR! Two in a row! Perfect end to the over! Tad short and on middle. Samson stays back and pulls it hard to deep square leg for four runs. 14 runs off the over. 35.5 overs (4 Runs) FOUR! Good shot! Tossed up, on middle. Samson comes down the track and smashes it to long on. The fielder runs to his right, dives and but only gets a hand on it. A boundary. 35.4 overs (2 Runs) Fuller ball on middle. Samson drills it to mid on, in the vacant area for a couple. 35.3 overs (1 Run) Another single as this is hit to long on. 35.2 overs (1 Run) On middle, flicked to square leg for a single. 35.1 overs (2 Runs) Full and on middle, flicked to deep mid-wicket for a brace. 2nd fifty for Samson is ODI. He will be key for India to win here.","pubDate":"2022-10-06 17:33:51","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_638006942178055286.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: Sanju Samson heroics in vain as India lose 1st ODI - India Today","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL3Nwb3J0cy9jcmlja2V0L3N0b3J5L2luZGlhLXZzLXNvdXRoLWFmcmljYS1zYW5qdS1zYW1zb24taGVyb2ljcy1pbi12YWluLWFzLWluZGlhLWxvc2UtMXN0LW9kaS0yMDA5MTU5LTIwMjItMTAtMDbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa: Sanju Samson heroics in vain as India lose 1st ODI  India TodayMatch Day Live | India vs South Africa | 1st ODI, Lucknow  ESPNcricinfoIndia vs South Africa 1st ODI Highlights: Sanju Samson's Blistering 86* in Vain as SA Beat IND by 9 Runs  News18Live Cricket Score: India vs South Africa, 1st ODI, Lucknow | Cricbuzz.com - Cricbuzz  CricbuzzIndia vs South Africa Highlights, 1st ODI 2022: South Africa beat India by 9 runs, take 1-0 lead in 3-match series  Times of IndiaView Full coverage on Google News","content":null,"pubDate":"2022-10-06 17:17:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"BAN vs PAK Prediction- Who Will Win Today’s Match Between Bangladesh And Pakistan, New Zealand Tri-Series 2022, 1st T20I","link":"https://www.thetimesofbengal.com/sports/ban-vs-pak-prediction-who-will-win-todays-match-between-bangladesh-and-pakistan-new-zealand-tri-series-2022-1st-t20i/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Pakistan and Bangladesh face off in the first match of the New Zealand T20I Tri-Series 2022 at Christchurch on October 7. New Zealand is the third team in this tri-series the final of which will be played on October 14. This is the final preparation for the three teams before the T20 World Cup in […]","content":"Pakistan and Bangladesh face off in the first match of the New Zealand T20I Tri-Series 2022 at Christchurch on October 7. New Zealand is the third team in this tri-series the final of which will be played on October 14. This is the final preparation for the three teams before the T20 World Cup in Australia. All the teams are heading into this series with a lot of cricket behind their backs. Bangladesh won a T20I series against UAE, New Zealand lost an ODI series to Australia and Pakistan was beaten 4-3 in a T20I series at home against England. Photo Credit: (AP) All three teams have a point to prove in the series and the onus for Pakistan will be on skipper Babar Azam. He spoke after the series’ defeat saying that the series was a competitive one. He also blamed his bowlers for not being able to defend a target of over 200 runs in the final T20I. Babar Azam. Pic Credits: Twitter “With 200 runs on the board, if we lose early wickets, it puts pressure on the other batters. This series was vital for us. We need to improve in the shortest format. I also mentioned at the toss, that we have a good bowling attack. Haris is bowling well, and he is improving everyday. I think entire Pakistan was waiting for this, even we were happy to host England” said Babar. BAN vs PAK Prediction- Who Will Win Today’s Match Between Bangladesh And Pakistan, New Zealand Tri-Series 2022, 1st T20I Bangladesh vs Pakistan Head To Head In T20Is Bangladesh vs Pakistan[photo: Twitter] Matches Played – 15 BAN Won – 2 PAK Won – 13 Recent Venue Records (Hagley Oval, Christchurch) Photo Credit: (ICC) STATS – T20 Total matches 2 Matches won batting first 1 Matches won bowling first 1 Average 1st Inns scores 168 Average 2nd Inns scores 142 Highest total recorded 184/5 (20 Ov) by NZ vs AUS Lowest total recorded 131/10 (17.3 Ov) by AUS vs NZ Highest score chased 154/3 (18.3 Ov) by ENG vs NZ Lowest score defended 184/5 (20 Ov) by NZ vs AUS Who Will Score Most Runs For Pakistan: Babar Azam / Mohammad Rizwan Who Will Take Most Wickets For Pakistan: Shaheen Afridi / Shadab Khan Who Will Score Most Runs For Bangladesh: Shakib Al Hasan/ Sabbir Rehman Who Will Take Most Wickets For Bangladesh: Mustafizur Rahman / Taskin Ahmed BAN vs PAK Prediction- Who Will Win Today’s Match Between Bangladesh And Pakistan, New Zealand Tri-Series 2022, 1st T20I Bangladesh are confident after their series win against UAE. Pakistan just lost the T20I series against England. In head-to-head records, Pakistan have beat Bangladesh in 13 of the 15 T20Is and is slightly ahead heading into this contest. Pakistan is to win the game. Also Read: PAK vs ENG: Naseem Shah Hospitalised With Pneumonia, To Miss Remainder Of The T20 Series vs England !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 17:15:27","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"Brisbane Cricket Ground boundary length: What is The Gabba ground size and boundary dimension?","link":"https://thesportsrush.com/cricket-news-brisbane-cricket-ground-boundary-length-what-is-the-gabba-ground-size-and-boundary-dimension/","keywords":["Cricket","Brisbane","The Gabba","West Indies tour of Australia 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Brisbane Cricket Ground boundary length: Brisbane will host the second and final T20I between Australia and West Indies. A nearly neck-to-neck contest during the first T20I at the Carrara Oval in Queensland, saw the Australia edge out the West Indies in the last Over thriller by 3 wickets. Overall, both the teams were quite sloppy… The post Brisbane Cricket Ground boundary length: What is The Gabba ground size and boundary dimension? appeared first on The SportsRush.","content":"A nearly neck-to-neck contest during the first T20I at the Carrara Oval in Queensland, saw the Australia edge out the West Indies in the last Over thriller by 3 wickets. Overall, both the teams were quite sloppy in all the departments, and were far from performing to their potential best. Australian skipper Aaron Finch, who surprisingly came down at no.4 in the batting order, was the lone half-centurion during the first T20I, but had to work hard for his runs (58 off 53), as he struck them at a strike rate of only 109.43. West Indies, who have not experienced the best of times while playing this format of late, will be desperate draw level the series, and thereby avoid losing their third-consecutive bilateral T20I series this year. : The second and the last match of the T20I series between these two sides will take place on Friday, at The Gabba, in Brisbane. The Brisbane Cricket Ground, commonly known as the Gabba, is one of the bigger grounds in terms of boundary dimensions in Australia. Unlike most grounds in India reserved exclusively for Cricket, the bigger field sizes in Australia mean that venues like The Gabba also hosts a lot of other sports like football, baseball, cycling, rugby league, rugby union, soccer, apart from Cricket. The Gabba in Brisbane, is up there with the Melbourne Cricket Ground (MCG) in terms of the playing dimensions. As of today, the dimensions of the playing field at The Gabba are 170.6 metres (east-west) by 149.9 metres (north-south). Expect the pacers to make optimum use of a lot of slower ball variations during the contest today, to fox the batters targeting the the big squarer boundaries in particular.","pubDate":"2022-10-06 17:04:02","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"BAN vs PAK Weather Forecast And Pitch Report of Hagley Oval, Christchurch New Zealand Tri-Series 2022, 1st T20I","link":"https://www.thetimesofbengal.com/sports/ban-vs-pak-weather-forecast-and-pitch-report-of-hagley-oval-christchurch-new-zealand-tri-series-2022-1st-t20i/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Pakistan take on Bangladesh in the first T20I of the New Zealand T20I Tri-Series 2022 on October 7 Friday in Christchurch. The final of the tri-series will be played on October 14. This is the final international assignment before the teams depart for Australia for the T20 World Cup. Each team plays the other two […]","content":"Pakistan take on Bangladesh in the first T20I of the New Zealand T20I Tri-Series 2022 on October 7 Friday in Christchurch. The final of the tri-series will be played on October 14. This is the final international assignment before the teams depart for Australia for the T20 World Cup. Each team plays the other two teams twice in the series and the top two teams will play the final on October 14. Shakib Al Hasan is back in the side to lead Bangladesh in the series. Babar Azam will lead Pakistan and Kane Williamson will lead the home side. Shakib who has already left the Caribbean for the tri-series will join the team before the first T20I. Habibul Bashar member of the selection committee said that the Bangladesh skipper is likely to bat at number four in the series. Shakib Al Hasan. PC-Getty “We are discussing it (whether he will bat at three or not). In the CPL he batted at four and played well. I think on Australian wickets he will make necessary adjustment (even if he is moved to four). It’s not like he (Shakib) is very rigid as far as his batting order is concerned. He is very flexible and he doesn’t have any problem batting at three or four when we spoke with him about his place in the batting order” Habibul Bashar, a member of the selection panel, told Cricbuzz. Meanwhile, for Pakistan, the onus will be on skipper Babar Azam to win this series after losing the series against England at home. He blamed the loss in the decider on his bowlers as they failed to defend a total of over 200 runs. Babar Azam. Pic Credit: Twitter “With 200 runs on the board, if we lose early wickets, it puts pressure on the other batters. This series was vital for us. We need to improve in the shortest format. I also mentioned at the toss, that we have a good bowling attack. Haris is bowling well, and he is improving everyday. I think entire Pakistan was waiting for this, even we were happy to host England” said Babar. Bangladesh vs Pakistan Weather Forecast And Pitch Report of Hagley Oval, Christchurch New Zealand T20I Tri-Series 2022, 1st T20I Photo Credit: (Twitter/BlackCaps) From the hot and humid conditions in Pakistan and UAE, both teams now find themselves in much cooler conditions in New Zealand. They will take some time to settle down with the given weather conditions. The first T20I between Bangladesh and Pakistan begins at 3 pm local time in Christchurch which is 7.30 am IST. The match thus begins in the afternoon and the weather conditions will be good for cricket with sunshine around. There will be a few clouds as well. The Hagley Oval has hosted just two T20Is so far. Also Read: ICC T20 World Cup 2022: Pakistan Do Not Have A No.4 Batsman Like Virat Kohli: Aaqib Javed Urges Babar Azam To Replicate Virat Kohli’s Role In The T20 World Cup !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 16:59:25","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"DR vs FUT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- KCC T-20 Elite Championship","link":"https://www.thetimesofbengal.com/sports/dr-vs-fut-dream11-prediction-fantasy-cricket-tips-dream11-team-playing-xi-pitch-report-injury-update-kcc-t-20-elite-championship/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"DR vs FUT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update of KCC T-20 Elite Championship match between Desert Raiders and Future Stars. DR vs FUT KCC T-20 Elite Championship Match 7 Details: The 7th match of the KCC T-20 Elite Championship will see Desert Raiders facing off against Future […]","content":"DR vs FUT Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update of KCC T-20 Elite Championship match between Desert Raiders and Future Stars. DR vs FUT KCC T-20 Elite Championship Match 7 Details: The 7th match of the KCC T-20 Elite Championship will see Desert Raiders facing off against Future Stars on 7th October at the Sulabiya Ground. For all the Dream11 Tips and Fantasy Cricket Live Updates, follow us on Cricketaddictor Telegram Channel. This game is scheduled to start at 1:00 AM IST and live score and commentary can be seen on FanCode and CricketAddictor website. DR vs FUT KCC T-20 Elite Championship Match 7 Preview: The KCC T-20 Elite Championship will see its seventh match of this season between Desert Raiders and Future Stars. Desert Raiders will be battling against Future Stars for the first time in the seventh match of this season of the KCC T-20 Elite Championship. Desert Raiders is currently placed at the sixth position on the points table of this season of the KCC T-20 Elite Championship whereas Future Stars is currently placed at the eighth spot on the points table. Desert Raiders played one match in this season of the KCC T-20 Elite Championship where they lost that game while Future Stars also played one game in this season where they too, lost that game. DR vs FUT KCC T-20 Elite Championship Match 7 Weather Report: The temperature is expected to hover around 32°C on the matchday with 22% humidity and 14 km/hr wind speed. There are no chances of precipitation during the game. DR vs FUT KCC T-20 Elite Championship Match 7 Pitch Report: The Sulabiya Ground is a batting-friendly wicket and is expected to assist the batters once again here. Pacers might get some help towards the latter half of the match while spinners will be crucial in the middle overs. Average 1st innings score: The average first-innings score on this wicket is 176 runs. Record of chasing teams: The team batting second doesn’t enjoy good records here. They have a winning percentage of 40 on this track. DR vs FUT KCC T-20 Elite Championship Match 7 Injury Update: (Will be added when there is an update) DR vs FUT KCC T-20 Elite Championship Match 7 Probable XIs: Desert Raiders: Mohammed Saleh©, Hassan Arif, Aamir Javed, Sasanka Widanagama, Ravindu Sanjeewa, Ashen Sangeeth, Sadiq Kassim, Zain Fakhr, Nawas Khan, Nadeem Mukles(wk), Wasantha Kumaranayaka Future Stars: Basir Khan, Abdul Jabbar, Bilal Tahir, Amin Ijaz, Naveen Jacob, Muhammad Ghulam©(wk), Mirwais Khan, Irfanullah Sultanzai, Bashart Ali, Praveen Raj, Asif Nawaz Top Picks For Dream11 Prediction and Fantasy Cricket Tips: Aamir Javed is a right-handed batsman from Desert Raiders. He hammered 55 runs in the last game. Sasanka Wishwajith is a right-handed batsman and right-arm leg-break bowler from Desert Raiders. He took 1 wicket in the last match. Bilal Tahir is a right-handed batsman from Future Stars. He smashed 46 runs in the last game. Amin Ijaz is a right-handed batsman and right-arm off-break bowler from Future Stars. He stacked 62 runs and grabbed 1 wicket in the last match. DR vs FUT KCC T-20 Elite Championship Match 7 Captain and Vice-Captain Choices: Captain – Amin Ijaz, Mirwais Khan Vice-Captain – Mohammad Saleh, Bilal Tahir Suggested Playing XI No.1 for DR vs FUT Dream11 Team: Keeper – Ravindu Sanjeewa Batsmen – Bilal Tahir (VC), Mirwais Khan, Mohammad Saleh All-rounders – Amin Ijaz (C), Bashart Ali, Mohammad Sadique Bowlers – Praveen Rao, Nawas Khan, Irfanullah Sultanzai, Ashen Sangeeth DR vs FUT Dream11 Prediction Suggested Playing XI No.2 for DR vs FUT Dream11 Team: Keeper – Ravindu Sanjeewa Batsmen – Bilal Tahir, Mirwais Khan (C), Mohammad Saleh (VC) All-rounders – Amin Ijaz, Bashart Ali, Sasanka Wishwajith Bowlers – Praveen Rao, Nawas Khan, Irfanullah Sultanzai, Asif Nawaz DR vs FUT Dream11 Prediction DR vs FUT KCC T-20 Elite Championship Match 7 Expert Advice: Amin Ijaz will be a great multiplier choice for the mini-grand leagues. Asif Nawaz and Priyakanth Harichchandra are among the punt-picks here. The best-suggested fantasy/Dream11 combination for this game is 1-3-3-4. DR vs FUT KCC T-20 Elite Championship Match 7 Probable Winners: Desert Raiders are expected to win this match. !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 16:27:26","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs South Africa: India vs South Africa 2022/23 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/india-vs-south-africa-live-score-over-1st-odi-odi-26-30-updates-3408939","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Live Updates of Today Match between India vs South Africa from Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow. Check commentary and full scoreboard of the match.","content":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 30.2 overs, India, chasing a target of 250, are 147/5. The live updates of India vs South Africa scorecard is also available. It is the perfect platform to follow your favourite teams in India vs South Africa 2022/23. Keep a track on your favourite batsmen and bowlers through India vs South Africa 2022/23 today match, ball by ball commentary, India vs South Africa, India vs South Africa live score, India vs South Africa scorecard. Follow the excitement of the India vs South Africa 2022/23 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 29.6 overs (0 Run) NOT OUT! Going down leg again! South Africa have lost both their reviews now! It is yet again turning too much! It lands on middle and spins back in. Thakur lunges and looks to defend but misses to get hit on the pads. Shamsi puts in a loud appeal but turned down. De Kock starts walking to the other end but Bavuma is convinced to take the review. Not a good idea to take it though. 29.5 overs (1 Run) On middle, Samson works it through mid-wicket for one. 29.4 overs (4 Runs) FOUR! Misfield and a handy boundary! Tossed up on off, this is driven towards mid off. Parnell dives over the ball and it goes through to the fence. 29.3 overs (0 Run) On off, defended. 29.3 overs (3 Runs) BONUS RUNS! Down the leg side, turns away further. De Kock fails to take it and Two more runs taken. Wided too. 29.2 overs (1 Run) On off, Thakur pushes it through covers for one. 29.1 overs (0 Run) NOT OUT! That is going down leg! Turning a little too much! On middle, this one turns back in. Thakur looks to flick but misses. It hits the pad. An appeal but turned down. Shamsi wants it to be reviewed and it is taken. Replays show that South Africa lose one. 28.6 overs (1 Run) Short and on middle, Thakur pulls it again through square leg for one. 28.5 overs (0 Run) On the shorter side, Thakur pushes it but to covers. 28.4 overs (0 Run) Shorter and outside off, Thakur slashes but misses. 28.3 overs (1 Run) Around off, Samson guides it through point and takes one. 28.2 overs (1 Run) On off, this is pushed through covers for one. 28.1 overs (1 Run) Shorter and on middle, Samson works it through mid-wicket and takes one. 28.1 overs (1 Run) Outside off, Samson looks to push at it, he does so away from the body. He gets an inside edge onto the leg side for one. The SIREN goes on, Kagiso Rabada has overstepped. Free Hit coming up. 27.6 overs (0 Run) On middle, defended. 27.5 overs (1 Run) Leg bye! On the pads, Samson looks to flick but misses, it hits the pad and rolls behind on the leg side for one. Leg bye. 27.4 overs (2 Runs) Another short one, Samson pulls it through square leg and takes one. 27.3 overs (1 Run) On middle, this is worked through square leg for one. 27.2 overs (4 Runs) FOUR! Hammered! Two boundaries in a row for Thakur! Short and on the pads, this is pulled wide of the deep square leg fielder and into the fence. 27.1 overs (1 Run) On middle, this is worked through mid-wicket for one. 26.6 overs (4 Runs) FOUR! Tickled nice and fine! On the pads, Thakur works it fine on the leg side and this one races away to the fence. 26.5 overs (0 Run) Shorter and outside off, Thakur slashes but misses. 26.4 overs (0 Run) OUT! STRAIGHT TO THE MAN! The stand which was getting South Africa worried has been broken and that could well be the final blow as only the bowling all-rounders to come now. India needed these two to go on for longer. Nervertheless, a superb knock from Iyer. He batted brilliantly but the pressure of dots in recent overs got to him. A short one on middle, Iyer looks to pull, he tries to flat-bat it over mid on but it goes off the splice and to the man at mid on. Kagiso Rabada makes no mistake. 26.3 overs (0 Run) The pressure of dots got to Iyer! He makes room and this is banged in short. He tries to upper cut it but misses. 26.2 overs (0 Run) Goes wide of the crease and angles it into middle, defended. 26.1 overs (0 Run) Good length and on off, defended. 25.6 overs (1 Run) Another one! On off, this is pushed down to long off for one. Fifty for Iyer. Superb knock from him. He has taken on the South African bowlers here and it has come off. Needs to keep going though, he will know only half the job is done. 25.5 overs (0 Run) Tosses it up on off, Iyer pushes it to covers. 25.4 overs (4 Runs) FOUR! Deft touch! Brilliant batting. Just wonderful! Outside off, Iyer waits and then guides it past short third man for a boundary. 25.3 overs (0 Run) On off, defended. 25.2 overs (0 Run) Shorter and on off this one turns away big and also stays low. Iyer looks to cut but misses. 25.1 overs (1 Run) Flatter and on off, this is pushed through covers for one.","pubDate":"2022-10-06 16:19:39","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_638006897655318522.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"All the Indian players selected for T20 Cricket World Cup are capable to win a game on any matchday: Sanjay Bangar","link":"https://www.dnaindia.com/cricket/report-all-the-indian-players-selected-for-t20-cricket-world-cup-are-capable-to-win-a-game-sanjay-bangar-2990829","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Fans are gearing up for what is going to be a cracker of a contest, as the Greatest Rivalry India vs Pakistan in the ICC Men`s T20 World Cup 2022 is set to take place on Sunday at the iconic Melbourne Cricket Ground.","content":null,"pubDate":"2022-10-06 16:17:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Hagley Oval T20 records: Hagley Oval Christchurch Cricket Ground T20I records and highest innings total","link":"https://thesportsrush.com/cricket-news-hagley-oval-t20-records-hagley-oval-christchurch-cricket-ground-t20i-records-and-highest-innings-total/","keywords":["Cricket","Bangladesh","New Zealand","New Zealand T20I Tri-Nation Series 2022","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Hagley Oval T20 records: Christchurch will be hosting seven T20Is in eight days during the forthcoming series. T20 format will return to Christchurch after eight and a half months with Bangladesh and Pakistan set to lock horns with each other in the first match of New Zealand T20I Tri-Nation Series 2022 tomorrow. As far as… The post Hagley Oval T20 records: Hagley Oval Christchurch Cricket Ground T20I records and highest innings total appeared first on The SportsRush.","content":"T20 format will return to Christchurch after eight and a half months with Bangladesh and Pakistan set to lock horns with each other in the first match of New Zealand T20I Tri-Nation Series 2022 tomorrow. As far as T20Is are concerned, Hagley Oval will be hosting one after 19 and a half months. The venue will also become the first-ever stadium in New Zealand to host a neutral T20I. Hagley Oval has hosted only two T20Is till date with New Zealand winning and losing a match each. Other participating teams in Pakistan and Bangladesh will be playing a T20I here for the first time on Friday. A typical day in the gym. | | — Bangladesh Cricket (@BCBtigers) Considering the limited number of T20Is played in this stadium, there aren’t a lot of records to be mentioned. It is noteworthy that teams batting first and second have won a match each at the Hagley Oval. Highest T20I run-scorers at the Hagley Oval are Devon Conway (99), James Vince (59), Mitchell Marsh (45), Ross Taylor (44) and Jonny Bairstow (35). Highest T20I wicket-takers at this venue are Mitchell Santner (4), Ish Sodhi (4), Trent Boult (2), Chris Jordan (2) and Jhye Richardson (2), Daniel Sams (2) and Tim Southee (2). The home team holds the record of highest T20I innings total at the Hagley Oval. It was in the last T20I played here when New Zealand had scored 184/5 in 20 overs after being put in to bat first by Australia captain Aaron Finch. Player almost three years ago, the first match here had been witness to the highest successful T20I run-chase after England had defeated New Zealand by 7 wickets on the back of sealing a 154-run chase in the penultimate over.","pubDate":"2022-10-06 15:50:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Weather in Sylhet today: Sylhet International Cricket Stadium weather forecast for India Women vs Pakistan Women Asia Cup 2022 match","link":"https://thesportsrush.com/cricket-news-weather-in-sylhet-today-sylhet-international-cricket-stadium-weather-forecast-for-india-women-vs-pakistan-women-asia-cup-2022-match/","keywords":["Cricket","Asia Cup 2022","Sylhet International Cricket Stadium"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Weather in Sylhet today: Team India are currently placed at the top of the points table with three wins out of three matches so far. Arch-rivals India and Pakistan will face each other in the 13th match of the ongoing Women’s Asia Cup 2022, at the Sylhet International Cricket Stadium on Friday. Having won their… The post Weather in Sylhet today: Sylhet International Cricket Stadium weather forecast for India Women vs Pakistan Women Asia Cup 2022 match appeared first on The SportsRush.","content":"Weather in Sylhet today: Team India are currently placed at the top of the points table with three wins out of three matches so far. Arch-rivals India and Pakistan will face each other in the 13th match of the ongoing Women’s Asia Cup 2022, at the Sylhet International Cricket Stadium on Friday. Having won their first three T20Is of the tournament against Sri Lanka, Malaysia, and UAE, team India are placed at the top of the points table with six points under their belt. Pakistan, on the other hand, were handed a shocker on Thursday, when they lost their first ever T20I against Malaysia by 4 wickets, while failing to defend a paltry total of 116/5 in their 20 Overs. ALSO READ: Sylhet International Cricket Stadium pitch report IND vs PAK Asia Cup 2022 The Bismah Maroof-led side are currently placed at the second spot in the table, with 4 points after three matches. Team India, in particular will step on the field as a much confident side on Friday, after their batters in Jemimah Rodrigues (75* off 45) and Deepti Sharma (64 off 49) bailed the team out of deep waters against UAE, by stitching together a 128-run partnership, to ultimately win the match for their side by 104 runs. Weather in Sylhet today The rain has disrupted play on a couple of occasions the in Asia Cup matches so far in Sylhet. However, the good news for the fans back in India and Pakistan is that the rain Gods are likely to stay away from the match venue on Friday. As per Accuweather, the sun is expected to shine nice and bright from behind the patches of clouds, during the entire duration of the India-Pakistan match. The conditions are likely to remain ‘very hot’, with the temperature lingering around the 37-39 degrees Celsius till the evening. All in all, we will have a rain interruption-free contest at the Sylhet International Stadium on Friday. The post Weather in Sylhet today: Sylhet International Cricket Stadium weather forecast for India Women vs Pakistan Women Asia Cup 2022 match appeared first on The SportsRush.","pubDate":"2022-10-06 15:37:21","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Jofra Archer Could Mark England Return In January 2023: Report","link":"https://sports.ndtv.com/cricket/jofra-archer-could-mark-england-return-early-2023-report-3408879","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"Jofra Archer hasn't played competitive cricket since March 2021. As per a report, Archer could feature for England in an ODI series against South Africa early next year.","content":"Out of action since March 2021, England pacer Jofra Archer is gradually inching closer to a return. The marquee fast bowler has missed plenty of important cricketing assignments due to an injury and will not be a part of the England squad in the T20 World Cup 2022 either. But, as far as the plans for 2023 go, Jofra could be in the thick of the action for England. In fact, the pacer could return to action as soon as January next year in a bilateral series against South Africa. As per a report in The Telegraph , Archer could mark his return on the field against the Proteas in the bilateral series in January next year. A string of injuries kept him on the sidelines for a long time but now he is said to have resumed bowling. Archer had suffered a stress fracture of the elbow before suffering a stress fracture of the back. The wait to return to the field has been excruciating, but now, he is likely to join the England Test squad for a Test series against Pakistan. However, Archer reportedly won't be fit enough to be a part of the England team in the series. South Africa and England will play a total of 3 ODIs between January 27 and February 01. What's interesting to see is that those matches will be held while the South Africa T20 league will be underway. Jofra's return to the cricket field will also instill hope in the hearts of Mumbai Indians fans. It has to be noted that the Rohit Shama-led side had purchased Archer at the IPL 2022 auction for INR 8 crore despite knowing that he would not be able to play for the franchise that season. Promoted With the IPL 2023 season expected to start in March or April next year, Archer could be in line for his first IPL participation in the Mumbai Indian colours. But, his return to the T20 league would depend highly on the way he performs for England in the matches before the start of the franchise competition. The England team management will have an eye on the ODI World Cup next year while managing Archer's workload.","pubDate":"2022-10-06 15:32:06","image_url":"https://c.ndtvimg.com/2022-01/biugrop8_jofra-archer-afp_625x300_28_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Opportunity to unearth a new champion’ :Ravi Shastri on Bumrah’s absence in T20 world cup","link":"https://sportstar.thehindu.com/cricket/icc-mens-t20-world-cup/2021/features/ravi-shastri-jasprit-bumrah-t20-world-cup/article65977089.ece","keywords":null,"creator":["\n        S. Dipak Ragav  \n    "],"video_url":null,"description":"Shastri was in Chennai for the launch of Coaching Beyond Cricket academy, founded by him along with B. Arun and R. Sridhar, former India bowling and fielding coaches","content":null,"pubDate":"2022-10-06 15:19:49","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"BAN vs PAK Dream11 Team Prediction, Match Preview, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s BAN vs PAK 1st T20I match in Christchurch, 730 AM IST, October 7","link":"https://zeenews.india.com/cricket/ban-vs-pak-dream11-team-prediction-match-preview-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ban-vs-pak-1st-t20i-match-in-christchurch-730-am-ist-october-7-2518664.html","keywords":null,"creator":null,"video_url":null,"description":"Bangladesh vs Pakistan Dream11 Team Prediction Bangladesh vs Pakistan 1st T20I Match Preview - Check My Dream11 Team, Best players list of BAN vs PAK, Bangladesh Dream11 Team Player List, Pakistan Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":"Pakistan and Bangladesh will be up against each other in the first T20I of the New Zealand T20I series that kickstarts on Friday (October 7). Babar Azam's side will be playing another T20I quickly after the conclusion of the seven-match series against England recently which they lost 4-3. The team boarded the flight to New Zealand the same night and two days after landing in the country, they will be in action against the Bangladeshis. Not to forget, they play the 2nd T20I of the tournament vs New Zealand a day later on Saturday (October 8). Pakistan are leaving no stone unturned to prepare well for the ICC T20 World Cup 2022 that begins this month. Pakistan's first match will be against arch-rivals India on October 23 at Melbourne Cricket Ground (MCG). In the last 4 T20Is before this World Cup, Pakistan will be looking to fix their middle order issues. Their middle order has not fired for some time, making them depend on their openers- Babar abd Mohammad Rizwan most of the times. Boys sweating hard in the cold weather of Lincoln _ #NZTriSeries #BackTheBoysInGreen pic.twitter.com/MnynD8hQLx — Pakistan Cricket (@TheRealPCB) October 6, 2022 It is also true that Babar azam and Mohammad Rizwan have been criticised by experts and fans for playing too slow at the start. The strike rates are something Pakistan have been debating for a long time. It is also something they will be taking care of in the tri-series in New Zealand. On the other hand, Bangladeshis will be looing for some wins under their belt before the World Cup. They had a terrible outing int the Asia Cup 2022, making an exit in the first round itself. Shakib Al Hasan-led side will be looking to make amends and be ready for the big-ticket event in Australia. PAK vs BAN Dream11 Team Prediction Captain: Mohammad Rizwan Vice-Captain: Shakib Al Hasan Suggested Playing XI for PAK vs BAN Dream11 Fantasy Cricket: Wicketkeepers: Mohammad Rizwan, Nurul Hasan Batsmen: Babar Azam, Khushdil Shah, Sabbir Rahman All-rounders: Shakib Al Hasan, Mosaddek Hossain, Shadab Khan Bowlers: Naseem Shah, Mustafizur Rahman, Taskin Ahmed Pakistan vs Bangladesh Predicted Playing 11: Pakistan XI: Mohammad Rizwan (wicketkeeper), Babar Azam (captain), Haider Ali, Mohammad Nawaz, Khushdil Shah, Shadab Khan, Asif Ali, Mohammad Wasim, Naseem Shah, Shan Masood, Iftikhar Ahmed Bangladesh XI : Mehidy Hasan Miraz, Sabbir Rahman, Litton Das, Shakib Al Hasan (captain), Yasir Ali, Mosaddek Hossain, Nurul Hasan (wicketkeeper), Nasum Ahmed, Mustafizur Rahman, Taskin Ahmed, Ebadot Hossain","pubDate":"2022-10-06 14:54:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“Rameez Bhai We Face Too Much Criticism”- PCB Chairman Ramiz Raja Reveals His Conversation With Babar Azam","link":"https://www.thetimesofbengal.com/sports/rameez-bhai-we-face-too-much-criticism-pcb-chairman-ramiz-raja-reveals-his-conversation-with-babar-azam/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Pakistan Cricket Team has been receiving a lot of criticism for their poor performance in the England T20I Series. The Men in Green’s middle order seems never-ending. Babar Azam, the skipper will have to work some magic as such sort of performances won’t keep them in a good place. Pakistan fans would be utterly disappointed […]","content":"Pakistan Cricket Team has been receiving a lot of criticism for their poor performance in the England T20I Series. The Men in Green’s middle order seems never-ending. Babar Azam, the skipper will have to work some magic as such sort of performances won’t keep them in a good place. Pakistan fans would be utterly disappointed not because of the losing series but because the team lacked fighting spirit. There’s no doubt that Pakistan has got quality players in the squad but they are not able to deliver the performances which are hurting them. The middle-order batters need to have role clarity which is somewhat missing. Babar Azam (Credits: Twitter) Rameez Raja Reveals Conversation With Babar Azam PCB Chairman was interacting with Sama TV and was asked about Babar Azam. “Babar Azam often tells me that we face too much criticism. Many times I give him assurance and tell him that, thankfully, cricket is not ignored like other sports. Fans are engaged and they will always have an opinion,” said Ramiz Raja Ramiz Raja. Credits: Sky Sports. “Previously we used to falter at the very first hurdle. Yes, we reached the final and yes, we did not play well. But it’s okay to have a bad day. But there were other teams as well in the Asia Cup. I mean then India should then have been severely criticized for not reaching the final. But that is not what their fans and media do,” Said PCB Chairman “I’ll tell you when Virat Kohli scored a century against Afghanistan, they forgot their entire Asia Cup. Will we ever do that? What we say is that Babar Azam scored a ton, but his strike rate was 135 while David Warner’s was 147.3. So this is useless,” he added. Conundrum for Management Pakistan Cricket Team is in tatters currently. The Men in Green have lacked fire-power at the back end of the innings as the batter have been unable to convert their starts which is badly hurting them. They need to fix their problems before it’s too late. Saqlain Mushtaq andBabar Azam. Pic Credits= Twitter Head Coach Saqlain Mushtaq and Skipper Babar Azam will have to pull a rabbit out of hat. They should stick to one combination rather than chopping and changing. It would be interesting to see how they fare in New Zealand and Australian Conditions where conditions would be completely different. Also Read: ICC T20 World Cup 2022: Pakistan Do Not Have A No.4 Batsman Like Virat Kohli: Aaqib Javed Urges Babar Azam To Replicate Virat Kohli’s Role In The T20 World Cup !function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '944637919386237'); fbq('track', 'PageView'); Source link","pubDate":"2022-10-06 14:35:32","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"From Bat & Ball to Racket & Ball as Sachin Tendulkar and MS Dhoni reunite to roll back memories","link":"https://www.indiatvnews.com/sports/cricket/from-bat-ball-to-racket-ball-as-sachin-tendulkar-and-ms-dhoni-reunite-to-roll-back-memories-2022-10-06-814254","keywords":null,"creator":null,"video_url":null,"description":"Former India captain MS Dhoni and Sachin Tendulkar were seen getting reunited once again on Thursday, but not on the cricket field but tennis court. The two legends of Indian cricket were seen posting together as they got together for an advertisement shoot. But rather than the usual bat and ball, it was the racket and ball that took the center stage.","content":"Former India captain and were seen getting reunited once again on Thursday, but not on the cricket field but tennis court. The two legends of Indian cricket were seen posting together as they got together for an advertisement shoot. But rather than the usual bat and ball, it was the racket and ball that took the center stage. The snaps came into the limelight when MS Dhoni’s franchise Chennai Super Kings tweeted about the same. The tweet read, “7-10, set for some bottom-hand drives!”. The reunion had several fans come together and enjoy the reunion both Sachin Tendulkar and MS Dhoni have good fan following. While the tennis game was slightly favoured, they are often seen enjoying their spell together. It was this company in 2011 that took India to its first World Cup success in ODI cricket since 1983. Under Dhoni’s leadership, India won multiple ICC tournaments while Tendulkar was the epicenter of the Indian team in the 2011 World Cup and ended as India’s highest scorer in the tournament with two hundreds. Tennis also has a close connection for Sachin as he is often seen visiting the parks of Wimbledon in July and has shared close bonds with Roger Federer. While Sachin announced his retirement from the game in 2013, Federer announced his retirement last month. Both the players are the legends of their era and have achieved some unique accolades. MS Dhoni on the flip side is the only captain to have won all the ICC trophies during his playing days and holds a unique accolade as well. He announced his retirement from the game international front in 2020 while he continues to be associated with Chennai Super Kings (CSK) in the Indian Premier League ( ) and will be leading the side in the 2023 season. The upcoming season could be his final season in the IPL as well.","pubDate":"2022-10-06 14:26:52","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}