{"newsArray":[{"article_id":"c33eb941f8b29ee51245374eb295d7ac","title":"Chamari Athapaththu stars to lead Sri Lanka to series win over England","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-kate-cross-chelmsford-t20-b2406691.html","keywords":["Cricket","Sport"],"creator":["Jonathan Veal"],"video_url":null,"description":"Athapaththu claimed figures of three for 21 and then hit 44.","content":"Chamari Athapaththu was again the star for Sri Lanka as they earned a historic Twenty20 international series win against England . Athapaththu claimed figures of three for 21 as the hosts were bowled out for 116 before whacking 44 to fire her side to a seven-wicket victory, which sealed a memorable 2-1 series success in the decider at Derby. The Sri Lanka captain hit a half-century in Saturday’s win at Chelmsford and again brought the fireworks, plundering two sixes and five fours in her 28-ball innings. It meant that England lost a T20 series to a team other than Australia for the first time since 2010, while also losing a first-ever white-ball series to Sri Lanka. The opening ball of the match set the tone for England’s disappointing innings as Danni Wyatt slapped a gentle long hop straight to cover and it got worse after a calamitous run out at the end of the second over, where Maia Bouchier and Alice Capsey were both at the same end. They never got to grips with Sri Lanka’s array of slower bowlers, with skipper Athapaththu taking three wickets and Udeshika Prabodhani and Kavisha Dilhari both claiming two victims apiece. Bouchier top scored with 23 while Danielle Gibson added 21 late as England failed to see out their overs. Athapaththu came out firing and did the leg work of Sri Lanka’s chase in the first seven overs, hitting Kate Cross and 17-year-old Mahika Gaur over the ropes in an array of boundaries. Her dismissal with score on 65 could have opened the door for England, but they could not make regular inroads and the visitors got over the line with 18 balls to spare.","pubDate":"2023-09-06 19:49:22","image_url":"https://static.independent.co.uk/2023/09/06/20/664d724ab356c3d010d31946be7e234bY29udGVudHNlYXJjaGFwaSwxNjk0MTE2MDgy-2.73562987.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd3e85ce0e345bed3d0ab0a3fda2ac8f","title":"Heath Streak cremated, legendary cricketer’s wish reportedly fulfilled","link":"https://nehandaradio.com/2023/09/06/heath-streak-cremated-legendary-cricketers-wish-reportedly-fulfilled/","keywords":["Cricket","Featured","News","Sports","Heath Streak"],"creator":["Staff Reporter"],"video_url":null,"description":"Renowned former Zimbabwe cricket captain and coach, Heath Streak, who died aged 49 in the wee hours of Sunday morning has reportedly been cremated. The post Heath Streak cremated, legendary cricketer’s wish reportedly fulfilled appeared first on Nehanda Radio.","content":"The cremation comes after Streak who is said to be one of the greatest ever cricketers to emerge in Zimbabwe, told his family he wanted to be cremated. This was confirmed on Thursday by John Rennie, the family’s spokesperson and longtime friend. He told Zimpapers Sports Hub: “I can confirm that Heath Streak has been cremated as per his wish.,” he said. Streak’s memorial service is set to be held on Friday at Four Winds Suburb, Bulawayo at Mystique Gardens. He survived by his wife Nadine and four children.","pubDate":"2023-09-06 19:18:48","image_url":null,"source_id":"nehandaradio","source_priority":389454,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"ca671fd95c21a4ab2eddea92fcb9c10c","title":"Asia Cup 2023 Super Four: \"दुर्भाग्य से इस तरह...\" हार के बाद बांग्लादेश कप्तान शाकिब ने पाकिस्तान टीम को लेकर कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/shakib-al-hasan-bangladesh-captain-big-statement-after-lose-over-pakistan-in-asia-cup-2023-super-four-matc-4366716#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"PAK vs BAN Asia Cup 2023 Super Four: एशिया कप के सुपर 4 मुकाबले में पाकिस्तान ने बांग्लादेश को 7 विकेट से दी मात.","content":"Shakib Al Hasan on Lose vs pakistan in Asia Cup super four बांग्लादेश के कप्तान शाकिब अल हसन ने एशिया कप क्रिकेट टूर्नामेंट के सुपर चार चरण के मुकाबले में बुधवार को यहां पाकिस्तान के खिलाफ सात विकेट की एकतरफा हार का दोष बल्लेबाजों पर मढ़ते हुए कहा कि इस तरह के विकेट पर उन्होंने बहुत खराब बल्लेबाजी की. बांग्लादेश के 194 रन के लक्ष्य का पीछा करते हुए पाकिस्तान ने इमाम उल हक (84 गेंद में 78 रन, पांच चौके, चार छक्के) और मोहम्मद रिजवान (MD Rizwan) (79 गेंद में नाबाद 63, सात चौके, एक छक्का) के अर्धशतक और दोनों के बीच तीसरे विकेट की 85 रन की साझेदारी की बदौलत 63 गेंद शेष रहते तीन विकेट पर 194 रन बनाकर जीत दर्ज की. बांग्लादेश इससे पहले मुशफिकुर रहीम (Mushfiqur Rahim Half Century) (87 गेंद में 64 रन, पांच चौके) और कप्तान शाकिब अल हसन (57 गेंद में 53 रन, सात चौके) के अर्धशतक और दोनों के बीच 100 रन की साझेदारी के बावजूद हारिस राउफ (19 रन पर चार विकेट) और नसीम शाह (34 रन पर चार विकेट) की धारदार गेंदबाजी के सामने 38.4 ओवर में 193 रन पर ही सिमट गया. शाकिब (Shakib Al Hasan on Lose over Pakistan) ने मैच के बाद कहा, ‘‘इस तरह के विकेट पर बहुत खराब बल्लेबाजी प्रदर्शन लेकिन हमें अगले मुकाबले पर ध्यान देना होगा. वे नंबर एक टीम हैं और इसका कारण यही है. उनके पास तीन विश्व स्तरीय गेंदबाज हैं जो उनके लिए चीजें आसान बना रहे हैं. हम गेंदबाजी विभाग में अच्छा प्रदर्शन कर रहे हैं लेकिन बल्लेबाजी उम्मीद के मुताबिक नहीं है. हमें और अधिक निरंतर प्रदर्शन करने की जरूरत है.'' उन्होंने कहा, ‘‘ मुझे लगता है कि हमारे तीन तेज गेंदबाजों ने शानदार गेंदबाजी की. पाकिस्तान की तरह हमारे तेज गेंदबाज पिछले कुछ वर्षों में बहुत अच्छी गेंदबाजी कर रहे हैं लेकिन, दुर्भाग्य से इस तरह की पिच पर आप तब तक विकेट नहीं पा सकते जब तक कि बल्लेबाज गलतियां नहीं करें.'' शाकिब ने कहा कि उनके बल्लेबाजों ने साधारण शॉट खेलकर शुरुआत में ही काफी विकेट गंवा दिए. उन्होंने कहा, ‘‘हमने शुरुआत में जल्दी विकेट खो दिए और हमने कुछ सामान्य शॉट खेले। इस तरह के विकेट पर हमें शुरुआती दस ओवर में चार विकेट नहीं गंवाने चाहिए लेकिन ऐसा होता है. हमारी साझेदारी अच्छी थी, हमें सात या आठ ओवर और बल्लेबाजी करने की जरूरत थी.'' श्रीलंका में खेलने के संदर्भ में उन्होंने कहा, ‘‘जब मैं एलपीएल (लंका प्रीमियर लीग) में खेला था तो पिचें थोड़ी धीमी थीं, विकेट पर असमान उछाल था और इससे हमें मदद मिलेगी. उम्मीद है कि हम कोलंबो में अच्छा प्रदर्शन करेंगे.'' बाबर ने कहा, ‘‘सभी खिलाड़ियों को श्रेय, विशेषकर शुरुआती दस ओवरों को। वे पहले दस ओवरों में अच्छी गेंदबाजी कर रहे हैं और फिर हारिस राउफ (Babar Azam on Haris Rauf) भी वास्तव में अच्छी गेंदबाजी कर रहे हैं. तेज गेंदबाजों को थोड़ी मदद मिल रही थी और फहीम (अशरफ) ने वास्तव में अच्छी गेंदबाजी की. जीतना हमेशा आपको आत्मविश्वास देता है.'' टीम पर दबाव के संदर्भ में उन्होंने कहा, ‘‘मुझे ऐसा नहीं लगता. हम हर मैच में अपना सर्वश्रेष्ठ दे रहे हैं.'' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-06 19:07:53","image_url":"https://c.ndtvimg.com/2023-07/qph0ekhg_shakib-al-hasan_625x300_17_July_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2892121cd6b49de3fbc9063b0ed6f211","title":"Sri Lanka dismiss England for 116 in T20 series decider in Derby","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-t20-heather-knight-england-cricket-b2406666.html","keywords":["Cricket","Sport"],"creator":["Jonathan Veal"],"video_url":null,"description":"Maia Bouchier top scored with 23 while Danielle Gibson added 21 late as England were skittled in the 19th over.","content":"England will have to defend a below-par score of 116 if they are to win their Twenty20 international series against Sri Lanka . With the three-match contest tied at 1-1, the hosts were bowled out for a disappointing 116 after being invited to bat first in the decider at Derby . They never got to grips with Sri Lanka’s array of slower bowlers, with Chamari Athapaththu taking three for 21 and Udeshika Prabodhani and Kavisha Dilhari both claiming two wickets apiece. Maia Bouchier top scored with 23 while Danielle Gibson added 21 late as England were skittled in the 19th over. The innings could not have got off to a worse start as Danni Wyatt planted a gentle wide delivery from Inoshi Fernando straight to cover. The Sri Lankans were celebrating again at the end of the second over when a calamitous mix-up between Bouchier and Alice Capsey saw both batters at the same end, with the latter ran out. Bouchier and captain Heather Knight did some repair work, sharing a 30-run stand in four overs, but that came to an end when Bouchier holed out to long-on. Knight (18) and Amy Jones (20) soon followed as England slipped to 72 for five in the 11th over and it looked like they would struggle to get to 100. But Gibson hit three fours in her 15-ball innings to get them to three figures before a flurry of late wickets saw them fail to see out their overs.","pubDate":"2023-09-06 18:36:51","image_url":"https://static.independent.co.uk/2023/09/06/19/9693ee163058ed4da8bdb50ffdbb23edY29udGVudHNlYXJjaGFwaSwxNjk0MTExNDYw-2.73625631.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ae19dd97749ced4b18cec5db79dbf0c","title":"विश्व कप की टीम पर ये क्या बोल गए शिखर धवन? आखिर तोड़ ही दी अपनी चुप्पी!","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/shikhar-dhawan-break-his-silence-on-world-cup-team-said-this-big-thing-in-gestures/articleshow/103443360.cms","keywords":null,"creator":null,"video_url":null,"description":"Shikhar Dhawan: विश्व कप के लिए हुए टीम इंडिया के चयन पर ओपनर बल्लेबाज शिखर धवन ने ट्वीट कर अपनी प्रतिक्रिया दी है। धवन ने भारतीय टीम को इस बड़े टूर्नामेंट के लिए शुभकामनाएं दी है। धवन को इस विश्व कप में खेलने का मौका नहीं मिला है।","content":"आईसीसी वनडे विश्व कप 2023 के लिए भारत के 15 सदस्यीय टीम का ऐलान कर दिया गया है। इस टीम में लगभग वहीं खिलाड़ी हैं जिन्हें एशिया कप में मौका मिला है। टीम इंडिया के चयन से पहले कई तरह की अटकलबाजियां चल रही थी लेकिन अब उन सभी विराम लग गया। विश्व कप के लिए इस भारतीय टीम पर ओपनर बल्लेबाज शिखर धवन ने भी अपनी प्रतिक्रिया दी है। हालांकि धवन की इस प्रतिक्रिया को उनका दर्द समझा जाए या फिर निराशा लेकिन उन्होंने अपने ट्वीट में भारतीय टीम को शुभकामनाएं दी है। शिखर धवन ने विश्व कप के स्क्वाड पर ट्वीट कर लिखा, 'मेरे साथी खिलाड़ी और दोस्तों को वर्ल्ड कप में भारत का प्रतिनिधित्व करने के लिए चुने जाने पर बधाई! 150 करोड़ लोगों की दुआ और सपोर्ट के साथ, आप हमारी उम्मीदें और सपनों को आगे बढ़ाते हैं। आशा करता हूं कि आप कप वापस घर लेकर आएं और गर्व महसूस करवाएं!' बता दें कि एशिया कप और विश्व कप दोनों के लिए शिखर धवन को लेकर खूब चर्चा हुई थी। हालांकि एशिया कप में धवन को मौका नहीं मिला। इससे साफ हो गया था कि विश्व कप में उनका पत्ता कट गया है। एक समय था जब रोहित शर्मा के साथ शिखर धवन की जोड़ी सुपरहिट थी लेकिन इस बार के विश्व कप में ऐसा नहीं देखने को मिलेगा। बाएं हाथ का यह ओपनर बल्लेबाज एक समय टीम इंडिया की प्रमुख सदस्य थे। हालांकि गिरते फॉर्म के कारण वह टीम से अंदर बाहर होने लगे। यही कारण है कि इस साल शिखर धवन टीम इंडिया के लिए एक भी मैच में मैदान पर नहीं उतरे। धवन को आखिरी बार पिछले साल बांग्लादेश के खिलाफ के खिलाफ इंटरनेशनल मैच में खेलने का मौका मिला था। इसके बाद ही वह टीम इंडिया से बाहर चल रहे हैं। टीम इंडिया के लिए शिखर धवन का करियर दमदार रहा है। हालांकि फिलहाल वह टीम इंडिया की योजनाओं में शामिल नहीं है। धवन टीम इंडिया के लिए अब तक कुल 34 टेस्ट, 167 वनडे और 68 टी20 मैचों में मैदान पर उतरे हैं। टेस्ट क्रिकेट में धवन ने 237 बनाए हैं जिसमें 7 शतक और 5 अर्धशतक शामिल है। वहीं वनडे में धवन ने 44.11 की औसत से 6793 बनाए हैं। इस फॉर्मेट में धवन के नाम 17 शतक और 39 अर्धशतक दर्ज है। वहीं टी20 में धवन ने 126.36 की स्ट्राइक रेट से 1759 रन बनाए हैं। टी20 में धवन ने 11 अर्धशतक लगाए हैं।","pubDate":"2023-09-06 18:24:56","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"28165a01f6859add75437464cacfad3d","title":"क्या आप भी खरीदना चाहते हैं टिकट, तारीख और समय नोट कर लीजिए, ऐसे मिलेगी स्टेडियम में एंट्री","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/world-cup-2023-bcci-to-release-400000-more-tickets-from-september-8/articleshow/103443238.cms","keywords":null,"creator":null,"video_url":null,"description":"World Cup Online Tickets: वर्ल्ड कप टिकट की भारी डिमांड को देखते हुए तकरीबन और 4 लाख टिकट उपलब्ध करवाने का फैसला लिया गया है। फैंस ऑनलाइन टिकटों की बुकिंग कर सकते हैं।","content":"विश्व कप मुकाबलों के टिकटों की भारी मांग को देखते हुए भारतीय क्रिकेट बोर्ड (बीसीसीआई) इस बहुप्रतीक्षित टूर्नामेंट के लगभग चार लाख टिकट जारी करेगा। बीसीसीआई द्वारा जारी प्रेस विज्ञप्ति में हालांकि यह स्पष्ट नहीं किया गया है कि इन चार लाख टिकटों में भारत के मैचों के कितने प्रतिशत टिकट होंगे। अधिक से अधिक प्रशंसकों तक टिकटों की पहुंच बनाने के लिए यह कदम उठाया जा रहा है। विज्ञप्ति में कहा गया, ‘दुनिया भर के क्रिकेट प्रेमी अब साल की सबसे बड़ी क्रिकेट प्रतियोगिता के लिए अपनी जगह पक्की कर सकते हैं।’ इसके अनुसार, ‘आठ सितंबर 2023 को भारतीय समयानुसार रात आठ बजे से सभी मैचों के टिकटों की बिक्री शुरू होगी। प्रशंसक आधिकारिक वेबसाइट http://https/tickets.cricketworld.com पर जाकर टिकट खरीद सकते हैं। समय आने पर प्रशंसकों को टिकटों की बिक्री के अगले चरण की जानकारी दी जाएगी।’ बीसीसीआई को टूर्नामेंट की शुरुआत से केवल 100 दिन पहले शेड्यूल जारी करने और फिर इसमें बदलाव करने के चलते पहले ही नाराजनी का सामना करना पड़ा है। यही कारण है कि टिकट जारी करने में और देरी हुई। 2023 विश्व कप की शुरुआत 5 अक्टूबर को इंग्लैंड बनाम न्यूजीलैंड के साथ होगी, जो 2019 विश्व कप के फाइनलिस्ट हैं। अहमदाबाद, हैदराबाद, धर्मशाला, दिल्ली, चेन्नई, लखनऊ, पुणे, बेंगलुरु, मुंबई और कोलकाता जैसे 10 शहरों में 10 टीमें एक-दूसरे से लोहा लेंगी। पहला सेमीफाइनल 15 नवंबर को मुंबई और दूसरा सेमीफाइनल 16 नवंबर को कोलकाता में होगा। फाइनल 19 नवंबर को नरेंद्र मोदी स्टेडियम में खेला जाएगा।","pubDate":"2023-09-06 18:16:12","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"bd0ce7a956ac5e5c42c40c4a80a1ac50","title":"क्या नेहरा लेंगे द्रविड़ की जगह, विश्व कप के बाद कौन होगा भारतीय क्रिकेट टीम का हेड कोच","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/all-eyes-on-indian-cricket-team-head-coach-rahul-dravid-contract-after-world-cup-2023/articleshow/103442874.cms","keywords":null,"creator":null,"video_url":null,"description":"रवि शास्त्री की जगह टीम इंडिया के कोच बनाए गए राहुल द्रविड़ ने अबतक कुछ ऐसा नहीं किया, जिसके बूते यह कहा जा सके कि वह एक शानदार कोच हैं। द्रविड़ जितने शानदार बल्लेबाज थे, उतने ही औसत कोच हैं।","content":"भारतीय क्रिकेट टीम के मुख्य कोच राहुल द्रविड़ का दो साल का अनुबंध वनडे विश्वकप के बाद समाप्त हो जाएगा और अगर भारत इसे जीतने में सफल रहता है तो यह देखना दिलचस्प होगा कि द्रविड़ को आगे भी इस पद पर बनाए रखा जाएगा या नहीं। भारत यदि खिताबी मुकाबले में नहीं पहुंच पाता है तो इसकी गाज द्रविड़ पर गिर सकती है क्योंकि टीम के सेमीफाइनल में पहुंचने को बड़ी उपलब्धि नहीं माना जाएगा । भारतीय क्रिकेट बोर्ड (बीसीसीआई) ऐसे में नए कोच की तलाश कर सकता है। यह देखना भी दिलचस्प है कि अगर बीसीसीआई द्रविड़ के सामने नया अनुबंध पेश करता है तो क्या वह इसके इच्छुक होंगे या नहीं। क्रिकेट पंडितों का मानना है कि अगर द्रविड़ कोच पद पर बने रहने के इच्छुक होते हैं तो उन्हें दक्षिण अफ्रीका और इंग्लैंड के खिलाफ टेस्ट श्रृंखलाओं के लिए इस पद पर बनाए रखना चाहिए। विश्वकप के अगले चक्र से पहले टेस्ट और सीमित ओवरों के प्रारूपों के लिए अलग-अलग कोच रखने में कोई बुराई नहीं है जैसा कि अभी इंग्लैंड कर रहा है। द्रविड़ की जगह कोच पद के लिए आशीष नेहरा अच्छी पसंद हो सकते हैं क्योंकि आईपीएल में वह काफी सफल रहे हैं लेकिन इस पूर्व तेज गेंदबाज के करीबियों के अनुसार उनकी राष्ट्रीय टीम का कोच बनने में दिलचस्पी नहीं है क्योंकि गुजरात टाइटंस के साथ उनका अनुबंध 2025 के सत्र तक है। बीसीसीआई के एक पूर्व पदाधिकारी ने गोपनीयता की शर्त परकहा, ‘अगर भारत विश्वकप जीत जाता है तो द्रविड़ हो सकता है एक बड़े खिताब के साथ अपने कार्यकाल का अंत करना पसंद करें, लेकिन अगर आप मुझसे पूछ रहे हो तो मेरा मानना है कि विश्वकप के बाद बीसीसीआई को सभी प्रारूपों के लिए अलग-अलग कोच रखने चाहिए। उन्हें द्रविड़ को टेस्ट टीम का कोच बने रहने के लिए कहना चाहिए।’ राहुल द्रविड़ सीमित ओवरों की क्रिकेट में ऐसी कोई खास छाप नहीं छोड़ पाए, जिससे कि यह कहा जा सके कि वह चतुर रणनीतिकार हैं। ऐसी स्थिति में बीसीसीआई अलग प्रारूपों के लिए अलग-अलग कोच रखने के विकल्प पर विचार कर सकता है।","pubDate":"2023-09-06 17:46:36","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c11552086924854c7dc933de37f66b48","title":"Yuzvendra Chahal set for County stint, signs up to play three games for Kent","link":"https://telanganatoday.com/yuzvendra-chahal-set-for-county-stint-signs-up-to-play-three-games-for-kent","keywords":["News","Sport","County Cricket","Ranji Trophy","Yuzvendra Chahal"],"creator":["ANI"],"video_url":null,"description":"A seasoned white-ball international, Yuzvendra Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India's Ranji Trophy","content":"Home | News | Yuzvendra Chahal Set For County Stint Signs Up To Play Three Games For Kent Yuzvendra Chahal set for County stint, signs up to play three games for Kent A seasoned white-ball international, Yuzvendra Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India's Ranji Trophy By ANI Published Date - 11:15 PM, Wed - 6 September 23 File Photo London: India’s star spinner Yuzvendra Chahal has been signed up by Kent Cricket for the remainder of the County Championship season “subject to regulatory approval”. “Kent Cricket is delighted to announce the signing of India international leg-spinner Yuzvendra Chahal for the Club’s remaining County Championship matches, subject to regulatory approval,” Kent announced in an official statement. A seasoned white-ball international, Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India’s Ranji Trophy . Also previously an India youth international in the sport of chess, he will be available for selection in Kent’s remaining two home Championship matches against Nottinghamshire and Lancashire, as well as Kent’s away fixture against Somerset. On joining Kent in first-class cricket until the end of the season, Chahal said, This is an exciting challenge for me, playing in English county cricket, and one I’m very much looking forward to. Chahal is the second India international to feature for Kent this season, after left-arm seamer Arshdeep Singh also wore the Kent shirt in the Championship competition back in June and July. Kent’s Director of Cricket, Paul Downton, said, We’re delighted to have secured a spinner of Yuzvendra’s quality for the last three Championship matches of the season, with Matt Parkinson not available to us until next year, and Hami Qadri recently injured. He is really looking forward to playing in English conditions and will bring a significant amount of skill and international experience to our squad,” he added. Also Read Yuzvendra Chahal cryptic response after missed out from Asia Cup squad Follow Us : Tags County Cricket Ranji Trophy Yuzvendra Chahal Related News Yuzvendra Chahal signs up with Kent for three-match County Championship stint I still remain optimistic about playing for India: Abhimanyu Easwaran Harbhajan Singh lauds Yuzvendra Chahal despite Asia Cup exclusion Yuzvendra Chahal cryptic response after missed out from Asia Cup squad Nitish Rana announces move to Uttar Pradesh from Delhi for current domestic season Manoj Tiwary comes out retirement, wants to give ‘one more try’ to win Ranji Trophy","pubDate":"2023-09-06 17:45:09","image_url":null,"source_id":"telanganatoday","source_priority":63887,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"292ff331bc6cd253bc4e3cc2a57479f1","title":"PCB ने की फिर से घटिया हरकत, मैच में हुआ नुकसान तो ACC से कर रहा है भरपाई की मांग","link":"https://navbharattimes.indiatimes.com/sports/cricket/asia-cup/pcb-demands-compensation-for-loss-in-match-between-india-vs-nepal/articleshow/103441546.cms","keywords":null,"creator":null,"video_url":null,"description":"Asia cup 2023: पाकिस्तान क्रिकेट बोर्ड ने एशियन क्रिकेट काउंसी से भारत और नेपाल के बीच हुए मुकाबले में टिकट की कम बिक्री के कारण हुए नुकसान के भरपाई की मांग की है। रिपोर्ट के मुताबिक जका अशरफ ने ACC के प्रमुख जय शाह को इस बाबत मेल किया है।","content":"नई दिल्ली: एशिया कप 2023 में सुपर-4 राउंड की शुरुआत हो चुकी है। ग्रुप स्टेज खत्म हो चुका। पाकिस्तान और श्रीलंका की संयुक्त मेजबानी में एशिया का आयोजन हो रहा है। इसे लेकर खूब विवाद भी हुआ। क्योंकि भारत ने पाकिस्तान में जाकर खेलने से साफ मना कर दिया। हालांकि आखिर में यह फैसला लिया गया कि टूर्नामेंट को हाइब्रिड मॉडल पर आयोजित किया जाएगा और ऐसा ही हुआ। पाकिस्तान को सिर्फ 4 मैचों की मेजबानी मिली बाकी के 9 मैच श्रीलंका में खेले जा रहे हैं। हालांकि इस बीच एशिया कप को लेकर एक नया विवाद सामने उठ खड़ा हुआ है। रिपोर्ट के मुताबिक पीसीबी चेयरमैन जका अशरफ ने एशियन क्रिकेट काउंसिल के प्रमुख जय को एक मेल किया है जिसमें उन्होंने नुकसान की भरपाई की मांग की है। इस मेल के मुताबिक पीसीबी के मुखिया ने भारत और नेपाल के बीच हुए मुकाबले में टिकटों की कम बिक्री के कारण जो नुकसान हुआ उसके लिए पैसे की डिमांड की। ऐसे में इस मुद्दे पर एक नया विवाद उठ खड़ा हुआ है। इस नए विवाद के बीच में ही बीसीसीआई की तरफ से रॉजर बिन्नी और राजीव शुक्ला पाकिस्तान दौरे पर गए थे। नुकसान की भरपाई के मुद्दे से अलग अलग पाकिस्तानी दौरे के दौरान उनकी मेहमान नवाजी से बिन्नी और राजीव शुक्ला गदगद हैं। राजीव शुक्ला का मानना है कि क्रिकेट दोनों देशों के संबंधों को सुधारने में सेतु का काम कर सकता है। बिन्नी और शुक्ला पाकिस्तान क्रिकेट बोर्ड के निमंत्रण पर वहां एशिया कप के मैच देखने के लिए गए थे। बीसीसीआई के दोनों पदाधिकारी बुधवार को अटारी वाघा बॉर्डर से स्वदेश लौटे। यह पिछले 17 वर्षों में पहला मौका था जबकि बीसीसीआई के अधिकारियों ने पाकिस्तान का दौरा किया। वे सोमवार को पाकिस्तान पहुंचे थे। बिन्नी ने स्वदेश लौटने पर कहा, 'पाकिस्तान में वहां के पदाधिकारियों के साथ हमारी मुलाकात बहुत अच्छी रही। हमारी वहां अच्छी तरह से खातिरदारी की गई। उन्होंने हमारा अच्छी तरह से ध्यान रखा। हमारा मुख्य एजेंडा क्रिकेट मैच देखना और उनके साथ बातचीत करना था। कुल मिलाकर यह दौरा शानदार रहा।' भारत और पाकिस्तान के बीच राजनीतिक तनाव के कारण बायलेटरल सीरीज नहीं होती हैं और दोनों देश आईसीसी या फिर एशियाई क्रिकेट परिषद की प्रतियोगिताओं में ही एक दूसरे का सामना करते हैं। भारत और पाकिस्तान के बीच बायलेटरल सीरीज शुरू होने की संभावना के बारे में पूछे जाने पर बिन्नी ने कहा कि वे इस पर फैसला नहीं कर सकते।","pubDate":"2023-09-06 17:42:08","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ba40d2cf7fdf0b497f13f5a2572465d8","title":"World Cup में नहीं मिली जगह तो युजवेंद्र चहल ने 'छोड़ा भारत', अब इस टीम से खेलते नजर आएंगे","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/yuzvendra-chahal-signs-up-for-county-championship-games-will-play-for-kent/articleshow/103442399.cms","keywords":null,"creator":null,"video_url":null,"description":"Yuzvendra Chahal अगले कुछ महीने आपको भारतीय क्रिकेट टीम से नहीं बल्कि इंग्लैंड की इस काउंटी टीम से खेलते नजर आएंगे। विश्व कप और एशिया कप टीम से बाहर किए जाने के बाद उन्होंने यह फैसला लिया है।","content":"एशिया कप और वनडे विश्व कप के लिए भारतीय टीम में नहीं चुने गए लेग स्पिनर युजवेंद्र चहल ने देश छोड़ने का फैसला कर लिया है। अरे घबराइए मत! युजवेंद्र चहल ने किसी दूसरे देश की नागरिकता नहीं ली है बल्कि वह ब्रिटेन जाने वाले हैं। अब वहां काउंटी क्रिकेट में हाथ आजमाएंगे। 33 वर्षीय लेग स्पिनर चहल ने काउंटी चैंपियनशिप के तीन मैच में खेलने के लिए इंग्लिश काउंटी टीम कैंट के साथ अनुबंध किया है। चहल कैंट के नॉटिंघमशर और लंकाशर के खिलाफ होने वाले घरेलू मैच तथा समरसेट के खिलाफ उसके मैदान पर होने वाले मैच के लिए उपलब्ध रहेंगे। भारत के लिए 121 वनडे और 96 टी-20 इंटरनेशनल विकेट झटकने वाले युजवेंद्र चहल ने इस काउंटी टीम के बयान में कहा, ‘इंग्लिश काउंटी क्रिकेट में खेलना मेरे लिए रोमांचक चुनौती है और मैं इसको लेकर बेहद उत्साहित हूं।’ वह कैंट की तरफ से खेलने वाले दूसरे भारतीय खिलाड़ी बनेंगे। तेज गेंदबाज अर्शदीप सिंह जून-जुलाई में कैंट की तरफ से पांच मैचों में खेले थे जिनमें उन्होंने 13 विकेट हासिल किए थे। केंट को वर्तमान में 10 टीम काउंटी चैंपियंस डिवीजन-1 तालिका में सबसे नीचे रखा गया है और अगले सेशन में डिवीजन-2 में जाने का खतरा है। वैसे भारतीय टीम में सिलेक्शन के बाद से युजवेंद्र चहल ने टाइट शेड्यूल के चलते डोमेस्टिक क्रिकेट खेलना छोड़ दिया था। रणजी ट्रॉफी के पिछले सीजन में उन्होंने हरियाणा के लिए दो मैच खेले थे। युजवेंद्र चहल के पास कुल मिलाकर 33 प्रथम श्रेणी मैच का अनुभव है, जिसमें उन्होंने 87 विकेट चटकाए। मगर उनकी पहचान वाइट बॉल क्रिकेटर के रूप में ज्यादा है, जहां उन्होंने 72 एकदिवसीय मैचों में 27.13 की औसत से 121 विकेट और 8.19 की इकॉनमी रेट के साथ 80 टी-20 इंटरनेशनल में 96 विकेट लिए हैं। चहल आज भी अपने टेस्ट डेब्यू का इंतजार कर रहे हैं।","pubDate":"2023-09-06 17:21:42","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c33eb941f8b29ee51245374eb295d7ac","title":"Chamari Athapaththu stars to lead Sri Lanka to series win over England","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-kate-cross-chelmsford-t20-b2406691.html","keywords":["Cricket","Sport"],"creator":["Jonathan Veal"],"video_url":null,"description":"Athapaththu claimed figures of three for 21 and then hit 44.","content":"Chamari Athapaththu was again the star for Sri Lanka as they earned a historic Twenty20 international series win against England . Athapaththu claimed figures of three for 21 as the hosts were bowled out for 116 before whacking 44 to fire her side to a seven-wicket victory, which sealed a memorable 2-1 series success in the decider at Derby. The Sri Lanka captain hit a half-century in Saturday’s win at Chelmsford and again brought the fireworks, plundering two sixes and five fours in her 28-ball innings. It meant that England lost a T20 series to a team other than Australia for the first time since 2010, while also losing a first-ever white-ball series to Sri Lanka. The opening ball of the match set the tone for England’s disappointing innings as Danni Wyatt slapped a gentle long hop straight to cover and it got worse after a calamitous run out at the end of the second over, where Maia Bouchier and Alice Capsey were both at the same end. They never got to grips with Sri Lanka’s array of slower bowlers, with skipper Athapaththu taking three wickets and Udeshika Prabodhani and Kavisha Dilhari both claiming two victims apiece. Bouchier top scored with 23 while Danielle Gibson added 21 late as England failed to see out their overs. Athapaththu came out firing and did the leg work of Sri Lanka’s chase in the first seven overs, hitting Kate Cross and 17-year-old Mahika Gaur over the ropes in an array of boundaries. Her dismissal with score on 65 could have opened the door for England, but they could not make regular inroads and the visitors got over the line with 18 balls to spare.","pubDate":"2023-09-06 19:49:22","image_url":"https://static.independent.co.uk/2023/09/06/20/664d724ab356c3d010d31946be7e234bY29udGVudHNlYXJjaGFwaSwxNjk0MTE2MDgy-2.73562987.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd3e85ce0e345bed3d0ab0a3fda2ac8f","title":"Heath Streak cremated, legendary cricketer’s wish reportedly fulfilled","link":"https://nehandaradio.com/2023/09/06/heath-streak-cremated-legendary-cricketers-wish-reportedly-fulfilled/","keywords":["Cricket","Featured","News","Sports","Heath Streak"],"creator":["Staff Reporter"],"video_url":null,"description":"Renowned former Zimbabwe cricket captain and coach, Heath Streak, who died aged 49 in the wee hours of Sunday morning has reportedly been cremated. The post Heath Streak cremated, legendary cricketer’s wish reportedly fulfilled appeared first on Nehanda Radio.","content":"The cremation comes after Streak who is said to be one of the greatest ever cricketers to emerge in Zimbabwe, told his family he wanted to be cremated. This was confirmed on Thursday by John Rennie, the family’s spokesperson and longtime friend. He told Zimpapers Sports Hub: “I can confirm that Heath Streak has been cremated as per his wish.,” he said. Streak’s memorial service is set to be held on Friday at Four Winds Suburb, Bulawayo at Mystique Gardens. He survived by his wife Nadine and four children.","pubDate":"2023-09-06 19:18:48","image_url":null,"source_id":"nehandaradio","source_priority":389454,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"ca671fd95c21a4ab2eddea92fcb9c10c","title":"Asia Cup 2023 Super Four: \"दुर्भाग्य से इस तरह...\" हार के बाद बांग्लादेश कप्तान शाकिब ने पाकिस्तान टीम को लेकर कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/shakib-al-hasan-bangladesh-captain-big-statement-after-lose-over-pakistan-in-asia-cup-2023-super-four-matc-4366716#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"PAK vs BAN Asia Cup 2023 Super Four: एशिया कप के सुपर 4 मुकाबले में पाकिस्तान ने बांग्लादेश को 7 विकेट से दी मात.","content":"Shakib Al Hasan on Lose vs pakistan in Asia Cup super four बांग्लादेश के कप्तान शाकिब अल हसन ने एशिया कप क्रिकेट टूर्नामेंट के सुपर चार चरण के मुकाबले में बुधवार को यहां पाकिस्तान के खिलाफ सात विकेट की एकतरफा हार का दोष बल्लेबाजों पर मढ़ते हुए कहा कि इस तरह के विकेट पर उन्होंने बहुत खराब बल्लेबाजी की. बांग्लादेश के 194 रन के लक्ष्य का पीछा करते हुए पाकिस्तान ने इमाम उल हक (84 गेंद में 78 रन, पांच चौके, चार छक्के) और मोहम्मद रिजवान (MD Rizwan) (79 गेंद में नाबाद 63, सात चौके, एक छक्का) के अर्धशतक और दोनों के बीच तीसरे विकेट की 85 रन की साझेदारी की बदौलत 63 गेंद शेष रहते तीन विकेट पर 194 रन बनाकर जीत दर्ज की. बांग्लादेश इससे पहले मुशफिकुर रहीम (Mushfiqur Rahim Half Century) (87 गेंद में 64 रन, पांच चौके) और कप्तान शाकिब अल हसन (57 गेंद में 53 रन, सात चौके) के अर्धशतक और दोनों के बीच 100 रन की साझेदारी के बावजूद हारिस राउफ (19 रन पर चार विकेट) और नसीम शाह (34 रन पर चार विकेट) की धारदार गेंदबाजी के सामने 38.4 ओवर में 193 रन पर ही सिमट गया. शाकिब (Shakib Al Hasan on Lose over Pakistan) ने मैच के बाद कहा, ‘‘इस तरह के विकेट पर बहुत खराब बल्लेबाजी प्रदर्शन लेकिन हमें अगले मुकाबले पर ध्यान देना होगा. वे नंबर एक टीम हैं और इसका कारण यही है. उनके पास तीन विश्व स्तरीय गेंदबाज हैं जो उनके लिए चीजें आसान बना रहे हैं. हम गेंदबाजी विभाग में अच्छा प्रदर्शन कर रहे हैं लेकिन बल्लेबाजी उम्मीद के मुताबिक नहीं है. हमें और अधिक निरंतर प्रदर्शन करने की जरूरत है.'' उन्होंने कहा, ‘‘ मुझे लगता है कि हमारे तीन तेज गेंदबाजों ने शानदार गेंदबाजी की. पाकिस्तान की तरह हमारे तेज गेंदबाज पिछले कुछ वर्षों में बहुत अच्छी गेंदबाजी कर रहे हैं लेकिन, दुर्भाग्य से इस तरह की पिच पर आप तब तक विकेट नहीं पा सकते जब तक कि बल्लेबाज गलतियां नहीं करें.'' शाकिब ने कहा कि उनके बल्लेबाजों ने साधारण शॉट खेलकर शुरुआत में ही काफी विकेट गंवा दिए. उन्होंने कहा, ‘‘हमने शुरुआत में जल्दी विकेट खो दिए और हमने कुछ सामान्य शॉट खेले। इस तरह के विकेट पर हमें शुरुआती दस ओवर में चार विकेट नहीं गंवाने चाहिए लेकिन ऐसा होता है. हमारी साझेदारी अच्छी थी, हमें सात या आठ ओवर और बल्लेबाजी करने की जरूरत थी.'' श्रीलंका में खेलने के संदर्भ में उन्होंने कहा, ‘‘जब मैं एलपीएल (लंका प्रीमियर लीग) में खेला था तो पिचें थोड़ी धीमी थीं, विकेट पर असमान उछाल था और इससे हमें मदद मिलेगी. उम्मीद है कि हम कोलंबो में अच्छा प्रदर्शन करेंगे.'' बाबर ने कहा, ‘‘सभी खिलाड़ियों को श्रेय, विशेषकर शुरुआती दस ओवरों को। वे पहले दस ओवरों में अच्छी गेंदबाजी कर रहे हैं और फिर हारिस राउफ (Babar Azam on Haris Rauf) भी वास्तव में अच्छी गेंदबाजी कर रहे हैं. तेज गेंदबाजों को थोड़ी मदद मिल रही थी और फहीम (अशरफ) ने वास्तव में अच्छी गेंदबाजी की. जीतना हमेशा आपको आत्मविश्वास देता है.'' टीम पर दबाव के संदर्भ में उन्होंने कहा, ‘‘मुझे ऐसा नहीं लगता. हम हर मैच में अपना सर्वश्रेष्ठ दे रहे हैं.'' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-06 19:07:53","image_url":"https://c.ndtvimg.com/2023-07/qph0ekhg_shakib-al-hasan_625x300_17_July_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2892121cd6b49de3fbc9063b0ed6f211","title":"Sri Lanka dismiss England for 116 in T20 series decider in Derby","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-t20-heather-knight-england-cricket-b2406666.html","keywords":["Cricket","Sport"],"creator":["Jonathan Veal"],"video_url":null,"description":"Maia Bouchier top scored with 23 while Danielle Gibson added 21 late as England were skittled in the 19th over.","content":"England will have to defend a below-par score of 116 if they are to win their Twenty20 international series against Sri Lanka . With the three-match contest tied at 1-1, the hosts were bowled out for a disappointing 116 after being invited to bat first in the decider at Derby . They never got to grips with Sri Lanka’s array of slower bowlers, with Chamari Athapaththu taking three for 21 and Udeshika Prabodhani and Kavisha Dilhari both claiming two wickets apiece. Maia Bouchier top scored with 23 while Danielle Gibson added 21 late as England were skittled in the 19th over. The innings could not have got off to a worse start as Danni Wyatt planted a gentle wide delivery from Inoshi Fernando straight to cover. The Sri Lankans were celebrating again at the end of the second over when a calamitous mix-up between Bouchier and Alice Capsey saw both batters at the same end, with the latter ran out. Bouchier and captain Heather Knight did some repair work, sharing a 30-run stand in four overs, but that came to an end when Bouchier holed out to long-on. Knight (18) and Amy Jones (20) soon followed as England slipped to 72 for five in the 11th over and it looked like they would struggle to get to 100. But Gibson hit three fours in her 15-ball innings to get them to three figures before a flurry of late wickets saw them fail to see out their overs.","pubDate":"2023-09-06 18:36:51","image_url":"https://static.independent.co.uk/2023/09/06/19/9693ee163058ed4da8bdb50ffdbb23edY29udGVudHNlYXJjaGFwaSwxNjk0MTExNDYw-2.73625631.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ae19dd97749ced4b18cec5db79dbf0c","title":"विश्व कप की टीम पर ये क्या बोल गए शिखर धवन? आखिर तोड़ ही दी अपनी चुप्पी!","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/shikhar-dhawan-break-his-silence-on-world-cup-team-said-this-big-thing-in-gestures/articleshow/103443360.cms","keywords":null,"creator":null,"video_url":null,"description":"Shikhar Dhawan: विश्व कप के लिए हुए टीम इंडिया के चयन पर ओपनर बल्लेबाज शिखर धवन ने ट्वीट कर अपनी प्रतिक्रिया दी है। धवन ने भारतीय टीम को इस बड़े टूर्नामेंट के लिए शुभकामनाएं दी है। धवन को इस विश्व कप में खेलने का मौका नहीं मिला है।","content":"आईसीसी वनडे विश्व कप 2023 के लिए भारत के 15 सदस्यीय टीम का ऐलान कर दिया गया है। इस टीम में लगभग वहीं खिलाड़ी हैं जिन्हें एशिया कप में मौका मिला है। टीम इंडिया के चयन से पहले कई तरह की अटकलबाजियां चल रही थी लेकिन अब उन सभी विराम लग गया। विश्व कप के लिए इस भारतीय टीम पर ओपनर बल्लेबाज शिखर धवन ने भी अपनी प्रतिक्रिया दी है। हालांकि धवन की इस प्रतिक्रिया को उनका दर्द समझा जाए या फिर निराशा लेकिन उन्होंने अपने ट्वीट में भारतीय टीम को शुभकामनाएं दी है। शिखर धवन ने विश्व कप के स्क्वाड पर ट्वीट कर लिखा, 'मेरे साथी खिलाड़ी और दोस्तों को वर्ल्ड कप में भारत का प्रतिनिधित्व करने के लिए चुने जाने पर बधाई! 150 करोड़ लोगों की दुआ और सपोर्ट के साथ, आप हमारी उम्मीदें और सपनों को आगे बढ़ाते हैं। आशा करता हूं कि आप कप वापस घर लेकर आएं और गर्व महसूस करवाएं!' बता दें कि एशिया कप और विश्व कप दोनों के लिए शिखर धवन को लेकर खूब चर्चा हुई थी। हालांकि एशिया कप में धवन को मौका नहीं मिला। इससे साफ हो गया था कि विश्व कप में उनका पत्ता कट गया है। एक समय था जब रोहित शर्मा के साथ शिखर धवन की जोड़ी सुपरहिट थी लेकिन इस बार के विश्व कप में ऐसा नहीं देखने को मिलेगा। बाएं हाथ का यह ओपनर बल्लेबाज एक समय टीम इंडिया की प्रमुख सदस्य थे। हालांकि गिरते फॉर्म के कारण वह टीम से अंदर बाहर होने लगे। यही कारण है कि इस साल शिखर धवन टीम इंडिया के लिए एक भी मैच में मैदान पर नहीं उतरे। धवन को आखिरी बार पिछले साल बांग्लादेश के खिलाफ के खिलाफ इंटरनेशनल मैच में खेलने का मौका मिला था। इसके बाद ही वह टीम इंडिया से बाहर चल रहे हैं। टीम इंडिया के लिए शिखर धवन का करियर दमदार रहा है। हालांकि फिलहाल वह टीम इंडिया की योजनाओं में शामिल नहीं है। धवन टीम इंडिया के लिए अब तक कुल 34 टेस्ट, 167 वनडे और 68 टी20 मैचों में मैदान पर उतरे हैं। टेस्ट क्रिकेट में धवन ने 237 बनाए हैं जिसमें 7 शतक और 5 अर्धशतक शामिल है। वहीं वनडे में धवन ने 44.11 की औसत से 6793 बनाए हैं। इस फॉर्मेट में धवन के नाम 17 शतक और 39 अर्धशतक दर्ज है। वहीं टी20 में धवन ने 126.36 की स्ट्राइक रेट से 1759 रन बनाए हैं। टी20 में धवन ने 11 अर्धशतक लगाए हैं।","pubDate":"2023-09-06 18:24:56","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"28165a01f6859add75437464cacfad3d","title":"क्या आप भी खरीदना चाहते हैं टिकट, तारीख और समय नोट कर लीजिए, ऐसे मिलेगी स्टेडियम में एंट्री","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/world-cup-2023-bcci-to-release-400000-more-tickets-from-september-8/articleshow/103443238.cms","keywords":null,"creator":null,"video_url":null,"description":"World Cup Online Tickets: वर्ल्ड कप टिकट की भारी डिमांड को देखते हुए तकरीबन और 4 लाख टिकट उपलब्ध करवाने का फैसला लिया गया है। फैंस ऑनलाइन टिकटों की बुकिंग कर सकते हैं।","content":"विश्व कप मुकाबलों के टिकटों की भारी मांग को देखते हुए भारतीय क्रिकेट बोर्ड (बीसीसीआई) इस बहुप्रतीक्षित टूर्नामेंट के लगभग चार लाख टिकट जारी करेगा। बीसीसीआई द्वारा जारी प्रेस विज्ञप्ति में हालांकि यह स्पष्ट नहीं किया गया है कि इन चार लाख टिकटों में भारत के मैचों के कितने प्रतिशत टिकट होंगे। अधिक से अधिक प्रशंसकों तक टिकटों की पहुंच बनाने के लिए यह कदम उठाया जा रहा है। विज्ञप्ति में कहा गया, ‘दुनिया भर के क्रिकेट प्रेमी अब साल की सबसे बड़ी क्रिकेट प्रतियोगिता के लिए अपनी जगह पक्की कर सकते हैं।’ इसके अनुसार, ‘आठ सितंबर 2023 को भारतीय समयानुसार रात आठ बजे से सभी मैचों के टिकटों की बिक्री शुरू होगी। प्रशंसक आधिकारिक वेबसाइट http://https/tickets.cricketworld.com पर जाकर टिकट खरीद सकते हैं। समय आने पर प्रशंसकों को टिकटों की बिक्री के अगले चरण की जानकारी दी जाएगी।’ बीसीसीआई को टूर्नामेंट की शुरुआत से केवल 100 दिन पहले शेड्यूल जारी करने और फिर इसमें बदलाव करने के चलते पहले ही नाराजनी का सामना करना पड़ा है। यही कारण है कि टिकट जारी करने में और देरी हुई। 2023 विश्व कप की शुरुआत 5 अक्टूबर को इंग्लैंड बनाम न्यूजीलैंड के साथ होगी, जो 2019 विश्व कप के फाइनलिस्ट हैं। अहमदाबाद, हैदराबाद, धर्मशाला, दिल्ली, चेन्नई, लखनऊ, पुणे, बेंगलुरु, मुंबई और कोलकाता जैसे 10 शहरों में 10 टीमें एक-दूसरे से लोहा लेंगी। पहला सेमीफाइनल 15 नवंबर को मुंबई और दूसरा सेमीफाइनल 16 नवंबर को कोलकाता में होगा। फाइनल 19 नवंबर को नरेंद्र मोदी स्टेडियम में खेला जाएगा।","pubDate":"2023-09-06 18:16:12","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"bd0ce7a956ac5e5c42c40c4a80a1ac50","title":"क्या नेहरा लेंगे द्रविड़ की जगह, विश्व कप के बाद कौन होगा भारतीय क्रिकेट टीम का हेड कोच","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/all-eyes-on-indian-cricket-team-head-coach-rahul-dravid-contract-after-world-cup-2023/articleshow/103442874.cms","keywords":null,"creator":null,"video_url":null,"description":"रवि शास्त्री की जगह टीम इंडिया के कोच बनाए गए राहुल द्रविड़ ने अबतक कुछ ऐसा नहीं किया, जिसके बूते यह कहा जा सके कि वह एक शानदार कोच हैं। द्रविड़ जितने शानदार बल्लेबाज थे, उतने ही औसत कोच हैं।","content":"भारतीय क्रिकेट टीम के मुख्य कोच राहुल द्रविड़ का दो साल का अनुबंध वनडे विश्वकप के बाद समाप्त हो जाएगा और अगर भारत इसे जीतने में सफल रहता है तो यह देखना दिलचस्प होगा कि द्रविड़ को आगे भी इस पद पर बनाए रखा जाएगा या नहीं। भारत यदि खिताबी मुकाबले में नहीं पहुंच पाता है तो इसकी गाज द्रविड़ पर गिर सकती है क्योंकि टीम के सेमीफाइनल में पहुंचने को बड़ी उपलब्धि नहीं माना जाएगा । भारतीय क्रिकेट बोर्ड (बीसीसीआई) ऐसे में नए कोच की तलाश कर सकता है। यह देखना भी दिलचस्प है कि अगर बीसीसीआई द्रविड़ के सामने नया अनुबंध पेश करता है तो क्या वह इसके इच्छुक होंगे या नहीं। क्रिकेट पंडितों का मानना है कि अगर द्रविड़ कोच पद पर बने रहने के इच्छुक होते हैं तो उन्हें दक्षिण अफ्रीका और इंग्लैंड के खिलाफ टेस्ट श्रृंखलाओं के लिए इस पद पर बनाए रखना चाहिए। विश्वकप के अगले चक्र से पहले टेस्ट और सीमित ओवरों के प्रारूपों के लिए अलग-अलग कोच रखने में कोई बुराई नहीं है जैसा कि अभी इंग्लैंड कर रहा है। द्रविड़ की जगह कोच पद के लिए आशीष नेहरा अच्छी पसंद हो सकते हैं क्योंकि आईपीएल में वह काफी सफल रहे हैं लेकिन इस पूर्व तेज गेंदबाज के करीबियों के अनुसार उनकी राष्ट्रीय टीम का कोच बनने में दिलचस्पी नहीं है क्योंकि गुजरात टाइटंस के साथ उनका अनुबंध 2025 के सत्र तक है। बीसीसीआई के एक पूर्व पदाधिकारी ने गोपनीयता की शर्त परकहा, ‘अगर भारत विश्वकप जीत जाता है तो द्रविड़ हो सकता है एक बड़े खिताब के साथ अपने कार्यकाल का अंत करना पसंद करें, लेकिन अगर आप मुझसे पूछ रहे हो तो मेरा मानना है कि विश्वकप के बाद बीसीसीआई को सभी प्रारूपों के लिए अलग-अलग कोच रखने चाहिए। उन्हें द्रविड़ को टेस्ट टीम का कोच बने रहने के लिए कहना चाहिए।’ राहुल द्रविड़ सीमित ओवरों की क्रिकेट में ऐसी कोई खास छाप नहीं छोड़ पाए, जिससे कि यह कहा जा सके कि वह चतुर रणनीतिकार हैं। ऐसी स्थिति में बीसीसीआई अलग प्रारूपों के लिए अलग-अलग कोच रखने के विकल्प पर विचार कर सकता है।","pubDate":"2023-09-06 17:46:36","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c11552086924854c7dc933de37f66b48","title":"Yuzvendra Chahal set for County stint, signs up to play three games for Kent","link":"https://telanganatoday.com/yuzvendra-chahal-set-for-county-stint-signs-up-to-play-three-games-for-kent","keywords":["News","Sport","County Cricket","Ranji Trophy","Yuzvendra Chahal"],"creator":["ANI"],"video_url":null,"description":"A seasoned white-ball international, Yuzvendra Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India's Ranji Trophy","content":"Home | News | Yuzvendra Chahal Set For County Stint Signs Up To Play Three Games For Kent Yuzvendra Chahal set for County stint, signs up to play three games for Kent A seasoned white-ball international, Yuzvendra Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India's Ranji Trophy By ANI Published Date - 11:15 PM, Wed - 6 September 23 File Photo London: India’s star spinner Yuzvendra Chahal has been signed up by Kent Cricket for the remainder of the County Championship season “subject to regulatory approval”. “Kent Cricket is delighted to announce the signing of India international leg-spinner Yuzvendra Chahal for the Club’s remaining County Championship matches, subject to regulatory approval,” Kent announced in an official statement. A seasoned white-ball international, Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India’s Ranji Trophy . Also previously an India youth international in the sport of chess, he will be available for selection in Kent’s remaining two home Championship matches against Nottinghamshire and Lancashire, as well as Kent’s away fixture against Somerset. On joining Kent in first-class cricket until the end of the season, Chahal said, This is an exciting challenge for me, playing in English county cricket, and one I’m very much looking forward to. Chahal is the second India international to feature for Kent this season, after left-arm seamer Arshdeep Singh also wore the Kent shirt in the Championship competition back in June and July. Kent’s Director of Cricket, Paul Downton, said, We’re delighted to have secured a spinner of Yuzvendra’s quality for the last three Championship matches of the season, with Matt Parkinson not available to us until next year, and Hami Qadri recently injured. He is really looking forward to playing in English conditions and will bring a significant amount of skill and international experience to our squad,” he added. Also Read Yuzvendra Chahal cryptic response after missed out from Asia Cup squad Follow Us : Tags County Cricket Ranji Trophy Yuzvendra Chahal Related News Yuzvendra Chahal signs up with Kent for three-match County Championship stint I still remain optimistic about playing for India: Abhimanyu Easwaran Harbhajan Singh lauds Yuzvendra Chahal despite Asia Cup exclusion Yuzvendra Chahal cryptic response after missed out from Asia Cup squad Nitish Rana announces move to Uttar Pradesh from Delhi for current domestic season Manoj Tiwary comes out retirement, wants to give ‘one more try’ to win Ranji Trophy","pubDate":"2023-09-06 17:45:09","image_url":null,"source_id":"telanganatoday","source_priority":63887,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"292ff331bc6cd253bc4e3cc2a57479f1","title":"PCB ने की फिर से घटिया हरकत, मैच में हुआ नुकसान तो ACC से कर रहा है भरपाई की मांग","link":"https://navbharattimes.indiatimes.com/sports/cricket/asia-cup/pcb-demands-compensation-for-loss-in-match-between-india-vs-nepal/articleshow/103441546.cms","keywords":null,"creator":null,"video_url":null,"description":"Asia cup 2023: पाकिस्तान क्रिकेट बोर्ड ने एशियन क्रिकेट काउंसी से भारत और नेपाल के बीच हुए मुकाबले में टिकट की कम बिक्री के कारण हुए नुकसान के भरपाई की मांग की है। रिपोर्ट के मुताबिक जका अशरफ ने ACC के प्रमुख जय शाह को इस बाबत मेल किया है।","content":"नई दिल्ली: एशिया कप 2023 में सुपर-4 राउंड की शुरुआत हो चुकी है। ग्रुप स्टेज खत्म हो चुका। पाकिस्तान और श्रीलंका की संयुक्त मेजबानी में एशिया का आयोजन हो रहा है। इसे लेकर खूब विवाद भी हुआ। क्योंकि भारत ने पाकिस्तान में जाकर खेलने से साफ मना कर दिया। हालांकि आखिर में यह फैसला लिया गया कि टूर्नामेंट को हाइब्रिड मॉडल पर आयोजित किया जाएगा और ऐसा ही हुआ। पाकिस्तान को सिर्फ 4 मैचों की मेजबानी मिली बाकी के 9 मैच श्रीलंका में खेले जा रहे हैं। हालांकि इस बीच एशिया कप को लेकर एक नया विवाद सामने उठ खड़ा हुआ है। रिपोर्ट के मुताबिक पीसीबी चेयरमैन जका अशरफ ने एशियन क्रिकेट काउंसिल के प्रमुख जय को एक मेल किया है जिसमें उन्होंने नुकसान की भरपाई की मांग की है। इस मेल के मुताबिक पीसीबी के मुखिया ने भारत और नेपाल के बीच हुए मुकाबले में टिकटों की कम बिक्री के कारण जो नुकसान हुआ उसके लिए पैसे की डिमांड की। ऐसे में इस मुद्दे पर एक नया विवाद उठ खड़ा हुआ है। इस नए विवाद के बीच में ही बीसीसीआई की तरफ से रॉजर बिन्नी और राजीव शुक्ला पाकिस्तान दौरे पर गए थे। नुकसान की भरपाई के मुद्दे से अलग अलग पाकिस्तानी दौरे के दौरान उनकी मेहमान नवाजी से बिन्नी और राजीव शुक्ला गदगद हैं। राजीव शुक्ला का मानना है कि क्रिकेट दोनों देशों के संबंधों को सुधारने में सेतु का काम कर सकता है। बिन्नी और शुक्ला पाकिस्तान क्रिकेट बोर्ड के निमंत्रण पर वहां एशिया कप के मैच देखने के लिए गए थे। बीसीसीआई के दोनों पदाधिकारी बुधवार को अटारी वाघा बॉर्डर से स्वदेश लौटे। यह पिछले 17 वर्षों में पहला मौका था जबकि बीसीसीआई के अधिकारियों ने पाकिस्तान का दौरा किया। वे सोमवार को पाकिस्तान पहुंचे थे। बिन्नी ने स्वदेश लौटने पर कहा, 'पाकिस्तान में वहां के पदाधिकारियों के साथ हमारी मुलाकात बहुत अच्छी रही। हमारी वहां अच्छी तरह से खातिरदारी की गई। उन्होंने हमारा अच्छी तरह से ध्यान रखा। हमारा मुख्य एजेंडा क्रिकेट मैच देखना और उनके साथ बातचीत करना था। कुल मिलाकर यह दौरा शानदार रहा।' भारत और पाकिस्तान के बीच राजनीतिक तनाव के कारण बायलेटरल सीरीज नहीं होती हैं और दोनों देश आईसीसी या फिर एशियाई क्रिकेट परिषद की प्रतियोगिताओं में ही एक दूसरे का सामना करते हैं। भारत और पाकिस्तान के बीच बायलेटरल सीरीज शुरू होने की संभावना के बारे में पूछे जाने पर बिन्नी ने कहा कि वे इस पर फैसला नहीं कर सकते।","pubDate":"2023-09-06 17:42:08","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ba40d2cf7fdf0b497f13f5a2572465d8","title":"World Cup में नहीं मिली जगह तो युजवेंद्र चहल ने 'छोड़ा भारत', अब इस टीम से खेलते नजर आएंगे","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/yuzvendra-chahal-signs-up-for-county-championship-games-will-play-for-kent/articleshow/103442399.cms","keywords":null,"creator":null,"video_url":null,"description":"Yuzvendra Chahal अगले कुछ महीने आपको भारतीय क्रिकेट टीम से नहीं बल्कि इंग्लैंड की इस काउंटी टीम से खेलते नजर आएंगे। विश्व कप और एशिया कप टीम से बाहर किए जाने के बाद उन्होंने यह फैसला लिया है।","content":"एशिया कप और वनडे विश्व कप के लिए भारतीय टीम में नहीं चुने गए लेग स्पिनर युजवेंद्र चहल ने देश छोड़ने का फैसला कर लिया है। अरे घबराइए मत! युजवेंद्र चहल ने किसी दूसरे देश की नागरिकता नहीं ली है बल्कि वह ब्रिटेन जाने वाले हैं। अब वहां काउंटी क्रिकेट में हाथ आजमाएंगे। 33 वर्षीय लेग स्पिनर चहल ने काउंटी चैंपियनशिप के तीन मैच में खेलने के लिए इंग्लिश काउंटी टीम कैंट के साथ अनुबंध किया है। चहल कैंट के नॉटिंघमशर और लंकाशर के खिलाफ होने वाले घरेलू मैच तथा समरसेट के खिलाफ उसके मैदान पर होने वाले मैच के लिए उपलब्ध रहेंगे। भारत के लिए 121 वनडे और 96 टी-20 इंटरनेशनल विकेट झटकने वाले युजवेंद्र चहल ने इस काउंटी टीम के बयान में कहा, ‘इंग्लिश काउंटी क्रिकेट में खेलना मेरे लिए रोमांचक चुनौती है और मैं इसको लेकर बेहद उत्साहित हूं।’ वह कैंट की तरफ से खेलने वाले दूसरे भारतीय खिलाड़ी बनेंगे। तेज गेंदबाज अर्शदीप सिंह जून-जुलाई में कैंट की तरफ से पांच मैचों में खेले थे जिनमें उन्होंने 13 विकेट हासिल किए थे। केंट को वर्तमान में 10 टीम काउंटी चैंपियंस डिवीजन-1 तालिका में सबसे नीचे रखा गया है और अगले सेशन में डिवीजन-2 में जाने का खतरा है। वैसे भारतीय टीम में सिलेक्शन के बाद से युजवेंद्र चहल ने टाइट शेड्यूल के चलते डोमेस्टिक क्रिकेट खेलना छोड़ दिया था। रणजी ट्रॉफी के पिछले सीजन में उन्होंने हरियाणा के लिए दो मैच खेले थे। युजवेंद्र चहल के पास कुल मिलाकर 33 प्रथम श्रेणी मैच का अनुभव है, जिसमें उन्होंने 87 विकेट चटकाए। मगर उनकी पहचान वाइट बॉल क्रिकेटर के रूप में ज्यादा है, जहां उन्होंने 72 एकदिवसीय मैचों में 27.13 की औसत से 121 विकेट और 8.19 की इकॉनमी रेट के साथ 80 टी-20 इंटरनेशनल में 96 विकेट लिए हैं। चहल आज भी अपने टेस्ट डेब्यू का इंतजार कर रहे हैं।","pubDate":"2023-09-06 17:21:42","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c33eb941f8b29ee51245374eb295d7ac","title":"Chamari Athapaththu stars to lead Sri Lanka to series win over England","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-kate-cross-chelmsford-t20-b2406691.html","keywords":["Cricket","Sport"],"creator":["Jonathan Veal"],"video_url":null,"description":"Athapaththu claimed figures of three for 21 and then hit 44.","content":"Chamari Athapaththu was again the star for Sri Lanka as they earned a historic Twenty20 international series win against England . Athapaththu claimed figures of three for 21 as the hosts were bowled out for 116 before whacking 44 to fire her side to a seven-wicket victory, which sealed a memorable 2-1 series success in the decider at Derby. The Sri Lanka captain hit a half-century in Saturday’s win at Chelmsford and again brought the fireworks, plundering two sixes and five fours in her 28-ball innings. It meant that England lost a T20 series to a team other than Australia for the first time since 2010, while also losing a first-ever white-ball series to Sri Lanka. The opening ball of the match set the tone for England’s disappointing innings as Danni Wyatt slapped a gentle long hop straight to cover and it got worse after a calamitous run out at the end of the second over, where Maia Bouchier and Alice Capsey were both at the same end. They never got to grips with Sri Lanka’s array of slower bowlers, with skipper Athapaththu taking three wickets and Udeshika Prabodhani and Kavisha Dilhari both claiming two victims apiece. Bouchier top scored with 23 while Danielle Gibson added 21 late as England failed to see out their overs. Athapaththu came out firing and did the leg work of Sri Lanka’s chase in the first seven overs, hitting Kate Cross and 17-year-old Mahika Gaur over the ropes in an array of boundaries. Her dismissal with score on 65 could have opened the door for England, but they could not make regular inroads and the visitors got over the line with 18 balls to spare.","pubDate":"2023-09-06 19:49:22","image_url":"https://static.independent.co.uk/2023/09/06/20/664d724ab356c3d010d31946be7e234bY29udGVudHNlYXJjaGFwaSwxNjk0MTE2MDgy-2.73562987.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"dd3e85ce0e345bed3d0ab0a3fda2ac8f","title":"Heath Streak cremated, legendary cricketer’s wish reportedly fulfilled","link":"https://nehandaradio.com/2023/09/06/heath-streak-cremated-legendary-cricketers-wish-reportedly-fulfilled/","keywords":["Cricket","Featured","News","Sports","Heath Streak"],"creator":["Staff Reporter"],"video_url":null,"description":"Renowned former Zimbabwe cricket captain and coach, Heath Streak, who died aged 49 in the wee hours of Sunday morning has reportedly been cremated. The post Heath Streak cremated, legendary cricketer’s wish reportedly fulfilled appeared first on Nehanda Radio.","content":"The cremation comes after Streak who is said to be one of the greatest ever cricketers to emerge in Zimbabwe, told his family he wanted to be cremated. This was confirmed on Thursday by John Rennie, the family’s spokesperson and longtime friend. He told Zimpapers Sports Hub: “I can confirm that Heath Streak has been cremated as per his wish.,” he said. Streak’s memorial service is set to be held on Friday at Four Winds Suburb, Bulawayo at Mystique Gardens. He survived by his wife Nadine and four children.","pubDate":"2023-09-06 19:18:48","image_url":null,"source_id":"nehandaradio","source_priority":389454,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"ca671fd95c21a4ab2eddea92fcb9c10c","title":"Asia Cup 2023 Super Four: \"दुर्भाग्य से इस तरह...\" हार के बाद बांग्लादेश कप्तान शाकिब ने पाकिस्तान टीम को लेकर कह दी बड़ी बात","link":"https://sports.ndtv.com/hindi/cricket/shakib-al-hasan-bangladesh-captain-big-statement-after-lose-over-pakistan-in-asia-cup-2023-super-four-matc-4366716#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"PAK vs BAN Asia Cup 2023 Super Four: एशिया कप के सुपर 4 मुकाबले में पाकिस्तान ने बांग्लादेश को 7 विकेट से दी मात.","content":"Shakib Al Hasan on Lose vs pakistan in Asia Cup super four बांग्लादेश के कप्तान शाकिब अल हसन ने एशिया कप क्रिकेट टूर्नामेंट के सुपर चार चरण के मुकाबले में बुधवार को यहां पाकिस्तान के खिलाफ सात विकेट की एकतरफा हार का दोष बल्लेबाजों पर मढ़ते हुए कहा कि इस तरह के विकेट पर उन्होंने बहुत खराब बल्लेबाजी की. बांग्लादेश के 194 रन के लक्ष्य का पीछा करते हुए पाकिस्तान ने इमाम उल हक (84 गेंद में 78 रन, पांच चौके, चार छक्के) और मोहम्मद रिजवान (MD Rizwan) (79 गेंद में नाबाद 63, सात चौके, एक छक्का) के अर्धशतक और दोनों के बीच तीसरे विकेट की 85 रन की साझेदारी की बदौलत 63 गेंद शेष रहते तीन विकेट पर 194 रन बनाकर जीत दर्ज की. बांग्लादेश इससे पहले मुशफिकुर रहीम (Mushfiqur Rahim Half Century) (87 गेंद में 64 रन, पांच चौके) और कप्तान शाकिब अल हसन (57 गेंद में 53 रन, सात चौके) के अर्धशतक और दोनों के बीच 100 रन की साझेदारी के बावजूद हारिस राउफ (19 रन पर चार विकेट) और नसीम शाह (34 रन पर चार विकेट) की धारदार गेंदबाजी के सामने 38.4 ओवर में 193 रन पर ही सिमट गया. शाकिब (Shakib Al Hasan on Lose over Pakistan) ने मैच के बाद कहा, ‘‘इस तरह के विकेट पर बहुत खराब बल्लेबाजी प्रदर्शन लेकिन हमें अगले मुकाबले पर ध्यान देना होगा. वे नंबर एक टीम हैं और इसका कारण यही है. उनके पास तीन विश्व स्तरीय गेंदबाज हैं जो उनके लिए चीजें आसान बना रहे हैं. हम गेंदबाजी विभाग में अच्छा प्रदर्शन कर रहे हैं लेकिन बल्लेबाजी उम्मीद के मुताबिक नहीं है. हमें और अधिक निरंतर प्रदर्शन करने की जरूरत है.'' उन्होंने कहा, ‘‘ मुझे लगता है कि हमारे तीन तेज गेंदबाजों ने शानदार गेंदबाजी की. पाकिस्तान की तरह हमारे तेज गेंदबाज पिछले कुछ वर्षों में बहुत अच्छी गेंदबाजी कर रहे हैं लेकिन, दुर्भाग्य से इस तरह की पिच पर आप तब तक विकेट नहीं पा सकते जब तक कि बल्लेबाज गलतियां नहीं करें.'' शाकिब ने कहा कि उनके बल्लेबाजों ने साधारण शॉट खेलकर शुरुआत में ही काफी विकेट गंवा दिए. उन्होंने कहा, ‘‘हमने शुरुआत में जल्दी विकेट खो दिए और हमने कुछ सामान्य शॉट खेले। इस तरह के विकेट पर हमें शुरुआती दस ओवर में चार विकेट नहीं गंवाने चाहिए लेकिन ऐसा होता है. हमारी साझेदारी अच्छी थी, हमें सात या आठ ओवर और बल्लेबाजी करने की जरूरत थी.'' श्रीलंका में खेलने के संदर्भ में उन्होंने कहा, ‘‘जब मैं एलपीएल (लंका प्रीमियर लीग) में खेला था तो पिचें थोड़ी धीमी थीं, विकेट पर असमान उछाल था और इससे हमें मदद मिलेगी. उम्मीद है कि हम कोलंबो में अच्छा प्रदर्शन करेंगे.'' बाबर ने कहा, ‘‘सभी खिलाड़ियों को श्रेय, विशेषकर शुरुआती दस ओवरों को। वे पहले दस ओवरों में अच्छी गेंदबाजी कर रहे हैं और फिर हारिस राउफ (Babar Azam on Haris Rauf) भी वास्तव में अच्छी गेंदबाजी कर रहे हैं. तेज गेंदबाजों को थोड़ी मदद मिल रही थी और फहीम (अशरफ) ने वास्तव में अच्छी गेंदबाजी की. जीतना हमेशा आपको आत्मविश्वास देता है.'' टीम पर दबाव के संदर्भ में उन्होंने कहा, ‘‘मुझे ऐसा नहीं लगता. हम हर मैच में अपना सर्वश्रेष्ठ दे रहे हैं.'' पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-09-06 19:07:53","image_url":"https://c.ndtvimg.com/2023-07/qph0ekhg_shakib-al-hasan_625x300_17_July_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"2892121cd6b49de3fbc9063b0ed6f211","title":"Sri Lanka dismiss England for 116 in T20 series decider in Derby","link":"https://www.independent.co.uk/sport/cricket/england-sri-lanka-t20-heather-knight-england-cricket-b2406666.html","keywords":["Cricket","Sport"],"creator":["Jonathan Veal"],"video_url":null,"description":"Maia Bouchier top scored with 23 while Danielle Gibson added 21 late as England were skittled in the 19th over.","content":"England will have to defend a below-par score of 116 if they are to win their Twenty20 international series against Sri Lanka . With the three-match contest tied at 1-1, the hosts were bowled out for a disappointing 116 after being invited to bat first in the decider at Derby . They never got to grips with Sri Lanka’s array of slower bowlers, with Chamari Athapaththu taking three for 21 and Udeshika Prabodhani and Kavisha Dilhari both claiming two wickets apiece. Maia Bouchier top scored with 23 while Danielle Gibson added 21 late as England were skittled in the 19th over. The innings could not have got off to a worse start as Danni Wyatt planted a gentle wide delivery from Inoshi Fernando straight to cover. The Sri Lankans were celebrating again at the end of the second over when a calamitous mix-up between Bouchier and Alice Capsey saw both batters at the same end, with the latter ran out. Bouchier and captain Heather Knight did some repair work, sharing a 30-run stand in four overs, but that came to an end when Bouchier holed out to long-on. Knight (18) and Amy Jones (20) soon followed as England slipped to 72 for five in the 11th over and it looked like they would struggle to get to 100. But Gibson hit three fours in her 15-ball innings to get them to three figures before a flurry of late wickets saw them fail to see out their overs.","pubDate":"2023-09-06 18:36:51","image_url":"https://static.independent.co.uk/2023/09/06/19/9693ee163058ed4da8bdb50ffdbb23edY29udGVudHNlYXJjaGFwaSwxNjk0MTExNDYw-2.73625631.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ae19dd97749ced4b18cec5db79dbf0c","title":"विश्व कप की टीम पर ये क्या बोल गए शिखर धवन? आखिर तोड़ ही दी अपनी चुप्पी!","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/shikhar-dhawan-break-his-silence-on-world-cup-team-said-this-big-thing-in-gestures/articleshow/103443360.cms","keywords":null,"creator":null,"video_url":null,"description":"Shikhar Dhawan: विश्व कप के लिए हुए टीम इंडिया के चयन पर ओपनर बल्लेबाज शिखर धवन ने ट्वीट कर अपनी प्रतिक्रिया दी है। धवन ने भारतीय टीम को इस बड़े टूर्नामेंट के लिए शुभकामनाएं दी है। धवन को इस विश्व कप में खेलने का मौका नहीं मिला है।","content":"आईसीसी वनडे विश्व कप 2023 के लिए भारत के 15 सदस्यीय टीम का ऐलान कर दिया गया है। इस टीम में लगभग वहीं खिलाड़ी हैं जिन्हें एशिया कप में मौका मिला है। टीम इंडिया के चयन से पहले कई तरह की अटकलबाजियां चल रही थी लेकिन अब उन सभी विराम लग गया। विश्व कप के लिए इस भारतीय टीम पर ओपनर बल्लेबाज शिखर धवन ने भी अपनी प्रतिक्रिया दी है। हालांकि धवन की इस प्रतिक्रिया को उनका दर्द समझा जाए या फिर निराशा लेकिन उन्होंने अपने ट्वीट में भारतीय टीम को शुभकामनाएं दी है। शिखर धवन ने विश्व कप के स्क्वाड पर ट्वीट कर लिखा, 'मेरे साथी खिलाड़ी और दोस्तों को वर्ल्ड कप में भारत का प्रतिनिधित्व करने के लिए चुने जाने पर बधाई! 150 करोड़ लोगों की दुआ और सपोर्ट के साथ, आप हमारी उम्मीदें और सपनों को आगे बढ़ाते हैं। आशा करता हूं कि आप कप वापस घर लेकर आएं और गर्व महसूस करवाएं!' बता दें कि एशिया कप और विश्व कप दोनों के लिए शिखर धवन को लेकर खूब चर्चा हुई थी। हालांकि एशिया कप में धवन को मौका नहीं मिला। इससे साफ हो गया था कि विश्व कप में उनका पत्ता कट गया है। एक समय था जब रोहित शर्मा के साथ शिखर धवन की जोड़ी सुपरहिट थी लेकिन इस बार के विश्व कप में ऐसा नहीं देखने को मिलेगा। बाएं हाथ का यह ओपनर बल्लेबाज एक समय टीम इंडिया की प्रमुख सदस्य थे। हालांकि गिरते फॉर्म के कारण वह टीम से अंदर बाहर होने लगे। यही कारण है कि इस साल शिखर धवन टीम इंडिया के लिए एक भी मैच में मैदान पर नहीं उतरे। धवन को आखिरी बार पिछले साल बांग्लादेश के खिलाफ के खिलाफ इंटरनेशनल मैच में खेलने का मौका मिला था। इसके बाद ही वह टीम इंडिया से बाहर चल रहे हैं। टीम इंडिया के लिए शिखर धवन का करियर दमदार रहा है। हालांकि फिलहाल वह टीम इंडिया की योजनाओं में शामिल नहीं है। धवन टीम इंडिया के लिए अब तक कुल 34 टेस्ट, 167 वनडे और 68 टी20 मैचों में मैदान पर उतरे हैं। टेस्ट क्रिकेट में धवन ने 237 बनाए हैं जिसमें 7 शतक और 5 अर्धशतक शामिल है। वहीं वनडे में धवन ने 44.11 की औसत से 6793 बनाए हैं। इस फॉर्मेट में धवन के नाम 17 शतक और 39 अर्धशतक दर्ज है। वहीं टी20 में धवन ने 126.36 की स्ट्राइक रेट से 1759 रन बनाए हैं। टी20 में धवन ने 11 अर्धशतक लगाए हैं।","pubDate":"2023-09-06 18:24:56","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"28165a01f6859add75437464cacfad3d","title":"क्या आप भी खरीदना चाहते हैं टिकट, तारीख और समय नोट कर लीजिए, ऐसे मिलेगी स्टेडियम में एंट्री","link":"https://navbharattimes.indiatimes.com/sports/cricket/icc-world-cup/news/world-cup-2023-bcci-to-release-400000-more-tickets-from-september-8/articleshow/103443238.cms","keywords":null,"creator":null,"video_url":null,"description":"World Cup Online Tickets: वर्ल्ड कप टिकट की भारी डिमांड को देखते हुए तकरीबन और 4 लाख टिकट उपलब्ध करवाने का फैसला लिया गया है। फैंस ऑनलाइन टिकटों की बुकिंग कर सकते हैं।","content":"विश्व कप मुकाबलों के टिकटों की भारी मांग को देखते हुए भारतीय क्रिकेट बोर्ड (बीसीसीआई) इस बहुप्रतीक्षित टूर्नामेंट के लगभग चार लाख टिकट जारी करेगा। बीसीसीआई द्वारा जारी प्रेस विज्ञप्ति में हालांकि यह स्पष्ट नहीं किया गया है कि इन चार लाख टिकटों में भारत के मैचों के कितने प्रतिशत टिकट होंगे। अधिक से अधिक प्रशंसकों तक टिकटों की पहुंच बनाने के लिए यह कदम उठाया जा रहा है। विज्ञप्ति में कहा गया, ‘दुनिया भर के क्रिकेट प्रेमी अब साल की सबसे बड़ी क्रिकेट प्रतियोगिता के लिए अपनी जगह पक्की कर सकते हैं।’ इसके अनुसार, ‘आठ सितंबर 2023 को भारतीय समयानुसार रात आठ बजे से सभी मैचों के टिकटों की बिक्री शुरू होगी। प्रशंसक आधिकारिक वेबसाइट http://https/tickets.cricketworld.com पर जाकर टिकट खरीद सकते हैं। समय आने पर प्रशंसकों को टिकटों की बिक्री के अगले चरण की जानकारी दी जाएगी।’ बीसीसीआई को टूर्नामेंट की शुरुआत से केवल 100 दिन पहले शेड्यूल जारी करने और फिर इसमें बदलाव करने के चलते पहले ही नाराजनी का सामना करना पड़ा है। यही कारण है कि टिकट जारी करने में और देरी हुई। 2023 विश्व कप की शुरुआत 5 अक्टूबर को इंग्लैंड बनाम न्यूजीलैंड के साथ होगी, जो 2019 विश्व कप के फाइनलिस्ट हैं। अहमदाबाद, हैदराबाद, धर्मशाला, दिल्ली, चेन्नई, लखनऊ, पुणे, बेंगलुरु, मुंबई और कोलकाता जैसे 10 शहरों में 10 टीमें एक-दूसरे से लोहा लेंगी। पहला सेमीफाइनल 15 नवंबर को मुंबई और दूसरा सेमीफाइनल 16 नवंबर को कोलकाता में होगा। फाइनल 19 नवंबर को नरेंद्र मोदी स्टेडियम में खेला जाएगा।","pubDate":"2023-09-06 18:16:12","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"bd0ce7a956ac5e5c42c40c4a80a1ac50","title":"क्या नेहरा लेंगे द्रविड़ की जगह, विश्व कप के बाद कौन होगा भारतीय क्रिकेट टीम का हेड कोच","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/all-eyes-on-indian-cricket-team-head-coach-rahul-dravid-contract-after-world-cup-2023/articleshow/103442874.cms","keywords":null,"creator":null,"video_url":null,"description":"रवि शास्त्री की जगह टीम इंडिया के कोच बनाए गए राहुल द्रविड़ ने अबतक कुछ ऐसा नहीं किया, जिसके बूते यह कहा जा सके कि वह एक शानदार कोच हैं। द्रविड़ जितने शानदार बल्लेबाज थे, उतने ही औसत कोच हैं।","content":"भारतीय क्रिकेट टीम के मुख्य कोच राहुल द्रविड़ का दो साल का अनुबंध वनडे विश्वकप के बाद समाप्त हो जाएगा और अगर भारत इसे जीतने में सफल रहता है तो यह देखना दिलचस्प होगा कि द्रविड़ को आगे भी इस पद पर बनाए रखा जाएगा या नहीं। भारत यदि खिताबी मुकाबले में नहीं पहुंच पाता है तो इसकी गाज द्रविड़ पर गिर सकती है क्योंकि टीम के सेमीफाइनल में पहुंचने को बड़ी उपलब्धि नहीं माना जाएगा । भारतीय क्रिकेट बोर्ड (बीसीसीआई) ऐसे में नए कोच की तलाश कर सकता है। यह देखना भी दिलचस्प है कि अगर बीसीसीआई द्रविड़ के सामने नया अनुबंध पेश करता है तो क्या वह इसके इच्छुक होंगे या नहीं। क्रिकेट पंडितों का मानना है कि अगर द्रविड़ कोच पद पर बने रहने के इच्छुक होते हैं तो उन्हें दक्षिण अफ्रीका और इंग्लैंड के खिलाफ टेस्ट श्रृंखलाओं के लिए इस पद पर बनाए रखना चाहिए। विश्वकप के अगले चक्र से पहले टेस्ट और सीमित ओवरों के प्रारूपों के लिए अलग-अलग कोच रखने में कोई बुराई नहीं है जैसा कि अभी इंग्लैंड कर रहा है। द्रविड़ की जगह कोच पद के लिए आशीष नेहरा अच्छी पसंद हो सकते हैं क्योंकि आईपीएल में वह काफी सफल रहे हैं लेकिन इस पूर्व तेज गेंदबाज के करीबियों के अनुसार उनकी राष्ट्रीय टीम का कोच बनने में दिलचस्पी नहीं है क्योंकि गुजरात टाइटंस के साथ उनका अनुबंध 2025 के सत्र तक है। बीसीसीआई के एक पूर्व पदाधिकारी ने गोपनीयता की शर्त परकहा, ‘अगर भारत विश्वकप जीत जाता है तो द्रविड़ हो सकता है एक बड़े खिताब के साथ अपने कार्यकाल का अंत करना पसंद करें, लेकिन अगर आप मुझसे पूछ रहे हो तो मेरा मानना है कि विश्वकप के बाद बीसीसीआई को सभी प्रारूपों के लिए अलग-अलग कोच रखने चाहिए। उन्हें द्रविड़ को टेस्ट टीम का कोच बने रहने के लिए कहना चाहिए।’ राहुल द्रविड़ सीमित ओवरों की क्रिकेट में ऐसी कोई खास छाप नहीं छोड़ पाए, जिससे कि यह कहा जा सके कि वह चतुर रणनीतिकार हैं। ऐसी स्थिति में बीसीसीआई अलग प्रारूपों के लिए अलग-अलग कोच रखने के विकल्प पर विचार कर सकता है।","pubDate":"2023-09-06 17:46:36","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"c11552086924854c7dc933de37f66b48","title":"Yuzvendra Chahal set for County stint, signs up to play three games for Kent","link":"https://telanganatoday.com/yuzvendra-chahal-set-for-county-stint-signs-up-to-play-three-games-for-kent","keywords":["News","Sport","County Cricket","Ranji Trophy","Yuzvendra Chahal"],"creator":["ANI"],"video_url":null,"description":"A seasoned white-ball international, Yuzvendra Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India's Ranji Trophy","content":"Home | News | Yuzvendra Chahal Set For County Stint Signs Up To Play Three Games For Kent Yuzvendra Chahal set for County stint, signs up to play three games for Kent A seasoned white-ball international, Yuzvendra Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India's Ranji Trophy By ANI Published Date - 11:15 PM, Wed - 6 September 23 File Photo London: India’s star spinner Yuzvendra Chahal has been signed up by Kent Cricket for the remainder of the County Championship season “subject to regulatory approval”. “Kent Cricket is delighted to announce the signing of India international leg-spinner Yuzvendra Chahal for the Club’s remaining County Championship matches, subject to regulatory approval,” Kent announced in an official statement. A seasoned white-ball international, Chahal has 87 wickets to date in 33 first-class appearances, with best figures of 6-44 coming for his native Haryana against Hyderabad in India’s Ranji Trophy . Also previously an India youth international in the sport of chess, he will be available for selection in Kent’s remaining two home Championship matches against Nottinghamshire and Lancashire, as well as Kent’s away fixture against Somerset. On joining Kent in first-class cricket until the end of the season, Chahal said, This is an exciting challenge for me, playing in English county cricket, and one I’m very much looking forward to. Chahal is the second India international to feature for Kent this season, after left-arm seamer Arshdeep Singh also wore the Kent shirt in the Championship competition back in June and July. Kent’s Director of Cricket, Paul Downton, said, We’re delighted to have secured a spinner of Yuzvendra’s quality for the last three Championship matches of the season, with Matt Parkinson not available to us until next year, and Hami Qadri recently injured. He is really looking forward to playing in English conditions and will bring a significant amount of skill and international experience to our squad,” he added. Also Read Yuzvendra Chahal cryptic response after missed out from Asia Cup squad Follow Us : Tags County Cricket Ranji Trophy Yuzvendra Chahal Related News Yuzvendra Chahal signs up with Kent for three-match County Championship stint I still remain optimistic about playing for India: Abhimanyu Easwaran Harbhajan Singh lauds Yuzvendra Chahal despite Asia Cup exclusion Yuzvendra Chahal cryptic response after missed out from Asia Cup squad Nitish Rana announces move to Uttar Pradesh from Delhi for current domestic season Manoj Tiwary comes out retirement, wants to give ‘one more try’ to win Ranji Trophy","pubDate":"2023-09-06 17:45:09","image_url":null,"source_id":"telanganatoday","source_priority":63887,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"292ff331bc6cd253bc4e3cc2a57479f1","title":"PCB ने की फिर से घटिया हरकत, मैच में हुआ नुकसान तो ACC से कर रहा है भरपाई की मांग","link":"https://navbharattimes.indiatimes.com/sports/cricket/asia-cup/pcb-demands-compensation-for-loss-in-match-between-india-vs-nepal/articleshow/103441546.cms","keywords":null,"creator":null,"video_url":null,"description":"Asia cup 2023: पाकिस्तान क्रिकेट बोर्ड ने एशियन क्रिकेट काउंसी से भारत और नेपाल के बीच हुए मुकाबले में टिकट की कम बिक्री के कारण हुए नुकसान के भरपाई की मांग की है। रिपोर्ट के मुताबिक जका अशरफ ने ACC के प्रमुख जय शाह को इस बाबत मेल किया है।","content":"नई दिल्ली: एशिया कप 2023 में सुपर-4 राउंड की शुरुआत हो चुकी है। ग्रुप स्टेज खत्म हो चुका। पाकिस्तान और श्रीलंका की संयुक्त मेजबानी में एशिया का आयोजन हो रहा है। इसे लेकर खूब विवाद भी हुआ। क्योंकि भारत ने पाकिस्तान में जाकर खेलने से साफ मना कर दिया। हालांकि आखिर में यह फैसला लिया गया कि टूर्नामेंट को हाइब्रिड मॉडल पर आयोजित किया जाएगा और ऐसा ही हुआ। पाकिस्तान को सिर्फ 4 मैचों की मेजबानी मिली बाकी के 9 मैच श्रीलंका में खेले जा रहे हैं। हालांकि इस बीच एशिया कप को लेकर एक नया विवाद सामने उठ खड़ा हुआ है। रिपोर्ट के मुताबिक पीसीबी चेयरमैन जका अशरफ ने एशियन क्रिकेट काउंसिल के प्रमुख जय को एक मेल किया है जिसमें उन्होंने नुकसान की भरपाई की मांग की है। इस मेल के मुताबिक पीसीबी के मुखिया ने भारत और नेपाल के बीच हुए मुकाबले में टिकटों की कम बिक्री के कारण जो नुकसान हुआ उसके लिए पैसे की डिमांड की। ऐसे में इस मुद्दे पर एक नया विवाद उठ खड़ा हुआ है। इस नए विवाद के बीच में ही बीसीसीआई की तरफ से रॉजर बिन्नी और राजीव शुक्ला पाकिस्तान दौरे पर गए थे। नुकसान की भरपाई के मुद्दे से अलग अलग पाकिस्तानी दौरे के दौरान उनकी मेहमान नवाजी से बिन्नी और राजीव शुक्ला गदगद हैं। राजीव शुक्ला का मानना है कि क्रिकेट दोनों देशों के संबंधों को सुधारने में सेतु का काम कर सकता है। बिन्नी और शुक्ला पाकिस्तान क्रिकेट बोर्ड के निमंत्रण पर वहां एशिया कप के मैच देखने के लिए गए थे। बीसीसीआई के दोनों पदाधिकारी बुधवार को अटारी वाघा बॉर्डर से स्वदेश लौटे। यह पिछले 17 वर्षों में पहला मौका था जबकि बीसीसीआई के अधिकारियों ने पाकिस्तान का दौरा किया। वे सोमवार को पाकिस्तान पहुंचे थे। बिन्नी ने स्वदेश लौटने पर कहा, 'पाकिस्तान में वहां के पदाधिकारियों के साथ हमारी मुलाकात बहुत अच्छी रही। हमारी वहां अच्छी तरह से खातिरदारी की गई। उन्होंने हमारा अच्छी तरह से ध्यान रखा। हमारा मुख्य एजेंडा क्रिकेट मैच देखना और उनके साथ बातचीत करना था। कुल मिलाकर यह दौरा शानदार रहा।' भारत और पाकिस्तान के बीच राजनीतिक तनाव के कारण बायलेटरल सीरीज नहीं होती हैं और दोनों देश आईसीसी या फिर एशियाई क्रिकेट परिषद की प्रतियोगिताओं में ही एक दूसरे का सामना करते हैं। भारत और पाकिस्तान के बीच बायलेटरल सीरीज शुरू होने की संभावना के बारे में पूछे जाने पर बिन्नी ने कहा कि वे इस पर फैसला नहीं कर सकते।","pubDate":"2023-09-06 17:42:08","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ba40d2cf7fdf0b497f13f5a2572465d8","title":"World Cup में नहीं मिली जगह तो युजवेंद्र चहल ने 'छोड़ा भारत', अब इस टीम से खेलते नजर आएंगे","link":"https://navbharattimes.indiatimes.com/sports/cricket/cricket-news/yuzvendra-chahal-signs-up-for-county-championship-games-will-play-for-kent/articleshow/103442399.cms","keywords":null,"creator":null,"video_url":null,"description":"Yuzvendra Chahal अगले कुछ महीने आपको भारतीय क्रिकेट टीम से नहीं बल्कि इंग्लैंड की इस काउंटी टीम से खेलते नजर आएंगे। विश्व कप और एशिया कप टीम से बाहर किए जाने के बाद उन्होंने यह फैसला लिया है।","content":"एशिया कप और वनडे विश्व कप के लिए भारतीय टीम में नहीं चुने गए लेग स्पिनर युजवेंद्र चहल ने देश छोड़ने का फैसला कर लिया है। अरे घबराइए मत! युजवेंद्र चहल ने किसी दूसरे देश की नागरिकता नहीं ली है बल्कि वह ब्रिटेन जाने वाले हैं। अब वहां काउंटी क्रिकेट में हाथ आजमाएंगे। 33 वर्षीय लेग स्पिनर चहल ने काउंटी चैंपियनशिप के तीन मैच में खेलने के लिए इंग्लिश काउंटी टीम कैंट के साथ अनुबंध किया है। चहल कैंट के नॉटिंघमशर और लंकाशर के खिलाफ होने वाले घरेलू मैच तथा समरसेट के खिलाफ उसके मैदान पर होने वाले मैच के लिए उपलब्ध रहेंगे। भारत के लिए 121 वनडे और 96 टी-20 इंटरनेशनल विकेट झटकने वाले युजवेंद्र चहल ने इस काउंटी टीम के बयान में कहा, ‘इंग्लिश काउंटी क्रिकेट में खेलना मेरे लिए रोमांचक चुनौती है और मैं इसको लेकर बेहद उत्साहित हूं।’ वह कैंट की तरफ से खेलने वाले दूसरे भारतीय खिलाड़ी बनेंगे। तेज गेंदबाज अर्शदीप सिंह जून-जुलाई में कैंट की तरफ से पांच मैचों में खेले थे जिनमें उन्होंने 13 विकेट हासिल किए थे। केंट को वर्तमान में 10 टीम काउंटी चैंपियंस डिवीजन-1 तालिका में सबसे नीचे रखा गया है और अगले सेशन में डिवीजन-2 में जाने का खतरा है। वैसे भारतीय टीम में सिलेक्शन के बाद से युजवेंद्र चहल ने टाइट शेड्यूल के चलते डोमेस्टिक क्रिकेट खेलना छोड़ दिया था। रणजी ट्रॉफी के पिछले सीजन में उन्होंने हरियाणा के लिए दो मैच खेले थे। युजवेंद्र चहल के पास कुल मिलाकर 33 प्रथम श्रेणी मैच का अनुभव है, जिसमें उन्होंने 87 विकेट चटकाए। मगर उनकी पहचान वाइट बॉल क्रिकेटर के रूप में ज्यादा है, जहां उन्होंने 72 एकदिवसीय मैचों में 27.13 की औसत से 121 विकेट और 8.19 की इकॉनमी रेट के साथ 80 टी-20 इंटरनेशनल में 96 विकेट लिए हैं। चहल आज भी अपने टेस्ट डेब्यू का इंतजार कर रहे हैं।","pubDate":"2023-09-06 17:21:42","image_url":null,"source_id":"navbharattimes","source_priority":392,"country":["india"],"category":["sports"],"language":"hindi"}]}