{"newsArray":[{"title":"Saudi Arabia’s grand sports washing campaign comes to finish off cricket’s current order","link":"https://www.businessweekly.co.zw/saudi-arabias-grand-sports-washing-campaign-comes-to-finish-off-crickets-current-order/","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"A lucrative T20 tournament is the country’s latest shameless attempt to forge a better reputation for itself – and it seemingly comes without care for the game itself. First the Kingdom of Saudi Arabia came for golf, and I did not speak out, because it’s for men named Chad who want to network while supporting […]","content":"eBusiness Weekly A lucrative T20 tournament is the country’s latest shameless attempt to forge a better reputation for itself – and it seemingly comes without care for the game itself. First the Kingdom of Saudi Arabia came for golf, and I did not speak out, because it’s for men named Chad who want to network while supporting the manufacturers of boat shoes. Then Saudi Arabia came for Newcastle United, and I did not speak out, because frankly it was Newcastle United. Actually, Saudi Arabia already had Formula One racing, but that was a natural fit between those who produce oil and the pastime that most conspicuously torches it. By the time they came for Cristiano Ronaldo he too seemed largely made of hydrocarbon polymer, though he is biodegrading faster. Now Saudi Arabia is coming for cricket – just another step in the grandest sportswashing campaign in history. The country is an autocratic monarchy run on the fundamentalist principles of Wahhabist Islam. Laws of ‘guardianship’ mean that women cede control of their lives to male relatives. The legal system uses prison, torture or execution against political dissent and anyone outside proscribed sexual or gender norms. The Saudi-led war in Yemen killed hundreds of thousands. The engine driving all this is Saudi Aramco, the biggest oil company in the world, the single biggest driver of our climate crisis, source of over 4% of global carbon emissions since 1965. Its only plan for the future is to increase production. So the kingdom wants a better reputation – not by addressing its failings, but by marketing. It has deduced that the best path is through high-profile sport, with its vast international audience and its remarkable ability to generate goodwill. Fifa boss Gianni Infantino, who never met a billion dollars that he didn’t like, is already softening up the audience for his Qatar sequel with a Saudi football World Cup in 2030. Taking over cricket was flagged when Aramco became the International Cricket Council’s naming sponsor last year, now plastered over every global event, while a Saudi tourism body is doing the same with the Indian Premier League. Cricket is an easy target. Only 12 countries play at the top level and only three are in financial health. The prize though is India, the monolith at cricket’s centre, a potential audience of 1.4 billion and rising, with a worldwide diaspora sprinkled on top. The Saudis want the IPL, perhaps by bringing the existing circus to town, preferably by starting a new complementary competition. Administered by the Indian board but with teams owned by private wealth, the Indian league currently bans Indian players from other tournaments worldwide to protect its own primacy. With a broadcast deal worth US$6.2bn, the IPL is used to walking into a room as the big spender, buying up teams in South Africa, the Caribbean, the Emirates, the United States. Saudi Arabia is among the few entities in the world that can approach Indian cricket and slap a bigger wallet on the table. So what? Don’t all countries have problems? Unsurprisingly the prospect of Saudi cash motivates plenty of apologists. They like to claim that criticism stems from racism, cynically using the language of equality to defend a project whose foundation is discrimination. It is true that every society has power structures that feed and benefit from inequality. It is also true that this reaches a different level when codified in law. Nations that recognised this when isolating apartheid South Africa are much less inclined to bother on gender grounds. Anyway, the whataboutery deflates against the reality of state operatives dismembering a journalist with bone saws. Aramco is framed as a tool of consumers – like it is a benign and passive force that meets demand, rather than the biggest player in an industry that has spent a century deliberately shaping the world to create that demand. Its defenders point at critics for using power or driving cars, somehow treating this as a gotcha rather than a reinforcement of the point: that the structure created by fossil fuels is practically impossible to live outside. Wealth creates influence, influence supports wealth: our societies could already be different if the richest within them didn’t have so much more money that they intend to make. It is that wealth, with an economy valued into the trillions, that emboldens Saudi sportswashing. Their one failure so far was sponsoring this year’s Women’s World Cup, an attempt abandoned after players and federations pushed back. This isn’t just shameless, like Aramco producing 13.6 billion barrels of oil last year while installing recycling stations for drink bottles at cricket grounds in the name of sustainability. There is something perversely aggressive about targeting events where all the competitors are women and so many are gay, as a country where their gender makes them second-class humans and their sexuality is a crime. Saudi marketers don’t care: they’re already bidding to host the 2026 Women’s Asian Cup. As for cricket, the end of the current order was already approaching, but a Saudi league will finish it off. The IPL takes up three months each year. A Saudi equivalent would have no reason to aim smaller. Others will crowd the gaps. The ICC will acquiesce, its members hoping for crumbs from the table. Test cricket is already a luxury most of them can’t afford. India, England, and Australia might continue it as occasional exhibitions. Otherwise, like football, internationals will give way to franchises, shrinking to short and frequent T20 World Cups, with the 50-over format a white elephant in search of its graveyard. Aside perhaps from a few conscientious objectors, the best players will come, because spending will outdo any previous conception of pay. Bear in mind that Australian golfer Cameron Smith, winner of exactly one major, scored US$100m to join the Saudi-backed LIV tour. The IPL’s income is limited by how much advertising broadcasters can sell. For Saudi Arabia that doesn’t matter at all. In time it will reshape cricket. For now, the celebrity and skill of top players still comes from national duty. Less international cricket will reduce this pathway. Anyone who does pop up will soon be recruited to the leagues. Talent discovery will mostly come through the franchises, their feeder teams, scouts and academies. Perhaps this will open up opportunity, depending where they look. You could spin all of this as a positive, if it wasn’t so patently part of something bigger, the most cosseted princeling in history scooping up every bauble that shines. There is not the slightest care for cricket itself, it is a vehicle. There is its audience and its reflected prestige. So the Saudi royals take the insane amounts of money made from decades of pollution, use it to lock in their feudal system that rejects all democratic principle, then spend obscene sums on sparkles and distractions so that… people will like them? Why do those so privileged, who clearly hold most people in contempt, still want to be liked? On goes the PR campaign. For those saying the Saudi monarchs have nothing to be ashamed of, they are certainly behaving like they do. There is the tourism angle, economically diversifying in case the oil does one day stop flowing, but that’s out of scale with the spending. There is entrenchment as a legitimate government in a world where theocratic monarchy is a vicious anachronism. There is washing away the aftertaste of using one’s embassies as extrajudicial murder rooms. But beware the motivations you haven’t yet anticipated, and the fact that once you hand something over you can’t have it back. Whatever they want, this regime’s crimes say they shouldn’t get it. Money says they will. The question that matters is what’s in it for them, but most people in cricket will be too busy wondering: what’s in it for me?","pubDate":"2023-04-27 22:01:35","image_url":null,"source_id":"businessweeklyzw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Naseem Shah’s brilliant spell propels him to unique ODI record","link":"https://a-sports.tv/naseem-shah-brilliant-spell-unique-odi-record/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks","Naseem Shah"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Pakistan’s young speedster Naseem Shah’s brilliant spell against New Zealand in the first PAK vs NZ ODI here on Thursday, propelled him to a unique ODI world record. Naseem Shah proved his mettle by bowling an astonishing spell in the first PAK vs NZ ODI against New Zealand; taking two wickets for just 29 […] The post Naseem Shah’s brilliant spell propels him to unique ODI record appeared first on ASports.tv.","content":"Naseem Shah proved his mettle by bowling an astonishing spell in the first PAK vs NZ ODI against New Zealand; taking two wickets for just 29 runs in his ten-over spell and toppling Matt Henry’s long-standing record of taking 19 wickets in the first six matches. The 19-year-old set a new record by taking 20 wickets in the first six ODIs of his career. He also holds the record for most wickets in the first four and five ODIs by leaving behind Imran Tahir, Ryan Harris, Zahoor Khan and Ibadat Hussain. The record-breaking performance by Naseem earned him high praise from cricket fans and experts around the world. His’s phenomenal bowling performance restricted New Zealand to 288 runs despite Daryl Mitchell’s century. Mitchell put on a scintillating show with the bat as he fought hard for his second ODI century. He top-scored for New Zealand with his career-best 113 in 115 balls, laced up with 11 boundaries and a six. After Naseem’s brilliance, it was Fakhar Zaman’s show, who scored his second-consecutive century against New Zealand and powered the home side to a resounding five-wicket victory over the touring side. The left-handed batter topped the scoring chart for Pakistan with a monumental 117-run knock in just 113 deliveries which featured 13 boundaries and a six. His opening partner Imam-ul-Haq also played a pivotal role in his team’s triumph with his calculated 60-run knock and laid a solid foundation by stitching a magnificent 124-run partnership with Fakhar.","pubDate":"2023-04-27 19:44:52","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Dominant Pakistan down New Zealand in first PAK vs NZ ODI","link":"https://a-sports.tv/pakistan-down-new-zealand-first-pak-vs-nz-odi/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Dominant Pakistan put on an all-round show to storm past New Zealand in the first PAK vs NZ ODI and scripted a winning start to the five-match series here at Pindi Cricket Stadium. Watch PAK vs NZ Live Match in HD Streaming The first ODI of the five-match series between Pakistan and New Zealand was […] The post Dominant Pakistan down New Zealand in first PAK vs NZ ODI appeared first on ASports.tv.","content":"The first PAK vs NZ ODI of the five-match series was played here at the Pindi Cricket Stadium on Thursday. Pakistan captain opted to bowl first after the coin flipped in his favour. New Zealand, batting first, put up a decent total on the scoreboard at the back of a brilliant century and half-century by Daryl Mitchell and Will Young respectively. Mitchell smashed 11 boundaries and a six on his way to top score for New Zealand with a 115-ball 113. On the other hand, Young scored 86 off just 78 deliveries, laced up with eight boundaries and two sixes. The target set by New Zealand eventually proved insufficient for their bowlers to defend at the back of resounding knocks by their openers Fakhar Zaman and . Fakhar Zaman continued his magnificent form to score his second-consecutive century and top-scored for Pakistan in the run chase. He piled up 117 runs in a mere 114 balls and smashed 13 boundaries and a six. Whereas Imam scored 60 off 65 with the help of five boundaries and a maximum. The two sides will now take on each other in the second fixture of the five-match ODI series at the same venue on April 29 before the action shifts to National Bank Cricket Arena in Karachi, which will host the remaining three ODIs on May 3, 5 and 7.","pubDate":"2023-04-27 18:31:38","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Babar Azam achieves remarkable landmark at international level","link":"https://a-sports.tv/babar-azam-achieves-landmark-international/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Pakistan captain Babar Azam on Thursday, put another feather to his cape as the top-ranked ODI batter achieved a scintillating landmark amid the first PAK vs NZ ODI here at Pindi Cricket Stadium. Pakistan’s batting superstar Babar Azam accumulated 12,000 runs in international cricket when he scored his sixth run in the first PAK […] The post Babar Azam achieves remarkable landmark at international level appeared first on ASports.tv.","content":"Pakistan’s batting superstar Babar Azam accumulated 12,000 runs in international cricket when he scored his sixth run in the first PAK vs NZ ODI. The right-handed batter took just 277 innings to amass the milestone and became the fastest Pakistani and second-fastest Asian batter to achieve the feat. He is the sixth-fastest overall in the world to get to the milestone. West Indies batting great Sir Vivian Richards was the fastest batter to complete 12,000 runs as he took just 255 innings. Meanwhile, Babar is overall the eighth Pakistani batter to complete 12,000 runs in international cricket. He joined Inzamam-ul-Haq (20541), Mohammad Yousaf (17134), Javed Miandad (16213), Saleem Malik (12938), Saeed Anwar (12876), (12780) and Younis Khan (11790) in the elite list. It is pertinent to mention New Zealand set Pakistan to chase 289 in the first ODI after Babar put the touring side into bat as the coin flipped in his favour. Experienced all-rounder Daryl Mitchell led the charge for New Zealand as he scored a magnificent century while Will Young scored a brilliant half-century. Mitchell top-scored for New Zealand with 113 off 115 deliveries, laced with 11 boundaries and a six.","pubDate":"2023-04-27 17:24:19","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pakistan become third team to complete 500 ODI wins","link":"https://tribune.com.pk/story/2413988/pakistan-become-third-team-to-complete-500-odi-wins","keywords":["Cricket"],"creator":["NEWSDESK"],"video_url":null,"description":"The Men in Green reached the milestone in their 949th ODI","content":"Pakistan cricket team made history on Thursday by becoming the third team to complete 500 One Day International (ODI) wins, after India and Australia. This remarkable feat was achieved after their five-wicket victory against New Zealand in the first ODI, played at Pindi Cricket Stadium. Pakistan's journey to this milestone has been a long and illustrious one. They played their first ODI in 1973 against New Zealand, and since then, they have come a long way. With legendary players like Imran Khan, Wasim Akram, and Waqar Younis, Pakistan has been a force to be reckoned with in the world of cricket. Pakistan reached this milestone in their 949 th ODI. The Men in Green have won 92 ODIs against Sri Lanka, 73 vs India, 63 vs West Indies, 57 vs New Zealand, 54 vs Zimbabwe, 34 vs Australia, and 32 each against England and Bangladesh. In 978 ODIs, the Australian team has emerged victorious in 594 of them, while the Indian team has won 539 in 1029 ODIs. This victory not only made Pakistan the third team to reach the milestone of 500 ODI wins, but it also gave them a 1-0 lead in the three-match ODI series against New Zealand. With this historic win, Pakistan has once again cemented its position as a cricketing powerhouse and is sure to inspire the next generation of cricketers to follow in the footsteps of their heroes.","pubDate":"2023-04-27 14:26:50","image_url":"https://i.tribune.com.pk/media/images/fg1682623665-0/fg1682623665-0.jpg","source_id":"tribune_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PAK vs NZ ODI: Ton-up Mitchell, Young lift New Zealand to 288/7","link":"https://a-sports.tv/pak-vs-nz-odi-ton-up-mitchell-young-lift-new-zealand-288/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Daryl Mitchell scored a magnificent century after Will Young’s 86 to bolster New Zealand to a commendable total of 288/7 in the first PAK vs NZ ODI here at Pindi Cricket Stadium. Pakistan captain Babar Azam invited the touring side to bat in the first PAK vs NZ ODI after the coin flipped in […] The post PAK vs NZ ODI: Ton-up Mitchell, Young lift New Zealand to 288/7 appeared first on ASports.tv.","content":"Pakistan captain invited the touring side to bat in the first PAK vs NZ ODI after the coin flipped in his favour. New Zealand in response, piled 288/7 in their quota of 50 overs at the back of a brilliant century by Daryl Mitchell and an impressive half-century knock by Will Young. Earlier, the touring side got off to a cautious start as their openers added 48 runs inside the first 10 overs before Haris Rauf got rid of Chad Bowes, who struggled to score a 26-ball 18. Following his dismissal, opening batter Young joined hands with Mitchell and punished the hosts’ bowlers with a monumental 152-run partnership for the second wicket. The pair dominated the bowlers with clean striking until Young miscued one off Shadab in the 27th over and fell short just 14 short of a well-deserved century. He smashed eight boundaries and two sixes on his way to a brilliant 78-ball 86. Mitchell, however, stood firm and put on some brief yet crucial partnerships with Tom Latham (20) and Mark Chapman (15) before finally perishing in the 47th over. He top-scored for New Zealand with 113 off 115 deliveries, laced up with 11 boundaries and a six. Following his departure, Henry Nicholls (20*) and Rachin Ravindra (9) made valuable contributions at the backend to keep New Zealand on track for a decent total. Naseem Shah led the bowling attack with two wickets for just 29 runs while Haris Rauf and Shaheen Shah Afridi also picked as many wickets but were expensive. Shadab Khan, on the other hand, could pick up one.","pubDate":"2023-04-27 14:25:11","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"RR vs CSK, IPL 2023 Live Score: Sanju Samson Wins Toss, Opts To Bat vs MS Dhoni's CSK - NDTV Sports","link":"https://news.google.com/rss/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9yci12cy1jc2stbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0zN3RoLW1hdGNoLXJhamFzdGhhbi1yb3lhbHMtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLXVwZGF0ZXMtMzk4NDM4M9IBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9yci12cy1jc2stbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0zN3RoLW1hdGNoLXJhamFzdGhhbi1yb3lhbHMtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLXVwZGF0ZXMtMzk4NDM4My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"RR vs CSK, IPL 2023 Live Score: Sanju Samson Wins Toss, Opts To Bat vs MS Dhoni's CSK  NDTV SportsRR vs CHE Dream11 Prediction Today Match 37, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorIPL 2023 Can Rajasthan Royals stop the Chennai Super Kings juggernaut? | Cricbuzz.com - Cricbuzz  CricbuzzRR vs CSK Live Score, IPL 2023: Samson wins toss, Royals to bat first  Hindustan TimesRR vs CSK Live Score, IPL 2023: Sanju Samson wins the toss, Rajasthan opt to bat first in Jaipur, playing XIs named  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2023-04-27 13:44:08","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Stuart Broad claims England's 2021-22 hammering in Australia was not a \"real Ashes\"","link":"https://www.mirror.co.uk/sport/cricket/england-australia-ashes-stuart-broad-29827518","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Tom Blow)"],"video_url":null,"description":"England have won just two of their last 16 Tests against rivals Australia - but legendary bowler Stuart Broad isn't too concerned about his country's recent record","content":null,"pubDate":"2023-04-27 12:44:13","image_url":"https://i2-prod.mirror.co.uk/sport/article29827921.ece/ALTERNATES/s615/0_Screenshot-2023-04-27-132604.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Pics: Piyush goes past Ashwin on IPL all-time wicket-takers' list","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/web-stories/ipl-milestone-piyush-chawla-goes-past-ashwin-on-ipl-all-time-wicket-takers-list/photostory/99818587.cms","keywords":null,"creator":null,"video_url":null,"description":"Read more on TOI Sports","content":null,"pubDate":"2023-04-27 12:36:23","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Mendis, Madushka double hundreds give Sri Lanka slender hope of win in 2nd Test vs IRE","link":"https://www.indiatoday.in/sports/cricket/story/sl-vs-ire-kusal-mendis-nishan-madushka-double-hundreds-give-sri-lanka-slender-hope-of-win-in-2nd-test-2365458-2023-04-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Mendis, Madushka double hundreds give Sri Lanka slender hope of win in 2nd Test vs IRE","content":null,"pubDate":"2023-04-27 12:35:29","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Saudi Arabia’s grand sports washing campaign comes to finish off cricket’s current order","link":"https://www.businessweekly.co.zw/saudi-arabias-grand-sports-washing-campaign-comes-to-finish-off-crickets-current-order/","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"A lucrative T20 tournament is the country’s latest shameless attempt to forge a better reputation for itself – and it seemingly comes without care for the game itself. First the Kingdom of Saudi Arabia came for golf, and I did not speak out, because it’s for men named Chad who want to network while supporting […]","content":"eBusiness Weekly A lucrative T20 tournament is the country’s latest shameless attempt to forge a better reputation for itself – and it seemingly comes without care for the game itself. First the Kingdom of Saudi Arabia came for golf, and I did not speak out, because it’s for men named Chad who want to network while supporting the manufacturers of boat shoes. Then Saudi Arabia came for Newcastle United, and I did not speak out, because frankly it was Newcastle United. Actually, Saudi Arabia already had Formula One racing, but that was a natural fit between those who produce oil and the pastime that most conspicuously torches it. By the time they came for Cristiano Ronaldo he too seemed largely made of hydrocarbon polymer, though he is biodegrading faster. Now Saudi Arabia is coming for cricket – just another step in the grandest sportswashing campaign in history. The country is an autocratic monarchy run on the fundamentalist principles of Wahhabist Islam. Laws of ‘guardianship’ mean that women cede control of their lives to male relatives. The legal system uses prison, torture or execution against political dissent and anyone outside proscribed sexual or gender norms. The Saudi-led war in Yemen killed hundreds of thousands. The engine driving all this is Saudi Aramco, the biggest oil company in the world, the single biggest driver of our climate crisis, source of over 4% of global carbon emissions since 1965. Its only plan for the future is to increase production. So the kingdom wants a better reputation – not by addressing its failings, but by marketing. It has deduced that the best path is through high-profile sport, with its vast international audience and its remarkable ability to generate goodwill. Fifa boss Gianni Infantino, who never met a billion dollars that he didn’t like, is already softening up the audience for his Qatar sequel with a Saudi football World Cup in 2030. Taking over cricket was flagged when Aramco became the International Cricket Council’s naming sponsor last year, now plastered over every global event, while a Saudi tourism body is doing the same with the Indian Premier League. Cricket is an easy target. Only 12 countries play at the top level and only three are in financial health. The prize though is India, the monolith at cricket’s centre, a potential audience of 1.4 billion and rising, with a worldwide diaspora sprinkled on top. The Saudis want the IPL, perhaps by bringing the existing circus to town, preferably by starting a new complementary competition. Administered by the Indian board but with teams owned by private wealth, the Indian league currently bans Indian players from other tournaments worldwide to protect its own primacy. With a broadcast deal worth US$6.2bn, the IPL is used to walking into a room as the big spender, buying up teams in South Africa, the Caribbean, the Emirates, the United States. Saudi Arabia is among the few entities in the world that can approach Indian cricket and slap a bigger wallet on the table. So what? Don’t all countries have problems? Unsurprisingly the prospect of Saudi cash motivates plenty of apologists. They like to claim that criticism stems from racism, cynically using the language of equality to defend a project whose foundation is discrimination. It is true that every society has power structures that feed and benefit from inequality. It is also true that this reaches a different level when codified in law. Nations that recognised this when isolating apartheid South Africa are much less inclined to bother on gender grounds. Anyway, the whataboutery deflates against the reality of state operatives dismembering a journalist with bone saws. Aramco is framed as a tool of consumers – like it is a benign and passive force that meets demand, rather than the biggest player in an industry that has spent a century deliberately shaping the world to create that demand. Its defenders point at critics for using power or driving cars, somehow treating this as a gotcha rather than a reinforcement of the point: that the structure created by fossil fuels is practically impossible to live outside. Wealth creates influence, influence supports wealth: our societies could already be different if the richest within them didn’t have so much more money that they intend to make. It is that wealth, with an economy valued into the trillions, that emboldens Saudi sportswashing. Their one failure so far was sponsoring this year’s Women’s World Cup, an attempt abandoned after players and federations pushed back. This isn’t just shameless, like Aramco producing 13.6 billion barrels of oil last year while installing recycling stations for drink bottles at cricket grounds in the name of sustainability. There is something perversely aggressive about targeting events where all the competitors are women and so many are gay, as a country where their gender makes them second-class humans and their sexuality is a crime. Saudi marketers don’t care: they’re already bidding to host the 2026 Women’s Asian Cup. As for cricket, the end of the current order was already approaching, but a Saudi league will finish it off. The IPL takes up three months each year. A Saudi equivalent would have no reason to aim smaller. Others will crowd the gaps. The ICC will acquiesce, its members hoping for crumbs from the table. Test cricket is already a luxury most of them can’t afford. India, England, and Australia might continue it as occasional exhibitions. Otherwise, like football, internationals will give way to franchises, shrinking to short and frequent T20 World Cups, with the 50-over format a white elephant in search of its graveyard. Aside perhaps from a few conscientious objectors, the best players will come, because spending will outdo any previous conception of pay. Bear in mind that Australian golfer Cameron Smith, winner of exactly one major, scored US$100m to join the Saudi-backed LIV tour. The IPL’s income is limited by how much advertising broadcasters can sell. For Saudi Arabia that doesn’t matter at all. In time it will reshape cricket. For now, the celebrity and skill of top players still comes from national duty. Less international cricket will reduce this pathway. Anyone who does pop up will soon be recruited to the leagues. Talent discovery will mostly come through the franchises, their feeder teams, scouts and academies. Perhaps this will open up opportunity, depending where they look. You could spin all of this as a positive, if it wasn’t so patently part of something bigger, the most cosseted princeling in history scooping up every bauble that shines. There is not the slightest care for cricket itself, it is a vehicle. There is its audience and its reflected prestige. So the Saudi royals take the insane amounts of money made from decades of pollution, use it to lock in their feudal system that rejects all democratic principle, then spend obscene sums on sparkles and distractions so that… people will like them? Why do those so privileged, who clearly hold most people in contempt, still want to be liked? On goes the PR campaign. For those saying the Saudi monarchs have nothing to be ashamed of, they are certainly behaving like they do. There is the tourism angle, economically diversifying in case the oil does one day stop flowing, but that’s out of scale with the spending. There is entrenchment as a legitimate government in a world where theocratic monarchy is a vicious anachronism. There is washing away the aftertaste of using one’s embassies as extrajudicial murder rooms. But beware the motivations you haven’t yet anticipated, and the fact that once you hand something over you can’t have it back. Whatever they want, this regime’s crimes say they shouldn’t get it. Money says they will. The question that matters is what’s in it for them, but most people in cricket will be too busy wondering: what’s in it for me?","pubDate":"2023-04-27 22:01:35","image_url":null,"source_id":"businessweeklyzw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Naseem Shah’s brilliant spell propels him to unique ODI record","link":"https://a-sports.tv/naseem-shah-brilliant-spell-unique-odi-record/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks","Naseem Shah"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Pakistan’s young speedster Naseem Shah’s brilliant spell against New Zealand in the first PAK vs NZ ODI here on Thursday, propelled him to a unique ODI world record. Naseem Shah proved his mettle by bowling an astonishing spell in the first PAK vs NZ ODI against New Zealand; taking two wickets for just 29 […] The post Naseem Shah’s brilliant spell propels him to unique ODI record appeared first on ASports.tv.","content":"Naseem Shah proved his mettle by bowling an astonishing spell in the first PAK vs NZ ODI against New Zealand; taking two wickets for just 29 runs in his ten-over spell and toppling Matt Henry’s long-standing record of taking 19 wickets in the first six matches. The 19-year-old set a new record by taking 20 wickets in the first six ODIs of his career. He also holds the record for most wickets in the first four and five ODIs by leaving behind Imran Tahir, Ryan Harris, Zahoor Khan and Ibadat Hussain. The record-breaking performance by Naseem earned him high praise from cricket fans and experts around the world. His’s phenomenal bowling performance restricted New Zealand to 288 runs despite Daryl Mitchell’s century. Mitchell put on a scintillating show with the bat as he fought hard for his second ODI century. He top-scored for New Zealand with his career-best 113 in 115 balls, laced up with 11 boundaries and a six. After Naseem’s brilliance, it was Fakhar Zaman’s show, who scored his second-consecutive century against New Zealand and powered the home side to a resounding five-wicket victory over the touring side. The left-handed batter topped the scoring chart for Pakistan with a monumental 117-run knock in just 113 deliveries which featured 13 boundaries and a six. His opening partner Imam-ul-Haq also played a pivotal role in his team’s triumph with his calculated 60-run knock and laid a solid foundation by stitching a magnificent 124-run partnership with Fakhar.","pubDate":"2023-04-27 19:44:52","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Dominant Pakistan down New Zealand in first PAK vs NZ ODI","link":"https://a-sports.tv/pakistan-down-new-zealand-first-pak-vs-nz-odi/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Dominant Pakistan put on an all-round show to storm past New Zealand in the first PAK vs NZ ODI and scripted a winning start to the five-match series here at Pindi Cricket Stadium. Watch PAK vs NZ Live Match in HD Streaming The first ODI of the five-match series between Pakistan and New Zealand was […] The post Dominant Pakistan down New Zealand in first PAK vs NZ ODI appeared first on ASports.tv.","content":"The first PAK vs NZ ODI of the five-match series was played here at the Pindi Cricket Stadium on Thursday. Pakistan captain opted to bowl first after the coin flipped in his favour. New Zealand, batting first, put up a decent total on the scoreboard at the back of a brilliant century and half-century by Daryl Mitchell and Will Young respectively. Mitchell smashed 11 boundaries and a six on his way to top score for New Zealand with a 115-ball 113. On the other hand, Young scored 86 off just 78 deliveries, laced up with eight boundaries and two sixes. The target set by New Zealand eventually proved insufficient for their bowlers to defend at the back of resounding knocks by their openers Fakhar Zaman and . Fakhar Zaman continued his magnificent form to score his second-consecutive century and top-scored for Pakistan in the run chase. He piled up 117 runs in a mere 114 balls and smashed 13 boundaries and a six. Whereas Imam scored 60 off 65 with the help of five boundaries and a maximum. The two sides will now take on each other in the second fixture of the five-match ODI series at the same venue on April 29 before the action shifts to National Bank Cricket Arena in Karachi, which will host the remaining three ODIs on May 3, 5 and 7.","pubDate":"2023-04-27 18:31:38","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Babar Azam achieves remarkable landmark at international level","link":"https://a-sports.tv/babar-azam-achieves-landmark-international/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Pakistan captain Babar Azam on Thursday, put another feather to his cape as the top-ranked ODI batter achieved a scintillating landmark amid the first PAK vs NZ ODI here at Pindi Cricket Stadium. Pakistan’s batting superstar Babar Azam accumulated 12,000 runs in international cricket when he scored his sixth run in the first PAK […] The post Babar Azam achieves remarkable landmark at international level appeared first on ASports.tv.","content":"Pakistan’s batting superstar Babar Azam accumulated 12,000 runs in international cricket when he scored his sixth run in the first PAK vs NZ ODI. The right-handed batter took just 277 innings to amass the milestone and became the fastest Pakistani and second-fastest Asian batter to achieve the feat. He is the sixth-fastest overall in the world to get to the milestone. West Indies batting great Sir Vivian Richards was the fastest batter to complete 12,000 runs as he took just 255 innings. Meanwhile, Babar is overall the eighth Pakistani batter to complete 12,000 runs in international cricket. He joined Inzamam-ul-Haq (20541), Mohammad Yousaf (17134), Javed Miandad (16213), Saleem Malik (12938), Saeed Anwar (12876), (12780) and Younis Khan (11790) in the elite list. It is pertinent to mention New Zealand set Pakistan to chase 289 in the first ODI after Babar put the touring side into bat as the coin flipped in his favour. Experienced all-rounder Daryl Mitchell led the charge for New Zealand as he scored a magnificent century while Will Young scored a brilliant half-century. Mitchell top-scored for New Zealand with 113 off 115 deliveries, laced with 11 boundaries and a six.","pubDate":"2023-04-27 17:24:19","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pakistan become third team to complete 500 ODI wins","link":"https://tribune.com.pk/story/2413988/pakistan-become-third-team-to-complete-500-odi-wins","keywords":["Cricket"],"creator":["NEWSDESK"],"video_url":null,"description":"The Men in Green reached the milestone in their 949th ODI","content":"Pakistan cricket team made history on Thursday by becoming the third team to complete 500 One Day International (ODI) wins, after India and Australia. This remarkable feat was achieved after their five-wicket victory against New Zealand in the first ODI, played at Pindi Cricket Stadium. Pakistan's journey to this milestone has been a long and illustrious one. They played their first ODI in 1973 against New Zealand, and since then, they have come a long way. With legendary players like Imran Khan, Wasim Akram, and Waqar Younis, Pakistan has been a force to be reckoned with in the world of cricket. Pakistan reached this milestone in their 949 th ODI. The Men in Green have won 92 ODIs against Sri Lanka, 73 vs India, 63 vs West Indies, 57 vs New Zealand, 54 vs Zimbabwe, 34 vs Australia, and 32 each against England and Bangladesh. In 978 ODIs, the Australian team has emerged victorious in 594 of them, while the Indian team has won 539 in 1029 ODIs. This victory not only made Pakistan the third team to reach the milestone of 500 ODI wins, but it also gave them a 1-0 lead in the three-match ODI series against New Zealand. With this historic win, Pakistan has once again cemented its position as a cricketing powerhouse and is sure to inspire the next generation of cricketers to follow in the footsteps of their heroes.","pubDate":"2023-04-27 14:26:50","image_url":"https://i.tribune.com.pk/media/images/fg1682623665-0/fg1682623665-0.jpg","source_id":"tribune_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PAK vs NZ ODI: Ton-up Mitchell, Young lift New Zealand to 288/7","link":"https://a-sports.tv/pak-vs-nz-odi-ton-up-mitchell-young-lift-new-zealand-288/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Daryl Mitchell scored a magnificent century after Will Young’s 86 to bolster New Zealand to a commendable total of 288/7 in the first PAK vs NZ ODI here at Pindi Cricket Stadium. Pakistan captain Babar Azam invited the touring side to bat in the first PAK vs NZ ODI after the coin flipped in […] The post PAK vs NZ ODI: Ton-up Mitchell, Young lift New Zealand to 288/7 appeared first on ASports.tv.","content":"Pakistan captain invited the touring side to bat in the first PAK vs NZ ODI after the coin flipped in his favour. New Zealand in response, piled 288/7 in their quota of 50 overs at the back of a brilliant century by Daryl Mitchell and an impressive half-century knock by Will Young. Earlier, the touring side got off to a cautious start as their openers added 48 runs inside the first 10 overs before Haris Rauf got rid of Chad Bowes, who struggled to score a 26-ball 18. Following his dismissal, opening batter Young joined hands with Mitchell and punished the hosts’ bowlers with a monumental 152-run partnership for the second wicket. The pair dominated the bowlers with clean striking until Young miscued one off Shadab in the 27th over and fell short just 14 short of a well-deserved century. He smashed eight boundaries and two sixes on his way to a brilliant 78-ball 86. Mitchell, however, stood firm and put on some brief yet crucial partnerships with Tom Latham (20) and Mark Chapman (15) before finally perishing in the 47th over. He top-scored for New Zealand with 113 off 115 deliveries, laced up with 11 boundaries and a six. Following his departure, Henry Nicholls (20*) and Rachin Ravindra (9) made valuable contributions at the backend to keep New Zealand on track for a decent total. Naseem Shah led the bowling attack with two wickets for just 29 runs while Haris Rauf and Shaheen Shah Afridi also picked as many wickets but were expensive. Shadab Khan, on the other hand, could pick up one.","pubDate":"2023-04-27 14:25:11","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"RR vs CSK, IPL 2023 Live Score: Sanju Samson Wins Toss, Opts To Bat vs MS Dhoni's CSK - NDTV Sports","link":"https://news.google.com/rss/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9yci12cy1jc2stbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0zN3RoLW1hdGNoLXJhamFzdGhhbi1yb3lhbHMtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLXVwZGF0ZXMtMzk4NDM4M9IBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9yci12cy1jc2stbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0zN3RoLW1hdGNoLXJhamFzdGhhbi1yb3lhbHMtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLXVwZGF0ZXMtMzk4NDM4My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"RR vs CSK, IPL 2023 Live Score: Sanju Samson Wins Toss, Opts To Bat vs MS Dhoni's CSK  NDTV SportsRR vs CHE Dream11 Prediction Today Match 37, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorIPL 2023 Can Rajasthan Royals stop the Chennai Super Kings juggernaut? | Cricbuzz.com - Cricbuzz  CricbuzzRR vs CSK Live Score, IPL 2023: Samson wins toss, Royals to bat first  Hindustan TimesRR vs CSK Live Score, IPL 2023: Sanju Samson wins the toss, Rajasthan opt to bat first in Jaipur, playing XIs named  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2023-04-27 13:44:08","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Stuart Broad claims England's 2021-22 hammering in Australia was not a \"real Ashes\"","link":"https://www.mirror.co.uk/sport/cricket/england-australia-ashes-stuart-broad-29827518","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Tom Blow)"],"video_url":null,"description":"England have won just two of their last 16 Tests against rivals Australia - but legendary bowler Stuart Broad isn't too concerned about his country's recent record","content":null,"pubDate":"2023-04-27 12:44:13","image_url":"https://i2-prod.mirror.co.uk/sport/article29827921.ece/ALTERNATES/s615/0_Screenshot-2023-04-27-132604.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Pics: Piyush goes past Ashwin on IPL all-time wicket-takers' list","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/web-stories/ipl-milestone-piyush-chawla-goes-past-ashwin-on-ipl-all-time-wicket-takers-list/photostory/99818587.cms","keywords":null,"creator":null,"video_url":null,"description":"Read more on TOI Sports","content":null,"pubDate":"2023-04-27 12:36:23","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Mendis, Madushka double hundreds give Sri Lanka slender hope of win in 2nd Test vs IRE","link":"https://www.indiatoday.in/sports/cricket/story/sl-vs-ire-kusal-mendis-nishan-madushka-double-hundreds-give-sri-lanka-slender-hope-of-win-in-2nd-test-2365458-2023-04-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Mendis, Madushka double hundreds give Sri Lanka slender hope of win in 2nd Test vs IRE","content":null,"pubDate":"2023-04-27 12:35:29","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"},{"title":"Saudi Arabia’s grand sports washing campaign comes to finish off cricket’s current order","link":"https://www.businessweekly.co.zw/saudi-arabias-grand-sports-washing-campaign-comes-to-finish-off-crickets-current-order/","keywords":["Sports"],"creator":["malvernmugadzikwa"],"video_url":null,"description":"A lucrative T20 tournament is the country’s latest shameless attempt to forge a better reputation for itself – and it seemingly comes without care for the game itself. First the Kingdom of Saudi Arabia came for golf, and I did not speak out, because it’s for men named Chad who want to network while supporting […]","content":"eBusiness Weekly A lucrative T20 tournament is the country’s latest shameless attempt to forge a better reputation for itself – and it seemingly comes without care for the game itself. First the Kingdom of Saudi Arabia came for golf, and I did not speak out, because it’s for men named Chad who want to network while supporting the manufacturers of boat shoes. Then Saudi Arabia came for Newcastle United, and I did not speak out, because frankly it was Newcastle United. Actually, Saudi Arabia already had Formula One racing, but that was a natural fit between those who produce oil and the pastime that most conspicuously torches it. By the time they came for Cristiano Ronaldo he too seemed largely made of hydrocarbon polymer, though he is biodegrading faster. Now Saudi Arabia is coming for cricket – just another step in the grandest sportswashing campaign in history. The country is an autocratic monarchy run on the fundamentalist principles of Wahhabist Islam. Laws of ‘guardianship’ mean that women cede control of their lives to male relatives. The legal system uses prison, torture or execution against political dissent and anyone outside proscribed sexual or gender norms. The Saudi-led war in Yemen killed hundreds of thousands. The engine driving all this is Saudi Aramco, the biggest oil company in the world, the single biggest driver of our climate crisis, source of over 4% of global carbon emissions since 1965. Its only plan for the future is to increase production. So the kingdom wants a better reputation – not by addressing its failings, but by marketing. It has deduced that the best path is through high-profile sport, with its vast international audience and its remarkable ability to generate goodwill. Fifa boss Gianni Infantino, who never met a billion dollars that he didn’t like, is already softening up the audience for his Qatar sequel with a Saudi football World Cup in 2030. Taking over cricket was flagged when Aramco became the International Cricket Council’s naming sponsor last year, now plastered over every global event, while a Saudi tourism body is doing the same with the Indian Premier League. Cricket is an easy target. Only 12 countries play at the top level and only three are in financial health. The prize though is India, the monolith at cricket’s centre, a potential audience of 1.4 billion and rising, with a worldwide diaspora sprinkled on top. The Saudis want the IPL, perhaps by bringing the existing circus to town, preferably by starting a new complementary competition. Administered by the Indian board but with teams owned by private wealth, the Indian league currently bans Indian players from other tournaments worldwide to protect its own primacy. With a broadcast deal worth US$6.2bn, the IPL is used to walking into a room as the big spender, buying up teams in South Africa, the Caribbean, the Emirates, the United States. Saudi Arabia is among the few entities in the world that can approach Indian cricket and slap a bigger wallet on the table. So what? Don’t all countries have problems? Unsurprisingly the prospect of Saudi cash motivates plenty of apologists. They like to claim that criticism stems from racism, cynically using the language of equality to defend a project whose foundation is discrimination. It is true that every society has power structures that feed and benefit from inequality. It is also true that this reaches a different level when codified in law. Nations that recognised this when isolating apartheid South Africa are much less inclined to bother on gender grounds. Anyway, the whataboutery deflates against the reality of state operatives dismembering a journalist with bone saws. Aramco is framed as a tool of consumers – like it is a benign and passive force that meets demand, rather than the biggest player in an industry that has spent a century deliberately shaping the world to create that demand. Its defenders point at critics for using power or driving cars, somehow treating this as a gotcha rather than a reinforcement of the point: that the structure created by fossil fuels is practically impossible to live outside. Wealth creates influence, influence supports wealth: our societies could already be different if the richest within them didn’t have so much more money that they intend to make. It is that wealth, with an economy valued into the trillions, that emboldens Saudi sportswashing. Their one failure so far was sponsoring this year’s Women’s World Cup, an attempt abandoned after players and federations pushed back. This isn’t just shameless, like Aramco producing 13.6 billion barrels of oil last year while installing recycling stations for drink bottles at cricket grounds in the name of sustainability. There is something perversely aggressive about targeting events where all the competitors are women and so many are gay, as a country where their gender makes them second-class humans and their sexuality is a crime. Saudi marketers don’t care: they’re already bidding to host the 2026 Women’s Asian Cup. As for cricket, the end of the current order was already approaching, but a Saudi league will finish it off. The IPL takes up three months each year. A Saudi equivalent would have no reason to aim smaller. Others will crowd the gaps. The ICC will acquiesce, its members hoping for crumbs from the table. Test cricket is already a luxury most of them can’t afford. India, England, and Australia might continue it as occasional exhibitions. Otherwise, like football, internationals will give way to franchises, shrinking to short and frequent T20 World Cups, with the 50-over format a white elephant in search of its graveyard. Aside perhaps from a few conscientious objectors, the best players will come, because spending will outdo any previous conception of pay. Bear in mind that Australian golfer Cameron Smith, winner of exactly one major, scored US$100m to join the Saudi-backed LIV tour. The IPL’s income is limited by how much advertising broadcasters can sell. For Saudi Arabia that doesn’t matter at all. In time it will reshape cricket. For now, the celebrity and skill of top players still comes from national duty. Less international cricket will reduce this pathway. Anyone who does pop up will soon be recruited to the leagues. Talent discovery will mostly come through the franchises, their feeder teams, scouts and academies. Perhaps this will open up opportunity, depending where they look. You could spin all of this as a positive, if it wasn’t so patently part of something bigger, the most cosseted princeling in history scooping up every bauble that shines. There is not the slightest care for cricket itself, it is a vehicle. There is its audience and its reflected prestige. So the Saudi royals take the insane amounts of money made from decades of pollution, use it to lock in their feudal system that rejects all democratic principle, then spend obscene sums on sparkles and distractions so that… people will like them? Why do those so privileged, who clearly hold most people in contempt, still want to be liked? On goes the PR campaign. For those saying the Saudi monarchs have nothing to be ashamed of, they are certainly behaving like they do. There is the tourism angle, economically diversifying in case the oil does one day stop flowing, but that’s out of scale with the spending. There is entrenchment as a legitimate government in a world where theocratic monarchy is a vicious anachronism. There is washing away the aftertaste of using one’s embassies as extrajudicial murder rooms. But beware the motivations you haven’t yet anticipated, and the fact that once you hand something over you can’t have it back. Whatever they want, this regime’s crimes say they shouldn’t get it. Money says they will. The question that matters is what’s in it for them, but most people in cricket will be too busy wondering: what’s in it for me?","pubDate":"2023-04-27 22:01:35","image_url":null,"source_id":"businessweeklyzw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Naseem Shah’s brilliant spell propels him to unique ODI record","link":"https://a-sports.tv/naseem-shah-brilliant-spell-unique-odi-record/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks","Naseem Shah"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Pakistan’s young speedster Naseem Shah’s brilliant spell against New Zealand in the first PAK vs NZ ODI here on Thursday, propelled him to a unique ODI world record. Naseem Shah proved his mettle by bowling an astonishing spell in the first PAK vs NZ ODI against New Zealand; taking two wickets for just 29 […] The post Naseem Shah’s brilliant spell propels him to unique ODI record appeared first on ASports.tv.","content":"Naseem Shah proved his mettle by bowling an astonishing spell in the first PAK vs NZ ODI against New Zealand; taking two wickets for just 29 runs in his ten-over spell and toppling Matt Henry’s long-standing record of taking 19 wickets in the first six matches. The 19-year-old set a new record by taking 20 wickets in the first six ODIs of his career. He also holds the record for most wickets in the first four and five ODIs by leaving behind Imran Tahir, Ryan Harris, Zahoor Khan and Ibadat Hussain. The record-breaking performance by Naseem earned him high praise from cricket fans and experts around the world. His’s phenomenal bowling performance restricted New Zealand to 288 runs despite Daryl Mitchell’s century. Mitchell put on a scintillating show with the bat as he fought hard for his second ODI century. He top-scored for New Zealand with his career-best 113 in 115 balls, laced up with 11 boundaries and a six. After Naseem’s brilliance, it was Fakhar Zaman’s show, who scored his second-consecutive century against New Zealand and powered the home side to a resounding five-wicket victory over the touring side. The left-handed batter topped the scoring chart for Pakistan with a monumental 117-run knock in just 113 deliveries which featured 13 boundaries and a six. His opening partner Imam-ul-Haq also played a pivotal role in his team’s triumph with his calculated 60-run knock and laid a solid foundation by stitching a magnificent 124-run partnership with Fakhar.","pubDate":"2023-04-27 19:44:52","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Dominant Pakistan down New Zealand in first PAK vs NZ ODI","link":"https://a-sports.tv/pakistan-down-new-zealand-first-pak-vs-nz-odi/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Dominant Pakistan put on an all-round show to storm past New Zealand in the first PAK vs NZ ODI and scripted a winning start to the five-match series here at Pindi Cricket Stadium. Watch PAK vs NZ Live Match in HD Streaming The first ODI of the five-match series between Pakistan and New Zealand was […] The post Dominant Pakistan down New Zealand in first PAK vs NZ ODI appeared first on ASports.tv.","content":"The first PAK vs NZ ODI of the five-match series was played here at the Pindi Cricket Stadium on Thursday. Pakistan captain opted to bowl first after the coin flipped in his favour. New Zealand, batting first, put up a decent total on the scoreboard at the back of a brilliant century and half-century by Daryl Mitchell and Will Young respectively. Mitchell smashed 11 boundaries and a six on his way to top score for New Zealand with a 115-ball 113. On the other hand, Young scored 86 off just 78 deliveries, laced up with eight boundaries and two sixes. The target set by New Zealand eventually proved insufficient for their bowlers to defend at the back of resounding knocks by their openers Fakhar Zaman and . Fakhar Zaman continued his magnificent form to score his second-consecutive century and top-scored for Pakistan in the run chase. He piled up 117 runs in a mere 114 balls and smashed 13 boundaries and a six. Whereas Imam scored 60 off 65 with the help of five boundaries and a maximum. The two sides will now take on each other in the second fixture of the five-match ODI series at the same venue on April 29 before the action shifts to National Bank Cricket Arena in Karachi, which will host the remaining three ODIs on May 3, 5 and 7.","pubDate":"2023-04-27 18:31:38","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Babar Azam achieves remarkable landmark at international level","link":"https://a-sports.tv/babar-azam-achieves-landmark-international/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Pakistan captain Babar Azam on Thursday, put another feather to his cape as the top-ranked ODI batter achieved a scintillating landmark amid the first PAK vs NZ ODI here at Pindi Cricket Stadium. Pakistan’s batting superstar Babar Azam accumulated 12,000 runs in international cricket when he scored his sixth run in the first PAK […] The post Babar Azam achieves remarkable landmark at international level appeared first on ASports.tv.","content":"Pakistan’s batting superstar Babar Azam accumulated 12,000 runs in international cricket when he scored his sixth run in the first PAK vs NZ ODI. The right-handed batter took just 277 innings to amass the milestone and became the fastest Pakistani and second-fastest Asian batter to achieve the feat. He is the sixth-fastest overall in the world to get to the milestone. West Indies batting great Sir Vivian Richards was the fastest batter to complete 12,000 runs as he took just 255 innings. Meanwhile, Babar is overall the eighth Pakistani batter to complete 12,000 runs in international cricket. He joined Inzamam-ul-Haq (20541), Mohammad Yousaf (17134), Javed Miandad (16213), Saleem Malik (12938), Saeed Anwar (12876), (12780) and Younis Khan (11790) in the elite list. It is pertinent to mention New Zealand set Pakistan to chase 289 in the first ODI after Babar put the touring side into bat as the coin flipped in his favour. Experienced all-rounder Daryl Mitchell led the charge for New Zealand as he scored a magnificent century while Will Young scored a brilliant half-century. Mitchell top-scored for New Zealand with 113 off 115 deliveries, laced with 11 boundaries and a six.","pubDate":"2023-04-27 17:24:19","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"Pakistan become third team to complete 500 ODI wins","link":"https://tribune.com.pk/story/2413988/pakistan-become-third-team-to-complete-500-odi-wins","keywords":["Cricket"],"creator":["NEWSDESK"],"video_url":null,"description":"The Men in Green reached the milestone in their 949th ODI","content":"Pakistan cricket team made history on Thursday by becoming the third team to complete 500 One Day International (ODI) wins, after India and Australia. This remarkable feat was achieved after their five-wicket victory against New Zealand in the first ODI, played at Pindi Cricket Stadium. Pakistan's journey to this milestone has been a long and illustrious one. They played their first ODI in 1973 against New Zealand, and since then, they have come a long way. With legendary players like Imran Khan, Wasim Akram, and Waqar Younis, Pakistan has been a force to be reckoned with in the world of cricket. Pakistan reached this milestone in their 949 th ODI. The Men in Green have won 92 ODIs against Sri Lanka, 73 vs India, 63 vs West Indies, 57 vs New Zealand, 54 vs Zimbabwe, 34 vs Australia, and 32 each against England and Bangladesh. In 978 ODIs, the Australian team has emerged victorious in 594 of them, while the Indian team has won 539 in 1029 ODIs. This victory not only made Pakistan the third team to reach the milestone of 500 ODI wins, but it also gave them a 1-0 lead in the three-match ODI series against New Zealand. With this historic win, Pakistan has once again cemented its position as a cricketing powerhouse and is sure to inspire the next generation of cricketers to follow in the footsteps of their heroes.","pubDate":"2023-04-27 14:26:50","image_url":"https://i.tribune.com.pk/media/images/fg1682623665-0/fg1682623665-0.jpg","source_id":"tribune_pk","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"PAK vs NZ ODI: Ton-up Mitchell, Young lift New Zealand to 288/7","link":"https://a-sports.tv/pak-vs-nz-odi-ton-up-mitchell-young-lift-new-zealand-288/","keywords":["Cricket","PAK vs NZ","Sports","Top News","Top Picks"],"creator":["A Sports"],"video_url":null,"description":"RAWALPINDI: Daryl Mitchell scored a magnificent century after Will Young’s 86 to bolster New Zealand to a commendable total of 288/7 in the first PAK vs NZ ODI here at Pindi Cricket Stadium. Pakistan captain Babar Azam invited the touring side to bat in the first PAK vs NZ ODI after the coin flipped in […] The post PAK vs NZ ODI: Ton-up Mitchell, Young lift New Zealand to 288/7 appeared first on ASports.tv.","content":"Pakistan captain invited the touring side to bat in the first PAK vs NZ ODI after the coin flipped in his favour. New Zealand in response, piled 288/7 in their quota of 50 overs at the back of a brilliant century by Daryl Mitchell and an impressive half-century knock by Will Young. Earlier, the touring side got off to a cautious start as their openers added 48 runs inside the first 10 overs before Haris Rauf got rid of Chad Bowes, who struggled to score a 26-ball 18. Following his dismissal, opening batter Young joined hands with Mitchell and punished the hosts’ bowlers with a monumental 152-run partnership for the second wicket. The pair dominated the bowlers with clean striking until Young miscued one off Shadab in the 27th over and fell short just 14 short of a well-deserved century. He smashed eight boundaries and two sixes on his way to a brilliant 78-ball 86. Mitchell, however, stood firm and put on some brief yet crucial partnerships with Tom Latham (20) and Mark Chapman (15) before finally perishing in the 47th over. He top-scored for New Zealand with 113 off 115 deliveries, laced up with 11 boundaries and a six. Following his departure, Henry Nicholls (20*) and Rachin Ravindra (9) made valuable contributions at the backend to keep New Zealand on track for a decent total. Naseem Shah led the bowling attack with two wickets for just 29 runs while Haris Rauf and Shaheen Shah Afridi also picked as many wickets but were expensive. Shadab Khan, on the other hand, could pick up one.","pubDate":"2023-04-27 14:25:11","image_url":null,"source_id":"arynews","category":["sports"],"country":["pakistan"],"language":"english"},{"title":"RR vs CSK, IPL 2023 Live Score: Sanju Samson Wins Toss, Opts To Bat vs MS Dhoni's CSK - NDTV Sports","link":"https://news.google.com/rss/articles/CBMikgFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9yci12cy1jc2stbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0zN3RoLW1hdGNoLXJhamFzdGhhbi1yb3lhbHMtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLXVwZGF0ZXMtMzk4NDM4M9IBmAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9yci12cy1jc2stbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0zN3RoLW1hdGNoLXJhamFzdGhhbi1yb3lhbHMtdnMtY2hlbm5haS1zdXBlci1raW5ncy1saXZlLXNjb3JlLXVwZGF0ZXMtMzk4NDM4My9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"RR vs CSK, IPL 2023 Live Score: Sanju Samson Wins Toss, Opts To Bat vs MS Dhoni's CSK  NDTV SportsRR vs CHE Dream11 Prediction Today Match 37, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorIPL 2023 Can Rajasthan Royals stop the Chennai Super Kings juggernaut? | Cricbuzz.com - Cricbuzz  CricbuzzRR vs CSK Live Score, IPL 2023: Samson wins toss, Royals to bat first  Hindustan TimesRR vs CSK Live Score, IPL 2023: Sanju Samson wins the toss, Rajasthan opt to bat first in Jaipur, playing XIs named  The Indian ExpressView Full coverage on Google News","content":null,"pubDate":"2023-04-27 13:44:08","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"Stuart Broad claims England's 2021-22 hammering in Australia was not a \"real Ashes\"","link":"https://www.mirror.co.uk/sport/cricket/england-australia-ashes-stuart-broad-29827518","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Tom Blow)"],"video_url":null,"description":"England have won just two of their last 16 Tests against rivals Australia - but legendary bowler Stuart Broad isn't too concerned about his country's recent record","content":null,"pubDate":"2023-04-27 12:44:13","image_url":"https://i2-prod.mirror.co.uk/sport/article29827921.ece/ALTERNATES/s615/0_Screenshot-2023-04-27-132604.jpg","source_id":"mirroruk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"Pics: Piyush goes past Ashwin on IPL all-time wicket-takers' list","link":"https://timesofindia.indiatimes.com/sports/cricket/ipl/web-stories/ipl-milestone-piyush-chawla-goes-past-ashwin-on-ipl-all-time-wicket-takers-list/photostory/99818587.cms","keywords":null,"creator":null,"video_url":null,"description":"Read more on TOI Sports","content":null,"pubDate":"2023-04-27 12:36:23","image_url":null,"source_id":"toi","category":["sports"],"country":["india"],"language":"english"},{"title":"Mendis, Madushka double hundreds give Sri Lanka slender hope of win in 2nd Test vs IRE","link":"https://www.indiatoday.in/sports/cricket/story/sl-vs-ire-kusal-mendis-nishan-madushka-double-hundreds-give-sri-lanka-slender-hope-of-win-in-2nd-test-2365458-2023-04-27?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Mendis, Madushka double hundreds give Sri Lanka slender hope of win in 2nd Test vs IRE","content":null,"pubDate":"2023-04-27 12:35:29","image_url":null,"source_id":"indiatoday","category":["sports"],"country":["india"],"language":"english"}]}