{"newsArray":[{"title":"'Oh my God': Cricket world in disbelief over 'insane' Ashes drama","link":"https://au.sports.yahoo.com/ashes-2021-cricket-world-disbelief-insane-drama-202631796.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-01-09 20:26:31","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-01/fed2d150-7189-11ec-beec-2345604dc80d","source_id":"yahoo"},{"title":"Arsenal stunned in FA Cup by second-tier Forest","link":"https://wwos.nine.com.au/football/fa-cup-2022-nottingham-forest-stun-arsenal-in-third-round/91daf2fe-3cbf-4b9c-bd92-230097a6f5f5","keywords":null,"creator":["wwos"],"video_url":null,"description":"Arsenal failed to transfer its improved Premier League form to the FA Cup, losing 1-0 to second-tier Nottingham Forest on Sunday.","content":"Arsenal failed to transfer its improved Premier League form to the FA Cup, losing 1-0 to second-tier Nottingham Forest on Sunday in the second big shock of the third round.By conceding an 83rd-minute goal at the City Ground, Arsenal became the highest-ranked casualty at the stage of the competition that sees Premier League teams enter the draw.So inept was Arsenal's display that Mikel Arteta's team failed to have a shot on target against Forest, a former European champion which has fallen on hard times since the turn of the century and is ninth in the Championship.READ MORE: Barty's ominous warning on road to Australian OpenREAD MORE: Tubby 'worried' about Carey after ugly gameREAD MORE: Test cricket at its best as England hold onIt was in stark contrast to Arsenal's recent performances in the Premier League that have helped to lift the team into the Champions League positions. Just last week, Arsenal outplayed leader and defending champion Manchester City before imploding after a second-half red card.The FA Cup has served up some surprises at the third-round stage, no bigger than Newcastle losing at home to third-tier Cambridge United on Saturday.There looked to be the possibility of two more shocks earlier in Sunday's early games, with Tottenham and Liverpool falling behind at home to third-tier opponents only to avoid embarrassment.A little bit of luck — or maybe it was pinpoint precision — proved crucial in Tottenham's turnaround against Morecambe.With his team trailing 1-0 after 73 minutes, Tottenham midfielder Harry Winks sent in a free kick from near the corner flag on the left wing and the ball flew over everyone and into the top corner.“This one I meant,” Winks said, laughing.Substitutes Lucas Moura and Harry Kane added further goals in the final five minutes to seal a 3-1 win for Spurs, who denied Morecambe a place in the fourth round for the first time in their 101-year history.Liverpool won 4-1 but started its comeback much earlier, equalizing seven minutes after going behind in the 27th to Shrewsbury.Kaide Gordon, one of five academy players handed a start in a youthful Liverpool lineup, became the second-youngest scorer in the club's history — at 17 years and 96 days — with a coolly taken goal for 1-1 before Fabinho scored either side of a cheeky backheel goal from fellow Brazilian Roberto Firmino, who came on as a substitute.Liverpool manager Jürgen Klopp was back in the dugout after spending time in isolation following a positive test for the coronavirus, which came amid an outbreak at the club which led to the training ground getting closed for two days.“This was the team we could line up today and the boys did really well,” Klopp said of his makeshift team.West Ham won an all-Premier League matchup against Leeds 2-0, with the crucial opening goal — scored by Manuel Lanzini — controversially awarded after a potential offside against Jarrod Bowen. Leeds players complained about it on the field, and its chairman did so via his Twitter account.https://twitter.com/andrearadri/status/1480192457988087820Bowen added a second in the stoppage time as Leeds made a third-round exit for the ninth time in the last 12 seasons.Premier League teams Wolverhampton and Norwich also advanced after beating lower-league teams Sheffield United (3-0) and Charlton (1-0), respectively.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-09 20:01:38","full_description":"Arsenal failed to transfer its improved Premier League form to the FA Cup, losing 1-0 to second-tier Nottingham Forest on Sunday in the second big shock of the third round. By conceding an 83rd-minute goal at the City Ground, Arsenal became the highest-ranked casualty at the stage of the competition that sees Premier League teams enter the draw. So inept was Arsenal's display that Mikel Arteta's team failed to have a shot on target against Forest, a former European champion which has fallen on hard times since the turn of the century and is ninth in the Championship. READ MORE: Barty's ominous warning on road to Australian Open READ MORE: Tubby 'worried' about Carey after ugly game READ MORE: Test cricket at its best as England hold on It was in stark contrast to Arsenal's recent performances in the Premier League that have helped to lift the team into the Champions League positions. Just last week, Arsenal outplayed leader and defending champion Manchester City before imploding after a second-half red card. The FA Cup has served up some surprises at the third-round stage, no bigger than Newcastle losing at home to third-tier Cambridge United on Saturday. There looked to be the possibility of two more shocks earlier in Sunday's early games, with Tottenham and Liverpool falling behind at home to third-tier opponents only to avoid embarrassment. A little bit of luck — or maybe it was pinpoint precision — proved crucial in Tottenham's turnaround against Morecambe. With his team trailing 1-0 after 73 minutes, Tottenham midfielder Harry Winks sent in a free kick from near the corner flag on the left wing and the ball flew over everyone and into the top corner. “This one I meant,” Winks said, laughing. Substitutes Lucas Moura and Harry Kane added further goals in the final five minutes to seal a 3-1 win for Spurs, who denied Morecambe a place in the fourth round for the first time in their 101-year history. Liverpool won 4-1 but started its comeback much earlier, equalizing seven minutes after going behind in the 27th to Shrewsbury. Kaide Gordon, one of five academy players handed a start in a youthful Liverpool lineup, became the second-youngest scorer in the club's history — at 17 years and 96 days — with a coolly taken goal for 1-1 before Fabinho scored either side of a cheeky backheel goal from fellow Brazilian Roberto Firmino, who came on as a substitute. Liverpool manager Jürgen Klopp was back in the dugout after spending time in isolation following a positive test for the coronavirus, which came amid an outbreak at the club which led to the training ground getting closed for two days. “This was the team we could line up today and the boys did really well,” Klopp said of his makeshift team. West Ham won an all-Premier League matchup against Leeds 2-0, with the crucial opening goal — scored by Manuel Lanzini — controversially awarded after a potential offside against Jarrod Bowen. Leeds players complained about it on the field, and its chairman did so via his Twitter account. Bowen added a second in the stoppage time as Leeds made a third-round exit for the ninth time in the last 12 seasons. Premier League teams Wolverhampton and Norwich also advanced after beating lower-league teams Sheffield United (3-0) and Charlton (1-0), respectively. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/402907/pickerimage.jpg","source_id":"nine"},{"title":"“It’s hard being me”: When Kevin Pietersen threatened EBC to retire from Test Cricket over allegations of a dressing room split","link":"https://thesportsrush.com/cricket-news-its-hard-being-me-when-kevin-pietersen-threatened-ebc-to-retire-from-test-cricket-over-allegations-of-a-dressing-room-split/","keywords":["Cricket","kevin pietersen"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen had sent shock waves in England Cricket with a shocking interview post scoring a ton versus South Africa at Leeds in 2012. Kevin Pietersen batted like a marvel to notch-up his 21st Test century with a sublime 149 against the Proteas in August 2012, thereby also reaching the milestone of 7000 Test runs… The post “It’s hard being me”: When Kevin Pietersen threatened EBC to retire from Test Cricket over allegations of a dressing room split appeared first on The SportsRush.","content":"Kevin Pietersen had sent shock waves in England Cricket with a shocking interview post scoring a ton versus South Africa at Leeds in 2012. Kevin Pietersen batted like a marvel to notch-up his 21st Test century with a sublime 149 against the Proteas in August 2012, thereby also reaching the milestone of 7000 Test runs for England. That century meant that he was only behind Wally Hammond, Colin Cowdrey and Geoff Boycott to have scored maximum Test tons for England. Cut to the end of the Test match, and the 32-year-old comes up with a shocking interview after being awarded the ‘Man of the Match’. But before coming to that, only a few months earlier, in May 2012, the star right-handed batter had announced his retirement from ODI and T20 Cricket over an ECB central contract issue which stated that he must be available for both formats of the game. He however, wished to play in the ICC Twenty20 World Cup that was due to commence in September that year. “I am immensely proud of my achievements in the one-day game, but still wish to be considered for selection for England in Test cricket. For the record, were the selection criteria not in place, I would have readily played for England in the upcoming ICC World Twenty20,” Pietersen said in a statement. Having signed a lucrative contract with the Delhi Daredevils in the IPL, fans and experts were more than certain that it was money over nation that was the root cause in the lead up towards the decision, although Pietersen denied any such motive repeatedly. But, it was England’s tour of South Africa in August that year, that brought out the ugly side of it all, leading to a long standing controversy involving Pietersen and his fellow team mates in the English side. #barmyadvent, December 16th: Today’s clip is @KP24’s 149 at Headingley vs South Africa. This was a fantastic innings: http://t.co/vBdvVny2Ot — England’s Barmy Army (@TheBarmyArmy) December 16, 2014 Kevin Pietersen interview Post scoring the aforementioned ton in the first innings of the 2nd Test at Leeds, Kevin Pietersen came up with an unexpected interview. He hinted, or rather threatened to retire from Test Cricket. Reason?- It would later unfold in the form of a clear case of rift between him and a few England cricketers. “It’s tough being me, playing for England,” the 32-year-old told reporters after the century in Leeds. “It’s absolutely 100 percent not about money … there are clear things that I’m discussing but there are other issues that need to be sorted. You’ll find out soon enough.” When asked if the following third and the last Test at Lord’s could be his last, he said: “Anything’s possible. It would be a huge shame. I love playing test cricket for England but … we’ll see.” “For me the saddest part about all this is that the spectators just love watching me play – and I love playing for England.” A month later, after being dropped from the Third Test at Lord’s and from the 30-probables list for the Twenty20 World Cup in Sri Lanka, Pietersen pressed ECB to carry out a serious investigation into his suspicion that his England team-mates Graeme Swann and James Anderson were feeding information to a certain ‘KP Genius’ parody Twitter account. The above mentioned account, was followed by several members of the team and he explicably stated that private conversations between him, Anderson and Swann were referenced in various tweets. All these allegations by the right-hander came after his messages to the players of the South African team were leaked, which allegedly contained contents of private conversation between him and former England skipper Andrew Strauss. The South African players, however had termed the conversation as part of a mere banter between them and Pietersen. Although Pietersen regained the central contract in January next year following an apology from his side to his team mates, the relationship amongst them, especially with Andrew Strauss ended on a sour note. On top of it, ultimately it was Kevin Pietersen himself, failing to provide any evidence pertaining his allegations regarding the ‘KP Genius’ parody account, who came out as the one causing all the unrest and troubles within the English dressing room.                       The post “It’s hard being me”: When Kevin Pietersen threatened EBC to retire from Test Cricket over allegations of a dressing room split appeared first on The SportsRush.","pubDate":"2022-01-09 18:31:58","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“It’s hard being me”: When Kevin Pietersen threatened EBC with his Test Cricket retirement over allegations of a dressing room split","link":"https://thesportsrush.com/cricket-news-its-hard-being-me-when-kevin-pietersen-threatened-ebc-with-his-test-cricket-retirement-over-allegations-of-a-dressing-room-split/","keywords":["Cricket","kevin pietersen"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Kevin Pietersen had sent shock waves in England Cricket with a shocking interview post scoring a ton versus South Africa at Leeds in 2012. Kevin Pietersen batted like a marvel to notch-up his 21st Test century with a sublime 149 against the Proteas in August 2012, thereby also reaching the milestone of 7000 Test runs… The post “It’s hard being me”: When Kevin Pietersen threatened EBC with his Test Cricket retirement over allegations of a dressing room split appeared first on The SportsRush.","content":"Kevin Pietersen had sent shock waves in England Cricket with a shocking interview post scoring a ton versus South Africa at Leeds in 2012. Kevin Pietersen batted like a marvel to notch-up his 21st Test century with a sublime 149 against the Proteas in August 2012, thereby also reaching the milestone of 7000 Test runs for England. That century meant that he was only behind Wally Hammond, Colin Cowdrey and Geoff Boycott to have scored maximum Test tons for England. Cut to the end of the Test match, and the 32-year-old comes up with a shocking interview after being awarded the ‘Man of the Match’. But before coming to that, only a few months earlier, in May 2012, the star right-handed batter had announced his retirement from ODI and T20 Cricket over an ECB central contract issue which stated that he must be available for both formats of the game. He however, wished to play in the ICC Twenty20 World Cup that was due to commence in September that year. “I am immensely proud of my achievements in the one-day game, but still wish to be considered for selection for England in Test cricket. For the record, were the selection criteria not in place, I would have readily played for England in the upcoming ICC World Twenty20,” Pietersen said in a statement. Having signed a lucrative contract with the Delhi Daredevils in the IPL, fans and experts were more than certain that it was money over nation that was the root cause in the lead up to the decision, although Pietersen denied any such motive repeatedly. But, it was England’s tour of South Africa in August that year, that brought out the ugly side of it all, leading to a long standing controversy involving Pietersen and his fellow team mates in the English side. #barmyadvent, December 16th: Today’s clip is @KP24’s 149 at Headingley vs South Africa. This was a fantastic innings: http://t.co/vBdvVny2Ot — England’s Barmy Army (@TheBarmyArmy) December 16, 2014 Kevin Pietersen interview Post scoring the aforementioned ton in the first innings of the 2nd Test at Leeds, Kevin Pietersen came up with an unexpected interview. He hinted, or rather threatened to retire from Test Cricket. Reason?- It would later unfold in the form of a clear case of rift between him and a few England cricketers. “It’s tough being me, playing for England,” the 32-year-old told reporters after the century in Leeds. “It’s absolutely 100 percent not about money … there are clear things that I’m discussing but there are other issues that need to be sorted. You’ll find out soon enough.” When asked if the following third and the last Test at Lord’s could be his last, he said: “Anything’s possible. It would be a huge shame. I love playing test cricket for England but … we’ll see.” “For me the saddest part about all this is that the spectators just love watching me play – and I love playing for England.” A month later, after being dropped from the Third Test at Lord’s and from the 30-probables list for the Twenty20 World Cup in Sri Lanka, Pietersen pressed ECB to carry out a serious investigation into his suspicion that his England team-mates Graeme Swann and James Anderson were feeding information to a certain ‘KP Genius’ parody Twitter account. The above mentioned account, was followed by several members of the team and he explicably stated that private conversations between him, Anderson and Swann were referenced in various tweets. All these allegations by the right-hander came after his messages to the players of the South African team were leaked, which allegedly contained contents of private conversation between him and former England skipper Andrew Strauss. The South African players, however had termed the conversation as part of a mere banter between them and Pietersen. Although Pietersen regained the central contract in January next year following an apology from his side to his team mates, the relationship amongst them, especially with Andrew Strauss ended on a sour note. On top of it, ultimately it was Kevin Pietersen himself, failing to provide any evidence pertaining his allegations regarding the ‘KP Genius’ parody account, who came out as the one causing all the unrest and troubles within the English dressing room.                       The post “It’s hard being me”: When Kevin Pietersen threatened EBC with his Test Cricket retirement over allegations of a dressing room split appeared first on The SportsRush.","pubDate":"2022-01-09 18:31:58","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"New Zealand vs Bangladesh, 2nd Test, Day 2 Live Cricket Score Updates","link":"https://sports.ndtv.com/cricket/new-zealand-vs-bangladesh-2nd-test-day-2-live-cricket-score-updates-2698557","keywords":null,"creator":null,"video_url":null,"description":"New Zealand vs Bangladesh, 2nd Test, Day 2 Live Cricket Score Updates: New Zealand will look to post a massive total when they resume batting on the second day of the 2nd Test against Bangladesh in...","content":null,"pubDate":"2022-01-09 17:50:44","full_description":"New Zealand vs Bangladesh, 2nd Test, Day 2 Live Cricket Score Updates: New Zealand will look to post a massive total when they resume batting on the second day of the 2nd Test against Bangladesh in Christchurch on Monday. Earlier, Tom Latham was closing in on a double century as New Zealand reached 349 for one at stumps to defy Hagley Oval's grim reputation for batters. The New Zealand captain was unbeaten on 186 with Devon Conway on 99 as the Black Caps scored at will on a ground reputed to be a bowler's paradise on day one. New Zealand, desperate for a win to save the series after losing the first Test, have defied the green surface and been in control ever since they lost the toss and were sent into bat. Latham and Conway put on an unbroken 201 for the second wicket after Latham and Will Young, who made 54, produced a 148-run opening stand. ( LIVE SCORECARD ) Bangladesh will probably be rueing the fact that they elected to bowl. They were fooled by the amount of grass on the wicket but there was hardly any assistance from the surface. Also, the bowling wasn’t all that great. They failed to hit the right lines and lengths on regular occasions and due to that, they are well behind in the game. Getting back into this game is going to be a big task. They need wickets and in heaps on Day 2 and it will be interesting to see if they do manage to fight back. Do join us for Day 2 on Monday, 10th January at 3:30 am IST (10 pm GMT, previous day). Till then, you can catch the action of the Ashes as England are fighting hard to salvage a draw. Till then, Cheers! Tom Latham was the highlight but Devon Conway too played a delightful knock. The platform though was set by the opening stand as they added 148. Will Young also looked all set for a big score but he fell. Conway and Latham then batted, batted and batted. The two have built a 200-run stand. Latham is eyeing a double ton whereas Conway is one short of his hundred. Also, the rate New Zealand have scored at is quite incredible and they have enough time now to post a huge total and that is what they’ll be eyeing. A day thoroughly dominated by the Kiwis! Tom Latham wanted to make a statement after their surprise loss in the last game and he has led from the front. A scintillating knock has seen his side on course to bat the visitors out of the game. Full ball, on middle. Latham prods and defends this out. That will be Stumps on Day 1. On middle. Blocked out. Devon Conway has to wait for his century a bit longer. Full and on middle, pushed back to the bowler. Turn for Hasan! This lands on middle and turns away. Latham prods and defends it off the outer half. Around off, this is drilled down to long off for a single. Conway on 99 now. A flighted ball, on off. Conway drives it hard bit straight to covers. Mehidy Hasan to bowl the final over. On middle, on a length. Blocked out. On middle, this is hit to mid-wicket. Length and outside off. Left alone. Short and on middle. Latham sits under it. OVERTHROWS! We have seen so many today by Bangladesh! Angles it on the pads. Latham misses his flick and gets hit on the pads. A quick leg bye as it rolls to square leg. An over throw as the fielder misses his shy at the keeper's end. Two leg byes. The partnership races to 200 now. Length and outside off. Conway taps it late and towards point for a quick single. He moves to 98. FOUR! EDGED AND FOUR! A length ball, outside off. Latham tries to defend it with soft hands but gets an outside edge through gully and towards the third man fence. He moves to 186. Fuller ball, angling on middle, pushed back to the bowler. Length ball, shaping away, outside off. Latham shoulders arms to it. On middle, on a length. Blocked out.","image_url":"https://c.ndtvimg.com/2022-01/laag7nh8_nz-ban-afp_625x300_09_January_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"ICC Announces Match Officials For U19 Men's World Cup","link":"https://sports.ndtv.com/cricket/icc-announces-match-officials-for-u19-mens-world-cup-2698548","keywords":null,"creator":null,"video_url":null,"description":"The International Cricket Council on Sunday announced the umpire and match referee appointments for the ICC U19 Men's Cricket World Cup 2022, which will be staged in the West Indies from January 14 to...","content":null,"pubDate":"2022-01-09 17:40:47","full_description":"The International Cricket Council (ICC) on Sunday announced the umpire and match referee appointments for the ICC U19 Men's Cricket World Cup 2022 , which will be staged in the West Indies from January 14 to February 5. Experienced English umpire David Millns will stand alongside Nepal's Buddhi Pradhan for the opening match of the ICC U19 Men's Cricket World Cup after the officials were confirmed for the West Indies. Millns, who has been a first-class umpire for nearly 14 years, and Pradhan will oversee hosts West Indies against Australia at National Stadium in Guyana on January 14. Millns' compatriot Martin Saggers will be the TV Umpire for the first of 48 games, with a 22-strong team of match officials confirmed by the International Cricket Council. Among those taking charge will be Pakistan's Rashid Riaz who reprises his role from the 2020 tournament and takes charge of England's opening fixture against Bangladesh with Ireland's Roland Black, who also officiated two years ago. Asif Yaqoob will be the TV umpire for the same fixture which sees the defending U19 champions Bangladesh kickstart the defence of their title. Yaqoob is the third umpire who stood in South Africa last time out to again be selected. The Pakistani official is set to be in the middle for the West Indies against Scotland, England against Canada and Bangladesh against the UAE. In all, 19 umpires from 14 different countries will be on the field with five also performing the role of TV umpire throughout the first stage of the tournament. They will be joined by three referees for the duration of the tournament, with former Sri Lanka international Graeme Labrooy officiating alongside home official Denavon Hayles and England's Phil Whitticase. Fixtures will take place across four nations, including Guyana, Antigua and Barbuda, St Kitts and Nevis and Trinidad and Tobago. Ten venues will be used as the Caribbean welcomes the young stars of the future to its shores for the first time in the tournament's 14-edition history. \"The U19 Men's Cricket World Cup is a very important event in our calendar as it brings together the world's most promising young players in a major ICC tournament, giving them the experience of competing on the global stage,\" ICC Senior Manager - Umpires and Referees, Adrian Griffith said in a statement. \"We are committed to appointing the finest officials available and I have every confidence in the team travelling to West Indies for the U19 Cricket World Cup they will do a fine job. I wish them all the best,\" he added. ICC said umpire and match referee appointments for the knockout stages will be announced after the teams have been confirmed. The appointments for the Plate and Super League final will be finalised after the semi-finals. The officials for the tournament are: Promoted Umpires: Asif Yaqoob, Allan Haggo, Arnold Maddela, Buddhi Pradhan, David McLean, David Millns, Emmerson Carington, Heath Kearns, Jacquline Williams, Mark Jameson, Martin Saggers, Nitin Bathi, Rahul Asher, Rashid Riaz, Rizwan Akram, Roland Black, Sameer Bandekar, Sarika Prasad, Vijay Prakash Mallela Match Referees: Graeme Labrooy, Denavon Hayles, Phil Whitticase","image_url":"https://c.ndtvimg.com/2021-12/sujvv93_india-u19_120x90_27_December_21.jpg","source_id":"ndtv"},{"title":"S. Meghana — ready to grab the big opportunity in women’s cricket team","link":"https://www.thehindu.com/sport/cricket/s-meghana-ready-to-grab-the-big-opportunity-in-womens-cricket-team/article38209732.ece","keywords":null,"creator":["V.V. Subrahmanyam"],"video_url":null,"description":"Back in India squad after consistent performances","content":null,"pubDate":"2022-01-09 17:33:33","full_description":null,"image_url":null,"source_id":"thehindu"},{"title":"The last-ditch, non-result, dead-rubber draw: there’s nothing like this | Barney Ronay","link":"https://www.theguardian.com/sport/blog/2022/jan/09/its-good-its-great-its-irresistible-its-the-ashes-and-its-alive-and-kicking","keywords":["Ashes 2021-22","The Ashes","Australia cricket team","England cricket team","Cricket","Sport","Australia sport"],"creator":["Barney Ronay"],"video_url":null,"description":"How to explain the denouement of this supposedly dead-rubber Test? Try this: life moves pretty fast, but the clocks stopped on day five at the SCGOK: blank sheet of thought-scap. How do we root‑and‑branch this? What are the bite‑ables here? What, exactly, do our targeted people units want more of? When the England and Wales Cricket Board’s inevitable Ashes review gets round to the glorious oddity of day five of the fourth Test, it is tempting to wonder exactly how those present will dice and slice the events of Sunday afternoon at the Sydney Cricket Ground.The last-ditch, non-result, dead‑series Test match draw: there is no other substance quite like this in sport. It’s good. It’s great. It’s irresistible. But try to explain it, and it just kind of slips away. Continue reading...","content":null,"pubDate":"2022-01-09 17:22:48","full_description":"O K: blank sheet of thought-scap. How do we root‑and‑branch this? What are the bite‑ables here? What, exactly, do our targeted people units want more of? When the England and Wales Cricket Board’s inevitable Ashes review gets round to the glorious oddity of day five of the fourth Test, it is tempting to wonder exactly how those present will dice and slice the events of Sunday afternoon at the Sydney Cricket Ground. The last-ditch, non-result, dead‑series Test match draw: there is no other substance quite like this in sport. It’s good. It’s great. It’s irresistible. But try to explain it, and it just kind of slips away. Perhaps the heart of the thing was there in Jimmy Anderson’s walk to the crease after five days and 2,292 balls of the Sydney Test, after endless rain and endless rain chat, after men in shorts sprinting wildly to hammer a brown hessian sheet, as though only this, the brown hessian sheet, can preserve humanity from its inevitable late‑civilisation collapse. After all those snaking narratives of players and careers, of falling and rising stars, after the transformation of that strip of grass from green, through brown and grey, to its final note of stately decay. With 10 minutes to play and one wicket to fall this was what we had left. Anderson walked out slowly, fiddling with straps, allowing his pupils to widen and the air to cool just a little. The key numbers at that point were 4, 2, 0, 2, 5, 2, 1, 0, 0, 0, 0, 1, 0, 4, 8, 1, 10, 0, 0, 0, 1, 4, 7, or the scores, with a fair few not outs, from Anderson’s last 23 Test innings (so you’re saying … there’s a 10 in there) from Galle to Sydney. Anderson would be facing Steve Smith, whose previous Test wicket before this innings had been five years ago in Perth. And the first real marvel of Sydney day five was that both teams still had the will to do this. By this stage in an Ashes series everyone here is running on bone marrow and spit. The series is gone. The walking injured are close to forming their own majority party. You can almost feel careers finding their own edges and end points. And yet somehow, as day came to an end in Sydney, none of this mattered. At moments such as these something seems to go wrong with the air, with the light above the stands, the clocks on the wall, all of it subsumed by those five-day tectonic forces. These are the best moments. How many more of them will we get? It seems fair to say the light saved Anderson. Probably Pat Cummins could have forced the game to this point a little quicker. How long would Anderson’s toenails have survived Mitchell Starc with the new-ish, hard-ish ball? How long is a very short piece of string? In the event it was the spirit of the village green, deus ex Paul Reiffel, that decided Nathan Lyon and Smith would bowl the final 12 balls. At which point, like the rest of that final hour, the whole thing dissolved into a series of vivid images. We remember the resistance of Stuart Broad, who came out hopping about and whirling his bat – game, ready, calm, cool, fooling no one – and immediately leapt into a comical defensive stoop as one kept low, bent double like a folding step ladder, that piece of wood tiny in his hands, a man batting with a ruler. With seven overs left Starc returned. Cue the extortionary spectacle of Broad forcing every fibre to say yes to this thing, to obey his orders to leap into line with that fizzing, bone-crushing missile. Broad leapt back and across but still, by some stage magic, ended up cartwheeling towards square leg. He backflipped under a bouncer and got up with his jumper covered in scruff and mud. Without fear there can be no courage. Broad is a very brave man. This is not criticism. It’s applause. We know how this feels. Jack Leach was beautifully serene through most of this, oblivious to the howls, the banshee chuckles of the Australia’s close fielders. Leach wiped his glasses in response. Yes: it’s that. At one point he scored 23 off 17 balls. He whipped away a Cummins yorker with an ankle raised, an absurd piece of muscle memory, then eased Cummins’s final ball gloriously though mid-on Trescothick-style, perfectly balanced, head still. Wait. What? Smith got Leach with a beauty to summon Anderson from the pavilion. His two overs at the death were freakishly good. But Anderson played out the last six balls like a man whose bat was welded to his pad, unable to imagine any other movement but full-body defence. Even the reactions from the players were a perfect read of the day. England’s handshakes and hugs were fond and low-key. The only real congratulations were from Australia’s players, who were winning this match in every single moment right up to that final one, but showed real grace at the end. Nothing changes in the wider picture. A draw in Sydney may provide the tiniest merkin to a disastrous tour. But Australia are still a much better cricket team, even if that gap narrowed as England overcame some of the hurdles placed by their own management. There had been some fears voiced that England’s players might be fatally thrown by the absence of their Covid‑addled coaching staff. Hmm. Are we talking about the same coaching staff? Much can be taken from the heart and the spleen of the players in providing this spectacle. Jonny Bairstow was gloriously defiant in both innings. Ben Stokes showed familiar grit, striking a disco-strut hand-on-hip pose after every forward prop, product of those poor battered ribs. Earlier in the day there was the promise of a brisk, clean, fearless 77 from Zak Crawley, plus the spectacle of those wonderful twin Waqar‑style yorkers summoned up by Cummins to get rid of Mark Wood and Jos Buttler. And in the end this was probably the takeaway, the voice speaking quietly under all this action: a comfortable, leathery voice, the voice of Test cricket as narrated by a particularly wise and benevolent John Hurt. A voice telling you that if you build it they will come, that this thing is good, that while it may be difficult and hard to package, the time to start worrying is when your product doesn’t have this brilliance to sell. England will now decamp to Hobart. The wounded will be packed off home. Sam Billings may or may not have finished his story tape collection during the Covid-bubble road trip to a likely Test debut (cut to the voice of John Hurt – “if you build it they will come” – as Bilbo, in shades, checks his mirrors). And right now the final dead Test of this done‑and-dusted series feels strangely alive.","image_url":"https://i.guim.co.uk/img/media/52b6aeca5290d75c9dbb5be9007c071067a79ec4/0_138_2588_1553/master/2588.jpg?width=460&quality=85&auto=format&fit=max&s=4092c1bd5c34b2c978eee6ac951f3939","source_id":"theguardian"},{"title":"Cummins wants way around rain delays","link":"https://thewest.com.au/sport/cricket/cummins-wants-way-around-rain-delays-c-5243875","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Pat Cummins has encouraged cricket authorities to search for ways to get more cricket around rain delays.","content":null,"pubDate":"2022-01-09 16:35:02","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5243875/731c1bb525364a93eece023acd9027a430f7c50b-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"Cummins wants way around rain delays","link":"https://www.perthnow.com.au/sport/cricket/cummins-wants-way-around-rain-delays-c-5243870","keywords":null,"creator":["Scott Bailey"],"video_url":null,"description":"Pat Cummins has encouraged cricket authorities to search for ways to get more cricket around rain delays.","content":null,"pubDate":"2022-01-09 16:35:00","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5243870/731c1bb525364a93eece023acd9027a430f7c50b-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"Most runs without a century in Tests: Shane Warne tops the chart of an infamous record","link":"https://thesportsrush.com/cricket-news-most-runs-without-a-century-in-tests-shane-warne-tops-the-chart-of-an-infamous-record/","keywords":["Cricket","Miscellaneous","Shane Warne"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Most runs without a century in Tests: Shane Warne heads the list of an infamous record till date despite retiring in the year 2007. Apart from the mouth-watering battle which involves the primary usage of the bat, ball, and some verbal exchanges in the form of sledges between the players, the other aspect which draws… The post Most runs without a century in Tests: Shane Warne tops the chart of an infamous record appeared first on The SportsRush.","content":"Most runs without a century in Tests: Shane Warne heads the list of an infamous record till date despite retiring in the year 2007. Apart from the mouth-watering battle which involves the primary usage of the bat, ball, and some verbal exchanges in the form of sledges between the players, the other aspect which draws the fans’ attention towards any sport in the world is the numbers and statistics. The numbers, in most cases are indicative a player’s reputation or the lack of it, in a particular aspect of his/her game. On the flip side, there are also some stats which has nothing to do in terms of measurement of a player’s value in his team, his strengths, or his weakness. They exist simply because they do! One such innocuous stat involves the legendary Aussie leg-spinner Shane Warne. It is in fact as record which is yet to broken by any International player, even after 14 years of his retirement which he took back in 2007. Just watched this brilliant ⁦@primevideosport⁩ film about cricket’s bowling ⁦@ShaneWarne⁩ – what a player, what a character! Loved it. pic.twitter.com/wTFdF2qQbA — Piers Morgan (@piersmorgan) January 9, 2022 Most runs without a century in Tests: Shane Warne tops the chart The second-highest wicket-taker in Test format (708 wickets) has an infamous record with the bat as well. While it is yet to the ascertained whether the 52-year-old is proud of this record as well, the fact is that Shane Warne is the undisputed record-holder so far for having scored the most runs in the Test format without a century to boast of. Having featured in 145 Tests for Australia, Warne has batted in a total of 199 innings without scoring a century. The former leg-spinner has scored a total of 3154 runs at an average of 17.32 in his career with the help of 12 half-centuries, with a top-score of 99 against New Zealand at Perth in 2001. Right behind him is Sri Lanka’s Niroshan Dickwella with 2443 runs across 45 Tests (80 innings) at an average of 32.57. He is the only active player in the Top 5 of this infamous list, falling short of 702 runs as the numbers stand currently. The other players completing the Top-5 are India’s Chetan Chauhan, followed by West Indies’ Deryck Murray and Malcolm Marshall. Player Span Mat Inns NO Runs HS Ave Shane Warne (AUS) 1992-2007 145 199 17 3154 99 17.32 Niroshan Dickwella (SL) 2014-2021 45 80 5 2443 96 32.57 Chetan Chauhan (INDIA) 1969-1981 40 68 2 2084 97 31.57 DL Murray (WI) 1963-1980 62 96 9 1993 91 22.9 MD Marshall (WI) 1978-1991 81 107 11 1810 92 18.85 VD Philander (SA) 2011-2020 64 94 20 1779 74 24.04 MA Starc (AUS) 2011-2022 65 96 22 1747 99 23.6 TG Southee (NZ) 2008-2022 83* 117 11 1743 77* 16.44 JE Emburey (ENG) 1978-1995 64 96 20 1713 75 22.53 HMRKB Herath (SL) 1999-2018 93 144 28 1699 80* 14.64   The post Most runs without a century in Tests: Shane Warne tops the chart of an infamous record appeared first on The SportsRush.","pubDate":"2022-01-09 16:01:02","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"ICC U-19 Men's World Cup 2022: Group D Preview","link":"https://sports.ndtv.com/cricket/icc-u-19-mens-world-cup-2022-preview-of-group-d-featuring-australia-scotland-sri-lanka-and-west-indies-2698378","keywords":null,"creator":null,"video_url":null,"description":"Ahead of the 2022 ICC Under-19 Men's Cricket World Cup that begins on January 14, here is a preview of Group D.","content":null,"pubDate":"2022-01-09 15:47:32","full_description":"The 2022 ICC Under-19 Men's Cricket World Cup is set to begin on January 14 this year, with the West Indies hosting the tournament for the first time. As many as 16 teams will be in fray in the competition and record four-time champions India will be among the favourites for the title. The ICC U-19 Men's World Cup began in 1988 and has witnessed some remarkable moments, serving as the premier platform for promising youngsters to make their mark and get a taste of international action before stepping into senior cricket. Ahead of the tournament, here is a preview of Group D: A quick glance at the make-up of Group D of ICC Under 19 Men's Cricket World Cup shows just how challenging it will be to make it out of the first round. Hosts West Indies won the tournament back in 2016, Australia are three-time champions and Sri Lanka also have a final appearance to their name. Scotland round out the group in their ninth appearance in the competition, qualifying after New Zealand were forced to withdraw due to Covid-19 restrictions. Australia (13th appearance) Only India have won the ICC U19 Men's CWC more times than Australia's three titles, with Australia also second in terms of matches won and win percentage. In fact in 12 previous appearances, Australia have made it through to at least the semi-finals on eight occasions, they are remarkably consistent. The last win came back in 2010, a team featuring Mitchell Marsh, Adam Zampa and Josh Hazlewood, who 11 years later would play key roles as Australia claimed the ICC Men's T20 World Cup 2021. This time around, all-rounder Cooper Connolly will lead the side, and he will have fond memories of taking on the host nation. In 2020 he hammered 64 off 53 balls against the West Indies in a play-off match that was eventually abandoned due to rain. He is the only player who returns from the 2020 squad, but will not lack for support, notably from ambidextrous spinner Nivethan Radhakrishnan. Scotland (9th appearance) Scotland initially missed out on qualification after losing to Ireland in the final of the Qualifier, but were handed a reprieve when New Zealand withdrew from the competition. The Scots are yet to make it past the first round, and face a battle to do so for the first time in 2022 with the strength of the group. Gordon Drummond is the coach of the side, which will be captained by 18-year-old left-arm spinner Charlie Peet. The Scots will not lack for experience, with Peet one of five players who were also part of the squad two years ago. Sri Lanka (14th appearance) Sri Lanka will be looking for an improved showing after going out in the first round in each of the last two editions of the ICC Men's U19 CWC. Semi-finalists in 2016 with a squad featuring Avishka Fernando, Charith Asalanka and Wanindu Hasaranga, they have twice finished third in their group since. The aim will be to avoid a third straight failure to make the quarter-finals, but the group in which they find themselves will not be easy. Matheesha Pathirana is back in the squad after playing in 2020 when Sri Lanka finished 10th overall. Dunith Wellalage will captain the side having previously withdrawn from a Sri Lanka U19 squad to focus on his studies. West Indies (14th appearance) An ever-present at this tournament, hosts West Indies will be looking to follow in the footsteps of the 2016 side that went all the way and won the title. To do so, they will have to overcome the odds. Not since Australia in the very first tournament back in 1998 has a host nation won the tournament, although Sri Lanka and Australia have both made it to the final on home soil. The 2016 crop that won the title were captained by Shimron Hetmyer, with another future international, Alzarri Joseph, leading the bowling attack. If recent matches against South Africa are anything to go by, the bowling may be the West Indies' strength once again with quick bowler Johann Layne one to watch out for. Promoted Middle order batter Ackeem Auguste captains the side which kicks off against Australia in Guyana before heading to St Kitts and Nevis for the remaining two group games. (With ICC inputs)","image_url":"https://c.ndtvimg.com/2022-01/koeomdv8_australia-u19-afp_625x300_09_January_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"ICC U-19 Men's World Cup 2022: Group C Preview","link":"https://sports.ndtv.com/cricket/icc-u-19-mens-world-cup-2022-preview-of-group-c-featuring-afghanistan-pakistan-papua-new-guinea-and-zimbabwe-2698364","keywords":null,"creator":null,"video_url":null,"description":"Ahead of the 2022 ICC Under-19 Men's Cricket World Cup that begins on January 14, here is a preview of Group C.","content":null,"pubDate":"2022-01-09 15:41:25","full_description":"The 2022 ICC Under-19 Men's Cricket World Cup is set to begin on January 14 this year, with the West Indies hosting the tournament for the first time. As many as 16 teams will be in fray in the competition and record four-time champions India will be among the favourites for the title. The ICC U-19 Men's World Cup began in 1988 and has witnessed some remarkable moments, serving as the premier platform for promising youngsters to make their mark and get a taste of international action before stepping into senior cricket. Ahead of the tournament, here is a preview of Group C: Group C of the ICC Under 19 Men's Cricket World Cup pits a two-time champion against one of the rising forces in the game, with a couple of potential dark horses looking to spring a surprise. Pakistan are the only team to have defended the title, doing so back in 2006 after a first crown two years earlier, and will be looking to make it to the final for the sixth time in the West Indies. Their biggest rivals in the group could be Afghanistan, whose best result came four years ago when they reached the semi-finals. Joining the sub-continental duo are Zimbabwe, who have made it out of the first round on three occasions, and Papua New Guinea, back in the competition after failing to qualify in 2020. Afghanistan (7th appearance) Afghanistan's rise in the senior game has been mirrored at Under 19 level, with the side having reached the quarter-finals in three of the last four editions of the ICC U19 Men's CWC. Since first qualifying in 2010, Afghanistan have made it to every tournament since, with the highlight coming in 2018 when a team featuring the likes of Rahmanullah Gurbaz and Mujeeb Ur Rahman helped them reach the semi-finals before losing to Australia. This time around, it will be up to spinner Noor Ahmad to provide the experience, as the only survivor from the 2020 squad. The 17-year-old has been involved in both the Big Bash and the PSL and should provide plenty of support to skipper Suliman Safi. Pakistan (14th appearance) Only India have reached the ICC U19 Men's CWC final more often than Pakistan, who have done so on five occasions in total. The glory years came back in 2004 and 2006, with back-to-back titles in squads featuring the likes of future skipper Sarfraz Ahmed, as well as Wahab Riaz and Imad Wasim. More recently, Shaheen Shah Afridi first caught the eye in the ICC U19 Men's CWC, so the conveyor belt of talent has shown no signs of slowing down. In the West Indies, all-rounder Qasim Akram will captain the side that is coached by Pakistan legend Ijaz Ahmed. Qasim will be joined by top-order batter Muhammad Shehzad who is also back for his second appearances in the tournament. Papua New Guinea (9th appearance) After Papua New Guinea's senior men's team competed at the 2021 ICC Men's T20 World Cup, the Under 19 team will make their ninth appearance in the ICC U19 Men's CWC in the West Indies. PNG are yet to make it out of the first round of the tournament but of their three previous victories, two have come against Group C opponents. In 2010, PNG got the better of Afghanistan while two years later they got the better of Zimbabwe. All-rounder Barnabas Maha will lead the side in the West Indies, having also captained the side during qualification for the 2020 ICC U19 Men's CWC. Zimbabwe (13th appearance) Zimbabwe have been remarkably consistent in recent editions, finishing either 10th or 11th in each of the last four ICC U19 Men's CWCs. The best of those campaigns came in 2016 when a team featuring then 15-year-old Wesley Madhevere lost by just two runs to eventual champions West Indies to miss out on qualification for the quarter-finals before going on to beat South Africa by eight wickets in the play-offs. A record of three wins and three losses in each of those tournaments shows that Zimbabwe should not be taken lightly by any opponent, and they will be keen to spring a surprise of the sub-continental pair who are favourites to get out of the group. Emmanuel Bawa, who scored a century against Canada at the 2020 edition, captains the side this year and is the only remaining member of that squad. Promoted He will be supported by vice-captain Brian Bennett in a side that is coached by former Zimbabwe captain Prosper Utseya. (With ICC inputs)","image_url":"https://c.ndtvimg.com/2022-01/gc7aqd1o_pakistan-u19-afp_625x300_09_January_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"ICC U-19 Men's World Cup 2022: Group B Preview","link":"https://sports.ndtv.com/cricket/icc-u-19-mens-world-cup-2022-preview-of-group-b-featuring-india-ireland-south-africa-and-uganda-2698337","keywords":null,"creator":null,"video_url":null,"description":"Ahead of the 2022 ICC Under-19 Men's Cricket World Cup that begins on January 14, here is a preview of Group B.","content":null,"pubDate":"2022-01-09 15:27:57","full_description":"The 2022 ICC Under-19 Men's Cricket World Cup is set to begin on January 14 this year, with the West Indies hosting the tournament for the first time. As many as 16 teams will be in fray in the competition and record four-time champions India will be among the favourites for the title. The ICC U-19 Men's World Cup began in 1988 and has witnessed some remarkable moments, serving as the premier platform for promising youngsters to make their mark and get a taste of international action before stepping into senior cricket. Ahead of the tournament, here is a preview of Group B: No country has won more ICC Under 19 Men's Cricket World Cups than India and their quest for a fifth title will begin in Group B. Beaten finalists two years ago, India are looking to go one better this time around and replicate the achievements of the class of 2018, who swept all before them in New Zealand led by current internationals Prithvi Shaw and Shubman Gill. Coming up against them in the group stage are 2014 champions South Africa, competition regulars Ireland and a Uganda side making their first appearance at this tournament for 16 years. Group B begins in Guyana before moving to Trinidad & Tobago, where one match will take place at Queen's Park Oval and three at the Brian Lara Cricket Academy. India (14th appearance) India have only once failed to make it past the group stage at an ICC Under 19 Men's Cricket World Cup - at the opening edition in 1988 - and enter among the favourites to go all the way. Lifting the 2021 Asia Cup served as perfect preparation, with spinners Vicky Ostwal and Kaushal Tambe shining as India defeated Sri Lanka by nine wickets in the final on New Year's Eve. The spin twins therefore head to the Caribbean full of confidence, as do the Asia Cup's leading run scorers Harnoor Singh and Shaik Rasheed, and India's strength with bat and ball will again make them formidable opponents. Yash Dhull captains the side and will hope to join an illustrious list of names - including Mohammad Kaif, Virat Kohli and Shaw - to have led India to victory in this competition. Ireland (9th appearance) Ireland qualified for their ninth ICC Under 19 Men's Cricket World Cup in style, skittling Scotland for 66 in a one-sided final of the Europe qualifier last September. Matthew Humphreys was the star in La Manga, taking 5-25, and the slow left-arm spinner from Lisburn will be eager to take that form into the big occasion. Ireland warmed up by taking on Zimbabwe in Barbados over the New Year and though they went down 3-1 in the series, a 117-run win in the final match showed what the side captained by Tim Tector are capable of on their day. Tenth place in 2010 is Ireland's best performance in their eight outings to date but they won three of their six matches last time they qualified in 2018, including a memorable four-run victory over Afghanistan. South Africa (13th appearance) South Africa's chances of success on home soil were ended at the quarter-final stage by eventual winners Bangladesh two years ago but a talented squad will hope to challenge for honours in the Caribbean. All-rounder Dewald Brevis impressed for the Proteas youngsters in the CSA Provincial T20 Knockout competition in October - his batting style drawing comparisons with AB de Villiers - while his leg-spin caused West Indies plenty of problems in a recent warm-up series against the home nation. Left-arm spinner Asakhe Tsaka and captain George van Heerden will also hope to make names for themselves in the coming weeks as South Africa look for a second ICC Under 19 Men's Cricket World Cup trophy. Aiden Markram and Kagiso Rabada were the stars of a memorable triumph eight years ago and the current crop will be confident of following in their footsteps. Uganda (3rd appearance) Having narrowly missed out on appearing in 2016 and 2018, Uganda came out on the right side of a nail-biting qualification group to book a place at their third ICC Under 19 Men's Cricket World Cup. Uganda needed a big net run rate swing in their favour going into the final matches in the Africa qualifier and they duly achieved it, dismissing Tanzania for 51 and losing just two wickets in reply to advance at Namibia's expense. In Cyrus Kakuru and Joseph Baguma, Uganda possessed the leading run scorer and joint leading wicket taker of the Africa qualifier while captain Pascal Murungi claimed 4-9 in the decisive win over Tanzania. Promoted The Baby Cricket Cranes have won one match on each of their previous outings at this competition, in 2004 and 2006, and will be eager to show what they can do on their return to the global stage. (With ICC inputs)","image_url":"https://c.ndtvimg.com/2021-12/pbfk0tqo_india-u19-twitter_625x300_30_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"ICC U-19 Men's World Cup 2022: Group A Preview","link":"https://sports.ndtv.com/cricket/icc-u-19-mens-world-cup-2022-preview-of-group-a-featuring-bangladesh-canada-england-and-united-arab-emirates-2698317","keywords":null,"creator":null,"video_url":null,"description":"Ahead of the 2022 ICC Under-19 Men's Cricket World Cup that begins on January 14, here is a preview of Group A.","content":null,"pubDate":"2022-01-09 15:16:53","full_description":"The 2022 ICC Under-19 Men's Cricket World Cup is set to begin on January 14 this year, with the West Indies hosting the tournament for the first time. As many as 16 teams will be in fray in the competition and record four-time champions India will be among the favourites for the title. The ICC U-19 Men's World Cup began in 1988 and has witnessed some remarkable moments, serving as the premier platform for promising youngsters to make their mark and get a taste of international action before stepping into senior cricket. Ahead of the tournament, here is a preview of Group A: Bangladesh sprung a surprise two years ago in South Africa as a team featuring the likes of Mahmudul Hasan Joy and Shoriful Islam - both part of the side that claimed an historic Test victory for the senior team in New Zealand this month - won the title. They face ever-presents England, looking to secure a second title after the one they won back in 1998, as well as Canada and the United Arab Emirates. All the games will take place in St Kitts and Nevis, which previously hosted games at the 2007 ICC Men's Cricket World Cup. Bangladesh (13th appearance) Over the last eight editions of the ICC U19 Men's CWC, Bangladesh have come through the first round on six occasions, culminating in the memorable overall victory two years ago in South Africa. On that occasion, they beat India in the final, the team who have caused them the most problems at Under-19 level. Prior to 2020, their previous best performance came in 2016 when a team captained by Mehidy Hasan Miraz finished third overall on home soil. Captaining the side this time around is Rakibul Hasan, part of the winning team in South Africa and the left-arm spinner will be key to the team building on a strong recent record. Canada (8th appearance) Canada head to the West Indies to take part in a fifth successive ICC U19 Men's CWC, and an eighth overall. The North Americans will be hoping to improve on a best previous result of 11th place, which came in 2010. They have never made it past the first round and into the quarter-finals, and will be up against it here with the defending champions Bangladesh and England in the group. Skipper Mihir Patel was part of the team in South Africa, including scoring 90 against fellow Group A outfit UAE in a first-round defeat that was later avenged in the play-offs. England (14th appearance) It has now been 24 years since England's sole ICC U19 Men's CWC victory, but the team did reach the semi-finals on the way to third place back in 2014. Last time out, England failed to get through the first round, edged out in a group also featuring Australia and the West Indies before going on to finish ninth with three wins in the play-offs. This year, Hampshire batter and skipper Tom Prest will be hopeful of a stronger showing for a completely new-look side coached by Richard Dawson. The team also features Barbados-born spinner Jacob Bethell, who will hope to impress on his return to the Caribbean, as well as fellow spinner Archie Lenham, who featured regularly for Sussex across all three formats in 2021 at the age of just 17. United Arab Emirates (3rd appearance) The United Arab Emirates have qualified for the ICC U19 Men's CWC for the second edition running, and third overall having hosted the event in 2014. Last time around, the UAE got the better of Canada in the first round, but then fell to the same opponent in the 13th-place play-off, so they will be a familiar rival. Full international Alishan Sharafu, a batting all-rounder, will captain the side, having been part of the squad two years ago. He has since gone on to represent the UAE at T20I and ODI level and will bring plenty of experience to the side as one of two returning players, along with 17-year-old wicket-keeper and opener Kai Smith, who was just 15 when he played in this event in South Africa. Group A fixtures 15 January - Canada v UAE, Conaree Cricket Center, St Kitts and Nevis 16 January - Bangladesh v England, Warner Park Cricket Stadium, St Kitts and Nevis 18 January - England v Canada, Warner Park Cricket Stadium, St Kitts and Nevis 20 January - England v UAE, Warner Park Cricket Stadium, St Kitts and Nevis; Bangladesh v Canada, Conaree Cricket Center, St Kitts and Nevis Promoted 22 January - Bangladesh v UAE, Warner Park Cricket Stadium, St Kitts and Nevis (With ICC inputs)","image_url":"https://c.ndtvimg.com/2022-01/evg62t8g_bangladesh-u19-afp_625x300_09_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"“It’s not a masterstroke, just a show off”: Ravindra Jadeja hits back at KKR twitter post comparing Australia’s field placement during Sydney Ashes Test to KKR’s against MS Dhoni during 2016 IPL match","link":"https://thesportsrush.com/cricket-news-its-not-a-masterstroke-just-a-show-off-ravindra-jadeja-hits-back-at-kkr-twitter-post-comparing-australias-field-placement-during-sydney-ashes-test-to-kkrs-against-ms-dhoni-during-2016-ipl/","keywords":["Cricket","Ashes","Gautam Gambhir","IPL","MS Dhoni","Ravindra Jadeja"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ravindra Jadeja hits back at KKR after latter’s twitter post compared Australia’s field placement to theirs against MS Dhoni during IPL 2016. England had their best result of the ongoing Ashes Test series on Sunday, in what turned out to be a classic advertisement for Test Cricket at the Sydney Cricket Ground. While a win… The post “It’s not a masterstroke, just a show off”: Ravindra Jadeja hits back at KKR twitter post comparing Australia’s field placement during Sydney Ashes Test to KKR’s against MS Dhoni during 2016 IPL match appeared first on The SportsRush.","content":"Ravindra Jadeja hits back at KKR after latter’s twitter post compared Australia’s field placement to theirs against MS Dhoni during IPL 2016. England had their best result of the ongoing Ashes Test series on Sunday, in what turned out to be a classic advertisement for Test Cricket at the Sydney Cricket Ground. While a win was never on the cards, England battled it hard on Day 5 of the 4th Ashes Test to manage a Draw, and thereby preventing a whitewash against an Aussie bowling attack which was breathing fire, especially during the final session of the Test match. Joe Root’s men huffed and puffed to 270/9 (chasing 388), with James Anderson and Stuart Broad left staring in the end at the face of yet another defeat against the Aussies at their home. Australian skipper Pat Cummins placed as many as 8 fielders around the English batters at the strike to apply the highest possible pressure during the final stages of the match. Ravindra Jadeja hits back at KKR twitter post Taking note of Australia’s aforementioned field placement, the Kolkata Knight Riders’s twitter handle jogged down the memory lane to compare the former with Gautam Gambhir’s field set-up against MS Dhoni during a 2016 IPL match. MS Dhoni was leading the IPL team Rising Pune Supergiants (RPSG) franchise during that season of the league while Gambhir captained the KKR side. The moment MS Dhoni arrived at the crease, Gambhir had placed four fielders around the former given Dhoni’s tendency to play himself in during the initial few deliveries of his innings. KKR’s twitter admin juxtaposed the two images to remind their fans of a Test match-like field placement which turned out to be a ‘T20 masterstroke’ back in 2016. Unamused by the post, Indian all-rounder Ravindra Jadeja jumped in to comment- “Its not a master stroke! Just a show off”, perhaps trying to imply that Gambhir’s move back was only to insult to insult the decorated former India captain. Its not a master stroke!Just a show off — Ravindrasinh jadeja (@imjadeja) January 9, 2022   RPS vs KKR 2017 match- When Gautam Gambhir takes on MS Dhoni hands on It was during Match no.45 of the IPL between KKR and RPS (Rising Pune Supergiants) of the 2016 season that Gambhir had placed four fielders around Dhoni’s bat upon his arrival- First slip, Short Gully, Silly Point, and a Forward Short Leg. The move had become a talking point with fans amazed by a Test-like field placement against one of the most reputed hard-hitter of the Cricket ball till date. The move, as anticipated by Gambhir, did pay off with Dhoni managing to score mere 8* runs off 22 deliveries at a strike rate of 36.36. KKR managed to win that fixture by 8 wickets (D/L method) after being asked to chase a revised target of 66 in 9 Overs, after RPS posted 103/6 in 17.4 Overs. Ironically Gambhir was also dismissed for a Golden Duck off Ravichandran Ashwin during the chase.   The post “It’s not a masterstroke, just a show off”: Ravindra Jadeja hits back at KKR twitter post comparing Australia’s field placement during Sydney Ashes Test to KKR’s against MS Dhoni during 2016 IPL match appeared first on The SportsRush.","pubDate":"2022-01-09 14:39:54","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Who will win today Big Bash match: Who is expected to win Hobart Hurricanes vs Sydney Thunder BBL 11 match?","link":"https://thesportsrush.com/cricket-news-who-will-win-today-big-bash-match-who-is-expected-to-win-melbourne-renegades-vs-sydney-thunder-bbl-11-match-2/","keywords":["Cricket","BBL 11","Big Bash Match Prediction","Hurricanes vs Thunder"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Hobart Hurricanes vs Sydney Thunder: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Hobart Hurricanes will lock horns against Sydney Thunder in the league game of the ongoing BBL11. The match will be played at the Melbourne Cricket Ground in Melbourne. Hobart Hurricanes have won five of their ten… The post Who will win today Big Bash match: Who is expected to win Hobart Hurricanes vs Sydney Thunder BBL 11 match? appeared first on The SportsRush.","content":"Hobart Hurricanes vs Sydney Thunder: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Hobart Hurricanes will lock horns against Sydney Thunder in the league game of the ongoing BBL11. The match will be played at the Melbourne Cricket Ground in Melbourne. Hobart Hurricanes have won five of their ten games, whereas the Thunder have won seven of their ten. The game will be live on Sony Six from 8:40 AM IST on 10 January 2022. Who will win today Big Bash match: Hobart Hurricanes vs Sydney Thunder Pitch Report The pitch at the MCG has always been good for batting, but the boundaries are very big on this ground. This pitch has an even bounce and the batters can play their shots. The average 1st innings score in T20s at this ground is 159 runs Hobart Hurricanes preview The Hurricanes have won five of their ten games, and they would want to start winning. Ben McDermott has scored two centuries in the tournament so far, whereas D’arcy Short, Caleb Jewell, and Peter Handscomb need to support him. Thomas Rogers is the leading wicket-taker of the side with 15 wickets, whereas Riley Meredith and Sandeep Lamichhane have ten wickets each. Harry Brook and Jordan Thompson will be back for this game, whereas Matthew Wade is still unavailable. Probable XI: Ben McDermott, Caleb Jewell, Peter Handscomb, D’arcy Short, Harry Brook, Tim David, Jordan Thompson, Mitchell Owen, Tom Rogers, Sandeep Lamichhane, Riley Meredith. All 8⃣ of Samsy’s sixes last night! #BBL11 #ThunderNation pic.twitter.com/d18wvvwy5I — Sydney Thunder (@ThunderBBL) January 9, 2022 Sydney Thunder preview Sydney Thunder have won seven of their ten games in the tournament, and they defeated Melbourne Renegades in the last game. Jason Sangha and Matthew Gilkes have been batting well, whereas Alex Hales also came in form in the last game. Daniel Sams is the highest wicket-taker of the side, whereas he is an incredible batter too. Tanveer Sangha will take care of spin, whereas Mohammad Hasnain, Gurinder Sandhu, and Nathan McAndrew will take care of pace. Probable XI: Alex Hales, Matthew Gilkes, Jason Sangha, Daniel Sams, Oliver Davies, Ben Cutting, Baxter Holt, Tanveer Sangha, Mohammad Hasnain, Nathan McAndrew, Gurinder Sandhu. Match Prediction Sydney Thunder will be the favourites to win this game. The post Who will win today Big Bash match: Who is expected to win Hobart Hurricanes vs Sydney Thunder BBL 11 match? appeared first on The SportsRush.","pubDate":"2022-01-09 14:30:12","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Magic of the final-over finish in Sydney is why we love Test cricket | Geoff Lemon","link":"https://www.theguardian.com/sport/blog/2022/jan/09/magic-of-the-final-over-finish-in-sydney-is-why-we-love-test-cricket","keywords":["Ashes 2021-22","Australia cricket team","England cricket team","The Ashes","Cricket","Australia sport","Sport"],"creator":["Geoff Lemon at the Sydney Cricket Ground"],"video_url":null,"description":"The format can feel like an unreasonable drain on time but that makes thrilling moments like the finale at the SGC even sweeterThis was the payoff. There can be times watching Test cricket when you wonder about the sense of investing the equivalent of a full‑time working week into a single sporting match. There can be times when a non‑contest is over in half that time and you still wonder if it was worth the expense. But then there are these times, the 15th session, the final hour of a fifth day, when the result is still on the line. The less good makes the great greater.This, too, is the glory of the draw, when one team can be miles away from the chance of a win but can still stop the other from achieving one. In the frantic final moments at Sydney, as fielders clustered around the bat as closely as the dark clouds overhead, with Australia’s spinners having to bowl in light too bad for the quicks, England’s final pair of bowlers had to do the job with the bat while Australia’s best batter did the job with the ball. It produced a thrill that transcended the series. Continue reading...","content":null,"pubDate":"2022-01-09 14:00:05","full_description":"T his was the payoff. There can be times watching Test cricket when you wonder about the sense of investing the equivalent of a full‑time working week into a single sporting match. There can be times when a non‑contest is over in half that time and you still wonder if it was worth the expense. But then there are these times, the 15th session, the final hour of a fifth day, when the result is still on the line. The less good makes the great greater. This, too, is the glory of the draw, when one team can be miles away from the chance of a win but can still stop the other from achieving one. In the frantic final moments at Sydney, as fielders clustered around the bat as closely as the dark clouds overhead, with Australia’s spinners having to bowl in light too bad for the quicks, England’s final pair of bowlers had to do the job with the bat while Australia’s best batter did the job with the ball. It produced a thrill that transcended the series. It would not have felt so great for the Australians afterwards, no matter the smiles and handshakes they shared with England after a noticeably good-tempered contest. For two years running, Australia has had a visiting team on the rack at the SCG, only to let them hold out for a draw. Last year it was an injured Hanuma Vihari and an injured Ravichandran Ashwin batting through the final session . This year it was an injured Ben Stokes and an injured Jonny Bairstow doing most of the work through the middle, only to fall and create an even more dramatic finish. This was the first blemish for Pat Cummins as captain, after everything had gone Australia’s way during the first three Tests of these Ashes. His declaration left England 11 overs to survive late on the fourth day before a supposed 98 on the fifth. At that point Australia’s lead of 388 runs seemed vastly surplus to requirements, and so it turned out to be. Usman Khawaja’s second‑innings century was a wonderful moment, and it would have been sad to have denied it. But even if Cummins had declared as soon as that landmark was raised, he would have saved two more precious overs. Instead he batted on after a drinks break. The reasoning may have been to let Cameron Green, then on 67, have a dash at a century of his own, which would be understandable as an investment in a young player to get him going in his Test batting career. But in the same way that there are only two kinds of leaves – good or bad – there are only two kinds of declarations. Rain was always forecast for the final day and in the end it shaved off seven more overs that could have been decisive. Another backfire was sending the wicketkeeper Alex Carey out to bat in that final over before the declaration. During a poor run with the bat in his first series, Carey was on a hiding to nothing. There was no value to him slogging another 10 or 20 runs, and in the end he was out first ball instead. Carey ended up having a poor match with the gloves, missing catches and most crucially fumbling a fourth-innings run-out. Bairstow would have been gone from the fifth ball he faced. Instead he batted out another 100 balls and got into the last hour, taking his lower order teammates just close enough to survival. Then there was a late bowling choice. Scott Boland had been devastating again, knocking over Haseeb Hameed, Joe Root and finally Bairstow. He was making balls leap from the surface and deck both ways off the seam. Cummins had produced a savage burst that took care of Jos Buttler and Mark Wood in three balls. Those two working together in the final overs presented the greatest threat. Instead, with six overs to go Cummins paired with the spinner Nathan Lyon, whom England handled comfortably. Three overs later the umpires made their ruling about the light. By then Boland could have got two more overs in, and Lyon could have bowled two of the last three. In the end, bringing on Steve Smith nearly worked, as he took his first wicket in five years to dismiss Jack Leach. But he couldn’t budge Anderson in the final over. These points may seem finicky, but in a series where everything has gone perfectly, the standards are higher. Australia’s main quicks had patches of tiredness, with Mitchell Starc and Cummins both slower on average in this innings than at any time in the series. The chance of a whitewash slipped – they are rare for a reason – and at least for a few days, England can hope to use this foothold to push back further in the fifth Test. The magic of a final-over finish is powerful, after all.","image_url":"https://i.guim.co.uk/img/media/26b988302ab1be1a96a3acfdff309fd8e7865b7a/3_0_4093_2457/master/4093.jpg?width=460&quality=85&auto=format&fit=max&s=9908114d8cb295508b1c2b268c27c385","source_id":"theguardian"},{"title":"Watch: Joe Root's Poor Form Against Scott Boland Continues, Loses His Wicket Again - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiugFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS90aGUtYXNoZXMtMjAyMS0yMi9hdXN0cmFsaWEtdnMtZW5nbGFuZC00dGgtYXNoZXMtdGVzdC10aHJlZS10aW1lcy1pbi1hLXJvdy1qb2Utcm9vdHMtcG9vci1mb3JtLWFnYWluc3Qtc2NvdHQtYm9sYW5kLWNvbnRpbnVlcy1sb3Nlcy1oaXMtd2lja2V0LWFnYWluLXdhdGNoLTI2OTgxNTfSAcABaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vdGhlLWFzaGVzLTIwMjEtMjIvYXVzdHJhbGlhLXZzLWVuZ2xhbmQtNHRoLWFzaGVzLXRlc3QtdGhyZWUtdGltZXMtaW4tYS1yb3ctam9lLXJvb3RzLXBvb3ItZm9ybS1hZ2FpbnN0LXNjb3R0LWJvbGFuZC1jb250aW51ZXMtbG9zZXMtaGlzLXdpY2tldC1hZ2Fpbi13YXRjaC0yNjk4MTU3L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Watch: Joe Root's Poor Form Against Scott Boland Continues, Loses His Wicket Again  NDTVSports.comICC World Test Championship 2021-23 Points Table After Australia vs England 4th Test  Cricket Addictor'Who are we to question Sachin?': Vaughan takes cheeky dig at Tendulkar for 'hitting-the-stumps law' tweet  Hindustan TimesFourth Ashes Test, day five snapshot  Armidale ExpressEngland Dig In To Salvage Heart-Pumping Draw In 4th Ashes Test  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-01-09 13:41:32","image_url":null,"source_id":"google"},{"title":"AU-U19 vs SA-U19 Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for ICC U19 World Cup 2021-22, Warm-Up Match","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/au-u19-vs-sa-u19-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-icc-u19-world-cup-2021-22-warm-up-match?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Anjishnu Roy"],"video_url":null,"description":null,"content":null,"pubDate":"2022-01-09 13:30:35","full_description":"Australia U19 will take on South Africa U19 in the warm-up match of the ICC U19 World Cup 2021-22 at the Everest Cricket Club Ground in Georgetown on Sunday. This will be the fourth warm-up match of the ICC U19 World Cup 2021-22. Australia U19 have been drawn in Group D along with West Indies, Sri Lanka and Scotland. They haven’t played competitive cricket in recent times and will look to capitalize on the warm-up games. Australia have won the U19 World Cup thrice before and their last win arrived under the captaincy of Mitchell Marsh in 2010. South Africa, meanwhile, are in Group B alongside Uganda, India and Ireland. They recently took on West Indies in a four-match Youth ODI series that ended in a draw. The experience in the West Indies might work to their advantage as they look for their first World Cup since 2014. AU-U19 XI Cooper Connolly (c), Harkirat Bajwa, Aidan Cahill, Joshua Garner, Corey Miller, Jack Nisbet, Nivethan Radhakrishnan, Jackson Sinfield, Tobias Snell, Tom Whitney, Teague Wyllie. SA-U19 XI George van Heerden (c), Liam Alder, Matthew Boast, Dewald Brevis, Michael Copeland, Ethan Cunningham, Gerhard Maree, Aphiwe Mnyanda, Andile Simelane, Jade Smith, Kaden Solomons AU-U19 vs SA-U19, ICC U19 World Cup 2021/22, Warm-Up Match Date and Time: January 9, 2022, 7:30 PM IST Venue: Everest Cricket Club, Georgetown The surface has hosted domestic games prior to this and it can be termed as a balanced track which has something in it for both bowlers and batters. A score of 250 could prove to be par here. Wicketkeeper G Maree could prove to be a valuable wicket-keeper choice for your Dream11 fantasy side. He can contribute with runs on a consistent basis. Batters C Connolly will look to provide Australia U19 with confident starts at the top of the order. He’s the captain and will be hoping to bat with responsibility. Connolly has scored 75 runs in his last four matches. G van Heerden is the captain of the South Africa U19 side. He has amassed 67 runs in his last five matches and it will be worth keeping an eye out for him here. All-rounders D Brevis was South Africa U19’s star with the ball in the series against West Indies recently. In three matches, he picked up 10 wickets and had a terrific economy rate of 3.53. He could prove to be a splendid captaincy choice for your AUS-U19 vs SA-U19 Dream11 fantasy side. N Radhakrishnan is a player who can surprise and one must have him in their Dream11 fantasy team. He has a great domestic record for Tasmania. Bowlers J Sinfield is intense and competitive with the ball. He’s likely to lead his team’s bowling unit. D Brevis (SA-U19) N Radhakrishnan (AU-U19) C Kellaway (AU-U19) C Connolly (AU-U19) G van Heerden (SA-U19) D Brevis: 86 runs and 11 wickets in last five matches N Radhakrishnan: 172 runs and 8 wickets in last five matches C Connolly: 75 runs in last four matches G van Heerden: 67 runs in last five matches Fantasy Suggestion #1: G Maree, C Kellaway, C Connolly, G van Heerden, D Brevis, M Boast, N Radhakrishnan, A Simelane, A Mnyanda, J Nisbet, J Sinfield Captain: D Brevis , Vice-Captain: N Radhakrishnan Fantasy Suggestion #2: G Maree, C Kellaway, C Connolly, M Copeland, G van Heerden, D Brevis, M Boast, N Radhakrishnan, A Mnyanda, J Nisbet, J Sinfield Captain: C Kellaway , Vice-Captain: C Connolly.","image_url":"https://static.sportskeeda.com/editor/2022/01/cb9b2-16417302074132-1920.jpg","source_id":"sportskeeda"},{"title":"Sixers squander two easy catches","link":"https://www.news.com.au/sport/cricket/sixers-squander-two-easy-catches/video/89a430e4784c049e2a932964f8d7f5de","keywords":null,"creator":null,"video_url":null,"description":"Cricket: The Perth Scorchers escaped dismissal twice after the Sydney Sixers squandered two easy catches, making 'a meal' of the opportunities.","content":null,"pubDate":"2022-01-09 11:44:06","full_description":null,"image_url":null,"source_id":"news"},{"title":"Sixers squander two easy catches","link":"https://www.cairnspost.com.au/sport/cricket/sixers-squander-two-easy-catches/video/89a430e4784c049e2a932964f8d7f5de","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: The Perth Scorchers escaped dismissal twice after the Sydney Sixers squandered two easy catches, making 'a meal' of the opportunities.","content":null,"pubDate":"2022-01-09 11:44:06","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Buttler out as England count cost of SCG draw - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL2pvcy1idXR0bGVyLWhlYWRpbmctaG9tZS1lbmdsYW5kLWFzaGVzLWJyb2tlbi1maW5nZXItZmlmdGgtdGVzdC1iYWlyc3Rvdy1wb3BlLXNlbGVjdGlvbi13aWNrZXRrZWVwZXIvMjAyMi0wMS0wOdIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Buttler out as England count cost of SCG draw  cricket.com.auRoot 'proud' of England playing through physical pain to get Ashes draw – video  The Guardian\"It's a small step in the right direction\" England captain Joe Root on his side battling for a draw  BT SportEngland reveal extent of injuries from gutsy draw  Daily TelegraphEngland's latest greatest escape is a refreshing reminder of the village green - and here are my top five  Telegraph.co.ukView Full coverage on Google News","content":null,"pubDate":"2022-01-09 11:32:59","image_url":null,"source_id":"google"},{"title":"Australia vs England, 4th Test: Draw restored pride in the team, says England captain Joe Root","link":"https://www.indiatvnews.com/sports/cricket/australia-vs-england-4th-test-draw-restored-pride-in-the-team-says-england-captain-joe-root-2022-01-09-753545","keywords":null,"creator":null,"video_url":null,"description":"England captain Joe Root is delighted as his side managed to pull off a dramatic draw in the fourth Test of the ongoing Ashes series against Australia here at the Sydney Cricket Ground on Sunday. The Three Lions skipper expressed that the draw restored pride in his team and represent a small step forward after a poor show against arch-rival Australia.","content":null,"pubDate":"2022-01-09 11:26:14","full_description":"England captain is delighted as his side managed to pull off a dramatic draw in the fourth Test of the ongoing Ashes series against Australia here at the Sydney Cricket Ground on Sunday. The Three Lions skipper expressed that the draw restored pride in his team and represent a small step forward after a poor show against arch-rival Australia. Root's side batted for the entire fifth day at the SCG, clinging on by the skin of their teeth as they finished on 270 for nine with last man James Anderson arriving at the crease to see off the final over of the match. While the urn was already lost after three hefty defeats over 12 depressing days of action, this was a much-needed show of resilience from a side that had been widely tipped to capitulate 5-0. Three batters survived for 100 balls or more - Zak Crawley, Ben Stokes and all carrying a sizeable share of the load - while Anderson's late act of defiance was preceded by gutsy innings by fellow tailenders Stuart Broad and Jack Leach. Root, for once, was not central to his side's efforts having fallen for 24 in the afternoon session but he has long shouldered too much of the burden and was delighted with what he saw.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket-Tough to drop in-form Khawaja, says Cummins","link":"https://www.thestar.com.my/sport/cricket/2022/01/09/cricket-tough-to-drop-in-form-khawaja-says-cummins","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Usman Khawaja's fairytale comeback has presented Australia with a selection headache, and captain Pat Cummins conceded it would be hard to drop the in-form batsman from the fifth and final Ashes test against England in Hobart next week. Read full story","content":null,"pubDate":"2022-01-09 11:20:00","full_description":"SYDNEY (Reuters) - Usman Khawaja's fairytale comeback has presented Australia with a selection headache, and captain Pat Cummins conceded it would be hard to drop the in-form batsman from the fifth and final Ashes test against England in Hobart next week. Khawaja, 35, was picked to play his first test in 2-1/2 years only because Travis Head had tested positive for COVID-19, but he grabbed the opportunity with both hands, smashing a century in each innings and claiming the man-of-the-match award. With a fit Head set to join the team in Hobart, left-hander Khawaja said he did not expect to be retained for the final test. But Cummins did not want to rule him out. \"I'll preface it by saying I'm not a selector, but when someone comes out and hits twin hundreds, it's pretty hard to go past them for the week after,\" Cummins said after the drawn fourth test at the Sydney Cricket Ground. \"So we'll work through that, the selectors will work through that in the next few days. But when someone's running hot, has got a heap of experience like Uzzy, the way he plays is fantastic.\" Head's match-winning century in the opening test had set the tone for Australia's dominance in the five-test series. Considering Khawaja's ability to bat anywhere in the top order, Australia could also be tempted to play him as opener replacing Marcus Harris, who has managed only one half-century in the series so far. Cummins said Khawaja's versatility made the batsman an asset to have. \"I guess that's why he was the spare batter and picked in the squad originally,\" Cummins said. \"It felt like he could replace any batter one-to-six really well. He's hugely versatile.\" \"I know there's been question marks historically on him playing over in Asia, but you see how well he's played spin recently,\" he said, referring to the batsman's performance on the drier, spin-friendly wickets in Asia. \"Reverse sweeping, sweeping. He's just someone who is in total command of his game, and that's why you love experience.\" (Reporting by Amlan Chakraborty in New Delhi; Editing by Hugh Lawson)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/09/1437532.jpg","source_id":"thestar_my"},{"title":"‘Pretty hard to go past’: Khawaja firms for Hobart retention as net closes in on Harris","link":"https://www.theage.com.au/sport/cricket/pretty-hard-to-go-past-khawaja-firms-for-hobart-retention-as-net-closes-in-on-harris-20220109-p59myr.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu"],"video_url":null,"description":"Player of the match Usman Khawaja may be resigned to joining the rare club of players being dumped after twin tons, but he has supporters in high places in Australian cricket who believe he is now indispensable.","content":null,"pubDate":"2022-01-09 11:04:07","full_description":"Australia captain Pat Cummins has backed comeback king Usman Khawaja to play in the Hobart Test, as support fades for battling opener Marcus Harris to retain his place in the XI. The hosts also face a selection issue with their quicks as they count the cost of their unsuccessful bid for victory in Sydney , with new sensation Scott Boland under an injury cloud and questions over Mitchell Starc’s stamina to play out the whole series. Usman Khawaja made an emphatic case to be retained for the fifth Ashes Test in Hobart. Credit: Getty Images In a match where about 60 overs were lost to rain, Australia paid the price for six dropped chances and a wicket from a no-ball as England defied the odds to save the game, costing Cummins’ men the chance to join the sides of 2006/07 and 2013/14 in completing an Ashes whitewash on home soil. Player of the match Khawaja may be resigned to joining the rare club of players being dumped after twin tons, but he has supporters in high places in Australian cricket who believe he is now indispensable. Former captain Ricky Ponting and Simon Katich have both called for the veteran left-hander to play in the fifth Test, while selector Tony Dodemaide was non-committal when asked about the duel between Khawaja and Harris. With Travis Head guaranteed an automatic return, the final place in the XI is at the top of the order. Khawaja is not a specialist opener but averages nearly 97 in that role for Australia, including a ton facing the pink ball in 2016. Though Khawaja does not open for Queensland, selectors picked him in the squad confident he could bat anywhere in the order. “That’s why he was the spare batter and picked in the squad originally, I felt he could replace any batter one to six really well,” Cummins said. “I think he’s hugely versatile. I know there have been question marks, historically, over him playing in Asia, but you see how well he’s played spin recently, reverse sweeping, sweeping, he’s someone who is in total command of his game. “That’s why you love experience. Two centuries, it rarely happens in a career. “If someone hits a twin hundred it’s pretty hard to go past them for the week after, I think. If someone is running hot and a got a heap of experience like Uzzie, the way he played was fantastic.” Ponting, a close friend of selector Justin Langer and arguably the most respected pundit in this country, was sympathetic to Harris but said the opener had not taken his opportunities to keep his place ahead of Khawaja. David Warner, Usman Khawaja and Steve Smith of Australia look on during day five of the fourth Test at the SCG. Credit: Getty Images Selectors have invested heavily in Harris but have not been rewarded for their faith. With just three half-centuries and no tons from 26 innings, Harris could not consider himself unlucky to be dropped, though his form has improved in the past two games. “What I’ve seen, if I’m trying to answer the question of who is the better player, the better batsman, now out of what I’ve seen from Khawaja or Marcus Harris, then it’s pretty clear to me Khawaja is a better player right now than what Harris is,” Ponting said on Channel Seven. Boland is battling rib soreness after crashing to the turf just before tea on day four. The seamer was the pick of Australia’s bowlers, backing up his dream debut with seven wickets. Such is the faith Cummins has in the Victorian, he gave Boland the ball in the closing overs, but the fading light prevented the paceman from being used. Starc’s average of nearly 53 in the fifth Test of a series suggests he struggles with the workload, but in his favour is that he is a wizard with the pink ball. Jhye Richardson and Michael Neser are waiting in the wings if pace reinforcements are required. “I think we’ve got six or seven days, so we’ll take our time, we’ll see how all the bowlers put up,” Cummins said. “Scotty was a little bit sore. [It’s] too early to talk about all those things until we get down there, have a look at the wicket and see how everyone pulls up.” Sports news, results and expert commentary. Sign up for our Sport newsletter .","image_url":null,"source_id":"theage"},{"title":"IND vs SA: Team India begin training for 3rd Test in Cape Town","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-team-india-begins-training-for-3rd-test-in-cape-town-2022-01-09-753539","keywords":null,"creator":null,"video_url":null,"description":"Indian cricket team began training for the third and decisive Test against South Africa in Cape Town, venue for the match, on Sunday. The third Test is scheduled from January 11.","content":null,"pubDate":"2022-01-09 10:51:38","full_description":"Indian cricket team began training for the third and decisive Test against South Africa in Cape Town, venue for the match, on Sunday. The third Test is scheduled from January 11. \"We are here at the picturesque Cape Town. #TeamIndia begin preparations for the 3rd Test #SAvIND,\" BCCI tweeted. South Africa had defeated India in the second Test by seven wickets to level the Test series 1-1. After the match, Team India head coach Rahul Dravid said that he is hopeful of seeing return for the third Test. \"Virat Kohli should be fine from all accounts, he should be fine. He has had the opportunity to run around a little bit, he has had the opportunity to test it a little bit,\" said Dravid during a virtual press conference. \"Hopefully with a couple of net sessions in Cape Town, he should be good to go. Everything I am hearing and just having a chat with him, he should be good to go in four days time,\" he added. played a captain's knock scoring an unbeaten 96 to take the hosts to a 7-wicket win levelling the 3-match series 1-1 against India.","image_url":null,"source_id":"indiatvnews"},{"title":"Cricket world loses it at ‘epic’ Ashes Test","link":"https://www.cairnspost.com.au/affiliates/kayo/cricket-world-reacts-to-epic-conclusion-to-fourth-ashes-test/news-story/728662154f24d95ec751308695f92eca","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Who said Test cricket is dead?","content":null,"pubDate":"2022-01-09 10:45:00","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Cricket world loses it at ‘epic’ Ashes Test","link":"https://www.news.com.au/sport/cricket/the-ashes/cricket-world-reacts-to-epic-conclusion-to-fourth-ashes-test/news-story/728662154f24d95ec751308695f92eca","keywords":null,"creator":null,"video_url":null,"description":"Who said Test cricket is dead?","content":null,"pubDate":"2022-01-09 10:45:00","full_description":"Who said Test cricket is dead? The fourth Ashes Test may have been a dead rubber that ended in a draw, but that doesn’t tell the story of what was a frenetic final few hours of play at the SCG. England started Day 5 with 10 wickets in hand needing to survive 98 overs to secure a draw, and they managed to hold on with just one wicket to spare . Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. At various stages throughout the day it seemed England would coast to a draw, only for a burst of wickets from Pat Cummins and cult hero Scott Boland to shift the momentum back Australia’s way. Jack Leach and Stuart Broad put on a stoic 33-run partnership before fading light meant the Aussies could only bowl spin in the remaining overs. Cummins surprisingly turned to Steve Smith, which proved to be a masterstroke. Smith ripped one his leggies into the rough and Leach edged to David Warner at first slip. That left Broad and James Anderson needing to survive the last two overs of the Test to salvage a hard-fought draw for England. In scenes that would warm the cockles of any Test cricket tragic, the entire Australian team was crowded around the pitch in an iconic field setting. Even Pat Cummins was fielding in close under a helmet, which he later confessed he had never done before. But Australia couldn’t find the final breakthrough as Anderson blocked six balls from Smith’s last over to see England through to a memorable draw. The final ball, Jimmy says no. #Ashes pic.twitter.com/vtxsN5lIfS The result means England will avoid a disastrous 5-0 series whitewash but perhaps more importantly, salvages some pride after they were humiliated in the first three matches. Fans were on the edge of their seats in the dying stages and rejoiced at the dramatic conclusion of Test, even though it didn’t provide an outright result. “That was epic,” AFL star Patrick Dangerfield tweeted. Paralympian Kurt Fearnley said: “Test cricket is the greatest!!!!” The Guardian’s cricket writer Ali Martin said: “Test cricket ... where bad light can see a batsman trying to bowl his team to victory against two bowlers trying to bat their team to a draw. Beautiful.” ABC broadcaster Quentin Hull said; “There’s cricket lovers’ romance in that. The great fast bowling warriors save the game for England. #Ashes”. Channel 9 reporter Chris O’Keefe said: “Test cricket is an aged Wagyu Rib Eye, T20 is a roll of devon. Great spectacle, and nobody won.” Former NRL player Ashton Sims added: “Pat Cummins fielding at point with a helmet on is everything I love about Test Cricket.” What a wonderful Test match. Had everything. Australia the better team, England take the moral victory, some wonderful individual performances, played in a wonderful spirit. Gotta love Test cricket. #Ashes Ben Stokes was all of us watching that last over! Wow what a ride. So much to love about that match. Test cricket! ð¥ #Ashes pic.twitter.com/pNvwOujjwy Comedian Titus O’Reilly joked: “A draw. Or as it’s also known ‘an English Victory’.” Former England captain Michael Vaughan said his countrymen had restored some pride with their performance. “I think we all saw this week how much Test cricket means to this group of players,” he said. “The Aussies at the moment are a better team but competing & showing some bite is what it’s all about. Loved the Test.” The Ashes will conclude with the fifth Test, which starts in Hobart on January 14. There were bizarre scenes at the SCG as Australia’s cricket stars desperately searched for a decisive breakthrough to secure victory. Alex Carey’s wicketkeeping has come under the microscope after a couple of missed chances during the New Year’s Ashes Test. A Sydney Cricket Ground patron who engaged in a brawl during the New Year’s Ashes Test has been banned from the iconic venue.","image_url":null,"source_id":"news"},{"title":"Cricket-Injured Buttler to fly home, Root proud of team&#039;s character","link":"https://www.thestar.com.my/sport/cricket/2022/01/09/cricket-injured-buttler-to-fly-home-root-proud-of-team039s-character","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - England's Jos Buttler will miss the fifth and final Ashes test against Australia in Hobart with a finger injury, skipper Joe Root said after the visitors eked out a thrilling draw in the fourth match in Sydney on Sunday. Read full story","content":null,"pubDate":"2022-01-09 10:39:00","full_description":"SYDNEY (Reuters) - England's Jos Buttler will miss the fifth and final Ashes test against Australia in Hobart with a finger injury, skipper Joe Root said after the visitors eked out a thrilling draw in the fourth match in Sydney on Sunday. England's bruised middle order and their obdurate tailenders combined to bat out the final day of the test amid nerve-racking drama to deny Australia their fourth consecutive victory in the series. All-rounder Ben Stokes who has a side strain and centurion Jonny Bairstow who injured a thumb during the match are also doubtful for the Hobart test beginning on Friday. \"We'll have to make some further assessments but Jos Buttler's going to have to fly home and won't take any further part on the tour,\" Root told a news conference. \"That's quite a serious injury and for him to front up as he did from the moment he took that knock shows how much he cares, shows how much it means for him to play in this team and play for England.\" The team later said in a statement that both Stokes, who managed two half-centuries in the match despite the pain, and Bairstow, whose 113 is the only hundred by an Englishman so far in the series, would travel to Hobart where they would be assessed. England have added Sam Billings to their squad and the 30-year-old is currently isolating in the team hotel. Head coach Chris Silverwood and bowling Coach Jon Lewis will also reunite with the squad having both recovered from COVID-19. Root said he felt an \"overwhelming\" sense of pride at the result that followed heavy losses in Brisbane, Adelaide and Melbourne. \"I think a lot of the guys could see a number of players hurting physically, and still putting in a huge amount and in many ways, it lifted the rest of the group,\" said Root. \"It's a small step forward...to be able to sit here having drawn (the match) was always going to take a good performance and I'm really proud of the way the guys dug in, and managed to do that.\" \"Clearly a lot of emotion knocking around, a big sense of pride. It's an overwhelming feeling at the moment...\" (Reporting by Amlan Chakraborty in New Delhi; editing by Elaine Hardcastle)","image_url":"https://apicms.thestar.com.my/uploads/images/2022/01/09/1437489.jpg","source_id":"thestar_my"}]}