{"newsArray":[{"title":"भारत और आयरलैंड का टी20 मुकाबला, कौन होंगे वो गेंदबाज जो करेंगे मैच का फैसला?","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-t20-series-the-battle-of-the-bowlers-who-will-shine-in-dublin-805815.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और आयरलैंड का डबलिन में तीन मैचों की टी-20 सीरीज का मुकाबला होने जा रहा है, जिसमें जसप्रीत बुमराह के वापसी से मुकाबले में और भी रोमांच होगा। यहां हमने चार ऐसे गेंदबाजों के बारे में बताया है, जो सीरीज में महत्वपूर्ण भूमिका निभा सकते हैं।","content":"भारत और आयरलैंड के बीच डबलिन में तीन मैचों की टी-20 सीरीज का आगाज जसप्रीत बुमराह के आगमन के चलते काफी चर्चित हो गया है। टीम इंडिया ने हाल ही में वेस्टइंडीज के खिलाफ पांच मैचों की T20 सीरीज को 3-2 से हारा था। ऐसे में वे इस श्रंखला को हल्के में नहीं लेना चाहेंगे। वहीं, आयरलैंड की टीम अपनी धरती पर खेलने के लिए काफी कॉन्फिडेंट है। हालांकि उनके सामने भारत की बड़ी चुनौती है लेकिन इस बात से इंकार नहीं किया जा सकता कि टीम इंडिया के अंदर काफी कम अनुभव मौजूद है। ऐसे में एक बढ़िया मुकाबला देखने की उम्मीद है और यहां चार ऐसे गेंदबाज होंगे, जिन पर विशेष नजर रहेगी। मार्क अडायर- इस गेंदबाज ने पिछले 10 मैचों में 19 विकेट चटकाए हैं। उनका इकॉनमी रेट 7.40 का रहा है, जबकि उनका स्ट्राइक रेट 11.68 का रहा है। बेन व्हाइट- ये एक ऐसे गेंदबाज हैं, जो भारतीय खिलाड़ियों को निशाना बनाने की ओर देख रहे हैं। उन्होंने पिछले 9 मैचों में 14 विकेट चटकाए हैं और उनका स्ट्राइक रेट 13.71 का रहा है। अर्शदीप सिंह- भारत के इस गेंदबाज पर सभी की नजर रहेगी जो इस फॉर्मेट के शानदार गेंदबाज साबित हो सकते हैं। आईलैंड को उनकी गेंदों से बचना होगा। बाएं हाथ के गेंदबाज ने पिछले 10 मैचों में 15 विकेट लिए हैं। उनका इकॉनमी रेट 9.35 का रहा है। वे स्ट्राइक रेट में भी 12.26 के आंकड़े के साथ शानदार दिखाई देते हैं। वाशिंगटन सुंदर- सुंदर को भारत ने एशियन गेम्स के लिए चुनकर कहीं ना कहीं वर्ल्ड कप से बाहर किया है। ये वो खिलाड़ी हैं, जिन्होंने पिछले तीन मैचों में 5.57 के कसे हुए इकॉनमी रेट और 5.57 के स्ट्राइक रेट के साथ विकेट लिए हैं।","pubDate":"2023-08-18 02:05:03","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"भारत बनाम आयरलैंड: इन चार बल्लेबाजों के दम पर और रोचक होगा पहला टी20 मुकाबला","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-1st-t20-these-four-batsmen-will-be-the-key-players-in-the-contest-805813.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और आयरलैंड के बीच डबलिन में तीन मैचों की T20 सीरीज का आगज हो रहा है, जहां इन चार बल्लेबाजों पर हमारी नजर रहेगी। इस लेख में पढ़िए कौन है बल्लेबाज।","content":"भारत और आयरलैंड के बीच आज डबलिन में भारत के आयरलैंड दौरे का पहला मैच खेला जाएगा। तीन मैचों की T20 सीरीज का आगाज आज ही हो रहा है। भारतीय क्रिकेट टीम काफी युवा है और जसप्रीत बुमराह की अगुवाई में खेलने के लिए उतार रही है। आयरलैंड के पास अपनी एक मजबूत टीम है, जिसकी अगुवाई पॉल स्टर्लिंग कर रहे हैं। आइए देखते हैं, इस मुकाबले में किन-चार बल्लेबाजों पर नजर रहने वाली है- इस खिलाड़ी ने पिछले आठ मैचों में 36 की औसत और 161.19 के स्ट्राइक रेट के साथ 216 रन बनाए हैं जो बहुत जबरदस्त आंकड़ा है। स्टर्लिंग काफी अच्छे खिलाड़ी हैं और 129 T20 इंटरनेशनल मैच खेलने का एक्सपीरियंस रखते हैं। आयरलैंड के इस बल्लेबाज के आंकड़े और भी शानदार हैं, जिन्होंने पिछले 10 T20 मैचों में 189 रन बनाए हैं और उनका औसत 47.25 रहा है। इस खिलाड़ी ने 147.65 के स्ट्राइक रेट से बल्लेबाजी की है। यह खिलाड़ी युवा है और 24 साल का ही है, जिनके पास 39 T20 इंटरनेशनल मैचों का अनुभव है। भारत के इस खिलाड़ी के पास आईपीएल में मुंबई इंडियंस के लिए पर्याप्त मैच खेलने का अनुभव है। वे काफी युवा बल्लेबाज हैं जिन्होंने पांच मैचों में 173 बनाए हैं और उनका औसत 57.66 रहा है, जबकि स्ट्राइक रेट 140.65 रहा है। बाएं हाथ के इस बल्लेबाज के पास भी तिलक वर्मा की तरह का ही सुनहरा भविष्य दिखाई देता है, जिन्होंने अपने पिछले तीन मैचों में 158 के स्ट्राइक रेट और 45 की औसत के साथ 90 बनाए हैं।","pubDate":"2023-08-18 01:40:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs IRE: दोनों टीमों के बीच हुए पिछले पांच टी20 मुकाबले, आयरलैंड ने भारत को दी कितनी टक्कर?","link":"https://hindi.oneindia.com/news/sports/cricket/ind-vs-ire-t20i-series-india-s-unbeaten-streak-against-ireland-can-they-continue-it-today-805757.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम आयरलैंड T20 सीरीज: भारत ने आयरलैंड के खिलाफ पिछले पांच मुकाबलों में पांच बार जीत हासिल की है। क्या वे आज भी इसको बरकरार रख पाएंगे? दोनों के बीच टी20 क्रिकेट के इतिहास और मौजूदा हालात के बारे में जानने के लिए पढ़ें।","content":"भारत और आयरलैंड के बीच 18 अगस्त यानी आज 3 मैचों की T20 सीरीज का आगाज होने जा रहा है। यह जसप्रीत बुमराह के लिए भी उनकी क्रिकेट की नई पारी का आगाज है, जहां पर वे सीधे कप्तान के तौर पर उतर रहे हैं। बुमराह एंड कंपनी के सामने आयरलैंड को हराने की चुनौती है, जिनके खिलाफ भारत का रिकॉर्ड काफी अच्छा है। दोनों टीमों के बीच हेड टू हेड रिकॉर्ड की बात करें, तो पिछले पांच मुकाबले में टीम इंडिया ने बाजी करने में कामयाबी हासिल की है। दोनों टीमों के बीच पिछला मुकाबला 28 जून 2022 में हुआ था, जो इन दोनों के बीच का सबसे करीबी मैच कहा जा सकता है। इस मैच में आयरलैंड ने अपनी जमीन पर खेलते हुए भारत के 225 रनों के स्कोर को चेज करते हुए 20 ओवर में पांच विकेट के नुकसान पर 221 रन बनाए थे। केवल चार रनों की हार के बावजूद यह एक ऐतिहासिक प्रदर्शन था। उससे पिछला मुकाबला 26 जून 2022 में खेला गया, जब भारतीय क्रिकेट टीम ने एक आसान जीत दर्ज करते हुए आयरलैंड को 16 रनों से मार दी। आयरलैंड ने 12 ओवर के इस मुकाबले में 4 विकेट के नुकसान पर 108 रन बनाए थे, जिसके जवाब में भारत ने 9.2 ओवर में ही तीन विकेट खोकर यह टारगेट हासिल कर लिया। इससे पिछला मुकाबला 29 जून 2018 को हुआ था, जब भारत ने आयरलैंड पर 143 रनों से जबरदस्त जीत दर्ज की थी। इस मैच में आयरलैंड के खिलाफ भारत ने पहले बल्लेबाजी करते हुए 4 विकेट पर 213 रन बनाए थे और मेजबान आयरलैंड 70 रन पर ही देर हो गया था। 2018 में 27 जून को हुए एक और मुकाबले में भारत ने आयरलैंड को बुरी तरह से मार देते हुए 76 रनों से जीत दर्ज की थी। डबलिन में हुए इस मैच में भारत ने पहले बल्लेबाजी करते हुए 5 विकेट के नुकसान पर 208 रन बनाए थे, जिसके जवाब में आयरलैंड 9 विकेट के नुकसान पर 132 रन ही बना सका। दोनों के बीच पिछला पांचवां मुकाबला 10 जून 2009 को हुआ था, जो काफी पुराना समय है, और यहां भारत ने 15 गेंद शेष रहते हुए 8 विकेट से जीत दर्ज की थी। आयरलैंड ने 18 ओवर में 8 विकेट के नुकसान पर 112 रन बनाए थे, जिसके जवाब में भारत ने 15.3 ओवर में 2 विकेट के नुकसान पर यह टारगेट हासिल कर लिया था।","pubDate":"2023-08-18 01:00:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Ireland: Was bowling 10 overs during rehab to prepare for World Cup: Bumrah","link":"https://www.tribuneindia.com/news/sports/india-vs-ireland-was-bowling-10-overs-during-rehab-to-prepare-for-world-cup-bumrah-535837","keywords":null,"creator":null,"video_url":null,"description":"Dublin, August 17After spending 11 months away from the game, a fit-again Jasprit Bumrah is back hungrier than ever and says he is ready to bowl long spells for India in the Asia Cup and subsequent ODI World Cup at home. Bumrah, who last played in September 2022 before lower-back stress fractures pushed him to the sidelines for the \"biggest break\" of his cricketing career, is making his much-anticipated comeback with the T20I series in Ireland. He will be required to bowl four overs per game here but speaking on the eve of the first T20I, the star pacer said the plan was always to prepare for 50-over events including the Asia Cup beginning August 31 and the World Cup beginning October 5.I was always preparing for the World Cup competition. I have been bowling 10, 12 and even 15 overs. —Jasprit Bumrah\"We were mindful of the fact there is no Test cricket till the ODI World Cup. In my rehab as well, I was not preparing for a T20 game. I was always preparing for the World Cup competition,\" Bumrah said.\"I have been bowling 10, 12 and even 15 overs. So I have bowled more overs, that way it becomes easier when less bowling is required. We kept that in mind that we are preparing for One-day competition and not a four-over competition. I have lots of overs under my belt. You have to keep working your way up,\" added Bumrah, who will captain India in the three T20Is.Bumrah said he is not holding back in the training sessions. \"I don't really think about expectations. I just want to go enjoy the game as I have come after a long break. Never been away from the game this long. I am coming back to enjoy as I love this game,\" the 29-year-old said.Self-doubt can creep in when a cricketer at the peak of his powers is forced to be away from the game for so long but Bumrah chose to look at the bright side.\"When injury takes time to heal, it can be frustrating. Instead of having self-doubt, I was thinking how to get fit and make a comeback. It is important to give the body time and respect. I never took it as a dark phase and thought my career could be over. I was looking for solutions and when solutions came I was feeling good,\" he said.","content":"PTI Dublin, August 17 After spending 11 months away from the game, a fit-again Jasprit Bumrah is back hungrier than ever and says he is ready to bowl long spells for India in the Asia Cup and subsequent ODI World Cup at home. Bumrah, who last played in September 2022 before lower-back stress fractures pushed him to the sidelines for the “biggest break” of his cricketing career, is making his much-anticipated comeback with the T20I series in Ireland. He will be required to bowl four overs per game here but speaking on the eve of the first T20I, the star pacer said the plan was always to prepare for 50-over events including the Asia Cup beginning August 31 and the World Cup beginning October 5. I was always preparing for the World Cup competition. I have been bowling 10, 12 and even 15 overs. —Jasprit Bumrah “We were mindful of the fact there is no Test cricket till the ODI World Cup. In my rehab as well, I was not preparing for a T20 game. I was always preparing for the World Cup competition,” Bumrah said. “I have been bowling 10, 12 and even 15 overs. So I have bowled more overs, that way it becomes easier when less bowling is required. We kept that in mind that we are preparing for One-day competition and not a four-over competition. I have lots of overs under my belt. You have to keep working your way up,” added Bumrah, who will captain India in the three T20Is. Bumrah said he is not holding back in the training sessions. “I don’t really think about expectations. I just want to go enjoy the game as I have come after a long break. Never been away from the game this long. I am coming back to enjoy as I love this game,” the 29-year-old said. Self-doubt can creep in when a cricketer at the peak of his powers is forced to be away from the game for so long but Bumrah chose to look at the bright side. “When injury takes time to heal, it can be frustrating. Instead of having self-doubt, I was thinking how to get fit and make a comeback. It is important to give the body time and respect. I never took it as a dark phase and thought my career could be over. I was looking for solutions and when solutions came I was feeling good,” he said. #Cricket #Jasprit Bumrah","pubDate":"2023-08-18 00:38:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/8/2023_8$largeimg_587951468.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Nigeria to receive T20 W’Cup trophy","link":"https://punchng.com/cricket-nigeria-to-receive-t20-wcup-trophy/","keywords":["Sports"],"creator":["Abiodun Adewale"],"video_url":null,"description":"Nigeria has been named as one of the three African countries for the trophy tour of the ICC Men’s T20 World Cup on August 29 and 30, ahead of this year’s championship in India, The PUNCH reports. The trophy is expected to arrive in Abuja on Tuesday, August 29, where it would be received by Read More","content":"Nigeria has been named as one of the three African countries for the trophy tour of the ICC Men’s T20 World Cup on August 29 and 30, ahead of this year’s championship in India, The PUNCH reports. The trophy is expected to arrive in Abuja on Tuesday, August 29, where it would be received by the board of the Nigeria Cricket Federation before being handed to the newly appointed Minister of Sports Development, Senator John Enoh. Also on Wednesday, August 30, the trophy would be in Lagos and would be received by Governor Babajide Sanwo-Olu and will also be on public display at the Tafawa Balewa Cricket Oval, the game’s most revered ground in the country. NCF president, Uyi Akpata, said the second coming of the ICC Men’s T20 World Cup trophy to the country is a testament to the strides of Nigerian cricket in the last five years. “Nigeria will be a major stop for the ICC Men’s T20 World Cup Trophy that is presently on tour of 18 countries globally, and that is major for us. Being the second successive time in Nigeria is a huge win for our developmental effort. Related News “I believe the back-to-back trophy tour of Nigeria, first in 2019 and now in 2023, shows how Nigeria, as an emerging cricket development hotbed, is key for the continent. And this is an appreciation to those who have, and are still sacrificing to see the game attain an enviable height in the country,” Akpata said. Nigeria has won four global developmental awards between 2019 and 2023, including qualifying for its first World Cup in 2019. This year, Nigeria was named the winner for 100 per cent Female Cricket Initiative of the Year Global Award. This was on the back of a successful girl-child campaign in Zamfara State which yielded over 20, 000 entrants in 2022. Nigeria’s Women’s senior team, the Female Yellow Greens also won the NCF Women’s T20i Invitational Tournaments for the first time this year after hosting it for four years.","pubDate":"2023-08-17 23:38:32","image_url":"https://cdn.punchng.com/wp-content/uploads/2017/01/07180053/Uyi-Akpata.jpg","source_id":"punchng","source_priority":19103,"country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps beat UAE by 19 runs in opening Twenty20","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-beat-uae-by-19-runs-in-opening-twenty20/","keywords":null,"creator":null,"video_url":null,"description":"For a brief moment it looked like UAE were in a position to achieve their biggest Twenty20 scalp and upset the Black Caps in the opening match in Dubai. But it was all too brief. Needing 47 runs off 36 balls with five wickets in hand they were a chance. Debutant Aryansh Sharma was leading the charge on 60 from 41 balls and there was certainly a sniff of an upset for the UAE - and with three other players on debut possibly their greatest win ever on the cards for the 16th ranked team in the world. But it didn’t last long as the experienced players in the Black Caps side ensured they didn’t start the back half of the year with a black mark. The hosts lost their last five wickets for 21 runs to fall 19 runs short of victory as Black Caps skipper Tim Southee finished with 5-25, his second five wicket bag in the format. Southee and James Neesham combined have played more T20 internationals than the entire UAE starting XI and the cooler heads showed in the 35 degree heat. In front of a sparse crowd at Dubai International Cricket Stadium, New Zealand made 155 for six in a mixed innings that didn’t get off to the best start. Opener Chad Bowes was dismissed first ball of the series when he edged the opening delivery from Junaid Siddique. Fellow opener Tim Seifert top scored for the Black Caps reaching his eighth T20 fifty, making 55 from 34 balls, but the rest of the top order failed to achieve one boundary between them as New Zealand slipped to 85 for five in the 13th over. They needed some late hitting from James Neesham (25 from 22), Cole McConchie (31 from 24) and Rachin Ravindra (21 from 11) to get beyond 150. Chasing 157 for victory, the UAE also lost a wicket first ball with Southee trapping Muhammad Waseem LBW. Wicketkeeper Sharma gave the UAE hope of a rare win over the T20 World Cup semifinalists but when Neesham removed him the chase fell apart. The experience of Neesham (2-15) and Mitchell Santner (2-22) showed while Kyle Jamieson (1020 from 2.4 overs) took the final wicket in his return to international cricket. Southee’s five wicket bag was his first since 2010 while UAE were the 14th different T20 opponent he has faced in his career. “It was a good game of cricket. We came to expect that. They are a growing side and they showed it tonight.” Southee said. “Number of guys have been playing cricket in different parts of the world. We had a couple of days of training and we had to adapt. When you travel, you get used to different conditions. They (UAE) are a quality side, they are improving. Youngsters playing with that sort of freedom - it is exciting.” The second match takes place 2am Sunday.","content":"For a brief moment it looked like UAE were in a position to achieve their biggest Twenty20 scalp and upset the Black Caps in the opening match in Dubai. But it was all too brief. Needing 47 runs off 36 balls with five wickets in hand they were a chance. Debutant Aryansh Sharma was leading the charge on 60 from 41 balls and there was certainly a sniff of an upset for the UAE - and with three other players on debut possibly their greatest win ever on the cards for the 16th ranked team in the world. But it didn’t last long as the experienced players in the Black Caps side ensured they didn’t start the back half of the year with a black mark. The hosts lost their last five wickets for 21 runs to fall 19 runs short of victory as Black Caps skipper Tim Southee finished with 5-25, his second five wicket bag in the format. Southee and James Neesham combined have played more T20 internationals than the entire UAE starting XI and the cooler heads showed in the 35 degree heat. In front of a sparse crowd at Dubai International Cricket Stadium, New Zealand made 155 for six in a mixed innings that didn’t get off to the best start. Opener Chad Bowes was dismissed first ball of the series when he edged the opening delivery from Junaid Siddique. Fellow opener Tim Seifert top scored for the Black Caps reaching his eighth T20 fifty, making 55 from 34 balls, but the rest of the top order failed to achieve one boundary between them as New Zealand slipped to 85 for five in the 13th over. They needed some late hitting from James Neesham (25 from 22), Cole McConchie (31 from 24) and Rachin Ravindra (21 from 11) to get beyond 150. Chasing 157 for victory, the UAE also lost a wicket first ball with Southee trapping Muhammad Waseem LBW. Wicketkeeper Sharma gave the UAE hope of a rare win over the T20 World Cup semifinalists but when Neesham removed him the chase fell apart. The experience of Neesham (2-15) and Mitchell Santner (2-22) showed while Kyle Jamieson (1020 from 2.4 overs) took the final wicket in his return to international cricket. Southee’s five wicket bag was his first since 2010 while UAE were the 14th different T20 opponent he has faced in his career. “It was a good game of cricket. We came to expect that. They are a growing side and they showed it tonight.” Southee said. “Number of guys have been playing cricket in different parts of the world. We had a couple of days of training and we had to adapt. When you travel, you get used to different conditions. They (UAE) are a quality side, they are improving. Youngsters playing with that sort of freedom - it is exciting.” The second match takes place 2am Sunday.","pubDate":"2023-08-17 20:35:19","image_url":"https://www.newstalkzb.co.nz/media/bt4fi0sx/new-zealands-tim-southee-photosport.jpg","source_id":"newstalkzb","source_priority":325733,"country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IND vs IRE: भारत के लिए सीरीज का पहला T20 मैच, आयरलैंड के साथ मुकाबले में कौन होंगे फैंटेसी टीम के हीरो?","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-t20i-best-picks-captain-and-vice-captain-advice-for-fantasy-team-805817.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम आयरलैंड: डबलिन में पहले टी20 मैच के लिए फैंटेसी टीम के टिप्स, कप्तान और उप-कप्तान की पसंद। दोनों टीमों के खिलाड़ियों के बेस्ट पिक्स, फॉर्म गाइड, और रिकॉर्ड्स के बारे में जानें।","content":"भारत और आयरलैंड की टीमें आज डबलिन में तीन मैचों की टी20 सीरीज के साथ मैदान में उतर रही हैं, जहां पर फैंटेसी टीम बनाने के लिए फैंस में अभी से उत्सुकता है। आयरलैंड के खिलाड़ियों के बारे में कम जानकारी और भारत के नए खिलाड़ियों के चलते फैंटेसी टीम और भी दिलचस्प हो गई है। टीम इंडिया जसप्रीत बुमराह की अगुवाई में उतर रही है। ये मैच आज शाम 7 बजकर 30 मिनट पर भारतीय समयानुसार होगा। इस मैच के लिए फैंटेसी टिप्स आप यहां से हासिल कर सकते हैं। रुतुराज गायकवाड़ एक ऐसे खिलाड़ी हैं जिन्होंने आईपीएल 2023 में फैंटेसी टीम बनाने वालों को कम ही निराश किया था। वे इस बार इंटरनेशनल मंच पर भी प्वाइंट्स कमाकर देने वाले खिलाड़ी साबित हो सकते हैं। ऐसे में यशसवी जायसवाल नई सनसनी हैं जिन्होंने वेस्टइंडीज के खिलाफ बताया है कि वे टेस्ट के बाद टी20 में भी कमाल कर सकते हैं। भारत के एक और खिलाड़ी तिलक वर्मा ने भी वेस्टइंडीज दौरे पर प्रभावित किया था। वे टी20 में भारत के बेस्ट बल्लेबाज के तौर पर नजर आए थे। वहीं, आयरलैंड के हैरी टेक्टर भी फैंटेसी टीम के लिए बढ़िया चॉइस हो सकते हैं। इस मैदान पर इस खिलाड़ी का रिकॉर्ड शानदार है। कर्टिस कैंफर यहां ऑलराउंडर की भूमिका में होंगे, जो लोअर मिडिल ऑर्डर पर भरोसेमंद बल्लेबाज हैं और मददगार परिस्थितयों में गेंद को स्विंग करा सकते हैं। लॉकरेन टकर यहां छुप रुस्तम हैं क्योंकि भारत के पास निरंतरता से परफॉर्म करने वाले कीपर इस सीरीज में नहीं है। टकर अपनी बल्लेबाजी के अलावा, कीपिंग से प्वाइंट दे सकते हैं। गेंदबाजों में जसप्रीत बुमराह का चयन खुद तय है। रवि बिश्नोई के लिए भी परिस्थितियां आदर्श हैं। अर्शदीप सिंह और जोशुआ लिटिल दोनों बाए हाथ के सीमर हैं जो विपक्षी टीमों को तंग कर सकते हैं। मार्क अडायर एक हटकर किया गया चुनाव है, जिन्होंने इस मैदान पर पिछले 6 मैचों में 9 विकेट चटकाएं हैं। वे बल्लेबाजी में भी हाथ आजमा सकते हैं। बल्लेबाज- रुतुराज गायकवाड़, यशस्वी जायसवाल, तिलक वर्मा, हैरी टेक्टर, ऑलराउंडर- कर्टिस कैंफर विकेटकीपर- लॉकरेन टकर बॉलर- जसप्रीत बुमराह, रवि बिश्नोई, अर्शदीप सिंह, जोशुआ लिटिल, मार्क अडायर अर्शदीप सिंह, तिलक वर्मा, यशस्वी जायसवाल जैसे इन फॉर्म खिलाड़ियों को कप्तान या उप-कप्तान के तौर पर चुना जा सकता है।","pubDate":"2023-08-17 19:25:07","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Kashmir Women’s Cricket League 2023 to begin Aug 19","link":"https://kashmirreader.com/2023/08/18/kashmir-womens-cricket-league-2023-to-begin-aug-19/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Renowned cricketer Mithali Raj to be Guest of Honour in final match Srinagar: Highly-anticipated Kashmir Women Cricket League is set to take place from August 19 to 26 in the Sher-e-Kashmir Stadium, Srinagar under the aegis of the 31 Sub Area & Chinar Corps. This thrilling cricket tournament featuring some of the most talented teams […]","content":"Renowned cricketer Mithali Raj to be Guest of Honour in final match Srinagar: Highly-anticipated Kashmir Women Cricket League is set to take place from August 19 to 26 in the Sher-e-Kashmir Stadium, Srinagar under the aegis of the 31 Sub Area & Chinar Corps. This thrilling cricket tournament featuring some of the most talented teams in the region will commence with opening Ceremony at 09:00 am. With an illustrious list of participants, Kashmir WCL is shaping up to be a celebration of cricket excellence. Twelve teams hailing from various parts of the region will compete over the course of eight days, showcasing their remarkable talent and passion for the game, PRO (Defence), Srinagar said in a statement issued here. The teams will sweat out for Player of the Match title in each match, Best batsmen and bowler of the tournament and Player of the Tournament title. In addition, the Winners and the Runners-up will be awarded with a Trophy and cash award. In the final match, scheduled at 02:30 pm on August 26, the world’s renowned cricketer Mithali Raj will grace the event as the esteemed Guest of Honour. Known for her exceptional talent, Mithali Raj has inspired countless cricketers around the globe and continues to be an emblem of perseverance and dedication. Her presence will undoubtedly elevate the excitement and prestige of the tournament, leaving an indelible mark on all those in attendance. Additionally, Mr Manoj Sinha, the honourable Lieutenant Governor of J&K will grace the occasion as the Chief Guest for the finals of Kashmir WCL. His notable contribution to sports and unwavering support towards nurturing talent in Kashmir makes him the perfect choice to grace this momentous occasion. As an ardent sports enthusiast, his presence will undoubtedly inspire players and spectators alike, further enhancing the tournament’s grandeur. This prestigious event holds significance for both cricket aficionados and players who have long awaited an opportunity to witness such exceptional talent up close. Chinar Corps is committed to promoting sports and empowering youth within the Valley. With a rich history of conducting successful sporting events, Chinar Corps consistently strives to provide unparalleled experiences for athletes and spectators alike. Kashmir Women’s Cricket League 2023 to begin Aug 19 added by KR Desk on 12:15 am August 18, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-17 18:45:59","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"title":"NZ to tour Bangladesh for three ODIs in build-up to World Cup","link":"https://kashmirreader.com/2023/08/18/nz-to-tour-bangladesh-for-three-odis-in-build-up-to-world-cup/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dhaka: New Zealand will tour Bangladesh for the first time in 10 years, when they travel to the country for a split ODI and Test series in September and November. The three-match ODI series will be the dress rehearsal for the two teams ahead of the World Cup in India. The World Cup begins with […]","content":"Dhaka: New Zealand will tour Bangladesh for the first time in 10 years, when they travel to the country for a split ODI and Test series in September and November. The three-match ODI series will be the dress rehearsal for the two teams ahead of the World Cup in India. The World Cup begins with last edition’s runners-up New Zealand taking on defending champions England in Ahmedabad in a repeat of the 2019 final. Bangladesh begin their World Cup journey against Afghanistan on October 7 in Dharamsala. As per the itinerary unveiled by the Bangladesh Cricket Board on Thursday, the tour is set to commence on September 21. All three ODIs are scheduled to take place at the Sher-e-Bangla National Cricket Stadium in Mirpur. The Test series is scheduled to start in late November following the conclusion of the World Cup. The venues for both Tests will be announced later. The second leg of the tour will be part of the ICC World Test Championship cycle. The red-ball clashes will take place after the World Cup. The Black Caps last toured the country in 2013 for a full series. The two-match Test series was drawn, while Bangladesh secured a 3-0 win in the three-match ODI series. The Kiwis ended their tour, winning the one-off T20I. NZ tour of Bangladesh 1st ODI: September 21, 2nd ODI: September 23, 3rd ODI: September 26 (All matches in Mirpur) 1st Test: November 28-December 2; 2nd Test: December 6-10 (Venues to be decided). PTI NZ to tour Bangladesh for three ODIs in build-up to World Cup added by Press Trust of India on 12:15 am August 18, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-17 18:45:36","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"title":"Southee takes five as New Zealand edge spirited UAE","link":"https://a-sports.tv/southee-five-new-zealand-edge-uae/","keywords":["Cricket","Sports","Top News","Top Picks","New Zealand vs UAE","Tim Southee","UAE vs New Zealand"],"creator":["A Sports"],"video_url":null,"description":"DUBAI: Tim Southee led New Zealand from the front with an economical five-wicket haul which devoided the United Arab Emirates (UAE) from pulling off a stunning victory. Chasing 156, the home side fell just 19 runs short and were bundled out for 136 despite Aryansh Sharma’s brisk half-century. The UAE were in command midway through […] The post Southee takes five as New Zealand edge spirited UAE appeared first on ASports.tv.","content":"DUBAI: Tim Southee led New Zealand from the front with an economical five-wicket haul which devoided the United Arab Emirates (UAE) from pulling off a stunning victory. Chasing 156, the home side fell just 19 runs short and were bundled out for 136 despite Aryansh Sharma’s brisk half-century. The UAE were in command midway through the pursuit as they were 84/3 with Sharma and Ansh Tandon at the crease. However, the wickets kept tumbling at an alarming rate and they were consequently bowled out in the final over. Sharma waged a lone battle for the hosts with a 43-ball 60, laced up with nine boundaries and a six. Besides him, the next best run-getters for the UAE were Ali Naseer (16) while Asif Khan and Vriitya Arvind scored 13 each. However, the six of their batters failed to make it into the double figures. New Zealand captain Tim Southee returned astonishing figures of 5/25, followed by two each by James Neesham and Mitchell Santner. Put into bat first, New Zealand registered a commendable total of 155/6 on the board at the back of a quickfire 55-run knock by Tim Seifert. Seifert recovered New Zealand from an early blow after Junaid Siddique dismissed Chad Bowes on the first delivery of the innings. He then knitted a 51-run partnership with Dane Cleaver (4) before both perished in quick successions to leave New Zealand reeling at 60/3 in the eighth over. Seifert remained the top-scorer for the New Zealand with a 34-ball 55, laced up with two boundaries and three sixes. New Zealand then lost three more wickets at relugar intervals and had slipped to 109/6 in 15.2 overs before Cole McConchie and Rachin Ravindra added vital runs at the death. McConchie played an unbeaten cameo of 31 in 24 deliveries while Ravindra made a brisk 11-ball 21. For the UAE, Basil Hameed and Junaid Siddique bagged two wickets each while Mohammed Faraazuddin made one scalp each. READ: PCB announces first-ever domestic contracts for women cricketers","pubDate":"2023-08-17 18:19:58","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"भारत और आयरलैंड का टी20 मुकाबला, कौन होंगे वो गेंदबाज जो करेंगे मैच का फैसला?","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-t20-series-the-battle-of-the-bowlers-who-will-shine-in-dublin-805815.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और आयरलैंड का डबलिन में तीन मैचों की टी-20 सीरीज का मुकाबला होने जा रहा है, जिसमें जसप्रीत बुमराह के वापसी से मुकाबले में और भी रोमांच होगा। यहां हमने चार ऐसे गेंदबाजों के बारे में बताया है, जो सीरीज में महत्वपूर्ण भूमिका निभा सकते हैं।","content":"भारत और आयरलैंड के बीच डबलिन में तीन मैचों की टी-20 सीरीज का आगाज जसप्रीत बुमराह के आगमन के चलते काफी चर्चित हो गया है। टीम इंडिया ने हाल ही में वेस्टइंडीज के खिलाफ पांच मैचों की T20 सीरीज को 3-2 से हारा था। ऐसे में वे इस श्रंखला को हल्के में नहीं लेना चाहेंगे। वहीं, आयरलैंड की टीम अपनी धरती पर खेलने के लिए काफी कॉन्फिडेंट है। हालांकि उनके सामने भारत की बड़ी चुनौती है लेकिन इस बात से इंकार नहीं किया जा सकता कि टीम इंडिया के अंदर काफी कम अनुभव मौजूद है। ऐसे में एक बढ़िया मुकाबला देखने की उम्मीद है और यहां चार ऐसे गेंदबाज होंगे, जिन पर विशेष नजर रहेगी। मार्क अडायर- इस गेंदबाज ने पिछले 10 मैचों में 19 विकेट चटकाए हैं। उनका इकॉनमी रेट 7.40 का रहा है, जबकि उनका स्ट्राइक रेट 11.68 का रहा है। बेन व्हाइट- ये एक ऐसे गेंदबाज हैं, जो भारतीय खिलाड़ियों को निशाना बनाने की ओर देख रहे हैं। उन्होंने पिछले 9 मैचों में 14 विकेट चटकाए हैं और उनका स्ट्राइक रेट 13.71 का रहा है। अर्शदीप सिंह- भारत के इस गेंदबाज पर सभी की नजर रहेगी जो इस फॉर्मेट के शानदार गेंदबाज साबित हो सकते हैं। आईलैंड को उनकी गेंदों से बचना होगा। बाएं हाथ के गेंदबाज ने पिछले 10 मैचों में 15 विकेट लिए हैं। उनका इकॉनमी रेट 9.35 का रहा है। वे स्ट्राइक रेट में भी 12.26 के आंकड़े के साथ शानदार दिखाई देते हैं। वाशिंगटन सुंदर- सुंदर को भारत ने एशियन गेम्स के लिए चुनकर कहीं ना कहीं वर्ल्ड कप से बाहर किया है। ये वो खिलाड़ी हैं, जिन्होंने पिछले तीन मैचों में 5.57 के कसे हुए इकॉनमी रेट और 5.57 के स्ट्राइक रेट के साथ विकेट लिए हैं।","pubDate":"2023-08-18 02:05:03","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"भारत बनाम आयरलैंड: इन चार बल्लेबाजों के दम पर और रोचक होगा पहला टी20 मुकाबला","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-1st-t20-these-four-batsmen-will-be-the-key-players-in-the-contest-805813.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और आयरलैंड के बीच डबलिन में तीन मैचों की T20 सीरीज का आगज हो रहा है, जहां इन चार बल्लेबाजों पर हमारी नजर रहेगी। इस लेख में पढ़िए कौन है बल्लेबाज।","content":"भारत और आयरलैंड के बीच आज डबलिन में भारत के आयरलैंड दौरे का पहला मैच खेला जाएगा। तीन मैचों की T20 सीरीज का आगाज आज ही हो रहा है। भारतीय क्रिकेट टीम काफी युवा है और जसप्रीत बुमराह की अगुवाई में खेलने के लिए उतार रही है। आयरलैंड के पास अपनी एक मजबूत टीम है, जिसकी अगुवाई पॉल स्टर्लिंग कर रहे हैं। आइए देखते हैं, इस मुकाबले में किन-चार बल्लेबाजों पर नजर रहने वाली है- इस खिलाड़ी ने पिछले आठ मैचों में 36 की औसत और 161.19 के स्ट्राइक रेट के साथ 216 रन बनाए हैं जो बहुत जबरदस्त आंकड़ा है। स्टर्लिंग काफी अच्छे खिलाड़ी हैं और 129 T20 इंटरनेशनल मैच खेलने का एक्सपीरियंस रखते हैं। आयरलैंड के इस बल्लेबाज के आंकड़े और भी शानदार हैं, जिन्होंने पिछले 10 T20 मैचों में 189 रन बनाए हैं और उनका औसत 47.25 रहा है। इस खिलाड़ी ने 147.65 के स्ट्राइक रेट से बल्लेबाजी की है। यह खिलाड़ी युवा है और 24 साल का ही है, जिनके पास 39 T20 इंटरनेशनल मैचों का अनुभव है। भारत के इस खिलाड़ी के पास आईपीएल में मुंबई इंडियंस के लिए पर्याप्त मैच खेलने का अनुभव है। वे काफी युवा बल्लेबाज हैं जिन्होंने पांच मैचों में 173 बनाए हैं और उनका औसत 57.66 रहा है, जबकि स्ट्राइक रेट 140.65 रहा है। बाएं हाथ के इस बल्लेबाज के पास भी तिलक वर्मा की तरह का ही सुनहरा भविष्य दिखाई देता है, जिन्होंने अपने पिछले तीन मैचों में 158 के स्ट्राइक रेट और 45 की औसत के साथ 90 बनाए हैं।","pubDate":"2023-08-18 01:40:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs IRE: दोनों टीमों के बीच हुए पिछले पांच टी20 मुकाबले, आयरलैंड ने भारत को दी कितनी टक्कर?","link":"https://hindi.oneindia.com/news/sports/cricket/ind-vs-ire-t20i-series-india-s-unbeaten-streak-against-ireland-can-they-continue-it-today-805757.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम आयरलैंड T20 सीरीज: भारत ने आयरलैंड के खिलाफ पिछले पांच मुकाबलों में पांच बार जीत हासिल की है। क्या वे आज भी इसको बरकरार रख पाएंगे? दोनों के बीच टी20 क्रिकेट के इतिहास और मौजूदा हालात के बारे में जानने के लिए पढ़ें।","content":"भारत और आयरलैंड के बीच 18 अगस्त यानी आज 3 मैचों की T20 सीरीज का आगाज होने जा रहा है। यह जसप्रीत बुमराह के लिए भी उनकी क्रिकेट की नई पारी का आगाज है, जहां पर वे सीधे कप्तान के तौर पर उतर रहे हैं। बुमराह एंड कंपनी के सामने आयरलैंड को हराने की चुनौती है, जिनके खिलाफ भारत का रिकॉर्ड काफी अच्छा है। दोनों टीमों के बीच हेड टू हेड रिकॉर्ड की बात करें, तो पिछले पांच मुकाबले में टीम इंडिया ने बाजी करने में कामयाबी हासिल की है। दोनों टीमों के बीच पिछला मुकाबला 28 जून 2022 में हुआ था, जो इन दोनों के बीच का सबसे करीबी मैच कहा जा सकता है। इस मैच में आयरलैंड ने अपनी जमीन पर खेलते हुए भारत के 225 रनों के स्कोर को चेज करते हुए 20 ओवर में पांच विकेट के नुकसान पर 221 रन बनाए थे। केवल चार रनों की हार के बावजूद यह एक ऐतिहासिक प्रदर्शन था। उससे पिछला मुकाबला 26 जून 2022 में खेला गया, जब भारतीय क्रिकेट टीम ने एक आसान जीत दर्ज करते हुए आयरलैंड को 16 रनों से मार दी। आयरलैंड ने 12 ओवर के इस मुकाबले में 4 विकेट के नुकसान पर 108 रन बनाए थे, जिसके जवाब में भारत ने 9.2 ओवर में ही तीन विकेट खोकर यह टारगेट हासिल कर लिया। इससे पिछला मुकाबला 29 जून 2018 को हुआ था, जब भारत ने आयरलैंड पर 143 रनों से जबरदस्त जीत दर्ज की थी। इस मैच में आयरलैंड के खिलाफ भारत ने पहले बल्लेबाजी करते हुए 4 विकेट पर 213 रन बनाए थे और मेजबान आयरलैंड 70 रन पर ही देर हो गया था। 2018 में 27 जून को हुए एक और मुकाबले में भारत ने आयरलैंड को बुरी तरह से मार देते हुए 76 रनों से जीत दर्ज की थी। डबलिन में हुए इस मैच में भारत ने पहले बल्लेबाजी करते हुए 5 विकेट के नुकसान पर 208 रन बनाए थे, जिसके जवाब में आयरलैंड 9 विकेट के नुकसान पर 132 रन ही बना सका। दोनों के बीच पिछला पांचवां मुकाबला 10 जून 2009 को हुआ था, जो काफी पुराना समय है, और यहां भारत ने 15 गेंद शेष रहते हुए 8 विकेट से जीत दर्ज की थी। आयरलैंड ने 18 ओवर में 8 विकेट के नुकसान पर 112 रन बनाए थे, जिसके जवाब में भारत ने 15.3 ओवर में 2 विकेट के नुकसान पर यह टारगेट हासिल कर लिया था।","pubDate":"2023-08-18 01:00:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Ireland: Was bowling 10 overs during rehab to prepare for World Cup: Bumrah","link":"https://www.tribuneindia.com/news/sports/india-vs-ireland-was-bowling-10-overs-during-rehab-to-prepare-for-world-cup-bumrah-535837","keywords":null,"creator":null,"video_url":null,"description":"Dublin, August 17After spending 11 months away from the game, a fit-again Jasprit Bumrah is back hungrier than ever and says he is ready to bowl long spells for India in the Asia Cup and subsequent ODI World Cup at home. Bumrah, who last played in September 2022 before lower-back stress fractures pushed him to the sidelines for the \"biggest break\" of his cricketing career, is making his much-anticipated comeback with the T20I series in Ireland. He will be required to bowl four overs per game here but speaking on the eve of the first T20I, the star pacer said the plan was always to prepare for 50-over events including the Asia Cup beginning August 31 and the World Cup beginning October 5.I was always preparing for the World Cup competition. I have been bowling 10, 12 and even 15 overs. —Jasprit Bumrah\"We were mindful of the fact there is no Test cricket till the ODI World Cup. In my rehab as well, I was not preparing for a T20 game. I was always preparing for the World Cup competition,\" Bumrah said.\"I have been bowling 10, 12 and even 15 overs. So I have bowled more overs, that way it becomes easier when less bowling is required. We kept that in mind that we are preparing for One-day competition and not a four-over competition. I have lots of overs under my belt. You have to keep working your way up,\" added Bumrah, who will captain India in the three T20Is.Bumrah said he is not holding back in the training sessions. \"I don't really think about expectations. I just want to go enjoy the game as I have come after a long break. Never been away from the game this long. I am coming back to enjoy as I love this game,\" the 29-year-old said.Self-doubt can creep in when a cricketer at the peak of his powers is forced to be away from the game for so long but Bumrah chose to look at the bright side.\"When injury takes time to heal, it can be frustrating. Instead of having self-doubt, I was thinking how to get fit and make a comeback. It is important to give the body time and respect. I never took it as a dark phase and thought my career could be over. I was looking for solutions and when solutions came I was feeling good,\" he said.","content":"PTI Dublin, August 17 After spending 11 months away from the game, a fit-again Jasprit Bumrah is back hungrier than ever and says he is ready to bowl long spells for India in the Asia Cup and subsequent ODI World Cup at home. Bumrah, who last played in September 2022 before lower-back stress fractures pushed him to the sidelines for the “biggest break” of his cricketing career, is making his much-anticipated comeback with the T20I series in Ireland. He will be required to bowl four overs per game here but speaking on the eve of the first T20I, the star pacer said the plan was always to prepare for 50-over events including the Asia Cup beginning August 31 and the World Cup beginning October 5. I was always preparing for the World Cup competition. I have been bowling 10, 12 and even 15 overs. —Jasprit Bumrah “We were mindful of the fact there is no Test cricket till the ODI World Cup. In my rehab as well, I was not preparing for a T20 game. I was always preparing for the World Cup competition,” Bumrah said. “I have been bowling 10, 12 and even 15 overs. So I have bowled more overs, that way it becomes easier when less bowling is required. We kept that in mind that we are preparing for One-day competition and not a four-over competition. I have lots of overs under my belt. You have to keep working your way up,” added Bumrah, who will captain India in the three T20Is. Bumrah said he is not holding back in the training sessions. “I don’t really think about expectations. I just want to go enjoy the game as I have come after a long break. Never been away from the game this long. I am coming back to enjoy as I love this game,” the 29-year-old said. Self-doubt can creep in when a cricketer at the peak of his powers is forced to be away from the game for so long but Bumrah chose to look at the bright side. “When injury takes time to heal, it can be frustrating. Instead of having self-doubt, I was thinking how to get fit and make a comeback. It is important to give the body time and respect. I never took it as a dark phase and thought my career could be over. I was looking for solutions and when solutions came I was feeling good,” he said. #Cricket #Jasprit Bumrah","pubDate":"2023-08-18 00:38:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/8/2023_8$largeimg_587951468.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Nigeria to receive T20 W’Cup trophy","link":"https://punchng.com/cricket-nigeria-to-receive-t20-wcup-trophy/","keywords":["Sports"],"creator":["Abiodun Adewale"],"video_url":null,"description":"Nigeria has been named as one of the three African countries for the trophy tour of the ICC Men’s T20 World Cup on August 29 and 30, ahead of this year’s championship in India, The PUNCH reports. The trophy is expected to arrive in Abuja on Tuesday, August 29, where it would be received by Read More","content":"Nigeria has been named as one of the three African countries for the trophy tour of the ICC Men’s T20 World Cup on August 29 and 30, ahead of this year’s championship in India, The PUNCH reports. The trophy is expected to arrive in Abuja on Tuesday, August 29, where it would be received by the board of the Nigeria Cricket Federation before being handed to the newly appointed Minister of Sports Development, Senator John Enoh. Also on Wednesday, August 30, the trophy would be in Lagos and would be received by Governor Babajide Sanwo-Olu and will also be on public display at the Tafawa Balewa Cricket Oval, the game’s most revered ground in the country. NCF president, Uyi Akpata, said the second coming of the ICC Men’s T20 World Cup trophy to the country is a testament to the strides of Nigerian cricket in the last five years. “Nigeria will be a major stop for the ICC Men’s T20 World Cup Trophy that is presently on tour of 18 countries globally, and that is major for us. Being the second successive time in Nigeria is a huge win for our developmental effort. Related News “I believe the back-to-back trophy tour of Nigeria, first in 2019 and now in 2023, shows how Nigeria, as an emerging cricket development hotbed, is key for the continent. And this is an appreciation to those who have, and are still sacrificing to see the game attain an enviable height in the country,” Akpata said. Nigeria has won four global developmental awards between 2019 and 2023, including qualifying for its first World Cup in 2019. This year, Nigeria was named the winner for 100 per cent Female Cricket Initiative of the Year Global Award. This was on the back of a successful girl-child campaign in Zamfara State which yielded over 20, 000 entrants in 2022. Nigeria’s Women’s senior team, the Female Yellow Greens also won the NCF Women’s T20i Invitational Tournaments for the first time this year after hosting it for four years.","pubDate":"2023-08-17 23:38:32","image_url":"https://cdn.punchng.com/wp-content/uploads/2017/01/07180053/Uyi-Akpata.jpg","source_id":"punchng","source_priority":19103,"country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps beat UAE by 19 runs in opening Twenty20","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-beat-uae-by-19-runs-in-opening-twenty20/","keywords":null,"creator":null,"video_url":null,"description":"For a brief moment it looked like UAE were in a position to achieve their biggest Twenty20 scalp and upset the Black Caps in the opening match in Dubai. But it was all too brief. Needing 47 runs off 36 balls with five wickets in hand they were a chance. Debutant Aryansh Sharma was leading the charge on 60 from 41 balls and there was certainly a sniff of an upset for the UAE - and with three other players on debut possibly their greatest win ever on the cards for the 16th ranked team in the world. But it didn’t last long as the experienced players in the Black Caps side ensured they didn’t start the back half of the year with a black mark. The hosts lost their last five wickets for 21 runs to fall 19 runs short of victory as Black Caps skipper Tim Southee finished with 5-25, his second five wicket bag in the format. Southee and James Neesham combined have played more T20 internationals than the entire UAE starting XI and the cooler heads showed in the 35 degree heat. In front of a sparse crowd at Dubai International Cricket Stadium, New Zealand made 155 for six in a mixed innings that didn’t get off to the best start. Opener Chad Bowes was dismissed first ball of the series when he edged the opening delivery from Junaid Siddique. Fellow opener Tim Seifert top scored for the Black Caps reaching his eighth T20 fifty, making 55 from 34 balls, but the rest of the top order failed to achieve one boundary between them as New Zealand slipped to 85 for five in the 13th over. They needed some late hitting from James Neesham (25 from 22), Cole McConchie (31 from 24) and Rachin Ravindra (21 from 11) to get beyond 150. Chasing 157 for victory, the UAE also lost a wicket first ball with Southee trapping Muhammad Waseem LBW. Wicketkeeper Sharma gave the UAE hope of a rare win over the T20 World Cup semifinalists but when Neesham removed him the chase fell apart. The experience of Neesham (2-15) and Mitchell Santner (2-22) showed while Kyle Jamieson (1020 from 2.4 overs) took the final wicket in his return to international cricket. Southee’s five wicket bag was his first since 2010 while UAE were the 14th different T20 opponent he has faced in his career. “It was a good game of cricket. We came to expect that. They are a growing side and they showed it tonight.” Southee said. “Number of guys have been playing cricket in different parts of the world. We had a couple of days of training and we had to adapt. When you travel, you get used to different conditions. They (UAE) are a quality side, they are improving. Youngsters playing with that sort of freedom - it is exciting.” The second match takes place 2am Sunday.","content":"For a brief moment it looked like UAE were in a position to achieve their biggest Twenty20 scalp and upset the Black Caps in the opening match in Dubai. But it was all too brief. Needing 47 runs off 36 balls with five wickets in hand they were a chance. Debutant Aryansh Sharma was leading the charge on 60 from 41 balls and there was certainly a sniff of an upset for the UAE - and with three other players on debut possibly their greatest win ever on the cards for the 16th ranked team in the world. But it didn’t last long as the experienced players in the Black Caps side ensured they didn’t start the back half of the year with a black mark. The hosts lost their last five wickets for 21 runs to fall 19 runs short of victory as Black Caps skipper Tim Southee finished with 5-25, his second five wicket bag in the format. Southee and James Neesham combined have played more T20 internationals than the entire UAE starting XI and the cooler heads showed in the 35 degree heat. In front of a sparse crowd at Dubai International Cricket Stadium, New Zealand made 155 for six in a mixed innings that didn’t get off to the best start. Opener Chad Bowes was dismissed first ball of the series when he edged the opening delivery from Junaid Siddique. Fellow opener Tim Seifert top scored for the Black Caps reaching his eighth T20 fifty, making 55 from 34 balls, but the rest of the top order failed to achieve one boundary between them as New Zealand slipped to 85 for five in the 13th over. They needed some late hitting from James Neesham (25 from 22), Cole McConchie (31 from 24) and Rachin Ravindra (21 from 11) to get beyond 150. Chasing 157 for victory, the UAE also lost a wicket first ball with Southee trapping Muhammad Waseem LBW. Wicketkeeper Sharma gave the UAE hope of a rare win over the T20 World Cup semifinalists but when Neesham removed him the chase fell apart. The experience of Neesham (2-15) and Mitchell Santner (2-22) showed while Kyle Jamieson (1020 from 2.4 overs) took the final wicket in his return to international cricket. Southee’s five wicket bag was his first since 2010 while UAE were the 14th different T20 opponent he has faced in his career. “It was a good game of cricket. We came to expect that. They are a growing side and they showed it tonight.” Southee said. “Number of guys have been playing cricket in different parts of the world. We had a couple of days of training and we had to adapt. When you travel, you get used to different conditions. They (UAE) are a quality side, they are improving. Youngsters playing with that sort of freedom - it is exciting.” The second match takes place 2am Sunday.","pubDate":"2023-08-17 20:35:19","image_url":"https://www.newstalkzb.co.nz/media/bt4fi0sx/new-zealands-tim-southee-photosport.jpg","source_id":"newstalkzb","source_priority":325733,"country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IND vs IRE: भारत के लिए सीरीज का पहला T20 मैच, आयरलैंड के साथ मुकाबले में कौन होंगे फैंटेसी टीम के हीरो?","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-t20i-best-picks-captain-and-vice-captain-advice-for-fantasy-team-805817.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम आयरलैंड: डबलिन में पहले टी20 मैच के लिए फैंटेसी टीम के टिप्स, कप्तान और उप-कप्तान की पसंद। दोनों टीमों के खिलाड़ियों के बेस्ट पिक्स, फॉर्म गाइड, और रिकॉर्ड्स के बारे में जानें।","content":"भारत और आयरलैंड की टीमें आज डबलिन में तीन मैचों की टी20 सीरीज के साथ मैदान में उतर रही हैं, जहां पर फैंटेसी टीम बनाने के लिए फैंस में अभी से उत्सुकता है। आयरलैंड के खिलाड़ियों के बारे में कम जानकारी और भारत के नए खिलाड़ियों के चलते फैंटेसी टीम और भी दिलचस्प हो गई है। टीम इंडिया जसप्रीत बुमराह की अगुवाई में उतर रही है। ये मैच आज शाम 7 बजकर 30 मिनट पर भारतीय समयानुसार होगा। इस मैच के लिए फैंटेसी टिप्स आप यहां से हासिल कर सकते हैं। रुतुराज गायकवाड़ एक ऐसे खिलाड़ी हैं जिन्होंने आईपीएल 2023 में फैंटेसी टीम बनाने वालों को कम ही निराश किया था। वे इस बार इंटरनेशनल मंच पर भी प्वाइंट्स कमाकर देने वाले खिलाड़ी साबित हो सकते हैं। ऐसे में यशसवी जायसवाल नई सनसनी हैं जिन्होंने वेस्टइंडीज के खिलाफ बताया है कि वे टेस्ट के बाद टी20 में भी कमाल कर सकते हैं। भारत के एक और खिलाड़ी तिलक वर्मा ने भी वेस्टइंडीज दौरे पर प्रभावित किया था। वे टी20 में भारत के बेस्ट बल्लेबाज के तौर पर नजर आए थे। वहीं, आयरलैंड के हैरी टेक्टर भी फैंटेसी टीम के लिए बढ़िया चॉइस हो सकते हैं। इस मैदान पर इस खिलाड़ी का रिकॉर्ड शानदार है। कर्टिस कैंफर यहां ऑलराउंडर की भूमिका में होंगे, जो लोअर मिडिल ऑर्डर पर भरोसेमंद बल्लेबाज हैं और मददगार परिस्थितयों में गेंद को स्विंग करा सकते हैं। लॉकरेन टकर यहां छुप रुस्तम हैं क्योंकि भारत के पास निरंतरता से परफॉर्म करने वाले कीपर इस सीरीज में नहीं है। टकर अपनी बल्लेबाजी के अलावा, कीपिंग से प्वाइंट दे सकते हैं। गेंदबाजों में जसप्रीत बुमराह का चयन खुद तय है। रवि बिश्नोई के लिए भी परिस्थितियां आदर्श हैं। अर्शदीप सिंह और जोशुआ लिटिल दोनों बाए हाथ के सीमर हैं जो विपक्षी टीमों को तंग कर सकते हैं। मार्क अडायर एक हटकर किया गया चुनाव है, जिन्होंने इस मैदान पर पिछले 6 मैचों में 9 विकेट चटकाएं हैं। वे बल्लेबाजी में भी हाथ आजमा सकते हैं। बल्लेबाज- रुतुराज गायकवाड़, यशस्वी जायसवाल, तिलक वर्मा, हैरी टेक्टर, ऑलराउंडर- कर्टिस कैंफर विकेटकीपर- लॉकरेन टकर बॉलर- जसप्रीत बुमराह, रवि बिश्नोई, अर्शदीप सिंह, जोशुआ लिटिल, मार्क अडायर अर्शदीप सिंह, तिलक वर्मा, यशस्वी जायसवाल जैसे इन फॉर्म खिलाड़ियों को कप्तान या उप-कप्तान के तौर पर चुना जा सकता है।","pubDate":"2023-08-17 19:25:07","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Kashmir Women’s Cricket League 2023 to begin Aug 19","link":"https://kashmirreader.com/2023/08/18/kashmir-womens-cricket-league-2023-to-begin-aug-19/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Renowned cricketer Mithali Raj to be Guest of Honour in final match Srinagar: Highly-anticipated Kashmir Women Cricket League is set to take place from August 19 to 26 in the Sher-e-Kashmir Stadium, Srinagar under the aegis of the 31 Sub Area & Chinar Corps. This thrilling cricket tournament featuring some of the most talented teams […]","content":"Renowned cricketer Mithali Raj to be Guest of Honour in final match Srinagar: Highly-anticipated Kashmir Women Cricket League is set to take place from August 19 to 26 in the Sher-e-Kashmir Stadium, Srinagar under the aegis of the 31 Sub Area & Chinar Corps. This thrilling cricket tournament featuring some of the most talented teams in the region will commence with opening Ceremony at 09:00 am. With an illustrious list of participants, Kashmir WCL is shaping up to be a celebration of cricket excellence. Twelve teams hailing from various parts of the region will compete over the course of eight days, showcasing their remarkable talent and passion for the game, PRO (Defence), Srinagar said in a statement issued here. The teams will sweat out for Player of the Match title in each match, Best batsmen and bowler of the tournament and Player of the Tournament title. In addition, the Winners and the Runners-up will be awarded with a Trophy and cash award. In the final match, scheduled at 02:30 pm on August 26, the world’s renowned cricketer Mithali Raj will grace the event as the esteemed Guest of Honour. Known for her exceptional talent, Mithali Raj has inspired countless cricketers around the globe and continues to be an emblem of perseverance and dedication. Her presence will undoubtedly elevate the excitement and prestige of the tournament, leaving an indelible mark on all those in attendance. Additionally, Mr Manoj Sinha, the honourable Lieutenant Governor of J&K will grace the occasion as the Chief Guest for the finals of Kashmir WCL. His notable contribution to sports and unwavering support towards nurturing talent in Kashmir makes him the perfect choice to grace this momentous occasion. As an ardent sports enthusiast, his presence will undoubtedly inspire players and spectators alike, further enhancing the tournament’s grandeur. This prestigious event holds significance for both cricket aficionados and players who have long awaited an opportunity to witness such exceptional talent up close. Chinar Corps is committed to promoting sports and empowering youth within the Valley. With a rich history of conducting successful sporting events, Chinar Corps consistently strives to provide unparalleled experiences for athletes and spectators alike. Kashmir Women’s Cricket League 2023 to begin Aug 19 added by KR Desk on 12:15 am August 18, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-17 18:45:59","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"title":"NZ to tour Bangladesh for three ODIs in build-up to World Cup","link":"https://kashmirreader.com/2023/08/18/nz-to-tour-bangladesh-for-three-odis-in-build-up-to-world-cup/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dhaka: New Zealand will tour Bangladesh for the first time in 10 years, when they travel to the country for a split ODI and Test series in September and November. The three-match ODI series will be the dress rehearsal for the two teams ahead of the World Cup in India. The World Cup begins with […]","content":"Dhaka: New Zealand will tour Bangladesh for the first time in 10 years, when they travel to the country for a split ODI and Test series in September and November. The three-match ODI series will be the dress rehearsal for the two teams ahead of the World Cup in India. The World Cup begins with last edition’s runners-up New Zealand taking on defending champions England in Ahmedabad in a repeat of the 2019 final. Bangladesh begin their World Cup journey against Afghanistan on October 7 in Dharamsala. As per the itinerary unveiled by the Bangladesh Cricket Board on Thursday, the tour is set to commence on September 21. All three ODIs are scheduled to take place at the Sher-e-Bangla National Cricket Stadium in Mirpur. The Test series is scheduled to start in late November following the conclusion of the World Cup. The venues for both Tests will be announced later. The second leg of the tour will be part of the ICC World Test Championship cycle. The red-ball clashes will take place after the World Cup. The Black Caps last toured the country in 2013 for a full series. The two-match Test series was drawn, while Bangladesh secured a 3-0 win in the three-match ODI series. The Kiwis ended their tour, winning the one-off T20I. NZ tour of Bangladesh 1st ODI: September 21, 2nd ODI: September 23, 3rd ODI: September 26 (All matches in Mirpur) 1st Test: November 28-December 2; 2nd Test: December 6-10 (Venues to be decided). PTI NZ to tour Bangladesh for three ODIs in build-up to World Cup added by Press Trust of India on 12:15 am August 18, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-17 18:45:36","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"title":"Southee takes five as New Zealand edge spirited UAE","link":"https://a-sports.tv/southee-five-new-zealand-edge-uae/","keywords":["Cricket","Sports","Top News","Top Picks","New Zealand vs UAE","Tim Southee","UAE vs New Zealand"],"creator":["A Sports"],"video_url":null,"description":"DUBAI: Tim Southee led New Zealand from the front with an economical five-wicket haul which devoided the United Arab Emirates (UAE) from pulling off a stunning victory. Chasing 156, the home side fell just 19 runs short and were bundled out for 136 despite Aryansh Sharma’s brisk half-century. The UAE were in command midway through […] The post Southee takes five as New Zealand edge spirited UAE appeared first on ASports.tv.","content":"DUBAI: Tim Southee led New Zealand from the front with an economical five-wicket haul which devoided the United Arab Emirates (UAE) from pulling off a stunning victory. Chasing 156, the home side fell just 19 runs short and were bundled out for 136 despite Aryansh Sharma’s brisk half-century. The UAE were in command midway through the pursuit as they were 84/3 with Sharma and Ansh Tandon at the crease. However, the wickets kept tumbling at an alarming rate and they were consequently bowled out in the final over. Sharma waged a lone battle for the hosts with a 43-ball 60, laced up with nine boundaries and a six. Besides him, the next best run-getters for the UAE were Ali Naseer (16) while Asif Khan and Vriitya Arvind scored 13 each. However, the six of their batters failed to make it into the double figures. New Zealand captain Tim Southee returned astonishing figures of 5/25, followed by two each by James Neesham and Mitchell Santner. Put into bat first, New Zealand registered a commendable total of 155/6 on the board at the back of a quickfire 55-run knock by Tim Seifert. Seifert recovered New Zealand from an early blow after Junaid Siddique dismissed Chad Bowes on the first delivery of the innings. He then knitted a 51-run partnership with Dane Cleaver (4) before both perished in quick successions to leave New Zealand reeling at 60/3 in the eighth over. Seifert remained the top-scorer for the New Zealand with a 34-ball 55, laced up with two boundaries and three sixes. New Zealand then lost three more wickets at relugar intervals and had slipped to 109/6 in 15.2 overs before Cole McConchie and Rachin Ravindra added vital runs at the death. McConchie played an unbeaten cameo of 31 in 24 deliveries while Ravindra made a brisk 11-ball 21. For the UAE, Basil Hameed and Junaid Siddique bagged two wickets each while Mohammed Faraazuddin made one scalp each. READ: PCB announces first-ever domestic contracts for women cricketers","pubDate":"2023-08-17 18:19:58","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"},{"title":"भारत और आयरलैंड का टी20 मुकाबला, कौन होंगे वो गेंदबाज जो करेंगे मैच का फैसला?","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-t20-series-the-battle-of-the-bowlers-who-will-shine-in-dublin-805815.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और आयरलैंड का डबलिन में तीन मैचों की टी-20 सीरीज का मुकाबला होने जा रहा है, जिसमें जसप्रीत बुमराह के वापसी से मुकाबले में और भी रोमांच होगा। यहां हमने चार ऐसे गेंदबाजों के बारे में बताया है, जो सीरीज में महत्वपूर्ण भूमिका निभा सकते हैं।","content":"भारत और आयरलैंड के बीच डबलिन में तीन मैचों की टी-20 सीरीज का आगाज जसप्रीत बुमराह के आगमन के चलते काफी चर्चित हो गया है। टीम इंडिया ने हाल ही में वेस्टइंडीज के खिलाफ पांच मैचों की T20 सीरीज को 3-2 से हारा था। ऐसे में वे इस श्रंखला को हल्के में नहीं लेना चाहेंगे। वहीं, आयरलैंड की टीम अपनी धरती पर खेलने के लिए काफी कॉन्फिडेंट है। हालांकि उनके सामने भारत की बड़ी चुनौती है लेकिन इस बात से इंकार नहीं किया जा सकता कि टीम इंडिया के अंदर काफी कम अनुभव मौजूद है। ऐसे में एक बढ़िया मुकाबला देखने की उम्मीद है और यहां चार ऐसे गेंदबाज होंगे, जिन पर विशेष नजर रहेगी। मार्क अडायर- इस गेंदबाज ने पिछले 10 मैचों में 19 विकेट चटकाए हैं। उनका इकॉनमी रेट 7.40 का रहा है, जबकि उनका स्ट्राइक रेट 11.68 का रहा है। बेन व्हाइट- ये एक ऐसे गेंदबाज हैं, जो भारतीय खिलाड़ियों को निशाना बनाने की ओर देख रहे हैं। उन्होंने पिछले 9 मैचों में 14 विकेट चटकाए हैं और उनका स्ट्राइक रेट 13.71 का रहा है। अर्शदीप सिंह- भारत के इस गेंदबाज पर सभी की नजर रहेगी जो इस फॉर्मेट के शानदार गेंदबाज साबित हो सकते हैं। आईलैंड को उनकी गेंदों से बचना होगा। बाएं हाथ के गेंदबाज ने पिछले 10 मैचों में 15 विकेट लिए हैं। उनका इकॉनमी रेट 9.35 का रहा है। वे स्ट्राइक रेट में भी 12.26 के आंकड़े के साथ शानदार दिखाई देते हैं। वाशिंगटन सुंदर- सुंदर को भारत ने एशियन गेम्स के लिए चुनकर कहीं ना कहीं वर्ल्ड कप से बाहर किया है। ये वो खिलाड़ी हैं, जिन्होंने पिछले तीन मैचों में 5.57 के कसे हुए इकॉनमी रेट और 5.57 के स्ट्राइक रेट के साथ विकेट लिए हैं।","pubDate":"2023-08-18 02:05:03","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"भारत बनाम आयरलैंड: इन चार बल्लेबाजों के दम पर और रोचक होगा पहला टी20 मुकाबला","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-1st-t20-these-four-batsmen-will-be-the-key-players-in-the-contest-805813.html","keywords":null,"creator":null,"video_url":null,"description":"भारत और आयरलैंड के बीच डबलिन में तीन मैचों की T20 सीरीज का आगज हो रहा है, जहां इन चार बल्लेबाजों पर हमारी नजर रहेगी। इस लेख में पढ़िए कौन है बल्लेबाज।","content":"भारत और आयरलैंड के बीच आज डबलिन में भारत के आयरलैंड दौरे का पहला मैच खेला जाएगा। तीन मैचों की T20 सीरीज का आगाज आज ही हो रहा है। भारतीय क्रिकेट टीम काफी युवा है और जसप्रीत बुमराह की अगुवाई में खेलने के लिए उतार रही है। आयरलैंड के पास अपनी एक मजबूत टीम है, जिसकी अगुवाई पॉल स्टर्लिंग कर रहे हैं। आइए देखते हैं, इस मुकाबले में किन-चार बल्लेबाजों पर नजर रहने वाली है- इस खिलाड़ी ने पिछले आठ मैचों में 36 की औसत और 161.19 के स्ट्राइक रेट के साथ 216 रन बनाए हैं जो बहुत जबरदस्त आंकड़ा है। स्टर्लिंग काफी अच्छे खिलाड़ी हैं और 129 T20 इंटरनेशनल मैच खेलने का एक्सपीरियंस रखते हैं। आयरलैंड के इस बल्लेबाज के आंकड़े और भी शानदार हैं, जिन्होंने पिछले 10 T20 मैचों में 189 रन बनाए हैं और उनका औसत 47.25 रहा है। इस खिलाड़ी ने 147.65 के स्ट्राइक रेट से बल्लेबाजी की है। यह खिलाड़ी युवा है और 24 साल का ही है, जिनके पास 39 T20 इंटरनेशनल मैचों का अनुभव है। भारत के इस खिलाड़ी के पास आईपीएल में मुंबई इंडियंस के लिए पर्याप्त मैच खेलने का अनुभव है। वे काफी युवा बल्लेबाज हैं जिन्होंने पांच मैचों में 173 बनाए हैं और उनका औसत 57.66 रहा है, जबकि स्ट्राइक रेट 140.65 रहा है। बाएं हाथ के इस बल्लेबाज के पास भी तिलक वर्मा की तरह का ही सुनहरा भविष्य दिखाई देता है, जिन्होंने अपने पिछले तीन मैचों में 158 के स्ट्राइक रेट और 45 की औसत के साथ 90 बनाए हैं।","pubDate":"2023-08-18 01:40:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs IRE: दोनों टीमों के बीच हुए पिछले पांच टी20 मुकाबले, आयरलैंड ने भारत को दी कितनी टक्कर?","link":"https://hindi.oneindia.com/news/sports/cricket/ind-vs-ire-t20i-series-india-s-unbeaten-streak-against-ireland-can-they-continue-it-today-805757.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम आयरलैंड T20 सीरीज: भारत ने आयरलैंड के खिलाफ पिछले पांच मुकाबलों में पांच बार जीत हासिल की है। क्या वे आज भी इसको बरकरार रख पाएंगे? दोनों के बीच टी20 क्रिकेट के इतिहास और मौजूदा हालात के बारे में जानने के लिए पढ़ें।","content":"भारत और आयरलैंड के बीच 18 अगस्त यानी आज 3 मैचों की T20 सीरीज का आगाज होने जा रहा है। यह जसप्रीत बुमराह के लिए भी उनकी क्रिकेट की नई पारी का आगाज है, जहां पर वे सीधे कप्तान के तौर पर उतर रहे हैं। बुमराह एंड कंपनी के सामने आयरलैंड को हराने की चुनौती है, जिनके खिलाफ भारत का रिकॉर्ड काफी अच्छा है। दोनों टीमों के बीच हेड टू हेड रिकॉर्ड की बात करें, तो पिछले पांच मुकाबले में टीम इंडिया ने बाजी करने में कामयाबी हासिल की है। दोनों टीमों के बीच पिछला मुकाबला 28 जून 2022 में हुआ था, जो इन दोनों के बीच का सबसे करीबी मैच कहा जा सकता है। इस मैच में आयरलैंड ने अपनी जमीन पर खेलते हुए भारत के 225 रनों के स्कोर को चेज करते हुए 20 ओवर में पांच विकेट के नुकसान पर 221 रन बनाए थे। केवल चार रनों की हार के बावजूद यह एक ऐतिहासिक प्रदर्शन था। उससे पिछला मुकाबला 26 जून 2022 में खेला गया, जब भारतीय क्रिकेट टीम ने एक आसान जीत दर्ज करते हुए आयरलैंड को 16 रनों से मार दी। आयरलैंड ने 12 ओवर के इस मुकाबले में 4 विकेट के नुकसान पर 108 रन बनाए थे, जिसके जवाब में भारत ने 9.2 ओवर में ही तीन विकेट खोकर यह टारगेट हासिल कर लिया। इससे पिछला मुकाबला 29 जून 2018 को हुआ था, जब भारत ने आयरलैंड पर 143 रनों से जबरदस्त जीत दर्ज की थी। इस मैच में आयरलैंड के खिलाफ भारत ने पहले बल्लेबाजी करते हुए 4 विकेट पर 213 रन बनाए थे और मेजबान आयरलैंड 70 रन पर ही देर हो गया था। 2018 में 27 जून को हुए एक और मुकाबले में भारत ने आयरलैंड को बुरी तरह से मार देते हुए 76 रनों से जीत दर्ज की थी। डबलिन में हुए इस मैच में भारत ने पहले बल्लेबाजी करते हुए 5 विकेट के नुकसान पर 208 रन बनाए थे, जिसके जवाब में आयरलैंड 9 विकेट के नुकसान पर 132 रन ही बना सका। दोनों के बीच पिछला पांचवां मुकाबला 10 जून 2009 को हुआ था, जो काफी पुराना समय है, और यहां भारत ने 15 गेंद शेष रहते हुए 8 विकेट से जीत दर्ज की थी। आयरलैंड ने 18 ओवर में 8 विकेट के नुकसान पर 112 रन बनाए थे, जिसके जवाब में भारत ने 15.3 ओवर में 2 विकेट के नुकसान पर यह टारगेट हासिल कर लिया था।","pubDate":"2023-08-18 01:00:11","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Ireland: Was bowling 10 overs during rehab to prepare for World Cup: Bumrah","link":"https://www.tribuneindia.com/news/sports/india-vs-ireland-was-bowling-10-overs-during-rehab-to-prepare-for-world-cup-bumrah-535837","keywords":null,"creator":null,"video_url":null,"description":"Dublin, August 17After spending 11 months away from the game, a fit-again Jasprit Bumrah is back hungrier than ever and says he is ready to bowl long spells for India in the Asia Cup and subsequent ODI World Cup at home. Bumrah, who last played in September 2022 before lower-back stress fractures pushed him to the sidelines for the \"biggest break\" of his cricketing career, is making his much-anticipated comeback with the T20I series in Ireland. He will be required to bowl four overs per game here but speaking on the eve of the first T20I, the star pacer said the plan was always to prepare for 50-over events including the Asia Cup beginning August 31 and the World Cup beginning October 5.I was always preparing for the World Cup competition. I have been bowling 10, 12 and even 15 overs. —Jasprit Bumrah\"We were mindful of the fact there is no Test cricket till the ODI World Cup. In my rehab as well, I was not preparing for a T20 game. I was always preparing for the World Cup competition,\" Bumrah said.\"I have been bowling 10, 12 and even 15 overs. So I have bowled more overs, that way it becomes easier when less bowling is required. We kept that in mind that we are preparing for One-day competition and not a four-over competition. I have lots of overs under my belt. You have to keep working your way up,\" added Bumrah, who will captain India in the three T20Is.Bumrah said he is not holding back in the training sessions. \"I don't really think about expectations. I just want to go enjoy the game as I have come after a long break. Never been away from the game this long. I am coming back to enjoy as I love this game,\" the 29-year-old said.Self-doubt can creep in when a cricketer at the peak of his powers is forced to be away from the game for so long but Bumrah chose to look at the bright side.\"When injury takes time to heal, it can be frustrating. Instead of having self-doubt, I was thinking how to get fit and make a comeback. It is important to give the body time and respect. I never took it as a dark phase and thought my career could be over. I was looking for solutions and when solutions came I was feeling good,\" he said.","content":"PTI Dublin, August 17 After spending 11 months away from the game, a fit-again Jasprit Bumrah is back hungrier than ever and says he is ready to bowl long spells for India in the Asia Cup and subsequent ODI World Cup at home. Bumrah, who last played in September 2022 before lower-back stress fractures pushed him to the sidelines for the “biggest break” of his cricketing career, is making his much-anticipated comeback with the T20I series in Ireland. He will be required to bowl four overs per game here but speaking on the eve of the first T20I, the star pacer said the plan was always to prepare for 50-over events including the Asia Cup beginning August 31 and the World Cup beginning October 5. I was always preparing for the World Cup competition. I have been bowling 10, 12 and even 15 overs. —Jasprit Bumrah “We were mindful of the fact there is no Test cricket till the ODI World Cup. In my rehab as well, I was not preparing for a T20 game. I was always preparing for the World Cup competition,” Bumrah said. “I have been bowling 10, 12 and even 15 overs. So I have bowled more overs, that way it becomes easier when less bowling is required. We kept that in mind that we are preparing for One-day competition and not a four-over competition. I have lots of overs under my belt. You have to keep working your way up,” added Bumrah, who will captain India in the three T20Is. Bumrah said he is not holding back in the training sessions. “I don’t really think about expectations. I just want to go enjoy the game as I have come after a long break. Never been away from the game this long. I am coming back to enjoy as I love this game,” the 29-year-old said. Self-doubt can creep in when a cricketer at the peak of his powers is forced to be away from the game for so long but Bumrah chose to look at the bright side. “When injury takes time to heal, it can be frustrating. Instead of having self-doubt, I was thinking how to get fit and make a comeback. It is important to give the body time and respect. I never took it as a dark phase and thought my career could be over. I was looking for solutions and when solutions came I was feeling good,” he said. #Cricket #Jasprit Bumrah","pubDate":"2023-08-18 00:38:03","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/8/2023_8$largeimg_587951468.jpg","source_id":"tribuneindia","source_priority":7916,"country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Nigeria to receive T20 W’Cup trophy","link":"https://punchng.com/cricket-nigeria-to-receive-t20-wcup-trophy/","keywords":["Sports"],"creator":["Abiodun Adewale"],"video_url":null,"description":"Nigeria has been named as one of the three African countries for the trophy tour of the ICC Men’s T20 World Cup on August 29 and 30, ahead of this year’s championship in India, The PUNCH reports. The trophy is expected to arrive in Abuja on Tuesday, August 29, where it would be received by Read More","content":"Nigeria has been named as one of the three African countries for the trophy tour of the ICC Men’s T20 World Cup on August 29 and 30, ahead of this year’s championship in India, The PUNCH reports. The trophy is expected to arrive in Abuja on Tuesday, August 29, where it would be received by the board of the Nigeria Cricket Federation before being handed to the newly appointed Minister of Sports Development, Senator John Enoh. Also on Wednesday, August 30, the trophy would be in Lagos and would be received by Governor Babajide Sanwo-Olu and will also be on public display at the Tafawa Balewa Cricket Oval, the game’s most revered ground in the country. NCF president, Uyi Akpata, said the second coming of the ICC Men’s T20 World Cup trophy to the country is a testament to the strides of Nigerian cricket in the last five years. “Nigeria will be a major stop for the ICC Men’s T20 World Cup Trophy that is presently on tour of 18 countries globally, and that is major for us. Being the second successive time in Nigeria is a huge win for our developmental effort. Related News “I believe the back-to-back trophy tour of Nigeria, first in 2019 and now in 2023, shows how Nigeria, as an emerging cricket development hotbed, is key for the continent. And this is an appreciation to those who have, and are still sacrificing to see the game attain an enviable height in the country,” Akpata said. Nigeria has won four global developmental awards between 2019 and 2023, including qualifying for its first World Cup in 2019. This year, Nigeria was named the winner for 100 per cent Female Cricket Initiative of the Year Global Award. This was on the back of a successful girl-child campaign in Zamfara State which yielded over 20, 000 entrants in 2022. Nigeria’s Women’s senior team, the Female Yellow Greens also won the NCF Women’s T20i Invitational Tournaments for the first time this year after hosting it for four years.","pubDate":"2023-08-17 23:38:32","image_url":"https://cdn.punchng.com/wp-content/uploads/2017/01/07180053/Uyi-Akpata.jpg","source_id":"punchng","source_priority":19103,"country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps beat UAE by 19 runs in opening Twenty20","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-beat-uae-by-19-runs-in-opening-twenty20/","keywords":null,"creator":null,"video_url":null,"description":"For a brief moment it looked like UAE were in a position to achieve their biggest Twenty20 scalp and upset the Black Caps in the opening match in Dubai. But it was all too brief. Needing 47 runs off 36 balls with five wickets in hand they were a chance. Debutant Aryansh Sharma was leading the charge on 60 from 41 balls and there was certainly a sniff of an upset for the UAE - and with three other players on debut possibly their greatest win ever on the cards for the 16th ranked team in the world. But it didn’t last long as the experienced players in the Black Caps side ensured they didn’t start the back half of the year with a black mark. The hosts lost their last five wickets for 21 runs to fall 19 runs short of victory as Black Caps skipper Tim Southee finished with 5-25, his second five wicket bag in the format. Southee and James Neesham combined have played more T20 internationals than the entire UAE starting XI and the cooler heads showed in the 35 degree heat. In front of a sparse crowd at Dubai International Cricket Stadium, New Zealand made 155 for six in a mixed innings that didn’t get off to the best start. Opener Chad Bowes was dismissed first ball of the series when he edged the opening delivery from Junaid Siddique. Fellow opener Tim Seifert top scored for the Black Caps reaching his eighth T20 fifty, making 55 from 34 balls, but the rest of the top order failed to achieve one boundary between them as New Zealand slipped to 85 for five in the 13th over. They needed some late hitting from James Neesham (25 from 22), Cole McConchie (31 from 24) and Rachin Ravindra (21 from 11) to get beyond 150. Chasing 157 for victory, the UAE also lost a wicket first ball with Southee trapping Muhammad Waseem LBW. Wicketkeeper Sharma gave the UAE hope of a rare win over the T20 World Cup semifinalists but when Neesham removed him the chase fell apart. The experience of Neesham (2-15) and Mitchell Santner (2-22) showed while Kyle Jamieson (1020 from 2.4 overs) took the final wicket in his return to international cricket. Southee’s five wicket bag was his first since 2010 while UAE were the 14th different T20 opponent he has faced in his career. “It was a good game of cricket. We came to expect that. They are a growing side and they showed it tonight.” Southee said. “Number of guys have been playing cricket in different parts of the world. We had a couple of days of training and we had to adapt. When you travel, you get used to different conditions. They (UAE) are a quality side, they are improving. Youngsters playing with that sort of freedom - it is exciting.” The second match takes place 2am Sunday.","content":"For a brief moment it looked like UAE were in a position to achieve their biggest Twenty20 scalp and upset the Black Caps in the opening match in Dubai. But it was all too brief. Needing 47 runs off 36 balls with five wickets in hand they were a chance. Debutant Aryansh Sharma was leading the charge on 60 from 41 balls and there was certainly a sniff of an upset for the UAE - and with three other players on debut possibly their greatest win ever on the cards for the 16th ranked team in the world. But it didn’t last long as the experienced players in the Black Caps side ensured they didn’t start the back half of the year with a black mark. The hosts lost their last five wickets for 21 runs to fall 19 runs short of victory as Black Caps skipper Tim Southee finished with 5-25, his second five wicket bag in the format. Southee and James Neesham combined have played more T20 internationals than the entire UAE starting XI and the cooler heads showed in the 35 degree heat. In front of a sparse crowd at Dubai International Cricket Stadium, New Zealand made 155 for six in a mixed innings that didn’t get off to the best start. Opener Chad Bowes was dismissed first ball of the series when he edged the opening delivery from Junaid Siddique. Fellow opener Tim Seifert top scored for the Black Caps reaching his eighth T20 fifty, making 55 from 34 balls, but the rest of the top order failed to achieve one boundary between them as New Zealand slipped to 85 for five in the 13th over. They needed some late hitting from James Neesham (25 from 22), Cole McConchie (31 from 24) and Rachin Ravindra (21 from 11) to get beyond 150. Chasing 157 for victory, the UAE also lost a wicket first ball with Southee trapping Muhammad Waseem LBW. Wicketkeeper Sharma gave the UAE hope of a rare win over the T20 World Cup semifinalists but when Neesham removed him the chase fell apart. The experience of Neesham (2-15) and Mitchell Santner (2-22) showed while Kyle Jamieson (1020 from 2.4 overs) took the final wicket in his return to international cricket. Southee’s five wicket bag was his first since 2010 while UAE were the 14th different T20 opponent he has faced in his career. “It was a good game of cricket. We came to expect that. They are a growing side and they showed it tonight.” Southee said. “Number of guys have been playing cricket in different parts of the world. We had a couple of days of training and we had to adapt. When you travel, you get used to different conditions. They (UAE) are a quality side, they are improving. Youngsters playing with that sort of freedom - it is exciting.” The second match takes place 2am Sunday.","pubDate":"2023-08-17 20:35:19","image_url":"https://www.newstalkzb.co.nz/media/bt4fi0sx/new-zealands-tim-southee-photosport.jpg","source_id":"newstalkzb","source_priority":325733,"country":["new zealand"],"category":["sports"],"language":"english"},{"title":"IND vs IRE: भारत के लिए सीरीज का पहला T20 मैच, आयरलैंड के साथ मुकाबले में कौन होंगे फैंटेसी टीम के हीरो?","link":"https://hindi.oneindia.com/news/sports/cricket/india-vs-ireland-t20i-best-picks-captain-and-vice-captain-advice-for-fantasy-team-805817.html","keywords":null,"creator":null,"video_url":null,"description":"भारत बनाम आयरलैंड: डबलिन में पहले टी20 मैच के लिए फैंटेसी टीम के टिप्स, कप्तान और उप-कप्तान की पसंद। दोनों टीमों के खिलाड़ियों के बेस्ट पिक्स, फॉर्म गाइड, और रिकॉर्ड्स के बारे में जानें।","content":"भारत और आयरलैंड की टीमें आज डबलिन में तीन मैचों की टी20 सीरीज के साथ मैदान में उतर रही हैं, जहां पर फैंटेसी टीम बनाने के लिए फैंस में अभी से उत्सुकता है। आयरलैंड के खिलाड़ियों के बारे में कम जानकारी और भारत के नए खिलाड़ियों के चलते फैंटेसी टीम और भी दिलचस्प हो गई है। टीम इंडिया जसप्रीत बुमराह की अगुवाई में उतर रही है। ये मैच आज शाम 7 बजकर 30 मिनट पर भारतीय समयानुसार होगा। इस मैच के लिए फैंटेसी टिप्स आप यहां से हासिल कर सकते हैं। रुतुराज गायकवाड़ एक ऐसे खिलाड़ी हैं जिन्होंने आईपीएल 2023 में फैंटेसी टीम बनाने वालों को कम ही निराश किया था। वे इस बार इंटरनेशनल मंच पर भी प्वाइंट्स कमाकर देने वाले खिलाड़ी साबित हो सकते हैं। ऐसे में यशसवी जायसवाल नई सनसनी हैं जिन्होंने वेस्टइंडीज के खिलाफ बताया है कि वे टेस्ट के बाद टी20 में भी कमाल कर सकते हैं। भारत के एक और खिलाड़ी तिलक वर्मा ने भी वेस्टइंडीज दौरे पर प्रभावित किया था। वे टी20 में भारत के बेस्ट बल्लेबाज के तौर पर नजर आए थे। वहीं, आयरलैंड के हैरी टेक्टर भी फैंटेसी टीम के लिए बढ़िया चॉइस हो सकते हैं। इस मैदान पर इस खिलाड़ी का रिकॉर्ड शानदार है। कर्टिस कैंफर यहां ऑलराउंडर की भूमिका में होंगे, जो लोअर मिडिल ऑर्डर पर भरोसेमंद बल्लेबाज हैं और मददगार परिस्थितयों में गेंद को स्विंग करा सकते हैं। लॉकरेन टकर यहां छुप रुस्तम हैं क्योंकि भारत के पास निरंतरता से परफॉर्म करने वाले कीपर इस सीरीज में नहीं है। टकर अपनी बल्लेबाजी के अलावा, कीपिंग से प्वाइंट दे सकते हैं। गेंदबाजों में जसप्रीत बुमराह का चयन खुद तय है। रवि बिश्नोई के लिए भी परिस्थितियां आदर्श हैं। अर्शदीप सिंह और जोशुआ लिटिल दोनों बाए हाथ के सीमर हैं जो विपक्षी टीमों को तंग कर सकते हैं। मार्क अडायर एक हटकर किया गया चुनाव है, जिन्होंने इस मैदान पर पिछले 6 मैचों में 9 विकेट चटकाएं हैं। वे बल्लेबाजी में भी हाथ आजमा सकते हैं। बल्लेबाज- रुतुराज गायकवाड़, यशस्वी जायसवाल, तिलक वर्मा, हैरी टेक्टर, ऑलराउंडर- कर्टिस कैंफर विकेटकीपर- लॉकरेन टकर बॉलर- जसप्रीत बुमराह, रवि बिश्नोई, अर्शदीप सिंह, जोशुआ लिटिल, मार्क अडायर अर्शदीप सिंह, तिलक वर्मा, यशस्वी जायसवाल जैसे इन फॉर्म खिलाड़ियों को कप्तान या उप-कप्तान के तौर पर चुना जा सकता है।","pubDate":"2023-08-17 19:25:07","image_url":null,"source_id":"oneindia","source_priority":12404,"country":["india"],"category":["sports"],"language":"hindi"},{"title":"Kashmir Women’s Cricket League 2023 to begin Aug 19","link":"https://kashmirreader.com/2023/08/18/kashmir-womens-cricket-league-2023-to-begin-aug-19/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Renowned cricketer Mithali Raj to be Guest of Honour in final match Srinagar: Highly-anticipated Kashmir Women Cricket League is set to take place from August 19 to 26 in the Sher-e-Kashmir Stadium, Srinagar under the aegis of the 31 Sub Area & Chinar Corps. This thrilling cricket tournament featuring some of the most talented teams […]","content":"Renowned cricketer Mithali Raj to be Guest of Honour in final match Srinagar: Highly-anticipated Kashmir Women Cricket League is set to take place from August 19 to 26 in the Sher-e-Kashmir Stadium, Srinagar under the aegis of the 31 Sub Area & Chinar Corps. This thrilling cricket tournament featuring some of the most talented teams in the region will commence with opening Ceremony at 09:00 am. With an illustrious list of participants, Kashmir WCL is shaping up to be a celebration of cricket excellence. Twelve teams hailing from various parts of the region will compete over the course of eight days, showcasing their remarkable talent and passion for the game, PRO (Defence), Srinagar said in a statement issued here. The teams will sweat out for Player of the Match title in each match, Best batsmen and bowler of the tournament and Player of the Tournament title. In addition, the Winners and the Runners-up will be awarded with a Trophy and cash award. In the final match, scheduled at 02:30 pm on August 26, the world’s renowned cricketer Mithali Raj will grace the event as the esteemed Guest of Honour. Known for her exceptional talent, Mithali Raj has inspired countless cricketers around the globe and continues to be an emblem of perseverance and dedication. Her presence will undoubtedly elevate the excitement and prestige of the tournament, leaving an indelible mark on all those in attendance. Additionally, Mr Manoj Sinha, the honourable Lieutenant Governor of J&K will grace the occasion as the Chief Guest for the finals of Kashmir WCL. His notable contribution to sports and unwavering support towards nurturing talent in Kashmir makes him the perfect choice to grace this momentous occasion. As an ardent sports enthusiast, his presence will undoubtedly inspire players and spectators alike, further enhancing the tournament’s grandeur. This prestigious event holds significance for both cricket aficionados and players who have long awaited an opportunity to witness such exceptional talent up close. Chinar Corps is committed to promoting sports and empowering youth within the Valley. With a rich history of conducting successful sporting events, Chinar Corps consistently strives to provide unparalleled experiences for athletes and spectators alike. Kashmir Women’s Cricket League 2023 to begin Aug 19 added by KR Desk on 12:15 am August 18, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-17 18:45:59","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"title":"NZ to tour Bangladesh for three ODIs in build-up to World Cup","link":"https://kashmirreader.com/2023/08/18/nz-to-tour-bangladesh-for-three-odis-in-build-up-to-world-cup/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dhaka: New Zealand will tour Bangladesh for the first time in 10 years, when they travel to the country for a split ODI and Test series in September and November. The three-match ODI series will be the dress rehearsal for the two teams ahead of the World Cup in India. The World Cup begins with […]","content":"Dhaka: New Zealand will tour Bangladesh for the first time in 10 years, when they travel to the country for a split ODI and Test series in September and November. The three-match ODI series will be the dress rehearsal for the two teams ahead of the World Cup in India. The World Cup begins with last edition’s runners-up New Zealand taking on defending champions England in Ahmedabad in a repeat of the 2019 final. Bangladesh begin their World Cup journey against Afghanistan on October 7 in Dharamsala. As per the itinerary unveiled by the Bangladesh Cricket Board on Thursday, the tour is set to commence on September 21. All three ODIs are scheduled to take place at the Sher-e-Bangla National Cricket Stadium in Mirpur. The Test series is scheduled to start in late November following the conclusion of the World Cup. The venues for both Tests will be announced later. The second leg of the tour will be part of the ICC World Test Championship cycle. The red-ball clashes will take place after the World Cup. The Black Caps last toured the country in 2013 for a full series. The two-match Test series was drawn, while Bangladesh secured a 3-0 win in the three-match ODI series. The Kiwis ended their tour, winning the one-off T20I. NZ tour of Bangladesh 1st ODI: September 21, 2nd ODI: September 23, 3rd ODI: September 26 (All matches in Mirpur) 1st Test: November 28-December 2; 2nd Test: December 6-10 (Venues to be decided). PTI NZ to tour Bangladesh for three ODIs in build-up to World Cup added by Press Trust of India on 12:15 am August 18, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-08-17 18:45:36","image_url":null,"source_id":"kashmirreader","source_priority":1088812,"country":["india"],"category":["sports"],"language":"english"},{"title":"Southee takes five as New Zealand edge spirited UAE","link":"https://a-sports.tv/southee-five-new-zealand-edge-uae/","keywords":["Cricket","Sports","Top News","Top Picks","New Zealand vs UAE","Tim Southee","UAE vs New Zealand"],"creator":["A Sports"],"video_url":null,"description":"DUBAI: Tim Southee led New Zealand from the front with an economical five-wicket haul which devoided the United Arab Emirates (UAE) from pulling off a stunning victory. Chasing 156, the home side fell just 19 runs short and were bundled out for 136 despite Aryansh Sharma’s brisk half-century. The UAE were in command midway through […] The post Southee takes five as New Zealand edge spirited UAE appeared first on ASports.tv.","content":"DUBAI: Tim Southee led New Zealand from the front with an economical five-wicket haul which devoided the United Arab Emirates (UAE) from pulling off a stunning victory. Chasing 156, the home side fell just 19 runs short and were bundled out for 136 despite Aryansh Sharma’s brisk half-century. The UAE were in command midway through the pursuit as they were 84/3 with Sharma and Ansh Tandon at the crease. However, the wickets kept tumbling at an alarming rate and they were consequently bowled out in the final over. Sharma waged a lone battle for the hosts with a 43-ball 60, laced up with nine boundaries and a six. Besides him, the next best run-getters for the UAE were Ali Naseer (16) while Asif Khan and Vriitya Arvind scored 13 each. However, the six of their batters failed to make it into the double figures. New Zealand captain Tim Southee returned astonishing figures of 5/25, followed by two each by James Neesham and Mitchell Santner. Put into bat first, New Zealand registered a commendable total of 155/6 on the board at the back of a quickfire 55-run knock by Tim Seifert. Seifert recovered New Zealand from an early blow after Junaid Siddique dismissed Chad Bowes on the first delivery of the innings. He then knitted a 51-run partnership with Dane Cleaver (4) before both perished in quick successions to leave New Zealand reeling at 60/3 in the eighth over. Seifert remained the top-scorer for the New Zealand with a 34-ball 55, laced up with two boundaries and three sixes. New Zealand then lost three more wickets at relugar intervals and had slipped to 109/6 in 15.2 overs before Cole McConchie and Rachin Ravindra added vital runs at the death. McConchie played an unbeaten cameo of 31 in 24 deliveries while Ravindra made a brisk 11-ball 21. For the UAE, Basil Hameed and Junaid Siddique bagged two wickets each while Mohammed Faraazuddin made one scalp each. READ: PCB announces first-ever domestic contracts for women cricketers","pubDate":"2023-08-17 18:19:58","image_url":null,"source_id":"arynews","source_priority":41852,"country":["pakistan"],"category":["sports"],"language":"english"}]}