{"newsArray":[{"title":"Squamish Cricket Club clobbers West Vancouver in first away game","link":"https://www.nsnews.com/local-sports/squamish-cricket-club-clobbers-west-vancouver-in-first-away-game-5270720","keywords":null,"creator":["Will Johnson"],"video_url":null,"description":"Directors of new team hope to create multi-generational legacy.","content":null,"pubDate":"2022-04-15 22:00:00","full_description":"They’re the first cricket team ever established in the Sea to Sky Corridor, and they plan to be around for generations to come. Established last November, the Squamish Cricket Club consists of a few dozen passionate players training out of Brendan Park, and their founding directors are dreaming big following their successful performance against the West Vancouver Cricket Club . The April 10 competition was their first away game ever. “We bowled first and held them to 138 runs. We batted next, and our opening pair, Rudi Botha and Koushik Sridhar did really well. Between the two of them, they had over 100 runs, so of the 139 runs we needed they were at bat for over 100 of them,” said founding director Taurean McCarthy, who acted as captain for the day. “We ended up beating them by six wickets. We got all 11 players out, while they only got five of ours out. I think they were a little shocked by the quality of players we have in Squamish.” Going into the event, the directors weren’t sure what to expect. Many of the players were new to the game, some not speaking English, or hadn’t experienced a competition before. Going up against the West Vancouver club, an 80-year-old institution with a clubhouse and permanent venue, gave them perspective on where they’d like to be decades from now. According to McCarthy, it felt a little like David toppling Goliath. “Many of our players hadn’t ever played with a real hard leather cricket ball before, so that’s part of why it was so exciting to get out there on their real pitch and give our players some experience. There’s a heightened level of difficulty when you play with a harder ball, but it’s more fun and a lot more goes into it,” he said. McCarthy was captain for the day, and at one point, he invited his players to reflect on their place in history. Comparing them to West Vancouver, he asked them to imagine what the local club could look like 70 or 80 years in the future. “I said to them, ‘this is our first game ever, and in 70 years, you could be out there watching your grandkids play for Squamish.' We kept the ball from the game and got all the players to sign it, and it’s going to be kept at our clubhouse at Howe Sound Brewing. We’re trying to create history, so when people look back their names will be there for everyone to see,” he said. The club has a huge amount of diversity, according to the directors, thanks in part to the recruitment efforts of Chani Singh — the local owner of Squamish Green Taxi, and an influential member within the South Asian community. They have players from countries such as Sri Lanka, Bangladesh, India, England, and Australia, to name only a few. Now they’re hoping to attract more female players, and ideally a female director, as well as more participants of varied ages. “Not only women, but people of all sexual orientations and gender identities. Everyone is welcome. Some people still think cricket is very much part of that European culture where it’s a man’s sport where you drink beer and be macho, but this sport isn’t about that at all anymore. And it shouldn’t be,” said founding director Ben Cole. They’re seeing a lot of overlap with other sports, baseball in particular, with players participating in both sports. With 160 members in their Facebook group, they’ve had 71 members join the team and 37 sign the waiver required to compete. Cole said they’re now looking into linking up with the local middle and high school to do training sessions in school and recruit new players. “We want this to be a multi-generational project. It’s not just some guys in their 30s and 40s growing old, we want this to have a long-lasting effect in the community.” Find the club at Squamish Cricket Club on Facebook.","image_url":"https://www.vmcdn.ca/f/files/squamishchief/files/kevin-dsouza1april-2022.JPG;w=960","source_id":"nsnews","country":["canada"],"category":["sports"],"language":"english"},{"title":"Aussies face slow start in IPL","link":"https://www.cairnspost.com.au/sport/cricket/aussies-face-slow-start-in-ipl/video/ac61eb30783d2692546b808dcf03b471","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Aaron Finch struggled to score in Kolkata's IPL clash with Hyderabad, dismissed for 7 runs. While Pat Cummins claimed his first wicket in three games, bowling out Abhishek Sharma.","content":null,"pubDate":"2022-04-15 21:54:20","full_description":null,"image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Mithali won't quit international cricket scene so soon","link":"https://www.thehansindia.com/sports/mithali-wont-quit-international-cricket-scene-so-soon-738305","keywords":["Sports,Today NewsPaper"],"creator":["Bharat Sharma"],"video_url":null,"description":"With ‘lot of time to decide her international future’, Indian star to play in Women's Senior T20 Trophy","content":"Mithali won't quit international cricket scene so soonMithali won't quit international cricket scene so soonNew Delhi: Speculations rife about her international future, India's Test and ODI skipper Mithali Raj will be turning up for Railways at the Women's Senior T20 Trophy beginning on April 18 in what will be her first competitive event since the Women's World Cup.The future of stalwarts Mithali and Jhulan Goswami have been a subject of debate since India's early exit from the World Cup in New Zealand last month. While Jhulan is recovering from a side strain that she suffered during the global event, Mithali will groom the next generation of players in the Railways squad. Both are 39 and are at the business end of their illustrious careers. \"Mithali will be there to guide the younger players. As a senior player, she understands her role really well. Anyway, she never misses domestic assignments when not on national duty,\" a BCCI source told PTI. Mithali, who is the leading run-getter in international cricket, had captained the Railways team to the title in the T20 competition last year. Her international T20 career came to an end in 2019. As far has her ODI and Test future is concerned, the source added: \"There is no international cricket lined up in the near future. She has a lot of time to think over her future.\" India's next confirmed international assignment is in September when they play three T20s and as many ODIs in England after the Commonwealth Games in July-August. Majority of the players who were part of India's World Cup squad will take part in the domestic event which will be held in a bio-bubble across six venues. That also includes India T20 captain Harmanpreet Kaur. The BCCI recently refused to give NOC to a few leading India players for the Fairbreak Invitational in Dubai as it wanted them to be available for the Women's T20 Trophy and the following Women's T20 Challenge which will be held alongside the IPL play-offs.","pubDate":"2022-04-15 20:00:02","full_description":"Mithali won't quit international cricket scene so soon New Delhi: Speculations rife about her international future, India's Test and ODI skipper Mithali Raj will be turning up for Railways at the Women's Senior T20 Trophy beginning on April 18 in what will be her first competitive event since the Women's World Cup. The future of stalwarts Mithali and Jhulan Goswami have been a subject of debate since India's early exit from the World Cup in New Zealand last month. While Jhulan is recovering from a side strain that she suffered during the global event, Mithali will groom the next generation of players in the Railways squad. Both are 39 and are at the business end of their illustrious careers. \"Mithali will be there to guide the younger players. As a senior player, she understands her role really well. Anyway, she never misses domestic assignments when not on national duty,\" a BCCI source told PTI. Mithali, who is the leading run-getter in international cricket, had captained the Railways team to the title in the T20 competition last year. Her international T20 career came to an end in 2019. As far has her ODI and Test future is concerned, the source added: \"There is no international cricket lined up in the near future. She has a lot of time to think over her future.\" India's next confirmed international assignment is in September when they play three T20s and as many ODIs in England after the Commonwealth Games in July-August. Majority of the players who were part of India's World Cup squad will take part in the domestic event which will be held in a bio-bubble across six venues. That also includes India T20 captain Harmanpreet Kaur. The BCCI recently refused to give NOC to a few leading India players for the Fairbreak Invitational in Dubai as it wanted them to be available for the Women's T20 Trophy and the following Women's T20 Challenge which will be held alongside the IPL play-offs.","image_url":"https://assets.thehansindia.com/h-upload/2022/04/15/500x300_1287221-mithl.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Delhi vs RCB Head to Head in IPL history: DC vs RCB stats and records 2022 IPL","link":"https://thesportsrush.com/cricket-news-delhi-vs-rcb-head-to-head-in-ipl-history-dc-vs-rcb-stats-and-records-2022-ipl/","keywords":["Cricket","Delhi Capitals","IPL 2022","RCB","DC","Indian Premier League","Royal Challengers Bangalore"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Delhi vs RCB Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 27. The 27th match of the ongoing 15th season of the Indian Premier League will be played between Delhi Capitals and Royal Challengers Bangalore at the Wankhede Stadium tomorrow. Night match of… The post Delhi vs RCB Head to Head in IPL history: DC vs RCB stats and records 2022 IPL appeared first on The SportsRush.","content":"Delhi vs RCB Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 27. The 27th match of the ongoing 15th season of the Indian Premier League will be played between Delhi Capitals and Royal Challengers Bangalore at the Wankhede Stadium tomorrow. Night match of the fifth IPL 2022 double-header day, this match will follow Mumbai Indians vs Lucknow Super Giants contest at the Brabourne Stadium. Having won and lost a couple of matches each this season, Capitals are at the eighth position on the points table. Royal Challengers, on the other hand, are at the sixth position on the back of winning three and losing two out of their five matches till now. Delhi, who’ve played 12 IPL matches at the Wankhede Stadium since 2008, have won five and lost seven to not have the best of records here. On similar lines, even Bangalore haven’t been able to dominate proceedings at this venue winning five and losing eight out of their 13 matches till date. The Fizz is spot #YehHaiNayiDilli | #IPL2022 #TATAIPL | #IPL | #DelhiCapitals | #DCOnThePitch | @Mustafiz90 | #OctaRoarsForDC pic.twitter.com/etsd5ndNBj — Delhi Capitals (@DelhiCapitals) April 15, 2022 Delhi vs RCB Head to Head in IPL history Total number of matches played: 28 Matches won by DC: 10 Matches won by RCB: 17 Matches played in April: 14 (DC 6, RCB 8) Matches played in India: 22 (DC 7, RCB 14) Matches played at Wankhede Stadium: 0 (DC 0, RCB 0) DC average score against RCB: 163 RCB average score against DC: 155 Most runs for DC: 387 (Rishabh Pant) Most runs for RCB: 937 (Virat Kohli) Most wickets for DC: 7 (Anrich Nortje) Most wickets for RCB: 9 (Harshal Patel) Most catches for DC: 8 (Rishabh Pant) Most catches for RCB: 14 (Virat Kohli) RCB, who had won both their matches against DC last season, had played their last encounter at the Dubai International Cricket Stadium against them. The tense chase is fondly remembered for the then RCB wicket-keeper batter Srikar Bharat hitting a last-ball six off Avesh Khan to seal a 165-run chase. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches). The post Delhi vs RCB Head to Head in IPL history: DC vs RCB stats and records 2022 IPL appeared first on The SportsRush.","pubDate":"2022-04-15 19:03:02","full_description":"Delhi vs RCB Head to Head in IPL history: The SportsRush presents for you the Head to Head statistics for IPL 2022 Match 27. The 27th match of the ongoing 15th season of the Indian Premier League will be played between Delhi Capitals and Royal Challengers Bangalore at the Wankhede Stadium tomorrow. Night match of the fifth IPL 2022 double-header day, this match will follow Mumbai Indians vs Lucknow Super Giants contest at the Brabourne Stadium. Having won and lost a couple of matches each this season, Capitals are at the eighth position on the points table. Royal Challengers, on the other hand, are at the sixth position on the back of winning three and losing two out of their five matches till now. Delhi, who’ve played 12 IPL matches at the Wankhede Stadium since 2008, have won five and lost seven to not have the best of records here. On similar lines, even Bangalore haven’t been able to dominate proceedings at this venue winning five and losing eight out of their 13 matches till date. The Fizz is spot 🔛 🎯 #YehHaiNayiDilli | #IPL2022 #TATAIPL | #IPL | #DelhiCapitals | #DCOnThePitch | @Mustafiz90 | #OctaRoarsForDC pic.twitter.com/etsd5ndNBj — Delhi Capitals (@DelhiCapitals) April 15, 2022 Total number of matches played: 28 Matches won by DC: 10 Matches won by RCB: 17 Matches played in April: 14 (DC 6, RCB 8) Matches played in India: 22 (DC 7, RCB 14) Matches played at Wankhede Stadium: 0 (DC 0, RCB 0) DC average score against RCB: 163 RCB average score against DC: 155 Most runs for DC: 387 (Rishabh Pant) Most runs for RCB: 937 (Virat Kohli) Most wickets for DC: 7 (Anrich Nortje) Most wickets for RCB: 9 (Harshal Patel) Most catches for DC: 8 (Rishabh Pant) Most catches for RCB: 14 (Virat Kohli) RCB, who had won both their matches against DC last season, had played their last encounter at the Dubai International Cricket Stadium against them. The tense chase is fondly remembered for the then RCB wicket-keeper batter Srikar Bharat hitting a last-ball six off Avesh Khan to seal a 165-run chase. NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-16-20-updates-2892040","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 17:53:49","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 17.5 overs, Sunrisers Hyderabad, chasing a target of 176, are 176/3. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Kolkata Knight Riders. Everything related to Sunrisers Hyderabad and Kolkata Knight Riders match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Kolkata Knight Riders live score. Do check for Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. Presentation coming up... Aiden Markram is up for a chat. He says it feels good, and it feels nice when a guy like Tripathi bats, but he feels good to win here. Mentions that he is happy to stay till the end and finish it. Says that he does not know what has clicked for him, things have fallen into place and he is happy to get over the line. Further adds that Tripathi was adding the most of the runs but the partnership was more important. Shreyas Iyer, the skipper of Kolkata says that he is feeling drained and disappointed after putting in a good total. Mentions that Tripathi came on and didn't let the bowlers settle down and the batters did well to tackle the new ball as well. Adds that they were well settled at the end of the Powerplay and put a great effort as a batting unit but it was a bad day with the ball. Nothing much to write for Kolkata, they did well to create pressure early on when the ball was swinging but once the ball was coming nicely onto the bat, it was just a procession for them and they waited rather than creating any chances. Sunil Narine was the only one economical as the other bowlers were taken to the cleaners. Andre Russell took two wickets while Cummins grabbed one but leaked runs at a high rate. Hyderabad were under a bit of pressure as they lost both their openers inside the Powerplay but Tripathi and Markram combined to put a stand of 94 runs. It was Tripathi who took on the bowlers and played some beautiful shots and eventually got to his fifty. Once he fell, Markram took the charge and finished things off without much trouble. A superb batting performance by Hyderabad. A comfortable win for Hyderabad and they continue their merry way as they win their third consecutive match. Two losses at the start but have been clinical chasing in their last three matches. It was a hard outing for Kolkata who tried hard with the ball but failed to create any pressure. 17.5 overs (6 Runs) SIX! Yes, he can! A shorter ball, around middle and leg. Aiden Markram pulls it over deep square leg for a maximum. Hyderabad win by 7 wickets! 17.4 overs (6 Runs) SIX! Bigger and better! A fullish ball, outside off. Aiden Markram heaves it over deep mid-wicket for a biggie. 6 runs needed now. Can he finish it off with a biggie? 17.3 overs (4 Runs) FOUR! Nicely done! Fuller ball, around middle. Aiden Markram whips it towards deep mid-wicket for a boundary. 17.2 overs (1 Run) Back of a length, outside off. Nicholas Pooran taps it towards cover and scampers through to the other end. 17.1 overs (1 Run) On a length, around middle. Aiden Markram punches it down to long on and rotates the strike. 16.6 overs (1 Run) Tad fuller, outside off. Aiden Markram drives it towards sweeper cover for a single. 16.5 overs (1 Run) Mix-up...but no harm done! Short delivery, around middle and leg. Nicholas Pooran knocks it towards mid-wicket. He leaves his crease late for a run. Sunil Narine chases the ball, and has a shy at the non-striker's end but he misses. 16.4 overs (1 Run) Shorter delivery, around middle. Aiden Markram strokes it down to long on for a single. Fifty for Aiden Markram! A well-composed knock from him! 16.3 overs (0 Run) Quicker, flatter, around middle. Aiden Markram hangs back and taps it towards cover-point. 16.2 overs (1 Run) Outside off, shortish delivery again. Nicholas Pooran knocks it to long on for a single. 16.1 overs (1 Run) Back of a length, outside off. Aiden Markram punches it towards sweeper cover for a single. 15.6 overs (0 Run) On middle, short ball. Nicholas Pooran defends it out. 23 needed off 24 balls. 15.5 overs (1 Run) Quicker, flatter, outside off. Aiden Markram pushes it towards cover for a single. 15.4 overs (6 Runs) SIX! BOOM! Another back-of-a-length delivery, around middle. Aiden Markram swivels and pulls it over deep mid-wicket for a biggie. 15.3 overs (4 Runs) FOUR! Lucky boundary! Shortish ball, wide of off. Aiden Markram looks to cut this away, but the ball goes off the under edge through the keeper's leg towards the fence for a boundary. 15.2 overs (1 Run) Fuller ball, around middle. Nicholas Pooran sweeps it towards deep square leg and rotates the strike. 15.1 overs (1 Run) Shorter ball, around middle. Aiden Markram swivels and pulls it towards deep square leg for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856618209727381.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-11-15-updates-2891976","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 17:16:04","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, Sunrisers Hyderabad, chasing a target of 176, are 142/3. The live updates of Sunrisers Hyderabad vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Kolkata Knight Riders, Sunrisers Hyderabad vs Kolkata Knight Riders live score, Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (4 Runs) Four runs! Bonus runs! A length ball, slower and outside off. Pooran looks to push but misses. The keeper gets low to collect but the ball bounces in front of him and it rolls through his legs for a boundary. Andre Russell is not happy. 36 needed in 30 balls. 14.5 overs (1 Run) On the pads, this is hit in front of square on the leg side for a single. 14.4 overs (1 Run) Short in length and on the hips. Pooran wrists it to deep square leg for a single. 14.4 overs (1 Run) Wide! A length ball, angling outside off. Pooran swings and misses. 14.3 overs (0 Run) Around off. Pooran punches it to point. Nicholas Pooran comes to the crease. 14.2 overs (0 Run) OUT! TAKEN! Finally Kolkata find a way to get the breakthrough but is it too late? Short of a length and around off, slower as well. Tripathi pulls it but fails to power it much. Hits it straight to long on where Venkatesh Iyer takes it. 14.1 overs (6 Runs) SIX! Hammered! Tripathi is enjoying at the moment! A length ball, angling on middle. Tripathi gets low and hooks it well over square leg for a biggie. Andre Russell (1-0-11-1) comes back into the attack. 13.6 overs (4 Runs) FOUR! Make it three in a row! Hyderabad taking the charge now! On a length again, outside off. Markram punches it to covers. The fielder there runs to his right and dives but the ball wins the race. 13.5 overs (4 Runs) FOUR! Two in a row! Length ball, outside off. Markram cuts it through covers for a boundary. 13.4 overs (4 Runs) FOUR! Just evades the keeper! Short ball, on middle. Markram looks to pull but gets a top edge to short fine leg. The keeper runs there and almost takes it but fumbles in the end. A boundary. 13.3 overs (1 Run) Short in length and on middle, slower one this. Tripathi pulls it to deep square leg for one. 13.2 overs (0 Run) A length ball, outside off. Tripathi opens the face of the bat and guides it to backward point. 13.1 overs (1 Run) Full ball, tailing back in around off. Markram looks to push but gets an inside edge to fine leg for a single. Strategic break! Hyderabad are still ahead in this game for now. Rahul Tripathi is scoring runs at a brisk rate, while Aiden Markram is playing the anchor role. Kolkata have managed to bowl two tight overs, but they need wickets to take control of this game. 63 runs needed off 42 balls. Also, Umesh Yadav comes back into the attack. 12.6 overs (1 Run) Flatter, quicker and outside off. Aiden chops it to point for a single. 12.5 overs (0 Run) Short ball, outside off, spinning away. Markram cuts it late and to short third man. 12.4 overs (1 Run) Full and on off, eased down to long off for a single. 12.3 overs (0 Run) Flighted ball, tailing around leg. Tripathi gets lot to paddle it to short fine leg. 12.2 overs (0 Run) Angling on the pads. Tripathi whips it but straight to short fine leg. 12.1 overs (2 Runs) Length ball, on off. Tripathi steps forward and drills it to deep mid-wicket for a couple of runs. 11.6 overs (1 Run) Tad short and on middle. Tripathi pulls it aerially and to deep backward square leg for a single. 11.5 overs (0 Run) Length ball, around off. Tripathi gets on top of the bounce and hits it to point. 11.4 overs (1 Run) Fuller and outside off. Markram drives it nicely to mid off and will settle with a single. 11.3 overs (1 Run) On a length and on off, Aiden pushes it to long on for a run. 11.2 overs (1 Run) Short and on leg, pulled away to deep square leg for a single. 11.1 overs (0 Run) On a length and on off. Markram punches it firmly but finds short mid-wicket. 10.6 overs (0 Run) Floated and around off. Tripathi works it to point. 10.5 overs (2 Runs) Flatter and on middle. Tripathi clips it with soft hands to square leg and comes back for the second easily. Hyderabad is cruising through. 10.4 overs (1 Run) Darted on the pads, this is flicked to square leg for a run. 10.3 overs (1 Run) On middle. Tripathi tucks it to square leg for a single. 10.2 overs (0 Run) Tossed up, on off. Kept out. 10.1 overs (6 Runs) SIX! In the air...and clears the fence with ease! Tossed up, full and on middle. Rahul Tripathi looks to slog-sweep it, does not middle it but gets enough to clear the fence. 100 up as well!","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856595563215999.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-6-10-updates-2891892","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 17:01:49","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.2 overs, Sunrisers Hyderabad, chasing a target of 176, are 101/2. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Kolkata Knight Riders. Everything related to Sunrisers Hyderabad and Kolkata Knight Riders match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Kolkata Knight Riders live score. Do check for Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (1 Run) 1 run. 9.5 overs (1 Run) Fuller, flatter, around middle. Aiden Markram flicks it towards deep mid-wicket. Single taken! 9.4 overs (4 Runs) FOUR! Lovely shot! Fullish delivery, outside off. Aiden Markram goes inside out over cover for a boundary. 9.3 overs (6 Runs) SIX! Up and away! A fuller ball, slower through the air, around midde. Aiden Markram gets down on his knee and sweeps it over deep mid-wicket for a biggie! 9.2 overs (1 Run) Spinning in, around middle, short again. Rahul Tripathi knocks it towards long on for a single. 9.1 overs (1 Run) Drifting in, shorter ball, around middle. Aiden Markram pushes it towards long off for a single. 8.6 overs (1 Run) Full delivery, around middle. Aiden Markram knocks it down to long on for a single. 8.5 overs (0 Run) Quicker again, outside off, fuller ball. Aiden Markram looks to cut this away, but he misses. 8.4 overs (1 Run) Quicker, flatter, on middle. Rahul Tripathi tucks it towards mid-wicket and takes a quick single. 8.3 overs (0 Run) Fuller ball, outside off. Rahul Tripathi presses forward and taps it towards point. 8.2 overs (1 Run) Spinning away, outside off, short delivery. Aiden Markram pushes it off the back foot towards sweeper cover for a single. 8.1 overs (1 Run) Sunil Narine begins with a shortish ball, around middle. Rahul Tripathi tucks it towards square leg for a single. Drinks. Rahul Tripathi is looking in superb form and he just needs someone to hang on the other end. 99 needed in 72 balls and Hyderabad will fancy from here. Also, Sunil Narine is into the attack. 7.6 overs (0 Run) Tad shorter, outside off. Aiden Markram pushes it towards extra-cover. 18 runs off the over! 7.5 overs (1 Run) Quicker, shorter, outside off. Rahul Tripathi guides it towards third man and takes a quick single. 7.4 overs (6 Runs) SIX! And again! He is making this look so easy! Pitches it up again, outside off. Rahul Tripathi once again, gets down on his knee and smashes it inside out over cover for another biggie! 7.3 overs (6 Runs) SIX! This one is even bigger and better! Slower through the air, full, outside off. Rahul Tripathi gets down on his knee and lifts it high over extra cover for a biggie. He holds the pose as well! 7.2 overs (4 Runs) FOUR! WOW! Beautiful shot! A fuller ball, outside off. Rahul Tripathi leans and drives it over cover for a boundary. 7.1 overs (1 Run) Fuller delivery, around middle and leg. Aiden Markram leans and taps it towards mid-wicket for a single. Varun Chakaravarthy to bowl. 6.6 overs (6 Runs) SIX! Up and over! Shortish delivery, width on offer. Rahul Tripathi stays in his crease and upper cuts it over backward point for a biggie! 6.5 overs (1 Run) Pitches it up now, around middle. Aiden Markram pushes it towards extra-cover and takes a single. 6.4 overs (1 Run) On a length, outside off. Rahul Tripathi guides it towards third man for a single. 6.3 overs (4 Runs) FOUR! Edgy runs! A short delivery, around off. Rahul Tripathi goes for the pull shot but the ball goes off the top edge over the keeper's head towards the fence for a boundary. 6.2 overs (0 Run) Fuller ball, around middle. Rahul Tripathi pushes it towards the fielder at cover. 6.1 overs (1 Run) Aman Khan begins with a low full toss, around middle. Aiden Markram knocks it to long on for a single. 5.6 overs (0 Run) Touch short again, around middle. Rahul Tripathi pulls it to the fielder at mid-wicket. Hyderabad are 46 for 2 at the end of the Powerplay. 5.5 overs (6 Runs) SIX! BOOM! Another short delivery, on the body. Rahul Tripathi swivels and pulls it over deep square leg for a biggie. 5.4 overs (1 Run) Back of a length, outside off. Aiden Markram pushes it off the back foot towards cover for a single. 5.3 overs (0 Run) Andre Russell drops it short again, around middle. Aiden Markram ducks underneath it. Who walks out? Aiden Markram it is. 5.2 overs (0 Run) OUT! CHOPPED ON! Andre Russell gets a big wicket here! The skipper of Hyderabad departs! Marginally short, around off. Kane Williamson looks to pull this, but the ball goes off the inside edge and back onto the stumps. Good start for Kolkata! 5.1 overs (4 Runs) FOUR! Andre Russell begins with a shorter ball, around middle. Kane Williamson pulls it over mid-wicket for a boundary.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856587014133937.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cheteshwar Pujara's poor form continues in County cricket, falls cheaply on Sussex debut","link":"https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-s-poor-form-continues-in-county-cricket-falls-cheaply-on-sussex-debut-1938075-2022-04-15?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Pujara's poor form continues in County cricket, falls cheaply on Sussex debut","content":null,"pubDate":"2022-04-15 16:49:24","full_description":"Cheteshwar Pujara's dismal run with the bat continued in County Championship 2022 as the senior India batter managed to score only six runs off 15 deliveries on his Sussex debut. Pujara, who was playing his first innings in County Championship 2022, was dismissed in the 24th over on day two of the division two game against Derbyshire, who amassed 505 in their first innings. It was not the best of starts to a county stint for Pujara, who needs a bagful of runs to make a comeback into the Indian Test team. The veteran batter was dropped from the national team following the series in South Africa. Ajinkya Rahane was also ignored for the home series against Sri Lanka. Star Pakistan keeper Mohammad Rizwan is also in Sussex's playing eleven. At the tea break, the away team was 92 for four, trailing Derbyshire by 413 runs. Pujara is playing in England after failing to find buyers at the Indian Premier League mega auction, which was held in February 2022. Pujara did not travel to England for a county stint last year, despite India's tour of England, as he was bought by Chennai Super Kings at the IPL 2021 auction. Pujara was axed from India's Test side for the 2-match series against Sri Lanka at home after an ordinary performance during India's tour of South Africa earlier this year. However, India's national selection committee chairman Chetan Sharma said the door would be open for Pujara as well as Ajinkya Rahane, who also faced the ax. Pujara replaced Australia's Travis Head as the overseas batter for Sussex in the upcoming county and one-day tournament. Live TV --- ENDS --- Also Read | Deepak Chahar pens note after IPL 2022 heartbreak: Really wanted to play, will come back stronger","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-1-5-updates-2891830","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 16:23:37","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.2 overs, Sunrisers Hyderabad, chasing a target of 176, are 39/2. The live updates of Sunrisers Hyderabad vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Kolkata Knight Riders, Sunrisers Hyderabad vs Kolkata Knight Riders live score, Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (1 Run) Outside off. Kane guides it to third man for a run. 4.6 overs (1 Run) Wide! A length ball, outside off, it shapes away late and Kane Williamson misses his cut. 4.5 overs (0 Run) Kane Williamson punches this length ball straight to point. 4.4 overs (0 Run) On a length and outside off. Kane Williamson charges down and looks to push but misses. 4.3 overs (4 Runs) FOUR! Much needed! Short of a length and on middle. Kane Williamson reads it quickly and goes on the back foot, pulls it to deep square leg for a boundary. 4.2 overs (1 Run) Length ball, outside off. Tripathi dabs it with soft hands to the slip cordon for another run. 4.1 overs (1 Run) Another quick single! Hyderabad living dangerously. Length ball, on off. Kane Williamson taps it in front of cover-point and runs across for a quick single. Yadav collects it and has a shy at his end but misses. 3.6 overs (1 Run) Around off again. Kane Williamson gets on his toes as he drops it to covers. Rahul Tripathi calls for a single and makes his ground on time. 3.5 overs (0 Run) Length ball, on off. Kane Williamson defends it to covers. 3.5 overs (5 Runs) Five wides! Bonus runs! A pacy short ball, on middle. Kane Williamson sits under it. Sheldon Jackson, the keeper jumps but the ball is not in his reach and it races away to the fence. 3.4 overs (0 Run) Touch fuller and around off. Defended back to Cummins. 3.3 overs (1 Run) Short of a length and on middle. Tripathi hops and defends under his eyes. The ball bounces just over the stumps and wide of the keeper. The batters take a single. 3.2 overs (4 Runs) FOUR! Proper timing there! Fullish and outside off. Tripathi lofts it to extra-cover, a couple of bounces and into the fence. Holds the pose as well. 3.1 overs (1 Run) Full and slanting on middle. Kane Williamson pushes it to mid on for an easy single. 2.6 overs (1 Run) Short of a length and outside off. Kane Williamson knocks it through point for a single. 2.5 overs (0 Run) On middle. Blocked out. 2.4 overs (0 Run) A bit of mix-up but no damage done in the end! Length and on middle. Kane Williamson tucks it to mid-wicket and there is a slight yes or no moment but both get back in their respective crease. The fielder there came quickly to the ball to stop the run. 2.3 overs (0 Run) A length ball, on middle, it jags back in. Kane Williamson looks to defend but gets beaten on the inside edge and gets rapped on the pads. Going down... 2.2 overs (1 Run) Length and on off. Tripathi taps it in front of cover for a quick single. 2.1 overs (4 Runs) FOUR! Full and drifting on the pads. Tripathi flicks it wide of deep square leg for a boundary. Lovely shot. 1.6 overs (4 Runs) FOUR! First boundary off the innings! A length ball, outside off. Kane Williamson hangs his bat out and plays with soft hands to the slip cordon. The ball beats both the slip fielders as the ball races in-between them and into the fence. 1.5 overs (1 Run) A length ball, outside off. Tripathi shuffles and looks to play the lap shot but miscues it to square leg for a single. 1.5 overs (1 Run) Wide! A length ball, slanting down the leg side. A wide given. Rahul Tripathi walks out to bat at number 3. 1.4 overs (0 Run) OUT! TIMBER! Cummins strikes and opens the wickets column. A length ball, from 'round the wicket and outside off. Sharma hangs on the back foot and looks to punch but gets a thick inside edge and it ricochets back onto the stumps. Abhishek Sharma was clearly struggling to time the ball. 1.3 overs (0 Run) Extra bounce there at 137 clicks, outside off. Sharma looks to slash at it but misses. 1.2 overs (0 Run) On a length and outside off. Sharma mistimes his punch there. The ball rolls back on the deck. 1.1 overs (0 Run) Short of a length and outside off. Abhishek looks to cut but bottom edges it to the right of the keeper, Sheldon Jackson dives to that side and stops it. Who will bowl from the other end? Pat Cummins it is! 0.6 over (1 Run) A single to end the over! Length and on off. Sharma pushes it off the inner half of the bat and to mid on and will keep the strike. 0.5 over (0 Run) This is outside off. Sharma taps it to point. 0.4 over (0 Run) Length and on middle. Sharma tucks it to mid-wicket. 0.3 over (0 Run) Length and outside off. Sharma guides it straight to point. 0.2 over (2 Runs) On the hips, Sharma tickles it fine to the fine leg fence and the fielder there does well to stop it. Two runs taken. 0.1 over (0 Run) A length ball, angling outside off, nips away slightly. Sharma has a feel for it but pulls his bat out in time.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856564091731684.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root’s sad but inevitable departure leaves England with huge gaps at the top | Ali Martin","link":"https://www.theguardian.com/sport/blog/2022/apr/15/joe-roots-sad-but-inevitable-departure-leaves-england-with-huge-gaps-at-the-top","keywords":["England cricket team","Joe Root","Cricket","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Captain’s brave decision to step down exacerbates an already worrying leadership vacuum in men’s cricketThere are seven weeks to go until the first Test against New Zealand at Lord’s and English cricket is without a permanent chair, a managing director of men’s cricket, a head coach, a selector and now a captain. Things may start to move quickly on the managing director front in the coming days, but it is still a remarkable leadership vacuum.Joe Root’s decision to step down on Good Friday was much like Alastair Cook’s five years ago; a race having been run and the eventual realisation that a fresh voice was required in the dressing room. Similarly, the news was broken via official channels despite both men sharing it with teammates in advance, with the lack of a leak underlining the regard in which they were held.There was also, like Cook, a stated desire from Root to still give everything to the cause. The 31-year-old may have had shortcomings as a leader and a tactician, all the while working with a talent pool shrunk by English cricket’s lurch towards the white ball formats and during a global pandemic. But his personal form over the past 12 months has been celestial and his lack of ego is such that his replacement - most likely Ben Stokes - will get a selfless, trustworthy senior player in the ranks who is unlikely to brood or cause disruption. Continue reading...","content":null,"pubDate":"2022-04-15 15:48:34","full_description":"T here are seven weeks to go until the first Test against New Zealand at Lord’s and English cricket is without a permanent chair, a managing director of men’s cricket, a head coach, a selector and now a captain. Things may start to move quickly on the managing director front in the coming days, but it is still a remarkable leadership vacuum. Joe Root’s decision to step down on Good Friday was much like Alastair Cook’s five years ago; a race having been run and the eventual realisation that a fresh voice was required in the dressing room. Similarly, the news was broken via official channels despite both men sharing it with teammates in advance, with the lack of a leak underlining the regard in which they were held. There was also, like Cook, a stated desire from Root to still give everything to the cause. The 31-year-old may have had shortcomings as a leader and a tactician, all the while working with a talent pool shrunk by English cricket’s lurch towards the white ball formats and during a global pandemic. But his personal form over the past 12 months has been celestial and his lack of ego is such that his replacement - most likely Ben Stokes - will get a selfless, trustworthy senior player in the ranks who is unlikely to brood or cause disruption. The timing of Root’s departure comes at the end of a week in which candidates for the director of men’s cricket job were interviewed. Rob Key is looking the likely choice now that Durham’s Marcus North has withdrawn for family reasons. Andrew Strauss is leading the process and is the type to keep a tight lid on things – he sprung a surprise in 2015 when Jason Gillespie was heavily touted to become head coach, only for Trevor Bayliss to emerge from the blue – but talks with Key are believed to be at an advanced stage. Did Root know which way the wind was blowing here? Certainly Key, in his role as a Sky pundit, was critical of his leadership after the team’s 4-0 pasting in Australia, pinning the team’s strategic errors and “negative mindset” on the captain and asking how he had survived a cull that saw Ashley Giles, Chris Silverwood and Graham Thorpe removed. Opinions can change upon taking a role and assessing the landscape more closely, but it would have been a tricky appraisal from which to row back. More light may be shed on this soon, but the word from teammates is that Root made the decision solely on his terms. At the end of the recent 1-0 defeat in the Caribbean, and with adrenaline still pumping, he had re-asserted his “passion” to continue in the role and spoke of “big strides forward” having been taken on the trip. Clearly it took time away from the pressure cooker – and the need to always think and talk positively – to come to a more logical conclusion. When considering the nature of the 10-wicket defeat in Grenada last month it was hard to see any other outcome, as after the Ashes, only a series win could have prevented this outcome. Instead, one of the enduring images was of Root on the balcony in St George’s, hands covering a haunted face, after Ben Foakes was witlessly run out during the defining collapse on day three. Having spent that morning utterly powerless to prevent Joshua Da Silva’s century turning the match in favour of West Indies, he looked like a captain out of ideas. Not that it was all bad. The dream of being an Ashes-winning captain may have been evaporated in Melbourne by an unlikely executioner in Scott Boland, but away wins in Sri Lanka (twice) and South Africa, as well as strong home form until last summer, mean Root should not be damned by a run of one win from his final 17 Tests in charge. That solitary victory over India at Headingley last August was also a record 27th in the job (even if this also comes down to time served and is only one more than the number of defeats). Overall, he has been an unimpeachable ambassador for the English game. But the pandemic threw up a hugely challenging schedule and there was also the sense that however much Root’s bat glowed, his teams lacked any meaningful identity. Perhaps this was hard to establish in parallel with Eoin Morgan’s limited overs juggernaut – a setup with such a defined philosophy that even when 16 players were lost to Covid outbreak last summer, little changed - or simply impossible given the dearth of Test-quality players coming through the system. Root was also a conflict-averse character and one who often chose not to own tricky decisions publicly, such that still we don’t know whether the recent call to leave out Jimmy Anderson and Stuart Broad – an extraction that Morgan performed unflinchingly in 2015 – was something he fully agreed with or not. Given that personalities seldom change, he needed a forthright coach alongside him but instead got two similarly amiable facilitators in Bayliss and Silverwood. Who steps up? Everything points to Stokes, even if this will place a greater burden on him as an all-format all-rounder. Jonny Bairstow is the only other batter in the team guaranteed a spot, but seldom gets mentioned as captaincy material, while talk of Broad is not without merit but falls apart when considering a summer of seven Test matches that will challenge all the seamers, not least those well into their 30s. Perhaps Moeen Ali should be talked out of Test retirement and return to captain from No7, like a modern day Ray Illingworth . Really, English cricket’s leadership reshuffle should start with the position of chair, and then work its way down from there. But if we have learned anything from a horror year that ended with a raft of sackings and now Root’s resignation, the road to recovery will be a long one regardless of who is in charge.","image_url":"https://i.guim.co.uk/img/media/191eea9588f685baa991b6c8a7b6ded8f9a3c397/613_43_1521_913/master/1521.jpg?width=460&quality=85&auto=format&fit=max&s=5191a8c8b904740a528bde58927163f5","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"CSK Deepak Chahar replacement 2022: Deepak Chahar replacement CSK IPL 2022","link":"https://thesportsrush.com/cricket-news-csk-deepak-chahar-replacement-2022-deepak-chahar-replacement-csk-ipl-2022/","keywords":["Cricket","CSK","IPL 2022","chennai super kings","csk","deepak chahar","Indian Premier League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Deepak Chahar replacement 2022 IPL: The fast bowler from Chennai Super Kings will be missing Indian Premier League 2022. Defending champions Chennai Super Kings have been dealt with a massive blow after fast bowler Deepak Chahar has been ruled out of the ongoing 15th season of the Indian Premier League. Chahar, 29, had suffered a… The post CSK Deepak Chahar replacement 2022: Deepak Chahar replacement CSK IPL 2022 appeared first on The SportsRush.","content":"Deepak Chahar replacement 2022 IPL: The fast bowler from Chennai Super Kings will be missing Indian Premier League 2022. Defending champions Chennai Super Kings have been dealt with a massive blow after fast bowler Deepak Chahar has been ruled out of the ongoing 15th season of the Indian Premier League. Chahar, 29, had suffered a quadricep tear to miss India vs West Indies T20s before IPL 2022. During his rehabilitation at the NCA (National Cricket Academy), Chahar had suffered a back injury. Since then, the right-arm bowler hasn’t been able to recover to take part in the second half of the IPL 2022; something that was expected after he missed the first few matches. “We are disappointed because we don’t have one of our main bowlers but injuries are part and parcel of the game. We wish Deepak Chahar a very speedy recovery,” Super Kings CEO Kasi Viswanathan said in an official statement. pic.twitter.com/MDW6ZWeqtA — Deepak chahar (@deepak_chahar9) April 15, 2022 Not part of Chennai’s four retained players ahead of IPL 2022 mega auction, Chahar was the centre of attraction at the mega auction in Bengaluru becoming the second-costliest player after Mumbai Indians’ Ishan Kishan. Deepak Chahar replacement 2022 IPL In 58 matches for CSK between 2018-2021, Chahar has picked as many wickets at an average of 27.71, an economy rate of 7.70 and a strike rate of 21.59. With Chahar having started to make a name for himself as a bowling all-rounder lately, it will be quite a task for Super Kings to replace him at this stage of an IPL season. It is worth mentioning that Chennai are yet to name a replacement for Chahar. In their first five IPL 2022 matches, CSK have played the likes of Mukesh Choudhary and Tushar Deshpande in Chahar’s place. Uncapped fast-bowling options namely KM Asif, Rajvardhan Hangargekar and Simarjeet Singh are already waiting for an opportunity to fill the Indian pacer’s slot. The post CSK Deepak Chahar replacement 2022: Deepak Chahar replacement CSK IPL 2022 appeared first on The SportsRush.","pubDate":"2022-04-15 15:46:12","full_description":"Deepak Chahar replacement 2022 IPL: The fast bowler from Chennai Super Kings will be missing Indian Premier League 2022. Defending champions Chennai Super Kings have been dealt with a massive blow after fast bowler Deepak Chahar has been ruled out of the ongoing 15th season of the Indian Premier League. Chahar, 29, had suffered a quadricep tear to miss India vs West Indies T20s before IPL 2022. During his rehabilitation at the NCA (National Cricket Academy), Chahar had suffered a back injury. Since then, the right-arm bowler hasn’t been able to recover to take part in the second half of the IPL 2022; something that was expected after he missed the first few matches. “We are disappointed because we don’t have one of our main bowlers but injuries are part and parcel of the game. We wish Deepak Chahar a very speedy recovery,” Super Kings CEO Kasi Viswanathan said in an official statement. pic.twitter.com/MDW6ZWeqtA — Deepak chahar 🇮🇳 (@deepak_chahar9) April 15, 2022 Not part of Chennai’s four retained players ahead of IPL 2022 mega auction, Chahar was the centre of attraction at the mega auction in Bengaluru becoming the second-costliest player after Mumbai Indians’ Ishan Kishan. In 58 matches for CSK between 2018-2021, Chahar has picked as many wickets at an average of 27.71, an economy rate of 7.70 and a strike rate of 21.59. With Chahar having started to make a name for himself as a bowling all-rounder lately, it will be quite a task for Super Kings to replace him at this stage of an IPL season. It is worth mentioning that Chennai are yet to name a replacement for Chahar. In their first five IPL 2022 matches, CSK have played the likes of Mukesh Choudhary and Tushar Deshpande in Chahar’s place. Uncapped fast-bowling options namely KM Asif, Rajvardhan Hangargekar and Simarjeet Singh are already waiting for an opportunity to fill the Indian pacer’s slot.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-16-20-updates-2891711","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 15:35:50","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 20.0 overs, Kolkata Knight Riders are 175/8. The live updates of Sunrisers Hyderabad vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Kolkata Knight Riders, Sunrisers Hyderabad vs Kolkata Knight Riders live score, Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. We are back for the chase! ... THE RUN CHASE ... Right then! Hyderabad need 176 runs to win their third game of the third tournament. Kolkata do have a tough task, but wickets in the Powerplay will put them on top. Who will get over the line here? We will find out. Stay tuned for the second essay. Marco Jansen is down for a chat. He says it felt like he was bowling in South Africa. Adds that they should chase it down with the dew as well. Mentions that they did not discuss the pitch as it was their first game here but they adapted quickly with variations. From 38 for 3 at the end of the Powerplay to 175 at the end of 20 overs, Kolkata have put a fighting total on the board. Shreyas Iyer and Nitish Rana put on a good decent partnership in the middle, but Shreyas Iyer could not carry on. But Nitish Rana brought up his half-century and he was the only man who steadied things for Kolkata. Andre Russell came in scored a quick 49 and guided his side over 170 runs. They have given the bowler's a healthy total to fight with and Umesh Yadav and Pat Cummins will come in and hope to make some early inroads. The orange army got to a scintillating start. The bowlers made perfect use of the conditions and were rewarded with 3 wickets within the Powerplay. They did not grab regular wickets but they did well to keep things relatively quiet. Umran Malik was the pick of the bowlers, he grabbed 2 wickets was economical as well. While T Natarajan did well to pick two wickets in his spell as well. Coming into bat they would feel they could chase this down considering dew. It's been a good recovery from Kolkata! They would be pleased with the score they have put up on the board, considering the start they got. Hyderabad have done well though and will probably fancy their chance of chasing this down, however, it will be a tough one though. 19.6 overs (4 Runs) FOUR! Yes, he can! This is full and down the leg side. Russell gets low to sweep but does not middle it. It rolls to fine leg for a boundary. Kolkata end at 175 for 8. 19.5 overs (6 Runs) SIX! Two in a row! Shorter again and slanting around off. Russell makes room a bit and flat bats it hard and well over long on for a maximum. Can he finish off in style? 19.4 overs (6 Runs) SIX! This is why he does not take the single because he believes in himself. Touch short and angling on middle. Russell clears his front leg and pulls it over square leg for a biggie. 19.3 overs (0 Run) Flatter and outside off. Russell slaps it to long off but does not take a run. 19.2 overs (1 Run) Quick single! On middle. Yadav pushes it to mid on. Rahul Tripathi from mid-wicket runs across but fails to gather the ball cleanly. Certainly, a run out chance there. Umesh Yadav walks out to bat. 19.1 overs (0 Run) OUT! BOWLED! An arm ball, flatter and drifting around leg, it skids through as well. Khan gets low and tries to swing across but misses and the ball rattles the stumps. Would have been wiser by giving the strike to Russell. Jagadeesha Suchith will bowl the final over of the innings! 18.6 overs (0 Run) A perfect yorker, on middle. Russell falls over as he tries to squeeze it out to mid-wicket. It will be Khan on strike for the final over. 18.5 overs (1 Run) Too full and on middle, flicked to deep square leg for one. 18.4 overs (4 Runs) FOUR! Khan is away on his debut! Kumar rolls his finger on it, fuller and outside off. Khan shuffles across and lofts it over covers and in the gap, in the deep for a boundary. Aman Khan comes to the crease. 18.3 overs (0 Run) OUT! TAKEN! Change of pace from Kumar, slower, on a length and way outside off. Cummins tries to fetch it but gets a leading edge to mid on. Marco Jansen from long on runs forward and takes it with ease. 18.2 overs (1 Run) Leg bye! Angles it on the pads. Russell misses his tuck. Off the pads and the ball rolls to square leg for a leg bye. 18.1 overs (2 Runs) A length ball, slanting outside off, slower delivery. Russell tries to power it over cover but splices it to long off for a brace. Lands safely there. 17.6 overs (2 Runs) Nails the yorker, around leg. Cummins squeezes it through his legs and in the vacant square leg region and will get a couple of runs. 17.5 overs (1 Run) Full and on middle. Russell makes room and slams it back to Natarajan who gets a hand to it but the ball rolls past the non-strikers stumps and to long on for a single. 17.4 overs (4 Runs) FOUR! A full toss, around middle and leg. Russell pulls it, wide of deep mid-wicket and bags a boundary. 17.3 overs (1 Run) Length ball, slower and on the pads. Cummins mistimes his flick, in the air and in front of square leg for a single. Pat Cummins comes to the crease. 17.2 overs (0 Run) OUT! CAUGHT BEHIND! A huge shout for caught behind but not given! Hyderabad take the review! There was a noise on it but might be from the bat hitting the deck. UltraEdge shows a murmur even before the ball passes the bat but there was a big spike when it crosses the bat and the third umpire is convinced and asks the on-field umpire to change his decision. This is full and just outside off. Rana makes room and looks to go over covers but seems to miss it. But the replay shows a spike and Rana goes after a good innings. 17.1 overs (4 Runs) FOUR! Straight down the ground! Full ball, on middle. Rana smashes it past the bowler and it races away quickly into the fence. T Natarajan (3-0-25-2) comes back on! 16.6 overs (4 Runs) FOUR! Hammered! Fullish and on the pads. Russell flicks it to deep square leg. Marco Jansen runs to his left and dives but the ball is away from his reach. 16 coming off it. 16.5 overs (0 Run) Kumar gets his line right this time! A yorker, angling on middle. Russell gets his bat down and keeps it out. 16.4 overs (6 Runs) SIX! Good reaction from Russell! Kumar serves it full and outside off. Russell muscles it over covers for a biggie. 16.3 overs (0 Run) Excellent delivery from Bhuvneshwar! A superb yorker, on middle. Russell cannot do much about it as he digs it out back. 16.3 overs (1 Run) Wide! Tries to stay away from the arc but serves it over the tramline. Russell leaves it. Wided. 16.2 overs (4 Runs) FOUR! Good shot! Short and around off. Russell stands tall and upper cuts it over the keeper and wide of short third man for a boundary. 16.1 overs (1 Run) Leg bye! Full, slower and down the leg side. Rana skips down and across and misses his flick. It rolls off the pads and to mid-wicket for a leg bye. Strategic break! It's been a decent recovery from Kolkata. They have four overs to go now, and with Andre Russell and Nitish Rana now at the crease, they will be aiming to score over 165 runs. Anything above that they will be pleased. Hyderabad have done well though to keep things quiet for now, and they will want to do the same thing in the last four overs. Also, Bhuvneshwar Kumar (2-0-15-0) comes back on. 15.6 overs (0 Run) Just two runs against Andre Russell! Umran Malik is done with the ball for today and has been really impressive! A length ball, way outside off. Russell flashes his bat at it but misses. 15.5 overs (0 Run) Superb bowling from Malik! Another short ball, around middle and leg. Russell sits under it and falls down on the ground. 15.4 overs (0 Run) Malik is changing his length nicely here. Short and outside off. Russell again makes room and looks to slash at it but misses. 15.3 overs (0 Run) Comes over the wicket now, fuller and around leg. Russell makes room and looks to heave it but misses. 15.2 overs (2 Runs) A length ball from round the wicket, outside off. Russell knocks it past point but sweeper cover does well to rush across and keep it down to two. 15.1 overs (0 Run) A low full toss, on middle. Russell can't get it past the mid-wicket fielder.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856535418330716.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-11-15-updates-2891628","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 15:05:51","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 15.2 overs, Kolkata Knight Riders are 122/5. The live updates of Sunrisers Hyderabad vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Kolkata Knight Riders, Sunrisers Hyderabad vs Kolkata Knight Riders live score, Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 14.6 overs (0 Run) Yorker-length delivery, outside off. Nitish Rana pushes it to the fielder at cover. 14.5 overs (1 Run) On a length, around middle. Andre Russell tucks it towards square leg for a single. 14.4 overs (1 Run) Fuller in length, on the pads. Nitish Rana flicks it towards deep square leg for a single. That will be fifty for Nitish Rana! It's been such an important knock. He will want to go on till the end. 14.3 overs (0 Run) On a length, around middle. Nitish Rana pushes it back to the bowler. 14.2 overs (4 Runs) FOUR! Lovely shot! A fuller delivery, outside off. Nitish Rana shuffles across, and paddle scoops it over the fielder at short fine leg for a boundary. 14.1 overs (0 Run) Shorter ball, around middle. Nitish Rana ducks and leaves it alone. 13.6 overs (1 Run) Yorker-length delivery, around middle. Nitish Rana knocks it down to long on for a single. 13.5 overs (1 Run) Outside off, fuller length delivery. Andre Russell guides it towards sweeper cover for a single. 13.4 overs (6 Runs) SIX! Andre Russell means business! Tad shorter now, around middle. Andre Russell clears his front leg and smashes it over deep mid-wicket for a biggie! 13.3 overs (2 Runs) Fuller delivery, outside off. Andre Russell clears his front foot and whips it towards deep mid-wicket. Two taken! 13.2 overs (0 Run) Marco Jansen drops it short now, down leg. Andre Russell ducks under it. 13.1 overs (1 Run) Slower, on the thigh pads, on a length. Nitish Rana tucks it towards fine leg for a single. Andre Russell walks out. 12.6 overs (0 Run) OUT! CAUGHT! Good come back by Umran Malik! He drops it short once again, around off this time. Sheldon Jackson goes for the pull again, but this time the ball goes off the top edge towards fine leg. T Natarajan there keeps his eyes on the ball and takes a sharp catch. Kolkata have lost half their side now. 12.5 overs (6 Runs) SIX! Another maximum! This time it's Sheldon Jackson! A shorter ball, around middle. Sheldon Jackson pulls it over deep square leg for a biggie! 12.4 overs (0 Run) Well bowled! A yorker-length delivery, around middle. Sheldon Jackson digs it out towards the bowler. 12.3 overs (0 Run) Back of a length, outside off. Sheldon Jackson taps it towards point. 12.2 overs (3 Runs) Fuller ball, around middle and leg. Nitish Rana flicks it towards the vacant mid-wicket region. Three taken! 12.1 overs (6 Runs) SIX! Flat six! Uses the pace here Nitish Rana! On a length, outside off. Nitish Rana uses the depth of the crease, moves away and slashes it towards third man for a biggie! 11.6 overs (0 Run) A stifled appeal there for LBW, but the umpire is unmoved! A length ball, tailing back in, around middle. Sheldon Jackson looks to block this but he gets an inside edge back onto his pads. 11.5 overs (1 Run) On a length, around middle. Nitish Rana flicks it towards mid-wicket for a single. 11.4 overs (4 Runs) FOUR! Top shot! Back of a length, outside off. Nitish Rana stays in his crease and lifts it over cover for a boundary. 11.3 overs (2 Runs) On a length, outside off. Nitish Rana punches it off the back foot towards cover for a brace. 11.2 overs (0 Run) Yorker-length delivery, around middle. Nitish Rana blocks it out. 11.1 overs (6 Runs) SIX! BANG! A fuller ball, around middle. Nitish Rana heaves it high towards deep mid-wicket. The ball lands straight on the boundary cushions there! A maximum for Nitish Rana! T Natarajan is back on. 6 runs and 2 wickets in his first over. 10.6 overs (1 Run) Shorter ball, around middle and off. Nitish Rana tucks it towards square leg for a single. 10.5 overs (0 Run) A huge shout for LBW, but the umpire says no! This one comes in with the arm, full ball, around leg. Nitish Rana looks to sweep but he misses and gets hit on his front pad. Hyderabad opts for a review! No bat involved, confirms UltraEdge. Ball Tracking shows it was pitching outside leg. The on-fielder decision stands. Hyderabad lose a review! 10.4 overs (2 Runs) Slower through the air, full, on the pads. Nitish Rana flicks it towards deep square leg for a brace. 10.3 overs (1 Run) Tad shorter, on the pads. Sheldon Jackson tucks it towards square leg for a single. 10.2 overs (0 Run) Fuller ball, slower through the air, on middle. Sheldon Jackson blocks it out. 10.1 overs (1 Run) Shorter ball, outside off. Nitish Rana pulls it to the fielder at deep mid-wicket for a single.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856517428956696.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"“Rocco would be turning 10 on 4/20, and I’m so grateful to have a healthy bulldog!”: Warriors’ Klay Thompson appreciates a question about his dog, gives updates about the fan favorite canine","link":"https://thesportsrush.com/nba-news-rocco-would-be-turning-10-on-4-20-and-im-so-grateful-to-have-a-healthy-bulldog-warriors-klay-thompson-appreciates-a-question-about-his-dog-gives-updates-about-the-fan-favorite-canine/","keywords":["Basketball","Golden State Warriors","Klay Thompson","NBA","Rocco"],"creator":["Raahib Singh"],"video_url":null,"description":"Warriors superstar Klay Thompson gets asked about Rocco after the scrimmage, appreciates being asked about his buddy The Golden State Warriors are headed back to the playoffs, after a long, two-year gap. After making it to five straight finals, not even making the playoffs for two years felt just wrong. However, the Warriors are back… The post “Rocco would be turning 10 on 4/20, and I’m so grateful to have a healthy bulldog!”: Warriors’ Klay Thompson appreciates a question about his dog, gives updates about the fan favorite canine appeared first on The SportsRush.","content":"Warriors superstar Klay Thompson gets asked about Rocco after the scrimmage, appreciates being asked about his buddy The Golden State Warriors are headed back to the playoffs, after a long, two-year gap. After making it to five straight finals, not even making the playoffs for two years felt just wrong. However, the Warriors are back where they belong, and that’s all that matters. Due to the play-in games, the Dubs got a nice 6-day window between their final game of the regular season and their first playoff game. They’re utilizing this time by working on their skills and getting better for the postseason. Also Read: “Would Stephen Curry be a factor in the playoffs? Come on Shaq!”: Klay Thompson talks up his teammate after Shaquille O’Neal and the TNT crew question his impact during the playoffs Last night, Stephen Curry scrimmaged with the team and showed good signs of improvement. After the practice, Klay Thompson sat with the media. A lot of the questions asked were about Steph and the starting lineup. However, one reporter decided to go off the mainstream line of questions, and asked about Klay’s beloved bulldog, Rocco. “Rocco turns 10 soon, and he’s a blessing”: Klay Thompson Every pet owner loves their pet nearly and dearly. The case is no different for Warriors’ sharpshooter Klay Thompson. Klay got Rocco when he was a puppy, and Rocco is now about to turn 10 soon. Rocco has been there for Klay’s almost entire journey with the Dubs, and has seen both good and bad days. When Cyrus Saatsaz asked Klay about Rocco and how he was doing, Thompson was impressed by the question and commended the reporter for the same. Here’s the original video of my question to @KlayThompson regarding how Rocco’s doing and who takes care of him when he isn’t home, many thanks to the great @DoubleR_PR for letting me ask my spirit brother about his puppy. Rocco turns 10 on 4/20. Happy Early Birthday Rocco! https://t.co/APle4b4cO0 pic.twitter.com/39wBM4CbXX — Cyrus Saatsaz (@DogSurfRoadshow) April 15, 2022 Rocco and Klay share a deep bond, that is adored by all of Dubnation. The Warriors know of the same and even have had Klay Thompson and Rocco bobbleheads. The Warriors’ star has had a lot of notable relationships, but the only one that’s survived the time has been Rocco. Klay Thompson would still prefer hanging out with Rocco pic.twitter.com/6lqwoKynys — NBA Memes (@NBAMemes) April 10, 2022 Also Read: “Stephen Curry or Rocco?! I’ll drink that cricket tea”: Klay Thompson gulps down a drink on Serge Ibaka’s show after being unable to select between his Splash Brother and his dog I guess my man loves his bulldog more than anything else on the planet. The post “Rocco would be turning 10 on 4/20, and I’m so grateful to have a healthy bulldog!”: Warriors’ Klay Thompson appreciates a question about his dog, gives updates about the fan favorite canine appeared first on The SportsRush.","pubDate":"2022-04-15 15:00:45","full_description":"Warriors superstar Klay Thompson gets asked about Rocco after the scrimmage, appreciates being asked about his buddy The Golden State Warriors are headed back to the playoffs, after a long, two-year gap. After making it to five straight finals, not even making the playoffs for two years felt just wrong. However, the Warriors are back where they belong, and that’s all that matters. Due to the play-in games, the Dubs got a nice 6-day window between their final game of the regular season and their first playoff game. They’re utilizing this time by working on their skills and getting better for the postseason. Also Read: “Would Stephen Curry be a factor in the playoffs? Come on Shaq!”: Klay Thompson talks up his teammate after Shaquille O’Neal and the TNT crew question his impact during the playoffs Last night, Stephen Curry scrimmaged with the team and showed good signs of improvement. After the practice, Klay Thompson sat with the media. A lot of the questions asked were about Steph and the starting lineup. However, one reporter decided to go off the mainstream line of questions, and asked about Klay’s beloved bulldog, Rocco. Every pet owner loves their pet nearly and dearly. The case is no different for Warriors’ sharpshooter Klay Thompson. Klay got Rocco when he was a puppy, and Rocco is now about to turn 10 soon. Rocco has been there for Klay’s almost entire journey with the Dubs, and has seen both good and bad days. When Cyrus Saatsaz asked Klay about Rocco and how he was doing, Thompson was impressed by the question and commended the reporter for the same. Here’s the original video of my question to @KlayThompson regarding how Rocco’s doing and who takes care of him when he isn’t home, many thanks to the great @DoubleR_PR for letting me ask my spirit brother about his puppy. Rocco turns 10 on 4/20. Happy Early Birthday Rocco! ❤️🐶 https://t.co/APle4b4cO0 pic.twitter.com/39wBM4CbXX — Cyrus Saatsaz (@DogSurfRoadshow) April 15, 2022 Rocco and Klay share a deep bond, that is adored by all of Dubnation. The Warriors know of the same and even have had Klay Thompson and Rocco bobbleheads. The Warriors’ star has had a lot of notable relationships, but the only one that’s survived the time has been Rocco. Klay Thompson would still prefer hanging out with Rocco pic.twitter.com/6lqwoKynys — NBA Memes (@NBAMemes) April 10, 2022 Also Read: “Stephen Curry or Rocco?! I’ll drink that cricket tea”: Klay Thompson gulps down a drink on Serge Ibaka’s show after being unable to select between his Splash Brother and his dog I guess my man loves his bulldog more than anything else on the planet.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-6-10-updates-2891563","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 14:54:01","full_description":"Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com . After 10.3 overs, Kolkata Knight Riders are 72/4. Get live score, ball by ball commentary and much more. Keep track of Indian Premier League 2022 today match between Sunrisers Hyderabad and Kolkata Knight Riders. Everything related to Sunrisers Hyderabad and Kolkata Knight Riders match will be available on Sports.NDTV.com . Stay updated with Sunrisers Hyderabad vs Kolkata Knight Riders live score. Do check for Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. You can get scorecard updates, match related facts. Get quick live updates with ads, Sports.NDTV.com , which is the perfect destination for live cricket score. 9.6 overs (0 Run) OUT! BOWLED! A dream delivery for any pace bowler! A yorker bowled to perfection and with sheer pace. This one is at 148.8 kph! Right in the slot, on middle. Iyer clears his front leg and tries to squeeze it out but the pace was so good that Iyer was late to get his bat down and the stumps behind knocks over. Shreyas Iyer played all over it. 9.5 overs (0 Run) This one is delivered at 147.5 kph! Short and outside off. Iyer dances in his crease and looks to ramp it away but misses. There was a third man standing. 9.4 overs (1 Run) Leg bye! Touch short and around leg. Rana misses his tuck and gets hit high on the pads. It rolls to square leg and the batters take a leg bye. 9.3 overs (1 Run) On a length and on off. Iyer dabs it to third man for a single. 9.2 overs (0 Run) In the air and falls safely! On a length and on middle. Iyer looks to clip this on the leg side but gets an inside edge onto the pads. The ball lobs left of him and Malik charges across to catch it but fails. Should have put in a dive to take that. 9.1 overs (1 Run) Length and on off. Rana knocks it through covers for a quick single. 8.6 overs (1 Run) NOT OUT! Tossed up, on middle. Rana looks for the reverse sweeps but he gets a slight inside edge onto his pads. A huge appeal for LBW but not given. The ball rolls to point and they go for a quick single. The fielder throws to the keeper who clips the bails off and appeals. No review taken for LBW while Iyer was well inside his crease. Run-out chance! There is a throw at the keeper's end, but Shreyas Iyer has made his ground. 8.5 overs (4 Runs) FOUR! Now Rana says thank you! Again down the leg side and Rana sweeps it past short fine leg for a boundary. 8.4 overs (0 Run) Tossed up, outside off. Nitish guides it to point. 8.3 overs (0 Run) Angles it outside off, on a fuller side. Rana gets on his knee as he looks to drive but misses. 8.2 overs (1 Run) Full and on off, pushed to long off for a single. 8.1 overs (4 Runs) FOUR! Thank you, says Shreyas Iyer! This is full, flighted but way down the leg side. Iyer paddles it and needs just to help it away to the empty fine leg fence. 7.6 overs (2 Runs) Keeps it outside off but this time there is lack of pace. Rana cuts and beats the point fielder and collects a couple. Strategic break! Hyderabad certainly on top here! The pitch has been a paradise for the seamers. We witnessed some amazing swing bowling till now, and the bowlers have been rewarded with 3 wickets. Shreyas Iyer has taken his time but is looking settled, for now, Nitish Rana has looked confident as well. They will look to put a strong partnership from here. Jagadeesha Suchith comes into the attack now. 7.6 overs (1 Run) Wide! Length ball, angling outside off but just over the tramline. Rana looks to knock it out but misses. 7.5 overs (1 Run) On a length and on middle. Iyer works it in front of square leg for one more. 7.4 overs (1 Run) On middle, this is it to square leg for a single. 7.3 overs (4 Runs) FOUR! Now he uses his foot and gets the reward! Length and outside off. Rana takes the charge and slaps it over covers, in the gap for a boundary. 7.2 overs (0 Run) Hyderabad bowlers have been top-notch with consistency today! A length ball, outside off. Rana looks to cut it but without any foot movement, misses it. 7.1 overs (1 Run) A length ball, outside off. Iyer cuts it to third man for a single. Shashank Singh comes into the attack. 6.6 overs (4 Runs) FOUR! Uses the pace! Short again, drifting on the hips. Rana waits and pulls it to deep square leg for a boundary. 6.5 overs (1 Run) Leg bye! Touch short and angling around middle and leg. Iyer shuffles across and looks to flick but misses and gets hit on the pads. An appeal follows for LBW but that might be going down. A leg bye taken. 6.4 overs (2 Runs) Around off now, same length as the last delivery. Iyer hops and knocks it past point for a brace. 6.3 overs (0 Run) Short of a length and outside off, at 146 kph! Iyer swings his bat again but fails to get any part of it. 6.2 overs (0 Run) An appeal for caught behind but not given! A length ball, outside off, extra bounce. Iyer flashes his bat at it but fails to connect. Umran Malik comes into the attack. 6.1 overs (2 Runs) Length ball, outside off. Iyer leans and drives it to deep cover for a couple of runs. 5.6 overs (0 Run) A sharp bouncer, around middle and leg. Rana sits under it. Kolkata are 38 for 3 at the end of the Powerplay. 5.5 overs (1 Run) Angles it around off and makes it to nip back in. Iyer looks to push but gets an inside edge to fine leg for a single. 5.4 overs (0 Run) Short of a length and on off. Iyer punches off the back foot to covers. 5.3 overs (2 Runs) On the hips, flicked to the left of deep square leg for a couple of runs. 5.2 overs (4 Runs) FOUR! Superb shot! Touch fuller and around middle. Iyer pushes it gently and past the diving mid on fielder for a boundary. 5.1 overs (0 Run) On a length and keeping it tight, around off. Iyer stays back to defend it to point.","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856510328793276.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022, SRH vs KKR Live Score: Shreyas Iyer, Nitish Rana Rebuild For KKR After Losing 3 Early Wickets - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiT2h0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLXNyaC12cy1ra3ItbGl2ZS1zY29yZS11cGRhdGVzLTI4OTExOTTSAVVodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1zcmgtdnMta2tyLWxpdmUtc2NvcmUtdXBkYXRlcy0yODkxMTk0L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IPL 2022, SRH vs KKR Live Score: Shreyas Iyer, Nitish Rana Rebuild For KKR After Losing 3 Early Wickets  NDTV SportsMatch Preview - Sunrisers vs KKR, Indian Premier League 2022, 25th Match  ESPNcricinfoSRH vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorSRH vs KKR Live Score, IPL 2022: Pacers rattle Kolkata early with three quick strikes  Times of IndiaIPL reboot: Can Sunrisers Hyderabad continue their winning run against KKR?  TNIE VideosView Full coverage on Google News","content":null,"pubDate":"2022-04-15 14:50:19","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Situation Of Hosting Asia Cup In SL Will Be Assessed After IPL: Jay Shah","link":"https://sports.ndtv.com/cricket/situation-of-hosting-asia-cup-in-sri-lanka-will-be-assessed-after-ipl-final-jay-shah-2891570","keywords":null,"creator":null,"video_url":null,"description":"Jay Shah, president of the Asian Cricket Council and the secretary of the Board of Control for Cricket in India, on Friday said the situation of hosting the Asia Cup 2022 in Sri Lanka, will be...","content":null,"pubDate":"2022-04-15 14:30:44","full_description":"Jay Shah, president of the Asian Cricket Council and the secretary of the Board of Control for Cricket in India (BCCI), on Friday said the situation of hosting the Asia Cup 2022 in Sri Lanka, will be assessed after the final of the ongoing Indian Premier League (IPL). Asia Cup 2022 was scheduled to be hosted in Sri Lanka on August 27 but due to the ongoing economic crisis in the country, many questions are being raised. Sri Lanka is battling a severe economic crisis with food and fuel scarcity affecting a large number of the people in the island nation since the onset of the pandemic. \"I had a detailed discussion with the officials of Sri Lanka Cricket on the situation in the country and its impact on cricket. SLC is hopeful of delivering a safe and successful Men's Asia Cup. The office-bearers of SLC will be hosted at IPL 2022 final on May 29, and we will further assess the situation,\" Jay Shah told ANI. The economy has been in a free-fall since the onset of the COVID-19 pandemic, affecting tourism, the biggest contributor to Sri Lanka's GDP. Sri Lanka is also facing a foreign exchange shortage, which has affected its capacity to import food and fuel. The shortage of essential goods forced Sri Lanka to seek assistance from friendly countries. The economic situation has led to huge protests with demands for the resignation of Prime Minister Mahinda Rajapaksa and President Gotabaya Rajapaksa. Promoted Earlier, in a special address to the nation on Monday, Prime Minister Mahinda Rajapaksa requested people to remain patient and stop taking to the streets in order to enable the government to resolve the situation.","image_url":"https://c.ndtvimg.com/2018-09/s40jgtp_india-win-asia-cup-afp_625x300_30_September_18.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"SRH vs KKR Live Score, IPL 2022: Natarajan removes Venkatesh, Narine in same over; Kolkata suffer early blows - Hindustan Times","link":"https://news.google.com/__i/rss/rd/articles/CBMioQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9zcmgtdnMta2tyLWxpdmUtc2NvcmUtaXBsLTIwMjItc3VucmlzZXJzLWh5ZGVyYWJhZC12cy1rb2xrYXRhLWtuaWdodC1yaWRlcnMtdDIwLW1hdGNoLTI1LWxpdmUtdXBkYXRlcy0xMDE2NTAwMTkwMjQ4ODMuaHRtbNIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SRH vs KKR Live Score, IPL 2022: Natarajan removes Venkatesh, Narine in same over; Kolkata suffer early blows  Hindustan TimesMatch Preview - Sunrisers vs KKR, Indian Premier League 2022, 25th Match  ESPNcricinfoSRH vs KKR Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, Injury Update- Tata IPL 2022  Cricket AddictorSRH vs KKR Live Score, IPL 2022: Kolkata suffer Aaron Finch blow early after Hyderabad opt to bowl  Times of IndiaIPL reboot: Can Sunrisers Hyderabad continue their winning run against KKR?  TNIE VideosView Full coverage on Google News","content":null,"pubDate":"2022-04-15 14:25:08","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Aman Khan cricketer KKR: Why is Ajinkya Rahane not playing today’s IPL 2022 match between Sunrisers Hyderabad and Kolkata Knight Riders?","link":"https://thesportsrush.com/cricket-news-aman-khan-cricketer-kkr-why-is-ajinkya-rahane-not-playing-todays-ipl-2022-match-between-sunrisers-hyderabad-and-kolkata-knight-riders/","keywords":["Cricket","IPL 2022","KKR","Sunrisers Hyderabad","Aaron Finch","Ajinkya Rahane","Aman Khan","Indian Premier League","Kolkata Knight riders","Rasikh Salam","Sam Billings","Sheldon Jackson","SRH"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Why Ajinkya Rahane not playing today: Kolkata Knight Riders have made three changes to their Playing XI for this match. During the 25th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Kolkata Knight Riders at the Brabourne Stadium, Sunrisers Hyderabad captain Kane Williamson has won the toss and… The post Aman Khan cricketer KKR: Why is Ajinkya Rahane not playing today’s IPL 2022 match between Sunrisers Hyderabad and Kolkata Knight Riders? appeared first on The SportsRush.","content":"Why Ajinkya Rahane not playing today: Kolkata Knight Riders have made three changes to their Playing XI for this match. During the 25th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Kolkata Knight Riders at the Brabourne Stadium, Sunrisers Hyderabad captain Kane Williamson has won the toss and chose to bowl. “We are gonna have a bowl first. It has been a good wicket but the dew factor has been a reason. Team is improving and growing as a unit. KKR is a strong side,” Williamson told Star Sports at the toss. With all-rounder Washington Sundar not being able to recover from his hand injury, Sunrisers have replaced him with an uncapped Indian all-rounder in Jagadeesha Suchith. Why is Ajinkya Rahane not playing vs SRH today? Not affected much by the prospect of batting first, Kolkata Knight Riders captain Shreyas Iyer announced three changes made to their Playing XI. While opening batter Ajinkya Rahane has been left out on form, wicket-keeper batter Sam Billings and fast bowler Rasikh Salam have missed due to individual injuries. “I am happy batting first. [Aaron] Finch comes in and Aman Khan comes in. Sheldon Jackson is in as well. There are a few injuries in the camp. We had a good break in between. Can’t really say much about the pitch because it was tough to sight because of the grass,” Iyer told Star Sports at the toss. Gutted not to be there tonight. Been a rough week unfortunately Sure the @KKRiders lads can get the job done #korbolorbojeetbo — Sam Billings (@sambillings) April 15, 2022 In five innings this season, Rahane has scored 80 runs at an average and strike rate of 16 and 100 respectively. Making his debut for KKR, Finch will be playing for his ninth IPL franchise. While Jackson has played a couple of matches this season, Aman Khan is making his IPL debut tonight. In fact, it is the first-ever competitive match for this 25-year old all-rounder from Mumbai. A hard-hitting all-rounder who had played age-group cricket with Iyer back in the day, Khan was picked for his base price of INR 20 lakh after being constant in IPL trials for many franchises in the last six years. The post Aman Khan cricketer KKR: Why is Ajinkya Rahane not playing today’s IPL 2022 match between Sunrisers Hyderabad and Kolkata Knight Riders? appeared first on The SportsRush.","pubDate":"2022-04-15 14:05:16","full_description":"Why Ajinkya Rahane not playing today: Kolkata Knight Riders have made three changes to their Playing XI for this match. During the 25th match of the ongoing 15th season of the Indian Premier League between Sunrisers Hyderabad and Kolkata Knight Riders at the Brabourne Stadium, Sunrisers Hyderabad captain Kane Williamson has won the toss and chose to bowl. “We are gonna have a bowl first. It has been a good wicket but the dew factor has been a reason. Team is improving and growing as a unit. KKR is a strong side,” Williamson told Star Sports at the toss. With all-rounder Washington Sundar not being able to recover from his hand injury , Sunrisers have replaced him with an uncapped Indian all-rounder in Jagadeesha Suchith. Not affected much by the prospect of batting first, Kolkata Knight Riders captain Shreyas Iyer announced three changes made to their Playing XI. While opening batter Ajinkya Rahane has been left out on form, wicket-keeper batter Sam Billings and fast bowler Rasikh Salam have missed due to individual injuries. “I am happy batting first. [Aaron] Finch comes in and Aman Khan comes in. Sheldon Jackson is in as well. There are a few injuries in the camp. We had a good break in between. Can’t really say much about the pitch because it was tough to sight because of the grass,” Iyer told Star Sports at the toss. Gutted not to be there tonight. Been a rough week unfortunately 😷🤮 Sure the @KKRiders lads can get the job done 🙏🏼 #korbolorbojeetbo — Sam Billings (@sambillings) April 15, 2022 In five innings this season, Rahane has scored 80 runs at an average and strike rate of 16 and 100 respectively. Making his debut for KKR, Finch will be playing for his ninth IPL franchise . While Jackson has played a couple of matches this season, Aman Khan is making his IPL debut tonight. In fact, it is the first-ever competitive match for this 25-year old all-rounder from Mumbai. A hard-hitting all-rounder who had played age-group cricket with Iyer back in the day, Khan was picked for his base price of INR 20 lakh after being constant in IPL trials for many franchises in the last six years.","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Sunrisers Hyderabad vs Kolkata Knight Riders: IPL 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports","link":"https://sports.ndtv.com/cricket/sunrisers-hyderabad-vs-kolkata-knight-riders-live-score-over-match-25-t20-1-5-updates-2891398","keywords":null,"creator":null,"video_url":null,"description":"Live Updates of Today Match between Sunrisers Hyderabad vs Kolkata Knight Riders from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.","content":null,"pubDate":"2022-04-15 13:59:49","full_description":"A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com . After 5.1 overs, Kolkata Knight Riders are 31/3. The live updates of Sunrisers Hyderabad vs Kolkata Knight Riders scorecard is also available. It is the perfect platform to follow your favourite teams in Indian Premier League 2022. Keep a track on your favourite batsmen and bowlers through Indian Premier League 2022 today match, ball by ball commentary, Sunrisers Hyderabad vs Kolkata Knight Riders, Sunrisers Hyderabad vs Kolkata Knight Riders live score, Sunrisers Hyderabad vs Kolkata Knight Riders scorecard. Follow the excitement of the Indian Premier League 2022 on Sports.NDTV.com as you can follow live match updates and live cricket score through our platform. 4.6 overs (0 Run) Length and outside off, pushed to point. 4.5 overs (0 Run) No run. 4.4 overs (0 Run) On a length, around middle. Nitish Rana looks to block this but the ball goes off the outside edge towards cover. Nitish Rana comes in. 4.3 overs (0 Run) OUT! CAUGHT! SIX AND GONE! T Natarajan gets two wickets in the over now! Sunil Narine fails to carry on! A low full toss, around middle. Sunil Narine backs away and slices it uppishly but the ball goes off the bottom of the bat and lobs up towards Shashank Singh at point. He takes a good catch there! Kolkata in early trouble! 4.2 overs (6 Runs) SIX! KABOOM! Sunil Narine opens his account in style! A fuller ball, around middle. Sunil Narine smokes it over deep mid-wicket for a biggie! This is exactly why he has been sent at number 4! Sunil Narine is the new man in. 4.1 overs (0 Run) OUT! KNOCKED HIM OVER! What a start this is for Hyderabad! T Natarajan strikes on his very first ball! A length ball, nipping back in, around middle. Venkatesh Iyer looks to drive this but he misses. The ball goes in the gap between bat and pad and knocks the stumps. Kolkata are 2 down already! T Natarajan is into the attack now. 3.6 overs (0 Run) On a length, outside off, shaping away. Shreyas Iyer looks to drive this but he misses as the ball swings away sharply once again. 3.5 overs (1 Run) Bye! Sharp movement once again! Shorter ball, shaping away, outside off. Venkatesh Iyer looks to cut this away, but he misses. Nicholas Pooran fails to grab the ball as well. Aiden Markram, at first slip does well to stuck his right hand out and keep it down to one. Bye taken! 3.4 overs (1 Run) Fuller delivery, outside off. Shreyas Iyer pushes it towards mid off and takes a single. 3.3 overs (0 Run) Beaten! On a length, shaping away, outside off. Shreyas Iyer looks to push this away he misses. 3.2 overs (4 Runs) FOUR! Lucky boundary! Back of a length, around middle and off. Shreyas Iyer shuffles across and then backs away. He does well to keep the bat above his head and the ball goes off the bat over the slip fielder for a boundary. 3.1 overs (0 Run) Pitches it up, outside off. Shreyas Iyer drives it towards cover. 2.6 overs (0 Run) Swing and a miss! Fuller ball, swinging away, outside off. Venkatesh Iyer leans to drive but he misses. 2.5 overs (0 Run) Beaten! Beautiful delivery! Length delivery, shaping away, outside off. Venkatesh Iyer looks to punch this towards cover but he gets beaten on the outside edge. 2.4 overs (0 Run) Darting it on the pads, on a length. Venkatesh Iyer looks to flick this but he misses and gets hit on his pads. 2.3 overs (0 Run) Length delivery, around middle and off. Venkatesh Iyer pushes it towards cover. 2.2 overs (4 Runs) FOUR! Edgy runs! Full in length again, around middle. Venkatesh Iyer looks to drive this down the ground but the ball goes off the outside edge away from first slip towards third man for a boundary. 2.1 overs (3 Runs) Pitches it up, outside off. Shreyas Iyer drives it past cover. The ball will not race away to the boundary but the batters pick up three runs. 1.6 overs (0 Run) Back of a length, outside off. Venkatesh Iyer taps it towards point. Top over from Marco Jansen! 1.5 overs (0 Run) Good-length delivery, shaping away, outside off. Venkatesh Iyer steps down and looks to go over cover but he misses. 1.4 overs (0 Run) Beaten! Another length delivery, shaping away, outside off. Venkatesh Iyer looks to block this but he misses and gets beaten on the outside edge. 1.3 overs (1 Run) Wide of off, fuller ball. Shreyas Iyer miscues his drive towards mid off and scampers through to the other end. Shreyas Iyer walks out at number 3. 1.2 overs (0 Run) OUT! EDGED AND GONE! Marco Jansen strikes in his first over! Aaron Finch departs after a timid score. Early breakthrough for Hyderabad. A length ball, nipping back in, around off. Aaron Finch looks to push this but he gets a slight inside edge back to the keeper. Nicholas Pooran pouches it safely. 1.1 overs (1 Run) Lovely stop! A fuller ball, outside off. Venkatesh Iyer drives it towards cover. Jagadeesha Suchith dives to his left and makes a good stop. Single taken! 1.1 overs (1 Run) Wide! Marco Jansen begins with a fuller ball, down leg. Venkatesh Iyer misses his flik. Wide called! Who will bowl from the other end? It is Marco Jansen. Two slips in place. 0.6 over (0 Run) On a length, outside off. Aaron Finch taps it towards mid off. 9 runs off the first over! 0.5 over (6 Runs) SIX! Terrific shot! First six comes in the first over itself! A fuller ball, around middle. Aaron Finch tonks it over mid on all the way for a biggie! 0.4 over (0 Run) On a length, tailing back in, around middle and leg. Aaron Finch advances down the pitch and tries to flick this but he misses and gets hit on the pads. He wanted a single there but was sent back. 0.3 over (1 Run) Bye! Beaten! On a length, nipping back in, down leg. Venkatesh Iyer steps down and tries to heave this away but he gets beaten on the inside edge. The keeper fails to grab the ball as well and it rolls towards fine leg. The batters steal in a bye! 0.2 over (1 Run) Fuller length delivery, around off. Aaron Finch steps down the pitch and pushes it towards mid on for a single. Aaron Finch gets off the mark as well! 0.1 over (1 Run) Bhuvneshwar Kumar begins with a fuller ball, shaping away, outside off. Venkatesh Iyer guides it towards third man for a single. Kolkata and Venkatesh Iyer are up and running. We are all set for the action. The players of Hyderabad are out in the middle. Aaron Finch and Venkatesh Iyer are the openers for Kolkata. Bhuvneshwar Kumar has the ball. Here we go... Aaron Finch is down for a chat. He says it is a new franchise but he is happy as the team is off to a great start. Adds that he will bring some experience and he feels, he has good momentum behind him. Tells that, they are consistent and Shreyas is calm in leading his troops. Admits that there is a bit of movement with the new ball at all venues but at some stage, they have to bat first as well. Shreyas Iyer the skipper of Kolkata, says that he cannot really say much about the wicket, there is a lot of grass on it, but he is happy to bat first. Informs that Aaron Finch and Aman Khan will make their debut and Sheldon Jackson comes in as well. Kane Williamson the skipper of Hyderabad says they will bowl first, looks like a good wicket and they are considering the dew factor as well. Adds that they are improving and growing and they are just focusing on themselves. Informs Sundar misses out and Jagadeesha Suchith takes his place. Kolkata (Playing XI) - Aaron Finch (In for Ajinkya Rahane), Venkatesh Iyer, Shreyas Iyer (C), Sheldon Jackson (WK) (In for Sam Billings), Nitish Rana, Andre Russell, Pat Cummins, Sunil Narine, Aman Khan (In for Rasikh Dar), Varun Chakaravarthy, Umesh Yadav. Hyderabad (Playing XI) - Abhishek Sharma, Kane Williamson (C), Rahul Tripathi, Nicholas Pooran (WK), Aiden Markram, Shashank Singh, Marco Jansen, Bhuvneshwar Kumar, Jagadeesha Suchith (In for Washington Sundar), T Natarajan, Umran Malik. TOSS - Hyderabad have won the toss and they have elected to BOWL first. UPDATE - Aaron Finch and Aman Khan have been given their caps and they are all set to make their debut for Kolkata. Pitch Report - Simon Doull informs that there is a lovely grass coverage on it, and will give a nice pace and bounce. Adds that batters have made the most of scoring runs in the early stages here but hard to score in the fag end. Tells that the skipper will choose to bat first, put runs on the board and look around 185-190. Kolkata on the hand, will hope their openers get along as well because Ajinkya Rahane is getting ample support but in return, he is not giving the best result. Yet again toss will be a key factor in the game. So, what will it be bat or bowl first? We will find out. Stay tuned for the toss and other updates. Hyderabad will be without their key player Washington Sundar, who has given them the perfect balance with both bat and bowl. Hyderabad used him as a lone spinner but there might be some changes in the pack as they find someone who gives them the same aptitude. Kane Williamson and Abhishek Sharma have shown promising signs and Hyderabad will hope for another good performance on top from both of them. Hello and a warm welcome to the coverage of match number 25 where Hyderabad will take on Kolkata. Things have started to click for Hyderabad who have finally found the perfect balance after losing the first two games but they have a big task forward as they face Kolkata who are looking strong as ever and will look to bounce back and try and clinch the top spot in the points table. ... Match Day...","image_url":"https://edata.ndtv.com/twittergft/sport_automated_story/240.full_637856477809747549.png","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root: 'The right decision to resign as captain - for himself and England' - BBC","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzYxMTIwMjc50gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Joe Root: 'The right decision to resign as captain - for himself and England'  BBCJoe Root resigns as England Test cricket captain after torrid run  The GuardianJoe Root QUITS as captain of England's Test team  Daily MailEngland and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.uk‘You’re only as good as your players’: Darren Gough defends Joe Root’s record  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-04-15 13:54:38","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Mithali Raj to play in Women’s Senior T20 Trophy","link":"https://telanganatoday.com/mithali-raj-to-play-in-womens-senior-t20-trophy","keywords":["News","Sport","Jhulan Goswami","Mithali Raj","railways","Women's Senior T20 Trophy"],"creator":["Telangana Today"],"video_url":null,"description":"New Delhi: Speculations rife about her international future, India’s Test and ODI skipper Mithali Raj will be turning up for Railways at the Women’s Senior T20 Trophy beginning on April 18 in what will be her first competitive event since the Women’s World Cup. The future of stalwarts Mithali and Jhulan Goswami has been a […]","content":"New Delhi: Speculations rife about her international future, India’s Test and ODI skipper Mithali Raj will be turning up for Railways at the Women’s Senior T20 Trophy beginning on April 18 in what will be her first competitive event since the Women’s World Cup. The future of stalwarts Mithali and Jhulan Goswami has been a subject of debate since India’s early exit from the World Cup in New Zealand last month. While Jhulan is recovering from a side strain that she suffered during the global event, Mithali will groom the next generation of players in the Railways squad. Both are 39 and are at the business end of their illustrious careers. “Mithali will be there to guide the younger players. As a senior player, she understands her role really well. Anyway, she never misses domestic assignments when not on national duty,” a BCCI source said. Mithali, who is the leading run-getter in international cricket, had captained the Railways team to the title in the T20 competition last year. Her international T20 career came to an end in 2019. As far has her ODI and Test future is concerned, the source added: “There is no international cricket lined up in the near future. She has a lot of time to think over her future.” India’s next confirmed international assignment is in September when they play three T20s and as many ODIs in England after the Commonwealth Games in July-August. Majority of the players who were part of India’s World Cup squad will take part in the domestic event which will be held in a bio-bubble across six venues. That also includes India T20 captain Harmanpreet Kaur. The BCCI recently refused to give NOC to a few leading India players for the Fairbreak Invitational in Dubai as it wanted them to be available for the Women’s T20 Trophy and the following Women’s T20 Challenge which will be held alongside the IPL play-offs. Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter .","pubDate":"2022-04-15 13:47:25","full_description":"Home | Sport | Mithali Raj To Play In Womens Senior T20 Trophy Mithali Raj to play in Women’s Senior T20 Trophy By Telangana Today Published: Published Date - 07:17 PM, Fri - 15 April 22 File Photo New Delhi: Speculations rife about her international future, India’s Test and ODI skipper Mithali Raj will be turning up for Railways at the Women’s Senior T20 Trophy beginning on April 18 in what will be her first competitive event since the Women’s World Cup. The future of stalwarts Mithali and Jhulan Goswami has been a subject of debate since India’s early exit from the World Cup in New Zealand last month. While Jhulan is recovering from a side strain that she suffered during the global event, Mithali will groom the next generation of players in the Railways squad. Both are 39 and are at the business end of their illustrious careers. “Mithali will be there to guide the younger players. As a senior player, she understands her role really well. Anyway, she never misses domestic assignments when not on national duty,” a BCCI source said. Mithali, who is the leading run-getter in international cricket, had captained the Railways team to the title in the T20 competition last year. Her international T20 career came to an end in 2019. As far has her ODI and Test future is concerned, the source added: “There is no international cricket lined up in the near future. She has a lot of time to think over her future.” India’s next confirmed international assignment is in September when they play three T20s and as many ODIs in England after the Commonwealth Games in July-August. Majority of the players who were part of India’s World Cup squad will take part in the domestic event which will be held in a bio-bubble across six venues. That also includes India T20 captain Harmanpreet Kaur. The BCCI recently refused to give NOC to a few leading India players for the Fairbreak Invitational in Dubai as it wanted them to be available for the Women’s T20 Trophy and the following Women’s T20 Challenge which will be held alongside the IPL play-offs. Now you can get handpicked stories from Telangana Today on Telegram everyday. Click the link to subscribe. Click to follow Telangana Today Facebook page and Twitter . Follow Us : Tags Jhulan Goswami Mithali Raj railways Women's Senior T20 Trophy Related News Railways executing 16 projects in Telangana: Ashwini Vaishnaw I’ve not really thought about my future: Mithali on retirement ICC Women’s World Cup: India face Bangladesh in must-win game Jhulan Goswami becomes second women cricketer to play 200 ODIs ICC Women’s ODI World Cup: Australia outplay India by six wickets to qualify for semifinals Mithali Raj equals record of most 50 plus scores in Women’s World Cup","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Spoke Very Passionately About Test Cricket\": Kohli Remembers Shane Warne","link":"https://sports.ndtv.com/cricket/spoke-very-passionately-about-test-cricket-virat-kohli-remembers-shane-warne-2891124","keywords":null,"creator":null,"video_url":null,"description":"Speaking in a video shared by Royal Challengers Bangalore, Virat Kohli recalled his interactions with spin legend Shane Warne, whose death earlier this year shocked the cricket fraternity.","content":null,"pubDate":"2022-04-15 12:10:08","full_description":"Every interaction with the late Shane Warne was a learning experience, according to India and Royal Challengers Bangalore (RCB) batter Virat Kohli, who felt the spin legend always had constructive conversations. One of the all-time greats of the game, Warne died at the age of 52 due to a suspected heart attack in Thailand on March 4. \"I have tried to copy his actions at some stage or the other. That's the impact he had on the game of cricket, and he was an amazing human being as well. I had a chance to speak to him quite a bit off the field as well,\" Kohli said on RCB Bold Diaries. \"He was always positive and none of his conversations were random. It was always constructive, that you can learn from and spoke very passionately about Test cricket and cricket in general, he just loved the game.\" The Australian was a spin wizard who made the world fall in love with his craft. He is credited with reviving the art of leg-spin bowling. He took 708 wickets from 145 Tests, in an illustrious career spanning 15 years. Warne's death came as a shock not just to the cricket community but beyond. \"It was a shock to everyone, but we can just smile and look back at his cricketing career, his achievements, and his life, he lived the way he wanted to live. \"He is probably the most confident personality that I have met, I am grateful that I have got to know him a little bit off the field as well,\" Kohli added. For compatriot Glenn Maxwell, Warne was a \"hero\" growing up, who changed the perception of spin bowling. \"I had a lot of heroes when I was growing up watching people play, not necessarily just from cricket but from other sports as well, Shane Warne was certainly one of them. \"He revolutionised the game, he changed the perception of spin bowling around the world. All of a sudden, after he came on the scene, every team needed to have a leg-spinner to be a successful team,\" Maxwell said. Promoted \"I suppose the person that he was away from the field was probably more inspiring to me.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2022-03/1fhseco8_shane-warne-afp_625x300_08_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Chahar ruled out of IPL due to back injury, DC physio tests positive for Covid-19","link":"https://www.orissapost.com/deepak-chahar-ruled-out-of-ipl-due-to-back-injury-dc-physio-tests-positive-for-covid-19/","keywords":["Sports","COVID-19","csk","Deepak Chahar","Delhi Capitals physio","Patrick Farhart"],"creator":["Post News Network"],"video_url":null,"description":"Mumbai: Chennai Super Kings all-rounder Deepak Chahar was Friday ruled out of the IPL with a back injury, while Delhi Capitals physio Patrick Farhart tested positive for Covid-19. Chahar had also suffered a hamstring injury during the home series against the West Indies in February. KKR pacer Rasikh Salam is also out the of the […]","content":"Mumbai: Chennai Super Kings all-rounder Deepak Chahar was Friday ruled out of the IPL with a back injury, while Delhi Capitals physio Patrick Farhart tested positive for Covid-19. Chahar had also suffered a hamstring injury during the home series against the West Indies in February. KKR pacer Rasikh Salam is also out the of the IPL with a lower back injury with young Delhi pacer Harshit Rana named as his replacement. “Chennai Super Kings bowler Deepak Chahar has been ruled out of the TATA Indian Premier League (IPL) 2022 owing to a back injury,” said the IPL in a statement. “Kolkata Knight Riders (KKR) have signed fast bowler Harshit Rana as a replacement for pacer Rasikh Salam for the rest of the TATA IPL 2022 season. Salam, who played 2 games for KKR this season, has been ruled out owing to a lower back injury and will take no further part in the tournament. “His replacement, Harshit Rana, from Delhi will join KKR at his base price of INR 20 Lakh.” On Farhart, a former physio of the Indian cricket team, the statement added: “Delhi Capitals physio Patrick Farhart has been tested positive for Covid-19. He is being closely monitored by the DC Medical Team at the moment.” With cases gradually rising, Covid threat has increased during the two-month-long IPL. Last year, the tournament had to be suspended at the peak of the second wave in May and was later completed in the UAE. The BCCI is staging the premier T20 event in four stadiums across Maharashtra to minimise the Covid-19 threat. However, the play-offs are expected to be played outside the state. The league games are being held in Mumbai, Navi Mumbai and Pune.","pubDate":"2022-04-15 11:57:40","image_url":"https://www.orissapost.com/wp-content/uploads/2022/02/Deepak-Chahar-300x168.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"Umesh Yadav: Shreyas Iyer has been the best captain for me","link":"https://sportstar.thehindu.com/cricket/ipl/umesh-yadav-interview-kkr-shreyas-iyer-white-ball-cricket-ipl-2022/article38473871.ece","keywords":null,"creator":["Wriddhaayan Bhattacharyya"],"video_url":null,"description":"In an interview, India and KKR fast bowler Umesh discusses his preparations for the season, and how he has adapted to white-ball cricket without much game time.","content":null,"pubDate":"2022-04-15 11:43:27","full_description":"Umesh Yadav has turned over a new leaf in his career. The veteran fast bowler has already bagged 10 wickets in his first five outings with the Kolkata Knight Riders in the 2022 edition of the Indian Premier League. And he has delivered 62 dot balls - the most thus far in three weeks of high-voltage action. Umesh is currently second in the Purple Cap race led by Yuzvendra Chahal. He opens up to Sportstar ahead of the clash against Sunrisers Hyderabad on Friday. The 34-year-old discusses his preparations for the season, and how he has adapted to white-ball cricket without much game time. Q. There have been considerable gaps in your white-ball career and even in the IPL. You have been bowling in Test matches, but how challenging is it to adapt to the shorter formats? A. It should not be that difficult for any bowler. When you play with the red ball, the length is the same. The length of a bouncer is the same in Test cricket as in white-ball cricket. The concept of a good length is no different. So if you can bowl well in Test cricket, there should not be much of a problem. There are little things like the slowers and yorkers which need work. But these days, if you have noticed, there is a trend of slowers and yorkers in red-ball cricket too. The bowlers try out these variations in Test matches when the wickets don't assist. But visualising and executing are two different things... Thinking, bowling and executing are different things. At times, you may not be able to execute. Even the batters have evolved like the bowlers with their variations. There are things like a lap shot in cricket now. Adapting is not too difficult. ALSO READ - Deepak Chahar ruled out of IPL 2022 with back injury Can you tell us about your preparations specifically for this IPL? It's more or less the same thing that I have been doing over the years. But yes, once you gain experience, you know the areas that may need work. I am working on my weak points and trying to make the strong points stronger. When I practice, I try to understand how my strength can help the team win the games. I plan on my own - the field, the setup against a particular batter. I try to apply such things at the nets, and usually, I try to mix things up. If you start complicating things in cricket, it can get confusing in the long run. It is better to keep the basics right with a clear mind. In IPL, you can get wickets but can also concede runs. You have to be ready for that. The batter can score a fifty or get dismissed for a duck. And that's the nature of the game. It is not a good feeling to get hit for a six after running in hard and bowling... It can happen in T20 cricket. You have to keep a strong mind and heart to operate in a tournament like the IPL. Your face should not turn pale if you leak a few runs after picking up wickets. Do you specifically study and plan against batters in the IPL? There are meetings before games. The opponent batters are analysed, their scoring and non-scoring areas are studied. You have to gauge their weak and strong points, do a little bit of mental calculation and plan the bowling accordingly. How much time have you been spending at the gym? The more you love your body, it will love you back. Whenever I am free and not practising, I try to follow my workout programme. I try to do those workouts that may help my body. It is part of my work ethic. How is it to play under Shreyas Iyer’s leadership? When you know that you are doing well, it is fine, but when you don't do well, there is a bit of pressure. Shreyas knows that I have been around for a long time and he understands me. He supports and backs me. He knows that I can handle my game even when the chips are down. He expects me to bowl to my strength and play the role that has been assigned. He has even come up to me to ask for suggestions. He is very relaxed and knows his job. He has been the best captain for me since I got a chance after such a long time. You have always been a big hitter of the ball. Now with most seamers batting well and making the competition stiff, do you plan to work more on your batting to perhaps play an all-round role? At times, batting can give you the edge. If you are going overseas where there is a requirement for a fast-bowling all-rounder, and if you happen to be a decent batter, it can help.","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Chahar Of Chennai Super Kings Ruled Out Of IPL 2022 With Back Injury - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2lwbC0yMDIyL2lwbC0yMDIyLWNza3MtZGVlcGFrLWNoYWhhci1ydWxlZC1vdXQtb2YtdG91cm5hbWVudC13aXRoLWJhY2staW5qdXJ5LTI4OTA5NDPSAXNodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMi9pcGwtMjAyMi1jc2tzLWRlZXBhay1jaGFoYXItcnVsZWQtb3V0LW9mLXRvdXJuYW1lbnQtd2l0aC1iYWNrLWluanVyeS0yODkwOTQzL2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Deepak Chahar Of Chennai Super Kings Ruled Out Of IPL 2022 With Back Injury  NDTV SportsChennai Super Kings bowler Deepak Chahar to play no part in IPL 2022  ESPNcricinfoIPL 2022: CSK pacer Deepak Chahar, KKR's Rasikh Salam ruled out of whole season due to back injuries  India TodayIPL 2022: CSK' Deepak Chahar sustains an injury, to miss 4 months of cricket| Oneindia News  Oneindia NewsIPL 2022: CSK pacer Deepak Chahar ruled out of entire season, DC physio tests positive for COVID-19  Times NowView Full coverage on Google News","content":null,"pubDate":"2022-04-15 11:22:35","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Chahar ruled out of TATA IPL 2022, Harshit Rana joins KKR as a replacement for Rasikh Salam - IPLT20.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiggFodHRwczovL3d3dy5pcGx0MjAuY29tL25ld3MvMzc2NC9kZWVwYWstY2hhaGFyLXJ1bGVkLW91dC1vZi10YXRhLWlwbC0yMDIyLWhhcnNoaXQtcmFuYS1qb2lucy1ra3ItYXMtYS1yZXBsYWNlbWVudC1mb3ItcmFzaWtoLXNhbGFt0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Deepak Chahar ruled out of TATA IPL 2022, Harshit Rana joins KKR as a replacement for Rasikh Salam  IPLT20.comChennai Super Kings bowler Deepak Chahar to play no part in IPL 2022  ESPNcricinfoDeepak Chahar Of Chennai Super Kings Ruled Out Of IPL 2022 With Back Injury  NDTV SportsIPL 2022: Deepak Chahar ruled out for season in body blow for CSK, DC physio tests positive for COVID-19  FirstpostIPL 2022: CSK' Deepak Chahar sustains an injury, to miss 4 months of cricket| Oneindia News  Oneindia NewsView Full coverage on Google News","content":null,"pubDate":"2022-04-15 11:08:49","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Joe Root resigns as England Test captain - and what it means for English cricket - The Telegraph","link":"https://news.google.com/__i/rss/rd/articles/CBMiVWh0dHBzOi8vd3d3LnRlbGVncmFwaC5jby51ay9jcmlja2V0LzIwMjIvMDQvMTUvam9lLXJvb3QtcmVzaWducy1lbmdsYW5kLXRlc3QtY2FwdGFpbi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Joe Root resigns as England Test captain - and what it means for English cricket  The TelegraphJoe Root resigns as England Test cricket captain after torrid run  The GuardianBREAKING: Joe Root steps down as England men's test cricket captain  talkSPORTEngland and Wales Cricket Board (ECB) - The Official Website of the ECB  ECB.co.ukJoe Root QUITS as captain of England's Test team  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-04-15 11:07:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Root quits as England Test cricket captain after 5 years","link":"https://www.business-standard.com/article/sports/root-quits-as-england-test-cricket-captain-after-5-years-122041500518_1.html","keywords":null,"creator":null,"video_url":null,"description":"Root leaves his post holding the record for the number of wins as England Test captain -- at 27","content":null,"pubDate":"2022-04-15 11:03:00","full_description":"Joe Root stepped down as England's Test cricket captain on Friday, ending his five-year spell in a role that became increasingly challenging because of the team's long run of series defeats -- including 4-0 in the Ashes over the winter. \"I have loved leading my country,\" Root said, \"but recently it's hit home how much of a toll it has taken on me and the impact it has had on me away from the game.\" Root leaves his post holding the record for the number of wins as England Test captain -- at 27 -- while his status as one of the world's leading batters is secure after scoring eight centuries since the turn of 2021. However, his captaincy has come under scrutiny with England having only won just one of its last 17 Test matches -- the country's worst run since the 1980s. Losing heavily in Australia, England's biggest rival, was followed last month with a 1-0 series defeat to the West Indies. That made it four series defeats in a row -- and it could be five unless England can beat India in July in the remaining test left over from their unfinished series from last year. \"It has been the most challenging decision I have had to make in my career,\" said the 31-year-old Root, who took over as captain from Alastair Cook in 2017, \"but having discussed this with my family and those closest to me; I know the timing is right.\" Root said he wanted to carry on playing for England, for whom he is the country's second highest run-scorer in Tests behind Cook. It leaves England's men's team not only without a captain, but also a coach and director of cricket after the departures of Chris Silverwood and Ashley Giles, respectively, in the wake of the Ashes. Ben Stokes will be among the favourites to take over as captain, although the allrounder has just returned to the team after a spell out for mental-health reasons. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220415/thumb-122041500518.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL 2022: KKR vs SRH Dream 11, Fantasy Cricket Tips, Dream 11 Team, Probable Playing XI for KKR vs SRH","link":"https://www.indiatvnews.com/sports/cricket/kkr-vs-srh-dream11-prediction-fantasy-cricket-tips-dream11-team-playing-xi-pitch-report-tata-ipl-2022-2022-04-15-769934","keywords":null,"creator":null,"video_url":null,"description":"KKR vs SRH Dream 11 IPL 2022: Fantasy Cricket Tips, Dream 11 Team, Probable Playing XI for Kolkata Knight Riders vs Sunrisers Hyderabad Match Details","content":null,"pubDate":"2022-04-15 10:30:36","full_description":"Kolkata Knight Riders vs Sunrisers Hyderabad Match No. 25 of 2022 Friday, 7:30 PM Brabourne Stadium, Mumbai Average first innings total: 194.2 Average powerplay score: 53.3 Spinners will enjoy bowling on this surface. The chasing team has an advantage. , Venkatesh Iyer, Shreyas Iyer, Nitish Rana, Sheldon Jackson, Andre Russell, , , ,Rasikh Dar, Varun Chakaravarthy. , Abhishek Sharma, Abdul Samad, Nicholas Pooran, , Romario Shepherd, Shashank Singh, Marco Jansen, , Umran Malik, T Natarajan. Pat Cummins (C), Kane Williamson (VC), Nicholas Pooran, Sunil Narine, Andre Russell, Aaron Finch,Bhuvneshwar Kumar, Varun Chakaravarthy, Umesh Yadav, Shreyas Iyer, Abhishek Sharma Abhishek Sharma, Kane Williamson, Rahul Tripathi, Nicholas Pooran, Aiden Markram, Shashank Singh, Bhuvneshwar Kumar, Marco Jansen, Umran Malik, T Natarajan, Shreyas Gopal, Abdul Samad, Sean Abbott, Ravikumar Samarth, Jagadeesha Suchith, Glenn Phillips, Vishnu Vinod, Priyam Garg, Kartik Tyagi, Romario Shepherd, Fazalhaq Farooqi, Saurabh Dubey Star Sports Network - Star Sports 1 and Star Sports 1HD, Star Sports Select 1 and Star Sports Select 1HD (Dugout). Hotstar Friday, 15th April 7:30 PM IST Brabourne Stadium, Mumbai","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}