{"newsArray":[{"title":"Cricket: Andrew Alderson - Why Kane Williamson was the Black Caps’ greatest test captain","link":"https://www.nzherald.co.nz/sport/cricket-andrew-alderson-why-kane-williamson-was-the-black-caps-greatest-test-captain/D7Y2MXW4OBHALFE74EZSY7LPTA/","keywords":null,"creator":null,"video_url":null,"description":"Kane Williamson’s test captaincy has left an indelible mark on NZ cricket history.","content":"OPINION: Kane Williamson’s test captaincy has left an indelible mark on New Zealand cricket history. Regardless of where the Black Caps venture under the guidance of his successor Tim Southee, fans can always point to a pioneering moment at Southampton last year when Williamson and his merry band raised the mace to the world as the inaugural champions in the format. Other leaders enjoyed tenures of greatness. Walter Hadlee established a level of international respect with the ‘49ers upon which future endeavours were measured by drawing four tests in England; Geoff Howarth’s influence saw New Zealand unbeaten in home series from 1980 until his 1985 retirement; Jeremy Coney’s shrewdness secured maiden series wins in Australia and England; Stephen Fleming’s pragmatism leveraged the best from a period of instability in the mid-1990s; and Brendon McCullum’s chutzpah provided a catalyst for fun and success again with his liking for tradition and loathing for convention. Williamson trumps those reigns by forging New Zealand’s reputation in his own selfless image. He has never sacrificed sincerity or manners at the altar of bravado. Such a conciliatory approach has been documented since primary school when he would clap other players off the field first, despite his own star performances. He has consistently maintained an inclusive culture over a back-of-the-bus mentality. Behind the former skipper’s iridescent sunglasses, zinced lips and coiffed beard at mid-off lay a cricketing mind driven as much by empathy for teammates as winning at all costs. He worked on the basis the game was nurtured and grown in the community on the basis of what the public saw of his side’s actions. Williamson taught a legion of fans that victories are constructed by feel rather than painted by numbers. Intertwined with those values came an abundance of triumphs. Comparing captaincy eras is a flawed task given today’s cluttered professional landscape versus the rare amateur opportunities of yesteryear, but Williamson’s CV stacks up irrespective of measure. Kane Williamson lifts the ICC World Test Championship Mace. Photo / Getty He had 40 matches in charge for a 55 percent winning record of 22 victories, 10 losses and eight draws. The next best is Tom Latham’s 44 percent with four wins from nine tests, then Howarth’s 37 percent with 11 wins from 30. Advertisement Advertise with NZME. In addition, Williamson’s batting average of 57.43 from 65 innings as skipper contrasted against 49.23 from 89 innings without the reins. His test captaincy was marked by a lack of panic under pressure, an ethos that seeped like osmosis through the team. He wanted to play in sides with an indomitable spirit: All for one, one for all. His more than 12-year test career and six years at the helm have rejuvenated a love of the game for many. Yes, there were blind spots; New Zealand failed to eke out wins away against India, South Africa or Australia. On a personal level, an insubordinate left elbow, a gatecrashing Covid-19, a pesky ‘flu and the joy of fatherhood saw him miss nine of the country’s last 19 tests. At 32, he will continue as a specialist test batter and remain skipper in white-ball formats but another concern is emerging. Southee is 34 and other recent stand-in skippers Latham and Mitchell Santner are 30. More succession planning is needed. The search must accelerate for the next Williamson among a younger generation, albeit whoever is anointed must still embrace the mantra of being themselves. Williamson’s leadership success has been wedded to charting his own course and refusing to bow to peer or media pressures about expectation. The loyal fortress surrounding the team might provide vanilla “trusting the process” type copy at times, but has been intrinsic in creating an environment of trust. Celebrate the Williamson years while they last. Advertisement Advertise with NZME. Save share Share this article Reminder, this is a Premium article and requires a subscription to read. facebook copy link twitter linkedin reddit email","pubDate":"2022-12-15 23:47:58","image_url":"https://www.nzherald.co.nz/resizer/BMObFlqnUGNKb2bZxI-GtHIDgqk=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/Z3DU4X22MJFPNCN5MDFAR63YUM.jpg","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Free cricket is back: Spark exits sport, shifts content to TVNZ","link":"https://www.newstalkzb.co.nz/news/sport/free-cricket-is-back-spark-exits-sport-shifts-content-to-tvnz/","keywords":null,"creator":null,"video_url":null,"description":"Free cricket is returning to Kiwi screens. Spark said this morning it has reached a deal with TVNZ, which “will become the home of the majority of Spark Sport content, subject to rights holder agreement, from July 1, 2023.” NZ Cricket public affairs manager Richard Boock told the Herald that domestic cricket will be free-to-air on TVNZ and free-to-stream on TVNZ+. The public broadcaster will not paywall any content. The Herald understands that TVNZ will take over the production of domestic cricket, but that Spark will continue to pay NZ Cricket the rights fee over the remaining three years of its contract. Spark says “the majority” of content because Formula 1 - Spark Sport’s other major property - still hangs in the balance. Whether it ultimately appears free on TVNZ is the subject of ongoing negotiations between Spark and Formula 1, a TVNZ spokeswoman tells the Herald. “Customers can continue to access Spark Sport as they normally do until July 1, 2023,” a Spark spokeswoman told the Herald. “We will be communicating with any customers who are still on a [$255] 12-month contract come July 1 and offering them a refund for their remaining term. If any customers have concerns about the changes to Spark Sport, we encourage them to get in contact with us to discuss their options.” Spark said there would be no change to its earnings guidance and final details will be announced following discussions with other rights holders. Spark CEO Jolie Hodson said while she was proud of what the service had achieved, “At the same time. it has been challenging to reach the scale we aspired to across the Spark Sport platform, with Covid causing major disruption to sporting codes globally just a year after launch. That slower-than-expected start, coupled with the escalating costs of content rights globally, makes it difficult to justify the type of investment Spark Sport requires when we have a wider range of investment opportunities across our broader business.” Sky maintains rights to most international cricket content. The pay-TV broadcaster has recently won back English Premier League and Rugby World Cup rights. More soon EARLIER Spark is close to a deal to sell Spark Sport, the Herald understands, and an announcement is possible within days. The Herald understands from market analysts and sports world sources that the telco will transfer the business to TVNZ. A joint venture setup is also on the cards. In an NZX filing at 11.33am, following the publication of the Herald’s original story this morning, Spark said, “In response to media reporting, Spark today confirmed it is in discussions with TVNZ regarding a potential content partnering agreement covering the majority of Spark Sport’s portfolio.” It added, “Discussions are ongoing and incomplete, and Spark will keep the market updated in accordance with its continuous disclosure obligations.” Spark and TVNZ refused further comment. The state broadcaster is already Spark’s free-to-air partner for cricket coverage. TVNZ has previously said it is open to the possibility of paid-streaming content. An insider says there’s been a desire to push a deal through before the TVNZ-RNZ merger, which could now be dead in the water. Earlier this year, Spark Sport relinquished English Premier League football rights to Sky. And recently, Sky took back rights to the Rugby World Cup, with a multi-tournament deal running through to 2029. Its highest profile remaining assets are Formula One rights, and domestic cricket rights — on a contract with three years left to run at what the Herald understands is around $36m per year. There has been market chatter around a possible Spark Sport sale for several months. In May, Jarden analyst Arie Dekker told the Herald a sale would make sense. Streaming sport was a relatively high-risk, low-reward endeavour for the telco, which copped brand damage when a key 2019 Rugby World Cup clash between New Zealand and South Africa stuttered, with second-half coverage simulcast through TVNZ. Dekker said Spark — which earlier sold its Lightbox entertainment-streaming business to Sky in a $6m deal in 2020 — would be better off ditching the distraction of sports streaming in favour of focussing on its much larger core business, where it was performing well. Spark has never released subscriber numbers or financials for Spark Sport, which is included in an omnibus “other” category in its results that includes several business units. But the Herald understands the service is a money loser. “Spark has been struggling to build a platform with sufficient recurring content to attract a broad audience,” Dekker said. “In our view an exit from Spark Sport makes sense given the difficulty getting traction and questions around the size of the profit pool in pay-tv sport given competition and the power of rights holders.” At the time, Spark CEO Jolie Hodson said the telco was committed to building a content-strong portfolio, adding the qualifier that deals had to make commercial sense. Telcos around the world offload sport Another factor: In an industry driven by global trends, telcos are blowing the whistle on their sports-broadcasting ambitions. Mid-year, British Telecom said it would receive £93m deal that would see BT Sport become a wholly-owned subsidiary of Eurosport (part of Warner Bros. Discovery). It was the creation of BT Sport in 2012 that kicked off the global craze for telcos getting into sports streaming when it seized a chunk of Premier League rights. At the time, sport was seen as a loss leader that could be used to sell broadband plans, or keep current customers loyal. But telcos’ very entry into sports rights — followed by the likes of Amazon and Apple — has seen content costs spiral. “BT has been wanting to exit sports for some time, and this is its get-out-of-jail-free card,” media analyst Paolo Pescatore told the FT. Across the Tasman, Telstra last year stopped streaming AFL and NRL games in favour of offering its customers discounted Foxtel access. And although Optus recently renewed its EPL contract, earlier this month it gave up rights to UEFA football matches to Stan — a unit of traditional broadcaster Nine. Sports bodies themselves are also experimenting with direct-to-consumer streaming services. The latest is Fifa’s streaming service, which has the potential to evolve into a global Netflix of football, but England’s Premier League has also talked-up plans for a possible global “Premflix” service. Under a US$2.5b deal, Apple is making American Major League Soccer available worldwide, including in New Zealand. While it’s fair to say few in Godzone care about the fortunes of LA FC, the deal creates something of a template for the global streaming of any given competition. Meanwhile, two Disney direct-to-the-consumer properties — Disney+ and ESPN+ — continue to grow strongly, proving the potential of cutting out both old-school and digital-era middlemen. Some traditional broadcasters — including Sky in NZ — at first seemed to be teetering with streaming, but have now got their technical and commercial act together with digital technologies. Spark shares were down 0.38 per cent in midday trading, pacing a fall in the broader market. With reporting by Gregor Paul.","content":null,"pubDate":"2022-12-15 20:24:28","image_url":"https://www.newstalkzb.co.nz/media/zvoboohl/finn-allen-photosportnz.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Cricket Cranes pick up two wins in Kigali Tri-Series","link":"https://kawowo.com/2022/12/15/cricket-cranes-pick-up-two-wins-in-kigali-tri-series/","keywords":["Cricket"],"creator":["Denis Musali"],"video_url":null,"description":"Match 3: Uganda v Rwanda Match Summary: Uganda 168/9 Rwanda 35/9 Uganda won by 133 runs Match 4: Uganda v Tanzania Uganda 169/9 Tanzania 156/9 Uganda won by 13 runs The highlight from the action today at the Gahanga was the half century scored by Roger Mukasa for the Cricket Cranes in the afternoon. 89 […] The post Cricket Cranes pick up two wins in Kigali Tri-Series appeared first on Kawowo Sports.","content":"Match 3: Uganda v Rwanda Match Summary: Uganda 168/9 Rwanda 35/9 Match 4: Uganda v Tanzania Uganda 169/9 Tanzania 156/9 The highlight from the action today at the Gahanga was the half century scored by Roger Mukasa for the Cricket Cranes in the afternoon. 89 from 62 balls, a knock that included 13 fours and two maximums was a delight to watch from a player that has been desperate for a big knock. He was out for zero in the 1st game he played, he was rested for the morning game against Rwanda but when he got off the mark with a boundary in the afternoon everyone was hoping that he makes it count. The absolute team man Roger Mukasa had fallen out of favor and a quick return into the side for the Global T20 Qualifiers in Zimbabwe in July never helped his cause. After a lot of hard work in the practice games, the old Roger Mukasa is finding his form and this afternoon he showed glimpses of his quality. He missed aggression, wit, and assured running between the wickets to bring his half-century, he could have gotten a century after reaching his fifty with over nine overs left in the match but he put the team’s needs before his own personal glory. He fell in the final over of the innings but his anchoring helped Uganda get to 169/9 after he batted with nearly everyone. Tanzania pushed Uganda in the afternoon encounter especially after Ivan Suleiman decided to take on the quick bowlers Cosmas Kyewuta and Juma Miyagi. If they had been contributions from the Tanzania middle order there wouldn’t have been a lot of work to do for the tail. However, the tail-enders even with 49 required from 18 balls took matters into their hands, in the end, running out of resources with 13 runs still required. The 1st proper test for the Cricket Cranes in the 3 nation series and a sign that there is a lot more in stock from where that came from. In the morning game, Uganda crawled to 168/9 in their 20 overs, with no real stand-out contributions with the bat apart from Simon Ssesazi (35) and Pascal Murungi (22) plus a late cameo from Bilal Hassun (20) got them to a good total. Hassun (3/4) was the destroyer in chief as Rwanda was cleaned up for just 35 to complete a routine win for the Cricket Cranes. There is little time to rest as the men in yellow will be back in action tomorrow morning against Rwanda.","pubDate":"2022-12-15 19:20:13","image_url":null,"source_id":"kawowo","country":["uganda"],"category":["sports"],"language":"english"},{"title":"Ist Test, Day-2: Kuldeep’s dream comeback puts Bangladesh on mat","link":"https://kashmirreader.com/2022/12/16/ist-test-day-2-kuldeeps-dream-comeback-puts-bangladesh-on-mat/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Chattogram: Kuldeep Yadav sizzled with an all-round performance as he put India in the driver’s seat on day two of the opening Test against Bangladesh here on Thursday. Playing his first Test after more than 22 months, Kuldeep continued his ‘birthday’ party a day after turning 28, in his sensational run with the bat and […]","content":"Chattogram: Kuldeep Yadav sizzled with an all-round performance as he put India in the driver’s seat on day two of the opening Test against Bangladesh here on Thursday. Playing his first Test after more than 22 months, Kuldeep continued his ‘birthday’ party a day after turning 28, in his sensational run with the bat and ball. Batting at number nine, the left-hander first came up with a career-best 40 from 114 balls (5×4) in a 92-run eighth wicket partnership with veteran Ravichandran Ashwin (58; 113b) to push India to 404 in their first inning from an overnight score of 278/6. Coming into bowl in the 25th over, the left-arm wrist spinner struck off his second ball as he flummoxed the Bangladesh batters with his wrong ones to end the day with figures of 10-3-33-4, a performance that is certain to regain his confidence. At stumps on day two, Bangladesh were 133 for eight, trailing India by 271 runs. With two wickets in hand, the hosts still need 72 runs to avoid a follow-on. First, it was Indian quick Mohammed Siraj who was on a song, as he rattled the Bangladesh top-order, dismissing the left-handed opening duo of Najmul Hossain Shanto (1), Zakir Hasan (20) and Litton Das en route to 9-1-14-3. Siraj struck in the very first ball when he induced an edge off Shanto with an away going delivery. Leading the pace department in absence of Mohammed Shami and Jasprit Bumrah, Umesh Yadav then reduced Bangladesh to 5 for 2 inside the fourth over after inducing an inside edge off Yasir Ali. Litton Das (24) showed glimpses of his form with some fluent drives but Siraj had the last say. Both teams were also involved in a bit of banter especially after Das gave a ‘I can’t hear you’ gesture after an elegant drive off Siraj. The Indian pacer cleaned him up of the next delivery as he along with Kohli gave him a fiery send-off. On a roll, Siraj also ended the dogged resistance of Hasan to reduce Bangladesh to 56/4. The stage was just apt for Kuldeep to make inroads and the Indian did just that, dismissing Shakib Al Hasan when the Bangladeshi senior all-rounder played against the spin. He then surprised newcomer Nurul Hasan with a wrong one and in the next ball nearly dismissed him LBW but the ‘umpire’s call’ rule gave a breather to the Bangladeshi wicketkeeper. It was not a rank-turner but he spun the ball square, extracted awkward bounce and the Bangladeshi batters looked all at sea negotiating Kuldeep at the fag end of the day. “I was a bit nervous, I was very lucky to get the first wicket in the first over. Got the momentum back. After a couple of overs, I started feeling well, mixed my pace and variations, tried both the angles – over the wicket and round the wicket,” Kuldeep said. “I was getting proper turn, I was actually loving it. After I got injured, I started working on my rhythm, trying to be a bit quicker – that’s helping me a lot. I am not compromising with the spin. “I didn’t face any discomfort while batting. I thought it’ll be good for batting. When you’re a wrist-spinner bowling with the Kookaburra ball, you’ll definitely get turn and bounce on such wickets,” he added. The opening session was all about Ashwin and Kuldeep who seized the opportunity with both hands coming up with an all-round show in absence of Ravindra Jadeja. Kuldeep, who has a century and six fifties averaging 22-plus in first class cricket, got off the mark after 18 balls as he looked solid with his defence. His slog sweep and reverse sweep shots also caught the attention in his knock off 114 balls with five fours. Ashwin, who has five Test centuries including four against the West Indies, showed a lot of composure and maturity en route to his 13th Test half-century. Ashwin smashed two sixes and two fours in his 113-ball knock. Ashwin made his intent clear stepping down to Mehidy for a six. Luck also favoured Ashwin when he survived an ‘umpire’s call’ after left-arm spinner Taijul Islam had him trapped in front of the leg stump when he was on 34. The duo hardly took a foot wrong pushing India past the 400-mark after the visitors resumed the day at 278 for 6 and lost overnight batter Shreyas Iyer (86) with the addition of just four runs to his total. Having batted India out of a tricky spot on the opening day, Iyer once again failed to get to a well-deserved hundred. That pace spearhead Ebadot Hossain was taken out of the attack after his impressive spell of 4-1-7-1 in the morning also helped the Indian cause. Kuldeep also oozed confidence as Ashwin was happy to take singles and give him the strike. PTI Ist Test, Day-2: Kuldeep’s dream comeback puts Bangladesh on mat added by Press Trust of India on 12:11 am December 16, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-15 18:41:58","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Kohli knows when to be aggressive and when to control the game: Dravid","link":"https://kashmirreader.com/2022/12/16/kohli-knows-when-to-be-aggressive-and-when-to-control-the-game-dravid/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Chattogram: Virat Kohli, with his incredible understanding of the game, can easily decipher when to switch gears and when to control the proceedings, said head coach Rahul Dravid, who was also mighty impressed with the way the Indian premier batter maintains his intensity during training. Kohli found form during the Asia Cup in the UAE […]","content":"Chattogram: Virat Kohli, with his incredible understanding of the game, can easily decipher when to switch gears and when to control the proceedings, said head coach Rahul Dravid, who was also mighty impressed with the way the Indian premier batter maintains his intensity during training. Kohli found form during the Asia Cup in the UAE earlier this year after enduring an extended lean patch. He continued his magnificent run in the T20 World Cup in Australia. Last week, the former India captain brought up his 44th ODI hundred. “He (Virat) knows when to be aggressive and when to control the game, it’s incredible to watch and a good sign for us if he can build up,” Dravid said in a video released by the BCCI on its website. “Virat has an incredible template in 50-over cricket. His record speaks for itself. It’s phenomenal the number of games he’s played.” Dravid added that Kohli’s training intensity never wanes whether he is in form or not, and that’s something the youngsters in the team can learn. “He feels he’s back and is training as hard as I have ever seen him. For me, that has been a stand out, watching him train this past year, that never changes irrespective of whether he is doing well or not and that is a great lesson for a lot of the young players in the group,” added Dravid. The former Indian batter felt teams have become more aggressive and are pushing for results as the race for the World Test Championship final spots heats up. “Teams have already been more aggressive over the last bit; we have seen a lot more results. Teams are playing for results a lot more now, especially with the World Test Championship points at stake.” Dravid believes teams must be able to adapt to every situation to succeed in Test cricket. —PTI Kohli knows when to be aggressive and when to control the game: Dravid added by Press Trust of India on 12:08 am December 16, 2022 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2022-12-15 18:38:25","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Caesars Travel lift winners trophy – SalamAir holds 1st Travel Agency Cricket Tournament in Kuwait","link":"https://www.arabtimesonline.com/news/caesars-travel-lift-winners-trophy-salamair-holds-1st-travel-agency-cricket-tournament-in-kuwait/","keywords":["Sports","Kuwait Cricket"],"creator":["Arab Times"],"video_url":null,"description":"Winners Caesars Invaders KUWAIT CITY, Dec 15: SalamAir in Kuwait held its first Cricket Tournament for travel agency staff, in a format never seen or played before in Kuwait, with 16 Teams participating from various regions of Kuwait. The event was organized by Faisal Khan, the newly appointed Country Manager who recently arrived in Kuwait … The post Caesars Travel lift winners trophy – SalamAir holds 1st Travel Agency Cricket Tournament in Kuwait appeared first on ARAB TIMES - KUWAIT NEWS.","content":"Winners Caesars Invaders KUWAIT CITY, Dec 15: SalamAir in Kuwait held its first Cricket Tournament for travel agency staff, in a format never seen or played before in Kuwait, with 16 Teams participating from various regions of Kuwait. The event was organized by Faisal Khan, the newly appointed Country Manager who recently arrived in Kuwait from Qatar and is in charge of the airline business in Kuwait. “Being new to the country, I wanted to find a popular sport to connect with the entire travel trade and to see how we could optimize on this as an airline because travel agencies are our lifeline and we address them as our trade partners. We are very lucky to have QGo as our GSA partners in Kuwait and they have been very helpful in driving this event for us,” he explained. Since cricket is a very popular sport in Asian countries and there hasn’t been a similar cricket tournament played in the last two decades in Kuwait, I believed this is where we would strike a chord with our trading partners, and we were quite successful.” The tournament in Jleeb played on Nov 25 saw SalamAir’s top management as well as the top travel agents in Kuwait come in with their families and friends to witness the tournament, which was really amazing. The final match featured Al Waseet Travel versus Caesars Travel, with the latter emerging victorious. SalamAir is operating daily flights from Kuwait to Muscat and onwards to Lucknow, Jaipur, Trivandrum, Dhaka, Chittagong, Karachi, Multan, Kathmandu and Phuket. Apart from the Sub-continent and far east their also commencing flights from Kuwait to Bangkok via Muscat starting 18th Dec that is to one of the most popular travel destinations from Kuwait The post Caesars Travel lift winners trophy – SalamAir holds 1st Travel Agency Cricket Tournament in Kuwait appeared first on ARAB TIMES - KUWAIT NEWS.","pubDate":"2022-12-15 18:32:40","image_url":null,"source_id":"arabtimesonline","country":["kuwait"],"category":["sports"],"language":"arabic"},{"title":"Captain Fantastic! Abel stars as Kenya collect second win of T20 series","link":"https://www.capitalfm.co.ke/sports/2022/12/15/captain-fantasticabel-stars-as-kenya-collect-second-win-of-quadrangular-t20-series/","keywords":["Cricket","featured"],"creator":["Omondi Onyatta"],"video_url":null,"description":"NAIROBI, Kenya, Dec 15 – Skipper Queentor Abel turned in a woman-of-the-match performance as she led the national women’s cricket team to a nine-wicket win over Qatar in their third match of the Kenya Quadrangular Women’s T20 Series at Nairobi Gymkhana on Thursday afternoon. Abel led the way with 21 runs (not out) from 18 […] The post Captain Fantastic! Abel stars as Kenya collect second win of T20 series appeared first on Capital Sports.","content":"Abel led the way with 21 runs (not out) from 18 balls as her opening batting partner Mary Mwangi soon left crease with 11 runs from 12 balls. Seven more runs, from five balls, by Venessa Adhiambo were enough to confirm the hosts’ victory as they easily reached the Qataris’ score of 39 runs, all-out. Having elected to bat after winning the toss, the Middle Easterners could not muster much of a batting masterpiece with Aysha their best performer with 12 runs. With Rochelle Quyn being run out by Lavendah Idambo, it all but confirmed the collapse of the Qataris’ batting order with a paltry 39 runs in 17.2 overs. It leaves them rooted at the bottom of the four-team tournament with no points following their previous losses to Uganda and Tanzania. The Kenyans climb second on the table with four points, having lost and won their previous two matches against Uganda and Tanzania respectively. In an earlier match at the same venue, Uganda continued their impressive run at the tournament with a six-wicket win over neighbours Tanzania. They now head the standings with six points, two ahead of Kenya as Tanzania and Qatar follow in that order with two and zero points respectively. The eight-day competition is being held in a double round-robin format and resumes on Saturday as Kenya once again lock horns with the Qataris at the same venue.","pubDate":"2022-12-15 17:19:10","image_url":null,"source_id":"capitalfm","country":["kenya"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi League: Sahul Kumar's impressive display helps Jaipur Pink Panthers reach final, to face Puneri Paltan","link":"https://www.firstpost.com/sports/pro-kabaddi-league-sahul-kumars-impressive-display-helps-jaipur-pink-panthers-reach-final-to-face-puneri-paltan-11817041.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi League: Sahul Kumar's impressive display helps Jaipur Pink Panthers reach final, to face Puneri Paltan","content":"Mumbai: Jaipur Pink Panthers put up an inspiring performance to beat Bengaluru Bulls 49-29 and enter the final of Pro Kabaddi League Season 9 in Mumbai on Thursday. The Pink Panthers will meet Puneri Paltan in the final on Saturday.Sahul Kumar emerged as the best player for the Panthers with 10 tackle points in the semi-final match.THIS IS IT 🤩#vivoProKabaddi #FantasticPanga #BhidegaTohBadhega #vivoProKabaddiPlayoffs #vivoProKabaddiFinal #vivoPKL2022Final #vivoPKL2022Playoffs #JaipurPinkPanthers #PuneriPaltan pic.twitter.com/70AYjz8uqV— ProKabaddi (@ProKabaddi) December 15, 2022In the other semi-final match, Puneri Paltan edged Tamil Thalaivas by a 39-37 scoreline.Back to the first semi-final, Arjun Deshwal picked up a couple of raid points as the Panthers took 5-3 lead in the fifth minute.V Ajith pulled off a magnificent raid soon after and helped the Panthers extend their lead further. However, the Bulls fought back through their defensive unit and reached within touching distance of Jaipur’s score at 8-10 in the 10th minute. But Ajith continued to shine as the Panthers kept forging ahead. Rahul Chaudhari stepped up his game and helped the Jaipur side take 14-9 lead in the 13th minute.Moments later, the Panthers inflicted an all out to take control of the game at 18-10. Kandola effected a fantastic raid in the 18th minute, but the Jaipur side still held the lead at 21-14. Bharat found it difficult to breach the Panthers’ defence consistently as Jaipur led 24-15 at the end of the first half.The Panthers rode on the momentum and inflicted an all out in the opening minutes of the second half. Thereafter, Ajith caught out Sachin Narwal and Reza Mirbagheri tackled Bharat as the Panthers led 33-19 in the 27th minute. The Jaipur side kept raging on and carried out another all out in the 29th minute.The Panthers’ defensive unit, led by Sahul Kumar, showcased top form and helped their team dominate proceedings at 43-25 in the 34th minute. The Bulls tackled Deshwal in the 37th minute, but the Panthers continued to keep their noses in front at 46-27. Thereafter, the Panthers’ raiders played carefully and eventually sealed their place in the grand finale.With inputs from PTI Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 17:08:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Jaipur-Pink-Panthers-vs-Bengaluru-Bulls-640_Twitter-@JaipurPanthers.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"USA Under-19 cricket team announced, with an Indian twist. Here's how","link":"https://www.livemint.com/sports/cricket-news/usa-under-19-cricket-team-announced-with-an-indian-twist-here-s-how-11671121470411.html","keywords":null,"creator":null,"video_url":null,"description":"The 15-player squad representing Team USA will be led under the captaincy of Geetika Kodali, while Anika Kolan has been named vice captain","content":null,"pubDate":"2022-12-15 17:04:33","image_url":"https://images.livemint.com/img/2022/12/15/1600x900/USA-under-19s_1671121686917_1671121691979_1671121691979.webp","source_id":"livemint","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket: Why Kane Williamson stepped down as Black Caps test captain","link":"https://www.nzherald.co.nz/sport/cricket-kane-williamson-reflects-on-decision-to-hand-black-caps-test-captaincy-to-tim-southee/IOWJ2IGKIRH5FC35XNLQ2ZQQCI/","keywords":null,"creator":null,"video_url":null,"description":"With an unrelenting schedule, Kane Williamson hopes this move will help extend his career.","content":null,"pubDate":"2022-12-15 17:00:00","image_url":"https://www.nzherald.co.nz/resizer/Kkt3_5SCIil7QUEv7OfRrhcfRjs=/300x300/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/PCT4JW4GYBEPRGSVNKWMPUW7CM.JPG","source_id":"nzherald","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"2022 Rewind: From Zimbabwe beating Pakistan to Japan topping World Cup group, biggest upsets of the year","link":"https://www.firstpost.com/sports/2022-rewind-from-zimbabwe-beating-pakistan-to-japan-topping-world-cup-group-biggest-upsets-of-the-year-11815891.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"2022 Rewind: From Zimbabwe beating Pakistan to Japan topping World Cup group, biggest upsets of the year","content":"Another year has flown by in the blink of an eye, with 2022 set to arrive at its conclusion in a few days’ time, and boy has the year been one to remember from the sporting perspective.Sport took a major hit in the year 2020 due to the coronavirus pandemic and was slowly limping back to normalcy the following year. The year 2022 however, witnessed a majority of events take place without a hitch as far as COVID was concerned, except perhaps an event or two in China.Additionally, few years in recent memory have witnessed the rise of underdogs as well as giant-killing acts the way 2022 did across important multi-nation tournaments such as the FIFA World Cup, Commonwealth Games and the T20 World Cup.As the year draws to a close, we take a look at 10 of the biggest upsets of the year across sport:Saudi Arabia defeating Argentina (FIFA World Cup)Argentina certainly have lived up to their favourites billing by reaching the final of the 2022 FIFA World Cup on the back of an inspired run led by the talismanic Lionel Messi and rising star Julian Alvarez. But La Albiceleste did stare at the prospect of an early flight back home after suffering a shock 1-2 loss at the hands of the relatively unfancied Saudi Arabia in their opening game of the tournament.Messi put the two-time world champions ahead with a 10th minute penalty and the Argentines went into the break with the lead, only for the Falcons to come out firing on all guns right after. Saleh Alshehri and Salem Aldawsari scored in a space of five minutes a few minutes into the second half, and Saudi Arabia put every ounce of their strength into defending their one-goal lead till the fulltime whistle, resulting in one of the most famous upsets in the tournament’s history.Zimbabwe beating Pakistan (T20 World Cup)There was plenty of off-field banter going on in the build-up to the Pakistan vs Zimbabwe Group 2 clash in the Super 12 stage of the T20 World Cup, thanks to one Zimbabwean Twitter user accusing the South Asian nation of sending a fake ‘Mr Bean’ for an event in Harare and promising revenge on behalf of the Craig Ervine-led side for the same.The Chevrons would exact ‘revenge’ in the end as they would go on to stun the 2009 T20 world champions by one run in one of the most pulsating cricketing encounters of the year. Vital contributions from Sean Williams (31) and Brad Evans (19) helped the side finish on 130/8, not very high a score but one that could be defended nevertheless.And defend they did in the end as Pakistan, cruising at 88/3 at one stage, lost wickets in a heap in the middle overs with Sikandar Raza (3/25) and Evans (2/25) playing a key role in the collapse, the latter bowling a heroic final over.Netherlands beating South Africa (T20 World Cup)Few would have expected Netherlands to land the knockout blow on South Africa, a team that had widely been expected to cruise into the knockouts despite a defeat against Pakistan in the preceding game. Then again, the T20 World Cup was a tournament of upsets where no team could be taken lightly despite the opponents’ stature. View this post on Instagram A post shared by ICC (@icc)Mirroring their heartbreaking semi-final loss to New Zealand in the 2015 World Cup in which Johannesburg-born Grant Elliott hit the winning six off Dale Steyn, it was the the South African-born trio of Colin Ackermann (41 not out), Brandon Glover (3/9) and Roelof van der Merwe (catch to dismiss David Miller) who played a central role in the shock 13-run victory over their more fancied opponents. Ackermann’s 26-ball knock helped the Dutchmen post 158/4 and Glover’s three-wicket haul contained the important wickets of Rilee Rossouw and Miller.But it was van der Merwe’s outstanding effort to dismiss Miller, taking a catch running in the opposite direction from short fine leg, that truly turned the game on its head.Japan beating Spain and Germany in same group (FIFA World Cup)The 2022 FIFA World Cup will be remembered as one of the most unpredictable editions of what is perhaps the biggest sporting event after the Olympics. And few things highlight this point more prominently than Japan topping a group comprising former world champions Spain and Germany with the latter suffering a second consecutive first-round exit.And their victories over the two European powerhouses was identical, in that the Samurai Blue would concede a goal in the first half, only to bounce back in the second with two goals. It was a pair of substitutes Ritsu Doan and Takuma Asano who scored in a space of eight minutes late into the second half to undo Ilkay Gundogan’s 33rd minute penalty in their opening clash against Germany.A 0-1 defeat against Costa Rica would put them under pressure, leaving them needing a win against La Roja to go through, a prospect which appeared unlikely after Alvaro Morata’s 11th-minute strike. Doan, however, would pull off yet another Super-Sub act as he helped the four-time Asian champions equalise shortly after halftime (48’), with Ao Tanaka putting them ahead just three minutes later, helping Hajime Moriyasu’s side finish top of Group E.India winning gold in women’s fours lawn bowls competition (Commonwealth Games)India managed to grab the fourth spot at the 2022 Birmingham Commonwealth Games medal table with a total of 61 medals, including 22 gold, finishing ahead of nations such as New Zealand and Scotland. One of the 22 gold medals however, came from a sport that had little Indian participation in the past — Lawn Bowls.Not only would India punch above its weight in the women’s four section of lawn bowls in Birmingham, they would end up surprising many a follower of the sport by finishing atop the podium in the end. After their victory over New Zealand, the Indian quartet of Lovely Choubey, Pinki, Nayanmoni Saikia and Rupa Rani Tirkey would overcome a stutter midway through the gold medal clash against South Africa to pull off a 17-10 win and confirm the yellow metal for themselves. That wasn’t all for India in lawn bowls though, as they would later win silver in the men’s four event as well.Namibia beating Sri Lanka (T20 World Cup) The 2022 T20 World Cup in Australia will be remembered for some shocking upsets, and stunning finishes. Right from the first match up until the final, there was plenty of action on the field, and several off it, and needless to say, there were those frustrating rain interruptions too.The tournament opener in itself provided a shocking result, when Namibia faced Sri Lanka in a Group A match in Geelong.Sri Lanka had won the toss and chosen to field. They got off to a good start, with Dushmantha Chameera, Pramod Madushan, and Chamika Karunaratne removing Michael van Lingen, Divan la Cock and Loftie-Eaton inside the powerplay overs.Stephan Baard and Gerhard Erasmus then forged a 41-run stand for the fourth wicket before the latter departed, but it was a 69-run stand between Jan Frylinck and JJ Smit for the eighth wicket that helped Namibia post 163/7.Sri Lanka needed 164 runs to win, and they got off to a worst possible start, losing Kusal Mendis, Pathum Nissanka and Danushka Gunathilaka inside the powerplay phase.It was a combined effort from the Namibians to see off Sri Lanka for 108 and script a memorable 55-run win. David Wiese, Bernard Scholtz, Ben Shikongo and Jan Frylinck all picked two wickets, while JJ Smit scalped one.HS Prannoy stuns Viktor Axelsen (BWF World Tour Finals) HS Prannoy, earlier in December, scripted a scintillating come-from-behind victory over Olympic champion Viktor Axelsen in a BWF World Tour Finals match in Bangkok. This was just Prannoy’s second win over Axelsen in seven meetings.Axelsen had cruised to a 11-7 lead in the opening game, and Prannoy responded with seven more points, but that wasn’t enough as Axelsen sealed the first game 21-14.At 20-15 in favour of Prannoy in the second game, the Indian failed to seal the second game after playing a crosscourt smash, but it wasn’t long until Prannoy won the second game 21-17.In the third game, Prannoy took a 4-2 lead early on, but Axelsen fought back to make it 11-10, the scoreline still in favour of Prannoy. From 18-18, Prannoy then went onto win the game 21-18, and eventually the contest.Satwik-Chirag stun Takuro Hoki and Yugo Kobayashi (French Open) The Indian men’s duo of Satwiksairaj Rankireddy and Chirag Shetty have had a dream year. They won the Thomas Cup with India, Indian Open Super 500 title, Commonwealth Games gold and a bronze in the World Championships in August.They also won the French Open Super 750, in a tournament where they stunned Japanese pair of Takuro Hoki and Yugo Kobayashi.It was a quarter-final clash in France, and Satwik-Chirag faced a stiff challenge against the Japanese. They were leading 20-16 in the first game, but Satwik-Chirag had to hold their nerve to win the first game 23-21.In the second game, it was yet another example of resilience as from 16-18 down, the Indian duo would go on to win five successive points and seal the second game 21-18 to win the match.Daniel Galan upsets Stefanos Tsistipas (US Open) World number four Stefanos Tsistipas was up against qualifier Daniel Galan in the first round of US Open 2022 at Flushing Meadows, but the Greek was stunned in an epic showdown.Galan beat Tsitsipas 6-0, 6-1, 3-6, 7-5, clinching the match on the ninth match point.Galan claimed the first 11 games of the match before Tsitsipas hit back with one. Tsitsipas though had only won five of his serve points in the first set.Tsitstipas fought hard to win the third set 6-3, and despite some gritty efforts in the fourth set, the Colombian waled away with a 7-5 win in the fourth set, and eventually a memorable career victory.Frances Tiafoe beats Rafael Nadal (US Open) US Open 2022 produced yet another stunning upset when American Frances Tiafoe shocked Rafael Nadal in the fourth round of the year’s final Grand Slam in September.Have a moment Frances Tiafoe!#USOpen pic.twitter.com/egoIVDoRWh— US Open Tennis (@usopen) September 5, 2022Nadal had managed to win just one set, and Tiafoe walked away with a 6-4, 4-6, 6-4, 6-3 scoreline at Flushing Meadows.Tiafore became the third American to beat Nadal at a Grand Slam major, with Andy Roddick and James Blake being the others to do so.This year, Nadal had clinched the Australian Open and French Open, and reached the semi-finals of Wimbledon, where he pulled out of the match against eventual runner-up Nick Kyrgios due to an injury.Nadal was doubtful to take part in the US Open after sustaining that injury, but he eventually made the decision to play in the year’s final Grand Slam. The injury hampered Nadal’s second half of the season in a big way, but Nadal recently said that he would ‘die to reach his usual level’.“I don’t know if I going to reach that level again. But what I don’t have any doubt is that I (am) going to die for it,” the King of Clay had said in November.Click here for more stories in ‘2022’ Rewind’ seriesRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 16:21:09","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Japan-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"2022 Rewind: From Shane Warne to Bill Russell, sporting icons who passed away this year","link":"https://www.firstpost.com/sports/2022-rewind-from-shane-warne-to-bill-russell-sporting-icons-who-passed-away-this-year-11814861.html","keywords":["First Cricket News"],"creator":["FP Sports"],"video_url":null,"description":"2022 Rewind: From Shane Warne to Bill Russell, sporting icons who passed away this year","content":"Sports 2022 Rewind: From Shane Warne to Bill Russell, sporting icons who passed away this year As we get ready to bid farewell to 2022, we take a look at some notable figures in the sporting fraternity who breathed their last this year and celebrate their legacies. FP Sports December 15, 2022 21:40:59 IST Many sporting icons including Shane Warne, Bill Russell and Charanjit Singh passed away in 2022. Images: AP/SAI Media Sports is inspiring and captivating. Sporting icons become immortal to their fans, but life has to end for everyone one day. Several big names from the sporting fraternity, athletes and sports personalities, passed away in the year which is now about to come to an end. We take a look at notable deaths in the sporting fraternity, as of 2022, and celebrate their legacies. Bill Russell Bill Russell, one of the greatest NBA players of all time, passed away on 31 July this year at the age of 88. He was part of the legendary Boston Celtics side of the 1950s and 1960s and won 11 NBA championship titles with the team including two as a player-coach. He was the first black coach in any major US sport. Russell also won MVP awards five times and All-Star MVP once. NBA legend Bill Russell has passed away at the age of 88. RIP. pic.twitter.com/htJmGDeJXw — Legion Hoops (@LegionHoops) July 31, 2022 The biggest legacy of Russell is his work as a civil right activist. The legendary baller once marched with Martin Luther King Jr, supported Muhammad Ali and was also awarded the Presidential Medal of Freedom. Shane Warne The cricket world was in for a major shock on 4 March this year when the news broke that Shane Warne passed away at the age of 52. He was found unconscious in his villa at a Thailand resort and could not be revived. Later, the autopsy report stated that he died of “natural” causes. The Pavilion Long Room fell silent at @HomeOfCricket this morning, on a day when the world of sport joins together in remembrance and celebration of the remarkable life of cricket legend and @MCCOfficial Honorary Life Member, Shane Warne. #ShaneWarne #Cricket #Australia #MCC pic.twitter.com/VACfvXW9f6 — MCC Foundation (@_MCCFoundation) March 30, 2022 Considered the greatest spinner of all time, Warne took 1,001 wickets in 339 international matches. More than that Warne is credited for reviving leg spin as an art of bowling and for being the greatest exponent of the skill. Charanjit Singh On 27 January this year, India lost its 1964 Tokyo Olympics gold medal-winning hockey team captain, Charanjit Singh. He died of cardiac arrest at 90. SAI mourns the passing away of Padma Shri & Arjuna Awardee Charanjit Singh, former Indian Hockey Captain for 1964 Olympics (Gold medalist) His contribution towards the great legacy of Indian Hockey will be forever remembered Condolences to his family & friends 🙏 #RIP pic.twitter.com/2vDQcnSDFe — SAI Media (@Media_SAI) January 27, 2022 Charanjit was also a part of the team that won the silver in the 1960 Olympics which was held in Rome and the one that won the second prize in the 1962 Asian Games. Rod Marsh Australia lost another great cricketer on the same day as Warne’s demise as Rod Marsh died at age 74. The former keeper-batter had suffered a heart attack and was put in an induced coma before passing away. Vale Rod Marsh. Champion cricketer and seventies icon. Haven’t been many better behind the sticks. pic.twitter.com/7t0h43ZM1S — Richard Hinds (@rdhinds) March 3, 2022 He was the first Australian wicketkeeper to score a century in Test. Having played 96 Tests and 92 ODIs, he scored 4,858 runs across the two formats. Marsh made his name as a solid wicketkeeper who could score crucial runs. Andrew Symonds Things got worse for the cricketing world when legendary Australian Andrew Symonds was killed in a car crash on 14 May at age 46. Very sad news from Australia as we heard of the passing of Andrew Symonds, the dynamic former allrounder, who played 26 Tests, 198 ODIs and 14 T20Is. We send sincere condolences to his family and friends from the West Indies cricket family. 🙏🏾 pic.twitter.com/76FwahqKds — Windies Cricket (@windiescricket) May 15, 2022 Considered to be one of the best all-rounders to play the game, Symonds played 26 Tests, scoring 1,462 runs and picking up 24 wickets. A big-hitter, he also played 198 ODIs, making 5,088 runs and taking 133 wickets. In 14 T20Is, he made 337 runs and took eight wickets. Rudi Koertzen One of the most known umpires in cricket, Rudi Koertzen died in a car accident on 9 August. He was aged 73. R. I. P Rudi Koertzen. The BCCI mourns the loss of one of the finest umpires to have officiated the game of cricket. pic.twitter.com/44Ztdhiioe — BCCI (@BCCI) August 9, 2022 A reputed professional during his time Koertzen was part of the ICC’s elite panel of umpires for eight years from 2002 till his retirement in 2010. He officiated in 331 international matches. Nick Bollettieri One of the greatest Tennis coaches, Nick Bollettieri passed away on 4 December 2022. He was 91. According to the International Tennis Federation, Bollettieri helped at least 10 players become world No 1 in tennis including Andre Agassi and medallists Monica Seles and Maria Sharapova. A pioneer, a visionary, a mentor, a coach, and a friend 💙 One of the biggest influences in the game of tennis, Nick Bollettieri, has passed away at the age of 91. Our condolences go out to his family, friends and everyone he impacted. pic.twitter.com/jQMWhar9FR — ATP Tour (@atptour) December 5, 2022 As of now, six of Bollettieri’s coached players have been inducted into the Hall of Fame. Mino Raiola The ‘super agent’ in football, Mino Raiola died on 30 April 2022 at the age of 54. Raiola was often criticised for the hefty commission that he charged but he also boasted a client list of some of the best footballers that included Zlatan Ibrahimovic, Paul Pogba and Erling Haaland. Zlatan Ibrahimović: “This Scudetto is for Mino Raiola. It’s the first title I win without Mino by my side.” 🕊️ pic.twitter.com/PTLJhUdwTc — Football Tweet ⚽ (@Football__Tweet) May 22, 2022 Scott Hall Scott Hall also known by his ring name Razor Ramon was one of the most recognisable faces in the World Wrestling Federation (now WWE) in the 1990s. He passed away on 14 March 2022 at the age of 63. Popular for his style and charisma, Hall won the Intercontinental Championship in WWF four times. WWE is saddened to learn that two-time WWE Hall of Famer Scott Hall has passed away. WWE extends its condolences to Hall’s family, friends and fans. pic.twitter.com/jgqL3WizOS — WWE (@WWE) March 15, 2022 He later joined World Championship Wrestling (WCW) and won the Heavyweight Championships twice. Hall is also remembered for being that part of the New World Order with Hulk Hogan and Kevin Nash. Vin Scully One of the best known broadcasters in US sport, Vin Scully died on 2 August 2022. He was aged 94. A Hall of Famer, Scully was known for calling games for Major League Baseball’s Los Angeles Dodgers games for 67 years, beginning in 1950. He stopped calling games in 2016. pic.twitter.com/FloR9dBhZj — Los Angeles Dodgers (@Dodgers) August 3, 2022 A was also a Presidential Medal Of Freedom award winner. Click here for more stories in ‘2022’ Rewind’ series Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 15, 2022 21:40:59 IST TAGS: 2022 Rewind","pubDate":"2022-12-15 16:10:59","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/2022-Rewind-Sports-Icons-dead.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi 2022 Semi-Final LIVE: Jaipur Pink Panthers 47 - 29 Bengaluru Bulls","link":"http://www.firstpost.com/sports/pro-kabaddi-2022-live-jaipur-pink-panthers-vs-bengaluru-bulls-puneri-paltan-vs-tamil-thalaivas-pkl-semi-final-latest-updates-11816031.html","keywords":["Sports"],"creator":["Bansal Shah"],"video_url":null,"description":"Pro Kabaddi 2022 Semi-Final LIVE: Jaipur Pink Panthers 47 - 29 Bengaluru Bulls","content":"20:29 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Second half 17' | A super tackle for Bengaluru Bulls and that will earn them 2 points. But its a tad bit too late. Only three minutes left in the match and the Panthers still have a lead of 17 points!  Jaipur Pink Panthers 46 - 29 Bengaluru Bulls 20:21 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Second half 15' | Sahul Kumar has now put Bengaluru Bulls under pressure with some brilliant tackles. He has now managed a SUPER 10! This has been brilliant from Panthers. The second player to have a Super 10 in the match!  Jaipur Pink Panthers 44 - 25 Bengaluru Bulls 20:11 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Second half  9' | In no time, Jaipur Pink Panthers have inflicted a third all-out on the Bengaluru Bulls! Ajith Kumar has almost single-handedly taken over the Bulls. This is total domination by the Panthers in the semi-final. A lead of 20 points and that seems out of reach for the Bulls.  Jaipur Pink Panthers 40 - 20 Bengaluru Bulls20:08 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Ajith Kumar of Jaipur Pink Panthers has managed a SUPER 10! He has managed 11 touch points so far.20:06 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Second half  4'And there it is! Bengaluru Bulls have been all-out the second time in this match. Bengaluru Bulls having two back-to-back poor raids from Vikash Kandola and Neeraj Narwal. Jaipur Pink Panthers 30 - 19 Bengaluru Bulls 20:04 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Second half  2' | A super tackle for Bengaluru Bulls. They are on the verge of all-out, but giving in their all. Jaipur Pink Panthers 27 - 18 Bengaluru Bulls  20:02 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Points breakup at half time Total points: Jaipur Pink Panthers 24 - 15 Bengaluru BullsRaid points: Jaipur Pink Panthers 13 - 9 Bengaluru BullsTackle points: Jaipur Pink Panthers 8 - 6 Bengaluru BullsAll out points: Jaipur Pink Panthers 2 - 0 Bengaluru BullsExtra points: Jaipur Pink Panthers 1 - 0 Bengaluru Bulls     19:59 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:HT | It's half-time in the first semi-final and Jaipur Pink Panthers have a massive lead going into the second half. Bengaluru Bulls have to do something magical to come back stronger and have a chance at the final match. Panthers looking the better team at the moment! Jaipur Pink Panthers 24 - 15 Bengaluru Bulls 19:55 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:20' | Jaipur Pink Panthers have reviewed the referee's decision who have awarded a bonus point to the Bengaluru Bulls. It seems like a bonus and the Panthers' review will fail. But with just seven seconds left in the half, it won't matter. Jaipur Pink Panthers 24 - 15 Bengaluru Bulls 19:52 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:18' | Jaipur Pink Panthers are cruising away! They have managed a nine-point lead now. Bengaluru Bulls are working hard, but the Panthers are inching ahead quite well in all the departments. Jaipur Pink Panthers 23 - 14 Bengaluru Bulls 19:48 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:13' | Bengaluru Bulls have been all-out! It has taken 13 minutes for the Panthers to do this and they are dominating over their opponents at the moment! There was doubt over that dismissal but he was given out and the All out was also conceded to the Panthers!  Jaipur Pink Panthers 17 - 11 Bengaluru Bulls 19:44 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:11' Jaipur Pink Panthers are proving to be the better side here. First disallowing Reza Mirbagheri in a do-or-die raid and then Ajith Kumar bags a bonus point.  Jaipur Pink Panthers 12 - 9 Bengaluru Bulls 19:39 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:6' | Jaipur Pink Panthers have a super raid and they are running away from the Bulls as far as the scoreline is concerned! Ajith Kumar was the raider. The defenders tried to help each other, but Ajith Kumar was fast and sharp enough to reach the middle line. Jaipur Pink Panthers 9 - 5 Bengaluru Bulls19:36 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:Abhishek Bachchan and Aishwarya Rai are in the house, supporting Jaipur Pink Panthers along with their daughter!19:33 (IST)Pro Kabaddi League Live Jaipur Pink Panthers vs Bengaluru Bulls:1' | Bengaluru Bulls are raiding first. And Jaipur Pink Panthers have made a tackle in the first raid itself.19:31 (IST)Pro Kabaddi League Live:The national anthem is done! Live action is moments away. 19:19 (IST)Arjun: The team is in a good state of mind. We have played finals whenever we have qualified for playoffs. It will be a tough tie against Bengaluru Bulls. Naveen is a good raider. Vikas and Bharath are also doing good. It will be a thrilling match.19:14 (IST)Pro Kabaddi League Live:Re-visiting the thrilling tie-breaker between Tamil Thalaivas and  U. P. Yoddhas in the eliminator. Do you want to see another tie-breaker today?Probably the highlight of the season!#UPvCHE | #IdhuNammaTeam | #GiveItAllMachi | #FantasticPanga pic.twitter.com/tbeQw4U0GR— Tamil Thalaivas (@tamilthalaivas) December 15, 202219:09 (IST)Pro Kabaddi League Live:Which team are you supporting tonight?These 4️⃣ elite players will ⚔️ in tonight’s 🎬Which team are you supporting tonight?#vivoProKabaddi #FantasticPanga #JPPvBLR #PUNvCHE #vivoPKLPlayoffs #vivoPKL2022Playoffs pic.twitter.com/0sCz0BtkVm— ProKabaddi (@ProKabaddi) December 15, 202218:59 (IST)Pro Kabaddi League Live:Hello and Welcome to the ultimate day of Panga! The semifinals of the PKL Season 9 are about to start as we have a double header on our Thursday platter. Jaipur Pink Panthers will face Bengaluru Bulls first up, followed up Tamil Thalaivas' maiden semifinal against Puneri Paltan. The night is going to be warm with the heat of battle in the two consecutive semifinals! Do not go anywhere!A massive penultimate day of action awaits start as Jaipur Pink Pathers will play against Bengaluru Bulls and Tamil Thalaivas will face off Puneri Paltan in the semifinals of the ninth season of the Pro Kabaddi League.Jaipur Pink Panthers topped the group stage and directly qualified for the semi-finals whereas Bengaluru Bulls had to beat Dabang Delhi K.C. in the eliminator. However, both the teams have beaten each other once in the tournament and this is expected to be a massive match as both the teams are equally capable and deserving of making it to the finals.Pink Panthers will have their weight carried mainly on the shoulders of Arjun Deshwal who has garnered 286 raid points so far. Their defense as well has been solid.Bengaluru Bulls, on the contrary, will rely heavily on Bharath and Vikash Kandola who have a stupendous raiding record.In the second contest, Tamil Thalaivas will make their first-ever appearance in the semifinals of the Pro Kabaddi League against Puneri Paltan.The Paltan, similar to the Panthers qualified directly to the semis after finishing second on the league stage, whereas Thalaivas dropped their sweat against UP Yoddhas in an exhilarating tiebreaker.Both the teams have won one match against each other in the group stage, with a scoreline of 35-34 with a one-point margin and a similar thriller is expected on Thursday as well.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 15:00:23","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Pro-Kabaddi-League-semifinal.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: ‘Plan was to hit one spot,’ says Siraj after three-wicket burst on Day 2 at Chattogram","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-plan-was-to-hit-one-spot-says-siraj-after-three-wicket-burst-on-day-2-at-chattogram-11816651.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh: ‘Plan was to hit one spot,’ says Siraj after three-wicket burst on Day 2 at Chattogram","content":"Chattogram: India fast bowler Mohammed Siraj on Thursday said his approach to bowl consistently at one spot yielded rich dividends for him in the opening Test against Bangladesh in Chattogram.The Indian bowling unit, led by left-arm spinner Kuldeep Yadav (4/33) and Siraj (3/14), reduced Bangladesh to 133 for 8 in the home side’s first innings at stumps on the second day on Thursday. India had posted 404 in their first innings.Siraj attributed his success to bowling consistent line and length.“Red ball is my favourite. I’m more consistent in red ball because it’s all about concentrating on line and length. The credit goes to all the bowlers,” he said in the press conference after second day’s play.“My approach was to bowl consistently at one place because it is such a wicket that if you try more there are chances to leak runs. My only plan was to hit one spot and got successful.”The 28-year-old said a fast bowler needs to bowl stump-to-stump to get success in five-day cricket.“I think the more you bowl stump line it is better, because sometimes it is getting lower from there as well as turning. For a fast bowler, it is better to bowl stump line because then you can have LBW chances,” he said.Watch: Siraj exacts revenge on Litton, pumped Kohli joins in the celebrationSiraj is known for bowling with a wobble seam often and the speedster said he went for the option after discovering that his deliveries stopped coming in four years ago.“In 2018, my balls stopped coming inside, I started bowling outswingers more. I got confused why balls are not coming in and that time I discovered wobble seam because it is difficult for a batter to tackle an outswing that comes in.“Wobble seam is a type of an off-cutter and I got success with that,” he said.The Indian lower-order wagged admirably with Ravichandran Ashwin (58), Kuldeep (40) and Umesh Yadav (15 not out) putting up impressive displays to take India past the 400-run mark in the first innings.“Runs from the lower-order is always good for the team, so everyone is showing interest in practice sessions. They (lower-order batters) want to do well,” Siraj said.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 14:55:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Mohammed-Siraj-celebrates-Chattogram-Day-2-AFP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: Umesh Yadav sends stump flying not long after smashing two sixes; watch video","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-umesh-yadav-sends-stump-flying-not-long-after-smashing-two-sixes-watch-video-11816011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh: Umesh Yadav sends stump flying not long after smashing two sixes; watch video","content":"Team India enjoyed a solid day in office on Day 2 of the first Test against Bangladesh at Chattogram on Thursday, getting off to a solid start in the two-match series after the disappointment of losing the ODIs earlier in the tour.Not only would the visitors cross the 400-mark after vital contributions from the lower order, they would also run through the hosts’ batting order, leaving them gasping for breath at 133/8 and staring at an innings defeat with three more days of play left.Kuldeep Yadav was the star of the day with his haul of 4/33 as well as a contribution of 40 with the bat, forming a 92-run eighth-wicket stand with Ravichandran Ashwin (58). Besides Kuldeep, pacer Mohammed Siraj too dominated the Bangladeshi batters with his haul of 3/14, removing both openers as well as No 4 Litton Das.Senior bowler Umesh Yadav, making only his second Test appearance this year, too had his moments on a hazy Thursday at the Zahur Ahmed Chowdhury Stadium.Yadav would first smash two sixes in as many overs from Mehidy Hasan Miraz, the second one bringing up India’s 400, and the Vidarbha pacer would remain unbeaten on 15 off 10 balls, with Siraj the last Indian batter to fall.What a hitting shot by Umesh yadav 100 miter six#Umeshyadav pic.twitter.com/KlKXDKl6Yh— Adnan Ansari (@AdnanAn71861809) December 15, 2022Yadav would send the leg stump on a cartwheel in his second over of the day after it was Bangladesh’s turn to bat, sending Yasir Ali back to the dressing room for 4 as Bangladesh lost their second wicket with just five runs on board.The Power of Umesh Yadav 💪🔥#INDvsBangladesh pic.twitter.com/wwQJQ4GhJF— Himanshu Dwivedi (@Hims_Dwivedi) December 15, 2022The Bangla Tigers would continue losing wickets at regular intervals, with debutant Zakir Hasan, Litton and veteran keeper-batter Mushfiqur Rahim departing in the 20s, unable to stick around long enough and build sizeable partnerships to bring their side back into the game.Read: Ashwin-Kuldeep stand and other top moments from Day 2 of 1st TestKuldeep would strike twice in an over shortly after the Bangladeshis crossed the 100-mark, inflicting a huge blow on the opponents by removing a set Mushfiqur. At the close of play however, Mehidy and Ebadot Hossain had put up a fighting unbroken partnership worth 31, giving Bangladesh hope of avoiding follow-on on the third day.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 14:20:36","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Umesh-Yadav-India-Bangladesh-Chattogram-AFP-1.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-England&#039;s Robinson feared career was over amid injury woes","link":"https://www.thestar.com.my/sport/cricket/2022/12/15/cricket-england039s-robinson-feared-career-was-over-amid-injury-woes","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - England fast bowler Ollie Robinson said a series of injuries had left him fearing for his cricket career as he described the last 12 months as his toughest as a professional. Read full story","content":null,"pubDate":"2022-12-15 14:05:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/12/15/1864473.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Brabourne Stadium T20 records: CCI Brabourne Stadium Mumbai T20 records and highest innings totals","link":"https://thesportsrush.com/cricket-news-brabourne-stadium-t20-records-cci-brabourne-stadium-mumbai-t20-records-and-highest-innings-totals/","keywords":["Cricket","Australia Women","Australia Women tour of India 2022","Brabourne Stadium","India Women"],"creator":["Dixit Bhargav"],"video_url":null,"description":"The fourth T20I of the ongoing Australia Women’s tour of India will be played at the Brabourne Stadium on Saturday. One of the most lively and keenly followed Women’s bilateral series lately, its outcome has it in it to be confirmed if Australia register their second consecutive victory to gain an unassailable 3-1 lead in… The post Brabourne Stadium T20 records: CCI Brabourne Stadium Mumbai T20 records and highest innings totals appeared first on The SportsRush.","content":"The fourth T20I of the ongoing Australia Women’s tour of India will be played at the Brabourne Stadium on Saturday. One of the most lively and keenly followed Women’s bilateral series lately, its outcome has it in it to be confirmed if Australia register their second consecutive victory to gain an unassailable 3-1 lead in a five-match series. While that would definitely kill a lot of excitement in what has been an electrifying series thus far, fans would be hoping for India to stage a comeback for the second time before playing a series-decider on Tuesday. India, however, don’t have the best of T20I records at this venue. Readers must note that India have won one and lost four out of their four Women’s T20Is at the Cricket Club of India. Interestingly, Australia have not only played more T20Is here but also done much better than the hosts. Out of their six T20Is here, Australia have won five and lost one to seldom err at this stadium. Brabourne Stadium T20 records Highest run-scorers in Women’s T20Is at the Brabourne Stadium are Danni Wyatt (213), Smriti Mandhana (209), Meg Lanning (175), Elyse Villani (157) and Nat Sciver (155). Part of the current squads, Beth Mooney (150), Harmanpreet Kaur (133), Ellyse Perry (125) and Ashleigh Gardner (100) have scored 100 or more T20I runs here. We Moons! Congrats to Beth who last night ticked past 4000 International runs, not long after becoming the fastest woman to 2000 T20I runs! @CommBank | #INDvAUS pic.twitter.com/Au5yRIYv8f — Australian Women’s Cricket Team (@AusWomenCricket) December 14, 2022 Highest wicket-takers in Women’s T20Is at this venue are Megan Schutt (10), Gardner (8), Delissa Kimmince (8), Deepti Sharma (6) and Jhulan Goswami (5). Perry (4), Radha Yadav (3), Anjali Sarvani (2), Darcie Brown (2), Renuka Singh (2), Devika Vaidya (2), Nicola Carey (1) and Amanda-Jade Wellington (1) are other bowlers part of the current squads to have picked a T20I wicket here. Highest innings totals at Brabourne Stadium, Mumbai Score Overs Team Opposition Year 209/4 20 Australia England 2018 199/3 18.4 England India 2018 198/4 20 India England 2018 186/5 20 Australia India 2018 172/8 20 Australia India 2022 ALSO READ: How to book tickets for India Women vs Australia Women T20Is at the Brabourne Stadium? Out of the 16 innings in Women’s T20Is at the Brabourne Stadium, 200-run mark has been surpassed only once. The above mentioned second-highest innings totals is also the highest successful run-chase in Women’s T20Is here. While teams batting first have won three Women’s T20Is at the CCI, chasing teams have tasted success five times. The post Brabourne Stadium T20 records: CCI Brabourne Stadium Mumbai T20 records and highest innings totals appeared first on The SportsRush.","pubDate":"2022-12-15 14:02:51","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: Mohammed Siraj exacts revenge on Litton Das, pumped Virat Kohli joins in the celebration","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-mohammed-siraj-litton-das-watch-video-11816361.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh: Mohammed Siraj exacts revenge on Litton Das, pumped Virat Kohli joins in the celebration","content":"Chittagong: India pacer Mohammed Siraj and Bangladesh batter Litton Das were involved in a sledging episode on Day 2 of the first Test on Thursday. The continuation of events resulted in the latter’s wicket off the very next ball. To add to the masala, Virat Kohli joined in on the overly enthusiastic celebrations.It all transpired in the 14th over of Bangladesh’s innings. Litton Das, who had smacked four boundaries in the previous session, thereby racing off to 24 runs. In the post-Tea session, he was yet to score a run in the three overs of play.On the first ball of the Siraj over, Das played a defensive shot comfortably off the back foot. Siraj, in his follow-through, had a few words to say.The speedster was difficult to contain as he rattled @LittonOfficial‘s stumps, eventually picking up 3 before the end of Day 2Rate @mdsirajofficial‘s bowling effort from 1️⃣-1️⃣0️⃣?#BANvIND #SonySportsNetwork #MohammedSiraj pic.twitter.com/kdEt38w0ls— Sony Sports Network (@SonySportsNetwk) December 15, 2022The Bangladesh batter had a go at Siraj of his own. He held his hands over his ears in a gesture of “what did you say?” The umpire was quick to intervene forcing Siraj to return to his bowling mark.On the next ball, Siraj hit the deck hard. The ball stayed low, hit the bottom edge of Litton’s bat and crashed into the stumps. In celebration, Siraj had his finger on his lips.Kohli, stationed at the slips region, mocked Das with his hands-in-ears gesture to give him a fiery send-off.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 13:53:27","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Siraj-Litton-Twitter-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy: Sudharsan, Aparajith put Tamil Nadu ahead","link":"https://telanganatoday.com/ranji-trophy-sudharsan-aparajith-put-tamil-nadu-ahead","keywords":["News","Sport","Hyderabad","Ranji Trophy","Tamil Nadu"],"creator":["Shiva Krishna Gundra"],"video_url":null,"description":"Both slam centuries as visitors take crucial first-inning lead in Ranji Trophy match","content":"Hyderabad: Debutant Sai Sudharsan fell short of a well-deserved double century (179 off 273; 18×4, 1×6) while Baba Aparajith scored an unbeaten 115 (11×4, 3×6) to power Tamil Nadu to a crucial 115-run first innings lead on the third day of the Group B Ranji Trophy at the Rajiv Gandhi International Cricket Stadium at Uppal, Hyderabad on Thursday. Overnight batter Sudharsan adopted a cautious approach while Aparajith, who was dropped on 92, used the reprieve to get to his century (115 off 165) as the visitors declared their innings after amassing a massive 510/4 in 111.5 overs. Hyderabad, in their second innings, were 28/0 in 8 overs at stumps. Opener Abhirath Reddy left the crease retired hurt after he was hit on the right arm when wicketkeeper N Jagadeesan threw the ball towards wickets for a runout. Captain Tanmay Agarwal (5 batting) and Tanay Thyagarajan (9 batting) were at the crease. Earlier, it was hard work for Hyderabad bowlers on a wicket that offered little help. Kartikeya Kak got off the day’s proceedings well dismissing overnight centurion N Jagadeesan (116) on the third ball of the day. But Sai Sudarshan and another debutant R Kavin (36 off 84; 4×4, 1×6) added 79 runs for the third wicket before the latter departed. Trying to play a sweep shot, the batter missed a full length delivery off Tanay to be adjudged lbw. Aparajith joined hands with Sai Sudharsan and scored runs at will. While Sudharshan was cautious, Aparajith showed more intent. After lunch, both took their team past Hyderabad’s total. The southpaw Sai Sudharsan perished after knicking Tanay to wicketkeeper Prateek Reddy trying to guide it to the third man in the 94th over when their total was 417. Captain Baba Indrajith joined his brother Aparajith and added some quick runs. Indrajith got a life when he was on 35 with Anikethreddy grossing a skier at the mid-wicket of pacer B Punnaiah in the 106th over. Two overs later, the luck was in Aparajith’s side when he was dropped on 92 by Abhirath Reddy off the same bowler Punnaiah. The batter reached his three-figure mark in 159 deliveries. Captain Indrajith was then run out on 48 and decided to declare their innings.","pubDate":"2022-12-15 13:41:12","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh, 1st Test: Shreyas Iyer misses ton, Ashwin-Kuldeep stand, and other top moments from Day 2","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-1st-test-day-2-top-moments-ashwin-kuldeep-siraj-11816101.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh, 1st Test: Shreyas Iyer misses ton, Ashwin-Kuldeep stand, and other top moments from Day 2","content":"Cricket India vs Bangladesh, 1st Test: Shreyas Iyer misses ton, Ashwin-Kuldeep stand, and other top moments from Day 2 Resuming from 278/6, It was a crucial stand between R Ashwin and Kuldeep Yadav that took India to a total of 404. FirstCricket Staff December 15th, 2022 19:08:00 IST India's Ravichandran Ashwin, right and Kuldeep Yadav score runs during the second day of the first test cricket match between Bangladesh and India in Chattogram, Bangladesh, Thursday, Dec. 15, 2022. (AP Photo/Surjeet Yadav) Team India put up a dominant performance on Day 2 of the Chattogram Test against Bangladesh on Thursday, restricting the hosts to 133/8 at stumps, after putting up 404 on the board. India resumed from their overnight score of 278/6, but Shreyas Iyer (86) failed to register a century, having resumed from his overnight score of 82. It was a crucial stand between Ravichandran Ashwin and Kuldeep Yadav that took India to a big total. That’s Stumps on Day 2 of the first #BANvIND Test! A dominating show with the ball by #TeamIndia ! 👍👍 4⃣ wickets for @imkuldeep18 3⃣ wickets for @mdsirajofficial 1⃣ wicket for @y_umesh Scorecard ▶️ https://t.co/CVZ44NpS5m pic.twitter.com/SkqzNIqlSj — BCCI (@BCCI) December 15, 2022 Bangladesh trail by 271 runs in the first innings with two wickets remaining. Let’s now take a look at some top moments from Day 2: Shreyas Iyer fails to convert into century Day 1 of the Test saw Iyer survive narrowly after the bails refused to fall off despite the ball hitting the stumps, but there was no such escape for Iyer on the second day of the first Test against Bangladesh on Thursday. Iyer resumed from his overnight score of 82 but could only add four more runs to his total, before being cleaned up by Ebadot Hossain, who was also the bowler when Iyer survived on Wednesday. This time, however, Ebadot had finally got his man in the 98th over of the Indian innings. Had Iyer scored a century, it would have been just his second Test ton, and fourth overall in international cricket. Kuldeep-Ashwin stand India had just lost Iyer with Ashwin at the other end, and spinner Kuldeep joined him in the middle. Spinners win matches. Kuldeep and Ashwin are keeping the saying true. There partnership putting India in a prime position. #BANvIND 🤣 — Brad Hogg (@Brad_Hogg) December 15, 2022 Kuldeep’s best score with the bat before this match was 26, that came against Sri Lanka back in 2017, but this time, he went onto make a patient knock of 40 off 114 balls. Kuldeep built and 87-run stand with Ashwin(58), who had got to his 13th Test fifty. Kuldeep, in fact, survived a caught behind dismissal on 0 after the ball failed to make contact with the bat, and finally got off the mark in the 19th ball he faced. He went to hit five fours, including a pull and a reverse sweep. Kuldeep Yadav among the wickets After his heroics with the bat to save India, Kuldeep then featured among the wicket-takers for India, finishing the day with figures of 4/33 from 10 overs. Kuldeep struck for the first time on the day in the 25th over of the Bangladesh reply, seeing off Shakib Al Hasan courtesy a catch by Kohli at slip position. Something exciting about seeing a spinner who looks like taking a wicket with every ball he bowls. Kuldeep Yadav is in excellent rhythm — Harsha Bhogle (@bhogleharsha) December 15, 2022 Eight overs later, Shubman Gill completed a spectacular catch at short leg as Kuldeep saw off Nurul Hasan. Kuldeep spun a web again in the 35th over, where he struck twice to remove Mushfiqur Rahim and Taijul Islam in the same over. Mohammed Siraj bags three Mohammed Siraj himself too featured in the wicket-takers section for India, scalping three wickets. It was a low and turning pitch on Day 2 at the Zahur Ahmed Chowdhury Stadium in Chattogram, and Siraj struck in the very first ball of the Bangladesh innings, removing Najmul Hossain Shanto for a golden duck. He followed it up with another wicket in the 14th over, cleaning up Litton Das, before seeing off Zakir Hasan four overs later. Siraj finished the day with figures of 3/14 from nine overs, at an economy of just 1.55. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 15, 2022 19:08:00 IST Tags: Cricket India Vs Bangladesh Kuldeep Yadav Mohammed Siraj Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2022-12-15 13:38:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Ashwin-and-Kuldeep-640_AP.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Manoj Prabhakar steps down as head coach of Nepal men’s cricket team","link":"https://thenewsmill.com/2022/12/manoj-prabhakar-steps-down-as-head-coach-of-nepal-mens-cricket-team/","keywords":["Cricket","Sports","ANI"],"creator":["ANI"],"video_url":null,"description":null,"content":"Nepal men’s cricket head coach Manoj Prabhakar has stepped down from his position, announced Cricket Association of Nepal (CAN) on Thursday. “Manoj Prabhakar has stepped down from his position of Nepal Men’s National Cricket Team’s Head Coach with immediate effect on 15th December 2022. CAN has accepted his resignation and wish him the best for his future,” said CAN in a statement on Twitter. He was announced as the Head Coach of Nepal’s team back in August this year. He succeeded Pubudu Dassanayake, Indian allrounder Prabhakar worked as head coach for three Ranji Trophy teams. In 2016, Prabhakar, who had represented his home nation in 169 internationals, served as Afghanistan’s bowling coach. Notably, Prabhakar has represented India from 1984-1996. He played as an all-rounder. In 32 Test matches, he scored 1,600 runs across 58 innings at an average of 32.65. Prabhakar scored one century and nine half-centuries in the format, with the best score of 120. He also took 96 wickets in the format, with the best bowling figures of 6/132 in an innings. The all-rounder also played 130 ODIs, in which he scored 1,858 runs at an average of 24.12. He has two centuries and 11 fifties in the format, with the best score of 106 runs. Prabhakar also has 157 wickets in the format, with the best bowling figures of 5/33. (ANI) ALSO READ: Indian High Commissioner Vikram Doraiswami presents credentials to King Charles at Buckingham Palace This report is filed by ANI news service. TheNewsMill holds no responsibility for this content.","pubDate":"2022-12-15 13:31:23","image_url":null,"source_id":"thenewsmill","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs Bangladesh: Visitors in control of first Test as Tigers crumble against Kuldeep Yadav, Mohammed Siraj","link":"https://www.firstpost.com/firstcricket/sports-news/india-vs-bangladesh-visitors-in-control-of-first-test-as-tigers-crumble-against-kuldeep-yadav-mohammed-siraj-11815591.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"India vs Bangladesh: Visitors in control of first Test as Tigers crumble against Kuldeep Yadav, Mohammed Siraj","content":"Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 12:48:16","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/India-vs-Bangladesh-1-5.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Big Bash League: Bail falls on its own during Renegades-Heat tie, leaves batter confused","link":"https://www.firstpost.com/firstcricket/sports-news/big-bash-league-bail-falls-on-its-own-during-renegades-heat-tie-leaves-batter-confused-11815071.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Big Bash League: Bail falls on its own during Renegades-Heat tie, leaves batter confused","content":"Weird moments are often seen on a cricket field – from player’s antics, animals invading the pitch, or the ball hitting the stumps but keeping the bails intact.Another similar incident was seen in the Big Bash League round-robin match as the bails were dislodged without anything hitting the stumps during Melbourne Renegades’ tie against Brisbane Heat at the Cazaly’s Stadium in Cairns on Thursday.Interestingly, a day earlier, India’s Shreyas Iyer earned a lifeline in the Test match against Bangladesh as the ball hit the stumps after he missed the line, but the bails remained intact and he went on to play.The incident happened when Renegades skipper Nic Maddinson was facing Mark Steketee in the ninth over. Maddinson tried to play a pull shot and had his front foot going back toward the stumps in the process. The players, including the batter, and commentators thought of it to be a hit wicket and Maddinson started walking back to the dugout.However, the replays suggested that he did not hit the stumps. The bail had fallen due to wind and he was not even close to the stumps.Watch the video:What on earth???Looks like the wind’s knocked the bail off! Maddinson stays safe 😅@KFCAustralia #BucketMoment #BBL12 pic.twitter.com/sboxGvIewA— KFC Big Bash League (@BBL) December 15, 2022 The third umpire confirmed the scene and Maddinson went on to bat further. The southpaw was on 42 when the incident happened, but went on to score 87 from 49 deliveries. His knock included 10 boundaries and three maximums.His innings also proved to be pivotal in Renegades’ 22 runs win over Brisbane Heat and he was awarded the player of the match award.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 11:56:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Nic-Maddinson.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC launches maiden U-19 Women's T20 World Cup in South Africa","link":"https://www.sentinelassam.com/sports/cricket/icc-launches-maiden-u-19-womens-t20-world-cup-in-south-africa-628201","keywords":["Sports,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The International Cricket Council (ICC) launched the inaugural ICC U-19 Women's T20 World Cup here, with one month to go until the first ball is bowled in the tournament.","content":"BENONI: The International Cricket Council (ICC) launched the inaugural ICC U-19 Women's T20 World Cup here on Wednesday, with one month to go until the first ball is bowled in the tournament.The event which is a first of its kind in world cricket will take place from January 14 to 29, 2023 and will see the future stars of the women's game compete in 41 matches played across four venues in Benoni and Potchefstroom in 16 days of competitive cricket. The 16 teams in the fray include Indonesia and Rwanda, who will feature in an ICC World Cup for the first time ever. Eleven full member nations gained automatic entry in this historic edition: Australia, Bangladesh, England, India, Ireland, New Zealand, Pakistan, South Africa, Sri Lanka, the West Indies and Zimbabwe. Scotland, the United Arab Emirates (UAE) and the United States of America (USA) join Indonesia and Rwanda to take the remaining five slots, representing each of the ICC's five regions. The teams will be divided into groups of four. Australia are in group A along with Bangladesh, Sri Lanka and USA while Group B features England, Pakistan, Rwanda and Zimbabwe. New Zealand, Ireland, Indonesia and the West Indies complete the group C, with India, Scotland, South Africa and the UAE featuring in Group D. At the competition launch, former Proteas women's cricketer and South African Olympic javelin silver medallist, Sunette Viljoen, was unveiled as the ICC U19 Women's T20 World Cup Ambassador. She was joined by the Member of the Executive Council of Gauteng Sports, Arts & Culture, Morakane Mosupyoe. The other notable guests included Cricket South Africa Board Member and LOC Chair, Muditambi Ravele, CSA CEO, Pholetsi Moseki, UNICEF South Africa Chief of Communications & Partnerships, Toby Fricker and South Africa women's team players, Sinalo Jafta and Raisibe Ntozakhe. \"This is a watershed moment for women's cricket in South Africa and for the game in our country. To host one ICC event in a year is cause for great celebration, but to claim two in such quick succession is beyond our wildest dreams,\" Tournament Director Sivuyile Mqingwana said in an ICC media statement. IANS Also Read:  Women's T20I Rankings: McGrath becomes No.1 batter, Mandhana holds third place Also Watch:","pubDate":"2022-12-15 11:51:37","image_url":"https://assets.sentinelassam.com/h-upload/2022/12/15/421644-icc.jpg","source_id":"sentinel","country":["india"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi League 2022: Bengaluru Bulls coach Randhir Singh hopes for strong defensive show","link":"https://www.firstpost.com/sports/pro-kabaddi-league-2022-semi-finals-preview-11814901.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi League 2022: Bengaluru Bulls coach Randhir Singh hopes for strong defensive show","content":"Sports Pro Kabaddi League 2022: Bengaluru Bulls coach Randhir Singh hopes for strong defensive show Jaipur Pink Panthers will take on Bengaluru Bulls in the first Pro Kabaddi League semi-final. The other will see Puneri Paltan face Tamil Thalaivas FP Sports December 15, 2022 16:56:44 IST Randhir Singh, coach of Bengaluru Bulls, speaks to his team during a Pro Kabaddi League game. Image: Pro Kabaddi Pro Kabaddi League semi-finals: The Bengaluru Bulls put on a show for their fans in Eliminator 1, decimating Dabang Delhi by a scoreline of 56-24, to book their spot in the Pro Kabaddi semi-final. Raiders Vikash Kandola and Bharat were in top form, and Coach Randhir Singh was understandably delighted as this was also the first time the Bengaluru Bulls had defeated Dabang Delhi side in the playoff stages. “The game against the Dabang Delhi KC side has to be the most impressive game for me in this season. We have history against Dabang Delhi team, so this win was even sweeter for us,” the coach said. Speaking on what he needs the team to do going ahead, Randhir Singh said, “If the defensive unit can work well and put up a strong show, then the Bengaluru Bulls will do well, because my raiders are in form, Bharat, Vikash and Neeraj. In the Semi-Final, the strategy is always different and we will do our best against the Jaipur Pink Panthers, who are a solid team too.” Going into the Semi-Final, the Tamil Thalaivas’ coach Ashan Kumar has complete faith in his squad, and said, “The team is in a good place and we will continue to work on our tactics, keep clarity in our roles, and work in a way that our coordination is not disturbed as well. We will continue to discuss these essential aspects, and if we can execute our plans well, there is no doubt we will do well against Puneri Paltan.” Pro Kabaddi semi-final fixtures: Jaipur Pink Panthers vs Bengaluru Bulls Puneri Paltan vs Tamil Thalaivas Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: December 15, 2022 16:56:44 IST TAGS: Kabaddi Pkl 2022 Pro Kabaddi League 2022","pubDate":"2022-12-15 11:26:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/PKL-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN: फील्डिंग में हुई चूक से भारत को मिली 5 रनों की पेनाल्टी, देखें बांग्लादेश से कहां हुई गलती","link":"https://www.abplive.com/sports/cricket/ind-vs-ban-indian-team-gets-5-runs-penalty-after-bangladesh-fielder-s-mistake-see-video-2282770","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs BAN: भारत और बांग्लादेश के बीच खेले जा रहे पहले टेस्ट मैच का आज दूसरा दिन है. भारतीय टीम की पहली पारी 404 रनों पर खत्म हुई. अब बांग्लादेश अपनी पहली पारी के लिए मैदान पर आ चुकी है. भारतीय टीम ने अपने दूसरे दिन की शुरुआत 6 विकेट पर 278 रनों से साथ की थी. पहले दिन लय में दिखे श्रेयस अय्यर ने दूसरे दिन जल्दी अपना विकेट गंवा दिया. इसके बाद आर अश्विन और कुलदीप यादव के बीच अच्छी पार्टनरशिप हुई. इसी बीच मैच में एक ऐसा वाक़ाय सामने आया, जिसने भारतीय टीम के खाते में पेनाल्टी के रूप में 5 रन जोड़ दिए.  बांग्लादेश की गलती भारत को मिली पेनाल्टी बल्लेबाज़ी कर रहे आ अश्विन ने ताइजुल की गेंद डिफेंस करना चाही, लेकिन गेंद उनके बल्ले का बाहरी किनारा लेते हुए थर्डमैन की दिशा में जाने लगी. गेंद को दूर जाता देख अश्विन और कुलदीप ने भागकर सिंगल लिए. फील्डर ने कीपर की तरफ थ्रो फेंका और गेंद सीधी जाकर ज़मीन पर रखे हेलमेट में लगी. यह हेलमेट विकेटकीपर के पीछे रखा था. जैसे ही गेंद हेलमेट में लगी अंपायर ने पांच रनों की पेनाल्टी का इशारा कर दिया. यह मामला भारतीय पारी के 112 वें ओवर में हुआ. उस वक़्त भारतीय टीम 7 विकेट के नुकसान पर 322 रन बना चुकी थी. 5 penalty runs !! Yasir Ali hits the ⛑️ pic.twitter.com/pMQ373lMWZ — Cricket Videos (@kirket_video) December 15, 2022   क्या कहता है नियम नियम के मुताबिक, अगर गेंद विकेटकीपर या फील्डिंग टीम के किसी भी खिलाड़ी हेलमेट पर लगे, जो ज़मीन पर रखा हो, तो उस गेंद पर बल्लेबाज़ी वाली टीम को पांच रन पेनाल्ट के रूप में दिए जाते हैं. यहां भी ऐसा ही हुआ.  अश्विन ने जड़ा अर्धशतक, कुलदीप ने बनाए 40 भारतीय टीम को अच्छे स्कोर तक पहुंचाने में निचले क्रम के बल्लेबाज़ों का अहम योगदान रहा. इसमें आर अश्विन ने 58 रनों की पारी खेली. यह उनके टेस्ट करियर का 13वां अर्धशतक था. वहीं अश्विन के साथ क्रीज़ पर मौजूद कुलदीप यादव ने टीम के लिए ज़रूरी 40 रन बनाए.        ये भी पढ़ें... इंग्लिश को लेकर पूर्व पाक क्रिकेटर सईद अजमल बोले- मुझे नहीं बोलनी आती, पर मैं नंबर वन रहा हूं","content":null,"pubDate":"2022-12-15 10:24:18","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/15/c211bfec17e347bf44d7a6c44ec2ffbf1671099689086582_original.jpg","source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"T20 World Cup came at a perfect time for us to showcase Melbourne, says Visit Victoria CEO Brendan McClements","link":"https://www.firstpost.com/sports/t20-world-cup-came-at-a-perfect-time-for-us-to-showcase-melbourne-says-visit-victoria-ceo-brendan-mcclements-11814191.html","keywords":["Sports"],"creator":["Sahil Malhotra"],"video_url":null,"description":"T20 World Cup came at a perfect time for us to showcase Melbourne, says Visit Victoria CEO Brendan McClements","content":"Tourism sector was one of the worst hit in Australia during COVID-19 as the country locked its borders and imposed a strict and lengthy lockdown. Slowly, but surely, the borders have reopened and tourism activities have returned to full swing.Sports continues to play a major role in driving tourism back to Australia. Melbourne, Victoria in particular. A well-contested T20 World Cup, featuring the blockbuster India-Pakistan clash at the MCG, has played its part and now it’s over to the upcoming Australian Open and the Australian Grand Prix to sustain the momentum.In an exclusive chat with Firstpost.com, Visit Victoria’s CEO Brendan McClements talks about the challenge of bringing people back to Melbourne and Victoria and the road ahead. Excerpts:How difficult was it getting people back to Australia?We obviously went through challenging time but this whole year we have been giving people reasons to come back to Melbourne and Victoria. Cricket World Cup was there, we had tennis at start of the year. So we have given people reasons to drop that reluctance. I think aviation capacity is the biggest challenge for now. Flights are full and it’s difficult to get flights to Australia. The big challenge right now is not people wanting to come here, it’s about people not being able to get on a plane to get here.Once you are here, you obviously have enough reasons to be interested.Oh yeah. What we have seen there is a great appetite among people to travel. As soon as they travel, they want to travel again. We are confident that if we can deal with those capacity issues, we will see a fantastic future.Cricket World Cup couldn’t have been timed better for revival of tourism in Australia, right?Cricket World Cup came at a perfect time for us to showcase Melbourne and Victoria to the world, to India in particular. And we have seen a fantastic response. Tens of thousands of Indians have travelled for the World Cup, so as the world comes back to us, India is very important part of our relationship. And this was an ideal starting point for us to reintroduce Melbourne and Victoria to the market of people.There is a lot of cultural diversity on display in Melbourne. You think that could help play a part when you look at reviving tourism in the country overall?We are proud of the multicultural nature of Melbourne. More than 200,000 Indians chose to make Melbourne their home. Really strong connections people to people here. So many students prefer to study here, so I think it’s a really embracing place. So there can be no place better than Melbourne to start your journey in Australia.And there’s more to see in Melbourne than just the rich sporting culture.Absolutely yes. We are proud of our sporting culture but we also have a wonderful food culture, art culture and we are close to natural wildlife. So If you want to come to a place which has great urban experience and also experience Australian kangaroos, which is not far away, then Melbourne is the place for you. For Indian tourists, it’s the perfect location. So come to Melbourne is my message for everyone out there.(The writer was in Melbourne on invite of Visit Victoria)Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-12-15 10:23:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/12/Australian-Open-2022-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"First Test: Bangladesh slip to 37/2 at tea as India take control","link":"https://www.orissapost.com/first-test-bangladesh-slip-to-37-2-at-tea-as-india-take-control/","keywords":["Sports","bangladesh","First test","India"],"creator":["Post News Network"],"video_url":null,"description":"Chattogram: Pace duo of Mohammed Siraj and Umesh Yadav reduced Bangladesh to 37 for 2 at tea after a stunning lower-order fightback helped India take control of the opening Test against Bangladesh here Thursday. Siraj struck on the very first ball when he induced an edge off lefthander Najmul Hossain Shanto with an away-going delivery. […]","content":"First Test: Bangladesh slip to 37/2 at tea as India take control PTI Updated: December 15th, 2022, 15:28 IST in Sports 0 Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin Chattogram: Pace duo of Mohammed Siraj and Umesh Yadav reduced Bangladesh to 37 for 2 at tea after a stunning lower-order fightback helped India take control of the opening Test against Bangladesh here Thursday. Siraj struck on the very first ball when he induced an edge off lefthander Najmul Hossain Shanto with an away-going delivery. Leading the pace department in absence of Mohammed Shami and Jasprit Bumrah, Yadav then reduced Bangladesh to 5 for 2 inside the fourth over after inducing an inside edge off Yasir Ali, who was playing away from his body. But thereafter Litton Das calmed things down with his fluent drives and remained unbeaten on 24 off 26 balls. At the break, Das and Zakir Hasan (9) were in the middle with Bangladesh trailing India by 367 runs with eight wickets in hand. The opening session was all about Ravichandran Ashwin (58 off 113 balls, 2×4, 2×6) and Kuldeep Yadav, who made a perfect case for him as an allrounder in absence of Ravindra Jadeja, with a career-best 40 (114b; 5×4). Playing his first Test after more than 22 months, Kuldeep extended splendid support to Ashwin as the duo frustrated Bangladesh with an 87-run partnership for the eighth wicket. The 28-year-old Kuldeep, who has a century and six fifties averaging 22-plus in first-class cricket, got off the mark after 18 balls as he looked solid with his defence. His slog sweep and reverse sweep shots also caught the attention. Ashwin, who has five Test centuries including four against the West Indies, showed a lot of composure and maturity en route to his 13th Test half-century. The duo hardly took a foot wrong pushing India past the 400-mark after the visitors resumed the day at 278 for 6 and lost overnight batter Shreyas Iyer (86) with the addition of just four runs to his total. Having batted India out of a tricky spot on an opening day, Iyer once again failed to get to a well-deserved hundred and got out with an addition of just four runs to his overnight total. Bangladesh skipper Shakib Al Hasan mostly employed his star spinner Mehidy Hasan Miraz to go in tandem with pacer Khaled Ahmed but Ashwin hardly looked in any trouble. He made his intentions clear stepping down to Mehidy for a six. Luck also favoured Ashwin when he survived an ‘umpire’s call’ after left-arm spinner Taijul Islam had him trapped in front of the leg stump when he was on 34. That pace spearhead Ebadot Hossain was taken out of the attack after his impressive spell of 4-1-7-1 in the morning also helped the Indian cause. Kuldeep also oozed confidence as Ashwin was happy to take singles and give him the strike. Tags: bangladesh First test India Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts First Test: India reduce Bangladesh to 133 for 8 at stumps on day 2 December 15, 2022 India’s first innings folds for 404 on day 2 against Bangladesh December 15, 2022 France, England World Cup quarterfinal viewed by 13.5M in US December 15, 2022 Kane Williamson steps down as NZ Test skipper December 15, 2022 ‘Messi’ah of Millions: Indian fans wait for Messi’s ‘2011 Tendulkar moment’ December 15, 2022 Like father, like son: Tendulkar Jr emulates father to score century on first-class debut December 14, 2022 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment.","pubDate":"2022-12-15 09:58:35","image_url":"https://www.orissapost.com/wp-content/uploads/2022/12/AFP_333X72W-300x169.jpg","source_id":"orissapost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs BAN | Umesh Yadav who hit six for 100m; He bowled and flew off the stumps","link":"https://thenewsglory.com/ind-vs-ban-umesh-yadav-who-hit-six-for-100m-he-bowled-and-flew-off-the-stumps/","keywords":["Sports","Bangladesh","Cricket","India","Umesh Yadav"],"creator":["The News Glory"],"video_url":null,"description":"Chatogram: Indian cricketer Umesh Yadav hit six for 100 meters in the first Test match against Bangladesh. Also in this match he clean bowled Yasir Ali who was on strike while bowling against Bangladesh. The stump flew a few feet in the air. Indian cricket team is playing a cricket series in Bangladesh. Both the […]","content":"Chatogram: Indian cricketer Umesh Yadav hit six for 100 meters in the first Test match against Bangladesh. Also in this match he clean bowled Yasir Ali who was on strike while bowling against Bangladesh. The stump flew a few feet in the air. Indian cricket team is playing a cricket series in Bangladesh. Both the teams are currently playing in the Test series. India scored 404 runs in the first innings and were all out in the first Test in Chattogram. Currently, the Bangladesh team is playing with the loss of three wickets. Umesh Yadav came to bat after Ashwin got out after his half century. On the second ball he faced, Vlasi threatened a six around 100 meters towards midwicket. That over was bowled by Mehdi Hasan. Then again he had a sixer. He scored a total of 15 runs off 10 balls in the first innings. Similarly, in the second over he bowled, Bangladesh player Yasir Ali took the wicket and was amazing. The ball was an inside edge and smashed the leg stump. It flew a few feet into the air. Similarly another Indian bowler Siraj has taken 3 wickets.","pubDate":"2022-12-15 09:55:38","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"मुंबई की बैटर ने किया स्मृति मंधाना जैसा कमाल... जड़ी तूफानी डबल सेंचुरी.. क्या नेशनल टीम में मिलेगा मौका?","link":"https://hindi.news18.com/news/sports/cricket-sanika-chalke-hits-double-century-in-u19-odi-tournament-enter-in-smriti-mandhana-jemimah-rodrigues-elite-club-5056687.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Sanika Chalke Double Century U-19 ODI Cricket: 16 साल की उम्र में मुंबई की बैटर ने अंडर-19 वनडे क्रिकेट में बड़ा कमाल किया है. सानिका चाल्के ने चौकों और छक्कों की झड़ी लगाते हुए भारतीय महिला क्रिकेट टीम की उप कप्तान स्मृति मंधाना और जेमिमा रोड्रिग्स के क्लब में शामिल हो गई हैं.","content":null,"pubDate":"2022-12-15 09:35:51","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/12/Mumbai-Cricket-Team-16710963013x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"}]}