{"newsArray":[{"title":"QUN vs TAS Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11 and Pitch Report for Australia One Day Cup 2022, Match 5","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/qun-vs-tas-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-pitch-report-australia-one-day-cup-2022-match-5?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-30 02:41:56","image_url":"https://static.sportskeeda.com/editor/2022/09/d03f8-16644882570853-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"KP beat Balochistan by 10 wickets","link":"https://www.thenews.com.pk/print/995730-kp-beat-balochistan-by-10-wickets","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Bismillah Khan's century went in vain as Khyber Pakhtunkhwa defeated Balochistan by 10 wickets at the NBP Sports Complex in the opening round match of the Cricket Associations Championship on Thursday.Wicketkeeper-batter Bismillah contributed an unbeaten 144 off 148 balls in...","content":"KARACHI: Bismillah Khan's century went in vain as Khyber Pakhtunkhwa defeated Balochistan by 10 wickets at the NBP Sports Complex in the opening round match of the Cricket Associations Championship on Thursday. .ads_between_content{ height:auto; width:auto; clear: both; text-align: center; } .ads_between_content .story_ads{ } /*@media (max-width:600px){ .ads_between_content{ float:none; margin:0px auto; text-align: center; } }*/ Wicketkeeper-batter Bismillah contributed an unbeaten 144 off 148 balls in Balochistan’s second innings of 233 all out in 53 overs. Khyber Pakhtunkhwa’s Niaz Khan and Mohammad Imran bagged three wickets apiece, while Maaz Khan took two wickets. Khyber Pakhtunkhwa achieved the 29 runs target without losing any wicket. Earlier, having resumed their first innings at 449 for nine in 106 overs, Khyber Pakhtunkhwa were dismissed for 461 in the 110th over. At the KCCA Stadium, after resuming their second innings at 82 for two, Southern Punjab were bowled out for 290 in the 90th over. Mohammad Umair coming to bat at number seven top-scored with a 105-ball 85, which included three fours and three sixes. Rameez Alam scored a 139-ball 74, hitting six fours. Umer Khan, who had bagged five wickets in the first innings, bagged six wickets for 123 runs. Chasing 380 to win, Northern were 101 for one in 26 overs when bails were drawn. Nasir Nawaz returned undefeated on a 51-ball 54, smashing four fours and two sixes. Danish Aziz, batting at number five, scored 86 off 183, which included nine boundaries, to help Sindh post 202 all out. Scores in brief: Balochistan 256 all out, 71.3 overs (Mohammad Shahid 65, Jalat Khan 45; Maaz Khan 3-60, Mohammad Imran 3-62, Mohammad Abbas Afridi 2-46) and 233 all out, 53 overs (Bismillah Khan 144 not out; Niaz Khan 3-28, Mohammad Imran 3-51, Maaz Khan 2-59). Khyber Pakhtunkhwa 461 all out, 109.4 overs (Maaz Ahmed Sadaqat 114, Mohsin Khan 82, Israrullah 71, Mohammad Bilal 56 not out, Mehran Ibrahim 53; Jalat Khan 4-109, Gohar Faiz 3-102) and 29-0, 5.4 overs.","pubDate":"2022-09-30 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Running Out Non-Striker In Cricket: Here's What 'Legends' Told NDTV","link":"https://sports.ndtv.com/cricket/running-out-non-striker-in-cricket-heres-what-legends-told-ndtv-3390512","keywords":["Cricket"],"creator":["NDTV"],"video_url":null,"description":"While speaking to NDTV, the likes of Jacques Kallis, Ross Taylor, Lance Klusener and Ryan Sidebottom gave their opinion on running the non-striker out when they are backing up too far ahead","content":"The debate around whether running out the non-striker, when he or she is backing up too far ahead of the crease, has picked up once again after India women's team all-rounder Deepti Sharma dismissed Charlie Dean of England at the mecca of cricket -- Lord's Cricket Ground. This mode of dismissal is well within the laws and the next day, the MCC -- the custodians of the game also came out with a statement, saying what transpired was well within the laws and it shouldn't be looked at as anything more. But several England cricketers, former and current, unanimously said that the act done by the Indian cricketer was not in keeping with the \"spirit of cricket\". The dismissal has for long, in cricket parlance, been known as 'Mankad'. A little backgrounder first, as to why this mode of dismissal has for long been called 'Mankad'. India legend Vinoo Mankad had dismissed Bill Brown of Australia as he was backing up too far out of his crease during India's first-ever series Down Under in 1947-48. From then onwards, this mode of dismissal is referred to as 'Mankad' by western countries. However, this mode of dismissal got a major shot in the arm some days back, as the ICC came up with the new playing conditions which will come into effect from October 1. Regarding 'Running out of the non-striker', the ICC said \"The Playing Conditions follow the Laws in moving this method of effecting a Run out from the 'Unfair Play' section to the 'Run out' section.\" Looking at the huge outcry over Deepti running out Dean, NDTV spoke to a few former players who are currently in India to participate in Legends League Cricket. We spoke to Ryan Sidebottom (England), Jacques Kallis (South Africa), Ross Taylor (New Zealand), and Lance Klusener (South Africa). Kallis, and Taylor said that they would not resort to this mode of dismissal, while Sidebottom and Klusener made some interesting observations. \"One I am a bowler, so I am biased. It is within the laws of the game, isn't it? I think for too long, the batters have had it a little bit easy with the rules, two white balls and you can only bowl one bouncer in an over. It is very difficult for the bowlers; you have to stay in your crease. It is a contentious subject because people say it is not within the spirit of cricket but if you go by the rules, it is within the laws. It is a gentleman's game; the women's game is also rising. Yes, I agree with it, but on the other hand, it kind of does not put a great light on, I suppose, Jhulan Goswami 's retirement and to win a game like that. But it is within the rules,\" said former England pacer Sidebottom. \"I would prefer for there to be a warning, once you warn the batter once, I think then you have the opportunity to run out the batter at the non-striker's end. I would say it is great for cricket because it is putting the sport on the map because people are having different opinions. We all have different ideas on how the sport should be played so I think it is great,\" he added. Former players Kallis and Taylor said that they would not like it if this mode of dismissal is done, and they would not run out the non-striker if it came down to it. \"No, I don't support it. I am not going to say it is not right because it is within the rules. But it is not something that I would do, but I am not a bowler, I cannot do it either way,\" said former Kiwi player Ross Taylor. Talking about the same, Kallis said: \"I will put it this way, if I was a coach of a team, I would not be happy with it. I think you have to give the batter a fair amount of warning, each one has their own way of doing it. That is my take on it. I would not be happy if someone did that in my team. I do not know what happened behind the scenes, but I have to say that you need to give batters a few warnings before doing it.\" Lastly, former South Africa all-rounder Lance Klusener had a different take on the whole issue, saying the umpires can check whether the batter is backing up too far ahead just the same way they do for no-balls. Promoted \"Mankad, the debate has gone on for far too long. The players do not need to respect the laws. There needs to be a clear way of going about it, whether you can go about it the same way I guess in terms of checking like we do the no-ball. It can be something that will take out of everybody's hands. I guess the result, of whatever the penalty or whatever it is, it is black and white or colour, it would be there for everyone to see.\" \"But I think, taking it just the way you look out for no-ball, you can watch for it as well in terms of backing up or whatever it is,\" he stated further.","pubDate":"2022-09-30 00:58:02","image_url":"https://c.ndtvimg.com/2022-09/0j3vf0n8_deepti-sharma-twitter_650x400_25_September_22.jpg?im=FitAndFill,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"PAUL NEWMAN: Headingley, Mankad and Bazball... the good, bad and ugly of a very eventful season","link":"https://www.dailymail.co.uk/sport/cricket/article-11264405/PAUL-NEWMAN-Headingley-Mankad-Bazball-good-bad-ugly-eventful-season.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"WORLD OF CRICKET: A dramatic campaign ended in extraordinary drama as Warwickshire stayed up. Here, Sportsmail's PAUL NEWMAN picks out the highlights and low points.","content":null,"pubDate":"2022-09-29 21:34:58","image_url":"https://i.dailymail.co.uk/1s/2022/09/29/21/62942971-0-image-a-12_1664483148297.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Liam Norwell’s nine-wicket haul saves Warwickshire and relegates Yorkshire - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL3NlcC8yOS9saWFtLW5vcndlbGxzLW5pbmUtd2lja2V0LWhhdWwtc2F2ZXMtd2Fyd2lja3NoaXJlLWFuZC1yZWxlZ2F0ZXMteW9ya3NoaXJl0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Liam Norwell’s nine-wicket haul saves Warwickshire and relegates Yorkshire  The GuardianCounty Championship: Liam Norwell takes 9-62 as Warwickshire beat Hampshire to relegate Yorkshire  BBCSadler insists Northants' season should be seen as a success  Northampton Chronicle and EchoCounty cricket final day: Warwickshire beat Hampshire to relegate Yorkshire  The GuardianSimon Harmer ends season as top bowler after Essex win at Northamptonshire  Southend EchoView Full coverage on Google News","content":null,"pubDate":"2022-09-29 19:59:43","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Bumrah ruled out of T20 World Cup","link":"https://www.thehansindia.com/sports/cricket/bumrah-ruled-out-of-t20-world-cup-763656","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"India’s pace spearhead will be forced out of action for six months due to back stress fracture","content":"New Delhi: India's pace spearhead Jasprit Bumrah was on Thursday ruled out of the T20 World Cup due to a back stress fracture, dealing a massive blow to team's chances at the ICC flagship event starting next month in Australia.A BCCI official told PTI that Bumrah will be forced out of action for six months due to the back injury. \"Bumrah is not going to play the T20 World Cup for sure. He has a serious back condition. It's a stress fracture and he could be out for a period of six months,\" a senior BCCI official told PTI on conditions of anonymity. Stress fracture is a tiny crack in the bone, caused by overuse and is common in sports persons. When stress reaction (bone bruise) goes undetected for a considerable time, it develops into stress fracture. Almost 50 per cent of sports injuries are caused by stress fractures. Back stress fractures do not require surgery but a lot of time to heal. Rest is best solution to treat stress fractures. It is understood that either Deepak Chahar or Mohammed Shami could replace Bumrah in the main squad. Both were named as stand-by players for the prestigious tournament by the BCCI. Bumrah, who played the second and third T20 against Australia, had travelled with the team to Thiruvananthapuram for the series-opener against South Africa but left for Bengaluru to be at National Cricket Academy (NCA) for rehabilitation. The 28-year-old fast bowler is the second senior star player to be ruled out after Ravindra Jadeja, who is recovering from a knee surgery. The Indian team is already looking unsettled at the moment and Bumrah's injury has only compounded the woes for skipper Rohit Sharma and coach Rahul Dravid. \"Losing Bumrah and Jadeja will be huge for India. We didn't expect that things will pan out as they have. He was rested for the Asia Cup precisely to manage his workload management. Now it remains a question if he was even fit enough to play the Australia series,\" the senior official said. Many senior players have been given adequate rest, keeping in mind their workload. What is more interesting is the fact that Bumrah has played only five Tests, five ODIs and as many T20Is in 2022 apart from IPL games for Mumbai Indians. \"That's not a lot of cricket, considering that he was rested for Asia Cup, West Indies tour and also some of the bilateral cricket played in India. That's a lot of rest. \"As of now he is at the NCA and the rehab will be a long and arduous one. Yes, World T20 is important but he is still young and India's biggest bowling asset. You can't take risk with him,\" the official said. Bumrah, who has a slinging action, puts a lot of pressure on his back during loading. Former West Indies pace bowling great Michael Holding had assessed that Bumrah was always a candidate for back injuries. (PTI)","pubDate":"2022-09-29 18:30:35","image_url":"https://assets.thehansindia.com/h-upload/2022/09/29/500x300_1314431-bumrah.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"LLC 2022: राइडर और कैफ के अर्द्धशतक पर मसाकाद्जा पड़े भारी, इंडिया कैपिटल्स को 7 विकेट से मिली जीत","link":"https://hindi.news18.com/news/sports/cricket-legends-league-cricket-2022-india-capitals-won-by-seven-wickets-against-manipal-tigers-4669449.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Legends League Cricket 2022: लीजेंड्स लीग क्रिकेट का 10वां मुकाबला गुरुवार को मणिपाल टाइगर्स और इंडिया कैपिटल्स के बीच कटक में खेला गया. इस मुकाबले में इंडिया कैपिटल्स की टीम को सात विकेट से जीत मिली.","content":null,"pubDate":"2022-09-29 18:05:21","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/09/Hamilton-Masakadza-2-16644744893x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Yorkshire relegated to division two after Warwickshire win","link":"https://www.yorkpress.co.uk/news/22912115.yorkshire-relegated-division-two-warwickshire-win/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"YORKSHIRE County Cricket Club have been relegated to division two of the LV = County Championship.","content":null,"pubDate":"2022-09-29 16:38:40","image_url":"https://www.yorkpress.co.uk/resources/images/15955395/?type=app&htype=0","source_id":"yorkpress","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"New BBL rules DRS: New over rate rule in Big Bash League 2022-23 explained","link":"https://thesportsrush.com/cricket-news-new-bbl-rules-drs-new-over-rate-rule-in-big-bash-league-2022-23-explained/","keywords":["Cricket","BBL 2022-23","Big Bash League"],"creator":["Dixit Bhargav"],"video_url":null,"description":"New BBL rules: Big Bash League has pulled the plug on a couple of changes made under the name of innovation. Never been averse to changes including those made around the basic nature of sport, Big Bash League has come with an addition and two subtractions to their rules ahead of the forthcoming 12th season.… The post New BBL rules DRS: New over rate rule in Big Bash League 2022-23 explained appeared first on The SportsRush.","content":"New BBL rules: Big Bash League has pulled the plug on a couple of changes made under the name of innovation. Never been averse to changes including those made around the basic nature of sport, Big Bash League has come with an addition and two subtractions to their rules ahead of the forthcoming 12th season. Not a very deep dive into history is needed to recall how CA (Cricket Australia) had introduced three rules under the name of innovation to make their premier T20 league more enthralling. Introduced before BBL 2020-21, these three new rules were named Power Surge, X-Factor and Bash Boost. While Power Surge has been retained for BBL 2022-23, both X-Factor and Bash Boost have been done away with. In simple words, concepts of a substitute player and a bonus point will no longer be implement this season. Surprisingly, removal of X-Factor has happened less than a couple of weeks after BCCI (Board of Control for Cricket in India) announced the introduction of Impact Player for Syed Mushtaq Ali Trophy. New BBL rules 2022-23 BBL introducing DRS (Decision Review System) has emerged as the biggest upshot of the latest development. High time that it was implemented in a leading T20 competition such as the BBL, CA have agreed to shell out close to $2 Million in their attempt to give consequences of umpiring howlers a chop. “Implementing DRS has been a challenging task for the BBL, which is the most logistically complex T20 league in the world,” BBL General Manager Alistair Dobson said in a statement. “That, plus the impact of the pandemic on travel and movement, have meant the technology has not been possible to introduce until this season.” While the technology will be available for all BBL matches, it will be available for a selected 24 (out of 59) Women’s BBL matches. Each team will receive one review per innings. This season will also be the first time when Power Surge will be put into effect in WBBL. Slow over rate rule in BBL In addition to DRS, CA have also decided to follow ICC (International Cricket Council) on the path of penalizing teams for slow over rates. As a result, a regular uninterrupted BBL innings will have to be bowled within 79 minutes. Teams failing to do so will have to field with just four fielders outside the 30-yard circle for the remainder of the innings. It was earlier this year that ICC had set an 85-minute deadline for teams to begin the last over of a T20I innings. It was just over a week ago that ICC had made an announcement regarding bringing the same rule to ODI innings as well. Penalty for defaulters in both T20I and ODI innings remains the same like the BBL. The post New BBL rules DRS: New over rate rule in Big Bash League 2022-23 explained appeared first on The SportsRush.","pubDate":"2022-09-29 16:14:59","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Discrimination in cricket DCMS hearing to take place in mid-December","link":"https://www.independent.co.uk/sport/cricket/azeem-rafiq-dcms-yorkshire-mps-england-and-wales-cricket-board-b2178374.html","keywords":["Cricket","Sport"],"creator":["Jamie Gardner"],"video_url":null,"description":"Azeem Rafiq and Lord Patel are set to be asked to appear.","content":null,"pubDate":"2022-09-29 16:11:45","image_url":"https://static.independent.co.uk/2022/09/29/16/a93389fcb7fd58ca10d745404c9c5454Y29udGVudHNlYXJjaGFwaSwxNjY0NTQ5Nzk2-2.68797313.jpg?width=1200&auto=webp","source_id":"independentuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"LLC 2022: राइडर और कैफ की तूफानी पारी, टाइगर्स ने कैपिटल्स को दिया 162 रनों का लक्ष्य","link":"https://hindi.news18.com/news/sports/cricket-legends-league-cricket-2022-fifties-from-jesse-ryder-and-mohammad-kaif-manipal-tigers-set-a-target-of-162-runs-for-india-capitals-4669107.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"Legends League Cricket: लीजेंड्स लीग क्रिकेट का 10वां मुकाबला गुरुवार यानी आज कटक में खेला जा रहा है. इस मुकाबले में मणिपाल टाइगर्स की टीम ने टॉस हारकर पहले बल्लेबाजी करते हुए इंडिया कैपिटल्स के सामने निर्धारित ओवरों में पांच विकेट के नुकसान पर 162 रनों का लक्ष्य रखा है.","content":null,"pubDate":"2022-09-29 16:07:56","image_url":"https://images.news18.com/ibnkhabar/uploads/2022/09/Mohammad-Kaif-3-16635190283x2.jpeg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","country":["india"],"category":["sports"],"language":"hindi"},{"title":"DCMS hearing on discrimination in cricket pencilled in for December 13","link":"https://ca.sports.yahoo.com/news/dcms-hearing-discrimination-cricket-pencilled-152231073.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-09-29 15:22:31","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Cricket-Durham hit with 10-point penalty for Maddinson&#039;s oversized bat","link":"https://www.thestar.com.my/sport/cricket/2022/09/29/cricket-durham-hit-with-10-point-penalty-for-maddinson039s-oversized-bat","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - County Championship side Durham were left to rue a batting mishap on Thursday, however it was not a sloppy shot that cost them dear but the size of Nic Maddinson's willow, resulting in a 10-point deduction. Read full story","content":null,"pubDate":"2022-09-29 14:52:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"What happened to Naseem Shah: Naseem Shah Twitter post hints recovery post brief hospitalisation","link":"https://thesportsrush.com/cricket-news-what-happened-to-naseem-shah-naseem-shah-twitter-post-hints-recovery-post-brief-hospitalisation/","keywords":["Cricket","England tour of Pakistan 2022","ICC T20 World Cup 2022","Naseem Shah","New Zealand T20I Tri-Series","Pakistan"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Naseem Shah Twitter post hints recovery: The Pakistani fast bowler had to be hospitalised for a night yesterday. Pakistan fast bowler Naseem Shah has tested positive for COVID-19 a day after being diagnosed with pneumonia. Shah, who has played only one out of five T20Is against England, appears set to miss the remaining two matches… The post What happened to Naseem Shah: Naseem Shah Twitter post hints recovery post brief hospitalisation appeared first on The SportsRush.","content":"Pakistan fast bowler Naseem Shah has tested positive for COVID-19 a day after being diagnosed with pneumonia. Shah, who has played only one out of five T20Is against England, appears set to miss the remaining two matches of the ongoing series as well. With Pakistan set to leave for New Zealand on October 3, Shah has become an instant uncertainty for what would’ve seen him play his first white-ball match in New Zealand. For the unversed, Pakistan will be playing a triangular series involving Bangladesh in New Zealand as an ideal preparation for ICC T20 World Cup 2022. Despite PCB (Pakistan Cricket Board) insisting on Shah’s wellness, the 19-year old bowler had to spend last night in a hospital before getting a discharge this morning. Already monitoring progress with respect to fast bowler Shaheen Shah Afridi’s fitness after suffering a , PCB has another premium pacer to take care of and hope for optimum recovery before the World Cup. With a lot going on regarding his health in the last 24 hours or so, Shah took to social media platform Twitter to assure fans about his well-being and thanked them for their well wishes. “Alhamdulillah, I am feeling better and recovering well. Thank you for keeping me in your prayers!,” read a part of Shah’s tweet. Alhamdulillah, I am feeling better and recovering well. Thank you for keeping me in your prayers! May Allah protect us all. Duaon main yaad rakhaye ga! See you all very soon! — Naseem Shah (@iNaseemShah) Having played a total of six T20Is since his debut just over a month ago, Shah is a vital cog in the wheel as far as Pakistan’s World Cup squad is concerned. A genuine wicket-taker likely to do well down under, Pakistani fans would be sincerely hoping for Shah to recover well in time for the showpiece event next month.","pubDate":"2022-09-29 14:31:13","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Durham docked 10 County Championship points for Nic Maddinson using over-sized bat","link":"https://www.dailymail.co.uk/sport/cricket/article-11262645/Durham-docked-10-County-Championship-points-Nic-Maddinson-using-sized-bat-vs-Derbyshire.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Maddinson had scored a single run on the second day of the match at Derby when umpire Hassan Adnan halted play, concerned the bat's measurements exceeded cricket's regulations.","content":null,"pubDate":"2022-09-29 14:26:45","image_url":"https://i.dailymail.co.uk/1s/2022/09/29/15/62930089-0-image-a-9_1664461126342.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"‘Cricket fans will be delighted’: Former Test captain Tim Paine makes return to sport","link":"https://www.cairnspost.com.au/sport/cricket-fans-will-be-delighted-former-test-captain-tim-paine-makes-return-to-sport/video/4ac00700ecd7bf0f11f68d749c2b4486","keywords":["National","Sport news and galleries"],"creator":null,"video_url":null,"description":"Menzies Research Centre’s Nick Cater says it is “good to see” Tim Paine return to cricket after a year’s absence. The Mercury newspaper is reporting former Australian Test captain Tim Paine will re-enter cricket in the one-day Cricket Tasmania Premier League match between the University of Tasmania and New Town on Sunday. “He’ll get a really big welcome on the pitch down there in Tasmania I’m sure,” he told Sky News host Jenna Clarke. “Cricket fans will be delighted to see him back in action.”","content":null,"pubDate":"2022-09-29 13:56:42","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"“First of many I hope for you bud”: Dale Steyn hopes Arshdeep Singh wins more Man of the Match awards for India","link":"https://thesportsrush.com/cricket-news-first-of-many-i-hope-for-you-bud-dale-steyn-hopes-arshdeep-singh-wins-more-man-of-the-match-awards-for-india/","keywords":["Cricket","Arshdeep Singh","Dale Steyn","India","South Africa","South Africa tour of India 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Dale Steyn hopes Arshdeep Singh: The former South Indian fast bowler wishes best for the rookie Indian fast bowler. Playing only his 12th T20I, India fast bowler Arshdeep Singh bagged a maiden Player of the Match award in the recently concluded first India vs South Africa T20I in Thiruvananthapuram last night. Having opened the bowling… The post “First of many I hope for you bud”: Dale Steyn hopes Arshdeep Singh wins more Man of the Match awards for India appeared first on The SportsRush.","content":"Dale Steyn hopes Arshdeep Singh: The former South Indian fast bowler wishes best for the rookie Indian fast bowler. Playing only his 12th T20I, India fast bowler Arshdeep Singh bagged a maiden Player of the Match award in the recently concluded first India vs South Africa T20I in Thiruvananthapuram last night. Having opened the bowling with Deepak Chahar, Singh picked bowling figures of 4-0-32-3 to emerge as the pick of the Indian bowlers on a Greenfield International Stadium pitch which was highly supportive of bowlers. Singh, who bowled his quota of 24 balls yesterday, was declared the Player of the Match for his performance in the first six balls. Known more for his death-over skills than his skills with a new ball, Singh put on display a lesser known aspect of his bowling to add another dimension to his arsenal. ALSO READ: KL Rahul adulates Arshdeep Singh for his magnificent spell in Thiruvananthapuram T20I While South Africa wicket-keeper batter Quinton de Kock played on a Singh delivery to his stumps, two more left-handed batters namely Rilee Rossouw and David Miller were dismissed in the same over. Singh, who managed to induce the outside edge of Rossouw’s bat, bowled a brilliant in-swinging delivery to castle Miller’s stumps. Dale Steyn hopes Arshdeep Singh wins more Man of the Match awards for India Former South Africa fast bowler Dale Steyn took to social media platform Twitter to wish well for Singh. In his tweet, Steyn said that he wishes more such awards for Singh in the future. This is awesome! First of many I hope for you bud! https://t.co/KYAuzWkW6y — Dale Steyn (@DaleSteyn62) September 29, 2022 With India losing out on the services of fast bowler Jasprit Bumrah for ICC T20 World Cup 2022, the onus has increased all the more on Singh as one of India’s designated death-overs specialists. Going to play international cricket in Australia for the first time, Singh has a golden chance of proving his mettle during the course of a world event. The post “First of many I hope for you bud”: Dale Steyn hopes Arshdeep Singh wins more Man of the Match awards for India appeared first on The SportsRush.","pubDate":"2022-09-29 13:04:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“El VAR mata el fútbol”: la duras críticas de Thierry Henry a puertas del Mundial","link":"https://depor.com/mundial-x-depor/thierry-henry-critica-al-var-a-puerta-del-mundial-qatar-2022-fifa-videoarbitraje-noticia/","keywords":null,"creator":["Redacción Depor"],"video_url":null,"description":"El consagrado exjugador francés no se guardó nada al opinar del videoarbitraje, asegurando que esta herramienta es lenta y echa a perder el espíritu natural del fútbol.","content":"Fuerte y claro. La estrella francesa Thierry Henry cuestionó seriamente el VAR (videoasistencia al arbitraje) durante los partidos de fútbol, a solo unas semanas del Mundial Qatar 2022 , asegurando que su uso lleva mucho tiempo, aumenta las controversias y “mata la alegría del juego”. Preguntado por ello en la Leaders Week Sport Business, que reúne a más de 3.000 altos dirigentes del deporte esta semana en Londres, ‘Titi’ precisó que no tenía nada en contra de la tecnología en general, pero que le contrariaba la pérdida de tiempo durante los visionados, en comparación con otros deportes. El exfutbolista de 45 años estima además que el VAR crea nuevas polémicas sobre las decisiones arbitrales en lugar de reducirlas. “En el fútbol siempre vamos con retraso. Tenemos mucho que aprender. Lo que puedo ver en el football americano, el rugby, el cricket, el tenis, es que (las decisiones) son instantáneas”, explicó. En otro momento señaló que “lo que me fastidia del VAR es que no es lo suficientemente rápido. Luego, se trata siempre de la decisión de alguien que se encuenta en un camión o en otra parte, no es el VAR el que decide”. “Después de haber marcado, ni siquiera sabes si tienes que saltar de alegría. ¿Salto? ¿Celebro? ¿No celebro? Eso mata la alegría del juego”, lamentó. Como se recuerda, Thierry Henry es ahora comentarista de televisión y entrenador adjunto en la selección de Bélgica. Y en cada transmisión en la que aparece no duda en cuestionar abiertamente la utilización del VAR. No solo el VAR: Qatar 2022 tendrá el ‘offside’ automático Una nueva implementación llegará a la Copa del Mundo Qatar 2022: la FIFA anunció que contará con un aplicativo semiautomatizada para dictaminar las jugadas de offside. A través de sus canales oficiales, el máximo ente rector del fútbol mundial dio a conocer detalles de este singular método, que incluye más cámaras, sistema de detección en el balón e imágenes en tercera dimensión (3D). Este novedoso procedimiento ayudará al cuerpo arbitral del VAR, para tener más claridad en las decisiones. De acuerdo al comunicado de la FIFA, habrán 12 artefactos de video bajo la cubierta del estadio que “captan los movimientos de la pelota y hasta 29 puntos de datos de cada jugador, 50 veces por segundo, para calcular sus posiciones exactas sobre el terreno de juego”. Además, los “29 grupos de datos recopilados incluyen las extremidades y partes del cuerpo del deportista que se tienen en cuenta para señalar un fuera de juego”.","pubDate":"2022-09-29 12:38:06","image_url":"https://depor.com/resizer/wBT6SnXlN8xrCuJmaR-TOBBzHKI=/cloudfront-us-east-1.images.arcpublishing.com/elcomercio/4Q3BYPYOFNG5VGDNLQHFE5OYOQ.webp","source_id":"depor","country":["colombia"],"category":["sports"],"language":"spanish"},{"title":"Legends League Cricket Final To Be Played In Jaipur","link":"https://sports.ndtv.com/cricket/legends-league-cricket-final-to-be-played-in-jaipur-3388990","keywords":["Cricket"],"creator":["ANI"],"video_url":null,"description":"The final match of the Legends League Cricket 2022, which is being held in India for the first time, will be played at the Sawai Mansingh Stadium in Jaipur on October 5","content":"The final match of the Legends League Cricket 2022, which is being held in India for the first time, will be played at the Sawai Mansingh Stadium in Jaipur on October 5. Jodhpur to host both, qualifier and eliminator matches. Raman Raheja, co-founder and CEO of Legends League Cricket, said that Jaipur was chosen as the venue for the big match keeping in mind the historical relevance of the ground and the city, which has witnessed world-class cricket being played in the past. \"It is a great stadium and we hope the fans will thoroughly enjoy the experience of seeing the legends of the game competing for the winners' trophy. As we have seen, the league has been as competitive as the best of the T20 leagues around the world and the players, be it the bowlers or the batters, have been enthralling everyone with their outstanding performances. We have seen tense finishes in the league stage and expect the final to be no less,\" Raheja added. The Barkatullah Khan Stadium in Jodhpur, which will witness international cricketing stars for the first time after 2012, will be hosting four matches including the qualifier and eliminator matches. The qualifier will be played on October 2 wherein Top-2 two teams from league stage will clash for a place in the final. However, the Eliminator game, on October 3, will be contested between the third-placed team and the loser of the qualifier. Promoted The organisers had first zeroed in on Cuttack for the all-important clash, but the festivities in the city around that time have resulted in changing their decision.","pubDate":"2022-09-29 12:19:25","image_url":"https://c.ndtvimg.com/2021-04/i2kk6sfo_sawai-mansingh-stadium-rr-jersey-launch-twitter_650x400_05_April_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"\"MCG My Home Ground\": Pakistan Pacer Warns India Ahead Of Clash At T20 WC","link":"https://sports.ndtv.com/cricket/mcg-my-home-ground-pakistan-pacer-warns-india-ahead-of-clash-at-t20-world-cup-3388831","keywords":["Cricket"],"creator":["PTI"],"video_url":null,"description":"Pakistan pacer Haris Rauf is banking on his knowledge gained from the Big Bash League to outsmart Indian batters in the marquee clash of the T20 World Cup at the Melbourne Cricket Ground on October 23","content":"Pakistan pacer Haris Rauf is banking on his knowledge gained from the Big Bash League to outsmart Indian batters in the marquee clash of the T20 World Cup at the Melbourne Cricket Ground on October 23. The arch-rivals, who don't play bilateral series due to geo-political tensions, will clash for a fourth a time in one year at the MCG. \"If I give my best, they won't be able to play me easily. For the upcoming World Cup match, I'm very happy because it is at the Melbourne Cricket Ground,\" Rauf, who plays for Melbourne Stars in the BBL, said in the post-match interaction after their six-run win over England. \"It is my home ground because I play for the Melbourne Stars, and I have an idea of how the conditions play out there. I've already started planning on how I would bowl against India,\" he said. Pakistan took a 3-2 series lead in the seven-match T20I series here on Wednesday. Pakistan defeated India by 10 wickets -- for the first time in a world tournament -- in the last edition of the T20I World Cup in UAE. But recently in the Asia Cup, India secured a clinical five-wicket win before losing to Pakistan in the 'Super 4' stage. Promoted The 28-year-old fed the Indian batters with short-pitch deliveries as he returned wicketless in their first match of the Asia Cup. But in the Super 4 stage, he accounted for the key wicket of India skipper Rohit Sharma. The 28-year-old ended the Asia Cup with eight wickets from six matches. But in the ongoing series he's been at his best, leading the tally with eight wickets from five matches. \"The match between India and Pakistan is always a high-pressure game. In the World Cup last year, I was feeling so much pressure. But in the past two matches in the Asia Cup, I didn't feel much of it because I knew I just had to give my best,\" Rauf added.","pubDate":"2022-09-29 11:42:38","image_url":"https://c.ndtvimg.com/2022-09/tlajnpt8_haris-rauf_625x300_11_September_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Breaking I Naseem Shah test positive for Covid-19, ruled out of England series","link":"https://www.indiatvnews.com/sports/cricket/naseem-shah-test-positive-for-covid-19-ruled-out-of-england-series-naseem-shah-ruled-out-of-england-series-2022-09-29-812410","keywords":null,"creator":null,"video_url":null,"description":"ENG vs PAK: Pakistan fast bowler Naseem Shah has tested positive for Covid-19 and has been ruled out of the remaining matches against England, Pakistan Cricket Board said on Thursday. Shah was discharged from the hospital on Thursday after he suffered pneumonia.","content":null,"pubDate":"2022-09-29 11:30:29","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"“All the best for your date”: Amit Mishra sends INR 500 to fan for a date with girlfriend","link":"https://thesportsrush.com/cricket-news-all-the-best-for-your-date-amit-mishra-sends-inr-500-to-fan-for-a-date-with-girlfriend/","keywords":["Cricket","Amit Mishra"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Leg-spinner Amit Mishra recently surprised a fan by sending him Rs 500 via UPI for a date with his girlfriend. The veterans of the cricketing world are playing in the Legends League Cricket 2022 in India. In the first semi-final of the match, India Legends are up against Australia Legends. The match was halted by… The post “All the best for your date”: Amit Mishra sends INR 500 to fan for a date with girlfriend appeared first on The SportsRush.","content":"The veterans of the cricketing world are playing in the Legends League Cricket 2022 in India. In the first semi-final of the match, India Legends are up against Australia Legends. The match was halted by the rain on Wednesday, so the match continued from the same stage on Thursday. During the match, Suresh Raina once again proved his fielding masterclass. In the 16th over of the Australian innings, Abhimanyu Mithun was bowling for India, and Ben Dunk was at the striker’s end. Dunk tried to slice the ball towards the backward point, but Raina was all in readiness, and he took a brilliant acrobatic catch. Raina has been famous for his fielding, and he was one of the best fielders in the Indian setup. Even in the IPL, he had some brilliant moments in the field with Chennai Super Kings. Amit Mishra recently made a tweet about Suresh Raina’s fielding during the Legends League Cricket 2022 match between India Legends and Australia Legends. On his tweet, one guy asked Mishra to send some money via UPI so that he can take his girlfriend for a date. You can read about the here. Mishra also did not disappoint the fan and sent him Rs 500 via UPI, and he shared a screenshot about the same as well. “Done, all the best for your date,” Amit Mishra tweeted after sending the money. Done, all the best for your date. 😅 — Amit Mishra (@MishiAmit) Mishra has to be one of the most underrated spinners to play for India. The leg-spinner impressed in both red-ball and white-ball formats. He scalped 76 test wickets in 22 games at an average of 35.72, whereas he also scalped 64 ODI and 16 T20I wickets. In FC cricket, he has 535 wickets under his belt. The leg-spinner also did superbly well in the IPL, and he is the 3rd highest wicket-taker in the history of the Indian Premier League. He has scalped 166 wickets in 154 IPL games, and he is just behind Lasith Malinga and DJ Bravo on the list. Mishra has played for Delhi Capitals, Sunrisers Hyderabad and Deccan Chargers in the history of the competition.","pubDate":"2022-09-29 11:26:05","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Snooker star Mark Allen sheds FOUR STONE in stunning five-month body transformation after diet and change of booze","link":"https://www.thesun.co.uk/sport/19955683/snooker-mark-allen-body-transformation/","keywords":["Other Sports","Sport","diet","Snooker","Weight Loss"],"creator":["Rob Maul"],"video_url":null,"description":null,"content":"SLIMLINE Mark Allen has shed FOUR stone in five months after being warned he might not be around to walk his daughter down the aisle one day. The Pistol weighed 19 stone when he lost to Ronnie O’Sullivan in the second round of the World Snooker Championship in April. The snooker star looks in impressive shapeRex PacemakerMark Allen in action last year[/caption] A conversation with the Rocket sparked a major lifestyle overhaul in mid May, which saw him ditch the booze, eat healthily and cut back on big portions. Another discussion with a close pal also shook him up because he was told if he carried on this destructive path he would find himself in an early grave. Allen, 36, is now just over 14 stone and he said: “I’m happier in my appearance. I don’t want to do bad things to myself when I look in the mirror. “I need to lose more weight. I’m not fighting fit yet. READ MORE IN SNOOKER WEIGHT ABUSE Snooker ace Murphy removes 80% of stomach via surgery after online bullying BREAK WIND Hilarious moment Ronnie O'Sullivan has ref in stitches with embarrassing act “Before I started my diet, I was 19.1 stone which is really embarrassing to say for someone of my height and age. I’m now 14 stone 10 pounds. “I have cut out all the fun stuff. Even if I do eat bad food, I eat so little of it. I try to cut out carbs as much as possible. Stick to stuff high in protein and fat. “It has been hard work but I have been disciplined. I haven’t gone cold turkey like with previous diets. “I only drank shorts when I went out drinking. Not massive calories. I’m not a massive drinker anyway. So I don’t particularly miss it. Most read in Other Sports DART ATTACK Watch darts star almost pin opponent to board as he nearly hits rival's hand BASKETBRAWL Watch basketball interview get interrupted by all-out FIGHT between team-mates STAR CUFFED Cricket legend hospitalised after arrest for 'breaching bail at woman's home' HEART OF GOLD Aussie rules hero lifts club's water boy from crowd after grand final win PITCH PERFECT Watch busty Paige Spiranac wow crowd as she makes first pitch at Yankees game LAWN STAR Watch bowls ace rip off his top and jump into crowd after Commonwealth gold CASINO SPECIAL – BEST NEW CUSTOMER SIGN UP DEALS “One of my very closest friends said to me: ‘If you keep going the way you’re going Mark, you won’t be here to walk Harleigh down the aisle.’ That was tough to hear but probably what I needed to hear.” Allen scored a 133 break as he beat China’s Li Hang 4-1 in the British Open second round yesterday. His escape in the opening frame — he required FIVE cushions to hit the yellow — became a popular hit on social media and was described by the player as “probably one of the best ever shots I have ever played”. The Northern Ireland star says he has had to change his cue action because he does not have a big belly in the way anymore. I’m so used to going round my belly. Now I’m on a straighter path Mark Allen He said: “I’m having to adapt on the table. It’s probably not perceptive to those watching from the sides. But I can feel it myself. “I’m not quite comfortable in my cueing yet as I have cueing on a different path. “I’m so used to going round my belly. Now I’m on a straighter path. It affects your alignment and aim. It has taken time.” Judd Trump looks like the man to beat in Milton Keynes this week as he crushed Scotland’s Dean Young 4-0. PAA conversation with Ronnie O’Sullivan helped inspire Allen[/caption] Getty - ContributorThe Pistol has had to change his stance over the table[/caption]","pubDate":"2022-09-29 11:24:40","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"IND-L vs AUS-L LIVE: Naman Ojha going strong: Follow RSWS 2022 LIVE - InsideSport","link":"https://news.google.com/__i/rss/rd/articles/CBMi2wFodHRwczovL3d3dy5pbnNpZGVzcG9ydC5pbi9pbmQtbC12cy1hdXMtbC1kcmVhbTExLXByZWRpY3Rpb24taW5kaWEtbGVnZW5kcy12cy1hdXN0cmFsaWEtbGVnZW5kcy10b3AtZmFudGFzeS1waWNrcy1wcm9iYWJsZS1wbGF5aW5nLXhpcy1waXRjaC1yZXBvcnQtbWF0Y2gtb3ZlcnZpZXctaW5kLWwtdnMtYXVzLWwtbGl2ZS1zdHJlYW1pbmctYXQtNzMwLXBtLWZvbGxvdy1yc3dzLTIwMi_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND-L vs AUS-L LIVE: Naman Ojha going strong: Follow RSWS 2022 LIVE  InsideSportIndia Legends vs Australia Legends Live Cricket Score RSWS T20 Semifinal: Yuvraj Falls After Ojha Hits Quic  News18India Legends vs Australia Legends Live Score: IND L pegged back as Sachin falls  Hindustan TimesRoad Safety World Series 2022 Live, Points Table, Final Schedule, Today Match, Live Score, Winner, Live Streaming, Table, Match List, Live Telecast In India, Squads, Tickets, And Venues  Cricket AddictorIND-L vs AUS-L Live Score Semifinal Updates Road Safety World Series 2022 India Legends vs Australia Legends Live Streaming Info  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-09-29 11:22:16","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"County cricket final day: Warwickshire v Hampshire, Worcs v Middlesex – live","link":"https://www.theguardian.com/sport/live/2022/sep/29/warwickshire-hampshire-and-more-county-cricket-seasons-final-day-live","keywords":["County Championship","Cricket","County Championship Division One","County Championship Division Two","Sport"],"creator":["Tanya Aldred"],"video_url":null,"description":"County cricket 2022 awards | Sign up for The SpinEmail Tanya, tweet @tjaldred, or comment BTLEssex ending the season in *style – bowled out for 107, 59, 263 and now 89 for nine. Jack White six for 27 to keep his cockles warm as the night closes in. Essex lead Northants by 189.Great stuff in his farewell innings. Wishing him much luck at Surrey, where presumably he slots in to replace Hashim Amla. And Surrey will have two ex-England openers at their disposal. We were talking at Headingley yesterday about how a “Sibley” is exactly what Yorkshire need in their batting line up – a good experienced player, who will average 40, and is not likely to be called up for England – a Northeast or a Duckett or a Has. Or a Tom Bailey with the ball. Continue reading...","content":null,"pubDate":"2022-09-29 11:19:53","image_url":"https://i.guim.co.uk/img/media/dc598ca11594112653d9e1cd8ab51b26ea36b8cd/0_145_3500_2100/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=ba5ef92d9db95ce9a7edd4c42503b6ea","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"T20 WC | Next setback for India: Bumrah likely to withdraw due to injury","link":"https://thenewsglory.com/t20-wc-next-setback-for-india-bumrah-likely-to-withdraw-due-to-injury/","keywords":["Sports","Bumrah","Cricket","game","India","T20 WC","T20 World Cup."],"creator":["The News Glory"],"video_url":null,"description":"Jasprit Bumrah, the Indian fast bowler, is doubtful to play in the upcoming T20 World Cup. It is said that he will withdraw from the series due to a back injury. Bumrah has played 30 Tests, 72 ODIs and 60 T20Is for the Indian cricket team. The 28-year-old has taken a total of 319 wickets. […]","content":"Jasprit Bumrah, the Indian fast bowler, is doubtful to play in the upcoming T20 World Cup. It is said that he will withdraw from the series due to a back injury. Bumrah has played 30 Tests, 72 ODIs and 60 T20Is for the Indian cricket team. The 28-year-old has taken a total of 319 wickets. He has played 120 matches in IPL cricket. Batsmen of international cricket teams will struggle to face his yorker. He bowled such a delivery to Australia’s captain Aaron Finches in the recently concluded T20 series against Australia. In this case, it seems that the cause is a stress fracture in his back. However, BCCI sources say that he will take up to six months to recover from this injury. So it seems that he will not participate in the T20 World Cup which is going to start in Australia in the next few days. The Board of Control for Cricket in India has to make an official announcement in this regard. India’s all-rounder Jadeja has been ruled out of the T20 World Cup due to injury. In this case, Bumrah’s withdrawal will be a big setback for the Indian team.","pubDate":"2022-09-29 11:18:11","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah to miss the T20 World Cup in Australia due to stress fracture, can be out of action for months","link":"https://www.opindia.com/2022/09/jasprit-bumrah-to-miss-t20-world-cup-2022-due-to-stress-fracture/","keywords":["Cricket","News Reports","bumrah","Bumrah Indian pacer","Jasprit Bumrah","T20 World Cup","Team India","team india in world cup"],"creator":["OpIndia Staff"],"video_url":null,"description":"Though there is no need of surgery, Jasprit Bumrah will have to stay away from cricket for at least 4 to 6 months to recover from the injury.","content":"Jasprit Bumrah, Team India’s star bowler, has been ruled out of the T20 World Cup 2022 owing to a stress fracture. This can be devastating for the Indian cricket team as Jasprit Bumrah is the leading bowler in India’s pace attack. A BCCI official told PTI that Bumrah has a stress fracture and he could be out of the cricket field for months. “Bumrah is not going to play the World T20 for sure. He has a serious back condition. It’s a stress fracture and he could be out for a period of six months,” a senior BCCI official told the news agency. BCCI had informed about Jasprit Bumrah’s injury yesterday, saying that he was not playing the first T20 match against visiting South African team. While there won’t be a need for surgery, Bumrah’s recovery from the wound is anticipated to take 4-6 months. UPDATE Jasprit Bumrah complained of back pain during India’s practice session on Tuesday. The BCCI Medical Team assessed him. He is ruled out of the first #INDvSA T20I.#TeamIndia— BCCI (@BCCI) September 28, 2022 On 28th September 2022, BCCI tweeted, “Jasprit Bumrah complained of back pain in during India’s practice session on Tuesday. The BCCI Medical Team assessed him. He is ruled out of the first India versus South Africa T20I.” Due to the injury, Jasprit Bumrah has been eliminated from the entire series, where India and South Africa will play 3 T20 and 3 one day matches. According to reports, he did not go with the squad to Thiruvananthapuram for the opening T20I between South Africa and India. This is the second consecutive ICC tournament Jasprit Bumrah is missing because of an injury. Due to a back ailment, Bumrah already missed the whole Asia Cup 2022. He recuperated for almost a month at the National Cricket Academy in Bengaluru. After that, he was selected to participate in the T20 series against Australia. He participated in the final two games but missed the first T20I at Mohali. According to a report by The Indian Express, a BCCI official said, “We have been told that his injury is not good and at the moment and it looks like he won’t be travelling to Australia with the Indian team. The medical team will submit a detailed report soon.” The senior national selection committee will have to choose between Mohammad Shami or Deepak Chahar, added as standby players for the T20 World Cup to be played in Australia next month as Jasprit Bumrah is unavailable. The T20 World cup starts on 16th October, but India’s first match is scheduled on October 23rd, against Pakistan in Melbourne.","pubDate":"2022-09-29 10:32:42","image_url":null,"source_id":"opindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Indian girls dream big as U-17 Soccer World Cup arrives in the country","link":"https://www.laprensalatina.com/indian-girls-dream-big-as-u-17-soccer-world-cup-arrives-in-the-country/","keywords":["Sports","EFE","INDIA SOCCER"],"creator":["Online News Editor"],"video_url":null,"description":"By Mikaela Viqueira New Delhi, Sep 29 (EFE).- As India gets ready to host the Under-17 Women’s Soccer World Cup in October, the event has energized young girls who hope to represent the country in future. India’s participation in the world cup as the host marks the first time the team is playing in the … The post Indian girls dream big as U-17 Soccer World Cup arrives in the country appeared first on La Prensa Latina Media.","content":"By Mikaela Viqueira New Delhi, Sep 29 (EFE).- As India gets ready to host the Under-17 Women’s Soccer World Cup in October, the event has energized young girls who hope to represent the country in future. India’s participation in the world cup as the host marks the first time the team is playing in the competition, and has brought more women to the playing field, apart from giving better visibility to a sport that has sought to charm a cricket-crazy nations in recent years. “There is lack of knowledge among people that there is regular women’s football in the country, (…) that there are state leagues,” sports journalist Abreshmina Quadri told EFE. “Hosting a tournament as big as a world dup (…) creates some sort of awareness and people get to know more about the players who would at least be representing the country,” she added. Even though there is a national women’s league and at the world level, women have got their own ballon d’or since 2018, the world cup could become the biggest channel to popularize the women’s game in India like never before, with several new clubs scouting for talent in recent months. Clubs such as Sudeva Delhi FC have tried to use the event’s attraction to establish a training academy for young girls eager to give their everything for the dream of playing for India one day. The U-17 World Cup “is really helping getting more girls who are younger into the game, as they all want to try and give trials for the national team” and become more serious in their training, Sudeva coach Disha Malhotra told EFE. The 24 trainees for the team play at a sports facility in the northern part of the Indian capital, living together in a hostel round-the-clock, which has helped communication and bonding both inside and outside the field. “We are playing together, and now we are increasing our power” to be able to win the league, club captain Sanya Rawat told EFE. Women’s soccer in India has seen a major transformation from a decade ago – when Malhotra was an active player – as the sport earlier suffered from the lack of opportunities and awareness, with even women referees being a rarity. While Malhotra had to force her friends to play with her during their free time, Rawat has had it much easier: she was selected for her school team, and was helped in honing her skills by a coach as she progressed through the ranks. “When I look back and see, the number of girls playing football has increased many times. When I went to school, my school did not even have a women’s team,” said Malhotra. In contrast, young players today like Sudeva vice-captain Harita, have been following the sports closely, even learning from their favorite global stars through videos available online. Harita,16, dreams big despite not being able to make the 21-member Indian team for the world cup, and hopes to play for world-famous clubs like FC Barcelona some day. Malhotra recalled the “enthusiasm and energy” that young Indian girls showed during the national selection trials for the world cup earlier this year. “I want to represent my country. I would love it if I get to play for India. This is everything I want, I want that logo of India on my jersey,” Rawat proclaimed with passion. EFE mvg/ia The post Indian girls dream big as U-17 Soccer World Cup arrives in the country appeared first on La Prensa Latina Media.","pubDate":"2022-09-29 10:32:01","image_url":null,"source_id":"laprensalatina","country":["cuba"],"category":["sports"],"language":"english"},{"title":"Bumrah out: Jasprit Bumrah ruled out of World Cup T20 2022 due to back stress fracture","link":"https://thesportsrush.com/cricket-news-bumrah-out-jasprit-bumrah-ruled-out-of-world-cup-t20-2022-due-to-back-stress-fracture/","keywords":["Cricket","ICC T20 World Cup 2022","India","Jasprit Bumrah"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Jasprit Bumrah ruled out: The Indian fast bowler won’t be traveling to Australia for a world event next month. India fast bowler Jasprit Bumrah has been ruled out of ICC T20 World Cup 2022 to be played in Australia next month to hand a massive blow to the team’s preparation for the World Cup. Leader… The post Bumrah out: Jasprit Bumrah ruled out of World Cup T20 2022 due to back stress fracture appeared first on The SportsRush.","content":"Jasprit Bumrah ruled out: The Indian fast bowler won’t be traveling to Australia for a world event next month. India fast bowler Jasprit Bumrah has been ruled out of ICC T20 World Cup 2022 to be played in Australia next month to hand a massive blow to the team’s preparation for the World Cup. Leader of their bowling attack irrespective of the conditions or format, Bumrah sitting out of a world event presents an unwanted major conundrum for the selection committee and team management. Bumrah, 28, hadn’t taken part in India vs South Africa first T20I in Thiruvananthapuram last night. “[Jasprit] Bumrah had a niggle in the morning. So, he misses out,” India captain Rohit Sharma had told Star Sports at the toss. BCCI had taken to their social media platform Twitter handle to share an update with respect to Bumrah’s absence from the match. “Jasprit Bumrah complained of back pain during India’s practice session on Tuesday. The BCCI Medical Team assessed him,” read BCCI’s tweet. Jasprit Bumrah ruled out of ICC T20 World Cup 2022 Although BCCI (Board of Control for Cricket in India) are yet to release an official update on the matter, the confirmed development is all over social media platforms become a source of dejection for fans. “[Jasprit] Bumrah is not going to play the World T20, for sure. He has a serious back condition. It’s a stress fracture and he could be out for a period of six months,” a senior BCCI official told PTI on conditions of anonymity. For the unversed, Bumrah was rested for white-balls tours of West Indies and Zimbabwe after his participation in an all-format tour of England this summer. The right-arm bowler had then missed Asia Cup 2022 due to a back injury. Expected to return to action in the first India vs Australia T20I in Mohali earlier this month, Bumrah had missed that match as well but returned for the next two matches to bowl a total of six overs. The post Bumrah out: Jasprit Bumrah ruled out of World Cup T20 2022 due to back stress fracture appeared first on The SportsRush.","pubDate":"2022-09-29 09:57:45","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“Rohan, I’ve seen an absolute superstar”: Rohan Gavaskar recalls Amol Mazumdar spotting Shubman Gill at the NCA, Bengaluru","link":"https://thesportsrush.com/cricket-news-rohan-ive-seen-an-absolute-superstar-rohan-gavaskar-recalls-amol-mazumdar-spotting-shubman-gill-at-the-nca-bengaluru/","keywords":["Cricket","Rohan Gavaskar","Shubhman Gill"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Rohan Gavaskar has recalled how Amol Mazumdar spotted Shubhman Gill at NCA in Bengaluru during his early days. The rise of Shubman Gill has been great in 2022. Gill has got some opportunities in ODI cricket this year, and he has taken those opportunities with both hands. He scored his first ODI century in the… The post “Rohan, I’ve seen an absolute superstar”: Rohan Gavaskar recalls Amol Mazumdar spotting Shubman Gill at the NCA, Bengaluru appeared first on The SportsRush.","content":"Rohan Gavaskar has recalled how Amol Mazumdar spotted Shubhman Gill at NCA in Bengaluru during his early days. The rise of Shubman Gill has been great in 2022. Gill has got some opportunities in ODI cricket this year, and he has taken those opportunities with both hands. He scored his first ODI century in the recent ODI series against Zimbabwe in Harare. Gill also scored his maiden County cricket century for Glamorgan against Sussex. The records of Gill is brilliant with both red and white ball. He as represented India in 11 tests and 9 ODIs, and he has not played a T20I for India. In domestics, Gill’s records speaks for himself. He has scored 3002 FC runs at 52.66, whereas he has 2763 List-A runs at 50.23. He is also expected to open with Shikhar Dhawan in the upcoming ODIs against South Africa. Rohan Gavaskar recalls Amol Mazumdar spotting Shubhman Gill Former Indian cricketer Rohan Gavaskar has recalled that it was Amol Mazumdar who said to him first that Shubman Gill will definitely play for India. Gavaskar said that Mazumdar used to coach him at the NCA. “It was Amol Mazumdar who first mentioned Shubman Gill to me before he had even broken through because Amol has seen him at the NCA, he was going and coaching at the NCA and he came to me and said ‘Rohan, I’ve seen an absolute superstar! He’s someone who is definitely going to play for India. I have no doubt about it’,” Rohan Gavaskar said on Sports18 show ‘Sports over the Top’ Gavaskar also said that Shubman Gill will be an all format player for India in the near future. The emergence of Gill in white-ball cricket has certainly bolstered, where he has been brilliant with the red ball in County as well. ALSO READ: Yuvraj Singh congratulates Shubman Gill on maiden ODI ton “He’s one of those who will be an all-format player. He’s showing that. He is more than capable of holding his own in white ball cricket'” Gavaskar added.           The post “Rohan, I’ve seen an absolute superstar”: Rohan Gavaskar recalls Amol Mazumdar spotting Shubman Gill at the NCA, Bengaluru appeared first on The SportsRush.","pubDate":"2022-09-29 09:49:00","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}