{"newsArray":[{"title":"LAWRENCE BOOTH: Ben Foakes’ impressive blitz shows that he fits the England revolution","link":"https://247newsaroundtheworld.com/sports/lawrence-booth-ben-foakes-impressive-blitz-shows-that-he-fits-the-england-revolution/","keywords":["Sports"],"creator":["247 News Around The World"],"video_url":null,"description":"247 News Around The World 247 News Around The World LAWRENCE BOOTH: Ben Foakes’ impressive blitz on the fourth morning against New… The post LAWRENCE BOOTH: Ben Foakes’ impressive blitz shows that he fits the England revolution appeared first on 247 News Around The World.","content":"LAWRENCE BOOTH: Ben Foakes’ impressive blitz on the fourth morning against New Zealand shows that he fits England’s red-ball revolution Ben Foakes demonstrated that he can still have a key part to play for England Ben Stokes went out of his way to praise Foakes after his impressive display Foakes reaffirmed his credentials behind the stumps and may be here to stay By Lawrence Booth for the Daily Mail Published: 15:17 EDT, 13 June 2022 | Updated: 16:27 EDT, 13 June 2022 If England’s new set-up still harboured any doubts about Ben Foakes’s role in the revolution, they ought to have been dispelled by the first 20 minutes of the fourth morning of this gripping second Test. When Foakes walked out to bat with 24 to his name, he might easily have sought out the slipstream of his partner, Joe Root. Instead, he timed Tim Southee’s second ball through extra cover, then — assisted by a misfield — did the same to the third. Ben Foakes’ performance showed that he deserves to be part of England’s revolution Three through midwicket helped make it 12 off the opening over, and England had immediately tapped into the madness of Sunday, when they made 383 runs — their most in a day’s play for more than a decade. Soon after, Foakes cut Southee for four more to complete his first Test fifty since his maiden series, in November 2018 in Sri Lanka. Back then, the thought that this Test might be only his 13th would have raised eyebrows. But circumstance got in the way: England hadn’t given up on Jonny Bairstow or Jos Buttler, and then came Covid and a freak dressing-room injury, when he tore a hamstring slipping in his socks. That ruled him out of last summer’s series against New Zealand, amid concerns that his chance had come and gone — especially when he had a quiet time on both sides of the stumps earlier this year in the Caribbean. Foakes reaffirmed his credentials behind the stumps – he makes the tricky look mundane But Ben Stokes made it clear to Brendon McCullum that Foakes was his preferred choice with the gloves, on the refreshingly simple grounds that he was the best wicketkeeper in the world. Doubt had arisen partly because Rob Key, England’s new director of cricket, has never hidden his admiration of Buttler. McCullum, too, used his first public appearance to suggest that Buttler could still translate his white-ball form into Test success. Then there was Bairstow. The easiest call would have been to hand him the gloves, creating room at No 5 for Harry Brook — the next batting cab off the rank. There were concerns Foakes’ chance had been and gone but he showed what he is capable of But Stokes’s preference for Foakes trumped all other considerations, and the new captain went out of his way to praise his wicketkeeper after his unbeaten 32 helped England win at Lord’s. Foakes called it ‘the best feeling I’ve had in cricket’. Stokes and McCullum were especially impressed at the way he had soaked up pressure on the third evening in that game. Next morning, they knocked off the remaining 61 runs without fuss. After Foakes’s struggles in the West Indies, where he averaged just 19, and a first-innings failure at Lord’s, an early reminder of why he averages 42 for Surrey was crucial for quieting the debate. Something similar happened on the third evening here in Nottingham. Replying to New Zealand’s mammoth 553, England had just lost Stokes for a raucous 46, and were 405 for five with only Foakes to come before their long tail. Ben Stokes went out of his way to praise Foakes after his unbeaten 32 against New Zealand Fortunate to survive a chance at deep square leg on nine, he helped take England to 473 for five at stumps — then cracked on on Monday until he was run out for 56 due to a poor call by Matt Potts. Foakes then set about reaffirming his credentials behind the stumps, not least when leaping high down the leg side to intercept short swinging deliveries from Potts. As with all the best wicketkeepers, he makes the tricky look mundane. Perhaps the biggest surprise of the day came when one ball wobbled late after passing the bat and rapped Foakes on the left thumb. He winced, removed his glove and shook his hand. It was a rare moment of inelegance from a player who may, at last, be here to stay. Advertisement Share or comment on this article: Post source: Daily mail Share on Social Media twitter facebook pinterest linkedin tumblr reddit whatsapp telegram","pubDate":"2022-06-13 20:38:59","image_url":null,"source_id":"247newsaroundtheworld","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Joe Root’s day four cameo shows he is a master craftsman at his pinnacle | Andy Bull","link":"https://www.theguardian.com/sport/2022/jun/13/joe-roots-day-four-cameo-shows-master-craftsman-at-pinnacle-second-test-new-zealand-cricket","keywords":["England v New Zealand 2022","England cricket team","New Zealand cricket team","Cricket","Sport"],"creator":["Andy Bull at Trent Bridge"],"video_url":null,"description":"He added just 13 runs to his overnight total in the second Test against New Zealand, but still displayed all his class“Now this is the life,” sighed the old man behind me in the Radcliffe Road stand. It cost £40 to get in on Monday, and you got a lot for the money, Jimmy Anderson’s 650th Test wicket, a back-of-the-hand run out by Ben Stokes, three different fifties, and best yet, a 20-minute stretch watching Joe Root finish his latest masterpiece innings. Root only made 13 runs on top of his 163 from the previous evening but if it was all you watched you would still have left happy. If the price seems steep for such a brief bit of cricket, I promise it was worth every penny and more for a glimpse of him in this sort of form.Right now Root is batting as well as any Englishman ever has, better, even, than he did last year when broke all England’s records and scored 1,708 runs and six Test centuries. You have to leaf back through an awful lot of copies of the Wisden Almanac to find the last time there was anything quite like it in English cricket, past Ian Bell reeling off three centuries in the 2013 Ashes, past Kevin Pietersen spraying switch hits and reverse sixes around the grounds in the 2007, past Michael Vaughan’s 900-run summer in 2002, and further still, past Graham Gooch’s 333 in 1990, and David Gower carving up Australia in the 1985 Ashes. Maybe just keep going all the way until you reach Denis Compton’s record-breaking year in 1948. Continue reading...","content":"“N ow this is the life,” sighed the old man behind me in the Radcliffe Road stand. It cost £40 to get in on Monday, and you got a lot for the money, Jimmy Anderson’s 650th Test wicket, a back-of-the-hand run out by Ben Stokes, three different fifties, and best yet, a 20-minute stretch watching Joe Root finish his latest masterpiece innings. Root only made 13 runs on top of his 163 from the previous evening but if it was all you watched you would still have left happy. If the price seems steep for such a brief bit of cricket, I promise it was worth every penny and more for a glimpse of him in this sort of form. Right now Root is batting as well as any Englishman ever has, better, even, than he did last year when broke all England’s records and scored 1,708 runs and six Test centuries. You have to leaf back through an awful lot of copies of the Wisden Almanac to find the last time there was anything quite like it in English cricket, past Ian Bell reeling off three centuries in the 2013 Ashes, past Kevin Pietersen spraying switch hits and reverse sixes around the grounds in the 2007, past Michael Vaughan’s 900-run summer in 2002, and further still, past Graham Gooch’s 333 in 1990, and David Gower carving up Australia in the 1985 Ashes. Maybe just keep going all the way until you reach Denis Compton’s record-breaking year in 1948. Potts pounces as England ratchet up second Test pressure on New Zealand Read more Root has reached that very rare stage in a sportsman’s life where he’s become such a master of his craft that he’s made the game his plaything. On Monday morning he decided, apparently on a whim, to hit a reverse ramp over the top of the slips for six off Tim Southee. “As current players we have the ability to rewrite the coaching manual,” Root said before the start of play. They really don’t. But he really does. Which isn’t to say some of the rest of them couldn’t play that same shot, but that they wouldn’t be able to thread it together with all the technically correct strokes he played either side, the crisp cover drives, clean leg glances, and impenetrable forward defensives. It’s his complete mastery of orthodox technique that allows him to improvise like this. It’s because he understands all the rules that he knows how to break them. Root’s so fluent at batting that he can do it any which way he chooses, he can play it as straight as Geoff Boycott or as silly as Jos Buttler. There is a real artistry to that, even, if you’ll allow it in a sportsman, a touch of genius. And if that seems like I’m straining then remember there aren’t enough words to capture the way he’s playing, any more than there are enough fielders to contain him. Joe Root reverse ramps a shot for six off Tim Southee. Photograph: Stu Forster/Getty Images It’s not just the runs, it’s the relish with which he’s going about it. It gets infectious. In the stands people laugh and cry and gasp and sigh, his own teammates end up grinning like idiots at him, and the old pros in the commentary box end up giggling like giddy little children. The only disappointed ones were those that came in just too late. “Noooo,” exhaled the man who slumped down beside me when he realised Root had just been caught at cover, fooled by a slower ball, while he was walking up to his seat. Root groaned too. You’ve never seen a man so furious at himself for making 170. The Spin: sign up and get our weekly cricket email. That’s how well he’s playing. Almost every innings a batsman plays ends in failure sooner or later, but Root’s in such touch that he still seemed surprised by it, and blamed himself for making a mistake, as if he knows that at the moment his own carelessness is the only thing that was ever going to get the better of him. The good news for him, and everyone else, is that the way the game’s heading there’s a good chance Root will be back out there again on Tuesday, when it’s free entry. If he does bat then everyone who turns up will always be able to say they were there, and had a little share in his summer, which will be talked about for as long as they’re playing the game. There are five Tests left this season, and one more innings in this one, so he maybe has 11 left to play. Go. Who knows how long the streak will go on. But wherever else you might head this summer, whether it’s Wimbledon for the tennis, St Andrews for the golf, or Birmingham for the Commonwealth Games, you won’t see another athlete who is so close to the pinnacle of their sport. Root is right out there now, on the very furthest reaches of brilliance.","pubDate":"2022-06-13 20:00:26","image_url":"https://i.guim.co.uk/img/media/99f297ad99e1259a844ef44aaf51540cf7711050/0_96_5670_3402/master/5670.jpg?width=460&quality=85&auto=format&fit=max&s=928b8012d93844e35d773162d57a65f8","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"DOMINICA TO HOST WEST INDIES v BANGLADESH T20I CRICKET ON JULY 2nd and 3rd, 2022","link":"https://www.prnewswire.com:443/news-releases/dominica-to-host-west-indies-v-bangladesh-t20i-cricket-on-july-2nd-and-3rd-2022-301566887.html","keywords":["General Sports","Sporting Events","SPT","SSE"],"creator":null,"video_url":null,"description":"ROSEAU, Dominica, June 13, 2022 /PRNewswire/ -- Dominica is delighted to announce the return of International Cricket at the Windsor Park Sports Stadium for the first time since May 2017, with two back-to-back games starting next month scheduled for July 2nd and 3rd, 2022. The Windsor...","content":"ROSEAU, Dominica , June 13, 2022 /PRNewswire/ -- Dominica is delighted to announce the return of International Cricket at the Windsor Park Sports Stadium for the first time since May 2017 , with two back-to-back games starting next month scheduled for July 2 nd and 3 rd , 2022. ROSEAU, DOMINICA - JUNE 04: A general view of play during day two of the First Test match between Australia and the West Indies at Windsor Park on June 4, 2015 in Roseau, Dominica. (Photo by Ryan Pierse/Getty Images) The Windsor Park Sports Stadium in Roseau, Dominica will officially be one of the T20I venues for the Bangladesh tour of the West Indies. The full schedule for both games is now confirmed with both matches featuring Bangladesh vs West Indies. Dominica has hosted four international cricket matches at the Windsor Park Sports Stadium, the first ODI West Indies vs Bangladesh in July 2009 , followed by a second ODI, West Indies vs South Africa in May 2010 , the first T20I West Indies vs New Zealand in July 2014 and the last being a Test Match, West Indies v Pakistan from May 10-14, 2017 . Director of Tourism, Colin Piper , \"The Discover Dominica Authority would like to express its gratitude to Cricket West Indies and the Government of the Commonwealth of Dominica for their efforts and assistance in bringing international cricket back to Dominica after a five-year absence. We are convinced that the two T20I matches in Dominica on July 2nd and 3rd will be fantastic, and we expect a strong turnout of local, regional, and international cricket fans to enjoy the fixtures.\" Cricket West Indies, Events Management Executive, Ms. Joneé Charles said \"The return of T20I games to Dominica is fantastic. We are delighted that Dominica has been chosen to host these two matches, and we hope to host more in the future. After a challenging two years owing to the pandemic, we must express our gratitude to the local organizing committee and Cricket West Indies for staging these T20I matches.\" In the following days, a full announcement on entry protocols and ticketing information for the Windsor Park Sports Stadium experience will be made. In the interim, Cricket fans and patrons can expect a 'Carnival-like' atmosphere with various local Dominican cultural presentations and an 'after party' experience. For more information on Dominica , contact Discover Dominica Authority at +1 767 448 2045. Or, visit Dominica's official website: www.DiscoverDominica.com , follow Dominica on Instagram and Facebook and take a look at our videos on YouTube SOURCE Discover Dominica Authority","pubDate":"2022-06-13 19:49:00","image_url":"https://mma.prnewswire.com/media/1838462/Dominica_Windsor_Park_Sports_Stadium.jpg?p=original","source_id":"cision","country":["singapore"],"category":["sports"],"language":"english"},{"title":"IPL TV rights sold for whopping Rs 23,575 crore","link":"https://www.thehansindia.com/sports/ipl-tv-rights-sold-for-whopping-rs-23575-crore-748490","keywords":["Sports,Today NewsPaper"],"creator":["The Hans India"],"video_url":null,"description":"Digital for `20,500 cr for the 2023-2027 cycle","content":"Mumbai: The frantic bidding process to secure IPL media rights for the 2023-2027 cycle has come to an end, with the television rights being sold for a whopping Rs 57.5 crore (per match) and digital for Rs 50 crore (per match).The final count for the TV rights stands at Rs 23,575 crore, while the digital rights closed at Rs 20,500 crore. The names of the winners are yet to be disclosed but as per reports, Sony has won the TV rights, whereas for digital, the winner is either Viacom 18 or Jio. The media rights value has grown more than two and a half times than what Star India paid in the year 2017. The process was divided into a total of four packages (A, B, C and D). Package A is exclusive for TV (broadcast) for the Indian subcontinent while package B is for digital-only grouping for the same region. The winner will be able to digitally broadcast the games across the Indian sub-continent. There are four specific packages in which e-auction was conducted or 74 games per season for a five-year period with a provision of increasing the number of matches to 94 in the final two years. Package C is for 18 selected games in each season for digital space. In Package D all games will be for combined TV and digital rights for overseas markets. All bidders made separate bids for each package. Bidders for Package A must have a net worth of Rs 1,000 crore; it is Rs 500 crore for those bidding for other packages. The biggest media houses in the country were fighting to earn the right to broadcast the world's richest cricket league on their platform.","pubDate":"2022-06-13 19:17:04","image_url":"https://assets.thehansindia.com/h-upload/2022/06/13/500x300_1297578-ipl.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England Take Late Wickets | Highlights | England v New Zealand - Day 4 | 2nd LV= Insurance Test 2022 - England & Wales Cricket Board","link":"https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9UGF1NWZZYTlQVzjSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England Take Late Wickets | Highlights | England v New Zealand - Day 4 | 2nd LV= Insurance Test 2022  England & Wales Cricket BoardEngland v New Zealand: second Test, day four – as it happened!  The GuardianBUMBLE ON THE TEST: Ollie Pope's emergence in his 25th Test has been superb  Daily MailJoe Root and Ollie Pope chatted Love Island as England stars scored brilliant hundreds  The MirrorPotts pounces as England ratchet up second Test pressure on New Zealand  The GuardianView Full coverage on Google News","content":null,"pubDate":"2022-06-13 18:28:22","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"LIVE IPL Media Rights Auction Day 2: Bid-Winners to be Revealed Tomorrow - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi6AFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtaXBsLW1lZGlhLXJpZ2h0cy1hdWN0aW9uLTIwMjItZGF5LTItcGFja2FnZS1jLWlzLWNsb3NlZC1vbi0xOC01LWNyb3Jlcy1wZXItZ2FtZS1vbi1kYXktMi1pbmRpYW4tcHJlbWllci1sZWFndWUtbGl2ZS1zb255LW1lZGlhLWRpc25leS12aWFjb20temVlLWRyZWFtMTEtc3Rhci1zcG9ydHMtaG90c3Rhci1hcHBsZS10ZWxldmlzaW9uLTU0NDgxNjIv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IPL Media Rights Auction Day 2: Bid-Winners to be Revealed Tomorrow  India.comIPL Media Rights e-Auction live updates blog | Cricbuzz.com - Cricbuzz  CricbuzzIPL Media Rights: Harish Thawani Explains Billion Dollar Number Game, Will Broadcasters Break Even?  India TodayPodcast | IPL media rights auction day 2: Will the winners ever recoup their investments?  BusinessLineIndian cricket rights auction to continue with $5.1 billion already in bag  Reuters IndiaView Full coverage on Google News","content":null,"pubDate":"2022-06-13 18:25:38","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs New Zeland: Hosts eye stunning Trent Bridge win after late collapse by Black Caps on day four - Sky Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMinQFodHRwczovL3d3dy5za3lzcG9ydHMuY29tL2NyaWNrZXQvbmV3cy8xMjEyMy8xMjYzMzI1Ny9lbmdsYW5kLXZzLW5ldy16ZWxhbmQtaG9zdHMtZXllLXN0dW5uaW5nLXRyZW50LWJyaWRnZS13aW4tYWZ0ZXItbGF0ZS1jb2xsYXBzZS1ieS1ibGFjay1jYXBzLW9uLWRheS1mb3Vy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England vs New Zeland: Hosts eye stunning Trent Bridge win after late collapse by Black Caps on day four  Sky SportsEngland v New Zealand: second Test, day four – live!  The GuardianStokes & Pope combine brilliantly to run out Young  BBCEngland put themselves in with a chance of a comeback win heading into final day against New Zealand  Daily MailPope & Root Hit Tons! | Highlights | England v New Zealand - Day 3 | 2nd LV= Insurance Test 2022  England & Wales Cricket BoardView Full coverage on Google News","content":null,"pubDate":"2022-06-13 18:05:35","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"BCCI announces a rise in pension of former players and umpires","link":"https://www.indiatvnews.com/sports/cricket/bcci-announces-a-rise-in-pension-of-former-players-and-umpires-2022-06-13-784336","keywords":null,"creator":null,"video_url":null,"description":"With the IPL Media rights doing all the rounds in different parts of the country, the Board of Control for Cricket in India (BCCI) has decided to double the pensions of former umpires and players. The country's richest sporting body locked in on a 6 billion dollar media deal and instantly decided to use it towards the welfare of the people who were once associated with the game. ","content":"With the Media rights doing all the rounds in different parts of the country, the Board of Control for Cricket in India (BCCI) has decided to double the pensions of former umpires and players. The country's richest sporting body locked in on a 6 billion dollar media deal and instantly decided to use it towards the welfare of the people who were once associated with the game. According to the revised monetary policies, the first-class players, who used to get Rs 15,000 will now get Rs 30,000 while former Test players, who get Rs 37,500, will now get Rs 60,000 and those with Rs 50,000 pension will get Rs 70,000. The monetary revisions are not only made for the men's division, but for the women's division too. The women internationals, who got Rs 30,000, will receive Rs 52,500 from now. The new regulations further state that The first-class cricketers who retired before 2003 and get Rs 22,500 will now get Rs 45,000. Jay Shah in a tweet stated \"I'm pleased to announce an increase in the monthly pension of former cricketers (men & women) and match officials. Around 900 personnel will avail of this benefit and close to 75% of personnel will be beneficiaries of a 100% raise\". Following up on this matter BCCI chief and former India captain Sourav Ganguly tweeted \"The financial well-being of our former cricketers must be taken care of. The players remain the lifeline and as a Board, it is our duty to be by their side once their playing days are over. Applauding the umpire's contribution to the game Ganguly said \"The umpires have been unsung heroes and the BCCI truly values their contribution\". Weighing on the salary rise Arun Singh Dhumal, the treasurer of the board said that BCCI stands tall because of the contribution of its former cricketers and umpires.","pubDate":"2022-06-13 17:42:09","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Mithali Raj reveals her only REGRET after retirement from international cricket","link":"https://zeenews.india.com/cricket/mithali-raj-reveals-her-only-regret-after-retirement-from-international-cricket-2473456.html","keywords":null,"creator":null,"video_url":null,"description":"After breaking numerous records and playing her heart out for the country, Raj did reveal one thing she would have wanted to retire achieving","content":"India women's team senior cricketer Mithali Raj announced her retirement from all forms of international cricket last week. Raj, who had an astonishing career of 23 year in the Indian cricket team, faced a lot of ups and downs before calling it a day. She is the most capped and highest run-scorer in the history of women's cricket and that tells a lot about her hardwork and work ethic for her country and the game of cricket. After breaking numerous records and playing her heart out for the country, Raj did reveal one thing she would have wanted to achieve before retiring - the World Cup. Mithali was left disappointed that she couldn't lift the World Cup trophy even once in her 23-year-long career. Mithali made her debut in blue jersey in the year 1999 playing 232 ODIs, 89 T20Is and 12 Test matches for the Women in Blue. She is a legend of the game and has scored 10,868 runs, which is the most by any woman in the history. Mithali also holds the record for most 50-plus knocks in women internationals and has played in six editions of the World Cup. Thank you for all your love & support over the years! I look forward to my 2nd innings with your blessing and support. pic.twitter.com/OkPUICcU4u — Mithali Raj (@M_Raj03) June 8, 2022 \"She (Harmanpreet) has been my deputy for a good 5-6 years and she has been leading the T20I format for quite some time. So, I'm sure she will be able to lead the ODI side well,\" said a hopeful Mithali. \"It took me a while to get over the defeat in that last game against South Africa. Things didn't go as planned in the World Cup. I took time to first process that. It was already decided that the World Cup would be my swansong. It wasn't something that I decided in an instant or in a week's time, I very much knew about (retirement).\" \"It is just I needed time to process the decision which I did after I got over my emotions because I'm not someone who would take any sort of decisions while going through all kinds of emotions, especially a big decision like this. This year we don't have a home series. In both the series, India is touring (to Sri Lanka and England). Ideally, I would have loved to play at home and call it a day, but since there is no home series, I took this decision (via social media).\"","pubDate":"2022-06-13 17:23:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka vs Australia one day match head to head: SL vs AUS ODI head to head stats and records","link":"https://thesportsrush.com/cricket-news-sri-lanka-vs-australia-one-day-match-head-to-head-sl-vs-aus-odi-head-to-head-stats-and-records/","keywords":["Cricket","Australia","Australia tour of Sri Lanka 2022","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"SL vs AUS ODI head to head: The SportsRush presents for you the Head to Head statistics for the first SL vs AUS ODI. The first ODI of the ongoing Australia’s tour of Sri Lanka will be played at the Pallekele International Cricket Stadium tomorrow. A five-match ODI series with no real reward in modern-day… The post Sri Lanka vs Australia one day match head to head: SL vs AUS ODI head to head stats and records appeared first on The SportsRush.","content":"SL vs AUS ODI head to head: The SportsRush presents for you the Head to Head statistics for the first SL vs AUS ODI. The first ODI of the ongoing Australia’s tour of Sri Lanka will be played at the Pallekele International Cricket Stadium tomorrow. A five-match ODI series with no real reward in modern-day cricket will be played in between a three-match T20I series and a two-match Test series. Although the hosts ended up losing the T20I series 1-2, a record-breaking victory in the third T20I at the same venue should provide them with a lot of courage and confidence ahead of the ODIs. Australia, on the other hand, would be looking to continue with dominating form in spite of losing a few players to injuries. It was at the same venue that Australia had defeated Sri Lanka in their last ODI in Sri Lanka to win the series 4-1 six years ago. Readers must note that it was also the last time these two teams had locked horns against each other in a bilateral ODI series. Train & sweat it out 💪🏻 Sri Lanka gear up for the 1st ODI in Kandy! #SLvAUS pic.twitter.com/GcpSTYOCr0 — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) June 13, 2022 As far as their last ODI against each other is concerned, it was an ICC Cricket World Cup 2019 league match where Australia had defeated Sri Lanka by a comprehensive 85-run margin at The Oval. Total number of matches played: 97 Matches won by SL: 32 Matches won by AUS: 61 Matches played in Sri Lanka: 30 (SL 14, AUS 13) Matches played in Asia: 34 (SL 15, AUS 16) Matches played at Pallekele International Cricket Stadium: 2 (SL 0, AUS 2) SL average score against AUS: 232 AUS average score against SL: 252.5 Most runs for SL: 649 (Dinesh Chandimal) Most runs for AUS: 624 (David Warner) Most wickets for SL: 3 (Dhananjaya de Silva) Most wickets for AUS: 27 (Mitchell Starc) Most catches for SL: 4 (Dinesh Chandimal) Most catches for AUS: 11 (David Warner) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-06-13 17:19:12","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Australian cricket legend Shane Warne posthumously honoured in Queen's Birthday List","link":"https://www.mirror.co.uk/sport/cricket/shane-warne-queen-birthday-honours-27223127","keywords":["Sport"],"creator":["mirrornews@mirror.co.uk (Matthew Cooper)"],"video_url":null,"description":"The late, great Shane Warne has been recognised in the Queen's Birthday Honours List following his tragic death at the age of just 52","content":null,"pubDate":"2022-06-13 17:17:34","image_url":"https://i2-prod.mirror.co.uk/incoming/article26388060.ece/ALTERNATES/s615/0_GettyImages-72921825.jpg","source_id":"mirroruk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"'मैं Roman Reigns से बदला लेकर रहूंगा', इस WWE Superstar ने खुलेआम दी चुनौती","link":"https://www.abplive.com/sports/wwe/riddle-took-a-shot-against-roman-reigns-before-his-match-2145450","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\">WWE स्टार रिडल (Riddle) इस समय कंपनी में मेन इवेंट स्टार बने हुए हैं. उनके और रोमन रेंस (Roman Reigns), द उसोज़ (The Usos) के बीच फ्यूड ने उनको मेन इवेंट स्टार बना दिया है. इस बार वो स्मैकडाउन के शो के दौरान रोमन रेंस के खिलाफ टाइटल मैच में भी नजर आएंगे. इस मुकाबले से पहले रिडल ने रोमन रेंस को चेतावनी दी है.&nbsp;</p> <p style=\"text-align: justify;\">दरअसल, स्मैकडाउन के दौरान रिडल का सामना सैमी जेन से हुआ था. इस मैच में ये शर्त थी कि अगर सैमी जेन मैच को जीत जाते हैं तो रोमन रेंस के खिलाफ उन्हें टाइटल मैच का मौका मिलेगा. वहीं, इस मैच में अगर रिडल हार जाते हैं तो उन्हें स्मैकडाउन से बैन कर दिया जाएगा. जिसके बाद इस मैच में रिडल ने सैमी को हरा दिया था. इस मैच में जीत के बाद वो रोमन रेंस के खिलाफ टाइटल मैच में नजर आएंगे.&nbsp;</p> <p style=\"text-align: justify;\">इस मुकाबले में जीत के बाद उन्होंने रोमन रेंस को धमकी दी है. उन्होंने कहा कि मुझे लगता है मेरे लिए वहां चीज़े बेहद आसान है. मैं WWE यूनिवर्स से वादा करता हूं कि मैं रोमन रेंस से बदला लूंगा. वो मुझे कभी नहीं भूलेंगे. वो मुझे याद रखेंगे और वो रैंडी ऑर्टन को याद रखेंगे. मैं आप को गारंटी देता हूँ कि SmackDown के अगले एपिसोड को कभी नहीं भूल पाएंगे. वो अपनी लाइफ में कभी RK-Bro को नहीं भूल पाएंगे.&nbsp;</p> <p style=\"text-align: justify;\">बता दें कि इस हफ्ते स्मैकडाउन में रोमन रेंस का सामना रिडल से होगा. इस मैच में रोमन अपना टाइटल उनके खिलाफ डिफेंड करते हुए नजर आएंगे. ऐसे में ये देखना दिलचस्प रहेगा कि WWE किस तरह से इस मुकाबले को बुक करता है.&nbsp;</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें :&nbsp;<a href=\"https://www.abplive.com/sports/cricket/india-tour-of-ireland-sitanshu-kotak-sairaj-bahutule-munish-bali-to-be-part-of-support-staff-2145388\">India vs Ireland T20: वीवीएस लक्ष्मण के साथ एनसीए के ये कोच जाएंगे आयरलैंड दौरे पर, खेले जाएंगे 2 टी20 मुकाबले</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/dr-ys-rajasekhara-reddy-stadium-pitch-report-for-ind-vs-sa-3rd-t20-2145280\"><strong>IND vs SA 3rd T20: जानिए तीसरे टी20 मुकाबले में कैसी होगी पिच, विशाखापत्तनम में टी20 रिकॉर्ड भी पढ़ें</strong></a></p>","content":null,"pubDate":"2022-06-13 16:52:27","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"मैच हारने के बाद पूर्व WWE स्टार ने की रिटायरमेंट की घोषणा, फैंस भी रह गए दंग","link":"https://www.abplive.com/sports/wwe/former-wwe-star-damien-sandow-retires-from-the-pro-wrestling-business-2145455","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\">पूर्व WWE स्टार डेमियन सैंडो (Damien Sandow) ने प्रोफेशनल रेसलिंग से संन्यास का ऐलान कर दिया है. उन्होंने &nbsp;NWA के Alwayz Ready पीपीवी में ट्रेवर मुर्डोच (Trevor Murdoch) के खिलाफ अपने मुकाबले को अपना आखिरी मैच बताया है. उन्होंने साफ़ कर दिया है कि वो आखिरी बार रिंग में नजर आए थे.&nbsp;</p> <p style=\"text-align: justify;\">गौरतलब है कि सैंडो और मुर्डोच के मैच से से ही इस पीपीवी की शुरुआत हुई थी. इस मुकाबले में मुर्डोच को जीत मिली थी. पूर्व NWA वर्ल्ड हैवीवेट चैंपियन मैट कार्डोना की चोट की वजह से ही मुर्डोच मेन इवेंट का हिस्सा बने थे. &nbsp;जिसके बाद मुर्डोच ने फैटल-4-वे मुकाबला जीत लिया था और अपने करियर में दूसरी बार चैंपियनशिप जीती है.&nbsp;</p> <p style=\"text-align: justify;\">इस मैच के बाद सैंडो ने दिए इंटरव्यू में &nbsp;कहा कि ये उनका आखिरी मुकाबला था. उन्होंने अपने रेसलिंग करियर को यादगार बताया है. इसके अलावा उन्होंने कहा कि उन्हें चैंपियनशिप ना जीत पाने का सबसे ज्यादा मलाल हैं.&nbsp;</p> <p style=\"text-align: justify;\">वहीं, भले ही डेमियन सैंडो ने संन्यास की घोषणा कर दी ही लेकिन फैंस इस बात को नहीं मान रहे हैं. उनका मानना है कि वो एक बार फिर से WWE में वापसी करेंगे और तब वो इजेक्यूल के बड़े भाई के रूप में नजर आएंगे. जिसके बाद उनका और केविन ओवेंस का फ्यूड और ज्यादा दिलचस्प हो जाएगा.</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें :&nbsp;<a href=\"https://www.abplive.com/sports/cricket/india-tour-of-ireland-sitanshu-kotak-sairaj-bahutule-munish-bali-to-be-part-of-support-staff-2145388\">India vs Ireland T20: वीवीएस लक्ष्मण के साथ एनसीए के ये कोच जाएंगे आयरलैंड दौरे पर, खेले जाएंगे 2 टी20 मुकाबले</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/dr-ys-rajasekhara-reddy-stadium-pitch-report-for-ind-vs-sa-3rd-t20-2145280\"><strong>IND vs SA 3rd T20: जानिए तीसरे टी20 मुकाबले में कैसी होगी पिच, विशाखापत्तनम में टी20 रिकॉर्ड भी पढ़ें</strong></a></p>","content":null,"pubDate":"2022-06-13 16:51:30","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"BCCI announces increase in monthly pensions of former cricketers, umpires","link":"https://www.business-standard.com/article/sports/bcci-announces-increase-in-monthly-pensions-of-former-cricketers-umpires-122061301095_1.html","keywords":null,"creator":null,"video_url":null,"description":"Ex-India captain and BCCI president Sourav Ganguly said that it is extremely important for the cricket board to take care of the financial well-being of our former cricketers and umpires.","content":"The Board for Control of Cricket in India (BCCI) on Monday announced a hike in monthly pensions of former cricketers (both men and women) and former umpires. Ex-India captain and BCCI president Sourav Ganguly said that it is extremely important for the cricket board to take care of the financial well-being of our former cricketers and umpires. \"It is extremely important that the financial well-being of our former cricketers is taken care of. The players remain the lifeline and as a Board, it is our duty to be by their side once their playing days are over. The umpires have been unsung heroes and the BCCI truly values their contribution,\" he said. \"The welfare of our cricketers be it former or present is a top priority, and increasing pension amounts is a step in that direction. The BCCI values the contribution the umpires have made over the years and this is one way to express our gratitude for their diligent services to Indian Cricket. A total of around 900 personnel will get the benefit of the scheme with more than 75 per cent of the beneficiaries getting a 100 per cent raise,\" BCCI secretary Jay Shah said. \"Whatever the BCCI is today, it is because of the contribution of its former cricketers and umpires. We are pleased to announce the increase in the monthly pensions which will be a gesture for the well-being of our former cricketers,\" BCCI treasurer Arun Singh Dhumal said.--IANS inj (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-06-13 16:45:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220613/thumb-122061301095.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IPL Media Rights Auction: खेल जगत की सबसे अमीर लीग बनने को तैयार आईपीएल, BCCI को अब तक 46 हजार करोड़ की बंपर कमाई","link":"https://www.abplive.com/sports/ipl/ipl-tv-and-digital-rights-sold-to-2-broadcasters-for-rs-44075-crore-auction-to-continue-tomorrow-2145451","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IPL TV And Digital Rights Sold:</strong> आईपीएल के टीवी और डिजिटल अधिकारों के जरिए बीसीसीआई को 44075 करोड़ रूपये की कमाई होना तय है, जिससे खेल जगत में यह सबसे अमीर लीग में से एक हो जाएगी. अब तक मिली सूचना के अनुसार 2023 से 2027 के बीच 410 आईपीएल मैचों के लिये पैकेज ए (भारतीय उपमहाद्वीप के टीवी अधिकार) 23575 करोड़ रूपये में बिके हैं यानी प्रति मैच 57.5 करोड़ रूपये.</p> <p style=\"text-align: justify;\">भारतीय उपमहाद्वीप के लिए डिजिटल अधिकार 50 करोड़ रूपये प्रति मैच बिके हैं जिसे बोली लगाने वाले एक पक्ष ने पैकेज ए पाने वाले की चुनौती का सामना करके खरीदा. पैकेज बी से 20500 करोड़ रूपये मिले हैं यानी दो पैकेज बेचने के बाद बीसीसीआई की झोली में 44075 करोड़ रूपये आए. दूसरे दिन नीलामी रूकने तक पैकेज सी के लिये दो हजार करोड़ रूपये की बोली लग चुकी थी. अब तीसरे दिन इसके आगे से बोली लगेगी.</p> <p style=\"text-align: justify;\">बोर्ड को अब तक 46000 करोड़ रूपये की कमाई हो चुकी है जो 2018 में मिले 16347 करोड़ रूपये से ढाई गुना ज्यादा है. टीवी के लिए बेसप्राइस 49 करोड़ रूपये और डिजिटल अधिकारों के लिये 33 करोड़ रूपये थी.</p> <p style=\"text-align: justify;\">बीसीसीआई के एक सूत्र ने कहा, &lsquo;&lsquo;हम 5.5 अरब डॉलर के करीब पहुंच रहे हैं. डिजिटल अधिकारों के लिये प्रति मैच 50 करोड़ रूपये मिलना बड़ी बात है. आज नीलामी छह बजे खत्म हुई और हम अभी पैकेज सी पर है जिसमें पांच साल के लिये 98 मैचों के &lsquo;नॉन एक्सक्लूजिव&rsquo; डिजिटल अधिकार शामिल हैं. इसके बाद पैकेज डी आयेगा जो विदेशी टीवी और डिजिटल अधिकारों के लिए है.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">इनपुट - एजेंसी</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/former-cricketers-monthly-pension-increase-75-percent-of-personnel-beneficiaries-of-100-percent-raise-2145404\">Cricketers Pension: पूर्व क्रिकेटरों के लिए सचिव जय शाह का बड़ा फैसला, BCCI ने बढ़ाई 900 लोगों की पेंशन</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/shikhar-dhawan-shares-video-of-gabbar-avatar-goes-viral-on-social-media-2145384\"><strong>Watch: Shikhar Dhawan ने दिखाया 'गब्बर' अवतार, वीडियो देख हंसी नहीं रोक पाएंगे आप</strong></a></p>","content":null,"pubDate":"2022-06-13 16:29:35","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Canada Para Badminton 2022: कनाडा में मानसी जोशी और मनीषा ने लहराया तिरंगा, पैरा बैडमिंटन में जीता गोल्ड मेडल","link":"https://www.abplive.com/sports/canada-para-badminton-2022-manasi-joshi-manisha-ramadass-won-gold-medal-for-india-2145439","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Canada Para Badminton 2022 Manasi Joshi Manisha Ramadass Gold Medal:</strong> ओटावा में कनाडा इंटरनेशनल पैरा बैडमिंटन में मानसी जोशी और मनीषा रामदास ने गोल्ड मेडल अपने नाम किया. इसके साथ ही दो स्वर्ण सहित नौ पदक जीतकर भारतीय पैरा शटलरों ने अपना शानदार प्रदर्शन जारी रखा. हालांकि, पैरालंपिक के स्वर्ण पदक विजेता प्रमोद भगत को अपने कट्टर प्रतिद्वंद्वी डेनियल बेथेल के खिलाफ 14-21, 21-9, 15-21 से हार का सामना करना पड़ा. तोक्यो 2020 गेम्स के बाद से इंग्लैंड के पैरालंपिक रजत पदक विजेता के लिए भगत की यह दूसरी हार थी.</p> <p style=\"text-align: justify;\">महिला एसएल3 में मौजूदा विश्व चैंपियन जोशी ने साथी भारतीय पारुल परमार, फ्रांस की कोरलाइन बर्जरोन, जापान की नोरिको इतो और यूक्रेन की ओक्साना कोज्याना को हराकर अपने सभी राउंड रॉबिन मैच जीतकर शानदार प्रदर्शन किया. जबकि, जोशी अपने पहले तीन विरोधियों से परेशान थीं, उन्हें ओक्साना से कड़ी चुनौती का सामना करना पड़ा. इससे पहले, जोशी ने 21-18, 15-21, 22-20 से जीत दर्ज की. इस सीजन में जोशी की महिला एकल स्पर्धा में यह चौथी खिताबी जीत थी.</p> <p style=\"text-align: justify;\">जोशी ने ट्वीट किया, कनाडा पैरा-बैडमिंटन अंतरराष्ट्रीय में मिश्रित युगल में एकल और कांस्य में स्वर्ण जीतकर बेहद खुशी हुई. इसके साथ ही मध्य पूर्व और उत्तरी अमेरिका का मेरा एक महीने का दौरा समाप्त हो गया.\"</p> <p style=\"text-align: justify;\">जोशी की तरह रामदास ने भी फज्जा दुबई 2022 अंतर्राष्ट्रीय खिताब जीतकर महिला एकल एसयू5 स्वर्ण पदक जीता. चेन्नई की 17 वर्षीय शटलर ने अपना संयम बनाए रखा और फाइनल में जापान की अकीको सुगिनो पर 27-25, 21-9 से रोमांचक जीत हासिल की.</p> <p style=\"text-align: justify;\">दुबई में भी रामदास ने सुगिनो को सीधे गेम में हराकर स्वर्ण पदक जीता. इस सीजन में एसयू5 श्रेणी में यह उनका चौथा महिला एकल स्वर्ण पदक है. तोक्यो के स्वर्ण पदक विजेता प्रमोद भगत ने पुरुष एकल एसएल3 स्पर्धा में रजत पदक जीता.</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"in\">9 Medals<br />2 Gold<br />1 Silver<br />6 Bronze<br /><br />Indian Para Team Won 9 Medals Including 2 Gold, 1 Silver &amp; 6 Bronze in Canada Para Badminton International 8-12 June 2022<br /><br />Gold Medalist<br />1. WS SU5 - Manisha Ramadas<br />2. WS SL3 - Manasi Joshi<br /><br />Silver Medalist <br />1. MS SL3 - Pramod Bhagat <a href=\"https://t.co/DurvLrzI8A\">pic.twitter.com/DurvLrzI8A</a></p> &mdash; Paralympic India 🇮🇳 🏅#Praise4Para (@ParalympicIndia) <a href=\"https://twitter.com/ParalympicIndia/status/1536232830614708224?ref_src=twsrc%5Etfw\">June 13, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/shikhar-dhawan-shares-video-of-gabbar-avatar-goes-viral-on-social-media-2145384\">Watch: Shikhar Dhawan ने दिखाया 'गब्बर' अवतार, वीडियो देख हंसी नहीं रोक पाएंगे आप</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-3rd-t20-live-streaming-details-when-and-where-to-watch-india-vs-south-africa-live-2145334\"><strong>IND vs SA 3rd T20: भारत के लिए करो या मरो वाला मैच, जानिए कहां देखें मुकाबले का लाइव टेलीकास्ट-लाइव स्ट्रीमिंग</strong></a></p>","content":null,"pubDate":"2022-06-13 16:09:07","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"‘The greatest we’ve ever produced’ – Steve Harmison was full of praise for Joe Root as he continued his incredible run of form with another century against New Zealand","link":"https://talksport.com/sport/cricket/1129008/steve-harmison-joe-root-century-new-zealand/","keywords":["Cricket","Sport"],"creator":["Cameron Temple"],"video_url":null,"description":"England has produced some world class batsmen over the years from Sir Alastair Cook to Graham Gooch and Kevin Pietersen, but according to Steve Harmison, Joe Root tops the lot. Root has been in incredible form of late, scoring four centuries in his last five Test matches dating back to England’s series against the West […]","content":"England has produced some world class batsmen over the years from Sir Alastair Cook to Graham Gooch and Kevin Pietersen, but according to Steve Harmison, Joe Root tops the lot. Root has been in incredible form of late, scoring four centuries in his last five Test matches dating back to England’s series against the West Indies in March. Root used his full arsenal of shots as he hit 176 runs in his latest innings against New ZealandGetty “Well I’m sick of talking about Joe Root,” joked former England fast bowler Steve Harmison on talkSPORT. “He’s unbelievable. “You can’t talk any higher, he’s the greatest we’ve ever produced and he showed again how good and how valuable and how lucky we are to have Joe Root.” In the first Test with New Zealand, Root led the way to victory by scoring 115 runs in the second innings, as England pulled off the third highest run chase to ever take place at Lord’s. That century also took Root past 10,000 test runs and he followed up with a 27th test century in the second meeting with New Zealand that is currently ongoing and finely poised. Root is now the second highest test run scorer in England cricket history, behind only Cook, and he is 12th of all time, having overtaken Younis Khan and Sunil Gavaskar and he is hot on the heels of Steve Waugh. It seems relinquishing the captaincy and handing over the reins to Ben Stokes has worked wonders for Root, taking a weight off his shoulders and he looks more confident than ever at the crease. Most read in Cricket easy New Zealand take out pints and put fans to sleep as Mitchell ton frustrates England second Test England vs New Zealand: Stokes' side head to Trent Bridge after dream start great Root reaches stunning landmark with century as England beat New Zealand in first Test new Chaotic start to Stokes era as England captain sees same old batting problems continue live England v New Zealand: Stokes to lead new era of Test match cricket at Lord's howzat talkSPORT announces new partnership with Cricket Ireland Pope has already surpassed 1000 test runs for England at just 24-years-oldGetty Another in-form batsman in the England line-up is the new number three, Ollie Pope, for whom Harmison also had nothing but admiration. “It was a good day yesterday for England,” Harmison added, “and I think everybody was over the moon for Ollie Pope. “He’s had his struggles in the recent past, the last 18-24 months, but there’s no doubt the boys talented and he showed that yesterday.” Pope played an excellent supporting role for Root in the first innings of England’s second test with New Zealand, calming the ship after losing Zak Crawley early on and going on to score 145 runs to help chase down the Kiwi’s huge total of 553. Offers Of The Day 888Sport – Bet £20 On Horse Racing, Get £40 In Free Bets For Royal Ascot* – CLAIM HERE Bet365 – Bet £10 Get £50 In Free Bets* – CLAIM HERE 888Sport: Min deposit £/€/$10 • Offer is valid until 18/06/2022 23:59 • A qualifying bet is a ‘real money’ stake of at least £/€/$20 on Horse Racing market • Min odds 1/2 (1.50) • Free Bets expire after 5 days • Free Bet stakes not included in returns • Withdrawal restrictions, payment methods, country & Full T&C’s apply. 18+ Begambleaware.org Bet365: Open account offer. Bet £10 & Get £50 in Free Bets for new customers at bet365. Min deposit requirement. Free Bets are paid as Bet Credits and are available for use upon settlement of qualifying bets. Min odds, bet and payment method exclusions apply. Returns exclude Bet Credits stake. Time limits and T&Cs apply 18+ Begambleaware.org","pubDate":"2022-06-13 16:00:33","image_url":null,"source_id":"talksport","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Afghan woman starts her life — and her cricket career — over in Fredericton","link":"https://ca.sports.yahoo.com/news/afghan-woman-starts-her-life-151208971.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-13 15:12:08","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"England v New Zealand live: score and latest updates from day four of second Test","link":"https://uk.sports.yahoo.com/news/england-v-zealand-live-score-085923976.html?src=rss","keywords":["Sports"],"creator":["The Telegraph"],"video_url":null,"description":"England vs New Zealand, second Test scoreboard in full Listen: The Vaughany and Tuffers Cricket Club England lose 5/66 today (Boult five-fer), all out for 539 James Anderson gets Latham early for 650th Test wicket Leach gets only afternoon wicket. TEA: NZ 114/2, lead 128","content":"England vs New Zealand, second Test scoreboard in full Listen: The Vaughany and Tuffers Cricket Club England lose 5/66 today (Boult five-fer), all out for 539 James Anderson gets Latham early for 650th Test wicket Leach gets only afternoon wicket. TEA: NZ 114/2, lead 128","pubDate":"2022-06-13 15:03:15","image_url":null,"source_id":"yahoo_hk","country":["hong kong"],"category":["sports"],"language":"chinese"},{"title":"TBT Sports: Cricket returns","link":"https://www.tbnewswatch.com/video/tbt-sports/tbt-sports-cricket-returns-5471882","keywords":null,"creator":["TBnewsWatch.com Staff"],"video_url":null,"description":"TBT Sports: Cricket returns","content":null,"pubDate":"2022-06-13 15:00:04","image_url":"https://i.ytimg.com/vi/3LKonMCOf0w/0.jpg","source_id":"tbnewswatch","country":["united states of america"],"category":["sports"],"language":"english"},{"title":"Cricketers Pension: पूर्व क्रिकेटरों के लिए सचिव जय शाह का बड़ा फैसला, BCCI ने बढ़ाई 900 लोगों की पेंशन","link":"https://www.abplive.com/sports/cricket/former-cricketers-monthly-pension-increase-75-percent-of-personnel-beneficiaries-of-100-percent-raise-2145404","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>BCCI Pension Increase Of Former Cricketers: </strong>बीसीसीआई ने पूर्व क्रिकेटरों और पूर्व अधिकारियों को लेकर एक बड़ा फैसला किया है. बीसीसीआई के सचिव जय शाह ने घोषणा की है पूर्व खिलाड़ियों की पेंशन को बढ़ाने का निर्णय लिया गया है. इसमें पुरुष और महिला क्रिकेट से जुड़े 900 लोगों को शामिल किया गया है. इस पेंशन का फायदा जल्द ही इन लोगों को मिलने लगेगा.</p> <p style=\"text-align: justify;\">बीसीसीआई सचिव ने ट्वीट कर कहा, मुझे पूर्व क्रिकेटरों (पुरुष और महिला) और मैच अधिकारियों की मासिक पेंशन को बढ़ाने की घोषणा करते हुए खुशी हो रही है. इसका करीब 900 लोगों को फायदा होगा. इसके साथ ही 75 प्रतिशत कर्मचारी 100 प्रतिशत वृद्धि का लाभ ले सकेंगे.&nbsp;</p> <p style=\"text-align: justify;\">&nbsp;</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">I&rsquo;m pleased to announce an increase in the monthly pension of former cricketers (men &amp; women) and match officials. Around 900 personnel will avail of this benefit and close to 75% of personnel will be beneficiaries of a 100% raise.</p> &mdash; Jay Shah (@JayShah) <a href=\"https://twitter.com/JayShah/status/1536356009840545803?ref_src=twsrc%5Etfw\">June 13, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\">अपडेट जारी है...</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/india-tour-of-ireland-sitanshu-kotak-sairaj-bahutule-munish-bali-to-be-part-of-support-staff-2145388\">India vs Ireland T20: वीवीएस लक्ष्मण के साथ एनसीए के ये कोच जाएंगे आयरलैंड दौरे पर, खेले जाएंगे 2 टी20 मुकाबले</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/dr-ys-rajasekhara-reddy-stadium-pitch-report-for-ind-vs-sa-3rd-t20-2145280\"><strong>IND vs SA 3rd T20: जानिए तीसरे टी20 मुकाबले में कैसी होगी पिच, विशाखापत्तनम में टी20 रिकॉर्ड भी पढ़ें</strong></a></p>","content":null,"pubDate":"2022-06-13 14:53:01","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Ireland T20: वीवीएस लक्ष्मण के साथ एनसीए के ये कोच जाएंगे आयरलैंड दौरे पर, खेले जाएंगे 2 टी20 मुकाबले","link":"https://www.abplive.com/sports/cricket/india-tour-of-ireland-sitanshu-kotak-sairaj-bahutule-munish-bali-to-be-part-of-support-staff-2145388","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs Ireland:</strong> भारतीय टीम इसी महीने आयरलैंड का दौरा करेगी. इस दौरे पर दोनों टीमों के बीच 2 टी20 मुकाबले खेले जाएंगे. सीरीज का पहला मैच 26 जून को वहीं दूसरा मैच 28 जून को खेला जाएगा. राष्ट्रीय क्रिकेट अकादमी (NCA) के कोच सीतांशु कोटक (Sitanshu Kotak), साईराज बहुतुले (Sairaj Bahutule) और मुनीश बाली (Munish Bali) इस महीने के आखिर में आयरलैंड के दौरे पर भारतीय क्रिकेट टीम के सहयोगी स्टाफ का हिस्सा होंगे. इसकी अगुवाई पूर्व दिग्गज वीवीएस लक्ष्मण करेंगे.&nbsp;</p> <p style=\"text-align: justify;\"><strong>कोटक होंगे बल्लेबाजी कोच</strong><br />कोटक पहले भी भारत ए टीम की प्रणाली का हिस्सा रह चुके है. वह बल्लेबाजी कोच होंगे, जबकि बाली और बहुतुले को फील्डिंग और गेंदबाजी कोच की जिम्मेदार सौंपी गई है. ये दोनों इस साल की शुरुआत में वेस्टइंडीज में भारत-19 टीम के विश्वकप का हिस्सा थे. एनसीए के प्रमुख लक्ष्मण आयरलैंड दौरे पर भारतीय टीम के मुख्य कोच होंगे.&nbsp;</p> <p style=\"text-align: justify;\"><strong>एक टीम जाएगी इंग्लैंड</strong><br />मुख्य कोच राहुल द्रविड़ टीम के अन्य सीनियर सहयोगी सदस्यों के साथ इस सप्ताह के अंत में टेस्ट टीम के साथ इंग्लैंड के लिए रवाना होगे. ऐसे में बाली, कोटक और बहुतुले की तिकड़ी दक्षिण अफ्रीका के खिलाफ मौजूदा टी20 इंटरनेशनल सीरीज खेल रही टीम से पहले ही जुड़ गयी है.</p> <p style=\"text-align: justify;\"><strong>टीम का एलान नहीं हुआ</strong><br />बीसीसीआई अधिकारी के मुताबिक सीनियर सहयोगी सदस्यों के इंग्लैंड दौरे पर रवाना होने के बाद बाली, कोटक और बहुतुले दक्षिण अफ्रीका के खिलाफ मौजूदा टी20 इंटरनेशनल सीरीज के आखिरी दो मैचों (राजकोट और बेंगलुरु) के दौरान राष्ट्रीय टीम की जिम्मेदारी &nbsp;साथ होगी. उन्होंने कहा, वे पहले से ही सीमित ओवरों की टीम के साथ है और जब सीनियर सहयोगी सदस्य इंग्लैंड जायेंगे तो वे अपनी भूमिका के लिए तैयार रहेंगे. आयरलैंड सीरीज के लिए टीम की घोषणा अभी नहीं हुई है.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-3rd-t20-live-streaming-details-when-and-where-to-watch-india-vs-south-africa-live-2145334\">IND vs SA 3rd T20: भारत के लिए करो या मरो वाला मैच, जानिए कहां देखें मुकाबले का लाइव टेलीकास्ट-लाइव स्ट्रीमिंग</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/dr-ys-rajasekhara-reddy-stadium-pitch-report-for-ind-vs-sa-3rd-t20-2145280\">IND vs SA 3rd T20: जानिए तीसरे टी20 मुकाबले में कैसी होगी पिच, विशाखापत्तनम में टी20 रिकॉर्ड भी पढ़ें</a></strong></p>","content":null,"pubDate":"2022-06-13 14:46:19","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Watch: Shikhar Dhawan ने दिखाया 'गब्बर' अवतार, वीडियो देख हंसी नहीं रोक पाएंगे आप","link":"https://www.abplive.com/sports/cricket/shikhar-dhawan-shares-video-of-gabbar-avatar-goes-viral-on-social-media-2145384","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p><strong>Shikhar Dhawan Viral Video:</strong> भारतीय क्रिकेट टीम के खिलाड़ी शिखर धवन आईपीएल 2022 के बाद से ही ब्रेक पर चल रहे हैं. धवन ने आईपीएल के इस सीजन में कमाल का प्रदर्शन किया था. वे पंजाब किंग्स का हिस्सा थे. धवन इस समय परिवार के साथ वक्त बिता रहे हैं. वे सोशल मीडिया पर काफी एक्टिव रहते हैं. उन्होंने हाल ही में एक दिलचस्प वीडियो शेयर किया है, जिसे देखकर शायद ही आप हंसी रोक पाएं. इस वीडियो में धवन का गब्बर अवतार दिखा है. उनके वीडियो को फैंस को काफी पसंद कर रहे हैं.</p> <p>धवन ने एक वीडियो इंस्टाग्राम पर शेयर किया है. इसके बैकग्राउंड में एक बॉलीवुड का डायलॉग चल रहा है. इस पर धवन एक्टिंग करते हुए नजर आ रहे हैं. उनके इस वीडियो को करीब तीन लाख लोगों ने पसंद किया है. जबकि कई लोगों ने इस पर प्रतिक्रिया भी दी है.</p> <p>गौरतलब है कि धवन ने आईपीएल 2022 में 14 मैच खेले थे. इस दौरान उन्होंने शानदार प्रदर्शन करते हुए 460 रन बनाए. उन्होंने इस सीजन में तीन अर्धशतक भी लगाए थे. धवन का आईपीएल 2022 में सर्वश्रेष्ठ स्कोर नाबाद 88 रन रहा था. उन्होंने 47 चौके और 12 छक्के भी जड़े थे. अगर ओवर ऑल रिकॉर्ड की बात करें तो वे आईपीएल के 206 मैचों में 6244 रन बना चुके हैं. इस दौरान उन्होंने 2 शतक और 47 अर्धशतक लगाए हैं.</p> <blockquote class=\"instagram-media\" style=\"background: #FFF; border: 0; border-radius: 3px; box-shadow: 0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width: 540px; min-width: 326px; padding: 0; width: calc(100% - 2px);\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/CetdYM4D80g/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\"> <div style=\"padding: 16px;\"> <div style=\"display: flex; flex-direction: row; align-items: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\">&nbsp;</div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\">&nbsp;</div> </div> </div> <div style=\"padding: 19% 0;\">&nbsp;</div> <div style=\"display: block; height: 50px; margin: 0 auto 12px; width: 50px;\">&nbsp;</div> <div style=\"padding-top: 8px;\"> <div style=\"color: #3897f0; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: 550; line-height: 18px;\">View this post on Instagram</div> </div> <div style=\"padding: 12.5% 0;\">&nbsp;</div> <div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\"> <div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\">&nbsp;</div> </div> <div style=\"margin-left: 8px;\"> <div style=\"background-color: #f4f4f4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg);\">&nbsp;</div> </div> <div style=\"margin-left: auto;\"> <div style=\"width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\">&nbsp;</div> <div style=\"background-color: #f4f4f4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\">&nbsp;</div> <div style=\"width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\">&nbsp;</div> </div> </div> <div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\"> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\">&nbsp;</div> <div style=\"background-color: #f4f4f4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\">&nbsp;</div> </div> <p style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; line-height: 17px; margin-bottom: 0; margin-top: 8px; overflow: hidden; padding: 8px 0 7px; text-align: center; text-overflow: ellipsis; white-space: nowrap;\"><a style=\"color: #c9c8cd; font-family: Arial,sans-serif; font-size: 14px; font-style: normal; font-weight: normal; line-height: 17px; text-decoration: none;\" href=\"https://www.instagram.com/reel/CetdYM4D80g/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\" rel=\"noopener\">A post shared by Shikhar Dhawan (@shikhardofficial)</a></p> </div> </blockquote> <p> <script src=\"//www.instagram.com/embed.js\" async=\"\"></script> </p> <p><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/virat-kohli-steve-smith-drs-controversy-bengaluru-test-india-vs-australia-2145349\">Virat Kohli Steve Smith Controversy : जब टेस्ट मैच के दौरान भिड़ गए स्मिथ और विराट, जानें क्या था पूरा विवाद</a></strong></p> <p><a href=\"https://www.abplive.com/sports/cricket/pakistan-left-behind-india-in-icc-odi-rankings-after-clean-sweep-on-west-indies-2145307\"><strong>ICC Rankings 2022: वेस्टइंडीज पर क्लीन स्वीप के साथ ही पाकिस्तान ने भारत को वनडे रैंकिंग में छोड़ा पीछे</strong></a></p>","content":null,"pubDate":"2022-06-13 14:35:10","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"“He’s fresh and recharged”: Aaron Finch provides Pat Cummins injury update saying he’s got over his hip injury","link":"https://thesportsrush.com/cricket-news-hes-fresh-and-recharged-aaron-finch-provides-pat-cummins-injury-update-saying-hes-got-over-his-hip-injury/","keywords":["Cricket","Aaron Finch","Australia","Australia tour of Sri Lanka 2022","Pat Cummins","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Pat Cummins injury update: The Australian Test captain will be playing an ODI after more than 18 months tomorrow. Australia have confirmed a comeback for Test captain Pat Cummins ahead of the first ODI of their ongoing tour of Sri Lanka in Pallekele. Having last played an ODI against India at home in 2020, Cummins… The post “He’s fresh and recharged”: Aaron Finch provides Pat Cummins injury update saying he’s got over his hip injury appeared first on The SportsRush.","content":"Pat Cummins injury update: The Australian Test captain will be playing an ODI after more than 18 months tomorrow. Australia have confirmed a comeback for Test captain Pat Cummins ahead of the first ODI of their ongoing tour of Sri Lanka in Pallekele. Having last played an ODI against India at home in 2020, Cummins will be playing one after more than 18 months tomorrow. With him being promoted as Australia’s Test captain last summer, Cummins has missed multiple ODIs on the back of limited availability due to niggles as his Test availability is of utmost importance now. Cummins, who has played 14 out of his 69 ODIs in Asia, has never played this format in Sri Lanka. Readers must note that Cummins’ solitary ODI against Sri Lanka had come during the ICC Cricket World Cup 2019 when he had picked bowling figures of 7.5-0-38-2 in a winning effort at The Oval. Addressing the reporters via a virtual press conference from Pallekele, Australia captain Aaron Finch confirmed Cummins’ participation for the first ODI saying that he’s “fresh and recharged” after getting over a hip injury. It is noteworthy that it is the same hip injury which curtailed Cummins’ Indian Premier League 2022 season at Kolkata Knight Riders . “He’s very keen to go. He’s fresh and recharged after getting over that hip injury,” Finch told the reporters as quoted as saying by cricket.com.au . “I think that had been lingering around for 12 or 14 months. So for him to be able to have a good solid recovering period and then a training block – he’s come here, he looks like he’s up and running.” Sound on for this one! It was Cummins v Labuschagne in the Pallekele nets ahead of the first #SLvAUS ODI pic.twitter.com/9vZKwQfX9z — cricket.com.au (@cricketcomau) June 13, 2022 With the likes of Mitchell Starc, Kane Richardson and Sean Abbott injured, Cummins playing the ODI series is a massive boost for the visitors. However, Finch considered that Cummins’ presence would contribute in the leadership department as well. “That’s a really good sign for us, to have Pat [Cummins] back around the group, not just his bowling skills but his leadership and his cricket brain I think is really important on the field as well,” Finch added. Australia Playing XI for first ODI vs Sri Lanka – 1) Aaron Finch (c) 2) David Warner 3) Steve Smith 4) Marnus Labuschagne 5) Marcus Stoinis 6) Glenn Maxwell 7) Alex Carey (wk) 8) Ashton Agar 9) Pat Cummins 10) Jhye Richardson 11) Josh Hazlewood","pubDate":"2022-06-13 14:10:22","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Exclusive: Ahead of Ranji semis, UP's Dhankar shares team's approach against Mumbai & his IPL journey with LSG","link":"https://www.indiatvnews.com/sports/cricket/exclusive-ahead-of-ranji-trophy-semifinal-uttar-pradesh-s-jasmer-dhankar-shares-his-journey-team-s-approach-against-mumbai-lucknow-super-giants-2022-06-13-784299","keywords":null,"creator":null,"video_url":null,"description":"In an exclusive interview with India TV, Uttar Pradesh's Jasmer Dhankar shared his journey in cricket. The 23-year-old who took a 3-wicket haul in his debut Ranji match against Maharashtra told about his team's approach against Mumbai in the semifinal match starting on 14th June. He also shared his experience in IPL after being selected for Lucknow Super Giants.","content":"In an exclusive interview with India TV, Uttar Pradesh's Jasmer Dhankar shared his journey in cricket. The 23-year-old who took a 3-wicket haul in his debut Ranji match against Maharashtra told about his team's approach against Mumbai in the semifinal match starting on 14th June. He also shared his experience in after being selected for Lucknow Super Giants. My journey in cricket started long back when I was 7 years old. I started playing 'Gully Cricket' in my area. My interest in the game grew more and more and all I used to think about is the game. And I was good at the game and was sure that I had to be a cricketer. The ride has not been smooth. I had to put in all the hard work and had to stay motivated even in the lows. I made my debut in Uttar Pradesh's Ranji team this year after waiting for two years. To get to play in such a team that has experienced players is a big achievement. I felt very happy. My skipper and coach were proud of me. Before the beginning of the match, they assured me that I have their support and this helped me a lot during the game. I didn't think about the result and was focused. We are going to be in the present, this is all we have planned. There is no particular strategy for the semifinal or final it's just that we all aim to show our best performances. According to me, our team has character and belief. Even though we were criticized and underestimated before the quarterfinal match. Our bond and teamwork led us to victory against all odds. The experience was wonderful. I learned a lot in terms of techniques as well as life. The journey brought a big positive change in my mindset that cricket is a part of life and should be treated like that. Apart from helping me with bowling techniques, encouraged me. He said, \"This year you didn't play(in IPL) but you never know where you will reach the next year.\" And this has been in my mind since then. I see myself playing for Team India after improving myself to a point of being settled in the team. I keep telling myself to keep improving. I think consistency, practice, and patience will help me achieve my dream. My brother Joginder who is a teacher by profession is my mentor. I would like to give him credit for always backing me through thick and thin. He has encouraged me and taught me to never give up. He keeps pushing me in my lows.","pubDate":"2022-06-13 13:48:49","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"Most Test double centuries: Most double centuries in Test cricket which batter","link":"https://thesportsrush.com/cricket-news-most-test-double-centuries-most-double-centuries-in-test-cricket-which-batter/","keywords":["Cricket","England","Joe Root","New Zealand","New Zealand tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Most Test double centuries: A legendary Australian batter holds the world record of scoring most double centuries in Test cricket. During the fourth day of the second Test of the ongoing New Zealand’s tour of England in Nottingham, former England captain Joe Root failed to convert his 27th Test century into a sixth double century.… The post Most Test double centuries: Most double centuries in Test cricket which batter appeared first on The SportsRush.","content":"Most Test double centuries: A legendary Australian batter holds the world record of scoring most double centuries in Test cricket. During the fourth day of the second Test of the ongoing New Zealand’s tour of England in Nottingham, former England captain Joe Root failed to convert his 27th Test century into a sixth double century. In what was Root’s 27th Test century, it was his 16th at home and at No. 4, 13th as a specialist batter, 10th in the second Test of a series, fourth at Trent Bridge, against New Zealand and in 2022. Root, who ended up scoring 176 (211) with the help of 26 fours and a six at a strike rate of 83.41 after resuming from his overnight score of 163*, fell short of 24 runs to complete his fourth double century at No. 4, third at home, second against New Zealand and maiden at this venue. This should be illegal. #ENGvNZ pic.twitter.com/c5NGwi10T1 — England’s Barmy Army (@TheBarmyArmy) June 13, 2022 Root, who has a highest Test score of 254 against Pakistan in Manchester, has five Test double centuries under his belt. Currently the joint sixth-highest in the list of most double centuries in Test career, Root is equaled with the likes of Graeme Smith, Rahul Dravid and Sir Alastair Cook. Had Root scored a sixth double century in the morning session today, he would’ve equaled the likes of Marvan Atapattu, Virender Sehwag, Javed Miandad, Younis Khan, Ricky Ponting and Sachin Tendulkar. As far as the world record for most Test double centuries is concerned, legendary Australia batter Sir Donald Bradman (12) holds that record even 74 years after last playing international cricket. Former Sri Lanka captain Kumar Sangakkara (11) had come close to Bradman but couldn’t manage to equal his record during the course of his 134-match Test career. Former West Indies captain Brian Lara, who played 131 Tests between 1990-2006, is third on the list with nine Test double centuries to his name. Former England batter Wally Hammond, former India captain Virat Kohli and former Sri Lanka captain Mahela Jayawardene are next on the list with seven double centuries each to their name. Readers must note that Kohli (7), Root (5), New Zealand Kane Williamson (4), former Bangladesh captain Mushfiqur Rahim (3), former Australia captain Steven Smith (3), India batter Cheteshwar Pujara (3) and former Pakistan captain Azhar Ali (3) have the most Test double centuries among active players.","pubDate":"2022-06-13 13:33:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Virat Kohli Steve Smith Controversy : जब टेस्ट मैच के दौरान भिड़ गए स्मिथ और विराट, जानें क्या था पूरा विवाद","link":"https://www.abplive.com/sports/cricket/virat-kohli-steve-smith-drs-controversy-bengaluru-test-india-vs-australia-2145349","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Virat Kohli Steve Smith Controversy Bengaluru Test India vs Australia:</strong> भारतीय क्रिकेट टीम के पूर्व कप्तान विराट कोहली और ऑस्ट्रेलियाई खिलाड़ी स्टीव स्मिथ ने इंटरनेशनल क्रिकेट में कई उपलब्धियां हासिल की हैं. इन दोनों ही खिलाड़ियों का प्रदर्शन शानदार रहा है. कोहली और स्मिथ कई मैचों में आमने-सामने आ चुके हैं. लेकिन इन दोनों के बीच हुआ एक विवाद काफी चर्चा में रहा. ऑस्ट्रेलियाई टीम 2007 में भारत दौरे पर आई थी. इस दौरान बैंगलोर टेस्ट में डीआरएस को लेकर विवाद हुआ था, जो कि काफी सुर्खियों में रहा.</p> <p style=\"text-align: justify;\">साल 2007 में भारत और ऑस्ट्रेलिया के बीच 4 टेस्ट मैचों की सीरीज खेली गई. सीरीज का पहला मैच 23 फरवरी से पुणे में खेला गया. इसके बाद दूसरा मैच बैंगलोर में 4 मार्च से आयोजित हुआ. इस मैच के दूसरे दिन स्मिथ दूसरी पारी में उमेश यादव की गेंद पर एलबीडब्ल्यू आउट हुए. उमेश की गेंद उनके पैड पर टकराई और पैड स्टम्प्स की सीध में थे. इसके बाद वे डीआरएस लेने के लिए ड्रेसिंग रूम की ओर देखने लगे. यह देख चेतेश्वर पुजारा तेजी से आगे बढ़े और स्मिथ के आगे आकर खड़े हो गए. स्मिथ की हरकत पर विराट कोहली बहुत गुस्सा हुए और उन्होंने मैदान पर इसे जाहिर भी किया.</p> <p style=\"text-align: justify;\">स्मिथ की यह हरकत काफी सुर्खियों में रही. मैच के बाद प्रेस कॉन्फ्रेंस में स्मिथ ने डीआरएस में मदद के लिए ड्रेसिंग रूम की ओर देखने को लेकर अफसोस जाहिर किया. उन्होंने कहा था, मुझे यकीनन ऐसा नहीं करना चाहिए था. मुझे ऐसा लगा जैसे मेरा दिमाग ही काम नहीं कर रहा. डीआरएस के नियमों के मुताबिक बल्लेबाज सिर्फ साथी बल्लेबाज से ही इसको लेकर सलाह ले सकता है.&nbsp;</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/ind-vs-sa-3rd-t20-live-streaming-details-when-and-where-to-watch-india-vs-south-africa-live-2145334\">IND vs SA 3rd T20: भारत के लिए करो या मरो वाला मैच, जानिए कहां देखें मुकाबले का लाइव टेलीकास्ट-लाइव स्ट्रीमिंग</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/dr-ys-rajasekhara-reddy-stadium-pitch-report-for-ind-vs-sa-3rd-t20-2145280\"><strong>IND vs SA 3rd T20: जानिए तीसरे टी20 मुकाबले में कैसी होगी पिच, विशाखापत्तनम में टी20 रिकॉर्ड भी पढ़ें</strong></a></p>","content":null,"pubDate":"2022-06-13 13:29:33","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Childhood memories translate to cricket boom in Thunder Bay, Ont., that's attracting national interest","link":"https://www.cbc.ca/news/canada/thunder-bay/thunder-bay-cricket-1.6486399?cmp=rss","keywords":null,"creator":["CBC News"],"video_url":null,"description":"Weekends at Chapples Park in Thunder Bay bring back good memories for cricket player Stefin Cyriac, who's behind a surge in popularity of cricket in the northwestern Ontario city. \"We are getting offers from different provinces in Canada to play cricket there,\" he says.","content":null,"pubDate":"2022-06-13 13:26:06","image_url":null,"source_id":"cbc","country":["canada"],"category":["sports"],"language":"english"},{"title":"Indian cricket media rights auction spills over to third day","link":"https://www.channelnewsasia.com/sport/indian-cricket-media-rights-auction-spills-over-third-day-2744231","keywords":null,"creator":null,"video_url":null,"description":null,"content":"MUMBAI : The media rights auction for the world's richest cricket league, which has media giants like Disney and Sony Corp vying for broadcast rights that could fetch India's cricket board upwards of $6 billion, has spilled over into the third day, a board official said on Monday. The online auction for television and digital broadcast rights from 2023 to 2027 to the Indian Premier League, the hugely popular two-month cricket league that draws top television ratings, began on Sunday morning and continued all day on Monday as well. The auction was likely to conclude on Tuesday, the official who declined to be named because he was not authorised to speak to the media on this subject, told Reuters. The high-stakes bidding war has Viacom 18, Reliance Industries' broadcasting joint venture, Sony Corp's India Unit and Disney, which currently owns the television and digital rights, all fighting for a piece of the cricketing pie. The current digital and television rights are held by Star India, now owned by Walt Disney Co, which paid 163.48 billion rupees ($2.09 billion) in 2017.","pubDate":"2022-06-13 13:13:16","image_url":"https://onecms-res.cloudinary.com/image/upload/s--G9OOTU6r--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2022-06-13t131033z_1_lynxmpei5c0i7_rtroptp_3_cricket-ipl-rights.jpg?itok=BCXjz6dn","source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"IND vs SA 3rd T20: भारत के लिए करो या मरो वाला मैच, जानिए कहां देखें मुकाबले का लाइव टेलीकास्ट-लाइव स्ट्रीमिंग","link":"https://www.abplive.com/sports/cricket/ind-vs-sa-3rd-t20-live-streaming-details-when-and-where-to-watch-india-vs-south-africa-live-2145334","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs South Africa:</strong> भारत और दक्षिण अफ्रीका के बीच 5 टी20 मैचों की सीरीज का तीसरा मुकाबला मंगलवार को डॉ. वाईएस राजशेखर रेड्डी एसीए-वीडीसीए क्रिकेट स्टेडियम, विशाखापत्तनम में खेला जाएगा. भारत सीरीज के पहले दो मुकाबले हार चुकी है, ऐसे में यह मैच पंत की सेना के लिए करो या मरो वाला होगा. भारत इस मुकाबले को जीतकर सीरीज में बनी रहना चाहेगी. वहीं मेहमान टीम की नजर इस मुकाबले को जीतकर सीरीज अपने नाम करने पर होगी.</p> <p style=\"text-align: justify;\"><strong>लाइव टेलीकास्ट और लाइव स्ट्रीमिंग</strong><br />भारत और दक्षिण अफ्रीका के बीच तीसरे टी20 मैच का लाइव प्रसारण स्टार स्पोर्ट्स नेटवर्क पर होगा. मैच Star Sports 1, Star Sports 1 HD, Star Sports 3 और Star Sports 3 HD पर प्रसारित होगा. फैंस मैच की ऑनलाइन लाइव स्ट्रीमिंग Disney+ Hotstar पर देख सकते हैं. हालांकि, ऐप पर मैच को लाइव देखने के लिए दर्शकों को प्रीमियम सब्सक्रिप्शन की जरूरत होती है.</p> <p style=\"text-align: justify;\"><strong>तीसरे मैच का शेड्यूल</strong></p> <ul> <li style=\"text-align: justify;\"><strong>तारीख:</strong> 14 जून 2022 (मंगलवार)</li> <li style=\"text-align: justify;\"><strong>स्टेडियम:</strong> वाईएस राजशेखर रेड्डी स्टेडियम, विशाखापट्नम</li> <li style=\"text-align: justify;\"><strong>समय:</strong> शाम 7 बजे&nbsp;</li> <li style=\"text-align: justify;\"><strong>टॉस:</strong> 6:30 बजे</li> </ul> <p style=\"text-align: justify;\"><strong>दोनों टीमें इस प्रकार हैं</strong></p> <ul> <li style=\"text-align: justify;\"><strong>भारतीय टीम:</strong> ऋषभ पंत (कप्तान), ऋतुराज गायकवाड़, ईशान किशन, दीपक हूडा, श्रेयस अय्यर, दिनेश कार्तिक, हार्दिक पांड्या, वेंकटेश अय्यर, युजवेंद्र चहल, कुलदीप यादव, अक्षर पटेल, रवि बिश्नोई, भुवनेश्वर कुमार, हर्षल पटेल, आवेश खान, अर्शदीप सिंह, उमरान मलिक.</li> <li style=\"text-align: justify;\"><strong>दक्षिण अफ्रीका:</strong> एडेन मारक्रम, डेविड मिलर, रस्सी वैन डेर ड्यूसेन, रेजा हेन्ड्रिक्स, तेम्बा बावुमा, ट्रिस्टन स्टब्स, द्वैत प्रीटोरियस, मार्को जानसेन, हेनरिक क्लासेन, क्विंटन डी कॉक, एनरिक नॉर्खिया, कगिसो रबाडा, केशव महाराज, लुंगी नागिदी, तबरेज शम्सी, वेन पार्नेल.</li> </ul> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/joe-root-created-history-became-first-batsman-3000-runs-in-world-test-championship-history-2145312\">Joe Root ने रचा इतिहास, विश्व टेस्ट चैंपियनशिप के इतिहास में ऐसा करने वाले पहले बल्लेबाज बने</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/virat-kohli-returns-from-holiday-with-family-anushka-sharma-vamika-kohli-maldives-vacations-2145235\">Virat Kohli &amp; Anushka Sharma: परिवार संग छुट्टियां मनाकर लौटे विराट कोहली, वामिका भी आई नजर</a></strong></p>","content":null,"pubDate":"2022-06-13 13:12:18","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"}]}