{"newsArray":[{"title":"Warnie’s Favourite Commentary Moment Ep. 5","link":"https://www.cairnspost.com.au/sport/warnies-favourite-commentary-moment-ep-5/video/2f4c2ee9703825ad2d69d0d7800a915c","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Shane Warne recalls his favourite moment in the commentary box.","content":null,"pubDate":"2022-01-13 22:40:09","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Quality Time with Mel Jones and 4WD Supacentre – Episode 5","link":"https://www.cairnspost.com.au/sport/quality-time-with-mel-jones-and-4wd-supacentre-episode-5/video/088962bb66c0f2a1e2e4356df6a884fe","keywords":["Sport news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Brendon Julian sits down with respected cricket commentator and former Australian champion Mel Jones.","content":null,"pubDate":"2022-01-13 22:40:08","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Proteas take control despite Pant ton in dramatic day","link":"https://www.news.com.au/sport/cricket/proteas-take-control-despite-pant-ton-in-dramatic-day/video/5ead0e5d5f50a81fa05ee09fc4e84acc","keywords":null,"creator":null,"video_url":null,"description":"Cricket: Despite a stellar century from Rishabh Pant, the Proteas are on the verge of claiming a famous series win against India.","content":null,"pubDate":"2022-01-13 21:44:05","full_description":null,"image_url":null,"source_id":"news"},{"title":"Proteas take control despite Pant ton in dramatic day","link":"https://www.cairnspost.com.au/sport/cricket/proteas-take-control-despite-pant-ton-in-dramatic-day/video/5ead0e5d5f50a81fa05ee09fc4e84acc","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Despite a stellar century from Rishabh Pant, the Proteas are on the verge of claiming a famous series win against India.","content":null,"pubDate":"2022-01-13 21:44:05","full_description":null,"image_url":null,"source_id":"cairnspost"},{"title":"Glen Maxwell stars in Melbourne Derby","link":"https://www.news.com.au/sport/cricket/glen-maxwell-stars-in-melbourne-derby/video/25c007f5d093b5730637393e5b5fbe9b","keywords":null,"creator":null,"video_url":null,"description":"Cricket: An unbeaten half century from Glenn Maxwell has led the Melbourne Stars to a comfortable six wicket win over the Melbourne Renegades.","content":null,"pubDate":"2022-01-13 21:28:09","full_description":null,"image_url":null,"source_id":"news"},{"title":"Glen Maxwell stars in Melbourne Derby","link":"https://www.cairnspost.com.au/sport/cricket/glen-maxwell-stars-in-melbourne-derby/video/25c007f5d093b5730637393e5b5fbe9b","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: An unbeaten half century from Glenn Maxwell has led the Melbourne Stars to a comfortable six wicket win over the Melbourne Renegades.","content":null,"pubDate":"2022-01-13 21:28:09","image_url":null,"source_id":"cairnspost"},{"title":"Tim Paine escapes Ashes glare by leaving Tasmania on sun-kissed holiday","link":"https://www.foxsports.com.au/cricket/the-ashes/tim-paine-escapes-ashes-glare-by-leaving-tasmania-on-sunkissed-holiday/news-story/503fb00fc68b17ed3bdff4027f54334d","keywords":null,"creator":null,"video_url":null,"description":"Tim Paine’s wife Bonnie has posted photos of their beachside getaway as the former Australian cricket captain and his family travelled north to play in some sun and sand before the fifth Ashes Test gets underway in his home state of Tasmania today.","content":null,"pubDate":"2022-01-13 21:14:00","full_description":"Tim Paine’s wife Bonnie has posted photos of their beachside getaway as the former Australian cricket captain and his family travelled north to play in some sun and sand before the fifth Ashes Test gets underway in his home state of Tasmania today. Earlier in the week it emerged Paine, who stood down as captain and took time away from cricket after his sexting scandal came to light in November , would not be in Hobart for the historic occasion as Tasmania hosts its first ever Ashes Test. The Daily Telegraph reported the wicketkeeper decided it would be better for his wellbeing to be out of town when the Ashes arrived on his doorstep and he and his family took a trip interstate. Bonnie uploaded a series of happy snaps to Instagram on Thursday of the family's holiday, captioning her post “R&R” with sun, palm tree and water emojis. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Looks like the perfect spot for a dip. Photo: Instagram. Source: Instagram What a view. Photo: Instagram. Source: Instagram Paine never got an opportunity to play Test cricket at his home ground. He played 20 Tests on Australian soil between 2017 and 2021, but none in the island state. Australia was scheduled to take on Afghanistan at Bellerive Oval in November, but the historic fixture was yet again postponed after the Taliban’s takeover. However, when a Perth Ashes Test became untenable due to Western Australia’s strict border protocols, Cricket Australia moved the marquee fixture to Hobart. Harris dropped from Aussie squad | 02:09 Entering the twilight of his professional career, most cricket pundits assumed the 2021/22 summer would be Paine’s last in the national set-up. A day-night Ashes Test at his beloved Bellerive Oval would have been the perfect send-off for Paine, the poster boy of Australian cricket following the infamous ball-tampering saga of 2018. “It will be a very proud moment for me to lead the Australian Test side (in Hobart),” Paine told reporters in May. “It’s exciting for boys and girls around Tasmania to have the best players in Australia and the world up close. “Since I’ve had the job I’ve thought in the back of mind that it would be an amazing feeling to lead Australia out here. “When my career is done and dusted, I think this is going to be a moment that I hold right up there.” Who doesn't like relaxing by the pool? Photo: Instagram. Source: Instagram Cheers! Photo: Instagram. Source: Instagram South Australian gloveman Alex Carey replaced Paine ahead of the Ashes series and the 30-year-old pouched eight chances in the Brisbane Test to break the all-time record for most catches on debut. But wicketkeeping in Test cricket is no easy task — Carey has since missed several chances behind the stumps while averaging 15.71 with the bat after seven knocks.","image_url":null,"source_id":"foxsports"},{"title":"Paines play to escape Ashes limelight","link":"https://www.news.com.au/sport/cricket/tim-paine-wife-escape-ashes-glare-by-leaving-tasmania-on-sunkissed-holiday/news-story/be990dd2dbfbbd893508181298676eb3","keywords":null,"creator":null,"video_url":null,"description":"Tim Paine’s wife Bonnie has posted photos of their family’s beachside getaway as the former Australian cricket captain travelled north before the fifth Ashes Test gets underway in his home state of Tasmania today.","content":null,"pubDate":"2022-01-13 20:35:00","full_description":"Tim Paine’s wife Bonnie has posted photos of their beachside getaway as the former Australian cricket captain and his family travelled north to play in some sun and sand before the fifth Ashes Test gets underway in his home state of Tasmania today. Earlier in the week it emerged Paine, who stood down as captain and took time away from cricket after his sexting scandal came to light in November , would not be in Hobart for the historic occasion as Tasmania hosts its first ever Ashes Test. The Daily Telegraph reported the wicketkeeper decided it would be better for his wellbeing to be out of town when the Ashes arrived on his doorstep and he and his family took a trip interstate. Bonnie uploaded a series of happy snaps to Instagram on Thursday of the family's holiday, captioning her post “R&R” with sun, palm tree and water emojis. Paine never got an opportunity to play Test cricket at his home ground. He played 20 Tests on Australian soil between 2017 and 2021, but none in the island state. Australia was scheduled to take on Afghanistan at Bellerive Oval in November, but the historic fixture was yet again postponed after the Taliban’s takeover. However, when a Perth Ashes Test became untenable due to Western Australia’s strict border protocols, Cricket Australia moved the marquee fixture to Hobart. Entering the twilight of his professional career, most cricket pundits assumed the 2021/22 summer would be Paine’s last in the national set-up. A day-night Ashes Test at his beloved Bellerive Oval would have been the perfect send-off for Paine, the poster boy of Australian cricket following the infamous ball-tampering saga of 2018. “It will be a very proud moment for me to lead the Australian Test side (in Hobart),” Paine told reporters in May. “It’s exciting for boys and girls around Tasmania to have the best players in Australia and the world up close. “Since I’ve had the job I’ve thought in the back of mind that it would be an amazing feeling to lead Australia out here. “When my career is done and dusted, I think this is going to be a moment that I hold right up there.” South Australian gloveman Alex Carey replaced Paine ahead of the Ashes series and the 30-year-old pouched eight chances in the Brisbane Test to break the all-time record for most catches on debut. But wicketkeeping in Test cricket is no easy task — Carey has since missed several chances behind the stumps while averaging 15.71 with the bat after seven knocks. Adelaide Strikers leg-spinner Rashid Khan has joined the chorus of players calling for the Big Bash League to make a change. Almost certain defeat has been turned into a stunning victory in the space of four balls as one of the BBL’s hottest teams was stunned. The Sydney Thunder and Sydney Sixers are preparing to meet at the SCG for the last BBL|11 regular season game to be held in Sydney.","image_url":null,"source_id":"news"},{"title":"“Nasser Hussain’s team lost it in 11 days”: Shane Warne exclaims Joe Root-led England Team is not the worst to have toured Australia","link":"https://thesportsrush.com/cricket-news-nasser-hussains-team-lost-it-in-11-days-shane-warne-exclaims-joe-root-led-england-team-is-not-the-worst-to-have-toured-australia/","keywords":["Cricket","Ashes","Shane Warne"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Shane Warne exclaims Joe Root-led England Team isn’t the worst side to have toured Australia despite losing the Ashes series within 12 days. The England Men’s Cricket team have now lost their third successive Ashes series on Australian soil with a shambolic loss by an innings and 14 runs at the iconic Melbourne Cricket Ground (MCG) in… The post “Nasser Hussain’s team lost it in 11 days”: Shane Warne exclaims Joe Root-led England Team is not the worst to have toured Australia appeared first on The SportsRush.","content":"Shane Warne exclaims Joe Root-led England Team isn’t the worst side to have toured Australia despite losing the Ashes series within 12 days. The England Men’s Cricket team have now lost their third successive Ashes series on Australian soil with a shambolic loss by an innings and 14 runs at the iconic Melbourne Cricket Ground (MCG) in the Boxing Day Test. Having already lost the urn, they did show some grit and resistance during the 4th Test match at the Sydney Cricket Ground (SCG) to manage a Draw, and thereby save themselves from the humiliation of yet another series whitewash Down Under. Such was England’s show in the ongoing series that it took them mere 12 days for the Aussies to retain the coveted Ashes urn. In fact, the English team spent more time in isolation with regards to the COVID-19 protocols, than it took them to lose the urn and the series. It is worth mentioning that England had lost the 2013-14 Ashes series 5-0 (5) and then the 2017-18 series 4-0 (5)- their two previous tours Down Under. #Ashes pic.twitter.com/rDJDIey0Nz — Shane Warne (@ShaneWarne) December 28, 2021 Shane Warne exclaims current England side isn’t the worst to tour During an interaction with talkSPORT, Australia’s legendary spinner Shane Warne decided to cut some slack to the current England Test side and blamed it mostly on the selectors for their dismal performance Down Under. Upon asked whether the current England side, led by Joe-Root is the worst to have ever toured Australia, Warne was quick to point out that it was Nasser Hussain’s England side which was the worst, as they had lost the Ashes in mere 11 days, which is one day short of what Root and his men took. “They’ve lost the Ashes in 12 days, so it’s not a record. I think Nasser’s Hussain’s team lost it in 11. I don’t think it’s the worst team either to have toured Australia, but I think it is one of the worst teams with respect to the decisions that they’ve made in pure Cricket terms with selections (of some players),” Warne exclaimed. Nasser Hussain-led England Team had lost the Ashes series 1-4 back during the 2002/03 season. It took them mere 11 days to lose the urn with three innings defeats and the 4th Test defeat by 5 wickets. They however, did win the final Test at the SCG by 225 runs. Shane Warne was the 4th highest wicket-taker in that series with 14 wickets in 6 innings. at an average of 24.78.     The post “Nasser Hussain’s team lost it in 11 days”: Shane Warne exclaims Joe Root-led England Team is not the worst to have toured Australia appeared first on The SportsRush.","pubDate":"2022-01-13 19:28:38","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"‘It’s no surprise’: Crazy numbers behind Australia’s obsession with cricket this summer","link":"https://www.foxsports.com.au/cricket/its-no-surprise-crazy-numbers-behind-australias-obsession-with-cricket-this-summer/news-story/e5874993bb3b8d43dcf3d9ffdba569b5","keywords":null,"creator":null,"video_url":null,"description":"New research has found just how obsessed Australians are with cricket, with over three million people declaring the sport one of their top interests.","content":null,"pubDate":"2022-01-13 19:00:00","full_description":"New research has found just how obsessed Australians are with cricket, with over three million people declaring the sport one of their top interests. Almost four in ten (38 per cent) Aussies and 81 per cent of cricket fans have revealed they would trade a birthday or a wedding to watch the Boxing Day Test. One in five (22 per cent) of full-time workers would skip a day at the office to tune into the action at the MCG. Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now. Almost a quarter (24 per cent) of working Aussies have confessed to calling in sick so they can watch a match throughout the summer, while 21 per cent of people watch the cricket while at work. More than half of cricket fans living in New South Wales (73 per cent) and Victoria (70 per cent) admit they have prioritised the cricket over a date, exercise, and a good night of sleep. Scott Boland of Australia celebrates the wicket of Jonny Bairstow of England caught by Marnus Labuschagne of Australia during day five of the fourth Test. Getty Source: Getty Images “It’s no surprise Aussies are absolutely loving the cricket this summer,” Fox Cricket general manager Matt Weiss said. “It has been an enthralling Ashes series thus far and there’s still plenty of action to come. It is interesting to see how our viewing habits have changed, we are taking cricket with us wherever we go.” There was also an audience peak of 758,000 across Foxtel and Kayo in the final session of play in the Sydney Test. The Women’s Ashes Series and BBL finals later this month, all live on Foxtel.","image_url":null,"source_id":"foxsports"},{"title":"S Africa's Van Niekerk out of World Cup","link":"https://thewest.com.au/sport/world-cup-soccer/s-africas-van-niekerk-out-of-world-cup-c-5299986","keywords":null,"creator":["AAP"],"video_url":null,"description":"South African captain Dane van Niekerk is out of the Women's Cricket World Cup with a broken ankle she suffered in an accident at home.","content":null,"pubDate":"2022-01-13 18:42:31","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5299986/3068340e85e35d2aefd7dbf926a737978b8a4fc0-16x9-x0y0w1280h720.jpg","source_id":"thewest"},{"title":"S Africa's Van Niekerk out of World Cup","link":"https://www.perthnow.com.au/sport/world-cup-soccer/s-africas-van-niekerk-out-of-world-cup-c-5299988","keywords":null,"creator":["AAP"],"video_url":null,"description":"South African captain Dane van Niekerk is out of the Women's Cricket World Cup with a broken ankle she suffered in an accident at home.","content":null,"pubDate":"2022-01-13 18:42:31","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5299988/3068340e85e35d2aefd7dbf926a737978b8a4fc0-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"AUS vs ENG Dream11 Team Prediction, Fantasy Cricket Hints Australia vs England: Captain, Probable Playing 11s, Team News; Injury Updates For the 5th Test of the Ashes 2021-22 at Blundstone Arena in Bellerive, 9:30 AM IST January 14","link":"https://zeenews.india.com/cricket/aus-vs-eng-dream11-team-prediction-fantasy-cricket-hints-australia-vs-england-captain-probable-playing-11s-team-news-injury-updates-for-the-5th-test-of-the-ashes-2021-22-at-blundstone-arena-in-bellerive-930-am-ist-january-14-2427677.html","keywords":null,"creator":null,"video_url":null,"description":"Check AUS vs ENG Dream11 Team Prediction for Australia vs England Ashes fifth Test.","content":null,"pubDate":"2022-01-13 16:54:00","full_description":"England and Australia will battle it out in the final Test match of the Ashes 2021-22, The fourth Test ended in a draw after a great performance from both the sides. However, England have already lost the series but will not give Australia anything extra or a whitewash chance easily. England before the fourth Test were nowhere near the potential and level they have in their squad. On the other hand, Australia have dominated this series with an astonishing performance in every game they played. England will look to win atleast one match of the series after a horrific performance and give the English fans a little hope for future. Toss : The 5th AUS vs ENG Test of the Ashes toss between Australia and England will take place at 9:30 AM IST – January 14. Match Time : 9:30 AM IST Venue : Blundstone Arena in Bellerive Wicketkeeper : Alex Carey, Sam Billings Batters : David Warner, Usman Khawaja, Haseeb Hameed, Zak Crawley All-rounders: Chris Woakes, Cameron Green Bowlers: Stuart Broad, Jimmy Anderson, Mark Wood Captain: Usman Khawaja Vice-Captain : David Warner Australia : Usman Khawaja, David Warner, Marnus Labuschagne, Steve Smith, Travis Head, Cameron Green, Alex Carey (wk), Pat Cummins (c), Mitchell Starc, Nathan Lyon, Scott Boland/Jhye Richardson. England : Haseeb Hameed/Rory Burns, Zak Crawley, Dawid Malan, Joe Root (c), Ben Stokes, Jonny Bairstow/Ollie Pope, Sam Billings, Mark Wood, Jack Leach/Ollie Robinson, Stuart Broad, Jimmy Anderson/Chris Woakes. Check Dream11 Prediction/ AUS Dream11 Team/ ENG Dream11 Team/ AUSTRALIA Dream11 Player List/ ENGLAND Dream11 Player List/ Dream11 Guru Tips – Australia vs England/ Fantasy Cricket Tips and more.","image_url":null,"source_id":"zeenews"},{"title":"HIGHLIGHTS | India vs South Africa Score 3rd Test, Day 3: Bumrah Removes Elgar To Give India Renewed Hope - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi5gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2hpZ2hsaWdodHMtY3JpY2tldC1zY29yZS1pbmRpYS12cy1zb3V0aC1hZnJpY2Etc2NvcmUtM3JkLXRlc3QtZGF5LTMtc2NvcmVjYXJkLWluZC1uZXdsYW5kcy1jYXBlLXRvd24tc2EtdnMtaW5kLWhpZ2hsaWdodHMtaG90c3Rhci1iYWxsLWJ5LWJhbGwtY29tbWVudGFyeS12aXJhdC1rb2hsaS1yaXNoYWJoLXBhbnQtYXNod2luLWJ1bXJhaC01MTgzNTkwL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"HIGHLIGHTS | India vs South Africa Score 3rd Test, Day 3: Bumrah Removes Elgar To Give India Renewed Hope  India.comQuick Edit: What will be a good total for Team India to post vs South Africa in Cape Town?  Times of IndiaLive Blog Cricket Score - South Africa vs India, 3rd Test, Day 3 | Cricbuzz.com - Cricbuzz  CricbuzzRishabh Pant century sets SA target of 212 for victory  Eyewitness News`Whole country against us`: Angry Virat Kohli accuses Supersport TV crew on stump mic for rigging DRS - WAT...  Zee NewsView Full coverage on Google News","content":null,"pubDate":"2022-01-13 16:49:19","image_url":null,"source_id":"google"},{"title":"“Focus on your team”: Virat Kohli fumes at stump mic after Dean Elgar survives DRS call in Newlands Test","link":"https://thesportsrush.com/cricket-news-focus-on-your-team-virat-kohli-fumes-at-stump-mic-after-dean-elgar-survives-drs-call-in-newlands-test/","keywords":["Cricket","India Cricket Team","Videos","Dean Elgar","India","India tour of South Africa 2021-22","South Africa","Virat Kohli"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Virat Kohli fumes at stump mic: The Indian captain didn’t care to control his anger after a decision went against him at the Newlands. During the third day of the third Test of the ongoing India’s tour of South Africa in Cape Town, anger got the better of India captain Virat Kohli especially after South… The post “Focus on your team”: Virat Kohli fumes at stump mic after Dean Elgar survives DRS call in Newlands Test appeared first on The SportsRush.","content":"Virat Kohli fumes at stump mic: The Indian captain didn’t care to control his anger after a decision went against him at the Newlands. During the third day of the third Test of the ongoing India’s tour of South Africa in Cape Town, anger got the better of India captain Virat Kohli especially after South Africa captain Dean Elgar luckily survived a DRS decision. Chasing a 212-run target, South Africa have made apt strides towards what will be the third-highest Test run-chase at Newlands. The last innings of the series also became victim to players exchanging words on the field. Kohli, who has a knack of being in the opposition’s ears, tried his best to dismantle Elgar and Keegan Petersen with his words. However, it was one particular incident which didn’t end up going too well with Kohli. It was in the 21st over when India spinner Ravichandran Ashwin had found Elgar wanting in front of the stumps. With the batter opting to challenge the umpire’s decision, DRS worked in Elgar’s favour as replays confirmed that the ball would have missed the stumps. In a decision which didn’t appear to get overturned at first, ball tracking ruling the decision in Elgar’s favour was doubtlessly surprising. It was soon enough that Kohli walked to the stumps to hurl an unnecessary comment targeted at the stump mic. “Focus on your team as well when they shine the ball, eh, not just the opposition. Trying to catch people all the time,” Kohli was heard on the stump mic. Virat Kohli fumes at stump mic in Newlands Test “Fcuking camera team” “Supersport is a joke” “focus on your team as well as they shine the ball eh not just the opposition. trying to catch people all the time” Kohli is angry as hell pic.twitter.com/KYFyM8BUPP — Samriddhi (@kollyscharm) January 13, 2022 Twitter reactions on Virat Kohli: If you released the last 30 mins of Team India on the stump mic, it would be a chart topper album for weeks #SAvsIND — Gaurav Kapur (@gauravkapur) January 13, 2022 Unnecessary comment , accept and play on please #INDvsSA — Shreevats goswami (@shreevats1) January 13, 2022 You can’t blame VK if he loses it right now. This looks ridiculous. If that ball wasn’t hitting the stumps, then God bless those ball-tracking devices. — KSR (@KShriniwasRao) January 13, 2022 How on earth was that missing? — Sambit Bal (@sambitbal) January 13, 2022 Everyone is sledger untill real sledger arrives unnecessary behaviour from captain not liked it.#DeanElgar #ViratKohli #SAvIND #WTC23 #CricketTwitter pic.twitter.com/QPic0mQqQR — Rudhra Nandu (@rudhranandu) January 13, 2022 For more cricket-related news, click here. The post “Focus on your team”: Virat Kohli fumes at stump mic after Dean Elgar survives DRS call in Newlands Test appeared first on The SportsRush.","pubDate":"2022-01-13 16:07:02","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"IND vs SA: Virat Kohli Faces Criticism On Twitter For 'Unnecessary' Remark At Broadcasters - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kLXZzLXNhLXZpcmF0LWtvaGxpcy1mYWNlcy1jcml0aWNpc20tb24tdHdpdHRlci1mb3ItdW5uZWNlc3NhcnktcmVtYXJrLWF0LWJyb2FkY2FzdGVycy00NjU0MjIwLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"IND vs SA: Virat Kohli Faces Criticism On Twitter For 'Unnecessary' Remark At Broadcasters  News18India vs South Africa 3rd Test Day 3, Highlights: Bumrah gets Elgar; South Africa 101/2 at stumps  Times of IndiaDean Elgar LBW controversy: What Virat Kohli and Co had to say as picked up on the stump mic  Scroll.inProteas roar back at Newlands to set up epic series finish with Kohli, India fired up  News24IND vs SA: Watch - Virat Kohli Kicks In Air, Shows Frustration After DRS Overturns Dean Elgar Wicket  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-01-13 15:50:01","image_url":null,"source_id":"google"},{"title":"ICC Under-19 World Cup 2022 Live Streaming West Indies U19 vs Australia U19: How and Where to Watch WI vs AUS","link":"https://www.indiatvnews.com/sports/cricket/icc-under-19-world-cup-2022-live-streaming-west-indies-u19-vs-australia-u19-how-and-where-to-watch-wi-vs-aus-2022-01-13-754296","keywords":null,"creator":null,"video_url":null,"description":"ICC Under-19 World Cup 2022 Live Streaming West Indies U19 vs Australia U19: How and Where to Watch WI vs AUS The 2022 ICC Under-19 World Cup will be held in the West Indies between January 14-5 February with 16 teams taking part in the mega event. In what will be the 14th edition of the U-19 Cricket World Cup. The tournament comprises 48 ODIs and will be played in Antigua, Guyana, Saint Kitts and Trinidad with Antigua hosting the final.","content":null,"pubDate":"2022-01-13 15:48:28","full_description":"West Indies U19 vs Australia U19 1st Match, Group D Providence Stadium, Guyana 7:30 PM Star Sports will Live Telecast the ICC U19 ODI World Cup in India. You can watch the Live Streaming of matches on Disney+ Hotstar Ackeem Auguste (c), Giovonte Depeiza (VC), Onaje Amory, Rivaldo Clarke, Jordan Johnson, Johann Layne, Anderson Mahase Matthew Nandu, Teddy Bishop, Carlon Bowen-Tuckett, Jaden Carmichael, McKenny Clarke, Shaqkere Parris, Isai Thorne, Shiva Sankar Cooper Connolly (c), Campbell Kellaway, Corey Miller, Jack Nisbet, Nivethan Radhakrishnan, Harkirat Bajwa, Aidan Cahill, Joshua Garner, Isaac Higgins, Jackson Sinfield, William Salzmann, Lachlan Shaw, Tobias Snell, Tom Whitney, Teague Wyllie","image_url":null,"source_id":"indiatvnews"},{"title":"Bhanuka Rajapaksa withdraws decision to retire from international cricket","link":"https://www.business-standard.com/article/sports/bhanuka-rajapaksa-withdraws-decision-to-retire-from-international-cricket-122011301423_1.html","keywords":null,"creator":null,"video_url":null,"description":"Ten days after announcing his retirement from international cricket, batter Bhanuka Rajapaksa has made himself available to play for Sri Lanka \"for years to come.\" The 30-year-old had tendered his letter of resignation to Sri Lanka Cricket (SLC) on January 3. However, after meeting the Sri Lankan Sports Minister Namal Rajapaksa recently, the Southpaw has changed his mind. \"Pursuant to a meeting with the Hon. Namal Rajapaksa Minister of Youth & Sports and after consulting with the National Selectors, Bhanuka Rajapaksa has notified SLC that he wishes to withdraw his resignation which he tendered to SLC on 3rd Jan. 2022, with immediate effect,\" a SLC stated in a media release. \"In his letter to SLC withdrawing his resignation, he further states that he wishes to represent his country in the game he loves for the years to come,\" it added. In his initial letter, Rajapaksa had cited family obligations as the key reason for his resignation. \"I have very carefully considered my position","content":null,"pubDate":"2022-01-13 15:47:00","full_description":"Ten days after announcing his retirement from international cricket, batter Bhanuka Rajapaksa has made himself available to play for Sri Lanka \"for years to come.\" The 30-year-old had tendered his letter of resignation to Sri Lanka Cricket (SLC) on January 3. However, after meeting the Sri Lankan Sports Minister Namal Rajapaksa recently, the Southpaw has changed his mind. \"Pursuant to a meeting with the Hon. Namal Rajapaksa Minister of Youth & Sports and after consulting with the National Selectors, Bhanuka Rajapaksa has notified SLC that he wishes to withdraw his resignation which he tendered to SLC on 3rd Jan. 2022, with immediate effect,\" a SLC stated in a media release. \"In his letter to SLC withdrawing his resignation, he further states that he wishes to represent his country in the game he loves for the years to come,\" it added. In his initial letter, Rajapaksa had cited family obligations as the key reason for his resignation. \"I have very carefully considered my position as a player, husband and am taking this decision looking forward to fatherhood and associated familial obligations,\" Rajapaksa had written. Rajapaksa has so far represented Sri Lanka in five ODIs and 18 T20Is, scoring a total of runs 409 across formats which included three fifties. He was part of Sri Lanka's T20 World Cup 2021 squad and finished as the third-highest run-scorer for his team with 155 runs from eight matches. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220113/thumb-122011301423.jpg","source_id":"business-standard"},{"title":"\"Cutie Bowling Hai\": Rishabh Pant's Unique Praise For Ravichandran Ashwin During Cape Town Test Caug.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMirQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9jdXRpZS1ib3dsaW5nLWhhaS1yaXNoYWJoLXBhbnRzLXVuaXF1ZS1wcmFpc2UtZm9yLXJhdmljaGFuZHJhbi1hc2h3aW4tZHVyaW5nLWNhcGUtdG93bi10ZXN0LWNhdWdodC1vbi1zdHVtcC1taWMtMjcwNjg1NdIBswFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9jdXRpZS1ib3dsaW5nLWhhaS1yaXNoYWJoLXBhbnRzLXVuaXF1ZS1wcmFpc2UtZm9yLXJhdmljaGFuZHJhbi1hc2h3aW4tZHVyaW5nLWNhcGUtdG93bi10ZXN0LWNhdWdodC1vbi1zdHVtcC1taWMtMjcwNjg1NS9hbXAvMQ?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Cutie Bowling Hai\": Rishabh Pant's Unique Praise For Ravichandran Ashwin During Cape Town Test Caug..  NDTVSports.comRishabh Pant's counter-attacking knock in 3rd Test one of his best: Ashish Nehra  Cricbuzz`Rishabh Pant shutting everyone`s mouth`: Virender Sehwag, others praise batter after century in Cape Town  Zee NewsIND vs SA: Twitter Goes Crazy As Rishabh Pant Smashes A Fantabulous Century At Cape Town As Other Indian Batsmen Struggle  Cricket Addictor'It's unheard of': India becomes first batting line-up to record bizarre trivia in 145-year Test history  Hindustan TimesView Full coverage on Google News","content":null,"pubDate":"2022-01-13 15:46:16","image_url":null,"source_id":"google"},{"title":"Bellerive Oval Hobart weather: What is the weather forecast for Australia vs England 5th Test Day 1?","link":"https://thesportsrush.com/cricket-news-bellerive-oval-hobart-weather-what-is-the-weather-forecast-for-australia-vs-england-5th-test-day-1/","keywords":["Cricket","Ashes","Australia","England"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Bellerive Oval Hobart weather: The SportsRush presents before you the weather prediction for Day 1 of fifth AUS vs ENG Test. The fifth Test match of the ongoing Ashes 2021-22 will commence between Australia and England from tomorrow. In what will be the first occasion of a couple of day-night Tests in an Ashes series,… The post Bellerive Oval Hobart weather: What is the weather forecast for Australia vs England 5th Test Day 1? appeared first on The SportsRush.","content":"Bellerive Oval Hobart weather: The SportsRush presents before you the weather prediction for Day 1 of fifth AUS vs ENG Test. The fifth Test match of the ongoing Ashes 2021-22 will commence between Australia and England from tomorrow. In what will be the first occasion of a couple of day-night Tests in an Ashes series, it will also be the first-ever Ashes Test to be played in Hobart. With the Bellerive Oval set to host a Test match after more than half-a-decade, only four Australian players were part of the Australia vs South Africa Test match which had been played in 2016. Australia might have lost that match by an innings and 80 runs but they otherwise have a stellar Test record in Hobart winning nine out of their 13 Tests at this venue. All smiles ahead of the last Ashes Test match here in Hobart pic.twitter.com/en5yoXnB0F — Steve Smith (@stevesmith49) January 13, 2022 While Australia have confirmed the axing of opening batter Marcus Harris, England have decided to wait for the toss to announce their Playing XI. Fans should expect the visitors to make multiple changes to their Playing XI for this dead-rubber. Bellerive Oval Hobart weather Had it been a usual morning start to a Test match in Australia, a large part of play time would’ve happened before the scheduled time of rainfall. In case of a day-night match, expect rain to play spoilsport at the Bellerive Oval tomorrow. The first session will be played with a rain probability of as high as 59%. Going by AccuWeather’s weather prediction, it would be a surprise if there isn’t any rain interruption in the afternoon session on Day 1. ALSO READ: Shane Warne reacts to drenched Hobart cricket stadium’s images As expected, the weather will decrease slightly in the evening session but the rain probability will remain in the aforementioned range towards the evening as well. The rain probability will decrease but only by 14% in the night session. In such a scenario, expect rain to pour down in Hobart on Friday. Hobart hourly weather 03:00 PM – 20 degree (Showers). 04:00 PM – 20 degree (Cloudy). 05:00 PM – 20 degree (Showers). 06:00 PM – 19 degree (Showers). 07:00 PM – 19 degree (Cloudy). 08:00 PM – 18 degree (Cloudy). 09:00 PM – 18 degree (Showers). 10:00 PM – 17 degree (Showers). 11:00 PM – 17 degree (Mostly Cloudy). The post Bellerive Oval Hobart weather: What is the weather forecast for Australia vs England 5th Test Day 1? appeared first on The SportsRush.","pubDate":"2022-01-13 15:41:58","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"U-19 WC: India Head Coach Hrishikesh Kanitkar Hails Captain Yash Dhull","link":"https://sports.ndtv.com/cricket/icc-u-19-cricket-world-cup-india-head-coach-hrishikesh-kanitkar-hails-yash-dhull-says-young-captain-can-make-own-decisions-2706818","keywords":null,"creator":null,"video_url":null,"description":"ICC U-19 Cricket World Cup: India head coach Hrishikesh Kanitkar had special praise for Yash Dhull, who will be captaining the national side in the showpiece event.","content":null,"pubDate":"2022-01-13 15:30:51","full_description":"India U-19 head coach Hrishikesh Kanitkar on Thursday hailed skipper Yash Dhull, saying the young skipper can take his own decisions and his instincts will hold him in good stead at the upcoming World Cup. India will lock horns against South Africa in their opening match of the U-19 World Cup on Saturday in Guyana and then the side will lock horns against Ireland and Uganda on January 19 and 22. Yash Dhull also revealed that he looks up to Virat Kohli and he likes how the India Test skipper goes about doing his job in the field. \"The primary quality you need to become a captain of any team is that you should have the respect of your team. Without that, you can be a good captain or player, but you would not be able to do the job. Yash has got the respect of all his players,\" said Kanitkar during a virtual press conference. \"He is able to take tough calls on the field when it is needed, every time a captain cannot be told to do things. The captain needs to take his own decisions and Yash can do that. It is pretty instinctive, Yash's instincts are fine and he is able to do justice to the job,\" he added. Talking about Virat Kohli, Yash said: \"Virat Kohli's attitude on the field while batting and leading the side, I have the same and I try to do the job in the same manner.\" India is the most successful team having won four titles in 2000, 2008, 2012, and 2018. India has also been runner-up in 2016 and in the previous edition of the tournament held in 2020 in New Zealand. Promoted The 14th edition of the tournament will see 16 teams competing for the trophy in 48 matches. The format will see the top two teams from each of the four groups advance to the Super League while the remaining teams feature in the Plate across 23 days of competition. India U-19 is placed in Group B. India squad: Yash Dhull (c), Harnoor Singh, Angkrish Raghuvanshi, SK Rasheed (vice-captain), Nishant Sindhu, Siddarth Yadav, Dinesh Bana (wk), Aaradhya Yadav (wk), Raj Angad Bawa, Manav Parakh, Kaushal Tambe, RS Hangargekar, Vasu Vats, Vicky Ostwal, Ravikumar, Garv Sangwan.","image_url":"https://c.ndtvimg.com/2021-12/e9fasfpo_rohit-sharma-yash-dhull-nca-instagram_625x300_17_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"ICC Under-19 World Cup 2022 Live Streaming Sri Lanka U19 vs Scotland U19: How and Where to Watch SL vs SCO","link":"https://www.indiatvnews.com/sports/cricket/icc-under-19-world-cup-2022-live-streaming-sri-lanka-u19-vs-scotland-u19-how-and-where-to-watch-sl-vs-sco-in-india-live-stream-watch-cricket-match-on-2022-01-13-754293","keywords":null,"creator":null,"video_url":null,"description":"ICC Under-19 World Cup 2022 Live Streaming Sri Lanka U19 vs Scotland U19: How and Where to Watch SL vs SCO The 2022 ICC Under-19 World Cup will be held in the West Indies between January 14-5 February with 16 teams taking part in the mega event. In what will be the 14th edition of the U-19 Cricket World Cup. The tournament comprises 48 ODIs and will be played in Antigua, Guyana, Saint Kitts and Trinidad with Antigua hosting the final.","content":null,"pubDate":"2022-01-13 15:28:15","full_description":"Sri Lanka U19 vs Scotland U19 2nd Match, Group D Everest Cricket Club Ground, Georgetown 7:30 PM Star Sports will Live Telecast the ICC U19 ODI World Cup in India. You can watch the Live Streaming of matches on Disney+ Hotstar Charlie Peet (c), Jamie Cairns, Christopher Cole, Aayush Dasmahapatra, Olly Davidson, Sam Elstone, Sean Fischer-Keogh, Gabriel Gallman-Findlay, Jack Jarvis, Rafay Khan, Tom Mackintosh, Muhaymen Majeed, Ruaridh McIntyre, Lyle Robertson, Charlie Tear. Dunith Wellalage (c), Shevon Daniel, Anjala Bandara, Pawan Pathiraja, Sadisha Rajapaksa, Wanuja Sahan Kumara, Raveen De Silva, Ranuda Somarathne, Malsha Tharupathi, Traveen Mathew, Yasiru Rodrigo, Matheesha Pathirana, Chamidu Wickramasinghe, Vinuja Ranpul, Sakuna Liyanage, Abhisheak Liyanaarachchi, Sadeesh Jayawardena.","image_url":null,"source_id":"indiatvnews"},{"title":"IND vs SA: Sachin and legends all praise of Pant 'counter-attacking' century on Day 3","link":"https://www.indiatvnews.com/sports/cricket/ind-vs-sa-sachin-and-legends-all-praise-of-rishabh-pant-counter-attacking-century-on-day-3-2022-01-13-754291","keywords":null,"creator":null,"video_url":null,"description":"India cricket icon Sachin Tendulkar heaped praises on Rishabh Pant century on Day 3 against South Africa that guided India to a challenging total of 212 in Cape Town on Thursday. ","content":null,"pubDate":"2022-01-13 15:18:15","full_description":"India cricket icon heaped praises on Rishabh Pant century on Day 3 against South Africa that guided India to a challenging total of 212 in Cape Town on Thursday. Pant remained unbeaten on 100 as India were bundled out for 198 on a surface that has been challenging to score on. \"A simply outstanding knock by @RishabhPant17 at a crucial stage! Well done. #SAvIND,\" tweeted Sachin. The 24-year-old southpaw was also showered with praises by former India batter VVS Laxman, who called it one of the best counter-attacking innings. \"He has scored Test tons in Australia and England before and this one in Cape Town is right up there with one of the best counter-attacking innings one would ever see. Has kept India in the game. Take a bow, #RishabhPant,\" tweeted Laxman. Former India coach Ravi Shastri was also in awe of the Pant's innings, calling him an 'entertainer'. \"Pant dazzles with a hundred of sheer daring brilliance and class. Simply magnificent young man. What an entertainer! #SAvIND #pant,\" Shastri wrote. At the time of writing this report, South Africa put 58/1 on the board in 19.3 overs while chasing 212. Captain was not out on 21 while sharing the crease with Keegan Petersen (16*) at the other end.","image_url":null,"source_id":"indiatvnews"},{"title":"No communication from Ramiz Raja on his 4-nation T20I series idea: ICC CEO","link":"https://www.indiatvnews.com/sports/cricket/no-communication-from-ramiz-raja-on-his-4-nation-t20i-series-idea-icc-ceo-geoff-allardice-2022-01-13-754282","keywords":null,"creator":null,"video_url":null,"description":"International Cricket Council (ICC) CEO Geoff Allardice said Pakistan Cricket Board (PCB) chief Ramiz Raja is yet to communicate with them regarding his proposal of the four-nation T20I series, involving both India and Pakistan.","content":null,"pubDate":"2022-01-13 14:35:01","full_description":"International Cricket Council (ICC) CEO Geoff Allardice said Pakistan Cricket Board (PCB) chief Ramiz Raja is yet to communicate with them regarding his proposal of the four-nation T20I series, involving both India and Pakistan. Raja on Tuesday had said that he would make a proposal to the ICC about holding a four nations T20I series comprising both India and Pakistan to be held every year. He voiced his opinion that he wants to see India, Pakistan, Australia, and England square off in the T20I series every year. The PCB chief also said that if this series indeed goes ahead, then the profits would be shared on a percentage basis with all ICC members. \"We have not had any correspondence or communication with Ramiz Raja regarding any of the ideas,\" said Allardice during a virtual interaction with select media on Thursday. \"Till we get more detail on what he is thinking, it is hard to comment. At this stage, we have had no communication with Ramiz Raja regarding his idea.\" Allardice also said that the management of the bio-secure bubble would be a real challenge at the upcoming U19 World Cup, adding that the bio-bubble in place would not be a strict one as the apex cricketing body wants players to enjoy the experience of playing in a World Cup. The U19 World Cup will get underway in Guyana with hosts West Indies taking on Australia in the tournament opener on Friday, and a concurrent second game between Sri Lanka and Scotland will also take place in Georgetown. \"It's a balance between the risk of catching and passing on the virus versus the freedom that young people are going to be looking for and allow them to enjoy the experience of being involved in an Under-19 World Cup as well. I think the management of that environment over the next few weeks is probably the challenge and being able to react to whatever gets thrown our way,\" said Allardice. When asked about the bio-bubble for the World Cup, Allardice said: \"We are following a similar model to the Men's T20 World Cup in the way that we manage the type of accommodation that we are using and the COVID-19 testing frequency. We did learn from the experience in the UAE and we have had other events which have been multi-teams competitions. \"I think majority of the squad members from participating countries are vaccinated for COVID-19. The teams play their matches at a reasonable frequency. So you go to the cricket ground, you play your match, you go back to the hotel accommodation, recover, and then a day or two later, you are back again.\"","image_url":null,"source_id":"indiatvnews"},{"title":"STARZPLAY and Discovery Inc. broaden partnership by offering GOLFTV add-on","link":"https://www.prnewswire.com:443/news-releases/starzplay-and-discovery-inc-broaden-partnership-by-offering-golftv-add-on-301460537.html","keywords":["Mobile Entertainment","Entertainment","Television","General Sports","Sporting Events","Telecommunications Industry","SSE","SPT","TVN","ENT","MEN","TLS"],"creator":null,"video_url":null,"description":"DUBAI, UAE, Jan. 13, 2022 /PRNewswire/ -- Whether it's cricket, football, rugby or the legendary UFC fights, STARZPLAY sweeps the board for all the live sports' action. MENA region's fastest growing subscription video on demand (SVOD) service, today announced another add-on channel for...","content":null,"pubDate":"2022-01-13 14:30:00","full_description":null,"image_url":"https://mma.prnewswire.com/media/1726038/GOLFTV_on_STARZPLAY.jpg?p=original","source_id":"cision"},{"title":"Highest 4th innings chase in Cape Town: What is the highest run chase in Test matches at Newlands Cricket Ground?","link":"https://thesportsrush.com/cricket-news-highest-4th-innings-chase-in-cape-town-what-is-the-highest-run-chase-in-test-matches-at-newlands-cricket-ground/","keywords":["Cricket","India","India tour of South Africa 2021-22","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Highest 4th innings chase in Cape Town: South Africa will have to chase the third-highest Test score at Newlands in order to win this match. South Africa, who had sealed a third-highest run-chase in Johannesburg in the second Test match against India, will have to do the exact same if they are to win the… The post Highest 4th innings chase in Cape Town: What is the highest run chase in Test matches at Newlands Cricket Ground? appeared first on The SportsRush.","content":"Highest 4th innings chase in Cape Town: South Africa will have to chase the third-highest Test score at Newlands in order to win this match. South Africa, who had sealed a third-highest run-chase in Johannesburg in the second Test match against India, will have to do the exact same if they are to win the ongoing third Test in Cape Town. With India scoring 198/10 in 67.3 overs in the second innings on Day 3, South Africa need to score 212 runs to win their second match in a row. With more than two days remaining in the match, a result is on the cards for both this match and series. Had it not been for India wicket-keeper batter Rishabh Pant’s fourth Test century, the visitors would have put forward a below par target for none of their other batters created an impact in this innings. Who writes your scripts son? Last year at around the same time Pant was centrestage at Gabba to create history, year later he is again the centre of attention at Newlands as India seeks history once more #cricket #SAvInd — Chandresh Narayanan (@chand2579) January 13, 2022 Pant, who scored 100* (139) with the help of six fours and four sixes, has become the first-ever wicket-keeper to score away Test centuries in England, Australia and South Africa. Readers must note that all four of Pant’s Test centuries have come in different continents. Highest 4th innings chase in Cape Town Tests As far as the highest fourth innings run-chase in Cape Town is concerned, the record currently lies with Australia who had sealed a 334-run chase at the Newlands a couple of decades ago. Team Runs Overs Year Opposition Australia 334/6 79.1 2002 South Africa South Africa 236/2 50.2 2011 Australia South Africa 211/5 64.1 2007 India South Africa 186/3 35.2 2008 West Indies South Africa 182/6 43.1 2013 Pakistan Highest 4th innings successful run chase The current record for highest 4th innings successful run chase in Test cricket lies with West Indies, who had sealed a 418-run target against Australia in Antigua (also in 2002). The second-highest 4th innings successful run chase in Test cricket had come 14 years ago when South Africa had chased down a 414-run target in Perth. South Africa’s highest-ever fourth-innings score at home is a monumental 450/7 in 136 overs in a 458-run chase against India in Johannesburg in 2013. Below are the highest fourth innings totals at the Newlands: Team Runs Overs Year Opposition West Indies 354/5 100 2004 South Africa South Africa 335 142.2 1962 New Zealand Australia 334/6 79.1 2002 South Africa Sri Lanka 306 95.3 1998 South Africa England 304 123.4 2005 South Africa The post Highest 4th innings chase in Cape Town: What is the highest run chase in Test matches at Newlands Cricket Ground? appeared first on The SportsRush.","pubDate":"2022-01-13 14:27:57","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"'Biggest Match Winner': Here's How Cricket Fraternity Reacted To Pant Ton","link":"https://sports.ndtv.com/cricket/biggest-match-winner-heres-how-cricket-fraternity-reacted-to-rishabh-pants-century-on-day-3-of-cape-town-test-2706665","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa, 3rd Test: Rishabh Pant registered an unbeaten ton on Day 3 in Cape Town and received plenty of praise on Twitter.","content":null,"pubDate":"2022-01-13 14:21:52","full_description":"Rishabh Pant registered his fourth Test century on Day 3 of the ongoing third Test match between India and South Africa in Cape Town. The knock proved to be crucial as India reached 198 in their second innings, setting a target of 212 runs for the hosts. Pant smashed 100 off 139 balls and remained unbeaten. During his blistering knock, he also hammered six fours and four maximums. Former India opener Virender Sehwag led the reactions on Twitter as fans and experts lauded the wicketkeeper-batter. The legendary cricketer wrote, \"Incredible 100 from #RishabhPant . Just two other batsmen reached double fingers and has single -handedly kept India in the game. Not just an ex-factor but one of India's biggest match-winner in Test cricket.\" Incredible from #RishabhPant . Just two other batsmen reached double fingers and has single -handedly kept India in the game. Not just an ex-factor but one of India's biggest match-winner in Test cricket. pic.twitter.com/8FqX1FrIIK IPL side Rajasthan Royals (RR) also hailed the ton and called it \"top-quality\". \"\"Take care of your bat and it will take care of you!\" A top-quality ton from Rishabh Pant 100\", wrote RR. \"!\" A top-quality ton from Rishabh Pant. pic.twitter.com/rTux8U6D6L Promoted \"A simply outstanding knock by @RishabhPant17 at a crucial stage! Well done\", wrote Sachin Tendulkar. A simply outstanding knock by @RishabhPant17 at a crucial stage! Well done. #SAvIND pic.twitter.com/gdlTgfH3UE Here are the other reactions: He has scored Test tons in Australia and England before and this one in Cape Town is right up there with one of the best counter- attacking innings one would ever see. Has kept India in the game. Take a bow, #RishabhPant . pic.twitter.com/Rfo8C3ZBgS There are prodigies, late bloomers, record-makers and then there's Rishabh Pant - a match winner, and a perfect team man. @RishabhPant17 #INDvsSA @RishabhPant17 #SAvIND pic.twitter.com/yIbfZ2BXhQ Other than Pant's knock, other Indian batters had a poor outing. Virat Kohli managed to muster 29 runs off 143 balls and stitched a partnership with Pant but lost his wicket in the 49th over. With the series level at 1-1, the Proteas will be hoping to not lose any quick wickets on Day 3 and set-up a stable start for Day 4. Meanwhile, the Indian bowling department will be eyeing for some quick wickets.","image_url":"https://c.ndtvimg.com/2022-01/npi0h8ko_pant-twitter_120x90_13_January_22.jpg","source_id":"ndtv"},{"title":"“Real superman”: Yuzi Chahal reacts to Rishabh Pant’s 4th Test century in IND vs SA Cape Town Test","link":"https://thesportsrush.com/cricket-news-real-superman-yuzi-chahal-reacts-to-rishabh-pants-4th-test-century-in-ind-vs-sa-cape-town-test/","keywords":["Cricket","India Cricket Team","India","India tour of South Africa 2021-22","rishabh pant","South Africa","Yuzvendra Chahal"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Rishabh Pant’s 4th Test century: The Indian wicket-keeper batter now has Test centuries in four different continents. India wicket-keeper batter Rishabh Pant’s fourth Test century has provided their bowlers with a competitive total in what will be the last innings of this three-match series. Walking in to bat under pressure on the back of lack… The post “Real superman”: Yuzi Chahal reacts to Rishabh Pant’s 4th Test century in IND vs SA Cape Town Test appeared first on The SportsRush.","content":"Rishabh Pant’s 4th Test century: The Indian wicket-keeper batter now has Test centuries in four different continents. India wicket-keeper batter Rishabh Pant’s fourth Test century has provided their bowlers with a competitive total in what will be the last innings of this three-match series. Walking in to bat under pressure on the back of lack of runs on the tour, Pant put all that behind to become the first-ever wicket-keeper batter to score away Test centuries in England, Australia and South Africa. Pant, who has developed a knack of contributing significantly in India’s overseas victories, might have done the same after scoring 100* (139) with the help of six fours and four sixes at Newlands today. India, who were leading by just 71 runs upon Pant’s arrival, have put forward a 212-run target against South Africa. Pant, who scored 100 out of the 140 runs which his team scored in his presence, has single-handedly changed the game for the visitors. Pretty confident of his risky shots on Day 3, Pant refrained from repeating same mistakes on Thursday. As a result, the 24-year old player ended up scoring a century on a pitch where others have failed. The highlight of Pant’s innings remained the ideal way in which he picked deliveries to take on the South African bowlers. An innings which was an epitome of “calculated risk”, Pant in full control of his batting proved as to why he is one of the biggest game-changers in modern-day cricket. Twitter reactions on Rishabh Pant’s 4th Test century at Newlands Real Superman what an innings bro @RishabhPant17 pic.twitter.com/PZuOqpiHqd — Yuzvendra Chahal (@yuzi_chahal) January 13, 2022 A simply outstanding knock by @RishabhPant17 at a crucial stage! Well done.#SAvIND pic.twitter.com/gdlTgfH3UE — Sachin Tendulkar (@sachin_rt) January 13, 2022 Incredible from #RishabhPant . Just two other batsmen reached double fingers and has single -handedly kept India in the game. Not just an ex-factor but one of India’s biggest match-winner in Test cricket. pic.twitter.com/8FqX1FrIIK — Virender Sehwag (@virendersehwag) January 13, 2022 Well played @RishabhPant17 best ever you beauty pic.twitter.com/MJZomGY2Zq — Suresh Raina (@ImRaina) January 13, 2022 For more cricket-related news, click here. The post “Real superman”: Yuzi Chahal reacts to Rishabh Pant’s 4th Test century in IND vs SA Cape Town Test appeared first on The SportsRush.","pubDate":"2022-01-13 13:43:48","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Pant scores century but India have only 211 to defend","link":"https://www.tribuneindia.com/news/sports/pant-scores-century-but-india-have-only-211-to-defend-360975","keywords":null,"creator":null,"video_url":null,"description":"Cape Town, January 13 Rishabh Pant scored one of his finest hundreds in most adverse of circumstance but another shoddy batting show left India with only 211 runs to defend on the third day of the third and final cricket Test against South Africa, here Thursday.Pant's (100 not out off 139 balls) fourth Test hundred constituted for more than 50 percent of India's second innings total of 198 with Virat Kohli's 29 off 143 balls being the second highest individual score.The umpires called for tea break at the fall of final Indian wicket in the extended second session.This was the first Test match in 145-year-history where all 20 batters of one team were caught.The day belonged to Pant as he scored a hundred which is as good as one would ever see and what stood out was his shot selection, which was immaculate.He didn't do anything that was 'un-Pant' like as there was a rasping square cut off a rising one from Kagiso Rabada (3/53). There was the audacious down the track cover drive off Duanne Olivier and that six over long-on off Keshav Maharaj came just an over before lunch.These are all shots that one associates with the dashing keeper-batter but what was exemplary was his use of discretion as to what kind of deliveries he would attack.In between defending the good balls, he drove Maharaj out of the attack with a one-handed slog sweep and a six over long-off. When Olivier dug one short at his pace, it was pulled for six as he hit six fours and four sixes in all.Skipper Virat Kohli's presence during a 94-run stand definitely helped that he had that guiding light in the middle as he went about his job.Once Pant had unsettled the line and length of the Proteas pace unit, Dean Elgar opened the field allowing them to rotate the strike but once Kohli perished outside the off-stump, it was only Pant who had to take the burden.The other highlight was his batting with the tail, taking a single off either the fourth or fifth delivery shielding the Number 9, 10 and 11 as much as possible.If Pant's learning from his mistake was one good aspect, same can't be said about Cheteshwar Pujara (9) and Ajinkya Rahane (1) as they have now put their careers in jeopardy.Pujara was again cramped for room on the leg side and the tickle off the gloves was brilliantly taken by Keegan Petersen at leg slip, diving to his right and snapping it up inches ahead of the ground.In case of Rahane, Rabada bowled a terrific one which kicked from length and took his gloves and Dean Elgar at first slip caught it after keeper Kyle Verreynne had managed to tip it up with his gloves.Eight Indian batters failed to get into double figures.","content":null,"pubDate":"2022-01-13 13:31:58","full_description":"PTI Cape Town, January 13 Rishabh Pant scored one of his finest hundreds in most adverse of circumstance but another shoddy batting show left India with only 211 runs to defend on the third day of the third and final cricket Test against South Africa, here Thursday. Pant’s (100 not out off 139 balls) fourth Test hundred constituted for more than 50 percent of India’s second innings total of 198 with Virat Kohli’s 29 off 143 balls being the second highest individual score. The umpires called for tea break at the fall of final Indian wicket in the extended second session. This was the first Test match in 145-year-history where all 20 batters of one team were caught. The day belonged to Pant as he scored a hundred which is as good as one would ever see and what stood out was his shot selection, which was immaculate. He didn’t do anything that was ‘un-Pant’ like as there was a rasping square cut off a rising one from Kagiso Rabada (3/53). There was the audacious down the track cover drive off Duanne Olivier and that six over long-on off Keshav Maharaj came just an over before lunch. These are all shots that one associates with the dashing keeper-batter but what was exemplary was his use of discretion as to what kind of deliveries he would attack. In between defending the good balls, he drove Maharaj out of the attack with a one-handed slog sweep and a six over long-off. When Olivier dug one short at his pace, it was pulled for six as he hit six fours and four sixes in all. Skipper Virat Kohli’s presence during a 94-run stand definitely helped that he had that guiding light in the middle as he went about his job. Once Pant had unsettled the line and length of the Proteas pace unit, Dean Elgar opened the field allowing them to rotate the strike but once Kohli perished outside the off-stump, it was only Pant who had to take the burden. The other highlight was his batting with the tail, taking a single off either the fourth or fifth delivery shielding the Number 9, 10 and 11 as much as possible. If Pant’s learning from his mistake was one good aspect, same can’t be said about Cheteshwar Pujara (9) and Ajinkya Rahane (1) as they have now put their careers in jeopardy. Pujara was again cramped for room on the leg side and the tickle off the gloves was brilliantly taken by Keegan Petersen at leg slip, diving to his right and snapping it up inches ahead of the ground. In case of Rahane, Rabada bowled a terrific one which kicked from length and took his gloves and Dean Elgar at first slip caught it after keeper Kyle Verreynne had managed to tip it up with his gloves. Eight Indian batters failed to get into double figures.","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_1798546337.JPG","source_id":"tribuneindia"},{"title":"Langer urged to 'walk away' after Ashes series","link":"https://wwos.nine.com.au/cricket/justin-langer-urged-to-walk-after-ashes-campaign-darren-lehmann/46968ee9-f188-4d33-b6f7-e45992c7d915","keywords":null,"creator":["wwos"],"video_url":null,"description":"Justin Langer has been urged to ride into the sunset despite overseeing a hugely successful last few months.","content":"Australian coach Justin Langer has been urged to ride into the sunset at the end of the fifth Ashes Test in Hobart. Despite constant speculation surrounding his future, Langer has enjoyed a successful few months, having helped Australia secure an elusive T20 World Cup title before overseeing a successful home Ashes campaign. However, a senior cricket source told the Sydney Morning Herald that the 51-year-old should \"read the room\" and walk away, a sentiment echoed by his predecessor, Darren Lehmann.READ MORE: Where Djokovic saga stands on the eve of Australian Open\"Knowing Justin, he won't want to step aside. But he should or he will burn out,\" Lehmann told Fox Sports.\"If I was him I'd walk away actually. Four years, out on a high. Perfect.\"I coached for a year too long and in that moment I didn't realise it. I think four years is a perfect tenure. Hindsight is a wonderful thing.\"He could coach one format but all three is a lot to take on… JL knows my thoughts on that. I've spoken to him about it.\"READ MORE: Australia makes call on struggling Harris for fifth TestREAD MORE: England legends at war over Ashes shamblesAccording to the Sydney Morning Herald report, assistant coach Andrew McDonald is in \"pole position\" to replace Langer, but there are fears both he and fellow assistant Michael Di Venuto could depart should Langer remain at the helm. Australia and England will wrap up the five-match series in Hobart on Friday, having already retained the Ashes by virtue of an unassailable 3-0 lead heading into the series finale.For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2022-01-13 13:30:57","full_description":"Australian coach Justin Langer has been urged to ride into the sunset at the end of the fifth Ashes Test in Hobart . Despite constant speculation surrounding his future, Langer has enjoyed a successful few months, having helped Australia secure an elusive T20 World Cup title before overseeing a successful home Ashes campaign. However, a senior cricket source told the Sydney Morning Herald that the 51-year-old should \"read the room\" and walk away, a sentiment echoed by his predecessor, Darren Lehmann. READ MORE: Where Djokovic saga stands on the eve of Australian Open \"Knowing Justin, he won't want to step aside. But he should or he will burn out,\" Lehmann told Fox Sports. \"If I was him I'd walk away actually. Four years, out on a high. Perfect. \"I coached for a year too long and in that moment I didn't realise it. I think four years is a perfect tenure. Hindsight is a wonderful thing. \"He could coach one format but all three is a lot to take on… JL knows my thoughts on that. I've spoken to him about it.\" READ MORE: Australia makes call on struggling Harris for fifth Test READ MORE: England legends at war over Ashes shambles According to the Sydney Morning Herald report, assistant coach Andrew McDonald is in \"pole position\" to replace Langer, but there are fears both he and fellow assistant Michael Di Venuto could depart should Langer remain at the helm. Australia and England will wrap up the five-match series in Hobart on Friday, having already retained the Ashes by virtue of an unassailable 3-0 lead heading into the series finale. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/01/403444/pickerimage.jpg","source_id":"nine"}]}