{"newsArray":[{"title":"Higher educational institutions must promote sports as a core subject: LG","link":"https://kashmirreader.com/2023/03/16/higher-educational-institutions-must-promote-sports-as-a-core-subject-lg/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Inaugurates Chancellor's trophy at Jammu University","content":"JAMMU: Lieutenant Governor Manoj Sinha inaugurated Chancellor’s trophy at University of Jammu on Wednesday. More than 550 sportspersons from various universities are participating in the three-day mega sports event ‘Sauhard’. The Lt Governor called upon the Higher Education institutions to promote sports as a core subject. Sports is a powerful medium to ensure physical-emotional health, enhances learning efficiency & helps in character building, he said. “Sports nurtures both mind & body and enables students to become well-rounded across disciplines. National Education Policy has given us an opportunity to promote Sports through multidisciplinary system and end fragmentation in education system,” the Lt Governor said. Citing various reports and studies on the impact of sports on the mind of an individual, the Lt Governor said the researchers considered Sports as a miracle for the brain. It is important that sports should be a part of our curriculum, he noted. Highlighting the initiatives taken for holistic development of youth, the Lt Governor said, under the guidance of Prime Minister Narendra Modi, the National Education Policy is creating a progressive ecosystem for the students to translate their dreams into reality. “Hon’ble Prime Minister’s vision for FIT India, Khelo India, National Education Policy, start-up opportunities, is building a strong foundation for India’s future,” said the Lt Governor. The Lt Governor also pointed out that sports was deeply rooted in the ancient education system. “Our Gurukuls had emphasized using Sports as a tool to enable socio-economic change,” he said. The LG encouraged the youth to follow in the footsteps of prominent personalities who achieved excellence in both academics and sports. “Nothing is Impossible. You can achieve excellence in any field with your hard-work, dedication, right guidance and can build your future with your individuality and independent thinking,” said the Lt Governor. Rajeev Rai Bhatnagar, Advisor to Lt Governor reiterated the commitment of the administration to providing all necessary facilities to sportspersons and making J&K a sporting powerhouse. Prof Umesh Rai, Vice-Chancellor, Jammu University said that the University of Jammu, being one of the partners for hosting the Pre-Summit of G-20 Group of Countries, has taken an initiative to organise an inter-University Sports Competition for the Chancellor’s Trophy-2023 to promote brotherhood among students and scholars of the various Universities and to build trust and social harmony. From the ensuing academic session, students can pursue two academic programmes simultaneously as per the UGC guidelines, he added. Chancellor’s Trophy is being held under the initiative “My Youth My Pride” to promote the concept of NEP 2020 which envisages sports as part of the curriculum and lays emphasis on sports-integrated learning and as a skill for a quality life, it was informed. Participants will compete in various sports disciplines like Basketball, Cricket, Kabaddi, Volleyball and Table Tennis. Vice Chancellors of various Universities; HoDs, faculty members and students in large numbers were present on the occasion. Higher educational institutions must promote sports as a core subject: LG added by KR Desk on 2:16 am March 16, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-03-15 20:46:05","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashwin regains No 1 spot in ICC Test bowlers rankings","link":"https://kashmirreader.com/2023/03/16/ashwin-regains-no-1-spot-in-icc-test-bowlers-rankings/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: Senior India spinner Ravichandran Ashwin’s superlative show in the fourth Test against Australia has helped him regain the top spot among bowlers in the latest ICC Rankings issued on Wednesday. Ashwin, who grabbed a haul of six for 91 in the drawn fourth Test and was the leading wicket-taker in the Border-Gavaskar Trophy with […]","content":"Dubai: Senior India spinner Ravichandran Ashwin’s superlative show in the fourth Test against Australia has helped him regain the top spot among bowlers in the latest ICC Rankings issued on Wednesday. Ashwin, who grabbed a haul of six for 91 in the drawn fourth Test and was the leading wicket-taker in the Border-Gavaskar Trophy with 25 scalps, is 10 rating points ahead of England seamer James Anderson. Fellow Indian left-arm spinner Axar Patel climbed six places to 28 among bowlers. He also rose to the fourth spot in the all-rounder’s list led by Ashwin and Jadeja. While pacer Jasprit Bumrah, who is recovering from a recurring back injury, dropped to number seven among bowlers. Talismanic Indian batter Virat Kohli moved seven places to 13th position after his Player of the Match performance against Australia in the fourth Test. The high-scoring match at Ahmedabad also saw opener Shubhman Gill, who smashed a fine century, jump 17 places to 46th. The injured Rishabh Pant (9th) and skipper Rohit Sharma (10th) are the Indian batters in the top 10. Australia opener Usman Khawaja and New Zealand batter Daryl Mitchell have also made notable gains in the list. Khawaja’s score of 180 in the drawn fourth Test against India in Ahmedabad has lifted him two spots to seventh position and to a career-best 815 rating points while Mitchell’s knocks of 102 and 81 in the epic victory over Sri Lanka in Christchurch has helped him reach a career-best eighth position as he touches the 800-point mark for the first time. In the latest weekly update that also considers performances in the second Test between South Africa and the West Indies in Johannesburg, Temba Bavuma’s match-winning 172 for the home side has lifted him 14 slots to a career best 15th position. Sri Lanka’s Angelo Mathews is another one to move up the batting rankings, his scores of 47 and 115 taking him from 19th to 17th position. In the ICC Men’s T20I Player Rankings, Bangladesh batter Najmul Hossain Shanto’s scores of 51, 46 not out and 47 not out not only won him the Player of the Series award at home against England but have also lifted him 68 places to 16th position. In the ODI Rankings, Nepal batters Rohit Paudel (up four places to 55th) and Aasif Sheikh (up 16 places to 62nd) and leg-spin bowler Sandeep Lamichhane (up five places to 21st) are among those to progress owing to their performances in matches of the ICC Men’s Cricket World Cup League 2 in Kirtipur, Nepal. PTI Ashwin regains No 1 spot in ICC Test bowlers rankings added by Press Trust of India on 2:15 am March 16, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-03-15 20:45:54","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"46 की उम्र में ब्रेट ली ने ढाया कहर, गेल भी चमके, रैना की धमाकेदार पारी के बावजूद India Maharajas हुए पस्‍त","link":"https://hindi.news18.com/news/sports/cricket-suresh-raina-missed-fifty-chris-gayle-brett-lee-guide-world-giants-to-3-wicket-win-over-india-maharajas-in-llc-2023-match-5546817.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"लीजेंड लीग क्रिकेट (Legend League Cricket 2023) में इंडिया महाराजास ने चार मैचों में केवल एक ही जीत दर्ज की है. बुधवार को वर्ल्‍ड जायंट्स (India Maharajas vs World Giants) ने गौतम गंभीर की टीम को तीन विकेट से मात दी. ब्रेट ली और क्रिस गेल ने इस मैच में शानदार प्रदर्शन किया.","content":"सुरेश रैना लीजेंड लीग क्रिकेट के मैच में 49 रन बनाकर आउट हुए. (Twitter/LLC) नई दिल्‍ली. लीजेंड लीग क्रिकेट (Legend League Cricket 2023) के मुकाबले में इंडिया महाराजस की टीम को बुधवार को वर्ल्‍ड जायंट्स (India Maharajas vs World Giants) के खिलाफ तीन विकेट से शिकस्‍त झेलनी पड़ी. मैच के हीरो ब्रेट ली (Brett Lee) और क्रिस गेल (Chris Gayle) रहे. पहले ली ने 46 की उम्र में शानदार गेंदबाजी करते हुए तीन विकेट निकाले. लक्ष्‍य का पीछा करने के दौरान क्रिस गेल ने अर्धशतक ठोककर अपनी टीम को जीत दिलाई. गौतम गंभीर (Gautam Gambhir) की कप्‍तानी वाली टीम को इसके साथ ही अबतक खेले चार मैचों में केवल एक जीत ही नसीब हुई है. तीन टीमों वाले इस टूर्नामेंट में इंडिया महाराजास ने सीधे फाइनल में पहुंचने का मौका गंवा दिया है. एलिमिनेटर राउंड के माध्‍यम से उन्‍हें फाइनल की राह ढूंढ़नी होगी. आज के मैच की बात की जाए तो वर्ल्‍ड जायंट्स ने टॉस जीतकर इंडिया महाराजास को पहले बैटिंग के लिए बुलाया. सुरेश रैना अर्धशतक से एक रन से चूक गए. उन्‍होंने 41 गेंदों पर 49 रन बनाए. भारत ने 24 रन पर ही अपने दो विकेट गंवा दिए थे. रॉबिन उथप्‍पा महज 5 रन ही बना पाए. रीतेंद्र साढ़ी ने दो रन का योगदान दिया. ओपनिंग बैटर मनिंदर बिसला ने 34 गेंदों पर 36 रन बनाए. जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया! रिकी पोंटिंग ने खरीदा 109 करोड़ का बंगला, मेलबर्न की पॉश कॉलोनी में है नया आशियाना, अपने देखा क्‍या? अंत में इरफान पठान ने 20 गेंदों पर 25 रन की पारी खेली. इंडिया महाराजास ने निर्धारित 20 ओवरों में नौ विकेट के नुकसान पर 136 रन बनाए. लक्ष्‍य का पीछा करने के दौरान वर्ल्‍ड जायंट्स की टीम ने आठ गेंद बाकी रहते ही यह मुकाबला अपने नाम कर लिया. ओपनिंग बैटर क्रिस गेल ने 46 गेंदों पर 57 रन बनाए. हाशिम अमला छह रन ही बना पाए. शेन वॉटसन ने नंबर-3 पर खेलते हुए 16 गेंदों पर 26 रन की पारी खेली. छोटे लक्ष्‍य का पीछा करने के दौरान वर्ल्‍ड जायंट्स ने भी लगातार अंतराल पर विकेट गंवाए. कप्‍तान एरोन फिंच ने पांच, रॉस टेलर ने सात और समित पटेल ने 11 रनों का योगदान दिया. इंडिया महाराजास के यूसुफ पठान को सर्वाधिक दो विकेट मिले. इसके अलावा हरभजन सिंह, अशोक डिंडा, प्रवीण तांबे और सुरेश रैना को एक-एक विकेट मिले. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| बाहर बैठे खिलाड़ी की लगी लॉटरी, ऑस्ट्रेलिया के खिलाफ खेलेगा वनडे, प्लेइंग इलेवन में जगह हुई पक्की! जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया! युवराज सिंह के साथी की 10 साल बाद वापसी, प्लेइंग इलेवन में मिलेगा मौका! कोच और कप्तान करेंगे फैसला","pubDate":"2023-03-15 18:45:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Suresh-Raina-Twitter-LLC-16789055163x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Under 19 School Cricket","link":"https://www.dailymirror.lk/sports/Under-19-School-Cricket/322-255907","keywords":null,"creator":null,"video_url":null,"description":"Vidyartha College scored an innings and 87 runs win over Kingswood College in their inter-school Under 19 cricket encounter which concluded at the Army ground in Boyagane today.","content":"Innings win for Vidyartha Vidyartha College scored an innings and 87 runs win over Kingswood College in their inter-school Under 19 cricket encounter which concluded at the Army ground in Boyagane today. The Randles Hill School was shot out for 76 and 94 while Vidyartha scored 258 for 9 dec. in their first innings. Kingswood just left with one week for their Big Match against Rajans looked rattled this season. Kingswood 76 and 94 in 30 overs (Amesh Rupasinghe 35, Ravindu Bandara 27: Adithiya Kalapitiya 7 for 29) Vidyartha 258 for 9 dec. in 82.3 overs (Anishka Gunaratne 47, Shyamala Priyabashana 42, Janidu Ranaweera 40: Amesh Rupasinghe 3 for 39, Dinuka Sandaruwan 3 for 43, Abdul Hakam 2 for 59). Three players from CP for National Under 19 tour of UAE Three schoolboys will represent from Kandy for the National Under 19 team cricket tour of UAE which will take shortly. Antonian Treveen Mathew, Trinity skipper, Manula Kularatne and spinner, Theeraka Ranathunga will be part of the tour which will be played in One day format. Kularatne had scored over 700 runs this season both in two day encounters as well in one day format with a best batting performance of an unbeaten 100 against Mahanama College. He also has taken over 30 wickets this season. Theeraka Ranathunga a fine leg spinner and bat for the Trinity College outfit was the Best Bowler for Trinity in their 2021/2022 season. This season he has taken 33 wickets in the One day matches while taking 44 wickets in the two-day format. He also won three player of the match awards this season. He scored a blistering 134 for Ace Capital against the NCC in the recently concluded Under 23 cricket encounter conducted by Sri Lanka Cricket (SLC). Meanwhile, Mathew represented the national Under 19 outfit against the visiting Bangladesh team in Dambulla. He played for Abu Dhabi Knight Riders team in the T10 which took place in UAE while playing for SSC in the Under 23 tournament.","pubDate":"2023-03-15 17:44:06","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_e99d8b3772.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"बाहर बैठे खिलाड़ी की लगी लॉटरी, ऑस्ट्रेलिया के खिलाफ खेलेगा वनडे, प्लेइंग इलेवन में जगह हुई पक्की!","link":"https://hindi.news18.com/photogallery/sports/cricket-shreyas-iyer-injured-in-ahmedabad-test-out-suryakumar-yadav-playing-xi-against-australia-5546421.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया टेस्ट सीरीज में ऑस्ट्रेलिया को धूल चटाने के बाद अब वनडे के लिए तैयार है. 3 मैचों की सीरीज का पहला मुकाबला मुंबई में खेला जाना है. टीम इंडिया के लिए इस मैच से पहले एक बुरी खबर आई लेकिन यह प्लेइंग इलेवन से बाहर चल रहे विस्फोटक बैटर के लिए मौका लेकर आया. श्रेयस अय्यर जो अहमदाबाद टेस्ट मैच में चोटिल हो गए थे उनका वनडे में खेलना मुश्किल है. ऐसे में नागपुर टेस्ट में एक पारी खेलने के बाद प्लेइंग इलेवन से बाहर हुए खिलाड़ी के लिए मौका बना है.","content":"Loading... Loading... Loading... Loading... ऑस्ट्रेलिया के खिलाफ बॉर्डर गावस्कर ट्रॉफी में शानदार जीत दर्ज करने के बाद अब टीम इंडिया 3 मैचों की वनडे सीरीज में उतरेगी. मुंबई के वानखेडे स्टेडियम में पहला वनडे मुकाबला 17 मार्च को खेला जाना है. टीम के नियमित कप्तान रोहित शर्मा ने निजी कारणों की वजह मैच नहीं खेल रहे है. हार्दिक पंड्या कप्तानी की जिम्मेदारी दी गई है.- AP ऑस्ट्रेलिया के खिलाफ पहले वनडे में टीम इंडिया की प्लेइंग इलेवन कैसी होगी इसको लेकर चर्चा अभी से हो रही है. मैच से दो दिन पहले भारतीय क्रिकेट टीम के फील्डिंग कोच टी दिलीप ने बुधवार, 15 मार्च को आधिकारिक तौर पर पुष्टि कर दी है कि मिडिल ऑर्डर के बैटर श्रेयस अय्यर पीठ के निचले हिस्से की चोट से अभी पूरी तरह से उबर नहीं पाए हैं. मैच में श्रेयस के नहीं खेलने पर टी20 में विस्फोट करने वाले सूर्यकुमार को वनडे करियर को पटरी पर लाने के लिए मौका मिलना तय हो गया है.- AP सूर्यकुमार यादव ने ऑस्ट्रेलिया के खिलाफ नागपुर में टेस्ट डेब्यू किया था लेकिन अगले ही मुकाबले में प्लेइंग इलेवन से बाहर हो गए. पहले टेस्ट में श्रेयस अय्यर के चोटिल होने की वजह से उनकी जगह पर सूर्या को मौका मिला था. दिल्ली टेस्ट में उनकी चोट के बाद वापसी हुई और वो अपनी जगह गंवा बैठे.- AP टीम इंडिया फील्डिंग कोच ने श्रेसय अय्यर पर जो अपडेट दिया है उसके बाद सूर्यकुमार यादव का ऑस्ट्रेलिया के खिलाफ पहले वनडे में खेलना तय हो गया है. अहमदाबाद टेस्ट मैच की पहली पारी में श्रेयस बल्लेबाजी करने नहीं उतरे थे.- AP टी20 में गजब की बल्लेबाजी करने वाले सूर्यकुमार यादव को अब तक वनडे में दमदार पारी का इंतजार है. साल की शुरुआत में श्रीलंका के खिलाफ घर पर वनडे सीरीज में पहले दो मुकाबले से बाहर रखा गया था. तीसरे मैच में जब प्लेइंग इलेवन में जगह मिली तो सिर्फ 4 रन बनाकर आउट हो गए. न्यूजीलैंड के खिलाफ दो वनडे में 31 और 14 रन की ही पारी खेल पाए थे- AP","pubDate":"2023-03-15 17:09:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/deepak-hooda-vs-nz-bowling-16789000673x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MCC give Eton versus Harrow and annual Varsity matches a five-year stay of execution","link":"https://www.dailymail.co.uk/sport/cricket/article-11863865/MCC-Eton-versus-Harrow-annual-Varsity-matches-five-year-stay-execution.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Eton versus Harrow and Varsity matches have been given a five-year stay of execution by MCC. Members had been asked for their opinions after bosses faced a backlash for dropping the contests.","content":null,"pubDate":"2023-03-15 17:00:34","image_url":"https://i.dailymail.co.uk/1s/2023/03/15/17/68741617-0-image-a-1_1678899606175.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया!","link":"https://hindi.news18.com/photogallery/sports/cricket-when-munaf-patel-complained-rajasthan-royals-owner-against-captain-shane-warne-for-not-giving-over-in-ipl-2009-match-5545989.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"शेन वार्न (Shane Warne) की मौत बीते साल थाईलैंड में संधिग्‍ध परिस्‍थतियों में हो गई थी. वार्न ने साल 2008 में राजस्‍थान रॉयल्‍स फ्रेंचाइजी को आईपीएल चैंपियन बनाया था. 2009 में छोटी सी बात पर भारत के वर्ल्‍ड कप विजेता गेंदबाज ने उनकी शिकायत फ्रेंचाइजी मालिक से कर दी थी.","content":"Loading... Loading... Loading... Loading... नई दिल्‍ली. शेन वार्न को दुनिया के सबसे सफल गेंदबाजों में शुमार किया जाता है. फिरकी मास्‍टर की बॉल ऑफ द सेंचुरी को हर किसी ने देखा ही है. वो ऑस्‍ट्रेलिया की वर्ल्‍ड कप विजेता टीम का हिस्‍सा भी रहे. स्पिन के जादूगर शेन वार्न ऑस्‍ट्रेलिया ही नहीं बल्कि इंडियन प्रीमियर लीग के दौरान भी काफी सफल रहे थे. (AP) साल 2008 में आईपीएल की शुरुआत हुई तो राजस्‍थान रॉयल्‍स फ्रेंचाइजी ने शेन वार्न को अपना कप्‍तान नियुक्‍त किया. यह फ्रेंचाइजी उन दिनों नेट वर्थ के मामले में आईपीएल की सबसे कम कीमत वाली फ्रेंचाइजी थी. इसके बावजूद वार्न ने इस टीम को पहले ही सीजन में चैंपियन बना दिया था. (AFP) आईपीएल में शेन वार्न से जुड़ा एक ऐसा किस्‍सा भी है जब भारत के वर्ल्‍ड कप विजेता गेंदबाज से उनकी जमकर नोकझोक हो गई थी. यह गेंदबाज 2011 में भारत की वर्ल्‍ड कप जीतने वाली टीम का हिस्‍सा था. झगड़े का स्‍तर भी ऐसा कि गेंदबाज ने वार्न की शिकायत फ्रेंचाइजी मालिकों से कर दी थी. इस पूरे प्रकरण के दौरान वार्न बैकफुट पर थे. (AFP) इस गेंदबाज का नाम है मुनाफ पटेल. यह घटनाक्रम आईपीएल 2009 से जुड़ा है. एक न्‍यूज रिपोर्ट के अनुसार राजस्‍थान रॉयल्‍स टीम की एक लीग मैच में हार तय थी. शेन वार्न को भी यह पता था कि मैच हाथ से फिसल चुका है. ऐसे में मुनाफ पटेल को खुद पर भरोसा था कि वो मैच को अभी भी बना सकते हैं. (AFP) मुनाफ पटेल कप्‍तान शेन वार्न के पास गए और उन्‍हें गेंद थमाने का आग्रह किया. रिपोर्ट के मुताबिक वार्न ने मुनाफ की दरख्‍वास्‍त को दरकिनार कर दिया और उन्‍हें उक्‍त मैच में गेंदबाजी का मौका नहीं दिया. मैच के बाद इसे लेकर भारतीय गेंदबाज ने खुलकर अपनी नाराजगी वार्न से जताई. (AFP) मुनाफ पटेल यहीं नहीं रुके. वो राजस्‍थान रॉयल्‍स फ्रेंचाइजी मालिकों से भी मिले और शेन वार्न के खिलाफ अपना दर्द बयां किया. इसके बाद फ्रेंचाइजी की तरफ से भी वार्न से संपर्क किया गया. उन्‍हें बताया गया कि मामले को यहीं खत्‍म किया जाए और मुनाफ पटेल से इस बाबत बात की जाए. (AFP) रिपोर्ट में बताया गया कि इसके बाद शेन वार्न मुनाफ पटेल से मिलने के लिए उनके होटल रूम में गए थे. मुनाफ ने अपने कप्‍तान के लिए रूम का दरवाजा तक नहीं खोला. वो वार्न से इतने ज्‍यादा नाराज थे कि उन्‍होंने अपने कप्‍तान को बाहर से ही वापस लौट जाने के लिए कह दिया था. (AFP)","pubDate":"2023-03-15 16:51:33","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Irfan-Pathan-Yusuf-Pathan-Munaf-Patel-Instagram-16788971963x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranmith’s superb 139 takes Ragama to 302/8","link":"https://www.dailynews.lk/2023/03/16/sports/299440/ranmith%E2%80%99s-superb-139-takes-ragama-3028","keywords":null,"creator":["malinga"],"video_url":null,"description":"SportsTags: Print EditionRanmith Jayasena stroked a superb knock of 139 in 217 balls with 15 fours and a six as Ragama CC scored a formidable total of 302 for 8 wickets at close of the first day in the Major Clubs Under 23 cricket tournament semi-final fixture played at CCC grounds yesterday. Former Peterite skipper Ranmith Jayasena was leading from the front while Skipper Dellon Pieris (43) and Kalhara Seneviratne ( 52) also made useful cintributiins for Ragama CC. Leg spinner Vijayakanth Vayaskanth a product of Jaffna took bowling honours of the first day taking 3 for 85 for Tamil Union. Chief scores At CCC grounds Ragama CC: 302 for 8 wickets in 90 overs Dulaj Bandara 15, Avishka Tharindu 10, Ranmith Jayasena 139, Dellon Pieris 43, Kalhara Seneviratne 52, Vijayakanth Viyaskanth 3/85, Naveen Fernando 2/25 vs Tamil Union. (D.R.) Thursday, March 16, 2023 - 01:00","content":"Ranmith Jayasena stroked a superb knock of 139 in 217 balls with 15 fours and a six as Ragama CC scored a formidable total of 302 for 8 wickets at close of the first day in the Major Clubs Under 23 cricket tournament semi-final fixture played at CCC grounds yesterday. Former Peterite skipper Ranmith Jayasena was leading from the front while Skipper Dellon Pieris (43) and Kalhara Seneviratne ( 52) also made useful cintributiins for Ragama CC. Leg spinner Vijayakanth Vayaskanth a product of Jaffna took bowling honours of the first day taking 3 for 85 for Tamil Union. At CCC grounds Ragama CC: 302 for 8 wickets in 90 overs Dulaj Bandara 15, Avishka Tharindu 10, Ranmith Jayasena 139, Dellon Pieris 43, Kalhara Seneviratne 52, Vijayakanth Viyaskanth 3/85, Naveen Fernando 2/25 vs Tamil Union.","pubDate":"2023-03-15 15:48:26","image_url":null,"source_id":"dailynews","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"St. Servatius’ Matara into semi final","link":"https://www.dailynews.lk/2023/03/16/sports/299438/st-servatius%E2%80%99-matara-semi-final","keywords":null,"creator":["malinga"],"video_url":null,"description":"SportsTags: Print EditionSt. Servatius’ College Matara advanced to the semi final of the Under 19 Inter Schools Division One Tier ‘B’ 2 Day Cricket tournament yesterday. St. Servatius College Matara won the first innings against Ananda College Colombo in the quarter final played at Uyanwatta stadium Matara. St. Servatius Matara: 308/9 (87.5) (Chiran Neththaru 124, Mithila Charles 72, Viran Chamuditha 34, Thisan Dewmith 23 n.o., Ruvishan Perera 3/51, Ayesh Shashimal 3/83, Yehan 2/38) and 130/2 (29) (Tharush Damindu 51 n.o., Vishwa Supun 34 n.o., Diniru Abeywickramasinghe 28) Ananda Colombo: 181 (76.5) (Mihin Munasinghe 59, Kithma Sithmal 33, Viran Chamuditha 5/58, Tharush Damindu 2/32, Chathum Bimsara 2/37). ON DAY ONE Maris Stella College Negombo leading the first inning against St. Sylvester’s College Kandy on day one in the quarter final at Katunayake yesterday. * At Katunayake. St. Sylvesters College, Kandy: 161 (47.1) (Malith Lakshan 68, Khanka Wickramasinghe 28, Kavishka Imesh 22, Ramith Bandara 4/24, Shean Adithya 3/29, Chirath Adithya 2/43) Maris Stella College, Negombo: 163/4 (34) (Shean Adithya 46, Sadew Rathnayaka 38, Ramith Bandara 34, Anshen De Silva 21) (YK) Thursday, March 16, 2023 - 01:00","content":"St. Servatius’ College Matara advanced to the semi final of the Under 19 Inter Schools Division One Tier ‘B’ 2 Day Cricket tournament yesterday. St. Servatius College Matara won the first innings against Ananda College Colombo in the quarter final played at Uyanwatta stadium Matara. St. Servatius Matara: 308/9 (87.5) (Chiran Neththaru 124, Mithila Charles 72, Viran Chamuditha 34, Thisan Dewmith 23 n.o., Ruvishan Perera 3/51, Ayesh Shashimal 3/83, Yehan 2/38) and 130/2 (29) (Tharush Damindu 51 n.o., Vishwa Supun 34 n.o., Diniru Abeywickramasinghe 28) Ananda Colombo: 181 (76.5) (Mihin Munasinghe 59, Kithma Sithmal 33, Viran Chamuditha 5/58, Tharush Damindu 2/32, Chathum Bimsara 2/37). Maris Stella College Negombo leading the first inning against St. Sylvester’s College Kandy on day one in the quarter final at Katunayake yesterday. * At Katunayake. St. Sylvesters College, Kandy: 161 (47.1) (Malith Lakshan 68, Khanka Wickramasinghe 28, Kavishka Imesh 22, Ramith Bandara 4/24, Shean Adithya 3/29, Chirath Adithya 2/43) Maris Stella College, Negombo: 163/4 (34) (Shean Adithya 46, Sadew Rathnayaka 38, Ramith Bandara 34, Anshen De Silva 21)","pubDate":"2023-03-15 15:46:05","image_url":null,"source_id":"dailynews","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"युवराज सिंह के साथी की 10 साल बाद वापसी, प्लेइंग इलेवन में मिलेगा मौका! कोच और कप्तान करेंगे फैसला","link":"https://hindi.news18.com/photogallery/sports/cricket-jaydev-unadkat-will-be-able-to-make-comeback-in-playing-xi-after-10-years-rahul-dravid-and-hardik-pandya-decide-5545705.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम ने ऑस्ट्रेलिया के खिलाफ 4 मैचों की टेस्ट सीरीज में 2-1 से जीत हासिल कर बॉर्डर- गावस्कर ट्रॉफी पर लगातार चौथी बार कब्जा जमाया. अब 3 मैचों की वनडे सीरीज में दोनों टीमों के बीच मुकाबला होगा. सीरीज का पहला मैच मुंबई में खेला जाना है और इस मैच में सबकी नजरें टीम इंडिया में 10 साल बाद जगह बनाने वाले तेज गेंदबाज की होगी. युवराज सिंह और सुरेश रैना के साथ महेंद्र सिंह धोनी की कप्तानी में आखिरी बार वनडे खेलने वाले इस खिलाड़ी को प्लेइंग इलेवन में जगह मिलेगी या नहीं देखना दिलचस्प होगा.","content":"Loading... Loading... Loading... Loading... भारत और ऑस्ट्रेलिया के बीच 3 मैचों की वनडे सीरीज का पहला मुकाबला मुंबई के वानखेडे स्टेडियम में खेला जाना है. 17 मार्च को होने वाले मैच में नियमित कप्तान रोहित शर्मा नहीं खेलेंगे. टी20 टीम की कप्तानी करने वाले हार्दिक पंड्या पर टीम की जिम्मेदारी रहेगी. इस मैच में प्लेइंग इलेवन कैसी होगी इसको लेकर कोच राहुल द्रविड़ और कप्तान हार्दिक को काफी माथा पच्ची करनी होगी.-AP ऑस्ट्रेलिया के खिलाफ वनडे सीरीज के लिए चयनकर्ताओं ने 10 साल के बाद तेज गेंदबाज जयदेव उनादकट को फिर से मौका देने का फैसला लिया. साल 2013 के बाद एक बार फिर से उन्होंने टीम में जगह बनाई है. बांग्लादेश के दौरे पर चुनी गई टेस्ट टीम में 12 साल के बाद वापसी करते हुए जयदेव उनादकट ने प्लेइंग इलेवन में जगह बनाई थी. -AP ऑस्ट्रेलिया के खिलाफ जयदेव उनादकट को चयनकर्ताओं ने वनडे टीम में जगह तो दी है लेकिन उनका प्लेइंग इलेवन में जगह बनाना मुश्किल होगा. अनुभवी मोहम्मद शमी और नई सनसनी बनकर उभरे मोहम्मद सिराज की जोड़ी को ही कप्तान और कोच की पहली पसंद होगी. इसके अलावा शार्दुल ठाकुर भी तेज गेंदबाजी का विकल्प हैं जो बल्ले से भी योगदान कर सकते हैं.-AP जयदेव उनादकट ने आखिरी बार महेंद्र सिंह धोनी की कप्तानी में 2013 में वेस्टइंडीज के खिलाफ वनडे मैच खेला था. इस मैच में उनको साथी रहे युवराज सिंह और सुरेश रैना कप्तान धोनी सभी इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. मोहम्मद शमी ने उनके साथ मैच खेला था और पहले वनडे में भी उनका खेलना तय माना जा रहा है.-AP 2013 में वेस्टइंडीज के खिलाफ खेले गए मुकाबले में जयदेव उनादकट ने 6 ओवर गेंदबाजी की थी. 39 रन खर्च करने के बाद भी उनके खाते में कोई विकेट नहीं आया था. इस मैच के बाद उनको वनडे टीम से बाहर कर दिया गया था. भारत की तरफ से उनादकट ने कुल 7 वनडे खेले हैं जिसमें उनके नाम 8 विकेट हैं. -AfP","pubDate":"2023-03-15 15:46:01","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/MS-Dhoni-Yuvraj-Singh-AP-1-16785415903x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Higher educational institutions must promote sports as a core subject: LG","link":"https://kashmirreader.com/2023/03/16/higher-educational-institutions-must-promote-sports-as-a-core-subject-lg/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Inaugurates Chancellor's trophy at Jammu University","content":"JAMMU: Lieutenant Governor Manoj Sinha inaugurated Chancellor’s trophy at University of Jammu on Wednesday. More than 550 sportspersons from various universities are participating in the three-day mega sports event ‘Sauhard’. The Lt Governor called upon the Higher Education institutions to promote sports as a core subject. Sports is a powerful medium to ensure physical-emotional health, enhances learning efficiency & helps in character building, he said. “Sports nurtures both mind & body and enables students to become well-rounded across disciplines. National Education Policy has given us an opportunity to promote Sports through multidisciplinary system and end fragmentation in education system,” the Lt Governor said. Citing various reports and studies on the impact of sports on the mind of an individual, the Lt Governor said the researchers considered Sports as a miracle for the brain. It is important that sports should be a part of our curriculum, he noted. Highlighting the initiatives taken for holistic development of youth, the Lt Governor said, under the guidance of Prime Minister Narendra Modi, the National Education Policy is creating a progressive ecosystem for the students to translate their dreams into reality. “Hon’ble Prime Minister’s vision for FIT India, Khelo India, National Education Policy, start-up opportunities, is building a strong foundation for India’s future,” said the Lt Governor. The Lt Governor also pointed out that sports was deeply rooted in the ancient education system. “Our Gurukuls had emphasized using Sports as a tool to enable socio-economic change,” he said. The LG encouraged the youth to follow in the footsteps of prominent personalities who achieved excellence in both academics and sports. “Nothing is Impossible. You can achieve excellence in any field with your hard-work, dedication, right guidance and can build your future with your individuality and independent thinking,” said the Lt Governor. Rajeev Rai Bhatnagar, Advisor to Lt Governor reiterated the commitment of the administration to providing all necessary facilities to sportspersons and making J&K a sporting powerhouse. Prof Umesh Rai, Vice-Chancellor, Jammu University said that the University of Jammu, being one of the partners for hosting the Pre-Summit of G-20 Group of Countries, has taken an initiative to organise an inter-University Sports Competition for the Chancellor’s Trophy-2023 to promote brotherhood among students and scholars of the various Universities and to build trust and social harmony. From the ensuing academic session, students can pursue two academic programmes simultaneously as per the UGC guidelines, he added. Chancellor’s Trophy is being held under the initiative “My Youth My Pride” to promote the concept of NEP 2020 which envisages sports as part of the curriculum and lays emphasis on sports-integrated learning and as a skill for a quality life, it was informed. Participants will compete in various sports disciplines like Basketball, Cricket, Kabaddi, Volleyball and Table Tennis. Vice Chancellors of various Universities; HoDs, faculty members and students in large numbers were present on the occasion. Higher educational institutions must promote sports as a core subject: LG added by KR Desk on 2:16 am March 16, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-03-15 20:46:05","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashwin regains No 1 spot in ICC Test bowlers rankings","link":"https://kashmirreader.com/2023/03/16/ashwin-regains-no-1-spot-in-icc-test-bowlers-rankings/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: Senior India spinner Ravichandran Ashwin’s superlative show in the fourth Test against Australia has helped him regain the top spot among bowlers in the latest ICC Rankings issued on Wednesday. Ashwin, who grabbed a haul of six for 91 in the drawn fourth Test and was the leading wicket-taker in the Border-Gavaskar Trophy with […]","content":"Dubai: Senior India spinner Ravichandran Ashwin’s superlative show in the fourth Test against Australia has helped him regain the top spot among bowlers in the latest ICC Rankings issued on Wednesday. Ashwin, who grabbed a haul of six for 91 in the drawn fourth Test and was the leading wicket-taker in the Border-Gavaskar Trophy with 25 scalps, is 10 rating points ahead of England seamer James Anderson. Fellow Indian left-arm spinner Axar Patel climbed six places to 28 among bowlers. He also rose to the fourth spot in the all-rounder’s list led by Ashwin and Jadeja. While pacer Jasprit Bumrah, who is recovering from a recurring back injury, dropped to number seven among bowlers. Talismanic Indian batter Virat Kohli moved seven places to 13th position after his Player of the Match performance against Australia in the fourth Test. The high-scoring match at Ahmedabad also saw opener Shubhman Gill, who smashed a fine century, jump 17 places to 46th. The injured Rishabh Pant (9th) and skipper Rohit Sharma (10th) are the Indian batters in the top 10. Australia opener Usman Khawaja and New Zealand batter Daryl Mitchell have also made notable gains in the list. Khawaja’s score of 180 in the drawn fourth Test against India in Ahmedabad has lifted him two spots to seventh position and to a career-best 815 rating points while Mitchell’s knocks of 102 and 81 in the epic victory over Sri Lanka in Christchurch has helped him reach a career-best eighth position as he touches the 800-point mark for the first time. In the latest weekly update that also considers performances in the second Test between South Africa and the West Indies in Johannesburg, Temba Bavuma’s match-winning 172 for the home side has lifted him 14 slots to a career best 15th position. Sri Lanka’s Angelo Mathews is another one to move up the batting rankings, his scores of 47 and 115 taking him from 19th to 17th position. In the ICC Men’s T20I Player Rankings, Bangladesh batter Najmul Hossain Shanto’s scores of 51, 46 not out and 47 not out not only won him the Player of the Series award at home against England but have also lifted him 68 places to 16th position. In the ODI Rankings, Nepal batters Rohit Paudel (up four places to 55th) and Aasif Sheikh (up 16 places to 62nd) and leg-spin bowler Sandeep Lamichhane (up five places to 21st) are among those to progress owing to their performances in matches of the ICC Men’s Cricket World Cup League 2 in Kirtipur, Nepal. PTI Ashwin regains No 1 spot in ICC Test bowlers rankings added by Press Trust of India on 2:15 am March 16, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-03-15 20:45:54","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"46 की उम्र में ब्रेट ली ने ढाया कहर, गेल भी चमके, रैना की धमाकेदार पारी के बावजूद India Maharajas हुए पस्‍त","link":"https://hindi.news18.com/news/sports/cricket-suresh-raina-missed-fifty-chris-gayle-brett-lee-guide-world-giants-to-3-wicket-win-over-india-maharajas-in-llc-2023-match-5546817.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"लीजेंड लीग क्रिकेट (Legend League Cricket 2023) में इंडिया महाराजास ने चार मैचों में केवल एक ही जीत दर्ज की है. बुधवार को वर्ल्‍ड जायंट्स (India Maharajas vs World Giants) ने गौतम गंभीर की टीम को तीन विकेट से मात दी. ब्रेट ली और क्रिस गेल ने इस मैच में शानदार प्रदर्शन किया.","content":"सुरेश रैना लीजेंड लीग क्रिकेट के मैच में 49 रन बनाकर आउट हुए. (Twitter/LLC) नई दिल्‍ली. लीजेंड लीग क्रिकेट (Legend League Cricket 2023) के मुकाबले में इंडिया महाराजस की टीम को बुधवार को वर्ल्‍ड जायंट्स (India Maharajas vs World Giants) के खिलाफ तीन विकेट से शिकस्‍त झेलनी पड़ी. मैच के हीरो ब्रेट ली (Brett Lee) और क्रिस गेल (Chris Gayle) रहे. पहले ली ने 46 की उम्र में शानदार गेंदबाजी करते हुए तीन विकेट निकाले. लक्ष्‍य का पीछा करने के दौरान क्रिस गेल ने अर्धशतक ठोककर अपनी टीम को जीत दिलाई. गौतम गंभीर (Gautam Gambhir) की कप्‍तानी वाली टीम को इसके साथ ही अबतक खेले चार मैचों में केवल एक जीत ही नसीब हुई है. तीन टीमों वाले इस टूर्नामेंट में इंडिया महाराजास ने सीधे फाइनल में पहुंचने का मौका गंवा दिया है. एलिमिनेटर राउंड के माध्‍यम से उन्‍हें फाइनल की राह ढूंढ़नी होगी. आज के मैच की बात की जाए तो वर्ल्‍ड जायंट्स ने टॉस जीतकर इंडिया महाराजास को पहले बैटिंग के लिए बुलाया. सुरेश रैना अर्धशतक से एक रन से चूक गए. उन्‍होंने 41 गेंदों पर 49 रन बनाए. भारत ने 24 रन पर ही अपने दो विकेट गंवा दिए थे. रॉबिन उथप्‍पा महज 5 रन ही बना पाए. रीतेंद्र साढ़ी ने दो रन का योगदान दिया. ओपनिंग बैटर मनिंदर बिसला ने 34 गेंदों पर 36 रन बनाए. जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया! रिकी पोंटिंग ने खरीदा 109 करोड़ का बंगला, मेलबर्न की पॉश कॉलोनी में है नया आशियाना, अपने देखा क्‍या? अंत में इरफान पठान ने 20 गेंदों पर 25 रन की पारी खेली. इंडिया महाराजास ने निर्धारित 20 ओवरों में नौ विकेट के नुकसान पर 136 रन बनाए. लक्ष्‍य का पीछा करने के दौरान वर्ल्‍ड जायंट्स की टीम ने आठ गेंद बाकी रहते ही यह मुकाबला अपने नाम कर लिया. ओपनिंग बैटर क्रिस गेल ने 46 गेंदों पर 57 रन बनाए. हाशिम अमला छह रन ही बना पाए. शेन वॉटसन ने नंबर-3 पर खेलते हुए 16 गेंदों पर 26 रन की पारी खेली. छोटे लक्ष्‍य का पीछा करने के दौरान वर्ल्‍ड जायंट्स ने भी लगातार अंतराल पर विकेट गंवाए. कप्‍तान एरोन फिंच ने पांच, रॉस टेलर ने सात और समित पटेल ने 11 रनों का योगदान दिया. इंडिया महाराजास के यूसुफ पठान को सर्वाधिक दो विकेट मिले. इसके अलावा हरभजन सिंह, अशोक डिंडा, प्रवीण तांबे और सुरेश रैना को एक-एक विकेट मिले. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| बाहर बैठे खिलाड़ी की लगी लॉटरी, ऑस्ट्रेलिया के खिलाफ खेलेगा वनडे, प्लेइंग इलेवन में जगह हुई पक्की! जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया! युवराज सिंह के साथी की 10 साल बाद वापसी, प्लेइंग इलेवन में मिलेगा मौका! कोच और कप्तान करेंगे फैसला","pubDate":"2023-03-15 18:45:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Suresh-Raina-Twitter-LLC-16789055163x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Under 19 School Cricket","link":"https://www.dailymirror.lk/sports/Under-19-School-Cricket/322-255907","keywords":null,"creator":null,"video_url":null,"description":"Vidyartha College scored an innings and 87 runs win over Kingswood College in their inter-school Under 19 cricket encounter which concluded at the Army ground in Boyagane today.","content":"Innings win for Vidyartha Vidyartha College scored an innings and 87 runs win over Kingswood College in their inter-school Under 19 cricket encounter which concluded at the Army ground in Boyagane today. The Randles Hill School was shot out for 76 and 94 while Vidyartha scored 258 for 9 dec. in their first innings. Kingswood just left with one week for their Big Match against Rajans looked rattled this season. Kingswood 76 and 94 in 30 overs (Amesh Rupasinghe 35, Ravindu Bandara 27: Adithiya Kalapitiya 7 for 29) Vidyartha 258 for 9 dec. in 82.3 overs (Anishka Gunaratne 47, Shyamala Priyabashana 42, Janidu Ranaweera 40: Amesh Rupasinghe 3 for 39, Dinuka Sandaruwan 3 for 43, Abdul Hakam 2 for 59). Three players from CP for National Under 19 tour of UAE Three schoolboys will represent from Kandy for the National Under 19 team cricket tour of UAE which will take shortly. Antonian Treveen Mathew, Trinity skipper, Manula Kularatne and spinner, Theeraka Ranathunga will be part of the tour which will be played in One day format. Kularatne had scored over 700 runs this season both in two day encounters as well in one day format with a best batting performance of an unbeaten 100 against Mahanama College. He also has taken over 30 wickets this season. Theeraka Ranathunga a fine leg spinner and bat for the Trinity College outfit was the Best Bowler for Trinity in their 2021/2022 season. This season he has taken 33 wickets in the One day matches while taking 44 wickets in the two-day format. He also won three player of the match awards this season. He scored a blistering 134 for Ace Capital against the NCC in the recently concluded Under 23 cricket encounter conducted by Sri Lanka Cricket (SLC). Meanwhile, Mathew represented the national Under 19 outfit against the visiting Bangladesh team in Dambulla. He played for Abu Dhabi Knight Riders team in the T10 which took place in UAE while playing for SSC in the Under 23 tournament.","pubDate":"2023-03-15 17:44:06","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_e99d8b3772.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"बाहर बैठे खिलाड़ी की लगी लॉटरी, ऑस्ट्रेलिया के खिलाफ खेलेगा वनडे, प्लेइंग इलेवन में जगह हुई पक्की!","link":"https://hindi.news18.com/photogallery/sports/cricket-shreyas-iyer-injured-in-ahmedabad-test-out-suryakumar-yadav-playing-xi-against-australia-5546421.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया टेस्ट सीरीज में ऑस्ट्रेलिया को धूल चटाने के बाद अब वनडे के लिए तैयार है. 3 मैचों की सीरीज का पहला मुकाबला मुंबई में खेला जाना है. टीम इंडिया के लिए इस मैच से पहले एक बुरी खबर आई लेकिन यह प्लेइंग इलेवन से बाहर चल रहे विस्फोटक बैटर के लिए मौका लेकर आया. श्रेयस अय्यर जो अहमदाबाद टेस्ट मैच में चोटिल हो गए थे उनका वनडे में खेलना मुश्किल है. ऐसे में नागपुर टेस्ट में एक पारी खेलने के बाद प्लेइंग इलेवन से बाहर हुए खिलाड़ी के लिए मौका बना है.","content":"Loading... Loading... Loading... Loading... ऑस्ट्रेलिया के खिलाफ बॉर्डर गावस्कर ट्रॉफी में शानदार जीत दर्ज करने के बाद अब टीम इंडिया 3 मैचों की वनडे सीरीज में उतरेगी. मुंबई के वानखेडे स्टेडियम में पहला वनडे मुकाबला 17 मार्च को खेला जाना है. टीम के नियमित कप्तान रोहित शर्मा ने निजी कारणों की वजह मैच नहीं खेल रहे है. हार्दिक पंड्या कप्तानी की जिम्मेदारी दी गई है.- AP ऑस्ट्रेलिया के खिलाफ पहले वनडे में टीम इंडिया की प्लेइंग इलेवन कैसी होगी इसको लेकर चर्चा अभी से हो रही है. मैच से दो दिन पहले भारतीय क्रिकेट टीम के फील्डिंग कोच टी दिलीप ने बुधवार, 15 मार्च को आधिकारिक तौर पर पुष्टि कर दी है कि मिडिल ऑर्डर के बैटर श्रेयस अय्यर पीठ के निचले हिस्से की चोट से अभी पूरी तरह से उबर नहीं पाए हैं. मैच में श्रेयस के नहीं खेलने पर टी20 में विस्फोट करने वाले सूर्यकुमार को वनडे करियर को पटरी पर लाने के लिए मौका मिलना तय हो गया है.- AP सूर्यकुमार यादव ने ऑस्ट्रेलिया के खिलाफ नागपुर में टेस्ट डेब्यू किया था लेकिन अगले ही मुकाबले में प्लेइंग इलेवन से बाहर हो गए. पहले टेस्ट में श्रेयस अय्यर के चोटिल होने की वजह से उनकी जगह पर सूर्या को मौका मिला था. दिल्ली टेस्ट में उनकी चोट के बाद वापसी हुई और वो अपनी जगह गंवा बैठे.- AP टीम इंडिया फील्डिंग कोच ने श्रेसय अय्यर पर जो अपडेट दिया है उसके बाद सूर्यकुमार यादव का ऑस्ट्रेलिया के खिलाफ पहले वनडे में खेलना तय हो गया है. अहमदाबाद टेस्ट मैच की पहली पारी में श्रेयस बल्लेबाजी करने नहीं उतरे थे.- AP टी20 में गजब की बल्लेबाजी करने वाले सूर्यकुमार यादव को अब तक वनडे में दमदार पारी का इंतजार है. साल की शुरुआत में श्रीलंका के खिलाफ घर पर वनडे सीरीज में पहले दो मुकाबले से बाहर रखा गया था. तीसरे मैच में जब प्लेइंग इलेवन में जगह मिली तो सिर्फ 4 रन बनाकर आउट हो गए. न्यूजीलैंड के खिलाफ दो वनडे में 31 और 14 रन की ही पारी खेल पाए थे- AP","pubDate":"2023-03-15 17:09:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/deepak-hooda-vs-nz-bowling-16789000673x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MCC give Eton versus Harrow and annual Varsity matches a five-year stay of execution","link":"https://www.dailymail.co.uk/sport/cricket/article-11863865/MCC-Eton-versus-Harrow-annual-Varsity-matches-five-year-stay-execution.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Eton versus Harrow and Varsity matches have been given a five-year stay of execution by MCC. Members had been asked for their opinions after bosses faced a backlash for dropping the contests.","content":null,"pubDate":"2023-03-15 17:00:34","image_url":"https://i.dailymail.co.uk/1s/2023/03/15/17/68741617-0-image-a-1_1678899606175.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया!","link":"https://hindi.news18.com/photogallery/sports/cricket-when-munaf-patel-complained-rajasthan-royals-owner-against-captain-shane-warne-for-not-giving-over-in-ipl-2009-match-5545989.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"शेन वार्न (Shane Warne) की मौत बीते साल थाईलैंड में संधिग्‍ध परिस्‍थतियों में हो गई थी. वार्न ने साल 2008 में राजस्‍थान रॉयल्‍स फ्रेंचाइजी को आईपीएल चैंपियन बनाया था. 2009 में छोटी सी बात पर भारत के वर्ल्‍ड कप विजेता गेंदबाज ने उनकी शिकायत फ्रेंचाइजी मालिक से कर दी थी.","content":"Loading... Loading... Loading... Loading... नई दिल्‍ली. शेन वार्न को दुनिया के सबसे सफल गेंदबाजों में शुमार किया जाता है. फिरकी मास्‍टर की बॉल ऑफ द सेंचुरी को हर किसी ने देखा ही है. वो ऑस्‍ट्रेलिया की वर्ल्‍ड कप विजेता टीम का हिस्‍सा भी रहे. स्पिन के जादूगर शेन वार्न ऑस्‍ट्रेलिया ही नहीं बल्कि इंडियन प्रीमियर लीग के दौरान भी काफी सफल रहे थे. (AP) साल 2008 में आईपीएल की शुरुआत हुई तो राजस्‍थान रॉयल्‍स फ्रेंचाइजी ने शेन वार्न को अपना कप्‍तान नियुक्‍त किया. यह फ्रेंचाइजी उन दिनों नेट वर्थ के मामले में आईपीएल की सबसे कम कीमत वाली फ्रेंचाइजी थी. इसके बावजूद वार्न ने इस टीम को पहले ही सीजन में चैंपियन बना दिया था. (AFP) आईपीएल में शेन वार्न से जुड़ा एक ऐसा किस्‍सा भी है जब भारत के वर्ल्‍ड कप विजेता गेंदबाज से उनकी जमकर नोकझोक हो गई थी. यह गेंदबाज 2011 में भारत की वर्ल्‍ड कप जीतने वाली टीम का हिस्‍सा था. झगड़े का स्‍तर भी ऐसा कि गेंदबाज ने वार्न की शिकायत फ्रेंचाइजी मालिकों से कर दी थी. इस पूरे प्रकरण के दौरान वार्न बैकफुट पर थे. (AFP) इस गेंदबाज का नाम है मुनाफ पटेल. यह घटनाक्रम आईपीएल 2009 से जुड़ा है. एक न्‍यूज रिपोर्ट के अनुसार राजस्‍थान रॉयल्‍स टीम की एक लीग मैच में हार तय थी. शेन वार्न को भी यह पता था कि मैच हाथ से फिसल चुका है. ऐसे में मुनाफ पटेल को खुद पर भरोसा था कि वो मैच को अभी भी बना सकते हैं. (AFP) मुनाफ पटेल कप्‍तान शेन वार्न के पास गए और उन्‍हें गेंद थमाने का आग्रह किया. रिपोर्ट के मुताबिक वार्न ने मुनाफ की दरख्‍वास्‍त को दरकिनार कर दिया और उन्‍हें उक्‍त मैच में गेंदबाजी का मौका नहीं दिया. मैच के बाद इसे लेकर भारतीय गेंदबाज ने खुलकर अपनी नाराजगी वार्न से जताई. (AFP) मुनाफ पटेल यहीं नहीं रुके. वो राजस्‍थान रॉयल्‍स फ्रेंचाइजी मालिकों से भी मिले और शेन वार्न के खिलाफ अपना दर्द बयां किया. इसके बाद फ्रेंचाइजी की तरफ से भी वार्न से संपर्क किया गया. उन्‍हें बताया गया कि मामले को यहीं खत्‍म किया जाए और मुनाफ पटेल से इस बाबत बात की जाए. (AFP) रिपोर्ट में बताया गया कि इसके बाद शेन वार्न मुनाफ पटेल से मिलने के लिए उनके होटल रूम में गए थे. मुनाफ ने अपने कप्‍तान के लिए रूम का दरवाजा तक नहीं खोला. वो वार्न से इतने ज्‍यादा नाराज थे कि उन्‍होंने अपने कप्‍तान को बाहर से ही वापस लौट जाने के लिए कह दिया था. (AFP)","pubDate":"2023-03-15 16:51:33","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Irfan-Pathan-Yusuf-Pathan-Munaf-Patel-Instagram-16788971963x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranmith’s superb 139 takes Ragama to 302/8","link":"https://www.dailynews.lk/2023/03/16/sports/299440/ranmith%E2%80%99s-superb-139-takes-ragama-3028","keywords":null,"creator":["malinga"],"video_url":null,"description":"SportsTags: Print EditionRanmith Jayasena stroked a superb knock of 139 in 217 balls with 15 fours and a six as Ragama CC scored a formidable total of 302 for 8 wickets at close of the first day in the Major Clubs Under 23 cricket tournament semi-final fixture played at CCC grounds yesterday. Former Peterite skipper Ranmith Jayasena was leading from the front while Skipper Dellon Pieris (43) and Kalhara Seneviratne ( 52) also made useful cintributiins for Ragama CC. Leg spinner Vijayakanth Vayaskanth a product of Jaffna took bowling honours of the first day taking 3 for 85 for Tamil Union. Chief scores At CCC grounds Ragama CC: 302 for 8 wickets in 90 overs Dulaj Bandara 15, Avishka Tharindu 10, Ranmith Jayasena 139, Dellon Pieris 43, Kalhara Seneviratne 52, Vijayakanth Viyaskanth 3/85, Naveen Fernando 2/25 vs Tamil Union. (D.R.) Thursday, March 16, 2023 - 01:00","content":"Ranmith Jayasena stroked a superb knock of 139 in 217 balls with 15 fours and a six as Ragama CC scored a formidable total of 302 for 8 wickets at close of the first day in the Major Clubs Under 23 cricket tournament semi-final fixture played at CCC grounds yesterday. Former Peterite skipper Ranmith Jayasena was leading from the front while Skipper Dellon Pieris (43) and Kalhara Seneviratne ( 52) also made useful cintributiins for Ragama CC. Leg spinner Vijayakanth Vayaskanth a product of Jaffna took bowling honours of the first day taking 3 for 85 for Tamil Union. At CCC grounds Ragama CC: 302 for 8 wickets in 90 overs Dulaj Bandara 15, Avishka Tharindu 10, Ranmith Jayasena 139, Dellon Pieris 43, Kalhara Seneviratne 52, Vijayakanth Viyaskanth 3/85, Naveen Fernando 2/25 vs Tamil Union.","pubDate":"2023-03-15 15:48:26","image_url":null,"source_id":"dailynews","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"St. Servatius’ Matara into semi final","link":"https://www.dailynews.lk/2023/03/16/sports/299438/st-servatius%E2%80%99-matara-semi-final","keywords":null,"creator":["malinga"],"video_url":null,"description":"SportsTags: Print EditionSt. Servatius’ College Matara advanced to the semi final of the Under 19 Inter Schools Division One Tier ‘B’ 2 Day Cricket tournament yesterday. St. Servatius College Matara won the first innings against Ananda College Colombo in the quarter final played at Uyanwatta stadium Matara. St. Servatius Matara: 308/9 (87.5) (Chiran Neththaru 124, Mithila Charles 72, Viran Chamuditha 34, Thisan Dewmith 23 n.o., Ruvishan Perera 3/51, Ayesh Shashimal 3/83, Yehan 2/38) and 130/2 (29) (Tharush Damindu 51 n.o., Vishwa Supun 34 n.o., Diniru Abeywickramasinghe 28) Ananda Colombo: 181 (76.5) (Mihin Munasinghe 59, Kithma Sithmal 33, Viran Chamuditha 5/58, Tharush Damindu 2/32, Chathum Bimsara 2/37). ON DAY ONE Maris Stella College Negombo leading the first inning against St. Sylvester’s College Kandy on day one in the quarter final at Katunayake yesterday. * At Katunayake. St. Sylvesters College, Kandy: 161 (47.1) (Malith Lakshan 68, Khanka Wickramasinghe 28, Kavishka Imesh 22, Ramith Bandara 4/24, Shean Adithya 3/29, Chirath Adithya 2/43) Maris Stella College, Negombo: 163/4 (34) (Shean Adithya 46, Sadew Rathnayaka 38, Ramith Bandara 34, Anshen De Silva 21) (YK) Thursday, March 16, 2023 - 01:00","content":"St. Servatius’ College Matara advanced to the semi final of the Under 19 Inter Schools Division One Tier ‘B’ 2 Day Cricket tournament yesterday. St. Servatius College Matara won the first innings against Ananda College Colombo in the quarter final played at Uyanwatta stadium Matara. St. Servatius Matara: 308/9 (87.5) (Chiran Neththaru 124, Mithila Charles 72, Viran Chamuditha 34, Thisan Dewmith 23 n.o., Ruvishan Perera 3/51, Ayesh Shashimal 3/83, Yehan 2/38) and 130/2 (29) (Tharush Damindu 51 n.o., Vishwa Supun 34 n.o., Diniru Abeywickramasinghe 28) Ananda Colombo: 181 (76.5) (Mihin Munasinghe 59, Kithma Sithmal 33, Viran Chamuditha 5/58, Tharush Damindu 2/32, Chathum Bimsara 2/37). Maris Stella College Negombo leading the first inning against St. Sylvester’s College Kandy on day one in the quarter final at Katunayake yesterday. * At Katunayake. St. Sylvesters College, Kandy: 161 (47.1) (Malith Lakshan 68, Khanka Wickramasinghe 28, Kavishka Imesh 22, Ramith Bandara 4/24, Shean Adithya 3/29, Chirath Adithya 2/43) Maris Stella College, Negombo: 163/4 (34) (Shean Adithya 46, Sadew Rathnayaka 38, Ramith Bandara 34, Anshen De Silva 21)","pubDate":"2023-03-15 15:46:05","image_url":null,"source_id":"dailynews","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"युवराज सिंह के साथी की 10 साल बाद वापसी, प्लेइंग इलेवन में मिलेगा मौका! कोच और कप्तान करेंगे फैसला","link":"https://hindi.news18.com/photogallery/sports/cricket-jaydev-unadkat-will-be-able-to-make-comeback-in-playing-xi-after-10-years-rahul-dravid-and-hardik-pandya-decide-5545705.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम ने ऑस्ट्रेलिया के खिलाफ 4 मैचों की टेस्ट सीरीज में 2-1 से जीत हासिल कर बॉर्डर- गावस्कर ट्रॉफी पर लगातार चौथी बार कब्जा जमाया. अब 3 मैचों की वनडे सीरीज में दोनों टीमों के बीच मुकाबला होगा. सीरीज का पहला मैच मुंबई में खेला जाना है और इस मैच में सबकी नजरें टीम इंडिया में 10 साल बाद जगह बनाने वाले तेज गेंदबाज की होगी. युवराज सिंह और सुरेश रैना के साथ महेंद्र सिंह धोनी की कप्तानी में आखिरी बार वनडे खेलने वाले इस खिलाड़ी को प्लेइंग इलेवन में जगह मिलेगी या नहीं देखना दिलचस्प होगा.","content":"Loading... Loading... Loading... Loading... भारत और ऑस्ट्रेलिया के बीच 3 मैचों की वनडे सीरीज का पहला मुकाबला मुंबई के वानखेडे स्टेडियम में खेला जाना है. 17 मार्च को होने वाले मैच में नियमित कप्तान रोहित शर्मा नहीं खेलेंगे. टी20 टीम की कप्तानी करने वाले हार्दिक पंड्या पर टीम की जिम्मेदारी रहेगी. इस मैच में प्लेइंग इलेवन कैसी होगी इसको लेकर कोच राहुल द्रविड़ और कप्तान हार्दिक को काफी माथा पच्ची करनी होगी.-AP ऑस्ट्रेलिया के खिलाफ वनडे सीरीज के लिए चयनकर्ताओं ने 10 साल के बाद तेज गेंदबाज जयदेव उनादकट को फिर से मौका देने का फैसला लिया. साल 2013 के बाद एक बार फिर से उन्होंने टीम में जगह बनाई है. बांग्लादेश के दौरे पर चुनी गई टेस्ट टीम में 12 साल के बाद वापसी करते हुए जयदेव उनादकट ने प्लेइंग इलेवन में जगह बनाई थी. -AP ऑस्ट्रेलिया के खिलाफ जयदेव उनादकट को चयनकर्ताओं ने वनडे टीम में जगह तो दी है लेकिन उनका प्लेइंग इलेवन में जगह बनाना मुश्किल होगा. अनुभवी मोहम्मद शमी और नई सनसनी बनकर उभरे मोहम्मद सिराज की जोड़ी को ही कप्तान और कोच की पहली पसंद होगी. इसके अलावा शार्दुल ठाकुर भी तेज गेंदबाजी का विकल्प हैं जो बल्ले से भी योगदान कर सकते हैं.-AP जयदेव उनादकट ने आखिरी बार महेंद्र सिंह धोनी की कप्तानी में 2013 में वेस्टइंडीज के खिलाफ वनडे मैच खेला था. इस मैच में उनको साथी रहे युवराज सिंह और सुरेश रैना कप्तान धोनी सभी इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. मोहम्मद शमी ने उनके साथ मैच खेला था और पहले वनडे में भी उनका खेलना तय माना जा रहा है.-AP 2013 में वेस्टइंडीज के खिलाफ खेले गए मुकाबले में जयदेव उनादकट ने 6 ओवर गेंदबाजी की थी. 39 रन खर्च करने के बाद भी उनके खाते में कोई विकेट नहीं आया था. इस मैच के बाद उनको वनडे टीम से बाहर कर दिया गया था. भारत की तरफ से उनादकट ने कुल 7 वनडे खेले हैं जिसमें उनके नाम 8 विकेट हैं. -AfP","pubDate":"2023-03-15 15:46:01","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/MS-Dhoni-Yuvraj-Singh-AP-1-16785415903x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Higher educational institutions must promote sports as a core subject: LG","link":"https://kashmirreader.com/2023/03/16/higher-educational-institutions-must-promote-sports-as-a-core-subject-lg/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"Inaugurates Chancellor's trophy at Jammu University","content":"JAMMU: Lieutenant Governor Manoj Sinha inaugurated Chancellor’s trophy at University of Jammu on Wednesday. More than 550 sportspersons from various universities are participating in the three-day mega sports event ‘Sauhard’. The Lt Governor called upon the Higher Education institutions to promote sports as a core subject. Sports is a powerful medium to ensure physical-emotional health, enhances learning efficiency & helps in character building, he said. “Sports nurtures both mind & body and enables students to become well-rounded across disciplines. National Education Policy has given us an opportunity to promote Sports through multidisciplinary system and end fragmentation in education system,” the Lt Governor said. Citing various reports and studies on the impact of sports on the mind of an individual, the Lt Governor said the researchers considered Sports as a miracle for the brain. It is important that sports should be a part of our curriculum, he noted. Highlighting the initiatives taken for holistic development of youth, the Lt Governor said, under the guidance of Prime Minister Narendra Modi, the National Education Policy is creating a progressive ecosystem for the students to translate their dreams into reality. “Hon’ble Prime Minister’s vision for FIT India, Khelo India, National Education Policy, start-up opportunities, is building a strong foundation for India’s future,” said the Lt Governor. The Lt Governor also pointed out that sports was deeply rooted in the ancient education system. “Our Gurukuls had emphasized using Sports as a tool to enable socio-economic change,” he said. The LG encouraged the youth to follow in the footsteps of prominent personalities who achieved excellence in both academics and sports. “Nothing is Impossible. You can achieve excellence in any field with your hard-work, dedication, right guidance and can build your future with your individuality and independent thinking,” said the Lt Governor. Rajeev Rai Bhatnagar, Advisor to Lt Governor reiterated the commitment of the administration to providing all necessary facilities to sportspersons and making J&K a sporting powerhouse. Prof Umesh Rai, Vice-Chancellor, Jammu University said that the University of Jammu, being one of the partners for hosting the Pre-Summit of G-20 Group of Countries, has taken an initiative to organise an inter-University Sports Competition for the Chancellor’s Trophy-2023 to promote brotherhood among students and scholars of the various Universities and to build trust and social harmony. From the ensuing academic session, students can pursue two academic programmes simultaneously as per the UGC guidelines, he added. Chancellor’s Trophy is being held under the initiative “My Youth My Pride” to promote the concept of NEP 2020 which envisages sports as part of the curriculum and lays emphasis on sports-integrated learning and as a skill for a quality life, it was informed. Participants will compete in various sports disciplines like Basketball, Cricket, Kabaddi, Volleyball and Table Tennis. Vice Chancellors of various Universities; HoDs, faculty members and students in large numbers were present on the occasion. Higher educational institutions must promote sports as a core subject: LG added by KR Desk on 2:16 am March 16, 2023 View all posts by KR Desk → KR Desk Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-03-15 20:46:05","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Ashwin regains No 1 spot in ICC Test bowlers rankings","link":"https://kashmirreader.com/2023/03/16/ashwin-regains-no-1-spot-in-icc-test-bowlers-rankings/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"Dubai: Senior India spinner Ravichandran Ashwin’s superlative show in the fourth Test against Australia has helped him regain the top spot among bowlers in the latest ICC Rankings issued on Wednesday. Ashwin, who grabbed a haul of six for 91 in the drawn fourth Test and was the leading wicket-taker in the Border-Gavaskar Trophy with […]","content":"Dubai: Senior India spinner Ravichandran Ashwin’s superlative show in the fourth Test against Australia has helped him regain the top spot among bowlers in the latest ICC Rankings issued on Wednesday. Ashwin, who grabbed a haul of six for 91 in the drawn fourth Test and was the leading wicket-taker in the Border-Gavaskar Trophy with 25 scalps, is 10 rating points ahead of England seamer James Anderson. Fellow Indian left-arm spinner Axar Patel climbed six places to 28 among bowlers. He also rose to the fourth spot in the all-rounder’s list led by Ashwin and Jadeja. While pacer Jasprit Bumrah, who is recovering from a recurring back injury, dropped to number seven among bowlers. Talismanic Indian batter Virat Kohli moved seven places to 13th position after his Player of the Match performance against Australia in the fourth Test. The high-scoring match at Ahmedabad also saw opener Shubhman Gill, who smashed a fine century, jump 17 places to 46th. The injured Rishabh Pant (9th) and skipper Rohit Sharma (10th) are the Indian batters in the top 10. Australia opener Usman Khawaja and New Zealand batter Daryl Mitchell have also made notable gains in the list. Khawaja’s score of 180 in the drawn fourth Test against India in Ahmedabad has lifted him two spots to seventh position and to a career-best 815 rating points while Mitchell’s knocks of 102 and 81 in the epic victory over Sri Lanka in Christchurch has helped him reach a career-best eighth position as he touches the 800-point mark for the first time. In the latest weekly update that also considers performances in the second Test between South Africa and the West Indies in Johannesburg, Temba Bavuma’s match-winning 172 for the home side has lifted him 14 slots to a career best 15th position. Sri Lanka’s Angelo Mathews is another one to move up the batting rankings, his scores of 47 and 115 taking him from 19th to 17th position. In the ICC Men’s T20I Player Rankings, Bangladesh batter Najmul Hossain Shanto’s scores of 51, 46 not out and 47 not out not only won him the Player of the Series award at home against England but have also lifted him 68 places to 16th position. In the ODI Rankings, Nepal batters Rohit Paudel (up four places to 55th) and Aasif Sheikh (up 16 places to 62nd) and leg-spin bowler Sandeep Lamichhane (up five places to 21st) are among those to progress owing to their performances in matches of the ICC Men’s Cricket World Cup League 2 in Kirtipur, Nepal. PTI Ashwin regains No 1 spot in ICC Test bowlers rankings added by Press Trust of India on 2:15 am March 16, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-03-15 20:45:54","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"46 की उम्र में ब्रेट ली ने ढाया कहर, गेल भी चमके, रैना की धमाकेदार पारी के बावजूद India Maharajas हुए पस्‍त","link":"https://hindi.news18.com/news/sports/cricket-suresh-raina-missed-fifty-chris-gayle-brett-lee-guide-world-giants-to-3-wicket-win-over-india-maharajas-in-llc-2023-match-5546817.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"लीजेंड लीग क्रिकेट (Legend League Cricket 2023) में इंडिया महाराजास ने चार मैचों में केवल एक ही जीत दर्ज की है. बुधवार को वर्ल्‍ड जायंट्स (India Maharajas vs World Giants) ने गौतम गंभीर की टीम को तीन विकेट से मात दी. ब्रेट ली और क्रिस गेल ने इस मैच में शानदार प्रदर्शन किया.","content":"सुरेश रैना लीजेंड लीग क्रिकेट के मैच में 49 रन बनाकर आउट हुए. (Twitter/LLC) नई दिल्‍ली. लीजेंड लीग क्रिकेट (Legend League Cricket 2023) के मुकाबले में इंडिया महाराजस की टीम को बुधवार को वर्ल्‍ड जायंट्स (India Maharajas vs World Giants) के खिलाफ तीन विकेट से शिकस्‍त झेलनी पड़ी. मैच के हीरो ब्रेट ली (Brett Lee) और क्रिस गेल (Chris Gayle) रहे. पहले ली ने 46 की उम्र में शानदार गेंदबाजी करते हुए तीन विकेट निकाले. लक्ष्‍य का पीछा करने के दौरान क्रिस गेल ने अर्धशतक ठोककर अपनी टीम को जीत दिलाई. गौतम गंभीर (Gautam Gambhir) की कप्‍तानी वाली टीम को इसके साथ ही अबतक खेले चार मैचों में केवल एक जीत ही नसीब हुई है. तीन टीमों वाले इस टूर्नामेंट में इंडिया महाराजास ने सीधे फाइनल में पहुंचने का मौका गंवा दिया है. एलिमिनेटर राउंड के माध्‍यम से उन्‍हें फाइनल की राह ढूंढ़नी होगी. आज के मैच की बात की जाए तो वर्ल्‍ड जायंट्स ने टॉस जीतकर इंडिया महाराजास को पहले बैटिंग के लिए बुलाया. सुरेश रैना अर्धशतक से एक रन से चूक गए. उन्‍होंने 41 गेंदों पर 49 रन बनाए. भारत ने 24 रन पर ही अपने दो विकेट गंवा दिए थे. रॉबिन उथप्‍पा महज 5 रन ही बना पाए. रीतेंद्र साढ़ी ने दो रन का योगदान दिया. ओपनिंग बैटर मनिंदर बिसला ने 34 गेंदों पर 36 रन बनाए. जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया! रिकी पोंटिंग ने खरीदा 109 करोड़ का बंगला, मेलबर्न की पॉश कॉलोनी में है नया आशियाना, अपने देखा क्‍या? अंत में इरफान पठान ने 20 गेंदों पर 25 रन की पारी खेली. इंडिया महाराजास ने निर्धारित 20 ओवरों में नौ विकेट के नुकसान पर 136 रन बनाए. लक्ष्‍य का पीछा करने के दौरान वर्ल्‍ड जायंट्स की टीम ने आठ गेंद बाकी रहते ही यह मुकाबला अपने नाम कर लिया. ओपनिंग बैटर क्रिस गेल ने 46 गेंदों पर 57 रन बनाए. हाशिम अमला छह रन ही बना पाए. शेन वॉटसन ने नंबर-3 पर खेलते हुए 16 गेंदों पर 26 रन की पारी खेली. छोटे लक्ष्‍य का पीछा करने के दौरान वर्ल्‍ड जायंट्स ने भी लगातार अंतराल पर विकेट गंवाए. कप्‍तान एरोन फिंच ने पांच, रॉस टेलर ने सात और समित पटेल ने 11 रनों का योगदान दिया. इंडिया महाराजास के यूसुफ पठान को सर्वाधिक दो विकेट मिले. इसके अलावा हरभजन सिंह, अशोक डिंडा, प्रवीण तांबे और सुरेश रैना को एक-एक विकेट मिले. ब्रेकिंग न्यूज़ हिंदी में सबसे पहले पढ़ें News18 हिंदी| आज की ताजा खबर, लाइव न्यूज अपडेट, पढ़ें सबसे विश्वसनीय हिंदी न्यूज़ वेबसाइट News18 हिंदी| बाहर बैठे खिलाड़ी की लगी लॉटरी, ऑस्ट्रेलिया के खिलाफ खेलेगा वनडे, प्लेइंग इलेवन में जगह हुई पक्की! जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया! युवराज सिंह के साथी की 10 साल बाद वापसी, प्लेइंग इलेवन में मिलेगा मौका! कोच और कप्तान करेंगे फैसला","pubDate":"2023-03-15 18:45:09","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Suresh-Raina-Twitter-LLC-16789055163x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Under 19 School Cricket","link":"https://www.dailymirror.lk/sports/Under-19-School-Cricket/322-255907","keywords":null,"creator":null,"video_url":null,"description":"Vidyartha College scored an innings and 87 runs win over Kingswood College in their inter-school Under 19 cricket encounter which concluded at the Army ground in Boyagane today.","content":"Innings win for Vidyartha Vidyartha College scored an innings and 87 runs win over Kingswood College in their inter-school Under 19 cricket encounter which concluded at the Army ground in Boyagane today. The Randles Hill School was shot out for 76 and 94 while Vidyartha scored 258 for 9 dec. in their first innings. Kingswood just left with one week for their Big Match against Rajans looked rattled this season. Kingswood 76 and 94 in 30 overs (Amesh Rupasinghe 35, Ravindu Bandara 27: Adithiya Kalapitiya 7 for 29) Vidyartha 258 for 9 dec. in 82.3 overs (Anishka Gunaratne 47, Shyamala Priyabashana 42, Janidu Ranaweera 40: Amesh Rupasinghe 3 for 39, Dinuka Sandaruwan 3 for 43, Abdul Hakam 2 for 59). Three players from CP for National Under 19 tour of UAE Three schoolboys will represent from Kandy for the National Under 19 team cricket tour of UAE which will take shortly. Antonian Treveen Mathew, Trinity skipper, Manula Kularatne and spinner, Theeraka Ranathunga will be part of the tour which will be played in One day format. Kularatne had scored over 700 runs this season both in two day encounters as well in one day format with a best batting performance of an unbeaten 100 against Mahanama College. He also has taken over 30 wickets this season. Theeraka Ranathunga a fine leg spinner and bat for the Trinity College outfit was the Best Bowler for Trinity in their 2021/2022 season. This season he has taken 33 wickets in the One day matches while taking 44 wickets in the two-day format. He also won three player of the match awards this season. He scored a blistering 134 for Ace Capital against the NCC in the recently concluded Under 23 cricket encounter conducted by Sri Lanka Cricket (SLC). Meanwhile, Mathew represented the national Under 19 outfit against the visiting Bangladesh team in Dambulla. He played for Abu Dhabi Knight Riders team in the T10 which took place in UAE while playing for SSC in the Under 23 tournament.","pubDate":"2023-03-15 17:44:06","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_e99d8b3772.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"बाहर बैठे खिलाड़ी की लगी लॉटरी, ऑस्ट्रेलिया के खिलाफ खेलेगा वनडे, प्लेइंग इलेवन में जगह हुई पक्की!","link":"https://hindi.news18.com/photogallery/sports/cricket-shreyas-iyer-injured-in-ahmedabad-test-out-suryakumar-yadav-playing-xi-against-australia-5546421.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"टीम इंडिया टेस्ट सीरीज में ऑस्ट्रेलिया को धूल चटाने के बाद अब वनडे के लिए तैयार है. 3 मैचों की सीरीज का पहला मुकाबला मुंबई में खेला जाना है. टीम इंडिया के लिए इस मैच से पहले एक बुरी खबर आई लेकिन यह प्लेइंग इलेवन से बाहर चल रहे विस्फोटक बैटर के लिए मौका लेकर आया. श्रेयस अय्यर जो अहमदाबाद टेस्ट मैच में चोटिल हो गए थे उनका वनडे में खेलना मुश्किल है. ऐसे में नागपुर टेस्ट में एक पारी खेलने के बाद प्लेइंग इलेवन से बाहर हुए खिलाड़ी के लिए मौका बना है.","content":"Loading... Loading... Loading... Loading... ऑस्ट्रेलिया के खिलाफ बॉर्डर गावस्कर ट्रॉफी में शानदार जीत दर्ज करने के बाद अब टीम इंडिया 3 मैचों की वनडे सीरीज में उतरेगी. मुंबई के वानखेडे स्टेडियम में पहला वनडे मुकाबला 17 मार्च को खेला जाना है. टीम के नियमित कप्तान रोहित शर्मा ने निजी कारणों की वजह मैच नहीं खेल रहे है. हार्दिक पंड्या कप्तानी की जिम्मेदारी दी गई है.- AP ऑस्ट्रेलिया के खिलाफ पहले वनडे में टीम इंडिया की प्लेइंग इलेवन कैसी होगी इसको लेकर चर्चा अभी से हो रही है. मैच से दो दिन पहले भारतीय क्रिकेट टीम के फील्डिंग कोच टी दिलीप ने बुधवार, 15 मार्च को आधिकारिक तौर पर पुष्टि कर दी है कि मिडिल ऑर्डर के बैटर श्रेयस अय्यर पीठ के निचले हिस्से की चोट से अभी पूरी तरह से उबर नहीं पाए हैं. मैच में श्रेयस के नहीं खेलने पर टी20 में विस्फोट करने वाले सूर्यकुमार को वनडे करियर को पटरी पर लाने के लिए मौका मिलना तय हो गया है.- AP सूर्यकुमार यादव ने ऑस्ट्रेलिया के खिलाफ नागपुर में टेस्ट डेब्यू किया था लेकिन अगले ही मुकाबले में प्लेइंग इलेवन से बाहर हो गए. पहले टेस्ट में श्रेयस अय्यर के चोटिल होने की वजह से उनकी जगह पर सूर्या को मौका मिला था. दिल्ली टेस्ट में उनकी चोट के बाद वापसी हुई और वो अपनी जगह गंवा बैठे.- AP टीम इंडिया फील्डिंग कोच ने श्रेसय अय्यर पर जो अपडेट दिया है उसके बाद सूर्यकुमार यादव का ऑस्ट्रेलिया के खिलाफ पहले वनडे में खेलना तय हो गया है. अहमदाबाद टेस्ट मैच की पहली पारी में श्रेयस बल्लेबाजी करने नहीं उतरे थे.- AP टी20 में गजब की बल्लेबाजी करने वाले सूर्यकुमार यादव को अब तक वनडे में दमदार पारी का इंतजार है. साल की शुरुआत में श्रीलंका के खिलाफ घर पर वनडे सीरीज में पहले दो मुकाबले से बाहर रखा गया था. तीसरे मैच में जब प्लेइंग इलेवन में जगह मिली तो सिर्फ 4 रन बनाकर आउट हो गए. न्यूजीलैंड के खिलाफ दो वनडे में 31 और 14 रन की ही पारी खेल पाए थे- AP","pubDate":"2023-03-15 17:09:07","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/deepak-hooda-vs-nz-bowling-16789000673x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"MCC give Eton versus Harrow and annual Varsity matches a five-year stay of execution","link":"https://www.dailymail.co.uk/sport/cricket/article-11863865/MCC-Eton-versus-Harrow-annual-Varsity-matches-five-year-stay-execution.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"The Eton versus Harrow and Varsity matches have been given a five-year stay of execution by MCC. Members had been asked for their opinions after bosses faced a backlash for dropping the contests.","content":null,"pubDate":"2023-03-15 17:00:34","image_url":"https://i.dailymail.co.uk/1s/2023/03/15/17/68741617-0-image-a-1_1678899606175.jpg","source_id":"dailymailuk","category":["sports"],"country":["united kingdom"],"language":"english"},{"title":"जब शेन वार्न पर भड़का वर्ल्‍ड चैंपियन, फ्रेंचाइजी मालिक से की शिकायत, गुस्‍सा ऐसा- कप्‍तान को दरवाजे से भगाया!","link":"https://hindi.news18.com/photogallery/sports/cricket-when-munaf-patel-complained-rajasthan-royals-owner-against-captain-shane-warne-for-not-giving-over-in-ipl-2009-match-5545989.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"शेन वार्न (Shane Warne) की मौत बीते साल थाईलैंड में संधिग्‍ध परिस्‍थतियों में हो गई थी. वार्न ने साल 2008 में राजस्‍थान रॉयल्‍स फ्रेंचाइजी को आईपीएल चैंपियन बनाया था. 2009 में छोटी सी बात पर भारत के वर्ल्‍ड कप विजेता गेंदबाज ने उनकी शिकायत फ्रेंचाइजी मालिक से कर दी थी.","content":"Loading... Loading... Loading... Loading... नई दिल्‍ली. शेन वार्न को दुनिया के सबसे सफल गेंदबाजों में शुमार किया जाता है. फिरकी मास्‍टर की बॉल ऑफ द सेंचुरी को हर किसी ने देखा ही है. वो ऑस्‍ट्रेलिया की वर्ल्‍ड कप विजेता टीम का हिस्‍सा भी रहे. स्पिन के जादूगर शेन वार्न ऑस्‍ट्रेलिया ही नहीं बल्कि इंडियन प्रीमियर लीग के दौरान भी काफी सफल रहे थे. (AP) साल 2008 में आईपीएल की शुरुआत हुई तो राजस्‍थान रॉयल्‍स फ्रेंचाइजी ने शेन वार्न को अपना कप्‍तान नियुक्‍त किया. यह फ्रेंचाइजी उन दिनों नेट वर्थ के मामले में आईपीएल की सबसे कम कीमत वाली फ्रेंचाइजी थी. इसके बावजूद वार्न ने इस टीम को पहले ही सीजन में चैंपियन बना दिया था. (AFP) आईपीएल में शेन वार्न से जुड़ा एक ऐसा किस्‍सा भी है जब भारत के वर्ल्‍ड कप विजेता गेंदबाज से उनकी जमकर नोकझोक हो गई थी. यह गेंदबाज 2011 में भारत की वर्ल्‍ड कप जीतने वाली टीम का हिस्‍सा था. झगड़े का स्‍तर भी ऐसा कि गेंदबाज ने वार्न की शिकायत फ्रेंचाइजी मालिकों से कर दी थी. इस पूरे प्रकरण के दौरान वार्न बैकफुट पर थे. (AFP) इस गेंदबाज का नाम है मुनाफ पटेल. यह घटनाक्रम आईपीएल 2009 से जुड़ा है. एक न्‍यूज रिपोर्ट के अनुसार राजस्‍थान रॉयल्‍स टीम की एक लीग मैच में हार तय थी. शेन वार्न को भी यह पता था कि मैच हाथ से फिसल चुका है. ऐसे में मुनाफ पटेल को खुद पर भरोसा था कि वो मैच को अभी भी बना सकते हैं. (AFP) मुनाफ पटेल कप्‍तान शेन वार्न के पास गए और उन्‍हें गेंद थमाने का आग्रह किया. रिपोर्ट के मुताबिक वार्न ने मुनाफ की दरख्‍वास्‍त को दरकिनार कर दिया और उन्‍हें उक्‍त मैच में गेंदबाजी का मौका नहीं दिया. मैच के बाद इसे लेकर भारतीय गेंदबाज ने खुलकर अपनी नाराजगी वार्न से जताई. (AFP) मुनाफ पटेल यहीं नहीं रुके. वो राजस्‍थान रॉयल्‍स फ्रेंचाइजी मालिकों से भी मिले और शेन वार्न के खिलाफ अपना दर्द बयां किया. इसके बाद फ्रेंचाइजी की तरफ से भी वार्न से संपर्क किया गया. उन्‍हें बताया गया कि मामले को यहीं खत्‍म किया जाए और मुनाफ पटेल से इस बाबत बात की जाए. (AFP) रिपोर्ट में बताया गया कि इसके बाद शेन वार्न मुनाफ पटेल से मिलने के लिए उनके होटल रूम में गए थे. मुनाफ ने अपने कप्‍तान के लिए रूम का दरवाजा तक नहीं खोला. वो वार्न से इतने ज्‍यादा नाराज थे कि उन्‍होंने अपने कप्‍तान को बाहर से ही वापस लौट जाने के लिए कह दिया था. (AFP)","pubDate":"2023-03-15 16:51:33","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/Irfan-Pathan-Yusuf-Pathan-Munaf-Patel-Instagram-16788971963x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"},{"title":"Ranmith’s superb 139 takes Ragama to 302/8","link":"https://www.dailynews.lk/2023/03/16/sports/299440/ranmith%E2%80%99s-superb-139-takes-ragama-3028","keywords":null,"creator":["malinga"],"video_url":null,"description":"SportsTags: Print EditionRanmith Jayasena stroked a superb knock of 139 in 217 balls with 15 fours and a six as Ragama CC scored a formidable total of 302 for 8 wickets at close of the first day in the Major Clubs Under 23 cricket tournament semi-final fixture played at CCC grounds yesterday. Former Peterite skipper Ranmith Jayasena was leading from the front while Skipper Dellon Pieris (43) and Kalhara Seneviratne ( 52) also made useful cintributiins for Ragama CC. Leg spinner Vijayakanth Vayaskanth a product of Jaffna took bowling honours of the first day taking 3 for 85 for Tamil Union. Chief scores At CCC grounds Ragama CC: 302 for 8 wickets in 90 overs Dulaj Bandara 15, Avishka Tharindu 10, Ranmith Jayasena 139, Dellon Pieris 43, Kalhara Seneviratne 52, Vijayakanth Viyaskanth 3/85, Naveen Fernando 2/25 vs Tamil Union. (D.R.) Thursday, March 16, 2023 - 01:00","content":"Ranmith Jayasena stroked a superb knock of 139 in 217 balls with 15 fours and a six as Ragama CC scored a formidable total of 302 for 8 wickets at close of the first day in the Major Clubs Under 23 cricket tournament semi-final fixture played at CCC grounds yesterday. Former Peterite skipper Ranmith Jayasena was leading from the front while Skipper Dellon Pieris (43) and Kalhara Seneviratne ( 52) also made useful cintributiins for Ragama CC. Leg spinner Vijayakanth Vayaskanth a product of Jaffna took bowling honours of the first day taking 3 for 85 for Tamil Union. At CCC grounds Ragama CC: 302 for 8 wickets in 90 overs Dulaj Bandara 15, Avishka Tharindu 10, Ranmith Jayasena 139, Dellon Pieris 43, Kalhara Seneviratne 52, Vijayakanth Viyaskanth 3/85, Naveen Fernando 2/25 vs Tamil Union.","pubDate":"2023-03-15 15:48:26","image_url":null,"source_id":"dailynews","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"St. Servatius’ Matara into semi final","link":"https://www.dailynews.lk/2023/03/16/sports/299438/st-servatius%E2%80%99-matara-semi-final","keywords":null,"creator":["malinga"],"video_url":null,"description":"SportsTags: Print EditionSt. Servatius’ College Matara advanced to the semi final of the Under 19 Inter Schools Division One Tier ‘B’ 2 Day Cricket tournament yesterday. St. Servatius College Matara won the first innings against Ananda College Colombo in the quarter final played at Uyanwatta stadium Matara. St. Servatius Matara: 308/9 (87.5) (Chiran Neththaru 124, Mithila Charles 72, Viran Chamuditha 34, Thisan Dewmith 23 n.o., Ruvishan Perera 3/51, Ayesh Shashimal 3/83, Yehan 2/38) and 130/2 (29) (Tharush Damindu 51 n.o., Vishwa Supun 34 n.o., Diniru Abeywickramasinghe 28) Ananda Colombo: 181 (76.5) (Mihin Munasinghe 59, Kithma Sithmal 33, Viran Chamuditha 5/58, Tharush Damindu 2/32, Chathum Bimsara 2/37). ON DAY ONE Maris Stella College Negombo leading the first inning against St. Sylvester’s College Kandy on day one in the quarter final at Katunayake yesterday. * At Katunayake. St. Sylvesters College, Kandy: 161 (47.1) (Malith Lakshan 68, Khanka Wickramasinghe 28, Kavishka Imesh 22, Ramith Bandara 4/24, Shean Adithya 3/29, Chirath Adithya 2/43) Maris Stella College, Negombo: 163/4 (34) (Shean Adithya 46, Sadew Rathnayaka 38, Ramith Bandara 34, Anshen De Silva 21) (YK) Thursday, March 16, 2023 - 01:00","content":"St. Servatius’ College Matara advanced to the semi final of the Under 19 Inter Schools Division One Tier ‘B’ 2 Day Cricket tournament yesterday. St. Servatius College Matara won the first innings against Ananda College Colombo in the quarter final played at Uyanwatta stadium Matara. St. Servatius Matara: 308/9 (87.5) (Chiran Neththaru 124, Mithila Charles 72, Viran Chamuditha 34, Thisan Dewmith 23 n.o., Ruvishan Perera 3/51, Ayesh Shashimal 3/83, Yehan 2/38) and 130/2 (29) (Tharush Damindu 51 n.o., Vishwa Supun 34 n.o., Diniru Abeywickramasinghe 28) Ananda Colombo: 181 (76.5) (Mihin Munasinghe 59, Kithma Sithmal 33, Viran Chamuditha 5/58, Tharush Damindu 2/32, Chathum Bimsara 2/37). Maris Stella College Negombo leading the first inning against St. Sylvester’s College Kandy on day one in the quarter final at Katunayake yesterday. * At Katunayake. St. Sylvesters College, Kandy: 161 (47.1) (Malith Lakshan 68, Khanka Wickramasinghe 28, Kavishka Imesh 22, Ramith Bandara 4/24, Shean Adithya 3/29, Chirath Adithya 2/43) Maris Stella College, Negombo: 163/4 (34) (Shean Adithya 46, Sadew Rathnayaka 38, Ramith Bandara 34, Anshen De Silva 21)","pubDate":"2023-03-15 15:46:05","image_url":null,"source_id":"dailynews","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"युवराज सिंह के साथी की 10 साल बाद वापसी, प्लेइंग इलेवन में मिलेगा मौका! कोच और कप्तान करेंगे फैसला","link":"https://hindi.news18.com/photogallery/sports/cricket-jaydev-unadkat-will-be-able-to-make-comeback-in-playing-xi-after-10-years-rahul-dravid-and-hardik-pandya-decide-5545705.html","keywords":["क्रिकेट"],"creator":null,"video_url":null,"description":"भारतीय क्रिकेट टीम ने ऑस्ट्रेलिया के खिलाफ 4 मैचों की टेस्ट सीरीज में 2-1 से जीत हासिल कर बॉर्डर- गावस्कर ट्रॉफी पर लगातार चौथी बार कब्जा जमाया. अब 3 मैचों की वनडे सीरीज में दोनों टीमों के बीच मुकाबला होगा. सीरीज का पहला मैच मुंबई में खेला जाना है और इस मैच में सबकी नजरें टीम इंडिया में 10 साल बाद जगह बनाने वाले तेज गेंदबाज की होगी. युवराज सिंह और सुरेश रैना के साथ महेंद्र सिंह धोनी की कप्तानी में आखिरी बार वनडे खेलने वाले इस खिलाड़ी को प्लेइंग इलेवन में जगह मिलेगी या नहीं देखना दिलचस्प होगा.","content":"Loading... Loading... Loading... Loading... भारत और ऑस्ट्रेलिया के बीच 3 मैचों की वनडे सीरीज का पहला मुकाबला मुंबई के वानखेडे स्टेडियम में खेला जाना है. 17 मार्च को होने वाले मैच में नियमित कप्तान रोहित शर्मा नहीं खेलेंगे. टी20 टीम की कप्तानी करने वाले हार्दिक पंड्या पर टीम की जिम्मेदारी रहेगी. इस मैच में प्लेइंग इलेवन कैसी होगी इसको लेकर कोच राहुल द्रविड़ और कप्तान हार्दिक को काफी माथा पच्ची करनी होगी.-AP ऑस्ट्रेलिया के खिलाफ वनडे सीरीज के लिए चयनकर्ताओं ने 10 साल के बाद तेज गेंदबाज जयदेव उनादकट को फिर से मौका देने का फैसला लिया. साल 2013 के बाद एक बार फिर से उन्होंने टीम में जगह बनाई है. बांग्लादेश के दौरे पर चुनी गई टेस्ट टीम में 12 साल के बाद वापसी करते हुए जयदेव उनादकट ने प्लेइंग इलेवन में जगह बनाई थी. -AP ऑस्ट्रेलिया के खिलाफ जयदेव उनादकट को चयनकर्ताओं ने वनडे टीम में जगह तो दी है लेकिन उनका प्लेइंग इलेवन में जगह बनाना मुश्किल होगा. अनुभवी मोहम्मद शमी और नई सनसनी बनकर उभरे मोहम्मद सिराज की जोड़ी को ही कप्तान और कोच की पहली पसंद होगी. इसके अलावा शार्दुल ठाकुर भी तेज गेंदबाजी का विकल्प हैं जो बल्ले से भी योगदान कर सकते हैं.-AP जयदेव उनादकट ने आखिरी बार महेंद्र सिंह धोनी की कप्तानी में 2013 में वेस्टइंडीज के खिलाफ वनडे मैच खेला था. इस मैच में उनको साथी रहे युवराज सिंह और सुरेश रैना कप्तान धोनी सभी इंटरनेशनल क्रिकेट से संन्यास ले चुके हैं. मोहम्मद शमी ने उनके साथ मैच खेला था और पहले वनडे में भी उनका खेलना तय माना जा रहा है.-AP 2013 में वेस्टइंडीज के खिलाफ खेले गए मुकाबले में जयदेव उनादकट ने 6 ओवर गेंदबाजी की थी. 39 रन खर्च करने के बाद भी उनके खाते में कोई विकेट नहीं आया था. इस मैच के बाद उनको वनडे टीम से बाहर कर दिया गया था. भारत की तरफ से उनादकट ने कुल 7 वनडे खेले हैं जिसमें उनके नाम 8 विकेट हैं. -AfP","pubDate":"2023-03-15 15:46:01","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/03/MS-Dhoni-Yuvraj-Singh-AP-1-16785415903x2.jpg?im=FitAndFill,width=1200,height=675","source_id":"hindinews18","category":["sports"],"country":["india"],"language":"hindi"}]}