{"newsArray":[{"article_id":"4289ff991af6fa90af7db394f9c4d4ac","title":"Ricky Ponting predicts Australia’s ‘clear’ David Warner move","link":"https://7news.com.au/sport/cricket/ricky-ponting-predicts-australias-clear-david-warner-move-c-12734752","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"The cricket oracle has looked into his crystal ball and declared how the Test summer will unfold.","content":"Ricky Ponting insists Cameron Bancroft should be David Warner’s replacement once the veteran Australia opener bows out of Test in January. WA’s Bancroft is again the Sheffield Shield’s top run-scorer after smashing 945 runs - almost 300 more than the next best - last summer. Despite the 31-year-old’s domestic success, Bancroft was still overlooked for Marcus Harris for a spare batting spot in Australia’s Ashes squad in June. Harris and Queenslander Matt Renshaw loom as the other candidates at the top of the order to partner Usman Khawaja after Warner’s farewell at the SCG. However, Ponting believes Bancroft needed to be recalled for his first Test since 2019 due to his sheer weight of runs. “If you look at those three guys, I think it’s quite clear that Bancroft is the one that’s got the runs on the board and I wouldn’t be surprised if they (selectors) go that way,” the legendary former Australia captain told SEN on Thursday. “If you wind the clock back about six months it might have been a slightly different order than what it is now. “I think they probably had Harris as the one that would come back in a while ago. To me now it sort of feels (there’s) a bit more of a groundswell behind Cameron Bancroft getting first crack.” Australian captain Pat Cummins said this week Warner’s performances would decide his place in the Test side. “He’s a great of our game in all formats,” the skipper said. “First and foremost, you always think of the performance side of things when you’re picking a side. “He was brilliant this World Cup. He’d go on and take the game on, be brave and really put it back on the opposition. “He’s hitting the ball beautifully at the moment.” Elsewhere, Australia coach Andrew McDonald has floated the possibility of Marnus Labuschagne moving up from No.3 to open so allrounder Cameron Green can slot back into the Test XI. But Ponting has cautioned against such a move, saying Green should be forced to earn his spot by finding form in the Shield with WA. But the prodigiously talented 24-year-old was dropped during the Ashes, just months after his maiden Test century, for Mitchell Marsh. “I think Cameron Green might just have to sit back and bide his time and wait for the opportunity to come back,” Ponting said. “He can get a truckload of runs in Shield cricket and sort of force his way back into the side. “Labuschagne has been outstanding at number three for Australia, it’s very much a specialist position.” Ponting also believes enigmatic allrounder Glenn Maxwell should seriously be considered for a Test recall after his stunning white-ball success in India. The Victorian played the last of his seven Tests in 2017, but his three recent international centuries, two in the ODI World Cup and one in a T20, have been irresistible. “I could see him (Maxwell) getting back into a Test line-up because of the all-round game that he brings in those conditions,” Ponting said. “The (201) not out in that game against Afghanistan, which is the most remarkable one-day innings I’ve ever seen. “I’ve been around a lot of games, watched a lot of games, played a lot of games, I’ve never ever seen anything like that.” Ponting, who captained Australia to World Cup titles in 2003 and 2007, has urged Pat Cummins’ team to maintain the rage in the Test summer when they host Pakistan and the struggling West Indies. “I’d be saying to go as hard as you can and just really try and bury these teams and win as convincingly as you can,” Ponting said.","pubDate":"2023-11-30 01:01:53","image_url":"https://images.7news.com.au/publication/C-12734752/c89d98ff9b3a780ed530eaf3bb42de0049b5c2b3-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"e59292260411d0c5c56703d44192466a","title":"Uganda cricket on the cusp of making history","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/30/uganda-cricket-on-the-cusp-of-making-history-2637474.html","keywords":null,"creator":null,"video_url":null,"description":"They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. CHENNAI: With the 33-run win against Kenya in the ongoing ICC Men’s T20 World Cup Africa Region Qualifier on Wednesday, Uganda are a step closer to sealing their spot for the global event in USA and West Indies next year. Having won three of their four matches already, Uganda needed a win against Kenya to keep the dream alive. And there was only one spot open with Namibia already securing theirs. Uganda did what was required. They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. The fireworks at the end was provided by Dinesh Nakrani who smashed a quickfire 40 from 23 balls. With the ball, Bilal Hassan took four for 39 as Uganda restricted Kenya to 129 all out. With the victory, they have eight points in five games to be second on the table. All they need to ensure their qualification for the T20 World Cup on Thursday is to beat Rwanda — a team they have not lost to in each of their last 16 encounters — in the final league game. Rooting against them would be Zimbabwe, who beat Nigeria to keep their hopes alive. Skipper Sikandar Raza took two wickets before hitting a 37-ball 65 to take his team home in a 111-run chase. With six points, Zimbabwe are placed third in table, but have a NRR of 2.322, which is much higher than that of Uganda (0.759). For them to qualify, they have to beat Kenya and hope that Uganda loses to Rwanda. If it does not happen, Zimbabwe will miss the T20 World Cup. They also missed the ticket to the recently concluded ODI World Cup in the qualifiers this year. For Uganda, it would be an historic achievement for it will be their first ever appearance in a ICC World Cup. Brief scores: Uganda 162/5 in 20 ovs (Simon 60, Dinesh 40 n.o) bt Kenya 129 all out in 19 ovs (Collins 34; Bilal Hassan 4/39); Nigeria 110/8 (Ridwan 24; Raza 2/13) lost to Zimbabwe 111/4 in 14 ovs (Raza 65; Asia 2/18); Tanzania 153/8 in 20 ovs (Salum Jumbe 76 n.o) bt Rwanda 102/7 in 20 ovs (Martin Akayezu 37 n.o; Mohammed Issa 2/9).","content":"CHENNAI: With the 33-run win against Kenya in the ongoing ICC Men’s T20 World Cup Africa Region Qualifier on Wednesday, Uganda are a step closer to sealing their spot for the global event in USA and West Indies next year. Having won three of their four matches already, Uganda needed a win against Kenya to keep the dream alive. And there was only one spot open with Namibia already securing theirs. Uganda did what was required. They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. The fireworks at the end was provided by Dinesh Nakrani who smashed a quickfire 40 from 23 balls. With the ball, Bilal Hassan took four for 39 as Uganda restricted Kenya to 129 all out. With the victory, they have eight points in five games to be second on the table. All they need to ensure their qualification for the T20 World Cup on Thursday is to beat Rwanda — a team they have not lost to in each of their last 16 encounters — in the final league game. Rooting against them would be Zimbabwe, who beat Nigeria to keep their hopes alive. Skipper Sikandar Raza took two wickets before hitting a 37-ball 65 to take his team home in a 111-run chase. With six points, Zimbabwe are placed third in table, but have a NRR of 2.322, which is much higher than that of Uganda (0.759). For them to qualify, they have to beat Kenya and hope that Uganda loses to Rwanda. If it does not happen, Zimbabwe will miss the T20 World Cup. They also missed the ticket to the recently concluded ODI World Cup in the qualifiers this year. For Uganda, it would be an historic achievement for it will be their first ever appearance in a ICC World Cup. : Uganda 162/5 in 20 ovs (Simon 60, Dinesh 40 n.o) bt Kenya 129 all out in 19 ovs (Collins 34; Bilal Hassan 4/39); Nigeria 110/8 (Ridwan 24; Raza 2/13) lost to Zimbabwe 111/4 in 14 ovs (Raza 65; Asia 2/18); Tanzania 153/8 in 20 ovs (Salum Jumbe 76 n.o) bt Rwanda 102/7 in 20 ovs (Martin Akayezu 37 n.o; Mohammed Issa 2/9).","pubDate":"2023-11-30 00:37:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/11/30/original/Uganda_cricket.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"cf53eeb25dac32567533518ccfc51ff0","title":"'हमें 400 रन बनाने होंगे..' पाक के नए कप्तान ने बताया जीत का फॉर्मूला","link":"https://hindi.news18.com/cricket/we-need-to-score-400-shan-masood-wants-to-create-history-on-pakistan-vs-australia-test-series-7864078.html","keywords":null,"creator":null,"video_url":null,"description":"वर्ल्ड कप में खराब प्रदर्शन के बाद पाकिस्तान की टीम नए कप्तान शान मसूद के नेतृत्व में ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज के लिए तैयार है. इसके लिए कप्तान शान मसूद ने हुंकार भर दी है. उन्होंने प्रेस कॉन्फ्रेंस में टीम को लेकर बड़ी प्रतिक्रिया दी.","content":"शान मसूद की कप्तानी में पाकिस्तान की टीम ऑस्ट्रेलिया दौरे पर जा रही है. (shan masood insta) नई दिल्ली . वर्ल्ड कप के बाद पाकिस्तान टीम में काफी उथल-पुथल देखने को मिली. बाबर आजम ने पाकिस्तान पहुंचते ही अपने पद से इस्तीफा दे दिया. मेगा इवेंट के बाद पाकिस्तान की टीम नए कप्तान शान मसूद के साथ ऑस्ट्रेलिया दौरे के लिए तैयार है. यह दौरा पाकिस्तान की टीम के लिए ऐतिहासिक साबित होगा, क्योंकि पाकिस्तान की टीम ने इस दौरे पर अभी तक एक भी टेस्ट सीरीज अपने नाम नहीं की है. लेकिन इस बार टीम के नवनियुक्त कप्तान पूरे जोश से सीरीज खेलने को तैयार हैं, उन्होंने इसके लिए हुंकार भर दी है. उन्होंने टीम की रवानगी से पहले लाहौर में प्रेस कॉन्फ्रेंस में कहा, ‘जब आपने इतिहास में कुछ हासिल नहीं किया है, तो आपके पास इसे बदलने का अवसर है. इसलिए हम पाकिस्तान और विश्व टेस्ट चैंपियनशिप के लिए सकारात्मक परिणाम देने का प्रयास करेंगे. हमें 400 रन बनाने होंगे और फिर 20 विकेट लेने होंगे. हमने 2019 में अपने पिछले दौरे पर ऐसा नहीं किया था, इसलिए यही लक्ष्य है. सकारात्मक बात यह होगी कि अच्छा खेलने का विश्वास होगा और खेलने वाले सभी लोग ऑस्ट्रेलिया को कुछ कठिन समय देने में योगदान देंगे.’ मसूद ने बताया कैसी है टीम की तैयारी? उन्होंने टीम की तैयारी को लेकर कहा, ‘हमने रावलपिंडी में अपने प्रशिक्षण शिविर में ऑस्ट्रेलियाई परिस्थितियों के मुताबिक प्रैक्टिस की, जहां एक उछाल भरी पिच है.’ इसके अलावा नए बैटिंग कोच और इंग्लैंड के पूर्व कप्तान एडम हॉलीओक के बारे में मसूद ने कहा, ‘टीमें ऐसे लोगों को नियुक्त करती हैं जिनके पास स्थानीय ज्ञान है और वह ऑस्ट्रेलियाई परिस्थितियों के विशेषज्ञ हैं. इसलिए उनकी नियुक्ति से हमें उन परिस्थितियों में खुद को लागू करने में मदद मिलेगी.’\\ IPL 2024: ‘मुझे उनसे काफी सीखने को मिला’ कप्तानी मिलने के बाद क्या बोले शुभमन गिल? 2 दिग्गजों की तरफ किया इशारा पाकिस्तान की टीम ऑस्ट्रेलिया के खिलाफ पहला टेस्ट मैच 14 दिसंबर को खेलेगी. वर्ल्ड टेस्ट चैंपियनशिप के लिहाज से यह सीरीज पाकिस्तान की टीम और शान मसूद की कप्तानी के लिए काफी अहम होने वाली है. अब देखना दिलचस्प होगा इस सीरीज में पाकिस्तान की टीम में का हीरो कौन साबित होता है? . Tags: Pakistan cricket team Ranbir vs Vicky नहीं, संदीप-मेघना के विजन की है टक्कर, एक 7 फिल्मों का अनुभवी तो दूसरा बॉक्स ऑफिस का राजा एक्ट्रेस की असल जिंदगी में हुई 'महाभारत', प्यार में 2 बार खाया धोखा, 57 साल में अकेले काट रहीं जिंदगी Photos: यहां बसाई गई है तितलियों की दुनिया... बिहार से लेकर बेंगलुरु तक की देख सकेंगे तितलियां","pubDate":"2023-11-30 00:16:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/11/Shan-masood-insta-2023-11-916b40441b859744283cb53bf668e5c6-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ecc7c5fb6994e75e7c2bd443ed4af02d","title":"Ponting picks Bancroft as Warner's Test successor","link":"https://www.blayneychronicle.com.au/story/8442589/ponting-picks-bancroft-as-warners-test-successor/?src=rss","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":null,"content":"Ricky Ponting insists Cameron Bancroft should be David Warner's replacement once the veteran Australia opener bows out of Test cricket in January. / (min cost $ 8 ) Login or signup to continue reading WA's Bancroft is again the Sheffield Shield's top run-scorer after smashing 945 runs - almost 300 more than the next best - last summer. Despite the 31-year-old's domestic success, Bancroft was still overlooked for Marcus Harris for a spare batting spot in Australia's Ashes squad in June. Harris and Queenslander Matt Renshaw loom as the other candidates at the top of the order to partner Usman Khawaja after Warner's farewell at the SCG. However, Ponting believes Bancroft needed to be recalled for his first Test since 2019 due to his sheer weight of runs. \"If you look at those three guys, I think it's quite clear that Bancroft is the one that's got the runs on the board and I wouldn't be surprised if they (selectors) go that way,\" the legendary former Australia captain told SEN on Thursday. \"If you wind the clock back about six months it might have been a slightly different order than what it is now. \"I think they probably had Harris as the one that would come back in a while ago. \"To me now it sort of feels (there's) a bit more of a groundswell behind Cameron Bancroft getting first crack.\" Australia coach Andrew McDonald has floated the possibility of Marnus Labuschagne moving up from No.3 to open so allrounder Cameron Green can slot back into the Test XI. But Ponting has cautioned against such a move, saying Green should be forced to earn his spot by finding form in the Shield with WA. But the prodigiously talented 24-year-old was dropped during the Ashes, just months after his maiden Test century, for Mitchell Marsh. \"I think Cameron Green might just have to sit back and bide his time and wait for the opportunity to come back,\" Ponting said. \"He can get a truckload of runs in Shield cricket and sort of force his way back into the side. \"Labuschagne has been outstanding at number three for Australia, it's very much a specialist position.\" Ponting also believes enigmatic allrounder Glenn Maxwell should seriously be considered for a Test recall after his stunning white-ball success in India. The Victorian played the last of his seven Tests in 2017, but his three recent international centuries, two in the ODI World Cup and one in a T20, have been irresistible. \"I could see him (Maxwell) getting back into a Test line-up because of the all round game that he brings in those conditions,\" Ponting said. \"The (201) not out in that game against Afghanistan, which is the most remarkable one-day innings I've ever seen. \"I've been around a lot of games, watched a lot of games, played a lot of games, I've never ever seen anything like that.\" Ponting, who captained Australia to World Cup titles in 2003 and 2007, has urged Pat Cummins' team to maintain the rage in the Test summer when they host Pakistan and the struggling West Indies. \"I'd be saying to go as hard as you can and just really try and bury these teams and win as convincingly as you can,\" Ponting said. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-11-30 00:13:27","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/73b2938a-0199-4ce5-832c-5a06d8fecb7c.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"7ca7b894edb107bbecf855c554cc6c9c","title":"Selectors set to be first casualties post World Cup","link":"http://island.lk/selectors-set-to-be-first-casualties-post-world-cup/","keywords":["Sports","Members of the national selection panel","Sri Lanka Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Rex Clementine Members of the national selection panel are set to be the first casualties post World Cup in which the national cricket team had a disastrous campaign. Despite Sri Lanka finishing ninth in the ten-team event and failing to qualify for the Champions Trophy, none holding key positions within the national cricket […]","content":"Members of the national selection panel are set to be the first casualties post World Cup in which the national cricket team had a disastrous campaign. Despite Sri Lanka finishing ninth in the ten-team event and failing to qualify for the Champions Trophy, none holding key positions within the national cricket team had stepped down. Although previous Sports Minister Roshan Ranasinghe and other bodies attached to the Sports Ministry were keen to change the selection panel headed by former fast bowler Pramodya Wickremasinghe, there was tough resistance from Sri Lanka Cricket (SLC). However, with Harin Fernando taking charge as Sports Minister following the dismissal of Ranasinghe, Fernando had discussed changes moving forward with fresh thinking coming in. Accordingly, SLC will advertise for selectors and in due time will pick a competent team. Under Pramodya, Sri Lanka ended up playing three qualifying round tournaments to go through for ICC events, a trend that had never happened previously. The selectors decision to bench half a dozen seniors from the white ball sides also didn’t go down too well and eventually they had to bite the bullet and fall back on the likes of Angelo Mathews. However, one of the finest all-rounders Sri Lanka had Thisara Perera had quit international cricket by then. Former captain Marvan Atapattu had been approached to take over as new Chief Selector, but The Island learns that he had declined the role and wasn’t keen to be involved in cricket in any capacity at the moment. Former fast bowler Ashantha de Mel is a possible candidate to become the Chief Selector again. De Mel has had several stints with the last being from 2019 to 2021 and the highlight during his tenure was Sri Lanka becoming the first Asian nation to win a Test series in South Africa. It remains to be seen which other former cricketers will apply for the post of selectors. SLC is also likely to not renew the contracts of several individuals within the coaching set up of the national cricket team. However, former captain and Consultant Coach Mahela Jayawardene is likely to get an extension despite an embarrassing World Cup campaign, Sri Lanka’s worst since 1999. Sri Lanka’s next campaign will be the bilateral white ball series against Zimbabwe at home in January. All key slots are expected to be filled by that series.","pubDate":"2023-11-30 00:00:24","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3d5bd89e6e3f0edac14004d55ef1f6c7","title":"Colombo South win Under 15 Youth League final in style","link":"http://island.lk/colombo-south-win-under-15-youth-league-final-in-style/","keywords":["Sports","Colombo South win Under 15","Sri Lanka youth League"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Reemus Fernando Royal College batsman Rehan Peiris scored his second century, a run-a-ball 129 for Colombo South Under 15s before their bowlers produced a combined effort to record a comfortable 86 runs victory against Colombo North in the Sri Lanka Cricket conducted Under 15 Youth League final at MCA ground on Wednesday. Chasing a […]","content":"Royal College batsman Rehan Peiris scored his second century, a run-a-ball 129 for Colombo South Under 15s before their bowlers produced a combined effort to record a comfortable 86 runs victory against Colombo North in the Sri Lanka Cricket conducted Under 15 Youth League final at MCA ground on Wednesday. Chasing a target of 257 runs to win, Colombo North played second fiddle and were never in the hunt as they lost wickets at regular intervals. Sadeesha Silva resisted anchoring the innings with 47 runs but he lacked support from the rest. Yenula Dantanarayana and Lahiru Lakmal made 20s. For the winners Holy Cross College, Kalutara spinner Himaru Deshan and Cambrian Rusandu Silva bowled tight spells. Deshan and Silva gave away just 27 and 22 runs respectively during their quota of ten overs. Both took one wicket each. Deshan, who ended up as the highest wicket taker of the tournament had three maidens in his ten overs. Janul Damhiru who shared the new ball with Dunitha Anusara picked up two wickets. Anusara, Yasaru Praveen and Matheesha Aponso picked up one wicket each. Earlier deciding to bat first, Colombo South lost their first wicket for 11 runs. But a second wicket stand of 110 runs between Peiris and Lasiru Sandakan (Royal, Panadura) provided a solid base for them to post a formidable total. After Sandakan was dismissed for 40 runs Peiris joined St. Peter’s wicketkeeper batsman Jason Fernando to post 96 runs for the third wicket. Peiris scored ten sixes and five fours in his innings, while Fernando made 19 runs. Colombo South consisted of players from Royal, Colombo, Royal, Panadura, D.S. Senanayake, Colombo, St. Peter’s, Bambalapitiya, Prince of Wales, Holy Cross, Kalutara, C.W.W. Kannangara and Walapura MV, Horana. They were captained by Thevindu Wewalwala of Royal College Colombo.","pubDate":"2023-11-29 23:59:23","image_url":"http://island.lk/wp-content/uploads/2023/11/scorecard-1.jpg","source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3324566634cb38177bc50dcd22acb224","title":"El Oasis de los Sueños","link":"https://www.tvazteca.com/aztecadeportes/oasis-suenos-antonio-rosique","keywords":["Columnas Azteca"],"creator":null,"video_url":null,"description":"Ha nacido Baseball United, una liga internacional, iniciativa de los Emiratos Arabes Unidos, que conectará a tres poderosos mercados y cuatro importantes ciudades","content":"Imagínate un diamante del beisbol en medio del desierto. Conectar un jonrón en Dubai ; lanzar una recta de 100 millas en Abu Dhabi ; ejecutar un doble play en la India; un robo de base en Pakistán. El beisbol se ha lanzado a conquistar un nuevo territorio: el corazón de Asia . Ha nacido Baseball United , una liga internacional, iniciativa de los Emiratos Arabes Unidos , que conectará a tres poderosos mercados y cuatro importantes ciudades. Son cuatro equipos que han captado peloteros que brillaron en las Grandes Ligas y que aún tienen mucho beisbol que ofrecer: Robinson Canó, Bartolo Colón, Didi Gregorius, Pablo Sandoval, “Kung Fu Panda”, Andrelton Simmons, Alex Liddi , entre otros hombres con pasado ligamayorista. Te puede interesar: La tempestad sigue ahí ¿Chivas puede competir ante América, Rayados y Tigres? Baseball United apunta a una región que es el epicentro de la pasión por el bat y la pelota; un mercado con más de mil millones de aficionados al cricket, deporte nacional de la India y Pakistán, fanáticos que vibran lanzando y bateando en las calles más populosas del planeta. Bombai , la ciudad más poderosa de la India (21 millones de habitantes) contará con las Mumbai Cobras . Serán dirigidos por dos leyendas de los Rojos de Cincinatti : Barry Larkin (Miembro del Salón de la Fama) en la oficina; y Chris Sabo (Novato del año 1988 y ganador de la Serie Mundial de 1990) como manager. Karachi , (14m. hab.) capital de Pakistán, tendrá a los Karachi “Monarchs” ; liderados los dominicanos Adrián Beltré , quien pronto estará en el Salón de la Fama de las Ligas Mayores , y Miguel Tejada (manager), quien fue MVP 2002 y seis veces All Star en MLB . 6 RUN HOME RUN! The first moneyball home run hit in Baseball United History goes to Pablo Sandoval @KFP48 “Lock it! Cock it! Rocket! Restock it!” pic.twitter.com/QBLqTy025I Abu Dhabi , capital de los Emiratos Árabes Unidos , tendrá a los Abu Dhabi Falcons ; dirigidos de forma honoraria desde la oficina por Nick Swisher , que ganó la Serie Mundial con los Yankees , y en la caseta por Dennis Cook , pitcher ganador del Clásico de Otoño en 1997 con los Florida Marlins. La imponente y sofisticada Dubai , tendrá a los “ Dubai Wolfs ” (Lobos”). Quienes contarán con el “Rey” Félix Hernández (ganador del trofeo Cy Young y seis veces All Star ) como Gerente General Honorario , y con John Mclaren , quien fue manager de los Marineros de Seattle y que tiene más de 40 años de experiencia como coach de Ligas Mayores . Cuatro franquicias profesionales de alto poder adquisitivo han comenzado a captar talento en el sureste asíatico. La India , con 1,400 millones de habitantes, y Pakistan , con 234m. son habitats llenos de jóvenes que nacieron lanzando y bateando pelotas de cricket, el deporte de conjunto número uno en esa región. Se trata de una vieja hipótesis del beisbol de Grandes Ligas , que fue llevada al cine por Disney en la película “El Brazo del Millón de Dólares” (2014). Es una historia basada en hechos reales, la cual relata la aventura agente de jugadores, J.B. Bernstein , quien se queda sin peloteros que representar y se lanza a la India a buscar un joven prodigio que pueda tener una oportunidad en las Grandes Ligas . Al final, Bernstein logró llevar a dos jóvenes se convirtieron en los primeros pitchers de nacionalidad india de la historia en ser firmados por la organización de los Piratas de Pittsburgh . “Hay veces que para ganar, tienes que cambiar el juego”, sostiene la frase promocional de la película. Adicionalmente, con el poderío económico de la región, más de un pelotero profesional volteará a analizar sus posibilidades en la nueva Baseball United . Esto amplia la oferta para los peloteros latinos, incluyendo por supuesto a los mexicanos, aquellos que no logren -por alguna razón- un lugar en Grandes Ligas , de firmar un contrato de alto valor. Es así como el beisbol manifiesta abiertamente su intención de convertirse en un deporte global; algo que ya se viene trabajando con el éxito del Clásico Mundial del Beisbol . Por lo pronto, este viernes y sábado, Baseball United se presenta ante los ojos del mundo con la Serie de las Estrellas , dos juegos de exhibición en el Estadio Internacional de Dubai. El Este contra el Oeste, con los peloteros estelares de los dos equipos. Y en 2024 la “ Baseball United ” cantará el “play ball” de su primera temporada en medio oriente y el sureste asiático. Cobras, Halcones, Lobos y Monarcas ya encendieron la chispa. Lejos de contraerse, este fabuloso juego -que nació hace siglo y medio- en los Estados Unidos, está por sembrar “el pasto más verde que has visto” en tu vida en medio del desierto y con el inigualable Taj Mahal en el horizonte. Te puede interesar: Revelaciones del año: Osmar y Emiliano","pubDate":"2023-11-29 23:38:11","image_url":"https://tvazteca.brightspotcdn.com/7b/94/68521d764480b45942e213140aa0/ha-nacido-baseball-united.jpg","source_id":"tvazteca","source_priority":16758,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"5db212806aa2e53b9a6926d3557983e7","title":"Namibia qualify for 2024 Men’s T20 World Cup","link":"https://fingaz.co.zw/namibia-qualify-for-2024-mens-t20-world-cup/","keywords":["Sport"],"creator":["Own Correspondent"],"video_url":null,"description":"Namibia have booked their spot at the 2024 Men’s T20 World Cup after guaranteeing a top-two finish in African qualifying with a game to spare. The Eagles secured a 58-run over Tanzania in Windhoek and sit top of the table with five wins from five after previous victories against Zimbabwe, Uganda, Rwanda and Kenya. Next […] The post Namibia qualify for 2024 Men’s T20 World Cup appeared first on The Financial Gazette.","content":"Namibia have booked their spot at the 2024 Men’s T20 World Cup after guaranteeing a top-two finish in African qualifying with a game to spare. The Eagles secured a 58-run over Tanzania in Windhoek and sit top of the table with five wins from five after previous victories against Zimbabwe, Uganda, Rwanda and Kenya. Next year’s 20-team tournament in the United States and the West Indies will be Namibia’s third consecutive appearance at the T20 World Cup. “We’re very proud of the boys, of Pierre de Bruyn and his coaching team and also Gerhard Erasmus, the captain of the team,” Rudie van Vuuren, president of Cricket Namibia, told BBC Sport Africa. “The boys played professional cricket throughout, really a high standard of cricket. “And you can see the fact that we have a professional set-up eventually makes the difference in this kind of tournament.” The side reached the Super 12 stage as first-time qualifiers in the UAE in 2021 but then suffered a first round group-stage exit in Australia last year. Uganda, Kenya and Zimbabwe remain in contention to secure second spot in the table and join Namibia at the T20 World Cup next year, with Uganda facing east African rivals Kenya on Wednesday. Namibia, who will co-host the Cricket World Cup in 2027 alongside South Africa and Zimbabwe, finish their group campaign against Nigeria on Thursday. “It is exciting times for Namibia,” Van Vuuren added. “We have a strong pipeline developing. We look forward to the T20 World Cup and then, building on that, the Under-19 World Cup in 2026 and obviously the 50-over World Cup in 2027.” – bbc.com","pubDate":"2023-11-29 22:38:10","image_url":null,"source_id":"fingaz","source_priority":10986220,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"87fc5d38024e1859ac95a06fedc70087","title":"Lady Chevrons ready for Uganda","link":"https://www.herald.co.zw/lady-chevrons-ready-for-uganda/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Blessing Malinganiza LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons […]","content":"LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons went on to host an unofficial series against South African Emerging side as they rounded up their preparations. Despite losing 2-3, Lady Chevrons skipper, Musonda believes the series gave her charges of some game situations as they put what they had trained into practice. “The series was very competitive and we learnt a lot in a short space of time and mainly the series taught us on how to manage our batting in the power play and also to create some good partnerships if we are to post a competitive score. “The series gave us an appreciation of a game situation and I believe from the series managing our we have improved our game sense,” said Musonda. With the qualifiers for the two global spots coming on next week, Musonda believes that they have done all they could have asked for as they prepared for the qualifiers and now they are ready for the challenge. “I think we have done all we could and now comes the time to deliver in Uganda and we are ready to fight for a spot to qualify for the global qualifiers and everyone is raring to go,” said Musonda. With the lady Chevrons having a mixture of experience and youth, the Lady Chevrons skipper has described the infusion of the young players having brought some energy to the team. “The composition of the squad is good. We’re in a good space on and off the field. “The younger players are bringing in great energy and are performing well as well and the seniors are bringing in their expertise and believe the blending will be play a pivotal role at the qualifiers,” said Musonda. The Lady Chevrons will now head to Uganda next week where they will battle it out with Botswana, Kenya, Namibia, Nigeria, Rwanda, Tanzania and the hosts for two slots at the final. Brandon Moyo IT was not the start that Zimbabwe’s Under-21 women’s hockey team would have hoped for in the 2023 International Hockey Federation Hockey Women’s Junior World Cup after they were humiliated by South Korea in their opening match in Santiago, Chile yesterday. Zimbabwe suffered a heavy 6-0 defeat in their opening Group B encounter […] Lovemore Dube THE Zimbabwe Saints FC leadership has described Andrew Kadengu, who died at Chinhoyi Hospital on Tuesday, as having been a very influential player at the club. He was 72 at the time of his death. Kadengu stroked about two months ago and his health deteriorated leading to his death on Tuesday. Kadengu played […] ABU DHABI. — The Asian Tour has welcomed the launch of the LIV Golf Promotions event as another breakthrough moment for golf in the region, with Cho Minn Thant, its Commissioner & CEO, describing it a “an incredible, life-changing opportunity.” The innovative and inclusive new event, which will provide a pathway onto the world’s most […]","pubDate":"2023-11-29 22:02:50","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"467d337e3b3390d8651a25588850a78a","title":"St Paul’s Musami bounce back","link":"https://www.herald.co.zw/st-pauls-musami-bounce-back/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Don Makanyanga-Sports Reporter AFTER more than 50 years in the oblivion, St Paul’s Musami is set to bounce back on the domestic football arena next season. After winning the championship in 1966, St Paul’s Musami was disbanded four years later. 57-years later a club that held the longest record for a team outside Harare and […]","content":"Blessing Malinganiza LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons […] Brandon Moyo IT was not the start that Zimbabwe’s Under-21 women’s hockey team would have hoped for in the 2023 International Hockey Federation Hockey Women’s Junior World Cup after they were humiliated by South Korea in their opening match in Santiago, Chile yesterday. Zimbabwe suffered a heavy 6-0 defeat in their opening Group B encounter […] Lovemore Dube THE Zimbabwe Saints FC leadership has described Andrew Kadengu, who died at Chinhoyi Hospital on Tuesday, as having been a very influential player at the club. He was 72 at the time of his death. Kadengu stroked about two months ago and his health deteriorated leading to his death on Tuesday. Kadengu played […]","pubDate":"2023-11-29 22:02:14","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"4289ff991af6fa90af7db394f9c4d4ac","title":"Ricky Ponting predicts Australia’s ‘clear’ David Warner move","link":"https://7news.com.au/sport/cricket/ricky-ponting-predicts-australias-clear-david-warner-move-c-12734752","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"The cricket oracle has looked into his crystal ball and declared how the Test summer will unfold.","content":"Ricky Ponting insists Cameron Bancroft should be David Warner’s replacement once the veteran Australia opener bows out of Test in January. WA’s Bancroft is again the Sheffield Shield’s top run-scorer after smashing 945 runs - almost 300 more than the next best - last summer. Despite the 31-year-old’s domestic success, Bancroft was still overlooked for Marcus Harris for a spare batting spot in Australia’s Ashes squad in June. Harris and Queenslander Matt Renshaw loom as the other candidates at the top of the order to partner Usman Khawaja after Warner’s farewell at the SCG. However, Ponting believes Bancroft needed to be recalled for his first Test since 2019 due to his sheer weight of runs. “If you look at those three guys, I think it’s quite clear that Bancroft is the one that’s got the runs on the board and I wouldn’t be surprised if they (selectors) go that way,” the legendary former Australia captain told SEN on Thursday. “If you wind the clock back about six months it might have been a slightly different order than what it is now. “I think they probably had Harris as the one that would come back in a while ago. To me now it sort of feels (there’s) a bit more of a groundswell behind Cameron Bancroft getting first crack.” Australian captain Pat Cummins said this week Warner’s performances would decide his place in the Test side. “He’s a great of our game in all formats,” the skipper said. “First and foremost, you always think of the performance side of things when you’re picking a side. “He was brilliant this World Cup. He’d go on and take the game on, be brave and really put it back on the opposition. “He’s hitting the ball beautifully at the moment.” Elsewhere, Australia coach Andrew McDonald has floated the possibility of Marnus Labuschagne moving up from No.3 to open so allrounder Cameron Green can slot back into the Test XI. But Ponting has cautioned against such a move, saying Green should be forced to earn his spot by finding form in the Shield with WA. But the prodigiously talented 24-year-old was dropped during the Ashes, just months after his maiden Test century, for Mitchell Marsh. “I think Cameron Green might just have to sit back and bide his time and wait for the opportunity to come back,” Ponting said. “He can get a truckload of runs in Shield cricket and sort of force his way back into the side. “Labuschagne has been outstanding at number three for Australia, it’s very much a specialist position.” Ponting also believes enigmatic allrounder Glenn Maxwell should seriously be considered for a Test recall after his stunning white-ball success in India. The Victorian played the last of his seven Tests in 2017, but his three recent international centuries, two in the ODI World Cup and one in a T20, have been irresistible. “I could see him (Maxwell) getting back into a Test line-up because of the all-round game that he brings in those conditions,” Ponting said. “The (201) not out in that game against Afghanistan, which is the most remarkable one-day innings I’ve ever seen. “I’ve been around a lot of games, watched a lot of games, played a lot of games, I’ve never ever seen anything like that.” Ponting, who captained Australia to World Cup titles in 2003 and 2007, has urged Pat Cummins’ team to maintain the rage in the Test summer when they host Pakistan and the struggling West Indies. “I’d be saying to go as hard as you can and just really try and bury these teams and win as convincingly as you can,” Ponting said.","pubDate":"2023-11-30 01:01:53","image_url":"https://images.7news.com.au/publication/C-12734752/c89d98ff9b3a780ed530eaf3bb42de0049b5c2b3-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"e59292260411d0c5c56703d44192466a","title":"Uganda cricket on the cusp of making history","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/30/uganda-cricket-on-the-cusp-of-making-history-2637474.html","keywords":null,"creator":null,"video_url":null,"description":"They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. CHENNAI: With the 33-run win against Kenya in the ongoing ICC Men’s T20 World Cup Africa Region Qualifier on Wednesday, Uganda are a step closer to sealing their spot for the global event in USA and West Indies next year. Having won three of their four matches already, Uganda needed a win against Kenya to keep the dream alive. And there was only one spot open with Namibia already securing theirs. Uganda did what was required. They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. The fireworks at the end was provided by Dinesh Nakrani who smashed a quickfire 40 from 23 balls. With the ball, Bilal Hassan took four for 39 as Uganda restricted Kenya to 129 all out. With the victory, they have eight points in five games to be second on the table. All they need to ensure their qualification for the T20 World Cup on Thursday is to beat Rwanda — a team they have not lost to in each of their last 16 encounters — in the final league game. Rooting against them would be Zimbabwe, who beat Nigeria to keep their hopes alive. Skipper Sikandar Raza took two wickets before hitting a 37-ball 65 to take his team home in a 111-run chase. With six points, Zimbabwe are placed third in table, but have a NRR of 2.322, which is much higher than that of Uganda (0.759). For them to qualify, they have to beat Kenya and hope that Uganda loses to Rwanda. If it does not happen, Zimbabwe will miss the T20 World Cup. They also missed the ticket to the recently concluded ODI World Cup in the qualifiers this year. For Uganda, it would be an historic achievement for it will be their first ever appearance in a ICC World Cup. Brief scores: Uganda 162/5 in 20 ovs (Simon 60, Dinesh 40 n.o) bt Kenya 129 all out in 19 ovs (Collins 34; Bilal Hassan 4/39); Nigeria 110/8 (Ridwan 24; Raza 2/13) lost to Zimbabwe 111/4 in 14 ovs (Raza 65; Asia 2/18); Tanzania 153/8 in 20 ovs (Salum Jumbe 76 n.o) bt Rwanda 102/7 in 20 ovs (Martin Akayezu 37 n.o; Mohammed Issa 2/9).","content":"CHENNAI: With the 33-run win against Kenya in the ongoing ICC Men’s T20 World Cup Africa Region Qualifier on Wednesday, Uganda are a step closer to sealing their spot for the global event in USA and West Indies next year. Having won three of their four matches already, Uganda needed a win against Kenya to keep the dream alive. And there was only one spot open with Namibia already securing theirs. Uganda did what was required. They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. The fireworks at the end was provided by Dinesh Nakrani who smashed a quickfire 40 from 23 balls. With the ball, Bilal Hassan took four for 39 as Uganda restricted Kenya to 129 all out. With the victory, they have eight points in five games to be second on the table. All they need to ensure their qualification for the T20 World Cup on Thursday is to beat Rwanda — a team they have not lost to in each of their last 16 encounters — in the final league game. Rooting against them would be Zimbabwe, who beat Nigeria to keep their hopes alive. Skipper Sikandar Raza took two wickets before hitting a 37-ball 65 to take his team home in a 111-run chase. With six points, Zimbabwe are placed third in table, but have a NRR of 2.322, which is much higher than that of Uganda (0.759). For them to qualify, they have to beat Kenya and hope that Uganda loses to Rwanda. If it does not happen, Zimbabwe will miss the T20 World Cup. They also missed the ticket to the recently concluded ODI World Cup in the qualifiers this year. For Uganda, it would be an historic achievement for it will be their first ever appearance in a ICC World Cup. : Uganda 162/5 in 20 ovs (Simon 60, Dinesh 40 n.o) bt Kenya 129 all out in 19 ovs (Collins 34; Bilal Hassan 4/39); Nigeria 110/8 (Ridwan 24; Raza 2/13) lost to Zimbabwe 111/4 in 14 ovs (Raza 65; Asia 2/18); Tanzania 153/8 in 20 ovs (Salum Jumbe 76 n.o) bt Rwanda 102/7 in 20 ovs (Martin Akayezu 37 n.o; Mohammed Issa 2/9).","pubDate":"2023-11-30 00:37:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/11/30/original/Uganda_cricket.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"cf53eeb25dac32567533518ccfc51ff0","title":"'हमें 400 रन बनाने होंगे..' पाक के नए कप्तान ने बताया जीत का फॉर्मूला","link":"https://hindi.news18.com/cricket/we-need-to-score-400-shan-masood-wants-to-create-history-on-pakistan-vs-australia-test-series-7864078.html","keywords":null,"creator":null,"video_url":null,"description":"वर्ल्ड कप में खराब प्रदर्शन के बाद पाकिस्तान की टीम नए कप्तान शान मसूद के नेतृत्व में ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज के लिए तैयार है. इसके लिए कप्तान शान मसूद ने हुंकार भर दी है. उन्होंने प्रेस कॉन्फ्रेंस में टीम को लेकर बड़ी प्रतिक्रिया दी.","content":"शान मसूद की कप्तानी में पाकिस्तान की टीम ऑस्ट्रेलिया दौरे पर जा रही है. (shan masood insta) नई दिल्ली . वर्ल्ड कप के बाद पाकिस्तान टीम में काफी उथल-पुथल देखने को मिली. बाबर आजम ने पाकिस्तान पहुंचते ही अपने पद से इस्तीफा दे दिया. मेगा इवेंट के बाद पाकिस्तान की टीम नए कप्तान शान मसूद के साथ ऑस्ट्रेलिया दौरे के लिए तैयार है. यह दौरा पाकिस्तान की टीम के लिए ऐतिहासिक साबित होगा, क्योंकि पाकिस्तान की टीम ने इस दौरे पर अभी तक एक भी टेस्ट सीरीज अपने नाम नहीं की है. लेकिन इस बार टीम के नवनियुक्त कप्तान पूरे जोश से सीरीज खेलने को तैयार हैं, उन्होंने इसके लिए हुंकार भर दी है. उन्होंने टीम की रवानगी से पहले लाहौर में प्रेस कॉन्फ्रेंस में कहा, ‘जब आपने इतिहास में कुछ हासिल नहीं किया है, तो आपके पास इसे बदलने का अवसर है. इसलिए हम पाकिस्तान और विश्व टेस्ट चैंपियनशिप के लिए सकारात्मक परिणाम देने का प्रयास करेंगे. हमें 400 रन बनाने होंगे और फिर 20 विकेट लेने होंगे. हमने 2019 में अपने पिछले दौरे पर ऐसा नहीं किया था, इसलिए यही लक्ष्य है. सकारात्मक बात यह होगी कि अच्छा खेलने का विश्वास होगा और खेलने वाले सभी लोग ऑस्ट्रेलिया को कुछ कठिन समय देने में योगदान देंगे.’ मसूद ने बताया कैसी है टीम की तैयारी? उन्होंने टीम की तैयारी को लेकर कहा, ‘हमने रावलपिंडी में अपने प्रशिक्षण शिविर में ऑस्ट्रेलियाई परिस्थितियों के मुताबिक प्रैक्टिस की, जहां एक उछाल भरी पिच है.’ इसके अलावा नए बैटिंग कोच और इंग्लैंड के पूर्व कप्तान एडम हॉलीओक के बारे में मसूद ने कहा, ‘टीमें ऐसे लोगों को नियुक्त करती हैं जिनके पास स्थानीय ज्ञान है और वह ऑस्ट्रेलियाई परिस्थितियों के विशेषज्ञ हैं. इसलिए उनकी नियुक्ति से हमें उन परिस्थितियों में खुद को लागू करने में मदद मिलेगी.’\\ IPL 2024: ‘मुझे उनसे काफी सीखने को मिला’ कप्तानी मिलने के बाद क्या बोले शुभमन गिल? 2 दिग्गजों की तरफ किया इशारा पाकिस्तान की टीम ऑस्ट्रेलिया के खिलाफ पहला टेस्ट मैच 14 दिसंबर को खेलेगी. वर्ल्ड टेस्ट चैंपियनशिप के लिहाज से यह सीरीज पाकिस्तान की टीम और शान मसूद की कप्तानी के लिए काफी अहम होने वाली है. अब देखना दिलचस्प होगा इस सीरीज में पाकिस्तान की टीम में का हीरो कौन साबित होता है? . Tags: Pakistan cricket team Ranbir vs Vicky नहीं, संदीप-मेघना के विजन की है टक्कर, एक 7 फिल्मों का अनुभवी तो दूसरा बॉक्स ऑफिस का राजा एक्ट्रेस की असल जिंदगी में हुई 'महाभारत', प्यार में 2 बार खाया धोखा, 57 साल में अकेले काट रहीं जिंदगी Photos: यहां बसाई गई है तितलियों की दुनिया... बिहार से लेकर बेंगलुरु तक की देख सकेंगे तितलियां","pubDate":"2023-11-30 00:16:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/11/Shan-masood-insta-2023-11-916b40441b859744283cb53bf668e5c6-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ecc7c5fb6994e75e7c2bd443ed4af02d","title":"Ponting picks Bancroft as Warner's Test successor","link":"https://www.blayneychronicle.com.au/story/8442589/ponting-picks-bancroft-as-warners-test-successor/?src=rss","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":null,"content":"Ricky Ponting insists Cameron Bancroft should be David Warner's replacement once the veteran Australia opener bows out of Test cricket in January. / (min cost $ 8 ) Login or signup to continue reading WA's Bancroft is again the Sheffield Shield's top run-scorer after smashing 945 runs - almost 300 more than the next best - last summer. Despite the 31-year-old's domestic success, Bancroft was still overlooked for Marcus Harris for a spare batting spot in Australia's Ashes squad in June. Harris and Queenslander Matt Renshaw loom as the other candidates at the top of the order to partner Usman Khawaja after Warner's farewell at the SCG. However, Ponting believes Bancroft needed to be recalled for his first Test since 2019 due to his sheer weight of runs. \"If you look at those three guys, I think it's quite clear that Bancroft is the one that's got the runs on the board and I wouldn't be surprised if they (selectors) go that way,\" the legendary former Australia captain told SEN on Thursday. \"If you wind the clock back about six months it might have been a slightly different order than what it is now. \"I think they probably had Harris as the one that would come back in a while ago. \"To me now it sort of feels (there's) a bit more of a groundswell behind Cameron Bancroft getting first crack.\" Australia coach Andrew McDonald has floated the possibility of Marnus Labuschagne moving up from No.3 to open so allrounder Cameron Green can slot back into the Test XI. But Ponting has cautioned against such a move, saying Green should be forced to earn his spot by finding form in the Shield with WA. But the prodigiously talented 24-year-old was dropped during the Ashes, just months after his maiden Test century, for Mitchell Marsh. \"I think Cameron Green might just have to sit back and bide his time and wait for the opportunity to come back,\" Ponting said. \"He can get a truckload of runs in Shield cricket and sort of force his way back into the side. \"Labuschagne has been outstanding at number three for Australia, it's very much a specialist position.\" Ponting also believes enigmatic allrounder Glenn Maxwell should seriously be considered for a Test recall after his stunning white-ball success in India. The Victorian played the last of his seven Tests in 2017, but his three recent international centuries, two in the ODI World Cup and one in a T20, have been irresistible. \"I could see him (Maxwell) getting back into a Test line-up because of the all round game that he brings in those conditions,\" Ponting said. \"The (201) not out in that game against Afghanistan, which is the most remarkable one-day innings I've ever seen. \"I've been around a lot of games, watched a lot of games, played a lot of games, I've never ever seen anything like that.\" Ponting, who captained Australia to World Cup titles in 2003 and 2007, has urged Pat Cummins' team to maintain the rage in the Test summer when they host Pakistan and the struggling West Indies. \"I'd be saying to go as hard as you can and just really try and bury these teams and win as convincingly as you can,\" Ponting said. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-11-30 00:13:27","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/73b2938a-0199-4ce5-832c-5a06d8fecb7c.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"7ca7b894edb107bbecf855c554cc6c9c","title":"Selectors set to be first casualties post World Cup","link":"http://island.lk/selectors-set-to-be-first-casualties-post-world-cup/","keywords":["Sports","Members of the national selection panel","Sri Lanka Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Rex Clementine Members of the national selection panel are set to be the first casualties post World Cup in which the national cricket team had a disastrous campaign. Despite Sri Lanka finishing ninth in the ten-team event and failing to qualify for the Champions Trophy, none holding key positions within the national cricket […]","content":"Members of the national selection panel are set to be the first casualties post World Cup in which the national cricket team had a disastrous campaign. Despite Sri Lanka finishing ninth in the ten-team event and failing to qualify for the Champions Trophy, none holding key positions within the national cricket team had stepped down. Although previous Sports Minister Roshan Ranasinghe and other bodies attached to the Sports Ministry were keen to change the selection panel headed by former fast bowler Pramodya Wickremasinghe, there was tough resistance from Sri Lanka Cricket (SLC). However, with Harin Fernando taking charge as Sports Minister following the dismissal of Ranasinghe, Fernando had discussed changes moving forward with fresh thinking coming in. Accordingly, SLC will advertise for selectors and in due time will pick a competent team. Under Pramodya, Sri Lanka ended up playing three qualifying round tournaments to go through for ICC events, a trend that had never happened previously. The selectors decision to bench half a dozen seniors from the white ball sides also didn’t go down too well and eventually they had to bite the bullet and fall back on the likes of Angelo Mathews. However, one of the finest all-rounders Sri Lanka had Thisara Perera had quit international cricket by then. Former captain Marvan Atapattu had been approached to take over as new Chief Selector, but The Island learns that he had declined the role and wasn’t keen to be involved in cricket in any capacity at the moment. Former fast bowler Ashantha de Mel is a possible candidate to become the Chief Selector again. De Mel has had several stints with the last being from 2019 to 2021 and the highlight during his tenure was Sri Lanka becoming the first Asian nation to win a Test series in South Africa. It remains to be seen which other former cricketers will apply for the post of selectors. SLC is also likely to not renew the contracts of several individuals within the coaching set up of the national cricket team. However, former captain and Consultant Coach Mahela Jayawardene is likely to get an extension despite an embarrassing World Cup campaign, Sri Lanka’s worst since 1999. Sri Lanka’s next campaign will be the bilateral white ball series against Zimbabwe at home in January. All key slots are expected to be filled by that series.","pubDate":"2023-11-30 00:00:24","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3d5bd89e6e3f0edac14004d55ef1f6c7","title":"Colombo South win Under 15 Youth League final in style","link":"http://island.lk/colombo-south-win-under-15-youth-league-final-in-style/","keywords":["Sports","Colombo South win Under 15","Sri Lanka youth League"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Reemus Fernando Royal College batsman Rehan Peiris scored his second century, a run-a-ball 129 for Colombo South Under 15s before their bowlers produced a combined effort to record a comfortable 86 runs victory against Colombo North in the Sri Lanka Cricket conducted Under 15 Youth League final at MCA ground on Wednesday. Chasing a […]","content":"Royal College batsman Rehan Peiris scored his second century, a run-a-ball 129 for Colombo South Under 15s before their bowlers produced a combined effort to record a comfortable 86 runs victory against Colombo North in the Sri Lanka Cricket conducted Under 15 Youth League final at MCA ground on Wednesday. Chasing a target of 257 runs to win, Colombo North played second fiddle and were never in the hunt as they lost wickets at regular intervals. Sadeesha Silva resisted anchoring the innings with 47 runs but he lacked support from the rest. Yenula Dantanarayana and Lahiru Lakmal made 20s. For the winners Holy Cross College, Kalutara spinner Himaru Deshan and Cambrian Rusandu Silva bowled tight spells. Deshan and Silva gave away just 27 and 22 runs respectively during their quota of ten overs. Both took one wicket each. Deshan, who ended up as the highest wicket taker of the tournament had three maidens in his ten overs. Janul Damhiru who shared the new ball with Dunitha Anusara picked up two wickets. Anusara, Yasaru Praveen and Matheesha Aponso picked up one wicket each. Earlier deciding to bat first, Colombo South lost their first wicket for 11 runs. But a second wicket stand of 110 runs between Peiris and Lasiru Sandakan (Royal, Panadura) provided a solid base for them to post a formidable total. After Sandakan was dismissed for 40 runs Peiris joined St. Peter’s wicketkeeper batsman Jason Fernando to post 96 runs for the third wicket. Peiris scored ten sixes and five fours in his innings, while Fernando made 19 runs. Colombo South consisted of players from Royal, Colombo, Royal, Panadura, D.S. Senanayake, Colombo, St. Peter’s, Bambalapitiya, Prince of Wales, Holy Cross, Kalutara, C.W.W. Kannangara and Walapura MV, Horana. They were captained by Thevindu Wewalwala of Royal College Colombo.","pubDate":"2023-11-29 23:59:23","image_url":"http://island.lk/wp-content/uploads/2023/11/scorecard-1.jpg","source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3324566634cb38177bc50dcd22acb224","title":"El Oasis de los Sueños","link":"https://www.tvazteca.com/aztecadeportes/oasis-suenos-antonio-rosique","keywords":["Columnas Azteca"],"creator":null,"video_url":null,"description":"Ha nacido Baseball United, una liga internacional, iniciativa de los Emiratos Arabes Unidos, que conectará a tres poderosos mercados y cuatro importantes ciudades","content":"Imagínate un diamante del beisbol en medio del desierto. Conectar un jonrón en Dubai ; lanzar una recta de 100 millas en Abu Dhabi ; ejecutar un doble play en la India; un robo de base en Pakistán. El beisbol se ha lanzado a conquistar un nuevo territorio: el corazón de Asia . Ha nacido Baseball United , una liga internacional, iniciativa de los Emiratos Arabes Unidos , que conectará a tres poderosos mercados y cuatro importantes ciudades. Son cuatro equipos que han captado peloteros que brillaron en las Grandes Ligas y que aún tienen mucho beisbol que ofrecer: Robinson Canó, Bartolo Colón, Didi Gregorius, Pablo Sandoval, “Kung Fu Panda”, Andrelton Simmons, Alex Liddi , entre otros hombres con pasado ligamayorista. Te puede interesar: La tempestad sigue ahí ¿Chivas puede competir ante América, Rayados y Tigres? Baseball United apunta a una región que es el epicentro de la pasión por el bat y la pelota; un mercado con más de mil millones de aficionados al cricket, deporte nacional de la India y Pakistán, fanáticos que vibran lanzando y bateando en las calles más populosas del planeta. Bombai , la ciudad más poderosa de la India (21 millones de habitantes) contará con las Mumbai Cobras . Serán dirigidos por dos leyendas de los Rojos de Cincinatti : Barry Larkin (Miembro del Salón de la Fama) en la oficina; y Chris Sabo (Novato del año 1988 y ganador de la Serie Mundial de 1990) como manager. Karachi , (14m. hab.) capital de Pakistán, tendrá a los Karachi “Monarchs” ; liderados los dominicanos Adrián Beltré , quien pronto estará en el Salón de la Fama de las Ligas Mayores , y Miguel Tejada (manager), quien fue MVP 2002 y seis veces All Star en MLB . 6 RUN HOME RUN! The first moneyball home run hit in Baseball United History goes to Pablo Sandoval @KFP48 “Lock it! Cock it! Rocket! Restock it!” pic.twitter.com/QBLqTy025I Abu Dhabi , capital de los Emiratos Árabes Unidos , tendrá a los Abu Dhabi Falcons ; dirigidos de forma honoraria desde la oficina por Nick Swisher , que ganó la Serie Mundial con los Yankees , y en la caseta por Dennis Cook , pitcher ganador del Clásico de Otoño en 1997 con los Florida Marlins. La imponente y sofisticada Dubai , tendrá a los “ Dubai Wolfs ” (Lobos”). Quienes contarán con el “Rey” Félix Hernández (ganador del trofeo Cy Young y seis veces All Star ) como Gerente General Honorario , y con John Mclaren , quien fue manager de los Marineros de Seattle y que tiene más de 40 años de experiencia como coach de Ligas Mayores . Cuatro franquicias profesionales de alto poder adquisitivo han comenzado a captar talento en el sureste asíatico. La India , con 1,400 millones de habitantes, y Pakistan , con 234m. son habitats llenos de jóvenes que nacieron lanzando y bateando pelotas de cricket, el deporte de conjunto número uno en esa región. Se trata de una vieja hipótesis del beisbol de Grandes Ligas , que fue llevada al cine por Disney en la película “El Brazo del Millón de Dólares” (2014). Es una historia basada en hechos reales, la cual relata la aventura agente de jugadores, J.B. Bernstein , quien se queda sin peloteros que representar y se lanza a la India a buscar un joven prodigio que pueda tener una oportunidad en las Grandes Ligas . Al final, Bernstein logró llevar a dos jóvenes se convirtieron en los primeros pitchers de nacionalidad india de la historia en ser firmados por la organización de los Piratas de Pittsburgh . “Hay veces que para ganar, tienes que cambiar el juego”, sostiene la frase promocional de la película. Adicionalmente, con el poderío económico de la región, más de un pelotero profesional volteará a analizar sus posibilidades en la nueva Baseball United . Esto amplia la oferta para los peloteros latinos, incluyendo por supuesto a los mexicanos, aquellos que no logren -por alguna razón- un lugar en Grandes Ligas , de firmar un contrato de alto valor. Es así como el beisbol manifiesta abiertamente su intención de convertirse en un deporte global; algo que ya se viene trabajando con el éxito del Clásico Mundial del Beisbol . Por lo pronto, este viernes y sábado, Baseball United se presenta ante los ojos del mundo con la Serie de las Estrellas , dos juegos de exhibición en el Estadio Internacional de Dubai. El Este contra el Oeste, con los peloteros estelares de los dos equipos. Y en 2024 la “ Baseball United ” cantará el “play ball” de su primera temporada en medio oriente y el sureste asiático. Cobras, Halcones, Lobos y Monarcas ya encendieron la chispa. Lejos de contraerse, este fabuloso juego -que nació hace siglo y medio- en los Estados Unidos, está por sembrar “el pasto más verde que has visto” en tu vida en medio del desierto y con el inigualable Taj Mahal en el horizonte. Te puede interesar: Revelaciones del año: Osmar y Emiliano","pubDate":"2023-11-29 23:38:11","image_url":"https://tvazteca.brightspotcdn.com/7b/94/68521d764480b45942e213140aa0/ha-nacido-baseball-united.jpg","source_id":"tvazteca","source_priority":16758,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"5db212806aa2e53b9a6926d3557983e7","title":"Namibia qualify for 2024 Men’s T20 World Cup","link":"https://fingaz.co.zw/namibia-qualify-for-2024-mens-t20-world-cup/","keywords":["Sport"],"creator":["Own Correspondent"],"video_url":null,"description":"Namibia have booked their spot at the 2024 Men’s T20 World Cup after guaranteeing a top-two finish in African qualifying with a game to spare. The Eagles secured a 58-run over Tanzania in Windhoek and sit top of the table with five wins from five after previous victories against Zimbabwe, Uganda, Rwanda and Kenya. Next […] The post Namibia qualify for 2024 Men’s T20 World Cup appeared first on The Financial Gazette.","content":"Namibia have booked their spot at the 2024 Men’s T20 World Cup after guaranteeing a top-two finish in African qualifying with a game to spare. The Eagles secured a 58-run over Tanzania in Windhoek and sit top of the table with five wins from five after previous victories against Zimbabwe, Uganda, Rwanda and Kenya. Next year’s 20-team tournament in the United States and the West Indies will be Namibia’s third consecutive appearance at the T20 World Cup. “We’re very proud of the boys, of Pierre de Bruyn and his coaching team and also Gerhard Erasmus, the captain of the team,” Rudie van Vuuren, president of Cricket Namibia, told BBC Sport Africa. “The boys played professional cricket throughout, really a high standard of cricket. “And you can see the fact that we have a professional set-up eventually makes the difference in this kind of tournament.” The side reached the Super 12 stage as first-time qualifiers in the UAE in 2021 but then suffered a first round group-stage exit in Australia last year. Uganda, Kenya and Zimbabwe remain in contention to secure second spot in the table and join Namibia at the T20 World Cup next year, with Uganda facing east African rivals Kenya on Wednesday. Namibia, who will co-host the Cricket World Cup in 2027 alongside South Africa and Zimbabwe, finish their group campaign against Nigeria on Thursday. “It is exciting times for Namibia,” Van Vuuren added. “We have a strong pipeline developing. We look forward to the T20 World Cup and then, building on that, the Under-19 World Cup in 2026 and obviously the 50-over World Cup in 2027.” – bbc.com","pubDate":"2023-11-29 22:38:10","image_url":null,"source_id":"fingaz","source_priority":10986220,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"87fc5d38024e1859ac95a06fedc70087","title":"Lady Chevrons ready for Uganda","link":"https://www.herald.co.zw/lady-chevrons-ready-for-uganda/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Blessing Malinganiza LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons […]","content":"LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons went on to host an unofficial series against South African Emerging side as they rounded up their preparations. Despite losing 2-3, Lady Chevrons skipper, Musonda believes the series gave her charges of some game situations as they put what they had trained into practice. “The series was very competitive and we learnt a lot in a short space of time and mainly the series taught us on how to manage our batting in the power play and also to create some good partnerships if we are to post a competitive score. “The series gave us an appreciation of a game situation and I believe from the series managing our we have improved our game sense,” said Musonda. With the qualifiers for the two global spots coming on next week, Musonda believes that they have done all they could have asked for as they prepared for the qualifiers and now they are ready for the challenge. “I think we have done all we could and now comes the time to deliver in Uganda and we are ready to fight for a spot to qualify for the global qualifiers and everyone is raring to go,” said Musonda. With the lady Chevrons having a mixture of experience and youth, the Lady Chevrons skipper has described the infusion of the young players having brought some energy to the team. “The composition of the squad is good. We’re in a good space on and off the field. “The younger players are bringing in great energy and are performing well as well and the seniors are bringing in their expertise and believe the blending will be play a pivotal role at the qualifiers,” said Musonda. The Lady Chevrons will now head to Uganda next week where they will battle it out with Botswana, Kenya, Namibia, Nigeria, Rwanda, Tanzania and the hosts for two slots at the final. Brandon Moyo IT was not the start that Zimbabwe’s Under-21 women’s hockey team would have hoped for in the 2023 International Hockey Federation Hockey Women’s Junior World Cup after they were humiliated by South Korea in their opening match in Santiago, Chile yesterday. Zimbabwe suffered a heavy 6-0 defeat in their opening Group B encounter […] Lovemore Dube THE Zimbabwe Saints FC leadership has described Andrew Kadengu, who died at Chinhoyi Hospital on Tuesday, as having been a very influential player at the club. He was 72 at the time of his death. Kadengu stroked about two months ago and his health deteriorated leading to his death on Tuesday. Kadengu played […] ABU DHABI. — The Asian Tour has welcomed the launch of the LIV Golf Promotions event as another breakthrough moment for golf in the region, with Cho Minn Thant, its Commissioner & CEO, describing it a “an incredible, life-changing opportunity.” The innovative and inclusive new event, which will provide a pathway onto the world’s most […]","pubDate":"2023-11-29 22:02:50","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"467d337e3b3390d8651a25588850a78a","title":"St Paul’s Musami bounce back","link":"https://www.herald.co.zw/st-pauls-musami-bounce-back/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Don Makanyanga-Sports Reporter AFTER more than 50 years in the oblivion, St Paul’s Musami is set to bounce back on the domestic football arena next season. After winning the championship in 1966, St Paul’s Musami was disbanded four years later. 57-years later a club that held the longest record for a team outside Harare and […]","content":"Blessing Malinganiza LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons […] Brandon Moyo IT was not the start that Zimbabwe’s Under-21 women’s hockey team would have hoped for in the 2023 International Hockey Federation Hockey Women’s Junior World Cup after they were humiliated by South Korea in their opening match in Santiago, Chile yesterday. Zimbabwe suffered a heavy 6-0 defeat in their opening Group B encounter […] Lovemore Dube THE Zimbabwe Saints FC leadership has described Andrew Kadengu, who died at Chinhoyi Hospital on Tuesday, as having been a very influential player at the club. He was 72 at the time of his death. Kadengu stroked about two months ago and his health deteriorated leading to his death on Tuesday. Kadengu played […]","pubDate":"2023-11-29 22:02:14","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"4289ff991af6fa90af7db394f9c4d4ac","title":"Ricky Ponting predicts Australia’s ‘clear’ David Warner move","link":"https://7news.com.au/sport/cricket/ricky-ponting-predicts-australias-clear-david-warner-move-c-12734752","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"The cricket oracle has looked into his crystal ball and declared how the Test summer will unfold.","content":"Ricky Ponting insists Cameron Bancroft should be David Warner’s replacement once the veteran Australia opener bows out of Test in January. WA’s Bancroft is again the Sheffield Shield’s top run-scorer after smashing 945 runs - almost 300 more than the next best - last summer. Despite the 31-year-old’s domestic success, Bancroft was still overlooked for Marcus Harris for a spare batting spot in Australia’s Ashes squad in June. Harris and Queenslander Matt Renshaw loom as the other candidates at the top of the order to partner Usman Khawaja after Warner’s farewell at the SCG. However, Ponting believes Bancroft needed to be recalled for his first Test since 2019 due to his sheer weight of runs. “If you look at those three guys, I think it’s quite clear that Bancroft is the one that’s got the runs on the board and I wouldn’t be surprised if they (selectors) go that way,” the legendary former Australia captain told SEN on Thursday. “If you wind the clock back about six months it might have been a slightly different order than what it is now. “I think they probably had Harris as the one that would come back in a while ago. To me now it sort of feels (there’s) a bit more of a groundswell behind Cameron Bancroft getting first crack.” Australian captain Pat Cummins said this week Warner’s performances would decide his place in the Test side. “He’s a great of our game in all formats,” the skipper said. “First and foremost, you always think of the performance side of things when you’re picking a side. “He was brilliant this World Cup. He’d go on and take the game on, be brave and really put it back on the opposition. “He’s hitting the ball beautifully at the moment.” Elsewhere, Australia coach Andrew McDonald has floated the possibility of Marnus Labuschagne moving up from No.3 to open so allrounder Cameron Green can slot back into the Test XI. But Ponting has cautioned against such a move, saying Green should be forced to earn his spot by finding form in the Shield with WA. But the prodigiously talented 24-year-old was dropped during the Ashes, just months after his maiden Test century, for Mitchell Marsh. “I think Cameron Green might just have to sit back and bide his time and wait for the opportunity to come back,” Ponting said. “He can get a truckload of runs in Shield cricket and sort of force his way back into the side. “Labuschagne has been outstanding at number three for Australia, it’s very much a specialist position.” Ponting also believes enigmatic allrounder Glenn Maxwell should seriously be considered for a Test recall after his stunning white-ball success in India. The Victorian played the last of his seven Tests in 2017, but his three recent international centuries, two in the ODI World Cup and one in a T20, have been irresistible. “I could see him (Maxwell) getting back into a Test line-up because of the all-round game that he brings in those conditions,” Ponting said. “The (201) not out in that game against Afghanistan, which is the most remarkable one-day innings I’ve ever seen. “I’ve been around a lot of games, watched a lot of games, played a lot of games, I’ve never ever seen anything like that.” Ponting, who captained Australia to World Cup titles in 2003 and 2007, has urged Pat Cummins’ team to maintain the rage in the Test summer when they host Pakistan and the struggling West Indies. “I’d be saying to go as hard as you can and just really try and bury these teams and win as convincingly as you can,” Ponting said.","pubDate":"2023-11-30 01:01:53","image_url":"https://images.7news.com.au/publication/C-12734752/c89d98ff9b3a780ed530eaf3bb42de0049b5c2b3-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"e59292260411d0c5c56703d44192466a","title":"Uganda cricket on the cusp of making history","link":"http://www.newindianexpress.com/sport/cricket/2023/nov/30/uganda-cricket-on-the-cusp-of-making-history-2637474.html","keywords":null,"creator":null,"video_url":null,"description":"They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. CHENNAI: With the 33-run win against Kenya in the ongoing ICC Men’s T20 World Cup Africa Region Qualifier on Wednesday, Uganda are a step closer to sealing their spot for the global event in USA and West Indies next year. Having won three of their four matches already, Uganda needed a win against Kenya to keep the dream alive. And there was only one spot open with Namibia already securing theirs. Uganda did what was required. They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. The fireworks at the end was provided by Dinesh Nakrani who smashed a quickfire 40 from 23 balls. With the ball, Bilal Hassan took four for 39 as Uganda restricted Kenya to 129 all out. With the victory, they have eight points in five games to be second on the table. All they need to ensure their qualification for the T20 World Cup on Thursday is to beat Rwanda — a team they have not lost to in each of their last 16 encounters — in the final league game. Rooting against them would be Zimbabwe, who beat Nigeria to keep their hopes alive. Skipper Sikandar Raza took two wickets before hitting a 37-ball 65 to take his team home in a 111-run chase. With six points, Zimbabwe are placed third in table, but have a NRR of 2.322, which is much higher than that of Uganda (0.759). For them to qualify, they have to beat Kenya and hope that Uganda loses to Rwanda. If it does not happen, Zimbabwe will miss the T20 World Cup. They also missed the ticket to the recently concluded ODI World Cup in the qualifiers this year. For Uganda, it would be an historic achievement for it will be their first ever appearance in a ICC World Cup. Brief scores: Uganda 162/5 in 20 ovs (Simon 60, Dinesh 40 n.o) bt Kenya 129 all out in 19 ovs (Collins 34; Bilal Hassan 4/39); Nigeria 110/8 (Ridwan 24; Raza 2/13) lost to Zimbabwe 111/4 in 14 ovs (Raza 65; Asia 2/18); Tanzania 153/8 in 20 ovs (Salum Jumbe 76 n.o) bt Rwanda 102/7 in 20 ovs (Martin Akayezu 37 n.o; Mohammed Issa 2/9).","content":"CHENNAI: With the 33-run win against Kenya in the ongoing ICC Men’s T20 World Cup Africa Region Qualifier on Wednesday, Uganda are a step closer to sealing their spot for the global event in USA and West Indies next year. Having won three of their four matches already, Uganda needed a win against Kenya to keep the dream alive. And there was only one spot open with Namibia already securing theirs. Uganda did what was required. They posted 162/5 in 20 overs, with opener Simon Ssesazi scoring 60 runs from 50 balls to keep the innings steady. The fireworks at the end was provided by Dinesh Nakrani who smashed a quickfire 40 from 23 balls. With the ball, Bilal Hassan took four for 39 as Uganda restricted Kenya to 129 all out. With the victory, they have eight points in five games to be second on the table. All they need to ensure their qualification for the T20 World Cup on Thursday is to beat Rwanda — a team they have not lost to in each of their last 16 encounters — in the final league game. Rooting against them would be Zimbabwe, who beat Nigeria to keep their hopes alive. Skipper Sikandar Raza took two wickets before hitting a 37-ball 65 to take his team home in a 111-run chase. With six points, Zimbabwe are placed third in table, but have a NRR of 2.322, which is much higher than that of Uganda (0.759). For them to qualify, they have to beat Kenya and hope that Uganda loses to Rwanda. If it does not happen, Zimbabwe will miss the T20 World Cup. They also missed the ticket to the recently concluded ODI World Cup in the qualifiers this year. For Uganda, it would be an historic achievement for it will be their first ever appearance in a ICC World Cup. : Uganda 162/5 in 20 ovs (Simon 60, Dinesh 40 n.o) bt Kenya 129 all out in 19 ovs (Collins 34; Bilal Hassan 4/39); Nigeria 110/8 (Ridwan 24; Raza 2/13) lost to Zimbabwe 111/4 in 14 ovs (Raza 65; Asia 2/18); Tanzania 153/8 in 20 ovs (Salum Jumbe 76 n.o) bt Rwanda 102/7 in 20 ovs (Martin Akayezu 37 n.o; Mohammed Issa 2/9).","pubDate":"2023-11-30 00:37:00","image_url":"https://images.newindianexpress.com/uploads/user/imagelibrary/2023/11/30/original/Uganda_cricket.jpg","source_id":"newindianexpress","source_priority":15406,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"cf53eeb25dac32567533518ccfc51ff0","title":"'हमें 400 रन बनाने होंगे..' पाक के नए कप्तान ने बताया जीत का फॉर्मूला","link":"https://hindi.news18.com/cricket/we-need-to-score-400-shan-masood-wants-to-create-history-on-pakistan-vs-australia-test-series-7864078.html","keywords":null,"creator":null,"video_url":null,"description":"वर्ल्ड कप में खराब प्रदर्शन के बाद पाकिस्तान की टीम नए कप्तान शान मसूद के नेतृत्व में ऑस्ट्रेलिया के खिलाफ टेस्ट सीरीज के लिए तैयार है. इसके लिए कप्तान शान मसूद ने हुंकार भर दी है. उन्होंने प्रेस कॉन्फ्रेंस में टीम को लेकर बड़ी प्रतिक्रिया दी.","content":"शान मसूद की कप्तानी में पाकिस्तान की टीम ऑस्ट्रेलिया दौरे पर जा रही है. (shan masood insta) नई दिल्ली . वर्ल्ड कप के बाद पाकिस्तान टीम में काफी उथल-पुथल देखने को मिली. बाबर आजम ने पाकिस्तान पहुंचते ही अपने पद से इस्तीफा दे दिया. मेगा इवेंट के बाद पाकिस्तान की टीम नए कप्तान शान मसूद के साथ ऑस्ट्रेलिया दौरे के लिए तैयार है. यह दौरा पाकिस्तान की टीम के लिए ऐतिहासिक साबित होगा, क्योंकि पाकिस्तान की टीम ने इस दौरे पर अभी तक एक भी टेस्ट सीरीज अपने नाम नहीं की है. लेकिन इस बार टीम के नवनियुक्त कप्तान पूरे जोश से सीरीज खेलने को तैयार हैं, उन्होंने इसके लिए हुंकार भर दी है. उन्होंने टीम की रवानगी से पहले लाहौर में प्रेस कॉन्फ्रेंस में कहा, ‘जब आपने इतिहास में कुछ हासिल नहीं किया है, तो आपके पास इसे बदलने का अवसर है. इसलिए हम पाकिस्तान और विश्व टेस्ट चैंपियनशिप के लिए सकारात्मक परिणाम देने का प्रयास करेंगे. हमें 400 रन बनाने होंगे और फिर 20 विकेट लेने होंगे. हमने 2019 में अपने पिछले दौरे पर ऐसा नहीं किया था, इसलिए यही लक्ष्य है. सकारात्मक बात यह होगी कि अच्छा खेलने का विश्वास होगा और खेलने वाले सभी लोग ऑस्ट्रेलिया को कुछ कठिन समय देने में योगदान देंगे.’ मसूद ने बताया कैसी है टीम की तैयारी? उन्होंने टीम की तैयारी को लेकर कहा, ‘हमने रावलपिंडी में अपने प्रशिक्षण शिविर में ऑस्ट्रेलियाई परिस्थितियों के मुताबिक प्रैक्टिस की, जहां एक उछाल भरी पिच है.’ इसके अलावा नए बैटिंग कोच और इंग्लैंड के पूर्व कप्तान एडम हॉलीओक के बारे में मसूद ने कहा, ‘टीमें ऐसे लोगों को नियुक्त करती हैं जिनके पास स्थानीय ज्ञान है और वह ऑस्ट्रेलियाई परिस्थितियों के विशेषज्ञ हैं. इसलिए उनकी नियुक्ति से हमें उन परिस्थितियों में खुद को लागू करने में मदद मिलेगी.’\\ IPL 2024: ‘मुझे उनसे काफी सीखने को मिला’ कप्तानी मिलने के बाद क्या बोले शुभमन गिल? 2 दिग्गजों की तरफ किया इशारा पाकिस्तान की टीम ऑस्ट्रेलिया के खिलाफ पहला टेस्ट मैच 14 दिसंबर को खेलेगी. वर्ल्ड टेस्ट चैंपियनशिप के लिहाज से यह सीरीज पाकिस्तान की टीम और शान मसूद की कप्तानी के लिए काफी अहम होने वाली है. अब देखना दिलचस्प होगा इस सीरीज में पाकिस्तान की टीम में का हीरो कौन साबित होता है? . Tags: Pakistan cricket team Ranbir vs Vicky नहीं, संदीप-मेघना के विजन की है टक्कर, एक 7 फिल्मों का अनुभवी तो दूसरा बॉक्स ऑफिस का राजा एक्ट्रेस की असल जिंदगी में हुई 'महाभारत', प्यार में 2 बार खाया धोखा, 57 साल में अकेले काट रहीं जिंदगी Photos: यहां बसाई गई है तितलियों की दुनिया... बिहार से लेकर बेंगलुरु तक की देख सकेंगे तितलियां","pubDate":"2023-11-30 00:16:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/11/Shan-masood-insta-2023-11-916b40441b859744283cb53bf668e5c6-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"ecc7c5fb6994e75e7c2bd443ed4af02d","title":"Ponting picks Bancroft as Warner's Test successor","link":"https://www.blayneychronicle.com.au/story/8442589/ponting-picks-bancroft-as-warners-test-successor/?src=rss","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":null,"content":"Ricky Ponting insists Cameron Bancroft should be David Warner's replacement once the veteran Australia opener bows out of Test cricket in January. / (min cost $ 8 ) Login or signup to continue reading WA's Bancroft is again the Sheffield Shield's top run-scorer after smashing 945 runs - almost 300 more than the next best - last summer. Despite the 31-year-old's domestic success, Bancroft was still overlooked for Marcus Harris for a spare batting spot in Australia's Ashes squad in June. Harris and Queenslander Matt Renshaw loom as the other candidates at the top of the order to partner Usman Khawaja after Warner's farewell at the SCG. However, Ponting believes Bancroft needed to be recalled for his first Test since 2019 due to his sheer weight of runs. \"If you look at those three guys, I think it's quite clear that Bancroft is the one that's got the runs on the board and I wouldn't be surprised if they (selectors) go that way,\" the legendary former Australia captain told SEN on Thursday. \"If you wind the clock back about six months it might have been a slightly different order than what it is now. \"I think they probably had Harris as the one that would come back in a while ago. \"To me now it sort of feels (there's) a bit more of a groundswell behind Cameron Bancroft getting first crack.\" Australia coach Andrew McDonald has floated the possibility of Marnus Labuschagne moving up from No.3 to open so allrounder Cameron Green can slot back into the Test XI. But Ponting has cautioned against such a move, saying Green should be forced to earn his spot by finding form in the Shield with WA. But the prodigiously talented 24-year-old was dropped during the Ashes, just months after his maiden Test century, for Mitchell Marsh. \"I think Cameron Green might just have to sit back and bide his time and wait for the opportunity to come back,\" Ponting said. \"He can get a truckload of runs in Shield cricket and sort of force his way back into the side. \"Labuschagne has been outstanding at number three for Australia, it's very much a specialist position.\" Ponting also believes enigmatic allrounder Glenn Maxwell should seriously be considered for a Test recall after his stunning white-ball success in India. The Victorian played the last of his seven Tests in 2017, but his three recent international centuries, two in the ODI World Cup and one in a T20, have been irresistible. \"I could see him (Maxwell) getting back into a Test line-up because of the all round game that he brings in those conditions,\" Ponting said. \"The (201) not out in that game against Afghanistan, which is the most remarkable one-day innings I've ever seen. \"I've been around a lot of games, watched a lot of games, played a lot of games, I've never ever seen anything like that.\" Ponting, who captained Australia to World Cup titles in 2003 and 2007, has urged Pat Cummins' team to maintain the rage in the Test summer when they host Pakistan and the struggling West Indies. \"I'd be saying to go as hard as you can and just really try and bury these teams and win as convincingly as you can,\" Ponting said. Advertisement Sign up for our newsletter to stay up to date. We care about the protection of your data. Read our . Advertisement","pubDate":"2023-11-30 00:13:27","image_url":"https://www.blayneychronicle.com.au/images/transform/v1/crop/frm/silverstone-feed-data/73b2938a-0199-4ce5-832c-5a06d8fecb7c.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"blayneychronicle","source_priority":17177086,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"7ca7b894edb107bbecf855c554cc6c9c","title":"Selectors set to be first casualties post World Cup","link":"http://island.lk/selectors-set-to-be-first-casualties-post-world-cup/","keywords":["Sports","Members of the national selection panel","Sri Lanka Cricket"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Rex Clementine Members of the national selection panel are set to be the first casualties post World Cup in which the national cricket team had a disastrous campaign. Despite Sri Lanka finishing ninth in the ten-team event and failing to qualify for the Champions Trophy, none holding key positions within the national cricket […]","content":"Members of the national selection panel are set to be the first casualties post World Cup in which the national cricket team had a disastrous campaign. Despite Sri Lanka finishing ninth in the ten-team event and failing to qualify for the Champions Trophy, none holding key positions within the national cricket team had stepped down. Although previous Sports Minister Roshan Ranasinghe and other bodies attached to the Sports Ministry were keen to change the selection panel headed by former fast bowler Pramodya Wickremasinghe, there was tough resistance from Sri Lanka Cricket (SLC). However, with Harin Fernando taking charge as Sports Minister following the dismissal of Ranasinghe, Fernando had discussed changes moving forward with fresh thinking coming in. Accordingly, SLC will advertise for selectors and in due time will pick a competent team. Under Pramodya, Sri Lanka ended up playing three qualifying round tournaments to go through for ICC events, a trend that had never happened previously. The selectors decision to bench half a dozen seniors from the white ball sides also didn’t go down too well and eventually they had to bite the bullet and fall back on the likes of Angelo Mathews. However, one of the finest all-rounders Sri Lanka had Thisara Perera had quit international cricket by then. Former captain Marvan Atapattu had been approached to take over as new Chief Selector, but The Island learns that he had declined the role and wasn’t keen to be involved in cricket in any capacity at the moment. Former fast bowler Ashantha de Mel is a possible candidate to become the Chief Selector again. De Mel has had several stints with the last being from 2019 to 2021 and the highlight during his tenure was Sri Lanka becoming the first Asian nation to win a Test series in South Africa. It remains to be seen which other former cricketers will apply for the post of selectors. SLC is also likely to not renew the contracts of several individuals within the coaching set up of the national cricket team. However, former captain and Consultant Coach Mahela Jayawardene is likely to get an extension despite an embarrassing World Cup campaign, Sri Lanka’s worst since 1999. Sri Lanka’s next campaign will be the bilateral white ball series against Zimbabwe at home in January. All key slots are expected to be filled by that series.","pubDate":"2023-11-30 00:00:24","image_url":null,"source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3d5bd89e6e3f0edac14004d55ef1f6c7","title":"Colombo South win Under 15 Youth League final in style","link":"http://island.lk/colombo-south-win-under-15-youth-league-final-in-style/","keywords":["Sports","Colombo South win Under 15","Sri Lanka youth League"],"creator":["Sahan Weerasooriya"],"video_url":null,"description":"by Reemus Fernando Royal College batsman Rehan Peiris scored his second century, a run-a-ball 129 for Colombo South Under 15s before their bowlers produced a combined effort to record a comfortable 86 runs victory against Colombo North in the Sri Lanka Cricket conducted Under 15 Youth League final at MCA ground on Wednesday. Chasing a […]","content":"Royal College batsman Rehan Peiris scored his second century, a run-a-ball 129 for Colombo South Under 15s before their bowlers produced a combined effort to record a comfortable 86 runs victory against Colombo North in the Sri Lanka Cricket conducted Under 15 Youth League final at MCA ground on Wednesday. Chasing a target of 257 runs to win, Colombo North played second fiddle and were never in the hunt as they lost wickets at regular intervals. Sadeesha Silva resisted anchoring the innings with 47 runs but he lacked support from the rest. Yenula Dantanarayana and Lahiru Lakmal made 20s. For the winners Holy Cross College, Kalutara spinner Himaru Deshan and Cambrian Rusandu Silva bowled tight spells. Deshan and Silva gave away just 27 and 22 runs respectively during their quota of ten overs. Both took one wicket each. Deshan, who ended up as the highest wicket taker of the tournament had three maidens in his ten overs. Janul Damhiru who shared the new ball with Dunitha Anusara picked up two wickets. Anusara, Yasaru Praveen and Matheesha Aponso picked up one wicket each. Earlier deciding to bat first, Colombo South lost their first wicket for 11 runs. But a second wicket stand of 110 runs between Peiris and Lasiru Sandakan (Royal, Panadura) provided a solid base for them to post a formidable total. After Sandakan was dismissed for 40 runs Peiris joined St. Peter’s wicketkeeper batsman Jason Fernando to post 96 runs for the third wicket. Peiris scored ten sixes and five fours in his innings, while Fernando made 19 runs. Colombo South consisted of players from Royal, Colombo, Royal, Panadura, D.S. Senanayake, Colombo, St. Peter’s, Bambalapitiya, Prince of Wales, Holy Cross, Kalutara, C.W.W. Kannangara and Walapura MV, Horana. They were captained by Thevindu Wewalwala of Royal College Colombo.","pubDate":"2023-11-29 23:59:23","image_url":"http://island.lk/wp-content/uploads/2023/11/scorecard-1.jpg","source_id":"island","source_priority":608450,"country":["sri lanka"],"category":["sports"],"language":"english"},{"article_id":"3324566634cb38177bc50dcd22acb224","title":"El Oasis de los Sueños","link":"https://www.tvazteca.com/aztecadeportes/oasis-suenos-antonio-rosique","keywords":["Columnas Azteca"],"creator":null,"video_url":null,"description":"Ha nacido Baseball United, una liga internacional, iniciativa de los Emiratos Arabes Unidos, que conectará a tres poderosos mercados y cuatro importantes ciudades","content":"Imagínate un diamante del beisbol en medio del desierto. Conectar un jonrón en Dubai ; lanzar una recta de 100 millas en Abu Dhabi ; ejecutar un doble play en la India; un robo de base en Pakistán. El beisbol se ha lanzado a conquistar un nuevo territorio: el corazón de Asia . Ha nacido Baseball United , una liga internacional, iniciativa de los Emiratos Arabes Unidos , que conectará a tres poderosos mercados y cuatro importantes ciudades. Son cuatro equipos que han captado peloteros que brillaron en las Grandes Ligas y que aún tienen mucho beisbol que ofrecer: Robinson Canó, Bartolo Colón, Didi Gregorius, Pablo Sandoval, “Kung Fu Panda”, Andrelton Simmons, Alex Liddi , entre otros hombres con pasado ligamayorista. Te puede interesar: La tempestad sigue ahí ¿Chivas puede competir ante América, Rayados y Tigres? Baseball United apunta a una región que es el epicentro de la pasión por el bat y la pelota; un mercado con más de mil millones de aficionados al cricket, deporte nacional de la India y Pakistán, fanáticos que vibran lanzando y bateando en las calles más populosas del planeta. Bombai , la ciudad más poderosa de la India (21 millones de habitantes) contará con las Mumbai Cobras . Serán dirigidos por dos leyendas de los Rojos de Cincinatti : Barry Larkin (Miembro del Salón de la Fama) en la oficina; y Chris Sabo (Novato del año 1988 y ganador de la Serie Mundial de 1990) como manager. Karachi , (14m. hab.) capital de Pakistán, tendrá a los Karachi “Monarchs” ; liderados los dominicanos Adrián Beltré , quien pronto estará en el Salón de la Fama de las Ligas Mayores , y Miguel Tejada (manager), quien fue MVP 2002 y seis veces All Star en MLB . 6 RUN HOME RUN! The first moneyball home run hit in Baseball United History goes to Pablo Sandoval @KFP48 “Lock it! Cock it! Rocket! Restock it!” pic.twitter.com/QBLqTy025I Abu Dhabi , capital de los Emiratos Árabes Unidos , tendrá a los Abu Dhabi Falcons ; dirigidos de forma honoraria desde la oficina por Nick Swisher , que ganó la Serie Mundial con los Yankees , y en la caseta por Dennis Cook , pitcher ganador del Clásico de Otoño en 1997 con los Florida Marlins. La imponente y sofisticada Dubai , tendrá a los “ Dubai Wolfs ” (Lobos”). Quienes contarán con el “Rey” Félix Hernández (ganador del trofeo Cy Young y seis veces All Star ) como Gerente General Honorario , y con John Mclaren , quien fue manager de los Marineros de Seattle y que tiene más de 40 años de experiencia como coach de Ligas Mayores . Cuatro franquicias profesionales de alto poder adquisitivo han comenzado a captar talento en el sureste asíatico. La India , con 1,400 millones de habitantes, y Pakistan , con 234m. son habitats llenos de jóvenes que nacieron lanzando y bateando pelotas de cricket, el deporte de conjunto número uno en esa región. Se trata de una vieja hipótesis del beisbol de Grandes Ligas , que fue llevada al cine por Disney en la película “El Brazo del Millón de Dólares” (2014). Es una historia basada en hechos reales, la cual relata la aventura agente de jugadores, J.B. Bernstein , quien se queda sin peloteros que representar y se lanza a la India a buscar un joven prodigio que pueda tener una oportunidad en las Grandes Ligas . Al final, Bernstein logró llevar a dos jóvenes se convirtieron en los primeros pitchers de nacionalidad india de la historia en ser firmados por la organización de los Piratas de Pittsburgh . “Hay veces que para ganar, tienes que cambiar el juego”, sostiene la frase promocional de la película. Adicionalmente, con el poderío económico de la región, más de un pelotero profesional volteará a analizar sus posibilidades en la nueva Baseball United . Esto amplia la oferta para los peloteros latinos, incluyendo por supuesto a los mexicanos, aquellos que no logren -por alguna razón- un lugar en Grandes Ligas , de firmar un contrato de alto valor. Es así como el beisbol manifiesta abiertamente su intención de convertirse en un deporte global; algo que ya se viene trabajando con el éxito del Clásico Mundial del Beisbol . Por lo pronto, este viernes y sábado, Baseball United se presenta ante los ojos del mundo con la Serie de las Estrellas , dos juegos de exhibición en el Estadio Internacional de Dubai. El Este contra el Oeste, con los peloteros estelares de los dos equipos. Y en 2024 la “ Baseball United ” cantará el “play ball” de su primera temporada en medio oriente y el sureste asiático. Cobras, Halcones, Lobos y Monarcas ya encendieron la chispa. Lejos de contraerse, este fabuloso juego -que nació hace siglo y medio- en los Estados Unidos, está por sembrar “el pasto más verde que has visto” en tu vida en medio del desierto y con el inigualable Taj Mahal en el horizonte. Te puede interesar: Revelaciones del año: Osmar y Emiliano","pubDate":"2023-11-29 23:38:11","image_url":"https://tvazteca.brightspotcdn.com/7b/94/68521d764480b45942e213140aa0/ha-nacido-baseball-united.jpg","source_id":"tvazteca","source_priority":16758,"country":["mexico"],"category":["sports"],"language":"spanish"},{"article_id":"5db212806aa2e53b9a6926d3557983e7","title":"Namibia qualify for 2024 Men’s T20 World Cup","link":"https://fingaz.co.zw/namibia-qualify-for-2024-mens-t20-world-cup/","keywords":["Sport"],"creator":["Own Correspondent"],"video_url":null,"description":"Namibia have booked their spot at the 2024 Men’s T20 World Cup after guaranteeing a top-two finish in African qualifying with a game to spare. The Eagles secured a 58-run over Tanzania in Windhoek and sit top of the table with five wins from five after previous victories against Zimbabwe, Uganda, Rwanda and Kenya. Next […] The post Namibia qualify for 2024 Men’s T20 World Cup appeared first on The Financial Gazette.","content":"Namibia have booked their spot at the 2024 Men’s T20 World Cup after guaranteeing a top-two finish in African qualifying with a game to spare. The Eagles secured a 58-run over Tanzania in Windhoek and sit top of the table with five wins from five after previous victories against Zimbabwe, Uganda, Rwanda and Kenya. Next year’s 20-team tournament in the United States and the West Indies will be Namibia’s third consecutive appearance at the T20 World Cup. “We’re very proud of the boys, of Pierre de Bruyn and his coaching team and also Gerhard Erasmus, the captain of the team,” Rudie van Vuuren, president of Cricket Namibia, told BBC Sport Africa. “The boys played professional cricket throughout, really a high standard of cricket. “And you can see the fact that we have a professional set-up eventually makes the difference in this kind of tournament.” The side reached the Super 12 stage as first-time qualifiers in the UAE in 2021 but then suffered a first round group-stage exit in Australia last year. Uganda, Kenya and Zimbabwe remain in contention to secure second spot in the table and join Namibia at the T20 World Cup next year, with Uganda facing east African rivals Kenya on Wednesday. Namibia, who will co-host the Cricket World Cup in 2027 alongside South Africa and Zimbabwe, finish their group campaign against Nigeria on Thursday. “It is exciting times for Namibia,” Van Vuuren added. “We have a strong pipeline developing. We look forward to the T20 World Cup and then, building on that, the Under-19 World Cup in 2026 and obviously the 50-over World Cup in 2027.” – bbc.com","pubDate":"2023-11-29 22:38:10","image_url":null,"source_id":"fingaz","source_priority":10986220,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"87fc5d38024e1859ac95a06fedc70087","title":"Lady Chevrons ready for Uganda","link":"https://www.herald.co.zw/lady-chevrons-ready-for-uganda/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Blessing Malinganiza LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons […]","content":"LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons went on to host an unofficial series against South African Emerging side as they rounded up their preparations. Despite losing 2-3, Lady Chevrons skipper, Musonda believes the series gave her charges of some game situations as they put what they had trained into practice. “The series was very competitive and we learnt a lot in a short space of time and mainly the series taught us on how to manage our batting in the power play and also to create some good partnerships if we are to post a competitive score. “The series gave us an appreciation of a game situation and I believe from the series managing our we have improved our game sense,” said Musonda. With the qualifiers for the two global spots coming on next week, Musonda believes that they have done all they could have asked for as they prepared for the qualifiers and now they are ready for the challenge. “I think we have done all we could and now comes the time to deliver in Uganda and we are ready to fight for a spot to qualify for the global qualifiers and everyone is raring to go,” said Musonda. With the lady Chevrons having a mixture of experience and youth, the Lady Chevrons skipper has described the infusion of the young players having brought some energy to the team. “The composition of the squad is good. We’re in a good space on and off the field. “The younger players are bringing in great energy and are performing well as well and the seniors are bringing in their expertise and believe the blending will be play a pivotal role at the qualifiers,” said Musonda. The Lady Chevrons will now head to Uganda next week where they will battle it out with Botswana, Kenya, Namibia, Nigeria, Rwanda, Tanzania and the hosts for two slots at the final. Brandon Moyo IT was not the start that Zimbabwe’s Under-21 women’s hockey team would have hoped for in the 2023 International Hockey Federation Hockey Women’s Junior World Cup after they were humiliated by South Korea in their opening match in Santiago, Chile yesterday. Zimbabwe suffered a heavy 6-0 defeat in their opening Group B encounter […] Lovemore Dube THE Zimbabwe Saints FC leadership has described Andrew Kadengu, who died at Chinhoyi Hospital on Tuesday, as having been a very influential player at the club. He was 72 at the time of his death. Kadengu stroked about two months ago and his health deteriorated leading to his death on Tuesday. Kadengu played […] ABU DHABI. — The Asian Tour has welcomed the launch of the LIV Golf Promotions event as another breakthrough moment for golf in the region, with Cho Minn Thant, its Commissioner & CEO, describing it a “an incredible, life-changing opportunity.” The innovative and inclusive new event, which will provide a pathway onto the world’s most […]","pubDate":"2023-11-29 22:02:50","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"},{"article_id":"467d337e3b3390d8651a25588850a78a","title":"St Paul’s Musami bounce back","link":"https://www.herald.co.zw/st-pauls-musami-bounce-back/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"Don Makanyanga-Sports Reporter AFTER more than 50 years in the oblivion, St Paul’s Musami is set to bounce back on the domestic football arena next season. After winning the championship in 1966, St Paul’s Musami was disbanded four years later. 57-years later a club that held the longest record for a team outside Harare and […]","content":"Blessing Malinganiza LADY Chevrons, skipper, Mary Musonda believes that the Zimbabwe’s Women’s Cricket team is all but ready for the upcoming ICC Women’s T20 World Cup qualifier Africa 2023 to be hosted by Uganda early next month. With the Lady Chevrons having spent 17-days in a training camp in India last month, the Lady Chevrons […] Brandon Moyo IT was not the start that Zimbabwe’s Under-21 women’s hockey team would have hoped for in the 2023 International Hockey Federation Hockey Women’s Junior World Cup after they were humiliated by South Korea in their opening match in Santiago, Chile yesterday. Zimbabwe suffered a heavy 6-0 defeat in their opening Group B encounter […] Lovemore Dube THE Zimbabwe Saints FC leadership has described Andrew Kadengu, who died at Chinhoyi Hospital on Tuesday, as having been a very influential player at the club. He was 72 at the time of his death. Kadengu stroked about two months ago and his health deteriorated leading to his death on Tuesday. Kadengu played […]","pubDate":"2023-11-29 22:02:14","image_url":null,"source_id":"herald_zw","source_priority":445177,"country":["zimbabwe"],"category":["sports"],"language":"english"}]}