{"newsArray":[{"title":"Harmanpreet wins ICC Player of the Month award","link":"https://www.tribuneindia.com/news/sports/harmanpreet-wins-icc-player-of-the-month-award-440145","keywords":null,"creator":null,"video_url":null,"description":"Dubai: India captain Harmanpreet Kaur and Pakistan wicketkeeper batter Mohammad Rizwan won the ICC Player of the Month awards for September in the women's and men's categories, respectively. Bengaluru PKL: U Mumba and Delhi register big wins Raiders Guman Singh and Jai Bhagwan were the stars as U Mumba defeated UP Yoddhas 30-23 in the Pro Kabaddi League Season 9. In the day's second match, Dabang Delhi KC hammered Gujarat Giants 53-33. Delhi's raiders Naveen Kumar and Manjeet scored 15 and 10 points, respectively. Ajman (UAE) India beat South Africa to win DICC T20 Champions Trophy India clinched the Deaf International Cricket Council T20 Champions Trophy by beating South Africa by 39 runs. India, the only undefeated team in the tournament, posted 140/4 and then bowled out South Africa for 101. Agencies","content":null,"pubDate":"2022-10-11 01:40:59","image_url":"https://www.tribuneindia.com/Content/images/rss-tribune-thumb.jpg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Warne fans’ unique tribute to cricket legend","link":"https://www.cairnspost.com.au/news/victoria/shane-warne-fans-pay-tribute-to-late-cricket-legend-with-custom-number-plates/news-story/ab9ddd054bb2127a4e365a4aa48b1d2c","keywords":["Cricket news and galleries","Victoria"],"creator":null,"video_url":null,"description":"Shane Warne fans have rushed to get custom number plates for their cars in the tribute to the late cricket legend.","content":null,"pubDate":"2022-10-11 01:00:00","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"AGP urged to conduct special audit of PCB","link":"https://www.thenews.com.pk/print/998862-agp-urged-to-conduct-special-audit-of-pcb","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: The Auditor General of Pakistan has been requested to conduct a special audit of the Pakistan Cricket Board from the year 2019-22 and at the same time the Board has been asked whether it followed the State Bank of Pakistan rules in Bank accounts operations.The State Bank has recently...","content":null,"pubDate":"2022-10-11 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Aliya shines as Pakistan reach Asia Cup semis","link":"https://www.thenews.com.pk/print/998863-aliya-shines-as-pakistan-reach-asia-cup-semis","keywords":null,"creator":null,"video_url":null,"description":"LAHORE: Aliya Riaz blasted an unbeaten half-century to seal a 71-run win for Pakistan against UAE in the ACC Women’s Asia Cup at the Sylhet International Cricket Stadium on Sunday. This victory also secured Pakistan place in the semi-finals with eight points from four matches.After being...","content":null,"pubDate":"2022-10-11 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Danish, Rizwan, Saif hit tons in third round of CA C'ship","link":"https://www.thenews.com.pk/print/998872-danish-rizwan-saif-hit-tons-in-third-round-of-ca-c-ship","keywords":null,"creator":null,"video_url":null,"description":"KARACHI: Rizwan Hussain and Saif Badar of Central Punjab and Sindh’s Danish Aziz scored centuries on the second day of the third round fixtures of the Cricket Associations Championship here on Monday.Here at the NBP Sports Complex, resuming their first innings at the overnight score of 90-2...","content":null,"pubDate":"2022-10-11 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Australian women’s cricket team all-rounder Ash Gardner says more players will take breaks like Meg Lanning","link":"https://thewest.com.au/sport/cricket/more-will-follow-lannings-lead-gardner-c-8510094","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"All-rounder Ash Gardner predicts more players will join Australia captain Meg Lanning in taking leave to recharge from the demands of elite cricket.","content":null,"pubDate":"2022-10-11 00:13:34","image_url":"https://images.thewest.com.au/publication/C-8510094/8c061cc3499d9dc1c2362715867be49848ac7e23-16x9-x0y0w1280h720.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"More will follow Lanning's lead: Gardner","link":"https://www.perthnow.com.au/sport/cricket/more-will-follow-lannings-lead-gardner-c-8510091","keywords":null,"creator":["Jasper Bruce"],"video_url":null,"description":"Allrounder Ash Gardner predicts more players will join Australia captain Meg Lanning in taking leave to recharge from the demands of elite cricket.","content":"More elite cricketers will follow Australia captain Meg Lanning's lead and take personal leave from the sport, her international teammate Ash Gardner says. After Australia's Commonwealth Games campaign climaxed with the gold medal in August, Lanning began an indefinite absence from cricket in order to recharge and focus on herself. Her break will span the whole of the WBBL season, which begins on Thursday, with the 30-year-old offering no guarantee of a top-level return. Lanning's absence comes after a hectic 12 months for the Australian national team. Since August last year, they have contested a multi-format series against India, the Ashes, the ODI World Cup, a T20I Tri-Series with Pakistan and Ireland, and the Commonwealth Games. Those international demands come on top of the players' domestic cricket commitments. Gardner has played more than 100 matches for Australia under Lanning's captaincy and said the long-term skipper's hiatus would not be the last of its kind. \"Over the next 10 years, there's going to be heaps more people that are going to pull out of tournaments because they just want to have a break, to reset and recharge,\" she told AAP. Sophie Molineux, Amanda-Jade Wellington and Hannah Darlington are among the high-profile players to have taken mental-health leave in recent years and Gardner said the captain's decision to do the same was a powerful one. \"It's a really good message to the wider community to speak up,\" she said. \"It also just sends a message to the public and to the community that we are human. \"Everyone expects us to be perfect all the time but realistically that's not how it is. People tend to forget that it does take a toll.\" Gardner said Lanning was going well when she last checked in and had been enjoying the chance to pursue other interests. \"If you don't have things outside of cricket that take up your time it can be quite tough,\" Gardner said. \"You don't really know who you are in the end. \"Cricket's great but you almost need to find who you are before you stop playing and she was brave enough to do that.\" Newly minted Australia coach Shelley Nitschke has yet to announce a replacement for Lanning, who is still a chance to return to the international set-up over the summer. Gardner said Lanning would leave a hole in the world-beating Australian team if she were to step away from the game for good. \"She's been really successful as an individual and as a captain for the Aussie side,\" Gardner said. \"If she wasn't to come back, she certainly would leave a strong legacy for the next person to try and follow.\" Lifeline 13 11 14 beyondblue 1300 22 4636","pubDate":"2022-10-11 00:13:33","image_url":"https://images.perthnow.com.au/publication/C-8510091/8c061cc3499d9dc1c2362715867be49848ac7e23-16x9-x0y0w1280h720.jpg","source_id":"perthnow","country":["australia"],"category":["sports"],"language":"english"},{"title":"Bastian Schweinsteiger sends message to Manchester United star","link":"https://www.unitedinfocus.com/cr7/bastian-schweinsteiger-sends-message-to-cristiano-ronaldo/","keywords":["CR7","Cristiano Ronaldo"],"creator":["Dan Coombs"],"video_url":null,"description":"Cristiano Ronaldo scored his 700th club career goal at the weekend in Manchester United’s victory over Everton. Ronaldo, 37, struck the winner for United at Goodison, his first Premier League strike of the season. The superstar has been widely applauded after reaching the milestone figure, which comes in addition to the 117 international goals he ... The post Bastian Schweinsteiger sends message to Manchester United star appeared first on United In Focus.","content":"By Dan Coombs Cristiano Ronaldo scored his 700th club career goal at the weekend in Manchester United’s victory over Everton. Ronaldo, 37, struck the winner for United at Goodison, his first Premier League strike of the season. The superstar has been widely applauded after reaching the milestone figure, which comes in addition to the 117 international goals he has scored. United’s players and staff all posed with Ronaldo to pay tribute to his achievement on Monday, paying recognition to the feat. Former Manchester United midfielder Bastian Schweinsteiger reached out to Ronaldo and urged him not to stop, with a message reading, ‘go for more’. Ronaldo is relentless in his desire to score goals, and he certainly won’t be stopping soon, not with rival Lionel Messi close to him with 691 club goals of his own. Congratulations on your 700th club goal! 👏🏼 Go for more! 👊🏼 @Cristiano https://t.co/lGTVBJmogy There were more tributes to Ronaldo on his own Instagram page, in which he wrote, “What a beautiful number we’ve achieved together! Thank you to all my teammates, coaches, clubs, family & friends and of course my fans. United we continue!” Former Olympic sprinter Yohan Blake applauded him on social media, along with his former Real Madrid teammate Marcelo, while there was also a message from his former club Sporting, where Ronaldo began his 700 goal haul. Indian cricket legend Virat Kohli also hailed Ronaldo as the greatest of all time, in a message sent after United’s 2-1 victory at Everton, as did Yuvraj Singh. Goat to Goat conversation 🐐🐐 pic.twitter.com/Mw3dOcXkaL King 👑 is back ! Form is temporary class is forever !!! @Cristiano welcome to 700 club ! No7 #GOAT𓃵 #legend siiiiiiiiiiii !!!!! @ManUtd Ronaldo’s 700 goals is a monumental achievement, and he won’t be happy to leave it there. Reaching 800 could take him years, and depends how long he is able and willing to extend his club career. But as he has consistently shown, you should never rule anything out when it comes to Ronaldo.","pubDate":"2022-10-10 23:05:00","image_url":null,"source_id":"unitedinfocus","country":["nigeria"],"category":["sports"],"language":"english"},{"title":"Australian captain Aaron Finch reprimanded for on-field ‘audible obscenity’","link":"https://www.foxsports.com.au/cricket/australia/australian-captain-aaron-finch-reprimanded-for-onfield-audible-obscenity/news-story/915c8fa007fd3d85026a6067fef8f7ef","keywords":null,"creator":null,"video_url":null,"description":"Australian captain Aaron Finch has been reprimanded by the International Cricket Council for using an “audible obscenity” during the first T20 against England in Perth.","content":"Australian captain Aaron Finch has been reprimanded by the International Cricket Council for using an “audible obscenity” during the first T20 against England in Perth. During Sunday evening’s series opener, the 35-year-old lost his temper in the ninth over of England’s innings at Perth Stadium, swearing at on-field umpires Sam Nogajski and Donovan Koch following an appeal for caught behind. Watch Australia v England. Every T20 Live & Exclusive to Fox Sports on Kayo. New to Kayo? Start your free trial now > After deliberating with his teammates on whether to call for a review, Finch asked the umpires whether the catch had carried to wicketkeeper Matthew Wade. The captain wasn’t given an answer by the on-field umpires, leaving him fuming as time ran out on the DRS timer. “Could have been nice to know inside 15 f***ing seconds,” he vented in comments that were picked up by the stump microphones. Australian captain Aaron Finch has been reprimanded by the International Cricket Council for using an “audible obscenity” during the first T20 against England in Perth. Source: FOX SPORTS Finch has now been officially reprimanded for breaching Article 2.3 of the ICC Code of Conduct, which relates to the “use of an audible obscenity during an international match”. The Victorian avoided a fine because it was his first offence in a 24-month period, but one demerit point has been added to his disciplinary record for the Level 1 offence. Finch accepted the sanction, so no formal hearing was required. England ultimately won the first T20 by eight runs to take a 1-0 lead in the three-match bilateral series. Australia has experimented with its batting line-up ahead of the T20 World Cup on home soil, with Finch sliding into the middle order despite being one of Australia’s most successful opening batters in white-ball cricket. But the powerful right-hander confirmed he will return to the top of the order for Australia’s upcoming T20s against England. “We’re going to keep trying things. I’m going to go back to the top for the next game, which was always the plan,” he told Fox Cricket after Sunday’s defeat. “We’d get to the first two (T20s against West Indies) and then this game, then I’d go back to the top as preparation for the World Cup. “It was just about giving (Cameron Green) an opportunity at the top and to keep trying things. After this little burst, especially (with) guys coming off a lot of injuries as well … you have to be prepared. “So just trying to get as many games into Greeny in case he has to be called into the squad.” The second T20 between Australia and England gets underway at Canberra’s Manuka Oval on Wednesday evening, with the first ball scheduled for 7.10pm AEDT.","pubDate":"2022-10-10 22:55:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie captain’s R-rated remark caught out","link":"https://www.themercury.com.au/sport/cricket/australian-captain-aaron-finch-reprimanded-for-onfield-audible-obscenity/news-story/7fbcdf70a568fa35bbf955b4be1b288c","keywords":["Cricket news and galleries","Kayo","Sport news and galleries"],"creator":null,"video_url":null,"description":"Australian captain Aaron Finch has been reprimanded by the International Cricket Council for using an “audible obscenity” during the first T20 against England in Perth.","content":"During Sunday evening’s series opener, the 35-year-old lost his temper in the ninth over of England’s innings at Perth Stadium, swearing at on-field umpires Sam Nogajski and Donovan Koch following an appeal for caught behind.Watch Australia v England. Every T20 Live & Exclusive to Fox Sports on Kayo. New to Kayo? Start your free trial now >After deliberating with his teammates on whether to call for a review, Finch asked the umpires whether the catch had carried to wicketkeeper Matthew Wade.The captain wasn’t given an answer by the on-field umpires, leaving him fuming as time ran out on the DRS timer.“Could have been nice to know inside 15 f***ing seconds,” he vented in comments that were picked up by the stump microphones.Finch has now been officially reprimanded for breaching Article 2.3 of the ICC Code of Conduct, which relates to the “use of an audible obscenity during an international match”.The Victorian avoided a fine because it was his first offence in a 24-month period, but one demerit point has been added to his disciplinary record for the Level 1 offence.Finch accepted the sanction, so no formal hearing was required.England ultimately won the first T20 by eight runs to take a 1-0 lead in the three-match bilateral series.Australia has experimented with its batting line-up ahead of the T20 World Cup on home soil, with Finch sliding into the middle order despite being one of Australia’s most successful opening batters in white-ball cricket.But the powerful right-hander confirmed he will return to the top of the order for Australia’s upcoming T20s against England.“We’re going to keep trying things. I’m going to go back to the top for the next game, which was always the plan,” he told Fox Cricket after Sunday’s defeat.“We’d get to the first two (T20s against West Indies) and then this game, then I’d go back to the top as preparation for the World Cup.“It was just about giving (Cameron Green) an opportunity at the top and to keep trying things. After this little burst, especially (with) guys coming off a lot of injuries as well … you have to be prepared.“So just trying to get as many games into Greeny in case he has to be called into the squad.”The second T20 between Australia and England gets underway at Canberra’s Manuka Oval on Wednesday evening, with the first ball scheduled for 7.10pm AEDT.","pubDate":"2022-10-10 22:07:00","image_url":null,"source_id":"mercury","country":["australia"],"category":["sports"],"language":"english"},{"title":"India arrive in Australia early ahead of T20","link":"https://www.cairnspost.com.au/sport/cricket/india-arrive-in-australia-early-ahead-of-t20/video/8fe7236007882d0285e4398fa67ee231","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: India are looking to avenge last year's world cup misstep with an early preparation.","content":"Cricket: India are looking to avenge last year's world cup misstep with an early preparation.","pubDate":"2022-10-10 20:45:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Voges backs Green at top of the order","link":"https://www.cairnspost.com.au/sport/cricket/voges-backs-green-at-top-of-the-order/video/6a8efac244d09f9de1d4b0645edd81fb","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Cameron Green has impressed his state coach with a move to the top of the order, despite missing the Australian team.","content":"Cricket: Cameron Green has impressed his state coach with a move to the top of the order, despite missing the Australian team.","pubDate":"2022-10-10 20:36:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Cricket: Black Caps to play two tests, eight ODIs and five T20s in Pakistan","link":"https://www.newstalkzb.co.nz/news/sport/cricket-black-caps-to-play-two-tests-eight-odis-and-five-t20s-in-pakistan/","keywords":null,"creator":null,"video_url":null,"description":"The Black Caps will tour Pakistan twice in five months to play two test matches, eight one-day internationals and five Twenty20s, the Pakistan Cricket Board said today. The two test matches, which will be part of the World Test Championship, will be played at Karachi from Dec. 27-31 and Multan from Jan. 4-8. Karachi will also host the three ODIs from Jan. 11-15 as part of ICC World Cup Super League. New Zealand will return to Pakistan in April and will play four Twenty20s at Karachi from April 13-19. Lahore will host the fifth T20 and two ODIs from April 23-28 and the remaining three ODIs will be played at Rawalpindi from May. 1-7. New Zealand aborted their tour to Pakistan last year just hours before the first ODI in Rawalpindi because of an undisclosed security concern. Ramiz Raja, the PCB chairman, said at the time it was \"frustrating\" to see the Black Caps walking out of the tour by taking a unilateral approach and not sharing the security threat with Pakistan. England subsequently abandoned a short scheduled tour to Pakistan due to security concerns. However, England last month arrived for its first tour of Pakistan for the first time in 17 years, winning the seven-match Twenty20 series 4-3. England will also tour Pakistan in December for three test matches. \"New Zealand and Pakistan share a terrific history in international cricket and there is genuine respect between the two teams as well as the two boards,\" David White, New Zealand Cricket chief executive said in a statement. \"The recent tours from Australia and England have left us in no doubt regarding the quality of the Pakistan side across all formats, and the extent of the challenge that awaits us.\" Zakir Khan, PCB director international cricket, said that the ODIs against New Zealand will help Pakistan prepare for next year's Asia Cup and the World Cup, which is being held in India.","content":null,"pubDate":"2022-10-10 19:33:04","image_url":"https://www.newstalkzb.co.nz/media/no3lwjdu/devon-conway-of-the-black-caps-with-muhammad-rizwan-of-pakistan-photosport.jpg","source_id":"newstalkzb","country":["new zealand"],"category":["sports"],"language":"english"},{"title":"Syed Mushtaq Ali Trophy 2022: Full squads, schedule, format and everything else you need to know","link":"https://www.firstpost.com/firstcricket/sports-news/syed-mushtaq-ali-trophy-2022-full-squads-schedule-format-and-everything-else-you-need-to-know-11422501.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Syed Mushtaq Ali Trophy 2022: Full squads, schedule, format and everything else you need to know","content":"India’s home season got underway with the limited-overs’ series against Australia and South Africa and and in less than 24 hours, the limited-overs leg of the domestic season will also kick off with the Syed Mushtaq Ali Trophy, BCCI’s premier domestic T20 competition.This year’s Syed Mushtaq Ali Trophy, the 15th edition overall, takes place a week after the conclusion of the first half of the 2022-23 Irani Cup, where Rest of India prevailed over 2019-20 Ranji Trophy winners Saurashtra. The Duleep Trophy had taken place before the Irani Cup fixture, with West Zone emerging winners.The tournament is a crucial one as far as scouting for the Indian Premier League (IPL) — the premier T20 league in the world — is concerned as it provides uncapped state-level cricketers the chance to display their wares and catch the attention of the franchises ahead of the IPL player auction that takes place in the winter months.Ahead of the opening round of fixtures on Tuesday, we take a look at the squads, live telecast information, schedule and other details:Format:The tournament will feature 38 teams which will be divided into five Elite Groups — while Elite Groups A, B and C comprise eight teams each, D and E have a total of seven teams.The winners of all the groups automatically qualify for the quarter-finals while the five second-placed teams and an overall 11th-ranked side compete for the remaining three slots.Some incredible #Risers represent at the #SMAT2022 #OrangeArmy, wish our boys the best of luck as they’re back to action from tomorrow!Washi & Tripathi will join their respective teams after completing #TeamIndia duty. pic.twitter.com/nCJ0f9RW2z— SunRisers Hyderabad (@SunRisers) October 10, 2022A major talking point in this year’s Syed Mushtaq Ali Trophy is the ‘Impact Player Rule’ — where a substitute player will be allowed to replace a member of the starting XI anytime before the 14th over of a completed T20 match in either innings, and will be allowed to bat as well as bowl his full quota of overs.The BCCI will be experimenting with this new rule before considering the option of introducing it in the IPL.Live streaming:Select matches in the Syed Mushtaq Ali Trophy will be telecast live on Star Sports Network and streamed live on the Disney+ Hotstar app. You can also browse Firstpost.com for live updates.Groups:Elite A: Assam, Madhya Pradesh, Mizoram, Mumbai, Railways, Rajasthan, Uttarakhand, Vidarbha.Elite B: Delhi, Goa, Hyderabad, Manipur, Puducherry, Punjab, Tripura, Uttar Pradesh.Elite C: Arunachal Pradesh, Haryana, Jammu and Kashmir, Karnataka, Kerala, Maharashtra, Meghalaya, Services.Elite D: Andhra Pradesh, Baroda, Bihar, Gujarat, Himachal Pradesh, Nagaland, Saurashtra.Elite E: Bengal, Chandigarh, Chattisgarh, Jharkhand, Odisha, Sikkim, Tamil Nadu.! Which team is going to lift the Syed Mushtaq Ali trophy this year? ⏬The tournament starts tomorrow & you can catch the games live on Star Sports Select 2/ 2 HD & Hotstar.#SyedMushtaqAliTrophy #SMAT2022 #DomesticCricket #BharatArmy pic.twitter.com/xk297cgMaz— The Bharat Army (@thebharatarmy) October 10, 2022Schedule:11 October: Arunachal Pradesh vs Kerala; Railways vs Uttarakhand; Mizoram vs Mumbail Bengal vs Jharkhand; Baroda vs Nagaland; Goa vs Tripura; Gujarat vs Himachal Pradesh; Delhi vs Manipur; J&K vs Meghalaya; Odisha vs Sikkim; Hyderabad vs Punjab; Haryana vs Services; Karnataka vs Maharashtra; Assam vs Vidarbha: Chattisgarh vs Tamil Nadu: Madhya Pradesh vs Rajasthan: Andhra vs Saurashtra: Puducherry vs Uttar Pradesh.12 October: Baroda vs Saurashtra; Andhra vs Himachal Pradesh; Odisha vs Tamil Nadu; Chhattisgarh vs Jharkhand; Haryana vs Meghalaya: Maharashtra vs Services; Tripura vs Uttar Pradesh; Hyderabad vs Puducherry; Assam vs Uttarakhand; Rajasthan vs Vidarbha; Chandigarh vs Sikkim; Bihar vs Nagaland; Arunachal Pradesh vs Jammu and Kashmir; Karnataka vs Kerala; Goa vs Manipur; Delhi vs Punjab; Mizoram vs Railways; Madhya Pradesh vs Mumbai.14 October: Tamil Nadu vs Sikkim; Chandigarh vs Jharkhand; Nagaland vs Saurashtra; Bihar vs Himachal Pradesh; Karnataka vs Meghalaya; Haryana vs Kerala; Punjab vs Tripura; Delhi vs Uttar Pradesh; Assam vs Mumbai; Madhya Pradesh vs Uttarakhand; Bengal vs Odisha; Baroda vs Gujarat; Arunachal Pradesh vs Services; Jammu and Kashmir vs Maharashtra; Manipur vs Puducherry; Goa vs Hyderabad; Mizoram vs Vidarbha; Railways vs Rajasthan.16 October: Chandigarh vs Odisha; Bengal vs Tamil Nadu; Baroda vs Bihar; Gujarat vs Saurashtra; Kerala vs Services; Maharashtra vs Meghalaya; Delhi vs Puducherry; Hyderabad vs Tripura; Mumbai vs Vidarbha; Rajasthan vs Uttarakhand; Chhattisgarh vs Sikkim; Andhra vs Nagaland; Jammu and Kashmir vs Karnataka; Arunachal Pradesh vs Haryana; Goa vs Punjab; Manipur vs Uttar Pradesh; Assam vs Mizoram; Madhya Pradesh vs Railways.18 October: Bengal vs Sikkim; Chandigarh vs Chhattisgarh; Gujarat vs Nagaland; Andhra vs Bihar; Haryana vs Jammu and Kashmir; Arunachal Pradesh vs Karnataka; Goa vs Uttar Pradesh; Manipur vs Punjab; Assam vs Railways; Madhya Pradesh vs Mizoram; Jharkhand vs Tamil Nadu; Jharkhand vs Tamil Nadu; Kerala vs Maharashtra; Meghalaya vs Services; Delhi vs Hyderabad; Puducherry vs Tripura; Uttarakhand vs Vidarbha; Mumbai vs Rajasthan.20 October: Chandigarh vs Tamil Nadu; Bengal vs Chhattisgarh; Bihar vs Saurashtra; Andhra vs Gujarat; Karnataka vs Services; Jammu and Kashmir vs Kerala; Puducherry vs Punjab; Delhi vs Goa; Mumbai vs Railways; Madhya Pradesh vs Vidarbha; Jharkhand vs Odisha; Baroda vs Himachal Pradesh; Haryana vs Maharashtra; Arunachal Pradesh vs Meghalaya; Hyderabad vs Uttar Pradesh; Manipur vs Tripura; Mizoram vs Uttarakhand; Assam vs Rajasthan.22 October: Chhattisgarh vs Odisha; Jharkhand vs Sikkim; Andhra vs Baroda; Himachal Pradesh vs Nagaland; Arunachal Pradesh vs Maharashtra; Haryana vs Karnataka; Hyderabad vs Manipur; Punjab vs Uttar Pradesh; Assam vs Madhya Pradesh; Mizoram vs Rajasthan; Bengal vs Chandigarh; Bihar vs Gujarat; Kerala vs Meghalaya; Jammu and Kashmir vs Services; Delhi vs Tripura; Goa vs Puducherry; Railways vs Vidarbha; Mumbai vs Uttarakhand.30 October: Pre Quarterfinal 1; Pre Quarterfinal 2; Pre Quarterfinal 3.1 November: Quarterfinal 1; Quarterfinal 2; Quarterfinal 3; Quarterfinal 4.3 November: Semi Final 1; Semi Final 2.5 November: Final.#SuperFam, wish our giants a #SMAT2022, in the comments below! #LucknowSuperGiants | #LSG | #BhaukaalMachaDenge | #AbApniBaariHai pic.twitter.com/22weg6UiRu— Lucknow Super Giants (@LucknowIPL) October 10, 2022Squads:Kerala: Sanju Samson, Rohan S. Kunnummal, Vishnu Vinod, Shoun Roger, Sachin Baby, Abdul Basith, Krishna Prasad, Mohammed Azharudeen, Sijomon Joseph, S. Midhun, Vyshak Chandran, Manu Krishnan, Basil Thampi, N.P. Basil, F. Fanoos, K.M. Asif, Sachin Suresh.Jharkhand: Virat Singh, Shahbaz Nadeem, Nazim Siddique, Kumar Deobrat, Kumar Suraj, Pankaj Kumar, Manishi, Bala Krishna, Kumar Kushagra, Anukul Roy, Vivekanand Tiwary, Aayush Bhardwaj, Rajandeep Singh, Vikash Singh, Rahul Shukla, Supriyo Chakraborty.Hyderabad: Tanmay Agarwal, N Tilak Varma (c), T Ravi Teja, Rahul Buddi, Prateek Reddy, CV Milind, Mickhil Jaiswal, Tanay Tyagarajan, Sai Pragnay Reddy, Rakshan Reddi, Mohammed Siraj, MSR Charan, Bhagat Varma, Alankrit Agarwal, Jayram Reddy, B Punnaiah, Trishank Gupta, E Sanketh, Shreyas Valla, P Nitesh Reddy.Apne Varmaji bann gaye Hyderabad ke Vice-CaptainCongratulations, @TilakV9 #OneFamily #DilKholKe #MumbaiIndians #SMAT2022 pic.twitter.com/DQufOoIGEG— Mumbai Indians (@mipaltan) October 8, 2022Delhi: Nitish Rana, Himmat Singh, Hiten Dalal, Yash Dhull, Anuj Rawat (wk), Hrithik Shokeen, Ayush Badoni, Lalit Yadav, Ishant Sharma, Navdeep Saini, Simarjeet Singh, Mayank Yadav, Shivank Vashisht, Dev Lakra, Pradeep Sangwan, Pranshu Vijayaran.Jammu and Kashmir: Shubham Pundir, Abdul Samad, Qamran Iqbal, Shubham Khajuria, Henan Malik, Jatin Wadhwan, Fazil Rashid, Shivansh Sharma, Parvez Rasool, Nasir Lone, Auqib Nabi, Abid Mushtaq, Yudhvir Singh, Mujtaba Yousuf, Sunil Kumar.Karnataka: Mayank Agarwal, Devdutt Padikkal, Manish Pandey, Abhinav Manohar, Chethan LR, Manoj Bhandage, K Gowtham, Shreyas Gopal, Jagadeesa Suchith, Luvnith Sisodia, Sharath BR, Koushik V, Vyshak V, Kaverappa, Venkatesh M.Mumbai: Ajinkya Rahane, Yashasvi Jaiswal, Prithvi Shaw, Sarfaraz Khan, Shardul Thakur, Shams Mulani, Tanush Kotian, Hardik Tamore, Prashant Solanki, Dhaval Kulkarni, Tushar Deshpande, Shivam Dube, Aman Khan, Sairaj Patil, Mohit Awasthi.Tamil Nadu: B Aparajith, M S Washington Sundar, B Sai Sudharsan, T Natarajan, M Shahrukh Khan, R Sai Kishore, R Sanjay Yadav, Sandeep Warrier, M Siddharth, Varun Chakravarthy, J Suresh Kumar, C Hari Nishaanth, R Silambarasan, M Ashwin, G Ajitesh, M Mohammad, Abhishek Tanwar.Bengal: Abhimanyu Easwaran, Writtick Chatterjee, Abhishek Das, Ritwik Roy Choudhary, Sudip Gharami, Ranjot Singh Khaira, Agniva Pan, Abishek Porel, Shahbaz Ahmed, Pradipta Pramanik, Karan Lal, Sujit Kumar Yadav, Mukesh Kumar, Akash Deep, Ishan Porel, Sayan Shekhar Mondal, Ravi Kumar, Akash Gathak, Geet Puri.Maharashtra: Ruturaj Gaikwad, Rahul Tripathi, Naushad Shaikh, Satyajeet Bacchav, Yash Nahar, Pawan Shah, Siddhesh Veer, Y Kshirsagar, Azim Kazi, Shamshuzma Kazi, Kaushal Tambe, Vicky Ostwal, Manoj Ingale, Ashay Palkar, Divyang Hingnekar, Rajwardhan Hangargekar, Ramkrishna Ghosh.Odisha: Abhishek Raut, Aasirwad Swain, Shantanu Mishra, Anshuman Rath, Sujit Lenka, Rakesh Pattnaik, Mushtaq Beg, Suryakant Pradhan, Debabrata Pradhan, Om T Munde, Subhranshu Senapati, Sameer Mohanty, Sushil Barik, Jayanta Behera, Tarini Sa, Rajesh Mohanty.Uttar Pradesh: Karan Sharma, Rinku Singh, Priyam Garg, Shivam Mavi, Kartik Tyagi, Shivam Sharma, Sameer Choudhary, Aryan Juyal, Sameer Rizvi, Hardeep Singh, Divyansh, Prince Yadav, Yash Dayal, Akshdeep Nath, Shiva Singh.Punjab: Abhishek Sharma, Prabhsimran Singh, Anmolpreet Singh, Gurkeerat Singh Mann, Mandeep Singh, Nehal Wadhera, Ramandeep Singh, Harpreet Singh Brar, Mayank Markande, Siddharth Kaul, Baltej Singh, Ashwani, Anmol Malhotra, Sanvir Singh, Pukhraj Mann.Chandigarh: Manan Vohra, Harnoor Singh Pannu, Shivam Bhandari, Ankit Kaushik, Gaurav Puri, Amrit Lal Lubana, Arjit Singh, Gurinder Singh, Yuvraj Chaudhary, Bhagmender Lader, Sandeep Sharma, Jagjit Singh Sandhu, Rohit Danda, Raj Angad Bawa, Akshit Rana.Goa: S Kauthankar, D Goankar, V Govekar, S Prabhudesai, T Sawkar, A Pandrekar, D Misal, Amit Yadav, S Dubashi, F Alemo, L Garg, R Naik, Arjun Tendulkar, Eknath Kerkar, Siddhesh Lad, I Gadekar, A Kaushik, V Kahlon, V Naik, M Redkar.Rajasthan: Ashok Menaria, Yash Kothari, Anirudh Singh Chauhan, Mahipal Lomror, Salman Khan, Arjit Gupta, Rahul Chahar, Nikhil Sachdev, Kunal Singh Rathore, Shubham Sharma, Manav Suthar, Mohit Jain, Aniket Choudhary, Tanveer Ul-Haq, Kamlesh Nagarkoti.Assam: Denish Das, Rahul Hazarika, Rishav Das, Riyan Parag, Subham Mandal, Rajjakuddin Ahmed, Wasiqur Rahman, Dharani Rabha, Mrinmoy Dutta (c), Mukhtar Hussain, Nipan Deka, Roshan AlamMadhya Pradesh: Aditya Shrivastava, Akshat Raghuwanshi, Himanshu Mantri, Kuldeep Gehi, Parth Sahani (c), Rajat Patidar, Shubham Sharma, Venkatesh Iyer, Siddharth Patidar (wk), Aman Bhadoriya, Ankit Kushwah, Ashwin Das, Gaurav Yadav, Kumar Kartikeya, Puneet DateyMizoram: Jehu Anderson, Avinash Yadav, Shreevats Goswami (wk), Taruwar Kohli, G Lalbiakvela, Lalhmangaiha, Lalhriatrenga, F Lalmuanzuala, LM Ralte, Remruatdika Ralte, Rinsangzela Hmamte, Sumit Lama, Vanlalhruailuanga, Vikash Kumar, Bobby ZothansangaRailways: Mohammad Saif, Mohit Raut, Pratham Singh, Shivam Chaudhary, Dhrushant Soni, Vivek Singh, Yuvraj Singh, Suraj Ahuja (wk), Upendra Yadav (wk), Akshat Pandey, Harsh Tyagi, Karn Sharma (c), Navneet Virk, T PradeepUttarakhand: Avneesh Sudha, Jiwanjot Singh, Kunal Chandela, Piyush Joshi, Sanyam Arora, Vijay Sharma, Dikshanshu Negi, Swapnil Singh, Aditya Tare (wk), Agrim Tiwari, Akash MadhwalVidarbha: Apoorv Wankhade, Atharva Taide, Sanjay Raghunath, Shubham Dubey, Aditya Sarwate, Aman Mokhade, Harsh Dubey, Lalit Yadav, Yash Kadam, Akshay Wadkar (c) & (Wk), Jitesh Sharma (wk), Rushabh Rathod (wk), Siddhesh Wath (wk), Akshay Karnewar, Akshay Wakhare, Darshan Nalkande, Digvijay Deshmukh, Shubham Kapse, Sooraj Rai, Umesh Yadav, Yash ThakurManipur: Chingakham Bidash, Johnson Singh, Kangabam Singh, Karnajit Yumnam, L Kishan Singha, Nitesh Sedai, Prafullomani Singh, Kishan Thokchom, Langlonyamba Meitan Keishangbam, Rex Rajkumar, Ahmed Shah (wk), Ahsanul Kabir, Ajay Lamabam, Bishworjit Konthoujam, Sultan KarimPuducherry: Akash Kargave, Marimuthu Vikneshwaran, Mohit Mittan, Parameeswaran Sivaraman, Paras Dogra, Premraj Rajavelu, Damodaran Rohit (c), Krishna Pandey, Satish Jangir, Thivagar Gopal, Arun Karthik (wk), Ramachandran Ragupathy (wk), Abin Mathew, Ankit Sharma, Bharat Sharma, Rohan Suresh, Sagar Udeshi, Tharayil AbeeshTripura: Bikramjit Debnath, Bikramkumar Das, Bishal Ghosh, Deepak Khatri, Rajat Dey, Saruk Hossain, Sridam Paul, Sudip Chatterjee, Manisankar Murasingh, Parvez Sultan, Rana Dutta, Arkaprabha Sinha (wk), Nirupam Sen, Wriddhiman Saha, Abhijit Sarkar, Ajoy Sarkar, Chiranjit Paul, Sankar Paul, Subham GhoshArunachal Pradesh: Chetan Anand, Nebam Hachang, Neelam Obi, Suraj Tayam, Techi Doria, Akhilesh Sahani, Myendung Singpho, Rohan Sharma, Techi Neri, Kamsha Yangfo (wk), Techi Sonam (wk), Meet Desai, Nabam Tempol, Tanmay Gupta, Tollum Makcha, Yab NiyaHaryana: Ankit Kumar, Himanshu Rana, Nitesh Hooda, Shivam Chauhan, Vipin Kumar, Yuvraj Singh, Ajit Chahal, Anshul Kamboj, Chaitanya Bishnoi, Jaideep Bhambhu, Piyush Dahiya, Pramod Chandila, Rahul Tewatia, Sanjay Pahal, Sumit Kumar, Kapil Hooda (wk), Aman Kumar, Amit Mishra, Dinesh Bana, Harshit Saini, Jayant Yadav, Mohit SharmaMeghalaya: Anish Charak, Kilco Marak, Kishan Lyngdoh, Larry Sangma, Rohit Shah, Yogesh Tiwari, Chirag Khurana, Raj Biswa, Rajesh B Bishnoi, Swarajeet Das, Punit Bisht (c) & (wk), Akash Choudhary, Chengkam Sangma, Dippu SangmaServices: Amit Pachhara, Anshul Gupta, Rahul Singh Gahlaut, Rajat Paliwal, Ravi Chauhan, Shubham Rohilla, Vikas Hathwala, Arjun Sharma, Irfan Khan, Mohit Kumar, Pulkit Narang, Devender Lohchab (wk), Arpit Guleria, Diwesh Pathania, Gaurav Sharma, Lakhan Singh, Nitin Yadav, Vikas YadavAndhra Pradesh: Abhishek Reddy, Hanuma Vihari, Karan Shinde, Ricky Bhui, Shaik Rasheed, Ashwin Hebbar, Girinath Reddy, KV Sasikanth, Lalith Mohan, Manish Golamaru, Pinninti Tapaswi, Pyla Avinash, Shoaib Md Khan, Srikar Bharat (c) & (Wk), Bandaru Ayyappa, Harishankar ReddyBaroda: Abhimanyusingh Rajput, Ambati Rayudu (c), Bhanu Pania, Mahesh Pithiya, Vishnu Solanki, Atit Sheth, Jyotsnil Singh, Krunal Pandya, Ninad Rathva, Mitesh Patel (Wk), Chinta Gandhi, Dhruv Patel, Kartik Kakade, Lukman Meriwala, Safvan Patel, Varun AaronBihar: Harsh Singh, Mangal Mahrour, Rishav Raj, Sakibul Gani, Ashutosh Aman (c), Malay Raj, Sachin Kumar, Bipin Saurabh (Wk), Abhijeet Saket, Anuj Raj, Apurva Anand, Piyush Singh, Satyendra SinghGujarat: Chirag Gandhi, Priyank Panchal (c), Saurav Chauhan, Urvil Patel, Piyush Chawla, Ripal Patel, Vishal Jaiswal, Het Patel (Wk), Priyesh Patel (Wk), Arzan Nagwaswalla, Chintan Gaja, Hardik Patel, Hemang Patel, Roosh Kalaria, Tejas PatelHimachal Pradesh: Abhimanyu Rana, Amit Kumar, Ekant Sen, Nikhil Gangta, Nitin Sharma, Prashant Chopra, Raghav Dhawan, Akash Vasisht, Digvijay Rangi, Rishi Dhawan, Sumeet Verma, Ankush Bains (Wk), Shubham Arora (Wk), Ankush Bedi, Ayush Jamwal, Gurvinder Singh, Kanwar Abhinay, Mayank Dagar, Pankaj Jaswal, Sidharth Sharma, Vaibhav Arora, Vinay GaletiyaNagaland: Hokaito Zhimomi (c), Rongsen Jonathan, Sedezhalie Rupero, Temjentoshi Jamir, Imliwati Lemtur, Joshua Ozukum, Nagaho Chishi, Shrikant Mundhe, Chetan Bist (Wk), Akash Singh, Chopise Hopongkyu, Merenka Jamir, Mughavi Wotsa, Nzanthung Mozhui, Tahmeed RahmanSaurashtra: Cheteshwar Pujara, Jay Gohil, Parth Chauhan, Samarth Vyas, Chirag Jani, Navneet Vora, Parth Bhut, Prerak Mankad, Harvik Desai (Wk), Sheldon Jackson (Wk), Tarang Gohel (Wk), Devang Karamta, Dharmendrasinh Jadeja, Jaydev Unadkat (c), Kushang Patel, Yuvraj ChudasamaChattisgarh: Amandeep Khare, Gagandeep Singh, Harpreet Singh (c), Prateek Yadav, Rishabh Tiwari, Shashank Singh, Ajay Mandal, Shaban Khan, Shubham Agarwal, Sumit Ruikar, Lavin Coster (Wk), Shashank Chandrakar (Wk), Aishwarya Mourya, Pankaj Kumar Rao, Ravi Kiran, Sourabh MajumdarSikkim: Ashish Thapa, Nilesh Lamichaney, Pankaj Kumar Rawat, Sumit Singh, Ankur Malik, Lee Yong Lepcha, Palzor Tamang, Akash Luitel, Anil Subba, Anwesh Sharma, Mandup Bhutia, Md Saptulla, Nasun TamangRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-10 19:10:43","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Syed-Mushtaq-Ali-Trophy-Tamil-Nadu.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"DSWO Ramban inaugurates cricket series in Banihal","link":"https://www.thenorthlines.com/dswo-ramban-inaugurates-cricket-series-in-banihal/","keywords":["Jammu","Jammu Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"Ramban, Oc t 10: District Social Welfare Officer, Ramban, Rahul Gupta inaugurated a cricket series event in Banihal as part of the Nasha Mukt J&K Abhiyan. Addressing the youth about the negative ramifications of drugs and its impact on society, the DSWO requested the participant players to promote sports and involve more youth of the […] The post DSWO Ramban inaugurates cricket series in Banihal appeared first on Northlines.","content":"Ramban, Oc t 10: District Social Welfare Officer, Ramban, Rahul Gupta inaugurated a cricket series event in Banihal as part of the Nasha Mukt J&K Abhiyan. Addressing the youth about the negative ramifications of drugs and its impact on society, the DSWO requested the participant players to promote sports and involve more youth of the society and vicinity which will play a key role in supplementing the efforts of district administration towards eradication of drug abuse. The participating youth were also requested to stay vigilant about their own society, check and observe the behavioral changes among the other youth and if found susceptible, immediately inform the District Administration and the social welfare department so that the victims can be easily identified and further process of their rehabilitation may be started at the earliest. The event ended with the pledge against drug abuse.The post DSWO Ramban inaugurates cricket series in Banihal appeared first on Northlines.","pubDate":"2022-10-10 19:05:45","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Sarmad Hafeez witnesses finals of 5th Champions Trophy 2022 at TRC ground Srinagar","link":"https://www.thenorthlines.com/sarmad-hafeez-witnesses-finals-of-5th-champions-trophy-2022-at-trc-ground-srinagar/","keywords":["Jammu Kashmir","Kashmir","Sports"],"creator":["Northlines"],"video_url":null,"description":"NL Correspondent Srinagar, Oct 10: Secretary, Youth Services and Sports, Sarmad Hafeez witnessed the final match of 5th edition of Champions Trophy 2022 at TRC, Cricket ground here. The cricket tournament was organised by Cricket Fraternity Dalgate and around 32 teams from various parts of the valley participated in the tournament. In the finals today, […] The post Sarmad Hafeez witnesses finals of 5th Champions Trophy 2022 at TRC ground Srinagar appeared first on Northlines.","content":"NL Correspondent Srinagar, Oct 10: Secretary, Youth Services and Sports, Sarmad Hafeez witnessed the final match of 5th edition of Champions Trophy 2022 at TRC, Cricket ground here. The cricket tournament was organised by Cricket Fraternity Dalgate and around 32 teams from various parts of the valley participated in the tournament. In the finals today, United Imports defeated Shape up Fitness by 48 runs and clinched the title. After winning the toss, the United Imports managed to score 215 runs in allotted 30 overs and in reply Shape Up Fitness managed to score 173 only. While distributing prizes among winners, Sarmad Hafeez said that they are in a process to improve sports culture in the valley and very soon lights will be installed in the TRC Cricket field which will attract more youth towards Cricket. He also appreciated the efforts of Cricket Fraternity Dalgate for organising such events. Secretary, J&amp;K Sports Council, Nuzhat Gul who was special guest on the ocay, in he address highlighted about the importance of sports and how it can keep the young children away from drugs. She also announced full support to Cricket Fraternity Dalgate for Cricket Tournament for Women’s which will be started soon in TRC ground.The post Sarmad Hafeez witnesses finals of 5th Champions Trophy 2022 at TRC ground Srinagar appeared first on Northlines.","pubDate":"2022-10-10 19:02:09","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Oliver Davidson one of three international players to feature in this season’s ADCA A-grade competition","link":"https://thewest.com.au/news/albany-advertiser/oliver-davidson-one-of-three-international-players-to-feature-in-this-seasons-adca-a-grade-competition--c-8480206","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"This will be the first time in three seasons that international players have featured in the Albany and District Cricket Association.","content":null,"pubDate":"2022-10-10 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8480206/9e5b2e017178ef18944f2a468e80e43db3f35c0a-16x9-x0y209w3467h1950.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"Norths taking low-key approach to new cricket season","link":"https://thewest.com.au/news/kalgoorlie-miner/norths-taking-low-key-approach-to-new-cricket-season-c-8500473","keywords":null,"creator":["Neale Harvey"],"video_url":null,"description":"Nick Willis will assume Norths’ captaincy this season from Trent Mais.","content":null,"pubDate":"2022-10-10 18:00:00","image_url":"https://images.thewest.com.au/publication/C-8500473/422ba42553c45e7a86d3e70623a8cb5f6600ebef-16x9-x0y324w1521h855.jpg","source_id":"thewest","country":["australia"],"category":["sports"],"language":"english"},{"title":"INR 846 Crore net worth MS Dhoni set to expand his new production company in three Indian languages","link":"https://thesportsrush.com/cricket-news-inr-846-crore-net-worth-ms-dhoni-set-to-expand-his-new-production-company-in-three-indian-languages/","keywords":["Cricket","MS Dhoni"],"creator":["Gurpreet Singh"],"video_url":null,"description":"INR 846 Crore net worth MS Dhoni is in all readiness to expand his film making/production arena, if reports are to be believed. Former team India captain and present skipper of the IPL franchise Chennai Super Kings (CSK), MS Dhoni, is reportedly set to expand his production house company business to the Southern part of… The post INR 846 Crore net worth MS Dhoni set to expand his new production company in three Indian languages appeared first on The SportsRush.","content":"Former team India captain and present skipper of the IPL franchise Chennai Super Kings (CSK), MS Dhoni, is reportedly set to expand his production house company business to the Southern part of India. Having already brought smiles on the faces of his countless fans by deciding to feature in one more season (at least) of the IPL for CSK, the legendary wicket-keeper batter has, especially since the past couple of years has invested his earnings on diverse fields, be it animal husbandry, organic farming, Cricket academy, or film production. Under the name ‘Dhoni Entertainment’, the 41-year-old, along with his wife Sakshi Singh Dhoni, own a production company, which has already produced short films like the ‘ ‘, ‘ ‘, and invested in yet another project based on a novel in ‘ ‘. The ‘Dhoni Entertainment’ will now , expand its film production business to three Southern Indian languages in Telugu, Tamil, and Malayalam. While further details on the same are yet to be furnished, the decision might have to do with the stellar rise of quality South Indian cinema releases in the recent few years, or with Dhoni’s proximity and close relationship with Southern India, especially the state of Tamil Nadu. Apart from the aforementioned film production line, Dhoni is already spending ample time while looking after his organic farming and animal husbandry business with the cooperation of the Agriculture Department of Jharkhand. As per , Dhoni’s organic farm produces like strawberries, papaya, bananas, tomatoes, broccoli, cabbage and peas are not only being successfully sold in the Indian markets, but also exported to countries like the UAE, and other Gulf Countries.","pubDate":"2022-10-10 17:47:18","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Pro Kabaddi 2022: Guman Singh, Jai Bhagwan shine as U Mumba defeat UP Yoddhas; Dabang Delhi overpower Gujarat Giants","link":"https://www.firstpost.com/sports/pro-kabaddi-2022-guman-singh-jai-bhagwan-shine-as-u-mumba-defeat-up-yoddhas-dabang-delhi-overpower-gujarat-giants-11422671.html","keywords":["Sports"],"creator":["FP Sports"],"video_url":null,"description":"Pro Kabaddi 2022: Guman Singh, Jai Bhagwan shine as U Mumba defeat UP Yoddhas; Dabang Delhi overpower Gujarat Giants","content":"Bengaluru: Raiders Guman Singh and Jai Bhagwan were the stars as U Mumba defeated UP Yoddhas 30-23 in match 10 of the Pro Kabaddi League Season 9 at the Shree Kanteerava Indoor Stadium here on Monday.Bhagwan picked up six points, while Guman scored five points in the match.Jai Bhagwan and Guman Singh chipped in with raids as U Mumba took a three-point lead at 5-2 in the seventh minute.While the #Mumboys registered their first points in a , the defending champs continued theirHere’s the points table so far!#vivoProKabaddi #MUMvUP #DELvGG pic.twitter.com/mRI41hqjSG— ProKabaddi (@ProKabaddi) October 10, 2022 The U Mumba defence, led by Surinder Singh, backed their raiders and helped the Mumbai team to keep forging ahead. Rinku pulled off a fantastic tackle against Surender Gill in the 14th minute helping U Mumba stay in the lead at 9-6.Bhagwan picked up a couple of raid points as U Mumba led comfortably at 14-9 at the end of the first half.Surender Gill effected a brilliant raid in the opening minutes of the second half and kept the UP Yoddhas in the game at 13-15.However, defenders Kiran Magar and Rinku ensured that the team from Mumbai continues to keep its noses in front at 17-13.Ashish effected a multi-point raid in the 30th minute and reduced the UP Yoddhas to just one player on the mat.Soon after, U Mumba tackled Pardeep Narwal and inflicted an ALL OUT to take a massive lead at 23-17. The U Mumba defence continued to showcase top form as the Mumbai side attained a 10-point lead at 28-18 in the 36th minute.The U Mumba raiders treaded carefully in the last few minutes as the team eventually closed out a comprehensive victory.Dabang Delhi beat Gujarat Giants 53 – 33In the second match of the day, Dabang Delhi crushed their opponents Gujarat Giants to a humbling 20-point win. They also became the first team to surpass the 50-point mark this season scoring 53 points against Giants’ 33.Captain Naveen Kumar led the team from the front scoring 15 raid points, while Manjeet scored 10 points. Defender Krishan also had a good time on the mat, registering a high-five and scoring seven tackle points overall.With inputs from PTIRead all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-10-10 17:22:05","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/10/Pro-Kabaddi.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs SA ODI: DMRC will extend timings of last trains on Oct 11","link":"https://www.business-standard.com/article/sports/ind-vs-sa-odi-dmrc-will-extend-timings-of-last-trains-on-oct-11-122101001252_1.html","keywords":null,"creator":null,"video_url":null,"description":"Delhi Metro will perform extra train trips by extending its last timing by about 30 to 45 minutes on all lines, barring the Airport Express line, to facilitate spectators reach the Ferozshah Kotla Ground for a ODI match on Tuesday. The stadium is adjacent to Delhi Gate and ITO metro stations on the Violet line that connects Kashmere Gate and Raja Nahar Singh stations. \"To facilitate spectators during the one-day international (ODI) cricket match between India and South Africa on October 11, the Delhi Metro has made minor changes in its last train timings on all lines (except Airport Express Line),\" the DMRC said in a statement. \"In anticipation of the sudden rush expected at these nearby metro stations after the match is over, the Delhi Metro will be performing extra train trips (around 48) by extending its last train timings by about 30-45 minutes on all lines,\" the statement said. It will enable spectators to reach their destinations smoothly by using the Metro, it added.","content":"Delhi Metro will perform extra train trips by extending its last timing by about 30 to 45 minutes on all lines, barring the Airport Express line, to facilitate spectators reach the Ferozshah Kotla Ground for a ODI match on Tuesday. The stadium is adjacent to Delhi Gate and ITO metro stations on the Violet line that connects Kashmere Gate and Raja Nahar Singh stations. \"To facilitate spectators during the one-day international (ODI) cricket match between India and South Africa on October 11, the Delhi Metro has made minor changes in its last train timings on all lines (except Airport Express Line),\" the DMRC said in a statement. \"In anticipation of the sudden rush expected at these nearby metro stations after the match is over, the Delhi Metro will be performing extra train trips (around 48) by extending its last train timings by about 30-45 minutes on all lines,\" the statement said. It will enable spectators to reach their destinations smoothly by using the Metro, it added. #DelhiMetro has made minor changes in its last train timings to facilitate the spectators during One-Day International Cricket match between India & South Africa on 11th October 2022 (Tuesday) at Arun Jaitley Stadium, Ferozshah Kotla Ground, New Delhi. Best wishes to team India. pic.twitter.com/oWoj7GaU93 — Delhi Metro Rail Corporation I कृपया मास्क पहनें (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-10-10 17:01:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1221010/thumb-122101001252.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai Cricket Association Elections: Ashish Shelar eyes return as president","link":"https://sportstar.thehindu.com/cricket/domestic/mumbai-cricket-association-elections-mca-president-ashish-shelar-candidate-sandeep-patil-sharad-pawar-fadnavis-bjp/article65993926.ece","keywords":null,"creator":["\n        Amol Karhadkar  \n    "],"video_url":null,"description":"The erstwhile Sharad Pawar Group rebranded itself as Mumbai Cricket Group and reaffirmed its stand of contesting the election with former India all-rounder Sandeep Patil as the candidate for the post.","content":"Political heavyweight Ashish Shelar has formally thrown his hat into the ring for returning as the Mumbai Cricket Association (MCA) president. While Shelar filed his nomination papers on Monday, the last day of filing nominations for the October 20 election, along with a spree of political leaders across parties, the voters were left confused. While Shelar’s faction claimed to have formed an alliance with the former Sharad Pawar Group, the erstwhile Sharad Pawar Group rebranded itself as Mumbai Cricket Group and reaffirmed its stand of contesting the election with former India all-rounder and coach Sandeep Patil as the candidate for the president’s post. The candidature of Shelar - who was the president for two years from 2016 - and his alliance with Pawar was expected with the veteran leader and administrator having been nominated as a representative of a club owned by Shelar. According to a list released by Milind Narvekar, a close aide of former Chief Minister Uddhav Thackeray, besides Shelar, the Shelar-Pawar Group includes political leaders across parties. Besides Shelar, one of the influential leaders of the Bharatiya Janata Party (BJP), incumbent vice-president Amol Kale, an ally of Deputy Chief Minister Devendra Fadnavis, has again filed his papers for the same post. While Narvekar (erstwhile Shiv Sena) and Jitendra Awhad (former minister and a senior leader of Nationalist Congress Party) have submitted their nomination form for the apex council members’ posts. Interestingly, Ajinkya Naik and Gaurav Payyade are the common names in the list for the Shelar-Pawar Group and the Mumbai Cricket Group. While the Mumbai cricket fraternity was abuzz with the possible pull-out of the erstwhile Pawar Group, Patil reassured the voters that he and his group will contest the election. “Me and my group will strive to close the widening communication gap between the association and the clubs. Our group will prioritise the requirements of the clubs and rectify the mistakes of the past,” Patil told a group voters’ meet at Matunga Gymkhana on Monday evening. “I am proud to be leading a group of candidates who are desperate to resolve problems ailing Mumbai cricket and striving for improvement of Mumbai cricket. If you elect us, I assure you that we will try our best to resolve all the impending issues around Mumbai cricket administration.” While the list of valid nominations after scrutiny will be officially announced on Tuesday, the deadline for withdrawal of nominations is 5 PM IST on Friday (October 14). Read more stories on Domestic.","pubDate":"2022-10-10 16:04:34","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Women’s Asia Cup T20 2022 Points Table and Team Standings","link":"https://www.thetimesofbengal.com/sports/womens-asia-cup-t20-2022-points-table-and-team-standings/","keywords":["Sports"],"creator":["admin"],"video_url":null,"description":"Women’s Asia Cup T20 2022 Points Table and Team Standings Follow Us On Points table for the Women’s Asia Cup T20 2022, which is scheduled to take place from October 1, 2022 to October 15, 2022 in Sylhet, Bangladesh. Women’s Asia Cup T20 2022 Points Table # Team Team Played P Won W Lost L […]","content":"Women’s Asia Cup T20 2022 Points Table and Team Standings Follow Us On Points table for the Women’s Asia Cup T20 2022, which is scheduled to take place from October 1, 2022 to October 15, 2022 in Sylhet, Bangladesh. Women’s Asia Cup T20 2022 Points Table # Team Team Played P Won W Lost L No Result N/R Net Run Rate NRR Points Pts 1 India Women IN-W 5 5 4 4 1 1 0 0 +2.590 +2.590 8 8 2 Pakistan Women PK-W 5 5 4 4 1 1 0 0 +2.101 +2.101 8 8 3 Sri Lanka Women SL-W 4 4 3 3 1 1 0 0 +1.282 +1.282 6 6 4 Thailand Women TL-W 5 5 2 2 2 2 0 0 -0.308 -0.308 6 6 5 Bangladesh Women BD-W 4 4 2 2 2 2 0 0 +0.506 +0.506 4 4 6 United Arab Emirates Women UAE-W 5 5 1 1 4 4 0 0 -2.181 -2.181 2 2 7 Malaysia Women ML-W 6 6 0 0 6 6 0 0 -3.002 -3.002 0 0 CricketCricket NewsNewsWomen’s Asia CupWomen’s Asia Cup 2022Women’s Asia Cup T20 2022Women’s Cricket NewsWomen’s Cricket You May Also Like Source link","pubDate":"2022-10-10 16:00:08","image_url":null,"source_id":"the_tob","country":["india"],"category":["sports"],"language":"english"},{"title":"History beckons for title-holders Australia at Twenty 20 World Cup","link":"https://www.kuwaittimes.com/history-beckons-for-title-holders-australia-at-twenty-20-world-cup/","keywords":["Cricket","Sports"],"creator":["kuwaittimes"],"video_url":null,"description":"SYDNEY: Australia have a golden opportunity to create history and become the first back-to-back Twenty20 world champions, but they face a formidable challenge led by India and England. Aaron Finch’s men enjoy the advantage of being the only winners of cricket’s shortest format to have a crack at defending the title on home territory since the … The post History beckons for title-holders Australia at Twenty 20 World Cup appeared first on Kuwait Times.","content":"SYDNEY: Australia have a golden opportunity to create history and become the first back-to-back Twenty20 world champions, but they face a formidable challenge led by India and England. Aaron Finch’s men enjoy the advantage of being the only winners of cricket’s shortest format to have a crack at defending the title on home territory since the T20 World Cup started in 2007. With a star-studded line-up spearheaded by David Warner, Pat Cummins and Glenn Maxwell, the Australians also boast all but one of the team that won the tournament last year in the UAE. Finch, who recently stood down as one-day skipper to focus on T20s, suggested they will be all guns blazing in defense of the trophy. “If in doubt, be overly aggressive. That is how we want to play,” he said. “At times that is going to come with high risk and high reward. At times it comes with no reward. That is just a part of T20.” The tournament’s eighth edition begins on Sunday with Sri Lanka facing Namibia and UAE against Netherlands in a first qualifying round at Geelong, one of seven venues being used for the 45 matches. Games will also be held in Adelaide, Brisbane, Hobart, Perth and Sydney, with the final on November 13 under lights at the cavernous Melbourne Cricket Ground. The top nations join on October 22 when Australia open their defense against Kane Williamson’s New Zealand in Sydney – a repeat of the 2021 final in Dubai where Mitchell Marsh’s unbeaten 77 powered them to an eight-wicket win and maiden crown. Blockbuster clash Despite a couple of key absences India and England are the favorites along with Australia. England face fast-improving Afghanistan in Perth for their opener on October 22 but will be missing star batsman Johnny Bairstow after he suffered a serious leg injury in a “freak accident” on the golf course. A blockbuster clash follows 24 hours later in Melbourne when India take on arch-rivals and 2009 champions Pakistan, with more than 90,000 fans expected. India suffered a huge blow last week when pace spearhead Jasprit Bumrah was ruled out of the World Cup with a back injury, further depleting the stocks of a side that has lacked steam in the final overs of the T20 format. All-rounder Ravindra Jadeja is also absent with a knee problem. While Rohit Sharma’s side are ranked number one, they haven’t lifted the T20 trophy since 2007 and failed to reach the semi-finals last year. “Areas of concerns, we have to look at our bowling, what more options we can find in the powerplay, middle and death,” said swashbuckling opener Sharma, who along with run machine Virat Kohli will be key to their chances. “It will be challenging and we need to find answers, still working towards that.” England threat World number two England are also a big threat for a first title since 2010 and beat Australia in a warm-up match on Sunday. They are in Australia on the back of a 4-3 triumph in Pakistan, a series in which captain Jos Buttler attended but played no part as he recovered from a calf injury. He is though fit for the World Cup and insisted not playing had its benefits. “I’ve learned lots listening to the group and watching the way they go about things, watching without as much emotion as when you are involved and thinking about what you will do at certain times,” he told reporters. The West Indies are the only two-time champions – in 2012 and 2016 – but in a shock failed to automatically qualify for the Super 12 stage because they were outside the top-eight-ranked ICC teams at the time. It means they play the first round of the 16-nation tournament despite now being ranked seven. Nicholas Pooran captains an inexperienced side after Andre Russell was overlooked and a slew of veterans called time on their international careers. They are paired with Scotland, Ireland and Zimbabwe and kick off against the Scots on October 17. Recently crowned Asian champions Sri Lanka are in the same boat despite now being ranked eight and are grouped with Namibia, Netherlands and UAE in the preliminaries. The top two from each group join the Super 12 nations – England, New Zealand, Australia and Afghanistan in Group 1; India, Pakistan, South Africa and Bangladesh in Group 2. – AFP The post History beckons for title-holders Australia at Twenty 20 World Cup appeared first on Kuwait Times.","pubDate":"2022-10-10 15:32:40","image_url":null,"source_id":"kuwaittimes","country":["Kuwait"],"category":["sports"],"language":"arabic"},{"title":"India Vs South Africa 3rd ODI Delhi Weather Forecast, Pitch Report And Probable Playing11 - ICC CRICKET SCHEDULE","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LmljY2NyaWNrZXRzY2hlZHVsZS5jb20vaW5kaWEtdnMtc291dGgtYWZyaWNhLTNyZC1vZGktZGVsaGktd2VhdGhlci1mb3JlY2FzdC1waXRjaC1yZXBvcnQtYW5kLXByb2JhYmxlLXBsYXlpbmcxMS_SAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India Vs South Africa 3rd ODI Delhi Weather Forecast, Pitch Report And Probable Playing11  ICC CRICKET SCHEDULELIVE | IND vs SA 2nd ODI Score: Iyer Leads IND To 7 Wicket Win To Level Series 1-1  India.comIndia v South Africa Third ODI Tips: Ominous India find their range  Betting.betfairIndia vs South Africa, 3rd ODI: Probable XIs, pitch report, weather forecast, match prediction and live streaming details  SportskeedaIND vs SA Match Prediction – Who will win today’s match?  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-10-10 15:14:27","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Azeem Rafiq formally reprimanded by Cricket Discipline Committee for anti-Semitic slurs","link":"https://ca.sports.yahoo.com/news/azeem-rafiq-formally-reprimanded-cricket-151324475.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-10 15:13:24","image_url":null,"source_id":"yahoo","country":["canada"],"category":["sports"],"language":"english"},{"title":"Cricket-Yorkshire&#039;s Rafiq, Gale reprimanded for historical social media posts","link":"https://www.thestar.com.my/sport/cricket/2022/10/10/cricket-yorkshire039s-rafiq-gale-reprimanded-for-historical-social-media-posts","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Former Yorkshire spinner Azeem Rafiq and ex-head coach Andrew Gale are among five players who have been reprimanded by England's Cricket Discipline Commission (CDC) for historical social media posts, the country's cricket board (ECB) said. Read full story","content":null,"pubDate":"2022-10-10 15:10:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/10/10/1771457.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Cricket-Yorkshire's Rafiq, Gale reprimanded for historical social media posts","link":"https://www.channelnewsasia.com/sport/cricket-yorkshires-rafiq-gale-reprimanded-historical-social-media-posts-3000371","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-10-10 15:05:18","image_url":null,"source_id":"channelnewsasia","country":["singapore"],"category":["sports"],"language":"english"},{"title":"IND vs SA 3rd ODI Dream11 prediction: Fantasy cricket tips for India vs South Africa 3rd ODI in Delhi","link":"https://www.dnaindia.com/cricket/report-ind-vs-sa-3rd-odi-dream11-prediction-fantasy-cricket-tips-for-india-vs-south-africa-3rd-odi-in-delhi-2991764","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Check the Dream 11 Team Prediction for India vs South Africa 3rd ODI. Also, check the schedule of the match between India and South Africa.","content":null,"pubDate":"2022-10-10 14:48:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC Awards: Harmanpreet Kaur achieves unique milestone, races ahead of compatriot Smriti Mandhana | READ","link":"https://www.indiatvnews.com/sports/cricket/icc-awards-harmanpreet-kaur-achieves-unique-milestone-races-ahead-of-compatriot-smriti-mandhana-read-nigar-sultana-icc-player-of-the-month-2022-10-10-815201","keywords":null,"creator":null,"video_url":null,"description":"ICC Awards: Indian skipper Harmanpreet Kaur is having a stellar 2022. Earlier this year, she led the Indian team to a successful 2022 Commonwealth Games (CWG) campaign, it might not have ended in the way India wanted to but they still managed to clinch the silver medal. After Mithali Raj's retirement, Kaur was made the full-time skipper of the Indian cricket team and it seems that she is relishing every challenge that is being thrown at her.","content":"ICC Awards: Indian skipper is having a stellar 2022. Earlier this year, she led the Indian team to a successful 2022 Commonwealth Games (CWG) campaign, it might not have ended in the way India wanted to but they still managed to clinch the silver medal. After 's retirement, Kaur was made the full-time skipper of the Indian cricket team and it seems that she is relishing every challenge that is being thrown at her. India's skipper Harmanpreet Kaur riding high on her recent form has been awarded by the ICC. The International Cricket Council has felicitated Harmanpreet with the best player award for September and she has now become the first winner of the ICC Women's Player of the Month award. The Indian skipper had a great run against England in the three-match ODI series that they played. Kaur amassed a total of 221 runs across three matches. The Indian skipper averaged 221 and registered a strike rate of 103.27. She bettered her compatriot who scored a total of 181 runs with a decent average of 60.33. The race wasn't just restricted to Mandhana and Kaur, Nigar Sultana, the skipper of Bangladesh too was in the reckoning and lay her claim to Harmanpreet's throne. The month of September has been a memorable one, not only for Harmanpreet Kaur the player but for Harmanpreet Kaur the captain also. She led the Indian women's team to a 3-0 whitewash over Amy Jones's England which also happens to be India women's first series win in England since 1999. In the first ODI of the series, Kaur registered a scintillating 74* while chasing 228. She later followed it up with 143* off just 111 balls which also happens to be her second-highest ODI score.","pubDate":"2022-10-10 14:33:00","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"}]}