{"newsArray":[{"title":"England crush Proteas in Third Test to claim 2-1 series win","link":"https://www.cairnspost.com.au/sport/cricket/england-crush-proteas-in-third-test-to-claim-21-series-win/video/48422217fabd2736aebb165248f321f4","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: England have cruised to a nine wicket victory in the Third Test against South Africa to claim a 2-1 series win.","content":null,"pubDate":"2022-09-12 22:27:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Dave Kidd: There’s NO chance Southgate will drop Maguire for World Cup opener… Slabhead’s England spot is concrete","link":"https://www.thesun.co.uk/sport/19787339/gareth-southgate-harry-maguire-world-cup-england/","keywords":["Football","Sport","Premier League","World Cup 2022"],"creator":["Dave Kidd"],"video_url":null,"description":null,"content":"WHEN England face Iran in their World Cup opener in Qatar, just ten weeks from now, the smart money is on Harry Maguire being in the starting line-up. Such a decision might be met with howls of derision across the land. Harry Maguire is in line to keep his England spot, despite being dropped at Manchester UnitedGetty It will doubtless be regarded as a sign that Gareth Southgate is pig-headed, out-of-touch and past his sell-by date as England manager. But Southgate’s loyalty towards Maguire is cast-iron. The England boss has been licking his wounds for three months since the 4-0 humiliation by Hungary at Molineux capped a miserable winless four-match Nations League run in June. This Thursday, he will name his squad for clashes with Italy, on Friday week, and Germany, the following Monday, which represent England’s final matches before the weird, disorientating and utterly corrupt mid-season World Cup. Read More In Football MAG LIFT Southgate tells Maguire ‘don’t worry’ about England spot despite Man Utd axe PARTY STARTER PartyCasino offer: How to claim an incredible 120 FREE SPINS on Starburst And Manchester United’s troubled captain seems certain to be included — despite his axing by club boss Erik ten Hag. When Maguire has started this season, United’s record reads played three, lost three. When he has been excluded, Ten Hag’s men have played four, won four. Yet for Southgate, old Slabhead remains untouchable.­ Most read in Football RON MORE BID Ronaldo handed offer to move to Saudi Arabia after rejecting 'obscene' deal CARROLL CRASH HORROR Footie ace Andy Carroll wrecks £130k Mercedes in head-on crash TOUGH ON THOM 'Devastated' Tuchel breaks Chelsea axe silence in 'most difficult statement' ROSS IS BOSS Nice fans swoon over 'elegant' Ross Barkley after ex-Chelsea star makes debut CARR BLIMEY Carroll set for football return at Reading on free transfer after Baggies exit bright idea Brighton consider Bodo/Glimt's Knutsen & free agent De Zerbi to replace Potter That defeat by Hungary was England’s biggest home defeat in 94 years and easily the worst night of Southgate’s six-year reign. And one of the loudest groans came when he introduced Maguire as a late sub, after John Stones had been sent off and Hungary had scored their third goal. Maguire, once a man-of-the-people cult hero among England fans, is now treated with extraordinary levels of contempt. He was booed by large sections of the Wembley crowd before the friendly against Ivory Coast in March and even as far away as Melbourne, during a United pre-season friendly in July. So why is Maguire afforded apparently special treatment by Southgate, who has previously claimed he would only choose those playing regularly for their clubs? Well, it’s not as if there are a whole host of in-form English central defenders. Eric Dier, who has been consistently excellent in Spurs’ back three, will receive a long overdue recall. Especially as Southgate may revert to a back three for Qatar. And Stones, suspended for next week’s trip to Milan, is being included more frequently in Manchester City’s starting line-up. But beyond those two, Ben White is playing for Arsenal at right-back — the one position in which Southgate is already famously well-stocked. And the other two centre-backs in the Euros squad last year were Tyrone Mings and Conor Coady. Mings has been stripped of the Aston Villa captaincy, while Wolves’ Coady has been loaned to Everton. Marc Guehi of Crystal Palace and AC Milan’s Italian title-winner Fikayo Tomori are both in the mix but neither were particularly impressive for England in June, when Southgate rightly claimed Maguire had been his best centre-half. Apart from this scarcity of potential replacements, Southgate has always remained remarkably loyal to those who started regularly during the 2018 World Cup. Seven of his Russian starting XI lined up against Germany in Munich in June and Jordan Henderson might have been an eighth, if available. Maguire was also included in Uefa’s Team of the Tournament for last summer’s Euros — despite missing the opening two matches through injury. Many of us had questioned Southgate’s decision to name an unfit player — a failing of previous overly loyal England managers — but Maguire proved his boss spectacularly right. It isn’t true that Maguire has never let England down — his early sending-off in a Nations League home defeat by Denmark came just weeks after he was arrested on holiday in Greece, causing him to be axed from Southgate’s squad. But by and large, Maguire has been excellent for his country. And however badly England ended last season, Southgate is easily his nation’s most successful manager since Sir Alf Ramsey. He has fully earned the right to do things his way in Qatar. And that will mean a prominent role for Maguire, despite the booing mob. Southgate is a long-term manager with a long memory, in an age of knee-jerk short-termism. If he fails in Qatar, he will fail on his own terms — with Maguire in his team. VAR FROM OK ABROAD TOO JUST as VAR-devotees will tell you the system is not to blame, only the people who operate it, they will back up their claim by insisting it is only a shambles in England. So they’ll be hoping you haven’t seen the injury-time chaos in Sunday’s Serie A clash between Juventus and Salernitana. A 96th-minute ‘winner’ by Juve’s Arkadiusz Milik was incorrectly ruled out for offside by VAR, when a defender lurking by the corner flag, clearly playing everyone on, was somehow not spotted by the remote official. In the ensuing furore, Juve boss Max Allegri and three players were sent off. So, yeah, the system is fine, it’s just our incompetent muppets to blame — there’s nothing to see elsewhere. B&B A 5-STAR IT’S difficult to recall any change of management of any team, in any sport, having such a dramatically positive effect as Brendon McCullum and Ben Stokes as coach and captain of England’s Test cricketers. After one victory in 17 matches under the old regime, England have won six out of seven this summer — many in thrilling, record-breaking style. It was ludicrous that moderately bad light stopped play on Sunday, with England 33 runs short of victory against South Africa. Yet several thousand still turned out on a Monday morning to watch 25 minutes of cricket — testament to the public appreciation of this team and Test cricket itself. Perhaps the ECB can now stop obsessing about The Hundred and start prioritising the sport’s original, and best, format. NO PREM NET GAIN AS Premier League clubs had a larger net summer spend than the other four major European leagues put together, they should be dominating continental club competitions. Yet English teams have lifted only one of the last seven major trophies and, in last week’s openers, Liverpool, Chelsea and Manchester United all lost. Spanish clubs won nine trophies out of ten between 2014-18, without enjoying overall financial dominance. It would be unspeakably dull if Premier League sides lived up to their financial might — but they are falling way, way short. FA OFF ON ONE AFTER being widely panned for calling off all football at the weekend, while other sports carried on, the FA are sticking to their guns. So, while Gareth Southgate will still name his England squad on Thursday for the Nations League games against Italy and Germany, he will not hold his usual media interviews. Some of the decisions over what is or isn’t ‘disrespectful’ during the period of national mourning for the Queen have been farcical — such as the closing of a bicycle rack in Norwich. But the FA’s paranoia is extreme. NEXT week marks the first anniversary of Jimmy Greaves’ death. And if you’d like to read about English football’s greatest scorer’s life by those who knew him best, then I’d heartily recommend The Jimmy Greaves We Knew, collated by Mike Donovan.","pubDate":"2022-09-12 20:04:33","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"CEP-2XI vs SIN-2XI Dream11 Prediction: Fantasy Cricket Tips, Today's Playing XIs, Player Stats, Pitch Report for Cricket Associations T20, Match 13","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/cep-2xi-vs-sin-2xi-dream11-prediction-fantasy-cricket-tips-today-s-playing-xis-player-stats-pitch-report-cricket-associations-t20-match-13?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Adarsh Tabhane"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-12 19:37:52","image_url":"https://static.sportskeeda.com/editor/2022/09/a412f-16630033043881-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"ACE vs SCA Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11, Player Stats and Pitch Report for Bukhatir League 50 Over 2022, Match 3","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/ace-vs-sca-dream11-prediction-fantasy-cricket-tips-today-s-playing-11-player-stats-pitch-report-bukhatir-league-50-over-2022-match-3?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Ishaan Mahajan"],"video_url":null,"description":null,"content":null,"pubDate":"2022-09-12 19:37:52","image_url":"https://static.sportskeeda.com/editor/2022/09/1f137-16630076390402-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Stokes vows no let-up in England's attacking approach after series win against South Africa","link":"https://www.iol.co.za/sport/cricket/international/stokes-vows-no-let-up-in-englands-attacking-approach-after-series-win-against-south-africa-c82c6ee6-28cc-4023-9e98-66159d436073","keywords":null,"creator":["AFP"],"video_url":null,"description":"Ben Stokes vowed England would keep up their bold approach to Test cricket under coach Brendon McCullum after wrapping up a series win over South Africa.","content":null,"pubDate":"2022-09-12 19:36:29","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/2b3647bb-7e20-57a8-be56-3a65e10f1fa8&operation=CROP&offset=0x0&resize=820x461","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Premier League: Newcastle sign former Liverpool goalkeeper Loris Karius","link":"https://www.firstpost.com/firstcricket/sports-news/premier-league-newcastle-sign-former-liverpool-goalkeeper-loris-karius-11240011.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Premier League: Newcastle sign former Liverpool goalkeeper Loris Karius","content":"London: Newcastle have signed former Liverpool goalkeeper Loris Karius on a short-term contract as cover for Nick Pope after an injury to fellow stopper Karl Darlow.The German, a free agent following his departure from Liverpool in June, has agreed a deal until January with an option to extend his stay until the end of the season.The 29-year-old’s arrival follows an ankle injury sustained by Darlow in training.“We are pleased to add Loris to our goalkeeping group,” said Newcastle boss Eddie Howe. “He is a very good goalkeeper with Premier League and European experience and he will provide competition and support over an important part of the season.”Karius was previously Liverpool’s first-choice goalkeeper under Jurgen Klopp but never played for the club again after he made calamitous errors for two goals in the 3-1 defeat by Real Madrid in the 2018 Champions League final.The goalkeeper said he was excited to make the move to St James’ Park.“Newcastle have a great coach and play really attractive football,” he said. “I felt it was the right project for me and I”m excited to work with the coaches and my new teammates.”Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 19:20:22","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Loris-Karius-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Dean Elgar rues South Africa's lack of runs after England series loss","link":"https://www.firstpost.com/firstcricket/sports-news/dean-elgar-rues-south-africas-lack-of-runs-after-england-series-loss-11239991.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Dean Elgar rues South Africa's lack of runs after England series loss","content":"London: South Africa captain Dean Elgar was left lamenting his side’s lack of runs after England sped to a series-clinching win in the third Test at the Oval.England needed just 25 minutes’ playing time on Monday’s scheduled fifth day to wrap up a dominant nine-wicket victory for a 2-1 campaign triumph.But in a three-Test series where no match went beyond the third day’s play, England’s success in south London was achieved in just over two days of actual cricket, with Thursday’s opener washed out before Friday was abandoned completely as a mark of respect following the death of Queen Elizabeth II.With the pitch having had more time than usual to ‘sweat’ under the covers, late-season English conditions, often a testing environment for batting, were made that much more difficult and it was no surprise when South Africa were dismissed for a meagre 118.England fared little better in making 158, with both sides boasting a strong seam attack and a fallible top order.South Africa’s second-innings 169 left England with just 130 to chase and the hosts knocked off the runs inside 23 overs.This match represented the fourth-shortest Test staged in England in terms of the number of balls – 909 – and the briefest in the country in 110 years.But a South Africa batting line-up now without Hashim Amla and Quinton de Kock, both retired from Tests, had already been struggling.The tourists managed just one individual fifty in three matches — opener Sarel Erwee’s 73 during an innings and 12-run win in the first Test at Lord’s.South Africa, still in contention for a World Test Championship final berth, are next in red-ball action during a three-match series away to Australia later this year .But that will be the Proteas’ last such campaign until 2026, with their intervening Test series in the recently published Future Tours Programme a maximum of two matches each.Add in that the lauch next year of a new domestic Twenty20 franchise competition — which Cricket South Africa chiefs hope will prove a money-spinner — will cut across a first-class programme that has itself been cut from 10 matches to seven a side, and the difficulty in developing the Proteas’ next generation of Test batsmen becomes all too apparent.“I always bank on experience,” said 35-year-old opener Elgar, a veteran of 79 Tests.”I know we don’t have that at the Test level.“My next best thing is who do we have with experience in first-class cricket back home?”Elgar, who averaged a mere 21.40 in the England series compared to a career mark of 38.83, added: “It was up there with really tough conditions, even for myself and I’ve got a relatively decent amount of experience. I can only imagine how a guy with one or two Tests under his belt must feel.”‘No cobwebs’ for Jansen One consolation for South Africa was the form of Marco Jansen, who continued an impressive start to his Test career by topping both the tourists’ batting and bowling averages.Jansen scored 82 runs at 27.33 and the towering 22-year-old left-arm quick took nine wickets at 13.11 apiece — and all this in two matches after Jansen was misguidedly dropped from the team that lost the second Test by an innings and 85 runs.“He is a massive talent,” said Elgar of Jansen, who has now played seven Tests. “I do think he approaches the game with more of a positive mindset. He has got no baggage, no cobwebs in his closet…He has never really been hurt or failed at a young age.”Elgar often became irked when repeatedly asked about England’s so-called ‘Bazball’ approach, a reference to the attacking intent with which they played under coach Brendon McCullum.England have now won six of their seven Tests under a new leadership duo of McCullum and captain Ben Stokes, but Elgar said: “I didn’t see that ‘B-word’ at all coming through, I just felt they controlled it well.“Throughout the whole series I thought they played pretty accurate Test cricket.”Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 19:07:41","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Dean-Elgar-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Bumrah, Harshal back for T20 WC; Shami among stand-bys","link":"https://www.thehansindia.com/sports/bumrah-harshal-back-for-t20-wc-shami-among-stand-bys-761490","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":null,"content":"New Delhi: A fit-again pace spearhead Jasprit Bumrah and death overs specialist Harshal Patel were predictably back in the India squad for the upcoming T20 World Cup in Australia starting October 16.India will play their first match against Pakistan on October 23. Bumrah, who was suffering from back injury and Harshal, who had a side strain, had done an intense rehabilitation programme at the National Cricket Academy and the BCCI medical team has deemed them fit for the marquee series. The two players, who missed out on World Cup berth were pacer Avesh Khan and leg-spinner Ravi Bishnoi, who was pipped by senior off-spinner Ravichandran Ashwin. However, veteran pacer Mohammed Shami was back in the T20 scheme of things as he has been picked for the T20 series versus Australia and South Africa prior to the big event and is also among the four stand-bys who will travel Down Under. The other three reserve players are Shreyas Iyer, Bishnoi and seamer Deepak Chahar. Hardik Pandya, Arshdeep Singh and Bhuvneshwar Kumar will be reporting to the NCA for conditioning-related work during the course of the home series against Australia and South Africa. Bhuvneshwar will miss the South Africa series while Hardik and Arshdeep will skip the Australia series beginning September 20. (PTI)","pubDate":"2022-09-12 18:47:44","image_url":"https://assets.thehansindia.com/h-upload/2022/09/12/500x300_1312069-bumrah.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Sachin Tendulkar by his side, Yuvraj Singh grooves to Raina-Pathan’s singing","link":"https://www.tribuneindia.com/news/sports/watch-sachin-tendulkar-by-his-side-yuvraj-singh-grooves-to-raina-pathans-singing-431034","keywords":null,"creator":null,"video_url":null,"description":"Chandigarh, September 12As part of Road Safety World Series India's cricket legends have come together. After their exploits on the field, likes of Yuvraj Singh, Sachin Tendulkar, Irfan Pathan and Suresh Raina are having fun off it too.In a video posted by Yuvraj Singh on Facebook, cricket fans can catch the legends singing and dancing.While Yuvraj Singh can be seen dancing on peppy Bollywood numbers, Irfan Pathan and Suresh Raina have taken to singing.With all cricket legends in one frame, fans could not have asked for more.","content":"Tribune Web Desk Chandigarh, September 12 As part of Road Safety World Series India’s cricket legends have come together. After their exploits on the field, likes of Yuvraj Singh, Sachin Tendulkar, Irfan Pathan and Suresh Raina are having fun off it too. In a video posted by Yuvraj Singh on Facebook, cricket fans can catch the legends singing and dancing. While Yuvraj Singh can be seen dancing on peppy Bollywood numbers, Irfan Pathan and Suresh Raina have taken to singing. With all cricket legends in one frame, fans could not have asked for more.","pubDate":"2022-09-12 17:39:32","image_url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1355947190.jpeg","source_id":"tribuneindia","country":["india"],"category":["sports"],"language":"english"},{"title":"SC to hear on September 13 BCCI's plea on tenure of its office bearers","link":"https://www.business-standard.com/article/current-affairs/sc-to-hear-on-september-13-bcci-s-plea-on-tenure-of-its-office-bearers-122091201096_1.html","keywords":null,"creator":null,"video_url":null,"description":"The Supreme Court on Monday said that it would hear on September 13, a plea of the Board of Control for Cricket in India (BCCI) seeking the court's permission to amend its constitution concerning the tenure of its office bearers including that of the President and Secretary. The BCCI, in its proposed amendment, has sought the abolition of a cooling-off period for its office bearers which would enable Sourav Ganguly and Jay Shah to continue in office as President and Secretary despite them having completed six years at respective state cricket associations. A bench of Justices DY Chandrachud and Hima Kohli told Solicitor General Tushar Mehta, appearing for the BCCI, that it would take up the matter along with other matters related to the functioning of the cricket board on Tuesday afternoon. The top court asked senior advocate Maninder Singh, who has been appointed amicus curiae in the matter, after the elevation of senior advocate PS Narasimha, as top court's judge, to collate all t","content":"The Supreme Court on Monday said that it would hear on September 13, a plea of the Board of Control for Cricket in India (BCCI) seeking the court's permission to amend its constitution concerning the tenure of its office bearers including that of the President and Secretary. The BCCI, in its proposed amendment, has sought the abolition of a cooling-off period for its office bearers which would enable Sourav Ganguly and Jay Shah to continue in office as President and Secretary despite them having completed six years at respective state cricket associations. A bench of Justices DY Chandrachud and Hima Kohli told Solicitor General Tushar Mehta, appearing for the BCCI, that it would take up the matter along with other matters related to the functioning of the cricket board on Tuesday afternoon. The top court asked senior advocate Maninder Singh, who has been appointed amicus curiae in the matter, after the elevation of senior advocate PS Narasimha, as top court's judge, to collate all the intervention applications and place it before the court so that it can have a brief idea about the issues. Original petitioner Aditya Verma, who initially brought the issue before the top court, appeared in person and said that a lot of irregularities are taking place in Bihar Cricket Association and its constitution is being changed without the leave of the court. Mehta had earlier told the court that as per earlier orders, the constitution can only be amended with the leave of the court, and hence the cricket body has moved an application in this regard. The plea of the BCCI seeks to amend its constitution concerning the tenure of its office bearers including its President Sourav Ganguly and Secretary Jay Shah by doing away with the mandatory cooling-off period between tenures of office bearers across state cricket associations and the BCCI . Earlier, the Justice R M Lodha-led committee had recommended reforms in the BCCI which have been accepted by the top court. The constitution of the BCCI, which has been approved by the top court, stipulates a mandatory three-year cooling-off period for anyone who had served two consecutive terms of three years each in the state cricket association or the BCCI. While Ganguly was an office bearer in the Cricket Association of Bengal, Shah had served in the Gujarat Cricket Association. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","pubDate":"2022-09-12 17:38:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220912/thumb-122091201096.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"DYSS starts Cricket trials at Miran Sahib","link":"https://www.thenorthlines.com/dyss-starts-cricket-trials-at-miran-sahib/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"NL CORRESPONDENT Jammu, Sept 12:Department of Youth Services and Sports (DYSS) organised Cricket selection trials for Miran Sahib Zone to raise team for the proposed LG Rolling Trophy at GBHS Simbal Camp, here today. Sub Divisional Magistrate (SDM) R S Pura, Ram Lal Sharma was chief guest, who declared open the event in the presence […] The post DYSS starts Cricket trials at Miran Sahib appeared first on Northlines.","content":"NL CORRESPONDENT Jammu, Sept 12:Department of Youth Services and Sports (DYSS) organised Cricket selection trials for Miran Sahib Zone to raise team for the proposed LG Rolling Trophy at GBHS Simbal Camp, here today. Sub Divisional Magistrate (SDM) R S Pura, Ram Lal Sharma was chief guest, who declared open the event in the presence of Sarpanch Raja Singh, Sarpanch Binny Sharma and Kailash Devi, Headmistress GBHS Simbal. Earlier, Zonal Physical Education Officer (ZPEO), Miran Sahib, Rakesh Kakar welcomed the gathering and apprised the guests about the Cricket trials for the LG Rolling Trophy amidst highlighting other activities of the Zone. Trial are being conducted by the team of officials of DYSS including Pankaj Sasan, Bandana Sharma, Gurmeet Singh, Ravinder Singh Bali, Ravinder Singh, Bikram Singh, Gurmeet Singh, Amolak Singh Jagandeep Singh, Raghunandan Sharma and Mosami Sharma.The post DYSS starts Cricket trials at Miran Sahib appeared first on Northlines.","pubDate":"2022-09-12 17:33:52","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Mark Boucher To Quit As South Africa Head Coach After T20 World Cup 2022","link":"https://sports.ndtv.com/cricket/mark-boucher-to-quit-as-south-africa-head-coach-after-t20-world-cup-2022-3338933","keywords":null,"creator":null,"video_url":null,"description":"Cricket South Africa said it will in due course make an announcement regarding a successor to outgoing coach Mark Boucher.","content":null,"pubDate":"2022-09-12 17:30:37","image_url":"https://c.ndtvimg.com/2020-11/5jns2b0g_mark-boucher-twitter_650x400_19_November_20.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"South Africa head coach Mark Boucher to step down after ICC T20I World Cup 2022","link":"https://www.dnaindia.com/cricket/report-south-africa-head-coach-mark-boucher-to-step-down-after-icc-t20i-world-cup-2022-2984724","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"Cricket South Africa on Monday confirmed that the head coach of Proteas, Mark Boucher will quit after the upcoming T20I World Cup 2022.","content":null,"pubDate":"2022-09-12 17:18:00","image_url":null,"source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"World Test Championship: South Africa’s defeat to England opens up the points table for India, Pakistan","link":"https://www.firstpost.com/firstcricket/sports-news/world-test-championship-south-africas-defeat-to-england-opens-up-the-points-table-for-india-pakistan-10875041.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"World Test Championship: South Africa’s defeat to England opens up the points table for India, Pakistan","content":"After South Africa’s 1-2 defeat to England in the recently concluded three-match Test series, the World Test Championship points table has been left wide open for the top two spots.The defeat against Three Lions have dropped them to the second spot from a leading position with 60 percentage points.While Proteas’ win would have significantly strengthened their claim to play the final in 2023 in London, England have benefitted the likes of India and Pakistan winning two out of three games.Proteas’ stern Test will now be against Australia, Down Under when they play three Tests.The three-Test series will be equally important for Australia and those three games might act as an eliminator for one of the two, depending on the performance of other teams.Both the teams will also play West Indies at their homes and will start as favourites to win those matches.Australia comfortably sit at the top of the table with 70 percentage points currently and are highly probable to make it to the finals. However, they play India in India for four Tests, which might prove to be the determining series for them.Losing several matches against the Rohit Sharma-led side might throw them down the points table.India is ranked fourth on the table with 52.08 percentage points, but not far behind Sri Lanka’s 53.33. The Men-in-Blue will travel to Bangladesh for two games and then host Australia for four games. They find themselves in a tight situation as winning all six matches will push them to 68.06 percentage points, and they might still depend on the other teams’ results.However, considering Australia play South Africa, one of the two teams might drop down quite significantly and that shall propel India to the top two, considering they win all or most of their matches.Sri Lanka, on the contrary, despite being placed third have a bleak chance to make it to the top two as they have only two games remaining against New Zealand in New Zealand. Winning both the Tests – a dubious possibility will only lead them to 61.1 percentage points.Pakistan are also in close vicinity of India at 51.85 percentage points. But they have five home Tests to be played – three against rejuvenated England and two against the Kiwis.A win in all five will thrust them to 69.05 percentage points. But, England’s new avatar will prove to be a strong contest for them in the three matches, and a loss or draw there will significantly impact their overall tally. Remember, Australia won the three-match series 1-0 in Pakistan.England, meanwhile, have bettered their tally to 38.6 percentage points after winning six Tests of the seven this summer. However, their earlier losses to Australia in the Ashes and to India last summer, have made sure that they cannot make it to the top two. A heavy 12 points penalty during the Ashes only acted as a catalyst to their ouster.Despite of being in their best form at the time, England will not be a part of the final that will be played in their own backyard. However, they can help the other sides by defeating Pakistan in their last series of the cycle.West Indies are the sixth team that have a mathematical chance to reach the finals, but with four away Tests left in their cycle – two each against Australia and South Africa, only a cricketing muggle would bet on them.Despite six teams mathematically possible to reach the finals, only three teams – India, Australia, and South Africa have a realistic chance to face off in London in 2023.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 17:16:08","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/07/WTC-points-table-England-India.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"T20 World Cup 2022: A look at the changes in India's squads since 2021 edition","link":"https://www.firstpost.com/firstcricket/sports-news/t20-world-cup-2022-a-look-at-the-changes-in-indias-squads-since-2021-edition-11239001.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"T20 World Cup 2022: A look at the changes in India's squads since 2021 edition","content":"The Board of Control for Cricket in India (BCCI) announced the squad for the T20 World Cup 2022 on Monday. The Men in Blue will be led by Rohit Sharma while KL Rahul has been named his deputy. Bowlers Jasprit Bumrah and Harshal Patel have also made a cut in the side after clearing the fitness test while pacer Mohammed Shami is one of the standby players.The squad for this year’s edition looks pretty different from the last one. We now take a look at who are the players who were a part of the team in the last T20 World Cup.The wicket-keeper batter Ishan Kishan, spinners Varun Chakravarthy and Rahul Chahar, pacers Shardul Thakur and Mohammed Shami and all-rounder Ravindra Jadeja were all part of the Indian squad in the last edition of the T20 World Cup.Shami is in the standby while Jadeja has missed out on a place for the 2022 edition due to injury.The players who have been roped in for this T20 World Cup and were not a part of the team last time are as follows:The wicket-keeper batter Dinesh Karthik has been picked up by the selectors. While Karthik has been phenomenal with the bat in the death overs, he also brings in a lot of experience to the table and provides the side with an extra wicket-keeping option.All-rounder Deepak Hooda has shown his talent in the recent and has been picked up in the squad for the 2022 T20 World Cup. Apart from him, Yuzvendra Chahal who had missed out a place in the unit in the last edition is also back, riding on some exceptional performances earlier this year. Youngsters Harshal Patel and Arshdeep have also been named in the team.While Harshal has an ability to deceive the batters with his slower ones, Arshdeep is on spot with his yorkers and is pretty economical in the powerplay as well as death overs. All-rounder Azar Patel is also included in the team.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 17:06:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/India-squad-changes-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Bumrah, Harshal back for T20 World Cup; Jadeja out","link":"https://www.thenorthlines.com/bumrah-harshal-back-for-t20-world-cup-jadeja-out/","keywords":["Sports"],"creator":["Northlines"],"video_url":null,"description":"NL CORRESPONDENT Fit-again pace spearhead Jasprit Bumrah and death overs specialist Harshal Patel were back as the national selection committee didn’t spring any surprises in the 15-man India squad for the upcoming T20 World Cup in Australia starting October 16. India will play their first match against Pakistan at the MCG on October 23. Bumrah, […] The post Bumrah, Harshal back for T20 World Cup; Jadeja out appeared first on Northlines.","content":"NL CORRESPONDENT Fit-again pace spearhead Jasprit Bumrah and death overs specialist Harshal Patel were back as the national selection committee didn’t spring any surprises in the 15-man India squad for the upcoming T20 World Cup in Australia starting October 16. India will play their first match against Pakistan at the MCG on October 23. Bumrah, who was suffering from back injury and Harshal, who had a side strain, had undergone an intense rehabilitation programme at the National Cricket Academy and the BCCI medical team has deemed them fit for the marquee tournament. The two players, who missed out on a World Cup berth were pacer Avesh Khan and leg-spinner Ravi Bishnoi, who was pipped by senior off-spinner Ravichandran Ashwin. Once Harshal was fit and available, there was very little chance for Avesh to make the cut especially with a death overs economy rate of 18 in recent times. If there was one player who would feel hard done by, it would be young Bishnoi as he was fantastic against Pakistan in the Super 4s game of the Asia Cup where he had outshone senior wrist spinner Yuzvendra Chahal. While Chahal was an automatic choice, Bishnoi’s fight was always for the third spinner’s slot with veteran Ravichandran Ashwin. Obviously, two leg-spinners wouldn’t have added variations but Ashwin’s presence on big Australian grounds and his ability to take the ball away from the left-handers got precedence. Pakistan, South Africa and Sri Lanka (likely Qualifier in India’s group) all have a couple of left-handers in top five and if Ashwin is played, he can exploit that advantage. The batting unit, which hasn’t performed up to expectations on big days more or less remained the same and in fact there aren’t any new faces from the last T20 World Cup squad save Deepak Hooda, who won’t always be an automatic first XI player and Dinesh Karthik. The Rohit Sharma interview of Virat Kohli was a clear indicator that there won’t be any change in the top three and the only debate that remains unsolved is whether Karthik will be picked or will it be Rishabh Pant, who is the only specialist left-hander in the top-order with Ravindra Jadeja ruled out for indefinite period. Shami wasn’t directly picked for the World T20 as he hasn’t played any cricket after the England series Veteran pacer Mohammed Shami was back in the scheme of things in white-ball cricket as he has been picked for the T20 series versus Australia and South Africa prior to the mega event and is also among the four standbys who will travel Down Under. The other three reserve players are Shreyas Iyer, Bishnoi and seamer Deepak Chahar. Shami wasn’t directly picked for the World T20 as he hasn’t played any cricket after the England series and the upcoming six T20Is will give Head Coach Rahul Dravid and captain Rohit a chance to check out his rhythm and bowling at the death. Hardik Pandya, Arshdeep Singh and Bhuvneshwar Kumar will be reporting to the NCA for workload management and conditioning work during the course of the home series against Australia and South Africa. Bhuvneshwar will miss the South Africa series while Hardik and Arshdeep will skip the Australia series beginning September 20. SQUADS: For World Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Bhuvneshwar Kumar, Harshal Patel, Arshdeep Singh. Standby players – Mohammed Shami, Shreyas Iyer, Ravi Bishnoi, Deepak Chahar. For Australia T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, R. Ashwin, Yuzvendra Chahal, Axar Patel, Bhuvneshwar Kumar, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah. For South Africa T20Is: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Suryakumar Yadav, Deepak Hooda, Rishabh Pant (wicket- keeper), Dinesh Karthik (wicket-keeper), R. Ashwin, Yuzvendra Chahal, Axar Patel, Arshdeep Singh, Mohd. Shami, Harshal Patel, Deepak Chahar, Jasprit Bumrah.The post Bumrah, Harshal back for T20 World Cup; Jadeja out appeared first on Northlines.","pubDate":"2022-09-12 17:06:16","image_url":null,"source_id":"thenorthlines","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes proves captaincy is no burden after England’s summer of success | Ali Martin","link":"https://www.theguardian.com/sport/2022/sep/12/ben-stokes-proves-captaincy-is-no-burden-after-england-summer-of-success-south-africa","keywords":["England v South Africa 2022","England cricket team","South Africa cricket team","Ben Stokes","Brendon McCullum","Cricket","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"The all-rounder has handled the responsibility of leading his team and their transformation has restored the public’s faithThe sponsors’ backdrop was missing and the champagne spray parked but at the end of a rapid-fire Test decider, played out to a backdrop of national mourning in which English cricket struck the right tone, Ben Stokes smiled with satisfaction at the presentation of the Basil D’Oliveira Trophy.A crowd of 5,000 had pitched up to the Oval to watch just 25 minutes of cricket in watery September sunshine as England sealed a nine-wicket victory over South Africa and with it the series 2-1. After Ollie Pope had duffed his attempt to scoop the winning runs a la Joe Root earlier in the summer, Zak Crawley punched Marco Jansen through cover for four to move to a satisfying unbeaten 69 and complete an inevitable chase of 130. Continue reading...","content":null,"pubDate":"2022-09-12 17:00:40","image_url":"https://i.guim.co.uk/img/media/3c15aef48c362341353ab8211417a4b0938cfb1b/0_190_5856_3514/master/5856.jpg?width=460&quality=85&auto=format&fit=max&s=04004b3354190c953b431b15648a96a8","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Ajay Sharma appointed Jammu and Kashmir coach","link":"https://sportstar.thehindu.com/cricket/ajay-sharma-jammu-kashmir-coach-2022-23-domestic-cricket-season/article65884035.ece","keywords":null,"creator":["\n        Shayan Acharya  \n    "],"video_url":null,"description":"Ajay Sharma will replace Sanjeev Sharma as the coach of Jammu and Kashmir for the upcoming domestic cricket season.","content":null,"pubDate":"2022-09-12 16:44:05","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Premier League to resume this weekend but Chelsea v Liverpool one of three postponed games ahead of Queen’s funeral","link":"https://metro.co.uk/2022/09/12/premier-league-resume-this-weekend-but-chelsea-man-utd-games-off-queen-funeral-17353873/","keywords":["Football","English Football Association","Football Association","Premier League","Queen Elizabeth II"],"creator":["Louis Sealey"],"video_url":null,"description":"Some games will take place the day before the Queen's funeral.","content":"The Premier League will resume this weekend ahead of the Queen’s funeral (Picture: Getty) The Premier League and EFL will resume this weekend but Chelsea’s clash with Liverpool at Stamford Bridge is one of three matches that has been postponed ahead of the Queen’s funeral. All English, Welsh and Northern Irish football and senior Scottish football was cancelled last weekend as a mark of respect following the death of Queen Elizabeth II. While football came to a halt, several sports including cricket, rugby, horse racing and golf resumed over the weekend. The strain on police resources before and during the Queen’s funeral – which will take place on Monday 19 September – has led further postponements this weekend. Manchester United’s home match against Leeds United has been called off, while the Premier League has confirmed Crystal Palace’s trip to Brighton will also remain postponed. The Premier League said in a statement: ‘Following extensive consultation with clubs, police, local Safety Advisory Groups and other relevant authorities, there was no other option but to postpone the three fixtures. ‘The Premier League would like to thank the UK Football Policing Unit and other police forces across the country, as well as our broadcast partners, for their support during this process, and will continue to liaise with them ahead of the weekend. This weekend's Premier League fixtures Friday 16 September 20:00 Aston Villa v Southampton (Sky Sports)20:00 Nott’ham Forest v Fulham Saturday 17 September 12:30 Wolves v Man City (BT Sport)15:00 Newcastle  v AFC Bournemouth17:30 Spurs v Leicester City (Sky Sports)Postponed Brighton v Crystal Palace Sunday 18 September 12:00 Brentford v Arsenal (Sky Sports)14:15 Everton v West Ham (Sky Sports)Postponed Chelsea v Liverpool Postponed Man Utd v Leeds  Queen Elizabeth II dead: Latest updates Queen Elizabeth dead at the age of 96 after 70-year rule of UK What happens next following the death of the Queen? Was the Queen the longest serving monarch in the world? RIP Ma'am: Your heartfelt messages to her Majesty The Queen Nationwide minute's silence for The Queen at 8pm on Sunday Follow Metro.co.uk's live blog for the latest updates, and sign Metro.co.uk's book of condolence to Her Majesty here. ‘For the matches being played during the period of National Mourning, tributes will be paid to The Queen at Premier League stadiums. New dates for the postponed matches will be announced in due course.’ Although this weekend’s fixtures fall inside the 10-day mourning period, Government guidance issued to sporting governing bodies stated: ‘There is no obligation to cancel or postpone events and sporting fixtures or close entertainment events during the National Mourning period.’ The English Football League, meanwhile, confirmed their full schedule would resume from Tuesday 13 September, with a minute’s silence to be held before all matches, players to wear black armbands, flags at half-mast and the national anthem to be played in stadiums. The football authorities have been criticised for the blanket postponement over the weekend, with former England striker Gary Lineker claiming the sport ‘missed an opportunity’ to pay tribute to the Queen. Ex-Manchester United defender Gary Neville added: ‘Sport can demonstrate better than most the respect the Queen deserves.’ The Football Supporters’ Association, meanwhile, said: ‘We believe football is at its finest when bringing people together at times of huge national significance – be those moments of joy or moments of mourning. ‘Our view, which we shared with the football authorities, is that most supporters would have liked to go to games this weekend and pay their respects to the Queen alongside their fellow fans.’ More to follow… MORE : Tyson Fury vs Anthony Joshua talks put on hold ‘out of respect’ for the Queen MORE : Minute’s silence for the Queen booed and jeered during Arsenal’s clash with FC Zurich For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 16:33:04","image_url":"https://metro.co.uk/wp-content/uploads/2022/09/GettyImages-1414635998.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Cricket-Boucher to step down as South Africa coach after T20 World Cup","link":"https://www.thestar.com.my/sport/cricket/2022/09/13/cricket-boucher-to-step-down-as-south-africa-coach-after-t20-world-cup","keywords":null,"creator":null,"video_url":null,"description":"LONDON (Reuters) -South Africa coach Mark Boucher will leave his post after the Twenty20 World Cup in Australia later this year to pursue \"other opportunities in line with his future career and personal objectives\", officials said on Monday. Read full story","content":null,"pubDate":"2022-09-12 16:33:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/09/13/1735007.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Which sporting events have been cancelled following the Queen’s death?","link":"https://metro.co.uk/2022/09/12/which-sporting-events-have-been-cancelled-following-the-queens-death-17354323/","keywords":["Sport","Boxing","Cricket","Cycling","Football","Golf","Premier League","Queen Elizabeth II","Rugby Football Union"],"creator":["Harry Thomas-Humphreys"],"video_url":null,"description":"Sport paid its respects to Her Majesty The Queen.","content":"Cricket paid its respects to The Queen at the Oval (Picture: Clive Rose/Getty) A host of sporting events and fixtures were cancelled following the death of Her Majesty Queen Elizabeth II on Thursday, September 8. Guidance issued by the Government had stated there was ‘no obligation to cancel or postpone events and sporting fixtures’, with decisions made ‘at the discretion of individual organisations.’ However, sports bodies from around the country decided to postpone the action to pay respect to the monarch, who reigned on the throne for over 70 years. Here are all the sporting events that have been cancelled or postponedfollowing the passing of Her Majesty. Football All Premier League, English Football League and Women’s Super League fixtures were postponed over the weekend. The Scottish FA also cancelled football north of the border, with Welsh FA and Northern Irish FA following suit. And controversially, all grassroot football across the country was also halted. It is believed the Premier League decided to postpone last weekend’s fixtures over fears of crowd dissent during tributes to Her Majesty. This weekend’s London fixtures are at risk of postponement given the unprecedented strain expected on the police, with the capital expecting record breaking crowds in the build up to the Queen’s funeral on September 19. Fixtures in London could be postponed this weekend given the huge strain on police resources (Picture: Visionhaus/Getty) Cricket The second day of the third England vs South Africa test match at the Oval was cancelled on Friday, September 9. Queen Elizabeth II dead: Latest updates Queen Elizabeth dead at the age of 96 after 70-year rule of UK What happens next following the death of the Queen? Was the Queen the longest serving monarch in the world? RIP Ma'am: Your heartfelt messages to her Majesty The Queen Nationwide minute's silence for The Queen at 8pm on Sunday Follow Metro.co.uk's live blog for the latest updates, and sign Metro.co.uk's book of condolence to Her Majesty here. The hope was that the test match would resume on the Saturday with day two, but the tourists raised objections to this, citing logistical and fixture issues. The test match resumed on Saturday as day three of five. Golf The BMW PGA Championship saw play suspended on Thursday, September 8, and no play took place at all on Friday, but the competition resumed as a 54-hole event from Saturday. Horse racing The last day of the St Leger meeting at Doncaster was moved to Sunday, September 11. The British Horseracing Authority decided to cancel all of Saturday’s (September 10) meetings, while Musselburgh races on Sunday were cancelled as the Queen’s body was lying in rest at Holyroodhouse in Edinburgh. Racing at Southwell and Chelmsford on Thursday evening was cancelled in the immediete aftermath of the announcement. Jockeys took a moment to remember the late Queen at Doncaster Racecourse (Picture: Eddie Keogh/Getty Images) Rugby Union Friday night’s opening fixtures of the Premiership were cancelled on September 9. Sale’s home match with Northampton was moved to the Sunday, while Bath’s short trip to Ashton Gate to take on Bristol was moved to Saturday. The Scottish Rugby Union postponed all domestic matches over the weekend and the women’s test match between Scotland and Spain was abandoned on Sunday, September 11. Boxing The World middleweight title fight between Savannah Marshall and Claressa Shields, which was set to take place in London over the weekend, has been moved back to October 15. More: Queen Elizabeth IIWoman arrested after holding 'abolish monarchy' sign in EdinburghChippy owner egged for celebrating Queen's death has now had her windows smashedQueen's beloved corgis to be cared for by Prince Andrew Cycling Friday’s stage of the Tour of Britain was immediately cancelled when the news was announced, with the whole of the Tour called off later on Thursday evening. The race had been due to end on the Isle of Wight on Sunday, with Gonzalo Serrano declared victorious based on the general classification standings. MORE : Premier League consider swapping venues for next weekend’s matches MORE : England’s cricketers belt out historic rendition of God Save the King Follow Metro across our social channels, on Facebook, Twitter and Instagram Share your views in the comments below","pubDate":"2022-09-12 16:32:33","image_url":"https://metro.co.uk/wp-content/uploads/2022/09/GettyImages-1422448466.jpg?quality=90&strip=all","source_id":"metro","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"‘It’s a very high ceiling’: Ben Stokes talks up ‘scary’ potential of England side - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIyL3NlcC8xMi9iZW4tc3Rva2VzLWl0cy1zY2FyeS10by10aGluay1ob3ctZmFyLXdlLWNhbi10YWtlLXRoaXMtc2lkZS1pdHMtYS1oaWdoLWNlaWxpbmfSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘It’s a very high ceiling’: Ben Stokes talks up ‘scary’ potential of England side  The GuardianNine Wicket Win | Highlights - England v South Africa Day 5 | 3rd LV= Insurance Test 2022  England & Wales Cricket BoardEngland v South Africa: Broad, Stokes, Robinson & Anderson set up victory push  BBCEngland wrap up series and successful summer with win over South Africa  The GuardianEng Close In On Victory | Highlights - England v South Africa Day 4 | 3rd LV= Insurance Test 2022  England & Wales Cricket BoardView Full coverage on Google News","content":null,"pubDate":"2022-09-12 16:26:00","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Asia Cup 2022: Sri Lanka's fairytale triumph could act as a healing balm to crisis-stricken people back home","link":"https://www.firstpost.com/firstcricket/sports-news/asia-cup-2022-sri-lankas-fairytale-triumph-could-act-as-a-healing-balm-to-crisis-stricken-people-back-home-11239131.html","keywords":["First Cricket News"],"creator":["Amit Banerjee"],"video_url":null,"description":"Asia Cup 2022: Sri Lanka's fairytale triumph could act as a healing balm to crisis-stricken people back home","content":"It was only fitting for one of the most exciting multi-nation tournaments in recent memory that the team that was comprehensively outplayed in its very first game would finish as the victors in the final.The last two weeks witnessed the Sri Lankan team, which had been competitive in recent fixtures but still weren’t counted among the title favourites, begin their campaign with a resounding eight-wicket loss at the hands of a spirited Afghanistan side. And after losing their fourth wicket for just 77 runs while chasing a steep 183 to win in the subsequent Group B clash against Bangladesh, the Sri Lankan board would’ve begun booking their return tickets to Colombo.Read: From underdogs to champions, what worked for Sri LankaWicketkeeper-batter Kusal Mendis though, had other plans and together with the rest of the middle and lower order, marked the beginning of what was to be one of the most triumphant comebacks the game has witnessed in a long time.This one is for you Sri Lanka!. Thank you for your endless love and support. ❤❤ https://t.co/BWF3ooO7gq— Bhanuka Rajapaksa (@BhanukaRajapak3) September 11, 2022Sri Lanka defeated Bangladesh by two wickets in a nail-biter and would just not look back since then, collecting a hat-trick of wins in the Super 4 stage before dishing out a clinical performance in the final against Pakistan to win their first major multi-nation tournament in eight years.***In an interview with IBN7 during the launch of his autobiography Controversially Yours, former Pakistan speedster Shoaib Akhtar was quizzed about the 2011 World Cup semi-final against India in Mohali by anchor Ashutosh. “Hume zyada zaroorat thi (We needed it more)” Akhtar said in the interview, emphasising on how Pakistan needed the victory more badly than India in that iconic game in front of a sold out PCA Stadium.And the reason he offered for his analysis was the dire situation back home — breakdown in governance, dealing with the effects of terrorism, corruption, among a host of other factors. The ‘Rawalpindi Express’ felt a victory would’ve united a nation in a state of crisis like no other.Sport after all, does act as a great unifier, helping bring people from across cultures, faiths and geographical divides closer. Even in the worst of times, people do look up to sport as an escape from their harsh reality.More than a decade since that interview, which took place shortly after his retirement from the sport, Akhtar’s words ring true, albeit for a different team. Ironically, it was Pakistan that ended up unintentionally providing that healing touch to the Sri Lankan team through a series of dropped catches, some wayward bowling in the death overs and their slow approach with the bat in the summit clash in Dubai on Sunday.***It’s not just in the world of cricket where Sri Lanka had been lagging; the country has been going an prolonged economic and political crisis for months now, arguably among the worst the world has seen in years. From the nation running out on fuel, power and other essential supplies and barely having enough funds to keep its population on their feet to angry citizens storming the Presidential palace and forcing a comprehensive change in the government, life sure has been quite grim for the average Sri Lankan.Former cricketers such as Roshan Mahanama too have had to step in to help the needy and was seen selling tea and buns in the streets of Colombo while others such as Sanath Jayasuriya joined protests against ex-President Gotabaya Rajapaksa. And things eventually got so dire in the island nation that Sri Lanka Cricket (SLC) were forced to stage the tournament in the cricketing haven that is the United Arab Emirates (UAE).Major economic crisis. Soaring Inflation. Tax Hikes. Mountain of Debt. Mass Protests. The last 2 yrs have been horrendous for #SriLanka who couldn’t even host the #AsiaCup but they’ve won it in style and hopefully just for a fleeting moment or two the island nation will smile 🙌— Anant Tyagi (@anantyagi_) September 11, 2022Perhaps Sri Lanka did need this win more than anyone else, or at least that’s what the Lankan supporters will very strongly feel. And for a nation that was counted among the powerhouses right from the late 1990s to the early 2010s, the steep fall post-2015 would’ve been quite the bitter pill to swallow. Especially the way they would routinely get outplayed by the Indians, both at home and away, and at times even struggled to compete against teams such as Zimbabwe.There was the occasional flash of brilliance, as was the case in the iconic Test series in South Africa in 2019, but the team simply couldn’t recreate the magic that the side of the old would on a regular basis.So to see a team that was completely bereft of star power in their ranks, as one Bangladesh team official so eloquently put during the group stage of the tournament, function like a well-oiled machine match after match would’ve brought a tear of joy in the eyes of both former cricketers as well as the fans at the venue and back home. The team might not have superstars yet, though the likes of Wanindu Hasaranga are well on their way towards becoming one eventually, but possessed the ingredients vital to the recipe for success — hunger and passion.Finally!🇱🇰💪🏻 pic.twitter.com/BPBs14WyP5— Saros Ibnu Uwais (@ImSaros) September 11, 2022And who knows, this victory could very well have the same effect on Sri Lankan cricket as the 1996 World Cup victory did on the previous generation, and the 1983 World Cup did on Indian cricket. For once, skipper Dasun Shanaka and coach Chris Silverwood possess a side that believes in itself and refuses to give up until the very end.At the very least, Sri Lanka will count among the title contenders for the T20 World Cup that takes place in Australia starting next month. And until then, Shanaka and Co will have done enough to ensure ordinary Sri Lankans have something to smile about in their everyday life.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 16:21:40","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Sri-Lanka-Asia-Cup-victory-AP-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"How England's 'back to basics' approach paid off in extraordinary summer that changed cricket forever","link":"https://uk.sports.yahoo.com/news/englands-back-basics-approach-paid-141720591.html?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-09-12 16:17:31","image_url":null,"source_id":"yahoo","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Sri Lanka’s ousted president Rajapaksa returns to social media to laud victorious cricket team","link":"https://indianexpress.com/article/sports/cricket/sri-lankas-ousted-president-rajapaksa-returns-to-social-media-to-laud-victorious-cricket-team-8147080/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-09-12 15:51:17","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Stokes Vows No Let-up In Team's Attacking Approach After Series Win vs SA","link":"https://sports.ndtv.com/cricket/england-vs-south-africa-ben-stokes-vows-no-let-up-in-englands-attacking-approach-after-series-win-against-south-africa-3338597","keywords":null,"creator":null,"video_url":null,"description":"Ben Stokes vowed England would keep up their bold approach to Test cricket under coach Brendon McCullum after wrapping up a 2-1 series win over South Africa at the Oval on Monday.","content":"Ben Stokes vowed England would keep up their bold approach to Test cricket under coach Brendon McCullum after wrapping up a 2-1 series win over South Africa at the Oval on Monday. The match was shortened to three days after the first day was washed out and the second scrapped following the death of Queen Elizabeth II. But England still needed less than half an hour to seal victory by nine wickets in front of a sparse crowd in London. \"This game here, with it being shortened, our main aim was it ending in a result,\" England captain Stokes told Sky Sports. \"We felt we owed it to ourselves, we owed it to the nation who have shown their support throughout this whole summer towards us and we will always continue to play in a way that we feel is going to entertain people and always look for the positive side of cricket.\" Victory rounded off a stunning summer for England with the red ball. They swept the series against world Test champions New Zealand 3-0 and beat India in a Test postponed from last year after a coronavirus outbreak. An attack-minded approach has underlined all those wins. \"Me and Brendon are the guys who are sending this message to this group of players,\" said Stokes. \"I said to the lads in the dressing room the other day that the person who is delivering the message can only do so much. But I thanked all my team, my backroom staff and my coaches that they have all bought into this. Promoted \"There is a reason why we have gone out and been able to perform and have the confidence in each other to go and do that. That is something that is very rare and something that you don't see that often.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","pubDate":"2022-09-12 15:47:30","image_url":"https://c.ndtvimg.com/2022-08/rp07chog_ben-stokes-afp-_625x300_28_August_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"T20WC | “Dream Come True” – Dinesh Karthik Resilience Recording","link":"https://thenewsglory.com/t20wc-dream-come-true-dinesh-karthik-resilience-recording/","keywords":["Sports","Dinesh Kardithak","Dinesh Karthik","india team","Indian team","Rohit Sharma","T20 World Cup.","T20I World Cup"],"creator":["The News Glory"],"video_url":null,"description":"Tamil Nadu player Dinesh Karthik has been included in the Indian team for the T20 World Cup. With this, his dream has come true, he has expressed on Twitter. The T20 World Cup tournament will be held in Australia from October 16 to November 13. BCCI has announced the names of Indian team players who […]","content":"Tamil Nadu player Dinesh Karthik has been included in the Indian team for the T20 World Cup. With this, his dream has come true, he has expressed on Twitter. The T20 World Cup tournament will be held in Australia from October 16 to November 13. BCCI has announced the names of Indian team players who will play in this. Accordingly, KL Rahul has been announced as the vice-captain in the Indian team led by Rohit Sharma. Jadeja, who was ruled out of the Asia Cup series due to injury, was not included in the squad. Akshar Patel has replaced him in the team. Jasprit Bumrah, who was rested for the Asia Cup series, has returned to the team. The Indian team includes Tamil Nadu players Dinesh Karthik and Ravichandran Ashwin. Mohammed Shami, Shreyas Iyer, Ravi Bishnoi and Deepak Sahar have been announced as substitutes. The absence of Sanju Samson and Muhammad Shami in the team has caused dissatisfaction among the fans. In this case, wicketkeeper-batsman Dinesh Karthik expressed his happiness about being included in the Indian team for the T20 World Cup and posted on his Twitter page, ‘Dream come true’. It is noteworthy that Dinesh Karthik often spoke of his ‘dream’ to play for the Indian team in the T20 World Cup during the IPL series. Lately, DK has been hailed as the comeback man in the world of cricket. Dinesh Karthik got an opportunity to play in the Indian team after almost three years with his impressive finishing skills in the ongoing IPL season. From Ganguly to Dravid, Kumble, Dhoni, Kohli, Rohit and now KL Rahul, Dinesh Karthik has a long history of playing under many captains. Trapped among the star players, it was a big challenge for him to get a regular place in the Indian team. However, he did not give up and kept trying for a chance to play in the team. For that he proved his ability wherever he got a chance to play. He did not differentiate between local cricket and world cricket. He has played in various batting orders. Now, DK is reaping the rewards of his perseverance.\r","pubDate":"2022-09-12 15:29:05","image_url":null,"source_id":"thenewsglory","country":["india"],"category":["sports"],"language":"english"},{"title":"‘They have no idea about what is happening inside the dressing room’: Saqlain Mushtaq hits back at Akhtar and Gambhir","link":"https://www.firstpost.com/firstcricket/sports-news/they-have-no-idea-about-what-is-happening-inside-the-dressing-room-saqlain-mushtaq-hits-back-at-akhtar-and-gambhir-11238671.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"‘They have no idea about what is happening inside the dressing room’: Saqlain Mushtaq hits back at Akhtar and Gambhir","content":"Pakistan head coach Saqlain Mushtaq hit back at Shoaib Akhtar and Gautam Gambhir’s comments after his side’s loss to Sri Lanka in the Asia Cup final against Sri Lanka on Sunday.Mushtaq said that it is easy for people sitting out of the dressing room to comment, without knowing what is going on inside or what a player is feeling.“Unki soch hai. Jo bahar log baithe hote hai na, wo bahir se cheezon ko dekhte hai aur uske upar baat kar dete hai (Easy to comment from outside, one gets to know only when they are part of the team), Mushtaq said after being asked about former cricketers’ comments on Mohammad Rizwan.Read: From underdogs to champions, what worked for Sri LankaGautam Gambhir while doing commentary for Star Sports, had questioned Rizwan’s batting approach and criticised his innings in the final.Akhtar as well took to Twitter and criticised Pakistan’s lack of urgency with the bat. He said that Rizwan’s run-a-ball 50 would not benefit Pakistan.This combination is not working. Pakistan has to look into a lot of things. Fakhar, Iftikhar, Khushdil all need to be looked into. And Rizwan, 50 off 50 is not going to work anymore. Doesn’t benefit Pakistan. Hats off to Sri Lanka. What a teamFull video: https://t.co/rYk3d01K65— Shoaib Akhtar (@shoaib100mph) September 11, 2022Rizwan scored 55 runs off 49 deliveries at a strike rate of 112.24 while his side were chasing a target of 171. Pakistan eventually lost the match by 23 runs.“It’s not their mistake. They saw the result, and scorecard and made their comments. They have no idea about what is happening inside the dressing room, what the players feel about their confidence and the injuries they are carrying,” Mushtaq added.Mushtaq also talked about the time he worked as an expert. “I have worked as an expert for three years. So, I know how things worked. Once they work closely with the cricketers from inside only then they will get to know about the team bonding, the environment.”Watch: Shadab Khan Asif Ali collide, drop a catch to concede sixHe further heaped praise on Asif Ali and Shadab Khan, who got injured during the match but still went out to bat.“Asif ke haath mey chaar taanke lage hue hai. Shadab ke kaan me se khoon nikal raha, usko concussion ka tha fir bhi batting karne ke liye gaya (Asif played with four stitches in his hand. Shadab’s ear was bleeding, he was asked for a concussion after the collision and despite all of this he went to bat),” said Mushtaq.Read: How Pakistan’s batting approach at top backfired in tournament and cost them the titleThe head coach didn’t hesitate to praise Rajapaksa’s innings either. Rajapaksa scored a brilliant 71 off 45 deliveries after the Sri Lankans had lost five wickets for a poultry 58 runs.“I’ll credit the Sri Lankans. We’d broken their backbone in the first nine overs, but the way Rajapaksa played, and the others rallied around him, no praise is enough. I’m sure it should be the best innings of his life. The way he lifted them, hats off,” said Saqlain on the Asia Cup winners.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 14:50:28","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Saqlain-Mushtaq.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: PCB chief Ramiz Raja snatches Indian reporter's phone after Pakistan's Asia Cup defeat","link":"https://www.firstpost.com/sports/watch-pcb-chief-ramiz-raja-snatches-indian-reporters-phone-after-pakistans-asia-cup-defeat-11238661.html","keywords":["Sports"],"creator":["FP Trending"],"video_url":null,"description":"Watch: PCB chief Ramiz Raja snatches Indian reporter's phone after Pakistan's Asia Cup defeat","content":"Pakistan headed to the Dubai International Stadium to play the Asia Cup final as a better side even after enduring defeat against Sri Lanka in the Super 4 round. However, Sri Lanka came out all guns blazing and outplayed Pakistan in each department to take the title home. After the thumping loss, a lot of former and active players took a dig at the below-par performance by Pakistani cricketers. But, chairman of the Pakistan Cricket Board (PCB), Ramiz Raja appreciated the players for coming a long way, close to the title.On Sunday night, while leaving the stadium, Raja was seen answering the queries of a few journalists. Among them, there was an Indian reporter who urged Raja to deliver a message to the Pakistan fans who had been struggling to digest the defeat in the summit game. However, the reporter was not quite prepared for the response.क्या मेरा सवाल ग़लत था – क्या पाकिस्तान के फ़ैन नाखुश नहीं है – ये बहुत ग़लत था एक बोर्ड के चेयरमैन के रूप में – आपको मेरा फ़ोन नहीं छीनना चाहिये था – that’s not right Mr Chairman Taking my phone was not right @TheRealPCB @iramizraja #PAKvSL #SLvsPAK pic.twitter.com/tzio5cJvbG— रोहित जुगलान Rohit Juglan (@rohitjuglan) September 11, 2022In reply, the PCB chairman got incensed by the question and went on to ask if the guy was from India. After coming to learn that the journalist was actually from the nation who are their biggest rival on the cricket field, refused to say anything in reply. While walking off the place immediately, the former cricketer snatched the phone of the Indian journalist and asked him to stop the recording. However, in some moments, Raja was spotted discussing Pakistan skipper Babar Azam’s performance with another reporter.The journalist, identified as Rohit Juglan, later shared a clip of the occurrence on his Twitter handle. He threw some questions in the caption, “Did I ask anything wrong? Aren’t Pakistani fans dejected?” and then noted, pointing out at Raja, “This is not expected from you, Mr Chairman. You should not snatch my phone.”As soon as the video went viral, it started to gather fuming reactions from Indian fans. Since being shared, it has received nearly 1.5 lakh views on Twitter. The PCB Chairman got brutally slammed by the viewers for his gesture.A person said, “He should stick to Youtube. He is not able to handle the pressure.”https://twitter.com/jharajiv49/status/1569042314714304512The behaviour seemed totally “wrong” to a user.https://twitter.com/pratik2541/status/1569042511846592512Another one wrote, “Sad to see this.”https://twitter.com/CricCrazyJohns/status/1569042566305447937An Indian highlighted the calmness of BCCI president Sourav Ganguly.https://twitter.com/SPratik12/status/1569042730608893957Pakistan cricketers have been earning a lot of criticism for their disappointing show in the final. Former Pakistan pacer Shoaib Akhtar went on to blame the batting lineup for the failure. Another legend of the country, Wasim Akram asked the batters to show more urgency and accelerate the innings a bit early while playing 20-over cricket.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-09-12 14:43:00","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/09/Rameez-Raja-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Yuvraj \"Having Fun With Two Legendary Singers\" Pathan, Raina","link":"https://sports.ndtv.com/cricket/yuvraj-singh-having-fun-with-two-legendary-singers-irfan-pathan-suresh-raina-watch-3338284","keywords":null,"creator":null,"video_url":null,"description":"Yuvraj Singh is gearing up for the Road Safety World Series along with other cricket greats","content":"Yuvraj Singh knows how to have fun. The hero of India's 2011 World Cup and 2007 World T20 triumphs is currently gearing up for the Road Safety World Series. On Monday, Yuvraj posted a video of a get-together with his former teammates, all of whom will be playing in the cricket tournament. Yuvraj Singh could be seen dancing and even enjoying the singing of Irfan Pathan and Suresh Raina . \"Having fun with two legendary singers @IrfanPathan @ImRaina and of course the legend of legends @sachin_rt @munafpa99881129 @ManpreetGony @pragyanojha #roadsafetyworldseries #indialegends,\" he tweeted. Having fun with two legendary singers @IrfanPathan @ImRaina and of course the legend of legends @sachin_rt @munafpa99881129 @ManpreetGony @pragyanojha #roadsafetyworldseries #indialegends pic.twitter.com/wjP31UcYVZ The second season of the Road Safety World Series was recently announced. The season will see legends from Indian cricket like Tendulkar, Yuvraj, Irfan, Yusuf Pathan , Harbhajan Singh and other in action. The tournament will take place in four cities: Kanpur, Indore, Dehradun, and Raipur. September will mark the beginning of the second season, while October will mark the start of the final leg of the tournament. The tournament kicks off on September 10 in Kanpur where India Legends take on South African legends. India, New Zealand, Australia, Sri Lanka, West Indies, South Africa, Bangladesh, and England will be among the teams playing. In addition to the two semifinals and the summit clash, there will also be a third-place playoff. Indian cricket great Sachin Tendulkar will lead defending champions India Legends in the second edition of the Road Safety World Series (RSWS). Kanpur will host the opener and Raipur will host the two semi-finals and final. Promoted The India Legend team includes the stylish and dynamic left-hander Yuvraj Singh who has played critical knocks to take India to victory. The team will also include legends like Irfan Pathan, Yusuf Pathan, Harbhajan Singh, Munaf Patel , Stuart Binny , S Badrinath, Naman Ojha as a wicketkeeper, Manpreet Gony , Pragyan Ojha , Vinay Kumar , Abhimanyu Mithun , Rajesh Pawar and Rahul Sharma. With ANI inputs","pubDate":"2022-09-12 14:28:59","image_url":"https://c.ndtvimg.com/2022-09/t6s6reao_yuvraj-singh_120x90_12_September_22.jpg","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"}]}