{"newsArray":[{"title":"IND-W vs SL-W Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s IND-W vs SL-W 1st ODI at Pallekele International Stadium, Pallekele, 10 AM IST July 1","link":"https://zeenews.india.com/cricket/ind-w-vs-sl-w-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-ind-w-vs-sl-w-1st-odi-at-pallekele-international-stadium-pallekele-10-am-ist-july-1-2480113.html","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka Women vs India Women Dream11 Team Prediction Sri Lanka Women vs India Women 1st ODI - Check My Dream11 Team, Best players list of SL-W vs IND-W, Sri Lanka Women Dream11 Team Player List, India Women Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-07-01 02:16:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND-W vs SL-W 1st ODI LIVE Streaming Details: When and Where to watch India Women vs Sri Lanka Women LIVE in India","link":"https://zeenews.india.com/cricket/ind-w-vs-sl-w-1st-odi-live-streaming-details-when-and-where-to-watch-india-women-vs-sri-lanka-women-live-in-india-2480106.html","keywords":null,"creator":null,"video_url":null,"description":"IND-W vs SL-W 1st ODI LIVE Streaming Details: Check When and Where to watch Harmanpreet Kaur’s Team India vs Sri Lanka Women Cricket Match LIVE.","content":"Starting a new era in 50-over cricket without the peerless Mithali Raj, the newly-appointed skipper Harmanpreet Kaur will seek an improved performance across departments from his players as Indian women eye a winning start against hosts Sri Lanka in a three-match series, starting Friday (July 1). India will be without their two pillars – Mithali, who retired from cricket earlier this month, and Jhulan Goswami, who is nursing a side strain. The absence of international cricket's most prolific duo is just one of several concerns for captain Kaur ahead of the ODI series opener. The Indians made a positive start to the tour of the island nation by winning the T20I series 2-1 but their performance was far from perfect and while the format will change, the regulars in the side would be keen to put up a dominant display against the lowly-ranked (ninth) Sri Lanka. “It is new journey for me also,” Kaur, who was handed the ODI captaincy after Mithali retired, said at the pre-match press conference. “My main motive is to improve our fitness and fielding. These are the two areas where I personally want the team to do well in,” she added. All set for the #SLvIND WODI series starting tomorrow. #TeamIndia pic.twitter.com/ATcjJbZi7h — BCCI Women (@BCCIWomen) June 30, 2022 The batters struggled on the slow track at Dambulla , unable to breach the 140-run mark in all three T20Is and the likes of Smriti Mandhana and Shafali Verma would hope for a better and consistent show in the 50-over format. The last time India played a 50 over match was during the World Cup in March, when the failed to qualify for the semi-finals. The Indian batting unit has failed to fire as a group back then and would be eager to rectify its weaknesses. Kaur herself has been in good touch. After finishing as the highest run-getter for her side in the T20 series, it will auger well for India if the skipper can continue her top form alongside all-rounder Pooja Vastrakar. Match Details When will the India women vs Sri Lanka women 1st ODI match be played? The India women vs Sri Lanka women 1st ODI match will be played on July 1. Where will the India women vs Sri Lanka women 1st ODI match be played? The India women vs Sri Lanka women 1st ODI match will be played in Pallekele International Cricket Stadium. What time will the India women vs Sri Lanka women 1st ODI match start? The India women vs Sri Lanka women 1st ODI match will start at 10 AM IST. How can I watch the India women vs Sri Lanka women 1st ODI match? The India women vs Sri Lanka women 1st ODI match will not be available on TV channels. How can I follow the live streaming of the India women vs Sri Lanka women 1st ODI match? The India women vs Sri Lanka women 1st ODI match will be streamed live on Fancode.","pubDate":"2022-07-01 01:15:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Five best players scoop up contracts in both formats","link":"https://www.thenews.com.pk/print/970547-five-best-players-scoop-up-contracts-in-both-formats","keywords":null,"creator":null,"video_url":null,"description":"ISLAMABAD: Country’s leading five cricketers who proved their versatility in all the three formats scooped up retainerships for both red and white ball cricket for the year 2022-2023.Chief selector Muhammad Wasim announced Players Central Contracts at the Pindi Stadium Thursday revealing...","content":null,"pubDate":"2022-07-01 01:00:00","image_url":null,"source_id":"thenews","country":["pakistan"],"category":["sports"],"language":"english"},{"title":"Hoodoo strikes Aussie Test gun once again","link":"https://wwos.nine.com.au/cricket/australian-tour-of-sri-lanka-cameron-green-falls-short-of-century-but-plays-vital-knock/d3fe0f41-1d4d-46f6-8f21-2c0b620127c0","keywords":null,"creator":["wwos"],"video_url":null,"description":"Cameron Green has played another key innings for Australia - but was again dismissed before reaching triple figures.","content":"Cameron Green has played another key innings for Australia as they look to build a first innings lead against Sri Lanka - but was again dismissed before reaching triple figures on day two of the first Test . That elusive maiden test ton continues to evade the young all-rounder, as he was trapped LBW on 77 to spinner Ramesh Mendis. The 23-year-old quickly reviewed the decision, but the video review system couldn't save him. READ MORE: Rafa reveals how close he was to retiring READ MORE: Manly legend stunned at five-minute Storm onslaught READ MORE: Demon's beautiful gesture after big win READ MORE: Proteas gun first to nominate for BBL draft It's now the fifth time in his young Test career that Green has been dismissed with a century in sight. He was caught for 84 against India at the SCG at the start of last year, before consecutive scores of 74 in Sydney and Hobart in The Ashes at the start of this year, and was bowled for 79 in Lahore against Pakistan. The common denominator in all of these cases was how important a knock they turned out to be. Aside from that first instance against India, all of these turned out to be key contributions - including in Galle, with Australia reeling at 4-100 when Green came to the crease. The Bulls combination of Green and Khawaja steered Australia past 150, before the latter was dismissed for 71. Valuable knocks from Alex Carey and Pat Cummins followed, the skipper hitting one of the biggest sixes you'll ever see in Test cricket. Fans were left bemused when, immediately following that shot, play was stopped for bad light. Australia left the field with at 8-313, with a lead of 101 runs after two days' of play. We're likely to see more swashbuckling from Cummins and Nathan Lyon on day three, before Sri Lanka will bat again to try and save the Test. For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here !","pubDate":"2022-06-30 22:47:59","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2022/06/439372/pickerimage.jpg","source_id":"nine","country":["australia"],"category":["sports"],"language":"english"},{"title":"Edgbaston Birmingham weather today: Edgbaston weather forecast IND vs ENG Day 1 Birmingham Test","link":"https://thesportsrush.com/cricket-news-edgbaston-birmingham-weather-today-edgbaston-weather-forecast-ind-vs-eng-day-1-birmingham-test/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Edgbaston Birmingham weather today: The SportsRush presents before you the weather prediction for the fifth ENG vs IND Test Day 1. The fifth Test match of India’s tour of England 2021 will be played as part of a rescheduled fixture to mark the start of India’s tour of England 2022. Other than a one-off Test,… The post Edgbaston Birmingham weather today: Edgbaston weather forecast IND vs ENG Day 1 Birmingham Test appeared first on The SportsRush.","content":"Edgbaston Birmingham weather today: The SportsRush presents before you the weather prediction for the fifth ENG vs IND Test Day 1. The fifth Test match of India’s tour of England 2021 will be played as part of a rescheduled fixture to mark the start of India’s tour of England 2022. Other than a one-off Test, India will also be playing three T20Is and as many ODIs within a 17-day period on this tour. Currently leading 2-1 in the series with a match to be played, a maiden Test victory in Birmingham under a brand new captain will register India’s fourth Test series victory in England. While even a draw will hand the Pataudi Trophy to India, an Indian loss will see the series ending in a 2-2 draw. COVID-19 has played a role even before the start of the match ruling out England wicket-keeper batter Ben Foakes and India captain Rohit Sharma of the match. While England named their Playing XI on the eve of the match, India will do the same at the toss time now. Both sides will finish the series with a different captain and coach! #ENGvIND pic.twitter.com/7pDLSdR8dW — ESPNcricinfo (@ESPNcricinfo) June 30, 2022 There’s nothing novel in a rain disturbance during a Test match being in played in England. Even the last day of Test cricket in this country had witnessed the loss of a session due to rain. Therefore, it shouldn’t be a surprise if rain gods opt to make their presence felt at Edgbaston on Friday. The weather forecast for the day also hints at rain playing spoilsport at least once during the match hours today. According to AccuWeather, there’s a maximum of 51% rain probability in Birmingham at the time of match hours. While this number is expected to be in the afternoon session, rain probability on either side of this period will remain in excess of 30% barring the last hour of day’s play. Otherwise, Friday will mostly be a cool and pleasant day in the city. 11:00 AM – 16 degree (Rain Probability – 36%). 12:00 PM – 31 degree (Rain Probability – 37%). 01:00 PM – 19 degree (Rain Probability – 30%). 02:00 PM – 18 degree (Rain Probability – 36%). 03:00 PM – 30 degree (Rain Probability – 51%). 04:00 PM – 17 degree (Rain Probability – 47%). 05:00 PM – 16 degree (Rain Probability – 40%). 06:00 PM – 15 degree (Rain Probability – 34%). 07:00 PM – 16 degree (Rain Probability – 23%).","pubDate":"2022-06-30 19:45:28","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"India, Pakistan cricketers may line up together under Afro-Asia Cup revival plan","link":"https://kashmirreader.com/2022/07/01/india-pakistan-cricketers-may-line-up-together-under-afro-asia-cup-revival-plan/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"NEW DELHI: India’s Virat Kohli could line up beside Pakistan skipper Babar Azam in the same team next year with the Asian Cricket Council (ACC) planning to revive the Afro-Asia Cup. The 50-overs series was first played in 2005 before being discontinued after its next edition in 2007 as relations between India and Pakistan soured. […]","content":"NEW DELHI: India’s Virat Kohli could line up beside Pakistan skipper Babar Azam in the same team next year with the Asian Cricket Council (ACC) planning to revive the Afro-Asia Cup. The 50-overs series was first played in 2005 before being discontinued after its next edition in 2007 as relations between India and Pakistan soured. Former Sri Lanka captain Mahela Jayawardene led an Asia XI that also included players from India, Pakistan and Bangladesh in the last edition, beating an Africa side comprising cricketers from South Africa, Zimbabwe and Kenya 3-0. India and Pakistan have suspended bilateral cricket and their players do not take part in the other country’s T20 leagues, but the arch-rivals still draw massive crowds whenever they face each other at global tournaments. ACC President Jay Shah, also the secretary of the BCCI, told Reuters the Cup’s return may get rubber-stamped at an ACC meeting next month. “We have gone through some proposals on this subject,” he said. “It is a premium tournament which will not only generate revenue but also help develop cricket in Africa. We are currently working on the legal aspects.” The ACC will look to identify a venue for the competition on the sidelines of the International Cricket Council’s annual general meeting in Birmingham, where it will also seek to ratify its development programmes for junior and women’s cricket. “These will be tabled during our meeting where these measures will be ratified and put into action,” Shah added. —Agencies KR Desk","pubDate":"2022-06-30 19:41:46","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Cherish my role in Indian Test side: Shardul Thakur","link":"https://kashmirreader.com/2022/07/01/cherish-my-role-in-indian-test-side-shardul-thakur/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"BIRMINGHAM: Fast bowler Shardul Thakur cherishes his role in the Indian Test side and said his job is to make an impact when the main bowlers are on a break. Shardul, who generally bowls third or fourth in a Test match, said he loves to deliver in crunch situations. “Our pace bowling attack at the […]","content":"BIRMINGHAM: Fast bowler Shardul Thakur cherishes his role in the Indian Test side and said his job is to make an impact when the main bowlers are on a break. Shardul, who generally bowls third or fourth in a Test match, said he loves to deliver in crunch situations. “Our pace bowling attack at the moment, everyone is doing well including (Mohammed) Shami, (Jasprit) Bumrah, Umesh (Yadav) whenever he gets a game. Ishant (Sharma) was there and usually they start with the new ball and a lot of times it happens that they take two-three wickets in the first spell and I get an opportunity to bowl later,” Thakur told BCCI.tv. “Opportunity is created when there is partnership and the main bowlers have to be given rest and the third and fourth bowlers are used more in the spell. In that moment, there is an opportunity for me to take a wicket and do something for the team. “I think it is my job to bowl in those situations and I like it because if I deliver with a good performance it creates an impact in the game,” added the Palghar-based right-arm pacer, who played a pivotal role in India’s 157-run win over England in the fourth Test at Oval. Thakur is a member of the Indian squad that will play England in the rescheduled fifth Test beginning here on Friday. For the 28-year-old Siraj, who is gearing up for the rescheduled fifth Test against England, starting Friday at the Edgbaston Cricket Ground, the memories of that historic Australian triumph are still fresh. The Indian pacer now wants to lift another trophy, in England, this time. The 30-year-old said he loves bowling in English conditions. “I think England is a bowler’s paradise, they say because the ball swings a lot and at times you end up taking a lot of wickets in one spell itself. So, I think England is one of my favourite places to play cricket and to bowl as well,” Thakur said. “(In) England there is lot of lateral movement and off the pitch moment, it is up to you how to you want to make use of that.” Thakur, who is no mean with the bat, played a key role in the fourth Test at the Oval, slamming two crucial half-centuries and also took crucial wickets in both the innings. —PTI   KR Desk","pubDate":"2022-06-30 19:41:22","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"VC’s sports festival concluded at college of temperate sericulture","link":"https://kashmirreader.com/2022/07/01/vcs-sports-festival-concluded-at-college-of-temperate-sericulture/","keywords":["SPORTS"],"creator":["KR Desk"],"video_url":null,"description":"SRINAGAR: College of Temperate Sericulture, SKUAST-K, Mirgund Thursday conducted the valedictory function of Vice Chancellor’s Sports Festival 2022. More than 100 students participated in different events including Cricket, Volleyball, Badminton, Tug of War etc. Earlier on 10th of June 2022, the festival was inaugurated by Vice Chancellor SKUAST-K Prof. Nazir Ahmad Ganai along with other […]","content":"SRINAGAR: College of Temperate Sericulture, SKUAST-K, Mirgund Thursday conducted the valedictory function of Vice Chancellor’s Sports Festival 2022. More than 100 students participated in different events including Cricket, Volleyball, Badminton, Tug of War etc. Earlier on 10th of June 2022, the festival was inaugurated by Vice Chancellor SKUAST-K Prof. Nazir Ahmad Ganai along with other officers of the University. Dean Student Welfare, SKUAST-K Prof. M. A. A. Siddqui who was the chief guest on valedictory function congratulated Assoc. Dean CoTS Mirgund and his organizing team for meticulously holding the mega event by involving all the students of the College. While handing over the trophies and certificates to the winners/runners Prof. Siddiqui emphasized the need for engaging the students in extracurricular activities for their mental wellbeing and holistic development. Associate Dean College, Prof M. F. Baqual while highlighting the importance of such events expressed his satisfaction over the successful conduct of the festival. He extended his gratitude to Honourable Vice Chancellor Prof. N. A. Ganai and Dean Student Welfare for rendering support to all the student programmes of College and requested further support from university for conduct of such activities. Dr. Nisar Ahmad Ganie (SWO) CoTS presented a brief report about the festival through power point presentation. OSD to Vice Chancellor, Professor Azmat Alam Khan and other scientists of the college were also present on the occasion. The programme ended with a vote of thanks by Dr. I. L. Khan, Warden of the College. The seven days sports festival was organized by Students Welfare wing of College in collaboration with the Dean Student Welfare SKUAST-K.   KR Desk","pubDate":"2022-06-30 19:41:06","image_url":null,"source_id":"kashmirreader","country":["india"],"category":["sports"],"language":"english"},{"title":"Jasprit Bumrah to lead India","link":"https://www.thehansindia.com/sports/cricket/jasprit-bumrah-to-lead-india-751328","keywords":["Sports,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"India right-arm pacer Jasprit Bumrah on Thursday was named by the senior selection committee to lead India in the rescheduled fifth Test against England at Edgbaston, starting from Friday, said an official release by the Board of Control for Cricket in India (BCCI).","content":"Birmingham: India right-arm pacer Jasprit Bumrah on Thursday was named by the senior selection committee to lead India in the rescheduled fifth Test against England at Edgbaston, starting from Friday, said an official release by the Board of Control for Cricket in India (BCCI). The release also said that wicketkeeper-batter Rishabh Pant will serve as Bumrah's deputy for the much-anticipated Test match. Bumrah becoming India's captain for the Edgbaston Test comes after regular skipper Rohit Sharma tested positive for Covid-19 on the second day of the warm-up match against Leicestershire last week. He had scored 25 runs in the first innings of the match but didn't come out to bat in the second innings after testing positive for Covid-19. But with Sharma still infected with Covid-19, it means that Bumrah, who was vice-captain when India last played Tests, against Sri Lanka at home in March, will be captaining the side at Edgbaston from Friday. He will now become the 36th Test captain of India, becoming the first fast bowler to be India's Test skipper since Kapil Dev led India against Pakistan at Bengaluru in March 1987, which was also legendary batter Sunil Gavaskar's final Test match. \"Mr Rohit Sharma, Captain, Indian Cricket Team is ruled out of the rescheduled fifth Test against England to be played from Friday. Rohit underwent a RAT Test on Thursday morning and returned a positive result for COVID-19. The All-India Senior Selection Committee has named Mr Jasprit Bumrah as captain for the upcoming Test and Mr Rishabh Pant as his deputy,\" said the BCCI in its official release. With Bumrah becoming the Test captain of India for Edgbaston Test, 2022 is set to be the year where the national side had six different captains across all formats, the highest for any calendar year. He also becomes the eighth man to lead India since 2021. Previously, India had played under five captains in 1959; they were Vinoo Mankad, Hemu Adhikari, Datta Gaekwad, Pankaj Roy and Gulabrai Ramchand. India currently lead the five-match series for the Pataudi Trophy 2-1, having registered famous victories at Lord's (by 151 runs) and The Oval (157 runs) last year apart from a draw in Trent Bridge and a loss by an innings and 76 runs at Headingley. A win at Edgbaston will seal the series in their favour, which will be just the fourth time the visitors won a Test series in England after 1971, 1986 and 2007. (IANS) India's Test squad: Jasprit Bumrah (Captain), Shubman Gill, Virat Kohli, Shreyas Iyer, Hanuma Vihari, Cheteshwar Pujara, Rishabh Pant (vice-captain) (wicketkeeper), KS Bharat (wicketkeeper), Ravindra Jadeja, Ravichandran Ashwin, Shardul Thakur, Mohammed Shami, Mohammed Siraj, Umesh Yadav, Prasidh Krishna and Mayank Agarwal.","pubDate":"2022-06-30 19:23:05","image_url":"https://assets.thehansindia.com/h-upload/2022/06/30/500x300_1300554-bumrah.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"‘Tumi’s innings shows we deserve to play more Test cricket,’ says Proteas’ skipper Sune Luus","link":"https://www.iol.co.za/sport/cricket/proteas-women/tumis-innings-shows-we-deserve-to-play-more-test-cricket-says-proteas-skipper-sune-luus-b49871b1-a72c-4a4f-b30a-bd0285335882","keywords":null,"creator":["Stuart Hess"],"video_url":null,"description":"Proteas captain Sune Luus hopes that the character and fight displayed by Tumi Sekhukhune on the final day of the once-off Test against England will persuade officials to include at least one Test on the Proteas schedule.","content":null,"pubDate":"2022-06-30 19:04:18","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/20d8f3c2-fcb5-5b75-bb29-2ea30ac348ef&operation=CROP&offset=0x16&resize=4284x2406","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Edgbaston Cricket Ground Records: Edgbaston Test records most runs and highest wickets in Birmingham Tests","link":"https://thesportsrush.com/cricket-news-edgbaston-cricket-ground-records-edgbaston-test-records-most-runs-and-highest-wickets-in-birmingham-tests/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Edgbaston Cricket Ground Records: Birmingham will be hosting a Test match after more than 12 months tomorrow. The fifth Test match of England vs India Test series from last year will be played in Birmingham from tomorrow. It would be a rare occasion when the last match of a series will be played after a… The post Edgbaston Cricket Ground Records: Edgbaston Test records most runs and highest wickets in Birmingham Tests appeared first on The SportsRush.","content":"Edgbaston Cricket Ground Records: Birmingham will be hosting a Test match after more than 12 months tomorrow. The fifth Test match of England vs India Test series from last year will be played in Birmingham from tomorrow. It would be a rare occasion when the last match of a series will be played after a gap of 10 months. While Playing XIs tend to change in such a time interval, both England and India’s captains and team managements have also changed on this particular occasion. The prospect of these two teams playing a one-off series-decider has it in it to transform into an intriguing five-day fixture. #Edgbaston | #ENGvIND pic.twitter.com/hZ93cM2CLn — Edgbaston (@Edgbaston) June 30, 2022 Set to host a Test match after just over a year, Edgbaston has witnessed England and India’s contrasting fortunes over the years. Hosts England have won 28 and lost 10 out of the 53 Birmingham Tests in over a century. On the contrary, India have won none and lost six out of their seven Test matches played here. While the Top 11 highest run-scorers in Edgbaston Tests are all English cricketers, the Top 5 are all former players namely Alastair Cook (869), David Gower (767), Colin Cowdrey (737), Marcus Trescothick (670) and Michael Atherton (664). A list of Top Five batters at this venue among active players is mentioned below: Highest run-scorers in Birmingham among active Indian players are Virat Kohli (200), Hardik Pandya (53), Shikhar Dhawan (39), Amit Mishra (26) and Murali Vijay (26). ALSO READ: When and where to watch England vs India 5th Test? Unlike batters, the Top Two highest wicket-takers in Test matches here are active cricketers namely James Anderson (45) and Stuart Broad (40). The senior English duo is followed by the likes of Fred Trueman (39), Ian Botham (29) and Shane Warne (25). A list of highest wicket-takers in Birmingham Tests among active cricketers are: Best active Indian bowlers in Birmingham Test matches are Ravichandran Ashwin (7), Ishant Sharma (7), Mishra (3), Mohammed Shami (3) and Umesh Yadav (3).","pubDate":"2022-06-30 18:15:42","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Harbhajan Singh heaps praise on Cheteshwar Pujara: His contribution has always been there","link":"https://www.thehansindia.com/sports/cricket/harbhajan-singh-heaps-praise-on-cheteshwar-pujara-his-contribution-has-always-been-there-751286","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Cheteshwar Pujara recently played for Sussex in County CricketHe scored two double centuries for SussexIndia are set to play England in a one-off Test","content":"Former India spinner Harbhajan Singh has heaped praise on Cheteshwar Pujara, saying the top-order batsman has been excellent for India while playing away games.Following a few poor performances, Pujara was dropped from Team India for their home series against Sri Lanka earlier this year. However, the 34-year-old batsman decided to use his off time away from the national team by going to England and play in the County Championship for Sussex. Pujara achieved great success with Sussex as he scored two double centuries and as many hundreds. He was also praised by many for his decision to go to England, with the latest one being Harbhajan. During a discussion with Sportskeeda, the legendary off-spinner praised Pujara for heading over to England and also pointed out that at times his contributions to the team go unnoticed. \"He has been playing continuously in English conditions. Though you might say that in County cricket, the quality of bowlers is not like in international cricket, yes in county cricket also you encounter one or two bowlers, who play international cricket. It's good to see Pujara picked this option to go and play County. He was in good form there. His contribution has always been there. When we went to Australia, he had a big contribution though people talk less about him,\" Harbhajan said. The former Indian spinner went on to add that no Indian batsman has done a better job than Pujara in England and he makes it easier for his fellow batsmen. \"In England also whenever there is need to take the shine off the ball, to score runs and to hold one end, nobody has done the job better than Pujara. Talwar unke upar latak gayi thi. It was like 'Drop him, others are playing alright' which I thought was wrong. Pujara has been phenomenal for Team India when it comes to touring abroad because he doesn't get out, he makes it easier for others, he takes the shine off the ball. That's the reason India have won so many games abroad,\" added Harbhajan in the same interview. Last year, during India's tour of England, Pujara scored 227 runs in four Tests at an average of 32.43. He was India's third best batsman after Rohit Sharma and KL Rahul – both are unavailable for the upcoming one-off Test. Pujara will now be in action in India's one-off Test against England, which is scheduled to begin on Friday (July 1) at Edgbaston, Birmingham.","pubDate":"2022-06-30 18:12:15","image_url":"https://assets.thehansindia.com/h-upload/2022/06/30/500x300_1300515-harbajanpujara.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"India vs England T20 player list: Team India squad for England tour 2022","link":"https://thesportsrush.com/cricket-news-india-vs-england-t20-player-list-team-india-squad-for-england-tour-2022/","keywords":["Cricket","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs England T20 player list: The BCCI has picked two separate squads for the three-match T20I series post the fifth Test versus England. The Board of Control for Cricket in India’s All-India Senior Selection Committee, on Thursday, picked the squads for the three match T20I and ODI series against England, which would follow after… The post India vs England T20 player list: Team India squad for England tour 2022 appeared first on The SportsRush.","content":"India vs England T20 player list: The BCCI has picked two separate squads for the three-match T20I series post the fifth Test versus England. The Board of Control for Cricket in India’s All-India Senior Selection Committee, on Thursday, picked the squads for the three match T20I and ODI series against England, which would follow after the completion of the rescheduled fifth Test match between the two sides at the Edgbaston Cricket Ground , Birmingham. Interestingly, the committee has decided to pick two separate squads of 18-members each – for the first T20I and combined second and third T20I, with Rohit Sharma set to lead the side in all of these matches, including the ODI series as well. As far as the first T20I is concerned, the selection committee has decided to field the same squad which played the recently concluded two-match T20I series against Ireland, with the additional inclusion of Rohit as the skipper, who will don the captaincy hat in place of Hardik Pandya. The second and the third T20Is will mark the return of the experienced and seasoned campaigners in Virat Kohli, Jasprit Bumrah, Shreyas Iyer, Rishabh Pant, and Ravindra Jadeja. India’s squad for 1st T20I: Rohit Sharma (Captain), Ishan Kishan, Ruturaj Gaikwad, Sanju Samson, Suryakumar Yadav, Deepak Hooda, Rahul Tripathi, Dinesh Karthik (wk), Hardik Pandya, Venkatesh Iyer, Yuzvendra Chahal, Axar Patel, Ravi Bishnoi, Bhuvneshwar Kumar, Harshal Patel, Avesh Khan, Arshdeep Singh, Umran Malik. India’s squad for 2nd and 3rd T20I: Rohit Sharma (Captain), Ishan Kishan, Virat Kohli, Suryakumar Yadav, Deepak Hooda, Shreyas Iyer, Dinesh Karthik (wk), Rishabh Pant (wk), Hardik Pandya, Ravindra Jadeja, Yuzvendra Chahal, Axar Patel, Ravi Bishnoi, Jasprit Bumrah, Bhuvneshwar Kumar, Avesh Khan, Harshal Patel, Umran Malik. The squad for the 2nd and 3rd T20Is perhaps present more or less the one which the team is likely to go ahead with in the upcoming T20 World Cup in Australia this year. The likes of Ruturaj Gaikwad, Sanju Samson, Arshdeep Singh, Venkatesh Iyer, and Rahul Tripathi have failed to make the cut for the final two T20Is. The three-match T20I series would take place on July 7, 9, and 10 at Southampton, Birmingham, and Nottingham respectively. Left-arm pacer from Punjab Arshdeep Singh, who has been left out of the final two T20Is, has earned his maiden call-up into the 17-member ODI squad, with the series scheduled to take place from July 12- 17. Amongst the ones who are not part of the T20I series, but have found a place in the 50-Over format squad are Shikhar Dhawan, Shardul Thakur, Prasidh Krishna, Mohammed Siraj and Mohammed Shami. India’s squad for 3 ODIs: Rohit Sharma (Captain), Shikhar Dhawan, Ishan Kishan, Virat Kohli, Suryakumar Yadav, Shreyas Iyer, Rishabh Pant (wk), Hardik Pandya, Ravindra Jadeja, Shardul Thakur, Yuzvendra Chahal, Axar Patel, Jasprit Bumrah, Prasidh Krishna, Mohammed Shami, Mohammed Siraj, Arshdeep Singh.","pubDate":"2022-06-30 18:11:43","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"ENG vs IND: 'Biggest achievement of my career,' Jasprit Bumrah reacts to being named Test captain","link":"https://www.thehansindia.com/sports/cricket/eng-vs-ind-biggest-achievement-of-my-career-jasprit-bumrah-reacts-to-being-named-test-captain-751280","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Jasprit Bumrah will lead India in Edgbaston TestRohit Sharma has been ruled out due to covidIndia currently lead the series 2-1","content":"Jasprit Bumrah has expressed his delight about being given the opportunity to lead India in the upcoming Test against England, calling it the \"biggest achievement\" of his career.After Rohit Sharma was ruled out of the rescheduled fifth Test, which is due to begin on Friday (July 1), the BCCI named Bumrah the stand-in skipper for the game. He is set to become India's 36th Test skipper and also first fast bowler to captain India in Tests since Kapil Dev in 1987. \"This is a huge achievement, a huge honour. Playing a Test match for the country was my dream and getting this opportunity is the biggest achievement of my career,\" Bumrah said at the pre-match conference on Thursday. When reporters asked him if he learnt from former captains like MS Dhoni and Virat Kohli, Bumrah said that he loves to learn from the best before adding that his aim is not to emulate anyone and will make his own decisions at the end of the day. \"See these are legends of the game, and they have contributed a lot. But I won't be emulating anyone. I listen to advises from all. And try to learn from everyone. But obviously, as your instincts say that you can't be the same as everyone. I try to learn from everyone, but I take the call on my own,\" the fast bowler added.Always fun to play test cricket under the lights! Special game, great win, proud of this team 🇮🇳 pic.twitter.com/34Carwv0fT— Jasprit Bumrah (@Jaspritbumrah93) March 14, 2022 India currently lead the series 2-1 ahead of the fifth and final Test against England. The hosts are coming full of confidence after beating New Zealand 3-0 at home. Bumrah's mother gave him a few tricks, tips: Sanjana Ganesan Meanwhile, Bumrah's wife Sanjana Ganesan has revealed the reaction of Bumrah's mother to him being named India's captain for the one-off Test. Ganesan said that Bumrah's mother was very happy and even had a few tips and tricks to provide to the Indian pacer ahead of his first assignment as skipper. \"She's very excited. She's always liked to see him do well because he loves the sport and she's literally seen the entire journey he's gone through to get to where he is. She was ecstatic when she found out. She had tons of tips and tricks, even though she's never played cricket herself! Like a mother does, she told him, 'This should be how you think, and this should be what you do,\" Sanjana told ICC. View this post on Instagram A post shared by Sanjana Ganesan (@sanjanaganesan) Sanjana, who is a sports anchor, also revealed that Bumrah was given enough time to absorb and understand the decision. \"He hasn't had it all in one impact, because it [the confirmation of the news] has been pretty trickled. In the sense that we had to wait for a result from Rohit [Sharma] to find out whether or not Jasprit will be leading the side. \"So it was a lot of wait-and-watch because there were (Covid-19) tests in the morning and evening, and they wanted to be entirely sure they were doing everything they could to give Rohit a fair chance to come back and play this Test,\" added Sanjana. \"[Bumrah] got a lot of time to absorb and understand that this was really happening. He's proud and definitely very happy about it. I don't know if there is a little bit of nerves, but he's had enough time to absorb it all,\" she said further.","pubDate":"2022-06-30 17:52:17","image_url":"https://assets.thehansindia.com/h-upload/2022/06/30/500x300_1300509-jasprit-bumrah.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler named England's white-ball captain","link":"https://www.thehansindia.com/sports/cricket/jos-buttler-named-englands-white-ball-captain-751277","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"Eoin Morgan recently retired from international cricketJos Buttler has been a part of England since 2011Buttler’s first assignment is a home series against India","content":"Jos ButtlerJos ButtlerJos Buttler has been named England's new white-ball captain, the England and Wales Cricket Board (ECB) announced on Thursday.Buttler has been handed the captain's armband following the retirement of World Cup-winning skipper Eoin Morgan, who led the English side from 2011 to 2022. The Ireland-born cricketer led England to their maiden World Cup in 2019. The decision to make Buttler the limited-overs captain was taken by the ECB Interim Chair, Martin Darlow, and Interim Chief Executive Officer, Clare Connor on Wednesday evening following the recommendation by the Managing Director of England Men's Cricket, Rob Key, according to a release from ECB. Jos Buttler: Greatest honour to captain my country \"I would like to offer my sincere thanks and gratitude to Eoin Morgan for his outstanding leadership over the past seven years. It has been the most memorable period for everyone involved. He has been an inspirational leader, and it has been fantastic to play under him. There are lots of things that I have learnt from him that I'll take into this role. It is a great honour to take over from Eoin, and the place he has left English white-ball cricket in is exciting, and I'm inspired for the challenges ahead.The wins. The losses. The lessons. They've all led you here... Now is your time, @josbuttler 💪 pic.twitter.com/yFFHz2F0L4— England Cricket (@englandcricket) June 30, 2022 \"There is excellent strength-in-depth in the white-ball squads, and I'm looking forward to leading the teams out for the series that are coming up against India starting next week and later in July against South Africa. It is the greatest honour to captain your country, and when I have had the chance to step in the past, I have loved doing it. I can't wait to take this team forward,\" said Buttler after being appointed as England captain. Buttler has been with the England national side for over a decade now, having played close to 300 games, across all formats. He made his England debut in 2011 during a T20I against India in Manchester. He made his ODI debut a year later in the UAE against Pakistan. The 'keeper-batsman has been an integral part of the set-up, having been vice-captain since 2015 and has led the team 14 times previously (Nine ODIs & five T20Is). The 31-year-old is one of three England cricketers (Dawid Malan and Heather Knight) to have scored hundreds in all three formats of the game.Handing over to someone new 🤝Congratulations on becoming England's new men's white-ball captain, @josbuttler 👏#LoveLords pic.twitter.com/w16C0GWXME— Lord's Cricket Ground (@HomeOfCricket) June 30, 2022 Having played 151 ODIs, Buttler has scored 4,120 runs at an average of 41.20, scoring 10 centuries and 21 fifties. With 2,140 runs in 88 T20Is, Buttler is the 12th leading run-scorer in the shortest format, while he is the second leading-run scorer for England after Morgan in the T20Is. The Lancashire batter has scored one century and 15 fifties in the T20Is for England. Buttler's first assignment as England's full-time captain is their upcoming six-match limited-overs home series against India, including three ODIs and as many T20Is. The series is scheduled to go underway on July 7 at The Rose Bowl, Southampton.","pubDate":"2022-06-30 17:45:31","image_url":"https://assets.thehansindia.com/h-upload/2022/06/30/500x300_1300507-jos-buttler.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England vs India live telecast channel in India for free: India tour of England 2022 live telecast in India and USA","link":"https://thesportsrush.com/cricket-news-england-vs-india-live-telecast-channel-in-india-for-free-india-tour-of-england-2022-live-telecast-in-india-and-usa/","keywords":["Cricket","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"England vs India live telecast channel in India for free: The highly anticipated clash between the two sides will commence tomorrow. The rescheduled ‘fifth’ Test match of the Pataudi Trophy series is set to take place from Friday, at the Edgbaston Cricket Ground in Birmingham, with the series score line reading 2-1 in favour of… The post England vs India live telecast channel in India for free: India tour of England 2022 live telecast in India and USA appeared first on The SportsRush.","content":"England vs India live telecast channel in India for free: The highly anticipated clash between the two sides will commence tomorrow. The rescheduled ‘fifth’ Test match of the Pataudi Trophy series is set to take place from Friday, at the Edgbaston Cricket Ground in Birmingham, with the series score line reading 2-1 in favour of the visitors. Having last won an away Test series against England in the year 2007, team India were handed a massive blow a day before the start of the Test as their all-format skipper Rohit Sharma was ruled out of the same due to COVID-19. While one man’s misfortune is another man’s opportunity, fast bowler Jasprit Bumrah has been presented the opportunity to lead team India for the first time ever, with Rishabh Pant elected as his deputy. With team India eyeing on their maiden Test match victory at Edgbaston, they would face the stiff English challenge, with the Ben Stokes-led side perhaps playing the best Cricket of their lives, having whitewashed world Test champions New Zealand 3-0 a few days ago. England vs India live telecast channel in India for free It is worth of a mention that all the Test matches played by team India Men’s and Women’s Cricket Team and all ICC Test matches featuring India have been considered as events of national importance under sports broadcasting signals mandatory sharing with Prasar Bharati. Thus, the good news for the fans in India is that they can watch the live telecast the ‘fifth’ Test match at Edgbaston for free on the Doordarshan Sports channel. It’s time Test cricket is officially back on Doordarshan. Starting with the 5th and final test at Edgbaston between England and India. #ENGvIND #CricketTwitter pic.twitter.com/hVufLjiw6W — Doordarshan Sports (@ddsportschannel) June 30, 2022 With Sony Sports Network being the official broadcaster of the series, fans can also catch the match and the entire all-format series live in different languages, with a panel of commentators offering their commentary services in English (Sony Six channel), Hindi (Sony TEN 3 channel), Tamil and Telugu (Sony TEN 4 channel). However, these channels can be watched after subscribing them on your respective T.V. sets at a designated fee. Online users in India can live stream the series on Sony’s streaming application named Sony LIV, again at a subscription fee. The Test match will commence from 03:30 pm onwards from July 1- July 5. India tour of England 2022 live telecast in USA Fans in the United States of America (USA) can watch the live telecast on ‘Willow TV’. The Test match will commence from 06:00 am onwards from July 1- July 5, in Washington DC. The post England vs India live telecast channel in India for free: India tour of England 2022 live telecast in India and USA appeared first on The SportsRush.","pubDate":"2022-06-30 17:35:37","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG Test records: India vs England Head to Head record in Test cricket","link":"https://thesportsrush.com/cricket-news-ind-vs-eng-test-records-india-vs-england-head-to-head-record-in-test-cricket/","keywords":["Cricket","England","India","India tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"India vs England Head to Head record: The SportsRush presents for you the Head to Head statistics for the fifth ENG vs IND Test. A rescheduled fifth Test match between England and India will be played in Birmingham from tomorrow. With the first four of a five-match series played in the previous English summer, England… The post IND vs ENG Test records: India vs England Head to Head record in Test cricket appeared first on The SportsRush.","content":"India vs England Head to Head record: The SportsRush presents for you the Head to Head statistics for the fifth ENG vs IND Test. A rescheduled fifth Test match between England and India will be played in Birmingham from tomorrow. With the first four of a five-match series played in the previous English summer, England and India will lock horns yet again for a one-off Test this year to be followed by six white-ball matches; all within span of 17 days. England, who have an overall better head to head record against India, should be confident of drawing level the series especially after coming on the back of whitewashing New Zealand 3-0. It wouldn’t be wrong to say that another successful execution of ‘BazBall’ will make winning quite difficult for the visitors in this match. That being said, India would want to take confidence from the series score line of 2-1 in their favour. Playing under a brand new captain , Indians fans don’t really know what’s in store for them at Edgbaston. However, it is this uncertainty which has it in it to be converted into fascination during the course of the next five days. 💬 “We carry on. If any one can be (more attacking) it’s us. Just because the opposition changes doesn’t mean we’re going to.” Ben Stokes. 🔥 Full interview 🎥 https://t.co/4sK9xEpSXi #Edgbaston | #ENGvIND pic.twitter.com/MoOrfAlWwW — Edgbaston (@Edgbaston) June 30, 2022 Total number of matches played: 130 Matches won by ENG: 49 Matches won by IND: 31 Matches played in England:6 (ENG 35, IND 9) Matches played at Edgbaston: 7 (ENG 6, IND 0) Most runs for ENG: 2,353 (Joe Root) Most runs for IND: 1,960 (Virat Kohli) Most wickets for ENG: 133 (James Anderson) Most wickets for IND: 88 (Ravichandran Ashwin) Most catches for ENG: 37 (Jonny Bairstow) Most catches for IND: 37 (Rishabh Pant) NOTE: Only players part of current squads have been considered above (most runs, wickets and catches).","pubDate":"2022-06-30 17:01:55","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Stokes looks to bigger picture before long-delayed England v India finale","link":"https://www.theguardian.com/sport/2022/jun/30/stokes-looks-to-bigger-picture-ahead-of-long-delayed-india-series-finale-cricket","keywords":["England cricket team","England v India 2021","Ben Stokes","Cricket","India cricket team","Sport"],"creator":["Ali Martin"],"video_url":null,"description":"Both sides are much changed for an Edgbaston Test that will decide the 2021 series that was curtailed due to CovidThe next time someone talks about the future of Test cricket in sombre tones, as if its decline is as inevitable as coastal erosion, point them to the rearranged fifth Test between England and India that gets under way in leafy south Birmingham on Friday.Granted, the sands are shifting elsewhere in the world. But India pitch up in whites this week because to not complete last year’s series – one the tourists led 2-1 when Covid entered their camp ahead of the Old Trafford finale – would have left a £40m black hole. In these parts, whatever the short-form enthusiasts say, Test cricket is still king. Continue reading...","content":"T he next time someone talks about the future of Test cricket in sombre tones, as if its decline is as inevitable as coastal erosion, point them to the rearranged fifth Test between England and India that gets under way in leafy south Birmingham on Friday. Granted, the sands are shifting elsewhere in the world. But India pitch up in whites this week because to not complete last year’s series – one the tourists led 2-1 when Covid entered their camp ahead of the Old Trafford finale – would have left a £40m black hole . In these parts, whatever the short-form enthusiasts say, Test cricket is still king. Jos Buttler replaces Eoin Morgan as England white-ball captain Read more India’s arrival is always a big deal but framing this series decider is not straightforward. They left these shores the superior side, their performances at Lord’s and the Oval nothing short of ferocious. Win or draw and it will be a first series victory in England since 2007, filed alongside their away triumphs in Australia in 2018-19 and 2020-21. And yet an asterisk will inevitably sit alongside the final scoreline, its place in history a curio, because so much has changed since. Virat Kohli, whose midnight email to the BCCI on the eve of the original fixture sealed its fate, is no longer India captain, and Ravi Shastri, the head coach, will be giving his inimitable take from the commentary box. KL Rahul and Rohit Sharma formed a dominant opening partnership that schooled England but are now missing through injury and Covid-19 respectively, with Jasprit Bumrah stepping up as captain in the absence of the latter. The fast bowler – India’s irresistible game-breaker at the Oval – was buzzing at the prospect on Thursday, having never previously led a side at any level. England are similarly a different beast, ever since Ben Stokes and Brendon McCullum came in as captain and head coach and sent a fresh wave of adventure coursing through the dressing room. Stokes was not even around last summer, taking a break for mental health reasons, and his presence was missed during a spiky encounter that nearly boiled over in the Long Room on the third day at Lord’s. The all-rounder is keen to level the series, naturally, but his goal, he claimed, is far greater than one match and one result. There is a missionary zeal about the 31-year-old at present, evidenced by his decision to drop out of the Indian Premier League and plough his energies into the Test side, and this means continuing the breakneck approach seen during their 3-0 win over New Zealand against fresh opposition. “If there’s a team that can, it’s us,” replied Stokes, boldly, when asked whether it is possible for his side to go harder still. “We know we need to win this Test to draw the series from a year ago. But at the moment, this is bigger than the results. “What we managed to do over the last three weeks is reshape Test cricket with the way that we played. I think people are enjoying watching because they don’t know what they are going to get, but they know how we are going to play. I liken it to when the one-day team started in 2015; they knew they might watch something special.” Quick Guide England v India teams Show England Crawley, Lees, Pope, Root, Bairstow, Stokes (c), Billings (wk), Broad, Potts, Leach, Anderson. India (possible) Gill, Pujara, Vihari, Kohli, Iyer, Pant (wk), Jadeja, Thakur, Ashwin, Shami, Bumrah (c) Was this helpful? Thank you for your feedback. England are also looking to play their strongest XI at all times these days and so Jamie Overton makes way for the fit-again Jimmy Anderson despite being one of the architects of the win at Headingley with his 97 from No 8 on debut. Sam Billings also keeps his spot behind the stumps – this third cap his first not to involve haring down a motorway beforehand – with Ben Foakes not yet 100% fit. Stokes also revealed he deliberately did not bowl himself in the first innings at Leeds, and bowled just four overs in the second, to push his frontline attack harder. Like the orders to bat aggressively, it was apparently done to teach them what is possible, whether that is 36-year-old Stuart Broad or Matt Potts, a breakout star who is 13 years his junior. “It’s funny, bowlers have green zones, amber zones and red zones based on how much work you’ve done. [Broad] said he’s created a new zone called the burgundy zone,” Stokes explained. “But that Test match was bigger than the result. Anderson hails Stokes for instilling England spirit ‘I’ve never seen before’ Read more “I honestly believe bowling out the best team in the world with three seamers and a spinner has done everybody the world of good. That whole week was really pushing them to their limits and making them understand what they are capable of doing. The challenge with Pottsy is to push him.” It is another example of Stokes looking to eschew conventional thinking, even if it will invite criticism when things go wrong. The ongoing absence of Jofra Archer after being bowled into the ground serves as a cautionary tale here. The same goes for the batting: there is an acceptance that a blowout or two along the way is inevitable, yet there is no going back either. Players are being given time too, with Stokes looking to ape the early days of Eoin Morgan’s white-ball revolution and insisting Zak Crawley, a player who might typically be said to be struggling, will keep his spot “regardless” of his returns this week. Whether this can work in the longest format remains to be seen. But either way, and however peculiar the notion of a series spanning the best part of 12 months, the stands at Edgbaston are set to be full, and an intriguing, lucrative contest awaits.","pubDate":"2022-06-30 17:00:47","image_url":"https://i.guim.co.uk/img/media/84510c47da51128512a173b98efad3b8b767ea8a/69_70_2983_1789/master/2983.jpg?width=460&quality=85&auto=format&fit=max&s=d7753185c1c964ad0813bacb360640f8","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"Jos Buttler replaces Eoin Morgan as England's ODIs and T20Is captain","link":"https://www.indiatvnews.com/sports/cricket/jos-buttler-replaces-eoin-morgan-as-england-s-odis-and-t20is-captain-2022-06-30-788710","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler was appointed as England's new white-ball captain on Thursday and took immediate charge of the Twenty20 and one-day international cricket teams.","content":"was appointed as England's new white-ball captain on Thursday and took immediate charge of the Twenty20 and one-day international cricket teams. Vice-captain since 2015, the 31-year-old Buttler has deputized for on 14 occasions, including in the Netherlands last week after Morgan sat out with a groin injury. Morgan announced his retirement from international cricket on Tuesday and the England and Wales Cricket Board wasted little time in confirming Buttler's promotion. Buttler will take charge of 12 games in July, with T20 and ODI series against India and South Africa. The wicketkeeper-batter is a ferocious striker of the ball. He has played 151 ODI games for England, scoring 4,120 runs at an average of 41.20, including 10 hundreds and 21 fifties. In T20s, he has won 88 caps scoring 2,140 runs with an average of 34.51. Buttler is one of three England cricketers — with Dawid Malan and Heather Knight — to have scored hundreds in all three formats of the game. “It is a great honor to take over from Eoin, and the place he has left English white-ball cricket in is exciting, and I'm inspired for the challenges ahead,” Buttler said. Morgan is credited with transforming England's white-ball fortunes in 2015 with a bold, inventive approach. He led England to its first men's Cricket World Cup title in 2019, and the top of the ODI and T20 rankings.","pubDate":"2022-06-30 16:59:50","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG Preview: India resume rivalry against buoyant England","link":"https://telanganatoday.com/ind-vs-eng-preview-india-resume-rivalry-against-buoyant-england","keywords":["Cricket","News","Sport","England","IND vs ENG Preview","India","Jasprit Bumrah"],"creator":["PTI"],"video_url":null,"description":"Birmingham: Never before has he navigated the choppy waters of leadership but Jasprit Bumrah will certainly like to showcase his captaincy acumen while leading a slightly under-prepared India against a vastly improved England in the rescheduled fifth Test, starting here on Friday. India were leading the five-match series 2-1 when multiple Covid-19 cases in their […]","content":"Birmingham: Never before has he navigated the choppy waters of leadership but Jasprit Bumrah will certainly like to showcase his captaincy acumen while leading a slightly under-prepared India against a vastly improved England in the rescheduled fifth Test, starting here on Friday. India were leading the five-match series 2-1 when multiple Covid-19 cases in their camp led to the postponement of the final game which was a part of the World Test Championship. Nine months have passed since and a lot of water has flown through the Thames with the then captain Virat Kohli relinquishing Test captaincy. His successor, Rohit Sharma, is missing out on this game after testing positive for Covid-19. Worse, Rohit’s designated deputy KL Rahul is also out after having undergone a surgery for sports hernia. In this backdrop of musical chair of Indian captaincy, the gauntlet has been thrown at Bumrah, arguably one of the finest fast bowlers in the history of Indian cricket and now set to be the 36th man to lead the national Test team. He has been acknowledged widely as the undisputed leader of the fast bowling group but come Friday, the challenge against Ben Stokes’ side will be very different when he walks out for the toss at the Edgbaston. Fast bowlers in Indian context have never been considered worthy of leadership contention and Kapil Dev, the world class all-rounder, was more of a fast medium bowler in his prime and later a medium-fast as time progressed. Javagal Srinath and Zaheer Khan, two fine exponents of fast bowling, were never even considered for vice-captaincy during their heydays. And hence, it took 35 years for India to have another pacer captain. But leadership is an instinctive thing – some are blessed with that sixth sense and intuition, some are born gamblers and some become better as they grow on the job. While this arrangement is a stop-gap one, Indian cricket establishment might have an idea of what can be expected of Bumrah when the time comes for the next change in baton. The 3-0 demolition of New Zealand with three tricky chases completed in style has shown that England, under new coach Brendon McCullum, have de-constructed their style-sheet as far as Test matches are concerned. Their batters are plundering opposition attack while there are lesser number of five-wicket hauls from the pacers if one goes by the statistics of the New Zealand series. It was Jack Leach, who had two five-wicket hauls and neither James Anderson nor Stuart Broad got their names on the various ‘Honours’ Board’. The pitches have become a tad flatter, which is helping the batters and thus Bumrah, along with Mohammed Shami and Mohammed Siraj will have an onerous task of tackling a batting line-up bubbling with confidence. Joe Root, after relinquishing captaincy, has found the touch that had deserted him and Jonny Bairstow, with the confidence of IPL, has scored nearly 400 runs at a strike-rate of 120 plus, unheard of in Test matches. India are still third in World Test Championship table (58.33 percentage points) behind Australia (75 percentage points) and South Africa (71.43% pts). India will have to bat well and in absence of regular opening pair of Rohit and Rahul, who were fantastic during the four Tests played last year. Coach Rahul Dravid expects a match-winning performance if not a hundred from Virat Kohli, who looked good in the practice game but the Test match will be a different beast altogether.","pubDate":"2022-06-30 16:47:37","image_url":null,"source_id":"telanganatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG Dream11 prediction: Fantasy cricket tips for India vs England 5th Test match in Edgbaston","link":"https://www.dnaindia.com/cricket/report-ind-vs-eng-dream11-prediction-fantasy-cricket-tips-for-india-vs-england-5th-test-match-in-edgbaston-sony-liv-2964819","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"IND vs ENG Dream 11 Team - Check My Dream11 Team, Best Player's list for 5th Test match, India vs England","content":null,"pubDate":"2022-06-30 16:44:45","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/06/30/2518737-india-vs-england.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"England picks Jos Buttler as captain of T20 and ODI teams as Morgan retires","link":"https://www.business-standard.com/article/sports/england-picks-jos-buttler-as-captain-of-t20-and-odi-teams-as-morgan-retires-122063001315_1.html","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler was promoted to England's new white-ball captain on Thursday and took immediate charge of the Twenty20 and one-day international cricket teams. Vice-captain since 2015, the 31-year-old Buttler has deputized for Eoin Morgan on 14 occasions, including in the Netherlands last week after Morgan sat out with a groin injury. Morgan announced his retirement from international cricket on Tuesday and the England and Wales Cricket Board wasted little time in confirming Buttler's promotion. Buttler will take charge of 12 games in July, with T20 and ODI series against India and South Africa. The wicketkeeper-batter is a ferocious striker of the ball. He has played 151 ODI games for England, scoring 4,120 runs at an average of 41.20, including 10 hundreds and 21 fifties. In T20s, he has won 88 caps scoring 2,140 runs with an average of 34.51. Buttler is one of three England cricketers with Dawid Malan and Heather Knight to have scored hundreds in all three formats of the game. I","content":null,"pubDate":"2022-06-30 16:25:00","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1220630/thumb-122063001315.jpg","source_id":"business-standard","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG India Playing 11: England Playing 11 for 5th Test at Edgbaston","link":"https://thesportsrush.com/cricket-news-ind-vs-eng-india-playing-11-england-playing-11-for-5th-test-at-edgbaston/","keywords":["Cricket","Edgbaston","England","India tour of England 2022"],"creator":["Gurpreet Singh"],"video_url":null,"description":"IND vs ENG India Playing 11: With Ben Stokes set to lead the side yet again, England have announced their playing XI for the Edgbaston Test. The Indian Cricket team will take on England at the Edgbaston Cricket Ground, in Birmingham, during the rescheduled ‘fifth’ Test match of the Pataudi Trophy series after the same… The post IND vs ENG India Playing 11: England Playing 11 for 5th Test at Edgbaston appeared first on The SportsRush.","content":"IND vs ENG India Playing 11: With Ben Stokes set to lead the side yet again, England have announced their playing XI for the Edgbaston Test. The Indian Cricket team will take on England at the Edgbaston Cricket Ground, in Birmingham, during the rescheduled ‘fifth’ Test match of the Pataudi Trophy series after the same had to be postponed last year due to a spree of COVID-19 cases in the Indian camp. With the team’s all-format skipper Rohit Sharma returning with a third COVID-19 positive report on Thursday morning, he has been ruled out of the Test, with the captaincy responsibility being handed to pacer Jasprit Bumrah , who will mark his captaincy debut tomorrow. With KL Rahul already ruled out due to injury, Rishabh Pant has been named as the team’s vice-captain. Addressing the media persons ahead of the one-off Test match, Jasprit Bumrah stated that despite the initial two designated opening batters in KL Rahul and Rohit Sharma missing out, his side is very much clear as to who would be the opening batting pair tomorrow. However, he refused to reveal the same as along with the rest of the playing XI, while remarking that they would have to wait until tomorrow for the same. Jasprit Bumrah: We are clear in what we want to do. Of course, Rohit is a very important player and we will miss him. It is unfortunate that he is missing out. We are clear about our combination, you will just have to wait till tomorrow. #ENGvIND — Subhayan Chakraborty (@CricSubhayan) June 30, 2022 Meanwhile England, following their tradition of naming their starting XI a day before the commencement of a Test match, announced the same on Thursday evening. While wicket-keeper batter Ben Foakes, akin Rohit Sharma failed to come up with a negative COVID-19 report on time, bowling all-rounder Jamie Overton would make way for the legendary pacer James Anderson. England Playing XI vs India: Alex Less, Zak Crawley, Ollie Pope, Joe Root, Jonny Bairstow, Ben Stokes (c), Sam Billings, Matty Potts, Stuart Broad, Jack Leach, James Anderson.","pubDate":"2022-06-30 16:24:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"“I have spoken to MS Dhoni”: Jasprit Bumrah reveals discussion with MS Dhoni ahead of leading India for the first time at Edgbaston","link":"https://thesportsrush.com/cricket-news-i-have-spoken-to-ms-dhoni-jasprit-bumrah-reveals-discussion-with-ms-dhoni-ahead-of-leading-india-for-the-first-time-at-edgbaston/","keywords":["Cricket","Edgbaston","India tour of England 2022","Jasprit Bumrah"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Jasprit Bumrah reveals discussion with MS Dhoni with the former set to don the captaincy hat for the first time ever in competitive Cricket. With KL Rahul being ruled out due to injury, and more recently team India’s all-format skipper Rohit Sharma too having to accept his ill fate after contacting with the Coronavirus, Jasprit… The post “I have spoken to MS Dhoni”: Jasprit Bumrah reveals discussion with MS Dhoni ahead of leading India for the first time at Edgbaston appeared first on The SportsRush.","content":"Jasprit Bumrah reveals discussion with MS Dhoni with the former set to don the captaincy hat for the first time ever in competitive Cricket. With KL Rahul being ruled out due to injury , and more recently team India’s all-format skipper Rohit Sharma too having to accept his ill fate after contacting with the Coronavirus, Jasprit Bumrah has been appointed the new leader of the side for the one-off, rescheduled ‘fifth’ Test match against England starting Friday, at the Edgbaston Cricket Ground in Birmingham. Interestingly, Bumrah, who is set to become India’s 36th Test captain, will be team India’s 5th captain in their last eight Test matches, and the 6th in the year 2022 across all formats – their highest ever in a calendar year. Additionally, Bumrah would now also become only the second fast bowler to captain the Indian Cricket team since 1987, after the legendary Kapil Dev. Gujarat cricketers to lead India in Men’s Test cricket: Nari Contractor Jasprit Bumrah (Vinoo Mankad, former Gujarat, played for Mumbai and Rajasthan when he led India) — Abhishek Mukherjee (@ovshake42) June 30, 2022 Post being announced the captain of the side for the Edgbaston Test, an elated Bumrah remarked that he has never had any captaincy idol in the game as all that mattered to him was fast bowling. However, the 28-year-old did reveal that he had a conversation with the legendary India captain MS Dhoni, who remarked that even he (Dhoni) had never led any team in competitive Cricket before donning the Indian team captaincy hat, and the result is that he ended his career as one of the most successful captains in world Cricket. “Yeah, captaincy, I have spoken to a lot of players, everybody improves and they keep getting better. Even I have spoken to MS Dhoni, he told me that he captained India straight away, he had never captained anywhere else and he is one of the most successful captains. I am just focusing on how to help the team and not on what I have done before. I will try to contribute to the best of my ability,” exclaimed Bumrah. A win or even a draw for team India would help them clinch the Test series, which would be their first in England since the year 2007.","pubDate":"2022-06-30 15:45:52","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Madurai Panthers vs Lyca Kovai Kings, 8th Match, Tamil Nadu Premier League 2022 - Cricbuzz","link":"https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vbS5jcmljYnV6ei5jb20vY3JpY2tldC1jb21tZW50YXJ5LzQ4MjU2L2xray12cy1tYWR1cmFpLTh0aC1tYXRjaC10YW1pbC1uYWR1LXByZW1pZXItbGVhZ3VlLTIwMjLSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Madurai Panthers vs Lyca Kovai Kings, 8th Match, Tamil Nadu Premier League 2022  CricbuzzNRK vs DD 11Wickets Prediction, Fantasy Cricket Tips, Playing 11, Pitch Report and Injury Update for Match 7 of Tamil Nadu T20 League 2022  CricTrackerView Full coverage on Google News","content":null,"pubDate":"2022-06-30 15:27:25","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler named England men's new white-ball captain - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvZW5nbGFuZC12cy1pbmRpYS0yMDIyLWpvcy1idXR0bGVyLW5hbWVkLWFzLWVuZ2xhbmQtbWVuLXMtbmV3LXdoaXRlLWJhbGwtY2FwdGFpbi0xMzIyNTQw0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Jos Buttler named England men's new white-ball captain  ESPNcricinfoJos Buttler named new England white-ball captain | Cricbuzz.com - Cricbuzz  CricbuzzArcher wishes Eoin Morgan ‘happy retirement’ with hilarious nutmeg video - Watch  Hindustan TimesJos Buttler Q&A: Is new England captain the right man for the job?  The IndependentEngland name new white-ball captain to replace Morgan  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2022-06-30 15:26:39","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Jos Buttler confirmed as England’s new white-ball captain after Eoin Morgan retires from international cricket","link":"https://www.thesun.co.uk/sport/19051719/jos-buttler-england-white-ball-captain-eoin-morgan-retires/","keywords":["Cricket","Sport"],"creator":["John Etheridge"],"video_url":null,"description":"JOS BUTTLER has been confirmed as England’s new white-ball captain and is convinced he can build on Eoin Morgan’s success. The 31-year-old was the long-term vice-captain and has already led England in nine one-day internationals and five Twenty20 matches. He is arguably one of England’s greatest limited-overs player. Buttler said: “Eoin has been an inspirational […]","content":"JOS BUTTLER has been confirmed as England’s new white-ball captain and is convinced he can build on Eoin Morgan’s success. The 31-year-old was the long-term vice-skipper and has already led England in nine one-day internationals and five Twenty20 matches. He is arguably one of England’s greatest limited-overs player s. Buttler said: “Eoin has been an inspirational leader and there are lots of things I’ve learnt from him. “He’s left English white-ball cricket in a very exciting place and I’m inspired for the challenges ahead. \"It is the greatest honour to captain your country - I can’t wait to take this team forward.” Test skipper Ben Stokes added: “Jos was the obvious choice and he’ll continue the ethos and mindset that Morgs brought to us. \"He is a huge leader and role model for guys coming into the team in the way he trains and plays.” Buttler takes over from Morgan who had been captain for seven-and-a half years due to his retirement . Morgan, 35, quit as England's leading run scorer and most capped player in both white-ball formats. FREE BETS AND SIGN UP DEALS - BEST NEW CUSTOMER OFFERS Plus he is the only man to lead the side to an ODI World Cup success. He apparently made his decision to step down after struggling during England's recent trip to face the Netherlands. Morgan twice did not score any runs and consequently spoke to ex-players and white-ball coach Matthew Mott to help him come to the decision. England play six ODIs and six T20s against India and South Africa in July.","pubDate":"2022-06-30 15:22:50","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Jos Buttler appointed as England’s new white-ball captain","link":"https://www.firstpost.com/firstcricket/sports-news/jos-buttler-appointed-as-englands-new-white-ball-captain-10856281.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Jos Buttler appointed as England’s new white-ball captain","content":"England batter Jos Buttler has been announced as the new limited-overs format captain of the English team after the retirement of veteran Eoin Morgan.The English and Wales Cricket Board confirmed the appointment through a media release.The release stated, “Lancashire's Jos Buttler has been appointed captain of the England Men's white-ball teams by the England & Wales Cricket Board. He succeeds Eoin Morgan, who retired from international cricket earlier this week. The ECB Interim Chair, Martin Darlow, and Interim Chief Executive Officer, Clare Connor, approved the appointment on Wednesday evening following the recommendation by the Managing Director of England Men's Cricket, Rob Key.”Eoin Morgan announced his retirement from all international cricket on Tuesday.Buttler has been a part of the English side for more than a decade now after he made his debut in 2011. He has 151 ODI and 88 T20I caps to his name so far and has been an integral part of the white-ball team.\"It is a great honour to take over from Eoin, and the place he has left English white-ball cricket in is exciting, and I'm inspired for the challenges ahead,” Buttler stated in the press release.He further expressed his gratitude to his predecessor. “I would like to offer my sincere thanks and gratitude to Eoin Morgan for his outstanding leadership over the past seven years. It has been the most memorable period for everyone involved. He has been an inspirational leader, and it has been fantastic to play under him. There are lots of things that I have learnt from him that I'll take into this role.”Buttler has captained England on quite a few occasions earlier. The latest being in the third ODI against the Netherlands when Morgan was out with an injury. “It is the greatest honour to captain your country, and when I have had the chance to step in the past, I have loved doing it. I can't wait to take this team forward,” Buttler added.Introducing our new Men's White-Ball captain, @josbuttler— England Cricket (@englandcricket) June 30, 2022Rob Key, the managing director of the England Men’s cricket team said that Buttler was the perfect replacement for Morgan.Clare Connor, the interim ECB CEO also said that Buttler is a fantastic role model for the players within the team. “I'm excited to see where Jos and Matthew Mott take things from here, particularly as we build towards the ICC Men's T20 World Cup.”Buttler will start his captaincy stint with the T20I series against India starting 7 July, followed by the ODI series that begins on 13 July.Read all the Latest News, Trending News, Cricket News, Bollywood News, India News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.","pubDate":"2022-06-30 15:13:48","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2022/06/Jos-Buttler-England-Netherlands-1st-ODI-Twitter-@englandcricket-640.jpg","source_id":"firstpost","country":["india"],"category":["sports"],"language":"english"},{"title":"CSA chief executive Pholetsi Moseki has high hopes for Director of Cricket Enoch Nkwe","link":"https://www.iol.co.za/sport/cricket/csa-chief-executive-pholetsi-moseki-has-high-hopes-for-director-of-cricket-enoch-nkwe-6568c4d2-eb39-4aec-86b7-cfa912628015","keywords":null,"creator":["Zaahier Adams"],"video_url":null,"description":"Cricket SA chief executive officer Pholetsi Moseki is hoping new Director of Cricket Enoch Nkwe will help the organisation ‘turn the corner’ and reach ‘greater heights’.","content":null,"pubDate":"2022-06-30 15:12:53","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/cca9ada7-07f9-594a-adbe-20326ff4a9f2&operation=CROP&offset=0x234&resize=4455x2503","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Jos Buttler succeeds Eoin Morgan as England's new skipper in T20 and ODI formats","link":"https://www.dnaindia.com/cricket/report-jos-buttler-succeeds-eoin-morgan-as-england-s-new-skipper-in-t20-and-odi-formats-2964802","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"England cricket on Thursday named Jos Buttler as the new captain in limited-overs formats, after the retirement of Eoin Morgan.","content":null,"pubDate":"2022-06-30 15:05:00","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/06/30/2518720-buttler.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"}]}