{"newsArray":[{"title":"Poms scaled ‘Everest’ and shifted cricket’s ‘tectonic plates’. Australia should be worried — UK View","link":"https://www.foxsports.com.au/cricket/the-ashes/cricket-2022-england-sound-ashes-warning-shot-following-fourth-straight-win-uk-view-joe-root-jonny-bairstow-brendon-mccullum-video-highlights/news-story/932c7322c4acf389ecec44e1f4b5af21","keywords":null,"creator":null,"video_url":null,"description":"After a “root and branch” review following their Ashes disaster, England are salivating following their fourth straight victory under the new guard of Ben Stokes and Brendon McCullum.","content":null,"pubDate":"2022-07-05 23:23:00","image_url":null,"source_id":"foxsports","country":["australia"],"category":["sports"],"language":"english"},{"title":"Next Test series of India: India next Test series 2023","link":"https://thesportsrush.com/cricket-news-next-test-series-of-india-india-next-test-series-2023/","keywords":["Cricket","BCCI","Team India"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Next Test series of India: Team India will not play a Test series until the completion of the T20 World Cup in Australia this year. To remark that England chased down their highest ever target in Test match history against India at the Edgbaston Cricket Ground, would be a massive understatement. The Joe Root–Jonny Bairstow juggernaut which wrecked… The post Next Test series of India: India next Test series 2023 appeared first on The SportsRush.","content":"Next Test series of India: Team India will not play a Test series until the completion of the T20 World Cup in Australia this year. To remark that England chased down their highest ever target in Test match history against India at the Edgbaston Cricket Ground, would be a massive understatement. The Joe Root–Jonny Bairstow juggernaut which wrecked havoc on the Indian bowlers on Day 4, managed to deflate whatever spirits remained in the Indian camp on the final day, to register a 7-wicket victory while returning back unscathed only after stitching a 315-ball 269-run stand for the 4th wicket. While Bairstow (114*) smashed his 12th Test ton, and his sixth this year – the joint-most for an English player in a calendar year, Root (142*) went on to score his 5th Test century this year as well, to further strengthen their position at the top of the list of highest run-scorers in 2022. As for team India, they lost a golden opportunity to win their first away Test series victory versus England since 2007, especially after remaining in the driver’s seat on the first three days of the Test. Thus, just like every thing comes to an end, this wonderfully contested series too ended at a 2-2 stalemate, with the action to now shift towards the limited-Overs series starting tomorrow, with the 3-match T20I series. The 8th largest run-chase in history has been a stroll in the park. Bat hasn’t faced a challenge from the ball for the last 200 runs — Harsha Bhogle (@bhogleharsha) July 5, 2022 Next Test series of India With the Asia Cup set to be played in the T20 format in August-September this year, followed by the T20 World Cup in Australia, team India would now focus all its attention especially towards the shortest format of the game. Thus the Rohit Sharma-led side would play their next Test series only after the T20 World Cup, with a two-match away Test series versus Bangladesh in November-December 2022. After the completion of the three-match ODI and T20I series against England by July 17, the team would tour West Indies for a three-match ODI and five-match T20I series. Australia is also slated to tour India in October-November this year, for three T20Is and a four-match Test series. However, it is learnt that the Tests would be played later in February-March in 2023. The schedule for the same, however, has not been announced as yet. The post Next Test series of India: India next Test series 2023 appeared first on The SportsRush.","pubDate":"2022-07-05 19:03:14","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG, 5th Test: Three Things We Learned From England's Historic Win","link":"https://sports.ndtv.com/cricket/india-vs-england-5th-test-three-things-we-learned-from-englands-historic-win-3130938","keywords":null,"creator":null,"video_url":null,"description":"England successfully chased down a target of 378 runs against India, their highest-ever in Test cricket.","content":"England defeated India in thrilling fashion to win the Covid-delayed fifth Test at Edgbaston on Tuesday by seven wickets. Set 378, more than any other England team have made in the fourth innings to win a Test, the hosts achieved their target with more than two sessions to spare as Joe Root (142 not out) and Jonny Bairstow (114 not out) saw them to a victory that ensured the five-match series ended level at 2-2. AFP Sport looks at three things we learned from an enthralling contest: No target off limits for EnglandCricket followers may have to revise their concept of a 'stiff chase' if England keep batting like this in the fourth innings of a Test. England's pursuit of 378 in Birmingham followed successful chases of 277, 299 and 296 during a 3-0 whitewash of world champions New Zealand and this latest success means they have now won all four of their Tests under the new leadership duo of captain Ben Stokes and coach Brendon McCullum . The in-form Root and Bairstow batted superbly, but one of the most impressive aspects of the Edgbaston run-chase was the performance of the struggling Alex Lees and Zak Crawley , who shared a century opening stand in 19.5 overs -- the fastest in England Test history. Kohli theatrics no substitute for runsIndia star Virat Kohli is one of the outstanding batsmen of his generation as evidenced by a record of over 8,000 runs including 27 hundreds at an average of nearly 50 from 102 Tests. But scores of 11 and 20 at Edgbaston mean he has not scored an international century in any format since 2019, with the 33-year-old having just endured his worst IPL season for 13 years. His attempts, while fielding, to wind up the England batsmen in Birmingham saw Kohli spoken to by the umpires. But few international players allow themselves to be 'talked out' and former India captain Kohli's actions looked like those of a man desperately trying to compensate for a lack of runs. Promoted Slow play a blight on the gameEntertaining as much of the play was, there were times when both England and India were guilty of deliberately slowing the game down, particularly when batsmen tried to wind down the clock near the end of a day's play to ensure they did not face a full allocation of overs. India were, however, fined 40 percent of their match fee and docked two World Test Championship points for maintaining a slow over-rate.","pubDate":"2022-07-05 17:19:06","image_url":"https://c.ndtvimg.com/2022-07/aubp8m6g_joe-root-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Womens Hockey World Cup: भारतीय महिला हॉकी टीम ने लगातार दूसरा ड्रॉ खेला, चीन के खिलाफ मैच 1-1 से बराबर","link":"https://www.abplive.com/sports/fih-womens-hockey-world-cup-2022-india-1-1-draw-against-china-vandana-katariya-scorer-for-india-2161687","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>FIH Womens Hockey World Cup 2022:</strong> महिला हॉकी विश्व कप में भारत (India) को अभी भी अपनी पहली जीत का इंतजार है. टीम ने मंगलवार को पूल बी में चीन (China) के खिलाफ लगातार दूसरा ड्रा खेला. इससे पहले भारत ने इंग्लैंड से भी 2-2 से ड्रा खेला था. भारत को अपना आखिरी मुकाबला गुरुवार को न्यूजीलैंड से खेलना है.&nbsp;</p> <p style=\"text-align: justify;\"><strong>वंदना कटारिया ने दागा गोल</strong></p> <p style=\"text-align: justify;\">तोक्यो ओलंपिक में चौथे स्थान पर रही भारतीय टीम (India) के खिलाफ चीन (China) की झेंग जियाली ने 26वें मिनट में गोल दागा. भारत के लिये बराबरी का गोल 45वें मिनट में वंदना कटारिया (Vandana Katariya) ने किया जब पेनल्टी कॉर्नर पर गुरजीत कौर के पास से गेंद उनकी स्टिक से टकराई. वंदना ने इंग्लैंड के खिलाफ भी गोल कर टीम इंडिया को हार से बचाया था.&nbsp;</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Q3: 45' IND 1-1 CHN<br /><br />Third quarter break and it's all square at one.<br />📸: <a href=\"https://twitter.com/WorldSportPics_?ref_src=twsrc%5Etfw\">@WorldSportPics_</a> <br /><br />Download the <a href=\"https://t.co/71D0pOH5QG\">https://t.co/71D0pOH5QG</a> App for all the updates.<a href=\"https://twitter.com/hashtag/HWC2022?src=hash&amp;ref_src=twsrc%5Etfw\">#HWC2022</a> <a href=\"https://twitter.com/hashtag/HockeyEquals?src=hash&amp;ref_src=twsrc%5Etfw\">#HockeyEquals</a> <a href=\"https://twitter.com/hashtag/INDvCHN?src=hash&amp;ref_src=twsrc%5Etfw\">#INDvCHN</a> <a href=\"https://t.co/qAk5a5Uoq0\">pic.twitter.com/qAk5a5Uoq0</a></p> &mdash; International Hockey Federation (@FIH_Hockey) <a href=\"https://twitter.com/FIH_Hockey/status/1544347089793978368?ref_src=twsrc%5Etfw\">July 5, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>मौके बने पर गोल नहीं हुआ</strong></p> <p style=\"text-align: justify;\">पहले दो क्वार्टर में गेंद पर नियंत्रण में भारत (India) का पलड़ा भारी रहा और उसने कई मौके भी बनाये लेकिन गोल में नहीं बदल सके. दूसरी ओर चीनी (China) खिलाड़ियों ने जवाबी हमले बोलकर भारतीय डिफेंस में सेंध लगाई. नौवें मिनट में नवनीत कौर ने गोल पर पहला हमला बोला जिसे चीनी गोलकीपर लियू पिंग ने बचा लिया.&nbsp;</p> <p style=\"text-align: justify;\"><strong>पेनल्टी कॉर्नर मिले लेकिन गोल नहीं हो सका</strong></p> <p style=\"text-align: justify;\">भारत (India) 23वें मिनट में गोल करने के करीब पहुंचा लेकिन गेंद गोलपोस्ट से टकरा गई. रिबाउंड पर ज्योतिका ने गोल किया लेकिन रेफरल के बाद उसे अमान्य करार दिया गया. भारत को इसके तुरंत बाद पेनल्टी कॉर्नर मिला जो बेकार गया. हाफटाइम तक चीन (China) ने एक गोल की बढ़त बना ली थी. दूसरे हाफ में भारत को 42वें मिनट में लगातार दो पेनल्टी कॉर्नर मिले लेकिन गोल नहीं हो सका.&nbsp;</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-1st-t20-indian-team-started-practice-before-first-t20-against-england-2161678\">टी20 सीरीज के लिए Ageas Bowl पहुंची टीम इंडिया, हार्दिक-चहल और कार्तिक समेत इन खिलाड़ियों ने शुरू की प्रैक्टिस</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-wi-many-senior-indian-players-may-be-rested-for-west-indies-tour-2161648\">IND vs WI: भारत के वेस्टइंडीज दौरे को लेकर आया बड़ा अपडेट, कई सीनियर खिलाड़ी नहीं आएंगे नज़र</a></strong></p>","content":null,"pubDate":"2022-07-05 17:14:35","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"टी20 सीरीज के लिए Ageas Bowl पहुंची टीम इंडिया, हार्दिक-चहल और कार्तिक समेत इन खिलाड़ियों ने शुरू की प्रैक्टिस","link":"https://www.abplive.com/sports/cricket/ind-vs-eng-1st-t20-indian-team-started-practice-before-first-t20-against-england-2161678","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>IND vs ENG 1st T20:</strong> भारतीय टीम (INDIA) इन दिनों इंग्लैंड (ENGLAND) के दौरे पर है. टेस्ट में हार के बाद अब भारत और इंग्लैंड के बीच 7 जुलाई से टी20 सीरीज शुरू होने जा रही है. सीरीज का पहला मुकाबला द रोज़ बाउल, साउथेम्प्टन (The Rose Bowl, Southampton) में रात 10:30 बजे शुरू होगा. इस मैच के लिए भारतीय टीम ने प्रैक्टिस शुरू कर दी है. टीम इंडिया की प्रैक्टिस का वीडियो सोशल मीडिया पर वायरल हो रहा है. वीडियो में भारतीय खिलाड़ी नेट पर अभ्यास करते नजर आ रहे हैं.</p> <p style=\"text-align: justify;\"><strong>पहले टी20 में इन खिलाड़ियों को आराम</strong><br />पहले टी20 के लिए कई खिलाड़ियों को आराम दिया गया है. यह खिलाड़ी दूसरे टी20 से भारतीय टीम का हिस्सा होंगे. विराट कोहली, जसप्रीत बुमराह, रविंद्र जडेजा, श्रेयस अय्यर और ऋषभ पंत जैसे दिग्गज खिलाड़ियों को पहले टी20 के लिए टीम में जगह नहीं मिली है. ऋतुराज गायकवाड़, संजू सैमसन, राहुल त्रिपाठी, वेंटकेश अय्यर और अर्शदीप को पहले टी20 के लिए टीम इंडिया में जगह मिली है. वहीं आखिरी टेस्ट में कोरोना पॉजिटिव होने के कारण कप्तानी नहीं करने वाले रोहित शर्मा की अब बतौर कप्तान वापसी हो रही है.&nbsp;</p> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">.<a href=\"https://twitter.com/BCCI?ref_src=twsrc%5Etfw\">@BCCI</a> have arrived at The Ageas Bowl ahead of the first T20 international against <a href=\"https://twitter.com/englandcricket?ref_src=twsrc%5Etfw\">@englandcricket</a> on Thursday 🙌<br /><br />Go behind the scenes as the team began preparations for what should be a mouth-watering contest 😮&zwj;💨<a href=\"https://twitter.com/hashtag/ENGvIND?src=hash&amp;ref_src=twsrc%5Etfw\">#ENGvIND</a><a href=\"https://twitter.com/hardikpandya7?ref_src=twsrc%5Etfw\">@hardikpandya7</a> | <a href=\"https://twitter.com/IamSanjuSamson?ref_src=twsrc%5Etfw\">@IamSanjuSamson</a> <a href=\"https://t.co/Xax1xSfWr6\">pic.twitter.com/Xax1xSfWr6</a></p> &mdash; The Ageas Bowl (@TheAgeasBowl) <a href=\"https://twitter.com/TheAgeasBowl/status/1544342854192877568?ref_src=twsrc%5Etfw\">July 5, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>पहले टी20 मैच का शेड्यूल</strong></p> <ul> <li style=\"text-align: justify;\">मैच- पहला टी20&nbsp;</li> <li style=\"text-align: justify;\">तारीख- 7 जुलाई 2022</li> <li style=\"text-align: justify;\">समय- 10:30 pm (भारतीय समयनुसार)</li> <li style=\"text-align: justify;\">स्थान- रोज बाउल क्रिकेट ग्राउंड&nbsp;</li> </ul> <blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Poetry in motion... 😍🙌<a href=\"https://twitter.com/BhuviOfficial?ref_src=twsrc%5Etfw\">@BhuviOfficial</a> <a href=\"https://t.co/K9czPXmVFE\">pic.twitter.com/K9czPXmVFE</a></p> &mdash; The Ageas Bowl (@TheAgeasBowl) <a href=\"https://twitter.com/TheAgeasBowl/status/1544312649898418178?ref_src=twsrc%5Etfw\">July 5, 2022</a></blockquote> <p> <script src=\"https://platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p> <p style=\"text-align: justify;\"><strong>पहले टी20 के लिए भारतीय टीम</strong><br />राहुल त्रिपाठी, रोहित शर्मा (कप्तान), ऋतुराज गायकवाड़, सूर्यकुमार यादव, अक्षर पटेल, दीपक हुड्डा, हार्दिक पांड्या, वेंकटेश अय्यर, दिनेश कार्तिक (विकेटकीपर), ईशान किशन, संजू सैमसन, अर्शदीप सिंह, आवेश खान, भुवनेश्वर कुमार, हर्षल पटेल, रवि बिश्नोई, उमरान मलिक, युजवेंद्र चहल.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-wi-many-senior-indian-players-may-be-rested-for-west-indies-tour-2161648\">IND vs WI: भारत के वेस्टइंडीज दौरे को लेकर आया बड़ा अपडेट, कई सीनियर खिलाड़ी नहीं आएंगे नज़र</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-5th-test-india-docked-two-wtc-points-for-slow-overrate-at-edgbaston-2161616\">IND vs ENG: Team India को लगा डबल झटका, एजबेस्टन में हार के बाद ICC ने की बड़ी कार्रवाई</a></strong></p>","content":null,"pubDate":"2022-07-05 16:39:08","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs ENG: एजबेस्टन में भारत को हराने के बाद बेन स्टोक्स ने दिया बड़ा बयान, बोले- हम टेस्ट क्रिकेट को...","link":"https://www.abplive.com/sports/cricket/ind-vs-eng-we-are-trying-to-rewrite-how-test-cricket-is-played-in-england-ben-stokes-2161667","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India vs England 5th Test, Ben Stokes:</strong> एजबेस्टन में भारत के खिलाफ पांचवें रिशेड्यूल टेस्ट को सात विकेट से जीतने के बाद इंग्लैंड के कप्तान बेन स्टोक्स ने कहा कि उनकी टीम देश में टेस्ट क्रिकेट खेलने के तरीके को फिर से खोजने की कोशिश कर रही है. स्टोक्स और हेड कोच ब्रेंडन मैकुलम के कार्यभार संभालने के बाद से इंग्लैंड टीम लगातार शानदार प्रदर्शन कर रही है.&nbsp;</p> <p style=\"text-align: justify;\">स्टोक्स को टेस्ट के पांचवें दिन बल्लेबाजी करने की जरूरत नहीं पड़ी, क्योंकि जो रूट (173 गेंदों में नाबाद 142 रन) और जॉनी बेयरस्टो (145 गेंदों में नाबाद 114 रन) ने मंगलवार को एक डेढ़ घंटे में आवश्यक 119 रन बनाए. 378 रन के रिकॉर्ड का पीछा करने के लिए, टेस्ट क्रिकेट में उनका अब तक का सर्वोच्च स्कोर और एजबेस्टन टेस्ट को सात विकेट से जीतकर पटौदी ट्रॉफी 2-2 के लिए श्रृंखला ड्रा की.</p> <p style=\"text-align: justify;\">स्टोक्स ने कहा, \"हम फिर से टेस्ट क्रिकेट खेलने के तरीकों को खोजने की कोशिश कर रहे हैं कि टेस्ट क्रिकेट कैसे खेला जा रहा है, विशेष रूप से इंग्लैंड में. हम जानते हैं कि हम टेस्ट क्रिकेट को नया जीवन देना चाहते हैं, और समर्थन भी अविश्वसनीय रहे हैं. हम टेस्ट क्रिकेट में प्रशंसकों का एक नया सेट ला रहे हैं. हम एक छाप छोड़ना चाहते हैं.\"</p> <p style=\"text-align: justify;\">स्टोक्स ने स्वीकार किया कि घरेलू गर्मी शुरू करने से पहले, टेस्ट मैच की चौथी पारी में 378 रनों का पीछा करने में इंग्लैंड को थोड़ी झिझक थी, लेकिन रूट और बेयरस्टो के प्रयासों की बदौलत हम जीत गए.</p> <p style=\"text-align: justify;\">इंग्लैंड की जीत की अगुवाई कर रहे सीनियर बल्लेबाजों रूट और बेयरस्टो के बीच स्टोक्स ने एलेक्स लीज और जैक क्रॉली की सलामी जोड़ी की तारीफ की, जिन्होंने मेजबान टीम को 21.3 ओवर में 107 रन बनाकर शानदार शुरुआत दी थी.</p> <p><strong>ये भी पढ़ें...</strong></p> <p><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-5th-test-india-docked-two-wtc-points-for-slow-overrate-at-edgbaston-2161616\">IND vs ENG: Team India को लगा डबल झटका, एजबेस्टन में हार के बाद ICC ने की बड़ी कार्रवाई</a></strong></p> <p><strong><a href=\"https://www.abplive.com/sports/cricket/india-vs-england-edgbaston-test-match-result-what-is-bazball-in-cricket-brendon-mccullum-aggreasive-cricekt-2161587\">IND vs ENG: इंग्लैंड ने टेस्ट में की वनडे वाली बैटिंग तो ट्रेंड होने लगा Bazball, जानिए क्या है इसका मतलब</a></strong></p>","content":null,"pubDate":"2022-07-05 16:18:13","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"IND vs WI: भारत के वेस्टइंडीज दौरे को लेकर आया बड़ा अपडेट, कई सीनियर खिलाड़ी नहीं आएंगे नज़र","link":"https://www.abplive.com/sports/cricket/ind-vs-wi-many-senior-indian-players-may-be-rested-for-west-indies-tour-2161648","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>India tour of West Indies:</strong> इंग्लैंड दौरे के बाद भारतीय टीम (India) वेस्टइंडीज (West Indies) का दौरा करेगी. इस दौरे पर दोनों टीमों के बीच 3 वनडे और 5 टी20 मुकाबले खेले जाएंगे. क्रिकबज की खबर के अनुसार इस दौरे पर कई सीनियर भारतीय खिलाड़ियों को आराम दिया जा सकता है. टीम मैनेजमेंट युवाओं को इस सीरीज में मौका देगा, वहीं टीम की कमान रेगुलर कप्तान रोहित शर्मा (Rohit Sharma) के हाथों में ही रहेगी.</p> <p style=\"text-align: justify;\"><strong>जल्द होगा टीम का एलान</strong><br />विंडीज दौरे पर किन खिलाड़ियों को आराम दिया जाएगा यह अभी तय नहीं है. लेकिन खबरों के मुताबिक इसमें कई सीनियर खिलाड़ी शामिल होंगे. इस दौरे के लिए जल्द ही भारतीय टीम का एलान कर दिया जाएगा. चीफ सिलेक्टर चेतन शर्मा इंग्लैंड में ही टीम के साथ मौजूद हैं, ऐसे में वह अब रोहित शर्मा, विराट कोहली, जसप्रीत बुमराह और ऋषभ पंत से चर्चा कर सकते हैं. वेस्टइंडीज दौरे के लिए रोहित शर्मा ही भारतीय टीम के कप्तान रह सकते हैं.</p> <p style=\"text-align: justify;\"><strong>भारत का वेस्टइंडीज दौरा</strong><br />भारत और वेस्टइंडीज (West Indies vs India) के बीच वनडे सीरीज की शुरुआत 22 जुलाई से होगी. पहला वनडे 22 को, दूसरा 24 को और तीसरा 27 जुलाई को खेला जाएगा. सभी मुकाबले क्वींस पार्क ओवल, पोर्ट ऑफ स्पेन, त्रिनिदाद में खेले जाएंगे. वहीं पहला टी20 29 जुलाई को और आखिरी 7 अगस्त को खेला जाएगा.</p> <p style=\"text-align: justify;\"><strong>वनडे सीरीज का शेड्यूल</strong></p> <ul> <li style=\"text-align: justify;\"><strong>पहला वनडे:</strong> 22 जुलाई, क्वींस पार्क ओवल, पोर्ट ऑफ स्पेन, त्रिनिदाद</li> <li style=\"text-align: justify;\"><strong>दूसरा वनडे:</strong> 24 जुलाई, क्वींस पार्क ओवल, पोर्ट ऑफ स्पेन, त्रिनिदाद</li> <li style=\"text-align: justify;\"><strong>तीसरा वनडे:</strong> 27 जुलाई, क्वींस पार्क ओवल, पोर्ट ऑफ स्पेन, त्रिनिदाद</li> </ul> <p style=\"text-align: justify;\"><strong>टी20 सीरीज का शेड्यूल</strong></p> <ul> <li style=\"text-align: justify;\"><strong>पहला टी20:</strong> 29 जुलाई, ब्रायन लारा स्टेडियम, तारौबा, त्रिनिदाद</li> <li style=\"text-align: justify;\"><strong>दूसरा टी20:</strong> 1 अगस्त, वार्नर पार्क, बस्सेटर, सेंट किट्सो</li> <li style=\"text-align: justify;\"><strong>तीसरा टी20:</strong> 2 अगस्त, वार्नर पार्क, बस्सेटर, सेंट किट्सो</li> <li style=\"text-align: justify;\"><strong>चौथा टी20:</strong> 6 अगस्त, सेंट्रल ब्रोवार्ड रीजनल पार्क स्टेडियम टर्फ ग्राउंड, लॉडरहिल, फ्लोरिडा</li> <li style=\"text-align: justify;\"><strong>पांचवां टी20:</strong> 7 अगस्त, सेंट्रल ब्रोवार्ड रीजनल पार्क स्टेडियम टर्फ ग्राउंड, लॉडरहिल, फ्लोरिडा</li> </ul> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-5th-test-india-docked-two-wtc-points-for-slow-overrate-at-edgbaston-2161616\">IND vs ENG: Team India को लगा डबल झटका, एजबेस्टन में हार के बाद ICC ने की बड़ी कार्रवाई</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/india-vs-england-edgbaston-test-match-result-what-is-bazball-in-cricket-brendon-mccullum-aggreasive-cricekt-2161587\">IND vs ENG: इंग्लैंड ने टेस्ट में की वनडे वाली बैटिंग तो ट्रेंड होने लगा Bazball, जानिए क्या है इसका मतलब</a></strong></p>","content":null,"pubDate":"2022-07-05 15:58:17","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Indian cricket team drops below Pakistan in WTC points table, Penalized two points for maintaining slow over-rate","link":"https://www.dnaindia.com/cricket/report-indian-cricket-team-drops-below-pakistan-in-wtc-points-table-penalized-two-points-for-slow-over-rate-2966211","keywords":["Sports","Cricket"],"creator":["DNA Web Team"],"video_url":null,"description":"India was on Tuesday penalized two ICC World Test Championship points for maintaining a slow over-rate against England in the rescheduled fifth Test.","content":null,"pubDate":"2022-07-05 15:49:00","image_url":"https://cdn.dnaindia.com/sites/default/files/styles/third/public/2022/07/06/2520090-fotojet-4.jpg","source_id":"dnaindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG: 11 महीने में पूरी हुई टेस्ट सीरीज, अंतिम मैच में हारी टीम इंडिया, जानें क्या रहा हर मैच का रिज़ल्ट","link":"https://www.abplive.com/sports/cricket/the-5-test-series-between-india-and-england-was-tied-2-2-after-england-win-the-edgbaston-test-2161637","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>INDIA-ENGLAND SERIES RECORD:</strong> एजबेस्टन टेस्ट में भारतीय टीम को हार का सामना करना पड़ा है. इस तरह यह सीरीज 2-2 से बराबरी पर छूटा. दरअसल, यह सीरीज पिछले साल 4 अगस्त को शुरू हुआ था, जबकि 5 जुलाई 2022 को पूरी हुई. भारतीय टीम के पास 15 साल बाद इंग्लैंड में सीरीज जीतने का मौका था, लेकिन भारतीय टीम इस मौके को नहीं भुना पाई. आईये नजर डालते हैं, इस सीरीज में क्या-क्या खास हुआ.</p> <p style=\"text-align: justify;\"><strong>पहला टेस्ट</strong><br />इस सीरीज का पहला टेस्ट नॉटिंघम में खेला जाएगा. यह मैच ड्रॉ पर खत्म हुआ. मेजबान इंग्लैंड पहली पारी में महज 183 रनों पर सिमट गई थी. भारतीय टीम ने पहली पारी में 278 रन बनाए. वहीं, दूसरी पारी में इंग्लैंड ने 303 रन बनाए, इस तरह भारतीय टीम को मैच जीतने के लिए 209 रनों का लक्ष्य मिला. भारतीय टीम ने दूसरी पारी में 1 विकेट पर 52 रन बनाए. इस तरह यह मैच ड्रॉ पर समाप्त हुआ. दूसरी पारी में 109 रनों की शानदार पारी खेलने वाले जो रूट को मैन ऑफ द मैच चुना गया.</p> <p style=\"text-align: justify;\"><strong>दूसरा टेस्ट</strong><br />भारत-इंग्लैंड सीरीज का दूसरा टेस्ट लॉड्स में खेला गया. इस मैच में भारत ने पहले बल्लेबाजी करते हुए 364 रन बनाए. जवाब में इंग्लैंड ने 391 रन बना डाले. भारत ने 8 विकेट पर 298 रन बनाकर दूसरी पारी घोषित कर दी. इस तरह इंग्लैंड को जीत के लिए 272 रनों का लक्ष्य मिला, लेकिन मेजबान टीम महज 120 रनों पर सिमट गई. भारतीय टीम ने 151 रनों से मैच अपने नाम कर लिया. शतकीय पारी खेलने वाले भारतीय ओपनर केएल राहुल को मैन ऑफ द मैच चुना गया.</p> <p style=\"text-align: justify;\"><strong>तीसरा टेस्ट</strong><br />तीसरा टेस्ट हेडिंग्ले, लीड्स में खेला गया. इस मैच में भारतीय टीम ने टॉस जीतकर पहले बल्लेबाजी करने का फैसला किया, लेकिन पूरी टीम महज 78 रनों पर सिमट गई. जिसके जवाब में मेजबान टीम ने 432 रन बना डाले. भारतीय टीम दूसरी पारी में 278 रनों पर ऑलआउट हो गई. इस तरह मेजबान इंग्लैंड ने पारी और 76 रनों से मैच अपने नाम कर लिया. इंग्लैंड के रॉबिंसन को प्लेयर ऑफ द मैच चुना गया.</p> <p style=\"text-align: justify;\"><strong>चौथा टेस्ट</strong><br />लंदन के केनिंगटन ओवल में मेजबान इंग्लैंड ने टॉस जीतकर पहले गेंदबाजी का फैसला किया, जिसके बाद पूरी भारतीय टीम महज 191 रनों पर सिमट गई. मेजबान इंग्लैंड ने 191 रनों के जवाब में 290 रन बनाए. वहीं, भारतीय टीम ने दूसरी पारी में वापसी करते हुए 466 रन बनाए. मेजबान टीम चको जीत के लिए 268 रनों का लक्ष्य मिला, लेकिन पूरी टीम महज 210 रनों पर सिमट गई. इस तरह भारत ने 57 रनों से मैच अपने नाम कर लिया. रोहित शर्मा को प्लेयर ऑफ द मैच चुना गया.</p> <p style=\"text-align: justify;\"><strong>पांचवां टेस्ट</strong><br />एजबेस्टन में खेले गए सीरीज के इस आखिरी मैच में भारती टीम ने पहले बल्लेबाजी करते हुए 416 रन बनाए, जिसके जवाब में मेजबान टीम 284 रनों पर सिमट गई. भारत के लिए पहली पारी में ऋषभ पंत ने 146 और रवींद्र जडेजा ने 104 रन बनाए. वहीं, दूसरी पारी में भारतीय टीम 245 रनों पर सिमट गई. इस तरह इंग्लैंड को जीत के लिए 378 रनों का लक्ष्य मिला. मेजबान टीम ने जॉनी बेयरस्टो और जो रूट की शतकीय पारी की बदौलत आसानी से मैच अपने नाम कर लिया. दोनों पारियों में शतक लगाने वाले जॉनी बेयरस्टो को मैन ऑफ द मैच चुना गया.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें-</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-5th-test-india-docked-two-wtc-points-for-slow-overrate-at-edgbaston-2161616\">IND vs ENG: Team India को लगा डबल झटका, एजबेस्टन में हार के बाद ICC ने की बड़ी कार्रवाई</a><br /></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/ind-vs-eng-coach-rahul-dravid-blamed-it-for-edgbaston-defeat-told-where-did-team-india-go-wrong-2161608\">IND vs ENG: कोच राहुल द्रविड़ ने इसे ठहराया एजबेस्टन की हार का जिम्मेदार, बताया- कहां हुई टीम इंडिया से गलती</a><br /></strong></p>","content":null,"pubDate":"2022-07-05 15:48:44","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"I have brought Eoin Morgan's mentality and his ethos around cricket into this Test environment: Ben Stokes","link":"https://www.indiatoday.in/sports/cricket/story/i-have-brought-eoin-morgan-s-mentality-and-his-ethos-around-cricket-into-this-test-environment-ben-stokes-1970680-2022-07-05?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Stokes says he has brought Morgan's 'mentality and ethos' into Test team","content":null,"pubDate":"2022-07-05 15:38:34","image_url":null,"source_id":"indiatoday","country":["india"],"category":["sports"],"language":"english"},{"title":"ICC WTC Points Table 2023: ICC Test Championship points table 2022 to 2023","link":"https://thesportsrush.com/cricket-news-icc-wtc-points-table-2023-icc-test-championship-points-table-2022-to-2023/","keywords":["Cricket","India tour of England 2022","World Test Championship 2021-23","WTC"],"creator":["Gurpreet Singh"],"video_url":null,"description":"ICC WTC Points Table 2023: India lose two crucial WTC points in the ongoing cycle for maintaining slow Over rate during the Edgbaston Test. To remark that England chased down their highest ever target in their Test match history against India at the Edgbaston Cricket Ground, would be a massive understatement. The Joe Root–Jonny Bairstow… The post ICC WTC Points Table 2023: ICC Test Championship points table 2022 to 2023 appeared first on The SportsRush.","content":"ICC WTC Points Table 2023: India lose two crucial WTC points in the ongoing cycle for maintaining slow Over rate during the Edgbaston Test. To remark that England chased down their highest ever target in their Test match history against India at the Edgbaston Cricket Ground, would be a massive understatement. The Joe Root–Jonny Bairstow juggernaut which wrecked havoc on the Indian bowlers yesterday, managed to deflate whatever spirits remained in the Indian camp on the final day, to register a 7-wicket victory while returning back unscathed only after stitching a 315-ball 269-run stand for the 4th wicket. A new era of Test cricket #ENGvIND pic.twitter.com/lLpAtG4fgR — England Cricket (@englandcricket) July 5, 2022 While the Indian bowlers looked uncharacteristically clueless in their bid to find the answer to the near flawless display of English batsmenship, they not only had to surrender after being overwhelmed, but the Jasprit Bumrah-led side also were docked off two World Test Championship (WTC) points of the ongoing 2021-23 cycle, for maintaining a slow Over-rate. ICC WTC Points Table 2023 The development might well prove to be costly for the Indian Cricket team, as far as their hopes of making it through to their second successive WTC finals are concerned. As per Article 16.11.2 of the ICC World Test Championship playing conditions, a team is docked one point for each over short. Team India were found to be two Overs short after the rescheduled fifth Test match in Edgbaston today, and were resultantly penalised with two points. While the team has also been fined with 40% of their match fee for the same reason (20% for each Over short), they have now slipped down to the fourth position in the WTC points table, below Australia, South Africa, and Pakistan with 52.08 percentage points under their belt after 12 matches. ICC Test Championship points table 2022 to 2023 Team India would play a total of six more Test matches – four versus Australia (home) and two against Bangladesh (away) in the WTC 2021-23 cycle. They would have to win all these Tests to make it through to the championship final. Click here to take a look at the updated ICC Test championship points table (2021-23). The post ICC WTC Points Table 2023: ICC Test Championship points table 2022 to 2023 appeared first on The SportsRush.","pubDate":"2022-07-05 15:30:23","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Bumrah after India's loss in Edgbaston Test: We could have been straighter in our bowling lines","link":"https://www.thehansindia.com/sports/cricket/bumrah-after-indias-loss-in-edgbaston-test-we-could-have-been-straighter-in-our-bowling-lines-752046","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"India lost the rescheduled fifth Test by 7 wickets at EdgbastonJonny Bairstow was MoM for scoring twin centuriesThe Test series ended in a 2-2 draw","content":"Bumrah after India’s loss in Edgbaston Test: We could have been straighter in our bowling linesBumrah after India’s loss in Edgbaston Test: We could have been straighter in our bowling linesIndia's stand-in captain Jasprit Bumrah said the bowlers could \"have been straighter in our bowling lines\" after their seven-wicket loss in the Edgbaston Test on Tuesday. The Yorkshire duo of Jonny Bairstow and Joe Root hammered the visiting bowlers as they put up 269 runs for the unbeaten fourth-wicket stand and helped England register their highest successful chase in Test cricket. England chased down 378 runs in 76.4 overs, which was also the highest successful chase against India in the longest format. Speaking at the post-match presentation, Bumrah said that even if you have three good days, it is enough and that's the beauty of Test cricket. \"We fell short with the bat yesterday and that is where we let the opposition in to let the match slip away from us. Ifs and buts can always be there. If you go back, if there was no rain in the first match, we could have won the series. But England played really well. We have drawn the series and both teams played very good cricket and it was a fair result,\" said Bumrah after India's seven-wicket loss. Rishabh Pant and Ravindra Jadeja scored a century each in India's first innings and Bumrah acknowledged the pair's efforts. The stand-in skipper also added that he enjoyed the challenge of captaincy and it was a great experience. \"Pant takes his chances. He and Jaddu got us back into the game with their counter-attack. We were ahead in the game. He takes his chances, backs himself, and I'm very happy for him. Dravid is always there to guide us and back us. We could have been a little straighter in our bowling lines and use the variable bounce. The captaincy future is not what I decide. I like the responsibility. It was a good challenge, a new challenge. It was an honour to lead the team and a great experience,\" added Bumrah.2⃣3⃣ wicketsBest bowling Figures (In Innings): 5⃣/6⃣4⃣An average of 2⃣2⃣.4⃣7⃣#TeamIndia's Player of the Series is @Jaspritbumrah93 👏 👏 #ENGvIND pic.twitter.com/APkOhYC1tJ— BCCI (@BCCI) July 5, 2022 Bumrah was named as India's Player of the Series as the fast bowler finished the five-match Test series with 23 wickets. The victory in the rescheduled fifth Test meant, England drew the series 2-2, denying the Indian team their first Test series victory on English soil since 2007.Well, it took a while but that was worth the wait 🔥Thanks @BCCI for a brilliant series of Test cricket 👏🏴𠁧𠁢𠁥𠁮𠁧𠁿 #ENGvIND 🇮🇳 pic.twitter.com/IRqUwT7apV— England Cricket (@englandcricket) July 5, 2022 Man of the Match Bairstow and Pant were the only two players who scored over 200 runs each in the Birmingham game. Bairstow, who scored twin centuries in the Test, finished with 220 runs, while Pant's runs tally was 203 runs. Root was third in the list with 173 runs.","pubDate":"2022-07-05 15:24:10","image_url":"https://assets.thehansindia.com/h-upload/2022/07/05/500x300_1301351-jasprit-bumrah.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"IND vs ENG: Team India को लगा डबल झटका, एजबेस्टन में हार के बाद ICC ने की बड़ी कार्रवाई","link":"https://www.abplive.com/sports/cricket/ind-vs-eng-5th-test-india-docked-two-wtc-points-for-slow-overrate-at-edgbaston-2161616","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>INDIA vs ENGLAND, slow overrate:</strong> इंग्लैंड (INDIA) के खिलाफ बर्मिंघम (Edgbaston) में खेले गए आखिरी टेस्ट में हार के साथ ही भारत को एक और झटका लगता है. भारतीय टीम तय सीमा के अंदर ओवर को कोटा पूरा नहीं कर सकी, ऐसे में आईसीसी (ICC) ने टीम इंडिया पर कार्रवाई की है. आइसीसी एलीट पैनल के मैच रेफरी डेविड बून ने भारतीय टीम पर जुर्माना लगाया है.</p> <p style=\"text-align: justify;\"><strong>2 अंक काटे गए</strong><br />स्लो ओवर रेट (slow overrate) के लिए आईसीसी (ICC) की आचार संहिता 2.22 के मुताबिक मैच फीस का 40 फीसदी जुर्माने के तौर पर लगाया जाता है. साथ ही आइसीसी विश्व टेस्ट चैंपियनशिप (World Test Championship) की खेल शर्तों के अनुच्छेद 16.11.2 के अनुसार, एक टीम को प्रत्येक ओवर शार्ट के लिए एक अंक का दंड दिया जाता है. चूकि भारत ने तय समय में दो ओवर कम फेंके ऐसे में भारत के कुल अंकों में से दो डब्ल्यूटीसी अंक काट लिए गए हैं.</p> <p style=\"text-align: justify;\"><strong>औपचारिक सुनवाई नहीं होगी</strong><br />एजबेस्टन टेस्ट (Edgbaston Test) के लिए भारतीय टीम के कप्तान जसप्रीत बुमराह (Jasprit Bumrah) ने अपनी गलती मान ली है, ऐसे में अब औपचारिक सुनवाई की कोई जरूरत नहीं है. मैच के दौरान मैदानी अंपायर अलीम डार और रिचर्ड केटलबोरो, थर्ड अंपायर मरैस इरास्मस और चौथे अंपायर एलेक्स व्हार्फ ने भारतीय टीम पर ये आरोप लगाए थे.</p> <p style=\"text-align: justify;\"><strong>7 विकेट से हारा भारत</strong><br />टॉस हारकर पहले बल्लेबाजी करते हुए भारत (INDIA) ने पहली पारी में ऑलआउट होकर 416 रन बनाए थे. जवाब में इंग्लैंड (ENGLAND) की पहली पारी 284 रन पर सिमट गई थी. भारत ने दूसरी पारी में 10 विकेट खोकर 245 रन बनाए. इंग्लैंड ने दूसरी पारी में 3 विकेट के नुकसान पर 378 रन बनाकर आखिरी टेस्ट 7 विकेट से अपने नाम कर लिया. रूट ने 142 और बेयरस्टो (Jonny Bairstow) ने 114 रनों की नाबाद मैच विनिंग पारी खेली. इस मैच में जीत के साथ ही भारत और इंग्लैंड के बीच खेले गए पांच मैचों की टेस्ट सीरीज की समाप्ति 2-2 की बराबरी के साथ हुई. बेयरस्टो को प्लेयर ऑफ द मैच जबकि जो रूट और बुमराह को प्लेयर ऑफ द सीरीज चुना गया.</p> <p style=\"text-align: justify;\"><strong>ये भी पढ़ें...</strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/india-vs-england-edgbaston-test-match-result-what-is-bazball-in-cricket-brendon-mccullum-aggreasive-cricekt-2161587\">IND vs ENG: इंग्लैंड ने टेस्ट में की वनडे वाली बैटिंग तो ट्रेंड होने लगा Bazball, जानिए क्या है इसका मतलब</a></strong></p> <p style=\"text-align: justify;\"><strong><a href=\"https://www.abplive.com/sports/cricket/icc-wtc-points-table-update-india-loss-ind-vs-eng-what-india-needs-qualify-icc-world-test-championship-finals-2161523\">इंग्लैंड के खिलाफ हार के बाद WTC प्वाइंट्स टेबल में टीम इंडिया का बुरा हाल, फाइनल में पहुंचना हुआ मुश्किल</a></strong></p>","content":null,"pubDate":"2022-07-05 15:13:43","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"Cricket-India drop in WTC rankings, Bumrah rues batting after loss","link":"https://www.thestar.com.my/sport/cricket/2022/07/05/cricket-india-drop-in-wtc-rankings-bumrah-rues-batting-after-loss","keywords":null,"creator":null,"video_url":null,"description":"BIRMINGHAM, England (Reuters) - As if the seven-wicket loss against England was not bad enough, India were docked two World Test Championship (WTC) points for their slow over rate in the rearranged fifth test at Edgbaston. Read full story","content":"BIRMINGHAM, England (Reuters) - As if the seven-wicket loss against England was not bad enough, India were docked two World Test Championship (WTC) points for their slow over rate in the rearranged fifth test at Edgbaston. The tourists were found to be two overs behind the over rate which also led to a fine of 40% of the match fees, the governing International Cricket Council (ICC) said in a statement on Tuesday. The points penalty meant India dropped below Pakistan in the WTC rankings to the fourth spot, with Australia at the top followed by South Africa. The top two teams will reach the WTC summit clash. India lost to New Zealand in last year's final of the competition's inaugural edition. India held a 2-1 lead going into the Edgbaston test where England pulled off an epic chase to level the series. The tourists dominated the first three days of the see-saw contest and looked in the box seat with a handy lead of 132 on a pitch with variable bounce. They could not capitalise on it though, and England pulled off their highest successful chase with two sessions to spare. Makeshift captain Jasprit Bumrah blamed the loss on India's poor batting in the second innings when they were all out for 245. \"I think yesterday we fell short with the bat, and we had to come back with the ball,\" Bumrah said. \"That is the phase where we let the opposition in, and the momentum kept shifting away from us.\" Bumrah was put in charge of the side after regular skipper Rohit Sharma tested positive for COVID-19. That also meant India had to send Cheteshwar Pujara, who bats at number three, to partner Shubman Gill at the top of the order. \"They played better than us in the second innings and won the game,\" Bumrah said. \"So yeah, hard-fought series, but that's the ideal result, isn't it? Both teams played good cricket.\" (Reporting by Amlan Chakraborty in New Delhi; editing by Clare Fallon)","pubDate":"2022-07-05 15:11:00","image_url":"https://apicms.thestar.com.my/uploads/images/2022/07/05/1648550.jpg","source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"England cricket Tests 2022 results: England Test matches 2022 all match result","link":"https://thesportsrush.com/cricket-news-england-cricket-tests-2022-results-england-test-matches-2022-all-match-result/","keywords":["Cricket","England"],"creator":["Dixit Bhargav"],"video_url":null,"description":"England cricket Tests 2022 results: England have made amends to their form in Test cricket during the ongoing summer season. England captain Ben Stokes has credited batters Joe Root and Jonny Bairstow for their individual centuries played a vital role in the team sealing a record-breaking 378-run chase against India in Birmingham today. Stokes, who… The post England cricket Tests 2022 results: England Test matches 2022 all match result appeared first on The SportsRush.","content":"England cricket Tests 2022 results: England have made amends to their form in Test cricket during the ongoing summer season. England captain Ben Stokes has credited batters Joe Root and Jonny Bairstow for their individual centuries played a vital role in the team sealing a record-breaking 378-run chase against India in Birmingham today. Stokes, who talked about his job becoming easier due to heroic effort such as a match-winning 315-ball 269-run fourth-wicket partnership between Root and Bairstow, also acknowledged hard work put in by opening batters Alex Lees and Zac Crawley during a 107-run opening partnership yesterday. “When you have clarity like we have in the dressing room, it makes chasing totals like this easier. 378 would have been scary five weeks ago but now it’s all good,” Stokes told Sky Sports after England beat India by 7 wickets to draw level the five-match series 2-2 . That was fun! 😃 pic.twitter.com/B17LekvZXL — Joe Root (@root66) July 5, 2022 “Jonny [Bairstow] and [Joe] Root will get all the credit but the precedent was set up by the way the openers played against [Jasprit] Bumrah and [Mohammed] Shami with the new ball. It is all about taking wickets and taking ten wickets.” England, who’ve entered the Bazball era under new head coach Brendon McCullum, have become the first-ever team to seal four consecutive 250+ run-chases in Test cricket. England’s refreshing approach to Test cricket has seen them turning the tables in the ongoing summer season. Having lost two and drawn three out of their first five Test matches in 2022, England have now won four on the trot since the arrival of McCullum. “We are trying to rewrite how Test cricket is played in England. All our plans from the last four-five weeks is what we want to take ahead. Bowling on the top of off isn’t important, it is all about taking ten wickets. We know that we want to give some new life to Test cricket,” Stokes added. Set to host South Africa for a three-match Test series at the end of the English summer, it would be interesting to see how the same pans out for England.","pubDate":"2022-07-05 14:58:50","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"IND vs ENG, 5th Test: Virat Kohli trolled by England Cricket, Indian fans hit back - Check Here","link":"https://zeenews.india.com/cricket/ind-vs-eng-5th-test-virat-kohli-trolled-by-england-cricket-indian-fans-hit-back-check-here-2481913.html","keywords":null,"creator":null,"video_url":null,"description":"Riding on twin century by Jonny Bairstow England won the fifth Test and levelled the series 2-2.","content":"Former India captain Virat Kohli was trolled by England Cricket Board's official Twitter handle after Team India's 7-wicket loss against the host in the fifth Test at the Edgbaston, Birmingham on Tuesday. England's official Twitter handle, England Cricket posted two photos of Virat where the Indian can be seen shushing English wicket-keeper batsman Jonny Bairstow in the 2nd innings of the match while in the second photo Virat can be seen hugging Jonny after losing the match. Here's what England Cricket posted with an emoji displaying zip on the mouth. pic.twitter.com/yg5IoEe4W3 — England Cricket (@englandcricket) July 5, 2022 However, Indian cricket fans hit back at England Cricket, reminding them what Virat Kohli has done in the past. Here are some Tweets. England just won a match & still series 2-2. That too home series! Unnecessary drama by English admin ___ — Jackson Dass Antony (@AJacksonDass) July 5, 2022 Share this also in your handle ! pic.twitter.com/QeLhlw7Mmp — Kollywood Trolls (@KollywoodTrolIs) July 5, 2022 Bro you have just Drawn the Series vat ur Home _____. Dont act like won the series — Declan Harp (@MasterDeclan7) July 5, 2022 He's bigger than your cricket team . Have some shame and sit back down _____ — _ _ (@FfsAditya) July 5, 2022 I think you forgot the past — VIRAT KOHLI (@VIRATKO20821614) July 5, 2022 Even Official Handles use Kohli to get reach. Shows the obsession — Priyanshu Bhattacharya _ (@im_Priyanshu_B7) July 5, 2022 We can't expect that like things from official page . it's just ridiculous, nothing else. how can you troll the best player of the modern era? Virat is known for giving it back . Just wait for limited overs series.I surely he will give his reply with his bat. Stay strong Skippy — Zia Sherani____ (@Mr_Zia_Sherani) July 5, 2022 Your Jonny is not even close to the King Kohli when it comes to all formats so you better _ — DK017 (@deepakdorai77) July 5, 2022","pubDate":"2022-07-05 14:58:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"ENG vs IND: India drop below Pakistan in WTC 2021-23 table after loss in Edgbaston Test","link":"https://www.thehansindia.com/sports/cricket/eng-vs-ind-india-drop-below-pakistan-in-wtc-2021-23-table-after-loss-in-edgbaston-test-752043","keywords":["Sports,Cricket"],"creator":["Ishka"],"video_url":null,"description":"England defeated India by 7 wickets in the Edgbaston TestThe five-match series ended in a 2-2 drawIndia have dropped to No. 4 in the WTC table","content":"ENG vs IND: India drop below Pakistan in WTC 2021-23 table after loss in Edgbaston Test The Indian team has dropped below Pakistan to No. 4 in the World Test Championship (WTC) 2021-23 cycle. India were docked two points and fined 40% of their match fee for maintaining a slow overrate during their seven-wicket defeat to England in the Edgbaston Test. Match referee David Boon, who imposed the sanction on the visiting side, declared that Jasprit Bumrah and Co were two overs short. In accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel which relates to minimum over-rate offences, players are fined 20% of their match fee for every over their side fails to bowl in the allotted time. In addition, as per Article 16.11.2 of the ICC WTC playing conditions, a side is penalised one point for each over short. Consequently, two WTC points were deducted from India's points total. Stand-in India captain Bumrah pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing. This was the third time in the ongoing WTC cycle that India lost points due to a slow overrate. They lost two points in Nottingham and another point in Centurion, taking their tally of deducted points to five. The latest penalty saw India's Points Percentage drop down to 52.08, while Pakistan's 52.38. Pakistan, who are above India at present in the WTC table due to a superior percentage (42 points), still have fewer points than India (75 points). Australia and South Africa continue to lead the way with scores of 77.78 and 71.43 respectively. Pat Cummins and Co are yet to lose a Test in the WTC 2021-23 cycle and are the only side to be unbeaten. While India have lost four, Pakistan and the Proteas have lost two each. Incidentally, Australia missed making the final of the inaugural WTC final because of an overrate offence in the Boxing Day Test of 2020 against India. 𝗘𝗻𝗴𝗹𝗮𝗻𝗱 𝗪𝗜𝗡!! 🙌Highest ever run chase by England in Test cricket. Unbelievable. #Edgbaston | #ENGvIND pic.twitter.com/vWK3AnVbi3 Earlier in the day, Jonny Bairstow and Joe Root remained unbeaten on 114 and 142 respectively to help England win the rescheduled fifth Test and draw the series 2-2. The hosts chased down 378 quite comfortably, which was also their highest successful chase in Tests. England also recorded the highest target successfully chased down against India in the longest format.","pubDate":"2022-07-05 14:45:13","image_url":"https://assets.thehansindia.com/h-upload/2022/07/05/500x300_1301348-eng-vs-ind.jpg","source_id":"thehansindia","country":["india"],"category":["sports"],"language":"english"},{"title":"BBC Sports Personality of the Year 2022 – SPOTY winner odds: Jonny Bairstow in contention after historic England victory","link":"https://www.thesun.co.uk/sport/betting-tips/18447048/spoty-bbc-sports-personality-year-2022-winner-odds-bairstow/","keywords":["Betting Tips","Betfair","Betting"],"creator":["James Anderson"],"video_url":null,"description":"BOOKMAKERS have slashed odds on Jonny Bairstow being crowned BBC Sports Personality of the Year 2022. That’s according to Betfair, who’ve reduced the Yorkshireman’s price from 50/1 to 20/1 following England’s historic victory over India. BETFAIR – GET £30 IN FREE BETS* England completed a record chase of 378 to beat India in the fifth […]","content":"BOOKMAKERS have slashed odds on Jonny Bairstow being crowned BBC Sports Personality of the Year 2022. That’s according to Betfair, who’ve reduced the Yorkshireman’s price from 50/1 to 20/1 following England’s historic victory over India. Jonny Bairstow is 20/1 to win SPOTY, according to BetfairGETTY BETFAIR – GET £30 IN FREE BETS* England completed a record chase of 378 to beat India in the fifth Test Edgbaston on Tuesday — a week after their thrilling 3-0 series win over New Zealand. Bairstow has been nothing short of sublime under Ben Stokes and coach Brendon McCullum’s leadership, scoring four hundreds in five innings and six this year. Former England captain Root paid tribute to Bairstow, saying: “He looks like he’s got a real clarity in how he wants to go about his cricket. He’s striking the ball so clean, he looks very calm and in control out there. “His batting has just been exceptional and it’s a pleasure to stand at the other end. It’s great fun and it’s great to see someone I’ve known from being 12 years old, start to realise his true potential in this format of the game.” Bairstow still trails frontrunner Ronnie O’Sullivan (5/2), who claimed a record-equalling seventh World Championship title in Sheffield earlier this year. Sports Personality of the Year Award 2022 Betfair odds Ronnie O’Sullivan – 5/2 Tyson Fury – 8/1 Harry Kane – 9/1 Matt Fitzpatrick – 12/1 Emma Raducanu – 16/1 Jonny Bairstow – 20/1 – Was 50/1 Lewis Hamilton – 20/1 Dina Asher-Smith – 20/1 Mark Cavendish – 20/1 Katie Ormerod – 20/1 Zoe Aldcroft – 20/1 Eve Muirhead – 20/1 Raheem Sterling – 25/1 BETFAIR – GET £30 IN FREE BETS* BETFAIR – GET £30 IN FREE BETS* The Englishman became the oldest world champion in Crucible history, and drew level with Stephen Hendry. O’Sullivan has won 39 ranking titles and is fancied to add an altogether different trophy to his collection when the award is dished out in December. Betfair spokesperson Sam Rosbottom said: “With Jonny Bairstow scoring a total of 220 runs in the victory over India on Tuesday, his odds of winning this year’s BBC Sports Personality of the Year award have been slashed to 20/1 from 50/1, with Joe Root and Ben Stokes both 50/1.” Tyson Fury (8/1) was the previous SPOTY favourite after beating Dillian Whyte in his last fight before strongly hinting at retirement. Fury produced a stunning one-punch stoppage in front of 94,000 people at Wembley Stadium to retain his WBC title. The 33-year-old famously protested at his inclusion but was still named on the six-athlete shortlist for the award last year. Harry Kane is offered at 9/1, ahead of 12/1 chance Matt Fitzpatrick. England’s Fitzpatrick fought off competition from Scottie Scheffler and Will Zalatoris to claim his first major title with a one-shot victory in the US Open at Brookline. He became just the third Englishman in 52 years to win golf’s second oldest major. FREE BETS AND SIGN UP DEALS – BEST NEW CUSTOMER OFFERS FOOTBALL OFFERS SUPER DEAL New customers get £30 in FREE BETS when you stake any amount - 18+ T&Cs apply BET BOOST Bonus: Get £30 in FREE BETS on tennis at Wimbledon 2022 with William Hill BET BOOST Get Money back as CASH if any of your first five bets lose - 18+ T&Cs apply CASINO DEALS The best casino offers from free spins and bonus cash to no deposit deals Commercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org Remember to gamble responsibly A responsible gambler is someone who: Establishes time and monetary limits before playingOnly gambles with money they can afford to loseNever chase their lossesDoesn’t gamble if they’re upset, angry or depressedGamcare – www.gamcare.org.ukGamble Aware – www.begambleaware.org For help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites. *Place a min £10 bet on the Sportsbook on odds of min 1/2 (1.5), get £30 in Free Bets. Rewards valid for 30 days. SMS verification required. Only deposits via cards will qualify. T&Cs apply. Please Gamble Responsibly 18+ begambleaware.org Most read in Betting Tips LONDON CALLING Jesse Lingard transfer news - latest: West Ham odds SLASHED overnight RONAL-GO Cristiano Ronaldo transfer news - odds: Chelsea favourites after Boehly talks! LIONESSES Get England at 80/1 to win Women's European Championships with William Hill Car-azy win I won £42k after buying a 79p competition ticket thanks to The Sun CASH PRIZE Win £25,000 in cash from just 89p with exclusive Sun discount INGS AND OUT Danny Ings next club odds: Brighton lead race for Aston Villa striker","pubDate":"2022-07-05 14:30:00","image_url":null,"source_id":"thesun","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Joe Root heaps praise on Ben Stokes for urging England to play like 'rock stars' and 'entertainers'","link":"https://www.dailymail.co.uk/sport/cricket/article-10984069/Joe-Root-heaps-praise-Ben-Stokes-urging-England-play-like-rock-stars-entertainers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Joe Root inspired England to their highest ever fourth-innings run-chase, then admitted Ben Stokes had encouraged his players to become 'rock stars' as they attempt to take Test cricket to new heights.","content":null,"pubDate":"2022-07-05 14:23:07","image_url":"https://i.dailymail.co.uk/1s/2022/07/05/15/59891833-0-image-a-25_1657030955255.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Explained: What is 'Bazzball' - England's newfound approach in Test cricket","link":"https://www.indiatvnews.com/sports/cricket/what-is-baazball-england-s-newfound-approach-in-test-cricket-as-they-beat-india-by-7-wickets-in-edgbaston-eng-vs-ind-2022-07-05-789886","keywords":null,"creator":null,"video_url":null,"description":"Ever since Brendon McCullum took over as the head coach of the England Test team, there is a word called 'Bazzball' that has been trending now and then.  ","content":null,"pubDate":"2022-07-05 14:11:09","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"BUMBLE ON THE TEST: Rob Key's hiring as England director of cricket has proven a masterstroke","link":"https://www.dailymail.co.uk/sport/cricket/article-10983877/BUMBLE-TEST-Rob-Keys-hiring-England-director-cricket-proven-masterstroke.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Joe Root and Jonny Bairstow hit twin centuries as England's revitalised Test side roared into the history books, breezing a record chase of 378 to floor India at Edgbaston ..","content":null,"pubDate":"2022-07-05 14:04:03","image_url":"https://i.dailymail.co.uk/1s/2022/07/05/14/59888599-0-image-m-26_1657026051575.jpg","source_id":"dailymailuk","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"England v India: Joe Root and Jonny Bairstow complete record chase at Edgbaston - BBC","link":"https://news.google.com/__i/rss/rd/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9jcmlja2V0LzYyMDMxMjEw0gEuaHR0cHM6Ly93d3cuYmJjLmNvbS9zcG9ydC9jcmlja2V0LzYyMDMxMjEwLmFtcA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England v India: Joe Root and Jonny Bairstow complete record chase at Edgbaston  BBCEngland beat India by seven wickets with record chase to draw series – as it happened  The GuardianRoot and Bairstow Lead The Chase! | Highlights | England v India - Day 4 | LV= Insurance Test 2022  England & Wales Cricket BoardEngland pull off record chase to level series against India  Reuters.comEngland vs India - Day 5 LIVE: Score and updates from Edgbaston as 5th Test comes to an end  Daily MailView Full coverage on Google News","content":null,"pubDate":"2022-07-05 14:00:01","image_url":null,"source_id":"google","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"Dewald Brevis signs deal to play for St Kitts & Nevis Patriots in the CPL","link":"https://www.iol.co.za/sport/cricket/dewald-brevis-signs-deal-to-play-for-st-kitts-and-nevis-patriots-in-the-cpl-db10fef8-9ebc-40cf-b7fd-54ee2d822c07","keywords":null,"creator":["AFP"],"video_url":null,"description":"Cricket prodigy Dewald Brevis has taken another major step in his fledgling career with the teenager set to turn out for the St Kitts & Nevis Patriots in the CPL.","content":null,"pubDate":"2022-07-05 13:55:24","image_url":"https://image-prod.iol.co.za/16x9/800?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/00ff3ffc-c89e-5e31-8b12-9b5e714f5584&operation=CROP&offset=0x116&resize=3197x1799","source_id":"iol","country":["south africa"],"category":["sports"],"language":"english"},{"title":"Pakistan jump above India in WTC standings after points penalty - International Cricket Council","link":"https://news.google.com/__i/rss/rd/articles/CBMiKGh0dHBzOi8vd3d3LmljYy1jcmlja2V0LmNvbS9uZXdzLzI2Njg0MDPSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Pakistan jump above India in WTC standings after points penalty  International Cricket CouncilRoot and Bairstow Lead The Chase! | Highlights | England v India - Day 4 | LV= Insurance Test 2022  England & Wales Cricket BoardIndia vs England Stat Attack: Hosts smash records in historic chase at Edgbaston - Firstpost  FirstpostThe curse of Edgbaston: India stay winless in Tests in Birmingham in 55 years  India TodayRecord-Breaking Run Chase! | Highlights | England v India - Day 5 | LV= Insurance Test 2022  England & Wales Cricket BoardView Full coverage on Google News","content":null,"pubDate":"2022-07-05 13:40:37","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Edgbaston Racism cricket: What really happened with Indians fans during 5th ENG vs IND Test in Birmingham?","link":"https://thesportsrush.com/cricket-news-edgbaston-racism-cricket-what-really-happened-with-indians-fans-during-5th-eng-vs-ind-test-in-birmingham/","keywords":["Cricket","Edgbaston","Edgbaston racism","England vs India"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Edgbaston Racism cricket: A racism incident happened with the Indian fans in the England vs India Edgbaston test. The English team continued their winning run in tests under the regime of Ben Stokes and Brendon McCullum. They chased the record target of 378 runs in the fourth innings to register an easy seven wickets win… The post Edgbaston Racism cricket: What really happened with Indians fans during 5th ENG vs IND Test in Birmingham? appeared first on The SportsRush.","content":"Edgbaston Racism cricket: A racism incident happened with the Indian fans in the England vs India Edgbaston test. The English team continued their winning run in tests under the regime of Ben Stokes and Brendon McCullum. They chased the record target of 378 runs in the fourth innings to register an easy seven wickets win over India. Jonny Bairstow and Joe Root combined for a record partnership in the 4th innings to register a historic win where both of them scored their centuries. Bairstow scored double centuries in the game. Edgbaston Racism cricket There have been constant efforts to remove racism from the game, but every now and then, some or other things happen that again highlight the importance of the issue. One such incident happened in the Birmingham test between England and India as well. Some of the Indian fans were racially abused by the Edgbaston crowd, and they went on Twitter to express the issue. They revealed that some racial comments were made on them by the crowd, and even after complaining the same to the stewards, no action was taken against them. England Cricket Board acknowledged the issue, and they also issued a statement on the same where they assured that they will look into the matter. “We are very concerned to hear reports of racist abuse at today’s Test match. We are in contact with colleagues at Edgbaston who will investigate. There is no place for racism in cricket. Edgbaston has been working hard to create a safe and inclusive working environment,” ECB said in a statement. Barmy Army also condemned the racism incident that happened at the Edgbaston, and they showed their support to the Bharat Army group of Indian fans. “Needless to say, we stand with our long-time friends of the Bharat Army and condemn strongly any racial abuse. We look forward to celebrating the joy of Test cricket with them again today no matter the result!,” Barmy Army tweeted. Needless to say we stand with our long time friends of the @thebharatarmy and condemn strongly any racial abuse . We look forward to celebrating the joy of Test cricket with them again today no matter the result! https://t.co/1SOrFOFo7P — Jonny Bairstow’s Barmy Army (@TheBarmyArmy) July 5, 2022 When India last visited Australia, Mohammed Siraj complained about the racist slurs made to him by the Australian crowd.   The post Edgbaston Racism cricket: What really happened with Indians fans during 5th ENG vs IND Test in Birmingham? appeared first on The SportsRush.","pubDate":"2022-07-05 13:39:44","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Kohli Invincible, no more: from king of performance to king of theatrics","link":"https://www.indiatvnews.com/sports/cricket/virat-kohli-and-his-dismal-run-which-continued-in-the-5th-test-match-at-edgbaston-indvseng-2022-07-05-789875","keywords":null,"creator":null,"video_url":null,"description":"Edgbaston| Cricket is a great leveler and the sport has time and again proved that nobody is greater than it. When asked about hitting the rough patch, Kohli was quoted saying \"I've had it once when I had toured England in 2014 and now people just wait for me to hit my bad patch\", this was peak Kohli speaking when he used to score runs on his will. The former Indian skipper dominated world cricket for almost eight years, starting from 2012 till the time pandemic hit, but then came a slump that makes cricket experts and fans all over the world wonder, what is going wrong for the modern-day Indian legend.","content":null,"pubDate":"2022-07-05 13:25:05","image_url":null,"source_id":"indiatvnews","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Absolutely Listless\": Ex-India Players React To Humiliating Loss In Edgbaston Test vs England - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMikQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9lbmdsYW5kLXZzLWluZGlhLTIwMjIvYWJzb2x1dGVseS1saXN0bGVzcy1leC1pbmRpYS1wbGF5ZXJzLXJlYWN0LXRvLWh1bWlsaWF0aW5nLWxvc3MtaW4tZWRnYmFzdG9uLXRlc3QtdnMtZW5nbGFuZC0zMTMwMDQ20gGXAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2VuZ2xhbmQtdnMtaW5kaWEtMjAyMi9hYnNvbHV0ZWx5LWxpc3RsZXNzLWV4LWluZGlhLXBsYXllcnMtcmVhY3QtdG8taHVtaWxpYXRpbmctbG9zcy1pbi1lZGdiYXN0b24tdGVzdC12cy1lbmdsYW5kLTMxMzAwNDYvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Absolutely Listless\": Ex-India Players React To Humiliating Loss In Edgbaston Test vs England  NDTV SportsRoot and Bairstow Lead The Chase! | Highlights | England v India - Day 4 | LV= Insurance Test 2022  England & Wales Cricket BoardRoot, Bairstow rocket England to win over India in Edgbaston Test  SportstarThe curse of Edgbaston: India stay winless in Tests in Birmingham in 55 years  India TodayIndia vs England, 5th Test Report: Joe Root, Jonny Bairstow Help England Register Record Chase, Beat..  NDTV SportsView Full coverage on Google News","content":null,"pubDate":"2022-07-05 13:24:18","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"What's up with the Indian cricket team and their fourth-innings bowling?","link":"https://www.sportskeeda.com/cricket/eng-vs-ind-2022-what-s-indian-cricket-team-fourth-innings-bowling?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Shashwat Kumar"],"video_url":null,"description":null,"content":"July 3, 2022, Edgbaston. The Indian cricket team have skittled England out for 284 and have fashioned a 132-run lead in the process. Prior to this game, there had been murmurs around how the Indian cricket team might struggle against the hosts’ aggressive brand of cricket. On first-innings evidence, though, it couldn’t seem farther from the truth. At the end of day three, the Indian cricket team have a 257-run lead, meaning that even when they lose their last seven wickets for 120 runs, they have a healthy fourth-innings total of 378 to play with. Such a target, by the way, has never been chased by England in Test cricket. India, too, very rarely, allow opposition sides to hunt down more than 300 in the last innings. So, from many different standpoints, the game seems to be the Indian cricket team’s to lose. They obviously have to encounter England’s version of 'Bazball' but with Jasprit Bumrah , Mohammad Shami and Mohammed Siraj leading India’s charge, there is anticipation that they will get the job done. But then, things start going pear-shaped. The third ball Shami bowls is hacked away to the fence by Alex Lees . The boundary isn’t that important. It gets England four runs but the manner in which Lees marches down the track and swings with gay abandon, takes India aback. Zak Crawley , who has endured a wretched run in Test cricket since the start of 2021, has also grown in confidence at the other end. The drives that usually extracted edges are now sizzling off the middle of the bat through extra cover. You could even argue it takes the Indian cricket team close to 20 overs to recover. A change of ball, though, brings about a change of luck. Bumrah pitches a ball in the channel and gets it to deck back sharply, rattling Crawley’s off stump in the process. Post Tea, the Indian cricket team skipper continues weaving his magic, accounting for Ollie Pope with another excellent delivery. Joe Root then calls Lees through for a non-existent single and England, from being in control, are suddenly under pressure. The Indian cricket team, meanwhile, are grinning from ear to ear. Virat Kohli is celebrating as if there is no tomorrow. Bumrah’s tail is up. Shami is getting the ball to talk like he was always meant to. With England still requiring 269 runs to win, there are no doubts that India are the side in the ascendancy. Well, at least until Jonny Bairstow and Root take matters into their own hands. Prima facie, it would be very tempting to say that India have been outclassed by England. To an extent, they were at Edgbaston. From an Indian perspective, though, this was the third time they had not managed to defend a total in the fourth innings this year, despite seeming in control of the match. In Johannesburg, they had 240 to defend against South Africa. They had a world-class bowling attack at their disposal but floundered just when it mattered. The Proteas coasted to that target, scoring at more than 3.5 runs per over, with Dean Elgar starring. A game later, South Africa repeated the dose. Elgar wasn’t at the forefront, but Keegan Petersen was. The Proteas scored at 3.33 runs per over and comfortably chased down a 212-run target. The Indian cricket team also lost that series, despite surging into the lead in Centurion. At Edgbaston, something very similar happened. The Indian cricket team had 378 runs to defend but weren’t able to do so. England rattled along at just under 5 runs per over and put India under the sort of pressure they aren’t accustomed to. There are a few other damning patterns too. In all of these games, the Indian cricket team fashioned advantageous positions. On each occasion, though, they seemed afraid of grabbing the game by the scruff of its neck. In Cape Town, they allowed Petersen to dictate proceedings. In Johannesburg, they bombarded Elgar but South Africa still managed to score enough boundaries to keep themselves ahead. And in Birmingham, the Indian cricket team, for some reason, went into run-scoring mode even when England required more than 200 runs. Not only did they spread fields, they also used Ravindra Jadeja as a defensive option. The initial reaction could be to underplay it and suggest that Bumrah, who was captaining for the first time in Test cricket at Edgbaston, just missed a trick. However, this is an issue that has permeated Indian cricket, irrespective of who is in charge. For the record, they’ve had three different captains in these games ( Kohli in Cape Town, KL Rahul in Johannesburg, and Bumrah at Edgbaston). So, the tactics are bound to have been dissimilar. The outcome, though, hasn’t been. Maybe then India are missing someone of Umesh Yadav’s ilk – someone who can leak runs but someone who can break the game open. In the 21st century, Umesh has the ninth-best strike-rate (45) in the third and fourth innings of a Test match (minimum 50 wickets taken). When talking about victories, Umesh stands sixth (38.1) – only behind Dale Steyn, Kagiso Rabada, Keshav Maharaj, Moeen Ali and Shami. Or, it could be a case of the Indian cricket team not being brave enough. They’ve gotten themselves into situations where the game could’ve been won. But by allowing the opposition an avenue back into the game, they’ve almost always not made it count. They’ve also been overeager at times, often gifting the opposition quick runs and turning over the momentum of the contest. The worrying bit, though, is that this hasn’t been a theme for large swathes of India’s cricketing history. Quite often, they’ve been able to defend targets. They’ve also been very tough to beat when they have runs on the board. That, however, is not a narrative they’ve followed overseas in 2022. It could just be that they’ve hit three stumbling blocks in succession. Or, it could be a much deeper malaise – one where the mindset and the perceived lack of aggression become greater causes of concern. Whatever it is, it makes you question what’s up with the Indian cricket team and their fourth-innings bowling. At Edgbaston, they should never have let the game drift as much as they did. England played well but the Indian cricket team should never have been defeated so convincingly. They’ve tried different captains but they’ve had the same outcome. They’ve auditioned it against different oppositions. Yet, have had the same outcome. Maybe then, it’s time to introspect and truly understand what might’ve caused this. It won’t be easy, considering the Indian cricket team has, historically, not been bad at defending totals. But now that they are venturing into that territory, a quick solution seems the need of the hour. Else, the anticipation that surrounded their cricket at the end of day three at Edgbaston, will only morph into trepidation every time they have to defend a fourth-innings target against high-quality batting sides. Q. 0 votes so far","pubDate":"2022-07-05 13:21:29","image_url":"https://static.sportskeeda.com/editor/2022/07/303e9-16570234194721-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"\"We are trying to rewrite how Test cricket is being played in England\" - Ben Stokes on the team's long-term plan after landmark win in IND vs ENG fifth Test","link":"https://www.sportskeeda.com/cricket/news-we-trying-rewrite-test-cricket-played-england-ben-stokes-team-s-long-term-plan-landmark-win-ind-vs-eng-fifth-test?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Gokul Nair"],"video_url":null,"description":null,"content":null,"pubDate":"2022-07-05 13:21:29","image_url":"https://static.sportskeeda.com/editor/2022/07/111ac-16570227791512-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Bumrah: We let the game slip away after dominating three days","link":"https://sportstar.thehindu.com/cricket/ind-vs-eng-5th-test-bumrah-we-let-game-slip-away-after-dominating-three-days/article38508968.ece","keywords":null,"creator":["PTI"],"video_url":null,"description":"England rode on Joe Root and Jonny Bairstow's majestic centuries to thump India by seven wickets and register their highest-ever successful run chase in Test cricket.","content":null,"pubDate":"2022-07-05 13:19:12","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"}]}