{"newsArray":[{"title":"Sri Lanka coming to Zimbabwe for Cricket World Cup qualifiers","link":"https://www.chronicle.co.zw/sri-lanka-coming-to-zimbabwe-for-cricket-world-cup-qualifiers/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ASIA Cup champions, Sri Lanka have missed out on direct qualification for the upcoming 2023 International Cricket Council (ICC) World Cup and are set to participate in the qualifiers which will be hosted in Zimbabwe in June. The reigning Asian champions’ hopes of directly booking their ticket to the World Cup […]","content":"The Chronicle ASIA Cup champions, Sri Lanka have missed out on direct qualification for the upcoming 2023 International Cricket Council (ICC) World Cup and are set to participate in the qualifiers which will be hosted in Zimbabwe in June. The reigning Asian champions’ hopes of directly booking their ticket to the World Cup went up in smoke after losing their three-match One Day International (ODI) series against New Zealand 2-0 after the second match of the series was abandoned due to rain hence only two matches taking place. This marks the first time in 44 years that the Sri Lankan team will have to play qualifiers in order to earn their place in the World Cup. Sri Lanka went into the final match needing nothing short of a win to keep their thin hopes of qualifying alive and also hoping that the other two nations vying for the remaining one slot slip up in their games as well. The two teams with some hope of snatching the spot are South Africa and Ireland. The Asian nation, on 81 points, are sitting in position 10 in the Super League thus failing to overtake the West Indies who are eighth place with 88 points and have played all their matches. Meanwhile, a series win for South Africa against the Netherlands will take them to 98 points, effectively securing position eight in the standings. They, however, face a threat from Ireland who have a series against Bangladesh (The Tigers) in May. The series in May will take place in Chelmsford, England. This is due to better weather in England than in Ireland, leading to a better chance of full matches being played and producing results. For the Irish to have hopes of direct qualification, they need to whitewash The Tigers which will take them to 98 points, level with South Africa. Sri Lanka cricket Both teams will have nine wins each, number of wins is the first tie-breaker thus since having equal victories, net-run rate will come into play. Zimbabwe hosted the previous qualifiers to the 2019 edition in England and were awarded the opportunity of hosting again this year. The tournament is scheduled for 18 June to 9 July at venues soon to be announced. India, New Zealand, Australia, Pakistan, Bangladesh, England and Afghanistan are the teams whose places at the World Cup are guaranteed. — @brandon_malvin","pubDate":"2023-04-02 22:03:09","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Sri Lanka seal dramatic win over New Zealand","link":"https://www.herald.co.zw/sri-lanka-seal-dramatic-win-over-new-zealand/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"AUCKLAND. — Sri Lanka claimed a dramatic Super Over win in the opening match of their three-game Twenty20 cricket series against New Zealand yesterday to earn their first victory on tour. The match went to a tie-break decider after both teams chalked up 196 runs in a high-scoring thriller at Auckland’s Eden Park. New Zealand […]","content":"Tadious Manyepo-Sports Reporter CAPS United . . . . . . . . . . . . . . . (0) 1 ZPC Kariba . . . . . . . . . . . . . . . . . 0 THIS Castle Lager Premier Soccer League tie at the National Sports Stadium yesterday […] Oscar Rusenga in TRIANGLE Triangle Utd . . . . . . . . . . . . . . . . . . . . 0 Ngezi Platinum Stars . . . . . . . . . . . . 0 TRIANGLE battled hard for a point at home despite playing the last […] Innocent Kurira, in BULAWAYO Highlanders . . . . . . . . . . . . . . . (2) 2 FC Platinum. . . . . . . . . . . . . . . (0) 1 HIGHLANDERS finally ended their nine-year winless streak against FC Platinum in the Castle Lager […]","pubDate":"2023-04-02 22:01:18","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Eagles women to play in two domestic finals","link":"https://www.chronicle.co.zw/eagles-women-to-play-in-two-domestic-finals/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter EAGLES women’s cricket team are set to play in two domestic finals to cap off their brilliant 2023 inter-provincial season. The Harare-based side will be up against Mega Market Mountaineers in the Women’s T20 Cup final and will also face Rhinos in the Fifty50 Challenge title decider. The dates for the […]","content":"The Chronicle EAGLES women’s cricket team are set to play in two domestic finals to cap off their brilliant 2023 inter-provincial season. The Harare-based side will be up against Mega Market Mountaineers in the Women’s T20 Cup final and will also face Rhinos in the Fifty50 Challenge title decider. The dates for the finals are yet to be set. Eagles, who are under the stewardship of Trevor Garwe booked their place in the Fifty50 Challenge final after topping the standings with 40 points from six matches. From the six matches played, they won four and lost two. In their two matches against other finalists, Rhinos, they convincingly won one game and lost the other. Their first game against Rhinos which they won by 130 runs was their second of the campaign having beaten Mountaineers by seven wickets in the season opener. Eagles went on to suffer their first defeat in the third match against Tuskers when they lost by 48 runs before going on to complete the double over Mountaineers with a 41 runs win. Their second defeat of the season came at the hands of Rhinos who beat them by 39 runs early last month before they capped off their brilliant run with a six wicket win over Tuskers to top the standings and put one hand on the trophy. Rhinos in second place also won four and lost two and the two teams were separated by net-run rate. In the shortest version, the T20 Cup, Eagles finished in second place with 40 points, 10 behind log leaders Mountaineers who have 50. The 40 points came from four wins and two defeats in six matches while log leaders and fellow finalists, Mountaineers won five matches out of six as well. Eagles won their first four opening matches against Tuskers (eight wickets), Rhinos (eight wickets), Mountaineers (eight wickets) and Tuskers again (three runs). The two defeats came against Rhinos (26 runs) and Mountaineers (64 runs). They were the only team to beat the Mountaineers in the competition. The two finals are set to bring the curtain down on the women’s domestic season which began in February. — @brandon_malvin","pubDate":"2023-04-02 22:01:17","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Trinity, Maliyadeva, St. Joseph’s, St. Benedict’s battle for final berths","link":"https://www.dailymirror.lk/sports/Trinity--Maliyadeva--St--Joseph’s--St--Benedict’s-battle-for-final-berths/322-257027","keywords":null,"creator":null,"video_url":null,"description":"Four top cricket-playing schools, Trinity, Maliyadeva, St. Joseph’s, and St. Benedict’s, will battle it out in the two semifinals of the Under-19 inter-schools Division One Tier ‘A’, scheduled to be played at the Ace Capital CC ground in Colombo and the S. Thomas’ ground in Mt. Lavinia 03rd and 4th to book the berths to the final.","content":"Under-19 inter-school Division One Tier \"A\" semifinals By M. Shamil Amit Four top cricket-playing schools, Trinity, Maliyadeva, St. Joseph's, and St. Benedict's, will battle it out in the two semifinals of the Under-19 inter-schools Division One Tier ‘A', scheduled to be played at the Ace Capital CC ground in Colombo and the S. Thomas’ ground in Mt. Lavinia 03rd and 4th to book the berths to the final. Trinity vs. Maliyadeva The two teams will confront each other at the Ace Capital CC ground and a keenly contested game is expected due to the fact they are evenly balanced. Trinity, led by Rahal Amarasinghe, made it to the semis after finishing as the top team in their group. They have been in top form this season, having recorded back-to-back wins against Royal, the second of which was in the quarterfinal stage. On the other hand, Maliyadeva, led by Amesh Tennekoon, has been the most improved side in the ongoing school's tournament as they got the better of fancied teams before ending as the second-best team in their group and got the better of St. Sebastian’s Moratuwa in the quarterfinals to advance to the semis. St. Joseph’s vs. St. Benedict’s The two teams will clash at Mt. Lavinia, and this game too could see a closely contested tussle for supremacy. St. Joseph's, led by Sri Lanka youth player Sadeesh Jayawardena, ended the league matches of the tournament as the second-best team in their group before overcoming Wesley in the quarterfinals to advance to the semis. St. Benedict's, led by Chamath Chathurya, has had a successful stint in the league encounters, ending up as the third-best team in their group and getting the better of Richmond in the quarterfinal encounter to make it to the semis. The Teams: Trinity: Rahal Amarasinghe (Captain), Vibhavith Ehelepola (Vice Captain), Theeraka Ranathunga, Supun Waduge, Manula Kularatne, Tharana Wimaladharma, Kusal Wijethunga, Dinusha Pieris, Dinuka Tennakoon, Jayavi Liyanagama, Janith Warnakula, Malith Rathnayake, Lakvin Abeysinghe, Vathila Udara, Yewan Hulangamuwa, Viduka Dhammage, Naveen Ekanayake (Head Coach), Lakshitha Alahakoon (Asst. Coach), Bryan Senaratne (Master-in-charge). Maliyadeva: Amesh Tennakoon (Captain), Gayana Weerasinghe (Vice Captain), Jayamin Muthukumarana, Pasindu Menaka, Ushan Bimsara, Charuka Herath, Cahamathkar Hettiarachchi, Malith Kumarathunga, Dimath Abeysinghe, Thaveesha Balasooriya, Harasara Silva, Themiya Bandara, Arjun Sathsara, Ruchira Werahera, Chandupa Abeysinghe, Vishen Sadew, Gishan De Silva, Punsitha Roneth, Janaka Senevirathna (Head Coach), Jaliya Madushanka (Asst Coach), Mahinda Uduwerella (Master-in-charge). St. Joseph’s: Sadeesh Jayawardana (Captain), Lahiru Amarasekara (Vice Captain), Hirun Matheesha, Sahan Dabare, Abishek Jayaweera, Hiran Jayasundara, Muditha Lakshan, Dinuk Serasinghe, Kaven Pathirana, Yenula Dewthusa, Rishma Amarasinghe, Maanasa Madubashana, Dunick Perera, Gagan Chamod, Naren Muralidaran, R. De Alwis, Sasanka Ranaweera, Senod Soysa, Ashan Vilukshan, Asiri Caldera (Master in charge), Dilan Ramanayake (Head Coach), Dinal Dhambarage (Asst. Coach), Torin Pitigala (Asst. Coach). St. Benedict’s: Chamath Chathurya (Captain), Dilan Thabrew, Viduneth Wilson, Sheron Kannangara, Shenel Samarathunga, Sharujan Shanmuganathan, Kojitha Himsara, Vihara Aththnayaka, Mewan Dissanaike, Arshan Joseph, Yohan Edirisinghe, Nilakshana Jayakody, Haren Olagama, Nadun Fernando, Onesh Michael, S. Akshar, Aveesha Weerarathna, Dumindu Yehen, Sheran Dissanaike, Kevin Jason, Pemlal Fernando (Head coach), Madushan Kularathna (Asst. Coach), Rev. Br. Dilshan Vimukthi (Master-in-charge).","pubDate":"2023-04-02 21:21:27","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_fc53698dde.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Debonair Durani dies at 88","link":"https://kashmirreader.com/2023/04/03/debonair-durani-dies-at-88/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Salim Durani, the debonair India cricketer of the 1960s with a movie-star looks, a puckish sense of humour, and a penchant for hitting monstrous sixes on demand, died on Sunday. He was 88. His death was confirmed by sources close to the family. He had been living with his younger brother, Jahangir Durani, […]","content":"New Delhi: Salim Durani, the debonair India cricketer of the 1960s with a movie-star looks, a puckish sense of humour, and a penchant for hitting monstrous sixes on demand, died on Sunday. He was 88. His death was confirmed by sources close to the family. He had been living with his younger brother, Jahangir Durani, in Jamnagar, Gujarat. Durani had undergone a proximal femoral nail surgery after he broke his thigh bone in a fall in January this year. The Kabul-born Durani, who packed a punch with his bat and was also a handy left-arm orthodox bowler, played 29 Tests and was instrumental in India defeating England 2-0 in the historic five-match Test series in 1961-62, picking up eight and 10 wickets in the team’s victories at Calcutta and Madras respectively. Durani, known for his fine dressing style and swagger, scored just one century though he had seven fifties in the 50 innings he played for the country, scoring 1,202 runs. A decade after the epic triumph against England, he played a key role in helping India to victory against the West Indies in Port of Spain, dismissing both Clive Lloyd and Sir Garfield Sobers. The star cricketer also dabbled in Bollywood, starring opposite renowned actor Praveen Babi in the movie Charitra in 1973. Durani made his Test debut against Australia at in the beginning of 1960 at Mumbai’s Brabourne Stadium, and played his last international match — then only restricted to the traditional, five-day format — against England in February 1973. The venue was again the place where he had started his international career. The stylish cricketer aggregated 8,545 runs at 33.37 in first-class cricket and hit 14 hundreds. A joy to watch when in full flow, Durani had the ability to demolish any bowling attack on his day, though it was as a bowler he had first made his mark for the Indian team. India’s first Arjuna Award winner in cricket, Durani was a tall man and could get the ball to lift and turn on any surface with a bit of help. A fascinating character, the cricketer shared a special relation with the crowd, who once expressed their ire after he was dropped from the team for a match in Kanpur, and carried banners and placards that read ‘No Durani, no test!’. In domestic circuit, Durani represented Gujarat, Rajasthan and Saurashtra during a career that spanned two decades and a half. PTI Debonair Durani dies at 88 added by Press Trust of India on 1:41 am April 3, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-04-02 20:11:43","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Durani was a legend, an institution in himself: PM","link":"https://kashmirreader.com/2023/04/03/durani-was-a-legend-an-institution-in-himself-pm/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Prime Minister Narendra Modi called Salim Durani, who died on Sunday, an institution in himself who contributed immensely to India’s rise in the world of cricket. Durani, the stylish India cricketer of the 1960s known as much for his six-hitting prowess as for his movie-star looks and fine dressing sense, was 88 and […]","content":"New Delhi: Prime Minister Narendra Modi called Salim Durani, who died on Sunday, an institution in himself who contributed immensely to India’s rise in the world of cricket. Durani, the stylish India cricketer of the 1960s known as much for his six-hitting prowess as for his movie-star looks and fine dressing sense, was 88 and breathed his last in Jamnagar, Gujarat. Durani, who was born in Kabul, played 29 Tests and was a member of the India side that won the historic five-Test series against England in 1961-62. “Salim Durani Ji was a cricketing legend, an institution in himself. He made a key contribution to India’s rise in the world of cricket. On and off the field, he was known for his style. Pained by his demise. Condolences to his family and friends. May his soul rest in peace,” wrote Modi on twitter. The PM also remembered the late cricketer’s association with Gujarat. Durani played domestic cricket for Saurashtra and Gujarat. “Salim Durani Ji had a very old and strong association with Gujarat. He played for Saurashtra and Gujarat for a few years. He also made Gujarat his home. I have had the opportunity to interact with him and was deeply impressed by his multifaceted persona. He will surely be missed,” wrote Modi. Union Sports Minister Anurag Thakur said Durani inspired a generation of cricketers in India. “Sad to hear about the demise of Salim Durani Ji, a true inspiration to generations of cricketers in India. His talent and skills on the field will continue to inspire us,” said Thakur. BCCI secretary Jay Shah said Indian cricket had lost one of its crown jewels in Durani’s death. “Gutted to hear about the passing away of one of Team India legends Salim Durani. Today, we have lost one of Indian cricket’s crown jewels,” wrote Shah. Sachin Tendulkar in his condolence message wrote, “Deeply saddened to hear about the passing of Salim Durani ji. A really warm and loving person. My thoughts and prayers are with his family during this difficult time.” Former India chief coach Ravi Shastri said Durani was one of the most colourful cricketers the country had produced. “Easily one of the most colourful cricketers of India – Salim Durani,” tweeted Shastri. PTI Durani was a legend, an institution in himself: PM added by Press Trust of India on 1:41 am April 3, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-04-02 20:11:33","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Dogs bark on Joe’s dirty night, Crows win SA bragging rights, and Cats fall to bottom of ladder","link":"https://www.brisbanetimes.com.au/sport/afl/dogs-bark-on-joe-s-dirty-night-crows-win-sa-bragging-rights-and-cats-fall-to-bottom-of-ladder-20230331-p5cx4x.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu, Jon Pierik, Peter Ryan, Roy Ward, Andrew Stafford, Steve Barrett and Marc McGowan"],"video_url":null,"description":"There was plenty on the line in round three, including a coaching master going head-to-head against his one-time protégé. Elsewhere, the Bulldogs regained their bark but a big-name Lion is under the microscope, the Crows took bragging rights in the Showdown, and the reigning premiers slumped to the bottom of the ladder.","content":"Loading Western Bulldogs d Brisbane Lions The scrappy nature of the Dogs’ win is exactly what they needed to turn their season around. The club was built on blue-collar workers, and this is how they must play to maximise their potential. Coach Luke Beveridge recognised as much by selecting a team to exert pressure. The “Manhattan” forward line was worth a try but should be shelved. Though they never had all four towers – Aaron Naughton, Jamarra Ugle-Hagan, Rory Lobb and Sam Darcy – in there together, Darcy’s omission enabled them to pick an extra small forward, Arthur Jones , who set the tone with his speed and energy. There is a Simpsons meme where Lenny tells Homer’s co-workers at the nuclear power plant: “Get ready, everybody, he’s about to do something stupid”. There must be plenty of Lions fans who feel the same way about Joe Daniher . Unlike Homer, Daniher is prodigiously talented, but he is prone to too many moments of madness for a player of his ability and experience. Teammates can sympathise with a bout of yips in front of goal, but they are less forgiving when, with the game on the line, they make position and are torched by a turn-and-burn Hail Mary from outside 50. Coach Chris Fagan has foreshadowed an uncomfortable review on Daniher’s game. – Andrew Wu Chris Fagan flagged a tough review for Joe Daniher after the loss to the Bulldogs. Credit: Getty Images Collingwood d Richmond Big crowd, big occasion, and it was the Magpies who again proved they are made of the right stuff. Forget the final margin because Collingwood were clearly the better side. There is probably still a slight query on their no-frills forward line, with recruit Dan McStay yet to take a match by the scruff of the neck. But they will have no shortage of supply if Jordan De Goey , Tom Mitchell , Steele Sidebottom and Jack Crisp keep playing the way they are. Billy Frampton ’s arrival also gives coach Craig McRae options for the opposition’s best key forward, too, after a superb shutdown job on usual Pies nemesis Tom Lynch . As for the Tigers, there must be some concern despite them having a genuine excuse with a lengthy injury list. The cavalry – Dustin Martin , Jayden Short and Jacob Hopper – is on its way for Saturday’s clash with a Western Bulldogs team just as desperate for a win. It’s far too early to panic, but Richmond haven’t shown the same high gear as other top sides so far this year. They need more from players outside of Liam Baker and Daniel Rioli . – Marc McGowan Hawthorn d North Melbourne This was billed as a grudge match between master coach Alastair Clarkson and his one-time protege Sam Mitchell . And the smile on Mitchell’s face once this clash in Launceston was done indicated yes, he was happy to have banked the Hawks’ first four points of the season, but also relieved that his first head-to-head meeting against Clarkson had gone his way. Mitchell tactically had the better of Clarkson. The latter opted to have his men defend space, rather than a player, through the midfield. Mitchell counter-attacked by instructing his team to chip its way through the zone and hold possession. It worked a treat, for Jai Newcombe, Will Day, Dylan Moore and, particularly in the first half, Changkouth Jiath , used their skills well. The Hawks led by 31 points early in the third term. The Kangaroos rallied late, but the Hawks – with three goals by Tyler Brockman in his first senior game since 2021 – hung tough. The Roos clearly missed two of their prime midfielders, skipper Jy Simpkin (suspended) and Luke Davies-Uniacke (tight calf), who withdrew in the warm-up. Rookie standout Harry Sheezel was superb, and did his best to drag the Roos to what would have been a third straight win. The Hawks remain a major work in progress, and desperately need a marking tall up forward, but this win eases what had been a burning spotlight on a rebuild in its infancy. – Jon Pierik Carlton d GWS Like many other teams, the Blues are making an effort to keep intensity high in their midfield and rest their guns, so Patrick Cripps , despite his 42-possession masterclass, spent time “resting” in the forward line late in Saturday’s win over the Giants. “We have to get intensity around the ball for four quarters so when he came on the field, he ended up going deep forward, but that was more to do with giving him a rest. He was pretty handy across the day, wasn’t he?” Blues coach Michael Voss said. The Blues also have a very impressive defensive stopper in Nic Newman , who kept GWS skipper Toby Greene to one of the quietest days of his career. Voss praised Newman’s first month of 2023. Speaking of intensity, Matt Owies (hamstring) and Blake Acres (shoulder) have played important roles up forward and in the midfield this season, but both are under clouds with Owies subbed out with a “minor hamstring” while Acres was clearly hurting but played out the game. He has also been given a one-game ban by the match review officer. – Roy Ward Patrick Cripps picked up 42 touches in the win over GWS. Credit: Getty Images St Kilda d Essendon It is no mean feat to win the first three games of the season, and St Kilda’s improvement under Ross Lyon is evident already. They kicked 71 points on turnover and responded twice when challenged by the Bombers after making a great start when all eyes were on the group leading into the 150th anniversary game. Callum Wilkie has now reeled off 88 games in a row since St Kilda gave him a chance, and his match against Essendon was one of his best, standing tall as captain on a huge night for the club. He took seven intercept marks and made it impossible for the Bombers to score in the first 20 minutes. Up the other end of the ground the two smalls – Jack Higgins and Dan Butler – are getting the job done, bringing pressure and experience to support their young teammates inside 50. As for Mason Wood , he is a revitalised player at the Saints, with his talent shining through on a consistent basis, even though he may be in doubt for next week with a shoulder injury. Essendon showed grit and fight and belief in what coach Brad Scott is doing when they came back from five goals down to draw level in the final quarter. They did not deserve to win, but they provided a contest, which is an improvement on recent seasons. - Peter Ryan Adelaide d Port Adelaide Riley Thilthorpe kicked five in the Showdown. Credit: Getty Images By shelving their tired Jekyll-and-Hyde act, Adelaide showcased what their A-grade best looks like for decent stretches in their impressive Showdown win over Port Adelaide. Little separated the two teams across the first three engrossing quarters – typical of what is arguably the AFL’s finest modern-day rivalry – before the Crows turned on the afterburners with six unanswered goals in the last 20 minutes. Pivotal to Adelaide’s victory were the performances of new captain and Showdown medallist Jordan Dawson , Riley Thilthorpe (five goals) and Izak Rankine (four). By design, the Crows – by trade and draft – have heavily leant towards acquiring and enticing homegrown stars like Dawson (Sturt), Thilthorpe and Rankine (both West Adelaide), as well as the injured Darcy Fogarty (Glenelg). Badly and regularly burnt by the defection of several homesick draftees from interstate, Adelaide now boasts a number of emerging stars who will be Crows lifers. Making the Showdown victory even sweeter, Adelaide (11th) leapt ahead of the Power (12th) on percentage in the process. When the floodgates opened down the stretch, Port were powerless to quell the Crows’ rampant forward forays. The Power’s defence, so often the calling card of the Ken Hinkley era, has bled badly over the past fortnight. The once laughable suggestion that Port could finish below Adelaide on the ladder now looms a genuine possibility. - Steve Barrett Gold Coast d Geelong Loading This was an important win for the Suns, relieving some pressure on coach Stuart Dew after a poor start to the season. It was also a fitting tribute to the brave and selfless David Swallow in his 200th game. But perhaps most of all it was the moment that Jack Lukosius truly arrived as a footballer of substance. The No.2 draft pick of 2018 was the match-winner, his 65-metre drop punt in the last quarter a moment to remember. Questions will inevitably be asked about the Cats’ premiership defence, particularly now they find themselves on the bottom of the ladder as the league’s only winless team. But they have got the unfancied Hawthorn and the West Coast Eagles to come, and don’t forget; they did string 16 unbroken wins together on their way to last year’s flag. – Andrew Stafford Melbourne d Sydney September is when the Dees would like to see the real value of the Brodie Grundy trade come through, but there are already dividends in the first week of April. Playing in just his third game since being injured on Anzac Day last year, Grundy looked every bit the player who had been the competition’s premier ruckman before Max Gawn’s rise. He can still break his rivals’ hearts with his endurance, and his work below his knees means he effectively is an extra midfielder once the ball hits the ground. The true test of Grundy’s recruitment will come when Gawn returns, and we have a better guide as to how well the dream combination on paper functions on the field. As well as Sydney fared last year, there is a considerable gap between the Swans’ midfield and that of the competition’s heavyweights. Their onball brigade is vulnerable against the bigger bodies of the established teams. The Demons tore them apart in the hunt for contested ball; an area they were brutally exposed in last year’s grand final. Luke Parker has a decade of credits to forgive a rare bad day, but if the Swans are to threaten then next-generation midfielders Chad Warner and James Rowbottom , who have developed quickly for their age, can’t go missing as they did against the Dees. Road trips to Geelong (round six) and Collingwood (round eight) are their next big tests. – Andrew Wu Fremantle d West Coast What do you do with Luke Jackson when Sean Darcy is dominating in the ruck? Jackson is a premiership player and game-changing big man, but he is still finding his place at his new club. He made a good fist of his time forward in Sunday’s derby, kicking two goals, taking a big mark. Seven tackles for the match was also a highlight. Darcy had 52 hit outs, 20 touches and a goal, which was impressive, even with the Eagles decimated by injuries. When Darcy is dominating, Freo will need to find ways to get Jackson into the play as well. The queue outside the Eagles medical room just got longer, with Luke Shuey , Jeremy McGovern , Jamie Cripps and Alex Witherden all going down, leaving Adam Simpson with no bench for the final term. Hopefully, Shuey didn’t damage his hand when he punched the wall in frustration. On a final topic, Dockers flyer Michael Frederick and his backflip celebration needs to be encouraged at all costs, such acrobatics and unbridled joy is a great advertisement for the AFL. - Roy Ward Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers North Melbourne Kangaroos Analysis Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Roy Ward is a sports writer, live blogger and breaking news journalist. He's been writing for The Age since 2010. Connect via Twitter or email . Andrew Stafford is a columnist. Steve Barrett writes about sport for The Age. Marc McGowan is a sports reporter for The Age Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-04-02 19:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Remembering Salim Durani: A genuine folk hero","link":"https://economictimes.indiatimes.com/news/sports/remembering-salim-durani-a-genuine-folk-hero/articleshow/99194616.cms","keywords":null,"creator":null,"video_url":null,"description":"Salim Durani, the former India all-rounder known for his ability to hit sixes, has passed away at the age of 88. Despite modest figures, Durani earned respect and admiration from those who played with or against him. He was born in Kabul but denied it and had a light touch with people. Financial setbacks and health challenges did not daunt him, and he was a genuine folk hero in the cricketing universe, where his name rang all over.","content":"Synopsis Salim Durani, the former India all-rounder known for his ability to hit sixes, has passed away at the age of 88. Despite modest figures, Durani earned respect and admiration from those who played with or against him. He was born in Kabul but denied it and had a light touch with people. Financial setbacks and health challenges did not daunt him, and he was a genuine folk hero in the cricketing universe, where his name rang all over. At a time when a cricketer can become a household name after just one big knock in an IPL match, Durani would have been a massive draw. If you needed proof that not everything can be measured in numbers look no further than Salim Durani , the 88-year-old former India all-rounder who breathed his last in Jamnagar early on Sunday morning. Durani played 29 Tests, scoring 1202 runs and taking 75 wickets. But, ask anyone who played with him or against him and they speak of him with respect and affection. The most famous stories about Durani are about his ability to hit sixes at will. While no batsman can lay claim to a 100% record when it comes to something like this, those of a certain age remember crowds persistently yelling “we want sixer!” And Durani obliged them with a clean swing of the bat at the earliest possible instance. Although he hit a long ball, Durani never claimed to be a power hitter. In later conversations, he would only say that he lifted the ball over the fielder. The other famous bit about Durani is a contentious one. While it is widely believed that he was born in Kabul, this is something Durani has denied in interviews, going to the extent of saying he has never even been to Kabul. But, then again, this just adds to the myth. What is a fact is that Durani would sometimes demand the ball off Ajit Wadekar , his captain, when Garry Sobers was in full cry and dismiss arguably the best allrounder of all time with his leftarm orthodox spin. One such famous instance was in 1971 when India won their maiden Test in the West Indies. Durani had Clive Lloyd and Sobers in space of a few balls, setting up a sevenwicket win in Port of Spain. In that spell, Durani conceded only 21 runs in the 17 overs he bowled. A flamboyant character who enjoyed a drink, Durani has seen a lot of what life downs. From financial setbacks to health challenges, Durani endured it all after his playing days ended. But, when he was at his peak, Durani was a genuine folk hero. At a time before the world was a global village, Durani’s name rang around the cricketing universe. This was not fame fuelled by social media or celebrity, but by the respect of peers and the love of the common man. Durani had a light touch with people, equally comfortable smoking a cigarette at a corner tea stall and riding with maharajas in the fanciest of cars. When asked about tough times, Durani would inevitably shrug it off: whose life doesn’t come with difficulties, he would ask, with a characteristic laugh. Inevitable when asked how he managed to keep this attitude going, there would be a glint in his eye. “The problem comes when you try to control life. If you understand that life is bigger and go with the flow, everything becomes easier.” At a time when a cricketer can become a household name after just one big knock in an IPL match, Durani would have been a massive draw. But, you suspect, he was quite happy to have been a man of another era, a more forgiving, more genuine one. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Sunday, 02 Apr, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front page Pure Politics Bottom Line Deep Dive More GST Collections in March Jump 13% to ₹1.6 Lakh Crore India’s monthly goods and services tax (GST) collections hit the second highest ever in March, rising 13% from a year earlier to ₹1.6 lakh crore, suggesting economic strength despite several headwinds. Want PM Modi to have a Successful G20 Summit The US shares India’s G20 agenda and is doing everything to make the country’s presidency a success, said US G20 head of delegation Christina Segal-Knowles. While the G20 is not the forum for geopolitical issues, to the extent that the Ukraine war impacts economics, the grouping can’t avoid the topic, she said in an interview with Deepshikha Sikarwar. SUVs Boost Car Sales to Record 3.9 M in FY23 India’s passenger vehicle sales rose 27% to a record 3.9 million units in the last fiscal year ended Friday, as improved component supplies helped automakers step up production to meet strong demand and clear order backlog. Read More News on salim durani cricket ajit wadekar garry sobers Indian cricketer fact (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Finance Bill 2023 takes the sheen off debt funds. Will bank FDs become more lucrative? 9 mins read Strategy Naatu Naatu roars: How RRR used Hollywood feedback loop and social media for the Oscar win 10 mins read Under the lens Learnings from SVB and Credit Suisse: Two tales of systematic and unsystematic risks 6 mins read Subscribe to ETPrime","pubDate":"2023-04-02 19:26:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-12530,resizemode-4,msid-99194616/remembering-salim-durani-a-genuine-folk-hero.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Bangladesh beat Afghanistan to win Tri-Nations U-19 final","link":"https://www.ft.lk/sports/Bangladesh-beat-Afghanistan-to-win-Tri-Nations-U-19-final/23-746994","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Left-arm spinner Mahfuzur Rahman Rabby took six wickets for 29 to bowl Bangladesh to a six-wicket win over Afghanistan in the final of the Tri-Nations Under-19 cricket tournament in Abu Dhabi. Mahfuzur’s destructive spell saw the strong Afghanistan batting humbled for 143 in 37 overs with Haroon Khan being the only batsman to make any sort of contribution scoring a well struck 65 off 62 balls (7 fours). Bangladesh had no difficulty in reaching the target of 144 in 23 overs losing four wickets to crown themselves champions. Sri Lanka were the third team in the competition.","pubDate":"2023-04-02 19:11:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Cricketers Mahela, Mohan excel at inaugural Ananda-Nalanda golf tourney","link":"https://www.ft.lk/sports/Cricketers-Mahela--Mohan-excel-at-inaugural-Ananda-Nalanda-golf-tourney/23-746993","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Overall Winner - Nalanda College: Mahela Jayawardene receiving his trophy and gift from Ananda College Golf Captain Wasantha de Silva and Vice-Captain Primal Wijayanayake Two cricketing stalwarts of SSC – Mahela Jayawardene and Mohan de Silva showed their hand in a different sport when they emerged winners for their respective alma maters in the inaugural Ananda-Nalanda ‘Big Match’ golf encounter themed ‘First Flight’ held at the Royal Colombo Golf Club course last week. The tournament was played in a stableford format, with Ananda College emerging champions. Mohan de Silva emerged Overall Winner for Ananda with 41 points while Dehan de Silva was the Overall Runner-up with 37 points (B/B9). For Nalanda, Mahela Jayawardene was the Overall Winner with 35 points with Anura Balasooriya, the Overall Runner-up with 34 points. “We are absolutely thrilled to have won the inaugural Maroon Golf tournament against our rivals and brothers Nalanda. It was great competition, and we played our best golf to come out on top. We all played as a team, and we enjoyed every minute of it,” said Ananda College golf team Captain Wasantha de Silva. Nalanda team Captain Mahela Jayawardene said: “As the hosts of the first ever Ananda-Nalanda Golf Tournament, we are proud of how we played, and we are already looking forward to the rematch next year.” The success of the tournament has paved the way for future competitions between the two colleges, with plans already underway for a bigger and better tournament next year.","pubDate":"2023-04-02 19:11:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sri Lanka coming to Zimbabwe for Cricket World Cup qualifiers","link":"https://www.chronicle.co.zw/sri-lanka-coming-to-zimbabwe-for-cricket-world-cup-qualifiers/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ASIA Cup champions, Sri Lanka have missed out on direct qualification for the upcoming 2023 International Cricket Council (ICC) World Cup and are set to participate in the qualifiers which will be hosted in Zimbabwe in June. The reigning Asian champions’ hopes of directly booking their ticket to the World Cup […]","content":"The Chronicle ASIA Cup champions, Sri Lanka have missed out on direct qualification for the upcoming 2023 International Cricket Council (ICC) World Cup and are set to participate in the qualifiers which will be hosted in Zimbabwe in June. The reigning Asian champions’ hopes of directly booking their ticket to the World Cup went up in smoke after losing their three-match One Day International (ODI) series against New Zealand 2-0 after the second match of the series was abandoned due to rain hence only two matches taking place. This marks the first time in 44 years that the Sri Lankan team will have to play qualifiers in order to earn their place in the World Cup. Sri Lanka went into the final match needing nothing short of a win to keep their thin hopes of qualifying alive and also hoping that the other two nations vying for the remaining one slot slip up in their games as well. The two teams with some hope of snatching the spot are South Africa and Ireland. The Asian nation, on 81 points, are sitting in position 10 in the Super League thus failing to overtake the West Indies who are eighth place with 88 points and have played all their matches. Meanwhile, a series win for South Africa against the Netherlands will take them to 98 points, effectively securing position eight in the standings. They, however, face a threat from Ireland who have a series against Bangladesh (The Tigers) in May. The series in May will take place in Chelmsford, England. This is due to better weather in England than in Ireland, leading to a better chance of full matches being played and producing results. For the Irish to have hopes of direct qualification, they need to whitewash The Tigers which will take them to 98 points, level with South Africa. Sri Lanka cricket Both teams will have nine wins each, number of wins is the first tie-breaker thus since having equal victories, net-run rate will come into play. Zimbabwe hosted the previous qualifiers to the 2019 edition in England and were awarded the opportunity of hosting again this year. The tournament is scheduled for 18 June to 9 July at venues soon to be announced. India, New Zealand, Australia, Pakistan, Bangladesh, England and Afghanistan are the teams whose places at the World Cup are guaranteed. — @brandon_malvin","pubDate":"2023-04-02 22:03:09","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Sri Lanka seal dramatic win over New Zealand","link":"https://www.herald.co.zw/sri-lanka-seal-dramatic-win-over-new-zealand/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"AUCKLAND. — Sri Lanka claimed a dramatic Super Over win in the opening match of their three-game Twenty20 cricket series against New Zealand yesterday to earn their first victory on tour. The match went to a tie-break decider after both teams chalked up 196 runs in a high-scoring thriller at Auckland’s Eden Park. New Zealand […]","content":"Tadious Manyepo-Sports Reporter CAPS United . . . . . . . . . . . . . . . (0) 1 ZPC Kariba . . . . . . . . . . . . . . . . . 0 THIS Castle Lager Premier Soccer League tie at the National Sports Stadium yesterday […] Oscar Rusenga in TRIANGLE Triangle Utd . . . . . . . . . . . . . . . . . . . . 0 Ngezi Platinum Stars . . . . . . . . . . . . 0 TRIANGLE battled hard for a point at home despite playing the last […] Innocent Kurira, in BULAWAYO Highlanders . . . . . . . . . . . . . . . (2) 2 FC Platinum. . . . . . . . . . . . . . . (0) 1 HIGHLANDERS finally ended their nine-year winless streak against FC Platinum in the Castle Lager […]","pubDate":"2023-04-02 22:01:18","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Eagles women to play in two domestic finals","link":"https://www.chronicle.co.zw/eagles-women-to-play-in-two-domestic-finals/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter EAGLES women’s cricket team are set to play in two domestic finals to cap off their brilliant 2023 inter-provincial season. The Harare-based side will be up against Mega Market Mountaineers in the Women’s T20 Cup final and will also face Rhinos in the Fifty50 Challenge title decider. The dates for the […]","content":"The Chronicle EAGLES women’s cricket team are set to play in two domestic finals to cap off their brilliant 2023 inter-provincial season. The Harare-based side will be up against Mega Market Mountaineers in the Women’s T20 Cup final and will also face Rhinos in the Fifty50 Challenge title decider. The dates for the finals are yet to be set. Eagles, who are under the stewardship of Trevor Garwe booked their place in the Fifty50 Challenge final after topping the standings with 40 points from six matches. From the six matches played, they won four and lost two. In their two matches against other finalists, Rhinos, they convincingly won one game and lost the other. Their first game against Rhinos which they won by 130 runs was their second of the campaign having beaten Mountaineers by seven wickets in the season opener. Eagles went on to suffer their first defeat in the third match against Tuskers when they lost by 48 runs before going on to complete the double over Mountaineers with a 41 runs win. Their second defeat of the season came at the hands of Rhinos who beat them by 39 runs early last month before they capped off their brilliant run with a six wicket win over Tuskers to top the standings and put one hand on the trophy. Rhinos in second place also won four and lost two and the two teams were separated by net-run rate. In the shortest version, the T20 Cup, Eagles finished in second place with 40 points, 10 behind log leaders Mountaineers who have 50. The 40 points came from four wins and two defeats in six matches while log leaders and fellow finalists, Mountaineers won five matches out of six as well. Eagles won their first four opening matches against Tuskers (eight wickets), Rhinos (eight wickets), Mountaineers (eight wickets) and Tuskers again (three runs). The two defeats came against Rhinos (26 runs) and Mountaineers (64 runs). They were the only team to beat the Mountaineers in the competition. The two finals are set to bring the curtain down on the women’s domestic season which began in February. — @brandon_malvin","pubDate":"2023-04-02 22:01:17","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Trinity, Maliyadeva, St. Joseph’s, St. Benedict’s battle for final berths","link":"https://www.dailymirror.lk/sports/Trinity--Maliyadeva--St--Joseph’s--St--Benedict’s-battle-for-final-berths/322-257027","keywords":null,"creator":null,"video_url":null,"description":"Four top cricket-playing schools, Trinity, Maliyadeva, St. Joseph’s, and St. Benedict’s, will battle it out in the two semifinals of the Under-19 inter-schools Division One Tier ‘A’, scheduled to be played at the Ace Capital CC ground in Colombo and the S. Thomas’ ground in Mt. Lavinia 03rd and 4th to book the berths to the final.","content":"Under-19 inter-school Division One Tier \"A\" semifinals By M. Shamil Amit Four top cricket-playing schools, Trinity, Maliyadeva, St. Joseph's, and St. Benedict's, will battle it out in the two semifinals of the Under-19 inter-schools Division One Tier ‘A', scheduled to be played at the Ace Capital CC ground in Colombo and the S. Thomas’ ground in Mt. Lavinia 03rd and 4th to book the berths to the final. Trinity vs. Maliyadeva The two teams will confront each other at the Ace Capital CC ground and a keenly contested game is expected due to the fact they are evenly balanced. Trinity, led by Rahal Amarasinghe, made it to the semis after finishing as the top team in their group. They have been in top form this season, having recorded back-to-back wins against Royal, the second of which was in the quarterfinal stage. On the other hand, Maliyadeva, led by Amesh Tennekoon, has been the most improved side in the ongoing school's tournament as they got the better of fancied teams before ending as the second-best team in their group and got the better of St. Sebastian’s Moratuwa in the quarterfinals to advance to the semis. St. Joseph’s vs. St. Benedict’s The two teams will clash at Mt. Lavinia, and this game too could see a closely contested tussle for supremacy. St. Joseph's, led by Sri Lanka youth player Sadeesh Jayawardena, ended the league matches of the tournament as the second-best team in their group before overcoming Wesley in the quarterfinals to advance to the semis. St. Benedict's, led by Chamath Chathurya, has had a successful stint in the league encounters, ending up as the third-best team in their group and getting the better of Richmond in the quarterfinal encounter to make it to the semis. The Teams: Trinity: Rahal Amarasinghe (Captain), Vibhavith Ehelepola (Vice Captain), Theeraka Ranathunga, Supun Waduge, Manula Kularatne, Tharana Wimaladharma, Kusal Wijethunga, Dinusha Pieris, Dinuka Tennakoon, Jayavi Liyanagama, Janith Warnakula, Malith Rathnayake, Lakvin Abeysinghe, Vathila Udara, Yewan Hulangamuwa, Viduka Dhammage, Naveen Ekanayake (Head Coach), Lakshitha Alahakoon (Asst. Coach), Bryan Senaratne (Master-in-charge). Maliyadeva: Amesh Tennakoon (Captain), Gayana Weerasinghe (Vice Captain), Jayamin Muthukumarana, Pasindu Menaka, Ushan Bimsara, Charuka Herath, Cahamathkar Hettiarachchi, Malith Kumarathunga, Dimath Abeysinghe, Thaveesha Balasooriya, Harasara Silva, Themiya Bandara, Arjun Sathsara, Ruchira Werahera, Chandupa Abeysinghe, Vishen Sadew, Gishan De Silva, Punsitha Roneth, Janaka Senevirathna (Head Coach), Jaliya Madushanka (Asst Coach), Mahinda Uduwerella (Master-in-charge). St. Joseph’s: Sadeesh Jayawardana (Captain), Lahiru Amarasekara (Vice Captain), Hirun Matheesha, Sahan Dabare, Abishek Jayaweera, Hiran Jayasundara, Muditha Lakshan, Dinuk Serasinghe, Kaven Pathirana, Yenula Dewthusa, Rishma Amarasinghe, Maanasa Madubashana, Dunick Perera, Gagan Chamod, Naren Muralidaran, R. De Alwis, Sasanka Ranaweera, Senod Soysa, Ashan Vilukshan, Asiri Caldera (Master in charge), Dilan Ramanayake (Head Coach), Dinal Dhambarage (Asst. Coach), Torin Pitigala (Asst. Coach). St. Benedict’s: Chamath Chathurya (Captain), Dilan Thabrew, Viduneth Wilson, Sheron Kannangara, Shenel Samarathunga, Sharujan Shanmuganathan, Kojitha Himsara, Vihara Aththnayaka, Mewan Dissanaike, Arshan Joseph, Yohan Edirisinghe, Nilakshana Jayakody, Haren Olagama, Nadun Fernando, Onesh Michael, S. Akshar, Aveesha Weerarathna, Dumindu Yehen, Sheran Dissanaike, Kevin Jason, Pemlal Fernando (Head coach), Madushan Kularathna (Asst. Coach), Rev. Br. Dilshan Vimukthi (Master-in-charge).","pubDate":"2023-04-02 21:21:27","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_fc53698dde.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Debonair Durani dies at 88","link":"https://kashmirreader.com/2023/04/03/debonair-durani-dies-at-88/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Salim Durani, the debonair India cricketer of the 1960s with a movie-star looks, a puckish sense of humour, and a penchant for hitting monstrous sixes on demand, died on Sunday. He was 88. His death was confirmed by sources close to the family. He had been living with his younger brother, Jahangir Durani, […]","content":"New Delhi: Salim Durani, the debonair India cricketer of the 1960s with a movie-star looks, a puckish sense of humour, and a penchant for hitting monstrous sixes on demand, died on Sunday. He was 88. His death was confirmed by sources close to the family. He had been living with his younger brother, Jahangir Durani, in Jamnagar, Gujarat. Durani had undergone a proximal femoral nail surgery after he broke his thigh bone in a fall in January this year. The Kabul-born Durani, who packed a punch with his bat and was also a handy left-arm orthodox bowler, played 29 Tests and was instrumental in India defeating England 2-0 in the historic five-match Test series in 1961-62, picking up eight and 10 wickets in the team’s victories at Calcutta and Madras respectively. Durani, known for his fine dressing style and swagger, scored just one century though he had seven fifties in the 50 innings he played for the country, scoring 1,202 runs. A decade after the epic triumph against England, he played a key role in helping India to victory against the West Indies in Port of Spain, dismissing both Clive Lloyd and Sir Garfield Sobers. The star cricketer also dabbled in Bollywood, starring opposite renowned actor Praveen Babi in the movie Charitra in 1973. Durani made his Test debut against Australia at in the beginning of 1960 at Mumbai’s Brabourne Stadium, and played his last international match — then only restricted to the traditional, five-day format — against England in February 1973. The venue was again the place where he had started his international career. The stylish cricketer aggregated 8,545 runs at 33.37 in first-class cricket and hit 14 hundreds. A joy to watch when in full flow, Durani had the ability to demolish any bowling attack on his day, though it was as a bowler he had first made his mark for the Indian team. India’s first Arjuna Award winner in cricket, Durani was a tall man and could get the ball to lift and turn on any surface with a bit of help. A fascinating character, the cricketer shared a special relation with the crowd, who once expressed their ire after he was dropped from the team for a match in Kanpur, and carried banners and placards that read ‘No Durani, no test!’. In domestic circuit, Durani represented Gujarat, Rajasthan and Saurashtra during a career that spanned two decades and a half. PTI Debonair Durani dies at 88 added by Press Trust of India on 1:41 am April 3, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-04-02 20:11:43","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Durani was a legend, an institution in himself: PM","link":"https://kashmirreader.com/2023/04/03/durani-was-a-legend-an-institution-in-himself-pm/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Prime Minister Narendra Modi called Salim Durani, who died on Sunday, an institution in himself who contributed immensely to India’s rise in the world of cricket. Durani, the stylish India cricketer of the 1960s known as much for his six-hitting prowess as for his movie-star looks and fine dressing sense, was 88 and […]","content":"New Delhi: Prime Minister Narendra Modi called Salim Durani, who died on Sunday, an institution in himself who contributed immensely to India’s rise in the world of cricket. Durani, the stylish India cricketer of the 1960s known as much for his six-hitting prowess as for his movie-star looks and fine dressing sense, was 88 and breathed his last in Jamnagar, Gujarat. Durani, who was born in Kabul, played 29 Tests and was a member of the India side that won the historic five-Test series against England in 1961-62. “Salim Durani Ji was a cricketing legend, an institution in himself. He made a key contribution to India’s rise in the world of cricket. On and off the field, he was known for his style. Pained by his demise. Condolences to his family and friends. May his soul rest in peace,” wrote Modi on twitter. The PM also remembered the late cricketer’s association with Gujarat. Durani played domestic cricket for Saurashtra and Gujarat. “Salim Durani Ji had a very old and strong association with Gujarat. He played for Saurashtra and Gujarat for a few years. He also made Gujarat his home. I have had the opportunity to interact with him and was deeply impressed by his multifaceted persona. He will surely be missed,” wrote Modi. Union Sports Minister Anurag Thakur said Durani inspired a generation of cricketers in India. “Sad to hear about the demise of Salim Durani Ji, a true inspiration to generations of cricketers in India. His talent and skills on the field will continue to inspire us,” said Thakur. BCCI secretary Jay Shah said Indian cricket had lost one of its crown jewels in Durani’s death. “Gutted to hear about the passing away of one of Team India legends Salim Durani. Today, we have lost one of Indian cricket’s crown jewels,” wrote Shah. Sachin Tendulkar in his condolence message wrote, “Deeply saddened to hear about the passing of Salim Durani ji. A really warm and loving person. My thoughts and prayers are with his family during this difficult time.” Former India chief coach Ravi Shastri said Durani was one of the most colourful cricketers the country had produced. “Easily one of the most colourful cricketers of India – Salim Durani,” tweeted Shastri. PTI Durani was a legend, an institution in himself: PM added by Press Trust of India on 1:41 am April 3, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-04-02 20:11:33","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Dogs bark on Joe’s dirty night, Crows win SA bragging rights, and Cats fall to bottom of ladder","link":"https://www.brisbanetimes.com.au/sport/afl/dogs-bark-on-joe-s-dirty-night-crows-win-sa-bragging-rights-and-cats-fall-to-bottom-of-ladder-20230331-p5cx4x.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu, Jon Pierik, Peter Ryan, Roy Ward, Andrew Stafford, Steve Barrett and Marc McGowan"],"video_url":null,"description":"There was plenty on the line in round three, including a coaching master going head-to-head against his one-time protégé. Elsewhere, the Bulldogs regained their bark but a big-name Lion is under the microscope, the Crows took bragging rights in the Showdown, and the reigning premiers slumped to the bottom of the ladder.","content":"Loading Western Bulldogs d Brisbane Lions The scrappy nature of the Dogs’ win is exactly what they needed to turn their season around. The club was built on blue-collar workers, and this is how they must play to maximise their potential. Coach Luke Beveridge recognised as much by selecting a team to exert pressure. The “Manhattan” forward line was worth a try but should be shelved. Though they never had all four towers – Aaron Naughton, Jamarra Ugle-Hagan, Rory Lobb and Sam Darcy – in there together, Darcy’s omission enabled them to pick an extra small forward, Arthur Jones , who set the tone with his speed and energy. There is a Simpsons meme where Lenny tells Homer’s co-workers at the nuclear power plant: “Get ready, everybody, he’s about to do something stupid”. There must be plenty of Lions fans who feel the same way about Joe Daniher . Unlike Homer, Daniher is prodigiously talented, but he is prone to too many moments of madness for a player of his ability and experience. Teammates can sympathise with a bout of yips in front of goal, but they are less forgiving when, with the game on the line, they make position and are torched by a turn-and-burn Hail Mary from outside 50. Coach Chris Fagan has foreshadowed an uncomfortable review on Daniher’s game. – Andrew Wu Chris Fagan flagged a tough review for Joe Daniher after the loss to the Bulldogs. Credit: Getty Images Collingwood d Richmond Big crowd, big occasion, and it was the Magpies who again proved they are made of the right stuff. Forget the final margin because Collingwood were clearly the better side. There is probably still a slight query on their no-frills forward line, with recruit Dan McStay yet to take a match by the scruff of the neck. But they will have no shortage of supply if Jordan De Goey , Tom Mitchell , Steele Sidebottom and Jack Crisp keep playing the way they are. Billy Frampton ’s arrival also gives coach Craig McRae options for the opposition’s best key forward, too, after a superb shutdown job on usual Pies nemesis Tom Lynch . As for the Tigers, there must be some concern despite them having a genuine excuse with a lengthy injury list. The cavalry – Dustin Martin , Jayden Short and Jacob Hopper – is on its way for Saturday’s clash with a Western Bulldogs team just as desperate for a win. It’s far too early to panic, but Richmond haven’t shown the same high gear as other top sides so far this year. They need more from players outside of Liam Baker and Daniel Rioli . – Marc McGowan Hawthorn d North Melbourne This was billed as a grudge match between master coach Alastair Clarkson and his one-time protege Sam Mitchell . And the smile on Mitchell’s face once this clash in Launceston was done indicated yes, he was happy to have banked the Hawks’ first four points of the season, but also relieved that his first head-to-head meeting against Clarkson had gone his way. Mitchell tactically had the better of Clarkson. The latter opted to have his men defend space, rather than a player, through the midfield. Mitchell counter-attacked by instructing his team to chip its way through the zone and hold possession. It worked a treat, for Jai Newcombe, Will Day, Dylan Moore and, particularly in the first half, Changkouth Jiath , used their skills well. The Hawks led by 31 points early in the third term. The Kangaroos rallied late, but the Hawks – with three goals by Tyler Brockman in his first senior game since 2021 – hung tough. The Roos clearly missed two of their prime midfielders, skipper Jy Simpkin (suspended) and Luke Davies-Uniacke (tight calf), who withdrew in the warm-up. Rookie standout Harry Sheezel was superb, and did his best to drag the Roos to what would have been a third straight win. The Hawks remain a major work in progress, and desperately need a marking tall up forward, but this win eases what had been a burning spotlight on a rebuild in its infancy. – Jon Pierik Carlton d GWS Like many other teams, the Blues are making an effort to keep intensity high in their midfield and rest their guns, so Patrick Cripps , despite his 42-possession masterclass, spent time “resting” in the forward line late in Saturday’s win over the Giants. “We have to get intensity around the ball for four quarters so when he came on the field, he ended up going deep forward, but that was more to do with giving him a rest. He was pretty handy across the day, wasn’t he?” Blues coach Michael Voss said. The Blues also have a very impressive defensive stopper in Nic Newman , who kept GWS skipper Toby Greene to one of the quietest days of his career. Voss praised Newman’s first month of 2023. Speaking of intensity, Matt Owies (hamstring) and Blake Acres (shoulder) have played important roles up forward and in the midfield this season, but both are under clouds with Owies subbed out with a “minor hamstring” while Acres was clearly hurting but played out the game. He has also been given a one-game ban by the match review officer. – Roy Ward Patrick Cripps picked up 42 touches in the win over GWS. Credit: Getty Images St Kilda d Essendon It is no mean feat to win the first three games of the season, and St Kilda’s improvement under Ross Lyon is evident already. They kicked 71 points on turnover and responded twice when challenged by the Bombers after making a great start when all eyes were on the group leading into the 150th anniversary game. Callum Wilkie has now reeled off 88 games in a row since St Kilda gave him a chance, and his match against Essendon was one of his best, standing tall as captain on a huge night for the club. He took seven intercept marks and made it impossible for the Bombers to score in the first 20 minutes. Up the other end of the ground the two smalls – Jack Higgins and Dan Butler – are getting the job done, bringing pressure and experience to support their young teammates inside 50. As for Mason Wood , he is a revitalised player at the Saints, with his talent shining through on a consistent basis, even though he may be in doubt for next week with a shoulder injury. Essendon showed grit and fight and belief in what coach Brad Scott is doing when they came back from five goals down to draw level in the final quarter. They did not deserve to win, but they provided a contest, which is an improvement on recent seasons. - Peter Ryan Adelaide d Port Adelaide Riley Thilthorpe kicked five in the Showdown. Credit: Getty Images By shelving their tired Jekyll-and-Hyde act, Adelaide showcased what their A-grade best looks like for decent stretches in their impressive Showdown win over Port Adelaide. Little separated the two teams across the first three engrossing quarters – typical of what is arguably the AFL’s finest modern-day rivalry – before the Crows turned on the afterburners with six unanswered goals in the last 20 minutes. Pivotal to Adelaide’s victory were the performances of new captain and Showdown medallist Jordan Dawson , Riley Thilthorpe (five goals) and Izak Rankine (four). By design, the Crows – by trade and draft – have heavily leant towards acquiring and enticing homegrown stars like Dawson (Sturt), Thilthorpe and Rankine (both West Adelaide), as well as the injured Darcy Fogarty (Glenelg). Badly and regularly burnt by the defection of several homesick draftees from interstate, Adelaide now boasts a number of emerging stars who will be Crows lifers. Making the Showdown victory even sweeter, Adelaide (11th) leapt ahead of the Power (12th) on percentage in the process. When the floodgates opened down the stretch, Port were powerless to quell the Crows’ rampant forward forays. The Power’s defence, so often the calling card of the Ken Hinkley era, has bled badly over the past fortnight. The once laughable suggestion that Port could finish below Adelaide on the ladder now looms a genuine possibility. - Steve Barrett Gold Coast d Geelong Loading This was an important win for the Suns, relieving some pressure on coach Stuart Dew after a poor start to the season. It was also a fitting tribute to the brave and selfless David Swallow in his 200th game. But perhaps most of all it was the moment that Jack Lukosius truly arrived as a footballer of substance. The No.2 draft pick of 2018 was the match-winner, his 65-metre drop punt in the last quarter a moment to remember. Questions will inevitably be asked about the Cats’ premiership defence, particularly now they find themselves on the bottom of the ladder as the league’s only winless team. But they have got the unfancied Hawthorn and the West Coast Eagles to come, and don’t forget; they did string 16 unbroken wins together on their way to last year’s flag. – Andrew Stafford Melbourne d Sydney September is when the Dees would like to see the real value of the Brodie Grundy trade come through, but there are already dividends in the first week of April. Playing in just his third game since being injured on Anzac Day last year, Grundy looked every bit the player who had been the competition’s premier ruckman before Max Gawn’s rise. He can still break his rivals’ hearts with his endurance, and his work below his knees means he effectively is an extra midfielder once the ball hits the ground. The true test of Grundy’s recruitment will come when Gawn returns, and we have a better guide as to how well the dream combination on paper functions on the field. As well as Sydney fared last year, there is a considerable gap between the Swans’ midfield and that of the competition’s heavyweights. Their onball brigade is vulnerable against the bigger bodies of the established teams. The Demons tore them apart in the hunt for contested ball; an area they were brutally exposed in last year’s grand final. Luke Parker has a decade of credits to forgive a rare bad day, but if the Swans are to threaten then next-generation midfielders Chad Warner and James Rowbottom , who have developed quickly for their age, can’t go missing as they did against the Dees. Road trips to Geelong (round six) and Collingwood (round eight) are their next big tests. – Andrew Wu Fremantle d West Coast What do you do with Luke Jackson when Sean Darcy is dominating in the ruck? Jackson is a premiership player and game-changing big man, but he is still finding his place at his new club. He made a good fist of his time forward in Sunday’s derby, kicking two goals, taking a big mark. Seven tackles for the match was also a highlight. Darcy had 52 hit outs, 20 touches and a goal, which was impressive, even with the Eagles decimated by injuries. When Darcy is dominating, Freo will need to find ways to get Jackson into the play as well. The queue outside the Eagles medical room just got longer, with Luke Shuey , Jeremy McGovern , Jamie Cripps and Alex Witherden all going down, leaving Adam Simpson with no bench for the final term. Hopefully, Shuey didn’t damage his hand when he punched the wall in frustration. On a final topic, Dockers flyer Michael Frederick and his backflip celebration needs to be encouraged at all costs, such acrobatics and unbridled joy is a great advertisement for the AFL. - Roy Ward Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers North Melbourne Kangaroos Analysis Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Roy Ward is a sports writer, live blogger and breaking news journalist. He's been writing for The Age since 2010. Connect via Twitter or email . Andrew Stafford is a columnist. Steve Barrett writes about sport for The Age. Marc McGowan is a sports reporter for The Age Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-04-02 19:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Remembering Salim Durani: A genuine folk hero","link":"https://economictimes.indiatimes.com/news/sports/remembering-salim-durani-a-genuine-folk-hero/articleshow/99194616.cms","keywords":null,"creator":null,"video_url":null,"description":"Salim Durani, the former India all-rounder known for his ability to hit sixes, has passed away at the age of 88. Despite modest figures, Durani earned respect and admiration from those who played with or against him. He was born in Kabul but denied it and had a light touch with people. Financial setbacks and health challenges did not daunt him, and he was a genuine folk hero in the cricketing universe, where his name rang all over.","content":"Synopsis Salim Durani, the former India all-rounder known for his ability to hit sixes, has passed away at the age of 88. Despite modest figures, Durani earned respect and admiration from those who played with or against him. He was born in Kabul but denied it and had a light touch with people. Financial setbacks and health challenges did not daunt him, and he was a genuine folk hero in the cricketing universe, where his name rang all over. At a time when a cricketer can become a household name after just one big knock in an IPL match, Durani would have been a massive draw. If you needed proof that not everything can be measured in numbers look no further than Salim Durani , the 88-year-old former India all-rounder who breathed his last in Jamnagar early on Sunday morning. Durani played 29 Tests, scoring 1202 runs and taking 75 wickets. But, ask anyone who played with him or against him and they speak of him with respect and affection. The most famous stories about Durani are about his ability to hit sixes at will. While no batsman can lay claim to a 100% record when it comes to something like this, those of a certain age remember crowds persistently yelling “we want sixer!” And Durani obliged them with a clean swing of the bat at the earliest possible instance. Although he hit a long ball, Durani never claimed to be a power hitter. In later conversations, he would only say that he lifted the ball over the fielder. The other famous bit about Durani is a contentious one. While it is widely believed that he was born in Kabul, this is something Durani has denied in interviews, going to the extent of saying he has never even been to Kabul. But, then again, this just adds to the myth. What is a fact is that Durani would sometimes demand the ball off Ajit Wadekar , his captain, when Garry Sobers was in full cry and dismiss arguably the best allrounder of all time with his leftarm orthodox spin. One such famous instance was in 1971 when India won their maiden Test in the West Indies. Durani had Clive Lloyd and Sobers in space of a few balls, setting up a sevenwicket win in Port of Spain. In that spell, Durani conceded only 21 runs in the 17 overs he bowled. A flamboyant character who enjoyed a drink, Durani has seen a lot of what life downs. From financial setbacks to health challenges, Durani endured it all after his playing days ended. But, when he was at his peak, Durani was a genuine folk hero. At a time before the world was a global village, Durani’s name rang around the cricketing universe. This was not fame fuelled by social media or celebrity, but by the respect of peers and the love of the common man. Durani had a light touch with people, equally comfortable smoking a cigarette at a corner tea stall and riding with maharajas in the fanciest of cars. When asked about tough times, Durani would inevitably shrug it off: whose life doesn’t come with difficulties, he would ask, with a characteristic laugh. Inevitable when asked how he managed to keep this attitude going, there would be a glint in his eye. “The problem comes when you try to control life. If you understand that life is bigger and go with the flow, everything becomes easier.” At a time when a cricketer can become a household name after just one big knock in an IPL match, Durani would have been a massive draw. But, you suspect, he was quite happy to have been a man of another era, a more forgiving, more genuine one. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Sunday, 02 Apr, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front page Pure Politics Bottom Line Deep Dive More GST Collections in March Jump 13% to ₹1.6 Lakh Crore India’s monthly goods and services tax (GST) collections hit the second highest ever in March, rising 13% from a year earlier to ₹1.6 lakh crore, suggesting economic strength despite several headwinds. Want PM Modi to have a Successful G20 Summit The US shares India’s G20 agenda and is doing everything to make the country’s presidency a success, said US G20 head of delegation Christina Segal-Knowles. While the G20 is not the forum for geopolitical issues, to the extent that the Ukraine war impacts economics, the grouping can’t avoid the topic, she said in an interview with Deepshikha Sikarwar. SUVs Boost Car Sales to Record 3.9 M in FY23 India’s passenger vehicle sales rose 27% to a record 3.9 million units in the last fiscal year ended Friday, as improved component supplies helped automakers step up production to meet strong demand and clear order backlog. Read More News on salim durani cricket ajit wadekar garry sobers Indian cricketer fact (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Finance Bill 2023 takes the sheen off debt funds. Will bank FDs become more lucrative? 9 mins read Strategy Naatu Naatu roars: How RRR used Hollywood feedback loop and social media for the Oscar win 10 mins read Under the lens Learnings from SVB and Credit Suisse: Two tales of systematic and unsystematic risks 6 mins read Subscribe to ETPrime","pubDate":"2023-04-02 19:26:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-12530,resizemode-4,msid-99194616/remembering-salim-durani-a-genuine-folk-hero.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Bangladesh beat Afghanistan to win Tri-Nations U-19 final","link":"https://www.ft.lk/sports/Bangladesh-beat-Afghanistan-to-win-Tri-Nations-U-19-final/23-746994","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Left-arm spinner Mahfuzur Rahman Rabby took six wickets for 29 to bowl Bangladesh to a six-wicket win over Afghanistan in the final of the Tri-Nations Under-19 cricket tournament in Abu Dhabi. Mahfuzur’s destructive spell saw the strong Afghanistan batting humbled for 143 in 37 overs with Haroon Khan being the only batsman to make any sort of contribution scoring a well struck 65 off 62 balls (7 fours). Bangladesh had no difficulty in reaching the target of 144 in 23 overs losing four wickets to crown themselves champions. Sri Lanka were the third team in the competition.","pubDate":"2023-04-02 19:11:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Cricketers Mahela, Mohan excel at inaugural Ananda-Nalanda golf tourney","link":"https://www.ft.lk/sports/Cricketers-Mahela--Mohan-excel-at-inaugural-Ananda-Nalanda-golf-tourney/23-746993","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Overall Winner - Nalanda College: Mahela Jayawardene receiving his trophy and gift from Ananda College Golf Captain Wasantha de Silva and Vice-Captain Primal Wijayanayake Two cricketing stalwarts of SSC – Mahela Jayawardene and Mohan de Silva showed their hand in a different sport when they emerged winners for their respective alma maters in the inaugural Ananda-Nalanda ‘Big Match’ golf encounter themed ‘First Flight’ held at the Royal Colombo Golf Club course last week. The tournament was played in a stableford format, with Ananda College emerging champions. Mohan de Silva emerged Overall Winner for Ananda with 41 points while Dehan de Silva was the Overall Runner-up with 37 points (B/B9). For Nalanda, Mahela Jayawardene was the Overall Winner with 35 points with Anura Balasooriya, the Overall Runner-up with 34 points. “We are absolutely thrilled to have won the inaugural Maroon Golf tournament against our rivals and brothers Nalanda. It was great competition, and we played our best golf to come out on top. We all played as a team, and we enjoyed every minute of it,” said Ananda College golf team Captain Wasantha de Silva. Nalanda team Captain Mahela Jayawardene said: “As the hosts of the first ever Ananda-Nalanda Golf Tournament, we are proud of how we played, and we are already looking forward to the rematch next year.” The success of the tournament has paved the way for future competitions between the two colleges, with plans already underway for a bigger and better tournament next year.","pubDate":"2023-04-02 19:11:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Sri Lanka coming to Zimbabwe for Cricket World Cup qualifiers","link":"https://www.chronicle.co.zw/sri-lanka-coming-to-zimbabwe-for-cricket-world-cup-qualifiers/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter ASIA Cup champions, Sri Lanka have missed out on direct qualification for the upcoming 2023 International Cricket Council (ICC) World Cup and are set to participate in the qualifiers which will be hosted in Zimbabwe in June. The reigning Asian champions’ hopes of directly booking their ticket to the World Cup […]","content":"The Chronicle ASIA Cup champions, Sri Lanka have missed out on direct qualification for the upcoming 2023 International Cricket Council (ICC) World Cup and are set to participate in the qualifiers which will be hosted in Zimbabwe in June. The reigning Asian champions’ hopes of directly booking their ticket to the World Cup went up in smoke after losing their three-match One Day International (ODI) series against New Zealand 2-0 after the second match of the series was abandoned due to rain hence only two matches taking place. This marks the first time in 44 years that the Sri Lankan team will have to play qualifiers in order to earn their place in the World Cup. Sri Lanka went into the final match needing nothing short of a win to keep their thin hopes of qualifying alive and also hoping that the other two nations vying for the remaining one slot slip up in their games as well. The two teams with some hope of snatching the spot are South Africa and Ireland. The Asian nation, on 81 points, are sitting in position 10 in the Super League thus failing to overtake the West Indies who are eighth place with 88 points and have played all their matches. Meanwhile, a series win for South Africa against the Netherlands will take them to 98 points, effectively securing position eight in the standings. They, however, face a threat from Ireland who have a series against Bangladesh (The Tigers) in May. The series in May will take place in Chelmsford, England. This is due to better weather in England than in Ireland, leading to a better chance of full matches being played and producing results. For the Irish to have hopes of direct qualification, they need to whitewash The Tigers which will take them to 98 points, level with South Africa. Sri Lanka cricket Both teams will have nine wins each, number of wins is the first tie-breaker thus since having equal victories, net-run rate will come into play. Zimbabwe hosted the previous qualifiers to the 2019 edition in England and were awarded the opportunity of hosting again this year. The tournament is scheduled for 18 June to 9 July at venues soon to be announced. India, New Zealand, Australia, Pakistan, Bangladesh, England and Afghanistan are the teams whose places at the World Cup are guaranteed. — @brandon_malvin","pubDate":"2023-04-02 22:03:09","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Sri Lanka seal dramatic win over New Zealand","link":"https://www.herald.co.zw/sri-lanka-seal-dramatic-win-over-new-zealand/","keywords":["Sport"],"creator":["dayton"],"video_url":null,"description":"AUCKLAND. — Sri Lanka claimed a dramatic Super Over win in the opening match of their three-game Twenty20 cricket series against New Zealand yesterday to earn their first victory on tour. The match went to a tie-break decider after both teams chalked up 196 runs in a high-scoring thriller at Auckland’s Eden Park. New Zealand […]","content":"Tadious Manyepo-Sports Reporter CAPS United . . . . . . . . . . . . . . . (0) 1 ZPC Kariba . . . . . . . . . . . . . . . . . 0 THIS Castle Lager Premier Soccer League tie at the National Sports Stadium yesterday […] Oscar Rusenga in TRIANGLE Triangle Utd . . . . . . . . . . . . . . . . . . . . 0 Ngezi Platinum Stars . . . . . . . . . . . . 0 TRIANGLE battled hard for a point at home despite playing the last […] Innocent Kurira, in BULAWAYO Highlanders . . . . . . . . . . . . . . . (2) 2 FC Platinum. . . . . . . . . . . . . . . (0) 1 HIGHLANDERS finally ended their nine-year winless streak against FC Platinum in the Castle Lager […]","pubDate":"2023-04-02 22:01:18","image_url":null,"source_id":"herald_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Eagles women to play in two domestic finals","link":"https://www.chronicle.co.zw/eagles-women-to-play-in-two-domestic-finals/","keywords":["Sport"],"creator":["peter"],"video_url":null,"description":"Brandon Moyo, Sports Reporter EAGLES women’s cricket team are set to play in two domestic finals to cap off their brilliant 2023 inter-provincial season. The Harare-based side will be up against Mega Market Mountaineers in the Women’s T20 Cup final and will also face Rhinos in the Fifty50 Challenge title decider. The dates for the […]","content":"The Chronicle EAGLES women’s cricket team are set to play in two domestic finals to cap off their brilliant 2023 inter-provincial season. The Harare-based side will be up against Mega Market Mountaineers in the Women’s T20 Cup final and will also face Rhinos in the Fifty50 Challenge title decider. The dates for the finals are yet to be set. Eagles, who are under the stewardship of Trevor Garwe booked their place in the Fifty50 Challenge final after topping the standings with 40 points from six matches. From the six matches played, they won four and lost two. In their two matches against other finalists, Rhinos, they convincingly won one game and lost the other. Their first game against Rhinos which they won by 130 runs was their second of the campaign having beaten Mountaineers by seven wickets in the season opener. Eagles went on to suffer their first defeat in the third match against Tuskers when they lost by 48 runs before going on to complete the double over Mountaineers with a 41 runs win. Their second defeat of the season came at the hands of Rhinos who beat them by 39 runs early last month before they capped off their brilliant run with a six wicket win over Tuskers to top the standings and put one hand on the trophy. Rhinos in second place also won four and lost two and the two teams were separated by net-run rate. In the shortest version, the T20 Cup, Eagles finished in second place with 40 points, 10 behind log leaders Mountaineers who have 50. The 40 points came from four wins and two defeats in six matches while log leaders and fellow finalists, Mountaineers won five matches out of six as well. Eagles won their first four opening matches against Tuskers (eight wickets), Rhinos (eight wickets), Mountaineers (eight wickets) and Tuskers again (three runs). The two defeats came against Rhinos (26 runs) and Mountaineers (64 runs). They were the only team to beat the Mountaineers in the competition. The two finals are set to bring the curtain down on the women’s domestic season which began in February. — @brandon_malvin","pubDate":"2023-04-02 22:01:17","image_url":null,"source_id":"chronicle_zw","category":["sports"],"country":["Zimbabwe"],"language":"english"},{"title":"Trinity, Maliyadeva, St. Joseph’s, St. Benedict’s battle for final berths","link":"https://www.dailymirror.lk/sports/Trinity--Maliyadeva--St--Joseph’s--St--Benedict’s-battle-for-final-berths/322-257027","keywords":null,"creator":null,"video_url":null,"description":"Four top cricket-playing schools, Trinity, Maliyadeva, St. Joseph’s, and St. Benedict’s, will battle it out in the two semifinals of the Under-19 inter-schools Division One Tier ‘A’, scheduled to be played at the Ace Capital CC ground in Colombo and the S. Thomas’ ground in Mt. Lavinia 03rd and 4th to book the berths to the final.","content":"Under-19 inter-school Division One Tier \"A\" semifinals By M. Shamil Amit Four top cricket-playing schools, Trinity, Maliyadeva, St. Joseph's, and St. Benedict's, will battle it out in the two semifinals of the Under-19 inter-schools Division One Tier ‘A', scheduled to be played at the Ace Capital CC ground in Colombo and the S. Thomas’ ground in Mt. Lavinia 03rd and 4th to book the berths to the final. Trinity vs. Maliyadeva The two teams will confront each other at the Ace Capital CC ground and a keenly contested game is expected due to the fact they are evenly balanced. Trinity, led by Rahal Amarasinghe, made it to the semis after finishing as the top team in their group. They have been in top form this season, having recorded back-to-back wins against Royal, the second of which was in the quarterfinal stage. On the other hand, Maliyadeva, led by Amesh Tennekoon, has been the most improved side in the ongoing school's tournament as they got the better of fancied teams before ending as the second-best team in their group and got the better of St. Sebastian’s Moratuwa in the quarterfinals to advance to the semis. St. Joseph’s vs. St. Benedict’s The two teams will clash at Mt. Lavinia, and this game too could see a closely contested tussle for supremacy. St. Joseph's, led by Sri Lanka youth player Sadeesh Jayawardena, ended the league matches of the tournament as the second-best team in their group before overcoming Wesley in the quarterfinals to advance to the semis. St. Benedict's, led by Chamath Chathurya, has had a successful stint in the league encounters, ending up as the third-best team in their group and getting the better of Richmond in the quarterfinal encounter to make it to the semis. The Teams: Trinity: Rahal Amarasinghe (Captain), Vibhavith Ehelepola (Vice Captain), Theeraka Ranathunga, Supun Waduge, Manula Kularatne, Tharana Wimaladharma, Kusal Wijethunga, Dinusha Pieris, Dinuka Tennakoon, Jayavi Liyanagama, Janith Warnakula, Malith Rathnayake, Lakvin Abeysinghe, Vathila Udara, Yewan Hulangamuwa, Viduka Dhammage, Naveen Ekanayake (Head Coach), Lakshitha Alahakoon (Asst. Coach), Bryan Senaratne (Master-in-charge). Maliyadeva: Amesh Tennakoon (Captain), Gayana Weerasinghe (Vice Captain), Jayamin Muthukumarana, Pasindu Menaka, Ushan Bimsara, Charuka Herath, Cahamathkar Hettiarachchi, Malith Kumarathunga, Dimath Abeysinghe, Thaveesha Balasooriya, Harasara Silva, Themiya Bandara, Arjun Sathsara, Ruchira Werahera, Chandupa Abeysinghe, Vishen Sadew, Gishan De Silva, Punsitha Roneth, Janaka Senevirathna (Head Coach), Jaliya Madushanka (Asst Coach), Mahinda Uduwerella (Master-in-charge). St. Joseph’s: Sadeesh Jayawardana (Captain), Lahiru Amarasekara (Vice Captain), Hirun Matheesha, Sahan Dabare, Abishek Jayaweera, Hiran Jayasundara, Muditha Lakshan, Dinuk Serasinghe, Kaven Pathirana, Yenula Dewthusa, Rishma Amarasinghe, Maanasa Madubashana, Dunick Perera, Gagan Chamod, Naren Muralidaran, R. De Alwis, Sasanka Ranaweera, Senod Soysa, Ashan Vilukshan, Asiri Caldera (Master in charge), Dilan Ramanayake (Head Coach), Dinal Dhambarage (Asst. Coach), Torin Pitigala (Asst. Coach). St. Benedict’s: Chamath Chathurya (Captain), Dilan Thabrew, Viduneth Wilson, Sheron Kannangara, Shenel Samarathunga, Sharujan Shanmuganathan, Kojitha Himsara, Vihara Aththnayaka, Mewan Dissanaike, Arshan Joseph, Yohan Edirisinghe, Nilakshana Jayakody, Haren Olagama, Nadun Fernando, Onesh Michael, S. Akshar, Aveesha Weerarathna, Dumindu Yehen, Sheran Dissanaike, Kevin Jason, Pemlal Fernando (Head coach), Madushan Kularathna (Asst. Coach), Rev. Br. Dilshan Vimukthi (Master-in-charge).","pubDate":"2023-04-02 21:21:27","image_url":"https://bmkltsly13vb.compat.objectstorage.ap-singapore-1.oraclecloud.com/cdn.sg.dailymirror.lk/assets/uploads/image_fc53698dde.jpg","source_id":"dailymirror","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Debonair Durani dies at 88","link":"https://kashmirreader.com/2023/04/03/debonair-durani-dies-at-88/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Salim Durani, the debonair India cricketer of the 1960s with a movie-star looks, a puckish sense of humour, and a penchant for hitting monstrous sixes on demand, died on Sunday. He was 88. His death was confirmed by sources close to the family. He had been living with his younger brother, Jahangir Durani, […]","content":"New Delhi: Salim Durani, the debonair India cricketer of the 1960s with a movie-star looks, a puckish sense of humour, and a penchant for hitting monstrous sixes on demand, died on Sunday. He was 88. His death was confirmed by sources close to the family. He had been living with his younger brother, Jahangir Durani, in Jamnagar, Gujarat. Durani had undergone a proximal femoral nail surgery after he broke his thigh bone in a fall in January this year. The Kabul-born Durani, who packed a punch with his bat and was also a handy left-arm orthodox bowler, played 29 Tests and was instrumental in India defeating England 2-0 in the historic five-match Test series in 1961-62, picking up eight and 10 wickets in the team’s victories at Calcutta and Madras respectively. Durani, known for his fine dressing style and swagger, scored just one century though he had seven fifties in the 50 innings he played for the country, scoring 1,202 runs. A decade after the epic triumph against England, he played a key role in helping India to victory against the West Indies in Port of Spain, dismissing both Clive Lloyd and Sir Garfield Sobers. The star cricketer also dabbled in Bollywood, starring opposite renowned actor Praveen Babi in the movie Charitra in 1973. Durani made his Test debut against Australia at in the beginning of 1960 at Mumbai’s Brabourne Stadium, and played his last international match — then only restricted to the traditional, five-day format — against England in February 1973. The venue was again the place where he had started his international career. The stylish cricketer aggregated 8,545 runs at 33.37 in first-class cricket and hit 14 hundreds. A joy to watch when in full flow, Durani had the ability to demolish any bowling attack on his day, though it was as a bowler he had first made his mark for the Indian team. India’s first Arjuna Award winner in cricket, Durani was a tall man and could get the ball to lift and turn on any surface with a bit of help. A fascinating character, the cricketer shared a special relation with the crowd, who once expressed their ire after he was dropped from the team for a match in Kanpur, and carried banners and placards that read ‘No Durani, no test!’. In domestic circuit, Durani represented Gujarat, Rajasthan and Saurashtra during a career that spanned two decades and a half. PTI Debonair Durani dies at 88 added by Press Trust of India on 1:41 am April 3, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-04-02 20:11:43","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Durani was a legend, an institution in himself: PM","link":"https://kashmirreader.com/2023/04/03/durani-was-a-legend-an-institution-in-himself-pm/","keywords":["SPORTS"],"creator":["Press Trust of India"],"video_url":null,"description":"New Delhi: Prime Minister Narendra Modi called Salim Durani, who died on Sunday, an institution in himself who contributed immensely to India’s rise in the world of cricket. Durani, the stylish India cricketer of the 1960s known as much for his six-hitting prowess as for his movie-star looks and fine dressing sense, was 88 and […]","content":"New Delhi: Prime Minister Narendra Modi called Salim Durani, who died on Sunday, an institution in himself who contributed immensely to India’s rise in the world of cricket. Durani, the stylish India cricketer of the 1960s known as much for his six-hitting prowess as for his movie-star looks and fine dressing sense, was 88 and breathed his last in Jamnagar, Gujarat. Durani, who was born in Kabul, played 29 Tests and was a member of the India side that won the historic five-Test series against England in 1961-62. “Salim Durani Ji was a cricketing legend, an institution in himself. He made a key contribution to India’s rise in the world of cricket. On and off the field, he was known for his style. Pained by his demise. Condolences to his family and friends. May his soul rest in peace,” wrote Modi on twitter. The PM also remembered the late cricketer’s association with Gujarat. Durani played domestic cricket for Saurashtra and Gujarat. “Salim Durani Ji had a very old and strong association with Gujarat. He played for Saurashtra and Gujarat for a few years. He also made Gujarat his home. I have had the opportunity to interact with him and was deeply impressed by his multifaceted persona. He will surely be missed,” wrote Modi. Union Sports Minister Anurag Thakur said Durani inspired a generation of cricketers in India. “Sad to hear about the demise of Salim Durani Ji, a true inspiration to generations of cricketers in India. His talent and skills on the field will continue to inspire us,” said Thakur. BCCI secretary Jay Shah said Indian cricket had lost one of its crown jewels in Durani’s death. “Gutted to hear about the passing away of one of Team India legends Salim Durani. Today, we have lost one of Indian cricket’s crown jewels,” wrote Shah. Sachin Tendulkar in his condolence message wrote, “Deeply saddened to hear about the passing of Salim Durani ji. A really warm and loving person. My thoughts and prayers are with his family during this difficult time.” Former India chief coach Ravi Shastri said Durani was one of the most colourful cricketers the country had produced. “Easily one of the most colourful cricketers of India – Salim Durani,” tweeted Shastri. PTI Durani was a legend, an institution in himself: PM added by Press Trust of India on 1:41 am April 3, 2023 View all posts by Press Trust of India → Press Trust of India Facebook Twitter WhatsApp Email Print Related","pubDate":"2023-04-02 20:11:33","image_url":null,"source_id":"kashmirreader","category":["sports"],"country":["india"],"language":"english"},{"title":"Dogs bark on Joe’s dirty night, Crows win SA bragging rights, and Cats fall to bottom of ladder","link":"https://www.brisbanetimes.com.au/sport/afl/dogs-bark-on-joe-s-dirty-night-crows-win-sa-bragging-rights-and-cats-fall-to-bottom-of-ladder-20230331-p5cx4x.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Andrew Wu, Jon Pierik, Peter Ryan, Roy Ward, Andrew Stafford, Steve Barrett and Marc McGowan"],"video_url":null,"description":"There was plenty on the line in round three, including a coaching master going head-to-head against his one-time protégé. Elsewhere, the Bulldogs regained their bark but a big-name Lion is under the microscope, the Crows took bragging rights in the Showdown, and the reigning premiers slumped to the bottom of the ladder.","content":"Loading Western Bulldogs d Brisbane Lions The scrappy nature of the Dogs’ win is exactly what they needed to turn their season around. The club was built on blue-collar workers, and this is how they must play to maximise their potential. Coach Luke Beveridge recognised as much by selecting a team to exert pressure. The “Manhattan” forward line was worth a try but should be shelved. Though they never had all four towers – Aaron Naughton, Jamarra Ugle-Hagan, Rory Lobb and Sam Darcy – in there together, Darcy’s omission enabled them to pick an extra small forward, Arthur Jones , who set the tone with his speed and energy. There is a Simpsons meme where Lenny tells Homer’s co-workers at the nuclear power plant: “Get ready, everybody, he’s about to do something stupid”. There must be plenty of Lions fans who feel the same way about Joe Daniher . Unlike Homer, Daniher is prodigiously talented, but he is prone to too many moments of madness for a player of his ability and experience. Teammates can sympathise with a bout of yips in front of goal, but they are less forgiving when, with the game on the line, they make position and are torched by a turn-and-burn Hail Mary from outside 50. Coach Chris Fagan has foreshadowed an uncomfortable review on Daniher’s game. – Andrew Wu Chris Fagan flagged a tough review for Joe Daniher after the loss to the Bulldogs. Credit: Getty Images Collingwood d Richmond Big crowd, big occasion, and it was the Magpies who again proved they are made of the right stuff. Forget the final margin because Collingwood were clearly the better side. There is probably still a slight query on their no-frills forward line, with recruit Dan McStay yet to take a match by the scruff of the neck. But they will have no shortage of supply if Jordan De Goey , Tom Mitchell , Steele Sidebottom and Jack Crisp keep playing the way they are. Billy Frampton ’s arrival also gives coach Craig McRae options for the opposition’s best key forward, too, after a superb shutdown job on usual Pies nemesis Tom Lynch . As for the Tigers, there must be some concern despite them having a genuine excuse with a lengthy injury list. The cavalry – Dustin Martin , Jayden Short and Jacob Hopper – is on its way for Saturday’s clash with a Western Bulldogs team just as desperate for a win. It’s far too early to panic, but Richmond haven’t shown the same high gear as other top sides so far this year. They need more from players outside of Liam Baker and Daniel Rioli . – Marc McGowan Hawthorn d North Melbourne This was billed as a grudge match between master coach Alastair Clarkson and his one-time protege Sam Mitchell . And the smile on Mitchell’s face once this clash in Launceston was done indicated yes, he was happy to have banked the Hawks’ first four points of the season, but also relieved that his first head-to-head meeting against Clarkson had gone his way. Mitchell tactically had the better of Clarkson. The latter opted to have his men defend space, rather than a player, through the midfield. Mitchell counter-attacked by instructing his team to chip its way through the zone and hold possession. It worked a treat, for Jai Newcombe, Will Day, Dylan Moore and, particularly in the first half, Changkouth Jiath , used their skills well. The Hawks led by 31 points early in the third term. The Kangaroos rallied late, but the Hawks – with three goals by Tyler Brockman in his first senior game since 2021 – hung tough. The Roos clearly missed two of their prime midfielders, skipper Jy Simpkin (suspended) and Luke Davies-Uniacke (tight calf), who withdrew in the warm-up. Rookie standout Harry Sheezel was superb, and did his best to drag the Roos to what would have been a third straight win. The Hawks remain a major work in progress, and desperately need a marking tall up forward, but this win eases what had been a burning spotlight on a rebuild in its infancy. – Jon Pierik Carlton d GWS Like many other teams, the Blues are making an effort to keep intensity high in their midfield and rest their guns, so Patrick Cripps , despite his 42-possession masterclass, spent time “resting” in the forward line late in Saturday’s win over the Giants. “We have to get intensity around the ball for four quarters so when he came on the field, he ended up going deep forward, but that was more to do with giving him a rest. He was pretty handy across the day, wasn’t he?” Blues coach Michael Voss said. The Blues also have a very impressive defensive stopper in Nic Newman , who kept GWS skipper Toby Greene to one of the quietest days of his career. Voss praised Newman’s first month of 2023. Speaking of intensity, Matt Owies (hamstring) and Blake Acres (shoulder) have played important roles up forward and in the midfield this season, but both are under clouds with Owies subbed out with a “minor hamstring” while Acres was clearly hurting but played out the game. He has also been given a one-game ban by the match review officer. – Roy Ward Patrick Cripps picked up 42 touches in the win over GWS. Credit: Getty Images St Kilda d Essendon It is no mean feat to win the first three games of the season, and St Kilda’s improvement under Ross Lyon is evident already. They kicked 71 points on turnover and responded twice when challenged by the Bombers after making a great start when all eyes were on the group leading into the 150th anniversary game. Callum Wilkie has now reeled off 88 games in a row since St Kilda gave him a chance, and his match against Essendon was one of his best, standing tall as captain on a huge night for the club. He took seven intercept marks and made it impossible for the Bombers to score in the first 20 minutes. Up the other end of the ground the two smalls – Jack Higgins and Dan Butler – are getting the job done, bringing pressure and experience to support their young teammates inside 50. As for Mason Wood , he is a revitalised player at the Saints, with his talent shining through on a consistent basis, even though he may be in doubt for next week with a shoulder injury. Essendon showed grit and fight and belief in what coach Brad Scott is doing when they came back from five goals down to draw level in the final quarter. They did not deserve to win, but they provided a contest, which is an improvement on recent seasons. - Peter Ryan Adelaide d Port Adelaide Riley Thilthorpe kicked five in the Showdown. Credit: Getty Images By shelving their tired Jekyll-and-Hyde act, Adelaide showcased what their A-grade best looks like for decent stretches in their impressive Showdown win over Port Adelaide. Little separated the two teams across the first three engrossing quarters – typical of what is arguably the AFL’s finest modern-day rivalry – before the Crows turned on the afterburners with six unanswered goals in the last 20 minutes. Pivotal to Adelaide’s victory were the performances of new captain and Showdown medallist Jordan Dawson , Riley Thilthorpe (five goals) and Izak Rankine (four). By design, the Crows – by trade and draft – have heavily leant towards acquiring and enticing homegrown stars like Dawson (Sturt), Thilthorpe and Rankine (both West Adelaide), as well as the injured Darcy Fogarty (Glenelg). Badly and regularly burnt by the defection of several homesick draftees from interstate, Adelaide now boasts a number of emerging stars who will be Crows lifers. Making the Showdown victory even sweeter, Adelaide (11th) leapt ahead of the Power (12th) on percentage in the process. When the floodgates opened down the stretch, Port were powerless to quell the Crows’ rampant forward forays. The Power’s defence, so often the calling card of the Ken Hinkley era, has bled badly over the past fortnight. The once laughable suggestion that Port could finish below Adelaide on the ladder now looms a genuine possibility. - Steve Barrett Gold Coast d Geelong Loading This was an important win for the Suns, relieving some pressure on coach Stuart Dew after a poor start to the season. It was also a fitting tribute to the brave and selfless David Swallow in his 200th game. But perhaps most of all it was the moment that Jack Lukosius truly arrived as a footballer of substance. The No.2 draft pick of 2018 was the match-winner, his 65-metre drop punt in the last quarter a moment to remember. Questions will inevitably be asked about the Cats’ premiership defence, particularly now they find themselves on the bottom of the ladder as the league’s only winless team. But they have got the unfancied Hawthorn and the West Coast Eagles to come, and don’t forget; they did string 16 unbroken wins together on their way to last year’s flag. – Andrew Stafford Melbourne d Sydney September is when the Dees would like to see the real value of the Brodie Grundy trade come through, but there are already dividends in the first week of April. Playing in just his third game since being injured on Anzac Day last year, Grundy looked every bit the player who had been the competition’s premier ruckman before Max Gawn’s rise. He can still break his rivals’ hearts with his endurance, and his work below his knees means he effectively is an extra midfielder once the ball hits the ground. The true test of Grundy’s recruitment will come when Gawn returns, and we have a better guide as to how well the dream combination on paper functions on the field. As well as Sydney fared last year, there is a considerable gap between the Swans’ midfield and that of the competition’s heavyweights. Their onball brigade is vulnerable against the bigger bodies of the established teams. The Demons tore them apart in the hunt for contested ball; an area they were brutally exposed in last year’s grand final. Luke Parker has a decade of credits to forgive a rare bad day, but if the Swans are to threaten then next-generation midfielders Chad Warner and James Rowbottom , who have developed quickly for their age, can’t go missing as they did against the Dees. Road trips to Geelong (round six) and Collingwood (round eight) are their next big tests. – Andrew Wu Fremantle d West Coast What do you do with Luke Jackson when Sean Darcy is dominating in the ruck? Jackson is a premiership player and game-changing big man, but he is still finding his place at his new club. He made a good fist of his time forward in Sunday’s derby, kicking two goals, taking a big mark. Seven tackles for the match was also a highlight. Darcy had 52 hit outs, 20 touches and a goal, which was impressive, even with the Eagles decimated by injuries. When Darcy is dominating, Freo will need to find ways to get Jackson into the play as well. The queue outside the Eagles medical room just got longer, with Luke Shuey , Jeremy McGovern , Jamie Cripps and Alex Witherden all going down, leaving Adam Simpson with no bench for the final term. Hopefully, Shuey didn’t damage his hand when he punched the wall in frustration. On a final topic, Dockers flyer Michael Frederick and his backflip celebration needs to be encouraged at all costs, such acrobatics and unbridled joy is a great advertisement for the AFL. - Roy Ward Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL 2023 For subscribers North Melbourne Kangaroos Analysis Andrew Wu writes on cricket and AFL for The Age Connect via Twitter or email . Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Peter Ryan is a sports reporter with The Age. Connect via Twitter or email . Roy Ward is a sports writer, live blogger and breaking news journalist. He's been writing for The Age since 2010. Connect via Twitter or email . Andrew Stafford is a columnist. Steve Barrett writes about sport for The Age. Marc McGowan is a sports reporter for The Age Connect via Twitter . Most Viewed in Sport Loading","pubDate":"2023-04-02 19:30:00","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Remembering Salim Durani: A genuine folk hero","link":"https://economictimes.indiatimes.com/news/sports/remembering-salim-durani-a-genuine-folk-hero/articleshow/99194616.cms","keywords":null,"creator":null,"video_url":null,"description":"Salim Durani, the former India all-rounder known for his ability to hit sixes, has passed away at the age of 88. Despite modest figures, Durani earned respect and admiration from those who played with or against him. He was born in Kabul but denied it and had a light touch with people. Financial setbacks and health challenges did not daunt him, and he was a genuine folk hero in the cricketing universe, where his name rang all over.","content":"Synopsis Salim Durani, the former India all-rounder known for his ability to hit sixes, has passed away at the age of 88. Despite modest figures, Durani earned respect and admiration from those who played with or against him. He was born in Kabul but denied it and had a light touch with people. Financial setbacks and health challenges did not daunt him, and he was a genuine folk hero in the cricketing universe, where his name rang all over. At a time when a cricketer can become a household name after just one big knock in an IPL match, Durani would have been a massive draw. If you needed proof that not everything can be measured in numbers look no further than Salim Durani , the 88-year-old former India all-rounder who breathed his last in Jamnagar early on Sunday morning. Durani played 29 Tests, scoring 1202 runs and taking 75 wickets. But, ask anyone who played with him or against him and they speak of him with respect and affection. The most famous stories about Durani are about his ability to hit sixes at will. While no batsman can lay claim to a 100% record when it comes to something like this, those of a certain age remember crowds persistently yelling “we want sixer!” And Durani obliged them with a clean swing of the bat at the earliest possible instance. Although he hit a long ball, Durani never claimed to be a power hitter. In later conversations, he would only say that he lifted the ball over the fielder. The other famous bit about Durani is a contentious one. While it is widely believed that he was born in Kabul, this is something Durani has denied in interviews, going to the extent of saying he has never even been to Kabul. But, then again, this just adds to the myth. What is a fact is that Durani would sometimes demand the ball off Ajit Wadekar , his captain, when Garry Sobers was in full cry and dismiss arguably the best allrounder of all time with his leftarm orthodox spin. One such famous instance was in 1971 when India won their maiden Test in the West Indies. Durani had Clive Lloyd and Sobers in space of a few balls, setting up a sevenwicket win in Port of Spain. In that spell, Durani conceded only 21 runs in the 17 overs he bowled. A flamboyant character who enjoyed a drink, Durani has seen a lot of what life downs. From financial setbacks to health challenges, Durani endured it all after his playing days ended. But, when he was at his peak, Durani was a genuine folk hero. At a time before the world was a global village, Durani’s name rang around the cricketing universe. This was not fame fuelled by social media or celebrity, but by the respect of peers and the love of the common man. Durani had a light touch with people, equally comfortable smoking a cigarette at a corner tea stall and riding with maharajas in the fanciest of cars. When asked about tough times, Durani would inevitably shrug it off: whose life doesn’t come with difficulties, he would ask, with a characteristic laugh. Inevitable when asked how he managed to keep this attitude going, there would be a glint in his eye. “The problem comes when you try to control life. If you understand that life is bigger and go with the flow, everything becomes easier.” At a time when a cricketer can become a household name after just one big knock in an IPL match, Durani would have been a massive draw. But, you suspect, he was quite happy to have been a man of another era, a more forgiving, more genuine one. Don’t miss out on ET Prime stories! Get your daily dose of business updates on WhatsApp. click here! Sunday, 02 Apr, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front page Pure Politics Bottom Line Deep Dive More GST Collections in March Jump 13% to ₹1.6 Lakh Crore India’s monthly goods and services tax (GST) collections hit the second highest ever in March, rising 13% from a year earlier to ₹1.6 lakh crore, suggesting economic strength despite several headwinds. Want PM Modi to have a Successful G20 Summit The US shares India’s G20 agenda and is doing everything to make the country’s presidency a success, said US G20 head of delegation Christina Segal-Knowles. While the G20 is not the forum for geopolitical issues, to the extent that the Ukraine war impacts economics, the grouping can’t avoid the topic, she said in an interview with Deepshikha Sikarwar. SUVs Boost Car Sales to Record 3.9 M in FY23 India’s passenger vehicle sales rose 27% to a record 3.9 million units in the last fiscal year ended Friday, as improved component supplies helped automakers step up production to meet strong demand and clear order backlog. Read More News on salim durani cricket ajit wadekar garry sobers Indian cricketer fact (Catch all the Business News , Breaking News Events and Latest News Updates on The Economic Times .) Download The Economic Times News App to get Daily Market Updates & Live Business News. ... more less ETPrime stories of the day Investing Finance Bill 2023 takes the sheen off debt funds. Will bank FDs become more lucrative? 9 mins read Strategy Naatu Naatu roars: How RRR used Hollywood feedback loop and social media for the Oscar win 10 mins read Under the lens Learnings from SVB and Credit Suisse: Two tales of systematic and unsystematic risks 6 mins read Subscribe to ETPrime","pubDate":"2023-04-02 19:26:21","image_url":"https://img.etimg.com/thumb/width-1200,imgsize-12530,resizemode-4,msid-99194616/remembering-salim-durani-a-genuine-folk-hero.jpg","source_id":"economictimes_indiatimes","category":["sports"],"country":["india"],"language":"english"},{"title":"Bangladesh beat Afghanistan to win Tri-Nations U-19 final","link":"https://www.ft.lk/sports/Bangladesh-beat-Afghanistan-to-win-Tri-Nations-U-19-final/23-746994","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Left-arm spinner Mahfuzur Rahman Rabby took six wickets for 29 to bowl Bangladesh to a six-wicket win over Afghanistan in the final of the Tri-Nations Under-19 cricket tournament in Abu Dhabi. Mahfuzur’s destructive spell saw the strong Afghanistan batting humbled for 143 in 37 overs with Haroon Khan being the only batsman to make any sort of contribution scoring a well struck 65 off 62 balls (7 fours). Bangladesh had no difficulty in reaching the target of 144 in 23 overs losing four wickets to crown themselves champions. Sri Lanka were the third team in the competition.","pubDate":"2023-04-02 19:11:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Cricketers Mahela, Mohan excel at inaugural Ananda-Nalanda golf tourney","link":"https://www.ft.lk/sports/Cricketers-Mahela--Mohan-excel-at-inaugural-Ananda-Nalanda-golf-tourney/23-746993","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Overall Winner - Nalanda College: Mahela Jayawardene receiving his trophy and gift from Ananda College Golf Captain Wasantha de Silva and Vice-Captain Primal Wijayanayake Two cricketing stalwarts of SSC – Mahela Jayawardene and Mohan de Silva showed their hand in a different sport when they emerged winners for their respective alma maters in the inaugural Ananda-Nalanda ‘Big Match’ golf encounter themed ‘First Flight’ held at the Royal Colombo Golf Club course last week. The tournament was played in a stableford format, with Ananda College emerging champions. Mohan de Silva emerged Overall Winner for Ananda with 41 points while Dehan de Silva was the Overall Runner-up with 37 points (B/B9). For Nalanda, Mahela Jayawardene was the Overall Winner with 35 points with Anura Balasooriya, the Overall Runner-up with 34 points. “We are absolutely thrilled to have won the inaugural Maroon Golf tournament against our rivals and brothers Nalanda. It was great competition, and we played our best golf to come out on top. We all played as a team, and we enjoyed every minute of it,” said Ananda College golf team Captain Wasantha de Silva. Nalanda team Captain Mahela Jayawardene said: “As the hosts of the first ever Ananda-Nalanda Golf Tournament, we are proud of how we played, and we are already looking forward to the rematch next year.” The success of the tournament has paved the way for future competitions between the two colleges, with plans already underway for a bigger and better tournament next year.","pubDate":"2023-04-02 19:11:53","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"}]}