{"newsArray":[{"article_id":"5ce813487466202441f68a525eaa3290","title":"Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week","link":"https://www.dailymail.co.uk/sport/cricket/article-12611929/Cricket-set-feature-2028-Los-Angeles-Olympics-time-120-years-Great-Britain-beating-France-time-sport-played-games.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID COVERDALE: Cricket is set to feature at an Olympics for the first time in more than a century after Los Angeles 2028 organisers recommended it be added to their programme.","content":"Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week The Olympics have recently included sports such as skateboarding and surfing The addition of cricket ties in with the desire to appeal to the Indian market By David Coverdale For The Daily Mail Published: 16:18 EDT, 9 October 2023 | Updated: 19:10 EDT, 9 October 2023 e-mail 49 shares 3 View comments Cricket is set to feature at an Olympics for the first time in more than a century after Los Angeles 2028 organisers recommended it be added to their programme. Flag football - a non-contact version of American football - squash, lacrosse and baseball/softball have also been put forward to the International Olympic Committee for approval. A vote on LA's proposed sports will take place at a meeting in Mumbai next week, with Twenty20 cricket all but certain to get the green light given the IOC's desire to tap into the Indian market. The sport's only previous Olympic appearance was at Paris 1900, when Great Britain beat France in the final, which was also the only match. International Cricket Council chairman Greg Barclay said: 'We are delighted that LA28 have recommended cricket for inclusion in the Olympics. Cricket is set to be included in 2028 Los Angeles games, in a desire to access Indian markets Sports such as skateboarding, surfing, karate, baseball and softball were included in Tokyo There is a massive market for cricket in India which the Olympics will hope to tap into 'Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. 'I'd like to thank LA28 for their support during the new sport evaluation process over last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men's Cricket World Cup next week.' The five proposed sports would be in addition to the 28 sports already announced for LA 2028. However, recommending four new team sports poses the IOC a problem as they have stated their desire to keep athlete numbers down to 10,500. LA28 chairperson Casey Wasserman said: 'LA28's proposed sports ignite the imagination on the field of play and drive culture off it. 'They're relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. 'They will bring new athletes to the Games, engage diverse fanbases and expand the Games' presence in digital spaces, further amplifying LA28's mission to deliver an unparalleled experience.' The NFL was part of the bid for flag football, which is usually played with teams of five and sees players pull a flag off an opponent rather than tackling them. Squash would be another sport being played at an Olympics for the first time after a number of failed attempts to be added to the programme. The World Squash Federation said: 'The decision is a significant and exciting milestone in squash's history as the sport nears inclusion in the Olympic Games for the first time.' Lacrosse was contested at the Olympics in 1904 and 1908 and a six-a-side format of the sport has been proposed for LA. Men's baseball and women's softball featured at Tokyo 2020 but were left off the programme for Paris 2024. Flag football, a non-contact version of American football, is also set to be included at LA28 Share or comment on this article: Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week e-mail 49 shares Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-09 23:10:28","image_url":"https://i.dailymail.co.uk/1s/2023/10/09/21/76352915-0-image-a-8_1696882680340.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6da39aeead191c151c62bb1b4fcdfb28","title":"ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-bangladesh-match-preview-head-to-head-cricket-world-cup-2023-live-streaming-how-to-watch-eng-vs-ban-live-online-tv-channel-13225612.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more","content":"Cricket ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more England will aim to bury the disappointment of their nine-wicket thrashing at the hands of New Zealand when they take on Bangladesh in Dharamsala FirstCricket Staff Last Updated:October 10, 2023 02:43:14 IST England players train at the HPCA Stadium in Dharamsala on the eve of their ICC World Cup match against Bangladesh. AP England will aim to bounce back from a heavy defeat in their opening match of the 2023 ICC World Cup when they take on Bangladesh in Dharamsala on Tuesday. World Cup 2023: News | Schedule | Results | Points table Defending champions England got their campaign off to the worst possible start on Thursday at Ahmedabad’s Narendra Modi Stadium. Jos Buttler and Co suffered a nine-wicket thrashing at the hands of New Zealand, the team they had defeated via boundary count in the 2019 final that ended in a tie — both in the main game as well as in the subsequent Super Over. Related Articles England vs Bangladesh, World Cup 2023: Dharamsala Weather and Pitch Report World Cup 2023: England captain Jos Buttler slams 'poor' Dharamsala outfield, provides crucial update on Ben Stokes Devon Conway (152 not out) and Rachin Ravindra (123 not out) led the way with unbeaten centuries, sharing a 273-run unbroken stand for the second wicket after the Black Caps got off to a disastrous start in their chase of the 283-run target. Bangladesh, on the other hand, were among the teams that emerged victorious in the opening week of the 13th edition of ICC’s showpiece event, defeating Afghanistan by six wickets in Dharamsala. Mehidy Hasan Miraz led the way with an all-round effort against the Afghan Atalans, collecting 3/25 and scoring 57. Besides Mehidy’s efforts, Shakib Al Hasan (3/30) and Najmul Hossain Shanto (59 not out) also chipped in with ball and bat respectively as Bangladesh bowled Afghanistan out for a modest 156 before chasing the target down with more than 15 overs to spare. There were some concerns regarding the outfield at Dharamsala’s HPCA Stadium during the Bangladesh-Afghanistan match, with off-spinner Mujeeb-Ur-Rahman appearing to have hurt his knee while putting in a slide near the boundary — something coach Jonathan Trott wasn’t too happy about after the game. With the upcoming fixture set to take place at the same venue in the first match of the Tuesday double-header, England captain Buttler too expressed his reservations . “It’s poor in my opinion. I think any time you’re sort of talking about being careful diving when you’re fielding, it goes against everything you want to be as a team. “We won’t use it as an excuse, we’ll adapt to it. But if you feel like you’re having to hold yourself back, it’s not a place you want to be as a team or player, or in a World Cup match. “Fingers crossed that no one on either side picks up an unfortunate injury,” Buttler said on the eve of his team’s face-off against Bangladesh. Buttler also hinted at Stokes, England’s hero of the 2019 final and their man for the big occasions, sitting out for a second game in a row. “It’s good to see him back in the nets and building back towards full fitness but probably he’s unlikely for tomorrow,” added Buttler. England vs Bangladesh World Cup 2023 match date The England vs Bangladesh Cricket World Cup match will be played on Tuesday, 10 October. England vs Bangladesh World Cup 2023 match time The England vs Bangladesh Cricket World Cup match will start at 10.30 AM IST. The toss will take place at 10.00 AM IST. England vs Bangladesh World Cup 2023 match venue The England vs Bangladesh Cricket World Cup match will be played at the HPCA Stadium in Dharamsala. England vs Bangladesh World Cup 2023 match LIVE Streaming The England vs Bangladesh Cricket World Cup match will be broadcast live on Star Sports Network and live streaming will be available on Disney+ Hotstar. England vs Bangladesh head-to-head England 2-2 Bangladesh England and Bangladesh have met a total of four times in ICC World Cups, the first of which took place in Barbados during the Super Eights stage of the 2007 World Cup. While England pulled off a hard-fought four-wicket win in that encounter, Bangladesh would go on to win the next two — at Chattogram in 2011 and in Adelaide in 2015. The second of those Bangladeshi victories was a knockout punch, one that would force the ECB to opt for a complete overhaul of their limited-overs structure. England would meet Bangladesh four years later in Cardiff, and this time go level on the head-to-head record with a 106-run win. Squads: England : Jonny Bairstow, Dawid Malan, Joe Root, Harry Brook, Moeen Ali, Jos Buttler(w/c), Liam Livingstone, Sam Curran, Chris Woakes, Adil Rashid, Mark Wood, Ben Stokes, Gus Atkinson, David Willey, Reece Topley Bangladesh : Tanzid Hasan, Litton Das, Mehidy Hasan Miraz, Najmul Hossain Shanto, Shakib Al Hasan(c), Mushfiqur Rahim(w), Towhid Hridoy, Mahmudullah, Taskin Ahmed, Shoriful Islam, Mustafizur Rahman, Mahedi Hasan, Nasum Ahmed, Hasan Mahmud, Tanzim Hasan Sakib Join our Whatsapp channel to get the latest global news updates Published on: October 10, 2023 02:41:55 IST Tags: Cricket England Vs Bangladesh World Cup 2023","pubDate":"2023-10-09 21:13:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/England-training-Bangladesh-Dharamsala-World-Cup-AP-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4fb8e49ea29e79dd50ccfdc2da74d6cf","title":"Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games","link":"https://www.firstpost.com/firstcricket/sports-news/cricket-in-olympics-la-2028-organisers-recommend-sports-inclusion-in-34th-games-13225562.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games","content":"Cricket Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games If cricket makes the cut, it would be the first time it has featured since 1900, when a team from Britain beat a side representing France in Paris. FirstCricket Staff Last Updated:October 10, 2023 00:17:51 IST Representational image. Reuters Cricket could finally make a comeback into the Summer Olympics after more than a century with the organisers of the 2028 Games in Los Angeles making a formal recommendation for including the T20 version of the sport. Cricket was listed among the proposed “new” sports alongside baseball/softball, flag football, lacrosse and squash. There was however, no mention of breaking — which makes its debut in the Paris Olympics that takes place next summer. If cricket makes the cut, it would be the first time it has featured since 1900, when a team from Britain beat a side representing France in Paris. Five sports have been proposed by the @LA28 Organising Committee for inclusion at the Olympic Games in Los Angeles in five years’ time: Related Articles Canada qualify for T20 World Cup for first time after beating Bermuda in qualifiers ICC World Cup Factbox: How England have fared in quadrennial showpiece event over the years ⚾ Baseball-softball 🏏 Cricket 🏈 Flag football 🥍 Lacrosse ⚫ Squash The final decision will be made in the coming days. pic.twitter.com/kU1303jY0A — The Olympic Games (@Olympics) October 9, 2023 The final choice of which sports are retained for LA28 will be voted on at the IOC Session next Monday in Mumbai. The International Cricket Council welcomed the decision to propose cricket. ICC Chairman Greg Barclay said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century.” The ICC’s proposal is for men’s and women’s Twenty20 competitions — the shortest form of the international game at 20 overs per side. While it has not featured in the biggest sporting event in the world for over a century, cricket has made relatively recent appearances in other multi-nation, multi-sport events. It had made its debut in the Commonwealth Games in Kuala Lumpur 1998, and returned after 24 years in last year’s edition in Birmingham. Cricket also featured in the 2010 and 2014 editions of the Asian Games in Guangzhou and Incheon respectively, and was also part of the events in the recently-concluded 19th edition in Hangzhou, where India won gold in both the men’s and women’s events. With inputs from AFP Join our Whatsapp channel to get the latest global news updates Published on: October 09, 2023 23:51:07 IST Tags: 2028 La Olympics 2028 Los Angeles Olympics Cricket Olympics","pubDate":"2023-10-09 18:47:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/Los-Angeles-Olympics-2028-Reuters-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0d42df3d0fb66a3d5a58b3d74383c914","title":"India vs Pakistan मैच वाले दिन लगभग छावनी में तब्दील हो जाएगा अहमदाबाद, इतनी बड़ी संख्या में सुरक्षाकर्मी होंगे तैनात","link":"https://sports.ndtv.com/hindi/cricket/ahmedabad-will-be-converted-almost-in-cantonment-on-india-vs-pakistan-match-day-such-a-huge-number-of-security-personal-going-to-to-be-deployed-4465943#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"World Cup 2023, India vs Pakistan: इससे पहले दिन में गुजरात के मुख्यमंत्री भूपेन्द्र पटेल ने विश्व कप मैच बिना किसी गड़बड़ी संपन्न हो, यह सुनिश्चित करने के लिए गांधीनगर में गृह राज्य मंत्री हर्ष संघवी, राज्य के पुलिस महानिदेशक विकास सहाय, जी.एस. मलिक और अन्य वरिष्ठ पुलिस अधिकारियों के साथ पुलिस की कार्य योजना की समीक्षा बैठक की.","content":"भारत-पाकिस्तान के बीच World Cup 2023 वाले दिन 14 अक्टूबर को अहमदाबाद और नरेन्द्र मोदी स्टेडियम में गुजरात पुलिस, राष्ट्रीय सुरक्षा समूह (एनएसजी), त्वरित कार्रवाई बल (आरएएफ) और होमगार्ड समेत विभिन्न एजेंसियों के 11 हजार से अधिक सुरक्षाकर्मी तैनात किए जाएंगे. एक वरिष्ठ अधिकारी ने सोमवार को यह जानकारी दी. उन्होंने बताया कि धमकियों के बाद उच्च स्तरीय सुरक्षा व्यवस्था की गई है. अहमदाबाद के पुलिस आयुक्त जी.एस. मलिक ने बताया कि हालांकि पिछले 20 वर्षों में अहमदाबाद में क्रिकेट मैच के दौरान किसी भी तरह की सांप्रदायिक हिंसा नहीं देखी गई, लेकिन एहतियात के तौर पर कई संवेदनशील क्षेत्रों में सुरक्षा बल तैनात किए जाएंगे. इससे पहले दिन में गुजरात के मुख्यमंत्री भूपेन्द्र पटेल ने विश्व कप मैच बिना किसी गड़बड़ी संपन्न हो, यह सुनिश्चित करने के लिए गांधीनगर में गृह राज्य मंत्री हर्ष संघवी, राज्य के पुलिस महानिदेशक विकास सहाय, जी.एस. मलिक और अन्य वरिष्ठ पुलिस अधिकारियों के साथ पुलिस की कार्य योजना की समीक्षा बैठक की. मलिक ने एक संवाददाता सम्मेलन को संबोधित करते हुए कहा कि स्टेडियम में एक लाख से अधिक दर्शकों की आवाजाही और एक ईमेल के जरिये मिली धमकी को ध्यान में रखते हुए पुख्ता सुरक्षा व्यवस्था की गई है. मलिक ने कहा, ‘मैच के दौरान स्टेडियम की सुरक्षा और शहर के सांप्रदायिक रूप से संवेदनशील क्षेत्रों में कानून व्यवस्था बनाए रखने के लिए हम सात हजार से अधिक पुलिसकर्मियों के साथ-साथ लगभग चार हजार गृह रक्षक तैनात करेंगे. इनके अलावा एनएसजी की तीन टीमें और एक एंटी-ड्रोन टीम तैनात रहेगी. बम खोजी दस्ते की नौ टीमें भी तैनात की जाएंगी.' उन्होंने बताया कि महानिरीक्षक और उप महानिरीक्षक स्तर के चार वरिष्ठ भारतीय पुलिस सेवा (आईपीएस) अधिकारी और 21 पुलिस उपायुक्त (डीसीपी) स्तर के अधिकारी मैच के दिन कर्मियों की निगरानी और उनका मार्गदर्शन करेंगे. खबरों के अनुसार, मुंबई पुलिस को एक ईमेल मिला जिसमें एक अज्ञात व्यक्ति ने प्रधानमंत्री को नुकसान पहुंचाने और अहमदाबाद में नरेन्द्र मोदी स्टेडियम को उड़ाने की धमकी दी है. ईमेल भेजने वाले ने 500 करोड़ रुपये और कुख्यात गैंगस्टर लॉरेंस बिश्नोई को जेल से रिहा करने की भी मांग की है. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-09 18:42:22","image_url":"https://c.ndtvimg.com/2023-09/u8nng0ug_india-vs-pakistan_120x90_08_September_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"b94567c9edd6f5a32bda1c39ca3dd337","title":"Baseball, flag football, cricket, squash et crosse proposés pour les Jeux Olympiques 2028","link":"https://www.lequipe.fr/Tous-sports/Actualites/Baseball-flag-football-cricket-squash-et-crosse-proposes-pour-les-jeux-olympiques-2028/1424455#xtor=RSS-1","keywords":["JO 2028"],"creator":["Olivier Paquereau"],"video_url":null,"description":"Les organisateurs des Jeux Olympiques de Los Angeles 2028 ont dévoilé lundi les sports qu'ils souhaiteraient voir ajoutés au programme des JO : le baseball, le flag football, le cricket, le squash et la crosse. Le breakdance n'a pas été retenu.","content":"Le Comité d'organisation des Jeux Olympiques et Paralympiques de Los Angeles 2028 a dévoilé lundi les cinq sports additionnels qu'il proposera au Comité international olympique (CIO), en vue de leur potentielle inclusion au programme des JO dans cinq ans. On y retrouve le baseball (et sa déclinaison pour les femmes, le softball), discipline enracinée dans la culture des États-Unis, (du football américain sans contact), le cricket, surtout pratiqué dans des pays anglophones et dont se déroule actuellement, le squash et la crosse, un sport collectif qui provient des cultures amérindiennes. Le breakdance, qui sera sport additionnel aux Jeux Olympiques de Paris 2024, n'a en revanche pas été retenu. Le CIO rendra sa décision la semaine prochaine lors de sa prochaine session à Bombay (Inde). Des cinq sports proposés, trois ont déjà été olympiques : le baseball (de 1992 à 2008 puis en 2021), le cricket (en 1900) et la crosse (en 1904 et 1908).","pubDate":"2023-10-09 18:37:53","image_url":"https://medias.lequipe.fr/img-photo-jpg/le-baseball-avait-ete-programme-aux-jo-de-tokyo-il-y-a-deux-ans-reviendra-t-il-en-2028-a-los-angeles-j-crombie-usa-today-sports-presse-sports/1500000001845213/0:0,1998:999-665-335-70/07d2c.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"58fe35a39a3eae5e894545113e9857b7","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.northwalespioneer.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"Cricket is on the verge of returning to the Olympics for the first time in 128 years after the sport was put forward for inclusion at the 2028 Games. There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. A massive step for cricket and its bid for inclusion at the 2028 Olympic Games. Details 👇 — ICC (@ICC) LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.northwalespioneer.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bdd509870676f3eb87c467300c9bad9e","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.times-series.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.times-series.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"9beb0f276c25d494ac20502d426750a6","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.southwalesguardian.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"Cricket is on the verge of returning to the Olympics for the first time in 128 years after the sport was put forward for inclusion at the 2028 Games. There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. A massive step for cricket and its bid for inclusion at the 2028 Olympic Games. Details 👇 — ICC (@ICC) LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.southwalesguardian.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5fe6a550dd157e0652139b5c389ba7d0","title":"Female referee to take charge of England men's game for first time ever at Wembley","link":"https://www.dailystar.co.uk/sport/football/female-referee-england-men-wembley-31146961","keywords":["Sport"],"creator":null,"video_url":null,"description":"History will be made in the international friendly between Gareth Southgate's England team and an ever-improving Australia at Wembley Stadium","content":"For the first time ever, a female referee will take charge of an men’s match at Wembley Stadium. Stephanie Frappart will be the woman in the middle when side play host to Australia on October 13. It is another huge milestone for the French referee, who is widely considered to be one of the best in Europe. As well as becoming the first woman to referee an England men's match at Wembley, she was the first female to take charge of a UEFA Super Cup final, when she oversaw penalty-shootout victory over in 2019. The jumped at the chance to appoint the official for the clash against the Aussies, when the French Football Federation said she would be available. “Stephanie is an outstanding referee and she has officiated on the highest stage within France, across Europe and recently at the men’s and women’s FIFA ,” head of refereeing operations at the FA, Peter Elsworth said. “We’re delighted she and her team will take charge of our upcoming fixture against Australia in front of a sold-out crowd at Wembley Stadium. We’re looking forward to welcoming them to the home of English football.” As well as the Champions League, TNT Sports will also be offering sports fans access to games across the Premier League, Europa League, Serie A and much more. You can also watch the biggest events in boxing, UFC, WWE and get exclusive action from MLB. £29.99 per month on top of £8.99 per month Amazon Prime subscription Frappart is a Ligue 1 referee who has also taken charge of various matches in European competitions. As well as the French top flight, she has also overseen games in the and the recent World Cup in Qatar. She will be supported by assistants Mikael Berchebru and Aurélien Drouet and fourth official Hakim Ben El Hadj. VAR will be in place at Wembley, which will be managed by Mathieu Vernice and assistant VAR official Nicolas Rainville. While the match is technically a friendly, England have always had a rich sporting rivalry with Australia. The footballing tension may not be as fierce as it is in cricket or rugby, but it will still be a fixture that could get rowdy rather quickly. Australia have also made huge strides in international football by reaching the Round of 16 stage of the last World Cup. After losing 4-1 to runners-up France, they overcame Denmark and Tunisia before being knocked out by eventual winners Argentina.","pubDate":"2023-10-09 18:27:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31146969.ece/ALTERNATES/s98/0_Real-Madrid-v-Celtic-UEFA-Champions-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"673fc410fdba04351a8e7a1296f70315","title":"World Cup 2023: PCB Chairman Zaka Ashraf Meets Foreign Secretary To Address Visa Delay For Pakistani Fans And Journalists","link":"https://news.abplive.com/sports/cricket/world-cup-2023-pcb-chairman-zaka-ashraf-meets-foreign-secretary-to-address-visa-delay-for-pakistani-fans-and-journalists-1634874","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"In an effort to resolve the visa issuance delay faced by Pakistani fans and journalists attending the ongoing ICC World Cup in India, PCB Chairman Zaka Ashraf held discussions with Foreign Secretary Syrus Sajjad Qazi. The Pakistan Cricket Board (PCB) expressed its disappointment regarding the uncertainty surrounding Indian visas for these individuals and urged the Foreign Secretary to engage with the Indian Home Ministry and Pakistan High Commission in New Delhi to expedite the process. The PCB underscored the persistent challenges faced by Pakistani journalists and fans in obtaining Indian visas, stating, \"In the meantime, PCB has again reminded ICC and BCCI of their respective obligations and terms and conditions stipulated in the Host agreement to guarantee visas for fans and journalists of participating teams.\" Organized by the International Cricket Council (ICC) and hosted by the Board of Control for Cricket in India (BCCI), the World Cup has attracted approximately 60 journalists eager to cover the event. Pakistan has already competed in their opening match against the Netherlands on October 6 and is set to face Sri Lanka on Tuesday (October 10). The highly anticipated Pakistan-India clash is scheduled for October 14 in Ahmedabad. The visa applications for Pakistani journalists fall under India's prior reference category (PRC), requiring evaluation by the home, external affairs, and sports ministries. This has contributed to the delay in visa issuance. Efforts are ongoing to ensure a swift resolution to the visa issue, allowing Pakistani fans and journalists to participate fully in this prestigious cricketing event. Pakistan Full Fixture List World Cup 2023 FIXTURE DATE VENUE Pakistan vs Netherlands October 6 Hyderabad Pakistan vs Sri Lanka October 10 Hyderabad Pakistan vs India October 14 Ahmedabad Pakistan vs Australia October 20 Bengaluru Pakistan vs Afghanistan October 23 Chennai Pakistan vs South Africa October 27 Chennai Pakistan vs Bangladesh October 31 Kolkata Pakistan vs New Zealand November 4 Bengaluru Pakistan vs England November 11 Kolkata (With Inputs From PTI)","content":"In an effort to resolve the visa issuance delay faced by Pakistani fans and journalists attending the ongoing ICC World Cup in India, PCB Chairman Zaka Ashraf held discussions with Foreign Secretary Syrus Sajjad Qazi. The Pakistan Cricket Board (PCB) expressed its disappointment regarding the uncertainty surrounding Indian visas for these individuals and urged the Foreign Secretary to engage with the Indian Home Ministry and Pakistan High Commission in New Delhi to expedite the process. The PCB underscored the persistent challenges faced by Pakistani journalists and fans in obtaining Indian visas, stating, \"In the meantime, PCB has again reminded ICC and BCCI of their respective obligations and terms and conditions stipulated in the Host agreement to guarantee visas for fans and journalists of participating teams.\" Organized by the International Cricket Council (ICC) and hosted by the Board of Control for Cricket in India (BCCI), the World Cup has attracted approximately 60 journalists eager to cover the event. Pakistan has already competed in their opening match against the Netherlands on October 6 and is set to face Sri Lanka on Tuesday (October 10). The highly anticipated Pakistan-India clash is scheduled for October 14 in Ahmedabad. The visa applications for Pakistani journalists fall under India's prior reference category (PRC), requiring evaluation by the home, external affairs, and sports ministries. This has contributed to the delay in visa issuance. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Efforts are ongoing to ensure a swift resolution to the visa issue, allowing Pakistani fans and journalists to participate fully in this prestigious cricketing event. Pakistan Full Fixture List World Cup 2023 FIXTURE DATE VENUE Pakistan vs Netherlands October 6 Hyderabad Pakistan vs Sri Lanka October 10 Hyderabad Pakistan vs India October 14 Ahmedabad Pakistan vs Australia October 20 Bengaluru Pakistan vs Afghanistan October 23 Chennai Pakistan vs South Africa October 27 Chennai Pakistan vs Bangladesh October 31 Kolkata Pakistan vs New Zealand November 4 Bengaluru Pakistan vs England November 11 Kolkata (With Inputs From PTI)","pubDate":"2023-10-09 18:14:12","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/09/de08393cd40a90850e8a6b6d81f660901696875220912625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5ce813487466202441f68a525eaa3290","title":"Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week","link":"https://www.dailymail.co.uk/sport/cricket/article-12611929/Cricket-set-feature-2028-Los-Angeles-Olympics-time-120-years-Great-Britain-beating-France-time-sport-played-games.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID COVERDALE: Cricket is set to feature at an Olympics for the first time in more than a century after Los Angeles 2028 organisers recommended it be added to their programme.","content":"Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week The Olympics have recently included sports such as skateboarding and surfing The addition of cricket ties in with the desire to appeal to the Indian market By David Coverdale For The Daily Mail Published: 16:18 EDT, 9 October 2023 | Updated: 19:10 EDT, 9 October 2023 e-mail 49 shares 3 View comments Cricket is set to feature at an Olympics for the first time in more than a century after Los Angeles 2028 organisers recommended it be added to their programme. Flag football - a non-contact version of American football - squash, lacrosse and baseball/softball have also been put forward to the International Olympic Committee for approval. A vote on LA's proposed sports will take place at a meeting in Mumbai next week, with Twenty20 cricket all but certain to get the green light given the IOC's desire to tap into the Indian market. The sport's only previous Olympic appearance was at Paris 1900, when Great Britain beat France in the final, which was also the only match. International Cricket Council chairman Greg Barclay said: 'We are delighted that LA28 have recommended cricket for inclusion in the Olympics. Cricket is set to be included in 2028 Los Angeles games, in a desire to access Indian markets Sports such as skateboarding, surfing, karate, baseball and softball were included in Tokyo There is a massive market for cricket in India which the Olympics will hope to tap into 'Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. 'I'd like to thank LA28 for their support during the new sport evaluation process over last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men's Cricket World Cup next week.' The five proposed sports would be in addition to the 28 sports already announced for LA 2028. However, recommending four new team sports poses the IOC a problem as they have stated their desire to keep athlete numbers down to 10,500. LA28 chairperson Casey Wasserman said: 'LA28's proposed sports ignite the imagination on the field of play and drive culture off it. 'They're relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. 'They will bring new athletes to the Games, engage diverse fanbases and expand the Games' presence in digital spaces, further amplifying LA28's mission to deliver an unparalleled experience.' The NFL was part of the bid for flag football, which is usually played with teams of five and sees players pull a flag off an opponent rather than tackling them. Squash would be another sport being played at an Olympics for the first time after a number of failed attempts to be added to the programme. The World Squash Federation said: 'The decision is a significant and exciting milestone in squash's history as the sport nears inclusion in the Olympic Games for the first time.' Lacrosse was contested at the Olympics in 1904 and 1908 and a six-a-side format of the sport has been proposed for LA. Men's baseball and women's softball featured at Tokyo 2020 but were left off the programme for Paris 2024. Flag football, a non-contact version of American football, is also set to be included at LA28 Share or comment on this article: Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week e-mail 49 shares Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-09 23:10:28","image_url":"https://i.dailymail.co.uk/1s/2023/10/09/21/76352915-0-image-a-8_1696882680340.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6da39aeead191c151c62bb1b4fcdfb28","title":"ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-bangladesh-match-preview-head-to-head-cricket-world-cup-2023-live-streaming-how-to-watch-eng-vs-ban-live-online-tv-channel-13225612.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more","content":"Cricket ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more England will aim to bury the disappointment of their nine-wicket thrashing at the hands of New Zealand when they take on Bangladesh in Dharamsala FirstCricket Staff Last Updated:October 10, 2023 02:43:14 IST England players train at the HPCA Stadium in Dharamsala on the eve of their ICC World Cup match against Bangladesh. AP England will aim to bounce back from a heavy defeat in their opening match of the 2023 ICC World Cup when they take on Bangladesh in Dharamsala on Tuesday. World Cup 2023: News | Schedule | Results | Points table Defending champions England got their campaign off to the worst possible start on Thursday at Ahmedabad’s Narendra Modi Stadium. Jos Buttler and Co suffered a nine-wicket thrashing at the hands of New Zealand, the team they had defeated via boundary count in the 2019 final that ended in a tie — both in the main game as well as in the subsequent Super Over. Related Articles England vs Bangladesh, World Cup 2023: Dharamsala Weather and Pitch Report World Cup 2023: England captain Jos Buttler slams 'poor' Dharamsala outfield, provides crucial update on Ben Stokes Devon Conway (152 not out) and Rachin Ravindra (123 not out) led the way with unbeaten centuries, sharing a 273-run unbroken stand for the second wicket after the Black Caps got off to a disastrous start in their chase of the 283-run target. Bangladesh, on the other hand, were among the teams that emerged victorious in the opening week of the 13th edition of ICC’s showpiece event, defeating Afghanistan by six wickets in Dharamsala. Mehidy Hasan Miraz led the way with an all-round effort against the Afghan Atalans, collecting 3/25 and scoring 57. Besides Mehidy’s efforts, Shakib Al Hasan (3/30) and Najmul Hossain Shanto (59 not out) also chipped in with ball and bat respectively as Bangladesh bowled Afghanistan out for a modest 156 before chasing the target down with more than 15 overs to spare. There were some concerns regarding the outfield at Dharamsala’s HPCA Stadium during the Bangladesh-Afghanistan match, with off-spinner Mujeeb-Ur-Rahman appearing to have hurt his knee while putting in a slide near the boundary — something coach Jonathan Trott wasn’t too happy about after the game. With the upcoming fixture set to take place at the same venue in the first match of the Tuesday double-header, England captain Buttler too expressed his reservations . “It’s poor in my opinion. I think any time you’re sort of talking about being careful diving when you’re fielding, it goes against everything you want to be as a team. “We won’t use it as an excuse, we’ll adapt to it. But if you feel like you’re having to hold yourself back, it’s not a place you want to be as a team or player, or in a World Cup match. “Fingers crossed that no one on either side picks up an unfortunate injury,” Buttler said on the eve of his team’s face-off against Bangladesh. Buttler also hinted at Stokes, England’s hero of the 2019 final and their man for the big occasions, sitting out for a second game in a row. “It’s good to see him back in the nets and building back towards full fitness but probably he’s unlikely for tomorrow,” added Buttler. England vs Bangladesh World Cup 2023 match date The England vs Bangladesh Cricket World Cup match will be played on Tuesday, 10 October. England vs Bangladesh World Cup 2023 match time The England vs Bangladesh Cricket World Cup match will start at 10.30 AM IST. The toss will take place at 10.00 AM IST. England vs Bangladesh World Cup 2023 match venue The England vs Bangladesh Cricket World Cup match will be played at the HPCA Stadium in Dharamsala. England vs Bangladesh World Cup 2023 match LIVE Streaming The England vs Bangladesh Cricket World Cup match will be broadcast live on Star Sports Network and live streaming will be available on Disney+ Hotstar. England vs Bangladesh head-to-head England 2-2 Bangladesh England and Bangladesh have met a total of four times in ICC World Cups, the first of which took place in Barbados during the Super Eights stage of the 2007 World Cup. While England pulled off a hard-fought four-wicket win in that encounter, Bangladesh would go on to win the next two — at Chattogram in 2011 and in Adelaide in 2015. The second of those Bangladeshi victories was a knockout punch, one that would force the ECB to opt for a complete overhaul of their limited-overs structure. England would meet Bangladesh four years later in Cardiff, and this time go level on the head-to-head record with a 106-run win. Squads: England : Jonny Bairstow, Dawid Malan, Joe Root, Harry Brook, Moeen Ali, Jos Buttler(w/c), Liam Livingstone, Sam Curran, Chris Woakes, Adil Rashid, Mark Wood, Ben Stokes, Gus Atkinson, David Willey, Reece Topley Bangladesh : Tanzid Hasan, Litton Das, Mehidy Hasan Miraz, Najmul Hossain Shanto, Shakib Al Hasan(c), Mushfiqur Rahim(w), Towhid Hridoy, Mahmudullah, Taskin Ahmed, Shoriful Islam, Mustafizur Rahman, Mahedi Hasan, Nasum Ahmed, Hasan Mahmud, Tanzim Hasan Sakib Join our Whatsapp channel to get the latest global news updates Published on: October 10, 2023 02:41:55 IST Tags: Cricket England Vs Bangladesh World Cup 2023","pubDate":"2023-10-09 21:13:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/England-training-Bangladesh-Dharamsala-World-Cup-AP-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4fb8e49ea29e79dd50ccfdc2da74d6cf","title":"Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games","link":"https://www.firstpost.com/firstcricket/sports-news/cricket-in-olympics-la-2028-organisers-recommend-sports-inclusion-in-34th-games-13225562.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games","content":"Cricket Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games If cricket makes the cut, it would be the first time it has featured since 1900, when a team from Britain beat a side representing France in Paris. FirstCricket Staff Last Updated:October 10, 2023 00:17:51 IST Representational image. Reuters Cricket could finally make a comeback into the Summer Olympics after more than a century with the organisers of the 2028 Games in Los Angeles making a formal recommendation for including the T20 version of the sport. Cricket was listed among the proposed “new” sports alongside baseball/softball, flag football, lacrosse and squash. There was however, no mention of breaking — which makes its debut in the Paris Olympics that takes place next summer. If cricket makes the cut, it would be the first time it has featured since 1900, when a team from Britain beat a side representing France in Paris. Five sports have been proposed by the @LA28 Organising Committee for inclusion at the Olympic Games in Los Angeles in five years’ time: Related Articles Canada qualify for T20 World Cup for first time after beating Bermuda in qualifiers ICC World Cup Factbox: How England have fared in quadrennial showpiece event over the years ⚾ Baseball-softball 🏏 Cricket 🏈 Flag football 🥍 Lacrosse ⚫ Squash The final decision will be made in the coming days. pic.twitter.com/kU1303jY0A — The Olympic Games (@Olympics) October 9, 2023 The final choice of which sports are retained for LA28 will be voted on at the IOC Session next Monday in Mumbai. The International Cricket Council welcomed the decision to propose cricket. ICC Chairman Greg Barclay said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century.” The ICC’s proposal is for men’s and women’s Twenty20 competitions — the shortest form of the international game at 20 overs per side. While it has not featured in the biggest sporting event in the world for over a century, cricket has made relatively recent appearances in other multi-nation, multi-sport events. It had made its debut in the Commonwealth Games in Kuala Lumpur 1998, and returned after 24 years in last year’s edition in Birmingham. Cricket also featured in the 2010 and 2014 editions of the Asian Games in Guangzhou and Incheon respectively, and was also part of the events in the recently-concluded 19th edition in Hangzhou, where India won gold in both the men’s and women’s events. With inputs from AFP Join our Whatsapp channel to get the latest global news updates Published on: October 09, 2023 23:51:07 IST Tags: 2028 La Olympics 2028 Los Angeles Olympics Cricket Olympics","pubDate":"2023-10-09 18:47:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/Los-Angeles-Olympics-2028-Reuters-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0d42df3d0fb66a3d5a58b3d74383c914","title":"India vs Pakistan मैच वाले दिन लगभग छावनी में तब्दील हो जाएगा अहमदाबाद, इतनी बड़ी संख्या में सुरक्षाकर्मी होंगे तैनात","link":"https://sports.ndtv.com/hindi/cricket/ahmedabad-will-be-converted-almost-in-cantonment-on-india-vs-pakistan-match-day-such-a-huge-number-of-security-personal-going-to-to-be-deployed-4465943#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"World Cup 2023, India vs Pakistan: इससे पहले दिन में गुजरात के मुख्यमंत्री भूपेन्द्र पटेल ने विश्व कप मैच बिना किसी गड़बड़ी संपन्न हो, यह सुनिश्चित करने के लिए गांधीनगर में गृह राज्य मंत्री हर्ष संघवी, राज्य के पुलिस महानिदेशक विकास सहाय, जी.एस. मलिक और अन्य वरिष्ठ पुलिस अधिकारियों के साथ पुलिस की कार्य योजना की समीक्षा बैठक की.","content":"भारत-पाकिस्तान के बीच World Cup 2023 वाले दिन 14 अक्टूबर को अहमदाबाद और नरेन्द्र मोदी स्टेडियम में गुजरात पुलिस, राष्ट्रीय सुरक्षा समूह (एनएसजी), त्वरित कार्रवाई बल (आरएएफ) और होमगार्ड समेत विभिन्न एजेंसियों के 11 हजार से अधिक सुरक्षाकर्मी तैनात किए जाएंगे. एक वरिष्ठ अधिकारी ने सोमवार को यह जानकारी दी. उन्होंने बताया कि धमकियों के बाद उच्च स्तरीय सुरक्षा व्यवस्था की गई है. अहमदाबाद के पुलिस आयुक्त जी.एस. मलिक ने बताया कि हालांकि पिछले 20 वर्षों में अहमदाबाद में क्रिकेट मैच के दौरान किसी भी तरह की सांप्रदायिक हिंसा नहीं देखी गई, लेकिन एहतियात के तौर पर कई संवेदनशील क्षेत्रों में सुरक्षा बल तैनात किए जाएंगे. इससे पहले दिन में गुजरात के मुख्यमंत्री भूपेन्द्र पटेल ने विश्व कप मैच बिना किसी गड़बड़ी संपन्न हो, यह सुनिश्चित करने के लिए गांधीनगर में गृह राज्य मंत्री हर्ष संघवी, राज्य के पुलिस महानिदेशक विकास सहाय, जी.एस. मलिक और अन्य वरिष्ठ पुलिस अधिकारियों के साथ पुलिस की कार्य योजना की समीक्षा बैठक की. मलिक ने एक संवाददाता सम्मेलन को संबोधित करते हुए कहा कि स्टेडियम में एक लाख से अधिक दर्शकों की आवाजाही और एक ईमेल के जरिये मिली धमकी को ध्यान में रखते हुए पुख्ता सुरक्षा व्यवस्था की गई है. मलिक ने कहा, ‘मैच के दौरान स्टेडियम की सुरक्षा और शहर के सांप्रदायिक रूप से संवेदनशील क्षेत्रों में कानून व्यवस्था बनाए रखने के लिए हम सात हजार से अधिक पुलिसकर्मियों के साथ-साथ लगभग चार हजार गृह रक्षक तैनात करेंगे. इनके अलावा एनएसजी की तीन टीमें और एक एंटी-ड्रोन टीम तैनात रहेगी. बम खोजी दस्ते की नौ टीमें भी तैनात की जाएंगी.' उन्होंने बताया कि महानिरीक्षक और उप महानिरीक्षक स्तर के चार वरिष्ठ भारतीय पुलिस सेवा (आईपीएस) अधिकारी और 21 पुलिस उपायुक्त (डीसीपी) स्तर के अधिकारी मैच के दिन कर्मियों की निगरानी और उनका मार्गदर्शन करेंगे. खबरों के अनुसार, मुंबई पुलिस को एक ईमेल मिला जिसमें एक अज्ञात व्यक्ति ने प्रधानमंत्री को नुकसान पहुंचाने और अहमदाबाद में नरेन्द्र मोदी स्टेडियम को उड़ाने की धमकी दी है. ईमेल भेजने वाले ने 500 करोड़ रुपये और कुख्यात गैंगस्टर लॉरेंस बिश्नोई को जेल से रिहा करने की भी मांग की है. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-09 18:42:22","image_url":"https://c.ndtvimg.com/2023-09/u8nng0ug_india-vs-pakistan_120x90_08_September_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"b94567c9edd6f5a32bda1c39ca3dd337","title":"Baseball, flag football, cricket, squash et crosse proposés pour les Jeux Olympiques 2028","link":"https://www.lequipe.fr/Tous-sports/Actualites/Baseball-flag-football-cricket-squash-et-crosse-proposes-pour-les-jeux-olympiques-2028/1424455#xtor=RSS-1","keywords":["JO 2028"],"creator":["Olivier Paquereau"],"video_url":null,"description":"Les organisateurs des Jeux Olympiques de Los Angeles 2028 ont dévoilé lundi les sports qu'ils souhaiteraient voir ajoutés au programme des JO : le baseball, le flag football, le cricket, le squash et la crosse. Le breakdance n'a pas été retenu.","content":"Le Comité d'organisation des Jeux Olympiques et Paralympiques de Los Angeles 2028 a dévoilé lundi les cinq sports additionnels qu'il proposera au Comité international olympique (CIO), en vue de leur potentielle inclusion au programme des JO dans cinq ans. On y retrouve le baseball (et sa déclinaison pour les femmes, le softball), discipline enracinée dans la culture des États-Unis, (du football américain sans contact), le cricket, surtout pratiqué dans des pays anglophones et dont se déroule actuellement, le squash et la crosse, un sport collectif qui provient des cultures amérindiennes. Le breakdance, qui sera sport additionnel aux Jeux Olympiques de Paris 2024, n'a en revanche pas été retenu. Le CIO rendra sa décision la semaine prochaine lors de sa prochaine session à Bombay (Inde). Des cinq sports proposés, trois ont déjà été olympiques : le baseball (de 1992 à 2008 puis en 2021), le cricket (en 1900) et la crosse (en 1904 et 1908).","pubDate":"2023-10-09 18:37:53","image_url":"https://medias.lequipe.fr/img-photo-jpg/le-baseball-avait-ete-programme-aux-jo-de-tokyo-il-y-a-deux-ans-reviendra-t-il-en-2028-a-los-angeles-j-crombie-usa-today-sports-presse-sports/1500000001845213/0:0,1998:999-665-335-70/07d2c.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"58fe35a39a3eae5e894545113e9857b7","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.northwalespioneer.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"Cricket is on the verge of returning to the Olympics for the first time in 128 years after the sport was put forward for inclusion at the 2028 Games. There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. A massive step for cricket and its bid for inclusion at the 2028 Olympic Games. Details 👇 — ICC (@ICC) LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.northwalespioneer.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bdd509870676f3eb87c467300c9bad9e","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.times-series.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.times-series.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"9beb0f276c25d494ac20502d426750a6","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.southwalesguardian.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"Cricket is on the verge of returning to the Olympics for the first time in 128 years after the sport was put forward for inclusion at the 2028 Games. There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. A massive step for cricket and its bid for inclusion at the 2028 Olympic Games. Details 👇 — ICC (@ICC) LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.southwalesguardian.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5fe6a550dd157e0652139b5c389ba7d0","title":"Female referee to take charge of England men's game for first time ever at Wembley","link":"https://www.dailystar.co.uk/sport/football/female-referee-england-men-wembley-31146961","keywords":["Sport"],"creator":null,"video_url":null,"description":"History will be made in the international friendly between Gareth Southgate's England team and an ever-improving Australia at Wembley Stadium","content":"For the first time ever, a female referee will take charge of an men’s match at Wembley Stadium. Stephanie Frappart will be the woman in the middle when side play host to Australia on October 13. It is another huge milestone for the French referee, who is widely considered to be one of the best in Europe. As well as becoming the first woman to referee an England men's match at Wembley, she was the first female to take charge of a UEFA Super Cup final, when she oversaw penalty-shootout victory over in 2019. The jumped at the chance to appoint the official for the clash against the Aussies, when the French Football Federation said she would be available. “Stephanie is an outstanding referee and she has officiated on the highest stage within France, across Europe and recently at the men’s and women’s FIFA ,” head of refereeing operations at the FA, Peter Elsworth said. “We’re delighted she and her team will take charge of our upcoming fixture against Australia in front of a sold-out crowd at Wembley Stadium. We’re looking forward to welcoming them to the home of English football.” As well as the Champions League, TNT Sports will also be offering sports fans access to games across the Premier League, Europa League, Serie A and much more. You can also watch the biggest events in boxing, UFC, WWE and get exclusive action from MLB. £29.99 per month on top of £8.99 per month Amazon Prime subscription Frappart is a Ligue 1 referee who has also taken charge of various matches in European competitions. As well as the French top flight, she has also overseen games in the and the recent World Cup in Qatar. She will be supported by assistants Mikael Berchebru and Aurélien Drouet and fourth official Hakim Ben El Hadj. VAR will be in place at Wembley, which will be managed by Mathieu Vernice and assistant VAR official Nicolas Rainville. While the match is technically a friendly, England have always had a rich sporting rivalry with Australia. The footballing tension may not be as fierce as it is in cricket or rugby, but it will still be a fixture that could get rowdy rather quickly. Australia have also made huge strides in international football by reaching the Round of 16 stage of the last World Cup. After losing 4-1 to runners-up France, they overcame Denmark and Tunisia before being knocked out by eventual winners Argentina.","pubDate":"2023-10-09 18:27:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31146969.ece/ALTERNATES/s98/0_Real-Madrid-v-Celtic-UEFA-Champions-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"673fc410fdba04351a8e7a1296f70315","title":"World Cup 2023: PCB Chairman Zaka Ashraf Meets Foreign Secretary To Address Visa Delay For Pakistani Fans And Journalists","link":"https://news.abplive.com/sports/cricket/world-cup-2023-pcb-chairman-zaka-ashraf-meets-foreign-secretary-to-address-visa-delay-for-pakistani-fans-and-journalists-1634874","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"In an effort to resolve the visa issuance delay faced by Pakistani fans and journalists attending the ongoing ICC World Cup in India, PCB Chairman Zaka Ashraf held discussions with Foreign Secretary Syrus Sajjad Qazi. The Pakistan Cricket Board (PCB) expressed its disappointment regarding the uncertainty surrounding Indian visas for these individuals and urged the Foreign Secretary to engage with the Indian Home Ministry and Pakistan High Commission in New Delhi to expedite the process. The PCB underscored the persistent challenges faced by Pakistani journalists and fans in obtaining Indian visas, stating, \"In the meantime, PCB has again reminded ICC and BCCI of their respective obligations and terms and conditions stipulated in the Host agreement to guarantee visas for fans and journalists of participating teams.\" Organized by the International Cricket Council (ICC) and hosted by the Board of Control for Cricket in India (BCCI), the World Cup has attracted approximately 60 journalists eager to cover the event. Pakistan has already competed in their opening match against the Netherlands on October 6 and is set to face Sri Lanka on Tuesday (October 10). The highly anticipated Pakistan-India clash is scheduled for October 14 in Ahmedabad. The visa applications for Pakistani journalists fall under India's prior reference category (PRC), requiring evaluation by the home, external affairs, and sports ministries. This has contributed to the delay in visa issuance. Efforts are ongoing to ensure a swift resolution to the visa issue, allowing Pakistani fans and journalists to participate fully in this prestigious cricketing event. Pakistan Full Fixture List World Cup 2023 FIXTURE DATE VENUE Pakistan vs Netherlands October 6 Hyderabad Pakistan vs Sri Lanka October 10 Hyderabad Pakistan vs India October 14 Ahmedabad Pakistan vs Australia October 20 Bengaluru Pakistan vs Afghanistan October 23 Chennai Pakistan vs South Africa October 27 Chennai Pakistan vs Bangladesh October 31 Kolkata Pakistan vs New Zealand November 4 Bengaluru Pakistan vs England November 11 Kolkata (With Inputs From PTI)","content":"In an effort to resolve the visa issuance delay faced by Pakistani fans and journalists attending the ongoing ICC World Cup in India, PCB Chairman Zaka Ashraf held discussions with Foreign Secretary Syrus Sajjad Qazi. The Pakistan Cricket Board (PCB) expressed its disappointment regarding the uncertainty surrounding Indian visas for these individuals and urged the Foreign Secretary to engage with the Indian Home Ministry and Pakistan High Commission in New Delhi to expedite the process. The PCB underscored the persistent challenges faced by Pakistani journalists and fans in obtaining Indian visas, stating, \"In the meantime, PCB has again reminded ICC and BCCI of their respective obligations and terms and conditions stipulated in the Host agreement to guarantee visas for fans and journalists of participating teams.\" Organized by the International Cricket Council (ICC) and hosted by the Board of Control for Cricket in India (BCCI), the World Cup has attracted approximately 60 journalists eager to cover the event. Pakistan has already competed in their opening match against the Netherlands on October 6 and is set to face Sri Lanka on Tuesday (October 10). The highly anticipated Pakistan-India clash is scheduled for October 14 in Ahmedabad. The visa applications for Pakistani journalists fall under India's prior reference category (PRC), requiring evaluation by the home, external affairs, and sports ministries. This has contributed to the delay in visa issuance. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Efforts are ongoing to ensure a swift resolution to the visa issue, allowing Pakistani fans and journalists to participate fully in this prestigious cricketing event. Pakistan Full Fixture List World Cup 2023 FIXTURE DATE VENUE Pakistan vs Netherlands October 6 Hyderabad Pakistan vs Sri Lanka October 10 Hyderabad Pakistan vs India October 14 Ahmedabad Pakistan vs Australia October 20 Bengaluru Pakistan vs Afghanistan October 23 Chennai Pakistan vs South Africa October 27 Chennai Pakistan vs Bangladesh October 31 Kolkata Pakistan vs New Zealand November 4 Bengaluru Pakistan vs England November 11 Kolkata (With Inputs From PTI)","pubDate":"2023-10-09 18:14:12","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/09/de08393cd40a90850e8a6b6d81f660901696875220912625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"5ce813487466202441f68a525eaa3290","title":"Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week","link":"https://www.dailymail.co.uk/sport/cricket/article-12611929/Cricket-set-feature-2028-Los-Angeles-Olympics-time-120-years-Great-Britain-beating-France-time-sport-played-games.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"DAVID COVERDALE: Cricket is set to feature at an Olympics for the first time in more than a century after Los Angeles 2028 organisers recommended it be added to their programme.","content":"Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week The Olympics have recently included sports such as skateboarding and surfing The addition of cricket ties in with the desire to appeal to the Indian market By David Coverdale For The Daily Mail Published: 16:18 EDT, 9 October 2023 | Updated: 19:10 EDT, 9 October 2023 e-mail 49 shares 3 View comments Cricket is set to feature at an Olympics for the first time in more than a century after Los Angeles 2028 organisers recommended it be added to their programme. Flag football - a non-contact version of American football - squash, lacrosse and baseball/softball have also been put forward to the International Olympic Committee for approval. A vote on LA's proposed sports will take place at a meeting in Mumbai next week, with Twenty20 cricket all but certain to get the green light given the IOC's desire to tap into the Indian market. The sport's only previous Olympic appearance was at Paris 1900, when Great Britain beat France in the final, which was also the only match. International Cricket Council chairman Greg Barclay said: 'We are delighted that LA28 have recommended cricket for inclusion in the Olympics. Cricket is set to be included in 2028 Los Angeles games, in a desire to access Indian markets Sports such as skateboarding, surfing, karate, baseball and softball were included in Tokyo There is a massive market for cricket in India which the Olympics will hope to tap into 'Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. 'I'd like to thank LA28 for their support during the new sport evaluation process over last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men's Cricket World Cup next week.' The five proposed sports would be in addition to the 28 sports already announced for LA 2028. However, recommending four new team sports poses the IOC a problem as they have stated their desire to keep athlete numbers down to 10,500. LA28 chairperson Casey Wasserman said: 'LA28's proposed sports ignite the imagination on the field of play and drive culture off it. 'They're relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. 'They will bring new athletes to the Games, engage diverse fanbases and expand the Games' presence in digital spaces, further amplifying LA28's mission to deliver an unparalleled experience.' The NFL was part of the bid for flag football, which is usually played with teams of five and sees players pull a flag off an opponent rather than tackling them. Squash would be another sport being played at an Olympics for the first time after a number of failed attempts to be added to the programme. The World Squash Federation said: 'The decision is a significant and exciting milestone in squash's history as the sport nears inclusion in the Olympic Games for the first time.' Lacrosse was contested at the Olympics in 1904 and 1908 and a six-a-side format of the sport has been proposed for LA. Men's baseball and women's softball featured at Tokyo 2020 but were left off the programme for Paris 2024. Flag football, a non-contact version of American football, is also set to be included at LA28 Share or comment on this article: Cricket is set to feature at the Olympics for the first time in over 120 years at Los Angeles 2028... with the T20 format to be ratified at key IOC meeting in Mumbai next week e-mail 49 shares Add comment Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-10-09 23:10:28","image_url":"https://i.dailymail.co.uk/1s/2023/10/09/21/76352915-0-image-a-8_1696882680340.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"6da39aeead191c151c62bb1b4fcdfb28","title":"ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more","link":"https://www.firstpost.com/firstcricket/sports-news/england-vs-bangladesh-match-preview-head-to-head-cricket-world-cup-2023-live-streaming-how-to-watch-eng-vs-ban-live-online-tv-channel-13225612.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more","content":"Cricket ENG vs BAN, World Cup 2023: England aim to bounce back as Bangladesh eye back-to-back wins; LIVE streaming and more England will aim to bury the disappointment of their nine-wicket thrashing at the hands of New Zealand when they take on Bangladesh in Dharamsala FirstCricket Staff Last Updated:October 10, 2023 02:43:14 IST England players train at the HPCA Stadium in Dharamsala on the eve of their ICC World Cup match against Bangladesh. AP England will aim to bounce back from a heavy defeat in their opening match of the 2023 ICC World Cup when they take on Bangladesh in Dharamsala on Tuesday. World Cup 2023: News | Schedule | Results | Points table Defending champions England got their campaign off to the worst possible start on Thursday at Ahmedabad’s Narendra Modi Stadium. Jos Buttler and Co suffered a nine-wicket thrashing at the hands of New Zealand, the team they had defeated via boundary count in the 2019 final that ended in a tie — both in the main game as well as in the subsequent Super Over. Related Articles England vs Bangladesh, World Cup 2023: Dharamsala Weather and Pitch Report World Cup 2023: England captain Jos Buttler slams 'poor' Dharamsala outfield, provides crucial update on Ben Stokes Devon Conway (152 not out) and Rachin Ravindra (123 not out) led the way with unbeaten centuries, sharing a 273-run unbroken stand for the second wicket after the Black Caps got off to a disastrous start in their chase of the 283-run target. Bangladesh, on the other hand, were among the teams that emerged victorious in the opening week of the 13th edition of ICC’s showpiece event, defeating Afghanistan by six wickets in Dharamsala. Mehidy Hasan Miraz led the way with an all-round effort against the Afghan Atalans, collecting 3/25 and scoring 57. Besides Mehidy’s efforts, Shakib Al Hasan (3/30) and Najmul Hossain Shanto (59 not out) also chipped in with ball and bat respectively as Bangladesh bowled Afghanistan out for a modest 156 before chasing the target down with more than 15 overs to spare. There were some concerns regarding the outfield at Dharamsala’s HPCA Stadium during the Bangladesh-Afghanistan match, with off-spinner Mujeeb-Ur-Rahman appearing to have hurt his knee while putting in a slide near the boundary — something coach Jonathan Trott wasn’t too happy about after the game. With the upcoming fixture set to take place at the same venue in the first match of the Tuesday double-header, England captain Buttler too expressed his reservations . “It’s poor in my opinion. I think any time you’re sort of talking about being careful diving when you’re fielding, it goes against everything you want to be as a team. “We won’t use it as an excuse, we’ll adapt to it. But if you feel like you’re having to hold yourself back, it’s not a place you want to be as a team or player, or in a World Cup match. “Fingers crossed that no one on either side picks up an unfortunate injury,” Buttler said on the eve of his team’s face-off against Bangladesh. Buttler also hinted at Stokes, England’s hero of the 2019 final and their man for the big occasions, sitting out for a second game in a row. “It’s good to see him back in the nets and building back towards full fitness but probably he’s unlikely for tomorrow,” added Buttler. England vs Bangladesh World Cup 2023 match date The England vs Bangladesh Cricket World Cup match will be played on Tuesday, 10 October. England vs Bangladesh World Cup 2023 match time The England vs Bangladesh Cricket World Cup match will start at 10.30 AM IST. The toss will take place at 10.00 AM IST. England vs Bangladesh World Cup 2023 match venue The England vs Bangladesh Cricket World Cup match will be played at the HPCA Stadium in Dharamsala. England vs Bangladesh World Cup 2023 match LIVE Streaming The England vs Bangladesh Cricket World Cup match will be broadcast live on Star Sports Network and live streaming will be available on Disney+ Hotstar. England vs Bangladesh head-to-head England 2-2 Bangladesh England and Bangladesh have met a total of four times in ICC World Cups, the first of which took place in Barbados during the Super Eights stage of the 2007 World Cup. While England pulled off a hard-fought four-wicket win in that encounter, Bangladesh would go on to win the next two — at Chattogram in 2011 and in Adelaide in 2015. The second of those Bangladeshi victories was a knockout punch, one that would force the ECB to opt for a complete overhaul of their limited-overs structure. England would meet Bangladesh four years later in Cardiff, and this time go level on the head-to-head record with a 106-run win. Squads: England : Jonny Bairstow, Dawid Malan, Joe Root, Harry Brook, Moeen Ali, Jos Buttler(w/c), Liam Livingstone, Sam Curran, Chris Woakes, Adil Rashid, Mark Wood, Ben Stokes, Gus Atkinson, David Willey, Reece Topley Bangladesh : Tanzid Hasan, Litton Das, Mehidy Hasan Miraz, Najmul Hossain Shanto, Shakib Al Hasan(c), Mushfiqur Rahim(w), Towhid Hridoy, Mahmudullah, Taskin Ahmed, Shoriful Islam, Mustafizur Rahman, Mahedi Hasan, Nasum Ahmed, Hasan Mahmud, Tanzim Hasan Sakib Join our Whatsapp channel to get the latest global news updates Published on: October 10, 2023 02:41:55 IST Tags: Cricket England Vs Bangladesh World Cup 2023","pubDate":"2023-10-09 21:13:14","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/England-training-Bangladesh-Dharamsala-World-Cup-AP-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"4fb8e49ea29e79dd50ccfdc2da74d6cf","title":"Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games","link":"https://www.firstpost.com/firstcricket/sports-news/cricket-in-olympics-la-2028-organisers-recommend-sports-inclusion-in-34th-games-13225562.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games","content":"Cricket Cricket in Olympics: LA 2028 organisers recommend sport's inclusion in 34th Games If cricket makes the cut, it would be the first time it has featured since 1900, when a team from Britain beat a side representing France in Paris. FirstCricket Staff Last Updated:October 10, 2023 00:17:51 IST Representational image. Reuters Cricket could finally make a comeback into the Summer Olympics after more than a century with the organisers of the 2028 Games in Los Angeles making a formal recommendation for including the T20 version of the sport. Cricket was listed among the proposed “new” sports alongside baseball/softball, flag football, lacrosse and squash. There was however, no mention of breaking — which makes its debut in the Paris Olympics that takes place next summer. If cricket makes the cut, it would be the first time it has featured since 1900, when a team from Britain beat a side representing France in Paris. Five sports have been proposed by the @LA28 Organising Committee for inclusion at the Olympic Games in Los Angeles in five years’ time: Related Articles Canada qualify for T20 World Cup for first time after beating Bermuda in qualifiers ICC World Cup Factbox: How England have fared in quadrennial showpiece event over the years ⚾ Baseball-softball 🏏 Cricket 🏈 Flag football 🥍 Lacrosse ⚫ Squash The final decision will be made in the coming days. pic.twitter.com/kU1303jY0A — The Olympic Games (@Olympics) October 9, 2023 The final choice of which sports are retained for LA28 will be voted on at the IOC Session next Monday in Mumbai. The International Cricket Council welcomed the decision to propose cricket. ICC Chairman Greg Barclay said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century.” The ICC’s proposal is for men’s and women’s Twenty20 competitions — the shortest form of the international game at 20 overs per side. While it has not featured in the biggest sporting event in the world for over a century, cricket has made relatively recent appearances in other multi-nation, multi-sport events. It had made its debut in the Commonwealth Games in Kuala Lumpur 1998, and returned after 24 years in last year’s edition in Birmingham. Cricket also featured in the 2010 and 2014 editions of the Asian Games in Guangzhou and Incheon respectively, and was also part of the events in the recently-concluded 19th edition in Hangzhou, where India won gold in both the men’s and women’s events. With inputs from AFP Join our Whatsapp channel to get the latest global news updates Published on: October 09, 2023 23:51:07 IST Tags: 2028 La Olympics 2028 Los Angeles Olympics Cricket Olympics","pubDate":"2023-10-09 18:47:51","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/10/Los-Angeles-Olympics-2028-Reuters-640.jpg","source_id":"firstpost","source_priority":5906,"country":["india"],"category":["sports"],"language":"english"},{"article_id":"0d42df3d0fb66a3d5a58b3d74383c914","title":"India vs Pakistan मैच वाले दिन लगभग छावनी में तब्दील हो जाएगा अहमदाबाद, इतनी बड़ी संख्या में सुरक्षाकर्मी होंगे तैनात","link":"https://sports.ndtv.com/hindi/cricket/ahmedabad-will-be-converted-almost-in-cantonment-on-india-vs-pakistan-match-day-such-a-huge-number-of-security-personal-going-to-to-be-deployed-4465943#publisher=newsstand","keywords":null,"creator":null,"video_url":null,"description":"World Cup 2023, India vs Pakistan: इससे पहले दिन में गुजरात के मुख्यमंत्री भूपेन्द्र पटेल ने विश्व कप मैच बिना किसी गड़बड़ी संपन्न हो, यह सुनिश्चित करने के लिए गांधीनगर में गृह राज्य मंत्री हर्ष संघवी, राज्य के पुलिस महानिदेशक विकास सहाय, जी.एस. मलिक और अन्य वरिष्ठ पुलिस अधिकारियों के साथ पुलिस की कार्य योजना की समीक्षा बैठक की.","content":"भारत-पाकिस्तान के बीच World Cup 2023 वाले दिन 14 अक्टूबर को अहमदाबाद और नरेन्द्र मोदी स्टेडियम में गुजरात पुलिस, राष्ट्रीय सुरक्षा समूह (एनएसजी), त्वरित कार्रवाई बल (आरएएफ) और होमगार्ड समेत विभिन्न एजेंसियों के 11 हजार से अधिक सुरक्षाकर्मी तैनात किए जाएंगे. एक वरिष्ठ अधिकारी ने सोमवार को यह जानकारी दी. उन्होंने बताया कि धमकियों के बाद उच्च स्तरीय सुरक्षा व्यवस्था की गई है. अहमदाबाद के पुलिस आयुक्त जी.एस. मलिक ने बताया कि हालांकि पिछले 20 वर्षों में अहमदाबाद में क्रिकेट मैच के दौरान किसी भी तरह की सांप्रदायिक हिंसा नहीं देखी गई, लेकिन एहतियात के तौर पर कई संवेदनशील क्षेत्रों में सुरक्षा बल तैनात किए जाएंगे. इससे पहले दिन में गुजरात के मुख्यमंत्री भूपेन्द्र पटेल ने विश्व कप मैच बिना किसी गड़बड़ी संपन्न हो, यह सुनिश्चित करने के लिए गांधीनगर में गृह राज्य मंत्री हर्ष संघवी, राज्य के पुलिस महानिदेशक विकास सहाय, जी.एस. मलिक और अन्य वरिष्ठ पुलिस अधिकारियों के साथ पुलिस की कार्य योजना की समीक्षा बैठक की. मलिक ने एक संवाददाता सम्मेलन को संबोधित करते हुए कहा कि स्टेडियम में एक लाख से अधिक दर्शकों की आवाजाही और एक ईमेल के जरिये मिली धमकी को ध्यान में रखते हुए पुख्ता सुरक्षा व्यवस्था की गई है. मलिक ने कहा, ‘मैच के दौरान स्टेडियम की सुरक्षा और शहर के सांप्रदायिक रूप से संवेदनशील क्षेत्रों में कानून व्यवस्था बनाए रखने के लिए हम सात हजार से अधिक पुलिसकर्मियों के साथ-साथ लगभग चार हजार गृह रक्षक तैनात करेंगे. इनके अलावा एनएसजी की तीन टीमें और एक एंटी-ड्रोन टीम तैनात रहेगी. बम खोजी दस्ते की नौ टीमें भी तैनात की जाएंगी.' उन्होंने बताया कि महानिरीक्षक और उप महानिरीक्षक स्तर के चार वरिष्ठ भारतीय पुलिस सेवा (आईपीएस) अधिकारी और 21 पुलिस उपायुक्त (डीसीपी) स्तर के अधिकारी मैच के दिन कर्मियों की निगरानी और उनका मार्गदर्शन करेंगे. खबरों के अनुसार, मुंबई पुलिस को एक ईमेल मिला जिसमें एक अज्ञात व्यक्ति ने प्रधानमंत्री को नुकसान पहुंचाने और अहमदाबाद में नरेन्द्र मोदी स्टेडियम को उड़ाने की धमकी दी है. ईमेल भेजने वाले ने 500 करोड़ रुपये और कुख्यात गैंगस्टर लॉरेंस बिश्नोई को जेल से रिहा करने की भी मांग की है. पढ़ें ,राजनीति,खेल समाचार, और की ताजा समाचार अब हिंदी में ( ) लाइव खबर देखें: फॉलो करे:","pubDate":"2023-10-09 18:42:22","image_url":"https://c.ndtvimg.com/2023-09/u8nng0ug_india-vs-pakistan_120x90_08_September_23.jpg","source_id":"ndtv_in","source_priority":129751,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"b94567c9edd6f5a32bda1c39ca3dd337","title":"Baseball, flag football, cricket, squash et crosse proposés pour les Jeux Olympiques 2028","link":"https://www.lequipe.fr/Tous-sports/Actualites/Baseball-flag-football-cricket-squash-et-crosse-proposes-pour-les-jeux-olympiques-2028/1424455#xtor=RSS-1","keywords":["JO 2028"],"creator":["Olivier Paquereau"],"video_url":null,"description":"Les organisateurs des Jeux Olympiques de Los Angeles 2028 ont dévoilé lundi les sports qu'ils souhaiteraient voir ajoutés au programme des JO : le baseball, le flag football, le cricket, le squash et la crosse. Le breakdance n'a pas été retenu.","content":"Le Comité d'organisation des Jeux Olympiques et Paralympiques de Los Angeles 2028 a dévoilé lundi les cinq sports additionnels qu'il proposera au Comité international olympique (CIO), en vue de leur potentielle inclusion au programme des JO dans cinq ans. On y retrouve le baseball (et sa déclinaison pour les femmes, le softball), discipline enracinée dans la culture des États-Unis, (du football américain sans contact), le cricket, surtout pratiqué dans des pays anglophones et dont se déroule actuellement, le squash et la crosse, un sport collectif qui provient des cultures amérindiennes. Le breakdance, qui sera sport additionnel aux Jeux Olympiques de Paris 2024, n'a en revanche pas été retenu. Le CIO rendra sa décision la semaine prochaine lors de sa prochaine session à Bombay (Inde). Des cinq sports proposés, trois ont déjà été olympiques : le baseball (de 1992 à 2008 puis en 2021), le cricket (en 1900) et la crosse (en 1904 et 1908).","pubDate":"2023-10-09 18:37:53","image_url":"https://medias.lequipe.fr/img-photo-jpg/le-baseball-avait-ete-programme-aux-jo-de-tokyo-il-y-a-deux-ans-reviendra-t-il-en-2028-a-los-angeles-j-crombie-usa-today-sports-presse-sports/1500000001845213/0:0,1998:999-665-335-70/07d2c.jpg","source_id":"lequipe","source_priority":21660,"country":["france"],"category":["sports"],"language":"french"},{"article_id":"58fe35a39a3eae5e894545113e9857b7","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.northwalespioneer.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"Cricket is on the verge of returning to the Olympics for the first time in 128 years after the sport was put forward for inclusion at the 2028 Games. There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. A massive step for cricket and its bid for inclusion at the 2028 Olympic Games. Details 👇 — ICC (@ICC) LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.northwalespioneer.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"northwalespioneer","source_priority":1008924,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"bdd509870676f3eb87c467300c9bad9e","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.times-series.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.times-series.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"time_series","source_priority":668753,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"9beb0f276c25d494ac20502d426750a6","title":"Cricket among sports put forward for inclusion at the 2028 Olympics","link":"https://www.southwalesguardian.co.uk/sport/national/23844500.cricket-among-sports-put-forward-inclusion-2028-olympics/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"A men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the LA Games.","content":"Cricket is on the verge of returning to the Olympics for the first time in 128 years after the sport was put forward for inclusion at the 2028 Games. There has only been one cricket match played at an Olympics, when Great Britain defeated hosts France in a low-scoring Test to win gold at the 1900 Games. But a men’s and women’s T20 competition joins baseball/softball, flag football, lacrosse and squash in being endorsed by the organisers of the Los Angeles Games as additional sports for five years’ time. A massive step for cricket and its bid for inclusion at the 2028 Olympic Games. Details 👇 — ICC (@ICC) LA28 said in a statement its proposal will be “reviewed” by the International Olympic Committee executive board for “ratification” at the 141st IOC session in Mumbai on October 16. International Cricket Council chairman Greg Barclay was cautiously optimistic about the news, two years on from the governing body announcing it would bid to have the sport included at the Olympics. He said: “We are delighted that LA28 have recommended cricket for inclusion in the Olympics. “Whilst this is not the final decision, it is a very significant landmark towards seeing cricket at the Olympics for the first time in more than a century. “I’d like to thank LA28 for their support during the new sport evaluation process over the last two years and we look forward to the final decision being taken at the IOC Session, in India, during the ICC Men’s Cricket World Cup next week.” A T20 tournament was suggested by the ICC due to its popularity and brevity ahead of Tests and ODIs, as well as the requirement for the format to have a World Cup, ruling out shorter spectacles such as T10. The success of women’s cricket in recent years has also been a driving factor after an eight-team tournament won by Meg Lanning’s Australia side was held at the 2022 Commonwealth Games in Birmingham. LA28 chairperson Casey Wasserman said: “The proposed sports ignite the imagination on the field of play and drive culture off it. “They’re relevant, innovative and community-based, played in backyards, schoolyards, community centres, stadiums and parks across the US and the globe. “They will bring new athletes to the Games, engage diverse fanbases and expand the Games’ presence in digital spaces, further amplifying LA28’s mission to deliver an unparalleled experience.” Squash, meanwhile, is set for its inaugural appearance at an Olympics in 2028, having missed out on a number of occasions, as is flag football – a non-contact alternative to American football. Baseball/softball was dropped from Paris 2024 having been selected for Tokyo 2020, with host cities able to submit sports they want adding to the schedule. Lacrosse has been on the Olympic programme on five occasions but not since 1948.","pubDate":"2023-10-09 18:32:23","image_url":"https://www.southwalesguardian.co.uk/resources/images/16151454/?type=app&htype=0","source_id":"southwalesguardian","source_priority":1703505,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"5fe6a550dd157e0652139b5c389ba7d0","title":"Female referee to take charge of England men's game for first time ever at Wembley","link":"https://www.dailystar.co.uk/sport/football/female-referee-england-men-wembley-31146961","keywords":["Sport"],"creator":null,"video_url":null,"description":"History will be made in the international friendly between Gareth Southgate's England team and an ever-improving Australia at Wembley Stadium","content":"For the first time ever, a female referee will take charge of an men’s match at Wembley Stadium. Stephanie Frappart will be the woman in the middle when side play host to Australia on October 13. It is another huge milestone for the French referee, who is widely considered to be one of the best in Europe. As well as becoming the first woman to referee an England men's match at Wembley, she was the first female to take charge of a UEFA Super Cup final, when she oversaw penalty-shootout victory over in 2019. The jumped at the chance to appoint the official for the clash against the Aussies, when the French Football Federation said she would be available. “Stephanie is an outstanding referee and she has officiated on the highest stage within France, across Europe and recently at the men’s and women’s FIFA ,” head of refereeing operations at the FA, Peter Elsworth said. “We’re delighted she and her team will take charge of our upcoming fixture against Australia in front of a sold-out crowd at Wembley Stadium. We’re looking forward to welcoming them to the home of English football.” As well as the Champions League, TNT Sports will also be offering sports fans access to games across the Premier League, Europa League, Serie A and much more. You can also watch the biggest events in boxing, UFC, WWE and get exclusive action from MLB. £29.99 per month on top of £8.99 per month Amazon Prime subscription Frappart is a Ligue 1 referee who has also taken charge of various matches in European competitions. As well as the French top flight, she has also overseen games in the and the recent World Cup in Qatar. She will be supported by assistants Mikael Berchebru and Aurélien Drouet and fourth official Hakim Ben El Hadj. VAR will be in place at Wembley, which will be managed by Mathieu Vernice and assistant VAR official Nicolas Rainville. While the match is technically a friendly, England have always had a rich sporting rivalry with Australia. The footballing tension may not be as fierce as it is in cricket or rugby, but it will still be a fixture that could get rowdy rather quickly. Australia have also made huge strides in international football by reaching the Round of 16 stage of the last World Cup. After losing 4-1 to runners-up France, they overcame Denmark and Tunisia before being knocked out by eventual winners Argentina.","pubDate":"2023-10-09 18:27:06","image_url":"https://i2-prod.dailystar.co.uk/incoming/article31146969.ece/ALTERNATES/s98/0_Real-Madrid-v-Celtic-UEFA-Champions-League.jpg","source_id":"dailystar","source_priority":3076,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"673fc410fdba04351a8e7a1296f70315","title":"World Cup 2023: PCB Chairman Zaka Ashraf Meets Foreign Secretary To Address Visa Delay For Pakistani Fans And Journalists","link":"https://news.abplive.com/sports/cricket/world-cup-2023-pcb-chairman-zaka-ashraf-meets-foreign-secretary-to-address-visa-delay-for-pakistani-fans-and-journalists-1634874","keywords":["Cricket"],"creator":["ABP News Bureau"],"video_url":null,"description":"In an effort to resolve the visa issuance delay faced by Pakistani fans and journalists attending the ongoing ICC World Cup in India, PCB Chairman Zaka Ashraf held discussions with Foreign Secretary Syrus Sajjad Qazi. The Pakistan Cricket Board (PCB) expressed its disappointment regarding the uncertainty surrounding Indian visas for these individuals and urged the Foreign Secretary to engage with the Indian Home Ministry and Pakistan High Commission in New Delhi to expedite the process. The PCB underscored the persistent challenges faced by Pakistani journalists and fans in obtaining Indian visas, stating, \"In the meantime, PCB has again reminded ICC and BCCI of their respective obligations and terms and conditions stipulated in the Host agreement to guarantee visas for fans and journalists of participating teams.\" Organized by the International Cricket Council (ICC) and hosted by the Board of Control for Cricket in India (BCCI), the World Cup has attracted approximately 60 journalists eager to cover the event. Pakistan has already competed in their opening match against the Netherlands on October 6 and is set to face Sri Lanka on Tuesday (October 10). The highly anticipated Pakistan-India clash is scheduled for October 14 in Ahmedabad. The visa applications for Pakistani journalists fall under India's prior reference category (PRC), requiring evaluation by the home, external affairs, and sports ministries. This has contributed to the delay in visa issuance. Efforts are ongoing to ensure a swift resolution to the visa issue, allowing Pakistani fans and journalists to participate fully in this prestigious cricketing event. Pakistan Full Fixture List World Cup 2023 FIXTURE DATE VENUE Pakistan vs Netherlands October 6 Hyderabad Pakistan vs Sri Lanka October 10 Hyderabad Pakistan vs India October 14 Ahmedabad Pakistan vs Australia October 20 Bengaluru Pakistan vs Afghanistan October 23 Chennai Pakistan vs South Africa October 27 Chennai Pakistan vs Bangladesh October 31 Kolkata Pakistan vs New Zealand November 4 Bengaluru Pakistan vs England November 11 Kolkata (With Inputs From PTI)","content":"In an effort to resolve the visa issuance delay faced by Pakistani fans and journalists attending the ongoing ICC World Cup in India, PCB Chairman Zaka Ashraf held discussions with Foreign Secretary Syrus Sajjad Qazi. The Pakistan Cricket Board (PCB) expressed its disappointment regarding the uncertainty surrounding Indian visas for these individuals and urged the Foreign Secretary to engage with the Indian Home Ministry and Pakistan High Commission in New Delhi to expedite the process. The PCB underscored the persistent challenges faced by Pakistani journalists and fans in obtaining Indian visas, stating, \"In the meantime, PCB has again reminded ICC and BCCI of their respective obligations and terms and conditions stipulated in the Host agreement to guarantee visas for fans and journalists of participating teams.\" Organized by the International Cricket Council (ICC) and hosted by the Board of Control for Cricket in India (BCCI), the World Cup has attracted approximately 60 journalists eager to cover the event. Pakistan has already competed in their opening match against the Netherlands on October 6 and is set to face Sri Lanka on Tuesday (October 10). The highly anticipated Pakistan-India clash is scheduled for October 14 in Ahmedabad. The visa applications for Pakistani journalists fall under India's prior reference category (PRC), requiring evaluation by the home, external affairs, and sports ministries. This has contributed to the delay in visa issuance. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Efforts are ongoing to ensure a swift resolution to the visa issue, allowing Pakistani fans and journalists to participate fully in this prestigious cricketing event. Pakistan Full Fixture List World Cup 2023 FIXTURE DATE VENUE Pakistan vs Netherlands October 6 Hyderabad Pakistan vs Sri Lanka October 10 Hyderabad Pakistan vs India October 14 Ahmedabad Pakistan vs Australia October 20 Bengaluru Pakistan vs Afghanistan October 23 Chennai Pakistan vs South Africa October 27 Chennai Pakistan vs Bangladesh October 31 Kolkata Pakistan vs New Zealand November 4 Bengaluru Pakistan vs England November 11 Kolkata (With Inputs From PTI)","pubDate":"2023-10-09 18:14:12","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/09/de08393cd40a90850e8a6b6d81f660901696875220912625_original.jpg","source_id":"abplive","source_priority":10959,"country":["india"],"category":["sports"],"language":"english"}]}