{"newsArray":[{"title":"Cricket-Australia opener Harris to play in third Ashes test - Langer","link":"https://www.thestar.com.my/sport/cricket/2021/12/23/cricket-australia-opener-harris-to-play-in-third-ashes-test---langer","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Australia will retain struggling opener Marcus Harris for the third Ashes test and are confident paceman Mitchell Starc will recover from a rib problem in time to bowl at the Melbourne Cricket Ground, coach Justin Langer said on Thursday. Read full story","content":null,"pubDate":"2021-12-22 23:45:00","full_description":"SYDNEY (Reuters) - Australia will retain struggling opener Marcus Harris for the third Ashes test and are confident paceman Mitchell Starc will recover from a rib problem in time to bowl at the Melbourne Cricket Ground, coach Justin Langer said on Thursday. With 38 runs in four innings so far in the series, Harris is the one specialist batter in the Australia team who did not thrive as the hosts secured big wins in the first two tests in Brisbane and Adelaide. \"He'll play in the test, no worries about that,\" Langer told reporters. \"This is his home ground, he's played a lot at the MCG. He hasn't made the runs he'd liked to at the moment but ... he knows how to play ... \"For him, for us, we're hoping he plays well and gets a good partnership with Davy Warner in this Boxing Day test match.\" Langer, an opener who played 105 tests for Australia, endured similar periods where his position was in question and said it was important to support players. \"We like to back our players in, where we can,\" he added. \"It's a tough gig, opening in test cricket, but we're really confident Marcus has got what it takes to be a successful Australian opening batsman.\" Pat Cummins and fellow fast bowler Josh Hazlewood will return to the squad later on Thursday after missing the second test in Adelaide, which Australia won by 275 runs. Cummins has completed health protocols after being deemed a close contact of a COVID-19 case and is sure to resume the captaincy but Hazlewood will need to prove he has recovered from a side strain sustained in the series opener. Michael Neser and Jhye Richardson replaced the duo in Adelaide, while uncapped paceman Scott Boland was brought into the squad as cover on Tuesday, and Langer said he was undecided on the make-up of the bowling attack for Melbourne. \"Both Michael and Jhye did a great job in the last test match,\" he added. \"We've got five test matches in a row, we'll just manage our bowlers as best we can and we'll put our fittest and our most ready to perform out on the park in Melbourne.\" There were also concerns over Starc after he was injured while batting in Adelaide, but Langer thought the left-arm quick would be ready to go on Sunday. \"I'd be very surprised if he didn't get up for the Boxing Day test,\" Langer said. \"He should be fine, he's tough. If he's not right, we'll look at it, but at this stage there's no indication he won't be available.\" (Reporting by Nick Mulvenney, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/23/1417433.jpg","source_id":"thestar_my"},{"title":"'Divided' England in turmoil as Ashes unravels","link":"https://wwos.nine.com.au/cricket/ashes-2021-ian-chappell-and-mark-taylor-question-joe-roots-grasp-on-england-cricket-team/127d0c7a-1c64-4385-b63d-d17cb84e16cb","keywords":null,"creator":["wwos"],"video_url":null,"description":"Former Australian captains Ian Chappell and Mark Taylor have questioned the chemistry inside the England camp.","content":"Former Australian captains Ian Chappell and Mark Taylor have questioned the chemistry inside the England camp, speculating that a divide has developed between the leadership group and the bowlers.Chappell said that coach Mark Silverwood is too ingrained in the make-up of the team.\"It's a setup that doesn't work. One of the reasons why Mark [Taylor] was a successful captain is because he took charge. When Bob Simpson was stepping forward to make the speech, Mark said, 'No Bob, I'll do this,'\" he said on Nine's Outside the Rope.READ MORE: Disgraced NRL star hammered in boxing debutREAD MORE: Hamilton's dramatic F1 loss sparks death threatsREAD MORE: Iconic cricket commentator hangs up the mic\"Now everybody knows Mark's in charge. That's what the captain's got to be.\"It's the only way the team can work. The captain runs the show, but that's not to say he does it on his own, he does it with some help.\"Silverwood stunned fans yesterday when he said that he would have picked the exact same teams for the first two Tests if he had his time over again, despite both ending in heavy defeat.Taylor said that despite analytics and larger staffs playing a more prominent role in decision-making than in yesterday, a strong leader was still needed out in the middle.\"The players of today, they're different to my era and before. The like having people around them, they like extra information. They like people with computers around them telling them if their front foot is in the right position,\" he said.\"No matter how much information you have, someone still needs to be the one to say, 'Righto boys, this is what we're going to do.'\"That's got to come down to the captain. Cricket is a different game. You're out there for five days, the coach and the gurus, they don't change the field, they don't tell you when the bowler's going to bowl.\"They don't say if you go for a spinner or a quick. That's you. You've got to be the one to step up.\"Taylor said he understood Root's frustrations, but that the time for action hadn't come quickly enough.\"I think Joe is now trying to do it, but it's been a bit late. He's actually come out with a few statements since the last Test, about England not bowling well, I assume that's being said behind the scenes because it needed to be, but I think he's now had enough.\"There's too much noise in and around the team, and I suspect there's probably now a division in that team between the bowlers and Joe Root and Chris Silverwood, which is not a good thing.\"Chappell described the England captain as a rabbit in the headlights at times.\"It's all down to Joe Root. Pat Cummins is the most inspirational player in the Australian side, you've got to have a captain that's inspirational,\" he said.\"I look at close ups of Joe Root's face, and he's a rabbit in the headlights. I don't see anything in that face.\"Broad, Anderson, everyone's clapping behind the wicket, I'd like to clap when the guy plays forward and misses, or edges, not when he goes like that [leaves a ball].\"That's not great bowling. That's when the captain needs to say, 'Listen guys, you either bowl at the stumps or you'll be out there at backward square leg.'For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-22 23:06:41","full_description":"Former Australian captains Ian Chappell and Mark Taylor have questioned the chemistry inside the England camp, speculating that a divide has developed between the leadership group and the bowlers. Chappell said that coach Mark Silverwood is too ingrained in the make-up of the team. \"It's a setup that doesn't work. One of the reasons why Mark [Taylor] was a successful captain is because he took charge. When Bob Simpson was stepping forward to make the speech, Mark said, 'No Bob, I'll do this,'\" he said on Nine's Outside the Rope. READ MORE: Disgraced NRL star hammered in boxing debut READ MORE: Hamilton's dramatic F1 loss sparks death threats READ MORE: Iconic cricket commentator hangs up the mic \"Now everybody knows Mark's in charge. That's what the captain's got to be. \"It's the only way the team can work. The captain runs the show, but that's not to say he does it on his own, he does it with some help.\" Silverwood stunned fans yesterday when he said that he would have picked the exact same teams for the first two Tests if he had his time over again, despite both ending in heavy defeat . Taylor said that despite analytics and larger staffs playing a more prominent role in decision-making than in yesterday, a strong leader was still needed out in the middle. \"The players of today, they're different to my era and before. The like having people around them, they like extra information. They like people with computers around them telling them if their front foot is in the right position,\" he said. \"No matter how much information you have, someone still needs to be the one to say, 'Righto boys, this is what we're going to do.' \"That's got to come down to the captain. Cricket is a different game. You're out there for five days, the coach and the gurus, they don't change the field, they don't tell you when the bowler's going to bowl. \"They don't say if you go for a spinner or a quick. That's you. You've got to be the one to step up.\" Taylor said he understood Root's frustrations, but that the time for action hadn't come quickly enough. \"I think Joe is now trying to do it, but it's been a bit late. He's actually come out with a few statements since the last Test, about England not bowling well, I assume that's being said behind the scenes because it needed to be, but I think he's now had enough. \"There's too much noise in and around the team, and I suspect there's probably now a division in that team between the bowlers and Joe Root and Chris Silverwood, which is not a good thing.\" Chappell described the England captain as a rabbit in the headlights at times. \"It's all down to Joe Root. Pat Cummins is the most inspirational player in the Australian side, you've got to have a captain that's inspirational,\" he said. \"I look at close ups of Joe Root's face, and he's a rabbit in the headlights. I don't see anything in that face. \"Broad, Anderson, everyone's clapping behind the wicket, I'd like to clap when the guy plays forward and misses, or edges, not when he goes like that [leaves a ball]. \"That's not great bowling. That's when the captain needs to say, 'Listen guys, you either bowl at the stumps or you'll be out there at backward square leg.' For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400026/pickerimage.jpg","source_id":"nine"},{"title":"England ponders mass changes amid Ashes carnage","link":"https://wwos.nine.com.au/cricket/ashes-2021-australia-vs-england-boxing-day-test-four-changes-marcus-harris-will-play/d05ce65f-6e86-4893-8c07-884b333ac556","keywords":null,"creator":["wwos"],"video_url":null,"description":"England is considering making wholesale changes to its side for the third Test at the MCG.","content":"England will reportedly make as many as four changes to its side for the Boxing Day Test at the MCG, as the visitors' hopes of regaining the Ashes slip away.Already trailing 2-0 and needing to win all three remaining matches to regain the urn, Joe Root's side could look significantly different in Melbourne.The Evening Standard reports Zak Crawley, Jonny Bairstow, Mark Wood and Jack Leach are all being considered for the third Test.READ MORE: Gallen's generous act for two young boxersREAD MORE: Fenech blasts ref as NRL player beltedREAD MORE: Garside's pro debut ends in controversyCrawley is likely to open the batting, although it's not clear who he would replace, given both Rory Burns (51 runs at an average of 12.75) and Haseeb Hameed (58 at 14.50) have struggled so far.It's been a horror year for England opening batters, who have recorded no less than 13 ducks in Test cricket in 2021. Burns has been out without scoring on six occasions, a record for an opener.Whether Crawley is the answer remains to be seen, given he hasn't played a first class match since September, and his 15 Test matches to date have seen him average just 28.34, a figure boosted substantially by his only century - 267 against Pakistan last year.Of the other changes, Bairstow is in contention to replace Ollie Pope in the middle order, while Wood and Leach would feature in a revamped bowling attack.Australian coach Justin Langer this morning confirmed under-pressure opener Marcus Harris would play at the MCG, despite a disappointing series so far.Harris has made just 38 runs in the two matches, and with an average of 22.19 from 12 Tests he must be close to his final chance.\"He'll play, no worries,\" Langer said.\"This is his home ground, he's played a lot at the MCG.\"He hasn't made the runs he'd like to so far, but he dominates domestic cricket, he knows how to play. He's a fantastic bloke around the squad, he's got a good sense of humour, he brings good energy to the team, and we know he's a very good player.\"For him, and for us, we're hoping he plays well.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-22 22:53:03","full_description":"England will reportedly make as many as four changes to its side for the Boxing Day Test at the MCG, as the visitors' hopes of regaining the Ashes slip away. Already trailing 2-0 and needing to win all three remaining matches to regain the urn, Joe Root's side could look significantly different in Melbourne. The Evening Standard reports Zak Crawley, Jonny Bairstow , Mark Wood and Jack Leach are all being considered for the third Test. READ MORE: Gallen's generous act for two young boxers READ MORE: Fenech blasts ref as NRL player belted READ MORE: Garside's pro debut ends in controversy Crawley is likely to open the batting, although it's not clear who he would replace, given both Rory Burns (51 runs at an average of 12.75) and Haseeb Hameed (58 at 14.50) have struggled so far. It's been a horror year for England opening batters, who have recorded no less than 13 ducks in Test cricket in 2021. Burns has been out without scoring on six occasions, a record for an opener. Whether Crawley is the answer remains to be seen, given he hasn't played a first class match since September, and his 15 Test matches to date have seen him average just 28.34, a figure boosted substantially by his only century - 267 against Pakistan last year. Of the other changes, Bairstow is in contention to replace Ollie Pope in the middle order, while Wood and Leach would feature in a revamped bowling attack. Australian coach Justin Langer this morning confirmed under-pressure opener Marcus Harris would play at the MCG, despite a disappointing series so far. Harris has made just 38 runs in the two matches, and with an average of 22.19 from 12 Tests he must be close to his final chance. \"He'll play, no worries,\" Langer said. \"This is his home ground, he's played a lot at the MCG. \"He hasn't made the runs he'd like to so far, but he dominates domestic cricket, he knows how to play. He's a fantastic bloke around the squad, he's got a good sense of humour, he brings good energy to the team, and we know he's a very good player. \"For him, and for us, we're hoping he plays well.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400026/pickerimage.jpg","source_id":"nine"},{"title":"‘Too much power in one man’: Big mistake that caused England’s Ashes nightmare — UK view","link":"https://www.foxsports.com.au/cricket/the-ashes/ashes-2021-uk-view-chris-silverwood-joe-root-australia-vs-england-mike-atherton-boxing-day-test-mcg/news-story/e022f544a5fd4dfd1656c15b4c1c08ce","keywords":null,"creator":null,"video_url":null,"description":"Former England captain Mike Atherton believes Chris Silverwood may be charged with too much power and responsibility in English cricket and fears he may have lost the playing group.","content":null,"pubDate":"2021-12-22 22:38:00","full_description":"Former England captain Mike Atherton believes Chris Silverwood may be charged with too much power and responsibility in English cricket and fears he may have lost the playing group. Writing in his column for The Times , Atherton questioned whether the players believe Silverwood is the right man to lead England in all three international formats, Test, One Day and T20 cricket. “England have invested a lot of authority in one man,” Atherton wrote for The Times . Catch every moment of The Ashes live and ad-break free during play on Kayo. New to Kayo? Try 14-days free now . “Chris Silverwood has been given more power than any other England coach, taking account of his responsibilities across all three formats and for the selection as well as coaching of those teams. “It is, when you think about it, a remarkable concentration of power, one that is increasingly hard to see as justifiable.” Atherton suggested that Silverwood being in charge of all three England teams may not be having a positive effect on each of the formats individually as he tries to balance the playing talent and focus between the Test, One Day and T20 sides. “Under Silverwood, England have won one of their past 11 Tests, a run that began its downward trend in India, when the Test team was weakened at the altar of T20,” Atherton wrote. MORE CRICKET NEWS ASHES DAILY: Opener set for recall as one of four England changes; legend slams Root’s leadership ULTIMATE GUIDE: Aussies and England face selection dilemmas - Everything you need to know about the Boxing Day Test ‘LUCKIEST TEST BATSMAN IN HISTORY’: Crazy stat inflating magic Marnus’ batting reputation ‘ABSOLUTE STAR’: ‘Incredible’ Aussie 2023 Ashes team; Poms ‘100 miles away’ ‘INCREDIBLE’: Sixers survive scare as star enters Big Bash history books Chris Silverwood and Joe Root. Source: Getty Images “It continued through the summer, when the players involved with the Indian Premier League were indulged and allowed to miss the New Zealand series, through to the series with India, also lost, and the Ashes, which are one match away from being out of reach for another two years.” Atherton believes the lack of signs of improvement and progression are a worrying indictment on Silverwood’s ability as a coach, with particularly the side’s batting and fielding leaving a lot to be desired. “Throughout that time, it has been hard to discern any improvement in the team’s capacity to play good cricket,” Atherton wrote. “The batting has continued to underwhelm, with Joe Root carrying an intolerable burden as the best player in the team. Get all the latest cricket news, highlights and analysis delivered straight to your inbox with Fox Sports Sportmail. Sign up now!!! Scott Boland added to Australian squad | 03:21 “Not even the inherent advantages of the Dukes ball and English conditions helped camouflage the standard of batting or catching in the summer, both of which have continued to be highlighted as glaring weaknesses at the start of the Ashes.” England’s poor selection calls have been heavily criticised during the Ashes and Joe Root’s leadership has been called into question. The decision to leave James Anderson and Stuart Broad out of the side in Brisbane and to bat first in a seamer’s paradise was confounding. Just as playing five fast medium bowlers and no spinner in Adelaide left many pundits scratching their heads. “Selection and strategy have been questionable,” Atherton wrote. “Ed Smith was still the national selector during the winter months, when rest and rotation with a view to the Australia tour was implemented, but since Smith was removed from his post in April, that responsibility has fallen on Silverwood’s shoulders. Watch every game of the KFC Big Bash League Live & On-Demand on Kayo or catch up for FREE with minis on Kayo Freebies. Join Kayo Now > Richardson ready to play Boxing Day Test | 02:47 “Since then there has been a lack of coherence. Whether you agreed with him or not, Smith explained his choices rationally, intelligently and with conviction. “The misreading of pitch conditions and odd selections have presaged two awful performances in the opening Tests in Brisbane and Adelaide. “The old Eric Morecambe line about playing all the right notes in the wrong order springs to mind, given that the team selected for Brisbane was suitable for Adelaide and vice-versa. Except Silverwood doubled down after the second Test, insisting that he had not got things wrong. “We put out the best attack for those conditions,” he said.” Atherton pointed out that Silverwood has been big on trumpeting England’s willingness to learn from their mistakes, but he is yet to see that come to fruition. “Learning is a lifelong journey for all of us, for sure, but at some point supporters would like to hear a different message,” Atherton wrote. Scorchers post huge score to beat Gades | 03:36 “Like lessons that have been learnt and remedies applied. “Coaching, like captaincy, is partly about the message, because players have to feel that the coach (or captain) will have the magic ingredients to turn things around. “Silverwood’s job is to help get the team playing to its potential.” Which brought Atherton back to his original point that England may have bitten off more than they can chew by entrusting the fortunes of all thee England teams to one man and it could be the undoing of both the team and the coach. “The concentration of power and authority in a single figure was a strategic mistake by (England Managing Director) Ashley Giles,” Atherton wrote. “At a time when the amount and broad scope of international cricket demanded a more innovative approach, splitting the coaching roles between formats, for example, Giles moved in the opposite direction, loading responsibility for coaching, selection and strategic planning in the hands of one man. “Had coaching roles been split between formats; had selection remained under the aegis of a national selector, then responsibility right now would have been more diffuse. “Unfortunately, when things are going wrong, that’s what he will get. “Room for manoeuvre is evaporating quickly, and the next three Tests loom as critical for Giles, Root and, most of all, Silverwood.”","image_url":null,"source_id":"foxsports"},{"title":"England batters are forced to rewatch wickets in heated Ashes meeting - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8yMi9lbmdsYW5kLWJhdHNtZW4tZm9yY2VkLXRvLXJld2F0Y2gtd2lja2V0cy1pbi1wb3N0LWFkZWxhaWRlLWFzaGVzLWRlYnJpZWbSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"England batters are forced to rewatch wickets in heated Ashes meeting  The GuardianRoot’s global strength is his Australian weakness  Sydney Morning HeraldEngland talks up comeback after Second Test drubbing  InDailyAshes 2021: At two-nil down, England must be wondering how they got here in Test cricket series against Australia  7NEWSThe ‘absolute star’ in ‘incredible’ Aussie 2023 Ashes team; Poms ‘100 miles away’  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-22 19:26:00","image_url":null,"source_id":"google"},{"title":"Cricket-Pakistan&#039;s Abid undergoes second procedure after heart condition diagnosis","link":"https://www.thestar.com.my/sport/cricket/2021/12/23/cricket-pakistan039s-abid-undergoes-second-procedure-after-heart-condition-diagnosis","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Pakistan opener Abid Ali underwent a second procedure on Wednesday after he was diagnosed with acute coronary syndrome, the country's cricket board (PCB) said. Read full story","content":null,"pubDate":"2021-12-22 19:07:00","full_description":"(Reuters) - Pakistan opener Abid Ali underwent a second procedure on Wednesday after he was diagnosed with acute coronary syndrome, the country's cricket board (PCB) said. Acute coronary syndrome is associated with a sudden reduction or blockage of blood flow to the heart. Abid was diagnosed with the heart condition after he complained of chest pain during a domestic first-class match on Tuesday. \"Abid underwent a second procedure today. The procedure was successfully completed and he is recovering,\" the PCB said on Twitter. \"PCB medical team is liaising with Interventional Cardiologist regarding further treatment and rehabilitation. Abid is currently stable.\" The 34-year-old has played 16 test matches and six one-day internationals for Pakistan. (Reporting by Manasi Pathak in Bengaluru, editing by Pritha Sarkar)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/23/1417388.jpg","source_id":"thestar_my"},{"title":"Will Australian golf’s biggest events be played under lights in the future?","link":"https://www.theage.com.au/sport/golf/will-australian-golf-s-biggest-events-be-played-under-lights-in-the-future-20211222-p59jl7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Adam Pengilly"],"video_url":null,"description":"The man who helped drive Test cricket’s push for day-night Test matches wants Australian golf to consider shifting its thinking so big events can be played under lights.","content":null,"pubDate":"2021-12-22 18:00:00","full_description":"James Sutherland, one of the driving forces behind cricket’s push for day-night Test matches, wants golf to revive its ailing domestic season with a push towards twilight events. The Golf Australia chief executive has spoken about his vision for a reinvigorated summer circuit after another pink ball Ashes Test match, which has held massive appeal on television across the eastern seaboard. With the Australian Open cancelled for a second straight year and next month’s Australian PGA at Royal Queensland to be the biggest tournament held in the country for two years, Sutherland has opened up on his plans to shake up the local tour. It seems a lifetime ago Tiger Woods led the United States to a famous Presidents Cup win over the International side at Royal Melbourne in late 2019, the pandemic’s border closures grinding a plethora of topline competitive golf to a halt in Australia. But speaking during the release of golf’s national strategy through to the end of 2025, Sutherland said he wanted to explore the possibility of playing at least parts of some of the country’s domestic events under floodlights. “My feeling is we’ve always got to respect heritage and tradition, which include meaningful golf tournaments with trophies that are important, but we’ve also got to recognise that at the same time the reason we play these events is to make them attractive to the public and the golf fan in Australia,” he said. David Duval, Karrie Webb, Annika Sorenstam and Tiger Woods play golf under lights in 2001, and Golf Australia is thinking of experimenting with the idea again. Credit: Getty “There are opportunities to think more innovatively. I think generally speaking, a golf tournament with 72-hole strokeplay is not that appealing on its own week in, week out. To have a smattering of other more innovative events is an opportunity we can explore. “We’ve had day-night Test cricket in Adelaide and I think there are opportunities to shift golf into the evening. It might not be able to be 18 holes, but we could play an interesting format over three to four holes which could be knockout or skins making it more accessible for people to watch on TV, but also perhaps creating crowds in a floodlit environment. “The broadcasters know and understand the heritage around a major event like the Australian Open or a PGA Championship, but they also are willing to embrace to innovation and different formats into the evening. Those are the sort of ideas we’re tossing around.” Geoff Ogilvy and Mike Clayton’s Sandbelt Invitational being played across four of Melbourne’s best courses this week has drawn the likes of US PGA Tour winner Lucas Herbert and LPGA Tour regular Su Oh, a sign innovation can bring Australia’s best talent home. Matt Jones celebrates after holing a putt to win his second Australian Open in 2019, the last time the tournament has been played. Credit: Getty With Min Woo Lee cracking the world’s top 50 after a breakout year in Europe and Cam Davis also winning his first US PGA Tour event, Sutherland is optimistic a little lateral thinking can encourage the likes of Cameron Smith, Adam Scott, Marc Leishman, Jason Day, Hannah Green and Minjee Lee to return home to support the local circuit in future years. “My sense is that these players love to come home, they love being home and it’s an opportunity to see their family as well as give back to Australian golf,” Sutherland said. “I expect as we think about how we can provide better entertainment, and perhaps innovation and developments around some of our major events, their inclination will get stronger.” Night golf at an elite level has been tried in the US, with mixed results. Woods featured in a made-for-TV Monday Night Golf series between 1999 and 2005, which were match-play events and saw Woods competing under lights alongside some of golf’s biggest names. Ratings were strong initially but fell away, and the event was scrapped. Golf’s popularity has soared during various COVID-19 lockdowns, with a Golf Australia, PGA of Australia and WPGA Tour of Australasia strategy highlighting three million Australians hit a golf ball last year, but only 14 per cent were members of golf clubs. The report admitted the perception of golf as an exclusive and expensive sport without great diversity in its participation base – “an intimidating, exclusive, rules-bound game for rich old men” – was “matched to an extent in reality”. “We’ve got a captive market we can work more closely with, show them good experiences and improve their game,” Sutherland said. “There’s no doubt the pandemic has been kind to golf and for whatever reason people have found the golf course or golf activity as a safe, open air natural place. I think people have found it a therapeutic place to be. It’s the physical exercise that comes with golf. Distinct from other sports, golf is a sport you can play forever into your 90s.”","image_url":null,"source_id":"theage"},{"title":"Will Australian golf’s biggest events be played under lights in the future?","link":"https://www.smh.com.au/sport/golf/will-australian-golf-s-biggest-events-be-played-under-lights-in-the-future-20211222-p59jl7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Adam Pengilly"],"video_url":null,"description":"The man who helped drive Test cricket’s push for day-night Test matches wants Australian golf to consider shifting its thinking so big events can be played under lights.","content":null,"pubDate":"2021-12-22 18:00:00","full_description":"James Sutherland, one of the driving forces behind cricket’s push for day-night Test matches, wants golf to revive its ailing domestic season with a push towards twilight events. The Golf Australia chief executive has spoken about his vision for a reinvigorated summer circuit after another pink ball Ashes Test match, which has held massive appeal on television across the eastern seaboard. With the Australian Open cancelled for a second straight year and next month’s Australian PGA at Royal Queensland to be the biggest tournament held in the country for two years, Sutherland has opened up on his plans to shake up the local tour. It seems a lifetime ago Tiger Woods led the United States to a famous Presidents Cup win over the International side at Royal Melbourne in late 2019, the pandemic’s border closures grinding a plethora of topline competitive golf to a halt in Australia. But speaking during the release of golf’s national strategy through to the end of 2025, Sutherland said he wanted to explore the possibility of playing at least parts of some of the country’s domestic events under floodlights. “My feeling is we’ve always got to respect heritage and tradition, which include meaningful golf tournaments with trophies that are important, but we’ve also got to recognise that at the same time the reason we play these events is to make them attractive to the public and the golf fan in Australia,” he said. David Duval, Karrie Webb, Annika Sorenstam and Tiger Woods play golf under lights in 2001, and Golf Australia is thinking of experimenting with the idea again. Credit: Getty “There are opportunities to think more innovatively. I think generally speaking, a golf tournament with 72-hole strokeplay is not that appealing on its own week in, week out. To have a smattering of other more innovative events is an opportunity we can explore. “We’ve had day-night Test cricket in Adelaide and I think there are opportunities to shift golf into the evening. It might not be able to be 18 holes, but we could play an interesting format over three to four holes which could be knockout or skins making it more accessible for people to watch on TV, but also perhaps creating crowds in a floodlit environment. “The broadcasters know and understand the heritage around a major event like the Australian Open or a PGA Championship, but they also are willing to embrace to innovation and different formats into the evening. Those are the sort of ideas we’re tossing around.” Geoff Ogilvy and Mike Clayton’s Sandbelt Invitational being played across four of Melbourne’s best courses this week has drawn the likes of US PGA Tour winner Lucas Herbert and LPGA Tour regular Su Oh, a sign innovation can bring Australia’s best talent home. Matt Jones celebrates after holing a putt to win his second Australian Open in 2019, the last time the tournament has been played. Credit: Getty With Min Woo Lee cracking the world’s top 50 after a breakout year in Europe and Cam Davis also winning his first US PGA Tour event, Sutherland is optimistic a little lateral thinking can encourage the likes of Cameron Smith, Adam Scott, Marc Leishman, Jason Day, Hannah Green and Minjee Lee to return home to support the local circuit in future years. “My sense is that these players love to come home, they love being home and it’s an opportunity to see their family as well as give back to Australian golf,” Sutherland said. “I expect as we think about how we can provide better entertainment, and perhaps innovation and developments around some of our major events, their inclination will get stronger.” Night golf at an elite level has been tried in the US, with mixed results. Woods featured in a made-for-TV Monday Night Golf series between 1999 and 2005, which were match-play events and saw Woods competing under lights alongside some of golf’s biggest names. Ratings were strong initially but fell away, and the event was scrapped. Golf’s popularity has soared during various COVID-19 lockdowns, with a Golf Australia, PGA of Australia and WPGA Tour of Australasia strategy highlighting three million Australians hit a golf ball last year, but only 14 per cent were members of golf clubs. The report admitted the perception of golf as an exclusive and expensive sport without great diversity in its participation base – “an intimidating, exclusive, rules-bound game for rich old men” – was “matched to an extent in reality”. “We’ve got a captive market we can work more closely with, show them good experiences and improve their game,” Sutherland said. “There’s no doubt the pandemic has been kind to golf and for whatever reason people have found the golf course or golf activity as a safe, open air natural place. I think people have found it a therapeutic place to be. It’s the physical exercise that comes with golf. Distinct from other sports, golf is a sport you can play forever into your 90s.”","image_url":null,"source_id":"smh"},{"title":"Crudeli, Dallimore impress but WA Country XI bow out of WA Cricket Premier T20 competition in Perth","link":"https://thewest.com.au/news/albany-advertiser/crudeli-dallimore-impress-but-wa-country-xi-bow-out-of-wa-cricket-premier-t20-competition-in-perth--c-5035776","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"After two losses in their first two qualifying matches in group D on December 5, the WA Country XI needed to win both their round three games to progress to the final eight.","content":null,"pubDate":"2021-12-22 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5035776/06fe8a0d405b1b8c1e76b2f9911b147f203bf26a-16x9-x0y189w3641h2048.jpg","source_id":"thewest"},{"title":"Chance for the next wave of cricket stars to shine in third edition of Albany’s Southern Smash T20 event","link":"https://thewest.com.au/news/albany-advertiser/chance-for-the-next-wave-of-cricket-stars-to-shine-in-third-edition-of-albanys-southern-smash-t20-event--c-5050380","keywords":null,"creator":["Cameron Newbold"],"video_url":null,"description":"The event has grown so much in the space of just two years, from a coffee table idea to a fully fledged tournament with six teams.","content":null,"pubDate":"2021-12-22 18:00:00","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5050380/49a4cdd4e20248d287bc3608e636327383faa009-16x9-x0y270w5184h2916.jpg","source_id":"thewest"},{"title":"Will Australian golf’s biggest events be played under lights in the future?","link":"https://www.smh.com.au/sport/golf/will-australian-golf-s-biggest-events-be-played-under-lights-in-the-future-20211222-p59jl7.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Adam Pengilly"],"video_url":null,"description":"The man who helped drive Test cricket’s push for day-night Test matches wants Australian golf to consider shifting its thinking so big events can be played under lights.","content":null,"pubDate":"2021-12-22 18:00:00","full_description":"James Sutherland, one of the driving forces behind cricket’s push for day-night Test matches, wants golf to revive its ailing domestic season with a push towards twilight events. The Golf Australia chief executive has spoken about his vision for a reinvigorated summer circuit after another pink ball Ashes Test match, which has held massive appeal on television across the eastern seaboard. With the Australian Open cancelled for a second straight year and next month’s Australian PGA at Royal Queensland to be the biggest tournament held in the country for two years, Sutherland has opened up on his plans to shake up the local tour. It seems a lifetime ago Tiger Woods led the United States to a famous Presidents Cup win over the International side at Royal Melbourne in late 2019, the pandemic’s border closures grinding a plethora of topline competitive golf to a halt in Australia. But speaking during the release of golf’s national strategy through to the end of 2025, Sutherland said he wanted to explore the possibility of playing at least parts of some of the country’s domestic events under floodlights. “My feeling is we’ve always got to respect heritage and tradition, which include meaningful golf tournaments with trophies that are important, but we’ve also got to recognise that at the same time the reason we play these events is to make them attractive to the public and the golf fan in Australia,” he said. David Duval, Karrie Webb, Annika Sorenstam and Tiger Woods play golf under lights in 2001, and Golf Australia is thinking of experimenting with the idea again. Credit: Getty “There are opportunities to think more innovatively. I think generally speaking, a golf tournament with 72-hole strokeplay is not that appealing on its own week in, week out. To have a smattering of other more innovative events is an opportunity we can explore. “We’ve had day-night Test cricket in Adelaide and I think there are opportunities to shift golf into the evening. It might not be able to be 18 holes, but we could play an interesting format over three to four holes which could be knockout or skins making it more accessible for people to watch on TV, but also perhaps creating crowds in a floodlit environment. “The broadcasters know and understand the heritage around a major event like the Australian Open or a PGA Championship, but they also are willing to embrace to innovation and different formats into the evening. Those are the sort of ideas we’re tossing around.” Geoff Ogilvy and Mike Clayton’s Sandbelt Invitational being played across four of Melbourne’s best courses this week has drawn the likes of US PGA Tour winner Lucas Herbert and LPGA Tour regular Su Oh, a sign innovation can bring Australia’s best talent home. Matt Jones celebrates after holing a putt to win his second Australian Open in 2019, the last time the tournament has been played. Credit: Getty With Min Woo Lee cracking the world’s top 50 after a breakout year in Europe and Cam Davis also winning his first US PGA Tour event, Sutherland is optimistic a little lateral thinking can encourage the likes of Cameron Smith, Adam Scott, Marc Leishman, Jason Day, Hannah Green and Minjee Lee to return home to support the local circuit in future years. “My sense is that these players love to come home, they love being home and it’s an opportunity to see their family as well as give back to Australian golf,” Sutherland said. “I expect as we think about how we can provide better entertainment, and perhaps innovation and developments around some of our major events, their inclination will get stronger.” Night golf at an elite level has been tried in the US, with mixed results. Woods featured in a made-for-TV Monday Night Golf series between 1999 and 2005, which were match-play events and saw Woods competing under lights alongside some of golf’s biggest names. Ratings were strong initially but fell away, and the event was scrapped. Golf’s popularity has soared during various COVID-19 lockdowns, with a Golf Australia, PGA of Australia and WPGA Tour of Australasia strategy highlighting three million Australians hit a golf ball last year, but only 14 per cent were members of golf clubs. The report admitted the perception of golf as an exclusive and expensive sport without great diversity in its participation base – “an intimidating, exclusive, rules-bound game for rich old men” – was “matched to an extent in reality”. “We’ve got a captive market we can work more closely with, show them good experiences and improve their game,” Sutherland said. “There’s no doubt the pandemic has been kind to golf and for whatever reason people have found the golf course or golf activity as a safe, open air natural place. I think people have found it a therapeutic place to be. It’s the physical exercise that comes with golf. Distinct from other sports, golf is a sport you can play forever into your 90s.”","image_url":null,"source_id":"smh"},{"title":"Bangladesh tour of New Zealand 2022: Why is Ajaz Patel dropped for Test series vs Bangladesh?","link":"https://thesportsrush.com/cricket-news-bangladesh-tour-of-new-zealand-2022-why-is-ajaz-patel-dropped-for-test-series-vs-bangladesh/","keywords":["Cricket","Ajaz Patel","Bangladesh tour of New Zealand 2022","New Zealand vs Bangladesh"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Bangladesh tour of New Zealand 2022: Why is Ajaz Patel dropped from New Zealand Test squad for two-match series against Bangladesh? The New Zealand Cricket board have announced a 13-member squad for the two-match home Test series versus Bangladesh set to commence from January 1, 2022 at the Bay Oval Ground, Mount Maungnui. The Kiwi… The post Bangladesh tour of New Zealand 2022: Why is Ajaz Patel dropped for Test series vs Bangladesh? appeared first on The SportsRush.","content":"Bangladesh tour of New Zealand 2022: Why is Ajaz Patel dropped from New Zealand Test squad for two-match series against Bangladesh? The New Zealand Cricket board have announced a 13-member squad for the two-match home Test series versus Bangladesh set to commence from January 1, 2022 at the Bay Oval Ground, Mount Maungnui. The Kiwi regular skipper Kane Williamson has been ruled out of the home series owing to an elbow injury he had sustained before the second Test at Mumbai, during his team’s recently concluded tour to India. Tom Latham, who had captained the side in Williamson’s absence in the Mumbai Test, will for the first time lead the Kiwi national team for a full series. “It’s great to be back home and at venues we know well, and where we’ve had success in recent times. It’s obviously disappointing not to have Kane available for this series but, as we noted in India, he is undergoing a sustained period of rest followed by rehabilitation, strengthening and gradual batting loading. “We have every confidence in Tom leading the side – he’s done an excellent job in the past when called upon,” remarked New Zealand head coach Gary Stead. Bangladesh tour of New Zealand 2022: Why is Ajaz Patel dropped from New Zealand Test squad? The biggest news stemming from the Kiwi team selection unit is that left-arm spinner Ajaz Patel, who had scripted history by becoming only the third bowler to pick 10 wickets in an innings during the Mumbai Test, has been dropped from the squad. I have been privileged to see some incredible things from @BLACKCAPS in my 15 years of commentary and today is right up there. @AjazP That was special mate. #class #10fer #cricket #history #mumbai — Simon Doull (@Sdoull) December 4, 2021 “You do feel for Ajaz after his record-breaking display in India. However, we’ve always applied a horses-for-courses selection policy and believe the players selected best fit the way we want to take on Bangladesh here at home,” rearked Stead on Ajaz’s exclusion from the squad selected on Wednesday. As far as other names in the 13-member squad are concerned, Southpaw batter Devon Conway, who had smashed a ton in his maiden Test match at The Lord’s, has made a comeback to the squad after suffering from a hand injury during the semi-final encounter versus England in 2021 T20 World Cup in UAE. All-rounders Rachin Ravindra and Daryll Mitchell have been retained in the squad following their performances in India in the recently concluded tour. As far as the pacers are concerned, Trent Boult and Matt Henry make their return back to the squad as well. Squad: Tom Latham (c), Tom Blundell (wk), Trent Boult, Devon Conway, Matt Henry, Kyle Jamieson, Daryl Mitchell, Henry Nicholls, Rachin Ravindra, Tim Southee, Ross Taylor, Neil Wagner, Will Young. The first Test commences on January 1 at the Bay Oval, while the second match will be played at the Hagley Oval from January 9, 2022.       The post Bangladesh tour of New Zealand 2022: Why is Ajaz Patel dropped for Test series vs Bangladesh? appeared first on The SportsRush.","pubDate":"2021-12-22 17:36:30","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"“Ganguly had no business to speak on the matter”: Dilip Vengsarkar opines Sourav Ganguly shouldn’t have spoken on Virat Kolhi captaincy issue","link":"https://thesportsrush.com/ganguly-had-no-business-to-speak-on-the-matter-dilip-vengsarkar-opines-sourav-ganguly-shouldnt-have-spoken-on-virat-kolhi-captaincy-issue/","keywords":["Cricket","BCCI","Dilip Vengsarkar","Sourav Ganguly","Team India","Virat Kolhi"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Dilip Vengsarkar opines Sourav Ganguly had no business to speak on selection committee’s decision to remove Virat Kohli as India ODI captain. The Indian Cricket fans and experts have finally resorted to discussing Cricket after the BCCI, especially its president Sourav Ganguly had faced their backlash for quite a few days post the selection committee’s… The post “Ganguly had no business to speak on the matter”: Dilip Vengsarkar opines Sourav Ganguly shouldn’t have spoken on Virat Kolhi captaincy issue appeared first on The SportsRush.","content":"Dilip Vengsarkar opines Sourav Ganguly had no business to speak on selection committee’s decision to remove Virat Kohli as India ODI captain. The Indian Cricket fans and experts have finally resorted to discussing Cricket after the BCCI, especially its president Sourav Ganguly had faced their backlash for quite a few days post the selection committee’s announcement of team India’s Test squad for South Africa tour. While the discussions should have been around the possible reasoning of the committee’s decision on the selection of players, the headlines dominated around Rohit Sharma’s appointment as team India’s new ODI captain by the BCCI, without them not announcing the ODI squad for the 3-match series following the Test series. A day later, Ganguly comes up with the reasoning behind replacing Kohli as team’s 50-Over skipper, wherein he also mentioned that the BCCI had ‘requested’ him not to step down as T20I captain before the T20 World Cup this year. Around a week later, however, Kohli denies having been aware of any such request by Ganguly or BCCI, and in fact remarked that all the officials welcomed his decision as in the best interest of the team- a completely different version of what Ganguly had come up with. Since then, the Ganguly versus Kohli war on social media continued unabated, with the fans still seeking answers from the former on his version of the story. He, however, has decided to not aggravate the matter further by maintaining silence on the erupted controversy. #ViratVsBCCI: THE CONTROVERSY EXPLODES The President of #BCCI, #SouravGanguly refused to issue any kind of statement of his and the board’s ties with cricketer, #ViratKohli. Watch more pic.twitter.com/IjeT24HZIM — Mirror Now (@MirrorNow) December 16, 2021 Former India skipper and chairman of selectors Dilip Vengsarkar now, joins other former cricketers to have a say on the issue which has made a deep dent on BCCI’s image. Dilip Vengsarkar opines Sourav Ganguly had no business to speak Colonel Dilip Vengsarkar, while having his say on the entire aforementioned issue, remarked that Ganguly had no business speaking on the issue, as it was a decision taken by BCCI’s selection committee. In fact, it was the selection committee head-Chetan Sharma, who, as per him, should have been the man to be handed that responsibility. “The thing is that Ganguly had no business to speak on behalf of the selection committee. He is the BCCI president. Any issue about selection or captaincy, it’s the chairman of the selection committee Chetan Sharma, who should speak,” remarked Vengsarkar. Former Indian team skipper, Colonel Vengsarkar was also part of the 15-member Indian team squad which had won its maiden ICC World Cup title in 1983. He has played a total of 116 Tests and 129 ODIs in Indian colours.         The post “Ganguly had no business to speak on the matter”: Dilip Vengsarkar opines Sourav Ganguly shouldn’t have spoken on Virat Kolhi captaincy issue appeared first on The SportsRush.","pubDate":"2021-12-22 16:40:10","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Vivo IPL 2022 auction date: When and where is mega auction of IPL 2022?","link":"https://thesportsrush.com/cricket-news-vivo-ipl-2022-auction-date-when-and-where-is-mega-auction-of-ipl-2022/","keywords":["Cricket","IPL 2022","IPL 2022 mega auction"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Vivo IPL 2022 auction date: The mega auction for 15th season of the Indian Premier League would be the one to look out for in the new year. One of the most anticipated events in the world of Cricket to look out for next year is the Indian Premier League (IPL) mega auction for the… The post Vivo IPL 2022 auction date: When and where is mega auction of IPL 2022? appeared first on The SportsRush.","content":"Vivo IPL 2022 auction date: The mega auction for 15th season of the Indian Premier League would be the one to look out for in the new year. One of the most anticipated events in the world of Cricket to look out for next year is the Indian Premier League (IPL) mega auction for the 15th season. Given that the upcoming auction next year will in all likelihood be the final one of the lucrative league, adds more spice to the mouth-watering event. Moreover, with the addition of two more franchises to the already existing eight, the bidding war is expected to be more intense than ever. To brush up the readers’ memory, each of the 10 franchises would go into the mega auction with a purse limit of INR 90 Crore. The eight current franchises were allowed to retain a maximum of 4 players (maximum 3 Indians; maximum 2 overseas) from their previous season squad. Chennai Super Kings (CSK), Kolkata Knight Riders (KKR), Delhi Capitals (DC), and Mumbai Indians (MI) went on to retain 4 of their players, while Royal Challengers Bangalore (RCB), Sunrisers Hyderabad (SRH), and Rajasthan Royals (RR) retained 3 players each from their squad. Punjab Kings (PBKS), on the other hand retained only two of their players. The @ChennaiIPL retention list is out! Take a look! #VIVOIPLRetention pic.twitter.com/3uyOJeabb6 — IndianPremierLeague (@IPL) November 30, 2021 As far as the two new franchises- Lucknow and Ahmedabad are concerned, their deadline (December 25 initially) to draft in a maximum of 3 players into their squad is likely to get extended by couple of weeks further (as per reports); the reason being the Ahmedabad franchise is yet to receive the ‘letter of intent’ from the BCCI. Also, as per credible reports, both the new teams have decided upon those 3 players, which also includes their respective captains. Vivo IPL 2022 auction date: When and where will IPL 2022 auction take place? As per the latest report, the IPL 2022 mega auction is set to take place on February 7 and 8, 2022 at Bengaluru. The earlier tentative date was somewhere around the beginning of January, but the controversial issue pertaining the Ahmedabad-based franchise has meant that the auction date has been further pushed ahead to February. Vivo IPL 2022 auction date: live streaming details IPL 2022 Mega Auction Will begin at 3:30 PM IST and will be telecast on the Star Sports Network, with streaming platform Hotstar to take care of the online viewers. With Hotstar getting into an arrangement with Reliance Jio, Jio customers can watch IPL Auction 2022 for free on Jio TV.     The post Vivo IPL 2022 auction date: When and where is mega auction of IPL 2022? appeared first on The SportsRush.","pubDate":"2021-12-22 15:23:46","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"‘Pakistan’s reputation is a problem’: PCB CEO Faisal Hasnain makes BIG statement","link":"https://zeenews.india.com/cricket/pakistan-s-reputation-is-a-problem-pcb-ceo-faisal-hasnain-makes-big-statement-2421726.html","keywords":null,"creator":null,"video_url":null,"description":"Calling on the media to play a constructive role and partner the PCB in changing the negative perception about Pakistan, Hasnain said that cricket pitches also need to be improved in the country.","content":null,"pubDate":"2021-12-22 13:41:00","full_description":null,"image_url":null,"source_id":"zeenews"},{"title":"From substitute fielder to World No 1: Labuschagne's rise in Test cricket","link":"https://www.business-standard.com/article/sports/from-substitute-fielder-to-world-no-1-labuschagne-s-rise-in-test-cricket-121122201099_1.html","keywords":null,"creator":null,"video_url":null,"description":"In 2014, the then 20-year-old Marnus Labuschagne had a first taste of Test cricket as a substitute fielder at the Gabba during the Border-Gavaskar series Down Under","content":null,"pubDate":"2021-12-22 13:21:00","full_description":"In 2014, the then 20-year-old Marnus Labuschagne had a first taste of Test cricket as a substitute fielder at the Gabba during the Border-Gavaskar series Down Under. And it took almost four years for him to get a place in the Australian Test squad as a specialist batter. The starting was not impressive as he would have liked, but following the initial hiccups, the stylish batter never looked back and continues to impress cricket fanatics around the globe. He has also gained the trust of Cricket Australia's think tanks in a short span of time. On Wednesday, Labuschagne climbed to the top of the ICC Test batting rankings. Three years on from making his debut, Labuschagne has smashed six centuries and 12 fifties across his first 20 Tests, garnering him an average of 62.14. Among batters to have played at least 20 Test innings, only the incomparable Don Bradman (99.94) averaged more. Labuschagne made his Test debut in Dubai against Pakistan in October, 2018. He had a forgettable match with the bat, falling for a second-ball duck in the first innings and out for 13 in the second. He did, however, pick up a wicket in each of Pakistan's innings, as well as running out Babar Azam. He gave a better account of himself in the second Test, making scores of 25 and 43. A chance in Border-Gavaskar series Labuschagne's next taste of Test cricket saw him selected at first drop for the first time by Australia.Left out of the side for the first three matches of the Border-Gavaskar series, the Queenslander was turned to for the Sydney Test with Australia trailing the series 2-1. The promotion to No 3 came somewhat out of the blue. Given Australia has typically seen the position as the most important in a Test batting order, it was a surprise to see them entrust the role with a man averaging a commendable but not breathtaking average of 33.17, as per icc-cricket.com. He made 38 in his lone innings of the rain-affected match and was retained for Australia's next two Tests for the summer, making scores of 81 and 6. The concussion super-sub Labuschagne's first four Tests came in a period where Australia were without the services of their two best batters - David Warner and Steve Smith. Upon their return, he found himself out of the XI again but still retained in the Ashes squad. It was in Smith's absence that Labuschagne returned to the side and he has not looked back since. Returning to Australia duty as a concussion substitute for Smith in Australia's second innings of the second Ashes Test, the right-hander made a fighting 59 that helped secure an important draw at Lord's. Reaping the benefits of a revamped technique procured during a stint in county cricket, Labuschagne was a batter transformed, finishing the series with four half-centuries and a campaign average of 50.42. Dominant Down Under During the Ashes, there had been signs of how special a batter Labuschagne might just be. In the 2019/20 summer down under, his potential came to fruition as he dominated all comers. In the opening Test of the summer, at the Gabba, he notched his maiden Test ton, scoring 185 runs off 279 balls. He backed that up with 162 in the Adelaide Oval day-nighter to finish the two-match series against Pakistan with an average of 347 for the campaign. He made it three centuries in three consecutive innings with his 143 against New Zealand and after going two Tests without a ton - he did manage two fifties - he made up for lost time by making his first double-century. His numbers for the season were 896 runs at 112 with four centuries and three fifties. Having averaged 20.25 going into 2019, by early January 2020 his average had climbed to 63.43. Resolute against India A surprise selection at No 3 last time the two teams met, Labuschagne was a bonafide star of the Australian team when they took on India in 2020/21. Virat Kohli and Ajinkya Rahane's team managed what few have in recent times, keeping the prodigious talent quiet through the early stages of the series. At Adelaide Oval he scored a scratchy, but important, 47 and a less important 6, before scores of 48 and 28 as the Aussies went down at the MCG. He came back with a vengeance in the second half of the series, notching 91 and 73 in a thrilling match at the SCG before scoring his lone ton for the summer in an even more incredible match at the Gabba. Unfortunately for Australia, neither match ended in victory for them as India took out the series 2-1. Starring against England in Ashes It was against England that Labuschagne first showed signs of the player he would become, and fittingly it is against England that he has completed his climb to the top of the ICC Test batting rankings. The 27-year-old started his campaign with a dashing 74 at the Gabba, following it up with a first-innings ton at Adelaide Oval and a second-innings 51 to secure Player of the Match honours in the second Ashes Test. It was the first century of Labuschagne's Ashes career and sixth in Tests overall. --IANS avn/cs (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211222/thumb-121122201099.jpg","source_id":"business-standard"},{"title":"PCB chairman Ramiz Raja reacts to Yasir Shah FIR: 'Such headlines are not good for Pakistan cricket'","link":"https://www.indiatoday.in/sports/cricket/story/pcb-chairman-ramiz-raja-breaks-silence-on-yasir-shah-fir-in-rape-molestation-case-pakistan-cricket-1890920-2021-12-22?utm_source=rss","keywords":null,"creator":null,"video_url":null,"description":"Yasir Shah FIR: Such headlines are not good for Pakistan cricket, says Ramiz Raja","content":null,"pubDate":"2021-12-22 13:18:32","full_description":"Pakistan Cricket Board (PCB) chairman Ramiz Raja broke his silence on the FIR registered against Yasir Shah and released an official statement in a press conference on Wednesday. Pakistan leg-spinner Yasir Shah has been booked for aiding his friend to kidnap, molest and threaten a girl. The FIR was registered at the Shalimar police station in Lahore after the girl lodged a complaint. The girl has alleged that Yasir Shah’s friend, Farhan, kidnapped her on gunpoint, raped her, made videos of her and later made threats to her. The girl has alleged that Yasir Shah helped his friend and later with Farhan threatened her that if she raised any voice they would release her videos. Reacting to the news, former captain Raja said that this controversy won't be good for Pakistan cricket. \"It is a no brainer, Yasir is a circuit player and while we train and educate these players they are in ambassadorial positions and should know with whom and where to socialise,\" Ramiz said at a press conference on Wednesday. The FIR states that when the couple approached Yasir for help but he made fun of the entire incident, gave life threats to them and their niece and said he would use his influence to drag them into legal battles. Yasir and his friend, Farhan have gone incommunicado and are still being searched by Lahore police in the case. \"I don't know what is the truth in this case but it is a fact that such headlines are not good for Pakistan cricket and specially at a time when there is a feel good factor going through Pakistan Cricket now.\" He said that all contracted players, including Yasir, were regularly reminded of their responsibilities as ambassadors and how to behave in public. \"It is a no-brainer that they must know with whom or when to socialise. I want these players to be earning well but they also have responsibilities towards Pakistan cricket and the sport,\" Ramiz said. Yasir Shah, who has played 46 Tests and 25 ODIs for Pakistan, didn’t travel to Bangladesh for the recent Test series as he is nursing a finger injury. (With PTI inputs) Live TV Also Read | Lahore police register FIR against Yasir Shah for helping friend who kidnapped a girl","image_url":null,"source_id":"indiatoday"},{"title":"Recent Match Report - Scorchers vs Renegades 17th Match 2021/22 - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3Nlcmllcy9iaWctYmFzaC1sZWFndWUtMjAyMS0yMi0xMjY5NjM3L21lbGJvdXJuZS1yZW5lZ2FkZXMtdnMtcGVydGgtc2NvcmNoZXJzLTE3dGgtbWF0Y2gtMTI2OTY1NC9tYXRjaC1yZXBvcnTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Recent Match Report - Scorchers vs Renegades 17th Match 2021/22  ESPNcricinfo‘Extraordinary’ Marsh keeps Scorchers undefeated despite epic Finch-led chase down  Fox SportsRuthless Marsh upstages spectacular Finch return | cricket.com.au  cricket.com.auHits & Misses: Perth Scorchers, Melbourne Renegades set new records, DRS debate rages  The West AustralianScorchers post huge score to beat Gades  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-22 13:08:40","image_url":null,"source_id":"google"},{"title":"Eddie Jones: ‘I thought everyone should be as obsessive as I was’","link":"https://www.theguardian.com/sport/2021/dec/22/rugby-union-eddie-jones-when-i-started-i-thought-everyone-should-be-as-obsessive-as-i-was","keywords":["Eddie Jones","England rugby union team","Rugby union","Sport"],"creator":["Exclusive by Andy Bull"],"video_url":null,"description":"The England head coach believes he is still maturing in the role at the age of 61, as he explains in Leadership, his new bookEddie Jones laughs when I ask him if he’s ever tried therapy. Turns out I’m not the only one who has suggested it. Jones recently hired a forensic psychiatrist to work with his coaching team on their communication skills. “I don’t have therapy with her,” he says, “but I think sometimes she thinks I should.”I’m surprised he hasn’t tried. Jones’ new book, Leadership, shows how he roams through conversations with football, cricket, basketball and Australian rules football coaches, multinational CEOs, investment bankers, acting coaches, and school teachers looking for every last little nugget that might make him a better coach. Jones is restlessly obsessive about it. If the book has a single line that seems to sum him up, it’s this: “The only reliable advantage we’ve got in life, in business or sport, is to learn faster than the opposition.” He spends a lot of time trying to find the edge that will help him do exactly that. Continue reading...","content":null,"pubDate":"2021-12-22 13:00:27","full_description":"E ddie Jones laughs when I ask him if he’s ever tried therapy. Turns out I’m not the only one who has suggested it. Jones recently hired a forensic psychiatrist to work with his coaching team on their communication skills. “I don’t have therapy with her,” he says, “but I think sometimes she thinks I should.” I’m surprised he hasn’t tried. Jones’ new book, Leadership, shows how he roams through conversations with football, cricket, basketball and Australian rules football coaches, multinational CEOs, investment bankers, acting coaches, and school teachers looking for every last little nugget that might make him a better coach. Jones is restlessly obsessive about it. If the book has a single line that seems to sum him up, it’s this: “The only reliable advantage we’ve got in life, in business or sport, is to learn faster than the opposition.” He spends a lot of time trying to find the edge that will help him do exactly that. Jones sits down to start work at 5am each morning. It has, he says, been a long time since he got his eight hours of decent sleep. “I normally get four or five, then, maybe, have a nap later in the day.” But early morning “is the best time of the day for thinking, mate, you’re uninterrupted, you don’t have things buzzing, or clicking”. Unless you’re working for him. Then you can expect to get dawn emails and WhatsApp messages. “Have a look at this? What do you think?” He says he’s got better at this. He doesn’t expect immediate responses anymore. “In the old days I used to go around putting notes under people’s doors. “That’s a thing I’ve got to understand,” Jones goes on to say. “When I first started coaching I thought everyone should be as driven, and as obsessive, as I was. Now I understand that people have their own rhythms.” Not everyone who’s worked with him will agree. England have churned through a lot of assistant coaches and support staff since Jones took over . He sounds like an exacting boss. One former employee, who moved on from his job in Jones’ first year, once described it as like working for Napoleon, only, he guessed, with more swearing. In Leadership, Jones mentions a lot of other coaches. He is good friends with Ange Postecoglou and Brian Goorjian, has regular conversations with Gareth Southgate, David Moyes and Dave Brailsford. It’s interesting that he doesn’t mention Trevor Bayliss since he and Jones took over English national teams at the same time, and in similar circumstances. They are similar ages and from the same part of the world, New South Wales. They even used to play Grade cricket against each other in the 1980s. “We caught up three or four times during his tenure,” says Jones, who already knows where I’m going with the question. For all their similarities, he and Bayliss couldn’t be more different in their approaches to coaching. Bayliss was so laid back as England head coach that when he left the post the English press gave him a Yucca plant, a scented candle and a CD of ambient music. “Trevor was one of those guys who sat back and smelled the environment, and then gave it whatever he thought it needed,” Jones says. The reason it worked so well, he reckons, was because of Bayliss’s partnership with his assistant, Paul Farbrace. “They were a great combination. Farbrace was energetic and direct with the team, while Trevor sat back and created a good environment.” So does Jones have a sidekick to work with? He goes back to Steve Borthwick. “He was a great right-hand man.” But Borthwick left England last year . “Recently?” he says, “the last four or five years, I’ve been lucky to have Neil Craig.” Craig is interesting. He is the Rugby Football Union’s head of high performance, has a background in Aussie Rules and cycling. By his own admission, he doesn’t know a whole lot about rugby. In the book Jones says Craig’s role is “to tell the truth and also to help me coach the coaches”. Craig is the one who pulls Jones up on his behaviour. “Sometimes we’ll finish a meeting and he’ll say: ‘Maybe you went a bit hard there.’ And I listen to him, and I take advice from him.” At 61, Jones says, he’s still maturing as a coach. “And he’s helped me no end.” There is a fascinating little video interview with Matt Giteau on YouTube in which he talks about how Eddie is “still someone that scares me” 15 years after they last worked together. He talks about him with a mix of love, loyalty, fear and respect. Back when Jones was coaching Japan, he used to wonder why some of the players were so reluctant to speak up in meetings. It was only later that he realised, and after the team psychologist pointed it out, that it was because they were intimidated by him. If Jones has softened since, he’s still hard enough. If you want to understand Jones, the way he works, and why he succeeds, you need to know where he comes from. He believes that himself. Listen to him describe the differences between him and Bayliss: “He was a country boy and I was from the city. He’s laconic and I’m much more aggressive. I want to run the show.” So how does Jones’ own upbringing shape him? “Mine’s probably pretty obvious. I was half-Japanese, half-Australian in a white Australian society where, if you weren’t good at sport, you weren’t considered to be worthy of the group, and I wanted to be part of the group,” he says. “I was little, and I looked different, but I wanted to be good at sport, so I had to find a way. I didn’t have any athletic gifts, so I became a competitor. I fought.” He is still fighting to prove himself now. It’s one of the reasons he took on the England job, and why he’s still tickled, six years later, by the idea of an Australian running the England team. “I think it is bloody fascinating, because this is the home of rugby and Australia is, or at least was, seen as an outpost.” It’s also why Jones says his favourite moments in coaching are the ones “when everyone thinks you’re an idiot, everyone thinks they know better than you”. It’s an interesting way of putting it. I’m not sure anyone who’s ever spoken to Jones would describe him as an idiot. “But we’re involved in something that everyone thinks they know,” he says. “One of the great examples, we had Roy Hodgson in the last Six Nations. He’s 74, he came into dinner and his first statement was: ‘Boys I’m still trying to work out what a good coach is.’ And I think that’s so true. Everyone thinks they know, but the people who are really involved in this business, we know that we don’t. And I think that keeps driving me.” That, and the feeling he gets in those last few moments before kick-off. “That’s the elixir, that bit where you’re never quite sure what’s going to happen, it is the thing that keeps you in it.” He had it again before England played South Africa in the autumn . “We’ve got four young blokes on the bus and they don’t know what the game is going to be like, we’ve prepared, we’ve talked to them, the senior players have talked to them, but you actually don’t know how they’re going to handle it.” He is addicted to the bit that’s still beyond his control. T he book comes at an interesting time, after England finished fifth in the Six Nations. Jones has been preoccupied with figuring out what went wrong and how to put it right. His answer is characteristic. He thinks some of his squad started to feel entitled. It happens, he says. “You take over a team when they’re not doing well. You come in, you’ve got this great energy, and you find the other people who have the sort of same energy, same desire, same mentality, and if you say the right things, and get the right picture in their heads, then you create a winning team. And as soon as you win – and this has happened in every team I’ve had – then people don’t want to work as hard.” So the process starts again. Only second time around it’s harder “because you’ve got to get rid of those same players who have been successful for you. And they’re still really good players, but they don’t have that same mentality, that fight.” Jones dropped a number of senior players – George Ford, Mako and Billy Vunipola – from his squad for the autumn internationals. Will he pick them again? “We’ll just wait and see. Again, it’s about their mentality, if they want to keep improving, want to keep getting better, and are prepared to do those hard yards. They are the things we need to see.” Entitlement isn’t just an English problem, he says, “but I think maybe there are factors here that exacerbate it. If you’re an England rugby player here and you play a couple of Tests you’ll never have to worry about playing top-level rugby again. There’s 13 professional teams so you can find a spot somewhere and keep playing.” The great teams are the ones who keep winning year after year. “It’s rare because teams get comfortable. They want to settle. That’s the hardest thing to keep driving.” Jones believes conflict is healthy. “I think I understand that it’s the only way you keep winning,” he says. “Because whenever you’re comfortable, everyone wants to take a short cut, don’t they?” Again he goes back to his past. “My father left school when he was 15 to work in a coal mine, so I’ve had a much easier life than he’s had, and my daughter has had a much easier life than I’ve had. Every life gets easier, that’s how it is, because we want life to be comfortable. But to achieve things that take effort outside of that is uncomfortable.” Jones is always looking for the balance between supporting his players and staff, and challenging them, between making them feel at ease, and making them feel on edge. I know from my own small experience of his charity work that Jones can also be tremendously kind, and thoughtful. One of the solutions to England’s entitlement problem, Jones says, was to change the leadership group, but he has stayed loyal to his captain, Owen Farrell, who he describes as a “glue player” in the squad. Jones says he had to change to the leadership group because of the salary-cap scandal at Saracens . What he’s trying to do now is build a smaller and more diverse leadership team but create more leadership in the squad outside that group, too. “It’s almost like rugby used to be,” he says, “you had a group of leaders, the captain, and vice-captain, but basically most of the leadership was done by the team. And that’s where I see ourselves evolving.” Jones has a soft spot for players who he feels have similar backgrounds to his own. “I like the guys that have come up the tougher way, who maybe don’t fit the stereotype, who have got to keep battling, have got to keep proving themselves, because they’re the loyal players. They’re doing it because they want to be good, not for someone else.” And of course he sees some of that in Farrell. The book makes it clear he’s invested in him as a captain, but also that he has room for improvement. He describes Farrell as a “developing” captain, even though he’s already led England in 34 Tests, and says he needs to get better at managing relationships with referees. “When you grow up in a tough environment those softer skills aren’t so appreciated, so you don’t tend to develop them. I think the big thing that’s changed in society and in sport is the way you talk to people. That ability to be robust but also to be empathetic is so important in today’s society.” Can you teach empathy? “You can learn it, definitely,” Jones replies. And here he is talking from experience. “The one thing we know is that unless as coaches we model that it is going to be hard for the players to have it. There’s no doubt it’s such a more important skill to have now, whether you call it emotional intelligence, or empathy, you need to have it, you can’t be that blunt bloke who comes in and doesn’t worry about people’s feelings, that just doesn’t work. You need to learn to be in other people’s shoes, and to understand what they’re thinking much more. You can definitely learn that. “But I don’t know whether I’m a good teacher of it or not mate.” And he cackles again. Leadership by Eddie Jones is out now (Pan Macmillan, £20), and was co-written with the Guardian’s Donald McRae.","image_url":"https://i.guim.co.uk/img/media/420754dce5e290a637746adbeee4b7b00b4013a8/0_133_4000_2400/master/4000.jpg?width=460&quality=85&auto=format&fit=max&s=9a9a81c9405fde12916345e9a16b661d","source_id":"theguardian"},{"title":"Would See Negative Headlines About Pakistan On ICC Notice Boards: PCB CEO","link":"https://sports.ndtv.com/cricket/i-would-see-negative-headlines-about-pakistan-on-icc-notice-boards-pcbs-ceo-2665453","keywords":null,"creator":null,"video_url":null,"description":"\"Pakistan's perception is not good. I can be very honest about it; I've worked in the ICC and with Zimbabwe cricket, so I know the discussions which take place in the corridors about Pakistan cricket....","content":null,"pubDate":"2021-12-22 11:49:23","full_description":"Pakistan Cricket Board's (PCB) new CEO Faisal Hasnain has revealed that \"largely negative\" reports and \"headlines\" on the country would be put up on ICC notice boards, saying its perception and reputation is a problem. This is affecting not just the country's cricket but also trade and tourism, Hasnain, who has earlier worked as the ICC's chief financial officer, added. \"Pakistan's perception is not good. I can be very honest about it; I've worked in the ICC and with Zimbabwe cricket, so I know the discussions which take place in the corridors about Pakistan cricket. Pakistan's perception and reputation is a problem,\" said Hasnain on Wednesday. The \"not good\" reputation makes it difficult for the country to invite top international cricket team. No team toured Pakistan for over a decade since the 2009 terrorist attack on the Sri Lankan team bus in Lahore. \"I would see negative headlines or stories about Pakistan being put up on notice boards in the ICC offices,\" he recalled. Calling on the media to play a constructive role and partner the PCB in changing the negative perception about Pakistan, Hasnain said that cricket pitches also need to be improved in the country. \"The perception now is that if you go to Pakistan you are like virtually in room for a month, you can't go out, the pitches are dead etc etc and this impacts the mindset of international players. My job is to change this perception internationally.\" Hasnain addressed the media with PCB chairman, Ramiz Raja, after the Board of Governors (BoG) meeting. Talking about the lukewarm response during the recent Pakistan versus West Indies T20I series in Karachi, he said a lot had to be done to make life easier for fans. \"Cricket is a services industry where we are trying to sell a product and properties. We had a disappointing response from the crowd for the West Indies series but we don't think about fans emotionally. I have witnessed this as a commentator. \"I realize we need to work a lot to make life easier for fans. Make it a great viewing experience for spectators. That is why the BOG has approved setting up a fans engagement department.\" Lack of star players in the touring sides does have an impact. Promoted \"Plus the security, long distances, tickets etc are all problems for people which we have to make easier for them.\" Raja also felt that after what happened with the New Zealand and England teams (when they pulled out of Pakistan tour citing security concerns earlier this year), pressure has been created on touring sides and that they will now think twice before withdrawing from tours. (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2020-06/ekaj37dc_pakistan-cricket-board-pcb-logo-twitter_625x300_27_June_20.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"IND vs SA: Indian players get 'Team headshot' done ahead of first Test, Check pictures HERE","link":"https://zeenews.india.com/cricket/ind-vs-sa-indian-players-get-team-headshot-done-ahead-of-first-test-check-pictures-here-2421643.html","keywords":null,"creator":null,"video_url":null,"description":"The Indian cricket team did the customary 'team headshots' in Johannesburg, signalling their intent as they go into the three-Test series, scheduled to commence on Boxing Day (December 26), full of confidence.","content":null,"pubDate":"2021-12-22 11:49:00","full_description":"The Board of Control for Cricket in India (BCCI) posted a short video on Wednesday (December 22) of the cricketers getting their 'headshots', with players trooping in one after the other to get their profiles clicked by a photographer in personal protective equipment (PPE). The BCCI tweeted, \"Team Headshots done. Just a few sleeps away from the first Test. We cannot wait.\" Team Headshots done. Just a few sleeps away from the first Test. We cannot wait. #TeamIndia | #SAvIND pic.twitter.com/cVBjTmThXl — BCCI (@BCCI) December 22, 2021 Skipper Virat Kohli, No. 18, was the first to go for the 'headshots', followed by KL Rahul, wicketkeeper-batter Rishabh Pant, Mohd Shami, Jasprit Bumrah, Ishant Sharma, Ajinkya Rahane, Hanuma Vihari, Cheteshwar Pujara, Shardul Thakur, Mohd Siraj, Mayank Agarwal, Shreyas Iyer, Wriddhiman Saha and Ravichandran Ashwin, among others.\" Shami also posted his 'headshots' on his Twitter handle and wrote, \"Headshot #mshami11\". Headshot #mshami11 pic.twitter.com/vHmA38arHM — Mohammad Shami (@MdShami11) December 21, 2021 Both teams are gearing up for the Test with India head coach Rahul Dravid stressing on \"quality practice\" and \"good intensity\", even as the hosts suffered a massive blow on Tuesday as their pace bowler Anrich Nortje was ruled out of the Test series due to a \"persistent\" hip injury. The CSA also said that no replacement would be brought in for Nortje, who has been South Africa's premier fast bowler across formats in recent times. The International Cricket Council (ICC) posted images on Wednesday of the South African team practice session and tweeted, \"Preparations are in full swing in the South Africa camp for the exciting Boxing Day Test against India.\" India have never won a Test series in South Africa, something skipper Kohli would want to change this time around.","image_url":null,"source_id":"zeenews"},{"title":"Ruthless Marsh upstages spectacular Finch return | cricket.com.au - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL21hdGNoLXJlcG9ydC9wZXJ0aC1zY29yY2hlcnMteHh4LW1lbGJvdXJuZS1yZW5lZ2FkZXMtbWF0Y2gtcmVwb3J0LWJibDExLW1hcnZlbC1zdGFkaXVtLW1hcnNoLWZpbmNoLW1hZGRpbnNvbi8yMDIxLTEyLTIy0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ruthless Marsh upstages spectacular Finch return | cricket.com.au  cricket.com.au‘Extraordinary’ Marsh keeps Scorchers undefeated despite epic Finch-led chase down  Fox SportsScorchers taking BBL road stint in stride  7NEWSSelf-belief driving Mitch Marsh’s career-defining patch for Australia and Perth Scorchers  The West AustralianScorchers unfazed by extended BBL|11 road trip | cricket.com.au  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2021-12-22 11:48:15","image_url":null,"source_id":"google"},{"title":"Pakistan Cricket Board Chief Reacts To Allegations Against Yasir Shah","link":"https://sports.ndtv.com/cricket/such-headlines-are-not-good-for-pakistan-cricket-ramiz-raja-on-allegations-against-yasir-shah-2665274","keywords":null,"creator":null,"video_url":null,"description":"\"It is a no brainer, Yasir is a circuit player and while we train and educate these players they are in ambassadorial positions and should know with whom and where to socialise,\" Ramiz said at a press...","content":null,"pubDate":"2021-12-22 10:54:11","full_description":"Pakistan Cricket Board chief Ramiz Raja on Wednesday conceded that leg-spinner Yasir Shah being accused of aiding an alleged sexual assaulter is \"not good\" for the game here given that players are regularly counselled on their \"ambassadorial\" roles. Yasir was named in an FIR filed by a couple at Islamabad's Shalimar police station two days back in which they have alleged that the cricketer aided his friend while knowing he had raped and made compromising videos of their 14-year old niece. \"It is a no brainer, Yasir is a circuit player and while we train and educate these players they are in ambassadorial positions and should know with whom and where to socialise,\" Ramiz said at a press conference on Wednesday. The FIR states that when the couple approached Yasir for help but he made fun of the entire incident, gave life threats to them and their niece and said he would use his influence to drag them into legal battles. Yasir and his friend, Farhan have gone incommunicado and are still being searched by the police in the case. \"I don't know what is the truth in this case but it is a fact that such headlines are not good for Pakistan cricket and specially at a time when there is a feel good factor going through Pakistan Cricket now,\" the PCB Chairman said. He said that all contracted players, including Yasir, were regularly reminded of their responsibilities as ambassadors and how to behave in public. \"It is a no-brainer that they must know with whom or when to socialise,\" Ramiz said. Yasir has played 46 Tests and 25 ODIs for Pakistan but missed the recent tour to Bangladesh because of a finger injury. Ramiz said he had increased remuneration of players soon after taking over as Chairman in September because he wanted all players to be financially secure. Promoted \"I want these players to be earning well but they also have responsibilities towards Pakistan cricket and the sport.\" (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)","image_url":"https://c.ndtvimg.com/2021-11/mhp13ovg_ramiz-raja-afp_625x300_16_November_21.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv"},{"title":"England already have a mountain to climb to prevent an Ashes whitewash after back-to-back defeats vs Australia","link":"https://metro.co.uk/2021/12/22/england-already-have-a-mountain-to-climb-to-prevent-an-ashes-whitewash-15807609/","keywords":["Cricket","Australia cricket","England cricket","Joe Root","Metro newspaper","The Ashes"],"creator":["Derek Pringle"],"video_url":null,"description":"Not the start they wanted.","content":"Joe Root’s side already have a mountain to climb in the series (Picture: Getty) Unless the private reality is different from the public pronouncements made by their captain Joe Root, England’s cricketers are, to revive an old quote about them by former Aussie fast bowler, Jeff Thomson, ‘on a rollercoaster to the s***house’ — a place for ablution in Australia but not absolution. Two down with three to go, England need to win all remaining Tests to regain the Ashes, a task theoretical at best given they have won none of their last 12 in Australia. If that is the positive view ahead of the Boxing Day Test in Melbourne, the way these things normally pan out, as the recriminations and soul-searching mount, is that they will do well to avoid a whitewash. Playing the Aussies on their home turf has always been tough. Realism is required which is why Root’s post-match claim that he doesn’t think Australia are much better than England in the conditions is an insult, even to the gullible. Perhaps captains have to say things like that in public but the bald facts are England’s Brains’ Trust identified the pink-ball Test in Adelaide as their best opportunity to win, and tailored their entire strategy around it. Those chances were further boosted when Australia lost captain Pat Cummins, and fast bowler Josh Hazlewood before the match. And yet defeat still occurred for England, by 275 runs, which makes one hate to think what might happen when the Brains’ Trust don’t see things so favourably. Australia won the second Test without their two star bowlers Pat Cummins and Josh Hazlewood (Getty) So what went wrong? The simple answer is that England, for the umpteenth time, did not score enough runs in their first innings, 236 barely winning you a T20 game these days let alone a five-day Test. Nothing new there. In fact it’s been happening for a while and but for Root’s extraordinary year with the bat, in which he has made 1,630 runs at 62.7, and the excellence of England’s bowlers, at least in home conditions, results over the past 18 months would have been a lot worse. So far, the batting failings in Australia have been due to a lack of discipline and judgement, with the odd technical glitch thrown in. Rory Burns has a lot of moving parts in his trigger movements but so too does Steve Smith, Australia’s acting captain in Adelaide. The difference is Smith knows what bowling lines to play and which to leave, something Burns has yet to master though he looked more adept in the second innings in Adelaide. This is crucial. Batsmen have to know where off-stump is and play only at those balls no more than a bat’s width outside it, at least until set. Rory Burns has struggled with the bat so far this series (Picture: Getty) If you can get a start in Australia, and maintain concentration thereafter, it offers the best batting conditions around as the Kookaburra ball does very little except for spinners like Nathan Lyon, who give the ball a rip. But you need to be patient as Aussie bowlers are the personification of discipline, something Jos Buttler managed to be in his second innings where he sheathed his usual attacking instincts to graft a funereal 26 off 207 balls. Some, Sir Alastair Cook among them, got very excited saying the knock, which ended when Buttler trod on his stumps, would be the making of him as a Test batsman. Hopefully it will be as Buttler has a rare talent for ball-striking, yet they seem to be forgetting that had Alex Carey, his opposite number, not inexplicably waved through the straightforward edge Buttler gave off Mitchell Starc, the England keeper would have chalked up his second duck of the game. As it is, instead of him carrying the drinks next week, everyone will be intrigued to see how ‘Blocker Buttler’ goes at the MCG, possibly promoted to No.6 in place of Ollie Pope with Jonny Bairstow, perhaps taking the wicketkeeper’s gloves off him, at seven. Changes are usually what defeat brings in Ashes series, where the stakes are hyped to the max. But can England risk making any for the third Test given the replacements have had nothing but net practice to prepare them? Jonny Bairstow could be given an opportunity in the Boxing Day Test (Picture: Getty) At least the ones in harness have been hardened by tough match cricket, though that can begin to take a mental toll which must be considered when picking teams to face a confident Australia. This is where Root has to act on instinct rather than data, which can be difficult when you have become a slave to the latter. You need players who relish the scrap not those who are cowed by it and no algorithm will tell you who that is in the midst of an Ashes series. It was that lack of cricketing nous which also drove England to pick the wrong bowling attack for the second Test in a row. Not that it would have made much difference given their lack of first-innings runs but Mark Wood had to play and possibly a spinner too. There will be another drop-in pitch at the MCG, and they can be bland, but that should not rule out Wood who can hurry and harry. Where Root was right, in his post-match comments, was to identify that England’s pace bowlers did not pitch full enough. But why didn’t he address it at the time? James Anderson and Stuart Broad are rightfully revered, but they are still the captain’s worker bees and there to do his bidding. Watching England bowl on the first day, albeit from afar, it looked like a deliberate tactic to hit a hard length from the start and give as few runs away as possible. More: Metro newspaperUK and France sued for 'manslaughter' after 27 migrants drown in ChannelI ditched Amazon for a year and this is what it was likeWhat's in store for today? Your daily horoscope for Tuesday, December 21, 2021 It was if they were waiting for Godot, the Samuel Becket play where two men wait around for a third who never arrives. In England’s case, they were waiting for the floodlights in the evening session; a trigger, so lore has it, for the pink ball to start darting around Headingley style. It never happened for them (another flaw of relying on data from past events). Instead of hunting for wickets while the ball was new, something best achieved in Australia with a full length, they allowed home batsmen to become well established and post a first-innings total of 473. That was always too many and England’s batting, predictably, crumbled under the pressure it wrought. @derekpringle MORE : ‘I nearly fell off my seat!’ – Australia legend Ricky Ponting blasts Joe Root’s comments after second Ashes Test MORE : Rob Key urges England to make two changes to batting line-up for third Ashes Test against Australia For more stories like this, check our sport page. Follow Metro Sport for the latest news on Facebook, Twitter and Instagram.","pubDate":"2021-12-22 10:27:34","full_description":"Unless the private reality is different from the public pronouncements made by their captain Joe Root , England’s cricketers are, to revive an old quote about them by former Aussie fast bowler, Jeff Thomson, ‘on a rollercoaster to the s***house’ — a place for ablution in Australia but not absolution. Two down with three to go, England need to win all remaining Tests to regain the Ashes, a task theoretical at best given they have won none of their last 12 in Australia. If that is the positive view ahead of the Boxing Day Test in Melbourne, the way these things normally pan out, as the recriminations and soul-searching mount, is that they will do well to avoid a whitewash. Playing the Aussies on their home turf has always been tough. Realism is required which is why Root’s post-match claim that he doesn’t think Australia are much better than England in the conditions is an insult, even to the gullible. Perhaps captains have to say things like that in public but the bald facts are England’s Brains’ Trust identified the pink-ball Test in Adelaide as their best opportunity to win, and tailored their entire strategy around it. Those chances were further boosted when Australia lost captain Pat Cummins, and fast bowler Josh Hazlewood before the match. And yet defeat still occurred for England, by 275 runs, which makes one hate to think what might happen when the Brains’ Trust don’t see things so favourably. So what went wrong? The simple answer is that England, for the umpteenth time, did not score enough runs in their first innings, 236 barely winning you a T20 game these days let alone a five-day Test. Nothing new there. In fact it’s been happening for a while and but for Root’s extraordinary year with the bat, in which he has made 1,630 runs at 62.7, and the excellence of England’s bowlers, at least in home conditions, results over the past 18 months would have been a lot worse. So far, the batting failings in Australia have been due to a lack of discipline and judgement, with the odd technical glitch thrown in. Rory Burns has a lot of moving parts in his trigger movements but so too does Steve Smith, Australia’s acting captain in Adelaide. The difference is Smith knows what bowling lines to play and which to leave, something Burns has yet to master though he looked more adept in the second innings in Adelaide. This is crucial. Batsmen have to know where off-stump is and play only at those balls no more than a bat’s width outside it, at least until set. If you can get a start in Australia, and maintain concentration thereafter, it offers the best batting conditions around as the Kookaburra ball does very little except for spinners like Nathan Lyon, who give the ball a rip. But you need to be patient as Aussie bowlers are the personification of discipline, something Jos Buttler managed to be in his second innings where he sheathed his usual attacking instincts to graft a funereal 26 off 207 balls. Some, Sir Alastair Cook among them, got very excited saying the knock, which ended when Buttler trod on his stumps, would be the making of him as a Test batsman. Hopefully it will be as Buttler has a rare talent for ball-striking, yet they seem to be forgetting that had Alex Carey, his opposite number, not inexplicably waved through the straightforward edge Buttler gave off Mitchell Starc, the England keeper would have chalked up his second duck of the game. As it is, instead of him carrying the drinks next week, everyone will be intrigued to see how ‘Blocker Buttler’ goes at the MCG, possibly promoted to No.6 in place of Ollie Pope with Jonny Bairstow, perhaps taking the wicketkeeper’s gloves off him, at seven. Changes are usually what defeat brings in Ashes series, where the stakes are hyped to the max. But can England risk making any for the third Test given the replacements have had nothing but net practice to prepare them? At least the ones in harness have been hardened by tough match cricket, though that can begin to take a mental toll which must be considered when picking teams to face a confident Australia. This is where Root has to act on instinct rather than data, which can be difficult when you have become a slave to the latter. You need players who relish the scrap not those who are cowed by it and no algorithm will tell you who that is in the midst of an Ashes series. It was that lack of cricketing nous which also drove England to pick the wrong bowling attack for the second Test in a row. Not that it would have made much difference given their lack of first-innings runs but Mark Wood had to play and possibly a spinner too. There will be another drop-in pitch at the MCG, and they can be bland, but that should not rule out Wood who can hurry and harry. Where Root was right, in his post-match comments, was to identify that England’s pace bowlers did not pitch full enough. But why didn’t he address it at the time? James Anderson and Stuart Broad are rightfully revered, but they are still the captain’s worker bees and there to do his bidding. Watching England bowl on the first day, albeit from afar, it looked like a deliberate tactic to hit a hard length from the start and give as few runs away as possible. UK and France sued for 'manslaughter' after 27 migrants drown in Channel I ditched Amazon for a year and this is what it was like What's in store for today? Your daily horoscope for Tuesday, December 21, 2021 It was if they were waiting for Godot, the Samuel Becket play where two men wait around for a third who never arrives. In England’s case, they were waiting for the floodlights in the evening session; a trigger, so lore has it, for the pink ball to start darting around Headingley style. It never happened for them (another flaw of relying on data from past events). Instead of hunting for wickets while the ball was new, something best achieved in Australia with a full length, they allowed home batsmen to become well established and post a first-innings total of 473. That was always too many and England’s batting, predictably, crumbled under the pressure it wrought. @derekpringle MORE : ‘I nearly fell off my seat!’ – Australia legend Ricky Ponting blasts Joe Root’s comments after second Ashes Test MORE : Rob Key urges England to make two changes to batting line-up for third Ashes Test against Australia For more stories like this, check our sport page . Follow Metro Sport for the latest news on Facebook , Twitter and Instagram .","image_url":"https://metro.co.uk/wp-content/uploads/2021/12/comp-1640168122.png","source_id":"metro"},{"title":"Cricket-Australia run-machine Labuschagne claims No.1 batting spot","link":"https://www.thestar.com.my/sport/cricket/2021/12/22/cricket-australia-run-machine-labuschagne-claims-no1-batting-spot","keywords":null,"creator":null,"video_url":null,"description":"SYDNEY (Reuters) - Australia run-machine Marnus Labuschagne has displaced England captain Joe Root to claim the world's number one test batter spot following a run of big scores in the ongoing Ashes series at home, the International Cricket Council said on Wednesday. Read full story","content":null,"pubDate":"2021-12-22 09:52:00","full_description":"SYDNEY (Reuters) - Australia run-machine Marnus Labuschagne has displaced England captain Joe Root to claim the world's number one test batter spot following a run of big scores in the ongoing Ashes series at home, the International Cricket Council said on Wednesday. South Africa-born Labuschagne scored his sixth test century and followed it up with a 51 in the second test in Adelaide to help Australia take a 2-0 lead in the five-match series against their arch-rivals. Root managed to score a half-century in each of the first two tests and dropped to second in the list of test batters. Having narrowly lost out to New Zealand for a spot in this year's inaugural World Test Championship final, Labuschagne said Australia's eyes are not trained on just winning the Ashes. \"Regardless of if we win the next one, our goal is to win every single test match this summer,\" he told reporters. \"For us, that is what the test championship has brought in. \"Not just about winning this series, you're playing for something bigger than that as well.\" Labuschagne's first four tests for Australia came when the side were without banned duo of David Warner and Steve Smith. After making his debut three years back against Pakistan, Labuschagne lost his place in the side and only returned as a concussion substitute for Smith in the 2019 Ashes series in England. The 27-year-old, who started the ongoing series ranked fourth, scored 74 in the hosts' opening win in Brisbane and his average of 62.14 is second only to Don Bradman's legendary mark of 99.94 among those who have batted in 20 innings or more. In the rankings for Twenty20 international batters, Pakistan captain Babar Azam reclaimed the top spot in the list after just one week of losing it. Babar is currently tied at the top of the rankings with England's Dawid Malan. (Reporting by Sudipto Ganguly in Mumbai; Editing by Toby Chopra)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/22/1416792.jpg","source_id":"thestar_my"},{"title":"PAK vs WI: Pakistan to host West Indies for T20I series in 2023","link":"https://zeenews.india.com/cricket/pak-vs-wi-pakistan-to-host-west-indies-for-t20i-series-in-2023-2421623.html","keywords":null,"creator":null,"video_url":null,"description":"The West Indies team is already scheduled to play the ICC Men's Cricket World Cup Super League ODIs in June 2022 to make up for the postponed December 2021 matches due to an increased number of Covid-19 cases in their side.","content":null,"pubDate":"2021-12-22 09:51:00","full_description":"The West Indies men's cricket team will play three Twenty20 Internationals in the build up to the Pakistan Super League 2023, the Pakistan Cricket Board (PCB) said on Wednesday. The West Indies team is already scheduled to play the ICC Men's Cricket World Cup Super League ODIs in June 2022 to make up for the postponed December 2021 matches due to an increased number of Covid-19 cases in their side. Recently, the One-day International (ODI) series between West Indies and Pakistan, which was scheduled to start in Karachi on December 18, was postponed and rescheduled for early June 2022 after five more members of the visiting team tested COVID-19 positive. Highlights from the 67th BoG meeting held in Karachi. https://t.co/5wYQp2YI0A — PCB Media (@TheRealPCBMedia) December 22, 2021 A total of nine members in the visiting team had tested COVID-positive since they had arrived in Karachi on December 9. The PCB and Cricket West Indies (CWI) had then issued a joint statement, saying the ODI series will be postponed and rescheduled for early June 2022. The West Indies team had flown back after playing three T20Is in Karachi last week. Pakistan had made a clean sweep of the series. Live TV","image_url":null,"source_id":"zeenews"},{"title":"Kehrt die Fußball-Romantik nach England zurück?","link":"https://www.nordbayern.de/sport/fussball/kehrt-die-fussball-romantik-nach-england-zuruck-1.11659346","keywords":null,"creator":null,"video_url":null,"description":"London (dpa) - Und doch werden viele Fußballfans in England die Partie noch genauer verfolgen - denn an der Stamford Bridge sind erstmals seit 28 Jahren wieder Stehplätze erlaubt. Außer dem Champions-League-Sieger aus London beteiligen sich auch Stadtrivale Tottenham Hotspur, die Manchester-Clubs United und City sowie Zweitligist Cardiff City an dem Pilotprojekt. Für viele Fans rückt damit ein Stück der lange vermissten Fußball-Romantik zurück in die englischen Stadien.Auslöser des Umschwungs war ausgerechnet die gescheiterte Super League: An dem Milliardenprojekt wollten sich ursprünglich auch sechs englische Topclubs beteiligen: Chelsea, Liverpool, Tottenham, der FC Arsenal sowie Manchester City und Manchester United. Doch die Pläne, die in einer Nacht-und-Nebel-Aktion vorgestellt wurden, stießen auf massiven Widerstand bei den eigenen Fans. Vor allem die amerikanischen Clubbesitzer von Liverpool und Manchester United sahen sich Rücktrittsforderungen ausgesetzt. Auch deshalb folgte die rasche Kehrtwende. Nun strecken die Clubs ihren Fans die Hand aus.Klappsitze angebracht\"Forschung und Beweise zeigen, dass das Stehen sicher bewältigt werden kann, und wir freuen uns darauf, dass unsere Anhänger diese verbesserte Erfahrung zum frühestmöglichen Zeitpunkt im neuen Jahr genießen können\", sagte Chelsea-Chef Guy Laurence nun. Dafür haben die Clubs Klappsitze angebracht, wie es sie auch in deutschen Stadien gibt. Die Lizenz gilt vorerst bis Saisonende.Ob die sich rasant ausbreitende Omikron-Variante dem Auftakt der neuen Ära kurzfristig einen Strich durch die Rechnung macht, ist offen. In Schottland und Wales müssen Fußballspiele nach Weihnachten weitgehend ohne Zuschauer stattfinden - doch in England ist noch nicht entschieden, ob, wann und wie verschärft wird.Der schottische Spitzenclub Celtic Glasgow bietet bereits seit 2016 insgesamt 2900 Stehplätze an. Für England aber ist es ein historischer Einschnitt. Auch wenn vor allem Auswärtsfans das Verbot oft umgehen: In den Stadien der obersten zwei Ligen ist es seit 1994 gesetzlich untersagt, Stehplätze anzubieten. Das Verbot geht im Wesentlichen auf die Hillsborough-Katastrophe in Sheffield 1989 und den Untersuchungsbericht - den \"Taylor Report\" - zurück. Beim FA-Cup-Halbfinale zwischen dem FC Liverpool und Nottingham Forest kam es auf einer überfüllten Tribüne zu einem Massengedränge und Panik, 97 Menschen starben, Hunderte wurden verletzt.Hohe PreiseDie Folgen waren enorm. Die Eintrittspreise stiegen unaufhörlich, die Fanszenen veränderten sich. Viele Anhänger mit kleinen oder mittleren Einkommen haben kein Geld, um die hohen Kosten zu stemmen. Das machte sich auch in der einst so hoch gelobten Stimmung in den Stadien bemerkbar. Auch vor der Corona-Pandemie gab es nur wenige Ausnahmen, bei denen eine ähnliche Atmosphäre herrscht wie in der Bundesliga.Tatsächlich reisen zahlreiche Fans aus England jede Woche nach Deutschland, um bei vergleichsweise günstigen Preisen Fußball im Stehen zu genießen - mit einem Bier in der Hand. Ein Pint mit Blick aufs Spielfeld zu genießen, ist in den obersten fünf englischen Ligen bereits seit 1985 verboten. Regierung und Clubs wollten damit das grassierende Hooligan-Problem in den Griff bekommen.Aber auch hier könnte es zu einer - wenn auch kleineren - englischen Revolution kommen. Denn eine unabhängige \"Fan geführte\" Kommission hat ein Pilotprojekt für die vierte und fünfte Liga vorgeschlagen, bei dem Fans ihr Bier wieder an ihrem Platz trinken dürften. Einerseits kritisieren Anhänger die bisherigen Regeln als veraltet. Schließlich kehren viele Fans traditionell bis kurz vor Spielbeginn in nahe gelegene Pubs ein. Auch im Stadioninneren wird oft Alkohol verkauft, er darf nur lediglich nicht am Platz konsumiert wird - die Folge ist oft eine \"Druckbetankung\" in der Halbzeitpause. Die Lage könnte also entspannt werden, argumentieren Befürworter.Bier als EinnahmequelleHinzu kommen handfeste finanzielle Gründe. Beispiel Dulwich Hamlet: Der Londoner Sechstligist macht fast die Hälfte seiner Einnahmen an Spieltagen mit dem Ausschank alkoholischer Getränke. Das würde im Falle eines Aufstiegs finanzielle Lücken reißen. \"Sie haben uns offen gesagt, dass sie es sich aufgrund der Alkoholregeln nicht leisten können, aufzusteigen\", sagte die frühere Sportstaatssekretärin Tracey Crouch der Zeitung \"The Times\". Die von ihr geführte Kommission kam zu dem Schluss, dass ein Ende des Bierverbots am Platz den Clubs der vierten Liga knapp 4,5 Millionen Pfund (5,3 Mio Euro) in die Kassen spülen könnte - ein erheblicher Beitrag zur Nachhaltigkeit.Doch in Sachen Bier ist das letzte Wort noch nicht gesprochen. Vor allem die Polizei hat erhebliche Einwände. Die geplante Änderung sei bizarr, sagte Mark Roberts, Polizeichef von Cheshire. Das Gebiet grenzt an die Fußballstädte Manchester und Liverpool. \"Es gibt einen klaren Zusammenhang zwischen Alkohol und schlechtem Benehmen, nicht nur im Fußball, sondern in der Gesellschaft insgesamt\", sagte Roberts.Mittlerweile häuften sich auch in anderen Sportarten wie Rugby und Cricket, wo der Konsum am Platz gestattet ist, negative Auswirkungen. Und auch das Chaos rund um das EM-Finale im Juni in London, als zahlreiche betrunkene Fans vor dem Wembley-Stadion randalierten und sich Dutzende illegal Zutritt verschafften, spricht aus Sicht vieler Kritiker nicht für eine Änderung des Verbots.","content":null,"pubDate":"2021-12-22 09:49:55","full_description":"London (dpa) - Die Revolution beginnt mit einem Knaller. FC Chelsea gegen den FC Liverpool, an der Seitenlinie mit \"Blues\"-Coach Thomas Tuchel und \"Reds\"-Trainer Jürgen Klopp zwei Deutsche: Mehr Spitzenspiel geht kaum zum Jahresbeginn am 2. Januar in der Premier League. Und doch werden viele Fußballfans in England die Partie noch genauer verfolgen - denn an der Stamford Bridge sind erstmals seit 28 Jahren wieder Stehplätze erlaubt. Außer dem Champions-League-Sieger aus London beteiligen sich auch Stadtrivale Tottenham Hotspur, die Manchester-Clubs United und City sowie Zweitligist Cardiff City an dem Pilotprojekt. Für viele Fans rückt damit ein Stück der lange vermissten Fußball-Romantik zurück in die englischen Stadien. Auslöser des Umschwungs war ausgerechnet die gescheiterte Super League: An dem Milliardenprojekt wollten sich ursprünglich auch sechs englische Topclubs beteiligen: Chelsea, Liverpool, Tottenham, der FC Arsenal sowie Manchester City und Manchester United. Doch die Pläne, die in einer Nacht-und-Nebel-Aktion vorgestellt wurden, stießen auf massiven Widerstand bei den eigenen Fans. Vor allem die amerikanischen Clubbesitzer von Liverpool und Manchester United sahen sich Rücktrittsforderungen ausgesetzt. Auch deshalb folgte die rasche Kehrtwende. Nun strecken die Clubs ihren Fans die Hand aus. Klappsitze angebracht \"Forschung und Beweise zeigen, dass das Stehen sicher bewältigt werden kann, und wir freuen uns darauf, dass unsere Anhänger diese verbesserte Erfahrung zum frühestmöglichen Zeitpunkt im neuen Jahr genießen können\", sagte Chelsea-Chef Guy Laurence nun. Dafür haben die Clubs Klappsitze angebracht, wie es sie auch in deutschen Stadien gibt. Die Lizenz gilt vorerst bis Saisonende. Ob die sich rasant ausbreitende Omikron-Variante dem Auftakt der neuen Ära kurzfristig einen Strich durch die Rechnung macht, ist offen. In Schottland und Wales müssen Fußballspiele nach Weihnachten weitgehend ohne Zuschauer stattfinden - doch in England ist noch nicht entschieden, ob, wann und wie verschärft wird. Der schottische Spitzenclub Celtic Glasgow bietet bereits seit 2016 insgesamt 2900 Stehplätze an. Für England aber ist es ein historischer Einschnitt. Auch wenn vor allem Auswärtsfans das Verbot oft umgehen: In den Stadien der obersten zwei Ligen ist es seit 1994 gesetzlich untersagt, Stehplätze anzubieten. Das Verbot geht im Wesentlichen auf die Hillsborough-Katastrophe in Sheffield 1989 und den Untersuchungsbericht - den \"Taylor Report\" - zurück. Beim FA-Cup-Halbfinale zwischen dem FC Liverpool und Nottingham Forest kam es auf einer überfüllten Tribüne zu einem Massengedränge und Panik, 97 Menschen starben, Hunderte wurden verletzt. Hohe Preise Die Folgen waren enorm. Die Eintrittspreise stiegen unaufhörlich, die Fanszenen veränderten sich. Viele Anhänger mit kleinen oder mittleren Einkommen haben kein Geld, um die hohen Kosten zu stemmen. Das machte sich auch in der einst so hoch gelobten Stimmung in den Stadien bemerkbar. Auch vor der Corona-Pandemie gab es nur wenige Ausnahmen, bei denen eine ähnliche Atmosphäre herrscht wie in der Bundesliga. Tatsächlich reisen zahlreiche Fans aus England jede Woche nach Deutschland, um bei vergleichsweise günstigen Preisen Fußball im Stehen zu genießen - mit einem Bier in der Hand. Ein Pint mit Blick aufs Spielfeld zu genießen, ist in den obersten fünf englischen Ligen bereits seit 1985 verboten. Regierung und Clubs wollten damit das grassierende Hooligan-Problem in den Griff bekommen. Aber auch hier könnte es zu einer - wenn auch kleineren - englischen Revolution kommen. Denn eine unabhängige \"Fan geführte\" Kommission hat ein Pilotprojekt für die vierte und fünfte Liga vorgeschlagen, bei dem Fans ihr Bier wieder an ihrem Platz trinken dürften. Einerseits kritisieren Anhänger die bisherigen Regeln als veraltet. Schließlich kehren viele Fans traditionell bis kurz vor Spielbeginn in nahe gelegene Pubs ein. Auch im Stadioninneren wird oft Alkohol verkauft, er darf nur lediglich nicht am Platz konsumiert wird - die Folge ist oft eine \"Druckbetankung\" in der Halbzeitpause. Die Lage könnte also entspannt werden, argumentieren Befürworter. Bier als Einnahmequelle Hinzu kommen handfeste finanzielle Gründe. Beispiel Dulwich Hamlet: Der Londoner Sechstligist macht fast die Hälfte seiner Einnahmen an Spieltagen mit dem Ausschank alkoholischer Getränke. Das würde im Falle eines Aufstiegs finanzielle Lücken reißen. \"Sie haben uns offen gesagt, dass sie es sich aufgrund der Alkoholregeln nicht leisten können, aufzusteigen\", sagte die frühere Sportstaatssekretärin Tracey Crouch der Zeitung \"The Times\". Die von ihr geführte Kommission kam zu dem Schluss, dass ein Ende des Bierverbots am Platz den Clubs der vierten Liga knapp 4,5 Millionen Pfund (5,3 Mio Euro) in die Kassen spülen könnte - ein erheblicher Beitrag zur Nachhaltigkeit. Doch in Sachen Bier ist das letzte Wort noch nicht gesprochen. Vor allem die Polizei hat erhebliche Einwände. Die geplante Änderung sei bizarr, sagte Mark Roberts, Polizeichef von Cheshire. Das Gebiet grenzt an die Fußballstädte Manchester und Liverpool. \"Es gibt einen klaren Zusammenhang zwischen Alkohol und schlechtem Benehmen, nicht nur im Fußball, sondern in der Gesellschaft insgesamt\", sagte Roberts. Mittlerweile häuften sich auch in anderen Sportarten wie Rugby und Cricket, wo der Konsum am Platz gestattet ist, negative Auswirkungen. Und auch das Chaos rund um das EM-Finale im Juni in London, als zahlreiche betrunkene Fans vor dem Wembley-Stadion randalierten und sich Dutzende illegal Zutritt verschafften, spricht aus Sicht vieler Kritiker nicht für eine Änderung des Verbots.","image_url":null,"source_id":"nordbayern"},{"title":"Yasir Shah brought bad name to Pakistan Cricket, says Ramiz Raja","link":"https://www.business-standard.com/article/sports/yasir-shah-brought-bad-name-to-pakistan-cricket-says-ramiz-raja-121122200670_1.html","keywords":null,"creator":null,"video_url":null,"description":"PCB chairman Ramiz Raja said that the incident involving Test leg-spinner Yasir Shah has brought a bad name to Pakistan Cricket","content":null,"pubDate":"2021-12-22 09:44:00","full_description":"PCB chairman Ramiz Raja on Wednesday said that the incident involving Test leg-spinner Yasir Shah has brought a bad name to Pakistan Cricket. Yasir Shah was named in an FIR filed by a couple at Islamabad's Shalimar police station two days back in which they have alleged that the cricketer had aided his friend while knowing he had raped and made compromising videos of their 14-year old niece. \"It is a no-brainer Yasir is a circuit player and while we train and educate these players they are in ambassadorial positions and should know with whom and where to socialize,\" Ramiz said at a press conference in Karachi on Wednesday. The FIR states that when the couple approached Yasir for help he laughed them off, made fun of the entire incident, gave life threats to them and their niece and said he would use his influence to drag them into legal battles. Yasir and his friend, Farhan have gone underground and are still being searched by the police in the case. \"I don't know what is the truth in this case but it is a fact that such headlines are not good for Pakistan cricket and specially at a time when there is a feel good factor going through Pakistan Cricket now,\" the PCB Chairman said. He said that all contracted players including Yasir were regularly reminded of their responsibilities as ambassadors and how to behave in public. \"It is a no-brainer that they must know with whom or when to socialize.\" Yasir has played 46 Tests and 25 ODIs for Pakistan but missed the recent tour to Bangladesh because of finger injury. Ramiz said he had increased fees of players soon after taking over as Chairman in September because he wanted all players to be financially secure in society and also to put an end to this debate on departmental/organizational cricket and provincial teams. \"I want these players to be earning well but they also have responsibilities towards Pakistan cricket and the sport. (Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)","image_url":"https://bsmedia.business-standard.com/_media/bs/img/article/default/1211222/thumb-121122200670.jpg","source_id":"business-standard"},{"title":"Labuschagne on top of the world after Ashes century - cricket.com.au","link":"https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL3d3dy5jcmlja2V0LmNvbS5hdS9uZXdzL21hcm51cy1sYWJ1c2NoYWduZS1vZmZpY2lhbGx5LWJlc3QtYmF0dGVyLWluLXdvcmxkLWljYy10ZXN0LXJhbmtpbmctam9lLXJvb3Qtc3RldmUtc21pdGgtYXNoZXMvMjAyMS0xMi0yMtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Labuschagne on top of the world after Ashes century  cricket.com.auWorld No. 1 the ‘luckiest batsman in history’  NEWS.com.auMarnus Labuschagne climbs to top of ICC Test batter rankings  Wide World of SportsEngland face ‘catch-22’ over tactics to combat world’s new No.1 batter  Sydney Morning Herald‘Luckiest Test batsman in history’: Crazy stat inflating magic Marnus’ batting reputation  Fox SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-22 09:26:55","image_url":null,"source_id":"google"},{"title":"ICC rankings: Marnus Labuschagne becomes No. 1 Test batter, Babar Azam returns to top in T20Is - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2ljYy1yYW5raW5ncy1tYXJudXMtbGFidXNjaGFnbmUtYmVjb21lcy1uby0xLXRlc3QtYmF0dGVyLWJhYmFyLWF6YW0tcmV0dXJucy10by10b3AtaW4tdDIwaXMtMTI5NDA3MtIBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"ICC rankings: Marnus Labuschagne becomes No. 1 Test batter, Babar Azam returns to top in T20Is  ESPNcricinfoICC Test Rankings: Virat Kohli Slips To No 7, Marnus Labuschagne Is New World No 1 Batter  NDTVSports.comMarnus Labuschagne Becomes The World's No. 1 Ranked Test Batter  News18Babar Azam Returns To Top Spot As ICC Announces Latest T20I Batsmen Rankings  Cricket AddictorICC Test Rankings: Marnus Labuschagne is new world No 1, Virat Kohli slips to No 7  FirstpostView Full coverage on Google News","content":null,"pubDate":"2021-12-22 09:16:43","image_url":null,"source_id":"google"}]}