{"newsArray":[{"article_id":"43106fce5d8fbd61b75f5ec30215aac2","title":"‘Us versus them’: The states winning the battle for the baggy green","link":"https://www.theage.com.au/sport/cricket/us-versus-them-the-states-winning-the-battle-for-the-baggy-green-20231127-p5en5f.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Twenty years ago, David Hookes made a famous quip about NSW and brown paper bags. But do the Blues still dominate national selection? We’ve crunched the numbers to find out.","content":"“When they give out the baggy blue cap in New South Wales, they give you a baggy green in a brown paper bag as well to save making two presentations.” – October 14, 2003. Twenty years ago, the late David Hookes, who was coach of Victoria at the time, offered this immortal assessment of Test selection for the Australian men’s team. For the record, it was said in the context of a NSW left-arm seamer, Nathan Bracken, getting picked in front of a Victorian, Mathew Inness, for a Test squad to face Zimbabwe in Sydney. Two decades on, does Hookes’ hot take still hold up? This masthead has compiled state-by-state selection figures for the past 20 years, showing that the spread of baggy green caps has widened considerably. Over that period, 20 players have been picked from a NSW background, 19 from Victoria, 12 from Western Australia, 11 from Queensland, 10 from South Australia and nine from Tasmania. NSW, then, is not exactly dominating the debutants list – and has had only three new baggy green caps since 2014. Looked at in terms of Test match tenures, however, there is no debate: the baggy Blues still provide the bulk of the team’s long-term players. Over those 20 years, the 20 NSW players have played a combined 775 Tests between them, an average of nearly 40 Tests each. By contrast, the 19 Victorians played just 212 Tests, or around 11 matches apiece. Queensland (30 matches on average per player) and WA (22 per player) have fared somewhat better, because of long careers for a few in both past and current crops. But the overall figures make it abundantly clear that the historical supremacy of NSW as the primary breeding ground for top Test talent has carried on beyond Hookes’ moment of sharp observation. In all-time terms, this has meant that NSW-grown players comprise seven of the top 10 run scorers (11 of the top 20) and five of the top 10 wicket-takers (10 of the top 20). The 21st bowler, Geoff Lawson, and the 21st batter, Usman Khawaja, were also both NSW cricket products. For the purposes of compiling the data, we regarded the state of origin as the one the player represented at the time they were picked for Australia. Hence Nathan Lyon and his 500 Test wickets are products of South Australia, where he was a budding off-spinner and part of the Adelaide Oval ground staff before moving to NSW later in his career. For Lawson, now a NSW selector, the numbers demonstrate that his state has long excelled at producing players best rounded for international cricket because of the need to cope with pace, swing and spin on junior, club and first-class surfaces in Sydney. “Players who play spin well in Australia tend to adapt to faster wickets rather than the other way round,” Lawson said. “That’s why Western Australians would come to Sydney and go ‘we can’t play on that s---heap, that’s terrible’, but when people went to Perth, no one said ‘oh we’ve got to play on this bouncing, cracked minefield’. “They had a huge advantage over there, but their complaint was that they had to play on a spinning wicket. Not many West Australians in the 1980s had long Test careers. Kim Hughes was good against spin so he played a few more. Guys like Graeme Wood did well opening the batting and did OK against the Windies, but didn’t make many runs against spin. “When you did tour overseas, a lot of those guys didn’t have the skills to handle it because they had played in those Perth conditions. But certainly people who play on slower wickets that spin can adapt more when the wickets get quicker. That was a great thing about Australian cricket – different pitches everywhere.” For David Hussey, one of the talented Victorians Hookes felt should have received a more rapid call-up to the Australian limited overs teams and who never cracked the Test side, the difference was evident as he came through the ranks in WA before moving to Melbourne. “Playing 17s, 19s and second XI, when we used to play NSW, and this is just me, but I always thought they were better batters than us,” Hussey said. “They were more rounded batters, better players of fast bowling, better players of spin and they had this inner belief, these NSW players, that they were the best and they were always going to be international players. “I guess you could say that was a poor mindset from an interstater, or from a Victoria person or a WA person, but it is slowly changing. “I believe over the next three or four years when some of the greats like [Mitchell] Starc, [Josh] Hazlewood, [David] Warner, [Steve] Smith, [Pat] Cummins, Khawaja all leave, there’s going to be huge opportunities for all players around Australia to get a long go in Test cricket. I wouldn’t be surprised if a few WA players get in there and have an extended time in the Test team.” Bracken’s Test career lasted two years and five Tests, but he enjoyed an illustrious ODI career of 116 matches, including a role in Australia’s triumphant 2007 World Cup campaign. Inness, a fast and big-hearted left-armer, did not make a national squad. The respected fitness guru has recently joined AFL club West Coast as high-performance manager after a long stint at the Western Bulldogs. The perceived injustices in national selection did not end there, and Hookes’ comments tapped into a parochial view that Victorian players were hard done by. Brad Hodge, dropped after six Tests, was the poster boy for this argument. Peter Handscomb (20 Tests) is the only Victorian batter to have enjoyed an extended run in the Test side since, and he is now considered a subcontinent specialist. “We always thought if there was a 50/50 selection call it always went to another player rather than a Victorian player, and that used to get us down a little bit,” Hussey said. “But that was the environment that was created, us versus them, and Hookesy was always going into bat for us. “That was Hookesy in a nutshell, he was us against the world. When he spoke about the baggy green in the brown paper bag, I took it as him going into bat for our players, the Brad Hodges, the Matthew Elliotts, Mathew Inness, to play for Australia. He was backing his players, and everyone got a lot of confidence out of Hookesy saying those words publicly.” However, Victoria has done a much better job at producing white-ball players in the 20 years since Hookes’ baggy blue remark. Our data shows 19 players have been picked from Victoria – equal with WA – for a whopping 1247 matches, more than double WA’s 527 matches. Here, thanks largely to the brilliant careers of former white-ball captain Aaron Finch and World Cup hero Glenn Maxwell, Victoria puts NSW in the shade. The Blues have produced 14 ODI debutants in the past 20 years for 797 matches. One of Hussey’s great rivals for a spot in the Australian Test side was Simon Katich, who played his early cricket in WA before moving to Sydney. He can recall the sniggering from both north and south of NSW about how he first became established in the Australian side after joining the Blues. But tellingly, he also recalls that he made the move to become a more rounded player, something that helped him perform overseas. “I know a lot of people speculate that, but I never thought by going there [it would get me in the Test team],” Katich said. “I’d played a Test match by playing for WA in 2001 Ashes, so I never thought of it like that. “When I look back it was purely that I wanted to go there to not have any regrets later in my career and to improve my bowling, because I knew I wasn’t going to bowl much in Perth, and I knew I had to get better at playing spin.” What is unknown, of course, is where things go after the current, dominant NSW generation departs the Test team, starting with Warner after the SCG Test in January. For Lawson, the continuation of the NSW dynasty Hookes battled against will depend as much on conditions underfoot as talent in the eyes, hands and feet. “Partly it is a function of the way the game is played now,” Lawson said. “Because they play so much international cricket, they virtually don’t play state cricket. That means they’re always fit and ready for the international team and get looked after physically and mentally so they can play longer. That means there are fewer spots available. “We’ve got to turn over our state players as well, which hasn’t happened much. Playing professional cricket is a good gig, no one wants to give it up – everyone wants to stay longer, because that’s what they do for a living. “We’ll go to Sam Konstas, Ollie Davies and Blake Nikitaras – they’re the next group who’ve got to get out there and play, they’ve all got talent. You’ve got to get them into first-class cricket, then produce some pitches that help teach them to play normally. There’s no point putting them on these pitches that seam all over the place.” Come back tomorrow part two in our series. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-20 00:32:57","image_url":"https://static.ffx.io/images/$zoom_0.16153992678076973%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_jpg/e99d396f5ed5a4f12ade483b21ebcf6e48158e96","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c22973ba9bc26250b77884bd760036ea","title":"Prominent cricket commentator Isa Guha issues classy response to Joey Barton’s polarising claims","link":"https://7news.com.au/sport/cricket/prominent-cricket-commentator-isa-guha-issues-classy-response-to-joey-bartons-polarising-claims-c-12963390","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"‘I’ve been thinking lately.’","content":"Prominent commentator Isa Guha has issued a classy response to inflammatory and misogynistic suggestions that women shouldn’t cover men’s sport. Polarising former English Joey Barton caused a storm that reverberated around the globe earlier this month when he told UK shock jock Piers Morgan that females don’t belong on the coverage of male sport. The jarring and wildly offensive opinion was met with widespread blowback, but that didn’t bother the former EPL midfielder, who doubled down on his vile comments just days later. “It’s a completely different game,” Barton said of women’s football. “If you don’t accept that, we will always see things differently. “The women’s game is thriving. Fantastic to see. (But) I cannot take a thing they say serious in the men’s arena.” Guha, an accomplished cricket broadcaster who played 113 internationals for England across all three formats of the game, has become a star of UK and Australian television during her already decorated media career. She started appearing on screens just months after he retirement from the game in 2011, contributing to UK broadcaster ITV4’s coverage of the 2012 IPL. The 38-year-old, whose parents emigrated from India before she was born, has also become a polished radio caller, and has written sports columns for the BBC. In a lengthy Instagram post on Tuesday night, Guha detailed her gratitude for being in the position she is, and the hard work it took her to get there. “I’ve been thinking lately of how grateful I am to be able to cover sport, because I guess it hasn’t always been attainable,” she wrote. “I’m aware of the recent comments in the UK that women shouldn’t work on men’s sport, and people voicing differing opinions around the matter.“When I first started, I was pretty green and I remember the comments then. But my bosses backed me against the noise and when I made plenty of mistakes. As a result, I wanted to repay them by learning as much and as quickly as possible.” She said the diversity of her colleagues is “what makes it special” to broadcast sport. “But I hope that as time moves on, there is more focus on everyone enjoying sport rather than their gender or background.” Guha implicitly dismissed Barton’s comments with typical grace, and celebrated cricket’s trailblazing commitment to amplifying females’ voices in both men’s and women’s sport. “Cricket has led the way with many female voices and I’m grateful that many of our peers and colleagues have always given us the support/space and backing to fulfil our roles,” she wrote. “While there will always be exceptions, I’ve always felt it’s more important to acknowledge those that raise us up rather than those that don’t.“My opinion is that women can work on men’s sport just as men can work on women’s sport as pundits/presenters/commentators. But either way, let’s give people exactly the same patience and support to learn and thrive.”","pubDate":"2023-12-20 00:30:38","image_url":"https://images.7news.com.au/publication/C-12963390/794502145043e1c41dab8bfce8d96e4a866a3cbb-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"556549b7e34dbc014bb443793656d3ad","title":"18 साल की उम्र में ठोके 250 रन, धोनी के गढ़ के विकेटकीपर पर DC ने लुटाए पैसे","link":"https://hindi.news18.com/cricket/ipl-2024-auction-delhi-capitals-takes-kumar-kushagra-from-ms-dhoni-state-jharkhan-play-for-rishab-pant-7915687.html","keywords":null,"creator":null,"video_url":null,"description":"इंडियन प्रीमियर लीग की युवाओं टीम मानी जाने वाले दिल्ली कैपिटल्स ने एक बार फिर से नई प्रतिभा पर भरोसा जताया है. ऋषभ पंत को टीम का कप्तान बनाने के बाद टीम मैनेजमेंट ने उनका साथ मुश्किल वक्त में भी नही छोड़ा. दुबई में मंगलवार को अगले आईपीएल के लिए हुई नीलामी में वह सौरव गांगुली के साथ टेबल पर मौजूद था.","content":"लाइव अपडेट आईपीएल ऑक्शन 2024 मिचेल स्टार्क ₹ 24.75 ( करोड़ ) पैट कमिंस ₹ 20.50 ( करोड़ ) डेरिल मिशेल ₹ 14.00 ( करोड़ ) हर्षल पटेल ₹ 11.75 ( करोड़ ) अल्जारी जोसेफ ₹ 11.50 ( करोड़ ) स्पेंसर जॉनसन ₹ 10.00 ( करोड़ ) समीर रिज़वी ₹ 8.40 ( करोड़ ) रिले रोसौव ₹ 8.00 ( करोड़ ) शाहरुख खान ₹ 7.40 ( करोड़ ) रोवमैन पॉवेल ₹ 7.40 ( करोड़ ) दिल्ली कैपिटल्स की टीम में शामिल हुआ धोनी के गढ़ से आया विकेटकीपर बैटर -AP नई दिल्ली. इंडियन प्रीमियर लीग 2024 के नए सीजन से पहले मिनी ऑक्शन दुबई में आयोजित किया गया. टूर्नामेंट में भाग लेने वाली सभी 10 टीमों ने अपने मनपसंद खिलाड़ी पर जमकर बोली लगाई और उसे हासिल किया. अनकैप्ड खिलाड़ियों पर इस ऑक्शन में टीम ने बढ़ चढ़कर बोली लगाई. दिल्ली कैपिटल्स ने एक ऐसे युवा पर पैसे लगाए जिसने घरेलू क्रिकेट में धमाकेदार पारी से इतिहास रचा था. इंडियन प्रीमियर लीग की युवाओं टीम मानी जाने वाले दिल्ली कैपिटल्स ने एक बार फिर से नई प्रतिभा पर भरोसा जताया है. ऋषभ पंत को टीम का कप्तान बनाने के बाद टीम मैनेजमेंट ने उनका साथ मुश्किल वक्त में भी नही छोड़ा. दुबई में मंगलवार को अगले आईपीएल के लिए हुई नीलामी में वह सौरव गांगुली के साथ टेबल पर मौजूद था. Talented keeper who hits the ball hard. It’s a DC thing #YehHaiNayiDilli #IPLAuction pic.twitter.com/jZBRNjurEI — Delhi Capitals (@DelhiCapitals) December 19, 2023 पंत की कप्तानी वाली दिल्ली कैपिटल्स (Delhi Capitals) ने महेंद्र सिंह धोनी के गढ़ झारखंड के एक युवा प्रतिभा पर दांव लगाया है. विकेटकीपर बल्लेबाज कुमार कुशाग्र 20 लाख के बेस प्राइस के साथ नीलामी में शामिल हुए थे और उनको दिल्ली ने 7 करोड़ 20 लाख की मोटी रकम से अपनी टीम में शामिल किया. 18 साल की उम्र में रचा इतिहास कुमार कुशाग्र ने महज 18 साल की उम्र में झारखंड की तरफ से खेलते हुए रणजी ट्रॉफी में 250 रन की पारी खेल डाली थी. नागालैंड के खिलाफ 2022 में वह ऐसा करते हुए टूर्नामेंट के इतिहास में सबसे कम उम्र में 250 रन बनाने वाले बैटर बने थे. 2023 सैयद मुश्ताक अली ट्रॉफी में उन्होंने कुल 111 रन बनाए थे. . Tags: Delhi Capitals , IPL 2024 , Ms dhoni , Rishabh Pant हीरोगिरी निकली फुस्स.... तो थामा खलनायकी का दामन, 3 स्टार्स चॉकलेटी बॉय से बने 'बैडमैन', अब हीरो की निकाल रहे हेकड़ी पहले बनीं एक्साइज इंस्पेक्टर, फिर दो दिन बाद SDM, 26वीं रैंक से पास की यूपी PCS परीक्षा 3 एक्ट्रेस पर फिदा था दाऊद इब्राहिम, 1 का करियर हुआ तबाह, दूसरी का नहीं कोई अता-पता, तीसरी का बम ब्लास्ट में आया नाम लाइव ब्लॉग 21 hours ago a day ago 2 days ago 3 days ago","pubDate":"2023-12-20 00:16:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/delhi-capitals-in-ipl-2023-2023-12-ea5603bcafca3bd77f1c3921c33d2719-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"348e6e7e447d4766520a40920a0ce9b6","title":"England's Salt blasts 119 in record-breaking T20 win","link":"https://thewest.com.au/sport/cricket/englands-salt-blasts-119-in-record-breaking-t20-win-c-12964291","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Phil Salt has blasted a second T20 century in as many matches as England levelled their five-game T20 series at 2-2 with a 75-run win against West Indies.","content":"Phil Salt has produced another epic century hours after his Indian Premier League snub as England racked up their highest-ever T20 score to send their series against West Indies to a decider. Overlooked at Tuesday's IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt's form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls on Wednesday (AEDT). The innings underpinned England's gargantuan 3-267, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with 3-37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman, while he is the first male from his country with two three-figure scores in the format. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler (55) registered his second successive half-century during an opening stand worth 117 in 9.5 overs. Will Jacks chipped in with 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone (54 not out off 21 balls) quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King's top edge and looped to Reece Topley, who took a fine catch at short third man. Boundaries were not hard to come by in the chase as the hosts hit 14 sixes of their own, but England's bowlers kept making breakthroughs. Nicholas Pooran (39) and Sherfane Rutherford (36) threatened briefly, while Andre Russell clattered 51 off 25 balls before he was last batter out.","pubDate":"2023-12-20 00:02:56","image_url":"https://images.thewest.com.au/publication/C-12964291/c9a1de070fb14b4decc1fd9b4667624524cf4421-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f01ba36708475d5b265d3929644ae2f5","title":"Phil Salt blasts century to lead England to record-breaking win","link":"https://www.independent.co.uk/sport/cricket/phil-salt-sam-curran-england-reece-topley-t20-b2466944.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The opener’s second successive ton set up a total of 267, England’s best in T20s, and a 75-run success.","content":"Phil Salt produced another epic century hours after his Indian Premier League snub as England racked up their highest-ever T20 score to send their series against the West Indies to a decider. Overlooked at Tuesday’s IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt’s form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls. The innings underpinned England’s gargantuan 267 for three, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with three for 37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman while he is the first male from his country with two three-figure scores in the format as he helped set up a winner-takes-all showdown at the same venue on Thursday. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler registered his second successive half-century, thumping three sixes before holing out going for a fourth after contributing 55 to an opening stand worth 117 in 9.5 overs. The wicket did not bring a halt to the onslaught as the Windies may have hoped as the first three balls of the next over from Sherfane Rutherford were hit over the leg-side rope by a free-flowing Salt. Will Jacks chipped in 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. Livingstone briefly threatened six sixes in an over after the wayward Forde, who conceded 54 in 18 deliveries, saw his first three balls travel the distance before he finally got one in the blockhole. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. He got himself in a tangle against Andre Russell and saw the ball sail between his legs before castling him, although Livingstone finished on 54 not out off 21 balls after taking three fours off Jason Holder. Both Holder and Gudakesh Motie conceded 55 while Akeal Hosein was the only member of the Windies side who bowled more than one over and kept their economy rate under 10. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King’s top edge and looped to Reece Topley, who took a fine leaping catch at short third. Boundaries were not hard to come by in the chase as the Windies collected 14 sixes of their own and all of England’s bowlers came in for punishment, but they kept making breakthroughs in the batting. Pooran (39) and Rutherford (36) threatened briefly while Russell clattered 51 off 25 balls before he was last batter out, attempting to take down Topley but caught by Brook running in from long-off.","pubDate":"2023-12-19 23:53:02","image_url":"https://static.independent.co.uk/2023/12/19/23/19-4c451c71819041de964495973d916879.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ebea3d91162400f799bfed56042e253","title":"IPL auction: Seven West Aussies get snapped up ahead of 2024 season","link":"https://www.perthnow.com.au/sport/cricket/ipl-auction-seven-west-aussies-get-snapped-up-ahead-of-2024-season-c-12963962","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on.","content":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on. A whopping seven West Aussies were snapped up at the auction for the lucrative Twenty20 competition, reflecting WA cricket’s dominance across several years. WA products represented almost half of the 16 Aussies whose names were called out, with star allrounder Cam Green leading the way after heading to Royal Challengers Bangalore for the handsome sum of $3.15m. Lucknow Super Giants will have a strong WA flavour, with new coach Justin Langer having both Marcus Stoinis ($1.7m) and Ashton Turner ($178,000) at his disposal. The signing marks a return to the IPL for Turner for the first time since his stint with Rajasthan in 2019 and is reward for a superb few seasons with the bat and at the helm for the Perth Scorchers in the Big Bash League. Mitch Marsh ($1.2m) returns to Delhi Capitals, alongside Jhye Richardson ($890,000), while Tim David ($1.53m) and Jason Behrendorff ($135,000) will play their trade for Mumbai. It came as newly-minted IPL millionaire Mitchell Starc conceded it could be an “interesting time” for the Australian fast bowling crew in the gym when they reassemble after he and captain Pat Cummins picked up more than $8m in new contracts in a record-setting auction. But the third man in their all-conquering trio, Josh Hazlewood, who had informed teams he would be unavailable early in the tournament due to the impending birth of his first child, was left unsold on the shelf as Starc declared he was in a “fair bit of shock” after becoming the most expensive player in the T20 tournament’s history. Starc was picked up for $4.43m by the Kolkata Knight Riders as he ended his eight-year absence from the tournament, with Cummins going to the Sunrisers Hyderabad for $3.67m. They weren’t the only bowlers given seven-figure deals, with rookie Australian quick Spencer Johnson also picked up for a mammoth $1.78m by the Gujarat Titans. Starc said he was getting updates from his wife, Australia captain Alyssa Healy, who is in India for her own series, and found it hard to believe he was the subject of such an intense bidding war. “I’m not sure any words would do it justice, really,” Starc told Star TV. “Alyssa was over there with the Australian team at the minute, so her coverage was slightly ahead of mine here in Australia. So she sort of saw the numbers before I did, so I was getting the updates through her. But, yeah, a fair bit of shock, and certainly excitement with how it was all unfolding. But nothing that I could’ve ever imagined. “The team chat has been going nuts. The are all saying it’s our shout, so we’ll just go about our business and get ready for the next Test match. But a few of our Australian teammates might be waiting for us to treat them. “It could be an interesting conversation between the bowling group tomorrow and the gym.” Starc has played only two seasons of the IPL - in 2014 and 2015 - and missed the 2018 season with injury before opting to return to the tournament this year, setting off a frenzy among his suitors. “It’s been a long time since I played in IPL in 2014 and ’15 and have obviously played a fair bit of cricket since then,” he said. “So that experience is there and a little bit of leadership if you like, in terms of the experience side of things in white-ball cricket that hopefully I can bring to bring to KKR as well and play my part there.” Travis Head also returns to the IPL and will join Cummins at the Sunrisers on a $1.2m deal. - with News Corp Australia","pubDate":"2023-12-19 23:52:49","image_url":"https://images.perthnow.com.au/publication/C-12963962/035ae455988df250a5e9812ac7ccf2ce6d098cfc-16x9-x753y52w2455h1381.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"45853bb00a3bb4d4dbe03e96422bb45f","title":"IPL auction: Seven West Aussies get snapped up ahead of 2024 season","link":"https://thewest.com.au/sport/cricket/ipl-auction-seven-west-aussies-get-snapped-up-ahead-of-2024-season-c-12963962","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on.","content":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on. A whopping seven West Aussies were snapped up at the auction for the lucrative Twenty20 competition, reflecting WA cricket’s dominance across several years. WA products represented almost half of the 16 Aussies whose names were called out, with star allrounder Cam Green leading the way after heading to Royal Challengers Bangalore for the handsome sum of $3.15m. Lucknow Super Giants will have a strong WA flavour, with new coach Justin Langer having both Marcus Stoinis ($1.7m) and Ashton Turner ($178,000) at his disposal. Jackson Barrett The signing marks a return to the IPL for Turner for the first time since his stint with Rajasthan in 2019 and is reward for a superb few seasons with the bat and at the helm for the Perth Scorchers in the Big Bash League. Mitch Marsh ($1.2m) returns to Delhi Capitals, alongside Jhye Richardson ($890,000), while Tim David ($1.53m) and Jason Behrendorff ($135,000) will play their trade for Mumbai. It came as newly-minted IPL millionaire Mitchell Starc conceded it could be an “interesting time” for the Australian fast bowling crew in the gym when they reassemble after he and captain Pat Cummins picked up more than $8m in new contracts in a record-setting auction. But the third man in their all-conquering trio, Josh Hazlewood, who had informed teams he would be unavailable early in the tournament due to the impending birth of his first child, was left unsold on the shelf as Starc declared he was in a “fair bit of shock” after becoming the most expensive player in the T20 tournament’s history. Starc was picked up for $4.43m by the Kolkata Knight Riders as he ended his eight-year absence from the tournament, with Cummins going to the Sunrisers Hyderabad for $3.67m. They weren’t the only bowlers given seven-figure deals, with rookie Australian quick Spencer Johnson also picked up for a mammoth $1.78m by the Gujarat Titans. Starc said he was getting updates from his wife, Australia captain Alyssa Healy, who is in India for her own series, and found it hard to believe he was the subject of such an intense bidding war. “I’m not sure any words would do it justice, really,” Starc told Star TV. “Alyssa was over there with the Australian team at the minute, so her coverage was slightly ahead of mine here in Australia. So she sort of saw the numbers before I did, so I was getting the updates through her. But, yeah, a fair bit of shock, and certainly excitement with how it was all unfolding. But nothing that I could’ve ever imagined. “The team chat has been going nuts. The are all saying it’s our shout, so we’ll just go about our business and get ready for the next Test match. But a few of our Australian teammates might be waiting for us to treat them. “It could be an interesting conversation between the bowling group tomorrow and the gym.” Starc has played only two seasons of the IPL - in 2014 and 2015 - and missed the 2018 season with injury before opting to return to the tournament this year, setting off a frenzy among his suitors. “It’s been a long time since I played in IPL in 2014 and ’15 and have obviously played a fair bit of cricket since then,” he said. “So that experience is there and a little bit of leadership if you like, in terms of the experience side of things in white-ball cricket that hopefully I can bring to bring to KKR as well and play my part there.” Travis Head also returns to the IPL and will join Cummins at the Sunrisers on a $1.2m deal. - with News Corp Australia","pubDate":"2023-12-19 23:52:49","image_url":"https://images.thewest.com.au/publication/C-12963962/035ae455988df250a5e9812ac7ccf2ce6d098cfc-16x9-x753y52w2455h1381.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"34ee3876b54b22391fbf130a4bdcd8cc","title":"Phil Salt blasts century to lead England to record-breaking win","link":"https://www.watfordobserver.co.uk/sport/national/24001485.phil-salt-blasts-century-lead-england-record-breaking-win/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The opener’s second successive ton set up a total of 267, England’s best in T20s, and a 75-run success.","content":"Overlooked at Tuesday’s IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt’s form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls. The innings underpinned England’s gargantuan 267 for three, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. WOW!! Back-to-back !! 💯💯 Scorecard: | — England Cricket (@englandcricket) Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with three for 37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman while he is the first male from his country with two three-figure scores in the format as he helped set up a winner-takes-all showdown at the same venue on Thursday. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler registered his second successive half-century, thumping three sixes before holing out going for a fourth after contributing 55 to an opening stand worth 117 in 9.5 overs. The wicket did not bring a halt to the onslaught as the Windies may have hoped as the first three balls of the next over from Sherfane Rutherford were hit over the leg-side rope by a free-flowing Salt. Will Jacks chipped in 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. Livingstone briefly threatened six sixes in an over after the wayward Forde, who conceded 54 in 18 deliveries, saw his first three balls travel the distance before he finally got one in the blockhole. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. He got himself in a tangle against Andre Russell and saw the ball sail between his legs before castling him, although Livingstone finished on 54 not out off 21 balls after taking three fours off Jason Holder. Both Holder and Gudakesh Motie conceded 55 while Akeal Hosein was the only member of the Windies side who bowled more than one over and kept their economy rate under 10. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King’s top edge and looped to Reece Topley, who took a fine leaping catch at short third. Boundaries were not hard to come by in the chase as the Windies collected 14 sixes of their own and all of England’s bowlers came in for punishment, but they kept making breakthroughs in the batting. Pooran (39) and Rutherford (36) threatened briefly while Russell clattered 51 off 25 balls before he was last batter out, attempting to take down Topley but caught by Brook running in from long-off.","pubDate":"2023-12-19 23:41:32","image_url":"https://www.watfordobserver.co.uk/resources/images/17570075/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ffcc23d8b404255997ea0c0d1715ef91","title":"Super Salt fires England to win against West Indies to square T20 series","link":"https://www.channelnewsasia.com/sport/super-salt-fires-england-win-against-west-indies-square-t20-series-4000586","keywords":["Sport"],"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 :Phil Salt smashed a magnificent record-breaking century in England's highest-ever T20 international total as they romped to a 75-run win against West Indies to square the series in a spellbinding match in Tarouba on Tuesday. Salt thumped 119 off 57 balls as England tore into the West Indies attack to make 267-3 - surpassing their previous highest T20 total of 241 against New Zealand in 2019. Ten sixes flew off Salt's bat as well as seven fours as he hit the highest total by an England men's batsman in T20, eclipsing the 116 by Alex Hales in 2014. Captain Jos Buttler and Liam Livingstone joined the party with quickfire half centuries. Buttler's 55 came off 29 balls with his three sixes making him the English batsman with the most sixes in T20 internationals - 123 in total. Salt also struck a belligerent 109 not out in the third match of the series to deny West Indies a 3-0 series lead and he proved unstoppable again. \"I am definitely enjoying it. It's a cool place to come and tour and play cricket,\" Salt said. \"The boys have produced the goods in the last few games and now we have the decider to look forward to.\" The series is now locked at 2-2 with Thursday's climax to come. In reply to England's huge total, West Indies lost opener Brandon King off the opening ball bowled by Moeen Ali but reacted in dazzling fashion with some sensational hitting to stay above the required run rate although wickets fell at regular intervals. Nicholas Pooran hit 20 off the first over after King's dismissal and made 39 off 15 balls before falling to a brilliant running catch by Harry Brook off Sam Curran's bowling. Sherfane Rutherford also blazed away in spectacular fashion as West Indies brought up the 100 in the seventh over but their chase was doomed to failure as wickets tumbled. Rutherford fell lbw to Rehan Ahmed for 36 off 15 deliveries and from then on their chances of an unlikely victory faded. Andre Russell made sure West Indies went down swinging as he clouted 51 in a desperate last stand but was eventually out to a steepling catch by Brook to give Topley a third wicket. An incredible match contained 33 sixes and the fireworks could continue in the decider. \"The boys like a final it seems! We will come with brand new ideas and plans and see if we can entertain our fans at home,\" West Indies skipper Rovman Powell said. \"We have failed to close out the series from a good position but Thursday is an opportunity to do that.\"","pubDate":"2023-12-19 23:38:40","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"98220862327849aa678448df6e33f679","title":"England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls","link":"https://www.dailymail.co.uk/sport/cricket/article-12883413/England-hit-record-267-beat-West-Indies-set-T20-series-decider-Phil-Salt-smashing-century-Rehan-Ahmed-taking-two-wickets-two-balls.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Timing is everything. Had the Indian Premier League auction been held in Dubai on Wednesday morning, Phil Salt would arguably be waking up a millionaire.","content":"England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls By Richard Gibson for the Daily Mail Published: 18:30 EST, 19 December 2023 | Updated: 18:32 EST, 19 December 2023 e-mail View comments Timing is everything. Had the Indian Premier League auction been held in Dubai on Wednesday morning, Phil Salt would arguably be waking up a millionaire. Unsold on Tuesday, he responded to his snub by hitting England’s highest Twenty20 score on an evening of carnage in the Caribbean. In smashing 119 from 57 balls, Salt also became the first England batsman to hit back-to-back hundreds in the format, following the unbeaten 109 on Saturday that maintained hopes of a comeback series victory for Jos Buttler ’s team. It is form that has also thrown into question the judgement of the ECB bosses who deemed him unworthy of a central contract at the start of this winter. England won by a 75-run margin to set up a decider back at the Brian Lara Cricket Academy, although the result was all-but confirmed by the time Salt was yorked by Andre Russell in the 19th over. Russell had begun it by serving up five leg-side wides to propel England beyond their previous-best Twenty20 total of 241 for three versus New Zealand in Napier four years ago. Salt struck an England-high 10 sixes in all, including three muscular pulls in a row off Sherfane Rutherford’s medium pace, sharing 117 for the wicket with Jos Buttler in the first half of the innings, 56 off just 23 balls with Will Jacks and a further 73 off 29 with Liam Livingstone. Buttler and Livingstone also celebrated half-centuries on an evening of English dominance. The only moments of concern in another short-form masterclass by the Lancashire player came when he nicked left-arm spinner Gudakesh Motie wide of wicketkeeper Nicholas Pooran on 39, and on 93 when Rovman Powell’s shy at the non-striker’s end whistled past the stumps. His three figures came up from 48 deliveries in partnership with Livingstone, who targeted debutant Matthew Forde, clearing the rope three times in succession, and then put the finishing touches to the second biggest T20 total made by a Test nation against another, flashing Jason Holder for a trio of fours at the death to set the West Indies the challenge of scoring at more than 13 runs an over. That task was put into context by the fact that the only successful 200-plus chase in internationals on West Indies soil was England’s seven-wicket pursuit of 223 in Grenada at the weekend. Salt took the gloves to allow England captain Buttler to direct things like from mid-off. It must have felt like air traffic control as West Indies made a rollicking start of their own, overcoming the loss of Brandon King first ball to power 87 runs from the six power-play overs. The caveat was that England held three skiers in that period, Harry Brook taking the pick of them - a sprawling effort following a 30-yard hurtle from long-on - to end Nicholas Pooran’s 15-ball 39. The hosts kept their foot to the floor, but two wickets in as many balls from the recalled Rehan Ahmed left them 120-7 in the ninth over and made the 40-run stand for the eighth wicket between top scorer Russell and Akeal Hosein, the biggest of the innings, no more than an entertaining last chapter in another big-hitting story. This is the first five-match bilateral series to feature 100 sixes and with Salt and England now hitting a fairer share of them it is all to play for in Thursday’s finale. Jos Buttler Dubai Premier League Share or comment on this article: England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-19 23:30:15","image_url":"https://i.dailymail.co.uk/1s/2023/12/19/23/79150195-0-image-m-56_1703028334180.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"43106fce5d8fbd61b75f5ec30215aac2","title":"‘Us versus them’: The states winning the battle for the baggy green","link":"https://www.theage.com.au/sport/cricket/us-versus-them-the-states-winning-the-battle-for-the-baggy-green-20231127-p5en5f.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Twenty years ago, David Hookes made a famous quip about NSW and brown paper bags. But do the Blues still dominate national selection? We’ve crunched the numbers to find out.","content":"“When they give out the baggy blue cap in New South Wales, they give you a baggy green in a brown paper bag as well to save making two presentations.” – October 14, 2003. Twenty years ago, the late David Hookes, who was coach of Victoria at the time, offered this immortal assessment of Test selection for the Australian men’s team. For the record, it was said in the context of a NSW left-arm seamer, Nathan Bracken, getting picked in front of a Victorian, Mathew Inness, for a Test squad to face Zimbabwe in Sydney. Two decades on, does Hookes’ hot take still hold up? This masthead has compiled state-by-state selection figures for the past 20 years, showing that the spread of baggy green caps has widened considerably. Over that period, 20 players have been picked from a NSW background, 19 from Victoria, 12 from Western Australia, 11 from Queensland, 10 from South Australia and nine from Tasmania. NSW, then, is not exactly dominating the debutants list – and has had only three new baggy green caps since 2014. Looked at in terms of Test match tenures, however, there is no debate: the baggy Blues still provide the bulk of the team’s long-term players. Over those 20 years, the 20 NSW players have played a combined 775 Tests between them, an average of nearly 40 Tests each. By contrast, the 19 Victorians played just 212 Tests, or around 11 matches apiece. Queensland (30 matches on average per player) and WA (22 per player) have fared somewhat better, because of long careers for a few in both past and current crops. But the overall figures make it abundantly clear that the historical supremacy of NSW as the primary breeding ground for top Test talent has carried on beyond Hookes’ moment of sharp observation. In all-time terms, this has meant that NSW-grown players comprise seven of the top 10 run scorers (11 of the top 20) and five of the top 10 wicket-takers (10 of the top 20). The 21st bowler, Geoff Lawson, and the 21st batter, Usman Khawaja, were also both NSW cricket products. For the purposes of compiling the data, we regarded the state of origin as the one the player represented at the time they were picked for Australia. Hence Nathan Lyon and his 500 Test wickets are products of South Australia, where he was a budding off-spinner and part of the Adelaide Oval ground staff before moving to NSW later in his career. For Lawson, now a NSW selector, the numbers demonstrate that his state has long excelled at producing players best rounded for international cricket because of the need to cope with pace, swing and spin on junior, club and first-class surfaces in Sydney. “Players who play spin well in Australia tend to adapt to faster wickets rather than the other way round,” Lawson said. “That’s why Western Australians would come to Sydney and go ‘we can’t play on that s---heap, that’s terrible’, but when people went to Perth, no one said ‘oh we’ve got to play on this bouncing, cracked minefield’. “They had a huge advantage over there, but their complaint was that they had to play on a spinning wicket. Not many West Australians in the 1980s had long Test careers. Kim Hughes was good against spin so he played a few more. Guys like Graeme Wood did well opening the batting and did OK against the Windies, but didn’t make many runs against spin. “When you did tour overseas, a lot of those guys didn’t have the skills to handle it because they had played in those Perth conditions. But certainly people who play on slower wickets that spin can adapt more when the wickets get quicker. That was a great thing about Australian cricket – different pitches everywhere.” For David Hussey, one of the talented Victorians Hookes felt should have received a more rapid call-up to the Australian limited overs teams and who never cracked the Test side, the difference was evident as he came through the ranks in WA before moving to Melbourne. “Playing 17s, 19s and second XI, when we used to play NSW, and this is just me, but I always thought they were better batters than us,” Hussey said. “They were more rounded batters, better players of fast bowling, better players of spin and they had this inner belief, these NSW players, that they were the best and they were always going to be international players. “I guess you could say that was a poor mindset from an interstater, or from a Victoria person or a WA person, but it is slowly changing. “I believe over the next three or four years when some of the greats like [Mitchell] Starc, [Josh] Hazlewood, [David] Warner, [Steve] Smith, [Pat] Cummins, Khawaja all leave, there’s going to be huge opportunities for all players around Australia to get a long go in Test cricket. I wouldn’t be surprised if a few WA players get in there and have an extended time in the Test team.” Bracken’s Test career lasted two years and five Tests, but he enjoyed an illustrious ODI career of 116 matches, including a role in Australia’s triumphant 2007 World Cup campaign. Inness, a fast and big-hearted left-armer, did not make a national squad. The respected fitness guru has recently joined AFL club West Coast as high-performance manager after a long stint at the Western Bulldogs. The perceived injustices in national selection did not end there, and Hookes’ comments tapped into a parochial view that Victorian players were hard done by. Brad Hodge, dropped after six Tests, was the poster boy for this argument. Peter Handscomb (20 Tests) is the only Victorian batter to have enjoyed an extended run in the Test side since, and he is now considered a subcontinent specialist. “We always thought if there was a 50/50 selection call it always went to another player rather than a Victorian player, and that used to get us down a little bit,” Hussey said. “But that was the environment that was created, us versus them, and Hookesy was always going into bat for us. “That was Hookesy in a nutshell, he was us against the world. When he spoke about the baggy green in the brown paper bag, I took it as him going into bat for our players, the Brad Hodges, the Matthew Elliotts, Mathew Inness, to play for Australia. He was backing his players, and everyone got a lot of confidence out of Hookesy saying those words publicly.” However, Victoria has done a much better job at producing white-ball players in the 20 years since Hookes’ baggy blue remark. Our data shows 19 players have been picked from Victoria – equal with WA – for a whopping 1247 matches, more than double WA’s 527 matches. Here, thanks largely to the brilliant careers of former white-ball captain Aaron Finch and World Cup hero Glenn Maxwell, Victoria puts NSW in the shade. The Blues have produced 14 ODI debutants in the past 20 years for 797 matches. One of Hussey’s great rivals for a spot in the Australian Test side was Simon Katich, who played his early cricket in WA before moving to Sydney. He can recall the sniggering from both north and south of NSW about how he first became established in the Australian side after joining the Blues. But tellingly, he also recalls that he made the move to become a more rounded player, something that helped him perform overseas. “I know a lot of people speculate that, but I never thought by going there [it would get me in the Test team],” Katich said. “I’d played a Test match by playing for WA in 2001 Ashes, so I never thought of it like that. “When I look back it was purely that I wanted to go there to not have any regrets later in my career and to improve my bowling, because I knew I wasn’t going to bowl much in Perth, and I knew I had to get better at playing spin.” What is unknown, of course, is where things go after the current, dominant NSW generation departs the Test team, starting with Warner after the SCG Test in January. For Lawson, the continuation of the NSW dynasty Hookes battled against will depend as much on conditions underfoot as talent in the eyes, hands and feet. “Partly it is a function of the way the game is played now,” Lawson said. “Because they play so much international cricket, they virtually don’t play state cricket. That means they’re always fit and ready for the international team and get looked after physically and mentally so they can play longer. That means there are fewer spots available. “We’ve got to turn over our state players as well, which hasn’t happened much. Playing professional cricket is a good gig, no one wants to give it up – everyone wants to stay longer, because that’s what they do for a living. “We’ll go to Sam Konstas, Ollie Davies and Blake Nikitaras – they’re the next group who’ve got to get out there and play, they’ve all got talent. You’ve got to get them into first-class cricket, then produce some pitches that help teach them to play normally. There’s no point putting them on these pitches that seam all over the place.” Come back tomorrow part two in our series. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-20 00:32:57","image_url":"https://static.ffx.io/images/$zoom_0.16153992678076973%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_jpg/e99d396f5ed5a4f12ade483b21ebcf6e48158e96","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c22973ba9bc26250b77884bd760036ea","title":"Prominent cricket commentator Isa Guha issues classy response to Joey Barton’s polarising claims","link":"https://7news.com.au/sport/cricket/prominent-cricket-commentator-isa-guha-issues-classy-response-to-joey-bartons-polarising-claims-c-12963390","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"‘I’ve been thinking lately.’","content":"Prominent commentator Isa Guha has issued a classy response to inflammatory and misogynistic suggestions that women shouldn’t cover men’s sport. Polarising former English Joey Barton caused a storm that reverberated around the globe earlier this month when he told UK shock jock Piers Morgan that females don’t belong on the coverage of male sport. The jarring and wildly offensive opinion was met with widespread blowback, but that didn’t bother the former EPL midfielder, who doubled down on his vile comments just days later. “It’s a completely different game,” Barton said of women’s football. “If you don’t accept that, we will always see things differently. “The women’s game is thriving. Fantastic to see. (But) I cannot take a thing they say serious in the men’s arena.” Guha, an accomplished cricket broadcaster who played 113 internationals for England across all three formats of the game, has become a star of UK and Australian television during her already decorated media career. She started appearing on screens just months after he retirement from the game in 2011, contributing to UK broadcaster ITV4’s coverage of the 2012 IPL. The 38-year-old, whose parents emigrated from India before she was born, has also become a polished radio caller, and has written sports columns for the BBC. In a lengthy Instagram post on Tuesday night, Guha detailed her gratitude for being in the position she is, and the hard work it took her to get there. “I’ve been thinking lately of how grateful I am to be able to cover sport, because I guess it hasn’t always been attainable,” she wrote. “I’m aware of the recent comments in the UK that women shouldn’t work on men’s sport, and people voicing differing opinions around the matter.“When I first started, I was pretty green and I remember the comments then. But my bosses backed me against the noise and when I made plenty of mistakes. As a result, I wanted to repay them by learning as much and as quickly as possible.” She said the diversity of her colleagues is “what makes it special” to broadcast sport. “But I hope that as time moves on, there is more focus on everyone enjoying sport rather than their gender or background.” Guha implicitly dismissed Barton’s comments with typical grace, and celebrated cricket’s trailblazing commitment to amplifying females’ voices in both men’s and women’s sport. “Cricket has led the way with many female voices and I’m grateful that many of our peers and colleagues have always given us the support/space and backing to fulfil our roles,” she wrote. “While there will always be exceptions, I’ve always felt it’s more important to acknowledge those that raise us up rather than those that don’t.“My opinion is that women can work on men’s sport just as men can work on women’s sport as pundits/presenters/commentators. But either way, let’s give people exactly the same patience and support to learn and thrive.”","pubDate":"2023-12-20 00:30:38","image_url":"https://images.7news.com.au/publication/C-12963390/794502145043e1c41dab8bfce8d96e4a866a3cbb-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"556549b7e34dbc014bb443793656d3ad","title":"18 साल की उम्र में ठोके 250 रन, धोनी के गढ़ के विकेटकीपर पर DC ने लुटाए पैसे","link":"https://hindi.news18.com/cricket/ipl-2024-auction-delhi-capitals-takes-kumar-kushagra-from-ms-dhoni-state-jharkhan-play-for-rishab-pant-7915687.html","keywords":null,"creator":null,"video_url":null,"description":"इंडियन प्रीमियर लीग की युवाओं टीम मानी जाने वाले दिल्ली कैपिटल्स ने एक बार फिर से नई प्रतिभा पर भरोसा जताया है. ऋषभ पंत को टीम का कप्तान बनाने के बाद टीम मैनेजमेंट ने उनका साथ मुश्किल वक्त में भी नही छोड़ा. दुबई में मंगलवार को अगले आईपीएल के लिए हुई नीलामी में वह सौरव गांगुली के साथ टेबल पर मौजूद था.","content":"लाइव अपडेट आईपीएल ऑक्शन 2024 मिचेल स्टार्क ₹ 24.75 ( करोड़ ) पैट कमिंस ₹ 20.50 ( करोड़ ) डेरिल मिशेल ₹ 14.00 ( करोड़ ) हर्षल पटेल ₹ 11.75 ( करोड़ ) अल्जारी जोसेफ ₹ 11.50 ( करोड़ ) स्पेंसर जॉनसन ₹ 10.00 ( करोड़ ) समीर रिज़वी ₹ 8.40 ( करोड़ ) रिले रोसौव ₹ 8.00 ( करोड़ ) शाहरुख खान ₹ 7.40 ( करोड़ ) रोवमैन पॉवेल ₹ 7.40 ( करोड़ ) दिल्ली कैपिटल्स की टीम में शामिल हुआ धोनी के गढ़ से आया विकेटकीपर बैटर -AP नई दिल्ली. इंडियन प्रीमियर लीग 2024 के नए सीजन से पहले मिनी ऑक्शन दुबई में आयोजित किया गया. टूर्नामेंट में भाग लेने वाली सभी 10 टीमों ने अपने मनपसंद खिलाड़ी पर जमकर बोली लगाई और उसे हासिल किया. अनकैप्ड खिलाड़ियों पर इस ऑक्शन में टीम ने बढ़ चढ़कर बोली लगाई. दिल्ली कैपिटल्स ने एक ऐसे युवा पर पैसे लगाए जिसने घरेलू क्रिकेट में धमाकेदार पारी से इतिहास रचा था. इंडियन प्रीमियर लीग की युवाओं टीम मानी जाने वाले दिल्ली कैपिटल्स ने एक बार फिर से नई प्रतिभा पर भरोसा जताया है. ऋषभ पंत को टीम का कप्तान बनाने के बाद टीम मैनेजमेंट ने उनका साथ मुश्किल वक्त में भी नही छोड़ा. दुबई में मंगलवार को अगले आईपीएल के लिए हुई नीलामी में वह सौरव गांगुली के साथ टेबल पर मौजूद था. Talented keeper who hits the ball hard. It’s a DC thing #YehHaiNayiDilli #IPLAuction pic.twitter.com/jZBRNjurEI — Delhi Capitals (@DelhiCapitals) December 19, 2023 पंत की कप्तानी वाली दिल्ली कैपिटल्स (Delhi Capitals) ने महेंद्र सिंह धोनी के गढ़ झारखंड के एक युवा प्रतिभा पर दांव लगाया है. विकेटकीपर बल्लेबाज कुमार कुशाग्र 20 लाख के बेस प्राइस के साथ नीलामी में शामिल हुए थे और उनको दिल्ली ने 7 करोड़ 20 लाख की मोटी रकम से अपनी टीम में शामिल किया. 18 साल की उम्र में रचा इतिहास कुमार कुशाग्र ने महज 18 साल की उम्र में झारखंड की तरफ से खेलते हुए रणजी ट्रॉफी में 250 रन की पारी खेल डाली थी. नागालैंड के खिलाफ 2022 में वह ऐसा करते हुए टूर्नामेंट के इतिहास में सबसे कम उम्र में 250 रन बनाने वाले बैटर बने थे. 2023 सैयद मुश्ताक अली ट्रॉफी में उन्होंने कुल 111 रन बनाए थे. . Tags: Delhi Capitals , IPL 2024 , Ms dhoni , Rishabh Pant हीरोगिरी निकली फुस्स.... तो थामा खलनायकी का दामन, 3 स्टार्स चॉकलेटी बॉय से बने 'बैडमैन', अब हीरो की निकाल रहे हेकड़ी पहले बनीं एक्साइज इंस्पेक्टर, फिर दो दिन बाद SDM, 26वीं रैंक से पास की यूपी PCS परीक्षा 3 एक्ट्रेस पर फिदा था दाऊद इब्राहिम, 1 का करियर हुआ तबाह, दूसरी का नहीं कोई अता-पता, तीसरी का बम ब्लास्ट में आया नाम लाइव ब्लॉग 21 hours ago a day ago 2 days ago 3 days ago","pubDate":"2023-12-20 00:16:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/delhi-capitals-in-ipl-2023-2023-12-ea5603bcafca3bd77f1c3921c33d2719-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"348e6e7e447d4766520a40920a0ce9b6","title":"England's Salt blasts 119 in record-breaking T20 win","link":"https://thewest.com.au/sport/cricket/englands-salt-blasts-119-in-record-breaking-t20-win-c-12964291","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Phil Salt has blasted a second T20 century in as many matches as England levelled their five-game T20 series at 2-2 with a 75-run win against West Indies.","content":"Phil Salt has produced another epic century hours after his Indian Premier League snub as England racked up their highest-ever T20 score to send their series against West Indies to a decider. Overlooked at Tuesday's IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt's form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls on Wednesday (AEDT). The innings underpinned England's gargantuan 3-267, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with 3-37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman, while he is the first male from his country with two three-figure scores in the format. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler (55) registered his second successive half-century during an opening stand worth 117 in 9.5 overs. Will Jacks chipped in with 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone (54 not out off 21 balls) quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King's top edge and looped to Reece Topley, who took a fine catch at short third man. Boundaries were not hard to come by in the chase as the hosts hit 14 sixes of their own, but England's bowlers kept making breakthroughs. Nicholas Pooran (39) and Sherfane Rutherford (36) threatened briefly, while Andre Russell clattered 51 off 25 balls before he was last batter out.","pubDate":"2023-12-20 00:02:56","image_url":"https://images.thewest.com.au/publication/C-12964291/c9a1de070fb14b4decc1fd9b4667624524cf4421-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f01ba36708475d5b265d3929644ae2f5","title":"Phil Salt blasts century to lead England to record-breaking win","link":"https://www.independent.co.uk/sport/cricket/phil-salt-sam-curran-england-reece-topley-t20-b2466944.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The opener’s second successive ton set up a total of 267, England’s best in T20s, and a 75-run success.","content":"Phil Salt produced another epic century hours after his Indian Premier League snub as England racked up their highest-ever T20 score to send their series against the West Indies to a decider. Overlooked at Tuesday’s IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt’s form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls. The innings underpinned England’s gargantuan 267 for three, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with three for 37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman while he is the first male from his country with two three-figure scores in the format as he helped set up a winner-takes-all showdown at the same venue on Thursday. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler registered his second successive half-century, thumping three sixes before holing out going for a fourth after contributing 55 to an opening stand worth 117 in 9.5 overs. The wicket did not bring a halt to the onslaught as the Windies may have hoped as the first three balls of the next over from Sherfane Rutherford were hit over the leg-side rope by a free-flowing Salt. Will Jacks chipped in 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. Livingstone briefly threatened six sixes in an over after the wayward Forde, who conceded 54 in 18 deliveries, saw his first three balls travel the distance before he finally got one in the blockhole. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. He got himself in a tangle against Andre Russell and saw the ball sail between his legs before castling him, although Livingstone finished on 54 not out off 21 balls after taking three fours off Jason Holder. Both Holder and Gudakesh Motie conceded 55 while Akeal Hosein was the only member of the Windies side who bowled more than one over and kept their economy rate under 10. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King’s top edge and looped to Reece Topley, who took a fine leaping catch at short third. Boundaries were not hard to come by in the chase as the Windies collected 14 sixes of their own and all of England’s bowlers came in for punishment, but they kept making breakthroughs in the batting. Pooran (39) and Rutherford (36) threatened briefly while Russell clattered 51 off 25 balls before he was last batter out, attempting to take down Topley but caught by Brook running in from long-off.","pubDate":"2023-12-19 23:53:02","image_url":"https://static.independent.co.uk/2023/12/19/23/19-4c451c71819041de964495973d916879.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ebea3d91162400f799bfed56042e253","title":"IPL auction: Seven West Aussies get snapped up ahead of 2024 season","link":"https://www.perthnow.com.au/sport/cricket/ipl-auction-seven-west-aussies-get-snapped-up-ahead-of-2024-season-c-12963962","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on.","content":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on. A whopping seven West Aussies were snapped up at the auction for the lucrative Twenty20 competition, reflecting WA cricket’s dominance across several years. WA products represented almost half of the 16 Aussies whose names were called out, with star allrounder Cam Green leading the way after heading to Royal Challengers Bangalore for the handsome sum of $3.15m. Lucknow Super Giants will have a strong WA flavour, with new coach Justin Langer having both Marcus Stoinis ($1.7m) and Ashton Turner ($178,000) at his disposal. The signing marks a return to the IPL for Turner for the first time since his stint with Rajasthan in 2019 and is reward for a superb few seasons with the bat and at the helm for the Perth Scorchers in the Big Bash League. Mitch Marsh ($1.2m) returns to Delhi Capitals, alongside Jhye Richardson ($890,000), while Tim David ($1.53m) and Jason Behrendorff ($135,000) will play their trade for Mumbai. It came as newly-minted IPL millionaire Mitchell Starc conceded it could be an “interesting time” for the Australian fast bowling crew in the gym when they reassemble after he and captain Pat Cummins picked up more than $8m in new contracts in a record-setting auction. But the third man in their all-conquering trio, Josh Hazlewood, who had informed teams he would be unavailable early in the tournament due to the impending birth of his first child, was left unsold on the shelf as Starc declared he was in a “fair bit of shock” after becoming the most expensive player in the T20 tournament’s history. Starc was picked up for $4.43m by the Kolkata Knight Riders as he ended his eight-year absence from the tournament, with Cummins going to the Sunrisers Hyderabad for $3.67m. They weren’t the only bowlers given seven-figure deals, with rookie Australian quick Spencer Johnson also picked up for a mammoth $1.78m by the Gujarat Titans. Starc said he was getting updates from his wife, Australia captain Alyssa Healy, who is in India for her own series, and found it hard to believe he was the subject of such an intense bidding war. “I’m not sure any words would do it justice, really,” Starc told Star TV. “Alyssa was over there with the Australian team at the minute, so her coverage was slightly ahead of mine here in Australia. So she sort of saw the numbers before I did, so I was getting the updates through her. But, yeah, a fair bit of shock, and certainly excitement with how it was all unfolding. But nothing that I could’ve ever imagined. “The team chat has been going nuts. The are all saying it’s our shout, so we’ll just go about our business and get ready for the next Test match. But a few of our Australian teammates might be waiting for us to treat them. “It could be an interesting conversation between the bowling group tomorrow and the gym.” Starc has played only two seasons of the IPL - in 2014 and 2015 - and missed the 2018 season with injury before opting to return to the tournament this year, setting off a frenzy among his suitors. “It’s been a long time since I played in IPL in 2014 and ’15 and have obviously played a fair bit of cricket since then,” he said. “So that experience is there and a little bit of leadership if you like, in terms of the experience side of things in white-ball cricket that hopefully I can bring to bring to KKR as well and play my part there.” Travis Head also returns to the IPL and will join Cummins at the Sunrisers on a $1.2m deal. - with News Corp Australia","pubDate":"2023-12-19 23:52:49","image_url":"https://images.perthnow.com.au/publication/C-12963962/035ae455988df250a5e9812ac7ccf2ce6d098cfc-16x9-x753y52w2455h1381.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"45853bb00a3bb4d4dbe03e96422bb45f","title":"IPL auction: Seven West Aussies get snapped up ahead of 2024 season","link":"https://thewest.com.au/sport/cricket/ipl-auction-seven-west-aussies-get-snapped-up-ahead-of-2024-season-c-12963962","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on.","content":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on. A whopping seven West Aussies were snapped up at the auction for the lucrative Twenty20 competition, reflecting WA cricket’s dominance across several years. WA products represented almost half of the 16 Aussies whose names were called out, with star allrounder Cam Green leading the way after heading to Royal Challengers Bangalore for the handsome sum of $3.15m. Lucknow Super Giants will have a strong WA flavour, with new coach Justin Langer having both Marcus Stoinis ($1.7m) and Ashton Turner ($178,000) at his disposal. Jackson Barrett The signing marks a return to the IPL for Turner for the first time since his stint with Rajasthan in 2019 and is reward for a superb few seasons with the bat and at the helm for the Perth Scorchers in the Big Bash League. Mitch Marsh ($1.2m) returns to Delhi Capitals, alongside Jhye Richardson ($890,000), while Tim David ($1.53m) and Jason Behrendorff ($135,000) will play their trade for Mumbai. It came as newly-minted IPL millionaire Mitchell Starc conceded it could be an “interesting time” for the Australian fast bowling crew in the gym when they reassemble after he and captain Pat Cummins picked up more than $8m in new contracts in a record-setting auction. But the third man in their all-conquering trio, Josh Hazlewood, who had informed teams he would be unavailable early in the tournament due to the impending birth of his first child, was left unsold on the shelf as Starc declared he was in a “fair bit of shock” after becoming the most expensive player in the T20 tournament’s history. Starc was picked up for $4.43m by the Kolkata Knight Riders as he ended his eight-year absence from the tournament, with Cummins going to the Sunrisers Hyderabad for $3.67m. They weren’t the only bowlers given seven-figure deals, with rookie Australian quick Spencer Johnson also picked up for a mammoth $1.78m by the Gujarat Titans. Starc said he was getting updates from his wife, Australia captain Alyssa Healy, who is in India for her own series, and found it hard to believe he was the subject of such an intense bidding war. “I’m not sure any words would do it justice, really,” Starc told Star TV. “Alyssa was over there with the Australian team at the minute, so her coverage was slightly ahead of mine here in Australia. So she sort of saw the numbers before I did, so I was getting the updates through her. But, yeah, a fair bit of shock, and certainly excitement with how it was all unfolding. But nothing that I could’ve ever imagined. “The team chat has been going nuts. The are all saying it’s our shout, so we’ll just go about our business and get ready for the next Test match. But a few of our Australian teammates might be waiting for us to treat them. “It could be an interesting conversation between the bowling group tomorrow and the gym.” Starc has played only two seasons of the IPL - in 2014 and 2015 - and missed the 2018 season with injury before opting to return to the tournament this year, setting off a frenzy among his suitors. “It’s been a long time since I played in IPL in 2014 and ’15 and have obviously played a fair bit of cricket since then,” he said. “So that experience is there and a little bit of leadership if you like, in terms of the experience side of things in white-ball cricket that hopefully I can bring to bring to KKR as well and play my part there.” Travis Head also returns to the IPL and will join Cummins at the Sunrisers on a $1.2m deal. - with News Corp Australia","pubDate":"2023-12-19 23:52:49","image_url":"https://images.thewest.com.au/publication/C-12963962/035ae455988df250a5e9812ac7ccf2ce6d098cfc-16x9-x753y52w2455h1381.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"34ee3876b54b22391fbf130a4bdcd8cc","title":"Phil Salt blasts century to lead England to record-breaking win","link":"https://www.watfordobserver.co.uk/sport/national/24001485.phil-salt-blasts-century-lead-england-record-breaking-win/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The opener’s second successive ton set up a total of 267, England’s best in T20s, and a 75-run success.","content":"Overlooked at Tuesday’s IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt’s form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls. The innings underpinned England’s gargantuan 267 for three, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. WOW!! Back-to-back !! 💯💯 Scorecard: | — England Cricket (@englandcricket) Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with three for 37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman while he is the first male from his country with two three-figure scores in the format as he helped set up a winner-takes-all showdown at the same venue on Thursday. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler registered his second successive half-century, thumping three sixes before holing out going for a fourth after contributing 55 to an opening stand worth 117 in 9.5 overs. The wicket did not bring a halt to the onslaught as the Windies may have hoped as the first three balls of the next over from Sherfane Rutherford were hit over the leg-side rope by a free-flowing Salt. Will Jacks chipped in 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. Livingstone briefly threatened six sixes in an over after the wayward Forde, who conceded 54 in 18 deliveries, saw his first three balls travel the distance before he finally got one in the blockhole. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. He got himself in a tangle against Andre Russell and saw the ball sail between his legs before castling him, although Livingstone finished on 54 not out off 21 balls after taking three fours off Jason Holder. Both Holder and Gudakesh Motie conceded 55 while Akeal Hosein was the only member of the Windies side who bowled more than one over and kept their economy rate under 10. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King’s top edge and looped to Reece Topley, who took a fine leaping catch at short third. Boundaries were not hard to come by in the chase as the Windies collected 14 sixes of their own and all of England’s bowlers came in for punishment, but they kept making breakthroughs in the batting. Pooran (39) and Rutherford (36) threatened briefly while Russell clattered 51 off 25 balls before he was last batter out, attempting to take down Topley but caught by Brook running in from long-off.","pubDate":"2023-12-19 23:41:32","image_url":"https://www.watfordobserver.co.uk/resources/images/17570075/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ffcc23d8b404255997ea0c0d1715ef91","title":"Super Salt fires England to win against West Indies to square T20 series","link":"https://www.channelnewsasia.com/sport/super-salt-fires-england-win-against-west-indies-square-t20-series-4000586","keywords":["Sport"],"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 :Phil Salt smashed a magnificent record-breaking century in England's highest-ever T20 international total as they romped to a 75-run win against West Indies to square the series in a spellbinding match in Tarouba on Tuesday. Salt thumped 119 off 57 balls as England tore into the West Indies attack to make 267-3 - surpassing their previous highest T20 total of 241 against New Zealand in 2019. Ten sixes flew off Salt's bat as well as seven fours as he hit the highest total by an England men's batsman in T20, eclipsing the 116 by Alex Hales in 2014. Captain Jos Buttler and Liam Livingstone joined the party with quickfire half centuries. Buttler's 55 came off 29 balls with his three sixes making him the English batsman with the most sixes in T20 internationals - 123 in total. Salt also struck a belligerent 109 not out in the third match of the series to deny West Indies a 3-0 series lead and he proved unstoppable again. \"I am definitely enjoying it. It's a cool place to come and tour and play cricket,\" Salt said. \"The boys have produced the goods in the last few games and now we have the decider to look forward to.\" The series is now locked at 2-2 with Thursday's climax to come. In reply to England's huge total, West Indies lost opener Brandon King off the opening ball bowled by Moeen Ali but reacted in dazzling fashion with some sensational hitting to stay above the required run rate although wickets fell at regular intervals. Nicholas Pooran hit 20 off the first over after King's dismissal and made 39 off 15 balls before falling to a brilliant running catch by Harry Brook off Sam Curran's bowling. Sherfane Rutherford also blazed away in spectacular fashion as West Indies brought up the 100 in the seventh over but their chase was doomed to failure as wickets tumbled. Rutherford fell lbw to Rehan Ahmed for 36 off 15 deliveries and from then on their chances of an unlikely victory faded. Andre Russell made sure West Indies went down swinging as he clouted 51 in a desperate last stand but was eventually out to a steepling catch by Brook to give Topley a third wicket. An incredible match contained 33 sixes and the fireworks could continue in the decider. \"The boys like a final it seems! We will come with brand new ideas and plans and see if we can entertain our fans at home,\" West Indies skipper Rovman Powell said. \"We have failed to close out the series from a good position but Thursday is an opportunity to do that.\"","pubDate":"2023-12-19 23:38:40","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"98220862327849aa678448df6e33f679","title":"England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls","link":"https://www.dailymail.co.uk/sport/cricket/article-12883413/England-hit-record-267-beat-West-Indies-set-T20-series-decider-Phil-Salt-smashing-century-Rehan-Ahmed-taking-two-wickets-two-balls.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Timing is everything. Had the Indian Premier League auction been held in Dubai on Wednesday morning, Phil Salt would arguably be waking up a millionaire.","content":"England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls By Richard Gibson for the Daily Mail Published: 18:30 EST, 19 December 2023 | Updated: 18:32 EST, 19 December 2023 e-mail View comments Timing is everything. Had the Indian Premier League auction been held in Dubai on Wednesday morning, Phil Salt would arguably be waking up a millionaire. Unsold on Tuesday, he responded to his snub by hitting England’s highest Twenty20 score on an evening of carnage in the Caribbean. In smashing 119 from 57 balls, Salt also became the first England batsman to hit back-to-back hundreds in the format, following the unbeaten 109 on Saturday that maintained hopes of a comeback series victory for Jos Buttler ’s team. It is form that has also thrown into question the judgement of the ECB bosses who deemed him unworthy of a central contract at the start of this winter. England won by a 75-run margin to set up a decider back at the Brian Lara Cricket Academy, although the result was all-but confirmed by the time Salt was yorked by Andre Russell in the 19th over. Russell had begun it by serving up five leg-side wides to propel England beyond their previous-best Twenty20 total of 241 for three versus New Zealand in Napier four years ago. Salt struck an England-high 10 sixes in all, including three muscular pulls in a row off Sherfane Rutherford’s medium pace, sharing 117 for the wicket with Jos Buttler in the first half of the innings, 56 off just 23 balls with Will Jacks and a further 73 off 29 with Liam Livingstone. Buttler and Livingstone also celebrated half-centuries on an evening of English dominance. The only moments of concern in another short-form masterclass by the Lancashire player came when he nicked left-arm spinner Gudakesh Motie wide of wicketkeeper Nicholas Pooran on 39, and on 93 when Rovman Powell’s shy at the non-striker’s end whistled past the stumps. His three figures came up from 48 deliveries in partnership with Livingstone, who targeted debutant Matthew Forde, clearing the rope three times in succession, and then put the finishing touches to the second biggest T20 total made by a Test nation against another, flashing Jason Holder for a trio of fours at the death to set the West Indies the challenge of scoring at more than 13 runs an over. That task was put into context by the fact that the only successful 200-plus chase in internationals on West Indies soil was England’s seven-wicket pursuit of 223 in Grenada at the weekend. Salt took the gloves to allow England captain Buttler to direct things like from mid-off. It must have felt like air traffic control as West Indies made a rollicking start of their own, overcoming the loss of Brandon King first ball to power 87 runs from the six power-play overs. The caveat was that England held three skiers in that period, Harry Brook taking the pick of them - a sprawling effort following a 30-yard hurtle from long-on - to end Nicholas Pooran’s 15-ball 39. The hosts kept their foot to the floor, but two wickets in as many balls from the recalled Rehan Ahmed left them 120-7 in the ninth over and made the 40-run stand for the eighth wicket between top scorer Russell and Akeal Hosein, the biggest of the innings, no more than an entertaining last chapter in another big-hitting story. This is the first five-match bilateral series to feature 100 sixes and with Salt and England now hitting a fairer share of them it is all to play for in Thursday’s finale. Jos Buttler Dubai Premier League Share or comment on this article: England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-19 23:30:15","image_url":"https://i.dailymail.co.uk/1s/2023/12/19/23/79150195-0-image-m-56_1703028334180.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"43106fce5d8fbd61b75f5ec30215aac2","title":"‘Us versus them’: The states winning the battle for the baggy green","link":"https://www.theage.com.au/sport/cricket/us-versus-them-the-states-winning-the-battle-for-the-baggy-green-20231127-p5en5f.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":["Sport / Cricket"],"creator":["Daniel Brettig"],"video_url":null,"description":"Twenty years ago, David Hookes made a famous quip about NSW and brown paper bags. But do the Blues still dominate national selection? We’ve crunched the numbers to find out.","content":"“When they give out the baggy blue cap in New South Wales, they give you a baggy green in a brown paper bag as well to save making two presentations.” – October 14, 2003. Twenty years ago, the late David Hookes, who was coach of Victoria at the time, offered this immortal assessment of Test selection for the Australian men’s team. For the record, it was said in the context of a NSW left-arm seamer, Nathan Bracken, getting picked in front of a Victorian, Mathew Inness, for a Test squad to face Zimbabwe in Sydney. Two decades on, does Hookes’ hot take still hold up? This masthead has compiled state-by-state selection figures for the past 20 years, showing that the spread of baggy green caps has widened considerably. Over that period, 20 players have been picked from a NSW background, 19 from Victoria, 12 from Western Australia, 11 from Queensland, 10 from South Australia and nine from Tasmania. NSW, then, is not exactly dominating the debutants list – and has had only three new baggy green caps since 2014. Looked at in terms of Test match tenures, however, there is no debate: the baggy Blues still provide the bulk of the team’s long-term players. Over those 20 years, the 20 NSW players have played a combined 775 Tests between them, an average of nearly 40 Tests each. By contrast, the 19 Victorians played just 212 Tests, or around 11 matches apiece. Queensland (30 matches on average per player) and WA (22 per player) have fared somewhat better, because of long careers for a few in both past and current crops. But the overall figures make it abundantly clear that the historical supremacy of NSW as the primary breeding ground for top Test talent has carried on beyond Hookes’ moment of sharp observation. In all-time terms, this has meant that NSW-grown players comprise seven of the top 10 run scorers (11 of the top 20) and five of the top 10 wicket-takers (10 of the top 20). The 21st bowler, Geoff Lawson, and the 21st batter, Usman Khawaja, were also both NSW cricket products. For the purposes of compiling the data, we regarded the state of origin as the one the player represented at the time they were picked for Australia. Hence Nathan Lyon and his 500 Test wickets are products of South Australia, where he was a budding off-spinner and part of the Adelaide Oval ground staff before moving to NSW later in his career. For Lawson, now a NSW selector, the numbers demonstrate that his state has long excelled at producing players best rounded for international cricket because of the need to cope with pace, swing and spin on junior, club and first-class surfaces in Sydney. “Players who play spin well in Australia tend to adapt to faster wickets rather than the other way round,” Lawson said. “That’s why Western Australians would come to Sydney and go ‘we can’t play on that s---heap, that’s terrible’, but when people went to Perth, no one said ‘oh we’ve got to play on this bouncing, cracked minefield’. “They had a huge advantage over there, but their complaint was that they had to play on a spinning wicket. Not many West Australians in the 1980s had long Test careers. Kim Hughes was good against spin so he played a few more. Guys like Graeme Wood did well opening the batting and did OK against the Windies, but didn’t make many runs against spin. “When you did tour overseas, a lot of those guys didn’t have the skills to handle it because they had played in those Perth conditions. But certainly people who play on slower wickets that spin can adapt more when the wickets get quicker. That was a great thing about Australian cricket – different pitches everywhere.” For David Hussey, one of the talented Victorians Hookes felt should have received a more rapid call-up to the Australian limited overs teams and who never cracked the Test side, the difference was evident as he came through the ranks in WA before moving to Melbourne. “Playing 17s, 19s and second XI, when we used to play NSW, and this is just me, but I always thought they were better batters than us,” Hussey said. “They were more rounded batters, better players of fast bowling, better players of spin and they had this inner belief, these NSW players, that they were the best and they were always going to be international players. “I guess you could say that was a poor mindset from an interstater, or from a Victoria person or a WA person, but it is slowly changing. “I believe over the next three or four years when some of the greats like [Mitchell] Starc, [Josh] Hazlewood, [David] Warner, [Steve] Smith, [Pat] Cummins, Khawaja all leave, there’s going to be huge opportunities for all players around Australia to get a long go in Test cricket. I wouldn’t be surprised if a few WA players get in there and have an extended time in the Test team.” Bracken’s Test career lasted two years and five Tests, but he enjoyed an illustrious ODI career of 116 matches, including a role in Australia’s triumphant 2007 World Cup campaign. Inness, a fast and big-hearted left-armer, did not make a national squad. The respected fitness guru has recently joined AFL club West Coast as high-performance manager after a long stint at the Western Bulldogs. The perceived injustices in national selection did not end there, and Hookes’ comments tapped into a parochial view that Victorian players were hard done by. Brad Hodge, dropped after six Tests, was the poster boy for this argument. Peter Handscomb (20 Tests) is the only Victorian batter to have enjoyed an extended run in the Test side since, and he is now considered a subcontinent specialist. “We always thought if there was a 50/50 selection call it always went to another player rather than a Victorian player, and that used to get us down a little bit,” Hussey said. “But that was the environment that was created, us versus them, and Hookesy was always going into bat for us. “That was Hookesy in a nutshell, he was us against the world. When he spoke about the baggy green in the brown paper bag, I took it as him going into bat for our players, the Brad Hodges, the Matthew Elliotts, Mathew Inness, to play for Australia. He was backing his players, and everyone got a lot of confidence out of Hookesy saying those words publicly.” However, Victoria has done a much better job at producing white-ball players in the 20 years since Hookes’ baggy blue remark. Our data shows 19 players have been picked from Victoria – equal with WA – for a whopping 1247 matches, more than double WA’s 527 matches. Here, thanks largely to the brilliant careers of former white-ball captain Aaron Finch and World Cup hero Glenn Maxwell, Victoria puts NSW in the shade. The Blues have produced 14 ODI debutants in the past 20 years for 797 matches. One of Hussey’s great rivals for a spot in the Australian Test side was Simon Katich, who played his early cricket in WA before moving to Sydney. He can recall the sniggering from both north and south of NSW about how he first became established in the Australian side after joining the Blues. But tellingly, he also recalls that he made the move to become a more rounded player, something that helped him perform overseas. “I know a lot of people speculate that, but I never thought by going there [it would get me in the Test team],” Katich said. “I’d played a Test match by playing for WA in 2001 Ashes, so I never thought of it like that. “When I look back it was purely that I wanted to go there to not have any regrets later in my career and to improve my bowling, because I knew I wasn’t going to bowl much in Perth, and I knew I had to get better at playing spin.” What is unknown, of course, is where things go after the current, dominant NSW generation departs the Test team, starting with Warner after the SCG Test in January. For Lawson, the continuation of the NSW dynasty Hookes battled against will depend as much on conditions underfoot as talent in the eyes, hands and feet. “Partly it is a function of the way the game is played now,” Lawson said. “Because they play so much international cricket, they virtually don’t play state cricket. That means they’re always fit and ready for the international team and get looked after physically and mentally so they can play longer. That means there are fewer spots available. “We’ve got to turn over our state players as well, which hasn’t happened much. Playing professional cricket is a good gig, no one wants to give it up – everyone wants to stay longer, because that’s what they do for a living. “We’ll go to Sam Konstas, Ollie Davies and Blake Nikitaras – they’re the next group who’ve got to get out there and play, they’ve all got talent. You’ve got to get them into first-class cricket, then produce some pitches that help teach them to play normally. There’s no point putting them on these pitches that seam all over the place.” Come back tomorrow part two in our series. News, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter .","pubDate":"2023-12-20 00:32:57","image_url":"https://static.ffx.io/images/$zoom_0.16153992678076973%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_jpg/e99d396f5ed5a4f12ade483b21ebcf6e48158e96","source_id":"theage","source_priority":62533,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"c22973ba9bc26250b77884bd760036ea","title":"Prominent cricket commentator Isa Guha issues classy response to Joey Barton’s polarising claims","link":"https://7news.com.au/sport/cricket/prominent-cricket-commentator-isa-guha-issues-classy-response-to-joey-bartons-polarising-claims-c-12963390","keywords":null,"creator":["Harrison Reid"],"video_url":null,"description":"‘I’ve been thinking lately.’","content":"Prominent commentator Isa Guha has issued a classy response to inflammatory and misogynistic suggestions that women shouldn’t cover men’s sport. Polarising former English Joey Barton caused a storm that reverberated around the globe earlier this month when he told UK shock jock Piers Morgan that females don’t belong on the coverage of male sport. The jarring and wildly offensive opinion was met with widespread blowback, but that didn’t bother the former EPL midfielder, who doubled down on his vile comments just days later. “It’s a completely different game,” Barton said of women’s football. “If you don’t accept that, we will always see things differently. “The women’s game is thriving. Fantastic to see. (But) I cannot take a thing they say serious in the men’s arena.” Guha, an accomplished cricket broadcaster who played 113 internationals for England across all three formats of the game, has become a star of UK and Australian television during her already decorated media career. She started appearing on screens just months after he retirement from the game in 2011, contributing to UK broadcaster ITV4’s coverage of the 2012 IPL. The 38-year-old, whose parents emigrated from India before she was born, has also become a polished radio caller, and has written sports columns for the BBC. In a lengthy Instagram post on Tuesday night, Guha detailed her gratitude for being in the position she is, and the hard work it took her to get there. “I’ve been thinking lately of how grateful I am to be able to cover sport, because I guess it hasn’t always been attainable,” she wrote. “I’m aware of the recent comments in the UK that women shouldn’t work on men’s sport, and people voicing differing opinions around the matter.“When I first started, I was pretty green and I remember the comments then. But my bosses backed me against the noise and when I made plenty of mistakes. As a result, I wanted to repay them by learning as much and as quickly as possible.” She said the diversity of her colleagues is “what makes it special” to broadcast sport. “But I hope that as time moves on, there is more focus on everyone enjoying sport rather than their gender or background.” Guha implicitly dismissed Barton’s comments with typical grace, and celebrated cricket’s trailblazing commitment to amplifying females’ voices in both men’s and women’s sport. “Cricket has led the way with many female voices and I’m grateful that many of our peers and colleagues have always given us the support/space and backing to fulfil our roles,” she wrote. “While there will always be exceptions, I’ve always felt it’s more important to acknowledge those that raise us up rather than those that don’t.“My opinion is that women can work on men’s sport just as men can work on women’s sport as pundits/presenters/commentators. But either way, let’s give people exactly the same patience and support to learn and thrive.”","pubDate":"2023-12-20 00:30:38","image_url":"https://images.7news.com.au/publication/C-12963390/794502145043e1c41dab8bfce8d96e4a866a3cbb-16x9-x0y0w1280h720.jpg","source_id":"7news","source_priority":7652,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"556549b7e34dbc014bb443793656d3ad","title":"18 साल की उम्र में ठोके 250 रन, धोनी के गढ़ के विकेटकीपर पर DC ने लुटाए पैसे","link":"https://hindi.news18.com/cricket/ipl-2024-auction-delhi-capitals-takes-kumar-kushagra-from-ms-dhoni-state-jharkhan-play-for-rishab-pant-7915687.html","keywords":null,"creator":null,"video_url":null,"description":"इंडियन प्रीमियर लीग की युवाओं टीम मानी जाने वाले दिल्ली कैपिटल्स ने एक बार फिर से नई प्रतिभा पर भरोसा जताया है. ऋषभ पंत को टीम का कप्तान बनाने के बाद टीम मैनेजमेंट ने उनका साथ मुश्किल वक्त में भी नही छोड़ा. दुबई में मंगलवार को अगले आईपीएल के लिए हुई नीलामी में वह सौरव गांगुली के साथ टेबल पर मौजूद था.","content":"लाइव अपडेट आईपीएल ऑक्शन 2024 मिचेल स्टार्क ₹ 24.75 ( करोड़ ) पैट कमिंस ₹ 20.50 ( करोड़ ) डेरिल मिशेल ₹ 14.00 ( करोड़ ) हर्षल पटेल ₹ 11.75 ( करोड़ ) अल्जारी जोसेफ ₹ 11.50 ( करोड़ ) स्पेंसर जॉनसन ₹ 10.00 ( करोड़ ) समीर रिज़वी ₹ 8.40 ( करोड़ ) रिले रोसौव ₹ 8.00 ( करोड़ ) शाहरुख खान ₹ 7.40 ( करोड़ ) रोवमैन पॉवेल ₹ 7.40 ( करोड़ ) दिल्ली कैपिटल्स की टीम में शामिल हुआ धोनी के गढ़ से आया विकेटकीपर बैटर -AP नई दिल्ली. इंडियन प्रीमियर लीग 2024 के नए सीजन से पहले मिनी ऑक्शन दुबई में आयोजित किया गया. टूर्नामेंट में भाग लेने वाली सभी 10 टीमों ने अपने मनपसंद खिलाड़ी पर जमकर बोली लगाई और उसे हासिल किया. अनकैप्ड खिलाड़ियों पर इस ऑक्शन में टीम ने बढ़ चढ़कर बोली लगाई. दिल्ली कैपिटल्स ने एक ऐसे युवा पर पैसे लगाए जिसने घरेलू क्रिकेट में धमाकेदार पारी से इतिहास रचा था. इंडियन प्रीमियर लीग की युवाओं टीम मानी जाने वाले दिल्ली कैपिटल्स ने एक बार फिर से नई प्रतिभा पर भरोसा जताया है. ऋषभ पंत को टीम का कप्तान बनाने के बाद टीम मैनेजमेंट ने उनका साथ मुश्किल वक्त में भी नही छोड़ा. दुबई में मंगलवार को अगले आईपीएल के लिए हुई नीलामी में वह सौरव गांगुली के साथ टेबल पर मौजूद था. Talented keeper who hits the ball hard. It’s a DC thing #YehHaiNayiDilli #IPLAuction pic.twitter.com/jZBRNjurEI — Delhi Capitals (@DelhiCapitals) December 19, 2023 पंत की कप्तानी वाली दिल्ली कैपिटल्स (Delhi Capitals) ने महेंद्र सिंह धोनी के गढ़ झारखंड के एक युवा प्रतिभा पर दांव लगाया है. विकेटकीपर बल्लेबाज कुमार कुशाग्र 20 लाख के बेस प्राइस के साथ नीलामी में शामिल हुए थे और उनको दिल्ली ने 7 करोड़ 20 लाख की मोटी रकम से अपनी टीम में शामिल किया. 18 साल की उम्र में रचा इतिहास कुमार कुशाग्र ने महज 18 साल की उम्र में झारखंड की तरफ से खेलते हुए रणजी ट्रॉफी में 250 रन की पारी खेल डाली थी. नागालैंड के खिलाफ 2022 में वह ऐसा करते हुए टूर्नामेंट के इतिहास में सबसे कम उम्र में 250 रन बनाने वाले बैटर बने थे. 2023 सैयद मुश्ताक अली ट्रॉफी में उन्होंने कुल 111 रन बनाए थे. . Tags: Delhi Capitals , IPL 2024 , Ms dhoni , Rishabh Pant हीरोगिरी निकली फुस्स.... तो थामा खलनायकी का दामन, 3 स्टार्स चॉकलेटी बॉय से बने 'बैडमैन', अब हीरो की निकाल रहे हेकड़ी पहले बनीं एक्साइज इंस्पेक्टर, फिर दो दिन बाद SDM, 26वीं रैंक से पास की यूपी PCS परीक्षा 3 एक्ट्रेस पर फिदा था दाऊद इब्राहिम, 1 का करियर हुआ तबाह, दूसरी का नहीं कोई अता-पता, तीसरी का बम ब्लास्ट में आया नाम लाइव ब्लॉग 21 hours ago a day ago 2 days ago 3 days ago","pubDate":"2023-12-20 00:16:03","image_url":"https://images.news18.com/ibnkhabar/uploads/2023/12/delhi-capitals-in-ipl-2023-2023-12-ea5603bcafca3bd77f1c3921c33d2719-3x2.jpg","source_id":"hindinews18","source_priority":6509,"country":["india"],"category":["sports"],"language":"hindi"},{"article_id":"348e6e7e447d4766520a40920a0ce9b6","title":"England's Salt blasts 119 in record-breaking T20 win","link":"https://thewest.com.au/sport/cricket/englands-salt-blasts-119-in-record-breaking-t20-win-c-12964291","keywords":null,"creator":["Staff Writers"],"video_url":null,"description":"Phil Salt has blasted a second T20 century in as many matches as England levelled their five-game T20 series at 2-2 with a 75-run win against West Indies.","content":"Phil Salt has produced another epic century hours after his Indian Premier League snub as England racked up their highest-ever T20 score to send their series against West Indies to a decider. Overlooked at Tuesday's IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt's form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls on Wednesday (AEDT). The innings underpinned England's gargantuan 3-267, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with 3-37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman, while he is the first male from his country with two three-figure scores in the format. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler (55) registered his second successive half-century during an opening stand worth 117 in 9.5 overs. Will Jacks chipped in with 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone (54 not out off 21 balls) quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King's top edge and looped to Reece Topley, who took a fine catch at short third man. Boundaries were not hard to come by in the chase as the hosts hit 14 sixes of their own, but England's bowlers kept making breakthroughs. Nicholas Pooran (39) and Sherfane Rutherford (36) threatened briefly, while Andre Russell clattered 51 off 25 balls before he was last batter out.","pubDate":"2023-12-20 00:02:56","image_url":"https://images.thewest.com.au/publication/C-12964291/c9a1de070fb14b4decc1fd9b4667624524cf4421-16x9-x0y0w1280h720.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"f01ba36708475d5b265d3929644ae2f5","title":"Phil Salt blasts century to lead England to record-breaking win","link":"https://www.independent.co.uk/sport/cricket/phil-salt-sam-curran-england-reece-topley-t20-b2466944.html","keywords":["Cricket","Sport"],"creator":["David Charlesworth"],"video_url":null,"description":"The opener’s second successive ton set up a total of 267, England’s best in T20s, and a 75-run success.","content":"Phil Salt produced another epic century hours after his Indian Premier League snub as England racked up their highest-ever T20 score to send their series against the West Indies to a decider. Overlooked at Tuesday’s IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt’s form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls. The innings underpinned England’s gargantuan 267 for three, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with three for 37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman while he is the first male from his country with two three-figure scores in the format as he helped set up a winner-takes-all showdown at the same venue on Thursday. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler registered his second successive half-century, thumping three sixes before holing out going for a fourth after contributing 55 to an opening stand worth 117 in 9.5 overs. The wicket did not bring a halt to the onslaught as the Windies may have hoped as the first three balls of the next over from Sherfane Rutherford were hit over the leg-side rope by a free-flowing Salt. Will Jacks chipped in 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. Livingstone briefly threatened six sixes in an over after the wayward Forde, who conceded 54 in 18 deliveries, saw his first three balls travel the distance before he finally got one in the blockhole. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. He got himself in a tangle against Andre Russell and saw the ball sail between his legs before castling him, although Livingstone finished on 54 not out off 21 balls after taking three fours off Jason Holder. Both Holder and Gudakesh Motie conceded 55 while Akeal Hosein was the only member of the Windies side who bowled more than one over and kept their economy rate under 10. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King’s top edge and looped to Reece Topley, who took a fine leaping catch at short third. Boundaries were not hard to come by in the chase as the Windies collected 14 sixes of their own and all of England’s bowlers came in for punishment, but they kept making breakthroughs in the batting. Pooran (39) and Rutherford (36) threatened briefly while Russell clattered 51 off 25 balls before he was last batter out, attempting to take down Topley but caught by Brook running in from long-off.","pubDate":"2023-12-19 23:53:02","image_url":"https://static.independent.co.uk/2023/12/19/23/19-4c451c71819041de964495973d916879.jpg?width=1200&auto=webp","source_id":"independentuk","source_priority":290,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"0ebea3d91162400f799bfed56042e253","title":"IPL auction: Seven West Aussies get snapped up ahead of 2024 season","link":"https://www.perthnow.com.au/sport/cricket/ipl-auction-seven-west-aussies-get-snapped-up-ahead-of-2024-season-c-12963962","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on.","content":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on. A whopping seven West Aussies were snapped up at the auction for the lucrative Twenty20 competition, reflecting WA cricket’s dominance across several years. WA products represented almost half of the 16 Aussies whose names were called out, with star allrounder Cam Green leading the way after heading to Royal Challengers Bangalore for the handsome sum of $3.15m. Lucknow Super Giants will have a strong WA flavour, with new coach Justin Langer having both Marcus Stoinis ($1.7m) and Ashton Turner ($178,000) at his disposal. The signing marks a return to the IPL for Turner for the first time since his stint with Rajasthan in 2019 and is reward for a superb few seasons with the bat and at the helm for the Perth Scorchers in the Big Bash League. Mitch Marsh ($1.2m) returns to Delhi Capitals, alongside Jhye Richardson ($890,000), while Tim David ($1.53m) and Jason Behrendorff ($135,000) will play their trade for Mumbai. It came as newly-minted IPL millionaire Mitchell Starc conceded it could be an “interesting time” for the Australian fast bowling crew in the gym when they reassemble after he and captain Pat Cummins picked up more than $8m in new contracts in a record-setting auction. But the third man in their all-conquering trio, Josh Hazlewood, who had informed teams he would be unavailable early in the tournament due to the impending birth of his first child, was left unsold on the shelf as Starc declared he was in a “fair bit of shock” after becoming the most expensive player in the T20 tournament’s history. Starc was picked up for $4.43m by the Kolkata Knight Riders as he ended his eight-year absence from the tournament, with Cummins going to the Sunrisers Hyderabad for $3.67m. They weren’t the only bowlers given seven-figure deals, with rookie Australian quick Spencer Johnson also picked up for a mammoth $1.78m by the Gujarat Titans. Starc said he was getting updates from his wife, Australia captain Alyssa Healy, who is in India for her own series, and found it hard to believe he was the subject of such an intense bidding war. “I’m not sure any words would do it justice, really,” Starc told Star TV. “Alyssa was over there with the Australian team at the minute, so her coverage was slightly ahead of mine here in Australia. So she sort of saw the numbers before I did, so I was getting the updates through her. But, yeah, a fair bit of shock, and certainly excitement with how it was all unfolding. But nothing that I could’ve ever imagined. “The team chat has been going nuts. The are all saying it’s our shout, so we’ll just go about our business and get ready for the next Test match. But a few of our Australian teammates might be waiting for us to treat them. “It could be an interesting conversation between the bowling group tomorrow and the gym.” Starc has played only two seasons of the IPL - in 2014 and 2015 - and missed the 2018 season with injury before opting to return to the tournament this year, setting off a frenzy among his suitors. “It’s been a long time since I played in IPL in 2014 and ’15 and have obviously played a fair bit of cricket since then,” he said. “So that experience is there and a little bit of leadership if you like, in terms of the experience side of things in white-ball cricket that hopefully I can bring to bring to KKR as well and play my part there.” Travis Head also returns to the IPL and will join Cummins at the Sunrisers on a $1.2m deal. - with News Corp Australia","pubDate":"2023-12-19 23:52:49","image_url":"https://images.perthnow.com.au/publication/C-12963962/035ae455988df250a5e9812ac7ccf2ce6d098cfc-16x9-x753y52w2455h1381.jpg","source_id":"perthnow","source_priority":49457,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"45853bb00a3bb4d4dbe03e96422bb45f","title":"IPL auction: Seven West Aussies get snapped up ahead of 2024 season","link":"https://thewest.com.au/sport/cricket/ipl-auction-seven-west-aussies-get-snapped-up-ahead-of-2024-season-c-12963962","keywords":null,"creator":["Chris Robinson"],"video_url":null,"description":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on.","content":"When it comes to cricket, we’ve known West is best for a while now - and it seems Indian Premier League franchises are catching on. A whopping seven West Aussies were snapped up at the auction for the lucrative Twenty20 competition, reflecting WA cricket’s dominance across several years. WA products represented almost half of the 16 Aussies whose names were called out, with star allrounder Cam Green leading the way after heading to Royal Challengers Bangalore for the handsome sum of $3.15m. Lucknow Super Giants will have a strong WA flavour, with new coach Justin Langer having both Marcus Stoinis ($1.7m) and Ashton Turner ($178,000) at his disposal. Jackson Barrett The signing marks a return to the IPL for Turner for the first time since his stint with Rajasthan in 2019 and is reward for a superb few seasons with the bat and at the helm for the Perth Scorchers in the Big Bash League. Mitch Marsh ($1.2m) returns to Delhi Capitals, alongside Jhye Richardson ($890,000), while Tim David ($1.53m) and Jason Behrendorff ($135,000) will play their trade for Mumbai. It came as newly-minted IPL millionaire Mitchell Starc conceded it could be an “interesting time” for the Australian fast bowling crew in the gym when they reassemble after he and captain Pat Cummins picked up more than $8m in new contracts in a record-setting auction. But the third man in their all-conquering trio, Josh Hazlewood, who had informed teams he would be unavailable early in the tournament due to the impending birth of his first child, was left unsold on the shelf as Starc declared he was in a “fair bit of shock” after becoming the most expensive player in the T20 tournament’s history. Starc was picked up for $4.43m by the Kolkata Knight Riders as he ended his eight-year absence from the tournament, with Cummins going to the Sunrisers Hyderabad for $3.67m. They weren’t the only bowlers given seven-figure deals, with rookie Australian quick Spencer Johnson also picked up for a mammoth $1.78m by the Gujarat Titans. Starc said he was getting updates from his wife, Australia captain Alyssa Healy, who is in India for her own series, and found it hard to believe he was the subject of such an intense bidding war. “I’m not sure any words would do it justice, really,” Starc told Star TV. “Alyssa was over there with the Australian team at the minute, so her coverage was slightly ahead of mine here in Australia. So she sort of saw the numbers before I did, so I was getting the updates through her. But, yeah, a fair bit of shock, and certainly excitement with how it was all unfolding. But nothing that I could’ve ever imagined. “The team chat has been going nuts. The are all saying it’s our shout, so we’ll just go about our business and get ready for the next Test match. But a few of our Australian teammates might be waiting for us to treat them. “It could be an interesting conversation between the bowling group tomorrow and the gym.” Starc has played only two seasons of the IPL - in 2014 and 2015 - and missed the 2018 season with injury before opting to return to the tournament this year, setting off a frenzy among his suitors. “It’s been a long time since I played in IPL in 2014 and ’15 and have obviously played a fair bit of cricket since then,” he said. “So that experience is there and a little bit of leadership if you like, in terms of the experience side of things in white-ball cricket that hopefully I can bring to bring to KKR as well and play my part there.” Travis Head also returns to the IPL and will join Cummins at the Sunrisers on a $1.2m deal. - with News Corp Australia","pubDate":"2023-12-19 23:52:49","image_url":"https://images.thewest.com.au/publication/C-12963962/035ae455988df250a5e9812ac7ccf2ce6d098cfc-16x9-x753y52w2455h1381.jpg","source_id":"thewest","source_priority":106740,"country":["australia"],"category":["sports"],"language":"english"},{"article_id":"34ee3876b54b22391fbf130a4bdcd8cc","title":"Phil Salt blasts century to lead England to record-breaking win","link":"https://www.watfordobserver.co.uk/sport/national/24001485.phil-salt-blasts-century-lead-england-record-breaking-win/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"The opener’s second successive ton set up a total of 267, England’s best in T20s, and a 75-run success.","content":"Overlooked at Tuesday’s IPL auction in Dubai and three days on from his match-winning 109 not out in Grenada, Salt’s form transferred to Trinidad as he amassed a buccaneering 119 off just 57 balls. The innings underpinned England’s gargantuan 267 for three, which was 26 more than their previous T20 best against New Zealand in Napier in November 2019, and proved enough to secure a thumping 75-run win. WOW!! Back-to-back !! 💯💯 Scorecard: | — England Cricket (@englandcricket) Having been set a daunting target, which if achieved would have been a world record chase, the Windies went out all guns blazing but were all out for 192 in 15.3 overs. Reece Topley finished with three for 37, Sam Curran and Rehan Ahmed each took a couple of wickets while there was one each for Moeen Ali, Chris Woakes and Adil Rashid. Salt set a new benchmark for the highest T20 score by an Englishman while he is the first male from his country with two three-figure scores in the format as he helped set up a winner-takes-all showdown at the same venue on Thursday. From the moment he danced down the track to his third ball and dispatched a sweetly-timed drive off T20 debutant Matthew Forde for the first of his 10 sixes, Salt barely looked back. England captain Jos Buttler registered his second successive half-century, thumping three sixes before holing out going for a fourth after contributing 55 to an opening stand worth 117 in 9.5 overs. The wicket did not bring a halt to the onslaught as the Windies may have hoped as the first three balls of the next over from Sherfane Rutherford were hit over the leg-side rope by a free-flowing Salt. Will Jacks chipped in 24 off eight balls as Salt inched towards a 48-ball ton. He and Livingstone quickly got back to piling on runs in a boundary-laden 73-run union off 29 deliveries. Livingstone briefly threatened six sixes in an over after the wayward Forde, who conceded 54 in 18 deliveries, saw his first three balls travel the distance before he finally got one in the blockhole. England equalled their record for the most sixes in a T20 with 20 before Salt departed in the penultimate over. He got himself in a tangle against Andre Russell and saw the ball sail between his legs before castling him, although Livingstone finished on 54 not out off 21 balls after taking three fours off Jason Holder. Both Holder and Gudakesh Motie conceded 55 while Akeal Hosein was the only member of the Windies side who bowled more than one over and kept their economy rate under 10. The Windies have enviable firepower of their own but Moeen gave England the best possible start in the second innings. His first ball took Brandon King’s top edge and looped to Reece Topley, who took a fine leaping catch at short third. Boundaries were not hard to come by in the chase as the Windies collected 14 sixes of their own and all of England’s bowlers came in for punishment, but they kept making breakthroughs in the batting. Pooran (39) and Rutherford (36) threatened briefly while Russell clattered 51 off 25 balls before he was last batter out, attempting to take down Topley but caught by Brook running in from long-off.","pubDate":"2023-12-19 23:41:32","image_url":"https://www.watfordobserver.co.uk/resources/images/17570075/?type=app&htype=0","source_id":"watfordobserver","source_priority":435041,"country":["united kingdom"],"category":["sports"],"language":"english"},{"article_id":"ffcc23d8b404255997ea0c0d1715ef91","title":"Super Salt fires England to win against West Indies to square T20 series","link":"https://www.channelnewsasia.com/sport/super-salt-fires-england-win-against-west-indies-square-t20-series-4000586","keywords":["Sport"],"creator":null,"video_url":null,"description":null,"content":"Best News Website or Mobile Service WAN-IFRA Digital Media Awards Worldwide 2022 Best News Website or Mobile Service Digital Media Awards Worldwide 2022 :Phil Salt smashed a magnificent record-breaking century in England's highest-ever T20 international total as they romped to a 75-run win against West Indies to square the series in a spellbinding match in Tarouba on Tuesday. Salt thumped 119 off 57 balls as England tore into the West Indies attack to make 267-3 - surpassing their previous highest T20 total of 241 against New Zealand in 2019. Ten sixes flew off Salt's bat as well as seven fours as he hit the highest total by an England men's batsman in T20, eclipsing the 116 by Alex Hales in 2014. Captain Jos Buttler and Liam Livingstone joined the party with quickfire half centuries. Buttler's 55 came off 29 balls with his three sixes making him the English batsman with the most sixes in T20 internationals - 123 in total. Salt also struck a belligerent 109 not out in the third match of the series to deny West Indies a 3-0 series lead and he proved unstoppable again. \"I am definitely enjoying it. It's a cool place to come and tour and play cricket,\" Salt said. \"The boys have produced the goods in the last few games and now we have the decider to look forward to.\" The series is now locked at 2-2 with Thursday's climax to come. In reply to England's huge total, West Indies lost opener Brandon King off the opening ball bowled by Moeen Ali but reacted in dazzling fashion with some sensational hitting to stay above the required run rate although wickets fell at regular intervals. Nicholas Pooran hit 20 off the first over after King's dismissal and made 39 off 15 balls before falling to a brilliant running catch by Harry Brook off Sam Curran's bowling. Sherfane Rutherford also blazed away in spectacular fashion as West Indies brought up the 100 in the seventh over but their chase was doomed to failure as wickets tumbled. Rutherford fell lbw to Rehan Ahmed for 36 off 15 deliveries and from then on their chances of an unlikely victory faded. Andre Russell made sure West Indies went down swinging as he clouted 51 in a desperate last stand but was eventually out to a steepling catch by Brook to give Topley a third wicket. An incredible match contained 33 sixes and the fireworks could continue in the decider. \"The boys like a final it seems! We will come with brand new ideas and plans and see if we can entertain our fans at home,\" West Indies skipper Rovman Powell said. \"We have failed to close out the series from a good position but Thursday is an opportunity to do that.\"","pubDate":"2023-12-19 23:38:40","image_url":null,"source_id":"channelnewsasia","source_priority":37829,"country":["singapore"],"category":["sports"],"language":"english"},{"article_id":"98220862327849aa678448df6e33f679","title":"England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls","link":"https://www.dailymail.co.uk/sport/cricket/article-12883413/England-hit-record-267-beat-West-Indies-set-T20-series-decider-Phil-Salt-smashing-century-Rehan-Ahmed-taking-two-wickets-two-balls.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","keywords":null,"creator":null,"video_url":null,"description":"Timing is everything. Had the Indian Premier League auction been held in Dubai on Wednesday morning, Phil Salt would arguably be waking up a millionaire.","content":"England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls By Richard Gibson for the Daily Mail Published: 18:30 EST, 19 December 2023 | Updated: 18:32 EST, 19 December 2023 e-mail View comments Timing is everything. Had the Indian Premier League auction been held in Dubai on Wednesday morning, Phil Salt would arguably be waking up a millionaire. Unsold on Tuesday, he responded to his snub by hitting England’s highest Twenty20 score on an evening of carnage in the Caribbean. In smashing 119 from 57 balls, Salt also became the first England batsman to hit back-to-back hundreds in the format, following the unbeaten 109 on Saturday that maintained hopes of a comeback series victory for Jos Buttler ’s team. It is form that has also thrown into question the judgement of the ECB bosses who deemed him unworthy of a central contract at the start of this winter. England won by a 75-run margin to set up a decider back at the Brian Lara Cricket Academy, although the result was all-but confirmed by the time Salt was yorked by Andre Russell in the 19th over. Russell had begun it by serving up five leg-side wides to propel England beyond their previous-best Twenty20 total of 241 for three versus New Zealand in Napier four years ago. Salt struck an England-high 10 sixes in all, including three muscular pulls in a row off Sherfane Rutherford’s medium pace, sharing 117 for the wicket with Jos Buttler in the first half of the innings, 56 off just 23 balls with Will Jacks and a further 73 off 29 with Liam Livingstone. Buttler and Livingstone also celebrated half-centuries on an evening of English dominance. The only moments of concern in another short-form masterclass by the Lancashire player came when he nicked left-arm spinner Gudakesh Motie wide of wicketkeeper Nicholas Pooran on 39, and on 93 when Rovman Powell’s shy at the non-striker’s end whistled past the stumps. His three figures came up from 48 deliveries in partnership with Livingstone, who targeted debutant Matthew Forde, clearing the rope three times in succession, and then put the finishing touches to the second biggest T20 total made by a Test nation against another, flashing Jason Holder for a trio of fours at the death to set the West Indies the challenge of scoring at more than 13 runs an over. That task was put into context by the fact that the only successful 200-plus chase in internationals on West Indies soil was England’s seven-wicket pursuit of 223 in Grenada at the weekend. Salt took the gloves to allow England captain Buttler to direct things like from mid-off. It must have felt like air traffic control as West Indies made a rollicking start of their own, overcoming the loss of Brandon King first ball to power 87 runs from the six power-play overs. The caveat was that England held three skiers in that period, Harry Brook taking the pick of them - a sprawling effort following a 30-yard hurtle from long-on - to end Nicholas Pooran’s 15-ball 39. The hosts kept their foot to the floor, but two wickets in as many balls from the recalled Rehan Ahmed left them 120-7 in the ninth over and made the 40-run stand for the eighth wicket between top scorer Russell and Akeal Hosein, the biggest of the innings, no more than an entertaining last chapter in another big-hitting story. This is the first five-match bilateral series to feature 100 sixes and with Salt and England now hitting a fairer share of them it is all to play for in Thursday’s finale. Jos Buttler Dubai Premier League Share or comment on this article: England hit record 267 to beat the West Indies and set up T20 series decider... with Phil Salt smashing a century and Rehan Ahmed taking two wickets in two balls e-mail Add comment Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .","pubDate":"2023-12-19 23:30:15","image_url":"https://i.dailymail.co.uk/1s/2023/12/19/23/79150195-0-image-m-56_1703028334180.jpg","source_id":"dailymailuk","source_priority":135,"country":["united kingdom"],"category":["sports"],"language":"english"}]}