{"newsArray":[{"title":"“He might soon be removed from Tests” – Ramiz Raja on Australian opener's form in Border-Gavaskar Trophy","link":"https://www.sportskeeda.com/cricket/news-he-might-soon-removed-tests-ramiz-raja-australian-opener-s-form-border-gavaskar-trophy?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"Former Pakistan player Ramiz Raja reckons that Australian batter David Warner’s end in Test cricket is near. This came as the southpaw registered a string of low scores - 1, 10 and 15 - in the last three innings of the ongoing Border-Gavaskar Trophy. Speaking on his YouTube channel, Raja said: The Aussie opener has scored only one double-century and two fifties in the last 17 Tests. For the uninitiated, the southpaw was subbed out in the second Test due to a concussion. Warner also suffered a small hairline fracture in his left elbow after suffering multiple blows from Mohammed Siraj on Day 1. Watch Siraj's fiery spell to Warner below : In a statement, Cricket Australia wrote: Ramiz Raja further believes that the lack of preparation cost Aussies the ongoing Border-Gavaskar Trophy. The cricketer-turned-commentator said: It's worth mentioning that the Aussies lost 16 wickets against spinners in each of their first two Tests. The two teams will now lock horns in the third Test at the Holkar Stadium in Indore, which starts on Wednesday, March 1. After taking a 2-0 lead in the series, India will look to win the Border-Gavaskar Trophy for the fourth time in a row, having won the last three Test series against the Aussies. Meanwhile, the visitors will look to stage a comeback in the remaining two Tests. India’s Test squad for the third and fourth Test: Rohit Sharma (captain), KL Rahul, Shubman Gill , Cheteshwar Pujara, Virat Kohli, KS Bharat (wk), Ishan Kishan (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohammed Shami, Mohammed Siraj, Shreyas Iyer, Suryakumar Yadav, Umesh Yadav, Jaydev Unadkat. Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:19:54","image_url":"https://static.sportskeeda.com/editor/2023/02/2a4f1-16768300058611-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia ‘too high-tempo’ in second Test capitulation, says captain Pat Cummins","link":"https://www.theguardian.com/sport/2023/feb/20/cricket-australia-india-second-test-reaction","keywords":["Australia cricket team","India cricket team","Cricket","Australia sport","Sport"],"creator":["Australian Associated Press"],"video_url":null,"description":"Tourists search for answers after defeat by India inside three daysFormer captain Allan Border ‘disappointed’ and ‘shell-shocked’Captain Pat Cummins has admitted Australia went “too high tempo” in a stunning capitulation as they lost the second Test in Delhi inside three days. Defeat meant Australia’s hopes of winning a Test series in India for the first time in 19 years are over in less than six days of cricket, crushed twice by a ruthless Indian spin attack.While they were never in the contest in the opening Test in Nagpur, at Arjun Jaitley Stadium the tourists began day three with the advantage, but were demoralised by tea. Australia’s collapse of 48-9 was their third-worst in the third innings of a Test, behind the infamous Cape Town debacle of 2011 (36-9) and a match against the World XI in 2005 (47-9) when the country’s golden generation were already in a winning position. Continue reading...","content":"Captain Pat Cummins has admitted Australia went “too high tempo” in a stunning capitulation as they lost the second Test in Delhi inside three days. Defeat meant Australia’s hopes of winning a Test series in India for the first time in 19 years are over in less than six days of cricket, crushed twice by a ruthless Indian spin attack. While they were never in the contest in the opening Test in Nagpur, at Arjun Jaitley Stadium the tourists began day three with the advantage, but were demoralised by tea. Australia’s collapse of 48-9 was their third-worst in the third innings of a Test, behind the infamous Cape Town debacle of 2011 (36-9) and a match against the World XI in 2005 (47-9) when the country’s golden generation were already in a winning position. Australia swept aside by India in manic parade of cross-batted wallops | Geoff Lemon Read more Cummins’ team had plans to attack Ravi Jadeja and Ravichandran Ashwin but they came unstuck in nightmarish fashion as multiple batters fell victim to the sweep shot. Jadeja could only laugh when asked post-game if it was a good idea to try to sweep his bowling. “I’m probably as much to blame as anyone else there,” Cummins said. “Two big things we talk about is the tempo of the game and the method. Maybe at times a little bit too high tempo. I’d rather be high tempo than low tempo though, if those wickets are being difficult, but maybe the method went a little bit away from what we planned to do at times.” Australia dominated periods of the Test and appeared to have a serious chance of handing India their first loss at the Arun Jaitley Stadium since 1987. They managed 263 in their first innings, which looked solid when India collapsed to 139-7 in response. But bowling allrounders Axar Patel and Ashwin saved their side with a 114-run eighth-wicket stand to help leave Australia with just a one-run lead. “Looking back on it, 300 would have been fantastic,” Cummins said. “260 was OK, but if we really want to drive home the advantage we were a few short.” Australia travelled to India as the world’s No 1 ranked Test team, but are still not guaranteed to feature in this year’s World Test Championship final if they lose the series 4-0. They can’t regain the Border-Gavaskar trophy from here but they can lock up their spot in the WTC decider at Lord’s. “Absolutely, it’s still a series to draw,” Cummins said. “That’d be an amazing effort over here in India. So that’s all to play for still.” Former captain Allan Border expressed his dismay at the tourists’ collapse, saying he was “disappointed” and “shell-shocked” by the nature of the collapse. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion “I’m angry about the way they went about it today,” he said. “It was panicky, frenetic sort of batting … nobody got in there to stem the flow with some good defensive cricket. They were all just getting out playing sweep shot, reverse sweep to just about every ball. You can’t get away with that on that sort of track. You’ve got to have a method.” Former opener Matthew Hayden, who starred during Australia’s 2001 tour of India, was also stunned by the rout. “These are world-class players, and they’ve got everything to win and everything to lose in this session,” Hayden said in commentary. “They did it so well last evening in those few overs. But what we’ve seen here is a disaster for Australia. They’ve gone way over the edge in terms of their aggressive play.”","pubDate":"2023-02-19 23:17:22","image_url":"https://i.guim.co.uk/img/media/a824385b3bc6aca2b3c700437c055ea804dc053c/0_204_4303_2583/master/4303.jpg?width=460&quality=85&auto=format&fit=max&s=4acebfe89146274ac577aec32d801674","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"\"It was panicky, frenetic sort of batting\" - Allan Border lambasts Australia's batters after crumbling on day three in Delhi","link":"https://www.sportskeeda.com/cricket/news-it-panicky-frenetic-sort-batting-allan-border-lambasts-australia-s-batters-crumbling-day-three-delhi?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Former Australian captain Allan Border came down hard on Pat Cummins and co. after crumbling on day three of the first Test against India in Delhi. The 67-year-old stated that the tourists were highly reckless in their approach. Australia started day three with 61-1 and were 62 ahead, but ended up losing their remaining nine wickets in the first session for 52 runs. India chased the target of 115 runs in the second session of the game. Instagram Post Speaking to Fox Cricket, Border expressed his anger, claiming that the visitors panicked in the moment and played sweep shots recklessly: The former Aussie cricketer added: Australia's hopes of regaining the Border-Gavaskar Trophy ended in two and a half days as they failed to gain a sizeable lead. The tourists last held the Border-Gavaskar Trophy in the 2014-15 series. Former opening batter Matthew Hayden underlined that the national team's batting performance was a disaster, stating that they played too aggressively. The Queenslander added: He continued: The third Test against India starts on March 1st in Indore. Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:08:53","image_url":"https://static.sportskeeda.com/editor/2023/02/986dc-16768289363620-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"\"It's a fitting tribute to one of Saurashtra's favorite sons\" - Jaydev Unadkat dedicates Ranji Trophy triumph to Cheteshwar Pujara","link":"https://www.sportskeeda.com/cricket/news-it-s-fitting-tribute-one-saurashtra-s-favorite-sons-jaydev-unadkat-dedicates-ranji-trophy-triumph-cheteshwar-pujara?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Gokul Nair"],"video_url":null,"description":null,"content":"Jaydev Unadkat dedicated Saurashtra's 2022-23 Ranji Trophy to his fellow statesman Cheteshwar Pujara. Unadkat led Saurashtra to a nine-wicket win over Bengal on Sunday, February 19, to mark their second title in four years. The left-arm pacer was released from the Indian squad for the second Test against Australia in Delhi to represent Saurashtra in the Ranji Trophy final. Pujara, on the other hand, scripted history in the same timeframe by becoming the 13th Indian player to play 100 Tests. While Pujara was dismissed for a duck in the first innings, he played a composed 71-ball 34-run knock in the second. The gritty batter fittingly hit the winning runs as India claimed a six-wicket win to attain an unassailable 2-0 lead in the four-match series. Naming Pujara as one of Saurashtra's favorite sons, Unadkat said following the title triumph: Pujara has been a stalwart for the state, compiling tons of runs over the years. He played two matches in the recently concluded Ranji Trophy season, scoring 121 runs across three innings before leaving for national duty. Commenting on Saurashtra's winning effort, Unadkat said: He continued: Unadkat has been named in the India squad for the last two Tests against Australia and also finds a place in the subsequent three-match ODI series. Pujara survived an onslaught of spin bowling in the fourth innings as India chased a tricky 115-run target on Day 3 at the Arun Jaitley Stadium in Delhi. He emerged as the top-scorer after coming out to bat in the second over, following KL Rahul's early dismissal. Stating that he was keeping close tabs on the Ranji Trophy final as well, Pujara said: The third India-Australia Test will get underway in Indore on March 1. Where does the current Saurashtra team rank among the greatest Ranji teams? Let us know what you think. Also Read: Jasprit Bumrah yet to get clearance from NCA; IPL workload to be monitored closely - Reports Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:02:09","image_url":"https://static.sportskeeda.com/editor/2023/02/cfaa5-16768299309320-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Ginnivan aims to regain trust as Moore admits drug policy grey area","link":"https://www.brisbanetimes.com.au/sport/afl/ginnivan-aims-to-regain-trust-as-moore-admits-drug-policy-grey-area-20230220-p5clsg.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Collingwood star Jack Ginnivan spoke about his drugs suspension on Monday, coming as Magpies’ skipper Darcy Moore also fronted the cameras.","content":"Suspended Collingwood forward Jack Ginnivan has reiterated he is remorseful about taking an unspecified illicit drug, as Magpies skipper Darcy Moore admitted there was grey area around the AFL’s illicit drugs code. Ginnivan, banned for four matches, including the opening two home-and-away games, gave only a short statement as he arrived at the Magpies’ training base at 7.30am on Monday. “Everyone knows that I am pretty sorry and remorseful for the actions that I did. I am ready to get back to work today and earn back the trust of the group,” he said. Ginnivan, 20, had confessed on Saturday to taking an illicit drug in the bathroom of the Torquay Hotel earlier this month on a day off after the Pies had held a pre-season training camp on the Surf Coast. Ginnivan, who maintains his teammates did not know he had taken an illegal substance, had been filmed by a member of the public, and had been unaware of the video until the media approached the club. Loading As the Magpies arrived for training on Monday, skipper Moore also fronted the cameras, admitting the club was disappointed in Ginnivan, but adamant there was not a wider drug problem at the club. “Jack has made an error of judgment. We get a lot of education. I think the community knows that and that is a source of disappointment for us. In this case, it is a 21-year-old man who has made an error of judgment at a venue,” Moore said. “He has owned that, we have owned that, and the sanction has been dealt with appropriately. “We have over 90 male and female athletes at this club, the large majority of whom take their job really seriously and make great decisions. But having said that, we don’t operate in a vacuum, we are human beings, people make errors of judgment, and it’s something that Jack has done in this instance.” Collingwood skipper Darcy Moore says he is looking forward to reading a review of the AFL’s illicit drugs ccode. Credit: Nine News Moore repeatedly said Ginnivan, a “popular, bubbly teammate”, had made an “error of judgment”, and it would take time for him to regain the trust of his teammates. “It’s not easy, but I am sure he will use this time to put his best foot forward and earn a bit of a trust from the team,” he said. The articulate Moore, who this month has replaced veteran Scott Pendlebury as captain, is also on the AFL Players Association’s board, and has detailed knowledge of the AFL’s three-strikes illicit drugs policy. This policy has been under review for the past year, but progress has been slow. Former Hawthorn president Jeff Kennett and Western Bulldogs coach Luke Beveridge have been among those calling for change, particularly when it comes to who is informed of a first strike. AFL medical directors and the player’s club doctor – but not club management – are told of a positive first test, unless there is footage available, as was the case for Ginnivan. Loading It is then referred by the AFL medical officer to the club doctor to determine the best course of action, including what treatment the player should be referred to. “It’s being reviewed. It’s been reviewed, the IDP [illicit drugs policy], over the past 12 months by the AFL, a third-party medical specialist and the AFL Players Association,” Moore said. “The IDP is a voluntary program that players have signed up to in order to safeguard their welfare and wellbeing. It’s, obviously, something that is much talked about, especially when incidents like this occur. I am really looking forward to seeing the outcome of that review and what the AFL and the independent experts have to say about how effective it is. “Obviously, the model is designed around welfare and wellbeing and harm minimisation of drugs amongst young people, in this case, AFL players. I am really looking forward to the results of that.” Where the number of positive tests was once publicly released and reported by the media, the players have successfully pushed for those figures to be suppressed, arguing the release of the figures only added to the strain players felt. The flipside is that officials argue this only adds to a shroud of secrecy. “It [the policy] plays an important role around the league in terms of flagging players who are at risk of making mistakes around drug use, provides valuable de-identified data around the prevalence of drug use to the league and to the medical experts to keep tabs on how big of an issue this is,” Moore said. “I think the challenging part of it is certainly when things become public because obviously around a welfare and harm minimisation model not everything is going to be public. When it does, it can certainly create a bit more grey area, I suppose.” Loading However, Moore said the current policy was a strong enough deterrent. Ginnivan has also received a suspended $5000 fine, counselling and will be target-tested. He will also take a hit in terms of lost match payments. Moore said the Magpies were concerned only for Ginnivan’s welfare. “I think the general public can make up their mind about someone being filmed in a cubicle but ... Jack has owned his behaviour. Our main concern is about the behaviour and mistake Jack has made, and he has owned that. He has fallen short of the standards, it is disappointing, I am sure he will learn from it,” Moore said. “Unfortunately, he sustained a bit of an injury [gashed knee] at Friday night’s [intra-club] match. He is a little bit sore, and obviously disappointed with himself. He certainly feels the weight of that. We have to make sure that we support him and safeguard his welfare.” The Magpies must now regroup and focus on their opening practice match, against Carlton at Ikon Park on Friday. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL off-field behaviour Collingwood Magpies AFL 2023 Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-02-19 22:00:23","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Saurashtra lift Ranji Trophy for 2nd time","link":"https://www.thehansindia.com/sports/saurashtra-lift-ranji-trophy-for-2nd-time-783882","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Unadkat-led side thrash WBengal by nine wickets in final","content":"Kolkata: Left-arm pacer Jaydev Unadkat returned a match haul of nine wickets, including 6/85 in the second innings, as Saurashtra thrashed Bengal by nine wickets in the summit clash to clinch their second Ranji Trophy title here on Sunday. Having given away a big first innings lead of 230 runs, Bengal, who were overnight 169/4 in their second essay, folded for 241, handing the visitors a mere 12 runs target to win the final. Saurashtra lost their opening batter Jay Gohil (0) off the bowling of Akash Deep but eventually went past the target, reaching 14 for 1 in 2.4 overs, to wrap up the match with one day and two full sessions to spare. Saurashtra's earlier triumph was in 2019-20 season when they defeated Bengal on the basis of first innings lead. In the last 10 seasons, they have made the final on five occasions, underlining their consistency. A Ranji Trophy title eluded Bengal yet again. They last won it in 1998-90 when they defeated a star-studded Delhi at the same Eden Gardens. Their first title had come in 1938-39 in the pre-independence era. Earlier in the morning session, Unadkat showed the way after a freak run-out of Bengal batter Shahbaz Ahmed (27). The veteran Saurashtra skipper added four wickets to his overnight tally of two. The old Bengal warhorse duo of skipper Manoj Tiwary (68) and Anustup Majumdar (61) slammed valiant half-centuries but the home side were let down by their top-order batters, including the promising Abhimanyu Easwaran who scored 0 and 16 in the two innings. In-form No. 3 batter Sudip Gharami, who is fresh from a 112 and 41 in the semifinal against Madhya Pradesh and has 800-plus runs this season, also came a cropper and scored 0 and 14 in the two innings. The decision to hand debut to Sumanta Gupta in a Ranji final also will rankle Bengal as he did not show any technique of a top-order batter and perished to an outgoing delivery. State sports minister-cum-cricketer Tiwary had delayed his retirement to win a Ranji title from his fourth final, and it remains to be seen whether he continue to play in the upcoming season. (PTI) Brief Scores: Bengal 174 and 241 in 70.4 overs (Manoj Tiwary 68, Anustup Majumdar 61; Jaydev Unadkat 6/85, Chetan Sakariya 3/76). Saurashtra 404 and 14/1 in 2.4 overs. Saurashtra won by nine wickets.","pubDate":"2023-02-19 20:55:19","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337136-jaydev-unadkat.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"India retain Border-Gavaskar Trophy","link":"https://www.thehansindia.com/sports/india-retain-border-gavaskar-trophy-783880","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Hosts win by six wickets as Jadeja, Ashwin demolish Australia","content":"India’s Ravindra Jadeja and Axar patel react during the third day of the 2nd Test against Australia, at the Arun Jaitley Stadium, in New Delhi on Sunday New Delhi: Riding on left-arm spinner Ravindra Jadeja's best bowling figures in an innings in Test cricket (7/42) along with Ravichandran Ashwin's spin masterclass, India defeated Australia by six wickets in the second Test within three days to take 2-0 lead in the four-match series and retain Border-Gavaskar Trophy at the Arun Jaitley Stadium, here on Sunday. Ashwin set up the collapse to pick 3/59, before Jadeja ran through the Australian batting line-up as Australia crashed to 113 all out, after starting the day from 61/1 and being 86/2 at one stage, in their second innings. The Australian batting implosion gave India a target of 115, which they completed in 28.4 overs. Rohit Sharma began the chase by driving wide of mid-on for a boundary off Matthew Kuhnemann in the opening over. But in the next over, he lost his opening partner KL Rahul in an unlucky fashion. Rahul flicked well to the right of short leg off Nathan Lyon, but the ball lobbed up in the air after hitting the top of forward short leg's pad and the keeper took an easy catch. Rohit showed exquisite timing in whipping an overpitched delivery off Kuhnemann between deep mid-wicket and long-on. Post lunch, India began with an attacking intent, as Cheteshwar Pujara danced down the pitch to whip Matthew Kuhnemann through mid-wicket for four. Rohit came out in the next over to loft over wide mid-wicket for six off Lyon, followed by paddling off him for four more. The Indian skipper then danced down the pitch against Kuhnemann, slamming a six over the bowler's head but he was run-out in a horrible mix-up and sacrificed himself to keep Pujara at the crease. Pujara and Virat Kohli were positive in their footwork, defence and got the boundaries too. While Pujara danced down the pitch to loft Lyon over mid-on, Kohli got close to the ball and used his supple wrists to chip a drive past the off-spinner. He followed it up with a gentle tickle through fine leg and placing a flick between two fielders in the square leg region. Kohli fell for 20 when he was beaten through the air and on the outside edge by Todd Murphy and was stumped from behind by Alex Carey. Pujara and Shreyas Iyer continued to get boundaries on a fast clip -- while the former was pristine in punching off Murphy, the latter was splendid in cutting off Lyon and dancing down the pitch against Murphy to get four and six respectively. In a bid to attack against Lyon, Iyer danced down the pitch again for an expansive slog, but holed out to deep mid-wicket. KS Bharat was gorgeous in driving twice through the extra cover against Lyon and Kuhnemann. He would go on to drive through cover again off Kuhnemann for boundary and brought the crowd on its feet with a slog-sweep over deep mid-wicket for six off part-timer Travis Head. Pujara, playing in his 100th Test, finished off the chase by dancing down the pitch and flicking over mid-wicket to give India another victory in the series. Australia will be mighty disappointed by some extremely questionable shot selection and squandering the advantage they had at stumps on day two. Resuming from 61/1, with a healthy run-rate of 5.08 at the end of day two, Australia imploded spectacularly to lose nine wickets for 53 runs in a frenetic morning session. Brief scores: Australia 263 and 113 in 31.3 overs (Travis Head 43, Marnus Labuschagne 35; Ravindra Jadeja 7/42, Ravichandran Ashwin 3/59) lost to India 262 in 83.3 overs and 118/4 in 28.4 overs (Rohit Sharma 31, Cheteshwar Pujara 31 not out; Nathan Lyon 2/49, Todd Murphy 1/22) by six wickets.","pubDate":"2023-02-19 20:51:32","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337134-ravichandran-ashwin.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia gift Cheteshwar Pujara signed jersey for completing 100 Tests","link":"https://www.thehansindia.com/sports/cricket/australia-gift-cheteshwar-pujara-signed-jersey-for-completing-100-tests-783828","keywords":["Sports,Cricket"],"creator":["Sakshi Gupta"],"video_url":null,"description":"The Delhi game was Pujara’s 100th appearance in TestsIndia defeated Australia by 6 wickets in the second TestPujara deservedly hit the winning runs","content":"Pat Cummins presented a signed Australian jersey to Indian batsman Cheteshwar Pujara on Sunday for completing 100 Tests. The Board of Control for Cricket in India (BCCI) shared a picture of Cummins handing the signed jersey to Pujara, who became only the 13th Indian cricketer to reach the 100-mark in Tests. \"What a special gesture that was,\" wrote BCCI in a tweet along with the said picture. Spirit of Cricket 👏🏻👏🏻 Pat Cummins 🤝 Cheteshwar Pujara What a special gesture that was! 🇮🇳🇦🇺 #TeamIndia | #INDvAUS pic.twitter.com/3MNcxfhoIQ Pujara started off his 100th Test on a low after he was dismissed for a seven-ball duck by Australian spinner Nathan Lyon in India's first innings. However, India's No. 3 remained unbeaten in India's chase as Pujara also scored the winning runs. Pujara smashed Australia's off-spinner Todd Murphy over mid-wicket for a boundary to seal a superb six-wicket victory for the hosts in the Delhi Test. With the victory, India went 2-0 up in the ongoing Border-Gavaskar Trophy 2023, with two more Tests remaining. Speaking in a post-match interview, Pujara admitted he was \"nervous\" as his entire family was in the stands at Arun Jaitley Stadium, Delhi. \"It's been a great Test match, unfortunately I didn't get any runs in the first innings, but I knew if I stay for the first 10 minutes I can score. A special feeling, was very nervous as my entire family was there. A special feeling to hit the winning boundary, looking forward to the remaining 2 Tests,\" said Pujara. Meanwhile, Pujara, who plays for Saurashtra in domestic cricket, also congratulated his side for winning the Ranji Trophy 2022-23 as they defeated Bengal in the final by nine wickets. \"Lovely, congrats to all the guys (on Saurashtra's Ranji triumph), was following the scores until lunch. Great achievement, we've been consistent over the last few years and it's our second title in the last 4 years. So, great work by the guys. I thought we'll chase something around 200-250, so we were prepared to go and do that,\" added Pujara. Speaking about the Delhi track, Pujara said that it was not a tough surface to bat on. \"We were a bit disappointed at yesterday's bowling, we conceded a bit too many runs, but they were excellent today (the spinners). It's not an ideal shot to play because of the low bounce (speaking about the sweep shot), but I have practiced playing it a lot. I try to use my feet, it's always better to play in that manner on such turning wickets. \"Not really (asked if it was one of the tougher wickets to bat on), it's the initial phase, you need to get the pace of the pitch, some balls spun, some went straight on - once you're in, after 30-35 balls, once the ball goes soft, you'll get to a situation where you can play your shots with confidence,\" said Pujara. One for the books! Thank you so much for the warm wishes and support. Indeed, a sweet victory ☺️ pic.twitter.com/ZoCnpIILHE Australia captain Cummins, meanwhile, said that his side was ahead at the end of Day 2 but they let the game slip away. \"I thought 260 was a decent score in the first innings. The guys bounced back well. But India batted well, just 1-2 partnerships and you can get to that 260 mark quite easily. In the innings break, it was all even. Disappointed, we were ahead of the game but we slipped. We need a review on what could have been done different,\" said Cummins. On Australian batters getting out to sweeps, Cummins said,\" Everyone controls their own game, some balls just have your name. But we need a review on the shot choice, did we do things right? Both games were disappointing, this one in particular. We were ahead in the game and that doesn't happen often in India. This loss hurts.\" The second Test between India and Australia will begin on March 1 at Indore's Holkar Stadium.","pubDate":"2023-02-19 19:32:18","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337084-test.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Ben Stokes blasts past Brendon McCullum’s record for Test sixes","link":"https://www.thesouthafrican.com/sport/cricket/ben-stokes-blasts-past-brendon-mccullum-record-for-test-sixes-breaking-19-february-2023/","keywords":["Cricket","Ben Stokes","Brendon McCullum","Featured","latest cricket news"],"creator":["Garrin Lambley"],"video_url":null,"description":"England captain Ben Stokes has overtaken his coach Brendon McCullum as the outright record holder for the most sixes struck in Test cricket.","content":"Big-hitting England captain Ben Stokes on Saturday overtook his coach Brendon McCullum as the outright record holder for the most sixes struck in Test cricket. ALSO READ: In and out: Proteas coach backs up his picks Stokes hoisted the 108th six of his career when he hooked seamer Scott Kuggeleijn over fine leg midway through the third day of the opening Test against New Zealand at Mount Maunganui. The 31-year-old all-rounder immediately signalled to the dressing room, where McCullum was applauding. Stokes made it 109 sixes off the following delivery when he was given a reprieve by boundary fielder Neil Wagner, who caught the shot but over-balanced and put his foot on the rope. ALSO READ: SA confirm new Test captain, latest squad Stokes was out a short time later for 31. Ben Stokes’ record unlikely to be broken soon He took 90 Tests and 164 innings to reach his tally of sixes while McCullum’s 107 were achieved in 176 innings across 101 Tests. Stokes looks set to hold the record for some time. The nearest active player to his mark is veteran New Zealand captain Tim Southee , on 76 sixes. ALSO READ: Theunis de Bruyn’s retirement draws mixed reaction Meanwhile, from a South African point of view, Jacques Kallis holds the record for the most sixes hit. The star all-rounder struck 97 sixes in his 166 Tests and sits fifth in the all-time list.","pubDate":"2023-02-19 19:07:55","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: दिल्ली टेस्ट में हार पर भड़का ऑस्ट्रेलियाई मीडिया, पूर्व खिलाड़ियों ने भी सुनाई खरी-खोटी","link":"https://www.abplive.com/sports/cricket/reaction-of-australian-media-and-former-players-after-the-defeat-in-the-second-test-match-against-india-2338816","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs AUS 2nd Test: भारत के खिलाफ दूसरे टेस्ट मैच में मेजबान ऑस्ट्रेलिया को 6 विकेट से हार का सामना करना पड़ा. इस तरह टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. वहीं, इस हार के बाद ऑस्ट्रेलियाई मीडिया ने अपनी टीम पर जमकर भड़ास निकाली. ऑस्ट्रेलियाई मीडिया ने दिल्ली टेस्ट में टीम की हार को शर्मनाक करार दिया जबकि इस मैच के दौरान कमेन्ट्री कर रहे मार्क वॉ का मानना है कि यह हार ऑस्ट्रेलियाई टीम को काफी नुकसान पहुंचाने वाली है. पूर्व ऑस्ट्रेलियाई खिलाड़ी ने कहा कि मेहमान टीम के पास दिल्ली टेस्ट मैच जीतने का सुनहरा मौका था, लेकिन टीम चूक गई. ऑस्ट्रेलियाई कप्तान पैट कमिंस ने क्या कहा? ऑस्ट्रेलियाई मीडिया के अलावा कंगारू टीम हार के बाद पूर्व खिलाड़ियों के निशाने पर आ गई है. यही नहीं, ऑस्ट्रेलियाई कप्तान पैट कमिंस भी टीम की हार से बेहद निराश दिखे. उन्होंने कहा कि मैच हमारी मुठ्ठी में था, लेकिन हमने गंवा दिया. एलन बॉर्डर और मार्क वॉ के बाद मैथ्यू हेडन ने भी अपनी भड़ास निकाली है. पूर्व ऑस्ट्रेलियाई दिग्गज खिलाड़ी मैथ्यू हेडन ने कहा कि ऐसी पिचों पर स्पिन गेंदबाजी के खिलाफ स्वीप शॉट खेलना खराब विकल्प नहीं है, लेकिन आपको पता होना चाहिए कि आखिर खेलना कैसे है... जिस तरह ऑस्ट्रेलियाई बल्लेबाजों ने स्पिन गेंदबाजों के खिलाफ स्वीप की कोशिश में अपना विकेट गंवाया, वह काफी निराशाजनक है. I am choosing to get outraged about the doctored Indian decks again rather than accept the reality they bask in these conditions and we don't have many answers #moretroublethanearlysettlers — Jon Ralph (@RalphyHeraldSun) February 19, 2023 There was always a good chance that Australia would fall over this morning, but this is catastrophic. #IndvAus — Geoff Lemon Sport (@GeoffLemonSport) February 19, 2023 This is beyond a joke now.Planning horribly wrong.Series swept away in 75 minutes of dreadful test cricket. #INDvAUS — Andy Maher (@AndyMaherDFA) February 19, 2023 Poor shots. Self destruction. Absolutely hopeless. #INDvAUS — Oliver Peterson (@oliverpeterson) February 19, 2023 टीम इंडिया सीरीज में 2-0 से आगे गौरतलब है कि इस जीत के बाद टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. इस तरह भारतीय टीम को जीत के लिए 115 रनों का लक्ष्य मिला था. टीम इंडिया ने 4 विकेट पर 118 रन बनाकर मैच अपने नाम कर लिया. दोनों टीमों के बीच सीरीज का तीसरा मैच 1 मार्च से इंदौर में खेला जाएगा. वहीं, इस सीरीज के आखिरी दोनों मैचे के लिए भारतीय टीम का एलान कर दिया गया है. इंदौर के बाद सीरीज का आखिरी मैच अहमदाबाद के नरेन्द्र मोदी स्टेडियम में खेला जाएगा. ये भी पढ़ें- IND vs AUS ODI Team: ऑस्ट्रेलिया के खिलाफ पहला वनडे नहीं खेलेंगे रोहित शर्मा, जानिए क्या है वजह IND vs AUS: दिल्ली में हार के बाद ऑस्ट्रेलियाई बल्लेबाजों पर भड़के मैथ्यू हेडन, कहा- स्वीप खराब विकल्प नहीं, लेकिन...","content":"IND vs AUS 2nd Test: भारत के खिलाफ दूसरे टेस्ट मैच में मेजबान ऑस्ट्रेलिया को 6 विकेट से हार का सामना करना पड़ा. इस तरह टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. वहीं, इस हार के बाद ऑस्ट्रेलियाई मीडिया ने अपनी टीम पर जमकर भड़ास निकाली. ऑस्ट्रेलियाई मीडिया ने दिल्ली टेस्ट में टीम की हार को शर्मनाक करार दिया जबकि इस मैच के दौरान कमेन्ट्री कर रहे मार्क वॉ का मानना है कि यह हार ऑस्ट्रेलियाई टीम को काफी नुकसान पहुंचाने वाली है. पूर्व ऑस्ट्रेलियाई खिलाड़ी ने कहा कि मेहमान टीम के पास दिल्ली टेस्ट मैच जीतने का सुनहरा मौका था, लेकिन टीम चूक गई. ऑस्ट्रेलियाई कप्तान पैट कमिंस ने क्या कहा? ऑस्ट्रेलियाई मीडिया के अलावा कंगारू टीम हार के बाद पूर्व खिलाड़ियों के निशाने पर आ गई है. यही नहीं, ऑस्ट्रेलियाई कप्तान पैट कमिंस भी टीम की हार से बेहद निराश दिखे. उन्होंने कहा कि मैच हमारी मुठ्ठी में था, लेकिन हमने गंवा दिया. एलन बॉर्डर और मार्क वॉ के बाद मैथ्यू हेडन ने भी अपनी भड़ास निकाली है. पूर्व ऑस्ट्रेलियाई दिग्गज खिलाड़ी मैथ्यू हेडन ने कहा कि ऐसी पिचों पर स्पिन गेंदबाजी के खिलाफ स्वीप शॉट खेलना खराब विकल्प नहीं है, लेकिन आपको पता होना चाहिए कि आखिर खेलना कैसे है... जिस तरह ऑस्ट्रेलियाई बल्लेबाजों ने स्पिन गेंदबाजों के खिलाफ स्वीप की कोशिश में अपना विकेट गंवाया, वह काफी निराशाजनक है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); I am choosing to get outraged about the doctored Indian decks again rather than accept the reality they bask in these conditions and we don't have many answers #moretroublethanearlysettlers — Jon Ralph (@RalphyHeraldSun) February 19, 2023 There was always a good chance that Australia would fall over this morning, but this is catastrophic. #IndvAus — Geoff Lemon Sport (@GeoffLemonSport) February 19, 2023 This is beyond a joke now. Planning horribly wrong. Series swept away in 75 minutes of dreadful test cricket. #INDvAUS — Andy Maher (@AndyMaherDFA) February 19, 2023 Poor shots. Self destruction. Absolutely hopeless. #INDvAUS — Oliver Peterson (@oliverpeterson) February 19, 2023 टीम इंडिया सीरीज में 2-0 से आगे गौरतलब है कि इस जीत के बाद टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. इस तरह भारतीय टीम को जीत के लिए 115 रनों का लक्ष्य मिला था. टीम इंडिया ने 4 विकेट पर 118 रन बनाकर मैच अपने नाम कर लिया. दोनों टीमों के बीच सीरीज का तीसरा मैच 1 मार्च से इंदौर में खेला जाएगा. वहीं, इस सीरीज के आखिरी दोनों मैचे के लिए भारतीय टीम का एलान कर दिया गया है. इंदौर के बाद सीरीज का आखिरी मैच अहमदाबाद के नरेन्द्र मोदी स्टेडियम में खेला जाएगा. ये भी पढ़ें- IND vs AUS ODI Team: ऑस्ट्रेलिया के खिलाफ पहला वनडे नहीं खेलेंगे रोहित शर्मा, जानिए क्या है वजह IND vs AUS: दिल्ली में हार के बाद ऑस्ट्रेलियाई बल्लेबाजों पर भड़के मैथ्यू हेडन, कहा- स्वीप खराब विकल्प नहीं, लेकिन...","pubDate":"2023-02-19 18:23:24","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/19/c1e8e9f7de9f9c43175687fe7e195b3c1676829940234428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“He might soon be removed from Tests” – Ramiz Raja on Australian opener's form in Border-Gavaskar Trophy","link":"https://www.sportskeeda.com/cricket/news-he-might-soon-removed-tests-ramiz-raja-australian-opener-s-form-border-gavaskar-trophy?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"Former Pakistan player Ramiz Raja reckons that Australian batter David Warner’s end in Test cricket is near. This came as the southpaw registered a string of low scores - 1, 10 and 15 - in the last three innings of the ongoing Border-Gavaskar Trophy. Speaking on his YouTube channel, Raja said: The Aussie opener has scored only one double-century and two fifties in the last 17 Tests. For the uninitiated, the southpaw was subbed out in the second Test due to a concussion. Warner also suffered a small hairline fracture in his left elbow after suffering multiple blows from Mohammed Siraj on Day 1. Watch Siraj's fiery spell to Warner below : In a statement, Cricket Australia wrote: Ramiz Raja further believes that the lack of preparation cost Aussies the ongoing Border-Gavaskar Trophy. The cricketer-turned-commentator said: It's worth mentioning that the Aussies lost 16 wickets against spinners in each of their first two Tests. The two teams will now lock horns in the third Test at the Holkar Stadium in Indore, which starts on Wednesday, March 1. After taking a 2-0 lead in the series, India will look to win the Border-Gavaskar Trophy for the fourth time in a row, having won the last three Test series against the Aussies. Meanwhile, the visitors will look to stage a comeback in the remaining two Tests. India’s Test squad for the third and fourth Test: Rohit Sharma (captain), KL Rahul, Shubman Gill , Cheteshwar Pujara, Virat Kohli, KS Bharat (wk), Ishan Kishan (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohammed Shami, Mohammed Siraj, Shreyas Iyer, Suryakumar Yadav, Umesh Yadav, Jaydev Unadkat. Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:19:54","image_url":"https://static.sportskeeda.com/editor/2023/02/2a4f1-16768300058611-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia ‘too high-tempo’ in second Test capitulation, says captain Pat Cummins","link":"https://www.theguardian.com/sport/2023/feb/20/cricket-australia-india-second-test-reaction","keywords":["Australia cricket team","India cricket team","Cricket","Australia sport","Sport"],"creator":["Australian Associated Press"],"video_url":null,"description":"Tourists search for answers after defeat by India inside three daysFormer captain Allan Border ‘disappointed’ and ‘shell-shocked’Captain Pat Cummins has admitted Australia went “too high tempo” in a stunning capitulation as they lost the second Test in Delhi inside three days. Defeat meant Australia’s hopes of winning a Test series in India for the first time in 19 years are over in less than six days of cricket, crushed twice by a ruthless Indian spin attack.While they were never in the contest in the opening Test in Nagpur, at Arjun Jaitley Stadium the tourists began day three with the advantage, but were demoralised by tea. Australia’s collapse of 48-9 was their third-worst in the third innings of a Test, behind the infamous Cape Town debacle of 2011 (36-9) and a match against the World XI in 2005 (47-9) when the country’s golden generation were already in a winning position. Continue reading...","content":"Captain Pat Cummins has admitted Australia went “too high tempo” in a stunning capitulation as they lost the second Test in Delhi inside three days. Defeat meant Australia’s hopes of winning a Test series in India for the first time in 19 years are over in less than six days of cricket, crushed twice by a ruthless Indian spin attack. While they were never in the contest in the opening Test in Nagpur, at Arjun Jaitley Stadium the tourists began day three with the advantage, but were demoralised by tea. Australia’s collapse of 48-9 was their third-worst in the third innings of a Test, behind the infamous Cape Town debacle of 2011 (36-9) and a match against the World XI in 2005 (47-9) when the country’s golden generation were already in a winning position. Australia swept aside by India in manic parade of cross-batted wallops | Geoff Lemon Read more Cummins’ team had plans to attack Ravi Jadeja and Ravichandran Ashwin but they came unstuck in nightmarish fashion as multiple batters fell victim to the sweep shot. Jadeja could only laugh when asked post-game if it was a good idea to try to sweep his bowling. “I’m probably as much to blame as anyone else there,” Cummins said. “Two big things we talk about is the tempo of the game and the method. Maybe at times a little bit too high tempo. I’d rather be high tempo than low tempo though, if those wickets are being difficult, but maybe the method went a little bit away from what we planned to do at times.” Australia dominated periods of the Test and appeared to have a serious chance of handing India their first loss at the Arun Jaitley Stadium since 1987. They managed 263 in their first innings, which looked solid when India collapsed to 139-7 in response. But bowling allrounders Axar Patel and Ashwin saved their side with a 114-run eighth-wicket stand to help leave Australia with just a one-run lead. “Looking back on it, 300 would have been fantastic,” Cummins said. “260 was OK, but if we really want to drive home the advantage we were a few short.” Australia travelled to India as the world’s No 1 ranked Test team, but are still not guaranteed to feature in this year’s World Test Championship final if they lose the series 4-0. They can’t regain the Border-Gavaskar trophy from here but they can lock up their spot in the WTC decider at Lord’s. “Absolutely, it’s still a series to draw,” Cummins said. “That’d be an amazing effort over here in India. So that’s all to play for still.” Former captain Allan Border expressed his dismay at the tourists’ collapse, saying he was “disappointed” and “shell-shocked” by the nature of the collapse. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion “I’m angry about the way they went about it today,” he said. “It was panicky, frenetic sort of batting … nobody got in there to stem the flow with some good defensive cricket. They were all just getting out playing sweep shot, reverse sweep to just about every ball. You can’t get away with that on that sort of track. You’ve got to have a method.” Former opener Matthew Hayden, who starred during Australia’s 2001 tour of India, was also stunned by the rout. “These are world-class players, and they’ve got everything to win and everything to lose in this session,” Hayden said in commentary. “They did it so well last evening in those few overs. But what we’ve seen here is a disaster for Australia. They’ve gone way over the edge in terms of their aggressive play.”","pubDate":"2023-02-19 23:17:22","image_url":"https://i.guim.co.uk/img/media/a824385b3bc6aca2b3c700437c055ea804dc053c/0_204_4303_2583/master/4303.jpg?width=460&quality=85&auto=format&fit=max&s=4acebfe89146274ac577aec32d801674","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"\"It was panicky, frenetic sort of batting\" - Allan Border lambasts Australia's batters after crumbling on day three in Delhi","link":"https://www.sportskeeda.com/cricket/news-it-panicky-frenetic-sort-batting-allan-border-lambasts-australia-s-batters-crumbling-day-three-delhi?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Former Australian captain Allan Border came down hard on Pat Cummins and co. after crumbling on day three of the first Test against India in Delhi. The 67-year-old stated that the tourists were highly reckless in their approach. Australia started day three with 61-1 and were 62 ahead, but ended up losing their remaining nine wickets in the first session for 52 runs. India chased the target of 115 runs in the second session of the game. Instagram Post Speaking to Fox Cricket, Border expressed his anger, claiming that the visitors panicked in the moment and played sweep shots recklessly: The former Aussie cricketer added: Australia's hopes of regaining the Border-Gavaskar Trophy ended in two and a half days as they failed to gain a sizeable lead. The tourists last held the Border-Gavaskar Trophy in the 2014-15 series. Former opening batter Matthew Hayden underlined that the national team's batting performance was a disaster, stating that they played too aggressively. The Queenslander added: He continued: The third Test against India starts on March 1st in Indore. Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:08:53","image_url":"https://static.sportskeeda.com/editor/2023/02/986dc-16768289363620-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"\"It's a fitting tribute to one of Saurashtra's favorite sons\" - Jaydev Unadkat dedicates Ranji Trophy triumph to Cheteshwar Pujara","link":"https://www.sportskeeda.com/cricket/news-it-s-fitting-tribute-one-saurashtra-s-favorite-sons-jaydev-unadkat-dedicates-ranji-trophy-triumph-cheteshwar-pujara?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Gokul Nair"],"video_url":null,"description":null,"content":"Jaydev Unadkat dedicated Saurashtra's 2022-23 Ranji Trophy to his fellow statesman Cheteshwar Pujara. Unadkat led Saurashtra to a nine-wicket win over Bengal on Sunday, February 19, to mark their second title in four years. The left-arm pacer was released from the Indian squad for the second Test against Australia in Delhi to represent Saurashtra in the Ranji Trophy final. Pujara, on the other hand, scripted history in the same timeframe by becoming the 13th Indian player to play 100 Tests. While Pujara was dismissed for a duck in the first innings, he played a composed 71-ball 34-run knock in the second. The gritty batter fittingly hit the winning runs as India claimed a six-wicket win to attain an unassailable 2-0 lead in the four-match series. Naming Pujara as one of Saurashtra's favorite sons, Unadkat said following the title triumph: Pujara has been a stalwart for the state, compiling tons of runs over the years. He played two matches in the recently concluded Ranji Trophy season, scoring 121 runs across three innings before leaving for national duty. Commenting on Saurashtra's winning effort, Unadkat said: He continued: Unadkat has been named in the India squad for the last two Tests against Australia and also finds a place in the subsequent three-match ODI series. Pujara survived an onslaught of spin bowling in the fourth innings as India chased a tricky 115-run target on Day 3 at the Arun Jaitley Stadium in Delhi. He emerged as the top-scorer after coming out to bat in the second over, following KL Rahul's early dismissal. Stating that he was keeping close tabs on the Ranji Trophy final as well, Pujara said: The third India-Australia Test will get underway in Indore on March 1. Where does the current Saurashtra team rank among the greatest Ranji teams? Let us know what you think. Also Read: Jasprit Bumrah yet to get clearance from NCA; IPL workload to be monitored closely - Reports Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:02:09","image_url":"https://static.sportskeeda.com/editor/2023/02/cfaa5-16768299309320-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Ginnivan aims to regain trust as Moore admits drug policy grey area","link":"https://www.brisbanetimes.com.au/sport/afl/ginnivan-aims-to-regain-trust-as-moore-admits-drug-policy-grey-area-20230220-p5clsg.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Collingwood star Jack Ginnivan spoke about his drugs suspension on Monday, coming as Magpies’ skipper Darcy Moore also fronted the cameras.","content":"Suspended Collingwood forward Jack Ginnivan has reiterated he is remorseful about taking an unspecified illicit drug, as Magpies skipper Darcy Moore admitted there was grey area around the AFL’s illicit drugs code. Ginnivan, banned for four matches, including the opening two home-and-away games, gave only a short statement as he arrived at the Magpies’ training base at 7.30am on Monday. “Everyone knows that I am pretty sorry and remorseful for the actions that I did. I am ready to get back to work today and earn back the trust of the group,” he said. Ginnivan, 20, had confessed on Saturday to taking an illicit drug in the bathroom of the Torquay Hotel earlier this month on a day off after the Pies had held a pre-season training camp on the Surf Coast. Ginnivan, who maintains his teammates did not know he had taken an illegal substance, had been filmed by a member of the public, and had been unaware of the video until the media approached the club. Loading As the Magpies arrived for training on Monday, skipper Moore also fronted the cameras, admitting the club was disappointed in Ginnivan, but adamant there was not a wider drug problem at the club. “Jack has made an error of judgment. We get a lot of education. I think the community knows that and that is a source of disappointment for us. In this case, it is a 21-year-old man who has made an error of judgment at a venue,” Moore said. “He has owned that, we have owned that, and the sanction has been dealt with appropriately. “We have over 90 male and female athletes at this club, the large majority of whom take their job really seriously and make great decisions. But having said that, we don’t operate in a vacuum, we are human beings, people make errors of judgment, and it’s something that Jack has done in this instance.” Collingwood skipper Darcy Moore says he is looking forward to reading a review of the AFL’s illicit drugs ccode. Credit: Nine News Moore repeatedly said Ginnivan, a “popular, bubbly teammate”, had made an “error of judgment”, and it would take time for him to regain the trust of his teammates. “It’s not easy, but I am sure he will use this time to put his best foot forward and earn a bit of a trust from the team,” he said. The articulate Moore, who this month has replaced veteran Scott Pendlebury as captain, is also on the AFL Players Association’s board, and has detailed knowledge of the AFL’s three-strikes illicit drugs policy. This policy has been under review for the past year, but progress has been slow. Former Hawthorn president Jeff Kennett and Western Bulldogs coach Luke Beveridge have been among those calling for change, particularly when it comes to who is informed of a first strike. AFL medical directors and the player’s club doctor – but not club management – are told of a positive first test, unless there is footage available, as was the case for Ginnivan. Loading It is then referred by the AFL medical officer to the club doctor to determine the best course of action, including what treatment the player should be referred to. “It’s being reviewed. It’s been reviewed, the IDP [illicit drugs policy], over the past 12 months by the AFL, a third-party medical specialist and the AFL Players Association,” Moore said. “The IDP is a voluntary program that players have signed up to in order to safeguard their welfare and wellbeing. It’s, obviously, something that is much talked about, especially when incidents like this occur. I am really looking forward to seeing the outcome of that review and what the AFL and the independent experts have to say about how effective it is. “Obviously, the model is designed around welfare and wellbeing and harm minimisation of drugs amongst young people, in this case, AFL players. I am really looking forward to the results of that.” Where the number of positive tests was once publicly released and reported by the media, the players have successfully pushed for those figures to be suppressed, arguing the release of the figures only added to the strain players felt. The flipside is that officials argue this only adds to a shroud of secrecy. “It [the policy] plays an important role around the league in terms of flagging players who are at risk of making mistakes around drug use, provides valuable de-identified data around the prevalence of drug use to the league and to the medical experts to keep tabs on how big of an issue this is,” Moore said. “I think the challenging part of it is certainly when things become public because obviously around a welfare and harm minimisation model not everything is going to be public. When it does, it can certainly create a bit more grey area, I suppose.” Loading However, Moore said the current policy was a strong enough deterrent. Ginnivan has also received a suspended $5000 fine, counselling and will be target-tested. He will also take a hit in terms of lost match payments. Moore said the Magpies were concerned only for Ginnivan’s welfare. “I think the general public can make up their mind about someone being filmed in a cubicle but ... Jack has owned his behaviour. Our main concern is about the behaviour and mistake Jack has made, and he has owned that. He has fallen short of the standards, it is disappointing, I am sure he will learn from it,” Moore said. “Unfortunately, he sustained a bit of an injury [gashed knee] at Friday night’s [intra-club] match. He is a little bit sore, and obviously disappointed with himself. He certainly feels the weight of that. We have to make sure that we support him and safeguard his welfare.” The Magpies must now regroup and focus on their opening practice match, against Carlton at Ikon Park on Friday. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL off-field behaviour Collingwood Magpies AFL 2023 Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-02-19 22:00:23","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Saurashtra lift Ranji Trophy for 2nd time","link":"https://www.thehansindia.com/sports/saurashtra-lift-ranji-trophy-for-2nd-time-783882","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Unadkat-led side thrash WBengal by nine wickets in final","content":"Kolkata: Left-arm pacer Jaydev Unadkat returned a match haul of nine wickets, including 6/85 in the second innings, as Saurashtra thrashed Bengal by nine wickets in the summit clash to clinch their second Ranji Trophy title here on Sunday. Having given away a big first innings lead of 230 runs, Bengal, who were overnight 169/4 in their second essay, folded for 241, handing the visitors a mere 12 runs target to win the final. Saurashtra lost their opening batter Jay Gohil (0) off the bowling of Akash Deep but eventually went past the target, reaching 14 for 1 in 2.4 overs, to wrap up the match with one day and two full sessions to spare. Saurashtra's earlier triumph was in 2019-20 season when they defeated Bengal on the basis of first innings lead. In the last 10 seasons, they have made the final on five occasions, underlining their consistency. A Ranji Trophy title eluded Bengal yet again. They last won it in 1998-90 when they defeated a star-studded Delhi at the same Eden Gardens. Their first title had come in 1938-39 in the pre-independence era. Earlier in the morning session, Unadkat showed the way after a freak run-out of Bengal batter Shahbaz Ahmed (27). The veteran Saurashtra skipper added four wickets to his overnight tally of two. The old Bengal warhorse duo of skipper Manoj Tiwary (68) and Anustup Majumdar (61) slammed valiant half-centuries but the home side were let down by their top-order batters, including the promising Abhimanyu Easwaran who scored 0 and 16 in the two innings. In-form No. 3 batter Sudip Gharami, who is fresh from a 112 and 41 in the semifinal against Madhya Pradesh and has 800-plus runs this season, also came a cropper and scored 0 and 14 in the two innings. The decision to hand debut to Sumanta Gupta in a Ranji final also will rankle Bengal as he did not show any technique of a top-order batter and perished to an outgoing delivery. State sports minister-cum-cricketer Tiwary had delayed his retirement to win a Ranji title from his fourth final, and it remains to be seen whether he continue to play in the upcoming season. (PTI) Brief Scores: Bengal 174 and 241 in 70.4 overs (Manoj Tiwary 68, Anustup Majumdar 61; Jaydev Unadkat 6/85, Chetan Sakariya 3/76). Saurashtra 404 and 14/1 in 2.4 overs. Saurashtra won by nine wickets.","pubDate":"2023-02-19 20:55:19","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337136-jaydev-unadkat.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"India retain Border-Gavaskar Trophy","link":"https://www.thehansindia.com/sports/india-retain-border-gavaskar-trophy-783880","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Hosts win by six wickets as Jadeja, Ashwin demolish Australia","content":"India’s Ravindra Jadeja and Axar patel react during the third day of the 2nd Test against Australia, at the Arun Jaitley Stadium, in New Delhi on Sunday New Delhi: Riding on left-arm spinner Ravindra Jadeja's best bowling figures in an innings in Test cricket (7/42) along with Ravichandran Ashwin's spin masterclass, India defeated Australia by six wickets in the second Test within three days to take 2-0 lead in the four-match series and retain Border-Gavaskar Trophy at the Arun Jaitley Stadium, here on Sunday. Ashwin set up the collapse to pick 3/59, before Jadeja ran through the Australian batting line-up as Australia crashed to 113 all out, after starting the day from 61/1 and being 86/2 at one stage, in their second innings. The Australian batting implosion gave India a target of 115, which they completed in 28.4 overs. Rohit Sharma began the chase by driving wide of mid-on for a boundary off Matthew Kuhnemann in the opening over. But in the next over, he lost his opening partner KL Rahul in an unlucky fashion. Rahul flicked well to the right of short leg off Nathan Lyon, but the ball lobbed up in the air after hitting the top of forward short leg's pad and the keeper took an easy catch. Rohit showed exquisite timing in whipping an overpitched delivery off Kuhnemann between deep mid-wicket and long-on. Post lunch, India began with an attacking intent, as Cheteshwar Pujara danced down the pitch to whip Matthew Kuhnemann through mid-wicket for four. Rohit came out in the next over to loft over wide mid-wicket for six off Lyon, followed by paddling off him for four more. The Indian skipper then danced down the pitch against Kuhnemann, slamming a six over the bowler's head but he was run-out in a horrible mix-up and sacrificed himself to keep Pujara at the crease. Pujara and Virat Kohli were positive in their footwork, defence and got the boundaries too. While Pujara danced down the pitch to loft Lyon over mid-on, Kohli got close to the ball and used his supple wrists to chip a drive past the off-spinner. He followed it up with a gentle tickle through fine leg and placing a flick between two fielders in the square leg region. Kohli fell for 20 when he was beaten through the air and on the outside edge by Todd Murphy and was stumped from behind by Alex Carey. Pujara and Shreyas Iyer continued to get boundaries on a fast clip -- while the former was pristine in punching off Murphy, the latter was splendid in cutting off Lyon and dancing down the pitch against Murphy to get four and six respectively. In a bid to attack against Lyon, Iyer danced down the pitch again for an expansive slog, but holed out to deep mid-wicket. KS Bharat was gorgeous in driving twice through the extra cover against Lyon and Kuhnemann. He would go on to drive through cover again off Kuhnemann for boundary and brought the crowd on its feet with a slog-sweep over deep mid-wicket for six off part-timer Travis Head. Pujara, playing in his 100th Test, finished off the chase by dancing down the pitch and flicking over mid-wicket to give India another victory in the series. Australia will be mighty disappointed by some extremely questionable shot selection and squandering the advantage they had at stumps on day two. Resuming from 61/1, with a healthy run-rate of 5.08 at the end of day two, Australia imploded spectacularly to lose nine wickets for 53 runs in a frenetic morning session. Brief scores: Australia 263 and 113 in 31.3 overs (Travis Head 43, Marnus Labuschagne 35; Ravindra Jadeja 7/42, Ravichandran Ashwin 3/59) lost to India 262 in 83.3 overs and 118/4 in 28.4 overs (Rohit Sharma 31, Cheteshwar Pujara 31 not out; Nathan Lyon 2/49, Todd Murphy 1/22) by six wickets.","pubDate":"2023-02-19 20:51:32","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337134-ravichandran-ashwin.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia gift Cheteshwar Pujara signed jersey for completing 100 Tests","link":"https://www.thehansindia.com/sports/cricket/australia-gift-cheteshwar-pujara-signed-jersey-for-completing-100-tests-783828","keywords":["Sports,Cricket"],"creator":["Sakshi Gupta"],"video_url":null,"description":"The Delhi game was Pujara’s 100th appearance in TestsIndia defeated Australia by 6 wickets in the second TestPujara deservedly hit the winning runs","content":"Pat Cummins presented a signed Australian jersey to Indian batsman Cheteshwar Pujara on Sunday for completing 100 Tests. The Board of Control for Cricket in India (BCCI) shared a picture of Cummins handing the signed jersey to Pujara, who became only the 13th Indian cricketer to reach the 100-mark in Tests. \"What a special gesture that was,\" wrote BCCI in a tweet along with the said picture. Spirit of Cricket 👏🏻👏🏻 Pat Cummins 🤝 Cheteshwar Pujara What a special gesture that was! 🇮🇳🇦🇺 #TeamIndia | #INDvAUS pic.twitter.com/3MNcxfhoIQ Pujara started off his 100th Test on a low after he was dismissed for a seven-ball duck by Australian spinner Nathan Lyon in India's first innings. However, India's No. 3 remained unbeaten in India's chase as Pujara also scored the winning runs. Pujara smashed Australia's off-spinner Todd Murphy over mid-wicket for a boundary to seal a superb six-wicket victory for the hosts in the Delhi Test. With the victory, India went 2-0 up in the ongoing Border-Gavaskar Trophy 2023, with two more Tests remaining. Speaking in a post-match interview, Pujara admitted he was \"nervous\" as his entire family was in the stands at Arun Jaitley Stadium, Delhi. \"It's been a great Test match, unfortunately I didn't get any runs in the first innings, but I knew if I stay for the first 10 minutes I can score. A special feeling, was very nervous as my entire family was there. A special feeling to hit the winning boundary, looking forward to the remaining 2 Tests,\" said Pujara. Meanwhile, Pujara, who plays for Saurashtra in domestic cricket, also congratulated his side for winning the Ranji Trophy 2022-23 as they defeated Bengal in the final by nine wickets. \"Lovely, congrats to all the guys (on Saurashtra's Ranji triumph), was following the scores until lunch. Great achievement, we've been consistent over the last few years and it's our second title in the last 4 years. So, great work by the guys. I thought we'll chase something around 200-250, so we were prepared to go and do that,\" added Pujara. Speaking about the Delhi track, Pujara said that it was not a tough surface to bat on. \"We were a bit disappointed at yesterday's bowling, we conceded a bit too many runs, but they were excellent today (the spinners). It's not an ideal shot to play because of the low bounce (speaking about the sweep shot), but I have practiced playing it a lot. I try to use my feet, it's always better to play in that manner on such turning wickets. \"Not really (asked if it was one of the tougher wickets to bat on), it's the initial phase, you need to get the pace of the pitch, some balls spun, some went straight on - once you're in, after 30-35 balls, once the ball goes soft, you'll get to a situation where you can play your shots with confidence,\" said Pujara. One for the books! Thank you so much for the warm wishes and support. Indeed, a sweet victory ☺️ pic.twitter.com/ZoCnpIILHE Australia captain Cummins, meanwhile, said that his side was ahead at the end of Day 2 but they let the game slip away. \"I thought 260 was a decent score in the first innings. The guys bounced back well. But India batted well, just 1-2 partnerships and you can get to that 260 mark quite easily. In the innings break, it was all even. Disappointed, we were ahead of the game but we slipped. We need a review on what could have been done different,\" said Cummins. On Australian batters getting out to sweeps, Cummins said,\" Everyone controls their own game, some balls just have your name. But we need a review on the shot choice, did we do things right? Both games were disappointing, this one in particular. We were ahead in the game and that doesn't happen often in India. This loss hurts.\" The second Test between India and Australia will begin on March 1 at Indore's Holkar Stadium.","pubDate":"2023-02-19 19:32:18","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337084-test.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Ben Stokes blasts past Brendon McCullum’s record for Test sixes","link":"https://www.thesouthafrican.com/sport/cricket/ben-stokes-blasts-past-brendon-mccullum-record-for-test-sixes-breaking-19-february-2023/","keywords":["Cricket","Ben Stokes","Brendon McCullum","Featured","latest cricket news"],"creator":["Garrin Lambley"],"video_url":null,"description":"England captain Ben Stokes has overtaken his coach Brendon McCullum as the outright record holder for the most sixes struck in Test cricket.","content":"Big-hitting England captain Ben Stokes on Saturday overtook his coach Brendon McCullum as the outright record holder for the most sixes struck in Test cricket. ALSO READ: In and out: Proteas coach backs up his picks Stokes hoisted the 108th six of his career when he hooked seamer Scott Kuggeleijn over fine leg midway through the third day of the opening Test against New Zealand at Mount Maunganui. The 31-year-old all-rounder immediately signalled to the dressing room, where McCullum was applauding. Stokes made it 109 sixes off the following delivery when he was given a reprieve by boundary fielder Neil Wagner, who caught the shot but over-balanced and put his foot on the rope. ALSO READ: SA confirm new Test captain, latest squad Stokes was out a short time later for 31. Ben Stokes’ record unlikely to be broken soon He took 90 Tests and 164 innings to reach his tally of sixes while McCullum’s 107 were achieved in 176 innings across 101 Tests. Stokes looks set to hold the record for some time. The nearest active player to his mark is veteran New Zealand captain Tim Southee , on 76 sixes. ALSO READ: Theunis de Bruyn’s retirement draws mixed reaction Meanwhile, from a South African point of view, Jacques Kallis holds the record for the most sixes hit. The star all-rounder struck 97 sixes in his 166 Tests and sits fifth in the all-time list.","pubDate":"2023-02-19 19:07:55","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: दिल्ली टेस्ट में हार पर भड़का ऑस्ट्रेलियाई मीडिया, पूर्व खिलाड़ियों ने भी सुनाई खरी-खोटी","link":"https://www.abplive.com/sports/cricket/reaction-of-australian-media-and-former-players-after-the-defeat-in-the-second-test-match-against-india-2338816","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs AUS 2nd Test: भारत के खिलाफ दूसरे टेस्ट मैच में मेजबान ऑस्ट्रेलिया को 6 विकेट से हार का सामना करना पड़ा. इस तरह टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. वहीं, इस हार के बाद ऑस्ट्रेलियाई मीडिया ने अपनी टीम पर जमकर भड़ास निकाली. ऑस्ट्रेलियाई मीडिया ने दिल्ली टेस्ट में टीम की हार को शर्मनाक करार दिया जबकि इस मैच के दौरान कमेन्ट्री कर रहे मार्क वॉ का मानना है कि यह हार ऑस्ट्रेलियाई टीम को काफी नुकसान पहुंचाने वाली है. पूर्व ऑस्ट्रेलियाई खिलाड़ी ने कहा कि मेहमान टीम के पास दिल्ली टेस्ट मैच जीतने का सुनहरा मौका था, लेकिन टीम चूक गई. ऑस्ट्रेलियाई कप्तान पैट कमिंस ने क्या कहा? ऑस्ट्रेलियाई मीडिया के अलावा कंगारू टीम हार के बाद पूर्व खिलाड़ियों के निशाने पर आ गई है. यही नहीं, ऑस्ट्रेलियाई कप्तान पैट कमिंस भी टीम की हार से बेहद निराश दिखे. उन्होंने कहा कि मैच हमारी मुठ्ठी में था, लेकिन हमने गंवा दिया. एलन बॉर्डर और मार्क वॉ के बाद मैथ्यू हेडन ने भी अपनी भड़ास निकाली है. पूर्व ऑस्ट्रेलियाई दिग्गज खिलाड़ी मैथ्यू हेडन ने कहा कि ऐसी पिचों पर स्पिन गेंदबाजी के खिलाफ स्वीप शॉट खेलना खराब विकल्प नहीं है, लेकिन आपको पता होना चाहिए कि आखिर खेलना कैसे है... जिस तरह ऑस्ट्रेलियाई बल्लेबाजों ने स्पिन गेंदबाजों के खिलाफ स्वीप की कोशिश में अपना विकेट गंवाया, वह काफी निराशाजनक है. I am choosing to get outraged about the doctored Indian decks again rather than accept the reality they bask in these conditions and we don't have many answers #moretroublethanearlysettlers — Jon Ralph (@RalphyHeraldSun) February 19, 2023 There was always a good chance that Australia would fall over this morning, but this is catastrophic. #IndvAus — Geoff Lemon Sport (@GeoffLemonSport) February 19, 2023 This is beyond a joke now.Planning horribly wrong.Series swept away in 75 minutes of dreadful test cricket. #INDvAUS — Andy Maher (@AndyMaherDFA) February 19, 2023 Poor shots. Self destruction. Absolutely hopeless. #INDvAUS — Oliver Peterson (@oliverpeterson) February 19, 2023 टीम इंडिया सीरीज में 2-0 से आगे गौरतलब है कि इस जीत के बाद टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. इस तरह भारतीय टीम को जीत के लिए 115 रनों का लक्ष्य मिला था. टीम इंडिया ने 4 विकेट पर 118 रन बनाकर मैच अपने नाम कर लिया. दोनों टीमों के बीच सीरीज का तीसरा मैच 1 मार्च से इंदौर में खेला जाएगा. वहीं, इस सीरीज के आखिरी दोनों मैचे के लिए भारतीय टीम का एलान कर दिया गया है. इंदौर के बाद सीरीज का आखिरी मैच अहमदाबाद के नरेन्द्र मोदी स्टेडियम में खेला जाएगा. ये भी पढ़ें- IND vs AUS ODI Team: ऑस्ट्रेलिया के खिलाफ पहला वनडे नहीं खेलेंगे रोहित शर्मा, जानिए क्या है वजह IND vs AUS: दिल्ली में हार के बाद ऑस्ट्रेलियाई बल्लेबाजों पर भड़के मैथ्यू हेडन, कहा- स्वीप खराब विकल्प नहीं, लेकिन...","content":"IND vs AUS 2nd Test: भारत के खिलाफ दूसरे टेस्ट मैच में मेजबान ऑस्ट्रेलिया को 6 विकेट से हार का सामना करना पड़ा. इस तरह टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. वहीं, इस हार के बाद ऑस्ट्रेलियाई मीडिया ने अपनी टीम पर जमकर भड़ास निकाली. ऑस्ट्रेलियाई मीडिया ने दिल्ली टेस्ट में टीम की हार को शर्मनाक करार दिया जबकि इस मैच के दौरान कमेन्ट्री कर रहे मार्क वॉ का मानना है कि यह हार ऑस्ट्रेलियाई टीम को काफी नुकसान पहुंचाने वाली है. पूर्व ऑस्ट्रेलियाई खिलाड़ी ने कहा कि मेहमान टीम के पास दिल्ली टेस्ट मैच जीतने का सुनहरा मौका था, लेकिन टीम चूक गई. ऑस्ट्रेलियाई कप्तान पैट कमिंस ने क्या कहा? ऑस्ट्रेलियाई मीडिया के अलावा कंगारू टीम हार के बाद पूर्व खिलाड़ियों के निशाने पर आ गई है. यही नहीं, ऑस्ट्रेलियाई कप्तान पैट कमिंस भी टीम की हार से बेहद निराश दिखे. उन्होंने कहा कि मैच हमारी मुठ्ठी में था, लेकिन हमने गंवा दिया. एलन बॉर्डर और मार्क वॉ के बाद मैथ्यू हेडन ने भी अपनी भड़ास निकाली है. पूर्व ऑस्ट्रेलियाई दिग्गज खिलाड़ी मैथ्यू हेडन ने कहा कि ऐसी पिचों पर स्पिन गेंदबाजी के खिलाफ स्वीप शॉट खेलना खराब विकल्प नहीं है, लेकिन आपको पता होना चाहिए कि आखिर खेलना कैसे है... जिस तरह ऑस्ट्रेलियाई बल्लेबाजों ने स्पिन गेंदबाजों के खिलाफ स्वीप की कोशिश में अपना विकेट गंवाया, वह काफी निराशाजनक है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); I am choosing to get outraged about the doctored Indian decks again rather than accept the reality they bask in these conditions and we don't have many answers #moretroublethanearlysettlers — Jon Ralph (@RalphyHeraldSun) February 19, 2023 There was always a good chance that Australia would fall over this morning, but this is catastrophic. #IndvAus — Geoff Lemon Sport (@GeoffLemonSport) February 19, 2023 This is beyond a joke now. Planning horribly wrong. Series swept away in 75 minutes of dreadful test cricket. #INDvAUS — Andy Maher (@AndyMaherDFA) February 19, 2023 Poor shots. Self destruction. Absolutely hopeless. #INDvAUS — Oliver Peterson (@oliverpeterson) February 19, 2023 टीम इंडिया सीरीज में 2-0 से आगे गौरतलब है कि इस जीत के बाद टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. इस तरह भारतीय टीम को जीत के लिए 115 रनों का लक्ष्य मिला था. टीम इंडिया ने 4 विकेट पर 118 रन बनाकर मैच अपने नाम कर लिया. दोनों टीमों के बीच सीरीज का तीसरा मैच 1 मार्च से इंदौर में खेला जाएगा. वहीं, इस सीरीज के आखिरी दोनों मैचे के लिए भारतीय टीम का एलान कर दिया गया है. इंदौर के बाद सीरीज का आखिरी मैच अहमदाबाद के नरेन्द्र मोदी स्टेडियम में खेला जाएगा. ये भी पढ़ें- IND vs AUS ODI Team: ऑस्ट्रेलिया के खिलाफ पहला वनडे नहीं खेलेंगे रोहित शर्मा, जानिए क्या है वजह IND vs AUS: दिल्ली में हार के बाद ऑस्ट्रेलियाई बल्लेबाजों पर भड़के मैथ्यू हेडन, कहा- स्वीप खराब विकल्प नहीं, लेकिन...","pubDate":"2023-02-19 18:23:24","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/19/c1e8e9f7de9f9c43175687fe7e195b3c1676829940234428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"},{"title":"“He might soon be removed from Tests” – Ramiz Raja on Australian opener's form in Border-Gavaskar Trophy","link":"https://www.sportskeeda.com/cricket/news-he-might-soon-removed-tests-ramiz-raja-australian-opener-s-form-border-gavaskar-trophy?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["James Kuanal"],"video_url":null,"description":null,"content":"Former Pakistan player Ramiz Raja reckons that Australian batter David Warner’s end in Test cricket is near. This came as the southpaw registered a string of low scores - 1, 10 and 15 - in the last three innings of the ongoing Border-Gavaskar Trophy. Speaking on his YouTube channel, Raja said: The Aussie opener has scored only one double-century and two fifties in the last 17 Tests. For the uninitiated, the southpaw was subbed out in the second Test due to a concussion. Warner also suffered a small hairline fracture in his left elbow after suffering multiple blows from Mohammed Siraj on Day 1. Watch Siraj's fiery spell to Warner below : In a statement, Cricket Australia wrote: Ramiz Raja further believes that the lack of preparation cost Aussies the ongoing Border-Gavaskar Trophy. The cricketer-turned-commentator said: It's worth mentioning that the Aussies lost 16 wickets against spinners in each of their first two Tests. The two teams will now lock horns in the third Test at the Holkar Stadium in Indore, which starts on Wednesday, March 1. After taking a 2-0 lead in the series, India will look to win the Border-Gavaskar Trophy for the fourth time in a row, having won the last three Test series against the Aussies. Meanwhile, the visitors will look to stage a comeback in the remaining two Tests. India’s Test squad for the third and fourth Test: Rohit Sharma (captain), KL Rahul, Shubman Gill , Cheteshwar Pujara, Virat Kohli, KS Bharat (wk), Ishan Kishan (wk), Ravichandran Ashwin, Axar Patel, Kuldeep Yadav, Ravindra Jadeja, Mohammed Shami, Mohammed Siraj, Shreyas Iyer, Suryakumar Yadav, Umesh Yadav, Jaydev Unadkat. Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:19:54","image_url":"https://static.sportskeeda.com/editor/2023/02/2a4f1-16768300058611-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia ‘too high-tempo’ in second Test capitulation, says captain Pat Cummins","link":"https://www.theguardian.com/sport/2023/feb/20/cricket-australia-india-second-test-reaction","keywords":["Australia cricket team","India cricket team","Cricket","Australia sport","Sport"],"creator":["Australian Associated Press"],"video_url":null,"description":"Tourists search for answers after defeat by India inside three daysFormer captain Allan Border ‘disappointed’ and ‘shell-shocked’Captain Pat Cummins has admitted Australia went “too high tempo” in a stunning capitulation as they lost the second Test in Delhi inside three days. Defeat meant Australia’s hopes of winning a Test series in India for the first time in 19 years are over in less than six days of cricket, crushed twice by a ruthless Indian spin attack.While they were never in the contest in the opening Test in Nagpur, at Arjun Jaitley Stadium the tourists began day three with the advantage, but were demoralised by tea. Australia’s collapse of 48-9 was their third-worst in the third innings of a Test, behind the infamous Cape Town debacle of 2011 (36-9) and a match against the World XI in 2005 (47-9) when the country’s golden generation were already in a winning position. Continue reading...","content":"Captain Pat Cummins has admitted Australia went “too high tempo” in a stunning capitulation as they lost the second Test in Delhi inside three days. Defeat meant Australia’s hopes of winning a Test series in India for the first time in 19 years are over in less than six days of cricket, crushed twice by a ruthless Indian spin attack. While they were never in the contest in the opening Test in Nagpur, at Arjun Jaitley Stadium the tourists began day three with the advantage, but were demoralised by tea. Australia’s collapse of 48-9 was their third-worst in the third innings of a Test, behind the infamous Cape Town debacle of 2011 (36-9) and a match against the World XI in 2005 (47-9) when the country’s golden generation were already in a winning position. Australia swept aside by India in manic parade of cross-batted wallops | Geoff Lemon Read more Cummins’ team had plans to attack Ravi Jadeja and Ravichandran Ashwin but they came unstuck in nightmarish fashion as multiple batters fell victim to the sweep shot. Jadeja could only laugh when asked post-game if it was a good idea to try to sweep his bowling. “I’m probably as much to blame as anyone else there,” Cummins said. “Two big things we talk about is the tempo of the game and the method. Maybe at times a little bit too high tempo. I’d rather be high tempo than low tempo though, if those wickets are being difficult, but maybe the method went a little bit away from what we planned to do at times.” Australia dominated periods of the Test and appeared to have a serious chance of handing India their first loss at the Arun Jaitley Stadium since 1987. They managed 263 in their first innings, which looked solid when India collapsed to 139-7 in response. But bowling allrounders Axar Patel and Ashwin saved their side with a 114-run eighth-wicket stand to help leave Australia with just a one-run lead. “Looking back on it, 300 would have been fantastic,” Cummins said. “260 was OK, but if we really want to drive home the advantage we were a few short.” Australia travelled to India as the world’s No 1 ranked Test team, but are still not guaranteed to feature in this year’s World Test Championship final if they lose the series 4-0. They can’t regain the Border-Gavaskar trophy from here but they can lock up their spot in the WTC decider at Lord’s. “Absolutely, it’s still a series to draw,” Cummins said. “That’d be an amazing effort over here in India. So that’s all to play for still.” Former captain Allan Border expressed his dismay at the tourists’ collapse, saying he was “disappointed” and “shell-shocked” by the nature of the collapse. skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion “I’m angry about the way they went about it today,” he said. “It was panicky, frenetic sort of batting … nobody got in there to stem the flow with some good defensive cricket. They were all just getting out playing sweep shot, reverse sweep to just about every ball. You can’t get away with that on that sort of track. You’ve got to have a method.” Former opener Matthew Hayden, who starred during Australia’s 2001 tour of India, was also stunned by the rout. “These are world-class players, and they’ve got everything to win and everything to lose in this session,” Hayden said in commentary. “They did it so well last evening in those few overs. But what we’ve seen here is a disaster for Australia. They’ve gone way over the edge in terms of their aggressive play.”","pubDate":"2023-02-19 23:17:22","image_url":"https://i.guim.co.uk/img/media/a824385b3bc6aca2b3c700437c055ea804dc053c/0_204_4303_2583/master/4303.jpg?width=460&quality=85&auto=format&fit=max&s=4acebfe89146274ac577aec32d801674","source_id":"theguardian","category":["sports"],"country":["canada","united kingdom","india","singapore"],"language":"english"},{"title":"\"It was panicky, frenetic sort of batting\" - Allan Border lambasts Australia's batters after crumbling on day three in Delhi","link":"https://www.sportskeeda.com/cricket/news-it-panicky-frenetic-sort-batting-allan-border-lambasts-australia-s-batters-crumbling-day-three-delhi?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aayushman Vishwanathan"],"video_url":null,"description":null,"content":"Former Australian captain Allan Border came down hard on Pat Cummins and co. after crumbling on day three of the first Test against India in Delhi. The 67-year-old stated that the tourists were highly reckless in their approach. Australia started day three with 61-1 and were 62 ahead, but ended up losing their remaining nine wickets in the first session for 52 runs. India chased the target of 115 runs in the second session of the game. Instagram Post Speaking to Fox Cricket, Border expressed his anger, claiming that the visitors panicked in the moment and played sweep shots recklessly: The former Aussie cricketer added: Australia's hopes of regaining the Border-Gavaskar Trophy ended in two and a half days as they failed to gain a sizeable lead. The tourists last held the Border-Gavaskar Trophy in the 2014-15 series. Former opening batter Matthew Hayden underlined that the national team's batting performance was a disaster, stating that they played too aggressively. The Queenslander added: He continued: The third Test against India starts on March 1st in Indore. Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:08:53","image_url":"https://static.sportskeeda.com/editor/2023/02/986dc-16768289363620-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"\"It's a fitting tribute to one of Saurashtra's favorite sons\" - Jaydev Unadkat dedicates Ranji Trophy triumph to Cheteshwar Pujara","link":"https://www.sportskeeda.com/cricket/news-it-s-fitting-tribute-one-saurashtra-s-favorite-sons-jaydev-unadkat-dedicates-ranji-trophy-triumph-cheteshwar-pujara?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Gokul Nair"],"video_url":null,"description":null,"content":"Jaydev Unadkat dedicated Saurashtra's 2022-23 Ranji Trophy to his fellow statesman Cheteshwar Pujara. Unadkat led Saurashtra to a nine-wicket win over Bengal on Sunday, February 19, to mark their second title in four years. The left-arm pacer was released from the Indian squad for the second Test against Australia in Delhi to represent Saurashtra in the Ranji Trophy final. Pujara, on the other hand, scripted history in the same timeframe by becoming the 13th Indian player to play 100 Tests. While Pujara was dismissed for a duck in the first innings, he played a composed 71-ball 34-run knock in the second. The gritty batter fittingly hit the winning runs as India claimed a six-wicket win to attain an unassailable 2-0 lead in the four-match series. Naming Pujara as one of Saurashtra's favorite sons, Unadkat said following the title triumph: Pujara has been a stalwart for the state, compiling tons of runs over the years. He played two matches in the recently concluded Ranji Trophy season, scoring 121 runs across three innings before leaving for national duty. Commenting on Saurashtra's winning effort, Unadkat said: He continued: Unadkat has been named in the India squad for the last two Tests against Australia and also finds a place in the subsequent three-match ODI series. Pujara survived an onslaught of spin bowling in the fourth innings as India chased a tricky 115-run target on Day 3 at the Arun Jaitley Stadium in Delhi. He emerged as the top-scorer after coming out to bat in the second over, following KL Rahul's early dismissal. Stating that he was keeping close tabs on the Ranji Trophy final as well, Pujara said: The third India-Australia Test will get underway in Indore on March 1. Where does the current Saurashtra team rank among the greatest Ranji teams? Let us know what you think. Also Read: Jasprit Bumrah yet to get clearance from NCA; IPL workload to be monitored closely - Reports Get the IND vs AUS Live Score for 2nd Test. Follow Sportskeeda for latest updates and news. Poll : 0 votes Quick Links","pubDate":"2023-02-19 23:02:09","image_url":"https://static.sportskeeda.com/editor/2023/02/cfaa5-16768299309320-1920.jpg","source_id":"sportskeeda","category":["sports"],"country":["india"],"language":"english"},{"title":"Ginnivan aims to regain trust as Moore admits drug policy grey area","link":"https://www.brisbanetimes.com.au/sport/afl/ginnivan-aims-to-regain-trust-as-moore-admits-drug-policy-grey-area-20230220-p5clsg.html?ref=rss&utm_medium=rss&utm_source=rss_sport","keywords":null,"creator":["Jon Pierik"],"video_url":null,"description":"Collingwood star Jack Ginnivan spoke about his drugs suspension on Monday, coming as Magpies’ skipper Darcy Moore also fronted the cameras.","content":"Suspended Collingwood forward Jack Ginnivan has reiterated he is remorseful about taking an unspecified illicit drug, as Magpies skipper Darcy Moore admitted there was grey area around the AFL’s illicit drugs code. Ginnivan, banned for four matches, including the opening two home-and-away games, gave only a short statement as he arrived at the Magpies’ training base at 7.30am on Monday. “Everyone knows that I am pretty sorry and remorseful for the actions that I did. I am ready to get back to work today and earn back the trust of the group,” he said. Ginnivan, 20, had confessed on Saturday to taking an illicit drug in the bathroom of the Torquay Hotel earlier this month on a day off after the Pies had held a pre-season training camp on the Surf Coast. Ginnivan, who maintains his teammates did not know he had taken an illegal substance, had been filmed by a member of the public, and had been unaware of the video until the media approached the club. Loading As the Magpies arrived for training on Monday, skipper Moore also fronted the cameras, admitting the club was disappointed in Ginnivan, but adamant there was not a wider drug problem at the club. “Jack has made an error of judgment. We get a lot of education. I think the community knows that and that is a source of disappointment for us. In this case, it is a 21-year-old man who has made an error of judgment at a venue,” Moore said. “He has owned that, we have owned that, and the sanction has been dealt with appropriately. “We have over 90 male and female athletes at this club, the large majority of whom take their job really seriously and make great decisions. But having said that, we don’t operate in a vacuum, we are human beings, people make errors of judgment, and it’s something that Jack has done in this instance.” Collingwood skipper Darcy Moore says he is looking forward to reading a review of the AFL’s illicit drugs ccode. Credit: Nine News Moore repeatedly said Ginnivan, a “popular, bubbly teammate”, had made an “error of judgment”, and it would take time for him to regain the trust of his teammates. “It’s not easy, but I am sure he will use this time to put his best foot forward and earn a bit of a trust from the team,” he said. The articulate Moore, who this month has replaced veteran Scott Pendlebury as captain, is also on the AFL Players Association’s board, and has detailed knowledge of the AFL’s three-strikes illicit drugs policy. This policy has been under review for the past year, but progress has been slow. Former Hawthorn president Jeff Kennett and Western Bulldogs coach Luke Beveridge have been among those calling for change, particularly when it comes to who is informed of a first strike. AFL medical directors and the player’s club doctor – but not club management – are told of a positive first test, unless there is footage available, as was the case for Ginnivan. Loading It is then referred by the AFL medical officer to the club doctor to determine the best course of action, including what treatment the player should be referred to. “It’s being reviewed. It’s been reviewed, the IDP [illicit drugs policy], over the past 12 months by the AFL, a third-party medical specialist and the AFL Players Association,” Moore said. “The IDP is a voluntary program that players have signed up to in order to safeguard their welfare and wellbeing. It’s, obviously, something that is much talked about, especially when incidents like this occur. I am really looking forward to seeing the outcome of that review and what the AFL and the independent experts have to say about how effective it is. “Obviously, the model is designed around welfare and wellbeing and harm minimisation of drugs amongst young people, in this case, AFL players. I am really looking forward to the results of that.” Where the number of positive tests was once publicly released and reported by the media, the players have successfully pushed for those figures to be suppressed, arguing the release of the figures only added to the strain players felt. The flipside is that officials argue this only adds to a shroud of secrecy. “It [the policy] plays an important role around the league in terms of flagging players who are at risk of making mistakes around drug use, provides valuable de-identified data around the prevalence of drug use to the league and to the medical experts to keep tabs on how big of an issue this is,” Moore said. “I think the challenging part of it is certainly when things become public because obviously around a welfare and harm minimisation model not everything is going to be public. When it does, it can certainly create a bit more grey area, I suppose.” Loading However, Moore said the current policy was a strong enough deterrent. Ginnivan has also received a suspended $5000 fine, counselling and will be target-tested. He will also take a hit in terms of lost match payments. Moore said the Magpies were concerned only for Ginnivan’s welfare. “I think the general public can make up their mind about someone being filmed in a cubicle but ... Jack has owned his behaviour. Our main concern is about the behaviour and mistake Jack has made, and he has owned that. He has fallen short of the standards, it is disappointing, I am sure he will learn from it,” Moore said. “Unfortunately, he sustained a bit of an injury [gashed knee] at Friday night’s [intra-club] match. He is a little bit sore, and obviously disappointed with himself. He certainly feels the weight of that. We have to make sure that we support him and safeguard his welfare.” The Magpies must now regroup and focus on their opening practice match, against Carlton at Ikon Park on Friday. Keep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter . Save Log in , register or subscribe to save articles for later. License this article AFL off-field behaviour Collingwood Magpies AFL 2023 Jon Pierik is a sports journalist at The Age. He covers AFL and has won awards for his cricket and basketball writing. Connect via Twitter or email . Most Viewed in Sport Loading","pubDate":"2023-02-19 22:00:23","image_url":null,"source_id":"brisbanetimes","category":["sports"],"country":["australia"],"language":"english"},{"title":"Saurashtra lift Ranji Trophy for 2nd time","link":"https://www.thehansindia.com/sports/saurashtra-lift-ranji-trophy-for-2nd-time-783882","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Unadkat-led side thrash WBengal by nine wickets in final","content":"Kolkata: Left-arm pacer Jaydev Unadkat returned a match haul of nine wickets, including 6/85 in the second innings, as Saurashtra thrashed Bengal by nine wickets in the summit clash to clinch their second Ranji Trophy title here on Sunday. Having given away a big first innings lead of 230 runs, Bengal, who were overnight 169/4 in their second essay, folded for 241, handing the visitors a mere 12 runs target to win the final. Saurashtra lost their opening batter Jay Gohil (0) off the bowling of Akash Deep but eventually went past the target, reaching 14 for 1 in 2.4 overs, to wrap up the match with one day and two full sessions to spare. Saurashtra's earlier triumph was in 2019-20 season when they defeated Bengal on the basis of first innings lead. In the last 10 seasons, they have made the final on five occasions, underlining their consistency. A Ranji Trophy title eluded Bengal yet again. They last won it in 1998-90 when they defeated a star-studded Delhi at the same Eden Gardens. Their first title had come in 1938-39 in the pre-independence era. Earlier in the morning session, Unadkat showed the way after a freak run-out of Bengal batter Shahbaz Ahmed (27). The veteran Saurashtra skipper added four wickets to his overnight tally of two. The old Bengal warhorse duo of skipper Manoj Tiwary (68) and Anustup Majumdar (61) slammed valiant half-centuries but the home side were let down by their top-order batters, including the promising Abhimanyu Easwaran who scored 0 and 16 in the two innings. In-form No. 3 batter Sudip Gharami, who is fresh from a 112 and 41 in the semifinal against Madhya Pradesh and has 800-plus runs this season, also came a cropper and scored 0 and 14 in the two innings. The decision to hand debut to Sumanta Gupta in a Ranji final also will rankle Bengal as he did not show any technique of a top-order batter and perished to an outgoing delivery. State sports minister-cum-cricketer Tiwary had delayed his retirement to win a Ranji title from his fourth final, and it remains to be seen whether he continue to play in the upcoming season. (PTI) Brief Scores: Bengal 174 and 241 in 70.4 overs (Manoj Tiwary 68, Anustup Majumdar 61; Jaydev Unadkat 6/85, Chetan Sakariya 3/76). Saurashtra 404 and 14/1 in 2.4 overs. Saurashtra won by nine wickets.","pubDate":"2023-02-19 20:55:19","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337136-jaydev-unadkat.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"India retain Border-Gavaskar Trophy","link":"https://www.thehansindia.com/sports/india-retain-border-gavaskar-trophy-783880","keywords":["Sports"],"creator":["The Hans India"],"video_url":null,"description":"Hosts win by six wickets as Jadeja, Ashwin demolish Australia","content":"India’s Ravindra Jadeja and Axar patel react during the third day of the 2nd Test against Australia, at the Arun Jaitley Stadium, in New Delhi on Sunday New Delhi: Riding on left-arm spinner Ravindra Jadeja's best bowling figures in an innings in Test cricket (7/42) along with Ravichandran Ashwin's spin masterclass, India defeated Australia by six wickets in the second Test within three days to take 2-0 lead in the four-match series and retain Border-Gavaskar Trophy at the Arun Jaitley Stadium, here on Sunday. Ashwin set up the collapse to pick 3/59, before Jadeja ran through the Australian batting line-up as Australia crashed to 113 all out, after starting the day from 61/1 and being 86/2 at one stage, in their second innings. The Australian batting implosion gave India a target of 115, which they completed in 28.4 overs. Rohit Sharma began the chase by driving wide of mid-on for a boundary off Matthew Kuhnemann in the opening over. But in the next over, he lost his opening partner KL Rahul in an unlucky fashion. Rahul flicked well to the right of short leg off Nathan Lyon, but the ball lobbed up in the air after hitting the top of forward short leg's pad and the keeper took an easy catch. Rohit showed exquisite timing in whipping an overpitched delivery off Kuhnemann between deep mid-wicket and long-on. Post lunch, India began with an attacking intent, as Cheteshwar Pujara danced down the pitch to whip Matthew Kuhnemann through mid-wicket for four. Rohit came out in the next over to loft over wide mid-wicket for six off Lyon, followed by paddling off him for four more. The Indian skipper then danced down the pitch against Kuhnemann, slamming a six over the bowler's head but he was run-out in a horrible mix-up and sacrificed himself to keep Pujara at the crease. Pujara and Virat Kohli were positive in their footwork, defence and got the boundaries too. While Pujara danced down the pitch to loft Lyon over mid-on, Kohli got close to the ball and used his supple wrists to chip a drive past the off-spinner. He followed it up with a gentle tickle through fine leg and placing a flick between two fielders in the square leg region. Kohli fell for 20 when he was beaten through the air and on the outside edge by Todd Murphy and was stumped from behind by Alex Carey. Pujara and Shreyas Iyer continued to get boundaries on a fast clip -- while the former was pristine in punching off Murphy, the latter was splendid in cutting off Lyon and dancing down the pitch against Murphy to get four and six respectively. In a bid to attack against Lyon, Iyer danced down the pitch again for an expansive slog, but holed out to deep mid-wicket. KS Bharat was gorgeous in driving twice through the extra cover against Lyon and Kuhnemann. He would go on to drive through cover again off Kuhnemann for boundary and brought the crowd on its feet with a slog-sweep over deep mid-wicket for six off part-timer Travis Head. Pujara, playing in his 100th Test, finished off the chase by dancing down the pitch and flicking over mid-wicket to give India another victory in the series. Australia will be mighty disappointed by some extremely questionable shot selection and squandering the advantage they had at stumps on day two. Resuming from 61/1, with a healthy run-rate of 5.08 at the end of day two, Australia imploded spectacularly to lose nine wickets for 53 runs in a frenetic morning session. Brief scores: Australia 263 and 113 in 31.3 overs (Travis Head 43, Marnus Labuschagne 35; Ravindra Jadeja 7/42, Ravichandran Ashwin 3/59) lost to India 262 in 83.3 overs and 118/4 in 28.4 overs (Rohit Sharma 31, Cheteshwar Pujara 31 not out; Nathan Lyon 2/49, Todd Murphy 1/22) by six wickets.","pubDate":"2023-02-19 20:51:32","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337134-ravichandran-ashwin.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Australia gift Cheteshwar Pujara signed jersey for completing 100 Tests","link":"https://www.thehansindia.com/sports/cricket/australia-gift-cheteshwar-pujara-signed-jersey-for-completing-100-tests-783828","keywords":["Sports,Cricket"],"creator":["Sakshi Gupta"],"video_url":null,"description":"The Delhi game was Pujara’s 100th appearance in TestsIndia defeated Australia by 6 wickets in the second TestPujara deservedly hit the winning runs","content":"Pat Cummins presented a signed Australian jersey to Indian batsman Cheteshwar Pujara on Sunday for completing 100 Tests. The Board of Control for Cricket in India (BCCI) shared a picture of Cummins handing the signed jersey to Pujara, who became only the 13th Indian cricketer to reach the 100-mark in Tests. \"What a special gesture that was,\" wrote BCCI in a tweet along with the said picture. Spirit of Cricket 👏🏻👏🏻 Pat Cummins 🤝 Cheteshwar Pujara What a special gesture that was! 🇮🇳🇦🇺 #TeamIndia | #INDvAUS pic.twitter.com/3MNcxfhoIQ Pujara started off his 100th Test on a low after he was dismissed for a seven-ball duck by Australian spinner Nathan Lyon in India's first innings. However, India's No. 3 remained unbeaten in India's chase as Pujara also scored the winning runs. Pujara smashed Australia's off-spinner Todd Murphy over mid-wicket for a boundary to seal a superb six-wicket victory for the hosts in the Delhi Test. With the victory, India went 2-0 up in the ongoing Border-Gavaskar Trophy 2023, with two more Tests remaining. Speaking in a post-match interview, Pujara admitted he was \"nervous\" as his entire family was in the stands at Arun Jaitley Stadium, Delhi. \"It's been a great Test match, unfortunately I didn't get any runs in the first innings, but I knew if I stay for the first 10 minutes I can score. A special feeling, was very nervous as my entire family was there. A special feeling to hit the winning boundary, looking forward to the remaining 2 Tests,\" said Pujara. Meanwhile, Pujara, who plays for Saurashtra in domestic cricket, also congratulated his side for winning the Ranji Trophy 2022-23 as they defeated Bengal in the final by nine wickets. \"Lovely, congrats to all the guys (on Saurashtra's Ranji triumph), was following the scores until lunch. Great achievement, we've been consistent over the last few years and it's our second title in the last 4 years. So, great work by the guys. I thought we'll chase something around 200-250, so we were prepared to go and do that,\" added Pujara. Speaking about the Delhi track, Pujara said that it was not a tough surface to bat on. \"We were a bit disappointed at yesterday's bowling, we conceded a bit too many runs, but they were excellent today (the spinners). It's not an ideal shot to play because of the low bounce (speaking about the sweep shot), but I have practiced playing it a lot. I try to use my feet, it's always better to play in that manner on such turning wickets. \"Not really (asked if it was one of the tougher wickets to bat on), it's the initial phase, you need to get the pace of the pitch, some balls spun, some went straight on - once you're in, after 30-35 balls, once the ball goes soft, you'll get to a situation where you can play your shots with confidence,\" said Pujara. One for the books! Thank you so much for the warm wishes and support. Indeed, a sweet victory ☺️ pic.twitter.com/ZoCnpIILHE Australia captain Cummins, meanwhile, said that his side was ahead at the end of Day 2 but they let the game slip away. \"I thought 260 was a decent score in the first innings. The guys bounced back well. But India batted well, just 1-2 partnerships and you can get to that 260 mark quite easily. In the innings break, it was all even. Disappointed, we were ahead of the game but we slipped. We need a review on what could have been done different,\" said Cummins. On Australian batters getting out to sweeps, Cummins said,\" Everyone controls their own game, some balls just have your name. But we need a review on the shot choice, did we do things right? Both games were disappointing, this one in particular. We were ahead in the game and that doesn't happen often in India. This loss hurts.\" The second Test between India and Australia will begin on March 1 at Indore's Holkar Stadium.","pubDate":"2023-02-19 19:32:18","image_url":"https://assets.thehansindia.com/h-upload/2023/02/19/500x300_1337084-test.jpg","source_id":"thehansindia","category":["sports"],"country":["india"],"language":"english"},{"title":"Ben Stokes blasts past Brendon McCullum’s record for Test sixes","link":"https://www.thesouthafrican.com/sport/cricket/ben-stokes-blasts-past-brendon-mccullum-record-for-test-sixes-breaking-19-february-2023/","keywords":["Cricket","Ben Stokes","Brendon McCullum","Featured","latest cricket news"],"creator":["Garrin Lambley"],"video_url":null,"description":"England captain Ben Stokes has overtaken his coach Brendon McCullum as the outright record holder for the most sixes struck in Test cricket.","content":"Big-hitting England captain Ben Stokes on Saturday overtook his coach Brendon McCullum as the outright record holder for the most sixes struck in Test cricket. ALSO READ: In and out: Proteas coach backs up his picks Stokes hoisted the 108th six of his career when he hooked seamer Scott Kuggeleijn over fine leg midway through the third day of the opening Test against New Zealand at Mount Maunganui. The 31-year-old all-rounder immediately signalled to the dressing room, where McCullum was applauding. Stokes made it 109 sixes off the following delivery when he was given a reprieve by boundary fielder Neil Wagner, who caught the shot but over-balanced and put his foot on the rope. ALSO READ: SA confirm new Test captain, latest squad Stokes was out a short time later for 31. Ben Stokes’ record unlikely to be broken soon He took 90 Tests and 164 innings to reach his tally of sixes while McCullum’s 107 were achieved in 176 innings across 101 Tests. Stokes looks set to hold the record for some time. The nearest active player to his mark is veteran New Zealand captain Tim Southee , on 76 sixes. ALSO READ: Theunis de Bruyn’s retirement draws mixed reaction Meanwhile, from a South African point of view, Jacques Kallis holds the record for the most sixes hit. The star all-rounder struck 97 sixes in his 166 Tests and sits fifth in the all-time list.","pubDate":"2023-02-19 19:07:55","image_url":"https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg","source_id":"thesouthafrican","category":["sports"],"country":["south africa"],"language":"english"},{"title":"IND vs AUS: दिल्ली टेस्ट में हार पर भड़का ऑस्ट्रेलियाई मीडिया, पूर्व खिलाड़ियों ने भी सुनाई खरी-खोटी","link":"https://www.abplive.com/sports/cricket/reaction-of-australian-media-and-former-players-after-the-defeat-in-the-second-test-match-against-india-2338816","keywords":["Cricket"],"creator":["ABP Live"],"video_url":null,"description":"IND vs AUS 2nd Test: भारत के खिलाफ दूसरे टेस्ट मैच में मेजबान ऑस्ट्रेलिया को 6 विकेट से हार का सामना करना पड़ा. इस तरह टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. वहीं, इस हार के बाद ऑस्ट्रेलियाई मीडिया ने अपनी टीम पर जमकर भड़ास निकाली. ऑस्ट्रेलियाई मीडिया ने दिल्ली टेस्ट में टीम की हार को शर्मनाक करार दिया जबकि इस मैच के दौरान कमेन्ट्री कर रहे मार्क वॉ का मानना है कि यह हार ऑस्ट्रेलियाई टीम को काफी नुकसान पहुंचाने वाली है. पूर्व ऑस्ट्रेलियाई खिलाड़ी ने कहा कि मेहमान टीम के पास दिल्ली टेस्ट मैच जीतने का सुनहरा मौका था, लेकिन टीम चूक गई. ऑस्ट्रेलियाई कप्तान पैट कमिंस ने क्या कहा? ऑस्ट्रेलियाई मीडिया के अलावा कंगारू टीम हार के बाद पूर्व खिलाड़ियों के निशाने पर आ गई है. यही नहीं, ऑस्ट्रेलियाई कप्तान पैट कमिंस भी टीम की हार से बेहद निराश दिखे. उन्होंने कहा कि मैच हमारी मुठ्ठी में था, लेकिन हमने गंवा दिया. एलन बॉर्डर और मार्क वॉ के बाद मैथ्यू हेडन ने भी अपनी भड़ास निकाली है. पूर्व ऑस्ट्रेलियाई दिग्गज खिलाड़ी मैथ्यू हेडन ने कहा कि ऐसी पिचों पर स्पिन गेंदबाजी के खिलाफ स्वीप शॉट खेलना खराब विकल्प नहीं है, लेकिन आपको पता होना चाहिए कि आखिर खेलना कैसे है... जिस तरह ऑस्ट्रेलियाई बल्लेबाजों ने स्पिन गेंदबाजों के खिलाफ स्वीप की कोशिश में अपना विकेट गंवाया, वह काफी निराशाजनक है. I am choosing to get outraged about the doctored Indian decks again rather than accept the reality they bask in these conditions and we don't have many answers #moretroublethanearlysettlers — Jon Ralph (@RalphyHeraldSun) February 19, 2023 There was always a good chance that Australia would fall over this morning, but this is catastrophic. #IndvAus — Geoff Lemon Sport (@GeoffLemonSport) February 19, 2023 This is beyond a joke now.Planning horribly wrong.Series swept away in 75 minutes of dreadful test cricket. #INDvAUS — Andy Maher (@AndyMaherDFA) February 19, 2023 Poor shots. Self destruction. Absolutely hopeless. #INDvAUS — Oliver Peterson (@oliverpeterson) February 19, 2023 टीम इंडिया सीरीज में 2-0 से आगे गौरतलब है कि इस जीत के बाद टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. इस तरह भारतीय टीम को जीत के लिए 115 रनों का लक्ष्य मिला था. टीम इंडिया ने 4 विकेट पर 118 रन बनाकर मैच अपने नाम कर लिया. दोनों टीमों के बीच सीरीज का तीसरा मैच 1 मार्च से इंदौर में खेला जाएगा. वहीं, इस सीरीज के आखिरी दोनों मैचे के लिए भारतीय टीम का एलान कर दिया गया है. इंदौर के बाद सीरीज का आखिरी मैच अहमदाबाद के नरेन्द्र मोदी स्टेडियम में खेला जाएगा. ये भी पढ़ें- IND vs AUS ODI Team: ऑस्ट्रेलिया के खिलाफ पहला वनडे नहीं खेलेंगे रोहित शर्मा, जानिए क्या है वजह IND vs AUS: दिल्ली में हार के बाद ऑस्ट्रेलियाई बल्लेबाजों पर भड़के मैथ्यू हेडन, कहा- स्वीप खराब विकल्प नहीं, लेकिन...","content":"IND vs AUS 2nd Test: भारत के खिलाफ दूसरे टेस्ट मैच में मेजबान ऑस्ट्रेलिया को 6 विकेट से हार का सामना करना पड़ा. इस तरह टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. वहीं, इस हार के बाद ऑस्ट्रेलियाई मीडिया ने अपनी टीम पर जमकर भड़ास निकाली. ऑस्ट्रेलियाई मीडिया ने दिल्ली टेस्ट में टीम की हार को शर्मनाक करार दिया जबकि इस मैच के दौरान कमेन्ट्री कर रहे मार्क वॉ का मानना है कि यह हार ऑस्ट्रेलियाई टीम को काफी नुकसान पहुंचाने वाली है. पूर्व ऑस्ट्रेलियाई खिलाड़ी ने कहा कि मेहमान टीम के पास दिल्ली टेस्ट मैच जीतने का सुनहरा मौका था, लेकिन टीम चूक गई. ऑस्ट्रेलियाई कप्तान पैट कमिंस ने क्या कहा? ऑस्ट्रेलियाई मीडिया के अलावा कंगारू टीम हार के बाद पूर्व खिलाड़ियों के निशाने पर आ गई है. यही नहीं, ऑस्ट्रेलियाई कप्तान पैट कमिंस भी टीम की हार से बेहद निराश दिखे. उन्होंने कहा कि मैच हमारी मुठ्ठी में था, लेकिन हमने गंवा दिया. एलन बॉर्डर और मार्क वॉ के बाद मैथ्यू हेडन ने भी अपनी भड़ास निकाली है. पूर्व ऑस्ट्रेलियाई दिग्गज खिलाड़ी मैथ्यू हेडन ने कहा कि ऐसी पिचों पर स्पिन गेंदबाजी के खिलाफ स्वीप शॉट खेलना खराब विकल्प नहीं है, लेकिन आपको पता होना चाहिए कि आखिर खेलना कैसे है... जिस तरह ऑस्ट्रेलियाई बल्लेबाजों ने स्पिन गेंदबाजों के खिलाफ स्वीप की कोशिश में अपना विकेट गंवाया, वह काफी निराशाजनक है. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); I am choosing to get outraged about the doctored Indian decks again rather than accept the reality they bask in these conditions and we don't have many answers #moretroublethanearlysettlers — Jon Ralph (@RalphyHeraldSun) February 19, 2023 There was always a good chance that Australia would fall over this morning, but this is catastrophic. #IndvAus — Geoff Lemon Sport (@GeoffLemonSport) February 19, 2023 This is beyond a joke now. Planning horribly wrong. Series swept away in 75 minutes of dreadful test cricket. #INDvAUS — Andy Maher (@AndyMaherDFA) February 19, 2023 Poor shots. Self destruction. Absolutely hopeless. #INDvAUS — Oliver Peterson (@oliverpeterson) February 19, 2023 टीम इंडिया सीरीज में 2-0 से आगे गौरतलब है कि इस जीत के बाद टीम इंडिया 4 टेस्ट मैचों की सीरीज में 2-0 से आगे हो गई है. इस तरह भारतीय टीम को जीत के लिए 115 रनों का लक्ष्य मिला था. टीम इंडिया ने 4 विकेट पर 118 रन बनाकर मैच अपने नाम कर लिया. दोनों टीमों के बीच सीरीज का तीसरा मैच 1 मार्च से इंदौर में खेला जाएगा. वहीं, इस सीरीज के आखिरी दोनों मैचे के लिए भारतीय टीम का एलान कर दिया गया है. इंदौर के बाद सीरीज का आखिरी मैच अहमदाबाद के नरेन्द्र मोदी स्टेडियम में खेला जाएगा. ये भी पढ़ें- IND vs AUS ODI Team: ऑस्ट्रेलिया के खिलाफ पहला वनडे नहीं खेलेंगे रोहित शर्मा, जानिए क्या है वजह IND vs AUS: दिल्ली में हार के बाद ऑस्ट्रेलियाई बल्लेबाजों पर भड़के मैथ्यू हेडन, कहा- स्वीप खराब विकल्प नहीं, लेकिन...","pubDate":"2023-02-19 18:23:24","image_url":"https://feeds.abplive.com/onecms/images/uploaded-images/2023/02/19/c1e8e9f7de9f9c43175687fe7e195b3c1676829940234428_original.jpg","source_id":"abplive","category":["sports"],"country":["india"],"language":"hindi"}]}