{"newsArray":[{"title":"MP vs MUM Dream11 Team Prediction, Fantasy Cricket Hints: Captain, Probable Playing 11s, Team News; Injury Updates For Today’s MP vs MUM Ranji Trophy Final at M. Chinnaswamy Stadium, Bengaluru, 9.30 PM IST June 22-26","link":"https://zeenews.india.com/cricket/mp-vs-mum-dream11-team-prediction-fantasy-cricket-hints-captain-probable-playing-11s-team-news-injury-updates-for-today-s-mp-vs-mum-ranji-trophy-final-at-m-chinnaswamy-stadium-bengaluru-9-30-pm-ist-june-22-26-2476388.html","keywords":null,"creator":null,"video_url":null,"description":"Madhya Pradesh vs Mumbai Dream11 Team Prediction Madhya Pradesh vs Mumbai Ranji Trophy Final - Check My Dream11 Team, Best players list of MP vs MUM, Madhya Pradesh Dream11 Team Player List, Mumbai Dream11 Team Player List, Dream11 Guru Tips, Fantasy Cricket Tips, Fantasy Cricket Tips, Fantasy Playing Tips.","content":null,"pubDate":"2022-06-22 01:53:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Sri Lanka hold their nerve at the death against Australia","link":"https://www.cairnspost.com.au/sport/cricket/sri-lanka-hold-their-nerve-at-the-death-against-australia/video/35ebc11baee7f797bee4d2bed4215bf0","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Sri Lanka have held their nerve in the death overs to claim a four run win in the 4th ODI against Australia.","content":null,"pubDate":"2022-06-21 22:36:21","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"David Warner's horror moment in 51-year first for ODI cricket","link":"https://au.sports.yahoo.com/cricket-2022-david-warner-horror-moment-51-year-odi-first-213538901.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2022-06-21 21:35:38","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2022-06/aca6b910-f1a8-11ec-b35f-76224c553ac0","source_id":"yahoo","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka v Australia 4th ODI Highlights","link":"https://www.cairnspost.com.au/sport/cricket/sri-lanka-v-australia-4th-odi-highlights/video/e01b79edbf54d6f41f6f3be564d953d8","keywords":["Cricket news and galleries"],"creator":null,"video_url":null,"description":"Cricket: Sri Lanka has claimed the ODI series with Australia after taking a 3-1 lead in the series by winning the fourth match on the last ball.","content":null,"pubDate":"2022-06-21 21:09:20","image_url":null,"source_id":"cairnspost","country":["australia"],"category":["sports"],"language":"english"},{"title":"Sri Lanka beats Australia by four runs in Colombo to clinch ODI series 3-1 with a game to play - ABC News","link":"https://news.google.com/__i/rss/rd/articles/CBMiT2h0dHBzOi8vd3d3LmFiYy5uZXQuYXUvbmV3cy8yMDIyLTA2LTIyL2F1c3RyYWxpYS1zcmktbGFua2EtZm91cnRoLW9kaS8xMDExNzIzODTSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Sri Lanka beats Australia by four runs in Colombo to clinch ODI series 3-1 with a game to play  ABC NewsAgony as Aussies suffer unwanted 12-year first  news.com.auFamiliar Finch feeling returns; rookie shines in near-miracle moment: Aussie player ratings  Fox SportsAustralia spun out of Sri Lanka ODI series  Sydney Morning HeraldSri Lanka spinners seal ODI series in Colombo classic  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-06-21 20:44:38","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Aussie selection gamble backfires in major ODI shock as Warner suffers 99 heartbreak - Fox Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMiwwFodHRwczovL3d3dy5mb3hzcG9ydHMuY29tLmF1L2NyaWNrZXQvYXVzdHJhbGlhL2F1c3RyYWxpYS12cy1zcmktbGFua2EtNHRoLW9kaS1jcmlja2V0LW5ld3MtMjAyMi1saXZlLXN0cmVhbS1ob3ctdG8td2F0Y2gtc3RhcnQtdGltZS10ZWFtcy1zY29yZS11cGRhdGVzL25ld3Mtc3RvcnkvZTRlN2RlMTdhMWYxYTFmM2NhNTZkYWUxNmRiN2RlY2PSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Aussie selection gamble backfires in major ODI shock as Warner suffers 99 heartbreak  Fox SportsKuhnemann's late heroics not enough after Warner's 99 | cricket.com.au  cricket.com.auAustralia spun out of Sri Lanka ODI series  Sydney Morning HeraldSri Lanka v Australia: G5 | Match Centre  Kayo SportsSri Lanka pick four specialist spinners for fourth ODI  cricket.com.auView Full coverage on Google News","content":null,"pubDate":"2022-06-21 19:18:45","image_url":null,"source_id":"google","country":["australia"],"category":["sports"],"language":"english"},{"title":"Unwell Ben Stokes Misses England Training Ahead Of Third Test vs NZ","link":"https://sports.ndtv.com/cricket/unwell-ben-stokes-misses-england-training-ahead-of-third-test-vs-new-zealand-3088680","keywords":null,"creator":null,"video_url":null,"description":"An England and Wales Cricket Board spokesperson indicated that Stokes had tested negative for Covid-19 on Tuesday morning. Stokes is being kept away from the group as a precautionary measure.","content":"England captain Ben Stokes missed training after feeling unwell on Tuesday as his side started their preparations for the Headingley Test. Stokes was absent while the rest of the squad trained ahead of Thursday's first day of the final Test in the three-match series. An England and Wales Cricket Board spokesperson indicated that Stokes had tested negative for Covid-19 on Tuesday morning. Stokes is being kept away from the group as a precautionary measure. The 31-year-old, in his first Test series as skipper, will be assessed again ahead of Wednesday's net session. Later on Tuesday, England batting coach Marcus Trescothick tested positive for Covid. The ECB said Trescothick is \"currently in isolation at home and is being monitored daily. Details of his return to the England set-up will be announced in due course.\" Stokes hit 75 from 70 balls in the second innings of England's second Test victory over New Zealand at Trent Bridge. That was England's second successive win against the Test world champions, clinching their first Test series triumph since January 2021. New Zealand have had several positive Covid cases in their squad over the last couple of weeks. Black Caps skipper Kane Williamson was forced to miss the second Test after testing positive on the eve of the match in Nottingham. As well as Williamson, the tourists have seen Henry Nicholls , Devon Conway , Michael Bracewell and two members of their backroom team return positive results since arriving in England. All four players are fit and available to play in Leeds this week. While England hope to avoid a Covid outbreak, twin brothers Jamie and Craig Overton are dreaming of a potentially taking the field together for the hosts at Headingley. The 6ft 5in seam-bowling siblings are on stand-by should England decide to rotate their pace attack with the series already won. For the uncapped Jamie, who is the younger sibling by three minutes, it is uncharted territory, while Craig is hoping to add to his eight caps. The duo have played together numerous times over the years, with North Devon, Somerset and England Under-19s, but came head to head in first-class cricket for the first time just a matter of days ago. Jamie, who left Taunton for Surrey in 2020, struck his brother on the helmet with a rapid bouncer during a County Championship match last week leading to a delayed concussion diagnosis. \"I think any sibling rivalry is always going to have a bit of extra spice and me and Craig are probably even spicier than most people,\" Jamie said. \"The family obviously didn't like seeing Craig on the floor but I think they would have told us off if we weren't giving our all.\" Despite that bruising encounter, Craig insisted there would be no hard feelings if only one of them was selected this week. Promoted \"It's been like that since we were 16 years old. My first game of first-class cricket we were competing for the same spot and I ended up playing,\" he said. \"We'd both said to each other 'whatever happens, we'll be supportive' and we've always been like that. We want what's best for the team and if that means one of us misses out, that's the way it is.\"","pubDate":"2022-06-21 18:17:28","image_url":"https://c.ndtvimg.com/2022-06/htdsbfgg_ben-stokes-afp_625x300_10_June_22.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180","source_id":"ndtv","country":["india"],"category":["sports"],"language":"english"},{"title":"Cricket-Sri Lanka edge Australia in last-ball thriller to clinch series","link":"https://www.thestar.com.my/sport/cricket/2022/06/22/cricket-sri-lanka-edge-australia-in-last-ball-thriller-to-clinch-series","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Sri Lanka beat Australia by four runs in a tense one-day international that went down to the final ball in Colombo on Tuesday to take an unassailable 3-1 lead in the five-match series. Read full story","content":null,"pubDate":"2022-06-21 18:01:00","image_url":null,"source_id":"thestar_my","country":["malaysia"],"category":["sports"],"language":"english"},{"title":"Ranji success, not Test comeback, on Prithvi Shaw's mind - ESPNcricinfo","link":"https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvcmFuamktdHJvcGh5LWZpbmFsLW1wLXZzLW11bS1yYW5qaS1zdWNjZXNzLW5vdC10ZXN0LWNvbWViYWNrLW9uLXByaXRodmktc2hhdy1taW5kLTEzMjA4NDjSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Ranji success, not Test comeback, on Prithvi Shaw's mind  ESPNcricinfoWith 'Chandu Sir' in opposition, Shaw sees Ranji final as 'challenging' but also 'fun' | Cricbuzz.com - Cricbuzz  Cricbuzz\"Comeback To The Indian Team...\": Prithvi Shaw Opens Up On Making A Return To National Side  NDTV SportsIn cricket and life, graph always moves up and down: Prithvi Shaw  Times of IndiaI Want To Ensure That My Team Is Doing Fine – Prithvi Shaw Not Concerned About His Form Ahead Of Ranji Trophy 2022 Final  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2022-06-21 17:52:52","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"LIVE SL vs AUS ODI Score, 4th Match Update : Sri Lanka Avoid Last Over Blip To Win By 4 Runs - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMizgFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL3NsLXZzLWF1cy1oaWdobGlnaHRzLW9kaS1zY29yZWNhcmQtNHRoLW1hdGNoLXVwZGF0ZS1zcmktbGFua2EtdnMtYXVzdHJhbGlhLXNvbnlsaXYtY29sb21iby10YXJnZXQtMjU5LWNoYXJpdGgtYXNhbGFua2EtZGF2aWQtd2FybmVyLXNoYW5ha2Eta2FydW5hcmF0bmUtc2wtd29uLWJ5LTQtcnVucy01NDY2NjYyL9IBAA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE SL vs AUS ODI Score, 4th Match Update : Sri Lanka Avoid Last Over Blip To Win By 4 Runs  India.comRecent Match Report - Sri Lanka vs Australia 4th ODI 2022  ESPNcricinfoSrilanka vs Australia Predictions, Betting Tips & Odds │21 JUNE, 2022  Telecom AsiaLIVE SL vs AUS ODI Score, 4th Match Update : Green Departs, Sri Lanka On Top  India.comMendis likely to play as Sri Lanka look to break 30-year drought  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2022-06-21 17:45:53","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy 2022 Final: पृथ्वी शॉ ने बताया कब उनके बल्ले से निकलेंगे बड़े शॉट, कप्तानी को लेकर कही यह बात","link":"https://www.abplive.com/sports/cricket/prithvi-shaw-says-about-his-career-before-ranji-trophy-2022-final-madhya-pradesh-vs-mumbai-2151606","keywords":null,"creator":["ABP Live"],"video_url":null,"description":"<p style=\"text-align: justify;\"><strong>Prithvi Shaw Ranji Trophy 2022 Final Madhya Pradesh vs Mumbai:</strong> रणजी ट्रॉफी 2021-22 का फाइनल मैच मध्य प्रदेश और मुंबई के बीच 22 जून से खेला जाएगा. इस मुकाबले से पहले मुंबई के कप्तान पृथ्वी शॉ ने अपने क्रिकेट करियर को लेकर प्रतिक्रिया दी. उन्होंने कहा कि जीवन की तरह क्रिकेट में भी उतार-चढ़ाव देखने को मिलते हैं. पृथ्वी का मानना है कि यह समय पर निर्भर करता कि उनका प्रदर्शन कैसा होगा. उन्होंने टीम इंडिया में सलेक्शन को लेकर भी बात की.</p> <p style=\"text-align: justify;\">मुंबई के कप्तान पृथ्वी ने कहा, &lsquo;&lsquo;मैंने कुछ (तीन) अर्धशतक जड़े हैं लेकिन निश्चित तौर पर यह मेरे लिए पर्याप्त नहीं हैं और यहां तक कि अर्धशतक जड़ने के बाद किसी ने मुझे बधाई भी नहीं दी और आपको भी बुरा लगता है (मजाकिया लहजे में कहा).&rsquo;&rsquo; उन्होंने कहा, &lsquo;&lsquo;कभी कभी ऐसा होता है लेकिन मुझे खुशी है कि मेरी टीम अच्छा कर रही है. एक कप्तान के रूप में मुझे यहां मेरे साथ आए सभी 21 खिलाड़ियों के बारे में सोचना होता है और सिर्फ अपने बारे में नहीं. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">पृथ्वी ने कहा, &lsquo;&lsquo;क्रिकेट और जीवन में हमेशा उतार-चढ़ाव देखने को मिलते हैं और कभी ऐसा नहीं होता कि आप आगे ही बढ़ते रहें. इसलिए यह सिर्फ समय कि बात है कि मैं गेंदों को अच्छी तरह मारने लगूंगा और एक बार फिर बड़ी पारियां खेलूंगा. लेकिन अभी मैं सुनिश्चित करना चाहता हूं कि मेरी टीम अच्छा प्रदर्शन करे और मैं टीम के खेल का लुत्फ उठा रहा हूं.&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">यह पूछने पर कि क्या राष्ट्रीय टीम में वापसी को वह तवज्जो नहीं देते? पृथ्वी ने कहा, &lsquo;&lsquo;भारतीय टीम में वापसी के बारे में अभी मैं बिलकुल भी नहीं सोच रहा. &nbsp;कप जीतना मेरा मुख्य उद्देश्य है और इसे जीतने के अलावा किसी और चीज के बारे में नहीं सोच रहा. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">पृथ्वी सिर्फ 22 साल के हैं और 33 प्रथम श्रेणी मैच खेल चुके हैं लेकिन जब उनसे पूछा गया कि वह टीम के &lsquo;युवाओं&rsquo; को क्या संदेश देना चाहते हैं तो उन्होंने कहा, &lsquo;&lsquo;मैं सबसे पहले तो यह कहना चाहूंगा कि मुझे उन पर गर्व है कि वे यहां तक पहुंचे. &nbsp;मैं उनसे कहना चाहता हूं कि मैदान पर उतरकर खेल का लुत्फ उठाओ. &nbsp;मैं टीम के युवाओं को कहना चाहता हूं कि उन्हें वही करना है जो वे अंडर-25 या अंडर-19 में करते आए हैं, बस यहां का स्तर अधिक कड़ा है. &nbsp;&rsquo;&rsquo;</p> <p style=\"text-align: justify;\">उन्होंने कहा, &lsquo;&lsquo;मेरे लिए नतीजे मायने नहीं रखते बल्कि सभी का प्रयास मायने रखता है. &nbsp;मैंने उनसे सिर्फ इतना कहा है कि वही करो जो इतने वर्षों से कर रहे हो. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">पृथ्वी और मुंबई के मौजूदा अभियान में शानदार प्रदर्शन करने वाले अरमान जाफर और इस सत्र के शीर्ष स्कोरर सरफराज खान में एक चीज समान है और वह यह है कि ये तीनों एक ही स्कूल &lsquo;रिज्वी स्प्रिंगफील्ड्स&rsquo; के छात्र रहे हैं जिसे उसकी मजबूत क्रिकेट टीम के लिए जाना जाता है. &nbsp;रिज्वी स्प्रिंगफील्ड की टीम का मुंबई के प्रतिष्ठित स्कूल टूर्नामेंट हैरिस एवं जाइल्स शील्ड में दबदबा रहा है.&nbsp;पृथ्वी ने कहा, &lsquo;&lsquo;मैं, सरफराज और अरमान नौ से 10 साल की उम्र में एक ही स्कूल में गए. &nbsp;हम एक साथ खेले और मुंबई क्रिकेट के लिए अब तक हम तीनों ने अच्छा काम किया है. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">पृथ्वी दूसरी बार रणजी ट्रॉफी फाइनल (पहला 2017 में गुजरात के खिलाफ) में खेल रहे हैं जबकि अरमान और सरफराज पहली बार खिताबी मुकाबले का हिस्सा होंगे.&nbsp;पृथ्वी जब पहली बार मुंबई की टीम में आए थे तो चंद्रकांत पंडित टीम के कोच थे और अब जब वह फाइनल में 41 बार के चैंपियन मुंबई की अगुआई करेंगे तो यह दिग्गज कोच विरोधी टीम के साथ होगा. &nbsp;मुंबई के कप्तान ने कहा, &lsquo;&lsquo;मुझे लगता है कि मैं पांच साल बाद चंदू सर (कोच पंडित) से आंख मिला पाऊंगा. &nbsp;2016 या 2017 में ऐसा नहीं था. &nbsp;सभी को मालूम है कि चंदू सर कड़े व्यक्ति हैं और लंबे समय बाद उनसे दोबारा मिलना अच्छा होगा. &rsquo;&rsquo;</p> <p style=\"text-align: justify;\">मुंबई के कोच की जिम्मेदारी घरेलू क्रिकेट के दिग्गज अमोल मजूमदार निभा रहे हैं और पृथ्वी ने उनके मार्गदर्शन को विशेष करार दिया. उन्होंने कहा, &lsquo;&lsquo;सभी को पता है अमोल सर ने काफी घरेलू क्रिकेट खेला है और काफी रन बनाए हैं. &nbsp;उनके पास काफी अनुभव है और हम काफी भाग्यशाली हैं कि वह हमारे साथ हैं.''</p> <p style=\"text-align: justify;\"><strong>यह भी पढ़ें : <a href=\"https://www.abplive.com/sports/cricket/pakistan-former-captain-sarfaraz-ahmed-clean-bold-by-child-viral-video-2151593\">VIDEO: पाकिस्तान के पूर्व कप्तान सरफराज को छोटे बच्चे ने कर दिया क्लीन बोल्ड, वायरल हो रहा वीडियो</a></strong></p> <p style=\"text-align: justify;\"><a href=\"https://www.abplive.com/sports/cricket/sachin-tendulkar-and-sourav-ganguly-praised-the-trailer-of-the-film-shabaash-mithu-based-on-the-life-of-former-indian-captain-mithali-raj-2151531\"><strong>Shabaash Mithu Trailer: शाबाश मिठू के ट्रेलर की सचिन तेंदुलकर और सौरव गांगुली ने की जमकर तारीफ, कही ये बात</strong></a></p>","content":null,"pubDate":"2022-06-21 17:45:33","image_url":null,"source_id":"abplive","country":["india"],"category":["sports"],"language":"hindi"},{"title":"India vs Leicestershire tickets online booking 2022: How to book tickets for India’s warm-up match vs Leicestershire?","link":"https://thesportsrush.com/cricket-news-india-vs-leicestershire-tickets-online-booking-2022-how-to-book-tickets-for-indias-warm-up-match-vs-leicestershire/","keywords":["Cricket","India","India tour of England 2022","Leicestershire"],"creator":["Gurpreet Singh"],"video_url":null,"description":"India vs Leicestershire tickets online booking 2022: The four-day warm-up match would precede the ‘5th Test match’ between India and England. India’s tour of England would commence with a 4-day Warm-up match against the Leicestershire County Cricket Club at the Uptonsteel County Ground from June 24 onwards. Team India arrived in England a day ago,… The post India vs Leicestershire tickets online booking 2022: How to book tickets for India’s warm-up match vs Leicestershire? appeared first on The SportsRush.","content":"India vs Leicestershire tickets online booking 2022: The four-day warm-up match would precede the ‘5th Test match’ between India and England. India’s tour of England would commence with a 4-day Warm-up match against the Leicestershire County Cricket Club at the Uptonsteel County Ground from June 24 onwards. Team India arrived in England a day ago, and would begin the multi-format tour with the rescheduled ‘fifth Test match’ against England, after the same had to be postponed last year due to COVID-19 scare in the Indian camp, with the series score line reading 2-1. The second Indian batch, comprising Rishabh Pant, Shreyas Iyer, and team India head coach Rahul Dravid – all of who were part of the recently concluded five-match T20I series against South Africa, have arrived at the UK shores as well. Hello from Leicester and our training base for a week will be @leicsccc 🙌 #TeamIndia pic.twitter.com/MAX0fkQcuc — BCCI (@BCCI) June 20, 2022 Rohit Sharma would lead the team for the first time in an overseas tour, and is reportedly set to open the Indian innings alongside Shubman Gill, after KL Rahul failed to recover from the groin injury he had picked up right before the home T20I series against South Africa. As for the Leicestershire, who have been off-colour so far in the County Division Two Championship 2022, they are likely to be led by their all-rounder Callum Parkinson. Tickets for all the four days at the Uptonsteel County Ground are available for online booking the Leicestershire County Cricket Club’s official website. They are available for four different age group categories – Junior under 16 (at £15.00), Young adult 16-22 (£20.00), Adult (£25.00), and Senior 60+ (£20.00). One will have to add the number of ticket one wishes to buy under the age group bracket after clicking here . Follow all the instructed steps from here on including the registration process to complete the booking process.","pubDate":"2022-06-21 17:23:15","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"LIVE SL vs AUS ODI Score, 4th Match Update : Green Departs, Sri Lanka On Top - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2xpdmUtc2wtdnMtYXVzLW9kaS1zY29yZS00dGgtbWF0Y2gtdXBkYXRlLXNyaS1sYW5rYS12cy1hdXN0cmFsaWEtbGl2ZS1zdHJlYW1pbmctc29ueWxpdi1iYWxsLWJ5LWJhbGwtY29tbWVudGFyeS1jb2xvbWJvLXRhcmdldC0yNTktd2FybmVyLWdyZWVuLWN1bW1pbnMtYXNhbGFua2EtZGhhbmFuamF5YS10aGVla3NoYW5hLWNoYW1pa2EtaGFzYXJhbmdhLTU0NjY2NjIv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE SL vs AUS ODI Score, 4th Match Update : Green Departs, Sri Lanka On Top  India.comRecent Match Report - Sri Lanka vs Australia 4th ODI 2022  ESPNcricinfoMendis likely to play as Sri Lanka look to break 30-year drought  International Cricket CouncilSrilanka vs Australia Predictions, Betting Tips & Odds │21 JUNE, 2022  Telecom AsiaView Full coverage on Google News","content":null,"pubDate":"2022-06-21 17:16:29","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes a fitness doubt for England’s third Test against New Zealand","link":"https://www.theguardian.com/sport/2022/jun/21/ben-stokes-a-fitness-doubt-for-englands-third-test-against-new-zealand","keywords":["England v New Zealand 2022","Ben Stokes","England cricket team","New Zealand cricket team","Cricket","Sport"],"creator":["Ali Martin at Headingley"],"video_url":null,"description":"Trent Bridge centurion Jonny Bairstow could step upKiwis looking to restore ‘pride’ having lost seriesBen Stokes must prove his fitness before the third Test against New Zealand, which starts on Thursday, after the England captain missed the first day of training at Headingley through illness.Stokes, who is yet to name an official Test vice-captain since taking over from Joe Root this summer, was absent from nets on Tuesday after returning from a weekend visit to his old cricket club, Cockermouth, and reporting a chesty cough. Continue reading...","content":"Ben Stokes must prove his fitness before the third Test against New Zealand, which starts on Thursday, after the England captain missed the first day of training at Headingley through illness. Stokes, who is yet to name an official Test vice-captain since taking over from Joe Root this summer, was absent from nets on Tuesday after returning from a weekend visit to his old cricket club, Cockermouth, and reporting a chesty cough. A team spokesperson confirmed a rapid Covid-19 test on Tuesday morning returned a negative result and, as such, England are hopeful Stokes will be able to shake off the bug and lead out the side as they look to start his reign with a 3-0 series victory. Bairstow smashes century to set up England’s series win over New Zealand Read more In the event Stokes does miss out, the question of his deputy will be answered. Root is clearly the most qualified, having captained England a record 64 times before stepping down in April, while Stuart Broad and Jonny Bairstow are alternative candidates. Jimmy Anderson, another senior player, may well be rested. No Stokes would also present a chance for Yorkshire’s in-form Harry Brook to make a Test debut at his home ground, even if this would mean the loss of an all-rounder in the team and raise the prospect of England leaving out Jack Leach for an all-seam attack. That said, a flat white pitch suggests a spinner will be required. While England have taken a relaxed approach to Covid-19 this summer, given all requirements to isolate have long since been lifted by the UK government, New Zealand have been more stringent and four players have tested positive on tour. Among them is Kane Williamson, who missed the dramatic five-wicket defeat at Trent Bridge but is expected to return. Michael Bracewell and Devon Conway are also expected to be fit, having tested positive the day after the match. Asked about Williamson at training, the seamer Trent Boult replied: “He’s a big player for us, his record speaks for itself. He’s hungry to get out there to lead the side and desperate to get some runs. I know the boys are looking forward to the challenge. It’s hard being 2-0 down but there’s a lot of pride in that changing room.”","pubDate":"2022-06-21 16:29:51","image_url":"https://i.guim.co.uk/img/media/aabcfeb051003eab9b80114b6b562eb36c45ddc2/0_46_4264_2559/master/4264.jpg?width=460&quality=85&auto=format&fit=max&s=f9ddcdd2db9a0f859cc41c308c5b9813","source_id":"theguardian","country":["united kingdom","india","singapore","canada"],"category":["sports"],"language":"english"},{"title":"48 groundsmen to get a lakh each from Mumbai Cricket Association","link":"https://indianexpress.com/article/sports/cricket/48-groundsmen-to-get-a-lakh-each-from-mumbai-cricket-association-7982962/","keywords":["Cricket","Sports"],"creator":["Devendra Pandey"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-21 16:29:16","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"Karnataka's Abrar Kazi returns to competitive cricket after three-year ban","link":"https://sportstar.thehindu.com/cricket/abrar-kazi-karnataka-cricket-comeback-kpl-2019-match-fixing-ban/article38504797.ece","keywords":null,"creator":["Ashwin Achal"],"video_url":null,"description":"Kazi, who has featured in 17 first-class matches, was arrested in November 2019 in connection with the fixing allegations surrounding the Karnataka Premier League (KPL).","content":null,"pubDate":"2022-06-21 16:15:07","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Ben Stokes illness: What happened to Ben Stokes? Will Stokes play England vs New Zealand Headingley Test?","link":"https://thesportsrush.com/cricket-news-ben-stokes-illness-what-happened-to-ben-stokes-will-stokes-play-england-vs-new-zealand-headingley-test/","keywords":["Cricket","Ben Stokes","England","Harry Brook","New Zealand","New Zealand tour of England 2022"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Ben Stokes illness: The English captain has skipped a training session a couple of days before the third Test match of the summer. The third Test match of the ongoing New Zealand’s tour of England will be played in Leeds from June 23. With England already winning the first two Test matches, they have gained… The post Ben Stokes illness: What happened to Ben Stokes? Will Stokes play England vs New Zealand Headingley Test? appeared first on The SportsRush.","content":"Ben Stokes illness: The English captain has skipped a training session a couple of days before the third Test match of the summer. The third Test match of the ongoing New Zealand’s tour of England will be played in Leeds from June 23. With England already winning the first two Test matches, they have gained an unassailable 2-0 lead in the series. A rare eight-day break between two Test matches should witness two rejuvenated teams locking horns against each other from Thursday. New Zealand, who haven’t been able to restrict the hosts to chase down targets in both the matches, face COVID-19 challenge within their squad in addition to their players yet to perform according to their potential on this tour. What a day….@TrentBridge thank you for doing what you did,thank you to everyone who turned out,you got us going…….. Test Cricket is MIIIIIIIIIIINT!!!!!!!!!!!!!! — Ben Stokes (@benstokes38) June 14, 2022 Ben Stokes illness England Test captain Ben Stokes was out of action as far as training at the Headingley was concerned today. Stokes, 31, opted to skip a training session due to an illness. Having said that, the exact nature and extent of the same remains unknown for now. While Stokes has returned a negative COVID-19 test, there have been reports of ECB (England Cricket Board) and the team management confident about their skipper returning to training on the eve of the match tomorrow. Having just ushered in a new era under Stokes and head coach Brendon McCullum, England wouldn’t want their captain to sit out in only the third match. Readers must note that Stokes possesses of an incredible record in Leeds Tests scoring 348 runs at an average of 58 including two centuries and a half-century. In four innings this series, Stokes has scored 176 runs at an average of 58.66 including a couple of half-centuries. Other than his leadership and batting, Stokes has also picked three wickets in the series. Assuming that Stokes has to sit out in this match, England will have to find a new captain for they haven’t named an official vice-captain in this squad. In such a situation, uncapped Yorkshire batter Harry Brook will take Stokes’ place in the middle-order. The post Ben Stokes illness: What happened to Ben Stokes? Will Stokes play England vs New Zealand Headingley Test? appeared first on The SportsRush.","pubDate":"2022-06-21 16:00:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Parvin’s career best keeps Bedhampton top, while Sullivan is US Portsmouth’s unlikely batting hero – Hampshire Cricket League Division 4 South","link":"https://www.portsmouth.co.uk/sport/other-sport/parvins-career-best-keeps-bedhampton-top-while-sullivan-is-us-portsmouths-unlikely-batting-hero-hampshire-cricket-league-division-4-south-3740161","keywords":["Other Sport","Sport"],"creator":["Simon Carter"],"video_url":null,"description":"Top two Bedhampton Mariners and United Services Portsmouth relied on impressive late order batting to record their latest Hampshire League Division 4 South wins.","content":null,"pubDate":"2022-06-21 15:48:31","image_url":"https://www.portsmouth.co.uk/webimg/b25lY21zOjJiNjNiYTcwLTY1OTAtNGZmZi1iYTE2LWI0NmMwMmEzN2EyNDoyNGQyMWQ0Yy1iOTQ2LTQ3YmMtYTA3OS1mOTg5OTg3YWNlZGM=.jpg","source_id":"portsmouth","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"\"Comeback To The Indian Team...\": Prithvi Shaw Opens Up On Making A Return To National Side - NDTV Sports","link":"https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvY29tZWJhY2stdG8tdGhlLWluZGlhbi10ZWFtLXByaXRodmktc2hhdy1vcGVucy11cC1vbi1tYWtpbmctYS1yZXR1cm4tdG8tbmF0aW9uYWwtc2lkZS0zMDg4MDM50gGDAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL2NyaWNrZXQvY29tZWJhY2stdG8tdGhlLWluZGlhbi10ZWFtLXByaXRodmktc2hhdy1vcGVucy11cC1vbi1tYWtpbmctYS1yZXR1cm4tdG8tbmF0aW9uYWwtc2lkZS0zMDg4MDM5L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"\"Comeback To The Indian Team...\": Prithvi Shaw Opens Up On Making A Return To National Side  NDTV SportsWith 'Chandu Sir' in opposition, Shaw sees Ranji final as 'challenging' but also 'fun' | Cricbuzz.com - Cricbuzz  CricbuzzIn cricket and life, graph always moves up and down: Prithvi Shaw  Times of IndiaMatter of time that I middle those balls: Prithvi Shaw not concentrating on personal form ahead of Ranji final  India TodayRanji Trophy: Mumbai captain Prithvi Shaw advises youngsters to enjoy their game ahead of final  SportstarView Full coverage on Google News","content":null,"pubDate":"2022-06-21 15:24:00","image_url":null,"source_id":"google","country":["india"],"category":["sports"],"language":"english"},{"title":"Ranji Trophy winners in history: All Ranji Trophy seasons winners list","link":"https://thesportsrush.com/cricket-news-ranji-trophy-winners-in-history-all-ranji-trophy-seasons-winners-list/","keywords":["Cricket","Madhya Pradesh","Mumbai","Ranji Trophy 2021-22"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Ranji Trophy winners in history: All eyes on the weather, as 41-time champion Mumbai take on Madhya Pradesh in the final tomorrow. The grand finale of Ranji Trophy 2021-22 will take place between Mumbai and Madhya Pradesh at the M. Chinnaswamy Stadium in Bengaluru on Wednesday, June 22 (tomorrow). One of the youngest sides in… The post Ranji Trophy winners in history: All Ranji Trophy seasons winners list appeared first on The SportsRush.","content":"Ranji Trophy winners in history: All eyes on the weather, as 41-time champion Mumbai take on Madhya Pradesh in the final tomorrow. The grand finale of Ranji Trophy 2021-22 will take place between Mumbai and Madhya Pradesh at the M. Chinnaswamy Stadium in Bengaluru on Wednesday, June 22 (tomorrow). One of the youngest sides in the tournament, Mumbai., under the leadership of Prithvi Shaw would have their eyes on their 41st title, with the last one coming into their kitty during the 2015-16 season. Barring fast bowler Dhawal Kulkarni, all the rest of Mumbai players would feature in a Ranji Trophy final for the first time. Madhya Pradesh, on the other hand, led by Aditya Srivastava might not have many household names in their squad, but have put their heads down to go about their business so far, with their eyes now on the final hurdle past which lies their maiden Ranji Trophy title. Having said that, Mumbai would perhaps start as favourites, with their star-studded and in-form batting order comprising the likes of Yashasvi Jaiswal, Arman Jaffer, Suved Parkar, and Sarfaraz Khan (to name a few). Moreover, they also boast of being the best bowling team in the ongoing season, having bowled at an average of 19.73. And breathe that’s how Mumbai’s Ranji squad celebrated the #InternationalYogaDay Happy International Day of Yoga #InternationalDayofYoga #MCA #Mumbai #Cricket #IndianCricket #Wankhede #BCCI pic.twitter.com/VP41dEJ2T6 — Mumbai Cricket Association (MCA) (@MumbaiCricAssoc) June 21, 2022 Ranji Trophy winners in history With a record 41 titles under their belt, Mumbai have lifted the maximum of them since the inception of tournament in the year 1934. On the other hand, Madhya Pradesh last made it to a Ranji Trophy final in 1998-99 under the captaincy of their present coach Chandrakant Pandit. All Ranji Trophy seasons winners list Season Winner 1934-35 Bombay 1935-36 Bombay 1936-37 Nawanagar 1937-38 Hyderabad 1938-39 Bengal 1939-40 Maharashtra 1940-41 Maharashtra 1941-42 Bombay 1942-43 Baroda 1943-44 Western India 1944-45 Bombay 1945-46 Holkar 1946-47 Baroda 1947-48 Holkar 1948-49 Bombay 1949-50 Baroda 1950-51 Holkar 1951-52 Bombay 1952-53 Holkar 1953-54 Bombay 1954-55 Madras 1955-56 Bombay 1956-57 Bombay 1957-58 Baroda 1958-59 Bombay 1959-60 Bombay 1960-61 Bombay 1961-62 Bombay 1962-63 Bombay 1963-64 Bombay 1964-65 Bombay 1965-66 Bombay 1966-67 Bombay 1967-68 Bombay 1968-69 Bombay 1969-70 Bombay 1970-71 Bombay 1971-72 Bombay 1972-73 Bombay 1973-74 Karnataka 1974-75 Bombay 1975-76 Bombay 1976-77 Bombay 1977-78 Karnataka 1978-79 Delhi 1979-80 Delhi 1980-81 Bombay 1981-82 Delhi 1982-83 Karnataka 1983-84 Bombay 1984-85 Bombay 1985-86 Delhi 1986-87 Hyderabad 1987-88 Tamil Nadu 1988-89 Delhi 1989-90 Bengal 1990-91 Haryana 1991-92 Delhi 1992-93 Punjab 1993-94 Bombay 1994-95 Bombay 1995-96 Karnataka 1996-97 Mumbai 1997-98 Karnataka 1998-99 Karnataka 1999-00 Mumbai 2000-01 Baroda 2001-02 Railways 2002-03 Mumbai 2003-04 Mumbai 2004-05 Railways 2005-06 Uttar Pradesh 2006-07 Mumbai 2007-08 Delhi 2008-09 Mumbai 2009-10 Mumbai 2010-11 Rajasthan 2011-12 Rajasthan 2012-13 Mumbai 2013-14 Karnataka 2014-15 Karnataka 2015-16 Mumbai 2016-17 Gujarat 2017-18 Vidarbha 2018-19 Vidarbha 2019-20 Saurashtra   The post Ranji Trophy winners in history: All Ranji Trophy seasons winners list appeared first on The SportsRush.","pubDate":"2022-06-21 15:03:03","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Cristiano Ronaldo seen for first time since £1.7m Bugatti crash as Man Utd star dances topless with family in Majorca","link":"https://www.thesun.ie/sport/8983255/cristiano-ronaldo-man-utd-majorca-family-holiday-bugatti-crash/","keywords":["Sport","Football","Premier League","TikTok"],"creator":["Joshua Mbu"],"video_url":null,"description":"CRISTIANO RONALDO showed off his loose hips as he danced topless alongside niece Alicia Aveiro while holidaying in Majorca. The 37-year-old’s TikTok dance cameo comes after his £1.7million Bugatti was crashed into a wall by one of his bodyguards. Ronaldo was in another vehicle in a small convoy with his loved ones when his employee came […]","content":"CRISTIANO RONALDO showed off his loose hips as he danced topless alongside niece Alicia Aveiro while holidaying in Majorca. The 37-year-old’s TikTok dance cameo comes after his £1.7million Bugatti was crashed into a wall by one of his bodyguards. https://www.instagram.com/aliciaaveiro/Ronaldo joined his niece on a TikTok[/caption] https://www.instagram.com/aliciaaveiro/The 37-year-old danced topless[/caption] https://www.instagram.com/aliciaaveiro/Ronaldo wasn’t shy to shake his hips and show off his dance moves[/caption] https://www.instagram.com/aliciaaveiro/The Man Utd star was in high spirits following the crash of his £1.7m Bugatti[/caption] SolarpixA bodyguard crashed the car into a wall[/caption] Ronaldo was in another vehicle in a small convoy with his loved ones when his employee came off the road and smashed into a stone wall. However, the crash hasn’t dampened the mood on Ronaldo’s family holiday. In fact, Ronaldo is continuing to spend quality time with his family. He has been pictured enjoying days out with his family on his £5.5m Azimut Grande superyacht, which is moored in Port Adriano in the south-west of Majorca. READ MORE ON MAN UTD EN GUARD Ronaldo's €1.7m Bugatti crashed by bodyguard while he was on way to €5.5m yacht And the dad-of five is believed to be renting a luxury villa near the scene of Monday morning’s accident. Ronaldo also spent time with niece Alicia and even participated in a TikTok, dancing topless and showing off his loose hips. Cristiano Jr also got involved while donning his Man Utd gear. Erik ten Hag will get a look at some of his non-international stars in training from June 27 – but will have to wait to see Ronaldo in action. Most read in Sport CRIS CRASH Man Utd star Ronaldo's Bugatti involved in crash as police launch investigation TRAGIC LOSS Jockey, 19, dies in head-on car crash just six days after riding winner NO JOSHING UFC's Josh Emmett looks unrecognisable after fight as he shows wounds to Bisping MC MONEY Rory McIlroy pockets massive six-figure pay day after 5th place finish in US Open FAIR PLAY Leinster star Nick McCarthy comes out as gay as he hails club and team-mates RIP COLIN Ex-England and Leeds star Colin Grainger passes away aged 89 as tributes pour in SUN BINGO GET £50 BONUS & 50 FREE SPINS TODAY United’s pre-season schedule has already been announced. They will kick off their pre-season tour with a clash against rivals Liverpool in Bangkok on July 12. United will also play games against Melbourne Victory and Crystal Palace at the Melbourne Cricket Ground, on July 15 and 19 respectively. Whether Ronaldo leads the line for United in August’s Premier League start is yet to be seen. The legendary forward is being linked with a move to Roma and an emotional return to Sporting Lisbon. Former boss Jose Mourinho is said to be “dreaming” of a reunion with Ronaldo after their trophy-laden stint at Real Madrid together.","pubDate":"2022-06-21 14:48:03","image_url":null,"source_id":"thesun_ie","country":["ireland"],"category":["sports"],"language":"english"},{"title":"In cricket and life, graph always moves up and down: Prithvi Shaw","link":"https://timesofindia.indiatimes.com/sports/cricket/news/in-cricket-and-life-graph-always-moves-up-and-down-prithvi-shaw/articleshow/92367318.cms","keywords":null,"creator":null,"video_url":null,"description":"Only three half-centuries in five Ranji Trophy games doesn't match the lofty standards that he has set for himself but a pragmatic Mumbai captain Prithvi Shaw also knows that cricket is a mirror image of life where the change in graph is the only constant thing.","content":null,"pubDate":"2022-06-21 14:44:53","image_url":null,"source_id":"toi","country":["india"],"category":["sports"],"language":"english"},{"title":"Unwell Stokes misses England training ahead of third Test","link":"https://sportstar.thehindu.com/cricket/international/unwell-stokes-misses-england-training-session-headingley-test-new-zealand-cricket/article38504785.ece","keywords":null,"creator":["AFP"],"video_url":null,"description":"An England and Wales Cricket Board spokesperson indicated that Stokes had tested negative for Covid-19 on Tuesday morning.","content":null,"pubDate":"2022-06-21 14:44:17","image_url":null,"source_id":"sportstar","country":["india"],"category":["sports"],"language":"english"},{"title":"Watch: Pakistan's Sarfaraz Ahmed gets clean bowled by his own son","link":"https://zeenews.india.com/cricket/watch-pakistans-sarfaraz-ahmed-gets-clean-bowled-by-his-own-son-2476337.html","keywords":null,"creator":null,"video_url":null,"description":"In the video, Sarfaraz and his son can be seen playing cricket surrounded by a big group of fans.","content":"Former Pakistan captain Sarfaraz Ahmed , who was the skipper of the Pakistan cricket team that won the ICC Champions Trophy 2017, was clean bowled by his own son in a gully cricket match in Pakistan. A video is making rounds on social media where Sarfaraz can be seen batting against his son Abdullah. Sarfaraz has expressed in the past that he does not wish for Abdullah to take up cricket as he does not want his son to face immense scrutiny and pressure of playing for Pakistan at the highest level. Shabash Beta Abba ki he wicket he ura di @SarfarazA_54 pic.twitter.com/rpvdxcNUVv — Thakur (@hassam_sajjad) June 20, 2022 In the video, Sarfaraz and his son can be seen playing cricket surrounded by a big group of fans. The crowd cheer for Abdullah as the yorker sneaks under his father's bat. Sarfaraz had a big smile on his face after being outsmarted by his own son. \"Abdullah is passionate about playing cricket. But I don't want him to become a cricketer. Actually, being a cricketer, I suffered many things that I don't want Abdullah to face. It's human nature. Being a cricketer, I want my brother or son to be selected immediately. Otherwise, it hurts,\" Sarfaraz had said during an interview on a local channel. Regardless of his father's view, Abdullah is really interested in cricket and wishes to be a fast bowler. Meanwhile, Sarfaraz Khan who once captained Pakistan in the famous victory against Team India in the 2017 ICC Champions Trophy final, is struggling to find a place in the national team. He last played a T20I for Pakistan against Bangladesh in November 2021. He is the captain of the Pakistan Super League franchise Quetta Gladiators. His team finished fifth in the points table last season.","pubDate":"2022-06-21 14:30:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"Mumbai vs Madhya Pradesh Ranji Trophy final Live Cricket Score Streaming: When and where to watch?","link":"https://indianexpress.com/article/sports/cricket/mumbai-vs-madhya-pradesh-ranji-trophy-2021-22-final-schedule-squads-venues-telecast-live-streaming-7982768/","keywords":["Cricket","Sports"],"creator":null,"video_url":null,"description":null,"content":"Mumbai vs Madhya Pradesh Ranji Trophy final Live Streaming: On paper, the Mumbai team is overwhelming favourite in the final match starting on Wednesday with the best Gen-Next talent in its repertoire. Sarfaraz Khan, after a few indifferent seasons, has raised his game to an altogether different level with 800-plus runs in just five games. However, MP is one of the most improved teams in recent times and under Chandrakant Pandit inculcated the discipline that’s needed to reach the summit clash in a tournament like Ranji Trophy. Missing Venkatesh Iyer in batting and pace spearhead Avesh Khan in bowling didn’t do them any good but unheralded Kumar Kartikeya, with his stamina to bowl for hours, has done the job for his team. When is the Ranji Trophy final between Mumbai and Madhya Pradesh? The Ranji Trophy final between Mumbai and Madhya Pradesh will take place on Wednesday, June 22, 2022. Best of Express Premium Premium UPSC Key-June 21, 2022: Know the relevance of ‘Education in India’ to ‘Hi... Premium Newsmaker | Eknath Shinde: No. 2 after the Thackerays, backer of BJP, MVA... Premium Among 3 arrested from Kutch: Key Moosewala shooter got weapons consignmen... Premium To end illegal mining, Madhya Pradesh plans to make it legal in parts of ... More Premium Stories >> Where is the Ranji Trophy final between Mumbai and Madhya Pradesh? The Ranji Trophy final between Mumbai and Madhya Pradesh will be played at the M.Chinnaswamy Stadium, Bengaluru. What time does Ranji Trophy final between Mumbai and Madhya Pradesh begin? The Ranji Trophy final between Mumbai and Madhya Pradesh will begin at 9:30 AM IST. The toss will take place at 9:00 AM IST. Which TV channels will broadcast Ranji Trophy final between Mumbai and Madhya Pradesh? Ranji Trophy final between Mumbai and Madhya Pradesh will broadcast on the Star Sports network. How do I watch online live streaming of Ranji Trophy final between Mumbai and Madhya Pradesh? Ranji Trophy final between Mumbai and Madhya Pradesh live streaming will be available on Disney+ Hotstar. You can catch live scores, live updates and live commentary on IndianExpress.com . Squads: Mumbai: Prithvi Shaw (captain), Yashasvi Jaiswal, Armaan Jaffer, Suved Parkar, Sarfaraz Khan, Hardik Tamore (wicket-keeper), Shams Mulani, Tanush Kotian, Tushar Deshpande, Dhawal Kulkarni, Mohit Avasthi Madhya Pradesh: Yash Dubey, Himanshu Mantri (wicket-keeper), Shubham S Sharma, Rajat Patidar, Aditya Shrivastava (captain), Akshat Raghuwanshi, Saransh Jain, Kumar Kartikeya, Puneet Datey, Anubhav Agarwal, Gaurav Yadav Express Subscription Check out our special pricing for international readers when the offer lasts Subscribe Now","pubDate":"2022-06-21 14:06:03","image_url":null,"source_id":"indianexpress","country":["india"],"category":["sports"],"language":"english"},{"title":"\"Yoga se hi hoga\" - Here's how Indian cricket stars wished fans on International Yoga Day 2022","link":"https://www.sportskeeda.com/cricket/here-s-indian-cricket-stars-wished-fans-international-yoga-day-2022?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Cricket"],"creator":["Aditya Suketu Desai"],"video_url":null,"description":null,"content":null,"pubDate":"2022-06-21 13:21:24","image_url":"https://static.sportskeeda.com/editor/2022/06/26585-16558147872445-1920.jpg","source_id":"sportskeeda","country":["india"],"category":["sports"],"language":"english"},{"title":"Deepak Chahar injury update: India and CSK pacer to miss England T20s, to return on THIS date","link":"https://zeenews.india.com/cricket/deepak-chahar-injury-update-india-and-csk-pacer-to-miss-england-t20s-to-return-on-this-date-2476321.html","keywords":null,"creator":null,"video_url":null,"description":"India and CSK pacer Deepak Chahar who is currently healing his hamstring injury will not be part of India's squad for the T20Is vs England cricket team that starts after the end of the 5th Test match at Edgbaston. Chahar has already missed the whole of IPL 2022 for CSK and the T20s vs South Africa and Ireland. India will soon begin playing the 2 away T20s vs Ireland from June 26 and Chahar has not been picked in that squad. It was expected that he may get picked in Indian squad for the T20s but turns out the pacer is not returning any time soon.","content":null,"pubDate":"2022-06-21 13:20:00","image_url":null,"source_id":"zeenews","country":["india"],"category":["sports"],"language":"english"},{"title":"“How good is this guy”: Russel Arnold delighted as Charith Asalanka scores maiden ODI century vs Australia at Premdasa Stadium","link":"https://thesportsrush.com/cricket-news-how-good-is-this-guy-russel-arnold-delighted-as-charith-asalanka-scores-maiden-odi-century-vs-australia-at-premdasa-stadium/","keywords":["Cricket","Australia","Australia tour of Sri Lanka 2022","Charith Asalanka","Russel Arnold","Sri Lanka"],"creator":["Dixit Bhargav"],"video_url":null,"description":"Charith Asalanka scores maiden ODI century: The Sri Lankan batter has reached the three-figure mark in his 15th ODI appearance. During the fourth ODI of the ongoing Australia’s tour of Sri Lanka in Colombo, Sri Lanka batter Charith Asalanka has become the second Sri Lankan batter to bring up a maiden ODI century in this… The post “How good is this guy”: Russel Arnold delighted as Charith Asalanka scores maiden ODI century vs Australia at Premdasa Stadium appeared first on The SportsRush.","content":"Charith Asalanka scores maiden ODI century: The Sri Lankan batter has reached the three-figure mark in his 15th ODI appearance. During the fourth ODI of the ongoing Australia’s tour of Sri Lanka in Colombo, Sri Lanka batter Charith Asalanka has become the second Sri Lankan batter to bring up a maiden ODI century in this series. Coming in to bat at No. 5 in the 10th over, it was only on the 36th ball that he faced in the 21st over that Asalanka scored his first boundary off Australia all-rounder Cameron Green. Not a quintessential hard-hitting knock, Asalanka ran singles and doubles at will to bail his team out of trouble. It was his ability to not let the run-scoring get to a standstill despite losing three early wickets that saw him thriving at the R Premdasa Stadium today. Having played a second-fiddle to all-rounder Dhananjaya de Silva (60) in a 99-ball 101-run fourth-wicket partnership, Asalanka took the onus upon himself to do the heavy-lifting post the former’s dismissal in the 27th over. Asalanka, who hit a boundary against Australia fast bowler Josh Hazlewood to register a 60-ball half-century in the 30th over, reached the three-figure mark by running a single off spinner Matthew Kuhnemann in the 45th over. The 24-year old batter returned to the pavilion in the 48th over after being dismissed by Pat Cummins but only after scoring a game-changing 110 (106) with the help of 10 fours and a six. 🤸‍♀️🤸‍♀️🤸‍♀️🤸‍♀️First of many Charith Asalanka #SLvAus How good is this guy .. he’s made us wait but such a treat to watch .. Well done Malli .. 👏👏👏👏 pic.twitter.com/DdZZHAKt9n — Russel Arnold (@RusselArnold69) June 21, 2022 Maiden ODI 💯 for Charith Asalanka : Fantastic hundred rescuing Sri Lanka from 34/3 🏏🇱🇰 pic.twitter.com/rEQll0UuHW — Azzam Ameen (@AzzamAmeen) June 21, 2022 💯 Maiden International century for Charith Asalanka🔥 #SLvAUS pic.twitter.com/02ABe4wn1v — Sri Lanka Cricket 🇱🇰 (@OfficialSLC) June 21, 2022 Charith Asalanka deserved ALL the hugs 🤗 #SLvAUS pic.twitter.com/OFz3qHiaKt — Estelle Vasudevan (@Estelle_Vasude1) June 21, 2022 First Pathum Nissanka, now Charith Asalanka. There’s a very promising future in this top order. #SLvAUS — Andrew McGlashan (@andymcg_cricket) June 21, 2022 There’s something quite old-school about Charith Asalanka, the way he bats & the way he builds an innings. Throw him into the 1997 Sri Lankan team & you’d expect him to fit right in #SLvAus — Bharat Sundaresan (@beastieboy07) June 21, 2022 For more cricket-related news, click here .","pubDate":"2022-06-21 13:00:55","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"},{"title":"Westhoughton back on top after Bridge win","link":"https://www.theboltonnews.co.uk/sport/20222450.westhoughton-back-top-bridge-win/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Westhoughton returned to the top of the Bolton Cricket League following a nine-wicket win against Astley Bridge. Bridge reached 220-9, with major contributions coming from Shahzad Patel (48) and Shivan Perera (44).","content":null,"pubDate":"2022-06-21 12:27:00","image_url":"https://www.theboltonnews.co.uk/resources/images/13908429/?type=app&htype=0","source_id":"theboltonnews","country":["united kingdom"],"category":["sports"],"language":"english"},{"title":"MUM vs MP Ranji final 2022: Mumbai vs Madhya Pradesh final Match Prediction Ranji Trophy","link":"https://thesportsrush.com/cricket-news-mum-vs-mp-ranji-final-2022-mumbai-vs-madhya-pradesh-final-match-prediction-ranji-trophy/","keywords":["Cricket","Ranji Trophy","Ranji Trophy 2022","Ranji Trophy prediction"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"MUM vs MP Ranji final 2022: The SportsRush brings you the prediction of the Ranji Trophy 2022 final between Mumbai and Madhya Pradesh. Ranji Trophy, The premier domestic cricket tournament of India has finally reached its final. Madhya Pradesh will take on Mumbai in the final match of Ranji Trophy 2022 at the Chinnaswamy Stadium… The post MUM vs MP Ranji final 2022: Mumbai vs Madhya Pradesh final Match Prediction Ranji Trophy appeared first on The SportsRush.","content":"MUM vs MP Ranji final 2022: The SportsRush brings you the prediction of the Ranji Trophy 2022 final between Mumbai and Madhya Pradesh. Ranji Trophy, The premier domestic cricket tournament of India has finally reached its final. Madhya Pradesh will take on Mumbai in the final match of Ranji Trophy 2022 at the Chinnaswamy Stadium in Bengaluru on 22 June 2022. The game will start at 9:30 AM IST, and it will be broadcasted live. Mumbai are the record champions of the tournament, and they are searching for their 42nd title, whereas Madhya Pradesh are looking for their first-ever Ranji Trophy win. This is MP’s first final after 23 years. Madhya Pradesh defeated Bengal by 173 runs in the semi-finals of the tournament, whereas Mumbai reached the finals based on the first innings lead against UP in the semi-final. MUM vs MP Ranji final 2022 Mumbai have won three of their last five matches, whereas two of their games ended in a draw. Madhya Pradesh, on the other hand, have won four of their last five games, drawing one of them. In the last five games between both sides, Mumbai have won two, whereas three games ended in a draw. Mumbai’s batting has been incredible in the tournament so far. Sarfaraz Khan is the highest run-scorer of the tournament, whereas Yashasvi Jaiswal has also scored two consecutive centuries in the tournament. The likes of Prithvi Shaw and Arman Jaffer will also play a huge part in the match. Shamsi Mulani has led the bowling of Mumbai, and he is the highest wicket-taker of the tournament. The other bowlers of the side have also assisted him well. Excitement Levels ! Which team are you rooting for in the #RanjiTrophy #Final @Paytm | #MPvMUM pic.twitter.com/MAE6rZ2MKj — BCCI Domestic (@BCCIdomestic) June 21, 2022 Madhya Pradesh will rely on their batting trio of Yash Dubey, Saurabh Sharma and Rajat Patidar. All three of them have been incredible in the tournament so far, the MP side will again rely on them. In bowling, Mumbai Indians’ spinner Kumar Kartikeya has been incredible with 27 wickets under his belt so far. Mumbai’s experience of playing in the finals will be quite vital for them in this big match. Mumbai have lost just one of their 12 finals in the last 30 years. The bowling of the Mumbai side is yet to concede a century in the tournament. In terms of pace bowling, the average of MP’s pacers is the best. Probable Playing 11 Mumbai: Prithvi Shaw, Yashasvi Jaiswal, Armaan Jaffer, Suved Parkar, Sarfaraz Khan, Hardik Tamore, Shams Mulani, Dhawal Kulkarni, Tanush Kotian, Mohit Avasthi, Tushar Deshpande. Madhya Pradesh: Yash Dubey, Himanshu Mantri, Shubham Sharma, Rajat Patidar, Aditya Shrivastav, Akshat Raghuwanshi, Saransh Jain, Anubhav Agarwal, Kuldeep Sen, Kumar Kartikeya, Puneet Datey. Match Prediction Ranji Trophy Looking at the experience of playing in the finals and the quality of their players, Mumbai are the favourites to win the match. The post MUM vs MP Ranji final 2022: Mumbai vs Madhya Pradesh final Match Prediction Ranji Trophy appeared first on The SportsRush.","pubDate":"2022-06-21 12:20:29","image_url":null,"source_id":"thesportsrush","country":["united states of america","united kingdom","india","australia"],"category":["sports"],"language":"english"}]}