{"newsArray":[{"title":"IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-cameron-green-arjun-tendulkar-shine-on-the-big-stage-as-mi-beat-srh-for-third-win-on-the-trot-12474132.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot","content":"Cricket IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot Having been acquired by MI for a whopping price tag of Rs 17.50, Green certainly came into the IPL with a lot of expectations. FirstCricket Staff April 19th, 2023 2:23:18 IST Arjun Tendulkar celebrates the wicket of Bhuvneshwar Kumar. Sportzpics Australia all-rounder Cameron Green had been a revelation even before he made his Indian Premier League (IPL) debut for Mumbai Indians (MI). And on Tuesday, the platform was well set in Hyderabad for him to shine, and he surely impressed, with most of the damage being done with the bat. Having been acquired by MI for a whopping price tag of Rs 17.50, Green certainly came into the IPL with a lot of expectations. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ And on Tuesday, it was not only about Green finally announcing his arrival on the big stage, but also justifying his price tag, and also giving a glimpse to the fans of what they could expect from the 23-year-old. Ummmmm, Cameron Green is the REAL DEAL! The Ashes is going to be one helluva series! — Kevin Pietersen🦏 (@KP24) April 18, 2023 Green scored an unbeaten 64 while coming into bat at number three, and also finished with figures of 1/29 from four overs. It was certainly a performance to remember for Green, but he is just not getting carried away with the expectations. And there’s no reason to be. “I think first couple of games were a learning curve for me and our team. Bit of a sticky situation (when I walked out to bat). But glad the plans came off. I am a work in progress with my bowling at the death. Obviously, we can continue with the winning momentum,” said a confident Green at the post-match presentation ceremony. Not only Green, but Arjun Tendulkar too steals the limelight Cameron Green was not the only MI star who rose up to the big occasion. Arjun Tendulkar, son of cricketing legend Sachin Tendulkar, finally made a mark in the IPL with his first-ever wicket in the cash-rich league. Arjun had been part of the MI setup in 2021 and 2022, but it is only this year that the 23-year-old is finally getting a chance to shine. A superb all-round performance by Mumbai Indians once again. Cameron Green impressed with both bat & ball. Ishan & Tilak’s batting is as good as it gets! The IPL is getting more interesting every day. Great going boys!💙 And finally a Tendulkar has an IPL wicket!😛 #SRHvMI pic.twitter.com/e4MAFEZyjY — Sachin Tendulkar (@sachin_rt) April 18, 2023 On Tuesday, Arjun was given with the responsibility of bowling the final over of the match, with SRH needing 20 runs off six balls. He began with a low full toss to Abdul Samad, that ended up as a dot ball, and the SRH batter was immediately run out the very next ball, with Hrithik Shokeen perfectly timing in a throw to Ishan Kishan, who whipped off the bails. Mayank Markande was the new batter in, and Markande was off the mark with a brace in the third ball of the over. SRH still needed 16 runs off the last three balls, and while it was certain by the end that MI would have the last laugh, Arjun delivered the final punch to the match in some fashion, to get rid of Bhuvneshwar Kumar and seal the match. Arjun unleashed a fuller ball to Bhuvneshwar, and Bhuvneshwar looked to go straight down the ground, but instead got an outside edge to Rohit Sharma at extra cover, who completed the catch. There’s still a long way to go in Arjun’s cricketing career, but to get off the mark with the ball in the IPL would certainly be a special feeling. “Obviously it was great getting my first IPL wicket. I just had to focus on what was in hand, the plan and executing it. Our plan was just to bowl wide and get the long boundary into play, make the batsman hit it to the longer side. I love bowling, I am happy to bowl anytime the captain asks me to and just stick to the team plan and give my best,” said Arjun after the match. Lack of resistance from SRH batters SRH batters clearly found the going tough on Tuesday against MI, and much of their batting troubles were due to the inability of their batters to get off to good starts. #MumbaiIndians are on a rampage. @timdavid8 with two key catches as Klaasen and Mayank Agarwal depart in quick succession. Live – https://t.co/oWfswiuqls #TATAIPL #SRHvMI #IPL2023 pic.twitter.com/9QSK3QEzcD — IndianPremierLeague (@IPL) April 18, 2023 The likes of Harry Brook (9), Rahul Tripathi (7) and Abhishek Sharma (1) felt the pressure of a big-total chase, and eventually succumbed to it, but an unlikely hero in Mayank Agarwal stepped in for SRH and almost did the job for them. Agarwal looked set for a 50-plus score, and was almost like the central figure for SRH, even forging productive stands with Aiden Markram (22) and later Heinrich Klaasen (36), but lack of support from some of his other partners probably hurt SRH’s momentum going forward. Had the top order fired in full cylinders for SRH, the complexion of the game would have been slightly different, and maybe, that would have helped them get those 20 runs needed from the final over. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 02:23:18 IST Tags: Ipl 2023 Ipl 2023 Mi Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 20:53:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Arjun-Tendulkar-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"‘The real deal’: Cameron Green masterclass steers Mumbai Indians towards third-consecutive victory","link":"https://www.foxsports.com.au/cricket/the-real-deal-cameron-green-masterclass-steers-mumbai-indians-towards-thirdconsecutive-victory/news-story/0b05f02a1bc40c103af6b70ecbbef950","keywords":null,"creator":null,"video_url":null,"description":"Australian all-rounder Cameron Green hit his maiden half-century in the Indian Premier League and took one wicket to lead the Mumbai Indians to a 14-run victory over the Sunrisers Hyderabad on Tuesday evening.","content":"Australian all-rounder Cameron Green hit his maiden half-century in the Indian Premier League and took one wicket to lead the Mumbai Indians to a 14-run victory over the Sunrisers Hyderabad on Tuesday evening. Rohit Sharma’s Mumbai remain the most successful franchise with five trophies in the men’s edition and moved to sixth in the 10-team table after three consecutive wins. Green, bought by Mumbai for AU$3.15 million in the auction, steered the team to 5-192 with an attacking 64 (40) not out following his promotion to number three in Hyderabad. Watch every match of the 2023 IPL LIVE & On-Demand with Kayo. New to Kayo? Start your free trial now > Hyderabad, led by South African Aiden Markram, were bowled out for 178 in 19.5 overs despite a whirlwind 36 (16) by Heinrich Klaasen and Mayank Agarwal’s 48 (41). Needing 20 in the final over, Mumbai handed the ball to Arjun Tendulkar, son of legendary Sachin Tendulkar, and the left-arm quick bowled a perfect over and got his maiden IPL wicket to seal the match. But it was the 1.98m Green, who stood out with key partnerships including a stand of 56 off 28 balls with Tilak Varma, who hit 37 (17). Green struck three successive boundaries to reach his maiden IPL fifty and followed it up with a six and along with fellow Australian Tim David took the total past 190. “The first couple of games were a learning curve for me and the team, but we‘ve now won three in a row,” Green said. South African’s left-arm quick Marco Jansen took two wickets but missed a face off with his twin brother Duan Jansen, who made his IPL debut for Hyderabad in the previous match, but did not make the XI for this game. In Hyderabad’s chase, Arjun started with the new ball for Mumbai to bowl two economical overs in his second IPL outing after his debut on Sunday. But it was Jason Behrendorff’s left-arm pace that got two key wickets including Hyderabad’s England import and previous-match centurion Harry Brook for nine. Wickets kept tumbling and Green worked with the ball as well when his pace bowling got Markram back in the pavilion for 22. Klaasen and Agarwal attempted to raise the hopes in their stand of 55 but their departure triggered the final slide for Hyderabad. Behrendorff and impact player Riley Meredith claimed two wickets each while David took four catches. Mumbai Indians all-rounder Cameron Green. Photo by Noah SEELAM / AFP Source: AFP","pubDate":"2023-04-18 20:49:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH","link":"https://www.firstpost.com/photos/ipl-2023-cameron-green-puts-on-a-clinical-display-as-mi-get-the-better-of-srh-12474092.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH","content":"Photos IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH Check out photos from the IPL 2023 match between Sunrisers Hyderabad and Mumbai Indians. FirstCricket Staff April 19, 2023 01:08:58 IST 1 /6 Mumbai Indians defeated Sunrisers Hyderabad by 14 runs to jump to sixth spot in the IPL 2023 points table on Tuesday. Sportzpics 2 /6 SRH won the toss and opted to field. Cameron Green, though, starrred for MI, scoring an unbeaten 64 to take MI to 192. Sportzpics 3 /6 Marco Jansen struck twice in the 12th over of the innings, removing Ishan Kishan and Suryakumar Yadav. Sportzpics 4 /6 Rohit Sharma became just the fourth cricketer to score 6000 runs in the IPL. Sportzpics 5 /6 Tim David was sharp on the field, taking as many as four catches. Sportzpics 6 /6 Mayank Agarwal scored 48 but his knock went in vain in the end, with SRH falling short by 14 runs. Sportzpics","pubDate":"2023-04-18 19:38:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Rohit-Sharma-MI-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-sunrisers-hyderabad-were-not-at-our-best-against-mumbai-indians-admits-aiden-markram-12474062.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram","content":"Cricket IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram Sunrisers Hyderabad kept losing wickets at regular intervals as they failed to chase down a target of 193 against Mumbai Indians. The Hyderabad-based franchise were eventually restricted to 178. FirstCricket Staff April 19th, 2023 0:55:32 IST SRH skipper Aiden Markram admitted that they were not at their best against MI. Sportzpics Sunrisers Hyderabad (SRH) skipper Aiden Markram admitted that his side were ‘not at the best’ against Mumbai Indians (MI) in their Indian Premier League (IPL) contest in Hyderabad on Tuesday. Sunrisers Hyderabad kept losing wickets at regular intervals as they failed to chase down a target of 193 against Mumbai Indians. The Hyderabad-based franchise were eventually restricted to 178, courtesy a clinical performance from MI’s bowlers. Most of their batters failed to get going. Mayank Agarwal (48) and Heinrich Klaasen (38) looked good, but were dismissed at crucial junctures, while Markram failed to convert a start into a big knock. “All in all we were not at our best tonight. Credit to the boys for taking it deep. We could have done with conceding fewer runs towards the end. It (the surface) stayed pretty much the same throughout the night, on the slower side, not bad at all. Whenever we took pace off the ball did not come on to the bat,” said Markram at the post-match presentation ceremony. “We made a call (to bowl first) before the toss and if the dew came in then we were in the game. There was a desperation to make things right from the previous season. Not too bummed, there are areas we can improve on and we will look to do that to give us a good chance to win the next game,” he added. Rohit Sharma, who has previously played for the now defunct-Deccan Chargers, briefly recalled his early days in the IPL. “I have got lot of memories here (in Hyderabad). I played three years here. Won a trophy as well. Love coming back here. To settle them (youngsters) in is important for us. We had a couple of guys who hadn’t played IPL before. We had to back them. They are coming into their own. I am enjoying what I am doing (with the bat),” said Rohit. “It is a different role. I am trying to set the tempo. Glad to get some scores in the powerplay. I understand one of us has to bat big. We have a long batting line-up. We want these guys to come out and bat freely. We watched Tilak last season. We all know what he can. I love his approach. He doesn’t play the bowler, he plays the ball. We will see him play for a lot of teams,” he added. Rohit termed Arjun Tendulkar, who claimed his first wicket on Tuesday, as a confident bowler. “Arjun has been a part of this team for three years. He understands what he wants to do. He is quite confident as well. He is clear in his plans. He is trying to swing the new ball and bowl yorkers at the death,” added Rohit. Cameron Green, the Player of the Match, was glad that the plans worked despite a ‘sticky’ situation. Green scored an unbeaten 64 and took a wicket during SRH’s reply. “I think first couple of games were a learning curve for me and our team. Bit of a sticky situation (when I walked out to bat). But glad the plans came off. I am a work in progress with my bowling at the death. Obviously, we can continue with the winning momentum,” said Green. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 00:55:32 IST Tags: Aiden Markram Ipl 2023 Ipl 2023 Mi Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 19:25:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/ALI14_6422-1.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Kohli fined after high-octane IPL clash","link":"https://www.ft.lk/sports/Kohli-fined-after-high-octane-IPL-clash/23-747452","keywords":null,"creator":null,"video_url":null,"description":null,"content":"NEW DELHI, AFP: Indian cricket star Virat Kohli was fined Tuesday for breaching the IPL code of conduct, after his side Royal Challengers Bangalore went down to Chennai in a nail-biting match. Kohli’s wild celebration of Chennai batsman Shivam Dube’s wicket at a crucial point of the high-scoring game on Monday resulted in the sanction, according to media reports. The fiery 34-year-old was fined 10% of his match fee after admitting to the offence, organisers said, without detailing what rule the batsman broke. The tense match in front of a raucous capacity Bengaluru crowd witnessed a record-equalling 33 sixes and was finally won by Chennai Super Kings, led by M.S. Dhoni, by eight runs. One of the best batsmen of the modern game, “King Kohli” has often run into trouble with his aggressive approach and no-holds-barred emotions on the cricket pitch. He has had numerous run-ins with opposing players and was once reprimanded after hitting a plastic chair with a bat following his dismissal during an IPL match. He escaped a fine. According to media reports this week, Kohli has fallen out with India’s former cricket Chief Sourav Ganguly with the two men reportedly “unfollowing” each other on Instagram. Kohli quit as Indian T20 skipper in late 2021 and in January 2022 was sacked from the one-day captaincy and gave up leading the Test side too after a reported fall-out with Ganguly.","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ireland made it easy for us by setting white ball fields: Dimuth","link":"https://www.ft.lk/sports/Ireland-made-it-easy-for-us-by-setting-white-ball-fields--Dimuth/23-747451","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Test captain Dimuth Karunaratne said that Test newcomers Ireland’s inexperience in the longer format helped his side greatly to win the first Test which ended on day three at Galle yesterday. Sri Lanka won quite convincingly by an innings after racking up a mammoth total of 591-6 declared with four batsmen including Karunaratne contributing centuries. “For a Test player the real test is to be able to adapt to any conditions against any bowling attack. New Zealand was a quality bowling team but the Ireland bowling line-up we cannot underestimate. They bowled well in patches,” said Karunaratne at the post-match press conference. “The drawback was because Ireland has not played long in this format, their field settings and their bowling lines and lengths were not up to the mark. They have been playing so much white ball cricket and they used similar fields for the Test match also. That made it a little easy for us because there were a lot of single options available to us. But as they continue to play, they will correct these shortcomings in Test cricket. It is also a challenge for their players to come here and learn how to play in these conditions against our bowling unit.” Ireland captain Andy Balbirnie put his team’s defeat down to tough conditions and the absence of playing red ball cricket. “Sri Lanka has played a lot of Test cricket in these conditions. We fought in stages of the game but not long enough. We knew it was challenging and what it is like to play Test cricket in the last three days. It’s tough because we know we want to perform well in these games but it is very tricky. We must learn very quickly and learn on our feet and hopefully produce that form in the next game.” “You can’t be critical of the players. They are really trying their hardest to be competitive at this level. But it is difficult when you come up against a team who in their home conditions are as good as anyone.” “It’s tough cricket. After the first day there were a lot of sore bodies. I’ve been through that too often but it’s all about bouncing back. We are not putting expectations on the players, we just want them to express themselves and enjoy this challenge. It is tough and it is only going to get tougher,” Balbirnie said. – [ST]","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jayasuriya bowls Sri Lanka to their largest Test victory","link":"https://www.ft.lk/sports/Jayasuriya-bowls-Sri-Lanka-to-their-largest-Test-victory/23-747455","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Minnows Ireland suffered their first defeat by an innings in Test cricket when Sri Lanka beat them by an overwhelming margin of an innings and 280 runs with two days to spare in the first Test played at the Galle International Cricket Stadium yesterday, to go one-up in the two-Test series. The margin of victory was Sri Lanka’s largest in Test cricket, improving on the innings and 254-run win over Zimbabwe at Bulawayo in 2004. The match in fact ended in the final session of the third day with Ireland being bowled out for 143 and 168 in reply to Sri Lanka’s mammoth first innings total of 591-6 declared. The left-arm spin of Prabath Jayasuriya proved too much for the Irish batsmen to counter as they succumbed to him on ten occasions in both innings giving the bowler match figures of 10 for 108 to give him the Player of the Match award. Jayasuriya spun a web around the hapless Irish batsmen who had no answer to his wily spin finishing with career best innings figures of 7 for 52 in the first innings and following it up with 3 for 56 in the second. Apart from Jayasuriya, it was another left-arm bowler who caused misery to the Ireland batting. Seamer Vishwa Fernando achieved the initial breakthrough for Sri Lanka scalping Murray Commins and Captain Andrew Balbirnie in both innings to put Ireland on the back foot. After that it was a case of pure survival against the wiles of Jayasuriya and the off-breaks of Ramesh Mendis who was forced to play second fiddle as Jayasuriya took the centre stage with his prolific wicket-taking ability at Galle. Of the 43 wickets he has taken so far in his short Test career of six matches, 39 has come at Galle from four Tests. Sri Lanka didn’t take too long to capture the remaining three Irish wickets in the morning, wrapping up the innings in 37 minutes for the addition of 26 runs. That left Ireland trailing by a massive 448 runs in the first innings. Without any hesitation Sri Lanka enforced the follow-on, the first time they had done so since 2015. On that occasion too, the venue was Galle, and the opponents were West Indies who eventually lost the match by an innings and six runs following big hundreds from Dimuth Karunaratne and Dinesh Chandimal and a ten-wicket haul by left-arm spinner Rangana Herath. Angelo Mathews was the captain. The morning session turned out to be another good one for Sri Lanka as they captured eight wickets for 67 runs with Ireland limping to lunch with half their side out for 41 and trailing by a massive 407 runs. But the afternoon saw some Irish grit as they lost only three wickets whilst adding 94 runs in the session largely due to a 60-run partnership off 129 balls for the sixth wicket between Harry Tector and Curtis Campher. Tector, a well-organised cricketer whom Ireland look to their future, put up a resolute performance with Campher (30) to stall the inevitable. In the first innings Tector scored 34 and added 70 for the third wicket with James McCollum. Playing spin and pace quite well and using the depth of the crease, Tector went onto score 42 priceless runs off 95 balls (4 fours) when his innings came to an unfortunate end. Tector had come to terms with the challenges in the middle when he attempted a quick run that was never there and slipped in mid-pitch, and failed to beat the return from Karunaratne from extra cover to wicket-keeper Sadeera Samarawickrama. Following Tector’s dismissal there was not much resistance from the tail as Sri Lanka wrapped up the Ireland second innings for 168, with Ramesh Mendis picking up four wickets to become the joint fastest Sri Lankan bowler to 50 Test wickets (11 Tests) with another off-spinner Dilruwan Perera who also achieved the landmark at Galle against Australia in 2016. Outstanding at forward short-leg was Nishan Madushka, a wicket-keeper/batsman who pulled off some astonishing catches in that position – three in all, just when Ireland was settling into their batting. His performance reminded one of another former Sri Lankan stalwart Hashan Tillakaratne who also started off as a wicket-keeper and excelled in the position of a close-in fielder. The match turned out to be a one-way contest ever since Sri Lanka won the toss and piled up a score in excess of 500. With no proper first-class structure in place Ireland were left to learn the harsh lessons of Test cricket the hard way. Being only their fifth Test match since being elevated to Test ranks in 2017, it has been a whole new learning curve for the Irish. The second Test starts at the same venue on 24 April.","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch","link":"https://www.firstpost.com/firstcricket/sports-news/srh-vs-mi-arjun-tendulkar-dismisses-bhuvneshwar-kumar-to-claim-first-ever-ipl-wicket-watch-12473962.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch","content":"Cricket SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch Arjun, playing for Mumbai Indians, was tasked with the duty to defend 20 runs from the final over, with SRH looking to chase down a target of 193. FirstCricket Staff April 19th, 2023 0:11:44 IST Arjun Tendulkar celebrates the wicket of Bhuvneshwar Kumar. Sportzpics Tuesday night would have been a proud night for Master Blaster Sachin Tendulkar as his son Arjun Tendulkar claimed his first-ever Indian Premier League (IPL) wicket, removing Sunrisers Hyderabad’s Bhuvneshwar Kumar on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Arjun, playing for Mumbai Indians, was tasked with the duty to defend 20 runs from the final over, with SRH looking to chase down a target of 193. Abdul Samad was run-out off the second ball of the 20 th over to leave SRH nine down, and even after that, Arjun did not leave any room for improvement to the SRH tailenders. Arjun finally struck in the fifth ball of the final over, bowling a full length ball to make Bhuvneshwar go down the ground, only to get an outside edge en route to Rohit Sharma at extra cover, who completed the catch. You can watch the video of Arjun’s first wicket here: A special moment for young Arjun Tendulkar, who gets his first wicket in #TATAIPL and it is his captain Rohit Sharma, who takes the catch of Bhuvneshwar Kumar. Arjun takes the final wicket and @mipaltan win by 14 runs. pic.twitter.com/1jAa2kBm0Z — IndianPremierLeague (@IPL) April 18, 2023 MI eventually won by 14 runs, and the win took them to sixth place in the points table, with six points. They next face Punjab Kings on Saturday (22 April). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 00:11:44 IST Tags: Arjun Tendulkar Ipl 2023 Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 18:41:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Arjun-Tendulkar-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Green outshines Ashes rival Brook in IPL duel","link":"https://thewest.com.au/sport/cricket/green-outshines-ashes-rival-brook-in-ipl-duel-c-10386555","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Runs from Cam Green, wickets for Jason Behrendorff and Riley Meredith, and safe catching by Tim David carried Mumbai Indians to an Aussie-accented IPL victory.","content":"Cam Green has won the Indian Premier League showdown between Australia and England's young guns in Hyderabad. Green cracked an unbeaten 64 off 40 balls with six fours and two sixes as Mumbai Indians made 5-192. Harry Brook, who hit a maiden IPL century in his previous outing, looked in similar form as he opened with two sumptuous fours, but he was then surprised by a slower ball bouncer from Jason Behrendorff and dismissed for a seven-ball nine. With Behrendorff (2-37 off four) adding the wicket of Rahul Tripathi, Sunrisers Hyderabad were reduced to 2-25 in the fourth over. They never recovered and were bowled out off the penultimate ball for 178, 15 runs adrift. The final wicket was taken by Arjuna Tendulkar, son of the legendary Sachin, his first wicket in the IPL. The IPL is a huge event in its own right, but 60 days out from the first Test at Edgbaston every Anglo-Australian encounter is seen through an Ashes lens. Green's ability to cope with the stresses of being the most expensive Australian in the IPL, having been signed for $3.15m, augurs well for the pressure he will be under in England. The 23-year-old West Australian, who won a clutch of post-match awards, said: \"The first couple of games were a learning curve for me and the team but we've now won three in a row.\" Of his key role bowling at the death he added: \"It is a work in progress but you get better the more you get exposed to it.\" Green began slowly, assessing the pace of the pitch, then accelerated. He had good support from Ishan Kishan (38) and Tilak Varma (37). In a late cameo Tim David made 16 off 11 balls before being run out of the last delivery. After Behrendorff's early inroads Sunrisers rebuilt through Maynak Agarwal and skipper Aiden Markham (22), but the latter fell to Green's fourth ball as the all-rounder took a role with the ball, finishing with 1-29 off four overs. Indians ultimately fielded a quartet of Australians with Green, Behrendorff and David joined by Riley Meredith, who was introduced as an 'impact substitute'. He had an impact too, dismissing Agarwal (48 off 41) and Marco Jansen (13 off six) as he took 2-33 in his four overs. They were two of a quartet of fine catches taken on the long on boundary by David, which included Heinrich Klassen, who had threatened to transform the match with 36 off 16. David added a run-out to complete a fielding five-for. Meredith had been omitted from the initial XI despite Jofra Archer being unavailable for the fourth successive match. The quick's continued absence is a concern for England as the problem is his troublesome right elbow. Archer has twice had surgery on the elbow joint spending much of the last two years either injured or recuperating. England's medical team have been working closely with their Mumbai counterparts and it is understood Archer is working towards returning against Punjab Kings on April 22 or Gujarat Titans three days later. Archer's setback has dented confidence that he will be play a major role in the Ashes with his county, Sussex, indicating he is unlikely to play first-class cricket for them before the series starts. That would leave Archer going into the Ashes with just a series of four-over T20 spells behind him, that would seem inadequate preparation for five-day Tests. - with PA Sign up for our emails","pubDate":"2023-04-18 18:02:10","image_url":"https://images.thewest.com.au/publication/C-10386555/546724dcb2af0fbbc5d34ce8d44c10f531885c06-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"SRH vs MI Live Score: Big Blow For SRH! Harry Brook Departs For 9 In Chase vs MI - NDTV Sports","link":"https://news.google.com/rss/articles/CBMikAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9zcmgtdnMtbWktbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0yNXRoLW1hdGNoLXN1bnJpc2Vycy1oeWRlcmFiYWQtdnMtbXVtYmFpLWluZGlhbnMtbGl2ZS1zY29yZS11cGRhdGVzLTM5NTg1MjXSAZYBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjMvc3JoLXZzLW1pLWxpdmUtc2NvcmUtaXBsLTIwMjMtdG9kYXktMjV0aC1tYXRjaC1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLW11bWJhaS1pbmRpYW5zLWxpdmUtc2NvcmUtdXBkYXRlcy0zOTU4NTI1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SRH vs MI Live Score: Big Blow For SRH! Harry Brook Departs For 9 In Chase vs MI  NDTV SportsSRH vs MI Dream11 Prediction Today Match 25, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorSRH: 22-1 (3) | SRH vs MI, IPL 2023 Cricket Live Score & Updates: Behrendorff Removes Brook  Zee NewsSachin Lara: Watch Meet of GOATS, Fans dive in Nostalgia as Sachin Tendulkar and Brian Lara share CANDID moment ahead of SRH vs MI Clash - Check Out  InsideSportSRH vs MI: Weather Report Live Today And Pitch Report Of Rajiv Gandhi International Stadium in Hyderabad- IPL 2023, Match 25  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-04-18 16:09:11","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-cameron-green-arjun-tendulkar-shine-on-the-big-stage-as-mi-beat-srh-for-third-win-on-the-trot-12474132.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot","content":"Cricket IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot Having been acquired by MI for a whopping price tag of Rs 17.50, Green certainly came into the IPL with a lot of expectations. FirstCricket Staff April 19th, 2023 2:23:18 IST Arjun Tendulkar celebrates the wicket of Bhuvneshwar Kumar. Sportzpics Australia all-rounder Cameron Green had been a revelation even before he made his Indian Premier League (IPL) debut for Mumbai Indians (MI). And on Tuesday, the platform was well set in Hyderabad for him to shine, and he surely impressed, with most of the damage being done with the bat. Having been acquired by MI for a whopping price tag of Rs 17.50, Green certainly came into the IPL with a lot of expectations. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ And on Tuesday, it was not only about Green finally announcing his arrival on the big stage, but also justifying his price tag, and also giving a glimpse to the fans of what they could expect from the 23-year-old. Ummmmm, Cameron Green is the REAL DEAL! The Ashes is going to be one helluva series! — Kevin Pietersen🦏 (@KP24) April 18, 2023 Green scored an unbeaten 64 while coming into bat at number three, and also finished with figures of 1/29 from four overs. It was certainly a performance to remember for Green, but he is just not getting carried away with the expectations. And there’s no reason to be. “I think first couple of games were a learning curve for me and our team. Bit of a sticky situation (when I walked out to bat). But glad the plans came off. I am a work in progress with my bowling at the death. Obviously, we can continue with the winning momentum,” said a confident Green at the post-match presentation ceremony. Not only Green, but Arjun Tendulkar too steals the limelight Cameron Green was not the only MI star who rose up to the big occasion. Arjun Tendulkar, son of cricketing legend Sachin Tendulkar, finally made a mark in the IPL with his first-ever wicket in the cash-rich league. Arjun had been part of the MI setup in 2021 and 2022, but it is only this year that the 23-year-old is finally getting a chance to shine. A superb all-round performance by Mumbai Indians once again. Cameron Green impressed with both bat & ball. Ishan & Tilak’s batting is as good as it gets! The IPL is getting more interesting every day. Great going boys!💙 And finally a Tendulkar has an IPL wicket!😛 #SRHvMI pic.twitter.com/e4MAFEZyjY — Sachin Tendulkar (@sachin_rt) April 18, 2023 On Tuesday, Arjun was given with the responsibility of bowling the final over of the match, with SRH needing 20 runs off six balls. He began with a low full toss to Abdul Samad, that ended up as a dot ball, and the SRH batter was immediately run out the very next ball, with Hrithik Shokeen perfectly timing in a throw to Ishan Kishan, who whipped off the bails. Mayank Markande was the new batter in, and Markande was off the mark with a brace in the third ball of the over. SRH still needed 16 runs off the last three balls, and while it was certain by the end that MI would have the last laugh, Arjun delivered the final punch to the match in some fashion, to get rid of Bhuvneshwar Kumar and seal the match. Arjun unleashed a fuller ball to Bhuvneshwar, and Bhuvneshwar looked to go straight down the ground, but instead got an outside edge to Rohit Sharma at extra cover, who completed the catch. There’s still a long way to go in Arjun’s cricketing career, but to get off the mark with the ball in the IPL would certainly be a special feeling. “Obviously it was great getting my first IPL wicket. I just had to focus on what was in hand, the plan and executing it. Our plan was just to bowl wide and get the long boundary into play, make the batsman hit it to the longer side. I love bowling, I am happy to bowl anytime the captain asks me to and just stick to the team plan and give my best,” said Arjun after the match. Lack of resistance from SRH batters SRH batters clearly found the going tough on Tuesday against MI, and much of their batting troubles were due to the inability of their batters to get off to good starts. #MumbaiIndians are on a rampage. @timdavid8 with two key catches as Klaasen and Mayank Agarwal depart in quick succession. Live – https://t.co/oWfswiuqls #TATAIPL #SRHvMI #IPL2023 pic.twitter.com/9QSK3QEzcD — IndianPremierLeague (@IPL) April 18, 2023 The likes of Harry Brook (9), Rahul Tripathi (7) and Abhishek Sharma (1) felt the pressure of a big-total chase, and eventually succumbed to it, but an unlikely hero in Mayank Agarwal stepped in for SRH and almost did the job for them. Agarwal looked set for a 50-plus score, and was almost like the central figure for SRH, even forging productive stands with Aiden Markram (22) and later Heinrich Klaasen (36), but lack of support from some of his other partners probably hurt SRH’s momentum going forward. Had the top order fired in full cylinders for SRH, the complexion of the game would have been slightly different, and maybe, that would have helped them get those 20 runs needed from the final over. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 02:23:18 IST Tags: Ipl 2023 Ipl 2023 Mi Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 20:53:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Arjun-Tendulkar-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"‘The real deal’: Cameron Green masterclass steers Mumbai Indians towards third-consecutive victory","link":"https://www.foxsports.com.au/cricket/the-real-deal-cameron-green-masterclass-steers-mumbai-indians-towards-thirdconsecutive-victory/news-story/0b05f02a1bc40c103af6b70ecbbef950","keywords":null,"creator":null,"video_url":null,"description":"Australian all-rounder Cameron Green hit his maiden half-century in the Indian Premier League and took one wicket to lead the Mumbai Indians to a 14-run victory over the Sunrisers Hyderabad on Tuesday evening.","content":"Australian all-rounder Cameron Green hit his maiden half-century in the Indian Premier League and took one wicket to lead the Mumbai Indians to a 14-run victory over the Sunrisers Hyderabad on Tuesday evening. Rohit Sharma’s Mumbai remain the most successful franchise with five trophies in the men’s edition and moved to sixth in the 10-team table after three consecutive wins. Green, bought by Mumbai for AU$3.15 million in the auction, steered the team to 5-192 with an attacking 64 (40) not out following his promotion to number three in Hyderabad. Watch every match of the 2023 IPL LIVE & On-Demand with Kayo. New to Kayo? Start your free trial now > Hyderabad, led by South African Aiden Markram, were bowled out for 178 in 19.5 overs despite a whirlwind 36 (16) by Heinrich Klaasen and Mayank Agarwal’s 48 (41). Needing 20 in the final over, Mumbai handed the ball to Arjun Tendulkar, son of legendary Sachin Tendulkar, and the left-arm quick bowled a perfect over and got his maiden IPL wicket to seal the match. But it was the 1.98m Green, who stood out with key partnerships including a stand of 56 off 28 balls with Tilak Varma, who hit 37 (17). Green struck three successive boundaries to reach his maiden IPL fifty and followed it up with a six and along with fellow Australian Tim David took the total past 190. “The first couple of games were a learning curve for me and the team, but we‘ve now won three in a row,” Green said. South African’s left-arm quick Marco Jansen took two wickets but missed a face off with his twin brother Duan Jansen, who made his IPL debut for Hyderabad in the previous match, but did not make the XI for this game. In Hyderabad’s chase, Arjun started with the new ball for Mumbai to bowl two economical overs in his second IPL outing after his debut on Sunday. But it was Jason Behrendorff’s left-arm pace that got two key wickets including Hyderabad’s England import and previous-match centurion Harry Brook for nine. Wickets kept tumbling and Green worked with the ball as well when his pace bowling got Markram back in the pavilion for 22. Klaasen and Agarwal attempted to raise the hopes in their stand of 55 but their departure triggered the final slide for Hyderabad. Behrendorff and impact player Riley Meredith claimed two wickets each while David took four catches. Mumbai Indians all-rounder Cameron Green. Photo by Noah SEELAM / AFP Source: AFP","pubDate":"2023-04-18 20:49:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH","link":"https://www.firstpost.com/photos/ipl-2023-cameron-green-puts-on-a-clinical-display-as-mi-get-the-better-of-srh-12474092.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH","content":"Photos IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH Check out photos from the IPL 2023 match between Sunrisers Hyderabad and Mumbai Indians. FirstCricket Staff April 19, 2023 01:08:58 IST 1 /6 Mumbai Indians defeated Sunrisers Hyderabad by 14 runs to jump to sixth spot in the IPL 2023 points table on Tuesday. Sportzpics 2 /6 SRH won the toss and opted to field. Cameron Green, though, starrred for MI, scoring an unbeaten 64 to take MI to 192. Sportzpics 3 /6 Marco Jansen struck twice in the 12th over of the innings, removing Ishan Kishan and Suryakumar Yadav. Sportzpics 4 /6 Rohit Sharma became just the fourth cricketer to score 6000 runs in the IPL. Sportzpics 5 /6 Tim David was sharp on the field, taking as many as four catches. Sportzpics 6 /6 Mayank Agarwal scored 48 but his knock went in vain in the end, with SRH falling short by 14 runs. Sportzpics","pubDate":"2023-04-18 19:38:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Rohit-Sharma-MI-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-sunrisers-hyderabad-were-not-at-our-best-against-mumbai-indians-admits-aiden-markram-12474062.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram","content":"Cricket IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram Sunrisers Hyderabad kept losing wickets at regular intervals as they failed to chase down a target of 193 against Mumbai Indians. The Hyderabad-based franchise were eventually restricted to 178. FirstCricket Staff April 19th, 2023 0:55:32 IST SRH skipper Aiden Markram admitted that they were not at their best against MI. Sportzpics Sunrisers Hyderabad (SRH) skipper Aiden Markram admitted that his side were ‘not at the best’ against Mumbai Indians (MI) in their Indian Premier League (IPL) contest in Hyderabad on Tuesday. Sunrisers Hyderabad kept losing wickets at regular intervals as they failed to chase down a target of 193 against Mumbai Indians. The Hyderabad-based franchise were eventually restricted to 178, courtesy a clinical performance from MI’s bowlers. Most of their batters failed to get going. Mayank Agarwal (48) and Heinrich Klaasen (38) looked good, but were dismissed at crucial junctures, while Markram failed to convert a start into a big knock. “All in all we were not at our best tonight. Credit to the boys for taking it deep. We could have done with conceding fewer runs towards the end. It (the surface) stayed pretty much the same throughout the night, on the slower side, not bad at all. Whenever we took pace off the ball did not come on to the bat,” said Markram at the post-match presentation ceremony. “We made a call (to bowl first) before the toss and if the dew came in then we were in the game. There was a desperation to make things right from the previous season. Not too bummed, there are areas we can improve on and we will look to do that to give us a good chance to win the next game,” he added. Rohit Sharma, who has previously played for the now defunct-Deccan Chargers, briefly recalled his early days in the IPL. “I have got lot of memories here (in Hyderabad). I played three years here. Won a trophy as well. Love coming back here. To settle them (youngsters) in is important for us. We had a couple of guys who hadn’t played IPL before. We had to back them. They are coming into their own. I am enjoying what I am doing (with the bat),” said Rohit. “It is a different role. I am trying to set the tempo. Glad to get some scores in the powerplay. I understand one of us has to bat big. We have a long batting line-up. We want these guys to come out and bat freely. We watched Tilak last season. We all know what he can. I love his approach. He doesn’t play the bowler, he plays the ball. We will see him play for a lot of teams,” he added. Rohit termed Arjun Tendulkar, who claimed his first wicket on Tuesday, as a confident bowler. “Arjun has been a part of this team for three years. He understands what he wants to do. He is quite confident as well. He is clear in his plans. He is trying to swing the new ball and bowl yorkers at the death,” added Rohit. Cameron Green, the Player of the Match, was glad that the plans worked despite a ‘sticky’ situation. Green scored an unbeaten 64 and took a wicket during SRH’s reply. “I think first couple of games were a learning curve for me and our team. Bit of a sticky situation (when I walked out to bat). But glad the plans came off. I am a work in progress with my bowling at the death. Obviously, we can continue with the winning momentum,” said Green. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 00:55:32 IST Tags: Aiden Markram Ipl 2023 Ipl 2023 Mi Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 19:25:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/ALI14_6422-1.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Kohli fined after high-octane IPL clash","link":"https://www.ft.lk/sports/Kohli-fined-after-high-octane-IPL-clash/23-747452","keywords":null,"creator":null,"video_url":null,"description":null,"content":"NEW DELHI, AFP: Indian cricket star Virat Kohli was fined Tuesday for breaching the IPL code of conduct, after his side Royal Challengers Bangalore went down to Chennai in a nail-biting match. Kohli’s wild celebration of Chennai batsman Shivam Dube’s wicket at a crucial point of the high-scoring game on Monday resulted in the sanction, according to media reports. The fiery 34-year-old was fined 10% of his match fee after admitting to the offence, organisers said, without detailing what rule the batsman broke. The tense match in front of a raucous capacity Bengaluru crowd witnessed a record-equalling 33 sixes and was finally won by Chennai Super Kings, led by M.S. Dhoni, by eight runs. One of the best batsmen of the modern game, “King Kohli” has often run into trouble with his aggressive approach and no-holds-barred emotions on the cricket pitch. He has had numerous run-ins with opposing players and was once reprimanded after hitting a plastic chair with a bat following his dismissal during an IPL match. He escaped a fine. According to media reports this week, Kohli has fallen out with India’s former cricket Chief Sourav Ganguly with the two men reportedly “unfollowing” each other on Instagram. Kohli quit as Indian T20 skipper in late 2021 and in January 2022 was sacked from the one-day captaincy and gave up leading the Test side too after a reported fall-out with Ganguly.","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ireland made it easy for us by setting white ball fields: Dimuth","link":"https://www.ft.lk/sports/Ireland-made-it-easy-for-us-by-setting-white-ball-fields--Dimuth/23-747451","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Test captain Dimuth Karunaratne said that Test newcomers Ireland’s inexperience in the longer format helped his side greatly to win the first Test which ended on day three at Galle yesterday. Sri Lanka won quite convincingly by an innings after racking up a mammoth total of 591-6 declared with four batsmen including Karunaratne contributing centuries. “For a Test player the real test is to be able to adapt to any conditions against any bowling attack. New Zealand was a quality bowling team but the Ireland bowling line-up we cannot underestimate. They bowled well in patches,” said Karunaratne at the post-match press conference. “The drawback was because Ireland has not played long in this format, their field settings and their bowling lines and lengths were not up to the mark. They have been playing so much white ball cricket and they used similar fields for the Test match also. That made it a little easy for us because there were a lot of single options available to us. But as they continue to play, they will correct these shortcomings in Test cricket. It is also a challenge for their players to come here and learn how to play in these conditions against our bowling unit.” Ireland captain Andy Balbirnie put his team’s defeat down to tough conditions and the absence of playing red ball cricket. “Sri Lanka has played a lot of Test cricket in these conditions. We fought in stages of the game but not long enough. We knew it was challenging and what it is like to play Test cricket in the last three days. It’s tough because we know we want to perform well in these games but it is very tricky. We must learn very quickly and learn on our feet and hopefully produce that form in the next game.” “You can’t be critical of the players. They are really trying their hardest to be competitive at this level. But it is difficult when you come up against a team who in their home conditions are as good as anyone.” “It’s tough cricket. After the first day there were a lot of sore bodies. I’ve been through that too often but it’s all about bouncing back. We are not putting expectations on the players, we just want them to express themselves and enjoy this challenge. It is tough and it is only going to get tougher,” Balbirnie said. – [ST]","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jayasuriya bowls Sri Lanka to their largest Test victory","link":"https://www.ft.lk/sports/Jayasuriya-bowls-Sri-Lanka-to-their-largest-Test-victory/23-747455","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Minnows Ireland suffered their first defeat by an innings in Test cricket when Sri Lanka beat them by an overwhelming margin of an innings and 280 runs with two days to spare in the first Test played at the Galle International Cricket Stadium yesterday, to go one-up in the two-Test series. The margin of victory was Sri Lanka’s largest in Test cricket, improving on the innings and 254-run win over Zimbabwe at Bulawayo in 2004. The match in fact ended in the final session of the third day with Ireland being bowled out for 143 and 168 in reply to Sri Lanka’s mammoth first innings total of 591-6 declared. The left-arm spin of Prabath Jayasuriya proved too much for the Irish batsmen to counter as they succumbed to him on ten occasions in both innings giving the bowler match figures of 10 for 108 to give him the Player of the Match award. Jayasuriya spun a web around the hapless Irish batsmen who had no answer to his wily spin finishing with career best innings figures of 7 for 52 in the first innings and following it up with 3 for 56 in the second. Apart from Jayasuriya, it was another left-arm bowler who caused misery to the Ireland batting. Seamer Vishwa Fernando achieved the initial breakthrough for Sri Lanka scalping Murray Commins and Captain Andrew Balbirnie in both innings to put Ireland on the back foot. After that it was a case of pure survival against the wiles of Jayasuriya and the off-breaks of Ramesh Mendis who was forced to play second fiddle as Jayasuriya took the centre stage with his prolific wicket-taking ability at Galle. Of the 43 wickets he has taken so far in his short Test career of six matches, 39 has come at Galle from four Tests. Sri Lanka didn’t take too long to capture the remaining three Irish wickets in the morning, wrapping up the innings in 37 minutes for the addition of 26 runs. That left Ireland trailing by a massive 448 runs in the first innings. Without any hesitation Sri Lanka enforced the follow-on, the first time they had done so since 2015. On that occasion too, the venue was Galle, and the opponents were West Indies who eventually lost the match by an innings and six runs following big hundreds from Dimuth Karunaratne and Dinesh Chandimal and a ten-wicket haul by left-arm spinner Rangana Herath. Angelo Mathews was the captain. The morning session turned out to be another good one for Sri Lanka as they captured eight wickets for 67 runs with Ireland limping to lunch with half their side out for 41 and trailing by a massive 407 runs. But the afternoon saw some Irish grit as they lost only three wickets whilst adding 94 runs in the session largely due to a 60-run partnership off 129 balls for the sixth wicket between Harry Tector and Curtis Campher. Tector, a well-organised cricketer whom Ireland look to their future, put up a resolute performance with Campher (30) to stall the inevitable. In the first innings Tector scored 34 and added 70 for the third wicket with James McCollum. Playing spin and pace quite well and using the depth of the crease, Tector went onto score 42 priceless runs off 95 balls (4 fours) when his innings came to an unfortunate end. Tector had come to terms with the challenges in the middle when he attempted a quick run that was never there and slipped in mid-pitch, and failed to beat the return from Karunaratne from extra cover to wicket-keeper Sadeera Samarawickrama. Following Tector’s dismissal there was not much resistance from the tail as Sri Lanka wrapped up the Ireland second innings for 168, with Ramesh Mendis picking up four wickets to become the joint fastest Sri Lankan bowler to 50 Test wickets (11 Tests) with another off-spinner Dilruwan Perera who also achieved the landmark at Galle against Australia in 2016. Outstanding at forward short-leg was Nishan Madushka, a wicket-keeper/batsman who pulled off some astonishing catches in that position – three in all, just when Ireland was settling into their batting. His performance reminded one of another former Sri Lankan stalwart Hashan Tillakaratne who also started off as a wicket-keeper and excelled in the position of a close-in fielder. The match turned out to be a one-way contest ever since Sri Lanka won the toss and piled up a score in excess of 500. With no proper first-class structure in place Ireland were left to learn the harsh lessons of Test cricket the hard way. Being only their fifth Test match since being elevated to Test ranks in 2017, it has been a whole new learning curve for the Irish. The second Test starts at the same venue on 24 April.","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch","link":"https://www.firstpost.com/firstcricket/sports-news/srh-vs-mi-arjun-tendulkar-dismisses-bhuvneshwar-kumar-to-claim-first-ever-ipl-wicket-watch-12473962.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch","content":"Cricket SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch Arjun, playing for Mumbai Indians, was tasked with the duty to defend 20 runs from the final over, with SRH looking to chase down a target of 193. FirstCricket Staff April 19th, 2023 0:11:44 IST Arjun Tendulkar celebrates the wicket of Bhuvneshwar Kumar. Sportzpics Tuesday night would have been a proud night for Master Blaster Sachin Tendulkar as his son Arjun Tendulkar claimed his first-ever Indian Premier League (IPL) wicket, removing Sunrisers Hyderabad’s Bhuvneshwar Kumar on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Arjun, playing for Mumbai Indians, was tasked with the duty to defend 20 runs from the final over, with SRH looking to chase down a target of 193. Abdul Samad was run-out off the second ball of the 20 th over to leave SRH nine down, and even after that, Arjun did not leave any room for improvement to the SRH tailenders. Arjun finally struck in the fifth ball of the final over, bowling a full length ball to make Bhuvneshwar go down the ground, only to get an outside edge en route to Rohit Sharma at extra cover, who completed the catch. You can watch the video of Arjun’s first wicket here: A special moment for young Arjun Tendulkar, who gets his first wicket in #TATAIPL and it is his captain Rohit Sharma, who takes the catch of Bhuvneshwar Kumar. Arjun takes the final wicket and @mipaltan win by 14 runs. pic.twitter.com/1jAa2kBm0Z — IndianPremierLeague (@IPL) April 18, 2023 MI eventually won by 14 runs, and the win took them to sixth place in the points table, with six points. They next face Punjab Kings on Saturday (22 April). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 00:11:44 IST Tags: Arjun Tendulkar Ipl 2023 Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 18:41:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Arjun-Tendulkar-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Green outshines Ashes rival Brook in IPL duel","link":"https://thewest.com.au/sport/cricket/green-outshines-ashes-rival-brook-in-ipl-duel-c-10386555","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Runs from Cam Green, wickets for Jason Behrendorff and Riley Meredith, and safe catching by Tim David carried Mumbai Indians to an Aussie-accented IPL victory.","content":"Cam Green has won the Indian Premier League showdown between Australia and England's young guns in Hyderabad. Green cracked an unbeaten 64 off 40 balls with six fours and two sixes as Mumbai Indians made 5-192. Harry Brook, who hit a maiden IPL century in his previous outing, looked in similar form as he opened with two sumptuous fours, but he was then surprised by a slower ball bouncer from Jason Behrendorff and dismissed for a seven-ball nine. With Behrendorff (2-37 off four) adding the wicket of Rahul Tripathi, Sunrisers Hyderabad were reduced to 2-25 in the fourth over. They never recovered and were bowled out off the penultimate ball for 178, 15 runs adrift. The final wicket was taken by Arjuna Tendulkar, son of the legendary Sachin, his first wicket in the IPL. The IPL is a huge event in its own right, but 60 days out from the first Test at Edgbaston every Anglo-Australian encounter is seen through an Ashes lens. Green's ability to cope with the stresses of being the most expensive Australian in the IPL, having been signed for $3.15m, augurs well for the pressure he will be under in England. The 23-year-old West Australian, who won a clutch of post-match awards, said: \"The first couple of games were a learning curve for me and the team but we've now won three in a row.\" Of his key role bowling at the death he added: \"It is a work in progress but you get better the more you get exposed to it.\" Green began slowly, assessing the pace of the pitch, then accelerated. He had good support from Ishan Kishan (38) and Tilak Varma (37). In a late cameo Tim David made 16 off 11 balls before being run out of the last delivery. After Behrendorff's early inroads Sunrisers rebuilt through Maynak Agarwal and skipper Aiden Markham (22), but the latter fell to Green's fourth ball as the all-rounder took a role with the ball, finishing with 1-29 off four overs. Indians ultimately fielded a quartet of Australians with Green, Behrendorff and David joined by Riley Meredith, who was introduced as an 'impact substitute'. He had an impact too, dismissing Agarwal (48 off 41) and Marco Jansen (13 off six) as he took 2-33 in his four overs. They were two of a quartet of fine catches taken on the long on boundary by David, which included Heinrich Klassen, who had threatened to transform the match with 36 off 16. David added a run-out to complete a fielding five-for. Meredith had been omitted from the initial XI despite Jofra Archer being unavailable for the fourth successive match. The quick's continued absence is a concern for England as the problem is his troublesome right elbow. Archer has twice had surgery on the elbow joint spending much of the last two years either injured or recuperating. England's medical team have been working closely with their Mumbai counterparts and it is understood Archer is working towards returning against Punjab Kings on April 22 or Gujarat Titans three days later. Archer's setback has dented confidence that he will be play a major role in the Ashes with his county, Sussex, indicating he is unlikely to play first-class cricket for them before the series starts. That would leave Archer going into the Ashes with just a series of four-over T20 spells behind him, that would seem inadequate preparation for five-day Tests. - with PA Sign up for our emails","pubDate":"2023-04-18 18:02:10","image_url":"https://images.thewest.com.au/publication/C-10386555/546724dcb2af0fbbc5d34ce8d44c10f531885c06-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"SRH vs MI Live Score: Big Blow For SRH! Harry Brook Departs For 9 In Chase vs MI - NDTV Sports","link":"https://news.google.com/rss/articles/CBMikAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9zcmgtdnMtbWktbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0yNXRoLW1hdGNoLXN1bnJpc2Vycy1oeWRlcmFiYWQtdnMtbXVtYmFpLWluZGlhbnMtbGl2ZS1zY29yZS11cGRhdGVzLTM5NTg1MjXSAZYBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjMvc3JoLXZzLW1pLWxpdmUtc2NvcmUtaXBsLTIwMjMtdG9kYXktMjV0aC1tYXRjaC1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLW11bWJhaS1pbmRpYW5zLWxpdmUtc2NvcmUtdXBkYXRlcy0zOTU4NTI1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SRH vs MI Live Score: Big Blow For SRH! Harry Brook Departs For 9 In Chase vs MI  NDTV SportsSRH vs MI Dream11 Prediction Today Match 25, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorSRH: 22-1 (3) | SRH vs MI, IPL 2023 Cricket Live Score & Updates: Behrendorff Removes Brook  Zee NewsSachin Lara: Watch Meet of GOATS, Fans dive in Nostalgia as Sachin Tendulkar and Brian Lara share CANDID moment ahead of SRH vs MI Clash - Check Out  InsideSportSRH vs MI: Weather Report Live Today And Pitch Report Of Rajiv Gandhi International Stadium in Hyderabad- IPL 2023, Match 25  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-04-18 16:09:11","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-cameron-green-arjun-tendulkar-shine-on-the-big-stage-as-mi-beat-srh-for-third-win-on-the-trot-12474132.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot","content":"Cricket IPL 2023: Cameron Green, Arjun Tendulkar shine on the big stage as MI beat SRH for third win on the trot Having been acquired by MI for a whopping price tag of Rs 17.50, Green certainly came into the IPL with a lot of expectations. FirstCricket Staff April 19th, 2023 2:23:18 IST Arjun Tendulkar celebrates the wicket of Bhuvneshwar Kumar. Sportzpics Australia all-rounder Cameron Green had been a revelation even before he made his Indian Premier League (IPL) debut for Mumbai Indians (MI). And on Tuesday, the platform was well set in Hyderabad for him to shine, and he surely impressed, with most of the damage being done with the bat. Having been acquired by MI for a whopping price tag of Rs 17.50, Green certainly came into the IPL with a lot of expectations. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ And on Tuesday, it was not only about Green finally announcing his arrival on the big stage, but also justifying his price tag, and also giving a glimpse to the fans of what they could expect from the 23-year-old. Ummmmm, Cameron Green is the REAL DEAL! The Ashes is going to be one helluva series! — Kevin Pietersen🦏 (@KP24) April 18, 2023 Green scored an unbeaten 64 while coming into bat at number three, and also finished with figures of 1/29 from four overs. It was certainly a performance to remember for Green, but he is just not getting carried away with the expectations. And there’s no reason to be. “I think first couple of games were a learning curve for me and our team. Bit of a sticky situation (when I walked out to bat). But glad the plans came off. I am a work in progress with my bowling at the death. Obviously, we can continue with the winning momentum,” said a confident Green at the post-match presentation ceremony. Not only Green, but Arjun Tendulkar too steals the limelight Cameron Green was not the only MI star who rose up to the big occasion. Arjun Tendulkar, son of cricketing legend Sachin Tendulkar, finally made a mark in the IPL with his first-ever wicket in the cash-rich league. Arjun had been part of the MI setup in 2021 and 2022, but it is only this year that the 23-year-old is finally getting a chance to shine. A superb all-round performance by Mumbai Indians once again. Cameron Green impressed with both bat & ball. Ishan & Tilak’s batting is as good as it gets! The IPL is getting more interesting every day. Great going boys!💙 And finally a Tendulkar has an IPL wicket!😛 #SRHvMI pic.twitter.com/e4MAFEZyjY — Sachin Tendulkar (@sachin_rt) April 18, 2023 On Tuesday, Arjun was given with the responsibility of bowling the final over of the match, with SRH needing 20 runs off six balls. He began with a low full toss to Abdul Samad, that ended up as a dot ball, and the SRH batter was immediately run out the very next ball, with Hrithik Shokeen perfectly timing in a throw to Ishan Kishan, who whipped off the bails. Mayank Markande was the new batter in, and Markande was off the mark with a brace in the third ball of the over. SRH still needed 16 runs off the last three balls, and while it was certain by the end that MI would have the last laugh, Arjun delivered the final punch to the match in some fashion, to get rid of Bhuvneshwar Kumar and seal the match. Arjun unleashed a fuller ball to Bhuvneshwar, and Bhuvneshwar looked to go straight down the ground, but instead got an outside edge to Rohit Sharma at extra cover, who completed the catch. There’s still a long way to go in Arjun’s cricketing career, but to get off the mark with the ball in the IPL would certainly be a special feeling. “Obviously it was great getting my first IPL wicket. I just had to focus on what was in hand, the plan and executing it. Our plan was just to bowl wide and get the long boundary into play, make the batsman hit it to the longer side. I love bowling, I am happy to bowl anytime the captain asks me to and just stick to the team plan and give my best,” said Arjun after the match. Lack of resistance from SRH batters SRH batters clearly found the going tough on Tuesday against MI, and much of their batting troubles were due to the inability of their batters to get off to good starts. #MumbaiIndians are on a rampage. @timdavid8 with two key catches as Klaasen and Mayank Agarwal depart in quick succession. Live – https://t.co/oWfswiuqls #TATAIPL #SRHvMI #IPL2023 pic.twitter.com/9QSK3QEzcD — IndianPremierLeague (@IPL) April 18, 2023 The likes of Harry Brook (9), Rahul Tripathi (7) and Abhishek Sharma (1) felt the pressure of a big-total chase, and eventually succumbed to it, but an unlikely hero in Mayank Agarwal stepped in for SRH and almost did the job for them. Agarwal looked set for a 50-plus score, and was almost like the central figure for SRH, even forging productive stands with Aiden Markram (22) and later Heinrich Klaasen (36), but lack of support from some of his other partners probably hurt SRH’s momentum going forward. Had the top order fired in full cylinders for SRH, the complexion of the game would have been slightly different, and maybe, that would have helped them get those 20 runs needed from the final over. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 02:23:18 IST Tags: Ipl 2023 Ipl 2023 Mi Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 20:53:18","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Arjun-Tendulkar-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"‘The real deal’: Cameron Green masterclass steers Mumbai Indians towards third-consecutive victory","link":"https://www.foxsports.com.au/cricket/the-real-deal-cameron-green-masterclass-steers-mumbai-indians-towards-thirdconsecutive-victory/news-story/0b05f02a1bc40c103af6b70ecbbef950","keywords":null,"creator":null,"video_url":null,"description":"Australian all-rounder Cameron Green hit his maiden half-century in the Indian Premier League and took one wicket to lead the Mumbai Indians to a 14-run victory over the Sunrisers Hyderabad on Tuesday evening.","content":"Australian all-rounder Cameron Green hit his maiden half-century in the Indian Premier League and took one wicket to lead the Mumbai Indians to a 14-run victory over the Sunrisers Hyderabad on Tuesday evening. Rohit Sharma’s Mumbai remain the most successful franchise with five trophies in the men’s edition and moved to sixth in the 10-team table after three consecutive wins. Green, bought by Mumbai for AU$3.15 million in the auction, steered the team to 5-192 with an attacking 64 (40) not out following his promotion to number three in Hyderabad. Watch every match of the 2023 IPL LIVE & On-Demand with Kayo. New to Kayo? Start your free trial now > Hyderabad, led by South African Aiden Markram, were bowled out for 178 in 19.5 overs despite a whirlwind 36 (16) by Heinrich Klaasen and Mayank Agarwal’s 48 (41). Needing 20 in the final over, Mumbai handed the ball to Arjun Tendulkar, son of legendary Sachin Tendulkar, and the left-arm quick bowled a perfect over and got his maiden IPL wicket to seal the match. But it was the 1.98m Green, who stood out with key partnerships including a stand of 56 off 28 balls with Tilak Varma, who hit 37 (17). Green struck three successive boundaries to reach his maiden IPL fifty and followed it up with a six and along with fellow Australian Tim David took the total past 190. “The first couple of games were a learning curve for me and the team, but we‘ve now won three in a row,” Green said. South African’s left-arm quick Marco Jansen took two wickets but missed a face off with his twin brother Duan Jansen, who made his IPL debut for Hyderabad in the previous match, but did not make the XI for this game. In Hyderabad’s chase, Arjun started with the new ball for Mumbai to bowl two economical overs in his second IPL outing after his debut on Sunday. But it was Jason Behrendorff’s left-arm pace that got two key wickets including Hyderabad’s England import and previous-match centurion Harry Brook for nine. Wickets kept tumbling and Green worked with the ball as well when his pace bowling got Markram back in the pavilion for 22. Klaasen and Agarwal attempted to raise the hopes in their stand of 55 but their departure triggered the final slide for Hyderabad. Behrendorff and impact player Riley Meredith claimed two wickets each while David took four catches. Mumbai Indians all-rounder Cameron Green. Photo by Noah SEELAM / AFP Source: AFP","pubDate":"2023-04-18 20:49:00","image_url":null,"source_id":"foxsports","category":["sports"],"country":["australia"],"language":"english"},{"title":"IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH","link":"https://www.firstpost.com/photos/ipl-2023-cameron-green-puts-on-a-clinical-display-as-mi-get-the-better-of-srh-12474092.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH","content":"Photos IPL 2023: Cameron Green puts on a clinical display as MI get the better of SRH Check out photos from the IPL 2023 match between Sunrisers Hyderabad and Mumbai Indians. FirstCricket Staff April 19, 2023 01:08:58 IST 1 /6 Mumbai Indians defeated Sunrisers Hyderabad by 14 runs to jump to sixth spot in the IPL 2023 points table on Tuesday. Sportzpics 2 /6 SRH won the toss and opted to field. Cameron Green, though, starrred for MI, scoring an unbeaten 64 to take MI to 192. Sportzpics 3 /6 Marco Jansen struck twice in the 12th over of the innings, removing Ishan Kishan and Suryakumar Yadav. Sportzpics 4 /6 Rohit Sharma became just the fourth cricketer to score 6000 runs in the IPL. Sportzpics 5 /6 Tim David was sharp on the field, taking as many as four catches. Sportzpics 6 /6 Mayank Agarwal scored 48 but his knock went in vain in the end, with SRH falling short by 14 runs. Sportzpics","pubDate":"2023-04-18 19:38:58","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Rohit-Sharma-MI-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram","link":"https://www.firstpost.com/firstcricket/sports-news/ipl-2023-sunrisers-hyderabad-were-not-at-our-best-against-mumbai-indians-admits-aiden-markram-12474062.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram","content":"Cricket IPL 2023: Sunrisers Hyderabad were not 'at our best' against Mumbai Indians, admits Aiden Markram Sunrisers Hyderabad kept losing wickets at regular intervals as they failed to chase down a target of 193 against Mumbai Indians. The Hyderabad-based franchise were eventually restricted to 178. FirstCricket Staff April 19th, 2023 0:55:32 IST SRH skipper Aiden Markram admitted that they were not at their best against MI. Sportzpics Sunrisers Hyderabad (SRH) skipper Aiden Markram admitted that his side were ‘not at the best’ against Mumbai Indians (MI) in their Indian Premier League (IPL) contest in Hyderabad on Tuesday. Sunrisers Hyderabad kept losing wickets at regular intervals as they failed to chase down a target of 193 against Mumbai Indians. The Hyderabad-based franchise were eventually restricted to 178, courtesy a clinical performance from MI’s bowlers. Most of their batters failed to get going. Mayank Agarwal (48) and Heinrich Klaasen (38) looked good, but were dismissed at crucial junctures, while Markram failed to convert a start into a big knock. “All in all we were not at our best tonight. Credit to the boys for taking it deep. We could have done with conceding fewer runs towards the end. It (the surface) stayed pretty much the same throughout the night, on the slower side, not bad at all. Whenever we took pace off the ball did not come on to the bat,” said Markram at the post-match presentation ceremony. “We made a call (to bowl first) before the toss and if the dew came in then we were in the game. There was a desperation to make things right from the previous season. Not too bummed, there are areas we can improve on and we will look to do that to give us a good chance to win the next game,” he added. Rohit Sharma, who has previously played for the now defunct-Deccan Chargers, briefly recalled his early days in the IPL. “I have got lot of memories here (in Hyderabad). I played three years here. Won a trophy as well. Love coming back here. To settle them (youngsters) in is important for us. We had a couple of guys who hadn’t played IPL before. We had to back them. They are coming into their own. I am enjoying what I am doing (with the bat),” said Rohit. “It is a different role. I am trying to set the tempo. Glad to get some scores in the powerplay. I understand one of us has to bat big. We have a long batting line-up. We want these guys to come out and bat freely. We watched Tilak last season. We all know what he can. I love his approach. He doesn’t play the bowler, he plays the ball. We will see him play for a lot of teams,” he added. Rohit termed Arjun Tendulkar, who claimed his first wicket on Tuesday, as a confident bowler. “Arjun has been a part of this team for three years. He understands what he wants to do. He is quite confident as well. He is clear in his plans. He is trying to swing the new ball and bowl yorkers at the death,” added Rohit. Cameron Green, the Player of the Match, was glad that the plans worked despite a ‘sticky’ situation. Green scored an unbeaten 64 and took a wicket during SRH’s reply. “I think first couple of games were a learning curve for me and our team. Bit of a sticky situation (when I walked out to bat). But glad the plans came off. I am a work in progress with my bowling at the death. Obviously, we can continue with the winning momentum,” said Green. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 00:55:32 IST Tags: Aiden Markram Ipl 2023 Ipl 2023 Mi Ipl 2023 Srh Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 19:25:32","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/ALI14_6422-1.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Kohli fined after high-octane IPL clash","link":"https://www.ft.lk/sports/Kohli-fined-after-high-octane-IPL-clash/23-747452","keywords":null,"creator":null,"video_url":null,"description":null,"content":"NEW DELHI, AFP: Indian cricket star Virat Kohli was fined Tuesday for breaching the IPL code of conduct, after his side Royal Challengers Bangalore went down to Chennai in a nail-biting match. Kohli’s wild celebration of Chennai batsman Shivam Dube’s wicket at a crucial point of the high-scoring game on Monday resulted in the sanction, according to media reports. The fiery 34-year-old was fined 10% of his match fee after admitting to the offence, organisers said, without detailing what rule the batsman broke. The tense match in front of a raucous capacity Bengaluru crowd witnessed a record-equalling 33 sixes and was finally won by Chennai Super Kings, led by M.S. Dhoni, by eight runs. One of the best batsmen of the modern game, “King Kohli” has often run into trouble with his aggressive approach and no-holds-barred emotions on the cricket pitch. He has had numerous run-ins with opposing players and was once reprimanded after hitting a plastic chair with a bat following his dismissal during an IPL match. He escaped a fine. According to media reports this week, Kohli has fallen out with India’s former cricket Chief Sourav Ganguly with the two men reportedly “unfollowing” each other on Instagram. Kohli quit as Indian T20 skipper in late 2021 and in January 2022 was sacked from the one-day captaincy and gave up leading the Test side too after a reported fall-out with Ganguly.","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Ireland made it easy for us by setting white ball fields: Dimuth","link":"https://www.ft.lk/sports/Ireland-made-it-easy-for-us-by-setting-white-ball-fields--Dimuth/23-747451","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Sri Lanka Test captain Dimuth Karunaratne said that Test newcomers Ireland’s inexperience in the longer format helped his side greatly to win the first Test which ended on day three at Galle yesterday. Sri Lanka won quite convincingly by an innings after racking up a mammoth total of 591-6 declared with four batsmen including Karunaratne contributing centuries. “For a Test player the real test is to be able to adapt to any conditions against any bowling attack. New Zealand was a quality bowling team but the Ireland bowling line-up we cannot underestimate. They bowled well in patches,” said Karunaratne at the post-match press conference. “The drawback was because Ireland has not played long in this format, their field settings and their bowling lines and lengths were not up to the mark. They have been playing so much white ball cricket and they used similar fields for the Test match also. That made it a little easy for us because there were a lot of single options available to us. But as they continue to play, they will correct these shortcomings in Test cricket. It is also a challenge for their players to come here and learn how to play in these conditions against our bowling unit.” Ireland captain Andy Balbirnie put his team’s defeat down to tough conditions and the absence of playing red ball cricket. “Sri Lanka has played a lot of Test cricket in these conditions. We fought in stages of the game but not long enough. We knew it was challenging and what it is like to play Test cricket in the last three days. It’s tough because we know we want to perform well in these games but it is very tricky. We must learn very quickly and learn on our feet and hopefully produce that form in the next game.” “You can’t be critical of the players. They are really trying their hardest to be competitive at this level. But it is difficult when you come up against a team who in their home conditions are as good as anyone.” “It’s tough cricket. After the first day there were a lot of sore bodies. I’ve been through that too often but it’s all about bouncing back. We are not putting expectations on the players, we just want them to express themselves and enjoy this challenge. It is tough and it is only going to get tougher,” Balbirnie said. – [ST]","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"Jayasuriya bowls Sri Lanka to their largest Test victory","link":"https://www.ft.lk/sports/Jayasuriya-bowls-Sri-Lanka-to-their-largest-Test-victory/23-747455","keywords":null,"creator":null,"video_url":null,"description":null,"content":"Minnows Ireland suffered their first defeat by an innings in Test cricket when Sri Lanka beat them by an overwhelming margin of an innings and 280 runs with two days to spare in the first Test played at the Galle International Cricket Stadium yesterday, to go one-up in the two-Test series. The margin of victory was Sri Lanka’s largest in Test cricket, improving on the innings and 254-run win over Zimbabwe at Bulawayo in 2004. The match in fact ended in the final session of the third day with Ireland being bowled out for 143 and 168 in reply to Sri Lanka’s mammoth first innings total of 591-6 declared. The left-arm spin of Prabath Jayasuriya proved too much for the Irish batsmen to counter as they succumbed to him on ten occasions in both innings giving the bowler match figures of 10 for 108 to give him the Player of the Match award. Jayasuriya spun a web around the hapless Irish batsmen who had no answer to his wily spin finishing with career best innings figures of 7 for 52 in the first innings and following it up with 3 for 56 in the second. Apart from Jayasuriya, it was another left-arm bowler who caused misery to the Ireland batting. Seamer Vishwa Fernando achieved the initial breakthrough for Sri Lanka scalping Murray Commins and Captain Andrew Balbirnie in both innings to put Ireland on the back foot. After that it was a case of pure survival against the wiles of Jayasuriya and the off-breaks of Ramesh Mendis who was forced to play second fiddle as Jayasuriya took the centre stage with his prolific wicket-taking ability at Galle. Of the 43 wickets he has taken so far in his short Test career of six matches, 39 has come at Galle from four Tests. Sri Lanka didn’t take too long to capture the remaining three Irish wickets in the morning, wrapping up the innings in 37 minutes for the addition of 26 runs. That left Ireland trailing by a massive 448 runs in the first innings. Without any hesitation Sri Lanka enforced the follow-on, the first time they had done so since 2015. On that occasion too, the venue was Galle, and the opponents were West Indies who eventually lost the match by an innings and six runs following big hundreds from Dimuth Karunaratne and Dinesh Chandimal and a ten-wicket haul by left-arm spinner Rangana Herath. Angelo Mathews was the captain. The morning session turned out to be another good one for Sri Lanka as they captured eight wickets for 67 runs with Ireland limping to lunch with half their side out for 41 and trailing by a massive 407 runs. But the afternoon saw some Irish grit as they lost only three wickets whilst adding 94 runs in the session largely due to a 60-run partnership off 129 balls for the sixth wicket between Harry Tector and Curtis Campher. Tector, a well-organised cricketer whom Ireland look to their future, put up a resolute performance with Campher (30) to stall the inevitable. In the first innings Tector scored 34 and added 70 for the third wicket with James McCollum. Playing spin and pace quite well and using the depth of the crease, Tector went onto score 42 priceless runs off 95 balls (4 fours) when his innings came to an unfortunate end. Tector had come to terms with the challenges in the middle when he attempted a quick run that was never there and slipped in mid-pitch, and failed to beat the return from Karunaratne from extra cover to wicket-keeper Sadeera Samarawickrama. Following Tector’s dismissal there was not much resistance from the tail as Sri Lanka wrapped up the Ireland second innings for 168, with Ramesh Mendis picking up four wickets to become the joint fastest Sri Lankan bowler to 50 Test wickets (11 Tests) with another off-spinner Dilruwan Perera who also achieved the landmark at Galle against Australia in 2016. Outstanding at forward short-leg was Nishan Madushka, a wicket-keeper/batsman who pulled off some astonishing catches in that position – three in all, just when Ireland was settling into their batting. His performance reminded one of another former Sri Lankan stalwart Hashan Tillakaratne who also started off as a wicket-keeper and excelled in the position of a close-in fielder. The match turned out to be a one-way contest ever since Sri Lanka won the toss and piled up a score in excess of 500. With no proper first-class structure in place Ireland were left to learn the harsh lessons of Test cricket the hard way. Being only their fifth Test match since being elevated to Test ranks in 2017, it has been a whole new learning curve for the Irish. The second Test starts at the same venue on 24 April.","pubDate":"2023-04-18 19:11:50","image_url":null,"source_id":"ft_lk","category":["sports"],"country":["Sri Lanka"],"language":"english"},{"title":"SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch","link":"https://www.firstpost.com/firstcricket/sports-news/srh-vs-mi-arjun-tendulkar-dismisses-bhuvneshwar-kumar-to-claim-first-ever-ipl-wicket-watch-12473962.html","keywords":["First Cricket News"],"creator":["FirstCricket Staff"],"video_url":null,"description":"SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch","content":"Cricket SRH vs MI: Arjun Tendulkar dismisses Bhuvneshwar Kumar to claim first-ever IPL wicket; Watch Arjun, playing for Mumbai Indians, was tasked with the duty to defend 20 runs from the final over, with SRH looking to chase down a target of 193. FirstCricket Staff April 19th, 2023 0:11:44 IST Arjun Tendulkar celebrates the wicket of Bhuvneshwar Kumar. Sportzpics Tuesday night would have been a proud night for Master Blaster Sachin Tendulkar as his son Arjun Tendulkar claimed his first-ever Indian Premier League (IPL) wicket, removing Sunrisers Hyderabad’s Bhuvneshwar Kumar on Tuesday. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Arjun, playing for Mumbai Indians, was tasked with the duty to defend 20 runs from the final over, with SRH looking to chase down a target of 193. Abdul Samad was run-out off the second ball of the 20 th over to leave SRH nine down, and even after that, Arjun did not leave any room for improvement to the SRH tailenders. Arjun finally struck in the fifth ball of the final over, bowling a full length ball to make Bhuvneshwar go down the ground, only to get an outside edge en route to Rohit Sharma at extra cover, who completed the catch. You can watch the video of Arjun’s first wicket here: A special moment for young Arjun Tendulkar, who gets his first wicket in #TATAIPL and it is his captain Rohit Sharma, who takes the catch of Bhuvneshwar Kumar. Arjun takes the final wicket and @mipaltan win by 14 runs. pic.twitter.com/1jAa2kBm0Z — IndianPremierLeague (@IPL) April 18, 2023 MI eventually won by 14 runs, and the win took them to sixth place in the points table, with six points. They next face Punjab Kings on Saturday (22 April). Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 19, 2023 00:11:44 IST Tags: Arjun Tendulkar Ipl 2023 Ipl 2023 Mi Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.","pubDate":"2023-04-18 18:41:44","image_url":"https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Arjun-Tendulkar-640_Sportzpics.jpg","source_id":"firstpost","category":["sports"],"country":["india"],"language":"english"},{"title":"Green outshines Ashes rival Brook in IPL duel","link":"https://thewest.com.au/sport/cricket/green-outshines-ashes-rival-brook-in-ipl-duel-c-10386555","keywords":null,"creator":["Glenn Moore"],"video_url":null,"description":"Runs from Cam Green, wickets for Jason Behrendorff and Riley Meredith, and safe catching by Tim David carried Mumbai Indians to an Aussie-accented IPL victory.","content":"Cam Green has won the Indian Premier League showdown between Australia and England's young guns in Hyderabad. Green cracked an unbeaten 64 off 40 balls with six fours and two sixes as Mumbai Indians made 5-192. Harry Brook, who hit a maiden IPL century in his previous outing, looked in similar form as he opened with two sumptuous fours, but he was then surprised by a slower ball bouncer from Jason Behrendorff and dismissed for a seven-ball nine. With Behrendorff (2-37 off four) adding the wicket of Rahul Tripathi, Sunrisers Hyderabad were reduced to 2-25 in the fourth over. They never recovered and were bowled out off the penultimate ball for 178, 15 runs adrift. The final wicket was taken by Arjuna Tendulkar, son of the legendary Sachin, his first wicket in the IPL. The IPL is a huge event in its own right, but 60 days out from the first Test at Edgbaston every Anglo-Australian encounter is seen through an Ashes lens. Green's ability to cope with the stresses of being the most expensive Australian in the IPL, having been signed for $3.15m, augurs well for the pressure he will be under in England. The 23-year-old West Australian, who won a clutch of post-match awards, said: \"The first couple of games were a learning curve for me and the team but we've now won three in a row.\" Of his key role bowling at the death he added: \"It is a work in progress but you get better the more you get exposed to it.\" Green began slowly, assessing the pace of the pitch, then accelerated. He had good support from Ishan Kishan (38) and Tilak Varma (37). In a late cameo Tim David made 16 off 11 balls before being run out of the last delivery. After Behrendorff's early inroads Sunrisers rebuilt through Maynak Agarwal and skipper Aiden Markham (22), but the latter fell to Green's fourth ball as the all-rounder took a role with the ball, finishing with 1-29 off four overs. Indians ultimately fielded a quartet of Australians with Green, Behrendorff and David joined by Riley Meredith, who was introduced as an 'impact substitute'. He had an impact too, dismissing Agarwal (48 off 41) and Marco Jansen (13 off six) as he took 2-33 in his four overs. They were two of a quartet of fine catches taken on the long on boundary by David, which included Heinrich Klassen, who had threatened to transform the match with 36 off 16. David added a run-out to complete a fielding five-for. Meredith had been omitted from the initial XI despite Jofra Archer being unavailable for the fourth successive match. The quick's continued absence is a concern for England as the problem is his troublesome right elbow. Archer has twice had surgery on the elbow joint spending much of the last two years either injured or recuperating. England's medical team have been working closely with their Mumbai counterparts and it is understood Archer is working towards returning against Punjab Kings on April 22 or Gujarat Titans three days later. Archer's setback has dented confidence that he will be play a major role in the Ashes with his county, Sussex, indicating he is unlikely to play first-class cricket for them before the series starts. That would leave Archer going into the Ashes with just a series of four-over T20 spells behind him, that would seem inadequate preparation for five-day Tests. - with PA Sign up for our emails","pubDate":"2023-04-18 18:02:10","image_url":"https://images.thewest.com.au/publication/C-10386555/546724dcb2af0fbbc5d34ce8d44c10f531885c06-16x9-x0y0w1280h720.jpg","source_id":"thewest","category":["sports"],"country":["australia"],"language":"english"},{"title":"SRH vs MI Live Score: Big Blow For SRH! Harry Brook Departs For 9 In Chase vs MI - NDTV Sports","link":"https://news.google.com/rss/articles/CBMikAFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9pcGwtMjAyMy9zcmgtdnMtbWktbGl2ZS1zY29yZS1pcGwtMjAyMy10b2RheS0yNXRoLW1hdGNoLXN1bnJpc2Vycy1oeWRlcmFiYWQtdnMtbXVtYmFpLWluZGlhbnMtbGl2ZS1zY29yZS11cGRhdGVzLTM5NTg1MjXSAZYBaHR0cHM6Ly9zcG9ydHMubmR0di5jb20vaXBsLTIwMjMvc3JoLXZzLW1pLWxpdmUtc2NvcmUtaXBsLTIwMjMtdG9kYXktMjV0aC1tYXRjaC1zdW5yaXNlcnMtaHlkZXJhYmFkLXZzLW11bWJhaS1pbmRpYW5zLWxpdmUtc2NvcmUtdXBkYXRlcy0zOTU4NTI1L2FtcC8x?oc=5","keywords":null,"creator":null,"video_url":null,"description":"SRH vs MI Live Score: Big Blow For SRH! Harry Brook Departs For 9 In Chase vs MI  NDTV SportsSRH vs MI Dream11 Prediction Today Match 25, Dream11 Team Today, Fantasy Cricket Tips- IPL 2023  Cricket AddictorSRH: 22-1 (3) | SRH vs MI, IPL 2023 Cricket Live Score & Updates: Behrendorff Removes Brook  Zee NewsSachin Lara: Watch Meet of GOATS, Fans dive in Nostalgia as Sachin Tendulkar and Brian Lara share CANDID moment ahead of SRH vs MI Clash - Check Out  InsideSportSRH vs MI: Weather Report Live Today And Pitch Report Of Rajiv Gandhi International Stadium in Hyderabad- IPL 2023, Match 25  Cricket AddictorView Full coverage on Google News","content":null,"pubDate":"2023-04-18 16:09:11","image_url":null,"source_id":"google","category":["sports"],"country":["india"],"language":"english"}]}