{"newsArray":[{"title":"Soul-searching begins for English cricket","link":"https://thewest.com.au/sport/cricket/soul-searching-begins-for-english-cricket-c-5115756","keywords":null,"creator":["By Rory Dollard"],"video_url":null,"description":"Chris Silverwood accepts that English cricket needs to ask itself some difficult questions after Australia retained the Ashes with a dominant third Test win.","content":null,"pubDate":"2021-12-29 00:25:49","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5115756/37ad37c3b5a30593f337767b41fef162eac076fc-16x9-x0y75w800h450.jpg","source_id":"thewest"},{"title":"Soul-searching begins for English cricket","link":"https://www.busseltonmail.com.au/story/7565549/soul-searching-begins-for-english-cricket/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-29 00:24:44","full_description":"Coach Chris Silverwood says England cricket must face hard questions after an Ashes humiliation. England coach Chris Silverwood admits hard questions must be asked after his dreams of leading an Ashes-winning tour were promptly crushed by Australia. When Silverwood replaced Trevor Bayliss as head coach two-and-a-half years ago, he placed regaining the urn Down Under at the top of his wish list. But after just 12 days of on-field action, there is nothing left to play for but damage limitation in the last two Ashes Tests following a humiliating MCG defeat on Tuesday. Silverwood and captain Joe Root are sure to come under plenty of scrutiny with England going backwards as a Test team over the past couple of years. They have lost nine and won just one of their last 12 Tests. But there are no blindingly obvious coaching or captaincy candidates. And it seems change at the top would not turn Haseeb Hameed, Rory Burns or Zak Crawley into battle-hardened opening batters or cure a chronic lack of fit quicks to back up Mark Wood. \"I think at the end of this tour there will certainly be reflections on a lot of things, on producing players who can come through and compete at this level and win back the Ashes for us,\" Silverwood said. \"That will mean working hard with the group of players we have here but also looking at other things as well. \"I don't think right now is the time to go into that but certainly, there will be questions asked later on.\" A faltering production line of players lies at the heart of England's travails and Silverwood suggested he sympathised with those who believe the priorities of the domestic game had tilted too far in favour of limited-overs cricket. \"Obviously white-ball cricket now plays a huge part (in the UK) with the Blast, the Hundred and all the white-ball cricket that is going on, but I do sense there is a real drive for Test cricket,\" he said. \"I think the love is still there and we've got to keep trying to produce those players.\" It seems change at some level is inevitable. England and Wales Cricket Board chief executive Tom Harrison and director of men's cricket Ashley Giles are two other names who may find themselves under the microscope. Pleading his own case for more time, Silverwood said: \"I do feel like I am capable of leading this team to winning things and that's what I'm going to stay focused on. \"That's all I can do, I'm not going to worry about my job. \"I don't want to be going back having lost 5-0. I want to win games over here.\" Australian Associated Press","image_url":"https://transform.newsnow.io/transform/v1/crop/frm/silverstone-feed-data/cb466892-90f3-4b06-b5e6-ec667b938b6c.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail"},{"title":"Will Pucovski scuppers claim he can’t play short ball, excited about return to cricket","link":"https://thewest.com.au/sport/cricket/pucovski-excited-about-return-to-cricket-c-5115296","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Will Pucovski says he is continually frustrated as he deals with ongoing concussion symptoms but the Victorian batting star is on track to return to cricket.","content":null,"pubDate":"2021-12-28 23:43:29","full_description":null,"image_url":"https://images.thewest.com.au/publication/C-5115296/1070f3fa27644ff4608d17509bb900f5a46990d9-16x9-x95y0w1014h570.jpg","source_id":"thewest"},{"title":"Pucovski excited about return to cricket","link":"https://www.perthnow.com.au/sport/cricket/pucovski-excited-about-return-to-cricket-c-5115293","keywords":null,"creator":["Oliver Caffrey"],"video_url":null,"description":"Will Pucovski says he is continually frustrated as he deals with ongoing concussion symptoms but the Victorian batting star is on track to return to cricket.","content":null,"pubDate":"2021-12-28 23:43:29","full_description":null,"image_url":"https://images.perthnow.com.au/publication/C-5115293/1070f3fa27644ff4608d17509bb900f5a46990d9-16x9-x0y0w1280h720.jpg","source_id":"perthnow"},{"title":"Pucovski excited about return to cricket","link":"https://www.busseltonmail.com.au/story/7565529/pucovski-excited-about-return-to-cricket/?src=rss","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-28 23:41:12","full_description":"Will Pucovski is closing in on a return to cricket after an absence because of concussion issues. Will Pucovski has detailed his frustrating battle with concussion but the Victorian batter remains on track for a low-key return to cricket in January. The 23-year-old has been sidelined since suffering his 10th concussion during a training session in October. A hit to the head in the nets cost Australia's young batting star any chance of being involved in the Ashes this summer. Pucovski impressed with 62 on Test debut against India in January, but a shoulder injury and more concussion issues have kept his promising international career to just one appearance. In a candid discussion during a BBL commentary stint, Pucovski explained he had no fears about facing short-pitched bowling. \"The thing that can confuse me sometimes is you get this big storyline about 'he can't play the short ball',\" Pucovski told the Seven Network. \"In every (Sheffield) Shield game I play, as soon as I get to 10 or 15 it's the short ball plan because I've obviously had this history. \"I have been quite successful against it, playing a lot of cricket. \"I'm quite confident with how I go about it. \"I just find it more frustrating when I do get hit, I do get symptoms a lot of the time. \"That's the thing I guess gets to me the most because I'm sitting there going, 'I would just love to get hit and I keep batting'.\" Pucovski will line-up for Melbourne in Victorian Premier Cricket in coming weeks in a bid to build enough momentum ahead of the return of Shield cricket after the BBL finishes on January 28. \"I can't wait to get myself out of the nets,\" he said. \"It will be good to get match action and get back into it.\" In 24 first-class matches, Pucovski averages 53.41 with six centuries and a highest score of 255 not out. Australian Associated Press","image_url":"https://transform.newsnow.io/transform/v1/crop/frm/silverstone-feed-data/d5b9ed60-02c2-4a23-b557-b41892984a69.jpg/r0_75_800_526_w600_h338_fmax.jpg","source_id":"busseltonmail"},{"title":"Skipper’s huge Starc praise as speedster stuns critics - Herald Sun","link":"https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3dy5oZXJhbGRzdW4uY29tLmF1L3Nwb3J0L2FzaGVzLTIwMjEyMi1mb2xsb3ctdGhlLWxhdGVzdC1uZXdzLWZyb20tdGhlLWF1c3RyYWxpYW4tY2FtcC9uZXdzLXN0b3J5L2EwOGVkNGU4NzY3YjJkNTZhYjQ1YTg2MmJmOGQ1MDA00gGPAWh0dHBzOi8vd3d3LmhlcmFsZHN1bi5jb20uYXUvc3BvcnQvYXNoZXMtMjAyMTIyLWZvbGxvdy10aGUtbGF0ZXN0LW5ld3MtZnJvbS10aGUtYXVzdHJhbGlhbi1jYW1wL25ld3Mtc3RvcnkvYTA4ZWQ0ZTg3NjdiMmQ1NmFiNDVhODYyYmY4ZDUwMDQ_YW1w?oc=5","keywords":null,"creator":null,"video_url":null,"description":"Skipper’s huge Starc praise as speedster stuns critics  Herald SunWhy Atherton didn't like the Dawid Malan dismissal  SENMitchell Starc began the Ashes under siege. He could end them as ‘man of the series’  Fox SportsMitch Starc Reviews Australia's Rapid Four-Wicket Finish To Day Two | Triple M Cricket  Triple M“It almost did too much”: Starc on that hat-trick ball, MCG atmosphere  SENView Full coverage on Google News","content":null,"pubDate":"2021-12-28 21:20:13","image_url":null,"source_id":"google"},{"title":"Cricket-Ireland v USA one-day series cancelled due to COVID-19 cases","link":"https://www.thestar.com.my/sport/cricket/2021/12/29/cricket-ireland-v-usa-one-day-series-cancelled-due-to-covid-19-cases","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Ireland and hosts United States agreed to cancel the one-day international (ODI) series between the two sides after members of the touring staff tested positive for COVID-19, the two boards announced on Tuesday. Read full story","content":null,"pubDate":"2021-12-28 20:29:00","full_description":"(Reuters) - Ireland and hosts United States agreed to cancel the one-day international (ODI) series between the two sides after members of the touring staff tested positive for COVID-19, the two boards announced on Tuesday. The two teams had played a Twenty20 series which ended 1-1 while the ODI series in Florida was interrupted by coronavirus cases first detected amongst the USA squad and umpires. \"While all players in both current playing squads have returned negative COVID results overnight, two members of the Irish support staff have tested positive, as well as several partners of players, resulting in two of the Irish players being deemed as 'close contacts',\" the two boards said in a statement. \"As such the risks and concerns about further spread have meant that both Boards have regrettably agreed to cancel the remaining two scheduled matches.\" The visit of Ireland was the first time the United States had hosted an International Cricket Council (ICC) full member nation. Ireland are scheduled to tour the Caribbean to face the West Indies in three ODIs and one T20I in January. They will fly to Kingston, Jamaica on Friday but the two members who tested positive will complete their isolation in Florida. \"From a broader perspective, consideration had to be given to the current series as well as the second leg of our tour,\" Cricket Ireland's high performance director Richard Holdsworth said. \"We need to be mindful of travel requirements for entering Jamaica and meeting Cricket West Indies COVID protocols.\" (Reporting by Rohith Nair in Bengaluru; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/29/1423529.jpg","source_id":"thestar_my"},{"title":"England wreck prompts desperate demand","link":"https://wwos.nine.com.au/cricket/the-ashes-2021-england-australia-video-highlights-uk-view/b8e4c284-26a8-43ea-a48d-57bb0fc37947","keywords":null,"creator":["wwos"],"video_url":null,"description":"Reaction out of England has been scathing after the tourists' Boxing Day Test humiliation at the hands of Australia.","content":"England were humiliated in just over two days at the MCG and reaction sweeping through the media at home has, unsurprisingly, been scathing.Journalists and former England cricketers have labelled the tourists' Boxing Day Test performance \"embarrassing\", called for \"a big inquest\", declared \"people's jobs are on the line\" and raised grave fears over the future of coach Chris Silverwood.The searing backlash comes after England's innings defeat consigned the visitors to a 3-0 series deficit, Australia retaining the Ashes urn in the face of brittle resistance.READ MORE: Aussie debutant claims Johnny Mullagh Medal in sporting poetry\"It is embarrassing. There was no fight,\" former England quick Stephen Harmison told BT Sport.\"You can say Australia have bowled well, which they have done; they have been magnificent, as painful as it is for an Englishman to say.\"But to lose by an innings when a team only gets 267 runs tells you everything about where this series has been.\"There is going to be a big inquest. There are going to be people's careers on the line.\"Our bowling unit over the last few years has been able to win games of international cricket. Our batting unit has been abysmal. There is no other way of sugar-coating it.\"Something has to happen, something has to change, whether it is looking through the system, whether it is personnel.\"READ MORE: England great tips Ashes horror for years to come amid nightmareFormer England all-rounder Moeen Ali lamented the gulf between the two sides.\"I didn't think the gap was that big before the series but I almost think it is bigger than we are willing to admit,\" Ali told BT Sport.\"I can't remember many sessions we have won in this series.\"It does feel embarrassing as a player and you do feel down. We have been off the pace and we've got some soul-searching to do.\"Dean Wilson of The Mirror honed in on the devastating moment in which the series was decided, Australia's Cameron Green rattling the stumps of James Anderson as the MCG crowd erupted.\"In 12 days either side of Christmas, England lost the Ashes and their cricketing dignity with more than half the series still left to play,\" Wilson wrote.\"At 11.50am on day three of the third Test at the MCG, Cam Green captured the final English wicket to rout them for 68 in their second innings as they lost by an innings and 14 runs.\"This was not just an Ashes defeat, it was an utter capitulation. A surrender that simply must bring about real and meaningful change when it comes to the way England addresses Test cricket.\"FULL RECAP: Re-live the third Ashes Test in our play-by-play blog hereNick Hoult of The Times pointed to the destructive final hour of play on day two, in which Australia fast bowlers Mitchell Starc and Scott Boland decimated England's top order.The Poms reached stumps on day two reeling at 4-31 and still needing 52 runs to force Australia to bat again, which they failed to do in disastrous scenes.\"Australia retained the Ashes when James Anderson was bowled to bring down the curtain on a pathetic England batting performance that summed up this sorry tour,\" Hoult wrote.\"England never recovered from an electrifying final hour on the second day when they lost four wickets to some intimidating, brutal fast bowling.\"Then came a grim outlook on the future of coach Chris Silverwood.\"Ashley Giles, the team director, will be in Sydney next week and has a major decision to make over the future of the head coach before the Test tour to the West Indies in March,\" Hoult wrote.\"Silverwood has been in charge since 2019 when he replaced Trevor Bayliss as head coach.\"He was given even more power in May when Ed Smith, the chief selector, was sacked by Giles who put Silverwood in overall control of selection. Since then England have lost six Tests out of eight.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-28 19:47:08","full_description":"England were humiliated in just over two days at the MCG and reaction sweeping through the media at home has, unsurprisingly, been scathing. Journalists and former England cricketers have labelled the tourists' Boxing Day Test performance \"embarrassing\", called for \"a big inquest\", declared \"people's jobs are on the line\" and raised grave fears over the future of coach Chris Silverwood. The searing backlash comes after England's innings defeat consigned the visitors to a 3-0 series deficit, Australia retaining the Ashes urn in the face of brittle resistance. READ MORE: Aussie debutant claims Johnny Mullagh Medal in sporting poetry \"It is embarrassing. There was no fight,\" former England quick Stephen Harmison told BT Sport. \"You can say Australia have bowled well, which they have done; they have been magnificent, as painful as it is for an Englishman to say. \"But to lose by an innings when a team only gets 267 runs tells you everything about where this series has been. \"There is going to be a big inquest. There are going to be people's careers on the line. \"Our bowling unit over the last few years has been able to win games of international cricket. Our batting unit has been abysmal. There is no other way of sugar-coating it. \"Something has to happen, something has to change, whether it is looking through the system, whether it is personnel.\" READ MORE: England great tips Ashes horror for years to come amid nightmare Former England all-rounder Moeen Ali lamented the gulf between the two sides. \"I didn't think the gap was that big before the series but I almost think it is bigger than we are willing to admit,\" Ali told BT Sport. \"I can't remember many sessions we have won in this series. \"It does feel embarrassing as a player and you do feel down. We have been off the pace and we've got some soul-searching to do.\" Dean Wilson of The Mirror honed in on the devastating moment in which the series was decided, Australia's Cameron Green rattling the stumps of James Anderson as the MCG crowd erupted. \"In 12 days either side of Christmas, England lost the Ashes and their cricketing dignity with more than half the series still left to play,\" Wilson wrote. \"At 11.50am on day three of the third Test at the MCG, Cam Green captured the final English wicket to rout them for 68 in their second innings as they lost by an innings and 14 runs. \"This was not just an Ashes defeat, it was an utter capitulation. A surrender that simply must bring about real and meaningful change when it comes to the way England addresses Test cricket.\" FULL RECAP: Re-live the third Ashes Test in our play-by-play blog here Nick Hoult of The Times pointed to the destructive final hour of play on day two, in which Australia fast bowlers Mitchell Starc and Scott Boland decimated England's top order . The Poms reached stumps on day two reeling at 4-31 and still needing 52 runs to force Australia to bat again, which they failed to do in disastrous scenes. \"Australia retained the Ashes when James Anderson was bowled to bring down the curtain on a pathetic England batting performance that summed up this sorry tour,\" Hoult wrote. \"England never recovered from an electrifying final hour on the second day when they lost four wickets to some intimidating, brutal fast bowling.\" Then came a grim outlook on the future of coach Chris Silverwood. \"Ashley Giles, the team director, will be in Sydney next week and has a major decision to make over the future of the head coach before the Test tour to the West Indies in March,\" Hoult wrote. \"Silverwood has been in charge since 2019 when he replaced Trevor Bayliss as head coach. \"He was given even more power in May when Ed Smith, the chief selector, was sacked by Giles who put Silverwood in overall control of selection. Since then England have lost six Tests out of eight.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400906/281221cricketwin.png","source_id":"nine"},{"title":"Legend's blunt advice for woeful England","link":"https://wwos.nine.com.au/cricket/ashes-2021-mark-taylor-on-england-loss-to-australia-at-mcg-joe-root-batters-james-anderson-squad-coaches/1f14cf88-5fa9-478c-a757-d9373ae70aa5","keywords":null,"creator":["wwos"],"video_url":null,"description":"Mark Taylor fears England may need a wholesale review of the country's operations before the Test team can begin to regenerate.","content":"Cricket legend Mark Taylor fears England may need a wholesale review of the country's operations before the Test team can begin to regenerate.England has lost the Ashes series already, only three matches in but beaten convincingly in each, and still with two to play.The first two were bad but this week's slaughter at the MCG might be the worst. England fought back to be in a winning position on Day 2, only to be rolled for 68 and lose by an innings, the match over before the first break on Day 3.READ MORE: Mark Taylor's player ratings from the MCG Ashes TestREAD MORE: Aussie debutant claims Johnny Mullagh Medal in sporting poetryREAD MORE: England great tips Ashes horror for years to come amid nightmare\"From a cricket point of view (it's) a bit of a worry, really. England, I don't know where they go,\" Taylor told Wide World of Sports.\"They've tried various combinations in their top order but their batting has got so many flaws in it it's not funny. That's the worry for them.\"I'm not sure where they turn to from here.\"Australia have got 15 or 20 guys to choose from and at the moment I don't know who England pick.\"After the Test ended in horror fashion for England, captain Joe Root hinted a review may be needed into how the team sunk so low.Root said not enough professional players were ready for Test cricket - the longest and best form of the game.Taylor agrees.\"Something needs to happen, because you've only got to look at their batters, you can use that as the benchmark I suppose,\" Taylor said.\"They've got Joe Root who is world class, but no one else in their batting is world class. The next best in terms of average is Ben Stokes, he averages 36. He's a world class all-rounder.\"Everyone else is averaging 33 or less, and that includes (Rory) Burns and (Ollie) Pope who didn't play this game, but they have played more than 20 matches each.\"At the moment England aren't producing players who are going to average 40-plus, and that should be the yardstick of what you want to achieve.\"The worry is I'm not sure who's next in for them.\"Taylor is just as concerned about England's bowling stocks.\"On the other side of it, their best bowler is James Anderson, and he is 39 years old. If he's your best bowler, why is your best bowler a 39-year-old?\" he said.\"I would've liked to have seen an England side that had young fast bowlers coming through, and maybe Jimmy Anderson plays the support role.\"But when Jimmy Anderson comes as the main act, at the age of 39, with an average in Australia in the mid-30s with the ball, it doesn't bode well, and it hasn't gone that way either.\"England need a total revamp. They need a whole new fresh approach to what they're doing, starting with some quality batters who can not just occupy the crease but can also play quality bowling.\"For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","pubDate":"2021-12-28 19:45:29","full_description":"Cricket legend Mark Taylor fears England may need a wholesale review of the country's operations before the Test team can begin to regenerate. England has lost the Ashes series already, only three matches in but beaten convincingly in each, and still with two to play. The first two were bad but this week's slaughter at the MCG might be the worst. England fought back to be in a winning position on Day 2, only to be rolled for 68 and lose by an innings, the match over before the first break on Day 3. READ MORE: Mark Taylor's player ratings from the MCG Ashes Test READ MORE: Aussie debutant claims Johnny Mullagh Medal in sporting poetry READ MORE: England great tips Ashes horror for years to come amid nightmare \"From a cricket point of view (it's) a bit of a worry, really. England, I don't know where they go,\" Taylor told Wide World of Sports. \"They've tried various combinations in their top order but their batting has got so many flaws in it it's not funny. That's the worry for them. \"I'm not sure where they turn to from here. \"Australia have got 15 or 20 guys to choose from and at the moment I don't know who England pick.\" After the Test ended in horror fashion for England, captain Joe Root hinted a review may be needed into how the team sunk so low . Root said not enough professional players were ready for Test cricket - the longest and best form of the game. Taylor agrees. \"Something needs to happen, because you've only got to look at their batters, you can use that as the benchmark I suppose,\" Taylor said. \"They've got Joe Root who is world class, but no one else in their batting is world class. The next best in terms of average is Ben Stokes, he averages 36. He's a world class all-rounder. \"Everyone else is averaging 33 or less, and that includes (Rory) Burns and (Ollie) Pope who didn't play this game, but they have played more than 20 matches each. \"At the moment England aren't producing players who are going to average 40-plus, and that should be the yardstick of what you want to achieve. \"The worry is I'm not sure who's next in for them.\" Taylor is just as concerned about England's bowling stocks. \"On the other side of it, their best bowler is James Anderson, and he is 39 years old. If he's your best bowler, why is your best bowler a 39-year-old?\" he said. \"I would've liked to have seen an England side that had young fast bowlers coming through, and maybe Jimmy Anderson plays the support role. \"But when Jimmy Anderson comes as the main act, at the age of 39, with an average in Australia in the mid-30s with the ball, it doesn't bode well, and it hasn't gone that way either. \"England need a total revamp. They need a whole new fresh approach to what they're doing, starting with some quality batters who can not just occupy the crease but can also play quality bowling.\" For a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!","image_url":"https://vms-network-images-prod.s3-ap-southeast-2.amazonaws.com/2021/12/400906/281221cricketwin.png","source_id":"nine"},{"title":"Want to play at least for next three years: Rayudu","link":"https://www.thehansindia.com/sports/cricket/want-to-play-at-least-for-next-three-years-rayudu-722083","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Former India batter Ambati Rayudu says he wants to continue playing at least for the next three years and is gearing up for the next cycle of the Indian Premier League.","content":"Former India batter Ambati RayuduFormer India batter Ambati RayuduChennai: Former India batter Ambati Rayudu says he wants to continue playing at least for the next three years and is gearing up for the next cycle of the Indian Premier League.The 36-year-old right-handed batter had quit in July, 2019 from all forms of cricket after being ignored for the ICC ODI World Cup but made himself available for selection after two months. \"I would love to keep playing till I am in good form and fit. I will be ready for the next cycle, which is three years and I am working hard on my fitness,\" Rayudu, who played for Andhra in the recent Vijay Hazare Trophy, told PTI. \"I recently played the Vijay Hazare Trophy which is five one-day games in six days which I got through well. I am in good shape and I hope to continue to play at least for the next three years.\" Rayudu was one of the five standbys for the World Cup but he missed out a place in the 15-member squad to Vijay Shankar, who was considered to have a \"three-dimensional\" game. He made a sarcastic '3D' comment and quit cricket, before retracking his decision. \"2019 World Cup definitely was disappointing for me, for not making the squad. My comeback was dedicated to CSK and how they helped me get through that phase and time and I am thankful to them.\" Rayudu feels his stint with four-time IPL champions Chennai Super Kings was a special one and skipper M S Dhoni brought the best out of him. \"My stint with CSK has been a very special one. We have won two IPLs till now and played one final. 2018 was a very special season, a comeback season for CSK and us winning the IPL that year made it very special. \"Dhoni bhai has had the impact of getting the best out of me, not only me but he has an impact on everyone and brings the best performance out of everyone in the team. \"","pubDate":"2021-12-28 18:58:24","full_description":"Former India batter Ambati Rayudu Chennai: Former India batter Ambati Rayudu says he wants to continue playing at least for the next three years and is gearing up for the next cycle of the Indian Premier League. The 36-year-old right-handed batter had quit in July, 2019 from all forms of cricket after being ignored for the ICC ODI World Cup but made himself available for selection after two months. \"I would love to keep playing till I am in good form and fit. I will be ready for the next cycle, which is three years and I am working hard on my fitness,\" Rayudu, who played for Andhra in the recent Vijay Hazare Trophy, told PTI. \"I recently played the Vijay Hazare Trophy which is five one-day games in six days which I got through well. I am in good shape and I hope to continue to play at least for the next three years.\" Rayudu was one of the five standbys for the World Cup but he missed out a place in the 15-member squad to Vijay Shankar, who was considered to have a \"three-dimensional\" game. He made a sarcastic '3D' comment and quit cricket, before retracking his decision. \"2019 World Cup definitely was disappointing for me, for not making the squad. My comeback was dedicated to CSK and how they helped me get through that phase and time and I am thankful to them.\" Rayudu feels his stint with four-time IPL champions Chennai Super Kings was a special one and skipper M S Dhoni brought the best out of him. \"My stint with CSK has been a very special one. We have won two IPLs till now and played one final. 2018 was a very special season, a comeback season for CSK and us winning the IPL that year made it very special. \"Dhoni bhai has had the impact of getting the best out of me, not only me but he has an impact on everyone and brings the best performance out of everyone in the team. \"","image_url":"https://assets.thehansindia.com/h-upload/2021/12/28/500x300_1138334-ambati-rayudu.jpg","source_id":"thehansindia"},{"title":"Full day fast: How pacers dominated day’s cricket in the Southern Hemisphere","link":"https://indianexpress.com/article/sports/cricket/full-day-fast-how-pacers-dominated-days-cricket-in-the-southern-hemisphere-7695386/","keywords":["Cricket","Sports"],"creator":["Abhishek Purohit"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-28 18:47:53","full_description":"Fast bowlers reigned across time zones in the Southern Hemisphere on Tuesday. First in Melbourne, and then in Centurion, the sound of balls crashing into stumps, thudding into pads and smocking bat-edges narrated the tale of how much leather dominated willow. As many as 24 wickets fell on the day – 18 in Centurion alone – and all of them to pace. Boland the reaper, Starc the ripper Just how dreamy can a dream debut get? Winning a Boxing Day Ashes Test at the MCG for Australia with unreal figures of 4-1-7-6 was 32-year old debutant seamer Scott Boland, as he blew England away for just 68. Boland opened up Jonny Bairstow with a beauty that angled in and nipped away to trap him in front. England captain Joe Root was sucked into a fatal drive with a fuller one that again nipped away, but the ball of the day came from Mitchell Starc – a 145.4kph thunderbolt that jagged in off the pitch from a length and clattered into Ben Stokes’ middle stump. Stokes was perhaps looking to play the original line when his bat came down from just outside off stump. He ended up pinned half-forward with a yawning gap between bat and pad. Accuracy and movement at that speed will make even a batsman as talented as Stokes look clueless. The KG and Ng show After a fruitless first day and a washout on the second, South Africa’s spearhead Kagiso Rabada set the tone for the hosts’ swift comeback early on the third morning in Centurion. He overstepped twice in his second over, banging it in short both times, suggesting he was straining extra for the bouncer. He got it on target last ball of the same over. Short, quick, angled in, ending just outside KL Rahul ’s left shoulder. Hurried by the pace and lift, the centurion tried swinging it fine, only to nick it behind. Three overs later, Lungi Ngidi took out the second overnight batsman. Ajinkya Rahane likes to cut and upper-cut, and he probably thought he had the width and the length. But Ngidi found some inswing, and also some extra life off the pitch. Rahane’s swish only found the keeper’s gloves. The rest were to crumble to this combined onslaught in under nine overs. Shami returns the favour The current version of Mohammed Shami in South Africa is like a faster Vernon Philander. In the channel, all day, nipping it this way or that at awkward bounce and pace, and making survival almost impossible for batsmen. The first two of his five strikes were evidence enough. Keegan Petersen felt he had the driveable length. He was right, only the ball came in after pitching and took the inside edge on to leg stump. Aiden Markram was to suffer the other way. He shaped up to defend one angled in but this straightened past the bat and hit the top of off. It had all started when Jasprit Bumrah slanted a peach across Dean Elgar. The ball appeared to tilt in late towards the stumps, forcing an alarmed Elgar to try to defend, and then carried further across off the surface to take the edge behind. It was indeed an exhibition of fast bowling across continents.","image_url":null,"source_id":"indianexpress"},{"title":"It's all over: OZ retain the Ashes","link":"https://www.thehansindia.com/sports/cricket/its-all-over-oz-retain-the-ashes-722077","keywords":["Sports,Today NewsPaper,Cricket"],"creator":["The Hans India"],"video_url":null,"description":"Debutant Boland guides hosts to an innings and 14 runs win over England","content":"Australia's Scott Boland holds a stump after taking 6 wickets against England in their win on the third day of the Test match in Melbourne, Australia on Tuesday. Australia's Scott Boland holds a stump after taking 6 wickets against England in their win on the third day of the Test match in Melbourne, Australia on Tuesday. Melbourne: Test debutant Scott Boland returned with figures of 6/7 in his four overs as Australia crushed England by an innings and 14 runs on Day 3 at the Melbourne Cricket Ground (MCG) to retain the Ashes on Tuesday.The victory ensures Australia stay at the top of the World Test Championship standings with 100 per cent points, while England slip further. Boland, who claimed match figures of 7-55 and is only the second Indigenous player to represent Australia's men's Test-cricket side, was awarded the Johnny Mullagh Medal for player of the match. The award honors Australia's Indigenous team which toured England in 1868. Australia captain Pat Cummins said his side had been relentless and would now aim for a 5-0 sweep of the series. \"Any Ashes series is when you try to make a mark on your test career, so a chance to start cementing our identity,\" Cummins said. England captain Joe Root tried to remain positive. \"We have to stay strong and look at the next two games to take something from the tour,\" Root said at the post-match ceremony. Already on the brink of humiliation after a sensational bowling performance from Mitchell Starc and Boland on Day 2, England needed a big performance from two of their best batters -- skipper Joe Root and all-rounder Ben Stokes. A couple of flourishes and delectable drives from the duo would have given them a semblance of hope. But once the Australian bowlers found their rhythm again, the procession began. Starc got through the gates of Stokes with an absolute beauty. The all-rounder had no answers as the ball nipped back in, shattering his stumps, as he departed for 11. The Boland show then began as he embarked on a devastating spell that completely shattered the opposition. In the span of his three overs, he picked up four wickets. First, he trapped Jonny Bairstow in front of the stumps who then reviewed the call unsuccessfully. Then, the big wicket of Root followed with a fuller delivery, which nipped away from the England skipper. Root could only edge the delivery, departing for 28. Mark Wood was the next one to follow, with Boland taking a sensational caught and bowled. The crowd was up on its feet as Australia were now only two wickets away from a 3-0 victory in the five-Test series. Ollie Robinson was the next one to perish against Boland, as the pacer again got the delivery to move off the deck. It proved too good for Robinson, who was dismissed for a duck. By the end, Boland's figures read 6/7 in four overs. The final scalp was taken by Cameron Green, bowling Anderson for two as the MCG erupted with a big roar. England were bowled out for 68, losing the match by an innings and 14 runs. Australia have now taken an unassailable 3-0 lead, with the Ashes in the bag. The fourth Test is scheduled at the Sydney Cricket Ground from January 5. Root would be pondering where exactly things went wrong as their horrendous tour continued. Brief scores: England 185 and 68 all out in 27.4 overs (Mitchell Starc 3/29, Scott Boland 6/7) lost to Australia 267 (Marcus Harris 76, David Warner 38) by an innings and 14 runs.","pubDate":"2021-12-28 18:46:58","full_description":"Australia's Scott Boland holds a stump after taking 6 wickets against England in their win on the third day of the Test match in Melbourne, Australia on Tuesday. Melbourne: Test debutant Scott Boland returned with figures of 6/7 in his four overs as Australia crushed England by an innings and 14 runs on Day 3 at the Melbourne Cricket Ground (MCG) to retain the Ashes on Tuesday. The victory ensures Australia stay at the top of the World Test Championship standings with 100 per cent points, while England slip further. Boland, who claimed match figures of 7-55 and is only the second Indigenous player to represent Australia's men's Test-cricket side, was awarded the Johnny Mullagh Medal for player of the match. The award honors Australia's Indigenous team which toured England in 1868. Australia captain Pat Cummins said his side had been relentless and would now aim for a 5-0 sweep of the series. \"Any Ashes series is when you try to make a mark on your test career, so a chance to start cementing our identity,\" Cummins said. England captain Joe Root tried to remain positive. \"We have to stay strong and look at the next two games to take something from the tour,\" Root said at the post-match ceremony. Already on the brink of humiliation after a sensational bowling performance from Mitchell Starc and Boland on Day 2, England needed a big performance from two of their best batters -- skipper Joe Root and all-rounder Ben Stokes. A couple of flourishes and delectable drives from the duo would have given them a semblance of hope. But once the Australian bowlers found their rhythm again, the procession began. Starc got through the gates of Stokes with an absolute beauty. The all-rounder had no answers as the ball nipped back in, shattering his stumps, as he departed for 11. The Boland show then began as he embarked on a devastating spell that completely shattered the opposition. In the span of his three overs, he picked up four wickets. First, he trapped Jonny Bairstow in front of the stumps who then reviewed the call unsuccessfully. Then, the big wicket of Root followed with a fuller delivery, which nipped away from the England skipper. Root could only edge the delivery, departing for 28. Mark Wood was the next one to follow, with Boland taking a sensational caught and bowled. The crowd was up on its feet as Australia were now only two wickets away from a 3-0 victory in the five-Test series. Ollie Robinson was the next one to perish against Boland, as the pacer again got the delivery to move off the deck. It proved too good for Robinson, who was dismissed for a duck. By the end, Boland's figures read 6/7 in four overs. The final scalp was taken by Cameron Green, bowling Anderson for two as the MCG erupted with a big roar. England were bowled out for 68, losing the match by an innings and 14 runs. Australia have now taken an unassailable 3-0 lead, with the Ashes in the bag. The fourth Test is scheduled at the Sydney Cricket Ground from January 5. Root would be pondering where exactly things went wrong as their horrendous tour continued. Brief scores: England 185 and 68 all out in 27.4 overs (Mitchell Starc 3/29, Scott Boland 6/7) lost to Australia 267 (Marcus Harris 76, David Warner 38) by an innings and 14 runs.","image_url":"https://assets.thehansindia.com/h-upload/2021/12/28/500x300_1138328-oz.jpg","source_id":"thehansindia"},{"title":"USA v Ireland one-day cricket match postponed","link":"https://www.the42.ie/usa-v-ireland-one-day-cricket-match-postponed-5641986-Dec2021/","keywords":["USA"],"creator":null,"video_url":null,"description":"One match in the series scheduled for Sunday had already been cancelled.","content":null,"pubDate":"2021-12-28 18:45:09","full_description":"Updated at 20.26 THE USA v Ireland one day international cricket series scheduled for this week has been cancelled over Covid-related concerns, USA Cricket said Tuesday. The federation had already cancelled one of the three scheduled matches, but had hoped to play the remaining two on Wednesday and Thursday. “While all players in both current playing squads have returned negative Covid results overnight, two members of the Irish support staff have tested positive, as well as several partners of players, resulting in two of the Irish players being deemed as ‘close contacts,’” USA Cricket said in a statement. The latest Covid concerns — following positive tests for an umpire and members of the US squad — “meant that both boards have regrettably agreed to cancel the remaining two scheduled matches.” The USA and Ireland each won a T20 international in the opening two games of Ireland’s tour. Get closer to the stories that matter with exclusive analysis, insight and debate in The42 Membership. The Irish touring party are scheduled to leave Florida for Kingston, Jamaica, on Friday for their series against the West Indies. The two support staff members who tested positive will remain in isolation in Florida before they travel. © – AFP, 2021","image_url":"https://c2.thejournal.ie/media/2021/12/a-general-view-as-rain-stops-play-during-the-odi-at-the-village-dublin-630x420.jpg","source_id":"the42"},{"title":"Cricket-India&#039;s Shami credits immense hard work for 200-wicket milestone","link":"https://www.thestar.com.my/sport/cricket/2021/12/29/cricket-india039s-shami-credits-immense-hard-work-for-200-wicket-milestone","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - India paceman Mohammed Shami said on Tuesday that years of toil had finally paid off as he became only the fifth fast bowler from the country to pick up 200 wickets in test cricket. Read full story","content":null,"pubDate":"2021-12-28 18:30:00","full_description":"(Reuters) - India paceman Mohammed Shami said on Tuesday that years of toil had finally paid off as he became only the fifth fast bowler from the country to pick up 200 wickets in test cricket. The 31-year-old reached the landmark against South Africa on the third day of the first test at Centurion Park, finishing with figures of 5-44 as the visitors moved into a commanding position with a 146-run lead at stumps. \"While coming through the ranks, no bowler thinks about this (getting 200 wickets). They just dream of playing for India. It's all about hard work... when you put in the work, results follow,\" Shami told reporters. \"My father deserves a lot of credit... I come from a village where we had no cricketing facilities. I used to travel 30km for practice, but my family always believed in me.\" Shami, playing his 55th test, joins Kapil Dev, Zaheer Khan, Ishant Sharma and Javagal Srinath in the 200-wicket club for India in the game's longest format. Shami added that he had put in tremendous work to hone his skills, particularly his upright seam position that had the Proteas batsmen in a tangle on Tuesday. \"A lot of people talk about my ability to keep the seam upright. But people don't know the amount of work that has gone into that... as a seam bowler, you have to keep working on your skills,\" he said. \"Today, it was all about assessing the conditions and hitting the right areas. I wasn't worried too much about the pace, I was just focused on my length.\" After bowling South Africa out for 197, India were 16-1 in their second innings at the close of play. (Reporting by Dhruv Munjal in Bengaluru; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/29/1423521.jpg","source_id":"thestar_my"},{"title":"Cricket-S Africa feeling the effect of a lack of test cricket, says Bavuma","link":"https://www.thestar.com.my/sport/cricket/2021/12/29/cricket-s-africa-feeling-the-effect-of-a-lack-of-test-cricket-says-bavuma","keywords":null,"creator":null,"video_url":null,"description":"PRETORIA (Reuters) - Batsman Temba Bavuma says South Africa's lack of red ball cricket this year has been a big disadvantage and a key factor in their disappointing performance so far in the first test against India at Centurion Park. Read full story","content":null,"pubDate":"2021-12-28 18:00:00","full_description":"PRETORIA (Reuters) - Batsman Temba Bavuma says South Africa's lack of red ball cricket this year has been a big disadvantage and a key factor in their disappointing performance so far in the first test against India at Centurion Park. The tourists lead by 146 runs with nine second innings wickets remaining on a spicy pitch. They went to the close at 16 for one after dismissing the home side for 197 late in the day. South Africa had played five tests before this one in 2021, and none since June when they won away in the West Indies. This is India's 15th test this year, and they are coming off a home series against New Zealand that finished earlier this month. \"I don't want to be accused of making excuses for our play, but that does have an impact,\" Bavuma said after he top-scored in South Africa's first innings with 52. \"If you look at the way we played on the first day. I don't believe that is the standard and the intensity that we can play at. And one of the factors is the lack of match practice. You can have as many nets as you want, but nothing simulates going out in the middle. \"There is not much we can do as players, but there is that disparity in the number of games. We have to find a way mentally to meet the challenge.\" South Africa will hope to limit India to a manageable target, or at worst take time out of the game with some rain predicted for day five on Thursday. Either way, they will have to find a way to counter the Indian seamers, especially Mohammed Shami, who appeared unplayable at times on Tuesday as he recorded figures of 5-44. \"He is a world-class bowler, so I don't think it is something we did not expect,\" Bavuma said. \"As batters we have to front up and back our defence as much as we can. But if he bowls a good ball, kudos to him.\" (Reporting by Nick Said; Editing by Christian Radnedge)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/29/1423520.jpg","source_id":"thestar_my"},{"title":"S Africa feeling the effect of a lack of test cricket, says Bavuma","link":"https://www.channelnewsasia.com/sport/s-africa-feeling-effect-lack-test-cricket-says-bavuma-2404886","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-28 17:34:24","full_description":"PRETORIA : Batsman Temba Bavuma says South Africa's lack of red ball cricket this year has been a big disadvantage and a key factor in their disappointing performance so far in the first test against India at Centurion Park. The tourists lead by 146 runs with nine second innings wickets remaining on a spicy pitch. They went to the close at 16 for one after dismissing the home side for 197 late in the day. South Africa had played five tests before this one in 2021, and none since June when they won away in the West Indies. This is India's 15th test this year, and they are coming off a home series against New Zealand that finished earlier this month. \"I don't want to be accused of making excuses for our play, but that does have an impact,\" Bavuma said after he top-scored in South Africa's first innings with 52. \"If you look at the way we played on the first day. I don't believe that is the standard and the intensity that we can play at. And one of the factors is the lack of match practice. You can have as many nets as you want, but nothing simulates going out in the middle. \"There is not much we can do as players, but there is that disparity in the number of games. We have to find a way mentally to meet the challenge.\" South Africa will hope to limit India to a manageable target, or at worst take time out of the game with some rain predicted for day five on Thursday. Either way, they will have to find a way to counter the Indian seamers, especially Mohammed Shami, who appeared unplayable at times on Tuesday as he recorded figures of 5-44. \"He is a world-class bowler, so I don't think it is something we did not expect,\" Bavuma said. \"As batters we have to front up and back our defence as much as we can. But if he bowls a good ball, kudos to him.\" (Reporting by Nick Said; Editing by Christian Radnedge)","image_url":"https://onecms-res.cloudinary.com/image/upload/s--SDEdmOnU--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-28t173114z_1_lynxmpehbr0km_rtroptp_3_cricket-test-zaf-ind.jpg?itok=w1tfZObi","source_id":"channelnewsasia"},{"title":"South Africa feeling the effect of a lack of test cricket, says Bavuma","link":"https://www.channelnewsasia.com/sport/south-africa-feeling-effect-lack-test-cricket-says-bavuma-2404886","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-28 17:34:00","full_description":null,"image_url":"https://onecms-res.cloudinary.com/image/upload/s--SDEdmOnU--/c_fill%2Ch_900%2Cw_1600/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/v1/one-cms/core/2021-12-28t173114z_1_lynxmpehbr0km_rtroptp_3_cricket-test-zaf-ind.jpg?itok=w1tfZObi","source_id":"channelnewsasia"},{"title":"LIVE IND vs SA Live Cricket Score 1st Test, Day 3 Live Match Today Updates: Mohammed Shami Picks up Five-For; - India.com","link":"https://news.google.com/__i/rss/rd/articles/CBMi7gFodHRwczovL3d3dy5pbmRpYS5jb20vc3BvcnRzL2luZC12cy1zYS1saXZlLWNyaWNrZXQtc2NvcmUtMXN0LXRlc3QtYm94aW5nLWRheTMtdXBkYXRlcy1pbmRpYS12cy1zb3V0aC1hZnJpY2EtbGl2ZS1jcmlja2V0LXN0cmVhbWluZy1ob3N0YXItdmlkZW8tYmFsbC1ieS1iYWxsLWNvbW1lbnRhcnktc2EtdnMtaW5kLWxpdmUtc3RyZWFtLWNyaWNrZXQtamlvdHYtc2hhbWktaW5kLWxlYWQtc2EtMTQ2LXJ1LTUxNTkwNDgv0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"LIVE IND vs SA Live Cricket Score 1st Test, Day 3 Live Match Today Updates: Mohammed Shami Picks up Five-For;  India.comIndia vs South Africa 1st Test Score Updates, Day 3 Highlights: India 16/1 at stumps, lead South Africa by 146 runs  Times of IndiaSA vs IND Centurion Weather Today, India tour of South Africa 2021, Day 3, 1st Test  Cricket AddictorIndia strike back after first innings collapse  Deccan HeraldNominees for ICC Men's Test Player of the Year revealed  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2021-12-28 16:51:13","image_url":null,"source_id":"google"},{"title":"South Africa vs India, 1st Test, Day 3: Five-Star Mohammed Shami Puts Visitors In Driver's Seat Agai.. - NDTVSports.com","link":"https://news.google.com/__i/rss/rd/articles/CBMiqQFodHRwczovL3Nwb3J0cy5uZHR2LmNvbS9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMjAyMS0yMi9zb3V0aC1hZnJpY2EtdnMtaW5kaWEtMXN0LXRlc3QtZGF5LTMtZml2ZS1zdGFyLW1vaGFtbWVkLXNoYW1pLXB1dHMtdmlzaXRvcnMtaW4tZHJpdmVycy1zZWF0LWFnYWluc3QtcHJvdGVhcy0yNjc2Njc40gGvAWh0dHBzOi8vc3BvcnRzLm5kdHYuY29tL3NvdXRoLWFmcmljYS12cy1pbmRpYS0yMDIxLTIyL3NvdXRoLWFmcmljYS12cy1pbmRpYS0xc3QtdGVzdC1kYXktMy1maXZlLXN0YXItbW9oYW1tZWQtc2hhbWktcHV0cy12aXNpdG9ycy1pbi1kcml2ZXJzLXNlYXQtYWdhaW5zdC1wcm90ZWFzLTI2NzY2NzgvYW1wLzE?oc=5","keywords":null,"creator":null,"video_url":null,"description":"South Africa vs India, 1st Test, Day 3: Five-Star Mohammed Shami Puts Visitors In Driver's Seat Agai..  NDTVSports.comIndia vs South Africa 1st Test Score Updates, Day 3 Highlights: India 16/1 at stumps, lead South Africa by 146 runs  Times of IndiaProteas vs India | 1st TEST HIGHLIGHTS | DAY 1 | FREEDOM TEST SERIES, Supersport Park, 26 Dec 2021  Cricket South AfricaSA vs IND Centurion Weather Today, India tour of South Africa 2021, Day 3, 1st Test  Cricket AddictorNominees for ICC Men's Test Player of the Year revealed  International Cricket CouncilView Full coverage on Google News","content":null,"pubDate":"2021-12-28 16:34:24","image_url":null,"source_id":"google"},{"title":"The Ashes: England disaster in Australia means heads have to roll at the ECB - Daily Mail","link":"https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9zcG9ydC9jcmlja2V0L2FydGljbGUtMTAzNTAzMDMvVGhlLUFzaGVzLUVuZ2xhbmQtZGlzYXN0ZXItQXVzdHJhbGlhLW1lYW5zLWhlYWRzLXJvbGwtRUNCLmh0bWzSAQA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"The Ashes: England disaster in Australia means heads have to roll at the ECB  Daily MailAshes: England never stood a chance in Australia - Jonathan Agnew  BBC SportA post-mortem of English cricket | How the domestic game and schedule need to change | The Ashes  BT SportEngland cricket team didn’t stand a chance against Australia  The GuardianEngland's Ashes surrender is a national shame - heads must roll starting with ECB chief  The MirrorView Full coverage on Google News","content":null,"pubDate":"2021-12-28 16:15:01","image_url":null,"source_id":"google"},{"title":"Cricket-Shami gives India the advantage with five-wicket haul","link":"https://www.thestar.com.my/sport/cricket/2021/12/28/cricket-shami-gives-india-the-advantage-with-five-wicket-haul","keywords":null,"creator":null,"video_url":null,"description":"PRETORIA (Reuters) - Seamer Mohammed Shami took 5-44 and moved to 200 wickets in test cricket as India bowled hosts South Africa out for 197 in their first innings 40 minutes before the close on the third day of the first test on Tuesday. Read full story","content":null,"pubDate":"2021-12-28 15:50:00","full_description":"PRETORIA (Reuters) - Seamer Mohammed Shami took 5-44 and moved to 200 wickets in test cricket as India bowled hosts South Africa out for 197 in their first innings 40 minutes before the close on the third day of the first test on Tuesday. South Africa trail India’s first-innings score of 327 by 130 runs as they had little answer to the accuracy of the tourists’ seam attack at Centurion Park. Only Temba Bavuma managed to keep the visitors at bay for any length of time in a knock of 52. All the Indian seamers were among the wickets on a lively pitch that offered sideways movement and steep bounce, Jasprit Bumrah (2-16) weighing in with a couple despite rolling his ankle. Seventeen wickets have fallen in under three sessions after the entire second day was washed out due to rain. (Reporting by Nick Said, editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/28/1423365.jpg","source_id":"thestar_my"},{"title":"Most dismissals by a wicketkeeper in Tests: Rishabh Pant breaks MS Dhoni’s record in IND vs SA Centurion Test","link":"https://thesportsrush.com/cricket-news-most-dismissals-by-a-wicketkeeper-in-tests-rishabh-pant-breaks-ms-dhonis-record-in-ind-vs-sa-centurion-test/","keywords":["Cricket","India tour of South Africa 2021-22","MS Dhoni","rishabh pant"],"creator":["Gurpreet Singh"],"video_url":null,"description":"Most dismissals by a wicketkeeper in Tests: Rishabh Pant reaches milestone of 100 Test dismissals during Boxing Day Test match at Centurion. During the third day of the ongoing India versus South Africa first Test match at SuperSport Park in Centurion, India’s wicketkeeper- batter Rishabh Pant has reached a rare milestone by becoming the fastest… The post Most dismissals by a wicketkeeper in Tests: Rishabh Pant breaks MS Dhoni’s record in IND vs SA Centurion Test appeared first on The SportsRush.","content":"Most dismissals by a wicketkeeper in Tests: Rishabh Pant reaches milestone of 100 Test dismissals during Boxing Day Test match at Centurion. During the third day of the ongoing India versus South Africa first Test match at SuperSport Park in Centurion, India’s wicketkeeper- batter Rishabh Pant has reached a rare milestone by becoming the fastest Indian wicketkeeper (men) to reach 100 Test dismissals. It happened in the 47th Over of the South African innings, when Pant took a regulation catch off Mohammad Shami to get rid of the set Temba Bavuma (52), to add to the woes of the home side. With this catch, it took the 24-year-old to reach the milestone in just his 26th Test match and has, in the process eclipsed former India captain MS Dhoni by becoming the fastest wicketkeeper to achieve the feat. Dhoni had scalped his 100th Test dismissal from behind the stumps in his 36th Test match for India. A century of dismissals for @RishabhPant17 from behind the stumps in whites He becomes the fastest Indian wicket-keeper to achieve this feat.#SAvIND pic.twitter.com/6pHpfnLDO1 — BCCI (@BCCI) December 28, 2021 Most dismissals by a wicketkeeper in Tests Before this, the record (for quickest 100 dismissals in Tests for India) was jointly held by MS Dhoni and Wriddhiman Saha who had achieved the feat in 36 Tests each in Indian colours. Kiran More (39 Tests), Nayan Mongia (41 Tests), and Syed Kirmani (42 Tests) are the next three wicketkeeper-batters to follow in the list. As far as the all-time list of most dismissals by a wicketkeeper in Tests are concerned, the former Proteas wicketkeeper Mark Boucher tops the chart with 555 dismissals in 147 Tests for South Africa. Below him are Australia’s Adam Gilchrist (416 dismissals in 96 Tests), Ian Healy (395 dismissals in 119 Tests), Rod Marsh (355 dismissals in 96 Tests), and India’s MS Dhoni (294 dismissals in 90 Tests). List of most dismissals by a wicketkeeper in Tests (top 10) Position Player Country Matches Innings Dismissals Catches Stumping 1 Mark Boucher South Africa 147 281 555 532 23 2 Adam Gilchrist Australia 96 191 416 379 37 3 Ian Healy Australia 119 224 395 366 29 4 RW Marsh Australia 96 182 355 343 12 5 MS Dhoni India 90 166 294 256 38 6 Brad Haddin Australia 66 128 270 262 8 7 Peter Dujon West Indies 81 150 270 265 5 8 APE Knott England 95 174 269 250 19 9 Bradley-John Watling New Zealand 75 127 265 257 8 10 Matt Prior England 79 146 256 243 13 For more Cricket- related news, click here.   The post Most dismissals by a wicketkeeper in Tests: Rishabh Pant breaks MS Dhoni’s record in IND vs SA Centurion Test appeared first on The SportsRush.","pubDate":"2021-12-28 15:19:30","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Who will win today Big Bash match: Who is expected to win Sydney Sixers vs Brisbane Heat BBL 11 match?","link":"https://thesportsrush.com/cricket-news-who-will-win-today-big-bash-match-who-is-expected-to-win-sydney-sixers-vs-adelaide-strikers-bbl-11-match/","keywords":["Cricket","BBL 11","Big Bash Prediction","Sixers vs Heat"],"creator":["Rishikesh Sharma"],"video_url":null,"description":"Sydney Sixers vs Brisbane Heat: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Sydney Sixers will lock horns against Brisbane Heat in the 25th game of the ongoing BBL11. The match will be played at the Sydney Cricket Ground in Sydney. Defending champions Sydney Sixers have won five of… The post Who will win today Big Bash match: Who is expected to win Sydney Sixers vs Brisbane Heat BBL 11 match? appeared first on The SportsRush.","content":"Sydney Sixers vs Brisbane Heat: The SportsRush brings you the analysis and match-prediction of the Big Bash League game. Sydney Sixers will lock horns against Brisbane Heat in the 25th game of the ongoing BBL11. The match will be played at the Sydney Cricket Ground in Sydney. Defending champions Sydney Sixers have won five of their six games, whereas the Heat have won two of their six. The game will be live on Sony Six from 12:35 PM IST on 29 December 2021. Who will win today Big Bash match: Sydney Sixers vs Brisbane Heat Pitch Report The pitch has been absolutely brilliant for batting this season. Three games have been played here in BBL 11, and the pitch has been a batting beauty on both occasions. Sydney Sixers preview The defending champions Sydney Sixers have won five of their six games, and they defeated Sydney Thunder in the last one. Josh Philippe is the highest run-scorer of the season so far, whereas Moises Henriques is the 3rd highest. The form of James Vince is a concern, but he is a quality player. Ben Dwarshius, Sean Abbott, and Hayden Kerr will lead the pace attack, whereas Lloyd Pope will take care of spin. Shadab Khan will make his Sixers debut in this game. Probable XI: Josh Philippe, James Vince, Moises Henriques, Daniel Hughes, Jordan Silk, Daniel Christian, Shadab Khan, Sean Abbott, Ben Dwarshius, Lloyd Pope, Hayden Kerr. The BIGGEST match-up of all The BBL all time leading wicket taker goes head to head against the BBL all time leading run scorer tomorrow night at the SCG Who will make the BIGGEST impact tomorrow night? #BBL11 pic.twitter.com/yrZuntqCoN — Sydney Sixers (@SixersBBL) December 28, 2021 Brisbane Heat preview The Brisbane Heat have won just two of their six games so far. Sam Heazlett and Ben Duckett are in brilliant form with the bat, whereas Lynn also scored a half-century in the last game. The form of Max Bryant, Tom Cooper, and Jimmu Pierson is a worry for this side. Mark Steketee and James Bazley are their main pacers, whereas Liam Guthrie is also a big asset. Mujeeb ur Rahman has failed to take wickets this season. Probable XI: Chris Lynn, Max Bryant, Tom Cooper, Ben Duckett, Sam Heazlett, Jimmy Peirson, James Bazley, Matthew Kuhnemann, Mujeeb ur Rahman, Mark Steketee, Liam Guthrie. Match Prediction Sydney Sixers will be the favourites to win this game. The post Who will win today Big Bash match: Who is expected to win Sydney Sixers vs Brisbane Heat BBL 11 match? appeared first on The SportsRush.","pubDate":"2021-12-28 14:30:54","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Is Bumrah injured: When will J Bumrah bowl on Day 3 of IND vs SA Centurion Test?","link":"https://thesportsrush.com/cricket-news-is-bumrah-injured-when-will-j-bumrah-bowl-on-day-3-of-ind-vs-sa-centurion-test/","keywords":["Cricket","India Cricket Team","India","India tour of South Africa 2021-22","Jasprit Bumrah","South Africa"],"creator":["Dixit Bhargav"],"video_url":null,"description":"When will J Bumrah bowl: The Indian fast bowler had suffered an ankle sprain while bowling at the SuperSport Park today. During the third day of the first Test of the ongoing India’s tour of South Africa in Centurion, India fast bowler Jasprit Bumrah suffered a major injury scare in the form of a right… The post Is Bumrah injured: When will J Bumrah bowl on Day 3 of IND vs SA Centurion Test? appeared first on The SportsRush.","content":"When will J Bumrah bowl: The Indian fast bowler had suffered an ankle sprain while bowling at the SuperSport Park today. During the third day of the first Test of the ongoing India’s tour of South Africa in Centurion, India fast bowler Jasprit Bumrah suffered a major injury scare in the form of a right ankle sprain. Bowling his sixth over in the afternoon session, Bumrah twisted his ankle in his follow through. In severe pain initially, Bumrah got up on his own feet but only to walk off the ground. Bumrah, who didn’t even complete his over, returned to the field in the 35th over. In the meantime, Bumrah was seen receiving medical attention from physiotherapist Nitin Patel. While there was a footage of Bumrah’s bandaged ankle at one point in time, the 28-year old player was subsequently seen walking towards the nets. It was only after a complete assessment of the extent of injury that Bumrah returned to the field at the SuperSport Park. When will J Bumrah bowl on Day 3 of IND vs SA Centurion Test? Despite fielding for some 14 overs, Bumrah hasn’t been asked to bowl by captain Virat Kohli. Bumrah, who was off the ground for around 106 minutes, will have to serve the same period (106 minutes or so) on the ground as a fielder before being allowed to bowl by the umpires. For those who watched Bumrah returning to the field in the second session, the first thing that Bumrah did upon his return was discuss the same with the umpires. It is noteworthy that former India all-rounder and batting coach Sanjay Bangar had disclosed the same while commentating on the game for Star Sports 1 Hindi. ICC’s (International Cricket Council) playing conditions are such that players with internal injuries can’t resume bowling immediately upon returning to the ground. Bumrah’s ankle sprain is categorized as an internal injury. While the exact time remains unknown, Bumrah is expected to bowl around 08:20 PM (IST). Hence, expect Kohli to use him for a brief spell before stumps today. In the 5.5 overs that Bumrah has bowled in this innings, he has conceded just 12 runs including a maiden and a prized wicket of South Africa captain Dean Elgar (1) in the first over itself. The post Is Bumrah injured: When will J Bumrah bowl on Day 3 of IND vs SA Centurion Test? appeared first on The SportsRush.","pubDate":"2021-12-28 14:23:49","full_description":null,"image_url":null,"source_id":"thesportsrush"},{"title":"Cricket-Root should step down as England captain, says Boycott","link":"https://www.thestar.com.my/sport/cricket/2021/12/28/cricket-root-should-step-down-as-england-captain-says-boycott","keywords":null,"creator":null,"video_url":null,"description":"(Reuters) - Joe Root must step down as England captain after his team's meek surrender in Melbourne ensured Australia retained the Ashes, former England batsman Geoffrey Boycott said on Tuesday. Read full story","content":null,"pubDate":"2021-12-28 14:11:00","full_description":"(Reuters) - Joe Root must step down as England captain after his team's meek surrender in Melbourne ensured Australia retained the Ashes, former England batsman Geoffrey Boycott said on Tuesday. Australia's commanding victory in the third test by an innings and 14 runs gave the hosts an unassailable 3-0 lead in the series. England were heavily criticised after their second-innings capitulation, with former captain Ian Botham saying he was \"embarrassed\" to see them lose the Ashes in only 12 days of test cricket. \"Now Australia are 3-0 up and the Ashes have gone, will Root please stop saying Australia are not much better than us? I don't mind him living in cuckoo land but stop trying to kid us,\" Boycott wrote in his column in The Telegraph. \"If he really believes what he says then maybe it is time he gave up the captaincy of the England cricket team. The facts are staring us all in the face, except Joe doesn't want to see it. England can't bat. Our bowling is ordinary.\" Boycott said many of Root's decisions were wrong, such as batting first on a seamer-friendly pitch at the Gabba while leaving out James Anderson and Stuart Broad who have over 1,100 test wickets between them. \"It's every cricketer's dream to captain England and Joe has had 59 test matches to mould and stamp his authority on this set of players. He has had 13 tests against Australia with only two wins and nine losses,\" Boycott said. \"Nobody would want to give up the captaincy, but it is not about Joe -- it is about getting guys to perform better.\" (Reporting by Rohith Nair in Bengaluru; Editing by Ed Osmond)","image_url":"https://apicms.thestar.com.my/uploads/images/2021/12/28/1423171.jpg","source_id":"thestar_my"},{"title":"‘Embarrassing’: former players lament England’s Ashes humiliation - The Guardian","link":"https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIxL2RlYy8yOC9lbWJhcnJhc3NpbmctZXgtcGxheWVycy1hbmQtZmFucy1sYW1lbnQtZW5nbGFuZHMtYXNoZXMtZGVmZWF00gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"‘Embarrassing’: former players lament England’s Ashes humiliation  The GuardianAshes MCG: England cricket stars are blasted for hiding in the dressing room after loss to Australia  Daily MailAshes: England legends Ian Botham and Michael Vaughan react to 'embarrassing' defeat to Australia  Metro.co.uk‘Embarrassing’ England plumb new depths in worst Ashes defeat yet  The IndependentAshes Panel: England batting woes merit county game overhaul, says Michael Atherton  Sky SportsView Full coverage on Google News","content":null,"pubDate":"2021-12-28 14:00:00","image_url":null,"source_id":"google"},{"title":"Ashes Panel: 'Out of his depth' Silverwood set for the chop?","link":"https://www.skysports.com/cricket/news/12040/12505157/ashes-panel-rob-key-says-chris-silverwood-looks-out-of-his-depth-as-england-head-coach","keywords":null,"creator":null,"video_url":null,"description":"Head coach Chris Silverwood is in the firing line after England's painful Ashes series defeat - and he was not spared on the latest Sky Sports Cricket Podcast.","content":null,"pubDate":"2021-12-28 13:25:00","full_description":"Last Updated: 28/12/21 1:46pm Head coach Chris Silverwood is in the firing line after England's painful Ashes series defeat - and he was not spared on the latest Sky Sports Cricket Podcast. Rob Key believes Silverwood - whose side have lost nine of their last 12 Tests - has looked \"out of his depth\" having been asked to take on the dual role of coach and national selector. Nasser Hussain feels the former Essex coach is \"incredibly vulnerable\", while Michael Atherton says he would be surprised if Silverwood survives in the wake of an Ashes tour that is spiralling out of control. Read on for the pundits' thoughts on the under-pressure England boss or listen as part of the podcast… \"In interviews, with decisions and everything that has happened, Silverwood looks so out of his depth. \"When [managing director of cricket] Ashley Giles turned round to him and said, 'I am getting rid of Ed Smith as national selector, you are now in charge of everything', I hope he got paid well! \"It put him in a position he is just not capable of. I don't know many coaches that would have been capable of it. \"You probably needed one of the most astute, one of the blokes with the most amount of credibility, who knew more about Test cricket than anyone else \"The captain, Joe Root, needed help, was crying out for help, and I don't think Silverwood has been that man at any stage. \"Some of this did happen when Ed Smith was a selector, don't get me wrong, but Silverwood is so out of his depth. \"With a coach, it's about what a captain needs. Eoin Morgan is fine with a Silverwood because Morgan is brilliant leader. \"I would love to see how Root would get on with a Ricky Ponting, a Mahela Jayawardene, a Gary Kirsten, a Stephen Fleming. Someone who knows the game inside out.\" Please use Chrome browser for a more accessible video player \"When England went down the rotation policy at the start of the year, Athers sat on one of our podcasts and said let's judge Silverwood by results at the end of year. \"Well, England have lost nine Test matches, their worst-ever year. Those results speak for themselves so I think he is incredibly vulnerable. \"Also, are cricketers getting better under this set-up or are they getting worse? I definitely don't see them getting better, especially in the batting. \"When you take on that role as head selector and the accountability stops at your door, you had better make sure you win games and make good decisions. Some of the decisions have been shocking. Nasser Hussain \"Australia have played the right side throughout. England are selecting the right sides but at the wrong venues. The decision making on this tour has been abysmal - and not just on this tour. \"You go back to Ahmedabad against India earlier this year with four seamers under lights and then 28 of the 30 wickets fell to spin and the game was over in two days. There is a history of errors with decisions. \"You go back to Lord's against New Zealand in June when there was a full house and the potential of a run chase, yet Root and Silverwood felt we were not good enough to even try to chase a score down. That tells you something about where this team thinks they are mentally. \"There are mitigating circumstances. England play more Test cricket than anyone else and the coach does, in Covid times, need to look after the mental wellbeing of his players. \"He has done that and I applaud him for that but it has left him in a very precarious position. We all know you are judged on results and performances and both have been shocking this year.\" Please use Chrome browser for a more accessible video player \"I can't see a situation where Silverwood will survive this tour. All the responsibility lies with him as that's the way Giles has set things up. \"Previously you had the national selector and that responsibility was slightly diffused. You didn't quite know who to blame as you had the captain, the coach and the national selector. \"But the way Giles has set things up, there is only one man to blame, even though there are deeper issues than the blame game. \"The danger now is you go down this football route. If you pile all the responsibility and accountability on one man then if and when things go wrong, that is what will happen. \"That's what happens in football, where you get this merry-go-round of losing managers every time there is a downturn in results. I think that is an unhealthy situation to have. \"As I say, I don't think Silverwood will survive this tour but I think it was a strategic mistake to make the change Giles made by getting ride of a national selector and loading all this responsibility onto one man. \"I think there is an absence of authority more generally at the ECB. It's an ECB without a chairman and they have one or two issues off the field which have been well-publicised. \"Now the downturn in The Ashes is throwing a spotlight on the authority at the heart of the England team with Silverwood, Root, who is at the end of his cycle, and Giles, who is making the strategic decisions. \"I think there are real problems at the heart of the ECB with what you might call the authority - or the lack of authority.\"","image_url":"https://e2.365dm.com/21/12/1920x1080/skysports-chris-silverwood_5622518.jpg?20211221191749","source_id":"skysports"},{"title":"ICC Awards: Ashwin, Root, Jamieson, Karunaratne Nominated For Men's Test Player Of The Year 2021","link":"https://www.sentinelassam.com/sports/cricket/icc-awards-ashwin-root-jamieson-karunaratne-nominated-for-mens-test-player-of-the-year-2021-570236","keywords":["Breaking News,News,Sports,Feature,News Ticker,Cricket"],"creator":["Sentinel Digital Desk"],"video_url":null,"description":"The candidates for the ICC Men's Test Player of the Year 2021 were released by the International Cricket Council on Tuesday, with India's Ravichandran Ashwin among them.","content":"NEW DELHI: The candidates for the ICC Men's Test Player of the Year 2021 were released by the International Cricket Council on Tuesday, with India's Ravichandran Ashwin among them. Other contenders were England's Joe Root, New Zealand's Kyle Jamieson, and Sri Lanka's Dimuth Karunaratne.In 2021, Ravichandran Ashwin, a right-handed Indian batsman and one of the finest match-winners in the longer format, reasserted his status as one of the best spinners in the globe. Apart from his ball-handling skills, Ashwin made a significant contribution to the bat. In eight matches, the Indian spinner got 52 wickets at an average of 16.23 and scored 337 runs at 28.08 with one century. England's Test captain Joe Root was nominated for the award after amassing 1,708 runs in 15 matches in 2021, including six hundreds.Only Mohammad Yousuf and Sir Vivian Richards have scored more than 1,700 runs in a calendar year than Joe Root in 2021.Kyle Jamieson of New Zealand is the other candidate, having taken 27 wickets in five matches at an average of 17.51 overs. In 2021, he also became one of cricket's most promising fast bowling prospects.With 902 runs at 69.38 and four hundreds in seven matches, Sri Lankan Test skipper Dimuth Karunaratne is the penultimate contender for the award.A stunning century against South Africa in Johannesburg, two hundreds against Bangladesh in two matches at Pallekele, including a doubleton, and a century against the West Indies in Galle are among Karunaratne's highlights this year.Also Read: From Death of Dictator to Cataclysmic Quakes: Nostradamus Predicted Dire Events for 2022Also Watch: ","pubDate":"2021-12-28 13:24:11","full_description":"NEW DELHI: The candidates for the ICC Men's Test Player of the Year 2021 were released by the International Cricket Council on Tuesday, with India's Ravichandran Ashwin among them. Other contenders were England's Joe Root, New Zealand's Kyle Jamieson, and Sri Lanka's Dimuth Karunaratne. In 2021, Ravichandran Ashwin, a right-handed Indian batsman and one of the finest match-winners in the longer format, reasserted his status as one of the best spinners in the globe. Apart from his ball-handling skills, Ashwin made a significant contribution to the bat. In eight matches, the Indian spinner got 52 wickets at an average of 16.23 and scored 337 runs at 28.08 with one century. England's Test captain Joe Root was nominated for the award after amassing 1,708 runs in 15 matches in 2021, including six hundreds. Only Mohammad Yousuf and Sir Vivian Richards have scored more than 1,700 runs in a calendar year than Joe Root in 2021. Kyle Jamieson of New Zealand is the other candidate, having taken 27 wickets in five matches at an average of 17.51 overs. In 2021, he also became one of cricket's most promising fast bowling prospects. With 902 runs at 69.38 and four hundreds in seven matches, Sri Lankan Test skipper Dimuth Karunaratne is the penultimate contender for the award. A stunning century against South Africa in Johannesburg, two hundreds against Bangladesh in two matches at Pallekele, including a doubleton, and a century against the West Indies in Galle are among Karunaratne's highlights this year. Also Read: From Death of Dictator to Cataclysmic Quakes: Nostradamus Predicted Dire Events for 2022 Also Watch:","image_url":"https://assets.sentinelassam.com/h-upload/2021/12/28/289421-6h3s69k8ashwin-afp625x30025december21.jpg","source_id":"sentinel"},{"title":"OS-W vs AH-W Dream11 Prediction: Fantasy Cricket Tips, Today's Playing 11s and Pitch Report for Women's Super Smash T20 2021-22, Match 29","link":"https://www.sportskeeda.com/fantasy-cricket-mantra/os-w-vs-ah-w-dream11-prediction-fantasy-cricket-tips-today-s-playing-11s-pitch-report-women-s-super-smash-t20-2021-22-match-29?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda","keywords":["Fantasy Cricket Mantra"],"creator":["Azhar"],"video_url":null,"description":null,"content":null,"pubDate":"2021-12-28 13:19:59","full_description":"Otago Sparks Women (OS-W) will be up against Auckland Hearts Women (AH-W) in the 16th match of the Women’s Super Smash T20 2021-22 on Wednesday at the John Davies Oval in Queenstown. Otago Sparks have been on a roll in the Super Smash this season. They are second in the points table, with five wins in six games. They are coming into this game off a 66-run defeat against table-toppers Wellington Firebirds, though. Meanwhile, Auckland Hearts have had a mediocre campaign thus far this season. They are third in the standings, with two victories and as many defeats. They too lost their previous game, against Central Hinds by 14 runs. Emma Black, Caitlin Blakely, Eden Carson, Suzie Bates (C), Katey Martin (WK), Molly Loe, Polly Inglis , Bella James, Sophie Oldershaw, Kate Ebrahim , Olivia Gain. Anna Peterson, Lauren Down (C), Bella Armstrong, Katie Perkins, Holly Huddleston , Arlene Kelly, Isabella Gaze (WK), Saachi Shahri, Jesse Prasad, Molly Penfold, Fran Jonas. Match : Otago Sparks Women vs Auckland Hearts Women. Date and Time : Wednesday, 29th December 2021; 3:40 AM IST. Venue : John Davies Oval, Queenstown. The wicket at the John Davies Oval in Queenstown is conducive for batters. There is enough bounce on the surface, enabling batters to go for their shots and score runs. However, pacers also get some movement in the initial stages. Katie Martin: Martin has been one of the most consistent batters in the tournament. She is the second-highest run-getter for Otago Sparks this campaign. She has scored 136 run, and has also made key contributions behind the stumps. Suzie Bates: Veteran New Zealand international Bates has marked his dominance in the tournament by scoring 241 runs in six games. The experienced batter has looked in fine form, and is a top pick for the OS-W vs AH-W dream11 team. Lauren Down: Down has led the Hearts from the front by playing key knocks with the bat. She can change gears as per the match situation, making her a wise pick in the batting department. Kate Ebrahim: Ebrahim is the leading bowler for the Otago Sparks this season. She is the highest wicket-taker so far with 11 wickets in six games, and has also scored quick runs down the order. Anna Peterson: Peterson has been decisive with the ball in her hand. She has picked up five wickets in four games at an economy of just around 5.00. Holly Huddleston: Huddleston is a top pick from the bowling department for today’s dream11 team. She has taken five wickets thus far, and will look to add a few more to her tally. Sophie Oldershaw: Oldershaw has impressed with her bowling exploits. She has picked up eight wickets in six games, and has an economy of 4.79. Kate Ebrahim: 437 points. Suzie Bates: 393 points. Katey Martin: 302 points. Sophie Oldershaw: 300 points. Eden Carson: 292 points. Kate Ebrahim: 6 matches, 11 wickets. Suzie Bates: 6 matches, 241 runs. Katey Martin: 6 matches, 136 runs. Sophie Oldershaw: 6 matches, 8 wickets. Eden Carson: 6 matches, 7 wickets. Fantasy Suggestion #1 : Katey Martin, Suzie Bates, Lauren Down, Anna Peterson, Kate Ebrahim, Sophie Oldershaw, Holly Huddleston, Katie Perkins, Eden Carson, Fran Jonas, Molly Loe. Captain: Suzie Bates. Vice-Captain: Kate Ebrahim. Fantasy Suggestion #2 : Katey Martin, Suzie Bates, Lauren Down, Anna Peterson, Kate Ebrahim, Sophie Oldershaw, Holly Huddleston, Polly Inglis, Saachi Shahri, Arlene Kelly, Emma Black. Captain: Anna Peterson. Vice-Captain: Sophie Oldershaw.","image_url":"https://static.sportskeeda.com/editor/2021/12/261ea-16406950160079-1920.jpg","source_id":"sportskeeda"},{"title":"India vs South Africa Live Cricket Score, 1st Test, Day 3: Shardul Thakur Castles Quinton de Kock to Break - News18","link":"https://news.google.com/__i/rss/rd/articles/CBMi0AFodHRwczovL3d3dy5uZXdzMTguY29tL2NyaWNrZXRuZXh0L25ld3MvaW5kaWEtdnMtc291dGgtYWZyaWNhLWxpdmUtc2NvcmUtYm94aW5nLWRheS10ZXN0LWRheS0zLTIwMjEtMjItYmFsbC1ieS1iYWxsLWNyaWNrZXQtbWF0Y2gtdG9kYXktaGlnaGxpZ2h0cy1vbmxpbmUtaG90c3Rhci1saXZlLXN0cmVhbWluZy1pbmQtdnMtc2EtbGl2ZW5ld3MtNDYwMDA5MS5odG1s0gEA?oc=5","keywords":null,"creator":null,"video_url":null,"description":"India vs South Africa Live Cricket Score, 1st Test, Day 3: Shardul Thakur Castles Quinton de Kock to Break  News18Proteas vs India | 1st TEST HIGHLIGHTS | DAY 1 | FREEDOM TEST SERIES, Supersport Park, 26 Dec 2021  Cricket South AfricaIndia vs South Africa 1st Test Live Score Updates, Day 3: South Africa 109/5 at tea break against India  Times of IndiaIndia strike back after first innings collapse  Deccan Herald'Bats Beautifully Till he Gets Out': Wasim Jaffer on Virat Kohli's Lean Phase  News18View Full coverage on Google News","content":null,"pubDate":"2021-12-28 13:06:36","image_url":null,"source_id":"google"}]}